{"data":{"movies":[{"title":"You Don't Mess with the Zohan","originalTitle":"","year":"2008","releaseDate":"20080606","directors":[{"name":"Dennis Dugan","id":"nm0240797"}],"writers":[{"name":"Adam Sandler","id":"nm0001191"},{"name":"Robert Smigel","id":"nm0806912"}],"runtime":"113 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE2MzEzNDc5M15BMl5BanBnXkFtZTcwMzYxOTA3MQ@@._V1.jpg","countries":["USA"],"languages":["English","Hebrew"],"genres":["Action","Comedy"],"plot":"Zohan Dvir works as a Special Agent and lives with his orthodox parents in Israel. He wants to give up this life full of dangerous encounters with Palestinians. While in the process of apprehending a Palestinian activist known simply as the Phantom, he fakes his death, hides in a dog-kennel on a plane bound for New York, and decides to try his hand as a hair-stylist. He is refused employment initially, but when he offers to work for free, Dahlia hires him as a cleaner. When a hair-stylist named Debbie quits, Zohan replaces her, winning over elderly female clientèle, and falling in love with Dahlia herself. Before Zohan could propose to her, Dahlia's landlord, Walbridge, who has been raising rents regularly, hires skinhead goons to terrorize the neighborhood, creates misunderstandings between Jews, Muslims, Arabs, and Palestinians, and drives them out, so as to enable him to construct a new building which is topped by a roller coaster. When Zohan decides to confront these skinheads, he...","simplePlot":"An Israeli Special Forces Soldier fakes his death so he can re-emerge in New York City as a hair stylist.","actors":[{"actorName":"Adam Sandler","urlProfile":"http://www.imdb.com/name/nm0001191","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyNzM2MjM1Ml5BMl5BanBnXkFtZTcwMDE5NjI3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1966","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Adam Richard Sandler","height":"5' 9½\" (1.77 m)","bio":"Adam Richard Sandler was born September 9, 1966 in Brooklyn, New York, to Judith (Levine), a teacher at a nursery school, and Stanley Alan Sandler, an electrical engineer. He is of Russian Jewish descent. At 17, he took his first step towards becoming a stand-up comedian when he spontaneously took the stage at a Boston comedy club. He found he was a natural comic. He nurtured his talent while at New York University (graduating with a Bachelor of Fine Arts degree in 1991) by performing regularly in clubs and at universities. During his freshman year, he snagged a recurring role as the Huxtable family's friend Smitty on The Cosby Show (1984). While working at a comedy club in L.A., he was \"discovered\" by Dennis Miller, who recommended him to Saturday Night Live (1975) producer Lorne Michaels and told him that Sandler had a big talent. This led to his being cast in the show in 1990, which he also wrote for in addition to performing. After Saturday Night Live (1975), Sandler went on to the movies, starring in such hit comedies as Airheads (1994), Happy Gilmore (1996), Billy Madison (1995) and Big Daddy (1999). He has also starred in Mr. Deeds (2002) alongside Winona Ryder; Eight Crazy Nights (2002), an animated movie about the Jewish festival of Chanukah; and Punch-Drunk Love (2002). He also writes and produces many of his own films and has composed songs for several of them, including The Wedding Singer (1998). Sandler has had several of his songs placed on the \"Billboard\" charts, including the classic \"The Chanukah Song\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyNzM2MjM1Ml5BMl5BanBnXkFtZTcwMDE5NjI3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001191","name":"Adam Sandler","nicknames":["Sandman"],"idIMDB":"nm0001191"},"actorId":"nm0001191","character":"Zohan","urlCharacter":"http://www.imdb.com/character/ch0067307","main":true},{"actorName":"John Turturro","urlProfile":"http://www.imdb.com/name/nm0001806","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYwNjgwMjMxMF5BMl5BanBnXkFtZTcwNjUwOTc3NQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 February 1957","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"John Michael Turturro","height":"6' 0½\" (1.84 m)","bio":"Highly talented, lightly built American actor who always looks unsettled and jumpy has become a favourite of cult/arthouse film aficionados with his compelling performances in a broad range of cinematic vehicles. Turturro was born in Brooklyn, New York, to Italian-American parents, Katherine, a jazz singer, and Nicholas Turturro, a construction worker and carpenter. His brother, also named Nicholas Turturro, is an actor, and actress Aida Turturro is his cousin. Turturro has become a regular in the thought provoking films of Spike Lee and the off the wall comedies of Joel Coen & Ethan Coen. His wonderful performances include as the highly agitated \"Pino\" in Do the Right Thing (1989), as an intellectual playwright in Barton Fink (1991), a pedophile tenpin bowler in The Big Lebowski (1998), a confused boyfriend in Jungle Fever (1991) and as the voice of Harvey the dog in Summer of Sam (1999). Turturro has continued to appeal to audiences despite his unconventional looks and the often annoying onscreen mannerisms of his characters which he used to great effect in films such as his blue collar tale of warring brothers in the construction business, Mac (1992), as the irate, dumped game show contestant, Herbie Stempel, in Robert Redford's dynamic Quiz Show (1994). One of modern American cinema's gems of acting, Turturro remains in strong demand for his high calibre thespian talents.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYwNjgwMjMxMF5BMl5BanBnXkFtZTcwNjUwOTc3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001806","name":"John Turturro","idIMDB":"nm0001806"},"actorId":"nm0001806","character":"Phantom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emmanuelle Chriqui","urlProfile":"http://www.imdb.com/name/nm0004825","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNTgzMDg5MF5BMl5BanBnXkFtZTcwMTQ3OTkzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1975","placeOfBirth":" Montreal, Quebec, Canada","birthName":"Emmanuelle Sophie Anne Chriqui","height":"5' 3\" (1.6 m)","bio":"Emmanuelle Chriqui was born in Montreal, Quebec, to Moroccan Jewish immigrants, Liliane (Benisty) and Albert Chriqui. Her family moved to Toronto when she was two years old. At the age of 10, Chriqui appeared in a McDonald's commercial. She moved to Vancouver, guest-starring in series such as Are You Afraid of the Dark? (1990), Le justicier des ténèbres (1992), Les repentis (1996) and Psi Factor, chroniques du paranormal (1996). Her first Hollywood role was in Detroit Rock City (1999). Her breakout performance came in 2000's Snow Day (2000), in which she played the foxy \"Claire Bonner\". She appeared in rock band Hinder's \"Lips of an Angel\" music video in 2006. Emmanuelle later starred in several films and was nominated for a DVD Exclusive Award as Best Actress for her performance in 100 Girls (2000). She also starred in the movie, Adam and Eve (2005), opposite Cameron Douglas. Chriqui increased her visibility by playing \"Sloan\" on the HBO hit show, Entourage (2004), and by starring opposite Adam Sandler in You Don't Mess with the Zohan (2008). _ She reprised her role as \"Sloan\" in the 2015 full length feature of \"Entourage _\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNTgzMDg5MF5BMl5BanBnXkFtZTcwMTQ3OTkzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004825","name":"Emmanuelle Chriqui","idIMDB":"nm0004825"},"actorId":"nm0004825","character":"Dalia","urlCharacter":"http://www.imdb.com/character/ch0061768","main":true},{"actorName":"Nick Swardson","urlProfile":"http://www.imdb.com/name/nm0841910","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ5NDYzMTM5Nl5BMl5BanBnXkFtZTcwNjM0NDkwNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1976","placeOfBirth":" Minneapolis, Minnesota, USA","birthName":"Nicholas Swardson","height":"5' 8\" (1.73 m)","bio":"Nick Swardson was born on October 9, 1976 in Minneapolis, Minnesota, USA as Nicholas Swardson. He is an actor and writer, known for Just Go with It (2011), Grandma's Boy (2006) and You Don't Mess with the Zohan (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ5NDYzMTM5Nl5BMl5BanBnXkFtZTcwNjM0NDkwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0841910","name":"Nick Swardson","nicknames":["Swardy"],"idIMDB":"nm0841910"},"actorId":"nm0841910","character":"Michael","urlCharacter":"http://www.imdb.com/character/ch0089427","main":true},{"actorName":"Lainie Kazan","urlProfile":"http://www.imdb.com/name/nm0443577","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNjM1MTczN15BMl5BanBnXkFtZTYwNTA4MDc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 May 1940","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Lainie Levine","height":"5' 6\" (1.68 m)","bio":"Lainie Kazan was born Lainie Levine in Brooklyn, New York, to Carole (Kazan) and Ben Levine. She graduated from Hofstra University, in Hempstead, New York. Her film career began in Dayton's Devils (1968), starring alongside Leslie Nielsen. Later, Lainie was nominated a Golden Globe for Best Actress in a Supporting Role - Motion Picture for her performance in My Favorite Year (1982). Over the years, she made appearances as boisterous mother types. Notably in Beaches (1988), 29th Street (1991), and Mariage à la grecque (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNjM1MTczN15BMl5BanBnXkFtZTYwNTA4MDc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0443577","name":"Lainie Kazan","idIMDB":"nm0443577"},"actorId":"nm0443577","character":"Gail","urlCharacter":"http://www.imdb.com/character/ch0089428","main":true},{"actorName":"Ido Mosseri","urlProfile":"http://www.imdb.com/name/nm1504979","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGE2ZjVkMTctNWMyMi00MGMzLTk0YTUtOGM4NzBmZDhiMTRlXkEyXkFqcGdeQXVyMTYzNjE0NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1978","placeOfBirth":" Tel Aviv, Israel","bio":"Ido Mosseri was born on April 17, 1978 in Tel Aviv, Israel. He is an actor, known for You Don't Mess with the Zohan (2008), Bucky Larson: Born to Be a Star (2011) and The Jews Are Coming (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGE2ZjVkMTctNWMyMi00MGMzLTk0YTUtOGM4NzBmZDhiMTRlXkEyXkFqcGdeQXVyMTYzNjE0NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1504979","name":"Ido Mosseri","idIMDB":"nm1504979"},"actorId":"nm1504979","character":"Oori","urlCharacter":"http://www.imdb.com/character/ch0089429","main":true},{"actorName":"Rob Schneider","urlProfile":"http://www.imdb.com/name/nm0001705","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDE4MTE0MF5BMl5BanBnXkFtZTcwOTYyOTM3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1963","placeOfBirth":" San Francisco, California, USA","birthName":"Robert Michael Schneider","height":"5' 7\" (1.7 m)","bio":"Robert Michael \"Rob\" Schneider (born October 31, 1963) is an American actor, comedian, screenwriter, and director. A stand-up comic and veteran of the NBC sketch comedy series Saturday Night Live (1975), Schneider has gone on to a successful career in feature films, including starring roles in the comedy films Deuce Bigalow: Male Gigolo (1999), The Hot Chick (2002), and Grown Ups (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDE4MTE0MF5BMl5BanBnXkFtZTcwOTYyOTM3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001705","name":"Rob Schneider","idIMDB":"nm0001705"},"actorId":"nm0001705","character":"Salim","urlCharacter":"http://www.imdb.com/character/ch0089430","main":true},{"actorName":"Dave Matthews","urlProfile":"http://www.imdb.com/name/nm0559986","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3ODIzMTU0OF5BMl5BanBnXkFtZTcwNDY5MjI2Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1967","placeOfBirth":" Johannesburg, South Africa","birthName":"David John Matthews","height":"6' 2\" (1.88 m)","bio":"Dave Matthews was born on January 9, 1967 in Johannesburg, South Africa as David John Matthews. He has been married to Jennifer Ashley Harper since August 10, 2000. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3ODIzMTU0OF5BMl5BanBnXkFtZTcwNDY5MjI2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0559986","name":"Dave Matthews","idIMDB":"nm0559986"},"actorId":"nm0559986","character":"James","urlCharacter":"http://www.imdb.com/character/ch0089537","main":true},{"actorName":"Michael Buffer","urlProfile":"http://www.imdb.com/name/nm0119354","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NzY3NjkzOV5BMl5BanBnXkFtZTcwMDMzODYzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 November 1944","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"6' (1.83 m)","bio":"Michael Buffer was born on November 2, 1944 in Philadelphia, Pennsylvania, USA. He is an actor, known for Ready 2 Rumble Boxing: Round 2 (2000), Grudge Match (2013) and Man vs. Beast (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NzY3NjkzOV5BMl5BanBnXkFtZTcwMDMzODYzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0119354","name":"Michael Buffer","idIMDB":"nm0119354"},"actorId":"nm0119354","character":"Walbridge","urlCharacter":"http://www.imdb.com/character/ch0089538","main":true},{"actorName":"Charlotte Rae","urlProfile":"http://www.imdb.com/name/nm0705989","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNjAzMzUyNF5BMl5BanBnXkFtZTgwNDk0MjU2MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 April 1926","placeOfBirth":" Milwaukee, Wisconsin, USA","birthName":"Charlotte Rae Lubotsky","height":"5' 0½\" (1.54 m)","bio":"This Milwaukee native was born in 1926, where she was raised on a farm, with her two sisters (Beverly, Mimi), with Charlotte being the second of her three. Rae wanted to be a dramatic actress, but eventually wound up being a comedienne, all because of her stand-up comedy routines. After graduating from high school, she attended Northwestern University, where she met the unfamiliar actress Cloris Leachman, and would be best friends for life. She actually created the role of \"Beverly\" for Cloris to play on The Facts of Life (1979), all this was after Rae left the show. She dropped out of college and moved to New York City, and began a career as a stage actress, performing in such plays like: \"Pickwick\", when she was nominated in 1966 for Best Featured Actress in a Musical and, in 1969, for Best Actress in a Play for \"Morning, Noon and Night\". All this was after she co-starred with Fred Gwynne and Al Lewis in Car 54, Where Are You? (1961). She would live there up until 1974, at the time she moved to Los Angeles, this eventually led her to become an actress. She was nominated for an Emmy Award for her supporting role in the 1975 drama, Queen of the Stardust Ballroom (1975). After guest-starring on numerous shows, including Norman Lear's All in the Family (1971) and Good Times (1974), Lear hired her old friend to co-star on Diff'rent Strokes (1978) as Gary Coleman's housekeeper, \"Edna Garrett\". Within a year, she gained popularity with her character, which eventually led her to having her own series, The Facts of Life (1979). Between Norman Lear and NBC gave her greenlight to star in her own show, which focused primarily on a houselady, residing in an all-girls school, which was the exact opposite of \"Diff'rent Strokes\". This series featured rookie actresses Kim Fields as resident gossip \"Tootie\" and Lisa Whelchel as rich spoiled brat \"Blair Warner\". Before then, she approached young Mindy Cohn at Westlake School in Los Angeles, California, and suggested that she take the role of smart \"Natalie Green\", a character that Charlotte created for her, which was named after one of her best friends from high school, which successful, she did and stayed on the show for 8 seasons. Rae left the show in 1986, despite all the fame she had gained, owing to a health problem, who later returned to the stage, displeasing the show's producers. In 1992, she was the voice of \"Aunt Christine Figg\" in Tom and Jerry: The Movie (1992). She also appeared in \"The Vagina Monologues\" in New York. In 2000, she starred as \"Berthe\" in the Paper Mill Playhouse production of \"Pippin\". In 2007, she appeared in a cabaret show at the Plush Room in San Francisco for several performances. In the 2008 movie, You Don't Mess with the Zohan (2008), Rae has a role as an older woman who has a fling with Adam Sandler's character. On February 18, 2009, she appeared in a small role as \"Mrs. Ford\" on the \"I Heart Mom\" episode. Towards the end of the new millennium, Rae attended the James Stewart Centennial Tribute at the Samuel Goldwyn Theater in Beverly Hills, California, which was hosted by Robert Wagner. Among the attendees were Ann Rutherford, Shirley Jones, Cora Sue Collins, and Stewart's daughter, Kelly Stewart. Carroll Baker was also supposed to have attended the tribute, but if she did, she is nowhere to be found in the Academy's photos. Rae's older sister, Beverly, died from pancreatic cancer in 1998, her divorced husband of 35 years, John Strauss, had died, after a long battle of Parkinson's disease, in 2011. A pancreatic cancer survivor, around the same time after John's death, she continues to act while making guest appearances everywhere, especially TV Land, which her show, The Facts of Life (1979), won the award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNjAzMzUyNF5BMl5BanBnXkFtZTgwNDk0MjU2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0705989","name":"Charlotte Rae","nicknames":["Maude"],"idIMDB":"nm0705989"},"actorId":"nm0705989","character":"Mrs. Greenhouse","urlCharacter":"http://www.imdb.com/character/ch0089539","main":true},{"actorName":"Sayed Badreya","urlProfile":"http://www.imdb.com/name/nm0046223","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzg5OTE1OF5BMl5BanBnXkFtZTgwODI4ODAxNzE@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 January 1957","placeOfBirth":" Port Said, Egypt","birthName":"El Sayed Badreya","height":"5' 11\" (1.8 m)","bio":"Egyptian-born filmmaker and actor Sayed Badreya realized a childhood dream by winning roles in major Hollywood films such as The Insider, Three Kings, and Independence Day. Growing up in poverty in Port Said, Sayed Badreya's dreams of movie stardom looked as bleak as the prospect of peace in the Middle East. From the Six Day War in '67 through the Yom Kippur War in '73, his only escape from the world he knew was the movie theater, where films transported him to a magical land. But it was here that he determined he was destined to be a part of that magic. After attending New York University film school, and then moving to Hollywood, Sayed first worked in the film industry as an assistant to actor/director Anthony Perkins, and then with director James Cameron on True Lies. His mission - to make movies that told the Arabic- American story, since it had yet to be told - led to the creation of his own production company, Zoom In Focus. Under this banner, he directed and produced the documentary, Saving Egyptian Film Classics as well as The Interrogation, which won Best Creative Short Film at New York International Film Festival. He also produced and starred in Hesham Issawi's short, T for Terrorist, which was awarded Best Short Film at the Boston International Film Festival and the San Francisco World Film Festival. In 2007, he played his first leading role in the English language motion picture American East, a film that he also co-wrote. 2008 was Sayed Badreya's breakout year. He captivated audiences as Abu Bakaar, the villainous arms dealer who kidnaps Tony Stark (Robert Downey Jr.) in the summer's blockbuster Iron Man. Also that year, Sayed played the comedic Palestinian cab driver opposite Adam Sandler in You Don't Mess with the Zohan. This summer, Sayed can be seen in Paramount Pictures' feature film El traspatio aka Backyard, directed by Oscar-nominated Carlos Carrera in which he plays a serial killer opposite Ana de la Reguera. Sayed can also be seen this summer in Movie 43, where he plays opposite Halle Berry. Additional forthcoming films include The Three Stooges, his fifth film with the Farrelly brothers; The Dictator, playing Sascha Baron Cohen's father as the original Dictator, and Just Like a Woman, with Oscar nominated director Rachid Bouchareb. Also, Sayed is going to a new frontier in the new video game Uncharted 3, playing Ramses the Great Pirate Captain. Most recently he completed his second leading role in the New York independent feature, Cargo, about human traffickers, directed by Yan Vizinberg. And he just finished co-starring opposite Oscar-nominated actress Melissa Leo in film The Space Between, directed by Travis Fine. Sayed has also worked as an actor, Arabic dialect coach, and Islamic technical advisor on Path to 9/11, a $40 million mini-series about the events leading up to 9/11 produced by ABC/Touchstone. Sayed's efforts to bring attention to Arab-Americans in the motion picture industry have received much coverage over the years on radio, television, and in major publications around the world, such as The New York Times, GQ, NPR, ABC's \"Politically Incorrect\" with Bill Maher, BBC's \"Panorama,\" CNN, \"Fox Report with Shepard Smith\", The Hollywood Reporter and Egypt Today.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzg5OTE1OF5BMl5BanBnXkFtZTgwODI4ODAxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0046223","name":"Sayed Badreya","idIMDB":"nm0046223"},"actorId":"nm0046223","character":"Hamdi","urlCharacter":"http://www.imdb.com/character/ch0089542","main":true},{"actorName":"Daoud Heidami","urlProfile":"http://www.imdb.com/name/nm2821904","urlPhoto":"","biography":{"bio":"Daoud Heidami is an actor and producer, known for You Don't Mess with the Zohan (2008), Money Monster (2016) and Safe (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2821904","name":"Daoud Heidami","idIMDB":"nm2821904"},"actorId":"nm2821904","character":"Nasi","urlCharacter":"http://www.imdb.com/character/ch0089540","main":true},{"actorName":"Kevin Nealon","urlProfile":"http://www.imdb.com/name/nm0005265","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkyMDUzMjc4N15BMl5BanBnXkFtZTcwMzE3MDIwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1953","placeOfBirth":" St. Louis, Missouri, USA","height":"6' 4\" (1.93 m)","bio":"Kevin Nealon was born on November 18, 1953 in St. Louis, Missouri, USA. He is an actor and writer, known for Weeds (2005), Saturday Night Live (1975) and Blended (2014). He has been married to Susan Yeagley since September 3, 2005. They have one child. He was previously married to Linda Dupree.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkyMDUzMjc4N15BMl5BanBnXkFtZTcwMzE3MDIwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005265","name":"Kevin Nealon","idIMDB":"nm0005265"},"actorId":"nm0005265","character":"Kevin","urlCharacter":"http://www.imdb.com/character/ch0089543","main":true},{"actorName":"Robert Smigel","urlProfile":"http://www.imdb.com/name/nm0806912","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNTMwNDQyOF5BMl5BanBnXkFtZTcwMjUwNTQ3MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1960","placeOfBirth":" New York City, New York, USA","birthName":"Robert M. Smigel","height":"6' (1.83 m)","bio":"Robert Smigel was born on February 7, 1960 in New York City, New York, USA as Robert M. Smigel. He is a writer and producer, known for Saturday Night Live (1975), Late Night with Conan O'Brien (1993) and Hotel Transylvania (2012). He is married to Michelle Saks Smigel. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNTMwNDQyOF5BMl5BanBnXkFtZTcwMjUwNTQ3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0806912","name":"Robert Smigel","idIMDB":"nm0806912"},"actorId":"nm0806912","character":"Yosi","urlCharacter":"http://www.imdb.com/character/ch0089544","main":true},{"actorName":"Dina Doron","urlProfile":"http://www.imdb.com/name/nm0233972","urlPhoto":"","biography":{"bio":"Dina Doron is an actress, known for You Don't Mess with the Zohan (2008), Mariage tardif (2001) and Une histoire d'amour et de ténèbres (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0233972","name":"Dina Doron","idIMDB":"nm0233972"},"actorId":"nm0233972","character":"Zohan's Mother","urlCharacter":"http://www.imdb.com/character/ch0089545","main":true}],"seasons":[],"idIMDB":"tt0960144","urlIMDB":"http://www.imdb.com/title/tt0960144","business":{"budget":{"money":"$90,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$38,531,374","country":"USA","day":"08","month":"06","year":"2008","remarks":"3,462 Screens"},{"money":"£1,520,637","country":"UK","day":"17","month":"08","year":"2008","remarks":"367 Screens"},{"money":"$13,992","country":"Estonia","day":"03","month":"08","year":"2008","remarks":"3 Screens"},{"money":"RUR 28,022,660","country":"Russia","day":"22","month":"06","year":"2008","remarks":"290 Screens"}],"gross":[{"money":"$100,018,837","country":"USA","day":"07","month":"09","year":"2008","remarks":""},{"money":"$99,890,158","country":"USA","day":"31","month":"08","year":"2008","remarks":""},{"money":"$99,436,165","country":"USA","day":"17","month":"08","year":"2008","remarks":""},{"money":"$99,115,252","country":"USA","day":"10","month":"08","year":"2008","remarks":""},{"money":"$98,789,023","country":"USA","day":"03","month":"08","year":"2008","remarks":""},{"money":"$98,319,368","country":"USA","day":"27","month":"07","year":"2008","remarks":""},{"money":"$97,736,720","country":"USA","day":"20","month":"07","year":"2008","remarks":""},{"money":"$96,910,739","country":"USA","day":"13","month":"07","year":"2008","remarks":""},{"money":"$94,773,156","country":"USA","day":"06","month":"07","year":"2008","remarks":""},{"money":"$91,190,129","country":"USA","day":"29","month":"06","year":"2008","remarks":""},{"money":"$84,308,418","country":"USA","day":"22","month":"06","year":"2008","remarks":""},{"money":"$68,760,685","country":"USA","day":"15","month":"06","year":"2008","remarks":""},{"money":"$38,531,374","country":"USA","day":"08","month":"06","year":"2008","remarks":""},{"money":"£5,200,666","country":"UK","day":"07","month":"09","year":"2008","remarks":""},{"money":"£4,769,239","country":"UK","day":"31","month":"08","year":"2008","remarks":""},{"money":"£3,560,382","country":"UK","day":"24","month":"08","year":"2008","remarks":""},{"money":"£1,520,637","country":"UK","day":"17","month":"08","year":"2008","remarks":""},{"money":"RUR 74,257,039","country":"Russia","day":"13","month":"07","year":"2008","remarks":""},{"money":"RUR 68,807,353","country":"Russia","day":"06","month":"07","year":"2008","remarks":""},{"money":"RUR 55,821,935","country":"Russia","day":"29","month":"06","year":"2008","remarks":""},{"money":"RUR 28,022,660","country":"Russia","day":"22","month":"06","year":"2008","remarks":""}],"weekendGross":[{"money":"$109,517","country":"USA","day":"07","month":"09","year":"2008","remarks":"267 Screens"},{"money":"$152,571","country":"USA","day":"31","month":"08","year":"2008","remarks":"193 Screens"},{"money":"$222,716","country":"USA","day":"17","month":"08","year":"2008","remarks":"239 Screens"},{"money":"$194,963","country":"USA","day":"10","month":"08","year":"2008","remarks":"112 Screens"},{"money":"$269,321","country":"USA","day":"03","month":"08","year":"2008","remarks":"142 Screens"},{"money":"$385,400","country":"USA","day":"27","month":"07","year":"2008","remarks":"224 Screens"},{"money":"$365,667","country":"USA","day":"20","month":"07","year":"2008","remarks":"261 Screens"},{"money":"$1,071,854","country":"USA","day":"13","month":"07","year":"2008","remarks":"939 Screens"},{"money":"$1,981,251","country":"USA","day":"06","month":"07","year":"2008","remarks":"1,731 Screens"},{"money":"$3,175,214","country":"USA","day":"29","month":"06","year":"2008","remarks":"2,147 Screens"},{"money":"$7,453,215","country":"USA","day":"22","month":"06","year":"2008","remarks":"3,278 Screens"},{"money":"$16,370,344","country":"USA","day":"15","month":"06","year":"2008","remarks":"3,466 Screens"},{"money":"$38,531,374","country":"USA","day":"08","month":"06","year":"2008","remarks":"3,462 Screens"},{"money":"£139,677","country":"UK","day":"07","month":"09","year":"2008","remarks":"241 Screens"},{"money":"£420,761","country":"UK","day":"31","month":"08","year":"2008","remarks":"350 Screens"},{"money":"£781,953","country":"UK","day":"24","month":"08","year":"2008","remarks":"368 Screens"},{"money":"£1,520,637","country":"UK","day":"17","month":"08","year":"2008","remarks":"367 Screens"}],"admissions":[{"money":"107,279","country":"Netherlands","day":"31","month":"12","year":"2008","remarks":""}],"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 53 min (113 min)","1 hr 53 min (113 min) (USA)"],"soundMix":["SDDS","Dolby Digital","DTS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Genesis HD Camera"],"laboratory":["DeLuxe, Hollywood (CA), USA (prints)"],"filmLength":["2,965 m (Portugal, 35 mm)","3,079 m (Sweden)"],"negativeFormat":["35 mm (Kodak Vision3 500T 5219)","Video (HDTV)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","HDCAM SR (1080p/24) (source format)","Spherical (source format)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)"]},"rating":"5.5","metascore":"54","filmingLocations":[{"location":"Cabo San Lucas, Baja California Sur, Mexico"}],"rated":"PG-13","awards":[{"award":"BMI Film & TV Awards 2009","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"","names":[{"name":"Rupert Gregson-Williams","id":"nm0340003","role":null}]}]}]},{"award":"Kids' Choice Awards, Australia 2009","titlesAwards":[{"titleAwardOutcome":"Won Blimp Award","categories":[{"category":"Fave Movie Star","names":[{"name":"Adam Sandler","id":"nm0001191","role":null},{"name":"Bedtime Stories","id":"tt0960731","role":null}]}]}]},{"award":"Teen Choice Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Summer Movie: Comedy","names":[]}]}]}],"votes":"162,216","type":"Movie","companyCreditsSimple":[{"idCompany":"co0071509","name":"Columbia Pictures"},{"idCompany":"co0142678","name":"Relativity Media"},{"idCompany":"co0059609","name":"Happy Madison Productions"}],"keywords":{"keywords":["hair stylist","palestinian","jew","muslim","landlord","soldier","new york city","israeli","co written by actor","woman's bare butt","butt naked","naked butt","bare butt","naked woman","buttocks","rear female nudity","female nudity","rear nudity","female full rear nudity","arab israeli","arab jewish friendship","sex scene","six word title","erectile dysfunction","claim in title","nightclub","disarming someone","fistfight","violence","krav maga","hand to hand combat","combat","machine gun","pistol","showdown","gunfight","shootout","commando mission","commando","american","roundhouse kick","taxi","special forces","israeli martial arts","martial arts","cameo appearance","actor playing himself","hero","villain","comic hero","comic violence","blue panties","red panties","panties","arab stereotype","funny arab","sex with a client","quickie","large penis","promiscuous mother","father son relationship","mother daughter relationship","lingerie slip","manhattan new york city","rear entry sex","older woman younger man relationship","bare chested male","training","threatened with a knife","subtitled scene","stabbed in the leg","stabbed in the back","spray paint","severed hand","push ups","punched in the face","punched in the stomach","park","night watch","national anthem","mother son relationship","molotov cocktail","mall","male rear nudity","loud sex","knife in back","kicked in the face","kicked in the stomach","jumping from a rooftop","jumping through a window","hand cut off","grenade","flashback","female rear nudity","faking own death","explosion","disembodied hand","community","commercial","car accident","breast implant","bomb","beating","redneck","racist","punctuation in title","apostrophe in title","racial overtones","dreadlocks","cow","large buttocks","arab israeli conflict","parkour","war veteran","vacation","terrorist","tel aviv israel","taxi driver","superhuman","super strength","spit in the face","singer","secret identity","salon","revenge","pubic hair","presumed dead","policeman","ping pong","pet","pet cat","penis","ointment","mossad","middle east","reference to mariah carey","male nudity","magnate","intelligence agent","helicopter","hairdresser","haircut","goat","food chain","father daughter relationship","faked death","old woman","dog","disco","discotheque","disco dancing","dinner","crying girl","crate","counter terrorist","cook","cat","cameo","brother sister relationship","beach","arsonist","arrest","airport","barefoot","title spoken by character","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:46:50"}}