{"data":{"movies":[{"title":"Safe Harbour","originalTitle":"","year":"2007","releaseDate":"20080102","directors":[{"name":"Bill Corcoran","id":"nm0002573"}],"writers":[{"name":"Danielle Steel","id":"nm0824403"},{"name":"Edithe Swensen","id":"nm0842397"}],"runtime":"103 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzOTU2MjkzOV5BMl5BanBnXkFtZTcwMDE0NTI2MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Romance"],"plot":"Ophelia MacKenzie is spending the summer on a beach house with her daughter Philippa, recovering from the death of her husband and son in an air crash. Philippa meets Matt Bowles on the beach, where he spends time drawing, he is a handsome divorcée, and she introduces him to Ophelia. A romantic relationship develops between Ophelia and Matt after initial hesitance by Ophelia.","simplePlot":"Ophelia MacKenzie is spending the summer on a beach house with her daughter Philippa, recovering from the death of her husband and son in an air crash. Philippa meets Matt Bowles on the ... ","actors":[{"actorName":"Melissa Gilbert","urlProfile":"http://www.imdb.com/name/nm0001271","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI3MzkzNzc4N15BMl5BanBnXkFtZTcwMTUwMjMwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 May 1964","placeOfBirth":" Los Angeles, California, USA","birthName":"Melissa Ellen Gilbert","height":"5' 3\" (1.6 m)","bio":"Melissa Gilbert was born on May 8, 1964 in Los Angeles, California, USA as Melissa Ellen Gilbert. She is an actress and director, known for Little House on the Prairie (1974), Zoya (1995) and Sweet Justice (1994). She has been married to Timothy Busfield since April 24, 2013. She was previously married to Bruce Boxleitner and Bo Brinkman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI3MzkzNzc4N15BMl5BanBnXkFtZTcwMTUwMjMwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001271","name":"Melissa Gilbert","nicknames":["Missy"],"idIMDB":"nm0001271"},"actorId":"nm0001271","character":"Ophelia MacKenzie","urlCharacter":"http://www.imdb.com/character/ch0069676","main":true},{"actorName":"Brad Johnson","urlProfile":"http://www.imdb.com/name/nm0424635","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMjk3NTQ4NF5BMl5BanBnXkFtZTcwNzQ2MTAzMQ@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 October 1959","placeOfBirth":" Tucson, Arizona, USA","height":"6' 3\" (1.91 m)","bio":"When someone tells Brad Johnson he's come a long way, his usual response is, \"Well, I had a long way to come.\" Born on a small ranch in Tucson, Johnson, the son of a horse trainer/used car salesman, has done everything from shoeing horses to repossessing cars to serving as a hunting and fishing guide. His humble beginnings nurtured his modesty and quiet strength and has critics comparing him to John Wayne, Clint Eastwood and James Stewart. Brad's route to stardom was speedy, dramatic and somewhat circuitous. He joined the Pro Rodeo circuit in 1984 and was spotted wrestling steers in Wyoming by a casting director looking for cowboys to use as extras in a beer commercial. After this first break came a three-year run as the Marlboro Man, then numerous Calvin Klein print ads and more commercials. After a serious knee injury sidelined his rodeo career, Johnson headed for Hollywood. Within five months of his arrival, Roger Corman cast him to star in Nam Angels (1989). Soon after, Steven Spielberg discovered Johnson and offered him the coveted role of Ted Baker, Holly Hunter's love interest in Always (1989). When asked about her co-star, Holly described Brad as \"all twisted steel and sex appeal.\" The Spielberg film led Johnson to Paramount for John Milius' Flight of the Intruder (1991). An exclusive three-picture deal at Paramount followed. With 60 hours of television, 11 pilots and over 25 films to his credit, there's no slowing down in Johnson's future. Writing and producing can now be added to his resume. Johnson's Los Angeles-based High Lonesome Productions and is producing partner Lou Pitt have several projects in different stages of production. One of them, \"The Daybreakers,\" a rodeo tale, Johnson penned himself. Known by his friends as \"The working man's renaissance man,\" Johnson has three projects slated for release in 2007. Brad lives with his wife Laurie and their eight children on a ranch in the mountains of Colorado.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMjk3NTQ4NF5BMl5BanBnXkFtZTcwNzQ2MTAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0424635","name":"Brad Johnson","idIMDB":"nm0424635"},"actorId":"nm0424635","character":"Matt Bowles","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Liana Liberato","urlProfile":"http://www.imdb.com/name/nm1882929","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMDYzNzA2MV5BMl5BanBnXkFtZTgwMTU4NjA1MjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 August 1995","placeOfBirth":" Galveston, Texas, USA","birthName":"Liana Daine Liberato","height":"5' 7\" (1.7 m)","bio":"Liana Liberato was born in Galveston, Texas, the daughter of Rhondelle, a former real estate agent, and George Liberato. Her first significant role came in \"Galveston: The Musical\" when she was age 7. In the summer of 2005, she attended a week-long acting camp in California, where she attracted the attention of Central Artists. Charmed by Liberato's \"great charisma and a very natural delivery,\" the agent asked Liana to travel to Hollywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMDYzNzA2MV5BMl5BanBnXkFtZTgwMTU4NjA1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1882929","name":"Liana Liberato","idIMDB":"nm1882929"},"actorId":"nm1882929","character":"Philippa 'Pip' MacKenzie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rebecca Staab","urlProfile":"http://www.imdb.com/name/nm0820847","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwODA4ODA1N15BMl5BanBnXkFtZTgwNjI3NjkzOTE@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1961","placeOfBirth":" Hays, Kansas, USA","birthName":"Rebecca Ann Staab","height":"5' 6\" (1.68 m)","bio":"Rebecca Staab was born in Hays, Kansas and grew up in Omaha, Nebraska. Excelling in academics, Rebecca had a 4.0 GPA in both high school and college, and placed as the top sixth finalist in the Miss USA pageant as Miss Nebraska. Rebecca is currently shooting the new ABC thriller series \"Somewhere Between\" as Colleen Dekizer, scheduled to start airing in June of 2017. Movie theater audiences will see her co-starring in the soon-to-be-released film \"Live Like Line,\" alongside William Hurt and Helen Hunt. Early this summer, Rebecca will be filming a leading role in the feature \"Snapshots,\" a story of three generations of women whose weekend together reveals a lifetime of secrets. Rebecca has most recently been seen guest starring on award winning shows Masters of Sex, Dexter, Glee, Fairly Legal, Criminal Minds, The Mentalist, CSI, CSI: NY, NCIS, and Nip/Tuck. Rebecca is also recognized from network classics Cheers, Seinfeld, Ellen, The Wonder Years, Columbo, Beverly Hills, 90210, and The Drew Carey Show, to name only a few. After college, Rebecca spent three years as a professional model based in Paris, and worked nonstop on location all over the world including Italy, Germany, and Japan, accumulating covers, features in fashion magazines, billboards, and international campaigns. She moved on to New York and continued working with the Ford Modeling agency. Booking her very first acting audition, Rebecca started her acting career as punk rocker Cecelia Thompson on ABC's \"Loving,\" followed by the series regular 'good girl,' Jessie Matthews, on \"Guiding Light.\" Some of Rebecca's other series regular roles include the sex-crazed anchorwoman Sherry Beck on the newsroom drama \"Live Shot\"; innocent vampire Daphne Collins on the revised \"Dark Shadows\"; the first lesbian television character Ellen Sommers on NBC's \"Trade Winds\"; and the billionaire widow/vampire/fashion designer Elizabeth Barrington on \"Port Charles.\" Not every girl gets the chance to be a Marvel Comic superhero, but Rebecca starred in the original film version of \"The Fantastic Four\" as Susan Storm, The Invisible Girl. She is enthusiastically remembered by many fans of the film \"Love Potion No. 9,\" for her famous \"verbally castrating\" bar room scenes with Tate Donovan, and is also recognized frequently for the \"top funniest commercials of the year\" TAG body spray, as the Mrs. Robinson-MILF who seduces her daughter's boyfriend. Rebecca played the title role in Indy film \"A House on a Hill\", starring with Philip Baker Hall, and recently completed work on the critically acclaimed film \"A Perfect Ending.\" An avid traveler, Rebecca has been from Russia to Costa Rica, Italy to Bali, Japan to Austria, France to Singapore, Estonia to Kauai, Crete to Zihuatanejo, Istanbul to Hong Kong, Helsinki to the Canary Islands, Tunisia to St. Barts, Tahiti to Tulum, and most places in between! She excels at every outdoor adventure sport - her garage looks like a miniature \"Sports Chalet.\" Another passion of Rebecca's is architectural restoration -- hands on, she just completed a top-to-bottom inside-out year-long project of restoring a 100 year old home from a \"haunted crack house\" to the historic jewel it deserves to be appreciated as. Having reconstructed every house she's ever lived in, Rebecca is always looking for the next restoration project! Rebecca also applies her construction and handiwork skills to projects for Habitat for Humanity. She and her long time partner, William deVry, are very active in dog rescue. They foster four-legged friends who are slated for euthanasia, rehabilitate them, and find them qualified forever homes. They presently have five dogs of their own, but there's frequently an extra one or two in transition. They live in a registered historic home in the Hollywood Hills where Rebecca excels in landscape architecture, interior design, and gourmet cooking. Rebecca studied in New York City with Uta Hagen at the HB Studios, and in Los Angeles with Larry Moss.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwODA4ODA1N15BMl5BanBnXkFtZTgwNjI3NjkzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0820847","name":"Rebecca Staab","idIMDB":"nm0820847"},"actorId":"nm0820847","character":"Andrea Wilson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael DeLorenzo","urlProfile":"http://www.imdb.com/name/nm0217716","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4Njg0MjM1OF5BMl5BanBnXkFtZTgwNzA1MDA3NDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1959","placeOfBirth":" Bronx, New York City, New York, USA","height":"5' 10\" (1.78 m)","bio":"Michael DeLorenzo was born on October 31, 1959 in Bronx, New York City, New York, USA. He is an actor and director, known for New York Undercover (1994), A Few Good Men (1992) and Head of the Class (1986).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4Njg0MjM1OF5BMl5BanBnXkFtZTgwNzA1MDA3NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0217716","name":"Michael DeLorenzo","idIMDB":"nm0217716"},"actorId":"nm0217716","character":"Bob","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Jace","urlProfile":"http://www.imdb.com/name/nm0413052","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNzgxNjkzN15BMl5BanBnXkFtZTcwNzgwMzExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1962","placeOfBirth":" Paterson, New Jersey, USA","height":"6' 3½\" (1.92 m)","bio":"Michael Jace was born on July 13, 1962 in Paterson, New Jersey, USA. He is an actor, known for The Shield (2002), Forrest Gump (1994) and Planet of the Apes (2001). He was previously married to April Denise Laune and Jennifer Bitterman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNzgxNjkzN15BMl5BanBnXkFtZTcwNzgwMzExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0413052","name":"Michael Jace","idIMDB":"nm0413052"},"actorId":"nm0413052","character":"Jeff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Idalis DeLeon","urlProfile":"http://www.imdb.com/name/nm0216738","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA3NjQwMjIxN15BMl5BanBnXkFtZTYwMDY0MTYz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 June 1969","placeOfBirth":" Bronx, New York City, New York, USA","height":"5' 7\" (1.7 m)","bio":"Idalis DeLeon was born on June 15, 1969 in Bronx, New York City, New York, USA. She is an actress and director, known for Running Scared (2006), Woman Thou Art Loosed (2004) and Ugly Naked People (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA3NjQwMjIxN15BMl5BanBnXkFtZTYwMDY0MTYz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0216738","name":"Idalis DeLeon","idIMDB":"nm0216738"},"actorId":"nm0216738","character":"Millie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Katie Walder","urlProfile":"http://www.imdb.com/name/nm0907134","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5MTY4MjcyOF5BMl5BanBnXkFtZTgwOTg1MjAyOTE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1976","placeOfBirth":" Pennsylvania, USA","birthName":"Katie Elizabeth Walder","height":"5' 5\" (1.65 m)","bio":"Katie Elizabeth Walder is the youngest of 5 children - 2 brothers and two sisters. She started acting at a young age in musicals and plays in school, and did some print work as a young teen in such magazines as Teen and YM. She went on to study theatre in college, and upon moving to NYC after graduation, started working professionally in theatre with notable Broadway directors such as Michael Grief (original director for \"Rent\"), Keith Reddin and Daniel Aukin. Katie soon moved to Los Angeles and quickly landed her recurring role on the 5th Season of Gilmore Girls (2000) as the quirky/tough/athletic college roommate of Rory, \"Janet Billings\". She has been working steadily in film & TV steadily ever since.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5MTY4MjcyOF5BMl5BanBnXkFtZTgwOTg1MjAyOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0907134","name":"Katie Walder","idIMDB":"nm0907134"},"actorId":"nm0907134","character":"Vanessa Bowles","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kate Vernon","urlProfile":"http://www.imdb.com/name/nm0894690","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NzMxMTk5MV5BMl5BanBnXkFtZTgwMDgwMjg2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 April 1961","placeOfBirth":" Canada","birthName":"Katherine Vernon","height":"5' 8\" (1.73 m)","bio":"Kate Vernon was born to the celebrated actor John Vernon. As her father's career began to take off in the USA, the family moved from their home in Canada to Hollywood when Kate was 7 years old. With the ever growing career success of the late John Vernon (Dirty Harry (1971), Animal House (1978), The Outlaw Josey Wales (1976)), Kate's childhood enabled her to be influenced and surrounded by many of Hollywood's leading actors, writers and artists. With these early experiences and influences, her decision to study to become an actress came as no surprise. After successfully completing her acting school studies, Kate's beautiful features, zest for life, easy-going and fun personality coupled with her dedicated work approach to her profession did not go unnoticed. During the early 80's, doors began to open for Kate as she secured a number of roles. It was during the mid-1980's that Kate landed her first feature film break with her role as \"Benny\" in the box office hit, Pretty in Pink (1986). In its success, it led to more TV work, box office and independent movie roles allowing Kate to star alongside some of Hollywood's leading men such as Denzel Washington, Willem Dafoe, Edward James Olmos, Christopher Lee and Richard Thomas. To date, Kate's long career as a busy actress has enabled her to play an engaging and wide variety of roles from the beautiful, funny, the love interest, dramatic, comedic, the misunderstood, the mistress, the mother and the dynamic. With her most recent roles in movies including the box office smash The Last Song (2010) which features Miley Cyrus, Greg Kinnear, Liam Hemsworth, Kelly Preston and the comedy, National Lampoon's Snatched (2011), which is due for imminent release, sees her alongside Andrew McCarthy and the acclaimed film legend Ernest Borgnine. Her versatility as an actress has seen Kate recently star in the hit TV series Heroes (2006), Bones (2005), as well as CSI: Crime Scene Investigation (2000), The Mentalist (2008), Saving Grace (2007) and her recurring role as \"Ellen Tigh\" (2004-2009) in the award-winning Battlestar Galactica (2004) (2004-2009) has won her an international fan base. Never one to be typecast, Kate's career has allowed her to work alongside many of TV and Film Industry leading writers, directors & producers such as Spike Lee, Peter Medak, Ronald D. Moore, David Eick, Joe Cacaci, David Weddle, Michael Nankin and John Woo. Her 20-year career has allowed her to feature in regular, recurring and guest roles in a number of major TV series including Heroes (2006) (2010), CSI: Crime Scene Investigation (2000) (2004-2009), Star Trek: Voyager (1995) (1995), Nash Bridges (1996) (1996-1997), Battlestar Galactica (2004) (2004-2009), L.A. Law (1986) (1994), Bones (2005) (2010), Tales from the Crypt (1989) (1993), Who's the Boss? (1984) (1990) and many others. Some of her TV & Box Office Movies credits include The Last Song (2010), Malcolm X (1992), Roadhouse 66 (1985), National Lampoon's Snatched (2011), Blackjack (1998), Pretty in Pink (1986), Dangerous Touch (1994), Last Chance Cafe (2006) and Battlestar Galactica: The Plan (2009) to name but a few. With a timeless beauty and meticulous approach to her characters, these qualities have enhanced Kate's reputation not only as an on-screen beauty, but as an actress with experience to adapt to any kind of role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NzMxMTk5MV5BMl5BanBnXkFtZTgwMDgwMjg2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0894690","name":"Kate Vernon","idIMDB":"nm0894690"},"actorId":"nm0894690","character":"Sally","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kathleen Noone","urlProfile":"http://www.imdb.com/name/nm0634756","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NTIwMzE2M15BMl5BanBnXkFtZTYwMTkwMjcy._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 January 1945","placeOfBirth":" Hillsdale, New Jersey, USA","birthName":"Kathleen O'Meara","bio":"Kathleen Noone was born on January 8, 1945 in Hillsdale, New Jersey, USA as Kathleen O'Meara. She is an actress, known for Sunset Beach (1997), Knots Landing (1979) and All My Children (1970). She was previously married to Bill Noone.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NTIwMzE2M15BMl5BanBnXkFtZTYwMTkwMjcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0634756","name":"Kathleen Noone","idIMDB":"nm0634756"},"actorId":"nm0634756","character":"Louis Anderson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ryan Thomas","urlProfile":"http://www.imdb.com/name/nm1734288","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMTk0MTUxNV5BMl5BanBnXkFtZTcwODk1ODkyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 March 1984","placeOfBirth":" Florida, USA","birthName":"Ryan Christopher Thomas","bio":"Ryan Thomas was born on March 27, 1984 in Florida, USA as Ryan Christopher Thomas. He is known for his work on 500 Days of Summer (2009), Clerks II (2006) and Safe Harbour (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMTk0MTUxNV5BMl5BanBnXkFtZTcwODk1ODkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1734288","name":"Ryan Thomas","idIMDB":"nm1734288"},"actorId":"nm1734288","character":"Josh","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lisa Clifton","urlProfile":"http://www.imdb.com/name/nm0166760","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0ODM1OTY4Nl5BMl5BanBnXkFtZTcwNjc2MzYzOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Lisa Clifton is an actress, known for Locker Love (2009), Safe Harbour (2007) and Scream of the Bikini (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0ODM1OTY4Nl5BMl5BanBnXkFtZTcwNjc2MzYzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0166760","name":"Lisa Clifton","idIMDB":"nm0166760"},"actorId":"nm0166760","character":"Josh's mom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott Blackwood","urlProfile":"http://www.imdb.com/name/nm0085993","urlPhoto":"","biography":{"bio":"Scott Blackwood is known for his work on The Thin Red Line (1998), Shallow Ground (2004) and Flight of the Living Dead (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0085993","name":"Scott Blackwood","idIMDB":"nm0085993"},"actorId":"nm0085993","character":"Gunman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tracy Brooks Swope","urlProfile":"http://www.imdb.com/name/nm0842884","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA2MjQwOTE5MV5BMl5BanBnXkFtZTgwMzQ4ODY0MDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1953","placeOfBirth":" New York City, New York, USA","birthName":"Margaret Tracy Brooks Swope","height":"5' 9\" (1.75 m)","bio":"Tracy Brooks Swope was born on February 20, 1953 in New York City, New York, USA as Margaret Tracy Brooks Swope. She is an actress and producer, known for John G. Avildsen: King of the Underdogs (2017), Dante and Beatrice: A Family Film (2015) and Counterfeit World: Making 'To Live and Die in L.A.' (2003). She was previously married to John G. Avildsen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA2MjQwOTE5MV5BMl5BanBnXkFtZTgwMzQ4ODY0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0842884","name":"Tracy Brooks Swope","idIMDB":"nm0842884"},"actorId":"nm0842884","character":"Nurse #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kimleigh Smith","urlProfile":"http://www.imdb.com/name/nm0808991","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2OTc0MTU2N15BMl5BanBnXkFtZTgwNjE1MDA1ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 4\" (1.63 m)","bio":"Kimleigh Smith is an actress and director, known for Bad Words (2013), Lincoln Heights (2007-2008), Safe Harbour (2007) and Princess Diaries (2001). Kimleigh spent the first 10 years of her life in Japan, which still holds a special place in her heart. After Japan it was off to Leavenworth, Kansas, where she spent the remainder of her school years cheering and taking the world by storm. She attended Emporia State University, became Miss Emporia, and received a BS in Psychology. Despite her education, she always wanted to be a dancer, so after graduation she moved to Chicago to pursue her dream. She danced at several prestigious Chicago dance companies including Gus Giordano Dance and Joel Hall Dance. But dancing simply whet her appetite - she wanted more. On a dare, she auditioned for a play. She got the part and never looked back. Kimleigh has graced the stages of Chicago's most renowned theaters: The Goodman Theatre, Lookingglass Theatre, and The Steppenwolf Theatre, where she performed in \"A Clockwork Orange\", \"Crumbs from the Table of Joy,\" and \"Puddn'Head Wilson,\" to name a few. Upon moving to Los Angeles, she had the pleasure of reprising her role in \"Puddn'Head Wilson\" at Garry Marshall's, Falcon Theatre. This production was honored with a \"LA Weekly\" Theatre Award. Garry Marshall fell in love with Ms. Smith and cast her in her first major motion picture, \"The Princess Diaries.\" Kimleigh is a member of SAG-AFTRA & AEA. She has written and continues to perform her Multi-Award Winning solo show, T-O-T-A-L-L-Y! She is a Sexual Assault Awareness Advocate and the founder of the Embrace Your Cape Philosophy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2OTc0MTU2N15BMl5BanBnXkFtZTgwNjE1MDA1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0808991","name":"Kimleigh Smith","nicknames":["KiKi"],"idIMDB":"nm0808991"},"actorId":"nm0808991","character":"Nurse #2","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0974629","urlIMDB":"http://www.imdb.com/title/tt0974629","business":{"budget":{"money":"$2,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 43 min (103 min) (Greece)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Sony HDW-F900R"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":["HDCAM"],"printedFilmFormat":null},"rating":"5.4","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"PG-13","awards":[],"votes":"395","type":"Video","companyCreditsSimple":[{"idCompany":"co0089252","name":"Daniel Grodnik Productions"},{"idCompany":"co0202339","name":"Pip's Garden Company"}],"keywords":{"keywords":["serial killer","jealousy","bed","embezzlement","bare chested male","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 03:19:21"}}