{"data":{"movies":[{"title":"Machete","originalTitle":"","year":"2010","releaseDate":"20100903","directors":[{"name":"Ethan Maniquis","id":"nm0542450"},{"name":"Robert Rodriguez","id":"nm0001675"}],"writers":[{"name":"Robert Rodriguez","id":"nm0001675"},{"name":"Álvaro Rodríguez","id":"nm0736155"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWUxODc2NmItNThkNS00Mzc4LThlYTQtOTYwZjVhYjRiNmMwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English","Spanish","Hungarian"],"genres":["Action","Crime","Thriller"],"plot":"The highly skilled Federale Machete is hired by some unsavory types to assassinate a senator. But just as he's about to take the shot, he notices someone aiming at him and realizes he's been set up. He barely survives the sniper's bullet, and is soon out for revenge on his former employers, with the reluctant assistance of his brother Cheech Marin, who has become a priest and taken a vow of nonviolence. If you hire him to take out the bad guys, make sure the bad guys aren't you!","simplePlot":"After being set-up and betrayed by the man who hired him to assassinate a Texas Senator, an ex-Federale launches a brutal rampage of revenge against his former boss.","actors":[{"actorName":"Danny Trejo","urlProfile":"http://www.imdb.com/name/nm0001803","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcxNTQ1ODQxMl5BMl5BanBnXkFtZTYwMzI4MDA2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1944","placeOfBirth":" Echo Park, Los Angeles, California, USA","birthName":"Dan Trejo","height":"5' 5¾\" (1.67 m)","bio":"Danny Trejo was born Dan Trejo in Echo Park, Los Angeles, to Alice (Rivera) and Dan Trejo, a construction worker. A child drug addict and criminal, Trejo was in and out of jail for 11 years. While serving time in San Quentin, he won the lightweight and welterweight boxing titles. Imprisoned for armed robbery and drug offenses, he successfully completed a 12-step rehabilitation program that changed his life. While speaking at a Cocaine Anonymous meeting in 1985, Trejo met a young man who later called him for support. Trejo went to meet him at what turned out to be the set of Runaway Train (1985). Trejo was immediately offered a role as a convict extra, probably because of his tough tattooed appearance. Also on the set was a screenwriter who did time with Trejo in San Quentin. Remembering Trejo's boxing skills, the screenwriter offered him $320 per day to train the actors for a boxing match. Director Andrey Konchalovskiy saw Trejo training Eric Roberts and immediately offered him a featured role as Roberts' opponent in the film. Trejo has subsequently appeared in many other films, usually as a tough criminal or villain. Trejo is of Mexican descent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcxNTQ1ODQxMl5BMl5BanBnXkFtZTYwMzI4MDA2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001803","name":"Danny Trejo","nicknames":["The Mayor"],"idIMDB":"nm0001803"},"actorId":"nm0001803","character":"Machete","urlCharacter":"http://www.imdb.com/character/ch0006776","main":true},{"actorName":"Robert De Niro","urlProfile":"http://www.imdb.com/name/nm0000134","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNDU3MzcyOV5BMl5BanBnXkFtZTcwMjc0MTIxMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1943","placeOfBirth":" New York City, New York, USA","birthName":"Robert Anthony De Niro Jr.","height":"5' 9¾\" (1.77 m)","bio":"Robert De Niro, thought of as one of the greatest actors of all time, was born in Greenwich Village, Manhattan, New York City, to artists Virginia (Admiral) and Robert De Niro Sr. His paternal grandfather was of Italian descent, and his other ancestry is Irish, German, Dutch, English, and French. He was trained at the Stella Adler Conservatory and the American Workshop. He first gained fame for his role in Bang the Drum Slowly (1973), but he gained his reputation as a volatile actor in Mean Streets (1973), which was his first film with director Martin Scorsese. In 1974 De Niro received an Academy Award for best supporting actor for his role in The Godfather: Part II (1974) and received Academy Award nominations for best actor in Taxi Driver (1976), The Deer Hunter (1978), and Cape Fear (1991). He won the best actor award in 1980 for Raging Bull (1980). De Niro heads his own production company, Tribeca Film Center, and made his directorial debut in 1993 with A Bronx Tale (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNDU3MzcyOV5BMl5BanBnXkFtZTcwMjc0MTIxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000134","name":"Robert De Niro","nicknames":["Bobby Milk","Kid Monroe","Bob","Bobby D"],"idIMDB":"nm0000134"},"actorId":"nm0000134","character":"Senator McLaughlin","urlCharacter":"http://www.imdb.com/character/ch0245721","main":true},{"actorName":"Jessica Alba","urlProfile":"http://www.imdb.com/name/nm0004695","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYxNzE4OTk5Nl5BMl5BanBnXkFtZTcwODYyMDYzMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1981","placeOfBirth":" Pomona, California, USA","birthName":"Jessica Marie Alba","height":"5' 6½\" (1.69 m)","bio":"Jessica Marie Alba was born on April 28, 1981, in Pomona, CA, to Catherine (Jensen) and Mark David Alba, who served in the US Air Force. Her mother has Danish, Welsh, German, English, and French ancestry, while her father is of Mexican descent (including Spanish, Indigenous Mexican, and distant Sephardic Jewish, roots). Her family moved to Biloxi, MS, when she was an infant. Three years later her father's career brought the family back to California, then to Del Rio, TX, before finally settling in Southern California when Jessica was nine. In love with the idea of becoming an actress from the age of five, she was 12 before she took her first acting class. Nine months later she was signed by an agent. She studied at the Atlantic Theatre Company with founders William H. Macy and David Mamet. A gifted young actress, Jessica has played a variety of roles ranging from light comedy to gritty drama since beginning her career. She made her feature film debut in 1993 in Hollywood Pictures' comedy Camp Nowhere (1994). Originally hired for two weeks, she got her break when an actress in a principal role suddenly dropped out. Jessica cheerfully admits it wasn't her prodigious talent or charm that inspired the director to tap her to take over the part--it was her hair, which matched the original performer's. The two-week job stretched to two months, and Jessica ended the film with an impressive first credit. Two national TV commercials for Nintendo and J.C. Penney quickly followed before Jessica was featured in several independent films. She branched out into TV in 1994 with a recurring role in Nickelodeon's popular comedy series The Secret World of Alex Mack (1994). She played an insufferable young snob, devoted to making life miserable for the the title character, played by Larisa Oleynik. That same year, she won the role of \"Maya\" in Flipper (1995) and filmed the pilot for the series. She spent 1995 shooting the first season's episodes in Australia. An avid swimmer and PADI-certified SCUBA diver, Jessica was delighted to be doing a show that allowed her to play with dolphins. The show's success guaranteed it a second season, which she also starred in. Her involvement in the show lasted from 1995 to 1997. In 1996 she appeared in Venus Rising (1995) as \"Young Eve\". The next year she appeared on The Dini Petty Show (1989), a Canadian talk show, and spoke about her role in \"Flipper\" and her general acting career. She began working on P.U.N.K.S. (1999), featuring Randy Quaid, in 1998. In early 1998 she appeared in Brooklyn South (1997) as \"Melissa\". That same year she was in two episodes of Beverly Hills, 90210 (1990) as \"Leanne\" and in two episodes of Love Boat: The Next Wave (1998). She appeared in \"Teen Magazine\" in 1995 and various European magazines over the following years. More importantly, she was featured in the February 1999 issue of \"Vanity Fair\" magazine. She also had major roles in two movies that year: Never Been Kissed (1999) and Idle Hands (1999). In 2000 she had roles in Paranoid (2000) and starred in the sci-fi TV series Dark Angel (2000), gaining worldwide recognition. Her first starring role in a major studio film was the Honey (2003), Universal Pictures' contemporary urban drama that grossed over $60 million worldwide. She has since made over 25 feature films that have earned a combined box-office total of over $800 million, including comedies and dramas, from gritty independents to major studio blockbusters. In 2005 she starred opposite Bruce Willis and an all-star cast in the provocative and critically acclaimed Sin City (2005), directed by Robert Rodriguez and Frank Miller. She next starred as Sue Storm--\"The Invisible Girl\"--in Marvel's action-franchise blockbuster Fantastic Four (2005), which was released by 20th Century-Fox in July 2005 and became a worldwide box-office success with over $300 million in revenue. Jessica was part of Garry Marshall's all-star ensemble romantic comedy, Valentine's Day (2010), which broke box-office records with the largest opening on a four-day President's Day weekend in history. She starred opposite Casey Affleck and Kate Hudson in director Michael Winterbottom's controversial screen adaptation of The Killer Inside Me (2010), based on Jim Thompson's novel, as well as Robert Rodriquez's Machete (2010). She co-starred in the third installment of the hit \"Meet the Parents\" franchise Little Fockers (2010), as well as the 4D family adventure Spy Kids: All the Time in the World in 4D (2011), marking her third of five collaborations with Robert Rodriguez. Jessica was part of an all-star voice cast for The Weinstein Company's animated adventure, Escape from Planet Earth (2013), also featuring Sarah Jessica Parker, Brendan Fraser and James Gandolfini. She appeared in the comedy A.C.O.D. (2013), which premiered at the Sundance Film Festival and starred Adam Scott, Jane Lynch and Amy Poehler. She made a cameo appearance in Machete Kills (2013) and co-starred in Robert Rodriquez's highly-anticipated, star-studded sequel Sin City: A Dame to Kill For (2014). That year she had a full slate of acting projects, including the period drama Dear Eleanor (2016)\"; The Englishman opposite Pierce Brosnan and Salma Hayek; the IFC parody mini-series The Spoils of Babylon (2014), produced by Funny or Die, with a stellar cast including Will Ferrell, Kristen Wiig, Tobey Maguire, Michael Sheen and Tim Robbins; and Stretch (2014), co-starring Patrick Wilson, Chris Pine, Ray Liotta, Ed Helms and Brooklyn Decker. Jessica has received Golden Globe and People's Choice Award nominations, was voted TV Guide readers' Breakout Star of the Year, and won Favorite TV Actress at the 2001 Teen Choice Awards for \"Dark Angel.\" She won the Nickelodeon Kids' Choice Award for Favorite Female Actress for her performance in \"Fantastic Four\" and an MTV Movie Award for Sexiest Performance in \"Sin City.\" She received another Teen Choice Award for Choice Movie Actress in a Horror/Thriller for The Eye (2008) and was honored by the Young Hollywood Awards as Superstar of Tomorrow in 2005. She has received ALMA Awards for her performances in \"Dark Angel\" and \"Machete,\" as well as a Fashion Icon in 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYxNzE4OTk5Nl5BMl5BanBnXkFtZTcwODYyMDYzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004695","name":"Jessica Alba","nicknames":["Sky Angel","Albz"],"idIMDB":"nm0004695"},"actorId":"nm0004695","character":"Sartana","urlCharacter":"http://www.imdb.com/character/ch0155810","main":true},{"actorName":"Steven Seagal","urlProfile":"http://www.imdb.com/name/nm0000219","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNTU4ODcyMV5BMl5BanBnXkFtZTYwMzkyMjA1._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1952","placeOfBirth":" Lansing, Michigan, USA","birthName":"Steven Frederic Seagal","height":"6' 4\" (1.93 m)","bio":"Steven Seagal is a striking and somewhat boyishly handsome (often with ponytail) action star who burst onto the martial arts film scene in 1988 in the fast-paced Warner Bros. film Above the Law (1988). Steven Frederic Seagal was born in Lansing, Michigan, to Patricia Anne (Fisher), a medical technician, and Samuel Seagal, a high school math teacher. His paternal grandparents were Russian Jewish immigrants, and his mother had English, German, and Dutch ancestry. The enigmatic Seagal commenced his martial arts training at the age of seven under the tutelage of well-known karate instructor and author Fumio Demura, and in the 1960s commenced his aikido training in Orange County, CA, under the instruction of Harry Ishisaka. Seagal received his first dan accreditation in 1974, after he had moved to Japan to further his martial arts training. After spending many years there honing his skills, he achieved the ranking of a 7th dan in the Japanese martial art \"aikido\" and was instructing wealthy clients in Los Angeles when he came to the attention of Hollywood power broker Michael Ovitz. Ovitz saw star value in the imposing-looking Seagal. The high-octane action movie genre was in full swing in the late 1980s, and Seagal's debut movie, \"Above the Law\", was wildly received by action fans and actually received some complimentary critical reviews. He followed up \"Above the Law\" with another slam-bang thriller, Hard to Kill (1990), as a cop shot in an ambush by the mob who revives from a coma to take his revenge. The movie also starred Seagal's wife at the time, leggy Kelly LeBrock, who was married to him from 1987 to 1996 and is the mother of three of his children. His next outing was battling voodoo-using Jamaican drug \"posses\" in the hyper-violent Marked for Death (1990), before returning to fight psychotic mob gangster William Forsythe in the even more punishing Out for Justice (1991). Seagal was by now enormously popular, and his next movie, the big-budgeted Piège en haute mer (1992), set aboard the battleship USS Missouri and also starring Tommy Lee Jones and Gary Busey, was arguably his best film to date, impressing both fans and critics alike. Seagal's fighting style was rather different from that of other on-screen martial arts dynamos such as Bruce Lee, Chuck Norris and Jean-Claude Van Damme, who were predominantly fighters from striking arts background such as karate or tang soo do. However, aikido is built around using an opponent's inertia and body weight to employ various locks, chokes and holds that incapacitate him. Seagal carries himself differently, too, and often appears wearing Italian designer clothes and usually favors an all-black outfit, generally with a three-quarter-length coat with an elaborate trim. Additionally, Seagal's on-screen characters were often seemingly benign or timid individuals; however, when the going gets rough they reveal themselves to be deadly ex-CIA operatives, or retired Special Forces soldiers capable of enormous destruction! As his box-office drawing power grew, Seagal began to infuse his film projects with his personal and spiritual beliefs, especially concerning the abuse of the environment. He appeared as an oil fire expert who turns against his corrupt CEO (played by Michael Caine) in On Deadly Ground (1994) to save the Eskimo population from an oil disaster; in Fire Down Below (1997) he plays an environmental agency troubleshooter investigating the dumping of toxic waste in Kentucky coal mines, and in the slow-moving The Patriot (1998) he plays a medical specialist trying to stop a lethal virus unleashed by an extremist group. Action fans struggled to come to terms with social messaging being built into bone-crunching fight films; however, Seagal's box-office clout remained fairly strong, and more traditional chopsocky projects followed with the \"buddy cop\" film The Glimmer Man (1996), then almost a cameo role as a Navy SEAL alongside CIA analyst Kurt Russell before Seagal is sucked out of a jet at 35,000 feet in Executive Decision (1996). In 1999 Seagal took a different turn in his film projects with the surprising genteel Prince of Central Park (2000), about a child living inside NYC's most famous park. He returned to more familiar territory with further high-voltage, guns-blazing action in Exit Wounds (2001), Mission Alcatraz (2002), Out for a Kill (2003) and Un aller pour l'enfer (2003). Unbeknownst to many, in 1997 Seagal publicly announced that one of his Buddhist teachers, His Holiness Penor Rinpoche, had accorded Seagal as a tulku, the reincarnation of a Buddhist Lama. This initial announcement was met with some disbelief until Penor Rinpoche himself gave a confirmation statement on Seagal's new title. Seagal has repeatedly discussed his involvement in Buddhism and how he devotes many hours studying and meditating this ancient Eastern religion. While his box-office appeal has somewhat declined from his halcyon blockbusters of the mid-'90s, Seagal still has a very loyal fan base in the action movie genre and continues to remain a highly bankable star.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNTU4ODcyMV5BMl5BanBnXkFtZTYwMzkyMjA1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000219","name":"Steven Seagal","nicknames":["The Great One","Lord Steven","The Master of Aikido"],"idIMDB":"nm0000219"},"actorId":"nm0000219","character":"Torrez","urlCharacter":"http://www.imdb.com/character/ch0156401","main":true},{"actorName":"Michelle Rodriguez","urlProfile":"http://www.imdb.com/name/nm0735442","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDEzODQ1OTA0Nl5BMl5BanBnXkFtZTcwNjU2MDc1Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 July 1978","placeOfBirth":" San Antonio, Texas, USA","birthName":"Mayte Michelle Rodriguez","height":"5' 5\" (1.65 m)","bio":"Known for tough-chick roles, Michelle Rodriguez is proof that there is a cross between beauty and brawn. She was born Mayte Michelle Rodriguez on July 12, 1978, in Bexar County, Texas, to Carmen Milady Pared Espinal, from the Dominican Republic, and Rafael Rodríguez Santiago, who served in the U.S. Army and was originally from Puerto Rico. Michelle always knew she was destined to become a star, she just didn't know how to get there. Michelle lived in Texas until the age of 8 when her family moved to the Dominican Republic where she lived for two years before moving to Puerto Rico. At 11, Michelle's family relocated for the last time to Jersey City, New Jersey. Although she has been working since 1999 as an extra in such films as Summer of Sam (1999) and Cradle Will Rock (1999), it only took a magazine ad announcing an open casting call in New York for Michelle to decide to finally step into the spotlight. The role was the female lead, the movie was Girlfight (2000). Despite the lack of experience in film and boxing, Michelle auditioned, along with another 350 girls. After various trials inside an actual boxing ring and five arduous months of training in Brooklyn's Gleason's Gym, she was finally chosen to portray the role of Diana Guzman. As soon as the independent film began making the rounds at various film festivals, Michelle began gaining critical acclaim for her performance earning her awards like the Deauville Festival of American Cinema award for Best Actress and the Las Vegas Film Critics Society for Female Breakthrough Performance. As Girlfight (2000) continued to gain notoriety with its September 2000 release, Michelle was already hard at work with films like 3 A.M. (2001), the blockbuster hit The Fast and the Furious (2001), and Resident Evil (2002). With Hollywood calling her name, the future for this feisty Jersey girl is as strong as the punches she throws.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDEzODQ1OTA0Nl5BMl5BanBnXkFtZTcwNjU2MDc1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0735442","name":"Michelle Rodriguez","nicknames":["MRod"],"idIMDB":"nm0735442"},"actorId":"nm0735442","character":"Luz","urlCharacter":"http://www.imdb.com/character/ch0391072","main":true},{"actorName":"Jeff Fahey","urlProfile":"http://www.imdb.com/name/nm0001194","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyODQwNDgwMF5BMl5BanBnXkFtZTcwMjgzNTg2Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1952","placeOfBirth":" Olean, New York, USA","height":"6' (1,83 m)","bio":"Jeff Fahey was born in Olean, New York, one of 13 children of Jane (Gallagher) and Francis Thomas Fahey, who worked in a clothing store. He is of Irish descent. His family moved to Buffalo when he was 10, where he attended Father Baker's High School. After graduation in 1972 he traveled around the world doing odd jobs. He was a crewman on a fishing boat, drove an ambulance in Germany, lived in a kibbutz in Israel and spent some time in India. He then returned to Buffalo and joined the Studio Arena Theatre. From there he went to New York City, where he studied with Myra Rastova, began doing off-Broadway theater and television soap operas. He started a production company and produced off-Broadway shows out of the Raft Theatre on Theatre Row. He first gained attention as a motion picture actor in Lawrence Kasdan's Silverado (1985), in which he played Brian Dennehy's deputy Tyree, a cold-blooded killer with a thirst for vengeance. He starred in the acclaimed live television play The Execution of Raymond Graham (1985) and the TNT mini-series \"44 Days\". He starred for over two years in the daytime serial On ne vit qu'une fois (1968). He appeared in the Broadway revival of \"Brigadoon,\" toured with \"Oklahoma,\" performed in Paris in \"West Side Story\" and in London in \"Orphans\" with Albert Finney.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyODQwNDgwMF5BMl5BanBnXkFtZTcwMjgzNTg2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001194","name":"Jeff Fahey","idIMDB":"nm0001194"},"actorId":"nm0001194","character":"Booth","urlCharacter":"http://www.imdb.com/character/ch0220931","main":true},{"actorName":"Cheech Marin","urlProfile":"http://www.imdb.com/name/nm0001507","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyODU1ODEzOF5BMl5BanBnXkFtZTYwMzkwODY1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1946","placeOfBirth":" Los Angeles, California, USA","birthName":"Richard Anthony Marin","height":"5' 6\" (1.68 m)","bio":"Cheech Marin was born on July 13, 1946 in Los Angeles, California, USA as Richard Anthony Marin. He is an actor, known for The Lion King (1994), Nash Bridges (1996) and Cars (2006). He has been married to Natasha Rubin since August 8, 2009. He was previously married to Patti Heid and Rikki Marin.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyODU1ODEzOF5BMl5BanBnXkFtZTYwMzkwODY1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001507","name":"Cheech Marin","idIMDB":"nm0001507"},"actorId":"nm0001507","character":"Padre","urlCharacter":"http://www.imdb.com/character/ch0176106","main":true},{"actorName":"Don Johnson","urlProfile":"http://www.imdb.com/name/nm0000467","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MDg5MDkzOV5BMl5BanBnXkFtZTcwNDYyNjY0MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 December 1949","placeOfBirth":" Flat Creek, Missouri, USA","birthName":"Donnie Wayne Johnson","height":"5' 11\" (1.8 m)","bio":"Best known for his starring role as Det. Sonny Crockett on the hugely successful TV series Miami Vice (1984), Don Johnson is one of the stars who really defined the 1980s. As James \"Sonny\" Crockett he went toe-to-toe with drug dealers, pimps, prostitutes, assassins, illegal arms-dealers and crooked cops on a weekly basis from 1984 to 1989, appearing in a grand total of 110 episodes. The show, which was executive-produced by four time Oscar-nominated director, producer and writer Michael Mann, paired Johnson with the equally cool Philip Michael Thomas as Det. Ricardo Tubbs and the calm and stoic presence of Edward James Olmos as Lt. Martin Castillo. It revolutionized television with its modern fashion, pop music, unique style and use of real locations. Johnson typically wore $1000 Armani, Versace and Hugo Boss suits over pastel cotton T-shirts, drove a Ferrari 365 GTS/4 Daytona (later a Ferrari Testarossa) and lived on an Endeavour 42-foot sailboat named \"St. Vitus' Dance\" with his pet alligator Elvis. He also had full use of an offshore powerboat. Still, \"Miami Vice\" had not only style but substance, and his portrayal of the Vietnam veteran turned vice detective turned Sonny Crockett into the world's favorite cop. For his work on \"Miami Vice\" Johnson won a Golden Globe for Best Performance by an Actor in a TV Series in 1986, and was nominated in the same category a year later. He also picked up an Emmy nomination for Outstanding Lead Actor in a Drama Series in 1985. Johnson was born in Flat Creek, Missouri, the son Eva Lea (Wilson), a beautician, and Freddie Wayne Johnson, a farmer. As a kid, he wanted to become a professional bowler. Later, after a few brushes with the law at a young age, he discovered acting. After working on the stage for a while he ventured into films and television, but was not able to break into stardom despite, among other things, starring in the sci-fi cult classic A Boy and His Dog (1975). During the late 1960s and early 70s, Johnson had two short-lived marriages that were annulled; the names of his first two wives have never been made public. Tippi Hedren, Johnson's co-star in The Harrad Experiment (1973), allowed him to date her daughter Melanie Griffith despite the fact that she was only 14 and he was 22; the relationship culminated in a six-month marriage during 1976. In the 1980s he lived with actress Patti D'Arbanville and they had one son together. He remarried Griffith in 1989, but divorced in 1996 when she left him for Antonio Banderas. Johnson has been married to fifth wife Kelly Phleger since 1999, and they have three children together. Johnson starred in four failed TV pilots before landing his career-high role on \"Miami Vice\", which propelled him to superstardom. He directed four highly praised episodes of the show, one of them co-starring Melanie Griffith. He balanced his work on the series by appearing in the critically acclaimed TV film The Long Hot Summer (1985), an adaptation of the William Faulkner novel, and the film Sweet Hearts Dance (1988) with Susan Sarandon. After the series ended he focused solely on his film career. Although movies like Dead Bang (1989), The Hot Spot (1990) and Harley Davidson and the Marlboro Man (1991) did not fare well with the critics, quite a few of them have obtained a considerable cult following, with fans praising them as all being quality contributions to their genre. His film work has given Johnson the opportunity to work with legendary filmmakers like John Frankenheimer, Sidney Lumet and Dennis Hopper. After working steadily, Johnson returned to TV in 1996 with the cop show Nash Bridges (1996). The show, which Johnson created and produced, did very well. It co-starred Cheech Marin and Jodi Lyn O'Keefe. Johnson played the title role, a captain in the San Francisco PD's Special Investigations Unit. He was again paired with a flashy vehicle, this time an electric-yellow 1971 Plymouth Barracuda convertible. After \"Nash Bridges\" went off the air Johnson kept a low profile, but continues to appear in films and on television. He starred in the failed WB courtroom drama Just Legal (2005), which was produced by Jerry Bruckheimer, and has traveled to Europe to make such films as the Norwegian screwball comedy Long Flat Balls II (2008) and the Italian films Bastardi (2008) and Torno a vivere da solo (2008). He will soon be seen in the romantic comedy When in Rome (2010) with Anjelica Huston and Danny DeVito, as well as the indie comedy A Good Old Fashioned Orgy (2011). 'Don Johnson (I)' starred in the 2007 feature film, _\"Moondance Alexander\" (2007)_, along with Lori Loughlin, Kay Panabaker, James Best, Sasha Cohen, and Whitney Sloan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MDg5MDkzOV5BMl5BanBnXkFtZTcwNDYyNjY0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000467","name":"Don Johnson","nicknames":["DJ","The Don"],"idIMDB":"nm0000467"},"actorId":"nm0000467","character":"Von","urlCharacter":"http://www.imdb.com/character/ch0159754","main":true},{"actorName":"Shea Whigham","urlProfile":"http://www.imdb.com/name/nm0924154","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQzMDUwNjg1NF5BMl5BanBnXkFtZTgwMzE0NjcxNDE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1969","placeOfBirth":" Tallahassee, Florida, USA","birthName":"Franklin Shea Whigham Junior","height":"5' 8½\" (1.74 m)","bio":"Born in Florida, educated at Purchase, and coming from the NYC based theatre scene, Shea Whigham's big break came when director Joel Schumacher cast him opposite Colin Farrell in Tigerland (2000). Since then he has racked up impressive credits working with such legendary Hollywood directors as Martin Scorcese, Robert Redford, Terrence Malick, Werner Herzog, Oliver Stone, David O'Russell and Robert Rodriguez as well as the next generation such as Tim Van Patten, David Gordon Green and Jeff Nichols, among others. Shea has worked opposite such forces as Robert DeNiro, Anthony Hopkins, Christian Bale, Sean Penn and many others; and continues his role as 'Eli Thompson' on HBO's award-winning series Boardwalk Empire. He is married with 4 children and splits his time between NY and LA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQzMDUwNjg1NF5BMl5BanBnXkFtZTgwMzE0NjcxNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0924154","name":"Shea Whigham","idIMDB":"nm0924154"},"actorId":"nm0924154","character":"Sniper","urlCharacter":"http://www.imdb.com/character/ch0402039","main":true},{"actorName":"Lindsay Lohan","urlProfile":"http://www.imdb.com/name/nm0517820","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY1NzE3NTM2Ml5BMl5BanBnXkFtZTgwNDQ4MDk5NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 July 1986","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Lindsay Dee Lohan","height":"5' 5\" (1.65 m)","bio":"Lindsay Dee Lohan was born in New York City on 2 July 1986. Her mother, Dina Lohan (née Donata Melina Nicolette Sullivan), is a former Wall Street analyst, and her father, Michael Lohan, is a businessman and former Wall Street trader. She has Irish, Italian, and German ancestry. Lohan began her career at age three as a model at the Eileen Ford Agency, and made appearances in over 60 television commercials, including spots for The Gap, Pizza Hut, Wendy's and Jell-O (opposite Bill Cosby). Lohan made her acting debut in 1996 as the third actress to play Ali Fowler in the television drama Another World (1964). Shortly afterward she was hand-picked by Oscar-nominated writer Nancy Meyers as estranged twin sisters in an adaptation by Walt Disney Pictures of a novel by Erich Kästner, which marked Meyers' directorial debut. Lohan's first feature film, The Parent Trap (1998), a remake of The Parent Trap (1961), was a modest commercial success, earning her widespread critical acclaim and a Young Artist award for Best Leading Young Actress in a Feature Film, as well as Blockbuster Entertainment and YoungStar award nominations. After signing a three-movie contract with Disney, she returned to the small screen to star in the made-for-TV movies The Wonderful World of Disney: Life-Size (2000) (opposite Tyra Banks) and Get a Clue (2002) (opposite Bug Hall). She also appeared as Rose in the pilot episode of the short-lived comedy series Bette (2000), which starred Bette Midler. In June 2001 Lohan took a brief hiatus from acting. Her music career was launched over a year later, when Estefan Enterprises made a five-album production deal with her in September 2002, and she signed a recording contract with the reactivated Casablanca Records. However, Lohan was not turning her back on her blossoming acting career. Just over a month previously she had been cast opposite Jamie Lee Curtis for another Disney adaptation of a novel, this time a fantasy comedy by Mary Rodgers. Freaky Friday (2003), a remake of Freaky Friday (1976), was a huge hit (generating over $160 million in worldwide box office receipts) and critics were spellbound by delightful performances from Lohan and Curtis (who went on to receive a Golden Globe nomination for her work). In addition, Lohan won the 2004 MTV Movie Award for Best Breakthrough Female, as well as a Saturn award nomination and another Young Artist award nomination. Lohan relocated permanently to Los Angeles between projects and moved into an apartment with fellow actress Raven-Symoné. She also dated pop star Aaron Carter for a short time. Her next acting role was the title character in the comedy Journal intime d'une future star (2004), a Disney adaptation of the novel by Dyan Sheldon. The film received scathing reviews upon its release and died a quick death at the box office, but even the harshest of critics were impressed by Lohan's charming turn as aspiring actress Lola. Lohan's next project, Mean Girls (2004), saw her reunite with Freaky Friday (2003) director Mark Waters. Inspired by a non-fiction book by Rosalind Wiseman and written by Saturday Night Live (1975) scribe Tina Fey, the high-school comedy-drama opened to glowing reviews and grossed $86 million in the US. This earned her status as a bankable actress, and a salary of $7.5 million for the Donald Petrie romantic comedy Just My Luck (2006). One of the most sought-after young actresses in the industry, she starred in Bobby (2006) (opposite Demi Moore and Sharon Stone), the Disney fantasy adventure Herbie Fully Loaded (2005) (a pseudo-sequel to The Love Bug (1968)) and the critically acclaimed A Prairie Home Companion (2006). On top of a thriving film career Lohan also launched a music career, releasing her debut album, \"Speak,\" which hit shelves in December 2004. In 2009 Lohan launched her own fashion line titled 6126, mainly focusing on the production of women's leggings. By spring she launched a self-tanning spray line titled \"Sevin Nyne\" and by the end of the year she became an artistic designer for fashion house Ungaro. Lindsay continues her career in acting, having played a supporting role in the action film Machete (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY1NzE3NTM2Ml5BMl5BanBnXkFtZTgwNDQ4MDk5NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0517820","name":"Lindsay Lohan","nicknames":["Linds","La Lohan","LL","LiLo"],"idIMDB":"nm0517820"},"actorId":"nm0517820","character":"April","urlCharacter":"http://www.imdb.com/character/ch0177472","main":true},{"actorName":"Daryl Sabara","urlProfile":"http://www.imdb.com/name/nm0754512","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMTYxOTgxNV5BMl5BanBnXkFtZTcwMjIyNjQ4Ng@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 June 1992","placeOfBirth":" Torrance, California, USA","birthName":"Daryl Christopher Sabara","height":"5' 9½\" (1.77 m)","bio":"Daryl Sabara was born on June 14, 1992 in Torrance, California, USA as Daryl Christopher Sabara. He is an actor and producer, known for A Christmas Carol (2009), Spy Kids (2001) and Generator Rex (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMTYxOTgxNV5BMl5BanBnXkFtZTcwMjIyNjQ4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0754512","name":"Daryl Sabara","idIMDB":"nm0754512"},"actorId":"nm0754512","character":"Julio","urlCharacter":"http://www.imdb.com/character/ch0176863","main":true},{"actorName":"Gilbert Trejo","urlProfile":"http://www.imdb.com/name/nm0871808","urlPhoto":"","biography":{"dateOfBirth":"8 March 1988","placeOfBirth":" Los Angeles County, California, USA","birthName":"Gilbert Brian Trejo","bio":"Gilbert Trejo was born on March 8, 1988 in Los Angeles County, California, USA as Gilbert Brian Trejo. He is an actor and producer, known for Machete (2010), Soundman (1998) and China Test Girls (2017).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0871808","name":"Gilbert Trejo","idIMDB":"nm0871808"},"actorId":"nm0871808","character":"Jorge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ara Celi","urlProfile":"http://www.imdb.com/name/nm0148043","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMjEzMzQzMl5BMl5BanBnXkFtZTcwMDcyNDIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1974","placeOfBirth":" El Paso, Texas, USA","birthName":"Araceli Valdez","height":"5' 5\" (1.65 m)","bio":"Ara Celi was born on May 31, 1974 in El Paso, Texas, USA as Araceli Valdez. She is an actress and writer, known for American Beauty (1999), Machete (2010) and Bruce Almighty (2003). She has been married to Robert Godines since 2000. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMjEzMzQzMl5BMl5BanBnXkFtZTcwMDcyNDIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0148043","name":"Ara Celi","idIMDB":"nm0148043"},"actorId":"nm0148043","character":"Reporter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Savini","urlProfile":"http://www.imdb.com/name/nm0767741","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxOTYzOTcxNV5BMl5BanBnXkFtZTcwNDA1MDcwNw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1946","placeOfBirth":" Pittsburgh, Pennsylvania, USA","height":"5' 7\" (1.7 m)","bio":"Inspired by the film Man of a Thousand Faces (1957), a young Tom Savini became fascinated with the magic and illusion of film. He spent his youth in his room creating characters by tirelessly practicing make-up. Later, as a combat photographer in Vietnam, Savini saw first-hand the gruesome carnage for which he later gained fame, simulating it on screen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxOTYzOTcxNV5BMl5BanBnXkFtZTcwNDA1MDcwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0767741","name":"Tom Savini","nicknames":["The Godfather of Gore"],"idIMDB":"nm0767741"},"actorId":"nm0767741","character":"Osiris Amanpour","urlCharacter":"http://www.imdb.com/character/ch0223636","main":true},{"actorName":"Billy Blair","urlProfile":"http://www.imdb.com/name/nm3046228","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDg2MDc1MDkzOV5BMl5BanBnXkFtZTgwNjcwNDc4NjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"birthName":"William Vincent Blair","height":"5' 7\" (1.7 m)","bio":"Born in El Paso, TX and related to the great Edgar Allan Poe, Billy knew what he wanted to do at the ripe age of 5 after experiencing Sesame Street and KISS. He comes from a musical background. His great grandfather led his big band during the early 1900's in Mexico performing for some of history's greatest figures such as Pancho Villa. He also had uncles and cousins, all which played in big bands and symphonies. For all of Billy's life, he was dedicated to music and still proceeds to endeavor this lifestyle. Being in numerous bands, he would experience touring the nation, playing in clubs, theaters, arenas and amphitheaters; fulfilling the dream and opening for some of the biggest names of rock. By the mid 90's, Billy decided to pursue in acting. He would develop his skills in theater at Richland College in Richardson, TX and would resume with taking private lessons from the greatest acting coaches in Texas. Building his resume with small, local indie films. Landing in a national commercial, then booking roles in bigger films like Jonah Hex starring Josh Brolin. He is known for some of his great work in films like The Last Stand starring Arnold Schwarzenegger and Robert Rodriguez's Machete, Machete Kills and Sin City: A Dame To Kill For.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDg2MDc1MDkzOV5BMl5BanBnXkFtZTgwNjcwNDc4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3046228","name":"Billy Blair","idIMDB":"nm3046228"},"actorId":"nm3046228","character":"Von's Henchman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0985694","urlIMDB":"http://www.imdb.com/title/tt0985694","business":{"budget":{"money":"$10,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$14,102,888","country":"USA","day":"05","month":"09","year":"2010","remarks":"2,670 Screens"},{"money":"£90,423","country":"UK","day":"28","month":"11","year":"2010","remarks":"158 Screens"}],"gross":[{"money":"$26,593,646","country":"USA","day":"09","month":"12","year":"2013","remarks":""},{"money":"$26,589,953","country":"USA","day":"14","month":"11","year":"2010","remarks":""},{"money":"$26,576,752","country":"USA","day":"07","month":"11","year":"2010","remarks":""},{"money":"$26,552,544","country":"USA","day":"31","month":"10","year":"2010","remarks":""},{"money":"$26,519,961","country":"USA","day":"24","month":"10","year":"2010","remarks":""},{"money":"$26,477,766","country":"USA","day":"17","month":"10","year":"2010","remarks":""},{"money":"$26,389,867","country":"USA","day":"10","month":"10","year":"2010","remarks":""},{"money":"$26,205,140","country":"USA","day":"04","month":"10","year":"2010","remarks":""},{"money":"$25,733,673","country":"USA","day":"26","month":"09","year":"2010","remarks":""},{"money":"$24,391,354","country":"USA","day":"19","month":"09","year":"2010","remarks":""},{"money":"$20,916,709","country":"USA","day":"12","month":"09","year":"2010","remarks":""},{"money":"$14,102,888","country":"USA","day":"05","month":"09","year":"2010","remarks":""},{"money":"£90,423","country":"UK","day":"28","month":"11","year":"2010","remarks":""},{"money":"$44,093,316","country":"Worldwide","day":"09","month":"12","year":"2013","remarks":""},{"money":"€1,080,089","country":"Spain","day":"10","month":"10","year":"2010","remarks":""}],"weekendGross":[{"money":"$7,427","country":"USA","day":"14","month":"11","year":"2010","remarks":"19 Screens"},{"money":"$12,006","country":"USA","day":"07","month":"11","year":"2010","remarks":"32 Screens"},{"money":"$20,890","country":"USA","day":"31","month":"10","year":"2010","remarks":"56 Screens"},{"money":"$21,290","country":"USA","day":"24","month":"10","year":"2010","remarks":"50 Screens"},{"money":"$46,241","country":"USA","day":"17","month":"10","year":"2010","remarks":"96 Screens"},{"money":"$100,877","country":"USA","day":"10","month":"10","year":"2010","remarks":"167 Screens"},{"money":"$213,721","country":"USA","day":"04","month":"10","year":"2010","remarks":"314 Screens"},{"money":"$642,832","country":"USA","day":"26","month":"09","year":"2010","remarks":"682 Screens"},{"money":"$1,755,550","country":"USA","day":"19","month":"09","year":"2010","remarks":"1,704 Screens"},{"money":"$4,294,120","country":"USA","day":"12","month":"09","year":"2010","remarks":"2,678 Screens"},{"money":"$14,102,888","country":"USA","day":"05","month":"09","year":"2010","remarks":"2,670 Screens"},{"money":"£90,423","country":"UK","day":"28","month":"11","year":"2010","remarks":"158 Screens"}],"admissions":[{"money":"5,284","country":"Portugal","day":"30","month":"10","year":"2013","remarks":""},{"money":"4,067","country":"Portugal","day":"23","month":"10","year":"2013","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"29","month":"07","year":"2009","remarks":null},{"money":null,"country":null,"day":"24","month":"09","year":"2009","remarks":null}],"copyrightHolder":"Twentieth Century Fox Film Corporation, Machete's Chop Shop, Inc. and Dune Entertainment III LLC"},"technical":{"runtime":["1 hr 45 min (105 min)"],"soundMix":["Dolby Digital","DTS","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Genesis HD Camera"],"laboratory":["DeLuxe, USA (prints)","EFILM Digital Laboratories, Hollywood (CA), USA (digital intermediate)"],"filmLength":["2,772 m (Portugal)","2,869 m (Sweden)"],"negativeFormat":["HDCAM"],"cinematographicProcess":["Digital Intermediate (master format)","HDCAM SR (1080p/24) (source format)"],"printedFilmFormat":["35 mm (Fuji)"]},"rating":"6.6","metascore":"60","filmingLocations":[{"location":"Austin, Texas, USA"}],"rated":"R","awards":[{"award":"Alliance of Women Film Journalists 2011","titlesAwards":[{"titleAwardOutcome":"Nominated EDA Special Mention Award","categories":[{"category":"Most Egregious Age Difference Between the Leading Man and the Love Interest","names":[{"name":"Danny Trejo","id":"nm0001803","role":null},{"name":"Jessica Alba","id":"nm0004695","role":null}]}]}]},{"award":"ALMA Awards 2011","titlesAwards":[{"titleAwardOutcome":"Won ALMA Award","categories":[{"category":"Favorite Movie Actress - Drama/Adventure","names":[{"name":"Jessica Alba","id":"nm0004695","role":null}]}]},{"titleAwardOutcome":"Nominated ALMA Award","categories":[{"category":"Favorite Movie","names":[]},{"category":"Favorite Movie Actor","names":[{"name":"Danny Trejo","id":"nm0001803","role":null}]}]}]},{"award":"Golden Schmoes Awards 2010","titlesAwards":[{"titleAwardOutcome":"2nd place Golden Schmoes","categories":[{"category":"Coolest Character of the Year","names":[]}]},{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Best Line of the Year","names":[]}]}]},{"award":"IGN Summer Movie Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated IGN Award","categories":[{"category":"Best Action Movie","names":[]}]}]},{"award":"Razzie Awards 2011","titlesAwards":[{"titleAwardOutcome":"Won Razzie Award","categories":[{"category":"Worst Supporting Actress","names":[{"name":"Jessica Alba","id":"nm0004695","role":null},{"name":"The Killer Inside Me","id":"tt0954947","role":null},{"name":"Little Fockers","id":"tt0970866","role":null},{"name":"Valentine's Day","id":"tt0817230","role":null}]}]}]}],"votes":"170,214","type":"Movie","companyCreditsSimple":[{"idCompany":"co0239634","name":"Overnight Films"},{"idCompany":"co0035848","name":"Troublemaker Studios"},{"idCompany":"co0241738","name":"Dune Entertainment III"}],"keywords":{"keywords":["mexican","machete","texas","mexico","border fence","priest","illegal immigrant","crucifixion","blood","cult film","set up","senator","revenge","sniper","federale","taco","topless female nudity","porn video","incestuous overtones","incest subtext","incestuous desire","mingun mounted on motorcycle","female nudity","skinny dipping","threesome","female frontal nudity","anti hero","wilhelm scream","grindhouse","title spoken by character","character name in title","immigrant","vigilante","bullet","on the run","resistance fighter","partner","drug lord","resistance","immigration","mother and daughter have sex with the same man","nudity","breasts covered by hair","neo western","promiscuous daughter","lust","daddy's girl","screaming woman","discovery","father and daughter","hot pants","incest overtones","amateur porn","computer","gardener","high heels","bikini","password","pregnant woman murdered","death of pregnant woman","socialite","drug addict","gunfight","crushed to death","rocket launcher","man with glasses","firearm pointed at the camera","shot at the camera","stopped by police","barbed wire fence","hara kiri","two on a motorcycle","bound hand and foot","extreme closeup","chauffeured limousine","press conference","text message","surveillance camera","masked intruder","killed with high heeled shoe","supply and demand","shootout in a church","desecrating a church","arsenal","corpse falling on car","house explosion","time bomb","fistfight","campaign commercial","cockroach","shooting a pregnant woman","lighting cigar","hummer","immigration agent","lunch wagon","trap","carrying someone","flash forward","flame thrower","tattoo","covered in blood","social commentary","over the top","hand through chest","nail gun","investigation","sadist","fight","handcuffs","hands tied","explosive","assassination","police brutality","corkscrew","arrest","fake kidnapping","tortured to death","torture","interrogation","crucifix","flashback","photograph","bulletproof vest","reverse footage","showdown","sawed off shotgun","newspaper clipping","personal vendetta","double cross","psychopath","home invasion","murder","contract killer","hired killer","security guard","media coverage","throat slitting","news reporter","news report","bus stop","construction site","maid","laundromat","kitchen","car crash","car accident","bare knuckle fighting","gash in the face","rooftop","disguise","framed for murder","frame up","deception","drug overdose","electrocution","henchman","walkie talkie","compact disc","swimming pool","hitman","bodyguard","mansion","improvised weapon","camera","undercover agent","undercover","government agent","rocket","parking garage","cowboy hat","webcam","laptop","meat cleaver","security camera","surveillance","model","thrown from a car","carjacking","taxi","husband wife relationship","mother daughter relationship","police corruption","police officer","corrupt cop","desert","police vigilantism","corrupt businessman","political corruption","rifle","revolver","corrupt official","female full frontal nudity","sword","kicked in the face","kicked in the stomach","punched in the chest","stabbed in the hand","fugitive","knife in the head","nurse","ambulance","stabbed in the shoulder","stabbed in the face","shot through a window","shot in the knee","stabbed in the crotch","femme fatale","death of partner","escape","scalpel","pickaxe","axe","ethnic slur","church","black humor","sardonic","hand to hand combat","martial arts","tough guy","kidnapping","murder of wife","violence","killed in car","evil man","stabbing a police officer","shooting a police officer","videotaped sex","impersonating a police officer","stabbed in the mouth","drawing","body landing on a car","split screen","cigar smoking","cigarette smoking","confession","punched in the face","poetic justice","bound and gagged","hostage","egg","interracial sex","hearse","interracial kiss","hospital","minigun","shot in the shoulder","broken arm","corruption","stealing a car","limousine","silencer","nun's habit","duct tape over mouth","threatened with a knife","sexy nurse","chase","shootout","mexican food","text messaging","chop shop","father daughter relationship","explosion","exploding house","bomb","lowrider","stabbed in the forehead","impalement","sword fight","electric fence","repeated line","eye patch","shot in the eye","stabbed in the eye","strangulation","falling from height","jumping through a window","intestines","disembowelment","drunkenness","racist","racism","racial slur","mexican immigrant","corpse","immigration officer","death of brother","brother brother relationship","american citizenship","masked man","older man younger woman relationship","premarital sex","shower","green card","crushed by a car","held at gunpoint","murder of a pregnant woman","sniper rifle","hidden camera","filmed killing","u.s. mexico border","assassination attempt","food truck","day laborer","cell phone","doctor","uzi","machine gun","shotgun","flamethrower","death of wife","severed hand","severed head","head cut in half","decapitation","katana sword","female rear nudity","betrayal","knife in the chest","stabbed to death","stabbed in the leg","stabbed in the arm","stabbed in the head","stabbed in the back","stabbed in the chest","hit by a car","subtitled scene","murder of a police officer","blood splatter","shot in the face","shot to death","shot in the leg","shot in the arm","shot in the forehead","shot in the head","shot in the back","shot in the chest","murdered priest","gore","motorcycle","suitcase of money","knife","knife throwing","pistol","gunshot wound","cross","exploding car","assassin","death of father","spoof","tough girl","action hero","policewoman","object in vagina","machismo","female fighter","propaganda","fast motion scene","freeze frame","female agent","exploitation film","one man army","aikido","black comedy","bad taste humour","character repeating someone else's dialogue","latino stereotype","slow motion scene","bare chested male","nude woman murdered","scene before opening credits","one word title","naked","woman's bare butt","bare butt woman","womans bare butt","buttocks","rear female nudity","nipples","topless","hair covering breasts","naked woman","older man younger woman sex","nude swimming","cgi nudity","vomiting","breasts","rescue","bare breasts","asian woman","foreplay","cult director","first part","hispanic woman murdered","latin woman murdered","battlefield","2000s","flack vest","internet feed","35 mm camera","body count","homage","betting","camcorder","female assassin","female murderer","gatling gun","police officer shot in the chest","bare butt","butt","hedge clippers","weed whacker","battle","sequel mentioned during end credits","gardner","title at the end","title appears in writing","spin off"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:50:06"}}