{"data":{"movies":[{"title":"Battlestar Galactica: Razor","originalTitle":"","year":"2007","releaseDate":"20071124","directors":[{"name":"Félix Enríquez Alcalá","id":"nm0258066"}],"writers":[{"name":"Ronald D. Moore","id":"nm0601822"},{"name":"Michael Taylor","id":"nm0852899"}],"runtime":"101 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MzUxNTYwMF5BMl5BanBnXkFtZTcwNTIyMjU1MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Drama","Sci-Fi","Thriller"],"plot":"A two-hour Battlestar Galactica special that tells the story of the Battlestar Pegasus several months prior to it finding the Galactica.","simplePlot":"A two-hour Battlestar Galactica special that tells the story of the Battlestar Pegasus several months prior to it finding the Galactica.","actors":[{"actorName":"Edward James Olmos","urlProfile":"http://www.imdb.com/name/nm0001579","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzODQzODQ4OF5BMl5BanBnXkFtZTcwMDczMTkxNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1947","placeOfBirth":" Los Angeles, California, USA","height":"5' 8½\" (1.74 m)","bio":"Edward James Olmos was born in Los Angeles, California, to Eleanor (Huizar) and Pedro Olmos, who was a mail carrier and welder. His family was of Mexican descent. If Olmos had followed the first love of his life, he would have been a professional baseball player. But by age 13, another love entered his life: rock music. By age 15, he was already an experienced rock singer, forming and reforming several \"garage bands\" along the way. During the late 1960s and early 1970s, he played the most famous clubs on Sunset Strip, including Gazzarri's and The Factory. But a friend suggested that, with his flair for the dramatic, he consider a career in acting. Throughout the 1970s, he divided his time between rock music gigs, acting classes, bit parts in television, Off-off-off Broadway plays and his business of moving fine furniture (which kept body, soul and family together). His first big break was a starring role in Luis Valdez's play, \"Zoot Suit\", in 1978. The play moved to Broadway and led to a Tony Award nomination and great critical acclaim. Perhaps best known for his role as Lt. Martin Castillo in the NBC television series Miami Vice (1984) (1984-1989), Olmos has been seen in numerous film and television productions. He received an Academy Award nomination for Best Actor for his starring role in Stand and Deliver (1988). Most notable of his recent offerings is American Me (1992), which was also his directing debut. But acting, directing and screenwriting are only parts of what he does. Olmos contends he would much rather be known as an activist than an actor. He devotes much of his time to causes, particularly those focusing on the needs and rights of children. He makes, on average, some 150 personal appearances a year to places where he can reach kids at risk; juvenile halls, detention centers, boys/girls clubs, schools. Anywhere he can get across his message that \"we all have a choice\" about where life takes us. Olmos stresses the importance of education, the risks of gang life and tries to promote the notion of taking responsibility for one's own actions and one's own happiness in life. Using his own \"disadvantaged background\" as an example (he grew up in East Los Angeles, infamous for its gang problems), he tells the kids, \"If I can do it, so can you\". And he tries to point them in a positive direction. He has served as an ambassador for UNICEF and has received numerous accolades for his activism. He will long be remembered for getting out in the thick of the Los Angeles Riots of 1992 with his broom: one calm, reasonable presence in the midst of chaos and gunfire. Edward James Olmos was married to actress Lorraine Bracco. Between them they have 6 children, ages 10 - 25.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzODQzODQ4OF5BMl5BanBnXkFtZTcwMDczMTkxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001579","name":"Edward James Olmos","nicknames":["EJO","Ed","Eddie"],"idIMDB":"nm0001579"},"actorId":"nm0001579","character":"Admiral William Adama","urlCharacter":"http://www.imdb.com/character/ch0008081","main":true},{"actorName":"Mary McDonnell","urlProfile":"http://www.imdb.com/name/nm0001521","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5ODc4MTcwM15BMl5BanBnXkFtZTgwNjI2Njk3NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1952","placeOfBirth":" Wilkes-Barre, Pennsylvania, USA","birthName":"Mary Eileen McDonnell","height":"5' 6\" (1.68 m)","bio":"Mary McDonnell is a two-time Oscar®-nominated actress, who is known for her character portrayals in both period and present-day screen roles. Mary Eileen McDonnell was born on April 28, 1952 in Wilkes-Barre, Pennsylvania, to Eileen (Mundy) and John McDonnell, a computer consultant, both of Irish descent. Mary was raised in Ithaca, New York. After graduating from the State University of New York at Fredonia, she attended drama school and joined the Long Wharf Theatre Company on the East Coast. It was not until 20 years after working on the theater stage that she had her breakthrough film role, in Kevin Costner's Dances with Wolves (1990), playing Stands with a Fist, a white woman raised by the Sioux Indians. McDonnell received an Academy Award nomination for the role, and also garnered a Best Actress Academy Award® nomination and Golden Globe nomination for her portrayal of a paraplegic soap opera star in John Sayles' critically acclaimed Passion Fish (1992). McDonnell's extensive list of film credits include the Lawrence Kasdan films Grand Canyon and Mumford; Sneakers, opposite Robert Redford, Sidney Poitier and Sir Ben Kingsley; Roland Emmerich's smash Independence Day, with Bill Pullman and Will Smith; acclaimed art house cult-hit Donnie Darko; and Margin Call, opposite Kevin Spacey, which also earned her the Robert Altman Award at the 2012 Independent Spirit Awards. On the small screen, McDonnell starred in four seasons on the Syfy Network's award-winning series Battlestar Galactica in her critically praised performance as the President Laura Roslin. The series earned a Peabody Award, and AFI deemed the series TV Program of the Year for two years in a row. McDonnell garnered an Emmy nomination for her recurring guest role on the television series ER. Some of her other television credits include the ABC hit-series Grey's Anatomy, the CBS series High Society, TNT's adaptation of Arthur Miller's The American Clock, the critically acclaimed CBS movie Behind The Mask and Lifetime's Two Small Voices. McDonnell received rave reviews for her performance opposite David Strathairn in Emily Mann's acclaimed adaptation of Chekhov's The Cherry Orchard. McDonnell began her career in theatre and has starred in a wide variety of both Broadway and off-Broadway productions. She received an Obie Award for her performance in Emily Mann's Still Life and has starred in off-Broadway productions such as Sam Shepard's Pulitzer Prize-winning Buried Child, John Patrick Shanley's Savage in Limbo, John O'Keefe's All Night Long, Michael Cristofer's Black Angel, Kathleen Tolan's A Weekend Near Madison, Paula Cizmar's Death of a Miner and Dennis McIntyre's National Anthem. Her Broadway credits include Tennessee Williams' Summer and Smoke, the title role in Wendy Wasserstein's Pulitzer Prize-winning The Heidi Chronicles and Emily Mann's Execution of Justice. Mary stars as Captain Sharon Raydor on the TNT's hit drama series Major Crimes, the follow-up to The Closer, in which McDonnell originated the role and for which she earned a Primetime Emmy® nomination. McDonnell received her first Oscar nomination and Golden Globe® nomination for her portrayal of . Mary lives in Pacific Palisades, California with her husband, actor Randle Mell, and their two children, Olivia and Michael.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5ODc4MTcwM15BMl5BanBnXkFtZTgwNjI2Njk3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001521","name":"Mary McDonnell","idIMDB":"nm0001521"},"actorId":"nm0001521","character":"President Laura Roslin","urlCharacter":"http://www.imdb.com/character/ch0008087","main":true},{"actorName":"Katee Sackhoff","urlProfile":"http://www.imdb.com/name/nm0755267","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExNjAyMDgxNzheQTJeQWpwZ15BbWU3MDc2OTY1NTk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1980","placeOfBirth":" Portland, Oregon, USA","birthName":"Kathryn Ann Sackhoff","height":"5' 6\" (1.68 m)","bio":"Katee Sackhoff was born on April 8, 1980 in Portland, Oregon, USA as Kathryn Ann Sackhoff. She is an actress and producer, known for Battlestar Galactica (2004), Longmire (2012) and Oculus (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExNjAyMDgxNzheQTJeQWpwZ15BbWU3MDc2OTY1NTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0755267","name":"Katee Sackhoff","idIMDB":"nm0755267"},"actorId":"nm0755267","character":"Captain Kara 'Starbuck' Thrace","urlCharacter":"http://www.imdb.com/character/ch0008082","main":true},{"actorName":"Jamie Bamber","urlProfile":"http://www.imdb.com/name/nm0051397","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMjE5MzQxNV5BMl5BanBnXkFtZTgwODM1MzY2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1973","placeOfBirth":" Hammersmith, London, England, UK","birthName":"Jamie St John Bamber Griffith","height":"5' 9\" (1.75 m)","bio":"Jamie Bamber was born on April 3, 1973 in Hammersmith, London, England as Jamie St John Bamber Griffith. He is an actor and producer, known for Battlestar Galactica (2004), Battlestar Galactica: Razor (2007) and Law & Order: UK (2009). He has been married to Kerry Norton since September 20, 2003. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMjE5MzQxNV5BMl5BanBnXkFtZTgwODM1MzY2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0051397","name":"Jamie Bamber","nicknames":["Bambini"],"idIMDB":"nm0051397"},"actorId":"nm0051397","character":"Cpt. Lee 'Apollo' Adama","urlCharacter":"http://www.imdb.com/character/ch0008090","main":true},{"actorName":"James Callis","urlProfile":"http://www.imdb.com/name/nm0130536","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMzkyNTY4MV5BMl5BanBnXkFtZTcwNjkyNTU5Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1971","placeOfBirth":" London, England, UK","height":"5' 8\" (1.73 m)","bio":"James Callis was born on June 4, 1971 in London, England. He is an actor and writer, known for Battlestar Galactica (2004), Bridget Jones's Diary (2001) and Bridget Jones: The Edge of Reason (2004). He has been married to Neha Callis since December 30, 1998. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMzkyNTY4MV5BMl5BanBnXkFtZTcwNjkyNTU5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0130536","name":"James Callis","idIMDB":"nm0130536"},"actorId":"nm0130536","character":"Dr. Gaius Baltar","urlCharacter":"http://www.imdb.com/character/ch0008097","main":true},{"actorName":"Tricia Helfer","urlProfile":"http://www.imdb.com/name/nm1065454","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNTI4MzAzNl5BMl5BanBnXkFtZTcwNTEyNzQ1NA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 April 1974","placeOfBirth":" Donalda, Alberta, Canada","birthName":"Tricia Janine Helfer","height":"5' 10½\" (1.79 m)","bio":"Tricia Helfer was born on April 11, 1974 in Donalda, Alberta, Canada as Tricia Janine Helfer. She is an actress and producer, known for Battlestar Galactica (2004), Burn Notice (2007) and Dark Blue (2009). She has been married to Jonathan Marshall since 2003.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNTI4MzAzNl5BMl5BanBnXkFtZTcwNTEyNzQ1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1065454","name":"Tricia Helfer","idIMDB":"nm1065454"},"actorId":"nm1065454","character":"Number Six / Gina Inviere","urlCharacter":"http://www.imdb.com/character/ch0008086","main":true},{"actorName":"Grace Park","urlProfile":"http://www.imdb.com/name/nm0661825","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1OTg1MjI0MF5BMl5BanBnXkFtZTcwODgyMjU5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1974","placeOfBirth":" Los Angeles, California, USA","height":"5' 9\" (1.75 m)","bio":"Grace Park (born March 14, 1974) is an American-Canadian actress. She gained recognition as Sharon \"Boomer\" Valerii and Sharon \"Athena\" Agathon on Battlestar Galactica, as well as Shannon Ng in the Canadian television series teen soap Edgemont. Park stars as Officer Kono Kalakaua in the CBS television series Hawaii Five-0, which debuted on September 20, 2010. Born in Los Angeles, Park moved with her family to Canada when she was 22 months old. She was raised in the Vancouver neighbourhood of Kerrisdale. Park is of Korean heritage and she graduated from Magee Secondary School in 1992 and holds a degree in psychology from the University of British Columbia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1OTg1MjI0MF5BMl5BanBnXkFtZTcwODgyMjU5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0661825","name":"Grace Park","idIMDB":"nm0661825"},"actorId":"nm0661825","character":"Lt. Sharon Valerii","urlCharacter":"http://www.imdb.com/character/ch0008091","main":true},{"actorName":"Michael Hogan","urlProfile":"http://www.imdb.com/name/nm0389581","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwOTk1ODE0MV5BMl5BanBnXkFtZTcwMTc5MTM5Mg@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"height":"5' 11½\" (1.82 m)","bio":"Michael Hogan, a prospector's son, was born in Northern Ontario. He trained at the National Theatre School of Canada, where he met his future wife, actress Susan Hogan (nee King). They worked as a package until their their children, Jennie Rebecca Hogan (actress), Gabriel Hogan (actor), and Charlie Hogan (audience member), came along. Over the years, Hogan has appeared in countless plays, films, TV series, and radio dramas, and even an opera. Some of his favorite feature film experiences include La vengeance du loup (1991), with his good friend, Graham Greene, shot in the bush north of Lake Superior Road to Saddle River, shot in the Badlands of Alberta; Klondike Fever (1980), with Rod Steiger, Lorne Greene, Angie Dickinson and Gordon Pinsent, shot in and around Barkerville, B.C. in the winter; A Simple Curve (2005), shot in Slocan Valley, B.C. His most rewarding television experiences include his work on Jake and the Kid (1995), Monk (2002), African Skies (1992), La loi du colt (1997), Lifeline to Victory (1993), Nights Below Station Street (1997), _Secret in Giving (1999) (TV) (aka \"Calico Christmas\"), _For Those Who Hunt The Wounded Down (1996) (TV)_ and, of course, his all-time favorite, Battlestar Galactica (2004). Among his numerous live theater performances are the title role in \"Cowboy King\", performed on horseback at the Caravan Farm Theatre in the interior of B.C.; \"Biff Loman\" in \"Death of a Salesman\", then 19 years later, \"Willy Loman\" in the same play; \"Red Mango Blues\", a one-man show (with guitar virtuoso Harris Van Berkel), written by poet/playwright Charles Tidler; and \"Petruchio\" in \"Taming of the Shrew\", with wife Susan Hogan as \"Kate\". Hogan has performed on several radio shows, including \"Pocket City Blues\", a radio series about a blues DJ who stumbles into a different crime every week. Hogan's distinctive voice has also been heard over CBC Radio as the narrator of many books, poems, and short stories. His award nominations are numerous and include a Blizzard Award for Best Leading Actor (feature length) for his role in Nights Below Station Street (1997), from Manitoba Film; and a Genie for Best Supporting Actor (feature length) in Solitaire (1991). The Hogans live on an island with son Charlie, a couple of dogs, cats, bikes, skis, and a few kayaks.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwOTk1ODE0MV5BMl5BanBnXkFtZTcwMTc5MTM5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0389581","name":"Michael Hogan","idIMDB":"nm0389581"},"actorId":"nm0389581","character":"Colonel Saul Tigh","urlCharacter":"http://www.imdb.com/character/ch0008107","main":true},{"actorName":"Aaron Douglas","urlProfile":"http://www.imdb.com/name/nm0234928","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI0OTc1MzQ5NF5BMl5BanBnXkFtZTcwNDU0MzM1Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 August 1971","placeOfBirth":" New Westminster, British Columbia, Canada","height":"6' (1.83 m)","bio":"Aaron Douglas was born on August 23, 1971 in New Westminster, British Columbia, Canada. He is an actor, known for Battlestar Galactica (2004), Dirk Gently's Holistic Detective Agency (2016) and The Bridge (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI0OTc1MzQ5NF5BMl5BanBnXkFtZTcwNDU0MzM1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0234928","name":"Aaron Douglas","idIMDB":"nm0234928"},"actorId":"nm0234928","character":"Chief Galen Tyrol","urlCharacter":"http://www.imdb.com/character/ch0008105","main":true},{"actorName":"Tahmoh Penikett","urlProfile":"http://www.imdb.com/name/nm0671886","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NjMwMDYyNl5BMl5BanBnXkFtZTcwMDY4ODYyMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 May 1975","placeOfBirth":" Whitehorse, Yukon, Canada","height":"6' 3\" (1.91 m)","bio":"He is the son of former Yukon premier Anthony David John Penikett (Tony). A graduate of the Victoria Motion picture school, Tahmoh also studied at the Lyric School of Acting in Vancouver. Tahmoh and his family (his father, and his twin sisters Sarah and Stephanie) make their home in Vancouver, British Columbia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NjMwMDYyNl5BMl5BanBnXkFtZTcwMDY4ODYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0671886","name":"Tahmoh Penikett","idIMDB":"nm0671886"},"actorId":"nm0671886","character":"Lt. Karl 'Helo' Agathon","urlCharacter":"http://www.imdb.com/character/ch0008102","main":true},{"actorName":"Michael Trucco","urlProfile":"http://www.imdb.com/name/nm0873998","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNjM2ODQ1Ml5BMl5BanBnXkFtZTgwNTkzOTA1MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1970","placeOfBirth":" San Mateo, California, USA","birthName":"Edward Michael Trucco","height":"6' 3\" (1.91 m)","bio":"Born and raised in San Mateo, California, he graduated from Santa Clara University with a BA in Theatre Arts and was quickly headed to Los Angeles to pursue his dream of a career in Film and Television. He didn't have to wait long. A recurring role on \"BEVERLY HILLS 90210\" brought Michael the recognition he sought and he followed that with a starring role on the CBS Series \"PENSACOLA: WINGS OF GOLD\" opposite James Brolin for two seasons. After that, he landed notable recurring roles on shows such as \"ARLI$$\", \"ONE TREE HILL\", \"CASTLE\", \"HOW I MET YOUR MOTHER\" and \"REVENGE\" and the animated series \"YOUNG JUSTICE\" as 'Adam Strange'. Some of his most memorable guest appearances include \"THE BIG BANG THEORY\", \"LAW & ORDER: SVU\", \"CRIMINAL MINDS\", \"V\", \"PSYCH\" and \"SCANDAL\". He can be seen recurring on \"GRANDFATHERED\" on the FOX network. But he is perhaps best known for his portrayal of 'Samuel T. Anders' on the critically acclaimed Sci-Fi series \"BATTLESTAR GALACTICA\" and for 'Justin Patrick' on the USA Network series \"FAIRLY LEGAL\". He can be seen in the upcoming thriller/horror films \"HUSH\" and \"THE BYE BYE MAN\" both of which will be released in theatres later this year. And this summer he will begin shooting in London and Bulgaria for the Millennium Pictures feature film \"HUNTER/KILLER\" with Gerard Butler and Gary Oldman due out in theaters in 2017. He lives in Los Angeles with his wife, actress Sandra Hess and their 2 dogs and 2 cats.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNjM2ODQ1Ml5BMl5BanBnXkFtZTgwNTkzOTA1MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0873998","name":"Michael Trucco","idIMDB":"nm0873998"},"actorId":"nm0873998","character":"Samuel Anders","urlCharacter":"http://www.imdb.com/character/ch0008110","main":true},{"actorName":"Alessandro Juliani","urlProfile":"http://www.imdb.com/name/nm0432228","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MjI1NzE2MV5BMl5BanBnXkFtZTgwMjAyMDY0MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1975","placeOfBirth":" Montréal, Québec, Canada","height":"5' 9½\" (1.77 m)","bio":"Alessandro Juliani currently makes his living as an actor, singer, composer and sound designer. He once commanded the Battlestar Galactica for 27 minutes. He is a graduate of McGill University in Montreal. He is the son of director/actor/writer John Juliani, and producer Donna Wong-Juliani. He is the partner of actress/director Meg Roe.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MjI1NzE2MV5BMl5BanBnXkFtZTgwMjAyMDY0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0432228","name":"Alessandro Juliani","nicknames":["AJ"],"idIMDB":"nm0432228"},"actorId":"nm0432228","character":"Lt. Felix Gaeta","urlCharacter":"http://www.imdb.com/character/ch0008115","main":true},{"actorName":"Kandyse McClure","urlProfile":"http://www.imdb.com/name/nm0565973","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5ODUyNzk3Nl5BMl5BanBnXkFtZTgwOTU4MDU0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1980","placeOfBirth":" South Africa","birthName":"Candice McClure","height":"5' 2\" (1.57 m)","bio":"Kandyse McClure is a Canadian actress born on March 22, 1980 in Durban in South Africa. She graduated from West Vancouver Secondary School in 1998. She is an actress, known for main roles in TV series Battlestar Galactica (2004), Hemlock Grove (2013), and from the movies Carrie (2002) and Seventh Son (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5ODUyNzk3Nl5BMl5BanBnXkFtZTgwOTU4MDU0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0565973","name":"Kandyse McClure","idIMDB":"nm0565973"},"actorId":"nm0565973","character":"Petty Officer Anastasia Dualla","urlCharacter":"http://www.imdb.com/character/ch0008099","main":true},{"actorName":"Michelle Forbes","urlProfile":"http://www.imdb.com/name/nm0000405","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5NTgwMjIxMDdeQTJeQWpwZ15BbWU3MDY2NTk0MTk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 January 1965","placeOfBirth":" Austin, Texas, USA","birthName":"Michelle Renee Forbes Guajardo","height":"5' 9\" (1.75 m)","bio":"Michelle Forbes was born on January 8, 1965 in Austin, Texas, USA as Michelle Renee Forbes Guajardo. She is an actress, known for The Killing (2011), In Treatment (2008) and Battlestar Galactica (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5NTgwMjIxMDdeQTJeQWpwZ15BbWU3MDY2NTk0MTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000405","name":"Michelle Forbes","nicknames":["Mishka"],"idIMDB":"nm0000405"},"actorId":"nm0000405","character":"Admiral Helena Cain","urlCharacter":"http://www.imdb.com/character/ch0008088","main":true},{"actorName":"Graham Beckel","urlProfile":"http://www.imdb.com/name/nm0065320","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyODQzODg0N15BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 December 1949","placeOfBirth":" Old Lyme, Connecticut, USA","birthName":"Graham Stuart Beckel","bio":"Graham Beckel was born on December 22, 1949 in Old Lyme, Connecticut, USA as Graham Stuart Beckel. He is an actor and director, known for L.A. Confidential (1997), Brokeback Mountain (2005) and Leaving Las Vegas (1995). He has been married to Elizabeth Briggs Bailey since December 1, 1984.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyODQzODg0N15BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0065320","name":"Graham Beckel","nicknames":["Bud"],"idIMDB":"nm0065320"},"actorId":"nm0065320","character":"Colonel Jack Fisk","urlCharacter":"http://www.imdb.com/character/ch0042828","main":true}],"seasons":[],"idIMDB":"tt0991178","urlIMDB":"http://www.imdb.com/title/tt0991178","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Copyright ©2007 Universal Network Television LLC All rights reserved (on print)"},"technical":{"runtime":["1 hr 28 min (88 min) (original television)","1 hr 41 min (101 min) (unrated director's edition)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.7","filmingLocations":[{"location":"Vancouver Film Studios, Vancouver, British Columbia, Canada"}],"rated":"NOT RATED","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Presentation on Television","names":[]}]}]},{"award":"Hugo Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Hugo","categories":[{"category":"Best Dramatic Presentation - Short Form","names":[{"name":"Michael Taylor","id":"nm0852899","role":"written by"},{"name":"Félix Enríquez Alcalá","id":"nm0258066","role":"director"},{"name":"Wayne Rose","id":"nm1074029","role":"director"}]}]}]},{"award":"Visual Effects Society Awards 2008","titlesAwards":[{"titleAwardOutcome":"Won VES Award","categories":[{"category":"Outstanding Visual Effects in a Broadcast Miniseries, Movie, or Special","names":[{"name":"Mike Gibson","id":"nm1162892","role":null},{"name":"Gary Hutzel","id":"nm0404690","role":null},{"name":"Sean M. Jackson","id":"nm0414037","role":null},{"name":"Pierre Drolet","id":"nm1303914","role":null}]}]}]}],"votes":"17,035","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0080319","name":"Universal Network Television"},{"idCompany":"co0176813","name":"David Eick Productions"},{"idCompany":"co0140197","name":"R&D TV"}],"keywords":{"keywords":["space opera","lesbian","lesbian kiss","lesbian couple","woman in uniform","shipper","cylon","man in uniform"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:40:21"}}