{"data":{"movies":[{"title":"Reach Me","originalTitle":"","year":"2014","releaseDate":"20141121","directors":[{"name":"John Herzfeld","id":"nm0381273"}],"writers":[{"name":"John Herzfeld","id":"nm0381273"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4ODEwMjAzOF5BMl5BanBnXkFtZTgwMjk4ODY3MjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"A motivational book written by a mysterious man quickly gains popularity, inspiring a group of people that includes a journalist, his editor, a former inmate, a hip-hop mogul, an actor and an undercover cop to re-evaluate their choices and decisions by confronting their fears in hopes of creating more positive lives.","simplePlot":"A motivational book written by a mysterious man quickly gains popularity, inspiring a group of people that includes a journalist, his editor, a former inmate, a hip-hop mogul, an actor and ... ","actors":[{"actorName":"Lauren Cohan","urlProfile":"http://www.imdb.com/name/nm1659348","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MDg0MzgxOF5BMl5BanBnXkFtZTgwMzM5NDg1MzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1982","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"5' 7\" (1.7 m)","bio":"Lauren Cohan was born in 1982, in Philadelphia and lived in Cherry Hill Township, New Jersey during her childhood before moving to the United Kingdom. Lauren graduated from the University of Winchester / King Alfred's College where she studied Drama and English Literature, before touring with a theatre company she co-founded at the University. Lauren then split her time and work between London and Los Angeles, working on several films as well as some non-commercial projects.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MDg0MzgxOF5BMl5BanBnXkFtZTgwMzM5NDg1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1659348","name":"Lauren Cohan","idIMDB":"nm1659348"},"actorId":"nm1659348","character":"Kate","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kyra Sedgwick","urlProfile":"http://www.imdb.com/name/nm0001718","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MzAyNjIxM15BMl5BanBnXkFtZTcwNDg5Mzk0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1965","placeOfBirth":" New York City, New York, USA","birthName":"Kyra Minturn Sedgwick","height":"5' 5\" (1.65 m)","bio":"Kyra Minturn Sedgwick was born on August 19, 1965 in New York City, to Patricia (Rosenwald), a family and speech therapist, and Henry Dwight Sedgwick V, a venture capitalist. Her mother was from an upper-class German Jewish family, and her father was from a wealthy Massachusetts clan of English descent, with many prominent ancestors (including judge Theodore Sedgwick and educator Endicott Peabody). Sedgwick attended private schools. She made her professional acting debut at age 16 on the soap opera Another World (1964). A graduate of USC, Kyra has pursued a career that includes stage, screen and television. Kyra's reason for becoming an actor is that it gives her the ability to be compassionate and to walk around in the shoes of others. Her first brush with stardom came in Born on the Fourth of July (1989) as \"Donna\", the high school sweetheart of Tom Cruise. Two of her roles led to Golden Globe nominations: Miss Rose White (1992) and Something to Talk About (1995). She met her husband, Kevin Bacon, when they played leads in the television movie Lemon Sky (1988). They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MzAyNjIxM15BMl5BanBnXkFtZTcwNDg5Mzk0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001718","name":"Kyra Sedgwick","nicknames":["Kiko"],"idIMDB":"nm0001718"},"actorId":"nm0001718","character":"Colette","urlCharacter":"http://www.imdb.com/character/ch0467814","main":true},{"actorName":"Thomas Jane","urlProfile":"http://www.imdb.com/name/nm0005048","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgwMjMwNzAxNF5BMl5BanBnXkFtZTcwNzIwMDg4Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1969","placeOfBirth":" Baltimore, Maryland, USA","birthName":"Thomas Elliott","height":"5' 11\" (1.8 m)","bio":"Thomas Jane was born on February 22, 1969 in Baltimore, Maryland, USA as Thomas Elliott. He is an actor and producer, known for The Mist (2007), Deep Blue Sea (1999) and Dreamcatcher (2003). He was previously married to Patricia Arquette and Ayesha Hauer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgwMjMwNzAxNF5BMl5BanBnXkFtZTcwNzIwMDg4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005048","name":"Thomas Jane","idIMDB":"nm0005048"},"actorId":"nm0005048","character":"Wolfie","urlCharacter":"http://www.imdb.com/character/ch0467816","main":true},{"actorName":"Kevin Connolly","urlProfile":"http://www.imdb.com/name/nm0175305","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWYyODhkNTQtMWJiNy00MmQxLWE3MDItMGRjYzRkOTUyMTZlXkEyXkFqcGdeQXVyNzM5ODU2Njk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 March 1974","placeOfBirth":" New York City, New York, USA","height":"5' 5\" (1.65 m)","bio":"Kevin Connolly was born on March 5, 1974 in New York City, New York, USA. He is an actor and director, known for Entourage (2004), The Notebook (2004) and Unhappily Ever After (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWYyODhkNTQtMWJiNy00MmQxLWE3MDItMGRjYzRkOTUyMTZlXkEyXkFqcGdeQXVyNzM5ODU2Njk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0175305","name":"Kevin Connolly","idIMDB":"nm0175305"},"actorId":"nm0175305","character":"Roger","urlCharacter":"http://www.imdb.com/character/ch0467818","main":true},{"actorName":"Tom Sizemore","urlProfile":"http://www.imdb.com/name/nm0001744","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNTEzNzExOF5BMl5BanBnXkFtZTcwNTg4MTY3Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1961","placeOfBirth":" Detroit, Michigan, USA","birthName":"Thomas Edward Sizemore Jr.","height":"5' 11\" (1.8 m)","bio":"Tom Sizemore rose in prominence throughout the 1990s, establishing himself as a memorable tough-guy actor, sought by the most respected directors in the business. Thomas Edward Sizemore, Jr. was born in Detroit, Michigan, to Judith (Schannault), an ombudsman staff member, and Thomas Edward Sizemore, Sr., a lawyer and professor. Sizemore grew up idolizing the tough-guy characters of the movies he watched. After attending Wayne State University, he got his master's degree in theatre from Temple University in 1986. Like many, he moved to New York City and struggled, waiting tables and performing in plays. His first break came when Oliver Stone cast him in a bit part in Born on the Fourth of July (1989). Bigger roles soon followed throughout the early 1990s, such as Guilty by Suspicion (1991), True Romance (1993), and Striking Distance (1993). 1994 proved to be an even bigger year for Sizemore, as he won the role of \"Bat Masterson\" in Kevin Costner's star-studded biopic Wyatt Earp (1994), as well as one of his first truly memorable roles as \"Detective Jack Scagnetti\" in Oliver Stone's controversial Natural Born Killers (1994). In 1995 he appeared in Devil in a Blue Dress (1995), Strange Days (1995), as well as the acclaimed crime epic Heat (1995), directed by Michael Mann. Sizemore's first big leading role is in The Relic (1997), the big-budget effects thriller directed by Peter Hyams. According to a 2001 interview in The Calgary Sun, Sizemore entered a drug rehabilitation program in 1998 after his mother and his friend Robert De Niro appeared on his door-step during the filming of Witness to the Mob (1998). Telling him they were there to drive him to jail or to rehabilitation, Sizemore chose the latter. After completing rehabilitation, he counseled adolescents involved in substance abuse. Offered roles in W.W.II films directed by both Terrence Malick and Steven Spielberg, Sizemore chose the role of \"Sergeant Horvath\" in Saving Private Ryan (1998). The role and film received wide acclaim and introduced Sizemore's talents to a much broader audience in a more human and well-rounded role than he had previously been given. Sizemore also credits this shoot and Steven Spielberg for helping him with his recovery from addiction, with Steven Spielberg threatening to reshoot the entire film if Sizemore failed a drug test even once. After a flamboyant and uncredited mobster role in Enemy of the State (1998), Sizemore then portrayed a psychotic paramedic in Bringing Out the Dead (1999) directed by Martin Scorsese. Seemingly taking it easy, he then turned in fine but stereotypical performances in Play It to the Bone (1999), Red Planet (2000), and Pearl Harbor (2001). Sizemore then received another leading role in the high-profile military drama Black Hawk Down (2001) directed by yet another legendary director, Ridley Scott. Specializing in the sort of ultimate tough-guy/manly man roles that hearken back to a different era in film, Sizemore continues to be a favourite of Hollywood's greatest directors. Never afraid to speak his mind about anyone and anything, his sense of blunt honesty and lack of pretension is refreshing. A commanding voice and presence on film, Sizemore looks to continue as one of Hollywood's greatest actors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNTEzNzExOF5BMl5BanBnXkFtZTcwNTg4MTY3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001744","name":"Tom Sizemore","nicknames":["Tommy"],"idIMDB":"nm0001744"},"actorId":"nm0001744","character":"Frank","urlCharacter":"http://www.imdb.com/character/ch0467820","main":true},{"actorName":"Nelly","urlProfile":"http://www.imdb.com/name/nm0625099","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5MzAzNzM3NF5BMl5BanBnXkFtZTYwMzIzNDc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 November 1974","placeOfBirth":" Austin, Texas, USA","birthName":"Cornell Iral Haynes Jr.","height":"5' 8\" (1.73 m)","bio":"Nelly went to Spain with his father, Air Force Man Cornall Haynes Sr., until he was 3 years old, then moved to St. Louis. Nelly's folks struggled financially and split up when he was 7. As the youngest child in the neighborhood he grew up getting into trouble with the big kids. As a result he ended up moving around to live with various family members. He dreamed of playing pro baseball. In high school he formed a group called the St. Lunatics. The group consisted of him and some of his friends (Kyjuan, Murphy Lee, Slo Down, City Spud, and Ali) from high school. Nelly began listening to artists like Rakim, LL Cool J, Run-DMC, OutKast, Goodie Mob, and Jay-Z. He became convinced that his gift for rap could be parlayed into a career. He has his own style of rap which he likes to describe as a jazz form of hip-hop. The first song that Nelly and the St. Lunatics made was Gimmie What You Got. The song \"Gimmie What You Got\" sold 7,000 units regionally and dominated airwaves, rising to the number one spot on St. Louis' number one hip-hop station. After that song the St. Lunatics encouraged Nelly to go solo and he did. He signed a record deal with Universal Records.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5MzAzNzM3NF5BMl5BanBnXkFtZTYwMzIzNDc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0625099","name":"Nelly","idIMDB":"nm0625099"},"actorId":"nm0625099","character":"E-Ruption","urlCharacter":"http://www.imdb.com/character/ch0467819","main":true},{"actorName":"Omari Hardwick","urlProfile":"http://www.imdb.com/name/nm1165044","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNzE2OTIzNF5BMl5BanBnXkFtZTgwOTg5NzMzNjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1974","placeOfBirth":" Savannah, Georgia, USA","height":"5' 10\" (1.78 m)","bio":"Born \"Omari Latif Hardwick,\" he grew up in Decatur, Georgia. Hardwick's parents gave him a name to set a precedent, \"Omari\" meaning \"most high,\" and \"Latif\" meaning \"gentle.\" He shares, \"I in no way believe that I am the highest or most high, but I feel like my name gives me something to strive for.\" Growing up, sports were Hardwick's world, but early on he knew he had a passion for the arts. By the age of 14, Hardwick was writing poetry on a regular basis, a passion he would carry with him into adulthood. In high school, he excelled at basketball, baseball, and football, and went on to play football at the University of Georgia. Although a star on the field, Hardwick never gave up his passion for acting, and minored in theatre in college. He shares, \"I hugely attribute sports to my success in entertainment business. Being on the field taught me dedication and discipline - I already came from a strict household when I was growing up, sports just took that to another level. Whenever I approach a set, I always feel as though the cast, crew, director, are all part of a team. I have always married athletics and art, two huge parts of my life.\" After graduation, Hardwick relocated to San Diego for a spot on the San Diego Chargers (NFL) however a knee injury cut his football career short. He decided to revisit his original passion for acting, and moved to New York to study his craft more extensively. In New York, Hardwick studied off Broadway until 2000, when he made the move to Los Angeles. As a struggling actor, he worked odd jobs to pay for acting classes, however the security gigs and substitute teaching at times were not enough to make ends meet, and at one point he lived out of his car. Hardwick shares, \"what is so crazy, is that where I presently shoot my series 'Dark Blue,' is where I lived in my car when I first moved to Los Angeles. It is surreal at times.\" Hardwick's first big break came in 2003, when he was cast in his first major role as a series regular in Spike Lee's Sucker Free City (2004). Two years later, he landed the feature The Guardian (2006) and TNT's Saved (2006) - both of which he booked within a three-week span in 2005. He notes, \"I felt like I had arrived when I went back to one of my odd jobs that had let me go several years prior, and I looked out over Sunset Boulevard right next to the Chateau Marmont, and saw myself plastered on a billboard overlooking the city. I had to break down a little at that point, it was a big moment for me.\" Throughout 2007 - 2009 Hardwick worked on various projects, including guest starring on several television series, and filming several movies including Summit Entertainment's Next Day Air (2009) and Touchstone Picture's Miracle at St. Anna (2008). In 2008 he landed the role of \"Ty Curtis\" on the TNT series Dark Blue (2009). Season 1 aired throughout 2009. In addition to acting, Hardwick is a founding member of Plan B Inc. Theater Group, and a co-founder of Los Angeles Actor's Lounge. He has big plans for his production company, Bravelife, in 2010 as well, and plans on expanding the company. Hardwick also continues to work on his poetry, and has written over 4,000 poems.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNzE2OTIzNF5BMl5BanBnXkFtZTgwOTg5NzMzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1165044","name":"Omari Hardwick","idIMDB":"nm1165044"},"actorId":"nm1165044","character":"Dominic","urlCharacter":"http://www.imdb.com/character/ch0467821","main":true},{"actorName":"David O'Hara","urlProfile":"http://www.imdb.com/name/nm0641244","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMzY5MTgyMV5BMl5BanBnXkFtZTYwODE0Njk2._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1965","placeOfBirth":" Glasgow, Scotland, UK","height":"5' 10\" (1.78 m)","bio":"David O'Hara was born in Glasgow, Scotland, to Patrick and Martha O'Hara. After leaving school he was accepted for a Youth Opportunities Programme, at a community theatre based at the Glasgow Arts Centre. It toured local schools under the direction of Robin Peoples. David moved to London at age 17 to study at the Central School of Speech and Drama but left after two terms because of a shortage of funds. He went back to Scotland and landed a role in Bill Forsyth's \"Comfort and Joy,\" then returned to Central to finish his last term. He was understudy to Ralph Fiennes in \"A Midsummer Night's Dream.\" He performed in \"Romeo and Juliet\" as Tybalt, directed by Declan Donnallan for the New Shakespeare Company, at the Open Air Theatre in London's Regent Park, which was followed by a European tour. Other theatre credits include \"The Comedy of Errors\" at the Pleasance Theatre, Edinburgh, Scotland, and \"Aff the Other Man\" at the Haymarket. He spent a year at the Royal Shakespeare Company at Stratford and the Barbican, in \"Fashion,\" Jonathan Miller's production of \"Taming of the Shrew,\" \"Romeo and Juliet,\" \"Cymbeline,\" and \"Bite of the Night\" directed by Danny Boyle. His big break came as Stephen, the rampaging Irishman who joins forces with William Wallace (Mel Gibson), in \"Braveheart\" (1995). The following year saw him co-starring opposite Helen Mirren as a slightly independent policeman in Granada Television's \"Prime Suspect V: Errors in Judgment,\" which aired on PBS' \"Masterpiece Theatre\" in 1997. That same year, O'Hara also appeared in Alan J Pakula's \"The Devil's Own,\" was the romantic foil to Janeane Garofalo in \"The Matchmaker,\" portrayed a biker in the Scottish film \"The Slab Boys,\" and portrayed Bill Sykes in \"The Wonderful World of Disney\" adaptation of \"Oliver Twist\" (ABC).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMzY5MTgyMV5BMl5BanBnXkFtZTYwODE0Njk2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641244","name":"David O'Hara","idIMDB":"nm0641244"},"actorId":"nm0641244","character":"Thumper","urlCharacter":"http://www.imdb.com/character/ch0467821","main":true},{"actorName":"Kelsey Grammer","urlProfile":"http://www.imdb.com/name/nm0001288","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjkxODM5N15BMl5BanBnXkFtZTcwMTU3NDE1Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1955","placeOfBirth":" St. Thomas, U.S. Virgin Islands","birthName":"Allen Kelsey Grammer","height":"6' 1\" (1.85 m)","bio":"A five-time Emmy Award winner, Kelsey Grammer was born in Saint Thomas, U.S. Virgin Islands, to Sally (Cranmer), a singer, and Frank Allen Grammer, Jr., a musician and restaurateur. He was raised in New Jersey and Florida. Grammer was drawn to the works of William Shakespeare and spent two years at the prestigious Juilliard School. He then dove into the world of regional theater, eventually making the leap to Broadway with roles in \"Macbeth\" and \"Othello\". He joined the cast of the situation comedy Cheers (1982) in 1984. Grammer is the first actor in television history to receive multiple Emmy nominations for performing the same role on three series. He received two nominations for his original portrayal of Dr. Frasier Crane on Cheers (1982), another for his guest appearance in that role on Wings (1990), and nine nominations (earning four awards) as Outstanding Actor for his work on Frasier (1993). Over the years, Dr. Frasier Crane has become one of television's most endearing and enduring characters. In addition to his Emmy Awards, Grammer has won two Golden Globe Awards, two American Comedy Awards and a People's Choice Award for his portrait. Grammer's distinctive voice has been heard in several hit animated features, including the voice of Stinky Pete in Disney's hit Toy Story 2 (1999) and a role in Anastasia (1997). On television, he has also been seen in several mini-series and movies. In 1996, he hosted an hour-long salute to Jack Benny for which he served as executive producer. He also starred in HBO's award-winning comedy The Pentagon Wars (1998). Grammer's autobiography, \"So Far\", was published in fall 1995.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjkxODM5N15BMl5BanBnXkFtZTcwMTU3NDE1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001288","name":"Kelsey Grammer","idIMDB":"nm0001288"},"actorId":"nm0001288","character":"Angelo AldoBrandini","urlCharacter":"http://www.imdb.com/character/ch0467822","main":true},{"actorName":"Terry Crews","urlProfile":"http://www.imdb.com/name/nm0187719","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1ODY0NzE4N15BMl5BanBnXkFtZTcwMTY5Mzk0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1968","placeOfBirth":" Flint, Michigan, USA","birthName":"Terrence Alan Crews","height":"6' 3¼\" (1.91 m)","bio":"Terry Crews was born in Flint, Michigan, to Patricia and Terry Crews, Sr. He earned an Art Excellence Scholarship to attend Western Michigan University and also earned a full-ride athletic scholarship to play football. Crews was an All-Conference defensive end, and was a major contributor on the 1988 MAC champion WMU Broncos. His college success was rewarded in 1991, when he was drafted by the NFL's Los Angeles Rams. Crews played six years in the NFL, with stints at the L.A. Rams, San Diego Chargers , Rhein Fire (NFL Europe-Germany), Washington Redskins and Philadelphia Eagles. While in the NFL, used his art talent by painting a line of NFL licensed lithographs for Sierra Sun Editions. In 1996, Crews co-wrote and co-produced the independent feature film, \"Young Boys Incorporated\" (1996). Crews retired from the NFL in 1997 and moved to Los Angeles to pursue an acting career. Crews' first break came in 1999, when he auditioned for the extreme sports show called Battle Dome (1999), with other actor-athletes from around the country. Crews was chosen to be a series regular, known as the urban warrior, \"T-Money\". In 2000, Crews made his big screen debut in The 6th Day (2000). Since then, he has landed roles in Au service de Sara (2002), Friday After Next (2002), Deliver Us from Eva (2003), Malibu's Most Wanted (2003), Starsky & Hutch (2004), Soul Plane (2004), White Chicks (2004), and the Mike Judge film, Idiocracy (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1ODY0NzE4N15BMl5BanBnXkFtZTcwMTY5Mzk0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0187719","name":"Terry Crews","idIMDB":"nm0187719"},"actorId":"nm0187719","character":"Wilson","urlCharacter":"http://www.imdb.com/character/ch0467824","main":true},{"actorName":"Cary Elwes","urlProfile":"http://www.imdb.com/name/nm0000144","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUxNzY3NTAxNF5BMl5BanBnXkFtZTgwNjU4MDU0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1962","placeOfBirth":" London, England, UK","birthName":"Ivan Simon Cary Elwes","height":"6' (1.83 m)","bio":"Cary Elwes was born in Westminster, London, England, the third son of interior designer/shipping heiress Tessa Georgina Kennedy and the late portrait painter Bede Evelyn Dominick Elwes. He is the brother of producer/agent Cassian Elwes and artist Damian Elwes. He was raised in London and attended Harrow. After graduating from Harrow, he moved to the US and studied drama at Sarah Lawrence College. He left school after two years to begin his film career. Cary is well respected by colleagues and fans alike and considered by many to be one of the finest young actors working today. He is interested in history and says, \"It's deliberate that a lot of my films have been period pieces\". He is politically active for causes he believes in, such as protecting the environment and helping Native American people. Elwes is married to Lisa Marie Kurbikoff, a stills photographer. He comes from a long-established recusant English family on his father's side. Several prominent Catholic clerics are among his relatives, including Fr. Luke Cary-Elwes, Dom Columba Cary-Elwes, and Dom Cuthbert Cary-Elwes. His paternal great-grandfather was Chamberlain to the Pope. Cary (the surname \"Cary-Elwes\" was shortened to \"Elwes\" in some branches of the family) was an altar boy at London's Brompton Oratory, although he did not attend a Catholic high school. From his maternal grandmother, Daska Marija Ivanovic-Banac, who was born in Osijek in the Austra-Hungarian Empire (now in Croatia), he has Croatian Jewish and Serbian ancestry. Cary's other lineage is English, Irish, and Scottish.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUxNzY3NTAxNF5BMl5BanBnXkFtZTgwNjU4MDU0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000144","name":"Cary Elwes","idIMDB":"nm0000144"},"actorId":"nm0000144","character":"Kersey","urlCharacter":"http://www.imdb.com/character/ch0467827","main":true},{"actorName":"Tom Berenger","urlProfile":"http://www.imdb.com/name/nm0000297","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1OTQ5MzUzM15BMl5BanBnXkFtZTgwMDUxMTY1NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1949","placeOfBirth":" Chicago, Illinois, USA","birthName":"Thomas Michael Moore","height":"5' 11\" (1.8 m)","bio":"Born in Chicago, Oscar nominee, Golden Globe and Emmy winner Tom Berenger was raised in a working class home as the son of a printer for the Chicago Sun-Times. Tom attended the University of Missouri to study journalism. It was there he first auditioned for a role in \"Who's Afraid of Virginia Woolf\" at the college theater on a whim and a bet with a roommate. He was accepted for the role of \"Nick.\" After several stints in regional theater, Tom then attended the Herbert Berghof Studio School for Acting in New York City. While in New York, he pursued his professional career in theater and television. Tom's auspicious film debut in Looking for Mr. Goodbar (1977) led to other roles in films such as Eddie and the Cruisers (1983), The Big Chill (1983), Platoon (1986), Someone to Watch Over Me (1987), Shoot to Kill (1988), _Betrayed_, Last Rites (1988), Major League (1989), Shattered (1991), Gettysburg (1993), The Substitute (1996), Sniper (1993), Rough Riders (1997), Inception (2010), Hatfields & McCoys (2012), among many others.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1OTQ5MzUzM15BMl5BanBnXkFtZTgwMDUxMTY1NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000297","name":"Tom Berenger","idIMDB":"nm0000297"},"actorId":"nm0000297","character":"Teddy","urlCharacter":"http://www.imdb.com/character/ch0467826","main":true},{"actorName":"Sylvester Stallone","urlProfile":"http://www.imdb.com/name/nm0000230","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTk3NDU2OV5BMl5BanBnXkFtZTcwNTA3MTI0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1946","placeOfBirth":" New York City, New York, USA","birthName":"Sylvester Gardenzio Stallone","height":"5' 9½\" (1.77 m)","bio":"This athletically built, dark-haired American actor/screenwriter/director may never be mentioned by old-school film critics in the same breath as, say, Richard Burton or Alec Guinness; however, movie fans worldwide have been flocking to see Stallone's films for over 30 years, making \"Sly\" one of Hollywood's biggest-ever box office draws. Sylvester Stallone was born on July 6, 1946, in New York's gritty Hell's Kitchen, to Jackie Stallone (née Labofish), an astrologer, and Frank Stallone, a beautician and hairdresser. His father was an Italian immigrant, and his mother's heritage is half French (from Brittany) and half German. The young Stallone attended the American College of Switzerland and the University of Miami, eventually obtaining a B.A. degree. Initially, he struggled in small parts in films such as the soft-core The Party at Kitty and Stud's (1970), the thriller Klute (1971) and the comedy Bananas (1971). He got a crucial career break alongside fellow young actor Henry Winkler, sharing lead billing in the effectively written teen gang film The Lords of Flatbush (1974). Further film and television roles followed, most of them in uninspiring productions except for the opportunity to play a megalomaniac, bloodthirsty race driver named \"Machine Gun Joe Viterbo\" in the Roger Corman-produced Death Race 2000 (1975). However, Stallone was also keen to be recognized as a screenwriter, not just an actor, and, inspired by the 1975 Muhammad Ali-Chuck Wepner fight in Cleveland, Stallone wrote a film script about a nobody fighter given the \"million to one opportunity\" to challenge for the heavyweight title. Rocky (1976) became the stuff of cinematic legends, scoring ten Academy Award nominations, winning the Best Picture Award of 1976 and triggering one of the most financially successful movie franchises in history! Whilst full credit is wholly deserved by Stallone, he was duly supported by tremendous acting from fellow cast members Talia Shire, Burgess Meredith and Burt Young, and director John G. Avildsen gave the film an emotive, earthy appeal from start to finish. Stallone had truly arrived on his terms, and offers poured in from various studios eager to secure Hollywood's hottest new star. Stallone followed Rocky (1976) with F.I.S.T. (1978), loosely based on the life of Teamsters boss \"Jimmy Hoffa\", and Paradise Alley (1978) before pulling on the boxing gloves again to resurrect Rocky Balboa in the sequel Rocky II (1979). The second outing for the \"Italian Stallion\" wasn't as powerful or successful as the first \"Rocky\"; however, it still produced strong box office. Subsequent films Nighthawks (1981) and Victory (1981) failed to ignite with audiences, so Stallone was once again lured back to familiar territory with Rocky III (1982) and a fearsome opponent in \"Clubber Lang\" played by muscular ex-bodyguard Mr. T. The third \"Rocky\" installment far outperformed the first sequel in box office takings, but Stallone retired his prizefighter for a couple of years as another mega-franchise was about to commence for the busy actor. The character of Green Beret \"John Rambo\" was the creation of Canadian-born writer David Morrell, and his novel was adapted to the screen with Stallone in the lead role in First Blood (1982), also starring Richard Crenna and Brian Dennehy. The movie was a surprise hit that polarized audiences because of its commentary about the Vietnam war, which was still relatively fresh in the American public's psyche. Political viewpoints aside, the film was a worldwide smash, and a sequel soon followed with Rambo: First Blood Part II (1985), which drew even stronger criticism from several quarters owing to the film's plotline about American MIAs allegedly being held in Vietnam. But they say there is no such thing as bad publicity, and \"John Rambo's\" second adventure was a major money spinner for Stallone and cemented him as one of the top male stars of the 1980s. Riding a wave of amazing popularity, Stallone called on old sparring partner Rocky Balboa to climb back into the ring to defend American pride against a Soviet threat in the form of a towering Russian boxer named \"Ivan Drago\" played by curt Dolph Lundgren in Rocky IV (1985). The fourth outing was somewhat controversial with \"Rocky\" fans, as violence levels seemed excessive compared to previous \"Rocky\" films, especially with the savage beating suffered by Apollo Creed, played by Carl Weathers, at the hands of the unstoppable \"Siberian Express\". Stallone continued forward with a slew of macho character-themed films that met with a mixed reception from his fans. Cobra (1986) was a clumsy mess, Over the Top (1987) was equally mediocre, Rambo III (1988) saw Rambo take on the Russians in Afghanistan, and cop buddy film Tango & Cash (1989) just did not quite hit the mark, although it did feature a top-notch cast and there was chemistry between Stallone and co-star Kurt Russell. Philadelphia's favorite mythical boxer moved out of the shadows for his fifth screen outing in Rocky V (1990) tackling Tommy \"Machine\" Gunn played by real-life heavyweight fighter Tommy Morrison, the great-nephew of screen legend John Wayne. Sly quickly followed with the lukewarm comedy Oscar (1991), the painfully unfunny Stop! Or My Mom Will Shoot (1992), the futuristic action film Demolition Man (1993), and the comic book-inspired Judge Dredd (1995). Interestingly, Stallone then took a departure from the gung-ho steely characters he had been portraying to stack on a few extra pounds and tackle a more dramatically challenging role in the intriguing Cop Land (1997), also starring Robert De Niro and Ray Liotta. It isn't a classic of the genre, but Cop Land (1997) certainly surprised many critics with Stallone's understated performance. Stallone then lent his vocal talents to the animated adventure story Antz (1998), reprised the role made famous by Michael Caine in a terrible remake of Get Carter (2000), climbed back into a race car for Driven (2001), and guest-starred as the \"Toymaker\" in the third chapter of the immensely popular \"Spy Kids\" film series, Spy Kids 3-D: Game Over (2003). Showing that age had not wearied his two most popular franchises, Stallone has most recently brought back never-say-die boxer Rocky Balboa to star in, well, what else but Rocky Balboa (2006), and Vietnam veteran Rambo (2008) will reappear after a 20-year hiatus to once again right wrongs in the jungles of Thailand. Love him or loathe him, Sylvester Stallone has built an enviable and highly respected career in Hollywood; plus, he has considerably influenced modern popular culture through several of his iconic film characters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTk3NDU2OV5BMl5BanBnXkFtZTcwNTA3MTI0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000230","name":"Sylvester Stallone","nicknames":["Sly","Michael","The Italian Stallion","Binky","Sly Stallone"],"idIMDB":"nm0000230"},"actorId":"nm0000230","character":"Gerald","urlCharacter":"http://www.imdb.com/character/ch0467815","main":true},{"actorName":"Danny Aiello","urlProfile":"http://www.imdb.com/name/nm0000732","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTMxMjYzNzk5Nl5BMl5BanBnXkFtZTcwNzU4NDgwMw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1933","placeOfBirth":" New York City, New York, USA","birthName":"Daniel Louis Aiello Jr.","height":"6' 2½\" (1.89 m)","bio":"Danny Aiello was born on June 20, 1933 in New York City, New York, USA as Daniel Louis Aiello Jr. He is an actor and producer, known for Léon: The Professional (1994), Do the Right Thing (1989) and Il était une fois en Amérique (1984). He has been married to Sandy Cohen since January 8, 1955. They have four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTMxMjYzNzk5Nl5BMl5BanBnXkFtZTcwNzU4NDgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000732","name":"Danny Aiello","idIMDB":"nm0000732"},"actorId":"nm0000732","character":"Father Paul","urlCharacter":"http://www.imdb.com/character/ch0467832","main":true},{"actorName":"Danny Trejo","urlProfile":"http://www.imdb.com/name/nm0001803","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcxNTQ1ODQxMl5BMl5BanBnXkFtZTYwMzI4MDA2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1944","placeOfBirth":" Echo Park, Los Angeles, California, USA","birthName":"Dan Trejo","height":"5' 5¾\" (1.67 m)","bio":"Danny Trejo was born Dan Trejo in Echo Park, Los Angeles, to Alice (Rivera) and Dan Trejo, a construction worker. A child drug addict and criminal, Trejo was in and out of jail for 11 years. While serving time in San Quentin, he won the lightweight and welterweight boxing titles. Imprisoned for armed robbery and drug offenses, he successfully completed a 12-step rehabilitation program that changed his life. While speaking at a Cocaine Anonymous meeting in 1985, Trejo met a young man who later called him for support. Trejo went to meet him at what turned out to be the set of Runaway Train (1985). Trejo was immediately offered a role as a convict extra, probably because of his tough tattooed appearance. Also on the set was a screenwriter who did time with Trejo in San Quentin. Remembering Trejo's boxing skills, the screenwriter offered him $320 per day to train the actors for a boxing match. Director Andrey Konchalovskiy saw Trejo training Eric Roberts and immediately offered him a featured role as Roberts' opponent in the film. Trejo has subsequently appeared in many other films, usually as a tough criminal or villain. Trejo is of Mexican descent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcxNTQ1ODQxMl5BMl5BanBnXkFtZTYwMzI4MDA2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001803","name":"Danny Trejo","nicknames":["The Mayor"],"idIMDB":"nm0001803"},"actorId":"nm0001803","character":"Vic","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0959306","urlIMDB":"http://www.imdb.com/title/tt0959306","business":{"budget":{"money":"$5,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"01","month":"10","year":"2012","remarks":null},{"money":null,"country":null,"day":"03","month":"12","year":"2012","remarks":null}],"copyrightHolder":"Seraphim Films Productions"},"technical":{"runtime":["1 hr 35 min (95 min)","1 hr 28 min (88 min) (re-edited)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Red Epic"],"laboratory":["red lab"],"filmLength":null,"negativeFormat":["Redcode RAW"],"cinematographicProcess":["Digital Intermediate (master format)","Redcode RAW (5K) (source format)"],"printedFilmFormat":null},"rating":"4.9","metascore":"21","filmingLocations":[{"location":"El Segundo, California, USA"}],"rated":"PG-13","awards":[],"votes":"1,943","type":"Movie","companyCreditsSimple":[{"idCompany":"co0345289","name":"Seraphim Films Inc."},{"idCompany":"co0384378","name":"Windy Hill Pictures"}],"keywords":{"keywords":["fear","journalist","recluse","los angeles california","ensemble film","boss employee relationship","multi protagonist","author","phobia","crowd","self help guru","thug","actress","car crash","parole","ex prisoner","female prisoner","priest","confession booth","confession","police","self help book"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 00:44:49"}}