{"data":{"movies":[{"title":"Alvin and the Chipmunks","originalTitle":"","year":"2007","releaseDate":"20071214","directors":[{"name":"Tim Hill","id":"nm0384722"}],"writers":[{"name":"Jon Vitti","id":"nm0900140"},{"name":"Will McRobb","id":"nm0574509"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjdmNWY4MjItMjBiMi00MWNiLWI0ZjctYzBjZmEzOGRmNTc5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English","French","Spanish","Japanese"],"genres":["Animation","Comedy","Family","Fantasy","Music"],"plot":"In a tree farm, three musically inclined chipmunks, Alvin, Simon and Theodore, find their tree cut down and sent to Los Angeles. Once there, they meet the frustrated songwriter David Seville, and despite a poor house wrecking first impression, they impress him with their singing talent. Seeing the opportunity for success, both human and chipmunks make a pact for them to sing his songs. While that ambition proves a frustrating struggle with the difficult trio, the dream does come true after all. However, that success presents its own trials as their unscrupulous record executive, Ian Hawke, plans to break up this family to exploit the boys. Can Dave and the Chipmunks discover what they really value amid the superficial glamor around them?","simplePlot":"A struggling songwriter named Dave Seville finds success when he comes across a trio of singing chipmunks: mischievous leader Alvin, brainy Simon, and chubby, impressionable Theodore.","actors":[{"actorName":"Jason Lee","urlProfile":"http://www.imdb.com/name/nm0005134","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwOTk2MTMwN15BMl5BanBnXkFtZTcwOTE3MDUyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1970","placeOfBirth":" Orange, California, USA","birthName":"Jason Michael Lee","height":"6' 1½\" (1.87 m)","bio":"Born in Orange, California in 1970, Jason Lee is an American actor and film photographer. Well known for his professional skateboarding career in the very pivotal late 80s and early 90s, Lee would go on to pursue acting in 1993. He has worked in film, television, and voiceover, and with such directors as Kevin Smith, Cameron Crowe, Lawrence Kasdan and Brad Bird. Retiring from skateboarding in 1995, Lee has maintained solid ties to the industry, most notably through his partnership with longtime friend and fellow ex-professional skateboarder, Chris Pastras, and their now 25-year-old skate brand, Stereo Skateboards, which Lee co-manages with Pastras. In 2001, Lee dove headfirst into film photography and has been an active photographer and film advocate ever since, having had his work both published and exhibited throughout the years. In October 2016, Lee published a selection of small and large format Polaroid and Fuji instant film photographs spanning a decade as a special limited hardbound issue of Fort Worth-based Refueled Magazine. Only 500 signed and numbered copies were produced, and the issue quickly sold-out. Volume 2 of the 2-volume set, to be released in 2017, will be comprised of 4x5 color photographs made throughout Texas, where Lee currently resides with his wife, Ceren, a textiles and fashion designer, musician and mother. Lee is also the subject of a forthcoming documentary from director Greg Hunt that will take the viewer on the road with him as he exposes his remaining sheets of now-expired 8x10 Polaroid films, a favorite medium of Lee's, and one that is no longer being produced. An accompanying book of the large format Polaroids will be published, with the originals being exhibited. In 2017/2018, Lee will also be publishing and exhibiting selections of B&W slide film photographs that were made over the past 10 years. The print collections, one with its focus primarily on the West and Southwest, and the other being strictly California photographs, will consist of close to 200 combined images. He is also the founder of @filmphotographic, an Instagram film community gallery and resource page. \"It's been an incredible tool for showcasing the work of film photographers from around the world, as well as helping photographers connect,\" says Lee. While acting may come and go, the one constant has been and will continue to be his passion for photography and the ever present drive to grow his body of work. \"It's quite common that a creative person will often have a few outlets or interests or passions, but will gravitate toward one in particular in a unique way. For me, that has been photography, and for almost 16 years now. Not since the skateboarding days have I found something so invigorating, so fulfilling,\" Lee says. \"While I still enjoy acting and being a part of the bigger process, nothing quite compares to individual creative endeavors. And once I got locked into photography, it's really all I think about and desire to do. But I've had some pretty great opportunities as an actor, was able to make some movies for my kids, and have the experience of being on a really unique and enjoyable comedy series. But just as with skateboarding, photography is something much more personal, and more fitting to my creativity. It will always be the driving force.\" Follow Lee on Instagram at @jasonlee, @stereoskateboards, and @filmphotographic","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwOTk2MTMwN15BMl5BanBnXkFtZTcwOTE3MDUyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005134","name":"Jason Lee","idIMDB":"nm0005134"},"actorId":"nm0005134","character":"Dave","urlCharacter":"http://www.imdb.com/character/ch0000503","main":true},{"actorName":"David Cross","urlProfile":"http://www.imdb.com/name/nm0189144","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMzgwOTI1N15BMl5BanBnXkFtZTcwNTg5ODk2Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1964","placeOfBirth":" Atlanta, Georgia, USA","height":"5' 8\" (1.73 m)","bio":"David Cross was born on April 4, 1964 in Atlanta, Georgia, USA. He is an actor and writer, known for Eternal Sunshine of the Spotless Mind (2004), Small Soldiers (1998) and Kung Fu Panda (2008). He has been married to Amber Tamblyn since October 6, 2012. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMzgwOTI1N15BMl5BanBnXkFtZTcwNTg5ODk2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0189144","name":"David Cross","nicknames":["Crossy"],"idIMDB":"nm0189144"},"actorId":"nm0189144","character":"Ian","urlCharacter":"http://www.imdb.com/character/ch0050210","main":true},{"actorName":"Cameron Richardson","urlProfile":"http://www.imdb.com/name/nm0724460","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGJhMWI1MjItNTFkNS00OTVlLTlhYWYtNGQxM2IzYWI1MDYxXkEyXkFqcGdeQXVyOTYxNTg0OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1979","placeOfBirth":" Baton Rouge, Louisiana, USA","height":"5' 8\" (1.73 m)","bio":"Cameron Richardson is making her move into the industry spotlight. She starred opposite Jason Lee and Jane Lynch in 20th Century-Fox's hit Alvin and the Chipmunks (2007) and played a mentally-challenged character in the HBO series 12 Miles of Bad Road (2007), opposite Lily Tomlin and Mary Kay Place. Born in Baton Rouge, Louisiana, and raised in New Jersey, Cameron moved to New York to pursue a modeling career. It wasn't long before her agents recommended she try acting. She broke into the business with her work on the USA Network original series Cover Me: Based on the True Life of an FBI Family (2000). She landed the part on her very first audition.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGJhMWI1MjItNTFkNS00OTVlLTlhYWYtNGQxM2IzYWI1MDYxXkEyXkFqcGdeQXVyOTYxNTg0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0724460","name":"Cameron Richardson","idIMDB":"nm0724460"},"actorId":"nm0724460","character":"Claire","urlCharacter":"http://www.imdb.com/character/ch0112268","main":true},{"actorName":"Jane Lynch","urlProfile":"http://www.imdb.com/name/nm0528331","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MDcwOTA1M15BMl5BanBnXkFtZTcwNTQ2Njg0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 July 1960","placeOfBirth":" Dolton, Illinois, USA","birthName":"Jane Marie Lynch","height":"6' (1.83 m)","bio":"Jane Lynch was born on July 14, 1960 in Dolton, Illinois, USA as Jane Marie Lynch. She is an actress, known for Glee (2009), Wreck-It Ralph (2012) and The 40-Year-Old Virgin (2005). She was previously married to Lara Embry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MDcwOTA1M15BMl5BanBnXkFtZTcwNTQ2Njg0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0528331","name":"Jane Lynch","idIMDB":"nm0528331"},"actorId":"nm0528331","character":"Gail","urlCharacter":"http://www.imdb.com/character/ch0050212","main":true},{"actorName":"Justin Long","urlProfile":"http://www.imdb.com/name/nm0519043","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNTEwODY4NF5BMl5BanBnXkFtZTgwMzg0ODMwMjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 June 1978","placeOfBirth":" Fairfield, Connecticut, USA","birthName":"Justin Jacob Long","height":"5' 9\" (1.75 m)","bio":"A likable, boyish-looking actor with thick eyebrows and a friendly smile, Justin Long is a native of Connecticut. He was born and raised in Fairfield, the second of three sons. His father, R. James Long, is a Professor of Philosophy at Fairfield University, and his mother, Wendy Lesniak, is a former Broadway actress. He is of German, Sicilian, and Polish descent. He attended Fairfield Prep, and after graduating, he attended Vassar College. He first really showed his promise as a member of the comedy troupe \"LaughingStock.\" His performing talent garnered favorable notices and he won roles in some independent productions, notably Galaxy Quest (1999). However, he refused to act full time until after he graduated, which he did in 2000. He first gained notice when he played the nervous teenager Warren Cheswick in the TV series Ed (2000). The following year, he starred in the offbeat horror film Jeepers creepers - Le chant du diable (2001). The film, with its ghoulish ending, was a major hit on the horror circuit and raised his profile. He played the boyfriend of Britney Spears in Crossroads (2002), and won a supporting role in the Vince Vaughn comedy Dodgeball: A True Underdog Story (2004). He had high-profile roles in some offbeat independent films, most notably Raising Genius (2004) and Waiting... (2005), and scored commercial success again when he played Lindsay Lohan's boyfriend in Herbie Fully Loaded (2005). He continues to win acclaim and fans. He scored commercial success again with a role in the Jennifer Aniston romantic comedy The Break-Up (2006). He is private about his personal life and does not make a point of attending nightclubs and parties. However, his personal life did get scrutiny in 2008, due to his romance with actress Drew Barrymore that year. In addition to his film appearances, he is a spokesman for the Apple Mac computers, appearing with John Hodgman in its commercials.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNTEwODY4NF5BMl5BanBnXkFtZTgwMzg0ODMwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0519043","name":"Justin Long","nicknames":["The Mac Guy"],"idIMDB":"nm0519043"},"actorId":"nm0519043","character":"Alvin","urlCharacter":"http://www.imdb.com/character/ch0029484","main":true},{"actorName":"Matthew Gray Gubler","urlProfile":"http://www.imdb.com/name/nm1131557","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTAwNzE4NzAyMV5BMl5BanBnXkFtZTgwNzUzMTIyODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 March 1980","placeOfBirth":" Las Vegas, Nevada, USA","height":"6' 1\" (1.85 m)","bio":"Matthew Gray Gubler is an Emmy award winning actor, director, producer, painter, and voice over actor from Las Vegas Nevada. While studying film directing at NYU he interned for Wes Anderson who gave him his first feature film role as Bill Murray's loyal intern \"Nico\" in The Life Aquatic with Steve Zissou (2004). For the past eleven years Gubler has starred as the lovable genius Dr. Spencer Reid on the internationally popular crime drama Criminal Minds (2005). Some of his other film acting credits include 500 Days of Summer (2009), Life After Beth (2014), and the cult hit comedy Suburban Gothic (2014) for which he was awarded the 2015 Best Actor Award by Screamfest. In 2014 he won an Emmy for his participation in Drake Doremus' mini series The Beauty Inside (2012). He has provided the voice of Simon the chipmunk in the wildly popular Alvin and the Chipmunks (2007) film franchise and recently voiced the Riddler for DC comic's animated film Batman: Assault on Arkham (2014). As of 2015, Gubler has directed 8 episodes of Criminal Minds, a behind the scenes documentary of the making of \"The Life Aquatic,\" two music videos for \"The Killers,\" videos for \"Whirwlind Heat,\" and \"Soko,\" as well as a fake mockumentary entitled Matthew Gray Gubler: The Unauthorized Documentary (2006) which lampoons his behavior behind the scenes on \"Criminal Minds.\" Also and accomplished painter, Gubler is known for his vivid and expressionistic portraits of people, animals, and imaginary monsters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTAwNzE4NzAyMV5BMl5BanBnXkFtZTgwNzUzMTIyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1131557","name":"Matthew Gray Gubler","nicknames":["The Gube","MGG"],"idIMDB":"nm1131557"},"actorId":"nm1131557","character":"Simon","urlCharacter":"http://www.imdb.com/character/ch0038079","main":true},{"actorName":"Jesse McCartney","urlProfile":"http://www.imdb.com/name/nm0565366","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MDk3NzcwMF5BMl5BanBnXkFtZTcwMzUxODY4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1987","placeOfBirth":" New York City, New York, USA","birthName":"Jesse Abraham Arthur McCartney","height":"5' 10\" (1.78 m)","bio":"Born April 9, 1987 in Ardsley, New York, to Ginger and Scot McCartney, Jesse began his career in theater with a national revival tour of The King and I with Hayley Mills (1997/98), and a notable New York Production of A Christmas Carol (1998) with Roger Daltrey. Jesse got the part of 'Adam Chandler Jr.' on the show All My Children for which he would eventually Emmy nominations in 2001 and 2002. After a brief stint in a children's musical group Sugar Beats, and later in teen boy band Dream Street, Jesse was signed as a solo artist to Hollywood Records. He released his first full length album on September 28, 2004. His song, \"Beautiful Soul\" was an instant hit and the album of the same title was certified platinum on February 24, 2005. His Departure album yielded another smash single, \"Leavin',\" landing him a #1 spot on the charts and was Top 40 Radio's most played song of of the year. His next single \"How Do You Sleep\" also charted in the top 10 in the following year. His songwriting credits include co-writing the smash \"Bleeding Love\" for singer Leona Lewis, which was a #1 hit in 34 countries; the only song in over a decade to achieve this status. It also won ASCAP's song of the year and was nominated for a Grammy Award. In addition to starring in Keith, which won five international film festival awards, McCartney's film credits include the Tribeca Film Festival's darling Beware The Gonzo (opposite Ezra Miller) and Oren Peli's Chernobyl Diaries. McCartney has voiced numerous animated characters for films, video games, and television series including all of the Alvin and the Chipmunks films, Horton Hears a Who, Kingdom Hearts, and Cartoon Network's Young Justice. McCartney played lead role of 'Bradin Westerly' in the TV series Summerland, which ran for two years on The WB (now The CW). He also landed the lead in the pilot Locke and Key for Fox, based on Joe Hill's graphic novels of the same name. Other major TV credits include Fear The Walking Dead, Major Crimes, Greek, Law & Order SVU, and CSI: Las Vegas as well as a lengthy stint in the cast of Army Wives as 'Private Tim Truman.' Jesse currently resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MDk3NzcwMF5BMl5BanBnXkFtZTcwMzUxODY4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0565366","name":"Jesse McCartney","nicknames":["Jester","J-Mac","Jess","J"],"idIMDB":"nm0565366"},"actorId":"nm0565366","character":"Theodore","urlCharacter":"http://www.imdb.com/character/ch0032984","main":true},{"actorName":"Allison Karman","urlProfile":"http://www.imdb.com/name/nm2621044","urlPhoto":"","biography":{"bio":"Allison Karman is an actress and producer, known for Alvin and the Chipmunks (2007), Redbelt (2008) and Majestic and the Masked Man (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2621044","name":"Allison Karman","idIMDB":"nm2621044"},"actorId":"nm2621044","character":"Female Intern #1","urlCharacter":"http://www.imdb.com/character/ch0516984","main":true},{"actorName":"Tiara Parker","urlProfile":"http://www.imdb.com/name/nm2047090","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyODIxNTI1Nl5BMl5BanBnXkFtZTgwOTYyMjY0MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Tiara Parker is an actress and producer, known for Drive (2011), Crazy, Stupid, Love. (2011) and Alvin and the Chipmunks (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyODIxNTI1Nl5BMl5BanBnXkFtZTgwOTYyMjY0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2047090","name":"Tiara Parker","idIMDB":"nm2047090"},"actorId":"nm2047090","character":"Female Intern #2","urlCharacter":"http://www.imdb.com/character/ch0516984","main":true},{"actorName":"Kira Verrastro","urlProfile":"http://www.imdb.com/name/nm1576958","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjYyMDE5MDU1NV5BMl5BanBnXkFtZTcwMjY4Mzc3Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 8\" (1.73 m)","bio":"Kira Verrastro is an actress, known for Alvin and the Chipmunks (2007), The Caretaker (2008) and Extreme Movie (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjYyMDE5MDU1NV5BMl5BanBnXkFtZTcwMjY4Mzc3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1576958","name":"Kira Verrastro","idIMDB":"nm1576958"},"actorId":"nm1576958","character":"Female Intern #3","urlCharacter":"http://www.imdb.com/character/ch0516984","main":true},{"actorName":"Veronica Alicino","urlProfile":"http://www.imdb.com/name/nm0019585","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NDg3MDY3OV5BMl5BanBnXkFtZTgwNTQ2MTM5MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 July 1960","placeOfBirth":"","height":"5' 5\" (1.65 m)","bio":"Veronica Alicino Was born in South Plainfield, New Jersey in the US of A. And Veronica Alicino has been a professional actress since the age of 17. She has performed leading roles in over fifty Off Broadway and Off Broadway theatrical productions and she performed Stand Up Comedy and Sketch Comedy in NYC and Los Angeles. She was the Notorious Emcee at the Cinema Cafe' s Stand Up night . She's has directed several one act plays.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NDg3MDY3OV5BMl5BanBnXkFtZTgwNTQ2MTM5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0019585","name":"Veronica Alicino","nicknames":["Roni"],"idIMDB":"nm0019585"},"actorId":"nm0019585","character":"Amy","urlCharacter":"http://www.imdb.com/character/ch0050213","main":true},{"actorName":"Beth Riesgraf","urlProfile":"http://www.imdb.com/name/nm0726360","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMGM1ZDMtMmVlMS00Y2I1LTk5OGMtZDgwZThjMGU1ZmEzL2ltYWdlXkEyXkFqcGdeQXVyMzg2ODQ1Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1978","placeOfBirth":" USA","birthName":"Beth Jean Riesgraf","height":"5' 7\" (1.7 m)","bio":"Beth Riesgraf was born on August 24, 1978 in the USA as Beth Jean Riesgraf. She is an actress and director, known for Leverage (2008), Alvin and the Chipmunks (2007) and Let's Be Civil, Kenneth! (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMGM1ZDMtMmVlMS00Y2I1LTk5OGMtZDgwZThjMGU1ZmEzL2ltYWdlXkEyXkFqcGdeQXVyMzg2ODQ1Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0726360","name":"Beth Riesgraf","idIMDB":"nm0726360"},"actorId":"nm0726360","character":"Mother in Store","urlCharacter":"http://www.imdb.com/character/ch0050214","main":true},{"actorName":"Adriane Lenox","urlProfile":"http://www.imdb.com/name/nm0502180","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMTU3Nzk2Nl5BMl5BanBnXkFtZTcwNDI4MzA1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1956","placeOfBirth":" Memphis, Tennessee, USA","bio":"Adriane Lenox was born on September 11, 1956 in Memphis, Tennessee, USA. She is an actress, known for The Blind Side (2009), Black Snake Moan (2006) and Lee Daniels' The Butler (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMTU3Nzk2Nl5BMl5BanBnXkFtZTcwNDI4MzA1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0502180","name":"Adriane Lenox","idIMDB":"nm0502180"},"actorId":"nm0502180","character":"Vet","urlCharacter":"http://www.imdb.com/character/ch0184655","main":true},{"actorName":"Don Tiffany","urlProfile":"http://www.imdb.com/name/nm1484301","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5ODk2MDM1Ml5BMl5BanBnXkFtZTcwNjQ1OTkyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Don Tiffany is an actor, known for Ocean's Twelve (2004), Alvin and the Chipmunks (2007) and Le fantasme de Bobo (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5ODk2MDM1Ml5BMl5BanBnXkFtZTcwNjQ1OTkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1484301","name":"Don Tiffany","nicknames":["Tiff"],"idIMDB":"nm1484301"},"actorId":"nm1484301","character":"Engineer","urlCharacter":"http://www.imdb.com/character/ch0516986","main":true},{"actorName":"Lorne Green","urlProfile":"http://www.imdb.com/name/nm0338111","urlPhoto":"","biography":{"bio":"Lorne Green is an actor, known for Alvin and the Chipmunks (2007), Bare Exposure (1993) and Underground (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0338111","name":"Lorne Green","idIMDB":"nm0338111"},"actorId":"nm0338111","character":"Director","urlCharacter":"http://www.imdb.com/character/ch0516987","main":true}],"seasons":[],"idIMDB":"tt0952640","urlIMDB":"http://www.imdb.com/title/tt0952640","business":{"budget":{"money":"$60,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$44,307,417","country":"USA","day":"16","month":"12","year":"2007","remarks":"3,475 Screens"},{"money":"£1,433,937","country":"UK","day":"23","month":"12","year":"2007","remarks":"375 Screens"},{"money":"BRL 1,455,851","country":"Brazil","day":"06","month":"01","year":"2008","remarks":"277 Screens"}],"gross":[{"money":"$217,326,336","country":"USA","day":"01","month":"06","year":"2008","remarks":""},{"money":"$217,324,128","country":"USA","day":"25","month":"05","year":"2008","remarks":""},{"money":"$217,308,635","country":"USA","day":"18","month":"05","year":"2008","remarks":""},{"money":"$217,292,442","country":"USA","day":"11","month":"05","year":"2008","remarks":""},{"money":"$217,272,684","country":"USA","day":"04","month":"05","year":"2008","remarks":""},{"money":"$217,235,428","country":"USA","day":"27","month":"04","year":"2008","remarks":""},{"money":"$217,172,612","country":"USA","day":"20","month":"04","year":"2008","remarks":""},{"money":"$217,075,500","country":"USA","day":"13","month":"04","year":"2008","remarks":""},{"money":"$216,873,487","country":"USA","day":"06","month":"04","year":"2008","remarks":""},{"money":"$216,501,860","country":"USA","day":"30","month":"03","year":"2008","remarks":""},{"money":"$215,760,497","country":"USA","day":"23","month":"03","year":"2008","remarks":""},{"money":"$215,163,603","country":"USA","day":"16","month":"03","year":"2008","remarks":""},{"money":"$214,434,383","country":"USA","day":"09","month":"03","year":"2008","remarks":""},{"money":"$213,675,858","country":"USA","day":"02","month":"03","year":"2008","remarks":""},{"money":"$212,867,991","country":"USA","day":"24","month":"02","year":"2008","remarks":""},{"money":"$211,812,206","country":"USA","day":"17","month":"02","year":"2008","remarks":""},{"money":"$209,927,879","country":"USA","day":"10","month":"02","year":"2008","remarks":""},{"money":"$207,623,154","country":"USA","day":"03","month":"02","year":"2008","remarks":""},{"money":"$204,121,451","country":"USA","day":"27","month":"01","year":"2008","remarks":""},{"money":"$198,813,230","country":"USA","day":"20","month":"01","year":"2008","remarks":""},{"money":"$187,943,374","country":"USA","day":"13","month":"01","year":"2008","remarks":""},{"money":"$176,283,861","country":"USA","day":"06","month":"01","year":"2008","remarks":""},{"money":"$153,632,443","country":"USA","day":"30","month":"12","year":"2007","remarks":""},{"money":"$94,476,107","country":"USA","day":"23","month":"12","year":"2007","remarks":""},{"money":"$44,307,417","country":"USA","day":"16","month":"12","year":"2007","remarks":""},{"money":"£11,080,538","country":"UK","day":"02","month":"03","year":"2008","remarks":""},{"money":"£10,855,535","country":"UK","day":"24","month":"02","year":"2008","remarks":""},{"money":"£10,193,434","country":"UK","day":"17","month":"02","year":"2008","remarks":""},{"money":"£9,504,576","country":"UK","day":"10","month":"02","year":"2008","remarks":""},{"money":"£9,238,579","country":"UK","day":"03","month":"02","year":"2008","remarks":""},{"money":"£8,690,573","country":"UK","day":"27","month":"01","year":"2008","remarks":""},{"money":"£7,983,154","country":"UK","day":"20","month":"01","year":"2008","remarks":""},{"money":"£7,140,299","country":"UK","day":"13","month":"01","year":"2008","remarks":""},{"money":"£6,120,606","country":"UK","day":"06","month":"01","year":"2008","remarks":""},{"money":"£3,653,124","country":"UK","day":"30","month":"12","year":"2007","remarks":""},{"money":"£1,433,937","country":"UK","day":"23","month":"12","year":"2007","remarks":""},{"money":"BRL 9,281,350","country":"Brazil","day":"17","month":"02","year":"2008","remarks":""},{"money":"BRL 9,089,414","country":"Brazil","day":"10","month":"02","year":"2008","remarks":""},{"money":"BRL 8,805,509","country":"Brazil","day":"03","month":"02","year":"2008","remarks":""},{"money":"BRL 7,586,225","country":"Brazil","day":"27","month":"01","year":"2008","remarks":""},{"money":"BRL 6,054,669","country":"Brazil","day":"20","month":"01","year":"2008","remarks":""},{"money":"BRL 4,114,198","country":"Brazil","day":"13","month":"01","year":"2008","remarks":""},{"money":"BRL 1,455,851","country":"Brazil","day":"06","month":"01","year":"2008","remarks":""}],"weekendGross":[{"money":"$1,118","country":"USA","day":"01","month":"06","year":"2008","remarks":"3 Screens"},{"money":"$10,884","country":"USA","day":"25","month":"05","year":"2008","remarks":"20 Screens"},{"money":"$12,789","country":"USA","day":"18","month":"05","year":"2008","remarks":"32 Screens"},{"money":"$14,942","country":"USA","day":"11","month":"05","year":"2008","remarks":"53 Screens"},{"money":"$23,892","country":"USA","day":"04","month":"05","year":"2008","remarks":"81 Screens"},{"money":"$47,593","country":"USA","day":"27","month":"04","year":"2008","remarks":"126 Screens"},{"money":"$71,469","country":"USA","day":"20","month":"04","year":"2008","remarks":"176 Screens"},{"money":"$139,516","country":"USA","day":"13","month":"04","year":"2008","remarks":"227 Screens"},{"money":"$242,193","country":"USA","day":"06","month":"04","year":"2008","remarks":"298 Screens"},{"money":"$450,980","country":"USA","day":"30","month":"03","year":"2008","remarks":"354 Screens"},{"money":"$372,057","country":"USA","day":"23","month":"03","year":"2008","remarks":"404 Screens"},{"money":"$478,797","country":"USA","day":"16","month":"03","year":"2008","remarks":"461 Screens"},{"money":"$531,479","country":"USA","day":"09","month":"03","year":"2008","remarks":"593 Screens"},{"money":"$662,436","country":"USA","day":"02","month":"03","year":"2008","remarks":"701 Screens"},{"money":"$748,476","country":"USA","day":"24","month":"02","year":"2008","remarks":"698 Screens"},{"money":"$1,547,015","country":"USA","day":"17","month":"02","year":"2008","remarks":"995 Screens"},{"money":"$1,823,016","country":"USA","day":"10","month":"02","year":"2008","remarks":"1,465 Screens"},{"money":"$2,783,913","country":"USA","day":"03","month":"02","year":"2008","remarks":"1,958 Screens"},{"money":"$4,512,318","country":"USA","day":"27","month":"01","year":"2008","remarks":"2,430 Screens"},{"money":"$9,433,049","country":"USA","day":"20","month":"01","year":"2008","remarks":"2,962 Screens"},{"money":"$9,302,895","country":"USA","day":"13","month":"01","year":"2008","remarks":"3,384 Screens"},{"money":"$15,546,125","country":"USA","day":"06","month":"01","year":"2008","remarks":"3,462 Screens"},{"money":"$41,257,874","country":"USA","day":"30","month":"12","year":"2007","remarks":"3,484 Screens"},{"money":"$38,609,310","country":"USA","day":"23","month":"12","year":"2007","remarks":"3,499 Screens"},{"money":"$44,307,417","country":"USA","day":"16","month":"12","year":"2007","remarks":"3,475 Screens"},{"money":"£199,761","country":"UK","day":"02","month":"03","year":"2008","remarks":"320 Screens"},{"money":"£354,162","country":"UK","day":"24","month":"02","year":"2008","remarks":"329 Screens"},{"money":"£340,927","country":"UK","day":"17","month":"02","year":"2008","remarks":"347 Screens"},{"money":"£219,273","country":"UK","day":"10","month":"02","year":"2008","remarks":"376 Screens"},{"money":"£467,620","country":"UK","day":"03","month":"02","year":"2008","remarks":"424 Screens"},{"money":"£612,712","country":"UK","day":"27","month":"01","year":"2008","remarks":"437 Screens"},{"money":"£715,022","country":"UK","day":"20","month":"01","year":"2008","remarks":"420 Screens"},{"money":"£791,193","country":"UK","day":"13","month":"01","year":"2008","remarks":"403 Screens"},{"money":"£1,096,851","country":"UK","day":"06","month":"01","year":"2008","remarks":"386 Screens"},{"money":"£1,370,313","country":"UK","day":"30","month":"12","year":"2007","remarks":"383 Screens"},{"money":"£1,433,937","country":"UK","day":"23","month":"12","year":"2007","remarks":"375 Screens"},{"money":"BRL 105,746","country":"Brazil","day":"17","month":"02","year":"2008","remarks":"171 Screens"},{"money":"BRL 220,656","country":"Brazil","day":"10","month":"02","year":"2008","remarks":"213 Screens"},{"money":"BRL 284,926","country":"Brazil","day":"03","month":"02","year":"2008","remarks":"238 Screens"},{"money":"BRL 658,307","country":"Brazil","day":"27","month":"01","year":"2008","remarks":"248 Screens"},{"money":"BRL 834,384","country":"Brazil","day":"20","month":"01","year":"2008","remarks":"165 Screens"},{"money":"BRL 1,137,235","country":"Brazil","day":"13","month":"01","year":"2008","remarks":"265 Screens"},{"money":"BRL 1,455,851","country":"Brazil","day":"06","month":"01","year":"2008","remarks":"277 Screens"}],"admissions":[{"money":"1,355,136","country":"Brazil","day":"17","month":"02","year":"2008","remarks":""},{"money":"1,323,280","country":"Brazil","day":"10","month":"02","year":"2008","remarks":""},{"money":"1,281,286","country":"Brazil","day":"03","month":"02","year":"2008","remarks":""},{"money":"1,081,386","country":"Brazil","day":"27","month":"01","year":"2008","remarks":""},{"money":"848,303","country":"Brazil","day":"20","month":"01","year":"2008","remarks":""},{"money":"560,416","country":"Brazil","day":"13","month":"01","year":"2008","remarks":""},{"money":"170,950","country":"Brazil","day":"06","month":"01","year":"2008","remarks":""},{"money":"432,597","country":"Netherlands","day":"31","month":"12","year":"2008","remarks":""},{"money":"82,416","country":"Norway","day":"17","month":"02","year":"2008","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"Twentieth Century Fox Film Corporation, Regency Entertainment (USA), Inc. and Dune Entertainment LLC in the U.S. only; Twentieth Century Fox Film Corporation, Monarchy Entertprises S.a.r.l. and Dune Entertainment LLC in all other territories except Brazil, Italy, Japan, Korea and Spain; TCF Hungary Film Rights Exploitation Limited Liability Company, Twentieth Century Fox Film Corporation, Monarchy Enterprises S.a.r.l. and Dune Entertainment LLC in Brazil, Italy, Japan, Korea and Spain"},"technical":{"runtime":["1 hr 32 min (92 min)"],"soundMix":["Dolby","Dolby Digital","DTS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"5.2","metascore":"39","filmingLocations":[{"location":"St. Andrews Bungalow Court, Hollywood, Los Angeles, California, USA"}],"rated":"PG","awards":[{"award":"BMI Film & TV Awards 2008","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"","names":[{"name":"Christopher Lennertz","id":"nm0501999","role":null}]}]}]},{"award":"KIDS FIRST! Film Festival 2008","titlesAwards":[{"titleAwardOutcome":"2nd place KIDS FIRST! Best Award","categories":[{"category":"Feature Film, Ages 5-8","names":[{"name":"Twentieth Century-Fox Home Entertainment","id":null,"role":null}]}]}]},{"award":"Kids' Choice Awards, USA 2008","titlesAwards":[{"titleAwardOutcome":"Won Blimp Award","categories":[{"category":"Favorite Movie","names":[]}]}]},{"award":"Young Artist Awards 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Family Feature Film (Fantasy or Musical)","names":[]}]}]}],"votes":"60,127","type":"Movie","companyCreditsSimple":[{"idCompany":"co0017497","name":"Fox 2000 Pictures"},{"idCompany":"co0021592","name":"Regency Enterprises"},{"idCompany":"co0026227","name":"Bagdasarian Productions"}],"keywords":{"keywords":["fart joke","concert","talking animal","based on cartoon","chipmunk","songwriter","remote controlled toy truck","new york city new york","barefoot cartoon animal","half dressed cartoon animal","reference to spongebob squarepants","waste container","guitar pick","plate dishware","knife","fork","dodge viper srt 10","first part","robosapien v2","chicago illinois","snack","fired from a job","infiniti g35","triumph motor company","car","remote controlled toy helicopter","los angeles california","razor","shaving cream","pants","t shirt","necktie","suit","suitcase","nickelodeon","remote control","table","chair","couch","pillow","bed","triumph the car","air horn","las vegas nevada","cincinnati ohio","apple computer","apple macbook","mercedes benz slc","telephone call","yum able bar","porsche 911 carrera s cabrio","good able bar","clap cinema","megaphone","lincoln motor company","ford f600 pickup truck","forest","skateboard","surfboard","target","crayola","chocolate","raisin","pool","utz quality foods","tennis court","tennis ball","sony","cgi","basketball hoop","pen","paper","dollar","money","activision","bluetooth headset","bluetooth","headquarters","spongebob squarepants","samsung","national basketball association","reference to jett records","jett records","drinking champagne","eating a cheese ball","nba","ford truck","reference to youtube","crayon","telephone wireless","vtech","telephone","cake","chocolate meatball","reference to rat","guitar","guitar hero","bongo drum","piano","spray breath","spray","panasonic","hyundai","xbox 360 wireless racing wheel","guitar hero x plorer controller for xbox 360","cheese ball","chimney","acura","dinner by candlelight","eating a spaghetti","spaghetti and meatballs","volvo c70","toyota mr2","toyota celica","saleen s7","prevost h3 45","can am spyder","cadillac escalade","acura integra","mercedes benz","shaving a beard","microwave","paris france","balloon","canon camera","milkshake","santa claus","compass","billboard magazine","porsche","infiniti","cadillac automobile","volvo","ford motor company","dodge the car","hummer h2","volvo car","toyota","hyundai sonata","reference to justin timberlake","reference to fergie","adidas","lincoln town car stretched limousine","play doh","triumph tr4","cartoon on tv","goldfish crackers","television","toy helicopter","tv","quaker","lucky charms cereal","energy bar","xbox 360","animal name in title","blockbuster","based on tv series","wine","whipped cream","water","wallet","waffles","vacuum cleaner","ukulele","toy","toy robot","toothbrush","toaster","tennis shoes","tape recorder","stuffed animal","stage fright","squirrel","songwriting","sitting on a rooftop","shopping cart","sheet music","shaving","seeing eye dog","security guard","seashell","savings bond","rooftop","record company","rain","poster","pineapple","philodendron","paper clip","paper airplane","orchid","note","muffin","motorcycle","milk","maid","magazine","lobby","lip synching","laptop computer","ladder","keyboard","hula hoop","hollywood sign","helium inhalation","helium balloon","grocery store","globe","full moon","fountain","fireplace","ferrari","female doctor","eyeglasses","elevator","electric guitar","drum kit","dishwashing machine","cupboard","cowry","convertible","concert tour","compact disc","coffee","clock","christmas tree","christmas gift","champagne","chainsaw","cell phone","ceiling fan","cash","candle","camera","calendar","cage","breath freshener","breakfast cereal","box","bowl","bongos","basket","barking dog","acoustic guitar","music tour","music industry","mansion","father son relationship","exploitation","christmas","animal exploitation","part computer animation","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:19:26"}}