{"data":{"movies":[{"title":"Urban Justice","originalTitle":"","year":"2007","releaseDate":"20071113","directors":[{"name":"Don E. FauntLeRoy","id":"nm0005703"}],"writers":[{"name":"Gilmar Fortis II","id":"nm0287344"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTA1NjY4OV5BMl5BanBnXkFtZTcwOTM3OTQ1MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Crime","Thriller"],"plot":"Seagal plays a man with a dark and violent past, who seeks revenge for the murder of his son.","simplePlot":"Seagal plays a man with a dark and violent past, who seeks revenge for the murder of his son.","actors":[{"actorName":"Steven Seagal","urlProfile":"http://www.imdb.com/name/nm0000219","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNTU4ODcyMV5BMl5BanBnXkFtZTYwMzkyMjA1._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1952","placeOfBirth":" Lansing, Michigan, USA","birthName":"Steven Frederic Seagal","height":"6' 4\" (1.93 m)","bio":"Steven Seagal is a striking and somewhat boyishly handsome (often with ponytail) action star who burst onto the martial arts film scene in 1988 in the fast-paced Warner Bros. film Above the Law (1988). Steven Frederic Seagal was born in Lansing, Michigan, to Patricia Anne (Fisher), a medical technician, and Samuel Seagal, a high school math teacher. His paternal grandparents were Russian Jewish immigrants, and his mother had English, German, and Dutch ancestry. The enigmatic Seagal commenced his martial arts training at the age of seven under the tutelage of well-known karate instructor and author Fumio Demura, and in the 1960s commenced his aikido training in Orange County, CA, under the instruction of Harry Ishisaka. Seagal received his first dan accreditation in 1974, after he had moved to Japan to further his martial arts training. After spending many years there honing his skills, he achieved the ranking of a 7th dan in the Japanese martial art \"aikido\" and was instructing wealthy clients in Los Angeles when he came to the attention of Hollywood power broker Michael Ovitz. Ovitz saw star value in the imposing-looking Seagal. The high-octane action movie genre was in full swing in the late 1980s, and Seagal's debut movie, \"Above the Law\", was wildly received by action fans and actually received some complimentary critical reviews. He followed up \"Above the Law\" with another slam-bang thriller, Hard to Kill (1990), as a cop shot in an ambush by the mob who revives from a coma to take his revenge. The movie also starred Seagal's wife at the time, leggy Kelly LeBrock, who was married to him from 1987 to 1996 and is the mother of three of his children. His next outing was battling voodoo-using Jamaican drug \"posses\" in the hyper-violent Marked for Death (1990), before returning to fight psychotic mob gangster William Forsythe in the even more punishing Out for Justice (1991). Seagal was by now enormously popular, and his next movie, the big-budgeted Piège en haute mer (1992), set aboard the battleship USS Missouri and also starring Tommy Lee Jones and Gary Busey, was arguably his best film to date, impressing both fans and critics alike. Seagal's fighting style was rather different from that of other on-screen martial arts dynamos such as Bruce Lee, Chuck Norris and Jean-Claude Van Damme, who were predominantly fighters from striking arts background such as karate or tang soo do. However, aikido is built around using an opponent's inertia and body weight to employ various locks, chokes and holds that incapacitate him. Seagal carries himself differently, too, and often appears wearing Italian designer clothes and usually favors an all-black outfit, generally with a three-quarter-length coat with an elaborate trim. Additionally, Seagal's on-screen characters were often seemingly benign or timid individuals; however, when the going gets rough they reveal themselves to be deadly ex-CIA operatives, or retired Special Forces soldiers capable of enormous destruction! As his box-office drawing power grew, Seagal began to infuse his film projects with his personal and spiritual beliefs, especially concerning the abuse of the environment. He appeared as an oil fire expert who turns against his corrupt CEO (played by Michael Caine) in On Deadly Ground (1994) to save the Eskimo population from an oil disaster; in Fire Down Below (1997) he plays an environmental agency troubleshooter investigating the dumping of toxic waste in Kentucky coal mines, and in the slow-moving The Patriot (1998) he plays a medical specialist trying to stop a lethal virus unleashed by an extremist group. Action fans struggled to come to terms with social messaging being built into bone-crunching fight films; however, Seagal's box-office clout remained fairly strong, and more traditional chopsocky projects followed with the \"buddy cop\" film The Glimmer Man (1996), then almost a cameo role as a Navy SEAL alongside CIA analyst Kurt Russell before Seagal is sucked out of a jet at 35,000 feet in Executive Decision (1996). In 1999 Seagal took a different turn in his film projects with the surprising genteel Prince of Central Park (2000), about a child living inside NYC's most famous park. He returned to more familiar territory with further high-voltage, guns-blazing action in Exit Wounds (2001), Mission Alcatraz (2002), Out for a Kill (2003) and Un aller pour l'enfer (2003). Unbeknownst to many, in 1997 Seagal publicly announced that one of his Buddhist teachers, His Holiness Penor Rinpoche, had accorded Seagal as a tulku, the reincarnation of a Buddhist Lama. This initial announcement was met with some disbelief until Penor Rinpoche himself gave a confirmation statement on Seagal's new title. Seagal has repeatedly discussed his involvement in Buddhism and how he devotes many hours studying and meditating this ancient Eastern religion. While his box-office appeal has somewhat declined from his halcyon blockbusters of the mid-'90s, Seagal still has a very loyal fan base in the action movie genre and continues to remain a highly bankable star.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNTU4ODcyMV5BMl5BanBnXkFtZTYwMzkyMjA1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000219","name":"Steven Seagal","nicknames":["The Great One","Lord Steven","The Master of Aikido"],"idIMDB":"nm0000219"},"actorId":"nm0000219","character":"Simon Ballister","urlCharacter":"http://www.imdb.com/character/ch0039040","main":true},{"actorName":"Eddie Griffin","urlProfile":"http://www.imdb.com/name/nm0341176","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTQwNjkxNl5BMl5BanBnXkFtZTgwMzAxODkzMDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1968","placeOfBirth":" Kansas City, Missouri, USA","height":"5' 7\" (1.7 m)","bio":"Eddie Griffin was born on July 15, 1968 in Kansas City, Missouri, USA. He is known for his work on Malcolm & Eddie (1996), Undercover Brother (2002) and Deuce Bigalow: Male Gigolo (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTQwNjkxNl5BMl5BanBnXkFtZTgwMzAxODkzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341176","name":"Eddie Griffin","idIMDB":"nm0341176"},"actorId":"nm0341176","character":"Armand Tucker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carmen Serano","urlProfile":"http://www.imdb.com/name/nm0784831","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4ODQxODkwN15BMl5BanBnXkFtZTgwNzgxNjQwODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1973","placeOfBirth":" Chula Vista, California, USA","birthName":"Carmen Maria Robles","height":"5' 6\" (1.68 m)","bio":"Carmen Serano was born on August 18, 1973 in Chula Vista, California, USA as Carmen Maria Robles. She is an actress and producer, known for Next Friday (2000), Urban Justice (2007) and Breaking Bad (2008). She was previously married to Greg Serano.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4ODQxODkwN15BMl5BanBnXkFtZTgwNzgxNjQwODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0784831","name":"Carmen Serano","idIMDB":"nm0784831"},"actorId":"nm0784831","character":"Alice Park","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cory Hart","urlProfile":"http://www.imdb.com/name/nm1346346","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTQ4MmFlYjEtZGM5Ni00OTQzLWE1NTAtNWNkYWYyMTY3NDQ4XkEyXkFqcGdeQXVyMTYxODY1NjQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Cory Hart is an actor, known for The Final Girls (2015), Urban Justice (2007) and Stop-Loss (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTQ4MmFlYjEtZGM5Ni00OTQzLWE1NTAtNWNkYWYyMTY3NDQ4XkEyXkFqcGdeQXVyMTYxODY1NjQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1346346","name":"Cory Hart","idIMDB":"nm1346346"},"actorId":"nm1346346","character":"Max Ballister","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Liezl Carstens","urlProfile":"http://www.imdb.com/name/nm2542278","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNjE4MzA3NV5BMl5BanBnXkFtZTcwMzM2NzYzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Liezl Carstens was born in Pretoria, Gauteng, South Africa. She is an actress, known for Fright Night (2011), Wild Hogs (2007) and The Keeper (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNjE4MzA3NV5BMl5BanBnXkFtZTcwMzM2NzYzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2542278","name":"Liezl Carstens","idIMDB":"nm2542278"},"actorId":"nm2542278","character":"Linda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kirk B.R. Woller","urlProfile":"http://www.imdb.com/name/nm0938570","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NDcyNDExOF5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 March 1962","placeOfBirth":"","birthName":"Kirk Bryan Ramon Woller","bio":"Kirk is a classically trained actor and has the distinction of being \"a true chameleon,\" with over 30 on-stage performances and more than 100 film & television credits, including star turns in the indie features Like Dandelion Dust (2009), Midnight Clear (2006), Hometown Legend (2002), Urban Justice (2007), The Lucky Ones (2008), and The Least of These (2008). His work in A.I. Artificial Intelligence (2001) lead to a substantial offer by the man himself, Steven Spielberg, in his film Minority Report (2002). His other studio films include Swordfish (2001) opposite Don Cheadle, Flightplan (2005) opposite Sean Bean and Jodie Foster, Wolfgang Petersen's Poseidon (2006), Clint Eastwood's Flags of Our Fathers (2006), and Resident Evil: Extinction (2007). On television he's played recurring characters on The Event (2010), The Unit (2006), E-Ring (2005), Over There (2005), Charmed (1998). Strong Medicine (2000), The X-Files (1993), and NYPD Blue (1993). And has guest starred on such hit shows as NCIS (2003), Criminal Minds (2005), Bones (2005), CSI: Crime Scene Investigation (2000), Big Love (2006), 24 (2001), Rizzoli & Isles (2010), Switched at Birth (2011) and Extant (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NDcyNDExOF5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0938570","name":"Kirk B.R. Woller","idIMDB":"nm0938570"},"actorId":"nm0938570","character":"Det. Frank Shaw","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary Evans","urlProfile":"http://www.imdb.com/name/nm1073991","urlPhoto":"","biography":{"bio":"Mary Evans is an actress, known for Black Dynamite (2009), Urban Justice (2007) and Hamlet 2 (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1073991","name":"Mary Evans","idIMDB":"nm1073991"},"actorId":"nm1073991","character":"Irene","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Al Staggs","urlProfile":"http://www.imdb.com/name/nm2516709","urlPhoto":"","biography":{"bio":"Al Staggs is an actor, known for Urban Justice (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2516709","name":"Al Staggs","idIMDB":"nm2516709"},"actorId":"nm2516709","character":"Priest","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jade Yorker","urlProfile":"http://www.imdb.com/name/nm0948815","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkxNjk1NTA1NV5BMl5BanBnXkFtZTYwNDA3NDA3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1985","placeOfBirth":" New Jersey, USA","height":"5' 9\" (1.75 m)","bio":"Jade Yorker was born on June 16, 1985 in New Jersey, USA. He is an actor, known for Gridiron Gang (2006), Music of the Heart (1999) and He Got Game (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkxNjk1NTA1NV5BMl5BanBnXkFtZTYwNDA3NDA3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0948815","name":"Jade Yorker","idIMDB":"nm0948815"},"actorId":"nm0948815","character":"Gary Morrison","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jermaine Washington","urlProfile":"http://www.imdb.com/name/nm2599541","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMDUyNzcxNTJeQTJeQWpwZ15BbWU3MDc5MTUxMjk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Jermaine's acting career started by accident when he took a friend to a local extra casting call. At first, Jermaine was not interested in the casting call, but a producer persuaded him to try out. After a few more extras casting calls and attending an acting workshop, the acting bug bit him. He contacted Shari Rhodes, a local New Mexico and Texas casting director, for personal coaching in acting. Instead, she encouraged him to audition for a supporting role in the movie Urban Justice starring Steven Segal and Eddie Griffin. He was booked for the role, since then he has been on various movies and television series. He has had the privilege to work in such movies as Felon, Ring of Death, In Plain Sight, Terminator Salvation, Gamer, The Book of Eli, and Thor. Jermaine continues to pursue an acting career with enthusiasm as well as opportunities to work in stunts.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMDUyNzcxNTJeQTJeQWpwZ15BbWU3MDc5MTUxMjk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2599541","name":"Jermaine Washington","idIMDB":"nm2599541"},"actorId":"nm2599541","character":"Rasheed","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Neal Lucero","urlProfile":"http://www.imdb.com/name/nm2487126","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM4NjMwNzU1OV5BMl5BanBnXkFtZTgwODUxMjk5NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Brian Neal Lucero is an actor and producer, known for The Spirit (2008), The Book of Eli (2010) and Game Change (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM4NjMwNzU1OV5BMl5BanBnXkFtZTgwODUxMjk5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2487126","name":"Brian Neal Lucero","idIMDB":"nm2487126"},"actorId":"nm2487126","character":"Benny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny Trejo","urlProfile":"http://www.imdb.com/name/nm0001803","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcxNTQ1ODQxMl5BMl5BanBnXkFtZTYwMzI4MDA2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1944","placeOfBirth":" Echo Park, Los Angeles, California, USA","birthName":"Dan Trejo","height":"5' 5¾\" (1.67 m)","bio":"Danny Trejo was born Dan Trejo in Echo Park, Los Angeles, to Alice (Rivera) and Dan Trejo, a construction worker. A child drug addict and criminal, Trejo was in and out of jail for 11 years. While serving time in San Quentin, he won the lightweight and welterweight boxing titles. Imprisoned for armed robbery and drug offenses, he successfully completed a 12-step rehabilitation program that changed his life. While speaking at a Cocaine Anonymous meeting in 1985, Trejo met a young man who later called him for support. Trejo went to meet him at what turned out to be the set of Runaway Train (1985). Trejo was immediately offered a role as a convict extra, probably because of his tough tattooed appearance. Also on the set was a screenwriter who did time with Trejo in San Quentin. Remembering Trejo's boxing skills, the screenwriter offered him $320 per day to train the actors for a boxing match. Director Andrey Konchalovskiy saw Trejo training Eric Roberts and immediately offered him a featured role as Roberts' opponent in the film. Trejo has subsequently appeared in many other films, usually as a tough criminal or villain. Trejo is of Mexican descent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcxNTQ1ODQxMl5BMl5BanBnXkFtZTYwMzI4MDA2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001803","name":"Danny Trejo","nicknames":["The Mayor"],"idIMDB":"nm0001803"},"actorId":"nm0001803","character":"El Chivo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Diego Joaquin Lopez","urlProfile":"http://www.imdb.com/name/nm2407674","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5OGI3OWMtYzFkNS00N2FjLWI5OTktZDZlYzVlMjY3ODY3XkEyXkFqcGdeQXVyMTUyNjgxMDY@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Diego Joaquin Lopez has been acting professionally since 2005, is a member of the Screen Actors Guild and has acted in several feature films including \"Blaze You Out\", Mc G's \"Terminator: Salvation\" and \"Love Ranch\" directed by Taylor Hackford starring Helen Mirren and Joe Pesci. Other credited titles include, \"Spinners,\" \"American Dream,\" \"Living Hell (Organism),\" and \"Urban Justice\" along side of Steven Seagal. In addition, Mr. Lopez is an emerging community-minded filmmaker with an intense urge to elevate in his professional career through writing and directing creative stories. Born and raised in northern New Mexico in the town of Espanola, Mr. Lopez brings an enthusiastic and culturally skilled background to his work, and has established rapport and respect in the communities he serves. Lopez's pursued his love of film by graduating with honors from the University of New Mexico Media Arts Program in 2001. Based on his screenwriting, Mr. Lopez was accepted in the New Mexico Filmmakers Intensive program in 2007 and he advanced his education by completing the Screenwriting Track from the College of Santa Fe where he studied screenwriting under Tom Musca. In 2008, Mr. Lopez wrote and directed \"Alone,\" a film which he screened and presented workshops at National Council of La Raza (NCLR) Annual Conference. He also co-wrote \"Spinners,\" a fantastical low-rider comedy, with colleague Joseph Von Stern. The following year, in 2009 he co-wrote and directed the award winning, \"Torcida,\" a powerful film which reflects the reality of intergenerational substance use highlighting the social and cultural norms occurring with many Latino families. In 2010, Mr. Lopez wrote and directed the award winning short film, \"Through Their Eyes.\" The film was an integral component of a domestic violence prevention campaign that created awareness by highlighting the effects of domestic violence on children. Later that year, he was selected to be in Robert Redford's Milagros de Los Luceros Writing Program in and studied under Joan Tewkesbury. Most recently, Mr. Lopez, along with long time friend and collaborator Mateo Frazier, co-wrote and directed \"Blaze You Out\". Scheduled for release in 2012, \"Blaze You Out\" is an intensely layered story with symbolism that is rooted in northern New Mexican traditional and pop culture. The setting and symbolism throughout the film are just as much their own characters that play into and against the interpersonal dynamics of the people in the film. The story is filled with bold and conflicted characters that are driven by their deep physical and emotional needs. For Mr. Lopez his creative vision is driven by authenticity. Growing up in a working artists' household, he has always been actively involved in the community and felt very passionate about telling stories that his community could identify with as well as give a mass audience an idea of what that experience is like.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5OGI3OWMtYzFkNS00N2FjLWI5OTktZDZlYzVlMjY3ODY3XkEyXkFqcGdeQXVyMTUyNjgxMDY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2407674","name":"Diego Joaquin Lopez","idIMDB":"nm2407674"},"actorId":"nm2407674","character":"Winston","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Grady McCardell","urlProfile":"http://www.imdb.com/name/nm1827396","urlPhoto":"","biography":{"bio":"Grady McCardell is an actor, known for Fireflies in the Garden (2008), Urban Justice (2007) and Paradise, Texas (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1827396","name":"Grady McCardell","idIMDB":"nm1827396"},"actorId":"nm1827396","character":"Dwight Morris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brett Brock","urlProfile":"http://www.imdb.com/name/nm0110548","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3NzMzMDczOV5BMl5BanBnXkFtZTgwODA1Mjk3NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Brett Brock was born on August 12th in Lubbock, Texas. In his teens he was a World Class water skier, specifically on the knee board. He went to Monterey High School and continued working in the boat business while attending Texas Tech University where he studied Theatre Arts. His first appearance on the stage there was in a performance during The Irene Ryan Scholarship Auditions when he was asked to be a scene partner by a fellow classmate who had been nominated for an outstanding performance. During the American College Theatre Festival he met Texas Tech Theatre alumni Barry Corbin, G.W. Bailey, and Toni Cobb, who encouraged him to pursue acting in television and film. Before leaving west Texas to gain experience and build his resume in Dallas, he attended a weekend acting workshop in Lubbock with veteran casting director, Shari Rhodes. She later began casting the television series, Walker, Texas Ranger in Dallas and cast Brett in multiple episodes, also in Undead or Alive: A Zombedy, Urban Justice, Comanche Moon, and Roper and Goodie. He studied on camera acting technique with her and they maintained a close professional working relationship until her untimely death in December, 2009. Brett met actor/writer/director Cliff Osmond in a Dallas acting seminar in 2001 and studied exclusively with him until December 2012. Brett has worked on over 100 films, television shows, commercials, and stage productions. He has a home in the Austin area where he spends his time practicing Shorin Jitsu, jamming with his 3 teens in their garage band he calls Rosebud, and designing and building custom furniture and working with exotic woods in his carpentry studio. He lives in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3NzMzMDczOV5BMl5BanBnXkFtZTgwODA1Mjk3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0110548","name":"Brett Brock","idIMDB":"nm0110548"},"actorId":"nm0110548","character":"Watch Sergeant","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0910934","urlIMDB":"http://www.imdb.com/title/tt0910934","business":{"budget":{"money":"$12,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"19","month":"06","year":"2007","remarks":null},"filmingDates":[{"money":null,"country":null,"day":"26","month":"11","year":"2006","remarks":null},{"money":null,"country":null,"day":"24","month":"12","year":"2006","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":["Panavision Camera and Lenses"],"laboratory":["FotoKem Laboratory, Burbank (CA), USA"],"filmLength":null,"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Digital Intermediate (master format)","Spherical (source format)"],"printedFilmFormat":["35 mm"]},"rating":"5.4","filmingLocations":[{"location":"8521 Central Ave NE, Albuquerque, New Mexico, USA"}],"rated":"R","awards":[],"votes":"4,433","type":"Video","companyCreditsSimple":[{"idCompany":"co0137851","name":"Sony Pictures Home Entertainment"},{"idCompany":"co0274856","name":"XIT Financial Group"},{"idCompany":"co0003653","name":"Steamroller Productions"}],"keywords":{"keywords":["murder","revenge","modern western","landlady","helicopter","death threat","gunshot wound","abandoned apartment","police officer killed","threatened with a knife","corpse","police corruption","fire","falling down stairs","eavesdropping","abandoned warehouse","suitcase full of money","bag of money","tracking device","gay slur","tattoo","attempted murder","driving licence","abandoned factory","thug","brother brother relationship","basketball","informant","torture","interrogation","strangulation","ethnic slur","stabbed in the head","knife","nurse","flashback","nightclub","massacre","shot to death","shot in the back","shot in the leg","shot in the chest","shot in the shoulder","shot in the arm","shot in the face","shot in the forehead","shot in the head","shot through a window","racial slur","car accident","car crash","hit in the crotch","kicked in the face","kicked in the crotch","kicked in the stomach","punched in the chest","punched in the face","n word","gunfight","investigation","bouncer","drug lord","drug dealer","cocaine snorting","cocaine","ghetto","beaten to death","pickup truck","home invasion","mexican standoff","held at gunpoint","machismo","mixed martial arts","brawl","death","betrayal","deception","ambush","corruption","cell phone","fight","camera","freeze frame","drive by shooting","widow","death of husband","undercover cop","undercover","funeral","police funeral","gunslinger","mysterious man","convenience store","product placement","police station","corrupt cop","police detective","fistfight","police","sniper rifle","sniper","exploding car","hand grenade","ak 47","shotgun","uzi","revolver","suspense","los angeles california","urban decay","street life","karate chop","kung fu","gang war","gangsta grip","crime boss","gang","warrior","female gunfighter","police shootout","gun","gun battle","gun duel","bullet time","slow motion scene","blood splatter","gore","bullet ballet","street shootout","neo noir","husband wife relationship","kissing while having sex","kiss","sex","sex in bed","brunette","long brown hair","long black hair","street gang","organized crime","gangster","justice","poetic justice","vigilante justice","anti hero","vigilantism","acting musician","vigilante","chase","karate","quick draw","colt .45","murder of son","f word","neck breaking","brutality","beating","blood","glock","machine gun","beretta","semiautomatic pistol","pistol","disarming someone","showdown","cult film","combat","tough guy","one against many","one man army","action hero","hero","shootout","violence","aikido","martial arts","shot in the ear","gang warfare","double cross","dirty cop","car chase","once upon a time in the title","police officer","loss of son","detective","cemetery","revenge plot","hand to hand combat","death of son","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:51:18"}}