{"data":{"movies":[{"title":"27 Dresses","originalTitle":"","year":"2008","releaseDate":"20080118","directors":[{"name":"Anne Fletcher","id":"nm0281945"}],"writers":[{"name":"Aline Brosh McKenna","id":"nm0112459"}],"runtime":"111 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI5OTM0OTg2MF5BMl5BanBnXkFtZTcwNjAyMTU1MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"Two things about Jane: she never says no to her friends (she's been a bridesmaid 27 times and selflessly plans friends' weddings), and she's in love with her boss, George, nurturing dreams of a lovely, romantic wedding of her own. She meets Kevin, a cynical writer who finds her attractive, and that same week her flirtatious younger sister Tess comes to town. Jane silently watches George fall for Tess, a manipulative pretender. Worse, Jane may be called upon to plan their wedding. Meanwhile, Kevin tries to get Jane's attention and has an idea that may advance his career. Can Jane uncork her feelings?","simplePlot":"After serving as a bridesmaid 27 times, a young woman wrestles with the idea of standing by her sister's side as her sibling marries the man she's secretly in love with.","actors":[{"actorName":"Brian Kerwin","urlProfile":"http://www.imdb.com/name/nm0450116","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNTA5NjE3MV5BMl5BanBnXkFtZTYwMjI2MDc3._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1949","placeOfBirth":" Chicago, Illinois, USA","height":"6' 1\" (1.85 m)","bio":"Kerwin grew up in the Chicago suburb of Flossmoor, Illinois. After graduating from USC's Film School in 1972, he moved to New York City to pursue acting on the stage. After several off-off Broadway productions, he was cast for a brief stint on \"The Young and the Restless\" in Los Angeles. He ended up staying in LA for the next 15 years, working steadily in films, TV and on stage. He worked regularly in TV, from standard network fare to recurring roles in \"Roseanne\", \"The West Wing\", \"Nip/Tuck\", and more. He appeared in numerous TV movies and miniseries and starred in Showtime's critically acclaimed series, \"Beggars & Choosers\". In feature films Kerwin landed the role of Sally Field's errant ex in \"Murphy's Romance\", and he played Harvey Fierstein's love interest in the groundbreaking film, \"Torch Song Trilogy\" (a role he also played in the Tony Award winning play). he worked opposite Robin Williams in \"Jack\", Michelle Pfeiffer in \"Love Field\", and Sissy Spacek in \"Hard Promises\". He played Katherine Heigl's father in \"27 Dresses\" and Emma Stone's father in \"The Help\". The focus of Kerwin's work has always been the stage. He has performed in regional theatres throughout the country, including South Coast Rep, San Diego's Old Globe, The Seattle Rep and The Mark Taper Forum in Los Angeles. He and his wife, Jeanne, a theatrical producer, moved to Manhattan's Upper West Side in 1993, where they raised their three children. While there, he worked extensively both on and off Broadway, culminating with his 19 month run in Tracy Lett's Tony and Pulizer Award winning play, \"August: Osage County\". Widowed in 2016, Kerwin resides in NYC.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNTA5NjE3MV5BMl5BanBnXkFtZTYwMjI2MDc3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0450116","name":"Brian Kerwin","idIMDB":"nm0450116"},"actorId":"nm0450116","character":"Hal","urlCharacter":"http://www.imdb.com/character/ch0113068","main":true},{"actorName":"Charli Barcena","urlProfile":"http://www.imdb.com/name/nm2724665","urlPhoto":"","biography":{"bio":"Charli Barcena is an actress, known for 27 Dresses (2008) and Beverly Hills Christmas (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2724665","name":"Charli Barcena","idIMDB":"nm2724665"},"actorId":"nm2724665","character":"Young Tess","urlCharacter":"http://www.imdb.com/character/ch0050327","main":true},{"actorName":"Peyton List","urlProfile":"http://www.imdb.com/name/nm2572554","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNzA0OTM1MV5BMl5BanBnXkFtZTgwNjE2MzY3NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 April 1998","placeOfBirth":" Florida, USA","birthName":"Peyton Roi List","height":"5' 6\" (1.68 m)","bio":"Peyton is well-known for her roles on the hit Disney series Jessie (2011) and Fox's Diary of a Wimpy Kid (2010) film franchise. List most recently wrapped the teen comedy, The Outcasts (2017), for director Peter Hutchings. Her other feature credits include Fox 2000's 27 Dresses (2008) and Summit's Remember Me (2010). List has an array of television credits, with pivotal roles in Cashmere Mafia (2008), Ma soeur, mon pire cauchemar (2013), Gossip Girl (2007) and Law & Order: Special Victims Unit (1999). Peyton is hard at work writing songs for her debut album and devotes her spare time to \"Girls On the Run\", a youth development program for young women. Peyton resides in Los Angeles, but her heart remains in Brooklyn, NY, where she grew up. She lives at home with parents John and Suzanne, twin brother Spencer List and younger brother Phoenix List. Their rescue dogs, Windsor and Gatsby, round out the household. Peyton enjoys theatre, water sports, travel, songwriting and, naturally, engaging with her fans on her various social media channels. With all that Peyton has accomplished in a mere 16 years, her stage is set for boundless possibilities in film, music, multimedia, fashion and philanthropic platforms.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNzA0OTM1MV5BMl5BanBnXkFtZTgwNjE2MzY3NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2572554","name":"Peyton List","idIMDB":"nm2572554"},"actorId":"nm2572554","character":"Young Jane","urlCharacter":"http://www.imdb.com/character/ch0049811","main":true},{"actorName":"Jane Pfitsch","urlProfile":"http://www.imdb.com/name/nm2874639","urlPhoto":"","biography":{"dateOfBirth":"24 January 1983","placeOfBirth":" Viroqua, Wisconsin, USA","height":"5' 8\" (1.73 m)","bio":"Jane Pfitsch was born on January 24, 1983 in Viroqua, Wisconsin, USA. She is known for her work on 27 Dresses (2008), Rainbow Rabbit Reliant (2010) and U.S. Marshals: Operation Falcon (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2874639","name":"Jane Pfitsch","idIMDB":"nm2874639"},"actorId":"nm2874639","character":"Cousin Lisa","urlCharacter":"http://www.imdb.com/character/ch0113066","main":true},{"actorName":"Katherine Heigl","urlProfile":"http://www.imdb.com/name/nm0001337","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM0NDEwMjA1MV5BMl5BanBnXkFtZTcwMzQxMDI3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 November 1978","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Katherine Marie Heigl","height":"5' 9\" (1.75 m)","bio":"Katherine Marie Heigl was born on November 24, 1978 in Washington, D.C., to Nancy Heigl (née Engelhardt), a personnel manager, and Paul Heigl, an accountant and executive. Her father is of German/Swiss-German and Irish descent, and her mother is of German ancestry. A short time after her birth, the family moved to New Canaan, Connecticut, where Katherine was to spend the majority of her childhood; the youngest member of her family, Katherine--or \"Katie\" as she is nicknamed--has two elder siblings, John and Meg. Tragically, her older brother Jason died in 1986 of brain injuries suffered in a car accident, after being thrown from the back of a pickup truck. When doctors determined he was brain-dead, the family made the difficult decision to donate his organs. Not only did this painful chapter give Katherine a greater perspective and appreciation for life, but it motivated her to use her celebrity to promote the importance of organ donation. Katherine was first thrust into the limelight as a child model. An aunt, visiting the family in New Canaan, took a number of photographs of Katherine, then aged nine, in a series of poses to advertise a hair care product she had invented. Upon returning to New York, with permission from Katherine's parents, she sent the photos to a number of modeling agencies. Within a few weeks, Katherine had been signed to Wilhelmina, a renowned international modeling agency. Almost immediately, she made her debut in a magazine advertisement and soon followed this with an inaugural television appearance in a national commercial for Cheerios breakfast cereal. Following a number of commercials and modeling assignments for Sears and Lord & Taylor, she made her big-screen debut in That Night (1992), which starred Juliette Lewis and C. Thomas Howell. It was then that she realized that acting rather than modeling was her passion. In 1993, Katherine appeared in Steven Soderbergh's critically-acclaimed Depression-era drama, King of the Hill (1993), before landing her first leading role as a rebellious teenager, alongside Gérard Depardieu, in My father, ce héros (1994). During this time, Katherine continued to attend New Canaan High School, balancing her academic studies with work on films and modeling, which she undertook during holidays, vacations and weekends. In 1995, she played \"Sarah Ryback\", the niece of Steven Seagal's character, in Under Siege 2: Dark Territory (1995), which was her \"debut\" in the action film genre. Acting was now becoming a stronger focus for Katherine, although she still modeled extensively, appearing regularly in magazines such as \"Seventeen\". Television appearances on The Tonight Show with Jay Leno (1992) and Late Night with Conan O'Brien (1993) soon followed, before she took the lead role in Disney's Wish Upon a Star (1996) in 1996. It was also during that year that Katherine's parents divorced and, following her graduation from high school in 1997, she moved with her mother into a four-bedroom house in Los Angeles' Malibu Canyon area. This enabled her to focus upon acting with the guidance and support of her mother, who now managed her career. In 1997, Katherine portrayed \"Taffy Entwhistle\", Rita Hayworth's stand-in, in Stand-ins (1997) and was also cast as the beauteous \"Princess Ilene\" in the European production, Prince Valiant (1997). She then made her made-for-TV movie debut, co-starring with Peter Fonda in a re-working of the classic Shakespearean play, The Tempest (1998), updated with an American Civil War theme. In this film, she played \"Miranda Prosper\", a young woman torn between her love for both her father and a Union soldier. Bug Buster (1998) and La fiancée de Chucky (1998) represented a venture into the horror genre for Katherine. While both films could be described as rather tongue-in-cheek despite their gory emphases, La fiancée de Chucky (1998) was the better received, both critically and commercially. In 1999, Katherine decided to branch out into series television when she accepted the role of the haughty, yet vulnerable, \"Isabel Evans\", on Roswell (1999), a show that blended teen angst with sci-fi drama. Though she had never planned to embark on a career in television, the role of Isabel, a teenager with a secret life, was an offer she found impossible to refuse. In the series, Isabel, her brother Max (Jason Behr) and their friend Michael (Brendan Fehr) are aliens passing as humans in Roswell, New Mexico, as they desperately try to hide the truth from government agencies, the people of Roswell and even their own adopted families. To publicize her role on the show, Katherine graced the covers of magazines such as \"TV Guide\", \"Maxim\" and \"Teen\" and was interviewed on Later (1994) and The Late Late Show with Craig Kilborn (1999). Along with her mother Nancy, she also appeared in an episode of the Sci-Fi TV talk show, Crossing Over with John Edward (1999), during which she spoke with John Edward, a psychic medium, about her late brother, Jason. During the three years Roswell (1999) was in production, Katherine found time to work on several movies. 100 Girls (2000), an independent film released in 2001, is the story of a college freshman who meets the girl of his dreams in an elevator during a blackout, and spends the rest of the movie trying to find her again. Her cameo role is that of Arlene, the competitive tomboy. The second film, Valentine (2001), a horror film starring David Boreanaz and Denise Richards, appeared in U.S. theaters on February 2, 2001. In this movie, which is based upon the 1996 novel by Tom Savage, Katherine plays \"Shelley\", a medical student who meets a sudden demise. In the spring of 2001, Katherine accepted a role in NBC's Critical Assembly (2002), a two-hour original television thriller. Katherine and Kerr Smith (Dawson's Creek (1998)) co-starred as brilliant and politically concerned college students who build a nuclear device to illustrate the need for a change in national priorities, but are betrayed by a fellow student when the bomb ends up in the hands of a terrorist. Unfortunately, the telefilm, directed by Eric Laneuville, written by Tom Vaughan, and based on the best-seller \"The Seventh Power\" by James Mills, was shelved when its storyline was deemed too close for comfort to the events of September 11, 2001. It was eventually broadcast in 2003. Since the cancellation of Roswell (1999) in the spring of 2002, Katherine has been busy with various projects, including an appearance on UPN's update of the classic television series, La treizième dimension (2002). That episode, entitled La treizième dimension: Cradle of Darkness (2002), aired on October 2, 2002, and featured Katherine in the role of a woman who goes back in time to stop one of the most notorious murders in history. In addition, she completed a movie, Descendant (2003), a psychological thriller inspired by Edgar Allan Poe's \"The Fall of the House of Usher\". She has also starred as \"Romy\" in ABC/Touchstone's two-hour telepic, Romy and Michele: In the Beginning (2005), a prequel to the 1997 feature, Romy and Michele's High School Reunion (1997). During the summer of 2002, Katherine made a major decision in the direction of her career when she signed on for representation in all areas with the William Morris Agency, one of the biggest and most prestigious agencies in the entertainment industry. She is now being represented by Norman Aladjem at Paradigm Agency and being managed by Nancy Heigl and Stephanie Simon and Jason Newman at Untitled Entertainment.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM0NDEwMjA1MV5BMl5BanBnXkFtZTcwMzQxMDI3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001337","name":"Katherine Heigl","nicknames":["Katie"],"idIMDB":"nm0001337"},"actorId":"nm0001337","character":"Jane","urlCharacter":"http://www.imdb.com/character/ch0049811","main":true},{"actorName":"Jennifer Lim","urlProfile":"http://www.imdb.com/name/nm3834495","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MDQyNzgzMV5BMl5BanBnXkFtZTcwMzQ2NDg1OA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"A native of Hong Kong, Jennifer Lim now resides and works out of NYC. After graduating with a Bachelor's degree from Bristol University in the United Kingdom, she attended the Yale School of Drama where she graduated with her MFA in Acting in 2004. She is a \"half & half\" (half Chinese half Korean) who speaks Cantonese and Mandarin fluently... and, when the need arises, enough Korean to warm a plate of japchae. To broaden her international exposure and qualify for a US Artist Green card, which she has now received, Jennifer has taken many opportunities to work abroad over the last few years. In London, she played the lead role, to rave reviews, in In-Sook Chappell's Verity Bargate Award winning This Isn't Romance, directed by Soho Theatre's former Artistic Director Lisa Goldman. In Shanghai and at the Grotowski Theatre Festival in Wroclaw, she received high praise for her portrayal of Ophelia (performed in Mandarin) in Shakespeare's Hamlet, adapted and directed by the much-lauded Richard Schechner. She also toured extensively in Europe with Songs of the Dragons Flying to Heaven as a member of the Young Jean Lee Theater Co., performing at numerous theatres and festivals, including the Vienna Fesitval, the Hannover Theaterformen Festival (Germany), Zurich Theaterspektakel Festival, the Hebbel Theater (Berlin), the Kaaitheater (Brussels), the International Arts Festival of Castilla y Leon (Salamanca, Spain), Theatre Garonne (Toulouse), and in Norway - the Teaterhuset Avant Garden (Trondheim), the Black Box Teater (Oslo) and the Teater Garasjen (Bergen). Back in the United States, Jennifer has also worked in many professional and prominent downtown NYC and regional theaters. In addition, she has helped develop new works at the Lark Play Development Center, New Georges, Pan Asian Rep, East Coast Artists, Mabou Mines, Reverie Productions, New Dramatists, Ensemble Studio Theater, Cherry Lane Theater, Second Generation and Ma-Yi Theater Co. Television and film credits include appearances on Blue Bloods (2010), Law & Order (1990), Law & Order: Special Victims Unit (1999), Royal Pains (2009), Dirty Sexy Money (2007), Guiding Light (1952), As the World Turns (1956), The Savages (2007), 27 Dresses (2008) and various shorts. Jennifer is a member of Actor's Equity Association (AEA), Screen Actors Guild (SAG) and the American Federation of Television and Radio Artists (AFTRA).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MDQyNzgzMV5BMl5BanBnXkFtZTcwMzQ2NDg1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3834495","name":"Jennifer Lim","idIMDB":"nm3834495"},"actorId":"nm3834495","character":"Bridal Salesgirl #1","urlCharacter":"http://www.imdb.com/character/ch0517222","main":true},{"actorName":"Brigitte Bourdeau","urlProfile":"http://www.imdb.com/name/nm1244171","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDA1NzEyMl5BMl5BanBnXkFtZTcwODM0MjMzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Brigitte Bourdeau is an actress, known for 27 Dresses (2008), Rainbow Six: Siege (2015) and Hendrix (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDA1NzEyMl5BMl5BanBnXkFtZTcwODM0MjMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1244171","name":"Brigitte Bourdeau","idIMDB":"nm1244171"},"actorId":"nm1244171","character":"Salesgirl Olga","urlCharacter":"http://www.imdb.com/character/ch0113069","main":true},{"actorName":"Judy Greer","urlProfile":"http://www.imdb.com/name/nm0339460","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MTAyMzMzMl5BMl5BanBnXkFtZTcwMDY2Mzc2NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 July 1975","placeOfBirth":" Detroit, Michigan, USA","birthName":"Judith Therese Evans","height":"5' 8\" (1.73 m)","bio":"Judy Greer was born and raised outside of Detroit, Michigan, as Judith Therese Evans. She is the daughter of Mollie Ann (née Greer), a hospital administrator and former nun, and Richard Evans, a mechanical engineer. She has German, Irish, English, Welsh, and Scottish ancestry. After training for nearly ten years in classical Russian ballet, Greer shifted her interest to acting and was accepted into Chicago's prestigious Theater School at DePaul University. After a variety of odd jobs during college, from telemarketer to oyster shucker, Greer landed her first on-screen role just three days after graduation -- a small part in the Jason Lee-David Schwimmer comedy Kissing a Fool (1998). She flew to Los Angeles for the film's premiere and never left. Greer quickly landed a role in the dark comedy Jawbreaker (1999), with Rose McGowan and Rebecca Gayheart. Greer starred as a school wallflower-turned-babe in a story about high school girls who accidentally kill their best friend and try to cover up the murder. She went on to play a news correspondent in David O. Russell's Three Kings (1999), landing a memorable opening love scene with George Clooney. Her performance caught the eye of Hollywood, and she appeared next in Mike Nichols's What Planet Are You From? (2000) as a flight attendant opposite Garry Shandling. Her television credits include a recurring role as Jason Bateman's assistant Kitty on Fox's Arrested Development (2003), as well as guest-starring roles on Love & Money (1999), Maggie Winters (1998), and Early Edition (1996). Greer starred opposite Jennifer Garner in Columbia Pictures' romantic comedy 13 Going on 30 (2004), directed by Gary Winick. Greer played an office colleague alongside Garner's character, with whom she shares a checkered past. She co-starred in writer-director M. Night Shyamalan's The Village (2004), opposite Joaquin Phoenix, Adrien Brody, Bryce Dallas Howard, Sigourney Weaver, and William Hurt. Set in 1897, the film revolves around a close-knit community that lives with the knowledge that a mythical race of creatures resides in the woods surrounding them. The Village (2004) was released July 30, 2004, by Touchtone Pictures. Greer also co-starred in director Wes Craven's Cursed (2005), a modern twist on the classic werewolf tale written by Kevin Williamson. The busy actress also landed a co-starring role opposite Orlando Bloom and Susan Sarandon in writer-director Cameron Crowe's Elizabethtown (2005). Greer will play the sister of Bloom's character and daughter of Sarandon's character. She also joined Jeff Bridges and Jeanne Tripplehorn in the independent film The Amateurs (2005) by writer-director Michael Traeger. The film revolves around a motley group of friends who band together to make an amateur porn film. Greer plays a young temptress at the local mattress store who secures a role in the movie by allowing the store to be used as a film location. Greer wrapped production in New York on a co-starring role opposite Tom McCarthy (\"The Station Agent\") in Danny Leiner's The Great New Wonderful (2005) for Serenade Films/Sly Dog Films. The dark comedy tells five different stories against the backdrop of an uncertain post-September 11 New York. The cast also includes Maggie Gyllenhaal, Edie Falco and Tony Shalhoub. She also appeared in writer-director Adam Goldberg's psychological drama I Love Your Work (2003), opposite Giovanni Ribisi. The film is about a fictional movie star (Ribisi) and his gradual meltdown and increasing obsession with a young film student and his girlfriend. The stellar cast also included Franka Potente, Christina Ricci, and Jason Lee and debuted at the 2003 Toronto International Film Festival. In the film, Greer plays Samantha, the personal assistant of Ribisi's character. Greer had a starring role as the female lead role in the comedy The Hebrew Hammer (2003) as the feisty, fearless Esther, who joins forces with an Orthodox Jewish Blaxploitation hero (Adam Goldberg) to save Hanukkah from an evil son of Santa Claus (Andy Dick). The Hebrew Hammer (2003) debuted at the 2003 Sundance Film Festival and premiered on Comedy Central followed by a theatrical release. She also appeared in Adaptation. (2002), from director Spike Jonze. In the film, Nicolas Cage stars as self-loathing writer Charlie Kaufman (and twin brother Donald) as he attempts to adapt the novel \"The Orchid Thief\" for the big screen. Greer played Alice, the waitress with whom he becomes obsessed -- the object of his fantasies. Greer turned in a scene-stealing comedic performance in Un mariage trop parfait (2001), with Jennifer Lopez and Matthew McConaughey, in which she played Penny, Lopez's sweet but ditsy assistant who tries hard, but often falls a little short. Equally adept at more dramatic roles, Greer gave a standout performance opposite Mel Gibson in What Women Want (2000), playing a suicidal file clerk rescued by the one man who can hear women's thoughts. Greer's pivotal scene with Gibson is the heart of the film. With a genuine gift for comedy and an engaging on-screen presence, Judy Greer has quickly become one of Hollywood's most captivating young talents. Having appeared in such diverse films as Jawbreaker (1999), What Women Want (2000), Un mariage trop parfait (2001), and Adaptation. (2002), as well as a number of upcoming feature film projects, Greer turns in scene-stealing performances opposite some of the industry's biggest stars.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MTAyMzMzMl5BMl5BanBnXkFtZTcwMDY2Mzc2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0339460","name":"Judy Greer","nicknames":["Greer"],"idIMDB":"nm0339460"},"actorId":"nm0339460","character":"Casey","urlCharacter":"http://www.imdb.com/character/ch0113065","main":true},{"actorName":"Danielle Skraastad","urlProfile":"http://www.imdb.com/name/nm2796342","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNTg4NzIwNF5BMl5BanBnXkFtZTcwMTcwMTIzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Danielle Skraastad is an actress, known for Michael Clayton (2007), 27 Dresses (2008) and Hard Sell (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNTg4NzIwNF5BMl5BanBnXkFtZTcwMTcwMTIzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2796342","name":"Danielle Skraastad","idIMDB":"nm2796342"},"actorId":"nm2796342","character":"Bride Suzanne","urlCharacter":"http://www.imdb.com/character/ch0113080","main":true},{"actorName":"Marilyn L. Costello","urlProfile":"http://www.imdb.com/name/nm2874640","urlPhoto":"","biography":{"bio":"Marilyn L. Costello is known for her work on 27 Dresses (2008), The Game Plan (2007) and The Company Men (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2874640","name":"Marilyn L. Costello","idIMDB":"nm2874640"},"actorId":"nm2874640","character":"Bride Suzanne's Minister","urlCharacter":"http://www.imdb.com/character/ch0517223","main":true},{"actorName":"James Marsden","urlProfile":"http://www.imdb.com/name/nm0005188","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyOTUzNjc0MF5BMl5BanBnXkFtZTcwNTYyMDYzMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1973","placeOfBirth":" Stillwater, Oklahoma, USA","birthName":"James Paul Marsden","height":"5' 10\" (1.78 m)","bio":"James Paul Marsden, or better known as just James Marsden, was born on September 18, 1973, in Stillwater, Oklahoma, to Kathleen (Scholz) and James Luther Marsden. His father, a distinguished Professor of Animal Sciences & Industry at Kansas State University, and his mother, a nutritionist, divorced when he was nine years old. James grew up with his four other siblings, sisters, Jennifer and Elizabeth, and brothers, Jeff and Robert. He has English, German, and Scottish ancestry. During his teen years, he attended Putnam City North High School which was located in Oklahoma City. After graduating in 1991, he attended Oklahoma State University and studied Broadcast Journalism. While in university, he became a member of the Delta Tau Delta fraternity. While vacationing with his family in Hawaii, he met actor Kirk Cameron, and his actress sister, Candace Cameron Bure. They eventually invited James to visit them in Los Angeles. After studying in Oklahoma State for over a year and appearing in his college production, \"Bye Bye Birdie\", he left school and moved to Los Angeles to pursue his interest in acting. James got his first job on the pilot episode of The Nanny (1993) as Eddie, who was Margaret Sheffield's boyfriend. He then became part of the Canadian television series, Boogies Diner (1994), which aired for one season. After that series ended, he got a brief role as the original Griffin on Fox's Party of Five (1994). His first big break came when he became the lead on the short-lived ABC series, Second Noah (1996). Although the show didn't last long, the young actor received enough exposure from the public and even managed to win the hearts of fellow teenage girls. In 1996, he attended an audition for a movie titled Primal Fear (1996) but unfortunately lost that role to Edward Norton. Two years later, he was offered a lead role in 54 (1998), which he turned down. The role later went to another actor, Ryan Phillippe. James' star power increased when he starred in David Nutter's Comportements troublants (1998), alongside Katie Holmes and Nick Stahl, which had mixed reviews, but mostly positive ones. His role in the television series as Glenn Foy in Ally McBeal (1997), is probably one of his biggest achievement to date. He became one of the main cast members during the first half of season 5, where he showcased his singing abilities. It was in that show where he was able to grab the attention of audiences from different backgrounds. The 5' 10\" star later played Lon Hammon Jr. in the romantic movie, The Notebook (2004), which was based on a novel by Nicholas Sparks of the same name. His movies, Lies & Alibis (2006) and 10th & Wolf (2006) was also released around the world to audiences in the year 2006. One of his most memorable roles to fans is his role as Cyclops in the X-Men (2000) movie franchise. The movie was well accepted by audiences and critics, which eventually made James one of the hottest stars since it was released. He was among the actors who starred in all three of the X-Men movies. James had the honor of working alongside Patrick Stewart, Famke Janssen and Hugh Jackman in the film. However, not many people know that he actually had to wear lifts for most of his scenes in the X-men movies, because his character Cyclops is supposed to be 6\" 3\" compared to a 5' 3\" Wolverine. In reality, he is actually under 6' 0\", shorter than Famke Janssen who plays his love interest, Jean Grey, and even shorter than Hugh Jackman who played Wolverine. In the year 2006, he played Richard White in the highly anticipated movie, Superman Returns (2006), which coincidentally was directed by Bryan Singer, who also directed previous X-Men installments. Although he appeared in X-Men: L'affrontement final (2006), the third installment of the X-Men franchise, many would notice that he in fact had more screen time in 'Superman Returns', as Lois Lane's long awaiting fiancé who had to accept the fact that his fiancée is in love with the man of steel. James earned great reviews from that movie, which led to him getting more movie roles. In 2007, James played Corny Collins in the film Hairspray (2007), an adaption of the Broadway musical based on John Waters movie, Hairspray (1988). He joined a star-studded cast, starring alongside top names such as John Travolta, Queen Latifah and Michelle Pfeiffer. James not only acted in that movie, but also sang two of the film's songs, \"The Nicest Kids In Town\", and \"Hairspray\". Being part of Hairspray catapulted James to a different level of stardom as audiences got to see another side of him. His next role was in the Disney movie, Enchanted (2007), playing Prince Edward, where he acted alongside Amy Adams, Susan Sarandon and Patrick Dempsey. Once again, James had the opportunity to sing in two songs from the movie, \"True Love's Kiss\" and \"That's Amore\". Enchanted (2007) appealed to not only older audiences but also to those who were fans of Disney's network productions. Following his huge success in the years 2006 and 2007, James played the male lead role in the romantic comedy, 27 Dresses (2008), opposite actress Katherine Heigl in 2008. The movie did well at the box office, earning a gross revenue of over $159 million, which exceeded the expectations of crew members especially since it was under a $30 million budget. Marsden played the male lead in the horror film, The Box (2009), based on the 1970 short story \"Button, Button\" by author Richard Matheson. He starred opposite Cameron Diaz in the movie. He co-starred in Accidental Love (2015) (previously Accidental Love (2015), a politically-themed romantic comedy, directed by David O. Russell and filmed in Columbia, South Carolina. Marsden's recent film roles include the sequel comedy Anchorman 2: The Legend Continues (2013), the romantic drama The Best of Me (2014), and the comedy Unfinished Business (2015). James was married to Lisa Linde, an actress known from her role in Days of Our Lives (1965). Lisa is the daughter of legendary country music songwriter Dennis Linde. The couple wed on July 22, 2000 and have a son, Jack Holden Marsden who was born on February 1, 2001, and a daughter, Mary James, who was born on August 10, 2005. They divorced in 2011. James has another son, born in 2012, with model Rose Costa. Many would assume that with all this success achieved by James at this age, he would be somewhat high-headed but James mentioned that despite all the attention he's getting from the public eye, he tries to keep himself as grounded as possible. He even admits that he flies coach instead of first class while traveling with his family. In an interview he mentioned that he believes he has a certain responsibility to let his children know that he isn't special because of what he does, but who he is as a person. With a great humble attitude and a bright future ahead of him, there's definitely more to expect from this Oklahoma native.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyOTUzNjc0MF5BMl5BanBnXkFtZTcwNTYyMDYzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005188","name":"James Marsden","nicknames":["Bello Jimmy","J. P."],"idIMDB":"nm0005188"},"actorId":"nm0005188","character":"Kevin","urlCharacter":"http://www.imdb.com/character/ch0061155","main":true},{"actorName":"Michael Paul","urlProfile":"http://www.imdb.com/name/nm2286975","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzU3MTczNF5BMl5BanBnXkFtZTgwMzg3MTQ2ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Philly native, Michael Paul began his career in local television at age 16. Sustaining a 25 year comedy career, he honed his craft touring with such names as James Brown, Lisa Lampanelli, Wynonna, Joan Rivers and Don Rickles to become a headliner in over 40 countries along with television credits on The Tonight Show and Saturday Night Live. Michael's film career includes motion pictures such as \"27 Dresses\" opposite Katherine Heigl, and \"The Ten\" co-starring with Winona Ryder, Paul Rudd, Liev Schrieber and Jessica Alba. He has lent his voice to Pixar, Jim Henson Productions and Disney. He has script doctored for The Disney Channel, CBS, Kevin Spacey and punched up jokes for David Letterman and Bill Maher. Michael is well known for creating branded puppet characters including, \"Nadia Coma: The World's Oldest Gymnast\" and MTV's \"CJ and Peanut\" as well as training casts of \"The Lion King\" and \"Avenue Q\". His published works include comedic editorials for USA Today, Huffington Post and LaughSpin. His new book \"Breaking Out of Show Business: What I Discovered by Not Being Discovered\" (by Post Hill Publishing) can be found at numerous book outlets including Barnes and Noble. Michael resides in Los Angeles and continues to work in movies, television and as a comedy writer and script & show consultant.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzU3MTczNF5BMl5BanBnXkFtZTgwMzg3MTQ2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2286975","name":"Michael Paul","idIMDB":"nm2286975"},"actorId":"nm2286975","character":"Taxi Driver Khaleel","urlCharacter":"http://www.imdb.com/character/ch0049812","main":true},{"actorName":"Yetta Gottesman","urlProfile":"http://www.imdb.com/name/nm0331898","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDEyOTU3Ml5BMl5BanBnXkFtZTgwMDM1MTAxMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 8\" (1.73 m)","bio":"An actor and director of Puerto Rican and Jewish heritage, Yetta was born in Puerto Rico and raised in Brazil. She is completely fluent (native fluency) in Spanish, English and Portuguese. She is a Lifetime Member of the prestigious Actors Studio and LAByrinth Theater Company. Yetta has appeared in numerous Off-Broadway plays including originating roles written by John Patrick Shanley and Stephen Adly Guirgis. She has performed extensively on stage, both in New York and regionally, with such luminary directors as Philip Seymour Hoffman, Joe Bonney, and Lisa Peterson. In 2010, she received a Best Actress Ovation Award Nomination for her performance in \"Mariela in the Desert\" at The Denver Center Theater. Her TV work includes guest appearances on \"Nurse Jackie\" , \"Sex and the City\" and \"Law and Order: Criminal Intent.\" Some of her film work includes \"Sex, Death and Bowling,\" \"Rabbit Hole\", \"Lucky You\", and \"27 Dresses\". Some of her favorite portrayals include a Mexican artist in 1950's Mexico (\"Mariela in the Desert\", Denver Center Theater), a grieving mom in Long Island (Rabbit Hole with Nicole Kidman), a down on her luck limping actress (\"Where's My Money?\" written and directed by John Patrick Shanley), a blue collar Queens girl on a disastrous first date (Steak Knife, Nurse Jackie), and Mary Magdalene (no explanation necessary!) in \"The Last Days of Judas Iscariot\", written by Tony nominated Stephen Adly Guirgis and directed by Oscar winner Philip Seymour Hoffman at The Public Theater in New York. She has also voiced numerous audiobooks. She splits her time between New York, Los Angeles and Puerto Rico.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDEyOTU3Ml5BMl5BanBnXkFtZTgwMDM1MTAxMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0331898","name":"Yetta Gottesman","idIMDB":"nm0331898"},"actorId":"nm0331898","character":"Hip Bridesmaid","urlCharacter":"http://www.imdb.com/character/ch0517224","main":true},{"actorName":"Erin Fogel","urlProfile":"http://www.imdb.com/name/nm2641434","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzI3MjdjOTgtMGQ5MS00NTQ1LThkNmUtNzdlM2Q3NjhjMzIyL2ltYWdlXkEyXkFqcGdeQXVyMTUyNDMwNDM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Erin Blair Fogel","height":"5' 6\" (1.68 m)","bio":"Erin Fogel was born in Freehold, New Jersey, USA as Erin Blair Fogel. She is an actress and producer, known for 27 Dresses (2008), The Strike (2016) and Love Is a Battlefield (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzI3MjdjOTgtMGQ5MS00NTQ1LThkNmUtNzdlM2Q3NjhjMzIyL2ltYWdlXkEyXkFqcGdeQXVyMTUyNDMwNDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2641434","name":"Erin Fogel","nicknames":["E Fo"],"idIMDB":"nm2641434"},"actorId":"nm2641434","character":"Shari Rabinowitz","urlCharacter":"http://www.imdb.com/character/ch0113082","main":true},{"actorName":"Bern Cohen","urlProfile":"http://www.imdb.com/name/nm1788789","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc4ODEzNTU4NF5BMl5BanBnXkFtZTgwNjM5ODMzNjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' 2\" (1.88 m)","bio":"Growing up in New York City's Chinatown gave Bern an urban and multicultural background before going to suburban Long Island's Valley Stream South High School where he was introduced to acting. Bern later double-majored in Theater and Education at Adelphi University, subsequently earning graduate degrees from Columbia University and New York City College. Bern's earliest acting included work with Mercedes Reuhl, Samuel L. Jackson, Rupert Holmes, Sesame Street and Zoom before he left his career in Theatre and went into Education to be more of a parent than a young actor's schedule allowed. He promised himself he'd return to acting at a later date. Years of experience in public education and the private sector gave Bern a mature, evolved edge when he resumed his acting career in 2005. He furthered his study of Camera Acting with Penny Templeton and Ruth Nerkin and has since had starring and principal roles in more than 50 movies, including Doctor Bello with Isaiah Washington and Vivica A. Fox, Frank Vs God with Henry Ian Cusick, Devil You Know with Lena Olin, Holy Rollers with Jesse Eisenberg, and 27 Dresses with Katherine Heigl. Most recently, Bern wrapped: Shooting Clerks as \"Thomas Burke the Roofer,\" SALACH as the lead role, and Oppenheimer Strategies as Board President. Last theater season, Bern starred in Richard Abron's Every Day a Visitor at NYC's Clurman Theater. During prior theater seasons, he starred as Abbie Hoffman in the one-man show, Abbie at New York City's West End Theater and in the Assistant at the Turtle Shell Theater.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc4ODEzNTU4NF5BMl5BanBnXkFtZTgwNjM5ODMzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1788789","name":"Bern Cohen","idIMDB":"nm1788789"},"actorId":"nm1788789","character":"Rabbi","urlCharacter":"http://www.imdb.com/character/ch0517225","main":true}],"seasons":[],"idIMDB":"tt0988595","urlIMDB":"http://www.imdb.com/title/tt0988595","business":{"budget":{"money":"$30,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$27,442,040","country":"USA","day":"20","month":"01","year":"2008","remarks":"3,057 Screens"},{"money":"£1,752,897","country":"UK","day":"30","month":"03","year":"2008","remarks":"428 Screens"},{"money":"BRL 1,047,719","country":"Brazil","day":"17","month":"02","year":"2008","remarks":"145 Screens"},{"money":"$23,271","country":"Estonia","day":"24","month":"02","year":"2008","remarks":"2 Screens"},{"money":"RUR 25,104,348","country":"Russia","day":"23","month":"03","year":"2008","remarks":"220 Screens"}],"gross":[{"money":"$76,808,654","country":"USA","day":"29","month":"05","year":"2008","remarks":""},{"money":"$76,806,312","country":"USA","day":"25","month":"05","year":"2008","remarks":""},{"money":"$76,795,541","country":"USA","day":"18","month":"05","year":"2008","remarks":""},{"money":"$76,782,611","country":"USA","day":"11","month":"05","year":"2008","remarks":""},{"money":"$76,758,772","country":"USA","day":"04","month":"05","year":"2008","remarks":""},{"money":"$76,708,310","country":"USA","day":"27","month":"04","year":"2008","remarks":""},{"money":"$76,624,274","country":"USA","day":"20","month":"04","year":"2008","remarks":""},{"money":"$76,526,559","country":"USA","day":"13","month":"04","year":"2008","remarks":""},{"money":"$76,376,607","country":"USA","day":"06","month":"04","year":"2008","remarks":""},{"money":"$76,150,977","country":"USA","day":"30","month":"03","year":"2008","remarks":""},{"money":"$75,820,494","country":"USA","day":"23","month":"03","year":"2008","remarks":""},{"money":"$75,525,410","country":"USA","day":"16","month":"03","year":"2008","remarks":""},{"money":"$75,110,892","country":"USA","day":"09","month":"03","year":"2008","remarks":""},{"money":"$74,466,610","country":"USA","day":"02","month":"03","year":"2008","remarks":""},{"money":"$73,108,983","country":"USA","day":"24","month":"02","year":"2008","remarks":""},{"money":"$70,649,785","country":"USA","day":"17","month":"02","year":"2008","remarks":""},{"money":"$65,078,461","country":"USA","day":"10","month":"02","year":"2008","remarks":""},{"money":"$57,245,093","country":"USA","day":"03","month":"02","year":"2008","remarks":""},{"money":"$45,107,889","country":"USA","day":"27","month":"01","year":"2008","remarks":""},{"money":"$27,442,040","country":"USA","day":"20","month":"01","year":"2008","remarks":""},{"money":"£6,313,791","country":"UK","day":"20","month":"04","year":"2008","remarks":""},{"money":"£5,435,975","country":"UK","day":"13","month":"04","year":"2008","remarks":""},{"money":"£3,971,758","country":"UK","day":"06","month":"04","year":"2008","remarks":""},{"money":"£1,752,897","country":"UK","day":"30","month":"03","year":"2008","remarks":""},{"money":"BRL 2,087,249","country":"Brazil","day":"24","month":"02","year":"2008","remarks":""},{"money":"BRL 1,047,719","country":"Brazil","day":"17","month":"02","year":"2008","remarks":""},{"money":"RUR 63,060,481","country":"Russia","day":"06","month":"04","year":"2008","remarks":""},{"money":"RUR 51,199,190","country":"Russia","day":"30","month":"03","year":"2008","remarks":""},{"money":"RUR 25,104,348","country":"Russia","day":"23","month":"03","year":"2008","remarks":""}],"weekendGross":[{"money":"$6,445","country":"USA","day":"25","month":"05","year":"2008","remarks":"10 Screens"},{"money":"$7,391","country":"USA","day":"18","month":"05","year":"2008","remarks":"19 Screens"},{"money":"$15,211","country":"USA","day":"11","month":"05","year":"2008","remarks":"31 Screens"},{"money":"$31,247","country":"USA","day":"04","month":"05","year":"2008","remarks":"51 Screens"},{"money":"$55,445","country":"USA","day":"27","month":"04","year":"2008","remarks":"73 Screens"},{"money":"$63,202","country":"USA","day":"20","month":"04","year":"2008","remarks":"102 Screens"},{"money":"$99,504","country":"USA","day":"13","month":"04","year":"2008","remarks":"140 Screens"},{"money":"$142,904","country":"USA","day":"06","month":"04","year":"2008","remarks":"188 Screens"},{"money":"$209,374","country":"USA","day":"30","month":"03","year":"2008","remarks":"226 Screens"},{"money":"$187,901","country":"USA","day":"23","month":"03","year":"2008","remarks":"244 Screens"},{"money":"$234,735","country":"USA","day":"16","month":"03","year":"2008","remarks":"272 Screens"},{"money":"$361,967","country":"USA","day":"09","month":"03","year":"2008","remarks":"455 Screens"},{"money":"$855,724","country":"USA","day":"02","month":"03","year":"2008","remarks":"796 Screens"},{"money":"$1,639,898","country":"USA","day":"24","month":"02","year":"2008","remarks":"1,367 Screens"},{"money":"$3,887,914","country":"USA","day":"17","month":"02","year":"2008","remarks":"1,936 Screens"},{"money":"$5,409,671","country":"USA","day":"10","month":"02","year":"2008","remarks":"2,841 Screens"},{"money":"$8,529,845","country":"USA","day":"03","month":"02","year":"2008","remarks":"2,976 Screens"},{"money":"$13,360,535","country":"USA","day":"27","month":"01","year":"2008","remarks":"3,074 Screens"},{"money":"$27,442,040","country":"USA","day":"20","month":"01","year":"2008","remarks":"3,057 Screens"},{"money":"£407,296","country":"UK","day":"20","month":"04","year":"2008","remarks":"366 Screens"},{"money":"£688,659","country":"UK","day":"13","month":"04","year":"2008","remarks":"432 Screens"},{"money":"£1,028,661","country":"UK","day":"06","month":"04","year":"2008","remarks":"434 Screens"},{"money":"£1,752,897","country":"UK","day":"30","month":"03","year":"2008","remarks":"428 Screens"},{"money":"BRL 648,524","country":"Brazil","day":"24","month":"02","year":"2008","remarks":"146 Screens"},{"money":"BRL 1,047,719","country":"Brazil","day":"17","month":"02","year":"2008","remarks":"145 Screens"}],"admissions":[{"money":"235,169","country":"Brazil","day":"24","month":"02","year":"2008","remarks":""},{"money":"108,785","country":"Brazil","day":"17","month":"02","year":"2008","remarks":""},{"money":"269,001","country":"Netherlands","day":"31","month":"12","year":"2008","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"10","month":"05","year":"2007","remarks":null},null],"copyrightHolder":"Twentieth Century Fox Film Corporation, Spyglass Entertainment Funding, LLC and Dune Entertainment III LLC in all territories except Brazil, Italy, Japan, Korea and Spain; TCF Hungary Film Rights Exploitation Limited Liability Company, Twentieth Century Fox Film Corporation, Spyglass Entertainment Funding, LLC and Dune Entertainment III LLC in Brazil, Italy, Japan, Korea and Spain"},"technical":{"runtime":["1 hr 51 min (111 min)"],"soundMix":["SDDS","Dolby Digital","DTS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["DeLuxe, USA (also prints)"],"filmLength":["3,064 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Digital Intermediate (master format)","Panavision (anamorphic) (source format)"],"printedFilmFormat":["35 mm"]},"rating":"6.1","metascore":"47","filmingLocations":[{"location":"Broadway, Manhattan, New York City, New York, USA"}],"rated":"PG-13","awards":[{"award":"Alliance of Women Film Journalists 2008","titlesAwards":[{"titleAwardOutcome":"Won EDA Special Mention Award","categories":[{"category":"Hall of Shame","names":[]}]}]},{"award":"Casting Society of America, USA 2008","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Outstanding Achievement in Casting - Studio Feature - Comedy","names":[{"name":"Cathy Sandrich Gelfond","id":"nm0762262","role":null},{"name":"Amanda Mackey","id":"nm0533439","role":null}]}]}]},{"award":"Golden Trailer Awards 2008","titlesAwards":[{"titleAwardOutcome":"Won Golden Trailer","categories":[{"category":"Best Romance TV Spot","names":[]},{"category":"Best Romance Poster","names":[]}]},{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Romance","names":[]}]}]},{"award":"People's Choice Awards, USA 2009","titlesAwards":[{"titleAwardOutcome":"Won People's Choice Award","categories":[{"category":"Favorite Movie Comedy","names":[]}]}]},{"award":"Teen Choice Awards 2008","titlesAwards":[{"titleAwardOutcome":"Won Teen Choice Award","categories":[{"category":"Choice Movie: Chick Flick","names":[]}]},{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie Actor: Comedy","names":[{"name":"James Marsden","id":"nm0005188","role":null},{"name":"Enchanted","id":"tt0461770","role":null}]}]}]}],"votes":"130,116","type":"Movie","companyCreditsSimple":[{"idCompany":"co0017497","name":"Fox 2000 Pictures"},{"idCompany":"co0031181","name":"Spyglass Entertainment"},{"idCompany":"co0241738","name":"Dune Entertainment III"}],"keywords":{"keywords":["wedding","bridesmaid","friend","woman","boss","f rated","digit in title","2000s","title directed by female","female protagonist","lingerie slip","overstuffed closet","manhattan new york city","central park manhattan new york city","quitting a job","female slaps female","ends with a wedding","chick flick","urination","bar","widower","wedding dress","vegan","unrequited love","taxi","switching clothes","storm","spare ribs","singing","sex in car","reception","proposal","promotion","photograph","office","maid of honor","kiss","jump","father daughter relationship","engagement ring","dog","deception","dead mother","cynic","closet","cell phone","taxi driver","breakfast","boat","boat ride","big brother","best friend","beach","baseball","assistant","alcohol","no opening credits","new york city","crush","sister sister relationship","journalist","friendship","employer employee relationship","dress","yoga","vegetarian","slide show","sit ups","rain","planner","newspaper","love triangle","lie","kimono","indigestion","hydroplane","groom","french fries","digital camera","chili dog","bride","bindi","title spoken by character","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:24:26"}}