{"data":{"movies":[{"title":"Unstable Fables: The Goldilocks and the 3 Bears Show","originalTitle":"","year":"2008","releaseDate":"20090612","directors":[{"name":"Howard E. Baker","id":"nm0048519"},{"name":"Arish Fyzee","id":"nm0299564"}],"writers":[{"name":"Chris Parrish","id":"nm0663517"}],"runtime":"79 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3OTQ4ODAzNl5BMl5BanBnXkFtZTgwNzU4ODc1NDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Family"],"plot":"When spoiled popstar Goldilocks agrees to a reality show where she lives with a family of three bears, neither party knows what they're getting into!","simplePlot":"When spoiled popstar Goldilocks agrees to a reality show where she lives with a family of three bears, neither party knows what they're getting into!","actors":[{"actorName":"Jamie Lynn Spears","urlProfile":"http://www.imdb.com/name/nm1086604","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjU0NTg1ODY2Nl5BMl5BanBnXkFtZTYwMjE1NDk3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1991","placeOfBirth":" McComb, Mississippi, USA","birthName":"Jamie-Lynn Marie Spears","height":"5' 4½\" (1.64 m)","bio":"Jamie Lynn Marie Spears was born the third and last child of Lynne Spears and Jamie Spears. She was born on April 4, 1991 in McComb, Mississippi, just on the borderline of Louisiana. Her family also includes her older brother, Bryan Spears, and her older sister, Britney Spears. Jamie has always been a performer, like her sister Britney. She loved gymnastics, dance, acting, and singing growing up. Jamie's first on-screen role was in her sister's movie, Crossroads (2002). She is the proud mother of Maddie Aldridge (Maddie Briann Aldridge), who was born on June 19, 2008. Her daughter's father, Casey Aldridge, is her ex-fiancé. Jamie Lynn Spears now resides in Louisiana, with her husband Jamie Watson and her daughter, where she is pursuing a country music singing career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjU0NTg1ODY2Nl5BMl5BanBnXkFtZTYwMjE1NDk3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1086604","name":"Jamie Lynn Spears","nicknames":["J Lynn"],"idIMDB":"nm1086604"},"actorId":"nm1086604","character":"Goldilocks","urlCharacter":"http://www.imdb.com/character/ch0031559","main":true},{"actorName":"Brooke Shields","urlProfile":"http://www.imdb.com/name/nm0000222","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE4ODM2MzY5OV5BMl5BanBnXkFtZTcwNTE5MTU5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1965","placeOfBirth":" New York City, New York, USA","birthName":"Brooke Christa Shields","height":"6' (1.83 m)","bio":"\"Want to know what comes between me and my Calvins? Nothing\". If you have not heard of Brooke Shields before, this tagline from her Calvin Klein Jeans ad had to grab your attention. Not that she has not had a previously noteworthy resume. She was born on May 31, 1965 in New York City and, at age 12, she starred as a child prostitute in Pretty Baby (1978). Could this movie even be made today? It was considered risky and controversial in 1978. It was followed by another blockbuster, the romance adventure drama The Blue Lagoon (1980). Brooke has proved herself to be so much more than her early films. Her broad range of work as an adult would be quite an achievement for anyone, especially given how difficult transitioning from child actor to adult often is. She has never stopped working, whether it be a Bob Hope Christmas special, her own sitcom Suddenly Susan (1996) or as an author. She also managed to work on a degree from Princeton University. She has received a number of awards during her career, most notably The People's Choice award for 1981 through 1984 in the category of Favorite Young Performer. In 1997, she was honored again with The People's Choice award for Favorite Female Performer in a New Television Series in 1997 for her work in Suddenly Susan (1996). In her personal life, she was married in 1997 to tennis player Andre Agassi and was devastated when they divorced two years later. She married for the second time in 2001 to Chris Henchy. She has been open about using fertility treatments to become pregnant with their daughter, Rowan, born in 2003. When suffering debilitating depression after the birth of her daughter, she made the decision to put her feelings down on paper. Her book, \"Down Came the Rain: My Journey Through Postpartum Depression\", takes a hard, honest look at what she and many other women experience after childbirth. She still lives in New York City, and is still sought after for work in movies, television, and on stage. Pretty nice list of achievements for the once Calvin Klein jeans girl.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE4ODM2MzY5OV5BMl5BanBnXkFtZTcwNTE5MTU5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000222","name":"Brooke Shields","nicknames":["Brookie"],"idIMDB":"nm0000222"},"actorId":"nm0000222","character":"Ruby Bear","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Arnold","urlProfile":"http://www.imdb.com/name/nm0000792","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTYzNzMyNl5BMl5BanBnXkFtZTgwNjc2NzgzMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1959","placeOfBirth":" Ottumwa, Iowa, USA","birthName":"Thomas Duane Arnold","height":"6' 2\" (1.88 m)","bio":"Tom Arnold was born in Ottumwa, Iowa, to Linda (Graham) and Jack Arnold. After his parents divorced, he was raised by his father. In 1983, he got his first taste of stand-up comedy when he performed at open microphone nights at the University of Iowa. Tom's comedy career had its ups and downs over the next several years until 1988, when he entered the Minneapolis Comedy Competition and won first place. With this victory in hand, he decided to move to Los Angeles to pursue a stand-up comedy career. Once he hit Los Angeles, things happened fast. That same year, he was hired as a staff writer for Roseanne Barr's TV sitcom Roseanne (1988) and began to appear regularly on the show as \"Arnie Thomas\". He and Roseanne Barr were married in 1990, with Arnold converting to Judaism prior to the marriage. They formed Rapello County Productions to develop projects for themselves. The couple's marriage, together with their sometimes outrageous behavior, attracted media attention - and especially that of the tabloids - like a magnet. In 1994 conditions between the two deteriorated and they went through a very public, and acrimonious, divorce. Tom has been married twice since then and is the co-host of Fox Sports Net's talk show The Best Damn Sports Show Period (2001). He also does voiceover work, and provides the voice for the \"Oven Mitt\" character in the TV commercials for the Arby's restaurant chain.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTYzNzMyNl5BMl5BanBnXkFtZTgwNjc2NzgzMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000792","name":"Tom Arnold","idIMDB":"nm0000792"},"actorId":"nm0000792","character":"Mac Bear","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ben Baker","urlProfile":"http://www.imdb.com/name/nm2522447","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM3NTc1MzA2Nl5BMl5BanBnXkFtZTcwODA0OTQyNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Ben Baker is an actor, known for Far Cry 3 (2012), Job Race (2010) and Death and Jane (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM3NTc1MzA2Nl5BMl5BanBnXkFtZTcwODA0OTQyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2522447","name":"Ben Baker","idIMDB":"nm2522447"},"actorId":"nm2522447","character":"Richard Pig / Pig Classmate #1 / Paparazzi 2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jessica DiCicco","urlProfile":"http://www.imdb.com/name/nm0223740","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYxNDAyNzQzOF5BMl5BanBnXkFtZTcwMTY0MzEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1980","placeOfBirth":" Los Angeles, California, USA","birthName":"Jessica Sonya DiCicco","height":"5' 1½\" (1.56 m)","bio":"Born in Los Angeles, and raised in New York City, Jessica DiCicco grew up on the Upper West side of Manhattan. She has been around show business virtually her whole life. Even her birth was announced in both Variety and Us Magazine, since her father, Bobby Di Cicco, was a popular actor in the late 1970s and early '80s with many films to his credit including The Big Red One (1980) and 1941 (1979). Despite her early exposure to show business, Jessica's acting career actually began unintentionally. During what she thought was a typical day in her second grade class, actress Marlo Thomas selected her from thousands of New York school children to appear on the ABC special Free to Be... a Family (1988). She worked on the show for one year and was heavily featured in the final broadcast. Soon after, Jessica landed her first role in the film The Godfather: Part III (1990) followed by the cult classic Household Saints (1993), and booked multiple national commercial spots including Cheerios, Burger King, and a groundbreaking Nike campaign directed by Spike Lee. She also lent her voice to many television and radio projects and appeared in numerous productions for theater, feature film and television, including the lead in a Nickelodeon pilot, Bus No. 9 (1998), which earned her a nomination for a Young Artists Award. Jessica's ambition and drive also manifested itself in her academics and passion for photography. She was an excellent student, always making her education top priority. Also an outstanding photographer, Jessica was the youngest photographer to ever shoot the cover of New York Magazine, in addition to shooting the entire eight-page cover story. This issue became one of the largest selling issues in New York Magazine's history.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYxNDAyNzQzOF5BMl5BanBnXkFtZTcwMTY0MzEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0223740","name":"Jessica DiCicco","idIMDB":"nm0223740"},"actorId":"nm0223740","character":"Misty Bear / Gretel / Girl Fan 2","urlCharacter":"http://www.imdb.com/character/ch0042744","main":true},{"actorName":"Chris Elwood","urlProfile":"http://www.imdb.com/name/nm0255902","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA2OTUyMTE0NV5BMl5BanBnXkFtZTcwNjEyNTIzMQ@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Christopher James Elwood is an actor and a writer, known for How High (2001), Punk'd (2005), Need for Speed: Underground 2 (2004) Mighty Med (2013) Manhattan Minutiae (2016). He has been married to Rachel Silver since May 13, 2011, and they have two children. He was previously married to Jenni Pulos.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA2OTUyMTE0NV5BMl5BanBnXkFtZTcwNjEyNTIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0255902","name":"Chris Elwood","idIMDB":"nm0255902"},"actorId":"nm0255902","character":"Simon Owl / Rex Stork","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Jones","urlProfile":"http://www.imdb.com/name/nm1947602","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MjM5NDk4Ml5BMl5BanBnXkFtZTcwNTA1MzkyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1982","placeOfBirth":" Omaha, Nebraska, USA","birthName":"Brian Michael Jones","height":"5' 9\" (1.75 m)","bio":"Brian Jones was born on February 5, 1982 in Omaha, Nebraska, USA as Brian Michael Jones. He is an actor, known for Hail, Caesar! (2016), Finding Amanda (2008) and Muppets Most Wanted (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MjM5NDk4Ml5BMl5BanBnXkFtZTcwNTA1MzkyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1947602","name":"Brian Jones","idIMDB":"nm1947602"},"actorId":"nm1947602","character":"Eddie Goose / Cricket 1 / Hansel","urlCharacter":"http://www.imdb.com/character/ch0042730","main":true},{"actorName":"Nolan North","urlProfile":"http://www.imdb.com/name/nm0636046","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2OTk2Mzc5OF5BMl5BanBnXkFtZTgwMjc3MzI0MDI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1970","placeOfBirth":" New Haven, Connecticut, USA","birthName":"Nolan Ramsay North","height":"6' 1\" (1.85 m)","bio":"Nolan North was born on October 31, 1970 in New Haven, Connecticut, USA as Nolan Ramsay North. He is known for his work on Uncharted: The Nathan Drake Collection (2015), Con Man (2015) and Pretty Little Liars (2010). He has been married to Jill Murray since June 4, 1999. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2OTk2Mzc5OF5BMl5BanBnXkFtZTgwMjc3MzI0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0636046","name":"Nolan North","idIMDB":"nm0636046"},"actorId":"nm0636046","character":"Weasel #1 / Sandy Pig / Cool Smooth Wolf","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ronn Ozuk","urlProfile":"http://www.imdb.com/name/nm2338214","urlPhoto":"","biography":{"bio":"Ronn Ozuk is an actor, known for Spider-Man 2 (2004), Alexander the Great (2006) and Unstable Fables: The Goldilocks and the 3 Bears Show (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2338214","name":"Ronn Ozuk","idIMDB":"nm2338214"},"actorId":"nm2338214","character":"Chad Frog / Paparazzi 1 / Scary Girl Fan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Colton Parsons","urlProfile":"http://www.imdb.com/name/nm1897456","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwMzc2NDA5OV5BMl5BanBnXkFtZTcwNDI2MTQzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1992","placeOfBirth":" New Jersey, USA","birthName":"Colton John Parsons","height":"5' 8\" (1.73 m)","bio":"Colton Parsons Began his career at 5 years old! He started out as a model for the \"Ford\" modeling co. and is still with them today! He has done everything from K-mart to the Gap, magazine covers, billboards, Tommy Hilfiger, Ralph Lauren, and the list goes on. He started in the Biz, following his sister Hassey Parsons footsteps, she is now 20 and a Pastry chef...she was also with Ford. Colton eased into a Commercial career and then student film, independent film, Film and television, voice and all that goes with it. Colton recently did a pilot for ABC having landed a lead role. He will be spending the summer in Los Angeles where he loves working the best and swinging on the \"Rings\" in Santa Monica on Muscle beach! Colton works very hard at all he does, and looks forward to a long career in acting. He says being a movie star is unimportant, but being a working actor is! He also looks forward to being able to support his cause which is finding a cure for cancer and cancer research.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwMzc2NDA5OV5BMl5BanBnXkFtZTcwNDI2MTQzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1897456","name":"Colton Parsons","nicknames":["Coco"],"idIMDB":"nm1897456"},"actorId":"nm1897456","character":"Junior Bear","urlCharacter":"http://www.imdb.com/character/ch0086578","main":true},{"actorName":"Jenni Pulos","urlProfile":"http://www.imdb.com/name/nm0700480","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MDA1MjMzM15BMl5BanBnXkFtZTcwNjU1NjU1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1973","placeOfBirth":"","bio":"Jenni Pulos, an Emmy-nominated producer, is best known for her role on Bravo's hit show, Flipping Out (2007), where she serves as an Executive Assistant to Jeff Lewis and for her role on its spin off, Interior Therapy with Jeff Lewis (2012). Jenni has worked for Jeff for more than thirteen years and, in that time, has worn many different hats. She is also a unique Greek-American actress, comedian, writer, producer and Apollo-winning rapper. Her children's rap album, \"Old School Kids Beats\", was released in April, in partnership with Toys 'R Us. Jenni also co-wrote and performs the theme song for Bravo's wildly successful Watch What Happens: Live (2009) with Andy Cohen. In addition to her music, she is developing other scripted and reality shows, both as a writer, actor and producer. Jenni's first book, a charming memoir-advice novel titled \"Grin and Bear It: How to Be Happy No Matter What Reality Throws Your Way\", was released to rave reviews in March of 2014. Jenni is married to Dr. Jonathan Nassos. They wed Memorial Day Weekend 2012 in Chicago and welcomed their first child, daughter Alianna Marika, in June 2013, to millions of Bravo fans on Flipping Out (2007). Alianna's birth episode was subsequently nominated for a Primetime Emmy in 2014. They split their time between NYC and LA and live with their other furry children: Lulu, Janet and Kiko the blue beta fish.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MDA1MjMzM15BMl5BanBnXkFtZTcwNjU1NjU1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0700480","name":"Jenni Pulos","idIMDB":"nm0700480"},"actorId":"nm0700480","character":"Old Lady Hare / Inga / Girl Fan 1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin Michael Richardson","urlProfile":"http://www.imdb.com/name/nm0724656","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0OTg2NDQyOV5BMl5BanBnXkFtZTcwMTAwNjkzMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1964","placeOfBirth":" Bronx, New York City, New York, USA","height":"6' (1.83 m)","bio":"Well-known, king-sized actor and voice artist Kevin Michael Richardson was born in Bronx, New York. He is, perhaps, mostly recognizable for his deep voice, which he uses in many of his works. Richardson is a classically trained actor. He first gained recognition as one of only eight U.S. high school students selected for the National Foundation for the Arts' \"Arts '82\" program, later he earned a scholarship to Syracuse University. Kevin is well-known by various voice works, mostly villainous. He lent his voice to based-upon video game film Mortal Kombat (1995) as Goro, he was also in Matrix Revolutions (2003) as Deus Ex Machina, and made a brief appearance in Clerks II (2006) as a police officer. To mention that he did a brief additional voices for mega hit Transformers: Revenge of the Fallen (2009). He did voice in many animated films and TV series, such as \"The Mask - The Animated Series\" (1995), \"The New Batman Adventures\" (1997), \"Pokemon\" (1998), \"Powerpuff Girls\" (1998), \"Voltron: The Third Dimension\" (1998), \"Family Guy\", Lilo & Stitch (2002), as well as \"Lilo & Stitch\" TV series, \"Codename Kids Next Door\" (2002), Batman VS Dracula (2005) (V), where he voiced Joker, \"Mummy The Animated Series\" (2003), TMNT (2007) as General Aguila, \"Transformers Animated\" (2007) as Omega Supreme and Batman: Gotham Knight (2008), as Lucius Fox. He also did voices in such video games as Halo 2 (Tartarus), Kingdom Hearts (Sebastian) and others. He lives in Los Angeles and likes to work in Manhattan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0OTg2NDQyOV5BMl5BanBnXkFtZTcwMTAwNjkzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0724656","name":"Kevin Michael Richardson","idIMDB":"nm0724656"},"actorId":"nm0724656","character":"Jay Weasel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Arnold Taylor","urlProfile":"http://www.imdb.com/name/nm0852517","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwODA4ODg5Ml5BMl5BanBnXkFtZTgwOTQ1NzY1MDE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1969","placeOfBirth":" Santa Barbara, California, USA","birthName":"James Arnold Taylor","height":"5' 4\" (1.63 m)","bio":"James Arnold Taylor's versatile vocal range has given him success in every facet of the voice-over industry. His voice is heard all of the world daily, and you would never know it's one person. His list of credits range from leading roles in major summer blockbuster films, starring roles in the hottest animation on television, a promo voice for Fox, Spike, G4, and national ad campaigns in commercials for TV and radio, from the voice of a Mini Wheat to the current voice of Fred Flintstone. You can literally play the \"Six Degrees of...\" game with James and be only one degree from just about every name in Hollywood today. James' most notable credits are: Obi-Wan Kenobi from Star Wars: The Clone Wars (2008), Leonardo from Teenage Mutant Ninja Turtles (2012), Johnny from Johnny Test (2005), Green Arrow from Batman: The Brave and the Bold (2008), Harry Osborn from The Spectacular Spider-Man (2008), Milo Thatch from Atlantis: Milo's Return (2003), Wooldoor Sockbat and the Producer from Drawn Together (2004), The Fallen from Transformers: Revenge of the Fallen (2009), Tidus from Final Fantasy X (2001), Final Fantasy X-2 (2003) and Dissidia: Final Fantasy (2008) video games, Ratchet from the Ratchet & Clank (2002) video game series, Gabe Logan from the Syphon Filter (1999) video game series, and Ash from The Animatrix (2003). James also voice-doubles for many of today's biggest names, including _Johnny Depp_, _Ewan McGregor_, _Shia LaBeouf_, _Christopher Walken_, _Michael J. Fox (I)_, _David Spade_, _Daniel Radcliffe_, _Clive Owen (I)_, _Nicolas Cage_, _Christian Bale_, _Steve Carell_, _Matthew McConaughey_, _Justin Timberlake_, _James McAvoy_, _Alec Baldwin_, _Billy Bob Thornton_, _Seann William Scott_, _Denis Leary_, _Robin Williams (I)_, and _Ron Howard (I)_. Having voices in some of the biggest franchises in movies, TV, and video games, he has had a successful career ultimately doing what he loves most: entertaining.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwODA4ODg5Ml5BMl5BanBnXkFtZTgwOTQ1NzY1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0852517","name":"James Arnold Taylor","idIMDB":"nm0852517"},"actorId":"nm0852517","character":"Cricket 2 / Weasel 2 / Pig Classmate #3","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Armando Valdes-Kennedy","urlProfile":"http://www.imdb.com/name/nm0883620","urlPhoto":"","biography":{"bio":"Armando Valdes-Kennedy is known for his work on Billy's Hollywood Screen Kiss (1998), Ghost Recon Advanced Warfighter (2005) and Call of Duty 4: Modern Warfare (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0883620","name":"Armando Valdes-Kennedy","idIMDB":"nm0883620"},"actorId":"nm0883620","character":"Jorge / Paparazzi 3","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Audrey Wasilewski","urlProfile":"http://www.imdb.com/name/nm0913585","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MTk3ODU5NV5BMl5BanBnXkFtZTgwMjkyMjM4ODE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1967","placeOfBirth":" Maryland, USA","bio":"Audrey Wasilewski was born on June 26, 1967 in Maryland, USA. She is an actress and producer, known for RED (2010), Seven Pounds (2008) and Star Trek Into Darkness (2013). She has been married to Lyle Kanouse since 1993.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MTk3ODU5NV5BMl5BanBnXkFtZTgwMjkyMjM4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0913585","name":"Audrey Wasilewski","idIMDB":"nm0913585"},"actorId":"nm0913585","character":"Rhonda / Heather / Mandy / Contractor Cow","urlCharacter":"http://www.imdb.com/character/ch0253028","main":true}],"seasons":[],"idIMDB":"tt1086780","urlIMDB":"http://www.imdb.com/title/tt1086780","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 19 min (79 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.1","filmingLocations":[],"rated":"G","awards":[],"votes":"151","type":"Video","companyCreditsSimple":[{"idCompany":"co0092633","name":"Flame Ventures"},{"idCompany":"co0095015","name":"Jim Henson Company, The"},{"idCompany":"co0206196","name":"Prana Studios"}],"keywords":{"keywords":["number in title","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 07:54:38"}}