{"data":{"movies":[{"title":"Unfinished Song","originalTitle":"Song for Marion","year":"2012","releaseDate":"20130515","directors":[{"name":"Paul Andrew Williams","id":"nm1440314"}],"writers":[{"name":"Paul Andrew Williams","id":"nm1440314"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MjA5NzExM15BMl5BanBnXkFtZTcwMDE5NzU2OQ@@._V1.jpg","countries":["UK","Germany"],"languages":["English"],"genres":["Comedy","Drama","Music","Romance"],"plot":"\"Song for Marion\", a London-set comedic drama, is about shy, grumpy pensioner Arthur who is reluctantly inspired by his beloved wife Marion to join a highly unconventional local choir. At odds with his son James, it is left to charismatic choir director Elizabeth to try and persuade Arthur that he can learn to embrace life. Arthur must confront the undercurrents of his own grumbling persona as he embarks on a hilarious, life-affirming journey of musical self discovery.","simplePlot":"Grumpy pensioner Arthur honors his recently deceased wife's passion for performing by joining the unconventional local choir to which she used to belong, a process that helps him build bridges with his estranged son, James.","actors":[{"actorName":"Terence Stamp","urlProfile":"http://www.imdb.com/name/nm0000654","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0ODc3ODQ4OF5BMl5BanBnXkFtZTcwNzIxNzAyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1938","placeOfBirth":" Stepney, London, England, UK","birthName":"Terence Henry Stamp","height":"6' (1.83 m)","bio":"Terence Henry Stamp was born and lived in Canal Road, Bow, until German bombers forced his family to move to Plaistow. An icon of the 1960s, he dated the likes of Julie Christie, Brigitte Bardot and Jean Shrimpton. After an extremely successful early career, starring in Modesty Blaise (1966), Poor Cow (1967) and Far from the Madding Crowd (1967), Stamp withdrew from mainstream films after his girlfriend, supermodel Jean Shrimpton, left him, and he and went on a 10-year sabbatical in India. He returned home in the late 1970s to star as the evil General Zod in Superman II (1980), and in 1984, delivered what many consider his finest performance as the supergrass in Stephen Frears' The Hit (1984). A few minor but colourful roles, topped by his performance as the transsexual Bernadette in Priscilla, folle du désert (1994), have put Stamp back in the British consciousness. His role of a vengeful gangster in The Limey (1999) was created especially for him by its director.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0ODc3ODQ4OF5BMl5BanBnXkFtZTcwNzIxNzAyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000654","name":"Terence Stamp","idIMDB":"nm0000654"},"actorId":"nm0000654","character":"Arthur","urlCharacter":"http://www.imdb.com/character/ch0407985","main":true},{"actorName":"Vanessa Redgrave","urlProfile":"http://www.imdb.com/name/nm0000603","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MjE0OTgzNF5BMl5BanBnXkFtZTcwOTQ3ODMwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 January 1937","placeOfBirth":" Greenwich, London, England, UK","height":"5' 11\" (1.81 m)","bio":"On January 30, 1937, renowned theatre actor Michael Redgrave was performing in a production of Hamlet in London. During the curtain call, the show's lead, Laurence Olivier, announced to the audience: \"tonight a great actress was born\". This was in reference to his co-star's newborn daughter, Vanessa Redgrave. Vanessa was born in Greenwich, London, to Michael Redgrave and Rachel Kempson, both thespians. Three quarters of a century after her birth (despite numerous ups and down) this rather forward expectation has definitely been lived up to with an acclaimed actress that has won (among many others) an Academy Award, two Emmys, two Golden Globes, two Cannes Best Actress awards, a Tony, a Screen Actors Guild award, a Laurence Olivier theatre award and a BAFTA fellowship. Growing up with such celebrated theatrical parents, great expectations were put on both herself, her brother Corin Redgrave and sister Lynn Redgrave at an early age. Shooting up early and finally reaching a height just short of 6 foot, Redgrave initially had plans to dance and perform ballet as a profession. However she settled on acting and entered the Central School of Speech and Drama in 1954 and four years later made her West End debut. In the decade of the 1960s she developed and progressed to become one of the most noted young stars of the English stage and then film. Performances on the London stage included the classics: 'A Touch of Sun', 'Coriolanus', 'A Midsummer's Night Dream', 'All's Well that Ends Well', 'As You Like It', 'The Lady from the Sea', 'The Seagull' and many others. By the mid 1960s, she had booked various film roles and matured into a striking beauty with a slim, tall frame and attractive face. In 1966 she made her big screen debut as the beautiful ex-wife of a madman in an Oscar nominated performance in the oddball comedy Morgan! (1966), as well as the enigmatic woman in a public park in desperate need of a photographer's negatives in the iconic Blow-Up (1966) and briefly appeared in an unspoken part of Anne Boleyn in the Best Picture winner of the year A Man for All Seasons (1966). She managed to originate the title role in \"The Prime of Miss Jean Brodie\" the same year on the London stage (which was then adapted for the big screen a few years later, but Maggie Smith was cast instead and managed to win an Oscar for her performance). Her follow up work saw her play the lead in the box office hit adaptation Camelot (1967), a film popular with audiences but dismissed by critics, and her second Academy Award nominated performance as Isadora Duncan in the critically praised Isadora (1968). Her rise in popularity on film also coincided with her public political involvement, she was one of the lead faces in protesting against the Vietnam war and lead a famous march on the US embassy, was arrested during a Ban-the-Bomb demonstration, publicly supported Yasar Arafat's Palestine Liberation Organization (PLO) and fought for various other human rights and particularly left wing causes. Despite her admirably independent qualities, most of her political beliefs weren't largely supported by the public. In 1971 after 3 films back to back, Redgrave suffered a miscarriage (it would have been her fourth, after Natasha Richardson, Joely Richardson and Carlo Gabriel Nero) and a break up with her then partner and father of her son, Franco Nero. This was around the same time her equally political brother Corin introduced her to the Workers Revolutionary Party, a group who aimed to destroy capitalism and abolish the monarchy. Her film career began to suffer and take the back seat as she became more involved with the party, twice unsuccessfully attempting to run as a party member for parliament, only obtaining a very small percentage of votes. In terms of her film career at the time, she was given probably the smallest part in the huge ensemble who-dunnit hit, Murder on the Orient Express (1974) and given another thankless small part as Lola Deveraux in the Sherlock Holmes adventure The Seven-Per-Cent Solution (1976). After a celebrated Broadway debut, she created further controversy in 1977 with her involvement in two films, firstly in Julia (1977) where she acted opposite Jane Fonda as a woman fighting Nazi oppression and narrated and featured in the documentary The Palestinian (1977) where she famously danced holding a Kalashnikov rifle. She publicly stated her condemnation of what she termed \"Zionist hudlums\", which outraged Jewish groups and as a result a screening of her documentary was bombed and Redgrave was personally threatened by the Jewish Defense League (JDL). Julia (1977) happened to be a huge critical success and Redgrave herself was nominated for a Best Supporting Actress Oscar, but Jewish support groups demanded her nomination to be dropped and at the event of the Academy Awards burned effigies of Redgrave and protested and picketed. Redgrave was forced to enter the event via a rear entrance to avoid harm and when she won the award she famously remarked on the frenzy causes as \"Zionist hoodlums\" which caused the audience to audibly gasp and boo. The speech reached newspapers the next morning and her reputation was further damaged. It came as a surprise when CBS hired her for the part of real life Nazi camp survivor Fania Fenelon in Playing for Time (1980), despite more controversy and protesting (Fenelon herself didn't even want Redgrave to portray her) she won an Emmy for the part and the film was one of the highest rating programs of the year. Her follow up film work to her Oscar had been mostly low key but successful, performances in films such as Yanks (1979), Agatha (1979), The Bostonians (1984), Wetherby (1985) and Prick Up Your Ears (1987) further cemented her reputation as a fine actress and she received various accolades and nominations. However mainly in the 1980s, she focused on TV films and high budget mini-series as well as theatre in both London and New York. She made headlines in 1984 when she sued the Boston Symphony Orchestra for $5 million for wrongful cancellation of her contract because of her politics (she also stated her salary was significantly reduced in Agatha (1979) for the same reason). She became more mainstream in the 1990s where she appeared in a string of high profile films but the parts often underused Redgrave's abilities or they were small cameos/5-minute parts. Highlights included Howards End (1992), Little Odessa (1994), Mission: Impossible (1996) and Cradle Will Rock (1999), as well as her leading lady parts in A Month by the Lake (1995) and Mrs Dalloway (1997). In 2003 she finally won the coveted Tony award for her performance in 'The Long Day's Journey Into Night' and followed up with another two Tony nominated performances on Broadway, her one woman show 'The Year of Magical Thinking' in 2007 and 'Driving Miss Daisy' in 2010 which not only was extended due to high demand, but was also transferred to the West End for an additional three months in 2011. Vanessa continues to lend her name to causes and has been notable for donating huge amounts of her own money for her various beliefs. She has publicly opposed the war in Iraq, campaigned for the closure of Guantanamo Bay, supported the rights of gays and lesbians as well as AIDs research and many other issues. She released her autobiography in 1993 and a few years later she was elected to serve as a UNICEF Goodwill Ambassador. She also famously declined the invitation to be made a Dame for her services as an actress. Many have wondered the possible heights her career could have reached if it wasn't for her outspoken views, but being a celebrity and the artificial lifestyle usually attached doesn't seem to interest Redgrave in the slightest. Vanessa has worked with all three of her children professionally on numerous occasions (her eldest daughter, Natasha Richardson tragically died at the age of 45 due to a skiing accident) and in her mid 70s she still works regularly on television, film and theatre, delivering time and time again great performances.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MjE0OTgzNF5BMl5BanBnXkFtZTcwOTQ3ODMwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000603","name":"Vanessa Redgrave","idIMDB":"nm0000603"},"actorId":"nm0000603","character":"Marion","urlCharacter":"http://www.imdb.com/character/ch0407986","main":true},{"actorName":"Gemma Arterton","urlProfile":"http://www.imdb.com/name/nm2605345","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTAwNTMwMzE5OF5BMl5BanBnXkFtZTgwMjYwNzI2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 February 1986","placeOfBirth":" Gravesend, Kent, England, UK","birthName":"Gemma Christina Arterton","height":"5' 7\" (1.7 m)","bio":"Gemma Christina Arterton was born in Gravesend, Kent, England, where she was raised. She is the daughter of Sally-Anne (Heap), a cleaner, and Barry J. Arterton, a welder. Her mother's cousin is singer-songwriter Eric Goulden. Her parents divorced when she was age five, and Gemma subsequently lived with her younger sister and her mother. Her parents encouraged their children to explore their creative abilities. Gemma's sister, Hannah, liked to sing, whereas Gemma chose acting. During her teenage years, she was part of the Masquerade and Miskin theater companies, appearing in productions of The Massacre of Civitella and Guiding Star. In 2004, she won an award for Best Supporting Actress, which helped her to win a grant to study at the Royal Academy of Dramatic Art (RADA). Whilst studying at RADA, she landed her first professional role in Capturing Mary (2007), directed by Stephen Poliakoff and starring Maggie Smith. Gemma graduated from RADA in 2007 and won her first film role in St. Trinian's (2007). Her breakthrough role came in 2008, when she appeared in the James Bond film Quantum of Solace (2008). In 2009, she was the winner of Empire's Best Newcomer Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTAwNTMwMzE5OF5BMl5BanBnXkFtZTgwMjYwNzI2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2605345","name":"Gemma Arterton","idIMDB":"nm2605345"},"actorId":"nm2605345","character":"Elizabeth","urlCharacter":"http://www.imdb.com/character/ch0364997","main":true},{"actorName":"Barry Martin","urlProfile":"http://www.imdb.com/name/nm0551951","urlPhoto":"","biography":{"bio":"Barry Martin is an actor, known for Children of Men (2006), Unfinished Song (2012) and Hereafter (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0551951","name":"Barry Martin","idIMDB":"nm0551951"},"actorId":"nm0551951","character":"Timothy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Taru Devani","urlProfile":"http://www.imdb.com/name/nm2697883","urlPhoto":"","biography":{"dateOfBirth":"22 April 1951","placeOfBirth":" Uganda","birthName":"Tarulata Kotecha","height":"5' 3\" (1.6 m)","bio":"Taru Devani was born on April 22, 1951 in Uganda as Tarulata Kotecha. She is an actress, known for Unfinished Song (2012), Open Secrets (2008) and Shoot on Sight (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2697883","name":"Taru Devani","nicknames":["Tara"],"idIMDB":"nm2697883"},"actorId":"nm2697883","character":"Sujantha","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anne Reid","urlProfile":"http://www.imdb.com/name/nm0717176","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU2NDc5NTExMl5BMl5BanBnXkFtZTYwMzM2OTE3._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1935","placeOfBirth":" Newcastle Upon Tyne, England, UK","height":"5' 5\" (1.65 m)","bio":"After several small roles in the classic 1950s British TV shows 'The Adventures of Robin Hood' and 'Hancock's Half Hour' she found fame as Ken Barlow's wife Valerie in the #1 UK TV show 'Coronation Street' she remained with the show for a decade before leaving to give birth and bring up her son. Her character was accidentally electrocuted while trying to plug in a hairdryer. She continued in steady work and in the late 1980's became one of the regulars used by 'Victoria Wood' in her TV shows. This bore fruit in the role of Jean in the hit sitcom 'dinnerladies' (1998 - 2000). Her most critically acclaimed role came in 2003 when she took the lead in the film 'The Mother' about a woman who has an affair with her daughter's partner. The role of May saw her earn a BAFTA film nomination for Best Actress.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU2NDc5NTExMl5BMl5BanBnXkFtZTYwMzM2OTE3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0717176","name":"Anne Reid","idIMDB":"nm0717176"},"actorId":"nm0717176","character":"Brenda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elizabeth Counsell","urlProfile":"http://www.imdb.com/name/nm0183584","urlPhoto":"","biography":{"dateOfBirth":"7 June 1942","placeOfBirth":" Windsor, Berkshire, England, UK","bio":"Elizabeth Counsell was born on June 7, 1942 in Windsor, Berkshire, England. She is an actress and producer, known for Brush Strokes (1986), Unfinished Song (2012) and Agatha Christie's Miss Marple: The Moving Finger (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0183584","name":"Elizabeth Counsell","idIMDB":"nm0183584"},"actorId":"nm0183584","character":"Cheryl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ram John Holder","urlProfile":"http://www.imdb.com/name/nm0390326","urlPhoto":"","biography":{"dateOfBirth":"1934","placeOfBirth":" British Guiana","bio":"Ram John Holder was born in 1934 in British Guiana. He is an actor and composer, known for Desmond's (1989), Unfinished Song (2012) and Half Moon Street (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0390326","name":"Ram John Holder","idIMDB":"nm0390326"},"actorId":"nm0390326","character":"Charlie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Denise Rubens","urlProfile":"http://www.imdb.com/name/nm5611183","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Denise Rubens yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5611183","name":"Denise Rubens","idIMDB":"nm5611183"},"actorId":"nm5611183","character":"Marge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arthur Nightingale","urlProfile":"http://www.imdb.com/name/nm0631440","urlPhoto":"","biography":{"bio":"Arthur Tulloch Nightingale was born in 1931 in London (Greenwich) in the UK. He quit school at fourteen to go to work. At the age of 42, he enrolled in the East 15 Acting School in Loughton, Essex, UK (before its merger with the University of Essex). He has appeared in numerous television and movie productions including \"Tinker, Tailor Soldier Spy\" (2011). He was in an especially well-received television commercial in 2015 for the Edeka, the German supermarket chain, entitled \"Heimkommen\" (\"Homecoming\").","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0631440","name":"Arthur Nightingale","idIMDB":"nm0631440"},"actorId":"nm0631440","character":"Terry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jumayn Hunter","urlProfile":"http://www.imdb.com/name/nm2238584","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjQ1MDc3Njc0OV5BMl5BanBnXkFtZTgwMjY2NjM4MTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Jumayn Hunter is an actor, known for Eden Lake (2008), Attack the Block (2011) and Quartet (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjQ1MDc3Njc0OV5BMl5BanBnXkFtZTgwMjY2NjM4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2238584","name":"Jumayn Hunter","idIMDB":"nm2238584"},"actorId":"nm2238584","character":"Steven","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Eccleston","urlProfile":"http://www.imdb.com/name/nm0001172","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwOTI1NjUxMl5BMl5BanBnXkFtZTYwMTAzNjI3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 February 1964","placeOfBirth":" Salford, Lancashire, England, UK","height":"6' (1.83 m)","bio":"Christopher Eccleston trained at the Central School of Speech and Drama and first came to public attention as Derek Bentley in L'âge de vivre (1991). However, it was a regular role in the television series Cracker (1993) that made him a recognizable figure in the United Kingdom. He appeared in the low-budget thriller Shallow Grave (1994), and in the same year, won the part of Nicky Hutchinson in the epic BBC drama serial Our Friends in the North (1996). It was the transmission of the latter series on BBC Two that really made him into a household name in the United Kingdom. In his film career, he has starred as a leading man alongside a number of major actresses, such as Renée Zellweger in A Price Above Rubies (1998), Cate Blanchett in Elizabeth (1998), and Cameron Diaz and Jordana Brewster in The Invisible Circus (2001), and Nicole Kidman in Les autres (2001). In addition to his successful film career, he has continued to work in his favourite medium, appearing in some of the most challenging and thought-provoking British television dramas of recent years. These have included Clocking Off (2000) and Flesh and Blood (2002) for the BBC and Hillsborough (1996), the Iago character in a modern adaptation of Shakespeare's \"Othello\", and the religious epic The Second Coming (2003), playing Steve Baxter, the son of God. His stage career, while not as extensive as his screen credits, has nevertheless shown him to be a formidable actor. He has given intense, focused performances in such plays as \"Hamlet\", \"Electricity\" and \"Miss Julie\", for which he received excellent reviews. A very highly regarded actor, Eccleston has twice been nominated in the Best Actor category at the BAFTA Television Awards, the British premiere television awards ceremony. His first nomination came in 1997 for \"Our Friends in the North\". Although he didn't win those awards, however, he did triumph in the Best Actor categories at the 1997 Broadcasting Press Guild Awards and the Royal Television Society Awards, winning for \"Our Friends in the North\". He won the RTS Best Actor award for a second time in 2003, this time for his performance in \"Flesh and Blood\". In 2005, he received the Most Popular Actor award in the National Television Awards for Doctor Who.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwOTI1NjUxMl5BMl5BanBnXkFtZTYwMTAzNjI3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001172","name":"Christopher Eccleston","nicknames":["Chris"],"idIMDB":"nm0001172"},"actorId":"nm0001172","character":"James","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Orla Hill","urlProfile":"http://www.imdb.com/name/nm5331939","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYxMDc5MzkzMl5BMl5BanBnXkFtZTgwMjgyNzEwMjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Orla Hill is an actress, known for Swallows and Amazons (2016), Unfinished Song (2012) and Lily and the Revolution (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYxMDc5MzkzMl5BMl5BanBnXkFtZTgwMjgyNzEwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5331939","name":"Orla Hill","idIMDB":"nm5331939"},"actorId":"nm5331939","character":"Jennifer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Thomas","urlProfile":"http://www.imdb.com/name/nm0858530","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjZjZTgwNzktNDFmMi00YmJiLWFhMTUtZjg4NzI2ZGQwODc4XkEyXkFqcGdeQXVyNzQ3ODUxMzQ@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1952","placeOfBirth":" London, England, UK","bio":"Bill Thomas was born in 1952 in London, England. He is an actor, known for Syrup (1994), Alice Through the Looking Glass (2016) and The Sky in Bloom (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjZjZTgwNzktNDFmMi00YmJiLWFhMTUtZjg4NzI2ZGQwODc4XkEyXkFqcGdeQXVyNzQ3ODUxMzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0858530","name":"Bill Thomas","idIMDB":"nm0858530"},"actorId":"nm0858530","character":"Bill","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Willie Jonah","urlProfile":"http://www.imdb.com/name/nm0427289","urlPhoto":"","biography":{"bio":"Willie Jonah is an actor, known for The Iron Lady (2011), Boesman & Lena (2000) and Unfinished Song (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0427289","name":"Willie Jonah","idIMDB":"nm0427289"},"actorId":"nm0427289","character":"Robert","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1047011","urlIMDB":"http://www.imdb.com/title/tt1047011","business":{"budget":null,"openingWeekend":[{"money":"$25,728","country":"USA","day":"23","month":"06","year":"2013","remarks":"2 Screens"},{"money":"HUF 967,258","country":"Hungary","day":"07","month":"07","year":"2013","remarks":"13 Screens"}],"gross":[{"money":"$1,697,294","country":"USA","day":"29","month":"09","year":"2013","remarks":""},{"money":"$1,681,324","country":"USA","day":"22","month":"09","year":"2013","remarks":""},{"money":"$1,661,707","country":"USA","day":"15","month":"09","year":"2013","remarks":""},{"money":"$1,634,532","country":"USA","day":"01","month":"09","year":"2013","remarks":""},{"money":"$1,611,250","country":"USA","day":"25","month":"08","year":"2013","remarks":""},{"money":"$1,572,472","country":"USA","day":"18","month":"08","year":"2013","remarks":""},{"money":"$1,509,986","country":"USA","day":"11","month":"08","year":"2013","remarks":""},{"money":"$1,406,702","country":"USA","day":"04","month":"08","year":"2013","remarks":""},{"money":"$1,266,599","country":"USA","day":"28","month":"07","year":"2013","remarks":""},{"money":"$1,070,546","country":"USA","day":"21","month":"07","year":"2013","remarks":""},{"money":"$785,186","country":"USA","day":"14","month":"07","year":"2013","remarks":""},{"money":"$438,948","country":"USA","day":"07","month":"07","year":"2013","remarks":""},{"money":"$131,823","country":"USA","day":"30","month":"06","year":"2013","remarks":""},{"money":"$25,728","country":"USA","day":"23","month":"06","year":"2013","remarks":""}],"weekendGross":[{"money":"$9,565","country":"USA","day":"29","month":"09","year":"2013","remarks":"19 Screens"},{"money":"$12,504","country":"USA","day":"22","month":"09","year":"2013","remarks":"23 Screens"},{"money":"$7,868","country":"USA","day":"15","month":"09","year":"2013","remarks":"17 Screens"},{"money":"$8,544","country":"USA","day":"01","month":"09","year":"2013","remarks":"17 Screens"},{"money":"$17,461","country":"USA","day":"25","month":"08","year":"2013","remarks":"27 Screens"},{"money":"$31,416","country":"USA","day":"18","month":"08","year":"2013","remarks":"43 Screens"},{"money":"$53,963","country":"USA","day":"11","month":"08","year":"2013","remarks":"53 Screens"},{"money":"$85,395","country":"USA","day":"04","month":"08","year":"2013","remarks":"68 Screens"},{"money":"$113,667","country":"USA","day":"28","month":"07","year":"2013","remarks":"82 Screens"},{"money":"$156,307","country":"USA","day":"21","month":"07","year":"2013","remarks":"88 Screens"},{"money":"$239,700","country":"USA","day":"14","month":"07","year":"2013","remarks":"91 Screens"},{"money":"$243,728","country":"USA","day":"07","month":"07","year":"2013","remarks":"19 Screens"},{"money":"$92,256","country":"USA","day":"30","month":"06","year":"2013","remarks":"19 Screens"},{"money":"$25,728","country":"USA","day":"23","month":"06","year":"2013","remarks":"2 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"18","month":"07","year":"2011","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam LT"],"laboratory":["DeLuxe, London, UK (rushes and prints)","Flow Works GmbH Germany (on-line dailies: Egoli Tossell Film)"],"filmLength":null,"negativeFormat":["35 mm (Kodak Vision3 250D 5207, Vision3 200T 5213, Vision3 500T 5219)"],"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.0","metascore":"57","filmingLocations":[{"location":"Durham Johnston Comprehensive School, County Durham, England, UK"}],"rated":"PG-13","awards":[{"award":"AARP Movies for Grownups Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Movies for Grownups Award","categories":[{"category":"Best Grownup Love Story","names":[{"name":"Vanessa Redgrave","id":"nm0000603","role":null},{"name":"Terence Stamp","id":"nm0000654","role":null}]}]}]},{"award":"Beijing International Film Festival 2013","titlesAwards":[{"titleAwardOutcome":"Won Tiantian Award","categories":[{"category":"Best Screenplay","names":[{"name":"Paul Andrew Williams","id":"nm1440314","role":null}]},{"category":"Best Actor","names":[{"name":"Terence Stamp","id":"nm0000654","role":null}]}]},{"titleAwardOutcome":"Nominated Tiantian Award","categories":[{"category":"Best Picture","names":[{"name":"Paul Andrew Williams","id":"nm1440314","role":null}]}]}]},{"award":"British Independent Film Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated British Independent Film Award","categories":[{"category":"Best Screenplay","names":[{"name":"Paul Andrew Williams","id":"nm1440314","role":null}]},{"category":"Best Actor","names":[{"name":"Terence Stamp","id":"nm0000654","role":null}]},{"category":"Best Supporting Actress","names":[{"name":"Vanessa Redgrave","id":"nm0000603","role":null}]}]}]},{"award":"Hollywood Makeup Artist and Hair Stylist Guild Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Artisan","categories":[{"category":"Best Contemporary Hair Styling - Feature Films","names":[{"name":"Lucy Cain","id":"nm0128927","role":null}]}]}]},{"award":"Nashville Film Festival 2013","titlesAwards":[{"titleAwardOutcome":"Won Audience Choice Award","categories":[{"category":"Best Feature","names":[{"name":"Paul Andrew Williams","id":"nm1440314","role":null},{"name":"Steel Mill Pictures","id":null,"role":null}]}]}]},{"award":"Seattle International Film Festival 2013","titlesAwards":[{"titleAwardOutcome":"3rd place Golden Space Needle Award","categories":[{"category":"Best Actor","names":[{"name":"Terence Stamp","id":"nm0000654","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Space Needle Award","categories":[{"category":"Best Film","names":[{"name":"Paul Andrew Williams","id":"nm1440314","role":null}]}]}]}],"votes":"5,938","type":"Movie","companyCreditsSimple":[{"idCompany":"co0174463","name":"Steel Mill Pictures"},{"idCompany":"co0314559","name":"Coolmore Productions"},{"idCompany":"co0043735","name":"Egoli Tossell Film"}],"keywords":{"keywords":["choir","pensioner","strong female character","death","a cappella","elderly","elderly couple","married couple","curmudgeon","father son estrangement","mechanic","old woman","old man","cancer","competition","community center","earphones","hospital","female teacher","written by director","british","death of wife","three word title","cigarette smoking","bus ride","pop concert","heavy metal music","reference to motorhead","music competition","singing","terminal illness","grandfather granddaughter relationship","father son relationship","cancer patient","loss of loved one","loss of mother","loss of wife","loss of friend","grumpy old man","husband wife relationship","singing on bus","singing in a car","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:16:19"}}