{"data":{"movies":[{"title":"$5 a Day","originalTitle":"","year":"2008","releaseDate":"20090111","directors":[{"name":"Nigel Cole","id":"nm0170719"}],"writers":[{"name":"Neal H. Dobrofsky","id":"nm0229800"},{"name":"Tippi Dobrofsky","id":"nm0229801"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MDQ0NzI5OF5BMl5BanBnXkFtZTcwMjQ1ODExMw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama"],"plot":"In L.A., Flynn Parker loses his job as a health inspector when his time in prison comes to light, his girlfriend Maggie moves out because of his prevarications, and his ne'er-do-well father, Nat, summons him to Atlantic City with a tale of a malignant cancer. Flynn doesn't like Nat, a small-time hustler and the cause of Flynn's jail time, but Nat cajoles his son into a cross-country trip through family memories toward New Mexico where an experimental treatment awaits. The trip is not just about the past, but whether either can tell the truth - and then what to do with those truths. From time to time, Flynn calls Maggie to leave messages. And what about Flynn's mother?","simplePlot":"The son of a thrifty conman begrudgingly joins his father on the road.","actors":[{"actorName":"Christopher Walken","urlProfile":"http://www.imdb.com/name/nm0000686","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4ODUyNDQ2NV5BMl5BanBnXkFtZTYwODk2MTYz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1943","placeOfBirth":" Astoria, Queens, New York City, New York, USA","birthName":"Ronald Walken","height":"6' (1.83 m)","bio":"Nervous-looking lead and supporting actor of the American stage and films, with sandy colored hair, pale complexion and a somewhat nervous disposition. He won an Oscar as Best Supporting Actor for his performance in The Deer Hunter (1978), and has been seen in mostly supporting roles, often portraying psychologically unstable characters, though that generalization would not do justice to Walken's depth and breadth of performances. Walken was born in Astoria, Queens, to Rosalie (Russell), a Scottish immigrant, and Paul Walken, a German immigrant who ran Walken's Bakery. He learnt his stage craft, including dancing, at Hofstra University & ANTA, and picked up a Theatre World award for his performance in the revival of the Tennessee Williams play \"The Rose Tattoo\". Walken then first broke through into cinema in 1969 appearing in Me and My Brother (1969), before appearing alongside Sean Connery in the sleeper heist movie The Anderson Tapes (1971). His eclectic work really came to the attention of critics in 1977 with his intense portrayal of Diane Keaton suicidal younger brother in Annie Hall (1977), and then he scooped the Best Supporting Actor Academy Award in 1977 for his role as Nick in the electrifying The Deer Hunter (1978). Walken was lured back by The Deer Hunter (1978) director Michael Cimino for a role in the financially disastrous western Heaven's Gate (1980), before moving onto surprise audiences with his wonderful dance skills in Pennies from Heaven (1981), taking the lead as a school teacher with telepathic abilities in the Stephen King inspired The Dead Zone (1983) and then as billionaire industrialist Max Zorin trying to blow up Silicon Valley in the 007 adventure A View to a Kill (1985). Looking at many of Walken's other captivating screen roles, it is easy to see the diversity of his range and even his droll comedic talents with humorous appearances in Biloxi Blues (1988), Wayne's World 2 (1993), Joe Dirt (2001), Mousehunt (1997) and America's Sweethearts (2001). Most recently, he continued to surprise audiences again with his work as a heart broken and apologetic father to Leonardo DiCaprio in Catch Me If You Can (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4ODUyNDQ2NV5BMl5BanBnXkFtZTYwODk2MTYz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000686","name":"Christopher Walken","nicknames":["Chris","Ronnie"],"idIMDB":"nm0000686"},"actorId":"nm0000686","character":"Nat Parker","urlCharacter":"http://www.imdb.com/character/ch0242186","main":true},{"actorName":"Alessandro Nivola","urlProfile":"http://www.imdb.com/name/nm0005273","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5ODIxNzAzOF5BMl5BanBnXkFtZTcwMzE4NDMyNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1972","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Alessandro Antine Nivola","height":"5' 9\" (1.75 m)","bio":"Alessandro Nivola was born on June 28, 1972 in Boston, Massachusetts, USA as Alessandro Antine Nivola. He is an actor and producer, known for Face/Off (1997), American Hustle (2013) and Jurassic Park III (2001). He has been married to Emily Mortimer since January 3, 2003. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5ODIxNzAzOF5BMl5BanBnXkFtZTcwMzE4NDMyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005273","name":"Alessandro Nivola","nicknames":["Sandro"],"idIMDB":"nm0005273"},"actorId":"nm0005273","character":"Ritchie Flynn Parker","urlCharacter":"http://www.imdb.com/character/ch0257675","main":true},{"actorName":"Sharon Stone","urlProfile":"http://www.imdb.com/name/nm0000232","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDU1ODQwNF5BMl5BanBnXkFtZTcwOTc3MjQwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 March 1958","placeOfBirth":" Meadville, Pennsylvania, USA","birthName":"Sharon Yvonne Stone","height":"5' 8½\" (1.74 m)","bio":"Sharon Yvonne Stone was born and raised in Meadville, a small town in Pennsylvania, to Dorothy Marie (Lawson), an accountant and homemaker, and Joseph William Stone II, a factory worker. Her father was strict. She was the second of four children, and has English, German, Scottish, and Irish ancestry. At the age of 15, she studied in Saegertown High School, Pennsylvania and, at that same age, entered Edinboro State University of Pennsylvania, and graduated with a degree in creative writing and fine arts. She was a very smart girl, became a bookworm, and once was told that a suitable job for her (and her brains) was to become a lawyer. However, her first love was still the black-and-white movies, especially those featuring Fred Astaire and Ginger Rogers. So, the 17-year-old Sharon got herself into the Miss Crawford County and won the beauty contest. From working part-time as a McDonald's counter girl, she worked her way up to become a successful Ford model, both in TV commercials and print ads. In 1980, she made her film debut as an extra in Woody Allen's Stardust Memories (1980). Her first speaking part was in Wes Craven's horror movie, Deadly Blessing (1981). She struggled through many parts in B-movies, such as King Solomon's Mines (1985) and Action Jackson (1988). She was also married in 1984 to Michael Greenburg, the producer of MacGyver (1985), but they divorced two years later. She finally got her big break with a memorable supporting role in the popular Arnold Schwarzenegger movie Total Recall (1990), and also posed nude for Playboy, a daring move for a 32-year-old actress. But it worked; she was cast in the breakthrough role as a sociopath novelist, \"Catherine Tramell\", in Basic Instinct (1992). Her interrogation scene has become a classic in film history and her performance captivated everyone, from MTV viewers, who honored her with Most Desirable Female and Best Female Performance Awards, to a Golden Globe nomination for Best Actress. After she got famous, she didn't want to be typecast, so she played a victim in Sliver (1993), and, in Intersection (1994), she was the aloof, estranged wife of Richard Gere. Then she appeared in more aggressive roles, such as The Specialist (1994) with Sylvester Stallone and Mort ou vif (1995) with Gene Hackman. But it wasn't until she played a beautiful but drug-crazy trophy wife of Robert De Niro in Casino (1995) that she got far more than just fame and fortune--she also received the acknowledgment of the movie industry for her acting ability. She received her first Golden Globe and an Oscar nomination. She did a couple of films released the next year, teaming up with Isabelle Adjani in Diabolique (1996), and as a woman waiting for her death penalty in Last Dance (1996). In 1998, she married a newspaper editor,Phil Bronstein but they divorced later in 2004. She received her third Golden Globe nomination for The Mighty (1998), a film that her company, \"Chaos\", also co-executive produced. The next year, she played the title role in Gloria (1999) and entered her first comedic role in The Muse (1999), which gave her another Golden Globe nomination. Sharon Stone, a diva who thoroughly enjoys her hard-won stardom, is now a mother of three children: Roan, Laird and Quinn.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDU1ODQwNF5BMl5BanBnXkFtZTcwOTc3MjQwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000232","name":"Sharon Stone","idIMDB":"nm0000232"},"actorId":"nm0000232","character":"Dolores Jones","urlCharacter":"http://www.imdb.com/character/ch0109103","main":true},{"actorName":"Dean Cain","urlProfile":"http://www.imdb.com/name/nm0001002","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MzIwNTY3NF5BMl5BanBnXkFtZTgwMTc3MTEwMzE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1966","placeOfBirth":" Mt. Clemens, Michigan, USA","birthName":"Dean George Tanaka","height":"5' 11½\" (1.82 m)","bio":"Dean Cain was born Dean George Tanaka in Mount Clemens, Michigan, to actress Sharon Thomas Cain and Roger Tanaka. His mother married his adoptive father, director Christopher Cain, when Dean was three. Though he grew up in Malibu and attended Santa Monica High School, his career plans favored professional football over acting. While at Princeton, he completed a history major, dated Brooke Shields for two years, and set an NCAA record for interceptions in a season. After signing with the Buffalo Bills, a knee injury ended his pro career before it began. Though he had already played a part in his father's The Stone Boy (1984), he went through the usual route of commercials and tv-parts (notably, Beverly Hills, 90210 (1990) in 1990) before landing his break-through role as Superman/Clark Kent in the series Lois & Clark: The New Adventures of Superman (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MzIwNTY3NF5BMl5BanBnXkFtZTgwMTc3MTEwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001002","name":"Dean Cain","idIMDB":"nm0001002"},"actorId":"nm0001002","character":"Rick Carlson","urlCharacter":"http://www.imdb.com/character/ch0257676","main":true},{"actorName":"Peter Coyote","urlProfile":"http://www.imdb.com/name/nm0001075","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NjYwOTczNF5BMl5BanBnXkFtZTgwMzA3MzgwMjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1941","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Rachmil Pinchus Ben Mosha Cohon","height":"6' 3\" (1.91 m)","bio":"Peter Coyote was born on October 10, 1941 in Manhattan, New York City, New York, USA as Rachmil Pinchus Ben Mosha Cohon. He is an actor, known for E.T. the Extra-Terrestrial (1982), A Walk to Remember (2002) and Sphere (1998). He was previously married to Stefanie Pleet and Marilyn McCann.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NjYwOTczNF5BMl5BanBnXkFtZTgwMzA3MzgwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001075","name":"Peter Coyote","idIMDB":"nm0001075"},"actorId":"nm0001075","character":"Burt Kruger","urlCharacter":"http://www.imdb.com/character/ch0257677","main":true},{"actorName":"Amanda Peet","urlProfile":"http://www.imdb.com/name/nm0001605","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3Nzk0NjgxN15BMl5BanBnXkFtZTcwMzI3NDE1Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1972","placeOfBirth":" New York City, New York, USA","height":"5' 6½\" (1.69 m)","bio":"Amanda Peet was born and raised in New York City. She is the daughter of Penny (Levy), a social worker, and Charles Peet, a lawyer, and has an older sister. Her father was of mostly English and German ancestry, and her mother was from a Jewish family (from Germany, Russia, and Hungary). Peet's great-grandfathers were politician Samuel Levy and showbiz impresario S.L. Rothafel. Peet made an unconventional stage debut at the age of three, when she jumped onto the stage during a play. Yet, despite this early start, she later studied acting more as a hobby than anything else. She studied history at Columbia University, where a drama professor convinced her to audition for acting teacher Uta Hagen, with whom she later went on to study for a four-year period. During this time, she participated in the off-Broadway revival of Clifford Odets's \"Awake and Sing.\" She supported herself during the audition phase of her career by working as a waitress and with the residual checks she received from a Skittles candy commercial. Perseverance and hard work paid off, and, in 1995, she was cast in a guest-starring role on the hit series Law & Order (1990). Her feature film debut came in 1995 with the movie Animal Room (1995). For a while afterward, Amanda continued to find steady work but also found herself appearing in a depressingly large number of indie films that were never picked up for distribution. She did, however, meet her boyfriend Brian Van Holt on the set of indie movie Whipped (2000). Her turn as the ditzy hit-woman with the heart of gold in the hit comedy The Whole Nine Yards (2000), opposite Bruce Willis, took her from supporting role status to leading lady. That same year she was voted one of the 50 Most Beautiful People in the World by \"People\" Magazine.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3Nzk0NjgxN15BMl5BanBnXkFtZTcwMzI3NDE1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001605","name":"Amanda Peet","idIMDB":"nm0001605"},"actorId":"nm0001605","character":"Maggie","urlCharacter":"http://www.imdb.com/character/ch0257678","main":true},{"actorName":"Luis Avalos","urlProfile":"http://www.imdb.com/name/nm0042757","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NzgzOTk0MV5BMl5BanBnXkFtZTYwMTEyMTk0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 September 1946","placeOfBirth":" Havana, Cuba","birthName":"Luis Ávalos","bio":"Luis Avalos was born on September 2, 1946 in Havana, Cuba as Luis Ávalos. He was an actor and director, known for The Electric Company (1971), The Ringer (2005) and Jungle 2 Jungle (1997). He died on January 22, 2014 in Burbank, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NzgzOTk0MV5BMl5BanBnXkFtZTYwMTEyMTk0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0042757","name":"Luis Avalos","idIMDB":"nm0042757"},"actorId":"nm0042757","character":"Martinez","urlCharacter":"http://www.imdb.com/character/ch0257687","main":true},{"actorName":"Beth Bailey","urlProfile":"http://www.imdb.com/name/nm1544010","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyODgxMTEyM15BMl5BanBnXkFtZTYwNTg2MjAz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Beth Bailey is an actress, known for Terminator Salvation (2009), The Lone Ranger (2013) and Independence Day: Resurgence (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyODgxMTEyM15BMl5BanBnXkFtZTYwNTg2MjAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1544010","name":"Beth Bailey","idIMDB":"nm1544010"},"actorId":"nm1544010","character":"Real Estate Lady","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marya Beauvais","urlProfile":"http://www.imdb.com/name/nm1697022","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NDUzMzMxNl5BMl5BanBnXkFtZTcwMTk4Mjk2Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Marya Beauvais is an actress, known for Fright Night (2011), Sunshine Cleaning (2008) and Beerfest (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NDUzMzMxNl5BMl5BanBnXkFtZTcwMTk4Mjk2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1697022","name":"Marya Beauvais","idIMDB":"nm1697022"},"actorId":"nm1697022","character":"Realtor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Bond","urlProfile":"http://www.imdb.com/name/nm1088446","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzUxNTY0NDE2NV5BMl5BanBnXkFtZTgwMjM0NjU0MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Frank Bond is an actor, known for Let Me In (2010), The Guest (2014) and The Spy Next Door (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzUxNTY0NDE2NV5BMl5BanBnXkFtZTgwMjM0NjU0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1088446","name":"Frank Bond","idIMDB":"nm1088446"},"actorId":"nm1088446","character":"Bar Manager","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vic Browder","urlProfile":"http://www.imdb.com/name/nm2002316","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODcyMzQwNjYxMl5BMl5BanBnXkFtZTgwNTA0MDQ5NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Vic Browder is an actor and writer, known for Sicario (2015), Sunshine Cleaning (2008) and Blood Father (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODcyMzQwNjYxMl5BMl5BanBnXkFtZTgwNTA0MDQ5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2002316","name":"Vic Browder","idIMDB":"nm2002316"},"actorId":"nm2002316","character":"Salesman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gregory Chase","urlProfile":"http://www.imdb.com/name/nm0153767","urlPhoto":"","biography":{"bio":"Gregory Chase is an actor, known for All My Children (1970), Guiding Light (1952) and Sabrina (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0153767","name":"Gregory Chase","idIMDB":"nm0153767"},"actorId":"nm0153767","character":"Reporter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Dempsey","urlProfile":"http://www.imdb.com/name/nm0218716","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0NjEyNzU1OV5BMl5BanBnXkFtZTgwMzE2NTI4OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"A veteran of both stage and screen, Christopher was born in Albuquerque, New Mexico and grew up there and in Santa Fe. He has lived throughout the United States and also abroad. He began his acting career at an early age, first setting foot on stage at The Santa Fe Playhouse in the late 1970's. After attending The American Academy of Dramatic Arts West, he spent several years working behind the camera, learning everything he could about the business of production. His experience includes Producer, Director, Assistant Director, Production/Art Designer, Production Coordinator, Property Master, Boom Operator, and of course multiple PA gigs. His passion for acting drew him back in front of the camera and has kept him there ever since. In 2006 he returned to live and work in New Mexico and has appeared in many Film and Television productions including \"Sunshine Cleaning\" and 3 turns on the critically acclaimed AMC series \"Breaking Bad\". Born Christopher Velasquez, he was adopted by his step-father and chose to take his current last name of Dempsey. He has served in the United States Army Reserve as a Combat Medical Specialist and was also a member of the Los Angeles Police Department for almost 5 years. Both provided a wealth of personal and professional experience.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0NjEyNzU1OV5BMl5BanBnXkFtZTgwMzE2NTI4OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0218716","name":"Christopher Dempsey","idIMDB":"nm0218716"},"actorId":"nm0218716","character":"Tim Webber","urlCharacter":"http://www.imdb.com/character/ch0257679","main":true},{"actorName":"Judith Greentree","urlProfile":"http://www.imdb.com/name/nm2809247","urlPhoto":"","biography":{"bio":"Judith Greentree is an actress, known for Together: The Film (2008), $5 a Day (2008) and Turn the River (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2809247","name":"Judith Greentree","idIMDB":"nm2809247"},"actorId":"nm2809247","character":"IHOP Waitress","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Hagen","urlProfile":"http://www.imdb.com/name/nm2474652","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyOTgxMDkwMl5BMl5BanBnXkFtZTgwNjk4OTI2NDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 8\" (1.73 m)","bio":"Christopher Hagen is an actor, known for A Million Ways to Die in the West (2014), The Lone Ranger (2013) and The Burrowers (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyOTgxMDkwMl5BMl5BanBnXkFtZTgwNjk4OTI2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2474652","name":"Christopher Hagen","idIMDB":"nm2474652"},"actorId":"nm2474652","character":"Marty","urlCharacter":"http://www.imdb.com/character/ch0257681","main":true}],"seasons":[],"idIMDB":"tt1024733","urlIMDB":"http://www.imdb.com/title/tt1024733","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"10","month":"09","year":"2007","remarks":null},{"money":null,"country":null,"day":"04","month":"10","year":"2007","remarks":null}],"copyrightHolder":"Five Dollars a Day, LLC. Copyright 2008"},"technical":{"runtime":["1 hr 38 min (98 min) (USA)","1 hr 30 min (90 min) (Toronto International) (Canada)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["FotoKem Laboratory, Burbank (CA), USA (color by) (as Fotokem)","FotoKem Laboratory, Burbank (CA), USA (film & video laboratory) (as Fotokem)"],"filmLength":null,"negativeFormat":["16 mm"],"cinematographicProcess":["Super 16"],"printedFilmFormat":["35 mm (blow-up)"]},"rating":"6.4","filmingLocations":[{"location":"Boardwalk, Atlantic City, New Jersey, USA"}],"rated":"PG-13","awards":[],"votes":"2,759","type":"Movie","companyCreditsSimple":[{"idCompany":"co0060324","name":"Capitol Films"},{"idCompany":"co0203328","name":"Aramid Entertainment Fund"},{"idCompany":"co0058685","name":"Carol Baum Productions"}],"keywords":{"keywords":["hustler","health inspector","bare butt","bare ass","skinny dipping","male rear nudity","male buttocks","male bare butt","anger","crying","hospital","male in underwear","male underwear","man wearing a bathrobe","man wearing a robe","men urinating together","males talking about sex","seduction","woman seduces a man","woman in lingerie","female in lingerie","black lingerie","bare chested male","flirting","beer","glow in the dark","condom","talking about sex","sex talk","impotent","impotence","male impotence","bikini","woman in a bikini","man urinating","man wearing boxer shorts","alias","carnival game","deadbeat dad","con artist","dancing","fired","erectile dysfunction","campaign party","death of a parent","blackmail","cadillac dealership","chrysler pt cruiser","four word title","ihop","pink","car wrapper","travelogue","hairy chest","punctuation in title","daquiri","free stuff","above ground pool","decal","barbie","sweet'n low","smoking","wrongful conviction","tumor","squatting","sleeping in a car","sinking boat","scam","sabotage","road trip","regret","reference to steve mcqueen","reconciliation effort","product placement","polaroid","pink car","party crashing","mayoral candidate","los angeles california","leather jacket","inheritance","impersonating a waiter","hotel","honesty","haircut","grifter","gambling winnings","free meal","fraud","former babysitter","father son reunion","father son relationship","father son reconciliation","fake driver's license","extortion","ex con","estranged father","dying father","con man","car dealer","boyfriend girlfriend relationship","birthday wish","betrayal","atlantic city new jersey","amusement park","albuquerque new mexico","absent mother","dollar sign in title","digit in title","money in title","independent film","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:42:32"}}