{"data":{"movies":[{"title":"The Legend of Awesomest Maximus","originalTitle":"","year":"2011","releaseDate":"20110805","directors":[{"name":"Jeff Kanew","id":"nm0437596"}],"writers":[{"name":"Jason Burinescu","id":"nm2699721"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTA4NTc4OV5BMl5BanBnXkFtZTcwNTQ2OTYxNw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Comedy"],"plot":"From the director of Revenge of the Nerds comes this outrageous sword and sandals spoof! Horny King Looney of Troy sends slacker general Awesomest Maximus to maintain peace with rival King Erotic of Greece. But when Prince Orlando, who's more into fashion than fighting, steals the King's wife Ellen to be his BFF, it's war!","simplePlot":"From the director of Revenge of the Nerds comes this outrageous sword and sandals spoof! Horny King Looney of Troy sends slacker general Awesomest Maximus to maintain peace with rival King ... ","actors":[{"actorName":"Will Sasso","urlProfile":"http://www.imdb.com/name/nm0766005","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5ODk3MDk1OF5BMl5BanBnXkFtZTYwMjYxMzky._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1975","placeOfBirth":" Ladner, British Columbia, Canada","birthName":"William Sasso","height":"6' 3½\" (1.92 m)","bio":"Will Sasso was born in Ladner, British Columbia (a suburb of Vancouver), to a family of Italian descent. He grew up respecting comedy of all styles, thanks in part to an unhealthy relationship with the family television that began when Will was around two or three. With his mind consequently bent, Sasso decided at an early age to become an actor. At the age of fifteen, he landed his first agent and quickly began booking roles in television and film. Before moving from Vancouver to Los Angeles, Sasso starred for five seasons as the quirky teen, \"Derek Wakaluk\" on the award-winning Canadian dramatic series Madison (1993) allowing him to hone his acting and improvisational skills as well as providing him with enough money to buy a television of his own. Will starred for five seasons on FOX's hit sketch comedy series MADtv (1995) giving TV viewers a reason to stay up late with characters like the accident-prone handyman \"Paul Timberman\" and offbeat impressions of Bill Clinton, Kenny Rogers, Arnold Schwarzenegger, Steven Seagal and Randy Newman. After a successful tenure with the show beginning in 1997, Sasso decided to leave the late-night staple in 2002, eager to explore the next stage of his career. Moviegoers know Sasso from his roles in more than twenty-five feature films including Best in Show (2000), directed by Christopher Guest, Belles à mourir (1999), Beverly Hills Ninja (1997) starring the late Chris Farley, and The Hot Chick (2002) starring Rob Schneider and produced by Adam Sandler, with whom Sasso previously worked on Happy Gilmore (1996). More recently, Sasso can be seen every week as \"Carl Monari\" on the ABC sitcom Less Than Perfect (2002). In his spare time, Sasso enjoys the outdoors and the indoors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5ODk3MDk1OF5BMl5BanBnXkFtZTYwMjYxMzky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0766005","name":"Will Sasso","idIMDB":"nm0766005"},"actorId":"nm0766005","character":"Awesomest Maximus","urlCharacter":"http://www.imdb.com/character/ch0125253","main":true},{"actorName":"Kristanna Loken","urlProfile":"http://www.imdb.com/name/nm0518085","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NjE2NzUzMF5BMl5BanBnXkFtZTcwMTUxNDU2MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 October 1979","placeOfBirth":" Ghent, New York, USA","birthName":"Kristanna Sommer Løken","height":"5' 10¾\" (1.8 m)","bio":"Kristanna Sommer Loken was born in Ghent, New York, to Rande (Porath) and Merlin \"Chris\" Loken. She is of half Norwegian and half German descent. She began her modeling career at the early age of 15. Encouraged by her mother, who was a model prior to her daughter's birth, Kristanna's modeling career, as well as her aspirations in acting brought her to New York where she now resides. The glamorous actress/ model seems to have stayed true to her roots: her father owns an apple farm in upstate New York where he writes novels and screenplays. Aside from establishing herself as a supermodel with an Elite contract, Kristanna has made numerous television appearances as well as what could be her breakthrough film role in Terminator 3: Rise of the Machines (2003) opposite Arnold Schwarzenegger, released in 2003.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NjE2NzUzMF5BMl5BanBnXkFtZTcwMTUxNDU2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0518085","name":"Kristanna Loken","idIMDB":"nm0518085"},"actorId":"nm0518085","character":"Hottessa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sophie Monk","urlProfile":"http://www.imdb.com/name/nm0598241","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNTAxMzQ4MV5BMl5BanBnXkFtZTYwMzU3MTgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1979","placeOfBirth":" England, UK","birthName":"Sophie Charlene Akland Monk","height":"5' 6\" (1.68 m)","bio":"Sophie Monk was born on December 14, 1979 in England as Sophie Charlene Akland Monk. She is an actress, known for Click (2006), Date Movie (2006) and The Hills Run Red (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNTAxMzQ4MV5BMl5BanBnXkFtZTYwMzU3MTgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0598241","name":"Sophie Monk","idIMDB":"nm0598241"},"actorId":"nm0598241","character":"Princess Ellen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Khary Payton","urlProfile":"http://www.imdb.com/name/nm1146051","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNzA4ODA3NV5BMl5BanBnXkFtZTgwMjgyMjQyMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1972","placeOfBirth":" Augusta, Georgia, USA","height":"5' 10\" (1.78 m)","bio":"Khary Payton was born on May 16, 1972 in Augusta, Georgia, USA. He is an actor, known for The Walking Dead (2010), Teen Titans Go! (2013) and Astronaut: The Last Push (2012). He is married to Stacy Reed Payton. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNzA4ODA3NV5BMl5BanBnXkFtZTgwMjgyMjQyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1146051","name":"Khary Payton","idIMDB":"nm1146051"},"actorId":"nm1146051","character":"King Erotic","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ian Ziering","urlProfile":"http://www.imdb.com/name/nm0005575","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNjQ4NDU4MV5BMl5BanBnXkFtZTgwODQyNDExOTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1964","placeOfBirth":" Newark, New Jersey, USA","birthName":"Ian Andrew Ziering","height":"6' (1.83 m)","bio":"Ian Ziering was born on March 30, 1964, and was raised in West Orange, New Jersey, a suburb of New York City. By the mid-1970s, young Ian was landing spots in national commercials at the age of 12, which led to roles in various soap operas and stage plays, most notably Guiding Light, the Broadway production of I Remember Mama and, in a national touring production of Peter Pan. In 1981 he made his feature film debut in Endless Love (as Brooke Shields' little brother) - a film that also marked the big-screen debuts of Tom Cruise and James Spader. However, in 1990, Ziering landed the role that would change his life - \"Steve Sanders\" on the teen drama, Beverly Hills 90210. The show brought instant, worldwide fame to the cast. Ian was suddenly an international heartthrob and played the role for the show's entire ten-year run. During his years on 90210 he was also featured in various films and television shows, including Russell Crowe's No Way Back, What I Like About You and Melrose Place, to name a few. Since 90210, Ziering has appeared on numerous television shows including CSI: NY, JAG and Fran Drescher's Happily Divorced. In addition, he has continued to be one of the most in-demand actors for various animated films and television shows including Spider-Man, Mighty Ducks, Batman Beyond and Biker Mice from Mars. In 2005, in a real change of pace from his normal acting roles, Ziering also appeared in the Tony Scott feature film thriller, Domino, with Keira Knightley. Other film credits include National Lampoon's The Legend of Awesomest Maximus, That's My Boy with Adam Sandler, An American Girl: McKenna Shoots for the Stars with Nia Vardalos, Snake and Mongoose, and, Christmas In Palm Springs. In 2007, Ziering showed the world that he was a true triple threat when he signed on to the fourth season of the hit ABC series, Dancing with the Stars. A fan and judge favorite with his partner, two-time Mirror Ball Champion Cheryl Burke, the pair eventually danced their way into the show's semifinals. In addition to his ongoing acting roles and voiceover work, Ian is a much sought-after television host and, was most recently seen hosting HGTV's A-List Pets. 2013 proved to be a pivotal year for Ziering both professionally and personally. At the age of 49, Ian became a Las Vegas headliner when he starred as the celebrity guest host of the award-winning production of Chippendales at the Rio All-Suite Hotel and Casino. Taking on this new role, the actor hit the gym and dropped 30 pounds, transforming himself into a fit and muscled man, thrilling the sold-out audiences. His Chippendales engagement brought him a new wave of fans and international acclaim, thrusting him once again into the limelight. The engagement was such a huge success, establishing Ian as a major Las Vegas box-office draw, he was asked to return to the show in Summer 2014 for another sold-out run at the Rio with the world-famous brand. However, it was during his final week with the Chippendales in 2013 that Ian's small-budget film Sharknado aired on the SyFy Channel and instantly became a social media and worldwide phenomenon. Garnering more than 5,000 tweets per minute during its initial broadcast - more than any other television show to date - Sharknado became an instant science fiction, cult classic and, even received a theatrical release in movie theatres around the world due to its popularity with fans. The franchise exploded so much that in July 2014 Ian reprised his role as Fin Shepard in SyFy's Sharknado 2: The Second One, and the film went on to devour the world and become an even bigger pop culture phenomenon than the first. The record-setting sequel had nearly 4 million viewers in its first broadcast and went on to claim the title as the \"most social movie on TV ever\" by garnering one billion (that is NOT a typo) twitter impressions. At one point, Sharknado 2 held all top 10 trending topics in the United States with more mentions on Twitter than #MileyCyrus on the day of MTV's 2013 VMAs, and #kimye on Kim and Kanye's wedding day. Sharknado 3: Oh Hell No! stormed the world in July 2015 and chomped its way to over 2 billion twitter impressions - doubling those of Sharknado 2. Generating more Twitter activity than every episode of the final season of Mad Men, every episode of last season's The Bachelor and Hillary Clinton's presidential announcement, Sharknado 3 trended #1 in the United States and #2 worldwide. The latest film in the hit franchise, Sharknado 4: The Fourth Awakens, debuts on July 31, 2016 on SyFy. A true philanthropist, Ian used his brains, brawn (and his heart) when he competed on NBC's 7h season of the hit series, Celebrity Apprentice. Along with his other contestants, Ian endured challenging tasks that tested his ability to work with his colleagues while ultimately raising over $320,000 for the EB Medical Research Foundation (www.ebkids.org). Ian is proud to be the fourth highest celebrity fundraiser in the history of Celebrity Apprentice. Inspired by his entrepreneurial tasks during Celebrity Apprentice, Ian has created a new clothing line, Chainsaw Brands (ChainsawBrands.com), featuring classic American style athleisure and apparel. In keeping with his philanthropic nature, a portion of all proceeds from the sale of his signature line will benefit those less fortunate. In addition, in February 2016, Ian launched CelebrityHideaways.com, a luxury destination based website for the discerning traveler looking for unique experiences typically frequented by the rich and famous. His extensive travel over the last 30 years lends itself to revealing the less beaten path for site visitors to browse, get information, and book their perfect vacation. And, it's not just his professional career that is soaring. Ian's personal life has seen some wonderful changes as well over the last few years. He and his wife, nurse Erin Ziering, welcomed their second daughter, Penna Mae in 2013. Their first daughter, Mia Loren, was born on the same day, two years earlier. The quintessential father and family man, Ian was named DaddyScrubs \"Daddy of the Year 2013,\" an award which recognizes fathers who are extremely proactive in raising their children. In June 2016, Ian and his wife launched the family blog, AtHomeWithTheZierings.com, a creative resource for other families. Ian currently resides in Los Angeles with his wife and daughters. Follow Ian on Twitter and Instagram @IanZiering.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNjQ4NDU4MV5BMl5BanBnXkFtZTgwODQyNDExOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005575","name":"Ian Ziering","idIMDB":"nm0005575"},"actorId":"nm0005575","character":"Testiclees","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Lundy","urlProfile":"http://www.imdb.com/name/nm0973446","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MzgwNDU3NV5BMl5BanBnXkFtZTgwNTU5NjIwNzE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"December1981","placeOfBirth":" Los Angeles, California, USA","height":"5' 10\" (1.78 m)","bio":"Gary Lundy was born in December 1981 in Los Angeles, California, USA. He is an actor and writer, known for Donnie Darko (2001), Senior Skip Day (2008) and Burning Annie (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MzgwNDU3NV5BMl5BanBnXkFtZTgwNTU5NjIwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0973446","name":"Gary Lundy","idIMDB":"nm0973446"},"actorId":"nm0973446","character":"Orlando","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rip Torn","urlProfile":"http://www.imdb.com/name/nm0001800","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMTI5MTA5MV5BMl5BanBnXkFtZTYwMDE2Mjk2._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 February 1931","placeOfBirth":" Temple, Texas, USA","birthName":"Elmore Rual Torn Jr.","height":"5' 10\" (1.78 m)","bio":"Rip Torn was born Elmore Rual Torn, Jr. on February 6, 1931 in Temple, Texas. \"Rip\" is a family name, taken by generations of Torn men and bestowed on Elmore by his father, who was also called \"Rip\". Torn attended Texas A & M and the University of Texas, where he majored in animal husbandry. Extremely naïf when he was young, Torn hitchhiked to Hollywood with the idea of becoming a movie star; he wanted to make enough money in order to buy a ranch. Success did not come overnight, as he had hoped, and Torn had to work many odd jobs while occasionally being cast in television roles. He made his feature film debut in Elia Kazan's Baby Doll (1956) in a small part. Serious about learning his craft, he moved to New York City where he studied under Lee Strasberg at the Actors Studio. Torn also studied dance with Martha Graham. His serious acting career began on the small screen, where he made a name for himself in the Golden Age of Television; between 1957 and 1960, he appeared regularly on such prestigious live shows as Omnibus (1952) and Playhouse 90 (1956). Torn made his Broadway debut in Kazan's staging of Tennessee Williams' \"Sweet Bird of Youth\" on March 10, 1959, in support of Paul Newman, Sidney Blackmer and Geraldine Page, who would become his second wife. The play was a hit, closing on January 30, 1960 after 375 performances. He won a 1960 Tony Award nomination as Best Featured Actor in a Play and a Theater World award for his role as \"Tom, Jr.\", a role he recreated in the 1962 film. (Torn also starred as \"Boss Finley\" in a later television adaptation of the play). Torn earned a reputation as an actor's actor on stage, both Broadway and off-Broadway, as well as on screen. He continues to work in the New York theater despite his demanding TV and movie schedule as both an actor and director. He has won two Obie awards for his work off-Broadway, for Distinguished Performance in Norman Mailer's \"The Deer Park\" (for the 1966-1967 season), and for Distinguished Direction for \"The Beard\" (1967-1968). He has his own stage company, and directed his daughter Angelica Page(by Geraldine Page) in John Paul Alexander's \"Strangers in the Land of Canaan\" at the Actors Studio. Torn made his feature film directorial debut with The Telephone (1988). He has constantly been in demand as a character actor, in supporting, second lead and occasional lead roles. His best performance on film came in Payday (1973), and he was nominated for a best supporting actor Oscar for Cross Creek (1983). Most of Torn's roles have been in drama, though he is adept in comedy. His role in Albert Brooks' comedy Defending Your Life (1991) led to his being cast in The Larry Sanders Show (1992), on which he played talk show producer \"Artie\". Torn won six consecutive Emmy nominations for the role, winning once for Best Supporting Actor in a comedy series in 1996. Rip Torn was married to actress Ann Wedgeworth from 1956 to 1961, whom he divorced to marry Geraldine Page. They remained married until her death in 1987. Torn helped his cousin, Oscar-winner Sissy Spacek, to make her way as an actress, seeing to it that she was accepted by the Lee Strasberg's Actors Studio and then the Lee Strasberg Institute.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMTI5MTA5MV5BMl5BanBnXkFtZTYwMDE2Mjk2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001800","name":"Rip Torn","idIMDB":"nm0001800"},"actorId":"nm0001800","character":"King Looney","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Cox","urlProfile":"http://www.imdb.com/name/nm0185272","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MzY5NTM5MF5BMl5BanBnXkFtZTYwMzc5MjA0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1958","placeOfBirth":" Uniontown, Alabama, USA","height":"3' 6\" (1.07 m)","bio":"Tony Cox was born on March 31, 1958 in Uniontown, Alabama, USA. He is known for his work on Bad Santa (2003), Oz the Great and Powerful (2013) and Star Wars: Episode VI - Return of the Jedi (1983). He has been married to Otelia since 1989. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MzY5NTM5MF5BMl5BanBnXkFtZTYwMzc5MjA0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0185272","name":"Tony Cox","idIMDB":"nm0185272"},"actorId":"nm0185272","character":"Minoritees","urlCharacter":"http://www.imdb.com/character/ch0352870","main":true},{"actorName":"Tiffany Claus","urlProfile":"http://www.imdb.com/name/nm2740999","urlPhoto":"","biography":{"birthName":"Tiffany Dawn Claus","height":"5' 7\" (1.7 m)","bio":"Tiffany Claus was born as Tiffany Dawn Claus. She is an actress, known for Meet the Spartans (2008), The Legend of Awesomest Maximus (2011) and Bamboo Shark (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2740999","name":"Tiffany Claus","idIMDB":"nm2740999"},"actorId":"nm2740999","character":"Milfia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Deon Richmond","urlProfile":"http://www.imdb.com/name/nm0725091","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MTQ3NDMzNl5BMl5BanBnXkFtZTYwMDYzNTc3._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 April 1978","placeOfBirth":" New York City, New York, USA","height":"5' 9\" (1.75 m)","bio":"Deon Richmond was born on April 2, 1978 in New York City, New York, USA. He is an actor and producer, known for Van Wilder: Party Liaison (2002), Not Another Teen Movie (2001) and Hatchet (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MTQ3NDMzNl5BMl5BanBnXkFtZTYwMDYzNTc3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0725091","name":"Deon Richmond","idIMDB":"nm0725091"},"actorId":"nm0725091","character":"Jamal","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin Linehan","urlProfile":"http://www.imdb.com/name/nm2599561","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyMjkzODk2NjBeQTJeQWpwZ15BbWU3MDU1NTg1Mzg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Kevin Linehan is an actor, known for The Escort (2016), Nesting (2012) and The Legend of Awesomest Maximus (2011). He has been married to Kathlene Kiernan Linehan since October 28, 2006.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyMjkzODk2NjBeQTJeQWpwZ15BbWU3MDU1NTg1Mzg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2599561","name":"Kevin Linehan","idIMDB":"nm2599561"},"actorId":"nm2599561","character":"Quantas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eddie Pepitone","urlProfile":"http://www.imdb.com/name/nm0672539","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNTIyNzIxNV5BMl5BanBnXkFtZTgwODA1NTM2NzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1958","placeOfBirth":" Staten Island, New York, USA","height":"5' 8\" (1.73 m)","bio":"Eddie Pepitone was born on November 5, 1958 in Staten Island, New York, USA. He is an actor and writer, known for The Muppets (2011), Old School (2003) and Terri (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNTIyNzIxNV5BMl5BanBnXkFtZTgwODA1NTM2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0672539","name":"Eddie Pepitone","idIMDB":"nm0672539"},"actorId":"nm0672539","character":"Approximo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nelson Frazier Jr.","urlProfile":"http://www.imdb.com/name/nm0292551","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAxYTA4NTktMzE3ZS00MmFkLTllNTItOTg2YTQ4NWVhNGUyXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1971","placeOfBirth":" Goldsboro, North Carolina, USA","birthName":"Nelson Lee Frazier Jr.","height":"6' 6½\" (1.99 m)","bio":"Nelson Frazier Jr. was born on February 14, 1971 in Goldsboro, North Carolina, USA as Nelson Lee Frazier Jr. He was an actor, known for WWE Sunday Night Heat (1998), E.C.W. (2006) and Wrong Side of Town (2010). He was married to Cassandra. He died on February 18, 2014 in Memphis, Tennessee, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAxYTA4NTktMzE3ZS00MmFkLTllNTItOTg2YTQ4NWVhNGUyXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0292551","name":"Nelson Frazier Jr.","nicknames":["Viscera","Mabel","Nelson Knight","Big Vis","The World's Largest Love Machine"],"idIMDB":"nm0292551"},"actorId":"nm0292551","character":"Ginormous","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nathalie Walker","urlProfile":"http://www.imdb.com/name/nm2219627","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMzk2OTAwN15BMl5BanBnXkFtZTcwMDI4MTMzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 December 1979","placeOfBirth":" France","birthName":"Nathalie Twaddle","height":"5' 7\" (1.7 m)","bio":"Nathalie Walker was born on December 5, 1979 in France as Nathalie Twaddle. She is an actress, known for Towelhead (2007), College (2008) and Beer League (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMzk2OTAwN15BMl5BanBnXkFtZTcwMDI4MTMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2219627","name":"Nathalie Walker","idIMDB":"nm2219627"},"actorId":"nm2219627","character":"Oracle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adam Devine","urlProfile":"http://www.imdb.com/name/nm2796745","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MzI2NTc5NF5BMl5BanBnXkFtZTgwMzkzNTY4NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 November 1983","placeOfBirth":" Waterloo, Iowa, USA","birthName":"Adam Patrick DeVine","height":"5' 8\" (1.73 m)","bio":"Adam Devine was born on November 7, 1983 in Waterloo, Iowa, USA as Adam Patrick DeVine. He is an actor and writer, known for Mike and Dave Need Wedding Dates (2016), The Intern (2015) and Pitch Perfect 2 (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MzI2NTc5NF5BMl5BanBnXkFtZTgwMzkzNTY4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2796745","name":"Adam Devine","idIMDB":"nm2796745"},"actorId":"nm2796745","character":"Ephor 1","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1059887","urlIMDB":"http://www.imdb.com/title/tt1059887","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"07","month":"08","year":"2008","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm (Fuji Eterna 250D 8563)"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"4.2","filmingLocations":[{"location":"Antelope Island, Great Salt Lake, Utah, USA"}],"rated":"R","awards":[],"votes":"2,538","type":"Movie","companyCreditsSimple":[{"idCompany":"co0184093","name":"National Lampoon Productions"},{"idCompany":"co0194807","name":"Farah Films & Management"},{"idCompany":"co0094550","name":"Vision Entertainment"}],"keywords":{"keywords":["troy","general","spoof","sword and sandal","sex comedy","greek mythology","mother son incest","incest","marijuana","gladiator","voice over narration","dildo","slow motion","adultery","greek","trojan war","cross dressing","trojan","homophobic slur","homoerotic","homosexual subtext","lesbian kiss","bloopers during credits","absurd humor","female nudity","national lampoon series","spartan","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:17:00"}}