{"data":{"movies":[{"title":"Couples Retreat","originalTitle":"","year":"2009","releaseDate":"20091009","directors":[{"name":"Peter Billingsley","id":"nm0082526"}],"writers":[{"name":"Jon Favreau","id":"nm0269463"},{"name":"Vince Vaughn","id":"nm0000681"}],"runtime":"113 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMjI1Nzc0M15BMl5BanBnXkFtZTcwMTc0Mzg2Mg@@._V1.jpg","countries":["USA"],"languages":["English","Ukrainian"],"genres":["Comedy"],"plot":"Dave and Ronnie, Jason and Cynthia, and Joey and Lucy are close. The group used to include Shane and Jennifer, but they divorced and she's gone. Jason and Cynthia announce that their marriage is in trouble, and they beg their friends (and Shane's young girlfriend) to join them on a couples' retreat, at the package rate, on a tropical island. The others reluctantly agree, planning to play while Jason and Cynthia work on their marriage with an island psychologist. To everyone's surprise, the package is inflexible: each couple must participate in the couples' exercises. Soon fault lines appear in all four relationships. What's in store for each couple?","simplePlot":"A comedy centered around four couples who settle into a tropical-island resort for a vacation. While one of the couples is there to work on the marriage, the others fail to realize that participation in the resort's therapy sessions is not optional.","actors":[{"actorName":"Vince Vaughn","urlProfile":"http://www.imdb.com/name/nm0000681","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MDA0MzE0MF5BMl5BanBnXkFtZTYwOTUzOTI4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 March 1970","placeOfBirth":" Minneapolis, Minnesota, USA","birthName":"Vincent Anthony Vaughn","height":"6' 5\" (1.96 m)","bio":"Vincent Anthony Vaughn was born on March 28, 1970, in Minneapolis, Minnesota, USA, and was raised in Lake Forest, Illinois. His parents are Vernon Vaughn, a salesman and character actor, and Sharon Vaughn (née Sharon Eileen DePalmo), a real-estate agent and stockbroker. They divorced in 1991. He has two older sisters, Victoria Vaughn and Valeri Vaughn. His recent ancestry includes Lebanese (from his paternal grandmother), Italian (from his maternal grandfather), English, Irish, German, and Scottish. His mother was born in Brantford, Ontario. Vince was interested in theater early on and grabbed a spot in a Chevy commercial. In 1988 he moved to Hollywood. He managed to hit a few spots on television, but his real goal was to make it to the big screen. He made his first credited role in the film Rudy (1993) where he met his friend Jon Favreau, who was writing a script detailing his life as an out-of-work actor. Vince was written into Swingers (1996) by Jon to play the character of \"Trent\". He signed on just as a favor to his buddy, not realizing it would be a career changing role. Though not a commercial success, it was a critical success in which Steven Spielberg saw him and cast him in the big budget sequel The Lost World: Jurassic Park (1997). This role gave Vince the exposure he needed to become a movie star and, for the first time, choose the roles he wanted to take. A Cool, Dry Place (1998) put him as a loving father, Return to Paradise (1998) cast him as a man having to make a life or death decision to save a friend, and Clay Pigeons (1998) cast him as an interesting serial killer. Since then his roles have been primarily in comedies such as Old School (2003), Dodgeball: A True Underdog Story (2004), Wedding Crashers (2005), and Couples Retreat (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MDA0MzE0MF5BMl5BanBnXkFtZTYwOTUzOTI4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000681","name":"Vince Vaughn","nicknames":["Mr Sunshine"],"idIMDB":"nm0000681"},"actorId":"nm0000681","character":"Dave","urlCharacter":"http://www.imdb.com/character/ch0162895","main":true},{"actorName":"Jason Bateman","urlProfile":"http://www.imdb.com/name/nm0000867","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwOTQ0MDUyNF5BMl5BanBnXkFtZTcwNTQ1MzY1Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1969","placeOfBirth":" Rye, New York, USA","birthName":"Jason Kent Bateman","height":"5' 11\" (1.8 m)","bio":"Jason Bateman is an American film and television actor best known for his role as Michael Bluth on the television sitcom Arrested Development (2003), as well as his role on Valerie (1986). He was born in Rye, New York, USA. His father, Kent Bateman, from a Utah-based family, is a film and television director, and founder of a Hollywood repertory stage company. His mother, Victoria Bateman, was born in England and worked as a flight attendant. His sister is actress Justine Bateman. In 1981, at the age of 12, young Bateman made his debut on television as James Cooper Ingalls in Little House on the Prairie (1974): Uncle Jed, appearing in 18 more episodes in one season. Jason also appeared in the original Knight Rider with David Hasselhoff for the season 3 episode \"Lost Knight\" (aired Dec 1984) playing the character \"Doug\" who befriends Kitt when he loses his memory. In the mid-1980s, he became the DGA's youngest-ever director when he directed three episodes of Valerie (1986) at age 18. During the 2000s, Bateman's film career has been on soaring trajectory. In 2005, he won the Golden Globe Award for Best Performance by an Actor in a Television Series, Musical or Comedy, for Arrested Development (2003), and received other awards and nominations. Bateman has been enjoying a happy family life with his wife, actress Amanda Anka (daughter of singer Paul Anka). Their first child, Francesca Nora Bateman, was born in Los Angeles on October 28, 2006. The Batemans reside in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwOTQ0MDUyNF5BMl5BanBnXkFtZTcwNTQ1MzY1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000867","name":"Jason Bateman","idIMDB":"nm0000867"},"actorId":"nm0000867","character":"Jason Smith","urlCharacter":"http://www.imdb.com/character/ch0154830","main":true},{"actorName":"Faizon Love","urlProfile":"http://www.imdb.com/name/nm0522324","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODkwNzE2NjM5MF5BMl5BanBnXkFtZTYwNDE5MDcy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 June 1968","placeOfBirth":" Santiago de Cuba, Cuba","birthName":"Langston Faizon Santisima","height":"5' 10\" (1.78 m)","bio":"Faizon Love was born on June 14, 1968 in Santiago de Cuba, Cuba as Langston Faizon Santisima. He is an actor and writer, known for Couples Retreat (2009), Elf (2003) and Grand Theft Auto: San Andreas (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODkwNzE2NjM5MF5BMl5BanBnXkFtZTYwNDE5MDcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0522324","name":"Faizon Love","idIMDB":"nm0522324"},"actorId":"nm0522324","character":"Shane","urlCharacter":"http://www.imdb.com/character/ch0162897","main":true},{"actorName":"Jon Favreau","urlProfile":"http://www.imdb.com/name/nm0269463","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzgwNDg0MTI1MF5BMl5BanBnXkFtZTcwNzg0MDQzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 October 1966","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Jonathan Kolia Favreau","height":"6' 1\" (1.85 m)","bio":"Initially an indie film favorite, actor Jon Favreau has progressed to strong mainstream visibility into the millennium and, after nearly two decades in the business, is still enjoying character stardom as well as earning notice as a writer/producer/director. The amiable, husky-framed actor with the tight, crinkly hair was born in Queens, New York on October 19, 1966, the only child of Madeleine, an elementary school teacher, and Charles Favreau, a special education teacher. His father has French-Canadian, German, and Italian ancestry, and his mother was from a Jewish family. He attended the Bronx High School of Science before furthering his studies at Queens College in 1984. Dropping out just credits away from receiving his degree, Jon moved to Chicago where he focused on comedy and performed at several Chicago improvisational theaters, including the ImprovOlympic and the Improv Institute. He also found a couple of bit parts in films. While there, he earned another bit role in the film, Rudy (1993), and met fellow castmate Vince Vaughn. Their enduring personal friendship would play an instrumental role in furthering both their professional careers within just a few years. Jon broke into TV with a role on the classic series, Seinfeld (1989) (as \"Eric the Clown\"). After filming rudimentary roles in the movies Mrs. Parker and the Vicious Circle (1994), Notes from Underground (1995) and Batman Forever (1995), he decided to do some risk taking by writing himself and friend Vaughn into what would become their breakthrough film. Swingers (1996), which he also co-produced, centers on Jon as a luckless, struggling actor type who is emotionally shattered after losing his girlfriend, but is pushed back into the L.A. social scene via the help of cool, worldly, outgoing actor/buddy Vaughn. These two blueprint roles went on to define the character types of both actors on film. In 1997, Jon appeared favorably on several episodes of the popular TV sitcom, Friends (1994), as \"Pete Becker\", the humdrum but extremely wealthy suitor for Courteney Cox's \"Monica\" character, and also appeared to fine advantage on the Tracey Takes On... (1996) comedy series. He later took on the biopic mini-movie, Rocky Marciano (1999), portraying the prizefighter himself in a highly challenging dramatic role and received excellent reviews. Other engagingly offbeat \"everyman\" films roles came Jon's way -- the ex-athlete in the working class film, Dogtown (1997); a soon-to-be groom whose bachelor party goes horribly awry in the comedy thriller Very Bad Things (1998); a newlywed opposite Famke Janssen in Love & Sex (2000); a wild and crazy linebacker in The Replacements (2000); as Ben Affleck's legal partner in Daredevil (2003); and another down-and-out actor in The Big Empty (2003). He wrote and directed himself and Vaughn as two fellow boxers who involve themselves in criminal activity in Made (2001). Both he and Vaughn produced. He also directed the highly popular Will Ferrell comedy, Elf (2003), in which he had a small part. Jon went on to re-team favorably with his friend, Vince Vaughn, who enjoyed a meteoric rise into the comedy star ranks, in such light-weight features as The Break-Up (2006), Tout... sauf en famille (2008) and Couples Retreat (2009), the last of which he co-wrote with Vaughn. He also made great strides as a producer/director in recent years with the exciting mega-box office action-packed Iron Man (2008), starring Robert Downey Jr. and its sequel, Iron Man 2 (2010). Favreau's marriage to Joya Tillem on November 24, 2000, produced son Max and two daughters, Madeleine and Brighton Rose. Joya is the niece of KGO (AM) lawyer and talk show host, Len Tillem. On the sly, the actor/writer/producer/director enjoys playing on the World Poker Tour.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzgwNDg0MTI1MF5BMl5BanBnXkFtZTcwNzg0MDQzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0269463","name":"Jon Favreau","nicknames":["Favs"],"idIMDB":"nm0269463"},"actorId":"nm0269463","character":"Joey","urlCharacter":"http://www.imdb.com/character/ch0162898","main":true},{"actorName":"Malin Akerman","urlProfile":"http://www.imdb.com/name/nm0015196","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4ODAwMjIwOV5BMl5BanBnXkFtZTcwMzI2NDA2OA@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1978","placeOfBirth":" Stockholm, Stockholms län, Sweden","birthName":"Malin Maria Åkerman","height":"5' 8\" (1.73 m)","bio":"Malin was born in Stockholm, Sweden and raised in Toronto, Canada. Her mother, Pia (Sundström), is a model and aerobics instructor, and her father, Magnus Åkerman, is an insurance broker. They moved to Toronto when she was age 2. At age 5, she began appearing in TV commercials. Her parents divorced when she was 6 and her father returned to Sweden. At age 17, she won the Canadian title of Ford Supermodel. This enabled her to spend 3 years as a catwalk model in Europe. She decided to become a child psychologist and enrolled in York University but she was offered a guest role in Invasion planète Terre (1997) so she turned her attention back to acting. She moved to Los Angeles in 2001 and won roles in both TV and film. Her breakthrough role came when she was cast as Silk Spectre II in Watchmen (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4ODAwMjIwOV5BMl5BanBnXkFtZTcwMzI2NDA2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0015196","name":"Malin Akerman","idIMDB":"nm0015196"},"actorId":"nm0015196","character":"Ronnie","urlCharacter":"http://www.imdb.com/character/ch0162899","main":true},{"actorName":"Kristen Bell","urlProfile":"http://www.imdb.com/name/nm0068338","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MjkzOTIxMV5BMl5BanBnXkFtZTgwNzM3MTkzMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1980","placeOfBirth":" Huntington Woods, Michigan, USA","birthName":"Kristen Anne Bell","height":"5' 1\" (1.55 m)","bio":"Kristen Anne Bell (born 1980) is an American actress and singer. She was born and raised in Huntington Woods, Michigan, and is the daughter of Lorelei (Frygier), a nurse, and Tom Bell, a television news director. Her ancestry is Polish (mother) and German, English, Irish, and Scottish (father). Kristen found her talent in entertainment at an early age. In 1992, she went to her first audition and won a role in Raggedy Ann and Andy. Bell's mother established her with an agent before she was 13, and she was cast in newspaper advertisements and television commercials. At this time, she also began private acting lessons. Bell had an uncredited role in the film Polish Wedding (1998) in 1998. Bell attended Shrine Catholic High School, where she took part in drama and music club. She won the starring role of Dorothy in her high school's production of The Wizard of Oz. After graduation Bell moved to New York City to attend prestigious Tisch School of the Arts, where she studied musical theater. In 2001, Bell left university to play the role of Becky in Tom Sawyer. That same year, she made her first credited debut in Pootie Tang (2001), but her scene was cut and her appearance exists only in the credit sequence. In 2002, Bell appeared in the Broadway revival of The Crucible with Liam Neeson and Angela Bettis. She then moved to Los Angeles, California, and appeared in a handful television shows as a special guest, finding trouble gaining a recurring role in a television series. In 2004, Bell appeared in the Lifetime's television film, Gracie's Choice, which received high ratings. At the age 24, Bell won the title role in Veronica Mars (2004), which started broadcasting in the fall of 2004, created by Rob Thomas. Bell starred as a seventeen-year-old detective, which put her alongside actors Enrico Colantoni who played her father, Percy Daggs III, Jason Dohring and Ryan Hansen. This series received very positive reviews, and Bell received much attention for her performance. Bell and the cast of Veronica Mars were nominated for two Teen Choice Awards. In 2005, Bell starred in Reefer Madness: The Movie Musical (2005) in the role of Mary Lane. Reefer Madness debuted on the Showtime network on April 16, 2005. The following year, Bell won the Saturn Award for 'Best Actress on Television' for her performance in Veronica Mars. In 2013, Bell voiced the main character, Princess Anna of Arendelle, in the Walt Disney Pictures animated movie, Frozen (2013), which received the 'best animated feature' award at the 86th Academy Awards. She performed the songs: 'For the First Time in Forever', 'Love is an Open Door', 'Do You Want to Build a Snowman', and 'For the First Time in Forever (Reprise)'. Frozen (2013), which was released on November 22, 2013, was hugely successful worldwide. On March 13, 2013, it was confirmed that a Veronica Mars (2014) movie would finally be coming to fruition. Bell and creator, Rob Thomas, launched a fund raising campaign to produce the film through Kickstarter and attained the $2 million goal in few hours. The movie was released on March 14, 2014. Bell married Dax Shepard in October, 2013.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MjkzOTIxMV5BMl5BanBnXkFtZTgwNzM3MTkzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0068338","name":"Kristen Bell","nicknames":["K-Bell","Annie","KB","Bellie"],"idIMDB":"nm0068338"},"actorId":"nm0068338","character":"Cynthia","urlCharacter":"http://www.imdb.com/character/ch0162900","main":true},{"actorName":"Kristin Davis","urlProfile":"http://www.imdb.com/name/nm0004862","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDUxNzkyNl5BMl5BanBnXkFtZTcwOTE4ODYxNA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 February 1965","placeOfBirth":" Boulder, Colorado, USA","birthName":"Kristin Landen Davis","height":"5' 6\" (1.68 m)","bio":"Kristin Landen Davis was born on February 23, 1965 in Boulder, Colorado. An only child, her parents divorced when she was a baby. She was adopted by her stepfather, psychology professor Keith Davis, after he married her mother, Dorothy, a university data analyst, in 1968. Early in her childhood, Kristin and her parents moved to Columbia, South Carolina, where her stepfather was transferred to a university. She lived in South Carolina until she graduated high school in 1983. She then moved to New Jersey, where she attended Rutgers University. After graduation, she moved to New York and waited tables before opening a yoga studio with a friend. In 1995, she got her big break when she landed the role of Brooke Armstrong Campbell on Melrose Place (1992). She left the show after one year when producers found that audience members hated her bitchy character. In 1998, Kristin was cast as Charlotte York in Sex and the City (1998), of which she remained an integral cast member until the series ended in 2004. Kristin Davis resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDUxNzkyNl5BMl5BanBnXkFtZTcwOTE4ODYxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004862","name":"Kristin Davis","idIMDB":"nm0004862"},"actorId":"nm0004862","character":"Lucy","urlCharacter":"http://www.imdb.com/character/ch0162901","main":true},{"actorName":"Kali Hawk","urlProfile":"http://www.imdb.com/name/nm1589825","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMTE0MDE0MF5BMl5BanBnXkFtZTcwNDQ3Njc0NQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Kali Hawk was a child prodigy, beginning high school at the age of 12, and gaining acceptance to prestigious New York arts university SUNY Purchase before she was 16 years old. While in a play on campus, she was introduced to a friend's agent and began doing commercials and plays in Manhattan's Lower East Side theatre district. A move to Los Angeles would come years later, with Kali finding work as a model. Her long legs, and model looks would land her in magazines and commercials for KFC, Clorox 2, MTV Europe, and in music videos for rock band KoRn, Rob Zombie, Norah Jones, T.I. and Usher. Her first film role came in the Lion's Gate thriller 'Holla', which cast Kali alongside Michael Bergin as the sweet, unsuspecting camper Caprice. She would follow that project with a supporting role in the Spike Lee comedy 'Lovers & Haters', playing a scathing Hollywood diva opposite singer/superstar Mariah Carey. On television, she has also appeared on the hit CW sitcom 'The Game', executive produced by Kelsey Grammer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMTE0MDE0MF5BMl5BanBnXkFtZTcwNDQ3Njc0NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1589825","name":"Kali Hawk","idIMDB":"nm1589825"},"actorId":"nm1589825","character":"Trudy","urlCharacter":"http://www.imdb.com/character/ch0162902","main":true},{"actorName":"Tasha Smith","urlProfile":"http://www.imdb.com/name/nm0810103","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NTg0NTM0OF5BMl5BanBnXkFtZTgwMTU2NTM0NTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 February 1971","placeOfBirth":" Camden, New Jersey, USA","height":"5' 7\" (1.7 m)","bio":"Tasha Smith was born on February 28, 1971 in Camden, New Jersey, USA. She is an actress and producer, known for Couples Retreat (2009), The Whole Ten Yards (2004) and Jumping the Broom (2011). She was previously married to Keith Douglas.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NTg0NTM0OF5BMl5BanBnXkFtZTgwMTU2NTM0NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0810103","name":"Tasha Smith","idIMDB":"nm0810103"},"actorId":"nm0810103","character":"Jennifer","urlCharacter":"http://www.imdb.com/character/ch0162903","main":true},{"actorName":"Carlos Ponce","urlProfile":"http://www.imdb.com/name/nm0005317","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODY5MzI3MDYyOV5BMl5BanBnXkFtZTgwODQ5NjQzMTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1972","placeOfBirth":" Santurce, Puerto Rico","birthName":"Carlos Armando Ponce Freyre","height":"6' 1\" (1.85 m)","bio":"Carlos attended South Miami High School in Miami, Florida, where he was active in the drama department's annual shows. He graduated in 1990.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODY5MzI3MDYyOV5BMl5BanBnXkFtZTgwODQ5NjQzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005317","name":"Carlos Ponce","nicknames":["Carlitos"],"idIMDB":"nm0005317"},"actorId":"nm0005317","character":"Salvadore","urlCharacter":"http://www.imdb.com/character/ch0162891","main":true},{"actorName":"Peter Serafinowicz","urlProfile":"http://www.imdb.com/name/nm0784818","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNDU1MjcyNl5BMl5BanBnXkFtZTgwODc1OTQ0NDE@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 July 1972","placeOfBirth":" Liverpool, England, UK","birthName":"Peter Szymon Serafinowicz","height":"6' 3\" (1.91 m)","bio":"Peter Serafinowicz was born on July 10, 1972 in Liverpool, England as Peter Szymon Serafinowicz. He is an actor and writer, known for Guardians of the Galaxy (2014), Shaun of the Dead (2004) and Star Wars: Episode I - The Phantom Menace (1999). He is married to Sarah Alexander. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNDU1MjcyNl5BMl5BanBnXkFtZTgwODc1OTQ0NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0784818","name":"Peter Serafinowicz","idIMDB":"nm0784818"},"actorId":"nm0784818","character":"Sctanley","urlCharacter":"http://www.imdb.com/character/ch0165246","main":true},{"actorName":"Jean Reno","urlProfile":"http://www.imdb.com/name/nm0000606","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNjA1MjY2M15BMl5BanBnXkFtZTYwMjgzOTk0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1948","placeOfBirth":" Casablanca, French Protectorate of Morocco [now Morocco]","birthName":"Juan Moreno y Herrera Jiménez","height":"6' 2\" (1.88 m)","bio":"Jean Reno was born Juan Moreno y Herrera-Jiménez in Casablanca, Morocco, to Spanish parents (from Andalucía) who moved to North Africa to seek work. His father was a linotypist. Reno settled in France at 17. He began studying drama and has credits in French television and theater as well as films. His first two marriages both ended in divorce, and he had two children with each of them. He keeps homes in Paris and Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNjA1MjY2M15BMl5BanBnXkFtZTYwMjgzOTk0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000606","name":"Jean Reno","idIMDB":"nm0000606"},"actorId":"nm0000606","character":"Marcel","urlCharacter":"http://www.imdb.com/character/ch0162894","main":true},{"actorName":"Temuera Morrison","urlProfile":"http://www.imdb.com/name/nm0607325","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjQ0MTM1M15BMl5BanBnXkFtZTcwMzEzNDg3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 December 1960","placeOfBirth":" Rotorua, North Island, New Zealand","birthName":"Temuera Jack Nicolas David Morrison","height":"5' 8\" (1.73 m)","bio":"Morrison was born in the town of Rotorua, in the North Island of New Zealand, the son of Hana (née Stafford) and Laurie Morrison, a musician. He is of Maori, Scottish, and Irish descent. His sister was performer Taini Morrison and his uncle was musician Sir Howard Morrison. His secondary education took place at Wesley College, Auckland and Western Heights High School, Rotorua. Morrison lives in New Zealand, and divides his time filming there and in Australia and the United States. He has an adult son, James, and two young daughters, Te Rauna Morrison and Te Kahu Morrison, from a relationship in the late 1980s with singer Kim Willoughby from the all-girl group When The Cat's Away. Temuera Morrison's partner of seven years Ashlee Howden-Sadlier is 26 years his junior and is of Tuhoe and Ngati Porou descent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjQ0MTM1M15BMl5BanBnXkFtZTcwMzEzNDg3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0607325","name":"Temuera Morrison","idIMDB":"nm0607325"},"actorId":"nm0607325","character":"Briggs","urlCharacter":"http://www.imdb.com/character/ch0162893","main":true},{"actorName":"Jonna Walsh","urlProfile":"http://www.imdb.com/name/nm2727772","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjEzOGQyOGYtNjU0Ny00NjU3LTg3OTEtY2Q2ZTQ2ZWU3NjEyXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1985","placeOfBirth":" Los Angeles County, California, USA","birthName":"Jonna Lindsay Walsh","bio":"Jonna Walsh is from Los Angeles County, California, USA. She is an actress, known for Couples Retreat (2009) and Faster (2010). She also appeared on Code Black (2016), Baby Daddy (2016), Silicon Valley (2014), Fairly Legal (2012) and No Ordinary Family (2010). She has been married to Lee DeWyze since July 21, 2012.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjEzOGQyOGYtNjU0Ny00NjU3LTg3OTEtY2Q2ZTQ2ZWU3NjEyXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2727772","name":"Jonna Walsh","idIMDB":"nm2727772"},"actorId":"nm2727772","character":"Lacey","urlCharacter":"http://www.imdb.com/character/ch0162904","main":true},{"actorName":"Gattlin Griffith","urlProfile":"http://www.imdb.com/name/nm1072959","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc0NjgxNDQ0MF5BMl5BanBnXkFtZTcwMTg2MDc4OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Gattlin Tadd Griffith","height":"5' 7\" (1.7 m)","bio":"Gattlin Griffith began auditioning at the tender age of seven years old. His first attempt at acting followed in the footsteps of his father, stuntman Tad Griffith, when he auditioned for a commercial role requiring stunt work. While he did not get that part, Gattlin did catch the eye of the casting director who had him audition for a national commercial for Yamaha motorbikes. Gattlin got the part and soon after booked a series of television commercials for Home Depot. Following that, his first TV series appearance came on \"Untold Stories of the E.R.\" in 2006 and his career took off from there. Gattlin went on to appear in hit television shows such as \"Cold Case,\" \"How I Met Your Mother,\" \"Monk,\" \"Supernatural,\" and \"Criminal Minds.\" Proving he had talent far beyond his years, Gattlin made his feature film debut opposite Angelina Jolie in the Academy Award nominated film \"Changeling.\" To date, Gattlin has appeared in nearly a dozen films, most notably: \"Couples Retreat\" for Universal Pictures opposite Vince Vaughn, \"The New Daughter\" with Kevin Costner for Mandate Pictures, and \"Green Lantern\" opposite Tim Robbins for Warner Brothers. When he's not acting, Gattlin is an accomplished equestrian gymnast and 4th generation trick rider whose grandparents, Dick and Connie Griffith, are in the Pro Rodeo, National Cowboy and Cowgirl Halls of Fame. Gattlin's first exhibition rodeo was in January of 2012 at the Forth Worth Stock Show and Rodeo with two of his younger brothers, Callder and Arrden. Gattlin resides outside of Los Angeles with his parents and is eldest of four boys. He is an avid football and soccer player and makes sure he has his football on set with him at all times.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc0NjgxNDQ0MF5BMl5BanBnXkFtZTcwMTg2MDc4OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1072959","name":"Gattlin Griffith","nicknames":["Gattman"],"idIMDB":"nm1072959"},"actorId":"nm1072959","character":"Robert","urlCharacter":"http://www.imdb.com/character/ch0162714","main":true}],"seasons":[],"idIMDB":"tt1078940","urlIMDB":"http://www.imdb.com/title/tt1078940","business":{"budget":{"money":"$60,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"£1,825,142","country":"UK","day":"18","month":"10","year":"2009","remarks":"381 Screens"}],"gross":[{"money":"$109,176,215","country":"USA","day":"31","month":"01","year":"2010","remarks":""},{"money":"$109,065,605","country":"USA","day":"24","month":"01","year":"2010","remarks":""},{"money":"$108,931,010","country":"USA","day":"17","month":"01","year":"2010","remarks":""},{"money":"$108,731,660","country":"USA","day":"10","month":"01","year":"2010","remarks":""},{"money":"$108,511,760","country":"USA","day":"03","month":"01","year":"2010","remarks":""},{"money":"$108,134,160","country":"USA","day":"27","month":"12","year":"2009","remarks":""},{"money":"$107,863,225","country":"USA","day":"20","month":"12","year":"2009","remarks":""},{"money":"$107,592,235","country":"USA","day":"13","month":"12","year":"2009","remarks":""},{"money":"$107,233,200","country":"USA","day":"06","month":"12","year":"2009","remarks":""},{"money":"$106,700,205","country":"USA","day":"29","month":"11","year":"2009","remarks":""},{"money":"$102,045,330","country":"USA","day":"15","month":"11","year":"2009","remarks":""},{"money":"$95,680,555","country":"USA","day":"08","month":"11","year":"2009","remarks":""},{"money":"$77,736,885","country":"USA","day":"25","month":"10","year":"2009","remarks":""},{"money":"$62,617,735","country":"USA","day":"18","month":"10","year":"2009","remarks":""},{"money":"$34,286,740","country":"USA","day":"11","month":"10","year":"2009","remarks":""},{"money":"£5,418,638","country":"UK","day":"08","month":"11","year":"2009","remarks":""},{"money":"£3,588,820","country":"UK","day":"25","month":"10","year":"2009","remarks":""},{"money":"£1,825,142","country":"UK","day":"18","month":"10","year":"2009","remarks":""}],"weekendGross":[{"money":"$79,965","country":"USA","day":"31","month":"01","year":"2010","remarks":"144 Screens"},{"money":"$107,545","country":"USA","day":"24","month":"01","year":"2010","remarks":"157 Screens"},{"money":"$146,185","country":"USA","day":"17","month":"01","year":"2010","remarks":"169 Screens"},{"money":"$147,750","country":"USA","day":"10","month":"01","year":"2010","remarks":"197 Screens"},{"money":"$214,295","country":"USA","day":"03","month":"01","year":"2010","remarks":"222 Screens"},{"money":"$162,155","country":"USA","day":"27","month":"12","year":"2009","remarks":"230 Screens"},{"money":"$170,610","country":"USA","day":"20","month":"12","year":"2009","remarks":"294 Screens"},{"money":"$257,820","country":"USA","day":"13","month":"12","year":"2009","remarks":"371 Screens"},{"money":"$313,005","country":"USA","day":"06","month":"12","year":"2009","remarks":"432 Screens"},{"money":"$960,995","country":"USA","day":"29","month":"11","year":"2009","remarks":"860 Screens"},{"money":"$4,164,940","country":"USA","day":"15","month":"11","year":"2009","remarks":"2,509 Screens"},{"money":"$6,129,045","country":"USA","day":"08","month":"11","year":"2009","remarks":"2,857 Screens"},{"money":"$10,620,685","country":"USA","day":"25","month":"10","year":"2009","remarks":"3,074 Screens"},{"money":"$17,227,390","country":"USA","day":"18","month":"10","year":"2009","remarks":"3,009 Screens"},{"money":"£213,883","country":"UK","day":"08","month":"11","year":"2009","remarks":"243 Screens"},{"money":"£932,171","country":"UK","day":"25","month":"10","year":"2009","remarks":"379 Screens"},{"money":"£1,825,142","country":"UK","day":"18","month":"10","year":"2009","remarks":"381 Screens"}],"admissions":[{"money":"87,474","country":"Netherlands","day":"31","month":"12","year":"2009","remarks":""}],"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 53 min (113 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arricam LT, Cooke S4 and Angenieux Optimo Lenses","Arricam ST, Cooke S4 and Angenieux Optimo Lenses","Arriflex 435, Cooke S4 and Angenieux Optimo Lenses","Clairmont Cameras and Lenses"],"laboratory":["EFILM Digital Laboratories, Hollywood (CA), USA"],"filmLength":["3,132 m (Portugal, 35 mm)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (spherical) (Kodak Vision 2383)","D-Cinema"]},"rating":"5.5","metascore":"23","filmingLocations":[{"location":"Bora Bora, Leeward Islands, French Polynesia"}],"rated":"PG-13","awards":[{"award":"BMI Film & TV Awards 2010","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"Film Music","names":[{"name":"A.R. Rahman","id":"nm0006246","role":null}]}]}]},{"award":"Casting Society of America, USA 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Outstanding Achievement in Casting - Big Budget Feature - Comedy","names":[{"name":"Sarah Finn","id":"nm0278168","role":null},{"name":"Randi Hiller","id":"nm0384900","role":null}]}]}]},{"award":"International Film Music Critics Award (IFMCA) 2009","titlesAwards":[{"titleAwardOutcome":"Nominated IFMCA Award","categories":[{"category":"Best Original Score for a Comedy Film","names":[{"name":"A.R. Rahman","id":"nm0006246","role":null}]}]}]},{"award":"Teen Choice Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie Actress: Comedy","names":[{"name":"Kristen Bell","id":"nm0068338","role":null}]},{"category":"Choice Movie: Hissy Fit","names":[{"name":"Vince Vaughn","id":"nm0000681","role":null}]}]}]}],"votes":"85,974","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"},{"idCompany":"co0142678","name":"Relativity Media"},{"idCompany":"co0180082","name":"Wild West Picture Show Productions"}],"keywords":{"keywords":["couple","marriage","island","tropical","voyeurism","voyeur","blonde","bikini","scantily clad female","cleavage","closing credits sequence","guru","tantra yoga","yoga","friendship","underwear","nudity","divorce","couples therapy","toilet","chicago illinois","screwball comedy","chick flick","actor shares first name with character","gray panties","pink panties","blue panties","black panties","panties","girl in panties","female removes her clothes","female removes her dress","mini skirt"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:57:49"}}