{"data":{"movies":[{"title":"House Broken","originalTitle":"","year":"2009","releaseDate":"20110707","directors":[{"name":"Sam Harper","id":"nm0363958"}],"writers":[{"name":"Sam Harper","id":"nm0363958"},{"name":"Meredith Preston","id":"nm1032078"}],"runtime":"84 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMTAzMDQ2Nl5BMl5BanBnXkFtZTcwMTc4ODIxMw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"Cathcart retires from the fire department and wants to live alone with his wife, which means he has to get his two sons, Quinn and Elliot, who are approaching 30, to move. They are unemployed slackers; their mom does everything for them. Cathcart takes her camping while leaving the boys a house without food, money, or electricity. Will the lads get the message, find jobs, and move out, or will they cling to life at mom and pop's at all costs? They take in boarders, who may be their salvation. Meanwhile, mom wants to come home and continue babying her sons. Can the house survive?","simplePlot":"In order to enjoy his retirement, a father takes drastic measures to get his twentysomething, slacker sons to move out and fend for themselves.","actors":[{"actorName":"Danny DeVito","urlProfile":"http://www.imdb.com/name/nm0000362","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5MjM5MzM3M15BMl5BanBnXkFtZTYwOTEzOTY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1944","placeOfBirth":" Asbury Park, New Jersey, USA","birthName":"Daniel Michael DeVito Jr.","height":"4' 10\" (1.47 m)","bio":"Danny DeVito has amassed a formidable and versatile body of work as an actor, producer and director that spans the stage, television and film. Daniel Michael DeVito Jr. was born on November 17, 1944, in Neptune, New Jersey, to Italian-American parents. His mother, Julia (Moccello), was a homemaker. His father, Daniel, Sr., was a small business owner whose ventures included a dry cleaning shop, a dairy outlet, a diner, and a pool hall. While growing up in Asbury Park, his parents sent him to private schools. He attended Our Lady of Mount Carmel grammar school and Oratory Prep School. Following graduation in 1962, he took a job as a cosmetician at his sister's beauty salon. A year later, he enrolled at New York's American Academy of Dramatic Arts so he could learn more about cosmetology. While at the academy, he fell in love with acting and decided to further pursue an acting career. During this time, he met another aspiring actor Michael Douglas at the National Playwrights Conference in Waterford, Connecticut. The two would later go on to collaborate on numerous projects. Soon after he also met an actress named Rhea Perlman. The two fell in love and moved in together. They were married in 1982 and had three children together. In 1968, Danny landed his first part in a movie when he appeared as a thug in the obscure Dreams of Glass (1970). Despite this minor triumph, Danny became discouraged with the film industry and decided to focus on stage productions. He made his Off-Broadway debut in 1969 in \"The Man With the Flower in His Mouth.\" He followed this up with stage roles in \"The Shrinking Bride,\" and \"Lady Liberty.\" In 1975, he was approached by director Milos Forman and Michael Douglas about appearing in the film version of One Flew Over the Cuckoo's Nest (1975), which would star Jack Nicholson in the leading role. With box office success almost guaranteed and a chance for national exposure, Danny agreed to the role. The movie became a huge hit, both critically and financially, and still ranks today as one the greatest movies of all time. Unfortunately, the movie did very little to help Danny's career. In the years following, he was relegated to small movie roles and guest appearances on television shows. His big break came in 1978 when he auditioned for a role on an ABC sitcom pilot called Taxi (1978), which centered around taxi cab drivers at a New York City garage. Danny auditioned for the role of dispatcher Louie DePalma. At the audition, the producers told Danny that he needed to show more attitude in order to get the part. He then slammed down the script and yelled, \"Who wrote this sh**?\" The producers, realizing he was perfect for the part, brought him on board. The show was a huge success, running from 1978 to 1983. Louie DePalma, played flawlessly by Danny, became one of the most memorable (and reviled) characters in television history. While he was universally hated by TV viewers, he was well-praised by critics, winning an Emmy award and being nominated three other times. Throughout the 1980s and 1990s, Danny maintained his status as a great character actor with memorable roles in movies like Romancing the Stone (1984), Ruthless People (1986), Throw Momma from the Train (1987) and Twins (1988). He also had a great deal of success behind the camera, directing movies like The War of the Roses (1989) and Hoffa (1992). In 1992, Danny was introduced to a new generation of moviegoers when he was given the role of The Penguin/Oswald Cobblepot in Tim Burton's highly successful Batman Returns (1992). This earned him a nomination for Best Villain at the MTV Movie Awards. That same year, along with his then-wife Rhea Perlman, Danny co-founded Jersey Films, which has produced many popular films and TV shows, including Pulp Fiction (1994), Get Shorty (1995), Man on the Moon (1999) and Erin Brockovich (2000). DeVito has many directing credits to his name as well, including Throw Momma from the Train (1987), The War of the Roses (1989), Hoffa (1992), Death to Smoochy (2002) and the upcoming St. Sebastian. In 2006, he returned to series television in the FX comedy series It's Always Sunny in Philadelphia (2005). With a prominent role in a hit series, Devito's comic talents were now on display for a new generation of television viewers. In 2012, he provided the title voice role in Dr. Seuss' The Lorax (2012). These days, he continues to work with many of today's top talents as an actor, director and producer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5MjM5MzM3M15BMl5BanBnXkFtZTYwOTEzOTY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000362","name":"Danny DeVito","idIMDB":"nm0000362"},"actorId":"nm0000362","character":"Tom Cathkart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Katey Sagal","urlProfile":"http://www.imdb.com/name/nm0005408","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU0ODA0NjMzMF5BMl5BanBnXkFtZTcwMjYyMTk3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1954","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Catherine Louise Sagal","height":"5' 9\" (1.75 m)","bio":"An extremely gifted and versatile performer adept at both comedy and drama, actress/singer Katey Sagal became a household name in the late 1980s as the fabulously brazen, undomesticated Peg Bundy on the enduring Fox series Married with Children (1987). During its lengthy run, she received three Golden Globe and two American Comedy Award nominations. As popular and identifiable as her Peg Bundy persona was, Katey assertively moved on without a hitch after the show went off the air, not only starring in other sitcoms and television movies, but portraying characters that were polar opposite to the outrageous role that first earned her nationwide attention. For example, In 2008, she took on the role of Gemma Teller Morrow -- the matriarch of a Hell's Angels-esque California biker gang -- on the series Sons of Anarchy (2008), and in 2011, her portrayal earned her a Golden Globe Award for Best Performance by an Actress in a Television Series - Drama. In addition to her busy on-camera scheduling, Katey has retraced her steps back to her first love: singing and songwriting. With the support of her record label Valley Entertainment, she released the album \"Room\" in 2004, which combined such classics as \"Feel a Whole Lot Better\" and \"(For the Love of) Money\" with original songs she penned, including \"Life Goes Round\", \"Daddy's Girl\" and \"Wish I Were a Kid\". \"Room\" is her first CD since her 1994 debut \"Well\". Born Catherine Louise Sagal, her father was the late Boris Sagal, the noted television and film director; her mother, Sara Zwilling, was a director and singer. Katey began performing at age 5 and studied voice and acting at the California Institute of the Arts in Valencia, California. A singing waitress during her \"salad\" years, she first started performing with the band \"The Group with No Name\", and then caught a break after hooking up with Gene Simmons and his 1970s rock band KISS. In the meantime, she gained valuable experience as a backup recording singer for Simmons and such other established stars as Bob Dylan, Olivia Newton-John, Etta James and Tanya Tucker. Katey also was dynamic performing live backup with diva Bette Midler as one of her \"Harlettes\" in Bette's wildly avant garde stage shows during the late 1970s and early 1980s. In 1985, while performing on stage in a musical, she was spotted by talent agents who subsequently cast her as Mary Tyler Moore's feisty co-worker Jo Tucker in Mary (1985), a short-lived comedy series. From that point on she focused on film and television. In 1987, she won the role of Peg Bundy in Married with Children (1987), and the rest is history. In her post-Bundy career, Katey has continued to demonstrate a strong range, playing a much more responsible parent in the popular sitcom 8 Simple Rules (2002). Co-starring the late John Ritter, Katey valiantly moved to single head of household after Ritter's sudden passing in 2003 with highly successful results. Katey has earned equally fine kudos for her television movies, appearing in such fare as Chance of a Lifetime (1998), a charming romantic comedy that also co-starred John Ritter, God's New Plan (1999), a tearjerker in which she played a dying mother, and the Disney offerings Smart House (1999) and The Wonderful World of Disney: Mr. Headmistress (1998). The voice of Turanga Leela, the beautiful one-eyed sewer mutant, in the animated series Futurama (1999), she also has guested on such series as Ghost Whisperer (2005), Lost (2004), Boston Legal (2004), CSI: Crime Scene Investigation (2000) and Eli Stone (2008). Feature films have included Maid to Order (1987), The Good Mother (1988), the Sundance Film Festival favorite Dropping Out (2000), Following Tildy (2002) and the indie I'm Reed Fish (2006). More recently, she played Jack's mother in a live action/adventure retelling of Jack and the Beanstalk (2009) that also featured the talents of Christopher Lloyd, James Earl Jones and Chevy Chase. Katey resides in the Los Angeles area with husband, writer/producer/director/creator Kurt Sutter, whose acclaimed work includes The Shield (2002) and the offbeat Sons of Anarchy (2008), the latter show created by Sutter with Katey intriguingly cast as a motorcycle club family matriarch. They share their home with three children, Sarah, Jackson and Esmé, and three dogs, Lumpy, Lola and Blue.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU0ODA0NjMzMF5BMl5BanBnXkFtZTcwMjYyMTk3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005408","name":"Katey Sagal","idIMDB":"nm0005408"},"actorId":"nm0005408","character":"Mary Cathkart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Skyler Stone","urlProfile":"http://www.imdb.com/name/nm1043126","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGZhODMxZmItY2M3Yi00ZGIyLWJhY2QtZTA5NjRmN2QwMTM3XkEyXkFqcGdeQXVyMDUzNzI4Mw@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 June 1979","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Skyler Joseph Clipner","height":"5' 8\" (1.73 m)","bio":"Skyler Stone was born on June 15, 1979 in St. Louis, Missouri, USA as Skyler Joseph Clipner. He is an actor and producer, known for Waiting... (2005), Con (2005) and Raising Hope (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGZhODMxZmItY2M3Yi00ZGIyLWJhY2QtZTA5NjRmN2QwMTM3XkEyXkFqcGdeQXVyMDUzNzI4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1043126","name":"Skyler Stone","idIMDB":"nm1043126"},"actorId":"nm1043126","character":"Quinn Cathkart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ryan Hansen","urlProfile":"http://www.imdb.com/name/nm1218621","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU4NDE2NjgxOF5BMl5BanBnXkFtZTgwMjQ1MTA1MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 July 1981","placeOfBirth":" San Diego, California, USA","height":"6' (1.83 m)","bio":"Ryan Hansen is an American actor. He was born in Fountain Valley, California, and raised in El Cajon, California, but has since moved with his wife, Amy Hansen, to Los Angeles. His wife is a former roommate of Kristen Bell (star of Veronica Mars (2004)). Hansen is involved in the campaign, \"Invisible Children\", and has appeared in the online series, \"The LXD\", of which 50% of the profits are going to the Invisible Children Campaign.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU4NDE2NjgxOF5BMl5BanBnXkFtZTgwMjQ1MTA1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1218621","name":"Ryan Hansen","idIMDB":"nm1218621"},"actorId":"nm1218621","character":"Elliot Cathkart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Caitlin Crosby","urlProfile":"http://www.imdb.com/name/nm1589789","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGMyNzk3ZWYtMWEzNC00NzhjLWE2OWYtYjE3MTI4NTAyMGI5L2ltYWdlXkEyXkFqcGdeQXVyMTQwMzU2OTA@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Caitlin Crosby is an actress, known for A Mann's World (2011). She has been married to Colin Crosby since January 11, 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGMyNzk3ZWYtMWEzNC00NzhjLWE2OWYtYjE3MTI4NTAyMGI5L2ltYWdlXkEyXkFqcGdeQXVyMTQwMzU2OTA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1589789","name":"Caitlin Crosby","idIMDB":"nm1589789"},"actorId":"nm1589789","character":"Sarah Stanton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brie Larson","urlProfile":"http://www.imdb.com/name/nm0488953","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4MzAxOTI5NV5BMl5BanBnXkFtZTgwMzMzNTA4NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1989","placeOfBirth":" Sacramento, California, USA","birthName":"Brianne Sidonie Desaulniers","height":"5' 7\" (1.7 m)","bio":"Brie Larson has built an impressive career as an acclaimed television actress, rising feature film star and emerging recording artist. A native of Sacramento, Brie started studying drama at the early age of 6, as the youngest student ever to attend the American Conservatory Theater in San Francisco. She starred in one of Disney Channel's most watched original movies, Right on Track (2003), as well as the WB's Raising Dad (2001) and MGM's teen comedy Sleepover (2004) - all before graduating from middle school. Brie's work includes the coming-of-age drama Tanner Hall (2009) and the dark comedy, Just Peck (2009), with Marcia Cross and Keir Gilchrist. She earned critical praise for her role in the independent feature, Remember the Daze (2007) (aka \"The Beautiful Ordinary\"), singled out by Variety as the \"scene stealer\" of the film, opposite Amber Heard and Leighton Meester. Brie garnered considerable acclaim for her series regular role of \"Kate\", Toni Collette's sarcastic and rebellious daughter, in Showtime's breakout drama United States of Tara (2009), created by Academy Award-winning writer Diablo Cody and based on an original idea by Steven Spielberg. She starred in The Trouble with Bliss (2011) opposite Michael C. Hall, playing a young girl out to seduce him while, in turn, teaching him more about his own life. She also starred in Universal's Scott Pilgrim vs. the World (2010) and Noah Baumbach's Greenberg (2010). In Scott Pilgrim vs. the World (2010), Brie played rock star \"Envy Adams\", former flame of Michael Cera, and in Greenberg (2010), she starred as a young temptress trying to flirt with Ben Stiller, a New Yorker traveling West to try to figure out his life. In addition to her talents as an actress, Brie has simultaneously nurtured an ever-growing musical career. At 13, Brie landed her first record deal at Universal Records with Tommy Mottola, who signed her sight-unseen. Her first release in 2005 led to a nationwide tour.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4MzAxOTI5NV5BMl5BanBnXkFtZTgwMzMzNTA4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0488953","name":"Brie Larson","idIMDB":"nm0488953"},"actorId":"nm0488953","character":"Suzy Decker","urlCharacter":"http://www.imdb.com/character/ch0465404","main":true},{"actorName":"Matthew Glave","urlProfile":"http://www.imdb.com/name/nm0322182","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmNhNzQ4MWQtNDkwNi00NzQ3LTk2ZWQtY2MwNThiMzZlOWZhXkEyXkFqcGdeQXVyNzk5NjUyMA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1963","placeOfBirth":" Saginaw, Michigan, USA","height":"5' 10¾\" (1.8 m)","bio":"Matthew Glave was born on August 19, 1963 in Saginaw, Michigan, USA. He is an actor, known for The Wedding Singer (1998), Argo (2012) and Girlfriends' Guide to Divorce (2014). He has been married to Anita Barone since 2000. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmNhNzQ4MWQtNDkwNi00NzQ3LTk2ZWQtY2MwNThiMzZlOWZhXkEyXkFqcGdeQXVyNzk5NjUyMA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0322182","name":"Matthew Glave","idIMDB":"nm0322182"},"actorId":"nm0322182","character":"Hector","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas F. Wilson","urlProfile":"http://www.imdb.com/name/nm0001855","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzM4ODM4M15BMl5BanBnXkFtZTYwMDU1Mzky._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1959","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Thomas Francis Wilson Jr.","height":"6' 2½\" (1.89 m)","bio":"Tom Wilson is a creative artist whose professional career has explored almost every imaginable artistic discipline, blending them into a unique and very individual declaration of a life in the arts. A man of fervent but private faith his whole life, the last few years have been interesting, with hundreds of invitations to speak at conferences and retreats, as well as the opportunity to record the music that he began playing in church in the 1970s. Tom has enjoyed a successful career as an actor, writer and comedian for over 20 years. He has more than 50 films, television shows and comedy specials to his credit, and has appeared on talk shows with everyone from Johnny Carson to Jay Leno to David Letterman to Regis Philbin and Kathie Lee Gifford. As a voice-over actor, he has worked in dozens of animated series, including many episodes of Nickelodeon's SpongeBob SquarePants (1999). As a comedian he has been a regular performer at the world-famous Improv and Comedy Store since the day he arrived in Hollywood. His self-written one-man show, \"Cowboy Tommy,\" boasted a series of sold-out engagements. He continues to act in movies and television, and he performs comedy and music at theaters across America. As a writer and producer, he's written for several prestigious literary magazines, as well as for Universal Studios, Disney, Fox and Film Roman studios, and produced a groundbreaking series of debates for Canadian television called \"The Seven Deadly Sins\", which examined cultural values and the role of the arts within them. As an avocation, he is a photographer and painter, with a photograph in the permanent collection of the California Museum of Photography and paintings on the walls of the guest bedrooms of many close personal friends (or, as artists like to say, \"in many private collections.\") Actor, comedian, writer, musician, and artist - Tom Wilson has transcended the limitations of pop-cultural celebrity to become an artist of honesty, gravity and grace. Thomas is a graduate of Radnor high school in the suburbs of Philadelphia, Pennsylvania, where he was known for his comedic personality.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzM4ODM4M15BMl5BanBnXkFtZTYwMDU1Mzky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001855","name":"Thomas F. Wilson","nicknames":["Tom"],"idIMDB":"nm0001855"},"actorId":"nm0001855","character":"Fire Chief Henry Decker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Winter Jones","urlProfile":"http://www.imdb.com/name/nm1477020","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYwNjY4OWEtMzM3YS00ODIxLTkxMWQtNzNlNDcyMjdlYzE3XkEyXkFqcGdeQXVyMzU4MDUxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 March 1981","placeOfBirth":" Beirut, Lebanon","height":"5' 9\" (1.75 m)","bio":"Winter Jones is an Assyrian-American and Chicago's Lincoln Square native. It was Chicago where he started auditioning for roles in the local theatre houses to gain experience. Like most young aspiring actors, Winter enrolled in a college that would provide him with the skills necessary to develop a career in show business. He attended DePaul University's Theatre School where he studied Theatre for two years before transferring to Roosevelt University's Theatre Conservatory. At Roosevelt, Winter was trained in improv, Stanislavsky method, and Meisner technique under the guidance of Ted Hoerl. Once his course curriculum with Mr. Hoerl was completed Winter made the decision to dropout of college, move to LA, and pursue the next phase of his acting career. Winter arrived in Los Angeles on July 17, 2004. He landed in LA with no real connections, and like many bold aspiring actors before him, he turned to sheer determination as a means to accomplish his ambitions. He used to sneak into casting offices riding a Vespa and pretend to be a messenger service, dropping off his headshots. Winter's bold tactics and determination proved to be a success with the booking of his first major gig on The Comeback starring Lisa Kudrow in April 2005. Shortly thereafter, Elizabeth Barnes (casting director for The Comeback (2005) recommended Winter to his then talent agency: GVA Talent. Winter signed with GVA a week before landing his first feature film, American Dreamz (2006), in May 2005. In late 2009, he started a band called The Hollabacks, which gained national recognition and success. The band won the 2010 Slurpee Battle of the Bands competition; opened for N*E*R*D. at the Fillmore East; was invited for a live session at Wolfgang's Vault; had two songs featured in the thriller \"Cyrus\" (starring Lance Henriksen); and were the face of Slurpee for six months. Winter is also currently pursuing a solo music career collaborating with various artists/musicians including Ryan Liestman (keyboards - Jonas Brothers); Michael Bland (drums - Prince and The New Power Generation/Soul Asylum); and John Fields (prod. - Demi Lovato/Jonas Brothers). His album, \"O My God,\" (debuted 10/13/2012) and latest EP - Sex Appeal (debuted 6/14/14) are both available on iTunes. He is repped by Selena Schoups of Marque Entertainment.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYwNjY4OWEtMzM3YS00ODIxLTkxMWQtNzNlNDcyMjdlYzE3XkEyXkFqcGdeQXVyMzU4MDUxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1477020","name":"Winter Jones","idIMDB":"nm1477020"},"actorId":"nm1477020","character":"Gilroy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adam Herschman","urlProfile":"http://www.imdb.com/name/nm2012635","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MjYyMTU1Nl5BMl5BanBnXkFtZTgwNTE5NDQ2NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Adam Herschman is an actor, known for Accepted (2006), Harold & Kumar Escape from Guantanamo Bay (2008) and Soul Men (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MjYyMTU1Nl5BMl5BanBnXkFtZTgwNTE5NDQ2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2012635","name":"Adam Herschman","idIMDB":"nm2012635"},"actorId":"nm2012635","character":"Shirtless Boy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Parvesh Cheena","urlProfile":"http://www.imdb.com/name/nm1231867","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MzY5ODkxOF5BMl5BanBnXkFtZTcwMjEwMTE3Nw@@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1979","placeOfBirth":" Elk Grove, Illinois, USA","birthName":"Parvesh Singh Cheena","height":"5' 6\" (1.68 m)","bio":"Parvesh Cheena was born on July 22, 1979 in Elk Grove, Illinois, USA as Parvesh Singh Cheena. He is an actor and producer, known for Outsourced (2010), Transformers: Rescue Bots - Mission Protection! (2011) and Crazy Ex-Girlfriend (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MzY5ODkxOF5BMl5BanBnXkFtZTcwMjEwMTE3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1231867","name":"Parvesh Cheena","nicknames":["Parv, Parvey, Parvert, Par, Parro, Vesh"],"idIMDB":"nm1231867"},"actorId":"nm1231867","character":"Zerban","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Bofshever","urlProfile":"http://www.imdb.com/name/nm0091480","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMzg3MDIwMl5BMl5BanBnXkFtZTgwODM1MDU3OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 October 1950","placeOfBirth":" Brooklyn, New York City, New York, USA","bio":"Michael Bofshever was born on October 12, 1950 in Brooklyn, New York City, New York, USA. He is an actor and producer, known for A Dog's Purpose (2017), United 93 (2006) and Breaking Bad (2008). He has been married to Celia D. Lee since November 23, 1979. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMzg3MDIwMl5BMl5BanBnXkFtZTgwODM1MDU3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0091480","name":"Michael Bofshever","idIMDB":"nm0091480"},"actorId":"nm0091480","character":"Husband Camper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Corryn Cummins","urlProfile":"http://www.imdb.com/name/nm1855860","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MTYzODc4NF5BMl5BanBnXkFtZTgwNDEzMzU3OTE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 January 1979","placeOfBirth":" Chicago, Illinois, USA","birthName":"Corryn Michelle Cummins","height":"5' 6\" (1.68 m)","bio":"Corryn Cummins was born on January 18, 1979 in Chicago, Illinois, USA as Corryn Michelle Cummins. She is an actress, known for From Inside (2008), Nocturne (2005) and Homestead (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MTYzODc4NF5BMl5BanBnXkFtZTgwNDEzMzU3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1855860","name":"Corryn Cummins","idIMDB":"nm1855860"},"actorId":"nm1855860","character":"Wife Camper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kiernan Shipka","urlProfile":"http://www.imdb.com/name/nm2215143","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MDYwMDg0MF5BMl5BanBnXkFtZTgwMjczNDg2NDE@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1999","placeOfBirth":" Chicago, Illinois, USA","height":"5' 2\" (1.57 m)","bio":"Kiernan Shipka was born in Chicago, Illinois, to John Young Shipka, a real estate developer, and his wife, Erin Ann, a one-time queen of Chicago's St. Patrick's Day parade. The family relocated to Los Angeles when she was six to support her acting career. Kiernan got her black belt in taekwondo in June, 2012. Shipka began doing commercial print modeling when she was a baby. As part of Mad Men (2007)'s ensemble cast, she won the Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series in 2008 and 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MDYwMDg0MF5BMl5BanBnXkFtZTgwMjczNDg2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2215143","name":"Kiernan Shipka","idIMDB":"nm2215143"},"actorId":"nm2215143","character":"Daughter Camper","urlCharacter":"http://www.imdb.com/character/ch0441908","main":true},{"actorName":"Nick Nervies","urlProfile":"http://www.imdb.com/name/nm2165686","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MzY0MTU5OV5BMl5BanBnXkFtZTgwMTU0NDgxNzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 January 1995","placeOfBirth":" Torrance, California, USA","birthName":"Nickolas Nervies","bio":"Nick Nervies was born on January 24, 1995 in Torrance, California, USA as Nickolas Nervies. He is an actor, known for Project X (2012), Les grands frères (2008) and The Soloist (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MzY0MTU5OV5BMl5BanBnXkFtZTgwMTU0NDgxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2165686","name":"Nick Nervies","idIMDB":"nm2165686"},"actorId":"nm2165686","character":"Brando","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1054631","urlIMDB":"http://www.imdb.com/title/tt1054631","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"01","month":"08","year":"2007","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 24 min (84 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.8","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"1,763","type":"Movie","companyCreditsSimple":[{"idCompany":"co0192878","name":"Capacity Pictures"},{"idCompany":"co0212746","name":"Home"}],"keywords":{"keywords":["slacker","camping","cans","job","electricity","retirement","hdtv","wii remote","wii","nintendo wii system","xbox 360 wireless controller","xbox 360 controller","xbox 360","girl next door","protective father","new girlfriend","recreational vehicle","escape","dart","dart gun","surveillance camera","fishing","rent money","rent","masseuse","roommate","housemate","trash","sex","sex with a mannequin","mannequin","massage","erection","peeping tom","trampoline","recycling","supermarket","no money","intervention","mother son relationship","father son relationship","husband wife conflict","husband wife relationship","two brothers","brother brother relationship","unemployment","mail carrier","video tape","clumsy","cheerleader","neighbor","firefighter","fireman"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 21:56:48"}}