{"data":{"movies":[{"title":"Exit Speed","originalTitle":"","year":"2008","releaseDate":"20080826","directors":[{"name":"Scott Ziehl","id":"nm0956169"}],"writers":[{"name":"Michael Stokes","id":"nm0831370"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NTgzNzY2Nl5BMl5BanBnXkFtZTcwMDAyMjY4MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Thriller"],"plot":"On Christmas Eve, ten strangers board a bus traveling across Texas. Far out in the wilds they collide with a meth-addicted biker. Forced off the road by other members of the gang, the passengers take refuge in the hell hole of an abandoned scrap yard. They use improvised weapons and sheer guts to mount a defense against the murderous bikers but, as their numbers dwindle, they realize that their survival depends on doing the unthinkable. They must go on the offensive.","simplePlot":"On Christmas Eve, ten strangers board a bus traveling across Texas. Far out in the wilds they collide with a meth-addicted biker. Forced off the road by other members of the gang, the ... ","actors":[{"actorName":"Desmond Harrington","urlProfile":"http://www.imdb.com/name/nm0004993","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzE1NTY4MzY5OV5BMl5BanBnXkFtZTgwMDc3ODA2OTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 October 1976","placeOfBirth":" Savannah, Georgia, USA","height":"6' (1.83 m)","bio":"Desmond Harrington was raised in the Bronx New York. Prior to acting Desmond attended Manhattan college briefly, worked as a laborer, landscaper, a cold caller at a brokerage firm, and finally a bartender in Manhattan, where a co-worker invited him to attend an acting class. Harrington landed his first role in Luc Besson's The Messenger: The Story of Joan of Arc.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzE1NTY4MzY5OV5BMl5BanBnXkFtZTgwMDc3ODA2OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004993","name":"Desmond Harrington","idIMDB":"nm0004993"},"actorId":"nm0004993","character":"Sam Cutter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lea Thompson","urlProfile":"http://www.imdb.com/name/nm0000670","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5ODcyODUwMl5BMl5BanBnXkFtZTgwMTA3MDg1MjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1961","placeOfBirth":" Rochester, Minnesota, USA","birthName":"Lea Katherine Thompson","height":"5' 3\" (1.6 m)","bio":"Lea Katherine Thompson was born on May 31, 1961, in Rochester, Minnesota. She is the youngest of five children. Her parents are Barbara Anne (Barry) and Clifford Elwin \"Cliff\" Thompson. Since all her siblings were much older than she, Lea says it seemed like she had more than two parents. The family lived in the Starlight Motel, all the kids sharing a room. Things began to look up for the family when Lea's father got a job in Minneapolis, where the family moved. Lea's parents divorced when she was six, and her mother decided to maintain the family. This wasn't the easiest job, considering her mother was alcohol-addicted at the time. When she found the strength to quit drinking, she took a job playing the piano and singing in a bar to support Lea and her siblings. When Lea was seven, her mother remarried. Ever since Lea was little, she loved to dance -- ballet to be exact. She would practice three to four hours every day. Her first role was as a mouse in \"The Nutcracker\". After Lea turned fourteen, she had performed in more than 45 ballets on stages, such as The Minnesota Dance Theatre, The Pennsylvania Ballet Company, and The Ballet Repertory. She won scholarships to The American Ballet Theatre and The San Francisco Ballet. At age nineteen, she auditioned for Mikhail Baryshnikov, who later told her that she was \"a beautiful dancer... but too stocky\". Lea knew her dreams had been crushed. At that point, she decided to turn to acting. She began working as a waitress, also making 22 Burger King commercials and a few Twix commercials. She was perfect for these parts simply because she was the average girl-down-the-street, from the Midwest. Everyone who knows her can't believe she was and still is so completely different...trying to be independent and fight against the system. In 1982, Lea made some type of a computer game or interactive movie known as \"Murder, Anyone\". Her first role was in the movie, Jaws 3-D (1983), as a water ski bunny, although she couldn't swim or ski, which she still can't! There, she met Dennis Quaid, who became her fiancée and acting coach. Her next role was in All the Right Moves (1983), where she acted opposite Tom Cruise. Director Michael Chapman was so disappointed with her performance, that he almost fired her. Between 1983 and 1984, Lea appeared in other \"teen\" movies, such as Red Dawn (1984), The Wild Life (1984), and Going Undercover (aka Going Undercover (1985)), and believes it was lucky that, in these movies, they were able to use anyone who could walk and talk! Lea's biggest known accomplishment, and her big break, came from the first Back to the Future (1985). It was the biggest hit of 1985, and Lea was suddenly the most wanted actress. She could have her pick of any role she wanted to take on. She chose Howard the Duck (1986). Although it was a George Lucas production, the critics turned the movie, and Lea, down. Afterwards, director Howard Deutch offered Lea a part in his movie, Some Kind of Wonderful (1987), but she refused. After he urged her to do it, she reconsidered. She won the Young Artist Award for best young actress. During filming, Howard and Lea fell in love, and she called it off with Dennis. She then went on to film The Wizard of Loneliness (1988), which was her first movie as a woman, rather than a youngster. Lea went on to film Back to the Future Part II (1989) and an episode of Tales from the Crypt (1989). She then married Howard Deutch. She continued filming Back to the Future Part III (1990), Montana (1990), and Article 99 (1992). Lea then took a break to stay home with her first born, Madelyn Deutch. She jumped back into acting in Dennis the Menace (1993), where she says she just played herself. Then it was on to The Beverly Hillbillies (1993), Stolen Babies (1993), The Little Rascals (1994), and The Substitute Wife (1994). In 1994, she had her second child, Zoey Deutch. Lea then went into filming The Unspoken Truth (1995). It was then that she was first given the script of a new NBC sitcom, Caroline in the City (1995). It was probably the best decision Lea ever made. She won a People's Choice Award for best actress in a new sitcom. Unfortunately, with all of NBC's problems, Caroline in the City (1995) kept being moved to a worse and worse time slot, giving it horrible ratings. The show ended after only four seasons. Bad ideas from the creators (Julia, etc.) didn't help, either. Lea quickly went onto The Right to Remain Silent (1996), The Unknown Cyclist (1998), and A Will of Their Own (1998). She also guest-starred in the Friends (1994) episode, Friends: The One with the Baby on the Bus (1995), as \"Caroline Duffy\", and on The Larry Sanders Show (1992). Lea also did some stage work, including starring as \"Sally Bowles\" in \"Cabaret\". The show toured and also appeared on Broadway. She then did \"The Vagina Monologues\" in L.A. She had a stint in a dramatic role as a Chief Deputy Assistant District Attorney, \"Camille Paris\", on For the People (2002). Thompson has starred in more than 30 films, 25 television movies, 4 television series, more than 20 ballets, and starred on Broadway in \"Cabaret\". Lea can currently be seen on ABC Family's Peabody Award winning hit show \"Switched at Birth,\" where she acts and directs. Lea's movie credits include: \"All the Right Moves,\" \"Red Dawn,\" \"Some Kind of Wonderful,\" \"The Beverly Hillbillies,\" \"Howard The Duck\"(star and vocals), Clint Eastwood's \"J. Edgar;\" the 2014 Sundance favorite \"Ping Pong Summer;\" and soon to be released \"Left Behind\" starring Nicolas Cage. Lea lives in Los Angeles with her husband of twenty-five years, film/television director Howard Deutch, and their two talented daughters, Madelyn and Zoey, along with many dogs, fish, horses, chickens, a cat, tortoise, and parrot. She supports and often performs for breast cancer, mental health, and Alzheimer's charities. Lea is currently in pre-production on \"The Year of Spectacular Men\", a film written by her daughter Madelyn Deutch, and is writing her first book of essays. Lea Thompson will partner with international Mirrorball Trophy holder Artem Chigvintsev on the 19th season of \"Dancing With The Stars.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5ODcyODUwMl5BMl5BanBnXkFtZTgwMTA3MDg1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000670","name":"Lea Thompson","idIMDB":"nm0000670"},"actorId":"nm0000670","character":"Maudie McMinn","urlCharacter":"http://www.imdb.com/character/ch0028346","main":true},{"actorName":"Julie Mond","urlProfile":"http://www.imdb.com/name/nm1408967","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4OTMxNDkzMl5BMl5BanBnXkFtZTgwODkxNzg0MDE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"bio":"Julie Mond is an actress and producer, known for Priest (2011), Un amour à construire (2011) and Exit Speed (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4OTMxNDkzMl5BMl5BanBnXkFtZTgwODkxNzg0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1408967","name":"Julie Mond","idIMDB":"nm1408967"},"actorId":"nm1408967","character":"Merideth Cole","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alice Greczyn","urlProfile":"http://www.imdb.com/name/nm1445490","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMzY3NDQxNl5BMl5BanBnXkFtZTcwNDQ0MzgwNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 February 1986","placeOfBirth":" Walnut Creek, California, USA","birthName":"Alice Hannah Meiqui Greczyn","height":"5' 7\" (1.7 m)","bio":"Born in Walnut Creek, California, (USA) Alice Greczyn grew up mainly in the mid-west until finally landing in Colorado. She had no idea that she would stumble into life as an actress. Starring in television shows and films had not even crossed her mind. Instead, her childhood goal was to compete as a figure skater. As she got a little older her focus shifted to more humanitarian purposes, which led her to attend college with plans of being a nurse or paramedic. That all changed when Greczyn was approached by a talent manager in Colorado, who then set her career in motion. Greczyn spends most of her off time traveling, whether it's to visit with family or visit places as far as Mongolia. Her true passion is cooking and exploring other cultures. Greczyn's stunning exotic beauty stems from a unique European-Asian blend of ethnicity.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMzY3NDQxNl5BMl5BanBnXkFtZTcwNDQ0MzgwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1445490","name":"Alice Greczyn","idIMDB":"nm1445490"},"actorId":"nm1445490","character":"Annabel Drake","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fred Ward","urlProfile":"http://www.imdb.com/name/nm0911542","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NDg0MTE2MF5BMl5BanBnXkFtZTcwNzMwODQ1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 December 1942","placeOfBirth":" San Diego, California, USA","birthName":"Freddie Joe Ward","height":"5' 9½\" (1.77 m)","bio":"A marvelous character actor with intense eyes, a sly grin and somewhat grizzled appearance, Golden Globe-winner Fred Ward has nearly 90 appearances under his belt in many tremendous films. He first became interested in acting after serving three years in the US Air Force and studied at New York's Herbert Berghof Studio. Ward then went to Europe, where he dubbed many Italian movies, and first appeared on-screen in two films by Roberto Rossellini. He then returned to the United States, and got his first decent role alongside Clint Eastwood in the nail-biting prison film Escape from Alcatraz (1979). Ward's looks often saw him cast as law enforcement or military characters, and he put in noteworthy performances in Southern Comfort (1981), Uncommon Valor (1983), as astronaut Gus Grissom in The Right Stuff (1983) and scored the lead in the interesting spy / martial arts movie Remo Williams: The Adventure Begins (1985), which unfortunately was not as successful as had been the mega-selling series of Remo Williams books. However, during \"Remo\", Ward demonstrated a great knack for comedic timing and satirical performance, and used this ability was to great effect in several films, including playing Kevin Bacon's fellow giant-worm-fighting handyman in the light-hearted sci-fi hit Tremors (1990), as \"Walter Stuckel\" in Robert Altman's The Player (1992), as TV anchorman \"Chip Daley\" in Tim Robbins' razor-sharp political satire Bob Roberts (1992) and as a vicious, but incompetent, gangster menacing Leslie Nielsen in Naked Gun 33 1/3: The Final Insult (1994). Ward's abilities as both a strong supporting actor and a truly versatile character actor ensured that he would be in steady demand, and he has continued to turn up in a wide variety of roles utilizing his skills. Keep an eye out for Fred Ward in the action-filled The Chaos Factor (2000), as David Spade's dad in Joe Dirt (2001), in the tongue-in-cheek Corky Romano (2001) and in the Reese Witherspoon romantic tale Sweet Home Alabama (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NDg0MTE2MF5BMl5BanBnXkFtZTcwNzMwODQ1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0911542","name":"Fred Ward","idIMDB":"nm0911542"},"actorId":"nm0911542","character":"Sergeant Archie Sparks","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gregory Jbara","urlProfile":"http://www.imdb.com/name/nm0419813","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMjIwMDQxOF5BMl5BanBnXkFtZTgwNTE0NTk1MDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1961","placeOfBirth":" Westland, Michigan, USA","height":"6' 2½\" (1.89 m)","bio":"Born and raised in suburban Detroit, Gregory Jbara transferred from the University of Michigan School of Music musical theatre program to complete his BFA in acting at the Juilliard School. Jbara won the 2009 Tony®, Outer Critics Circle and Drama Desk Awards for Best Featured Actor in a Musical originating the role of \"Jackie Elliot\" in the Broadway production of Billy Elliot. He also starred on Broadway as \"Billy Flynn\" in the Tony Award winning revival of Chicago. He originated the role of \"Andre Thibault\" in the Broadway musical comedy Dirty Rotten Scoundrels, also starring John Lithgow, Norbert Leo Butz, Sherie Rene Scott, Joanna Gleason, and Sara Gettelfinger. Other Broadway musical roles originated by Jbara are \"Squash Bernstein\" in Victor/Victoria, starring Julie Andrews, and that of dimwitted catcher \"Sohovik\" in the Damn Yankees revival starring Bebe Neuwirth, Victor Garber, and Jerry Lewis. Jbara received the BackStageWest Garland 2000 Award for his performance in the West Coast Premiere of George Furth's Precious Sons with Nora Dunn. Other stage credits include: \"Mr. Bunder\" in the West Coast premiere of Michael John LaChiusa's Little Fish at the Blank Theatre, \"Vinnie\" in the Geffen Playhouse Premiere of Neil Simon's Felix & Oscar; \"Ike/Bess Truman\" in the West Coast Premiere of LaChiusa's First Lady Suite; \"Clark Gable\" in The Blank Theatre Company's Living Room Series presentation of Mark Saltzman's new play, Mr. Shaw Goes To Hollywood; \"Chick Clark\" in Wonderful Town for City Center Encores; the Broadway revival of Born Yesterday with Edward Asner and Madeline Kahn; Serious Money with Alec Baldwin and Kate Nelligan; Privates On Parade with Jim Dale and Simon Jones; Forever Plaid, Das Barbecu, and Have I Got A Girl For You!. Additional film and TV credits include: The Pied Piper and The Young Indiana Jones Chronicles. Jbara is the voice of the animatronic radio newscaster in Epcot Center's Spaceship Earth. Disney animated feature credits include \"Bruiser/Thug Chorus\" in Tangled, featured chorus in Enchanted and \"Willie 3/Chorus\" in Home On The Range. He also sang Randy Newman's, \"You've Got a Friend In Me\" from Toy Story for U.S. Olympic Ice Skater, Michelle Kwan's 75 Years Of Disney Music/TV Special. Jbara appeared as \"Kenny\" in the Carnegie Hall concert version of Very Warm For May with Jon Lovitz for conductor/director John McGlinn. Recordings include the Broadway cast recordings of Dirty Rotten Scoundrels, Victor/Victoria and Damn Yankees!; Little Fish on Ghostlight Records; First Lady Suite on PS Classics; Brigadoon and Annie Get Your Gun on EMI; A Broadway Christmas, Unsung Musicals II, Unsung Berlin, Peter Pan, and Drat The Cat! on Varese/Sarabande; Enchanted, Tangled and Home On The Range for Disney. Jbara was the narrator for Ripley's Believe it Or Not on TBS, and his voice is featured on the Best Of Ripley's DVD release. Jbara resides with his wife Julie and their sons Zachary and Aidan in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMjIwMDQxOF5BMl5BanBnXkFtZTgwNTE0NTk1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0419813","name":"Gregory Jbara","idIMDB":"nm0419813"},"actorId":"nm0419813","character":"Jerry Yarbro","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Rees Snell","urlProfile":"http://www.imdb.com/name/nm0811027","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MjI2OTgyOV5BMl5BanBnXkFtZTYwNDQxNzgz._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 August 1966","placeOfBirth":" Wichita, Kansas, USA","height":"6' (1.83 m)","bio":"David Rees Snell was born on August 20, 1966 in Wichita, Kansas, USA. He is an actor, known for The Shield (2002), The Beacon (2009) and Exit Speed (2008). He is married to Melanie Myers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MjI2OTgyOV5BMl5BanBnXkFtZTYwNDQxNzgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0811027","name":"David Rees Snell","idIMDB":"nm0811027"},"actorId":"nm0811027","character":"Danny Gunn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kelli Dawn Hancock","urlProfile":"http://www.imdb.com/name/nm1631127","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMDQxNDM4MF5BMl5BanBnXkFtZTgwNzQyNDU3ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Kelli Dawn Hancock is an actress, known for Gridiron Gang (2006), Exit Speed (2008) and The Beacon (2009). She has been married to Asante Jones since May 8, 2004.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMDQxNDM4MF5BMl5BanBnXkFtZTgwNzQyNDU3ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1631127","name":"Kelli Dawn Hancock","idIMDB":"nm1631127"},"actorId":"nm1631127","character":"Desiree","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nick Sowell","urlProfile":"http://www.imdb.com/name/nm2119811","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MjUyNzAyMF5BMl5BanBnXkFtZTcwMzU3MzMzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 November 1979","placeOfBirth":" Lubbock, Texas, USA","height":"6' 1\" (1.85 m)","bio":"Nick Sowell, born in Lubbock, Texas, later raised in Dallas, Texas. He is one of four siblings, all of whom are adopted. Nick attended The Forman School for high school in Litchfield, CT and later went on to attend Lubbock Christian University with a concentration in Mass Communications in Lubbock, Texas. After which, he attended The Los Angeles Film School's 1-year film immersion program where he majored in Production Design and minored in Screen Writing. Nick is an avid fan of the Texas Tech University football team and the Dallas Mavericks basketball team.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MjUyNzAyMF5BMl5BanBnXkFtZTcwMzU3MzMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2119811","name":"Nick Sowell","nicknames":["Spider"],"idIMDB":"nm2119811"},"actorId":"nm2119811","character":"Duke","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Everett Sifuentes","urlProfile":"http://www.imdb.com/name/nm0797391","urlPhoto":"","biography":{"bio":"Everett Sifuentes is an actor, known for Selena (1997), Elvis and Anabelle (2007) and Exit Speed (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0797391","name":"Everett Sifuentes","idIMDB":"nm0797391"},"actorId":"nm0797391","character":"Mr. Vargas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wally White","urlProfile":"http://www.imdb.com/name/nm1174681","urlPhoto":"","biography":{"dateOfBirth":"14 October 1969","placeOfBirth":" Eden, North Carolina, USA","bio":"Wally White was born on October 14, 1969 in Eden, North Carolina, USA. He is known for his work on Hollywood Heights (2012), Guiding Light (1952) and Almost Midnight (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1174681","name":"Wally White","idIMDB":"nm1174681"},"actorId":"nm1174681","character":"Walter Lindley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danielle Wheeler","urlProfile":"http://www.imdb.com/name/nm2677233","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjc2ZjU3YjItMjdmMi00YmEyLThhYWUtNThmZDk1MmZmODAwXkEyXkFqcGdeQXVyNDg1NTU4NzU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Danielle Wheeler is an actress and producer, known for Exit Speed (2008), Myself According to I (2015) and The Mink Catcher (2015). She has been married to Brendon Wheeler since September 2, 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjc2ZjU3YjItMjdmMi00YmEyLThhYWUtNThmZDk1MmZmODAwXkEyXkFqcGdeQXVyNDg1NTU4NzU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2677233","name":"Danielle Wheeler","nicknames":["Dani"],"idIMDB":"nm2677233"},"actorId":"nm2677233","character":"Joey Ryan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Asante Jones","urlProfile":"http://www.imdb.com/name/nm1389997","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEyNjc0NjY1MV5BMl5BanBnXkFtZTgwOTMzMjQ0ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 August 1968","placeOfBirth":" Cleveland, Ohio, USA","height":"5' 10\" (1.78 m)","bio":"Though now living in Los Angeles, Asante hails from Cleveland, Ohio. Acting has been his life long dream. At the age of seven, he visited his cousin, Greg Morris of Mission Impossible fame, in Beverly Hills. He remembers distinctly thinking, \"whatever he did to get a pool in his back yard, I'm doing it.\" Born in 1968, Asante graduated from John Marshall High School in 1986. He then spent four years at Cleveland's world famous Karamu House Theater, the theater home of Langston Hughes. Honing his skills as both an actor and a lighting technician, the latter skill allowed him to go on tour with Shelly Garrett Entertainment in November of 1992 with the raucously funny Beauty Shop Part 2. While on tour, Asante's room mate was Academy Award Nominee, Michael Clarke Duncan. Asante finally made it to LA in September of 1996. After about ten months of effort, he decided to go to Singapore with Disney as the Master Electrician of DisneyFest Asia, which was the largest tour on the planet at the time. Returning to LA in March of 1998, Asante began making some inroads in his 'Hollywood' acting career. Appearing in Starring and Supporting roles in several low budget films, he was able to develop a resume and gain invaluable on camera experience. More recently, Asante has stepped up to the plate by guest-starring on TV shows such as Naval CIS (with Mark Harmon), I'm With Her (with Teri Polo and David Sutcliffe) and Malcolm in the Middle (with Frankie Muniz). Also look for his earlier appearance on Diagnosis Murder. Asante is also actively working to sell his screenplay, Undying Love, while working on his second screenplay.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEyNjc0NjY1MV5BMl5BanBnXkFtZTgwOTMzMjQ0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1389997","name":"Asante Jones","idIMDB":"nm1389997"},"actorId":"nm1389997","character":"Sheriff Tom Jasper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roy Samuelson","urlProfile":"http://www.imdb.com/name/nm1998284","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzY1NDI4ODE0MV5BMl5BanBnXkFtZTgwMTY0ODQzMTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Over a billion ears have heard Roy Samuelson. He's a regularly working voice actor and narrator, represented by VOX. In addition to thousands of promos on Los Angeles NPR station KCRW, his voice work is diversified. Video game credits include Nickelodeon's Teenage Mutant Ninja Turtles as \"Raphael,\" XCOM- Enemy Unknown, and Final Fantasy: Lightening Returns. Commercially, he's voiced Intel tags during the Super Bowl and Academy Awards. Major brands include Quaker State, State Farm, Direct TV, Ford Focus, and multiple spots for McDonalds. Notable VO TV credits include \"Last Week Tonight,\" \"Librarians\" with John Laroquette, and \"American Horror Story\" opposite Jessica Lange. In an upcoming feature film he voice matches a top celebrity. Narration credits are for the feature film \"Fury\" starring Brad Pitt, the special \"Toy Story of Terror,\" multiple IMAX films, several episodes of Gang Related for FOX, and Destination America's \"Cheating Vegas\" series. In Comcast Stand Up To Cancer campaign, he sounds like a warm voice of reason. On Rent-A-Center, he's your best friend. On Sketchers shoes, he's your Dad. He works fast without sounding like it; recording up to 6 Radio promo spots in the 1/2 an hour from the time he receives the scripts. His VO studio has ISDN.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzY1NDI4ODE0MV5BMl5BanBnXkFtZTgwMTY0ODQzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1998284","name":"Roy Samuelson","idIMDB":"nm1998284"},"actorId":"nm1998284","character":"Vic Towbridge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Denise Lee","urlProfile":"http://www.imdb.com/name/nm1161281","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MTU3Njg3MF5BMl5BanBnXkFtZTgwOTM3MjI1NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7½\" (1.71 m)","bio":"Denise Lee is an actress, known for Le dernier exorcisme (2010), Mad Money (2008) and The Lawn Boy (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MTU3Njg3MF5BMl5BanBnXkFtZTgwOTM3MjI1NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1161281","name":"Denise Lee","idIMDB":"nm1161281"},"actorId":"nm1161281","character":"Louella Burton","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1042497","urlIMDB":"http://www.imdb.com/title/tt1042497","business":{"budget":{"money":"$3,750,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"© 2008 HELLHOUNDS, LLC"},"technical":{"runtime":["1 hr 31 min (91 min) (USA)","1 hr 31 min (91 min) (Argentina)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.3","filmingLocations":[{"location":"Dallas, Texas, USA"}],"rated":"R","awards":[{"award":"Motion Picture Sound Editors, USA 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing - Direct to Video","names":[{"name":"George Haddad","id":"nm0352650","role":"supervising sound editor, supervising dialogue editor, foley editor"},{"name":"David Barbee","id":"nm1545749","role":"sound designer, sound effects editor"},{"name":"Bradley C. Katona","id":"nm0441424","role":"sound designer, sound effects editor"},{"name":"Hugh Murphy","id":"nm0614307","role":"supervising foley editor"},{"name":"Edmund J. Lachmann","id":"nm0480052","role":"supervising adr editor, dialogue/adr editor"},{"name":"Giorgio Bertuccelli","id":"nm0078449","role":"music editor"},{"name":"Zane D. Bruce","id":"nm0115601","role":"foley artist"},{"name":"Joseph T. Sabella","id":"nm0754677","role":"foley artist"},{"name":"David Baldwin","id":"nm0049885","role":"sound effects editor"},{"name":"Charlie Kolander","id":"nm1673305","role":"dialogue editor"}]}]}]}],"votes":"1,869","type":"Movie","companyCreditsSimple":[{"idCompany":"co0210355","name":"Sabbatical Pictures"}],"keywords":{"keywords":["texas","bus","motorbike","deserter","murder"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:47:14"}}