{"data":{"movies":[{"title":"Andy Warhol: Re-Reproduction","originalTitle":"","year":"1974","releaseDate":"1974","directors":[{"name":"Toshio Matsumoto","id":"nm0559564"}],"runtime":"23 min","countries":["Japan"],"languages":["None"],"genres":["Short"],"simplePlot":"","actors":[{"actorName":"Andy Warhol","urlProfile":"http://www.imdb.com/name/nm0912238","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MDQ5MTYwOV5BMl5BanBnXkFtZTYwMDY0MjI2._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1928","placeOfBirth":" Forest City, Pennsylvania, USA","birthName":"Andrew Warhola","height":"5' 11\" (1.8 m)","bio":"Andrew Warhol's father, Ondrej, came from the Austria-Hungary Empire (now Slovakia) in 1912, and sent for his mother, Julia Zavacky Warhola, in 1921. His father worked as a construction worker and later as a coal miner. Around some time, the family moved to Pittsburgh. During his teenage years, Andy suffered from several nervous breakdowns. Overcoming this, he graduated from Schenley High School in Pittsburgh in 1945, and enrolled in the Carnegie Institute of Technology (now Carnegie-Mellon University), graduating in June 1949. During college, he met Philip Pearlstein, a fellow student. After graduation, Andy Warhol (having dropped the letter 'a' from his last name) moved to New York City, and shared an apartment with Pearlstein at St. Mark's Place off of Avenue A for a couple months. During this time, he moved in and out of several Manhattan apartments. In New York, he met Tina Fredericks, art editor of Glamour Magazine. Warhol's early jobs were doing drawings for Glamour, such as the Success is a Job in New York, and women's shoes. He also drew advertising for various magazines, including Vogue, Harper's Bazzar, book jackets, and holiday greeting cards. During the 1950s, he moved to an apartment on East 75th Street. His mother moved in with him, and Fritizie Miller become his agent. In 1952, his first solo exhibition was held at Hugo Gallery, New York, of drawings to illustrate stories by Truman Capote. He started illustrating books, beginning with Amy Vanderbilt's Complete Book of Etiquette. Around 1953-1955, he worked for a theater group on the Lower East Side, and designs sets. It is around that time that he dyed his hair silver. Warhol published several books, including Twenty Five Cats Named Sam, and One Blue Pussy. In 1956, he traveled around the world with Charles Lisanby, a television-set designer. In April of this year, he was included in his first group exhibition, Recent Drawings USA, held at the Museum of Modern Art, New York. He began receiving accolades for his work, with the 35th Annual Art Directors Club Award for Distinctive Merit, for an I.Miller shoe advertisement. He published In The Bottom Of My Garden later that year. In 1957, received 36th Annual Art Directors Club Medal and Award of Distinctive Merit, for the I.Miller show advertisements, and Life Magazine published his illustrations for an article, \"Crazy Golden Slippers\". In 1960, Warhol began to make his first paintings. They were based on comic strips in the likes of Dick Tracy, Popeye, Superman, and two of Coca-Cola bottles. In 1961, using the Dick Tracy comic strip, he designed a window display for Lord & Taylor, at this time, major art galleries around the nation begin noticing his work. In 1962, Warhol made paintings of dollar bills and Campbell soup cans, and his work was included in an important exhibition of pop art, The New Realists, held at Sidney Janis Gallery, New York. In November of this year, Elanor Ward showed his paintings at Stable Gallery, and the exhibition began a sensation. In 1963, he rented a studio in a firehouse on East 87th Street. He met his assistant, Gerard Malanga, and started making his first film, Tarzan and Jane Regained... Sort of (1964). Later, he drove to Los Angeles for his second exhibition at the Ferus Gallery. In November of that year, he found a loft at 231 East 47th Street, which became his main studio, The Factory. In December, he began production of Red Jackie, the first of the Jackie series. In 1964, his first solo exhibition in Europe, held at the Galerie Ileana Sonnebend in Paris, featured the Flower series. He received a commission from architect Philip Johnson to make a mural, entitled Thirteen Most Wanted Men for the New York State Pavilion in the New York World's Fair. In April, he received an Independent Film Award from Film Culture magazine. In November, his first solo exhibition in the US was held at Leo Castelli Gallery. And at this time, he began his self portrait series. In the summer of 1965, Andy Warhol met Paul Morrissey, who became his advisor and collaborator. His first solo museum exhibition was held at the Institute of Contempary Art, at the University of Pennsylvania. During this year, he made a surprise announcement of his retirement from painting, but it was to be short lived. He would resume painting again in 1972. It was around this time that he met Lou Reed, John Cale, Sterling Morrison, and Maureen Tucker (collectively known as The Velvet Underground), and a German-born model turned chanteuse called Nico. He paired Nico with the Velvets, and they developed a close bond with Warhol. This was an alliance that forever changed the face of world culture. Warhol produced the group's first album, The Velvet Underground and Nico, which has been called \"the most influential record ever\" by many critics. Later, a multimedia show developed (called The Exploding Plastic Inevitable), managed, and produced by Warhol, featuring the Velvet Underground. In the summer of 1966, Warhol's film Chelsea Girls (1966) became the first underground film to be shown at a commercial theater. In 1967, Chelsea Girls opened in Los Angeles and San Francisco, and six of his Self Portraits were shown at Expo 67 in Montreal, Quebec, Canada. In August of this year, he gave a lecture at various colleges in the Los Angeles area, his persona is so popular that some colleges hire Allen Midgette to impersonate him for lectures. Later, Warhol moved The Factory to 33 Union Square West, and met Fred Hughes, who later became President of Enterprises, and Interview Magazine. In 1968, Warhol's first solo European museum exhibition was held at Moderna Museet, Stockholm. But later that year on June 3, 1968, Warhol was shot by Valerie Solanas, an ultra-radical and member of the entourage surrounding Warhol. Solanis was the founder of SCUM (Society for Cutting Up Men) Fortunately, Warhol survived the assassination attempt after spending two months in a hospital. This incident is the subject of the film, I Shot Andy Warhol (1996). Afterwards, Andy Warhol dropped out of the filmmaking business, but now and then continued his contribution to film and art. He never emotionally recovered from his brush with death. During the 1970s and 80s, Andy Warhol's status as a media icon skyrocketed, and he used his influence to back many younger artists. He began publishing of Interview magazine, with the first issue being released in fall of 1969. In 1971, his play, entitled Pork, opened at London at the Round House Theatre. He resumed painting in 1972, although it was primarily celebrity portraits. The Factory was moved to 860 Broadway, and in 1975, he bought a house on Lexington Street. A major retrospective of his work is held in Zurich. In 1976, he did the Skulls, and Hammer and Sickle series. Throughout the late 70s and 80s, a retrospective exhibition was held, as Warhol began work on the Reversals, Retrospectives, and Shadows series. The Myths series, Endangered Species series, and Ads series followed through the early and mid 1980s. On 22 February 1987, a \"day of medical infamy\", as quoted by one biographer, Andy Warhol died following complications from gall bladder surgery. He was 58 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MDQ5MTYwOV5BMl5BanBnXkFtZTYwMDY0MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0912238","name":"Andy Warhol","nicknames":["Drella"],"idIMDB":"nm0912238"},"actorId":"nm0912238","character":"Himself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1096849","urlIMDB":"http://www.imdb.com/title/tt1096849","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["23 min"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.0","filmingLocations":[],"awards":[],"votes":"33","type":"Movie","companyCreditsSimple":[],"keywords":{"keywords":["experimental film","avant garde"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:58:57"}}