{"data":{"movies":[{"title":"Planet Terror","originalTitle":"","year":"2007","releaseDate":"20070814","directors":[{"name":"Robert Rodriguez","id":"nm0001675"}],"writers":[{"name":"Robert Rodriguez","id":"nm0001675"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODdmNmM2ZTgtODM1MS00ZGMxLTk3MTMtMGQ1ODZhMTQ1NWEwL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Comedy","Horror","Thriller"],"plot":"After an experimental bio-nerve gas is accidentally released at a remote U.S. military base in Texas, those exposed to the gas turn into flesh-eating, mutating zombies out to kill. An assortment of various people who include stripper Cherry, her shady mechanic ex-boyfriend Wray, a strong-willed doctor, the local sheriff, and an assortment of various people must join forces to survive the night as the so-called \"sickos\" threaten to take over the whole town and the world.","simplePlot":"After an experimental bio-weapon is released, turning thousands into zombie-like creatures, it's up to a rag-tag group of survivors to stop the infected and those behind its release.","actors":[{"actorName":"Rose McGowan","urlProfile":"http://www.imdb.com/name/nm0000535","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyOTQzODM3OF5BMl5BanBnXkFtZTgwMzc0NjM0ODE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 September 1973","placeOfBirth":" Florence, Tuscany, Italy","birthName":"Rose Arianna McGowan","height":"5' 4\" (1.63 m)","bio":"Rose McGowan is an American actress and director, known for her contribution to independent film. Since the age of nineteen, she has appeared in acclaimed films by Gregg Araki, Wes Craven, Brian De Palma, Robert Rodriguez and Quentin Tarantino. In 2014, her directorial debut Dawn (2014) was nominated for the Short Film Grand Jury Prize at the Sundance Film Festival. Rose Arianna McGowan was born on September 5, 1973 in Florence, Tuscany, Italy, to American parents Terri and Daniel Patrick McGowan. She is the second eldest of six siblings, and has Irish, French, and English ancestry. As a young child, she was raised within the Italian chapter of the Children of God. During the early 1980s, her family severed ties with the community and migrated to Eugene, Oregon, USA. Following the divorce of her parents, Rose relocated to Gig Harbor, Washington, to live with her grandmother. At age 14, McGowan was accused of drug use by a family friend and committed to rehabilitation. She has consistently maintained the decision was unjustified. Upon release, she spent a year without a home and was emancipated from her parents by the age of 15. McGowan's career as an actor began with The Doom Generation (1995). Originally intended for Jordan Ladd, the character of Amy Blue was, coincidentally, awarded to McGowan by an associate of director Gregg Araki. For her performance, she was nominated at the 1995 Independent Spirit Awards for Best Debut Performance. Subsequently cast in Wes Craven's Scream (1996), she experienced further success when the project defied expectations to become one of the highest grossing films of the year. The innovative career of McGowan was overshadowed throughout much of the 1990s by her high-profile relationship with musician Brian Warner (aka Marilyn Manson). Strong performances in Going All the Way (1997), Lewis & Clark & George (1997), Southie (1998) and Jawbreaker (1999) were largely unseen by the general public. When the relationship ended between Rose and Manson in 2001, she remarked: \"There is great love, but our lifestyle difference is, unfortunately, even greater\". Rose continued to work solidly, appearing in a string of soft-sounding studio and independent films. Performances from this period included: a political activist in Showtime's The Killing Yard (2001), a grifter in Strange Hearts (2002) and a factory worker in \"Stealing Bess\" (aka Vacuums (2003)). She was re-introduced to the mainstream as Paige Matthews in Aaron Spelling's Charmed (1998), a popular television series for which she devoted five consecutive years. When \"Charmed\" finished its run in 2006, McGowan emerged in top form. Critics praised her efforts in Robert Rodriguez's Planet Terror (2007), and Quentin Tarantino's Death Proof (2007). In several interviews, McGowan has expressed a general apathy and disdain for Hollywood. Despite this, her work ethic remains strong. Following her recent marriage to LA-based artist Davey Detail, the actress has resolved to purse further projects as a director.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyOTQzODM3OF5BMl5BanBnXkFtZTgwMzc0NjM0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000535","name":"Rose McGowan","idIMDB":"nm0000535"},"actorId":"nm0000535","character":"Cherry Darling","urlCharacter":"http://www.imdb.com/character/ch0027443","main":true},{"actorName":"Freddy Rodríguez","urlProfile":"http://www.imdb.com/name/nm0135585","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMDA2MTA4OV5BMl5BanBnXkFtZTgwMzQzNDI0ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1975","placeOfBirth":" Chicago, Illinois, USA","height":"5' 6\" (1.68 m)","bio":"Freddy Rodríguez was born on January 17, 1975 in Chicago, Illinois, USA. He is an actor and producer, known for Planet Terror (2007), Six Feet Under (2001) and Harsh Times (2005). He has been married to Elsie Rodriguez since December 23, 1995. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMDA2MTA4OV5BMl5BanBnXkFtZTgwMzQzNDI0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0135585","name":"Freddy Rodríguez","idIMDB":"nm0135585"},"actorId":"nm0135585","character":"Wray","urlCharacter":"http://www.imdb.com/character/ch0027438","main":true},{"actorName":"Josh Brolin","urlProfile":"http://www.imdb.com/name/nm0000982","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MzYyMjQ0Nl5BMl5BanBnXkFtZTcwMTA0ODkyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1968","placeOfBirth":" Santa Monica, California, USA","birthName":"Josh J. Brolin","height":"5' 10½\" (1.79 m)","bio":"Rugged features and a natural charm have worked for Josh Brolin, the son of actor James Brolin. He has recently seen a massive surge in his career, finding well-known roles such as a policeman, a hunter, and the President of the United States. Brolin was born February 12, 1968 in Santa Monica, California, to Jane Cameron (Agee), a Texas-born wildlife activist, and James Brolin. Josh was initially against the lifestyle of the entertainment business, in light of his parents' divorce, and both of them being actors. However, during junior year in high school, he took an acting class to see what it was like and played Stanley in \"A Streetcar Named Desire\" and became hooked. His first major screen role was as the older brother in the film The Goonies (1985), based on a story by Steven Spielberg. He then immediately moved on to work on television, taking roles on such series as Alien Private Eye (1988) and The Young Riders (1989). \"Private Eye\" was a chance for Brolin to play a detective. \"The Young Riders\" was set just before the Civil War, and was co-directed by Brolin's father, James Brolin. After The Young Riders (1989), Brolin moved back to the big screen, with mediocre success. He played a supporting role in The Road Killers (1994), but the film was not a success. He followed up with the crime film Gang in Blue (1996), the romantic film Bed of Roses (1996), the thriller film Nightwatch (1997), and appeared with his father in My Brother's War (1997). However, nothing truly stuck out, especially not the box office flop The Mod Squad (1999). The 2000s initially brought no significant change in Brolin's career. He appeared in the independent film Slow Burn (2000), the sci-if thriller Hollow Man (2000) and starred on the television series Mister Sterling (2003). In 2004, he married actress Diane Lane and are still together. It was not until 2007 that Brolin received much acclaim for his films. He took a supporting role in the Quentin Tarantino-written Grindhouse (2007) which was a two-part film accounting two horror stories. He also played two policemen that year: a corrupt officer \"Trupo\" in the crime epic American Gangster (2007), and an honest police chief in the emotional drama In the Valley of Elah (2007) which starred Tommy Lee Jones and was directed by Paul Haggis. However, it was his involvement in No Country for Old Men (2007) that truly pushed him into the limelight. The film, directed by the Coen brothers, was about a man (Brolin) who finds a satchel containing two million dollars in cash. He is pursued by an unstoppable assassin (Javier Bardem, who won an Oscar for his work) and his friend, a local sheriff (Tommy Lee Jones). The film won four Oscars, including Best Picture and Best Director. Brolin found high-profile work the next year, being cast as \"Supervisor Dan White\" in the film Milk (2008). His performance as the weak and bitter politician earned him an Oscar nomination, and Brolin received more praise for his fascinating portrayal of George W. Bush in the Oliver Stone film W. (2008). Despite the mediocre success of W. (2008), he was recognized as the best part of the film, and Milk (2008) was another triumph, critically and commercially. Brolin then acted in the smaller comedy Women in Trouble (2009) before landing a number of large roles in 2010. The first of these was the film based on the comic book figure Jonah Hex (2010). The film was a box office flop and critically panned, but Brolin also forged a second collaboration with legendary director Oliver Stone for Wall Street: Money Never Sleeps (2010). Brolin played a large role alongside such young stars as Carey Mulligan and Shia LaBeouf, and older thespians such as Michael Douglas, Eli Wallach, and Frank Langella. Brolin's character was Bretton James, a top banker in the film, and also the film's chief antagonist. Brolin also appeared in Woody Allen's London-based film You Will Meet a Tall Dark Stranger (2010) and a second collaboration with the Coen Brothers, which was a remake of True Grit (1969). Despite his earlier mediocre success and fame, Brolin has maintained a choosiness in his films and, recently, these choices have paid off profoundly. Hopefully, he continues this streak of good fortune that his talents have finally given him.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MzYyMjQ0Nl5BMl5BanBnXkFtZTcwMTA0ODkyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000982","name":"Josh Brolin","idIMDB":"nm0000982"},"actorId":"nm0000982","character":"Dr. William Block","urlCharacter":"http://www.imdb.com/character/ch0028038","main":true},{"actorName":"Marley Shelton","urlProfile":"http://www.imdb.com/name/nm0005420","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NzU0MDM5NF5BMl5BanBnXkFtZTcwODk3MDY3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1974","placeOfBirth":" Los Angeles, California, USA","birthName":"Marley Eve Shelton","height":"5' 6½\" (1.69 m)","bio":"Marley Eve Shelton was born in Los Angeles, California, and grew up in Eagle Rock, CA. She is the daughter of Carol (Stromme), a teacher and singer, and Christopher Shelton, who worked as a director and producer. She has three sisters: Koren Shelton, Erin Shelton and Samantha Shelton. Both of her parents were involved in local theater projects, but as a teen, Marley was never interested in life on the stage. While at Eagle Rock High School, she was a varsity cheerleader, was voted Prom Queen and held part-time jobs at stores like \"Contempo\" and \"Wet Seal\". Shelton first captured the attention of film-goers as \"Margaret\", Tobey Maguire's love interest, in New Line's critically-acclaimed film, Pleasantville (1998), and has continued to appear in roles that show her versatility as an actress, including in Jerry Bruckheimer's Eleventh Hour (2008) on CBS. Shelton attended UCLA, where she majored in Film and Theatre. She supported herself through small parts in feature films, television movies and episodic appearances. Her \"hobby\" grew into a passion while she studied acting with Larry Moss and, as a result, she decided to pursue a career as an actress. Shelton made her feature debut in Grand Canyon (1991). Since then, she has starred in numerous box office hits, including The Sandlot (1993), Never Been Kissed (1999), The Bachelor (1999), Valentine (2001), Sugar & Spice (2001), Bubble Boy (2001), Just a Kiss (2002), Uptown Girls (2003), Don't Come Knocking (2005), Sin City (2005), Grindhouse (2007), Nixon (1995), Warriors of Virtue (1997), A Perfect Getaway (2009), W. (2008), Women in Trouble (2009) and The Mighty Macs (2009), Elektra Luxx (2010), Scream 4 (2011) and Decoding Annie Parker (2013). Shelton resides in Los Angeles with her husband and two daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NzU0MDM5NF5BMl5BanBnXkFtZTcwODk3MDY3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005420","name":"Marley Shelton","idIMDB":"nm0005420"},"actorId":"nm0005420","character":"Dr. Dakota Block","urlCharacter":"http://www.imdb.com/character/ch0027844","main":true},{"actorName":"Jeff Fahey","urlProfile":"http://www.imdb.com/name/nm0001194","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyODQwNDgwMF5BMl5BanBnXkFtZTcwMjgzNTg2Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1952","placeOfBirth":" Olean, New York, USA","height":"6' (1.83 m)","bio":"Jeff Fahey was born in Olean, New York, one of 13 children of Jane (Gallagher) and Francis Thomas Fahey, who worked in a clothing store. He is of Irish descent. His family moved to Buffalo when he was 10, where he attended Father Baker's High School. After graduation in 1972 he traveled around the world doing odd jobs. He was a crewman on a fishing boat, drove an ambulance in Germany, lived in a kibbutz in Israel and spent some time in India. He then returned to Buffalo and joined the Studio Arena Theatre. From there he went to New York City, where he studied with Myra Rastova, began doing off-Broadway theater and television soap operas. He started a production company and produced off-Broadway shows out of the Raft Theatre on Theatre Row. He first gained attention as a motion picture actor in Lawrence Kasdan's Silverado (1985), in which he played Brian Dennehy's deputy Tyree, a cold-blooded killer with a thirst for vengeance. He starred in the acclaimed live television play The Execution of Raymond Graham (1985) and the TNT mini-series \"44 Days\". He starred for over two years in the daytime serial One Life to Live (1968). He appeared in the Broadway revival of \"Brigadoon,\" toured with \"Oklahoma,\" performed in Paris in \"West Side Story\" and in London in \"Orphans\" with Albert Finney.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyODQwNDgwMF5BMl5BanBnXkFtZTcwMjgzNTg2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001194","name":"Jeff Fahey","idIMDB":"nm0001194"},"actorId":"nm0001194","character":"J.T.","urlCharacter":"http://www.imdb.com/character/ch0038035","main":true},{"actorName":"Michael Biehn","urlProfile":"http://www.imdb.com/name/nm0000299","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2OTI1MTEyOV5BMl5BanBnXkFtZTcwMzM5NTQ4NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1956","placeOfBirth":" Anniston, Alabama, USA","birthName":"Michael Connell Biehn","height":"6' (1.83 m)","bio":"Michael Connell Biehn was born on July 31, 1956 in Anniston, Alabama, to Marcia (Connell) and Don Biehn, a lawyer. He grew up in Lincoln, Nebraska, and at age 14 moved with his family to Lake Havasu, Arizona, where he won a drama scholarship to the University of Arizona. He left prematurely two years later to pursue an acting career in Hollywood. His first big role was as a psychotic fan stalking Lauren Bacall in The Fan (1981) and later appeared in The Lords of Discipline (1983). He hit the big-time when he was cast as Kyle Reese, the man sent back through time to stop Arnold Schwarzenegger in James Cameron's The Terminator (1984). This established a good working relationship with Cameron, a relationship that should have catapulted Biehn to international stardom. He starred in Cameron's subsequent films, Aliens (1986) and The Abyss (1989), the latter a standout performance as unstable Navy SEAL officer Lt. Hiram Coffey. In the 1990s he starred in films like Navy Seals (1990), K2 (1991) and was particularly memorable as Johnny Ringo in Tombstone (1993). Biehn is married and the father of four sons.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2OTI1MTEyOV5BMl5BanBnXkFtZTcwMzM5NTQ4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000299","name":"Michael Biehn","nicknames":["Mike","Mick"],"idIMDB":"nm0000299"},"actorId":"nm0000299","character":"Sheriff Hague","urlCharacter":"http://www.imdb.com/character/ch0030674","main":true},{"actorName":"Rebel Rodriguez","urlProfile":"http://www.imdb.com/name/nm1943565","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwNDk5MzYxMTheQTJeQWpwZ15BbWU3MDYwMDg0MTg@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1999","placeOfBirth":" Austin, Texas, USA","birthName":"Rebel Antonio Rodriguez","bio":"Rebel Rodriguez was born in 1999 in Austin, Texas, USA as Rebel Antonio Rodriguez. He is an actor, known for Planet Terror (2007), Grindhouse (2007) and The Adventures of Sharkboy and Lavagirl 3-D (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwNDk5MzYxMTheQTJeQWpwZ15BbWU3MDYwMDg0MTg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1943565","name":"Rebel Rodriguez","idIMDB":"nm1943565"},"actorId":"nm1943565","character":"Tony Block","urlCharacter":"http://www.imdb.com/character/ch0054121","main":true},{"actorName":"Bruce Willis","urlProfile":"http://www.imdb.com/name/nm0000246","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MjMzMTE5OF5BMl5BanBnXkFtZTcwMzQ2ODE3Mw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 March 1955","placeOfBirth":" Idar-Oberstein, West Germany","birthName":"Walter Bruce Willis","height":"6' (1.83 m)","bio":"Actor and musician Bruce Willis is well known for playing wisecracking or hard-edged characters, often in spectacular action films. Collectively, he has appeared in films that have grossed in excess of $2.5 billion USD, placing him in the top ten stars in terms of box office receipts. Walter Bruce Willis was born on March 19, 1955, in Idar-Oberstein, West Germany, to a German mother, Marlene K. (from Kassel), and an American father, David Andrew Willis (from Carneys Point, New Jersey), who were then living on a United States military base. His family moved to the U.S. shortly after he was born, and he was raised in Penns Grove, New Jersey, where his mother worked at a bank and his father was a welder and factory worker. Willis picked up an interest for the dramatic arts in high school, and was allegedly \"discovered\" whilst working in a café in New York City and then appeared in a couple of off-Broadway productions. While bartending one night, he was seen by a casting director who liked his personality and needed a bartender for a small movie role. After countless auditions, Willis contributed minor film appearances, usually uncredited, before landing the role of private eye \"David Addison\" alongside sultry Cybill Shepherd in the hit romantic comedy television series Moonlighting (1985). The series firmly established Bruce Willis as a hot new talent, and his sarcastic and wisecracking P.I. was in effect a dry run for the role of hard-boiled NYC detective \"John McClane\" in the monster hit Die Hard (1988). This superbly paced action film balanced laconic humor and wholesale destruction as Willis' character single handedly battles a gang of ruthless international thieves in a Los Angeles skyscraper. Willis reprized the role of tough guy cop \"John McClane\" in the eagerly anticipated sequel Die Hard 2 (1990) set at snowbound Washington's Dulles International Airport as a group of renegade Special Forces soldiers seek to repatriate a corrupt South American general. Excellent box office returns demanded a further sequel Die Hard with a Vengeance (1995) this time also starring Samuel L. Jackson as a cynical Harlem shopowner unwittingly thrust into assisting McClane during a terrorist bombing campaign on a sweltering day in NYC. Willis found time out from all the action mayhem to provide the voice of \"Mikey\" the baby in the very popular family comedies Look Who's Talking (1989), and its sequel Look Who's Talking Too (1990) also starring John Travolta and Kirstie Alley. Over the next decade, Willis starred in some very successful films, some very offbeat films and some unfortunate box office flops. The Bonfire of the Vanities (1990) and Hudson Hawk (1991) were both large scale financial disasters that were savaged by the critics, and both are arguably best left off the CVs of all the actors involved, however Willis was still popular with movie audiences and selling plenty of theatre tickets with the hyperviolent The Last Boy Scout (1991), the darkly humored Death Becomes Her (1992) and the mediocre police thriller Striking Distance (1993). During the 1990s, Willis also appeared in several independent and low budget productions that won him new fans and praise from the critics for his intriguing performances working with some very diverse film directors. He appeared in the oddly appealing North (1994), as a cagey prizefighter in the Quentin Tarantino directed mega-hit Pulp Fiction (1994), the Terry Gilliam directed apocalyptic thriller Twelve Monkeys (1995), the Luc Besson directed sci-fi opus The Fifth Element (1997) and the M. Night Shyamalan directed spine-tingling epic The Sixth Sense (1999). Willis next starred in the gangster comedy The Whole Nine Yards (2000), worked again with \"hot\" director M. Night Shyamalan in the less gripping Unbreakable (2000), and in two military dramas, Hart's War (2002) and Tears of the Sun (2003) that both failed to really fire with movie audiences or critics alike. However, Willis bounced back into the spotlight in the critically applauded Frank Miller graphic novel turned movie Sin City (2005), the voice of \"RJ\" the scheming raccoon in the animated hit Over the Hedge (2006) and \"Die Hard\" fans rejoiced to see \"John McClane\" return to the big screen in the high tech Live Free or Die Hard (2007) aka \"Die Hard 4.0\". Willis was married to actress Demi Moore for approximately thirteen years and they share custody to their three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MjMzMTE5OF5BMl5BanBnXkFtZTcwMzQ2ODE3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000246","name":"Bruce Willis","nicknames":["Bruno"],"idIMDB":"nm0000246"},"actorId":"nm0000246","character":"Lt. Muldoon","urlCharacter":"http://www.imdb.com/character/ch0034382","main":true},{"actorName":"Naveen Andrews","urlProfile":"http://www.imdb.com/name/nm0004710","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk4MzU0MTcwNl5BMl5BanBnXkFtZTgwMTQ3OTI1MDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1969","placeOfBirth":" London, England, UK","birthName":"Naveen William Sidney Andrews","height":"5' 9\" (1.75 m)","bio":"Born Naveen William Sidney Andrews in London on January 17, 1969. His parents were both Indian immigrants from Kerala, India. In high school, he auditioned for drama school and was accepted at London's Guildhall School of Music and Drama. Two of his classmates were Ewan McGregor and David Thewlis . His studies paid off when he won a role in Hanif Kureshi's film, London Kills Me (1991). He is best known for his role as that 'Sikh bloke' in The English Patient (1996) and as Sayid in the popular television series Lost (2004). He splits his time between homes in Los Angeles and Hawaii, where Lost (2004) was filmed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk4MzU0MTcwNl5BMl5BanBnXkFtZTgwMTQ3OTI1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004710","name":"Naveen Andrews","idIMDB":"nm0004710"},"actorId":"nm0004710","character":"Abby","urlCharacter":"http://www.imdb.com/character/ch0030677","main":true},{"actorName":"Julio Oscar Mechoso","urlProfile":"http://www.imdb.com/name/nm0575339","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMjYzMTg3OF5BMl5BanBnXkFtZTYwNjgzNjE1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1955","placeOfBirth":" Florida, USA","bio":"Julio Oscar Mechoso was born on May 31, 1955 in Florida, USA. He is an actor, known for Little Miss Sunshine (2006), The Legend of Zorro (2005) and Jurassic Park III (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMjYzMTg3OF5BMl5BanBnXkFtZTYwNjgzNjE1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0575339","name":"Julio Oscar Mechoso","idIMDB":"nm0575339"},"actorId":"nm0575339","character":"Romy","urlCharacter":"http://www.imdb.com/character/ch0056085","main":true},{"actorName":"Fergie","urlProfile":"http://www.imdb.com/name/nm0004914","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNzExMTU1M15BMl5BanBnXkFtZTcwODkyMjIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 March 1975","placeOfBirth":" Whittier, California, USA","birthName":"Stacy Ann Ferguson","height":"5' 4\" (1.63 m)","bio":"Stacy Ann Ferguson was born in Hacienda Heights, California, to Theresa Ann (Gore) and Jon Patrick Ferguson, both schoolteachers. Her ancestry includes Scottish, English, Irish, German, Swedish, and Luxembourgian. When she was a teenager, her parents divorced, which was a big challenge for a girl who wanted to be a star. As a child actress, she appeared on the television program Kids Incorporated (1984) for several years with Renee Sands. Later, Ferguson was a member of the female trio Wild Orchid, which she fronted with fellow Kids Incorporated (1984) star Renee Sands and Stefanie Ridel. Wild Orchid released two albums, but after completing a third album, their record label declined to release it. This prompted an emotional crisis, and Ferguson sought therapy. She left the group shortly thereafter. In 2003, she was invited for a part in The Black Eyed Peas' song \"Hey Mama.\" The members of the group were so impressed by her performance that she became the fourth member of the band. Since then, she's mostly known as \"Fergie.\" In September 2004, Fergie met an American actor, Josh Duhamel, who she married in 2009. She took part in a Hollywood blockbuster, Poseidon (2006). Fergie is a favorite singer of Quentin Tarantino, who invited her to co-star in his movie Grindhouse (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNzExMTU1M15BMl5BanBnXkFtZTcwODkyMjIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004914","name":"Fergie","nicknames":["Stace","Fergie","The Dutchess","Fergalicious"],"idIMDB":"nm0004914"},"actorId":"nm0004914","character":"Tammy","urlCharacter":"http://www.imdb.com/character/ch0048422","main":true},{"actorName":"Nicky Katt","urlProfile":"http://www.imdb.com/name/nm0441588","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0NzU0MDczMF5BMl5BanBnXkFtZTYwNzc0Mjkz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 May 1970","placeOfBirth":" South Dakota, USA","birthName":"Nicky Agustin Katt","height":"5' 10\" (1.78 m)","bio":"Nicky Katt has been acting since the age of 7, when he appeared on the TV series CHiPs (1977) in 1977. He continued to work steadily through the 1980s on shows like Quincy M.E. (1976), Father Murphy (1981), and V (1984) but did not fall into the trap of many child actors who became identified with one famous role because his child roles were as guest spots or, as in the case of Herbie, the Love Bug (1982), were canceled early on, or can't get work as adults and allow their lives to fall to pieces. In a way, Katt has had two careers. The one as the child actor of the late 1970s and early 1980s, and as the character actor of the 1990s who so often played the bully or thug. Extremely talented and at ease in front of a camera in the medium of either television or feature film, Katt has had a very impressive body of work for someone of his age and looks to gain much in the way of future stardom as the series Boston Public (2000) clearly exhibits his leading-man potential.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0NzU0MDczMF5BMl5BanBnXkFtZTYwNzc0Mjkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0441588","name":"Nicky Katt","idIMDB":"nm0441588"},"actorId":"nm0441588","character":"Joe","urlCharacter":"http://www.imdb.com/character/ch0061677","main":true},{"actorName":"Hung Nguyen","urlProfile":"http://www.imdb.com/name/nm0629020","urlPhoto":"","biography":{"bio":"Hung Nguyen is known for his work on Planet Terror (2007), Grindhouse (2007) and Little Nicky (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0629020","name":"Hung Nguyen","idIMDB":"nm0629020"},"actorId":"nm0629020","character":"Dr. Crane","urlCharacter":"http://www.imdb.com/character/ch0054122","main":true},{"actorName":"Cecilia Conti","urlProfile":"http://www.imdb.com/name/nm1692022","urlPhoto":"","biography":{"bio":"Cecilia Conti is known for her work on Sin City (2005), Planet Terror (2007) and Death Proof (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1692022","name":"Cecilia Conti","idIMDB":"nm1692022"},"actorId":"nm1692022","character":"Paramedic Cecil","urlCharacter":"http://www.imdb.com/character/ch0161264","main":true},{"actorName":"Tommy Nix","urlProfile":"http://www.imdb.com/name/nm0633195","urlPhoto":"","biography":{"bio":"Tommy Nix is an actor and writer, known for Sin City (2005), Planet Terror (2007) and Desperado (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0633195","name":"Tommy Nix","idIMDB":"nm0633195"},"actorId":"nm0633195","character":"Paramedic Nixer","urlCharacter":"http://www.imdb.com/character/ch0161265","main":true}],"seasons":[],"idIMDB":"tt1077258","urlIMDB":"http://www.imdb.com/title/tt1077258","business":{"budget":null,"openingWeekend":[{"money":"£80,894","country":"UK","day":"11","month":"11","year":"2007","remarks":"51 Screens"},{"money":"BRL 118,862","country":"Brazil","day":"11","month":"11","year":"2007","remarks":"82 Screens"},{"money":"$8,236","country":"Estonia","day":"15","month":"07","year":"2007","remarks":"2 Screens"},{"money":"€297,000","country":"Italy","day":"28","month":"09","year":"2007","remarks":""}],"gross":[{"money":"£80,894","country":"UK","day":"11","month":"11","year":"2007","remarks":""},{"money":"BRL 125,243","country":"Brazil","day":"11","month":"11","year":"2007","remarks":""}],"weekendGross":[{"money":"£80,894","country":"UK","day":"11","month":"11","year":"2007","remarks":"51 Screens"},{"money":"BRL 118,862","country":"Brazil","day":"11","month":"11","year":"2007","remarks":"82 Screens"}],"admissions":[{"money":"13,587","country":"Brazil","day":"11","month":"11","year":"2007","remarks":""},{"money":"118,771","country":"Germany","day":"14","month":"10","year":"2007","remarks":""},{"money":"81,509","country":"Germany","day":"07","month":"10","year":"2007","remarks":""},{"money":"25,102","country":"Netherlands","day":"31","month":"12","year":"2007","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"20","month":"03","year":"2006","remarks":null},null],"copyrightHolder":"Copyright © MMVII The Weinstein Company, LLC All Rights Reserved (on print)"},"technical":{"runtime":["1 hr 45 min (105 min) (international)","1 hr 31 min (91 min) (original release)"],"soundMix":["SDDS","DTS","Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1 (DVD version)","2.35 : 1 (Grindhouse double feature)"],"camera":["Panavision Genesis HD Camera, Panavision Primo Lenses"],"laboratory":["Technicolor, USA (prints)"],"filmLength":["2,850 m (Portugal, 35 mm)","2,886 m (Sweden)"],"negativeFormat":["Video (HDTV)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","HDCAM SR (source format)"],"printedFilmFormat":["35 mm (Fuji Eterna-CP 3513DI)"]},"rating":"7.1","filmingLocations":[{"location":"Texas, USA"}],"rated":"NOT RATED","awards":[{"award":"Fright Meter Awards 2007","titlesAwards":[{"titleAwardOutcome":"Nominated Fright Meter Award","categories":[{"category":"Best Director","names":[{"name":"Robert Rodriguez","id":"nm0001675","role":null}]},{"category":"Best Supporting Actress","names":[{"name":"Rose McGowan","id":"nm0000535","role":null}]}]}]}],"votes":"173,734","type":"Movie","companyCreditsSimple":[{"idCompany":"co0019626","name":"Dimension Films"},{"idCompany":"co0035848","name":"Troublemaker Studios"},{"idCompany":"co0200397","name":"Rodriguez International Pictures"}],"keywords":{"keywords":["texas","stripper","sheriff","military base","doctor","go go dancer","shootout","hospital","over the top","two word title","two on a motorcycle","evil doctor","scene after end credits","garbage","high heels","sharp tongue","kicking someone","subtitles","spanish language","couch","painting nails","bare chested male","dog","diner","tattoo","ex boyfriend ex girlfriend relationship","pole dancer","pole dancing","mirror","pus","white coat","police officer","death of an animal","motorcycle","exploitation film","b movie","saw","one night","glasses","breakfast","twin girls","twin","babysitter","pregnancy","hammer","crying","tears","extramarital affair","running mascara","rapist","trail of blood","secret","text message","leather jacket","lesbian relationship","dead body","corpse","psychopath","cheating on husband","cheating wife","amputee","father son relationship","anesthesiologist","car","grabbed by the hair","needle","abusive husband","bisexual woman","unfaithful wife","husband wife relationship","truck used as weapon","jar of pickled testicles","female nudity","zombie apocalypse","survival","survival horror","anthropophagus","black comedy","deadly disease","sickness","zombie survival","doomsday","end of the world","walking dead","contamination","toxic waste","flesh eating zombie","man with glasses","hair curlers","hot pants","anti hero","violence","prosthetic limb","blood on camera lens","broken wrist","stand up comedian","one liner","explosion","waterbed","turtle","spider","scorpion","ring","meat","gas mask","killed by a propeller","jacket","hypodermic needle","gas station","flashlight","elevator","killing a dog","blood","beach","axe","amputee sex","music score composed by director","surprise after end credits","child shot in the head","zombie","wooden leg","tongue","thrown through a window","throat slitting","testicles","stabbed to death","stabbed in the eye","shovel","shot to death","shot in the head","shot in the forehead","shot in the face","shot in the crotch","shot in the chest","severed leg","ripped in half","person on fire","old flame","mother son relationship","mexico","melting man","mad scientist","mad doctor","machine gun","death of loved one","lesbian","infection","hit by a truck","hit by a car","head blown off","grenade launcher","gore","fire","father daughter relationship","falling from height","infidelity","exploding head","exploding car","exotic dancer","eaten alive","dismemberment","deformity","decapitation","cut into pieces","chemical weapon","castration","car accident","cannibalism","brother brother relationship","attempted rape","assault rifle","accidental suicide","accidental shooting","death of child","military","female protagonist","2000s","chemical weapons","biohazard","military veteran","tough girl","action heroine","tough guy","cameo","action hero","paranoia","fear","soldier","held at gunpoint","child in peril","homage","pistol","boyfriend girlfriend relationship","englishman abroad","shotgun","transformation","southern accent","mutation","arrest","handcuffs","female doctor","exploding truck","murder","sex","unfaithfulness","death","adultery","murder of a police officer","knocking on a door","child with a gun","child uses a gun","cell phone","bloody body of a child","blood splatter","scientist","creature feature","zombie violence","cult film","director also cinematographer","reference to osama bin laden","cancer","barbecue","intentional goof","deus ex machina","stabbed in the neck","stabbed in the chest","stabbed in the back","shot in the neck","shot in the leg","shot in the back","severed head","severed finger","premarital sex","morgue","helicopter","friendship"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:58:36"}}