{"data":{"movies":[{"title":"Lynch","originalTitle":"","year":"2007","releaseDate":"20071026","writers":[],"runtime":"84 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWM5Njc4ZGQtMTYyMy00NmVkLWEwODQtMzc1NzA3NDg1NGFlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Documentary"],"plot":"Compiled from over two years of footage, the film is an intimate portrait of 's creative process as he completes his latest film, (2006). We follow Lynch as he discovers beauty in ideas, leading us on a journey through the abstract which ultimately unveils his cinematic vision. The director of the documentary immersed himself in David Lynch's world; living and working at Lynch's home. His unobtrusive style has captured a personal side of David Lynch not seen before. The film reveals Lynch not only as one of the most original and compelling directors of contemporary film but also as an artist who continues to explore and experiment in countless mediums. We witness his \"hands on\" approach to painting, sculpting, music and screenwriting. His enthusiasm is infectious; inspiring us to tap into the well of creativity that Lynch believes we all have.","simplePlot":"Compiled from over two years of footage, the film is an intimate portrait of 's creative process as he completes his latest film, (2006). We follow Lynch as he ... ","actors":[{"actorName":"Jay Aaseng","urlProfile":"http://www.imdb.com/name/nm1154541","urlPhoto":"","biography":{"bio":"Jay Aaseng is an actor and producer, known for Inland Empire (2006), Cabin Fever (2002) and Beer Pong Girls.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1154541","name":"Jay Aaseng","idIMDB":"nm1154541"},"actorId":"nm1154541","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeremy Alter","urlProfile":"http://www.imdb.com/name/nm0022741","urlPhoto":"","biography":{"bio":"Jeremy Alter is known for his work on The Fighter (2010), Anchorman: The Legend of Ron Burgundy (2004) and Sideways (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0022741","name":"Jeremy Alter","idIMDB":"nm0022741"},"actorId":"nm0022741","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Lynch","urlProfile":"http://www.imdb.com/name/nm0000186","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MTY2MTY2Nl5BMl5BanBnXkFtZTcwMDg1ODYwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1946","placeOfBirth":" Missoula, Montana, USA","birthName":"David Keith Lynch","height":"5' 10\" (1.78 m)","bio":"Born in precisely the kind of small-town American setting so familiar from his films, David Lynch spent his childhood being shunted from one state to another as his research scientist father kept getting relocated. He attended various art schools, married Peggy Lynch and then fathered future director Jennifer Lynch shortly after he turned 21. That experience, plus attending art school in a particularly violent and run-down area of Philadelphia, inspired Eraserhead (1977), a film that he began in the early 1970s (after a couple of shorts) and which he would work on obsessively for five years. The final film was initially judged to be almost unreleasable weird, but thanks to the efforts of distributor Ben Barenholtz, it secured a cult following and enabled Lynch to make his first mainstream film (in an unlikely alliance with Mel Brooks), though The Elephant Man (1980) was shot through with his unique sensibility. Its enormous critical and commercial success led to Dune (1984), a hugely expensive commercial disaster, but Lynch redeemed himself with the now classic Blue Velvet (1986), his most personal and original work since his debut. He subsequently won the top prize at the Cannes Film Festival with the dark, violent road movie Wild at Heart (1990), and achieved a huge cult following with his surreal TV series Twin Peaks (1990), which he adapted for the big screen, though his comedy series On the Air (1992) was less successful. He also draws comic strips and has devised multimedia stage events with regular composer Angelo Badalamenti. He had a much-publicized affair with Isabella Rossellini in the late 1980s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MTY2MTY2Nl5BMl5BanBnXkFtZTcwMDg1ODYwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000186","name":"David Lynch","idIMDB":"nm0000186"},"actorId":"nm0000186","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Krzysztof Majchrzak","urlProfile":"http://www.imdb.com/name/nm0538048","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTg3OTY0ZWItOGJiMC00MzAzLWExNTItNWIyY2U4YjBiYjJiXkEyXkFqcGdeQXVyMTc4MzI2NQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 March 1948","placeOfBirth":" Gdansk, Pomorskie, Poland","bio":"Krzysztof Majchrzak was born on March 2, 1948 in Gdansk, Pomorskie, Poland. He is an actor and writer, known for Inland Empire (2006), Pornography (2003) and History of Cinema in Popielawy (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTg3OTY0ZWItOGJiMC00MzAzLWExNTItNWIyY2U4YjBiYjJiXkEyXkFqcGdeQXVyMTc4MzI2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0538048","name":"Krzysztof Majchrzak","idIMDB":"nm0538048"},"actorId":"nm0538048","character":"Phantom","urlCharacter":"http://www.imdb.com/character/ch0051984","main":true},{"actorName":"Phillip Patela","urlProfile":"http://www.imdb.com/name/nm2667712","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Phillip Patela yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2667712","name":"Phillip Patela","idIMDB":"nm2667712"},"actorId":"nm2667712","character":"Boy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Weronika Rosati","urlProfile":"http://www.imdb.com/name/nm1617964","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MjQ4MjI4Ml5BMl5BanBnXkFtZTgwMDI3ODY4ODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1984","placeOfBirth":" Warsaw, Mazowieckie, Poland","birthName":"Weronika Anna Dolores Rosati","height":"5' 4¼\" (1.63 m)","bio":"Weronika Rosati was is an international actress. Born in 1984 in Warsaw, her polish- american-hungarian mother is a famous fashion designer and her Italian father is a respected politician/economist now a depute at the european parliament. She has been working in films since she was a teenager , she became a Polish sensation after appearing in numerous popular tv series and achieved both stardom and recognition at the age go 19 with her first screen appearance in the lead female role of Gemma in \"Pitbull\"- a cop thriller classic. She attended the prestigious Lodz film school and then moved to New york where for two years she studied at the Lee Strasberg Institute. In the meantime she followed her career in Polish film working with such heat filmmakers as Krzysztof Zanussi in \"Foreign Body\" ( which premiered at the International Toronto film festival), Agnieszka Holland \" In darkness\" ( nominated for an oscar for best foreign film), and in many other feature films and tv shows. In 2013 Weronika played the role of Pestka in the World War 2 drama \" Manhunt\" which got international critical acclaim - she got her first Polish Film Academy nomination for best actress for her role and she got numerous awards including the Pola Negri prize for her portrayal of a young Jewish woman trying to save her sister from death. Rosati works often in France ( where she lived as a child and speaks fluent french) - she played a lead in tv film for france 2 television in \"La Dame de Pique\" and in Jerome Salle \"burma conspiracy\" opposite Tomer Sisley and Sharon Stone. Her first big breakthrough in the US was in 2011 when she was cast by Michael Mann in \"Luck\" the HBO original tv series starring Dustin Hoffman. She played a poker dealer Naomi , the love interest of Jason Gedrick and appeared in 4 episodes. From the she worked constantly in other tv show and films including \" True detective' season 2, \"Ncis\", \"The Iceman\" posit Michael Shannon, \"Bullett to the head\" opposite Sylvester Stallone, directed by Walter Hill, \"Last Vegas\" with Michael Douglas and \"Rosemary's baby' for NBC. In 2015 Weronika completed \" USS Indianapolis : men of courage\" a highly anticipated world war 2 drama directed by Mario Van Peebles. where she played Nicolas cage wife. She also will appear as a guest star on a new TBS comedy show \"the Detour\", as well as a French agent in a lead guest star on the popular show\"supernatural\" directed by John Badham. She just wrapped a historical epic international co-production produced by Fred Roos \"music, war and love\" directed by Martha Coolidge where she stars opposite Stellan Skarsgaard. Rosati is a household name in Europe where she was also a spokesperson for Avon cosmetics and Pantene among others. currently lives in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MjQ4MjI4Ml5BMl5BanBnXkFtZTgwMDI3ODY4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1617964","name":"Weronika Rosati","idIMDB":"nm1617964"},"actorId":"nm1617964","character":"Woman in factory","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1032207","urlIMDB":"http://www.imdb.com/title/tt1032207","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 24 min (84 min) (USA)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.66 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["Super 8","Video"],"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.8","metascore":"67","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"NOT RATED","awards":[],"votes":"679","type":"Movie","companyCreditsSimple":[{"idCompany":"co0192417","name":"Absurda"},{"idCompany":"co0213144","name":"Hideout Films"},{"idCompany":"co0213131","name":"Oneblackarm Films"}],"keywords":{"keywords":["one word title","cult director"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 09:01:19"}}