{"data":{"movies":[{"title":"Echelon Conspiracy","originalTitle":"","year":"2009","releaseDate":"20090227","directors":[{"name":"Greg Marcks","id":"nm1009775"}],"writers":[{"name":"Michael Nitsberg","id":"nm2805380"},{"name":"Kevin Alyn Elders","id":"nm0253106"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NzQzNzQ2NF5BMl5BanBnXkFtZTcwOTE5MTMyMg@@._V1.jpg","countries":["USA"],"languages":["English","Russian"],"genres":["Action","Crime","Mystery","Thriller"],"plot":"Max Peterson is a globe-trotting techno-whiz who installs security systems on computers. He receives an anonymous gift: a phone which sends messages that enable him to win at a casino. Max soon finds himself pursed by hit men, the casino's security chief, and a CIA operative. Who's sending Max messages? Previous recipients of similar windfalls have ended up dead. After a couple of close scrapes, Max realizes he's in danger, so he tries to find out the root of the conspiracy - which seems to have access to every security camera in the world - before he's the next victim. Why is this happening to him, and who can he trust?","simplePlot":"At first, the strange phone messages promised great wealth. Soon, though, government agents pursue the young engineer receiving them around the world.","actors":[{"actorName":"Shane West","urlProfile":"http://www.imdb.com/name/nm0922342","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYzMzMxMjcxNF5BMl5BanBnXkFtZTcwMjE2MDg0OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1978","placeOfBirth":" Baton Rouge, Louisiana, USA","birthName":"Shannon Bruce Snaith","height":"6' (1.83 m)","bio":"Shane West was born Shannon Bruce Snaith in 1978 in Baton Rouge, Louisiana, the son of Leah (Launey), a lawyer, and Don Snaith, a drugstore owner. Shane began to pursue an acting career at the age of fifteen, gaining bit parts on various television shows, but it was not until 1999 when West appeared in ABC's Once and Again (1999) that he got his major breakthrough. Aside from catapulting to teen heart-throb status with the success of the show, West has made his mark on the screen within such films as Liberty Heights (1999) and Whatever It Takes (2000). He starred opposite Mandy Moore in the hit teen romance A Walk to Remember (2002), played Tom Sawyer in the action film The League of Extraordinary Gentlemen (2003), and then depicted the short life of musician Darby Crash in the biopic What We Do Is Secret (2007). From 2010 to 2013, he starred as Michael on the show \"Nikita\" (2010)_, and since 2014, has played John Alden on the show \"Salem\" (2014)_. Aside from acting, West continues the musical traditions of his family (his parents were both were musicians when he was young) with his band, Average Jo, for which he writes and plays guitar. Shane's father was born in Jamaica, of mostly English and Sephardi Jewish descent. Shane's mother is from a Cajun (French) family from Louisiana.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYzMzMxMjcxNF5BMl5BanBnXkFtZTcwMjE2MDg0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0922342","name":"Shane West","idIMDB":"nm0922342"},"actorId":"nm0922342","character":"Max Peterson","urlCharacter":"http://www.imdb.com/character/ch0101619","main":true},{"actorName":"Edward Burns","urlProfile":"http://www.imdb.com/name/nm0122653","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MTU0NjIyMl5BMl5BanBnXkFtZTcwODc3OTc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1968","placeOfBirth":" Woodside, Queens County, New York, USA","birthName":"Edward Fitzgerald Burns","height":"6' 1\" (1.85 m)","bio":"Edward Fitzgerald Burns was born January 29, 1968 in Woodside, Queens, New York. He is the second of three children of Molly (McKenna), who worked for the Federal Aviation Administration at Kennedy Airport, and Edward J. Burns, a police sergeant and active spokesperson for the New York Police Dept. He was raised Catholic, and is of Irish, and one eighth Swedish, descent. Edward, along with his older sister, Mary, and brother, Brian, were raised in Long Island. He attended Catholic Chaminade High School before transferring to a public high school. He went on to attend The State University of New York at Albany and Oneonta College in New York to major in English literature. During his junior year he transferred to Hunter College in Manhattan, studied filmmaking and began writing the first of many short films. Upon graduating, and through his father's connections, he secured a job at Entertainment Tonight (1981) (TV) in 1993 working at as a \"go-fer\". There he was able to finance and begin working on The Brothers McMullen (1995), a comedy focusing on the trials and tribulations facing three Irish-Catholic siblings. It was shot primarily in his parents' Long Island home with a cast of unknowns including Burns himself and his then-girlfriend Maxine Bahns. The feature was filmed over eight months' time with a reported budget of only $ 30,000. Rejected by a series of distributors, The Brothers McMullen (1995) bowed at Sundance, after Burns had given Robert Redford a copy of the film while working on ET. In 1995 his film won the festival's Grand Jury Prize, becoming one of the most successful independent efforts of the year. He then sold the film to 20th Century Fox's Searchlight Pictures. For his follow-up Burn's wrote and directed She's the One (1996), which retained much of McMullen's cast and crew, including girlfriend Maxine. He was also able to cast up-and-coming stars Jennifer Aniston and Cameron Diaz in pivotal roles, with original music from rocker Petty, Tom. Filmed with a larger budget of almost $3 million, the romantic comedy successfully premiered during the summer of 1996 . Burns soon began work on his third feature, _No Looking Back_, a romantic drama set in a coastal town's working-class community. Burn's career seemed to be flourishing, but his personal relationship with Bahns, to whom he became engaged, ended after eight years. During filming of No Looking Back (1998), there were reported romantic sightings with Burns and his co-star Lauren Holly. The relationship seemed to end when the film was released in 1998. That same year, Burns co-starred in the Steven Spielberg World War II epic Saving Private Ryan (1998). After that pivotal role in one of the greatest films of all time, Burns continued a good year, and a new relationship with Heather Graham. In an interview with USA Weekly Magazine, Heather stated they met in a bar in LA, exchanged numbers and had numerous conversations. Burns then flew back to New York and she flew to east to see him a month later. Soon after Burns and Heather were seen at many premieres and events. It was also reported that couple was living together. But their relationship ended after two years. Although they were dating during the filming of his next project 15 Minutes (2001) starring along side Robert De Niro, Burns attended the premiere with none other than Christy Turlington. While his next few films did not make much of a dent in the box office including his film Sidewalks of New York (2001), which co-starred Heather Graham. His relationship with Christy was getting hot and heavy. The couple got engaged in 2001. It was then reported their engagement was called off, but the couple reunited after a 7-month split. Burns and Christy finally married on June 7, 2003 and welcomed their first child Grace, later that year Grace, on October 25. Burns' most recent projects include writing and directing The Groomsmen (2006) and Purple Violets (2007). He welcomed his second child, son Finn, (Feb/2006) with wife Christy. Burns is committed to writing and directing his own films. He's not affected by his futile work and continues his own projects with poise. Tackling touchy relationship subjects and pioneering real-life matters. With his panoply of Woody Allen -like films, there is no doubt Edward Burns will continue to dazzle us with his undeniable talent while gaining the recognition he deserves as a great writer and director.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MTU0NjIyMl5BMl5BanBnXkFtZTcwODc3OTc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0122653","name":"Edward Burns","nicknames":["Eddie"],"idIMDB":"nm0122653"},"actorId":"nm0122653","character":"John Reed","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ving Rhames","urlProfile":"http://www.imdb.com/name/nm0000609","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMTgyMzc4MV5BMl5BanBnXkFtZTYwNjE5Mjk1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1959","placeOfBirth":" New York City, New York, USA","birthName":"Irving Rameses Rhames","height":"6' (1.83 m)","bio":"Strikingly featured and muscular American actor Ving Rames was born Irving Rameses Rhames in Harlem, New York, to Reather, a homemaker, and Ernest Rhames, an auto mechanic. A good student, Ving entered the New York High School of Performing Arts, where he discovered his love of acting. He studied at the Juilliard School of Drama, and began his career in New York theater and in Shakespeare in the Park productions. He first appeared on Broadway in the play \"The Winter Boys\", in 1984. Also that year, he appeared in front of the cameras for the first time in the TV movie American Playhouse: Go Tell It on the Mountain (1985), and was then quickly cast in minor roles in several popular TV shows, including Miami Vice (1984), Tour of Duty (1987) and Crime Story (1986). Ving continued his rise to fame through his work in soap operas. His big break came in 1994 when director Quentin Tarantino cast him as the merciless drug dealer Marsellus Wallace in the mega hit Pulp Fiction (1994). Not long after, director Brian De Palma cast Rhames alongside Tom Cruise as the ace computer hacker, Luther Stickell in Mission: Impossible (1996). With solid performances in both these highly popular productions, his face was now well known to movie goers, and the work offers began rolling in more frequently. The next career highlight was playing the lead role in the HBO production of Don King: Only in America (1997). Rhames' performance as the world's most infamous boxing promoter was nothing short of brilliant, and at the 1998 Golden Globe Awards he picked up the award for Best Actor in a MiniSeries. However, in an incredible display of compassion, he handed over the award to fellow nominee Jack Lemmon, as he felt Lemmon was a more deserving winner! The talented actor then contributed attention grabbing performances in Bringing Out the Dead (1999), returned as Luther Stickell in Mission: Impossible II (2000), contributed his deep bass voice for the character of Cobra Bubbles in Lilo & Stitch (2002), and played a burly cop fighting cannibal zombie hordes in Dawn of the Dead (2004). A keen fitness & weight lifting enthusiast, Rhames is also well known for his strong spiritual beliefs and benevolent attitude towards other people. In a remarkable turn of events, whilst filming The Saint of Fort Washington (1993) in New York, he was introduced to a homeless man, who turned out to be his long lost, older brother, Junior, who had lost contact with the family after serving in Vietnam. The thrilled Rhames immediately assisted his disheveled brother in getting proper food & clothing, and moving him into his own apartment.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMTgyMzc4MV5BMl5BanBnXkFtZTYwNjE5Mjk1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000609","name":"Ving Rhames","idIMDB":"nm0000609"},"actorId":"nm0000609","character":"Agent Dave Grant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonathan Pryce","urlProfile":"http://www.imdb.com/name/nm0000596","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NTQ3OTcwNl5BMl5BanBnXkFtZTgwNTE2MDU2ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1947","placeOfBirth":" Holywell, Flintshire, Wales, UK","birthName":"John Price","height":"6' (1.83 m)","bio":"From Holywell to Hollywood, Jonathan Pryce, CBE is a critically acclaimed and award winning actor from North Wales, internationally regarded as the one of greatest ones both on stage and screen. Renowned for his immense versatility and powerful presence he has transcended the industry, effortlessly moving between Hollywood studio films and the classical West End in a range of work that also includes bold independent cinema and the Broadway musical. He has created some of the most memorable characters in cinema and for over forty years been on the wish list of many of the worlds most notorious and accomplished directors as 'Someone they must work with'. Jonathan, after graduating from the world famous RADA in London, began his career in the 1970's at the hugely influential Liverpool Everyman Theatre which grounded his politics and talent and helped attract a legacy of brave individual artists that have since been through their doors. From his definitive performance as Hamlet, he made his breakthrough screen performance in Terry Gilliam's masterpiece Brazil (1985). The phrase an 'Actors Actor' is often overused but with Jonathan Pryce I can think of no better fitting tribute because what that means to the industry is - here is a talent people want to watch and people want to work with. His choices can be considered as bold as they should be as well as always truthful that give life to characters multi-layered and always exciting, where it can be even hard to believe that he is just one man. As in his stage course that includes notable performances such as in \"Hamlet\", \"The Merchant of Venice\", \"The Goat or Who is Sylvia?\", \"The Taming of the Shrew\", \"Miss Saigon\", \"Oliver\", \"Comedians\" and \"King Lear\", Jonathan Pryce's range of staggering portrayals full of generously euphoric delight has also been expressed in films such as Brazil (1985), Glengarry Glen Ross (1992), The Age of Innocence (1993), Carrington (1995), Evita (1996), Behind the Lines (1997), Tomorrow Never Dies (1997), Very Annie Mary (2001), Unconditional Love (2002) and Pirates of the Caribbean: Dead Man's Chest (2006) as well as in mesmerizing TV roles such as in Roger Doesn't Live Here Anymore (1981), Game of Thrones (2011), My Zinc Bed (2008), Wolf Hall (2015) and Taboo (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NTQ3OTcwNl5BMl5BanBnXkFtZTgwNTE2MDU2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000596","name":"Jonathan Pryce","idIMDB":"nm0000596"},"actorId":"nm0000596","character":"Mueller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tamara Feldman","urlProfile":"http://www.imdb.com/name/nm1299293","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NTA2MDgxMF5BMl5BanBnXkFtZTYwNDQyNjky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 December 1980","placeOfBirth":" Wichita, Kansas, USA","bio":"Tamara Feldman was born on December 5, 1980 in Wichita, Kansas, USA. She is an actress and director, known for Hatchet (2006), Echelon Conspiracy (2009) and Perfect Stranger (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NTA2MDgxMF5BMl5BanBnXkFtZTYwNDQyNjky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1299293","name":"Tamara Feldman","idIMDB":"nm1299293"},"actorId":"nm1299293","character":"Kamila","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yuriy Kutsenko","urlProfile":"http://www.imdb.com/name/nm0476544","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2MyZmI1OTItZmRmZi00NGJjLWIyYzctZDBjYzdkMDI3YTJkXkEyXkFqcGdeQXVyNjMwOTA1MDM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 May 1967","placeOfBirth":" Zaporozhye, Ukrainian SSR, USSR [now Zaporizhia, Ukraine]","birthName":"Yuriy Georgievich Kutsenko","height":"6' 0½\" (1.84 m)","bio":"Gosha Kutsenko is a popular Russian film and theatre actor known for his roles in such films as Mama ne goryuy (1998) and the vampire franchise Night Watch (2004) and Day Watch (2006). He was born Yuri Georgievich Kutsenko, on May 20, 1967, in Zaporozhie, Ukraine, USSR (now Zaporizhia, Ukraine). His father, Georgi Pavlovich Kutsenko, was a manager of electronics industry. His mother, Svetlana Vasilevna, was a Medical Doctor. After graduation from high school, he studied at the Lvov Polytechnical Institute, then dropped out and served in the Soviet Red Army for two years. In 1988, Kutsenko moved to Moscow with his parents, because his father was appointed the Vice-Minister of Radio Industry of the USSR and the family moved to the capital. That same year he became a student of the Moscow Institute of Mechanics and Automatics. Eventually, two years later he dropped out of college in his pursuit of an acting career. Since his childhood Gosha Kutsenko has been suffering from a speech irregularity. Although he was named Yuri, after Yuri Gagarin, he could not pronounce his given name, so he was using the nickname Gosha. His speech disorder was also peppered with the Ukrainian accent which complicated his chances of becoming an actor in Moscow. However, in 1990, he made a diligent effort entering the famous Moscow Art Theatre School. There he was examined and accepted by none other than Oleg Tabakov, and became a student of the Acting School of Moscow Art Theatre (MKhAT). There he studied acting under Ivan Tarkhanov, and perfected his speech before graduating in 1992, as an actor. Kutsenko made his film debut in 'Chelovek is komandy Alfa' (1991) and in 'Mummy from a case' (1991). From 1995 - 1997 he hosted a popular TV show 'Partiinaia Zona' on TV-6, then hosted the popular Music-TV show in Moscow. From 1996 - 2000 Kutsenko taught acting at the class of Evgeniy Kindinov at Russian State Institute of Cinematography (VGIK). Kutsenko shot to fame with the leading role as Arthur in Mama ne goryuy (1998), a popular Russian criminal comedy-drama. He earned much critical acclaim for the leading role as Lis (aka .. The Fox) in Antikiller (2002), a criminal drama by director Yegor Konchalovsky, which became a pivotal work in Kutsenko's acting career. He ascended to international success after co-starring in the first Russian-made vampire franchise Night Watch (2004) and Day Watch (2006), directed by Timur Bekmambetov. Since 1990s Gosha Kutsenko has been a permanent member of the troupe at Moscow Theatre of Mossoveta. There he has been playing leading and supporting roles in popular stage productions. Kutsenko was acclaimed for his stage performances in a contemporary play 'Chapaev i pustota' and in the classical comedy 'Revizor' (Inspector-General) by Nikolai Gogol. In addition to his acting career, Kutsenko has been a partner in a film production company. He also developed a career as a singer-songwriter in Russia. From 1992 - 1997, Kutsenko was married to actress Maria Poroshina, and they have one daughter. Outside of his acting career, Kutsenko has been an avid sportsman specializing in boxing and wrestling, he is also an amateur cart-racer. He is currently residing in Moscow, Russia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2MyZmI1OTItZmRmZi00NGJjLWIyYzctZDBjYzdkMDI3YTJkXkEyXkFqcGdeQXVyNjMwOTA1MDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0476544","name":"Yuriy Kutsenko","nicknames":["Gosha"],"idIMDB":"nm0476544"},"actorId":"nm0476544","character":"Russian General","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sergey Gubanov","urlProfile":"http://www.imdb.com/name/nm2723466","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0OTA0MTk2MF5BMl5BanBnXkFtZTcwNDQ4OTUzMg@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 March 1977","placeOfBirth":" USSR","birthName":"Sergey Sergeevich Gubanov","height":"5' 11¼\" (1.81 m)","bio":"Sergey Gubanov was born on March 7, 1977 in the USSR as Sergey Sergeevich Gubanov. He is an actor, known for Echelon Conspiracy (2009), Dukhless (2012) and Trete zhelanie (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0OTA0MTk2MF5BMl5BanBnXkFtZTcwNDQ4OTUzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2723466","name":"Sergey Gubanov","idIMDB":"nm2723466"},"actorId":"nm2723466","character":"Yuri Malanin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Martin Sheen","urlProfile":"http://www.imdb.com/name/nm0000640","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM1MTA5MTY0MV5BMl5BanBnXkFtZTcwMTQ4OTUzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 August 1940","placeOfBirth":" Dayton, Ohio, USA","birthName":"Ramon Antonio Gerard Estevez","height":"5' 7\" (1.7 m)","bio":"Multiple Emmy- and Golden Globe-winner Martin Sheen is one of America's most celebrated, colorful, and accomplished actors. Moving flawlessly between artistic mediums, Sheen's acting range is striking. Sheen was born Ramón Antonio Gerard Estevez in Dayton, Ohio, to Mary-Ann (Phelan), an Irish immigrant (from Borrisokane, County Tipperary), and Francisco Estevez, a Spanish-born factory worker and machinery inspector (from Parderrubias, Galicia). On the big screen, Sheen has appeared in more than 65 feature films including a star turn as Army Captain Benjamin L. Willard in Francis Ford Coppola's landmark film Apocalypse Now (1979), which brought Sheen worldwide recognition. The film also starred Marlon Brando, Dennis Hopper and Robert Duvall. Other notable credits include Wall Street (1987) (with son Charlie Sheen and Michael Douglas), Academy Award-winning film Gandhi (1982) (with Sir Ben Kingsley), Catch Me If You Can (2002) (with Leonardo DiCaprio and Tom Hanks), The American President (1995) (with Michael Douglas and Annette Bening) and a Golden Globe nominated breakthrough performance as Timmy Cleary in The Subject Was Roses (1968), a role he originated on Broadway and for which he received a Tony Award nomination as Best Featured Actor. In 2006, the actor played ill-fated cop Oliver Queenan in Martin Scorsese's Academy Award-winning film The Departed (2006) opposite Leonardo DiCaprio, Matt Damon, Jack Nicholson, Mark Wahlberg and Alec Baldwin. The same year, Sheen joined another all-star ensemble cast for the highly acclaimed feature Bobby (2006), written and directed by his son 'Emilio Estevez'. Bobby was nominated for a Golden Globe Award and a SAG Award; and starred Anthony Hopkins, Harry Belafonte, Laurence Fishburne, Sharon Stone, William H. Macy, Elijah Wood, Demi Moore and Heather Graham. For television audiences, Sheen is best recognized for his six-time Emmy nominated performance as President Josiah Bartlet in The West Wing (1999). Sheen won six of his eight Golden Globe nominations as well as an ALMA Award; and two individual SAG Awards; for the White House series. He won the Golden Globe Award for Best Performance by an Actor TV Series Drama in 2001. Of his ten Primetime Emmy nominations, Sheen won for Outstanding Guest Actor in a Comedy Series on the long-running sitcom Murphy Brown (1988) (starring Candice Bergen) in 1994. In addition, he has garnered a Daytime Emmy Award for directing and another for performance. In 2006, Sheen was again nominated for an Emmy for Outstanding Guest Actor in a Comedy Series; this time for the CBS hit comedy Two and a Half Men (2003), starring his son Charlie Sheen. In addition to series television, Sheen has appeared in several important made-for-television movies and mini-series including playing President John F. Kennedy in the television mini-series Kennedy (1983) for which he received a Golden Globe nomination.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM1MTA5MTY0MV5BMl5BanBnXkFtZTcwMTQ4OTUzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000640","name":"Martin Sheen","idIMDB":"nm0000640"},"actorId":"nm0000640","character":"Raymond Burke","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ilan Goodman","urlProfile":"http://www.imdb.com/name/nm2802899","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0MzgyMzY5Nl5BMl5BanBnXkFtZTgwMzU2MjE3NjE@._V1_UY44_UX32_AL_.jpg","biography":{"bio":"Ilan Goodman is known for his work on The Imitation Game (2014), Diana (2013) and Call the Midwife (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0MzgyMzY5Nl5BMl5BanBnXkFtZTgwMzU2MjE3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2802899","name":"Ilan Goodman","idIMDB":"nm2802899"},"actorId":"nm2802899","character":"Dennis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Todd Jensen","urlProfile":"http://www.imdb.com/name/nm0421709","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyOTAzMDkyOF5BMl5BanBnXkFtZTcwMjM4NzcyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 2\" (1.88 m)","bio":"Todd Jensen has enjoyed a 30+ year acting career. Todd began his acting studies at prestigious acting institutes located on both east and west coasts of the United States, including the William Esper Studio in New York, the Joanne Baron Studio in Los Angeles, before studying improvisation at The Groundlings. Todd Jensen began his screen career in 1988. Appearing in various feature films Todd's most memorable films are \"Thick as Thieves\" with Morgan Freeman and Antonio Banderas & Echelon Conspiracy with Ving Rhames and Edward Burns. Entering the early2000s, Todd found steady work between small and big screens. He appeared in several creature/horror features including Sabertooth (2002) (TV), Raging Sharks (2005) (V), Mega Snake (2007) (TV) and Bats: Human Harvest (2007) (TV). As the 2000s began to wind down, Todd still maintained steady appearances in various colorful features including Copperhead (2008) (TV), Boogeyman 3 (2008) (V). The latter 2000s saw Todd again in television-made features and series sequels, among these being Messengers 2: The Scarecrow (2009) (V) as a banker, then he was part of a marooned space party in the Sci-Fi adventure Star Runners (2009) (TV), then played a US Marshal in Wrong Turn 3: Left for Dead (2009) (V). He has also made episodic appearances on \"The Glades\" (2010) and \"Burn Notice\" (2007) both in 2011. Outside of his own acting career, Todd has directed and produced. Most importantly, Todd started and taught training programs for actors called Todd Jensen's \"On Camera\" Acting & Audition Workshops.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyOTAzMDkyOF5BMl5BanBnXkFtZTcwMjM4NzcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0421709","name":"Todd Jensen","idIMDB":"nm0421709"},"actorId":"nm0421709","character":"Agent Fletcher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steven Elder","urlProfile":"http://www.imdb.com/name/nm0253097","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA0ZTI2MTAtZDNmYi00MDYzLTg0MGEtMzhmNGMzMzAwZmUxXkEyXkFqcGdeQXVyMzY3MDMxOA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"birthName":"Steven William Thomas Lawrence","height":"5' 11\" (1.8 m)","bio":"Known for Apple Tree Yard (2017) Good (2008) The 39 Steps (2008) Echelon Conspiracy (2009) Lost (2004) Sometimes credited as \"Steve Elder\". Steven Elder was born Steven William Thomas Lawrence in Rotherham, England. His parents are Clifford Lawrence (a former coal-miner, and professional boxer), and Margaret Barlow. He attended the Valley Comprehensive School in Worksop, England; the University Of London; and the Webber Douglas Academy Of Dramatic Art (London)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA0ZTI2MTAtZDNmYi00MDYzLTg0MGEtMzhmNGMzMzAwZmUxXkEyXkFqcGdeQXVyMzY3MDMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0253097","name":"Steven Elder","idIMDB":"nm0253097"},"actorId":"nm0253097","character":"Charles","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sandra De Sousa","urlProfile":"http://www.imdb.com/name/nm2289195","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjE4MzA3MF5BMl5BanBnXkFtZTgwOTg3MjMxNDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Sandra De Sousa's exotic multi-ethnic looks and stunning talent have helped her become an emerging star. She was born in London and knew at the tender age of 5 that she wanted to act. After principal roles in many school plays and musicals and whilst studying painting at the Slade School of Fine Art (UCL) she begun work in professional shows at the Bloomsbury theatre. Which include major parts in 'Yerma' and 'Caligula'. Whilst performing as Salome in 'Salome' at the Edinburgh Fringe, she won a starring role as Charlotte in her first feature film 'The Prodigal'. Training at the Central School of Speech and Drama, the Poor School and Actors Temple. In 2003, she won the British Finalist category of the 'International Stopping Power' competition and given the prize of training with the renowned Los Angeles-based acting coach Bernard Hiller. This meeting proved to be very influential as she became the founding organiser of his Masterclasses in London and continues to work with him regularly in Los Angeles. Sandra has worked extensively in theatre, playing leading and supporting roles in popular stage productions from 'Yerma', 'Salome', 'Caligula' at the Bloomsbury theatre, 'Bound Man' at the Battersea Arts Centre, 'The Hothouse' and 'Be my Baby' to classics such as Isabella in 'Measure for Measure' and Yeliena in 'Uncle Vanya' at the Workhouse Theatre. More recently she landed the starring role of Rosie in the first ever production of 'Porn Crackers' which also starred Charley Speed (Britain's Top Model Judge), directed by well-known producer/director Ruth Boswell and written by Jan Woolf, awarded the Harold Pinter residency at the Hackney Empire, London. After playing a lead in the film 'Love on the High Side' which won the audience vote at the Cannes 24 hour Film Festival, she booked the featured role of Ashlee Wilcox a tough drug addict on the top ITV1 series Bad Girls. Then appearing in the role of sexy Spanish con woman Dr Christina Lopez Rey in BBC1's popular daytime series Doctors. A permanent and key member of the Pink Elephants theatre company which includes a very select group of professional actors worldwide. Possessing a meticulous and passionate attitude towards her craft when preparing for roles and with an ever growing fan base worldwide, Sandra is definitely one to watch. (2007) Completed US feature The Gift/Echelon Conspiracy as 2nd female lead playing Female Casino Technician alongside Edward Burns and Ving Rhames. (2009) Rehearsing for two plays, developing a UK feature and busy with pre-production for upcoming UK Vampire feature. (2011) Pre-production of US feature Femena directed by Matt Cimber with Sonia Braga and Paulie Rojas.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjE4MzA3MF5BMl5BanBnXkFtZTgwOTg3MjMxNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2289195","name":"Sandra De Sousa","nicknames":["Sandy D"],"idIMDB":"nm2289195"},"actorId":"nm2289195","character":"Female Casino Tech","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Greg Donaldson","urlProfile":"http://www.imdb.com/name/nm0232108","urlPhoto":"","biography":{"dateOfBirth":"12 May 1973","placeOfBirth":" London, England, UK","height":"6' 1\" (1.85 m)","bio":"Greg Donaldson was born on May 12, 1973 in London, England. He is an actor, known for V for Vendetta (2005), The Bill (1984) and Echelon Conspiracy (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0232108","name":"Greg Donaldson","idIMDB":"nm0232108"},"actorId":"nm0232108","character":"Casino Tech","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrea Enright","urlProfile":"http://www.imdb.com/name/nm2513377","urlPhoto":"","biography":{"bio":"Andrea Enright is an actress, known for Echelon Conspiracy (2009), Lake Placid 2 (2007) and Mega Snake (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2513377","name":"Andrea Enright","idIMDB":"nm2513377"},"actorId":"nm2513377","character":"NSA Tech #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Trevor White","urlProfile":"http://www.imdb.com/name/nm0925544","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NDQwNTkyNl5BMl5BanBnXkFtZTgwOTEyMjYwNjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1970","placeOfBirth":" Vancouver, British Columbia, Canada","height":"5' 10\" (1.78 m)","bio":"Trevor White is a British and Canadian actor born in Vancouver, Canada and based in London, U.K. He graduated from Queen's University with a degree in Economics in 1992, and has been acting professionally since 1994. Film and TV credits include The Dark Knight Rises, Downton Abbey, Jason Bourne, World War Z, Die Another Day, and Burton & Taylor. He has had recurring roles on Millennium, Episodes, Hunted, and X Company. On stage, he has played Hotspur in Henry IV, and Tullus Aufidius in Coriolanus, for the Royal Shakespeare Company. White also played James Tyrone Jr. in the critically acclaimed 2012 West End production of Eugene O'Neill's Long Day's Journey Into Night, which won the 2013 Olivier Award for Best Revival. White is a regular voice in the Assassins Creed franchise, and has voiced dozens of other video games, including Star Wars: Battlefront, Golden Eye 007, The Division, and Little Big Planet 2. He was also the award-winning voice of Frank Honey in Lego City: Undercover, as well as being nominated for his work as Phoenix Wright in Professor Layton vs. Ace Attorney.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NDQwNTkyNl5BMl5BanBnXkFtZTgwOTEyMjYwNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0925544","name":"Trevor White","idIMDB":"nm0925544"},"actorId":"nm0925544","character":"Paul Spencer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1124039","urlIMDB":"http://www.imdb.com/title/tt1124039","business":{"budget":null,"openingWeekend":[{"money":"$500,154","country":"USA","day":"01","month":"03","year":"2009","remarks":"400 Screens"},{"money":"PHP 1,312,333","country":"Philippines","day":"24","month":"06","year":"2009","remarks":"16 Screens"}],"gross":[{"money":"$500,154","country":"USA","day":"01","month":"03","year":"2009","remarks":""},{"money":"PHP 1,863,945","country":"Philippines","day":"05","month":"07","year":"2009","remarks":""},{"money":"PHP 1,794,178","country":"Philippines","day":"28","month":"06","year":"2009","remarks":""},{"money":"PHP 1,312,333","country":"Philippines","day":"24","month":"06","year":"2009","remarks":""}],"weekendGross":[{"money":"$500,154","country":"USA","day":"01","month":"03","year":"2009","remarks":"400 Screens"},{"money":"PHP 73,297","country":"Philippines","day":"05","month":"07","year":"2009","remarks":"8 Screens"},{"money":"PHP 97,114","country":"Philippines","day":"28","month":"06","year":"2009","remarks":"12 Screens"},{"money":"PHP 1,312,333","country":"Philippines","day":"24","month":"06","year":"2009","remarks":"16 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"© 2008 Mobicom Holdings S.A."},"technical":{"runtime":["1 hr 45 min (105 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Barrandov Laboratore, Prague, Czech Republic","FotoKem Laboratory, Burbank (CA), USA","Kodak Cinelabs, Bucharest, Romania","Oriental Post, Thailand"],"filmLength":null,"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Digital Intermediate (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"5.8","metascore":"26","filmingLocations":[{"location":"Bulgaria"}],"rated":"PG-13","awards":[],"votes":"17,348","type":"Movie","companyCreditsSimple":[{"idCompany":"co0050870","name":"Dark Castle Entertainment"},{"idCompany":"co0253334","name":"Mobicom Entertainment"},{"idCompany":"co0132112","name":"Zinc Entertainment Inc."}],"keywords":{"keywords":["casino","security camera","echelon","text messaging","surveillance","super computer","subway station","stock","prague","nsa","moscow russia","hit by a train","czech republic","kiss","sex in bed","washington monument","white house","woman hitting man","assassin","grenade launcher","machine gun","fight","washington d.c.","paris france","neck breaking","flashback","face slap","chase","bare chested male","swimming pool","swat team","strangulation","stealing a car","standoff","stabbed in the side","stabbed in the leg","sniper rifle","slot machine","shotgun","shot in the shoulder","shot in the chest","shot in the arm","shootout","red dress","punched in the face","airplane crash","pistol","package","omaha nebraska","murder","maryland","crushed by a car","library","kicked in the crotch","impostor","impalement","hotel","hit by a car","hangar","hacker","gambling","fbi agent","exploding car","director cameo","corpse","cigarette smoking","check","cell phone","car crash","car chase","breaking through a door","bangkok thailand","bag over head","assassination","artificial intelligence","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:29:45"}}