{"data":{"movies":[{"title":"Bunraku","originalTitle":"","year":"2010","releaseDate":"20111130","directors":[{"name":"Guy Moshe","id":"nm1679136"}],"writers":[{"name":"Boaz Davidson","id":"nm0203246"},{"name":"Guy Moshe","id":"nm1679136"}],"runtime":"124 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDIwMTA3MDg2OV5BMl5BanBnXkFtZTcwODA1NzM1Ng@@._V1.jpg","countries":["USA"],"languages":["English","Japanese"],"genres":["Action","Drama","Fantasy","Thriller"],"plot":"In a world with no guns, a mysterious drifter, a bartender and a young samurai plot revenge against a ruthless leader and his army of thugs, headed by nine diverse and deadly assassins.","simplePlot":"The story of a a young man who has spent his life searching for revenge only to find himself up against a bigger challenge than he originally bargained for.","actors":[{"actorName":"Josh Hartnett","urlProfile":"http://www.imdb.com/name/nm0001326","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMjg0Mzc1OV5BMl5BanBnXkFtZTcwODI3MzA2MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 July 1978","placeOfBirth":" St. Paul, Minnesota, USA","birthName":"Joshua Daniel Hartnett","height":"6' 3\" (1.91 m)","bio":"Joshua Daniel Hartnett was born in Saint Paul, Minnesota, to Wendy Anne (Kronstedt) and Daniel Thomas Hartnett, a building manager. His father is of Irish and German descent, and his mother is of Swedish and Norwegian ancestry. Hartnett graduated from South High School in Minneapolis in June of 1996, then attended SUNY Purchase in New York. By April of 1997, he was offered the role of Michael Fitzgerald in the short-lived American television series Cracker: Mind Over Murder (1997). Josh started off doing small plays and national commercials, but broke into the big-screen movie business with his starring roles in Halloween H20: 20 Years Later (1998), The Faculty (1998), and Pearl Harbor (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMjg0Mzc1OV5BMl5BanBnXkFtZTcwODI3MzA2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001326","name":"Josh Hartnett","idIMDB":"nm0001326"},"actorId":"nm0001326","character":"The Drifter","urlCharacter":"http://www.imdb.com/character/ch0157915","main":true},{"actorName":"Gackt","urlProfile":"http://www.imdb.com/name/nm1374680","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3OTk5NzM3MV5BMl5BanBnXkFtZTcwNzgwNTMxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 July 1973","placeOfBirth":" Okinawa, Japan","birthName":"Gackt Camui","height":"5' 10¾\" (1.8 m)","bio":"Gackt Camui, was born in Okinawa, Japan. His father was a music teacher, and his mother also a teacher. He is the second of three children, with an older sister and younger brother. His musical education began early, and he started learning classical music theory and piano from the age of three. After exposure to rock music during his teenage years he practiced electric guitar and drums intensely. In the early 1990s he was working as a sound technician and studio drummer, but by the mid-'90s he had begun his career as a singer. He spent a short time in the independent band Cains:Feel before moving on to the visual kei rock band Malice Mizer. With Gackt as vocalist, lyricist, and composer, they rose to fame within the visual kei genre. In 1999 he parted ways with the band and launched his solo career, debuting with the EP Mizérable. He has since released nine studio albums, eight compilation albums, and forty-four singles. He has toured extensively within Japan and also throughout Asia and Europe. With an illustrious career spanning over 15 years, and forty-three consecutive singles ranked in the top ten of the Oricon music charts, he holds the title of the most successful male soloist in Japanese music history. A hallmark of his productions has been the use of all-encompassing, conceptual, and sometimes abstract themes, \"Moon\" and \"Requiem et Reminiscence\", to develop a series of related songs, concerts, movies, books or theatre play. To describe this idea he combined the words visual, live (concert), and alive to form the term \"Visualive\". It references the evocative and immersive experience he strives to create for his audiences. In addition to his music career, Gackt has undertaken various film and television acting roles. He wrote and starred in his first cinematic production Moon Child (2003), which screened at the Cannes Film Festival in 2003, and the Philadelphia Film Festival in 2004. In 2007 he received a TV Navi award for best supporting actor in a drama, for his portrayal of the powerful feudal leader Kenshin Uesugi in NHK's The Trusted Confidant (2007). One of Gackt's most notable performances was as the samurai protagonist Yoshi in the Guy Moshe film Bunraku (2010), where he costarred alongside Josh Hartnett, Woody Harrelson, Ron Perlman and Demi Moore. His depiction of the unnerving eunuch Jo Teigai in NHK's TV drama Tempest (2011) was brought to movie screens the following year in Gekijouban Tenpesuto 3D (2012). Recently he reprised his role as both Takashi Shiki and Yumeoji (dream prince) from the television drama Akumu chan (2012) in the cinematic release, Akumu Chan the Movie (2014). Gackt's numerous voice acting credits include animated films, such as Dragon Age: Dawn of the Seeker (2012), and video games, with two from the popular Final Fantasy VII series; Dirge of Cerberus: Final Fantasy VII (2006)and Crisis Core: Final Fantasy VII (2007) among others. In his stage play debut Nemuri Kyoshiro Burahikae (2010), Gackt was cast as the leading character. He later expanded his theater credentials by resuming his \"Moon\" concept and writing, producing, composing and starring in Moon Saga - Yoshitsune Hiden (2012). He has since announced a sequel scheduled to begin in August 2014 entitled Moon Saga - Yoshitsune Hiden - Chapter 2 (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3OTk5NzM3MV5BMl5BanBnXkFtZTcwNzgwNTMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1374680","name":"Gackt","idIMDB":"nm1374680"},"actorId":"nm1374680","character":"Yoshi","urlCharacter":"http://www.imdb.com/character/ch0307839","main":true},{"actorName":"Woody Harrelson","urlProfile":"http://www.imdb.com/name/nm0000437","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDc2ODc4MF5BMl5BanBnXkFtZTcwODk2MzAyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1961","placeOfBirth":" Midland, Texas, USA","birthName":"Woodrow Tracy Harrelson","height":"5' 9½\" (1.77 m)","bio":"Academy Award-nominated and Emmy Award-winning actor Woodrow Tracy Harrelson was born on July 23, 1961 in Midland, Texas, to Diane Lou (Oswald) and Charles Harrelson. He grew up in Lebanon, Ohio, and, after receiving degrees in theater arts and English from Hanover College, had a brief stint in New York theater. He was soon cast as Woody on TV series Cheers (1982), which wound up being one of the most-popular TV shows ever and also earned Harrelson an Emmy for his performance in 1989. While he dabbled in film during his time on Cheers (1982), that area of his career didn't fully take off until towards the end of the show's run. In 1991, Doc Hollywood (1991) gave him his first widely-seen movie role, and he followed that up with White Men Can't Jump (1992), Indecent Proposal (1993) and Natural Born Killers (1994). More recently, Harrelson was seen in No Country for Old Men (2007), Zombieland (2009), 2012 (2009), and Friends with Benefits (2011), along with the acclaimed HBO movie Game Change (2012). In 2011, Harrelson snagged the coveted role of fan-favorite drunk Haymitch Abernathy in the big-screen adaptation of The Hunger Games (2012), which ended up being one of the highest-grossing movies ever at the domestic box office. Harrelson is set to reprise that role for the sequels, which are scheduled for release in November 2013, 2014 and 2015. Harrelson has received two Academy Award nominations, first for his role as controversial Hustler founder Larry Flynt in The People vs. Larry Flynt (1996) and then for a role in The Messenger (2009). He also received Golden Globe nominations for both of these parts. In 2016, he had a stand-out role as a wise teacher in the teen drama The Edge of Seventeen (2016). Harrelson was briefly married to Nancy Simon in the 80s, and later married his former assistant, Laura Louie, with whom he has three daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDc2ODc4MF5BMl5BanBnXkFtZTcwODk2MzAyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000437","name":"Woody Harrelson","idIMDB":"nm0000437"},"actorId":"nm0000437","character":"The Bartender","urlCharacter":"http://www.imdb.com/character/ch0200589","main":true},{"actorName":"Ron Perlman","urlProfile":"http://www.imdb.com/name/nm0000579","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzAzMTEyOV5BMl5BanBnXkFtZTcwNjYwMzYwNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1950","placeOfBirth":" New York City, New York, USA","birthName":"Ronald Francis Perlman","height":"6' 1\" (1.85 m)","bio":"Ron Perlman is a classically-trained actor who has appeared in countless stage plays, feature films and television productions. Ronald N. Perlman was born April 13, 1950 in Washington Heights, Manhattan, New York. His mother, Dorothy (Rosen), is retired from the City Clerk's Office. His father, Bertram \"Bert\" Perlman, now deceased, was a repairman and a drummer. His parents were both from Jewish families (from Hungary, Germany and Poland). With a career spanning over three decades, Perlman has worked alongside such diverse actors as Marlon Brando, Sean Connery, Dominique Pinon, Brad Dourif, Ed Harris, John Hurt, Jude Law, Christina Ricci, Federico Luppi, Sigourney Weaver, Michael Wincott and Elijah Wood to name a few. While he has never been a bankable star, Perlman has always had a large fanbase. He started out strong as Amoukar, one of the tribesmen in Jean-Jacques Annaud's Academy Award-winning film Quest for Fire (1981), for which he earned a Genie Award nomination. Perlman teamed up with Annaud again, this time as a hunchback named Salvatore in The Name of the Rose (1986). His first real breakthrough came later when he landed the role of the noble lion-man Vincent, opposite Linda Hamilton on the fantasy series Beauty and the Beast (1987). His work in this role earned him not only a Golden Globe Award but an underground fan following. Sadly the series was cancelled in its third season shortly after Hamilton's character's death. After that, he spent time doing supporting work on television and independent films such as Guillermo del Toro's debut Cronos (1993) (where a lifelong friendship and collaboration between the director and Perlman would blossom) as Angel and his first lead role as One in Jean-Pierre Jeunet's surreal The City of Lost Children (1995). His first real big role in a mainstream film came when Jeunet wanted him for the brutish Johner in his first Hollywood outing Alien: Resurrection (1997). Perlman has also used his distinctive voice to his advantage, appearing in many animated films/series, commercials and he is a video game fan favorite because of his work on such games as the Fallout series. It was not until much later he received worldwide fame when his good friend Guillermo del Toro helped him land the title role in the big-budget comic book movie Hellboy (2004). Del Toro fought the studio for four years because they wanted a more secure name, but he stood his ground and in 2004, after almost 25 years in and out of obscurity, Perlman became and household name and a sought out actor. Perlman has had one of the most offbeat careers in film, playing everything from a prehistoric ape-man to an aging transsexual and will always be a rarity in Hollywood. Other notable roles include the cunning Norman Arbuthnot in The Last Supper (1995), sniper expert Koulikov in Enemy at the Gates (2001), vampire leader Reinhardt in Blade II (2002), his reprisal of Hellboy in Hellboy II: The Golden Army (2008) and biker chief Clarence Morrow on the popular series Sons of Anarchy (2008). He currently resides in Los Angeles, California with his wife, Opal, and their two children, Blake and Brandon.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzAzMTEyOV5BMl5BanBnXkFtZTcwNjYwMzYwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000579","name":"Ron Perlman","idIMDB":"nm0000579"},"actorId":"nm0000579","character":"Nicola","urlCharacter":"http://www.imdb.com/character/ch0117418","main":true},{"actorName":"Kevin McKidd","urlProfile":"http://www.imdb.com/name/nm0571727","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjUxNTQ3OV5BMl5BanBnXkFtZTcwOTg4Mjc5Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1973","placeOfBirth":" Elgin, Moray, Scotland, UK","height":"5' 11\" (1.8 m)","bio":"Kevin McKidd was born and raised in Elgin, Scotland, the son of Kathleen, a secretary, and Neil McKidd, a plumber. He was a member of the Moray Youth Theatre, before going on to study Engineering at the University of Edinburgh. While at the university, Kevin became involved with Bedlam Theatre, the university's student theatre company. At this point, Kevin decided to give up on engineering and dropped out of the university to pursue acting full-time. In 1994, he landed the leading role in the stageplay, \"The Silver Darlings\", produced by Robert Carlyle's Rain Dog Theatre Company. It was only a matter of time before Kevin made his screen debut as the vicious gangleader, \"Malky Johnson\", in Gillies MacKinnon's Small Faces (1996). His next role was as the tragic, gentle giant, \"Tommy\", in Trainspotting (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjUxNTQ3OV5BMl5BanBnXkFtZTcwOTg4Mjc5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0571727","name":"Kevin McKidd","idIMDB":"nm0571727"},"actorId":"nm0571727","character":"Killer No. 2","urlCharacter":"http://www.imdb.com/character/ch0307838","main":true},{"actorName":"Demi Moore","urlProfile":"http://www.imdb.com/name/nm0000193","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2Mjc1MDE4MV5BMl5BanBnXkFtZTcwNzAyNDczNA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 November 1962","placeOfBirth":" Roswell, New Mexico, USA","birthName":"Demi Gene Guynes","height":"5' 5\" (1.65 m)","bio":"Demi Moore was born on November 11, 1962, in Roswell, New Mexico. Her father, Charles Foster Harmon, Sr., left her mother, Virginia Beverly (King), before Demi was born. Her stepfather, Danny Guynes, did not add much stability to her life, either. He frequently changed jobs and made the family move a total of 40 times. The parents kept on drinking, arguing and beating, until Guynes finally committed suicide. Demi quit school at age 16 to work as a pin-up-girl. At 18, she married rock musician Freddy Moore; the marriage lasted four years. At 19, she became a regular on the soap opera General Hospital (1963) (1982-1983). From the first salaries, she started partying and sniffing cocaine. That lasted more than three years, until director Joel Schumacher threatened to fire her from the set of St. Elmo's Fire (1985) when she turned up high. She got a withdrawal treatment and returned clean within a week... and stayed clean. With determination and a skill for publicity stunts, like the nude appearance on the cover of Vanity Fair while pregnant, she made her way to fame. Thanks to the huge commercial success of Ghost (1990) and the controversial pictures Indecent Proposal (1993) and Disclosure (1994), she became Hollywood's most sought-after and most expensive actress. In 2009, Demi Moore and spouse Ashton Kutcher launched The Demi and Ashton Foundation, a non-profit, non-governmental organization directed towards fighting child sexual slavery. Its first campaign in \"Real Men Don't Buy Girls\". On April 23, 2011, Demi and Ashton appeared together for their first on-air interview on CNN's Piers Morgan Tonight (2011) to promote their foundation and start the work towards ending child sexual slavery. The foundation's website enables people to educate themselves, show support and take action or make a donation. They first got involved in the issue in 2008 and that a great deal of the early work just involved starting discussions, raising awareness and creating urgency.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2Mjc1MDE4MV5BMl5BanBnXkFtZTcwNzAyNDczNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000193","name":"Demi Moore","idIMDB":"nm0000193"},"actorId":"nm0000193","character":"Alexandra","urlCharacter":"http://www.imdb.com/character/ch0307840","main":true},{"actorName":"Shun Sugata","urlProfile":"http://www.imdb.com/name/nm0837452","urlPhoto":"","biography":{"dateOfBirth":"17 February 1955","placeOfBirth":" Yamanashi, Japan","birthName":"Masamichi Shibuya","height":"6' (1.83 m)","bio":"Shun Sugata was born on February 17, 1955 in Yamanashi, Japan as Masamichi Shibuya. He is an actor, known for Kill Bill: Vol. 2 (2004), Kill Bill: Vol. 1 (2003) and The Last Samurai (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0837452","name":"Shun Sugata","idIMDB":"nm0837452"},"actorId":"nm0837452","character":"Uncle","urlCharacter":"http://www.imdb.com/character/ch0307841","main":true},{"actorName":"Emily Kaiho","urlProfile":"http://www.imdb.com/name/nm2990413","urlPhoto":"","biography":{"dateOfBirth":"19 August 1986","placeOfBirth":" Honolulu, Oahu, Hawaii, USA","height":"5' 5\" (1.65 m)","bio":"Emily Kaiho was born in Honolulu, Hawaii to a Caucasian-American mother and Japanese father. She grew up in Japan and speaks both English and Japanese fluently. Emily studied jazz and modern dance, as well as theatre and acting, because she always had a strong desire to become an entertainer. As a teenager, she worked regularly as a beauty and fashion model in Japan, and performed on stage as a dancer as well. In early 2008, Emily decided to advance her career by moving to Los Angeles. Her first week there, she started working at a Japanese restaurant. Soon she was spotted by a casting director and invited to audition for the part of Momoko in the stylized martial arts film Bunraku. A few days after that, Emily found herself in Romania filming with all the big name actors. Her Hollywood debut had happened like a streak of lightening. During filming she started training her martial arts skills, such as Karate, Taekwondo, Weapons, Wushu and boxing. She has been so fascinated by martial arts, that she continues training back in LA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2990413","name":"Emily Kaiho","nicknames":["Emi"],"idIMDB":"nm2990413"},"actorId":"nm2990413","character":"Momoko","urlCharacter":"http://www.imdb.com/character/ch0307842","main":true},{"actorName":"Jordi Mollà","urlProfile":"http://www.imdb.com/name/nm0003244","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NTI2MzY3M15BMl5BanBnXkFtZTcwMDkyOTk1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1968","placeOfBirth":" L'Hospitalet de Llobregat, Barcelona, Catalonia, Spain","birthName":"Jordi Mollà Perales","height":"5' 10\" (1.78 m)","bio":"One of Spain's best-recognized artistic personalities, Jordi Mollà is an actor, director, painter and a writer. Jordi Mollà Perales was born in L'Hospitalet de Llobregat, Barcelona, Catalonia, Spain. Jordi was trained as an actor at the Barcelona Institute of Theatre and he also studied in Italy, Hungary and England. As an actor, he has worked in more than fifteen films, with prestigious directors like Bigas Luna, Montxo Armendáriz, Pedro Almodóvar, Ricardo Franco and Fernando Colomo. Jordi first received in acclaim in Bigas Luna's \"Jamón, Jamón\", in 1992. Since then Jordi has appeared in \"Historias del Kronen\" (1994), Director: Montxo Armendáriz; \"La Flor de mi secreto\" (1994), Director: Pedro Almodóvar; \"La Celestina\" (1996), Director: Gerardo Vera; \"La buena Estrella\" (1997), Director: Ricardo Franco (Nominated for the GOYA Awards); \"Los años bárbaros\" (1998), Director: Fernando Colomo; \"Volavérunt\" (1999), Director: Bigas Luna; \"Nadie conoce a nadie\" (1999), Director: Mateo Gil; \"Segunda piel\" (1999), Director: Gerardo Vera and \"Son de Mar\", (1999), Director: Bigas Luna. Critically acclaimed \"Blow\" with Johnny Depp and Penélope Cruz, was Jordi's debut film in Hollywood. Jordi has also directed two short films: \"Walter Peralta\" (Alcalá De Henares Award, Generalitat De Cataluña National Cinematographic Award) and \"No me importaria irme contigo\". His first feature film as a director, \"No somos nadie\", produced by Lola Films, will be realised in 2002. Additionally, Jordi has written two books: \"Las primeras veces\" and \"Agua estancada\". In addition to regularly exhibiting at PicassoMio Galleries, Jordi has exhibited at Sotheby's Gallery, Madrid (2007) and Galeria Carmen DE la Guerra, Madrid. This multi-faceted artist is a self-trained painter, for whom painting is an act of spontaneity. His works often surprise the viewer both with his ability to manage the media and with his power to express himself on canvas or paper.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NTI2MzY3M15BMl5BanBnXkFtZTcwMDkyOTk1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003244","name":"Jordi Mollà","idIMDB":"nm0003244"},"actorId":"nm0003244","character":"Valentine","urlCharacter":"http://www.imdb.com/character/ch0307843","main":true},{"actorName":"Mike Patton","urlProfile":"http://www.imdb.com/name/nm0666604","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1Njc4NzIwNF5BMl5BanBnXkFtZTcwNjY2NzIzOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1968","placeOfBirth":" Eureka, California, USA","birthName":"Michael Allen Patton","height":"5' 8½\" (1.74 m)","bio":"Michael Allan Patton was born on January 27th 1968 in California. He formed the band Mr Bungle at the age of 15, and after Jim Martin (of Faith No More) heard Mr Bungle, Mike was asked to join Faith No More as a permanent full time vocalist. After a turbulent career which lasted until April 1998, Faith No More broke up and since then Mike has participated and created some of the most bizarre and creative musical works ever to exist, including his brainchild Fantomas.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1Njc4NzIwNF5BMl5BanBnXkFtZTcwNjY2NzIzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0666604","name":"Mike Patton","idIMDB":"nm0666604"},"actorId":"nm0666604","character":"The Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shahar Sorek","urlProfile":"http://www.imdb.com/name/nm1245854","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMDQwODgxMF5BMl5BanBnXkFtZTcwMjYyNzEzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1975","placeOfBirth":" Jerusalem, Israel","bio":"Born and raised on the streets of Jerusalem, Shahar comes from both an orthodox and secular Jewish family. He started his acting career by landing the lead role in the biggest prime time drama on Israeli TV, \"Ramat Aviv\". He later went on to star in other TV, film and stage productions. Five times Israel national champion and a Master in the Korean martial art Tae-Kwon-Do, Shahar starred and developed \"Ajimae\", a TV special for Israel's national network. \"Ajimae\", a blending of Martial Arts and dance techniques coupled with singing was selected the best production of 2002. He is now the lead in the epic film \"King of Beggars\". Written and Directed by the acclaimed Israeli Director/Writer Uri Paster, \"King of Beggars\" is one of Israel's biggest and most lucrative film productions in decades. Fluent in both English and Hebrew.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMDQwODgxMF5BMl5BanBnXkFtZTcwMjYyNzEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1245854","name":"Shahar Sorek","idIMDB":"nm1245854"},"actorId":"nm1245854","character":"Killer No. 3 / Mirror Drifter","urlCharacter":"http://www.imdb.com/character/ch0307844","main":true},{"actorName":"Fernando Chien","urlProfile":"http://www.imdb.com/name/nm0157312","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI2NTg0MDA3Nl5BMl5BanBnXkFtZTgwNDkwMjY2NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 October 1974","placeOfBirth":" Taipei, Taiwan","birthName":"Chien Fu-Nan","height":"5' 8\" (1.73 m)","bio":"Born in Taipei, Taiwan and who's real name is Chien Fu-Nan. Fernando was given his \"Western\" name when he immigrated to Canada. Fernando's passion for acting began in Canada, performing on stage in musical theater productions in college which lead to various roles in TV and Film. In 2002 he moved to Los Angeles to pursue the film business full-time and is where he resides today. Bouncing between stunt and acting roles for 11 years in Los Angeles he honed his skills through his action team Reel Kick, whose members are currently some of Hollywood's most sought after action artists and stunt performers. While simultaneously studying acting at some of LA's best schools such as Michael Beach's Actors Gym, Groundlings, Howard Fine Acting Studio and Lee Strasberg Studio. Starting Tae Kwon Do and Karate at the age of 6, Fernando never really took martial arts seriously until his 20's where he studied Hung-Gar Kung Fu in Montreal, Quebec. After moving to Los Angeles he was introduced to Wushu and eventually Jiu-Jitsu and Muay Thai. Favoring the contact sports more than the performance martial arts he studied under Gokor Chivichyan and Sensei Gene LeBell at the Hayastan MMA Academy and currently at the Werdum Combat Team under Master Fabricio Werdum (Brazilian Jiu Jitsu) and Andrew Hagar (Dutch Style Kickboxing).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI2NTg0MDA3Nl5BMl5BanBnXkFtZTgwNDkwMjY2NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0157312","name":"Fernando Chien","idIMDB":"nm0157312"},"actorId":"nm0157312","character":"Killer No. 4","urlCharacter":"http://www.imdb.com/character/ch0307865","main":true},{"actorName":"Yoshio Iizuka","urlProfile":"http://www.imdb.com/name/nm1141615","urlPhoto":"","biography":{"bio":"Yoshio Iizuka is known for his work on Django Unchained (2012), Pirates of the Caribbean: Dead Man's Chest (2006) and Pirates of the Caribbean: At World's End (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1141615","name":"Yoshio Iizuka","idIMDB":"nm1141615"},"actorId":"nm1141615","character":"Killer No.5","urlCharacter":"http://www.imdb.com/character/ch0307888","main":true},{"actorName":"Kofi Yiadom","urlProfile":"http://www.imdb.com/name/nm1560081","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0Mjc5NzY4Ml5BMl5BanBnXkFtZTcwNDU5ODc3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Kofi Yiadom is known for his work on Captain America: Civil War (2016), Guardians of the Galaxy (2014) and Pirates of the Caribbean: Dead Man's Chest (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0Mjc5NzY4Ml5BMl5BanBnXkFtZTcwNDU5ODc3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1560081","name":"Kofi Yiadom","idIMDB":"nm1560081"},"actorId":"nm1560081","character":"Killer No. 6","urlCharacter":"http://www.imdb.com/character/ch0307863","main":true},{"actorName":"Aaron Toney","urlProfile":"http://www.imdb.com/name/nm1987604","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMjA5NzY3NV5BMl5BanBnXkFtZTcwNTY1NTgwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Aaron Toney is known for his work on Guardians of the Galaxy (2014), Captain America: Civil War (2016) and Avengers: Age of Ultron (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMjA5NzY3NV5BMl5BanBnXkFtZTcwNTY1NTgwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1987604","name":"Aaron Toney","idIMDB":"nm1987604"},"actorId":"nm1987604","character":"Killer No. 7","urlCharacter":"http://www.imdb.com/character/ch0307868","main":true}],"seasons":[],"idIMDB":"tt1181795","urlIMDB":"http://www.imdb.com/title/tt1181795","business":{"budget":{"money":"$25,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"17","month":"04","year":"2008","remarks":null},{"money":null,"country":null,"day":"23","month":"06","year":"2008","remarks":null}],"copyrightHolder":"© 2010, Bunraku Productions, LLC"},"technical":{"runtime":["2 hr 4 min (124 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam LT, Cooke S4 and Angenieux Optimo Lenses","Arricam ST, Cooke S4 and Angenieux Optimo Lenses","Arriflex 435, Cooke S4 and Angenieux Optimo Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA (prints)","Kodak Cinelabs, Bucharest, Romania","Modern VideoFilm, Burbank (CA), USA (digital intermediate)"],"filmLength":null,"negativeFormat":["35 mm (Kodak Vision3 500T 5219, Vision2 500T 5260)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"6.2","metascore":"28","filmingLocations":[{"location":"Romania"}],"rated":"R","awards":[],"votes":"17,142","type":"Movie","companyCreditsSimple":[{"idCompany":"co0188303","name":"Snoot Entertainment"},{"idCompany":"co0149756","name":"Picturesque Films"},{"idCompany":"co0236721","name":"Ram Bergman Productions"}],"keywords":{"keywords":["revenge","army","bartender","drifter","reflection in a pair of glasses","flaming arrow","building fire","flying trapeze","performing cartwheels","overhead camera shot","drop of blood","climbing a ladder","cheating at cards","all in bet","straight poker","pat poker hand","wearing clothes in a bathtub","fighting in the rain","popup book","whisky","man wearing a flat cap","signature in blood","breaking furniture","jumping between buildings","eating wasabi","man wearing a red suit","comic style subtitles","joker card","throat cut","piano player","throwing a hatchet","passenger train","sashimi","fedora","narration","man with no name","stabbed in the throat","waterfall","burned alive","battle","brass knuckles","beaten to death","bare chested male","hit with a baseball bat","bow and arrow","general","mountain","costume","wood chopping","axe","prostitute","kidnapping","death of uncle","hotel","neck breaking","bitten on the arm","stabbed in the shoulder","fear of heights","circus","car crash","car chase","car on train tracks","hit by a car","woman punching a man","man punching a woman","ambush","knife fight","dripping blood","cousin cousin relationship","garden","poker game","medallion","severed finger","father daughter relationship","uncle nephew relationship","jumping from a rooftop","prison escape","knocked out","corruption","police chief","stabbed in the eye","motorcycle","flashback","throat slitting","spit in the face","brothel","woman in bathtub","absinthe","spitting blood","kicked in the chest","cigar smoking","rain","blood splatter","fistfight","knife throwing","bar fight","storytelling","pop up book","knife","hit with a broom","yo yo","restaurant","casino","taxi","one against many","thrown through a window","slow motion scene","subtitled scene","gun shaped lighter","nose pushed into brain","punched in the nose","punched in the face","card trick","bar","piano playing","cigarette smoking","train","murder","gang","impalement","stabbed in the back","stabbed in the chest","stabbed to death","stabbed in the head","hatchet","character repeating someone else's dialogue","sword fight","kicked in the face","written by director","katana sword","voice over narration","martial arts","kung fu","japanese","electronic cigarette","one word title","death of father"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 03:43:24"}}