{"data":{"movies":[{"title":"Seventh Son","originalTitle":"","year":"2014","releaseDate":"20150206","directors":[{"name":"Sergei Bodrov","id":"nm0091076"}],"writers":[{"name":"Charles Leavitt","id":"nm0495378"},{"name":"Steven Knight","id":"nm1140275"}],"runtime":"102 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNTg2MDkyN15BMl5BanBnXkFtZTgwNzA3NzY1MjE@._V1.jpg","countries":["USA","UK","Canada","China"],"languages":["English"],"genres":["Action","Adventure","Fantasy"],"plot":"John Gregory, who is a seventh son of a seventh son and also the local spook, has protected his country from witches, boggarts, ghouls and all manner of things that go bump in the night. However John is not young anymore, and has been seeking an apprentice to carry on his trade. Most have failed to survive. The last hope is a young farmer's son named Thomas Ward. Will he survive the training to become the spook that so many others couldn't? Should he trust the girl with pointy shoes? How can Thomas stand a chance against Mother Malkin, the most dangerous witch in the county?","simplePlot":"When Mother Malkin, the queen of evil witches, escapes the pit she was imprisoned in by professional monster hunter Spook decades ago and kills his apprentice, he recruits young Tom, the seventh son of the seventh son, to help him.","actors":[{"actorName":"Jeff Bridges","urlProfile":"http://www.imdb.com/name/nm0000313","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU1NjM4MDYzMl5BMl5BanBnXkFtZTcwMjIwMjMyMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1949","placeOfBirth":" Los Angeles, California, USA","birthName":"Jeffrey Leon Bridges","height":"6' 1\" (1.85 m)","bio":"Jeffrey Leon Bridges was born on December 4, 1949 in Los Angeles, California, the son of well-known film and TV star Lloyd Bridges and his long-time wife Dorothy Dean Bridges (née Simpson). He grew up amid the happening Hollywood scene with big brother Beau Bridges. Both boys popped up, without billing, alongside their mother in the film The Company She Keeps (1951), and appeared on occasion with their famous dad on his popular underwater TV series Sea Hunt (1958) while growing up. At age 14, Jeff toured with his father in a stage production of \"Anniversary Waltz\". The \"troublesome teen\" years proved just that for Jeff and his parents were compelled at one point to intervene when problems with drugs and marijuana got out of hand. He recovered and began shaping his nascent young adult career appearing on TV as a younger version of his father in the acclaimed TV- movie Silent Night, Lonely Night (1969), and in the strange Burgess Meredith film Le 3eme oeil (1970). Following fine notices for his portrayal of a white student caught up in the racially-themed Halls of Anger (1970), his career-maker arrived just a year later when he earned a coming-of-age role in the critically-acclaimed ensemble film The Last Picture Show (1971). The Peter Bogdanovich- directed film made stars out off its young leads (Bridges, Timothy Bottoms, Cybill Shepherd) and Oscar winners out of its older cast (Ben Johnson, Cloris Leachman). The part of Duane Jackson, for which Jeff received his first Oscar-nomination (for \"best supporting actor\"), set the tone for the types of roles Jeff would acquaint himself with his fans -- rambling, reckless, rascally and usually unpredictable). Owning a casual carefree handsomeness and armed with a perpetual grin and sly charm, he started immediately on an intriguing 70s sojourn into offbeat filming. Chief among them were his boxer on his way up opposite a declining Stacy Keach in Fat City (1972); his Civil War-era conman in the western Bad Company (1972); his redneck stock car racer in The Last American Hero (1973); his young student anarchist opposite a stellar veteran cast in Eugene O'Neill's The Iceman Cometh (1973); his bank-robbing (also Oscar-nominated) sidekick to Clint Eastwood in Thunderbolt and Lightfoot (1974); his aimless cattle rustler in Rancho Deluxe (1975); his low-level western writer who wants to be a real-life cowboy in Hearts of the West (1975); and his brother of an assassinated President who pursues leads to the crime in Winter Kills (1979). All are simply marvelous characters that should have propelled him to the very top rungs of stardom...but strangely didn't. Perhaps it was his trademark ease and naturalistic approach that made him somewhat under appreciated at that time when Hollywood was run by a Dustin Hoffman, Robert De Niro and Al Pacino-like intensity. Neverthless, Jeff continued to be a scene-stealing favorite into the next decade, notably as the video game programmer in the 1982 science-fiction cult classic TRON (1982), and the struggling musician brother vying with brother Beau Bridges over the attentions of sexy singer Michelle Pfeiffer in The Fabulous Baker Boys (1989). Jeff became a third-time Oscar nominee with his highly intriguing (and strangely sexy) portrayal of a blank-faced alien in Starman (1984), and earned even higher regard as the ever-optimistic inventor Preston Tucker in Tucker: The Man and His Dream (1988). Since then Jeff has continued to pour on the Bridges magic on film. Few enjoy such an enduring popularity while maintaining equal respect with the critics. The Fisher King (1991), American Heart (1992), Fearless (1993), The Big Lebowski (1998) (now a cult phenomenon) and The Contender (2000) (which gave him a fourth Oscar nomination) are prime examples. More recently he seized the moment as a bald-pated villain as Robert Downey Jr.'s nemesis in Iron Man (2008) and then, at age 60, he capped his rewarding career by winning the elusive Oscar, plus the Golden Globe and Screen Actor Guild awards (among many others), for his down-and-out country singer Bad Blake in Crazy Heart (2009). Bridges next starred in TRON: Legacy (2010), reprising one of his more famous roles, and received another Oscar nomination for Best Actor for his role in the Western remake True Grit (2010). In 2014, he co-produced and starred in an adaptation of the Lois Lowry science fiction drama The Giver (2014). Jeff has been married since 1977 to non-professional Susan Geston (they met on the set of Rancho Deluxe (1975)). The couple have three daughters, Isabelle (born 1981), Jessica (born 1983), and Hayley (born 1985). He hobbies as a photographer on and off his film sets, and has been known to play around as a cartoonist and pop musician. His ancestry is English, and smaller amounts of Scots-Irish (Northern Irish), Irish, Swiss-German, and German.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU1NjM4MDYzMl5BMl5BanBnXkFtZTcwMjIwMjMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000313","name":"Jeff Bridges","nicknames":["The Dude"],"idIMDB":"nm0000313"},"actorId":"nm0000313","character":"Master Gregory","urlCharacter":"http://www.imdb.com/character/ch0243303","main":true},{"actorName":"Ben Barnes","urlProfile":"http://www.imdb.com/name/nm1602660","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4OTg4OTI3NF5BMl5BanBnXkFtZTcwNjI0OTc4NA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 August 1981","placeOfBirth":" London, England, UK","birthName":"Benjamin Thomas Barnes","height":"6' 1\" (1.85 m)","bio":"British actor Benjamin Thomas Barnes was born in London, England, to Patricia (Becker), a relationship therapist, and Thomas Barnes, a professor of psychiatry. He has a brother, Jack. His mother is from South Africa, and is of Jewish heritage, while his father is English. Barnes studied at Homefield Preparatory and King's College, both independent all boys' schools. He began acting in musical theatre, including at the National Youth Music Theatre, and was a member of Hyrise, a boy band. In 2004, he graduated with BA Honours from Kingston University, where he studied drama and English literature. In 2006, Barnes played Dakin in The History Boys on stage, and made his television debut on the series Doctors (2000). His first film was Matthew Vaughn's Stardust (2007), and his second major film role was the epic The Chronicles of Narnia: Prince Caspian (2008), in which he played Prince Caspian. He next co-starred with Jessica Biel in Easy Virtue (2008), played the title role in Ol Parker's Dorian Gray (2009), and reprised his role, now as King Caspian, in The Chronicles of Narnia: The Voyage of the Dawn Treader (2010). In 2011, he co-starred with Robert Sheehan, playing brothers, in Killing Bono (2011). He also had major roles in the films The Words (2012) and The Big Wedding (2013). In 2015, Barnes played the title role in the fantasy adventure Seventh Son (2014), opposite Jeff Bridges and Julianne Moore. The same year, he portrayed American founding father Sam Adams in the History Channel mini-series Sons of Liberty (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4OTg4OTI3NF5BMl5BanBnXkFtZTcwNjI0OTc4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1602660","name":"Ben Barnes","nicknames":["B-Squared"],"idIMDB":"nm1602660"},"actorId":"nm1602660","character":"Tom Ward","urlCharacter":"http://www.imdb.com/character/ch0289472","main":true},{"actorName":"Julianne Moore","urlProfile":"http://www.imdb.com/name/nm0000194","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDI1MjE2Ml5BMl5BanBnXkFtZTgwNDE0Nzk0MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1960","placeOfBirth":" Fayetteville, North Carolina, USA","birthName":"Julie Anne Smith","height":"5' 3\" (1.6 m)","bio":"Julianne Moore was born Julie Anne Smith in Fort Bragg, North Carolina on December 3, 1960, the daughter of Anne (Love), a social worker, and Peter Moore Smith, a paratrooper, colonel, and later military judge. Her mother moved to the U.S. in 1951, from Greenock, Scotland. Her father, from Burlington, New Jersey, has German, Irish, German-Jewish, and English ancestry. Moore spent the early years of her life in over two dozen locations around the world with her parents, during her father's military career. She finally found her place at Boston University, where she earned her Bachelor of Fine Arts (B.F.A.) degree in acting from the School of the Performing Arts. After graduation (in 1983), She took the stage name \"Julianne Moore\" because there was another actress named \"Julie Anne Smith\". Julianne moved to New York and worked extensively in theater, including appearances off-Broadway in two Caryl Churchill plays, Serious Money and Ice Cream With Hot Fudge and as Ophelia in Hamlet at The Guthrie Theatre. But despite her formal training, Julianne fell into the attractive actress' trap of the mid-1980's: TV soaps and miniseries. She appeared briefly in the daytime serial The Edge of Night (1956) and from 1985 to 1988 she played two half-sisters Frannie and Sabrina on the soap As the World Turns (1956). This performance later led to an Outstanding Ingénue Daytime Emmy Award in 1988. Her subsequent appearances were in mostly forgettable TV-movies, such as Money, Power, Murder. (1989), The Last to Go (1991) and Cast a Deadly Spell (1991). She made her entrance into the big screen with 1990's Tales from the Darkside: The Movie (1990), where she played the victim of a mummy. Two years later, Julianne appeared in feature films with supporting parts in The Hand That Rocks the Cradle (1992) and the comedy The Gun in Betty Lou's Handbag (1992). She kept winning better and more powerful roles as time went on, including a small but memorable role as a doctor who spots Kimble Harrison Ford and attempts to thwart his escape in The Fugitive (1993). (A role that made such an impression on Steven Spielberg that he cast her in the Jurassic Park (1993) sequel without an audition in 1997). In one of Moore's most distinguished performances, she recapitulated her \"beguiling Yelena\" from Andre Gregory's workshop version of Chekhov's Uncle Vanya in Louis Malle's critically acclaimed Vanya on 42nd Street (1994). Director Todd Haynes gave Julianne her first opportunity to take on a lead role in Safe (1995). Her portrayal of Carol White, an affluent L.A. housewife who develops an inexplicable allergic reaction to her environment, won critical praise as well as an Independent Spirit Award nomination. Later that year she found her way into romantic comedy, co-starring as Hugh Grant's pregnant girlfriend in Nine Months (1995). Following films included Assassins (1995), where she played an electronics security expert targeted for death (next to Sylvester Stallone and Antonio Banderas) and Surviving Picasso (1996), where she played Dora Maar, one of the numerous lovers of Picasso (portrayed by her hero, Anthony Hopkins). A year later, after co-starring in Spielberg's The Lost World: Jurassic Park (1997), opposite Jeff Goldblum, a young and unknown director, Paul Thomas Anderson asked Julianne to appear in his movie, Boogie Nights (1997). Despite her misgivings, she finally was won over by the script and her decision to play the role of Amber Waves, a loving porn star who acts as a mother figure to a ragtag crew, proved to be a wise one, since she received both Golden Globe and Academy Award nominations. Julianne started 1998 by playing an erotic artist in The Big Lebowski (1998), continued with a small role in the social comedy Chicago Cab (1997) and ended with a subtle performance in Gus Van Sant's remake of Psycho (1960). 1999 had Moore as busy as an actress can be. She starred in a number of high-profile projects, beginning with Robert Altman's Cookie's Fortune (1999) , in which she was cast as the mentally challenged but adorable sister of a decidedly unhinged Glenn Close. A portrayal of the scheming Mrs. Cheveley followed in Oliver Parker's An Ideal Husband (1999) with a number of critics asserting that Moore was the best part of the movie. She then enjoyed another collaboration with director Anderson in Magnolia (1999) and continued with an outstanding performance in The End of the Affair (1999), for which she garnered another Oscar nomination. She ended 1999 with another great performance, that of a grieving mother in A Map of the World (1999), opposite Sigourney Weaver.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDI1MjE2Ml5BMl5BanBnXkFtZTgwNDE0Nzk0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000194","name":"Julianne Moore","nicknames":["Juli"],"idIMDB":"nm0000194"},"actorId":"nm0000194","character":"Mother Malkin","urlCharacter":"http://www.imdb.com/character/ch0243304","main":true},{"actorName":"Alicia Vikander","urlProfile":"http://www.imdb.com/name/nm2539953","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4ODAzMjg3MF5BMl5BanBnXkFtZTgwNDUyOTYyNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1988","placeOfBirth":" Gothenburg, Västra Götalands län, Sweden","birthName":"Alicia Amanda Vikander","height":"5' 5½\" (1.66 m)","bio":"Alicia Vikander is a Swedish actress, dancer and producer. She was born and raised in Gothenburg, Västra Götalands län, Sweden, to Maria Fahl-Vikander, an actress of stage and screen, and Svante Vikander, a psychiatrist. She is of Swedish and one quarter Finnish descent. Alicia began acting as a child in minor stage productions at The Göteborg Opera, and trained as a ballet dancer at the Royal Swedish Ballet School in Stockholm, and the School of American Ballet in New York. She began her professional acting career by appearing in Swedish short films and television series, and first gained recognition in Northern Europe for her role as Josefin Björn-Tegebrandt in the TV drama Second Avenue (2007). Vikander made her feature film debut in Pure (2009), for which she won the Guldbagge Award for Best Actress. She attracted widespread recognition in 2012 for portraying Princess Ekaterina \"Kitty\" Alexandrovna Shcherbatskaya in Joe Wright's film adaptation of Anna Karenina (2012), and Queen Caroline Mathilde in the acclaimed Danish film A Royal Affair (2012), receiving a BAFTA Rising Star Award nomination for her breakthrough. She went on to star in the 2013 Swedish drama film Hotel (2013)and appeared in the Julian Assange biopic The Fifth Estate (2013) that same year. In 2014 and 2015, Vikander achieved global recognition and acclaim for her roles as activist Vera Brittain in Testament of Youth (2014), an AI in Ex Machina (2014), for which she was nominated for the Golden Globe and BAFTA Award for Best Supporting Actress, and painter Gerda Wegener in The Danish Girl (2015), for which she received the Academy Award and the Screen Actors Guild Award for Best Supporting Actress.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4ODAzMjg3MF5BMl5BanBnXkFtZTgwNDUyOTYyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2539953","name":"Alicia Vikander","idIMDB":"nm2539953"},"actorId":"nm2539953","character":"Alice","urlCharacter":"http://www.imdb.com/character/ch0391718","main":true},{"actorName":"Antje Traue","urlProfile":"http://www.imdb.com/name/nm1662644","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjY4MjUyMF5BMl5BanBnXkFtZTgwMjc1ODU1MDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 January 1981","placeOfBirth":" Mittweida, East Germany [now Saxony, Germany]","height":"5' 6½\" (1.69 m)","bio":"Antje Traue was born in Mittweida, Saxony, East Germany. Her mother was a musician and dancer. Traue was raised speaking Russian. She discovered her love for acting at an early age. As a teenager, Traue attended the \"International Munich Art Lab\", where she was cast in the lead role in the theatre play, \"West End Opera\". For four years, she toured with the ensemble cast throughout Europe and then to New York. In 2002, Traue moved to Berlin and landed roles in both feature films and television projects, including Kleinruppin forever (2004), Berlin am Meer (2008) and Phantom Pain (2009). In 2008, she was cast as the female lead in the international science fiction film, Pandorum (2009), opposite Dennis Quaid and Ben Foster. In 2010, she was filming on Renny Harlin's 5 Days of War (2011), alongside Val Kilmer and Rupert Friend.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjY4MjUyMF5BMl5BanBnXkFtZTgwMjc1ODU1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1662644","name":"Antje Traue","idIMDB":"nm1662644"},"actorId":"nm1662644","character":"Bony Lizzie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Olivia Williams","urlProfile":"http://www.imdb.com/name/nm0931404","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MzczNjQxN15BMl5BanBnXkFtZTcwNTQ1MzIzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1968","placeOfBirth":" Camden Town, London, England, UK","birthName":"Olivia Haigh Williams","height":"5' 9\" (1.75 m)","bio":"Olivia Williams was born July 26, 1968 in Camden Town, London. She was educated at South Hampstead High School, an independent school for girls in Hampstead, North London, followed by Newnham College at the University of Cambridge. She graduated with a degree in English literature. She went on to study drama at the Bristol Old Vic Theatre School for two years and spent three years at the Royal Shakespeare Company. After having made appearances in several theater productions, her first significant appearance in the made-for-television film Emma (1996), based on Jane Austen's 1816 novel. She made her film debut in The Postman (1997), and went on to play the part of Rosemary Cross in Wes Anderson's Rushmore (1998), Bruce Willis's wife in M. Night Shyamalan's The Sixth Sense (1999), Madeleine in The Heart of Me (2002) (for which she won the British Independent Film Award for Best Actress), and Ruth Lang in Roman Polanski's The Ghost Writer (2010). Her performance earned her ALFS, and NSFC Awards.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MzczNjQxN15BMl5BanBnXkFtZTcwNTQ1MzIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0931404","name":"Olivia Williams","idIMDB":"nm0931404"},"actorId":"nm0931404","character":"Mam Ward","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John DeSantis","urlProfile":"http://www.imdb.com/name/nm0220883","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE0Mzg5MjYzN15BMl5BanBnXkFtZTcwNDI0OTQwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 9\" (2.06 m)","bio":"John DeSantis was born in Nanaimo, British Columbia, Canada. He is known for his work on Master and Commander: The Far Side of the World (2003), Seventh Son (2014) and The 13th Warrior (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE0Mzg5MjYzN15BMl5BanBnXkFtZTcwNDI0OTQwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0220883","name":"John DeSantis","nicknames":["Big John"],"idIMDB":"nm0220883"},"actorId":"nm0220883","character":"Tusk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kit Harington","urlProfile":"http://www.imdb.com/name/nm3229685","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2NTI0NjYxMTBeQTJeQWpwZ15BbWU3MDIxMjgyNzY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 December 1986","placeOfBirth":" London, England, UK","birthName":"Christopher Catesby Harington","height":"5' 8\" (1.73 m)","bio":"Kit Harington was born Christopher Catesby Harington in Acton, London, to Deborah Jane (Catesby), a former playwright, and David Richard Harington, a businessman. His mother named him after 16th century British playwright and poet Christopher Marlowe, whose first name was shortened to Kit, a name Harington prefers. Harington's uncle is Sir Nicholas John Harington, the 14th Baronet Harington, and his paternal great-grandfather was Sir Richard Harington, the 12th Baronet Harington. Through his paternal grandmother, Lavender Cecilia Denny, Kit's eight times great-grandfather was King Charles II of England. Also through his father, Harington descends from politician Henry Dundas, 1st Viscount Melville, the bacon merchant T. A. Denny, clergyman Baptist Wriothesley Noel, merchant and politician Peter Baillie, peer William Legge, 4th Earl of Dartmouth, and MP Sir William Molesworth, 6th Baronet. Harington was a pupil at the Southfield Primary School from 1992 to 1998. When he was 11, his family moved to Worcestershire, and he studied at the Chantry High School in Martley until 2003. He became interested in acting after watching a production of Waiting for Godot when he was 14, and he performed in several school productions. He attended Worcester Sixth Form College, where he studied Drama and Theatre Studies, between 2003 and 2005. When he was 17, he was inspired to study acting in a drama school after watching a performance by Ben Whishaw playing Hamlet in 2004. He moved back to London when he was eighteen and a year later attended the Central School of Speech and Drama, from which he graduated in 2008.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2NTI0NjYxMTBeQTJeQWpwZ15BbWU3MDIxMjgyNzY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3229685","name":"Kit Harington","idIMDB":"nm3229685"},"actorId":"nm3229685","character":"Mr. Bradley","urlCharacter":"http://www.imdb.com/character/ch0408456","main":true},{"actorName":"Djimon Hounsou","urlProfile":"http://www.imdb.com/name/nm0005023","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ2NTM4MzI4M15BMl5BanBnXkFtZTcwOTkxMjcxNA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1964","placeOfBirth":" Cotonou, Benin","birthName":"Djimon Gaston Hounsou","height":"6' 1½\" (1.87 m)","bio":"Djimon Hounsou was born in Cotonou, Benin, West Africa, to Albertine and Pierre Hounsou, a cook. He moved to Lyon, France, when he was 13. Hounsou has graced the catwalks of Paris and London as a popular male model. He has since left his modeling career and has worked on Gladiator (2000) by Ridley Scott and Amistad (1997) by Steven Spielberg.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ2NTM4MzI4M15BMl5BanBnXkFtZTcwOTkxMjcxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005023","name":"Djimon Hounsou","idIMDB":"nm0005023"},"actorId":"nm0005023","character":"Radu","urlCharacter":"http://www.imdb.com/character/ch0463334","main":true},{"actorName":"Gerard Plunkett","urlProfile":"http://www.imdb.com/name/nm0687679","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMTU4NDcyMF5BMl5BanBnXkFtZTgwNTA1MTA1MjE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Gerard Plunkett was born and raised in Dublin, Ireland. The versatile actor began his career as a stand-up comic and impressionist on the Cabaret scene in his native Ireland. He later became involved in improvisational comedy and a career in theater soon followed. The veteran actor has received best actor awards for his work on both stage and screen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMTU4NDcyMF5BMl5BanBnXkFtZTgwNTA1MTA1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0687679","name":"Gerard Plunkett","idIMDB":"nm0687679"},"actorId":"nm0687679","character":"Inquisitor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Scott Lee","urlProfile":"http://www.imdb.com/name/nm0001462","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNzMwNTcwMV5BMl5BanBnXkFtZTYwNTcyNTc3._V1_UY44_CR24,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1966","placeOfBirth":" Los Angeles, California, USA","height":"5' 10\" (1.78 m)","bio":"Of Hawaiian and Chinese descent, Jason Scott Lee was born in Los Angeles, California, but raised in Hawaii from the age of two. His interest in acting began while studying in high school. It blossomed further when he enrolled in Fullerton College, where he studied under acting coach Sal Romeo. His first film role was in Born in East L.A. (1987). After taking many supporting roles, he took his star turn in Dragon: The Bruce Lee Story (1993). His next starring role was in Le livre de la jungle (1994). Though he has not yet panned out as a leading man, Jason continues to work in supporting roles while pursuing his interest in live theater.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNzMwNTcwMV5BMl5BanBnXkFtZTYwNTcyNTc3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001462","name":"Jason Scott Lee","idIMDB":"nm0001462"},"actorId":"nm0001462","character":"Urag","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kandyse McClure","urlProfile":"http://www.imdb.com/name/nm0565973","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5ODUyNzk3Nl5BMl5BanBnXkFtZTgwOTU4MDU0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1980","placeOfBirth":" South Africa","birthName":"Candice McClure","height":"5' 2\" (1.57 m)","bio":"Kandyse McClure is a Canadian actress born on March 22, 1980 in Durban in South Africa. She graduated from West Vancouver Secondary School in 1998. She is an actress, known for main roles in TV series Battlestar Galactica (2004), Hemlock Grove (2013), and from the movies Carrie (2002) and Seventh Son (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5ODUyNzk3Nl5BMl5BanBnXkFtZTgwOTU4MDU0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0565973","name":"Kandyse McClure","idIMDB":"nm0565973"},"actorId":"nm0565973","character":"Sarikin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Luc Roderique","urlProfile":"http://www.imdb.com/name/nm3526638","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MTkxNzEzMl5BMl5BanBnXkFtZTgwMTI1OTEwMDE@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Luc Roderique was born in Ottawa, Ontario, Canada to a Trinidadian father and German mother. From an early age he took an interest in acting and after taking classes at the Ottawa School of Speech & Drama, he attended both Ottawa's Canterbury High School for the Arts and Vancouver's Studio 58.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTEwZDQxODQtNGIxMS00OTRlLThmMTItZDgxYzJkZDE4ZTU4XkEyXkFqcGdeQXVyMjQxNzI4MjU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3526638","name":"Luc Roderique","idIMDB":"nm3526638"},"actorId":"nm3526638","character":"Strix","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zahf Paroo","urlProfile":"http://www.imdb.com/name/nm0354427","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ0NDIwODgzOV5BMl5BanBnXkFtZTgwMzc1MjA2MDI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 December 1975","placeOfBirth":"","birthName":"Zahfeer Hajee","height":"5' 11\" (1.8 m)","bio":"Zahf Paroo has been working as professional actor, host, voice-over and sketch comedy artist since 1995. His versatility and range have allowed him to play all character types over the span of his film career, from devout religious astronauts to a 4-armed blue skinned evil witch, to corporate sharks to flamboyant, fresh-off-the-boat hairdressers. Zahf graduated with honors from the Theatre Arts Program at Mount Royal University, and moved to Vancouver, BC where he thrived until his move to Los Angeles. Through his long and diverse career Zahf has worked with some truly amazing actors while honing his craft. He's had the opportunity to work in Sci-fi (Stargate SG-1, Battlestar Gallactica, Fringe, Andromeda, Continuum, Defying Gravity) as well as working in comedy (Scary Movie, The Big Year, Psych, A Guy Thing, Say it isn't So, Scooby Doo 2, Package Deal). He has also enjoyed a dramatic career (Edgemont -The Next Generation, Firewall, Motive) and most most recently, broken into the fantasy realm in Seventh Son as the beastly, blue-skinned, four-armed \"King of Swords\" 'Virahadra'. Zahf is also an accomplished theatre performer, and among his many theatrical roles, spent a year on Broadway, in the original cast production of Andrew Lloyd Webber's \"Bombay Dreams\". Zahf's role included playing an astounding 14 characters in the production. In his personal life, Zahf is an avid 'foodie' and sneaker collector. He loves diversity in music, fashion and entertainment. He was married in 2012 and loves his time spent also working as a teacher, playwright and director.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ0NDIwODgzOV5BMl5BanBnXkFtZTgwMzc1MjA2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0354427","name":"Zahf Paroo","idIMDB":"nm0354427"},"actorId":"nm0354427","character":"Virahadra","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Timothy Webber","urlProfile":"http://www.imdb.com/name/nm0916448","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzMjA0NDMwNjleQTJeQWpwZ15BbWU3MDAxNzcyMzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Timothy Webber is an actor, known for Cypher (2002), Au nord du 60e (1992) and Seventh Son (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzMjA0NDMwNjleQTJeQWpwZ15BbWU3MDAxNzcyMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0916448","name":"Timothy Webber","idIMDB":"nm0916448"},"actorId":"nm0916448","character":"Malcom Ward","urlCharacter":"http://www.imdb.com/character/ch0300207","main":true}],"seasons":[],"idIMDB":"tt1121096","urlIMDB":"http://www.imdb.com/title/tt1121096","business":{"budget":{"money":"$95,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$7,217,640","country":"USA","day":"08","month":"02","year":"2015","remarks":"2,875 Screens"}],"gross":[{"money":"$17,223,265","country":"USA","day":"02","month":"04","year":"2015","remarks":""},{"money":"$17,176,900","country":"USA","day":"15","month":"03","year":"2015","remarks":""},{"money":"$17,012,745","country":"USA","day":"08","month":"03","year":"2015","remarks":""},{"money":"$16,711,970","country":"USA","day":"01","month":"03","year":"2015","remarks":""},{"money":"$16,043,235","country":"USA","day":"22","month":"02","year":"2015","remarks":""},{"money":"$14,027,000","country":"USA","day":"15","month":"02","year":"2015","remarks":""},{"money":"$7,217,640","country":"USA","day":"08","month":"02","year":"2015","remarks":""},{"money":"$110,623,265","country":"Worldwide","day":"09","month":"07","year":"2015","remarks":""},{"money":"$109,823,265","country":"Worldwide","day":"02","month":"04","year":"2015","remarks":""}],"weekendGross":[{"money":"$90,060","country":"USA","day":"15","month":"03","year":"2015","remarks":"116 Screens"},{"money":"$165,500","country":"USA","day":"08","month":"03","year":"2015","remarks":"203 Screens"},{"money":"$322,085","country":"USA","day":"01","month":"03","year":"2015","remarks":"339 Screens"},{"money":"$967,700","country":"USA","day":"22","month":"02","year":"2015","remarks":"1,019 Screens"},{"money":"$4,756,000","country":"USA","day":"15","month":"02","year":"2015","remarks":"2,874 Screens"},{"money":"$7,217,640","country":"USA","day":"08","month":"02","year":"2015","remarks":"2,875 Screens"}],"admissions":null,"productionDates":{"money":null,"country":null,"day":"25","month":"11","year":"2012","remarks":null},"filmingDates":[{"money":null,"country":null,"day":"16","month":"01","year":"2012","remarks":null},{"money":null,"country":null,"day":"26","month":"07","year":"2012","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 42 min (102 min)"],"soundMix":["Dolby Digital","Datasat","SDDS","Dolby Surround 7.1"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa","Panavision Primo Lenses"],"laboratory":["Company 3 (digital intermediate)"],"filmLength":null,"negativeFormat":["Codex"],"cinematographicProcess":["ARRIRAW (2.8K) (source format)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","D-Cinema (also 3-D version)"]},"rating":"5,5","metascore":"30","filmingLocations":[{"location":"Horsethief Canyon, Drumheller, Alberta, Canada"}],"rated":"PG-13","awards":[{"award":"Central Ohio Film Critics Association 2016","titlesAwards":[{"titleAwardOutcome":"Won COFCA Award","categories":[{"category":"Actor of the Year","names":[{"name":"Alicia Vikander","id":"nm2539953","role":null},{"name":"Burnt","id":"tt2503944","role":null},{"name":"The Danish Girl","id":"tt0810819","role":null},{"name":"Ex Machina","id":"tt0470752","role":null},{"name":"The Man from U.N.C.L.E.","id":"tt1638355","role":null},{"name":"Testament of Youth","id":"tt1441953","role":null}]},{"category":"Breakthrough Film Artist","names":[{"name":"Alicia Vikander","id":"nm2539953","role":null},{"name":"Burnt","id":"tt2503944","role":null},{"name":"The Danish Girl","id":"tt0810819","role":null},{"name":"Ex Machina","id":"tt0470752","role":null},{"name":"The Man from U.N.C.L.E.","id":"tt1638355","role":null},{"name":"Testament of Youth","id":"tt1441953","role":null}]}]}]},{"award":"Razzie Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Supporting Actress","names":[{"name":"Julianne Moore","id":"nm0000194","role":null}]}]}]}],"votes":"59 213","type":"Movie","companyCreditsSimple":[{"idCompany":"co0494795","name":"Beijing Skywheel Entertainment Co."},{"idCompany":"co0357194","name":"China Film Co."},{"idCompany":"co0159111","name":"Legendary Entertainment"}],"keywords":{"keywords":["witch","apprentice","master apprentice relationship","exorcism","demon","sword and fantasy","sword and sorcery","pit","farmer","escape","queen","magic","castle","village","mountain","hope","training","monster","creature","love","pitchfork","oil","campfire","claw","blade","redemption","rolling down a hill","talisman","chase","gravestone","tragic hero","assistant","warlock","swordsman","disfigurement","silver","darkness","cauldron","gemstone","skinny dipping","crisis of conscience","hired killer","gold coin","axe throwing","rescue","female thief","farmboy","farm","two man army","kidnapping","regeneration","crossbow","net","bow and arrow","cliffhanging","horse drawn carriage","horse","troll","showdown","fighting in the air","armory","ambush","demonic possession","bell tower","church","bar fight","tavern","caught in a net","lightning","henchman","rainstorm","heavy rain","cloak","branding","waterfall","walled city","bridge","hallucination","full moon","blood moon","snow","robbery","female killer","leopard","bear","dog","deer","caged human","mentor protege relationship","teacher student relationship","tapestry","falling from height","child in peril","betrayal","deception","self sacrifice","dark forest","woods","forest","irish","eaten alive","attack","revenge","target practice","knife throwing","bookshelf","montage","skeleton","skull","tail","turned to stone","transformation","world domination","race against time","coming of age","bravery","courage","fear","female spy","teleportation","premonition","pendant","scepter","burned to death","burned alive","torch","spear","axe","knife","sword","giant monster","giant creature","giant","impalement","shape shifting","threatened with a knife","knife fight","hand to hand combat","mixed martial arts","martial arts","battlefield","brawl","fight","fistfight","retirement","destiny","unrequited love","axe fight","sword fight","combat","battle","sororicide","villain turns good","mother son relationship","mother daughter relationship","femme fatale","villainess","eccentric","warrior","tough guy","knight","assassination attempt","assassin","army","soldier","exploding body","explosion","black magic","woman kills a woman","woman kills a man","man kills a woman","throat slitting","strangulation","stabbed to death","stabbed in the back","stabbed in the chest","stabbed in the leg","stabbed in the shoulder","stabbed in the head","stabbed in the face","violence","murder","good versus evil","jumping into water","jumping from height","son of a witch","daughter of a witch","sister sister relationship","death","fire","cage","dragon","witch hunter","witch burning","possession","vision","supernatural power","dark fantasy","lancashire","ghost","death of mother","3 dimensional","urination","sole black character dies cliche","underwater scene","aerial shot","slow motion scene","death of student","alcoholic","prologue","time lapse photography","pig","stylized violence","dual wield","troubled production","no opening credits","black comedy","wisecrack humor","tragic villain","dark hero","anti hero","action hero","surrealism","fictional war","catfight","based on novel","title spoken by character","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:36:47"}}