{"data":{"movies":[{"title":"Black Death","originalTitle":"","year":"2010","releaseDate":"20100611","directors":[{"name":"Christopher Smith","id":"nm1247462"}],"writers":[{"name":"Dario Poloni","id":"nm0689785"}],"runtime":"102 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNjEwNjY3NV5BMl5BanBnXkFtZTcwMTY1NTUyNA@@._V1.jpg","countries":["Germany","UK"],"languages":["English","Latin"],"genres":["Action","Adventure","Drama","History","Horror","Mystery"],"plot":"Set during the time of the first outbreak of bubonic plague in England, a young monk is tasked with learning the truth about reports of people being brought back to life, a mission that pulls him toward a village ruler who has made a dark pact with evil forces.","simplePlot":"Set during the time of the first outbreak of bubonic plague in England, a young monk is given the task of learning the truth about reports of people being brought back to life in a small village.","actors":[{"actorName":"Sean Bean","urlProfile":"http://www.imdb.com/name/nm0000293","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMzc4MDk5OF5BMl5BanBnXkFtZTcwODg3MjUxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1959","placeOfBirth":" Sheffield, South Yorkshire, England, UK","birthName":"Shaun Mark Bean","height":"5' 10½\" (1.79 m)","bio":"Sean Bean's 20 year career spans theater, radio, television and movies. Bean was born in Handsworth, Sheffield, West Riding of Yorkshire, to Rita (Tuckwood) and Brian Bean. He worked for his father's welding firm before he decided to become an actor. He attended RADA in London and appeared in a number of West End stage productions including RSC's \"Fair Maid of the West\" (Spencer), (1986) and \"Romeo and Juliet\" (1987) (Romeo) , as well as \"Deathwatch\" (Lederer) (1985) at the Young Vic and \"Killing the Cat\" (Danny) (1990) at the Theatre Upstairs. This soulful, green-eyed blonde's roles are so varied that his magnetic persona convincing plays angst-ridden villains, as in Clarissa (1991), passionate lovers like Mellors in Lady Chatterley (1993), rough-and-ready soldiers such as Richard Sharpe, heartwrenching warriors as the emotionally torn Boromir in \"The Lord of the Rings,\" and noble Greeks, like Odysseus in Troy (2004), where his very presence in the film adds grace and validity to the rest of the movie. Recently, he did a turn in Shakespeare's \"Macbeth,\" where as the principal lead, he so transfixed the audience that the show was extended in London and critically acclaimed. Bean, however, remains himself, a man's man, and in the glizty world of movies this is a rare thing indeed. Bean resides in London where he enjoys raising his beautiful daughters, his beloved football, and the occasional pint. Bean has three daughters, Lorna, Molly and Evie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMzc4MDk5OF5BMl5BanBnXkFtZTcwODg3MjUxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000293","name":"Sean Bean","idIMDB":"nm0000293"},"actorId":"nm0000293","character":"Ulrich","urlCharacter":"http://www.imdb.com/character/ch0250805","main":true},{"actorName":"Eddie Redmayne","urlProfile":"http://www.imdb.com/name/nm1519666","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MjEyNzQyM15BMl5BanBnXkFtZTcwMTc4ODUxOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 January 1982","placeOfBirth":" London, England, UK","birthName":"Edward John David Redmayne","height":"6' 0½\" (1.84 m)","bio":"British actor Eddie Redmayne is the first, and thus far only, millennial male to have won an acting Oscar (for The Theory of Everything (2014)). Edward John David Redmayne was born and raised in London, England, the son of Patricia (Burke) and Richard Charles Tunstall Redmayne, a businessman. His great-grandfather was Sir Richard Augustine Studdert Redmayne, a noted civil and mining engineer. He has English, Irish, Scottish and Welsh ancestry. Redmayne is the only member of his family to follow a career in acting, and also modeled during his teen years. He was educated at Eton College before going on to Trinity College, Cambridge, where he studied History of Art. Encouraged by his parents, Redmayne took drama lessons from a young age. His first stage appearance was in the Sam Mendes production of \"Oliver!\", in London's West End. He played a workhouse boy. Acting continued through school and university, including performing with the National Youth Music Theatre. Redmayne's first professional stage performance came in 2002 at Shakespeare's Globe Theatre where he played Viola in \"Twelfth Night\". In 2004, he won the prestigious Evening Standard Outstanding Newcomer Award for his working in Edward Albee's play \"The Goat\". Further stage successes followed, and in 2009, he starred in John Logan's \"Red\" at the Donmar Warehouse in London. He won huge critical acclaim for his role, winning an Oliver Award for Best Actor in a Supporting Role. The play transferred to Broadway in 2010, and Redmayne went on to win a Tony Award for Best Performance by a Featured Actor in a Play. Alongside his stage career, Redmayne has worked steadily in television and film. Notable projects include Robert De Niro's The Good Shepherd (2006), Elizabeth: The Golden Age (2007), Tess of the D'Urbervilles (2008), Les piliers de la terre (2010) and My Week with Marilyn (2011). He co-starred as Marius Pontmercy in the musical Les Misérables (2012). He played scientist Stephen Hawking in the biographical drama The Theory of Everything (2014), opposite Felicity Jones, as Stephen's wife Jane Hawking. For his performance, Redmayne won multiple awards, including the Academy Award for Best Actor. As such, he became the first man born in the 1980s to win an acting Oscar. He received further critical acclaim for his portrayal of Lili Elbe, one of the first known recipients of sex reassignment surgery, in The Danish Girl (2015). For his performance, he was nominated for multiple awards, including the Academy Award for Best Actor. In 2014, Redmayne married publicist Hannah Bagshawe.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MjEyNzQyM15BMl5BanBnXkFtZTcwMTc4ODUxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1519666","name":"Eddie Redmayne","idIMDB":"nm1519666"},"actorId":"nm1519666","character":"Osmund","urlCharacter":"http://www.imdb.com/character/ch0227455","main":true},{"actorName":"John Lynch","urlProfile":"http://www.imdb.com/name/nm0001487","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3NTAwODE2NV5BMl5BanBnXkFtZTcwNjA4ODIyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 December 1961","placeOfBirth":" Corrinshego, Newry, Northern Ireland, UK","bio":"John Lynch was born on December 26, 1961 in Corrinshego, Newry, Northern Ireland. He is an actor, known for Sliding Doors (1998), Black Death (2010) and The Secret Garden (1993). He was previously married to Mary McGuckian.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3NTAwODE2NV5BMl5BanBnXkFtZTcwNjA4ODIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001487","name":"John Lynch","idIMDB":"nm0001487"},"actorId":"nm0001487","character":"Wolfstan","urlCharacter":"http://www.imdb.com/character/ch0227457","main":true},{"actorName":"Tim McInnerny","urlProfile":"http://www.imdb.com/name/nm0570570","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NzEyMzg3MF5BMl5BanBnXkFtZTgwNjkzNTIyNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1956","placeOfBirth":" Cheadle Hulme, Cheshire, England, UK","birthName":"Timothy L. McInnerny","height":"6' 1\" (1.86 m)","bio":"Tim McInnerny was born on September 18, 1956 in Cheadle Hulme, Cheshire, England as Timothy L. McInnerny. He is an actor, known for Notting Hill (1999), MI-5 (2015) and Eddie the Eagle (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NzEyMzg3MF5BMl5BanBnXkFtZTgwNjkzNTIyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0570570","name":"Tim McInnerny","idIMDB":"nm0570570"},"actorId":"nm0570570","character":"Hob","urlCharacter":"http://www.imdb.com/character/ch0227467","main":true},{"actorName":"Kimberley Nixon","urlProfile":"http://www.imdb.com/name/nm2632878","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYzMDc5NDE2NV5BMl5BanBnXkFtZTcwMzg1NjcxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 September 1985","placeOfBirth":" Bristol, England, UK","height":"5' 5\" (1.65 m)","bio":"Kimberley Nixon was born on September 24, 1985 in Bristol, England. She is an actress, known for Black Death (2010), Easy Virtue (2008) and Angus, Thongs and Perfect Snogging (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYzMDc5NDE2NV5BMl5BanBnXkFtZTcwMzg1NjcxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2632878","name":"Kimberley Nixon","nicknames":["Kimbo"],"idIMDB":"nm2632878"},"actorId":"nm2632878","character":"Averill","urlCharacter":"http://www.imdb.com/character/ch0145022","main":true},{"actorName":"Andy Nyman","urlProfile":"http://www.imdb.com/name/nm0638762","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzODkwNzQ0MF5BMl5BanBnXkFtZTcwNjQwODA0OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1966","placeOfBirth":" Leicester, Leicestershire, England, UK","height":"5' 6\" (1.68 m)","bio":"Andy Nyman was born on April 13, 1966 in Leicester, Leicestershire, England. He is an actor and producer, known for Death at a Funeral (2007), Severance (2006) and Shaun the Sheep Movie (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzODkwNzQ0MF5BMl5BanBnXkFtZTcwNjQwODA0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0638762","name":"Andy Nyman","idIMDB":"nm0638762"},"actorId":"nm0638762","character":"Dalywag","urlCharacter":"http://www.imdb.com/character/ch0227458","main":true},{"actorName":"David Warner","urlProfile":"http://www.imdb.com/name/nm0001831","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMzg2Nzg1MjheQTJeQWpwZ15BbWU3MDk4Nzg0Mzg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1941","placeOfBirth":" Manchester, England, UK","height":"6' 2\" (1.88 m)","bio":"David Hattersley Warner was born July 29, 1941 in Manchester, England, to Ada Doreen (Hattersley) and Herbert Simon Warner. He has described his childhood as \"messy\". His father changed jobs often and moved from town to town. David attended eight schools and \"failed his exams at all of them\". His parents separated when he was a teenager and he only saw his mother again seven years later - on her deathbed. After a series of odd jobs, he was accepted at the Royal Academy of Dramatic Arts (RADA) where he was very unhappy. After RADA, he became a member of the Royal Shakespeare Company and got the role of Blifil in the adventure comedy Tom Jones (1963). With the title role in the comedy-drama Morgan! (1966) and a two-year stint as Hamlet with the RSC, Warner became a star at age 24. He has often played villains in such films as The Thirty-Nine Steps (1978), Time After Time (1979), Time Bandits (1981), TRON (1982) and Titanic (1997). He also appeared in Star Trek V: The Final Frontier (1989) and Star Trek VI: The Undiscovered Country (1991), two sequels to the popular Star Trek films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMzg2Nzg1MjheQTJeQWpwZ15BbWU3MDk4Nzg0Mzg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001831","name":"David Warner","idIMDB":"nm0001831"},"actorId":"nm0001831","character":"Abbot","urlCharacter":"http://www.imdb.com/character/ch0437859","main":true},{"actorName":"Johnny Harris","urlProfile":"http://www.imdb.com/name/nm0364890","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NTc2MTU5M15BMl5BanBnXkFtZTgwMjY5NjQ4ODE@._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1974","placeOfBirth":" Lambeth, London, England, UK","bio":"Johnny Harris was born in Lambeth, London. Harris started his career on the stage in the fringe theatres of London. He was a company member of The Union Theatre in Southwark. In 2000 he was cast in his first feature film, Paul McGuigan's Gangster No.1. His first breakthrough role came in 2006 with his performance in the multi award-winning and BAFTA-nominated feature film 'London to Brighton'. Despite being made on a tiny budget, the film received huge critical acclaim worldwide and was voted into Time Out Magazine's '100 Best British Films of All Time' with noteworthy actors and directors regarding Johnny's performance as \"outstanding\" and astonishing.\" In an interview in The Independent on Sunday at the time of the film's release, celebrated British director Shane Meadows said of Harris' performance in the film: \"It's an incredibly bold and massively powerful performance, the best I've seen on celluloid for a long time.\" Four years later, Harris' breakthrough role came when Meadows cast him in This is England '86 and his portrayal of Lol's abusive father in the show saw him receive both BAFTA and The Royal Television Society Award nominations for his performance. The following year he reprised the chilling role of Mick in This is England '88 with the show winning the BAFTA T.V award for 'Best Mini-series'. Johnny continued his run of award-winning projects with a leading role in the hit BBC drama The Fades, clinching the BAFTA T.V Award for 'Best Drama Series'. In 2012 he was back in our cinemas in Universal Pictures smash hit film Snow White and the Huntsman starring Kristen Stewart and Charlize Theron. He played one of the eight dwarfs alongside the late Bob Hoskins, Ray Winstone, Nick Frost, and Eddie Marsan. Another feature film soon followed and Harris was seen in the brilliant Welcome to the Punch with James McAvoy, Andrea Riseborough, Mark Strong, and Peter Mullan, which went on international release in 2013. Nev Pierce, Editor of Empire Magazine, has described Johnny as \"An heir to Oldman, in terms of being able to be both sensitive and scary, indelible and real.\" This year, in May 2015, Johnny has his first starring role in a big feature film in the eagerly anticipated, Monsters: Dark Continent. He'll play haunted and damaged U.S. soldier 'Noah Frater' in the follow-up to Monsters, Gareth Edward's international hit film of 2010. He is also starring in Fortitude, a new 12-part drama for Sky Atlantic/Pivot alongside Sir Michael Gambon, Stanley Tucci, and Christopher Ecclestone. The show was filmed on location in Iceland and London. Johnny's latest project is From Darkness, a new four part drama for BBC1. He'll play DCI John Hind opposite Anne-Marie Duff with filming taking place on location in Manchester and Scotland.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NTc2MTU5M15BMl5BanBnXkFtZTgwMjY5NjQ4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0364890","name":"Johnny Harris","idIMDB":"nm0364890"},"actorId":"nm0364890","character":"Mold","urlCharacter":"http://www.imdb.com/character/ch0227456","main":true},{"actorName":"Emun Elliott","urlProfile":"http://www.imdb.com/name/nm2047170","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNTg2NjMzOF5BMl5BanBnXkFtZTgwMzg2ODA3MjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1983","placeOfBirth":" Edinburgh, Scotland, UK","birthName":"Emun Mohammedi","height":"5' 9\" (1.75 m)","bio":"Emun Elliott was born on November 28, 1983 in Edinburgh, Scotland as Emun Mohammedi. He is an actor, known for Prometheus (2012), Star Wars: The Force Awakens (2015) and Filth (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNTg2NjMzOF5BMl5BanBnXkFtZTgwMzg2ODA3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2047170","name":"Emun Elliott","idIMDB":"nm2047170"},"actorId":"nm2047170","character":"Swire","urlCharacter":"http://www.imdb.com/character/ch0227469","main":true},{"actorName":"Tygo Gernandt","urlProfile":"http://www.imdb.com/name/nm0314611","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MTAwMjkxM15BMl5BanBnXkFtZTgwNTM4NzU1NTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 April 1974","placeOfBirth":" Amsterdam, Noord-Holland, Netherlands","height":"6' 2¾\" (1.9 m)","bio":"At the age of twelve, Tygo was seen on television for the first time in a promotion video to get the Olympic Games to the Netherlands. His role in the youth series 'Fort Alpha' made him famous in the Netherlands. After that, many guest appearances followed, as well as leading parts in television series like 'De Garage', 'Van Speijk' and 'Het Schnitzelparadijs'. Tygo starred in feature films 'Naar De Klote','De Dominee', 'Ik omhels je met 1000 armen' and 'Dunya & Desie'. For his leading role in the feature film 'Van God Los', Tygo was granted with a Golden Calf (the Dutch Oscars) for Best Actor in 2003. In 2005 he won a Golden Calf for his role in the feature film 'Het Schnitzelparadijs', but this time he shared the award with his four co-stars. This year, Tygo can be seen in the Dutch cinema starring in 'Oorlogswinter', 'Mijn vader is een detective' and 'Het Leven Uit Een Dag'. Tygo just finished shooting two films in which he plays the lead, 'Carmen van het Noorden' and 'First Mission'. On stage, he is starring the leading role in the successful theatre production RAAF (2009). Tygo is a professional voice actor, giving sound to many Disney animation characters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MTAwMjkxM15BMl5BanBnXkFtZTgwNTM4NzU1NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0314611","name":"Tygo Gernandt","idIMDB":"nm0314611"},"actorId":"nm0314611","character":"Ivo","urlCharacter":"http://www.imdb.com/character/ch0227472","main":true},{"actorName":"Jamie Ballard","urlProfile":"http://www.imdb.com/name/nm2756520","urlPhoto":"","biography":{"bio":"Jamie Ballard is an actor, known for Black Death (2010), A Brilliant Young Mind (2014) and Suffragette (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2756520","name":"Jamie Ballard","idIMDB":"nm2756520"},"actorId":"nm2756520","character":"Griff","urlCharacter":"http://www.imdb.com/character/ch0227465","main":true},{"actorName":"Carice van Houten","urlProfile":"http://www.imdb.com/name/nm0396924","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNjkyNzEyOV5BMl5BanBnXkFtZTcwNjE5MDUyNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 September 1976","placeOfBirth":" Leiderdorp, Zuid-Holland, Netherlands","birthName":"Carice Anouk van Houten","height":"5' 5\" (1.65 m)","bio":"One of Europe's most celebrated actresses, Carice van Houten is perhaps best known for her lead roles in Paul Verhoeven's award-winning Black Book, Bryan Singer's Valkyrie opposite Tom Cruise and Game of Thrones. Her Dutch-language feature Love Life, gained her further critical acclaim and broke box office records in her native Holland. Her next film Happy Housewive won her a record breaking 5th Golden Calf at The Netherlands Film Festival and was voted 'Best Dutch Actress of All Time' by the Dutch audience. Other awards include Best Actress for Black Butterflies at the Tribeca Film Festival. Recent credits include Juan Carlos Fresnadillo's Intruders and Bill Condon's The Fifth Estate, the Jesse Owens biopic, Race, with Jason Sudekis and Jeremy Irons and voiced a character in The Simpsons. She can next be seen in Brimstone, opposite Dakota Fanning, Guy Pearce and Kit Harrington, and will be reprising her role in HBO's hit series, Game of Thrones as the Priestess, Lady Melisandre.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNjkyNzEyOV5BMl5BanBnXkFtZTcwNjE5MDUyNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0396924","name":"Carice van Houten","idIMDB":"nm0396924"},"actorId":"nm0396924","character":"Langiva","urlCharacter":"http://www.imdb.com/character/ch0126544","main":true},{"actorName":"Daniel Steiner","urlProfile":"http://www.imdb.com/name/nm1340602","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTY2N2YwMDAtYzBhZi00MWE1LWE5MzctMmY0ZGE0YzYwNTQyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNDE4MDU5OTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Daniel Steiner is an actor and director, known for The Grand Budapest Hotel (2014), SOKO Leipzig (2001) and Black Death (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTY2N2YwMDAtYzBhZi00MWE1LWE5MzctMmY0ZGE0YzYwNTQyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNDE4MDU5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1340602","name":"Daniel Steiner","idIMDB":"nm1340602"},"actorId":"nm1340602","character":"Monk","urlCharacter":"http://www.imdb.com/character/ch0227462","main":true},{"actorName":"Tobias Kasimirowicz","urlProfile":"http://www.imdb.com/name/nm1346528","urlPhoto":"","biography":{"dateOfBirth":"22 February 1976","placeOfBirth":" Düsseldorf, North Rhine-Westphalia, West Germany","height":"5' 3½\" (1.61 m)","bio":"Tobias Kasimirowicz was born on February 22, 1976 in Düsseldorf, North Rhine-Westphalia, West Germany. He is an actor, known for Black Death (2010), Kleinruppin forever (2004) and Wo ist Fred? (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1346528","name":"Tobias Kasimirowicz","idIMDB":"nm1346528"},"actorId":"nm1346528","character":"Grimbold","urlCharacter":"http://www.imdb.com/character/ch0437857","main":true},{"actorName":"Keith Dunphy","urlProfile":"http://www.imdb.com/name/nm1833012","urlPhoto":"","biography":{"bio":"Keith Dunphy is an actor, known for Children of Men (2006), Les Misérables (2012) and Rogue One (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1833012","name":"Keith Dunphy","idIMDB":"nm1833012"},"actorId":"nm1833012","character":"Witch Finder","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1181791","urlIMDB":"http://www.imdb.com/title/tt1181791","business":{"budget":null,"openingWeekend":[{"money":"$6,692","country":"USA","day":"21","month":"07","year":"2012","remarks":"2 Screens"},{"money":"£49,372","country":"UK","day":"13","month":"06","year":"2010","remarks":"56 Screens"}],"gross":[{"money":"$22,554","country":"USA","day":"10","month":"04","year":"2011","remarks":""},{"money":"$19,893","country":"USA","day":"03","month":"04","year":"2011","remarks":""},{"money":"$17,635","country":"USA","day":"27","month":"03","year":"2011","remarks":""},{"money":"$13,677","country":"USA","day":"20","month":"03","year":"2011","remarks":""},{"money":"$6,692","country":"USA","day":"13","month":"03","year":"2011","remarks":""},{"money":"£128,668","country":"UK","day":"11","month":"07","year":"2010","remarks":""},{"money":"£126,254","country":"UK","day":"04","month":"07","year":"2010","remarks":""},{"money":"£120,018","country":"UK","day":"27","month":"06","year":"2010","remarks":""},{"money":"£107,529","country":"UK","day":"20","month":"06","year":"2010","remarks":""},{"money":"£49,372","country":"UK","day":"13","month":"06","year":"2010","remarks":""},{"money":"$265,318","country":"Worldwide","day":"21","month":"07","year":"2012","remarks":""},{"money":"$242,764","country":"Germany","day":"19","month":"09","year":"2010","remarks":""}],"weekendGross":[{"money":"$2,152","country":"USA","day":"10","month":"04","year":"2011","remarks":"5 Screens"},{"money":"$1,688","country":"USA","day":"03","month":"04","year":"2011","remarks":"2 Screens"},{"money":"$2,176","country":"USA","day":"27","month":"03","year":"2011","remarks":"3 Screens"},{"money":"$3,495","country":"USA","day":"20","month":"03","year":"2011","remarks":"5 Screens"},{"money":"$6,692","country":"USA","day":"13","month":"03","year":"2011","remarks":"3 Screens"},{"money":"£708","country":"UK","day":"11","month":"07","year":"2010","remarks":"1 Screen"},{"money":"£1,732","country":"UK","day":"04","month":"07","year":"2010","remarks":"3 Screens"},{"money":"£3,056","country":"UK","day":"27","month":"06","year":"2010","remarks":"8 Screens"},{"money":"£15,964","country":"UK","day":"20","month":"06","year":"2010","remarks":"31 Screens"},{"money":"£49,372","country":"UK","day":"13","month":"06","year":"2010","remarks":"56 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"20","month":"04","year":"2009","remarks":null},{"money":null,"country":null,"day":"09","month":"06","year":"2009","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 42 min (102 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Hawk Anamorphic Lenses"],"laboratory":["Arri Schwarzfilm, Berlin, Germany"],"filmLength":null,"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Digital Intermediate (master format)","Hawk Scope (anamorphic) (source format)"],"printedFilmFormat":["35 mm"]},"rating":"6.4","metascore":"71","filmingLocations":[{"location":"Germany"}],"rated":"R","awards":[{"award":"Fangoria Chainsaw Awards 2012","titlesAwards":[{"titleAwardOutcome":"2nd place Chainsaw Award","categories":[{"category":"Best Actor","names":[{"name":"Sean Bean","id":"nm0000293","role":null}]}]},{"titleAwardOutcome":"Nominated Chainsaw Award","categories":[{"category":"Best Limited-Release/Direct-to-Video Film","names":[]},{"category":"Best Supporting Actor","names":[{"name":"Eddie Redmayne","id":"nm1519666","role":null}]},{"category":"Best Supporting Actress","names":[{"name":"Carice van Houten","id":"nm0396924","role":null}]},{"category":"Best Screenplay","names":[{"name":"Dario Poloni","id":"nm0689785","role":null}]},{"category":"Best Score","names":[{"name":"Christian Henson","id":"nm0378194","role":null}]}]}]},{"award":"Neuchâtel International Fantastic Film Festival 2010","titlesAwards":[{"titleAwardOutcome":"Won Audience Award","categories":[{"category":"","names":[{"name":"Christopher Smith","id":"nm1247462","role":null}]}]},{"titleAwardOutcome":"Nominated Narcisse Award","categories":[{"category":"Best Feature Film","names":[{"name":"Christopher Smith","id":"nm1247462","role":null}]}]}]},{"award":"Screamfest 2010","titlesAwards":[{"titleAwardOutcome":"Won Festival Trophy","categories":[{"category":"Best Actor","names":[{"name":"Sean Bean","id":"nm0000293","role":"actor"}]},{"category":"Best Musical Score","names":[{"name":"Christian Henson","id":"nm0378194","role":"composer"}]}]}]}],"votes":"37,374","type":"Movie","companyCreditsSimple":[{"idCompany":"co0043735","name":"Egoli Tossell Film"},{"idCompany":"co0133023","name":"HanWay Films"},{"idCompany":"co0130369","name":"Zephyr Films"}],"keywords":{"keywords":["monk","bubonic plague","middle ages","heretic","witch hunt","village","forest","england","black death","marsh","swamp","sword and shield","drawn and quartered","year 1348","woman leader","pagan ritual","matriarchy","matriarchal society","female villain","drugged","anti christianity","sword fight","public execution","false accusation","revenge","plague","death","necromancer","sword and sorcery","horse drawn cart","massacre","deception","hanged by the neck","reincarnation","covered in blood","stabbed in the belly","swollen gland","self flagellation","wading in water","animal skull","iron maiden","starts with narration","worship","two word title","torture","sycophant","power","pain","pagan rituals","murderess","matriarch","manipulating woman","feminist","female sociopath","female sadist","female psychopath","female killer","female boss","faking a death","faking","faked death","fake witch","fake identity","fake death","fake","evil woman","evil versus evil","evil man","con woman","foot","foot torture","black magic","hallucination","burned at the stake","stable","axe in the head","abbey","religious conviction","religious nut","torture chamber","execution","sadism","cruelty","stabbing","violence","screaming in pain","bandit","poison","hanged body","back from the dead","offscreen killing","stomach ripped open","religion","arm ripped off","bodily dismemberment","severed arm","severed head","arm cut off","stabbed in the throat","stabbed in the stomach","inquisition","conspiracy","mysterious man","stabbed in the foot","decapitation","head cut off","gore","gothic horror","1340s","14th century","color in title","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:37:18"}}