{"data":{"movies":[{"title":"Bait Shop","originalTitle":"","year":"2008","releaseDate":"20080902","directors":[{"name":"C.B. Harding","id":"nm1085552"}],"writers":[{"name":"Bear Aderhold","id":"nm2021391"},{"name":"Jonathan Bernstein","id":"nm0077080"}],"runtime":"85 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2OTQzMjUzM15BMl5BanBnXkFtZTgwNDYzMjA2MDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"Paradise Lake, near Kissimmee, Florida, is hosting a Professional Bass Association contest. Local bait-shop owner and former amateur champ, Bill Dugan, is in deep trouble: the bank wants $15,000 for the shop's mortgage, he doesn't tell his wife who's angry when she finds out, and his wealthy blow-hard father-in-law wants Bill to work for him. The tournament favorite is Hot Rod Johnson, a crowd-pleaser and ESPN darling who'll do anything to win. Bill's son Scott thinks Hot Rod is cool, Hot Rod opens a huge store close to Bill's, his ne'er-do-well pals are ready to desert him, and Bill may lose it all. His one hope is to enter the contest and win the prize. Time to fish or cut bait.","simplePlot":"The owner of a small town bait shop signs up for a fishing tournament in hopes of using the prize money to save his shop from foreclosure.","actors":[{"actorName":"Bill Engvall","urlProfile":"http://www.imdb.com/name/nm0257821","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MzM1MjM4Ml5BMl5BanBnXkFtZTcwODIxMDE4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1957","placeOfBirth":" Galveston, Texas, USA","birthName":"William Ray Engvall Jr.","height":"6' (1.83 m)","bio":"Bill Engvall was born on July 27, 1957 in Galveston, Texas, USA as William Ray Engvall Jr. He is an actor and writer, known for Blue Collar Comedy Tour: The Movie (2003), Blue Collar TV (2004) and Blue Collar Comedy Tour: One for the Road (2006). He has been married to Mary Gail Watson since December 18, 1982. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MzM1MjM4Ml5BMl5BanBnXkFtZTcwODIxMDE4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0257821","name":"Bill Engvall","idIMDB":"nm0257821"},"actorId":"nm0257821","character":"Bill Dugan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim R. Coleman","urlProfile":"http://www.imdb.com/name/nm0171078","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzODc4OTkwMF5BMl5BanBnXkFtZTcwMTYyODE0Mg@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"bio":"Jim R. Coleman was born on February 9 1961 in Dallas Texas, to James and Ira Coleman. After graduating high school Jim joined the US Army and served 3 years as a Medic. After being honorable discharged Jim moved to Florida where his professional acting career began. Having appeared in more than 50 national commercials he is best known for his role of Roger Parker in the hit Nickelodeon Show My Brother and Me.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzODc4OTkwMF5BMl5BanBnXkFtZTcwMTYyODE0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0171078","name":"Jim R. Coleman","idIMDB":"nm0171078"},"actorId":"nm0171078","character":"Announcer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary Rachel Dudley","urlProfile":"http://www.imdb.com/name/nm0240147","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWRiMzZkMDgtYzZmYS00OGVkLWI4Y2QtZmRmZjExNDJkYWVjXkEyXkFqcGdeQXVyNjA4MDczNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 March 1963","placeOfBirth":" Chelsea, Massachusetts, USA","birthName":"Mary Rachel Quinn","height":"5' 4\" (1.63 m)","bio":"Mary Rachel Quinn was born the eighth of eight children to Olive Trudeau and John Michael Quinn on the Mystic River in Chelsea, Massachusetts. She always had a captive and supportive audience in her brothers and sisters as the acting seed was planted. Mary Rachel found her first supporting roles in Baitshop, as Bill Engvall's wife and daughter to the late Harve Presnell; also in Dear John as Savannah's (Seyfried's) mom with Channing Tatum, Amanda Seyfried and Henry Thomas; Wild Things Foursome with John Schnieder. In 2015, she'll appear as Mrs. Richards in the upcoming Fantastic Four.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWRiMzZkMDgtYzZmYS00OGVkLWI4Y2QtZmRmZjExNDJkYWVjXkEyXkFqcGdeQXVyNjA4MDczNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0240147","name":"Mary Rachel Dudley","idIMDB":"nm0240147"},"actorId":"nm0240147","character":"Laura Dugan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wilbur Houston","urlProfile":"http://www.imdb.com/name/nm3180077","urlPhoto":"","biography":{"bio":"Wilbur Houston is an actor, known for Bait Shop (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3180077","name":"Wilbur Houston","idIMDB":"nm3180077"},"actorId":"nm3180077","character":"Melvin","urlCharacter":"http://www.imdb.com/character/ch0227841","main":true},{"actorName":"Richard Riehle","urlProfile":"http://www.imdb.com/name/nm0726223","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNDgyMDcwOV5BMl5BanBnXkFtZTgwODkwNjY0MTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1948","placeOfBirth":" Menomonee Falls, Wisconsin, USA","height":"5' 9\" (1.75 m)","bio":"Richard Riehle was born in Menomonee Falls, Wisconsin, to Mary Margaret (Walsh), a nurse, and Herbert John Riehle, an assistant postmaster. He is of German and Irish descent. Richard attended the University of Notre Dame, where he became heavily involved with the University Theatre. Appearing in such productions as \"Luther\", \"Antigone\", \"Rhinoceros\", \"Romeo and Juliet\", and \"How To Succeed In Business Without Really Trying\", he also took on the task of stage manager on many of these productions, and it was not unusual to find him helping to build the sets or manage the costumes during this period. Graduating with a B.A. (cum laude) in 1970, Richard traveled to Salzburg and Innsbruck to study German, a language in which he is fluent. Progressing to Academy of Dramatic Art in Rochester, Michigan, Richard has had extensive experience as a stage actor, as well as teaching acting, and made his Broadway debut in 1986 with \"Execution of Justice\". One of his major triumphs in the theatre has been alongside Kevin Spacey in the acclaimed 1999 revival of O'Neill's \"The Iceman Cometh\", in which he played the drunken, corrupt ex-cop Pat McGloin. Brief appearances in Rooster Cogburn, The Duchess and Dirtwater Fox, Joy Ride, and Twice in a Lifetime, as well as in such TV fare as Escape From Hell (1977), Joe Kennedy: The Forgotten Kennedy (1977), and the NBC series \"Hot Pursuit\" (1984) have disguised an expanding repertory theatre portfolio. Richard has also contributed to such diverse undertakings as Bay Area Radio's Eugene O'Neill Project (playing Smithers to Joe Morton's Brutis Jones in \"The Emperor Jones\") and the Adams-Jefferson Project of Carleton College, participating in a series of recordings of the correspondence between the two US Presidents. To this day, Richard has maintained his involvement in theatre workshops and encouraging the dramatic arts under the auspices of the Mark Taper Forum and A.S.K. However, since his scene-stealing cameo as the Quartermaster in 1989's Glory, with his trademark bushy mustache and heavyset frame, Richard has acquitted himself as one of the best, and busiest, character players on TV and in the movies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNDgyMDcwOV5BMl5BanBnXkFtZTgwODkwNjY0MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0726223","name":"Richard Riehle","idIMDB":"nm0726223"},"actorId":"nm0726223","character":"Gus","urlCharacter":"http://www.imdb.com/character/ch0227816","main":true},{"actorName":"Maureen Preuss","urlProfile":"http://www.imdb.com/name/nm0696609","urlPhoto":"","biography":{"dateOfBirth":"March1958","placeOfBirth":" Detroit, Michigan, USA","birthName":"Maureen Remisiewicz","height":"5' 3\" (1.6 m)","bio":"Maureen Preuss was born to Eugene and Delphine Remisiewicz in Detroit, Michigan, one of five daughters and one son. She obtained a Bachelor of Fine Arts degree in Theatre from Wayne State University in Detroit in 1980. Her numerous stage credits include work in professional companies, dinner theaters, and tours. In the early 1990's she was recommended to a commercial talent agent in Orlando, Florida. She booked her first national commercial three weeks after submitting her headshot, and has been steadily working in film, video, and commercial productions throughout the Southeast ever since. In addition to her filmography credits, she has also appeared in the festival award winning short films 'Blank Canvas' (Student Works Award, Florida Film Festival, 1997) and 'Used Cars' (which, among its many honors, lists Regional Winner - Student Academy Awards, Academy of Motion Picture Arts and Sciences, 1997). Principal commercial credits include national spots for 'Fox Baseball' and 'Closet Maid,' international commercials for 'Dockers' pants and 'Nissan,' plus numerous regional and local ads. Maureen has been married to actor David Preuss since 1981.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0696609","name":"Maureen Preuss","idIMDB":"nm0696609"},"actorId":"nm0696609","character":"Betty","urlCharacter":"http://www.imdb.com/character/ch0227817","main":true},{"actorName":"Christopher Schmidt","urlProfile":"http://www.imdb.com/name/nm2946699","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwNDY2ODIxM15BMl5BanBnXkFtZTcwOTIxMzYyOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1968","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Christopher John Schmidt","bio":"Christopher Schmidt was born on April 12, 1968 in St. Louis, Missouri, USA as Christopher John Schmidt. He is an actor, known for Letters to God (2010), Recount (2008) and Bait Shop (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwNDY2ODIxM15BMl5BanBnXkFtZTcwOTIxMzYyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2946699","name":"Christopher Schmidt","nicknames":["Schmidty"],"idIMDB":"nm2946699"},"actorId":"nm2946699","character":"Odd Job","urlCharacter":"http://www.imdb.com/character/ch0227818","main":true},{"actorName":"Rus Blackwell","urlProfile":"http://www.imdb.com/name/nm0085952","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NDY2NjgwNV5BMl5BanBnXkFtZTcwMzExODM3Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 March 1963","placeOfBirth":" Rockford, Illinois, USA","height":"6' 1\" (1.85 m)","bio":"Rus Blackwell started his acting career in New York, training at Circle in the Square Theatre School and working on stage. Blackwell has built a solid resume over the years and has had the good fortune to work with a number of the industry's top professionals. A tireless work ethic and endless passion make Rus a compelling actor with a terrific range. His work includes roles in the Oscar and Emmy award-winning projects Monster, The Curious Case of Benjamin Button, HBO's Recount and From the Earth to the Moon. Most notably Rus played District Attorney Gordon Hopewell on the Cinemax series Banshee.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NDY2NjgwNV5BMl5BanBnXkFtZTcwMzExODM3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0085952","name":"Rus Blackwell","idIMDB":"nm0085952"},"actorId":"nm0085952","character":"Dale","urlCharacter":"http://www.imdb.com/character/ch0227833","main":true},{"actorName":"David Mackey","urlProfile":"http://www.imdb.com/name/nm2576320","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzOTI2NjEyNV5BMl5BanBnXkFtZTcwODM0NzE3Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"David Mackey is an actor, known for Tooth Fairy 2 (2012), Legend of the Red Reaper (2013) and The Sacred (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzOTI2NjEyNV5BMl5BanBnXkFtZTcwODM0NzE3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2576320","name":"David Mackey","idIMDB":"nm2576320"},"actorId":"nm2576320","character":"Roy","urlCharacter":"http://www.imdb.com/character/ch0227835","main":true},{"actorName":"Billy Ray Cyrus","urlProfile":"http://www.imdb.com/name/nm0004854","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MTA2NTE4NF5BMl5BanBnXkFtZTcwMzQ2MzMzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1961","placeOfBirth":" Flatwoods, Kentucky, USA","birthName":"William Ray Cyrus","height":"6' (1.83 m)","bio":"Billy Ray Cyrus was born on August 25, 1961 in Flatwoods, Kentucky, USA as William Ray Cyrus. He is an actor, known for Doc (2001), Hannah Montana (2006) and Hannah Montana: The Movie (2009). He has been married to Tish Cyrus since December 28, 1993. They have three children. He was previously married to Cindy Cyrus.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MTA2NTE4NF5BMl5BanBnXkFtZTcwMzQ2MzMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004854","name":"Billy Ray Cyrus","idIMDB":"nm0004854"},"actorId":"nm0004854","character":"Hot Rod Johnson","urlCharacter":"http://www.imdb.com/character/ch0227814","main":true},{"actorName":"Vincent Martella","urlProfile":"http://www.imdb.com/name/nm1605108","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTkwODY4OF5BMl5BanBnXkFtZTcwNDAxMjA5OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1992","placeOfBirth":" Rochester, New York, USA","birthName":"Vincent Michael Martella","height":"5' 5\" (1.65 m)","bio":"Vincent Michael Martella was born in Rochester, New York, to Donna and Michael Martella, who owns a pizza chain. He was raised in Florida, and is of Italian descent. Martella, responsible for breathing life into the animated character Phineas in the hit Disney Channel television show Phineas and Ferb, is no stranger to the entertainment industry. Jumpstarting his passion for performing and entertaining others through dance at age three, Vincent delivered his first live performance in The Nutcracker. Soon after, Martella was performing in school plays, appearing in local and National commercial spots, and training in acting, piano, and vocals. By age seven, Martella was already a big commodity in the Central Florida commercial market, working both print and national commercials. During Martella's first trip to Los Angeles, he landed a guest spot on Fox's Cracking Up and Stacked, as well as a recurring role on Nickelodeon's Ned's Declassified, where he developed his own character for the role of \"Scoop.\" The following summer, Vincent was cast in his first film role, acting opposite Rob Schneider in Deuce Bigelow: European Gigolo. In 2005, Martella landed one of his most notable roles as \"Greg Wuliger\" in the People's Choice and Golden Globe nominated comedy sitcom, Everybody Hates Chris, based loosely on comedian Chris Rock's childhood. During his four-year time with the show, Martella also had a role in the hit Universal Pictures film, Role Models, opposite Seann William Scott and Paul Rudd. Despite being a lead on Everybody Hates Chris, Martella was able to land another huge opportunity, being cast as \"Phineas\" in the hit animated Disney series, Phineas and Ferb. During his seven years voicing the main character, Martella also lent his vocals to all related Phineas and Ferb projects, Final Fantasy XIII, Batman video games and appeared in the television shows, R.L. Stine's The Haunting Hour and The Mentalist. Martella can most recently be found in the recurring role of \"Patrick\" in AMC's critically acclaimed series, The Walking Dead. He also can be found in the films McFarland, opposite Kevin Costner and Maria Bello and Clinger, in post-production. With impressive roles and extremely popular credits on his resume, it is clear that Martella's past, present, and future in the entertainment business is bright. Martella splits his time between residing in both Los Angeles and Florida.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTkwODY4OF5BMl5BanBnXkFtZTcwNDAxMjA5OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1605108","name":"Vincent Martella","nicknames":["Vin Man"],"idIMDB":"nm1605108"},"actorId":"nm1605108","character":"Scott","urlCharacter":"http://www.imdb.com/character/ch0227812","main":true},{"actorName":"Harve Presnell","urlProfile":"http://www.imdb.com/name/nm0696193","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjc3MTYyOV5BMl5BanBnXkFtZTYwMzc2NDg3._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1933","placeOfBirth":" Modesto, California, USA","birthName":"George Harvey Presnell","height":"6' 5\" (1.96 m)","bio":"By the time handsome, brawny baritone Harve Presnell arrived on the film scene, the \"Golden Age\" of musicals had long dissipated. Born in Modesto, California in 1933 and spending part of his youth on a family ranch near Yosemite Valley where he labored in the fields, it was discovered he had quite a voice at such a young age (7) and he became a soloist at his local church. He graduated from Modesto High School and received a USC sports scholarship, but moved quickly to singing at Lotte Lehmann's Academy of the West. At the age of 21, he coveted the lead in the American premiere of Darius Milhaud's \"David\". Initially trained for an operatic career, he spent three seasons singing throughout Europe with roles in \"La Forza del Destino\", \"Un ballo in Maschera\", \"The Marriage of Figaro\" and \"Tosca\". He also shared the musical stage with Dorothy Kirsten and Leontyne Price. Harve was performing nationally, including New York's Carnegie Hall in \"Carmina Burana\", when the opportunity for Broadway first came his way. Legendary composer Meredith Willson happened to catch an earful of the gifted singer in a \"Gershwin Night\" concert at the Hollywood Bowl in Los Angeles and, in the virile mold of Alfred Drake and Howard Keel, wrote the role of Johnny \"Leadville\" Brown in \"The Unsinkable Molly Brown\" specifically for him. The Broadway musical, with Tammy Grimes as the spunky title heroine, was a resounding hit as Harve wrapped his glorious tonsils around such sturdy, wide-stanced songs as \"Colorado, My Home\" and \"I'll Never Say No\". Unlike Grimes, Presnell was granted the opportunity to recreate his rags-to-riches part, when the celluloid version of The Unsinkable Molly Brown (1964) came out with a bankable film star, the indomitable Debbie Reynolds, inhabiting the backwoods role. The film version was also hugely popular with audiences and Harve, with his terrific presence, seemed well on his way to stardom. There were precious few movie musicals, however, for Presnell to sink his teeth into and he quickly faded from view. He tried adjusting to straight dramatics with the rugged western The Glory Guys (1965) and sang again in the highly unworthy teen frolic When the Boys Meet the Girls (1965) with Connie Francis, but little else came in his direction. The disastrous film version of Paint Your Wagon (1969), hurt by the miscasting of leads Lee Marvin, Clint Eastwood and Jean Seberg, was redeemed only by the presence of Presnell and his superb, moving rendition of \"They Call the Wind Mariah\". By the 70s, Harve was finished in films but gamely kept his momentum with Keel-like stock and touring leads in such productions as \"Camelot\", \"The Sound of Music\", \"Annie Get Your Gun\" and \"On a Clear Day You Can See Forever\", among others. He even played Rhett Butler in a 1972 musical version of \"Gone With the Wind\" at London's Drury Lane Theatre, but the production did not generate much of a stir. In 1979, Presnell served as a replacement in the Broadway musical \"Annie\" as Daddy Warbucks and wound up staying employed as the blustery but big-hearted moneybags for nearly 4 years on tour, also reprising the role in the failed 90s sequel, \"Annie II: Miss Hannigan's Revenge\" (1989), which was later reworked and retitled \"Annie Warbucks\" (1992). All tolled, it is estimated that Harve played the tycoon role over 2,000 times. More than 25 years had passed by the time Presnell returned to the movies as a brash and balding character actor. He struck pure gold as the implacable, ill-fated father-in-law of William H. Macy in the Coen Brothers' cult film hit, Fargo (1996). This success, in turn, led to meaty roles in Larger Than Life (1996), The Whole Wide World (1996), The Chamber (1996), Face/Off (1997), Saving Private Ryan (1998) and The Legend of Bagger Vance (2000), to name a few. Over the course of his career, he displayed a strong presence on TV as well with recurring roles on prime-time (Lois & Clark: The New Adventures of Superman (1993)) and daytime (Ryan's Hope (1975). Presnell may have been born 10-20 years too late to have become a singing film star, but he suddenly had come back in spades to launch a whole new career as a noted character performer. At age 70+, he was unsinkable, vigorously steamrolling on TV (The Pretender (1996), Monk (2002) and ER (1994)) and in the films Mr. Deeds (2002), Old School (2003), Flags of Our Fathers (2006) and Evan Almighty (2007). His last series role was in the short-lived Andy Barker, P.I. (2007). Pancreatic cancer got the best of the actor in his final years. The twice-married Presnell with six children (Stephanie, Taylor, Etoile, Tulley, Shannon and Raine) succumbed to his illness at the St. John's Health Center in Santa Monica, California on June 30, 2009, at age 76.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjc3MTYyOV5BMl5BanBnXkFtZTYwMzc2NDg3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0696193","name":"Harve Presnell","idIMDB":"nm0696193"},"actorId":"nm0696193","character":"Jack","urlCharacter":"http://www.imdb.com/character/ch0227842","main":true},{"actorName":"Billy Joe Shaver","urlProfile":"http://www.imdb.com/name/nm0789522","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NDM5NzYxMl5BMl5BanBnXkFtZTcwMjA2MjIzMQ@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1939","placeOfBirth":" Corsicana, Texas, USA","bio":"Billy Joe Shaver was born on August 16, 1939 in Corsicana, Texas, USA. He has been married to Wanda Lynn Canady since September 26, 2005. He was previously married to Jean and Brenda Tindell.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NDM5NzYxMl5BMl5BanBnXkFtZTcwMjA2MjIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0789522","name":"Billy Joe Shaver","idIMDB":"nm0789522"},"actorId":"nm0789522","character":"Buddy","urlCharacter":"http://www.imdb.com/character/ch0227843","main":true},{"actorName":"Tim Powell","urlProfile":"http://www.imdb.com/name/nm0694336","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1Nzk4NzkzNF5BMl5BanBnXkFtZTgwMzI3MjMwNzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1956","placeOfBirth":" Jonesboro, Arkansas, USA","birthName":"Timothy Alan Powell","height":"5' 9\" (1.75 m)","bio":"Timothy Alan Powell was born on June 16th, 1956 in Jonesboro, Arkansas to Carl and Bettie Powell. Tim has three brothers two older and one younger. At the age of three the family moved to Sheffield, Alabama where his father opened his own wholesale electronic parts company. Tim went to Blake Elementary in Sheffield, Alabama. When he was eight years old his grandmother dragged him to nearby Tuscumbia, Alabama, the birthplace of Helen Keller. where he auditioned for the part of a little black boy in the annual Miracle Worker Production. It was 1964 - the first year the show was integrated, and Tim didn't get the part. In the sixth grade Tim began attending Mars Hill Bible School, a private Christian School run by a very strict fundamentalist sect called the Church of Christ. At Mars Hill Tim received several years of a capella voice training. His parents planned for him to be a preacher and, at the age of eight, he preached his first sermon. Tim had other aspirations. When he was eight he had seen a live production of the Music Man and he wanted to some day play the stuttering kid. From 14 to 17 Tim played bass guitar in a rock and roll band with some other guys from Mars Hill. As a result of a blowout with his father Tim left Mars Hill after his Junior year and went to a public school and graduated in 1974. After graduating from High School his father gave him two alternatives to attend one of two Christian colleges if he would take them and Tim was to major in Bible and minor business and come back to work for him or become a minister. Instead, after a three month hitchhiking adventure Tim returned to Florence, Alabama, and paid for his own education at the University of North Alabama and started a major in psychology. In his second year a friend of his suggested an easy arts credit in theater lab, you work 50 hours and get a B. Work a 100 hours building sets and get an A. One night he was working on a set piece when the director came over to me and asked if he could sing or act, as he needed a freaky looking guy to play the illiterate Bible salesman in Inherit the Wind. He took the part and for the next few years, went out on every audition he could and got parts in almost all of them. He took theatre classes for fun, never dreaming he'd use them. In his junior year he was told he only needed three more hours for a theater major so he ended up going a fifth year and double majoring in English and drama. Tim took the first graduate assistantship that was offered to him at the University of Mississippi as an MFA Directing Candidate in Theater. Now he was moving into academic theater, teaching 12 - 14 hours, taking 12 hours, he had to perform in every main stage production that came up and had to produce and direct one of his own in each semester. This was wearing him down and at the end of the third semester a friend of his from UNA came through town and asked Tim how he would like to be a lighting designer doing rock and roll concerts. Tim jumped at the chance and dropped everything and left and worked one niters all through the southeast. He found out that the lighting was the first thing in and the last thing out and he spent a lot of time by himself sitting in motel rooms. He knew he was on the wrong side of the stage. Tim soon tired of this lighting life and went back to the University for another year and six hours short of his MFA, again, dropped everything to go to New York to work for Playboy's marketing division. He produced and directed promotions for spring break in beach resorts for six months out of the year for Playboy and other marketing companies for the next six years. He then played the part of Private White in a low-budget Science Fiction movie called: What Waits Below. With the earnings from this film he joined SAG and moved to Nashville, Tennessee and shared a house with four other guys he had known from Florence AL. Tim booked several jobs in commercials, joined AFTRA, got his equity card and became a regular performer at Tennessee Repertory Company. For his day jobs Tim conducted tours at the Guinness Hall of World Records on Music Row, booked performers for a singing telegram service, and continued to do Spring Break Promotions for various Advertising and Marketing companies. It was in Nashville that he met his future wife, Elizabeth. Tim often went to Atlanta for auditions and was cast in a Disney Feature called Goodbye, Miss 4th of July (1988). While living in Nashville a friend, who had moved to Orlando in the early eighties, began sending Tim newspaper clippings describing the building film industry and describing Orlando as \"the new LA.\" In 1987 the Powell's sold their home and moved to Orlando. Tim signed with a few agents and at first got very few calls. Things started to happen for Tim in Orlando with Superboy, and Superforce and regular commercial gigs, and he frequently returned to Atlanta where he did Silent Victim (1993) and Class of '61 (1993). While Tim was working at the Caldwell Theater in Boca Raton in the play The Importance of Being Ernest, Lori Wyman who at the time was casting Miami Vice, came back stage and asked him for a resume. She invited Tim to read for the show and he booked a part on Miami Vice. Other television credits are In the Heat of the Night, Wiseguy, Problem Child 2 (1991), Sea Quest, The Cape, ER, Safe Harbour, Unsolved Mysteries and once as a guest star and as SAG Voice talent looping 28 episodes of Sheena. His theater credits include roles in Macbeth, A Midsummer Night's Dream, Fallen Angels and Pygmalion. Some of his film credits are China Moon (1994), Drop Zone (1994), Holy Man (1998), Walking Across Egypt (1999), Sunshine State (2002), The President's Man (2000) and most recently Bad Boys II (2003). Today, Tim has his own production company called Bark at the Dog Productions, Inc. He continues to do regular Voice-Over work, produces, develops and performs as a narrator-spokesperson in non-broadcast industrials and interactive CD ROMs, and is a continues to work as a Macintosh computer consultant to a few select clients. He also teaches occasional voice-over workshops. (2014) Tim lives in Los Angeles, CA where he serves on the SAG Conservatory Steering Committee, teaches their Acting and VO workshops at the American Film Institute, and is an active member of the TV Academy. He has built a professional acting resume in Theatre, Film, TV, and VO, that spans 3 decades. From Shakespeare, Moliere, and Oscar Wilde at TN Repertory in Nashville and the Caldwell Theatre in Boca Raton, FL, to on-camera work throughout much of the east coast; landing speaking roles in 30+ Films (Pregnancy Pact, Recount, Bad Boys II, Sunshine State, Holy Man) and Dozens of Television shows (Rake, Criminal Minds, The Glades, One Tree Hill, Army Wives, Burn Notice, ER). In 2014, he appeared in a (Sold-out) one-man show, entitled Man's Dominion, in the LA Fringe Festival where the show was held over for the Encore presentations.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1Nzk4NzkzNF5BMl5BanBnXkFtZTgwMzI3MjMwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0694336","name":"Tim Powell","idIMDB":"nm0694336"},"actorId":"nm0694336","character":"Donnie Rains","urlCharacter":"http://www.imdb.com/character/ch0227844","main":true},{"actorName":"David Neil Enfinger","urlProfile":"http://www.imdb.com/name/nm1849988","urlPhoto":"","biography":{"bio":"David Neil Enfinger is known for his work on Deja Vu (2006), The Punisher (2004) and The Waterboy (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1849988","name":"David Neil Enfinger","idIMDB":"nm1849988"},"actorId":"nm1849988","character":"Cuckholded man","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1176725","urlIMDB":"http://www.imdb.com/title/tt1176725","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 25 min (85 min) (USA)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.3","filmingLocations":[{"location":"Orlando, Florida, USA"}],"rated":"PG","awards":[],"votes":"561","type":"Video","companyCreditsSimple":[{"idCompany":"co0191823","name":"Parallel Entertainment Pictures"},{"idCompany":"co0053726","name":"Parallel Pictures"},{"idCompany":"co0196374","name":"Shaler Entertainment Pictures"}],"keywords":{"keywords":["crude humor","beer","slapstick"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:23:49"}}