{"data":{"movies":[{"title":"A Nightmare on Elm Street","originalTitle":"","year":"2010","releaseDate":"20100430","directors":[{"name":"Samuel Bayer","id":"nm1207904"}],"writers":[{"name":"Wesley Strick","id":"nm0834338"},{"name":"Eric Heisserer","id":"nm2104063"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIxMTQ0NTIxM15BMl5BanBnXkFtZTcwMzY1NDAyMw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Mystery","Thriller"],"plot":"Death stalks the dreams of several young adults to claim its revenge on the killing of Freddy Kruger. Chased and chastised by this finger-bladed demon, it is the awakening of old memories and the denials of a past of retribution that spurns this hellish vision of a dreamlike state and turns death into a nightmare reality.","simplePlot":"The spectre of a dead child rapist haunts the children of the parents who murdered him, stalking and killing them in their dreams.","actors":[{"actorName":"Jackie Earle Haley","urlProfile":"http://www.imdb.com/name/nm0355097","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MTgxOTM4NF5BMl5BanBnXkFtZTcwMDE0Mzg4OQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 July 1961","placeOfBirth":" Northridge, California, USA","birthName":"Jack Earle Haley","height":"5' 5½\" (1.66 m)","bio":"Jackie Earle Haley was born on July 14, 1961 in Northridge, California, USA as Jack Earle Haley. He is an actor and director, known for Watchmen (2009), A Nightmare on Elm Street (2010) and Little Children (2006). He has been married to Amelia Cruz since August 6, 2004. He was previously married to Jennifer Hargrave and Sherry Vaughan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MTgxOTM4NF5BMl5BanBnXkFtZTcwMDE0Mzg4OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0355097","name":"Jackie Earle Haley","idIMDB":"nm0355097"},"actorId":"nm0355097","character":"Freddy Krueger","urlCharacter":"http://www.imdb.com/character/ch0002143","main":true},{"actorName":"Kyle Gallner","urlProfile":"http://www.imdb.com/name/nm0973177","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMTg0NzU2N15BMl5BanBnXkFtZTgwMzgxOTEzNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1986","placeOfBirth":" West Chester, Pennsylvania, USA","height":"5' 8½\" (1.74 m)","bio":"Kyle Gallner was born in West Chester, Pennsylvania. He started his career by following his sister along to one of her auditions. Perhaps best know for his role as Cassidy \"Beaver\" Casablancas on the CW's lone hit series, \"Veronica Mars\" (2004- ), actor Kyle Gallner had been appearing in films and on television since his early adolescence. Born on Oct. 22, 1986 and originally from Philadelphia, PA, Gallner made his first screen appearance on an episode of \"Third Watch\" (NBC, 1999-2005). After making his feature debut with a small role in the bizarre Michael Showalter comedy, \"Wet Hot American Summer\" (2001), he returned to television with episodes of \"Law & Order: Special Victims Unit\" (NBC, 1999- ) and \"Touched By an Angel\" (CBS, 1994-2003). He next appeared in the series finale of \"The District\" (CBS, 2000-04) before playing his first recognizable role - that of Bart Allen (a.k.a. \"The Flash\") on \"Smallville\" (CW, 2001- ) during the 2004-05 season. In 2005, Gallner joined the cast of \"Veronica Mars\" for the last three episodes of the first season, giving him the opportunity to carry over his role of Beaver into the next season. During his run on \"Veronica Mars,\" Gallner continued making guest spots, appearing in episodes of \"Jack & Bobby\" (WB, 2004-05), \"Cold Case\" (CBS, 2003- ), \"CSI: New York\" (CBS, 2004- ) and \"Bones\" (FOX, 2005- ). Gallner began a recurring role as a devout Mormon in the controversial HBO series, \"Big Love\" (2006- ). Meanwhile, Gallner revived his \"Smallville\" role in early 2007, returning as Impulse rather than The Flash - due to a feature film with the same character being developed by Warner Bros. Made acting debut in an episode of NBCs Third Watch. Made his film debut in the comedy cult film Wet Hot American Summer. Had a recurring role as superhero Bart Allen in Smallville (The WB, 2001-2006; The CW, 2006-2009). Appeared in two episodes of The WB s Jack & Bobby. Joined the cast of UPN s Veronica Mars as Cassidy Casablancas; became a regular during the show s second season. Had a recurring role as Reed Garrett, the son of Detective Taylor's (Gary Sinise) late wife on CSI: NY (CBS) Played Jason Embry, best friend of Ben Henrickson, on the critically-acclaimed HBO drama Big Love. Featured in the independent film Sublime. Appeared in three episodes of The Shield (FX). Had a supporting role in the Diablo Cody penned dark comedy Jennifer's Body. Played the lead role in the horror film The Haunting in Connecticut. Cast as the lead male, Quentin, in the remake of A Nightmare on Elm Street. Gallner has in his filmography acclaimed Independents films as Gardens of the Night (2008), Beautiful Boy (2010), Red State (2011), Little Birds (2011), Magic Valley (2011) and Smashed (2011). In 2013, Gallner appeared in the film Beautiful Creatures (2013)_, directed by Richard LaGravenese.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMTg0NzU2N15BMl5BanBnXkFtZTgwMzgxOTEzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0973177","name":"Kyle Gallner","idIMDB":"nm0973177"},"actorId":"nm0973177","character":"Quentin Smith","urlCharacter":"http://www.imdb.com/character/ch0140715","main":true},{"actorName":"Rooney Mara","urlProfile":"http://www.imdb.com/name/nm1913734","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NDE3MDk1OF5BMl5BanBnXkFtZTcwNjI1MDY0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1985","placeOfBirth":" Bedford, New York, USA","birthName":"Patricia Rooney Mara","height":"5' 3\" (1.6 m)","bio":"Actress and philanthropist Rooney Mara was born on April 17, 1985 in Bedford, New York. She made her screen debut in the slasher film Urban Legends: Bloody Mary (2005), went on to have a supporting role in the independent coming-of-age drama Tanner Hall (2009), and has since starred in the horror remake A Nightmare on Elm Street (2010), the biographical drama The Social Network (2010), the thriller remake The Girl with the Dragon Tattoo (2011), and the romantic drama Carol (2015). Patricia Rooney Mara is one of four children of Kathleen McNulty (née Rooney) and NFL football team New York Giants executive Timothy Christopher Mara. Her grandfathers were Wellington Mara, co-owner of the Giants, and Timothy Rooney, owner of Yonkers Raceway, and her grand-uncle is Steelers Chairman Dan Rooney, the former Ambassador to Ireland. She is the great-granddaughter of Art Rooney, the founder of the Pittsburgh Steelers football franchise. Her father has Irish, German, and French-Canadian ancestry, and her mother is of Irish and Italian descent. After graduating from Bedford's Fox Lane High School in 2003, she went to Ecuador, Peru and Bolivia in South America for four months as part of the Traveling School, an open learning environment. She attended George Washington University for a year and then transferred to New York University, where she studied international social policy psychology and nonprofits. She took her degree from New York University in 2010. Her studies focused on non-profit organizations, as her family has a tradition of involvement in philanthropic causes. She had thought of acting after watching old movies and attending musical theater, but did not think of it as a serious vocation and was afraid she might fail at this. As a result of her reservations, she appeared in only one play while in high school. She began seriously focusing on acting when she was at New York University, appearing in student films. Inspired by her older sister, actress Kate Mara, she began to pursue the craft, auditioning for acting jobs at age 19. She appeared with her sister Kate in the video horror movie Urban Legends: Bloody Mary (2005), billing herself as \"Patricia Mara\". As \"Tricia Mara\", she had guest roles on television and won her first lead in the movie Tanner Hall (2009), which was shot in the fall of 2007. She originally auditioned for the supporting role of Lucasta in \"Tanner Hall\", a $3-million independent film, but director Tatiana von Furstenberg was so impressed by the young actress, she had her return to audition for the lead role of Fernanda, which Mara won. Furstenberg was delighted with her nuanced performance, saying, \"Still waters run deep\". Continuing to call herself Tricia Mara, this was during the making of \"Tanner Hall\" that she considered changing her professional name to Rooney Mara, soliciting the advice of the cast and crew. After premiering at the 2009 Toronto International Film Festival, her performance in \"Tanner Hall\" brought the rechristened Rooney Mara a \"Rising Star\" award at the 2009 Hamptons Film Festival and a \"Stargazer Award\" at the 2010 Gen Art Film Festival. She received her first lead role in a major feature, in the $35 million remake A Nightmare on Elm Street (2010). The movie proved disappointing at the box office, grossing only $63 million domestically and racking up a worldwide gross of just under $116 million. However, she was noticed by critics in the small but pivotal role of the Boston University undergrad Erica Albright who dumps Facebook founder Mark Zuckerberg in The Social Network (2010). Director David Fincher subsequently cast her as the lead, Lisbeth Salander, in his thriller remake, The Girl with the Dragon Tattoo (2011), based on Stieg Larsson's Millennium book series. She received critical acclaim for her performance, and was nominated for an Academy Award for Best Actress and a Golden Globe Award for Best Actress in a Motion Picture - Drama. She starred in the thriller film Side Effects (2013), the independent drama Ain't Them Bodies Saints (2013), and the acclaimed sci-fi romantic drama Her (2013). The following year, she starred in the adventure drama Trash (2014). She garnered further critical acclaim for her performance in Todd Haynes' romantic drama Carol (2015), for which she won the Best Actress Award at the 2015 Cannes Film Festival, and was nominated for the Golden Globe Award for Best Actress in a Motion Picture - Drama and the SAG, BAFTA, and Academy Award for Best Supporting Actress. In the spirit of her family's philanthropic endeavors, Rooney created Faces of Kibera, a charity that provides food, medical care and housing to orphans in Nairobi, Kenya's Kibra district, a small slum that houses a million people. There are many orphans as AIDS is rampant in the slum.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NDE3MDk1OF5BMl5BanBnXkFtZTcwNjI1MDY0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1913734","name":"Rooney Mara","idIMDB":"nm1913734"},"actorId":"nm1913734","character":"Nancy Holbrook","urlCharacter":"http://www.imdb.com/character/ch0002153","main":true},{"actorName":"Katie Cassidy","urlProfile":"http://www.imdb.com/name/nm1556320","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyMzA1MTY2MV5BMl5BanBnXkFtZTgwMzIyNzQ3MDE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 November 1986","placeOfBirth":" Los Angeles, California, USA","birthName":"Katherine Evelyn Anita Cassidy","height":"5' 7½\" (1.71 m)","bio":"Katie Cassidy was born Katherine Evelyn Anita Cassidy on November 25, 1986, in Los Angeles, California. Her father, David Cassidy, was a pop star in the 1970s. Her mother, Sherry Williams, was a high fashion model in the early 1970s. Sherry left her career to concentrate on raising her 3 daughters, with husband, Richard Benedon M.D., Katie's stepdad. Her famous relatives include uncles Shaun Cassidy, Patrick Cassidy and Ryan Cassidy, and grandparents Jack Cassidy, Evelyn Ward and Shirley Jones. As a child, Katie took gymnastics, studied piano, guitar and singing, then took dancing and acting lessons and eventually became a cheerleader for the California Flyers. She attended Calabasas High School in her neighborhood, where she also cheered as a freshman. Her mother insisted that she complete college prep classes in high school before she embarked on her acting career. For years prior to graduation in 2005, Katie was modeling and studying acting in community theater. Katie had just been accepted to 'Tisch' at NYU when she was offered her first role as \"Dee Dee\", which was one month before graduating. Katie has not stopped working since. Katie's early exposure to show business, the cosmopolitan culture of Los Angeles, her family upbringing, and her comprehensive education altogether produced a remarkable result. She grew up as a multifaceted person showing her many talents in a variety of professions such as recording her father's 1970s hit \"I Think I Love You\" and singing in VH1's TV special Bubblegum Babylon (2002), writing her own songs, modeling for Abercrombie and Fitch and Guess?'s Rock and Republic clothing lines in 2004, and acting. However, she was publicly criticized by her father who would have liked for her to wait before she covered his classic hit. During her stint with Artemis Records, she was introduced to the popular boy band Dream Street. There she met Greg Raposo, who wrote the song \"We're In Love\" for her when they dated in 2002. She also met her ex-boyfriend, Jesse McCartney, there and later appeared as his love interest in his video hit \"She's No You\". A story on Jesse and Katie appeared in the January 2006 issue of Teen People magazine. At that time she was busy working on five feature film productions going on almost simultaneously. Katie made several appearances in TV series, such as 7th Heaven (1996) and Sex, Love & Secrets (2005), among others. She appeared as Samantha, the grown-up daughter of Adam Sandler and Kate Beckinsale in the comedy Click (2006). After the release of a teen horror film, When a Stranger Calls (2006),in which she co-starred as Tiffany, Cassidy went to Vancouver to work on her second horror film, Black Christmas (2006), in which she stars as a sorority girl. Katie recently beat out the likes of Jessica Simpson and Kristin Cavallari for the leading role opposite John Travolta as his daughter and the heir to the most powerful energy company in the world in Dallas, the big-screen remake of the cult TV series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyMzA1MTY2MV5BMl5BanBnXkFtZTgwMzIyNzQ3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1556320","name":"Katie Cassidy","nicknames":["Bug","K"],"idIMDB":"nm1556320"},"actorId":"nm1556320","character":"Kris Fowles","urlCharacter":"http://www.imdb.com/character/ch0220084","main":true},{"actorName":"Thomas Dekker","urlProfile":"http://www.imdb.com/name/nm0215281","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDY0MjUzOV5BMl5BanBnXkFtZTcwMDU0MTc2Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1987","placeOfBirth":" Las Vegas, Nevada, USA","birthName":"Thomas Alexander Dekker","height":"5' 9\" (1.75 m)","bio":"Thomas Dekker was born to parents who possess very artistic and theatrical characteristics. His mother is an acting coach, actress, singer and concert pianist, while his father was an artist, set designer, opera singer and actor. His maternal grandfather was famed Welsh radio actor Alun Williams. Dekker began acting at age six, when he received a minor role on The Young and the Restless (1973). A year later he was given the opportunity to act with Patrick Stewart, Malcolm McDowell and William Shatner in Star Trek: Generations (1994), playing Thomas Picard. He went on to score guest spots on The Nanny (1993), Seinfeld (1989), Star Trek: Voyager (1995) and Caroline in the City (1995) before finally landing a regular spot on Disney Channel's Honey, I Shrunk the Kids: The TV Show (1997). For three years he took on the role of Nick Szalinkski, creating a name for himself and finding a nice niche in the Disney universe. When he wasn't on set filming, he was lending his voice to sequels for The Land Before Time and An American Tale. Honey I Srunk The Kids ended its run in 2000, but Dekker continued to make appearances in television, including a recurring role on the family drama 7th Heaven (1996). A big break presented itself when he was cast as Zach in the first season of Heroes (2006). Though after appearing in only eleven episodes, he was offered the role of John Connor in Fox's Terminator: The Sarah Connor Chronicles (2008) in 2008. While the premise of the show was widely popular (having been adapted from James Cameron's Terminator franchise), it struggled to maintain a steady audience and was canceled after only two seasons. 2008 was still a busy year for Dekker. He took on the role of Aidan, a troubled teen in the horror flick From Within (2008). Meanwhile, he also took part in the web-based series IQ-145 (2008). Though his biggest project came when he decided to try his hand in film production. He wrote, directed and starred in Whore (2008), a film about a group of teenagers who travel to Hollywood to pursue their dreams but discover a much darker side to fame. A year later, he received the part of Taylor Ambrose, a Leukemia patient in the drama My Sister's Keeper (2009) alongside Cameron Diaz and Abigail Breslin. The role was rather timid and intelligent because it let Dekker immerse himself in a character he has never played before. In early 2010, he took a stab as Jesse Braun in the re-imagining of A Nightmare on Elm Street (2010). Dekker's most recent role is Lance Loud in Cinema Verite (2011) with Diane Lane, Tim Robbins and James Gandolfini.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDY0MjUzOV5BMl5BanBnXkFtZTcwMDU0MTc2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0215281","name":"Thomas Dekker","nicknames":["Tom"],"idIMDB":"nm0215281"},"actorId":"nm0215281","character":"Jesse Braun","urlCharacter":"http://www.imdb.com/character/ch0002159","main":true},{"actorName":"Kellan Lutz","urlProfile":"http://www.imdb.com/name/nm1553725","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjM2NTM5ZTQtNDQ1OC00MTNmLTkzZDUtNDVkOGEwNzRjMWMwXkEyXkFqcGdeQXVyMjQ5MTc1NzY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 March 1985","placeOfBirth":" Dickinson, North Dakota, USA","birthName":"Kellan Christopher Lutz","height":"6' 1\" (1.85 m)","bio":"Actor and model Kellan Lutz was born in Dickinson, North Dakota, to Karla (Theesfeld) and Bradley Lutz. He has six brothers and a sister, and is of German, as well as smaller amounts of English, Swedish, and Dutch, descent. As a child, his family moved around, and he grew up in North Dakota, the Midwest and Arizona. Upon high school graduation, Lutz relocated to California to attend Chapman University and study Chemical Engineering, but left in order to pursue a career in acting. Lutz had picked up a few modeling jobs as a teenager, but got his first TV break with a small role in Amour, gloire et beauté (1987) in 2004. More television success followed, including parts in The Comeback (2005) and Generation Kill (2008). He was also cast in some film roles, including Accepted (2006) and Prom Night (2008), but his major break came in 2008 when he won the role of vampire Emmett Cullen in the smash hit Twilight (2008), and its subsequent sequels.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjM2NTM5ZTQtNDQ1OC00MTNmLTkzZDUtNDVkOGEwNzRjMWMwXkEyXkFqcGdeQXVyMjQ5MTc1NzY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1553725","name":"Kellan Lutz","idIMDB":"nm1553725"},"actorId":"nm1553725","character":"Dean Russell","urlCharacter":"http://www.imdb.com/character/ch0143169","main":true},{"actorName":"Clancy Brown","urlProfile":"http://www.imdb.com/name/nm0000317","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxODY3NjAzMF5BMl5BanBnXkFtZTcwMTQ5MjYwNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1959","placeOfBirth":" Urbana, Ohio, USA","birthName":"Clarence J. Brown III","height":"6' 2½\" (1.89 m)","bio":"A tall, wavy-haired US actor with a deep, resonant voice, Clancy Brown has proved himself a versatile performer with first-class contributions to theater, feature films, television series and even animation. Clarence J. Brown III was born in 1959 in Urbana, Ohio, to Joyce Helen (Eldridge), a concert pianist, conductor, and composer, and Republican congressman Clarence J. \"Bud\" Brown, Jr., who helped manage the Brown Publishing Company, the family-owned newspaper started by Clancy's grandfather, Congressman Clarence J. Brown. Clancy spent much of his youth in close proximity to Washington, D.C. He plied his dramatic talents in the Chicago theater scene before moving onto feature film with a sinister debut performance bullying Sean Penn inside a youth reformatory in Bad Boys (1983). He portrayed Viktor the Monster in the unusual spin on the classic Frankenstein story in The Bride (1985), before scoring one of his best roles to date as the evil Kurgan hunting fellow immortals Christopher Lambert and Sean Connery across four centuries of time in Highlander (1986). Brown played a corrupt American soldier in the Walter Hill-directed hyper-violent action film Extreme Prejudice (1987), another deranged killer in Shoot to Kill (1988) and a brutal prison guard, who eventually somewhat \"befriends\" wrongfully convicted banker Tim Robbins, in the moving The Shawshank Redemption (1994). His superb vocal talents were in demand, and he contributed voices to animated series, including Mortal Kombat: Defenders of the Realm (1995), Street Sharks (1994), Gargoyles (1994) and Superman (1996). Brown then landed two more plum roles, one as a \"tough-as-nails\" drill sergeant in the science fiction thriller Starship Troopers (1997), and the other alongside Robin Williams in the Disney comedy Flubber (1997). The video gaming industry took notice of Clancy's vocal abilities, too, and he has contributed voices to several top selling video games, including Crash Bandicoot: The Wrath of Cortex (2001), Lands of Lore III (1999), Star Wars: Bounty Hunter (2002) and Crash Nitro Kart (2003). His voice is also the character of cranky crustacean Mr. Eugene H. Krabs in the highly successful SpongeBob SquarePants (1999) animated series and films, and he contributed voices to The Batman (2004), Jackie Chan Adventures (2000) and Justice League (2001) animated series. A popular and friendly personality, Clancy Brown continues to remain busy both through his vocal and acting talents in Hollywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxODY3NjAzMF5BMl5BanBnXkFtZTcwMTQ5MjYwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000317","name":"Clancy Brown","idIMDB":"nm0000317"},"actorId":"nm0000317","character":"Alan Smith","urlCharacter":"http://www.imdb.com/character/ch0190188","main":true},{"actorName":"Connie Britton","urlProfile":"http://www.imdb.com/name/nm0110168","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyODQ2NDIxN15BMl5BanBnXkFtZTcwNTY4ODM2MQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1967","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Constance Elaine Womack","height":"5' 8\" (1.73 m)","bio":"Connie Britton began playing country music fading sensation Rayna Jaymes in Nashville (2012) after having wrapped production for the five season long Friday Night Lights (2006) alongside Kyle Chandler. She previously appeared in Universal's Friday Night Lights (2004) -the movie- directed by Peter Berg and also starring Billy Bob Thornton; and Edward Burns' independent feature Looking for Kitty (2004). Britton was born Constance Elaine Womack in Boston, Massachusetts, to Linda Jane (Cochran) and Edgar Allen Womack, Jr., a physicist and energy company executive. She is of Irish, German, and English descent. Britton received accolades for her starring roles in Edward Burns' acclaimed independent films The Brothers McMullen (1995) and No Looking Back (1998). In the former, she captivated moviegoers with her portrayal of \"Molly\", the luminous wife of a cheating husband. This popular low-budget film went on to win the Grand Jury Prize at the Sundance Film Festival. After nearly canceling her audition with director Edward Burns, this last meeting of the day turned into the role that would launch her career. Born in Boston, Massachusetts, Britton moved to Lynchburg, Virginia, at the age of seven with her family, including her fraternal twin sister. She went on to attend Dartmouth College, where she majored in Asian studies and spent a term in Beijing, China. Upon graduation, she moved to New York, where she spent two years at the Neighborhood Playhouse studying with Sanford Meisner, and an additional two years performing in regional theater and off-Broadway productions. She moved to Los Angeles after the success of The Brothers McMullen (1995). She starred in ABC's Lost at Home (2003) opposite Mitch Rouse and Gregory Hines. Her other television credits include The Fighting Fitzgeralds (2001) opposite Brian Dennehy, a recurring role in the highly-acclaimed drama The West Wing (1999) and a starring role in the award-winning comedy Spin City (1996) opposite Michael J. Fox. Additionally, Britton starred in the recent feature films The Next Big Thing (2001) and One Eyed King (2001). In her free time, Britton, who resides in both New York and Los Angeles, enjoys hiking, yoga, and doing volunteer work.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyODQ2NDIxN15BMl5BanBnXkFtZTcwNTY4ODM2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0110168","name":"Connie Britton","idIMDB":"nm0110168"},"actorId":"nm0110168","character":"Dr. Gwen Holbrook","urlCharacter":"http://www.imdb.com/character/ch0027965","main":true},{"actorName":"Lia D. Mortensen","urlProfile":"http://www.imdb.com/name/nm0607795","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjIzMzczMzI0NV5BMl5BanBnXkFtZTgwNzg1NzU0MjE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"bio":"Lia D. Mortensen is an actress, known for A Nightmare on Elm Street (2010), Blink (1993) and Arc of a Bird (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjIzMzczMzI0NV5BMl5BanBnXkFtZTgwNzg1NzU0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0607795","name":"Lia D. Mortensen","idIMDB":"nm0607795"},"actorId":"nm0607795","character":"Nora Fowles","urlCharacter":"http://www.imdb.com/character/ch0131713","main":true},{"actorName":"Julianna Damm","urlProfile":"http://www.imdb.com/name/nm3524673","urlPhoto":"","biography":{"bio":"Julianna Damm is an actress, known for A Nightmare on Elm Street (2010), A Wish Your Heart Makes (2012) and My Name Is Kay (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3524673","name":"Julianna Damm","idIMDB":"nm3524673"},"actorId":"nm3524673","character":"Little Kris","urlCharacter":"http://www.imdb.com/character/ch0220084","main":true},{"actorName":"Christian Stolte","urlProfile":"http://www.imdb.com/name/nm0831601","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc0Zjk4NzItZWNmOS00ZWIxLTlhZjctOWFmOWU4NGUzNjdlL2ltYWdlXkEyXkFqcGdeQXVyNTA5MTc2NQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 October 1962","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Christian Joseph Stolte","bio":"Christian Stolte was born on October 16, 1962 in St. Louis, Missouri, USA as Christian Joseph Stolte. He is an actor, known for Chicago Fire (2012), Law Abiding Citizen (2009) and Public Enemies (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc0Zjk4NzItZWNmOS00ZWIxLTlhZjctOWFmOWU4NGUzNjdlL2ltYWdlXkEyXkFqcGdeQXVyNTA5MTc2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0831601","name":"Christian Stolte","idIMDB":"nm0831601"},"actorId":"nm0831601","character":"Jesse's Father","urlCharacter":"http://www.imdb.com/character/ch0192664","main":true},{"actorName":"Katie Schooping Knight","urlProfile":"http://www.imdb.com/name/nm3877154","urlPhoto":"","biography":{"bio":"Katie Schooping Knight is an actress, known for A Nightmare on Elm Street (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3877154","name":"Katie Schooping Knight","idIMDB":"nm3877154"},"actorId":"nm3877154","character":"Creepy Girl #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hailey Schooping Knight","urlProfile":"http://www.imdb.com/name/nm3876064","urlPhoto":"","biography":{"bio":"Hailey Schooping Knight is an actress, known for A Nightmare on Elm Street (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3876064","name":"Hailey Schooping Knight","idIMDB":"nm3876064"},"actorId":"nm3876064","character":"Creepy Girl #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leah Uteg","urlProfile":"http://www.imdb.com/name/nm3877076","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTg1NDEzOF5BMl5BanBnXkFtZTgwODM3MTI0NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 1\" (1.55 m)","bio":"Leah Uteg is an actress, known for A Nightmare on Elm Street (2010), Lucy (2013) and Goodbye Guns (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTg1NDEzOF5BMl5BanBnXkFtZTgwODM3MTI0NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3877076","name":"Leah Uteg","idIMDB":"nm3877076"},"actorId":"nm3877076","character":"Creepy Girl #3","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Don Robert Cass","urlProfile":"http://www.imdb.com/name/nm3875472","urlPhoto":"","biography":{"bio":"Don Robert Cass is known for his work on A Nightmare on Elm Street (2010) and Criminal Activities (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3875472","name":"Don Robert Cass","idIMDB":"nm3875472"},"actorId":"nm3875472","character":"History Teacher","urlCharacter":"http://www.imdb.com/character/ch0194216","main":true}],"seasons":[],"idIMDB":"tt1179056","urlIMDB":"http://www.imdb.com/title/tt1179056","business":{"budget":{"money":"$35,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$32,902,299","country":"USA","day":"02","month":"05","year":"2010","remarks":"3,332 Screens"},{"money":"£1,342,837","country":"UK","day":"09","month":"05","year":"2010","remarks":"354 Screens"}],"gross":[{"money":"$63,059,655","country":"USA","day":"11","month":"07","year":"2010","remarks":""},{"money":"$63,005,877","country":"USA","day":"04","month":"07","year":"2010","remarks":""},{"money":"$62,902,167","country":"USA","day":"27","month":"06","year":"2010","remarks":""},{"money":"$62,733,729","country":"USA","day":"20","month":"06","year":"2010","remarks":""},{"money":"$62,578,426","country":"USA","day":"13","month":"06","year":"2010","remarks":""},{"money":"$62,412,068","country":"USA","day":"06","month":"06","year":"2010","remarks":""},{"money":"$61,906,422","country":"USA","day":"30","month":"05","year":"2010","remarks":""},{"money":"$59,967,500","country":"USA","day":"23","month":"05","year":"2010","remarks":""},{"money":"$56,066,595","country":"USA","day":"16","month":"05","year":"2010","remarks":""},{"money":"$48,479,560","country":"USA","day":"09","month":"05","year":"2010","remarks":""},{"money":"$32,902,299","country":"USA","day":"02","month":"05","year":"2010","remarks":""},{"money":"£3,502,236","country":"UK","day":"30","month":"05","year":"2010","remarks":""},{"money":"£3,238,509","country":"UK","day":"23","month":"05","year":"2010","remarks":""},{"money":"£2,677,189","country":"UK","day":"16","month":"05","year":"2010","remarks":""},{"money":"£1,342,837","country":"UK","day":"09","month":"05","year":"2010","remarks":""},{"money":"$113,400,000","country":"Worldwide","day":"08","month":"08","year":"2010","remarks":""}],"weekendGross":[{"money":"$28,805","country":"USA","day":"11","month":"07","year":"2010","remarks":"53 Screens"},{"money":"$53,403","country":"USA","day":"04","month":"07","year":"2010","remarks":"110 Screens"},{"money":"$80,064","country":"USA","day":"27","month":"06","year":"2010","remarks":"172 Screens"},{"money":"$120,397","country":"USA","day":"20","month":"06","year":"2010","remarks":"228 Screens"},{"money":"$72,647","country":"USA","day":"13","month":"06","year":"2010","remarks":"125 Screens"},{"money":"$212,442","country":"USA","day":"06","month":"06","year":"2010","remarks":"294 Screens"},{"money":"$1,127,395","country":"USA","day":"30","month":"05","year":"2010","remarks":"891 Screens"},{"money":"$2,321,388","country":"USA","day":"23","month":"05","year":"2010","remarks":"2,125 Screens"},{"money":"$4,657,190","country":"USA","day":"16","month":"05","year":"2010","remarks":"3,075 Screens"},{"money":"$9,119,389","country":"USA","day":"09","month":"05","year":"2010","remarks":"3,332 Screens"},{"money":"$32,902,299","country":"USA","day":"02","month":"05","year":"2010","remarks":"3,332 Screens"},{"money":"£92,031","country":"UK","day":"30","month":"05","year":"2010","remarks":"143 Screens"},{"money":"£194,603","country":"UK","day":"23","month":"05","year":"2010","remarks":"306 Screens"},{"money":"£649,323","country":"UK","day":"16","month":"05","year":"2010","remarks":"357 Screens"},{"money":"£1,342,837","country":"UK","day":"09","month":"05","year":"2010","remarks":"354 Screens"}],"admissions":[],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"05","month":"05","year":"2009","remarks":null},{"money":null,"country":null,"day":"10","month":"07","year":"2009","remarks":null}],"copyrightHolder":"© 2010 New Line Productions, Inc. (on print)"},"technical":{"runtime":["1 hr 35 min (95 min)"],"soundMix":["Dolby Digital","DTS","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Panaflex Millennium XL2, Panavision E-, G-Series, ATZ and AWZ2 Lenses"],"laboratory":["Company 3, Los Angeles (CA), USA (digital intermediate) (dailies)","DeLuxe, Hollywood (CA), USA (also prints)"],"filmLength":["2,498 m (Portugal, 35 mm)","2,646 m (Spain)"],"negativeFormat":["35 mm (Kodak Vision3 250D 5207, Vision2 500T 5260)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Panavision (anamorphic) (source format)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)","D-Cinema"]},"rating":"5.2","metascore":"35","filmingLocations":[{"location":"Barrington, Illinois, USA"}],"rated":"R","awards":[{"award":"Empire Awards, UK 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Empire Award","categories":[{"category":"Best Horror","names":[]}]}]},{"award":"Fangoria Chainsaw Awards 2011","titlesAwards":[{"titleAwardOutcome":"Won Chainsaw Award","categories":[{"category":"Worst Film","names":[]}]}]},{"award":"Fright Meter Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Fright Meter Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Katie Cassidy","id":"nm1556320","role":null}]}]}]},{"award":"Golden Schmoes Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Worst Movie of the Year","names":[]},{"category":"Biggest Disappointment of the Year","names":[]}]}]},{"award":"People's Choice Awards, USA 2011","titlesAwards":[{"titleAwardOutcome":"Won People's Choice Award","categories":[{"category":"Favorite Horror Movie","names":[]}]}]},{"award":"Scream Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Scream Award","categories":[{"category":"Best Villain","names":[{"name":"Jackie Earle Haley","id":"nm0355097","role":null}]},{"category":"Best Horror Movie","names":[]}]}]},{"award":"Teen Choice Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie: Horror/Thriller","names":[]},{"category":"Choice Movie Actor: Horror/Thriller","names":[{"name":"Jackie Earle Haley","id":"nm0355097","role":null}]},{"category":"Choice Movie Actress: Horror/Thriller","names":[{"name":"Katie Cassidy","id":"nm1556320","role":null}]}]}]},{"award":"World Stunt Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Taurus Award","categories":[{"category":"Hardest Hit","names":[{"name":"Tarah Paige","id":"nm1395985","role":null}]},{"category":"Best Overall Stunt by a Stunt Woman","names":[{"name":"Tarah Paige","id":"nm1395985","role":null}]}]}]}],"votes":"78,155","type":"Movie","companyCreditsSimple":[{"idCompany":"co0046718","name":"New Line Cinema"},{"idCompany":"co0071240","name":"Platinum Dunes"}],"keywords":{"keywords":["dream","nightmare","pedophilia","pervert","pedophile","child molestation","child molester","death","revenge","killing an animal","janitor","torture","boogeyman","sicko","sexual predator","perversion","attempted rape","human monster","springwood ohio","child rape","dark past","elm street","teenager","swimming pool","security camera","wrongful imprisonment","death of boyfriend","boyfriend girlfriend relationship","high school principal","high school","self mutilation","teleportation","molotov cocktail","boiler room","villain not really dead cliche","evil man","plant in title","pool of blood","fictional town","hand through chest","hand through head","stabbed with scissors","pre school","paranoia","vigilantism","secret","lifting someone into the air","disfigurement","surrealism","characters killed one by one","ambulance","remake of cult favorite","blood splatter","open ended","nightmare becomes reality","gore","hallucination","severed hand","hand cut off","falling through the floor","stabbed in the eye","eye gouging","stabbed in the head","stabbed in the leg","car crash","necklace","paper cutter","cover up","stabbed with a needle","adrenaline","cut arm","hospital","prescription drugs","bookstore","slow motion scene","person on fire","burned alive","flashback","bare chested male","indoor swimming pool","hiding in a closet","gardner","bloody body of a child","murder","video blog","class photograph","car accident","bathtub","snow","drawing","body bag","corpse","hanging upside down","impalement","stabbed in the back","arrest","jail","stabbed with glass","blood","stabbed to death","stabbed in the chest","covered in blood","blood on shirt","looking at oneself in a mirror","cut hand","waitress","burnt body","burnt face","dog","younger version of character","mother daughter relationship","father son relationship","photograph","cemetery","swimmer","stabbed in the throat","lucid dream","diner","villain played by lead actor","grave side ceremony","funeral","throat slitting","swimming team","swimming coach","swimming","murdered in sleep","cell phone","burglar alarm system","alarm system","photo album","car cigarette lighter","burn scar","climbing through a window","repressed memory","high school student","ohio","killing of child molester","syringe","shared dream","dream imagery","dream sequence within a dream sequence","bad dream","sleep deprivation","falling asleep in class","falling asleep","awakened by a phone","trying to stay awake","woman in bath","bath","epinephrine","dream world","reboot of series","horror movie remake","terror","slasher flick","claw","killer","street in title","remake","place name in title","freddy krueger","death of friend","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:44:57"}}