{"data":{"movies":[{"title":"Depth Charge","originalTitle":"","year":"2008","releaseDate":"200807","directors":[{"name":"Terrence O'Hara","id":"nm0641343"}],"writers":[{"name":"Dennis A. Pratt","id":"nm0695446"}],"runtime":"84 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNTAxMzQwNl5BMl5BanBnXkFtZTcwNTE4ODU5Mw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Thriller"],"plot":"On his final voyage before being transferred to a desk job, Commander Krieg, a seasoned Naval officer aboard the nuclear submarine USS Montana and overlooked for promotion to captain is making a shocking bid for world peace. With the help of mercenaries,he takes over the sub, its nuclear weapons and experimental stealth technology in order to hold Washington D.C. and the world hostage.","simplePlot":"On his final voyage a commandeer aboard a nuclear submarine is making a shocking bid for world peace. With the help of mercenaries he takes over the sub in order to hold Washington D.C. and the world hostage.","actors":[{"actorName":"Jason Gedrick","urlProfile":"http://www.imdb.com/name/nm0001263","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNDE1MTc0MF5BMl5BanBnXkFtZTcwNjE4NDMzMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1965","placeOfBirth":" Chicago, Illinois, USA","birthName":"Jason Michael Gedroic","height":"5' 11½\" (1.82 m)","bio":"Jason Gedrick was born on February 7, 1965 in Chicago, Illinois, USA as Jason Michael Gedroic. He is an actor and director, known for Backdraft (1991), Iron Eagle (1986) and Promised Land (1987). He was previously married to Dana Lavas.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNDE1MTc0MF5BMl5BanBnXkFtZTcwNjE4NDMzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001263","name":"Jason Gedrick","idIMDB":"nm0001263"},"actorId":"nm0001263","character":"Raymond 'Doc' Ellers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Roberts","urlProfile":"http://www.imdb.com/name/nm0000616","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MTk3OTgwM15BMl5BanBnXkFtZTcwODE1OTIwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1956","placeOfBirth":" Biloxi, Mississippi, USA","birthName":"Eric Anthony Roberts","height":"5' 10\" (1.78 m)","bio":"One of Hollywood's edgier, more intriguing characters running around and about for decades, Eric Anthony Roberts started life in Biloxi, Mississippi. He is the son of Betty Lou (Bredemus) and Walter Grady Roberts, one-time actors and playwrights. His siblings are actors Lisa Roberts Gillan and Julia Roberts, and he grew up in Atlanta, Georgia. He began his acting career at age 5 in a local theater company called the \"Actors and Writers Workshop\", founded by his late father. After his schooling at Grady High, he studied drama at age 17 in London for two years at the Royal Academy of Dramatic Arts, then returned to the States and continued his studies at the American Academy in New York. He made his NY stage debut in \"Rebel Women\" in 1976 at age 20 and appeared in regional productions, once playing the newspaper boy in a production of \"A Streetcar Named Desire\" starring Shirley Knight and Glenn Close. After appearing in such daytime soaps as Another World (1964) and How to Survive a Marriage (1974), his career began to shift fast forward when he copped a leading role in a major film. In King of the Gypsies (1978), based on Peter Maas' best-seller about a fracturing dynasty of New York City gypsies, he made his debut alongside an intimidating roster of stars including Judd Hirsch, Susan Sarandon, Shelley Winters and Sterling Hayden. Young Eric held his own expertly (winning a Golden Globe nomination) while his burning intensity and brooding charm marked sure signs of star potential. After this, he won the lead opposite Milo O'Shea in the 1980 stage production of \"Mass Appeal\". He suffered serious injuries in a car accident during his nascent film career but lost no fans by the time he returned to co-star with Sissy Spacek as a small-town stranger in Raggedy Man (1981). It was, however, his stark and frightening portrayal of two-bit hustler Paul Snider, the cast-off boyfriend who slays Playmate-turned-movie starlet Dorothy Stratten (played by Mariel Hemingway) in Star 80 (1983) that really put him on the movie map and earned him a second Golden Globe nomination. A wide range of fascinating, whacked-out roles were immediately offered to him on a silver plate. He played another dangerous streetwise hustler type in The Pope of Greenwich Village (1984) opposite fellow rebel Mickey Rourke; a cocky soda pop sales exec in the Australian comedy Coca-Cola kid (1985); appeared with more charm and restraint opposite Rosanna Arquette in the offbeat romantic comedy Nobody's Fool (1986) and topped his prolific period off with an Academy Award nomination as a young prison escapee hiding out with Jon Voight aboard an out-of-control train in the ultra-violent, character-driven action adventure Runaway Train (1985). Good things continued to happen when he was a replacement lead in the original run of \"Burn This\" and won a Theatre World Award for his 1988 Broadway debut. A risky, no-holds-barred actor, he was often guilty of overacting if given half the chance. His film career began to slide in the late 1980s, appearing in more quantity than quality pictures. A series of missteps led to unheralded appearances in such bombs as the karate-themed Best of the Best (1989); the NY urban thriller The Ambulance (1990); the action western Blood Red (1989), which took three years to release and is the only film Eric and his sister Julia Roberts appeared in together; and Rude Awakening (1989) when he filled in as a burned-out hippie opposite a Chong-less Cheech Marin. More under appreciated \"B\" filming came with the 1990s (Freefall (1994), Sensation (1994), The Nature of the Beast (1995), etc.), while also chewing the scenery with a number of mobster types in TV-movies, including one as \"Al Capone\". He soon began appearing as flashy secondary villains and creepies that showcased other stars instead, such as Final Analysis (1992) starring Richard Gere, Heaven's Prisoners (1996) top lining Alec Baldwin, and The Dark Knight (2008), part of the \"Batman\" series with Christian Bale and the late Heath Ledger. Eric's undeniable, unconventional talent would occasionally mesh with the perfect role. At the Sundance Film Festival in 1996, he received critical applause for his starring role as a man dying of AIDS in the uplifting and emotional film It's My Party (1996) and earned more honors as a writer marked for murder in the mob-themed story La Cucaracha (1998). He was also perfectly cast as one of the cold-blooded killers in the Emmy-nominated TV adaptation of Truman Capote's chiller In Cold Blood (1996). Eric continued to appear sporadically on TV in such dramatic series as Law & Order: Criminal Intent (2001), while sometimes showing a fun side as well in comedy (The King of Queens (1998)). His own series work included Less Than Perfect (2002) and, more recently, and in the cult program Heroes (2006) where promise for a longer participation ended with his character's death. Recovered from a long-standing cocaine problem, Eric wed, for the first time, actress/writer Eliza Roberts (nee Garrett). They have appeared in such films as Killer Weekend (2004) and Final Approach (2005). His daughter from a former relationship, Emma Roberts, is a newly popular and fast-rising \"tween\" actress from the series Unfabulous (2004) and has played youthful super-sleuth Nancy Drew (2007) on film. Eric's unpredictable, volatile nature which works so mesmerizing on screen has also led to troubling times off camera; his relationship with younger sis Julia Roberts has been seriously strained for quite some time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MTk3OTgwM15BMl5BanBnXkFtZTcwODE1OTIwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000616","name":"Eric Roberts","idIMDB":"nm0000616"},"actorId":"nm0000616","character":"Cdr. William Krieg","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barry Bostwick","urlProfile":"http://www.imdb.com/name/nm0000960","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NjA4MDg0MV5BMl5BanBnXkFtZTgwNDY5MDgzNDE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1945","placeOfBirth":" San Mateo, California, USA","birthName":"Barry Knapp Bostwick","height":"6' 4\" (1.93 m)","bio":"Tall (6' 4\"), agile, energetic, and ever-so-confident as both actor and singer, especially on the award-winning Broadway stage, Barry Bostwick possesses that certain narcissistic poise, charm and élan that reminds one instantly (and humorously) of a Kevin Kline -- both were quite brilliant in their respective interpretations of The Pirate King in \"The Pirates of Penzance\". Yet, for all his diverse talents (he is a Golden Globe winner and was nominated for the Tony Award three times, winning once), Barry is indelibly caught in a time warp. Even today, 35 years after the fact, he is indelibly associated with the role of nerdy hero Brad Majors in the midnight movie phenomena The Rocky Horror Picture Show (1975). While it is extremely flattering to be a part of such a cult institution, Barry's acting legacy deserves much more than this. He was born Barry Knapp Bostwick on February 24, 1945, in San Mateo, California, one of two sons of Elizabeth \"Betty\" (Defendorf) and Bud Bostwick (Henry Bostwick), a city planner and actor. A student at San Mateo High School, he and his elder brother Peter use to put on musicals and puppet shows for the neighborhood kids. Barry attended San Diego's United States International University's School for the Performing Arts in 1967, and switched from music to drama during the course of his studies. He also worked occasionally as a circus performer, which would come in handy on the musical stage down the line. He subsequently moved to New York and attended the Graduate School of Arts and Sciences at New York University. Making his stage debut at age 22 in a production of \"Take Her, She's Mine,\" Barry performed in a number of non-musical roles in such productions of \"War and Peace\" (1968) and \"The Misanthrope (1968). Making his 1969 Broadway debut in \"Cock-a-Doodle Dandy\", which ran in tandem with \"Hamlet\" in which he was featured as Osric, it was his portrayal of the swaggering, leather jacket-wearing 50s \"bad boy\" Danny Zuko in the 1972 Broadway high-school musical smash \"Grease\" that put Barry's name prominently and permanently on the marquee signs. Originating the role, he was nominated for a Tony but lost out that year to the older generation (Phil Silvers for \"A Funny Thing Happened...\"). In the midst of all this star-making hoopla, Barry was also breaking into films with a minor role in Jennifer on My Mind (1971) and leading parts in the comedy spoofs Road Movie (1974) and The Wrong Damn Film (1975). It all paled after winning the role as Susan Sarandon's simp of a boyfriend in the The Rocky Horror Picture Show (1975), which featured a delicious Tim Curry camping it up as a transvestite monster-maker. The movie, based on the macabre 1973 British stage musical \"The Rocky Horror Show,\" packed the midnight movie houses with costumed fans replicating every move and, word and offering puns and props aplenty in recapturing the insanity of the show. While the \"Rocky\" association hit like a tornado, Barry ventured on and tried to distance himself. He created sparks again on Broadway, garnering a second Tony nomination for the comedy revival \"They Knew What They Wanted\" in 1976. He finally took home the trophy the following year for the musical \"The Robber Bridegroom\" (1977), which relied again on his patented bluff and bravado as a Robin Hood-like hero. Following top roles in the musicals \"She Loves Me\" and \"The Pirates of Penzance\", Barry turned rewardingly to film and TV. The two-part feature Movie Movie (1978), which played like an old-style double feature, was a great success, performing alongside esteemed actor George C. Scott. Barry excelled in both features, but especially the musical parody. He fared just as well on the smaller screen in TV movies, playing everything from historical icons (George Washington) to preening matinée idols (John Gilbert), and winning a Golden Globe for his role as a military officer in the epic miniseries War and Remembrance (1988). A variety of interesting roles followed in glossy, soap-styled fare, farcical comedies and period drama. A welcomed return to Broadway musicals in the form of \"Nick & Nora\" (he as sleuth Nick \"The Thin Man\" Charles) was marred when the glitzy production folded after only nine perfs. Instead, the prematurely grey-haired actor found steadier success in sitcoms as a smug comedy foil to Michael J. Fox playing Mayor Randall Winston for six seasons in Spin City (1996). He later enjoyed a recurring role as a dauntless attorney on Law & Order: Special Victims Unit (1999). Then again, Barry could be spotted pitching items in commercials or hamming it up in family-oriented Disneyesque entertainment in the \"Parent Trap\" and \"101 Dalmatian\" mold. In 1997, Bostwick was diagnosed with prostate cancer, and 10 days later had his prostate removed. The operation was successful and in 2004, he won the Gilda Radner Courage Award from the Roswell Park Cancer Institute. Just a year earlier he appeared on an episode of \"Scrubs\" as a patient also having prostate cancer. Barry married somewhat late in life. For a brief time he was wed to actress Stacey Nelkin (1987-1991), but has since become a father of two, Brian and Chelsea, with second wife Sherri Jensen Bostwick, an actress who appeared with Barry in the TV movie Praying Mantis (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NjA4MDg0MV5BMl5BanBnXkFtZTgwNDY5MDgzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000960","name":"Barry Bostwick","idIMDB":"nm0000960"},"actorId":"nm0000960","character":"President Taylor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Warren","urlProfile":"http://www.imdb.com/name/nm0912703","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODk3Y2UxOGYtM2Y5OC00MGFmLWI1MTctN2I0MDgwYTYwODQ5L2ltYWdlXkEyXkFqcGdeQXVyNTgzOTMxNDQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 January 1990","placeOfBirth":" Indianapolis, Indiana, USA","height":"5' 10¾\" (1.8 m)","bio":"Chris Warren was born on January 15, 1990 in Indianapolis, Indiana, USA. He is an actor, known for The Fosters (2013), Extracurricular Activities (2017) and Alvin and the Chipmunks: The Squeakquel (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODk3Y2UxOGYtM2Y5OC00MGFmLWI1MTctN2I0MDgwYTYwODQ5L2ltYWdlXkEyXkFqcGdeQXVyNTgzOTMxNDQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0912703","name":"Chris Warren","idIMDB":"nm0912703"},"actorId":"nm0912703","character":"James Piersall","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bridget White","urlProfile":"http://www.imdb.com/name/nm0924554","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTEyY2FjMDAtMmFiMi00OWIyLWIyZmMtY2NhYWE0YWU5NjU2XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Bridget White was a competitive gymnast for ten years and started her professional career as a dancer/choreographer. She holds a Bachelor of Arts from DeSales University. She studied opera at The Bryn-Mawr Conservatory of Music. After college, she moved to New York and was cast in various Broadway/touring musicals. Soon after, she started working with renowned manager Vincent Cirrincione and began to focus on her acting career. In New York, she studied with William Esper and Wynn Handman. In Los Angeles, she works with coach Leigh Kilton-Smith. She has worked extensively in TV and film since coming to Los Angeles, but her true passion is the theater and she indulges in that as much as possible. She is a member of Circle X, an award winning Los Angeles theater company. Through Circle X, she works with Los Angeles Youth Network. She has performed in many regional theaters throughout the country. She grew up in Philadelphia, the daughter of a detective. She has two brothers, two sisters-in-law, and ten nieces and nephews, whom she adores. She currently splits her time between NY and LA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTEyY2FjMDAtMmFiMi00OWIyLWIyZmMtY2NhYWE0YWU5NjU2XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0924554","name":"Bridget White","idIMDB":"nm0924554"},"actorId":"nm0924554","character":"Katie McCallister","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Corbin Bernsen","urlProfile":"http://www.imdb.com/name/nm0000929","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNDQ4Njk4OV5BMl5BanBnXkFtZTcwNjY0MDk4Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1954","placeOfBirth":" North Hollywood, Los Angeles, California, USA","birthName":"Corbin Dean Bernsen","height":"5' 10¾\" (1.8 m)","bio":"Corbin Bernsen made his initial mark on the seminal television series L.A. Law as opportunistic divorce lawyer \"Arnie Becker\" earning him multiple Emmy and Golden Globe nominations over the show's eight-year run. He proved along the way the role was not to be a dead-end stereotype, maintaining a steady career in both television and film over the course of three decades. Moreover, his intent devotion to his career and love for the craft has compelled him in recent years to climb into the producer/writer, and director's chair. Born in North Hollywood, California, on September 7, 1954, Corbin was raised in and around the entertainment business. The eldest of three children, his father film and television producer Harry Bernsen and mother, veteran actress Jeanne Cooper encouraged him to continue the family tradition. After high school he originally attended UCLA with the intention of pursuing law, but instead, he went on to receive a BFA in Theatre Arts and MFA in Playwriting. He worked on the Equity-waiver L.A. stage circuit as both actor and set designer, making his film debut as a bit player in his father's picture Three the Hard Way. He then set his sights on New York in the late 70s. In the early years he carved out a living as a carpenter building rooftop decks in NYC that still stand to this day. Then in 1983 he landed the role of \"Ken Graham\" on daytime's Ryan's Hope and he put his tool belt away. This break led to an exclusive deal with NBC and eventually the TV role in L.A. Law. The perks of his \"newly-found stardom\" on L.A. Law included a hosting stint on Saturday Night Live and the covers of numerous major magazines. Not one to settle for what he knew could be fleeting comfort, he worked diligently to parlay his small screen success into a diverse resume of feature film roles, both starring and supporting, often enjoying the challenge of portraying unsympathetic characters with an infusion of charm and likability. He co-starred as Shelley Long's egotistical husband in the reincarnation comedy Hello Again; played an equally vain Hollywood star in the musical comedy Bert Rigby, You're a Fool; and starred as a disorganized ringleader of a band of crooks in the bank caper Disorganized Crime. He capped the 1980s decade opposite Charlie Sheen and Tom Berenger in the box office hit Major League, which took advantage of his natural athleticism, playing ballplayer-cum-owner \"Roger Dorn\". Two sequels followed. Other notable feature film work includes the mystery thriller Shattered, directed by Wolfgang Peterson, which re-teamed him with Tom Berenger, Stephen Frears' Lay The Favorite, and a turn opposite Robert Downey Jr. in Shane Black's Kiss Kiss Bang Bang. On the TV front, he has appeared in many MOW's including Line of Fire: The Morris Dees Story as the famed civil rights attorney who founded the Southern Poverty Law Center. Topping it off, Corbin's title role in the horror/ thriller The Dentist for HBO had audiences developing a similar paranoia of tooth doctors as Anthony Perkins invoked decades before to motel clerks. As spurned husband-turned-crazed dentist \"Dr. Alan Feinstone\", Corbin reached cult horror status. The movie spawned a sequel in which he also served as a producer. Most recently, he has reunited with Dentist director Brian Yuzna on a slate of films exploring similar themes starting with \"The Plastic Surgeon.\" More recently Bernsen wrapped eight seasons on USA Network's hit series Psych as Henry Spencer playing James Roday's retired cop father who taught his \"fake psychic,\" crime solving son everything he knows. In 2006 he formed his own production company, Team Cherokee Productions to exert more creative control over his projects and begin exploring material both as writer, director and producer. Today that company has taken root as Home Theater Films, an early player in the Faith and Family film genre. The company has explored a wide variety of themes beginning with the film \"Rust\" which was distributed by Sony Pictures. With five other films under their belt, including \"25 Hill,\" \"Beyond the Heavens,\" \"Christian Mingle\" starring Lacey Chabert, and the upcoming \"Jesse and Naomi,\" Home Theater Films has firmly carved a niche and name in this lucrative genre. Corbin has been happily married (since 1988) to British actress Amanda Pays who most recently be seen on \"The Flash.\" They have appeared together in the sci-fi film Spacejacked and the TV-movies Dead on the Money and The Santa Trap, among others. The couple has four sons. Never one to become complacent or fall prey to the hype - a lesson learned from his mother - he still practices his carpenter skills at home as he continues to write, produce, and direct. Perseverance and dedication has played a large part in his continued success. Having a savvy take-charge approach hasn't hurt either -- characteristics worthy of many of the characters he's explored on screen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNDQ4Njk4OV5BMl5BanBnXkFtZTcwNjY0MDk4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000929","name":"Corbin Bernsen","idIMDB":"nm0000929"},"actorId":"nm0000929","character":"Capt. Brad Richards","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alex Paez","urlProfile":"http://www.imdb.com/name/nm0655979","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQxNjE4MzgxM15BMl5BanBnXkFtZTgwMDYzODYxNTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1963","placeOfBirth":" Queens, New York, USA","height":"5' 9\" (1.75 m)","bio":"Alex Paez was born on July 25, 1963 in Queens, New York, USA. He is an actor, known for The Magic Hat (1977), Alex and the Wonderful Doo-Wah Lamp (1978) and The Stowaway (1977). He has been married to Helen Wassell since January 8, 1997.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQxNjE4MzgxM15BMl5BanBnXkFtZTgwMDYzODYxNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0655979","name":"Alex Paez","idIMDB":"nm0655979"},"actorId":"nm0655979","character":"Lieutenant Michaels","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Dayan Fisher","urlProfile":"http://www.imdb.com/name/nm1113959","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MDE2MDI3N15BMl5BanBnXkFtZTgwNjA4MzQ5NjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Born and raised in North London. David started acting at 28 years of age. He worked in numerous jobs before finding his passion. From a Pizza and Crepe chef to owner of a float tank center. He trained at Central School of Speech and Drama in west London. Improv. at Timber Theater company in Highgate, and Dangerous acting at the Actor Studio. Actor, Author, Artist & poet.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MDE2MDI3N15BMl5BanBnXkFtZTgwNjA4MzQ5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1113959","name":"David Dayan Fisher","idIMDB":"nm1113959"},"actorId":"nm1113959","character":"Garrett","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maury Sterling","urlProfile":"http://www.imdb.com/name/nm0827561","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MDg2MjU0MV5BMl5BanBnXkFtZTgwNjExMTY0MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 September 1971","placeOfBirth":" Mill Valley, California, USA","birthName":"Charles Maury Wallace Sterling","bio":"Maury Sterling was born on September 1, 1971 in Mill Valley, California, USA as Charles Maury Wallace Sterling. He is an actor, known for Coherence (2013), The A-Team (2010) and Kung Fu Panda 2 (2011). He has been married to Alexis Boozer Sterling since May 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MDg2MjU0MV5BMl5BanBnXkFtZTgwNjExMTY0MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0827561","name":"Maury Sterling","idIMDB":"nm0827561"},"actorId":"nm0827561","character":"Allenson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Deobia Oparei","urlProfile":"http://www.imdb.com/name/nm0649046","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTE4ODMzM15BMl5BanBnXkFtZTgwMDAxMjE0MDI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1971","placeOfBirth":" London, England, UK","height":"6' 6\" (1.98 m)","bio":"Deobia Oparei was born in 1971 in London, England. He is an actor, known for Game of Thrones (2011) and Independence Day: Resurgence (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTE4ODMzM15BMl5BanBnXkFtZTgwMDAxMjE0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0649046","name":"Deobia Oparei","idIMDB":"nm0649046"},"actorId":"nm0649046","character":"Gerard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michelle Lee","urlProfile":"http://www.imdb.com/name/nm1685477","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjAzMTQ2OTY5Nl5BMl5BanBnXkFtZTcwNDk5MzkxNg@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 August 1978","placeOfBirth":" Long Beach, California, USA","birthName":"Michelle Charlene Lee","height":"5' 7\" (1.7 m)","bio":"Michelle Lee was born on August 2, 1978 in Long Beach, California, USA as Michelle Charlene Lee. She is known for her work on Pirates of the Caribbean: At World's End (2007), Suicide Squad (2016) and Pacific Rim (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjAzMTQ2OTY5Nl5BMl5BanBnXkFtZTcwNDk5MzkxNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1685477","name":"Michelle Lee","idIMDB":"nm1685477"},"actorId":"nm1685477","character":"Chang","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Geoff Meed","urlProfile":"http://www.imdb.com/name/nm0576015","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MjA3NjAwNV5BMl5BanBnXkFtZTYwMzI4Mjky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1965","placeOfBirth":" Houston, Texas, USA","birthName":"Geoffrey Andrew Meed","bio":"Geoff began as a stuntman working in the Universal Studios Hollywood Tour, where he worked in the \"Wild West Stunt Show\", \"The Adventures of Conan\", and \"The Miami Vice Action Spectacular.\" Using that as a springboard, Geoff has performed almost all of his own stunts as an actor, from going through glass windows, to highfalls, to car chases, to doing all of his own extensive fighting with the likes of Steven Seagall, Chuck Norris, and Mark Dacascos. As a playwright, Geoff has had five original plays produced in Los Angeles. He directed four of them, and starred in all five.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MjA3NjAwNV5BMl5BanBnXkFtZTYwMzI4Mjky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0576015","name":"Geoff Meed","idIMDB":"nm0576015"},"actorId":"nm0576015","character":"Rosen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Monroe Taylor","urlProfile":"http://www.imdb.com/name/nm1453696","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjU1NTU1MzkyNl5BMl5BanBnXkFtZTgwODI2NzczMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Stephen Monroe Taylor is an actor and producer, known for Anger Management (2012), Criminal Minds (2005) and Texas Rising: Sam Houston - A Man of the Revolution (2015). He has been married to Ashley Taylor since May 21, 2006.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjU1NTU1MzkyNl5BMl5BanBnXkFtZTgwODI2NzczMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1453696","name":"Stephen Monroe Taylor","idIMDB":"nm1453696"},"actorId":"nm1453696","character":"Bachman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yorgo Constantine","urlProfile":"http://www.imdb.com/name/nm0176085","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MTc5Nzg3NF5BMl5BanBnXkFtZTcwMzk0MjE3MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Yorgo Constantine is known for his work on Live Free or Die Hard (2007), Fast Five (2011) and Phone Booth (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MTc5Nzg3NF5BMl5BanBnXkFtZTcwMzk0MjE3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0176085","name":"Yorgo Constantine","idIMDB":"nm0176085"},"actorId":"nm0176085","character":"Andreyev","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Allen Young","urlProfile":"http://www.imdb.com/name/nm0950165","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMDc3NjQ4OV5BMl5BanBnXkFtZTgwMzM4MjI5NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 January 1954","placeOfBirth":" Washington, District of Columbia, USA","height":"6' (1.83 m)","bio":"William Allen Young was born on January 24, 1954 in Washington, District of Columbia, USA. He is an actor and director, known for District 9 (2009), Moesha (1996) and Lock Up (1989). He has been married to Helen Patrice Moore since November 8, 1986. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMDc3NjQ4OV5BMl5BanBnXkFtZTgwMzM4MjI5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0950165","name":"William Allen Young","idIMDB":"nm0950165"},"actorId":"nm0950165","character":"Capt. Daniel Lewis","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1192384","urlIMDB":"http://www.imdb.com/title/tt1192384","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 24 min (84 min) (DVD) (Brazil)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.4","filmingLocations":[{"location":"Los Angeles, California, USA"}],"awards":[],"votes":"366","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0013824","name":"RHI Entertainment"},{"idCompany":"co0294673","name":"Alpine Media"},{"idCompany":"co0045255","name":"Larry Levinson Productions"}],"keywords":{"keywords":["submarine","stealth","u.s. president","medical officer","blackmail","extortion","traitor","hijack","doctor","underwater","navy"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:20:52"}}