{"data":{"movies":[{"title":"The Miracles of Jesus","originalTitle":"","year":"1991","releaseDate":"1991","directors":[{"name":"Don Lusk","id":"nm0527206"},{"name":"Ray Patterson","id":"nm0666362"}],"writers":[{"name":"Kay Wright","id":"nm0942559"}],"runtime":"30 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMjY3ODUzNF5BMl5BanBnXkFtZTgwMjYyNTI0ODE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Short"],"plot":"During His earthly ministry, Jesus Christ, according to the four Gospels, performed many miracles. These miracles were performed to show us that God is real, and that He loves us an wants to heal and restore us to the abundant life. These supernatural acts of love and power drew people to Jesus, revealed His divine nature, opened hearts to the message of salvation, and caused many to glorify God.","simplePlot":"During His earthly ministry, Jesus Christ, according to the four Gospels, performed many miracles. These miracles were performed to show us that God is real, and that He loves us an wants ... ","actors":[{"actorName":"David Ackroyd","urlProfile":"http://www.imdb.com/name/nm0010097","urlPhoto":"","biography":{"dateOfBirth":"30 May 1940","placeOfBirth":" Orange, New Jersey, USA","height":"6' 1\" (1.85 m)","bio":"Veteran stage and TV actor David Ackroyd was born on May 30, 1940 in Orange, New Jersey, the son of Arthur, an insurance adjuster, and Charlotte (nee Henderson) Ackroyd. He studied at Bucknell University in Pennsylvania where he received his BA in 1962 as an ROTC student. Following his graduation he appeared in community theater productions while serving in Arizona with the military. He then focused on the arts as a career after enrolling at the Yale Drama School where he earned his Masters of Fine Arts in 1968. David gathered early professional credits at the Yale Repertory Theatre (for three seasons) and Williamstown Theatre Festival (for six seasons). He also found challenging and varied stage work outside the U.S. in Taiwan, Russia, Poland, Germany, France, and the Czech Republic. Dark-haired with a serious handsomeness to him, he was able to extend his all-stage career into film and TV in the early 1970s, beginning with daytime leading man outings in \"The Secret Storm\" and \"Another World\". He progressed to prime time work as Gary Ewing in Dallas (1978) until Ted Shackelford successfully took over the role when the character moved front and center with the spin-off drama Knots Landing (1979). David's prime on-camera work occurred in the late 70s with a series of strong co-star roles in the mini-series The Dark Secret of Harvest Home (1978) with Bette Davis and The Word (1978), as well as the TV-movies And I Alone Survived (1978) and Women in White (1979). He then began to find supporting roles in such movies as The Mountain Men (1980), The Sound of Murder (1982), Wrestling with God (1990), Dark Angel (1990) and Prison Life (2000); however, film stardom eluded him. Prone to playing upscale types or white-collar professionals (senators, doctors, lawyers, etc.), he appeared as a guest star on such popular programs as \"Hotel\", \"Dynasty\", \"Highway to Heaven\", \"Murder She Wrote\" and \"MacGyver\". He also continued to prevail on the stage with potent performances in \"Unlikely Heroes\", his 1971 Broadway debut, \"The Rivals\", \"Juno and the Paycock\", \"Hamlet\" (as Rosencrantz), \"Private Lives\" \"Children of a Lesser God\" (replacing original star John Rubinstein), \"A Soldier's Play\", \"Who's Afraid of Virginia Woolf?\", \"Six Characters in Search of an Author\", and, more recently, off-Broadway in 2003 with \"It Just Catches\". A well-seasoned narrator in documentary stories for the History Channel, he has sometimes utilized his well-modulated vocals for such animated cartoons as \"Johnny Quest\" and \"Captain Planet and the Planeteers\". Most of his work of late comes in the form of voice work. Long married to wife Ruth Liming, a college admissions officer, the couple has two daughters, Jessica and Abigail. Living in Montana where he is a professor of drama at Flathead Valley Community College in Kalispell, David is also one of the founding members of the Alpine Theatre Project which produces plays for the Whitefish Theatre Company.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0010097","name":"David Ackroyd","idIMDB":"nm0010097"},"actorId":"nm0010097","character":"Jesus","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harold Gould","urlProfile":"http://www.imdb.com/name/nm0332390","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyOTIyNzMwMF5BMl5BanBnXkFtZTcwOTM0Njg4Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1923","placeOfBirth":" Schenectady, New York, USA","birthName":"Harold Vernon Goldstein","height":"5' 9½\" (1.77 m)","bio":"Harold Gould earned a Ph.D. in theatre and taught speech and drama at Cornell University. Pursuing some off-Broadway work in the 1950s, he decided to practice what he preached, and became a full-time professional actor in the 1960s. He has appeared in hundreds of TV shows since, usually playing a father, grandfather or other authority figure.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyOTIyNzMwMF5BMl5BanBnXkFtZTcwOTM0Njg4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0332390","name":"Harold Gould","idIMDB":"nm0332390"},"actorId":"nm0332390","character":"Benjamin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rene Auberjonois","urlProfile":"http://www.imdb.com/name/nm0041281","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNjQ0NDc4N15BMl5BanBnXkFtZTcwODM3NTk0Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1940","placeOfBirth":" New York City, New York, USA","birthName":"Rene Murat Auberjonois","height":"6' (1.83 m)","bio":"René Murat Auberjonois was born on June 1, 1940 in New York City. René was born into an already artistic family, which included his grandfather, a well-known Swiss painter, and his father Fernand, a writer. The Auberjonois family moved to Paris shortly after World War II, and it was there that René made an important career decision at the age of six. When his school put on a musical performance for the parents, little René was given the honor of conducting his classmates in a rendition of \"Do You Know the Muffin Man?\". When the performance was over, René took a bow, and, knowing that he was not the real conductor, imagined that he had been acting. He decided then and there that he wanted to be an actor. After leaving Paris, the Auberjonois family moved into an Artist's Colony in upstate New York. At an early age, René was surrounded by musicians, composers and actors. Among his neighbors were Helen Hayes, Burgess Meredith and John Houseman, who would later become an important mentor. Houseman gave René his first theater job at the age of 16, as an apprentice at a theater in Stratford, Connecticut. René would later teach at Juilliard under Houseman. René attended Carnegie-Mellon University and studied theater completely, not only learning about acting but about the entire process of producing a play. After graduating from CMU, René acted with various theater companies, including San Francisco's American Conservatory Theater and Los Angeles' Mark Taper Forum. In 1969, he won a role in his first Broadway musical, \"Coco\" (with Katharine Hepburn), for which he won a Tony Award. Since then, René has acted in a variety of theater productions, films and television presentations, including a rather famous stint as Clayton Endicott III on the comedy series Benson (1979), not to mention seven years on Star Trek: Deep Space Nine (1993) as Odo. René has also done dramatic readings of a variety of books on tape. René's most recent projects have included The Patriot (2000), starring Mel Gibson, and Sally Hemings: An American Scandal (2000). In the fall of 2000, he also appeared on NBC's Frasier (1993) and ABC's The Practice (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNjQ0NDc4N15BMl5BanBnXkFtZTcwODM3NTk0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0041281","name":"Rene Auberjonois","idIMDB":"nm0041281"},"actorId":"nm0041281","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Darleen Carr","urlProfile":"http://www.imdb.com/name/nm0139669","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGNlMGFmNjktNzllNi00NjFiLWFhMDgtMDc2NTU4OWU1NmQ3XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1950","placeOfBirth":" Chicago, Illinois, USA","birthName":"Darleen Farnon","height":"5' 5\" (1.65 m)","bio":"Darleen Carr was born on December 12, 1950 in Chicago, Illinois, USA as Darleen Farnon. She is an actress, known for The Jungle Book (1967), The Beguiled (1971) and Eight Days a Week (1997). She has been married to Jameson Parker since June 18, 1992. She was previously married to Jason Laskay.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGNlMGFmNjktNzllNi00NjFiLWFhMDgtMDc2NTU4OWU1NmQ3XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0139669","name":"Darleen Carr","idIMDB":"nm0139669"},"actorId":"nm0139669","character":"Margo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Eiding","urlProfile":"http://www.imdb.com/name/nm0251646","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NDEwNjk5Nl5BMl5BanBnXkFtZTcwNTY5NzQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 March 1957","placeOfBirth":" Cleveland, Ohio, USA","height":"5' 8½\" (1.74 m)","bio":"Paul Eiding, is an American actor, who is equally comfortable on stage, in front of the camera or behind a microphone. He is the voice of Perceptor, from the original Transformers, cartoon series (1985) and Transformers: The Movie (1986). He is probably best known as Colonel Roy Campbell, in the Metal Gear Solid series. He is the narrator and Lazarus, in Diablo, Judicator Aldaris in Starcraft, and Grandpa Max Tennyson, in every Ben 10 cartoon series, including Ben 10, Alien Force, Ultimate Alien, and Omniverse, in which he also voices Blukic, Eye Guy, Liam, and others. On camera, he appeared in Star Trek: TNG, as Ambassador Loquel. Paul has guest starred on Grey's Anatomy, CSI: Miami, The Drew Carey Show, ER, The West Wing, The Practice, My Name Is Earl, The Charmings, L.A. Law, Picket Fences, The Pretender, Providence and many other shows. Paul, who is originally from Cleveland, Ohio, began his professional acting, directing, and writing career over 30 years ago. He sang, played bass, and directed the 3rd Infantry Div, Marne Glee Club, in Germany. Later, while creating and performing comedy sketches at the Brave New Workshop in Minneapolis,Mn, Paul also contributed as a writer/actor to National Public Radio's, \"All Things Considered\" supplying topical satirical material. He has directed stage shows in Ohio, Wisconsin, Minnesota and California. He moved to Los Angeles in 1983. The following year he received both an L.A. Drama Critics Circle Award and Dramalogue Award for his work in the critically acclaimed stage production of 'Cloud Nine'. He was a series regular on ABC's, The Charmings, and for two seasons, recurred as school teacher Jason Steinberg, on the highly acclaimed Picket Fences. He is the voice of Pa Kent, in Superman vs The Elite, the bath house manager, in Spirited Away, and various characters in Pixar's Finding Nemo, WALL-E, Monsters, Inc, Up, Cars, A Bug's Life, and Monsters U. Some other animated series work includes, The Toxic Crusaders, The Littles, Pirates Of Dark Water, The Real Adventures Of Jonny Quest, Sky Commanders, and Challenge Of the Gobots. He can be heard on classic series such as, The Jetsons, The Smurfs, Swat Kats, and Animaniacs. His video game credits are extensive. He voiced Hojo, in Final Fantasy VII, Zephyr, in Ratchet and Clank, Galmar Stonefist, Felldir, and Septimus, in The Elder Scrolls: Skyrim, Zeus/Gravedigger, in God Of War, Theseus, in God Of War II, and 14 characters in Fallout 3. As the Executor in Starcraft II. He's the one who tells the player, \"You must construct additional pylons.\" or \"You need more vespene gas!\" A few other games, include: Resistance 3, Rage, Resident Evil: Revelations, Mass Effect 2, HALO: Reach, Guild Wars: Eye Of The North, Guild Wars 2, Jade Empire, Marvel: Ultimate Alliance, No More Heroes 2: Desperate Struggle, Starcraft 1, 2, 3, Diablo, 1, 2, 3, Star Wars: The Old Republic, and Warcraft III: The Frozen Throne. Paul believes in the old theatre axiom, \"The more you can do, the more you will do.\" To that end, he continues appearing in live theatre, as well as, television, webisodes, film, cartoons, voiceover commercials and games. He has had the absolute joy of performing on stage with his entire family. Wife, Colleen and both daughters, are all actors. He happily admits, \"Clearly, we're all crazy.\" Paul attends conventions, and other personal appearances all over the world and truly loves to meet fans.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NDEwNjk5Nl5BMl5BanBnXkFtZTcwNTY5NzQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0251646","name":"Paul Eiding","idIMDB":"nm0251646"},"actorId":"nm0251646","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Darryl Hickman","urlProfile":"http://www.imdb.com/name/nm0382718","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI5NjkyODg0MV5BMl5BanBnXkFtZTcwODY0NzA0Mw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 July 1931","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Darryl Gerard Hickman","height":"5' 8½\" (1.74 m)","bio":"Although younger brother Dwayne Hickman is probably the better-remembered sibling today with his still-huge cult following as TV's Dobie Gillis, Darryl Hickman was certainly the more popular actor and deemed more talented when they were children. During his years at MGM in the wartime 40s, Darryl was featured prominently in many grade \"A\" film productions, including the classic The Grapes of Wrath (1940), Men of Boys Town (1941), The Human Comedy (1943), Leave Her to Heaven (1945) and The Happy Years (1950), among many others. Discovered at age 3, Darryl literally grew up on the sound stage but abandoned acting suddenly in 1951 to enter a monastery. It was not to be his calling, however, and he left over a year later and tried to pick up where he left off in Hollywood. It wasn't easy. After a decent role in Tea and Sympathy (1956), film and TV offers suddenly dried up. While brother Dwayne was hitting it big on TV, Darryl wisely moved behind the scenes and eventually became a program executive. Ironically, so did Dwayne after his acting career faded. Darryl would marry actress Pamela Lincoln, whom he met on the film set of The Tingler (1959). In later years he would also become a respected acting coach in the Los Angeles area.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI5NjkyODg0MV5BMl5BanBnXkFtZTcwODY0NzA0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0382718","name":"Darryl Hickman","idIMDB":"nm0382718"},"actorId":"nm0382718","character":"Derek","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rob Paulsen","urlProfile":"http://www.imdb.com/name/nm0667326","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzODc1MTk4MzheQTJeQWpwZ15BbWU3MDY4NjU1MDg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 March 1956","placeOfBirth":" Detroit, Michigan, USA","birthName":"Robert Fredrick Paulsen III","height":"5' 10½\" (1.79 m)","bio":"Rob Paulsen was born on March 11, 1956 in Detroit, Michigan, USA as Robert Fredrick Paulsen III. He is an actor, known for Animaniacs (1993), Teenage Mutant Ninja Turtles (2012) and The Mask (1995). He is married to Parrish Todd. They have one child. He was previously married to Carol Anne Schnarr.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzODc1MTk4MzheQTJeQWpwZ15BbWU3MDY4NjU1MDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0667326","name":"Rob Paulsen","idIMDB":"nm0667326"},"actorId":"nm0667326","character":"Moki","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Renaday","urlProfile":"http://www.imdb.com/name/nm0719115","urlPhoto":"","biography":{"dateOfBirth":"9 June 1935","placeOfBirth":" Louisiana, USA","birthName":"Pierre L. Renoudet","bio":"Peter Renaday was born on June 9, 1935 in Louisiana, USA as Pierre L. Renoudet. He is known for his work on General Hospital (1963), Teenage Mutant Ninja Turtles (1987) and Howl's Moving Castle (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0719115","name":"Peter Renaday","idIMDB":"nm0719115"},"actorId":"nm0719115","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Mark Richman","urlProfile":"http://www.imdb.com/name/nm0725052","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NDg5Nzc1Ml5BMl5BanBnXkFtZTcwNTU4ODkwNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1927","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Marvin Jack Richman","height":"5' 10½\" (1.79 m)","bio":"Before he became an actor, Mark Richman played football for two years in a Pennsylvania league called the Eastern Pro Conference. Sidelined by a serious knee injury, he became a registered pharmacist and managed a Rosemont, Pennsylvania, drug store for a year. His interests later turned to acting and he began appearing in stage productions and in live TV out of New York. In 1971, he added \"Peter\" to the front of his name for spiritual reasons. Richman's recent one-man, four-character show \"4 Faces\" (written and performed by Richman, directed by his wife Helen Richman and with original music by their son Lucas Richman) was a critical hit, which earned Richman the prestigious Drama-Logue Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NDg5Nzc1Ml5BMl5BanBnXkFtZTcwNTU4ODkwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0725052","name":"Peter Mark Richman","idIMDB":"nm0725052"},"actorId":"nm0725052","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kristoffer Tabori","urlProfile":"http://www.imdb.com/name/nm0846070","urlPhoto":"","biography":{"dateOfBirth":"4 August 1952","placeOfBirth":" Malibu, California, USA","birthName":"Christopher Donald Siegel","height":"5' 10\" (1.78 m)","bio":"A natural progression to entertain the thought of entering show business as the son of Swedish actress Viveca Lindfors and American director Don Siegel. Actor Kristoffer Tabori was born in Malibu in 1952 and appeared in one of his mother's films Weddings and Babies (1958) as a youngster. His parents divorced when he was barely a year old and his mother subsequently married Hungarian writer/director George Tabori. Kristoffer would use the name \"Tabori\" for his own. He started making the theater rounds in the late 60s, and took his first official stage bow with \"The Merchant of Venice\" at the Berkshire Theatre Festival in 1966. He debuted on Broadway with \"The Guns of Carrar\" two years later. Other plays followed (\"Habeas Corpus,\" \"Hamlet,\" \"Dreams of a Blacklisted Actor\") and in 1970 he won the Theatre World Award for \"How Much How Much.\" Kristoffer became a product of his generation playing lean hippie and liberal thinker types. In movie bits as a late teen, one of those was an unbilled appearance in his father's cop action drama Coogan's Bluff (1968), one of several that had Siegel directing Clint Eastwood. Tabori's stage success led to progressive strides in 70s film. He earned strong reviews for his first lead in _Makin' It (1971)_ as a sex-obsessed 17-year-old who suffers a heavy, traumatic experience with his mother, played by Joyce Van Patten. Such films as _Pigeons (1971)_ and Journey Through Rosebud (1972) did not pave the way to stardom, however, and he started impressing on TV instead with quality mini-movies including \"The Glass House (1972), \"QBVII\" (1974), \"The Lady's Not for Burning\" (1974) and \"A Memory of Two Mondays (1974). He turned more and more to the stage in the mid-70s and joined the Arena Stage theater company in Washington, D.C. from 1976-1978, and California's South Coast Repertory and National Shakespeare Festival the following decade. He married British actress Judy Geeson in 1984 and they appeared notably on stage together in \"The Common Pursuit\" before divorcing a few years later. Tabori focused on directing in the 90s, predominantly on TV, helming episodes for such series as \"Picket Fences,\" \"Chicago Hope,\" \"Providence\" and \"Judging Amy.\" Shortly before his mother's death in 1995, he appeared as her son in the film Last Summer in the Hamptons (1995). He has also lent his crisp voice to a number of video games in the \"Battlestar Galactica\" and \"Star Wars\" target area.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0846070","name":"Kristoffer Tabori","idIMDB":"nm0846070"},"actorId":"nm0846070","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fredricka Weber","urlProfile":"http://www.imdb.com/name/nm0993383","urlPhoto":"","biography":{"dateOfBirth":"22 December 1940","placeOfBirth":" Beardstown, Illinois, USA","bio":"Fredricka Weber was born on December 22, 1940 in Beardstown, Illinois, USA. She is an actress, known for Snorks (1984), Irish Whiskey Rebellion (1972) and The Miracles of Jesus (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0993383","name":"Fredricka Weber","idIMDB":"nm0993383"},"actorId":"nm0993383","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1268944","urlIMDB":"http://www.imdb.com/title/tt1268944","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["30 min"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.7","filmingLocations":[{"location":"Los Angeles, California, USA"}],"awards":[],"votes":"23","type":"Video","companyCreditsSimple":[{"idCompany":"co0024579","name":"Hanna-Barbera Productions"}],"keywords":{"keywords":["miracle","reference to jesus christ","christianity","bible","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:05:13"}}