{"data":{"movies":[{"title":"Teenage Mutant Ninja Turtles","originalTitle":"","year":"2014","releaseDate":"20140808","directors":[{"name":"Jonathan Liebesman","id":"nm0509448"}],"writers":[{"name":"Josh Appelbaum","id":"nm0032227"},{"name":"André Nemec","id":"nm0625858"}],"runtime":"101 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUzODQ5MDY5NV5BMl5BanBnXkFtZTgwOTc1NzcyMjE@._V1.jpg","countries":["USA"],"languages":["English","Japanese"],"genres":["Action","Adventure","Comedy","Sci-Fi"],"plot":"Darkness has settled over New York City as Shredder and his evil Foot Clan have an iron grip on everything from the police to the politicians. The future is grim until four unlikely outcast brothers rise from the sewers and discover their destiny as Teenage Mutant Ninja Turtles. The Turtles must work with fearless reporter April O'Neil and her cameraman Vern Fenwick to save the city and unravel Shredder's diabolical plan.","simplePlot":"When a kingpin threatens New York City, a group of mutated turtle warriors must emerge from the shadows to protect their home.","actors":[{"actorName":"Megan Fox","urlProfile":"http://www.imdb.com/name/nm1083271","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MjgyMzk4NF5BMl5BanBnXkFtZTcwODk2OTM4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1986","placeOfBirth":" Rockwood, Tennessee, USA","birthName":"Megan Denise Fox","height":"5' 4\" (1.63 m)","bio":"Megan Denise Fox was born in Rockwood, Tennessee, to Gloria Darlene (Cisson) and Franklin Thomas Fox, a parole officer. Megan began her training in drama and dance at age 5 and, at age 10, moved to St. Petersburg, Florida where she continued her training and finished school. Megan began acting and modeling at age 13 after winning several awards at the 1999 American Modeling and Talent Convention in Hilton Head, South Carolina. At age 17, she tested out of school using correspondence and eventually moved to Los Angeles, California. Megan made her film debut as Brianna Wallace in the Mary-Kate Olsen and Ashley Olsen film Holiday in the Sun (2001). Her best known roles are as Sam Witwicky's love interest Mikaela Banes in the first two installments of the Transformers series, Transformers (2007) and Transformers: Revenge of the Fallen (2009), and as April O'Neil in the film reboot of Teenage Mutant Ninja Turtles (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MjgyMzk4NF5BMl5BanBnXkFtZTcwODk2OTM4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1083271","name":"Megan Fox","nicknames":["Mega Fox","Foxy Megan"],"idIMDB":"nm1083271"},"actorId":"nm1083271","character":"April O'Neil","urlCharacter":"http://www.imdb.com/character/ch0000495","main":true},{"actorName":"Will Arnett","urlProfile":"http://www.imdb.com/name/nm0004715","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDkzMjEzNDMyN15BMl5BanBnXkFtZTcwNTk3ODEyOQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 May 1970","placeOfBirth":" Toronto, Ontario, Canada","birthName":"William Emerson Arnett","height":"6' 2½\" (1.89 m)","bio":"Will Arnett is a Canadian-American actor, voice actor, and comedian. He played George Oscar \"Gob\" Bluth II in the Fox series, Arrested Development (2003). He also appeared in films, such as The Lego Movie (2014), Teenage Mutant Ninja Turtles (2014), Teenage Mutant Ninja Turtles: Out of the Shadows (2016) and The LEGO Batman Movie (2017). Arnett also voices the title character of Netflix's original animated series, BoJack Horseman (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDkzMjEzNDMyN15BMl5BanBnXkFtZTcwNTk3ODEyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004715","name":"Will Arnett","idIMDB":"nm0004715"},"actorId":"nm0004715","character":"Vernon Fenwick","urlCharacter":"http://www.imdb.com/character/ch0000690","main":true},{"actorName":"William Fichtner","urlProfile":"http://www.imdb.com/name/nm0001209","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyOTI3MzcxMF5BMl5BanBnXkFtZTcwNzIwNzQ3OQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 November 1956","placeOfBirth":" Mitchell Field Air Force Base, East Meadow, Long Island, New York, USA","birthName":"William Edward Fichtner","height":"6' 0½\" (1.84 m)","bio":"A small-town guy with a big heart, William Fichtner has been captivating the hearts of Western New Yorkers for decades. Bill was born in 1956 on Long Island, New York, to Patricia A. (Steitz) and William E. Fichtner. He is of German, Irish, and English descent. Fichtner was raised in Cheektowaga, and graduated from Maryvale High School in 1974. His first roles were in soap operas such as As the World Turns (1956) and sitcoms like Grace Under Fire (1993). He has also been in films such as Armageddon (1998), Empire Falls (2005), as The Marriage Counselor, uncredited, in Mr. & Mrs. Smith (2005), and in The Dark Knight (2008). A fan of the Buffalo Sabres, Bill always stays true to his roots. He is married to actress Kymberly Kalil.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyOTI3MzcxMF5BMl5BanBnXkFtZTcwNzIwNzQ3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001209","name":"William Fichtner","nicknames":["Bill"],"idIMDB":"nm0001209"},"actorId":"nm0001209","character":"Eric Sacks","urlCharacter":"http://www.imdb.com/character/ch0469199","main":true},{"actorName":"Alan Ritchson","urlProfile":"http://www.imdb.com/name/nm2024927","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NTkzOTU0Nl5BMl5BanBnXkFtZTgwMTQzMDY2MDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1984","placeOfBirth":" Grand Forks, North Dakota, USA","height":"6' 2\" (1.88 m)","bio":"Alan Ritchson has carved a space for himself on both the large and small screens since he made the trek from a small town in Florida to Los Angeles. Alan Michael Ritchson was born in Grand Forks, North Dakota, to Vickie (Harrell), a high school teacher, and David Ritchson, a U.S. Air Force Chief Master Sergeant. He is of Czech, English, and German descent. Frequently relocating as the middle son of a military family, Alan learned to adapt and entertain in order to build friendships in new and unfamiliar environments. Certainly this has been a key ingredient in his success so far in the industry. Alan's early credits include portraying Aquaman in the long running series Smallville. This marked the first portrayal of the superhero in an officially licensed live-action production. Ritchson has also taken on grittier leading man roles in the independent film market with the modern-day western \"Rex\" and the dramatic love story of \"Steam\" alongside Ally Sheedy. In contrast, he also made quite a comedic impression with his love-to-hate-him character of Thad Castle on the football comedy Blue Mountain State. He parlayed his comedic skills to work with Rebel Wilson in her CBS pilot Super Fun Night. In addition to his acting repertoire, Alan also writes, produces and is a singer/songwriter. Most recently Alan has can be seen as the District 1 victor, Gloss, in Catching Fire; the second installment of the hugely successful Hunger Games franchise. He also portrayed the cool-but-crude Raphael in the Michael Bay produced reboot of TMNT.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NTkzOTU0Nl5BMl5BanBnXkFtZTgwMTQzMDY2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2024927","name":"Alan Ritchson","idIMDB":"nm2024927"},"actorId":"nm2024927","character":"Raphael","urlCharacter":"http://www.imdb.com/character/ch0000631","main":true},{"actorName":"Noel Fisher","urlProfile":"http://www.imdb.com/name/nm0279720","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMTc3NzQ2OV5BMl5BanBnXkFtZTcwNjAxNzExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 March 1984","placeOfBirth":" Vancouver, British Columbia, Canada","height":"5' 7\" (1.7 m)","bio":"Noel Fisher was born in Vancouver, British Columbia, Canada. He has been steadily gaining momentum as an actor since he was 14 years old. His very first role was in the TV movie The Sheldon Kennedy Story (1999) for CBC in 1999. The part landed Fisher his first Gemini nomination, [the equivalent to the U.S. Primetime Emmy Awards] which was followed with a second nomination for his work on the hit Canadian series Godiva's (2005). He then appeared in the hit MTV movie 2gether (2000), in the Disney film Max Keeble's Big Move (2001), and as Brian Gibbons in Final Destination 2 (2003), which made 17 million dollars in the United States on its opening weekend. Once gaining traction in Canada, Fisher proved that his talent would translate to the US market, appearing in the blockbuster Columbia feature film Battle Los Angeles (2011), with his portrayal of rookie Marine \"Pfc. Shaun Lenihan opposite Aaron Eckhart. He has also made his mark in television, appearing on top series such as Two and a Half Men (2003), The Mentalist (2008) ,and Medium (2005), a recurring role on Law & Order: Special Victims Unit (1999), Huff (2004),\" and Bones (2005). In 2008, he went to Sundance with the independent film Red (2008) alongside with Brian Cox. 2010 was a standout year for Fisher, as he was seen in the Emmy-winning miniseries The Pacific (2010),\" the follow up to the hit miniseries Band of Brothers (2001). His other television credits from the past two years include solid performances in Lie to Me (2009), FX's Terriers (2010), Criminal Minds: Suspect Behavior (2011) and TNT's Dark Blue (2009).\" Audiences may best remember Fisher from his breakout performance in the critically acclaimed FX series The Riches (2007), portraying Cal, the conniving and clever son of Eddie Izzard and Minnie Driver. In 2012, Fisher can be seen with a supporting role as \"Vladimir\", a Romanian vampire in the final chapter of the worldwide phenomenon, The Twilight Saga: Breaking Dawn - Part 2 (2012). In addition to Twilight, Fisher has been recurring as \"Mickey Milkovich\" opposite William H. Macy and Emmy Rossum on the hit Showtime series Shameless (2011). It was recently announced that he would be joining the cast as a series regular, for season three. In May 2012, Fisher can also be seen in the highly anticipated, History Channel miniseries Hatfields & McCoys (2012) as \"Ellison 'Cotton Top' Mounts\" opposite Kevin Costner, Bill Paxton, and Jena Malone. When not working, Fisher loves to go camping, go to the beach, and just hang out at home with a good movie and frozen yogurt. He is also an animal lover and supports the efforts of The Humane Society of the United States, and he supports Visual Impact Now.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMTc3NzQ2OV5BMl5BanBnXkFtZTcwNjAxNzExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0279720","name":"Noel Fisher","idIMDB":"nm0279720"},"actorId":"nm0279720","character":"Michelangelo","urlCharacter":"http://www.imdb.com/character/ch0000650","main":true},{"actorName":"Pete Ploszek","urlProfile":"http://www.imdb.com/name/nm5293935","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxOTQ4NjI3NV5BMl5BanBnXkFtZTgwMjU0NzMxODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1987","placeOfBirth":" Hinsdale, Illinois, USA","height":"6' 1\" (1.85 m)","bio":"Pete Ploszek is an American actor. He was born in Hinsdale, Illinois but grew up across New Jersey, Maine, and Ohio before settling in St. Charles, Illinois. He played football at Princeton University and earned an MFA in Acting from the USC School of Dramatic Arts. He currently resides in Los Angeles with his wife.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxOTQ4NjI3NV5BMl5BanBnXkFtZTgwMjU0NzMxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5293935","name":"Pete Ploszek","idIMDB":"nm5293935"},"actorId":"nm5293935","character":"Leonardo","urlCharacter":"http://www.imdb.com/character/ch0000614","main":true},{"actorName":"Johnny Knoxville","urlProfile":"http://www.imdb.com/name/nm0424216","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5Mjk5OTMxMV5BMl5BanBnXkFtZTYwODMyNDE0._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 March 1971","placeOfBirth":" Knoxville, Tennessee, USA","birthName":"Philip John Clapp","height":"6' 1\" (1.85 m)","bio":"Johnny Knoxville was born on March 11, 1971 in Knoxville, Tennessee, USA as Philip John Clapp. He is a writer and producer, known for Jackass: The Movie (2002), Jackass Number Two (2006) and Bad Grandpa (2013). He has been married to Naomi Nelson since September 24, 2010. They have two children. He was previously married to Melanie Lynn Cates.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5Mjk5OTMxMV5BMl5BanBnXkFtZTYwODMyNDE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0424216","name":"Johnny Knoxville","nicknames":["Johnny Jackass","PJ","JJ Knoxville"],"idIMDB":"nm0424216"},"actorId":"nm0424216","character":"Leonardo","urlCharacter":"http://www.imdb.com/character/ch0000614","main":true},{"actorName":"Jeremy Howard","urlProfile":"http://www.imdb.com/name/nm0397386","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3OTk2NjQ5NV5BMl5BanBnXkFtZTgwNzk4MTk4NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 June 1981","placeOfBirth":" Burbank, California, USA","birthName":"Jeremy Patrick Howard","height":"6' 4\" (1.93 m)","bio":"Jeremy Howard was born on June 12, 1981 in Burbank, California, USA as Jeremy Patrick Howard. He is an actor, known for Teenage Mutant Ninja Turtles: Out of the Shadows (2016), Mighty Med (2013) and How the Grinch Stole Christmas (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3OTk2NjQ5NV5BMl5BanBnXkFtZTgwNzk4MTk4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0397386","name":"Jeremy Howard","idIMDB":"nm0397386"},"actorId":"nm0397386","character":"Donatello","urlCharacter":"http://www.imdb.com/character/ch0000638","main":true},{"actorName":"Danny Woodburn","urlProfile":"http://www.imdb.com/name/nm0940173","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjQ3MTQ3MF5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1964","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Daniel Charles Woodburn","height":"4' (1.22 m)","bio":"Danny Woodburn is an entertainer on stage, film, television, and the comedy club circuit. Born and raised in the Philadelphia area, he is the son of a nurse and a professional golfer. He is a graduate of Philadelphia's Temple University's School of Film and Theater and recipient of their Outstanding Alumni Achievement Award of 2001. Danny achieved prominence on NBC's sitcom Seinfeld (1989), performing the role of Mickey Abbott, the volatile but lovable friend of Kramer. Since his first appearance on the show in 1994 he has gained speed as an actor and garnered respect from industry professionals. His character on Seinfeld was an important role for him, in the sense that the writing and portrayal of Mickey is positive and non-stereotypical. Danny has raised awareness of the continued derogatory and dehumanizing treatment of Little People in society and the media. He serves on the Performers With Disabilities Committee of the Screen Actors Guild. He is an advocate for disabled and Little People issues, having spoken at fundraisers such as Little People's Research Fund and Cincinnati's Inclusion Network.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjQ3MTQ3MF5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0940173","name":"Danny Woodburn","idIMDB":"nm0940173"},"actorId":"nm0940173","character":"Splinter","urlCharacter":"http://www.imdb.com/character/ch0000543","main":true},{"actorName":"Tony Shalhoub","urlProfile":"http://www.imdb.com/name/nm0001724","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MTg3MjcxNl5BMl5BanBnXkFtZTcwMTU4MzA1Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1953","placeOfBirth":" Green Bay, Wisconsin, USA","birthName":"Anthony Marcus Shalhoub","height":"5' 10\" (1.78 m)","bio":"Anthony Marcus Shalhoub was born and raised in Green Bay, Wisconsin. His father, Joe Shalhoub, who owned a grocery chain, emigrated from Lebanon to the United States as an orphan at the age of ten, later marrying Shalhoub's mother, Helen (Seroogy), who herself was born in Wisconsin, to Lebanese parents. When Tony was six, he was introduced to the theater, in a school production of \"The King and I\". He graduated from Green Bay East High, and then graduated with a bachelor's degree in drama from the University of Southern Maine before progressing to the Yale School of Drama, which he left with a Masters in 1980. After a time in the American Repertory Theatre, he moved to Broadway where he met his future wife, Brooke Adams, whom he married in 1992. She had an adopted daughter, Josie, who was three years old at the time that Tony and Brooke married. Tony adopted Brooke's own adopted child, Josie Lynn (b. 1989) when she was eight. In 1994, the couple adopted another daughter, Sophie. Tony's first audition after arriving in Los Angeles was for Italian cabdriver Antonio Scarpacci in the long-running sitcom Wings (1990), which also starred Tim Daly and Steven Weber. Next, Tony had roles in Men in Black (1997), Men in Black II (2002), and Thir13en Ghosts (2001). His biggest break came, however, playing the obsessive-compulsive detective Adrian Monk in Monk (2002). The series made him a star and earned him four straight Emmy Award nominations between 2003 and 2006, for Outstanding Lead Actor in a Comedy Series. Tony won the trophy in 2003, 2005 and 2006, proving how popular he has become after the success of Monk (2002), which continues to be very popular into its fifth year.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MTg3MjcxNl5BMl5BanBnXkFtZTcwMTU4MzA1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001724","name":"Tony Shalhoub","idIMDB":"nm0001724"},"actorId":"nm0001724","character":"Splinter","urlCharacter":"http://www.imdb.com/character/ch0000543","main":true},{"actorName":"Tohoru Masamune","urlProfile":"http://www.imdb.com/name/nm0556070","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzIwMzIxM15BMl5BanBnXkFtZTgwOTI5NzYyMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"An MIT grad, Masamune played \"Shredder\" in Michael Bay's \"Teenage Mutant Ninja Turtles\" (2014). He has had lead stage roles directed by Tony Award Winner Mary Zimmerman (Goodman Theatre) and Tony Award Winner Dan Sullivan (Williamstown Theatre Festival). He has worked with playwrights A.R. Gurney (Williamstown Theatre Festival) and Tony Award. Nominee Irene Mecchi (American Conservatory Theatre). He also was a member of the nationally recognized troupe, Theatre of Yugen, performing classical Japanese theatre (Noh/Kyogen). He starts off the Christopher Nolan film \"Inception\" with the first line of the movie playing opposite Leo DiCaprio and Ken Watanabe. He also played \"Haruto Yakimura\" in Marvel's Agents of S,H.I.E.L.D., and appears in the role of \"Martin Takagi\" as in the upcoming paranormal Thriller feature \"Chatter\", and also the voice of \"Kira\" in an episode of Dreamworks/Nickelodeon \"Kung Fu Panda - Legends of Awesomeness\". He is the voice of \"Sensei\" in Disney's Club Penguin online shorts. He also appeared in a lead role (Ozu) in the SyFy channel original movie, \"Warbirds\", and has made guest appearances on several TV shows . He first worked with Emmy award winning director Jon Cassar (24) on \"The Cape\" . His first gig was on the film \"Pacific Heights\" directed by the late Oscar winner, John Schlesinger. His father, Satoru Masamune was a top research professor at MIT, and his grandfather Testuo Nozoe, too was a world-renown scientist (in Japan). Descending from an old Japanese family, other notable ancestors of his include Hakucho Masamune (novelist/playwright), Atsuo Masamune (poet/lit scholar), Tokusaburo Masamune (painter), Isao Masamune (banker-former President of Industrial Bank of Japan) and Juichi Nozoe (politician-House of Representatives in Japan), Kinoshita Sukenai (Warrior Retainer -Isahaya) During college, Tohoru also was involved in the contemporary art world, working on technical crews for internationally renown installations artists, Nam Jun Paik, Brian Eno, and Bill Viola. He was born in Madison, Wisconsin, and grew up in Edmonton, Alberta, Canada. His family eventually settled in Newton (suburb of Boston), Massachusetts. He has been a principal in numerous national commercial campaigns including Mercedes Benz, Coor's Light, Volvo, Yo-Plus (Yoplait), Nissan,Maxima, Ikea, Ford Trucks, Subaru, Oldsmobile, Northwest Airlines. He has done 2 commercials with director, Zack Snyder (\"300\", \"Watchmen\"). He enjoys playing Ice Hockey and jamming on his Alesis keyboard.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzIwMzIxM15BMl5BanBnXkFtZTgwOTI5NzYyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0556070","name":"Tohoru Masamune","idIMDB":"nm0556070"},"actorId":"nm0556070","character":"Shredder","urlCharacter":"http://www.imdb.com/character/ch0000586","main":true},{"actorName":"Whoopi Goldberg","urlProfile":"http://www.imdb.com/name/nm0000155","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4ODgzNjQwOV5BMl5BanBnXkFtZTYwNzczNzc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1955","placeOfBirth":" New York City, New York, USA","birthName":"Caryn Elaine Johnson","height":"5' 5\" (1.65 m)","bio":"Whoopi Goldberg was born Caryn Elaine Johnson in the Chelsea section of Manhattan on November 13, 1955. Her mother, Emma (Harris), was a teacher and a nurse, and her father, Robert James Johnson, Jr., was a clergyman. Whoopi's recent ancestors were from Georgia, Florida, and Virginia. She worked in a funeral parlor and as a bricklayer while taking small parts on Broadway. She moved to California and worked with improv groups, including Spontaneous Combustion, and developed her skills as a stand-up comedienne. She came to prominence doing an HBO special and a one-woman show as Moms Mabley. She has been known in her prosperous career as a unique and socially conscious talent with articulately liberal views. Among her boyfriends were Ted Danson and Frank Langella. She was married three times and was once addicted to drugs. Goldberg first came to prominence with her starring role in The Color Purple (1985). She received much critical acclaim, and an Oscar nomination for her role and became a major star as a result. Subsequent efforts in the late 1980s were, at best, marginal hits. These movies mostly were off-beat to formulaic comedies like Pie voleuse (1987), The Telephone (1988) and Jumpin' Jack Flash (1986). She made her mark as a household name and a mainstay in Hollywood for her Oscar-winning role in the box office smash Ghost (1990). Whoopi Goldberg was at her most famous in the early 1990s, making regular appearances on Star Trek: The Next Generation (1987). She admitted to being a huge fan of the original Star Trek (1966) series and jumped at the opportunity to star in \"Star Trek: The Next Generation\". Goldberg received another smash hit role in Sister Act (1992). Her fish-out-of-water with some flash seemed to resonate with audiences and it was a box office smash. Whoopi starred in some highly publicized and moderately successful comedies of this time, including Made in America (1993) and Soapdish (1991). Goldberg followed up to her success with Sister Act 2: Back in the Habit (1993), which was well-received but did not seem to match up to the first. As the late 1990s approached, Goldberg seemed to alternate between lead roles in straight comedies such as Eddie (1996) and The Associate (1996), and took supporting parts in more independent minded movies, such as The Deep End of the Ocean (1999) and How Stella Got Her Groove Back (1998). Goldberg never forgot where she came from, hosting many tributes to other legendary entertainment figures. Her most recent movies include Rat Race (2001) and the quietly received Kingdom Come (2001). Goldberg contributes her voice to many cartoons, including The Pagemaster (1994) and Captain Planet and the Planeteers (1990), as Gaia, the voice of the earth. Alternating between big-budget movies, independent movies, tributes, documentaries, and even television movies (including Theodore Rex (1995)). Whoopi Goldberg is accredited as a truly unique and visible talent in Hollywood. Perhaps she will always be remembered as well for Comic Relief, playing an integral part in almost every benefit concert they had. Currently, Whoopi Goldberg is the center square in Hollywood Squares (1998) and frequently hosts the Academy Awards. She also is an author, with the book \"Book\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4ODgzNjQwOV5BMl5BanBnXkFtZTYwNzczNzc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000155","name":"Whoopi Goldberg","nicknames":["Da Whoop","Shuttlehead"],"idIMDB":"nm0000155"},"actorId":"nm0000155","character":"Bernadette Thompson","urlCharacter":"http://www.imdb.com/character/ch0056815","main":true},{"actorName":"Minae Noji","urlProfile":"http://www.imdb.com/name/nm0634176","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MzcwMDIyMV5BMl5BanBnXkFtZTgwMzIyMDA0MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1973","placeOfBirth":" Los Angeles, California, USA","birthName":"Minae Cattleya Noji","bio":"Minae Noji was born on May 30, 1973 in Los Angeles, California, USA as Minae Cattleya Noji. She is known for her work on Kubo and the Two Strings (2016), Teenage Mutant Ninja Turtles (2014) and General Hospital (1963).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MzcwMDIyMV5BMl5BanBnXkFtZTgwMzIyMDA0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0634176","name":"Minae Noji","idIMDB":"nm0634176"},"actorId":"nm0634176","character":"Karai","urlCharacter":"http://www.imdb.com/character/ch0000518","main":true},{"actorName":"Abby Elliott","urlProfile":"http://www.imdb.com/name/nm2212031","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA5NjEyOTMwOF5BMl5BanBnXkFtZTcwNjEzMjYzNA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1987","placeOfBirth":" New York City, New York, USA","birthName":"Abigail Elliott","height":"5' 7½\" (1.71 m)","bio":"Abby Elliott is the first second-generation cast member on Saturday Night Live (1975). Her father is Chris Elliott, who was featured on the show during the 1994-1995 season. She is also the granddaughter of veteran comic Bob Elliott, from the \"Bob and Ray Show\". Before coming to \"Saturday Night Live\", Elliot worked with current SNL cast member Michaela Watkins at LA's Groundling's Theater. Since her arrival on SNL, she has skillfully portrayed Angelina Jolie, Chloë Sevigny and Joan Cusack.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA5NjEyOTMwOF5BMl5BanBnXkFtZTcwNjEzMjYzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2212031","name":"Abby Elliott","idIMDB":"nm2212031"},"actorId":"nm2212031","character":"Taylor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Madison Mason","urlProfile":"http://www.imdb.com/name/nm0556831","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMTYyMTAxNl5BMl5BanBnXkFtZTgwODI5NTI5MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 April 1943","placeOfBirth":" Richmond, Virginia, USA","height":"6' 1\" (1.85 m)","bio":"Winner of the MovieGuide Award, Madison spent his teen years in Charlotte, North Carolina where he began his career in Community Theatre and Summer Stock. After graduating from the famous Bristol Old Vic Theatre School in Bristol England, he returned to the New York Broadway and Off Broadway stage and several seasons of Regional theatre at McCarter Theatre, Princeton; Trinity Square Theatre, Providence; and Front Street Theatre, Memphis before moving to Hollywood and starting his film and television career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMTYyMTAxNl5BMl5BanBnXkFtZTgwODI5NTI5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0556831","name":"Madison Mason","idIMDB":"nm0556831"},"actorId":"nm0556831","character":"Councilman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1291150","urlIMDB":"http://www.imdb.com/title/tt1291150","business":{"budget":{"money":"$125,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$65,575,105","country":"USA","day":"03","month":"02","year":"2015","remarks":"3,845 Screens"},{"money":"HUF 38,363,862","country":"Hungary","day":"31","month":"08","year":"2014","remarks":""},{"money":"PHP 60,937,158","country":"Philippines","day":"17","month":"08","year":"2014","remarks":"167 Screens"}],"gross":[{"money":"$191,204,754","country":"USA","day":"27","month":"11","year":"2014","remarks":""},{"money":"$187,182,309","country":"USA","day":"28","month":"09","year":"2014","remarks":""},{"money":"$162,406,000","country":"USA","day":"31","month":"08","year":"2014","remarks":""},{"money":"$65,000,000","country":"USA","day":"10","month":"08","year":"2014","remarks":""},{"money":"$477,204,754","country":"Worldwide","day":"27","month":"11","year":"2014","remarks":""},{"money":"$485,004,754","country":"worldwide","day":"05","month":"03","year":"2015","remarks":""},{"money":"$293,800,000","country":"Non-USA","day":"05","month":"03","year":"2015","remarks":""},{"money":"PHP 133,828,478","country":"Philippines","day":"21","month":"09","year":"2014","remarks":""},{"money":"PHP 129,446,203","country":"Philippines","day":"14","month":"09","year":"2014","remarks":""},{"money":"PHP 104,061,954","country":"Philippines","day":"24","month":"08","year":"2014","remarks":""},{"money":"PHP 60,937,158","country":"Philippines","day":"17","month":"08","year":"2014","remarks":""},{"money":"$434,692","country":"Portugal","day":"27","month":"11","year":"2014","remarks":""}],"weekendGross":[{"money":"$1,450,177","country":"USA","day":"28","month":"09","year":"2014","remarks":"1,585 Screens"},{"money":"$11,750,000","country":"USA","day":"31","month":"08","year":"2014","remarks":"3,543 Screens"},{"money":"$65,000,000","country":"USA","day":"10","month":"08","year":"2014","remarks":"3,845 Screens"},{"money":"PHP 365,067","country":"Philippines","day":"21","month":"09","year":"2014","remarks":"6 Screens"},{"money":"PHP 1,434,348","country":"Philippines","day":"14","month":"09","year":"2014","remarks":"17 Screens"},{"money":"PHP 33,701,871","country":"Philippines","day":"24","month":"08","year":"2014","remarks":"105 Screens"},{"money":"PHP 60,937,158","country":"Philippines","day":"17","month":"08","year":"2014","remarks":"167 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 41 min (101 min)"],"soundMix":["Datasat","Dolby Digital","Dolby Atmos"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa Plus 4:3, Panavision C-, E-, G-Series, ATZ and AWZ2 Lenses"],"laboratory":["Company 3, Los Angeles (CA), USA (digital intermediate)","FotoKem Laboratory, Burbank (CA), USA"],"filmLength":["2,775 m (5 reels)"],"negativeFormat":["Codex ARRIRAW (2.8K)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Panavision (anamorphic) (source format)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)","D-Cinema (also 3-D version)"]},"rating":"5.9","metascore":"31","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"PG-13","awards":[{"award":"Golden Schmoes Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Worst Movie of the Year","names":[]}]}]},{"award":"International 3D & Advanced Imaging Society's Creative Arts Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Creative Arts Award","categories":[{"category":"3D Feature - Live Action","names":[]},{"category":"Outstanding Use of 2D to 3D Conversion","names":[]}]}]},{"award":"Kids' Choice Awards, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Blimp Award","categories":[{"category":"Favorite Movie","names":[{"name":"Paramount Pictures","id":null,"role":null},{"name":"Nickelodeon Movies","id":null,"role":null}]},{"category":"Favorite Movie Actor","names":[{"name":"Will Arnett","id":"nm0004715","role":null},{"name":"The Lego Movie","id":"tt1490017","role":null}]},{"category":"Favorite Movie Actress","names":[{"name":"Megan Fox","id":"nm1083271","role":null}]}]}]},{"award":"Razzie Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won Razzie Award","categories":[{"category":"Worst Supporting Actress","names":[{"name":"Megan Fox","id":"nm1083271","role":null}]}]},{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Picture","names":[]},{"category":"Worst Director","names":[{"name":"Jonathan Liebesman","id":"nm0509448","role":null}]},{"category":"Worst Screenplay","names":[{"name":"Evan Daugherty","id":"nm2489193","role":null},{"name":"André Nemec","id":"nm0625858","role":null},{"name":"Josh Appelbaum","id":"nm0032227","role":null}]},{"category":"Worst Remake, Rip-Off or Sequel","names":[]}]}]}],"votes":"177,644","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"},{"idCompany":"co0004265","name":"Nickelodeon Movies"},{"idCompany":"co0071240","name":"Platinum Dunes"}],"keywords":{"keywords":["turtle","ninja","sewer","mutant","18 wheeler","news reporter","sai","nunchaku","teenage mutant ninja turtles","rescue","cameraman","new york city new york","evil businessman","father figure","avalanche","tail","van","elevator","tower","bandanna","tracking device","bag over head","training","cliffhanging","helicopter","fainting","rooftop","product placement","young version of character","camcorder","scar","blood","rocket","subway","hostage","electrocution","gadgetry","chase","car truck chase","snow","camera phone","cell phone","fired from the job","newsroom","investigative journalist","journalist","flatulence","manor house","super strength","exploding car","overturning car","flipping car","thrown from a car","body landing on a car","gadget","skateboard","animated sequence","dojo","mentor","female mercenary","urban setting","robot suit","dual wield","sword fight","pizza","rat","mutagen","cure","toxin","terrorist plot","terrorist group","terrorism","terrorist","rocket launcher","bo staff","corrupt businessman","conspiracy","collapsing building","chemical weapon","genetic engineering","animal testing","mutation","loss of job","singing in an elevator","singing in a car","talking animal","ninjitsu","martial arts","based on comic book","mutant animal","police","scene during end credits","2010s","reference to superman","reference to batman","vigilantism","vigilante group","vigilante","mecha","samurai","nunchucks","based on tv series","warrior","year 1999","idw comics","mirage comics","furry","anthropomorphic animal","teenager","adrenaline","electromagnet","fu manchu","final showdown","xbox 360 wireless controller","xbox 360 controller","xbox 360","leather pants","megalomaniac","secret tunnel","warehouse","3 dimensional","3d","part computer animation","spear","impalement","lens flare","orphan","knocked out","comic relief","night vision goggles","attack","power outage","race against time","hologram","knocked out with a gun butt","deception","character's point of view camera shot","subjective camera","beating","jumping through a window","mountain","falling from height","heavy rain","laptop","google","press conference","media coverage","1990s","microscope","fundraiser","swat team","kidnapping","newspaper clipping","held at gunpoint","shipping container","news report","internet","transformation","slapstick comedy","giant","timebomb","explosion","armored car","car accident","car crash","hit by a car","docks","long take","night vision binoculars","surveillance","computer hacker","computer cracker","parkour","times square manhattan new york city","chrysler building manhattan new york city","statue of liberty new york city","brooklyn new york city","flashback","teacher student relationship","flashlight","face paint","militia","mercenary","army","slow motion scene","subtitled scene","showdown","violence","punched in the face","punched in the chest","kicked in the face","battle","brawl","fight","fistfight","hand to hand combat","anthropomorphism","antidote","fire","fear","machine gun","pistol","dagger","sword","stabbed in the chest","stabbed in the back","biological weapon","ceo","scientist","laboratory","blockbuster","reboot of series","female reporter","rapping in a car","remake","ninja turtle","friend","animal that acts human","surprise ending","blood transfusion","virus","surprise during end credits","tough guy","action hero","reference to x men","vigilante justice","wisecrack humor","superhero team","good versus evil","no opening credits","mixed martial arts","stylized violence","based on cartoon","hero","based on comic","superhero","re boot","animal in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:21:24"}}