{"data":{"movies":[{"title":"Dead Space: Downfall","originalTitle":"","year":"2008","releaseDate":"20081028","directors":[{"name":"Chuck Patton","id":"nm0666548"}],"writers":[{"name":"Jimmy Palmiotti","id":"nm0658609"},{"name":"Justin Gray","id":"nm2917216"}],"runtime":"74 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjNiMmU2YmUtMGMzYy00ODc1LTk2ZmEtZjc3ZDZjMDAxOWZmXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Horror","Sci-Fi","Thriller"],"plot":"The USG Ishimura, a miner spaceship, is transporting a strange artifact called the Red Marker. In the Aegis VII colony, where the Red Marker was found, there are some suicides and murders and the people are slowly going mad. The people are being infected by something. Barrow, the foreman, finds the body of his wife having committed suicide. Barrow decides to escape the colony's madness and, taking his wife's body, goes on board the Ishimura. But something happens to Barrow's wife on board the Ishimura.","simplePlot":"A prequel to the hit video game chronicling the discovery of the Red Marker and the first Necromorph outbreak.","actors":[{"actorName":"Nika Futterman","urlProfile":"http://www.imdb.com/name/nm0296546","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MzExODMzMl5BMl5BanBnXkFtZTcwNDY4OTY0OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1969","placeOfBirth":" New York, USA","bio":"Nika Futterman has been involved in world of acting and singing since early childhood when she performed in plays, musicals and student films. She spent a few years as an on-camera actress doing television, co-starring in such shows as Chicago Hope and Murphy Brown. Most recently, however, she has devoted her time exclusively to voice overs and has brought life to characters in cartoons such as Cat Dog, Hey Arnold, Mike, Lu and Og, Xyber 9, Piggley Winks, Chalk Zone, Kim Possible and video games such as The Matrix, Alter Echo, XMen, and Crimson Skies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MzExODMzMl5BMl5BanBnXkFtZTcwNDY4OTY0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0296546","name":"Nika Futterman","idIMDB":"nm0296546"},"actorId":"nm0296546","character":"Alissa Vincent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Keith Szarabajka","urlProfile":"http://www.imdb.com/name/nm0843775","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDk4NzQzMDQ2N15BMl5BanBnXkFtZTcwNDc1NTA4Mg@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 December 1952","placeOfBirth":" Oak Park, Illinois, USA","height":"5' 8\" (1.73 m)","bio":"Keith Szarabajka was born on December 2, 1952 in Oak Park, Illinois, USA. He is an actor and writer, known for The Dark Knight (2008), Argo (2012) and A Perfect World (1993). He was previously married to Jennifer Jay Stewart.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDk4NzQzMDQ2N15BMl5BanBnXkFtZTcwNDc1NTA4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0843775","name":"Keith Szarabajka","idIMDB":"nm0843775"},"actorId":"nm0843775","character":"Dr. Kyne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Cummings","urlProfile":"http://www.imdb.com/name/nm0191906","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1Mzk5OTc4NV5BMl5BanBnXkFtZTcwOTE3NjUxNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1952","placeOfBirth":" Youngstown, Ohio, USA","birthName":"James Jonah Cummings","height":"5' 8\" (1.73 m)","bio":"Born James Jonah Cummings on November 3, 1952, he grew up in Youngstown, Ohio. Sooner or later, he moved to New Orleans. There, he designed Mardi Gras floats, was a singer, door-to-door salesman, and a Louisiana riverboat deckhand. Then Cummings moved to Anaheim, California, where he started his career playing Lionel from the program Dumbo's Circus (1985).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1Mzk5OTc4NV5BMl5BanBnXkFtZTcwOTE3NjUxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0191906","name":"Jim Cummings","idIMDB":"nm0191906"},"actorId":"nm0191906","character":"Captain Mathius / Farum","urlCharacter":"http://www.imdb.com/character/ch0123866","main":true},{"actorName":"Kevin Michael Richardson","urlProfile":"http://www.imdb.com/name/nm0724656","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0OTg2NDQyOV5BMl5BanBnXkFtZTcwMTAwNjkzMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1964","placeOfBirth":" Bronx, New York City, New York, USA","height":"6' (1.83 m)","bio":"Well-known, king-sized actor and voice artist Kevin Michael Richardson was born in Bronx, New York. He is, perhaps, mostly recognizable for his deep voice, which he uses in many of his works. Richardson is a classically trained actor. He first gained recognition as one of only eight U.S. high school students selected for the National Foundation for the Arts' \"Arts '82\" program, later he earned a scholarship to Syracuse University. Kevin is well-known by various voice works, mostly villainous. He lent his voice to based-upon video game film Mortal Kombat (1995) as Goro, he was also in Matrix Revolutions (2003) as Deus Ex Machina, and made a brief appearance in Clerks II (2006) as a police officer. To mention that he did a brief additional voices for mega hit Transformers: Revenge of the Fallen (2009). He did voice in many animated films and TV series, such as \"The Mask - The Animated Series\" (1995), \"The New Batman Adventures\" (1997), \"Pokemon\" (1998), \"Powerpuff Girls\" (1998), \"Voltron: The Third Dimension\" (1998), \"Family Guy\", Lilo & Stitch (2002), as well as \"Lilo & Stitch\" TV series, \"Codename Kids Next Door\" (2002), Batman VS Dracula (2005) (V), where he voiced Joker, \"Mummy The Animated Series\" (2003), TMNT (2007) as General Aguila, \"Transformers Animated\" (2007) as Omega Supreme and Batman: Gotham Knight (2008), as Lucius Fox. He also did voices in such video games as Halo 2 (Tartarus), Kingdom Hearts (Sebastian) and others. He lives in Los Angeles and likes to work in Manhattan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0OTg2NDQyOV5BMl5BanBnXkFtZTcwMTAwNjkzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0724656","name":"Kevin Michael Richardson","idIMDB":"nm0724656"},"actorId":"nm0724656","character":"Samuel Irons / Pendleton / Miner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kelly Hu","urlProfile":"http://www.imdb.com/name/nm0005026","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4ODQ5NDMzOV5BMl5BanBnXkFtZTcwMjEzODA3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1968","placeOfBirth":" Honolulu, Hawaii, USA","birthName":"Kelly Ann Hu","height":"5' 5\" (1.65 m)","bio":"On February 13th, 1968, a girl of Chinese, English, and Hawaiian ancestry was born in Honolulu, Hawaii. Her father, Herbert, was a salesman and her mother, Juanita, worked many odd jobs to help support the family. She has one older brother, Glenn. She is a former Miss Teen USA, and modeled in Japan and Italy for several months before deciding to relocate to L.A. and try her hand at show business. She got her break on TV's Growing Pains (1985) in 1987 and never looked back.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4ODQ5NDMzOV5BMl5BanBnXkFtZTcwMjEzODA3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005026","name":"Kelly Hu","idIMDB":"nm0005026"},"actorId":"nm0005026","character":"Shen","urlCharacter":"http://www.imdb.com/character/ch0140790","main":true},{"actorName":"Bruce Boxleitner","urlProfile":"http://www.imdb.com/name/nm0000310","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MTc5OTQ0M15BMl5BanBnXkFtZTcwMjY1Mjg4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1950","placeOfBirth":" Elgin, Illinois, USA","birthName":"Bruce William Boxleitner","height":"6' 2\" (1.88 m)","bio":"As one of Hollywood's leading men, Bruce Boxleitner has starred in a major motion picture franchise, numerous feature films, several popular television series, produced a major network film and TV series, performed on Broadway, and authored two science fiction novels. Boxleitner received his formal acting training on stage. A native mid-westerner, he is an alumnus of Chicago's prestigious Goodman Theatre. In 1972, he starred in the Broadway production of Status Quo Vadis with Ted Danson. He then relocated to Los Angeles and quickly landed a guest spot on the legendary TV series The Mary Tyler Moore Show as well as numerous guest roles on series, including Hawaii 5-0, Beretta, Police Woman, and Gunsmoke. Boxleitner's big break occurred when he was cast opposite James Arness in the pilot for the epic TV series How the West Was Won. He went on to star in the CBS series Bring 'em Back Alive; mini-series East of Eden; and TV movie The Last Convertible. In 1982, Boxleitner was cast as the title role in Disney's cult film TRON which garnered him science fiction fans worldwide. However, it was in Boxleitner's four-year run for CBS's 'Scarecrow and Mrs. King', starring opposite Kate Jackson, which endeared him to fans everywhere and made him a household name. In 1994, Boxleitner joined the cast of the popular TV series Babylon 5 as John Sheridan, President of the Interstellar Alliance, a war hero-turned-diplomat at the helm of Earth Alliance Space Station in the year 2259. The show aired for five seasons. Boxleitner most recently starred with Jeff Bridges in TRON: Legacy, the popular motion picture sequel to TRON. The cast includes Garrett Hedlund and Olivia Wilde. In addition, Boxleitner reprised his role in TRON: Uprising on Disney's XD TV network, his first animated TV series. The multi-talented cast includes Elijah Wood, Mandy Moore, Lance Henriksen, and Paul Reubens. The original TRON recently celebrated its 30th anniversary. Several motion pictures include Gods and Generals with Robert Duvall, Jeff Daniels, Stephen Lang and Mira Sorvino; The Babe with John Goodman and Kelly McGillis; Kuffs with Christian Slater; and The Baltimore Bullet with James Coburn. Numerous TV movie credits include The Secret with Kirk Douglas; Perfect Family with Jennifer O'Neal and Joanna Cassidy; Double Jeopardy with Rachel Ward, Sally Kirkland and Sela Ward; Passion Flower with Barbara Hershey and Nicol Williamson; and Hallmark Channel movies, 'Love's Resounding Courage' and 'Falling in Love with the Girl Next Door'; among many others. The veteran actor has appeared in numerous recurring roles on TV series including GCB and Heroes, and has guest-starred on NCIS and Chuck, among others. A skilled horseman, Boxleitner utilized his talents in numerous Western TV series and films including Kenny Rogers television movie series that aired on CBS and NBC, starring opposite Kenny Rogers; 'Gunsmoke V: One Man's Justice' with James Arness (Arness' final film); CBS' remake of Red River with Gregory Harrison, James Arness and Laura Johnson; 'Wyatt Earp: Return to Tombstone' with Hugh O'Brian; and Down the Long Hills, based on legendary western author Louis L'Amour's novel of the same name. Boxleitner was inducted into the Hall of Great Western Performers at the National Cowboy and Western Heritage Museum in Oklahoma City in April 2012 honoring him for his illustrious career in western films. He is a two-time recipient of the Wrangler Award. In 2013, Boxleitner co-starred with Andie MacDowell and Dylan Neal in Hallmark Channel's first-ever prime-time series, Debbie Macomber's Cedar Cove to rave reviews and an average of 2 million viewers. The #1 rated cable program was renewed for a third season and is scheduled to premiere in the summer of 2015. In 1999, Boxleitner authored \"Frontier Earth\" and in 2001, its sequel \"Frontier Earth: Searcher\", published by The Berkley Publishing Group. Bruce Boxleitner resides in Los Angeles with his wife, publicist Verena King, and has three sons: Sam, Lee and Michael.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MTc5OTQ0M15BMl5BanBnXkFtZTcwMjY1Mjg4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000310","name":"Bruce Boxleitner","idIMDB":"nm0000310"},"actorId":"nm0000310","character":"Colin Barrow","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lia Sargent","urlProfile":"http://www.imdb.com/name/nm0765126","urlPhoto":"","biography":{"dateOfBirth":"20 February 1957","placeOfBirth":" Los Angeles, California, USA","bio":"Lia Sargent was born on February 20, 1957 in Los Angeles, California, USA. She is an actress and writer, known for Perfect Blue (1997), Ghost in the Shell (1995) and Wolf's Rain (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0765126","name":"Lia Sargent","idIMDB":"nm0765126"},"actorId":"nm0765126","character":"Jen Barrow / Walla","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hal Sparks","urlProfile":"http://www.imdb.com/name/nm0005452","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwODE0NDIzOF5BMl5BanBnXkFtZTcwNzA2NzcxNQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1969","placeOfBirth":" Cincinnati, Ohio, USA","birthName":"Hal Harry Magee Sparks III","height":"5' 8\" (1.73 m)","bio":"Hal Sparks was born on September 25, 1969 in Cincinnati, Ohio, USA as Hal Harry Magee Sparks III. He is an actor and director, known for Spider-Man 2 (2004), Lab Rats (2012) and Queer as Folk (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwODE0NDIzOF5BMl5BanBnXkFtZTcwNzA2NzcxNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005452","name":"Hal Sparks","idIMDB":"nm0005452"},"actorId":"nm0005452","character":"Ramirez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeff Bennett","urlProfile":"http://www.imdb.com/name/nm0071818","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTQwMjU2Ml5BMl5BanBnXkFtZTcwNDQwMzgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1962","placeOfBirth":" Houston, Texas, USA","birthName":"Jeffrey Glenn Bennett","bio":"Jeff Bennett was born on October 2, 1962 in Houston, Texas, USA as Jeffrey Glenn Bennett. He is an actor, known for Johnny Bravo (1997), James Bond Jr. (1991) and Enchanted (2007). He has been married to Susan E. Welby since October 8, 1988. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTQwMjU2Ml5BMl5BanBnXkFtZTcwNDQwMzgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0071818","name":"Jeff Bennett","idIMDB":"nm0071818"},"actorId":"nm0071818","character":"Leggio / Dobbs / Jackson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Piddock","urlProfile":"http://www.imdb.com/name/nm0682063","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk3MTA0ODIxNl5BMl5BanBnXkFtZTcwMTIxNjM4OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1956","placeOfBirth":" Rochester, Kent, England, UK","birthName":"James Anthony Piddock","height":"5' 10\" (1.78 m)","bio":"Jim Piddock is an actor, writer, and producer, who co-wrote, produced, and co-stars in the current Netflix original film \"Mascots\". He also co-created and co-starred in the 2013 HBO and BBC 2 series Family Tree with Christopher Guest. He was born in Rochester, Kent, England, to Celia Mary (O'Callaghan) and Charles Frederick Piddock. He began his career on the stage in England, before emigrating to the U.S. in his early twenties. He was educated at Worth Abbey, a Benedictine boarding school, in the south of England. He gained an Honors degree in English literature at London University. He made his theatrical debut in the U.S. in The Boy's Own Story, a one-man show about a soccer goalkeeper, at the Julian Theatre in San Francisco. The show was an instant success with critics and audiences, winning Piddock the Bay Area Critics' Best Actor Award. The show was then produced Off-Broadway and he quickly gained the attention of the New York theatre scene. That same year (1982), he was cast in Noel Coward's Present Laughter by George C. Scott, who directed/starred in the revival, which also featured Nathan Lane, Christine Lahti, Dana Ivey, and Kate Burton. The show was a big hit on Broadway and Piddock soon found himself appearing in a string of Broadway and Off-Broadway shows, including the original US production of Noises Off, The Knack at the Roundabout Theatre, and Make and Break with Peter Falk at the Kennedy Center. After replacing Frank Langella in Design For Living at the Circle-In-The-Square theatre, he moved to Los Angeles and has since appeared in a long succession of tv shows, such as The Tracey Ullman Show, Coach, Max Headroom, The Twilight Zone, Murder She Wrote, Mad About You, Angel, ER, Friends, Crossing Jordan, The Drew Carey Show, Lost, Monk, Without A Trace, Dollhouse, Chuck, Law And Order:LA, Castle, Party Down, Two and a Half Men, Up All Night, Touch, and Children's Hospital. He has also starred in several notable tv movies and mini-series, like From The Earth To The Moon, A Mom For Christmas, She Creature on HBO, and The Women Of Windsor. He appeared in his first movie in the top-grossing film of 1989, Lethal Weapon 2, in which one of his lines, \"But...you're black\" in answer to Danny Glover's request to emigrate to South Africa, became a catchphrase for the film. Other feature film roles soon followed, including notable appearances in Independence Day, Traces Of Red, Multiplicity, Burn Hollywood Burn, Austin Powers 3, A Different Loyalty, Love For Rent, See This Movie, The Prestige, Epic Movie, Who's Your Caddy?, The Seeker: The Dark Is Rising, Meet The Spartans, Falling Up, You Will Meet A Tall Dark Stranger, Get Him To The Greek, The Cold Light Of Day, and The Five Year Engagement. But it is probably his memorable performances in the improvised Christopher Guest comedies Best In Show (as the Dog Show commentator with Fred Willard), A Mighty Wind, and For Your Consideration that he has gained the most attention as an impeccable, chameleon character actor, who is barely recognizable from role to role. In November, 2007, Jim's reputation as one of the UK's most notable exports was cemented at the Ricardo Montalban Theatre in Hollywood, when he co-starred with Billy Connolly, Tim Curry, Eric Idle, Eddie Izzard, Jane Leeves, Emily Mortimer, and Tracey Ullman in What About Dick?. The show was revived in April, 2012, at the Orpheum Theatre with the addition of Russell Brand and Sophie Winkleman, for a limited-run and was also filmed for a DVD release. Jim also starred on Broadway and in L.A. in 2009 in An Evening Without Monty Python, a limited-run celebration of the 40th anniversary of Monty Python's Flying Circus, directed by Eric Idle. As a voice actor, he is most notable for providing the voice of Major Zero in the English version of the video game Metal Gear Solid 3: Snake Eater, Bolero the Bull in the movie Garfield 2, and the fictional artistic director of Forever Young Films, Kenneth Loring, doing the hilarious commentary in the directors' cut of the Coen Brothers' Blood Simple. In 1990, he also began another career as a screenplay writer, selling his first spec script, co-written with Margaret Oberman, for a mid six-figure sum. Since then, he has pursued multiple careers as an actor, writer, and producer, having had a diverse collection of films made, crossing all genres, such as Traces Of Red (Samuel Goldwyn Company), One Good Turn, A Different Loyalty (starring Rupert Everett and Sharon Stone), New Line's The Man (starring Samuel Jackson and Eugene Levy), and The Tooth Fairy (which he also executive produced) for Fox, starring Dwayne Johnson, Ashley Judd, Billy Crystal, Steven Merchant, and Julie Andrews. He also created, wrote and produced the BBC series Too Much Sun, starring Mark Addy, Alex Jennings, and Lee Majors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk3MTA0ODIxNl5BMl5BanBnXkFtZTcwMTIxNjM4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0682063","name":"Jim Piddock","idIMDB":"nm0682063"},"actorId":"nm0682063","character":"Chic","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Phil Morris","urlProfile":"http://www.imdb.com/name/nm0606862","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjYyMTkyY2EtMTk4Yi00MWFjLWI5MGYtNTUzODg5NWMyZGVhXkEyXkFqcGdeQXVyNTI4MjQ0OQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1959","placeOfBirth":" Iowa City, Iowa, USA","birthName":"Phillip Morris","height":"6' 1\" (1.85 m)","bio":"Phil Morris was born on April 4, 1959 in Iowa City, Iowa, USA as Phillip Morris. He is an actor and writer, known for Atlantis: The Lost Empire (2001), Star Trek III: The Search for Spock (1984) and Meet the Spartans (2008). He has been married to Carla Gittelson since September 24, 1983. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjYyMTkyY2EtMTk4Yi00MWFjLWI5MGYtNTUzODg5NWMyZGVhXkEyXkFqcGdeQXVyNTI4MjQ0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0606862","name":"Phil Morris","idIMDB":"nm0606862"},"actorId":"nm0606862","character":"Hansen / Glenn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Grey DeLisle","urlProfile":"http://www.imdb.com/name/nm0217221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg2MTQxOTUyMl5BMl5BanBnXkFtZTcwMTgxNTExOA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1973","placeOfBirth":" Fort Ord, California, USA","birthName":"Erin Grey Van Oosbree","height":"5' 3\" (1.6 m)","bio":"Grey DeLisle was born in Fort Ord, California. She is a singer and well-known voice actress. She was raised by her grandmother through her difficult childhood because her mother was a drug addict. Her grandmother was a singer and performed often with Tito Puente. Grey was highly interested in goth bands, mostly The Cure. Her mother, however, born-again Pentecostal, strictly forbade Grey to listen to goth music. In her late teens, she sang gospel songs. Thanks to that, she became interested in stand-up comedy and started to perform it. She also had a talent for voice impressions, which led to voice acting. DeLisle started in a few animation series and, since then, has been featured in numerous video games. She is best-known for her sinister voice of the evil sister \"Vicky\" in the Nickelodeon TV series, \"Fairly OddParents\" (2001-2013), as well as the equally evil \"Mandy\" in the Cartoon Network TV show, \"The Grim Adventures of Billy and Mandy\" (2001 - 2007). She voiced evil, cold \"Mandy\" again in two more films about Billy and Mandy, \"Billy and Mandy Big Boogie Adventure\" (2007) and \"The Grim Adventures of KND\" (2007), opposite'Richard Steven Horvitz' (Billy) and Greg Eagles (Grim). In 2002, Grey DeLisle married musician Murry Hammond, the bassist for the band, Old 97's. Their first child, Jefferson Texas Hammond, was born in 2007, in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg2MTQxOTUyMl5BMl5BanBnXkFtZTcwMTgxNTExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0217221","name":"Grey DeLisle","idIMDB":"nm0217221"},"actorId":"nm0217221","character":"Heather / Donna Fawkes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maurice LaMarche","urlProfile":"http://www.imdb.com/name/nm0005606","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NDQ5MTA4MF5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1958","placeOfBirth":" Toronto, Ontario, Canada","height":"6' (1.83 m)","bio":"Maurice LaMarche was born on March 30, 1958 in Toronto, Ontario, Canada. He is an actor, known for Futurama (1999), Pinky and the Brain (1995) and Zootopia (2016). He has been married to Robin Eisenman since May 19, 1991. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NDQ5MTA4MF5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005606","name":"Maurice LaMarche","nicknames":["Moe"],"idIMDB":"nm0005606"},"actorId":"nm0005606","character":"White / Bavaro","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bob Neill","urlProfile":"http://www.imdb.com/name/nm0624727","urlPhoto":"","biography":{"bio":"Bob Neill is known for his work on Memento (2000), TRON (1982) and Red Planet (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0624727","name":"Bob Neill","idIMDB":"nm0624727"},"actorId":"nm0624727","character":"Cartusian / Walla","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Zyler","urlProfile":"http://www.imdb.com/name/nm0469487","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTUwMzMzMjYyMl5BMl5BanBnXkFtZTcwNTg4MzUzMQ@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"bio":"David Zyler is known for his work on Deadpool (2016), X-Men: Days of Future Past (2014) and The Wolverine (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTUwMzMzMjYyMl5BMl5BanBnXkFtZTcwNTg4MzUzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0469487","name":"David Zyler","idIMDB":"nm0469487"},"actorId":"nm0469487","character":"Walla","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1267379","urlIMDB":"http://www.imdb.com/title/tt1267379","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 14 min (74 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"6.3","filmingLocations":[],"rated":"NOT RATED","awards":[],"votes":"8,571","type":"Video","companyCreditsSimple":[{"idCompany":"co0055491","name":"Electronic Arts (EA)"},{"idCompany":"co0042369","name":"Film Roman Productions"}],"keywords":{"keywords":["colony","madness","alien","trapped in space","26th century","based on video game","wipeout","vacuum","survival","outer space","severed leg","laser cutter","infection","violence","fanatic","head chopped off","bowels","blood splatter","asteroid","alien monster","split in two","spacecraft","severed arm","corpse","body torn apart","blood"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:31:09"}}