{"data":{"movies":[{"title":"Hercules","originalTitle":"","year":"2014","releaseDate":"20140725","directors":[{"name":"Brett Ratner","id":"nm0711840"}],"writers":[{"name":"Ryan Condal","id":"nm2952284"},{"name":"Evan Spiliotopoulos","id":"nm0818746"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4ODA5MTA4OF5BMl5BanBnXkFtZTgwNjMyODM5MTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure"],"plot":"Fourteen hundred years BCE, a tormented soul walked the earth that was neither man nor god. Hercules was the powerful son of the god king Zeus, for this he received nothing but suffering his entire life. After twelve arduous labours and the loss of his family, this dark, world-weary soul turned his back on the gods finding his only solace in bloody battle. Over the years he warmed to the company of six similar souls, their only bond being their love of fighting and presence of death. These men and women never question where they go to fight or why or whom, just how much they will be paid. Now the King of Thrace has hired these mercenaries to train his men to become the greatest army of all time. It is time for this bunch of lost souls to finally have their eyes opened to how far they have fallen when they must train an army to become as ruthless and blood thirsty as their reputation has become.","simplePlot":"Having endured his legendary twelve labors, Hercules, the Greek demigod, has his life as a sword-for-hire tested when the King of Thrace and his daughter seek his aid in defeating a tyrannical warlord.","actors":[{"actorName":"Dwayne Johnson","urlProfile":"http://www.imdb.com/name/nm0425005","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNDQ3NzAxM15BMl5BanBnXkFtZTgwODIwMTQ0NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 May 1972","placeOfBirth":" Hayward, California, USA","birthName":"Dwayne Douglas Johnson","height":"6' 5¼\" (1.96 m)","bio":"Dwayne Douglas Johnson, also known as The Rock, was born on May 2, 1972 in Hayward, California, to Ata Johnson (born Feagaimaleata Fitisemanu Maivia) and Canadian-born professional wrestler Rocky Johnson (born Wayde Douglas Bowles). His father is black (of Black Nova Scotian descent), and his mother is of Samoan background (her own father was Peter Fanene Maivia, also a professional wrestler). While growing up, Dwayne traveled around a lot with his parents and watched his father perform in the ring. During his high school years, Dwayne began playing football and he soon received a full scholarship from the University of Miami where he had tremendous success as a football player. In 1995, Dwayne suffered a back injury which cost him a place in the NFL. He then signed a 3 year deal with the Canadian League but left after a year to pursue a career in wrestling. He made his wrestling debut in the USWA under the name Flex Kavanah where he won the tag team championship with Brett Sawyer. In 1996, Dwayne joined the WWE and became Rocky Maivia where he joined a group known as \"The Nation of Domination\" and turned heel. Rocky eventually took over leadership of the \"Nation\" and began taking the persona of The Rock. After the \"Nation\" split, The Rock joined another elite group of wrestlers known as the \"Corporation\" and began a memorable feud with Steve Austin. Soon the Rock was kicked out of the \"Corporation\". He turned face and became known as \"The Peoples Champion\". In 2000, the Rock took time off from WWE to film his appearance in The Mummy Returns (2001). He returned in 2001 during the WCW/ECW invasion where he joined a team of WWE wrestlers at The Scorpion King (2002), a prequel to The Mummy Returns (2001). Dwayne has a daughter, Simone Alexandra, born in 2001, with his ex-wife Dany Garcia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNDQ3NzAxM15BMl5BanBnXkFtZTgwODIwMTQ0NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0425005","name":"Dwayne Johnson","nicknames":["The People's Champion","The Brahma Bull","The Great One","The Rock","Dewey"],"idIMDB":"nm0425005"},"actorId":"nm0425005","character":"Hercules","urlCharacter":"http://www.imdb.com/character/ch0000545","main":true},{"actorName":"Ian McShane","urlProfile":"http://www.imdb.com/name/nm0574534","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGUzYmJiMmQtNTRlNC00ZWEwLTgzY2ItZDMwZTdkMGE4Zjc0L2ltYWdlXkEyXkFqcGdeQXVyNzE0OTI2MzY@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1942","placeOfBirth":" Blackburn, Lancashire, England, UK","height":"5' 7½\" (1.71 m)","bio":"From a lawless, foul-mouthed saloon owner in \"Deadwood\" to a tough no-nonsense British gangster in \"Sexy Beast,\" Ian McShane has virtually cornered the market on playing rogues, villains and all-around bad asses. A natural at portraying complex anti-heroes and charismatic heavies, the classically trained actor was born in Blackburn, Lancashire, England, to parents Irene (Cowley) and Harry McShane, a soccer player for Manchester United. McShane caught his first break in 1962 when he landed a lead role in \"The Wild and the Willing.\" McShane later revealed that he had ditched class at the Royal Academy of Dramatic Art to audition for the role. Since then, the award-winning actor has gone on to grab the attention of audiences and critics alike with his unforgettable portrayals of scoundrels, kings, killers, and thieves. Coming soon, McShane will be reprising his role as club owner/ex-assassin Winston opposite Keanu Reeves in \"John Wick: Chapter 2\" in the film by director Chad Stahelski. He plays Leland, a retired sheriff with violent tendencies, opposite Patrick Wilson in \"The Hollow Point,\" the gritty drama directed by Gonzalo López-Gallego. Also, expect to see McShane in the upcoming films \"Jawbone,\" \"Bolden!\" and opposite Michael Shannon in \"Pottersville.\" On television, McShane next stars as Mr. Wednesday in Neil Gaiman's \"American Gods,\" the highly-anticipated event series for Starz produced by Michael Green and Bryan Fuller. \"Actor. Icon. And now god. It is a goddamn delight to be collaborating with the incomparable Ian McShane,\" said Michael Green recently. McShane previously starred in the Michael Green series \"Kings\" for NBC. McShane will also be seen opposite Dr. Dre for Apple TV's first scripted series \"Vital Signs,\" a semi-autobiographical series loosely based on the hip-hop icon's life. McShane's formidable acting resume is as long as it is varied. McShane starred as the notoriously fearsome pirate Blackbeard opposite Johnny Depp in Disney's worldwide blockbuster hit \"Pirates of the Caribbean: On Stranger Tides.\" He starred as priest/prophet/warrior Amphiarus opposite Dwayne Johnson in MGM's \"Hercules,\" played lead dwarf Beith in the dark fantasy flick \"Snow White and the Huntsman,\" and portrayed good King Bramwell in Bryan Singer's modern-day fairytale \"Jack the Giant Slayer.\" McShane also appeared as Joe Strombel in Woody Allen's \"Scoop.\" His universally praised performance as tough guy Teddy Bass in the cult indie hit \"Sexy Beast\" led one London critic to dub McShane as \"The King of Cool.\" In a change of pace, he portrayed soft-spoken Meredith in the darkly perverse crime drama \"44 Inch Chest,\" a film in which McShane not only starred, but also produced. McShane has also had a long and diverse career on both British and American television. Earning considerable critical acclaim as the fierce yet charismatic Al Swearengen in the much-loved David Milch HBO series \"Deadwood,\" McShane went on to win the Golden Globe Award for Best Performance by an Actor in a Drama Series. His compelling and gritty portrayal also scored him nominations for both Emmy and SAG Awards. He went on to collect yet another Golden Globe nomination for Best Actor in a Miniseries for his riveting portrayal of the scheming, corrupt Waleran Bigod in Starz' Emmy-nominated \"Pillars of the Earth.\" McShane also won over viewers in FX's \"American Horror Story\" as the very bad Santa/serial killer Leigh Emerson and as cold-blooded billionaire Andrew Finney opposite Liev Schreiber in Showtime's acclaimed series \"Ray Donovan.\" More recently, he portrayed Sir Roger Scatcherd in the Julian Fellows' miniseries \"Dr. Thorne\" for ITV and also made an appearance as peacenik Brother Ray in HBO's juggernaut \"Game of Thrones.\" Earlier in his television career McShane produced and starred as the irresistible rogue antiques dealer in the acclaimed series \"Lovejoy\" for the BBC and A&E, even directing several episodes himself. The show was one of the first independent co-productions with the BBC and aired in both the U.S. and U.K. Other notable portrayals on television have included his appearance in the landmark, blockbuster miniseries \"Roots\" and as Ken Harrison in \"Whose Life is it Anyway?\" McShane also played Sejanus in the miniseries \"A.D.,\" the eponymous \"Disraeli,\" produced by Masterpiece Theater, and Judas in NBC's \"Jesus of Nazareth.\" An accomplished, award-wining stage actor, McShane made his West End debut in \"The Promise,\" co-starring Dame Judi Dench and Sir Ian McKellen. The play went on to open on Broadway the following year. McShane also charmed audiences in the West End musical \"The Witches of Eastwick,\" originating the role of the seductive, sex-obsessed Darryl Van Horne on stage in London. At the esteemed L.A. Matrix Theatre, McShane appeared in Harold Pinter's \"Betrayal,\" Larry Atlas' \"Yield of the Long Bond\", as well as in John Osborne's \"Inadmissible Evidence,\" picking up a couple of Los Angeles Drama Critics' Awards for Lead Performance in the process. In addition, McShane appeared in the 40th Anniversary revival of Harold Pinter's \"The Homecoming\" on Broadway. With his low, distinctive voice, McShane has also made his mark in film and television as a voiceover artist. He narrated Disney's \"The Sorcerer's Apprentice,\" brought life to the eccentric magician Mr. Bobinsky in \"Coraline,\" and added a sinister edge to Tai Lung in \"Kung Fu Panda.\" McShane has also let his rich baritone to \"The Golden Compass,\" as well as to \"Shrek The Third\" as the notorious Captain Hook.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGUzYmJiMmQtNTRlNC00ZWEwLTgzY2ItZDMwZTdkMGE4Zjc0L2ltYWdlXkEyXkFqcGdeQXVyNzE0OTI2MzY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0574534","name":"Ian McShane","idIMDB":"nm0574534"},"actorId":"nm0574534","character":"Amphiaraus","urlCharacter":"http://www.imdb.com/character/ch0467803","main":true},{"actorName":"John Hurt","urlProfile":"http://www.imdb.com/name/nm0000457","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NTgyMTAyOV5BMl5BanBnXkFtZTcwMTE4MjQwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 January 1940","placeOfBirth":" Chesterfield, Derbyshire, England, UK","birthName":"John Vincent Hurt","height":"5' 9\" (1.75 m)","bio":"This transatlantic talent was born John Vincent Hurt on January 22, 1940 in Shirebrook, a coal mining village near the busy market town of Chesterfield, in Derbyshire, England. He is the son of Phyllis (Massey), an engineer and one-time actress, and Arnould Herbert Hurt, an Anglican clergyman and mathematician. The youngest of three children, he spent much of his childhood in solitude. Demonstrating little initiative, he was guided into art as a possible direction. The family moved to Grimsby when he turned twelve and, despite an active early passion in acting, his parents thought less of it and enrolled him at the Grimsby Art School and St. Martin's School of Art where he showed some flourish. When he couldn't manage to get another scholarship to art school, his focus invariably turned to acting. Accepted into the Royal Academy of Dramatic Art, John made his stage debut in 1962 and remained there in typically offbeat form such plays as \"Infanticide in the House of Fred Ginger\". An odd, somber, pasty-looking fellow with an aquiline nose (injured while playing sports) and a mass of Irish freckles, he was hardly leading man material. His earlier focus as a painter, however, triggered a keen skill in the art of observation and it certainly advanced his talent for getting into the skin of his characters. His movie debut occurred that same year with a supporting role in the ill-received British \"angry young man\" drama Young and Willing (1962). Appearing in various mediums, John increased his profile (and respect) appearing in such theatre plays as \"Inadmissible Evidence\" (1965), \"Little Malcolm and His Struggle Against the Eunuchs\" (1966), a role he later took to film as Little Malcolm and His Struggle Against the Eunuchs (1974), \"Macbeth\" (as Malcolm) (1967) and \"Man and Superman\" (1969), while finding prime parts in such films as A Man for All Seasons (1966), a role he was given after director Fred Zinnemann saw his stellar work in \"Little Malcolm.\" He continued on the stage as an unlikely Romeo in 1973, and went on to garner great applause in Pinter's \"The Caretaker\" and \"The Dumb Waiter\", as well as \"Travesties\" (1974). It was TV, however, that displayed the full magnitude and fearless range of his acting instrument. In the mid-70s he gained widespread acclaim for his embodiment of the tormented gay writer and raconteur Quentin Crisp in the landmark TV play The Naked Civil Servant (1975), adapted from Crisp's autobiography. Way, way ahead of its time, Hurt's bold and unabashed take on the flamboyant and controversial gent who dared to be different was rewarded with the Emmy and the British TV Awards. Far and away one of the most marvelous creations ever captured on the small screen, he was altogether unsettling, unappetizing and unforgettable. Audiences cringed but were mesmerized at the same time -- like a car wreck. He WAS Quentin Crisp. Doors immediately opened for John. He was handed the best parts film and TV had to offer. Once again he was strikingly disturbing as the cruel and crazed Roman emperor Caligula in the epic TV masterpiece I, Claudius (1976). The chameleon in him then displayed a polar side as the gentle, pathetically disfigured title role in The Elephant Man (1980), and when he morphed into the role of a tortured Turkish prison inmate who befriends Brad Davis in the intense drama Midnight Express (1978), he was barely recognizable. The last two films earned Hurt Oscar nominations. Mainstream box-office films were offered as well as art films. He made the most of his role as a crew member whose body becomes host to an unearthly predator in Alien (1979). Who can forget the film's most notorious scene as the creature explodes from Hurt's stomach and scurries away into the bowels of the spaceship? Along with fame, of course, came a few misguided ventures generally unworthy of his talent. Such brilliant work as his steeple chase jockey in Champions (1984) or kidnapper in The Hit (1984) was occasionally offset by such drivel as the comedy misfire Partners (1982) with 'Ryan O'Neal (I)' in which Hurt looked enervated and embarrassed. But those were very few and far between. As for the past couple of decades, the craggy-faced actor continues to draw extraordinary notices. Tops on the list includes his prurient governmental gadfly who triggers the Christine Keeler political sex scandal in the aptly-titled Scandal (1989); the cultivated gay writer aroused and obsessed with struggling \"pretty-boy\" actor Jason Priestley in Love and Death on Long Island (1997); and the Catholic priest embroiled in the Rwanda atrocities in Beyond the Gates (2005). His rich tones have also been tapped into frequently with a number of animated features and documentaries, often serving as narrator. Presently married to his fourth wife, genius is often accompanied by a darker, more self-destructive side and Hurt was no exception with alcohol being his choice of poison. He has since recovered. He has two children from his third wife.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NTgyMTAyOV5BMl5BanBnXkFtZTcwMTE4MjQwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000457","name":"John Hurt","idIMDB":"nm0000457"},"actorId":"nm0000457","character":"Lord Cotys","urlCharacter":"http://www.imdb.com/character/ch0467806","main":true},{"actorName":"Rufus Sewell","urlProfile":"http://www.imdb.com/name/nm0001722","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NDI2MzIwMF5BMl5BanBnXkFtZTcwNTIyNTY0Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1967","placeOfBirth":" Twickenham, Middlesex, England, UK","birthName":"Rufus Frederick Sewell","height":"6' (1.83 m)","bio":"Rufus Sewell was born on the 29th of October 1967 in Twickenham, England. His mother, Jo, was Welsh, and was an artist and painter. His father, Bill, was an Australian animator who died when Rufus was 10. He has one brother, Caspar. He attended London's Central School of Speech and Drama and left in June of 1989 after completing three years of training. He made his London Stage debut in \"Making It Better\" for which he won the \"Best Newcomer Award\"; he also originated the role of Septimus Hodge in Tom Stoppards \"Arcadia\" and was nominated for an Oliver Award. On the Broadway stage, he debuted in \"Translations\" and received the Broadway Theater World Award. His film work has been has been equally varied and acclaimed from the junkie in Twenty-One (1991), the sweet bus driver in A Man of No Importance (1994), and the volatile artist in Carrington (1995). The lustful son in Cold Comfort Farm (1995), the protagonist hounded Dostoevsky-like in Dark City (1998), the star-crossed suitor in Dangerous Beauty (1998), to the the bitter, acidic, alcoholic cokehead of The Very Thought of You (1998), he has appeared in some of the most acclaimed theatre, film and television productions.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NDI2MzIwMF5BMl5BanBnXkFtZTcwNTIyNTY0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001722","name":"Rufus Sewell","nicknames":["Roof"],"idIMDB":"nm0001722"},"actorId":"nm0001722","character":"Autolycus","urlCharacter":"http://www.imdb.com/character/ch0043148","main":true},{"actorName":"Aksel Hennie","urlProfile":"http://www.imdb.com/name/nm0377336","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ5MTI5NDUyNl5BMl5BanBnXkFtZTgwNzI1NDg5ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1975","placeOfBirth":" Oslo, Norway","height":"5' 9\" (1.75 m)","bio":"Aksel Hennie is a Norwegian actor, writer and director. He has acted in a number of successful Norwegian movies, and has received several awards. Hennie grew up in Lambertseter in Oslo. In his late teens he was sentenced for tagging, and became an outcast in the community for confessing to the police. This personal story contributed much of the background for the movie Uno. The conviction against Hennie was in fact one of the first such cases in Norway. Hennie was admitted to the Norwegian National Academy of Theatre after applying four times. He graduated in 2001, and has since acted both at Teatret in Molde from 2001 to 2002 and at Oslo Nye Teater from 2002 till now where he has been in plays such as Hamlet, and The woman who married a turkey. His main success, however, has been as a film actor. He made his debut starring in the feature film Jonny Vang in 2003. Though the director, Jens Lien, originally thought Hennie was too young for the role, the actor convinced him he was the right man for the film. The same year he also acted in the movies Buddy and Ulvesommer, and the next year he made his debut as a director and writer with the movie Uno, in which he also acted.[5] For this film Hennie, and his co-star Nicolai Cleve Broch, went into hard physical training for six months to perform convincingly as bodybuilders. He won the Amanda Award (the main Norwegian film award) for \"The Best Direction\" (for the movie Uno in 2005), and that same year he was also among the nominees for \"Best Actor\" and \"Best Film\". He also won an Amanda award as \"Best Actor\" for the movie Jonny Vang in 2003. He was named one of European films \"Shooting Stars\" by European Film Promotion in 2004. In 2001 he was also named \"Theatre talent of the year\" by the newspaper Dagbladet. In 2008 Hennie starred in the movie Max Manus, where he played the role of the Norwegian war hero by that name. The movie had a large budget by Norwegian standards, and was met with great expectations.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ5MTI5NDUyNl5BMl5BanBnXkFtZTgwNzI1NDg5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0377336","name":"Aksel Hennie","idIMDB":"nm0377336"},"actorId":"nm0377336","character":"Tydeus","urlCharacter":"http://www.imdb.com/character/ch0471092","main":true},{"actorName":"Ingrid Bolsø Berdal","urlProfile":"http://www.imdb.com/name/nm2070336","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NDc2MTY2MV5BMl5BanBnXkFtZTcwNzI0ODQ0OA@@._V1_UY44_CR22,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 March 1980","placeOfBirth":" Levanger, Norway","height":"5' 8½\" (1.74 m)","bio":"Ingrid Bolsø Berdal started studying music and singing in high school and after graduating she continued her music education at the University of Trondheim (NTNU), studying jazz singing and improvisation for two years. She moved to Oslo and was accepted at Oslo National Academy of Dramatic Arts (KHiO), where she studied acting for three years. In her second year of Drama School Ingrid played Sofia in \"Platonov\" (Chekhov) and Antigone in \"Antigone\" (Sophocles). In her final year she played The Girl in \"The Name\" (Jon Fosse) and Hedda in \"Hedda Gabler\" (Henrik Ibsen). Since graduating Ingrid Bolsø Berdal has been employed at The Norwegian Theatre in Oslo. After her first year at the theatre Ingrid was awarded the Hedda Award (The Norwegian Theatre Award) for Best Debut of The Year. During her years at the theatre she has played both classical and contemporary plays, such as Sasha in \"Ivanov\" (Checkhov), Shura in \"Black Milk\" (Sigarev) and Yvonne in \"Yvonne, Princess of Burgundy\" (Gombrowicz). In between her stage work Ingrid Bolsø Berdal has also been working with radio theatre, TV and film. She has won the Amanda Award (The Norwegian Film Award) for Best Actress - for Jannicke in the feature film Cold Prey (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NDc2MTY2MV5BMl5BanBnXkFtZTcwNzI0ODQ0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2070336","name":"Ingrid Bolsø Berdal","idIMDB":"nm2070336"},"actorId":"nm2070336","character":"Atalanta","urlCharacter":"http://www.imdb.com/character/ch0239523","main":true},{"actorName":"Reece Ritchie","urlProfile":"http://www.imdb.com/name/nm2201022","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzA2MjA4N15BMl5BanBnXkFtZTgwOTA1MzUxNjE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1986","placeOfBirth":" UK","bio":"Reece Ritchie was born on July 23, 1986 in the UK. He is an actor, known for Prince of Persia: The Sands of Time (2010), The Lovely Bones (2009) and Hercules (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzA2MjA4N15BMl5BanBnXkFtZTgwOTA1MzUxNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2201022","name":"Reece Ritchie","idIMDB":"nm2201022"},"actorId":"nm2201022","character":"Iolaus","urlCharacter":"http://www.imdb.com/character/ch0032479","main":true},{"actorName":"Joseph Fiennes","urlProfile":"http://www.imdb.com/name/nm0001212","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDQ3NTY2N15BMl5BanBnXkFtZTcwNjI4MDU4Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 May 1970","placeOfBirth":" Salisbury, Wiltshire, England, UK","birthName":"Joseph Alberic Twisleton-Wykeham-Fiennes","height":"6' (1.83 m)","bio":"Joseph Alberic Twisleton-Wykeham-Fiennes was born in Salisbury, Wiltshire, to Jennifer Anne Mary Alleyne (Lash), a novelist, and Mark Fiennes, a photographer. He is one of six children. Four of his siblings are also in the arts: Ralph Fiennes, an actor; Martha Fiennes, a director; Magnus Fiennes, a musician; and Sophie Fiennes, a producer. He is of English, Irish, and Scottish origin. He was brought up in West Cork, Ireland. He left art school, and began working with the Young Vic Youth Theatre, and then went on to train at the Guildhall School of Music and Drama. His first professional stage appearance was in the West End in The Woman In Black, followed by A Month In The Country. He joined the Royal Shakespeare Company for two seasons and performed roles in Dennis Potter's Son Of Man, Les Enfants Du Paradis, Troilus and Cressida, and Peter Whelan's The Herbal Bed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDQ3NTY2N15BMl5BanBnXkFtZTcwNjI4MDU4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001212","name":"Joseph Fiennes","nicknames":["Joe"],"idIMDB":"nm0001212"},"actorId":"nm0001212","character":"King Eurystheus","urlCharacter":"http://www.imdb.com/character/ch0042871","main":true},{"actorName":"Tobias Santelmann","urlProfile":"http://www.imdb.com/name/nm4083737","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMTQyMDE1N15BMl5BanBnXkFtZTgwMDgyNzg5MTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 August 1980","placeOfBirth":" Freiburg, Germany","height":"6' 2\" (1.88 m)","bio":"Tobias Santelmann is a Norwegian actor who was born in Freiburg, Germany. His family moved to Norway when he was one year old. He grew up in the far south of Norway (Lindesnes) and moved to Oslo when he was 16 years old. Tobias Santelmann graduated from The Oslo National Academy of Dramatic Arts (KHiO) in 2006. Since graduating he has been employed at The Norwegian Theatre in Oslo (Det Norske Teatret). During his years at the theatre he has played many different roles, such as Yang Sun in \"The Good Person of Szechwan\" (Brecht), K in \"The Castle\" (Kafka), Torvald Helmer in \"Nora\" (Ibsen) and Nick in \"The Woods\" (Mamet). In addition to his stage work, Tobias has in the past year starred in movies like Kon Tiki, Jag Etter Vind, Flukt and Jeg Er Din.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMTQyMDE1N15BMl5BanBnXkFtZTgwMDgyNzg5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4083737","name":"Tobias Santelmann","idIMDB":"nm4083737"},"actorId":"nm4083737","character":"Rhesus","urlCharacter":"http://www.imdb.com/character/ch0471093","main":true},{"actorName":"Peter Mullan","urlProfile":"http://www.imdb.com/name/nm0611932","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2NDUxMjIzNzVeQTJeQWpwZ15BbWU2MDU0MTk3NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 November 1959","placeOfBirth":" Peterhead, Scotland, UK","height":"5' 8\" (1.73 m)","bio":"He was interested in directing films at the age of 19 and he made several shorts. As he wasn't admitted to the National Film School, he decided to dedicate himself to acting, and made his debut in the theatre in 1988 before moving to cinema and television. Fame came with the parts he played in such films as Riff-Raff (1991) by Ken Loach, Braveheart (1995) by Mel Gibson and Trainspotting (1996) by Danny Boyle, but above all when he won for best leading actor at the Cannes Film Festival in 1998 for My Name Is Joe (1998), once again by Loach. The Magdalene Sisters (2002) is the second feature-length film he has directed. He also directed a few episodes of the BBC TV series, Cardiac Arrest (1994), which earned him a best director nomination from the Royal Television Society.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2NDUxMjIzNzVeQTJeQWpwZ15BbWU2MDU0MTk3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0611932","name":"Peter Mullan","idIMDB":"nm0611932"},"actorId":"nm0611932","character":"Sitacles","urlCharacter":"http://www.imdb.com/character/ch0467162","main":true},{"actorName":"Rebecca Ferguson","urlProfile":"http://www.imdb.com/name/nm0272581","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA4NDA1MTA5NV5BMl5BanBnXkFtZTcwNjMyNTQ3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 October 1983","placeOfBirth":" Sweden","birthName":"Rebecca Louisa Ferguson Sundström","height":"5' 7\" (1.7 m)","bio":"Rebecca Ferguson was born Rebecca Louisa Ferguson Sundström in Stockholm, Sweden, and grew up in its Vasastaden district. Her father is Swedish, and her mother, Rosemary, is British, and moved from England to Sweden at the age of 25. Rebecca attended an English-speaking school in Sweden and was raised bilingual, speaking Swedish and English. As a student, she attended the Adolf Fredrik's Music School in Stockholm and graduated in 1999. She came into prominence with her breakout role of upper-class girl Anna Gripenhielm in the soap-opera Nya tider (1999), when she was 16 years old. She lives in the seaside town of Simrishamn, on the Swedish south coast. Ferguson has said she wanted to get away from city life and the public spotlight following her soap opera success. Swedish director Richard Hobert, spotted her at the town market in 2011, which led to her starring in his film A One-Way Trip to Antibes (2011). Ferguson taught Argentinian Tango at a dance company in Sweden for a few years. In 2013, Rebecca played Queen Elizabeth Woodville in the BBC historical drama The White Queen (2013), for which she got a Golden Globe nomination. In 2015, Ferguson played Ilsa Faust, the female lead in Mission: Impossible - Rogue Nation (2015). Her co-star, Tom Cruise, chose her for the film after having seen her in the mini-series The White Queen (2013). Her performance in the movie was highly praised and Rebecca will reprise her role in the sixth Mission: Impossible film. In 2016, she starred in Despite the Falling Snow (2016), Florence Foster Jenkins (2016) and The Girl on the Train (2016). Her upcoming projects are Life (2017), The Snowman (2017), The Greatest Showman (2017), The Lady and the Panda (2017) and M:I 6 - Mission Impossible (2018).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA4NDA1MTA5NV5BMl5BanBnXkFtZTcwNjMyNTQ3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0272581","name":"Rebecca Ferguson","idIMDB":"nm0272581"},"actorId":"nm0272581","character":"Ergenia","urlCharacter":"http://www.imdb.com/character/ch0481800","main":true},{"actorName":"Isaac Andrews","urlProfile":"http://www.imdb.com/name/nm5036576","urlPhoto":"","biography":{"bio":"Isaac Andrews is an actor, known for Avengers: Age of Ultron (2015), Exodus: Gods and Kings (2014) and Hercules (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5036576","name":"Isaac Andrews","idIMDB":"nm5036576"},"actorId":"nm5036576","character":"Arius","urlCharacter":"http://www.imdb.com/character/ch0449585","main":true},{"actorName":"Joe Anderson","urlProfile":"http://www.imdb.com/name/nm1725848","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NTE4NjM3M15BMl5BanBnXkFtZTcwODk3NjgyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1982","placeOfBirth":" England, UK","height":"5' 11¼\" (1.81 m)","bio":"Joe Anderson was born on March 26, 1982 in England. He is an actor, known for Across the Universe (2007), The Grey (2011) and The Crazies (2010). He is married to Elle.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NTE4NjM3M15BMl5BanBnXkFtZTcwODk3NjgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1725848","name":"Joe Anderson","idIMDB":"nm1725848"},"actorId":"nm1725848","character":"Phineas","urlCharacter":"http://www.imdb.com/character/ch0391716","main":true},{"actorName":"Stephen Peacocke","urlProfile":"http://www.imdb.com/name/nm2913856","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNDYyNjc4OF5BMl5BanBnXkFtZTgwNjA2ODcxNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Stephen's an Australian actor known for Home and Away, Hercules: The Thracian Wars, Whisky Tango Foxtrot and Me Before You. He grew up in Dubbo in Central Western New South Wales, worked as a Jackaroo on a large scale sheep & cattle station west of Bourke and graduated from the University of Newcastle with a degree in Communications. His passion before acting was Rugby Union where he played at First Grade and Representative levels throughout his schooling, university and adult life.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNDYyNjc4OF5BMl5BanBnXkFtZTgwNjA2ODcxNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2913856","name":"Stephen Peacocke","nicknames":["Steve"],"idIMDB":"nm2913856"},"actorId":"nm2913856","character":"Stephanos","urlCharacter":"http://www.imdb.com/character/ch0464912","main":true},{"actorName":"Nicholas Moss","urlProfile":"http://www.imdb.com/name/nm0609049","urlPhoto":"","biography":{"bio":"Nicholas Moss is an actor and director, known for Hercules (2014), Mean Machine (2001) and Going Off Big Time (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0609049","name":"Nicholas Moss","idIMDB":"nm0609049"},"actorId":"nm0609049","character":"Demetrius","urlCharacter":"http://www.imdb.com/character/ch0464913","main":true}],"seasons":[],"idIMDB":"tt1267297","urlIMDB":"http://www.imdb.com/title/tt1267297","business":{"budget":{"money":"$100,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$29,000,000","country":"USA","day":"27","month":"07","year":"2014","remarks":"3,595 Screens"},{"money":"HUF 59,304,110","country":"Hungary","day":"27","month":"07","year":"2014","remarks":""}],"gross":[{"money":"$72,385,417","country":"USA","day":"28","month":"09","year":"2014","remarks":""},{"money":"$63,461,000","country":"USA","day":"10","month":"08","year":"2014","remarks":""},{"money":"$52,658,415","country":"USA","day":"03","month":"08","year":"2014","remarks":""},{"money":"$29,000,000","country":"USA","day":"27","month":"07","year":"2014","remarks":""}],"weekendGross":[{"money":"$189,605","country":"USA","day":"28","month":"09","year":"2014","remarks":"229 Screens"},{"money":"$5,700,000","country":"USA","day":"10","month":"08","year":"2014","remarks":"2,896 Screens"},{"money":"$11,010,367","country":"USA","day":"03","month":"08","year":"2014","remarks":"3,595 Screens"},{"money":"$29,000,000","country":"USA","day":"27","month":"07","year":"2014","remarks":"3,595 Screens"}],"admissions":[{"money":"129,117","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"Paramount Pictures Corporation and Metro-Goldwyn-Mayer Pictures Inc."},"technical":{"runtime":["1 hr 38 min (98 min)","1 hr 41 min (101 min) (extended cut)"],"soundMix":["SDDS","Datasat","Dolby Digital","Dolby Atmos"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa XT, Panavision Primo, C-Series, ATZ and AWZ2 Lenses"],"laboratory":["Company 3, London, UK (digital intermediate)"],"filmLength":["2,687 m (6 reels)"],"negativeFormat":["Codex ARRIRAW (2.8K)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Panavision (anamorphic) (source format)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)","D-Cinema (also 3-D version)"]},"rating":"6.0","metascore":"47","filmingLocations":[{"location":"Origo Film Studio, Budapest, Hungary"}],"rated":"PG-13","awards":[{"award":"Teen Choice Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Summer Movie Star","names":[{"name":"Dwayne Johnson","id":"nm0425005","role":null}]},{"category":"Choice Summer Movie","names":[]}]}]}],"votes":"121,858","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"},{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"},{"idCompany":"co0348357","name":"Flynn Picture Company"}],"keywords":{"keywords":["hercules","greek mythology","king","army","mercenary","battle","female archer","civil war","chained","evil king","club","legend","ancient greece","strongman","murder of family","female warrior","warrior","battlefield","combat","deception","death of son","warlord","death","blood","3 dimensional","nonlinear timeline","monster","creature","giant monster","broken jaw","massacre","destiny","fate","faith","aerial shot","full moon","redemption","self sacrifice","closing eyes of dead person","falling from height","punched in the face","escape","ambiguity","death of wife","female rear nudity","treating wound","tent","righteous rage","double entendre","target practice","map","kicked in the face","hit on the head","heir to throne","ambush","torch","pirate","revenge","dungeon","tooth ripped out","horse","animal killing","animal attack","lightning","snow","forest","mountain","swamp","attack","giant animal","giant creature","lion","hydra","wolf","cerberus","tragic hero","orphan","snake","horse drawn carriage","chariot","opening action scene","impalement","slow motion scene","storytelling","athens greece","tyranny","mute","montage","training","farmer","head on a stake","corpse","crow","village","palace","walled city","showdown","whip","statue","person on fire","fire","tavern","drunkenness","uncle nephew relationship","mother son relationship","father daughter relationship","prince","princess","child in peril","woman hits a man","knocked out","capture","jail cell","prisoner","traitor","kingdom","general","soldier","teamwork","precognition","soothsayer","hallucination","tragic past","haunted by the past","frame up","nightmare","flashback","drugged drink","death of family","rescue","hostage","kidnapping","gold","female mercenary","shield","helmet","tunic","amazon warrior","archer","flaming arrow","spear throwing","axe","spear","scythe","dagger","sword","bow and arrow","knife throwing","knife","threatened with a knife","good versus evil","violence","murder","head butt","knife fight","axe fight","sword fight","stylized violence","dual wield","throat slitting","neck breaking","gore","blood splatter","crushed to death","exploding head","severed arm","decapitation","severed head","stabbed to death","stabbed in the leg","stabbed in the back","stabbed in the chest","stabbed in the arm","stabbed in the shoulder","stabbed in the throat","stabbed in the face","stabbed in the eye","stabbed in the head","shot in the leg","shot to death","shot in the back","shot in the chest","shot in the arm","ex soldier","shot in the face","shot in the throat","shot in the shoulder","shot in the head","megalomaniac","double cross","betrayal","sword and sandal","based on comic book","dreadlocks","dark hero","tough girl","action heroine","tough guy","action hero","no opening credits","one word title","based on graphic novel","bare chested male bondage","based on comic","fictional war","title spoken by character","character name in title","black comedy","bare chested male","sword and sorcery","greece","heracles","adventure hero","one man army","long brown hair","brunette","strong man","sword and fantasy","adventurer","epic battle","hand to hand combat","martial arts"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:14:59"}}