{"data":{"movies":[{"title":"Street Warrior","originalTitle":"","year":"2008","releaseDate":"20081101","directors":[{"name":"David Jackson","id":"nm0002413"}],"writers":[{"name":"Alex Greenfield","id":"nm1899619"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDk5M2ZmZmEtZDVkOC00ZTRjLTkwYzQtM2Y5NzVjMGViNjU5XkEyXkFqcGdeQXVyNDkwMzY5NjQ@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action"],"plot":"An Iraqi war vet returns home to find that his brother is in a coma from participating in an illegal underground fight club.","simplePlot":"An Iraqi war vet returns home to find that his brother is in a coma from participating in an illegal underground fight club.","actors":[{"actorName":"Max Martini","urlProfile":"http://www.imdb.com/name/nm0242882","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3Njc1NTU5NV5BMl5BanBnXkFtZTgwMzAwMzYyODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 December 1969","placeOfBirth":" Kingston, New York, USA","birthName":"Maximilian Carlo Martini","height":"6' 0¾\" (1.85 m)","bio":"Maximilian Carlo Martini was born in Woodstock, New York, to an Italian father and an American mother. He is a citizen of the United States, Canada, and Italy. His parents were involved in the arts and instilled in him an appreciation for all things creative. After moving around a bit as a child, he made his way back to New York City and began to study acting. Starting out at the Neighborhood Playhouse he did the majority of his training with 'Michael Howard' in Manhattan. He then took a break from acting to focus on his early love of fine art, attending the School of Visual Arts in Manhattan and receiving a BFA in painting and sculpture. After completing college, Martini began to work steadily in both film and television projects. His film roles were sharing the screen with Tom Hanks and Matt Damon in Saving Private Ryan (1998) as \"Cpl Fred Henderson\", Ryan's commanding officer who helped \"Captain Miller\" (Hanks) and his men in the brutal final shootout of the film; and also had roles in some smaller independent films, working with Calista Flockhart in Pictures of Baby Jane Doe (1995), Chris Penn and Jeffrey Wright in Cement (2000) and in the 2000 Sundance Film Festival favorite, Backroads (2000). He also took on a lead role in the Steven Spielberg Emmy-nominated 20 hour mini-series Taken (2002) and has a recurring role with Kiefer Sutherland as \"Agent Steve Goodrich\" on Fox's Emmy-nominated 2nd season of 24 (2001). Other television work includes series regular roles on John Sacret Young's Level 9 (2000), Chris Carter's Harsh Realm (1999) and recurring roles on Breaking News (2002), and the award-winning Canadian series, Da Vinci's Inquest (1998). His other notable film roles include John Dahl's The Great Raid (2005) in which Martini co-starred with Joseph Fiennes. He was also seen opposite Jodie Foster in Robert Zemeckis' Contact (1997). One of his latest starring roles is in the Universal Studios trilogy, beginning with Fifty Shades of Grey (2015). Martini recently acted alongside Tom Hanks in the Paul Greengrass-directed, Golden Globe and Academy Award nominated film 'Captain Phillips'. In April of 2014 Martini will appear in David Ayer's 'Sabotage'. Additionally, Martini, recognized for his work in both David Mamet's feature 'Redbelt' and his CBS series 'The Unit', can be found in Luc Besson's 'Colombiana'. In 2013, he also starred in Guillermo del Toro's 'Pacific Rim' for Legendary Pictures and Warner Brothers. Martini will soon star in Pacific Rim: Uprising (2018), which is in the final stages of development. He has also co-starred in several TV movies, including Morgan Freeman's Mutiny (1999) and Francis Ford Coppola's Passion impossible (2001). He has made many memorable guest-star turns on popular series. Martini is active in the theatre, having co-founded \"Theatre North Collaborative\" in New York City, a theatre company of American and Canadian actors dedicated solely to producing new works from both sides of the border. Max has recently been filming CBS's The Unit (2006), created by David Mamet and produced by Shawn Ryan of The Shield (2002). He has also written a film, Desert Son (1999), which he co-directed with his younger brother, Christopher Martini and was costume-designed by his sister Michelle Martini. Martini, his wife Kim Restell and their two boys spend their time between their home in Los Angeles and their horse ranch out of town.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3Njc1NTU5NV5BMl5BanBnXkFtZTgwMzAwMzYyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0242882","name":"Max Martini","nicknames":["The Frage"],"idIMDB":"nm0242882"},"actorId":"nm0242882","character":"Jack Campbell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nick Chinlund","urlProfile":"http://www.imdb.com/name/nm0157915","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMzE1OTI3N15BMl5BanBnXkFtZTgwNjIxODgzMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1961","placeOfBirth":" New York City, New York, USA","birthName":"Zareh Nicholas Chinlund","height":"6' 2½\" (1.89 m)","bio":"Nick Chinlund was born and raised in New York City. He left the city to play basketball at Brown University, but his hoops career was cut short when he suffered an injury during his freshman year. He stayed at Brown and took up acting classes, and realized it was his true calling. He graduated from Brown and moved to Los Angeles to pursue his film career. He worked in the theater and performed in many acclaimed plays. He worked at the Williamstown Theater Festival from 1988 to 1989. He started his film career in Lethal Weapon 3 (1992) and Eraser (1996) and has appeared on The X-Files (1993) and NYPD Blue (1993). He now lives in New York and Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMzE1OTI3N15BMl5BanBnXkFtZTgwNjIxODgzMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0157915","name":"Nick Chinlund","idIMDB":"nm0157915"},"actorId":"nm0157915","character":"Mr. Pope","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jane Park Smith","urlProfile":"http://www.imdb.com/name/nm0661850","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMzQ5MzA2OF5BMl5BanBnXkFtZTgwODE5NjIyMDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Jane Park Smith was born in Seoul, South Korea. She is an actress and producer, known for Gang Related (2014), Boone: The Bounty Hunter (2017) and Insurgent (2015). She is married to Jonathan Lee Smith.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMzQ5MzA2OF5BMl5BanBnXkFtZTgwODE5NjIyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0661850","name":"Jane Park Smith","idIMDB":"nm0661850"},"actorId":"nm0661850","character":"Ms. Lee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Max Perlich","urlProfile":"http://www.imdb.com/name/nm0001611","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEyNzU1MzIzMV5BMl5BanBnXkFtZTgwOTU3MDk2MDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 March 1968","placeOfBirth":" Cleveland, Ohio, USA","height":"5' 4½\" (1.64 m)","bio":"Max Perlich was born on March 28, 1968 in Cleveland, Ohio, USA. He is known for his work on Blow (2001), Ferris Bueller's Day Off (1986) and Cliffhanger (1993). He is married to Jia Mae.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEyNzU1MzIzMV5BMl5BanBnXkFtZTgwOTU3MDk2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001611","name":"Max Perlich","idIMDB":"nm0001611"},"actorId":"nm0001611","character":"Georgie Bautista","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Valerie Cruz","urlProfile":"http://www.imdb.com/name/nm1395858","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4OTUwNTE0NF5BMl5BanBnXkFtZTgwMDg1MjA3ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1976","placeOfBirth":" Elizabeth, New Jersey, USA","height":"5' 6½\" (1.69 m)","bio":"Cruz recently joined the cast of FOX's hit series The Following where she plays strong-willed FBI Agent Gina Mendez, who alongside Ryan Hardy (Kevin Bacon), heads the investigation on serial killer Joe Carroll (James Purefoy). Season three of the psychological drama series returns in March 2, 2015. Prior to this, Cruz's leading role as Grace Santiago on the F/X drama Nip/Tuck marked the start of her television career. In 2008, Cruz pulled double duty on two different television series, as Maria Nolan on Kevin Williamson's drama Hidden Palms, and as Connie Murphy in Syfy and Saturn Film's series The Dresden Files. Her performance on The Dresden Files earned her a 2008 ALMA Award nomination for \"Outstanding Female Lead Performance in a Drama Series.\" Cruz was also a part of Showtime's hit series Dexter, which led to another nomination for \"Outstanding Performance by an Ensemble in a Drama Series\" at the 2009 SAG Awards. Immediately after, she joined the cast of HBO's True Blood, as vampire Isabel in their second season. Cruz then booked a leading role as Dr. Zee Alvarez in the ABC series Off The Map, created by Jenna Bans and produced by the prolific Shondaland Productions. Her momentum continued with a recurring arc on Showtime's award winning series Homeland where she played Major Joy Mendez. Along with these powerful roles, she has also made guest and recurring appearances on network heavyweight shows such as: Scandal, Law and Order SVU, Criminal Minds, Grey's Anatomy, to mention a few. In addition to her mainstream body of work, Cruz has made her mark on the independent film circuit with films like the action-drama The Line opposite Ray Liotta and Andy Garcia, as well as The Devil's Tomb opposite Cuba Gooding Jr., Ray Winstone and Ron Perlman. She recently wrapped production on the independent thriller The Loft where she starred alongside James Marsden and Eric Stonestreet. Originally from Elizabeth, New Jersey, Cruz currently lives in New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4OTUwNTE0NF5BMl5BanBnXkFtZTgwMDg1MjA3ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1395858","name":"Valerie Cruz","idIMDB":"nm1395858"},"actorId":"nm1395858","character":"Maggie Kuerner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny Arroyo","urlProfile":"http://www.imdb.com/name/nm0037423","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE5NDQzMDg1Nl5BMl5BanBnXkFtZTgwMjA1Mzk3OTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1979","placeOfBirth":" Bronx, New York, USA","birthName":"Daniel Luis Arroyo","bio":"Danny Arroyo is the talented and charismatic producer/actor/writer who loves reading books (especially comics), working out, writing, fantasy football, boxing, video games, and attending movie revivals of classic films. He caught the \"acting bug\" after watching an interview by Christopher Reeve talking about playing \"Superman\". He has also won three \"Best Actor\" awards at various film festivals for his many roles and projects. Arroyo plays Rico Fisher in the true story film THE LAST SMILE, for which Arroyo won Best Actor at the 2017 Silicon Valley Film Festival. He stars in the horror film THE BEFORE TIME, the romantic comedy A MOVING ROMANCE, and the feature film cop drama thriller BRANDED for which Arroyo also produced. He can next be seen in the thriller BODY OF SIN, the adventure film PIRATE OF SOMALIA: AFRICAN MYSTIQUE, and the true story OUT OF CUBA which Arroyo will star, produce and co-wrote. Arroyo is a series regular on the TV series SANGRE NEGRA, for which he won the \"Best Actor\" award at the 2015 Vive Latino America Awards Show for playing Detective Christian Santos. SANGRE NEGRA stars veteran actors Erik Estrada and Eric Roberts. Arroyo won \"Best Actor\" at the California Film Festival for his work in the indie drama CHIMERA HOUSE, and has shared the big screen with some established film stars, including Danny Glover, Salma Hayek, Mel Gibson, Casper Van Dien, Amy Poehler, Seth Meyers, Rosanna Arquette, Eric Roberts, and David Carradine. He has memorable roles in the films, LETHAL WEAPON 4, THE VELOCITY OF GARY, WHITE RUSH, KILL KATIE MALONE, SPRING BREAKDOWN, GROUPIE, REPO CHICK, and FIVE THIRTEEN with Danny Trejo. On the small screen, Arroyo has made guest appearances on countless hit TV shows. He starred in the SyFy pilot The Resistance, and in TV movies including the TNT movie HARD TIME opposite Burt Reynolds, DEATH ROW opposite Stacy Keach, the Spike TV movie STREET WARRIOR alongside action star Max Martini; and Arroyo plays Rick Wilder in Animal Planet's first original holiday film HERCULES SAVES CHRISTMAS. Arroyo's completed feature screenplay, GAMERS, a comedic suspense cop thriller about the phenomena of obsessive video game playing, has been optioned. Arroyo is penning his 2nd and 3rd scripts titled \"ORION'S BELT\" and the romantic comedy, \"LONELY SATURDAY NIGHT SYNDROME\". Arroyo serves as an ambassador to The Christopher & Dana Reeve Foundation. He is a regular fixture on the Red Carpets for the Primetime and Daytime Emmy Awards, the Prism Awards, ALMA Awards, Imagen Awards and many more. Danny Arroyo is a member of the Television Academy (Emmys) where he stays active being a member of various committees. He produced, wrote and hosted a very successful live event for the TV Academy titled, \"HOLA: THE PHENOMENAL GROWTH OF LATINO TV\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE5NDQzMDg1Nl5BMl5BanBnXkFtZTgwMjA1Mzk3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0037423","name":"Danny Arroyo","idIMDB":"nm0037423"},"actorId":"nm0037423","character":"Santo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Erin Cottrell","urlProfile":"http://www.imdb.com/name/nm0183158","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3OTU5OTcwOV5BMl5BanBnXkFtZTgwMjUyNDUwNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Erin Cottrell was born in Yardley, Pennsylvania, USA. She is an actress, known for Love's Unending Legacy (2007), Love's Long Journey (2005) and Love's Unfolding Dream (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3OTU5OTcwOV5BMl5BanBnXkFtZTgwMjUyNDUwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0183158","name":"Erin Cottrell","idIMDB":"nm0183158"},"actorId":"nm0183158","character":"Sarah Campbell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jayden Lund","urlProfile":"http://www.imdb.com/name/nm0526182","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3OTE2NDI3N15BMl5BanBnXkFtZTgwNjg5NTY1NjE@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1966","placeOfBirth":" Kansas City, Missouri, USA","height":"6' 4\" (1.93 m)","bio":"Jayden Lund was born on December 18, 1966 in Kansas City, Missouri, USA. He is an actor, known for Collision (2004), Alvin and the Chipmunks (2007) and The Informant! (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3OTE2NDI3N15BMl5BanBnXkFtZTgwNjg5NTY1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0526182","name":"Jayden Lund","idIMDB":"nm0526182"},"actorId":"nm0526182","character":"Chief Watkins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kiko Ellsworth","urlProfile":"http://www.imdb.com/name/nm0255309","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWZmNjdmZGUtMjIwOS00NjI0LTg5ZmQtZWYyODY1YjM1OGM5L2ltYWdlXkEyXkFqcGdeQXVyMTczODM5Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 January 1973","placeOfBirth":" South Central, Los Angeles, California, USA","birthName":"Keiko Jamen Ellsworth","height":"6' 1\" (1.85 m)","bio":"Kiko Ellsworth is an American film and television actor. He was born and raised in Los Angeles, California to Lorna and Andrew Ellsworth. He is of African, American Indian (mother), Israeli, French and Creole (father) descent. He is married to Massachusetts State native, Christine Carlo, whom he met auditioning for the film of All or Nothing which they later filmed together, and with whom he has one child, Zen Satya Ellsworth. Kiko's hobbies include, yoga, hiking, teaching youth acting and leadership classes and studying martial arts. He's has two older siblings, Shanda and Andre (deceased), with two nephews and two nieces. His niece Andrea Ellsworth is an American Film and Television actress.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWZmNjdmZGUtMjIwOS00NjI0LTg5ZmQtZWYyODY1YjM1OGM5L2ltYWdlXkEyXkFqcGdeQXVyMTczODM5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0255309","name":"Kiko Ellsworth","idIMDB":"nm0255309"},"actorId":"nm0255309","character":"Omar Lewis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jon Braver","urlProfile":"http://www.imdb.com/name/nm0106004","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NDIxNTM0N15BMl5BanBnXkFtZTgwMzM0Mzk1MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Jon is a director for film and theatre as well as a stuntman and stunt coordinator. After years of work with the the top stunt coordinators and directors on film, such as Spielberg, Nolan, Peter Berg, Jon Favreau plus many more, Jon has learned on-the-job training regarding the many complexities of filmmaking. He also created the first ever interactive horror theatre company called Haunted Play. Jon wrote and directed HP's first interactive tale titled \"Delusion\" in 2011. The show became a wild hit in Los Angeles as it literally evolved live entertainment as we know it. For 2012, HP created \"Delusion: The Blood Rite\"; an all new, more interactive and disturbing horror story. The Blood Rite quickly became the hottest ticket in LA. Neil Patrick Harris signed on as producer as well. Jon's directorial debut in film was with the short psychological adventure \"The Hypnotist\". The film will make its premiere at the Telluride Horror Film Festival in 2014. \"The Hypnotist\" is now in development to become a feature and/or TV series, while Delusion's nationwide notoriety flourishes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NDIxNTM0N15BMl5BanBnXkFtZTgwMzM0Mzk1MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0106004","name":"Jon Braver","idIMDB":"nm0106004"},"actorId":"nm0106004","character":"Guard #3","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rossie Cottrell","urlProfile":"http://www.imdb.com/name/nm2578904","urlPhoto":"","biography":{"dateOfBirth":"10 October 1977","placeOfBirth":" Orange County, California, USA","height":"5' 5\" (1.65 m)","bio":"Rossie Cottrell was born on October 10, 1977 in Orange County, California, USA. She is an actress, known for Blaxican Brothers (2011), You Don't Mess with the Zohan (2008) and Crank: High Voltage (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2578904","name":"Rossie Cottrell","idIMDB":"nm2578904"},"actorId":"nm2578904","character":"Cage Match Waitress","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lateef Crowder","urlProfile":"http://www.imdb.com/name/nm1956628","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc1NDYzMDIzMV5BMl5BanBnXkFtZTgwMjY1NjYzMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 November 1977","placeOfBirth":" San Jose, California, USA","birthName":"Lateef Crowder Dos Santos","height":"5' 10¾\" (1.8 m)","bio":"Lateef Crowder was born on November 23, 1977 in San Jose, California, USA as Lateef Crowder Dos Santos. He is known for his work on The Hunger Games (2012), Captain America: Civil War (2016) and Batman v Superman: Dawn of Justice (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc1NDYzMDIzMV5BMl5BanBnXkFtZTgwMjY1NjYzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1956628","name":"Lateef Crowder","idIMDB":"nm1956628"},"actorId":"nm1956628","character":"Gang member #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Greg Horos","urlProfile":"http://www.imdb.com/name/nm0395251","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NDE2ODI5OF5BMl5BanBnXkFtZTcwNDY3NTMzMQ@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"height":"6' 3\" (1.91 m)","bio":"Greg Horos was born in Philadelphia, Pennsylvania, USA. He is an actor, known for Unbreakable (2000), A Gentleman's Game (2002) and Spring Breakdown (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NDE2ODI5OF5BMl5BanBnXkFtZTcwNDY3NTMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0395251","name":"Greg Horos","nicknames":["G. \"Da Undadawg\""],"idIMDB":"nm0395251"},"actorId":"nm0395251","character":"Bartender","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Kasper","urlProfile":"http://www.imdb.com/name/nm0440723","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNDc2NDM0Ml5BMl5BanBnXkFtZTgwNTE0NzI3NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 May 1958","placeOfBirth":" Los Angeles, California, USA","birthName":"Gary Franklin Kasper","height":"6' 4\" (1.93 m)","bio":"Gary Kasper was born on May 22, 1958 in Los Angeles, California, USA as Gary Franklin Kasper. He is known for his work on Batman Forever (1995), Vision Quest (1985) and Point of No Return (1993). He has been married to Laraine Lowrey since 1982.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNDc2NDM0Ml5BMl5BanBnXkFtZTgwNTE0NzI3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0440723","name":"Gary Kasper","idIMDB":"nm0440723"},"actorId":"nm0440723","character":"Tuck Baldus","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roland Kickinger","urlProfile":"http://www.imdb.com/name/nm0452199","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0ODIwNDUyMF5BMl5BanBnXkFtZTgwNTU3MDQyNDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1968","placeOfBirth":" Vienna, Austria","height":"6' 5\" (1.96 m)","bio":"Roland was born in Vienna, Austria. He spent his childhood in Vienna, where he enjoyed swimming and playing soccer. At the early age of 15 decided he wanted to become a bodybuilder. From that day on, Roland dedicated his life to becoming his very best. While training, Roland continued schooling and graduated from college with a degree in Hotel and Restaurant Management. Roland went on to compete in the European National Bodybuilding Championshipsand won the title of 'Mr. Austria'. But he knew his dream of becoming a well-known bodybuilder could not be fully attained by staying in his homeland. In 1995, Roland came to the U.S. to pursue new opportunities. Arriving with only $500 and no place to stay, he never gave up his dreams. After a few short visits to California, and a one year stay in Florida, Roland decided to make the United States his home permanently. The following year all the hard work paid off when he joined the Professional ranks and was signed to represent the leader in health and fitness, Joe Weider.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0ODIwNDUyMF5BMl5BanBnXkFtZTgwNTU3MDQyNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0452199","name":"Roland Kickinger","idIMDB":"nm0452199"},"actorId":"nm0452199","character":"The Showman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1260591","urlIMDB":"http://www.imdb.com/title/tt1260591","business":{"budget":{"money":"$2,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 31 min (91 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["DVD-ROM","Video"]},"rating":"4.5","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"507","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0209513","name":"Grand Army Entertainment"},{"idCompany":"co0045255","name":"Larry Levinson Productions"},{"idCompany":"co0013824","name":"RHI Entertainment"}],"keywords":{"keywords":["bare chested male","brutality","bare knuckle boxing","bare knuckle fighting","modern gladiator","gladiator","beating","illegal fistfight","violence","street fighter","martial arts","cage","cage fight","fistfight","martial arts tournament","martial arts training","martial arts master","martial artist","underground tournament","underground fighting","mixed martial arts","cage fighting"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:14:13"}}