{"data":{"movies":[{"title":"As Good as Dead","originalTitle":"","year":"2010","releaseDate":"20101008","directors":[{"name":"Jonathan Mossek","id":"nm1701257"}],"writers":[{"name":"Erez Mossek","id":"nm2927985"},{"name":"Eve Pomerance","id":"nm0690054"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MTA5NzA2NF5BMl5BanBnXkFtZTcwNDg3Njc1Mw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Thriller"],"plot":"Seeking revenge for the murder of their religious leader, fundamental loyalists kidnap and torture the man they believe responsible, but the ensuing clash of right vs. left ideologies quickly reveals that they may have the wrong man, which puts them on a path toward a shocking twist.","simplePlot":"Seeking revenge for the murder of their religious leader, fundamental loyalists kidnap and torture the man they believe responsible, but the ensuing clash of right vs. left ideologies ... ","actors":[{"actorName":"Andie MacDowell","urlProfile":"http://www.imdb.com/name/nm0000510","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzc1NTc4Nzk2Nl5BMl5BanBnXkFtZTcwNjMwMzg5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 April 1958","placeOfBirth":" Gaffney, South Carolina, USA","birthName":"Rosalie Anderson MacDowell","height":"5' 8\" (1.73 m)","bio":"Andie MacDowell was born Rosalie Anderson MacDowell on April 21, 1958 in Gaffney, South Carolina, to Pauline Johnston (Oswald), a music teacher, and Marion St. Pierre MacDowell, a lumber executive. She was enrolled at Winthrop College located in Rock Hill, South Carolina. Initially discovered by a rep from Wilhelmina Models while on a trip to Los Angeles. Later signed on with Elite Model Management in New York City in 1978. Made debut film appearance in Greystoke: The Legend of Tarzan, Lord of the Apes (1984). Went on to study method acting at the Actors Studio. Had commercial success with performances in Harold Ramis's Groundhog Day (1993) and Mike Newell's Four Weddings and a Funeral (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzc1NTc4Nzk2Nl5BMl5BanBnXkFtZTcwNjMwMzg5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000510","name":"Andie MacDowell","idIMDB":"nm0000510"},"actorId":"nm0000510","character":"Helen Kalahan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cary Elwes","urlProfile":"http://www.imdb.com/name/nm0000144","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUxNzY3NTAxNF5BMl5BanBnXkFtZTgwNjU4MDU0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1962","placeOfBirth":" London, England, UK","birthName":"Ivan Simon Cary Elwes","height":"6' (1.83 m)","bio":"Cary Elwes was born in Westminster, London, England, the third son of interior designer/shipping heiress Tessa Georgina Kennedy and the late portrait painter Bede Evelyn Dominick Elwes. He is the brother of producer/agent Cassian Elwes and artist Damian Elwes. He was raised in London and attended Harrow. After graduating from Harrow, he moved to the US and studied drama at Sarah Lawrence College. He left school after two years to begin his film career. Cary is well respected by colleagues and fans alike and considered by many to be one of the finest young actors working today. He is interested in history and says, \"It's deliberate that a lot of my films have been period pieces\". He is politically active for causes he believes in, such as protecting the environment and helping Native American people. Elwes is married to Lisa Marie Kurbikoff, a stills photographer. He comes from a long-established recusant English family on his father's side. Several prominent Catholic clerics are among his relatives, including Fr. Luke Cary-Elwes, Dom Columba Cary-Elwes, and Dom Cuthbert Cary-Elwes. His paternal great-grandfather was Chamberlain to the Pope. Cary (the surname \"Cary-Elwes\" was shortened to \"Elwes\" in some branches of the family) was an altar boy at London's Brompton Oratory, although he did not attend a Catholic high school. From his maternal grandmother, Daska Marija Ivanovic-Banac, who was born in Osijek in the Austra-Hungarian Empire (now in Croatia), he has Croatian Jewish and Serbian ancestry. Cary's other lineage is English, Irish, and Scottish.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUxNzY3NTAxNF5BMl5BanBnXkFtZTgwNjU4MDU0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000144","name":"Cary Elwes","idIMDB":"nm0000144"},"actorId":"nm0000144","character":"Ethan Belfrage","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Whaley","urlProfile":"http://www.imdb.com/name/nm0001844","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzkyODAyMDA1N15BMl5BanBnXkFtZTcwOTEyNDk0OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 July 1963","placeOfBirth":" Syracuse, New York, USA","birthName":"Frank Joseph Whaley","height":"5' 9\" (1.75 m)","bio":"Frank Whaley is a critically acclaimed actor/writer/director. He is best known for the films Pulp Fiction (1994) and Swimming with Sharks (1994), and has worked with Oliver Stone multiple times. His feature directorial debut, Joe the King (1999), earned him the Waldo Salt Screenwriting prize at the 1999 Sundance Film Festival. He was born in Syracuse, New York, and resides in New York City. He is also an accomplished stage actor, working frequently with the New Group theater. Frank is married to the writer Heather Bucha Whaley. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzkyODAyMDA1N15BMl5BanBnXkFtZTcwOTEyNDk0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001844","name":"Frank Whaley","idIMDB":"nm0001844"},"actorId":"nm0001844","character":"Aaron","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matt Dallas","urlProfile":"http://www.imdb.com/name/nm1678720","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MjYxMjE5OF5BMl5BanBnXkFtZTcwMjgyNjY0MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 October 1982","placeOfBirth":" Phoenix, Arizona, USA","birthName":"Matthew Joseph Dallas","height":"5' 11\" (1.8 m)","bio":"Matthew Joseph \"Matt\" Dallas born October 21, 1982 is an American actor, best known for playing the title character on the ABC Family series Kyle XY. Dallas was born in Phoenix, Arizona, and attended Arizona School for the Arts. He has two younger brothers and one younger sister. He became interested in acting at the age of 12, when his grandmother took him to a production of the play The Ugly Duckling.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MjYxMjE5OF5BMl5BanBnXkFtZTcwMjgyNjY0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1678720","name":"Matt Dallas","idIMDB":"nm1678720"},"actorId":"nm1678720","character":"Jake","urlCharacter":"http://www.imdb.com/character/ch0460953","main":true},{"actorName":"Nicole Ansari-Cox","urlProfile":"http://www.imdb.com/name/nm0030532","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MDY5NjM3NV5BMl5BanBnXkFtZTgwMTA0MzMxODE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1969","placeOfBirth":" Germany","birthName":"Nicole Ansari","height":"5' 4¼\" (1.63 m)","bio":"Nicole Ansari has been acting since she was 9 years old in her native Germany, where she had her first big break in the German Cop series Tatort alongside German star Goetz George, followed by guest- starring roles in other TV series like Polizeiruf and Kommissar Rex. After studying Drama and Dance in Hamburg she starred in two Independent Art house movies- \"Franta\", directed by Matthias Allary , an adaptation of the First World War novel and \"Little King Eric\" by Thomas Bahmann. She then left Germany to join the renowned Zuerich-based Repertory company Theater am Neumarkt. In Zuerich she starred in the Swiss/Iraki Filmmaker Samir's first feature Film, \"Always and Forever\", an adaptation of Jean Paul Sartre's \"The Game is over.\" She also starred in the TV series Eurocops, directed by Markus Imboden. In Germany she also worked with director Thomas Jahn in the feature \"Kai Raabe gegen die Vatikankiller.\" She then went to study further in New York and auditioned for Uta Hagen, with whom she studied for the following 2 years and also for the Actor's Studio with Susan Batson, where she got accepted as a working temporary Member. Back in Europe she was chosen out of thousands of Applicants in a grueling 3 months long Audition process to become a Member of the famed Theatre du Soleil in Paris under the director Ariane Mnouchkine and performed there and on tour for 2 1/2 years. In Paris she replaced French Film star Maria Schneider and collaborated with Corine Blue on the short Film \"Quand Fred rit\", alongside Valeria Bruni-Tedesci. After Paris she went to Vienna, where she played the \"Muse of the four Arts\" Alma Mahler on stage and in a TV Mini series for Arte, which was the start of collaborating with director Paulus Manker and writer Joshua Sobol. She subsequently performed many leads at the Public Theater (Roxanne in Cyrano de Bergerac; Irma in Irma la Douce; Romy Schneider in Romy, ich...Berenice in Berenice) and starred in the TV movie \"Two women, a man and a baby\", which raised the Issue of Same Sex marriage and as Desdemona in \"Jago\", a modern day adaptation of Othello. During that time she was also a regular on the German Cop TV series \"SK Koelsch.\" After getting married to the Scottish actor Brian Cox and having two children with him she split her time between the US and the UK, where she kept working mostly in Television, in the UK in Phillip Saville's \"The Biographer\" and in the US most notably as a recurring character in the HBO Original series Deadwood. She also Co- starred in Scottish Punk- Rocker Richard Jobson's feature \"a Woman in Winter.\" Nicole originated the part of Lenka, a Czech student of Philopsophy in Tom Stoppard's \"Rock N' Roll\" at the Royal court and in the West end in London and revived her role on Broadway at the Bernhard B. Jacobs Theater. Back in NY she also started producing Independent movies and has two feature Films -the Thriller \"As good as dead\" with Andy McDowell and the Comedy \"Blumenthal\" with Brian Cox, in which she also Co-stars -and a short Documentary about the Arts program in a Public school \"Padim\" (which she directed)-under her belt. She is a NY working actor and guest- starred as a Transsexual in the First Interactive TV show for current TV, \"Bar Karma\", which was produced by Sims creator Will Wright and producer Abi Hecht and in the last season of the longest running Soap \"As the world turns\" .She has recently worked with Steven Soderbergh in \"Side effects\" as well as Co-starred in the upcoming Indie \"Maggie Black\" and also guest-starred in the new NBC show \"The Mysteries of Laura.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MDY5NjM3NV5BMl5BanBnXkFtZTgwMTA0MzMxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0030532","name":"Nicole Ansari-Cox","idIMDB":"nm0030532"},"actorId":"nm0030532","character":"Kate Belfrage","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Cox","urlProfile":"http://www.imdb.com/name/nm0004051","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzNDUwMDMyNF5BMl5BanBnXkFtZTYwODU3MDQ1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1946","placeOfBirth":" Dundee, Scotland, UK","birthName":"Brian Denis Cox","height":"5' 7½\" (1.71 m)","bio":"Brian Cox is an Emmy Award-winning Scottish actor. He was born on June 1, 1946 in Dundee, Scotland, to Mary Ann Guillerline (McCann), a spinner, and Charles McArdle Campbell Cox, a shopkeeper and butcher. His father was of Irish ancestry and his mother was of Irish and Scottish descent. Cox first came to attention in the early 1970s with performances in numerous television films. His first big break was as Dr. Hannibal Lecter in Manhunter (1986). The film was not overly successful at the box office, although Cox's career prospects and popularity continued to develop. Through the 1990s, he appeared in nearly 20 films and television series, as well as making numerous television guest appearances. More recently, Cox has had roles in some major films, including The Corruptor (1999), The Ring (2002) and X-Men 2 (2003). He was awarded Commander of the Order of the British Empire in the 2003 Queen's New Year's Honours List for his services to drama.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzNDUwMDMyNF5BMl5BanBnXkFtZTYwODU3MDQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004051","name":"Brian Cox","idIMDB":"nm0004051"},"actorId":"nm0004051","character":"Reverend Kalahan","urlCharacter":"http://www.imdb.com/character/ch0159991","main":true},{"actorName":"Clark Middleton","urlProfile":"http://www.imdb.com/name/nm0585485","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMDU0MjgyMV5BMl5BanBnXkFtZTgwMDgxNDkyODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 4\" (1.63 m)","bio":"Clark Middleton has worked as an actor with film directors including Ang Lee, Henry Bean, Quentin Tarantino, Robert Rodriguez, Richard Linklater and Frank Miller, among others. On television, he has been seen in Fringe, Jonny Zero, in a recurring role on Law and Order, and in CSI: Las Vegas. He also writes and directs original work for both screen and stage. A working actor in New York City since 1983, Clark made his theatrical debut in three plays with the late Geraldine Page. He went on to work with Uta Hagen and Herbert Berghof and has acted at the Public Theater, with the Circle Repertory Company, Shakespeare in the Park, the Signature and has worked in such regional theaters as the Denver Center and the Mark Taper Forum in Los Angeles. Clark has created parts for playwrights including Sam Shepard, John Guare, Edwardo Machado, John Belluso, and William Leavengood. He also wrote the one-person, critically acclaimed play Miracle Mile and performed it in NYC and throughout the US. Clark Middleton is a Lifetime Member of the Actors Studio.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMDU0MjgyMV5BMl5BanBnXkFtZTgwMDgxNDkyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0585485","name":"Clark Middleton","idIMDB":"nm0585485"},"actorId":"nm0585485","character":"Seth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emma Kantor","urlProfile":"http://www.imdb.com/name/nm3145830","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1ODExNjIyOF5BMl5BanBnXkFtZTgwNDQ1MTQ3NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Emma Kantor is an actress and writer, known for As Good as Dead (2010), 3 Deserts' Reflection (2009) and Imbalance (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1ODExNjIyOF5BMl5BanBnXkFtZTgwNDQ1MTQ3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3145830","name":"Emma Kantor","idIMDB":"nm3145830"},"actorId":"nm3145830","character":"Sarah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Juliette Bennett","urlProfile":"http://www.imdb.com/name/nm2200434","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWFhOTY5ZTctNTJjMS00ZGNiLWI5YjctZjhkNThjMzM0OTI2L2ltYWdlXkEyXkFqcGdeQXVyNTA0Njg1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Juliette Bennett is an actress, known for Smothered by Mothers (2017), Making the Day and The Nth Ward (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWFhOTY5ZTctNTJjMS00ZGNiLWI5YjctZjhkNThjMzM0OTI2L2ltYWdlXkEyXkFqcGdeQXVyNTA0Njg1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2200434","name":"Juliette Bennett","idIMDB":"nm2200434"},"actorId":"nm2200434","character":"Erica","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nasry Malak","urlProfile":"http://www.imdb.com/name/nm2426688","urlPhoto":"","biography":{"bio":"Nasry Malak is an actor, known for As Good as Dead (2010), The Last War Crime (2012) and God Loves ME Best! (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2426688","name":"Nasry Malak","idIMDB":"nm2426688"},"actorId":"nm2426688","character":"Moe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Crispian Belfrage","urlProfile":"http://www.imdb.com/name/nm0006712","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0ODMyMjAyN15BMl5BanBnXkFtZTgwNzQxNjIwOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1971","placeOfBirth":" London, England, UK","height":"6' (1.83 m)","bio":"Crispian Belfrage was born on October 20, 1971 in London, England. He is an actor and producer, known for Morgan (2016), Bent (1997) and When Demons Die (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0ODMyMjAyN15BMl5BanBnXkFtZTgwNzQxNjIwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006712","name":"Crispian Belfrage","idIMDB":"nm0006712"},"actorId":"nm0006712","character":"Brian Shepherd","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Claudine Oriol","urlProfile":"http://www.imdb.com/name/nm2090304","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNDQwNDAxOV5BMl5BanBnXkFtZTcwNTg1MTQzMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 4½\" (1.64 m)","bio":"Claudine Oriol was born in Haiti. She is an actress and director, known for The Death and Life of Bobby Z (2007), As Good as Dead (2010) and Blonde Ambition (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNDQwNDAxOV5BMl5BanBnXkFtZTcwNTg1MTQzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2090304","name":"Claudine Oriol","idIMDB":"nm2090304"},"actorId":"nm2090304","character":"Marsha","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"J.W. Cortes","urlProfile":"http://www.imdb.com/name/nm2326236","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDA2ODYzMzA0NF5BMl5BanBnXkFtZTgwMDg0MTM0NjE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"J.W. Cortés is an award-winning actor, Marine combat veteran, singer, filmmaker and philanthropist. Born and raised in Sunset Park Brooklyn, to inspiring Puerto Rican parents, he developed an interest in the arts along with a desire to serve his community and country. Recognized for his drive, talent and positive attitude, Cortés has become one of the most respected prime-time Puerto Rican actors on television today. Currently Cortés plays the recurring role of \"Detective Carlos Alvarez\" on FOX's hit prime-time series \"Gotham.\" Cortés is the first actor in history to portray the iconic comic book character in television and film. Detective Alvarez was originally created by Judd Winick's for his hit DC Comics' The New 52 Catwomanseries. In addition to \"Gotham,\" he has had various roles on: STARZ's \"Power,\" NBC's \"The Blacklist,\" \"The Mysteries of Laura\" and CBS' \"Blue Bloods.\" Previously, Cortés starred as an \"Operative\" on NBC's reality television show, \"Stars Earn Strips.\" On the show he helped celebrities, raising awareness and funds for various military and veteran charities, participate in simulated military training missions. Cortés has also appeared in feature films including the soon-to-be released \"Sugarfields,\" \"As Good As Dead\" from Andie MacDowell, \"Blue Caprice\" with Isaiah Washington and the award winning film \"Stop\" at Sundance Film Festival. In addition to playing a Detective on Television each week, Cortés serves New York State's Metropolitan Transit Authority Police Department (MTAPD) as an officer based in Grand Central Terminal. He also helps raise awareness and funding for various charities and organizations including Autism Speaks, Got Your 6, the Bob Woodruff Foundation, the Gary Sinise Foundation and the Boot Campaign. He was honored to recently perform at the Music Heals benefit concert in Washington D.C. and raise money and awareness for the charity MusiCorps; and was chosen by Got Your 6 to serve as one of the organizations celebrity American Icons. Cortés served in the United States Marine Corps for nearly thirteen years attaining the rank of Gunnery Sergeant when serving in Operation Enduring Freedom and Operation Iraqi Freedom. His military awards include the Combat Action Ribbon, Navy & Marine Corps Achievement Medals and Marine of the Year. He studied acting at the world renowned William Esper Studio, under the tutelage of Terry Knickerbocker. J.W. Cortés is the proud father of two boys, a lucky husband and loving owner of an American-Bulldog named \"Blue.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDA2ODYzMzA0NF5BMl5BanBnXkFtZTgwMDg0MTM0NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2326236","name":"J.W. Cortes","idIMDB":"nm2326236"},"actorId":"nm2326236","character":"Cop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Laurence Covington","urlProfile":"http://www.imdb.com/name/nm2328366","urlPhoto":"","biography":{"dateOfBirth":"30 October 1977","placeOfBirth":" Washington, District of Columbia, USA","height":"5' 9\" (1.75 m)","bio":"Laurence Covington was born on October 30, 1977 in Washington, District of Columbia, USA. He is an actor, known for Safe (2012), As Good as Dead (2010) and Grand Gesture (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2328366","name":"Laurence Covington","nicknames":["DC"],"idIMDB":"nm2328366"},"actorId":"nm2328366","character":"Cop #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mario D'Leon","urlProfile":"http://www.imdb.com/name/nm1595951","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0NTA0MTIzMV5BMl5BanBnXkFtZTgwODIzNTYxNjE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"height":"6' 5\" (1.96 m)","bio":"Mario D'Leon is known for his work on Grand Theft Auto IV: The Ballad of Gay Tony (2009), The Smurfs (2011) and Premium Rush (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0NTA0MTIzMV5BMl5BanBnXkFtZTgwODIzNTYxNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1595951","name":"Mario D'Leon","idIMDB":"nm1595951"},"actorId":"nm1595951","character":"Titus","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1294136","urlIMDB":"http://www.imdb.com/title/tt1294136","business":{"budget":null,"openingWeekend":[{"money":"$1,494","country":"USA","day":"10","month":"10","year":"2010","remarks":"1 Screen"}],"gross":[{"money":"$1,200,000","country":"USA","day":"10","month":"10","year":"2010","remarks":""}],"weekendGross":[{"money":"$1,494","country":"USA","day":"10","month":"10","year":"2010","remarks":"1 Screen"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 40 min (100 min) (USA)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Red One Camera"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.2","metascore":"34","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"R","awards":[],"votes":"1,321","type":"Movie","companyCreditsSimple":[{"idCompany":"co0147213","name":"Eclectic Pictures"},{"idCompany":"co0248516","name":"As Good As Dead"},{"idCompany":"co0246848","name":"First Line Entertainment"}],"keywords":{"keywords":["torture","revenge","murder","death","tied up while barefoot","tied feet","cat and mouse","killing spree","break in","fight to the death","psycho killer","scare","brutality","killing a dog","haunted by the past","mysterious villain","physical abuse","knocking on a door","deranged","deeply disturbed person","random violence","degradation","tied up","captive","hostage","stupid victim","killing","psychopath","man kills woman","avenge","tragic villain","southern accent","countdown","death threat","one location","panic","family in danger","beating","psychological torture","murderer duo","stalking","escape attempt","confinement","trapped","anti villain","fundamentalism","cruelty","maniac","suspense","child in peril","psycho thriller","teddy bear","apartment fire","arson","lighting a cigarette","sadist","tattoo","zippo lighter","breaking a window","tire iron","pump action shotgun","white supremacist","racial joke","face slap","double barreled shotgun","architectural model","switchblade","interrogation","stepping on glass","chain","duct tape gag","bound and gagged","irish setter","car fire","burn scar","refrigerator","injection","molotov cocktail","subjective camera","prologue","silencer","tied to a chair","lying","looking at oneself in a mirror","swastika","neo nazi","lighter","truth","masked man","bus massacre","bloody body of a child","stabbed in the back","suicide","shot in the head","death of girl","child murder","bum","stepping on someone's foot","held at gunpoint","police investigation","mother son relationship","bleeding from the eyes","blood spatter","shot in the chest","flashback","noose","lethal injection","cigarette smoking","knife","locked in a closet","car set on fire","lollipop","store clerk","baseball bat","reference to budweiser","knocked out with a gun butt","pistol","kicked in the stomach","plunger","punched in the face","gash in the face","kidnapping","revolving door","midget","construction site","home invasion","bus driver","shot to death","canon","fire extinguisher","husband wife relationship","cell phone","laptop computer","fundamentalist religion","burn victim","father daughter relationship","williamsburg bridge","deception","dog","shotgun","new york city","american flag","reverend","priest","photo montage","duct tape over mouth","blood","death of son","death of child","independent film","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:02:55"}}