{"data":{"movies":[{"title":"Iron Man 2","originalTitle":"","year":"2010","releaseDate":"20100507","directors":[{"name":"Jon Favreau","id":"nm0269463"}],"writers":[{"name":"Justin Theroux","id":"nm0857620"},{"name":"Stan Lee","id":"nm0498278"}],"runtime":"124 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MDgwNjMyMl5BMl5BanBnXkFtZTcwNTg3NzAzMw@@._V1.jpg","countries":["USA"],"languages":["English","French","Russian"],"genres":["Action","Adventure","Sci-Fi"],"plot":"With the world now aware of his dual life as the armored superhero Iron Man, billionaire inventor Tony Stark faces pressure from the government, the press, and the public to share his technology with the military. Unwilling to let go of his invention, Stark, along with Pepper Potts, and James \"Rhodey\" Rhodes at his side, must forge new alliances - and confront powerful enemies.","simplePlot":"With the world now aware of his identity as Iron Man, Tony Stark must contend with both his declining health and a vengeful mad man with ties to his father's legacy.","actors":[{"actorName":"Robert Downey Jr.","urlProfile":"http://www.imdb.com/name/nm0000375","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1965","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Robert John Downey Jr","height":"5' 8½\" (1.74 m)","bio":"Robert Downey Jr. has evolved into one of the most respected actors in Hollywood. With an amazing list of credits to his name, he has managed to stay new and fresh even after over four decades in the business. Downey was born April 4, 1965 in Manhattan, New York, the son of writer, director and filmographer Robert Downey Sr. and actress Elsie Downey (née Elsie Ann Ford). Robert's father is of half Lithuanian Jewish, one quarter Hungarian Jewish, and one quarter Irish, descent, while Robert's mother was of English, Scottish, German, and Swiss-German ancestry. Robert and his sister, Allyson Downey, were immersed in film and the performing arts from a very young age, leading Downey Jr. to study at the Stagedoor Manor Performing Arts Training Center in upstate New York, before moving to California with his father following his parents' 1978 divorce. In 1982, he dropped out of Santa Monica High School to pursue acting full time. Downey Sr., himself a drug addict, exposed his son to drugs at a very early age, and Downey Jr. would go on to struggle with abuse for decades. Downey Jr. made his debut as an actor at the age of five in the film Pound (1970), written and directed by his father, Robert Downey Sr.. He built his film repertoire throughout the 1980s and 1990s with roles in Tuff Turf (1985), Weird Science (1985), True Believer (1989), and Wonder Boys (2000) among many others. In 1992, Downey received an Academy Award nomination and won the BAFTA (British Academy Award) for Best Actor for his performance in the title role of Chaplin (1992). In Robert Altman's Short Cuts (1993), he appeared as an aspiring film make-up artist whose best friend commits murder. In Oliver Stone's Natural Born Killers (1994), with Woody Harrelson and Juliette Lewis, Downey starred as a tabloid TV journalist who exploits a murderous couple's killing spree to boost his ratings. For the comedy Heart and Souls (1993), Downey starred as a young man with a special relationship with four ghosts. In 1995, Downey starred in Restoration (1995), with Hugh Grant, Meg Ryan and Ian McKellen, directed by Michael Hoffman. Also that year, he starred in Richard III (1995), in which he appears opposite his Restoration (1995) co-star McKellen. In 1997, Downey was seen in Robert Altman's The Gingerbread Man (1998), alongside Kenneth Branagh, Daryl Hannah and Embeth Davidtz; in One Night Stand (1997), directed by Mike Figgis and starring Wesley Snipes and Nastassja Kinski; and in Hugo Pool (1997), directed by his father, Robert Downey Sr. and starring Sean Penn and Patrick Dempsey. In September of 1999, Downey appeared in Black & White (1999), written and directed by James Toback, along with Ben Stiller, Elijah Wood, Gaby Hoffmann, Brooke Shields and Claudia Schiffer. In January of 1999, he starred with Annette Bening and Aidan Quinn in In Dreams (1999), directed by Neil Jordan. In 2000, Downey co-starred with Michael Douglas and Tobey Maguire in Wonder Boys (2000), directed by Curtis Hanson. In this dramatic comedy, Downey played the role of a bisexual literary agent. In 2001, Downey made his prime-time television debut when he joined the cast of the Fox-TV series Ally McBeal (1997) as attorney \"Larry Paul\". For this role, he won the Golden Globe Award for Best Performance by an Actor in a Supporting Role in a Series, Mini-Series or Motion Picture Made for Television, as well as the Screen Actors Guild Award for Outstanding Performance by a Male in a Comedy Series. In addition, Downey was nominated for an Emmy for Outstanding Supporting Actor in a Comedy Series. The actor's drug-related problems escalated from 1996 to 2001, leading to arrests, rehab visits and incarcerations, and he was eventually fired from Ally McBeal (1997). Emerging clean and sober in 2003, Downey Jr. began to rebuild his career. He marked his debut into music with his debut album, titled \"The Futurist\", on the Sony Classics Label on November 23rd, 2004. The album's eight original songs, that Downey wrote, and his two musical numbers debuting as cover songs revealed his sultry singing voice and his musical talents. Downey displayed his versatility in two different films in October 2003: the musical/drama The Singing Detective (2003), a remake of the BBC hit of the same name, and the thriller Gothika (2003) starring Halle Berry and Penélope Cruz. Downey starred in powerful yet humbling roles inspired by real-life accounts of some of history's most precious kept secrets, including Richard Linklater's A Scanner Darkly (2006) in 2006 co-starring Keanu Reeves, Winona Ryder and Woody Harrelson, and Fur: An Imaginary Portrait of Diane Arbus (2006) co-starring Nicole Kidman, a film inspired by the life of Diane Arbus, the revered photographer whose images captured attention in the early 1960s. These roles exhibited Downey's momentum from the previous year of 2005, in which he starred in the Academy Award®-nominated feature film Good Night, and Good Luck. (2005), directed by George Clooney and in Shane Black's action comedy Kiss Kiss Bang Bang (2005) co-starring Val Kilmer. In 2007, he co-starred in David Fincher's suspenseful _Zodiac (2007/I)_ alongside Jake Gyllenhaal and Mark Ruffalo, about the notorious serial killer who haunted San Francisco during the 1970s. In May 2008, Downey achieved critical acclaim and worldwide box office success for his starring role in Iron Man (2008), Jon Favreau's big-screen rendering of the Marvel comic book superhero. The film co-starred Gwyneth Paltrow, Jeff Bridges and Terrence Howard. In August of 2008, Downey starred with Ben Stiller and Jack Black in the comedy Tropic Thunder (2008), and went on to receive an Academy Award®-nomination for Best Supporting Actor for his, Kirk Lazarus. In December 2009, Downey starred in the action-adventure Sherlock Holmes (2009). The film, directed by Guy Ritchie, co-starred Jude Law and Rachel McAdams and earned Downey a Golden Globe for Best Performance by an Actor in a Motion Picture - Comedy or Musical in January of 2010. In early Summer 2010, Downey re-teamed with director Jon Favreau and reprised his role as \"Tony Stark/Iron Man\" in the hugely successful sequel to the original film, Iron Man 2 (2010), starring Gwyneth Paltrow, Scarlett Johansson, Samuel L. Jackson and Mickey Rourke. Downey next starred in Due Date (2010), a comedy directed by Todd Phillips, in which he plays the role of an expectant father on a road trip racing to get back in time for the birth of his first child. Due Date (2010), starring The Hangover (2009)'s Zach Galifianakis, was released in November 2010. Downey was honored by Time Magazine's \"Time 100\" in 2008, an annual list of the 100 most influential people in the world. His laurels include two Academy Award nominations, three Golden Globe wins, numerous other award nominations and wins, and tremendous popular and commercial success, particularly in his roles as Sherlock Holmes and Tony Stark (the latter of which he has so far played in Iron Man (2008), Iron Man 2 (2010), The Avengers (2012), Iron Man 3 (2013), and Avengers: Age of Ultron (2015). For three consecutive years, from 2012 to 2015, Downey has topped the Forbes list of Hollywood's highest-paid actors, making an estimated $80 million in earnings between June 2014 and June 2015. In 2005, Downey Jr. married Susan Downey, who gave birth to their son, Exton Elias Downey, on February 7, 2012. Downey also has another son, Indio Falconer Downey, born September 7, 1993, from his first marriage to Deborah Falconer, from whom he was officially divorced in 2004. Robert has jump-started the Team Downey Production Company with wife Susan Downey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000375","name":"Robert Downey Jr.","nicknames":["Bob","RDJ"],"idIMDB":"nm0000375"},"actorId":"nm0000375","character":"Tony Stark","urlCharacter":"http://www.imdb.com/character/ch0556868","main":true},{"actorName":"Gwyneth Paltrow","urlProfile":"http://www.imdb.com/name/nm0000569","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzIxOTQ1NTU1OV5BMl5BanBnXkFtZTcwMTQ4MDY0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 September 1972","placeOfBirth":" Los Angeles, California, USA","birthName":"Gwyneth Kate Paltrow","height":"5' 9\" (1.75 m)","bio":"A tall, wafer thin, delicate beauty, Gwyneth Kate Paltrow was born in Los Angeles, the daughter of noted producer and director Bruce Paltrow and Tony award-winning actress Blythe Danner. Her father was from a Jewish family, while her mother has German, and some English and Irish, ancestry. When Gwyneth was eleven, the family moved to Massachusetts, where her father began working in summer stock productions in the Berkshires. It was here that she received her early acting training under the tutelage of her parents. She graduated from the all-girls Spence School in New York City and moved to California where she attended the UC Santa Barbara, majoring in Art History. She soon quit, realizing it was not her passion. She made her film debut with a small part in Shout (1991) and for the next five years had featured roles in a mixed bag of film fare that included Flesh and Bone (1993); Mrs. Parker and the Vicious Circle (1994); Se7en (1995); Jefferson in Paris (1995); Moonlight and Valentino (1995); and The Pallbearer (1996). It was her performance in the title role of Emma Woodhouse in Emma (1996) that led to her being offered the role of Viola in Shakespeare in Love (1998), for which she was awarded the Golden Globe, Screen Actors Guild and Academy Awards for Best Actress in a Leading Role. She broke her much publicized engagement to actor Brad Pitt in 1997 citing as the reason the fact that neither she nor Pitt felt that they could pursue their respective careers and at the same time maintain a happy marriage. They remain good friends. Since then, her roles have included The Royal Tenenbaums (2001), Shallow Hal (2001), Sky Captain and the World of Tomorrow (2004), Iron Man (2008), Two Lovers (2008), and Country Strong (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzIxOTQ1NTU1OV5BMl5BanBnXkFtZTcwMTQ4MDY0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000569","name":"Gwyneth Paltrow","nicknames":["Gwynnie"],"idIMDB":"nm0000569"},"actorId":"nm0000569","character":"Pepper Potts","urlCharacter":"http://www.imdb.com/character/ch0033333","main":true},{"actorName":"Don Cheadle","urlProfile":"http://www.imdb.com/name/nm0000332","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDMxNDM3MzY5N15BMl5BanBnXkFtZTcwMjkzOTY4MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1964","placeOfBirth":" Kansas City, Missouri, USA","birthName":"Donald Frank Cheadle","height":"5' 8½\" (1.74 m)","bio":"Donald Frank Cheadle was born in Kansas City, Missouri on November 29, 1964. His childhood found him moving from city to city with his family: mother Bettye (North), a teacher, father Donald Frank Cheadle, Sr., a clinical psychologist, sister Dawn, and brother Colin. After graduating high school in Denver, Colorado, Cheadle attended and graduated from the California Institute of the Arts with a Bachelor¹s Degree in Fine Arts. Encouraged by his college friends, he attended a variety of auditions and landed a recurring role on the hit series Fame (1982), which led to feature film roles in Dennis Hopper's Colors (1988) and John Irvin's Hamburger Hill (1987). Early in his career, Cheadle was named Best Supporting Actor by the Los Angeles Film Critics for his breakout performance opposite Denzel Washington in Devil in a Blue Dress (1995). His subsequent film credits include: Traitor (2008), an international thriller which he produced, starring opposite Guy Pearce; Kasi Lemmons's Talk to Me (2007), with Chiwetel Ejiofor; the 2006 Oscar-winning Best Picture, Collision (2004), which Cheadle also produced; Hotel Rwanda (2004), for which his performance garnered Oscar, Golden Globe, Broadcast Film Critics and Screen Actors Guild award nominations for Best Actor; Steven Soderbergh's Ocean's Eleven (2001), Ocean's Twelve (2004) and Ocean's Thirteen (2007), starring Brad Pitt and George Clooney; Mike Binder's Reign Over Me (2007) with Adam Sandler; the Academy Award-winning Traffic (2000) and Out of Sight (1998), with George Clooney and Jennifer Lopez, both films also directed by Soderbergh; Paul Thomas Anderson's acclaimed Boogie Nights (1997) with Julianne Moore and Mark Wahlberg; Bulworth (1998), directed by and starring Warren Beatty; Swordfish (2001), with John Travolta and Halle Berry; Mission to Mars (2000) with Tim Robbins and Gary Sinise; John Singleton's Rosewood (1997), for which Cheadle earned an NAACP Image Award nomination; Brett Ratner's The Family Man (2000), starring Nicolas Cage; and the independent features Manic (2001) and Things Behind the Sun (2001). Cheadle was honored by the CineVegas Film Festival and the Los Angeles Film Festival and received ShoWest's Male Star of the Year award. He is also well-recognized for his television work, including his portrayal of Sammy Davis Jr. in HBO's The Rat Pack (1998), for which he received a Golden Globe Award and a Best Supporting Actor Emmy nomination. That same year, he also received an Emmy nomination for his starring role in HBO's adaptation of the best-selling novel A Lesson Before Dying (1999), opposite Cicely Tyson and Mekhi Phifer. He also starred for HBO in Eriq La Salle's Rebound: The Legend of Earl 'The Goat' Manigault (1996). Cheadle's TV series credits include his two-year stint in David E. Kelley's acclaimed series Picket Fences (1992), a guest-starring role on ER (1994) (earning yet another Emmy nomination) and a regular role on The Golden Palace (1992) He also starred in the live television broadcast of Fail Safe (2000) opposite George Clooney, James Cromwell, Brian Dennehy, Richard Dreyfuss and Harvey Keitel. He also co-executive produced the TV version of Crash (2008). His most recent big screen appearances have been in Antoine Fuqua's ensemble crime thriller Brooklyn's Finest (2009) and Jon Favreau's Iron Man 2 (2010), another mainstream breakthrough where he played Lt. Col. James 'Rhodey' Rhodes, replacing Terrence Howard from the first film. L'Irlandais (2011), an art-house hit directed by John Michael McDonagh and co-starring Brendan Gleeson, followed. Cheadle stars in House of Lies (2012) on Showtime. Late in 2012, he was seen in Flight (2012), Robert Zemeckis's return to live-action filmmaking. In 2013, he reprised his role as Rhodey in Iron Man 3 (2013). Among his projects in development is a movie based on the life of jazz legend Miles Davis. A talented musician who plays saxophone, writes music and sings, he is also an accomplished stage actor and director and was nominated for a Grammy Award in 2004 for Best Spoken Word Album for his narration/dramatization of the Walter Mosley novel \"Fear Itself\". Other notable off-stage achievements include the 2007 BET Humanitarian Award for the cause of the people of Darfur and Rwanda, and sharing the Summit Peace Award by the Nobel Peace Prize Laureates in Rome with George Clooney for their work in Darfur.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDMxNDM3MzY5N15BMl5BanBnXkFtZTcwMjkzOTY4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000332","name":"Don Cheadle","idIMDB":"nm0000332"},"actorId":"nm0000332","character":"Lt. Col. James 'Rhodey' Rhodes","urlCharacter":"http://www.imdb.com/character/ch0033332","main":true},{"actorName":"Scarlett Johansson","urlProfile":"http://www.imdb.com/name/nm0424060","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTUwMDYwNl5BMl5BanBnXkFtZTcwNTUyNzc3Nw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1984","placeOfBirth":" New York City, New York, USA","birthName":"Scarlett Ingrid Johansson","height":"5' 3\" (1.6 m)","bio":"Scarlett Ingrid Johansson was born in New York City. Her mother, Melanie Sloan, is from a Jewish family from the Bronx, and her father, Karsten Johansson, is a Danish-born architect, from Copenhagen. She has a sister, Vanessa Johansson, who is also an actress, a brother, Adrian, a twin brother, Hunter Johansson, born three minutes after her, and a paternal half-brother, Christian. Her grandfather was writer Ejner Johansson. Johansson began acting during childhood, after her mother started taking her to auditions. She made her professional acting debut at the age of eight in the off-Broadway production of \"Sophistry\" with Ethan Hawke, at New York's Playwrights Horizons. She would audition for commercials but took rejection so hard her mother began limiting her to film tryouts. She made her film debut at the age of nine, as John Ritter's character's daughter in the fantasy comedy North (1994). Following minor roles in Just Cause (1995), as the daughter of Sean Connery and Kate Capshaw's character, and If Lucy Fell (1996), she played the role of Amanda in Manny & Lo (1996). Her performance in Manny & Lo garnered a nomination for the Independent Spirit Award for Best Lead Female, and positive reviews, one noting, \"[the film] grows on you, largely because of the charm of ... Scarlett Johansson\", while San Francisco Chronicle critic Mick LaSalle commentated on her \"peaceful aura\", and wrote, \"If she can get through puberty with that aura undisturbed, she could become an important actress.\". After appearing in minor roles in Fall (1997) and Home Alone 3 (1997), Johansson garnered widely spread attention for her performance in The Horse Whisperer (1998), directed by Robert Redford, where she played Grace MacLean, a teenager traumatized by a riding accident. She received a nomination for the Chicago Film Critics Association Award for Most Promising Actress for the film. In 1999, she appeared in My Brother the Pig (1999) and in the music video for Mandy Moore's single, \"Candy\". Although the film was not a box office success, she received praise for her breakout role in Ghost World (2001), credited with \"sensitivity and talent [that] belie her age\". She was also featured in the Coen Brothers' dark drama The Man Who Wasn't There (2001), opposite Billy Bob Thornton and Frances McDormand. She appeared in the horror comedy Eight Legged Freaks (2002) with David Arquette and Kari Wuhrer. In 2003, she was nominated for two Golden Globe Awards, one for drama (Girl with a Pearl Earring (2003)) and one for comedy (Lost in Translation (2003)), her breakout role, starring opposite Bill Murray, and receiving rave reviews and a Best Actress Award at the Venice Film Festival. Her film roles include the critically acclaimed Weitz brothers' film In Good Company (2004), as well as starring opposite John Travolta in A Love Song for Bobby Long (2004), which garnered her a third Golden Globe Award nomination. She dropped out of Mission: Impossible III (2006) due to scheduling conflicts. Her next film role was in The Island (2005) alongside Ewan McGregor which earned weak reviews from U.S. critics. After this, she appeared in Woody Allen's Match Point (2005) and was nominated again for a Golden Globe Award. In May 2008, she released her album \"Anywhere I Lay My Head\", a collection of Tom Waits covers featuring one original song. Also that year, she starred in Frank Miller's The Spirit (2008), the Woody Allen film Vicky Cristina Barcelona (2008), and played Mary Boleyn opposite Natalie Portman in The Other Boleyn Girl (2008). Since then, she has appeared as part of an ensemble cast in the romantic comedy He's Just Not That Into You (2009), the action superhero film Iron Man 2 (2010), the comedy-drama We Bought a Zoo (2011) and started as the original scream queen, Janet Leigh, in Hitchcock (2012). She then played her character, Black Widow, in the blockbuster action films The Avengers (2012), Captain America: The Winter Soldier (2014), Avengers: Age of Ultron (2015), Captain America: Civil War (2016), and Avengers: Infinity War (2018), and also headlined the science-fiction thriller Lucy (2014), a box office success. With more than a decade of work already under her belt, Scarlett has proven to be one of Hollywood's most talented young actresses. Scarlett and Canadian actor Ryan Reynolds were engaged in May 2008 and married in September of that same year. In 2010, the couple announced their separation, and subsequently divorced in 2011. In 2013, she became engaged to French journalist Romain Dauriac, the couple married in 2014, and have one daughter, Rose Dorothy Dauriac. In January 2017, the couple announced their separation, and subsequently divorced in March of that same year.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTUwMDYwNl5BMl5BanBnXkFtZTcwNTUyNzc3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0424060","name":"Scarlett Johansson","idIMDB":"nm0424060"},"actorId":"nm0424060","character":"Natalie Rushman / Natasha Romanoff","urlCharacter":"http://www.imdb.com/character/ch0183355","main":true},{"actorName":"Sam Rockwell","urlProfile":"http://www.imdb.com/name/nm0005377","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NTM3MzE5NF5BMl5BanBnXkFtZTcwMjg4NDMwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1968","placeOfBirth":" Daly City, California, USA","birthName":"Sam Rockwell","height":"5' 8\" (1.73 m)","bio":"Sam Rockwell was born on November 5, 1968, in San Mateo, California, the child of two actors, Pete Rockwell and Penny Hess. The family moved to New York when he was two years old, living first in the Bronx and later in Manhattan. When Sam was five years old, his parents split up, at which point he and his father moved to San Francisco, where he subsequently grew up, while summers and other times were spent with his mother in New York. He made his acting debut when he was ten years old, alongside his mother, and later attended J Eugene McAteer High School in a program called SOTA. While still in high school, he got his first big break when he appeared in the independent film Clownhouse (1989). The plot revolved around three escaped mental patients who dressed up as clowns and terrorized three brothers home alone--Sam played the eldest of the brothers. His next big break was supposed to have come when he was slated to star in a short-lived NBC TV-series called Dream Street (1989), but he was soon fired. After graduating from high school, Sam returned to New York for good and for two years he had private training at the William Esper Acting Studio. During this period he appeared in a variety of roles, such as the ABC Afterschool Specials (1972): Over the Limit (1990) (TV) and HBO's Lifestories: Families in Crisis (1992): Dead Drunk: The Kevin Tunell Story (Season 1 Episode 7: 15 March 1993); the head thug in Teenage Mutant Ninja Turtles (1990); and a guest-star turn in an Emmy-winning episode of Law & Order (1990), while working a string of regular day jobs and performing in plays. In 1994, a Miller Ice beer commercial finally enabled him to quit his other jobs to concentrate on his acting career, which culminated in him having five movies out by 1996: Basquiat (1996); The Search for One-eye Jimmy (1994); Glory Daze (1995); Mercy (1995); and Box of Moon Light (1996). It was the latter film that would prove to be his real break-out in the industry. In Tom DiCillo's film, he found himself playing an eccentric named the Kid, a man-child living in a half-built mobile home in the middle of nowhere with a penchant for dressing like Davy Crockett, who manages to bring some much-needed chaos into the life of an electrical engineer played by John Turturro. The movie was not a box-office success, but it managed to generate a lot of critical acclaim for itself and Sam. In 1997 he found himself the star of another critically lauded film, Lawn Dogs (1997). Once again he portrayed a societal outcast as Trent, a working-class man living in a trailer, earning a living mowing lawns inside a wealthy, gated Kentucky community. Soon Trent finds himself befriended by 10-year-old Devon (Mischa Barton), and the movie deals with the difficulties in their friendship and the outside world. He also gave strong performances in the quirky independent comedy Safe Men (1998), in which he plays one half of a pretty awful singing duo (the other half being played by Steve Zahn) that gets mistaken for two safe-crackers by Jewish gangsters; and the offbeat hit-man trainee in Jerry and Tom (1998) against Joe Mantegna. After a few smaller appearances in films such as Woody Allen's Celebrity (1998) and the 1999 version of A Midsummer Night's Dream (1999), in which he played Francis Flute, he had larger parts in two of the bigger hit movies to emerge in 1999: The Green Mile (1999) and Galaxy Quest (1999), wowing audiences and critics alike with his chameleon-like performances as a crazed killer in the former and a goofy actor in the latter. More recently, he appeared in another string of mainstream films, most notably as Eric Knox in Charlie's Angels (2000) and as Zaphod Beeblebrox in The Hitchhiker's Guide to the Galaxy (2005), while continuing to perform in smaller independent movies. After more than ten years in the business, Sam has earned his success.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NTM3MzE5NF5BMl5BanBnXkFtZTcwMjg4NDMwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005377","name":"Sam Rockwell","idIMDB":"nm0005377"},"actorId":"nm0005377","character":"Justin Hammer","urlCharacter":"http://www.imdb.com/character/ch0066439","main":true},{"actorName":"Mickey Rourke","urlProfile":"http://www.imdb.com/name/nm0000620","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MzYwNDA2MF5BMl5BanBnXkFtZTcwNDYzMjg4Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1952","placeOfBirth":" Schenectady, New York, USA","birthName":"Philip Andre Rourke Jr.","height":"5' 11\" (1.8 m)","bio":"Mickey Rourke was born Phillip Andre Rourke, Jr. on September 16, 1952, in Schenectady, New York, the son of Annette (Cameron) and Phillip Andre Rourke. His father was of Irish and German descent, and his mother was of French-Canadian, English, and German ancestry. When he was six years old, his parents divorced. A year later, his mother married Eugene Addis, a Miami Beach police officer, and moved to Miami Shores, Florida. After graduating from Horace Mann Junior High School, Rourke's family moved to a house located on 47th Street and Prairie Avenue in Miami Beach. In 1969 Rourke attended Miami Beach Senior High School, where he played second-string first baseman under coach Skip Berkman. He also acted in a school play, \"The Serpent,\" directed by legendary \"Teacher To The Stars\" Jay W. Jensen. In 1971 he graduated from Miami Beach Senior High School, and after working for a short time as a bus boy at the famed Forge Restaurant on Miami Beach, Rourke moved back to New York to seek out a career in acting. Rourke's teenage years were more aimed toward sports more than acting. He took up self-defense training at the Boys Club of Miami. It was there he learned boxing skills and decided on an amateur career. At the age of 12, Rourke won his first boxing match as an 118-pound bantamweight, defeating Javier Villanueva. Some of his early matches were fought as Andre Rourke. He continued his boxing training at the famed 5th Street Gym in Miami Beach,soon joining the Police Athletic League boxing program. In 1969 Rourke, now weighing 140 pounds, sparred with former World Welterweight champion Luis Rodriguez. Rodriguez was the number one-rated middleweight boxer in the world and was training for his match with world champion Nino Benvenuti. Rourke claims to have received a concussion in this sparring match. In 1971, at the Florida Golden Gloves, Rourke received another concussion from a boxing match. Doctors told him to take a year off and rest. In 1972 Rourke knocked out Ron Robinson in 18 seconds and John Carver in 39 seconds. On Aug. 20, 1973, Rourke knocked out 'Sherman \"Big Train\"' Bergman' in 31 seconds. Shortly after, Rourke decided to retire from amateur boxing. From 1964 to 1973, Rourke compiled an amateur boxing record of 27 wins (17 by knockout) and 3 defeats. At one point, he reportedly scored 12 consecutive first-round knockouts. As an amateur, Rourke had been friendly with pro-boxer Tommy Torino. When Rourke decided to return to boxing as a professional in 1991, Torino promoted some of Rourke's fights. Rourke was trained by former pro-boxer Freddie Roach at Miami Beach's 5th Street Gym and the Outlaw Boxing Club Gym in Los Angeles. He made $250 for his pro debut, but by the end of his second year of boxing, he had earned a million dollars. In June 1994, Rourke appeared on the cover of World Boxing Magazine. He sparred with world champions James Toney, John David Jackson, and Tommy Morrison. Rourke wished to have 16 professional fights and then fight for a world title. However, he retired in 1994 after eight bouts and never got his desired title fight. His boxing career resulted in severe facial injuries that required a number of operations to repair his damaged face. Rourke went back to acting but worked in relative obscurity until he won a Golden Globe Award for his role as Randy \"The Ram\" Robinson in The Wrestler (2008). He was nominated for Best Actor, as well, but lost.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MzYwNDA2MF5BMl5BanBnXkFtZTcwNDYzMjg4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000620","name":"Mickey Rourke","idIMDB":"nm0000620"},"actorId":"nm0000620","character":"Ivan Vanko","urlCharacter":"http://www.imdb.com/character/ch0387578","main":true},{"actorName":"Samuel L. Jackson","urlProfile":"http://www.imdb.com/name/nm0000168","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NTQwMTYxNl5BMl5BanBnXkFtZTYwMjA1MzY1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 December 1948","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Samuel Leroy Jackson","height":"6' 2½\" (1.89 m)","bio":"Samuel L. Jackson is an American producer and highly prolific actor, having appeared in over 100 films, including Die Hard with a Vengeance (1995), Unbreakable (2000), Shaft (2000), Formula 51 (2001), Black Snake Moan (2006), Des serpents dans l'avion (2006), and the Star Wars prequel trilogy (1999-2005), as well as the Marvel Cinematic Universe. Samuel Leroy Jackson was born in Washington, D.C., to Elizabeth (Montgomery) and Roy Henry Jackson. He was raised by his mother, a factory worker. Jackson was active in the black student movement. In the seventies, he joined the Negro Ensemble Company (together with Morgan Freeman). In the eighties, he became well-known after three movies made by Spike Lee: Do the Right Thing (1989), Mo' Better Blues (1990) and Jungle Fever (1991). He achieved prominence and critical acclaim in the early 1990s with films such as Patriot Games (1992), Amos & Andrew (1993), True Romance (1993), Jurassic Park (1993), and his collaborations with director Quentin Tarantino, including Pulp Fiction (1994), Jackie Brown (1997), and later Django Unchained (2012). Going from supporting player to leading man, his performance in Pulp Fiction (1994) gave him an Oscar nomination for his character Jules Winnfield, and he received a Silver Berlin Bear for his part as Ordell Robbi in Jackie Brown (1997). Jackson usually played bad guys and drug addicts before becoming an action hero, co-starring with Bruce Willis in Die Hard with a Vengeance (1995) and Geena Davis in The Long Kiss Goodnight (1996). With Jackson's permission, his likeness was used for the Ultimate version of the Marvel Comics character, Nick Fury. He later did a cameo as the character in a post-credits scene from Iron Man (2008), and went on to sign a nine-film commitment to reprise this role in future films, including major roles in Iron Man 2 (2010), The Avengers (2012), Captain America: The Winter Soldier (2014) and Avengers: Age of Ultron (2015) and minor roles in Thor (2011) and Captain America: The First Avenger (2011). He has also portrayed the character in the second and final episodes of the first season of the TV show, Marvel's Agents of S.H.I.E.L.D. (2013). He has provided his voice to several animated films, television series and video games, including the roles of Lucius Best / Frozone in Pixar's film The Incredibles (2004), Mace Windu in Star Wars: The Clone Wars (2008), Afro Samurai in the anime television series Afro Samurai (2007), and Frank Tenpenny in the video game Grand Theft Auto: San Andreas (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NTQwMTYxNl5BMl5BanBnXkFtZTYwMjA1MzY1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000168","name":"Samuel L. Jackson","nicknames":["Sam","King of Cool","Mr Cool"],"idIMDB":"nm0000168"},"actorId":"nm0000168","character":"Nick Fury","urlCharacter":"http://www.imdb.com/character/ch0020752","main":true},{"actorName":"Clark Gregg","urlProfile":"http://www.imdb.com/name/nm0163988","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjYyNjAwNDUyOV5BMl5BanBnXkFtZTgwOTc5NzgyNjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 April 1962","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Robert Clark Gregg","height":"5' 9\" (1.75 m)","bio":"Clark Gregg was born on April 2, 1962 in Boston, Massachusetts, USA as Robert Clark Gregg. He is an actor and writer, known for The Avengers (2012), Agents of S.H.I.E.L.D. (2013) and The New Adventures of Old Christine (2006). He has been married to Jennifer Grey since July 21, 2001. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjYyNjAwNDUyOV5BMl5BanBnXkFtZTgwOTc5NzgyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0163988","name":"Clark Gregg","idIMDB":"nm0163988"},"actorId":"nm0163988","character":"Agent Coulson","urlCharacter":"http://www.imdb.com/character/ch0037737","main":true},{"actorName":"John Slattery","urlProfile":"http://www.imdb.com/name/nm0805476","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4OTIyNDY5MV5BMl5BanBnXkFtZTgwODM2OTQyMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 August 1962","placeOfBirth":" Boston, Massachusetts, USA","birthName":"John M. Slattery Jr.","height":"5' 10\" (1.78 m)","bio":"John Slattery was born and raised in Boston, Massachusetts, the son of Joan (Mulhern), a CPA, and John \"Jack\" Slattery, a leather merchant, both of Irish descent. John landed his first TV gig on the 1988 series Dirty Dozen: The Series (1988) and has worked steadily since then. His television career has included the short-lived series Under Cover (1991), Homefront (1991), Maggie (1998) and Feds (1997); and the mini-series A Woman of Independent Means (1995) with Sally Field and From the Earth to the Moon (1998), in which he played Walter Mondale. By having recurring roles on Will & Grace (1998) as Will's big brother, \"Sam\"; Judging Amy (1999) as Amy's estranged husband; and Sex and the City (1998) as a very kinky politician, John has become one of the most in-demand character actors. In 2001, he had a role on NBC's comedy-drama Ed (2000), where he played the confident, cool, aloof high school principal \"Dennis Martino\". This role earned him much notoriety, and made him the subject of debate among Ed (2000) fans. John has also had a long, successful and diverse career in the theater. He made his theater debut in the 1989 play \"The Lisbon Traviata\", which also starred Nathan Lane. He has had several successful collaborations with the playwright Richard Greenberg and appeared in the author's \"The Extra Man\", \"Night and Her Stars\" and \"Three Days of Rain\", for which he earned critical praise for his dual roles of father and son. In 1993, John made his Broadway debut starring opposite Nathan Lane in Neil Simon's \"Laughter on the 23rd Floor\". Returning to the theater in 2000, John starred in a revival of Harold Pinter's \"Betrayal\". Making his feature film debut in 1996, John had a small role in the movie City Hall (1996). He then appeared in the movies Eraser (1996), Where's Marlowe? (1998), Traffic (2000), and the Anthony Hopkins/Chris Rock vehicle Bad Company (2002)_, before finding greater fame as one of the stars of the television series Mad Men (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4OTIyNDY5MV5BMl5BanBnXkFtZTgwODM2OTQyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0805476","name":"John Slattery","idIMDB":"nm0805476"},"actorId":"nm0805476","character":"Howard Stark","urlCharacter":"http://www.imdb.com/character/ch0108491","main":true},{"actorName":"Garry Shandling","urlProfile":"http://www.imdb.com/name/nm0788009","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODkzMzAxMDMzOV5BMl5BanBnXkFtZTgwNzE2NDM0ODE@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1949","placeOfBirth":" Chicago, Illinois, USA","birthName":"Garry Emmanuel Shandling","height":"5' 10½\" (1.79 m)","bio":"Garry Shandling was born on November 29, 1949 in Chicago, Illinois, USA as Garry Emmanuel Shandling. He was a writer and actor, known for What Planet Are You From? (2000), The Larry Sanders Show (1992) and Over the Hedge (2006). He died on March 24, 2016 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODkzMzAxMDMzOV5BMl5BanBnXkFtZTgwNzE2NDM0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0788009","name":"Garry Shandling","idIMDB":"nm0788009"},"actorId":"nm0788009","character":"Senator Stern","urlCharacter":"http://www.imdb.com/character/ch0143804","main":true},{"actorName":"Paul Bettany","urlProfile":"http://www.imdb.com/name/nm0079273","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwODg1MTA5Ml5BMl5BanBnXkFtZTcwNDQwMTQxMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 May 1971","placeOfBirth":" Harlesden, London, England, UK","height":"6' 3½\" (1.92 m)","bio":"Paul Bettany was born in Harlesden, London, England, into a theatre family. His father, Thane Bettany, is still an actor, but his mother, Anne Kettle, has retired from acting. His maternal grandmother, Olga Gwynne (her maiden and stage name), was a successful actress, while his maternal grandfather, Lesley Kettle, was a musician and promoter. He has an older sister who is a writer. Paul was brought up in North West London and, after the age of nine, in Hertfordshire (Brookmans Park). Immediately after finishing at Drama Centre London, he went into the West End to join the cast of \"An Inspector Calls\", though when asked to go on tour with this play, he chose to stay in England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwODg1MTA5Ml5BMl5BanBnXkFtZTcwNDQwMTQxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0079273","name":"Paul Bettany","idIMDB":"nm0079273"},"actorId":"nm0079273","character":"JARVIS","urlCharacter":"http://www.imdb.com/character/ch0498784","main":true},{"actorName":"Kate Mara","urlProfile":"http://www.imdb.com/name/nm0544718","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWUyOWE1MGUtNzdlYy00YmRkLWE1NmUtOWU1ODAxNDQ5YmUxXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1983","placeOfBirth":" Bedford, New York, USA","birthName":"Kate Rooney Mara","height":"5' 2\" (1.57 m)","bio":"Kate Mara is an American actress. She starred in the Netflix political drama, House of Cards (2013), as \"Zoe Barnes\" and appeared in the Fox TV series, 24 (2001) as computer analyst \"Shari Rothenberg\". She appeared in Brokeback Mountain (2005), We Are Marshall (2006), Shooter (2007), Transsiberian (2008), Stone of Destiny (2008), The Open Road (2009), Transcendence (2014), and Fantastic Four (2015) as the \"Invisible Woman\". She also appeared in the FX horror mini-series, American Horror Story: Murder House as \"Hayden McClaine\". Mara's film debut was in Random Hearts (1999), with Harrison Ford in 1999, directed by Sydney Pollack. In 2015, she also had a supporting role as astronaut \"Beth Johanssen\" in director Ridley Scott's film, The Martian (2015). In the same year, she also starred as \"Ashley Smith\" in the movie, Captive (2015). Kate was born in Bedford, New York. She is one of four children of Kathleen McNulty (Rooney) and NFL football team New York Giants executive Timothy Christopher Mara. Her younger sister is actress Rooney Mara. Her grandfathers were Wellington Mara, co-owner of the Giants, and Timothy Rooney, owner of Yonkers Raceway, and her grand-uncle is Steelers Chairman Dan Rooney, the former Ambassador to Ireland. She is the great-granddaughter of Art Rooney, Sr., the founder of the Pittsburgh Steelers football franchise. She often sings the national anthem at Giants home games. Her father has Irish, German, and French-Canadian ancestry, and her mother is of Irish and Italian descent. Mara graduated from high school a year early. She was accepted at the prestigious NYU Tisch School of the Arts but deferred for 3 consecutive years due to acting and singing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWUyOWE1MGUtNzdlYy00YmRkLWE1NmUtOWU1ODAxNDQ5YmUxXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0544718","name":"Kate Mara","idIMDB":"nm0544718"},"actorId":"nm0544718","character":"U.S. Marshal","urlCharacter":"http://www.imdb.com/character/ch0192666","main":true},{"actorName":"Leslie Bibb","urlProfile":"http://www.imdb.com/name/nm0004753","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NzAzNzE5N15BMl5BanBnXkFtZTcwMjMyODM0MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1974","placeOfBirth":" Bismarck, North Dakota, USA","birthName":"Leslie Louise Bibb","height":"5' 9\" (1.75 m)","bio":"Leslie Louise Bibb was born in Bismarck, North Dakota, on November 17, 1974, and raised in Nelson County, Virginia. Later she and her mother, along with her three older sisters, moved to Richmond, where Leslie attended an all-girls Catholic high school, St. Gertrude. In 1990 The Oprah Winfrey Show (1986) and the Elite Agency held a nationwide modeling search; Leslie's mother took photos of her then 16-year-old daughter and sent them in. Although Leslie wasn't impressed with the photos, the judges--John Casablancas, Naomi Campbell, Linda Evangelista and Iman--were, and they picked her as the winner. After finishing her junior year, Leslie flew to New York City and signed a contract with Elite. She modeled over the summer, and went on a trip to Japan. She returned home for her senior year and graduated in 1992, then decided to forgo a full-time modeling career to attend the University of Virginia. After a single semester, however, she dropped out and moved to New York City. She attended the William Esper acting studio for three years and took nine months off in which she did more modeling in Europe. Her photographs have appeared in such magazine as Maxim and FHM. Leslie had her first film role in the comedy Private Parts (1997), which was followed by her first television series (where she replaced the departed Susan Walters as the female lead) in the second season of The Big Easy (1996) on USA. Unfortunately, the show was canceled just months later. In 1999 she appeared as the lead character on the WB Network television series Popular (1999). The show was a success among teenagers, and led Leslie to more recognizable film roles, such as The Skulls (2000) and See Spot Run (2001). Most recently she has appeared as intern Erin Harkins in ER (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NzAzNzE5N15BMl5BanBnXkFtZTcwMjMyODM0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004753","name":"Leslie Bibb","nicknames":["The Bibbster, Lulu"],"idIMDB":"nm0004753"},"actorId":"nm0004753","character":"Christine Everhart","urlCharacter":"http://www.imdb.com/character/ch0033341","main":true},{"actorName":"Jon Favreau","urlProfile":"http://www.imdb.com/name/nm0269463","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzgwNDg0MTI1MF5BMl5BanBnXkFtZTcwNzg0MDQzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 October 1966","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Jonathan Kolia Favreau","height":"6' 1\" (1.85 m)","bio":"Initially an indie film favorite, actor Jon Favreau has progressed to strong mainstream visibility into the millennium and, after nearly two decades in the business, is still enjoying character stardom as well as earning notice as a writer/producer/director. The amiable, husky-framed actor with the tight, crinkly hair was born in Queens, New York on October 19, 1966, the only child of Madeleine, an elementary school teacher, and Charles Favreau, a special education teacher. His father has French-Canadian, German, and Italian ancestry, and his mother was from a Jewish family. He attended the Bronx High School of Science before furthering his studies at Queens College in 1984. Dropping out just credits away from receiving his degree, Jon moved to Chicago where he focused on comedy and performed at several Chicago improvisational theaters, including the ImprovOlympic and the Improv Institute. He also found a couple of bit parts in films. While there, he earned another bit role in the film, Rudy (1993), and met fellow castmate Vince Vaughn. Their enduring personal friendship would play an instrumental role in furthering both their professional careers within just a few years. Jon broke into TV with a role on the classic series, Seinfeld (1989) (as \"Eric the Clown\"). After filming rudimentary roles in the movies Mrs. Parker and the Vicious Circle (1994), Notes from Underground (1995) and Batman Forever (1995), he decided to do some risk taking by writing himself and friend Vaughn into what would become their breakthrough film. Swingers (1996), which he also co-produced, centers on Jon as a luckless, struggling actor type who is emotionally shattered after losing his girlfriend, but is pushed back into the L.A. social scene via the help of cool, worldly, outgoing actor/buddy Vaughn. These two blueprint roles went on to define the character types of both actors on film. In 1997, Jon appeared favorably on several episodes of the popular TV sitcom, Friends (1994), as \"Pete Becker\", the humdrum but extremely wealthy suitor for Courteney Cox's \"Monica\" character, and also appeared to fine advantage on the Tracey Takes On... (1996) comedy series. He later took on the biopic mini-movie, Rocky Marciano (1999), portraying the prizefighter himself in a highly challenging dramatic role and received excellent reviews. Other engagingly offbeat \"everyman\" films roles came Jon's way -- the ex-athlete in the working class film, Dogtown (1997); a soon-to-be groom whose bachelor party goes horribly awry in the comedy thriller Very Bad Things (1998); a newlywed opposite Famke Janssen in Love & Sex (2000); a wild and crazy linebacker in The Replacements (2000); as Ben Affleck's legal partner in Daredevil (2003); and another down-and-out actor in The Big Empty (2003). He wrote and directed himself and Vaughn as two fellow boxers who involve themselves in criminal activity in Made (2001). Both he and Vaughn produced. He also directed the highly popular Will Ferrell comedy, Elf (2003), in which he had a small part. Jon went on to re-team favorably with his friend, Vince Vaughn, who enjoyed a meteoric rise into the comedy star ranks, in such light-weight features as The Break-Up (2006), Tout... sauf en famille (2008) and Couples Retreat (2009), the last of which he co-wrote with Vaughn. He also made great strides as a producer/director in recent years with the exciting mega-box office action-packed Iron Man (2008), starring Robert Downey Jr. and its sequel, Iron Man 2 (2010). Favreau's marriage to Joya Tillem on November 24, 2000, produced son Max and two daughters, Madeleine and Brighton Rose. Joya is the niece of KGO (AM) lawyer and talk show host, Len Tillem. On the sly, the actor/writer/producer/director enjoys playing on the World Poker Tour.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzgwNDg0MTI1MF5BMl5BanBnXkFtZTcwNzg0MDQzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0269463","name":"Jon Favreau","nicknames":["Favs"],"idIMDB":"nm0269463"},"actorId":"nm0269463","character":"Happy Hogan","urlCharacter":"http://www.imdb.com/character/ch0036534","main":true},{"actorName":"Christiane Amanpour","urlProfile":"http://www.imdb.com/name/nm0023927","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3Nzg1MjE3Ml5BMl5BanBnXkFtZTYwNzQ5OTI4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 January 1958","placeOfBirth":" London, England, UK","height":"5' 7¼\" (1.71 m)","bio":"Christiane Amanpour was born on January 12, 1958 in London, England. She is known for her work on War Photographer (2001), Veillées d'armes (1994) and 60 Minutes (1968). She has been married to James Rubin since August 8, 1998. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3Nzg1MjE3Ml5BMl5BanBnXkFtZTYwNzQ5OTI4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0023927","name":"Christiane Amanpour","idIMDB":"nm0023927"},"actorId":"nm0023927","character":"Christiane Amanpour","urlCharacter":"http://www.imdb.com/character/ch0464267","main":true}],"seasons":[],"idIMDB":"tt1228705","urlIMDB":"http://www.imdb.com/title/tt1228705","business":{"budget":{"money":"$200,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$128,122,480","country":"USA","day":"09","month":"05","year":"2010","remarks":"4,380 Screens"},{"money":"£7,664,732","country":"UK","day":"02","month":"05","year":"2010","remarks":"521 Screens"},{"money":"PHP 103,159,599","country":"Philippines","day":"02","month":"05","year":"2010","remarks":"132 Screens"},{"money":"RUR 225,584,879","country":"Russia","day":"02","month":"05","year":"2010","remarks":"915 Screens"}],"gross":[{"money":"$312,433,331","country":"USA","day":"19","month":"08","year":"2010","remarks":""},{"money":"$312,057,433","country":"USA","day":"15","month":"08","year":"2010","remarks":""},{"money":"$311,806,181","country":"USA","day":"08","month":"08","year":"2010","remarks":""},{"money":"$311,417,007","country":"USA","day":"01","month":"08","year":"2010","remarks":""},{"money":"$310,840,824","country":"USA","day":"25","month":"07","year":"2010","remarks":""},{"money":"$310,018,590","country":"USA","day":"18","month":"07","year":"2010","remarks":""},{"money":"$309,237,294","country":"USA","day":"11","month":"07","year":"2010","remarks":""},{"money":"$308,530,297","country":"USA","day":"04","month":"07","year":"2010","remarks":""},{"money":"$306,943,647","country":"USA","day":"27","month":"06","year":"2010","remarks":""},{"money":"$304,210,329","country":"USA","day":"20","month":"06","year":"2010","remarks":""},{"money":"$299,282,390","country":"USA","day":"13","month":"06","year":"2010","remarks":""},{"money":"$291,429,870","country":"USA","day":"06","month":"06","year":"2010","remarks":""},{"money":"$279,653,149","country":"USA","day":"30","month":"05","year":"2010","remarks":""},{"money":"$251,026,061","country":"USA","day":"23","month":"05","year":"2010","remarks":""},{"money":"$211,200,876","country":"USA","day":"16","month":"05","year":"2010","remarks":""},{"money":"$128,122,480","country":"USA","day":"09","month":"05","year":"2010","remarks":""},{"money":"£20,923,193","country":"UK","day":"13","month":"06","year":"2010","remarks":""},{"money":"£20,686,508","country":"UK","day":"06","month":"06","year":"2010","remarks":""},{"money":"£19,975,518","country":"UK","day":"30","month":"05","year":"2010","remarks":""},{"money":"£19,109,368","country":"UK","day":"23","month":"05","year":"2010","remarks":""},{"money":"£17,905,902","country":"UK","day":"16","month":"05","year":"2010","remarks":""},{"money":"£15,090,463","country":"UK","day":"09","month":"05","year":"2010","remarks":""},{"money":"£7,664,732","country":"UK","day":"02","month":"05","year":"2010","remarks":""},{"money":"$623,933,331","country":"Worldwide","day":"19","month":"08","year":"2010","remarks":""},{"money":"PHP 304,523,328","country":"Philippines","day":"06","month":"06","year":"2010","remarks":""},{"money":"PHP 301,681,326","country":"Philippines","day":"30","month":"05","year":"2010","remarks":""},{"money":"PHP 269,932,052","country":"Philippines","day":"16","month":"05","year":"2010","remarks":""},{"money":"PHP 222,177,406","country":"Philippines","day":"09","month":"05","year":"2010","remarks":""},{"money":"PHP 103,159,599","country":"Philippines","day":"02","month":"05","year":"2010","remarks":""},{"money":"$1,132,347","country":"Portugal","day":"26","month":"03","year":"2015","remarks":""},{"money":"RUR 431,005,042","country":"Russia","day":"30","month":"05","year":"2010","remarks":""},{"money":"RUR 428,982,770","country":"Russia","day":"23","month":"05","year":"2010","remarks":""},{"money":"RUR 420,443,598","country":"Russia","day":"16","month":"05","year":"2010","remarks":""},{"money":"RUR 370,680,039","country":"Russia","day":"09","month":"05","year":"2010","remarks":""},{"money":"RUR 225,584,879","country":"Russia","day":"02","month":"05","year":"2010","remarks":""},{"money":"€5,088,063","country":"Spain","day":"16","month":"05","year":"2010","remarks":""},{"money":"€4,351,396","country":"Spain","day":"09","month":"05","year":"2010","remarks":""}],"weekendGross":[{"money":"$126,878","country":"USA","day":"15","month":"08","year":"2010","remarks":"178 Screens"},{"money":"$193,515","country":"USA","day":"08","month":"08","year":"2010","remarks":"224 Screens"},{"money":"$301,277","country":"USA","day":"01","month":"08","year":"2010","remarks":"286 Screens"},{"money":"$438,975","country":"USA","day":"25","month":"07","year":"2010","remarks":"330 Screens"},{"money":"$561,740","country":"USA","day":"18","month":"07","year":"2010","remarks":"362 Screens"},{"money":"$392,755","country":"USA","day":"11","month":"07","year":"2010","remarks":"333 Screens"},{"money":"$875,834","country":"USA","day":"04","month":"07","year":"2010","remarks":"522 Screens"},{"money":"$1,436,378","country":"USA","day":"27","month":"06","year":"2010","remarks":"1,169 Screens"},{"money":"$2,872,252","country":"USA","day":"20","month":"06","year":"2010","remarks":"1,612 Screens"},{"money":"$4,521,206","country":"USA","day":"13","month":"06","year":"2010","remarks":"2,305 Screens"},{"money":"$7,918,708","country":"USA","day":"06","month":"06","year":"2010","remarks":"3,007 Screens"},{"money":"$21,076,239","country":"USA","day":"30","month":"05","year":"2010","remarks":"3,804 Screens"},{"money":"$26,361,258","country":"USA","day":"23","month":"05","year":"2010","remarks":"4,177 Screens"},{"money":"$52,041,005","country":"USA","day":"16","month":"05","year":"2010","remarks":"4,390 Screens"},{"money":"$128,122,480","country":"USA","day":"09","month":"05","year":"2010","remarks":"4,380 Screens"},{"money":"£113,566","country":"UK","day":"13","month":"06","year":"2010","remarks":"186 Screens"},{"money":"£226,314","country":"UK","day":"06","month":"06","year":"2010","remarks":"264 Screens"},{"money":"£511,895","country":"UK","day":"30","month":"05","year":"2010","remarks":"353 Screens"},{"money":"£523,266","country":"UK","day":"23","month":"05","year":"2010","remarks":"427 Screens"},{"money":"£1,595,612","country":"UK","day":"16","month":"05","year":"2010","remarks":"491 Screens"},{"money":"£3,214,776","country":"UK","day":"09","month":"05","year":"2010","remarks":"522 Screens"},{"money":"£7,664,732","country":"UK","day":"02","month":"05","year":"2010","remarks":"521 Screens"},{"money":"PHP 189,565","country":"Philippines","day":"06","month":"06","year":"2010","remarks":"10 Screens"},{"money":"PHP 2,874,266","country":"Philippines","day":"30","month":"05","year":"2010","remarks":"32 Screens"},{"money":"PHP 29,581,226","country":"Philippines","day":"16","month":"05","year":"2010","remarks":"132 Screens"},{"money":"PHP 71,671,249","country":"Philippines","day":"09","month":"05","year":"2010","remarks":"132 Screens"},{"money":"PHP 103,159,599","country":"Philippines","day":"02","month":"05","year":"2010","remarks":"132 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"06","month":"04","year":"2009","remarks":null},{"money":null,"country":null,"day":"18","month":"07","year":"2009","remarks":null}],"copyrightHolder":"MVL Film Finance LLC"},"technical":{"runtime":["2 hr 4 min (124 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex 435 Advanced, Panavision Primo Lenses","CANON EOS 5D Mark II (some shots)","Panavision Panaflex Millennium XL2, Panavision Primo and Angenieux Optimo Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA (processing and prints)","EFILM Digital Laboratories, Hollywood (CA), USA (digital intermediate)"],"filmLength":["3,399 m (Sweden)","3,442 m (Portugal, 35 mm)"],"negativeFormat":["35 mm (also horizontal) (Kodak Vision2 50D 5201, Vision2 200T 5217, Vision3 500T 5219, Vision 500T 5279)","HD"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)","VistaVision (source format) (visual effects)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383, Vision Premier 2393)","70 mm (horizontal) (IMAX DMR blow-up) (Kodak Vision 2383)","D-Cinema"]},"rating":"7.0","metascore":"57","filmingLocations":[{"location":"D.C. Stages, 1360 East 6th Street, Downtown, Los Angeles, California, USA"}],"rated":"PG-13","awards":[{"award":"Academy Awards, USA 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Achievement in Visual Effects","names":[{"name":"Janek Sirrs","id":"nm0802938","role":null},{"name":"Ben Snow","id":"nm0811240","role":null},{"name":"Ged Wright","id":"nm2261997","role":null},{"name":"Daniel Sudick","id":"nm0837203","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Science Fiction Film","names":[]},{"category":"Best Actor","names":[{"name":"Robert Downey Jr.","id":"nm0000375","role":null}]},{"category":"Best Supporting Actress","names":[{"name":"Scarlett Johansson","id":"nm0424060","role":null}]},{"category":"Best Special Effects","names":[{"name":"Ged Wright","id":"nm2261997","role":null},{"name":"Janek Sirrs","id":"nm0802938","role":null},{"name":"Ben Snow","id":"nm0811240","role":null},{"name":"Daniel Sudick","id":"nm0837203","role":null}]}]}]},{"award":"Alliance of Women Film Journalists 2011","titlesAwards":[{"titleAwardOutcome":"Nominated EDA Special Mention Award","categories":[{"category":"Sequel That Shouldn't Have Been Made","names":[]}]}]},{"award":"ASCAP Film and Television Music Awards 2011","titlesAwards":[{"titleAwardOutcome":"Won ASCAP Award","categories":[{"category":"Top Box Office Films","names":[{"name":"John Debney","id":"nm0002201","role":null}]}]}]},{"award":"BET Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated BET Award","categories":[{"category":"Best Actor","names":[{"name":"Don Cheadle","id":"nm0000332","role":null}]}]}]},{"award":"California on Location Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated COLA","categories":[{"category":"Location Team of the Year - Features","names":[{"name":"Steve Woroniecki","id":"nm3245982","role":"key assistant location manager"}]}]}]},{"award":"Golden Schmoes Awards 2010","titlesAwards":[{"titleAwardOutcome":"Won Golden Schmoes","categories":[{"category":"Biggest Disappointment of the Year","names":[]}]},{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Best Special Effects of the Year","names":[]},{"category":"Best T&amp;A of the Year","names":[{"name":"Scarlett Johansson","id":"nm0424060","role":null}]}]}]},{"award":"Hollywood Film Awards 2010","titlesAwards":[{"titleAwardOutcome":"Won Hollywood Film Award","categories":[{"category":"Visual Effects of the Year","names":[]}]}]},{"award":"Hollywood Post Alliance, US 2010","titlesAwards":[{"titleAwardOutcome":"Nominated HPA Awards","categories":[{"category":"Outstanding Compositing - Feature Film","names":[{"name":"Jon Alexander","id":"nm0018524","role":null},{"name":"Patrick Brennan","id":"nm0107371","role":null},{"name":"Amy Shepard","id":"nm0791595","role":null},{"name":"Jason Porter","id":"nm1482105","role":null},{"name":"Industrial Light & Magic (ILM)","id":null,"role":null}]}]}]},{"award":"IGN Summer Movie Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated IGN Award","categories":[{"category":"Best Comic-Book Adaptation","names":[]}]}]},{"award":"Italian Online Movie Awards (IOMA) 2011","titlesAwards":[{"titleAwardOutcome":"Nominated IOMA","categories":[{"category":"Best Special Effects (Migliori effetti speciali)","names":[]}]}]},{"award":"Kids' Choice Awards, USA 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Blimp Award","categories":[{"category":"Favorite Butt Kicker","names":[{"name":"Robert Downey Jr.","id":"nm0000375","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing - Sound Effects and Foley in a Feature Film","names":[{"name":"Frank E. Eulner","id":"nm0262361","role":"supervising sound editor"},{"name":"Christopher Boyes","id":"nm0102110","role":"supervising sound editor, sound designer"},{"name":"James Likowski","id":"nm0510160","role":"supervising foley editor"},{"name":"Dennie Thorpe","id":"nm0861658","role":"foley artist"},{"name":"Jana Vance","id":"nm0888527","role":"foley artist"},{"name":"Ken Fischer","id":"nm0279017","role":"sound effects editor"},{"name":"J.R. Grubbs","id":"nm0344197","role":"sound effects editor"},{"name":"Scott Guitteau","id":"nm0347593","role":"sound effects editor"},{"name":"Kyrsten Mate","id":"nm0131144","role":"sound effects editor"},{"name":"Andrea Gard","id":"nm0306583","role":"foley editor"},{"name":"Luke Dunn Gielmuda","id":"nm0317355","role":"foley editor"},{"name":"Robert Shoup","id":"nm0795254","role":"foley editor"}]}]}]},{"award":"MTV Movie Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best Villain","names":[{"name":"Mickey Rourke","id":"nm0000620","role":null}]}]}]},{"award":"People's Choice Awards, USA 2011","titlesAwards":[{"titleAwardOutcome":"Won People's Choice Award","categories":[{"category":"Favorite Action Movie","names":[]}]},{"titleAwardOutcome":"Nominated People's Choice Award","categories":[{"category":"Favorite On-Screen Team","names":[{"name":"Robert Downey Jr.","id":"nm0000375","role":null},{"name":"Don Cheadle","id":"nm0000332","role":null}]},{"category":"Favorite Movie","names":[]}]}]},{"award":"Satellite Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Satellite Award","categories":[{"category":"Best Visual Effects","names":[{"name":"Janek Sirrs","id":"nm0802938","role":null},{"name":"Ben Snow","id":"nm0811240","role":null},{"name":"Ged Wright","id":"nm2261997","role":null}]},{"category":"Best Sound (Mixing &amp; Editing)","names":[{"name":"Frank E. Eulner","id":"nm0262361","role":null},{"name":"Christopher Boyes","id":"nm0102110","role":null},{"name":"Lora Hirschberg","id":"nm0386567","role":null}]}]}]},{"award":"Scream Awards 2010","titlesAwards":[{"titleAwardOutcome":"Won Scream Award","categories":[{"category":"Best Science Fiction Actress","names":[{"name":"Scarlett Johansson","id":"nm0424060","role":null}]},{"category":"Best Villain","names":[{"name":"Mickey Rourke","id":"nm0000620","role":null}]},{"category":"Best Superhero","names":[{"name":"Robert Downey Jr.","id":"nm0000375","role":null}]}]},{"titleAwardOutcome":"Nominated Scream Award","categories":[{"category":"Best Science Fiction Actor","names":[{"name":"Robert Downey Jr.","id":"nm0000375","role":null}]},{"category":"Best Science Fiction Actress","names":[{"name":"Gwyneth Paltrow","id":"nm0000569","role":null}]},{"category":"Best Supporting Actor","names":[{"name":"Don Cheadle","id":"nm0000332","role":null}]},{"category":"The Ultimate Scream","names":[]},{"category":"Best Ensemble","names":[]},{"category":"Best Cameo","names":[{"name":"Stan Lee","id":"nm0498278","role":null}]},{"category":"Best Science Fiction Movie","names":[]},{"category":"Fight Scene of the Year","names":[]},{"category":"Best F/X","names":[]},{"category":"Best Comic Book Movie","names":[]}]}]},{"award":"SFX Awards, UK 2011","titlesAwards":[{"titleAwardOutcome":"Nominated SFX Award","categories":[{"category":"Best Actor","names":[{"name":"Robert Downey Jr.","id":"nm0000375","role":null}]}]}]},{"award":"Teen Choice Awards 2010","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie: Villain","names":[{"name":"Mickey Rourke","id":"nm0000620","role":null}]},{"category":"Choice Movie: Dance","names":[{"name":"Robert Downey Jr.","id":"nm0000375","role":null}]},{"category":"Choice Movie: Fight","names":[{"name":"Robert Downey Jr.","id":"nm0000375","role":null},{"name":"Don Cheadle","id":"nm0000332","role":null}]},{"category":"Choice Movie Actress: Sci-Fi","names":[{"name":"Scarlett Johansson","id":"nm0424060","role":null}]},{"category":"Choice Movie Actress: Sci-Fi","names":[{"name":"Gwyneth Paltrow","id":"nm0000569","role":null}]},{"category":"Choice Movie Actor: Sci-Fi","names":[{"name":"Robert Downey Jr.","id":"nm0000375","role":null}]},{"category":"Choice Movie: Sci-Fi","names":[]}]}]},{"award":"Visual Effects Society Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated VES Award","categories":[{"category":"Outstanding Visual Effects in a Visual Effects-Driven Feature Motion Picture","names":[{"name":"Ben Snow","id":"nm0811240","role":null},{"name":"Ged Wright","id":"nm2261997","role":null},{"name":"Janek Sirrs","id":"nm0802938","role":null},{"name":"Susan Pickett","id":"nm0681916","role":null}]},{"category":"Outstanding Created Environment in a Live Action Feature Motion Picture","names":[{"name":"Giles Hancock","id":"nm1619353","role":null},{"name":"Richard Bluff","id":"nm1363090","role":null},{"name":"Todd Vaziri","id":"nm0891445","role":null},{"name":"Aaron McBride","id":"nm1185663","role":null}]},{"category":"Outstanding Models and Miniatures in a Feature Motion Picture","names":[{"name":"Bruce Holcomb","id":"nm1232740","role":null},{"name":"Ron Woodall","id":"nm1176891","role":null},{"name":"John Goodson","id":"nm0329372","role":null},{"name":"John Walker","id":"nm0907877","role":null}]}]}]}],"votes":"550,805","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"},{"idCompany":"co0047120","name":"Marvel Entertainment"},{"idCompany":"co0051941","name":"Marvel Studios"}],"keywords":{"keywords":["hammer","military","revenge","monaco","billionaire","superhero","war machine the character","flying man","flying superhero","human versus robot","human versus machine","power armor","f1 race car","man wearing an eyepatch","artificial intelligence","s.h.i.e.l.d.","strong female character","power suit","2010s","2000s","head mounted display","smart house","three word title","numbered sequel","number 2 in title","name in title","character appears on magazine cover","fistfight","mixed martial arts","hand to hand combat","spy","female assassin","assassin","rocket launcher","prison escape","missile","newspaper headline","washington d.c.","marvel cinematic universe","subjective camera","character's point of view camera shot","one man army","muscle shirt","good versus evil","brawl","arms dealer","weapons designer","soldier","party","anti hero","hologram","new york city","snow","female spy","government agent","film reel","prison","camera focus on female butt","russian spy","pinched butt","scientist","computer hacker","timebomb","engineer","microfilm","undercover","secret agent","martial arts","blood on camera lens","scene after end credits","crater","new mexico","medal","kiss","torso cut in half","laser","exploding body","shot in the chest","woman punching a man","punched in the stomach","queens new york city","child in peril","hanged man","bodyguard","quitting a job","american flag","changing clothes in a car","helmet","driver","expo","birthday","shield","diagram","one eyed man","sliced in two","eye patch","undercover agent","doughnut shop","knocked out","drunkenness","machine gun","pistol","birthday party","private jet","neck breaking","explosion","faked death","bag over head","head butt","body landing on a car","crushed by a car","blood","car crash","electrocution","race","model","punched in the face","boxing ring","personal assistant","poison","humiliation","passport","bleeped dialogue","speech","business rivalry","super computer","new york","dying man","falling from height","jumping from an airplane","murder","whip","bare chested male","news report","subtitled scene","russian","father son relationship","moscow russia","blockbuster","surprise after end credits","gatling gun","exploding car","strawberry","senator","lieutenant colonel","ceo","secretary","rescue","robot","super villain","digit in title","parrot","bird","based on comic book","action hero","returning character with different actor","marvel comics","sequel","second part","marvel entertainment","based on comic","death of father","number in title","character name in title","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 01:55:14"}}