{"data":{"movies":[{"title":"Pirates of the Caribbean: On Stranger Tides","originalTitle":"","year":"2011","releaseDate":"20110520","directors":[{"name":"Rob Marshall","id":"nm0551128"}],"writers":[{"name":"Ted Elliott","id":"nm0254645"},{"name":"Terry Rossio","id":"nm0744429"}],"runtime":"136 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MjkwODI3Nl5BMl5BanBnXkFtZTcwNjcwMDk4NA@@._V1.jpg","countries":["USA","UK"],"languages":["English","Spanish"],"genres":["Action","Adventure","Fantasy"],"plot":"Captain Jack Sparrow (Depp) crosses paths with a woman from his past (Cruz), and he's not sure if it's love -- or if she's a ruthless con artist who's using him to find the fabled Fountain of Youth. When she forces him aboard the Queen Anne's Revenge, the ship of the formidable pirate Blackbeard (McShane), Jack finds himself on an unexpected adventure in which he doesn't know who to fear more: Blackbeard or the woman from his past.","simplePlot":"Jack Sparrow and Barbossa embark on a quest to find the elusive fountain of youth, only to discover that Blackbeard and his daughter are after it too.","actors":[{"actorName":"Johnny Depp","urlProfile":"http://www.imdb.com/name/nm0000136","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODU5Nzk2OV5BMl5BanBnXkFtZTcwMzI2ODgyNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 June 1963","placeOfBirth":" Owensboro, Kentucky, USA","birthName":"John Christopher Depp II","height":"5' 10\" (1.78 m)","bio":"Johnny Depp is perhaps one of the most versatile actors of his day and age in Hollywood. He was born John Christopher Depp II in Owensboro, Kentucky, on June 9, 1963, to Betty Sue (Wells), who worked as a waitress, and John Christopher Depp, a civil engineer. Depp was raised in Florida. He dropped out of school when he was 15, and fronted a series of music-garage bands, including one named 'The Kids'. However, it was when he married Lori Anne Allison (Lori A. Depp) that he took up the job of being a ballpoint-pen salesman to support himself and his wife. A visit to Los Angeles, California, with his wife, however, happened to be a blessing in disguise, when he met up with actor Nicolas Cage, who advised him to turn to acting, which culminated in Depp's film debut in the low-budget horror film, A Nightmare on Elm Street (1984), where he played a teenager who falls prey to dream-stalking demon Freddy Krueger. In 1987 he shot to stardom when he replaced Jeff Yagher in the role of undercover cop Tommy Hanson in the popular TV series 21 Jump Street (1987). In 1990, after numerous roles in teen-oriented films, his first of a handful of great collaborations with director Tim Burton came about when Depp played the title role in Edward Scissorhands (1990). Following the film's success, Depp carved a niche for himself as a serious, somewhat dark, idiosyncratic performer, consistently selecting roles that surprised critics and audiences alike. He continued to gain critical acclaim and increasing popularity by appearing in many features before re-joining with Burton in the lead role of Ed Wood (1994). In 1997 he played an undercover FBI agent in the fact-based film Donnie Brasco (1997), opposite Al Pacino; in 1998 he appeared in Fear and Loathing in Las Vegas (1998), directed by Terry Gilliam; and then, in 1999, he appeared in the sci-fi/horror film The Astronaut's Wife (1999). The same year he teamed up again with Burton in Sleepy Hollow (1999), brilliantly portraying Ichabod Crane. Depp has played many characters in his career, including another fact-based one, Insp. Fred Abberline in From Hell (2001). He stole the show from screen greats such as Antonio Banderas in the finale to Robert Rodriguez's \"mariachi\" trilogy, Once Upon a Time in Mexico (2003). In that same year he starred in the marvelous family blockbuster Pirates of the Caribbean: The Curse of the Black Pearl (2003), playing a character that only the likes of Depp could pull off: the charming, conniving and roguish Capt. Jack Sparrow. The film's enormous success has opened several doors for his career and included an Oscar nomination. He appeared as the central character in the Stephen King-based movie, Secret Window (2004); as the kind-hearted novelist James Barrie in the factually-based Finding Neverland (2004), where he co-starred with Kate Winslet; and Rochester in the British film, The Libertine (2004). Depp collaborated again with Burton in a screen adaptation of Roald Dahl's novel, Charlie and the Chocolate Factory (2005), and later in Alice in Wonderland (2010) and Dark Shadows (2012). Off-screen, Depp has dated several female celebrities, and has been engaged to Sherilyn Fenn, Jennifer Grey, Winona Ryder and Kate Moss. He was married to Lori Anne Allison in 1983, but divorced her in 1985. Depp has two children with French singer/actress Vanessa Paradis: Lily-Rose Melody, born in 1999 and Jack, born in 2002. He married actress/producer Amber Heard in 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODU5Nzk2OV5BMl5BanBnXkFtZTcwMzI2ODgyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000136","name":"Johnny Depp","nicknames":["Mr. Stench","Colonel"],"idIMDB":"nm0000136"},"actorId":"nm0000136","character":"Jack Sparrow","urlCharacter":"http://www.imdb.com/character/ch0001274","main":true},{"actorName":"Penélope Cruz","urlProfile":"http://www.imdb.com/name/nm0004851","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0Mzc1MTc2OF5BMl5BanBnXkFtZTcwMzE4MzQxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1974","placeOfBirth":" Alcobendas, Madrid, Spain","birthName":"Penélope Cruz Sánchez","height":"5' 6\" (1.68 m)","bio":"Known outside her native country as the \"Spanish enchantress\", Penélope Cruz Sánchez was born in Madrid to Eduardo Cruz, a retailer, and Encarna Sánchez, a hairdresser. As a toddler, she was already a compulsive performer, re-enacting TV commercials for her family's amusement, but she decided to focus her energies on dance. After studying classical ballet for nine years at Spain's National Conservatory, she continued her training under a series of prominent dancers. At 15, however, she heeded her true calling when she bested more than 300 other girls at a talent agency audition. The resulting contract landed her several roles in Spanish TV shows and music videos, which in turn paved the way for a career on the big screen. Cruz made her movie debut in The Greek Labyrinth (1993) (The Greek Labyrinth), then appeared briefly in the Timothy Dalton thriller Framed (1992). Her third film was the Oscar-winning Belle Epoque (1992), in which she played one of four sisters vying for the love of a handsome army deserter. The film also garnered several Goyas, the Spanish equivalent of the Academy Awards. Her resume continued to grow by three or four films each year, and soon Cruz was a leading lady of Spanish cinema. Live Flesh (1997) (Live Flesh) offered her the chance to work with renowned Spanish director Pedro Almodóvar (who would later be her ticket to international fame), and the same year she was the lead actress in the thriller/drama/mystery/sci-fi film Open Your Eyes (1997), a huge hit in Spain that earned eight Goyas (though none for Cruz). Her luck finally changed in 1998, when the movie-industry comedy La fille de tes rêves (1998) won her a Best Actress Goya. Cruz made a few more forays into English-language film, but her first big international hit was Almodóvar's All About My Mother (1999), in which she played an unchaste but well-meaning nun. As the film was showered with awards and accolades, Cruz suddenly found herself in demand on both sides of the Atlantic. Her next big project was Woman on Top (2000), an American comedy about a chef with bewitching culinary skills and a severe case of motion sickness. While in the US, she also signed up to star opposite Johnny Depp in the drug-trafficking drama Blow (2001) and opposite Matt Damon in Billy Bob Thornton's All the Pretty Horses (2000). Cruz says she's wary of being typecast as a beautiful young damsel, but it's hard to imagine disguising her wide-eyed charms and generous nature. Fortunately, with Cameron Crowe's Vanilla Sky (2001) (a remake of Open Your Eyes (1997)) and a John Madden collaboration looming in her future, Damsel Penelope isn't likely to disappear just yet.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0Mzc1MTc2OF5BMl5BanBnXkFtZTcwMzE4MzQxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004851","name":"Penélope Cruz","nicknames":["Madonna of Madrid","Pe"],"idIMDB":"nm0004851"},"actorId":"nm0004851","character":"Angelica","urlCharacter":"http://www.imdb.com/character/ch0262531","main":true},{"actorName":"Geoffrey Rush","urlProfile":"http://www.imdb.com/name/nm0001691","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MjkxNDU0NV5BMl5BanBnXkFtZTcwOTk3MDQ0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1951","placeOfBirth":" Toowoomba, Queensland, Australia","birthName":"Geoffrey Roy Rush","height":"5' 11½\" (1.82 m)","bio":"Geoffrey Roy Rush was born on July 6, 1951, in Toowoomba, Queensland, Australia, to Merle (Bischof), a department store sales assistant, and Roy Baden Rush, an accountant for the Royal Australian Air Force. His mother was of German descent and his father had English, Irish, and Scottish ancestry. He was raised in Brisbane, Queensland, after his parents split up. Rush attended Everton Park State High School during his formative years. His early interest in the theatre led to his 1971 stage debut at age 20 in \"Wrong Side of the Moon\" with the Queensland Theatre Company. Known for his classical repertory work over the years, he scored an unexpected hit with his Queensland role as Snoopy in the musical \"You're a Good Man, Charlie Brown\". A few years later he moved to France to study but subsequently returned to his homeland within a short time and continued work as both actor and director with the Queensland company (\"June and the Paycock,\" \"Aladdin,\" \"Godspell,\" \"Present Laughter,\" \"The Rivals\"). In the 1980s Rush became a vital member of the State Theatre Company of South Australia and showed an equally strong range there in such productions as \"Revenger's Tragedy,\" \"A Midsummer Night's Dream,\" \"Mother Courage...and Her Children,\" \"Blood Wedding,\" \"Pal Joey,\" \"Twelfth Night\" and as The Fool in \"King Lear\". Rush made an inauspicious debut in films with the feature Hoodwink (1981), having little more than a bit part, and didn't carry off his first major role until playing Sir Andrew Aguecheek in a movie production of Twelfth Night (1987). Yet, he remained a durable presence on stage with acclaimed productions in \"The Diary of a Madman\" in 1989 and \"The Government Inspector\" in 1991. Rush suffered a temporary nervous breakdown in 1992 due to overwork and anguish over his lack of career advancement. Resting for a time, he eventually returned to the stage. Within a few years film-goers finally began taking notice of Geoffrey after his performance in Children of the Revolution (1996). This led to THE role of a lifetime as the highly dysfunctional piano prodigy David Helfgott in Shine (1996). Rush's astonishing tour-de-force performance won him every conceivable award imaginable, including the Oscar, Golden Globe, British Film Award and Australian Film Institute Award. \"Shine\" not only put Rush on the international film map, but atypically on the Hollywood \"A\" list as well. His rather homely mug was made fascinating by a completely charming, confident and captivating demeanor; better yet, it allowed him to more easily dissolve into a number of transfixing historical portrayals, notably his Walsingham in Elizabeth (1998), Marquis de Sade in Quills (2000), and Leon Trotsky in Frida (2002). He's also allowed himself to have a bit of hammy fun in such box office escapism as Mystery Men (1999), House on Haunted Hill (1999), The Banger Sisters (2002), Finding Nemo (2003) and Pirates of the Caribbean: The Curse of the Black Pearl (2003). More than validating his early film success, two more Oscar nominations came his way in the same year for Quills (2000) (best actor) and Shakespeare in Love (1998) (support actor) in 2000. Geoffrey's amazing versatility continues to impress, more recently as the manic, volatile comedy genius Peter Sellers in the biopic The Life and Death of Peter Sellers (2004). Rush's intermittent returns to the stage have included productions of \"Marat-Sade,\" \"Uncle Vanya,\" \"Oleanna,\" \"Hamlet\" and \"The Small Poppies\". In 2009 he made his Broadway debut in \"Exit the King\" co-starring Susan Sarandon. His marriage (since 1988) to Aussie classical actress Jane Menelaus produced daughter Angelica (1992) and son James (1995). Menelaus, who has also performed with the State Theatre of South Australia, has co-starred on stage with Rush in \"The Winter's Tale\" (1987), \"Troilus and Cressida\" (1989) and \"The Importance of Being Earnest\" (as Gwendolyn to his Jack Worthing). She also had a featured role in his film Quills (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MjkxNDU0NV5BMl5BanBnXkFtZTcwOTk3MDQ0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001691","name":"Geoffrey Rush","idIMDB":"nm0001691"},"actorId":"nm0001691","character":"Barbossa","urlCharacter":"http://www.imdb.com/character/ch0001222","main":true},{"actorName":"Ian McShane","urlProfile":"http://www.imdb.com/name/nm0574534","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGUzYmJiMmQtNTRlNC00ZWEwLTgzY2ItZDMwZTdkMGE4Zjc0L2ltYWdlXkEyXkFqcGdeQXVyNzE0OTI2MzY@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1942","placeOfBirth":" Blackburn, Lancashire, England, UK","height":"5' 7½\" (1.71 m)","bio":"From a lawless, foul-mouthed saloon owner in \"Deadwood\" to a tough no-nonsense British gangster in \"Sexy Beast,\" Ian McShane has virtually cornered the market on playing rogues, villains and all-around bad asses. A natural at portraying complex anti-heroes and charismatic heavies, the classically trained actor was born in Blackburn, Lancashire, England, to parents Irene (Cowley) and Harry McShane, a soccer player for Manchester United. McShane caught his first break in 1962 when he landed a lead role in \"The Wild and the Willing.\" McShane later revealed that he had ditched class at the Royal Academy of Dramatic Art to audition for the role. Since then, the award-winning actor has gone on to grab the attention of audiences and critics alike with his unforgettable portrayals of scoundrels, kings, killers, and thieves. Coming soon, McShane will be reprising his role as club owner/ex-assassin Winston opposite Keanu Reeves in \"John Wick: Chapter 2\" in the film by director Chad Stahelski. He plays Leland, a retired sheriff with violent tendencies, opposite Patrick Wilson in \"The Hollow Point,\" the gritty drama directed by Gonzalo López-Gallego. Also, expect to see McShane in the upcoming films \"Jawbone,\" \"Bolden!\" and opposite Michael Shannon in \"Pottersville.\" On television, McShane next stars as Mr. Wednesday in Neil Gaiman's \"American Gods,\" the highly-anticipated event series for Starz produced by Michael Green and Bryan Fuller. \"Actor. Icon. And now god. It is a goddamn delight to be collaborating with the incomparable Ian McShane,\" said Michael Green recently. McShane previously starred in the Michael Green series \"Kings\" for NBC. McShane will also be seen opposite Dr. Dre for Apple TV's first scripted series \"Vital Signs,\" a semi-autobiographical series loosely based on the hip-hop icon's life. McShane's formidable acting resume is as long as it is varied. McShane starred as the notoriously fearsome pirate Blackbeard opposite Johnny Depp in Disney's worldwide blockbuster hit \"Pirates of the Caribbean: On Stranger Tides.\" He starred as priest/prophet/warrior Amphiarus opposite Dwayne Johnson in MGM's \"Hercules,\" played lead dwarf Beith in the dark fantasy flick \"Snow White and the Huntsman,\" and portrayed good King Bramwell in Bryan Singer's modern-day fairytale \"Jack the Giant Slayer.\" McShane also appeared as Joe Strombel in Woody Allen's \"Scoop.\" His universally praised performance as tough guy Teddy Bass in the cult indie hit \"Sexy Beast\" led one London critic to dub McShane as \"The King of Cool.\" In a change of pace, he portrayed soft-spoken Meredith in the darkly perverse crime drama \"44 Inch Chest,\" a film in which McShane not only starred, but also produced. McShane has also had a long and diverse career on both British and American television. Earning considerable critical acclaim as the fierce yet charismatic Al Swearengen in the much-loved David Milch HBO series \"Deadwood,\" McShane went on to win the Golden Globe Award for Best Performance by an Actor in a Drama Series. His compelling and gritty portrayal also scored him nominations for both Emmy and SAG Awards. He went on to collect yet another Golden Globe nomination for Best Actor in a Miniseries for his riveting portrayal of the scheming, corrupt Waleran Bigod in Starz' Emmy-nominated \"Pillars of the Earth.\" McShane also won over viewers in FX's \"American Horror Story\" as the very bad Santa/serial killer Leigh Emerson and as cold-blooded billionaire Andrew Finney opposite Liev Schreiber in Showtime's acclaimed series \"Ray Donovan.\" More recently, he portrayed Sir Roger Scatcherd in the Julian Fellows' miniseries \"Dr. Thorne\" for ITV and also made an appearance as peacenik Brother Ray in HBO's juggernaut \"Game of Thrones.\" Earlier in his television career McShane produced and starred as the irresistible rogue antiques dealer in the acclaimed series \"Lovejoy\" for the BBC and A&E, even directing several episodes himself. The show was one of the first independent co-productions with the BBC and aired in both the U.S. and U.K. Other notable portrayals on television have included his appearance in the landmark, blockbuster miniseries \"Roots\" and as Ken Harrison in \"Whose Life is it Anyway?\" McShane also played Sejanus in the miniseries \"A.D.,\" the eponymous \"Disraeli,\" produced by Masterpiece Theater, and Judas in NBC's \"Jesus of Nazareth.\" An accomplished, award-wining stage actor, McShane made his West End debut in \"The Promise,\" co-starring Dame Judi Dench and Sir Ian McKellen. The play went on to open on Broadway the following year. McShane also charmed audiences in the West End musical \"The Witches of Eastwick,\" originating the role of the seductive, sex-obsessed Darryl Van Horne on stage in London. At the esteemed L.A. Matrix Theatre, McShane appeared in Harold Pinter's \"Betrayal,\" Larry Atlas' \"Yield of the Long Bond\", as well as in John Osborne's \"Inadmissible Evidence,\" picking up a couple of Los Angeles Drama Critics' Awards for Lead Performance in the process. In addition, McShane appeared in the 40th Anniversary revival of Harold Pinter's \"The Homecoming\" on Broadway. With his low, distinctive voice, McShane has also made his mark in film and television as a voiceover artist. He narrated Disney's \"The Sorcerer's Apprentice,\" brought life to the eccentric magician Mr. Bobinsky in \"Coraline,\" and added a sinister edge to Tai Lung in \"Kung Fu Panda.\" McShane has also let his rich baritone to \"The Golden Compass,\" as well as to \"Shrek The Third\" as the notorious Captain Hook.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGUzYmJiMmQtNTRlNC00ZWEwLTgzY2ItZDMwZTdkMGE4Zjc0L2ltYWdlXkEyXkFqcGdeQXVyNzE0OTI2MzY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0574534","name":"Ian McShane","idIMDB":"nm0574534"},"actorId":"nm0574534","character":"Blackbeard","urlCharacter":"http://www.imdb.com/character/ch0043873","main":true},{"actorName":"Kevin McNally","urlProfile":"http://www.imdb.com/name/nm0573618","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NzMzMjYwOV5BMl5BanBnXkFtZTcwMDkzOTk2OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 April 1956","placeOfBirth":" Bristol, England, UK","birthName":"Kevin Robert McNally","height":"5' 10\" (1.78 m)","bio":"Kevin McNally was born on April 27, 1956, in Bristol, England. He grew up in Birmingham where he attended Redhill and Mapledene Junior schools and Central Grammar School for Boys. At the age of 16, he got his first job at Birmingham Repertory Theatre. A year later he received a scholarship to the Royal Academy of Dramatic Art. In 1975 he won the Best Actor Bancroft Gold Medal for his stage performance. McNally's most notable stage performances in London's West End include his appearance as Alan Bennett opposite Maggie Smith in 'The Lady in the Van' and opposite Juliette Binoche in 'Naked'. He also starred as Richard in Terry Johnson's 'Dead Funny' at the Savoy Theatre. Since 1976 McNally has been involved in numerous TV productions beginning with his portrayal of the Roman ruler Castor, son of Tiberius, in the acclaimed BBC history series I, Claudius (1976) and his portrayal of Drake Carne in the popular series Poldark (1975). His career on television ascended after his work in Masada (1981) and in the cult TV series Doctor Who: The Twin Dilemma (1984). During the 1980s and 1990s McNally established himself as a reputable and versatile actor on both the British and American TV. He played a broad variety of leading and supporting characters ranging from the Soviet politician Kirov in Stalin (1992) to homicide detective Jack Taylor in Chiller (1995), and from an insecure son, Alan Hook, in TV series Dad (1997) to a convicted murderer James Hopkin in Bloodlines (2005). His portrayal of Frank Worsley in Shackleton (2002) as well as the role of Harry Woolf in Life on Mars (2006) are among his best known works for television. In 1977 McNally made his big screen debut as HMS Ranger Crewman in the James Bond adventure The Spy Who Loved Me (1977). After having played bit parts in more than twenty feature films, McNally shot to international fame as pirate Joshamee Gibbs, his best known film role, in Pirates of the Caribbean: The Curse of the Black Pearl (2003) and the sequel Pirates of the Caribbean: Dead Man's Chest (2006). He returned in the role Joshamee Gibbs in the third installment of the 'Pirates' franchise Pirates of the Caribbean: At World's End (2007). Kevin McNally has been enjoying a happy family life with Scottish actress Phyllis Logan and his two children. He resides with his family in Chiswick, London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NzMzMjYwOV5BMl5BanBnXkFtZTcwMDkzOTk2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0573618","name":"Kevin McNally","idIMDB":"nm0573618"},"actorId":"nm0573618","character":"Gibbs","urlCharacter":"http://www.imdb.com/character/ch0001230","main":true},{"actorName":"Sam Claflin","urlProfile":"http://www.imdb.com/name/nm3510471","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MDQxNDUwOF5BMl5BanBnXkFtZTgwNjY4NjI3NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 June 1986","placeOfBirth":" Ipswich, Suffolk, England, UK","birthName":"Samuel George Claflin","height":"5' 11\" (1.8 m)","bio":"English actor Sam Claflin was born in Ipswich, England, to Susan A. (Clarke), a classroom assistant, and Mark J. Claflin, a finance officer. As a child, he was football-mad, often going to see his favorite team, Norwich City. He was a talented footballer, playing for Norwich schools at city level and Norfolk county level. However, he suffered two broken ankles and at 16 gave up thinking about a footballing career. He took up performing arts and a teacher from Costessey High School was impressed with his performance in a school play, and encouraged him to take up drama. He joined the local youth group at Norwich's Theatre Royal and went on to gain entry to LAMDA drama school in 2006 graduating with a 3 year acting degree in 2009. He is the 3rd eldest of 4 boys, his older brothers Dan and Ben are not involved in drama but his younger brother Joe Claflin commenced at the same drama school in 2009 also doing a 3 year acting degree. In 2010, Clafin made his debut screen performances in two award-winning series, Les piliers de la terre (2010) and Any Human Heart (2010). His film debut came playing footballer Duncan Edwards, one of the 'Busby Babes', in United (2011). Clafin then came to the attention of cinemagoers across the world when he was cast as Philip in Pirates of the Caribbean: On Stranger Tides (2011). Various roles followed, including Jack in White Heat (2012) and Prince William in Snow White and the Huntsman (2012). He played Finnick Odair in the sequels The Hunger Games: Catching Fire (2013), The Hunger Games: Mockingjay - Part 1 (2014), and The Hunger Games: Mockingjay - Part 2 (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MDQxNDUwOF5BMl5BanBnXkFtZTgwNjY4NjI3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3510471","name":"Sam Claflin","nicknames":["Claf"],"idIMDB":"nm3510471"},"actorId":"nm3510471","character":"Philip","urlCharacter":"http://www.imdb.com/character/ch0190540","main":true},{"actorName":"Astrid Bergès-Frisbey","urlProfile":"http://www.imdb.com/name/nm2793591","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3ODUyODkyMV5BMl5BanBnXkFtZTcwMjIxOTUwNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1986","placeOfBirth":" Barcelona, Barcelona, Catalonia, Spain","height":"5' 7¼\" (1.71 m)","bio":"Astrid Berges-Frisbey was born in Barcelona, Spain. Her father is Spanish, and her mother, who is American, is of English and French descent. She is fluent in French, Spanish, and Catalan. Astrid Berges-Frisbey made her acting debut in 2007 on french television. In 2008, she made her feature debut in the French film Un barrage contre le Pacifique (2008) and since then has made other French films. In 2011, Berges-Frisbey made her English debut as the beautiful mermaid Syrena in Pirates of the Caribbean: On Stranger Tides (2011). She was personally picked by director Rob Marshall and producer Jerry Bruckheimer after a whirlwind of auditions in France, Hollywood, and the UK.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3ODUyODkyMV5BMl5BanBnXkFtZTcwMjIxOTUwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2793591","name":"Astrid Bergès-Frisbey","idIMDB":"nm2793591"},"actorId":"nm2793591","character":"Syrena","urlCharacter":"http://www.imdb.com/character/ch0215482","main":true},{"actorName":"Stephen Graham","urlProfile":"http://www.imdb.com/name/nm0334318","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE1NTc1NjM5OV5BMl5BanBnXkFtZTgwOTk3MDU0NzE@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 August 1973","placeOfBirth":" Liverpool, Merseyside, England, UK","birthName":"Stephen Graham Kelly","height":"5' 6\" (1.68 m)","bio":"Stephen Graham was born August 3, 1973, in the small town of Kirkby, Lancashire, to a pediatric nurse mother and a social worker father. His paternal grandfather was Jamaican, and one of his grandmothers was Swedish. After years of small parts, he finally got his big break in an unexpected way, playing the dim-witted Tommy in Guy Ritchie's film, Snatch (2000). Apparently, Graham didn't audition for the role as Tommy--one day, he accompanied a friend to the audition for Ritchie and was asked if he was next. When Graham replied \"no,\" Ritchie told the then-unknown actor, \"I like your face,\" and was asked if he could start work Monday. So much is to be said of this actor, who started his career with bit parts on ITV (he played Lee Sankey on Coronation Street (2006) in 1999 and was also cast in smaller films like Pit Fighter (2005). Graham also appeared in the critically acclaimed Gangs of New York (2002), directed by Martin Scorsese, and on television, playing Sgt. Myron 'Mike' Ranney in the HBO mini-series, \"Band of Brothers.\" The actor, though still relatively unknown, is climbing the ladder to the top very quickly, with roles in some of the most groundbreaking film and television projects.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE1NTc1NjM5OV5BMl5BanBnXkFtZTgwOTk3MDU0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0334318","name":"Stephen Graham","idIMDB":"nm0334318"},"actorId":"nm0334318","character":"Scrum","urlCharacter":"http://www.imdb.com/character/ch0249632","main":true},{"actorName":"Keith Richards","urlProfile":"http://www.imdb.com/name/nm0724189","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxOTI4NzkwNl5BMl5BanBnXkFtZTcwMTk5MjEyNQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1943","placeOfBirth":" Dartford, Kent, England, UK","height":"5' 8½\" (1.74 m)","bio":"Keith Richards is an internationally recognized iconic figure in contemporary culture and popular music as a singer, guitar player, songwriter, film actor, and public figure. He was voted 10th greatest guitarist of all time by Rolling Stone Magazine, and was elected to the Rock and Roll Hall of Fame in 1989, as founding member of the legendary rock band The Rolling Stones. Together with his song-writing partner, Mick Jagger, he wrote and recorded hundreds of songs, including their monster hit 'Satisfaction', one of the defining songs of the era. He was born on December 18, 1943, in Dartford, Kent, England, UK. His father, Bert Richards, a factory worker, was injured during the WWII. His mother, Doris (Dupree), introduced him to music of jazz, and also encouraged his singing performances with a choir in Westminster Abbey. Keith Richards met Mick Jagger when he attended primary school during the 1950s, albeit when they went into secondary schools they lost touch for a while. But one day in 1960 they accidentally met on a train and talked about starting up a band. Eventually, Richards and Jagger made their dream come true. They established one of the most legendary life-long songwriting partnerships, following the example of John Lennon and Paul McCartney's songwriting for The Beatles. Besides their main success in popular music and entertainment, Richards and Jagger had carried on their early image of unkempt and surly youth that many others would emulate, and spread their influence across traditional boundaries of genres and styles into filmmaking, art, fashion, and contemporary lifestyle, thus turning Jagger and Richards into cross-cultural trend-setters. Since The Rolling Stones were formed in 1962, Richards and Jagger were continuously absorbing from many musical styles and assimilated various genres and artistic influences, ultimately creating their very own inimitable style. Together they undergone transformation from semi-amateur local musicians to the leading international superstars. Both Richards and Jagger became poster boys for excess, however, they had survived ups and downs in their careers and personal lives, and remained the core of the band. Initially they shared a flat with the late Brian Jones in London, in 1962. The first lineup of the Stones consisted of Mick Jagger on lead vocal and harmonica Keith Richards on guitar, Bill Wyman on bass, Charlie Watts on drums and Brian Jones on guitar. In 1964 they released their first album titled \"The Rolling Stones.\" In 1965 Richards and Jagger wrote their single, \"The Last Time,\" that became their first number 1 hit in the UK. Then came \"Satisfaction\" (1965), which was composed by Keith Richards in his sleep, and with the addition of provocative lyrics by Mick Jagger it became the greatest hit and their calling card on each and every show. In 1966, after The Beatles stopped giving live performances, The Rolling Stones took over as the unofficial \"biggest touring band in the world\" for the next few years. During 1966-1969 they toured the world, and constantly updated their song-list with many great hits like \"Lets Spend the night together\" (1967), \"Sympathy for the Devil\" (1968) and \"Honky tonk woman\" (1969). The incredible international success of the Stones came with a sad side, caused by Brian's drug and alcohol abuse that impaired his speech and appearance, so the band-mates had to replace him. In July 1969, Brian Jones died of drowning in his swimming pool while having signs of drug overdose. Upon Richards's and Jagger's approval, guitarist Mick Taylor took Brian's place. Brian's death at age 27 made him one of the first members of the infamous \"27 Club\" of rock stars who died at that age. Although Brian's estrangement from his band-mates, and his numerous arrests were caused by his personal problems with drugs, both Richards and Jagger were blamed at the time for Brian's death. The loss of one of their founding members was a painful moment for the Stones. However, at the end of the 1960s their creativity reached the new highs. Their albums \"Beggars Banquet\" (1968) and \"Sticky Fingers\" (1971) were among the most popular albums they ever made, having such hits as \"Wild Horses\" and \"Brown Sugar.\" During the 1970s The Rolling Stones remained the biggest band in the world, albeit they were rivaled by the Led Zeppelin. The Stones made thousands of live performances and multi-million record sales with hits like \"Angie\" (1973), \"It's Only Rock and Roll\" (1974), \"Hot Stuff\" (1976) and \"Respectable\" (1978). At that time both Keith Richards and Mick Jagger had individual ambitions, and applied their untamed creativity in various projects outside the Stones. Keith released his own single. In 1974 Ron Wood had replaced Mick Taylor on guitar and Keith and Ron both played lead guitars. During the decade Keith Richards had a family crisis on his hands, and suffered through emotional pain and drug abuse, albeit it didn't stop him from being himself. In 1980 the group released \"Emotional Rescue\" which Keith Richards didn't care for, and the group didn't even tour to promote the album. In 1981 with the release of 'Tattoo You', the group went on a major world tour filling stadiums in the US and in Europe. In 1983 the Stones recorded the album \"Undercover\" at the Compass Point in Nassau and during this time Mick and Keith were having arguments over rights of the group. After having created tens of albums and over a hundred popular songs together, their legendary song-writing partnership was undergoing the most painful test: the bitter rivalry between two enormously talented and equally ambitious superstars. Outside of The Rolling Stones, Richards toured with The New Barbarians, and also was the front-man of the X-Pensive Winos in the 1980s. In 1985 Keith Richards took part in the \"Artists United Against Apartheid\" charity project, and has been a participant in many more charitable concerts ever since. In 1992 he released his solo album titled 'Main Offender', which got him back on the road with a promotional tour. Also during the tour he continued singing a few Stones songs. But individual career and solo performances did not bring Richards as much satisfaction as he experienced together with his writing partner. Eventually, Jagger and Richards got together in Barbados and started to write new songs for the album \"Steel Wheels.\" After the Stones recorded it they went back on the road. It was the first tour of The Rolling Stones in 7 years. But in 1992 Bill Wyman announced that he was going to leave the group. In 1993 Keith Richards and his band released an album and toured for a few months. However, his artistic and personal connection with the Stones had eventually prevailed, and Richards reunited with his former band-mates. In 1994 The Rolling Stones got back together again and recorded the album \"Voodoo Lounge\" and toured the world extensively. In 1995 an album of their warm up gig in a pub in Denmark was released. It was an acoustic live album called \"Stripped\". In 1997 they released the album \"Bridges to Babylon\" and started a new tour promoting the album. In 1998 a live album \"No Security\" was released. Their 1999 the tour ended and the group hasn't performed together until 2002. At that time Keith Richards continued playing guitar for various projects and artists, such as Norah Jones, and Aretha Franklin among others. Richards has been good friends with Johnny Depp, who modeled the character of Capt. Jack Sparrow after him, including his voice, his mannerisms, his personality, and aspects of his appearance. In return, Johnny Depp invited Keith Richards to play his father, Captain Teague, in the third installment of the \"Pirates\" franchise, Pirates of the Caribbean: At World's End (2007). The Rolling Stones have released 55 albums of original work and compilations, and sold over 200 million records word-wide during their career spanning over 45 years. \"The Stones\" played in all kinds of spaces from small clubs to big stadium arenas, they remained one of the biggest entertainment acts touring the world with a retinue of jet-set hangers-on. Their inimitable shows, no matter the best, or the worst, has been played with fire and emotion, giving their audiences the kind of music they do best - it's only rock'n roll. In 2007 they even rocked the Tsar's Winter Palace with fifty thousand fans in St. Petersburg, Russia, where the communist revolution took place. They gave more large-scale shows internationally than any other existing band in the world, culminating in their 2005-2007 \"A Bigger Band\" tour with 147 concerts, the highest grossing tour of all time with $559 million earned. At their shows, even if you don't shake your hips like Mick Jagger, just hold on to your hat as tears go by, and they can start you up and get you rocking. You can make it if you try. Since 1962, during the career spanning over 45 years, Keith Richards has been the lead guitarist and primary musical force behind The Rolling Stones, as well as songwriter for the band. He also continues making numerous guest performances as guitarist, as well as actor and producer active in various other projects. Besides his favorite Telecaster and Gibson guitars, Keith Richards owns a valuable collection of about one thousand vintage guitars of various brands, many of which he takes along on concert tours and studio gigs. Since Richards wrote the signature \"Satisfaction\" guitar riff, that was called by Newsweek \"five notes that took the world,\" his influence on popular music had never stopped. In his own words, Keith Richards has been dedicated to \"grow this music up\" beyond the theatrics of the rock's past and \"keep it fresh.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxOTI4NzkwNl5BMl5BanBnXkFtZTcwMTk5MjEyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0724189","name":"Keith Richards","nicknames":["Keef","The Human Riff"],"idIMDB":"nm0724189"},"actorId":"nm0724189","character":"Captain Teague","urlCharacter":"http://www.imdb.com/character/ch0001253","main":true},{"actorName":"Richard Griffiths","urlProfile":"http://www.imdb.com/name/nm0341743","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NDc2MjY4OF5BMl5BanBnXkFtZTcwODU5NjEzOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1947","placeOfBirth":" Thornaby-on-Tees, North Yorkshire, England, UK","birthName":"Richard Thomas Griffiths","height":"5' 9\" (1.75 m)","bio":"British character actor Richard Griffiths came from radio and the classical stage where he built up an early reputation as a Shakespearean clown, with larger-than-life portrayals of Henry VIII, Falstaff in \"The Merry Wives of Windsor\" and Bottom in \"A Midsummer Night's Dream\" with the Royal Shakespeare Company just a few of his standout credits. The son of deaf parents, he learned sign language at an early age and, interestingly enough, developed a talent for dialects which allowed him to show off in a number of ethnic portrayals. In films from 1975 both here and abroad, his better roles have been in both contemporary and period pieces, such as Gorky Park (1983), Withnail & I (1987), King Ralph (1991), Guarding Tess (1994), Sleepy Hollow (1999) and recently the 'Harry Potter' series as Uncle Vernon Dursley. Typically cast as comic relief in serious fare, he is well known in England for a number of comedy series including Pie in the Sky (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NDc2MjY4OF5BMl5BanBnXkFtZTcwODU5NjEzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341743","name":"Richard Griffiths","idIMDB":"nm0341743"},"actorId":"nm0341743","character":"King George","urlCharacter":"http://www.imdb.com/character/ch0062586","main":true},{"actorName":"Jonny Rees","urlProfile":"http://www.imdb.com/name/nm0254862","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNjY1NDYzMV5BMl5BanBnXkFtZTgwMDc2MjE0OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 March 1968","placeOfBirth":" Wigan, Lancashire, England, UK","height":"6' (1.83 m)","bio":"Jonny Rees stars in the western \"Forsaken\" as \"Tom Watson\" alongside Demi Moore and Donald and Kiefer Sutherland in theaters next summer. On the big screen Jonny is best known for his portrayal of \"Lieutenant Commander Groves\" in the \"Pirates of the Caribbean\" movies as well as starring in J.J. Abrams \"Star Trek,\" as \"Chief Engineer Olsen,\" the original chief engineer of the Star ship Enterprise. In 20145 Jonny formed a production company '\"Monkey Toes.\" The shingle's first project was the Sky television drama \"Marked,\" produced, written and directed by Jonny and starring Kiefer Sutherland and Stephen Fry, to great critical acclaim. He is set to direct the Michael Douglas movie, \"Franklin Square\" in the new year. Jonny joined the cast of 'Hawaii Five-0' in season five to play Thomas Farrow in a major recurring arc, was a regular on the Fox drama \"Touch\" as \"Trevor Wilcox,\" and played the villainous \"Michael Amador\" opposite Kiefer Sutherland in the 3rd season of the hit series \"24.\" He also co-starred opposite Angelina Jolie in \"Beowulf,\" with Brad Pitt in \"Mr. and Mrs. Smith,\" and alongside Leonardo DiCaprio and Kate Winslet in 'Titanic.' He is the voice of MZingo in the new \"Lion King\" series \"The Lion Guard\" as well as the voice of Valen Rudor in the Disney animated series \"Star Wars Rebels.\" Jonny's television credits include: \"Dexter,\" \"The X-Files,\" \"The Riches,\" \"Bones,\" \"Alcatraz,\" \"Star Trek: Deep Space Nine,\" \"The Closer,\" \"CSI,\" \"Nip/Tuck,\" \"Perception,\" \"Knight Rider,\" and \"Trust Me\" to name a few. Voice-over work includes multiple characters on \"Tom and Jerry,\" \"Star Wars: The Clone Wars,\" \"Batman: The Brave & the Bold,\" \"Sophia the First,\" \"Star Versus the Forces of Evil,\" \"Tron: Uprising,\" \"The Mummy,\" \"What's New, Scooby-Doo?\", \"The Boondocks,\" \"Ben 10,\" \"Annoying Orange,\" \"Phineas and Ferb,\" \"Teen Titans,\" and the animated feature films \"Garfield 2\" as \"Nigel,\" and \"Cars 2,\" as \"Sir Nigel Gearsley.\" Jonny has over 170 video-game credits to his name including the iconic series of: \"Call of Duty,\" \"God of War,\" \"Diablo,\" \"Uncharted,\" \"Dragon Age,\" \"Star Trek,\" \"Cars,\" \"Lord of the Rings,\" \"X-Men,\" and \"Medal of Honor,\" to name a few. He is also the voice of Rocket Raccoon for the \"Guardians of the Galaxy\" video games and animated show. His West End theatre credits include the role of \"Rusty\" in the original cast of Sir Andrew Lloyd Webber's New \"Starlight Express,\" directed by Trevor Nunn; the alternate Chris in the original cast of \"Miss. Saigon,\" directed by Nicholas Hytner and the role of \"Fat Sam\" in \"Bugsy Malone,\" directed by Mickey Dolenz of Monkees fame. Jonny has performed for H.R.H Queen Elizabeth II at Saint Paul's Cathedral as well as 2 Royal Command Performances and his recordings can be heard extensively throughout Europe where he has achieved 3 Top 20 singles. Jonny's children are proudest of the fact that he is the voice of the Skylander's character \"Jet-Vac.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNjY1NDYzMV5BMl5BanBnXkFtZTgwMDc2MjE0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0254862","name":"Jonny Rees","idIMDB":"nm0254862"},"actorId":"nm0254862","character":"Groves","urlCharacter":"http://www.imdb.com/character/ch0214815","main":true},{"actorName":"Damian O'Hare","urlProfile":"http://www.imdb.com/name/nm1400933","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDkyNjkxMDg1N15BMl5BanBnXkFtZTcwMzQ2MzA5OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 August 1977","placeOfBirth":" Belfast, Northern Ireland, UK","bio":"Damian O'Hare was born on August 13, 1977 in Belfast, Northern Ireland. He is an actor, known for Pirates of the Caribbean: The Curse of the Black Pearl (2003), Pirates of the Caribbean: On Stranger Tides (2011) and Hatfields & McCoys (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDkyNjkxMDg1N15BMl5BanBnXkFtZTcwMzQ2MzA5OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1400933","name":"Damian O'Hare","idIMDB":"nm1400933"},"actorId":"nm1400933","character":"Gillette","urlCharacter":"http://www.imdb.com/character/ch0001268","main":true},{"actorName":"Óscar Jaenada","urlProfile":"http://www.imdb.com/name/nm1049982","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODkwMDU3MzU2NF5BMl5BanBnXkFtZTgwMzA0NTY1MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 May 1975","placeOfBirth":" Esplugues de Llobregat, Barcelona, Catalonia, Spain","birthName":"Óscar Jaenada Gajo","height":"5' 10\" (1.78 m)","bio":"Óscar Jaenada was born on May 4, 1975 in Esplugues de Llobregat, Barcelona, Catalonia, Spain as Óscar Jaenada Gajo. He is an actor, known for The Shallows (2016), Pirates of the Caribbean: On Stranger Tides (2011) and The Losers (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODkwMDU3MzU2NF5BMl5BanBnXkFtZTgwMzA0NTY1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1049982","name":"Óscar Jaenada","idIMDB":"nm1049982"},"actorId":"nm1049982","character":"The Spaniard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anton Lesser","urlProfile":"http://www.imdb.com/name/nm0504320","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NDYzODU1MF5BMl5BanBnXkFtZTcwOTAwMDIxOA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1952","placeOfBirth":" Birmingham, England, UK","height":"5' 5½\" (1.66 m)","bio":"British actor Anton Lesser (b. 1952) has played many of the principal Shakespearian roles for the Royal Shakespeare Company (Associate Artist since 1990), including Petruchio, Romeo and Richard III. He is very active in radio (BBC) and spoken word audio. Over a dozen recordings range from Paradise Lost and Homer to the title role in Hamlet. He is particularly known for the major novels of Charles Dickens - Great Expectations won the Talkie Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NDYzODU1MF5BMl5BanBnXkFtZTcwOTAwMDIxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0504320","name":"Anton Lesser","idIMDB":"nm0504320"},"actorId":"nm0504320","character":"Lord John Carteret","urlCharacter":"http://www.imdb.com/character/ch0100830","main":true},{"actorName":"Roger Allam","urlProfile":"http://www.imdb.com/name/nm0019885","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NTM3MjE4OF5BMl5BanBnXkFtZTcwODU3MjQ1Mw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1953","placeOfBirth":" London, England, UK","height":"6' (1.83 m)","bio":"Roger Allam was born on October 26, 1953 in London, England. He is an actor, known for V for Vendetta (2005), The Book Thief (2013) and The Queen (2006). He is married to Rebecca Saire. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NTM3MjE4OF5BMl5BanBnXkFtZTcwODU3MjQ1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0019885","name":"Roger Allam","idIMDB":"nm0019885"},"actorId":"nm0019885","character":"Prime Minister Henry Pelham","urlCharacter":"http://www.imdb.com/character/ch0271685","main":true}],"seasons":[],"idIMDB":"tt1298650","urlIMDB":"http://www.imdb.com/title/tt1298650","business":{"budget":{"money":"$250,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$90,151,958","country":"USA","day":"22","month":"05","year":"2011","remarks":"4,155 Screens"},{"money":"£11,634,860","country":"UK","day":"22","month":"05","year":"2011","remarks":"569 Screens"},{"money":"€2,296,692","country":"Netherlands","day":"22","month":"05","year":"2011","remarks":"190 Screens"},{"money":"PHP 63,140,077","country":"Philippines","day":"22","month":"05","year":"2011","remarks":"143 Screens"},{"money":"$572,729","country":"Romania","day":"22","month":"05","year":"2011","remarks":"42 Screens"}],"gross":[{"money":"$241,071,802","country":"USA","day":"28","month":"05","year":"2012","remarks":""},{"money":"$241,063,875","country":"USA","day":"25","month":"09","year":"2011","remarks":""},{"money":"$241,011,325","country":"USA","day":"18","month":"09","year":"2011","remarks":""},{"money":"$240,918,960","country":"USA","day":"11","month":"09","year":"2011","remarks":""},{"money":"$240,794,584","country":"USA","day":"04","month":"09","year":"2011","remarks":""},{"money":"$240,461,924","country":"USA","day":"28","month":"08","year":"2011","remarks":""},{"money":"$240,141,369","country":"USA","day":"21","month":"08","year":"2011","remarks":""},{"money":"$239,679,520","country":"USA","day":"14","month":"08","year":"2011","remarks":""},{"money":"$239,048,698","country":"USA","day":"07","month":"08","year":"2011","remarks":""},{"money":"$238,433,768","country":"USA","day":"31","month":"07","year":"2011","remarks":""},{"money":"$238,021,773","country":"USA","day":"24","month":"07","year":"2011","remarks":""},{"money":"$237,353,634","country":"USA","day":"17","month":"07","year":"2011","remarks":""},{"money":"$236,250,479","country":"USA","day":"10","month":"07","year":"2011","remarks":""},{"money":"$229,287,226","country":"USA","day":"26","month":"06","year":"2011","remarks":""},{"money":"$208,873,258","country":"USA","day":"12","month":"06","year":"2011","remarks":""},{"money":"$190,200,880","country":"USA","day":"05","month":"06","year":"2011","remarks":""},{"money":"$163,967,000","country":"USA","day":"29","month":"05","year":"2011","remarks":""},{"money":"$90,151,958","country":"USA","day":"22","month":"05","year":"2011","remarks":""},{"money":"£32,671,614","country":"UK","day":"26","month":"06","year":"2011","remarks":""},{"money":"£31,040,011","country":"UK","day":"19","month":"06","year":"2011","remarks":""},{"money":"£29,486,268","country":"UK","day":"12","month":"06","year":"2011","remarks":""},{"money":"£26,693,930","country":"UK","day":"05","month":"06","year":"2011","remarks":""},{"money":"£19,738,154","country":"UK","day":"29","month":"05","year":"2011","remarks":""},{"money":"£11,634,860","country":"UK","day":"22","month":"05","year":"2011","remarks":""},{"money":"$1,043,871,802","country":"Worldwide","day":"25","month":"11","year":"2011","remarks":""},{"money":"PHP 155,323,991","country":"Philippines","day":"19","month":"06","year":"2011","remarks":""},{"money":"PHP 151,147,157","country":"Philippines","day":"12","month":"06","year":"2011","remarks":""},{"money":"PHP 142,858,512","country":"Philippines","day":"05","month":"06","year":"2011","remarks":""},{"money":"PHP 120,222,423","country":"Philippines","day":"29","month":"05","year":"2011","remarks":""},{"money":"PHP 63,140,077","country":"Philippines","day":"22","month":"05","year":"2011","remarks":""},{"money":"$2,172,494 (Romania)","country":"","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$33,973","country":"USA","day":"25","month":"09","year":"2011","remarks":"38 Screens"},{"money":"$62,292","country":"USA","day":"18","month":"09","year":"2011","remarks":"98 Screens"},{"money":"$92,245","country":"USA","day":"11","month":"09","year":"2011","remarks":"150 Screens"},{"money":"$197,651","country":"USA","day":"04","month":"09","year":"2011","remarks":"186 Screens"},{"money":"$193,513","country":"USA","day":"28","month":"08","year":"2011","remarks":"211 Screens"},{"money":"$263,292","country":"USA","day":"21","month":"08","year":"2011","remarks":"231 Screens"},{"money":"$329,678","country":"USA","day":"14","month":"08","year":"2011","remarks":"254 Screens"},{"money":"$448,837","country":"USA","day":"07","month":"08","year":"2011","remarks":"274 Screens"},{"money":"$205,376","country":"USA","day":"31","month":"07","year":"2011","remarks":"166 Screens"},{"money":"$311,464","country":"USA","day":"24","month":"07","year":"2011","remarks":"246 Screens"},{"money":"$493,155","country":"USA","day":"17","month":"07","year":"2011","remarks":"373 Screens"},{"money":"$1,054,694","country":"USA","day":"10","month":"07","year":"2011","remarks":"622 Screens"},{"money":"$2,629,072","country":"USA","day":"04","month":"07","year":"2011","remarks":"1,473 Screens"},{"money":"$4,928,925","country":"USA","day":"26","month":"06","year":"2011","remarks":"2,244 Screens"},{"money":"$6,646,249","country":"USA","day":"19","month":"06","year":"2011","remarks":"2,742 Screens"},{"money":"$10,945,764","country":"USA","day":"12","month":"06","year":"2011","remarks":"3,433 Screens"},{"money":"$17,954,603","country":"USA","day":"05","month":"06","year":"2011","remarks":"3,966 Screens"},{"money":"$39,592,000","country":"USA","day":"29","month":"05","year":"2011","remarks":"4,164 Screens"},{"money":"$90,151,958","country":"USA","day":"22","month":"05","year":"2011","remarks":"4,155 Screens"},{"money":"£535,645","country":"UK","day":"26","month":"06","year":"2011","remarks":"381 Screens"},{"money":"£917,188","country":"UK","day":"19","month":"06","year":"2011","remarks":"423 Screens"},{"money":"£1,580,778","country":"UK","day":"12","month":"06","year":"2011","remarks":"475 Screens"},{"money":"£2,144,179","country":"UK","day":"05","month":"06","year":"2011","remarks":"517 Screens"},{"money":"£4,757,411","country":"UK","day":"29","month":"05","year":"2011","remarks":"567 Screens"},{"money":"£11,634,860","country":"UK","day":"22","month":"05","year":"2011","remarks":"569 Screens"},{"money":"PHP 1,174,099","country":"Philippines","day":"19","month":"06","year":"2011","remarks":"29 Screens"},{"money":"PHP 5,553,569","country":"Philippines","day":"12","month":"06","year":"2011","remarks":"77 Screens"},{"money":"PHP 15,628,205","country":"Philippines","day":"05","month":"06","year":"2011","remarks":"143 Screens"},{"money":"PHP 37,588,370","country":"Philippines","day":"29","month":"05","year":"2011","remarks":"143 Screens"},{"money":"PHP 63,140,077","country":"Philippines","day":"22","month":"05","year":"2011","remarks":"143 Screens"},{"money":"$618","country":"Romania","day":"18","month":"09","year":"2011","remarks":"2 Screens"},{"money":"$791","country":"Romania","day":"11","month":"09","year":"2011","remarks":"3 Screens"},{"money":"$1,308","country":"Romania","day":"04","month":"09","year":"2011","remarks":"3 Screens"},{"money":"$908","country":"Romania","day":"28","month":"08","year":"2011","remarks":"3 Screens"},{"money":"$1,448","country":"Romania","day":"21","month":"08","year":"2011","remarks":"4 Screens"},{"money":"$2,347","country":"Romania","day":"14","month":"08","year":"2011","remarks":"4 Screens"},{"money":"$3,649","country":"Romania","day":"07","month":"08","year":"2011","remarks":"6 Screens"},{"money":"$7,671","country":"Romania","day":"31","month":"07","year":"2011","remarks":"11 Screens"},{"money":"$10,460","country":"Romania","day":"24","month":"07","year":"2011","remarks":"7 Screens"},{"money":"$10,636","country":"Romania","day":"17","month":"07","year":"2011","remarks":"12 Screens"},{"money":"$22,422","country":"Romania","day":"10","month":"07","year":"2011","remarks":"27 Screens"},{"money":"$45,551","country":"Romania","day":"03","month":"07","year":"2011","remarks":"27 Screens"},{"money":"$65,154","country":"Romania","day":"26","month":"06","year":"2011","remarks":"31 Screens"},{"money":"$70,198","country":"Romania","day":"19","month":"06","year":"2011","remarks":"42 Screens"},{"money":"$148,251","country":"Romania","day":"12","month":"06","year":"2011","remarks":"42 Screens"},{"money":"$172,182","country":"Romania","day":"05","month":"06","year":"2011","remarks":"42 Screens"},{"money":"$293,036","country":"Romania","day":"29","month":"05","year":"2011","remarks":"42 Screens"}],"admissions":[{"money":"500,742","country":"Norway","day":"21","month":"07","year":"2011","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"14","month":"06","year":"2010","remarks":null},{"money":null,"country":null,"day":"12","month":"11","year":"2010","remarks":null}],"copyrightHolder":"Disney Enterprises, Inc."},"technical":{"runtime":["2 hr 16 min (136 min) (USA)","2 hr 17 min (137 min) (Argentina)"],"soundMix":["SDDS","Datasat","Dolby Digital","Dolby Surround 7.1"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Red Epic, Zeiss Ultra Prime and Angenieux Optimo Lenses","Red One MX, Panavision Primo, Zeiss Ultra Prime and Angenieux Optimo Lenses"],"laboratory":["Company 3, Los Angeles (CA), USA (digital intermediate)","DeLuxe, Hollywood (CA), USA (domestic prints)","Technicolor (international prints)"],"filmLength":["3,760 m (Portugal, 35 mm)"],"negativeFormat":["Redcode RAW"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Redcode RAW (4.5K) (5K) (dual-strip 3-D) (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","70 mm (horizontal) (IMAX DMR blow-up) (also dual-strip 3-D) (Kodak Vision 2383)","D-Cinema (also 3-D version)"]},"rating":"6.7","metascore":"45","filmingLocations":[{"location":"Knole, Sevenoaks, Kent, England, UK"}],"rated":"PG-13","awards":[{"award":"ALMA Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated ALMA Award","categories":[{"category":"Favorite Movie Actress - Drama/Adventure","names":[{"name":"Penélope Cruz","id":"nm0004851","role":null}]}]}]},{"award":"Annie Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Annie","categories":[{"category":"Animated Effects in a Live Action Production","names":[{"name":"Branko Grujcic","id":"nm1257301","role":null}]}]}]},{"award":"Art Directors Guild 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Excellence in Production Design Award","categories":[{"category":"Fantasy Film","names":[{"name":"John Myhre","id":"nm0616924","role":"production designer"},{"name":"Tomas Voth","id":"nm0903789","role":"supervising art director"},{"name":"Zack Grobler","id":"nm0342787","role":"art director - Oahu"},{"name":"Drew Boughton","id":"nm0099284","role":"art director - Los Angeles"},{"name":"John Chichester","id":"nm0157194","role":"art director - Los Angeles"},{"name":"Lisa Vasconcellos","id":"nm0890354","role":"assistant art director"},{"name":"Luis G. Hoyos","id":"nm0398432","role":"set designer"},{"name":"Noelle King","id":"nm0455108","role":"set designer"},{"name":"Mark Hitchler","id":"nm0386914","role":"set designer"},{"name":"Dawn Brown","id":"nm0113384","role":"illustrator"},{"name":"Dean Tschetter","id":"nm0874810","role":"illustrator"},{"name":"Darek Gogol","id":"nm0324689","role":"illustrator"},{"name":"Wil Rees","id":"nm0715968","role":"illustrator"},{"name":"Miles Teves","id":"nm0856662","role":"illustrator"},{"name":"John Eaves","id":"nm0247913","role":"props illustrator"},{"name":"Ron Mendell","id":"nm0578831","role":"model maker"},{"name":"Richard K. Buoen","id":"nm0120626","role":"concept illustrator - visual effects"},{"name":"Gary Freeman","id":"nm0293396","role":"supervising art director - UK"},{"name":"David Allday","id":"nm0020151","role":"senior art director - UK"},{"name":"Robert Cowper","id":"nm0184865","role":"art director - UK"},{"name":"Guy Bradley","id":"nm0103245","role":"assistant art director - UK"},{"name":"Gary Jopling","id":"nm2214501","role":"assistant art director - UK"},{"name":"Gavin Fitch","id":"nm1184878","role":"assistant art director - UK"},{"name":"Patricia Johnson","id":"nm0425949","role":"senior draughtsperson - UK"},{"name":"Oliver Carroll","id":"nm0990281","role":"senior draughtsperson - UK"},{"name":"Oliver Goodier","id":"nm1049859","role":"senior draughtsperson - UK"},{"name":"Bethan Jones","id":"nm2547410","role":"junior draughtsmen - UK"},{"name":"Andrew Proctor","id":"nm0698359","role":"junior draughtsmen - UK"},{"name":"Simon McGuire","id":"nm1166298","role":"concept artist - UK"},{"name":"Tina Charad","id":"nm1931067","role":"graphic artist - UK"},{"name":"Nick Pelham","id":"nm1284052","role":"storyboard artist - UK"},{"name":"Heather Pollington","id":"nm1712260","role":"graphic artist - UK"},{"name":"Greg Winter","id":"nm2717263","role":"scenic artist - UK"},{"name":"Missy Parker","id":"nm0662486","role":"set decorator - Hawaii/Los Angeles"},{"name":"Gordon Sim","id":"nm0799246","role":"set decorator"}]}]}]},{"award":"ASCAP Film and Television Music Awards 2012","titlesAwards":[{"titleAwardOutcome":"Won ASCAP Award","categories":[{"category":"Top Box Office Films","names":[{"name":"Hans Zimmer","id":"nm0001877","role":null}]}]}]},{"award":"Casting Society of America, USA 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Outstanding Achievement in Casting - Big Budget Feature - Comedy","names":[{"name":"Francine Maisler","id":"nm0537892","role":"Casting Director"}]}]}]},{"award":"Cinema Audio Society, USA 2012","titlesAwards":[{"titleAwardOutcome":"Nominated C.A.S. Award","categories":[{"category":"Outstanding Achievement in Sound Mixing for Motion Pictures","names":[{"name":"Lee Orloff","id":"nm0650090","role":"production mixer"},{"name":"Paul Massey","id":"nm0557338","role":"re-recording mixer"},{"name":"Christopher Boyes","id":"nm0102110","role":"re-recording mixer"},{"name":"Alan Meyerson","id":"nm0583657","role":"scoring mixer"}]}]}]},{"award":"Costume Designers Guild Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated CDG Award","categories":[{"category":"Excellence in Fantasy Film","names":[{"name":"Penny Rose","id":"nm0741606","role":null}]}]}]},{"award":"Empire Awards, UK 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Empire Award","categories":[{"category":"Best Male Newcomer","names":[{"name":"Sam Claflin","id":"nm3510471","role":null}]}]}]},{"award":"Evening Standard British Film Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Evening Standard British Film Award","categories":[{"category":"Blockbuster of the Year","names":[]}]}]},{"award":"Golden Schmoes Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Biggest Disappointment of the Year","names":[]}]}]},{"award":"Hollywood Film Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Hollywood Movie Award","categories":[{"category":"","names":[]}]}]},{"award":"Jupiter Award 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Jupiter Award","categories":[{"category":"Best International Actress","names":[{"name":"Penélope Cruz","id":"nm0004851","role":null}]},{"category":"Best International Actor","names":[{"name":"Johnny Depp","id":"nm0000136","role":null}]}]}]},{"award":"Kids' Choice Awards, USA 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Blimp Award","categories":[{"category":"Favorite Movie Actor","names":[{"name":"Johnny Depp","id":"nm0000136","role":null}]}]}]},{"award":"MovieGuide Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Best Film for Mature Audiences","categories":[{"category":"","names":[]}]},{"titleAwardOutcome":"Nominated Epiphany Prize","categories":[{"category":"Most Inspiring Movie","names":[]}]},{"titleAwardOutcome":"Nominated Grace Award","categories":[{"category":"Most Inspiring Performance in Movies","names":[{"name":"Sam Claflin","id":"nm3510471","role":null}]}]}]},{"award":"People's Choice Awards, USA 2013","titlesAwards":[{"titleAwardOutcome":"Nominated People's Choice Award","categories":[{"category":"Favorite Move Fan Following","names":[{"name":"Pirates of the Caribbean: The Curse of the Black Pearl","id":"tt0325980","role":null},{"name":"Pirates of the Caribbean: Dead Man's Chest","id":"tt0383574","role":null},{"name":"Pirates of the Caribbean: At World's End","id":"tt0449088","role":null}]}]}]},{"award":"People's Choice Awards, USA 2012","titlesAwards":[{"titleAwardOutcome":"Nominated People's Choice Award","categories":[{"category":"Favorite Movie","names":[]},{"category":"Favorite Ensemble Movie Cast","names":[]}]}]},{"award":"Rembrandt Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Rembrandt Award","categories":[{"category":"Best International Film (Beste Buitenlandse Film)","names":[]}]}]},{"award":"Russian National Movie Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Georges Award","categories":[{"category":"Best Foreign Action of the Year","names":[]}]}]},{"award":"Scream Awards 2011","titlesAwards":[{"titleAwardOutcome":"Won Scream Award","categories":[{"category":"Best Chase Scene","names":[]}]},{"titleAwardOutcome":"Nominated Scream Award","categories":[{"category":"Best Fantasy Movie","names":[]},{"category":"Best Fantasy Actress","names":[{"name":"Penélope Cruz","id":"nm0004851","role":null}]},{"category":"Best Fantasy Actor","names":[{"name":"Johnny Depp","id":"nm0000136","role":null}]},{"category":"Best Cameo","names":[{"name":"Keith Richards","id":"nm0724189","role":null}]}]}]},{"award":"Teen Choice Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie: Sci-Fi/Fantasy","names":[]},{"category":"Choice Movie Actor: Sci-Fi/Fantasy","names":[{"name":"Johnny Depp","id":"nm0000136","role":null}]},{"category":"Choice Movie Actress: Sci-Fi/Fantasy","names":[{"name":"Penélope Cruz","id":"nm0004851","role":null}]},{"category":"Choice Movie Villain","names":[{"name":"Ian McShane","id":"nm0574534","role":null}]}]}]},{"award":"Visual Effects Society Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated VES Award","categories":[{"category":"Outstanding Visual Effects in a Visual Effects Driven Feature Motion Picture","names":[{"name":"Gary Brozenich","id":"nm1819614","role":null},{"name":"David Conley","id":"nm0174769","role":null},{"name":"Charles Gibson","id":"nm0002716","role":null},{"name":"Ben Snow","id":"nm0811240","role":null}]}]}]},{"award":"World Soundtrack Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated World Soundtrack Award","categories":[{"category":"Soundtrack Composer of the Year","names":[{"name":"Hans Zimmer","id":"nm0001877","role":null},{"name":"Inception","id":"tt1375666","role":null},{"name":"How Do You Know","id":"tt1341188","role":null},{"name":"Megamind","id":"tt1001526","role":null},{"name":"The Dilemma","id":"tt1578275","role":null},{"name":"Rango","id":"tt1192628","role":null},{"name":"Kung Fu Panda 2","id":"tt1302011","role":null}]}]}]}],"votes":"390,560","type":"Movie","companyCreditsSimple":[{"idCompany":"co0008970","name":"Walt Disney Pictures"},{"idCompany":"co0026281","name":"Jerry Bruckheimer Films"},{"idCompany":"co0016492","name":"Moving Picture Company (MPC)"}],"keywords":{"keywords":["pirate","captain","blackbeard","soldier","revenge","spaniard","king","mermaid","fountain of youth","chalice","impostor","escape","tear","sailing ship","tavern","prostitute","wench","cave","crucifix","skeleton","skeleton in a bed","damsel in distress","bare chested male","poisonous frog","ravine","caught in a net","mythical creature","singing","partial female nudity","human bait","disembarking ship","cleavage","ship in a bottle","shrunken ship","lighthouse","night","dancing","burned to death","burned alive","attempted mutiny","telekinesis","voodoo","altered version of studio logo","snake","court","no opening credits","jungle","man wearing a wig","anti hero","rifle","gun","sea battle","pistol","battle","cannonball","musket","flintlock pistol","flintlock rifle","action hero","adventure hero","hero","explosion","british navy","british soldier","cannon","drinking from peg leg","surprise after end credits","scene after end credits","doll","voodoo doll","deserted mall","island","returning character killed off","trick","poison","sword fight","sword","torture","compass","bay","silver","mutiny","lieutenant","woman dressed as man","missionary","former lover","wooden leg","one legged man","one legged","privateer","escape from prison","life imprisonment","guilty verdict","piracy","court trial","england","spain","king ferdinand of spain","jury","judge","prime minister","london england","cadiz spain","king george ii","horse","chase","chandelier","duke","voyage","canyon","dreadlocks","swashbuckler","sequel","fourth part","based on novel","femme fatale","zombie"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:22:55"}}