{"data":{"movies":[{"title":"Streets of Blood","originalTitle":"","year":"2009","releaseDate":"20090728","directors":[{"name":"Charles Winkler","id":"nm0935203"}],"writers":[{"name":"Gene Hess","id":"nm0381460"},{"name":"Gene Hess","id":"nm0381460"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU2MzcwMzA5Ml5BMl5BanBnXkFtZTcwOTU2NjQ3Mg@@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Action","Crime","Drama","Thriller"],"plot":"In New Orleans after 'Katrina', the partner of Detective Andy Devereaux is found dead, so Devereaux is teamed up with Stan Green. During the investigation, an undercover DEA agent is murdered by two dirty police officers. A psychologist, Nina Ferraro, has successive interviews with Andy, Stan and the two detectives. Meanwhile, the FBI also investigates the corruption in the police force headed by Agent Brown.","simplePlot":"A police officer's partner has died during Hurricane Katrina, but he later discovers that his partner may have been murdered. An investigation follows, taking the officer and his new partner into the depths of the criminal underworld.","actors":[{"actorName":"Val Kilmer","urlProfile":"http://www.imdb.com/name/nm0000174","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3ODIzMDA5Ml5BMl5BanBnXkFtZTcwNDY0NTU4Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1959","placeOfBirth":" Los Angeles, California, USA","birthName":"Val Edward Kilmer","height":"5' 11¾\" (1.82 m)","bio":"Val Kilmer was born in Los Angeles, California, to Gladys Swanette (Ekstadt) and Eugene Dorris Kilmer, who was a real estate developer and aerospace equipment distributor. His mother, born in Indiana, was from a Swedish family, and his father was from Texas. Val studied at Hollywood's Professional's School and, in his teens, entered Juilliard's drama program. His professional acting career began on stage, and he still participates in theater; he played Hamlet at the 1988 Colorado Shakespeare Festival. His film debut was in the 1984 spoof Top Secret! (1984), wherein he starred as blond rock idol Nick Rivers. He was in a number of films throughout the 1980s, including the 1986 smash Top Gun (1986). Despite his obvious talent and range, it wasn't until his astonishingly believable performance as Jim Morrison in Oliver Stone's The Doors (1991) that the world sat up and took notice. Kilmer again put his good baritone to use in the movie, performing all of the concert pieces. Since then, he has played two more American legends, Elvis Presley in True Romance (1993) and Doc Holliday in Tombstone (1993). In July 1994, it was announced that Kilmer would be taking over the role of Batman/Bruce Wayne from Michael Keaton.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3ODIzMDA5Ml5BMl5BanBnXkFtZTcwNDY0NTU4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000174","name":"Val Kilmer","idIMDB":"nm0000174"},"actorId":"nm0000174","character":"Det. Andy Deveraux","urlCharacter":"http://www.imdb.com/character/ch0128780","main":true},{"actorName":"50 Cent","urlProfile":"http://www.imdb.com/name/nm1265067","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY0NTc2NTAxNV5BMl5BanBnXkFtZTgwMjYwMDMzNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1975","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Curtis James Jackson III","height":"6' (1.83 m)","bio":"Born in the South Jamaica section of Queens, Curtis \"50 Cent\" Jackson has lived in New York City all his life. He was raised by his grandparents after his father ran out and his mother was shot when he was only eight. Growing up, the Queens rapper originally wanted to be a heavyweight boxer, but eventually fell back on rapping. DJs had taken it upon themselves to release two Best of 50 Cent mix CDs, before he had even signed to a major label. 50 Cent hit the scene with \"How To Rob\" and he's been on a rampage ever since dealing with bootleggers, label back stabbing and other platinum selling artists trying to get at him physically. In 1999 his album Power of the Dollar, was heavily bootlegged and Trackmasters/Columbia never released it. Supposedly, Trackmasters weren't comfortable with him being caught up in the streets and getting shot three days before filming the video for \"Thug Love,\" (with Destiny's Child) -- his first single. 50 was shot three times that night, two shots hitting him in the head, the bullet that struck his face he carries as a reminder of what happened. That event led to the fall out with Columbia and negotiating his release from their grasps. He still showed love and rhymed over a Trackmasters produced remix of \"I'm Gonna Be Alright\" on J-Lo's latest album, but rivals at Murder Inc. had 50 cut from the track which could have launched the rapper. This all changed in one night when Eminem said on a radio show that \"50 Cent is definitely my favorite rapper right now, he's the only one keeping it real.\" The very next day a bidding war started on 50, ending when 50 signed to Eminem's very own label Shady/Aftermath. 50 Cent's fame has exploded, being produced by Dr. Dre and Eminem and finally making his debut album \"Get rich or Die Tryin'.\" 50 has full access and advantage of the streets through mix-tapes; that's his forum because he controls it. 50 Cent is the most anticipated artist of 2003. It's well deserved because he's \"been patiently waiting.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY0NTc2NTAxNV5BMl5BanBnXkFtZTgwMjYwMDMzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1265067","name":"50 Cent","nicknames":["Interscope","Fiddy","Boo Boo"],"idIMDB":"nm1265067"},"actorId":"nm1265067","character":"Det. Stan Johnson","urlCharacter":"http://www.imdb.com/character/ch0346569","main":true},{"actorName":"Sharon Stone","urlProfile":"http://www.imdb.com/name/nm0000232","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDU1ODQwNF5BMl5BanBnXkFtZTcwOTc3MjQwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 March 1958","placeOfBirth":" Meadville, Pennsylvania, USA","birthName":"Sharon Yvonne Stone","height":"5' 8½\" (1.74 m)","bio":"Sharon Yvonne Stone was born and raised in Meadville, a small town in Pennsylvania, to Dorothy Marie (Lawson), an accountant and homemaker, and Joseph William Stone II, a factory worker. Her father was strict. She was the second of four children, and has English, German, Scottish, and Irish ancestry. At the age of 15, she studied in Saegertown High School, Pennsylvania and, at that same age, entered Edinboro State University of Pennsylvania, and graduated with a degree in creative writing and fine arts. She was a very smart girl, became a bookworm, and once was told that a suitable job for her (and her brains) was to become a lawyer. However, her first love was still the black-and-white movies, especially those featuring Fred Astaire and Ginger Rogers. So, the 17-year-old Sharon got herself into the Miss Crawford County and won the beauty contest. From working part-time as a McDonald's counter girl, she worked her way up to become a successful Ford model, both in TV commercials and print ads. In 1980, she made her film debut as an extra in Woody Allen's Stardust Memories (1980). Her first speaking part was in Wes Craven's horror movie, Deadly Blessing (1981). She struggled through many parts in B-movies, such as King Solomon's Mines (1985) and Action Jackson (1988). She was also married in 1984 to Michael Greenburg, the producer of MacGyver (1985), but they divorced two years later. She finally got her big break with a memorable supporting role in the popular Arnold Schwarzenegger movie Total Recall (1990), and also posed nude for Playboy, a daring move for a 32-year-old actress. But it worked; she was cast in the breakthrough role as a sociopath novelist, \"Catherine Tramell\", in Basic Instinct (1992). Her interrogation scene has become a classic in film history and her performance captivated everyone, from MTV viewers, who honored her with Most Desirable Female and Best Female Performance Awards, to a Golden Globe nomination for Best Actress. After she got famous, she didn't want to be typecast, so she played a victim in Sliver (1993), and, in Intersection (1994), she was the aloof, estranged wife of Richard Gere. Then she appeared in more aggressive roles, such as The Specialist (1994) with Sylvester Stallone and Mort ou vif (1995) with Gene Hackman. But it wasn't until she played a beautiful but drug-crazy trophy wife of Robert De Niro in Casino (1995) that she got far more than just fame and fortune--she also received the acknowledgment of the movie industry for her acting ability. She received her first Golden Globe and an Oscar nomination. She did a couple of films released the next year, teaming up with Isabelle Adjani in Diabolique (1996), and as a woman waiting for her death penalty in Last Dance (1996). In 1998, she married a newspaper editor,Phil Bronstein but they divorced later in 2004. She received her third Golden Globe nomination for The Mighty (1998), a film that her company, \"Chaos\", also co-executive produced. The next year, she played the title role in Gloria (1999) and entered her first comedic role in The Muse (1999), which gave her another Golden Globe nomination. Sharon Stone, a diva who thoroughly enjoys her hard-won stardom, is now a mother of three children: Roan, Laird and Quinn.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDU1ODQwNF5BMl5BanBnXkFtZTcwOTc3MjQwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000232","name":"Sharon Stone","idIMDB":"nm0000232"},"actorId":"nm0000232","character":"Nina Ferraro","urlCharacter":"http://www.imdb.com/character/ch0151521","main":true},{"actorName":"Michael Biehn","urlProfile":"http://www.imdb.com/name/nm0000299","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2OTI1MTEyOV5BMl5BanBnXkFtZTcwMzM5NTQ4NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1956","placeOfBirth":" Anniston, Alabama, USA","birthName":"Michael Connell Biehn","height":"6' (1.83 m)","bio":"Michael Connell Biehn was born on July 31, 1956 in Anniston, Alabama, to Marcia (Connell) and Don Biehn, a lawyer. He grew up in Lincoln, Nebraska, and at age 14 moved with his family to Lake Havasu, Arizona, where he won a drama scholarship to the University of Arizona. He left prematurely two years later to pursue an acting career in Hollywood. His first big role was as a psychotic fan stalking Lauren Bacall in The Fan (1981) and later appeared in The Lords of Discipline (1983). He hit the big-time when he was cast as Kyle Reese, the man sent back through time to stop Arnold Schwarzenegger in James Cameron's The Terminator (1984). This established a good working relationship with Cameron, a relationship that should have catapulted Biehn to international stardom. He starred in Cameron's subsequent films, Aliens (1986) and The Abyss (1989), the latter a standout performance as unstable Navy SEAL officer Lt. Hiram Coffey. In the 1990s he starred in films like Navy Seals (1990), K2 (1991) and was particularly memorable as Johnny Ringo in Tombstone (1993). Biehn is married and the father of four sons.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2OTI1MTEyOV5BMl5BanBnXkFtZTcwMzM5NTQ4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000299","name":"Michael Biehn","nicknames":["Mike","Mick"],"idIMDB":"nm0000299"},"actorId":"nm0000299","character":"Agent Michael Brown","urlCharacter":"http://www.imdb.com/character/ch0222382","main":true},{"actorName":"Jose Pablo Cantillo","urlProfile":"http://www.imdb.com/name/nm1504678","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NzkyMjMxMV5BMl5BanBnXkFtZTcwODk3NDI2Mg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1979","placeOfBirth":" Marshfield, Wisconsin, USA","height":"5' 9½\" (1.77 m)","bio":"Jose Pablo Cantillo was born on March 30, 1979 in Marshfield, Wisconsin, USA. He is an actor and producer, known for Crank (2006), Elysium (2013) and Chappie (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NzkyMjMxMV5BMl5BanBnXkFtZTcwODk3NDI2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1504678","name":"Jose Pablo Cantillo","idIMDB":"nm1504678"},"actorId":"nm1504678","character":"Det. Pepe Vasquez","urlCharacter":"http://www.imdb.com/character/ch0203319","main":true},{"actorName":"Brian Presley","urlProfile":"http://www.imdb.com/name/nm0696169","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjhmMzEyYjQtMmIwYy00NWEyLWE2YWItN2VmYjNjNGZmNjRmXkEyXkFqcGdeQXVyMzE2OTM3OA@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1977","placeOfBirth":" Midland, Texas, USA","height":"5' 10½\" (1.79 m)","bio":"Brian Presley was born on August 18, 1977 in Midland, Texas, USA. He is an actor and producer, known for Touchback (2011), Home of the Brave (2006) and Mechanic: Résurrection (2016). He has been married to Erin Hershey since July 27, 2002. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjhmMzEyYjQtMmIwYy00NWEyLWE2YWItN2VmYjNjNGZmNjRmXkEyXkFqcGdeQXVyMzE2OTM3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0696169","name":"Brian Presley","idIMDB":"nm0696169"},"actorId":"nm0696169","character":"Det. Barney Balentine","urlCharacter":"http://www.imdb.com/character/ch0346581","main":true},{"actorName":"Barry Shabaka Henley","urlProfile":"http://www.imdb.com/name/nm0377106","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzQ5OTAxMV5BMl5BanBnXkFtZTYwNjExNDA0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1954","placeOfBirth":" New Orleans, Louisiana, USA","birthName":"Barry Joseph Henley","height":"6' 2\" (1.88 m)","bio":"Barry Shabaka Henley was born on September 15, 1954 in New Orleans, Louisiana, USA as Barry Joseph Henley. He is an actor, known for The Terminal (2004), Collateral (2004) and Miami Vice (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzQ5OTAxMV5BMl5BanBnXkFtZTYwNjExNDA0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0377106","name":"Barry Shabaka Henley","idIMDB":"nm0377106"},"actorId":"nm0377106","character":"Captain Friendly","urlCharacter":"http://www.imdb.com/character/ch0346551","main":true},{"actorName":"Luis Rolon","urlProfile":"http://www.imdb.com/name/nm0738533","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNTYzMDQwNl5BMl5BanBnXkFtZTgwNDMxNTQ2MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Luis Rolon is known for his work on Streets of Blood (2009), The Drifter (2011) and Better (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNTYzMDQwNl5BMl5BanBnXkFtZTgwNDMxNTQ2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0738533","name":"Luis Rolon","idIMDB":"nm0738533"},"actorId":"nm0738533","character":"Chamorro","urlCharacter":"http://www.imdb.com/character/ch0346580","main":true},{"actorName":"Defecio Stoglin","urlProfile":"http://www.imdb.com/name/nm2861162","urlPhoto":"","biography":{"height":"6' 2\" (1.88 m)","bio":"Defecio Stoglin is known for his work on Streets of Blood (2009), The Remaining (2014) and Hayride 2 (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2861162","name":"Defecio Stoglin","idIMDB":"nm2861162"},"actorId":"nm2861162","character":"Jambalaya Jake","urlCharacter":"http://www.imdb.com/character/ch0346578","main":true},{"actorName":"Davi Jay","urlProfile":"http://www.imdb.com/name/nm1615583","urlPhoto":"","biography":{"dateOfBirth":"29 March 1964","placeOfBirth":" Houston, Texas, USA","height":"6' (1.83 m)","bio":"Davi Jay's love for acting began at an early age and took root when he landed his first professional paid acting gig at the age of 16 playing the lead role of Jesus Christ in the theatrical production of \"Godspell\". The stage became his home over the course of the next few decades. He studied Theater and Debate at the Texas Southern University and received \"Outstanding Performer of the Year\" in 1985 at Nationals as a member of the T.S.U. Debate Team. After college Davi Jay joined the cast of over 40 various stage productions, often earning the lead role and gracing the theatrical stages from New York to California and enjoying performing in his home town Houston, TX. In May of 2007 after playing the lead, Walter Lee in the stage production of \"A Raisin in the Sun\" he decided to focus his attention on Film/TV and by September 2007 he landed a recurring role as Papo on Fox's \"Prison Break\" followed by the role of Marcus Spires in \"Friday Night Lights\" the same year. Davi Jay continues to focus his time in film and television and has enjoyed a four year run as the character Robinette on HBO's TREME, the medical examiner on True Detectives and the role of Tony on The Walking Dead, to name a few. Even though his time is focused on TV/Film his second passion for music remains and he is never far from the stage as he continues his 20+ year role as the lead singer in the Houston based band - Bourbon Street the Band. In 2011 Davi Jay co-founded a non-profit organization called Nola's Angels which is dedicated to raising money for deserving charities through musical and theatrical productions. He has shared his \"smooth crooner style\" voice by singing at various fund-raising events benefiting such charities as Trumpets Not Guns, the Musician's Clinic of New Orleans, Jazz Heritage Foundation, Roots of Music, Tipitina's Foundation and more.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1615583","name":"Davi Jay","idIMDB":"nm1615583"},"actorId":"nm1615583","character":"Ray Delacroix","urlCharacter":"http://www.imdb.com/character/ch0346576","main":true},{"actorName":"Dother Sykes","urlProfile":"http://www.imdb.com/name/nm3158871","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTIyODc1M15BMl5BanBnXkFtZTgwMzA4OTkzODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 11½\" (1.82 m)","bio":"Born in Alexandria, Louisiana on November 13, 1988, Dother Sykes IV, started entertaining at the age of four by putting shorts on his head and giving a show for his folks' enjoyment. At the tender age of six, his family later relocated to Tampa, Florida where he was practically raised. Eventually, he moved back to Louisiana where he finished High School resulting in him landing work in such television commercial campaigns such as Micheal Jordan and Drew Brees' Advocare. It was at that time that Dother realized that the entertainment business was his calling. He found an agent located in Shreveport, Louisiana, where he landed his first big role in the film \"Streets of Blood\". In addition, he has guest-starred on the TV show \"Friday Night Lights\" season four. In continuance of his acting career, Dother Sykes met Curtis \"50 Cent\" Jackson and was able to share a few life stories resulting in side bending laughter. It was at that point that Curtis Jackson suggested he try Stand Up Comedy. With nothing to lose, he conquered his fear and claimed the stage of Amateur Night at The Funny Bone in Bossier City, Louisiana. The feeling of making people laugh became a passion almost instantaneously and has been in love with it ever since. Shortly after his first appearance, he began performing on various stages in Louisiana eventually spreading to Los Angeles, New York, New Jersey and many more, but most importantly, carrying on the name of the King of Comedy in Louisiana. He has since been able to make his love of acting and comedy go hand in hand, oftentimes working for his good through shorts, skits, and self written commercials. When Dother is not working he is spending time with his family.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTIyODc1M15BMl5BanBnXkFtZTgwMzA4OTkzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3158871","name":"Dother Sykes","idIMDB":"nm3158871"},"actorId":"nm3158871","character":"Downey Little","urlCharacter":"http://www.imdb.com/character/ch0346574","main":true},{"actorName":"Pilar Sanders","urlProfile":"http://www.imdb.com/name/nm0081790","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NzA0Njc1OV5BMl5BanBnXkFtZTcwODU4NjQzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Pilar Sanders is an actress and producer, known for The Mod Squad (1999), Streets of Blood (2009) and Deion and Pilar Sanders: Prime Time Love (2008). She was previously married to Deion Sanders.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NzA0Njc1OV5BMl5BanBnXkFtZTcwODU4NjQzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0081790","name":"Pilar Sanders","nicknames":["Miss P","P-Love"],"idIMDB":"nm0081790"},"actorId":"nm0081790","character":"Yolanda","urlCharacter":"http://www.imdb.com/character/ch0346571","main":true},{"actorName":"Darcel White Moreno","urlProfile":"http://www.imdb.com/name/nm2624568","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMDkzMDE3N15BMl5BanBnXkFtZTgwNjE2MTYzMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1985","placeOfBirth":" Shreveport, Louisiana, USA","birthName":"Darcel McKenzie White","height":"5' 7½\" (1.71 m)","bio":"Darcel McKenzie White-Moreno was born in Plain Dealing, Louisiana, on August 19th to Debra Marie Anderson and George Stewart. Darcel is a Classically Trained Ballerina and former dancer for Las Vegas Mandalay Bay Entertainment. At the age of 17, Darcel began to travel the US training models to strut the catwalk. Never really taking the idea of a career in acting seriously, Darcel was persuaded by an insistent Co-Worker to attend a local audition in Shreveport where she caught the \"acting bug\". Her first role was in Director Steve Miner's film, Major Movie Star. While in pursuit of her desire to be a working actress, Darcel accepted a job as an agent to learn the business. She now sits at the head of DMT, a Talent Agency helping others to achieve their hearts desires. Darcel is known for possessing a charmingly seductive smile and a distinctively vibrant but laid-back personality","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMDkzMDE3N15BMl5BanBnXkFtZTgwNjE2MTYzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2624568","name":"Darcel White Moreno","nicknames":["Honey"],"idIMDB":"nm2624568"},"actorId":"nm2624568","character":"Tanya","urlCharacter":"http://www.imdb.com/character/ch0346570","main":true},{"actorName":"Shirly Brener","urlProfile":"http://www.imdb.com/name/nm0107197","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTIxNzYwMV5BMl5BanBnXkFtZTgwNzQzMzc1MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 September 1974","placeOfBirth":" Haifa, Israel","bio":"Shirly Brener was born on September 24, 1974 in Haifa, Israel. She is an actress and producer, known for Righteous Kill (2008), Employee of the Month (2006) and The Grey Zone (2001). She has been married to Bruce Rubenstein since 2004. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTIxNzYwMV5BMl5BanBnXkFtZTgwNzQzMzc1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0107197","name":"Shirly Brener","idIMDB":"nm0107197"},"actorId":"nm0107197","character":"Selina","urlCharacter":"http://www.imdb.com/character/ch0346568","main":true},{"actorName":"Tze Yep","urlProfile":"http://www.imdb.com/name/nm2594499","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NzY1MjUzOV5BMl5BanBnXkFtZTcwODQwNjc2Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Tze Yep is an actor, known for The Expendables (2010), Arena (2011) and Donnybrook (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NzY1MjUzOV5BMl5BanBnXkFtZTcwODQwNjc2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2594499","name":"Tze Yep","idIMDB":"nm2594499"},"actorId":"nm2594499","character":"Wu Kim","urlCharacter":"http://www.imdb.com/character/ch0346567","main":true}],"seasons":[],"idIMDB":"tt1203523","urlIMDB":"http://www.imdb.com/title/tt1203523","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"© 2009 2008MP3, LLC"},"technical":{"runtime":["1 hr 35 min (95 min) (USA)","1 hr 35 min (95 min) (Argentina)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.78 : 1","16 : 9"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.4","filmingLocations":[{"location":"Louisiana Wave Studio, Sealy Slack Industrial Park, Shreveport, Louisiana, USA"}],"rated":"R","awards":[],"votes":"3,500","type":"Video","companyCreditsSimple":[{"idCompany":"co0002572","name":"Millennium Films"},{"idCompany":"co0017712","name":"Emmett/Furla/Oasis Films (EFO Films)"},{"idCompany":"co0095834","name":"Family Room Entertainment"}],"keywords":{"keywords":["police","investigation","criminal","hurricane katrina","corruption","hurricane","bare breasts","woman on top","uh 60 blackhawk helicopter","newscast","wading in water","drug dealer","beretta","shoulder holster","desert eagle","blood spatter","glock","police detective","b movie","pump action shotgun","m 16","uzi","machine gun","pistol","street shootout","gunfight","shootout","neo noir","gang violence","violence","police shootout","police detective hero","tough cop","gangster","prostitute","murder","fellatio","drugs","blood"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:53:13"}}