{"data":{"movies":[{"title":"Miss Yvonne","originalTitle":"Accidental Friendship","year":"2008","releaseDate":"20081115","directors":[{"name":"Don McBrearty","id":"nm0564260"}],"writers":[{"name":"Anna Sandor","id":"nm0762071"}],"runtime":"85 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWNlODZkZjgtMzk3NS00Mzc1LWJlNTctYTkwZDQwMDg3OTJlXkEyXkFqcGdeQXVyMjg0Mjg1MDM@._V1.jpg","countries":["Canada"],"languages":["English"],"genres":["Drama"],"plot":"A rough history leads Yvonne homeless with her two pets as her only friend, this is the story of friendship","simplePlot":"A rough history leads Yvonne homeless with her two pets as her only friend, this is the story of friendship","actors":[{"actorName":"Chandra Wilson","urlProfile":"http://www.imdb.com/name/nm0933156","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzODA0MDIxOF5BMl5BanBnXkFtZTYwMTA4MDk1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1969","placeOfBirth":" Houston, Texas, USA","birthName":"Chandra Danette Wilson","height":"5' (1.52 m)","bio":"Houston, Texas native Chandra Wilson began performing in musicals at the age of five with Theatre Under the Stars. She attended Houston's High School for the Performing and Visual Arts, and later went on to acquire her BFA in Drama from NYU's Tisch School of the Arts through which she spent four years at the Lee Strasberg Theatre Institute. Chandra's first series regular job was on ABC's Bob Patterson (2001) in the role of Claudia Hopper. She has made numerous other television appearances including guest-starring and recurring roles. She has also appeared in national television commercials for Blockbuster Video, Burger King, Scope, and the United Negro College Fund as well as numerous radio commercials. Aside from film and television, she has several New York stage credits. Her portrayal of Bonna Willis in the production of \"The Good Times are Killing Me\" by Lynda Barry (both at the Second Stage and Minetta Lane Theatres) won her a Theatre World Award for Outstanding Debut Performance. Some of her other stage credits include \"Paper Moon: The Musical\" at the Papermill Playhouse, \"The Family of Mann\" by Theresa Rebeck, \"Believing\" for the Young Playwright's Festival and the Broadway production of \"On the Town\" directed by George C. Wolfe.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzODA0MDIxOF5BMl5BanBnXkFtZTYwMTA4MDk1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0933156","name":"Chandra Wilson","idIMDB":"nm0933156"},"actorId":"nm0933156","character":"Yvonne","urlCharacter":"http://www.imdb.com/character/ch0449088","main":true},{"actorName":"Kathleen Munroe","urlProfile":"http://www.imdb.com/name/nm1182008","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MjczMzk5Nl5BMl5BanBnXkFtZTgwNTM1ODM4NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1982","placeOfBirth":" Hamilton, Ontario, Canada","birthName":"Kathleen Marie Sammon Munroe","bio":"Kathleen Munroe was born on April 9, 1982 in Hamilton, Ontario, Canada as Kathleen Marie Sammon Munroe. She is an actress, known for Resurrection (2014), Call Me Fitz (2010) and Patriot (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MjczMzk5Nl5BMl5BanBnXkFtZTgwNTM1ODM4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1182008","name":"Kathleen Munroe","idIMDB":"nm1182008"},"actorId":"nm1182008","character":"Tami Baumann","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gabriel Hogan","urlProfile":"http://www.imdb.com/name/nm0389527","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNjMxMjg3NV5BMl5BanBnXkFtZTgwODAzMTQ3NjE@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1973","placeOfBirth":" Toronto, Ontario, Canada","height":"6' 4\" (1.93 m)","bio":"Gabriel William Hogan has become a familiar face to audiences worldwide, turning out critically acclaimed performances on both the big and small screen. He resides with in Southern California with his wife actress Inga Cadranel and their 2 children. A gifted and charismatic screen actor, appearing in over 300 episodes of television and over 45 Movies, Gabriel's career actually began onstage in the theatre. His parents, Actors Michael Hogan and Susan Hogan were both involved in the arts and instilled in him an appreciation for all things creative. After moving around a bit in his youth playing sports Gabriel decided go to school to study acting. Having grown up in a diverse community surrounded by artists of all kinds it wasn't long before he began performing himself and quickly became a sought after stage actor. Hogan shifted focus and began to work steadily in both film and television projects around 1997 when he was cast in a Breakthrough role as Lt Bobby Danko in the Dramatic film Peacekeepers (1997) for which he was nominated for a Canadian Screen Award as best Lead Actor. His break in American film came in 2004 when he was cast opposite Charlize Theron as British officer \"Julian Ellsworth\" in the wartime drama Head in the Clouds (2004) . He has been working steadily on both sides of the border and around the world ever since. Gabriel has 2 siblings, a younger brother, Charlie Hogan and an older sister, actress Jennie Rebecca Hogan. Having been raised an athlete Gabriel played sports all his life is an accomplished Hockey Player. He is also a musician, touring and playing in multiple bands including the Punk Rock outfit \"Battlescar\" along with spouse and singer Inga Cadranel","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNjMxMjg3NV5BMl5BanBnXkFtZTgwODAzMTQ3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0389527","name":"Gabriel Hogan","nicknames":["Gabe"],"idIMDB":"nm0389527"},"actorId":"nm0389527","character":"Kevin Brawner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alison Sealy-Smith","urlProfile":"http://www.imdb.com/name/nm0780585","urlPhoto":"","biography":{"bio":"Alison Sealy-Smith was born in Barbados, British West Indies. She is known for her work on X-Men (1992), Dark Water (2005) and You Kill Me (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0780585","name":"Alison Sealy-Smith","idIMDB":"nm0780585"},"actorId":"nm0780585","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ben Vereen","urlProfile":"http://www.imdb.com/name/nm0893965","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NjMwNzA5MF5BMl5BanBnXkFtZTYwNTI0Mjky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1946","placeOfBirth":" Dade County, Florida, USA","birthName":"Benjamin Augustus Middleton","height":"5' 8\" (1.73 m)","bio":"Few entertainers today are as accomplished or versatile as Ben Vereen. His legendary performances transcend time and have been woven into the fabric of this country's artistic legacy. His first love and passion is and always will be the stage. \"The theater was my first training ground. It taught me discipline, dedication and appreciation of hard work and values that will stay with me a lifetime. The stage sharpens the creative instrument and encourages you to go deeper inside and try new things,\" states Ben. On Broadway, Ben Vereen has appeared in Wicked, Fosse, I'm Not Rappaport, Hair, Jesus Christ Superstar, Pippin,Grind, Jelly's Last Jam and A Christmas Carol. His role in Pippin garnered him both the prestigious Tony Award and the Drama Desk Award for \"Best Actor in a Musical.\" For over 40 years, Ben has showcased his versatility and creativity, performing countless one-man shows not only in the United States, but also Europe, Asia and the Caribbean. He was the first simultaneous winner of the \"Entertainer of the Year,\" \"Rising Star,\" and \"Song and Dance Star\" awards from the American Guild of Variety Artists (AGVA). He also earned a coveted spot in the Casino Legends Hall of Fame. Ben and his band are currently touring his one man shows, \"Ben Sings a Tribute to Sammy Davis Jr. featuring the music of Sammy Davis Jr.\" and \"Brooklyn to Broadway\" at top performing arts centres. He also performs with symphonies around the country. While performing worldwide, Ben's acting credits continue to give us memorable roles that stand the test of time such as the unforgettable Chicken George in Roots and Louis Armstrong in Louis Armstrong - Chicago Style.Ben's television guest appearances include How I Met Your Mother, Grey's Anatomy, for which he won the Prism Award, House of Payne, Law and Order: Criminal Intent, OZ, Touched By An Angel, Second Noah, New York Undercover, The Nanny, Star Trek - The Next Generation, The Jamie Fox Show, The Promised Land, and Fresh Prince of Bel-Air as well as recurring roles on Silk Stalkings, Webster, J.J. Starbuck and Booker. For Nickelodeon, Ben provided voice-overs on the show Wonder Pets! Additional credits include: Anne Rice's Feast of All Saints(Showtime), Intruders They Are Among Us (Emmy nomination), Zoobilee Zoo, Faerie Tale Theatre's Puss N' Bootswith Gregory Hines, The Jesse Owens Story, Ellis Island (Golden Globe Nomination), Lost in London, and Salute to Liberty Special. His own network television shows are Ben Vereen: His Roots (Seven Emmy Awards), Tenspeed and Brownshoe and You Write the Songs. In the early 90's, he released a number of well-received children's Sing-Along musical videos. Ben was nominated for an NAACP Image Award for his performance in the Hallmark movie An Accidental Friendship. He appears in two soon to be released features, 21 and a Wake-Up starring Faye Dunaway andMama, I Want to Sing! in which Ben co-starred opposite Ciara and Patti LaBelle. While filming Idlewild with the award winning group Outkast, Ben also served as the acting coach for both Andre 3000 and Big Boy. In addition, Ben has been coaching the singing sensation Usher both as an entertainer and an actor. Ben was featured in the movie, On The One - Preaching to the Choir directed by Charles Randolph-Wright. Other film credits include Sweet Charity, All That Jazz, Funny Lady (Golden Globe nomination), Why Do Fools Fall in Love,And Then Came Love starring Vanessa Williams, the animated movie Once Upon a Forest, Christmas in Washingtonand The Painting which premiered at the Cannes Film Festival. In 2004, Ben was nominated for a \"Career Achievement Award\" by the Le Prix International Film Star Awards Organization. The lecture circuit has become an integral part of Ben's career, as he has become one of the Nations' most requested speakers among audiences of all ages. His strong sense of social consciousness has enabled him to reach out to his audiences and convey to them a deep feeling of understanding. His topics range from overcoming adversity, arts in education, Black history, motivational topics, recovery through physical and occupational therapy and the importance of continuing education - to name a few. Ben's gift of time has benefited many organizations. He has served on Ballet Florida's Board of Directors, the American Red Cross and Sudden Infant Death Syndrome Association. In addition, he has served as chairman of several renowned organizations including the American Heart Association and the Sudden Infant Death Syndrome Association. In 1989, he spearheaded his own organization, \"Celebrities for a Drug Free America,\" which raised more than $300,000 for drug rehabilitation centres, educational programs and inner city community-based projects. The Community Mental Health Council awarded Ben with their 2004 Lifeline Celebration Achievement Award. For his humanitarian contributions, he has received a number of awards including Israel's Cultural and Humanitarian Awards, three NAACP Image Awards, an Eleanor Roosevelt Humanitarian Award and a Victory Award. He has received honorary doctorates from the University of Arizona, Emerson College, St. Francis College, and Columbia College in Chicago. In 2001, Medgar Evers College created the Ben Vereen Scholarship for the Performing Arts, and in 2004, he received an Achievement in Excellence Award from his alma mater, the High School of the Performing Arts. Ben celebrated Eartha Kitt's 80th birthday in concert at Carnegie Hall to multiple standing ovations and in front of the Armed Forces for those men and women who have served in Iraq, truly a major highlight of his career. In 2009, he performed at the Inaugural Ball and entertained at the reopening of the Ford Theatre in Washington, D.C., which was attended by President Obama. Last year Ben entertained at the Friar's Club gala honouring CBS president Leslie Moonves. Ben is leading an ongoing diabetes awareness campaign called \"S.T.A.N.D.\" in partnership with sanofi-aventis pharmaceuticals. Ben recently starred in the world premier of Fetch Clay, Make Man directed by Des McAnuff (Jersey Boys) at the McCarter Theatre. Below are some of Ben's reviews from the show: \"A seething resentment can be sensed underneath the wary cool with which Fetchit negotiates with Fox. In brief snippets from the routines that made Fetchit famous (and infamous), Mr. Vereen also reveals the glowing pride of an entertainer whose gifts sometimes managed to transcend the offensive uses to which they were put.\" -New York Times \"The dramatic center is Ben Vereen's role as Lincoln Perry,the vaudeville performer who made his fortune in silent films and Depression-era talkies playing screen persona Stepin Fetchit, the quintessential negative stereotype of the shuffling, smiling, work-shirking Negro...Tapping all the undiminished charisma and limber body language of a veteran song-and-dance man, Vereen effortlessly sells the now-reviled representation of the black flunky while slyly asserting the cultured, savvy negotiator beneath; it's a performance of enormous charm and intelligence.\" -Variety \"As Fetchit, Ben Vereen creates a man who comports himself with dignity in hopes of negating all that he did before. In one scene, after Fetchit has been forced to acknowledge what he'd been, Vereen blinks three times, and actually manages to make a statement with each blink: The first acknowledges the charge, the second shows his pain at being reminded, and the third hopes to push away the memory.\" -The Star-Ledger Additionally, Ben has a recurring role on the CBS comedy How I Met Your Mother, playing Wayne Brady's father. In February of 2011, he released his CD Steppin' Out Live with Ben Vereen and staged a triumphant return to Broadway with his concert \"BEN VEREEN ON BROADWAY AT TOWN HALL\" . One review from Ben's show is featured below: \"Ben Vereen's performance at The Town Hall on February 18th was a lesson in performance energy.....a tour de force ....Without a single synthesizer, with no voice tuner, with only an acoustic band, Vereen displayed shocking innovation.\".....\" He flirted with off notes and inventive runs during classics such as \"My Funny Valentine.\" This is always a dangerous idea, because it risks alientating the audience who wants to hear the melody of a familiar tune, but Vereen not only pulled it off, he left the audience wanting him to do more...The lasting impression was of a man who loves life, wants you to love life, and has mastered both his medium and his message. At age 65, he is the youngest man performing today. - The Newark Examiner Ben remains the consummate actor, singer, and all around entertainer with a storied and legendary career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NjMwNzA5MF5BMl5BanBnXkFtZTYwNTI0Mjky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0893965","name":"Ben Vereen","idIMDB":"nm0893965"},"actorId":"nm0893965","character":"Wes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arnold Pinnock","urlProfile":"http://www.imdb.com/name/nm0684456","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NTIxODYwN15BMl5BanBnXkFtZTcwMzc1ODk2NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1967","placeOfBirth":" Birmingham, England, UK","height":"6' 1\" (1.85 m)","bio":"Arnold Pinnock was born on December 10, 1967 in Birmingham, England. He is known for his work on The Incredible Hulk (2008), Lars and the Real Girl (2007) and Cypher (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NTIxODYwN15BMl5BanBnXkFtZTcwMzc1ODk2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0684456","name":"Arnold Pinnock","idIMDB":"nm0684456"},"actorId":"nm0684456","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karen Robinson","urlProfile":"http://www.imdb.com/name/nm0732793","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4MTAyNjAzNF5BMl5BanBnXkFtZTgwMDUyNzEwMjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Karen Robinson is an actress, known for Lars and the Real Girl (2007), Narc (2002) and My Louisiana Sky (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4MTAyNjAzNF5BMl5BanBnXkFtZTgwMDUyNzEwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0732793","name":"Karen Robinson","idIMDB":"nm0732793"},"actorId":"nm0732793","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean Yoon","urlProfile":"http://www.imdb.com/name/nm1050153","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODczYTRjNjktODkwNS00MWNmLWIyOGMtOTk1OGIzNTI5NzZkL2ltYWdlXkEyXkFqcGdeQXVyMjI4NjU3NDY@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"bio":"Jean Yoon is a playwright and actress born in Illinois and raised in Toronto. Jean has lived and worked in Vancouver, Edmonton, Harbin City and Yanji City in North Eastern China and makes her home in Toronto. Jean began her career in Toronto in the early 1980s performing with now long gone companies such as Upstage Theatre, Toronto Free Theatre and Canasian Artists Group. In the 1990s, Jean was active as a cultural equity advocate and new play producer. She was Cross Cultural Coordinator for Theatre Ontario 1991/92, and then Co-Artistic Director of Cahoots Theatre Projects 1992 to early 1994, founding Lift Off! and cementing Cahoots' role as a leader in new play development for playwrights of diverse cultures. Jean's playwriting credits include the Dora-nominated stage play, The Yoko Ono Project, a multimedia performance art comedy, produced by Loud Mouth Asian Babes and Theatre Passe Muraille in Toronto, January 2000, and published by Broken Jaw Press. Jean's comedic adaptation of a classic Korean folktale Hongbu & Nolbu: The Tale of the Magic Pumpkins premiered at Young Peoples Theatre in 2005 and was published in Seven Contemporary Plays from the Korean Diaspora in the Americas, edited by Esther Kim Lee, Duke University Press in 2012. Other playwriting credits include Sliding for Home, Spite, and Yes Yoko Solo. Jean's stage credits include Necessary Angel, Young Peoples Theatre, Factory, Tarragon, Cahoots Theatre Projects, Crows, Civilized Theatre and Die in Debt. Jean originated the role \"Umma\" in the Toronto Fringe production of Kim's Convenience in 2011 and performed the show at Soulpepper Theatre, The Grand Theatre London, National Arts Centre, Theatre Calgary, Theatre Aquarius and the Capitol Theatre in Port Hope. Jean is well-known for her work as Umma in the CBC comedy series Kim's Convenience. She is also known for work on The Expanse, Orphan Black, Dragon Boys and The Time Traveler's Wife. Jean voices Connie on the Emmy Award winning PBS Kids show Peg + Cat; and is especially proud of her work on the CBC mini-series Dragon Boys for which she earned a Gemini nomination in 2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODczYTRjNjktODkwNS00MWNmLWIyOGMtOTk1OGIzNTI5NzZkL2ltYWdlXkEyXkFqcGdeQXVyMjI4NjU3NDY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1050153","name":"Jean Yoon","idIMDB":"nm1050153"},"actorId":"nm1050153","character":"Lila Jones","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Taylor Trowbridge","urlProfile":"http://www.imdb.com/name/nm1937043","urlPhoto":"","biography":{"bio":"Taylor Trowbridge is an actress, known for Miss Yvonne (2008), Half a Person (2007) and Orphan Black (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1937043","name":"Taylor Trowbridge","idIMDB":"nm1937043"},"actorId":"nm1937043","character":"Gloria","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Philippa Domville","urlProfile":"http://www.imdb.com/name/nm1141228","urlPhoto":"","biography":{"bio":"Philippa Domville is known for her work on Survival of the Dead (2009), Miss Yvonne (2008) and An Amish Murder (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1141228","name":"Philippa Domville","nicknames":["Pippa"],"idIMDB":"nm1141228"},"actorId":"nm1141228","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Diego Fuentes","urlProfile":"http://www.imdb.com/name/nm0297402","urlPhoto":"","biography":{"bio":"Diego Fuentes is an actor, known for How to Lose a Guy in 10 Days (2003), Dark Water (2005) and Hollywoodland (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0297402","name":"Diego Fuentes","idIMDB":"nm0297402"},"actorId":"nm0297402","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kelly Fiddick","urlProfile":"http://www.imdb.com/name/nm0275728","urlPhoto":"","biography":{"bio":"Kelly Fiddick is known for his work on Blindness (2008), Screwed (2000) and Miss Yvonne (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0275728","name":"Kelly Fiddick","idIMDB":"nm0275728"},"actorId":"nm0275728","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Duane Murray","urlProfile":"http://www.imdb.com/name/nm0614926","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNjg0MzY0MV5BMl5BanBnXkFtZTcwMjUyODQxOA@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"bio":"Duane Murray is an actor and writer, known for Spotlight (2015), The Time Traveler's Wife (2009) and Remember (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNjg0MzY0MV5BMl5BanBnXkFtZTcwMjUyODQxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0614926","name":"Duane Murray","idIMDB":"nm0614926"},"actorId":"nm0614926","character":"Officer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elizabeth Harpur","urlProfile":"http://www.imdb.com/name/nm0364023","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDZkZmNkODQtYTI1Zi00NTczLWE3OWItZDNkZGU2YjczM2QzXkEyXkFqcGdeQXVyMjM0MjEzOTU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Elizabeth Harpur is an actress, known for Silent Hill (2006), Bogus (1996) and Perfectly Normal (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDZkZmNkODQtYTI1Zi00NTczLWE3OWItZDNkZGU2YjczM2QzXkEyXkFqcGdeQXVyMjM0MjEzOTU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0364023","name":"Elizabeth Harpur","idIMDB":"nm0364023"},"actorId":"nm0364023","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rick Demas","urlProfile":"http://www.imdb.com/name/nm0218188","urlPhoto":"","biography":{"bio":"Rick Demas is an actor, known for Half Baked (1998), Exit Wounds (2001) and Blindness (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0218188","name":"Rick Demas","idIMDB":"nm0218188"},"actorId":"nm0218188","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1242861","urlIMDB":"http://www.imdb.com/title/tt1242861","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"26","month":"05","year":"2008","remarks":null},{"money":null,"country":null,"day":"17","month":"06","year":"2008","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 25 min (85 min) (Portugal)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":["Panavision Camera and Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":["HD 1080i"],"printedFilmFormat":null},"rating":"7.0","filmingLocations":[{"location":"Hamilton, Ontario, Canada"}],"awards":[{"award":"Primetime Emmy Awards 2009","titlesAwards":[{"titleAwardOutcome":"Nominated Primetime Emmy","categories":[{"category":"Outstanding Lead Actress in a Miniseries or a Movie","names":[{"name":"Chandra Wilson","id":"nm0933156","role":null}]}]}]},{"award":"Image Awards 2009","titlesAwards":[{"titleAwardOutcome":"Nominated Image Award","categories":[{"category":"Outstanding Television Movie, Mini-Series or Dramatic Special","names":[]},{"category":"Outstanding Actor in a Television Movie, Mini-Series or Dramatic Special","names":[{"name":"Ben Vereen","id":"nm0893965","role":null}]},{"category":"Outstanding Actress in a Television Movie, Mini-Series or Dramatic Special","names":[{"name":"Chandra Wilson","id":"nm0933156","role":null}]}]}]},{"award":"Online Film & Television Association 2009","titlesAwards":[{"titleAwardOutcome":"Nominated OFTA Television Award","categories":[{"category":"Best Actress in a Motion Picture or Miniseries","names":[{"name":"Chandra Wilson","id":"nm0933156","role":null}]}]}]},{"award":"Prism Awards 2009","titlesAwards":[{"titleAwardOutcome":"Won Prism Award","categories":[{"category":"Performance in a TV Movie or Miniseries","names":[{"name":"Chandra Wilson","id":"nm0933156","role":null}]}]},{"titleAwardOutcome":"Nominated Prism Award","categories":[{"category":"TV Movie or Miniseries","names":[]}]}]}],"votes":"268","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0227149","name":"Automatic Pictures"},{"idCompany":"co0005803","name":"Muse Entertainment Enterprises"}],"keywords":{"keywords":["black white friendship","rehab","alcoholic","unlikely friendship","dog food","dog","cancer","puppy","pet dog","friendship","white woman","black woman","police woman","police officer","homeless woman","homelessness","homeless","based on true story","medal"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 06:29:17"}}