{"data":{"movies":[{"title":"The Lost Treasure of the Grand Canyon","originalTitle":"","year":"2008","releaseDate":"20081220","directors":[{"name":"Farhad Mann","id":"nm0542752"}],"writers":[{"name":"Clay Carmouche","id":"nm0138594"}],"runtime":"88 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMTgzNTY2M15BMl5BanBnXkFtZTcwNDgxOTIxMw@@._V1.jpg","countries":["Canada"],"languages":["English"],"genres":["Adventure","Fantasy","Horror"],"plot":"Set in the Grand Canyon, a team of Smithsonian researchers have stumbled across a lost walled Aztec city guarded by some evil spirits, including a \"great flying serpent of death.\" As days turn to weeks, Susan Jordan, the daughter of the professor leading the expedition, assembles a team to rescue her father and his colleagues from the clutches of the ancient Aztec warriors and their horrible serpent god.","simplePlot":"Set in the Grand Canyon, a team of Smithsonian researchers have stumbled across a lost walled Aztec city guarded by some evil spirits, including a \"great flying serpent of death.\" As days ... ","actors":[{"actorName":"Michael Shanks","urlProfile":"http://www.imdb.com/name/nm0788218","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzc2NTE0NF5BMl5BanBnXkFtZTcwOTQ5OTQ1Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 December 1970","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"Michael Garrett Shanks","height":"6' (1.83 m)","bio":"Michael Shanks was born on December 15, 1970 in Vancouver, British Columbia, Canada as Michael Garrett Shanks. He is an actor and director, known for Stargate SG-1 (1997), Elysium (2013) and Stargate: Continuum (2008). He has been married to Lexa Doig since August 2, 2003. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzc2NTE0NF5BMl5BanBnXkFtZTcwOTQ5OTQ1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0788218","name":"Michael Shanks","idIMDB":"nm0788218"},"actorId":"nm0788218","character":"Jacob Thain","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shannen Doherty","urlProfile":"http://www.imdb.com/name/nm0001147","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzcyOTM4OF5BMl5BanBnXkFtZTcwMDc1ODkzMg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1971","placeOfBirth":" Memphis, Tennessee, USA","birthName":"Shannen Maria Doherty","height":"5' 4\" (1.63 m)","bio":"Shannen Doherty was born in Memphis, Tennessee, USA, on April 12, 1971, to Rosa (Wright) and John Doherty. Her father worked in a bank, while her mother owned a beauty parlor. She has an older brother, Sean. Her ancestry includes Irish, English, Scottish, and remote French. In 1978, at the tender age of seven, she and her family moved to Los Angeles, where her father started a West Coast branch of the family transportation business. Shannen has always been close to her family, who disciplined her from a young age. She knew she wanted to pursue an acting career when she made her acting debut at age ten, with a role on the series Father Murphy (1981). Shannen was a confident student, involving herself in school performances and working hard in school, by making sure she always had exceptional grades. Despite her confidence, she isolated herself from large crowds and preferred to have a few close friends. She made a name for herself as a child actress at just 11-years-old, starring in Little House on the Prairie (1974) as Jenny Wilder. It was Michael Landon who noticed her performance in an episode of Father Murphy (1981), that he decided to cast her. She then went on to appear in Our House (1986) with Deidre Hall and Wilford Brimley. She also starred alongside Sarah Jessica Parker and Helen Hunt in Girls Just Want to Have Fun (1985) and then in Heathers (1988), a teen comedy also starring Winona Ryder. Her real success came in 1990, at the age of 19, when she was cast in Aaron Spelling's long-running hit series, Beverly Hills, 90210 (1990) as Brenda Walsh, the twin sister of Brandon Walsh, played by Jason Priestley. She attracted media attention from the press and eventually made her a household name. The success of the popular teen drama appealed to young teenage girls who could relate to her character, Brenda Walsh. After four years, she left the show in 1994. Afterward, she continued her work in movies, starring in the thriller Almost Dead (1994) and the comedy Mallrats (1995). During the fall of 1998, she reunited with long-time producer Aaron Spelling, when she was cast as Prue Halliwell on Charmed (1998), a show about three ordinary women who happen to be witches. She starred alongside Alyssa Milano and Holly Marie Combs. After three years, she left the show to find work in movies. Before her departure from the show, she had directed three of the last episodes in which she starred. She continued her work in movies by starring in Passion impossible (2001), The Rendering (2002), The Battle of Mary Kay (2002), and View of Terror (2003). In 2003, she hosted season one of Scare Tactics (2003) as well as season two with only 8 episodes, and then left to pursue other endeavors. In the fall of 2004, Shannen made her return to television on Fox's drama series North Shore (2004), where she played Alexandra Hudson, the long-lost sister of Nicole Booth, played by Brooke Burns. Eventually the show was canceled after one season. Then in 2005, she landed the role of Denise Johnson on the UPN series Love, Inc. (2005), however after the pilot episode she was dropped from the sitcom. From there she has ventured into new projects and in 2006, she starred in her own reality series, Breaking Up with Shannen Doherty (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzcyOTM4OF5BMl5BanBnXkFtZTcwMDc1ODkzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001147","name":"Shannen Doherty","nicknames":["Shando"],"idIMDB":"nm0001147"},"actorId":"nm0001147","character":"Susan Jordan","urlCharacter":"http://www.imdb.com/character/ch0414187","main":true},{"actorName":"JR Bourne","urlProfile":"http://www.imdb.com/name/nm0100068","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNTcxNjQ4NF5BMl5BanBnXkFtZTgwMjU3ODY5NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1970","placeOfBirth":" Toronto, Ontario, Canada","birthName":"David J. R. Bourne","height":"5' 9¾\" (1.77 m)","bio":"JR Bourne was born on April 8, 1970 in Toronto, Ontario, Canada as David J. R. Bourne. He is an actor and producer, known for Teen Wolf (2011), The Exorcism of Emily Rose (2005) and Thir13en Ghosts (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNTcxNjQ4NF5BMl5BanBnXkFtZTgwMjU3ODY5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0100068","name":"JR Bourne","idIMDB":"nm0100068"},"actorId":"nm0100068","character":"Marco Langford","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Toby Berner","urlProfile":"http://www.imdb.com/name/nm0962117","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MTQxOTEzOF5BMl5BanBnXkFtZTgwMTY0MjI2MzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Toby Berner is an actor, known for The Lost Treasure of the Grand Canyon (2008), Suckerpunch (2000) and Smallville (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MTQxOTEzOF5BMl5BanBnXkFtZTgwMTY0MjI2MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0962117","name":"Toby Berner","idIMDB":"nm0962117"},"actorId":"nm0962117","character":"Stewart Dunbar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Heather Doerksen","urlProfile":"http://www.imdb.com/name/nm1976541","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NTI4ODk2NV5BMl5BanBnXkFtZTgwMTc3NTY0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1980","placeOfBirth":" Winnipeg, Manitoba, Canada","height":"5' 9½\" (1.77 m)","bio":"Standing at almost 5'10\", Heather Doerksen (the \"O\" is silent) was born in Winnipeg, Manitoba, Canada. Heading into college, her goal was to study Biological Sciences, but it took one influential acting class to convince her to switch her major. She graduated with her BFA in Theatre from Simon Fraser University in British Columbia. After primarily acting in theatre productions, Heather landed her first screen roles on 'Smallville' and 'The L Word' in 2005. She is also a prolific voiceover actress and has voiced many advertising campaigns and cartoon characters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NTI4ODk2NV5BMl5BanBnXkFtZTgwMTc3NTY0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1976541","name":"Heather Doerksen","idIMDB":"nm1976541"},"actorId":"nm1976541","character":"Hildy Wainwright","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Duncan Fraser","urlProfile":"http://www.imdb.com/name/nm0292114","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzAzOTA3NzA4NF5BMl5BanBnXkFtZTYwNjMxMTAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Duncan Fraser was born in Greater Manchester, England. He is an actor, known for The Exorcism of Emily Rose (2005), Seven Years in Tibet (1997) and Needful Things (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzAzOTA3NzA4NF5BMl5BanBnXkFtZTYwNjMxMTAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0292114","name":"Duncan Fraser","idIMDB":"nm0292114"},"actorId":"nm0292114","character":"Dr. Samual Jordan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter New","urlProfile":"http://www.imdb.com/name/nm0627586","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE2NzMwOTY0MV5BMl5BanBnXkFtZTYwMDg5OTYy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1971","placeOfBirth":" Vancouver, British Columbia, Canada","height":"6' (1.83 m)","bio":"Born and raised in Vancouver (but for a year in New Zealand), Peter began acting in grade nine. He joined the Vancouver Youth Theatre at 16, and began a comedy troupe called The Legend of Bonefish at nineteen. After toiling for a decade in clubs and cabarets, Peter finally made the move to film and television where he began to find roles immediately, and to voice acting where his breakout was longer in the making, but perhaps even more well-received when it came. Peter is committed to making his own work happen, by writing and performing in independent films, including co-producing some of those old cabaret sketches and popping them online twenty years after the fact. Peter's acting has taken him far and wide, from Ohio to Australia, New York and Uganda. He looks forward to discovering all of the places this craft may take him, both inside himself, and out there in the larger world.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE2NzMwOTY0MV5BMl5BanBnXkFtZTYwMDg5OTYy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0627586","name":"Peter New","idIMDB":"nm0627586"},"actorId":"nm0627586","character":"Isaac Preston","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Byron Chief-Moon","urlProfile":"http://www.imdb.com/name/nm0157294","urlPhoto":"","biography":{"height":"6' 2\" (1.88 m)","bio":"Byron was born in Carlsbad, California. He traveled back to his mother's homeland in southern Alberta as a young child. He now travels between Vancouver B.C. and Los Angeles California with his family. He founded a dance/theatre company called Coyote Arts Percussive Performance Assoc. 'aka' CAPPA, with this co. he cross overs traditional Blackfoot stories, dances and songs into contemporary form. Check out the website COYOTEARTS.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0157294","name":"Byron Chief-Moon","idIMDB":"nm0157294"},"actorId":"nm0157294","character":"Aztec Priest","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"A.C. Peterson","urlProfile":"http://www.imdb.com/name/nm0012586","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3MTAxMzg3NDFeQTJeQWpwZ15BbWU4MDQzMTQzMjcx._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"birthName":"Alar Aedma","bio":"A.C. Peterson was born as Alar Aedma. He is known for his work on Shooter (2007), Sucker Punch (2011) and Narc (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3MTAxMzg3NDFeQTJeQWpwZ15BbWU4MDQzMTQzMjcx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0012586","name":"A.C. Peterson","idIMDB":"nm0012586"},"actorId":"nm0012586","character":"Dr. Gilmore","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rob McConachie","urlProfile":"http://www.imdb.com/name/nm1993344","urlPhoto":"","biography":{"dateOfBirth":"14 April 1968","placeOfBirth":" Montreal, Québec, Canada","bio":"Rob McConachie was born on April 14, 1968 in Montreal, Québec, Canada. He is an actor and producer, known for The Lost Treasure of the Grand Canyon (2008), Four Spots (2005) and The Pruning Act (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1993344","name":"Rob McConachie","idIMDB":"nm1993344"},"actorId":"nm1993344","character":"Dr. Wilson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Luis Javier","urlProfile":"http://www.imdb.com/name/nm2760381","urlPhoto":"","biography":{"bio":"Luis Javier is an actor, known for 2012 (2009), Grave Encounters (2011) and El Gigante (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2760381","name":"Luis Javier","idIMDB":"nm2760381"},"actorId":"nm2760381","character":"Hugo San Martin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Kent","urlProfile":"http://www.imdb.com/name/nm0448827","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4ODY0NDE4M15BMl5BanBnXkFtZTYwMDYxMzcy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 June 1957","placeOfBirth":" North Vancouver, British Columbia, Canada","birthName":"Peter Harris Kent","height":"6' 5\" (1.96 m)","bio":"Born June 23, 1957, in North Vancouver, British Columbia, Canada, Peter Kent was predestined to be a thrillseeker and adrenaline addict. As a young child, raised along the banks of the often treacherous Seymour River, he was shooting rapids and climbing the highest trees available, then letting himself fall through the branches to the ground, or pedaling his bicycle across planks placed 12 feet atop the family's laurel hedge to get the desired adrenaline rush, usually resulting in lacerations and stitches. On another occasion he tried to extract his own loose teeth with a hammer in the family garage. At six years of age his parents divorced and he moved to New Jersey with his mother, a move responsible for the dual Canadian-US citizenship which would come in so useful later in life. Returning again to Canada at age 11, he and his mother ran a local bed-and-breakfast style boarding house while he attended Nanaimo Senior Secondary school on Vancouver Island, and worked in the usual variety of West Coast jobs: Sawmill, salmon fishing, pulp mill, paving crew, bouncer and electronics salesperson in both the towns of Nanaimo and Victoria. He also worked on the road as a sound engineer for various Canadian bands, for five bohemian years. Nearly killed in a terrible motor vehicle accident in the early 1980s, he survived only through willpower. Multiple skull fractures, broken cheekbones, a crushed nose and a fractured jaw transformed his look, some say, to closely resemble actor Arnold Schwarzenegger. This was to prove fateful indeed. In 1984, having done Shakespeare in various local theater groups, he decided to move to Los Angeles to pursue a film career, although he had no previous film experience or acquaintances in Los Angeles. After living in the notorious YMCA off Hollywood's infamous Sunset Strip for a tenuous and outrageous six months, he was taken under the wing of James Cameron to double Schwarzenegger in The Terminator (1984). His minimal stunt experience did not stop him from quickly learning the ropes and becoming one of the most celebrated and highly paid stuntmen in the business. His association with Schwarzenegger lasted 14 films and 13 years, both as friend, workout partner, ski buddy, confidant, chef and dialogue coach. His apprenticeship on 14 of Schwarzenegger's films (from \"Terminator\" to Jingle All the Way (1996)) has put Kent in a position to understand that genre better than most, and having access to a variety of the best screenplays in Hollywood, was to again prove useful in later years. While making Eraser (1996), Kent was almost killed when he was struck by a three-ton shipping container 100 feet in the air. It was then he decided to pursue a different, less life-threatening line of work, seeing as how he had been injured in some way during nearly all of Schwarzegenner's pictures. He has studied with several different Los Angeles-based drama groups, but his longtime coach has been Zina Provendie, former head of MGM's drama department for 26 years, and coach to James Dean in Giant (1956), as well as Richard Burton and Elizabeth Taylor in Cleopatra (1963). After a 14 year absence, Kent returned home to Vancouver,BC, where he met the love of his life, a nurse, Marcia Kent. The two were engaged in Venice,Italy in December of 2005 and married in Victoria, BC in August of 2007. Currently, they are expecting twin boys in the fall of 2009. Kent has been interviewed in numerous publications, including \"Entertainment Tonight\",\"Extra\", \"People Magazine\", Germany's \"Der Stern\", as well as London's \"Daily Mirror\", \"The New York Times\", \"Dallas Star\", \"Los Angeles Times\" and hundreds of TV and radio stations worldwide. In June 2009, Kent was inducted into the \"Hollywood Stuntman's Hall of Fame.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4ODY0NDE4M15BMl5BanBnXkFtZTYwMDYxMzcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0448827","name":"Peter Kent","idIMDB":"nm0448827"},"actorId":"nm0448827","character":"Javier Bordellos","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Darcy Laurie","urlProfile":"http://www.imdb.com/name/nm0491394","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NjUyNzQyOV5BMl5BanBnXkFtZTcwMzQ5Mzg5Mg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 March 1966","placeOfBirth":" Montréal, Québec, Canada","bio":"Darcy Laurie was born on March 28, 1966 in Montréal, Québec, Canada. He is an actor and writer, known for The Chronicles of Riddick (2004), Final Destination 2 (2003) and Walking Tall (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NjUyNzQyOV5BMl5BanBnXkFtZTcwMzQ5Mzg5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0491394","name":"Darcy Laurie","idIMDB":"nm0491394"},"actorId":"nm0491394","character":"Mexican Bartender","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Howard J. Davis","urlProfile":"http://www.imdb.com/name/nm5358217","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmYwMjMwMDAtZDY3MC00ZjdkLTkwODctMGUyYmJmOTY3YmQyL2ltYWdlXkEyXkFqcGdeQXVyMzc2NDgxMjY@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Howard \"John\" Davis was born on December 2nd 1990 in Bath, England to Kelly, a carpenter and Clare, a pharmacy technician. In 2002 Howard immigrated to Canada with his family settling in Kelowna, British Columbia. He was a well respected, hardworking student who, during his free time, participated in as many possible school and community plays and productions. Upon graduating Kelowna Secondary School in 2008 he attended Ryerson Theatre School in Toronto with his sister Kathryn Davis also stage and screen actress. Graduating in June of 2014 Howard joined as a company member with the renowned Shaw Festival in Niagara-on-the-Lake in Ontario, Canada as part of their 2015 season.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmYwMjMwMDAtZDY3MC00ZjdkLTkwODctMGUyYmJmOTY3YmQyL2ltYWdlXkEyXkFqcGdeQXVyMzc2NDgxMjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5358217","name":"Howard J. Davis","nicknames":["Howie"],"idIMDB":"nm5358217"},"actorId":"nm5358217","character":"Aztec Guard","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1229370","urlIMDB":"http://www.imdb.com/title/tt1229370","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"26","month":"04","year":"2008","remarks":null},{"money":null,"country":null,"day":"14","month":"05","year":"2008","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 28 min (88 min)"],"soundMix":null,"color":null,"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"3.9","filmingLocations":[{"location":"Cache Creek, British Columbia, Canada"}],"awards":[],"votes":"1,164","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0149567","name":"Front Street Pictures"},{"idCompany":"co0000869","name":"Starz!"}],"keywords":{"keywords":["aztec indian"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:24:54"}}