{"data":{"movies":[{"title":"Moby Dick","originalTitle":"","year":"2011–","releaseDate":"20110801","writers":[],"runtime":"184 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzg0MjFmMjAtMmNlMC00ZmEzLWE0ZDQtYTFhZjAyNzIxZWU3XkEyXkFqcGdeQXVyMjQwMjk0NjI@._V1.jpg","countries":["Germany","Austria"],"languages":["English"],"genres":["Adventure","Drama"],"plot":"The sole survivor of a lost whaling ship relates the tale of his captain's self-destructive obsession to hunt the white whale, Moby Dick.","simplePlot":"The sole survivor of a lost whaling ship relates the tale of his captain's self-destructive obsession to hunt the white whale, Moby Dick.","actors":[{"actorName":"William Hurt","urlProfile":"http://www.imdb.com/name/nm0000458","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNzA5MTUxN15BMl5BanBnXkFtZTcwMTU3ODQ3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1950","placeOfBirth":" Washington, District of Columbia, USA","birthName":"William M. Hurt","height":"6' 2\" (1.88 m)","bio":"William McChord Hurt was born in Washington, D.C., to Claire Isabel (McGill) and Alfred McChord Hurt, who worked at the State Department. He was trained at Tufts University and The Juilliard School and has been nominated for four Academy Awards, including the most recent nomination for his supporting role in David Cronenberg's A History of Violence (2005). Hurt received Best Supporting Actor accolades for the role from the Los Angeles Film Critics circle and the New York Film Critics Circle. Hurt spent the early years of his career on the stage between drama school, summer stock, regional repertory and off-Broadway, appearing in more than fifty productions including \"Henry V\", \"5th of July\", \"Hamlet\", \"Uncle Vanya\", \"Richard II\", \"Hurlyburly\" (for which he was nominated for a Tony Award), \"My Life\" (winning an Obie Award for Best Actor), \"A Midsummer's Night's Dream\" and \"Good\". For radio, Hurt read Paul Theroux's \"The Grand Railway Bazaar\", for the BBC Radio Four and \"The Shipping News\" by Annie Proulx. He has recorded \"The Polar Express\", \"The Boy Who Drew Cats\", \"The Sun Also Rises\" and narrated the documentaries, \"Searching for America: The Odyssey of John Dos Passos\", \"Einstein-How I See the World\" and the English narration of Elie Wiesel's \"To Speak the Unspeakable\", a documentary directed and produced by Pierre Marmiesse. In 1988, Hurt was awarded the first Spencer Tracy Award from UCLA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNzA5MTUxN15BMl5BanBnXkFtZTcwMTU3ODQ3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000458","name":"William Hurt","nicknames":["Bill"],"idIMDB":"nm0000458"},"actorId":"nm0000458","character":" Captain Ahab","urlCharacter":"http://www.imdb.com/character/ch0022067","main":true},{"actorName":"Ethan Hawke","urlProfile":"http://www.imdb.com/name/nm0000160","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NDMxMTI0MF5BMl5BanBnXkFtZTYwMjE3ODE0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 November 1970","placeOfBirth":" Austin, Texas, USA","birthName":"Ethan Green Hawke","height":"5' 10¾\" (1.8 m)","bio":"Ethan Green Hawke was born on November 6, 1970 in Austin, Texas, to Leslie Carole (Green), a charity worker, and James Steven Hawke, an insurance actuary. His parents were students at the University of Texas at the time but divorced when Ethan was 5 years old. His mother raised him alone for the next five years, moving around the country, until she remarried in 1981 and the family settled in Princeton Junction, New Jersey. He attended West Windsor-Plainsboro High School and then transferred to the Hun School of Princeton and it was while he was there that he began taking acting classes at the McCarter Theatre on the Princeton campus. His early ambition had been to be a writer, but as a result of the acting lessons and appearances in student productions he persuaded his mother to allow him to attend an audition for a role in a sci-fi adolescent adventure, Explorers (1985). He got the part (along with River Phoenix) but although the movie was favourably reviewed, it met with little commercial success which discouraged Hawke from pursuing further movie roles for a few years. He was admitted to the prestigious Carnegie-Mellon University to study theatre but his studies were interrupted when he won his break-through role opposite Robin Williams in Dead Poets Society (1989) and he didn't complete his degree. His subsequent acting career was a mix of theatre work (earning a number of awards and nominations, including a Tony nomination for his role in The Coast of Utopia at the Lincoln Center in New York), and a mix of \"serious\" and more commercial movies, notably Gattaca (1997) (where he met his first wife, Uma Thurman) and Training Day (2001). Meanwhile, he also pursued his childhood ambition and has written two novels and several screenplays.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NDMxMTI0MF5BMl5BanBnXkFtZTYwMjE3ODE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000160","name":"Ethan Hawke","idIMDB":"nm0000160"},"actorId":"nm0000160","character":" Starbuck","urlCharacter":"http://www.imdb.com/character/ch0022066","main":true},{"actorName":"Charlie Cox","urlProfile":"http://www.imdb.com/name/nm1214435","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0Mzg5MTU3MV5BMl5BanBnXkFtZTgwOTUxMTQ5NzE@._V1_UY44_CR19,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 December 1982","placeOfBirth":" London, England, UK","height":"5' 10\" (1.78 m)","bio":"Charlie Thomas Cox was born in London, England, to Patricia C. A. (Harley) and Andrew Frederick Seaforth Cox, a publisher. He has English, Scottish, and Irish ancestry, and descends from several prominent forebears (Baronets of Agnew and Carnegie, an Earl of Findlater, and a Colonial Governor of New York, Andrew Elliot). Cox was educated and received his training in drama at Sherborne School in Dorset where he appeared in Dealer's Choice / Patrick Marber (Mugsy) The Writing Game (Leo) Code Crackers / Andy Wilkinson (Weasel) Confusions / Alan Aykbourne (Martin & Arthur) Henry V (Nym & John Bates). He received the Gerald Pitman Award for Acting from Sherborne School. He also appeared in Judge John Deed (2001) as the Young Vicar. He starred in Things to Do Before You're 30 (2005) (formerly You Don't Have To Say You Love Me), with Dougray Scott, The Merchant of Venice (2004), with Al Pacino, and Dot the I (2003) (aka Obsession) with Gael García Bernal, which received rave reviews at The Sundance Film Festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0Mzg5MTU3MV5BMl5BanBnXkFtZTgwOTUxMTQ5NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1214435","name":"Charlie Cox","idIMDB":"nm1214435"},"actorId":"nm1214435","character":" Ishmael","urlCharacter":"http://www.imdb.com/character/ch0039121","main":true},{"actorName":"Eddie Marsan","urlProfile":"http://www.imdb.com/name/nm0550371","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNjk0MTAxNV5BMl5BanBnXkFtZTcwMTA2NjQ0Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 June 1968","placeOfBirth":" Stepney, London, England, UK","birthName":"Edward Maurice Charles Marsan","height":"5' 8½\" (1.74 m)","bio":"Eddie Marsan was born in Bethnal Green, East London, to a lorry driver father and a school employee mother. He served an apprenticeship as a printer before becoming an actor twenty years ago. During this time he has worked with directors such as Martin Scorsese, Michael Mann, Steven Spielberg, Terrence Malick, Woody Allen, Alejandro González Iñárritu, J.J. Abrams, Peter Berg, Guy Ritchie and Richard Linklater. He has collaborated with Mike Leigh on three films: Vera Drake (2004), for which he won the British Independent Film Award for best supporting actor; Happy-Go-Lucky (2008), for which he also won a BIFA for best supporting actor as well as the London Film Critics Circle Award and the National Society Of Film Critics; and he has just completed Mike Leigh's latest film, A Running Jump (2012). He was nominated for an Evening Standard Film Award for best actor for The Disappearance of Alice Creed (2009). He is a patron for the School of the Science of Acting and Kazzum, a children's theatre company that promotes the acceptance of Diversity. He is married to the make-up artist Janine Schneider (aka Janine Schneider-Marsan) and they have four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNjk0MTAxNV5BMl5BanBnXkFtZTcwMTA2NjQ0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0550371","name":"Eddie Marsan","idIMDB":"nm0550371"},"actorId":"nm0550371","character":" Stubb","urlCharacter":"http://www.imdb.com/character/ch0079001","main":true},{"actorName":"Gillian Anderson","urlProfile":"http://www.imdb.com/name/nm0000096","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTc4MTkxNTk1M15BMl5BanBnXkFtZTgwNzQwMjQ1MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1968","placeOfBirth":" Chicago, Illinois, USA","birthName":"Gillian Leigh Anderson","height":"5' 3\" (1.6 m)","bio":"Gillian Anderson was born in Chicago, Illinois, to Rosemary Alyce (Lane), a computer analyst, and Homer Edward Anderson III, who owned a film post-production company. She has English, German, and Irish ancestry. Gillian started her career as a member of an amateur actor group while at high school. In 1987, her love of the theatre took her to the National Theatre of Great Britain Summer Acting Programme held at Cornell University in Ithaca, New York. For several weeks she studied under such NT greats as Peter Chelsom, Bardy Thomas, and Michael Joyce. Afterwards, Anderson returned to the Goodman Theatre School at DePaul University in Chicago, Illinois where she finished her education. Her big break came with The X-Files (1993) (with David Duchovny) as Dana Scully. There, she met her future husband (Clyde Klotz), marrying on January 1st 1994. One month later, Gillian was pregnant. Her daughter, Piper Anderson, was born on the 25th September 1994. Her film career started with the movie The Turning (1992) in 1997 and, the following year, she starred in Playing by Heart (1998) with Sean Connery, Ellen Burstyn, Angelina Jolie and Dennis Quaid.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTc4MTkxNTk1M15BMl5BanBnXkFtZTgwNzQwMjQ1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000096","name":"Gillian Anderson","idIMDB":"nm0000096"},"actorId":"nm0000096","character":" Elizabeth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Billy Boyd","urlProfile":"http://www.imdb.com/name/nm0101710","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzOTEyMTQ3OF5BMl5BanBnXkFtZTYwNzkzMDk1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1968","placeOfBirth":" Glasgow, Scotland, UK","birthName":"William Boyd","height":"5' 6½\" (1.69 m)","bio":"Billy Boyd was born in 1968 in Glasgow, Scotland, to Mary and William Boyd. The talented young boy, inspired by Star Wars to try acting, got his first taste of it in his school's production of Oliver Twist when he was 10. Boyd's parents were extremely supportive, driving over two hours to get him to the performances, but sadly they passed away when he was 12. He was thereafter raised by his grandmother. He realized that he enjoyed acting very much and told his school counselor that was what he wanted to be, but the counselor discouraged this choice and told him to \"keep it secret\". When he was 17 he left school and went to work in a book-binding workshop. He worked there 4 years as an apprentice and 2 years as a workman. Ironically, during the years he worked at the book-binders, the Lord of the Rings trilogy was printed and bound there, many copies bound by his hands. After the 6 years as a book-binder, he was thoroughly sick of it. Billy planned on going to America for a year, but before he went he called the Royal Scottish Academy of Music and Drama and asked about applying for when he got back. But it so happened that they still had space for this year and they asked him if he wanted to apply and he did. He was at the drama school in a 3-year course for his bachelor of arts degree, meanwhile studying everything from Shakespeare to puppet-making. During this time Billy had a few small roles in TV series such as \"Down Amongst The Boys\" and \"Taggart\". After graduating he performed in many plays like 'The Slab Boys', 'The Diary of Adrian Mole' etc. at The St. Andrews theatre which were his first paying roles. He then received a call from his agent about the Lord of the Rings movies and if he would like to audition for them. He went along not expecting much, but within a few months Peter Jackson came out to Scotland to meet him and to audition him personally. While rehearsing for a show he received a call from his agent who said that the part of Pippin had been offered to him - if he wanted it. The rest is history.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzOTEyMTQ3OF5BMl5BanBnXkFtZTYwNzkzMDk1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0101710","name":"Billy Boyd","nicknames":["Bill"],"idIMDB":"nm0101710"},"actorId":"nm0101710","character":" Elijah","urlCharacter":"http://www.imdb.com/character/ch0022068","main":true},{"actorName":"Raoul Max Trujillo","urlProfile":"http://www.imdb.com/name/nm0874232","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA3ODAxMTk5MV5BMl5BanBnXkFtZTgwODA1NDExMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 May 1955","placeOfBirth":" New Mexico, USA","height":"6' 1\" (1.85 m)","bio":"Raoul Max Trujillo, aka Raoul Maximiano Trujillo de Chauvelon was born in Northern New Mexico. He is a mixed blood descendant of Ute,Apache,Comanche, Pueblo, Tlascalan, French, Sephardic Jew and Andalusian Moor. After high school, he spent three years serving in the military in Germany. After his discharge, he worked as an alpine ski instructor in Taos, New Mexico. Ski Flash Magazine out of France wrote about him and his unique style of teaching skiing. He left the world of professional skiing after traveling extensively through Mexico, Central and South America on his way to teach in San Carlos de Bariloche in Argentina. It was a wake up call to exploring native America and beginning his journey in creating art based on his cultural roots.. He started work in the theatre as a scenic painter and landed his first job in 1977 as an actor/dancer in a production of \"EQUUS\", in Santa Fe, N.M. It was his first paid professional work as well as his debut in the theatre with no training at all albeit high school drama. He now had the bug to study formally. He began dancing in Los Angeles in 1978 at USC and saw his first modern dance and ballet productions; Pilobolus, Martha Graham and Rudolph Nureyev. He was hooked. The next two years, he trained extensively with the Toronto Dance Theatre and Nikolais/Louis Dance Lab in New York City on scholarships. He was asked to join Nikolais Dance Theatre under the direction of the master Alwin Nikolais, who became his mentor and he began touring the world performing in the grandest of opera houses and old Roman theaters in northern Africa to bamboo fields in China. He also learned scenic, costume and lighting design during this time from 1980 to 1987. After leaving the company, he began his solo work as dancer and choreographer and commenced his journey into shamanic ceremonials and incorporating native myths and legends in his work. After the first decade of performing as a dancer, he became the choreographer and co-director for the American Indian dance Theatre, the first professional native dance company incorporating traditional dance with contemporary retelling of myths and legends. He choreographed, \"The Shaman's Journey\", for the Asia Society in New York City and later was adapted into a short film for PBS on Alive From Off Center. He went on to join creative partners Alejandro Roncerria and Rene Highway in Toronto. This work resulted in creating successful theatre pieces for Native Earth Theatre Company. He directed, \"The Son Of Ayash\" and \"The Jaguar Project\". For Buffalo State College and the Repertory Dance Theatre of Utah, he directed,\"The Maid of the Mist and the Thunder Beings\", and for the Ordway Music Theatre, \"Tribe\". His work with Alejandro continued and he helped establish the Aboriginal Dance Project at the Banff Center for the Arts to further train Indigenous dancers from all over the world. For New Line Cinema, he choreographed the dances, ceremonies and rituals for Terrence Malick's film, \"The New World\". Raoul began work as an actor in film and television in 1988 and continues to work up to the present. See resume for those projects. Finally, he created his present company Tzacol productions, Inc. in 1992. It is the umbrella company for Tzacol Tantric Theatre and Tzacol Tribal Theatre made up of dancer, actor and aerial artists, producing original work in the realm of tartaric and tribal spectacle. \"Forbidden Goddesses\", is the first realized work. Work on \"Journey\", a multi-media piece for Roots and Rhythms Festival in Santa Fe resulted in the full evening work, \"Homo Erectus\". These last works are multi-media and inter-disciplinary theatre and film projects. \"The Dreamer\" is his first completed screenplay. In 2002 he received the CANCOM Ross Charles award in Canada to attend the Banff Center's screenwriters workshop for aboriginal storytellers. The last branch of the company, Tzacol Tantric Arts produces painting and sculptural art. His work now spans more than three decades as an artist in varied disciplines and media. He has gone from dancer to choreographer, actor to director and screenwriter during this time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA3ODAxMTk5MV5BMl5BanBnXkFtZTgwODA1NDExMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0874232","name":"Raoul Max Trujillo","idIMDB":"nm0874232"},"actorId":"nm0874232","character":" Queequeg","urlCharacter":"http://www.imdb.com/character/ch0022070","main":true},{"actorName":"Daniyah Ysrayl","urlProfile":"http://www.imdb.com/name/nm2972550","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNTUzOTA2Ml5BMl5BanBnXkFtZTcwNzY5OTYyOQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 8\" (1.73 m)","bio":"Daniyah Ysrayl is an actor, known for Mr. Magorium's Wonder Emporium (2007), Nurse.Fighter.Boy (2008) and Jump In! (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNTUzOTA2Ml5BMl5BanBnXkFtZTcwNzY5OTYyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2972550","name":"Daniyah Ysrayl","idIMDB":"nm2972550"},"actorId":"nm2972550","character":" Pip","urlCharacter":"http://www.imdb.com/character/ch0222804","main":true},{"actorName":"James Gilbert","urlProfile":"http://www.imdb.com/name/nm2766221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWM2MDc3MjAtMTg2Ny00ZTRjLWJkODYtZjliNjExNmQzMDJhXkEyXkFqcGdeQXVyNjQ1MTAzNzc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1982","placeOfBirth":" Ingramport, Nova Scotia, Canada","bio":"James Gilbert was born in 1982 in Ingramport, Nova Scotia, Canada. He is an actor, known for The Conspiracy (2012), Saw VI (2009) and The Corridor (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWM2MDc3MjAtMTg2Ny00ZTRjLWJkODYtZjliNjExNmQzMDJhXkEyXkFqcGdeQXVyNjQ1MTAzNzc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2766221","name":"James Gilbert","idIMDB":"nm2766221"},"actorId":"nm2766221","character":" Steelkilt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matthew Lemche","urlProfile":"http://www.imdb.com/name/nm0501211","urlPhoto":"","biography":{"dateOfBirth":"31 May 1980","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Matthew Lemche","height":"5' 4\" (1.63 m)","bio":"Matthew Lemche was born in Etobicoke, Ontario and grew up in Brampton, a city just outside of Toronto. He is the second child of three, being the younger brother of actor Kris Lemche. He officially began his professional acting career in 1991 when he played a small guest role on \"The Kids in the Hall\" playing Scott Thompson as a boy. It wasn't until 1996, after being cast from an open call in Disney's \"Flash Forward,\" that Lemche began regular work as an actor.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0501211","name":"Matthew Lemche","idIMDB":"nm0501211"},"actorId":"nm0501211","character":" Flask","urlCharacter":"http://www.imdb.com/character/ch0022072","main":true},{"actorName":"Billy Merasty","urlProfile":"http://www.imdb.com/name/nm0580113","urlPhoto":"","biography":{"dateOfBirth":"1960","placeOfBirth":" Brochet, Manitoba, Canada","bio":"He was born a ninth child of fourteen children born to Viola Marie Merasty and Pierre Merasty in 1960 in Brochet, Manitoba, Canada. His grandfather was Joe Highway, a famous caribou hunter and champion dogsled racer; and the nephew of playwright Tomson Highway and dancer/choreographer/actor/director René Highway. He moved to Toronto, Ontario at age eighteen in search for his uncle René Highway, who was at the time working for the Toronto Dance Theatre. At age twenty-three, Billy launched his acting career after graduating from the Native Theatre School for aspiring First Nations artists. He then worked for the Native Earth Performing Arts for a long period. Billy has worked extensively on the stage and films as an actor and has written one play, Fireweed, produced in 1992. His second play, Godly's Divinia, is in development. Billy received the Order of Manitoba (Order of the Buffalo Hunt) in recognition for his many years as an Aboriginal role model from Manitoba in 2010.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0580113","name":"Billy Merasty","idIMDB":"nm0580113"},"actorId":"nm0580113","character":" Tashtego","urlCharacter":"http://www.imdb.com/character/ch0022075","main":true},{"actorName":"Onyekachi Ejim","urlProfile":"http://www.imdb.com/name/nm2165674","urlPhoto":"","biography":{"height":"6' 3\" (1.91 m)","bio":"Onyekachi Ejim is an actor and director, known for The Barber of Kigali (2008), A Winter Tale (2007) and Coopers' Camera (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2165674","name":"Onyekachi Ejim","idIMDB":"nm2165674"},"actorId":"nm2165674","character":" Dagoo","urlCharacter":"http://www.imdb.com/character/ch0022074","main":true},{"actorName":"Gary Levert","urlProfile":"http://www.imdb.com/name/nm1022857","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NzQ2MDk1NV5BMl5BanBnXkFtZTgwMTc3NzM5MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Award winning actor Gary Levert was born on August 29,1958 in Sudbury, Ontario Canada to Jackie and Ed Levert. He and his family moved to Bathurst, New Brunswick when he was eight years old where he spent most of his formative years. Gary caught the bug for acting at an early age and has been hard at it ever since. Described as a chameleon-like actor Gary is well known to TV and film audiences north and south of the border and has amassed an impressive resume. Working on Moby Dick with William Hurt and Ethan Hawke, Bag of Bones with Pierce Brosnan, and Jesse Stone with Tom Selleck to name a few. Gary's most notable and critically acclaimed performance came with his 1st ACTRA Award in Trudeau II Maverick in the Making. He was presented with his second ACTRA Award for his work on the film, Heart of Rhyme, written and directed by Cory Bowles. He was also nominated for his third ACTRA Award for his compelling performance in Shandi Mitchell's, The Disappeared, along side Billy Campbell, Shawn Doyle and Brian Downy. Gary just wrapped on his first season in the TV drama, Le Clan directed by Jim Donovan for Radio Canada where he plays Damien Logan, an Irish Montrealer, as an organized crime Kingpin.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NzQ2MDk1NV5BMl5BanBnXkFtZTgwMTc3NzM5MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1022857","name":"Gary Levert","idIMDB":"nm1022857"},"actorId":"nm1022857","character":" Perth","urlCharacter":"http://www.imdb.com/character/ch0022077","main":true},{"actorName":"Richard Donat","urlProfile":"http://www.imdb.com/name/nm0232195","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxODkxMDgzMV5BMl5BanBnXkFtZTgwNjU5MDg5MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1941","placeOfBirth":" Kentville, Nova Scotia, Canada","height":"6' 3\" (1.91 m)","bio":"Richard Donat was born on June 1, 1941 in Kentville, Nova Scotia, Canada. He is an actor, known for Haven (2010), The Weight of Water (2000) and Pit Pony (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxODkxMDgzMV5BMl5BanBnXkFtZTgwNjU5MDg5MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0232195","name":"Richard Donat","idIMDB":"nm0232195"},"actorId":"nm0232195","character":" Inn Landlord","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sandy MacLean","urlProfile":"http://www.imdb.com/name/nm3399714","urlPhoto":"","biography":{"bio":"Sandy MacLean is known for his work on Take This Waltz (2011), Eternal Kiss (2010) and Phone Whores (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3399714","name":"Sandy MacLean","idIMDB":"nm3399714"},"actorId":"nm3399714","character":" Quaker Preacher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Glen Matthews","urlProfile":"http://www.imdb.com/name/nm3238674","urlPhoto":"","biography":{"dateOfBirth":"13 June 1986","placeOfBirth":" Halifax, Nova Scotia, Canada","height":"5' 8\" (1.73 m)","bio":"Growing up, Glen Matthews always knew what he was going to be - a professional wrestler. Once that dream dissipated and his passionate showmanship remained, he began to pursue a career as an actor instead. Starting out at nineteen, Matthews spent five years in Halifax, working in the industry and honing his craft. A graduate of Neptune Theatre School's Pre-Professional Training Program, Glen has been cast in Principal roles in film & television including Hobo With a Shotgun, Moby Dick, Roller Town, Haven, and most recently he was a Lead in The Corridor. After a couple of years away from the stage, he was cast in 2010's Logan & I (featured as part of Halifax's Queer Acts Theatre Festival) for which Matthews received rave reviews as well as an \"Outstanding Lead Actor\" nomination from Theatre Nova Scotia (the Robert Merritt Awards). Now residing in Toronto, Glen hopes to continue working with like-minded artists who share his passion for storytelling.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3238674","name":"Glen Matthews","nicknames":["GlenJM"],"idIMDB":"nm3238674"},"actorId":"nm3238674","character":" Tom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen McHattie","urlProfile":"http://www.imdb.com/name/nm0570385","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MTM2NTQzN15BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 February 1947","placeOfBirth":" Antigonish, Nova Scotia, Canada","birthName":"Stephen McHattie Smith","height":"5' 11½\" (1.82 m)","bio":"Stephen McHattie was born on February 3, 1947 in Antigonish, Nova Scotia, Canada as Stephen McHattie Smith. He is an actor and director, known for 300 (2006), Watchmen (2009) and The Fountain (2006). He is married to Lisa Houle. They have three children. He was previously married to Meg Foster.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MTM2NTQzN15BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0570385","name":"Stephen McHattie","nicknames":["Sniff"],"idIMDB":"nm0570385"},"actorId":"nm0570385","character":" Rachel Captain","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Donald Sutherland","urlProfile":"http://www.imdb.com/name/nm0000661","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MDI1NzcyMl5BMl5BanBnXkFtZTcwOTk0MjQwOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1935","placeOfBirth":" Saint John, New Brunswick, Canada","birthName":"Donald McNichol Sutherland","height":"6' 4\" (1.93 m)","bio":"The towering presence of Canadian actor Donald Sutherland is often noticed, as are his legendary contributions to cinema. He has appeared in almost 200 different shows and films. He is also the father of renowned actor Kiefer Sutherland, among others. Donald McNichol Sutherland was born in Saint John, New Brunswick, to Dorothy Isobel (McNichol) and Frederick McLea Sutherland, who worked in sales and electricity. He has Scottish, as well as German and English, ancestry. Sutherland worked several different jobs - he was a radio DJ in his youth - and was almost set on becoming an engineer after graduating from the University of Toronto with a degree in engineering. However, he also graduated with a degree in drama, and he chose to abandon becoming an engineer in favour of an actor. Sutherland's first roles were bit parts and consisted of such films as the horror film Dr. Terror's House of Horrors (1965) which starred Christopher Lee. He was also appearing in episodes of TV shows such as \"The Saint\" and \"Court Martial\". Sutherland's break would come soon, though, and it would come in the form of a war film in which he was barely cast. The reason he was barely cast was because he had been a last-minute replacement for an actor that had dropped out of the film. The role he played was that of the dopey but loyal Vernon Pinkley in the war film The Dirty Dozen (1967). The film also starred Lee Marvin, Charles Bronson, and Telly Savalas. The picture was an instant success as an action/war film, and Sutherland played upon this success by taking another role in a war film: this was, however, a comedy called MASH (1970) which landed Sutherland the starring role alongside Elliott Gould and Tom Skerritt. This is now considered a classic among film goers, and the 35-year old actor was only getting warmed up. Sutherland took a number of other roles in between these two films, such as the theatrical adaptation Oedipus the King (1968), the musical Joanna (1968) and the Clint Eastwood-helmed war comedy Kelly's Heroes (1970). It was Kelly's Heroes (1970) that became more well-known, and it reunited Sutherland with Telly Savalas. 1970 and 1971 offered Sutherland a number of other films, the best of them would have to be Klute (1971). The film, which made Jane Fonda a star, is about a prostitute whose friend is mysteriously murdered. Sutherland received no critical acclaim like his co-star Fonda (she won an Oscar) but his career did not fade. Moving on from Klute (1971), Sutherland landed roles such as the lead in the thriller Lady Ice (1973), and another lead in the western Alien Thunder (1974). These films did not match up to \"Klute\"'s success, though Sutherland took a supporting role that would become one of his most infamous and most critically acclaimed. He played the role of the murderous fascist leader in the Bernardo Bertolucci Italian epic 1900 (1976). Sutherland also gained another memorable role as a marijuana-smoking university professor in Animal House (1978) among other work that he did in this time. Another classic role came in the form of the Robert Redford film, Ordinary People (1980). Sutherland portrays an older father figure who must deal with his children in an emotional drama of a film. It won Best Picture, and while both the supporting stars were nominated for Oscars, Sutherland once again did not receive any Academy Award nomination. He moved on to play a Nazi spy in a film based on Ken Follett's book \"Eye of the Needle\" and he would star alongside Al Pacino in the commercial and critical disaster that was Revolution (1985). While it drove Al Pacino out of films for four years, Sutherland continued to find work. This work led to the dramatic, well-told story of apartheid A Dry White Season (1989) alongside the legendary actor Marlon Brando. Sutherland's next big success came in the Oliver Stone film JFK (1991) where Sutherland plays the chilling role of Mister X, an anonymous source who gives crucial information about the politics surrounding President Kennedy. Once again, he was passed over at the Oscars, though Tommy Lee Jones was nominated for his performance as Clay Shaw. Sutherland went on to appear in Buffy the Vampire Slayer (1992), Shadow of the Wolf (1992), and Disclosure (1994). The new millennium provided an interesting turn in Sutherland's career: reuniting with such former collaborators as Clint Eastwood and Tommy Lee Jones, Sutherland starred in Space Cowboys (2000). He also appeared as the father figure to Nicole Kidman's character in Cold Mountain (2003) and Charlize Theron's character in The Italian Job (2003). He has also made a fascinating, Oscar-worthy performance as the revolutionist Mr. Thorne in Land of the Blind (2006) and also as a judge in Reign Over Me (2007). Recently, he has joined forces with his son Rossif Sutherland and Canadian comic [error] with the new comedy The Con Artist (2010), as well as acting alongside Jamie Bell and Channing Tatum in the sword-and-sandal film The Eagle (2011). Sutherland has also taken a role in the remake of Charles Bronson's film The Mechanic (1972). Donald Sutherland has made a lasting legacy on Hollywood, whether portraying a chilling and horrifying villain, or playing the older respectable character in his films. A true character actor, Sutherland is one of Canada's most well-known names and will hopefully continue on being so long after his time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MDI1NzcyMl5BMl5BanBnXkFtZTcwOTk0MjQwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000661","name":"Donald Sutherland","idIMDB":"nm0000661"},"actorId":"nm0000661","character":" Father Mapple","urlCharacter":"http://www.imdb.com/character/ch0022065","main":true}],"seasons":[{"yearSeason":2011,"episodes":[{"episode":1,"title":"Part 1","date":"1 Aug. 2011","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt1939206"},{"episode":2,"title":"Part 2","date":"2 Aug. 2011","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt1939207"}]},{"yearSeason":2011,"episodes":[{"episode":1,"title":"Part 1","date":"1 Aug. 2011","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt1939206"},{"episode":2,"title":"Part 2","date":"2 Aug. 2011","plot":"Know what this is about? Be the first one to add a plot.","idIMDB":"tt1939207"}]}],"idIMDB":"tt1334573","urlIMDB":"http://www.imdb.com/title/tt1334573","business":{"budget":{"money":"$25,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"24","month":"01","year":"2010","remarks":null},"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["3 hr 4 min (184 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.1","filmingLocations":[{"location":"Halifax, Nova Scotia, Canada"}],"awards":[{"award":"Awards Circuit Community Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated ACCA TV","categories":[{"category":"Best TV Movie or Mini-Series","names":[]},{"category":"Best Supporting Actor (TV Movie or Mini-Series)","names":[{"name":"Donald Sutherland","id":"nm0000661","role":null}]}]}]},{"award":"Directors Guild of Canada 2012","titlesAwards":[{"titleAwardOutcome":"Nominated DGC Craft Award","categories":[{"category":"Production Design - Television Movie/Mini-Series","names":[{"name":"Rob Gray","id":"nm0336903","role":null}]}]}]}],"votes":"1,196","type":"TV Mini-Series","companyCreditsSimple":[{"idCompany":"co0120136","name":"Gate Filmproduktion"},{"idCompany":"co0079339","name":"Tele München Fernseh Produktionsgesellschaft (TMG)"}],"keywords":{"keywords":["obsession","whale","white whale","moby dick","tv mini series","boat","sea captain","sea","mutiny","madness","whaler","tv movie","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:06:43"}}