{"data":{"movies":[{"title":"Father of Invention","originalTitle":"","year":"2010","releaseDate":"20111103","directors":[{"name":"Trent Cooper","id":"nm1401857"}],"writers":[{"name":"Jonathan D. Krane","id":"nm0006790"},{"name":"Trent Cooper","id":"nm1401857"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MTcwNzkxOV5BMl5BanBnXkFtZTcwNzAwMDgyNg@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama"],"plot":"Robert Axle, an eccentric inventor turned ego maniacal infomercial guru, loses it all when one of his inventions maims thousands of customers. After 8 years in maximum security prison, Robert is ready to redeem his name and rebuild his billion dollar empire. But first, he must convince his estranged 22-year-old daughter to let him live with her and her quirky, over-protective roommates.","simplePlot":"After 8 years in prison, inventor Robert Axle struggles to win over his estranged family and catch up on current technology as he works to once again become the king of the infomercial.","actors":[{"actorName":"Kevin Spacey","urlProfile":"http://www.imdb.com/name/nm0000228","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2NhY2U2YjgtNTFhZS00NjkwLWI2YzAtYWViNmRhMmQ5YWZjXkEyXkFqcGdeQXVyMDkxMjMwMA@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1959","placeOfBirth":" South Orange, New Jersey, USA","birthName":"Kevin Spacey Fowler","height":"5' 10\" (1.78 m)","bio":"Kevin Spacey Fowler better known by his stage name Kevin Spacey, is an American actor of screen and stage, film director, producer, screenwriter and singer. He began his career as a stage actor during the 1980s before obtaining supporting roles in film and television. He gained critical acclaim in the early 1990s that culminated in his first Academy Award for Best Supporting Actor for the neo-noir crime thriller The Usual Suspects (1995), and an Academy Award for Best Actor for midlife crisis-themed drama American Beauty (1999). His other starring roles have included the comedy-drama film Swimming with Sharks (1994), psychological thriller Seven (1995), the neo-noir crime film L.A. Confidential (1997), the drama Pay It Forward (2000), the science fiction-mystery film K-PAX (2001) In Broadway theatre, Spacey won a Tony Award for his role in Lost in Yonkers. He was the artistic director of the Old Vic theatre in London from 2004 until stepping down in mid-2015. Since 2013, Spacey has played Frank Underwood in the Netflix political drama series House of Cards. His work in House of Cards earned him Golden Globe Award and Emmy Award nominations for Best Actor. As enigmatic as he is talented, Kevin Spacey has always kept the details of his private life closely guarded. As he explained in a 1998 interview with the London Evening Standard, \"the less you know about me, the easier it is to convince you that I am that character on screen. It allows an audience to come into a movie theatre and believe I am that person\". There are, however, certain biographical facts to be had - for starters, Kevin Spacey Fowler was the youngest of three children born to Kathleen Ann (Knutson) and Thomas Geoffrey Fowler, in South Orange, New Jersey. His ancestry includes Swedish (from his maternal grandfather) and English. His mother was a personal secretary, his father a technical writer whose irregular job prospects led the family all over the country. The family eventually settled in southern California, where young Kevin developed into quite a little hellion - after he set his sister's tree house on fire, he was shipped off to the Northridge Military Academy, only to be thrown out a few months later for pinging a classmate on the head with a tire. Spacey then found his way to Chatsworth High School in the San Fernando Valley, where he managed to channel his dramatic tendencies into a successful amateur acting career. In his senior year, he played \"Captain von Trapp\" opposite classmate Mare Winningham's \"Maria\" in \"The Sound of Music\" (the pair later graduated as co-valedictorians). Spacey claims that his interest in acting - and his nearly encyclopedic accumulation of film knowledge - began at an early age, when he would sneak downstairs to watch the late late show on TV. Later, in high school, he and his friends cut class to catch revival films at the NuArt Theater. The adolescent Spacey worked up celebrity impersonations (James Stewart and Johnny Carson were two of his favorites) to try out on the amateur comedy club circuit. He briefly attended Los Angeles Valley College, then left (on the advice of another Chatsworth classmate, Val Kilmer) to join the drama program at Juilliard. After two years of training he was anxious to work, so he quit Juilliard sans diploma and signed up with the New York Shakespeare Festival. His first professional stage appearance was as a messenger in the 1981 production of \"Henry VI\". Festival head Joseph Papp ushered the young actor out into the \"real world\" of theater, and the next year Spacey made his Broadway debut in Henrik Ibsen's \"Ghosts\". He quickly proved himself as an energetic and versatile performer (at one point, he rotated through all the parts in David Rabe's \"Hurlyburly\"). In 1986, he had the chance to work with his idol and future mentor, Jack Lemmon, on a production of Eugene O'Neill's \"Long Day's Journey Into Night\". While his interest soon turned to film, Spacey would remain active in the theater community - in 1991, he won a Tony Award for his turn as \"Uncle Louie\" in Neil Simon's Broadway hit \"Lost in Yonkers\" and, in 1999, he returned to the boards for a revival of O'Neill's \"The Iceman Cometh\". Spacey's film career began modestly, with a small part as a subway thief in Heartburn (1986). Deemed more of a \"character actor\" than a \"leading man\", he stayed on the periphery in his next few films, but attracted attention for his turn as beady-eyed villain \"Mel Profitt\" on the TV series Wiseguy (1987). Profitt was the first in a long line of dark, manipulative characters that would eventually make Kevin Spacey a household name: he went on to play a sinister office manager in Glengarry Glen Ross (1992), a sadistic Hollywood exec in Swimming with Sharks (1994), and, most famously, creepy, smooth-talking eyewitness Verbal Kint in The Usual Suspects (1995). The \"Suspects\" role earned Spacey an Oscar for Best Supporting Actor and catapulted him into the limelight. That same year, he turned in another complex, eerie performance in David Fincher's thriller Se7en (1995) (Spacey refused billing on the film, fearing that it might compromise the ending if audiences were waiting for him to appear). By now, the scripts were pouring in. After appearing in Al Pacino's Looking for Richard (1996), Spacey made his own directorial debut with Albino Alligator (1996), a low-key but well received hostage drama. He then jumped back into acting, winning critical accolades for his turns as flashy detective Jack Vincennes in L.A. Confidential (1997) and genteel, closeted murder suspect Jim Williams in Midnight in the Garden of Good and Evil (1997). In October 1999, just four days after the dark suburban satire American Beauty (1999) opened in US theaters, Spacey received a star on the Hollywood Walk of Fame. Little did organizers know that his role in Beauty would turn out to be his biggest success yet - as Lester Burnham, a middle-aged corporate cog on the brink of psychological meltdown, he tapped into a funny, savage character that captured audiences' imaginations and earned him a Best Actor Oscar. No longer relegated to offbeat supporting parts, Spacey seems poised to redefine himself as a Hollywood headliner. He says he's finished exploring the dark side - but, given his attraction to complex characters, that mischievous twinkle will never be too far from his eyes. In February 2003 Spacey made a major move back to the theatre. He was appointed Artistic Director of the new company set up to save the famous Old Vic theatre, The Old Vic Theatre Company. Although he did not undertake to stop appearing in movies altogether, he undertook to remain in this leading post for ten years, and to act in as well as to direct plays during that time. His first production, of which he was the director, was the September 2004 British premiere of the play Cloaca by Maria Goos (made into a film, Cloaca (2003)). Spacey made his UK Shakespearean debut in the title role in Richard II in 2005. In 2006 he got movie director Robert Altman to direct for the stage the little-known Arthur Miller play Resurrection Blues, but that was a dismal failure. However Spacey remained optimistic, and insisted that a few mistakes are part of the learning process. He starred thereafter with great success in Eugene O'Neill's A Moon for the Misbegotten along with Colm Meaney and Eve Best, and in 2007 that show transferred to Broadway. In February 2008 Spacey put on a revival of the David Mamet 1988 play Speed-the-Plow in which he took one of the three roles, the others being taken by Jeff Goldblum and Laura Michelle Kelly. In 2013, Spacey took on the lead role in an original Netflix series, House of Cards (2013). Based upon a British show of the same name, House of Cards is an American political drama. The show's first season received a Primetime Emmy Award nomination to include outstanding lead actor in a drama series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2NhY2U2YjgtNTFhZS00NjkwLWI2YzAtYWViNmRhMmQ5YWZjXkEyXkFqcGdeQXVyMDkxMjMwMA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000228","name":"Kevin Spacey","idIMDB":"nm0000228"},"actorId":"nm0000228","character":"Robert Axle","urlCharacter":"http://www.imdb.com/character/ch0277225","main":true},{"actorName":"Camilla Belle","urlProfile":"http://www.imdb.com/name/nm0004741","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MDA1NDM0OF5BMl5BanBnXkFtZTgwNjg2OTUxMTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1986","placeOfBirth":" Los Angeles, California, USA","birthName":"Camilla Belle Routh","height":"5' 8\" (1.73 m)","bio":"Belle was born as Camilla Belle Routh in Los Angeles, California, to Cristina, a fashion designer, and Jack Wesley Routh, who composed country music and owns a construction company. Her mother is Brazilian and her father, who is from Kingman, Kansas, has English, German, and French ancestry. Camilla is an only child. She was named after a character played by Renata Sorrah in her mother's favorite Brazilian soap opera Cavalo de Aço (1973). However, most people call her by her middle name Belle. She went to St Paul's Catholic Elementary School in West Los Angeles and, afterwards, attended the elite all-girls Marlborough School in Los Angeles. At school, she studied classical piano and was fond of languages. She can speak fluent Portuguese. Camilla appeared in a national print commercial before the age of 1. At age 5, she appeared in two TV movies Trouble Shooters: Trapped Beneath the Earth (1993) and Empty Cradle (1993). Because of her work, she had never completed a full year of school. So, at age 13, she took time off to focus on her studies. She returned to work when she was age 16, with a main role in the film The Ballad of Jack and Rose (2005). The role that provided her first major exposure was Roland Emmerich's 10,000 BC (2008). From 2006 to 2008, she got a taste of her mother's world with some fashion jobs - she modeled for Vera Wang's Princess fragrance. Camilla is also involved in various charities and is an international spokesperson for \"Kids With A Cause\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MDA1NDM0OF5BMl5BanBnXkFtZTgwNjg2OTUxMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004741","name":"Camilla Belle","idIMDB":"nm0004741"},"actorId":"nm0004741","character":"Claire Axle","urlCharacter":"http://www.imdb.com/character/ch0276898","main":true},{"actorName":"Heather Graham","urlProfile":"http://www.imdb.com/name/nm0001287","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzk5MTM4NV5BMl5BanBnXkFtZTcwNTMxOTkwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1970","placeOfBirth":" Milwaukee, Wisconsin, USA","birthName":"Heather Joan Graham","height":"5' 8\" (1.73 m)","bio":"Heather Joan Graham was born in Milwaukee, Wisconsin, to Joan (Bransfield), a schoolteacher and children's book author, and James Graham, an FBI agent. She and her sister, actress Aimee Graham, were raised by their strictly Catholic parents. They relocated often, as a result of their father's occupation, and Heather became increasingly shy. Surprisingly, she had a passion for acting from an early age and despite being labeled a 'theater geek' by her peers, she was voted Most Talented by her high school senior class. Unfortunately, her love of acting created a tension between Heather and her family although her mother obligingly drove her to auditions in Hollywood throughout her adolescence. After high school Heather moved to Los Angeles and received small roles in a variety of films including Drugstore Cowboy (1989). When her career did not take off as quickly as was hoped, Heather enrolled in the University of California at Los Angeles to get her degree in drama. It was at UCLA that she was noticed by actor James Woods and received a subsequent part in a film Woods starred in, Diggstown (1992). Heather dropped out of UCLA after two years to pursue her acting career on a full time basis. Aside from gaining a modeling contract with Emanuel Ungaro Liberte, Heather has risen to star in such films as Swingers (1996), a role she received after being taken out swing dancing by Jon Favreau, to blockbusters like Austin Powers: The Spy Who Shagged Me (1999), and Boogie Nights (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzk5MTM4NV5BMl5BanBnXkFtZTcwNTMxOTkwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001287","name":"Heather Graham","idIMDB":"nm0001287"},"actorId":"nm0001287","character":"Phoebe","urlCharacter":"http://www.imdb.com/character/ch0276909","main":true},{"actorName":"Johnny Knoxville","urlProfile":"http://www.imdb.com/name/nm0424216","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5Mjk5OTMxMV5BMl5BanBnXkFtZTYwODMyNDE0._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 March 1971","placeOfBirth":" Knoxville, Tennessee, USA","birthName":"Philip John Clapp","height":"6' 1\" (1.85 m)","bio":"Johnny Knoxville was born on March 11, 1971 in Knoxville, Tennessee, USA as Philip John Clapp. He is a writer and producer, known for Jackass: The Movie (2002), Jackass Number Two (2006) and Bad Grandpa (2013). He has been married to Naomi Nelson since September 24, 2010. They have two children. He was previously married to Melanie Lynn Cates.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5Mjk5OTMxMV5BMl5BanBnXkFtZTYwODMyNDE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0424216","name":"Johnny Knoxville","nicknames":["Johnny Jackass","PJ","JJ Knoxville"],"idIMDB":"nm0424216"},"actorId":"nm0424216","character":"Troy Coangelo","urlCharacter":"http://www.imdb.com/character/ch0276910","main":true},{"actorName":"Anna Schafer","urlProfile":"http://www.imdb.com/name/nm3561158","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ0MDc0ODUzNl5BMl5BanBnXkFtZTcwNDMxNDY3OQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 8\" (1.73 m)","bio":"Anna Schafer is an actress, known for Seule contre tous (2010), Father of Invention (2010) and The Trials of Cate McCall (2013). She has been married to Peter Schafer since November 20, 2010.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ0MDc0ODUzNl5BMl5BanBnXkFtZTcwNDMxNDY3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3561158","name":"Anna Schafer","idIMDB":"nm3561158"},"actorId":"nm3561158","character":"Donna","urlCharacter":"http://www.imdb.com/character/ch0276985","main":true},{"actorName":"John Stamos","urlProfile":"http://www.imdb.com/name/nm0001764","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODA5OTY2M15BMl5BanBnXkFtZTYwMDIwMTgy._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1963","placeOfBirth":" Cypress, California, USA","birthName":"John Phillip Stamos","height":"6' (1.83 m)","bio":"John Phillip Stamos was born in Cypress, California, to Loretta (Phillips), a model, and William Stamos, a restaurateur. His father was of Greek descent, with the family surname originally being \"Stamotopoulos\". John has two younger sisters, Janeen and Alaina, both school teachers. His first professional role was as Blackie Parrish on the daytime soap General Hospital (1963) from 1982-1984, for which he won two Soap Opera Digest Awards (1982 and 1983). In 1987 he began the role of Jesse on Full House (1987), which is his best-known role to date, spanning eight years. At his request, the writers of Full House (1987) gave his character the last name of Katsopolis, instead of the original character's name, Cochran, in order to highlight John's Greek heritage. He has played drums occasionally with The Beach Boys since 1985, and directed their \"Hot Fun in the Summertime\" video. He expanded his career to include the role of J. Pierrepont Finch in Broadway's production of \"How to Succeed in Business Without Really Trying!\" in 1995, showcasing not only his musical talents, but his dancing ability, as well. On September 19, 1998, he married model Rebecca Romijn, of MTV's House of Style (1989), which was the first marriage for both. They were officially divorced on March 1, 2005.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODA5OTY2M15BMl5BanBnXkFtZTYwMDIwMTgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001764","name":"John Stamos","idIMDB":"nm0001764"},"actorId":"nm0001764","character":"Steven Leslie","urlCharacter":"http://www.imdb.com/character/ch0276943","main":true},{"actorName":"Red West","urlProfile":"http://www.imdb.com/name/nm0922307","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1Nzk3NDc4OF5BMl5BanBnXkFtZTgwMDk5OTMxNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 November 1936","placeOfBirth":" Memphis, Tennessee, USA","birthName":"Robert Gene West","height":"6' 2\" (1.88 m)","bio":"Robert \"Red\" Gene West was a close friend of Elvis Presley and a member of Presley's inner circle, known as \"The Memphis Mafia\". He first met Elvis in high school, where he was a year behind him. West played football for the Memphis Tigers high school football team, boxed in the Golden Gloves and played football for Jones Junior College playing center. West lived with his mother, Lois West, in the Hurt Housing project in Memphis. West became Elvis's personal driver in driving Elvis and band members Scotty Moore, Bill Black and later D.J. Fontana to different cities in the South for live appearances from 1955 to 1956. West served in the US Marine Corps from 1956 to late 1958 and was stationed in Norfolk, Virginia, which allowed him to stay in contact with Elvis. On August 14, 1958, West's estranged father, Newton Thomas West, died, the same day as Elvis' mother, Gladys Presley. After Elvis' discharge from the US Army in 1960, West was employed as one of Elvis' bodyguards. Over the years Elvis bought West a number of vehicles as he became a world-famous celebrity. West also became a movie stuntman and appeared in 16 of Elvis' films in the 1960s, usually playing extras or bit and supporting parts. West married one of Elvis' secretaries, Pat West, on July 1, 1961. A man of many talents, West became a songwriter for songs that Elvis, Pat Boone, Ricky Nelson and Johnny Rivers recorded, including the classic tune \"Separate Ways\" for Elvis, which won a BMI Award. In addition to the Elvis movies, West appeared in three Robert Conrad TV series The Wild Wild West (1965), Black Sheep Squadron (1976) and The Duke (1979). During the 1970s West, his cousin Del 'Sonny' West and 'Dave Hebler' served as Elvis' bodyguards, in charge of his daily transportation and, especially, in keeping weirdo, or potentially dangerous, fans away from him. On July 13, 1976, Vernon Presley, Elvis' father, fired West, Sonny West and Hebler after criticizing what he believed to be their heavy-handed tactics. The three of them collaborated on a book about their lives as Elvis' bodyguards, which was published just two weeks before Elvis' death in 1977. West has since continued his acting and songwriting careers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1Nzk3NDc4OF5BMl5BanBnXkFtZTgwMDk5OTMxNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0922307","name":"Red West","idIMDB":"nm0922307"},"actorId":"nm0922307","character":"Sam Bergman","urlCharacter":"http://www.imdb.com/character/ch0276917","main":true},{"actorName":"Michael Rosenbaum","urlProfile":"http://www.imdb.com/name/nm0742146","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNTc5Nzk2N15BMl5BanBnXkFtZTgwNDIxNTA4NTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1972","placeOfBirth":" Oceanside, New York, USA","birthName":"Michael Owen Rosenbaum","height":"6' (1.83 m)","bio":"Michael Rosenbaum was born on July 11, 1972 in Oceanside, New York, USA as Michael Owen Rosenbaum. He is an actor and producer, known for Smallville (2001), Urban Legend (1998) and Justice League (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNTc5Nzk2N15BMl5BanBnXkFtZTgwNDIxNTA4NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0742146","name":"Michael Rosenbaum","nicknames":["Rosey"],"idIMDB":"nm0742146"},"actorId":"nm0742146","character":"Eddie the Ex","urlCharacter":"http://www.imdb.com/character/ch0276912","main":true},{"actorName":"Danny Comden","urlProfile":"http://www.imdb.com/name/nm0173680","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTIxOTg3M15BMl5BanBnXkFtZTYwMzk1ODA2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1969","placeOfBirth":" Beverly Hills, California, USA","birthName":"Danny Hill Comden","bio":"Danny Comden was born on April 10, 1969 in Beverly Hills, California, USA as Danny Hill Comden. He is an actor and writer, known for Urban Legend (1998), Dunston Checks In (1996) and Pretty Persuasion (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTIxOTg3M15BMl5BanBnXkFtZTYwMzk1ODA2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0173680","name":"Danny Comden","idIMDB":"nm0173680"},"actorId":"nm0173680","character":"Matt James","urlCharacter":"http://www.imdb.com/character/ch0276941","main":true},{"actorName":"Jack McGee","urlProfile":"http://www.imdb.com/name/nm0569079","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMzU5NDU1MV5BMl5BanBnXkFtZTcwNDczNjQ3NA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 February 1949","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"John J. McGee","height":"5' 5\" (1.65 m)","bio":"Jack McGee was born on February 2, 1949 in The Bronx, New York City, New York, USA as John J. McGee. He is an actor, known for The Fighter (2010), Moneyball (2011) and 21 (2008). He has been married to Stephanie since August 19, 1996.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMzU5NDU1MV5BMl5BanBnXkFtZTcwNDczNjQ3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0569079","name":"Jack McGee","idIMDB":"nm0569079"},"actorId":"nm0569079","character":"Parole Officer","urlCharacter":"http://www.imdb.com/character/ch0276942","main":true},{"actorName":"Craig Robinson","urlProfile":"http://www.imdb.com/name/nm0732497","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjIyMTU2Nl5BMl5BanBnXkFtZTcwMzExODEyMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1971","placeOfBirth":" Chicago, Illinois, USA","birthName":"Craig Phillip Robinson","height":"6' 2\" (1.88 m)","bio":"Craig Robinson was born on October 25, 1971 in Chicago, Illinois, USA as Craig Phillip Robinson. He is an actor, known for This Is the End (2013), Pineapple Express (2008) and Hot Tub Time Machine (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjIyMTU2Nl5BMl5BanBnXkFtZTcwMzExODEyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0732497","name":"Craig Robinson","idIMDB":"nm0732497"},"actorId":"nm0732497","character":"Jerry King","urlCharacter":"http://www.imdb.com/character/ch0276922","main":true},{"actorName":"Virginia Madsen","urlProfile":"http://www.imdb.com/name/nm0000515","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUyMDcxNTU3N15BMl5BanBnXkFtZTcwMDAwNjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1961","placeOfBirth":" Chicago, Illinois, USA","height":"5' 5\" (1.65 m)","bio":"One of the hottest stars of the mid-1980s, Virginia Madsen has since played a variety of roles that have cemented her reputation as a fantastic actress who can adapt to any part. Virginia was born in Chicago, Illinois, and belongs to an acting family -- with her brother, Michael Madsen, also an actor, and her mother, Elaine Madsen (née Melson), an Emmy-winning writer, poet, and producer. Her paternal grandparents were Danish, and her father, Calvin Madsen, was a firefighter. Audiences first caught a glimpse of her as \"Princess Irulan\" in the 1984 science fiction epic Dune (1984). She followed that up with Electric Dreams (1984); however, it was in 1986 that Virginia captured the hearts of the audience with an intense portrayal of a Catholic school girl who fell in love with a boy from a prison camp in Duncan Gibbins' Fire with Fire (1986). Virginia played the role of \"Lisa\" and her co-star was Craig Sheffer, who played Lisa's love interest, \"Joe Fisk\". Kari Wuhrer also made an appearance as Virginia's best friend, \"Gloria\". Fire with Fire (1986) was a low-budget production, starring a bunch of fresh faces who were till then-unknown to Hollywood. However, the movie was a success and elevated its three young stars overnight. Virginia has never looked back since. Not only did she receive amazing reviews for her Academy Award and Golden Globe nominated performance in Alexander Payne's hit film, Sideways (2004), but this Independent Spirit Award-winning actress has an illustrious resume of roles alongside the most notable and respected actors in the business. Also on Virginia's slate is her production company, with partner Karly Meola, called \"Title IX Productions\". Their first project was the documentary I Know a Woman Like That (2009), which previewed at the Phoenix Film Festival in April 2009 and premiered at the Chicago Film Festival in October 2009. The doc was directed by Virginia's mother, Elaine Madsen, about the lives of extraordinary women ages 64-94. Next in the company's lineup is the documentary Fighting Gravity (2010), about women ski jumpers' ongoing battle for the right to compete in the 2010 Winter Olympics. Title IX will team up with \"Empire 8 Productions\" and Vancouver-based \"Screen Siren\" on the project. The duo also has several projects in development that they're shopping around for financing including screenwriters Sebastian Gutierrez's screen adaptation of Martha O'Connor's novel \"The Bitch Posse\" and a remake of the 1984 film Electric Dreams (1984), in which Virginia appeared.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUyMDcxNTU3N15BMl5BanBnXkFtZTcwMDAwNjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000515","name":"Virginia Madsen","nicknames":["Gina"],"idIMDB":"nm0000515"},"actorId":"nm0000515","character":"Lorraine","urlCharacter":"http://www.imdb.com/character/ch0276923","main":true},{"actorName":"Marc Macaulay","urlProfile":"http://www.imdb.com/name/nm0531333","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2ODQwMjIzOF5BMl5BanBnXkFtZTcwNzg1ODk0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1957","placeOfBirth":" Millinocket, Maine, USA","bio":"Marc Macaulay was born on October 13, 1957 in Millinocket, Maine, USA. He is known for his work on Bad Boys (1995), 12 Years a Slave (2013) and Monster (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2ODQwMjIzOF5BMl5BanBnXkFtZTcwNzg1ODk0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0531333","name":"Marc Macaulay","idIMDB":"nm0531333"},"actorId":"nm0531333","character":"General Store Clerk","urlCharacter":"http://www.imdb.com/character/ch0276944","main":true},{"actorName":"Morgan Saylor","urlProfile":"http://www.imdb.com/name/nm2838320","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MTkzNjM0OF5BMl5BanBnXkFtZTgwMzExNjYxOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1994","placeOfBirth":" Chicago, Illinois, USA","birthName":"Morgan Frances Saylor","height":"5' 6\" (1.68 m)","bio":"Morgan Saylor was born in Chicago and raised in Georgia, attending Montessori schools through grade 8. At a young age, Morgan began performing at community theatre summer camps. In the third grade, Morgan's family moved within Georgia to an in-town Atlanta neighborhood, filled with even more theatre opportunities. There Morgan met more actors and directors, and was even picked up by a talent agency after attending an open casting call. Since then Morgan has made the transition from local and regional stage to television and film. Morgan's credits on the big screen include \"Cirque du Freak: The Vampire's Assistant\" (2009), \"Father of Invention\" (2010) and \"The Greening of Whitney Brown\" (2011); television credits include a guest role on \"K-Ville,\" and playing series regular, Dana Brody, on Showtime's \"Homeland.\" Morgan is currently attending high school and rock climbs in her spare time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MTkzNjM0OF5BMl5BanBnXkFtZTgwMzExNjYxOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2838320","name":"Morgan Saylor","idIMDB":"nm2838320"},"actorId":"nm2838320","character":"Young Claire","urlCharacter":"http://www.imdb.com/character/ch0276898","main":true},{"actorName":"Karen Kaia Livers","urlProfile":"http://www.imdb.com/name/nm1293441","urlPhoto":"","biography":{"height":"5' 7\" (1.7 m)","bio":"Karen Kaia Livers is known for her work on Treme (2010), Old Boy (2013) and Miracle at St. Anna (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1293441","name":"Karen Kaia Livers","idIMDB":"nm1293441"},"actorId":"nm1293441","character":"Maria","urlCharacter":"http://www.imdb.com/character/ch0276932","main":true}],"seasons":[],"idIMDB":"tt1381505","urlIMDB":"http://www.imdb.com/title/tt1381505","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 33 min (93 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Sony CineAlta F23"],"laboratory":["Cineworks Digital Studios, Miami (FL), USA"],"filmLength":null,"negativeFormat":["Video (HDTV)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","HDCAM SR (1080p/24) (source format)"],"printedFilmFormat":["35 mm (anamorphic)","D-Cinema"]},"rating":"5.8","metascore":"36","filmingLocations":[{"location":"New Orleans, Louisiana, USA"}],"rated":"PG-13","awards":[],"votes":"7,455","type":"Movie","companyCreditsSimple":[{"idCompany":"co0225725","name":"Horizon Entertainment"},{"idCompany":"co0293457","name":"Pangea Media Group"},{"idCompany":"co0336495","name":"K. JAM Media"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:59:59"}}