{"data":{"movies":[{"title":"I'm Still Here","originalTitle":"","year":"2010","releaseDate":"20110713","directors":[{"name":"Casey Affleck","id":"nm0000729"}],"writers":[{"name":"Casey Affleck","id":"nm0000729"},{"name":"Joaquin Phoenix","id":"nm0001618"}],"runtime":"108 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE5NjA2NzM5Ml5BMl5BanBnXkFtZTcwODg5NTE3Mw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Music"],"plot":"In 2008 while rehearsing for a charity event, actor Joaquin Phoenix, with Casey Affleck's camera watching, tells people he's quitting to pursue a career in rap music. Over the next year, we watch the actor write, rehearse, and perform to an audience. He importunes Sean Combs in hopes he'll produce the record. We see the actor in his home: he parties, smokes, bawls out his two-man entourage, talks philosophy with Affleck, and comments on celebrity.","simplePlot":"Documenting 's transition from the acting world to a career as an aspiring rapper.","actors":[{"actorName":"Joaquin Phoenix","urlProfile":"http://www.imdb.com/name/nm0001618","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzAzNjg5MDE3N15BMl5BanBnXkFtZTcwMjIxNzU0OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1974","placeOfBirth":" San Juan, Puerto Rico","birthName":"Joaquin Rafael Bottom","height":"5' 8\" (1.73 m)","bio":"Joaquin Rafael Phoenix was born in San Juan, Puerto Rico, to Arlyn (Dunetz) and John Bottom, and is the middle child in a brood of five. His parents, from the continental United States, were then serving as Children of God missionaries. His mother is from a Jewish family in New York, while his father, from California, is of mostly British Isles descent. As a youngster, Joaquin took his cues from older siblings River Phoenix and Rain Phoenix, changing his name to Leaf to match their earthier monikers. When the children were encouraged to develop their creative instincts, he followed their lead into acting. Younger sisters Liberty Phoenix and Summer Phoenix rounded out the talented troupe. The family moved often, traveling through Central and South America (and adopting the surname \"Phoenix\" to celebrate their new beginnings) but, by the time Joaquin was age 6, they had more or less settled in the Los Angeles area. Arlyn found work as a secretary at NBC, and John turned his talents to landscaping. They eventually found an agent who was willing to represent all five children, and the younger generation dove into television work. Commercials for meat, milk, and junk food were off-limits (the kids were all raised as strict vegans), but they managed to find plenty of work pushing other, less sinister products. Joaquin's first real acting gig was a guest appearance on River's sitcom, Seven Brides for Seven Brothers (1982). He worked with his brother again on the afterschool special ABC Afterschool Specials: Backwards: The Riddle of Dyslexia (1984), then struck out on his own in other made-for-TV productions. He made his big-screen debut as the youngest crew member in the interstellar romp SpaceCamp (1986), then won his first starring turn in the Cold War-era drama Russkies (1987). In the late '80s, the Phoenix clan decided to pull up stakes and relocate again--this time to Florida. River's film career had enough momentum to sustain the move, but Joaquin wasn't sure what lay in store for him in the Sunshine State. As it happened, Universal Pictures had just opened a new studio in the area and he was cast almost immediately as an angst-ridden adolescent in Parenthood (1989). His performance was very well-received, but Joaquin decided to withdraw from acting for a while--he was frustrated with the dearth of interesting roles for actors his age, and he wanted to see more of the world. His parents were in the process of separating, so he struck out for Mexico with his father. Joaquin returned to the public eye three years later under tragic circumstances. On October 31, 1993, he was at The Viper Room (a Los Angeles nightclub partly-owned by Johnny Depp) when his brother River collapsed from a drug overdose and later died. Joaquin made the call to 911, which was rebroadcast on radio and television the world over. Months later, at the insistence of friends and colleagues, Joaquin began reading through scripts again, but he was reluctant to re-enter the acting life until he found just the right part. He finally signed up to work with Gus Van Sant (who had directed River in My Own Private Idaho (1991) and Even Cowgirls Get the Blues (1993)) to star as Nicole Kidman's obsessive devotee in To Die For (1995). The performance made Joaquin (who had dropped Leaf and reverted to his birth name) a critics' darling in his own right. His follow-up turn in Inventing the Abbotts (1997) scored more critical kudos and, perhaps more importantly, introduced him to future fiancée Liv Tyler. (The pair dated for almost three years.) He returned to the big screen later that year with a supporting role in Oliver Stone's U Turn - Ici commence l'enfer (1997), then played a locked-up drug scapegoat in Return to Paradise (1998). He and \"Paradise\" co-star Vince Vaughn re-teamed almost immediately for the small-town murder caper Clay Pigeons (1998), which Joaquin followed with a turn as a porn store clerk in 8 mm (1999). The film that confirmed Phoenix as a star was the historical epic Gladiator (2000). The Roman epic cast him as the selfish, paranoid young emperor Commodus opposite Russell Crowe's swarthy hero. Determined to make his character as real as possible, Phoenix gained weight and cultivated a pasty complexion during the shoot. He received international attention and an Academy Award nomination for Best Supporting Actor for that role. Later that year, he appeared in two indies, playing a dock worker in The Yards (2000) (which he counts among his favorite experiences--and one of the only films of his that he can sit through) and the priest in charge of the Marquis de Sade's asylum in Quills (2000). He received an Academy Award nomination for Best Actor as the legendary musician Johnny Cash in the biography Walk the Line (2005). He also recorded an album, the film's soundtrack, for which he received the Grammy Award for Best Compilation Soundtrack for Visual Media.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzAzNjg5MDE3N15BMl5BanBnXkFtZTcwMjIxNzU0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001618","name":"Joaquin Phoenix","nicknames":["Kitten","Joaq","Leaf"],"idIMDB":"nm0001618"},"actorId":"nm0001618","character":"Joaquin Phoenix","urlCharacter":"http://www.imdb.com/character/ch0265714","main":true},{"actorName":"Antony Langdon","urlProfile":"http://www.imdb.com/name/nm0486018","urlPhoto":"","biography":{"dateOfBirth":"14 May 1968","placeOfBirth":" Leeds, Yorkshire, England, UK","birthName":"Antony Chester Langdon","bio":"Antony Langdon was born on May 14, 1968 in Leeds, Yorkshire, England as Antony Chester Langdon. He is an actor and editor, known for I'm Still Here (2010), Velvet Goldmine (1998) and Merry Christmas (2013). He has been married to Victoria Clay-Mendoza since April 6, 2006.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0486018","name":"Antony Langdon","nicknames":["Ant"],"idIMDB":"nm0486018"},"actorId":"nm0486018","character":"Anton","urlCharacter":"http://www.imdb.com/character/ch0265710","main":true},{"actorName":"Carey Perloff","urlProfile":"http://www.imdb.com/name/nm4239082","urlPhoto":"","biography":{"urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4239082","name":"Carey Perloff","idIMDB":"nm4239082"},"actorId":"nm4239082","character":"Himself - Play Director","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larry McHale","urlProfile":"http://www.imdb.com/name/nm3617391","urlPhoto":"","biography":{"bio":"Larry McHale is known for his work on I'm Still Here (2010), We Own the Night (2007) and Two Lovers (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3617391","name":"Larry McHale","idIMDB":"nm3617391"},"actorId":"nm3617391","character":"Larry McHale","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Casey Affleck","urlProfile":"http://www.imdb.com/name/nm0000729","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDU1NzU4MF5BMl5BanBnXkFtZTgwNDQ5ODgwMDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 August 1975","placeOfBirth":" Falmouth, Massachusetts, USA","birthName":"Caleb Casey McGuire Affleck-Boldt","height":"5' 9\" (1.75 m)","bio":"An accomplished and striking performer, Academy Award® winner Casey Affleck has established himself as a powerful leading man with performances in multiple upcoming projects. Caleb Casey McGuire Affleck-Boldt was born in Falmouth, Massachusetts. His mother, Chris Anne (née Boldt), is a school teacher, and his father, Timothy Byers Affleck, is a social worker; the two are divorced. Casey's brother is actor Ben Affleck, who was born in 1972. He is of mostly English, Irish, German, and Scottish ancestry. Affleck was nominated for an Academy Award®, Golden Globe®, and Screen Actors Guild® Award for his performance in the character drama The Assassination of Jesse James by the Coward Robert Ford. Written and directed by Andrew Dominik (\"Chopper\"), the Warner Bros. film stars Affleck as 'Ford' opposite Brad Pitt's 'Jesse James.' The story follows 'Ford's' sycophantic obsession with 'James' that quickly turns into growing resentment after he joins the legendary outlaw's gang, leading to his subsequent plan to murder 'James' and claim his rightful glory. Additionally, Casey garnered significant praise for his starring role in the Miramax film Gone, Baby Gone. Based on Dennis Lehane's novel of the same title, and adapted for the screen and featuring the directorial debut by Ben Affleck, the film is the story of two Boston detectives in search of a four-year-old girl who has been kidnapped. The film also stars Ed Harris, Morgan Freeman and Michelle Monaghan. In 2014, Affleck and John Powers Middleton formed The Affleck/Middleton Project, a full service production company designed to develop and produce film and television content across a variety of genres. With a mission to produce quality films and television series that connect with audiences, The Affleck/Middleton Project looks to develop and produce a new wave of great American entertainment. It was recently announced that The Affleck/Middleton Project has secured the rights to Far Bright Star, the second in the book series of the same name by 'Robert Olmstead;' Affleck will direct a script by Damien Ober with three-time Academy Award® nominee Joaquin Phoenix set to star. Affleck also directed I'm Still Here (2010), which he also wrote and produced starring Joaquin Phoenix. Affleck also co-wrote with and starred alongside Matt Damon in Gus Van Sant's independent road movie Gerry (2002). He has also appeared in Van Sant's Good Will Hunting and To Die For, Hamlet with Ethan Hawke and Julia Stiles, the Oceans trilogy and Tony Goldwyn's The Last Kiss with Zach Braff and Blythe Danner. On stage, Casey appeared in Kenneth Lonergan's West End debut of his award winning play This is Our Youth. Affleck played the role of 'Warren' alongside Matt Damon and Summer Phoenix. In 2016, Affleck starred opposite 'Michelle Williams' in Manchester by the Sea (2016). The film tells the story of an uncle (Affleck) who is forced to take care of his teenage nephew after the boy's father dies. Written and directed by Kenneth Lonergan, the film will be released on November 18th by Amazon Studios. Also that year, he was seen in Triple 9 (2016), opposite Woody Harrelson and Kate Winslet. The film follows a gang of criminals and corrupt cops who plan to murder a police office in order to pull off their biggest heist yet. The film was released by Open Road in February. Additionally, Affleck starred in The Finest Hours (2016), opposite Chris Pine. The Disney film recounts the story of the Coast Guard's daring rescue attempt off the coast of Cape Cod after a pair of oil tankers are destroyed during a blizzard in 1952. Other credits include Christopher Nolan's Interstellar opposite Matthew McConaughey, Jessica Chastain, and Anne Hathaway; Out of the Furnace opposite Christian Bale; and Ain't Them Bodies Saints opposite Rooney Mara.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDU1NzU4MF5BMl5BanBnXkFtZTgwNDQ5ODgwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000729","name":"Casey Affleck","idIMDB":"nm0000729"},"actorId":"nm0000729","character":"Casey Affleck","urlCharacter":"http://www.imdb.com/character/ch0501344","main":true},{"actorName":"Jack Nicholson","urlProfile":"http://www.imdb.com/name/nm0000197","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3OTY0ODk0M15BMl5BanBnXkFtZTYwNzE4Njc4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 April 1937","placeOfBirth":" Neptune, New Jersey, USA","birthName":"John Joseph Nicholson","height":"5' 9¾\" (1.77 m)","bio":"Jack Nicholson, an American actor, producer, director and screenwriter, is a three-time Academy Award winner and twelve-time nominee. Nicholson is also notable for being one of two actors - the other being Michael Caine - who have received Oscar nomination in every decade from the 1960s through the 1990s. Nicholson was born on April 22, 1937 in Neptune, New Jersey. He was raised believing that his grandmother was his mother, and that his mother, June Frances Nicholson, a show-girl, was his older sister. He discovered the truth in 1975 from a Time magazine journalist who was researching a profile on him. His real father is believed to have been either Donald Furcillo, an Italian-American show-man, or Eddie King (Edgar Kirschfeld), born in Latvia and also in show-business. Jack's mother's ancestry was Irish, English, as well as German, Scottish and Welsh. Nicholson made his film debut in a B-movie titled The Cry Baby Killer (1958). His rise in Hollywood was far from meteoric, and for years, he sustained his career with guest spots in television series and a number of Roger Corman films, including The Little Shop of Horrors (1960). Nicholson's first turn in the director's chair was for Drive, He Said (1971). Before that, he wrote the screenplay for The Trip (1967), and co-wrote Head (1968), a vehicle for The Monkees. His big break came with Easy Rider (1969) and his portrayal of liquor-soaked attorney George Hanson, which earned Nicholson his first Oscar nomination. Nicholson's film career took off in the 1970s with a definitive performance in Five Easy Pieces (1970). Nicholson's other notable work during this period includes leading roles in Roman Polanski's noir masterpiece Chinatown (1974) and One Flew Over the Cuckoo's Nest (1975), for which he won his first Best Actor Oscar. The 1980s kicked off with another career-defining role for Nicholson as Jack Torrance in Stanley Kubrick's adaptation of Stephen King's novel The Shining (1980). A string of well-received films followed, including Terms of Endearment (1983) which earned Nicholson his second Oscar; Prizzi's Honor (1985) and The Witches of Eastwick (1987). He portrayed another renowned villain, The Joker, in Tim Burton's Batman (1989). In the 1990s, he starred in such varied films as A Few Good Men (1992), for which he received another Oscar nomination, and a dual role in Mars Attacks! (1996). Although a glimpse at the darker side of Nicholson's acting range reappeared in The Departed (2006), the actor's most recent roles highlight the physical and emotional complications one faces late in life. The most notable of these is the unapologetically misanthropic Melvin Udall in As Good as It Gets (1997), for which he won his third Academy Award. Shades of this persona are apparent in About Schmidt (2002), Something's Gotta Give (2003) and The Bucket List (2007). In addition to his Academy Awards and Oscar nominations, Nicholson has seven Golden Globe Awards, and received a Kennedy Center Honor in 2001. He also became one of the youngest actors to receive the American Film Institute's Life Achievement award in 1994. Nicholson has five children: Eldest daughter Jennifer Nicholson (b. 1963), from his marriage to Sandra Knight which ended in 1968; Caleb James Goddard (b. 1970) with Susan Anspach; Honey Hollman (b. 1981) with Danish supermodel, Winnie Hollman; and Lorraine Nicholson (b. 1990) and Ray Nicholson (b. 1992) with Rebecca Broussard. Nicholson's longest relationship was the seventeen years he spent with actress Anjelica Huston; this ended when Broussard become pregnant with his child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3OTY0ODk0M15BMl5BanBnXkFtZTYwNzE4Njc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000197","name":"Jack Nicholson","nicknames":["Mulholland Man","Nick"],"idIMDB":"nm0000197"},"actorId":"nm0000197","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Billy Crystal","urlProfile":"http://www.imdb.com/name/nm0000345","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MjA4MjM4NV5BMl5BanBnXkFtZTcwMzE0MjcxNQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1948","placeOfBirth":" Yorkville, Manhattan, New York City, New York, USA","birthName":"William Edward Crystal","height":"5' 7\" (1.7 m)","bio":"Billy Crystal was born on March 14, 1948 in Long Beach, Long Island, New York. He is the youngest of three sons born to Helen (Gabler) and Jack Crystal. His father was a well-known concert promoter who co-founded Commodore Records and his mother was a homemaker. His family were Jewish immigrants from Russia, Austria, and Lithuania. With his father in the music business, Billy was no stranger to some of the top performers of the time. Legends such as Billie Holiday, Pee Wee Russell, and Eddie Condon regularly stopped by the Crystal household. At age 15, Billy faced a personal tragedy when his father died of a heart attack at the relatively young age of 54. This gave Billy a real appreciation of what his dad was able to accomplish while alive and what his mother did to keep the family together. Despite this tragedy, Billy was very upbeat and likable as a kid. He had a unique talent for making people laugh. With television becoming a new medium, Billy got his influence from shows like The Honeymooners (1955), and \"The Ed Sullivan Show\" and performers like Alan King, Ernie Kovacs and Jonathan Winters. He started doing stand-up comedy at the age of 16. However, his real dream was to be a professional baseball player. His idol growing up was Yankees outfielder Mickey Mantle. He spent long hours in the summers playing softball in the middle of Park Avenue with his brothers and his father, a former pitcher at St. John's University . At Long Beach High, Billy played second base and was varsity captain in his senior year. This earned him a baseball scholarship from Marshall University in West Virginia which he accepted. However, he would never end up playing a game as the baseball program was suspended during his freshman year. This would lead him to leave the university and move back to New York. He then enrolled at nearby Nassau Community College, majoring in theater. It was there that he met and fell in love with a dancer named Janice Goldfinger. They would get married in 1970 and have two daughters. Shortly after, Billy got accepted in New York University, where he majored in Film and TV Direction. While at NYU, he studied under legendary filmmaker Martin Scorsese. He also worked as house manager and usher on a production of \"You're A Good Man, Charlie Brown\". After receiving a Bachelor of Fine Arts from NYU in 1970, Billy temporarily worked as a substitute teacher until he was able to get gigs as a stand-up comic. He formed his own improv group, 3's Company, and opened for musicians like Barry Manilow. His impression of Howard Cosell interviewing Muhammad Ali became a huge hit with the audience. He left Long Beach for Hollywood in August of 1976 in the hopes of trying to land a role on a television series. It only took a year before he got his big break when he was chosen for the role of gay character Jodie Dallas on the controversial ABC sitcom Soap (1977). This would be the first time that an American TV show would feature an openly gay character as a regular. The show ran successfully for four seasons and helped to jump-start Billy's previously stagnant career. After Soap (1977) ended in 1981, Billy continued to do his stand-up routine, which was now attracting a larger audience with his growing celebrity status. During this time, he made many TV guest appearances and even hosted his own short-lived variety show, The Billy Crystal Comedy Hour (1982). He became a regular on Saturday Night Live (1975) in 1984 where his Fernando Lamas impression with the catchphrase \"You Look Mahvellous\" was a huge hit with viewers. This would lead to appearances in feature-length films such as Running Scared (1986) and Throw Momma from the Train (1987). In 1986, along with Whoopi Goldberg and Robin Williams, he started Comic Relief, an annual stand-up comedy show which helped to raise money for housing and medical care for the homeless. The show has since grown substantially with the continued support of all three comics. Billy's career would peak in the late 1980s and early 1990s. His roles in the blockbuster movies When Harry Met Sally... (1989) and City Slickers (1991) helped to establish himself as one of Hollwood's top movie stars. This star status was further validated when he was chosen to host the annual Oscars in 1990, an honor in which he would repeat seven more times. He made his big screen directorial debut in the 1992 film Mr. Saturday Night (1992), which was about a washed-up stand-up comic who refuses to retire. He also wrote, produced and starred in the film. Although the film was not a huge hit, it proved that Billy was much more than an actor and comedian. In the following years, Billy continued to act in, produce, and direct several films. He had his share of hits (Analyze This (1999), America's Sweethearts (2001)) and some flops (Fathers' Day (1997), My Giant (1998)). His role in as a therapist to mobster Robert De Niro in Analyze This (1999) earned him critical praise. In 2001, Billy parlayed his childhood love of baseball and Mickey Mantle into a feature film. The movie, 61* (2001), which premiered on HBO, centered on the relationship between Mantle and Roger Maris and their 1961 pursuit of Babe Ruth's home run record. The film for which Billy served as director and executive producer, garnered 12 Emmy nominations in all. Offscreen, Billy remains married to Janice Crystal and they have homes in California and New York. Both of his daughters are involved in the film business. Jennifer Crystal Foley is an aspiring actress, appearing in 61* (2001), while Lindsay Crystal is an aspiring filmmaker, creating and directing the documentary My Uncle Berns (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MjA4MjM4NV5BMl5BanBnXkFtZTcwMzE0MjcxNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000345","name":"Billy Crystal","nicknames":["Face"],"idIMDB":"nm0000345"},"actorId":"nm0000345","character":"Billy Crystal","urlCharacter":"http://www.imdb.com/character/ch0326241","main":true},{"actorName":"Danny Glover","urlProfile":"http://www.imdb.com/name/nm0000418","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODM2MzQwN15BMl5BanBnXkFtZTcwMjY2OTI5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1946","placeOfBirth":" San Francisco, California, USA","birthName":"Danny Lebern Glover","height":"6' 4\" (1.93 m)","bio":"Actor, producer and humanitarian Danny Glover has been a commanding presence on screen, stage and television for more than 25 years. Glover was born in San Francisco, California, to Carrie (Hunley) and James Glover, postal workers who were also active in civil rights. Glover trained at the Black Actors' Workshop of the American Conservatory Theater. It was his Broadway debut in Fugard's Master Harold...and the Boys, which brought him to national recognition and led director Robert Benton to cast Glover in his first leading role in 1984's Oscar®-nominated Best Picture Places in the Heart. The following year, Glover starred in two more Best Picture nominees: Peter Weir's Witness and Steven Spielberg's The Color Purple. In 1987, Glover partnered with Mel Gibson in the first Lethal Weapon film and went on to star in three hugely successful Lethal Weapon sequels. Glover has also invested his talents in more personal projects, including the award-winning To Sleep With Anger, which he executive produced and for which he won an Independent Spirit Award for Best Actor; Bopha!; Manderlay; Missing in America; and the film version of Athol Fugard's play Boesman and Lena. On the small screen, Glover won an Image Award and a Cable ACE Award and earned an Emmy nomination for his performance in the title role of the HBO movie Mandela. He has also received Emmy nominations for his work in the acclaimed miniseries Lonesome Dove and the telefilm Freedom Song. As a director, he earned a Daytime Emmy nomination for Showtime's Just a Dream. Glover's film credits range from the blockbuster Lethal Weapon franchise to smaller independent features, some of which Glover also produced. He co-starred in the critically acclaimed feature Dreamgirls directed by Bill Condon and in Po' Boy's Game for director Clement Virgo. He appeared in the hit feature Shooter for director Antoine Fuqua, Honeydripper for director John Sayles, and Be Kind, Rewind for director Michel Gondry. Glover has also gained respect for his wide-reaching community activism and philanthropic efforts, with a particular emphasis on advocacy for economic justice, and access to health care and education programs in the United States and Africa. For these efforts, Glover received a 2006 DGA Honor. Internationally, Glover has served as a Goodwill Ambassador for the United Nations Development Program from 1998-2004, focusing on issues of poverty, disease, and economic development in Africa, Latin America, and the Caribbean, and serves as UNICEF Ambassador. In 2005, Glover co-founded Louverture Films dedicated to the development and production of films of historical relevance, social purpose, commercial value and artistic integrity. The New York based company has a slate of progressive features and documentaries including Trouble the Water, which won the Grand Jury Prize at the 2008 Sundance Film Festival, Africa Unite, award winning feature Bamako, and most recent projects Uncle Boonmee Who Can Recall His Past Lives, and The Disappearance of McKinley Nolan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODM2MzQwN15BMl5BanBnXkFtZTcwMjY2OTI5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000418","name":"Danny Glover","idIMDB":"nm0000418"},"actorId":"nm0000418","character":"Danny Glover","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bruce Willis","urlProfile":"http://www.imdb.com/name/nm0000246","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MjMzMTE5OF5BMl5BanBnXkFtZTcwMzQ2ODE3Mw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 March 1955","placeOfBirth":" Idar-Oberstein, West Germany","birthName":"Walter Bruce Willis","height":"6' (1.83 m)","bio":"Actor and musician Bruce Willis is well known for playing wisecracking or hard-edged characters, often in spectacular action films. Collectively, he has appeared in films that have grossed in excess of $2.5 billion USD, placing him in the top ten stars in terms of box office receipts. Walter Bruce Willis was born on March 19, 1955, in Idar-Oberstein, West Germany, to a German mother, Marlene K. (from Kassel), and an American father, David Andrew Willis (from Carneys Point, New Jersey), who were then living on a United States military base. His family moved to the U.S. shortly after he was born, and he was raised in Penns Grove, New Jersey, where his mother worked at a bank and his father was a welder and factory worker. Willis picked up an interest for the dramatic arts in high school, and was allegedly \"discovered\" whilst working in a café in New York City and then appeared in a couple of off-Broadway productions. While bartending one night, he was seen by a casting director who liked his personality and needed a bartender for a small movie role. After countless auditions, Willis contributed minor film appearances, usually uncredited, before landing the role of private eye \"David Addison\" alongside sultry Cybill Shepherd in the hit romantic comedy television series Moonlighting (1985). The series firmly established Bruce Willis as a hot new talent, and his sarcastic and wisecracking P.I. was in effect a dry run for the role of hard-boiled NYC detective \"John McClane\" in the monster hit Die Hard (1988). This superbly paced action film balanced laconic humor and wholesale destruction as Willis' character single handedly battles a gang of ruthless international thieves in a Los Angeles skyscraper. Willis reprized the role of tough guy cop \"John McClane\" in the eagerly anticipated sequel Die Hard 2 (1990) set at snowbound Washington's Dulles International Airport as a group of renegade Special Forces soldiers seek to repatriate a corrupt South American general. Excellent box office returns demanded a further sequel Die Hard with a Vengeance (1995) this time also starring Samuel L. Jackson as a cynical Harlem shopowner unwittingly thrust into assisting McClane during a terrorist bombing campaign on a sweltering day in NYC. Willis found time out from all the action mayhem to provide the voice of \"Mikey\" the baby in the very popular family comedies Look Who's Talking (1989), and its sequel Look Who's Talking Too (1990) also starring John Travolta and Kirstie Alley. Over the next decade, Willis starred in some very successful films, some very offbeat films and some unfortunate box office flops. The Bonfire of the Vanities (1990) and Hudson Hawk (1991) were both large scale financial disasters that were savaged by the critics, and both are arguably best left off the CVs of all the actors involved, however Willis was still popular with movie audiences and selling plenty of theatre tickets with the hyperviolent The Last Boy Scout (1991), the darkly humored Death Becomes Her (1992) and the mediocre police thriller Striking Distance (1993). During the 1990s, Willis also appeared in several independent and low budget productions that won him new fans and praise from the critics for his intriguing performances working with some very diverse film directors. He appeared in the oddly appealing North (1994), as a cagey prizefighter in the Quentin Tarantino directed mega-hit Pulp Fiction (1994), the Terry Gilliam directed apocalyptic thriller Twelve Monkeys (1995), the Luc Besson directed sci-fi opus The Fifth Element (1997) and the M. Night Shyamalan directed spine-tingling epic The Sixth Sense (1999). Willis next starred in the gangster comedy The Whole Nine Yards (2000), worked again with \"hot\" director M. Night Shyamalan in the less gripping Unbreakable (2000), and in two military dramas, Hart's War (2002) and Tears of the Sun (2003) that both failed to really fire with movie audiences or critics alike. However, Willis bounced back into the spotlight in the critically applauded Frank Miller graphic novel turned movie Sin City (2005), the voice of \"RJ\" the scheming raccoon in the animated hit Over the Hedge (2006) and \"Die Hard\" fans rejoiced to see \"John McClane\" return to the big screen in the high tech Live Free or Die Hard (2007) aka \"Die Hard 4.0\". Willis was married to actress Demi Moore for approximately thirteen years and they share custody to their three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MjMzMTE5OF5BMl5BanBnXkFtZTcwMzQ2ODE3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000246","name":"Bruce Willis","nicknames":["Bruno"],"idIMDB":"nm0000246"},"actorId":"nm0000246","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robin Wright","urlProfile":"http://www.imdb.com/name/nm0000705","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTc4MzEyOV5BMl5BanBnXkFtZTcwODY0ODkzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1966","placeOfBirth":" Dallas, Texas, USA","birthName":"Robin Virginia Gayle Wright","height":"5' 6\" (1.68 m)","bio":"Robin Virginia Wright was born in Dallas, Texas, to Gayle (Gaston), a national director at Mary Kay, and Freddie Wright, a pharmaceutical executive. She grew up in San Diego, California. She started her professional career as a model in 1980 at age 14, and worked both in Paris and Japan. After finishing high school she decided to become an actress. She got a role on the soap opera Santa Barbara (1984), for which she was nominated three times for a Daytime Emmy. During the first season of the show, she fell in love with fellow cast member Dane Witherspoon, whom she married in 1986. Meanwhile, she starred in The Princess Bride (1987), playing the title role. After leaving the cast of Santa Barbara, she got the starring role in Denial (1990) alongside Jason Patric. In 1990, she was in State of Grace (1990), where she met actor Sean Penn, by whom she had a daughter, Dylan Frances, and a son, Hopper Jack. After taking some time off, Robin was back to Hollywood with one the best roles of her career: She played Tara in The Playboys (1992). She was extremely stunning and brilliant. Then, she acted in Toys (1992) with Robin Williams, and she gave a funny performance. In 1994, Wright was in the blockbuster hit Forrest Gump (1994), with Tom Hanks. For her performance as Jenny, she got a nomination for a Golden Globe Award. She got a small role in The Crossing Guard (1995), which starred Jack Nicholson. After turning down 14 roles, she played the title role of MGM/UA upcoming Moll Flanders (1996), directed by Pen Densham. Her co-stars are Morgan Freeman and Stockard Channing. She just started to star in Erin Dignam's Loved (1997), with William Hurt.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTc4MzEyOV5BMl5BanBnXkFtZTcwODY0ODkzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000705","name":"Robin Wright","idIMDB":"nm0000705"},"actorId":"nm0000705","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Johnny Moreno","urlProfile":"http://www.imdb.com/name/nm1954162","urlPhoto":"","biography":{"height":"5' 9\" (1.75 m)","bio":"Johnny Moreno is an actor and writer, known for I'm Still Here (2010), Callback (2007) and Open House (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1954162","name":"Johnny Moreno","idIMDB":"nm1954162"},"actorId":"nm1954162","character":"Victor - Danny DeVito's stand-in","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny DeVito","urlProfile":"http://www.imdb.com/name/nm0000362","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5MjM5MzM3M15BMl5BanBnXkFtZTYwOTEzOTY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1944","placeOfBirth":" Asbury Park, New Jersey, USA","birthName":"Daniel Michael DeVito Jr.","height":"4' 10\" (1.47 m)","bio":"Danny DeVito has amassed a formidable and versatile body of work as an actor, producer and director that spans the stage, television and film. Daniel Michael DeVito Jr. was born on November 17, 1944, in Neptune, New Jersey, to Italian-American parents. His mother, Julia (Moccello), was a homemaker. His father, Daniel, Sr., was a small business owner whose ventures included a dry cleaning shop, a dairy outlet, a diner, and a pool hall. While growing up in Asbury Park, his parents sent him to private schools. He attended Our Lady of Mount Carmel grammar school and Oratory Prep School. Following graduation in 1962, he took a job as a cosmetician at his sister's beauty salon. A year later, he enrolled at New York's American Academy of Dramatic Arts so he could learn more about cosmetology. While at the academy, he fell in love with acting and decided to further pursue an acting career. During this time, he met another aspiring actor Michael Douglas at the National Playwrights Conference in Waterford, Connecticut. The two would later go on to collaborate on numerous projects. Soon after he also met an actress named Rhea Perlman. The two fell in love and moved in together. They were married in 1982 and had three children together. In 1968, Danny landed his first part in a movie when he appeared as a thug in the obscure Dreams of Glass (1970). Despite this minor triumph, Danny became discouraged with the film industry and decided to focus on stage productions. He made his Off-Broadway debut in 1969 in \"The Man With the Flower in His Mouth.\" He followed this up with stage roles in \"The Shrinking Bride,\" and \"Lady Liberty.\" In 1975, he was approached by director Milos Forman and Michael Douglas about appearing in the film version of One Flew Over the Cuckoo's Nest (1975), which would star Jack Nicholson in the leading role. With box office success almost guaranteed and a chance for national exposure, Danny agreed to the role. The movie became a huge hit, both critically and financially, and still ranks today as one the greatest movies of all time. Unfortunately, the movie did very little to help Danny's career. In the years following, he was relegated to small movie roles and guest appearances on television shows. His big break came in 1978 when he auditioned for a role on an ABC sitcom pilot called Taxi (1978), which centered around taxi cab drivers at a New York City garage. Danny auditioned for the role of dispatcher Louie DePalma. At the audition, the producers told Danny that he needed to show more attitude in order to get the part. He then slammed down the script and yelled, \"Who wrote this sh**?\" The producers, realizing he was perfect for the part, brought him on board. The show was a huge success, running from 1978 to 1983. Louie DePalma, played flawlessly by Danny, became one of the most memorable (and reviled) characters in television history. While he was universally hated by TV viewers, he was well-praised by critics, winning an Emmy award and being nominated three other times. Throughout the 1980s and 1990s, Danny maintained his status as a great character actor with memorable roles in movies like Romancing the Stone (1984), Ruthless People (1986), Throw Momma from the Train (1987) and Twins (1988). He also had a great deal of success behind the camera, directing movies like The War of the Roses (1989) and Hoffa (1992). In 1992, Danny was introduced to a new generation of moviegoers when he was given the role of The Penguin/Oswald Cobblepot in Tim Burton's highly successful Batman Returns (1992). This earned him a nomination for Best Villain at the MTV Movie Awards. That same year, along with his then-wife Rhea Perlman, Danny co-founded Jersey Films, which has produced many popular films and TV shows, including Pulp Fiction (1994), Get Shorty (1995), Man on the Moon (1999) and Erin Brockovich (2000). DeVito has many directing credits to his name as well, including Throw Momma from the Train (1987), The War of the Roses (1989), Hoffa (1992), Death to Smoochy (2002) and the upcoming St. Sebastian. In 2006, he returned to series television in the FX comedy series It's Always Sunny in Philadelphia (2005). With a prominent role in a hit series, Devito's comic talents were now on display for a new generation of television viewers. In 2012, he provided the title voice role in Dr. Seuss' The Lorax (2012). These days, he continues to work with many of today's top talents as an actor, director and producer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5MjM5MzM3M15BMl5BanBnXkFtZTYwOTEzOTY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000362","name":"Danny DeVito","idIMDB":"nm0000362"},"actorId":"nm0000362","character":"Danny DeVito","urlCharacter":"http://www.imdb.com/character/ch0026199","main":true},{"actorName":"Jerry Penacoli","urlProfile":"http://www.imdb.com/name/nm0671593","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NzMwMjM3NV5BMl5BanBnXkFtZTYwMTc1NDEz._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1956","placeOfBirth":" Scranton, Pennsylvania, USA","bio":"Jerry Penacoli was born on July 9, 1956 in Scranton, Pennsylvania, USA. He is an actor and director, known for Extra (1994), Galaxy Quest (1999) and I'm Still Here (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NzMwMjM3NV5BMl5BanBnXkFtZTYwMTc1NDEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0671593","name":"Jerry Penacoli","idIMDB":"nm0671593"},"actorId":"nm0671593","character":"Jerry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susan Patricola","urlProfile":"http://www.imdb.com/name/nm1704805","urlPhoto":"","biography":{"bio":"Susan Patricola is a publicist.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1704805","name":"Susan Patricola","idIMDB":"nm1704805"},"actorId":"nm1704805","character":"Susan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick Whitesell","urlProfile":"http://www.imdb.com/name/nm0925877","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDA0MzI2MzczNV5BMl5BanBnXkFtZTgwMjA5NzA3NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1965","placeOfBirth":" Iowa Falls, Iowa, USA","bio":"Patrick Whitesell was born on February 4, 1965 in Iowa Falls, Iowa, USA. He is a talent agent. He has been married to Lauren Sanchez since August 20, 2005. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDA0MzI2MzczNV5BMl5BanBnXkFtZTgwMjA5NzA3NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0925877","name":"Patrick Whitesell","idIMDB":"nm0925877"},"actorId":"nm0925877","character":"Patrick","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1356864","urlIMDB":"http://www.imdb.com/title/tt1356864","business":{"budget":null,"openingWeekend":[{"money":"$96,658","country":"USA","day":"12","month":"09","year":"2010","remarks":"19 Screens"}],"gross":[{"money":"$408,719","country":"USA","day":"31","month":"10","year":"2010","remarks":""},{"money":"$406,430","country":"USA","day":"24","month":"10","year":"2010","remarks":""},{"money":"$403,215","country":"USA","day":"17","month":"10","year":"2010","remarks":""},{"money":"$399,183","country":"USA","day":"10","month":"10","year":"2010","remarks":""},{"money":"$386,575","country":"USA","day":"04","month":"10","year":"2010","remarks":""},{"money":"$355,757","country":"USA","day":"26","month":"09","year":"2010","remarks":""},{"money":"$259,290","country":"USA","day":"19","month":"09","year":"2010","remarks":""},{"money":"$96,658","country":"USA","day":"12","month":"09","year":"2010","remarks":""}],"weekendGross":[{"money":"$1,258","country":"USA","day":"31","month":"10","year":"2010","remarks":"2 Screens"},{"money":"$2,331","country":"USA","day":"24","month":"10","year":"2010","remarks":"5 Screens"},{"money":"$2,001","country":"USA","day":"17","month":"10","year":"2010","remarks":"4 Screens"},{"money":"$4,808","country":"USA","day":"10","month":"10","year":"2010","remarks":"11 Screens"},{"money":"$11,508","country":"USA","day":"04","month":"10","year":"2010","remarks":"19 Screens"},{"money":"$31,996","country":"USA","day":"26","month":"09","year":"2010","remarks":"39 Screens"},{"money":"$113,333","country":"USA","day":"19","month":"09","year":"2010","remarks":"120 Screens"},{"money":"$96,658","country":"USA","day":"12","month":"09","year":"2010","remarks":"19 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 48 min (108 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":["FotoKem Laboratory, Burbank (CA), USA (color) (film-out) (prints)"],"filmLength":["2,954 m (Portugal, 35 mm)"],"negativeFormat":["Digital"],"cinematographicProcess":["Digital (HD)"],"printedFilmFormat":["35 mm","D-Cinema"]},"rating":"6.2","metascore":"48","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[{"award":"CPH:DOX 2010","titlesAwards":[{"titleAwardOutcome":"Nominated CPH:DOX Award","categories":[{"category":"","names":[{"name":"Casey Affleck","id":"nm0000729","role":null}]}]}]},{"award":"Gay and Lesbian Entertainment Critics Association (GALECA) 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Dorian Award","categories":[{"category":"Campy Film of the Year","names":[]}]}]},{"award":"Venice Film Festival 2010","titlesAwards":[{"titleAwardOutcome":"Won Biografilm Award","categories":[{"category":"Documentary","names":[{"name":"Casey Affleck","id":"nm0000729","role":null}]}]}]},{"award":"Village Voice Film Poll 2010","titlesAwards":[{"titleAwardOutcome":"Nominated VVFP Award","categories":[{"category":"Best Actor","names":[{"name":"Joaquin Phoenix","id":"nm0001618","role":null}]}]}]}],"votes":"16,571","type":"Movie","companyCreditsSimple":[{"idCompany":"co0310867","name":"They Are Going to Kill Us Productions"}],"keywords":{"keywords":["actor","celebrity","rapper","male pubic hair","penis","bare chested male","male frontal nudity","deception","deceit","sucker pitch","sucker","skepticism","scepticism","phineas taylor barnum","hoaxer","hoax","gullibility","gullible","fiction","faked footage","duped","dupe","credulousness","pseudo documentary","fake documentary","actor playing himself","mockumentary","contraction in title","claim in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:57:51"}}