{"data":{"movies":[{"title":"Bullet to the Head","originalTitle":"","year":"2012","releaseDate":"20130201","directors":[{"name":"Walter Hill","id":"nm0001353"}],"writers":[{"name":"Alessandro Camon","id":"nm0131947"},{"name":"Alexis Nolent","id":"nm1989798"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NzUyMjk2NV5BMl5BanBnXkFtZTcwOTUxNDc5OA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Thriller"],"plot":"In New Orleans, the hit men James Bonomo, a.k.a. Jimmy Bobo, and Louis Blanchard execute the dirty cop Hank Greely in a hotel room. But they are betrayed and Louis is stabbed in a bar by the mercenary Keegan while waiting for the payment of the contract. Meanwhile the Washington D.C. police detective Taylor Kwon comes to New Orleans to investigate the murder of Greely, who had stolen evidences from the Police Department. Soon he is shot by two dirty detectives but Jimmy saves his life. Jimmy brings Taylor to the shop of his daughter Lisa and she removes the bullet from his shoulder and nurses him. Taylor and Jimmy form the most unlikely partnership to investigate the crimes and after contacting the intermediate Ronnie Earl that had hired Jimmy and Louis, they discover a network of corruption formed by the lawyer Marcus Baptiste and the entrepreneur Robert Nkomo Morel.","simplePlot":"After watching their respective partners die, a New Orleans hitman and a Washington, D.C. detective form an alliance in order to bring down their common enemy.","actors":[{"actorName":"Sylvester Stallone","urlProfile":"http://www.imdb.com/name/nm0000230","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTk3NDU2OV5BMl5BanBnXkFtZTcwNTA3MTI0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1946","placeOfBirth":" New York City, New York, USA","birthName":"Sylvester Gardenzio Stallone","height":"5' 9½\" (1.77 m)","bio":"This athletically built, dark-haired American actor/screenwriter/director may never be mentioned by old-school film critics in the same breath as, say, Richard Burton or Alec Guinness; however, movie fans worldwide have been flocking to see Stallone's films for over 30 years, making \"Sly\" one of Hollywood's biggest-ever box office draws. Sylvester Stallone was born on July 6, 1946, in New York's gritty Hell's Kitchen, to Jackie Stallone (née Labofish), an astrologer, and Frank Stallone, a beautician and hairdresser. His father was an Italian immigrant, and his mother's heritage is half French (from Brittany) and half German. The young Stallone attended the American College of Switzerland and the University of Miami, eventually obtaining a B.A. degree. Initially, he struggled in small parts in films such as the soft-core The Party at Kitty and Stud's (1970), the thriller Klute (1971) and the comedy Bananas (1971). He got a crucial career break alongside fellow young actor Henry Winkler, sharing lead billing in the effectively written teen gang film The Lords of Flatbush (1974). Further film and television roles followed, most of them in uninspiring productions except for the opportunity to play a megalomaniac, bloodthirsty race driver named \"Machine Gun Joe Viterbo\" in the Roger Corman-produced Death Race 2000 (1975). However, Stallone was also keen to be recognized as a screenwriter, not just an actor, and, inspired by the 1975 Muhammad Ali-Chuck Wepner fight in Cleveland, Stallone wrote a film script about a nobody fighter given the \"million to one opportunity\" to challenge for the heavyweight title. Rocky (1976) became the stuff of cinematic legends, scoring ten Academy Award nominations, winning the Best Picture Award of 1976 and triggering one of the most financially successful movie franchises in history! Whilst full credit is wholly deserved by Stallone, he was duly supported by tremendous acting from fellow cast members Talia Shire, Burgess Meredith and Burt Young, and director John G. Avildsen gave the film an emotive, earthy appeal from start to finish. Stallone had truly arrived on his terms, and offers poured in from various studios eager to secure Hollywood's hottest new star. Stallone followed Rocky (1976) with F.I.S.T. (1978), loosely based on the life of Teamsters boss \"Jimmy Hoffa\", and Paradise Alley (1978) before pulling on the boxing gloves again to resurrect Rocky Balboa in the sequel Rocky II (1979). The second outing for the \"Italian Stallion\" wasn't as powerful or successful as the first \"Rocky\"; however, it still produced strong box office. Subsequent films Nighthawks (1981) and Victory (1981) failed to ignite with audiences, so Stallone was once again lured back to familiar territory with Rocky III (1982) and a fearsome opponent in \"Clubber Lang\" played by muscular ex-bodyguard Mr. T. The third \"Rocky\" installment far outperformed the first sequel in box office takings, but Stallone retired his prizefighter for a couple of years as another mega-franchise was about to commence for the busy actor. The character of Green Beret \"John Rambo\" was the creation of Canadian-born writer David Morrell, and his novel was adapted to the screen with Stallone in the lead role in First Blood (1982), also starring Richard Crenna and Brian Dennehy. The movie was a surprise hit that polarized audiences because of its commentary about the Vietnam war, which was still relatively fresh in the American public's psyche. Political viewpoints aside, the film was a worldwide smash, and a sequel soon followed with Rambo: First Blood Part II (1985), which drew even stronger criticism from several quarters owing to the film's plotline about American MIAs allegedly being held in Vietnam. But they say there is no such thing as bad publicity, and \"John Rambo's\" second adventure was a major money spinner for Stallone and cemented him as one of the top male stars of the 1980s. Riding a wave of amazing popularity, Stallone called on old sparring partner Rocky Balboa to climb back into the ring to defend American pride against a Soviet threat in the form of a towering Russian boxer named \"Ivan Drago\" played by curt Dolph Lundgren in Rocky IV (1985). The fourth outing was somewhat controversial with \"Rocky\" fans, as violence levels seemed excessive compared to previous \"Rocky\" films, especially with the savage beating suffered by Apollo Creed, played by Carl Weathers, at the hands of the unstoppable \"Siberian Express\". Stallone continued forward with a slew of macho character-themed films that met with a mixed reception from his fans. Cobra (1986) was a clumsy mess, Over the Top (1987) was equally mediocre, Rambo III (1988) saw Rambo take on the Russians in Afghanistan, and cop buddy film Tango & Cash (1989) just did not quite hit the mark, although it did feature a top-notch cast and there was chemistry between Stallone and co-star Kurt Russell. Philadelphia's favorite mythical boxer moved out of the shadows for his fifth screen outing in Rocky V (1990) tackling Tommy \"Machine\" Gunn played by real-life heavyweight fighter Tommy Morrison, the great-nephew of screen legend John Wayne. Sly quickly followed with the lukewarm comedy Oscar (1991), the painfully unfunny Stop! Or My Mom Will Shoot (1992), the futuristic action film Demolition Man (1993), and the comic book-inspired Judge Dredd (1995). Interestingly, Stallone then took a departure from the gung-ho steely characters he had been portraying to stack on a few extra pounds and tackle a more dramatically challenging role in the intriguing Cop Land (1997), also starring Robert De Niro and Ray Liotta. It isn't a classic of the genre, but Cop Land (1997) certainly surprised many critics with Stallone's understated performance. Stallone then lent his vocal talents to the animated adventure story Antz (1998), reprised the role made famous by Michael Caine in a terrible remake of Get Carter (2000), climbed back into a race car for Driven (2001), and guest-starred as the \"Toymaker\" in the third chapter of the immensely popular \"Spy Kids\" film series, Spy Kids 3-D: Game Over (2003). Showing that age had not wearied his two most popular franchises, Stallone has most recently brought back never-say-die boxer Rocky Balboa to star in, well, what else but Rocky Balboa (2006), and Vietnam veteran Rambo (2008) will reappear after a 20-year hiatus to once again right wrongs in the jungles of Thailand. Love him or loathe him, Sylvester Stallone has built an enviable and highly respected career in Hollywood; plus, he has considerably influenced modern popular culture through several of his iconic film characters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTk3NDU2OV5BMl5BanBnXkFtZTcwNTA3MTI0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000230","name":"Sylvester Stallone","nicknames":["Sly","Michael","The Italian Stallion","Binky","Sly Stallone"],"idIMDB":"nm0000230"},"actorId":"nm0000230","character":"James Bonomo","urlCharacter":"http://www.imdb.com/character/ch0387561","main":true},{"actorName":"Sung Kang","urlProfile":"http://www.imdb.com/name/nm0437646","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NTM1ODg0MF5BMl5BanBnXkFtZTgwODM3MDQxNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1972","placeOfBirth":" Gainesville, Georgia, USA","height":"6' (1.83 m)","bio":"Sung Kang was born on April 8, 1972 in Gainesville, Georgia, USA. He is an actor, known for Fast & Furious 6 (2013), Fast Five (2011) and Live Free or Die Hard (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NTM1ODg0MF5BMl5BanBnXkFtZTgwODM3MDQxNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0437646","name":"Sung Kang","idIMDB":"nm0437646"},"actorId":"nm0437646","character":"Taylor Kwon","urlCharacter":"http://www.imdb.com/character/ch0288778","main":true},{"actorName":"Sarah Shahi","urlProfile":"http://www.imdb.com/name/nm1083404","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MzE2NTI1NV5BMl5BanBnXkFtZTcwODcwMzMwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 January 1980","placeOfBirth":" Euless, Texas, USA","birthName":"Aahoo Jahansouz Shahi","height":"5' 3\" (1.6 m)","bio":"Sarah Shahi was born Aahoo Jahansouz in Euless, Texas, to an Iranian father and Spanish mother. She is a former NFL cheerleader and a descendant of a 19th-century Persian Shah. She attended Trinity High School and Dallas Southern Methodist University, studied opera and majored in English. As a teenager, she won several beauty contests, and took first place in the Miss Fort Worth USA pageant in 1997. She joined the Dallas Cowboys cheerleaders and was part of the 1999-2000 squad. She also appeared on the cover of their 2000 calendar. While working as an extra on the set of Dr. T & the Women (2000), she met director Robert Altman, who encouraged her to move to Hollywood to pursue a career as an actress. She had recurring roles in several TV series, such as Alias (2001), in which she played \"Jenny\"; Dawson's Creek (1998), where she was \"Sadia Shaw\"; and The L Word (2004), playing \"Carmen de la Pica Morales\". Shahi was also the first ghost in Supernatural (2005), the CW paranormal drama series. She is best-known for her role as the Mexican-American DJ \"Carmen de la Pica Morales\" in the Showtime series, The L Word (2004), which she joined in its second season. Sarah did not renew her contract with the show for a fourth season and, consequently, her character was written out. She also appeared in HBO's The Sopranos (1999), in the episode Kennedy and Heidi (#6.18) as \"Sonya Aragon\", a stripper and college student who spends a weekend with Tony after a death in his family. Although uncredited by most sources, Sarah also appeared in the Jackie Chan film, Rush Hour 3 (2007), as one of the girls being handcuffed along with Mia Tyler for traffic offense by Chris Tucker early in the film. She also starred with Damian Lewis in the NBC show, Life (2007). Sarah speaks English, Farsi and some Spanish, and has a brown belt in karate.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MzE2NTI1NV5BMl5BanBnXkFtZTcwODcwMzMwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1083404","name":"Sarah Shahi","idIMDB":"nm1083404"},"actorId":"nm1083404","character":"Lisa","urlCharacter":"http://www.imdb.com/character/ch0387778","main":true},{"actorName":"Adewale Akinnuoye-Agbaje","urlProfile":"http://www.imdb.com/name/nm0015382","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzA5MTI5MF5BMl5BanBnXkFtZTgwMTUxMjcwOTE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 August 1967","placeOfBirth":" Islington, London, England, UK","birthName":"Adewale Rotimi O. C. E. Akinnuoye Agbaje","height":"6' 2\" (1.88 m)","bio":"Born and raised in London, England, Adewale Akinnuoye-Agbaje began his career as a model in Milan. He graduated with a masters degree in Law from London's prestigious Kings College, before moving to Los Angeles to make the transition to acting. Fluent in several languages, including English, Italian, Yoruba and Swahili, he is best known for his roles in the movies Congo (1995) and The Mummy Returns (2001), and the HBO series Oz (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzA5MTI5MF5BMl5BanBnXkFtZTgwMTUxMjcwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0015382","name":"Adewale Akinnuoye-Agbaje","nicknames":["Triple A","Wally"],"idIMDB":"nm0015382"},"actorId":"nm0015382","character":"Robert Nkomo Morel","urlCharacter":"http://www.imdb.com/character/ch0387779","main":true},{"actorName":"Jason Momoa","urlProfile":"http://www.imdb.com/name/nm0597388","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MTU5NjM1MV5BMl5BanBnXkFtZTcwODc4MDk0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 August 1979","placeOfBirth":" Honolulu, Hawaii, USA","birthName":"Joseph Jason Namakaeha Momoa","height":"6' 4\" (1.93 m)","bio":"Joseph Jason Namakaeha Momoa was born on August 1, 1979 in Honolulu, Hawaii. He is the son of Coni (Lemke), a photographer, and Joseph Momoa, a painter. His father is of Hawaiian descent and his mother, who is from Iowa, is of mostly German ancestry. Jason was raised in Norwalk, Iowa by his mother. After high school, he moved to Hawaii where he landed a lead role out of thousands of hopefuls in the T.V. series, Baywatch (1989) (known as \"Baywatch Hawaii\" in its tenth season). When the show ended, he spent the next couple of years traveling around the world. In 2001, he moved to Los Angeles where he continued to pursue an acting career. In 2004, after the short-lived T.V. series North Shore (2004), he was cast as the popular character \"Ronon Dex\" in the T.V. series Stargate: Atlantis (2004), which achieved a cult-like following. In 2010, he appeared in the Emmy-nominated H.B.O. series Game of Thrones (2011) playing the Dothraki King, \"Khal Drogo\". To illustrate to the producers he was Khal Drogo, he performed the Haka, a traditional war dance of the Maori of New Zealand. The audition was with the same casting director who was casting the titular role in the reboot of Conan the Barbarian (2011). Four weeks after he was cast as the popular Robert E. Howard character, he began shooting in Bulgaria. His approach, like the film-makers, was to pull from the eight decades of comics and stories as well as the Frank Frazetta images rather than the hugely popular 1982 movie. Jason has a production company, \"Pride of Gypsies\", in which he is expanding his career from actor to filmmaker. He has directed a couple of short films and is working on his feature film debut \"Road to Paloma\" which is pulled from a series of stories he's been developing over the years which he calls the Brown Bag Diaries: Ridin' the Blinds in B Minor (2010). Jason lives with actress Lisa Bonet with whom he has two children: Lola and Nakoa-Wolf.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MTU5NjM1MV5BMl5BanBnXkFtZTcwODc4MDk0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0597388","name":"Jason Momoa","idIMDB":"nm0597388"},"actorId":"nm0597388","character":"Keegan","urlCharacter":"http://www.imdb.com/character/ch0263473","main":true},{"actorName":"Christian Slater","urlProfile":"http://www.imdb.com/name/nm0000225","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5ODA1ODY2Nl5BMl5BanBnXkFtZTgwNjcwNDczNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1969","placeOfBirth":" New York City, New York, USA","birthName":"Christian Michael Leonard Slater","height":"5' 8½\" (1.74 m)","bio":"Christian Michael Leonard Slater was born on August 18, 1969 in New York City, to Michael Hawkins, a well-known soap actor, and Mary Jo Slater (née Lawton), a casting agent. Christian started in show business early, appearing on the soap opera The Edge of Night (1956) in 1976 at the age of 7. He went on to star in many Broadway shows in the early-1980s. He rose to fame in Hollywood after landing the role of Binx Davey in The Legend of Billie Jean (1985). He moved to Los Angeles in 1987 to pursue a further acting career after dropping out of high school. After having a starring role in the cult classic Heathers (1988), he became somewhat known as the Hollywood bad-boy, having many run-ins with the law. He is also well-known for having dated stars such as Winona Ryder, Christina Applegate, Samantha Mathis and was at one time engaged to actress/model Nina Huang. In 2000, he married Ryan Haddon, the daughter of 1970s model Dayle Haddon. The couple have two children, Jaden Christopher (b. 1999) and Eliana Sophia (b. 2001). As of early 2005, they separated and later divorced, but remain dedicated to bring up their children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5ODA1ODY2Nl5BMl5BanBnXkFtZTgwNjcwNDczNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000225","name":"Christian Slater","nicknames":["Slates"],"idIMDB":"nm0000225"},"actorId":"nm0000225","character":"Marcus Baptiste","urlCharacter":"http://www.imdb.com/character/ch0288775","main":true},{"actorName":"Jon Seda","urlProfile":"http://www.imdb.com/name/nm0781218","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI1MTA2MjkxM15BMl5BanBnXkFtZTcwMTcwMDg2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 October 1970","placeOfBirth":" New York City, New York, USA","birthName":"Jonathan Seda","height":"5' 9\" (1.75 m)","bio":"Jon Seda's first passion was to be a championship boxer. After taking runner-up in the NJ Golden Gloves, the 1992 Olympics was the next goal. That's when fate stepped in; at his first audition, for Gladiator (1992), he was given a co-starring role! Since then he has branched off into numerous television and film roles. He has garnered critical acclaim for his roles in such films as I Like It Like That (1994), The Sunchaser (1996), Selena (1997), Undisputed (2002), and in television for his roles in Homicide: Life on the Street (1993), UC: Undercover (2001), Third Watch (1999), Oz (1997) and most recently his lead role as Marine Sgt. John \"Manila\" Basilone in HBO's award-winning mini series The Pacific (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI1MTA2MjkxM15BMl5BanBnXkFtZTcwMTcwMDg2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0781218","name":"Jon Seda","idIMDB":"nm0781218"},"actorId":"nm0781218","character":"Louis Blanchard","urlCharacter":"http://www.imdb.com/character/ch0421823","main":true},{"actorName":"Holt McCallany","urlProfile":"http://www.imdb.com/name/nm0564697","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MzYzMjgyNV5BMl5BanBnXkFtZTcwMjk1MzMzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 September 1963","placeOfBirth":" New York City, New York, USA","birthName":"Michael Quinn McAloney","height":"6' 1\" (1.85 m)","bio":"Holt McCallany was born into a family of New York City actors; his mother was the renowned singer/actress Julie Wilson, and his father was Tony Award-winning actor and producer Michael McAloney. He began school in Dublin, Ireland at the age of five before his parents moved back to NY. At 14 years old, he ran away from home and took a Greyhound bus to Los Angeles to pursue his dream of becoming an actor but his parents tracked him down and sent him back to Ireland to boarding school. Following high school, Holt went to France to continue his education. He learned French at the Sorbonne, studied art history at the Paris American Academy, and theater at L'Ecole Marceau and L'Ecole Jacques Lecoq. He spent a summer studying Shakespeare in Oxford then moved back to New York City permanently to begin his acting career. McCallany has worked with the most prestigious directors and actors of our time in films like GANGSTER SQUAD (Sean Penn, Ryan Gosling, Josh Brolin, Emma Stone), FIGHT CLUB (Brad Pitt, Edward Norton, directed by David Fincher), THREE KINGS (George Clooney, Mark Wahlberg, directed by David O. Russell), MEN OF HONOR (Cuba Gooding Jr., Robert DeNiro), BELOW (written by Darren Aronofsky, Lucas Sussman & David Twohy), VANTAGE POINT (Dennis Quaid, Forest Whitaker, produced by Neil Moritz), THE LOSERS (Idris Elba, Zoe Saldana), BLACKHAT (Chris Hemsworth and directed, produced and co-written by Michael Mann), RUN ALL NIGHT (Liam Neeson, Joel Kinnaman, Ed Harris) and THE PERFECT GUY (Sanaa Lathan, Michael Ealy, Morris Chestnut). Holt also starred in THE GANZFELD EXPERIMENT, an exploration of extrasensory perception and WHITE SPACE, a futuristic retelling of Herman Melville's classic Moby Dick. Most recently he shot SULLY (Tom Hanks, directed by Clint Eastwood) and SHOT CALLER (Nikolaj Coster-Waldau, directed by Ric Roman Waugh). On television, McCallany starred in the critically acclaimed dramatic series LIGHTS OUT for FX earning rave reviews for his performance as heavyweight champion Patrick \"Lights\" Leary. He played a detective with psychological problems on CSI MIAMI, the district attorney and love interest to Bridget Moynahan's character on CBS's hit drama BLUE BLOODS and a soldier with post-traumatic stress disorder on CRIMINAL MINDS, among others. For the stage, Holt's credits include The Taming Of The Shrew, Twelfth Night, Bovver Boys, Rosetta Street, and By The Sea, By The Sea, By The Beautiful Sea.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MzYzMjgyNV5BMl5BanBnXkFtZTcwMjk1MzMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0564697","name":"Holt McCallany","idIMDB":"nm0564697"},"actorId":"nm0564697","character":"Hank Greely","urlCharacter":"http://www.imdb.com/character/ch0490392","main":true},{"actorName":"Brian Van Holt","urlProfile":"http://www.imdb.com/name/nm0887144","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTg2MjQ5OF5BMl5BanBnXkFtZTYwMjM0NTM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1969","placeOfBirth":" Waukegan, Illinois, USA","birthName":"Brian E. Van Holt","height":"6' 1\" (1.85 m)","bio":"Brian Van Holt was born on July 6, 1969 in Waukegan, Illinois, USA as Brian E. Van Holt. He is an actor, known for La maison de cire (2005), S.W.A.T. (2003) and Cougar Town (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTg2MjQ5OF5BMl5BanBnXkFtZTYwMjM0NTM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0887144","name":"Brian Van Holt","idIMDB":"nm0887144"},"actorId":"nm0887144","character":"Ronnie Earl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Weronika Rosati","urlProfile":"http://www.imdb.com/name/nm1617964","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MjQ4MjI4Ml5BMl5BanBnXkFtZTgwMDI3ODY4ODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1984","placeOfBirth":" Warsaw, Mazowieckie, Poland","birthName":"Weronika Anna Dolores Rosati","height":"5' 4¼\" (1.63 m)","bio":"Weronika Rosati was is an international actress. Born in 1984 in Warsaw, her polish- american-hungarian mother is a famous fashion designer and her Italian father is a respected politician/economist now a depute at the european parliament. She has been working in films since she was a teenager , she became a Polish sensation after appearing in numerous popular tv series and achieved both stardom and recognition at the age go 19 with her first screen appearance in the lead female role of Gemma in \"Pitbull\"- a cop thriller classic. She attended the prestigious Lodz film school and then moved to New york where for two years she studied at the Lee Strasberg Institute. In the meantime she followed her career in Polish film working with such heat filmmakers as Krzysztof Zanussi in \"Foreign Body\" ( which premiered at the International Toronto film festival), Agnieszka Holland \" In darkness\" ( nominated for an oscar for best foreign film), and in many other feature films and tv shows. In 2013 Weronika played the role of Pestka in the World War 2 drama \" Manhunt\" which got international critical acclaim - she got her first Polish Film Academy nomination for best actress for her role and she got numerous awards including the Pola Negri prize for her portrayal of a young Jewish woman trying to save her sister from death. Rosati works often in France ( where she lived as a child and speaks fluent french) - she played a lead in tv film for france 2 television in \"La Dame de Pique\" and in Jerome Salle \"burma conspiracy\" opposite Tomer Sisley and Sharon Stone. Her first big breakthrough in the US was in 2011 when she was cast by Michael Mann in \"Luck\" the HBO original tv series starring Dustin Hoffman. She played a poker dealer Naomi , the love interest of Jason Gedrick and appeared in 4 episodes. From the she worked constantly in other tv show and films including \" True detective' season 2, \"Ncis\", \"The Iceman\" posit Michael Shannon, \"Bullett to the head\" opposite Sylvester Stallone, directed by Walter Hill, \"Last Vegas\" with Michael Douglas and \"Rosemary's baby' for NBC. In 2015 Weronika completed \" USS Indianapolis : men of courage\" a highly anticipated world war 2 drama directed by Mario Van Peebles. where she played Nicolas cage wife. She also will appear as a guest star on a new TBS comedy show \"the Detour\", as well as a French agent in a lead guest star on the popular show\"supernatural\" directed by John Badham. She just wrapped a historical epic international co-production produced by Fred Roos \"music, war and love\" directed by Martha Coolidge where she stars opposite Stellan Skarsgaard. Rosati is a household name in Europe where she was also a spokesperson for Avon cosmetics and Pantene among others. currently lives in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MjQ4MjI4Ml5BMl5BanBnXkFtZTgwMDI3ODY4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1617964","name":"Weronika Rosati","idIMDB":"nm1617964"},"actorId":"nm1617964","character":"Lola","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dane Rhodes","urlProfile":"http://www.imdb.com/name/nm1694797","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzIyMzIzNl5BMl5BanBnXkFtZTcwNjE0NzcyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Dane is an actor and director in New Orleans La. He has appeared on stages and in films around the world. Some of his favorite experiences have included working on a world premier play called MAcbeth at the Gates with Roy Marsden and his friend David Lumsden and getting to work with John Travolta, Scarlette Johannson, and Shanie Gable on A Love Song for Bobby Long (the movie that launched his journey into film). When he isn't chasing his career, he is chasing his dog Hunter around the Big Easy... his home away from home.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzIyMzIzNl5BMl5BanBnXkFtZTcwNjE0NzcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1694797","name":"Dane Rhodes","idIMDB":"nm1694797"},"actorId":"nm1694797","character":"LT. Lebreton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marcus Lyle Brown","urlProfile":"http://www.imdb.com/name/nm0114177","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1ODM0NjU5NV5BMl5BanBnXkFtZTcwMTQ4MjY3Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 December 1970","placeOfBirth":"","height":"6' (1.83 m)","bio":"Marcus Lyle Brown was born on December 26, 1970. He is an actor and producer, known for 12 Years a Slave (2013), Monster's Ball (2001) and The Host (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1ODM0NjU5NV5BMl5BanBnXkFtZTcwMTQ4MjY3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0114177","name":"Marcus Lyle Brown","idIMDB":"nm0114177"},"actorId":"nm0114177","character":"Detective Towne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrew Austin-Peterson","urlProfile":"http://www.imdb.com/name/nm5011757","urlPhoto":"","biography":{"bio":"Andrew Austin-Peterson is known for his work on Beasts of the Southern Wild (2012) and Bullet to the Head (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5011757","name":"Andrew Austin-Peterson","idIMDB":"nm5011757"},"actorId":"nm5011757","character":"Crawfish Hollow Band","urlCharacter":"http://www.imdb.com/character/ch0490395","main":true},{"actorName":"Paul Etheredge","urlProfile":"http://www.imdb.com/name/nm0262049","urlPhoto":"","biography":{"dateOfBirth":"11 June 1968","placeOfBirth":" Fort Worth, Texas, USA","bio":"Paul Etheredge was born on June 11, 1968 in Fort Worth, Texas, USA. He is known for his work on Through the Wormhole (2010), Hellbent (2004) and Angel of Death (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0262049","name":"Paul Etheredge","idIMDB":"nm0262049"},"actorId":"nm0262049","character":"Crawfish Hollow Band","urlCharacter":"http://www.imdb.com/character/ch0490395","main":true},{"actorName":"Robert Cavan Carruth","urlProfile":"http://www.imdb.com/name/nm5475610","urlPhoto":"","biography":{"bio":"Robert Cavan Carruth is an actor, known for Bullet to the Head (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5475610","name":"Robert Cavan Carruth","idIMDB":"nm5475610"},"actorId":"nm5475610","character":"Crawfish Hollow Band","urlCharacter":"http://www.imdb.com/character/ch0490395","main":true}],"seasons":[],"idIMDB":"tt1308729","urlIMDB":"http://www.imdb.com/title/tt1308729","business":{"budget":{"money":"$55,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$4,548,201","country":"USA","day":"03","month":"02","year":"2013","remarks":"2,404 Screens"},{"money":"€299,000","country":"Italy","day":"07","month":"04","year":"2013","remarks":"250 Screens"},{"money":"PHP 5,772,202","country":"Philippines","day":"10","month":"02","year":"2013","remarks":"113 Screens"}],"gross":[{"money":"$9,483,821","country":"USA","day":"10","month":"03","year":"2013","remarks":""},{"money":"$9,454,404","country":"USA","day":"03","month":"03","year":"2013","remarks":""},{"money":"$9,397,523","country":"USA","day":"24","month":"02","year":"2013","remarks":""},{"money":"$9,279,012","country":"USA","day":"17","month":"02","year":"2013","remarks":""},{"money":"$8,269,214","country":"USA","day":"10","month":"02","year":"2013","remarks":""},{"money":"$4,548,201","country":"USA","day":"03","month":"02","year":"2013","remarks":""},{"money":"$473,105","country":"Italy","day":"08","month":"05","year":"2013","remarks":""},{"money":"PHP 7,230,226","country":"Philippines","day":"17","month":"02","year":"2013","remarks":""},{"money":"PHP 5,772,202","country":"Philippines","day":"10","month":"02","year":"2013","remarks":""}],"weekendGross":[{"money":"$11,659","country":"USA","day":"10","month":"03","year":"2013","remarks":"34 Screens"},{"money":"$40,933","country":"USA","day":"03","month":"03","year":"2013","remarks":"86 Screens"},{"money":"$39,071","country":"USA","day":"24","month":"02","year":"2013","remarks":"105 Screens"},{"money":"$240,819","country":"USA","day":"17","month":"02","year":"2013","remarks":"470 Screens"},{"money":"$2,078,192","country":"USA","day":"10","month":"02","year":"2013","remarks":"2,404 Screens"},{"money":"$4,548,201","country":"USA","day":"03","month":"02","year":"2013","remarks":"2,404 Screens"},{"money":"PHP 141,620","country":"Philippines","day":"17","month":"02","year":"2013","remarks":"10 Screens"},{"money":"PHP 5,772,202","country":"Philippines","day":"10","month":"02","year":"2013","remarks":"113 Screens"}],"admissions":[{"money":"8,256","country":"Portugal","day":"03","month":"04","year":"2013","remarks":""},{"money":"6,462","country":"Portugal","day":"27","month":"03","year":"2013","remarks":""}],"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":[{"money":null,"country":null,"day":"27","month":"06","year":"2011","remarks":null},{"money":null,"country":null,"day":"25","month":"08","year":"2011","remarks":null}],"copyrightHolder":"(C) 2012 Headshot Film Investments, LLC. All Rights Reserved."},"technical":{"runtime":["1 hr 32 min (92 min)"],"soundMix":["Dolby Digital","Datasat","SDDS"],"color":["Color","Black and White"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Panaflex Millennium XL2, Panavision Primo Lenses","Panavision Panaflex Platinum, Panavision Primo Lenses"],"laboratory":["Cineworks, New Orleans (LA), USA (processing)","Technicolor (color)","Warner Bros. Motion Picture Imaging, Burbank (CA), USA (digital intermediate)"],"filmLength":["2,512 m (6 reels)"],"negativeFormat":["35 mm (Fuji)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (source format)"],"printedFilmFormat":["35 mm (spherical) (Kodak Vision 2383)","D-Cinema"]},"rating":"5.7","metascore":"48","filmingLocations":[{"location":"Kenner, Louisiana, USA"}],"rated":"R","awards":[{"award":"Razzie Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Actor","names":[{"name":"Sylvester Stallone","id":"nm0000230","role":null},{"name":"Escape Plan","id":"tt1211956","role":null},{"name":"Grudge Match","id":"tt1661382","role":null}]}]}]}],"votes":"40,758","type":"Movie","companyCreditsSimple":[{"idCompany":"co0208137","name":"IM Global"},{"idCompany":"co0050870","name":"Dark Castle Entertainment"},{"idCompany":"co0188223","name":"Millar Gough Ink"}],"keywords":{"keywords":["detective","bullet","corruption","bar","lawyer","mercenary","police detective","hotel","murder","hitman","briefcase of money","handgun","gun","latex gloves","vengeance","louisiana","assassination","professional killer","professional hitman","contract killer","breasts","final showdown","opening action scene","street shootout","bar shootout","police shootout","stabbed in the throat","falling to death","slow motion scene","breaking a bottle over someone's head","man punching a woman","ferry","c4 explosives","jumping through a window","underwater scene","reference to google","duct tape over mouth","knocked out","masked man","korean american","punched in the stomach","punched in the face","kicked in the face","character repeating someone else's dialogue","police officer shot","betrayal","switchblade","ex convict","police lieutenant","stabbed in the side","whiskey","flashback","impersonating a police officer","cocaine","scene during opening credits","freeze frame","black and white scene","altered version of studio logo","bathhouse","night cityscape","hit by a car","jazz band","parade","autopsy","mugshot","stabbed multiple times","bare chested male","rifle","knife","interrogation","fight in the restroom","ex cop","blood splatter","blood","nonlinear timeline","mansion","costume party","gangster","crime boss","organized crime","newspaper headline","safe house","lasersight","crime scene","ex soldier","morgue","corpse","murder of a police officer","police station","revenge","death of partner","police corruption","corrupt cop","female rear nudity","abandoned factory","filmed killing","cell phone","tattoo parlor","tattoo artist","tattoo","buddy comedy","silencer","machine gun","pistol","prostitute","conspiracy","assassin","rescue","car bomb","bomb","explosion","held at gunpoint","hostage","kidnapping","tied to a chair","bound and gagged","stabbed in the foot","stabbed to death","stabbed in the back","stabbed in the chest","death","shot to death","shot in the shoulder","shot in the back","shot in the chest","shot in the forehead","machismo","exploding house","exploding car","axe fight","axe","shootout","hand to hand combat","martial arts","mixed martial arts","stylized violence","brawl","fistfight","tough guy","one man army","anti hero","father daughter relationship","new orleans louisiana","voice over narration","kung fu","shot in the head","violence","based on graphic novel","part of the body in title","police officer","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:44:37"}}