{"data":{"movies":[{"title":"La revanche des Dragons Verts","originalTitle":"Revenge of the Green Dragons","year":"2014","releaseDate":"20140911","directors":[{"name":"Wai-Keung Lau","id":"nm0490487"},{"name":"Andrew Loo","id":"nm0519594"}],"writers":[{"name":"Michael Di Jiacomo","id":"nm0223939"},{"name":"Andrew Loo","id":"nm0519594"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYzOTc2Mzc1NV5BMl5BanBnXkFtZTgwODQ3NTQ0MjE@._V1.jpg","countries":["Hong Kong","USA"],"languages":["English","Chinese"],"genres":["Action","Crime","Drama"],"plot":"REVENGE OF THE GREEN DRAGONS follows two immigrant brothers Sonny (Justin Chon) and Steven (Kevin Wu) who survive the impoverished despair of New York in the 1980s by joining Chinatown gang \"The Green Dragons\". The brothers quickly rise up the ranks, drawing the unwanted attention of hard-boiled city cops. After an ill- fated love affair pits Sonny against his own brother, he sets out for revenge on the very gang who made him who he is.","simplePlot":"Two best friends rise through the ranks of New York's Chinese underworld in the 1980s.","actors":[{"actorName":"Justin Chon","urlProfile":"http://www.imdb.com/name/nm2014390","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMzI0MTIwNV5BMl5BanBnXkFtZTcwMTIyMzIzMg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 May 1981","placeOfBirth":" Irvine, California, USA","birthName":"Justin Jitae Chon","height":"5' 5¾\" (1.67 m)","bio":"Justin Chon was born in Garden Grove, Orange County, California, and was raised in Irvine, California. He is the son of Kyung, a pianist, and Sang Chon, a former child actor. Justin is of Korean descent. His acting career started at 2005. He was in shows such as 'Jack & Bobby' and 'Taki & Luci'. He gained popularity in 2006 when he played Peter Wu in the Disney Channel film 'Wendy Wu: Homecoming Warrior'. He also played Tony Lee in the Nickelodeon sitcom 'Just Jordan'. Starting in 2008, he played Eric Yorkie in the film adaptations of the Twilight Saga. Chon's hobbies are surfing, skateboarding, snowboarding, playing the violin and guitar, and making comedic videos on YouTube with his friends.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMzI0MTIwNV5BMl5BanBnXkFtZTcwMTIyMzIzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2014390","name":"Justin Chon","idIMDB":"nm2014390"},"actorId":"nm2014390","character":"Sonny","urlCharacter":"http://www.imdb.com/character/ch0470428","main":true},{"actorName":"Kevin Wu","urlProfile":"http://www.imdb.com/name/nm3661913","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjA0OTYxMF5BMl5BanBnXkFtZTgwODEzNjQwMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 June 1990","placeOfBirth":" Houston, Texas, USA","height":"5' 11\" (1.8 m)","bio":"Kevin Wu was born on June 12, 1990 in Houston, Texas, USA. He is an actor and writer, known for Hang Loose (2012), Kev Jumba Dances with the Stars! (2012) and Man Up (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjA0OTYxMF5BMl5BanBnXkFtZTgwODEzNjQwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3661913","name":"Kevin Wu","idIMDB":"nm3661913"},"actorId":"nm3661913","character":"Steven","urlCharacter":"http://www.imdb.com/character/ch0470429","main":true},{"actorName":"Harry Shum Jr.","urlProfile":"http://www.imdb.com/name/nm1484270","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4ODM3OTY0NV5BMl5BanBnXkFtZTgwODk5MDY5MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1982","placeOfBirth":" Puerto Limón, Costa Rica","height":"5' 11\" (1.8 m)","bio":"Harry Shum Jr. was born on April 28, 1982 in Puerto Limón, Costa Rica. He is an actor, known for Glee (2009), Step Up 2: The Streets (2008) and Crouching Tiger, Hidden Dragon: Sword of Destiny (2016). He has been married to Shelby Rabara since November 22, 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4ODM3OTY0NV5BMl5BanBnXkFtZTgwODk5MDY5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1484270","name":"Harry Shum Jr.","nicknames":["Jyve"],"idIMDB":"nm1484270"},"actorId":"nm1484270","character":"Paul","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eugenia Yuan","urlProfile":"http://www.imdb.com/name/nm1067699","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY2NzM0MDE0Nl5BMl5BanBnXkFtZTgwMTAxMjg0MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Eugenia Yuen Lai-Kei","bio":"A Hong Kong Oscar winner and daughter of martial arts legend 'Pei-pei Cheng', Eugenia Yuan started out her career not as an actress, but as a champion rhythmic gymnast for the U.S. Olympic Team. Eventually, career switching from an athlete to on-screen ingénue, Eugenia made her screen debut co-starring with her mother in the martial arts picture _Flying Dragon, Leaping Tiger (2002). She caught the eye of movie executives on both sides of world who offered to groom to take inherit her mother's kung fu crown. Eugenia opted instead to co-star in the dark, low-budget feature Charlotte Sometimes which garnered an honor at the Independent Spirit Awards and was publicly championed by national film critic Roger Ebert and featured in his own film festival. Eugenia returned to Hong Kong to star in the feature collection of three dramatic shorts by heavy weight local directors entitled Three... Extremes where she nabbed the Hong Kong Film Award as \"Best Newcomer\" (Hong Kong's equivalent of the Academy Awards). Soon after, Hollywood director Doug Liman hand-picked her for the title role of the cult hit mockumentary Mail Order Wife (2004)), which brought her to national attention when she was named as a \"Rising Star/Screen Acting Discovery\" by the Hamptons International Film Festival where the film premiered. She was later nominated for Hong Kong's prestigious Golden Horse Award for her starring role in The Eye 2 (2004) and made memorable turns in John Dahl's The Great Raid (2005) and, most recently, the Oscar-winning Memoirs of a Geisha. Eugenia continues to shuttle back and forth between Los Angeles, New York, and Hong Kong to take Studio, Chinese-language and American independent roles alike including the 2007 Gotham Awards winning film Choking Man. She also co-stars with Hong Kong icon 'Tony Leung Ka Fai' in the Hong Kong thriller _Zhan. gu (2007). Most recently Eugenia has starred in the Martin Scorsese feature at the Toronto Film Festival, Revenge of the Green Dragons and is wrapping Crouching Tiger Hidden Dragon 2.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY2NzM0MDE0Nl5BMl5BanBnXkFtZTgwMTAxMjg0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1067699","name":"Eugenia Yuan","idIMDB":"nm1067699"},"actorId":"nm1067699","character":"Snakehead Mama","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leonard Wu","urlProfile":"http://www.imdb.com/name/nm1422236","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWU3MDliOTEtMzk3YS00NTZmLWE2MTItM2M5YWY4OTRmOTU5L2ltYWdlXkEyXkFqcGdeQXVyNjQ3NDE4NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"A native of Washington D.C., Leonard Wu graduated from UCLA with a BA in English. He currently lives in Los Angeles. He has appeared in many of television's highest rated dramas, including \"NCIS\" and \"Bones\" and several feature films including \"While She Was Out\" opposite Kim Basinger, and \"17 Again\". Leonard is currently working on the gritty feature based on the NY gang warfare of the 1990's, \"Revenge of the Green Dragons\", from acclaimed director Andrew Lau (\"Infernal Affairs\"). Leonard is also writing and producing his own projects and currently has several scripts in development.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWY3MmU1N2QtMmFlZi00ZDk2LTk3YzYtZGRjN2NhYzAyODIwXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1422236","name":"Leonard Wu","idIMDB":"nm1422236"},"actorId":"nm1422236","character":"Ah Chung","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jin Au-Yeung","urlProfile":"http://www.imdb.com/name/nm1265149","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU3MTYyMTM2NV5BMl5BanBnXkFtZTYwMzc3NTE3._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1982","placeOfBirth":" Miami, Florida, USA","birthName":"Jin Au-Yeung","height":"5' 6\" (1.68 m)","bio":"Jin Au-Yeung, aka MC Jin, was born and raised in North Miami Beach, Florida. Both his parents immigrated from Hong Kong to the United States with hopes of starting a family and providing their children with an opportunity to chase the American Dream. Little did they know, their firstborn would grow up to pursue a path that was not only less traveled but in this case, uncharted territory. There were no aspirations of becoming a doctor, lawyer or fireman for this little boy. He wanted to be a rap star. At a young age, Jin fell in love with rap music and Hip-hop culture. Emulating his favorite MC at the time, LL Cool J, Jin knew that his destiny involved having a mic in his hand. What this lead to was years of demo tapes, talent shows and managers with pipe dreams. In 2002, his big break came in the form of a nationally televised rap battle competition known as Freestyle Friday on BET's 106 and Park. Remaining undefeated for 7 consecutive weeks, Jin was inducted into the Hall of Fame and in grand fashion, announced that he had signed with Hip-hop powerhouse, Ruff Ryders, home to mega-stars such as DMX and Eve. The roller coaster ride begins here. From Rolling Stone Magazine to MTV's Artists to Watch, 20 year old Jin was touted as the next big thing to hit the music industry by storm. A young Asian-American battles his way to signing a high-profile record deal. The story was unique and one that the Hip-hop community had not yet seen. With a steadily growing fan base, Jin was able to do major touring across the country as well as overseas before any commercial release. With his profile at an all time high, Jin was casted as Jimmy the mechanic alongside Paul Walker and Tyrese Gibson in 2 Fast 2 Furious. The experience on set definitely left quite an impression on Jin but music was still his primary focus at the time. In 2006, Jin had parted ways with Ruff Ryders with both parties mutually feeling that it would be best to end on good terms. His debut album The Rest Is History released in 2004 went on to sell 250,000 copies worldwide. After releasing a few independent projects and staying on the road doing shows, 2008 brought about an interesting turn of events. Jin was presented with the opportunity to go to Hong Kong and release an all Cantonese Hip-hop album. What was expected to be a short stay to do promotions for the project ended up being a 4 year stint. In that time, he released a few more albums but more importantly, Hong Kong allowed Jin to blossom and realize his passion for acting. Gallants, which won Film Of The Year at the Hong Kong Film Awards was his first time on a film set since almost 6 years ago for 2 Fast 2 Furious. In it, he played a young and cocky martial artists who had more skills running his mouth than running his father's business. As well, Jin was casted as Unicorn Chan, childhood friend of Bruce Lee in the biopic Bruce Lee, My Brother which details the younger years of the legendary actor and martial artist. The opportunities were not only on the big screen as Jin was also casted prominently in 3 Hong Kong produced 30 episode TV series, as well as given hosting duties on different variety shows. This lead him to winning Most Improved Actor at the annual award show. In 2012, Jin started devoting more time to the stateside from both a personal and career perspective. A husband and a father now, his passion for music and performing has never been more intense, but with a new sense of focus. He was enthusiastic to be casted for the role Chan in The Rza's The Man With The Iron Fists as he saw it as another chance to further hone his craft. Next up for Jin is Andrew Lau's crime drama Revenge Of The Green Dragons, where he plays a detective who's trying to make his neighborhood a better place but finds that he's not quite accepted by the good or the bad guys.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU3MTYyMTM2NV5BMl5BanBnXkFtZTYwMzc3NTE3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1265149","name":"Jin Au-Yeung","nicknames":["Jin","MC Jin"],"idIMDB":"nm1265149"},"actorId":"nm1265149","character":"Detective Tang","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jon Kit Lee","urlProfile":"http://www.imdb.com/name/nm0497592","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzliMzMzNzItMmY4YS00ZTI1LTk3ZWItNWMxNmQzNWM1NDA0XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1967","placeOfBirth":" Hong Kong","height":"6' (1.83 m)","bio":"Jon Kit Lee was born on January 5, 1967 in Hong Kong. He is known for his work on Romeo Must Die (2000), The Corruptor (1999) and La revanche des Dragons Verts (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzliMzMzNzItMmY4YS00ZTI1LTk3ZWItNWMxNmQzNWM1NDA0XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0497592","name":"Jon Kit Lee","idIMDB":"nm0497592"},"actorId":"nm0497592","character":"Teddy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shuya Chang","urlProfile":"http://www.imdb.com/name/nm3822586","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NDE2ODkwMl5BMl5BanBnXkFtZTgwNjc2OTQ1NTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Shuya Chang is an actress and producer, known for Crouching Tiger, Hidden Dragon: Sword of Destiny (2016), La revanche des Dragons Verts (2014) and Casse-tête chinois (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NDE2ODkwMl5BMl5BanBnXkFtZTgwNjc2OTQ1NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3822586","name":"Shuya Chang","idIMDB":"nm3822586"},"actorId":"nm3822586","character":"Tina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alex Fox","urlProfile":"http://www.imdb.com/name/nm5969359","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3ODY1Mjk3OV5BMl5BanBnXkFtZTgwOTYyMzEzMDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 1\" (1.55 m)","bio":"Alex Fox is an actor, known for La revanche des Dragons Verts (2014), The Boy Under the Piano (2014) and Dreaming Against the World (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGQxN2VjZjMtOTAwNi00YTk0LTk2NGItZjM2ZDY2ZmU2ZTU1XkEyXkFqcGdeQXVyNDY4NDUzNjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5969359","name":"Alex Fox","idIMDB":"nm5969359"},"actorId":"nm5969359","character":"Little Sonny","urlCharacter":"http://www.imdb.com/character/ch0470428","main":true},{"actorName":"Michael Gregory Fung","urlProfile":"http://www.imdb.com/name/nm2759002","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWJlYTU5MmEtODJlZC00Y2RhLTk0MWItZWZiZTRkNDliYTZmL2ltYWdlXkEyXkFqcGdeQXVyMTY2MzcwNDc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Michael Gregory Fung is an actor, known for La revanche des Dragons Verts (2014), Caught (2013) and B.S.I (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDNmYzRiMmQtMDQ0OC00NjY0LTljZjMtNmM3MGUwZDkyMjBlXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2759002","name":"Michael Gregory Fung","idIMDB":"nm2759002"},"actorId":"nm2759002","character":"Little Steven","urlCharacter":"http://www.imdb.com/character/ch0470429","main":true},{"actorName":"Celia Au","urlProfile":"http://www.imdb.com/name/nm2541767","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWE0YzdkZTUtY2M1MS00ZTdlLThkZmQtMzFlMGQxMDY0OTYwXkEyXkFqcGdeQXVyMTM4MTAzMjM@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Celia Au is an actress and director, known for Detachment (2011), Demolition (2015) and People Places Things (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWE0YzdkZTUtY2M1MS00ZTdlLThkZmQtMzFlMGQxMDY0OTYwXkEyXkFqcGdeQXVyMTM4MTAzMjM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2541767","name":"Celia Au","idIMDB":"nm2541767"},"actorId":"nm2541767","character":"Bobo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ron Yuan","urlProfile":"http://www.imdb.com/name/nm0950620","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2NjE5MzkyOF5BMl5BanBnXkFtZTcwNDY4Mzg3OQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1973","placeOfBirth":" New York City, New York, USA","birthName":"Ronald Winston Yuan","bio":"Ron Yuan becomes new series regular on the hit Netflix/ The Weinstein Company's \"Marco Polo\" created by John Fusco. Yuan Will play Prince Nayan, a fiery eyed descendant of Genghis Khan. Nayan is a converted Christian that rules all of Manchuria and whose closely watched actions will affect Kublai's control of Asia. Yuan has been a force in front of and behind camera. Hollywood's secret weapon. Yuan is filming Roland Emmerich's Independence Day sequel (IDR) playing Yeong, the main weapons engineer. Before that, Yuan was on the \"The Accountant\" with Ben Affleck,JK Simmons and Anna Kendrick playing a reluctant Silat Master for \"Warrior\" director Gavin O'Connor. You can also see Yuan on Jon Bokenkamp's hit show \"The Blacklist\" as mysterious Blacklister Quon Zhang. Yuan was also seen in the final season of \"Sons of Anarchy\" as the intense and unpredictable Ryu Tom. Yuan cameos in Martin Scorsese's \"Revenge of the Green Dragons\" directed by Andrew Lau (Infernal Affairs) and Andrew Loo, playing the feared leader of the notorious BTK. Yuan played hard-nosed Lt. Peter Kang in the short lived CBS series \"Golden Boy\" from Nicholas Wootton and Greg Berlanti. Yuan also had recent cameo special guest appearances on\"Castle\" and \"Justified\". Yuan joins Francesca Eastwood and Annie Q in \"Cardinal X\" produced by Richard Bosner (Fruitvale Station) and Cassian Elwes in a semi- autobiographical film from first time director Angie Wang based on a college freshman in the 1980's who becomes an expert manufacturer and dealer of ecstasy. Yuan also played the iconic Japanese character Scorpion for Warner Bros' secret Mortal Kombat X \"Generations\" Yuan designed the fight sequences as well as going behind camera as Action Director for Steve Chasman/ Jason Statham's \"Wild Card\" scripted by William Goldman and directed by Simon West. Yuan just finished designing and directing the action on the popular Taiwanese/ Chinese/ International action franchise \"PiZi Ying Xiong 2\"(Black&White 2) shot all in Taiwan. In the past, Yuan was cast in a leading role on HBO pilot \"All Signs of Death\" opposite Ben Whishaw, directed by Alan Ball (True Blood). Yuan recently had character arcs on FOX's \"Touch\" opposite Keifer Sutherland created by Tim Kring (Heroes), NBC's \"Awake\" opposite Jason Issacs and FOX pilot \"Exit Strategy\" with Ethan Hawke directed by Antoine Fuqua (Training Day). Yuan also had memorable turns on hit series and films (Prison Break, CSI:NY, 24, Burn Notice, NCIS:LA, Pushing Daisies, Entourage, Art of War, Fast and Furious, Cradle 2 the Grave, Blood and Bone, Red Dawn) as well as being the voice behind major gaming campaigns (Call of Duty-Black Ops 2, Halo, Star War's Old Republic, Resident Evil, World of Warcraft, Medal of Honor, Army of Two, Guild Wars 2, Deus Ex, Drake's Uncharted, and many more). Yuan's MiniFlix Films with Sony Television (SPE) co-produced three edgy graphic novel stylized films(Three Bullets, Tea and Remembrance, Lollipops) in which Yuan wrote, produced and directed. Yuan's award winning work in short film and features has premiered in over 30 festivals worldwide (including Toronto, Sundance, Tribeca, Greece, Egypt, Beijing, Macao, Newport, Texas, Seattle, Kansas City, Los Angeles and Comic Con). In development are Yuan's \"Wind and Water\" \"Unspoken\" \"Cold\" and twisted post-apocalyptic martial arts western \"Forgotten 8\" in which the latter pairs Alex Tse(Watchmen) as producer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2NjE5MzkyOF5BMl5BanBnXkFtZTcwNDY4Mzg3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0950620","name":"Ron Yuan","idIMDB":"nm0950620"},"actorId":"nm0950620","character":"Born to Kill Dai Lo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Billy Magnussen","urlProfile":"http://www.imdb.com/name/nm2915105","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwNzc0MjMxN15BMl5BanBnXkFtZTgwMDM2NTY5NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1985","placeOfBirth":"","height":"5' 11\" (1.8 m)","bio":"Billy Magnussen was born on April 20, 1985. He is an actor, known for Bridge of Spies (2015), Into the Woods (2014) and The Big Short (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwNzc0MjMxN15BMl5BanBnXkFtZTgwMDM2NTY5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2915105","name":"Billy Magnussen","idIMDB":"nm2915105"},"actorId":"nm2915105","character":"Detective Boyer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Geoff Pierson","urlProfile":"http://www.imdb.com/name/nm0682762","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjU0MzE4NzMwNl5BMl5BanBnXkFtZTcwNTcxNjIyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1949","placeOfBirth":" Chicago, Illinois, USA","height":"6' 0½\" (1.84 m)","bio":"Pierson was born and raised in Chicago. After graduating from high school, he moved to New York to attend Fordham University. He earned a Bachelor's Degree and went on to the Yale School of Drama where, in 1980, he earned his masters. He began his career in summer stock outside of Chicago. In 1983, he landed the role of \"Frank Ryan\" on ABC's daytime drama Ryan's Hope (1975), a show he starred on for three years. He also appeared in several other daytime serials including Texas (1980), Another World (1964) and One Life to Live (1968). On prime-time TV, he has guest starred on such series as Grace Under Fire (1993), Party of Five (1994), New York Undercover (1994), Against the Law (1990), Kate & Allie (1984) and Law & Order (1990). His feature film credits include Two Bits (1995) with Al Pacino and he co-starred with Alan Arkin in Necessary Parties (1988) (TV)_ . Pierson has amassed extensive credits on stage, including the Broadway production of \"Tricks of the Trade\" in which he appeared with George C. Scott. His other stage work includes \"The Gamblers\" for the American Stage Company; \"Stringbean\" at the California Theatre; and \"Speed the Plow\" for the Philadelphis Theatre Company. Additional Productions include; \"Otherwise Engaged\", \"Glengarry Glen Ross\", \"American Buffalo\", \"Les Liasons Dangereuses\", all for the Virginia Stage Company, \"Measure for Measure\", \"Timon of Athens\", \"UbuRex\" and \"The Bundle\" at the Yale Repertory Theatre and \"A Streetcar Named Desire\" at the Pennsylvania Centre Stage. Pierson divides his time between Los Angeles and New York, where he lives.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjU0MzE4NzMwNl5BMl5BanBnXkFtZTcwNTcxNjIyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0682762","name":"Geoff Pierson","idIMDB":"nm0682762"},"actorId":"nm0682762","character":"FBI Director Sam Higgins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ray Liotta","urlProfile":"http://www.imdb.com/name/nm0000501","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzM5MjUwMF5BMl5BanBnXkFtZTYwNDM2NDky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1954","placeOfBirth":" Newark, New Jersey, USA","height":"6' (1.83 m)","bio":"Intense is the word for Ray Liotta. He specializes in psychopathic characters who hide behind a cultivated charm. Even in his nice guy roles in Field of Dreams (1989) and Operation Dumbo Drop (1995), you get the impression that something is smoldering inside of him. Liotta maintains a steady stream of work, completing multiple projects per year. Liotta was born in Newark, New Jersey, and was adopted by Mary (Edgar), a township clerk, and Alfred Liotta, an auto parts store owner. He studied acting at the University of Miami, where he became friends with Steven Bauer (Scarface (1983), Thief of Hearts (1984)). He spent his first years acting in TV: Another World (1964), a TV movie and several short-lived series. He broke into movies with the black comedy Something Wild (1986), which garnered him rave reviews. Originally unable to get a reading, he was recommended for the part by Melanie Griffith (then married to Bauer). After the success of \"Something Wild\" he received more offers in the \"psycho\" vein, but refused them to avoid being typecast. Instead, he made \"little movies\" like Dominick and Eugene (1988) (which earned him standing as an actor's actor) and Field of Dreams (1989) (whose success still surprises him). When he heard that Martin Scorsese was casting Goodfellas (1990), he lobbied hard for the part of Henry Hill. The film's huge success brought him wide popularity and enabled him to get star billing in future films (Article 99 (1992), Obsession fatale (1992), Unforgettable (1996)).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzM5MjUwMF5BMl5BanBnXkFtZTYwNDM2NDky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000501","name":"Ray Liotta","idIMDB":"nm0000501"},"actorId":"nm0000501","character":"Michael Bloom","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1396523","urlIMDB":"http://www.imdb.com/title/tt1396523","business":{"budget":{"money":"$5,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":[{"money":"6,270","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"09","month":"06","year":"2013","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 34 min (94 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.3","metascore":"36","filmingLocations":[{"location":"Brooklyn, New York, USA"}],"rated":"R","awards":[],"votes":"2,986","type":"Movie","companyCreditsSimple":[{"idCompany":"co0054820","name":"7th Floor, The"},{"idCompany":"co0188290","name":"Artfire Films"},{"idCompany":"co0313124","name":"IM Global Octane"}],"keywords":{"keywords":["new york","immigrant","chinatown","death","gangster","bare breasts","crying","screaming","female nudity","brief nudity","blood","torture","gambling","robbery","drugs","shot in head","smoking","shooting","stabbing","double cross","rape","tooth pulled out","finger cut off","new york city","murder","execution","american dream","color in title","animal in title","based on magazine article","twist ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:38:44"}}