{"data":{"movies":[{"title":"Khumba","originalTitle":"","year":"2013","releaseDate":"20140423","directors":[{"name":"Anthony Silverston","id":"nm1950075"}],"writers":[{"name":"Raffaella Delle Donne","id":"nm3567652"},{"name":"Anthony Silverston","id":"nm1950075"}],"runtime":"85 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTgzODU1N15BMl5BanBnXkFtZTgwMjg4NjQxMDE@._V1.jpg","countries":["South Africa"],"languages":["English"],"genres":["Animation","Adventure","Family"],"plot":"A half-striped zebra is born into an insular, isolated herd obsessed with stripes. Rumors that the strange foal is cursed spread and, before long, he is blamed for the drought that sets into the Great Karoo. When even his father, the leader of the herd, blames him for the lack of rain and the subsequent death of his mother, the outcast zebra leaves the confines of his home knowing that he cannot survive in the herd without all his stripes. Khumba ventures beyond the fence - vulnerable to the ferocious Leopard, Phango, who controls the waterholes and terrorizes the animals in the Great Karoo. Khumba is rescued from an opportunistic wild dog by a quirky duo: a wildebeest and an ostrich. Mama V is a self-confessed free spirit who does not want to be the average stay-at-home mom, like other wildebeest. Ironically, she mothers Bradley, a flamboyant but insecure ostrich who overcompensates for his scraggily feathers. When a mystical mantis appears to the foal, drawing a map to what could be...","simplePlot":"Rejected by his superstitious herd, a half-striped zebra embarks on a daring quest to earn his stripes but finds the courage and self-acceptance to save all the animals of the Great Karoo.","actors":[{"actorName":"Jake T. Austin","urlProfile":"http://www.imdb.com/name/nm1545471","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDMyMDI2NzQ3NF5BMl5BanBnXkFtZTcwMTQ4NDQ1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1994","placeOfBirth":" New York City, New York, USA","birthName":"Jake Toranzo Austin Szymanski","height":"5' 8\" (1.73 m)","bio":"He was born in New York, USA. His mother is Giny Rodriguez Toranzo and father is Joe Szymanski. His \"T\"-middle initial is taken from his mother's name 'Toranzo'. His younger sister, Ava, is his only sibling. His father has Polish, English, and Irish ancestry, and his mother is of Puerto Rican, Argentinian, and Spanish descent. Jake started acting at age of 7 in commercials. His first credited role was in a comedy sketch \"Kid 1698\". Jake starred in many animated movies, but he's mostly famous for his role as Max Russo in \"Wizards of Waverly place\"(2007-2012). He speaks English and Spanish fluently. Jake is living in L.A. but he often visits his family in New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDMyMDI2NzQ3NF5BMl5BanBnXkFtZTcwMTQ4NDQ1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1545471","name":"Jake T. Austin","nicknames":["Jakee"],"idIMDB":"nm1545471"},"actorId":"nm1545471","character":"Khumba","urlCharacter":"http://www.imdb.com/character/ch0390182","main":true},{"actorName":"Adrian Rhodes","urlProfile":"http://www.imdb.com/name/nm0722376","urlPhoto":"","biography":{"bio":"Adrian Rhodes is known for his work on Death at a Funeral (2007), Tomorrow Never Dies (1997) and Chicken Run (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0722376","name":"Adrian Rhodes","idIMDB":"nm0722376"},"actorId":"nm0722376","character":"Mantis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Riegel","urlProfile":"http://www.imdb.com/name/nm0726184","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2NjE0NzkwODNeQTJeQWpwZ15BbWU4MDMyNzc0NTgx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1976","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Samuel Brent Oscar Riegel","bio":"Sam Riegel was born on October 9, 1976 in Washington, District of Columbia, USA as Samuel Brent Oscar Riegel. He is known for his work on Teenage Mutant Ninja Turtles (2003), Khumba (2013) and The Amazing Spider-Man (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2NjE0NzkwODNeQTJeQWpwZ15BbWU4MDMyNzc0NTgx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0726184","name":"Sam Riegel","idIMDB":"nm0726184"},"actorId":"nm0726184","character":"Jock","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bryce Papenbrook","urlProfile":"http://www.imdb.com/name/nm0745310","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGE2MWNmYzAtNzllMy00NTk0LTk2ZjItYjcxNTE1OTNlNWJkXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1986","placeOfBirth":" West Hills, California, USA","birthName":"Bryce Austin Papenbrook","height":"5' 6\" (1.68 m)","bio":"Bryce Papenbrook was born on February 24, 1986 in West Hills, California, USA as Bryce Austin Papenbrook. He is an actor, known for Bravely Default: Flying Fairy (2012) (2012), Call of Duty: Ghosts (2013) (2013), Kirito in Sword Art Online (2012) (2014) and Eren Jaeger in Attack on Titan (2013) (2015). He is married to Samantha Papenbrook.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGE2MWNmYzAtNzllMy00NTk0LTk2ZjItYjcxNTE1OTNlNWJkXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0745310","name":"Bryce Papenbrook","idIMDB":"nm0745310"},"actorId":"nm0745310","character":"Zebra #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Devon Graye","urlProfile":"http://www.imdb.com/name/nm1984458","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MDA0MDA2MF5BMl5BanBnXkFtZTgwOTc1MzY1MjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 March 1987","placeOfBirth":" Mountain View, California, USA","birthName":"Devon Graye Fleming","bio":"Devon Graye was born on March 8, 1987 in Mountain View, California, USA as Devon Graye Fleming. He is an actor and writer, known for American Horror Story (2011), Dexter (2006) and 13 Sins (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MDA0MDA2MF5BMl5BanBnXkFtZTgwOTc1MzY1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1984458","name":"Devon Graye","idIMDB":"nm1984458"},"actorId":"nm1984458","character":"Zebra #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexander Polinsky","urlProfile":"http://www.imdb.com/name/nm0689168","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA2ODMwMzI4OV5BMl5BanBnXkFtZTgwNTU1MDg0ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 October 1974","placeOfBirth":" San Francisco, California, USA","bio":"Alexander Polinsky was born on October 7, 1974 in San Francisco, California, USA. He is an actor and producer, known for Charles in Charge (1984), Saints and Soldiers (2003) and Minions (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA2ODMwMzI4OV5BMl5BanBnXkFtZTgwNTU1MDg0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0689168","name":"Alexander Polinsky","idIMDB":"nm0689168"},"actorId":"nm0689168","character":"Nigel","urlCharacter":"http://www.imdb.com/character/ch0291803","main":true},{"actorName":"Jonny Rees","urlProfile":"http://www.imdb.com/name/nm0254862","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNjY1NDYzMV5BMl5BanBnXkFtZTgwMDc2MjE0OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 March 1968","placeOfBirth":" Wigan, Lancashire, England, UK","height":"6' (1.83 m)","bio":"Jonny Rees stars in the western \"Forsaken\" as \"Tom Watson\" alongside Demi Moore and Donald and Kiefer Sutherland in theaters next summer. On the big screen Jonny is best known for his portrayal of \"Lieutenant Commander Groves\" in the \"Pirates of the Caribbean\" movies as well as starring in J.J. Abrams \"Star Trek,\" as \"Chief Engineer Olsen,\" the original chief engineer of the Star ship Enterprise. In 20145 Jonny formed a production company '\"Monkey Toes.\" The shingle's first project was the Sky television drama \"Marked,\" produced, written and directed by Jonny and starring Kiefer Sutherland and Stephen Fry, to great critical acclaim. He is set to direct the Michael Douglas movie, \"Franklin Square\" in the new year. Jonny joined the cast of 'Hawaii Five-0' in season five to play Thomas Farrow in a major recurring arc, was a regular on the Fox drama \"Touch\" as \"Trevor Wilcox,\" and played the villainous \"Michael Amador\" opposite Kiefer Sutherland in the 3rd season of the hit series \"24.\" He also co-starred opposite Angelina Jolie in \"Beowulf,\" with Brad Pitt in \"Mr. and Mrs. Smith,\" and alongside Leonardo DiCaprio and Kate Winslet in 'Titanic.' He is the voice of MZingo in the new \"Lion King\" series \"The Lion Guard\" as well as the voice of Valen Rudor in the Disney animated series \"Star Wars Rebels.\" Jonny's television credits include: \"Dexter,\" \"The X-Files,\" \"The Riches,\" \"Bones,\" \"Alcatraz,\" \"Star Trek: Deep Space Nine,\" \"The Closer,\" \"CSI,\" \"Nip/Tuck,\" \"Perception,\" \"Knight Rider,\" and \"Trust Me\" to name a few. Voice-over work includes multiple characters on \"Tom and Jerry,\" \"Star Wars: The Clone Wars,\" \"Batman: The Brave & the Bold,\" \"Sophia the First,\" \"Star Versus the Forces of Evil,\" \"Tron: Uprising,\" \"The Mummy,\" \"What's New, Scooby-Doo?\", \"The Boondocks,\" \"Ben 10,\" \"Annoying Orange,\" \"Phineas and Ferb,\" \"Teen Titans,\" and the animated feature films \"Garfield 2\" as \"Nigel,\" and \"Cars 2,\" as \"Sir Nigel Gearsley.\" Jonny has over 170 video-game credits to his name including the iconic series of: \"Call of Duty,\" \"God of War,\" \"Diablo,\" \"Uncharted,\" \"Dragon Age,\" \"Star Trek,\" \"Cars,\" \"Lord of the Rings,\" \"X-Men,\" and \"Medal of Honor,\" to name a few. He is also the voice of Rocket Raccoon for the \"Guardians of the Galaxy\" video games and animated show. His West End theatre credits include the role of \"Rusty\" in the original cast of Sir Andrew Lloyd Webber's New \"Starlight Express,\" directed by Trevor Nunn; the alternate Chris in the original cast of \"Miss. Saigon,\" directed by Nicholas Hytner and the role of \"Fat Sam\" in \"Bugsy Malone,\" directed by Mickey Dolenz of Monkees fame. Jonny has performed for H.R.H Queen Elizabeth II at Saint Paul's Cathedral as well as 2 Royal Command Performances and his recordings can be heard extensively throughout Europe where he has achieved 3 Top 20 singles. Jonny's children are proudest of the fact that he is the voice of the Skylander's character \"Jet-Vac.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNjY1NDYzMV5BMl5BanBnXkFtZTgwMDc2MjE0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0254862","name":"Jonny Rees","idIMDB":"nm0254862"},"actorId":"nm0254862","character":"Thabo / Elder 1","urlCharacter":"http://www.imdb.com/character/ch0291806","main":true},{"actorName":"Laurence Fishburne","urlProfile":"http://www.imdb.com/name/nm0000401","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NjczNDc1MV5BMl5BanBnXkFtZTYwMDU0Mjg1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1961","placeOfBirth":" Augusta, Georgia, USA","birthName":"Laurence John Fishburne III","height":"6' 0½\" (1.84 m)","bio":"One of Hollywood's most talented and versatile performers and the recipient of a truckload of NAACP Image awards, Laurence John Fishburne III was born in Augusta, Georgia on July 30, 1961, to Hattie Bell (Crawford), a teacher, and Laurence John Fishburne, Jr., a juvenile corrections officer. His mother transplanted her family to Brooklyn after his parents divorced. At the age of 10, he appeared in his first play, \"In My Many Names and Days,\" at a cramped little theater space in Manhattan. He continued on but managed to avoid the trappings of a child star per se, considering himself more a working child actor at the time. Billing himself as Larry Fishburne during this early phase, he never studied or was trained in the technique of acting. In 1973, at the age of 12, Laurence won a recurring role on the daytime soap One Life to Live (1968) that lasted three seasons and subsequently made his film debut in the ghetto-themed Cornbread, Earl and Me (1975). At 14 Francis Ford Coppola cast him in Apocalypse Now (1979), which filmed for two years in the Phillippines. Laurence didn't work for another year and a half after that long episode. A graduate of Lincoln Square Academy, Coppola was impressed enough with Laurence to hire him again down the line with featured roles in Rumble Fish (1983), The Cotton Club (1984), and Gardens of Stone (1987). Throughout the 1980s, he continued to build up his film and TV credit list with featured roles despite little fanfare. A recurring role as Cowboy Curtis on the kiddie show Pee-wee's Playhouse (1986) helped him through whatever lean patches there were at the time. With the new decade (1990s) came out-and-out stardom for Laurence. A choice lead in John Singleton's urban tale Boyz n the Hood (1991) catapulted him immediately into the front of the film ranks. Set in LA's turbulent South Central area, his potent role as a morally minded divorced father who strives to rise above the ignorance and violence of his surroundings, Laurence showed true command and the ability to hold up any film. On stage, he would become invariably linked to playwright August Wilson and his 20th Century epic African-American experience after starring for two years as the eruptive ex-con in \"Two Training Running.\" For this powerful, mesmerizing performance, Laurence won nearly every prestigious theater award in the books (Tony, Outer Critics Circle, Drama Desk and Theatre World). It was around the time of this career hallmark that he began billing himself as \"Laurence\" instead of \"Larry.\" More awards and accolades came his way. In addition to an Emmy for the pilot episode of the series \"Tribeca,\" he was nominated for his fine work in the quality mini-movies The Tuskegee Airmen (1995) and Miss Evers' Boys (1997). On the larger screen, both Laurence and Angela Bassett were given Oscar nominations for their raw, seething portrayals of rock stars Ike and Tina Turner in the film What's Love Got to Do with It (1993). To his credit, he managed to take an extremely repellent character and make it a sobering and captivating experience. A pulp box-office favorite as well, he originated the role of Morpheus, Keanu Reeves' mentor, in the exceedingly popular futuristic sci-fi The Matrix (1999), best known for its ground-breaking special effects. He wisely returned for its back-to-back sequels. Into the millennium, Laurence extended his talents by making his screenwriting and directorial debut in Once in the Life (2000), in which he also starred. The film is based on his own critically acclaimed play \"Riff Raff,\" which he staged five years earlier. In 1999, he scored a major theater triumph with a multi-racial version of \"The Lion in Winter\" as Henry II opposite Stockard Channing's Eleanor of Acquitaine. On film, Fishburne has appeared in a variety of interesting roles in not-always-successful films. Never less than compelling, a few of his more notable parts include an urban speed chess player in Searching for Bobby Fischer (1993); a military prisoner in Cadence (1990); a college professor in Singleton's Higher Learning (1995); a CIA operative in Bad Company (1995); the title role in Othello (1995) (he was the first black actor to play the part on film); a spaceship rescue team leader in the sci-fi horror Event Horizon (1997); a Depression-era gangster in Hoodlum (1997); a dogged police sergeant in Clint Eastwood's Mystic River (2003); a spelling bee coach in Akeelah and the Bee (2006); and prominent roles in the mainstream films Predators (2010) and Contagion (2011). He returned occasionally to the theatre. In April 2008, he played Thurgood Marshall in the one-man show \"Thurgood\" and won a Drama Desk Award. It was later transferred to the screen. In the fall of 2008, Fishburne replaced William Petersen as the male lead investigator on the popular CBS drama CSI: Crime Scene Investigation (2000), but left the show in 2011 to refocus on films and was in turn replaced by Ted Danson. Since then Fishburne has appeared in the Superman film Man of Steel (2013) as Daily Planet chief Perry White. Fishburne has two children, Langston and Montana, from his first marriage to actress Hajna O. Moss. In September 2002, Fishburne married Cuban-American actress Gina Torres.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NjczNDc1MV5BMl5BanBnXkFtZTYwMDU0Mjg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000401","name":"Laurence Fishburne","nicknames":["Fish","Larry"],"idIMDB":"nm0000401"},"actorId":"nm0000401","character":"Seko","urlCharacter":"http://www.imdb.com/character/ch0291791","main":true},{"actorName":"Joey Richter","urlProfile":"http://www.imdb.com/name/nm4013413","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWZkYzE2NWMtYTI4Ny00NDcwLTg2ZTItNzQwN2M4NzdhYWZiXkEyXkFqcGdeQXVyNTI1NzU3NjY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1989","placeOfBirth":" Michigan, USA","birthName":"Joseph Michael Richter","height":"6' 2\" (1.88 m)","bio":"Joseph Michael \"Joey\" Richter is an actor, singer, and internet personality. Born in Laguna Niguel, he grew up in Southern California. Joey attended the University of Michigan and received a BFA in Theater Performance with a Minor in Global Media Studies. He is most likely known for his portrayal of Ron Weasley in Starkid's theatrical production \"A Very Potter Musical\", \"A Very Potter Sequel\", and \"A Very Potter Senior Year\". He has also appeared in the Starkid productions of \"Starship\" and \"Me and My Dick\" as Bug and Joey Richter, respectively. Joey has been a principal performer and vocalist on both of Starkid's National Concert Tours, The S.P.A.C.E. Tour (2011) and The Apocalyptour (2012). Joey resides in Los Angeles and is pursuing a career in film, television, and voice over. He can most recently be heard in South Africa's Triggerfish Animation's second feature film, Khumba, as the bullying zebra Themba alongside AnnaSophia Robb, Laurence Fishburne, Steve Buscemi, and Liam Neeson. He can also be seen on the Disney Channel show, Jessie, as Officer Petey. Joey is also a writer, actor, director, and editor for his Youtube sketch group, The Tin Can Brothers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWZkYzE2NWMtYTI4Ny00NDcwLTg2ZTItNzQwN2M4NzdhYWZiXkEyXkFqcGdeQXVyNTI1NzU3NjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4013413","name":"Joey Richter","nicknames":["Joey Richter"],"idIMDB":"nm4013413"},"actorId":"nm4013413","character":"Themba","urlCharacter":"http://www.imdb.com/character/ch0291804","main":true},{"actorName":"Anika Noni Rose","urlProfile":"http://www.imdb.com/name/nm0741242","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ4MzQyODI4Nl5BMl5BanBnXkFtZTgwMDk0ODgyMTI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1972","placeOfBirth":" Bloomfield, Connecticut, USA","height":"5' 2\" (1.57 m)","bio":"Anika Noni Rose followed her work in the feature film \"Dreamgirls\" with a role in the comedy feature \"Just Add Water,\" in which she co-stars with Danny DeVito, Dylan Walsh, Jonah Hill and Justin Long, under the direction of Hart Bochner. In 2004, Rose was honored with a Tony Award for Best Performance by a Featured Actress in a Musical for her role in the widely acclaimed Broadway show \"Caroline, or Change.\" In addition, Rose won a Lucille Lortell Award, a Theatre World Award, and a Clarence Derwent Award, and was nominated for a Drama Desk Award for her work in the musical. Rose also reprised her role in the San Francisco and Los Angeles productions of \"Caroline, or Change.\" For her performance in the latter, she won the Los Angeles Critic's Circle Award and an Ovation Award. Classically trained in drama at San Francisco's American Conservatory Theater, Rose moved to New York City to pursue her career, with great hopes of appearing on Broadway. Her goal was first realized when she replaced another actor for the last few months of the Broadway run of \"Footloose.\" Her impressive theatre repertoire also includes \"Eli's Comin',\" for which she received an Obie Award; the role of Lutiebelle in the Encores! Production of \"Purlie\"; and \"Threepenny Opera\" and \"Tartuffe\" at A.C.T's Geary Theater. In addition, Rose received a Drama-Logue Ensemble Award for her role in \"Insurrection: Holding History,\" and won a Garland/Drama-Logue Award for \"Valley Song\" at the Berkeley Repertory Theatre. In the midst of all of this, Rose was a featured vocalist at the Vatican in Leonard Bernstein's \"Mass.\" It was during this time that she also work shopped Tony Kushner and Jeanine Tesori's \"Caroline, or Change,\" directed by the legendary George C. Wolfe. In 2003, the musical opened at New York's Public Theater, with Rose creating the role of Emmie Thibodeaux. In May 2004, \"Caroline, or Change\" moved to Broadway, taking Rose with it. In addition to her stage work, Rose has appeared on television in guest roles on such series as \"Third Watch\" and \"Hack.\" She also had a lead role in the film \"From Justin to Kelly.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ4MzQyODI4Nl5BMl5BanBnXkFtZTgwMDk0ODgyMTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0741242","name":"Anika Noni Rose","idIMDB":"nm0741242"},"actorId":"nm0741242","character":"Lungisa","urlCharacter":"http://www.imdb.com/character/ch0466725","main":true},{"actorName":"Hope Levy","urlProfile":"http://www.imdb.com/name/nm0506439","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MTQwNjIxNV5BMl5BanBnXkFtZTgwOTkwMjMxMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 September 1966","placeOfBirth":" Los Angeles, California, USA","birthName":"Hope Diane Levy","bio":"Hope recorded her best selling 45 \"Hope and her Friends\" at age seven. She was the host of the Bay Area TV show \"Just Kidding\" for Kron Channel 4. She was in the West Coast premiere of Les Miserables, (as \"Eponine\") and has performed at the Hollywood Bowl in both \"Showboat\" and \"Music Man\". She originated the role of Mary Bland in the West Coast premiere of Eating Raoul, The Musical, directed by Scott Wittman. She can be heard singing \"Welcome to Duloc\" in Shrek.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MTQwNjIxNV5BMl5BanBnXkFtZTgwOTkwMjMxMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0506439","name":"Hope Levy","idIMDB":"nm0506439"},"actorId":"nm0506439","character":"Cheerleader Zebra #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kat Cressida","urlProfile":"http://www.imdb.com/name/nm0187570","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2OTc2MTA3NTVeQTJeQWpwZ15BbWU3MDgxNTY3MjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 March 1968","placeOfBirth":" Long Beach, California, USA","bio":"Kat Cressida was born on March 1, 1968 in Long Beach, California, USA. She is known for her work on Tarzan (1999), Dexter's Laboratory (1996) and Le royaume des chats (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2OTc2MTA3NTVeQTJeQWpwZ15BbWU3MDgxNTY3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0187570","name":"Kat Cressida","idIMDB":"nm0187570"},"actorId":"nm0187570","character":"Cheerleader Zebra #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephanie Sheh","urlProfile":"http://www.imdb.com/name/nm1315809","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2NjU1NjA0MF5BMl5BanBnXkFtZTgwNjM1MjU0MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1977","placeOfBirth":" Kalamazoo, Michigan, USA","birthName":"Stephanie Ru-Phan Sheh","height":"4' 9\" (1.45 m)","bio":"Stephanie Sheh was born on April 10, 1977 in Kalamazoo, Michigan, USA as Stephanie Ru-Phan Sheh. She is known for her work on Bleach (2004), K-On! The Movie (2011) and Naruto: Shippûden (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2NjU1NjA0MF5BMl5BanBnXkFtZTgwNjM1MjU0MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1315809","name":"Stephanie Sheh","idIMDB":"nm1315809"},"actorId":"nm1315809","character":"Cheerleader Zebra #3","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ben Vereen","urlProfile":"http://www.imdb.com/name/nm0893965","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NjMwNzA5MF5BMl5BanBnXkFtZTYwNTI0Mjky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1946","placeOfBirth":" Dade County, Florida, USA","birthName":"Benjamin Augustus Middleton","height":"5' 8\" (1.73 m)","bio":"Few entertainers today are as accomplished or versatile as Ben Vereen. His legendary performances transcend time and have been woven into the fabric of this country's artistic legacy. His first love and passion is and always will be the stage. \"The theater was my first training ground. It taught me discipline, dedication and appreciation of hard work and values that will stay with me a lifetime. The stage sharpens the creative instrument and encourages you to go deeper inside and try new things,\" states Ben. On Broadway, Ben Vereen has appeared in Wicked, Fosse, I'm Not Rappaport, Hair, Jesus Christ Superstar, Pippin,Grind, Jelly's Last Jam and A Christmas Carol. His role in Pippin garnered him both the prestigious Tony Award and the Drama Desk Award for \"Best Actor in a Musical.\" For over 40 years, Ben has showcased his versatility and creativity, performing countless one-man shows not only in the United States, but also Europe, Asia and the Caribbean. He was the first simultaneous winner of the \"Entertainer of the Year,\" \"Rising Star,\" and \"Song and Dance Star\" awards from the American Guild of Variety Artists (AGVA). He also earned a coveted spot in the Casino Legends Hall of Fame. Ben and his band are currently touring his one man shows, \"Ben Sings a Tribute to Sammy Davis Jr. featuring the music of Sammy Davis Jr.\" and \"Brooklyn to Broadway\" at top performing arts centres. He also performs with symphonies around the country. While performing worldwide, Ben's acting credits continue to give us memorable roles that stand the test of time such as the unforgettable Chicken George in Roots and Louis Armstrong in Louis Armstrong - Chicago Style.Ben's television guest appearances include How I Met Your Mother, Grey's Anatomy, for which he won the Prism Award, House of Payne, Law and Order: Criminal Intent, OZ, Touched By An Angel, Second Noah, New York Undercover, The Nanny, Star Trek - The Next Generation, The Jamie Fox Show, The Promised Land, and Fresh Prince of Bel-Air as well as recurring roles on Silk Stalkings, Webster, J.J. Starbuck and Booker. For Nickelodeon, Ben provided voice-overs on the show Wonder Pets! Additional credits include: Anne Rice's Feast of All Saints(Showtime), Intruders They Are Among Us (Emmy nomination), Zoobilee Zoo, Faerie Tale Theatre's Puss N' Bootswith Gregory Hines, The Jesse Owens Story, Ellis Island (Golden Globe Nomination), Lost in London, and Salute to Liberty Special. His own network television shows are Ben Vereen: His Roots (Seven Emmy Awards), Tenspeed and Brownshoe and You Write the Songs. In the early 90's, he released a number of well-received children's Sing-Along musical videos. Ben was nominated for an NAACP Image Award for his performance in the Hallmark movie An Accidental Friendship. He appears in two soon to be released features, 21 and a Wake-Up starring Faye Dunaway andMama, I Want to Sing! in which Ben co-starred opposite Ciara and Patti LaBelle. While filming Idlewild with the award winning group Outkast, Ben also served as the acting coach for both Andre 3000 and Big Boy. In addition, Ben has been coaching the singing sensation Usher both as an entertainer and an actor. Ben was featured in the movie, On The One - Preaching to the Choir directed by Charles Randolph-Wright. Other film credits include Sweet Charity, All That Jazz, Funny Lady (Golden Globe nomination), Why Do Fools Fall in Love,And Then Came Love starring Vanessa Williams, the animated movie Once Upon a Forest, Christmas in Washingtonand The Painting which premiered at the Cannes Film Festival. In 2004, Ben was nominated for a \"Career Achievement Award\" by the Le Prix International Film Star Awards Organization. The lecture circuit has become an integral part of Ben's career, as he has become one of the Nations' most requested speakers among audiences of all ages. His strong sense of social consciousness has enabled him to reach out to his audiences and convey to them a deep feeling of understanding. His topics range from overcoming adversity, arts in education, Black history, motivational topics, recovery through physical and occupational therapy and the importance of continuing education - to name a few. Ben's gift of time has benefited many organizations. He has served on Ballet Florida's Board of Directors, the American Red Cross and Sudden Infant Death Syndrome Association. In addition, he has served as chairman of several renowned organizations including the American Heart Association and the Sudden Infant Death Syndrome Association. In 1989, he spearheaded his own organization, \"Celebrities for a Drug Free America,\" which raised more than $300,000 for drug rehabilitation centres, educational programs and inner city community-based projects. The Community Mental Health Council awarded Ben with their 2004 Lifeline Celebration Achievement Award. For his humanitarian contributions, he has received a number of awards including Israel's Cultural and Humanitarian Awards, three NAACP Image Awards, an Eleanor Roosevelt Humanitarian Award and a Victory Award. He has received honorary doctorates from the University of Arizona, Emerson College, St. Francis College, and Columbia College in Chicago. In 2001, Medgar Evers College created the Ben Vereen Scholarship for the Performing Arts, and in 2004, he received an Achievement in Excellence Award from his alma mater, the High School of the Performing Arts. Ben celebrated Eartha Kitt's 80th birthday in concert at Carnegie Hall to multiple standing ovations and in front of the Armed Forces for those men and women who have served in Iraq, truly a major highlight of his career. In 2009, he performed at the Inaugural Ball and entertained at the reopening of the Ford Theatre in Washington, D.C., which was attended by President Obama. Last year Ben entertained at the Friar's Club gala honouring CBS president Leslie Moonves. Ben is leading an ongoing diabetes awareness campaign called \"S.T.A.N.D.\" in partnership with sanofi-aventis pharmaceuticals. Ben recently starred in the world premier of Fetch Clay, Make Man directed by Des McAnuff (Jersey Boys) at the McCarter Theatre. Below are some of Ben's reviews from the show: \"A seething resentment can be sensed underneath the wary cool with which Fetchit negotiates with Fox. In brief snippets from the routines that made Fetchit famous (and infamous), Mr. Vereen also reveals the glowing pride of an entertainer whose gifts sometimes managed to transcend the offensive uses to which they were put.\" -New York Times \"The dramatic center is Ben Vereen's role as Lincoln Perry,the vaudeville performer who made his fortune in silent films and Depression-era talkies playing screen persona Stepin Fetchit, the quintessential negative stereotype of the shuffling, smiling, work-shirking Negro...Tapping all the undiminished charisma and limber body language of a veteran song-and-dance man, Vereen effortlessly sells the now-reviled representation of the black flunky while slyly asserting the cultured, savvy negotiator beneath; it's a performance of enormous charm and intelligence.\" -Variety \"As Fetchit, Ben Vereen creates a man who comports himself with dignity in hopes of negating all that he did before. In one scene, after Fetchit has been forced to acknowledge what he'd been, Vereen blinks three times, and actually manages to make a statement with each blink: The first acknowledges the charge, the second shows his pain at being reminded, and the third hopes to push away the memory.\" -The Star-Ledger Additionally, Ben has a recurring role on the CBS comedy How I Met Your Mother, playing Wayne Brady's father. In February of 2011, he released his CD Steppin' Out Live with Ben Vereen and staged a triumphant return to Broadway with his concert \"BEN VEREEN ON BROADWAY AT TOWN HALL\" . One review from Ben's show is featured below: \"Ben Vereen's performance at The Town Hall on February 18th was a lesson in performance energy.....a tour de force ....Without a single synthesizer, with no voice tuner, with only an acoustic band, Vereen displayed shocking innovation.\".....\" He flirted with off notes and inventive runs during classics such as \"My Funny Valentine.\" This is always a dangerous idea, because it risks alientating the audience who wants to hear the melody of a familiar tune, but Vereen not only pulled it off, he left the audience wanting him to do more...The lasting impression was of a man who loves life, wants you to love life, and has mastered both his medium and his message. At age 65, he is the youngest man performing today. - The Newark Examiner Ben remains the consummate actor, singer, and all around entertainer with a storied and legendary career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NjMwNzA5MF5BMl5BanBnXkFtZTYwNTI0Mjky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0893965","name":"Ben Vereen","idIMDB":"nm0893965"},"actorId":"nm0893965","character":"Mkhulu","urlCharacter":"http://www.imdb.com/character/ch0291796","main":true},{"actorName":"Jennifer Cody","urlProfile":"http://www.imdb.com/name/nm2278607","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMDgwNDE1Nl5BMl5BanBnXkFtZTgwNjMyNDc5ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1969","placeOfBirth":" Henrietta, New York, USA","height":"5' (1.52 m)","bio":"Jennifer Cody was born on November 10, 1969 in Henrietta, New York, USA. She is an actress, known for The Princess and the Frog (2009) and Blue Bloods (2010). She has been married to Hunter Foster since 1998.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMDgwNDE1Nl5BMl5BanBnXkFtZTgwNjMyNDc5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2278607","name":"Jennifer Cody","idIMDB":"nm2278607"},"actorId":"nm2278607","character":"Fifi","urlCharacter":"http://www.imdb.com/character/ch0291782","main":true}],"seasons":[],"idIMDB":"tt1487931","urlIMDB":"http://www.imdb.com/title/tt1487931","business":{"budget":{"money":"$20,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$1,029","country":"USA","day":"06","month":"12","year":"2013","remarks":"2 Screens"},{"money":"HUF 19,448,972","country":"Hungary","day":"10","month":"11","year":"2013","remarks":""}],"gross":[{"money":"$1,029","country":"USA","day":"15","month":"08","year":"2016","remarks":""},{"money":"$27,187,375","country":"worldwide","day":"15","month":"08","year":"2016","remarks":""},{"money":"$357,108","country":"Portugal","day":"15","month":"08","year":"2016","remarks":""},{"money":"€182,135","country":"Portugal","day":"01","month":"01","year":"2014","remarks":""},{"money":"€158,505","country":"Portugal","day":"25","month":"12","year":"2013","remarks":""},{"money":"€125,479","country":"Portugal","day":"18","month":"12","year":"2013","remarks":""},{"money":"€54,858","country":"Portugal","day":"11","month":"12","year":"2013","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/2014/\">2014</a>"},{"money":"39,700","country":"Portugal","day":"01","month":"01","year":"2014","remarks":""},{"money":"34,828","country":"Portugal","day":"25","month":"12","year":"2013","remarks":""},{"money":"27,173","country":"Portugal","day":"18","month":"12","year":"2013","remarks":""},{"money":"10,424","country":"Portugal","day":"11","month":"12","year":"2013","remarks":""}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 25 min (85 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":["Digital (Digital Cinema Package DCP)"]},"rating":"5.8","metascore":"40","filmingLocations":[{"location":"Cape Town, Western Cape, South Africa"}],"rated":"NOT RATED","awards":[{"award":"Annecy International Animated Film Festival 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Cristal","categories":[{"category":"Best Feature","names":[{"name":"Anthony Silverston","id":"nm1950075","role":null}]}]}]},{"award":"Behind the Voice Actors Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated BTVA Special/DVD Voice Acting Award","categories":[{"category":"Best Male Vocal Performance in a TV Special/Direct-to-DVD Title or Theatrical Short","names":[{"name":"Liam Neeson","id":"nm0000553","role":null}]},{"category":"Best Male Vocal Performance in a TV Special/Direct-to-DVD Title or Theatrical Short","names":[{"name":"Steve Buscemi","id":"nm0000114","role":null}]}]}]}],"votes":"4,302","type":"Movie","companyCreditsSimple":[{"idCompany":"co0280692","name":"Triggerfish Animation"}],"keywords":{"keywords":["herd","zebra","waterhole","ostrich","wildebeest","leopard","survival","sheep","rock rabbit","rabbit","national park","mantis","dog","drought","self acceptance","courage","antelope","superstition","one word title","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:49:19"}}