{"data":{"movies":[{"title":"Killer Elite","originalTitle":"","year":"2011","releaseDate":"20110923","directors":[{"name":"Gary McKendry","id":"nm1834213"}],"writers":[{"name":"Matt Sherring","id":"nm3906411"},{"name":"Ranulph Fiennes","id":"nm0276399"}],"runtime":"116 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDAxMjAzNV5BMl5BanBnXkFtZTcwNTY3ODg3NQ@@._V1.jpg","countries":["UK","Australia"],"languages":["English","Arabic","French","Spanish"],"genres":["Action","Crime","Thriller"],"plot":"Loosely based on a true story, Killer Elite pits two of the worlds' most elite operatives - Danny, a ruthless killer-for-hire () and Hunter, his longtime mentor () - against the cunning leader of a secret society of former Special Air Service operatives('Clive Owen'). Covering the globe from Australia to Paris, London and the Middle East, Danny and Hunter are plunged into a highly dangerous game of revenge and deception - where things are not always what they appear to be.","simplePlot":"When his mentor is taken captive by a disgraced Arab sheik, a killer-for-hire is forced into action. His mission: kill three members of Britain's elite Special Air Service responsible for the death of his sons.","actors":[{"actorName":"Jason Statham","urlProfile":"http://www.imdb.com/name/nm0005458","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMzk2MDkwOV5BMl5BanBnXkFtZTcwMDAxODQwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1967","placeOfBirth":" Shirebrook, Derbyshire, England, UK","height":"5' 10\" (1.78 m)","bio":"Jason Statham was born in Shirebrook, Derbyshire, to Eileen (Yates), a dancer, and Barry Statham, a street merchant and lounge singer. Statham has done quite a lot in a short time. He has been a Diver on the British National Diving Team and finished 12th in the World Championships in 1992. He has also been a fashion model, black market salesman and finally of course, actor. He got the audition for his debut role as Bacon in Lock, Stock and Two Smoking Barrels (1998) through French Connection, for whom he was modeling. They became a major investor in the film and introduced Jason to Guy Ritchie, who invited him to audition for a part in the film by challenging him to impersonate an illegal street vendor and convince him to purchase fake jewelery. Jason must have been doing something right because after the success of Lock, Stock and Two Smoking Barrels (1998) he teamed up again with Guy Ritchie for Snatch (2000), with co-stars including Brad Pitt, Dennis Farina and Benicio Del Toro. After Snatch (2000) came Turn It Up (2000) with US music star Ja Rule, followed by a supporting actor role in the Sci-Fi film Ghosts of Mars (2001), Jet Li's The One (2001) and another screen partnership with Vinnie Jones in Mean Machine (2001) under Guy Ritchie's and Matthew Vaughn's SKA Films. Finally in 2002 he was cast as the lead role of Frank Martin in Le transporteur (2002). Jason is also in the summer 2003 blockbuster remake of The Italian Job (1969), The Italian Job (2003), playing Handsome Rob.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMzk2MDkwOV5BMl5BanBnXkFtZTcwMDAxODQwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005458","name":"Jason Statham","nicknames":["Jay","The Stath"],"idIMDB":"nm0005458"},"actorId":"nm0005458","character":"Danny","urlCharacter":"http://www.imdb.com/character/ch0264568","main":true},{"actorName":"Clive Owen","urlProfile":"http://www.imdb.com/name/nm0654110","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MzAyOTc5Ml5BMl5BanBnXkFtZTcwOTQ5NzEzMg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1964","placeOfBirth":" Keresley, Coventry, Warwickshire, England, UK","height":"6' 2\" (1.88 m)","bio":"British actor Clive Owen is one of a handful of stars who, though he is best known for his art house films, can handle more mainstream films with equal measures of grace and skill. Owen is typically cast as characters whose primary traits are a balance of physical strength, intellect, conflicting soul but forceful will. He is best known to film audiences for his work in Children of Men (2006), Closer (2004) and his breakout part in Croupier (1998). He recently portrayed Ernest Hemingway in the HBO made-for-TV movie Hemingway & Gellhorn (2012). Born in Coventry, in England's West Midlands county, on 3 October 1964, Owen is the fourth of five brothers. He is the son of Pamela (Cotton) and Jess Owen, a country and western singer. His father abandoned the family when he was three years old, and Owen was subsequently raised by his mother and stepfather. He attended Binley Park Comprehensive School and joined the youth theater at 13 after playing the scene-stealing role of the Artful Dodger in a production of \"Oliver!\" Acting was not his first choice as a profession, but he changed his mind and went on to graduate from the Royal Academy of Dramatic Art in 1987. Owen proceeded to join the Young Vic Theatre Company, where he honed his craft while performing in a number of Shakespearean productions. Clive made his film debut in the British-made Vroom (1988) co-starring with David Thewlis as two fellows who restore a classic American car and take off on the road. Within two years, Clive became a full-fledged TV star playing devilish rogue Stephen Crane in Chancer (1990). However, the now-sought-after Clive abandoned the star-making part at the height of the show's popularity because of unwanted invasion of privacy and his fear of typecasting. His next project raised more than a few eyebrows when he filmed Close My Eyes (1991) in which he played a brother who acts on his incestuous desires for his older sister. Clive's reputation as a lovable shyster was completely shattered and he lost profitable commercial endorsements following the film's release. Offers fell off for the next two years as a result. But the persistent Clive carried on with stage work, including the role of a bisexual in a production of Noël Coward's \"Design For Living.\" He returned to TV at that time as well and played a number of roles in both mini-movies and series. In 1997, Clive had a huge hit on the London stage with \"Closer,\" a cynical, contemporary ensemble piece about relationships. Controversy surrounded him again in the film role of Max in Bent (1997) playing a brash, reckless homosexual lothario in decadent pre-war Germany who finds unconditional love while interned in a Nazi war camp. His biggest film break, however, was in Mike Hodges' Croupier (1998), as a struggling writer-turned-casino employee who gets in over his head with a femme fatale scam artist. English audiences stayed away in droves but the U.S. embraced the film and Hollywood took notice of Clive, who was virtually unknown outside of England. Despite playing detective Ross Tanner in a series of successful \"Second Sight\" mini-movies and finding critical acclaim on stage with \"The Day in the Death of Joe Egg\" in 2001, Clive has focused primarily on film, including the offbeat Brit romantic comedy Greenfingers (2000), the classy and popular Robert Altman film Gosford Park (2001), the Matt Damon star-vehicle The Bourne Identity (2002), and the title role in King Arthur (2004). He has since reached the top rungs of the Hollywood ladder with the film version of his stage smash Closer (2004), in which he received an Academy Award nomination and won the BAFTA award for \"Supporting Actor\"; opposite Denzel Washington in Inside Man (2006); and alongside Julianne Moore and Michael Caine in Children of Men (2006). Upcoming is his portrayal of Sir Walter Raleigh opposite Cate Blanchett's Elizabeth I in the film Elizabeth: The Golden Age (2007). Owen is married to Sarah-Jane Fenton, who played Juliet to his Romeo at the Young Vic in 1998. The couple has two daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MzAyOTc5Ml5BMl5BanBnXkFtZTcwOTQ5NzEzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0654110","name":"Clive Owen","idIMDB":"nm0654110"},"actorId":"nm0654110","character":"Spike","urlCharacter":"http://www.imdb.com/character/ch0251940","main":true},{"actorName":"Robert De Niro","urlProfile":"http://www.imdb.com/name/nm0000134","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNDU3MzcyOV5BMl5BanBnXkFtZTcwMjc0MTIxMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1943","placeOfBirth":" New York City, New York, USA","birthName":"Robert Anthony De Niro Jr.","height":"5' 9¾\" (1.77 m)","bio":"Robert De Niro, thought of as one of the greatest actors of all time, was born in Greenwich Village, Manhattan, New York City, to artists Virginia (Admiral) and Robert De Niro Sr. His paternal grandfather was of Italian descent, and his other ancestry is Irish, German, Dutch, English, and French. He was trained at the Stella Adler Conservatory and the American Workshop. He first gained fame for his role in Bang the Drum Slowly (1973), but he gained his reputation as a volatile actor in Mean Streets (1973), which was his first film with director Martin Scorsese. In 1974 De Niro received an Academy Award for best supporting actor for his role in The Godfather: Part II (1974) and received Academy Award nominations for best actor in Taxi Driver (1976), The Deer Hunter (1978), and Cape Fear (1991). He won the best actor award in 1980 for Raging Bull (1980). De Niro heads his own production company, Tribeca Film Center, and made his directorial debut in 1993 with A Bronx Tale (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNDU3MzcyOV5BMl5BanBnXkFtZTcwMjc0MTIxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000134","name":"Robert De Niro","nicknames":["Bobby Milk","Kid Monroe","Bob","Bobby D"],"idIMDB":"nm0000134"},"actorId":"nm0000134","character":"Hunter","urlCharacter":"http://www.imdb.com/character/ch0251939","main":true},{"actorName":"Dominic Purcell","urlProfile":"http://www.imdb.com/name/nm0700712","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1ODM3NTIxM15BMl5BanBnXkFtZTcwMzYyODY4MQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1970","placeOfBirth":" Wallasey, Merseyside, England, UK","birthName":"Dominic Haakon Myrtvedt Purcell","height":"6' 2\" (1.88 m)","bio":"Born in England but raised in Australia by his Norwegian father and Irish mother, Purcell was a bored landscaper who decided to attend a drama school. He became a TV star in Australia before debuting in America as the title character in John Doe (2002). In 2000, he won the Green Card lottery and now lives in Los Angeles with his family.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1ODM3NTIxM15BMl5BanBnXkFtZTcwMzYyODY4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0700712","name":"Dominic Purcell","nicknames":["Dom"],"idIMDB":"nm0700712"},"actorId":"nm0700712","character":"Davies","urlCharacter":"http://www.imdb.com/character/ch0273653","main":true},{"actorName":"Aden Young","urlProfile":"http://www.imdb.com/name/nm0949237","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NDA0NjE0MV5BMl5BanBnXkFtZTgwMjM0NTQ3MTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1972","placeOfBirth":" Toronto, Ontario, Canada","height":"5' 10½\" (1.79 m)","bio":"Aden Young was born in 1972 in Toronto, Ontario, Canada. He is an actor and editor, known for Killer Elite (2011), Rectify (2013) and Black Robe (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NDA0NjE0MV5BMl5BanBnXkFtZTgwMjM0NTQ3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0949237","name":"Aden Young","idIMDB":"nm0949237"},"actorId":"nm0949237","character":"Meier","urlCharacter":"http://www.imdb.com/character/ch0288668","main":true},{"actorName":"Yvonne Strahovski","urlProfile":"http://www.imdb.com/name/nm2088803","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI5NDIzNTQ1Nl5BMl5BanBnXkFtZTgwMjQ0Mzc1MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1982","placeOfBirth":" Maroubra, Sydney, New South Wales, Australia","birthName":"Yvonne Strzechowski","height":"5' 9¼\" (1.76 m)","bio":"Yvonne was born and raised in Australia. Her parents were Polish immigrants. She attended the Santa Sabina College for her high school education. She then went on to study Performance at the University of Western Sydney's School of Contemporary Arts, graduating in 2003. Shortly afterwards, she landed her first role on television in an episode of Double the Fist: Fear Factory (2004). Her next role was also on Australian television, appearing in several episodes of Headland (2005). In 2007, she made her big screen debut in Gone (2006). This performance caught the attention of casting directors in Hollywood. She decided to move from Australia to Los Angeles and, on her third day of arrival, she landed her breakthrough role as \"Sarah Walker\" in Chuck (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI5NDIzNTQ1Nl5BMl5BanBnXkFtZTgwMjQ0Mzc1MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2088803","name":"Yvonne Strahovski","nicknames":["Strahotski"],"idIMDB":"nm2088803"},"actorId":"nm2088803","character":"Anne","urlCharacter":"http://www.imdb.com/character/ch0288669","main":true},{"actorName":"Ben Mendelsohn","urlProfile":"http://www.imdb.com/name/nm0578853","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NzcyMDcyMF5BMl5BanBnXkFtZTcwNjQwMTczMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1969","placeOfBirth":" Melbourne, Victoria, Australia","birthName":"Paul Benjamin Mendelsohn","height":"5' 11\" (1.8 m)","bio":"Despite his prominence in Hollywood as a character actor known for playing villains and criminals, Ben Mendelsohn has been a leading man in Australia since starting acting as a teenager. Paul Benjamin Mendelsohn was born in Melbourne, Australia, to Carole Ann (Ferguson), a nurse, and Frederick Arthur Oscar Mendelsohn, a medical researcher. Getting his start in television, including The Henderson Kids and the long running soap opera Neighbours, Mendelsohn broke out with his performance as an ill-fated juvenile delinquent in the acclaimed coming of age film The Year My Voice Broke. Mendelsohn won the best supporting actor award from the Australian Film Institute, his first of eight nominations. Mendelsohn went onto to become one of the most popular teen/young adult stars in Australia cinema, often rivaling other emerging talents of his generation, including Russell Crowe, Noah Taylor, and Guy Pearce, leading the Australian tabloid to nickname them \"the Mouse Pack\" in reference to the Rat Pack in America and Brit Pack in the UK, emerging at the same time. Among his peers, Mendelsohn seemed to corner the market on troubled, angry young men, thanks to his roles in Idiot Box, Metal Skin, and Nirvana Street Murder. But Mendelsohn also proved he was capable of being a romantic lead, starring in the comedies The Big Steal, Cosi, Spotswood, and Amy. In the 1990s, Mendelsohn appeared in just one \"Hollywood\" film, the action film Vertical Limit, as one of two daredevil climbers on a rescue mission, often providing the film's comic relief. The film failed to find an audience and Mendelsohn returned to Australia, where he primarily worked in theater and television, despite earning best actor nominations from the Australian Film Institute and Australian Film Critics Circle for the drama Mullet, as a prodigal son returning to his small town. He also took steps to work in more international films such as The New World, Knowing and Australia. Mendelsohn has acknowledged that there was a period of almost two years that he had so little work, he considered leaving the acting profession entirely. In 2009, Mendelsohn experienced a bit of a comeback with the role in the independent Australian films Beautiful Kate, as troubled man forced to return reunite with his dying father and come to terms with the death of his twin sister, with whom he had a complicated relationship. He was nominated for Australian Film Institute and Australian Film Critics Circle Best Actor in 2009. A year later, he appeared as Pope in Animal Kingdom, the most terrifying and violent member of a crime family. In 2010, he won Best Actor from the Australian Film Institute, Independent Film Award, and Australian Film Critics Circle. Since 2010, Mendelsohn has become a major player in Hollywood as a character actor in both blockbuster films (The Dark Knight Rises) and critically acclaimed films such as Killing Them Softly and Place Beyond the Pines. In 2013 he appeared in the UK Starred Up, which earned him a Best Supporting Actor Award from the British Independent Film Awards. In 2014, he will also star in Ryan Gosling's Lost River, Slow West, and Exodus: Gods and Kings. In 2016, Mendelsohn won the Outstanding Supporting Actor in a Drama Series for his role as Danny Rayburn in Netflix's Bloodline. Mendelsohn lives in the US with his wife, writer Emma Forrest, and their daughter. He also has an older daughter from a previous relationship. (2014)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NzcyMDcyMF5BMl5BanBnXkFtZTcwNjQwMTczMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0578853","name":"Ben Mendelsohn","idIMDB":"nm0578853"},"actorId":"nm0578853","character":"Martin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adewale Akinnuoye-Agbaje","urlProfile":"http://www.imdb.com/name/nm0015382","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzA5MTI5MF5BMl5BanBnXkFtZTgwMTUxMjcwOTE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 August 1967","placeOfBirth":" Islington, London, England, UK","birthName":"Adewale Rotimi O. C. E. Akinnuoye Agbaje","height":"6' 2\" (1.88 m)","bio":"Born and raised in London, England, Adewale Akinnuoye-Agbaje began his career as a model in Milan. He graduated with a masters degree in Law from London's prestigious Kings College, before moving to Los Angeles to make the transition to acting. Fluent in several languages, including English, Italian, Yoruba and Swahili, he is best known for his roles in the movies Congo (1995) and The Mummy Returns (2001), and the HBO series Oz (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzA5MTI5MF5BMl5BanBnXkFtZTgwMTUxMjcwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0015382","name":"Adewale Akinnuoye-Agbaje","nicknames":["Triple A","Wally"],"idIMDB":"nm0015382"},"actorId":"nm0015382","character":"Agent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Whiteley","urlProfile":"http://www.imdb.com/name/nm2436874","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NTQ2NDkxOF5BMl5BanBnXkFtZTcwMjQyMDM3Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"David Whiteley is an actor, known for Killer Elite (2011), Knowing (2009) and Crawlspace (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NTQ2NDkxOF5BMl5BanBnXkFtZTcwMjQyMDM3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2436874","name":"David Whiteley","idIMDB":"nm2436874"},"actorId":"nm2436874","character":"MI6 Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matt Nable","urlProfile":"http://www.imdb.com/name/nm2506835","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc1NjEwNjQ3MF5BMl5BanBnXkFtZTgwMTQ0MDAxNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 March 1972","placeOfBirth":" Northern Beaches, Sydney, New South Wales, Australia","height":"5' 11¼\" (1.81 m)","bio":"Matthew \"Matty\" Nable is a former Rugby League footballer turned actor. After playing in the Winfield Cup Premiership for the Manly-Warringah Sea Eagles and South Sydney Rabbitohs during the 1990s, he wrote and starred in the rugby league-centred drama The Final Winter in 2007. He is a good friend and frequent collaborator of former Newcastle Five-Eighth turned actor Matthew Johns in television as well. Nable grew up on the Northern Beaches of Sydney and also, as a young boy, spent two years at Portsea, Victoria when his father, a soldier, was stationed there.His father had also worked as a trainer for the Australian national rugby league team and his brother, Adam Nable, would become a professional player as well.Matt rose through the junior ranks at the Manly-Warringah club and made half-a-dozen appearances for the first-grade team, later switching to the South Sydney Rabbitohs for a stint. After another season in England where he played for Carlisle before moving to the London Broncos.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc1NjEwNjQ3MF5BMl5BanBnXkFtZTgwMTQ0MDAxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2506835","name":"Matt Nable","idIMDB":"nm2506835"},"actorId":"nm2506835","character":"Pennock","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lachy Hulme","urlProfile":"http://www.imdb.com/name/nm0401522","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MDA5OTk0MF5BMl5BanBnXkFtZTcwNTY4NTYzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 April 1971","placeOfBirth":" Melbourne, Victoria, Australia","birthName":"Lachlan Stewart Hulme","height":"6' 3\" (1.91 m)","bio":"Striking, intense actor from Australia. A leading man with both strong dramatic range and ample comic timing, Lachy Hulme broke into movies by writing Canadian action/drama Men with Guns (1997), a bloody tale of friendship and revenge directed by Kari Skogland. Following numerous guest appearances on Australian television and many \"fringe\" theatre productions, he starred as \"Carl\" in the little-seen thriller Four Jacks (2001), a perfect role that combined his natural intensity with a dark, violent streak. He won the Best Actor Award at the 2001 Melbourne Underground Film Festival as a result. Known for being very private, he does interviews when promoting a movie, but he never discusses his relationships or family. After Four Jacks, he re-teamed with writer/director Matthew George for a change of pace, the light-hearted adventure Let's Get Skase (2001), starring as real-life sleazebag turned kidnapper \"Peter Dellasandro\". Based on a true story, the film was attacked by Australian critics for being in \"bad taste\" at the time of its release. Hulme fought valiantly for the film, often attacking its critics in television and radio interviews, and the controversy boosted his profile considerably. He soon landed roles opposite Steve Irwin in Traqueur de croco en mission périlleuse (2002) and in the video game _Enter the Matrix (2003)_.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MDA5OTk0MF5BMl5BanBnXkFtZTcwNTY4NTYzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0401522","name":"Lachy Hulme","idIMDB":"nm0401522"},"actorId":"nm0401522","character":"Harris","urlCharacter":"http://www.imdb.com/character/ch0508071","main":true},{"actorName":"Firass Dirani","urlProfile":"http://www.imdb.com/name/nm0228163","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNjIwMzU5NV5BMl5BanBnXkFtZTgwODM1NjkzODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1984","placeOfBirth":"","bio":"Firass Dirani was born in Blacktown in New South Wales, Australia on April 29, 1983. He began studying acting in 2001 at the Actors College of Theatre and Television (ACTT) and in 2014 moved to New York City where he studied at the Atlantic Theater Company. In 2010, Firass was awarded two Golden Logie Awards for his lead role as the 'King of the Cross' in the highly acclaimed Australian television series 'Underbelly: The Golden Mile'. He then went on to secure the lead role of 'Justin Baynie' in 'House Husbands' (2012) - winner of the Most Popular Television Drama at the 2013 Logie Awards and will commence filming for the fifth season in May, 2016. In late 2015, Firass played 'Vito Rinnelli' in 'Hacksaw Ridge', directed by Mel Gibson which is scheduled for release in 2016. He has since starred in American blockbusters: 'Pitch Black' opposite Vin Diesel, and 'Killer Elite', with Robert De Niro, Jason Statham and Clive Owen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNjIwMzU5NV5BMl5BanBnXkFtZTgwODM1NjkzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0228163","name":"Firass Dirani","idIMDB":"nm0228163"},"actorId":"nm0228163","character":"Bakhait","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nick Tate","urlProfile":"http://www.imdb.com/name/nm0851182","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NTY4NDAzNF5BMl5BanBnXkFtZTcwODA4ODI5NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 June 1942","placeOfBirth":" Sydney, New South Wales, Australia","birthName":"Nicholas John Tate","height":"5' 9\" (1.75 m)","bio":"Nick Tate was born on June 18, 1942 in Sydney, New South Wales, Australia as Nicholas John Tate. He is an actor and director, known for Killer Elite (2011), Gatsby le magnifique (2013) and Hook (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NTY4NDAzNF5BMl5BanBnXkFtZTcwODA4ODI5NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0851182","name":"Nick Tate","idIMDB":"nm0851182"},"actorId":"nm0851182","character":"Commander B","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bille Brown","urlProfile":"http://www.imdb.com/name/nm0113125","urlPhoto":"","biography":{"dateOfBirth":"11 January 1952","placeOfBirth":" Biloela, Queensland, Australia","birthName":"William Gerard Brown","height":"6' 1\" (1.85 m)","bio":"A Drama graduate of the University of Queensland, Bille Brown is a well-known Shakespearean actor. He began with the Queensland Theatre Company and, later, was a member of the Royal Shakespeare Company (RSC) in Strathford and London. While with the RSC, he was one of its few commissioned writers. Bille Brown AM has been recognised twice in the Australian Honours System. On 1 January 2001 he was granted the Centenary Medal \"for distinguished service to the arts\" and on 26 January 2011, Bille was named as a Member of the Order of Australia \"for service to the performing arts as an actor and playwright, and to education\". The latter honour is denoted by the post-nominal \"AM\" after his name.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0113125","name":"Bille Brown","idIMDB":"nm0113125"},"actorId":"nm0113125","character":"Colonel Fitz","urlCharacter":"http://www.imdb.com/character/ch0251938","main":true},{"actorName":"Stewart Morritt","urlProfile":"http://www.imdb.com/name/nm0607425","urlPhoto":"","biography":{"bio":"Stewart Morritt is an actor, known for Killer Elite (2011), The Ripper (1997) and Les voisins (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0607425","name":"Stewart Morritt","idIMDB":"nm0607425"},"actorId":"nm0607425","character":"Campbell","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1448755","urlIMDB":"http://www.imdb.com/title/tt1448755","business":{"budget":{"money":"$70,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$9,300,000","country":"USA","day":"25","month":"09","year":"2011","remarks":"2,986 Screens"},{"money":"PHP 2,183,058","country":"Philippines","day":"23","month":"10","year":"2011","remarks":"36 Screens"}],"gross":[{"money":"$25,093,607","country":"USA","day":"13","month":"11","year":"2011","remarks":""},{"money":"$25,006,568","country":"USA","day":"06","month":"11","year":"2011","remarks":""},{"money":"$24,909,621","country":"USA","day":"30","month":"10","year":"2011","remarks":""},{"money":"$24,626,635","country":"USA","day":"23","month":"10","year":"2011","remarks":""},{"money":"$23,763,724","country":"USA","day":"16","month":"10","year":"2011","remarks":""},{"money":"$21,646,929","country":"USA","day":"09","month":"10","year":"2011","remarks":""},{"money":"$17,501,286","country":"USA","day":"02","month":"10","year":"2011","remarks":""},{"money":"$9,300,000","country":"USA","day":"25","month":"09","year":"2011","remarks":""},{"money":"PHP 3,257,160","country":"Philippines","day":"30","month":"10","year":"2011","remarks":""},{"money":"PHP 2,183,058","country":"Philippines","day":"23","month":"10","year":"2011","remarks":""}],"weekendGross":[{"money":"$65,729","country":"USA","day":"13","month":"11","year":"2011","remarks":"160 Screens"},{"money":"$42,531","country":"USA","day":"06","month":"11","year":"2011","remarks":"119 Screens"},{"money":"$108,443","country":"USA","day":"30","month":"10","year":"2011","remarks":"258 Screens"},{"money":"$410,036","country":"USA","day":"23","month":"10","year":"2011","remarks":"1,431 Screens"},{"money":"$1,031,220","country":"USA","day":"16","month":"10","year":"2011","remarks":"1,431 Screens"},{"money":"$2,201,362","country":"USA","day":"09","month":"10","year":"2011","remarks":"2,411 Screens"},{"money":"$4,916,839","country":"USA","day":"02","month":"10","year":"2011","remarks":"2,986 Screens"},{"money":"$9,300,000","country":"USA","day":"25","month":"09","year":"2011","remarks":"2,986 Screens"},{"money":"PHP 396,481","country":"Philippines","day":"30","month":"10","year":"2011","remarks":"28 Screens"},{"money":"PHP 2,183,058","country":"Philippines","day":"23","month":"10","year":"2011","remarks":"36 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"10","month":"05","year":"2010","remarks":null},null],"copyrightHolder":"Omnilab Media Pty Ltd"},"technical":{"runtime":["1 hr 56 min (116 min)"],"soundMix":["Dolby Digital","Datasat","SDDS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex 235, Panavision Primo Lenses","Arriflex 435, Panavision Primo Lenses","Panavision Panaflex Millennium XL2, Panavision Primo Lenses"],"laboratory":["DeLuxe, Melbourne, Australia","Digital Pictures, Melbourne, Australia (digital intermediate)"],"filmLength":null,"negativeFormat":["35 mm (Kodak Vision3 200T 5213, Vision3 500T 5219)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (3-perf) (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","D-Cinema"]},"rating":"6.5","metascore":"44","filmingLocations":[{"location":"Dynon Road, Melbourne, Victoria, Australia"}],"rated":"R","awards":[{"award":"Australian Academy of Cinema and Television Arts (AACTA) Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated AACTA Award","categories":[{"category":"Best Visual Effects","names":[{"name":"Ineke Majoor","id":"nm1176015","role":null},{"name":"Julian Dimsey","id":"nm0227482","role":null}]},{"category":"Best Production Design","names":[{"name":"Michelle McGahey","id":"nm0568894","role":null}]}]}]},{"award":"Australian Screen Sound Guild 2012","titlesAwards":[{"titleAwardOutcome":"Won ASSG Award","categories":[{"category":"Feature Film Soundtrack of the Year","names":[]},{"category":"Best Achievement in Sound for Film Sound Mixing","names":[{"name":"Pete Smith","id":"nm0809588","role":null},{"name":"Chris Goodes","id":"nm1329562","role":null},{"name":"Paul Pirola","id":"nm0685244","role":null},{"name":"Andrew Neil","id":"nm1178072","role":null},{"name":"Andy Wright","id":"nm1649593","role":null}]}]},{"titleAwardOutcome":"Nominated ASSG Award","categories":[{"category":"Best Achievement in Sound for Film Sound Design","names":[{"name":"Paul Pirola","id":"nm0685244","role":null},{"name":"Andrew Plain","id":"nm0686413","role":null},{"name":"Hayden Collow","id":"nm1158672","role":null},{"name":"Carlo Cosentino","id":"nm4545025","role":null},{"name":"Leah Katz","id":"nm1180038","role":null},{"name":"Yulia Akerholt","id":"nm0009945","role":null},{"name":"Lucas Bone","id":"nm1890772","role":null},{"name":"Craig Carter","id":"nm0141544","role":null},{"name":"Brendan Croxon","id":"nm2683201","role":null},{"name":"Les Fiddess","id":"nm0275724","role":null},{"name":"Blair Slater","id":"nm0805347","role":null},{"name":"Adam Connelly","id":"nm3836871","role":null},{"name":"Nicolas Gilou","id":"nm1130924","role":null},{"name":"Chris Goodes","id":"nm1329562","role":null},{"name":"Cameron Grant","id":"nm3279675","role":null},{"name":"James Harvey","id":"nm0367565","role":null},{"name":"Nick Kray","id":"nm2390390","role":null},{"name":"Frank Lipson","id":"nm0513805","role":null},{"name":"Glenn Newnham","id":"nm0628358","role":null},{"name":"Martin Oswin","id":"nm0652671","role":null},{"name":"Brooke Trezise","id":"nm3124467","role":null},{"name":"Frédéric Ullmann","id":"nm0880515","role":null}]},{"category":"Best Achievement in Sound for a Feature Film - Location Sound Recording","names":[{"name":"Gary Wilkins","id":"nm0929257","role":null},{"name":"Gretchen Thornburn","id":"nm0861330","role":null},{"name":"Chris O'Shea","id":"nm1147417","role":null},{"name":"Bryn Duffy","id":"nm4327275","role":null},{"name":"Cam Eason","id":"nm0247486","role":null},{"name":"Nigel Albermaniche","id":"nm3040454","role":null},{"name":"Andrew Quinney","id":"nm2770893","role":null}]}]}]},{"award":"World Stunt Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Taurus Award","categories":[{"category":"Best Fight","names":[{"name":"Michael M. Foster","id":"nm1932878","role":null},{"name":"Joss Gower","id":"nm0332980","role":null},{"name":"Allan Poppleton","id":"nm0691597","role":null}]},{"category":"Hardest Hit","names":[{"name":"Allan Poppleton","id":"nm0691597","role":null}]},{"category":"Best High Work","names":[{"name":"Allan Poppleton","id":"nm0691597","role":null},{"name":"Kyle Gardiner","id":"nm1554347","role":null}]}]}]}],"votes":"109,295","type":"Movie","companyCreditsSimple":[{"idCompany":"co0239107","name":"Omnilab Media"},{"idCompany":"co0205493","name":"Ambience Entertainment"},{"idCompany":"co0051228","name":"Current Entertainment"}],"keywords":{"keywords":["mentor","secret society","death","revenge","australia","briefcase of money","tunnel chase scene","breasts","female nudity","ends with text","jumping between buildings","aerial shot","bullet","body search","coitus interruptus","woman on top","car truck crash","remote control vehicle","eurocopter as350 squirrel","biting another person","horse riding","hand sledge","boeing 727","hereford united kingdom","skeet shooting","woman in a bikini","uh 1 huey helicopter","shot in the arm","yarra valley australia","m 16","remote detonator","car bomb","begins with text","knife","boyfriend girlfriend relationship","subway","warrior","one man army","reluctant hero","action hero","military","british army","sas","1980s","assassin","government agent","secret agent","spy","assassination attempt","bodyguard","target practice","coming out of retirement","disguise","snowstorm","escape attempt","rescue attempt","escape","held at gunpoint","hostage","kidnapping","exploding motorcycle","limousine","motorcycle cop","motorcycle","accidental death","what happened to epilogue","palace","stabbed to death","stabbed in the side","subway station","jumping through a window","tied to a chair","bag over head","explosion","book","author","kicked in the crotch","hit by a truck","kicked in the face","interrupted sex","pistol whip","hotel","head butt","shot in the forehead","reference to elvis presley","car crash","confession","beating","filmed killing","military base","character's point of view camera shot","night vision","punched in the crotch","hit in the crotch","stabbed with scissors","stabbed in the hand","hospital","welsh","disfigured face","stabbed in the eye","finger gun","desert","bare chested male","boxing ring","character repeating someone else's dialogue","cigarette smoking","pub","punched in the face","exile","shot in the back","flashback","briton abroad","lens flare","photograph","shot to death","shot in the shoulder","shot in the head","shot in the chest","assault rifle","exploding car","mexico","film starts with text","foot chase","shot in the leg","silencer","butterfly knife","eiffel tower paris","paris france","drugged drink","hypothermia","british special air service","videotape","sheikh","mercenary","oman","seeing father murdered","year 1980","london england","bald hero","tough guy","car chase","shootout","rival","brutality","beretta","desert eagle","desert eagle .50","semiautomatic pistol","machine gun","pistol","hand to hand combat","martial arts","fistfight","brawl","assassination","violence","blood splatter","blood","murder","soldier","ex special forces","ex soldier","special forces","hitman","agent","two word title","rescue","former navy sea air and land force","death of father","death of son","death of friend","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:02:53"}}