{"data":{"movies":[{"title":"Unknown","originalTitle":"","year":"2011","releaseDate":"20110218","directors":[{"name":"Jaume Collet-Serra","id":"nm1429471"}],"writers":[{"name":"Oliver Butcher","id":"nm0124700"},{"name":"Stephen Cornwell","id":"nm0180508"}],"runtime":"113 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA4NTk3MTQwN15BMl5BanBnXkFtZTcwNjUwMTMxNA@@._V1.jpg","countries":["UK","Germany","France","USA"],"languages":["English","German","Turkish","Arabic"],"genres":["Action","Mystery","Thriller"],"plot":"A biochemist and his dishy wife arrive in Berlin for a conference at which a scientist and his controversial Arab funder will announce breakthrough research. While his wife checks into the hotel, he grabs a cab to return to the airport for his briefcase, left at the curb. En route, an auto accident puts him in a coma, from which he awakes four days later without identification and with gaps in his memory. He goes to the hotel: his wife refuses to recognize him and another man has claimed his identity. With help from a nurse, the cab driver, a retired Stasi agent, and an academic friend, he tries to unravel what's going on. Is the answer in the briefcase?","simplePlot":"A man awakens from a coma, only to discover that someone has taken on his identity and that no one, (not even his wife), believes him. With the help of a young woman, he sets out to prove who he is.","actors":[{"actorName":"Liam Neeson","urlProfile":"http://www.imdb.com/name/nm0000553","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MTQ3NzU1MV5BMl5BanBnXkFtZTgwMDE3Mjg0MzE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1952","placeOfBirth":" Ballymena, Co. Antrim, Northern Ireland, UK","birthName":"William John Neeson","height":"6' 4\" (1.93 m)","bio":"Liam Neeson was born on June 7, 1952 in Ballymena, Northern Ireland, UK, to Katherine (Brown), a cook, and Bernard Neeson, a school caretaker. Liam worked as a forklift operator for Guinness, truck driver, assistant architect and an amateur boxer. He had originally sought a career as a teacher by attending St. Mary's Teaching College, Newcastle. However, in 1976, Neeson joined the Belfast Lyric Players' Theater and made his professional acting debut in the play \"The Risen People\". After two years, Neeson moved to Dublin's Abbey Theater where he performed the classics. It was here that he was spotted by director John Boorman and was cast in the film Excalibur (1981) as Sir Gawain, his first high-profile film role. Through the 1980s Neeson appeared in a handful of films and British TV series - including The Bounty (1984), A Woman of Substance (1984), The Mission (1986), and Duet for One (1986) - but it was not until he moved to Hollywood to pursue larger roles that he began to get noticed. His turn as a mute homeless man in Suspect (1987) garnered good reviews, as did supporting roles in The Good Mother (1988) and High Spirits (1988) - though he also starred in the best-to-be-forgotten Satisfaction (1988), which also featured a then-unknown Julia Roberts - but leading man status eluded him until the cult favorite Darkman (1990), directed by Sam Raimi. From there, Neeson starred in Under Suspicion (1991) and Ethan Frome (1993), was hailed for his performance in Woody Allen's Husbands and Wives (1992), and ultimately was picked by Steven Spielberg to play Oskar Schindler in Schindler's List (1993). The starring role in the Oscar-winning Holocaust film brought Neeson Academy Award, BAFTA and Golden Globe nominations for Best Actor. Also in 1993, he made his Broadway debut with a Tony-nominated performance in \"Anna Christie\", in which he co-starred with his future wife Natasha Richardson. The next year, the two also starred opposite Jodie Foster in the movie Nell (1994), and were married in July of that year. Leading roles as the 18th century Scottish Highlander Rob Roy (1995) and the Irish revolutionary leader Michael Collins (1996) followed, and soon Neeson was solidified as one of Hollywood's top leading men. He starred in the highly-anticipated Star Wars: Episode I - The Phantom Menace (1999) as Qui-Gon Jinn, received a Golden Globe nomination for Kinsey (2004), played the mysterious Ducard in Christopher Nolan's Batman Begins (2005), and provided the voice for Aslan in The Chronicles of Narnia: The Lion, the Witch and the Wardrobe (2005). Neeson found a second surprise career as an action leading man with the release of Taken (2008) in early 2009, an unexpected box office hit about a retired CIA agent attempting to rescue his daughter from being sold into prostitution. However, less than two months after the release of the film, tragedy struck when Richardson suffered a fatal head injury while skiing and passed away days afterward. Neeson returned to high-profile roles in 2010 with two back-to-back big-budget films, Clash of the Titans (2010) and The A-Team (2010), and returned to the action genre with Unknown (2011), The Grey (2011), Battleship (2012) and Taken 2 (2012), as well as the sequel La colère des Titans (2012). Neeson was awarded Officer of the Order of the British Empire in the 1999 Queen's New Year's Honours List for his services to drama. He has two sons from his marriage to Richardson: Micheal Richard Antonio Neeson (born June 22, 1995) and Daniel Jack Neeson (born August 27, 1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MTQ3NzU1MV5BMl5BanBnXkFtZTgwMDE3Mjg0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000553","name":"Liam Neeson","idIMDB":"nm0000553"},"actorId":"nm0000553","character":"Dr. Martin Harris","urlCharacter":"http://www.imdb.com/character/ch0181632","main":true},{"actorName":"Diane Kruger","urlProfile":"http://www.imdb.com/name/nm1208167","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzY0Nzk2Ml5BMl5BanBnXkFtZTcwODQ0MTMyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1976","placeOfBirth":" Algermissen, Lower Saxony, Germany","birthName":"Diane Heidkrüger","height":"5' 7\" (1.7 m)","bio":"Diane Kruger was born Diane Heidkrüger in Algermissen, near Hildesheim, Germany, to Maria-Theresa, a bank employee, and Hans-Heinrich Heidkrüger, a computer specialist. She studied ballet with the Royal Ballet in London before an injury ended her career. She returned to Germany and became a top fashion model. She later pursued acting and relocated to Paris at the suggestion of filmmaker Luc Besson (The Fifth Element (1997)). She married French actor Guillaume Canet (The Beach (2000)) in 2001.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzY0Nzk2Ml5BMl5BanBnXkFtZTcwODQ0MTMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1208167","name":"Diane Kruger","idIMDB":"nm1208167"},"actorId":"nm1208167","character":"Gina","urlCharacter":"http://www.imdb.com/character/ch0181633","main":true},{"actorName":"January Jones","urlProfile":"http://www.imdb.com/name/nm0005064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyODE1Mjg4NF5BMl5BanBnXkFtZTcwMTE5MjQ1Nw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1978","placeOfBirth":" Sioux Falls, South Dakota, USA","birthName":"January Kristen Jones","height":"5' 6\" (1.68 m)","bio":"January Kristen Jones was born in Sioux Falls, South Dakota, but for the first decade of her life, she was raised in Hecla, a small town of some 400 souls, in the Mount Rushmore State. She is the daughter of Karen Sue (Cox), a sporting goods store manager, and Marvin Roger Jones, a gym teacher and fitness director. She was named after January Wayne, a character in Jacqueline Susann's potboiler Once Is Not Enough (1975). She is of Czech, Danish, English, Welsh, and German ancestry. January worked at the All-American job of counter girl at Dairy Queen after school. The family eventually moved back to Sioux Falls, the largest city in South Dakota. After graduating from Roosevelt High School in Sioux Falls, she moved to New York City to become a model. Despite her stature (5'6\", which is short for a fashion model), she got modeling gigs, including Abercrombie & Fitch ads, because of her striking good looks. However, modeling was just a means to an end, to get out of South Dakota and avoid going to college. She got her first taste of acting from TV commercials and found that she had flair for it, even though she did not act in high school and had no training. January appeared in a couple of television pilots and a cable television series before making her big screen debut in All the Rage (1999), an indie that never got a real release. She followed it up with a small role in the teen thriller The Glass House (2001). Her actual debut in the sense of attracting attention was in the near silent role of the beauty who entices Jane Fonda's son, Troy Garity, in the Bruce Willis-Cate Blanchett-Billy Bob Thornton comedy Bandits (2001). It was not a career-making part. At the time the movie was released, she was ending a three-year relationship with Ashton Kutcher. Small roles followed, including a \"don't blink or you won't see me\" part in the Adam Sandler-Jack Nicholson comedy Anger Management (2003). She gained some career traction with a good role in another comedy, American Wedding (2003), a sequel to American Pie (1999). Until she landed the part on Mad Men (2007), which made its debut on AMC in 2007, her career was steady but undistinguished. \"I choose roles that are not me\", January has said. The role of Betty Draper has garnered her two Golden Globe nominations and an Emmy nomination as Best Actress. Her cool, Grace Kelly-ish blonde ice queen looks -- counterpointed by her soul burning in her bright blue eyes -- have established her as a retro icon of the 21st Century.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyODE1Mjg4NF5BMl5BanBnXkFtZTcwMTE5MjQ1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005064","name":"January Jones","idIMDB":"nm0005064"},"actorId":"nm0005064","character":"Elizabeth Harris","urlCharacter":"http://www.imdb.com/character/ch0221723","main":true},{"actorName":"Aidan Quinn","urlProfile":"http://www.imdb.com/name/nm0001644","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNTI3NzI5OV5BMl5BanBnXkFtZTcwMDE1NTk0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 March 1959","placeOfBirth":" Chicago, Illinois, USA","birthName":"Aidan T. Quinn","height":"6' (1.83 m)","bio":"Aidan Quinn was born on March 8, 1959 in Chicago, Illinois, USA as Aidan T. Quinn. He is an actor, known for Elementary (2012), Legends of the Fall (1994) and Unknown (2011). He has been married to Elizabeth Bracco since September 1, 1987. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNTI3NzI5OV5BMl5BanBnXkFtZTcwMDE1NTk0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001644","name":"Aidan Quinn","idIMDB":"nm0001644"},"actorId":"nm0001644","character":"Martin B","urlCharacter":"http://www.imdb.com/character/ch0240294","main":true},{"actorName":"Bruno Ganz","urlProfile":"http://www.imdb.com/name/nm0004486","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzOTM4NDI1OF5BMl5BanBnXkFtZTYwOTc1NjEz._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1941","placeOfBirth":" Zürich-Seebach, Switzerland","height":"5' 6\" (1.68 m)","bio":"Bruno Ganz debuted at the theatre in 1961 and gained there a good reputation as a solid, young actor. In 1970 he founded with Peter Stein the theatre company \"Schaubuehne\" of Berlin. His debut at the movies was early and unsuccessful during the decade of 1960. His talent as a reflexive actor with tendencies towards introspection was widely known after Summer Guests (1976).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzOTM4NDI1OF5BMl5BanBnXkFtZTYwOTc1NjEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004486","name":"Bruno Ganz","nicknames":["Gano Brunz"],"idIMDB":"nm0004486"},"actorId":"nm0004486","character":"Ernst Jürgen","urlCharacter":"http://www.imdb.com/character/ch0240295","main":true},{"actorName":"Frank Langella","urlProfile":"http://www.imdb.com/name/nm0001449","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MDc0NTI3Nl5BMl5BanBnXkFtZTcwMTgzNjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1938","placeOfBirth":" Bayonne, New Jersey, USA","birthName":"Frank A. Langella Jr.","height":"6' 3\" (1.91 m)","bio":"Frank Langella was born in Bayonne, New Jersey, to Angelina and Frank A. Langella, a business executive. He is of Italian descent. A stage and screen actor of extreme versatility, Frank Langella won acclaim on the New York stage in \"Seascape\" and followed it up with the title role in the Edward Gorey production of \"Dracula\". He repeated the role for the screen in Dracula (1979) and became an international star. Over the years, he has done occasional films but prefers to concentrate on his first love, the legitimate theatre. His stage performance ranged from Strindberg drama (\"The Father\") to Noël Coward comedy (\"Present Laughter\"). He also appeared in several productions for the New York Shakespeare festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MDc0NTI3Nl5BMl5BanBnXkFtZTcwMTgzNjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001449","name":"Frank Langella","idIMDB":"nm0001449"},"actorId":"nm0001449","character":"Rodney Cole","urlCharacter":"http://www.imdb.com/character/ch0240296","main":true},{"actorName":"Sebastian Koch","urlProfile":"http://www.imdb.com/name/nm0462407","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTZlN2QzNzQtNjg2Ny00MTM3LWE1ZDgtYTQyYjU0MGQ3NTkyL2ltYWdlXkEyXkFqcGdeQXVyMjExMjAwOTk@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1962","placeOfBirth":" Karlsruhe, Baden-Württemberg, Germany","height":"5' 11½\" (1.82 m)","bio":"On stage, television or the movie theatre screen Sebastian Koch is undeniably one of Germany s most multi-faceted and successful actors. Born in Karlsruhe, Germany, May 31, 1962, he spent his childhood and youth in Stuttgart, southwestern Germany. He planned to become a musician, but in the late seventies a Stuttgart theater production by director Claus Peymann, inspired him to change his professional direction and choose a career as an actor. He graduated in 1985 from the renowned Otto Falckenberg School of Acting in Munich. Initial career performances at Munich&acutes Theater der Jugend were followed by roles including Schiller s \"Die Raeuber\", Goethe s \"Iphigenie\", and \"Dirty Dishes\" from Nick Whitby in engagements at the Staedtischen Buehnen Ulm, the Staatstheater Darmstadt and the Staatlichen Buehnen Berlin. In 1986 he commenced his television career debuting on the side of Commissioner Helmut Fischer in the famous long-running German television Sunday night crime series \"Tatort\"-- \"Die Macht des Schicksals.\" Innumerable crime stories and thrillers followed but it was in 1997 when director Heinrich Breloer cast Koch as Andreas Baader in the highly-acclaimed movie-of-the week two-parter \"Todesspiel\" which overnight changed his career. Five years later in 2002 Sebastian Koch achieved a feat not achieved in over 30 years of German television, he was awarded the coveted Grimme Prize for the leading roles in two television films, \"Der Tanz mit dem Teufel - Die Entfuehrung des Richard Oetker\", the story of the abduction of the heir to the Oetker fortune, as well as for his role in the three-part historical family drama \"The Manns\". The production \"The Manns\" was awarded Germany's esteemed honor as the \"Television Event of the Year 2002\". Koch received additional accolades for his role as Klaus Mann, including the Bavarian Television Prize. His international breakthrough came with the historical mini-series \"Napoleon,\" alongside prominent colleagues including Gerard Depardieu, John Malkovich and Isabella Rossellini, and his role as Cathereine Deneuve's young lover, Rodolphe Loewenstein in \"MARIE AND FREUD\". Koch' s continued choice of roles in his career have provided an extremely intense examination of many personalities and themes pertaining to German history. Beginning theatrically in Constantin Costa-Gavras adaptation of Rolf Hochhuth's \"AMEN\" released in 2002, and then in successive German television events including the 2001 production of \"The Tunnel\", a two-part movie-of-the-week from Roland Suso Richter about the underground tunnel built from west to east Berlin which succeeded in enabling 100 people to flee the GDR; followed in 2003 with director Peter Keglevic's historical drama \"Zwei Tage Hoffnung\" about the infamous strike in the former GDR on June 17, 1953; and, the next year, in \"Operation Valkryrie\", the spectacular docu-drama from Jo Baier, awarded the German Television Prize, about the aristocratic soldier Clemens von Stauffenberg's perfect plot in 1944 to murder Hitler by smuggling a bomb into Hitler's bunker. In 2005 Koch collaborated for the third time with director Heinrich Breloer in \"Speer and Hitler\", the story of Hitler and his architect Albert Speer, garnering Koch both the German Television Prize and Bavarian Television Prize for Best Actor. Sebastian Koch was awarded the Bambi Award for Best Male German Actor 2006. Sebastian Koch is drawn to complex, flawed characters with rough edges. A particular loneliness and/or reclusiveness surrounds Koch's characters, even a certain sadness through which he finds the energy and tension for his roles. In 2006 his stunning performance as GDR dramatist/playwright Georg Dreymann in Florian Henkel von Donnermarck's Oscar-winning theatrical success, the Stasi-drama, \"THE LIVES OF OTHERS\" earned him the 2007 Italian Foreign Press Award, the Globo d'Oro for Best European Actor. In Paul Verhoeven s film \"BLACK BOOK\", which celebrated in 2006 premieres in Venice and Toronto and was nominated from the Netherlands for the 2007 Academy Award for Best Foreign Language Film, Koch played the lead role as a Nazi officer in German-occupied Holland who falls in love with a Jewish Resistance Fighter (Carice van Houten). Under the direction of Hermine Huntgeburth (\"The White Massai\") alongside Julia Jentsch, Koch was most recently shooting EFFIE in the role of Geert von Instetten in the novel adaptation of \"Effi Briest\" by Theodor Fontane. Following the productions in Winter 2007/2008 of \"Gegen den Strom\" (Against the Current) and \"The Interrogation of Harry Wind,\" Koch will travel to Canada for the lead role in the international coproduction of Jack London s classic \"The Sea Wolf.\" The English language TV production, written by Nigel Williams (\"Elizabeth I.\") is being directed by Brit Mike Barker. Koch s German and international theatrical successes include the 2003 remake of Erich Kaestner s children s classic \"DAS FLIEGENDE KLASSENZIMMER\" from director Tomy Wiegand and \"GLOOMY SUNDAY\" from Rolf Schuebel (1999). In Spring 2007 Warner Brothers Germany released the family comedy sequel \"RENNSCHWEIN RUDI RUESSEL 2\" from Peter Timm. Sebastian Koch is alongside his theatrical and television activity a sought after reader for literary and musical audio books and the live performances of these productions. He returned to the theatre stage in 2006 after a long absence, performing the role of Lord Goring in Oscar Wildes \"An Ideal Husband\" under the direction of Armin Holz, a celebrated critical and audience success at the distinguished Schauspielhaus Bochum. Sebastian Koch makes his home in Berlin and has a daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTZlN2QzNzQtNjg2Ny00MTM3LWE1ZDgtYTQyYjU0MGQ3NTkyL2ltYWdlXkEyXkFqcGdeQXVyMjExMjAwOTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0462407","name":"Sebastian Koch","idIMDB":"nm0462407"},"actorId":"nm0462407","character":"Professor Bressler","urlCharacter":"http://www.imdb.com/character/ch0455684","main":true},{"actorName":"Olivier Schneider","urlProfile":"http://www.imdb.com/name/nm0773968","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MDg0NTU0MV5BMl5BanBnXkFtZTcwMjA4ODk1OQ@@._V1_UY44_CR22,0,32,44_AL_.jpg","biography":{"height":"6' 0¾\" (1.85 m)","bio":"Olivier Schneider is known for his work on Unknown (2011), Fast & Furious 6 (2013) and Taken (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MDg0NTU0MV5BMl5BanBnXkFtZTcwMjA4ODk1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0773968","name":"Olivier Schneider","idIMDB":"nm0773968"},"actorId":"nm0773968","character":"Smith","urlCharacter":"http://www.imdb.com/character/ch0455685","main":true},{"actorName":"Stipe Erceg","urlProfile":"http://www.imdb.com/name/nm1449783","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwOTc4MTIxMV5BMl5BanBnXkFtZTcwMjYzNDIxNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1974","placeOfBirth":" Split, Croatia, Yugoslavia [now Croatia]","height":"6' 1½\" (1.87 m)","bio":"Stipe Erceg was born on October 30, 1974 in Split, Croatia, Yugoslavia. He is an actor and producer, known for Unknown (2011), The Edukators (2004) and The Baader Meinhof Complex (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwOTc4MTIxMV5BMl5BanBnXkFtZTcwMjYzNDIxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1449783","name":"Stipe Erceg","idIMDB":"nm1449783"},"actorId":"nm1449783","character":"Jones","urlCharacter":"http://www.imdb.com/character/ch0455686","main":true},{"actorName":"Rainer Bock","urlProfile":"http://www.imdb.com/name/nm0090674","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MTMxNjQ0NV5BMl5BanBnXkFtZTcwODQ0OTk2Mg@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1954","placeOfBirth":" Kiel, Schleswig-Holstein, Germany","height":"5' 10¾\" (1.8 m)","bio":"Rainer Bock was born on July 31, 1954 in Kiel, Schleswig-Holstein, Germany. He is an actor, known for Inglourious Basterds (2009), Unknown (2011) and Hansel & Gretel: Witch Hunters (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MTMxNjQ0NV5BMl5BanBnXkFtZTcwODQ0OTk2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0090674","name":"Rainer Bock","idIMDB":"nm0090674"},"actorId":"nm0090674","character":"Herr Strauss","urlCharacter":"http://www.imdb.com/character/ch0455687","main":true},{"actorName":"Mido Hamada","urlProfile":"http://www.imdb.com/name/nm1715024","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMjA1NjQwN15BMl5BanBnXkFtZTgwNzI0MDM0MDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1971","placeOfBirth":" Cairo, Egypt","bio":"Born in Egypt and raised in Germany, Hamada stumbled into acting following a sports injury which led him to study at the Oxford School of Drama in England where his love for the arts and theatre grew. He was cast in plays such as, Spinning Into Butter, Hamlet and Guantanamo at The West End and The Royal Court Theater in England. As Hamada continued his work in theatre, he started to dabble his way into film and television and appeared in the film Sky Captain and The World of Tomorrow alongside Angelina Jolie. He then landed his first TV break in the mini-series \"Path to 9/11\" alongside Harvey Keitel and Donnie Wahlberg and soon became a series regular on \"State of Mind\" which paved the way for roles in critically-acclaimed shows, such as \"Homeland\" and \"24\" and the mini-series \"The Dovekeepers\". Hamada portrays Eammon on NBC's \"Emerald City\" and will appear next on the Starz upcoming series \"Counterpart,\" an espionage thriller with a metaphysical twist. He is an avid Dahn-yogi and is also involved with \"The Wolf Connection.\" a youth empowerment program and wolf dog sanctuary.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMjA1NjQwN15BMl5BanBnXkFtZTgwNzI0MDM0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1715024","name":"Mido Hamada","idIMDB":"nm1715024"},"actorId":"nm1715024","character":"Prince Shada","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clint Dyer","urlProfile":"http://www.imdb.com/name/nm0245699","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTU0NTc4NV5BMl5BanBnXkFtZTcwNDUzMDI2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 November 1968","placeOfBirth":" London, England, UK","bio":"Clint has acted for 25 years in film, TV and theatre, starring in films such as SUS, The Trail, Cherps, Mr Inbetween, Everybody Loves Sunshine aka Busted, Love Me Still and appearing in the likes of The Club, Montana, Unknown, Sahara, Agora, Mr Bean 2, Shopping etc. Soon to be seen Starring in MINE, opposite Armie Hammer and has just finished filming 'The Stoic' opposite Antonio Banderos. TV includes Fallout, Trial & retribution, Dalziel & Pascoe, Inspector Linley, The Commander, Lock Stock, Thief Takers, Prime Suspect etc. On stage he has worked with heralded directors like Simon Mcburney,Mike Leigh, Dominic Cooke, Micheal Attenbourgh, Jane Howel, Ian Brown, Mike Bradwell, Madani Yohonis, Gbolahan Obesisan, Dawn Walton, and the legendary Philip Hedley, etc Most recently on stage at National Theatre in August Wilson's Play 'Ma Rainey's Black Bottom' directed by Dominic Cook, for which he won best actor in the I.A.R.Awards. It also won the Olivier Award for best Revival and had three Evening Standard Nominations. Clint won Best actor at the British Urban Film Awards, Screen Nation Film and Television Awards, Liege International Film Festival and The Texas Black Film Festival for 'SUS' . He was also nominated for the Independent Spirit Award at the Screen Nation Film and Television Awards for 'SUS'. In 2003 he was Nominated for best actor for Ice Cool Reception and Cherps in 2003 at the BFM awards. Clint directed the Olivier, Evening Standard, TMA and What's On Theatre Goers, nominated show 'The Big Life', at TRSE, bringing it to the Apollo Theatre on Shaftesbury Avenue, making it the first Black British musical to go the West End. He went on to Write and Direct 'Emergency', and 'Sylvia Plath', and also to direct the award winning 'The Westbridge' all at the Royal Court Theatre. Again with the Royal Court he wrote and acted in 'The big idea-The New Order' and directed 'Death of England' starring Rafe Spall, which was a co-produced film with the Guardian Newspaper online. He also directed the hit \"Roy Williams's play 'Kingston 14' at Theatre Royal Stratford-East. As a writer, Clint has been commissioned by BBC Films ,Scala Films, Screen East, Ealing Studios, Theatre Royal Stratford East. The Royal National Theatre, The Royal Court Theatre, Soho Theatre Company.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTU0NTc4NV5BMl5BanBnXkFtZTcwNDUzMDI2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0245699","name":"Clint Dyer","idIMDB":"nm0245699"},"actorId":"nm0245699","character":"Biko","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karl Markovics","urlProfile":"http://www.imdb.com/name/nm0548686","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4Mzc4MTU4N15BMl5BanBnXkFtZTYwMjUzNzI3._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1963","placeOfBirth":" Vienna, Austria","height":"5' 9¼\" (1.76 m)","bio":"Karl Markovics was born on August 29, 1963 in Vienna, Austria. He is an actor and director, known for The Grand Budapest Hotel (2014), The Counterfeiters (2007) and Unknown (2011). He is married to Stephanie Taussig. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4Mzc4MTU4N15BMl5BanBnXkFtZTYwMjUzNzI3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0548686","name":"Karl Markovics","idIMDB":"nm0548686"},"actorId":"nm0548686","character":"Dr. Farge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eva Löbau","urlProfile":"http://www.imdb.com/name/nm1031014","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5MTMyNTA5OV5BMl5BanBnXkFtZTYwOTAzODEz._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1972","placeOfBirth":" Waiblingen, Baden-Württemberg, Germany","height":"5' 3\" (1.6 m)","bio":"Eva Löbau was born on April 26, 1972 in Waiblingen, Baden-Württemberg, Germany. She is known for her work on Inglourious Basterds (2009), Unknown (2011) and The Forest for the Trees (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5MTMyNTA5OV5BMl5BanBnXkFtZTYwOTAzODEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1031014","name":"Eva Löbau","idIMDB":"nm1031014"},"actorId":"nm1031014","character":"Nurse Gretchen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Helen Wiebensohn","urlProfile":"http://www.imdb.com/name/nm3841258","urlPhoto":"","biography":{"bio":"Helen Wiebensohn is an actress, known for Unknown (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3841258","name":"Helen Wiebensohn","idIMDB":"nm3841258"},"actorId":"nm3841258","character":"Laurel Bressler","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1401152","urlIMDB":"http://www.imdb.com/title/tt1401152","business":{"budget":{"money":"$30,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$21,856,389","country":"USA","day":"20","month":"02","year":"2011","remarks":"3 Screens"}],"gross":[{"money":"$63,686,397","country":"USA","day":"12","month":"05","year":"2011","remarks":""},{"money":"$61,094,903","country":"USA","day":"20","month":"03","year":"2011","remarks":""},{"money":"$58,410,845","country":"USA","day":"13","month":"03","year":"2011","remarks":""},{"money":"$53,029,496","country":"USA","day":"06","month":"03","year":"2011","remarks":""},{"money":"$42,976,450","country":"USA","day":"27","month":"02","year":"2011","remarks":""},{"money":"$25,620,000","country":"USA","day":"20","month":"02","year":"2011","remarks":""},{"money":"£5,366,574","country":"UK","day":"27","month":"03","year":"2011","remarks":""},{"money":"£4,496,496","country":"UK","day":"20","month":"03","year":"2011","remarks":""},{"money":"£3,161,588","country":"UK","day":"13","month":"03","year":"2011","remarks":""},{"money":"$130,786,397","country":"Worldwide","day":"12","month":"05","year":"2011","remarks":""}],"weekendGross":[{"money":"$1,279,351","country":"USA","day":"20","month":"03","year":"2011","remarks":"1,401 Screens"},{"money":"$3,366,339","country":"USA","day":"13","month":"03","year":"2011","remarks":"2,303 Screens"},{"money":"$6,520,232","country":"USA","day":"06","month":"03","year":"2011","remarks":"2,913 Screens"},{"money":"$12,571,282","country":"USA","day":"27","month":"02","year":"2011","remarks":"3,043 Screens"},{"money":"$25,620,000","country":"USA","day":"20","month":"02","year":"2011","remarks":"3,043 Screens"},{"money":"£477,531","country":"UK","day":"27","month":"03","year":"2011","remarks":"348 Screens"},{"money":"£775,576","country":"UK","day":"20","month":"03","year":"2011","remarks":"367 Screens"},{"money":"£1,038,522","country":"UK","day":"13","month":"03","year":"2011","remarks":"343 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"16","month":"12","year":"2009","remarks":null},{"money":null,"country":null,"day":"28","month":"03","year":"2010","remarks":null}],"copyrightHolder":"© 2011 Dark Castle Holdings, LLC"},"technical":{"runtime":["1 hr 53 min (113 min)"],"soundMix":["SDDS","DTS","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam LT, Zeiss Master Prime and Angenieux Optimo Lenses","Arriflex 16 SR3, Zeiss Master Prime Lenses","Arriflex 235, Zeiss Master Prime Lenses","Arriflex 435, Zeiss Master Prime Lenses","Arriflex 765, Zeiss 765 Lenses"],"laboratory":["Andec Filmtechnik, Berlin, Germany (film processing: 8mm)","Arri Schwarzfilm, Berlin, Germany (film processing)","Technicolor, London, UK"],"filmLength":["3,092 m (Portugal, 35 mm)"],"negativeFormat":["16 mm (Kodak Ektachrome 100D 7285)","35 mm (Kodak Vision2 200T 5217, Vision3 500T 5219)","65 mm (Kodak Vision3 500T 5219)"],"cinematographicProcess":["Arri 765 (source format) (some scenes)","Digital Intermediate (2K) (master format)","Super 16 (source format) (some scenes)","Super 35 (also 3-perf) (source format)"],"printedFilmFormat":["35 mm (anamorphic) (partial blow-up) (Kodak Vision 2383)","D-Cinema"]},"rating":"6.9","metascore":"56","filmingLocations":[{"location":"Tresor, Berlin, Germany"}],"rated":"PG-13","awards":[{"award":"European Film Awards 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Audience Award","categories":[{"category":"","names":[{"name":"Jaume Collet-Serra","id":"nm1429471","role":null}]}]}]},{"award":"Jupiter Award 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Jupiter Award","categories":[{"category":"Best International Actress","names":[{"name":"Diane Kruger","id":"nm1208167","role":null}]},{"category":"Best International Actor","names":[{"name":"Liam Neeson","id":"nm0000553","role":null}]}]}]}],"votes":"217,696","type":"Movie","companyCreditsSimple":[{"idCompany":"co0050870","name":"Dark Castle Entertainment"},{"idCompany":"co0106949","name":"Panda Productions Inc."},{"idCompany":"co0028557","name":"Canal+"}],"keywords":{"keywords":["amnesia","airport","scientist","nurse","agriculture","hotel","coma","luggage","briefcase","biotechnology","river","hospital","nazi","detective","glass shard","political refugee","security camera","car into water","trauma","african immigrant","bosnian","mri","tenement","ex policeman","braless","terrorism","terrorist","subjective camera","stolen identity","identity theft","passenger train","newscast","crashing through a window","hotel explosion","flash drive","computer password","tuxedo","plastic explosive","pack of money","wristwatch","combination lock","cyanide poisoning","whistling kettle","book cipher","car train crash","streetcar","driving in reverse","car truck chase","murder of friend","attacked from behind","eye gouging","sliding down a ladder","two in a shower","50 euro bill","coughing","saying the same thing simultaneously","man fainting","speaking german","tearing a page from a book","hotel adlon","gift of a book","dragging a dead woman","woman's neck broken","dead woman with eyes open","dead woman on floor","dead nurse","secret agent","female in shower","passport control","fake passport","airport bar","airport terminal","forehead cut","band aid on forehead","lost luggage","baggage handler","baggage claim","baggage","taxi ride","conspiracy","bomb victim","defusing bomb","bomb explosion","bomb threat","time bomb","public telephone","payphone","public phone","car falls into water","parking garage","exploding building","male in shower","hearing sex through a wall","sound of sex","university","research scientist","scientific research","language","language barrier","suv accident","suv","immigrant","mercedes taxi","mercedes station wagon","mercedes","mercedes limousine","surveillance footage","video surveillance","surveillance camera","surveillance","hotel security guard","hotel receptionist","escape","narrow escape","escape from a car in water","overturned car","overturning car","heart stoppage","defibrillation","resuscitation","cardiopulmonary resuscitation","cpr","party","security guard","news report","deception","knife","stabbed with glass","breaking a mirror","subway","subway station","injection","poison","magnetic resonance imaging","sex in shower","impostor","illegal immigrant","thanksgiving","car off a bridge","prince","summit","professor","false name","doctor","character's point of view camera shot","bare chested male","underwater scene","car crash","car accident","false memory","flashback","american abroad","fake id","false passport","scene during opening credits","stealing a taxi","bilingualism","german","subtitled scene","laptop computer","child in peril","hotel suite","exploding car","kidnapping","falling from height","crushed by a car","hit by a car","looking at oneself in a mirror","woman slaps a man","face slap","taser","secret code","cell phone","stalking","nightclub","slow motion scene","drawing","driving on the sidewalk","car hit by a train","stabbed in the neck","head butt","punched in the stomach","beating","kicked in the stomach","punched in the face","climbing through a window","held at gunpoint","thrown through a wall","shower","loud sex","home invasion","suicide by poison","cyanide","exploding body","assassination attempt","book","waitress","character repeating someone else's dialogue","laboratory","private investigator","foot chase","syringe","dancing","neck breaking","photograph","posing as husband and wife","death","timebomb","fight","mercedes benz","bomb","loss of memory","murder","female taxi driver","taxi driver","taxi","car chase","berlin germany","professional assassin","explosion","violence","one word title","false identity","death of friend","based on novel","surprise ending","volkswagen"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 07:57:48"}}