{"data":{"movies":[{"title":"The American","originalTitle":"","year":"2010","releaseDate":"20100901","directors":[{"name":"Anton Corbijn","id":"nm0179221"}],"writers":[{"name":"Rowan Joffe","id":"nm0423626"},{"name":"Martin Booth","id":"nm0095757"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMDg1NDcxM15BMl5BanBnXkFtZTcwODc3MDg1Mw@@._V1.jpg","countries":["USA","UK"],"languages":["English","Italian"],"genres":["Crime","Drama","Thriller"],"plot":"Alone among assassins, Jack is a master craftsman. When a job in Sweden ends more harshly than expected for this American abroad, he vows to his contact Pavel that his next assignment will be his last. Jack reports to the Italian countryside, where he holes up in a small town and relishes being away from death for a spell. The assignment, as specified by a Belgian woman, Mathilde, is in the offing as a weapon is constructed. Surprising himself, Jack seeks out the friendship of local priest Father Benedetto and pursues romance with local woman Clara. But by stepping out of the shadows, Jack may be tempting fate.","simplePlot":"An assassin hides out in Italy for one last assignment.","actors":[{"actorName":"George Clooney","urlProfile":"http://www.imdb.com/name/nm0000123","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMTEyOTQ0MV5BMl5BanBnXkFtZTcwNzU3NTMzNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 May 1961","placeOfBirth":" Lexington, Kentucky, USA","birthName":"George Timothy Clooney","height":"5' 11\" (1.8 m)","bio":"George Timothy Clooney was born on May 6, 1961, in Lexington, Kentucky, to Nina Bruce (née Warren), a former beauty pageant queen, and Nick Clooney, a former anchorman and game show host (who was also the brother of singer Rosemary Clooney). He has Irish, English, and German ancestry. Clooney spent most of this youth in Ohio and Kentucky, and graduated from Augusta High School. He was very active in sports such as basketball and baseball, and tried out for the Cincinnati Reds, but was not offered a contract. After his cousin, Miguel Ferrer, got him a small part in a feature film, Clooney began to pursue acting. His first major role was on the sitcom E/R (1984) as \"Dr. Doug Ross\". More roles soon followed, including \"George Burnett\", the handsome handyman on The Facts of Life (1979); \"Booker Brooks\", a supervisor on Roseanne (1988); and \"Detective James Falconer\" on Sisters (1991). Clooney had his breakthrough when he was cast as \"Dr. Doug Ross\" on the award-winning drama series, ER (1994), opposite Anthony Edwards, Noah Wyle, and Julianna Margulies. While filming \"ER\", Clooney starred in a number of high profile film roles, such as Robert Rodriguez's From Dusk Till Dawn (1996), and One Fine Day (1996), opposite Michelle Pfeiffer. In 1997, Clooney took on the role of \"Batman\" in Joel Schumacher's Batman & Robin (1997). The film was a moderate success in the box office, but was slammed by critics, notably for the nipple-laden Bat suit. Clooney went on to star in Steven Soderbergh's Out of Sight (1998), Terrence Malick's The Thin Red Line (1998), and David O. Russell's Three Kings (1999). In 1999, Clooney left \"ER\" (though he would return for the season finale) and appeared in a number of films, including O Brother, Where Art Thou? (2000), The Perfect Storm (2000), and Ocean's Eleven (2001). Collaborating once again with Steven Soderbergh, \"Ocean's Eleven\" received critical acclaim, earned more than $450 million at the box office, and spawned two sequels: Ocean's Twelve (2004) and Ocean's Thirteen (2007). In 2002, Clooney made his directorial debut with Confessions of a Dangerous Mind (2002), an adaptation of TV producer Chuck Barris's autobiography. This was the first film under the banner of \"Section Eight Productions\", a production company he founded with Steven Soderbergh. The company also produced many acclaimed films, including Far from Heaven (2002), Syriana (2005), A Scanner Darkly (2006), and Good Night, and Good Luck. (2005). Clooney won his first Oscar for Best Supporting Actor in \"Syriana\", and was nominated for Best Director and Best Original Screenplay for \"Good Night, and Good Luck\". In 2006, \"Section Eight\" was shut down so that Soderbergh could concentrate on directing, and Clooney founded a new production company, \"Smokehouse Productions\", with his friend and long-time business partner, Grant Heslov. Clooney went on to produce and star in Michael Clayton (2007) (which earned him an Oscar nomination for Best Actor), directed and starred in Leatherheads (2008), and took leading roles in Burn After Reading (2008), The Men Who Stare at Goats (2009), Fantastic Mr. Fox (2009), and Jason Reitman's Up in the Air (2009). Clooney received critical acclaim for his performance in \"Up in the Air\" and was nominated for several awards, including a Golden Globe and Academy Award. He didn't win that year, but took home both Best Actor awards (as well as countless nominations) for his role as a father who finds out his wife was unfaithful as she lay in a coma in Alexander Payne's The Descendants (2011). Throughout his career, Clooney has been heralded for his political activism and humanitarian work. He has served as one of the \"United Nations Messengers of Peace\" since 2008, has been an advocate for the Darfur conflict, and organized the \"Hope for Haiti\" telethon, to raise money for the victims of the 2010 earthquake. In March of 2012, Clooney was arrested for civil disobedience while protesting at the Sudanese embassy in Washington, D.C. Clooney was married to actress Talia Balsam, from 1989 until 1993. After their divorce, he swore he would never marry again. Michelle Pfeiffer and Nicole Kidman bet him $10,000 that he would have children by the age of 40, and sent him a check shortly after his birthday. Clooney returned the funds and bet double or nothing he wouldn't have children by the age of 50. Although he has remained a consummate bachelor, Clooney has had many highly publicized relationships, including with former WWE wrestler Stacy Keibler. In 2014, he married lawyer and activist Amal Clooney.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMTEyOTQ0MV5BMl5BanBnXkFtZTcwNzU3NTMzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000123","name":"George Clooney","nicknames":["Gorgeous George"],"idIMDB":"nm0000123"},"actorId":"nm0000123","character":"Jack / Edward","urlCharacter":"http://www.imdb.com/character/ch0223166","main":true},{"actorName":"Irina Björklund","urlProfile":"http://www.imdb.com/name/nm0084950","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MjYwMzAyNF5BMl5BanBnXkFtZTcwNDM1NTM1Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1973","placeOfBirth":" Danderyd, Stockholms län, Sweden","birthName":"Irina Felicia Björklund","height":"5' 5\" (1.65 m)","bio":"Born in 1973, Irina Björklund is one of the most popular Finnish film stars of the end of 1990s and beginning of the 2000s. After studying years 1993-1996 in The Theatre Academy of Finland she made her silver screen debut in Pekka Parikka's (director of Guerre d'hiver (1989)) last film, Tie naisen sydämeen (1996)\". Another actor on the film was Peter Franzén who become her husband in the same year. Björklund's first big film role was in Ambush (1999), a highly popular Finnish war movie based on Antti Tuuri's novel. Björklund's husband Franzén was in the leading male role, Björklund made leading female role. She was nominated for Best Actress in Jussi Awards. Jussi Awards are the biggest Finnish movie awards, like the Oscars are in the USA. Björklund made her Hollywood debut in low budget horror movie The Dummy (2000), but returned in Finland to make Les instables (2000) and Me and Morrison (2001), both highly popular movies. She won Best Actress prize in Jussi Awards for her performance in \"Minä ja Morrison\". After that she has been working in Europe and Hollywood, but still her biggest roles has been in Finnish films: Land of Love (2003), Honey Baby (2004) and Blackout (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MjYwMzAyNF5BMl5BanBnXkFtZTcwNDM1NTM1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0084950","name":"Irina Björklund","nicknames":["Irkku"],"idIMDB":"nm0084950"},"actorId":"nm0084950","character":"Ingrid","urlCharacter":"http://www.imdb.com/character/ch0224947","main":true},{"actorName":"Lars Hjelm","urlProfile":"http://www.imdb.com/name/nm0387073","urlPhoto":"","biography":{"dateOfBirth":"5 March 1973","placeOfBirth":" Lysekil, Västra Götalands län, Sweden","bio":"Lars Hjelm was born on March 5, 1973 in Lysekil, Västra Götalands län, Sweden. He is known for his work on The Girl with the Dragon Tattoo (2009), Let the Right One In (2008) and Arn: The Knight Templar (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0387073","name":"Lars Hjelm","idIMDB":"nm0387073"},"actorId":"nm0387073","character":"Hunter #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Björn Granath","urlProfile":"http://www.imdb.com/name/nm0334689","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NzMwMTIwOV5BMl5BanBnXkFtZTcwMzQ3MTYwNw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 April 1946","placeOfBirth":" Gothenburg, Västra Götalands län, Sweden","birthName":"Björn Gösta Tryggve Granath","height":"6' 2\" (1.88 m)","bio":"Björn Granath was born on April 5, 1946 in Gothenburg, Västra Götalands län, Sweden as Björn Gösta Tryggve Granath. He was an actor, known for The Girl with the Dragon Tattoo (2009), The American (2010) and Pelle the Conqueror (1987). He was married to Annmargret Fyregård. He died on February 5, 2017 in Stockholm, Sweden.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NzMwMTIwOV5BMl5BanBnXkFtZTcwMzQ3MTYwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0334689","name":"Björn Granath","idIMDB":"nm0334689"},"actorId":"nm0334689","character":"Hunter #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Johan Leysen","urlProfile":"http://www.imdb.com/name/nm0508085","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MDM2OTI2MV5BMl5BanBnXkFtZTgwOTE3NTY3MzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 February 1950","placeOfBirth":" Hasselt, Limburg, Belgium","bio":"Johan Leysen was born on February 19, 1950 in Hasselt, Limburg, Belgium. He is known for his work on The American (2010), Young & Beautiful (2013) and Train of Life (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MDM2OTI2MV5BMl5BanBnXkFtZTgwOTE3NTY3MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0508085","name":"Johan Leysen","idIMDB":"nm0508085"},"actorId":"nm0508085","character":"Pavel","urlCharacter":"http://www.imdb.com/character/ch0244143","main":true},{"actorName":"Paolo Bonacelli","urlProfile":"http://www.imdb.com/name/nm0093678","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg3Nzc1NzMzNF5BMl5BanBnXkFtZTgwMTE2NDQzNzE@._V1_UY44_CR27,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 February 1937","placeOfBirth":" Rome, Lazio, Italy","bio":"Paolo Bonacelli was born on February 28, 1937 in Rome, Lazio, Italy. He is known for his work on Salò, or the 120 Days of Sodom (1975), Midnight Express (1978) and The American (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg3Nzc1NzMzNF5BMl5BanBnXkFtZTgwMTE2NDQzNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0093678","name":"Paolo Bonacelli","idIMDB":"nm0093678"},"actorId":"nm0093678","character":"Father Benedetto","urlCharacter":"http://www.imdb.com/character/ch0244142","main":true},{"actorName":"Giorgio Gobbi","urlProfile":"http://www.imdb.com/name/nm0299993","urlPhoto":"","biography":{"dateOfBirth":"1951","placeOfBirth":" Rome, Lazio, Italy","bio":"Giorgio Gobbi was born in 1951 in Rome, Lazio, Italy. He is an actor and writer, known for The American (2010), His Secret Life (2001) and Les equilibristes (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0299993","name":"Giorgio Gobbi","idIMDB":"nm0299993"},"actorId":"nm0299993","character":"Man on Vespa","urlCharacter":"http://www.imdb.com/character/ch0258674","main":true},{"actorName":"Silvana Bosi","urlProfile":"http://www.imdb.com/name/nm0097950","urlPhoto":"","biography":{"dateOfBirth":"23 July 1934","placeOfBirth":" Ferrara, Emilia-Romagna, Italy","bio":"Silvana Bosi was born on July 23, 1934 in Ferrara, Emilia-Romagna, Italy. She is an actress, known for The American (2010), The Talented Mr. Ripley (1999) and Letters to Juliet (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0097950","name":"Silvana Bosi","idIMDB":"nm0097950"},"actorId":"nm0097950","character":"Old Cheese Vendor","urlCharacter":"http://www.imdb.com/character/ch0258675","main":true},{"actorName":"Thekla Reuten","urlProfile":"http://www.imdb.com/name/nm0720671","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NjA5MTQxOV5BMl5BanBnXkFtZTgwOTE0OTY5MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1975","placeOfBirth":" Bussum, Noord-Holland, Netherlands","birthName":"Thekla Simona Gelsomina Reuten","height":"5' 8\" (1.73 m)","bio":"As a young Dutch actress with numerous internationally acclaimed films under her belt and whose work has been twice Oscar nominated, Thekla Reuten is an undeniable front-runner in the new wave of European actresses lauded on the international stage and screen. Thekla first came to wide international attention with her captivating role of Lotte in the Oscar nominated film Twin Sisters / De Tweeling, which went on to be a hit with critics and film lovers worldwide. Her reputation as one of Europe's hottest properties is being further established by a string of starring roles alongside the coolest young male leads, including Gael Garcia Bernal and Daniel Bruhl. Thekla recently wrapped two major English-language roles set for release in 2006. Early this year she spent two months in the chill of St Petersburg where she filmed In Transit alongside rising German star Daniel Bruhl, the legendary John Malkovich and Hollywood regular Thomas Kretschmann. In the cinematic debut from Brit director Tom Roberts she plays Russian woman Elena who is caught up in the return of female prisoners and refugees at the end of the Second World War. Immediately prior to that, she was in Lithuania to film the female lead opposite Brit-actor Adrian Paul in Highlander: The Source, directed by Brett Leonard (Lawnmower Man, Virtuosity). This new adventure in the tales of the immortal Scottish swordsman concerns the Immortals' quest to locate their Grail, the Source of Immortality. Twenty years on, the Highlander series is regarded as one of the most successful independent film and television franchises. It returns here in an action packed story of love, kinship... and the quest. Late in 2005, acclaimed Dutch director Alex van Warmerdam signed Thekla to appear in his anticipated movie Ober (Waiter). This is the latest film project from Holland's celebrated movie-making Van Warmerdam brothers: Director and screen-writer Alex (Grimm, The Northerners), producer Marc and composer Vincent. Thekla plays the part of Suzie in the comedy about a 50-year-old waiter called Edgar, who works in a restaurant that has seen better times. Edgar becomes tired of his existence and realises that there must be more from life. He wants a girlfriend, he wants new neighbours; he wants to be happy. Festival audiences worldwide have also been watching Thekla further stretching her boundaries in front of the cameras in Brit helmer Mike Figgis' experimental documentary about the process of acting, CO/MA. Last summer critics praised Thekla's starring turn opposite Mexican headliner Gael Garcia Bernal in the sell-out run of Lorca's Blood Wedding on the London stage. Reviews uniformly declared Thekla's dramatic lead performance as Gael's forbidden love interest in the Rufus Norris production as a triumph. This acclaim further cemented Thekla's growing credibility with international audiences, building on her various European film awards and the title of 2004 Dutch Shooting Star bestowed on her by the Berlin International Film Festival. In the summer, Thekla was brought to a wider audience in the US/UK with the DVD release of her Oscar-nominated movie Twin Sisters (De Tweeling) (2003), a provocative and critically revered big screen adaptation of the best selling novel from Holland's Tessa De Loo. Cast as Lotte, one of the eponymous sisters, Thekla was applauded for her emotional and heartfelt portrayal of a young woman torn from her twin both physically and emotionally by the wounds of war in Europe and the horrors of the Nazis. Twin Sisters was the second time Thekla's output had been spotlit by the Academy. Previously Everybody's Famous (2000) had received a nomination for Best Foreign Film. Speaking five European languages (Dutch, English, Italian, German and French) and with an Italian mother made her a natural choice for the Italian film Una Bellezza Che Non Lascia Scampo (2000), building on the success of Everybody's Famous to become a hit across Europe. By the time of shooting, her previous film Little Crumb (1999) had brought home more than ten international festival awards. Graduating from Amsterdam's Academy of Dramatic Arts in 1997, Thekla quickly came to the recognition of stage and screen directors to garner roles in significant productions, debuting with leading Dutch TV series Wij Alexander. Thekla Reuten is now firmly established as one of Europe's leading actresses. An actress whose work is without borders.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NjA5MTQxOV5BMl5BanBnXkFtZTgwOTE0OTY5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0720671","name":"Thekla Reuten","idIMDB":"nm0720671"},"actorId":"nm0720671","character":"Mathilde","urlCharacter":"http://www.imdb.com/character/ch0244141","main":true},{"actorName":"Guido Palliggiano","urlProfile":"http://www.imdb.com/name/nm1478755","urlPhoto":"","biography":{"dateOfBirth":"23 February 1952","placeOfBirth":" Naples, Campania, Italy","bio":"Guido Palliggiano was born on February 23, 1952 in Naples, Campania, Italy. He was an actor, known for The American (2010), St. Giuseppe Moscati: Doctor to the Poor (2007) and Tifosi (1999). He died on October 17, 2010 in Naples.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1478755","name":"Guido Palliggiano","idIMDB":"nm1478755"},"actorId":"nm1478755","character":"Waiter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Samuel Vauramo","urlProfile":"http://www.imdb.com/name/nm1576916","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg5NTM2MDA0Ml5BMl5BanBnXkFtZTgwOTIxNzExNzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1981","placeOfBirth":" Vantaa, Finland","height":"5' 8\" (1.73 m)","bio":"Samuel Vauramo was born on October 22, 1981 in Vantaa, Finland. He is an actor, known for The American (2010), Beauty and the Bastard (2005) and Tears of April (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg5NTM2MDA0Ml5BMl5BanBnXkFtZTgwOTIxNzExNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1576916","name":"Samuel Vauramo","idIMDB":"nm1576916"},"actorId":"nm1576916","character":"Young Swedish Man","urlCharacter":"http://www.imdb.com/character/ch0258676","main":true},{"actorName":"Antonio Rampino","urlProfile":"http://www.imdb.com/name/nm3287747","urlPhoto":"","biography":{"bio":"Antonio Rampino is an actor, known for The American (2010), To Rome with Love (2012) and 6x8: Non tutto ciò che vien dopo è progresso (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3287747","name":"Antonio Rampino","idIMDB":"nm3287747"},"actorId":"nm3287747","character":"Postmaster","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Violante Placido","urlProfile":"http://www.imdb.com/name/nm0686376","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3Mjc1NzM3NV5BMl5BanBnXkFtZTcwNTIzNTMwMg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 May 1976","placeOfBirth":" Rome, Lazio, Italy","height":"5' 5½\" (1.66 m)","bio":"Italian actress/singer/songwriter Violante Placido was born in Rome. She made her on-screen debut in Quattro bravi ragazzi (1993) alongside her father Michele Placido. In 1996 she starred in Jack Frusciante è uscito dal gruppo (1996) which became quite successful in Italy. Her first major role was in Sergio Rubini's Soul Mate (2002) (Soul Mate). In 2006 she released her debut album Don't Be Shy... under the pseudonym Viola. In 2009 she appeared in the Hindi movie Barah Aana (2009). In 2010 she made her Hollywood debut starring alongside George Clooney in Anton Corbijn's thriller The American (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3Mjc1NzM3NV5BMl5BanBnXkFtZTcwNTIzNTMwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0686376","name":"Violante Placido","idIMDB":"nm0686376"},"actorId":"nm0686376","character":"Clara","urlCharacter":"http://www.imdb.com/character/ch0244140","main":true},{"actorName":"Filippo Timi","urlProfile":"http://www.imdb.com/name/nm0863599","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0OTc1NDI2MV5BMl5BanBnXkFtZTcwNTc4ODIyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1974","placeOfBirth":" Perugia, Umbria, Italy","height":"6' (1.83 m)","bio":"Filippo Timi was born on February 27, 1974 in Perugia, Umbria, Italy. He is an actor and writer, known for Vincere (2009), L'heure du crime (2009) and As God Commands (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0OTc1NDI2MV5BMl5BanBnXkFtZTcwNTc4ODIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0863599","name":"Filippo Timi","idIMDB":"nm0863599"},"actorId":"nm0863599","character":"Fabio","urlCharacter":"http://www.imdb.com/character/ch0244144","main":true},{"actorName":"Ilaria Cramerotti","urlProfile":"http://www.imdb.com/name/nm0186207","urlPhoto":"","biography":{"bio":"Ilaria Cramerotti is an actress, known for The American (2010), A Dream House Nightmare (2007) and Vacanze sulla neve (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0186207","name":"Ilaria Cramerotti","idIMDB":"nm0186207"},"actorId":"nm0186207","character":"Hooker #2","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1440728","urlIMDB":"http://www.imdb.com/title/tt1440728","business":{"budget":{"money":"$20,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$16,662,333","country":"USA","day":"05","month":"09","year":"2010","remarks":"2,823 Screens"},{"money":"£411,707","country":"UK","day":"28","month":"11","year":"2010","remarks":"237 Screens"}],"gross":[{"money":"$35,606,376","country":"USA","day":"04","month":"11","year":"2010","remarks":""},{"money":"$35,596,227","country":"USA","day":"31","month":"10","year":"2010","remarks":""},{"money":"$35,562,113","country":"USA","day":"24","month":"10","year":"2010","remarks":""},{"money":"$35,491,872","country":"USA","day":"17","month":"10","year":"2010","remarks":""},{"money":"$35,375,768","country":"USA","day":"10","month":"10","year":"2010","remarks":""},{"money":"$35,202,471","country":"USA","day":"04","month":"10","year":"2010","remarks":""},{"money":"$34,607,381","country":"USA","day":"26","month":"09","year":"2010","remarks":""},{"money":"$32,772,475","country":"USA","day":"19","month":"09","year":"2010","remarks":""},{"money":"$28,111,358","country":"USA","day":"12","month":"09","year":"2010","remarks":""},{"money":"$19,806,118","country":"USA","day":"05","month":"09","year":"2010","remarks":""},{"money":"£1,290,205","country":"UK","day":"19","month":"12","year":"2010","remarks":""},{"money":"£1,184,528","country":"UK","day":"12","month":"12","year":"2010","remarks":""},{"money":"£921,526","country":"UK","day":"05","month":"12","year":"2010","remarks":""},{"money":"£411,707","country":"UK","day":"28","month":"11","year":"2010","remarks":""},{"money":"$67,876,281","country":"Worldwide","day":"04","month":"11","year":"2010","remarks":""}],"weekendGross":[{"money":"$19,511","country":"USA","day":"31","month":"10","year":"2010","remarks":"42 Screens"},{"money":"$32,031","country":"USA","day":"24","month":"10","year":"2010","remarks":"76 Screens"},{"money":"$71,959","country":"USA","day":"17","month":"10","year":"2010","remarks":"144 Screens"},{"money":"$85,672","country":"USA","day":"10","month":"10","year":"2010","remarks":"174 Screens"},{"money":"$210,428","country":"USA","day":"04","month":"10","year":"2010","remarks":"374 Screens"},{"money":"$896,382","country":"USA","day":"26","month":"09","year":"2010","remarks":"1,315 Screens"},{"money":"$2,672,521","country":"USA","day":"19","month":"09","year":"2010","remarks":"2,457 Screens"},{"money":"$5,674,240","country":"USA","day":"12","month":"09","year":"2010","remarks":"2,833 Screens"},{"money":"$16,662,333","country":"USA","day":"05","month":"09","year":"2010","remarks":"2,823 Screens"},{"money":"£30,782","country":"UK","day":"19","month":"12","year":"2010","remarks":"73 Screens"},{"money":"£109,084","country":"UK","day":"12","month":"12","year":"2010","remarks":"163 Screens"},{"money":"£286,072","country":"UK","day":"05","month":"12","year":"2010","remarks":"243 Screens"},{"money":"£411,707","country":"UK","day":"28","month":"11","year":"2010","remarks":"237 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"28","month":"09","year":"2009","remarks":null},null],"copyrightHolder":"Copyright © 2010 Focus Features LLC"},"technical":{"runtime":["1 hr 45 min (105 min)"],"soundMix":["Dolby Digital","DTS"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam LT, Cooke S4 Lenses","Arricam ST, Cooke S4 and Angenieux Optimo Lenses","Arriflex 435, Cooke S4 Lenses"],"laboratory":["Technicolor Creative Services, London, UK (digital intermediate)"],"filmLength":["2,850 m (Portugal, 35 mm)","2,867 m (Sweden)"],"negativeFormat":["35 mm (Kodak Vision3 250D 5207, Vision3 500T 5219)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (3-perf) (source format)"],"printedFilmFormat":["35 mm (anamorphic)","D-Cinema"]},"rating":"6.3","metascore":"61","filmingLocations":[{"location":"Castel del Monte, L'Aquila, Abruzzo, Italy"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Actor","names":[{"name":"George Clooney","id":"nm0000123","role":null}]},{"category":"Best Horror/Thriller Film","names":[]}]}]},{"award":"International Film Music Critics Award (IFMCA) 2010","titlesAwards":[{"titleAwardOutcome":"Nominated IFMCA Award","categories":[{"category":"Breakout Composer of the Year","names":[{"name":"Herbert Grönemeyer","id":"nm0344963","role":null}]}]}]}],"votes":"81,584","type":"Movie","companyCreditsSimple":[{"idCompany":"co0042399","name":"Focus Features"},{"idCompany":"co0209164","name":"Greenlit Rights"},{"idCompany":"co0140937","name":"Helicopter Film Services"}],"keywords":{"keywords":["weapon","priest","assassin","woman","ambush","sweden","prostitute","village","date","lake","italy","italian","american abroad","dalarna sweden","small town","death","brothel","camera","equipment","theft","undercover","dinner date","knife","bullet","corpse","suitcase","tough guy","purse","full moon","love","unrequited love","nudity","falling from height","sabotage","mission","espionage","englishman abroad","money","gas station","long take","cult film","europe","stalking","following someone","quick draw","hotel","cafe","on the run","shower","orgasm","man kills a woman","skinny dipping","shot in the leg","hidden gun","shot in the back","prologue","female killer","wine","stealing a car","blood on shirt","blood splatter","blood","hitman","motorcycle","assassination plot","car motorcycle chase","foot chase","father son relationship","car accident","map","redemption","double cross","revenge","deception","dark hero","cemetery","confession","premarital sex","fellatio","garage","avant garde","fireplace","diner","hired killer","crisis of conscience","forest","woods","anti hero","tragic hero","gunslinger","loner","rear entry sex","female full frontal nudity","breasts","tragic ending","backfiring gun","ambiguous ending","italian prostitute","sex with prostitute","patronizing a prostitute","alcohol","watching tv","watching a movie","wine bottle","television","car crash","dead woman","dying woman","dead body","surviving shooting","female sniper","assassination attempt","bar","waiter","nightmare","sleeping","pay phone","nickname in title","winter","false identity","woman undressing for a man","alleyway","taking off shoes","kissing in public","rifle cartridge","talking after sex","woman smoking cigarette","smoking after sex","passionate kiss","talking during sex","kissing breasts","implied cunnilingus","failed murder attempt","paranoia","telephone call","test fire gun","woman with gun","cell phone","execution","sexy woman","repairing a car","auto repair","female pubic hair","pubic hair","strong sexual content","fast draw","street shootout","gunfight","shootout","neo noir","male nudity","roman catholic","female nudity","bare butt","last stand","gun","one man army","main character dies","main character shot","sex in bed","mexican standoff","sniper rifle","opening action scene","long brown hair","brunette","boyfriend girlfriend relationship","hero kills a woman","snow","kiss","log cabin","villain played by lead actor","violence","suspense","man wearing towel","suspicion","death of protagonist","shot in the forehead","gash in the face","guilt","flashback","neck breaking","shooting out tire","red light","cigarette smoking","oral sex","cunnilingus","newspaper clipping","betrayal","fake id","bilingualism","subtitled scene","bare chested male","scene during opening credits","character repeating someone else's dialogue","shot to death","shot in the chest","cabin in the woods","falling off a roof","christian procession","aerial shot","massage","red rose","loading gun","drill press","car repair","assembling a rifle","open air market","sulmona italy","binoculars","brandy","motor scooter","ferry boat","footprints in the snow","chase","very little dialogue","target shooting","target practice","phone booth","push ups","female assassin","abruzzo italy","swimming in underwear","female rear nudity","red panties","see through panties","shot in the stomach","shot in the head","butterfly","criminal","pistol","parade","misfiring gun","gunsmith","rome italy","sex scene","briefcase","gun case","murder","restaurant","photograph","mechanic","train station","sniper","male rear nudity","female frontal nudity","mercury","picnic","river","rifle","silencer","train","tattoo","loneliness","two word title","one last job","independent film","based on novel","character name in title","title spoken by character","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 19:32:40"}}