{"data":{"movies":[{"title":"Oblivion","originalTitle":"","year":"2013","releaseDate":"20130419","directors":[{"name":"Joseph Kosinski","id":"nm2676052"}],"writers":[{"name":"Karl Gajdusek","id":"nm2244980"},{"name":"Michael Arndt","id":"nm1578335"}],"runtime":"124 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMDY0MTA4MF5BMl5BanBnXkFtZTcwNzI3MDgxOQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Mystery","Sci-Fi"],"plot":"One of the few remaining drone repairmen assigned to Earth, its surface devastated after decades of war with the alien Scavs, discovers a crashed spacecraft with contents that bring into question everything he believed about the war, and may even put the fate of mankind in his hands.","simplePlot":"A veteran assigned to extract Earth's remaining resources begins to question what he knows about his mission and himself.","actors":[{"actorName":"Tom Cruise","urlProfile":"http://www.imdb.com/name/nm0000129","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MjM3NTU5M15BMl5BanBnXkFtZTcwMTMyMjAyMg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 July 1962","placeOfBirth":" Syracuse, New York, USA","birthName":"Thomas Cruise Mapother IV","height":"5' 7\" (1.7 m)","bio":"In 1976, if you had told fourteen year-old Franciscan seminary student Thomas Cruise Mapother IV that one day in the not too distant future he would become Tom Cruise, one of the top 100 movie stars of all time, he would have probably grinned and told you that his ambition was to join the priesthood. Nonetheless, this sensitive, deeply religious youngster who was born in 1962 in Syracuse, New York, was destined to be one of the highest paid and most sought after actors in screen history. Tom is the only son (among four children) of nomadic parents, Mary Lee (Pfeiffer), a special education teacher, and Thomas Cruise Mapother III, an electrical engineer. His parents were both from Louisville, Kentucky, and he has German, Irish, and English ancestry. Young Tom spent his boyhood eternally on the move, and by the time he was 14 he had attended 15 different schools in the U.S. and Canada. He finally settled in Glen Ridge, New Jersey, with his mother and her new husband. While in high school, he developed an interest in acting and abandoned his plans of becoming a priest, dropped out of school, and at age 18 headed for New York and a possible acting career. The next 15 years of his life are the stuff of legends. He made his film debut with a small part in Endless Love (1981) and from the outset exhibited an undeniable box office appeal to both male and female audiences. Though below average height and not particularly handsome in the traditional sense, within 5 years Tom Cruise was starring in some of the top grossing films of the 1980s including Top Gun (1986); The Color of Money (1986), Rain Man (1988) and Born on the Fourth of July (1989). By the 1990s he was one of the highest paid actors in the world earning an average 15 million dollars a picture in such blockbuster hits as Interview with the Vampire: The Vampire Chronicles (1994), Mission: Impossible (1996) and Jerry Maguire (1996) for which he received an Academy Award Nomination for best actor. In 1990 he renounced his devout Catholic beliefs and embraced The Church Of Scientology claiming that Scientology teachings had cured him of the dyslexia that had plagued him all of his life. A kind and thoughtful man well known for his compassion and generosity, Tom Cruise is one of the best liked members of the movie community. He was married to actress Nicole Kidman until 2001. Thomas Cruise Mapother IV has indeed come a long way from the lonely wanderings of his youth.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MjM3NTU5M15BMl5BanBnXkFtZTcwMTMyMjAyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000129","name":"Tom Cruise","nicknames":["TC"],"idIMDB":"nm0000129"},"actorId":"nm0000129","character":"Jack","urlCharacter":"http://www.imdb.com/character/ch0380358","main":true},{"actorName":"Morgan Freeman","urlProfile":"http://www.imdb.com/name/nm0000151","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MDMyMzI2OF5BMl5BanBnXkFtZTcwMzM2OTk1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1937","placeOfBirth":" Memphis, Tennessee, USA","height":"6' 2\" (1.88 m)","bio":"With an authoritative voice and calm demeanor, this ever popular American actor has grown into one of the most respected figures in modern US cinema. Morgan was born on June 1, 1937 in Memphis, Tennessee, to Mayme Edna (Revere), a teacher, and Morgan Porterfield Freeman, a barber. The young Freeman attended Los Angeles City College before serving several years in the US Air Force as a mechanic between 1955 and 1959. His first dramatic arts exposure was on the stage including appearing in an all-African American production of the exuberant musical Hello, Dolly!. Throughout the 1970s, he continued his work on stage, winning Drama Desk and Clarence Derwent Awards and receiving a Tony Award nomination for his performance in The Mighty Gents in 1978. In 1980, he won two Obie Awards, for his portrayal of Shakespearean anti-hero Coriolanus at the New York Shakespeare Festival and for his work in Mother Courage and Her Children. Freeman won another Obie in 1984 for his performance as The Messenger in the acclaimed Brooklyn Academy of Music production of Lee Breuer's The Gospel at Colonus and, in 1985, won the Drama-Logue Award for the same role. In 1987, Freeman created the role of Hoke Coleburn in Alfred Uhry's Pulitzer Prize-winning play Driving Miss Daisy, which brought him his fourth Obie Award. In 1990, Freeman starred as Petruchio in the New York Shakespeare Festival's The Taming of the Shrew, opposite Tracey Ullman. Returning to the Broadway stage in 2008, Freeman starred with Frances McDormand and Peter Gallagher in Clifford Odets' drama The Country Girl, directed by Mike Nichols. Freeman first appeared on TV screens as several characters including \"Easy Reader\", \"Mel Mounds\" and \"Count Dracula\" on the Children's Television Workshop (now Sesame Workshop) show The Electric Company (1971). He then moved into feature film with another children's adventure, Who Says I Can't Ride a Rainbow! (1971). Next, there was a small role in the thriller Blade (1973); then he played Casca in Julius Caesar (1979) and the title role in Coriolanus (1979). Regular work was coming in for the talented Freeman and he appeared in the prison dramas Attica (1980) and Brubaker (1980), Eyewitness (1981), and portrayed the final 24 hours of slain Malcolm X in Death of a Prophet (1981). For most of the 1980s, Freeman continued to contribute decent enough performances in films that fluctuated in their quality. However, he really stood out, scoring an Oscar nomination as a merciless hoodlum in Street Smart (1987) and, then, he dazzled audiences and pulled a second Oscar nomination in the film version of Driving Miss Daisy (1989) opposite Jessica Tandy. The same year, Freeman teamed up with youthful Matthew Broderick and fiery Denzel Washington in the epic Civil War drama Glory (1989) about freed slaves being recruited to form the first all-African American fighting brigade. His star continued to rise, and the 1990s kicked off strongly with roles in The Bonfire of the Vanities (1990), Robin Hood: Prince of Thieves (1991), and La puissance de l'ange (1992). Freeman's next role was as gunman Ned Logan, wooed out of retirement by friend William Munny to avenge several prostitutes in the wild west town of Big Whiskey in Clint Eastwood's de-mythologized western Unforgiven (1992). The film was a sh and scored an acting Oscar for Gene Hackman, a directing Oscar for Eastwood, and the Oscar for best picture. In 1993, Freeman made his directorial debut on Bopha! (1993) and soon after formed his production company, Revelations Entertainment. More strong scripts came in, and Freeman was back behind bars depicting a knowledgeable inmate (and obtaining his third Oscar nomination), befriending falsely accused banker Tim Robbins in The Shawshank Redemption (1994). He was then back out hunting a religious serial killer in Se7en (1995), starred alongside Keanu Reeves in Chain Reaction (1996), and was pursuing another serial murderer in Kiss the Girls (1997). Further praise followed for his role in the slave tale of Amistad (1997), he was a worried US President facing Armageddon from above in Deep Impact (1998), appeared in Neil LaBute's black comedy Nurse Betty (2000), and reprised his role as Alex Cross in Along Came a Spider (2001). Now highly popular, he was much in demand with cinema audiences, and he co-starred in the terrorist drama The Sum of All Fears (2002), was a military officer in the Stephen King-inspired Dreamcatcher (2003), gave divine guidance as God to Jim Carrey in Bruce Almighty (2003), and played a minor role in the comedy The Big Bounce (2004). 2005 was a huge year for Freeman. First, he he teamed up with good friend Clint Eastwood to appear in the drama, Million Dollar Baby (2004). Freeman's on-screen performance is simply world-class as ex-prize fighter Eddie \"Scrap Iron\" Dupris, who works in a run-down boxing gym alongside grizzled trainer Frankie Dunn, as the two work together to hone the skills of never-say-die female boxer Hilary Swank. Freeman received his fourth Oscar nomination and, finally, impressed the Academy's judges enough to win the Best Supporting Actor Oscar for his performance. He also narrated Steven Spielberg's War of the Worlds (2005) and appeared in Batman Begins (2005) as Lucius Fox, a valuable ally of Christian Bale's Bruce Wayne/Batman for director Christopher Nolan. Freeman would reprise his role in the two sequels of the record-breaking, genre-redefining trilogy. Roles in tentpoles and indies followed; highlights include his role as a crime boss in Lucky Number Slevin (2006), a second go-round as God in Evan Almighty (2007) with Steve Carell taking over for Jim Carrey, and a supporting role in Ben Affleck's directorial debut, Gone Baby Gone (2007). He co-starred with Jack Nicholson in the breakout hit The Bucket List (2007) in 2007, and followed that up with another box-office success, Wanted (2008), then segued into the second Batman film, The Dark Knight (2008). In 2009, he reunited with Eastwood to star in the director's true-life drama Invictus (2009), on which Freeman also served as an executive producer. For his portrayal of Nelson Mandela in the film, Freeman garnered Oscar, Golden Globe and Critics' Choice Award nominations, and won the National Board of Review Award for Best Actor. Recently, Freeman appeared in RED (2010), a surprise box-office hit; he narrated the Conan the Barbarian (2011) remake, starred in Rob Reiner's The Magic of Belle Isle (2012); and capped the Batman trilogy with The Dark Knight Rises (2012). Freeman has several films upcoming, including the thriller Now You See Me (2013), under the direction of Louis Leterrier, and the science fiction actioner Oblivion (2013), in which he stars with Tom Cruise.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MDMyMzI2OF5BMl5BanBnXkFtZTcwMzM2OTk1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000151","name":"Morgan Freeman","idIMDB":"nm0000151"},"actorId":"nm0000151","character":"Beech","urlCharacter":"http://www.imdb.com/character/ch0380361","main":true},{"actorName":"Olga Kurylenko","urlProfile":"http://www.imdb.com/name/nm1385871","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzIwMjY1OF5BMl5BanBnXkFtZTcwNzA3MDkwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 November 1979","placeOfBirth":" Berdyansk, Zaporozhye Oblast, Ukrainian SSR, USSR [now Zaporizhia Oblast, Ukraine]","birthName":"Olga Konstantinovna Kurylenko","height":"5' 8½\" (1.74 m)","bio":"Olga Kurylenko, a Ukrainian-born actress and model, went from sharing a cramped flat with her aunt, uncle, grandparents and cousin to starring as a Bond girl opposite Daniel Craig. She was born Olga Konstantinovna Kurylenko on November 14, 1979, in Berdyansk, Ukraine, Soviet Union. Her mother, Marina Alyabysheva, divorced her father, Konstantin Kurylenko, soon after her birth. After the divorce her mother struggled to survive as an art teacher. Young Olga was brought up by her mother and her grandmother, Raisa. During her youth Olga had the humbling experience of living in poverty; she had no choice but to wear rags and had to darn the holes on her sweater. During her years in Ukraine she studied art and languages and spent seven years studying piano at a local school of music in Berdyansk. She also went to a ballet studio until 13. At age 13 Olga and her mother made a trip to Moscow. There she was spotted by an agent, who approached her at a subway station and offered her a job as a model. Initially Olga's mother was suspicious, but she checked the agent's credentials and eventually allowed Olga to accept training as a model in Moscow, which turned out to be a good career choice. By age 16 she was ready for the next step. She moved to Paris, learned French in six months and was signed by the Madison agency. At age 18 she appeared on the cover of Glamour, and in short order graced the covers of Elle, Madame Figaro, Marie Claire, and Vogue. She also became the face of Lejaby lingerie, Bebe clothing, Clarins and Helena Rubinstein cosmetic companies. In 1999 Olga married French photographer Cedric Van Mol, but divorced him 3-1/2 years later. One day Olga presented herself to an acting agency. Eventually she swapped the catwalk for the movie screen, and her acting career took off. In 2005 she made her film debut as \"Iris\", a sensual beauty, in The Ring Finger (2005), by director Diane Bertrand. Olga's cinematic roles have been notably steamy, and her natural beauty and explicit nudity attracted the attention of the male audiences. She appeared opposite Elijah Wood in Paris, je t'aime (2006) and as \"Sofia\" in The Serpent (2006), then co-starred as Russian beauty \"Nika Boronina\" opposite Timothy Olyphant in Hitman (2007). She also appeared as \"Mina Harud\" in the indie surveillance-thriller Tyranny (2008). On Christmas Eve 2007, Olga was offered to play what will become her biggest hit: co-starring as \"Camille\", the Bond girl, opposite Daniel Craig in Quantum of Solace (2008), a sequel to Casino Royale (2006). With the international success as Bond Girl, Olga also made appearances on various TV productions in Russia and Ukraine. In 2012, Olga Kurylenko was cast as Julia, supporting role in the Sci-Fi adventure Oblivion (2013) opposite Tom Cruise and Morgan Freeman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzIwMjY1OF5BMl5BanBnXkFtZTcwNzA3MDkwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1385871","name":"Olga Kurylenko","idIMDB":"nm1385871"},"actorId":"nm1385871","character":"Julia","urlCharacter":"http://www.imdb.com/character/ch0380359","main":true},{"actorName":"Andrea Riseborough","urlProfile":"http://www.imdb.com/name/nm2057859","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MTUzNDAwN15BMl5BanBnXkFtZTcwMjA0NjcyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 November 1981","placeOfBirth":" Newcastle upon Tyne, Northumberland, England, UK","birthName":"Andrea Louise Riseborough","height":"5' 5½\" (1.66 m)","bio":"Andrea Riseborough was born on November 20, 1981 in Newcastle upon Tyne, Northumberland, England as Andrea Louise Riseborough. She is an actress, known for Birdman or (The Unexpected Virtue of Ignorance) (2014), Oblivion (2013) and Nocturnal Animals (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MTUzNDAwN15BMl5BanBnXkFtZTcwMjA0NjcyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2057859","name":"Andrea Riseborough","idIMDB":"nm2057859"},"actorId":"nm2057859","character":"Victoria","urlCharacter":"http://www.imdb.com/character/ch0380360","main":true},{"actorName":"Nikolaj Coster-Waldau","urlProfile":"http://www.imdb.com/name/nm0182666","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MzkzOTk0NF5BMl5BanBnXkFtZTcwNjU5NTgzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1970","placeOfBirth":" Rudkøbing, Denmark","height":"6' 2\" (1.88 m)","bio":"Nikolaj Coster-Waldau was born on July 27, 1970 in Rudkøbing, Denmark. He is an actor and producer, known for Game of Thrones (2011), Oblivion (2013) and Mama (2013). He has been married to Nukâka since 1998. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MzkzOTk0NF5BMl5BanBnXkFtZTcwNjU5NTgzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0182666","name":"Nikolaj Coster-Waldau","idIMDB":"nm0182666"},"actorId":"nm0182666","character":"Sykes","urlCharacter":"http://www.imdb.com/character/ch0381169","main":true},{"actorName":"Melissa Leo","urlProfile":"http://www.imdb.com/name/nm0502425","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDAxOTkyOF5BMl5BanBnXkFtZTcwOTg1MDIzNA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1960","placeOfBirth":" New York City, New York, USA","birthName":"Melissa Chessington Leo","height":"5' 4\" (1.63 m)","bio":"Melissa Leo was born on September 14, 1960 in New York City, New York, USA as Melissa Chessington Leo. She is an actress and producer, known for The Fighter (2010), Prisoners (2013) and Snowden (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDAxOTkyOF5BMl5BanBnXkFtZTcwOTg1MDIzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0502425","name":"Melissa Leo","idIMDB":"nm0502425"},"actorId":"nm0502425","character":"Sally","urlCharacter":"http://www.imdb.com/character/ch0403995","main":true},{"actorName":"Zoë Bell","urlProfile":"http://www.imdb.com/name/nm1057928","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNzk4MjQ4MF5BMl5BanBnXkFtZTcwMTQwOTMzOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1978","placeOfBirth":" Waiheke Island, Auckland, New Zealand","height":"5' 8\" (1.73 m)","bio":"As an established and extremely talented stunt double and actress, Zoe Bell has made a name for herself through her unparalleled dedication, skills, and focus. Zoe Bell was born on Waiheke Island, New Zealand, to Tish, a nurse, and Andrew Bell, a doctor. She has a background in gymnastics and martial arts. She began working as a stunt woman when she doubled Lucy Lawless on the cult favorite TV series Xena: Warrior Princess (1995). Bell also appeared as a double in the ABC thriller Alias (2001) and on an episode of Cleopatra 2525 in 2000 as a double for Vicki Pratti. In the action packed-documentary Double Dare (2004), Bell, along with legendary stunt-woman Jeannie Epper, give an insight into the career of women who take falls and punches for a living. Double Dare also gives a glimpse into the struggles of stunt-women to stay thin, employed, and sane in a male-dominated career. After the cancellation of Alias, Bell's next gig was working with Quentin Tarantino in Kill Bill: Vol. 1 (2003) and Kill Bill: Vol. 2 (2004), playing the stunt double for Uma Thurman's role, The Bride. Bell was nominated for her work in Kill Bill, Vol. 1 in the categories of Best Stunt by a Stunt Woman and Best Fight for the Taurus World Stunt Awards, both of which she would win the following year for Kill Bill: Vol. 2. Bell also showed off her stunt-woman skills as a double for Sharon Stone in Halle Barry's Catwoman (2004). Bell was injured in the final days of filming, requiring surgery, but she has since recovered and returned to work. Bell appeared along with legendary stunt woman Jeannie Epper in Amanda Micheli's acclaimed documentary Double Dare (2004), which offers a glimpse at the lives and careers of both women, as well as the friendship they share. Bell debuted her acting career, with her already famous stunt skills, in the double feature Grindhouse (2007) written by Quentin Tarantino and Robert Rodriguez. She was hand-picked, by Tarentino himself, to star in his segment of the double feature, Death Proof, about four women working on the movie set of their next big hit. All seems to be going well on set until a psychotic killer begins to stalk them. Bell, a native of New Zealand, resides in Los Angeles but hopes to someday own a home in New Zealand.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNzk4MjQ4MF5BMl5BanBnXkFtZTcwMTQwOTMzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1057928","name":"Zoë Bell","nicknames":["Zoe the Cat"],"idIMDB":"nm1057928"},"actorId":"nm1057928","character":"Kara","urlCharacter":"http://www.imdb.com/character/ch0382834","main":true},{"actorName":"Abigail Lowe","urlProfile":"http://www.imdb.com/name/nm5608720","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Abigail Lowe yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5608720","name":"Abigail Lowe","idIMDB":"nm5608720"},"actorId":"nm5608720","character":"Julia's Child","urlCharacter":"http://www.imdb.com/character/ch0454324","main":true},{"actorName":"Isabelle Lowe","urlProfile":"http://www.imdb.com/name/nm5607698","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Isabelle Lowe yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5607698","name":"Isabelle Lowe","idIMDB":"nm5607698"},"actorId":"nm5607698","character":"Julia's Child","urlCharacter":"http://www.imdb.com/character/ch0454324","main":true},{"actorName":"David Madison","urlProfile":"http://www.imdb.com/name/nm3517905","urlPhoto":"","biography":{"bio":"David Madison is an actor, known for Oblivion (2013), Saints Row: The Third (2011) and Splinter (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3517905","name":"David Madison","idIMDB":"nm3517905"},"actorId":"nm3517905","character":"Grow Hall Survivor","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1483013","urlIMDB":"http://www.imdb.com/title/tt1483013","business":{"budget":{"money":"$120,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$37,054,485","country":"USA","day":"21","month":"04","year":"2013","remarks":"3,783 Screens"},{"money":"HUF 55,190,108","country":"Hungary","day":"14","month":"04","year":"2013","remarks":"46 Screens"}],"gross":[{"money":"$89,021,735","country":"USA","day":"23","month":"06","year":"2013","remarks":""},{"money":"$88,777,890","country":"USA","day":"16","month":"06","year":"2013","remarks":""},{"money":"$88,473,925","country":"USA","day":"09","month":"06","year":"2013","remarks":""},{"money":"$88,067,670","country":"USA","day":"02","month":"06","year":"2013","remarks":""},{"money":"$87,503,895","country":"USA","day":"26","month":"05","year":"2013","remarks":""},{"money":"$85,588,010","country":"USA","day":"19","month":"05","year":"2013","remarks":""},{"money":"$81,906,280","country":"USA","day":"12","month":"05","year":"2013","remarks":""},{"money":"$75,814,250","country":"USA","day":"05","month":"05","year":"2013","remarks":""},{"money":"$65,090,925","country":"USA","day":"28","month":"04","year":"2013","remarks":""},{"money":"$37,054,485","country":"USA","day":"21","month":"04","year":"2013","remarks":""}],"weekendGross":[{"money":"$136,680","country":"USA","day":"23","month":"06","year":"2013","remarks":"201 Screens"},{"money":"$183,180","country":"USA","day":"16","month":"06","year":"2013","remarks":"258 Screens"},{"money":"$247,475","country":"USA","day":"09","month":"06","year":"2013","remarks":"298 Screens"},{"money":"$394,705","country":"USA","day":"02","month":"06","year":"2013","remarks":"357 Screens"},{"money":"$869,990","country":"USA","day":"26","month":"05","year":"2013","remarks":"572 Screens"},{"money":"$2,337,050","country":"USA","day":"19","month":"05","year":"2013","remarks":"2,077 Screens"},{"money":"$4,114,665","country":"USA","day":"12","month":"05","year":"2013","remarks":"2,770 Screens"},{"money":"$5,642,335","country":"USA","day":"05","month":"05","year":"2013","remarks":"3,430 Screens"},{"money":"$17,803,425","country":"USA","day":"28","month":"04","year":"2013","remarks":"3,792 Screens"},{"money":"$37,054,485","country":"USA","day":"21","month":"04","year":"2013","remarks":"3,783 Screens"}],"admissions":[{"money":"117,837","country":"Portugal","day":"19","month":"06","year":"2013","remarks":""},{"money":"117,125","country":"Portugal","day":"12","month":"06","year":"2013","remarks":""},{"money":"116,089","country":"Portugal","day":"05","month":"06","year":"2013","remarks":""},{"money":"111,531","country":"Portugal","day":"29","month":"05","year":"2013","remarks":""},{"money":"109,482","country":"Portugal","day":"22","month":"05","year":"2013","remarks":""},{"money":"106,215","country":"Portugal","day":"15","month":"05","year":"2013","remarks":""},{"money":"102,401","country":"Portugal","day":"08","month":"05","year":"2013","remarks":""},{"money":"93,044","country":"Portugal","day":"01","month":"05","year":"2013","remarks":""},{"money":"71,565","country":"Portugal","day":"24","month":"04","year":"2013","remarks":""},{"money":"46,203","country":"Portugal","day":"17","month":"04","year":"2013","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"12","month":"03","year":"2012","remarks":null},{"money":null,"country":null,"day":"14","month":"07","year":"2012","remarks":null}],"copyrightHolder":"Copyright © 2013 Universal Studios. All Rights Reserved."},"technical":{"runtime":["2 hr 4 min (124 min)"],"soundMix":["SDDS","Datasat","Dolby Digital","Dolby Atmos"],"color":["Color (ACES)"],"aspectRatio":["1.89 : 1 (IMAX version)","2.35 : 1"],"camera":["Red Epic, Zeiss Master Prime and Fujinon Premier Lenses","Sony CineAlta F65, Zeiss Master Prime and Fujinon Premier Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA (color)","Technicolor, Hollywood (CA), USA (digital intermediate)"],"filmLength":["3,408 m (Portugal, 35 mm)"],"negativeFormat":["Redcode RAW","SRMemory"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","F65 RAW (4K) (source format)","Redcode RAW (5K) (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","70 mm (horizontal) (IMAX DMR blow-up) (Kodak Vision 2383)","D-Cinema"]},"rating":"7.0","metascore":"54","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"PG-13","awards":[{"award":"Alliance of Women Film Journalists 2013","titlesAwards":[{"titleAwardOutcome":"Nominated EDA Special Mention Award","categories":[{"category":"Most Egregious Age Difference Between the Leading Man and the Love Interest","names":[{"name":"Tom Cruise","id":"nm0000129","role":null},{"name":"Olga Kurylenko","id":"nm1385871","role":null},{"name":"Andrea Riseborough","id":"nm2057859","role":null}]}]}]},{"award":"Art Directors Guild 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Excellence in Production Design Award","categories":[{"category":"Fantasy Film","names":[{"name":"Darren Gilford","id":"nm0318521","role":"production designer"},{"name":"Kevin Ishioka","id":"nm0411131","role":"supervising art director"},{"name":"Mark W. Mansbridge","id":"nm0543729","role":"art director"},{"name":"Kevin Loo","id":"nm0519608","role":"set designer"},{"name":"Todd Cherniawsky","id":"nm0155907","role":"set designer"},{"name":"Steve Cooper","id":"nm0178394","role":"set designer"},{"name":"Joseph Hiura","id":"nm3107972","role":"set designer"},{"name":"Luis G. Hoyos","id":"nm0398432","role":"set designer"},{"name":"Geoff Hubbard","id":"nm4488439","role":"set designer"},{"name":"Jeff Markwith","id":"nm0549047","role":"set designer"},{"name":"Maya Shimoguchi","id":"nm0793717","role":"set designer"},{"name":"Robert Andrew Johnson","id":"nm2051492","role":"set designer"},{"name":"Gregory Jein","id":"nm0420478","role":"set design model maker"},{"name":"Ellen Lampl","id":"nm1122713","role":"graphic designer"},{"name":"Igor Knezevic","id":"nm2251995","role":"concept illustrator"},{"name":"Jim Martin","id":"nm0552515","role":"concept illustrator"},{"name":"Nick Pugh","id":"nm0700056","role":"concept illustrator"},{"name":"Daniel Simon","id":"nm3229579","role":"concept illustrator"},{"name":"Thom Tenery","id":"nm5338237","role":"concept illustrator"},{"name":"Andree Wallin","id":"nm4870384","role":"concept illustrator"},{"name":"Richard Bennett","id":"nm1635540","role":"storyboard artist"},{"name":"Phillip Norwood","id":"nm0636404","role":"storyboard artist"},{"name":"Adolfo Martínez Pérez","id":"nm0553439","role":"storyboard artist"},{"name":"Stephen Platt","id":"nm1792312","role":"storyboard artist"},{"name":"Ronald R. Reiss","id":"nm0718521","role":"set decorator"}]}]}]},{"award":"Golden Schmoes Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Best Sci-Fi Movie of the Year","names":[]}]}]},{"award":"Golden Trailer Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Action","names":[{"name":"Universal Pictures","id":null,"role":null},{"name":"Picture Production Company","id":null,"role":null}]}]}]},{"award":"Hollywood Post Alliance, US 2013","titlesAwards":[{"titleAwardOutcome":"Nominated HPA Awards","categories":[{"category":"Outstanding Color Grading - Feature Film","names":[{"name":"Mike Sowa","id":"nm1236353","role":null},{"name":"Technicolor","id":null,"role":null}]}]}]},{"award":"Phoenix Film Critics Society Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated PFCS Award","categories":[{"category":"Best Visual Effects","names":[]},{"category":"Best Stunts","names":[]}]}]},{"award":"Rondo Hatton Classic Horror Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Rondo Statuette","categories":[{"category":"Best Film","names":[{"name":"Joseph Kosinski","id":"nm2676052","role":null}]}]}]},{"award":"Seattle Film Critics Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Seattle Film Critics Award","categories":[{"category":"Best Visual Effects","names":[{"name":"Eric Barba","id":"nm0053146","role":null},{"name":"Björn Mayer","id":"nm0562340","role":null}]}]}]},{"award":"Teen Choice Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie: Sci-Fi/Fantasy","names":[]},{"category":"Choice Movie Actor: Sci-Fi/Fantasy","names":[{"name":"Tom Cruise","id":"nm0000129","role":null}]}]}]},{"award":"World Soundtrack Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated World Soundtrack Award","categories":[{"category":"Best Original Song Written Directly for a Film","names":[{"name":"Anthony Gonzalez","id":"nm2288264","role":"music and lyrics by"},{"name":"Susanne Sundfør","id":"nm4295943","role":"music, lyrics, and performed by"},{"name":"M83","id":"nm3684489","role":"performed by"}]},{"category":"Discovery of the Year","names":[{"name":"Anthony Gonzalez","id":"nm2288264","role":null},{"name":"Joseph Trapanese","id":"nm2468967","role":null}]}]}]}],"votes":"407,446","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"},{"idCompany":"co0142678","name":"Relativity Media"},{"idCompany":"co0441953","name":"Monolith Pictures (III)"}],"keywords":{"keywords":["post apocalypse","cabin in the woods","drone","flying through a thunderstorm","vertical takeoff","stadium","motorcycle","swimming pool","flashback","black and white scene","sex in a pool","alien","memory","surveillance","space station","erased memory","knife","lightning","suspense","female nudity","man falling","cryonics","skyscraper","booby trap","rappelling","stray dog","motorcycle riding","maintenance","aerial drone","pistol","2070s","alien invasion","human versus alien","swimming underwater","skinny dipping","chewing gum","veteran","memory games","underwater kiss","jet aircraft","one last job","fistfight","neo 80s","melodrama","shot in the head","shot in the back","shot to death","shot in the chest","binoculars","threatened with a knife","surrealism","fighting with self","knife fight","space travel","ambush","telescope","love triangle","laser","lasersight","hanging upside down","abandoned library","sniper rifle","robot","sniper","spacesuit","nasa","female astronaut","electrocution","revelation","warrior","cigar smoking","self sacrifice","violence","death","murder","altered version of studio logo","space shuttle","astronaut","mexican standoff","painting","drawing","vinyl","forest","woods","battle","combat","brawl","fight","white house","dog","boyfriend girlfriend relationship","husband wife relationship","karate","martial arts","hand to hand combat","kissing while having sex","kiss","redhead","gunfight","opening action scene","empire state building manhattan new york city","amnesia","romantic rejection","shot in the belly","mid air collision","deception","tear on cheek","spaceship crash","friendly fire","goalpost","yankees baseball cap","titan the moon","waterfall","nightmare","year 2077","starts with narration","narrated by character","spaceship","ex soldier","resistance","resistance fighter","crash landing","shootout","machine gun","hologram","future","nuclear explosion","nuclear bomb","mushroom cloud","fictional war","desert","dystopia","fight the system","social commentary","cyberpunk","electronic music score","no opening credits","terraforming","genetic engineering","cloning","clone","air battle","aircraft","dream","new york city","brooklyn bridge","washington monument","artificial intelligence","exploding body","explosion","exploding ship","voice over narration","shower","bare chested male","outer space","written by director","based on comic book","soldier","one word title","surprise ending","engagement ring","two in a shower","premarital sex","whitehouse","pentagon","washington d.c."]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:09:03"}}