{"data":{"movies":[{"title":"Eating Out: All You Can Eat","originalTitle":"","year":"2009","releaseDate":"20091009","directors":[{"name":"Glenn Gaylord","id":"nm0310935"}],"writers":[{"name":"Phillip J. Bartell","id":"nm0058442"},{"name":"Q. Allan Brocka","id":"nm0110654"}],"runtime":"80 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3MDg3MzMwOV5BMl5BanBnXkFtZTgwNTg3MjcyODE@._V1.jpg","countries":["USA"],"languages":["English","Vietnamese"],"genres":["Comedy","Drama","Romance"],"plot":"Tiffani and her friend Casey try to lure the gorgeous Zack with a phony online profile using the image of Tiffani's buff ex, Ryan... which works fine until the real Ryan shows up. Only through some fancy footwork, advice from his Aunt Helen and mentor Harry, and a daring sexual escapade can Casey figure out how to set things right and perhaps even find the love he's been seeking.","simplePlot":"A gay Internet connection is made, but entanglements ensue due to hiding behind the name and photo of a straight male stripper who happens to return to the area.","actors":[{"actorName":"Rebekah Kochan","urlProfile":"http://www.imdb.com/name/nm1407022","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODEwMDEyNjczMl5BMl5BanBnXkFtZTcwMTM5NzI1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1984","placeOfBirth":" Las Vegas, Nevada, USA","height":"5' 7\" (1.7 m)","bio":"Rebekah Kochan was born in Las Vegas, Nevada. She began her acting career at age 9, when she played the lead in a local Las Vegas production of \"Annie\". Rebekah Kochan left Las Vegas at 17 to follow her dreams in Hollywood. Within her first month in Los Angeles, she landed lead roles in films. She has starred in numerous horror films. At any video store in the country, her face is the most prevalent in any horror aisle. She is also the most well-known female actress in gay films. She was the star of the highest grossing gay comedy film trilogy in history, the \"Eating Out\" series. She has gone on to star in many more gay films, since. Her fan base is huge. Every year, she receives e-mails, letters and gifts from thousands of fans all over the world. She is not only a great actress but you fall in love with her when she is on-screen. Rebekah is also one of the top female stand-up comedians in the country. She and her boyfriend, Dante (Last Comic Standing (2003)) travel all over the country, performing to hundreds of thousands of people each year. Her comedy timing in film and on stage are impeccable. She is one of the only comedians in the world who can get a laugh just from a facial expression. There has been no one better at this since Lucille Ball. With her beauty, talent and professionalism, Rebekah Kochan is destined to be the next big star of our time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODEwMDEyNjczMl5BMl5BanBnXkFtZTcwMTM5NzI1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1407022","name":"Rebekah Kochan","idIMDB":"nm1407022"},"actorId":"nm1407022","character":"Tiffani von der Sloot","urlCharacter":"http://www.imdb.com/character/ch0185695","main":true},{"actorName":"Daniel Skelton","urlProfile":"http://www.imdb.com/name/nm3538440","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NjE0NTA2NF5BMl5BanBnXkFtZTcwNzg0OTMxOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Daniel Skelton is an actor, known for Eating Out: All You Can Eat (2009), Eating Out: Drama Camp (2011) and Eating Out: The Open Weekend (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NjE0NTA2NF5BMl5BanBnXkFtZTcwNzg0OTMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3538440","name":"Daniel Skelton","idIMDB":"nm3538440"},"actorId":"nm3538440","character":"Casey","urlCharacter":"http://www.imdb.com/character/ch0185714","main":true},{"actorName":"Chris Salvatore","urlProfile":"http://www.imdb.com/name/nm3162943","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0NDU3NDEwODleQTJeQWpwZ15BbWU4MDM3NjQxNjQx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 May 1985","placeOfBirth":"","height":"6' 3\" (1.91 m)","bio":"Chris Salvatore grew up in Richboro, Pennsylvania, a small town outside Philadelphia. He started his career in entertainment as a singer/songwriter. In 2005 he studied vocal performance at Berklee College of Music in Boston. His music has been featured on MTV and is available in online music stores including iTunes. Chris graduated from The New York Conservatory for Dramatic Arts in 2008 where he studied acting. He starred in the romantic comedy 'Eating Out: All You Can Eat' directed by Q. Allan Brocka in 2009. Chris then went on to star in two more 'Eating Out' sequels adding to the franchise that premiered on the LOGO Network. Chris's latest project was his debut in the New York theatre scene in the new original play, Pieces. Pieces captured rave reviews from NY audiences following it's sold out run in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0NDU3NDEwODleQTJeQWpwZ15BbWU4MDM3NjQxNjQx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3162943","name":"Chris Salvatore","idIMDB":"nm3162943"},"actorId":"nm3162943","character":"Zack","urlCharacter":"http://www.imdb.com/character/ch0185715","main":true},{"actorName":"Michael E.R. Walker","urlProfile":"http://www.imdb.com/name/nm3557534","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MTE0MDQ0M15BMl5BanBnXkFtZTgwNjc5NTgzOTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Michael E.R. Walker is an actor, known for Eating Out: All You Can Eat (2009), Wish Makers of West Hollywood (2010) and I Do (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MTE0MDQ0M15BMl5BanBnXkFtZTgwNjc5NTgzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3557534","name":"Michael E.R. Walker","idIMDB":"nm3557534"},"actorId":"nm3557534","character":"Ryan","urlCharacter":"http://www.imdb.com/character/ch0185716","main":true},{"actorName":"Julia Cho","urlProfile":"http://www.imdb.com/name/nm2971227","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MzM2OTg5MF5BMl5BanBnXkFtZTgwOTM1NjE2MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 2\" (1.57 m)","bio":"Julia Cho is an actress and producer, known for The Lizzie Bennet Diaries (2012), Larry Crowne (2011) and Eating Out: All You Can Eat (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MzM2OTg5MF5BMl5BanBnXkFtZTgwOTM1NjE2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2971227","name":"Julia Cho","idIMDB":"nm2971227"},"actorId":"nm2971227","character":"Tandy","urlCharacter":"http://www.imdb.com/character/ch0185717","main":true},{"actorName":"Mink Stole","urlProfile":"http://www.imdb.com/name/nm0831467","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MjI2MzAyMV5BMl5BanBnXkFtZTcwOTI5NzkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1947","placeOfBirth":" Baltimore, Maryland, USA","birthName":"Nancy Paine Stoll","height":"5' 4\" (1.63 m)","bio":"Part of the original motley crew of cast players in underground shock master John Waters' bare-bones 8mm, 16mm and 35mm cult perversions during the late 60s and early 70s, Mink Stole was born Nancy Stoll in the late 1940s in Baltimore, Maryland. Waters took her under his wing in 1966 wherein she started \"acting out\" a number of his deviant creations for gross-out effect alongside other outré members that included transvestite actor Divine, Mary Vivian Pearce, David Lochary, Cookie Mueller and the not-to-be-believed grande dame Edith Massey. Calling themselves the Dreamland Players, Stole would become known as both the hysterical foil and vengeful nemesis of \"leading lady\" Divine, playing her annoying repulsive characters as pure evil incarnate. Her role in the infamous Pink Flamingos (1972) as Connie Marble, the carrot-domed villain complete with outlandish cats-eye glasses and seedy fur coat, set the tone for her subsequent gallery of grotesques, including the tantrum-throwing girl-child Taffy Davenport in Female Trouble (1974), murderous housewife-on-the-lam Peggy Gravel in Desperate Living (1977), and corn-rowed hussy Sandra Sullivan in Polyester (1981), which was the first Waters film to star a legit actor -- Tab Hunter. Stole's movie time in Waters' campfests would grow less and less as his movies/parodies grew more and more mainstream, but she remained an altruistic player for Waters nevertheless, appearing in nearly every one of his films. In 1994, she did bits in his wide releases of Hairspray (1988), Cry-Baby (1990), Serial Mom (1994), Cecil B. Demented (2000), and, his most recent, A Dirty Shame (2004). She appeared in numerous tongue-in-cheek cameos for other dubious directing talents as well with tacky, tawdry titles that begged for straight-to-video release. Over the years, Stole has made the rounds on the experimental stage. She played Van Helsing in a production of \"Dracula\" and the title papal role in \"Sister Mary Ignatius Explains It All for You,\" not to mention bizarre, contemporary treatments of the Bard's \"A Midsummer Night's Dream\" and \"A Winter's Tale.\" She recently attracted some attention in the play \"Sleeping with Straight Men\" which was seen on both coasts from 2002-2004. On the sly she has written an advice column, of all things, called \"Think Mink\" for a Baltimore newspaper. Mink Stole continues to reign as a prime film outlaw, having just completed a role in Another Gay Movie (2006) playing a character named Sloppi Seconds. Need I say more?","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MjI2MzAyMV5BMl5BanBnXkFtZTcwOTI5NzkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0831467","name":"Mink Stole","idIMDB":"nm0831467"},"actorId":"nm0831467","character":"Helen","urlCharacter":"http://www.imdb.com/character/ch0185718","main":true},{"actorName":"Leslie Jordan","urlProfile":"http://www.imdb.com/name/nm0430074","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NTc5ODUxN15BMl5BanBnXkFtZTcwMTU0NzYyNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1955","placeOfBirth":" Memphis, Tennessee, USA","birthName":"Leslie Allen Jordan","height":"4' 11\" (1.5 m)","bio":"For such a diminutive (4' 11\") frame, character actor Leslie Jordan has a tall propensity for scene-stealing. He hails from the South, as his dead-giveaway drawl quickly exposes, and was raised in a highly conservative, deeply religious atmosphere in Chattanooga, Tennessee. His father, a Lieutenant Colonel with the Army, was killed in a plane crash when he was only 11. Uncertain about his direction in life, an inescapable talent for high camp, not to mention an impish mug and pocket-sized structure ideal for commercials, must have inspired Leslie enough to risk taking on Hollywood in 1982. Following training with acting coach Carolyn Barry, who ran the Professional Artist's Group during the 80s, he became highly marketable in commercial spots. TV would invariably be the next step. In the midst of it all he involved himself deeply in writing. Avid L.A. theatergoers will probably recognize him for such prone-to-misfit characters as Brother Boy, an institutionalized drag queen, in \"Sordid Lives,\" and Peanut, a habitual barfly, in \"Southern Baptist Sissies.\" His own one-man testimonials, such as the off-Broadway \"Hysterical Blindness\" and the more recent \"Like a Dog on Linoleum,\" show an actor quite adept at baring his soul and exposing his childhood agonies on stage amidst laughter and tears. These shows came at a price, however. A self-proclaimed substance abuser and sexaholic, Jordan spent jail time more than once for DUI before facing his inner demons and reaching full recovery (since 1996). In the end he has reaped the rewards of comedy success. In lowbudget film projects since 1988, he has been part of such off-the-wall material as Frankenstein General Hospital (1988), Black Velvet Pantsuit (1995) and Farm Sluts (2003), to name a few. He has also experienced the joy of seeing one of his own writing projects come to full fruition with the film Lost in the Pershing Point Hotel (2000). He was also given the chance to recreate his Big Brother role in Sordid Lives (2000) to the big screen. TV has been an exceptionally inviting medium over the years with a number of fun, flouncy roles coming his way. Noted for his catchy guest work on \"Murphy Brown\" and \"Lois & Clark,\" among others, he was also a series regular on Reasonable Doubts (1991) and Hearts Afire (1992). These days Leslie has a wonderfully wicked recurring role as a (very) small thorn in Megan Mullally's side on the popular Will & Grace (1998) sitcom. Playing the snide, mincing and unconvincingly homophobic hanger-on Beverley Leslie, the actor plays the hilarity up for all its worth. At other times his loser types have proved quite touching, if pathetic, in offbeat drama.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NTc5ODUxN15BMl5BanBnXkFtZTcwMTU0NzYyNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0430074","name":"Leslie Jordan","idIMDB":"nm0430074"},"actorId":"nm0430074","character":"Harry","urlCharacter":"http://www.imdb.com/character/ch0185719","main":true},{"actorName":"John Stallings","urlProfile":"http://www.imdb.com/name/nm1745471","urlPhoto":"","biography":{"bio":"John Stallings is an actor, known for The Janice Dickinson Modeling Agency (2006), Manhunt: The Search for America's Most Gorgeous Male Model (2004) and Cleaning Up the Plate: The Making of 'Eating Out 3' (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1745471","name":"John Stallings","idIMDB":"nm1745471"},"actorId":"nm1745471","character":"Lionel","urlCharacter":"http://www.imdb.com/character/ch0185720","main":true},{"actorName":"Maximiliano Torandell","urlProfile":"http://www.imdb.com/name/nm2746389","urlPhoto":"","biography":{"bio":"Maximiliano Torandell is known for his work on Eating Out: All You Can Eat (2009), The Trap (2007) and What's Up with Your Friend? (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2746389","name":"Maximiliano Torandell","idIMDB":"nm2746389"},"actorId":"nm2746389","character":"Ernesto","urlCharacter":"http://www.imdb.com/character/ch0185721","main":true},{"actorName":"Sumalee Montano","urlProfile":"http://www.imdb.com/name/nm0599019","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQzMTgzMjU5M15BMl5BanBnXkFtZTgwOTE3OTg3NjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 August 1972","placeOfBirth":" Columbus, Ohio, USA","bio":"Sumalee Montano was born on August 3, 1972 in Columbus, Ohio, USA. She is an actress, known for 10 Cloverfield Lane (2016), Transformers Prime (2010) and Justice League: Throne of Atlantis (2015). She has been married to Craig Zimmerman since June 18, 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQzMTgzMjU5M15BMl5BanBnXkFtZTgwOTE3OTg3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0599019","name":"Sumalee Montano","idIMDB":"nm0599019"},"actorId":"nm0599019","character":"Pam","urlCharacter":"http://www.imdb.com/character/ch0185722","main":true},{"actorName":"Cristina Balmores","urlProfile":"http://www.imdb.com/name/nm2185923","urlPhoto":"","biography":{"bio":"Of Filipino, English, Spanish, and Chinese descent, Cristina Balmores was born in Los Angeles, California. From a large family of artists and entrepreneurs, she began performing on stage by age 5. At 12, she enlisted the aid of an agent and a manager, and dove into an intensive acting, dancing, and singing regimen. With endless hours of training and involvement in California regional dance and theater competitions, she obtained numerous first place awards, ultimately leading to an opportunity to take on Broadway. Upon being discovered by a Warner Bros. television executive, she soon got her start in commercials, print modeling, television, and film. Today, she juggles multiple positions in the entertainment industry, actively expanding her resume.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2185923","name":"Cristina Balmores","idIMDB":"nm2185923"},"actorId":"nm2185923","character":"Candy","urlCharacter":"http://www.imdb.com/character/ch0185723","main":true},{"actorName":"Rick D'Agostino","urlProfile":"http://www.imdb.com/name/nm3649917","urlPhoto":"","biography":{"bio":"Rick D'Agostino is an actor, known for Eating Out: All You Can Eat (2009) and The Adonis Factor (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3649917","name":"Rick D'Agostino","idIMDB":"nm3649917"},"actorId":"nm3649917","character":"Shirtless Stud","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tabitha Taylor","urlProfile":"http://www.imdb.com/name/nm0582249","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM4MjE3MzMwMl5BMl5BanBnXkFtZTcwNDQ2NjEzMQ@@._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Tabitha Taylor, the actress and model, is the new GoDaddy Girl, playing the \"perfect body\" for actress/comedian Joan Rivers, in the national ad campaign launched during the Superbowl. She has an extensive resume ranging from commercial campaigns for Dodge, Sony Playstation, Miller Lite, Comcast, and many more, to big budget features like \"Dude, Where's My Car?\", \"Lake View Terrace\", \"Dirty Love\", \"Loaded\", as well as many independent films. Her television appearances are no less impressive including starring roles in such shows as \"Nip Tuck\", \"Southland\", \"Entourage\", \"Monk\", \"Beauty and the Geek\", \"The Best Damn Sports Show\", and a long list of credits, even starring in music videos, like her role as the villain for Shakira's \"Obsession Tango\" hit. Tabitha is a Hawaiian native beauty, and grew up in the Los Angeles area with her parents and two sisters. Living so close to Hollywood, she was bitten by the acting bug early and studied extensively to live out her passion and dreams. Her comedic side, timing, and true natural talent, gives her the ability to transform into any role and add depth to any character, whether it be drama or comedy. Tabitha is also a successful model, but acting is certainly her first desire and focus. She has been featured in a variety of publications including Playboy, Maxim, FHM, American Curves, Muscular Development, and countless others. Her love for the craft is matched only by her hard work and dedication to give every project and producer, their true vision. She has an extensive resume in television, film, and commercials, and looks forward to building her talent, credits, and life experiences throughout her chosen career. Whether in her chosen profession of acting, or her personal life of fitness and animal rights activism, Tabitha Taylor is following the footsteps of her idol Marilyn Monroe. Her motto is simple: A strong work ethic, passion for what you love, and kindness along the way, is a life fully lived.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM4MjE3MzMwMl5BMl5BanBnXkFtZTcwNDQ2NjEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0582249","name":"Tabitha Taylor","idIMDB":"nm0582249"},"actorId":"nm0582249","character":"Tabitha /","urlCharacter":"http://www.imdb.com/character/ch0256240","main":true},{"actorName":"Greg McKeon","urlProfile":"http://www.imdb.com/name/nm3538459","urlPhoto":"","biography":{"bio":"Greg McKeon is an actor and writer, known for Eating Out: All You Can Eat (2009), Eating Out: The Open Weekend (2011) and Vampire Boys (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3538459","name":"Greg McKeon","idIMDB":"nm3538459"},"actorId":"nm3538459","character":"Hunk #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ryan Adames","urlProfile":"http://www.imdb.com/name/nm3552891","urlPhoto":"","biography":{"bio":"Ryan Adames is an actor, known for Eating Out: The Open Weekend (2011), Eating Out: All You Can Eat (2009) and Vampire Boys (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3552891","name":"Ryan Adames","idIMDB":"nm3552891"},"actorId":"nm3552891","character":"Hunk #2","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1472059","urlIMDB":"http://www.imdb.com/title/tt1472059","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"© 2009 EOSS Productions All Rights Reserved."},"technical":{"runtime":["1 hr 20 min (80 min)"],"soundMix":null,"color":["Color (HD)"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.0","metascore":"24","filmingLocations":[{"location":"Verde Oak Drive, Los Angeles, California, USA"}],"rated":"NOT RATED","awards":[],"votes":"2,510","type":"Movie","companyCreditsSimple":[{"idCompany":"co0019518","name":"Ariztical Entertainment"},{"idCompany":"co0291786","name":"EOSS Productions"}],"keywords":{"keywords":["stripper","male stripper","gay","pubic hair","male pubic hair","outtakes","tongue tied","jealousy","scooter","bitch slap","low self esteem","reference to stalking","reference to rape","waxing","narcissism","reference to tara reid","rainbow flag","used condom","sex tape","reference to liberace","reference to barbie","reference to the smurfs","fake online profile","employer employee relationship","aunt nephew relationship","ex boyfriend ex boyfriend relationship","dysfunctional relationship","human auction","reference to gay studies","uses the word faggot","reference to kevin spacey","lgbt community center","reference to larry craig","reference to anderson cooper","subtitles","reference to christ on the cross","reference to britney spears","kumbaya","eulogy","sex in a car","reference to ronald reagan","car accident","funeral home","gay cruising","redhead","boyfriend boyfriend relationship","gay slur","uses the word fag","profanity","internet dating","gay interest","talking about sex","queer cinema","sex scene","cop impersonation","auction","reference to matthew shepard","reference to jenna jameson","reference to harriet tubman","talking to oneself in a mirror","police baton","sunglasses","cigarette smoking","reference to rufus wainwright","reference to michael stipe","vietnamese","sniffing underwear","reference to amy winehouse","reference to miley cyrus","motorcycle","dream date","public park","reference to isaiah washington","orange juice","masturbation","volunteering","full moon","reference to madonna","sex with a priest","bad singing","reference to celine dion","guitar","sex in a coffin","funeral","coffin","male frontal nudity","penis","bare chested male","caught having sex","nail salon","community center","threesome","sex","sex video","oral sex","male nudity","italy","internet sex","internet hook up","internet chat","homosexuality","gay relationship","gay kiss","fag hag","ex boyfriend ex girlfriend relationship","dating","charity event","boyfriend girlfriend relationship","blow job","auctioneer","orgasm","male full frontal nudity","male dancer","homosexual","gay teenager","gay straight relations","gay sex","gay man straight woman relationship","gay bar"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 07:43:52"}}