{"data":{"movies":[{"title":"The Secret Lives of Dorks","originalTitle":"","year":"2013","releaseDate":"20130927","directors":[{"name":"Salomé Breziner","id":"nm0108358"}],"writers":[{"name":"Nicholas Brandt","id":"nm1024030"},{"name":"Johnny Severin","id":"nm3536667"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NzM3OTkwN15BMl5BanBnXkFtZTgwMDUzODgwMDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"Samantha (a dork) is in love with Payton (another dork) who is in love with Carrie (a cheerleader), who dates Clark (the football captain). When Clark seeks out Payton for secret comic book lessons, Payton sees his chance to be with Carrie. But Carrie's more interested in setting Payton up with Samantha.","simplePlot":"Samantha (a dork) is in love with Payton (another dork) who is in love with Carrie (a cheerleader), who dates Clark (the football captain). When Clark seeks out Payton for secret comic book... ","actors":[{"actorName":"Gaelan Connell","urlProfile":"http://www.imdb.com/name/nm0174983","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzOTcxMzQ5NV5BMl5BanBnXkFtZTcwMDYxMzY3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 May 1989","placeOfBirth":" Washington, District of Columbia, USA","bio":"Gaelan Connell was born on May 19, 1989 in Washington, District of Columbia, USA. He is an actor and director, known for Chocolat (2000), Bandslam (2009) and Level Up (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzOTcxMzQ5NV5BMl5BanBnXkFtZTcwMDYxMzY3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0174983","name":"Gaelan Connell","idIMDB":"nm0174983"},"actorId":"nm0174983","character":"Payton","urlCharacter":"http://www.imdb.com/character/ch0427908","main":true},{"actorName":"Vanessa Marano","urlProfile":"http://www.imdb.com/name/nm1404825","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMzgyMDIyNF5BMl5BanBnXkFtZTcwMjA0MjM0Ng@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1992","placeOfBirth":" Los Angeles, California, USA","birthName":"Vanessa Nicole Marano","height":"5' 3½\" (1.61 m)","bio":"Vanessa Marano started acting in the theater when she was seven years old, performing in numerous plays at A.C.T. in Agoura Hills, California. She began her professional career with several national commercials. Marano is most recognized for her roles as \"April Nardini\", the daughter of \"Luke\", in the highly popular show, Gilmore Girls (2000) and for the role of \"Francesca\", the daughter of the Emmy Award-winning Lisa Kudrow, in the HBO original series, The Comeback (2005). Recently, she starred in Scoundrels (2010), playing the scheming, school-skipping daughter of Virginia Madsen. She has had recurring roles in shows including Dexter (2006), Without a Trace (2002), Trust Me (2009) and The Young and the Restless (1973). Her guest-starring credits include Parenthood (2010), Medium (2005), Ghost Whisperer (2005), Past Life (2010), Six Feet Under (2001), Malcolm in the Middle (2000) and Grounded for Life (2001). She starred as a young girl who becomes a quadriplegic in the critically acclaimed television movie, The Brooke Ellison Story (2004), directed by Christopher Reeve. Marano's first film was the animated hit, Finding Nemo (2003), followed by the independent films, Easy (2003), The Clique (2008), Stopping Power (2000), Dear Lemon Lima (2009) and, most recently, The Secret Lives of Dorks (2013). Vanessa is working with Lucy Liu on a miniseries, playing the troubled foster teenager, \"Imogene 'Immy' Hicks\" in Marry Me (2010). Vanessa speaks Italian and is enrolled in her sophomore year in college.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMzgyMDIyNF5BMl5BanBnXkFtZTcwMjA0MjM0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1404825","name":"Vanessa Marano","idIMDB":"nm1404825"},"actorId":"nm1404825","character":"Samantha","urlCharacter":"http://www.imdb.com/character/ch0427910","main":true},{"actorName":"Riley Voelkel","urlProfile":"http://www.imdb.com/name/nm3754272","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjUxMDc5N15BMl5BanBnXkFtZTgwODczMjUwNDE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Riley Voelkel (born April 26, 1990) is an American Canadian actress best known for portraying Freya Mikaelson on The Originals. Riley also played the role of Jenna Johnson on The Newsroom. Voelkel was born in the United States, but raised in Canada. She was very involved in sports and school, being a part of a softball team for 9 years. Just a month away from going to college, a modeling scout was coming to her town and she decided to try her luck. The scout picked her and she went to Los Angeles where she was very much liked by several agents. She moved to Los Angeles to model, but, soon after, she joined an acting class recommended by an agent. Voelkel's first big break into the industry came when she went to a film audition for the role of a club girl in The Social Network. After finishing the picture, she signed with an agent and booked her first lead in an independent film, The Secret Lives of Dorks, released in 2013. In 2012, she joined the HBO series The Newsroom only for the pilot episode, but later became the character of Jenna. In 2014, she has been cast as one of the leads in Point Of Honor. In the Fall of 2014, she initially played an unnamed role in The Originals TV series. Recently, her character was upgraded to the recurring role of Freya Mikaelson, which was upgraded to a series regular for season 3.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjUxMDc5N15BMl5BanBnXkFtZTgwODczMjUwNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3754272","name":"Riley Voelkel","idIMDB":"nm3754272"},"actorId":"nm3754272","character":"Carrie","urlCharacter":"http://www.imdb.com/character/ch0427912","main":true},{"actorName":"Beau Mirchoff","urlProfile":"http://www.imdb.com/name/nm2155525","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWRlMjIxNjEtMzg0OS00NzllLWIzMjItY2RhYzY3NjFhY2FmXkEyXkFqcGdeQXVyNzQ5NzYyNw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1989","placeOfBirth":" Seattle, Washington, USA","birthName":"William Beau Mirchoff","height":"6' 1\" (1.85 m)","bio":"Beau Mirchoff was born on Friday the 13th of January, 1989, in Seattle, Washington. Two days later, he moved to his family's home in Victoria, British Columbia, Canada, on Vancouver Island. His father Bill, is a podiatrist from California and his mother Kelley, is a full-time homemaker from Washington State. Beau started training as an actor at the age of 13 in Vancouver, British Columbia. This required him to take a two hour ferry-boat venture from Vancouver Island to the mainland of British Columbia, and ride the bus an hour into the city. He did this every week until moving to Los Angeles in February of 2009 where Beau began training at the Michael Woolson Studio - the same studio he trains at today. In 2009 Beau landed the role of Danny Bolen on ABC's Desperate Housewives. In 2010 he snagged the role of Matty Mckibben on MTV's Awkward; he won a Teen Choice Award in 2012 for this portrayal. During the hiatuses from television Mirchoff focuses on the theatre: in 2012 he portrayed Treat in a production of Lyle Kessler's Orphans at the Hudson Theatre; in 2013 he played Kent in Neil Labute's Reason's to be Pretty at the MW Theatre. Other notable films include: Scary Movie 4, The Grudge 3, I am Number 4, and Poker Night alongside Ron Perlman, Giancarlo Esposito, Titus Welliver, and Ron Eldard.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWRlMjIxNjEtMzg0OS00NzllLWIzMjItY2RhYzY3NjFhY2FmXkEyXkFqcGdeQXVyNzQ5NzYyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2155525","name":"Beau Mirchoff","nicknames":["Beau"],"idIMDB":"nm2155525"},"actorId":"nm2155525","character":"Clark","urlCharacter":"http://www.imdb.com/character/ch0427911","main":true},{"actorName":"Jim Belushi","urlProfile":"http://www.imdb.com/name/nm0000902","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzU1ODA5M15BMl5BanBnXkFtZTYwMTcxMjQz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 June 1954","placeOfBirth":" Chicago, Illinois, USA","birthName":"James Adam Belushi","height":"5' 11\" (1.8 m)","bio":"James Adam Belushi was born June 15, 1954, in Chicago, to Agnes Demetri (Samaras) and Adam Anastos Belushi, a restaurant owner. His father was an Albanian immigrant, from Qytezë, and his mother was also of Albanian descent. The third of four children - his brother was John Belushi - he grew up in Wheaton, Illinois. A high school teacher, impressed by his improvisational skills while giving speeches, convinced him to to be in a school play. After that, he joined the school's drama club. Today, if asked why he got involved in acting, he will jokingly say, \"Because of girls. In the drama club, there were about 20 girls and six guys. And the same thing with choir - more girls!\". He attended the College of DuPage and Southern Illinois University, where he graduated with a degree in Speech and Theater Arts. In 1977, he joined Chicago's Second City improv troupe and remained for three years. In 1979, Garry Marshall saw Jim performing for Second City and arranged for him to come to Hollywood and co-star in the TV pilot Who's Watching the Kids (1978) for Paramount and, then, for a role in the series Working Stiffs (1979) (co-starring Michael Keaton). Later, in 1983, he joined the cast of Saturday Night Live (1975) for two years. Jim came to national attention in About Last Night... (1986), playing the role he originated in the Chicago Apollo Theatre's production of David Mamet's Obie-award winning play \"Sexual Perversity in Chicago\". He resides in Los Angeles with his wife Jennifer Sloan, their daughter Jamison and a son, Robert Belushi, from Belushi's first marriage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzU1ODA5M15BMl5BanBnXkFtZTYwMTcxMjQz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000902","name":"Jim Belushi","nicknames":["Jim"],"idIMDB":"nm0000902"},"actorId":"nm0000902","character":"Bronko","urlCharacter":"http://www.imdb.com/character/ch0427913","main":true},{"actorName":"Jennifer Tilly","urlProfile":"http://www.imdb.com/name/nm0000236","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQxNDI2MzA0N15BMl5BanBnXkFtZTYwOTcxOTI0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1958","placeOfBirth":" Harbor City, California, USA","birthName":"Jennifer Ellen Chan","height":"5' 7\" (1.7 m)","bio":"An actress who always attracts audiences' attention, Jennifer Tilly is by turns funny, sexy, compassionate, compelling and often all at once. Her breakthrough movie role tapped into all of those qualities failing singer Blanche \"Monica\" Moran in Steve Kloves' The Fabulous Baker Boys (1989) opposite brothers Jeff Bridges and Beau Bridges. A few years later, Jennifer earned an Academy Award nomination for her portrayal of the aspiring but hopelessly untalented actress Olive Neal in Woody Allen's Bullets Over Broadway (1994). She has become well-known to filmgoers for both major studio and independent films. In Tom Shadyac's blockbuster Liar Liar (1997), she kept pace with Jim Carrey. Her steamy performance opposite Gina Gershon helped make Lana Wachowski's and Lilly Wachowski's Bound (1996) a breakout indie success at the Sundance Film Festival and then in theatrical release. It also expanded Jennifer's already significant gay and lesbian following. She successfully cultivated another fan base with the revitalization of the \"Child's Play\" horror comedy franchise. For Ronny Yu's La fiancée de Chucky (1998), the filmmakers turned to Jennifer to create the character who would spark the series in a new direction. She met the challenge and established a new horror icon in Tiffany. This Halloween, in Rogue Pictures' all-new Le fils de Chucky (2004), written and directed by series creator Don Mancini, Jennifer again takes the popular series to the next level; she stars as Tiffany and as herself, the deadly doll's favorite actress, who soon becomes an unwitting hostess in more ways than one. Jennifer's pitch-perfect voiceover work as Tiffany is not the only instance of her being able to incarnate a character from the vocal chords out. Families know her distinctive cadences from the recent Disney hits Home on the Range (2004) (in which Jennifer voiced a new-age bovine), directed by Will Finn and John Sanford; The Haunted Mansion (2003) (in which Jennifer acted from the neck up only), directed by Rob Minkoff; and the Pixar blockbuster Monsters, Inc. (2001) (voicing Mike's love interest Celia), directed by Pete Docter, David Silverman and Lee Unkrich. She began her acting career as a teenager, putting herself through the theater program at Stephens College in Missouri by winning writing competitions. She then headed to Los Angeles, California. While she continued to act on the stage (earning a Dramalogue Award for her performance in \"Vanities\"), movies and television immediately came calling for the actress with the unique voice and visage. Over the years, Jennifer has made memorable appearances on some of television's best series, including Hill Street Blues (1981) (in a recurring dramatic role), Cheers (1982), Moonlighting (1985), It's Garry Shandling's Show. (1986) and Frasier (1993). In addition, she has been a favored guest on a number of talk shows, from The Tonight Show Starring Johnny Carson (1962) to The Arsenio Hall Show (1989) to (currently) The Tonight Show with Jay Leno (1992). Those interview segments have encouraged viewers to expect the unexpected from her interplay with the host and the studio audience. Her many films over a two-decade span include Neil Jordan's High Spirits (1988), Oliver Stone's The Doors (1991), Richard Benjamin's Made in America (1993), Roger Donaldson's The Getaway (1994), Joe Pytka's Let It Ride (1989), P.J. Castellaneta's Relax... It's Just Sex (1998), Michael Radford's Dancing at the Blue Iguana (2000), Peter Bogdanovich's The Cat's Meow (2001) (in which she played Louella Parsons). Jennifer Tilly has also continued to act on the stage. She won a Theater World Award for her performance in off-Broadway's \"One Shoe Off\" and starred on Broadway in the 2001 revival of \"The Women\" (which was later taped for, and broadcast on, PBS).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQxNDI2MzA0N15BMl5BanBnXkFtZTYwOTcxOTI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000236","name":"Jennifer Tilly","nicknames":["The Unabombshell","Jenny"],"idIMDB":"nm0000236"},"actorId":"nm0000236","character":"Ms. Stewart","urlCharacter":"http://www.imdb.com/character/ch0427916","main":true},{"actorName":"William Katt","urlProfile":"http://www.imdb.com/name/nm0001411","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTc0MDU2NV5BMl5BanBnXkFtZTcwMTk4ODIyOA@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 February 1951","placeOfBirth":" Los Angeles, California, USA","birthName":"William Theodore Katt","height":"5' 8½\" (1.74 m)","bio":"William Katt was born in Los Angeles, California, USA as William Theodore Katt. He is the son of actress Barbara Hale and actor Bill Williams. He is an actor and director, known for The Greatest American Hero (1981), Carrie (1976) and The Man from Earth (2007). He has been married to Danielle Hirsch since April 10, 1993. They have two children. He was previously married to Deborah Kahane.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTc0MDU2NV5BMl5BanBnXkFtZTcwMTk4ODIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001411","name":"William Katt","idIMDB":"nm0001411"},"actorId":"nm0001411","character":"Mr. Thomas Gibson","urlCharacter":"http://www.imdb.com/character/ch0427917","main":true},{"actorName":"Kay Lenz","urlProfile":"http://www.imdb.com/name/nm0001464","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1OTQ5ODc0Nl5BMl5BanBnXkFtZTcwNDkzNzgzNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1953","placeOfBirth":" Los Angeles, California, USA","birthName":"Kay Ann Lenz","height":"5' 1\" (1.55 m)","bio":"Kay came from an L.A. showbiz family. Her father was producer/commentator Ted Lenz and her mother model/radio engineer Kay Miller Lenz. At the ripe old age of eight weeks, Kay appeared on her first TV show produced by her dad as a baby being held up and sung to. She continued on in her father's TV shows and commercials throughout her childhood. In the 60s, she appeared as a teen on stage (Pasadena Playhouse) and in guest parts on The Monroes (1966), The Andy Griffith Show (1960) and Ironside (1967). Kay flirted with 70s film stardom after being cast by director Clint Eastwood in the film Breezy (1973) opposite William Holden as a plucky, troubled hippie/free spirit who has an affair with a much older businessman. Kay was singled out for her affecting performance but the film was ignored. She ventured on but none of her subsequent feisty roles in La route de la violence (1975), The Great Scout & Cathouse Thursday (1976), Mean Dog Blues (1978) and House (1985) put her over the top. She gained quite a bit of exposure, however, after her wedding to former teen idol David Cassidy in 1977. The marriage lasted six years. TV remained Kay's medium of choice and she has garnered two Emmy awards in the process.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1OTQ5ODc0Nl5BMl5BanBnXkFtZTcwNDkzNzgzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001464","name":"Kay Lenz","idIMDB":"nm0001464"},"actorId":"nm0001464","character":"Mrs. Susie Gibson","urlCharacter":"http://www.imdb.com/character/ch0427921","main":true},{"actorName":"Seymour Cassel","urlProfile":"http://www.imdb.com/name/nm0001025","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NzE3MjMyNl5BMl5BanBnXkFtZTYwMzgyMzkz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 January 1935","placeOfBirth":" Detroit, Michigan, USA","birthName":"Seymour Joseph Cassel","height":"5' 7¾\" (1.72 m)","bio":"Seymour Cassel, the veteran character actor who was nominated for a Best Supporting Actor Oscar for his role as the hippie swinger Chet in John Cassavetes' Faces (1968), studied acting at the American Theatre Wing and at the Actors Studio. He made his movie debut in Cassavetes' first film, Shadows (1959), on which he also served as associate producer. Cassel's early career was tied to Cassavetes, who himself had a flourishing career as an actor on television and in major Hollywood productions in addition to becoming, arguably, the first great independent movie director after the collapse of the studio system in the late 1950s/early 1960s. As for Cassel, after his uncredited role in \"Shadows,\" he co-starred with Cassavetes in The Webster Boy (1962) and Too Late Blues (1961) before winding up in support of his friend in Don Siegel's The Killers (1964), a movie shot for TV that had to be released theatrically due to its heightened violence (it was also Ronald Reagan's last movie). Cassel primarily made his living on TV in the 1960s, frequently typecast as beatniks and hippies. He had a supporting role in the Cassavetes-directed episode \"A Pair of Boots\" (1962) for The Lloyd Bridges Show (1962) as well as appearing on such popular programs as 12 O'Clock High (1964), Combat! (1962) and The F.B.I. (1965) before scoring with his aging hippie in \"Faces\" at the end of that tumultuous decade. Along with \"Shadows,\" \"Faces\" remains his favorite Cassavettes film. In addition to acting, Cassel was also a crew member on the film, as the technical staff numbered all of seven. He helped shoot the film as a second cameraman, as well as adjusting the lighting. As the film was financed by Cassavettes himself, there were no union regulations to deal with, nor a studio schedule to keep. Several of Cassavettes' films were shot in continuity, so the actors could develop a character in sequence--similar to stage acting--rather than the traditional method of film making, which is shot out of sequence. Cassel has stated that this technique enhanced the success of his works by eliminating the \"fourth wall\" between the audience and the actors. He believes that acting tells the film's story, not the images and that what is important is how the audience relates to the characters on screen. As their careers matured, Cassel also co-starred with Cassavetes in two TV movies, Nightside (1973) and Nightside (1973) and appeared in supporting roles in three more Cassavetes-directed films: The Killing of a Chinese Bookie (1976), Opening Night (1977) and Love Streams (1984). In addition to appearing in studio films, Cassel has remained prominent in the American independent film community since the death of his friend and collaborator. He contributed a cameo appearance in the directorial debut of Steve Buscemi (with whom he appeared as a co-star in the black comedy In the Soup (1992)), Trees Lounge (1996), and has appeared in three films by Wes Anderson: Rushmore (1998), The Royal Tenenbaums (2001) and The Life Aquatic with Steve Zissou (2004). Cassel is prized by independent directors for two things: his positive nature, and his (perhaps) facetious declaration that he'd be in any independent film for the price of a plane ticket if he liked the script.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NzE3MjMyNl5BMl5BanBnXkFtZTYwMzgyMzkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001025","name":"Seymour Cassel","idIMDB":"nm0001025"},"actorId":"nm0001025","character":"Principal","urlCharacter":"http://www.imdb.com/character/ch0427918","main":true},{"actorName":"Charlie Stewart","urlProfile":"http://www.imdb.com/name/nm0992306","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMzExMDI4NV5BMl5BanBnXkFtZTcwMDM0NzgyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1993","placeOfBirth":"","height":"5' 3½\" (1.61 m)","bio":"Charlie has been pursuing his career as a young actor for almost five years. Originally from Las Vegas, Nevada, he and his family made the move to Los Angeles where Charlie was discovered by his manager in a fast food restaurant. With his gregarious nature, irresistible charm and one-of-a-kind look, Charlie began to win the hearts of both commercial and theatrical casting directors. Charlie's credits include television appearances on ER, The Drew Carey Show, Seventh Heaven, Malcolm in the Middle, Gilmore Girls, Norm, Becker and Yes, Dear. His feature film credits include The Animal and Dawg. Outside of his passion for acting, Charlie likes to play basketball, enjoys swimming and video games, and loves to make people laugh. He has one older sister and delights in goofing around with his family. His mom and dad enjoy watching Charlie do what he does best - entertain.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMzExMDI4NV5BMl5BanBnXkFtZTcwMDM0NzgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0992306","name":"Charlie Stewart","idIMDB":"nm0992306"},"actorId":"nm0992306","character":"Ollie","urlCharacter":"http://www.imdb.com/character/ch0427909","main":true},{"actorName":"Mark Daugherty","urlProfile":"http://www.imdb.com/name/nm3239836","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMzM1NjEzM15BMl5BanBnXkFtZTcwOTE5MDcyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 May 1989","placeOfBirth":" Seoul, South Korea","bio":"Mark Daugherty was born on May 6, 1989 in Seoul, South Korea. He is an actor and producer, known for The Amazing Spider-Man (2012), Bayonetta 2 (2014) and The Fosters (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMzM1NjEzM15BMl5BanBnXkFtZTcwOTE5MDcyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3239836","name":"Mark Daugherty","idIMDB":"nm3239836"},"actorId":"nm3239836","character":"Chester","urlCharacter":"http://www.imdb.com/character/ch0427915","main":true},{"actorName":"Escher Holloway","urlProfile":"http://www.imdb.com/name/nm1981440","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNTM1MzM5Nl5BMl5BanBnXkFtZTcwODM5NTE4Mg@@._V1_UY44_CR28,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 June 1987","placeOfBirth":" Corvallis, Oregon, USA","bio":"Escher Holloway was born on June 17, 1987 in Corvallis, Oregon, USA. He is known for his work on When a Stranger Calls (2006), A New York Heartbeat (2013) and Getting That Girl (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNTM1MzM5Nl5BMl5BanBnXkFtZTcwODM5NTE4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1981440","name":"Escher Holloway","idIMDB":"nm1981440"},"actorId":"nm1981440","character":"Matt Kinsella","urlCharacter":"http://www.imdb.com/character/ch0427937","main":true},{"actorName":"Andrea Bogart","urlProfile":"http://www.imdb.com/name/nm0091553","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNjU2MDcxOV5BMl5BanBnXkFtZTgwMDYxNDUzMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1977","placeOfBirth":" Saint Charles, Missouri, USA","height":"5' 7\" (1.7 m)","bio":"Born and raised in St Charles County, Missouri, Andrea Bogart's love of acting and dancing thrust her to the front of the camera. While she's a small town girl at heart, the world has been her oyster having traveled for work in places as far as Japan and Fiji. Andrea's small screen appearances on a variety of popular shows include \"NCIS\", \"Castle,\" \"CSI: Miami,\" \"Rizzoli & Isles,\" \"The Mentalist,\" \"Two and a Half Men,\" \"Nip/Tuck,\" My Boys,\" \"Ghost Whisperer,\" \"CSI: NY,\" as well as others. Gaining even more success in 2010 she captured the hearts of many portraying the role of Abby Haver in over 100 episodes on the Emmy award winning series \"General Hospital.\" In the 2013 release of Steven Soderberghs' \"Side Effects,\" Bogart has a supporting role opposite Jude Law. Her other feature credits include lead roles in \"Wingman,\" \"Life's An Itch,\" \"Dark Ride\" (Lion's Gate Films), \"The Last Run\" (New Line) and supporting roles in \"Old Days,\" \"The Secret Lives of Dorks\" and \"Bar Starz\". No stranger to the small screen, Andrea's nationally run commercials include Direct TV, a Super Bowl ad for Coors Light, AT&T (Dir. Peter Berg), Cadillac (Dir. by Joe Carnahan), Electrolux, Taco Bell, Pantene, Nike (Dir. David Fincher), Bud Light, Gap and many more as well as leading roles in music videos for Smash Mouth, 98 Degrees, Moby and Marc Anthony. She has also appeared on the small stage in leading performances in \"Burn This\" and \"Postcards From LA.\" When Andrea is not pretending to be someone else on set she finds just being herself and staying active the most fun. Her love for practicing Yoga inspired her to get certified and is now an instructor. She continues to live out her passion for dance by teaching ballet, tap, tumbling & hip-hop to young children and often catches herself journaling and writing sketches about her many experiences through out life. Bogart is thrilled she gets to put many of these passions to work by volunteering with the Young Story Tellers Foundation. Bogart resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNjU2MDcxOV5BMl5BanBnXkFtZTgwMDYxNDUzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0091553","name":"Andrea Bogart","idIMDB":"nm0091553"},"actorId":"nm0091553","character":"Jessica","urlCharacter":"http://www.imdb.com/character/ch0427920","main":true},{"actorName":"Daina Gozan","urlProfile":"http://www.imdb.com/name/nm2071292","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NzUzMDUyOV5BMl5BanBnXkFtZTcwMTkzNDMzMQ@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"A conservatory trained performer, Daina has studied at some of the nation's leading performing arts schools including the California Institute of the Arts, and The Sanford Meisner Center in Los Angeles. After shooting several independent features, Daina recently got her big break playing the role of Sela in For One Night on Lifetime, where she starred opposite Raven Simone and Aisha Tyler.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NzUzMDUyOV5BMl5BanBnXkFtZTcwMTkzNDMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2071292","name":"Daina Gozan","idIMDB":"nm2071292"},"actorId":"nm2071292","character":"Anya","urlCharacter":"http://www.imdb.com/character/ch0427922","main":true},{"actorName":"Emily Wilson","urlProfile":"http://www.imdb.com/name/nm2578291","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDQ2ODk3MF5BMl5BanBnXkFtZTgwNDU3ODc0NTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1985","placeOfBirth":" Westminster, Colorado, USA","bio":"Emily Wilson was born on May 28, 1985 in Westminster, Colorado, USA. She is an actress, known for Meet the Spartans (2008), General Hospital (1963) and The House Bunny (2008). She has been married to Adhir Kalyan since October 1, 2016.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDQ2ODk3MF5BMl5BanBnXkFtZTgwNDU3ODc0NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2578291","name":"Emily Wilson","idIMDB":"nm2578291"},"actorId":"nm2578291","character":"Karen","urlCharacter":"http://www.imdb.com/character/ch0427924","main":true}],"seasons":[],"idIMDB":"tt1418757","urlIMDB":"http://www.imdb.com/title/tt1418757","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 31 min (91 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":["Indie DCP, Burbank, CA (DCP mastering)"],"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.1","metascore":"32","filmingLocations":[],"rated":"PG-13","awards":[],"votes":"488","type":"Movie","companyCreditsSimple":[{"idCompany":"co0274022","name":"Indomitable Entertainment"},{"idCompany":"co0360286","name":"School Pictures"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:03:40"}}