{"data":{"movies":[{"title":"Assassination Games","originalTitle":"","year":"2011","releaseDate":"20120119","directors":[{"name":"Ernie Barbarash","id":"nm0053228"}],"writers":[{"name":"Aaron Rahsaan Thomas","id":"nm1119838"}],"runtime":"101 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2RmMjc4NzAtMzMzYi00N2NmLTkxMmYtOGM3NzhiNDZkNTQzXkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Crime","Drama","Thriller"],"plot":"Vincent Brazil and Roland Flint are the two best assassins in the world - but unknown to each other. These two rival assassins form an uneasy alliance to take down a target, which is backed by dirty Interpol Agents.","simplePlot":"Two assassins agree to work together as one tries to avenge his wife and the other collect a reward for a job.","actors":[{"actorName":"Jean-Claude Van Damme","urlProfile":"http://www.imdb.com/name/nm0000241","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2OTE1Njg4NjVeQTJeQWpwZ15BbWU3MDAyNjU4MDM@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1960","placeOfBirth":" Berchem-Sainte-Agathe, Brussels, Belgium","birthName":"Jean-Claude Camille François Van Varenberg","height":"5' 9¾\" (1.77 m)","bio":"Van Damme was born Jean-Claude Camille François Van Varenberg in Berchem-Sainte-Agathe, Brussels, Belgium, to Eliana and Eugène Van Varenberg, an accountant. \"The Muscles from Brussels\" started martial arts at the age of eleven. His father introduced him to martial arts when he saw his son was physically weak. At the age of 12, Van Damme began his martial arts training at Centre National De Karate (National Center of Karate) under the guidance of Master Claude Goetz in Ixelles, Belgium. Van Damme trained for 4 years and earned a spot on the Belgium Karate Team. He won the European professional karate association's middleweight championship as a teenager, and also beat the 2nd best karate fighter in the world. His goal was to be number one but got sidetracked when he left his hometown of Brussels. In 1976 at the age of sixteen, Jean-Claude started his Martial Arts fight career. Over the next 6-years, he competed in both full-contact and semi-contact matches. He debuted under his birth name of Jean Claude Van Varenberg. In his first match, Jean-Claude was staggered by a round-house kick thrown by fellow countryman, Toon Van Oostrum in Brussels, Belgium. Van Damme was badly stunned, but came back to knockout Van Oostrum moments later. In 1977, at the WAKO Open International in Antwerp, Belgium, Jean-Claude lost a decision to fellow team mate Patrick Teugels in a semi-contact match. At the 1978 Challenge De Espoirs Karate Tournament (1st Trials),Jean-Claude placed 2nd in the semi-contact division. He defeated twenty-five opponents during the week long tournament, but lost in the finals to Angelo Spataro from the Naha Club. Later in 1978, Jean-Claude lost a 3-round match for the Belgium Lightweight Championship (semi-contact) to his fellow team-mate to Patrick Teugels. In 1979, Jean-Claude traveled to the United States of America, to Tampa, Florida. In his first and only match against a United States opponent, Van Damme faced 'Sherman 'Big Train'Bergman', a kick-boxer from Miami Beach, Florida. For the first and only time in his career, Jean-Claude was knocked to the canvas after absorbing a powerful left hook from Bergman. However, Jean-Claude climbed off the canvas and with a perfectly timed ax-kick, knocked Bergman out in 56 seconds of the first round. Jean-Claude was a member of the Belgium team which competed on December 26, 1979 at the La Coupe Fancois Persoons Karate Tournament which was sanctioned by the Federation bruxelloise de Karate. Van Damme's final match victory enabled his team to win the European Team Karate Championship. In Full-Contact karate, Jean-Claude knocked out England's Micheal Heming in 46 seconds of the first round. In 1980, Van Damme knocked out France's Georges Verlugels in 2 rounds of a match fought under kick-boxing rules. Jean-Claude wanted to defeat his rival Patrick Teugels. At the Forest Nationals in Brussels, on March 8, 1980, Jean-Claude knocked Teugels down and Teugels suffered a nose injury and was unable to continue. Jean-Claude was awarded a first round victory. Jean-Claude retired from martial arts in 1982, following a knockout over Nedjad Gharbi in Brussels,Belgium. Jean-Claude posted a 18-1 (18 knockouts) Kickboxing record, and a Semi-Contact record of 41-4. He came to Hong Kong at the age of 19 for the first time and felt insured to do action movies in Hong Kong. In 1981 Van Damme moved to Los Angeles. He took English classes while working as carpet layer, pizza delivery man, limo driver, and thanks to Chuck Norris he got a job as a bouncer at a club. Norris gave Van Damme a small role in the movie Missing in Action (1984), but it wasn't good enough to get anybody's attention. Then in 1984 he got a role as a villain named Ivan in the low-budget movie No Retreat, No Surrender (1986). Then one day, while walking on the streets, Jean-Claude spotted a producer for Cannon Pictures, and showed some of his martial arts abilities which led to a role in Bloodsport (1988). But the movie, filmed in Hong Kong, was so bad when it was completed, it was shelved for almost two years. It might have never been released if Van Damme did not help them to recut the film and begged producers to release it. They finally released the film, first in Malaysia and France and then into the U.S. Shot on a meager 1.5 million dollar budget, it became a U.S box-office hit in the spring of 1988. It made about 30 million worldwide and audiences supported this film for its new sensational action star Jean-Claude Van Damme. His martial arts assets, highlighted by his ability to deliver a kick to an opponent's head during a leaping 360-degree turn, and his good looks led to starring roles in higher budgeted movies like Cyborg (1989), Lionheart (1990), Double Impact (1991) and Universal Soldier (1992). In 1994, he scored with his big breakthrough $100 million worldwide hit Timecop (1994). But in the meantime, his personal life was coming apart. A divorce, followed by a new marriage, followed by another divorce. It began to show up in his career when his projects began to tank at the box office - The Quest (1996), which he directed; Maximum Risk (1996) and Double Team (1997). The three films made less than $50 million combined. In 1999 he remarried his ex-wife Gladys Portugues and restarted his lost career to attain new goals. With help from his family he faced his problems and made movies like Replicant (2001), Derailed (2002), and In Hell (2003) which did averagely in box office terms, but he tried to give his fans the best, his acting in those movies got better, more emotional and each movie was basically in different action tones.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2OTE1Njg4NjVeQTJeQWpwZ15BbWU3MDAyNjU4MDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000241","name":"Jean-Claude Van Damme","nicknames":["Muscles from Brussels","J.C."],"idIMDB":"nm0000241"},"actorId":"nm0000241","character":"Vincent Brazil","urlCharacter":"http://www.imdb.com/character/ch0260333","main":true},{"actorName":"Scott Adkins","urlProfile":"http://www.imdb.com/name/nm0012078","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTQxMjMxNl5BMl5BanBnXkFtZTgwMTE1NzM0MDI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 June 1976","placeOfBirth":" Sutton Coldfield, West Midlands, England, UK","height":"5' 10¾\" (1.8 m)","bio":"Scott Edward Adkins was born on June 17, 1976 in Sutton Coldfield, England, into a family that for generations were butchers. Along with his elder brother Craig, he was raised by their parents, John and Janet (Sanders) Adkins, in a loving middle-class family. Scott attended Bishop Vesey's Grammar School in Sutton Coldfield. Probably not the best of students, he used to sneak downstairs after his parents had gone to bed and watch films all night then fall asleep during lessons. A natural athlete, Scott enjoyed a variety of sports as he grew up, but when he was 10 years old, he accompanied his father and brother to the local Judo club. The attraction was instantaneous. Idolising stars such as Bruce Lee and Jean-Claude Van Damme, Scott began to train everyday. He took over his Dad's garage and turned it into his own Dojo. He even had a shrine to Bruce Lee in there that he would bow to. He remembers being mugged on a bus when he was around 13 and that really kicked his training into overdrive. He wasn't ever going to let that happen again. At the age of 14, Scott went on to train in Tae Kwon Do under the instruction of Ron Sergiew with the T.A.G.B. After a few years, he moved on to Kickboxing under Anthony Jones. He is now a fully trained Kickboxing Instructor for the P.K.A. A self confessed \"film junkie\" Scott's attention was drawn to acting through the Hollywood Greats. He enrolled in a drama class at Sutton Coldfield College. Being a shy lad he initially found it difficult to be put on stage in front of an audience. Finally, at the age of 21, Scott was offered a place at the prestigious Webber Douglas Academy of Dramatic Art. However, as an impoverished student, he found it hard to make ends meet without a grant and was forced to leave without completing the course. Very dejected he thought that was the end. His first break came when he was offered a role in a Hong Kong martial arts film called Dei seung chui keung (2001) (aka Extreme Challenge). Spotted by Head of The Hong Kong Stuntmen Association and director Wei Tung and English-born Hong Kong movie expert Bey Logan, Adkins found himself in the East for the first time. Scott got the chance to work with some of Hong Kong cinema's leading action directors including Woo-Ping Yuen, Corey Yuen, Sammo Kam-Bo Hung and the legendary Jackie Chan. Acting roles started to come in and he was offered a guest role in BBC's Doctors (2000) filmed at Birmingham's Pebble Mill. A few episodes in BBC's EastEnders (1985) and City Central (1998), and a lead role in Sky One comedy drama Mile High (2003) followed by a regular role in BBC's Holby City (1999) as Bradley Hume, the assistant General Manager of Holby General. Starring roles in feature films soon followed with his portrayal of Talbot in Special Forces (2003) and Yuri Boyka\" in Undisputed 2: Last Man Standing (2006). It was this film that broke him into the mainstream with his villainous portrayal of a Russian MMA underground fighter Boyka in what has been hailed as one of the best American made Martial Arts films of recent times. Along with lead actor Michael Jai White, fight coordinator J.J. Perry and the slick direction of Isaac Florentine this movie has some unbelievably heart stopping fight scenes. After this Scott has had guest starring roles in bigger budget films like The Bourne Ultimatum (2007) and The Tournament (2009), and played Jean-Claude Van Damme's main adversary in Sony Pictures The Shepherd (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTQxMjMxNl5BMl5BanBnXkFtZTgwMTE1NzM0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0012078","name":"Scott Adkins","idIMDB":"nm0012078"},"actorId":"nm0012078","character":"Roland Flint","urlCharacter":"http://www.imdb.com/character/ch0260339","main":true},{"actorName":"Ivan Kaye","urlProfile":"http://www.imdb.com/name/nm0443321","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MjMyNTgwOV5BMl5BanBnXkFtZTgwNjU5MTYzMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 4\" (1.93 m)","bio":"Ivan Blakeley Kaye was born on 1st July 1961 and made his stage debut at Sadlers Wells in 1980 in 'Charlie and the Chocolate Factory; as Willie Wonka, appearing throughout the 1980s with the National Theatre in 'The Changeling', 'Ghetto' and The Magic Olympic Games, as well as West End performances in 'The Rocky Horror Show' at the Piccadilly Theatre as Eddie and Dr Scott, 'Serious Money' at Wyndhams and 'A View From the Bridge' at Bristol Old Vic, transferring to the Strand. In 1992 he made his television leading role in the name part of detective drama 'Sam Saturday' and has since been seen as star-struck Reuben Starkadder in 'Cold Comfort Farm', a duplicitous spouse in 'Bad Girls'. an initially questionable doctor in 'East Enders' and dim farm-hand Bryan in sitcom 'Green, Green Grass' in addition to period pieces 'The Borgias' and 'Vikings' in less than sympathetic mode. (On his Twitter page he describes himself as Villain for Hire.) He is also a founder and director of Comedy Ink Productions with actor/writer Douglas McFerran (born May 1958) producing short comedic offerings such as the 'Witchcraft in Suburbia' series and is a supporter of the Hounslow Urban Farm (where 'Green Green Grass was partially filmed) and, with several other actors, the Justice for Andrew campaign, seeking justice for the murder of a young Liverpudlian. Married to Lesley and living in Oxfordshire Mr Kaye has a daughter Eve.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MjMyNTgwOV5BMl5BanBnXkFtZTgwNjU5MTYzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0443321","name":"Ivan Kaye","idIMDB":"nm0443321"},"actorId":"nm0443321","character":"Polo Yakur","urlCharacter":"http://www.imdb.com/character/ch0260358","main":true},{"actorName":"Valentin Teodosiu","urlProfile":"http://www.imdb.com/name/nm0855256","urlPhoto":"","biography":{"dateOfBirth":"17 September 1953","placeOfBirth":" Romania","bio":"Valentin Teodosiu was born on September 17, 1953 in Romania. He is an actor, known for Au diable Staline, vive les mariés! (2008), Assassination Games (2011) and Gadjo dilo (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0855256","name":"Valentin Teodosiu","idIMDB":"nm0855256"},"actorId":"nm0855256","character":"Blanchard","urlCharacter":"http://www.imdb.com/character/ch0260368","main":true},{"actorName":"Alin Panc","urlProfile":"http://www.imdb.com/name/nm1119249","urlPhoto":"","biography":{"dateOfBirth":"14 June 1973","placeOfBirth":" Hunedoara, Romania","height":"6' 0¾\" (1.85 m)","bio":"Alin Panc was born on June 14, 1973 in Hunedoara, Romania. He is an actor and writer, known for Ghost Rider: Spirit of Vengeance (2011), Assassination Games (2011) and The Cave (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1119249","name":"Alin Panc","idIMDB":"nm1119249"},"actorId":"nm1119249","character":"Kovacs","urlCharacter":"http://www.imdb.com/character/ch0260376","main":true},{"actorName":"Kevin Chapman","urlProfile":"http://www.imdb.com/name/nm0152430","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTEwODExNV5BMl5BanBnXkFtZTgwNTAzNDAyMTE@._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Kevin Chapman is an actor and producer, known for Person of Interest (2011), Brotherhood (2006) and Mystic River (2003). He is married to Meaghan. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTEwODExNV5BMl5BanBnXkFtZTgwNTAzNDAyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0152430","name":"Kevin Chapman","nicknames":["Chappy"],"idIMDB":"nm0152430"},"actorId":"nm0152430","character":"Culley","urlCharacter":"http://www.imdb.com/character/ch0260352","main":true},{"actorName":"Serban Celea","urlProfile":"http://www.imdb.com/name/nm0147967","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMTY5OTM3NV5BMl5BanBnXkFtZTcwMDU2MDQ4NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1952","placeOfBirth":" Bucharest, Romania","bio":"Serban Celea was born on June 10, 1952 in Bucharest, Romania. He is known for his work on Assassination Games (2011), Second in Command (2006) and La sentinelle (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMTY5OTM3NV5BMl5BanBnXkFtZTcwMDU2MDQ4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0147967","name":"Serban Celea","idIMDB":"nm0147967"},"actorId":"nm0147967","character":"Wilson Herrod","urlCharacter":"http://www.imdb.com/character/ch0260384","main":true},{"actorName":"Michael Higgs","urlProfile":"http://www.imdb.com/name/nm0383553","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMTc1NzUwMTheQTJeQWpwZ15BbWU4MDgyNzAwNTkx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1962","placeOfBirth":" Birmingham, England, UK","height":"5' 11\" (1.8 m)","bio":"Michael Higgs was born on February 14, 1962 in Birmingham, England. He is an actor, known for EastEnders (1985), Wizards vs. Aliens (2012) and The Bill (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMTc1NzUwMTheQTJeQWpwZ15BbWU4MDgyNzAwNTkx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0383553","name":"Michael Higgs","idIMDB":"nm0383553"},"actorId":"nm0383553","character":"Godfrey","urlCharacter":"http://www.imdb.com/character/ch0260393","main":true},{"actorName":"Kris Van Damme","urlProfile":"http://www.imdb.com/name/nm0888157","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MzkwMDY5N15BMl5BanBnXkFtZTcwNzc0MzAyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 May 1987","placeOfBirth":" Los Angeles County, California, USA","birthName":"Kristopher Julien Van Varenberg","height":"6' 1½\" (1.87 m)","bio":"Kristopher van Varenberg (aka \"Kris Van Damme\") is the first son of martial arts/action superstar, Belgian-born actor Jean-Claude Van Damme with fitness expert/actress Gladys Portugues. Kristopher has a younger sister, Bianca Brigitte VanDamme and another brother with Van Damme's ex-wife Darcy LaPier, named Nicolas. Kristopher first faced the camera in Universal Soldier (1992) as Young Luc Deveraux followed by The Quest (1996) -first film directed by Van Damme- in which he portrayed the character of Young Chris. He got his first acting role in Derailed (2002) then resumed his acting career in Universal Soldier: Regeneration (2009) and Soldiers (2010) -directed by Jean-Claude Van Damme. In an exclusive interview with Kristopher by the Int'l JCVD Forum, he said that he also has passion for writing and directing besides his career as an actor. He was credited as a writer for the first time in Van Damme's martial arts epic movie known as The Tower (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MzkwMDY5N15BMl5BanBnXkFtZTcwNzc0MzAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0888157","name":"Kris Van Damme","idIMDB":"nm0888157"},"actorId":"nm0888157","character":"Schell","urlCharacter":"http://www.imdb.com/character/ch0260402","main":true},{"actorName":"Marija Karan","urlProfile":"http://www.imdb.com/name/nm1461201","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM2NDEzNTI5N15BMl5BanBnXkFtZTcwMjA0MjkzNA@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1982","placeOfBirth":" Belgrade, Serbia, Yugoslavia","height":"5' 11¼\" (1.81 m)","bio":"Marija Karan was born on April 29, 1982 in Belgrade, Serbia, Yugoslavia. She is an actress, known for The Rite (2011), When I Grow Up, I'll Be a Kangaroo (2004) and Ljubav, navika, panika (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM2NDEzNTI5N15BMl5BanBnXkFtZTcwMjA0MjkzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1461201","name":"Marija Karan","idIMDB":"nm1461201"},"actorId":"nm1461201","character":"October","urlCharacter":"http://www.imdb.com/character/ch0260407","main":true},{"actorName":"Bianca Brigitte VanDamme","urlProfile":"http://www.imdb.com/name/nm2929749","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MTc4NjA2NV5BMl5BanBnXkFtZTgwODAxODkwNzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1990","placeOfBirth":" Los Angeles County, California, USA","birthName":"Bianca Bree Van Varenberg","height":"5' 7\" (1.7 m)","bio":"Bianca Bree grew up in the film industry watching her father, martial artist/actor Jean-Claude Van Damme preform on sets all over the world and is extremely athletic due to her mother, ex-bodybuilder and fitness competitor Gladys Portugues. Having two very athletic parents, Bianca was thrown into sports at a young age such as karate, kick-boxing, boxing, ballet and figure skating. After repetitively watching the Olympics on television, she realized that going to the Olympics was a dream of hers. The cattiness of figure skating made Bianca dislike the sport, many times she was close to quitting but the love she had for the ice kept her sane. Fortunately she came across short track speed skating and that's when she decided her goal was the 2010 winter Olympics. Within the year of 2002, Bianca trained like an animal, she was entered in many competitions winning all but two. She was also given many awards including one of the hardest awards to receive, \"Most improved\". Her motivation was manic until she was told by her parents that they were moving to Vancouver, Canada. Bianca fell into a depression causing a back injury from a crash during her last race, placing first. Bianca continued skating with the Canadian Olympic team until she couldn't handle the pain from her injury, causing her to make the choice she never thought she would consider. Bianca graduated high school at the age of 16, she then went to John Casablanca's in Vancouver to study acting. When she got offered a scholarship, she made the quick decision to assist her father around the world from film sets to business trips. Knowing she had an advantage, Bianca was very adamant when it came to educating herself about the film industry. In 2007, Bianca was asked to make her first film debut in The Shepherd (2008) as Kassie Robideaux. In 2010 she appeared in Soldiers (2010) as Bianca Banks, which was written, directed, produced and starred by her father, Jean-Claude Van Damme. In 2010 she played the role of Anna Flint in Assassination Games (2011). Bianca moved back to California and started speed skating again. But in 2011 a British TV network, ITV, approached Bianca's family to do a documented reality show titled; Jean Claude Van Damme: Behind Closed Doors (2011). After the TV show was released, Bianca got an email from director Dominic Burns offering her the part of Carrie, lead role of his film Alien Uprising (2012). Being her first genuine offer, Bianca took the chance and went to the UK to start shooting, given the opportunity to do her own stunts and gained a great relationship with Dominic Burns, as well as being in his next upcoming projects. When Alien Uprising (2012) wrapped, Bianca was sent straight to Romania to play the role of Amalia in 6 Bullets (2012). After shooting two back to back films, Bianca made the smart decision to take her acting career more serious. The next year of 2012, Bianca played the role of Ashley in the film Welcome to the Jungle (2013). Until Bianca starts her next upcoming projects, she occupies herself by staying in shape and expressing herself through poetry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MTc4NjA2NV5BMl5BanBnXkFtZTgwODAxODkwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2929749","name":"Bianca Brigitte VanDamme","idIMDB":"nm2929749"},"actorId":"nm2929749","character":"Anna Flint","urlCharacter":"http://www.imdb.com/character/ch0260411","main":true},{"actorName":"Andrew French","urlProfile":"http://www.imdb.com/name/nm0294040","urlPhoto":"","biography":{"bio":"Andrew French is an actor, known for Exorcist: The Beginning (2004), Dominion: Prequel to the Exorcist (2005) and Beyond Borders (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0294040","name":"Andrew French","idIMDB":"nm0294040"},"actorId":"nm0294040","character":"Nalbandian","urlCharacter":"http://www.imdb.com/character/ch0260418","main":true},{"actorName":"Attila Árpa","urlProfile":"http://www.imdb.com/name/nm0037074","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNDg1Mjk5N15BMl5BanBnXkFtZTgwMTkwNzY4OTE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1971","placeOfBirth":" Munich, West Germany","height":"6' 2\" (1.88 m)","bio":"Attila Árpa was born on November 17, 1971 in Munich, West Germany. He is an actor and producer, known for Spy (2015), Inferno (2016) and A Good Day to Die Hard (2013). He is married to Szabina Tomán. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNDg1Mjk5N15BMl5BanBnXkFtZTgwMTkwNzY4OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0037074","name":"Attila Árpa","idIMDB":"nm0037074"},"actorId":"nm0037074","character":"Telly","urlCharacter":"http://www.imdb.com/character/ch0260424","main":true},{"actorName":"Marioara Sterian","urlProfile":"http://www.imdb.com/name/nm0827450","urlPhoto":"","biography":{"dateOfBirth":"9 September 1953","placeOfBirth":" Braila, Romania","bio":"Marioara Sterian was born on September 9, 1953 in Braila, Romania. She is an actress, known for 4 Months, 3 Weeks and 2 Days (2007), Assassination Games (2011) and Cine mã strigã (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0827450","name":"Marioara Sterian","idIMDB":"nm0827450"},"actorId":"nm0827450","character":"Mrs. Pavlescu","urlCharacter":"http://www.imdb.com/character/ch0260432","main":true},{"actorName":"George Remes","urlProfile":"http://www.imdb.com/name/nm1855281","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDczMDcwODMzMV5BMl5BanBnXkFtZTcwNzQ3OTI2MQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1981","placeOfBirth":" Baia Mare, Romania","height":"6' (1.83 m)","bio":"George Remes was born on April 12, 1981 in Baia Mare, Romania. He is an actor and producer, known for Police, Adjective (2009), Assassination Games (2011) and Born to Raise Hell (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDczMDcwODMzMV5BMl5BanBnXkFtZTcwNzQ3OTI2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1855281","name":"George Remes","idIMDB":"nm1855281"},"actorId":"nm1855281","character":"Bartok","urlCharacter":"http://www.imdb.com/character/ch0260438","main":true}],"seasons":[],"idIMDB":"tt1436568","urlIMDB":"http://www.imdb.com/title/tt1436568","business":{"budget":{"money":"$8,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$57,208","country":"Russia","day":"19","month":"01","year":"2012","remarks":"78 Screens"}],"gross":[{"money":"$110,784","country":"Russia","day":"29","month":"02","year":"2012","remarks":""}],"weekendGross":[{"money":"$34,005","country":"Russia","day":"26","month":"02","year":"2012","remarks":"460 Screens"},{"money":"$57,208","country":"Russia","day":"19","month":"02","year":"2012","remarks":"78 Screens"}],"admissions":null,"productionDates":{"money":null,"country":null,"day":"10","month":"10","year":"2010","remarks":null},"filmingDates":[{"money":null,"country":null,"day":"05","month":"09","year":"2010","remarks":null},{"money":null,"country":null,"day":"15","month":"10","year":"2010","remarks":null}],"copyrightHolder":"Destination Films Distribution Company, Inc. All Rights Reserved."},"technical":{"runtime":["1 hr 41 min (101 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Red One MX"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":["Digital Intermediate (2K) (master format)","Redcode RAW (4.5K) (source format)"],"printedFilmFormat":null},"rating":"6.2","filmingLocations":[{"location":"MediaPro Studios, Bucharest, Romania"}],"rated":"R","awards":[],"votes":"14,271","type":"Movie","companyCreditsSimple":[{"idCompany":"co0117199","name":"Mediapro Studios"},{"idCompany":"co0071430","name":"Motion Picture Corporation of America (MPCA)"},{"idCompany":"co0273819","name":"Rodin Entertainment"}],"keywords":{"keywords":["assassin","interpol","axe","hotel","motel","fear","poison","sadism","sadist","melodrama","urban setting","haunted by the past","wedding singer","police","abandoned factory","nightmare","van","church","restaurant","reluctant hero","drug dealer","money","booby trap","doctor","newspaper headline","on the run","home invasion","diamond","hidden door","antique store","bare breasts","topless female nudity","hatred","sex slave","woman beater","scar","coming out of retirement","carpathian mountains","knocked out","corruption","american abroad","englishman abroad","stick fight","gunslinger","loner","walking stick","paranoia","suspicion","cigar smoking","cigarette smoking","tragic hero","tragedy","tragic past","dark hero","bodyguard","courthouse","camera phone","cell phone","photograph","walkie talkie","rogue agent","severed head","decapitation","massage","mansion","race against time","tied to a bed","sword","news report","prostitute","pimp","personal vendetta","accidental killing","armorer","assassination","assassination attempt","conspiracy","cover up","release from prison","disguise","wedding","husband wife relationship","ex convict","high tech weapon","city hall","set up","sunglasses","chess","piano","violin","secret room","tattoo","tied to a chair","duct tape over mouth","bound and gagged","apartment","turtle","contract killer","hired killer","armory","f word","sociopath","strangulation","thug","henchman","mobster","russian mafia","organized crime","gangster","mafia boss","mob boss","crime boss","russian","eastern europe","bucharest romania","wheelchair","ukraine","factory","neo noir","heroic bloodshed","righteous rage","revenge","corpse","innocent person killed","domestic abuse","death of brother","coma","rape victim","rapist","rape","gang rape","mexican standoff","dual wield","slow motion scene","slow motion action scene","reverse footage","character repeating someone else's dialogue","flashback","black and white scene","kitchen","impalement","meat cleaver","scene during opening credits","opening action scene","film starts with text","taser","electrocution","interrogation","throat slitting","police shootout","police chase","foot chase","head butt","beaten to death","beating","kicked in the stomach","kicked in the face","punched in the chest","punched in the face","junkyard","exploding car","laser pointer","lasersight","sawed off shotgun","crossbow","rifle","shotgun","escape","rescue","held at gunpoint","hostage","double cross","betrayal","deception","revolver","shot through a window","shot to death","shot in the back","shot in the chest","shot in the shoulder","shot in the arm","shot in the forehead","shot in the head","stabbed to death","stabbed in the chest","stabbed in the back","threatened with a knife","death","diamonds","refusal to talk under torture","hairy armpits","street shootout","bare chested male bondage","bare chested male","arms tied overhead","electrical torture","torture","ak 47","killer","beretta","glock","fight","fighting","chase","ambush","roundhouse kick","murder","violence","hand to hand combat","silencer","disarming someone","semiautomatic pistol","pistol","machine gun","sniper","sniper rifle","karate","karate kick","karate chop","kickboxing","martial arts","mixed martial arts","fistfight","brawl","duel","suspense","hitman","gore","brutality","blood splatter","blood","stylized violence","gun fu","gunfight","shootout","showdown","knife throwing","knife fight","warrior","tough guy","one against many","one man army","anti hero","action hero","hero","sharpshooter","knife","drug cartel","two word title","death of friend","death of father","independent film","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:52:05"}}