{"data":{"movies":[{"title":"Greystone Park","originalTitle":"","year":"2012","releaseDate":"2012","directors":[{"name":"Sean Stone","id":"nm0832165"}],"writers":[{"name":"Sean Stone","id":"nm0832165"},{"name":"Alexander Wraith","id":"nm2066764"}],"runtime":"83 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMDU0NTE5OF5BMl5BanBnXkFtZTcwMTE2NTExOA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Thriller"],"plot":"In October 2009, the filmmakers went into an abandoned psychiatric hospital to explore the 'haunted' institution, famous for its radical treatment of patients with mental illness. Electroshock, insulin therapy, and lobotomies were commonplace. Once inside, the filmmakers quickly discovered that they were not alone; this story is based on their experiences...","simplePlot":"In October 2009, the filmmakers went into an abandoned psychiatric hospital to explore the 'haunted' institution, famous for its radical treatment of patients with mental illness. ... ","actors":[{"actorName":"Sean Stone","urlProfile":"http://www.imdb.com/name/nm0832165","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTg3MDkzM15BMl5BanBnXkFtZTgwNjgxMDE1MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1984","placeOfBirth":" New York City, New York, USA","birthName":"Sean Christopher Stone","bio":"Sean Stone was born on December 29, 1984 in New York City, New York, USA as Sean Christopher Stone. He is an actor and director, known for Natural Born Killers (1994), The Doors (1991) and JFK (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTg3MDkzM15BMl5BanBnXkFtZTgwNjgxMDE1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0832165","name":"Sean Stone","idIMDB":"nm0832165"},"actorId":"nm0832165","character":"Sean","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexander Wraith","urlProfile":"http://www.imdb.com/name/nm2066764","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNDA5NDE2Ml5BMl5BanBnXkFtZTcwNDYyMzE1OA@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1979","placeOfBirth":" Englewood, New Jersey, USA","height":"6' (1.83 m)","bio":"Alexander Wraith was born June 29,1984 in Englewood, New Jersey, USA. He is an actor, known for Agents of S.H.I.E.L.D, Orange Is the New Black, Savages, Westworld, Taken 3. Alex trained at NIDA, the Australia's National Institute of Dramatic Art. Now! Alexander 'Alex' Wraith is one of the elite break out stars. Wraith is the new Action Stars exploding in Hollywood. He has the Look, the charisma and if that's not enough Alex has an unbelievable physics to complete the full package. Alex believes in empowering and helping the people \"You can do anything you put your mind to, think it, focus and do it!\" Wraith is the one to fill the market's void of the disappearing action film stars that we loved. Alex who has the dramatic acting arsenal, Wraith possesses invaluable qualities that are in demand for today's desired content. World renowned for his fastest head kick world record from the documentary \"Killer Legs\". Wraith is a master of many forms of martial art practices such Kickboxing, JKD, Kung Fu, western boxing and Gold medalist at the Jr. Olympian in Taekwondo. He has already exhibited his craft acting as a in several high profile projects next to Hollywoods best in film and television. In addition to his accolades as a martial artist, Alex possesses an extraordinary ability to act outside the realm of action. With the ability to incorporate drama into his roles, Alex has a massive range to accentuate his raw on screen presence of the classic Hollywood leading man. Alex is an Oliver Stone archetype spending years with Mr. Stone on and off set learning and watching from the best and is backed by a respected and decorated history coming from domestic, respectable powerhouses such as Columbia University, Carnegie Hall, Lee Strasberg and Bill Esper Studios.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNDA5NDE2Ml5BMl5BanBnXkFtZTcwNDYyMzE1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2066764","name":"Alexander Wraith","idIMDB":"nm2066764"},"actorId":"nm2066764","character":"Alex","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ella Lentini","urlProfile":"http://www.imdb.com/name/nm2965776","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MDk3ODc0OV5BMl5BanBnXkFtZTgwMTI4MTEyODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Antonella Lucia Lentini","height":"5' 4\" (1.63 m)","bio":"Ella Lentini was born and raised in New York City. She is the youngest of five kids. Her father, Lino Lentini was a renowned tailor, her mother, Jennifer De Lentini was a painter. As a child, she performed Charlie Chaplin-esque plays for family friends. As a teen she attended a weekend program at the Neighborhood Playhouse. Later, at the Beacon School she became involved in political and social activism, traveling to South Africa and New Orleans as a volunteer. At a young age, Ella discovered the importance of storytelling and film in society. After high school she attended New York University's Gallatin school of individualized study, where she was accepted for creative writing and photography before developing her own major, 'Screenwriting as a Weapon'. She continues to act while studying, writing and directing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MDk3ODc0OV5BMl5BanBnXkFtZTgwMTI4MTEyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2965776","name":"Ella Lentini","nicknames":["Ella","Nellie"],"idIMDB":"nm2965776"},"actorId":"nm2965776","character":"Antonella","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Schramm","urlProfile":"http://www.imdb.com/name/nm4107739","urlPhoto":"","biography":{"bio":"John Schramm has been involved in film and television for the last 5 years, appearing in films such as \"P.S. I love You\", \"Hitch\" and \"Two Weeks Notice\" among others. John first started his film career by studying at HB Studios, where the likes of Robert DeNiro, Al Pacino, and Barbra Streisand attended. He has also studied privately with acting coach Laurie Ann Davis. In 2010, John decided to branch out beyond acting into screenwriting. His first screenplay, \"East Street\", was optioned at Suzanne De Laurentis Productions and Academy-Award nominated Screenwriter. Stephen Rivele, was attached to do a rewrite. Triplicity Entertainment Productions, one of the production companies attached to the project, put John on their \"Top Young Talent to Watch\" list for his writing efforts. 2011 has seen John develop several feature length projects, including two with veteran screenwriter Fredric Lebow (\"While You Were Sleeping\"). On the acting front, John has a supporting role in the upcoming horror/thriller, \"Graystone\", directed by Sean Stone, co-written by and starring Alexander Wraith, and featuring legendary director, Oliver Stone.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4107739","name":"John Schramm","idIMDB":"nm4107739"},"actorId":"nm4107739","character":"John","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Monique Zordan","urlProfile":"http://www.imdb.com/name/nm2992243","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MTE3Mjg4OV5BMl5BanBnXkFtZTcwMDUxNjQxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Monique Zordan is an actress, known for Surviving the Outbreak (2016), Greystone Park (2012) and 4 Nights in the Hamptons (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MTE3Mjg4OV5BMl5BanBnXkFtZTcwMDUxNjQxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2992243","name":"Monique Zordan","idIMDB":"nm2992243"},"actorId":"nm2992243","character":"Monique","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Oliver Stone","urlProfile":"http://www.imdb.com/name/nm0000231","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMjExMTY3OV5BMl5BanBnXkFtZTcwNjY3MDA2MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1946","placeOfBirth":" New York City, New York, USA","birthName":"William Oliver Stone","height":"6' (1.83 m)","bio":"Oliver Stone has become known as a master of controversial subjects and a legendary film maker. His films are filled with a variety of film angles and styles, he pushes his actors to give Oscar-worthy performances, and despite his failures, has always returned to success. William Oliver Stone was born in New York City, to Jacqueline (Goddet) and Louis Stone, a stockbroker. His American father was from a Jewish family (from Germany and Eastern Europe), and his mother, a war bride, was French (and Catholic). After dropping out of Yale University, he became a soldier in the Vietnam War. Serving in two different regiments (including 1rst Cavalry), he was introduced to The Doors, drugs, Jefferson Airplane, and other things that defined the sixties. For his actions in the war, he was awarded a Bronze Star for Gallantry and a Purple Heart. Returning from the war, Stone did not return to graduate from Yale. His first film was a student film entitled Last Year in Viet Nam (1971), followed by the gritty horror film La reine du mal (1974) for which he also wrote the screenplay. The next seven years saw him direct two films: Mad Man of Martinique (1979) and The Hand (1981), starring Michael Caine. He also wrote many screenplays for films such as Midnight Express (1978), Conan the Barbarian (1982), and Scarface (1983). Stone won his first Oscar for Midnight Express (1978), but his fame was just beginning to show. 1986 was the year that brought him much fame to the U.S.A. and the world. He directed the political film Salvador (1986) starring Oscar-nominated James Woods. However, his big hit was the Vietnam war film Platoon (1986) starring Charlie Sheen,Willem Dafoe, Tom Berenger, and Francesco Quinn. Berenger and Dafoe received Oscar nominations for their roles as the polar opposite sergeants who each influence the tour of duty of Chris Taylor (Sheen). Stone won his first Oscar for directing this film, which won Best Picture and was a hit at the box office. After Platoon (1986), Stone followed up with the critically acclaimed Wall Street (1987). The movie, starring Charlie Sheen and Michael Douglas, focuses on the business world of tycoons and stock brokers. The film was well received and won an Oscar for Douglas' portrayal of the villainous Gordon Gekko. Stone returned immediately the following year with Talk Radio (1988), which talked of a foul-mouthed radio host (played by Eric Bogosian) who never fails to talk about the serious issues. Although it was not as successful as his last three films, Stone did not slow down at all. He directed Tom Cruise into an Oscar-nominated role in Born on the Fourth of July (1989). The movie talked about the return of an embittered, crippled Vietnam soldier from the war. Although it failed to win Best Picture or Best Actor, Oliver Stone won an Academy Award for Directing, his third win to date. After Born on the Fourth of July (1989), Stone took a hand in producing several movies, including the Academy Award-winning film Reversal of Fortune (1990). He returned to the director's chair in 1991, once again with two films. Val Kilmer starred as the legendary and controversial Jim Morrison in Stone's psychedelic film The Doors (1991). Despised by former Doors member Ray Manzarek, the film is nevertheless a wonderful achievement, with Kilmer pulling off an almost flawless impersonation of Morrison. Regardless of opinion, The Doors (1991) was overshadowed by Stone's colossal film JFK (1991), which Stone himself considers the best of his films. In Stone's movie, Jim Garrison tackles the conspiracy behind the murder of America's president John F. Kennedy. The large cast featured such well-known names as Kevin Costner, Tommy Lee Jones, John Candy, Joe Pesci, Donald Sutherland, and Walter Matthau. This film represented a change in Stone's works, because it was with this film that he really began to explore the different camera styles and combining them together to create a multi-dimensional way of showing a movie. JFK (1991), as with Platoon (1986) and Born on the Fourth of July (1989), earned eight Oscar nominations and was one of Stone's most successful films. However, he failed to win a third Oscar for Best Director. After this film, Stone directed his third Vietnam film to date. Entre ciel et terre (1993) was a film about the war from the viewpoint of a Vietnamese girl, and also co-starred Tommy Lee Jones (who had received an Oscar nomination for JFK (1991)). Despite its new woman's perspective and several positive reviews, it was a box office failure. Stone was unfazed; his next film is perhaps his most notorious film to date. Adapting a screenplay by Quentin Tarantino, Stone made Natural Born Killers (1994) starring Woody Harrelson, Juliette Lewis, Tom Sizemore and Rodney Dangerfield in his only dramatic performance. The film was received well at the box office, while review were very mixed. Because of the violence that people claimed was inspired by the film, it was compared to Stanley Kubrick's A Clockwork Orange (1971). As usual, Stone was at the center of controversial subjects; his next film Nixon (1995) was no exception. The film focused on the life of President Richard Nixon, played by Anthony Hopkins, while featuring another well-known cast, including Joan Allen in the role of Nixon's wife. Both went on to receive Oscar nominations, while Stone received his sixth Oscar nomination for Screenwriting. The film got mixed reviews, and failed to recoup its budget. Aside from directing, Stone has worked as a producer on several different films. There was, of course, the successful film Reversal of Fortune (1990), which won Jeremy Irons an Oscar and also nominated the director for an Oscar. There was also the highly praised and successful emotional drama The Joy Luck Club (1993) which centered around four Chinese immigrant women whose relationships with their daughters is affected by their own lives. Another highly praised Oscar nominated film was Milos Forman's classic film The People vs. Larry Flynt (1996) starring Woody Harrelson, Edward Norton, and Courtney Love. Whether the crime/action film The Corruptor (1999) or the brilliant war epic Savior (1998), Stone has worked in a variety of film genres. Stone had directed ten films in nine years; now however, he began to slow down. He directed the film U Turn - Ici commence l'enfer (1997) starring Sean Penn and Jennifer Lopez. As with Natural Born Killers (1994), it was a dark and twisted satire on violence, but did not have the same success as the former. Stone was set to direct several projects in the late 90's but they fell through and were not made. However, success came back to Stone in the Al Pacino film Any Given Sunday (1999). This sports movie centered on the life behind the game of football, and it starred an impressive cast that included frequent Stone collaborators James Woods and John C. McGinley. This film was one of his most successful box office films, and put him back on track. The following years brought Stone no new theatrical films, though he did make three fascinating TV documentaries. Two of them, 'Looking for Fidel' and Comandante (2003) were interviews of Cuban dictator Fidel Castro, while 'Persona Non Grata' was an interview of several Palestinian leaders. Stone was also set to direct American Psycho (2000) with Leonardo DiCaprio and Beyond Borders (2003), starring Angelina Jolie and at the time, Ralph Fiennes. However, Stone dropped out of both projects, as did a number of the actors mentioned. Finally, five years after Any Given Sunday (1999), Stone directed a film he'd long wanted to make; the colossal epic Alexander (2004). Starring Colin Farrell as the Macedonian leader, Stone attempted to capture the essence of Alexander the Great through his conquests of the known world. The film focused on Alexander's relationships with his parents (a brilliant performance by Val Kilmer and a less impressive one by Angelina Jolie) and his relationships with his wife and childhood friend/ gay lover (played by Rosario Dawson and Jared Leto respectively). Alexander (2004) was a critical failure, and failed to win back its budget domestically. Despite being one of 2004's highest grossing films internationally, and recouping its budget through DVD sales, Stone's pet project was heavily criticized. Despite a far superior version (Alexander Revisited) being released on DVD, the film's reputation remains low by the majority. Stone was personally stung at these attacks, but managed to rebound, if mildly, with his hopeful film World Trade Center (2006). The film centers on two firefighters trapped in the rubble of the twin towers. It received good reviews, and allowed Oliver to step forward from his failure towards the possibility of more films. In late 2007, besides a number of projects Stone was set to direct \"Pinkville\", which would have been his fourth Vietnam film to date. It was set to star a large number of well known actors such as Bruce Willis, Toby Jones, Channing Tatum, Michael Pitt, Woody Harrelson, and Michael Peña. However, a week before shooting was to begin, the Writer's Strike was started, and the finance for the film was cut, using the strike as an excuse. After Willis backed out of the project, it was eventually scuttled, much like Stone's early productions of Platoon (1986) and Born on the Fourth of July (1989). Stone turned to another project he had worked on with former Wall Street (1987) collaborator Stanley Weiser. The project was W. (2008), a biography on president George W. Bush. Stone initially cast Christian Bale in the role of Bush but the actor dropped out at the last minute. Josh Brolin was cast, and this followed with a large cast of well known Oscar nominated character actors such as Richard Dreyfuss, James Cromwell, and Ellen Burstyn. The film was made in a record four months, starting in June and released in October. The film opened to mixed reviews, and though film's budget was recouped, it was not a financial hit. Stone then made the documentary South of the Border (2009), a documentary which focused on bringing to light the positive aspects of the left-wing governments in South America, particularly Hugo Chavez in Venezuela. Stone was much less critical than usual, instead making the documentary as a response to the harsh reputation that Chavez has in the States. The documentary was poorly received in the States. Stone also began work on Wall Street: Money Never Sleeps (2010). Starring Michael Douglas, Shia LaBeouf, Josh Brolin, Carey Mulligan, and Eli Wallach, the film focuses on the 2008 economic crisis, and the return of Gordon Gekko from prison. The film was screened at Cannes to positive reception, and hailed as Stone's triumphant return. After this, Stone made a film adaptation of \"Savages\", a novel by Don Winslow. The movie follows two highly successful marijuana growers (Taylor Kitsch and Aaron Taylor-Johnson ), whose shared girlfriend (Blake Lively) is kidnapped by a Mexican cartel and held for ransom. The movie also starred Salma Hayek, Benicio Del Toro, John Travolta, and Emile Hirsch. The film was a return to the tense action and violence of Stone's earlier films, though it polarized many audience members due to the colorful narrations of Lively's vapid and naive character, as well as the film's ending. Oliver Stone is a three-time Oscar winner, and although he has mostly been stung by critics of his films, he remains a well-known name today in the film industry. The films he directed have been nominated for 31 Academy Awards, including eight for acting, six for screen writing, and three for directing. There is no denying that Stone has cemented himself a position among the legends of Hollywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMjExMTY3OV5BMl5BanBnXkFtZTcwNjY3MDA2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000231","name":"Oliver Stone","idIMDB":"nm0000231"},"actorId":"nm0000231","character":"Oliver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Monique van Vooren","urlProfile":"http://www.imdb.com/name/nm0888207","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGFkZjliMzUtYmM5Mi00M2Q0LThkMDAtYWZiZTdlOTZkMzM1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 March 1925","placeOfBirth":" Brussels, Belgium","bio":"Monique van Vooren was born on March 23, 1925 in Brussels, Belgium. She is an actress, known for Wall Street (1987), Flesh for Frankenstein (1973) and Sugar Cookies (1973).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGFkZjliMzUtYmM5Mi00M2Q0LThkMDAtYWZiZTdlOTZkMzM1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0888207","name":"Monique van Vooren","idIMDB":"nm0888207"},"actorId":"nm0888207","character":"Monique","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jessica Lentini","urlProfile":"http://www.imdb.com/name/nm8017593","urlPhoto":"","biography":{"bio":"Jessica Lentini is an actress, known for Greystone Park (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm8017593","name":"Jessica Lentini","idIMDB":"nm8017593"},"actorId":"nm8017593","character":"Crazy Kate / Medusa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Stone","urlProfile":"http://www.imdb.com/name/nm7544132","urlPhoto":"","biography":{"bio":"Michael Stone is an editor and actor, known for Crush It (2015), Campaign America! (2016) and Greystone Park (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7544132","name":"Michael Stone","idIMDB":"nm7544132"},"actorId":"nm7544132","character":"Billy Lasher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bruce Payne","urlProfile":"http://www.imdb.com/name/nm0668271","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTJiN2ExOGQtZjM3Ni00YTQ3LWIwNjItY2FiN2U4M2RhNTFiXkEyXkFqcGdeQXVyNjk0MDk3MTQ@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1958","placeOfBirth":" Woking, Surrey, England, UK","birthName":"Bruce Martyn Payne","height":"6' 1\" (1.85 m)","bio":"Having worked extensively in film, theatre and television in both the UK and the US, and on location in many parts of the world, Payne most recently starred in the fascinating psychological drama One Point O (2004), which was well received at Cannes. He also starred in the live action feature film Steal (2002), with Natasha Henstridge and Stephen Dorff and has also appeared in Douglas Aarniokoski's Highlander: Endgame (2000), Dungeons & Dragons (2000) alongside Jeremy Irons, Thora Birch and Marlon Wayans, and Hellborn (2003). Other film credits include Kevin Hooks ' Passenger 57 (1989), Apocalypse (1999) with the late Richard Harris, Julien Temple's Absolute Beginners (1999), The Brothel (1999), Switch (1999), with Ellen Barkin and Kounterfeit (1996) with Hilary Swank. Television credits include leading roles in Simon West's Keen Eddie (2003) which aired in June 2003, Wilde (1997) and Smart Money (1996) for the BBC, and Tales from the Crypt (1989) for HBO. Theatre credits include the lead in the London West End productions West and Greek, and the lead in Nicholas Hytner's Alice, as well as playing Frank'n'further in the Rocky Horror Show. Bruce Payne (Producer, Actor) was born in London Town and is a much-loved and much-respected talent recognized around the world. Known in the Industry as the consummate professional. Mr P, Originally trained at RADA where he was awarded the Edmund Gray Award for High Comedy (Mr Payne won 6 in total), before refining his craft on stage and in feature films such as Absolute Beginners (1986) alongside David Bowie and erstwhile collaborator Steven Berkoff. (Theatre:-\"West and Greek\") Known for playing Charles Rane, in action-thriller Passenger 57 (1992) opposite Wesley Snipes, and also for his roles in, Highlander: Endgame (2000), Dungeons & Dragons (2000) and Counterfeit (2010) with Hilary Swank. He also featured in For Queen and Country (2010) with Denzel Washington and Switch (2011) with Ellen Barkin. Most recently Bruce has been seen with Jon Voight, Ethan Hawke and Selena Gomez in Warner Bros Getaway (2013) and 2015 in the French Foreign Language Film Victor Young Perez (2013), based on the true story of World Champion Victor Perez and also for Director Stephen Reynolds Vendetta (2013) and Jonnie Malachi's Breakdown (2016) and Creators: The Past (2016) , as well as playing a main Acting role, also as Co-Producer and 1st A.D. to the director, alongside the talents of William Shatner, Gérard Depardieu for director 'Beppe Zaia- ArtUniverse', Italy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTJiN2ExOGQtZjM3Ni00YTQ3LWIwNjItY2FiN2U4M2RhNTFiXkEyXkFqcGdeQXVyNjk0MDk3MTQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0668271","name":"Bruce Payne","idIMDB":"nm0668271"},"actorId":"nm0668271","character":"Demonic Voice","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pete Antico","urlProfile":"http://www.imdb.com/name/nm0031055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmZhNDdkOGEtNTUzOS00YTNkLWFjMDItYTZlYzYyYWQwODlhXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Pete Antico was born in New York City, New York, USA. He is known for his work on Through My Father's Eyes (2017), Creators: The Past and Faith (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmZhNDdkOGEtNTUzOS00YTNkLWFjMDItYTZlYzYyYWQwODlhXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0031055","name":"Pete Antico","idIMDB":"nm0031055"},"actorId":"nm0031055","character":"Dinner Table Guest","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Coralie Charriol Paul","urlProfile":"http://www.imdb.com/name/nm4081841","urlPhoto":"","biography":{"bio":"Coralie, daughter of Philippe Charriol, is currently Vice President and Creative Director for jewelry and leather goods at CHARRIOL, the Swiss luxury marquee created by her father in 1983. From her home base in New York where she lives with her husband and two children, Coralie devotes her time to working with CHARRIOL's designers to create and refine the jewelry and leather goods collections. Her responsibilities take her around the world on a regular basis, not only between CHARRIOL's two headquarters in Geneva and Hong Kong, but also to visit key clients and the brand's partners across Asia (Japan, Philippines, and Indonesia), the Middle East, South/Central America, and the Caribbean. Life as a nomad is second nature to Coralie. Born in Hawaii, she has also lived in Hong Kong, Geneva, London, Paris and Boston. She also acquired a taste for travel from her father whom, in addition to his criss-crossing the globe for his work, also took his children with him on vacation to the four corners of the Earth. By the age of 16, Coralie had visited 26 different countries! This experience has endowed her with an extremely open-minded attitude, an ability to approach all cultures without prejudice and fluency in five languages (French, English, Spanish, Italian and Japanese) - a major asset in the exercise of her profession. Coralie cultivated her artistic flair during her studies at Tufts University (Boston), as well as certificate programs at the Gemological Institute of America (New York) and the New York Film Academy (New York). As luck would have it, one of her assignments during a design course she was taking along with other disciplines was to create accessories. After her father saw her talent, he asked Coralie to re-launch his brand's accessories collections. CHARRIOL produced its first leather goods collection under the name \"Coralie\" and entrusted her with promoting the range in Asia and the Middle East. Now in her 10th collection of leather goods, Coralie has brought the highest quality and design to the CHARRIOL line. On the jewelry side, Coralie started by creating a collection of wedding rings for the Japanese market. This led to a second collection named \"Coralie\", backed by a second and extremely successful promotional campaign. As Creative Director for jewelry, she designed 15 collections to date, including best-sellers such as \"Crazy in Love\", \"Forever Love\", \"Kimono\", \"Bamboo\", \"Kucha\", \"Pom Pom Pearl\" and \"Circle of Love\". In a sensational incursion into the world of watches, Coralie also created the famous Kucha which was honoured as \"Ladies' Watch of the Year\" by the professional jury of the Swiss \"Montre de l'Année\" award in 2005. In parallel, Coralie continues to work closely with the head office in Geneva on public relations. She also serves, along with her father, as the primary ambassador for the brand. The 2005-2007 advertising campaigns showcased her as the brand's designer and muse. Coralie's image as a young, elegant, dynamic and daring woman conveys \"l'Art de vivre la difference\" in a convincingly authentic manner.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4081841","name":"Coralie Charriol Paul","idIMDB":"nm4081841"},"actorId":"nm4081841","character":"Dinner Table Guest","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lauren Berlingeri","urlProfile":"http://www.imdb.com/name/nm6623471","urlPhoto":"","biography":{"birthName":"Lauren Elise Berlingeri","height":"5' 8½\" (1.74 m)","bio":"Lauren Berlingeri was born as Lauren Elise Berlingeri. She is an actress, known for Greystone Park (2012) and Access Hollywood (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6623471","name":"Lauren Berlingeri","idIMDB":"nm6623471"},"actorId":"nm6623471","character":"Dinner Table Guest","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zana Markelson","urlProfile":"http://www.imdb.com/name/nm4362482","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNzU4MTkzNF5BMl5BanBnXkFtZTcwOTI1NjMxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Zana Markelson is an actress, known for The Wolf of Wall Street (2013), Greystone Park (2012) and Wall Street: Money Never Sleeps (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNzU4MTkzNF5BMl5BanBnXkFtZTcwOTI1NjMxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4362482","name":"Zana Markelson","idIMDB":"nm4362482"},"actorId":"nm4362482","character":"Dinner Table Guest","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicole Seidel","urlProfile":"http://www.imdb.com/name/nm8017594","urlPhoto":"","biography":{"bio":"Nicole Seidel is an actress, known for Greystone Park (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm8017594","name":"Nicole Seidel","idIMDB":"nm8017594"},"actorId":"nm8017594","character":"Dinner Table Guest","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1588886","urlIMDB":"http://www.imdb.com/title/tt1588886","business":{"budget":{"money":"$550,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 23 min (83 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["Digital"]},"rating":"3.2","filmingLocations":[{"location":"Parsippany, New Jersey, USA"}],"rated":"R","awards":[],"votes":"1,399","type":"Movie","companyCreditsSimple":[{"idCompany":"co0295797","name":"Mind the GAP Productions"},{"idCompany":"co0221141","name":"Headlong Entertainment"}],"keywords":{"keywords":["hospital","no opening credits","abandoned hospital","flickering light","haunted hospital","ghost story","ghost","urban exploration","doll","abandoned building","video camera","found footage","mental institution","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:59:48"}}