{"data":{"movies":[{"title":"The Skeleton Twins","originalTitle":"","year":"2014","releaseDate":"20140911","directors":[{"name":"Craig Johnson","id":"nm2574897"}],"writers":[{"name":"Craig Johnson","id":"nm2574897"},{"name":"Mark Heyman","id":"nm2114730"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk5MjM3NDEwN15BMl5BanBnXkFtZTgwMDIxNjYzMjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Romance"],"plot":"After ten years of estrangement, twins Maggie and Milo coincidentally cheat death on the same day, prompting them to reunite and confront how their lives went so wrong. As the twins' reunion reinvigorates them both, they realize that the key to fixing their lives just may lie in fixing their relationship with each other.","simplePlot":"Having both coincidentally cheated death on the same day, estranged twins reunite with the possibility of mending their relationship.","actors":[{"actorName":"Bill Hader","urlProfile":"http://www.imdb.com/name/nm0352778","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY3MzgwMjE3N15BMl5BanBnXkFtZTcwNjc2MjE3NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1978","placeOfBirth":" Tulsa, Oklahoma, USA","height":"6' 1\" (1.85 m)","bio":"Bill Hader was born on June 7, 1978 in Tulsa, Oklahoma, USA. He is an actor and producer, known for Inside Out (2015), Superbad (2007) and Saturday Night Live (1975). He has been married to Maggie Carey since 2006. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY3MzgwMjE3N15BMl5BanBnXkFtZTcwNjc2MjE3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0352778","name":"Bill Hader","idIMDB":"nm0352778"},"actorId":"nm0352778","character":"Milo Dean","urlCharacter":"http://www.imdb.com/character/ch0462308","main":true},{"actorName":"Kristen Wiig","urlProfile":"http://www.imdb.com/name/nm1325419","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MTA0MDA5NF5BMl5BanBnXkFtZTgwODMyMjA1NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 August 1973","placeOfBirth":" Canandaigua, New York, USA","birthName":"Kristen Carroll Wiig","height":"5' 5\" (1.65 m)","bio":"Kristen Carroll Wiig was born on August 22, 1973 in Canandaigua, New York, to Laurie J. (Johnston), an artist, and Jon J. Wiig, a lake marina manager. She is of Norwegian (from her paternal grandfather), Irish, English, and Scottish descent. The family moved to Lancaster, Pennsylvania, before settling in Rochester, New York. When Wiig was 9 years old, her parents divorced and she lived with her mother and older brother Erik. After graduating from Brighton High School in Rochester, Wiig attended the University of Arizona as an art student. She took her first acting class, as an elective, and was soon encouraged by her teacher to pursue acting. Years later, she moved to Los Angeles and Wiig worked as a main company member of the Los Angeles-based improv and sketch-comedy troupe The Groundlings. As a Groundlings alumna, she joins the ranks of such SNL cast mates as Maya Rudolph, Will Ferrell, Phil Hartman, and Jon Lovitz. Wiig made her big-screen debut to universal high praise as Katherine Heigl's passive-aggressive boss in Judd Apatow's smash-hit comedy Knocked Up (2007). Additional film credits include Drew Barrymore's directorial debut, Whip It (2009), starring Ellen Page; Greg Mottola's Adventureland (2009), with Ryan Reynolds, Kristen Stewart and Jesse Eisenberg; David Koepp's Ghost Town (2008), with Ricky Gervais; and Jake Kasdan's Walk Hard: The Dewey Cox Story (2007), another Apatow-produced film, in which she starred opposite John C. Reilly. She has also guest-starred on the Emmy-winning NBC series 30 Rock (2006), the HBO series Bored to Death (2009), with Jason Schwartzman, and Flight of the Conchords (2007). Wiig joined the cast of Saturday Night Live (1975) in 2008, and was known for playing such memorable characters as the excitable Target clerk, Lawrence Welk singer Doonese, the hilarious one-upper Penelope, House Speaker Nancy Pelosi, and Suze Orman, among others. Wiig earned two Emmy nominations for Outstanding Supporting Actress in a Comedy Series for her work on the show. She left the show in the spring of 2012. In 2011, Wiig co-wrote and starred in Bridesmaids (2011), along with Melissa McCarthy, Maya Rudolph, and Rose Byrne. The film was a box office hit and won several awards, plus earned two Oscar nominations (Best Supporting Actress and Best Original Screenplay), and two Golden Globes nominations (Best Motion Picture - Comedy or Musical and Best Actress). Wiig also appeared in such notable films as Greg Mottola's Paul (2011), opposite Simon Pegg and Nick Frost; Andrew Jarecki's All Good Things (2010), opposite Ryan Gosling, Kirsten Dunst and Frank Langella; DreamWorks Animation's How to Train Your Dragon (2010), with Gerard Butler and Jay Baruchel; the Universal Pictures' animated feature film Despicable Me (2010), starring Steve Carell and Jason Segel; and Jennifer Westfeldt's Friends with Kids (2011), opposite Jon Hamm, Megan Fox, Adam Scott, Maya Rudolph and Westfeldt.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MTA0MDA5NF5BMl5BanBnXkFtZTgwODMyMjA1NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1325419","name":"Kristen Wiig","idIMDB":"nm1325419"},"actorId":"nm1325419","character":"Maggie Dean","urlCharacter":"http://www.imdb.com/character/ch0407085","main":true},{"actorName":"Luke Wilson","urlProfile":"http://www.imdb.com/name/nm0005561","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE3MjYxNDk4Nl5BMl5BanBnXkFtZTcwMDQ5OTQzMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 September 1971","placeOfBirth":" Dallas, Texas, USA","birthName":"Luke Cunningham Wilson","height":"5' 11\" (1.8 m)","bio":"Handsome Texan Luke Cunningham Wilson was born in Dallas in 1971, to Irish-American parents originally from Massachusetts. The son of Laura (Cunningham), a photographer, and Robert Andrew Wilson, an advertising executive, he was raised with two brothers, Owen Wilson (the middle one) and Andrew Wilson (the eldest one). The three would all go on to make their careers in film, with Luke Wilson discovering his love of acting while a student at Occidental College. In 1993, the brothers Wilson collaborated with Wes Anderson to make Bottle Rocket (1994), which was initially a 13-minute short. The gleefully optimistic story of three Texans who aspire to become successful thieves, Bottle Rocket (1994) premiered at the 1993 Sundance Festival, where it attracted the attention of director James L. Brooks. With Brooks' help, the short became a full-length feature film released in 1996 under the same name, Bottle Rocket (1996). Afterwards, Wilson moved to Hollywood, setting up house with his two brothers and Anderson and the same year, Wilson also appeared in the coming-of-age drama Telling Lies in America (1997). After large roles in three 1998 comedies, Best Men (1997), Bongwater (1998), and Home Fries (1998) (the latter two co-starring Drew Barrymore), Wilson went on to star in another three comedies the following year. The first, Dog Park (1998), was a Canadian film directed by The Kids in the Hall (1988) alum Bruce McCulloch and featured Wilson as one of a group of twenty-something's undergoing the trials and tribulations of love. Blue Streak (1999) starred the actor as the sidekick of robber-turned-policeman Martin Lawrence, while Kill the Man (1999) (which premiered at the 1999 Sundance Festival) cast him as the owner of a small copy centre competing with a large chain store across the street. Though he would stick closely to comedy through 2001 with roles in Charlie's Angels (2000) and Legally Blonde (2001), Wilson took a turn for the sinister in the thrillers Bad Seed (2000) and Soul Survivors (2001) before reteaming with his brother Owen Wilson and Wes Anderson to give one of his most memorable performances as Richie in The Royal Tenenbaums (2001). In 2003, Wilson reprised two past roles, appearing in both Charlie's Angels: Full Throttle (2003) and Legally Blonde 2: Red, White & Blonde (2003). That same year, he also scored a hit as one of the stars of Todd Phillips' Old School (2003). The year 2004 saw Wilson embark on The Wendell Baker Story (2005), a film he starred in, co-directed with brother Andrew Wilson. Although he made his film debut in the acclaimed independent film Bottle Rocket (1996), he initially got more recognition for his real-life role as Drew Barrymore's boyfriend than for his acting. Fortunately for Wilson, his onscreen talents outlasted his relationship with Barrymore, and he has enjoyed steady employment and increasing visibility through substantial roles in a number of films","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE3MjYxNDk4Nl5BMl5BanBnXkFtZTcwMDQ5OTQzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005561","name":"Luke Wilson","nicknames":["One-Take Wilson"],"idIMDB":"nm0005561"},"actorId":"nm0005561","character":"Lance","urlCharacter":"http://www.imdb.com/character/ch0471943","main":true},{"actorName":"Ty Burrell","urlProfile":"http://www.imdb.com/name/nm0123092","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MjE1NzIxNl5BMl5BanBnXkFtZTcwNTY4NjI4NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 August 1967","placeOfBirth":" Grants Pass, Oregon, USA","birthName":"Tyler Gerald Burrell","height":"6' (1.83 m)","bio":"Tyler Gerald Burrell was born on August 22, 1967 in Grants Pass, Oregon, where his family owned a business. He is the son of Sheri Rose (Hauck), a teacher, and Gary Gerald Burrell, a family therapist, and is primarily of English and German ancestry. He earned a BA from Southern Oregon University and attended The University of Oregon while working as a bartender; he finished his education at Penn State where he got an MFA. In his early career, Burrell appeared in the films Black Hawk Down (2001) and Dawn of the Dead (2004). He also appeared in a Broadway production of \"Macbeth\". After a few appearances on Law & Order (1990) Burrell starred in the comedy sitcoms Out of Practice (2005) and Back to You (2007), costarring Patricia Heaton and Kelsey Grammer. He also made film appearances in The Incredible Hulk (2008) and National Treasure: Book of Secrets (2007). In 2009, Christopher Lloyd gave him the part of Phil Dunphy on the smash hit television series Modern Family (2009) which has gotten rave reviews, Emmys, and the #1 spot on television several times. Burrell himself has gotten 4 Emmy nominations and one win in 2011 because of his popular role. Burrell will appear in the upcoming Finding Dory (2016) and has also recently starred in Mr. Peabody & Sherman (2014) as well as Muppets Most Wanted (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MjE1NzIxNl5BMl5BanBnXkFtZTcwNTY4NjI4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0123092","name":"Ty Burrell","idIMDB":"nm0123092"},"actorId":"nm0123092","character":"Rich","urlCharacter":"http://www.imdb.com/character/ch0423729","main":true},{"actorName":"Boyd Holbrook","urlProfile":"http://www.imdb.com/name/nm2933542","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NTIwMTE5M15BMl5BanBnXkFtZTcwODUxODgwNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 September 1981","placeOfBirth":" Prestonsburg, Kentucky, USA","birthName":"Robert Boyd Holbrook","height":"6' 2\" (1.88 m)","bio":"Boyd Holbrook is an American actor and fashion model. He has appeared in films such as Milk (2008), Out of the Furnace (2013), Gone Girl (2014), A Walk Among the Tombstones (2014), Run All Night (2015) and in the Netflix series Narcos. In 2007 Holbrook sent a screenplay to director Gus Van Sant, who was impressed enough to give him the role of Denton Smith for the movie Milk (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NTIwMTE5M15BMl5BanBnXkFtZTcwODUxODgwNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2933542","name":"Boyd Holbrook","idIMDB":"nm2933542"},"actorId":"nm2933542","character":"Billy","urlCharacter":"http://www.imdb.com/character/ch0492468","main":true},{"actorName":"Joanna Gleason","urlProfile":"http://www.imdb.com/name/nm0322306","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA1NTAwODc1MV5BMl5BanBnXkFtZTcwNDM5NzAzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 June 1950","placeOfBirth":" Winnipeg, Manitoba, Canada","birthName":"Joanne Hall","bio":"She may be the daughter of Let's Make a Deal (1963) game show host Monty Hall (ne Maurice Halperin), but talented Joanna Gleason has never had to worry about being overshadowed by her father's looming TV star. Born Joanna Hall on June 2, 1950 in Toronto, Ontario, Canada (her father and mother (Marilyn Plotell Hall) were wed in Winnipeg, Manitoba), her father was working for the Canadian Wheat Board at the time and breaking into the radio business. As such, by the time Joanna was born, her father had already changed his name to the easier, amiable-sounding Monty Hall for entertainment purposes. The family moved to New York in May of 1956 when Joanna was 5 going on 6. In the early 1960s the family relocated again to Los Angeles where Monty found work hosting such game shows as \"Video Village\" and, of course, \"Let's Make a Deal\". Joanna sought out school productions while attending Beverly Hills High and worked with acting teacher-cum-character actor John Ingle before graduating in 1968. She attended UCLA, then Occidental College (also in Los Angeles) training in both voice and acting. Making her stage debut on the West Coast in the musical \"Promises, Promises\", she went on to play opposite Stacy Keach in \"Hamlet\" in Los Angeles before earning acting accolades back East. She started off promisingly by winning a Theatre World Award for her Broadway debut in the musical \"I Love My Wife\" in 1977. After some TV, including a one-season sitcom Hello, Larry (1979) with McLean Stevenson, she regained her Broadway footing in the mid-1980s, copping a supporting Tony nomination and Clarence Derwent Award for \"Joe Egg\" (1985) and winning a Drama Desk Award for her combined work in \"It's Only a Play\" and \"Social Security\" (1985). She then captured New York's acting \"triple crown\" (Tony, Outer Critic Circle, Drama Desk awards) for her show-stopping turn as the Baker's Wife in the Stephen Sondheim musical \"Into the Woods\" (1987). Her lofty stage reputation helped trigger higher-profile work on film. Gaining notice for her matter-of-fact portrayals of sly, classy ladies, she played secondary roles in Heartburn (1986) starring Meryl Streep, and in Woody Allen's more impressive outings Hannah and Her Sisters (1986) and Crimes and Misdemeanors (1989). TV also helped to capture her sardonic spirit. Whether playing assorted manchasers or flip professionals, she always found a way to stand out in a scene with a single quip -- most notably as a key ensemble member in the sitcom Love & War (1992), which lasted three seasons. Divorced twice (her first husband was L.A. acting coach Paul G. Gleason, with whom she had one child and kept her acting surname), Joanna has been married since 1994 to actor Chris Sarandon. The couple met while appearing in the ill-received Broadway musical \"Nick and Nora\" in 1991, and have since continued to perform together on stage (\"Thorn & Bloom\") and in the movies (Edie & Pen (1996), American Perfekt (1997), Road Ends (1997), Let the Devil Wear Black (1999)). Other popular films she has given a boost to have included Mr. Holland's Opus (1995), Boogie Nights (1997), as Mark Wahlberg's mother, and Un mariage trop parfait (2001). Joanna's two siblings are also involved in behind-the-scenes television -- writer/directors Sharon Hall and Richard Hall. Joanna's son Aaron David Gleason (\"Gilly Leads\" as he has called himself since age 19), is from Joanna's prior marriage, and has his own band, All Hours (formerly known as The Midnight Radio). The couple also have three children from Chris' second marriage. Into the millennium Joanna continues to find critical applause on the musical stage, receiving Tony, Outer Critics Circle and Drama Desk nominations for the musical \"Dirty Rotten Scoundrels\" in 2005. She has not only provided sassy support on such TV shows as \"Friends\", \"The Practice\" and \"The West Wing\", but has lent her voice to the popular animated sitcom King of the Hill (1997). A respected acting teacher, she has held classes and workshops on both the East and West coasts. In 2002 she directed her first New York play, \"A Letter from Ethel Kennedy\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA1NTAwODc1MV5BMl5BanBnXkFtZTcwNDM5NzAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0322306","name":"Joanna Gleason","idIMDB":"nm0322306"},"actorId":"nm0322306","character":"Judy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kathleen Rose Perkins","urlProfile":"http://www.imdb.com/name/nm1137659","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NjQyNjYxOF5BMl5BanBnXkFtZTgwMTg1Mzk5MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1974","placeOfBirth":" New Baltimore, Michigan, USA","bio":"Kathleen Rose Perkins grew up in New Baltimore, Michigan, a small town 40 miles north of Detroit. The sister of four older brothers, she enjoyed her alone time making up plays and putting them on for people in the neighborhood. This inevitably led to a high school career in which she was very involved with the school's drama and choir program. Kathleen attended Western Michigan University, and in just over three years she acquired a BFA in Musical Theatre. After traveling parts of the Midwest performing in various regional theaters, Kathleen made her way to Los Angeles. She spent a few years in odd jobs and acting classes, then started working with a management company she could trust. Since then, Kathleen has worked solely as an actress in film and television. She's collaborated with such performers as Chris O'Donnell, Courteney Cox, Christina Applegate, as well as many other fine actors. Credits include \"Without a Trace\", \"How I Met Your Mother\", \"Suzanne's Diary for Nicholas\", a recurring role on HBO's \"Tell Me You Love Me\" and Michael Bay's \"The Island\". She has also devoted time to projects personally important to her, such as an award-winning short film she wrote and starred in, a documentary about her family, and achieving a black belt in Taekwondo.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NjQyNjYxOF5BMl5BanBnXkFtZTgwMTg1Mzk5MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1137659","name":"Kathleen Rose Perkins","idIMDB":"nm1137659"},"actorId":"nm1137659","character":"Carlie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adriane Lenox","urlProfile":"http://www.imdb.com/name/nm0502180","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMTU3Nzk2Nl5BMl5BanBnXkFtZTcwNDI4MzA1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1956","placeOfBirth":" Memphis, Tennessee, USA","bio":"Adriane Lenox was born on September 11, 1956 in Memphis, Tennessee, USA. She is an actress, known for The Blind Side (2009), Black Snake Moan (2006) and Lee Daniels' The Butler (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMTU3Nzk2Nl5BMl5BanBnXkFtZTcwNDI4MzA1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0502180","name":"Adriane Lenox","idIMDB":"nm0502180"},"actorId":"nm0502180","character":"Dr. Linda Essex","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sydney Lucas","urlProfile":"http://www.imdb.com/name/nm4727372","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4MjQzNTIwNjZeQTJeQWpwZ15BbWU4MDY3NTM4NDcx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Sydney Lucas is an actress, known for The Skeleton Twins (2014), Girl Most Likely (2012) and Broadway Therapy (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4MjQzNTIwNjZeQTJeQWpwZ15BbWU4MDY3NTM4NDcx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4727372","name":"Sydney Lucas","idIMDB":"nm4727372"},"actorId":"nm4727372","character":"Young Maggie","urlCharacter":"http://www.imdb.com/character/ch0407085","main":true},{"actorName":"Eddie Schweighardt","urlProfile":"http://www.imdb.com/name/nm3692115","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY4OTg1MDAwMF5BMl5BanBnXkFtZTgwOTU1MDQ5ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Eddie Schweighardt is an actor, known for The Skeleton Twins (2014), Mother's House (2011) and Gimme Shelter (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3692115","name":"Eddie Schweighardt","idIMDB":"nm3692115"},"actorId":"nm3692115","character":"Young Milo","urlCharacter":"http://www.imdb.com/character/ch0462308","main":true},{"actorName":"Paul Castro Jr.","urlProfile":"http://www.imdb.com/name/nm4872557","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjczNTg2Nl5BMl5BanBnXkFtZTgwODk5NzkyNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Paul Castro Jr. is an actor and producer, known for The Skeleton Twins (2014), People Places Things (2015) and Limitless (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjczNTg2Nl5BMl5BanBnXkFtZTgwODk5NzkyNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4872557","name":"Paul Castro Jr.","nicknames":["PJ"],"idIMDB":"nm4872557"},"actorId":"nm4872557","character":"Eric","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Benjamin McGowan","urlProfile":"http://www.imdb.com/name/nm4793305","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDgxMTI4NjYxMl5BMl5BanBnXkFtZTgwNDQxNDg0MzE@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"bio":"Benjamin McGowan is an actor, known for The Skeleton Twins (2014), New Year's Eve (2011) and 30 Rock (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDgxMTI4NjYxMl5BMl5BanBnXkFtZTgwNDQxNDg0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4793305","name":"Benjamin McGowan","idIMDB":"nm4793305"},"actorId":"nm4793305","character":"Cullen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennifer Smith","urlProfile":"http://www.imdb.com/name/nm6945853","urlPhoto":"","biography":{"bio":"Jennifer Smith is an actress, known for The Skeleton Twins (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6945853","name":"Jennifer Smith","idIMDB":"nm6945853"},"actorId":"nm6945853","character":"Bar Woman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Genevieve Adams","urlProfile":"http://www.imdb.com/name/nm5151022","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTRlYTEwMzQtYTIxZS00NTdmLWI5ZjYtYzU4NjZhNjY1NzA0XkEyXkFqcGdeQXVyMjI3OTg2ODM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Genevieve Adams is an actress and writer, known for The Skeleton Twins (2014), Money Monster (2016) and A Walk Among the Tombstones (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTRlYTEwMzQtYTIxZS00NTdmLWI5ZjYtYzU4NjZhNjY1NzA0XkEyXkFqcGdeQXVyMjI3OTg2ODM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5151022","name":"Genevieve Adams","idIMDB":"nm5151022"},"actorId":"nm5151022","character":"Store Manager","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Truck Hudson","urlProfile":"http://www.imdb.com/name/nm4709025","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNTQ0NDU1MV5BMl5BanBnXkFtZTcwMTYyOTE4OQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Truck Hudson is an actor, known for Unbreakable Kimmy Schmidt (2015), The Skeleton Twins (2014) and Are We There Yet? (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNTQ0NDU1MV5BMl5BanBnXkFtZTcwMTYyOTE4OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4709025","name":"Truck Hudson","idIMDB":"nm4709025"},"actorId":"nm4709025","character":"Security Officer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1571249","urlIMDB":"http://www.imdb.com/title/tt1571249","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"$2,323,837","country":"USA","day":"28","month":"09","year":"2014","remarks":""}],"weekendGross":[{"money":"$1,231,842","country":"USA","day":"28","month":"09","year":"2014","remarks":"385 Screens"}],"admissions":[{"money":"1,908","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 33 min (93 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.8","metascore":"74","filmingLocations":[{"location":"New York, USA"}],"rated":"R","awards":[{"award":"Broadcast Film Critics Association Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Critics Choice Award","categories":[{"category":"Best Actress in a Comedy Movie","names":[{"name":"Kristen Wiig","id":"nm1325419","role":null}]}]}]},{"award":"Edinburgh International Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Audience Award","categories":[{"category":"","names":[{"name":"Craig Johnson","id":"nm2574897","role":null}]}]}]},{"award":"Gay and Lesbian Entertainment Critics Association (GALECA) 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Dorian Award","categories":[{"category":"Unsung Film of the Year","names":[]}]}]},{"award":"GLAAD Media Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated GLAAD Media Award","categories":[{"category":"Outstanding Film - Wide Release","names":[]}]}]},{"award":"Gotham Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Gotham Independent Film Award","categories":[{"category":"Best Actor","names":[{"name":"Bill Hader","id":"nm0352778","role":null}]}]}]},{"award":"MTV Movie Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best Musical Moment","names":[{"name":"Bill Hader","id":"nm0352778","role":null},{"name":"Kristen Wiig","id":"nm1325419","role":null}]}]}]},{"award":"National Board of Review, USA 2014","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Top Ten Independent Films","names":[]}]}]},{"award":"Phoenix Film Critics Society Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated PFCS Award","categories":[{"category":"Overlooked Film of the Year","names":[]}]}]},{"award":"Sundance Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Won Waldo Salt Screenwriting Award","categories":[{"category":"","names":[{"name":"Craig Johnson","id":"nm2574897","role":null},{"name":"Mark Heyman","id":"nm2114730","role":null}]}]},{"titleAwardOutcome":"Nominated Grand Jury Prize","categories":[{"category":"Dramatic","names":[{"name":"Craig Johnson","id":"nm2574897","role":null}]}]}]},{"award":"Women Film Critics Circle Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won WFCC Award","categories":[{"category":"Best Equality of the Sexes","names":[]},{"category":"Best Screen Couple","names":[{"name":"Kristen Wiig","id":"nm1325419","role":null},{"name":"Bill Hader","id":"nm0352778","role":null}]}]},{"titleAwardOutcome":"Nominated WFCC Award","categories":[{"category":"Best Comedic Actress","names":[{"name":"Kristen Wiig","id":"nm1325419","role":null}]}]}]},{"award":"Zurich Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Eye","categories":[{"category":"Best International Feature Film","names":[{"name":"Craig Johnson","id":"nm2574897","role":null}]}]}]}],"votes":"33,265","type":"Movie","companyCreditsSimple":[{"idCompany":"co0152336","name":"Duplass Brothers Productions"},{"idCompany":"co0402483","name":"Venture Forth"}],"keywords":{"keywords":["brother sister relationship","siblings","suicide attempt","adultery","estrangement","infidelity","teacher student relationship","failed suicide attempt","gay interest","scuba diving","halloween","dental headgear","reunion","holding one's breath underwater","aquarium","skeleton tattoo","bookshop","dental hygienist","confession","reference to moby dick","drag queen","mother son relationship","mother daughter relationship","rejection","twin synchronization","gay lead character","gay brother","fraternal twins","climbing wall","birth control pill","goldfish","laughing gas","gay bar","halloween parade","pumpkin carving","diving instructor","gay sex","gay character","latex gloves","suicide of father","new ager","cowardice","high school yearbook","sex with a minor","los angeles california","new york","cemetery","lesbian","toilet sex","gay twin","in the closet","bisexuality","autumn","dental braces","death of father"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:50:56"}}