{"data":{"movies":[{"title":"The Humbling","originalTitle":"","year":"2014","releaseDate":"20150408","directors":[{"name":"Barry Levinson","id":"nm0001469"}],"writers":[{"name":"Buck Henry","id":"nm0377750"},{"name":"Michal Zebede","id":"nm4666520"}],"runtime":"112 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NjI0ODE5MV5BMl5BanBnXkFtZTgwOTMyMzEwMzE@._V1.jpg","countries":["USA","Italy"],"languages":["English"],"genres":["Comedy","Drama"],"plot":"An aged and addled actor has his world turned upside down after he embarks upon an affair with a lesbian, in this acidulous adaptation of the Philip Roth novel.","simplePlot":"A stage actor who is slowly losing his mind engages in a relationship with a sexually confused younger woman.","actors":[{"actorName":"Al Pacino","urlProfile":"http://www.imdb.com/name/nm0000199","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzg1ODAyNl5BMl5BanBnXkFtZTYwMjAxODQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1940","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Alfredo James Pacino","height":"5' 7\" (1.7 m)","bio":"One of the greatest actors in all of film history, Al Pacino established himself during one of film's greatest decades, the 1970s, and has become an enduring and iconic figure in the world of American movies. Alfredo James Pacino was born on April 25, 1940, in the Bronx, New York, to an Italian-American family. His parents, Rose (Gerardi) and Sal Pacino, divorced when he was young. His mother moved them into his grandparents' house. Pacino found himself often repeating the plots and voices of characters he had seen in the movies, one of his favorite activities. Bored and unmotivated in school, the young Al Pacino found a haven in school plays, and his interest soon blossomed into a full-time career. Starting on the stage, he went through a lengthy period of depression and poverty, sometimes having to borrow bus fare to make it to auditions. He made it into the prestigious Actors Studio in 1966, studying under legendary acting coach Lee Strasberg, creator of the Method Approach that would become the trademark of many 1970s-era actors. After appearing in a string of plays in supporting roles, Pacino finally succeeded with \"The Indian Wants the Bronx\", winning an Obie Award for the 1966-67 season. That was followed by a Tony Award for \"Does the Tiger Wear a Necktie?\". His first feature films made little departure from the gritty realistic stage performances that earned him respect: he played a drug addict in The Panic in Needle Park (1971) after his film debut in Me, Natalie (1969). What came next would change his life forever. The role of Michael Corleone in The Godfather (1972) was one of the most sought-after of the time: Robert Redford, Warren Beatty, Jack Nicholson, Ryan O'Neal, Robert De Niro and a host of others either wanted it or were mentioned for it, but director Francis Ford Coppola had his heart set on the unknown Italian Pacino for the role, although pretty much everyone else--from the studio to the producers to some of the cast members--did not want him. Though Coppola won out through slick persuasion, Pacino was in constant fear of being fired during the hellish shoot. Much to his (and Coppola's) relief, the film was a monster hit that did wonders for everyone's career, including Pacino's, and earned him his first Academy Award nomination for Best Supporting Actor. However, instead of taking on easier projects for the big money he could now command, Pacino threw his support behind what he considered tough but important films, such as the true-life crime drama Serpico (1973) and the tragic real-life bank robbery film Dog Day Afternoon (1975). He opened eyes around the film world for his brave choice of roles, and he was nominated three consecutive years for the \"Best Actor\" Academy Award. He faltered slightly with Bobby Deerfield (1977), but regained his stride with ...and justice for all. (1979), for which he received another Academy Award nomination for Best Actor. Unfortunately, this would signal the beginning of a decline in his career, which produced such critical and commercial flops as Cruising - La Chasse (1980) and Author! Author! (1982). Pacino took on another vicious gangster role and cemented his legendary status in the ultra-violent cult film Scarface (1983)_, but a monumental mistake was about to follow. Revolution (1985) endured an endless and seemingly cursed shoot in which equipment was destroyed, weather was terrible, and Pacino became terribly ill with pneumonia. Constant changes in the script also further derailed a project that seemed doomed from the start anyway. The Revolutionary War film is considered one of the worst films ever, not to mention one of the worst of his career, resulted in his first truly awful reviews and kept him off the screen for the next four years. Returning to the stage, Pacino has done much to give back and contribute to the theatre, which he considers his first love. He directed a film, The Local Stigmatic (1990), but it remains unreleased. He lifted his self-imposed exile with the striking Sea of Love (1989) as a hard-drinking policeman. This marked the second phase of Pacino's career, being the first to feature his now famous dark, owl eyes and hoarse, gravelly voice. Returning to the Corleones, Pacino made The Godfather: Part III (1990) and earned raves for his first comedic role in the colorful Dick Tracy (1990). This earned him another Academy Award nomination for Best Supporting Actor, and two years later he was nominated for Glengarry Glen Ross (1992). He went into romantic mode for Frankie and Johnny (1991). In 1992, he finally won the Academy Award for Best Actor for his amazing performance in Scent of a Woman (1992). A mixture of technical perfection (he plays a blind man) and charisma, the role was tailor-made for him, and remains a classic. The next few years would see Pacino becoming more comfortable with acting and movies as a business, turning out great roles in great films with more frequency and less of the demanding personal involvement of his wilder days. Carlito's Way (1993) proved another gangster classic, as did the epic crime drama Heat (1995) directed by Michael Mann and co-starring Robert De Niro, although they only had a few scenes together. He returned to the director's chair for the highly acclaimed and quirky Shakespeare adaptation Looking for Richard (1996). City Hall (1996), Donnie Brasco (1997) and The Devil's Advocate (1997) all came out in this period. Reteaming with Mann and then Oliver Stone, he gave two commanding performances in The Insider (1999) and Any Given Sunday (1999). In the 2000s, Pacino starred in a number of theatrical blockbusters, including Ocean's Thirteen (2007), but his choice in television roles (the vicious Roy Cohn in HBO's miniseries Angels in America (2003) and his sensitive portrayal of Jack Kevorkian, in the television movie You Don't Know Jack (2010)) are reminiscent of the bolder choices of his early career. Each television project garnered him an Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie. In his personal life, Pacino is one of Hollywood's most enduring and notorious bachelors, having never been married. He has a daughter, Julie Marie, with acting teacher Jan Tarrant, and a new set of twins with longtime girlfriend Beverly D'Angelo. His romantic history includes a long-time romance with \"Godfather\" co-star Diane Keaton. With his intense and gritty performances, Pacino was an original in the acting profession. His Method approach would become the process of many actors throughout time, and his unbeatable number of classic roles has already made him a legend among film buffs and all aspiring actors and directors. His commitment to acting as a profession and his constant screen dominance has established him as one of the movies' true legends. Pacino has never abandoned his love for the theater, and Shakespeare in particular, having directed the Shakespeare adaptation Looking for Richard (1996) and played Shylock in The Merchant of Venice (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzg1ODAyNl5BMl5BanBnXkFtZTYwMjAxODQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000199","name":"Al Pacino","nicknames":["Sonny"],"idIMDB":"nm0000199"},"actorId":"nm0000199","character":"Simon Axler","urlCharacter":"http://www.imdb.com/character/ch0468183","main":true},{"actorName":"Greta Gerwig","urlProfile":"http://www.imdb.com/name/nm1950086","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE5MTIxMTMzMV5BMl5BanBnXkFtZTcwMjMxMDYxOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 August 1983","placeOfBirth":" Sacramento, California, USA","birthName":"Greta Celeste Gerwig","height":"5' 9\" (1.75 m)","bio":"Greta Celeste Gerwig is an American actress and filmmaker. She was born in Sacramento, California, to Christine Gerwig (née Sauer), a nurse, and Gordon Gerwig, a financial consultant and computer programmer. She has German, Irish, and English ancestry. Gerwig was raised as a Unitarian Universalist, but also attended an all-girls Catholic school. She has described herself as \"an intense child\". With an early interest in dance, she intended to get a degree in musical theatre in New York. She graduated from Barnard College in NY, where she studied English and philosophy, instead. Originally intending to become a playwright, after meeting young film director Joe Swanberg, she became the star of a series of intellectual low budget movies made by first-time filmmakers, a trend dubbed \"mumblecore\". Gerwig was cast in a minor role in Swanberg's LOL (2006) in 2006, while still studying at Barnard. She personally co-directed, co-wrote and co-produced one of these entitled Nights and Weekends (2008). She then worked with good quality directors such as Ti West (The House of the Devil (2009)), Whit Stillman (Damsels in Distress (2011)), or Woody Allen (To Rome with Love (2012)) but success and (international) recognition did not come until Frances Ha (2012), directed by Noah Baumbach, a film she also co-wrote. Both tall and immature, awkward and graceful, blundering and candid, annoying and engaging, Greta has won all hearts in the title role of Frances Ha(liday). In 2011, Gerwig received an award for Acting from the Athena Film Festival for her artistry as one of Hollywood's definitive screen actresses of her generation.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE5MTIxMTMzMV5BMl5BanBnXkFtZTcwMjMxMDYxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1950086","name":"Greta Gerwig","idIMDB":"nm1950086"},"actorId":"nm1950086","character":"Pegeen Mike Stapleford","urlCharacter":"http://www.imdb.com/character/ch0468185","main":true},{"actorName":"Nina Arianda","urlProfile":"http://www.imdb.com/name/nm3616206","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3ODI4NzE0NV5BMl5BanBnXkFtZTcwMDU5MjU0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1984","placeOfBirth":" New York City, New York, USA","birthName":"Nina Arianda Matijcio","height":"5' 8\" (1.73 m)","bio":"Nina Arianda made her break-out debut in the 2010 off-Broadway production of Venus in Fur just months after graduating from NYU's Tisch graduate acting program. Her performance garnered the attention of the entire New York theater community. Following her off-Broadway acclaim, Nina procured roles in Woody Allen's Oscar-winning film Midnight in Paris, Tom McCarthy's Win Win, and Vera Farmiga's Higher Ground. Venus in Fur transferred to Broadway in 2011 where Nina's performance went on to become the most critically acclaimed of the 2011-2012 season resulting in her winning the 2012 Tony Award for Best Actress in a Play. This recognition followed her 2011 nod for her Broadway debut performance as \"Billie Dawn\" in Born Yesterday. In 2011, Nina appeared in Universal's Tower Heist starring Ben Stiller and Eddie Murphy and made her network television debut on the Emmy-winning series \"The Good Wife.\" In addition to the Tony Award, Nina has been honored with numerous accolades for her work in the theater including recognition from The Drama League, an Outer Critics Circle Award, the Actors' Equity Association Clarence Derwent Award, the Theater World Award and the Clive Barnes Award. Nina was named 2011 Stage Star of the Year by New York Magazine, and topped Forbes Magazine's 2011 Top 30 Under 30 in entertainment list. She was also honored by Marie Claire Magazine with their 2012 Women on Top Award for top performer. Following Venus in Fur's successful Broadway run, Nina has appeared on NBC's landmark series \"30 Rock,\" and CBS's \"Hostages.\" She can be seen in the recently released films Lucky Them starring Toni Collette, Thomas Haden Church and Oliver Platt, Rob the Mob where she stars alongside Michael Pitt, Andy Garcia and Ray Romano, and in the upcoming film The Disappearance of Eleanor Rigby starring Jessica Chastain and James McAvoy, . Nina has wrapped filming The Humbling directed by Barry Levinson, starring Al Pacino and will be starring with Sam Rockwell in Sam Shepard's Fool for Love at Williamstown Theater Festival beginning July 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3ODI4NzE0NV5BMl5BanBnXkFtZTcwMDU5MjU0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3616206","name":"Nina Arianda","idIMDB":"nm3616206"},"actorId":"nm3616206","character":"Sybil","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dylan Baker","urlProfile":"http://www.imdb.com/name/nm0048414","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY1MzAwNTk5NV5BMl5BanBnXkFtZTYwMzkwMjY1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 October 1959","placeOfBirth":" Syracuse, New York, USA","height":"6' 1\" (1.85 m)","bio":"Dylan Baker was born on October 7, 1959 in Syracuse, New York, USA. He is an actor and director, known for Spider-Man 2 (2004), Trick 'r Treat (2007) and Spider-Man 3 (2007). He has been married to Becky Ann Baker since 1990. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY1MzAwNTk5NV5BMl5BanBnXkFtZTYwMzkwMjY1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0048414","name":"Dylan Baker","idIMDB":"nm0048414"},"actorId":"nm0048414","character":"Dr. Farr","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Grodin","urlProfile":"http://www.imdb.com/name/nm0001301","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDg2NzYxOF5BMl5BanBnXkFtZTcwMzQ4OTgwMw@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 April 1935","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Charles Grodinsky","height":"6' (1.83 m)","bio":"Charles Grodin was born on April 21, 1935 in Pittsburgh, Pennsylvania, USA as Charles Grodinsky. He is an actor and writer, known for Beethoven (1992), Midnight Run (1988) and Beethoven's 2nd (1993). He has been married to Elissa Durwood since March 1985. They have one child. He was previously married to Julia Ferguson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDg2NzYxOF5BMl5BanBnXkFtZTcwMzQ4OTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001301","name":"Charles Grodin","idIMDB":"nm0001301"},"actorId":"nm0001301","character":"Jerry","urlCharacter":"http://www.imdb.com/character/ch0468186","main":true},{"actorName":"Dan Hedaya","urlProfile":"http://www.imdb.com/name/nm0000445","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MzQ3MjY3Nl5BMl5BanBnXkFtZTYwNTA4MzE0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 July 1940","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"5' 9\" (1.75 m)","bio":"Dan Hedaya is a familiar face from his work in films and on TV, where he often plays a villain (although he had a good comic turn as the charmingly sleazy Nick Tortelli, Carla's ex-husband, in Cheers (1982) and its short-lived spin-off The Tortellis (1987)). He has also done much stage work, appearing opposite Alien: Resurrection (1997) star Sigourney Weaver in \"The Conjuring an Event\" at the American Place Theater. Other stage performances include Broadway roles such as \"The Basic Training of Pavlo Hummel\" and many New York Shakespeare Festival productions.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MzQ3MjY3Nl5BMl5BanBnXkFtZTYwNTA4MzE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000445","name":"Dan Hedaya","nicknames":["Dan \"the man\" Hedaya"],"idIMDB":"nm0000445"},"actorId":"nm0000445","character":"Asa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Billy Porter","urlProfile":"http://www.imdb.com/name/nm0692039","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMjA2OTg1NV5BMl5BanBnXkFtZTgwMzU5OTQxMDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 September 1969","placeOfBirth":" Pittsburgh, Pennsylvania, USA","bio":"Before embarking on a career as a mainstream pop vocalist, Billy Porter built a substantial reputation as a theatrical singer in Broadway productions such as Grease and Smokey Joe's Cafe. He made his initial impact by placing 'Love Is On The Way' on the soundtrack to the film First Wives' Club, in 1996. His debut album, Untitled, was firmly anchored in traditional R&B territory, with several key ballads included (such as a cover version of Glenn Jones's 'Show Me') in an attempt to win over mainstream radio. His backing band featured several musicians better known for their work in the theatre, including Warren J. McCrae, Gary Haase and Peter Zizzo (his producer). Unsurprisingly for a multi-faceted performer, Porter's record company was keen for their artist to be seen live, and his support slot to Sounds Of Blackness in New York in May 1997 attracted some encouraging reviews prior to his own headlining dates.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMjA2OTg1NV5BMl5BanBnXkFtZTgwMzU5OTQxMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0692039","name":"Billy Porter","idIMDB":"nm0692039"},"actorId":"nm0692039","character":"Prince","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kyra Sedgwick","urlProfile":"http://www.imdb.com/name/nm0001718","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MzAyNjIxM15BMl5BanBnXkFtZTcwNDg5Mzk0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1965","placeOfBirth":" New York City, New York, USA","birthName":"Kyra Minturn Sedgwick","height":"5' 5\" (1.65 m)","bio":"Kyra Minturn Sedgwick was born on August 19, 1965 in New York City, to Patricia (Rosenwald), a family and speech therapist, and Henry Dwight Sedgwick V, a venture capitalist. Her mother was from an upper-class German Jewish family, and her father was from a wealthy Massachusetts clan of English descent, with many prominent ancestors (including judge Theodore Sedgwick and educator Endicott Peabody). Sedgwick attended private schools. She made her professional acting debut at age 16 on the soap opera Another World (1964). A graduate of USC, Kyra has pursued a career that includes stage, screen and television. Kyra's reason for becoming an actor is that it gives her the ability to be compassionate and to walk around in the shoes of others. Her first brush with stardom came in Born on the Fourth of July (1989) as \"Donna\", the high school sweetheart of Tom Cruise. Two of her roles led to Golden Globe nominations: Miss Rose White (1992) and Something to Talk About (1995). She met her husband, Kevin Bacon, when they played leads in the television movie Lemon Sky (1988). They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MzAyNjIxM15BMl5BanBnXkFtZTcwNDg5Mzk0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001718","name":"Kyra Sedgwick","nicknames":["Kiko"],"idIMDB":"nm0001718"},"actorId":"nm0001718","character":"Louise Trenner","urlCharacter":"http://www.imdb.com/character/ch0468184","main":true},{"actorName":"Dianne Wiest","urlProfile":"http://www.imdb.com/name/nm0001848","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NjM4MTUwN15BMl5BanBnXkFtZTcwOTU0MTUyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 March 1948","placeOfBirth":" Kansas City, Missouri, USA","height":"5' 5\" (1.65 m)","bio":"One of three children (she has two brothers, Greg and Don), Dianne Wiest was born in Kansas City, Missouri, USA. Her mother, Anne Stewart (Keddie), was a nurse from Auchtermuchty, Scotland, and her father, Bernard John Wiest, was a college dean and social worker who was born in Pennsylvania, of German and Croatian descent. Dianne's original ambition was to be a ballerina, but she was bitten by the acting bug after some stage work, most notably playing Desdemona to James Earl Jones' Othello on Broadway. She made her film debut in 1980, but did not make a name for herself until her performance as Emma, a prostitute during the 1930s Depression, in Woody Allen's The Purple Rose of Cairo (1985). Allen was so impressed by Wiest's acting ability that he has directed her on four more occasions since. Under Allen's direction, Wiest won a well deserved Oscar for Best Supporting Actress, for her brilliant performance as the neurotic, wannabe actress Holly in Hannah and Her Sisters (1986). She followed her Academy Award success with performances in The Lost Boys (1987) and Bright Lights, Big City (1988) before stealing the show from the likes of Steve Martin, Mary Steenburgen, Jason Robards, Keanu Reeves and Martha Plimpton in Ron Howard's Parenthood (1989). Playing Helen Buckman, the divorced mother of two difficult teenagers, Wiest was both touching and hilarious, and received her second Oscar nomination. Arguably her most beloved role came as Peg Boggs, the kindly Avon Lady who discovers the titular Edward Scissorhands (1990). Wiest returned to Woody Allen for Bullets Over Broadway (1994), a superb comedy film set in 1920s New York, winning her second Best Supporting Actress Oscar for her magnificent portrayal of Helen Sinclair, a boozy, glamorous and neurotic star of the stage, who could made the words \"Don't speak!\" the funniest sentence ever captured on film. Recently enjoying great success with witchy roles in the comedy film Practical Magic (1998) and the television miniseries The 10th Kingdom (2000), Dianne Wiest lives in New York City with her two adopted daughters, Emily and Lily.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NjM4MTUwN15BMl5BanBnXkFtZTcwOTU0MTUyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001848","name":"Dianne Wiest","idIMDB":"nm0001848"},"actorId":"nm0001848","character":"Carol","urlCharacter":"http://www.imdb.com/character/ch0528425","main":true},{"actorName":"Mary Louise Wilson","urlProfile":"http://www.imdb.com/name/nm0933840","urlPhoto":"","biography":{"dateOfBirth":"12 November 1931","placeOfBirth":" New Haven, Connecticut, USA","bio":"Mary Louise Wilson was born on November 12, 1931 in New Haven, Connecticut, USA. She is an actress, known for Nebraska (2013), All My Children (1970) and Stepmom (1998). She was previously married to Cibelli, Albert.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0933840","name":"Mary Louise Wilson","idIMDB":"nm0933840"},"actorId":"nm0933840","character":"Mrs. Rutledge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lance Roberts","urlProfile":"http://www.imdb.com/name/nm1188362","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3MjUwNjY5NjReQTJeQWpwZ15BbWU3MDE1MTkyMzg@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"bio":"Lance Roberts is an actor, known for This Is Where I Leave You (2014), The Humbling (2014) and I Am Michael (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3MjUwNjY5NjReQTJeQWpwZ15BbWU3MDE1MTkyMzg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1188362","name":"Lance Roberts","idIMDB":"nm1188362"},"actorId":"nm1188362","character":"Walter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Li Jun Li","urlProfile":"http://www.imdb.com/name/nm4050835","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NzM0NjU4OV5BMl5BanBnXkFtZTgwODYwMDU2NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Li Jun Li was born in Shanghai, China and moved to New York City in 1992, by way of Bogotá, Colombia, where she spent a number of years during childhood, where Spanish became her second language, and English her third. She attended Fiorello LaGuardia High School of Music and Art and Performing Arts as a dance major and switched to studying acting in college. Li Jun had her first break in the acting world starring opposite Matthew Morrison in the Tony Award winning Rogers & Hammerstein's South Pacific (2008) at New York's Lincoln Center. Following on from this early success, she won roles on a variety of TV shows and films including Blue Bloods (2010), Damages (2011), The Following (2013), Cédric Klapisch's Chinese Puzzle (2013) and Mistress (2014). Li Jun expanded her visibility and presence on a global level by landing major television roles in Neil LaBute's Billy and Billie (2015) and Steven Spielberg's Minority Report (2015) on FOX. In 2016 Li Jun joined the cast of ABC's hit show Quantico (2016) to play Iris Chang and most recently, became Burgess's new partner on the season four of Chicago PD.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NzM0NjU4OV5BMl5BanBnXkFtZTgwODYwMDU2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4050835","name":"Li Jun Li","nicknames":["LiLi"],"idIMDB":"nm4050835"},"actorId":"nm4050835","character":"Tracy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victor Cruz","urlProfile":"http://www.imdb.com/name/nm1497615","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMzk5NTY3M15BMl5BanBnXkFtZTcwNTEzMzgwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1980","placeOfBirth":" New York, USA","height":"5' 7\" (1.7 m)","bio":"Victor Cruz was born on August 5, 1980 in New York, USA. He is an actor and producer, known for The Other Woman (2014), Side Effects (2013) and The Taking of Pelham 123 (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMzk5NTY3M15BMl5BanBnXkFtZTcwNTEzMzgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1497615","name":"Victor Cruz","idIMDB":"nm1497615"},"actorId":"nm1497615","character":"Security Guard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Derrick Arthur","urlProfile":"http://www.imdb.com/name/nm4814002","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY0NTQzMDktOTEyZC00YTE3LWJlMTUtNmVkZjRhYjU0YmVlXkEyXkFqcGdeQXVyMjgyNTgxMDI@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Derrick Arthur is an actor, known for Delivery Man (2013), People Places Things (2015) and The Humbling (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY0NTQzMDktOTEyZC00YTE3LWJlMTUtNmVkZjRhYjU0YmVlXkEyXkFqcGdeQXVyMjgyNTgxMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4814002","name":"Derrick Arthur","idIMDB":"nm4814002"},"actorId":"nm4814002","character":"Techie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve Rosen","urlProfile":"http://www.imdb.com/name/nm1034238","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MjIyMjc1NF5BMl5BanBnXkFtZTgwMzQwNzMzNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Steve Rosen is an actor, known for Café Society (2016), Law & Order: Special Victims Unit (1999) and Nurse Jackie (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MjIyMjc1NF5BMl5BanBnXkFtZTgwMzQwNzMzNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1034238","name":"Steve Rosen","idIMDB":"nm1034238"},"actorId":"nm1034238","character":"Stage Manager","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1568343","urlIMDB":"http://www.imdb.com/title/tt1568343","business":{"budget":{"money":"$2,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 52 min (112 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":["Arri Alexa Widescreen"],"printedFilmFormat":["Digital (Digital Cinema Package DCP)"]},"rating":"5.6","metascore":"59","filmingLocations":[{"location":"St. George Theatre, Staten Island, New York City, New York, USA"}],"rated":"R","awards":[],"votes":"4,949","type":"Movie","companyCreditsSimple":[{"idCompany":"co0465853","name":"Ambi Pictures"},{"idCompany":"co0449599","name":"Hammerton Productions"},{"idCompany":"co0000881","name":"Stonelock Pictures"}],"keywords":{"keywords":["actor","bad back","impossible love","locked out","stage play","veterinarian","animal tranquilizer","train set","thespian","stage performer","suicide attempt","rehab","dog","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 01:04:13"}}