{"data":{"movies":[{"title":"Knucklehead","originalTitle":"","year":"2010","releaseDate":"20101022","directors":[{"name":"Michael W. Watkins","id":"nm0914368"}],"writers":[{"name":"Bear Aderhold","id":"nm2021391"},{"name":"Tom Sullivan","id":"nm2009736"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMzYzODU5N15BMl5BanBnXkFtZTcwODk2Njg5Mw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Comedy","Drama","Family","Sport"],"plot":"After con artist Eddie Sullivan (Feuerstein) incurs a large debt with a local criminal ringleader, he creates a get-rich-quick scheme and enlists a sweet gentle giant named Walter (Wight) as his unwitting accomplice. Walter's orphanage -- the only home he's ever known -- also needs funds desperately. Upon overhearing Walter's predicament, Eddie convinces the no-nonsense head nun, Sister Francesca (Malick), that Walter can win the money as a fighter and pay off the church's debts. Eddie's plan: travel from town to town with Walter and enter small, unsanctioned fighting competitions for prize money Sister Francesca dispatches Mary (Hardin) as a chaperone for both Walter and the money and gives Eddie a week - and a prayer - to make it happen. During their journey across the south to the annual Pro-Am MMA tournament in New Orleans, Walter discovers what life is like outside the orphanage, while Eddie becomes morally conflicted over whether to take all the loot for himself or keep his ...","simplePlot":"After con artist Eddie Sullivan (Feuerstein) incurs a large debt with a local criminal ringleader, he creates a get-rich-quick scheme and enlists a sweet gentle giant named Walter (Wight) ... ","actors":[{"actorName":"Mark Feuerstein","urlProfile":"http://www.imdb.com/name/nm0275417","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjYyNjE3NV5BMl5BanBnXkFtZTcwMjE4NDU2Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1971","placeOfBirth":" New York City, New York, USA","height":"5' 7\" (1.7 m)","bio":"Mark Feuerstein got his break-through on television as a recurring character on the daytime soap opera Loving (1983). Most of the people in his family are lawyers. He was a high school state championship wrestler. He enjoys mountain-biking, wrestling, dancing (hip-hop to salsa) and jogging. He got the nickname \"Chaplin\" on the set of Giving It Up (1999) because of his uncanny knack of physical comedy. He even had a physical slapstick back-and-forth with Mel Gibson a year later on the set of What Women Want (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjYyNjE3NV5BMl5BanBnXkFtZTcwMjE4NDU2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0275417","name":"Mark Feuerstein","nicknames":["Chaplin"],"idIMDB":"nm0275417"},"actorId":"nm0275417","character":"Eddie Sullivan","urlCharacter":"http://www.imdb.com/character/ch0233238","main":true},{"actorName":"Melora Hardin","urlProfile":"http://www.imdb.com/name/nm0002124","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNzAzODk5Ml5BMl5BanBnXkFtZTcwMjEyNTE2Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1967","placeOfBirth":" Houston, Texas, USA","birthName":"Melora Diane Hardin","height":"5' 7\" (1.7 m)","bio":"Melora Hardin was born on June 29, 1967 in Houston, Texas, USA as Melora Diane Hardin. She is an actress, known for The Office (2005), The Hot Chick (2002) and 17 Again (2009). She has been married to Gildart Jackson since 1997. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNzAzODk5Ml5BMl5BanBnXkFtZTcwMjEyNTE2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002124","name":"Melora Hardin","idIMDB":"nm0002124"},"actorId":"nm0002124","character":"Mary","urlCharacter":"http://www.imdb.com/character/ch0233239","main":true},{"actorName":"Paul Wight","urlProfile":"http://www.imdb.com/name/nm0927833","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NjE1OTY4NF5BMl5BanBnXkFtZTcwMjUxMDMxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1972","placeOfBirth":" Aiken, South Carolina, USA","birthName":"Paul Randall Wight Jr.","height":"7' (2.13 m)","bio":"Paul also played college basketball at Southern Illinois University Edwardsville from 1992 to 1993, and was a member of the National Collegiate Athletic Association (NCAA) Division II Cougars basketball team. Paul is a member of the Xi Beta Chapter of Tau Kappa Epsilon fraternity at Southern Illinois University-Edwardsville. He scored a total of thirty-nine points for the Cougars in limited action during the 1992-93 season.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NjE1OTY4NF5BMl5BanBnXkFtZTcwMjUxMDMxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0927833","name":"Paul Wight","nicknames":["Big Nasty Bastard","The Giant","Big Show","Showkishi","The Showster","The Big Showbowski","The World's Largest Athlete"],"idIMDB":"nm0927833"},"actorId":"nm0927833","character":"Walter Krunk","urlCharacter":"http://www.imdb.com/character/ch0233240","main":true},{"actorName":"Dennis Farina","urlProfile":"http://www.imdb.com/name/nm0001199","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMzE0NTU2OV5BMl5BanBnXkFtZTYwODQxODc1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 February 1944","placeOfBirth":" Chicago, Illinois, USA","height":"6' (1.83 m)","bio":"Dennis Farina was one of Hollywood's busiest actors and a familiar face to moviegoers and television viewers alike. Recently, he appeared in the feature films, \"The Grand,\" a comedy about a Vegas poker tournament with Woody Harrelson, Cheryl Hines and Ray Romano; \"Bottle Shock,\" also starring Alan Rickman, Bill Pullman and Bradley Whitford; and Fox's \"What Happens in Vegas,\" in which Dennis starred as Cameron Diaz's boss. Farina also appeared on the NBC series \"Law and Order\" and in the HBO miniseries, \"Empire Falls,\" for which he won a Golden Globe Award for Best Mini-Series. Farina is well remembered for his role in memorable features such as Steven Soderbergh's \"Out of Sight,\" in which he played the retired lawman father of Jennifer Lopez's character. This was Farina's second outing in an Elmore Leonard best seller, the previous one being \"Get Shorty,\" directed by Barry Sonnenfeld and co-starring John Travolta, Rene Russo and Gene Hackman. Farina received an American Comedy Award for Funniest Supporting Male for his performance as \"Ray 'Bones' Barboni.\" In 1998's \"Saving Private Ryan,\" directed by Steven Spielberg, Farina played \"Col. Anderson,\" a pivotal role in the film. It is this character who convinces Tom Hanks character to lead a squad deep into Nazi territory to rescue \"Pvt. Ryan.\" He also co-starred with Brad Pitt and Oscar-winner Benicio Del Toro in the darkly comedic crime drama \"Snatch,\" directed by Guy Ritchie. Farina's numerous other screen credits include John Frankenheimer's \"Reindeer Games,\" \"Paparazzi,\" Martin Brest's \"Midnight Run,\" the Michael Mann film \"Manhunter\", among many other feature films. Farina is also recognized for his role in the critically acclaimed television series, NBC's \"Crime Story\". A veteran of the Chicago theater, Farina has appeared in Joseph Mantegna's \"Bleacher Bums,\" and \"A Prayer For My Daughter,\" directed by John Malkovich, and many others. He died on July 22, 2013 in Scottsdale, Arizona at age 69.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMzE0NTU2OV5BMl5BanBnXkFtZTYwODQxODc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001199","name":"Dennis Farina","idIMDB":"nm0001199"},"actorId":"nm0001199","character":"Memphis Earl","urlCharacter":"http://www.imdb.com/character/ch0172272","main":true},{"actorName":"Wendie Malick","urlProfile":"http://www.imdb.com/name/nm0005176","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODE5MzM5NDIwM15BMl5BanBnXkFtZTcwNTEzNzk3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1950","placeOfBirth":" Buffalo, New York, USA","birthName":"Wendie Diane Malick","height":"5' 10\" (1.78 m)","bio":"The actress Wendie Malick was born in Buffalo, New York, in 1950 and attended Ohio Wesleyan University, from which she graduated in 1972. The 5-foot, 10-inch beauty was a Wilhelmina model in the 1970s, giving it up to go to work for Buffalo-area Congressman Jack Kemp. She quickly left Washington, DC, behind to act in the theater. She appeared as Judith Tupper Stone in the early 1990s on the HBO comedy Dream On (1990) for which she won four CableACE Awards as Best Actress in a Comedy Series. Malick has proved a gifted comedienne with great comic timing and reached the height of her career as one of the stars of the sitcom Just Shoot Me! (1997). Malick was hilarious as the beautiful fashion editor Nina Van Horn, a neurotic and pretentious ex-model struggling with middle age. For her work on the series, Malick won a Golden Globe and two Emmy Award nominations as Best Supporting Actress in a Comedy Series. On television, she has also had regular roles in the series Trauma Center (1983) and Good Company (1996) and recurring roles on NYPD Blue (1993), Anything But Love (1989), Baywatch (1989), Kate & Allie (1984), and Frasier (1993). She also starred in several made-for-TV movies, including Paper Dolls (1982), Dynasty: The Reunion (1991) and Perfect Body (1997). She also starred in North Shore Fish (1997) on cable TV, based on a role which she originated on stage. Malick's work has included roles in the movies The American President (1995), Scrooged (1988), and Bugsy (1991). With her distinctive voice, she is in high demand for voice-over work.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODE5MzM5NDIwM15BMl5BanBnXkFtZTcwNTEzNzk3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005176","name":"Wendie Malick","idIMDB":"nm0005176"},"actorId":"nm0005176","character":"Sister Francesca","urlCharacter":"http://www.imdb.com/character/ch0371195","main":true},{"actorName":"Rebecca Creskoff","urlProfile":"http://www.imdb.com/name/nm0187460","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MDIwMzM1N15BMl5BanBnXkFtZTcwOTMzMTA1Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 February 1971","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"5' 9\" (1.75 m)","bio":"Rebecca Creskoff was born on February 1, 1971 in Philadelphia, Pennsylvania, USA. She is an actress, known for Hung (2009), Quintuplets (2004) and Friends and Family (2001). She has been married to Michael Glassner since April 28, 2012. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MDIwMzM1N15BMl5BanBnXkFtZTcwOTMzMTA1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0187460","name":"Rebecca Creskoff","idIMDB":"nm0187460"},"actorId":"nm0187460","character":"Tina","urlCharacter":"http://www.imdb.com/character/ch0233241","main":true},{"actorName":"Will Patton","urlProfile":"http://www.imdb.com/name/nm0001599","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTEzNzMxMV5BMl5BanBnXkFtZTYwNTk2Njc3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 June 1954","placeOfBirth":" Charleston, South Carolina, USA","birthName":"William Rankin Patton","height":"5' 9½\" (1.77 m)","bio":"Will Patton was born in Charleston, South Carolina. His father, Bill Patton, is a playwright, acting/directing instructor, and Lutheran minister. Patton attended the North Carolina School of the Arts. He has won two OBIE awards for best actor for the off-Broadway plays, Sam Shepard's \"Fool for Love\" and the Public Theatre production of \"What Did He See?\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTEzNzMxMV5BMl5BanBnXkFtZTYwNTk2Njc3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001599","name":"Will Patton","idIMDB":"nm0001599"},"actorId":"nm0001599","character":"Vic Sullivan","urlCharacter":"http://www.imdb.com/character/ch0233243","main":true},{"actorName":"Saul Rubinek","urlProfile":"http://www.imdb.com/name/nm0007210","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNzE1MTI4Ml5BMl5BanBnXkFtZTgwMjg0NjE3ODE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 July 1948","placeOfBirth":" Föhrenwald, Wolfratshausen, Bavaria, Germany","height":"5' 7\" (1.7 m)","bio":"Saul Rubinek was born in a refugee camp in Germany, after WWII, where his father ran a Yiddish Repertory Theatre company. Saul started his professional career as a child actor in theatre and radio in Canada. He was a member of the Stratford Shakespearean Festival company in Stratford, Ontario (1969-70) and, later, was a co-founder, actor and director of Theatre Le Hibou, Theatre Passe-Muraille and Toronto Free Theatre (1968-1974). Rubinek started working in the United States as an actor at the Public Theatre in New York (1979), and he divided his time between theatres in both countries for several years. He got his early training in film and television as an actor for the Canadian Broadcasting Corporation and he continues to work as a producer, writer and actor for Canadian independent features. He has also starred in these Canadian films: Ralph L. Thomas' Ticket to Heaven (1981) (Genie award: best supporting actor); Claude Jutra's By Design (1981) (Genie nomination: best actor); Robin Spry's Hitting Home (1988) (aka \"Obsessed\") (supporting actor nomination); Allan A. Goldstein's The Outside Chance of Maximilian Glick (1988) (Genie nomination: best actor); Mort Ransen's Falling Over Backwards (1990) and Eli Cohen's award-winning dramatic film, The Quarrel (1991), which was also co-produced by American Playhouse for PBS. Rubinek's work on U.S television spans three decades and includes recurring roles on The Equalizer (1985), guest-starring roles on Hill Street Blues (1981), L.A. Law (1986) (the final episode), Star Trek: The Next Generation (1987) (episode Star Trek: The Next Generation: The Most Toys (1990)) and Au-delà du réel - l'aventure continue (1995). He has been a semi-regular on Frasier (1993). He has been nominated for awards for his work in stage, radio, television and film, winning DramaLogue awards for his \"Touchstone\" in Des McAnuff's La Jolla production of \"As You Like It\" (1984) and for directing Rick Cleveland's \"Tom and Jerry\" at Los Angeles' Met Theatre in 1994. In the United States, he played supporting roles in Rod Lurie's The Contender (2000) with Joan Allen and in Brett Ratner's The Family Man (2000), opposite Nicolas Cage. He also appeared as Henry Kissinger in Andrew Fleming's comedy Dick - Les coulisses de la présidence (1999). He starred in Jonathan Kaufer's independent film, Bad Manners (1997) with Bonnie Bedelia and David Strathairn. He was also featured in Oliver Stone's Nixon (1995) and on Showtime's award-winning Hiroshima (1995) for Roger Spottiswoode. Saul has co-starred in Tony Scott's dramatic thriller, True Romance (1993) with Christian Slater; in MGM's Getting Even with Dad (1994) with Macaulay Culkin and Ted Danson; in Disney's comedy-thriller I Love Trouble (1994) with Nick Nolte and Julia Roberts and also in HBO's award-winning drama, And the Band Played On (1993). He played the biographer, \"W.W. Beauchamp\", in Clint Eastwood's Academy Award-winning Unforgiven (1992). In 1997, Rubinek directed his first feature for Lions Gate Films, based on the play he previously directed, Jerry and Tom (1998). He also was producer on the film in partnership with his wife, Elinor Reid, and Ralph Zimmerman, Rubinek's long-time manager. The film was an official entry in competition at Sundance in 1998. He also directed Club Land (2001) for Showtime/Paramount. Rubinek, Elinor Reid and Ralph Zimmerman's company, Creative Differences, continues to develop and produce film and television. Penguin Books published (1987) Rubinek's non-fiction book, \"So Many Miracles\", an account of his parents' survival growing up in Poland during World War II. He wrote and produced an award-winning documentary (1988) of the same title So Many Miracles (1987) for CBC and PBS which chronicles his parents' reunion with the people who saved their lives during the Holocaust.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNzE1MTI4Ml5BMl5BanBnXkFtZTgwMjg0NjE3ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007210","name":"Saul Rubinek","idIMDB":"nm0007210"},"actorId":"nm0007210","character":"Rabbi","urlCharacter":"http://www.imdb.com/character/ch0371227","main":true},{"actorName":"Bobb'e J. Thompson","urlProfile":"http://www.imdb.com/name/nm1442928","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc2NDYxODE0MV5BMl5BanBnXkFtZTcwOTk1NTk5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 February 1996","placeOfBirth":" Kansas City, Missouri, USA","bio":"Kicking off an impressive career in front of the camera at the tender age of five, Bobb'e J. Thompson rose to fame as a child actor well before his teens, initially with a small but colorful and energetic supporting role as the pint-sized Tupac in My Baby's Daddy (2003). He subsequently appeared in television and film efforts such as \"The Tracy Morgan Show\" (2004), Shark Tale (2004), \"That's So Raven\" (2004), and \"Joey\" (2005). Thompson contributed to OutKast mainstay Bryan Barber's offbeat, inventive musical drama Idlewild (2006), before teaming up with Vince Vaughn in the holiday comedy Fred Claus (2007). Thompson then starred in the acerbic farce hit comedy Role Models as the hilarious, wisecracking Ronnie Shields, for which he was nominated for Best Breakthrough Performance - Male at the 2009 MTV Movie Awards. 2009 is proving to be a break out year for Thompson. He appeared in Land of the Lost with Will Ferrell and the family comedy Imagine That, in which he plays a junior extortionist that hazes Eddie Murphy. Thompson is also a semi-regular on NBC's \"30 Rock,\" stealing scenes and showing perfect comic timing in his role as Tracy Jr., the son of Tracy Morgan's character. Not stopping, Nike recruited Thompson for multiple commercials as the fast-talking Lil Dez, who gives NBA greats Kobe Bryant and LeBron James a run for their money while babysitting. Alongside his film work, Thompson culled favorable attention for his prominent contributions to the youth-oriented urban dance video JammX Kids: Can't Dance Don't Want To, which afforded him the opportunity to show off his flair for urban music and footwork. Up next for Thompson is Snowmen with Ray Liotta and a hosting gig on the Cartoon Network show Bobb'e Says. Additionally, Reveille has entered into a talent holding deal with the 13-year-old. Reveille's first project with Thompson will be a half-hour scripted comedy. Reveille is a leading independent television studio with a major presence in scripted and unscripted television and digital entertainment. Reveille's scripted entertainment programming includes \"The Office\" (NBC), \"Ugly Betty\" (ABC), \"The Tudors\" (Showtime), and many more.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc2NDYxODE0MV5BMl5BanBnXkFtZTcwOTk1NTk5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1442928","name":"Bobb'e J. Thompson","idIMDB":"nm1442928"},"actorId":"nm1442928","character":"Mad Milton","urlCharacter":"http://www.imdb.com/character/ch0233242","main":true},{"actorName":"Lester Speight","urlProfile":"http://www.imdb.com/name/nm0711529","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1OTA2ODUxMl5BMl5BanBnXkFtZTcwMzg2NzUzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1963","placeOfBirth":" Baltimore, Maryland, USA","birthName":"Lester Speight","height":"6' 5½\" (1.97 m)","bio":"Lester Speight is a film and television actor best known for his portrayal of Terry Tate: Office Linebacker in a series of Reebok commercials that first aired during Super Bowl XXXVII in 2003. The spots feature Speight, a former All-American Football player himself, as a linebacker charged with the no-holds barred enforcement of office policies. The commercials achieved much critical acclaim and were ranked the most watched of the Super Bowl by The Hollywood Reporter. The popular character recently made a return appearance in a series of ads campaign in support of voting. Amongst the Office Linebacker's new tackles included former Vice Presidential candidate Sarah Palin. As determined and hardworking on screen as a linebacker is on the field, Speight has appeared with such stars as Eddie Murphy, Damon Wayans, Anthony Anderson, and even Optimus Prime. His television work includes a recurring role on the ABC series \"My Wife and Kids,\" as well as guest starring appearance on \"Prison Break,\" \"Bones,\" and \"Cold Case.\" On the silver screen he has appeared in hit films such as \"Transformers: Dark of the Moon,\" \"Norbit,\" and \"Harold and Kumar Escape From Guantanamo Bay.\" Aside from Terry Tate however, Speight is probably most recognized by fans of the Gears of War video game series for the XBOX 360. Speight won the G-Phoria award for Best Voiceover in 2007 by the G4 Network for his performance as Augustus Cole (AKA Cole Train), a character that was modeled after Speight and includes subtle allusions to the Office Linebacker.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1OTA2ODUxMl5BMl5BanBnXkFtZTcwMzg2NzUzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0711529","name":"Lester Speight","nicknames":["The Mighty Rasta","Rasta"],"idIMDB":"nm0711529"},"actorId":"nm0711529","character":"Redrum","urlCharacter":"http://www.imdb.com/character/ch0233245","main":true},{"actorName":"Kurt Doss","urlProfile":"http://www.imdb.com/name/nm1476424","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMTk3ODYxMV5BMl5BanBnXkFtZTgwNDc5ODM3OTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1996","placeOfBirth":"","bio":"Kurt Doss was born on September 18, 1996. He is an actor, known for Colony (2016), Knucklehead (2010) and Ruby & the Rockits (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMTk3ODYxMV5BMl5BanBnXkFtZTgwNDc5ODM3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1476424","name":"Kurt Doss","idIMDB":"nm1476424"},"actorId":"nm1476424","character":"Henry","urlCharacter":"http://www.imdb.com/character/ch0233244","main":true},{"actorName":"Lurie Poston","urlProfile":"http://www.imdb.com/name/nm1407647","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxOTM3NjU3OF5BMl5BanBnXkFtZTcwMjY5ODkyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Lurie Preston Poston","bio":"Lurie Poston was born as Lurie Preston Poston. He is an actor, known for Step Brothers (2008), Walk Hard: The Dewey Cox Story (2007) and Girls Will Be Girls (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxOTM3NjU3OF5BMl5BanBnXkFtZTcwMjY5ODkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1407647","name":"Lurie Poston","idIMDB":"nm1407647"},"actorId":"nm1407647","character":"Todd","urlCharacter":"http://www.imdb.com/character/ch0230314","main":true},{"actorName":"Lance E. Nichols","urlProfile":"http://www.imdb.com/name/nm0629634","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMTMwNTQ3NV5BMl5BanBnXkFtZTgwODQ1OTExMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1955","placeOfBirth":" New Orleans, Louisiana, USA","height":"6' 1\" (1.85 m)","bio":"Distinguished New Orleans actor, Lance Nichols, stars in the Emmy nominated HBO drama series TREME, which follows several New Orleans natives as they try to rebuild their lives after the devastation left behind by Hurricane Katrina. Nichols plays the dentist 'Larry Williams', supportive and devoted husband to 'LaDonna Baptiste-Williams' (Khandi Alexander) and loving father to his two stepchildren. Born in the 12th ward of New Orleans, Nichols grew up attending McDonough 35 and remained in the city through his college years, attending the University of New Orleans in 1973. Having begun as a pre-med major, Nichols knew quickly that this was not his calling. A freshman drama class spurred his decision to change his major, which resulted in a GPA jump and a Bachelors degree in Dramatic Arts and Communications. After attending a national dramatic audition for graduate studies, Nichols was offered entrance into seven different programs. Budget cuts eventually made it impossible for him to attend, however, and he remised to manual labor work, loading trucks for UPS. Not one to give up on his true passion for acting, Nichols made the decision to move to Los Angeles in 1978 where he quickly landed his first on-screen gig on the widely popular game show \"The Dating Game.\" Though love never sparked for him on the show, following his appearance he was fortunate enough to run into another New Orleans native at a Baskin Robbins, whom he married less than a year later. Today, after 31 years of marriage and three children, the couple are still going strong, having battled the plight of Hurricane Katrina not only on the small screen of TREME but also in real life as a working family. Nichols is most widely known for his role as the preacher in the 2008 Academy Award nominated film, THE CURIOUS CASE OF BENJAMIN BUTTON, alongside Brad Pitt and Cate Blanchett. Following the success of this role, Nichols landed a part in the Warner Bros. summer blockbuster THE CAMPAIGN (2012), starring Will Ferrell and Zach Galifianakis. Throughout his 30+ years of acting, spanning from the early 80s to present day, Nichols has made over 75 appearances on multiple award winning and critically acclaimed television series including: CHEERS, MURDER SHE WROTE, MATLOCK, EVERYBODY LOVES RAYMOND and DESPERATE HOUSEWIVES. After a long stint in Los Angeles pursuing his passion, Nichols returned to his roots in New Orleans where he landed a role close to his heart - his current role on TREME. Nichols is currently filming the fourth and final season of TREME and has recently wrapped filming on the feature film adaptation of BEAUTIFUL CREATURES alongside Academy Award nominee Viola Davis and Academy Award winning actress Emma Thompson. When he's not on set, Nichols and wife Zardis stay busy operating Lanzardis Productions, their company that specializes in acting and dialogue coaching. In his free time, Nichols can be found at home in New Orleans with his wife and kids, most likely at a Saints game cheering his team to victory.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMTMwNTQ3NV5BMl5BanBnXkFtZTgwODQ1OTExMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0629634","name":"Lance E. Nichols","idIMDB":"nm0629634"},"actorId":"nm0629634","character":"Milton's Dad","urlCharacter":"http://www.imdb.com/character/ch0371196","main":true},{"actorName":"Jake Austin Walker","urlProfile":"http://www.imdb.com/name/nm2397206","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MTUyMjM4M15BMl5BanBnXkFtZTgwODg2MzA0MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 11½\" (1.82 m)","bio":"Jake Austin Walker is an American Actor best known for his guest-star roles in tv series such as Bones (FOX) (the highest viewed episode for the series entitled, \"Mummy in the Maze,\" as \"Matty\").Jake can also be seen in the sketch comedy tv show \"Thank God Your Here\"(NBC), \"Til Death\" (FOX) and Identity (NBC). Jake appears in the family feature film \"The Chaperone\" as the counterpart (\"Ted\") to wrestling sensation Triple H (Paul Levesque) \"Ray,\" as a bad boy turned good. Jake next went on to film the role of \"Jack\" in the horror film \"No One Lives\" with action star Luke Evans. Jake's biggest break came most recent on a visit back home in Mississippi, when he was asked to tape a audition for a series regular role for a new pilot filming in the southeast. Jake and his mother Kim, who has been his acting coach for the last five years, taped a scene between a mother and son that landed Jake his first series regular role. Jake can soon be seen as \"Jared Talbot\" the 15 year old brother of \"Daniel\" (Aden Young)in the first scripted drama series for the Sundance Channel, (RECTIFY). \"Jared is Daniel's moral compass to the outside world as he manages his way through society after being released from death row.\" Daniel Holden must put his life back together after serving 19 years on Georgia's Death Row before DNA evidence calls his conviction into question. Jake is also a singer and has released many covers and fully recorded originals on youtube.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MTUyMjM4M15BMl5BanBnXkFtZTgwODg2MzA0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2397206","name":"Jake Austin Walker","nicknames":["Red"],"idIMDB":"nm2397206"},"actorId":"nm2397206","character":"Dennis","urlCharacter":"http://www.imdb.com/character/ch0233247","main":true},{"actorName":"Douglas M. Griffin","urlProfile":"http://www.imdb.com/name/nm0341174","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5OTk4ODk2NV5BMl5BanBnXkFtZTgwNDEzNjYxMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1966","placeOfBirth":" New Orleans, Louisiana, USA","height":"5' 11\" (1.8 m)","bio":"Douglas M. Griffin was born on November 17, 1966 in New Orleans, Louisiana, USA. He is an actor, known for Deepwater (2016), Maggie (2015) and Mr. Right (2015). He is married to Annie Poirier.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5OTk4ODk2NV5BMl5BanBnXkFtZTgwNDEzNjYxMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341174","name":"Douglas M. Griffin","idIMDB":"nm0341174"},"actorId":"nm0341174","character":"Sketchy Driver","urlCharacter":"http://www.imdb.com/character/ch0371197","main":true}],"seasons":[],"idIMDB":"tt1524131","urlIMDB":"http://www.imdb.com/title/tt1524131","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 40 min (100 min) (USA)"],"soundMix":["Dolby Digital","DTS"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.3","metascore":"24","filmingLocations":[{"location":"New Orleans, Louisiana, USA"}],"rated":"PG-13","awards":[],"votes":"2,125","type":"Movie","companyCreditsSimple":[{"idCompany":"co0242604","name":"WWE Studios"}],"keywords":{"keywords":["nun","con artist","church","wrestling","one word title","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 09:05:17"}}