{"data":{"movies":[{"title":"Textuality","originalTitle":"","year":"2011","releaseDate":"20110823","directors":[{"name":"Warren P. Sonoda","id":"nm1284464"}],"writers":[{"name":"Liam Card","id":"nm2583521"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3ODA3MDI5Nl5BMl5BanBnXkFtZTcwODAwMzQyNQ@@._V1.jpg","countries":["Canada"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"Two people attempt to get into a relationship, while exiting the multiple relationships they were each managing through their Blackberries before they met.","simplePlot":"Two people attempt to get into a relationship, while exiting the multiple relationships they were each managing through their Blackberries before they met.","actors":[{"actorName":"Jason Lewis","urlProfile":"http://www.imdb.com/name/nm0507314","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzE0NTczMTYxMF5BMl5BanBnXkFtZTcwODU4OTEwNg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 June 1971","placeOfBirth":" Newport Beach, California, USA","height":"6' 2\" (1.88 m)","bio":"A top fashion model turned actor, Jason Lewis is from Southern California. As a teenager, he was determined to get out and see the world. He had to work hard in order to do so, working for a plumbing contractor, and 55 hours a week as a waiter in a restaurant. In June of 1993, when finally he had enough money collected, he went to Paris at the suggestion of a model scout who thought he would do great in the modeling industry. Jason did a little modeling and was soon on his way to Milan, where he was adored by the fashion industry there. Towards the end of 1993, he landed a GUESS? campaign and his career boosted increasingly. He began landing campaigns with Tommy Hilfiger, Boss (photographed by Richard Avedon), Byblos, and Ray Ban. He also continued working many major fashion shows in Milan, New York, and Paris. In 1996, Jason was nominated for Male Model of the Year at the VH1 Fashion Music Awards. Besides all the runway shows, he has been featured alone in an 11-page editorial in the February 1996 issue of GQ. He was also one of the stars of NBC TV's High Sierra Search and Rescue (1995), a visually stunning seven part series about mountain rescue set in the High Sierras. Following this early success, he has studied with three private acting coaches for what he hopes will be a future in film. He had done a guest stint on Beverly Hills, 90210 (1990), and was a recent addition to the cast of Sex and the City (1998). Once living in New York as a high profile model, Jason followed an incredible modeling schedule. However, his interest in acting limits his modeling assignments to just fashion editorials and ad campaigns (no longer runways). His loyal fans still remember him in the pages of GQ and Esquire in 2002, and the winter 2002 Gap campaign. He is signed to Wilhelmina Models, Inc. Some of his best friends are also major male models, such as Alex Lundqvist (who was also Jason's roommate), and Mark Vanderloo.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzE0NTczMTYxMF5BMl5BanBnXkFtZTcwODU4OTEwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0507314","name":"Jason Lewis","idIMDB":"nm0507314"},"actorId":"nm0507314","character":"Breslin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carly Pope","urlProfile":"http://www.imdb.com/name/nm0005318","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4OTcwNTUzNF5BMl5BanBnXkFtZTcwMjQyNzY0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1980","placeOfBirth":" Vancouver, British Columbia, Canada","height":"5' 6\" (1.68 m)","bio":"Carly graduated from high school in Vancouver in 1998. She made her American screen debut in I've Been Waiting for You (1998). Her most noticeable roles to date are \"Molly White\" in Trapped in a Purple Haze (2000), and \"Sam McPherson\" in TV's Popular (1999). She auditioned for roles on Roswell (1999) before she landed the role of \"Sam McPherson\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4OTcwNTUzNF5BMl5BanBnXkFtZTcwMjQyNzY0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005318","name":"Carly Pope","nicknames":["Carlita","Lita"],"idIMDB":"nm0005318"},"actorId":"nm0005318","character":"Simone","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric McCormack","urlProfile":"http://www.imdb.com/name/nm0005202","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNDYzOTY3Ml5BMl5BanBnXkFtZTcwMTU3NjYyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1963","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Eric James McCormack","height":"5' 11\" (1.8 m)","bio":"Eric was born and raised in Toronto, Ontario. He attended Stephen Leacock Collegiate Institute (the same school Mike Meyers attended) and also attended Sir John A. MacDonald Collegiate, named after Canada's first Prime Minister. With the support of his parents (his father was also an aspiring actor), Eric spent three years at the Ryerson Theater School in Toronto and the Banff Center for the Arts, and went on to spend five seasons with Canada's Stratford Festival - he graduated 'lead' status in such stage classics as \"A Midsummer Night's Dream\", \"Henry V\" and \"The Three Sisters\". Eric then moved to Vancouver, British Columbia, where he also moved into television and movies and gained a devoted following of fans. Eric makes his home in both Vancouver and Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNDYzOTY3Ml5BMl5BanBnXkFtZTcwMTU3NjYyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005202","name":"Eric McCormack","nicknames":["E Mack"],"idIMDB":"nm0005202"},"actorId":"nm0005202","character":"Clive","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Liam Card","urlProfile":"http://www.imdb.com/name/nm2583521","urlPhoto":"","biography":{"dateOfBirth":"3 March 1980","placeOfBirth":" Paisley, Ontario, Canada","bio":"Liam graduated from Saugeen District Secondary School in Port Elgin, Ontario. During his high school track and field career, Liam was a 2-time Canadian National Jr. Champion (400m) and represented Canada on the National Jr. Team. From there, Liam attended the University of Iowa for two years before transferring to the University of North Carolina, Chapel Hill. At both Universities, Liam was a full-scholarship athlete. Upon graduating from University, Liam returned to Toronto, Canada where he worked for a short stint on Bay Street as a licensed Investment Advisor. However, he left the field after only eighteen months to pursue a career in acting. Liam also competed for a spot on Canada's national team in Bobsleigh.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2583521","name":"Liam Card","idIMDB":"nm2583521"},"actorId":"nm2583521","character":"Michael","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kris Holden-Ried","urlProfile":"http://www.imdb.com/name/nm0390285","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNzg5MDMyOV5BMl5BanBnXkFtZTcwMzMwMDMzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 August 1973","placeOfBirth":" Pickering, Ontario, Canada","height":"6' 1½\" (1.87 m)","bio":"Television and film actor. Pentathlon Champion. Father. Werewolf... Born in Scarborough, Ontario and raised in a farm town, northeast of Toronto, Kris' driven spirit has garnered success in many areas of his life. Kris knew he wanted to be an actor early on, however acting wasn't a widely supported career choice in his family. Instead of pursuing it right away, Kris opted to attend Montreal's Concordia University School of Business to study international commerce. While continuing his education, Kris also competed in sports, as he was a strong athlete throughout grammar and high school. Quickly, he excelled as an athlete, becoming a member of the Canadian National Pentathlon Team and achieving silver medals from both the Pan American and Pan Pacific Pentathlon Championships for riding and fencing. Although Kris was an extremely talented athlete, both his financial situation and his interests lead him into the acting world. In 1994, Holden-Ried joined a small agency in Montreal in the hopes of making some money, so he could continue his education. His first audition that came up was for the title/leading role in \"Young Ivanhoe,\" a 12th century dramatic, children's period piece TV movie. Kris had the skills, the look, and luckily, as it turns out, the talent. He landed this first audition and has been working as an actor ever since. Kris currently stars as 'Dyson,' in the Syfy series Lost Girl, where he portrays a very likable werewolf-shifter, working in the human world as a police detective. You can also see Kris as Quint in the fourth Underworld installment, Underworld Awakening, and The Returned. Viewers may also know Kris as 'William Compton,' on Showtime's former hit series, The Tudors, (2007,) as he has been working nonstop for nearly two decades. Other credits include multi-episode arcs on Degrassi: The Next Generation, M.V.P. and The Bridge. His film credits also include K-19: The Widowmaker, Gossip, amongst others. To improve his craft, Holden-Ried has trained with Uta Hagen's Master Class Scene Study, and with Janine Manatis of the Actor's Studio NY and the National Film Acting School. When Kris isn't acting, he enjoys adventure, traveling, and being outdoors. Some of his interests include sailing, scuba diving, surfing, and yoga, with one of his favorite films being Gandhi. If he could work with anyone, it would be some of the great, classic directors, such as Scorcese, Scott and Spielberg, as Kris would love to transition behind the camera one day. Kris live in Toronto with his son and his Black Labrador, Hopper.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNzg5MDMyOV5BMl5BanBnXkFtZTcwMzMwMDMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0390285","name":"Kris Holden-Ried","idIMDB":"nm0390285"},"actorId":"nm0390285","character":"Colin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kristen Hager","urlProfile":"http://www.imdb.com/name/nm1982266","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMjc1Nzc0Ml5BMl5BanBnXkFtZTgwMDU5ODgzODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 January 1984","placeOfBirth":" Red Lake, Ontario, Canada","bio":"Kristen Hager was born on January 2, 1984 in Red Lake, Ontario, Canada. She is an actress, known for Wanted (2008), Aliens vs. Predator: Requiem (2007) and Being Human (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMjc1Nzc0Ml5BMl5BanBnXkFtZTgwMDU5ODgzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1982266","name":"Kristen Hager","idIMDB":"nm1982266"},"actorId":"nm1982266","character":"Dani","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marcello Cabezas","urlProfile":"http://www.imdb.com/name/nm1727069","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDgxNmIwZTItM2EyMS00YWQ3LTljYTAtYzEzM2I4YTY3YzFmXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Marcello is a performer, producer and a writer. He is also the Artistic Producer of macIDeas (www.macideas.com), recipient of the 2004 Bright Light Innovation Award from The Toronto Star for innovation in producing and marketing. He is currently filming the improvised feature Dirt with award winning director Matt Austin.He most recently starred in Leo (macIDeas/ Radke Films/ Bravo Fact!)directed by David Hyde with Liane Balaban, Jackie Burroughs, and Joris Jarsky. A hit at the 2005 Toronto International Film Festival, it is now in development for feature, as well as entry to other worldwide film festivals. Marcello also starred in the film choke., with Allegra Fulton, and Lindy Booth. choke. garnished much attention at the 2004 Toronto International Film Festival, a \"programmers\" pick at the Palm Springs Film Festival and the Woodstock Film Festival along with other international festivals. Following much critical acclaim choke was nominated for a GENIE AWARD (Canadian Academy Awards) for best live action short film in March 2005. On the stage, Marcello made a splash with his performance as \"Warren\"(role originated by Mark Ruffalo and played by Jake Gyllenhaal, Kieran Culkin, and Freddie Prinze Jr. in London) in the Canadian professional premiere of Kenneth Lonergan's play, This is Our Youth, directed by Woody Harrelson, with Queer as Folk's Fabrizio Filippo and Genie nominated Marya Delver in 2003. He also starred in the 2004 remount, with Sex and The City's Jason Lewis and Ginger Snaps star, Katharine Isabelle. (www.thisisouryouth.ca). On his performance in This is Our Youth: I have immense respect for Marcello because he is more than a terrific producer and actor- he is able to make dreams a reality, Woody Harrelson. (Cabezas)is a natural-born stage killer, Globe & Mail. Cabezas earns our sympathy and admiration, his chemistry with Filippo is excellent, (Delver's) make-out scene with Cabezas is convincingly hot, Variety. We discover the shades of nuance that Cabezas can introduce. One minute you want to punch his lights out, the next you want to hold him until he stops shaking. It's a fine subtle job, Toronto Star. Cabezas is thoughtful and lucid. His two scenes with Jessica (Delver) are beautifully outlined in writing and performance, National Post. Warmly played by sad eyed Cabezas, klutzy Warren emerges as the boyish, sympathetic hero, Toronto Sun. Cabezas gives an excellent performance as Warren that grows in power throughout the evening, Stage Door. Cabezas plays Warren with an amazing sense of foolishness and impulsiveness and occasional surprisingly sensitive lucidity-a shy sexiness, Cabezas gives him a lazy drawl that makes his wry remarks even funnier, and his is a tender portrait of one who nurses a private wound in his soul, Stage and Page. Marcello also brought attention to his work with a powerful portrayal of the one-man show Vladeck, Jodi Miller's disturbing fictional account of a real life fatal beating of an innocent boy. In response to overwhelming feedback and success, Chum Television (Canadian Learning Television) optioned the script and shot the Vladeck National Television Special. CLT aired the special in spring 2004 to much critical acclaim. The TV special is being sold to other English markets, and looking at packaging it for mass distribution to schools and youth groups across the country. Vladeck has also been optioned as a feature film by producer George Burger and Marcello, and is looking to a 2006 production date. On his performance in Vladeck: Cabezas performs with vigour and sensitivity, Eye Magazine. Brilliant performance from a Dora deserving Cabezas, Canadian Jewish News. Cabezas delivers a highly believable teenspeak, Globe and Mail. Cabezas plays Vladeck with an abundance of energy and commitment, Toronto Star. Other film and television credits include Marcello's recent guest star appearance in G-Spot (The Movie Network) with director Michael Kennedy (Kids in The Hall), and Homie Spumoni with Whoopi Goldberg and directed by Mike Cerrone (Me, Myself and Irene). Marcello has also had principal guest roles in Tracker (Fox) with Peter Mensah and the award-winning series Blue Murder. Marcello starred in the features Snowballs in Hell with Megan Dunlop (Parsley Days) and Fun With Roofies, a quirky short from Genie-winning director Naomi McCormack which screened at the Female Eye Film Festival in Toronto. Marcello attended theater school at New York City's Neighborhood Playhouse School of the Theatre, and completed the Ensemble Studio Theatre's Professional Writing Internship. In New York, Marcello enjoyed success on the stage, starring in the well reviewed two-hander, WC (winner of Overall Excellence Award at the 2000 New York Int'l Fringe Festival) and Love Labour's Won (winner of the Best Ensemble Cast at the 2000 Vital Works Festival). Still in New York, Marcello starred in various award-winning independent shorts and features, including Women Don't Eat Meat (recipient of the 2001 Pioneer Theatre Audience Award). Marcello also shot two independent pilots in New York: Newton Fuzzy and No Sleep Til' Brooklyn, and worked in the reputable PSNBC space on Crescendo Falls, a hilarious soap-opera farce that went on to be one of the more successful runs of that season. While in New York, Marcello had the opportunity to work as the casting assistant for the Emmy Award-winning casting office of the HBO series Sex and the City, which opened his eyes to the world of television and casting. Producing credits for macIDeas include Vladeck (Buddies in Bad Times), This is Our Youth directed by Woody Harrelson- 2003 & 2004 remount (Berkeley St. Theatre), the extended engagement of the production of Matt & Ben (www.mattandbentheplay.com) (Poor Alex Theatre). On the film side, Marcello served as a consultant for choke. and was an Executive Producer on, Leo. He is also the creator and Executive Director of POV Film Camp, a new venture providing an opportunity for underprivileged youth to be exposed to the filmmaking process and how it then may inspire them to be a storyteller in the future, and enrich their lives forever. Many notables are listed to attend the camp as counselors schedule permitting including Thora Birch, Sharon Gless, Jason Lewis, and many others. Marcello's writing credits include Nowhere to Turn, produced at the reputable Ensemble Studio Theatre in New York, and is working on a couple projects in development, including a class/race struggle piece entitled Kasimba.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDgxNmIwZTItM2EyMS00YWQ3LTljYTAtYzEzM2I4YTY3YzFmXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1727069","name":"Marcello Cabezas","idIMDB":"nm1727069"},"actorId":"nm1727069","character":"Jacob","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Supinder Wraich","urlProfile":"http://www.imdb.com/name/nm3621766","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDA2MTgxNDE2OV5BMl5BanBnXkFtZTgwODE1NzA1NjE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"height":"5' 3\" (1.6 m)","bio":"Supinder Wraich is an actress and producer, known for Guidestones (2012), Margarita (2012) and Silent Cargo (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDA2MTgxNDE2OV5BMl5BanBnXkFtZTgwODE1NzA1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3621766","name":"Supinder Wraich","nicknames":["Supz"],"idIMDB":"nm3621766"},"actorId":"nm3621766","character":"Heather","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shane Nicely","urlProfile":"http://www.imdb.com/name/nm3737282","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk3MzExNDMyNV5BMl5BanBnXkFtZTgwMzU5Nzk2OTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Shane Nicely is an actor, known for Textuality (2011), Arc (2016) and Dirk Gently's Holistic Detective Agency (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk3MzExNDMyNV5BMl5BanBnXkFtZTgwMzU5Nzk2OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3737282","name":"Shane Nicely","idIMDB":"nm3737282"},"actorId":"nm3737282","character":"Marcus","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Holly Elissa","urlProfile":"http://www.imdb.com/name/nm0226597","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0OTQ4MjM0Nl5BMl5BanBnXkFtZTgwNjE4MDE0ODE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1979","placeOfBirth":" Moncton, New Brunswick, Canada","birthName":"Holly Elissa Dignard","height":"5' 6\" (1.68 m)","bio":"Holly Elissa was born on October 1, 1979 in Moncton, New Brunswick, Canada as Holly Elissa Dignard. She is an actress and producer, known for Supernatural (2005), Fringe (2008) and Whistler (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0OTQ4MjM0Nl5BMl5BanBnXkFtZTgwNjE4MDE0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0226597","name":"Holly Elissa","idIMDB":"nm0226597"},"actorId":"nm0226597","character":"Kara","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny Wells","urlProfile":"http://www.imdb.com/name/nm0920164","urlPhoto":"","biography":{"dateOfBirth":"7 April 1941","placeOfBirth":" Montreal, Quebec, Canada","birthName":"Jack Westelman","height":"6' (1.83 m)","bio":"Danny Wells was born on April 7, 1941 in Montreal, Quebec, Canada as Jack Westelman. He was an actor and composer, known for Magnolia (1999), The Super Mario Bros. Super Show! (1989) and The Last Kiss (2006). He died on November 28, 2013 in Toronto, Ontario, Canada.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0920164","name":"Danny Wells","idIMDB":"nm0920164"},"actorId":"nm0920164","character":"Mitch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anna Cyzon","urlProfile":"http://www.imdb.com/name/nm2149087","urlPhoto":"","biography":{"bio":"Anna Cyzon is an actress, known for Tru Love (2013), Unrivaled (2010) and Degrassi Takes Manhattan (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2149087","name":"Anna Cyzon","idIMDB":"nm2149087"},"actorId":"nm2149087","character":"Erin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicholas Rose","urlProfile":"http://www.imdb.com/name/nm1418164","urlPhoto":"","biography":{"dateOfBirth":"24 August 1981","placeOfBirth":" Grande Prairie, Alberta, Canada","height":"5' 10\" (1.78 m)","bio":"Nicholas Rose was born on August 24, 1981 in Grande Prairie, Alberta, Canada. He is known for his work on Upside Down (2012), The Incredible Hulk (2008) and New Year (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1418164","name":"Nicholas Rose","idIMDB":"nm1418164"},"actorId":"nm1418164","character":"Joe Marsh","urlCharacter":"http://www.imdb.com/character/ch0508872","main":true},{"actorName":"Marianthi Evans","urlProfile":"http://www.imdb.com/name/nm2561177","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NTQ3OTc0Nl5BMl5BanBnXkFtZTcwNzAzOTU0OA@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 November 1977","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Marianthi Pitsadiotis","height":"5' 7\" (1.7 m)","bio":"Marianthi Evans was born on November 25, 1977 in Toronto, Ontario, Canada as Marianthi Pitsadiotis. She is an actress, known for Max Payne (2008), Witchslayer Gretl (2012) and Textuality (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NTQ3OTc0Nl5BMl5BanBnXkFtZTcwNzAzOTU0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2561177","name":"Marianthi Evans","idIMDB":"nm2561177"},"actorId":"nm2561177","character":"Jenny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Randy Thomas","urlProfile":"http://www.imdb.com/name/nm0859394","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjYyNjhjYTEtZjM5My00NjIwLWEzOWMtZGE0MzQyODkyYmUwXkEyXkFqcGdeQXVyNjEyNDI5Njc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 February 1968","placeOfBirth":" Kingston, Ontario, Canada","birthName":"Randy Conley Joseph Thomas","height":"5' 10\" (1.78 m)","bio":"Randy Thomas moved from Moncton, New Brunswick to Montreal, Quebec in 1996 to pursue a career in acting. After his arrival in Montreal, Randy has studied regularly with acting schools such as the MSOPA, the Actor's Studio, the Ivana Chubbuck Workshops, the Warren Robertson workshops and most recently, the Professional Actors Lab in Toronto. Randy had the opportunity to work Robert Downey Jr. and Halle Berry on the set of Gothika (2003) which was directed by Mathieu Kassovitz. Due to conflicting schedules, he was honored to have been asked by Kassovitz to step in and work with Berry on several occasions. It was a truly invaluable experience. Randy was fortunate to portray memorable characters in several award winning productions, most notably, in Armistead Maupin 's _\"Further Tales of the City\" (2001)(mini)_ and Monk (2002) with Tony Shalhoub. In April of 2006, the theatrical release of The Rocket (2005) opened across Canada. This film features Randy in the role of Toe Blake, alongside Roy Dupuis (Maurice Richard) and Stephen McHattie (Dick Irvin, Sr.). He is interested in studying other facets of the industry like writing and producing. With one screenplay completed and three more in synopsis form, he intends to create and develop several projects as soon as time and co-production deals permit.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjYyNjhjYTEtZjM5My00NjIwLWEzOWMtZGE0MzQyODkyYmUwXkEyXkFqcGdeQXVyNjEyNDI5Njc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0859394","name":"Randy Thomas","idIMDB":"nm0859394"},"actorId":"nm0859394","character":"Jack","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1573483","urlIMDB":"http://www.imdb.com/title/tt1573483","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 35 min (95 min)","1 hr 30 min (90 min) (Canada)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.0","filmingLocations":[{"location":"Toronto, Ontario, Canada"}],"rated":"R","awards":[],"votes":"773","type":"Movie","companyCreditsSimple":[{"idCompany":"co0253626","name":"Strident Films"}],"keywords":{"keywords":["blackberry","male nudity","red bra","black panties","dating","female nudity","text messaging","text message","casual sex"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:09:45"}}