{"data":{"movies":[{"title":"Donner Pass","originalTitle":"","year":"2011","releaseDate":"20121115","directors":[{"name":"Elise Robertson","id":"nm0731826"}],"writers":[{"name":"R. Scott Adams","id":"nm3872059"},{"name":"R. Scott Adams","id":"nm3872059"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDI1MzU0MTc4Ml5BMl5BanBnXkFtZTcwMDYxOTE0NQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror"],"plot":"In 1846, in the Sierra Nevada Mountains in the area known as Donner Pass, a starving man kills three others to eat their flesh during the winter, but a boy witnesses the murders and flees. In the present days, the teenagers Kayley, her boyfriend Mike, her cousin Nicole and the outcast Thomas travel to the house in Donner Pass of Thomas's parents that are in Europe. Thomas recommends his friends to be careful with the house since his parents do not know that they are spending the weekend there. They learn that the police are hunting down the criminal James Michael Epstein. Out of the blue, the troublemaker boyfriend of Nicole, Derek, comes with his friends Brody, Valerie and A.J. in his SUV to stay with Nicole, despite the protests of Thomas. Soon their beer runs out and Brody drives the SUV to buy some more in the town. Brody goes missing and soon Mike, Kayley and Thomes find his body eaten. Meanwhile Valerie is murdered near the house and the car has flat tires. Who might be the ...","simplePlot":"Donner Pass has a well-known and macabre history - the place where George Donner and his party got stuck in the winter of 1846 and were forced to resort to cannibalism to keep from starving. But what if it wasn't just history?","actors":[{"actorName":"Elise Robertson","urlProfile":"http://www.imdb.com/name/nm0731826","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2OTc4NjQ2N15BMl5BanBnXkFtZTgwMDE4MDMzMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Elise Robertson is a multi-faceted storyteller with experience directing and appearing in projects in a range of media. Born in Pittsburgh, PA, she graduated from Northwestern University's theatre department where she studied directing, acting and literary adaptation, and minored in fine art. She has gone on to work extensively in all of these disciplines, and brings her varied skills to her work in any media. She directed the feature-length dark thriller Donner Pass, which had a wide digital distribution in 2012 and aired on Showtime. In 2015, Elise was recognized as a notable Woman in Horror by Horror Society. She's also directed extensively in the LA theatre scene. A few especially memorable productions were her Garland Award-nominated 2008 revival of The Women and her world premiere comedy Sister Cities that traveled to the Edinburgh Fringe Festival where it garnered multiple 5 star reviews. Prior to moving to LA, Elise worked extensively in the Bay Area. She directed and executive produced the PBS series American Storytellers, featuring dramatic adaptations of famous American short stories, for which she earned numerous awards, including a Cine-Golden Eagle for Ralph Ellison's King of the Bingo Game. She also helmed the PBS children's series Adventures With Kanga-Roddy, a multi-camera show featuring actors, puppets and full-sized suited characters, for which she won a Northern California Directing Emmy. Elise began her career in the film industry as a character painter on Tim Burton's The Nightmare Before Christmas, and went on to do scenic work on numerous features. She was Art Department Supervisor on ABC's Bump in the Night and ran her own model and character shop with clients ranging from Will Vinton Studios to Sony and Atari. As a working actor for the past fourteen years, she has appeared in dozens of TV shows, films and commercials; American Sniper, Arrested Development, The Mentalist, Sons of Anarchy, Six Feet Under to name just a few. Transitioning into new media, Elise recently directed a comedy web series Nick Mom entitled The Wisdom of Children in 2014. She's also created a slew of sketch comedy offerings for her youtube channel MomMayhem, including The Sex Negotiators, The PTA Rap, The Literal Police, and the series Mommy Tell Me A Story which won Outstanding Comedy Series and Outstanding Actress at LA Webfest 2014. She is also the mother of two amazing girls, Stella and Sadie, for whom she recently wrote her debut novel The Hatching Stone. A fantasy story for mid-grade readers, The Hatching Stone won the Echo Park Novel Writing Competition in 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2OTc4NjQ2N15BMl5BanBnXkFtZTgwMDE4MDMzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0731826","name":"Elise Robertson","idIMDB":"nm0731826"},"actorId":"nm0731826","character":"Dead Mother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Russ Russo","urlProfile":"http://www.imdb.com/name/nm0973729","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWM2NjdhZDAtMmI5My00NWRjLTllMTctZTQ0YzgwODc3ZDM3L2ltYWdlXkEyXkFqcGdeQXVyMzY2MDEzNjM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 December 1975","placeOfBirth":" Gloucester, Massachusetts, USA","birthName":"Russell Arthur Benson Jr.","height":"5' 9½\" (1.77 m)","bio":"Russell Arthur Benson Jr. was born to Cynthia Lattof and Russell Benson. Russell Benson Sr. was a union plumber who had come back from Vietnam. Cynthia Lattof was a student at Gloucester State College. They divorced in 1979. Cynthia had moved Russell and his infant brother out to Sacramento, California where she met future husband Frank Russo. Frank adopted the two boys and Russell Arthur Benson Jr. name changed legally to Russell Austin Russo. The family then moved to Phoenix, Arizona before settling for a cross country drive in December 1982 to Long Branch, New Jersey where Frank's family lived. The family rented homes and duplexes while having three more children. In April 1992, the Russo family moved to Rumson, New Jersey. Russ finished his senior year of high school at Rumson-Fair Haven Regional and graduated in 1994.He then moved with long time girlfriend Laura Wood to Clearwater, Florida in June 1996. The relationship dissolved and in November 1997, Russell moved back to Rumson, New Jersey. Russ was studying business-finance at Brookdale College. In February 1999, he stumbled upon the Jewelbox Theatre. Jade Greene, the director of the theatre, was offering internships for acting classes. In the months to follow, he studied Alexander, Meisner, Stella Adler, Lee Strausberg and Method acting. Russ worked as a utility actor in various plays during the internship before landing a lead role in Clifford Oddet's classic \"Awake & Sing\" playing Moe Axelrod, a role previously performed by Sanford Meisner. Russ began traveling to NYC to study at Tisch in various acting workshops as well as working with the NJ Theatre Exchange. In March 2002, he landed the lead role in the Independent film \"Envy\" portraying a character with multiple personality disorder. \"Envy\" won the Buzz award at the NY Independent Film Festival. Russ continues to act in various plays and films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWM2NjdhZDAtMmI5My00NWRjLTllMTctZTQ0YzgwODc3ZDM3L2ltYWdlXkEyXkFqcGdeQXVyMzY2MDEzNjM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0973729","name":"Russ Russo","nicknames":["Russ","Rusty"],"idIMDB":"nm0973729"},"actorId":"nm0973729","character":"Jed","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joel Stoffer","urlProfile":"http://www.imdb.com/name/nm0831106","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MDQ4MjM0M15BMl5BanBnXkFtZTcwNjI1NTIzOQ@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"bio":"Joel Stoffer is an actor, known for Indiana Jones and the Kingdom of the Crystal Skull (2008), The One (2001) and Species III (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MDQ4MjM0M15BMl5BanBnXkFtZTcwNjI1NTIzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0831106","name":"Joel Stoffer","idIMDB":"nm0831106"},"actorId":"nm0831106","character":"Robert","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas Kopache","urlProfile":"http://www.imdb.com/name/nm0465664","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5OTY5NDAwNV5BMl5BanBnXkFtZTcwMDc5NzgyMQ@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1945","placeOfBirth":" Manchester, New Hampshire, USA","height":"5' 9\" (1.75 m)","bio":"Thomas Kopache is an actor born in Manchester, New Hampshire on October 17, 1945 who is best known for his role as Assistant Secretary of State Bob Slatterly on The West Wing (1999) and for appearing in many roles on all of the various \"Star Trek\" spin-off television shows. Kopache has played seven characters on the \"Star Trek\" spin-offs Star Trek: The Next Generation (1987), Star Trek: Deep Space Nine (1993), Star Trek: Voyager (1995), and \"Star Trek: Enterprise\". He also appeared in the Star Trek movie Star Trek: Generations (1994) and the \"Star Trek\"-inspired sci-fi TV series Babylon 5 (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5OTY5NDAwNV5BMl5BanBnXkFtZTcwMDc5NzgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0465664","name":"Thomas Kopache","idIMDB":"nm0465664"},"actorId":"nm0465664","character":"Reed","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Luca Bovelli","urlProfile":"http://www.imdb.com/name/nm3804582","urlPhoto":"","biography":{"bio":"Luca Bovelli is an actor, known for Donner Pass (2011), El cielo hecho pedazos (2011) and For All That We Are (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3804582","name":"Luca Bovelli","idIMDB":"nm3804582"},"actorId":"nm3804582","character":"Boy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Pierpoint","urlProfile":"http://www.imdb.com/name/nm0682597","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5OTMwNDMzNl5BMl5BanBnXkFtZTcwMTY0NDU4OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1950","placeOfBirth":" Los Angeles, California, USA","bio":"Eric Pierpoint is noted for the Alien Nation (1989) television series, Liar Liar (1997), The World's Fastest Indian (2005), Forever Young (1992), Holes (2003), Transformers: Revenge of the Fallen (2009), and Sex Tax: Based on a True Story (2010). He starred in TV series Hot Pursuit (1984), Fame (1982), and Farmed And Dangerous. He recurred on Parks And Recreation, Big Love (2006), Hart Of Dixie, Star Trek: Enterprise, and Hill Street Blues (1981). Theater productions include The Lion In Winter, A Streetcar Named Desire, Richard III, MacBeth, A Man For All Seasons, and Panache. He is the son of former CBS White House reporter, Robert Pierpoint. He graduated from Walt Whitman High School in 1969, received his Bachelor's degree from the University of Redlands in 1973, and his MFA from The Catholic University of America. His children's novel, The Last Ride Of Caleb O'Toole, received the 2013 Reading the West Book Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5OTMwNDMzNl5BMl5BanBnXkFtZTcwMTY0NDU4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0682597","name":"Eric Pierpoint","idIMDB":"nm0682597"},"actorId":"nm0682597","character":"George Donner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Colley Bailey","urlProfile":"http://www.imdb.com/name/nm3381793","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4OTgyNTAzMV5BMl5BanBnXkFtZTgwOTI3NjU2MDI@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Colley Bailey was born in Mountain Home, Arkansas and grew up in the Ozarks. He caught the acting bug in a high school production of \"Rebel Without a Cause\" playing the character made famous by James Dean. While still in high school, he was signed by a Little Rock talent agent. Colley attended the University of Central Arkansas where he completed his degree in Theater in 2007. He made the most of his acting opportunities during these years by appearing in commercials, short films, and numerous college theatrical productions. In 2009, Colley moved to Los Angeles and met success filming \"Donner Pass\" in early 2010 and \"Madison County\" later the same year. Colley tried his hand at writing in college and in 2011 had several scripts in various stages of development.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4OTgyNTAzMV5BMl5BanBnXkFtZTgwOTI3NjU2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3381793","name":"Colley Bailey","idIMDB":"nm3381793"},"actorId":"nm3381793","character":"Mike","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Erik Stocklin","urlProfile":"http://www.imdb.com/name/nm3857399","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDY3NDUyMF5BMl5BanBnXkFtZTgwMjczMjkzOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Erik Stocklin is an actor and composer, known for Haters Back Off! (2016), Stalker (2014) and Mistresses (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDY3NDUyMF5BMl5BanBnXkFtZTgwMjczMjkzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3857399","name":"Erik Stocklin","idIMDB":"nm3857399"},"actorId":"nm3857399","character":"Thomas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adelaide Kane","urlProfile":"http://www.imdb.com/name/nm2560043","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMDAyNzY2Nl5BMl5BanBnXkFtZTgwNzcyNTc5NzE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1990","placeOfBirth":" Claremont, Western Australia, Australia","height":"5' 4\" (1.63 m)","bio":"Born in Western Australia in 1990, Adelaide Kane had been acting since she was 6 and got her first major role, in 2006, when she won the role of \"Lolly Allen\" on Les voisins (1985). She entered a Dolly Magazine Competition and won the role in late 2006. When she got the role, she and her family had to move from Perth to Melbourne, where \"Neighbours\" is filmed, she was in Year 11 at the time. In her free time, she enjoys singing and singing lessons. She is good friends with Caitlin Stasey, Eliza Taylor, and Sianoa Smit-McPhee, who are also on the show.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMDAyNzY2Nl5BMl5BanBnXkFtZTgwNzcyNTc5NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2560043","name":"Adelaide Kane","nicknames":["Addie"],"idIMDB":"nm2560043"},"actorId":"nm2560043","character":"Nicole","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Desiree Hall","urlProfile":"http://www.imdb.com/name/nm1869418","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0OTQ3NDc1OV5BMl5BanBnXkFtZTcwMTU4NDkwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Desiree Hall is an actress and producer, known for Best Night Ever (2013), Donner Pass (2011) and Teen Wolf (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0OTQ3NDc1OV5BMl5BanBnXkFtZTcwMTU4NDkwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1869418","name":"Desiree Hall","idIMDB":"nm1869418"},"actorId":"nm1869418","character":"Kayley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Desiray Ortiz","urlProfile":"http://www.imdb.com/name/nm4099425","urlPhoto":"","biography":{"dateOfBirth":"11 February 1991","placeOfBirth":" Los Angeles County, California, USA","birthName":"Desiray Monique Ortiz","height":"5' 3½\" (1.61 m)","bio":"Desiray Ortiz was born on February 11, 1991 in Los Angeles County, California, USA as Desiray Monique Ortiz. She is an actress, known for Donner Pass (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4099425","name":"Desiray Ortiz","nicknames":["Des","Ray","Chickadee","Desi"],"idIMDB":"nm4099425"},"actorId":"nm4099425","character":"Waitress","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin P. Kearns","urlProfile":"http://www.imdb.com/name/nm1026093","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzODI4NTQ1MF5BMl5BanBnXkFtZTcwMTQzODAzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Kevin P Kearns","bio":"Kevin P. Kearns was born as Kevin P Kearns. He is an actor, known for Frost/Nixon (2008), Battleship (2012) and Black Eyed Dog (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzODI4NTQ1MF5BMl5BanBnXkFtZTcwMTQzODAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1026093","name":"Kevin P. Kearns","idIMDB":"nm1026093"},"actorId":"nm1026093","character":"Carter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrew Reyes","urlProfile":"http://www.imdb.com/name/nm3787883","urlPhoto":"","biography":{"dateOfBirth":"18 March 1981","placeOfBirth":" Corpus Christi, Texas, USA","birthName":"David Andrew Reyes","height":"5' 7½\" (1.71 m)","bio":"Andrew Reyes grew up in Corpus Christi, Texas graduating with top Honors and the Texas Scholars Award before continuing his education at Texas State University studying English Literature and Education. Relocating to Austin,Texas in 2003 and working in business management for seven years, Andrew also spent his spare time taking acting lessons with David Yeakle of Tongue and Groove Productions and working as an extra on films such as \"The Ex-Terminators\", \"Stoner\", \"Friday Night Lights\" and Richard Linklater's \"Untitled 12 year Project\" In 2009, Andrew focused his energy on the other side of the camera and directed the Horror Comedy short \"Absinthe Makes the Dead Live Longer!\" garnering him the Audience Choice Award at \"The Dismemeber the Alamo\" Film Festival and a featured screening in the United Kingdom based Zombie Festival \"Terror4Fun\". In 2010, Andrew, along with Jason Matthews and Justin Warren, formed Art Asylum LLC; a production company focusing on edgy and FX driven content.Through Art Asylum, Andrew has produced three commercials for Texas injury lawyer Mario Davilla, the first of which will air during Oprah's fair well show. Andrew also produced \"Blackout\" an art film horror short which acts as a prequel to \"Violet\" a feature film in developmental stages. In 2012, Andrew relocated to Los Angeles, and continues to work as a Production Manager and AD in feature films, television and animation. A member of the Loyal Order of the Moose Burbank, CA #652 since July 1st 2011.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3787883","name":"Andrew Reyes","nicknames":["Drew"],"idIMDB":"nm3787883"},"actorId":"nm3787883","character":"Gullible SUV driver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dominic DeVore","urlProfile":"http://www.imdb.com/name/nm2161137","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDc3MTQ4OV5BMl5BanBnXkFtZTgwNDE3MjUyMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 1½\" (1.87 m)","bio":"Dominic DeVore is an actor and editor, known for Channeling (2013), Forev (2013) and Donner Pass (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDc3MTQ4OV5BMl5BanBnXkFtZTgwNDE3MjUyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2161137","name":"Dominic DeVore","idIMDB":"nm2161137"},"actorId":"nm2161137","character":"Derek","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brandon Morales","urlProfile":"http://www.imdb.com/name/nm3863881","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwNTY3MTMyOV5BMl5BanBnXkFtZTgwOTEyMzU3OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Brandon Morales is an actor, known for American Crime Story (2016), Scandal (2012) and How to Get Away with Murder (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwNTY3MTMyOV5BMl5BanBnXkFtZTgwOTEyMzU3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3863881","name":"Brandon Morales","idIMDB":"nm3863881"},"actorId":"nm3863881","character":"A.J.","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1626139","urlIMDB":"http://www.imdb.com/title/tt1626139","business":{"budget":{"money":"$800,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min) (USA)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":["Super 16"],"printedFilmFormat":null},"rating":"4.5","filmingLocations":[{"location":"Big Bear Lake, Big Bear Valley, San Bernardino National Forest, California, USA"}],"rated":"R","awards":[],"votes":"2,047","type":"Movie","companyCreditsSimple":[],"keywords":{"keywords":["donner pass","cannibal","slasher","blood","snow","hot tub","female nudity","donner party","curse","f rated"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:46:40"}}