{"data":{"movies":[{"title":"Green Lantern: Emerald Knights","originalTitle":"","year":"2011","releaseDate":"20110607","directors":[{"name":"Christopher Berkeley","id":"nm0075331"},{"name":"Lauren Montgomery","id":"nm2304017"}],"writers":[{"name":"Michael Green","id":"nm0338169"},{"name":"Marc Guggenheim","id":"nm0973233"}],"runtime":"84 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNzU4Nzk0Nl5BMl5BanBnXkFtZTcwMTc2MjQ4NA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Action","Adventure","Fantasy","Sci-Fi"],"plot":"On Oa, the headquarters planet of the intergalactic police force, the Green Lantern Corps, the Guardians of the Universe see alarming evidence that the feared villain, Krona, is coming to destroy the planet. While the Guardians move to evacuate, Green Lantern Hal Jordan helps the unsure new recruit, Arisia, by telling her several stories of fellow Lanterns and the challenges they faced. Through him, we see the adventures of Avra the first Lantern, Princess Laira, Kilowog, the unsociable Mogo and Jordan's immediate predecessor, Abin Sur. When Krona arrives, those stories prove more valuable than anyone expects as Arisia draws a special inspiration from them.","simplePlot":"As the home planet of the Green Lantern Corps faces a battle with an ancient enemy, Hal Jordan prepares new recruit Arisia for the coming conflict by relating stories of the first Green Lantern and several of Hal's comrades.","actors":[{"actorName":"Nathan Fillion","urlProfile":"http://www.imdb.com/name/nm0277213","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxODM3ODY2Nl5BMl5BanBnXkFtZTgwMzAyMjU2NzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 March 1971","placeOfBirth":" Edmonton, Alberta, Canada","birthName":"Nathan Craig Fillion","height":"6' 1½\" (1.87 m)","bio":"Nathan Fillion was born on 27 March 1971, in Edmonton, Alberta, Canada. He is the younger son of Cookie and Bob Fillion, both retired English teachers. He has an older brother, Jeff. In Canada, he attended Holy Trinity Catholic High School, Concordia University College of Alberta and University of Alberta. Before moving to New York City in 1994, he participated in improv theatre, including Theatresports with Rapid Fire Theatre and improvised soap opera Die-Nasty. He also appeared in a TV Movie Ordeal in the Arctic (1993) starring Richard Chamberlain and in Double enquête à Hamelin (1994). Fillion's first regular role was on a daytime soap opera, One Life to Live (1968), as Joey Buchanan, for which role he was nominated in 1996 for a Daytime Emmy Award. He left the series after three years in 1997. During the late 1990's, he appeared in small roles in the films Saving Private Ryan (1998) and Blast from the Past (1999). Fillion also guest starred on Total Security: Das Bootie, Maggie Winters: Mama's Got a Brand New Bag (1998) and Au-delà du réel - l'aventure continue: Star Crossed (1999). His biggest break by then happened in 1998, when he was cast as Johnny Donnelly on the 2nd season of Two Guys, a Girl and a Pizza Place (1998) opposite Traylor Howard, Ryan Reynolds, Richard Ruccolo and Suzanne Cryer. He starred on the show for 60 episodes. After \"Two Guys\" ended in 2001, Fillion gained critical acclaim and a large cult of fans when he starred as Captain Malcolm Reynolds on the Joss Whedon's Firefly (2002). Unfortunately the show was prematurely canceled in late 2002. He also guest starred on several episodes of two short lived TV shows, Pasadena (2001), as Rev. Glenn Collins and Miss Match (2003), as Adam Logan. In 2003, Whedon gave Fillion another chance to display his range when he cast Fillion as the twisted preacher Caleb, a villain, in the final season of Buffy the Vampire Slayer (1997). Before and after \"Firefly\", Fillion appeared in many movies, Dracula 2000 (2000), Alligator Point (2003), Water's Edge (2003), If Dad Only Knew (2004) and Hollywood Division (2004). Whedon vowed to resurrect \"Firefly\" in some way, and Fillion played Captain Reynolds again in the feature-film Serenity (2005). Fillion followed this film with more big screen leading roles, in the horror-comedy Horribilis (2006), in White Noise 2: The Light (2007), in the indie hit Waitress (2007) opposite Keri Russell and in Trucker (2008). He also continued to be a force in television, starring in the short-lived Fox-TV series Drive (2007) and appearing on a recurring role as Dr. Adam Mayfair on the 4th season of ABC's Desperate Housewives (2004), opposite Dana Delany. He also appeared on Lost: I Do (2006) and was a voice actor on many video games (e.g. Halo 3 (2007)). In 2008, he took his first singing part (and cemented his cult appeal) as Captain Hammer in Whedon's musical Internet smash Dr. Horrible's Sing-Along Blog (2008), with Neil Patrick Harris, Felicia Day and Simon Helberg. In 2009, he was cast as the title character Richard Castle in ABC's hit television series, Castle (2009). The show has aired more than 160 episodes and Nathan Fillion has won four People's Choice Awards for Favorite Dramatic TV Actor, as of 2016. Besides starring on \"Castle\", he has appeared in many movies, in Super (2010) as The Holy Avenger, in Joss Whedon's Much Ado About Nothing (2012) as Dogberry, the incompetent chief of security, in Percy Jackson: Sea of Monsters (2013) as Hermes and in Thrilling Adventure Hour Live (2015). His credits as a voice-actor are numerous: on The Venture Bros.: Bright Lights, Dean City (2010) as Brown Widow, in Wonder Woman (2009) as Steve Trevor, in Green Lantern: Emerald Knights (2011), Justice League: Doom (2012), Justice League: The Flashpoint Paradox (2013) and Justice League: Throne of Atlantis (2015) as Hal Jordan/Green Lantern, in Robot Chicken: DC Comics Special (2012) as Green Lantern/Mr. Freeze, on American Dad! (2005), in Pixar's Monsters University (2013) as Johnny, in Guardians of the Galaxy (2014) as Monstrous Inmate and on Gravity Falls (2012) as Preston Northwest. He also voices the lead, Shojun in the animated movie, Yamasong: March of the Hollows (2017). He has also continued voicing characters in video games, such as in Destiny (2014) and in Halo 5: Guardians (2015). He has also guest starred on The Daly Show: The Daly Superheroes (2012) as himself, on Community (2009) as Bob Waite, on The Big Bang Theory: The Comic Book Store Regeneration (2015) as himself, on Kroll Show: Twins (2015) as Mountie McMinniman, on Con Man (2015) as Jack Moore and on Drunk History: Space (2015) as Wernher Von Braun. He also narrated the documentary, Highway of Tears (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxODM3ODY2Nl5BMl5BanBnXkFtZTgwMzAyMjU2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0277213","name":"Nathan Fillion","idIMDB":"nm0277213"},"actorId":"nm0277213","character":"Hal Jordan / Green Lantern","urlCharacter":"http://www.imdb.com/character/ch0190099","main":true},{"actorName":"Jason Isaacs","urlProfile":"http://www.imdb.com/name/nm0005042","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NTI5MzE2OF5BMl5BanBnXkFtZTgwODYyNjM4MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1963","placeOfBirth":" Liverpool, Merseyside, England, UK","height":"5' 11\" (1.8 m)","bio":"Jason Isaacs was born in Liverpool, the third of four children of Sheila (née Nathan) and Eric Isaacs. His parents were both from Jewish families (from Eastern Europe). He studied law at Bristol University and graduated in 1985 with a degree in law but decided to study acting. While at Bristol University, he directed and/or appeared in over 20 productions. He then attended the Central School of Speech and Drama and graduated in 1989. Jason's notable roles include Col. William Tavington in The Patriot (2000), Lucius Malfoy in the Harry Potter films, Mr. Darling/Captain Hook in Peter Pan (2003), and Maurice in Good (2008). In 2014, he will appear with Brad Pitt, Shia LaBeouf, Logan Lerman, and Jon Bernthal in the World War II-set film Fury (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NTI5MzE2OF5BMl5BanBnXkFtZTgwODYyNjM4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005042","name":"Jason Isaacs","idIMDB":"nm0005042"},"actorId":"nm0005042","character":"Sinestro","urlCharacter":"http://www.imdb.com/character/ch0000236","main":true},{"actorName":"Elisabeth Moss","urlProfile":"http://www.imdb.com/name/nm0005253","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTMwMDg1MDkyNV5BMl5BanBnXkFtZTcwNzEwMzg1Nw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 July 1982","placeOfBirth":" Los Angeles, California, USA","birthName":"Elisabeth Singleton Moss","height":"5' 3\" (1.6 m)","bio":"Elisabeth Moss was born on July 24, 1982 in Los Angeles, California, USA as Elisabeth Singleton Moss. She is an actress, known for Mad Men (2007), Girl, Interrupted (1999) and The One I Love (2014). She was previously married to Fred Armisen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTMwMDg1MDkyNV5BMl5BanBnXkFtZTcwNzEwMzg1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005253","name":"Elisabeth Moss","idIMDB":"nm0005253"},"actorId":"nm0005253","character":"Arisia","urlCharacter":"http://www.imdb.com/character/ch0154020","main":true},{"actorName":"Henry Rollins","urlProfile":"http://www.imdb.com/name/nm0738433","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NjIxNjE3OF5BMl5BanBnXkFtZTgwMDgwNTcwMTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1961","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Henry Lawrence Garfield","height":"5' 9½\" (1.77 m)","bio":"In 1980 Henry Rollins was a teenager living in Arlington, Virginia, just over the river from Washington, DC. He worked as the shift manager for a Haagen-Dazs ice cream shop near Georgetown University, and was a huge fan of a Southern California punk rock band called Black Flag. One day he and his friend Ian MacKaye (who later formed Fugazi) drove to New York City to see Black Flag play at the Peppermint Lounge. They played later at a small club down the street, and Henry jumped on stage and took the mike for a song. A few days later he was called back to New York to audition for the band. Henry spent the next six years riding in vans, sleeping in the back of trucks, getting beaten and mauled on stage and fronting the baddest, most primal rock-and-roll band in the history of the world. Since 1986 Henry has enjoyed a more pleasant lifestyle and career as a singer. He is a published (and often lucid) poet. His band, Rollins Band, was a highlight of the Woodstock '94 concert. His autobiography, \"Get In The Van\", is available in print and as a self-narrated compact disc. He has written several articles for Details, an American magazine.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NjIxNjE3OF5BMl5BanBnXkFtZTgwMDgwNTcwMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0738433","name":"Henry Rollins","idIMDB":"nm0738433"},"actorId":"nm0738433","character":"Kilowog","urlCharacter":"http://www.imdb.com/character/ch0049944","main":true},{"actorName":"Arnold Vosloo","urlProfile":"http://www.imdb.com/name/nm0903677","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NTI3NTA1N15BMl5BanBnXkFtZTYwMzA0NTIz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1962","placeOfBirth":" Pretoria, South Africa","height":"6' 2\" (1.88 m)","bio":"Arnold Vosloo was born in Pretoria, South Africa, to stage actor parents, Johanna Petronella Vorster and Johannes J. Daniel Vosloo. He is an Afrikaaner (of mostly Dutch, as well as German, Swiss-German, Danish, and French, descent). Vosloo quickly established a fine reputation as an actor in his native South Africa, winning several awards there for his theater work, including \"More Is 'n Lang Dag\", \"Don Juan\" and \"Torch Song Trilogy\". A regular performer with South Africa's State Theatre, he also played leading roles in \"Savages\", \"Twelfth Night\" and \"Hamlet\". His film career in the RSA brought him The Dalro Award as Best Actor for both Boetie Gaan Border Toe! (1984) and Circles in a Forest (1989), and the Dalro Best Actor Nomination for the film version of More Is 'n Lang Dag. After moving to the United States, he appeared in \"Born In The R.S.A.\" at Chicago's Northlight Theatre and starred with Al Pacino and Sheryl Lee in a Circle In The Square Uptown production of \"Salome\" (his character's name was \"Jokanaan\"). The latter running for a total of 18 performances only between June 28, 1992 and July 2, 1992. Vosloo's film credits include Ridley Scott's 1492: Christophe Colomb (1992), John Woo's Hard Target (1993) (produced by James Jacks and Sean Daniel), Darkman II: The Return of Durant (1995) and Darkman III: Die Darkman Die (1996), both directed by Bradford May, and George Miller's Zeus and Roxanne (1997). Equally at home on the television screen, Vosloo appeared in American Gothic (1995) for Fox and Nash Bridges (1996) for CBS.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NTI3NTA1N15BMl5BanBnXkFtZTYwMzA0NTIz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0903677","name":"Arnold Vosloo","nicknames":["Arny","Boetie or Boeta"],"idIMDB":"nm0903677"},"actorId":"nm0903677","character":"Abin Sur","urlCharacter":"http://www.imdb.com/character/ch0057786","main":true},{"actorName":"Tony Amendola","urlProfile":"http://www.imdb.com/name/nm0024593","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA3NzQwNDA5OV5BMl5BanBnXkFtZTYwMTY0MTI3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1951","placeOfBirth":" New Haven, Connecticut, USA","height":"5' 10\" (1.78 m)","bio":"Tony was born and raised in New Haven, Connecticut. He attended Southern Connecticut State University and graduated in 1974. While an undergraduate student at Southern Connecticut State University, he performed as the leading man in several musicals at Sacred Heart Academy, an all-girls college preparatory high school in Hamden, Connecticut. After that, he went on to attend Temple University in Philadelphia, graduating in 1977 with a Master of Fine Arts Degree. Tony taught theater classes at Southern Connecticut State University, including a course in Stage Speaking, during the Spring semester of 1978. In 1978, he decided to make the move to Los Angeles to find work in film and television. Though this move was originally meant to be temporary, he lives there with his wife to this day. Tony is a theater-trained actor, and he has a long history of stage performances. Some of these include: \"American Buffalo\" as \"Teach\"; \"Othello\" as \"Iago\"; \"Filumena\" as \"Domenico\"; and \"Taming of the Shrew\" as \"Petruchio\". He speaks Spanish and Italian. Some of his interests include: Italian cooking, museums, art galleries and yoga. His favorite play is \"Taming of the Shrew\" and his favorite Stargate SG-1 (1997) episode is \"Threshold\". Tony's favorite charities are: Doctor's Without Borders, Habitat for Humanity, and the American Red Cross.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA3NzQwNDA5OV5BMl5BanBnXkFtZTYwMTY0MTI3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0024593","name":"Tony Amendola","idIMDB":"nm0024593"},"actorId":"nm0024593","character":"Kentor / Appa Ali Apsa","urlCharacter":"http://www.imdb.com/character/ch0244991","main":true},{"actorName":"Steve Blum","urlProfile":"http://www.imdb.com/name/nm0089710","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIzMzk3ODEwN15BMl5BanBnXkFtZTgwNzY3MDg5MDE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1960","placeOfBirth":" Santa Monica, California, USA","birthName":"Steven Jay Blum","height":"5' 10\" (1.78 m)","bio":"Steve Blum was born on April 29, 1960 in Santa Monica, California, USA as Steven Jay Blum. He is an actor and writer, known for Digimon: Digital Monsters (1999), Batman: Arkham City (2011) and Star Wars Rebels (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIzMzk3ODEwN15BMl5BanBnXkFtZTgwNzY3MDg5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0089710","name":"Steve Blum","idIMDB":"nm0089710"},"actorId":"nm0089710","character":"Kloba Vud / Palaqua / Ranakar / G'Hu","urlCharacter":"http://www.imdb.com/character/ch0250251","main":true},{"actorName":"Grey DeLisle","urlProfile":"http://www.imdb.com/name/nm0217221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg2MTQxOTUyMl5BMl5BanBnXkFtZTcwMTgxNTExOA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1973","placeOfBirth":" Fort Ord, California, USA","birthName":"Erin Grey Van Oosbree","height":"5' 3\" (1.6 m)","bio":"Grey DeLisle was born in Fort Ord, California. She is a singer and well-known voice actress. She was raised by her grandmother through her difficult childhood because her mother was a drug addict. Her grandmother was a singer and performed often with Tito Puente. Grey was highly interested in goth bands, mostly The Cure. Her mother, however, born-again Pentecostal, strictly forbade Grey to listen to goth music. In her late teens, she sang gospel songs. Thanks to that, she became interested in stand-up comedy and started to perform it. She also had a talent for voice impressions, which led to voice acting. DeLisle started in a few animation series and, since then, has been featured in numerous video games. She is best-known for her sinister voice of the evil sister \"Vicky\" in the Nickelodeon TV series, \"Fairly OddParents\" (2001-2013), as well as the equally evil \"Mandy\" in the Cartoon Network TV show, \"The Grim Adventures of Billy and Mandy\" (2001 - 2007). She voiced evil, cold \"Mandy\" again in two more films about Billy and Mandy, \"Billy and Mandy Big Boogie Adventure\" (2007) and \"The Grim Adventures of KND\" (2007), opposite'Richard Steven Horvitz' (Billy) and Greg Eagles (Grim). In 2002, Grey DeLisle married musician Murry Hammond, the bassist for the band, Old 97's. Their first child, Jefferson Texas Hammond, was born in 2007, in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg2MTQxOTUyMl5BMl5BanBnXkFtZTcwMTgxNTExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0217221","name":"Grey DeLisle","idIMDB":"nm0217221"},"actorId":"nm0217221","character":"Ree'Yu / Ardakian Trawl / Boodikka","urlCharacter":"http://www.imdb.com/character/ch0313165","main":true},{"actorName":"Kelly Hu","urlProfile":"http://www.imdb.com/name/nm0005026","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4ODQ5NDMzOV5BMl5BanBnXkFtZTcwMjEzODA3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1968","placeOfBirth":" Honolulu, Hawaii, USA","birthName":"Kelly Ann Hu","height":"5' 5\" (1.65 m)","bio":"On February 13th, 1968, a girl of Chinese, English, and Hawaiian ancestry was born in Honolulu, Hawaii. Her father, Herbert, was a salesman and her mother, Juanita, worked many odd jobs to help support the family. She has one older brother, Glenn. She is a former Miss Teen USA, and modeled in Japan and Italy for several months before deciding to relocate to L.A. and try her hand at show business. She got her break on TV's Growing Pains (1985) in 1987 and never looked back.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4ODQ5NDMzOV5BMl5BanBnXkFtZTcwMjEzODA3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005026","name":"Kelly Hu","idIMDB":"nm0005026"},"actorId":"nm0005026","character":"Laira","urlCharacter":"http://www.imdb.com/character/ch0249572","main":true},{"actorName":"Michael Jackson","urlProfile":"http://www.imdb.com/name/nm0413859","urlPhoto":"","biography":{"dateOfBirth":"16 April 1934","placeOfBirth":" London, England, UK","bio":"Michael Jackson was born on April 16, 1934 in London, England. He is an actor, known for Batman: The Dark Knight Returns, Part 1 (2012), Batman: The Dark Knight Returns, Part 2 (2013) and Moby Dick (1998). He has been married to Alana Ladd since October 16, 1965. They have three children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0413859","name":"Michael Jackson","idIMDB":"nm0413859"},"actorId":"nm0413859","character":"Ganthet","urlCharacter":"http://www.imdb.com/character/ch0122182","main":true},{"actorName":"Peter Jessop","urlProfile":"http://www.imdb.com/name/nm0422247","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMDYyMzY1OV5BMl5BanBnXkFtZTcwMDg3NzI5OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1964","placeOfBirth":" Natick, Massachusetts, USA","bio":"Peter Jessop was born on June 29, 1964 in Natick, Massachusetts, USA. He is known for his work on Fallout 4 (2015), Batman: Assault on Arkham (2014) and Justice League: The Flashpoint Paradox (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMDYyMzY1OV5BMl5BanBnXkFtZTcwMDg3NzI5OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0422247","name":"Peter Jessop","idIMDB":"nm0422247"},"actorId":"nm0422247","character":"Salaak","urlCharacter":"http://www.imdb.com/character/ch0250784","main":true},{"actorName":"David Kaufman","urlProfile":"http://www.imdb.com/name/nm0442120","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3ODY1NjI4NV5BMl5BanBnXkFtZTgwODEyMjgzMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1961","placeOfBirth":" St. Louis, Missouri, USA","bio":"David Kaufman was born on July 23, 1961 in St. Louis, Missouri, USA. He is an actor, known for Down to Earth (1984), Danny Phantom (2004) and Pearl Harbor (2001). He has been married to Lisa Picotte since June 30, 1990. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3ODY1NjI4NV5BMl5BanBnXkFtZTgwODEyMjgzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0442120","name":"David Kaufman","idIMDB":"nm0442120"},"actorId":"nm0442120","character":"Rubyn","urlCharacter":"http://www.imdb.com/character/ch0313167","main":true},{"actorName":"Sunil Malhotra","urlProfile":"http://www.imdb.com/name/nm0539503","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMzMwOTMxOF5BMl5BanBnXkFtZTgwMDEyMTE4NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1975","placeOfBirth":"","bio":"Sunil Malhotra was born on October 20, 1975. He is known for his work on NCIS: New Orleans (2014), Fair Game (2010) and Maron (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMzMwOTMxOF5BMl5BanBnXkFtZTgwMDEyMTE4NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0539503","name":"Sunil Malhotra","idIMDB":"nm0539503"},"actorId":"nm0539503","character":"Bolphunga's Ship","urlCharacter":"http://www.imdb.com/character/ch0313168","main":true},{"actorName":"Roddy Piper","urlProfile":"http://www.imdb.com/name/nm0684929","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0OTYxMzc3NF5BMl5BanBnXkFtZTgwNjcwMTM0NjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1954","placeOfBirth":" Saskatoon, Saskatchewan, Canada","birthName":"Roderick George Toombs","height":"6' (1.83 m)","bio":"Roddy Piper was born Roderick George Toombs on April 17, 1954 in Saskatoon, Saskatchewan, Canada. He was a pro wrestler from 1973-1987 in the NWA, Pacific Northwest, California. He was a longtime mainstay in the WWF, and was one of the biggest \"bad guys\" in the WWF during the early '80s, before becoming a fan favorite in the late '80s. He became infamous for his mouth as much as his skills in the ring. He hosted Pipers Pit, which saluted the bad guys of professional wrestling, the most famous of which involved him smashing Jimmy Superfly Snuka over the head with a coconut. He was wrestling's most popular villain because of his feud with Hulk Hogan that culminated at Wrestlemania I. He went into semi-retirement after Wrestlemania III, when he beat and shaved the late Adrian Adonis. He continued to wrestle into the '90s, but spent much of his time doing color commentary for WWF TV. In January 1992, he won the WWF Intercontinental Title from \"The Mountie\", the only title he would ever hold in his storied WWF career. After losing the title three months later, he left the WWF, and only made the occasional appearance in the ring over the next few years. In 1995, he had a stint as the WWF's interim president. He later resurfaced in WCW during the late '90s to continue his feud with \"Hollywood\" Hulk Hogan, until the company's demise in 2001. Roddy Piper appeared in many action films. He died of a heart attack on July 31, 2015, in Hollywood, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0OTYxMzc3NF5BMl5BanBnXkFtZTgwNjcwMTM0NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0684929","name":"Roddy Piper","nicknames":["The Rowdy Scot","Hot Rod","The Hot Scot","Rowdy Roddy Piper"],"idIMDB":"nm0684929"},"actorId":"nm0684929","character":"Bolphunga","urlCharacter":"http://www.imdb.com/character/ch0249573","main":true},{"actorName":"Andrea Romano","urlProfile":"http://www.imdb.com/name/nm0738849","urlPhoto":"","biography":{"dateOfBirth":"6 December 1955","placeOfBirth":" Long Island, New York, USA","height":"5' (1.52 m)","bio":"Andrea Romano has been casting and directing voices for over 31 years. Her credits include a 5 1/2 year stint as casting director at Hanna Barbera, directing Disney's DuckTales (1987), Chip 'n' Dale Rescue Rangers (1989) and some seasons of The New Adventures of Winnie the Pooh (1988), many of Universal's Land Before Time home videos, Warner Bros. Steven Spielberg Presents Tiny Toon Adventures (1990), Animaniacs (1993), Pinky and the Brain (1995), as well as Batman: The Animated Series (1992), Superman (1996), Batman Beyond (1999), Teen Titans (2003), and Justice League (2001). Also for Warner Bros., Andrea directed 23 direct to video films in conjunction with DC Comics and Warner Home Video. Her other credits include 3 seasons of \"The Boondocks (2005)\" for Sony, and \"Avatar: The Last Airbender (2005)\", The Legend of Korra (2012), El Tigre: The Adventures of Manny Rivera (2007), and SpongeBob SquarePants (1999) for Nickelodeon. She currently directing \"Teenage Mutant Ninja Turtles (2012)\", \"Turbo FAST (2013)\", \"The Adventures of Puss in Boots (2015)\" and Voltron (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0738849","name":"Andrea Romano","idIMDB":"nm0738849"},"actorId":"nm0738849","character":"Abin Sur's Ring / Deegan's Ring","urlCharacter":"http://www.imdb.com/character/ch0313170","main":true}],"seasons":[],"idIMDB":"tt1683043","urlIMDB":"http://www.imdb.com/title/tt1683043","business":{"budget":{"money":"$3,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"©2011 Warner Bros. Entertainment Inc."},"technical":{"runtime":["1 hr 24 min (84 min) (USA)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.8","filmingLocations":[],"rated":"PG","awards":[{"award":"Behind the Voice Actors Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated BTVA Special/DVD Voice Acting Award","categories":[{"category":"Best Male Vocal Performance in a TV Special/Direct-to-DVD Title or Theatrical Short","names":[{"name":"Nathan Fillion","id":"nm0277213","role":null}]}]}]}],"votes":"9,534","type":"Video","companyCreditsSimple":[{"idCompany":"co0283444","name":"DC Entertainment"},{"idCompany":"co0072876","name":"Warner Bros. Animation"},{"idCompany":"co0197868","name":"Warner Premiere"}],"keywords":{"keywords":["battle","supernatural power","magical ring","flying man","flying superhero","army","fight","fighting","warrior","superheroine","super villain","alien invasion","alien","mask","laser gun","origin of hero","combat","space war","fictional war","spaceship","rifle","explosion","space battle","martial arts","sword fight","sword","fictional planet","superhero","ring","dc comics","color in title","based on comic book","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:22:39"}}