{"data":{"movies":[{"title":"Batman: Year One","originalTitle":"","year":"2011","releaseDate":"20111018","directors":[{"name":"Sam Liu","id":"nm0515005"},{"name":"Lauren Montgomery","id":"nm2304017"}],"writers":[{"name":"Bob Kane","id":"nm0004170"},{"name":"Frank Miller","id":"nm0588340"}],"runtime":"64 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NjM0MDQxMF5BMl5BanBnXkFtZTgwNzQzOTAwNzE@._V1.jpg","countries":["USA"],"languages":["English","French","Spanish"],"genres":["Animation","Action","Crime","Drama","Thriller"],"plot":"Two men come to Gotham City: Bruce Wayne after years abroad feeding his lifelong obsession for justice and Jim Gordon after being too honest a cop with the wrong people elsewhere. After learning painful lessons about the city's corruption on its streets and police department respectively, this pair learn how to fight back their own way. With that, Gotham's evildoers from top to bottom are terrorized by the mysterious Batman and the equally heroic Gordon is assigned to catch him by comrades who both hate and fear him themselves. In the ensuing manhunt, both find much in common as the seeds of an unexpected friendship are laid with additional friends and rivals helping to start the legend.","simplePlot":"A wealthy playboy and a Chicago cop both return to Gotham City where their lives will intersect in unexpected ways.","actors":[{"actorName":"Bryan Cranston","urlProfile":"http://www.imdb.com/name/nm0186505","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2NjEyMTY4MTVeQTJeQWpwZ15BbWU3MDQ5NDAzNDc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 March 1956","placeOfBirth":" Hollywood, California, USA","birthName":"Bryan Lee Cranston","height":"5' 10½\" (1.79 m)","bio":"Bryan Cranston is an American actor, voice actor, screenwriter, director and producer. He is known for portraying Walter White on the AMC crime drama series Breaking Bad (2008), Hal on the Fox comedy series Malcolm in the Middle (2000), Doug Heffernan's neighbor Tim Sacksky on the CBS comedy series King of Queens, Dr. Tim Whatley on the NBC comedy series Seinfeld (1989), astronaut Buzz Aldrin in From the Earth to the Moon (1998), and Ted Mosby's boss on How I Met Your Mother (2005). His role in Breaking Bad earned him four Outstanding Lead Actor in a Drama Series Emmy Awards, five Golden Globe nominations and one win in 2014, nine Screen Actors Guild Awards nominations with four wins, and six Satellite Awards nominations with four wins. In June 2014, he won a Tony Award for Best Actor in a Play for his portrayal of Lyndon B. Johnson in the play All the Way on Broadway. He reprise his role in the television film of the same name, which debuted on HBO in May 2016. For the Trumbo (2015), he received widespread acclaim and was nominated for the Academy Award for Best Actor. Cranston also appeared in several acclaimed films, such as Saving Private Ryan (1998), Little Miss Sunshine (2006), Drive (2011), Argo (2012), and Godzilla (2014). Series for his role in Malcolm in the Middle. Bryan was born in Canoga Park, California, to Audrey Peggy Sell, a radio actress, and Joe Cranston (Joseph Louis Cranston), who was also an actor (and a boxer). His maternal grandparents were German, and his father was of Irish, Austrian-Jewish, and German descent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2NjEyMTY4MTVeQTJeQWpwZ15BbWU3MDQ5NDAzNDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0186505","name":"Bryan Cranston","idIMDB":"nm0186505"},"actorId":"nm0186505","character":"Jim Gordon","urlCharacter":"http://www.imdb.com/character/ch0000248","main":true},{"actorName":"Ben McKenzie","urlProfile":"http://www.imdb.com/name/nm1360270","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODcxMDI3NDQ1NF5BMl5BanBnXkFtZTgwNTY1Nzg3MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1978","placeOfBirth":" Austin, Texas, USA","birthName":"Benjamin McKenzie Schenkkan","height":"5' 8\" (1.73 m)","bio":"Ben McKenzie was born Benjamin McKenzie Schenkkan in Austin, Texas on September 12, 1978, to Mary Frances (Victory), a poet, and Pieter Meade Schenkkan, an attorney. His uncle is playwright Robert Schenkkan. Ben is of Dutch Jewish (from his paternal grandfather), English, and Scottish descent. He attended Austin High School, and played wide receiver and defensive back for the school's football team. From 1997-2001, he attended the University of Virginia, where he majored in Foreign Affairs and Economics. McKenzie got into acting during his first few years at the University of Virginia, where he appeared in \"Measure for Measure\" and \"Zoo Story.\" After graduation he moved to New York and appeared off-Broadway in \"Life is a Dream\" at the SoHo Rep. Additionally, he performed in numerous productions at the Williamstown Theatre Festival, including \"Street Scene\" and \"The Blue Bird.\" He relocated to Los Angeles in late 2001. His early TV appearances included roles on The District, JAG and Mad TV. In 2003, FOX premiered the television series The O.C., about affluent teenagers with stormy personal lives who reside in scenic Orange County, California. The show became an overnight success and it put McKenzie on the map as Ryan Atwood. While appearing in 'The O.C.', McKenzie made his feature film debut in 'Junebug' opposite Amy Adams. The film received high praise at the 2005 Sundance Film Festival. He also appeared in a pivotal role in the 2007 film '88 Minutes', which starred Al Pacino. McKenzie's first starring role in a feature film was in the 2008 indie release 'Johnny Got His Gun.' The movie premiered at the Paramount Theater in Austin, TX, McKenzie's hometown, prior to playing art houses where it garnered excellent reviews for his solo performance. April 9, 2009 NBC replaced the long-running series 'E.R.' after 15 years with a new cop drama, Southland, starring McKenzie as rookie police officer Ben Sherman. McKenzie is playing Jim Gordon in the Batman-themed series Gotham (2014), beginning in September 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODcxMDI3NDQ1NF5BMl5BanBnXkFtZTgwNTY1Nzg3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1360270","name":"Ben McKenzie","idIMDB":"nm1360270"},"actorId":"nm1360270","character":"Bruce Wayne / Batman","urlCharacter":"http://www.imdb.com/character/ch0188699","main":true},{"actorName":"Eliza Dushku","urlProfile":"http://www.imdb.com/name/nm0244630","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjM1OTc4MF5BMl5BanBnXkFtZTcwNDAzNzAzNA@@._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 December 1980","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Elizabeth Patricia Dushku","height":"5' 5\" (1.65 m)","bio":"Eliza Dushku was born in Boston, Massachusetts, to Judith (Rasmussen), a political science professor, and Philip R. Dushku, a teacher and administrator. Her father is Albanian and her mother is American (of Danish, Irish, English, and German descent). She was discovered at the end of a five-month search throughout the United States for the perfect girl to play the lead role of Alice opposite Juliette Lewis in the film That Night (1992). Since then, she has been in several films and has worked with actors such as Robert De Niro, Ellen Barkin, Leonardo DiCaprio, Paul Reiser, and Jim Belushi. Born in Boston on December 30, 1980, she has studied the piano, drums, and several types of dance (jazz, tap, and ballet). Her previous acting experience includes numerous amateur presentations at the Watertown Children's Theater where she was part of the company since she was in the first grade. In addition to acting, she is sometimes seen on stage at the Children's Theater signing for the deaf.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjM1OTc4MF5BMl5BanBnXkFtZTcwNDAzNzAzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0244630","name":"Eliza Dushku","nicknames":["Duck Shoot"],"idIMDB":"nm0244630"},"actorId":"nm0244630","character":"Selina","urlCharacter":"http://www.imdb.com/character/ch0238305","main":true},{"actorName":"Jon Polito","urlProfile":"http://www.imdb.com/name/nm0689237","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NjcwMjYzNF5BMl5BanBnXkFtZTYwNTczOTAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1950","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"John Polito","height":"5' 8\" (1.73 m)","bio":"A veteran of nearly 100 films, Jon Polito is most recognized for his work with The Coen brothers, as well as his many television appearances as a series regular and guest star. Notable motion picture roles include: Millers Crossing, Barton Fink, The Man Who Wasn't There, The Crow, Blankman, and The Freshman with Marlon Brando, and Big Eyes. Directors he has worked with include; Russel Mulcahy, Clint Eastwood, John McNaughton, Tom Hanks, Andrew Bergman, Michael Apted, Ridley Scott, and Tim Burton amongst others. On television, he starred as a series regular on Crime Story, Ohara, Hearts are Wild, The Chronical, and the critically acclaimed Homicide, Life on the Street. Notable guest star roles include the befuddled landlord Sylvio on Seinfeld, his only role as a woman - Rhonda, on The Chris Isaak Show, Danny Devito's brother Frank on It's Always Sunny in Philadelphia,, and Earl Chambers on Modern Family. He starred on Broadway with Faye Dunaway in The Curse Of An Aching Heart, and with Dustin Hoffman in the 1985 Tony award winning revival of Death Of A Salesman, which he also filmed for CBS. He received the Best Actor OBIE award for Off Broadway theatre in 1980. Other awards include the 2001 TELLY for animation voice over in The Dancing Pumpkin which was directed by his brother Jack Polito, The New York Independent Festival Award for Excellence in Acting, and the 2005 Cinequest Maverick Award for his lifetime body of work in Film and Television. In 2012 Jon received the Best Actor Award for the short film Anti-Muse from the Hollywood Reel Independent Film Festival. He credits his success to three people; his mentor Dominic Garvey, his only acting teacher Irene Baird, and to the late, great director, and friend, Paul Bettis. In addition, his inspiration to this day is New York theatre artist, Theodora Skipitares, who taught him film and design in university, and who has since never been far away from his life. She is 'Art' surviving.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NjcwMjYzNF5BMl5BanBnXkFtZTYwNTczOTAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0689237","name":"Jon Polito","idIMDB":"nm0689237"},"actorId":"nm0689237","character":"Commissioner Loeb","urlCharacter":"http://www.imdb.com/character/ch0049726","main":true},{"actorName":"Alex Rocco","urlProfile":"http://www.imdb.com/name/nm0733678","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MTMyNTkxOF5BMl5BanBnXkFtZTcwMDA4NTAzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 February 1936","placeOfBirth":" Cambridge, Massachusetts, USA","birthName":"Alessandro Federico Petricone Jr.","height":"6' (1.83 m)","bio":"Tough and volatile-looking Italianate character actor Alex Rocco was born in Boston and spent time training with such notable teachers as Leonard Nimoy and Jeff Corey to curb his thick Boston accent. In Hollywood from 1963, he worked as a bartender during the lean years and began his TV career in the late 60s. Slowly, he came to show sly, lethal menace in \"big city\" films and, in the next decade, notably played Las Vegas syndicate boss Moe Green who gets a bullet in the eye during the violent \"christening sequence\" of Mario Puzo's Oscar-winning The Godfather (1972). Finding a comfortable niche playing various swarthy-looking cronies, hoods and cops, he made a distinct impression when he switched to TV comedy and, in the late 80s, won an Emmy for The Famous Teddy Z (1989) during the 1989-1990 season. Other comedy series such as Sibs (1991) and The George Carlin Show (1994) came and went with over 400 TV appearances racked up so far. Recurring roles on The Simpsons (1989) and The Facts of Life (1979) (as Nancy McKeon's father) has kept him alive, as well. Rocco has appeared in two films helmed by his son, screenwriter and director Marc Rocco: Scenes from the Goldmine (1987) and Dream a Little Dream (1989). Other memorably flashy film roles include The Friends of Eddie Coyle (1973), Freebie and the Bean (1974), The Stunt Man (1980), Lady in White (1988), Get Shorty (1995) and Just Write (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MTMyNTkxOF5BMl5BanBnXkFtZTcwMDA4NTAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0733678","name":"Alex Rocco","nicknames":["Bobo"],"idIMDB":"nm0733678"},"actorId":"nm0733678","character":"Falcone","urlCharacter":"http://www.imdb.com/character/ch0000224","main":true},{"actorName":"Katee Sackhoff","urlProfile":"http://www.imdb.com/name/nm0755267","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExNjAyMDgxNzheQTJeQWpwZ15BbWU3MDc2OTY1NTk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1980","placeOfBirth":" Portland, Oregon, USA","birthName":"Kathryn Ann Sackhoff","height":"5' 6\" (1.68 m)","bio":"Katee Sackhoff was born on April 8, 1980 in Portland, Oregon, USA as Kathryn Ann Sackhoff. She is an actress and producer, known for Battlestar Galactica (2004), Longmire (2012) and Oculus (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExNjAyMDgxNzheQTJeQWpwZ15BbWU3MDc2OTY1NTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0755267","name":"Katee Sackhoff","idIMDB":"nm0755267"},"actorId":"nm0755267","character":"Detective Essen","urlCharacter":"http://www.imdb.com/character/ch0245692","main":true},{"actorName":"Sara Ballantine","urlProfile":"http://www.imdb.com/name/nm0050547","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MDk5NzExMF5BMl5BanBnXkFtZTgwMDA0NjQ1ODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"birthName":"Saratoga Ballantine","height":"5' 6½\" (1.69 m)","bio":"Sara Ballantine was born as Saratoga Ballantine. She is an actress and producer, known for Spider-Man (1994), The Nutty Professor (1996) and Batman: Year One (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MDk5NzExMF5BMl5BanBnXkFtZTgwMDA0NjQ1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0050547","name":"Sara Ballantine","idIMDB":"nm0050547"},"actorId":"nm0050547","character":"Skeevers' Attorney","urlCharacter":"http://www.imdb.com/character/ch0421374","main":true},{"actorName":"Jeff Bennett","urlProfile":"http://www.imdb.com/name/nm0071818","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTQwMjU2Ml5BMl5BanBnXkFtZTcwNDQwMzgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1962","placeOfBirth":" Houston, Texas, USA","birthName":"Jeffrey Glenn Bennett","bio":"Jeff Bennett was born on October 2, 1962 in Houston, Texas, USA as Jeffrey Glenn Bennett. He is an actor, known for Johnny Bravo (1997), James Bond Jr. (1991) and Enchanted (2007). He has been married to Susan E. Welby since October 8, 1988. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTQwMjU2Ml5BMl5BanBnXkFtZTcwNDQwMzgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0071818","name":"Jeff Bennett","idIMDB":"nm0071818"},"actorId":"nm0071818","character":"Alfred","urlCharacter":"http://www.imdb.com/character/ch0000204","main":true},{"actorName":"Steve Blum","urlProfile":"http://www.imdb.com/name/nm0089710","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIzMzk3ODEwN15BMl5BanBnXkFtZTgwNzY3MDg5MDE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1960","placeOfBirth":" Santa Monica, California, USA","birthName":"Steven Jay Blum","height":"5' 10\" (1.78 m)","bio":"Steve Blum was born on April 29, 1960 in Santa Monica, California, USA as Steven Jay Blum. He is an actor and writer, known for Digimon: Digital Monsters (1999), Batman: Arkham City (2011) and Star Wars Rebels (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIzMzk3ODEwN15BMl5BanBnXkFtZTgwNzY3MDg5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0089710","name":"Steve Blum","idIMDB":"nm0089710"},"actorId":"nm0089710","character":"Stan","urlCharacter":"http://www.imdb.com/character/ch0421375","main":true},{"actorName":"Roark Critchlow","urlProfile":"http://www.imdb.com/name/nm0188220","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDQ4MTgzMV5BMl5BanBnXkFtZTYwNzExMzgy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 May 1963","placeOfBirth":" Calgary, Alberta, Canada","birthName":"Roark Grant Critchlow","bio":"Roark Critchlow was born on May 11, 1963 in Calgary, Alberta, Canada as Roark Grant Critchlow. He is an actor and producer, known for Mr. Deeds (2002), Batman: Year One (2011) and Days of Our Lives (1965). He was previously married to Maria Brewer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDQ4MTgzMV5BMl5BanBnXkFtZTYwNzExMzgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0188220","name":"Roark Critchlow","idIMDB":"nm0188220"},"actorId":"nm0188220","character":"Hare Krishna","urlCharacter":"http://www.imdb.com/character/ch0421376","main":true},{"actorName":"Grey DeLisle","urlProfile":"http://www.imdb.com/name/nm0217221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg2MTQxOTUyMl5BMl5BanBnXkFtZTcwMTgxNTExOA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1973","placeOfBirth":" Fort Ord, California, USA","birthName":"Erin Grey Van Oosbree","height":"5' 3\" (1.6 m)","bio":"Grey DeLisle was born in Fort Ord, California. She is a singer and well-known voice actress. She was raised by her grandmother through her difficult childhood because her mother was a drug addict. Her grandmother was a singer and performed often with Tito Puente. Grey was highly interested in goth bands, mostly The Cure. Her mother, however, born-again Pentecostal, strictly forbade Grey to listen to goth music. In her late teens, she sang gospel songs. Thanks to that, she became interested in stand-up comedy and started to perform it. She also had a talent for voice impressions, which led to voice acting. DeLisle started in a few animation series and, since then, has been featured in numerous video games. She is best-known for her sinister voice of the evil sister \"Vicky\" in the Nickelodeon TV series, \"Fairly OddParents\" (2001-2013), as well as the equally evil \"Mandy\" in the Cartoon Network TV show, \"The Grim Adventures of Billy and Mandy\" (2001 - 2007). She voiced evil, cold \"Mandy\" again in two more films about Billy and Mandy, \"Billy and Mandy Big Boogie Adventure\" (2007) and \"The Grim Adventures of KND\" (2007), opposite'Richard Steven Horvitz' (Billy) and Greg Eagles (Grim). In 2002, Grey DeLisle married musician Murry Hammond, the bassist for the band, Old 97's. Their first child, Jefferson Texas Hammond, was born in 2007, in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg2MTQxOTUyMl5BMl5BanBnXkFtZTcwMTgxNTExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0217221","name":"Grey DeLisle","idIMDB":"nm0217221"},"actorId":"nm0217221","character":"Barbara Gordon / Vicki Vale","urlCharacter":"http://www.imdb.com/character/ch0038541","main":true},{"actorName":"Robin Atkin Downes","urlProfile":"http://www.imdb.com/name/nm0235960","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY1NTQ5MjU4NV5BMl5BanBnXkFtZTgwMzk4OTEyODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1976","placeOfBirth":" London, England, UK","height":"6' 2\" (1.88 m)","bio":"Robin Atkin Downes has an extensive and distinguished career in all aspects of the film and television industry, not only as an accomplished actor but also as a director, producer, voice-over artist, motion capture artist and music producer. Born and raised in the U.K., he was trained in the United States, with a Masters of Fine Arts degree from Temple University in Philadelphia. Robin's on-camera credits include series regular, recurring and guest starring roles on many shows, including Criminal Minds (2005), NCIS: Los Angeles (2009), Entourage (2004), CSI: Miami (2002), The Starter Wife (2008) and In Plain Sight (2008), among others. He has also worked on many features, including Pirates of the Caribbean: At World's End (2007), Transformers: Revenge of the Fallen (2009), How to Train Your Dragon (2010), and Mission: Impossible - Ghost Protocol (2011). His creature vocal effects can be heard in many films, including Aliens vs. Predator: Requiem (2007), The Tale of Despereaux (2008), X-Men Origins: Wolverine (2009), The Wolfman (2010), Immortals (2011), and Happy Feet 2 (2011). As a voice-over artist, Robin is one of the most prolific voice actors in Los Angeles and is proficient in over 60 dialects. He has acted in 100's of the top interactive titles in the industry, as well as work on commercials and animated shows. His current animated series work includes roles in Thundercats (2011), Star Wars: The Clone Wars (2008), The Avengers: Earth's Mightiest Heroes (2010), Regular Show in Space (2009), and Green Lantern: The Animated Series (2011), among many others. Robin performed the role of David in Katsuhiro Ôtomo's Steamboy (2004), with Patrick Stewart, Alfred Molina and Anna Paquin. Other interactive credits include Talbot in Uncharted 3: Drake's Deception (2011), Joseph Capelli in Resistance 3 (2011), Atoq Navarro in Uncharted: Drake's Fortune (2007), Sean Devlin in The Saboteur (2009), and Travis Touchdown in No More Heroes (2007). His vocal creature skills were used for several of the locust creatures in the Gears of War (2006) franchise as well as the characters Kim Minh, Niles and Chaps. In addition, he also voices promos and trailers for television and film. Robin's stage credits include performances in London, Prague and the United States, including \"John Wilkes Booth\" in the Philadelphia premiere of \"Assassins\", \"Cyranau De Bergerac\" at the famed Walnut Street Theatre, \"Skinlad/Brink\" in \"Road\", performed at The Wilma Theatre, and in Prague and the title role in \"Dracula\" at the Hermosa Playhouse.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY1NTQ5MjU4NV5BMl5BanBnXkFtZTgwMzk4OTEyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0235960","name":"Robin Atkin Downes","idIMDB":"nm0235960"},"actorId":"nm0235960","character":"Harvey Dent","urlCharacter":"http://www.imdb.com/character/ch0308458","main":true},{"actorName":"Keith Ferguson","urlProfile":"http://www.imdb.com/name/nm1584992","urlPhoto":"","biography":{"dateOfBirth":"26 February 1972","placeOfBirth":" Los Angeles, California, USA","birthName":"Keith James Ferguson","bio":"After studying theatrical performance and creative writing at the University of the Pacific and University of Southern California, Ferguson worked behind the scenes in daytime television production while occasionally finding time to perform in local theatre productions and improvisation groups. Towards the end of his production career, he actively began his pursuit of a career in voice-over. In 1999, while working on what would turn out to be his last full-time position in TV production, a voice-over agent named Pat Brady, after discovering Ferguson the week prior in a voice-over workshop in Toluca Lake, California, and before even officially signing with him for representation, sent him out on what would be his first professional voice-over audition (a sound-alike for Keanu Reeves in a 60 second radio spot satirizing The Matrix (1999) for the former Hollywood Video movie-rental franchise). He ended up booking the role from this first VO audition, after which he officially signed with Pat Brady who, through two talent agencies, would continue to represent him to this day. In 2000, Ferguson gained his first experience in animation voice-over alongside VO actors Rob Paulsen and David Sobolov having booked the role of \"Ray\" on a former, somewhat obscure CG animated web-series entitled \"Li'l Green Men\" featured on Warner Bros. former website \"Entertaindom.\" After the next 3 years while building up his voice-over repertoire with various roles in commercial spots, video games, animation, and sound-alike voice-matching for various films, he would be cast in one of the first of his more notable roles being that of Blooregard Q. Kazoo, a.k.a \"Bloo\" in Foster's Home for Imaginary Friends (2004) created and produced at Cartoon Network Studios and Boulder Media by animator Craig McCracken creator of The Powerpuff Girls (1998). This was accompanied by other notable performances such as General 'Thunderbolt' Ross in the animated series The Avengers: Earth's Mightiest Heroes (2010), Friend Owl in the feature Bambi II (2006), as well as his recurring vocal portrayal of Harrison Ford as Han Solo and Indiana Jones in Robot Chicken (2005), the regular series along with its growing franchise of Star Wars parodies. In 2008 Ferguson was also vocally featured as two differently styled race-announcers in two TV commercials for the sports beverage, Vitamin Water; one featuring race-car driver Carl Edwards with Ralph Macchio paying homage to his role in The Karate Kid (1984), and the other a Super Bowl ad featuring Shaquille O'Neal as an unlikely victorious horse-race jockey. Since then he's continued his work in several animation and video game projects as well as periodic voice-match work for the likes of Keanu Reeves, Ray Romano, Will Ferrell, Paul Walker, Andy Dick, Martin Short, Owen Wilson, Bruce Greenwood, Billy Bob Thornton, and Dan Aykroyd amongst many others.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1584992","name":"Keith Ferguson","idIMDB":"nm1584992"},"actorId":"nm1584992","character":"Jefferson Skeevers","urlCharacter":"http://www.imdb.com/character/ch0421377","main":true},{"actorName":"Michael Gough","urlProfile":"http://www.imdb.com/name/nm0299855","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NjA0NDM4MF5BMl5BanBnXkFtZTcwMzIxODQ2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1956","placeOfBirth":" San Jose, California, USA","birthName":"Michael J. Gough","bio":"Michael Gough was born on December 3, 1956 in San Jose, California, USA as Michael J. Gough. He is an actor, known for StarCraft (1998), Batman: Arkham City (2011) and The Last of Us (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NjA0NDM4MF5BMl5BanBnXkFtZTcwMzIxODQ2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0299855","name":"Michael Gough","idIMDB":"nm0299855"},"actorId":"nm0299855","character":"Driver","urlCharacter":"http://www.imdb.com/character/ch0421378","main":true},{"actorName":"Danny Jacobs","urlProfile":"http://www.imdb.com/name/nm0414365","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxOTkwODI3NF5BMl5BanBnXkFtZTgwODY2MTY0MzE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 July 1968","placeOfBirth":" Detroit, Michigan, USA","birthName":"Daniel Jacobs","bio":"Born in Detroit, Michigan, in 1968. Attended St. Matthew Elementary, Bishop Gallagher High School. He then went on to business school at Wayne State University for two years. In 1988 Danny transferred to the University of Arizona. He graduated as a musical theatre major. Worked in Regional theaters across the country. Has done many voice-overs for commercial, promo, video game and animated projects. He is the 6th of 7 children, has 14 nieces and nephews and 5 Godchildren.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxOTkwODI3NF5BMl5BanBnXkFtZTgwODY2MTY0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0414365","name":"Danny Jacobs","idIMDB":"nm0414365"},"actorId":"nm0414365","character":"Flass' Attorney","urlCharacter":"http://www.imdb.com/character/ch0421379","main":true}],"seasons":[],"idIMDB":"tt1672723","urlIMDB":"http://www.imdb.com/title/tt1672723","business":{"budget":{"money":"$3,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 4 min (64 min) (USA)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.4","filmingLocations":[],"rated":"PG-13","awards":[{"award":"Behind the Voice Actors Awards 2012","titlesAwards":[{"titleAwardOutcome":"Won BTVA Special/DVD Voice Acting Award","categories":[{"category":"Best Male Vocal Performance in a TV Special/Direct-to-DVD Title or Theatrical Short","names":[{"name":"Bryan Cranston","id":"nm0186505","role":null}]}]}]}],"votes":"23,800","type":"Video","companyCreditsSimple":[{"idCompany":"co0197868","name":"Warner Premiere"},{"idCompany":"co0283444","name":"DC Entertainment"},{"idCompany":"co0072876","name":"Warner Bros. Animation"}],"keywords":{"keywords":["gotham city","manhunt","corruption","playboy","justice","fight","obsession","legend","fear","police","man versus beast","flat tire","fight to the death","final showdown","showdown","christ allegory","female robber","robber","robbery","torture","african american","home invasion","ultrasound","baby","shootout","gunfight","street shootout","fighting","escaped mental patient","basement","courage","bravery","near death experience","flipping car","strangulation","handcuffs","arrest","tied to a bed","male nudity","car into water","sadism","sadist","cover up","teenage prostitute","cityscape","night","aerial shot","fictional city","dinner party","cape","limousine driver","limousine","knocked out","gas gun","corrupt politician","weightlifting","cemetery","sabotage","fire","chase","foot chase","following someone","stalking","hit with a baseball bat","baseball bat","beaten to death","beating","revenge","bare chested male","eavesdropping","public nudity","italian american","assassin","professional hit","attempted murder","hitman","trial","henchman","thug","bodyguard","uncle nephew relationship","sauna","training","kung fu","karate","judo","humiliation","danger","panic","ex special forces","tape recorder","injection","taxi","mexican standoff","parking garage","snow","disarming someone","child in peril","newspaper headline","conspiracy","ski mask","mobster","gangster","mafia boss","mob boss","crime boss","criminal","female warrior","tough girl","action heroine","anti heroine","one woman army","teenage girl","teenager","stabbed in the leg","threatened with a knife","female reporter","female journalist","reporter","journalist","media coverage","news report","watching tv","toy","burglary","burglar","cat burglar","catwoman","cat","knife","bat cave","female thief","thief","motorcycle","helicopter pilot","helicopter","sniper rifle","sniper","shotgun","machine gun","revolver","pistol","shooting range","target practice","childbirth","pregnancy","hospital","nurse","pregnant woman","diner","extramarital affair","husband wife relationship","man with glasses","mustache","mansion","manor house","butler","airport","airplane","fake drunkenness","heir","loner","tough guy","hope","anti hero","necklace","man kills a woman","shot in the chest","black and white scene","haunted by the past","movie theater","flashback","dark past","tragic hero","tragic past","tragedy","tragic event","loss of family","loss of father","loss of mother","murder of family","death of family","action hero","betrayal","mercilessness","brutality","shot in the arm","shot in the shoulder","vigilante justice","bound and gagged","apartment","hostage","ambush","deception","death","vigilante","coming of age","warrior","escape","rescue","held at gunpoint","van","masked man","masked hero","costumed hero","suspicion","power outage","explosion","attempted robbery","abandoned building","police raid","swat team","smoke grenade","gas grenade","explosive","photograph","gadget","silhouette","rope","free running","parkour","climbing up a building","climbing out a window","suspense","falling from height","crashing through a window","bridge","jumping from a bridge","jumping through a window","jumping from a building","jumping from a rooftop","jumping from height","hit by a car","body landing on a car","jumping from a car","el train","rooftop","open ended","no opening credits","train station","train","corpse","car rollover","crime fighter","overturning car","car accident","car crash","thrown through a window","inner monologue","voice over narration","gothic","lightning","rainstorm","heavy rain","thrown from a car","investigation","female lawyer","homeless man","child prostitute","prostitute","homeless person","red light district","fight the system","social commentary","urban setting","social decay","urban decay","woman hits a man","woman fights a man","woman punches a man","man hits a woman","man fights a woman","man punches a woman","street fight","kicked in the stomach","kicked in the face","punched in the chest","punched in the face","car truck chase","mixed martial arts","car motorcycle chase","brawl","fistfight","tough cop","maverick cop","culture clash","police chase","corrupt cop","police vigilantism","bomb","policewoman","exploding building","sergeant","lieutenant","police lieutenant","police sergeant","police station","year in title","drug dealer","police commissioner","police car","partner","police officer","stylized violence","based on graphic novel","police shootout","hand to hand combat","martial arts","organized crime","female cop","police brutality","detective","police detective","car chase","exploding car","reference to william shakespeare","blackmail","two sides of the coin","troubled past","one against many","one man army","family man","penthouse apartment","hogtied individual","garage beatdown","disturbed individual","knowledge of multiple cultures","world travel","secret promise","district attorney","honest cop","cave","dark avenger","sorrow","pulp fiction","thrill seeker","wild side","beast behind the mask","sacred vow","perception","reference to dracula","workplace romance","clown","old mansion","surrogate father","orphan","ninjitsu","sexual identity","sexual symbolism","paranoia","swarm of bats","violence","gore","blood","kidnapping","race against time","interrogation","masked woman","female vigilante","dual identity","urban legend","legend versus fact","mythological reference","myth","reference to robin hood","masked vigilante","gothic nature","dual lives","child prostitution","police ethics","dark angel","dark hero","brooding hero","gothic architecture","gargoyle","gothic atmosphere","stealth fighter","gadgetry","theatricality","lost soul","parallel lives","neo noir","flawed hero","ethics","morality","justice system","prophetic","foreshadowing","prosecutor","lawyer","murder","bribery","mafia","vigilantism","adultery","reference to the godfather","corrupt police","pimp","forced prostitution","s&m","dominatrix","prostitution","strip club","porno theater","reference to shakespeare's hamlet","bat","omen","1980s","urban gothic","origin of hero","police corruption","based on comic book","based on comic","dc comics","graphic novel","superhero","death of father","death of mother","character name in title","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:42:06"}}