{"data":{"movies":[{"title":"In Time","originalTitle":"","year":"2011","releaseDate":"20111028","directors":[{"name":"Andrew Niccol","id":"nm0629272"}],"writers":[{"name":"Andrew Niccol","id":"nm0629272"}],"runtime":"109 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NzI1ODc1MV5BMl5BanBnXkFtZTcwMzI5NjQwNg@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Sci-Fi","Thriller"],"plot":"Welcome to a world where time has become the ultimate currency. You stop aging at 25, but there's a catch: you're genetically-engineered to live only one more year, unless you can buy your way out of it. The rich \"earn\" decades at a time (remaining at age 25), becoming essentially immortal, while the rest beg, borrow or steal enough hours to make it through the day. When a man from the wrong side of the tracks is falsely accused of murder, he is forced to go on the run with a beautiful hostage. Living minute to minute, the duo's love becomes a powerful tool in their war against the system.","simplePlot":"In a future where people stop aging at 25, but are engineered to live only one more year, having the means to buy your way out of the situation is a shot at immortal youth. Here, Will Salas finds himself accused of murder and on the run with a hostage - a connection that becomes an important part of the way against the system.","actors":[{"actorName":"Justin Timberlake","urlProfile":"http://www.imdb.com/name/nm0005493","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMjE1MjU2N15BMl5BanBnXkFtZTcwNjk0ODY1NA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 January 1981","placeOfBirth":" Memphis, Tennessee, USA","birthName":"Justin Randall Timberlake","height":"6' 1\" (1.85 m)","bio":"Justin Randall Timberlake was born on January 31, 1981, in Memphis, Tennessee, to Lynn (Bomar) and Randall Timberlake, whose own father was a Baptist minister. At the age of 11, he appeared on the show Star Search (1983), and even though he didn't win, it didn't dampen his ambitions. He also appeared on The All New Mickey Mouse Club (1989), where his costars included Britney Spears, Ryan Gosling, Keri Russell, Christina Aguilera and future band-mate J.C. Chasez. At age 14, Justin became a member of the boy band *NSYNC. In 1998, the group released their self-titled debut album. They became a big hit with fans and made a place for themselves in the music world with a succession of big-selling albums. In the beginning of 2002, Justin spent time working on and writing songs for his debut solo album. During this time, he broke up with his longtime girlfriend, Britney Spears. The release of the solo album, titled \"Justified\", came in November of 2002. Songs from his solo album include: \"Like I Love You\", \"Cry Me A River\" and \"Rock Your Body\". Timberlake has branched out into an acting career, having most recently starred in The Social Network (2010), Friends with Benefits (2011), and Trouble with the Curve (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMjE1MjU2N15BMl5BanBnXkFtZTcwNjk0ODY1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005493","name":"Justin Timberlake","nicknames":["JT"],"idIMDB":"nm0005493"},"actorId":"nm0005493","character":"Will Salas","urlCharacter":"http://www.imdb.com/character/ch0224976","main":true},{"actorName":"Olivia Wilde","urlProfile":"http://www.imdb.com/name/nm1312575","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWJiYmFjZDAtYjYwMi00M2NkLWJlNTgtMzgzZjU0NTBkY2Q4L2ltYWdlXkEyXkFqcGdeQXVyNzExOTQxNjM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 March 1984","placeOfBirth":" New York City, New York, USA","birthName":"Olivia Jane Cockburn","height":"5' 7\" (1.7 m)","bio":"Actress and activist Olivia Wilde is a modern-day renaissance woman. Starring in films and popular television shows, Wilde shares the screen with renowned actors while simultaneously giving back to the community. Olivia Wilde was born Olivia Jane Cockburn in New York City, to journalists Leslie Cockburn (née Leslie Corkill Redlich) and Andrew Cockburn. Her father is from an upper-class British family and her mother is American-born; her recent ancestry includes English, Scottish, German, Irish, and Manx. Olivia was raised in Washington, D.C., and went to school there, as well as at Phillips Academy in Andover, Massachusetts, from which she graduated in 2002. Her father was born in England and later became an Irish citizen, giving Olivia dual American and Irish nationality, and facilitating her brief study at the Gaiety School of Acting in Dublin, Ireland. After appearing in the short-lived Fox television series Skin (2003), she made her Hollywood debut in The Girl Next Door (2004) and then came to public notice in The O.C. (2003), but it was as Dr. Remy \"Thirteen\" Hadley in House (2004) that she achieved international stardom. She has since starred or co-starred in the films TRON: Legacy (2010), Cowboys & Aliens (2011), In Time (2011), People Like Us (2012) and The Words (2012). Wilde's 2010s film credits include the star-studded Third Person, the Oscar-winning drama Her and critically-acclaimed and Golden Globe-nominated Rush. Wilde also produced and starred in the indie comedy Drinking Buddies. In 2013, Wilde launched the philanthropic company Conscious Commerce, with the mission to create a guide for conscious living by promoting the causes, brands, people and lifestyles that are forging a new paragon of living. In line with the Conscious Commerce mission, Wilde also recently signed on to be the face of H&M's latest Conscious Exclusive Collection, which is made completely using organic and recycled materials. She is also a board member of Artists For Peace and Justice and sits on the foundation board of the ACLU of Southern California. In 2015, Wilde produced and starred in the drama Meadowland, which premiered at the year's Tribeca Film Festival. Wilde earned rave reviews for her emotionally charged performance as a mother coping with the heartbreak following her young son's disappearance. Up next for Wilde is the holiday comedy Love The Coopers. The film, which features an ensemble cast, follows the exasperated members of an extended family who gather for their annual holiday celebration. Returning to television next year, Wilde will star alongside Bobby Canavale in HBO's Untitled Rock 'N' Roll drama. Set in 1970s New York, the series is being produced by Martin Scorsese, Mick Jagger and Terence Winter. Wilde previously starred in FOX's acclaimed medical drama \"House,\" playing the standout Dr. Thirteen for six seasons.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWJiYmFjZDAtYjYwMi00M2NkLWJlNTgtMzgzZjU0NTBkY2Q4L2ltYWdlXkEyXkFqcGdeQXVyNzExOTQxNjM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1312575","name":"Olivia Wilde","idIMDB":"nm1312575"},"actorId":"nm1312575","character":"Rachel Salas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shyloh Oostwald","urlProfile":"http://www.imdb.com/name/nm3618685","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDM1NGJiOWMtYzYzYy00MTU1LWIzNTQtNDM5ODQxMDEyODliL2ltYWdlXkEyXkFqcGdeQXVyNDE0ODc1Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"A native of Los Angeles, California, Shyloh Oostwald was raised by her mother Lisa, who is a talent scout. Shyloh began her acting career at the age of six when she was discovered by her talent manager Annet McCroskey in acting class. She first appeared on screen in several independent films including 'Falling Snow', 'At What Price', 'Children of the Air' and 'Elena Undone.' On the small screen, Shyloh appeared on NBC's 'The Event' and the 'Jay Leno Show', ABC's 'Happy Endings', CBS's 'Criminal Minds', FOX's 'House M.D., 'Arrested Development', FX's 'American Horror Story' Nickelodeons 'iCarly' and '100 things to do before High School.' Shyloh was part of the ensemble cast in the Geek & Sundry sci-fi horror series 'Spooked' and was cast as Maya alongside Justin Timblerlake in the film 'In Time.' Shyloh has appeared as the voice for many characters in films such as 'Escape from Paradise 2', 'Enchanted House', 'Son of Bigfoot' and Cartoon Networks 'Adventure Time.' She has also modeled and is on the cover of the album 'We Are the fallen/ Tear down the World.' Shyloh also enjoys stage acting and performed alongside Jerry O'Connell in 'Walk to the Vet.' In addition to acting, Shyloh plays the piano, ice skates and takes ballet.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM4YmJiNDUtZDliNS00NDZjLWJkYTgtNDJiMzdmOTkyMjUwXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3618685","name":"Shyloh Oostwald","idIMDB":"nm3618685"},"actorId":"nm3618685","character":"Maya","urlCharacter":"http://www.imdb.com/character/ch0456433","main":true},{"actorName":"Johnny Galecki","urlProfile":"http://www.imdb.com/name/nm0301959","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ2ODY0MTIwMV5BMl5BanBnXkFtZTcwNDQ2NzMzMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 April 1975","placeOfBirth":" Bree, Flanders, Belgium","birthName":"John Mark Galecki","height":"5' 5\" (1.65 m)","bio":"John Mark Galecki was born in Bree, Belgium, to American parents; his father was stationed there while serving in the U.S. Air Force. When he was three years old, his family moved to Chicago, Illinois, where he grew up with his parents, Mary Lou and Richard Galecki, and siblings, sister Allison (1980) and brother Nick (1982). His father was of Polish descent, and his mother's ancestry is Irish and Italian. His mother was a mortgage consultant and his father became a teacher for blind veterans in a VA hospital outside of Chicago. When Galecki was sixteen, his father died in an accident. His mother recalled in an interview with People magazine that Galecki was a very artistic kid; at only 4 years old, he told her: \"Mom, I'm gonna be on T.V., and I don't mean when I grow up.\" Two years later, when their attempts to distract him with sports failed, Galecki's parents took him to open auditions at local theaters in Chicago. He landed his first role in \"Fiddler on the Roof,\" and more parts in other productions followed. By age 11, he was already known as an excellent actor in Chicago's theater scene evidenced by him receiving a Joseph Jefferson Citation nomination for portraying John Henry in \"The Member of the Wedding.\" In 1989 he was cast in his first movie, a holiday film called Prancer (1989), but his big break was in another Christmas movie as Chevy Chase's son Rusty Griswold, in National Lampoon's Christmas Vacation (1989). On the set, Chase took a liking to him, and Galecki recalled in a later interview that Chevy Chase showed him some tricks for comedic timing. By that time, his whole family had moved from Chicago to L.A. to support his career. But within 10 months they realized they missed Chicago too much, and moved back home. Galecki, still just 14, was under contract on a show with Robert Urich called \"American Dreamer (1990)\", so he stayed in L.A. Although he was living alone in a studio apartment, he never got into trouble and was a good kid. He recalled living alone in L.A. without adult supervision as \"not fun\" and \"quite intimidating and lonely, to be honest. But I've always been happiest when I'm working, so...\" He bought a motorcycle with a mirrored helmet so he could get to work and back, at Paramount studios. In 1991 Galecki was picked by Roseanne Barr to play her son in the made for T.V. movie Backfield in Motion (1991). She liked him so much she asked him to come on her sitcom for what started as a one-off appearance, but soon turned into the important recurring role of David Healy. His family was religious viewers of the show and he was somewhat intimidated at first to be working with his television heroes. However, before long, it was his heroes that praised him: Roseanne said he showed \"great vulnerability.\" John Goodman said: \"If he was one of those little stuffed bears at a carny, he'd have a Wuv me t-shirt on. People just want to take care of him.\" Galecki also became very close friends with co-star Sara Gilbert and the show's executive producer Eric Gilliland. After Roseanne (1988) he worked on a number of diverse roles, from funny Ira alongside Christopher Walken in the 1997 dark-comedy Suicide Kings (1997) to a drug-addicted student in 2003's Bookies (2003), and he played gay characters in Don Roos's Bounce (2000) and The Opposite of Sex (1998). He never stayed far from the television industry as he made guest appearances such as Laurie Freeman's younger lover in Norm (1999) (where he once again worked with Laurie Metcalf, his former Roseanne cast mate), as a golfer in My Name Is Earl (2005), as Hope & Faith (2003)'s younger brother in the sitcom of the same name, and as hilarious party-boy Trouty on My Boys (2006). In 2006 he returned to his theater roots as he took on the role of conflicted but sweet male escort Alex in Douglas Carter Beane's play \"The Little Dog Laughed,\" for which he received a 2007 Theatre World Award for Outstanding Browdway Debut. In 2007 he was back on the small screens, starring as Leonard Hofstadter in the sitcom The Big Bang Theory (2007). Not only was Chuck Lorre, a former producer for Roseanne, a producer of the new show, but Sara Gilbert and Laurie Metcalf both made guest appearances. Galecki is a self-admitted motorcycle \"nerd,\" and drives a Harley Davidson Softail Deluxe. Although he never went to college, he has said: \"I'm not dead! We should never stop learning. We should never stop absorbing,\" and so he learned how to play the cello in his early twenties. He likes traveling around the world, painting, music (he also plays bass), and hiking with his dog Vera. He always has been very private about his personal life and little is known about past relationships. It has only been confirmed that he dated actresses Laura Harris and Kaley Cuoco. He isn't on twitter, and Galecki once said, \"I don't understand the current frame of mind in our society that seems to say that any action is not of value until it's broadcast somehow.\" He still lives in Los Angeles but is often spotted in Chicago, where his siblings still live.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ2ODY0MTIwMV5BMl5BanBnXkFtZTcwNDQ2NzMzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0301959","name":"Johnny Galecki","idIMDB":"nm0301959"},"actorId":"nm0301959","character":"Borel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Colin McGurk","urlProfile":"http://www.imdb.com/name/nm4213653","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMjQ2Njc5Nl5BMl5BanBnXkFtZTgwODU1MjIzOTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Colin McGurk is an actor, known for In Time (2011), F*cking Facebook (2012) and Taught in Cold Blood (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMjQ2Njc5Nl5BMl5BanBnXkFtZTgwODU1MjIzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4213653","name":"Colin McGurk","idIMDB":"nm4213653"},"actorId":"nm4213653","character":"Citizen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Will Harris","urlProfile":"http://www.imdb.com/name/nm1705317","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODg5ODMxNDU3Ml5BMl5BanBnXkFtZTgwNDQwNzg2MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1986","placeOfBirth":" Los Angeles, California, USA","birthName":"William A. Paxton Harris","height":"6' 4\" (1.93 m)","bio":"Will Harris was born on October 25, 1986 in Los Angeles, California, USA as William A. Paxton Harris. He is an actor, known for In Time (2011), Sky High (2005) and Big Driver (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODg5ODMxNDU3Ml5BMl5BanBnXkFtZTgwNDQwNzg2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1705317","name":"Will Harris","nicknames":["Willy"],"idIMDB":"nm1705317"},"actorId":"nm1705317","character":"Ulysse","urlCharacter":"http://www.imdb.com/character/ch0456434","main":true},{"actorName":"Michael William Freeman","urlProfile":"http://www.imdb.com/name/nm2508626","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNzM3MzQ3M15BMl5BanBnXkFtZTgwNjQ2MDE4NzE@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 April 1981","placeOfBirth":" Richmond, Virginia, USA","height":"5' 9½\" (1.77 m)","bio":"Michael William Freeman was born on April 22, 1981 in Richmond, Virginia, USA. He is an actor, known for In Time (2011), Ratter (2015) and Doll & Em (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNzM3MzQ3M15BMl5BanBnXkFtZTgwNjQ2MDE4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2508626","name":"Michael William Freeman","nicknames":["Bam Bam"],"idIMDB":"nm2508626"},"actorId":"nm2508626","character":"Nardin","urlCharacter":"http://www.imdb.com/character/ch0456435","main":true},{"actorName":"Jesse Lee Soffer","urlProfile":"http://www.imdb.com/name/nm0497522","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzUzNTY3MTc3N15BMl5BanBnXkFtZTgwMTkwMjAwNzE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 April 1984","placeOfBirth":" Connecticut, USA","birthName":"Jesse Lee Soffer","bio":"Jesse Lee Soffer (born April 23, 1984) began his film career in 1993 at age eight in the movie Matinee (1993). From that point on, his work included time on such television series as Two of a Kind (1998), Guiding Light (1952), CSI: Miami (2002), The Mentalist (2008) and The Mob Doctor (2012). In 2013, Jesse went on to portray Travis Alexander in the television drama Jodi Arias: Dirty Little Secret (2013). The movie premiered on June 22, 2013 and received surprising acclaim from critics in its adaptation of the relationship between Travis Alexander and Jodi Arias and the murder trial that followed. Jesse's additional work on screen includes the sports drama Gracie (2007), Hatfields & McCoys (2013), and In Time (2011). He was also a cast regular on the series As the World Turns (1956), a series he is possibly best known from during his 7-year tenure on the series from 2004-2010.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzUzNTY3MTc3N15BMl5BanBnXkFtZTgwMTkwMjAwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0497522","name":"Jesse Lee Soffer","idIMDB":"nm0497522"},"actorId":"nm0497522","character":"Webb","urlCharacter":"http://www.imdb.com/character/ch0456436","main":true},{"actorName":"Aaron Perilo","urlProfile":"http://www.imdb.com/name/nm1515878","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4Njc5NjU3NTFeQTJeQWpwZ15BbWU4MDY5OTE0NjAy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1981","placeOfBirth":" Omaha, Nebraska, USA","birthName":"Aaron William Perilo","bio":"Aaron Perilo was born and raised in Omaha, Nebraska. He has been involved in local and national theatrical productions since he was a child. After attending Central High School, he then matriculated at the American Academy of Dramatic Arts. Two out of four of his other siblings, Josh Perilo and Anna Perilo, are also actors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4Njc5NjU3NTFeQTJeQWpwZ15BbWU4MDY5OTE0NjAy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1515878","name":"Aaron Perilo","idIMDB":"nm1515878"},"actorId":"nm1515878","character":"Bell","urlCharacter":"http://www.imdb.com/character/ch0266368","main":true},{"actorName":"Nick Lashaway","urlProfile":"http://www.imdb.com/name/nm1731478","urlPhoto":"","biography":{"dateOfBirth":"24 March 1988","placeOfBirth":" Washington, District of Columbia, USA","height":"6' (1.83 m)","bio":"Nick Lashaway was born on March 24, 1988 in Washington, District of Columbia, USA. He was an actor, known for In Time (2011), The 40-Year-Old Virgin (2005) and The Last Song (2010). He died on May 8, 2016 in Framingham, Massachusetts, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1731478","name":"Nick Lashaway","nicknames":["Lash"],"idIMDB":"nm1731478"},"actorId":"nm1731478","character":"Ekman","urlCharacter":"http://www.imdb.com/character/ch0456437","main":true},{"actorName":"Will Peltz","urlProfile":"http://www.imdb.com/name/nm3816797","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NTk3NzkyNV5BMl5BanBnXkFtZTgwOTgyMzYxNzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1986","placeOfBirth":" New York City, New York, USA","height":"6' (1.83 m)","bio":"Will Peltz was born on May 30, 1986 in New York City, New York, USA. He is an actor, known for In Time (2011), Unfriended (2014) and Paranoia (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NTk3NzkyNV5BMl5BanBnXkFtZTgwOTgyMzYxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3816797","name":"Will Peltz","idIMDB":"nm3816797"},"actorId":"nm3816797","character":"Pierre","urlCharacter":"http://www.imdb.com/character/ch0456438","main":true},{"actorName":"Ray Santiago","urlProfile":"http://www.imdb.com/name/nm0763631","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NzIxNTEwM15BMl5BanBnXkFtZTgwMTY2MTM0MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 June 1984","placeOfBirth":" Bronx, New York, USA","height":"5' 6\" (1.68 m)","bio":"Ray Santiago was born on June 15, 1984 in Bronx, New York, USA. He is an actor and producer, known for In Time (2011), Meet the Fockers (2004) and Girlfight (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NzIxNTEwM15BMl5BanBnXkFtZTgwMTY2MTM0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0763631","name":"Ray Santiago","nicknames":["Iago"],"idIMDB":"nm0763631"},"actorId":"nm0763631","character":"Victa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matt Bomer","urlProfile":"http://www.imdb.com/name/nm0093589","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTE4NTE5NV5BMl5BanBnXkFtZTcwMTcyOTY5Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1977","placeOfBirth":" Webster Groves, Missouri, USA","birthName":"Matthew Staton Bomer","height":"5' 11½\" (1.82 m)","bio":"Matthew Staton Bomer was born in Webster Groves, Greater St. Louis, Missouri, to Elizabeth Macy (Staton) and John O'Neill Bomer IV, a Dallas Cowboys draft pick. Matt was raised in Spring, Texas, and educated at Klein High School, near Houston. After school, he attended Carnegie Mellon University in Pittsburgh, Pennsylvania, graduating with a Bachelor of Fine Arts degree. Bomer then relocated to New York to forge a career in acting. Theater work followed, but his television break came with a small part in All My Children (1970). This lead to a reoccurring role in Guiding Light (1952) as murderous Ben Reade. Further success in TV followed including parts in Tru Calling (2003), Chuck (2007) and the lead role in Traveler (2007) . Bomer also scored film roles in projects such as Flightplan (2005) and The Texas Chainsaw Massacre: The Beginning (2006). In 2009, he was cast in the lead role of criminal mastermind Neal Caffrey in Fox's White Collar (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTE4NTE5NV5BMl5BanBnXkFtZTcwMTcyOTY5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0093589","name":"Matt Bomer","idIMDB":"nm0093589"},"actorId":"nm0093589","character":"Henry Hamilton","urlCharacter":"http://www.imdb.com/character/ch0267080","main":true},{"actorName":"Zuleyka Silver","urlProfile":"http://www.imdb.com/name/nm3561761","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NDQ1MTM1M15BMl5BanBnXkFtZTgwNTYwNzM1ODE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 August 1991","placeOfBirth":" Tijuana, Baja California, Mexico","height":"5' 5\" (1.65 m)","bio":"Zuleyka Silver was born on August 2, 1991 in Tijuana, Baja California, Mexico. She is an actress, known for In Time (2011), Girl House (2014) and Up or Down? (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NDQ1MTM1M15BMl5BanBnXkFtZTgwNTYwNzM1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3561761","name":"Zuleyka Silver","idIMDB":"nm3561761"},"actorId":"nm3561761","character":"Pasha","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Laura Ashley Samuels","urlProfile":"http://www.imdb.com/name/nm3359122","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MzY2MDYxNV5BMl5BanBnXkFtZTgwMjQwMzcxOTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1990","placeOfBirth":" Dallas, Texas, USA","height":"5' 8\" (1.73 m)","bio":"Laura Ashley Samuels was born on August 29, 1990 in Dallas, Texas, USA. She is an actress, known for In Time (2011), The Final (2010) and Walk of Fame (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MzY2MDYxNV5BMl5BanBnXkFtZTgwMjQwMzcxOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3359122","name":"Laura Ashley Samuels","nicknames":["Lou","Lola"],"idIMDB":"nm3359122"},"actorId":"nm3359122","character":"Sagita","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1637688","urlIMDB":"http://www.imdb.com/title/tt1637688","business":{"budget":{"money":"$40,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$12,050,368","country":"USA","day":"30","month":"10","year":"2011","remarks":"3,122 Screens"},{"money":"PHP 9,547,497","country":"Philippines","day":"30","month":"10","year":"2011","remarks":"111 Screens"}],"gross":[{"money":"$37,553,932","country":"USA","day":"12","month":"02","year":"2012","remarks":""},{"money":"$37,535,816","country":"USA","day":"05","month":"02","year":"2012","remarks":""},{"money":"$37,508,853","country":"USA","day":"29","month":"01","year":"2012","remarks":""},{"money":"$37,454,844","country":"USA","day":"22","month":"01","year":"2012","remarks":""},{"money":"$37,376,108","country":"USA","day":"15","month":"01","year":"2012","remarks":""},{"money":"$37,238,317","country":"USA","day":"08","month":"01","year":"2012","remarks":""},{"money":"$37,076,415","country":"USA","day":"01","month":"01","year":"2012","remarks":""},{"money":"$36,732,694","country":"USA","day":"18","month":"12","year":"2011","remarks":""},{"money":"$36,405,892","country":"USA","day":"11","month":"12","year":"2011","remarks":""},{"money":"$35,850,495","country":"USA","day":"04","month":"12","year":"2011","remarks":""},{"money":"$33,454,533","country":"USA","day":"20","month":"11","year":"2011","remarks":""},{"money":"$30,598,618","country":"USA","day":"13","month":"11","year":"2011","remarks":""},{"money":"$23,990,237","country":"USA","day":"06","month":"11","year":"2011","remarks":""},{"money":"$12,050,368","country":"USA","day":"30","month":"10","year":"2011","remarks":""},{"money":"$103,200,000","country":"Non-USA","day":"06","month":"01","year":"2012","remarks":""},{"money":"PHP 25,753,625","country":"Philippines","day":"06","month":"11","year":"2011","remarks":""},{"money":"PHP 9,547,497","country":"Philippines","day":"30","month":"10","year":"2011","remarks":""}],"weekendGross":[{"money":"$11,624","country":"USA","day":"12","month":"02","year":"2012","remarks":"20 Screens"},{"money":"$15,721","country":"USA","day":"05","month":"02","year":"2012","remarks":"34 Screens"},{"money":"$32,476","country":"USA","day":"29","month":"01","year":"2012","remarks":"58 Screens"},{"money":"$57,633","country":"USA","day":"22","month":"01","year":"2012","remarks":"97 Screens"},{"money":"$75,353","country":"USA","day":"15","month":"01","year":"2012","remarks":"106 Screens"},{"money":"$115,356","country":"USA","day":"08","month":"01","year":"2012","remarks":"132 Screens"},{"money":"$89,670","country":"USA","day":"01","month":"01","year":"2012","remarks":"123 Screens"},{"money":"$163,354","country":"USA","day":"18","month":"12","year":"2011","remarks":"273 Screens"},{"money":"$347,020","country":"USA","day":"11","month":"12","year":"2011","remarks":"354 Screens"},{"money":"$555,102","country":"USA","day":"04","month":"12","year":"2011","remarks":"421 Screens"},{"money":"$1,710,692","country":"USA","day":"20","month":"11","year":"2011","remarks":"1,367 Screens"},{"money":"$4,081,881","country":"USA","day":"13","month":"11","year":"2011","remarks":"2,591 Screens"},{"money":"$7,481,592","country":"USA","day":"06","month":"11","year":"2011","remarks":"3,127 Screens"},{"money":"$12,050,368","country":"USA","day":"30","month":"10","year":"2011","remarks":"3,122 Screens"},{"money":"PHP 10,925,764","country":"Philippines","day":"06","month":"11","year":"2011","remarks":"104 Screens"},{"money":"PHP 9,547,497","country":"Philippines","day":"30","month":"10","year":"2011","remarks":"111 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"25","month":"10","year":"2010","remarks":null},null],"copyrightHolder":"Regency Entertainment (USA), Inc. in the U.S. only; Monarchy Enterprises S.a.r.l. in all other territories"},"technical":{"runtime":["1 hr 49 min (109 min)"],"soundMix":["Dolby","Dolby Digital","Datasat"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa, Zeiss Master Prime Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA (also prints)","EFILM Digital Laboratories, Hollywood (CA), USA (digital intermediate)"],"filmLength":["2,985 m (Portugal, 35mm)"],"negativeFormat":["Codex"],"cinematographicProcess":["Digital Intermediate (4K) (master format)","Uncompressed Digital (1080p/24) (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Fuji Eterna-CP 3514DI)","D-Cinema"]},"rating":"6,7","metascore":"53","filmingLocations":[{"location":"Metropolitan Courthouse - 1945 South Hill St. Los Angeles, California, USA"}],"rated":"PG-13","awards":[{"award":"Golden Trailer Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Independent Poster","names":[{"name":"20th Century Fox International","id":null,"role":null},{"name":"Ignition Creative","id":null,"role":null}]}]}]},{"award":"Teen Choice Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie Actor: Drama","names":[{"name":"Justin Timberlake","id":"nm0005493","role":null}]}]}]}],"votes":"316 759","type":"Movie","companyCreditsSimple":[{"idCompany":"co0021592","name":"Regency Enterprises"},{"idCompany":"co0025101","name":"New Regency Pictures"},{"idCompany":"co0086710","name":"Strike Entertainment"}],"keywords":{"keywords":["class differences","time","currency","future","on the run","murder","hostage","clock","death","ghetto","against the system","ransom","party","police","millionaire","upper class","fight","inflation","immortality","suicide","gang","cgi","vomiting","cleavage","stealing from the poor","stealing from the rich","existentialism","corrupt system","thug","rainy night","hotel room","black lingerie","generosity","looting","woman with gun","rich woman poor man","passionate kiss","armored car","near future","public phone","telephone call","reckless driving","night","high heels","billionaire","sports car","lower class","expensive gift","taxi ride","party invitation","winning at poker","poker game","credits as currency","solicitation","prostitute propositioning","street prostitution","prostitute","police officer shot","police officer killed","premarital sex","bare butt","robber","reverse footage","rescue","mexican standoff","time capsule","riot","protest","police car","impersonating a police officer","vault","fight to the death","shot in the throat","shot in the foot","jumping from height","rooftop","betrayal","deception","elevator","disguise","carjacking","interrogation","apartment","shotgun","sawed off shotgun","diamond earring","escape","dancing","revenge","card game","unlikely hero","social decay","tough guy","anti hero","wanted poster","storm drain","flat tire","car accident","bridge","fistfight","beating","attempted robbery","abandoned building","held at gunpoint","motel","kidnapping","false accusation","security camera","surveillance","falling from height","drunkenness","factory","limousine","heiress","media coverage","police station","detective","police detective","swat team","criminal","revolver","machine gun","bank vault","social commentary","husband wife relationship","restaurant","mother daughter relationship","cyberpunk","chase","female removes her clothes","kissing while having sex","strip poker","love interest","black dress","redhead","gunfight","brawl","violence","kiss","ambush","street shootout","police shootout","police chase","bar fight","urban setting","showdown","brief nudity","ocean","swimming","car","target practice","hedonism","survival of the fittest","critique of police","false consciousness","social darwinism","economic exploitation","predatory lending","banking system","dissident","political activism","bystanderism","hyperindividualism","corruption","economic inequality","critique of capitalism","man teaches woman how to shoot","social injustice","inequality","dystopia","murder of a police officer","shot in the chest","shootout","fugitive sex","shot to death","shot in the back","woman in bra and panties","armored truck","fugitive","news report","stolen police car","shot in the shoulder","pay phone","shooting a police officer","flashback","missionary","lens flare","pawnshop","death of husband","car chase","mansion","race against time","reference to charles darwin","father daughter relationship","gambling","bodyguard","wealth","border","debt","flask","character repeating someone else's dialogue","gangster","interracial marriage","corpse","cctv","factory worker","50th birthday","character says i love you","mother son relationship","bare chested male","genetic engineering","opening narration","written by director","bank robber","arm wrestling","skinny dipping","beach","jaguar e type","tuxedo","hotel","tollbooth","chauffeured limousine","falling off a bridge","nude swimming","pistol","poverty","economy","bus","car crash","fight the system","eternal youth","no opening credits","thief","outlaw","crime spree","bank","poker","casino","false accusation of murder","police officer","bar","robbery","25 year old","bank robbery","foot chase","two word title","death of father","death of friend","death of mother","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:08:35"}}