{"data":{"movies":[{"title":"Universal Soldier: Day of Reckoning","originalTitle":"","year":"2012","releaseDate":"20121025","directors":[{"name":"John Hyams","id":"nm0404882"}],"writers":[{"name":"John Hyams","id":"nm0404882"},{"name":"Doug Magnuson","id":"nm1586036"}],"runtime":"114 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3ODMxMDY0MF5BMl5BanBnXkFtZTcwNDc3MTY0OA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Horror","Mystery","Sci-Fi","Thriller"],"plot":"John awakens from a coma to discover his wife and daughter were slaughtered in a brutal home invasion. Haunted by images of the attack, he vows to kill the man responsible: Luc Deveraux. While John tries to piece his reality back together, things get more complicated when he is pursued by a relentless UniSol named Magnus. Meanwhile, Deveraux and surviving UniSol Andrew Scott are preparing to battle anarchy and build a new order ruled by Unisols without government oversight. They are weeding out the weak and constantly testing their strongest warriors in brutal, life-and-death combat. Luc has emerged operating the Unisol Church of Eventualism, taking in wayward Unisols whom the government has been secretly operating as remote-controlled sleeper agents. His mission is to liberate these Unisols from the implanted memories and the lies the government has inserted in them. As John gets closer to Deveraux and the rogue army of genetically enhanced warriors, he discovers more about himself ...","simplePlot":"John looks to take down Luc Deveraux after a home invasion claims his wife and daughter. The fight pits John against Andrew Scott and an army of genetically enhanced warriors; meanwhile, he must contend with a UniSol in relentless pursuit.","actors":[{"actorName":"Jean-Claude Van Damme","urlProfile":"http://www.imdb.com/name/nm0000241","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2OTE1Njg4NjVeQTJeQWpwZ15BbWU3MDAyNjU4MDM@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1960","placeOfBirth":" Berchem-Sainte-Agathe, Brussels, Belgium","birthName":"Jean-Claude Camille François Van Varenberg","height":"5' 9¾\" (1.77 m)","bio":"Van Damme was born Jean-Claude Camille François Van Varenberg in Berchem-Sainte-Agathe, Brussels, Belgium, to Eliana and Eugène Van Varenberg, an accountant. \"The Muscles from Brussels\" started martial arts at the age of eleven. His father introduced him to martial arts when he saw his son was physically weak. At the age of 12, Van Damme began his martial arts training at Centre National De Karate (National Center of Karate) under the guidance of Master Claude Goetz in Ixelles, Belgium. Van Damme trained for 4 years and earned a spot on the Belgium Karate Team. He won the European professional karate association's middleweight championship as a teenager, and also beat the 2nd best karate fighter in the world. His goal was to be number one but got sidetracked when he left his hometown of Brussels. In 1976 at the age of sixteen, Jean-Claude started his Martial Arts fight career. Over the next 6-years, he competed in both full-contact and semi-contact matches. He debuted under his birth name of Jean Claude Van Varenberg. In his first match, Jean-Claude was staggered by a round-house kick thrown by fellow countryman, Toon Van Oostrum in Brussels, Belgium. Van Damme was badly stunned, but came back to knockout Van Oostrum moments later. In 1977, at the WAKO Open International in Antwerp, Belgium, Jean-Claude lost a decision to fellow team mate Patrick Teugels in a semi-contact match. At the 1978 Challenge De Espoirs Karate Tournament (1st Trials),Jean-Claude placed 2nd in the semi-contact division. He defeated twenty-five opponents during the week long tournament, but lost in the finals to Angelo Spataro from the Naha Club. Later in 1978, Jean-Claude lost a 3-round match for the Belgium Lightweight Championship (semi-contact) to his fellow team-mate to Patrick Teugels. In 1979, Jean-Claude traveled to the United States of America, to Tampa, Florida. In his first and only match against a United States opponent, Van Damme faced 'Sherman 'Big Train'Bergman', a kick-boxer from Miami Beach, Florida. For the first and only time in his career, Jean-Claude was knocked to the canvas after absorbing a powerful left hook from Bergman. However, Jean-Claude climbed off the canvas and with a perfectly timed ax-kick, knocked Bergman out in 56 seconds of the first round. Jean-Claude was a member of the Belgium team which competed on December 26, 1979 at the La Coupe Fancois Persoons Karate Tournament which was sanctioned by the Federation bruxelloise de Karate. Van Damme's final match victory enabled his team to win the European Team Karate Championship. In Full-Contact karate, Jean-Claude knocked out England's Micheal Heming in 46 seconds of the first round. In 1980, Van Damme knocked out France's Georges Verlugels in 2 rounds of a match fought under kick-boxing rules. Jean-Claude wanted to defeat his rival Patrick Teugels. At the Forest Nationals in Brussels, on March 8, 1980, Jean-Claude knocked Teugels down and Teugels suffered a nose injury and was unable to continue. Jean-Claude was awarded a first round victory. Jean-Claude retired from martial arts in 1982, following a knockout over Nedjad Gharbi in Brussels,Belgium. Jean-Claude posted a 18-1 (18 knockouts) Kickboxing record, and a Semi-Contact record of 41-4. He came to Hong Kong at the age of 19 for the first time and felt insured to do action movies in Hong Kong. In 1981 Van Damme moved to Los Angeles. He took English classes while working as carpet layer, pizza delivery man, limo driver, and thanks to Chuck Norris he got a job as a bouncer at a club. Norris gave Van Damme a small role in the movie Missing in Action (1984), but it wasn't good enough to get anybody's attention. Then in 1984 he got a role as a villain named Ivan in the low-budget movie No Retreat, No Surrender (1986). Then one day, while walking on the streets, Jean-Claude spotted a producer for Cannon Pictures, and showed some of his martial arts abilities which led to a role in Bloodsport (1988). But the movie, filmed in Hong Kong, was so bad when it was completed, it was shelved for almost two years. It might have never been released if Van Damme did not help them to recut the film and begged producers to release it. They finally released the film, first in Malaysia and France and then into the U.S. Shot on a meager 1.5 million dollar budget, it became a U.S box-office hit in the spring of 1988. It made about 30 million worldwide and audiences supported this film for its new sensational action star Jean-Claude Van Damme. His martial arts assets, highlighted by his ability to deliver a kick to an opponent's head during a leaping 360-degree turn, and his good looks led to starring roles in higher budgeted movies like Cyborg (1989), Lionheart (1990), Double Impact (1991) and Universal Soldier (1992). In 1994, he scored with his big breakthrough $100 million worldwide hit Timecop (1994). But in the meantime, his personal life was coming apart. A divorce, followed by a new marriage, followed by another divorce. It began to show up in his career when his projects began to tank at the box office - The Quest (1996), which he directed; Maximum Risk (1996) and Double Team (1997). The three films made less than $50 million combined. In 1999 he remarried his ex-wife Gladys Portugues and restarted his lost career to attain new goals. With help from his family he faced his problems and made movies like Replicant (2001), Derailed (2002), and In Hell (2003) which did averagely in box office terms, but he tried to give his fans the best, his acting in those movies got better, more emotional and each movie was basically in different action tones.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2OTE1Njg4NjVeQTJeQWpwZ15BbWU3MDAyNjU4MDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000241","name":"Jean-Claude Van Damme","nicknames":["Muscles from Brussels","J.C."],"idIMDB":"nm0000241"},"actorId":"nm0000241","character":"Luc Deveraux","urlCharacter":"http://www.imdb.com/character/ch0012802","main":true},{"actorName":"Dolph Lundgren","urlProfile":"http://www.imdb.com/name/nm0000185","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzEyNzU4NV5BMl5BanBnXkFtZTgwNDg2MzM3MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1957","placeOfBirth":" Stockholm, Stockholms län, Sweden","birthName":"Hans Lundgren","height":"6' 5\" (1.96 m)","bio":"Dolph Lundgren was born in Stockholm, Sweden, to Sigrid Birgitta (Tjerneld), a language teacher, and Karl Johan Hugo Lundgren, an engineer and economist for the Swedish government. He lived in Stockholm until the age of 13, when he moved in with his grandparents in Nyland, Ångermanland, Sweden. Despite an early interest in music and the fine arts, Dolph decided to follow in his father's footsteps and pursue an Engineering degree. After having completed his military service, he enrolled at the Royal Institute of Technology in Stockholm. It was in the military when Dolph first came in contact with the martial arts. Five years later, Dolph had become a World-Class competitor in Japanese Karate and was deeply involved with a discipline that was to become an important part of his life. After graduating High School, Dolph spent considerable time studying in the United States and abroad on various academic scholarships. He attended Washington State University and Clemson University in South Carolina. In 1982, he received a scholarship to complete his Masters Degree in Chemical Engineering at the University of Sydney, Australia. In 1983, he was awarded a Fulbright scholarship to the Massachusetts Institute of Technology in Boston, one of the world's top engineering schools. That same year, Dolph decided to move to New York City and take up acting. He started studying drama at the Warren Robertson Theatre Workshop in Manhattan, not knowing how quickly his life was about to change. Dolph's motion picture debut came in the \"James Bond\" feature, A View to a Kill (1985). However, it was his performance in Rocky IV (1985) later that year that definitely got him noticed. After a 9-month audition process among 5,000 hopefuls, he was cast opposite writer-director Sylvester Stallone, as his Russian opponent, \"Ivan Drago\". Following the success of Rocky IV (1985), Lundgren moved to Los Angeles and has since starred in more than thirty feature films. Lundgren portrayed the classic action-heroic lead in such films as Gary Goddard's Masters of the Universe (1987), Showdown in Little Tokyo (1991) co-starring Brandon Lee and Blackjack (1998), by Hong-Kong action legend, John Woo. Lundgren has also continued to turning in memorable performances as the main adversary to other action-stars, most notably in Universal Soldier (1992) opposite Jean-Claude Van Damme, directed by Roland Emmerich, as well as Robert Longo's Johnny Mnemonic (1995) opposite Keanu Reeves. In February 2004, Dolph Lundgren directed his first feature film, the thriller The Defender (2004), in which he also starred. In 2005, he directed and starred in yet another feature, The Russian Specialist (2005) (a.k.a \"The Russian Specialist\"). In January 2006, he finished principal photography of The Final Inquiry (2006), an Italian/American/Spanish co-production, directed by Giulio Base, in which he played against, amongst others, Daniele Liotti, Max von Sydow and F. Murray Abraham. In the fall 2006, Lundgren starred in Diamond Dogs (2007), a Chinese/American co-production filmed on location in Mongolia. In the Spring 2007, he directed a modern day western shot in Texas, Missionary Man (2007). In 2009, he completed two new directorial efforts, the action-packed Command Performance (2009), which showcases Lundgren's longtime musical talents as a drummer; and the neo-noir thriller The Killing Machine (2010). Lundgren also reunited with co-stars Jean-Claude Van Damme and Sylvester Stallone for Universal Soldier: Regeneration (2009) and the highly anticipated action blockbuster, The Expendables (2010). Dolph has managed to not let his Hollywood career stand in the way of his athletic background. He has been awarded his Third Degree Black Belt by the World Karate Organization in Tokyo. His accomplishments include being the Captain of the Swedish National Karate Team, as well as a Champion of the Swedish, European and Australian Heavyweight Division titles. Lundgren still regularly performs Karate exhibitions at international tournaments worldwide. In addition to his Karate expertise, Dolph was selected by the U.S. Olympic Committee to serve as the Team Leader of the 1996 U.S. Olympic Pentathlon Team during the Atlanta Games. He is actively involved in promoting the image of this sport. Lundgren's production company, Thor Pictures, is developing several projects in which he will produce, star and/or direct. He is also a founding member of \"Group of Eight\", a New York theater group started in 1994. Lundgren has also been working on a fitness book and sports wear line for men, the creation and launch of a new Dolph Lundgren brand, a licensing, media and publishing program and the development of future entertainment and media projects. Lundgren is married to Anette Qviberg-Lundgren, an interior decorator and fashion designer. The couple, along with their two daughters, resides in Marbella, Spain.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzEyNzU4NV5BMl5BanBnXkFtZTgwNDg2MzM3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000185","name":"Dolph Lundgren","idIMDB":"nm0000185"},"actorId":"nm0000185","character":"Andrew Scott","urlCharacter":"http://www.imdb.com/character/ch0012805","main":true},{"actorName":"Scott Adkins","urlProfile":"http://www.imdb.com/name/nm0012078","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTQxMjMxNl5BMl5BanBnXkFtZTgwMTE1NzM0MDI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 June 1976","placeOfBirth":" Sutton Coldfield, West Midlands, England, UK","height":"5' 10¾\" (1.8 m)","bio":"Scott Edward Adkins was born on June 17, 1976 in Sutton Coldfield, England, into a family that for generations were butchers. Along with his elder brother Craig, he was raised by their parents, John and Janet (Sanders) Adkins, in a loving middle-class family. Scott attended Bishop Vesey's Grammar School in Sutton Coldfield. Probably not the best of students, he used to sneak downstairs after his parents had gone to bed and watch films all night then fall asleep during lessons. A natural athlete, Scott enjoyed a variety of sports as he grew up, but when he was 10 years old, he accompanied his father and brother to the local Judo club. The attraction was instantaneous. Idolising stars such as Bruce Lee and Jean-Claude Van Damme, Scott began to train everyday. He took over his Dad's garage and turned it into his own Dojo. He even had a shrine to Bruce Lee in there that he would bow to. He remembers being mugged on a bus when he was around 13 and that really kicked his training into overdrive. He wasn't ever going to let that happen again. At the age of 14, Scott went on to train in Tae Kwon Do under the instruction of Ron Sergiew with the T.A.G.B. After a few years, he moved on to Kickboxing under Anthony Jones. He is now a fully trained Kickboxing Instructor for the P.K.A. A self confessed \"film junkie\" Scott's attention was drawn to acting through the Hollywood Greats. He enrolled in a drama class at Sutton Coldfield College. Being a shy lad he initially found it difficult to be put on stage in front of an audience. Finally, at the age of 21, Scott was offered a place at the prestigious Webber Douglas Academy of Dramatic Art. However, as an impoverished student, he found it hard to make ends meet without a grant and was forced to leave without completing the course. Very dejected he thought that was the end. His first break came when he was offered a role in a Hong Kong martial arts film called Dei seung chui keung (2001) (aka Extreme Challenge). Spotted by Head of The Hong Kong Stuntmen Association and director Wei Tung and English-born Hong Kong movie expert Bey Logan, Adkins found himself in the East for the first time. Scott got the chance to work with some of Hong Kong cinema's leading action directors including Woo-Ping Yuen, Corey Yuen, Sammo Kam-Bo Hung and the legendary Jackie Chan. Acting roles started to come in and he was offered a guest role in BBC's Doctors (2000) filmed at Birmingham's Pebble Mill. A few episodes in BBC's EastEnders (1985) and City Central (1998), and a lead role in Sky One comedy drama Mile High (2003) followed by a regular role in BBC's Holby City (1999) as Bradley Hume, the assistant General Manager of Holby General. Starring roles in feature films soon followed with his portrayal of Talbot in Special Forces (2003) and Yuri Boyka\" in Undisputed 2: Last Man Standing (2006). It was this film that broke him into the mainstream with his villainous portrayal of a Russian MMA underground fighter Boyka in what has been hailed as one of the best American made Martial Arts films of recent times. Along with lead actor Michael Jai White, fight coordinator J.J. Perry and the slick direction of Isaac Florentine this movie has some unbelievably heart stopping fight scenes. After this Scott has had guest starring roles in bigger budget films like The Bourne Ultimatum (2007) and The Tournament (2009), and played Jean-Claude Van Damme's main adversary in Sony Pictures The Shepherd (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTQxMjMxNl5BMl5BanBnXkFtZTgwMTE1NzM0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0012078","name":"Scott Adkins","idIMDB":"nm0012078"},"actorId":"nm0012078","character":"John","urlCharacter":"http://www.imdb.com/character/ch0278445","main":true},{"actorName":"Mariah Bonner","urlProfile":"http://www.imdb.com/name/nm1751251","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk5ZjFkNzUtYjgyYS00MTM0LThjYTgtMWJiZDlkOTMwZTY2XkEyXkFqcGdeQXVyMjAwNzU1NzY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Mariah Bonner was born in Baltimore, Maryland, USA. She is an actress and producer, known for The Social Network (2010), Universal Soldier: Day of Reckoning (2012) and Lionne Blanche (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk5ZjFkNzUtYjgyYS00MTM0LThjYTgtMWJiZDlkOTMwZTY2XkEyXkFqcGdeQXVyMjAwNzU1NzY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1751251","name":"Mariah Bonner","idIMDB":"nm1751251"},"actorId":"nm1751251","character":"Sarah","urlCharacter":"http://www.imdb.com/character/ch0443646","main":true},{"actorName":"Andrei Arlovski","urlProfile":"http://www.imdb.com/name/nm1844999","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA4OTU2NjM5OV5BMl5BanBnXkFtZTgwMzI2MTczNzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1979","placeOfBirth":" Minsk, Byelorussian SSR, USSR [now Belarus]","height":"6' 4\" (1.93 m)","bio":"Andrei Arlovski was born on February 4, 1979 in Minsk, Byelorussian SSR, USSR. He is an actor, known for UFC 55: Fury (2005), UFC 59: Reality Check (2006) and UFC 47: It's On! (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA4OTU2NjM5OV5BMl5BanBnXkFtZTgwMzI2MTczNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1844999","name":"Andrei Arlovski","nicknames":["The Pit Bull"],"idIMDB":"nm1844999"},"actorId":"nm1844999","character":"Magnus","urlCharacter":"http://www.imdb.com/character/ch0435918","main":true},{"actorName":"Tony Jarreau","urlProfile":"http://www.imdb.com/name/nm4546627","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwODMxMDQ4M15BMl5BanBnXkFtZTgwNDI0MDUwNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Tony Jarreau is an actor, known for Universal Soldier: Day of Reckoning (2012), Dragon Eyes (2012) and Making the Grade (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwODMxMDQ4M15BMl5BanBnXkFtZTgwNDI0MDUwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4546627","name":"Tony Jarreau","idIMDB":"nm4546627"},"actorId":"nm4546627","character":"Bouncer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Craig Walker","urlProfile":"http://www.imdb.com/name/nm0907648","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzczMjUwMmItZDBjNi00Nzk4LTgyMjEtOTE4NTJiNWZjYWFmXkEyXkFqcGdeQXVyNDA0NzM4OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Craig Walker grew up in Hamden, Connecticut and attended Hamden High School. He went on to study acting at Syracuse University's School of Visual & Performing Arts with Arthur Storch. Craig came to New York City in 1991. A few years later he started aTheaterco. on 26th Street in the Chelsea neighborhood. One Dog Day was Craig's first film written and directed by John Hyams who he first met at aTheaterco. Craig is best known for his numerous Guest Star roles on the Law & Order series. Craig continues to live in downtown Manhattan with his wife and 2 children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzczMjUwMmItZDBjNi00Nzk4LTgyMjEtOTE4NTJiNWZjYWFmXkEyXkFqcGdeQXVyNDA0NzM4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0907648","name":"Craig Walker","idIMDB":"nm0907648"},"actorId":"nm0907648","character":"Earl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrew Sikking","urlProfile":"http://www.imdb.com/name/nm0797723","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjY0MDk1N15BMl5BanBnXkFtZTgwNTc5MTY5NjE@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1969","placeOfBirth":" Los Angeles, California, USA","bio":"Andrew Sikking was born on December 12, 1969 in Los Angeles, California, USA. He is an actor and producer, known for Spanglish (2004), Universal Soldier: Day of Reckoning (2012) and One Dog Day (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjY0MDk1N15BMl5BanBnXkFtZTgwNTc5MTY5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0797723","name":"Andrew Sikking","idIMDB":"nm0797723"},"actorId":"nm0797723","character":"Larry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James DuMont","urlProfile":"http://www.imdb.com/name/nm0003069","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTc3MDc0NF5BMl5BanBnXkFtZTgwMjEwNjk0MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 August 1965","placeOfBirth":"","height":"5' 9\" (1.75 m)","bio":"Actor/Producer James DuMont is one of the busiest performers in & out Hollywood, working in both feature films and television. He recently snagged the supporting lead role of J. Parnell Thomas in the autobiographical feature, Trumbo opposite Bryan Cranston, directed by Jay Roach & WB Nowlin in the Hank Williams bio-pic I Saw The Light opposite Tom Hiddleston as well as recurring for a 2nd season on the F/X series American Horror Story. DuMont's most recent supporting role was as Rayon's father opposite Oscar winner, Jared Leto in Focus Features' Dallas Buyers Club and in director Lee Daniels' The Butler, portraying Chief of Staff Sherman Adams opposite Robin Williams' Dwight D. Eisenhower. DuMont also appeared in TriStar Pictures' When the Game Stands Tall with Jim Caviezel and Laura Dern and Corporal Dooley in the James Brown bio-pic, Get On Up, starring Chadwick Boseman. James can be seen in the indie thriller Catch Hell starring Ryan Phillippe, which is also his directorial debut and this summer in the highly anticipated Jurassic World. Mr. DuMont can next be seen in Little Boy starring Emily Watson and Tom Wilkinson from Open Road Pictures and the indie comedy Mind Puppets starring Kevin Pollak & Vinne Jones. DuMont had a supporting role in Barefoot, opposite Evan Rachel Wood & Scott Speedman; Baytown Outlaws, with Billy Bob Thornton and Eva Longoria; and Jean-Claude Van Damme and Scott Adkins' Universal Soldier - Day of Reckoning. On the small screen, DuMont had recurring roles as Foster on this season's American Horror Story-Freak Show & Dr. Morrison on America Horror Story-Coven, and he completed his fourth and final season as Captain Richard La Fouchette on the critically-acclaimed HBO series, Treme, working opposite Oscar-winning actress Melissa Leo. Prior to that, he had a recurring role opposite Ray Romano on TNT's Men of a Certain Age. DuMont was recently seen in the Hallmark movie, Remember Sunday on ABC, with Zachary Levi and the Lifetime/History Channel mini-series, Bonnie and Clyde. Born and raised in Chicago and New York City attended Boston University then left for New York City, DuMont worked steadily in theater, discovered Buddhism (which he still practices today) and made his Broadway debut in Six Degrees of Separation (which required nudity for the part). Journalist George Plimpton wrote a piece for Esquire magazine about James and his experience as \"the Nudist Buddhist.\" After Six Degrees of Separation closed, DuMont performed opposite Mary Louise Parker, Brooke Smith and Sam Robards in Throwing Your Voice, a role that won him a rave review from the New York Times. DuMont then decided to \"go nude\" once more in the national tour of Six Degrees of Separation. When that tour ended, DuMont moved to Los Angeles, where he produced award-winning plays and started booking television acting gigs on The George Carlin Show, Lois & Clark, Grey's Anatomy, Mad Men, Rizzoli and Isles, Harry's Law and Desperate Housewives. On the film front, his early feature credits included Speed, S.W.A.T., Catch Me If You Can, War of the Worlds, Seabiscuit and Ocean's 13. DuMont, meanwhile had started to produce shorts and features. His short film, The Confession, won 20 of 25 international film festivals with documentary filmmaker Michael Moore calling it \"one of the darkest, funniest shorts I have ever seen.\" DuMont also co-produced Statistics, winner of the Audience Award at the Silverlake Film Festival. He also starred in and produced the critically-acclaimed stage production, Serious Games & Morphic Resonance, which won both the L.A. Weekly Award for Best Ensemble and the Los Angeles Times 'Critic's Choice Award.' With over 100 major feature films and television shows under his belt, DuMont's career is showing no signs of slowing down. He's currently developing feature films with producing partners in New York City, Los Angeles and Louisiana, his own Web Series while revising & adapting his one-man play, My Life as a DJ into a feature film. Currently living in both Los Angeles and New Orleans, DuMont considers himself to be \"Bayou Coastal.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTc3MDc0NF5BMl5BanBnXkFtZTgwMjEwNjk0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003069","name":"James DuMont","nicknames":["Jimmy Dime"],"idIMDB":"nm0003069"},"actorId":"nm0003069","character":"Dr. Brady","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Jensen","urlProfile":"http://www.imdb.com/name/nm0003861","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3OTkzMzQ5MV5BMl5BanBnXkFtZTgwNTEwOTMxMTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1952","placeOfBirth":" Pinckneyville, Illinois, USA","height":"5' 10\" (1.78 m)","bio":"Character actor David Jensen born in DuQuoin, Illinois. Studied theater at LSU with John Dennis and worked the early film work of Steven Soderbergh culminating with Schizopolis a low budget comedy in the spirit of Richard Lester and Bunuel. Known for The Mist, Midnight Special, Benjamin Buttons, Love Song for Bobby Long.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3OTkzMzQ5MV5BMl5BanBnXkFtZTgwNTEwOTMxMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003861","name":"David Jensen","idIMDB":"nm0003861"},"actorId":"nm0003861","character":"Dr. Su","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Audrey P. Scott","urlProfile":"http://www.imdb.com/name/nm3716878","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDE2Njc1M15BMl5BanBnXkFtZTgwNjEwOTU2MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Audrey Paris Scott","bio":"Audrey Scott made her screen debut at the age of 7 playing the younger version of Diane Lane in Disney's Secretariat then quickly moved to the ABC Family movie Revenge of the Bridesmaids. Her first leading role came at the age of 8 when she was cast in the independent film About Sunny (known as Think of Me during it's festival run) where she played \"Sunny\" opposite Lauren Ambrose. Following the film's premiere at the Toronto Film Festival, Audrey received several favorable critical reviews for her work including being lauded for her \"quietly natural thesping\" by Variety. For a teenager, she has had the opportunity to work alongside some of the most talented actors, writers and directors in the film and television industry. In 2011 she starred alongside Academy Award winner Ernest Borgnine, Academy Award nominee June Squibb and Independent Spirit Award nominee Dale Dickey in the independent film The Man Who Shook the Hand of Vicente Fernandez. The L.A. Times praised her performance and noted \"the unsentimental chemistry between them (Scott and Borgnine) is the strongest element of the film\". Audrey also appeared opposite Jean-Claude Van Damme in Universal Soldier: Day of Reckoning, which was recognized by Indiewire as one of their top ten films of 2012. She also had the opportunity to play the younger version of Amy Poehler in NBC's Parks & Recreation that same year. Audrey played the role of \"Young Karen\" (series regular) in the 2014 FOX pilot Fatrick, written by Nahnatchka Khan and Corey Nickerson and directed by the Academy Award winning duo Nat Faxon and Jim Rash (The Descendants). In the independent film Goodbye To All That, which was written and directed by Angus MacLachlan (Junebug), she received critical praise for her performance in the Washington Post, Forbes, RogerEbert.com, IndieWire and Variety. The film premiered at the Tribeca Film Festival in 2014. Born in Spartanburg, South Carolina and an only child, Audrey lives with her parents and her dog, Porter, in Houston, Texas. She is an A/P honors student and attend TCAH. In her spare time, she can often be found roaming the paleontology hall of her beloved HMNS, rapping to the soundtrack of \"Hamilton\" and hitting up the makeup counters for the latest shade of vintage lipstick. A self-proclaimed nerd, Audrey is an avid reader, world-traveler, math geek and considers herself a \"professional fangirl\" of Greek mythology, superhero comics and dystopian fiction novels.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDE2Njc1M15BMl5BanBnXkFtZTgwNjEwOTU2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3716878","name":"Audrey P. Scott","idIMDB":"nm3716878"},"actorId":"nm3716878","character":"Emma","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rus Blackwell","urlProfile":"http://www.imdb.com/name/nm0085952","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NDY2NjgwNV5BMl5BanBnXkFtZTcwMzExODM3Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 March 1963","placeOfBirth":" Rockford, Illinois, USA","height":"6' 1\" (1.85 m)","bio":"Rus Blackwell started his acting career in New York, training at Circle in the Square Theatre School and working on stage. Blackwell has built a solid resume over the years and has had the good fortune to work with a number of the industry's top professionals. A tireless work ethic and endless passion make Rus a compelling actor with a terrific range. His work includes roles in the Oscar and Emmy award-winning projects Monster, The Curious Case of Benjamin Button, HBO's Recount and From the Earth to the Moon. Most notably Rus played District Attorney Gordon Hopewell on the Cinemax series Banshee.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NDY2NjgwNV5BMl5BanBnXkFtZTcwMzExODM3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0085952","name":"Rus Blackwell","idIMDB":"nm0085952"},"actorId":"nm0085952","character":"Agent Gorman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dane Rhodes","urlProfile":"http://www.imdb.com/name/nm1694797","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzIyMzIzNl5BMl5BanBnXkFtZTcwNjE0NzcyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Dane is an actor and director in New Orleans La. He has appeared on stages and in films around the world. Some of his favorite experiences have included working on a world premier play called MAcbeth at the Gates with Roy Marsden and his friend David Lumsden and getting to work with John Travolta, Scarlette Johannson, and Shanie Gable on A Love Song for Bobby Long (the movie that launched his journey into film). When he isn't chasing his career, he is chasing his dog Hunter around the Big Easy... his home away from home.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NzIyMzIzNl5BMl5BanBnXkFtZTcwNjE0NzcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1694797","name":"Dane Rhodes","idIMDB":"nm1694797"},"actorId":"nm1694797","character":"Ron Castellano","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susan Mansur","urlProfile":"http://www.imdb.com/name/nm3501428","urlPhoto":"","biography":{"bio":"Susan Mansur is an actress, known for Universal Soldier: Day of Reckoning (2012), Abel's Field (2012) and 5 Time Champion (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3501428","name":"Susan Mansur","idIMDB":"nm3501428"},"actorId":"nm3501428","character":"Madame","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kris Van Damme","urlProfile":"http://www.imdb.com/name/nm0888157","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MzkwMDY5N15BMl5BanBnXkFtZTcwNzc0MzAyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 May 1987","placeOfBirth":" Los Angeles County, California, USA","birthName":"Kristopher Julien Van Varenberg","height":"6' 1½\" (1.87 m)","bio":"Kristopher van Varenberg (aka \"Kris Van Damme\") is the first son of martial arts/action superstar, Belgian-born actor Jean-Claude Van Damme with fitness expert/actress Gladys Portugues. Kristopher has a younger sister, Bianca Brigitte VanDamme and another brother with Van Damme's ex-wife Darcy LaPier, named Nicolas. Kristopher first faced the camera in Universal Soldier (1992) as Young Luc Deveraux followed by The Quest (1996) -first film directed by Van Damme- in which he portrayed the character of Young Chris. He got his first acting role in Derailed (2002) then resumed his acting career in Universal Soldier: Regeneration (2009) and Soldiers (2010) -directed by Jean-Claude Van Damme. In an exclusive interview with Kristopher by the Int'l JCVD Forum, he said that he also has passion for writing and directing besides his career as an actor. He was credited as a writer for the first time in Van Damme's martial arts epic movie known as The Tower (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MzkwMDY5N15BMl5BanBnXkFtZTcwNzc0MzAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0888157","name":"Kris Van Damme","idIMDB":"nm0888157"},"actorId":"nm0888157","character":"Miles","urlCharacter":"http://www.imdb.com/character/ch0278447","main":true}],"seasons":[],"idIMDB":"tt1659343","urlIMDB":"http://www.imdb.com/title/tt1659343","business":{"budget":{"money":"$11,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$3,181","country":"USA","day":"02","month":"12","year":"2012","remarks":"3 Screens"},{"money":"$3,181","country":"USA","day":"30","month":"11","year":"2012","remarks":"3 Screens"},{"money":"$363,719","country":"Russia","day":"04","month":"10","year":"2012","remarks":"420 Screens"},{"money":"$1,673","country":"Singapore","day":"06","month":"10","year":"2013","remarks":"1 Screen"},{"money":"$75,919","country":"Turkey","day":"30","month":"11","year":"2012","remarks":"90 Screens"},{"money":"$10,478","country":"Ukraine","day":"11","month":"10","year":"2012","remarks":"48 Screens"},{"money":null,"country":null,"day":"06","month":"12","year":"2012","remarks":"34 Screens"}],"gross":[{"money":"$5,247","country":"USA","day":"16","month":"12","year":"2012","remarks":""},{"money":"$4,928","country":"USA","day":"06","month":"12","year":"2012","remarks":""},{"money":"$3,181","country":"USA","day":"02","month":"12","year":"2012","remarks":""},{"money":"$271,024","country":"Italy","day":"17","month":"08","year":"2014","remarks":""},{"money":"$624,724","country":"Russia","day":"21","month":"10","year":"2012","remarks":""},{"money":"$584,410","country":"Russia","day":"14","month":"10","year":"2012","remarks":""},{"money":"$363,719","country":"Russia","day":"06","month":"10","year":"2012","remarks":""},{"money":"$2,770","country":"Singapore","day":"13","month":"10","year":"2013","remarks":""},{"money":"$138,232","country":"Turkey","day":"09","month":"12","year":"2012","remarks":""},{"money":"$75,919","country":"Turkey","day":"02","month":"12","year":"2012","remarks":""},{"money":"$31,349","country":"Ukraine","day":"14","month":"10","year":"2012","remarks":""},{"money":null,"country":null,"day":"08","month":"12","year":"2012","remarks":""}],"weekendGross":[{"money":"$319","country":"USA","day":"16","month":"12","year":"2012","remarks":"2 Screens"},{"money":"$3,181","country":"USA","day":"02","month":"12","year":"2012","remarks":"3 Screens"},{"money":"€21,916","country":"Italy","day":"03","month":"08","year":"2014","remarks":"3 Screens"},{"money":"$7,100","country":"Russia","day":"21","month":"10","year":"2012","remarks":"25 Screens"},{"money":"$141,562","country":"Russia","day":"14","month":"10","year":"2012","remarks":"403 Screens"},{"money":"$142,475","country":"Russia","day":"11","month":"10","year":"2012","remarks":"403 Screens"},{"money":"$363,719","country":"Russia","day":"06","month":"10","year":"2012","remarks":"420 Screens"},{"money":"$15,352","country":"Turkey","day":"09","month":"12","year":"2012","remarks":"67 Screens"},{"money":"$75,919","country":"Turkey","day":"02","month":"12","year":"2012","remarks":"90 Screens"},{"money":"$10,478","country":"Ukraine","day":"11","month":"10","year":"2012","remarks":"48 Screens"},{"money":null,"country":null,"day":"06","month":"12","year":"2012","remarks":"34 Screens"}],"admissions":[{"money":"50,025 (Italy)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"78,027 (Russia)","country":"","day":null,"month":null,"year":null,"remarks":null}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"09","month":"05","year":"2011","remarks":null},{"money":null,"country":null,"day":"19","month":"06","year":"2011","remarks":null}],"copyrightHolder":"© 2012 Unisol 4 Distribution, LLC."},"technical":{"runtime":["1 hr 54 min (114 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["3Ality Technica Quasar 3D Rig","Red Epic, Angenieux Optimo Lenses (P+S Freestyle 3D rig)","Red One Camera"],"laboratory":["DeLuxe"],"filmLength":null,"negativeFormat":["Redcode RAW"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Redcode RAW (5K) (dual-strip 3-D) (source format)"],"printedFilmFormat":null},"rating":"5.0","metascore":"58","filmingLocations":[{"location":"Baton Rouge, Louisiana, USA"}],"rated":"R","awards":[],"votes":"16,744","type":"Movie","companyCreditsSimple":[{"idCompany":"co0139768","name":"Foresight Unlimited"},{"idCompany":"co0119730","name":"Signature Pictures"},{"idCompany":"co0191075","name":"Baumgarten Management and Productions (BMP)"}],"keywords":{"keywords":["army","home invasion","combat","fight","church","coma","implanted memory","vomiting","plumber","first person perspective","raw fights","limousine","ski mask","security camera","surveillance","abandoned mine","foot chase","super strength","stabbed in the shoulder","stabbed in the leg","stabbed in the back","stabbed in the face","held at gunpoint","photograph","cabin","laboratory","mad scientist","blood on camera lens","throat slitting","strangulation","showdown","revelation","knife","knife fight","stick fight","chase","tough guy","one against many","long take","one man army","action hero","anti hero","severed head","decapitation","bar","motel","ex boyfriend ex girlfriend relationship","world domination","military","mercenary","spy","undercover agent","undercover","fbi agent","fbi","machismo","head butt","gunfight","brawl","fistfight","mixed martial arts","subliminal message","hazing","fight to the death","stylized violence","assassin","female nudity","male rear nudity","bare butt","rape","male nudity","militia","revenge","genetic engineering","death","machine gun","ak 47","cloning","false memory","waking up from a coma","hospital","subjective camera","fourth part","clone","rough sex","character's point of view camera shot","hiding behind a door","breaking a bottle over someone's head","impalement","nude man murdered","female frontal nudity","stabbed in the hand","stabbed through the chin","shot in the neck","stabbed in the neck","stabbed in the chest","shot in the leg","head stomp","kicked in the head","neck breaking","double barreled shotgun","beaten to death","punched in the face","beating","shot in the face","flashback","stabbed to death","stabbed in the arm","stabbed in the head","machete","head blown off","exploding head","hit with a baseball bat","shot in the shoulder","shot in the chest","shotgun","prostitute","interracial sex","killed during sex","nude woman murdered","shot to death","shot in the back","bare chested male","shot in the forehead","brothel","female rear nudity","pistol","shot in the head","murder","soldier","hand to hand combat","brutality","martial arts","slow motion scene","gore","blood","violence","gun violence","shootout","sequel","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:00:04"}}