{"data":{"movies":[{"title":"A Kind of Alaska","originalTitle":"","year":"1984","releaseDate":"19841216","directors":[{"name":"Kenneth Ives","id":"nm0412339"}],"writers":[{"name":"Harold Pinter","id":"nm0056217"}],"countries":["UK"],"languages":["English"],"genres":["Drama"],"simplePlot":"","actors":[{"actorName":"Susan Engel","urlProfile":"http://www.imdb.com/name/nm0257146","urlPhoto":"","biography":{"dateOfBirth":"25 March 1935","placeOfBirth":" Vienna, Austria","height":"5' 9\" (1.75 m)","bio":"Susan Engel was born on March 25, 1935 in Vienna, Austria. She is an actress, known for The Cedar Tree (1976), Damage (1992) and King Lear (1971). She has been married to Sylvester Morand since 1968. They have one child.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0257146","name":"Susan Engel","idIMDB":"nm0257146"},"actorId":"nm0257146","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Scofield","urlProfile":"http://www.imdb.com/name/nm0006890","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODg0NjA0OF5BMl5BanBnXkFtZTcwNzA5ODM2MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 January 1922","placeOfBirth":" Hurstpierpoint, West Sussex, England, UK","birthName":"David Paul Scofield","height":"6' (1.83 m)","bio":"Though his number of film roles amount to a bit over 30, Paul Scofield has cast a giant shadow in the world of stage and film acting. He grew up in West Sussex, the son of a schoolmaster. He attended the Varndean School for Boys in Brighton. The love of acting came early. While still high school age, he began training as an actor at the Croydon Repertory Theatre School (1939) and then at the Mask Theatre School (1940) in London. He took on all the experience he could handle by joining touring companies and also entertained British troops during World War II. He joined the Birmingham Repertory Theatre and, from there in 1946, he moved to Stratford-upon-Avon. There, in the birthplace of William Shakespeare, he had his first great successes. He had the title role in \"Henry V\"; he was \"Cloten\" in \"Cymbeline\"; \"Don Adriano de Armado\" in \"Love's Labour's Lost\", \"Lucio\" in \"Measure for Measure\", and then \"Hamlet\". And there were many more as he honed himself into one the great Shakespearean actors of the 20th century. With a rich, sonorous voice compared to a Rolls Royce being started up, in one instance, and a great sound rumbling forth from an antique crypt in yet another, he was quickly compared to Laurence Olivier. Scofield did not move on to commercial theater until 1949, when he took the lead role of \"Alexander the Great\", in playwright Terence Rattigan's unfortunately ill-received \"Adventure Story\". And as he continued theater work, he moved toward film very carefully. From his first in 1955, Scofield was always - as with any of his acting assignments - extremely picky about accepting a particular role. It was three years before his second film. Meanwhile, Scofield had the opportunity to play a great lead part in a new play by a schoolmaster-turned-new-playwright, Robert Bolt. The play was \"A Man for All Seasons\" and Scofield's choice role was that of \"Sir Thomas More\", the great English humanist and chancellor, who defied the ogre \"King Henry VIII\" in his wish to put aside his first wife for \"Anne Bolyne\". It was a once in a lifetime part, and Scofield debuted it in London in 1960. His only appearance on Broadway was the next year in that play, which ran into 1962. It was no surprise that the work began garnering awards for him (see Trivia below for details on theater and film awards). He returned to Shakespeare in 1962 with Peter Brook, the noted British director and producer, directing him as \"Lear\" at the newly formed Royal Shakespeare Company (RSC) at Stratford. This was a pioneering minimalist production, one of the first \"bare stage\" efforts - though things were pretty bare stage in Shakespeare's day. Scofield then did \"Coriolanus\" and \"Love's Labour's Lost\" for the Shakespeare Festival in Stratford, Ontario in 1963. His third film came six years after his second screen appearance (1958). This was his standout performance in Le train (1964), a production of his co-star, Burt Lancaster, that grew in size and budget with the entrance of Lancaster's second choice for director, John Frankenheimer. Some of the difficulties involved might have turned someone of Scofield's discipline back to the stage thereafter, but the filming of \"Seasons\" arrived, and he would hardly refuse. With Robert Bolt handling the screenplay and a superlative supporting cast, the film version of A Man for All Seasons (1966) collected some thirty-three international awards, including a three-statue sweep of prime-Oscar categories plus another three for good measure. Scofield was unforgettable as the incisive man of state, able to juggle the volatile politics of the time but always keep his honor and so brimming with faith as to endure the inevitably mounting tide against him. It suited Scofield for a time to keep his screen-acting to adaptations of plays, books, and ensemble pieces fitted to the big screen. Peter Brook and he teamed again for a film version of the Brook-adapted play Tell Me Lies (1968). The adaptation of Herman Melville's Bartleby (1970), despite Scofield's efforts, did not wash as an attempt to update Melville's story in the late twentieth century. Then Brook was back again to finally attempt what he said had really never been done correctly -adapting Shakespeare to film. Scofield's 1962 \"Lear\" was held in high esteem, and Brook decided on a film version, King Lear (1971), an even more uncompromising, even uncomfortable, desolation staging and editing of the tragedy. Despite some oddball camera work and not wholly satisfying adapting of the play, Scofield was magnificent and got his chance to show that he is perhaps the best Lear of modern times. While still keeping a concerted interest in filmed play adaptations, Scofield could be lured into more typical screen drama. He joined former co-star, Burt Lancaster, for the spy thriller, Scorpio (1973), as a memorable Russian comrade of Lancaster from the days of World War II, caught in late-Cold War spy craft brutality. Through the 1980s, Scofield did a mix of TV and film on both sides of the Atlantic. But he was drawn back to Shakespeare and filming efforts, though in humbler parts, first in the Henry V (1989) of ambitious Kenneth Branagh, as the French king, and, the next year, in the Franco Zeffirelli, Hamlet (1990), as \"The Ghost\" - with the real buzz being for Mel Gibson as the dour \"Prince of Denmark\". Both films were well-crafted with impressive supporting casts. And Scofield could be content that as with all his roles, he was remaining consistent with himself as his own best judge of how to challenge his acting gifts. Gibson was appropriately awed, saying that working with Scofield was like being \"thrown into the ring with Mike Tyson\" (that is, Mike Tyson then, not now). Through the 1990s, he enjoyed his continued sampling of all acting media, even radio narration and animation voice-over. The matter of British actors weighing upon the acceptance of knighthoods for their work began most publicly with Scofield. In 1956, after his tour of \"Hamlet\" with a triumph in Moscow, he gratefully accepted the appointment as a Commander of the Order of the British Empire (CBE), but thereafter he refused on three occasions the offer of knighthood. \"If you want a title, what's wrong with Mr.? If you have always been that, then why lose your title? \"I have a title, which is the same one that I have always had. But it's not political. I have a CBE, which I accepted very gratefully\". He said this with great simplicity and charm. The matter of 'theatrical nobility' has prompted others to follow Scofield's example. One high profile example with a twist is actor Anthony Hopkins, now an American citizen, who quipped that he only accepted the knighthood because his wife wanted him to do so. In taking the oath of citizenship, Hopkins pledged to \"renounce the title of nobility to which I have heretofore belonged\". But Scofield's demeanor in his logically crafted refusals from the first so fit this man's very private life. Yet quite averse to being interviewed, he has always been considerate to the public for their patronage. Brilliant man and acting legacy, on and off the stage, Paul Scofield truly is a \"Man for All Seasons\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODg0NjA0OF5BMl5BanBnXkFtZTcwNzA5ODM2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006890","name":"Paul Scofield","idIMDB":"nm0006890"},"actorId":"nm0006890","character":"Dr. Hornby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dorothy Tutin","urlProfile":"http://www.imdb.com/name/nm0878302","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMTcxNDMwNl5BMl5BanBnXkFtZTgwODEyNzI0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1930","placeOfBirth":" London, England, UK","height":"5' 4½\" (1.64 m)","bio":"Dame Dorothy Tutin's esteemed company of peers included other remarkable dames, including Judi Dench and Maggie Smith. Unlike these others, Dorothy had limited screen time over the years and would develop the respect but not the stardom afforded the other two outside the realm of the theatre. Dorothy was born in London on April 8, 1930, the daughter of John and Adie Evelyne (Fryers) Tutin. Educated at St. Catherine's, she studied for the stage at PARADA and RADA, making her debut performance as \"Princess Margaret\" in \"The Thistle and the Rose\" on September 6, 1949. In the early 1950s, she joined both the Bristol and London Old Vic companies where she rose in stature with secondary roles in \"As You Like It\", \"The Merry Wives of Windsor\", \"Henry V\" and \"Much Ado About Nothing\". She later demonstrated her versatility outside the classics when she originated the role of \"Sally Bowles\" in \"I Am a Camera\" in 1954 and later played \"Jean Rice\" in \"The Entertainer\" in 1957. Great promise was held for Dorothy after an auspicious film debut as \"Cecily Cardew\" in the classic Oscar Wilde play The Importance of Being Earnest (1952). Despite sterling film portrayals of \"Polly Peachum\" opposite Laurence Olivier's \"Macheath\" in The Beggar's Opera (1953) and \"Lucie Manette\" in a remake of A Tale of Two Cities (1958) with Dirk Bogarde, Dorothy abruptly left the cinema to return to the comforts of a live stage. She continued to play all the illustrious Shakespearean femmes (Juliet, Desdemona, Rosalind, Ophelia, Portia, Cressida) during her excursions with the Shakespeare Memorial Theatre and Royal Shakespeare companies, and won the coveted Evening Standard award for her \"Viola\" in \"Twelfth Night\" in 1960. During this time, she returned to the role of \"Polly Peachum\", this time on stage, in 1963, and won acclaim for her \"Queen Victoria\" in \"Portrait of a Queen\" in 1965. She took the role to Broadway in 1968 and won a Tony nomination. In the 1970s, she appeared in everything from Harold Pinter plays to \"Peter Pan\". Though her film and TV output was limited, the performances Dorothy gave during these sporadic occasions were nothing less than astonishing. Included among these triumphs has to be her \"Anne Boleyn\" opposite Keith Michell as one of The Six Wives of Henry VIII (1970), and \"Goneril\" in Laurence Olivier's heralded adaptation of King Lear (1983). In a rare and rather bizarre moment on film, she top-lined one of Ken Russell's quirky biopics of the 1970s, the flop-turned-cult classic Savage Messiah (1972), in which she played a Polish noblewoman married to the much younger sculptor, \"Henri Gaudier-Brzeska\". In later years, Dorothy enhanced several costumed TV movies with an always fascinating grande dame eloquence. An intriguing \"Desiree Armfeldt\" in \"A Little Night Music\" in 1989 and both an Evening Standard and Laurence Olivier Award winner for her superlative work in \"A Month in the Country\", Dorothy took her final curtain in a revival of \"The Gin Game\" opposite Joss Ackland in 1999. Honored with the title \"Commander of the British Empire\" in 1967, she was made a \"Dame\" for her services to the theatre in the 2000 New Year Honors. Diagnosed with leukemia, Dame Dorothy died on August 6, 2001, at the Edward VII Hospital in London. She was survived by her actor husband (since 1963) Derek Waring and their two children, Amanda Waring and Nick Waring, both of whom are actors. Daughter Amanda, in fact, occasionally appeared as younger versions of her mother on TV during the 1990s and went on to gain a bit of fame for herself as a musical \"Gigi\". Her husband died in 2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMTcxNDMwNl5BMl5BanBnXkFtZTgwODEyNzI0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0878302","name":"Dorothy Tutin","idIMDB":"nm0878302"},"actorId":"nm0878302","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1652993","urlIMDB":"http://www.imdb.com/title/tt1652993","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":null,"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"filmingLocations":[],"awards":[],"type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0103328","name":"Central Independent Television"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:49:56"}}