{"data":{"movies":[{"title":"Axe to Grind","originalTitle":"","year":"2015","releaseDate":"20150203","directors":[{"name":"Matt Zettell","id":"nm0955184"}],"writers":[{"name":"George O Gomez","id":"nm5605458"},{"name":"J.P. Linde","id":"nm3354986"}],"runtime":"84 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMTIyODU5MV5BMl5BanBnXkFtZTgwMjIwNzA0MDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Thriller"],"plot":"Horror B-movie legend Debbie Wilkins (Debbie Rochon) has just been replaced in her lover's bed by the newest young scream queen. Making matters worse, the same hottie has been cast in Debbie's comeback role! Debbie doesn't handle rejection well. Debbie shows up on set of the 'skintillating' low budget horror film to confront and dispatch of those responsible. No one is the cast or crew is safe from her sharp vengeance.","simplePlot":"B-movie legend, actress Debbie Wilkins, has just been replaced by a 23 yr old scream queen in her lovers bed. More importantly she's been left out of her lovers new film. Debbie doesn't take rejection well.","actors":[{"actorName":"Debbie Rochon","urlProfile":"http://www.imdb.com/name/nm0004193","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzIyNDAyMDY2NF5BMl5BanBnXkFtZTcwNTY1MzEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1968","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"Debbie Ann Rochon","height":"5' 5\" (1.65 m)","bio":"Debbie Rochon grew up in British Columbia, Canada. She was a child of the streets and victim of much abuse until she accidentally ended up in a featured extra role in Paramount's Ladies and Gentlemen, the Fabulous Stains (1982)! The event changed her life, and she saved enough money to move to New York City and study acting. After many years working with numerous theater companies in off-Broadway plays, she started to land small roles in films. Spike Lee's editor Barry Alexander Brown cast her in a featured role in his first directing effort, Lonely in America (1990). Soon the parts grew bigger and bigger and primarily fell in the fear flick genre. Since then Debbie has starred in dozens of horror movies and has gained cult stardom worldwide. Since 1994, she has acted in various roles in Lloyd Kaufman's Troma Productions, most notably Tromeo and Juliet (1996) and Terror Firmer (1999), as well as many other independent straight-to-DVD horror flicks in lead, supporting and minor parts. Although she is mostly associated with creepy features and thrillers because of her evenly-shaped, dark-haired appearance, she has garnered acclaim for her turns in comedy and drama. She has also co-hosted a number of radio shows in New York City that focused on film and pop culture. Debbie co-hosted and co-produced the radio show Oblique Strategies with Peter Schmedig on WBAI a terrestrial radio station which aired out of NYC from 1994-1996. Debbie also co-hosted and co-produced the Internet radio show Illumination Gallery with Peter Schmedig for Pseudo Radio out of NYC from 1996-1998. Debbie worked for the Internet radio station Eyada.com from 1999-2001 producing many radio programs including Page Six's Richard Johnson's show, Chaunce Hayden's show and Lionel's show. She also had her own program she co-hosted and co-produced at Eyada with Tim Reid called The Tim Reid and Debbie Rochon Movie Show. Eyada was also based in NYC. Debbie then co-hosted and co-produced the Fangoria Radio show with Dee Snider, frontman for Twisted Sister, on Sirius satellite radio from 2006-2010 out of NYC. Debbie acts in film and writes for Fangoria magazine, her Rondo Award winning column is called Diary of the Deb, she also pens for The Phantom of the Movies' Videoscope magazine.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzIyNDAyMDY2NF5BMl5BanBnXkFtZTcwNTY1MzEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004193","name":"Debbie Rochon","nicknames":["The Scream Queen","The Queen of Horror","Cult Movie Actress","The Meryl Streep of Horror."],"idIMDB":"nm0004193"},"actorId":"nm0004193","character":"Debbie Wilkins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Guy Torry","urlProfile":"http://www.imdb.com/name/nm0868956","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NzU4MjEwN15BMl5BanBnXkFtZTYwMjg4NjA0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1969","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Robert Torry","bio":"Guy Torry is a native of St. Louis, Missouri. Known as \"Torry\" by college friends, Guy attended Southeast Missouri State University, the alma mater of fellow comedian and St. Louisan, Cedric The Entertainer. His comic genius was evident to fellow students during these college years. Guy often held impromptu comedy \"slams\" in dorm breakrooms, leaving fellow students in stitches. Like his brother Joe, he left Missouri for Hollywood to find success in comedy and film. He actively supports his brother's \"Give Back The Love\" Foundation, a St Louis charity dedicated to helping disadvantaged children with basic needs such as clothes and school supplies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NzU4MjEwN15BMl5BanBnXkFtZTYwMjg4NjA0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0868956","name":"Guy Torry","idIMDB":"nm0868956"},"actorId":"nm0868956","character":"Eddie Wilcox","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matt Gulbranson","urlProfile":"http://www.imdb.com/name/nm2782855","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MDMzMzcwMF5BMl5BanBnXkFtZTcwMTQ1NTY4OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1964","placeOfBirth":" Grand Forks, North Dakota, USA","height":"6' 4½\" (1.94 m)","bio":"Matthew James Gulbranson is one of the most versatile actors in film and television having played a myriad of roles including an overwhelmed pharmacist, a sarcastic lawyer, no nonsense detective, corrupt cop, unscrupulous government agent, reluctant hero, tortured father, twisted B movie producer, as well as a few serial killers. A former U.S. Army lieutenant colonel, Matt has extensive military, diplomatic, and intelligence experience and is fluent in the Russian language. Matt mostly grew up in North Dakota and spent most of his time hanging out with his three brothers, Eric, Dan, and Jack, playing basketball, exploring the outdoors, fishing and swimming in the nearby lakes of Minnesota, and taking part in school and community theater. During his school days, Matt also resided in Madison, Wisconsin, Duluth, Minnesota, and Deadwood, South Dakota. He graduated fourth in his high school at Fairmount and was named First Team All State in Basketball. After one year of college at Wahpeton State School of Science, he decided to attend West Point in lieu of Shakespeare summer stock theater. At the United States Military Academy, he played wide receiver on the Brigade championship football team and received a Bachelor of Science degree in Russian language. He was commissioned a Second Lieutenant in the Military Police Corps and was eventually promoted to Lieutenant Colonel as a Russia-Eurasia Foreign Area Officer. Matt's assignments include platoon leader, 9th MP Company, Fort Lewis, Law and Order Operations Officer, Desert Storm, Company A Commander, 701st MP Battalion, Fort McClellan, Deputy Adjutant, 311th Corps Support Command, West Los Angeles, Full Time Support Chief, 63d Regional Support Command, Los Alamitos, Deputy Site Commander, On-Site Inspection Agency, Votkinsk, Russia, Chief, Office of Defense Cooperation, Moldova, Russian Airborne Brigade and US Stabilization Forces Commander LNO, Bosnia, U.S. Army Attache in Azerbaijan, Armenia, and Georgia, J2 Crisis Operations, Pentagon, Military Aadvisor for the Organization of Security and Cooperation in Europe, in Moldova and Vienna. Matt concluded his Army career working as the Saudi Arabia program director for the Defense Security Cooperation Agency. Matt has four children - Ashley, Gregory, Camryn, and Kirsten.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MDMzMzcwMF5BMl5BanBnXkFtZTcwMTQ1NTY4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2782855","name":"Matt Gulbranson","idIMDB":"nm2782855"},"actorId":"nm2782855","character":"Peter Burgess","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paula Labaredas","urlProfile":"http://www.imdb.com/name/nm0479334","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI4MzA1NzUwM15BMl5BanBnXkFtZTgwNTMzODA3ODE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1982","placeOfBirth":" Portugal","birthName":"Paula Maria Esteves Labaredas","height":"5' 5\" (1.65 m)","bio":"Paula Labaredas was born on July 6, 1982 in Portugal as Paula Maria Esteves Labaredas. She is an actress and producer, known for Selfie Girl a Barbie Girl Parody (2015), Axe to Grind (2015) and Showgirls 2: Penny's from Heaven (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI4MzA1NzUwM15BMl5BanBnXkFtZTgwNTMzODA3ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0479334","name":"Paula Labaredas","nicknames":["P","Paulinha"],"idIMDB":"nm0479334"},"actorId":"nm0479334","character":"Delilah Finn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michelle Tomlinson","urlProfile":"http://www.imdb.com/name/nm1009589","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MjkxMTI2NF5BMl5BanBnXkFtZTgwMjg2NjQ5OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1978","placeOfBirth":" Santa Fe, New Mexico, USA","bio":"Michelle Tomlinson was born and raised in Northern New Mexico. Heavily involved in Video Productions in High School, she flipped to the other side of the camera and began Acting Classes while attending Eastern New Mexico University. (Where she earned her BFA in Theatre Peformance.) Immediately upon graduation, she moved to Los Angeles, California to hone in on her craft and begin her career. She saturated herself in the Adler Technique taught by Arthur Mendoza and followed up with The Lyndon Technique taught by Amy Lyndon, who teaches an effective and unique Booking Technique. As a survivor of Papillary Thyroid Cancer, Michelle Tomlinson takes absolutely nothing for granted and is in this life to spread light, have fun, work hard and taste every moment to it's fullest. Listed on several Top Ten Hot B Movie Actresses Lists, Tomlinson has received rave reviews in several Feature Films that have not only hit Festivals, but some Theatres as well as DVD Releases. Although she is more known for her work in Indie Horror Feature Films such as The Cellar Door and Brain Dead. Tomlinson has also enjoyed juicy roles in Dramatic Indie Feature Films such as Undercurrent and Officer Down. She also plays the Series Lead in the Web Series \"Kung Fu Femmes\" and has been in several Short Films and Plays. Tomlinson also Coaches Actors of every age, ability and experience to not only book their own auditions but to learn more about the craft of Acting and how to get out of their own way and let the work speak through them. Equally enjoyed with Acting and Coaching, Tomlinson also Produces some of her own work. Known mostly for a couple of webisodes of \"The Misadventures of MCT & A\" with Kimberly Amato, Tomlinson is also about to launch her own Web Series that will start shooting in January of 2014 and another Short Film with Amato in May of 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MjkxMTI2NF5BMl5BanBnXkFtZTgwMjg2NjQ5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1009589","name":"Michelle Tomlinson","nicknames":["Mighty McT"],"idIMDB":"nm1009589"},"actorId":"nm1009589","character":"Cheryl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dani Thompson","urlProfile":"http://www.imdb.com/name/nm3457543","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NDczMjMzNV5BMl5BanBnXkFtZTgwNjAxMjAwMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 3\" (1.6 m)","bio":"Dani Thompson was born in Penrith, Australia. Her family moved to Norwich, England when she was age 2. Dani worked as a model for 6 years appearing in most of the British lads magazines and newspapers before going to The International School Of Screen Acting to do a Post Grad Diploma in Screen Acting. Dani now lives in London with her dog Dolly and is known as an actress who works mainly in the horror genre or a scream queen. She is also a columnist for After Dark Digital and Space Monsters Magazines.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NDczMjMzNV5BMl5BanBnXkFtZTgwNjAxMjAwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3457543","name":"Dani Thompson","idIMDB":"nm3457543"},"actorId":"nm3457543","character":"Nikki","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adrian Quihuis","urlProfile":"http://www.imdb.com/name/nm1073516","urlPhoto":"","biography":{"bio":"Adrian Quihuis is an actor and producer, known for Area 51 Confidential (2011), Untitled MF 6: Bring the Rukus (2011) and House of Manson (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1073516","name":"Adrian Quihuis","idIMDB":"nm1073516"},"actorId":"nm1073516","character":"Norman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony von Halle","urlProfile":"http://www.imdb.com/name/nm4189813","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGYzNTA1MGUtZGViYS00NWFhLWE0NGEtZTIzM2E3MGYzYzM3XkEyXkFqcGdeQXVyMjIxOTc5NjU@._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Tony von Halle is an actor and producer, known for Body of Proof (2011), Grand Theft Auto V (2013) and Casual (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGYzNTA1MGUtZGViYS00NWFhLWE0NGEtZTIzM2E3MGYzYzM3XkEyXkFqcGdeQXVyMjIxOTc5NjU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4189813","name":"Tony von Halle","idIMDB":"nm4189813"},"actorId":"nm4189813","character":"Lance","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rachael Robbins","urlProfile":"http://www.imdb.com/name/nm0730436","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MjQwMzE1Nl5BMl5BanBnXkFtZTYwNDIzMzcy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Rachael Nicole-Tyler Robbins","height":"5' 4\" (1.63 m)","bio":"Rachael Robbins was born as Rachael Nicole-Tyler Robbins. She is an actress and writer, known for Methodic (2007), Screaming Dead (2003) and Bikini Bloodbath Car Wash (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MjQwMzE1Nl5BMl5BanBnXkFtZTYwNDIzMzcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0730436","name":"Rachael Robbins","idIMDB":"nm0730436"},"actorId":"nm0730436","character":"Ginger Garson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kelsey Zukowski","urlProfile":"http://www.imdb.com/name/nm3857479","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUwNjYzMDE1NF5BMl5BanBnXkFtZTcwMzY3NDg4OQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Kelsey Zukowski is an experienced and passionate screenwriter, actress, and model, specializing in the horror genre through dark examination. Based in Los Angeles, she has worked on productions across the country, working heavily in the indie horror scene in Chicago as well as LA. Zukowski is most well-known for penning and co-starring in the surreal dark drama, \"What They Say\", winning awards at film festivals across the country. More recently her tale of real life horrors of bullying and abuse in the psychological slasher, \"Words Like Knives\", premiered at Blood at the Beach festival in Virginia Beach. Zukowski is working on the feature haunted house film, \"Within These Walls\", a gritty collaboration with filmmaker James Tucker, centering on a disturbing ghost story that brings out complete entrapment and relentless torment of one girl as she struggles to find her inner-strength (played by Zukowski). Zukowski is a huge believer in all that the horror genre is capable of. She strives to dive in to the good and the bad, the light and darkness, that surrounds us, in a creative, justifying sense through the genre. She eagerly ventures in to other genres, but her home is in horror. Zukowski was heavily inspired at an early age by the Halloween franchise, A Nightmare on Elm Street, and fellow Cleveland-native, Wes Craven's surreal and 'fighting through the mind' brand of horror in particular. Zukowski has a background in theater, having fallen in love with acting during a school production when she was 10. This love of acting proved to be a love of storytelling and the cinema in particular. When Zukowski was 14 she began writing film reviews, greatly inspired by the late Roger Ebert's writing style and ability to relay the entire movie going experience in his reviews. While still in high school in Ohio, Zukowski's film reviews were being published in the California-based newspaper, The Valley Voice. She has been a published film critic for the past 7 years writing for a variety of websites including Criticsword.com, HorrorYearbook.com, FilmArcade.net, DirectorsLive.com, TheCelebrityCafe.com, and 8th-circuit.com. She's written TV recaps, music and movie reviews, news stories, and has conducted interviews with independent film makers around the world. She has covered and shown appreciation for all types of films from low budget independent to Hollywood mainstream and always eager to highlight foreign films or unknown gems. Zukowski has a Bachelors of Arts in Digital Cinema with a concentration in Screenwriting from DePaul University. Shortly after graduating, Zukowski became involved with the independent film scene. Some of her earliest roles were in various productions of crime writer, Kevin Jamison's intense serial killer depictions, the throwback horror anthology \"Psycho Street\", and the Autumn Offering \"Born Dead\" music video, which aired on MTV2's Head Banger's Ball. From acting she bridged in to modeling, working heavily with alternative, pin-up, and glamor modeling. As in her writing, Zukowski is most drawn to thematic, stylistic modeling that has an artistic expression, human emotion, and creates a singular world within an image.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUwNjYzMDE1NF5BMl5BanBnXkFtZTcwMzY3NDg4OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3857479","name":"Kelsey Zukowski","idIMDB":"nm3857479"},"actorId":"nm3857479","character":"Young Debbie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tawny Amber Young","urlProfile":"http://www.imdb.com/name/nm2774589","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNjQ0Njg2Ml5BMl5BanBnXkFtZTcwNzQ5MTM2OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 February 1979","placeOfBirth":" Los Angeles County, California, USA","height":"5' 5\" (1.65 m)","bio":"Luscious and voluptuous brunette knockout Tawny Amber Young was born and raised in Orange County, California. She started modeling at age 13, and was a cheerleader in high school. Among the clients Young has worked as a spokesperson for are Mann's Chinese Theatre, San Mateo Hot Import Nights, Medieval Times, Buick Golf Classic, Street Fury Import Cars, Boot City and Diamond Bar Honda. She has modeled for such clients as TeaseUm.com, Valet Girls, Sports Cellar.com, Estudio 2, and Hustler Bar and Grill. She's featured in the 2003 and 2005 \"Cougars and Kittens\" calendars. Young appears as a dancer in the music video for \"Promise\" by Eve 6 and has worked as a go-go dancer for holiday parties held at the Playboy mansion. She was featured as herself on four episodes of the reality TV series Rock of Love with Bret Michaels (2007). In addition, she has also appeared on the reality TV programs Blind Date (2001), The 5th Wheel (2001), The Girls Next Door (2005) and Meet My Folks (2003) Young not only has small parts in the movies National Lampoon's Gold Diggers (2003), Stone & Ed (2008) and Street Warrior (2008) but also more sizable roles in the films Nude Nuns with Big Guns (2010), Cut! (2014) and Dog Fight! (2012).03","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNjQ0Njg2Ml5BMl5BanBnXkFtZTcwNzQ5MTM2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2774589","name":"Tawny Amber Young","idIMDB":"nm2774589"},"actorId":"nm2774589","character":"Tawny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrew Baxter","urlProfile":"http://www.imdb.com/name/nm3579379","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExMTM3NTcxODVeQTJeQWpwZ15BbWU4MDQwNDk5NDIx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Andrew Baxter is an Actor/Writer/Director based out of Los Angeles, CA. He has worked in feature films, short films, music videos and web series since 2011. Originally from Scottsdale, AZ, Andrew grew up skateboarding, playing in bands and experimenting with cameras, inspiring a punk DIY ethos he maintains to this today.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExMTM3NTcxODVeQTJeQWpwZ15BbWU4MDQwNDk5NDIx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3579379","name":"Andrew Baxter","idIMDB":"nm3579379"},"actorId":"nm3579379","character":"Gil Bellows","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Darryl Gulbranson","urlProfile":"http://www.imdb.com/name/nm5365600","urlPhoto":"","biography":{"bio":"Darryl Gulbranson is a producer and actor, known for Axe to Grind (2015) and Periphery (2017).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5365600","name":"Darryl Gulbranson","idIMDB":"nm5365600"},"actorId":"nm5365600","character":"Neighbor #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harley McLain","urlProfile":"http://www.imdb.com/name/nm5661420","urlPhoto":"","biography":{"dateOfBirth":"14 June 1951","placeOfBirth":" Mayville, North Dakota, USA","bio":"Harley James McLain was born on 14 June 1951 in Mayville, North Dakota, the third child to Kathryn and the Reverend Bernard McLain. Harley attended school in Livingston, Montana until his family moved to Jamestown, North Dakota, where he graduated from high school and Jamestown College with a degree in English and political science. Harley was a fun-loving, compassionate and joyous father, brother, uncle and friend. He met Buckminster Fuller and built a geodesic dome where he lived on the family land in Eckelson. He became an organic farmer, champion of peace, landscaper, gifted carpenter and ran for president, congressman and agricultural commissioner with the Natural People's League or NPL, among other offices. His slogans were: I am a man \"outstanding in my field\" or \"Organic is more Orgasmic.\" His brilliant wit, charm and vibrancy were reflected in the songs he wrote. He always seemed to have a guitar or good book in hand. Harley met Julie Goeller at a Democratic convention and they later married in 1983. She was the love of his life - they were Gemini twins, both born in June, and a truly memorable pair. They had three children, Molly, Mira and Matthew, who grew up surrounded in an incredibly creative and loving atmosphere. Harley enjoyed so many activities with his kids: sledding, watching the northern lights and the stars, picking flowers, playing songs for birthday parties and with his kids, telling stories, going to parks, camping and taking walks on the land where he farmed. Harley and Julie had a greenhouse and nursery, Shy Soo Nursery, in Valley City for many years, and their landscaping can be seen in numerous communities and along highways across the state. Harley was an active member of the Congregational Church and the sense of social justice that was instilled in him by his parents showed through in his life's endeavors. He was an outrageous actor in the community theater, and even traveled to Los Angeles, California in May of 2013 to appear in a movie called 'Axe to Grind' with his cousin Matthew James Gulbranson. Harley was a talented carpenter and an advocate and practitioner of natural and spiritual health and healing. He treasured his friendships and family members by lighting up their lives with a song, a twinkle in his eye and a good Norwegian joke. Harley passed away at age 62 on 9 February 2014 in Fargo, North Dakota.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5661420","name":"Harley McLain","idIMDB":"nm5661420"},"actorId":"nm5661420","character":"Neighbor #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eileen Dietz","urlProfile":"http://www.imdb.com/name/nm0226326","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMDQ5ODc1Nl5BMl5BanBnXkFtZTcwMTcwODE2Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1944","placeOfBirth":" Bayside, New York, USA","height":"5' 1\" (1.55 m)","bio":"Eileen Dietz was born in New York City along with a twin sister, named Marianne. While Eileen went on to be an actress Marianne lives in Florida and has 3 terrific children. Eileen has been lucky to be involved with many award-winning projects. She was in the original Tony winning Steambath with Tony Perkins and went on to portray the Demon who possesses Regan in The Exorcist, following that was the Emmy-winning General Hospital where she portrayed Sarah a patient in a mental hospital in Port Charles and also the Emmy-winning Helter-Skelter where she was one of the Manson Gang. While these are the award-winning projects, Eileen has been blessed to continue working on many other projects. her latest favorites being The Queen Of Screams, (Norma Desmond meets Carrie in a fiery finish) and Legend Of The Mountain Witch along with The Curse Of The Flesh. There are also scripts in development to which she is attached Lullaby by Edward Romero, Krampus by Amanda Carver, Deadly Rites, and Blood Lust to be shot in England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMDQ5ODc1Nl5BMl5BanBnXkFtZTcwMTcwODE2Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0226326","name":"Eileen Dietz","idIMDB":"nm0226326"},"actorId":"nm0226326","character":"Neighbor #3","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1634275","urlIMDB":"http://www.imdb.com/title/tt1634275","business":{"budget":{"money":"$550,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"13","month":"05","year":"2013","remarks":null},{"money":null,"country":null,"day":"28","month":"05","year":"2013","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 24 min (84 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"3.6","filmingLocations":[{"location":"Linda Vista Hospital - 610 S. St. Louis Street, Los Angeles, California, USA"}],"awards":[],"votes":"123","type":"Movie","companyCreditsSimple":[{"idCompany":"co0251487","name":"Seraph Productions"},{"idCompany":"co0452066","name":"Top Knot Films"}],"keywords":{"keywords":["tied feet"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 03:56:42"}}