{"data":{"movies":[{"title":"Alyce Kills","originalTitle":"Alyce","year":"2011","releaseDate":"20130524","directors":[{"name":"Jay Lee","id":"nm0999415"}],"writers":[{"name":"Jay Lee","id":"nm0999415"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWVkY2QyN2QtYzlmMy00NzhhLThmMzYtNzU3ZTUwNmE0MmU4XkEyXkFqcGdeQXVyNDUxMTg2MTU@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Thriller"],"plot":"After accidentally knocking her best friend off a roof, Alyce is haunted by guilt and delves into a brutal nightmare wonderland of sex, drugs and violence, her mind tearing itself apart along with anyone else who gets in her way.","simplePlot":"After accidentally knocking her best friend off a roof, Alyce is haunted by guilt and delves into a brutal nightmare wonderland of sex, drugs and violence, her mind tearing itself apart along with anyone else who gets in her way.","actors":[{"actorName":"Jade Dornfeld","urlProfile":"http://www.imdb.com/name/nm1762507","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNDkzODU3OF5BMl5BanBnXkFtZTcwNDM0NjA0OQ@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"bio":"Jade Dornfeld is known for her work on Alyce Kills (2011), On Holiday (2010) and Everything Will Happen Before You Die (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNDkzODU3OF5BMl5BanBnXkFtZTcwNDM0NjA0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1762507","name":"Jade Dornfeld","idIMDB":"nm1762507"},"actorId":"nm1762507","character":"Alyce","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tamara Feldman","urlProfile":"http://www.imdb.com/name/nm1299293","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NTA2MDgxMF5BMl5BanBnXkFtZTYwNDQyNjky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 December 1980","placeOfBirth":" Wichita, Kansas, USA","bio":"Tamara Feldman was born on December 5, 1980 in Wichita, Kansas, USA. She is an actress and director, known for Hatchet (2006), Echelon Conspiracy (2009) and Perfect Stranger (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NTA2MDgxMF5BMl5BanBnXkFtZTYwNDQyNjky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1299293","name":"Tamara Feldman","idIMDB":"nm1299293"},"actorId":"nm1299293","character":"Carroll","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Duval","urlProfile":"http://www.imdb.com/name/nm0001166","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzOTgxNDQ5N15BMl5BanBnXkFtZTcwMzUwOTcyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1972","placeOfBirth":" Detroit, Michigan, USA","birthName":"James Edward Duval","height":"5' 9\" (1.75 m)","bio":"Born in Detroit, Michigan in 1972. He moved to Los Angeles, California in 1974 where his sister Terry Duval (his only sibling) was born. He attended Gladstone High School in Covina, California from 1986 to 1989 as well attending Mira Costa High School in Manhattan Beach, and Fair Valley in Covina. Although he was trained as a classical pianist as a child he eventually moved to the guitar. He used to play for \"Antoneus Maximus & The Nuthouze Band\" who had been playing gigs at local venues in Los Angeles. 2004 saw them working on their 1st album which included guest appearances by such luminaries as 'Apl.de.Ap', 'DjMotiv8' and 'Dante Santiago' from \"Black Eyed Peas\" as well as 'Kid' (Chris) from \"Kid'N'Play\". He practices/teaches Hatha Yoga in between films and now plays Guitar/Piano and sings in the band \"Gene Wilder\" with friends and fellow actors \"Brian McGuire\" and Brett Roberts\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzOTgxNDQ5N15BMl5BanBnXkFtZTcwMzUwOTcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001166","name":"James Duval","nicknames":["Jimmy"],"idIMDB":"nm0001166"},"actorId":"nm0001166","character":"Vince","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eddie Rouse","urlProfile":"http://www.imdb.com/name/nm0745852","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNzIzNTgzN15BMl5BanBnXkFtZTYwNTU3NDY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 July 1954","placeOfBirth":" Philadelphia, Pennsylvania, USA","bio":"Eddie Rouse was born on July 2, 1954 in Philadelphia, Pennsylvania, USA. He was an actor, known for Pandorum (2009), American Gangster (2007) and Pineapple Express (2008). He died on December 7, 2014 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNzIzNTgzN15BMl5BanBnXkFtZTYwNTU3NDY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0745852","name":"Eddie Rouse","idIMDB":"nm0745852"},"actorId":"nm0745852","character":"Rex","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larry Cedar","urlProfile":"http://www.imdb.com/name/nm0147738","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NjQ5MDQxNl5BMl5BanBnXkFtZTgwNDYyOTM2MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1955","placeOfBirth":" Los Angeles County, California, USA","height":"6' (1.83 m)","bio":"Larry Cedar is an accomplished film, television, stage and voiceover artist. Admitted to Hastings Law School after earning his BA in Communication Studies, the course of his life was dramatically altered when he impulsively decided to audition for, and was accepted into, the MFA Theater program at UCLA. There he participated in and won the Hugh O'Brian Acting Competition award for Best Actor and as a result was signed to an exclusive one-year artist development contract with Universal Studios, where he subsequently appeared in his first television pilot. He went on to star in various projects for Walt Disney Studios, numerous episodics and several feature films, including a starring role opposite Rebecca De Mornay and Mary Gross in the Ivan Reitman-produced Feds (1988), as well as an unforgettable appearance opposite John Lithgow as \"The Creature on the Wing\" in the Steven Spielberg remake of Twilight Zone: The Movie (1983), directed by George Miller. Larry spent six years in New York starring in the award-winning PBS series Square One Television (1987) and later starred in 40 episodes of the Fox television series A.J.'s Time Travelers (1995) produced by Gianni Russo. An excellent singer, on stage he has portrayed Hoagy Carmichael in \"Hoagy, Bix, and Wolfgang Beethoven Bunkhaus\" at the Mark Taper Forum in Los Angeles, starred as \"Vernon\" opposite Lea Thompson in \"They're Playing Our Song\", and as \"Secretary Thompson\" in \"1776: The Musical\" opposite Roger Rees. An avid reader and monologist, he is currently developing a one-man show based on the works of one of his favorite authors, George Orwell. In 2003 he was nominated for two Los Angeles Theater Alliance \"Ovation\" awards for his performances in \"Anything Goes\" (as Lord Oakley) opposite Rachel York and \"She Loves Me\" (as Sipos, for which he ultimately won Best Featured Actor in a Musical). He also excels in the field of voiceovers, and in addition to lending his numerous vocal characterizations to hundreds of commercials, cartoon series, and video games, he specializes in the art of \"speed talking\". Demos of his voiceover work can be heard at www.disclaimerman.com. Larry currently recurs as \"Leon\", the opium-addicted card dealer and thief, in HBO's newest hit series, _\"Deadwood\" (2004/I)_ opposite Powers Boothe, Ricky Jay and Ian McShane. He most recently completed work opposite Keanu Reeves as the horrific \"Vermin Man\" (with special effects makeup by Stan Winston) in Constantine (2005), directed by Francis Lawrence.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NjQ5MDQxNl5BMl5BanBnXkFtZTgwNDYyOTM2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0147738","name":"Larry Cedar","idIMDB":"nm0147738"},"actorId":"nm0147738","character":"Harold","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yorgo Constantine","urlProfile":"http://www.imdb.com/name/nm0176085","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MTc5Nzg3NF5BMl5BanBnXkFtZTcwMzk0MjE3MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Yorgo Constantine is known for his work on Live Free or Die Hard (2007), Fast Five (2011) and Phone Booth (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MTc5Nzg3NF5BMl5BanBnXkFtZTcwMzk0MjE3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0176085","name":"Yorgo Constantine","idIMDB":"nm0176085"},"actorId":"nm0176085","character":"Warner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Megan Gallagher","urlProfile":"http://www.imdb.com/name/nm0302446","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMDI0NDk3OV5BMl5BanBnXkFtZTcwOTI1ODIxNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 February 1960","placeOfBirth":" Reading, Pennsylvania, USA","height":"5' 6½\" (1.69 m)","bio":"Megan Gallagher wanted to act from the time she was five years old. She later took drama lessons when she was in high school. She moved to New York to attend the Juilliard and appeared in the Broadway cast of \"A Few Good Men\" where she won two theater awards (Theatre World and Outer Critics Circle Award for outstanding debut) for her Broadway performance in \"A Few Good Men\". After graduating from Juilliard with a bachelor's degree, she began to work with John Houseman's Acting Company and soon had screen roles in TV movies and miniseries, but was so discouraged trying to make it in L.A. that she nearly gave up to go to law school. Then she won the Hill Street Blues (1981) role, which developed from a guest star to a regular role. The rest is history.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMDI0NDk3OV5BMl5BanBnXkFtZTcwOTI1ODIxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0302446","name":"Megan Gallagher","idIMDB":"nm0302446"},"actorId":"nm0302446","character":"Ginny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rena Owen","urlProfile":"http://www.imdb.com/name/nm0654240","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyODg4MzkyNV5BMl5BanBnXkFtZTgwMTM5OTYzMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1962","placeOfBirth":" Bay of Islands, New Zealand","height":"5' 6\" (1.68 m)","bio":"Rena is an international award-winning actor and is one of only 6 actors in the world to have worked with both George Lucas and Stephen Spielberg during her illustrious career that spans 3 decades. One of 9 children, she was born and bred in the Bay of Islands, New Zealand to a Maori/Welsh Father and a European Mother. She was first published at 8 when she won a national children's poetry contest, and throughout her youth, Owen was active in the Maori Culture Club, High School Musical productions, and Community Stage Plays. Despite knowing her talents were in creativity, upon graduating, the Arts were not considered a viable career. At 18, she moved to Auckland to pursue a Nursing Career and 3 years later qualified as a General & Obstetric Nurse (RGN). In 1983, she went on her OE (overseas experience), a common Kiwi pursuit, and landed in London. Awed by the huge city and the bright lights of the entertainment world, the temptations that came with it easily seduced the naive 21 year old. But this life changing period led her back to a creative career. She trained at the Actors Institute of London in the mid-1980s. During her formative years she worked in all aspects of the Theater. The first stage play she wrote, The River That Ran Away was produced by Clean Break and directed by the reputable award winning British actress Ann Mitchell with Rena in the lead role. It enjoyed a successful London tour and was later published by NZ Playmarket (1991). Other UK highlights include, Voices from Prison for the Royal Shakespeare Company, and award winning play, Outside In that debuted at the Edinburgh Festival. Upon her return to NZ in 1989, Rena acted in two one-hour dramas for Television NZ's Series, E Tipu E Rea. A first of its' kind; the series was written, acted, directed and produced by Maori. In constant pursuit of learning and honing her craft, she continued to work extensively in theatre; acting, writing, directing, working as a dramaturgy, and was a founding member of Taki Rua Theatre. She wrote and recorded short stories for Radio NZ, wrote and starred in the critically acclaimed stage play, Daddy's Girl whilst playing reoccurring roles in two NZ TV Series, Betty's Bunch, and Shark in the Park. Rena was a rare recipient of a Dame Te Atairangikaahu (the Maori Queen) Literary Award & Scholarship. Rena's first feature film was a supporting role in the Kevin Reynolds/Kevin Costner film, Rapa Nui (1993), followed by the leading role in the cult-classic NZ film, Once Were Warriors. Her electrifying performance garnered her universal rave reviews. David Denby declared, \"Owen's performance is classic!\" Roger Ebert proclaimed, \"You don't often see acting like this in the movies. The two leads bring the Academy Awards into perspective.\" Ruby Rich called her \"The Bette Davis from Down Under\", while Thelma Adams wrote, \"Owen has the looks of Jeanne Moreau, the raw emotional power of Anna Magnani and a slim athleticism all her own\". The film was voted one of Time Magazine's top 10 films in 1994, it garnered over 30 International Awards, and screened in 66 countries. Rena won Best Actress awards at the Montreal, Oporto, Seattle, and San Diego Film Festivals, as well as the Cannes Film Festival's Spirit Award. While in NZ, she was awarded the Benny Award for Excellence in Film and the Toast Masters Communicator of the Year Award. Rena returned to the Theater to act in two Stephen Berkoff plays, East West and Kvetch. She guest starred and earned a Best Supporting Actress nomination for her role in the NZ TV Series, Coverstory. She then played a leading role in the Australian Network 10 TV Drama Series, Medivac (1996-1998), a leading role in Garth Maxwell's feature film, When Love Comes, and a supporting role in Rolf De Heer's critically acclaimed, Dance Me To My Song that was in competition at the 1999 Cannes Film Festival and earned her an Australian Film Institute (AFI) Best Supporting Actress nomination. In 2000, Rena set up a base in Los Angeles to learn more about filmmaking. She played beloved Taun We in George Lucas' Star Wars: Attack of the Clones, followed by a cameo role in Steven Spielberg's A.I. Whilst developing two screenplays, she played a reoccurring role in WB's Angel. Lucas cast her again as Nee Alavar in Star Wars: Revenge of the Sith. Rena went on to play supporting and cameo roles in multiple international films. Highlights include; Lions Gate's NZ/Canadian co-production Nemesis Game, Vincent Ward's acclaimed Rain Of The Children, NZ TV film A Piece Of My Heart, and USA thriller, Alyce Kills. In 2010, Rena played a 3 month role on NZ's longest running TV series; Shortland Street and won the Best Supporting Actress Award at the 2011 Aotearoa Film and Television Awards (AFTA). A reoccurring role in the award-winning Australian TV series, East West 101 earned her a Best Supporting Actress nomination at the Australian Academy of Cinema & Television Arts (AACTA), and a Best Actress nomination at the Monte Carlo International Television Festival in 2012. In her latest TV Series as a series regular, Rena played the Matriarch opposite Brian Cox's Patriarch of a multi-ethnic crime family set in the Torres Strait Islands for an ABC TV Series fondly nick-named, 'The Sopranos In Thongs!' The Hollywood Reporter voted The Straits as one of the 'Top 10 Series' to binge watch on Hulu in 2013. Theatre credits throughout the past 15 years include leading roles in the classic NZ plays; Haruru Mai and The Pohutukawa Tree, and in the USA; multiple Stage Readings for Native Voices at the Autry in LA and La Jolla Playhouse in San Diego, Charity Stage Readings for the City of West Hollywood, and a leading role in a Hawaiian play called Fine Dancing. Rena adapted and directed Toa Fraser's play, Bare for the Asian American Theatre Company (AATC) in San Francisco. 2014, Once Were Warriors was voted the number one film of all time in New Zealand. Rena played a pivotal role in a documentary celebrating the film's 20th Anniversary, Where Are They Now? Her last USA independent feature film, The Well premiered at the LA Film Festival and she was cast in reoccurring roles for A&E's TV Series, Longmire and Sundance's TV Series, The Red Road. Her last NZ film, The Dead Lands enjoyed a Special Presentation Premiere at the Toronto Film Festival, garnered rave reviews, and sold to multiple territories. To close out 2014, Rena played the supporting role of Glaeser in The Last Witch Hunter directed by Breck Eisner, starring Vin Diesel.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyODg4MzkyNV5BMl5BanBnXkFtZTgwMTM5OTYzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0654240","name":"Rena Owen","idIMDB":"nm0654240"},"actorId":"nm0654240","character":"Danielle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tracey Walter","urlProfile":"http://www.imdb.com/name/nm0910145","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NzkxOTgxMV5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 November 1947","placeOfBirth":" Jersey City, New Jersey, USA","height":"5' 6\" (1.68 m)","bio":"Tracey Walter was born on November 25, 1947 in Jersey City, New Jersey, USA. He is an actor, known for The Silence of the Lambs (1991), Batman (1989) and Matilda (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NzkxOTgxMV5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0910145","name":"Tracey Walter","idIMDB":"nm0910145"},"actorId":"nm0910145","character":"Landlord","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bret Roberts","urlProfile":"http://www.imdb.com/name/nm0730888","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNzc3ODkyMF5BMl5BanBnXkFtZTYwMDcyOTky._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Bret McKinley Roberts","bio":"Bret Roberts was born in Anchorage, Alaska, USA as Bret McKinley Roberts. He is an actor and producer, known for What lies within (2014), Pearl Harbor (2001) and Nightstalker (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNzc3ODkyMF5BMl5BanBnXkFtZTYwMDcyOTky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0730888","name":"Bret Roberts","idIMDB":"nm0730888"},"actorId":"nm0730888","character":"Mike","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Max E. Williams","urlProfile":"http://www.imdb.com/name/nm2301278","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM1NjcxMTMxMV5BMl5BanBnXkFtZTgwMDg0MjQ0NzE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"bio":"A dual citizen of Canada and the United States. In 2009, Max was nominated as Best Actor in, 'The Lucky 7,' a film honored as Best Action Short at the A.O.F. (Action On Film) International Film Festival. That same year he was nominated as Best Comedic Actor by LA Weekly for his role as Cody Powers in the Elephant Theatre Company's award-winning, 'Block Nine.' 2010 saw a turn on Showtime in, 'Shameless,' playing opposite Emmy and Oscar nominated actor William H. Macy. In 2011 Max landed a co-starring role in Writer/Director Jay Lee's, 'Alyce,' a follow-up to his cult-classic, 'Zombie Strippers.' In August, 2012, Max Williams can be seen on I.F.C. as the Lead, Gunter Vogler, in Alan Spencer's, 'Bullet in the Face.' Touted as, 'The Most Violent Comedy in Television History,' the series co-stars Eddie Izzard and Eric Roberts. A proud long-standing member with Elephant Theatre Company, Max has accrued an extensive theatre background. He has been reviewed and celebrated by publications including The Hollywood Reporter, Variety, The LA Times, Backstage West, LA Weekly, and The Ovation Awards. Before embracing the arts, Max played professional ice hockey. At the time of his birth, Max's father was Head Trainer for the Stanley Cup Champion Montreal Canadians.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM1NjcxMTMxMV5BMl5BanBnXkFtZTgwMDg0MjQ0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2301278","name":"Max E. Williams","idIMDB":"nm2301278"},"actorId":"nm2301278","character":"Kurt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Whitney Anderson","urlProfile":"http://www.imdb.com/name/nm0027575","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg5YzZjYTUtMmU5Ny00OTE3LWFhZDEtMTczYzVhODQ1ZWVmXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 4\" (1.63 m)","bio":"Despite her California-blonde looks, Whitney was actually born in St. Louis, Missouri, but soon after she and her family moved to Minnesota. After spending her early childhood years there, they relocated again; this time to Manhattan Beach, California, where her career was launched when she was cast as Fred Willard's daughter in the role of \"Ella\" in Prehysteria! 3. Whitney took a hiatus from acting for high school to focus on her education and enjoy a normal high school experience. Later she enrolled at the University of Southern California (USC) where she ultimately earned a degree in theater & broadcast journalism. After graduating she returned to the screen and portrayed characters in several different television shows such as, CSI: Miami, Ghost Whisperer, Veronica Mars, CSI: NY, Aliens in America, Bones and NCIS: Los Angeles. She also starred in the independent films, Shuffle and Alyce. During her downtime she enjoys dancing and participating in improv shows. She is also an accomplished singer-songwriter and has performed at various venues in Los Angeles. Whitney also enjoys writing and producing. She produced, wrote and directed a short film, The Sister for the popular website, funnyordie. Her next project is The Melting Point of Wax, an intense psychological drama that she is producing and starring in. She can currently (2011) be seen in the lead role of The Godmother, which was filmed and is now in release in Romania.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg5YzZjYTUtMmU5Ny00OTE3LWFhZDEtMTczYzVhODQ1ZWVmXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0027575","name":"Whitney Anderson","idIMDB":"nm0027575"},"actorId":"nm0027575","character":"Renee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Siri Baruc","urlProfile":"http://www.imdb.com/name/nm0059410","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1Nzg4Nzc1NF5BMl5BanBnXkFtZTYwMDY4MTAz._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1978","placeOfBirth":"","height":"5' 5\" (1.65 m)","bio":"Siri Baruc was born in a Yoga Commune in Boston, MA. Her mother is a clairvoyant teacher and her father, 'Robert Baruc', is the president of Screen Media Films. Siri grew up in Vermont, acting in school plays, acting camp, and community theater. She began her film career while studying theater and communications at Clark University in Worcester, MA. She was accepted into the University of the Arts acting program and was set to transfer but opted to act with the Karate Kid, Ralph Macchio in Can't Be Heaven (1999) which filmed in LA. While in LA she studied at the Larry Moss Studio and The Joanne Baron/ D.W. Brown acting studio. While training and acting in films she also studied Alexander technique, voice, dialect and yoga. Siri has since acted in over 40 films, television episodes, plays and Webseries. Siri is also a published author, screenwriter and Certified Reiki Master Practitioner and teacher. She lives happily with her husband, 'Jake Thornton' in LA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1Nzg4Nzc1NF5BMl5BanBnXkFtZTYwMDY4MTAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0059410","name":"Siri Baruc","idIMDB":"nm0059410"},"actorId":"nm0059410","character":"Erin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jake Thornton","urlProfile":"http://www.imdb.com/name/nm0861801","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzM0MDc2OF5BMl5BanBnXkFtZTYwNzc0NjEy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 January 1981","placeOfBirth":" Hammersmith, London, England, UK","height":"5' 8\" (1.73 m)","bio":"Jake trained at Londons Guildhall School of Music and Drama. He worked as an actor at the Royal Shakespeare Company and in London's West End, and toured the world with the Tom Waits/William Burroughs Collaboration, The Black Rider. Since moving to Los Angeles, he began a writing partnership with friend, Ben Lustig. They broke-in in 2014 with their spec script, Winter's Knight, an origin story of Santa Claus, which sold for $1M. He is married to actress Siri Baruc, and has two children, Phoenix and Bodhi.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzM0MDc2OF5BMl5BanBnXkFtZTYwNzc0NjEy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0861801","name":"Jake Thornton","idIMDB":"nm0861801"},"actorId":"nm0861801","character":"Clive","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gus Krieger","urlProfile":"http://www.imdb.com/name/nm2803289","urlPhoto":"","biography":{"bio":"Gus Krieger is an actor and producer, known for The Killing Room (2009), The Binding (2015) and Would You Rather (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2803289","name":"Gus Krieger","idIMDB":"nm2803289"},"actorId":"nm2803289","character":"Quinn","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1680051","urlIMDB":"http://www.imdb.com/title/tt1680051","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"16","month":"06","year":"2010","remarks":null},"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.5","filmingLocations":[{"location":"Echo Park, Los Angeles, California, USA"}],"awards":[],"votes":"2,449","type":"Movie","companyCreditsSimple":[{"idCompany":"co0300393","name":"Social Construct"},{"idCompany":"co0257095","name":"Scream HQ"}],"keywords":{"keywords":["female rear nudity","villainess","female psychopath","splatter","female masturbation","masturbation","one word title","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:18:41"}}