{"data":{"movies":[{"title":"Entourage","originalTitle":"","year":"2015","releaseDate":"20150603","directors":[{"name":"Doug Ellin","id":"nm0254120"}],"writers":[{"name":"Doug Ellin","id":"nm0254120"},{"name":"Doug Ellin","id":"nm0254120"}],"runtime":"104 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTBiZGNkNzktNTYzNC00MjE4LTk1NTYtYTM3NTQ4NmEzNWYwXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"This movie picks up where the TV show ended. Vincent Chase is offered a role by his former agent now Studio boss Ari Gold in a movie he is developing. Vincent agrees on the condition that he be allowed to direct the movie also. Nearly a year later, Vince is uncertain if the movie is ready, so he asks Ari for money to finish the movie. But Vincent has asked for money more than once already and Ari's bosses are not happy of how much they're spending. But he goes to their backer to ask for more money and he wants to see what Vince has shot so far but Vince won't let anyone see it yet. But he's planning a screening, and asks the backer to come to L.A. with him but he can't so he sends his son instead. At the screening Vince decides not to show it. But gives out DVDS. The son after watching the movie, says he has issues with Drama, Vince's brother who has a small role in the movie. Vince is unwilling to drop him. When they appease the son, he then says he has issues with Vince. So as they ...","simplePlot":"Movie star Vincent Chase, together with his boys Eric, Turtle, and Johnny, are back - and back in business with super agent-turned-studio head Ari Gold on a risky project that will serve as Vince's directorial debut.","actors":[{"actorName":"Kevin Connolly","urlProfile":"http://www.imdb.com/name/nm0175305","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWYyODhkNTQtMWJiNy00MmQxLWE3MDItMGRjYzRkOTUyMTZlXkEyXkFqcGdeQXVyNzM5ODU2Njk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 March 1974","placeOfBirth":" New York City, New York, USA","height":"5' 5\" (1.65 m)","bio":"Kevin Connolly was born on March 5, 1974 in New York City, New York, USA. He is an actor and director, known for Entourage (2004), The Notebook (2004) and Unhappily Ever After (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWYyODhkNTQtMWJiNy00MmQxLWE3MDItMGRjYzRkOTUyMTZlXkEyXkFqcGdeQXVyNzM5ODU2Njk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0175305","name":"Kevin Connolly","idIMDB":"nm0175305"},"actorId":"nm0175305","character":"Eric","urlCharacter":"http://www.imdb.com/character/ch0014184","main":true},{"actorName":"Adrian Grenier","urlProfile":"http://www.imdb.com/name/nm0004978","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwOTQ5MTI4Nl5BMl5BanBnXkFtZTgwODkwODA3MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 July 1976","placeOfBirth":" Santa Fe, New Mexico, USA","birthName":"Adrian S. Grenier","height":"5' 10½\" (1.79 m)","bio":"Adrian Grenier was born on July 10, 1976 in Santa Fe, New Mexico, USA as Adrian S. Grenier. He is an actor and producer, known for Entourage (2004), The Devil Wears Prada (2006) and Entourage (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwOTQ5MTI4Nl5BMl5BanBnXkFtZTgwODkwODA3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004978","name":"Adrian Grenier","nicknames":["A","Adi"],"idIMDB":"nm0004978"},"actorId":"nm0004978","character":"Vince","urlCharacter":"http://www.imdb.com/character/ch0014182","main":true},{"actorName":"Kevin Dillon","urlProfile":"http://www.imdb.com/name/nm0001143","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1Njg4NTEwMV5BMl5BanBnXkFtZTYwODU0ODcz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1965","placeOfBirth":" Mamaroneck, New York, USA","birthName":"Kevin Brady Dillon","height":"5' 9\" (1.75 m)","bio":"Kevin Dillon, born in Mamaroneck, New York was known for playing tough guys and bad boys during his early career. His first major role was Rooney, the bully in the brilliant (though much understated) film Heaven Help Us. Kevin has since made many memorable film and television appearances, most notably in Oliver Stone's Platoon and The Doors, in the World War II film A Midnight Clear and in the cult classic The Blob. He was nominated for a Young Artist Award for his poignant performance opposite James Woods, Glenn Close and Mary Stuart Masterson in Immediate Family. Dillon starred opposite Kurt Russell and Richard Dreyfuss in Wolfgang Petersen's Poseidon for Warner Brothers and opposite Lisa Kudrow, Emma Roberts and Don Cheadle in Hotel for Dogs for Dreamworks. Dillon is probably best known for his hilarious, yet heartfelt portrayal of the beloved character Johnny Drama on the hit series Entourage for HBO. His performance garnered him nominations for three Emmy Awards, a Golden Globe Award and three SAG Awards. He also recurred on both the critically acclaimed series NYPD Blue and 24. He will next be seen this Summer as Johnny Drama in the feature film Entourage for Warner Brothers, directed by Doug Ellin.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1Njg4NTEwMV5BMl5BanBnXkFtZTYwODU0ODcz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001143","name":"Kevin Dillon","idIMDB":"nm0001143"},"actorId":"nm0001143","character":"Johnny Drama","urlCharacter":"http://www.imdb.com/character/ch0014183","main":true},{"actorName":"Jerry Ferrara","urlProfile":"http://www.imdb.com/name/nm1483196","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDgxMDEzOF5BMl5BanBnXkFtZTgwODk1NzQ3NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 November 1979","placeOfBirth":" Brooklyn, New York, USA","height":"5' 7\" (1.7 m)","bio":"Jerry Ferrara began studying theater in college, where he was inspired by a teacher to pursue a career in acting. An agent he met at a talent showcase encouraged him to move to Los Angeles, where he quickly landed his first role on The King of Queens (1998). Other television parts soon followed. Jerry was then cast in the independent feature, Cross Bronx (2004), which premiered at the 2004 Tribeca Film Festival. Jerry attended New Utrecht High School.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDgxMDEzOF5BMl5BanBnXkFtZTgwODk1NzQ3NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1483196","name":"Jerry Ferrara","idIMDB":"nm1483196"},"actorId":"nm1483196","character":"Turtle","urlCharacter":"http://www.imdb.com/character/ch0014185","main":true},{"actorName":"Jeremy Piven","urlProfile":"http://www.imdb.com/name/nm0005315","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMDQ0NjU5N15BMl5BanBnXkFtZTcwNjA1NzMxNQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1965","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Jeremy Samuel Piven","height":"5' 9\" (1.75 m)","bio":"Born in Manhattan and raised in Evanston, Illinois, he is an alumnus of the Piven Theatre Workshop founded by his parents (Byrne Piven and Joyce Hiller Piven) and a one time Chicago stage actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMDQ0NjU5N15BMl5BanBnXkFtZTcwNjA1NzMxNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005315","name":"Jeremy Piven","nicknames":["Jez Piv","The Piv"],"idIMDB":"nm0005315"},"actorId":"nm0005315","character":"Ari Gold","urlCharacter":"http://www.imdb.com/character/ch0014180","main":true},{"actorName":"Emmanuelle Chriqui","urlProfile":"http://www.imdb.com/name/nm0004825","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNTgzMDg5MF5BMl5BanBnXkFtZTcwMTQ3OTkzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1975","placeOfBirth":" Montreal, Quebec, Canada","birthName":"Emmanuelle Sophie Anne Chriqui","height":"5' 3\" (1.6 m)","bio":"Emmanuelle Chriqui was born in Montreal, Quebec, to Moroccan Jewish immigrants, Liliane (Benisty) and Albert Chriqui. Her family moved to Toronto when she was two years old. At the age of 10, Chriqui appeared in a McDonald's commercial. She moved to Vancouver, guest-starring in series such as Are You Afraid of the Dark? (1990), Le justicier des ténèbres (1992), Les repentis (1996) and Psi Factor, chroniques du paranormal (1996). Her first Hollywood role was in Detroit Rock City (1999). Her breakout performance came in 2000's Snow Day (2000), in which she played the foxy \"Claire Bonner\". She appeared in rock band Hinder's \"Lips of an Angel\" music video in 2006. Emmanuelle later starred in several films and was nominated for a DVD Exclusive Award as Best Actress for her performance in 100 Girls (2000). She also starred in the movie, Adam and Eve (2005), opposite Cameron Douglas. Chriqui increased her visibility by playing \"Sloan\" on the HBO hit show, Entourage (2004), and by starring opposite Adam Sandler in You Don't Mess with the Zohan (2008). _ She reprised her role as \"Sloan\" in the 2015 full length feature of \"Entourage _\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNTgzMDg5MF5BMl5BanBnXkFtZTcwMTQ3OTkzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004825","name":"Emmanuelle Chriqui","idIMDB":"nm0004825"},"actorId":"nm0004825","character":"Sloan","urlCharacter":"http://www.imdb.com/character/ch0084853","main":true},{"actorName":"Perrey Reeves","urlProfile":"http://www.imdb.com/name/nm0716275","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NzM5MTI0OV5BMl5BanBnXkFtZTcwNDc5MzQzNw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1970","placeOfBirth":" New York City, New York, USA","height":"5' 5½\" (1.66 m)","bio":"Perrey Reeves was born in New York City and raised in the countryside of New Hampshire. Her parents, both academics, were from upper-class families. Her paternal grandfather, Hazard E. Reeves, was a sound pioneer who introduced magnetic stereophonic sound to films, and her maternal great-grandfather, James H. Hughes, was a U.S. Senator from Delaware (from 1937 to 1943). Perrey's parents preferred not to own a television but rather submerge their children in the vast realms of literature. Thus, her educational background ranged from years abroad in France and Italy to the Ivy League colleges of the US. Drama studies were what really interested her, however, resulting in her choosing an acting career. Her interests are as eclectic and diverse as the roles she has played and the life she has led. A lifelong vegetarian, she finds mental and physical balance in meditation and yoga, which she has faithfully practiced for over a decade. In the midst of acting, she also focuses much of her creative energies renovating a new home with her fiancée. She describes their abode as a \"quaint country oasis in the hills of Hollywood\". When not standing in line at Home Depot, she passionately donates her time to The International Fund for Animal Welfare and lives with many furry creatures. She joins the comically dynamic cast in DreamWorks' October release, Old School (2003), directed by Todd Phillips. Co-starring opposite Will Ferrell, she plays his traditional wife who is dedicated to the white picket fence dream. Vince Vaughn, Luke Wilson, Leah Remini and Ellen Pompeo round out the stellar cast. Perrey is accomplished on both the big and small screens. She has co-starred in features such as Tri-Star's The Suburbans (1999), Miramax's Phoenix Arizona (1998), Trimark's Kicking and Screaming (1995) and Universal's Child's Play 3 (1991). She has landed series regular roles in four pilots and has guest starred on numerous television shows ranging from Fox's The X-Files (1993) to the WB's Off Centre (2001). She has played lead roles in made-for-television movies, including CBS' An Element of Truth (1995) and ABC's Escape to Witch Mountain (1995). Perrey showcased her talents on stage in theater productions of \"High Tor\", \"House Arrest\", \"Women of Manhattan\", \"Picnic\" and \"Last Night at Ballyhoo\" at The Canon Theatre in which she played Rhea Perlman's daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NzM5MTI0OV5BMl5BanBnXkFtZTcwNDc5MzQzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0716275","name":"Perrey Reeves","idIMDB":"nm0716275"},"actorId":"nm0716275","character":"Mrs. Ari","urlCharacter":"http://www.imdb.com/character/ch0014186","main":true},{"actorName":"Rex Lee","urlProfile":"http://www.imdb.com/name/nm0498076","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMTYzMjAzOV5BMl5BanBnXkFtZTcwNzU2NzM4Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1969","placeOfBirth":" Warren, Ohio, USA","height":"5' 7\" (1.7 m)","bio":"Rex Lee was born on January 7, 1969 in Warren, Ohio, USA. He is an actor and writer, known for Entourage (2004), Young & Hungry (2014) and Suburgatory (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMTYzMjAzOV5BMl5BanBnXkFtZTcwNzU2NzM4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0498076","name":"Rex Lee","idIMDB":"nm0498076"},"actorId":"nm0498076","character":"Lloyd","urlCharacter":"http://www.imdb.com/character/ch0014191","main":true},{"actorName":"Debi Mazar","urlProfile":"http://www.imdb.com/name/nm0000529","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODgyNTQxMjM5NV5BMl5BanBnXkFtZTcwOTExOTAyMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 August 1964","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Deborah Mazar","height":"5' 5\" (1.65 m)","bio":"Debi Mazar was born on August 13, 1964 in Queens, New York City, New York, USA as Deborah Mazar. She is known for her work on Goodfellas (1990), Collateral (2004) and The Insider (1999). She has been married to Gabriele Corcos since March 16, 2002. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODgyNTQxMjM5NV5BMl5BanBnXkFtZTcwOTExOTAyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000529","name":"Debi Mazar","idIMDB":"nm0000529"},"actorId":"nm0000529","character":"Shauna","urlCharacter":"http://www.imdb.com/character/ch0014187","main":true},{"actorName":"Rhys Coiro","urlProfile":"http://www.imdb.com/name/nm1711052","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzODExMzY1MF5BMl5BanBnXkFtZTcwNjA2NDIzMQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 March 1979","placeOfBirth":" Calabria, Italy","height":"6' 2\" (1.88 m)","bio":"As a teenager, Coiro, a talented visual artist, spent summers building sets and operating lights at the New Jersey Shakespeare Festival. Inspired by numerous productions, including Julie Taymor's \"Titus Andronicus\" at Theater For A New Audience, Coiro decided to study theater at Carnegie Mellon University, where he eventually graduated with a BFA. He also spent time studying at The Moscow Art Theater in Russia. Coiro got his first professional gig as an understudy to three roles in the American premiere of Conor McPherson's off-Broadway play \"This Lime Tree Bower\" directed by Harris Yulin at Primary Stages. Within a month of graduating from CMU, Coiro landed the role of Eddie the Bellhop in the Lincoln Center revival of George S. Kauffman's \"Dinner at Eight\", directed by the late Gerald Gutierrez. Coiro then moved to Los Angeles and began working in construction, including a stint building a house with Nick Offerman. As recounted on Jerry Ferrara's podcast \"Bad 4 Business\", Coiro received the call that he'd landed his first on-screen acting gig, as Billy Walsh on \"Entourage\", while digging a hole for a deck in Echo Park. The role of Walsh was originally meant to be a guest star but soon evolved into an iconic character that has defined Coiro's career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzODExMzY1MF5BMl5BanBnXkFtZTcwNjA2NDIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1711052","name":"Rhys Coiro","idIMDB":"nm1711052"},"actorId":"nm1711052","character":"Billy Walsh","urlCharacter":"http://www.imdb.com/character/ch0014190","main":true},{"actorName":"Constance Zimmer","urlProfile":"http://www.imdb.com/name/nm0956603","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM3ODA2NjM0OV5BMl5BanBnXkFtZTgwMDEyODcwMDI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1970","placeOfBirth":" Seattle, Washington, USA","birthName":"Constance A. Zimmer","height":"5' 4\" (1.63 m)","bio":"Constance Zimmer decided to pursue a career in acting after she fell in love with the craft as a high school student. Once out of high school, Zimmer was accepted at the American Academy of Dramatic Arts in Pasadena, and began appearing in local theater. She was the recipient of a \"Best Actress\" Dramalogue Award, for one of her first stage appearances in \"Catholic School Girls\". She is well-known for playing a number of standout characters in notable projects. Starting in 2005, and for six seasons, she played the role of Dana Gordon on HBO's critically acclaimed series Entourage. She will reprise this role when Warner Brothers releases the Entourage film on the big screen in June. She also stars in Lifetime's new drama series UnReal, premiering on June 1st. On the show, she plays \"Quinn\" the executive producer of a fictional dating show. Other upcoming projects include the feature film Results opposite Guy Pearce and Cobie Smulders, which premiered earlier this year at The Sundance Film Festival, a recurring role on USA's new series Complications, and a guest starring role on the IFC series Maron, and Cartoon Network's animated series, Transformers: Robots in Disguise. Zimmer was most recently seen starring in the first and second season of the Netflix Emmy® nominated original series House of Cards, executive produced by David Fincher, as well as HBO's The Newsroom, executive produced by Aaron Sorkin. Zimmer was also a series lead on ABC's Boston Legal, created by David E. Kelley, which earned her a SAG Award nomination and had major roles on Grey's Anatomy, The New Adventures of Old Christine, Seinfeld and the sitcom Ellen. Zimmer's feature film credits include The Babymakers, opposite Paul Schneider and Olivia Munn, Demoted, opposite Sean Astin and Michael Vartan, and the Warner Bros. feature Chaos Theory, starring Ryan Reynolds and Emily Mortimer. She resides in Los Angeles with her husband, Russ, a director, and their daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM3ODA2NjM0OV5BMl5BanBnXkFtZTgwMDEyODcwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0956603","name":"Constance Zimmer","idIMDB":"nm0956603"},"actorId":"nm0956603","character":"Dana Gordon","urlCharacter":"http://www.imdb.com/character/ch0014188","main":true},{"actorName":"Haley Joel Osment","urlProfile":"http://www.imdb.com/name/nm0005286","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI1NDQyMDQ4Ml5BMl5BanBnXkFtZTYwNDIxMjMz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1988","placeOfBirth":" Los Angeles, California, USA","height":"5' 6\" (1.68 m)","bio":"Haley Joel Osment is an American actor who has proven himself as one of the best young actors of his generation. He is the first millennial male to have received an Academy Award nomination for acting. Osment was born in Los Angeles, California, to Theresa (Seifert), a teacher, and actor Eugene Osment. His sister is actress Emily Osment. His ancestry includes English, German, and Irish. Osment began acting at the age of four, when he tried out for a Pizza Hut commercial in a shopping mall. The commercial launched his career, and he landed his first television role later that year. As a young child, his first film role was as Forrest Gump (1994)'s son, also named Forrest Gump, in the 1994 film of the same name as well as making a small appearance in Mixed Nuts (1994). He had roles in numerous TV series, including Thunder Alley (1994), The Jeff Foxworthy Show (1995), and, most notably, the final season of Murphy Brown (1988), in which he replaced Dyllan Christopher as Murphy's son Avery. Osment also made numerous guest appearances in various TV series, including The Larry Sanders Show (1992), Walker, Texas Ranger (1993) (as a child dying from AIDS), Touched by an Angel (1994), Chicago Hope (1994), The Pretender (1996), and as a child dying from leukemia in the emotional episode 'Angels and Blimps' (1999) of the series Ally McBeal (1997). Osment starred in Bogus (1996) with Whoopi Goldberg and Gérard Depardieu, and appeared in the 1998 made-for-TV movie The Lake (1998) with Yasmine Bleeth, as well as I'll Remember April (2000) with future The Sixth Sense (1999) co-star Trevor Morgan. He first achieved stardom in 1999 when he appeared in the blockbuster The Sixth Sense (1999), co-starring Bruce Willis. For this role, Osment won the Saturn Award for best young actor. He was also nominated for the Academy Award for Best Supporting Actor, but lost to Michael Caine, with whom he would later star in Secondhand Lions (2003). Osment (voice) also made three minor guest appearances on Family Guy (1999) in 2000. One of Osment's lines in The Sixth Sense (1999), \"I see dead people,\" is often repeated or parodied on television programs and in other media. The 2000 Academy Awards ceremony honored another of Osment's future co-stars, BestActor Kevin Spacey, who, along with Helen Hunt, appeared in Osment's next film, Pay It Forward (2000). The following year, Osment appeared in Steven Spielberg's A.I. Artificial Intelligence (2001), cementing his stature as one of the leading young actors in Hollywood. This role earned him his second Saturn Award. Also in 2001, Osment starred in a Polish film, Edges of the Lord (2001), as Romek. The movie was never released theatrically in the United States. Osment has since provided voices for The Country Bears (2002) and The Jungle Book 2 (2003). More recently, Osment was the voice of Sora, the main protagonist of the Walt Disney Company and Square-Enix's Kingdom Hearts (2002) video-game series, which was extremely financially successful as well and generally well-received critically. He was also the voice of Takeshi Jinno in the \"Time to Shine\" episode of the IGPX: Immortal Grand Prix (2005) animé TV series. Osment also worked in Home of the Giants (2007), playing a high school journalist opposite Ryan Merriman and Danielle Panabaker. He also played Helmuth Hübener in the film Truth & Treason (????). On July 20, 2006, Osment was injured in a one-car accident. His blood-alcohol content was measured at 0.16%, twice the legal limit in California. On August 18, he was charged with four misdemeanors, including driving under the influence of alcohol and possession of marijuana while driving. He pleaded no contest on October 19 and was sentenced to three years' probation, 60 hours in an alcohol-rehabilitation and education program, a fine of $1,500, and a minimum requirement of 26 Alcoholics Anonymous meetings over a six-month period.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI1NDQyMDQ4Ml5BMl5BanBnXkFtZTYwNDIxMjMz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005286","name":"Haley Joel Osment","nicknames":["HJO"],"idIMDB":"nm0005286"},"actorId":"nm0005286","character":"Travis McCredle","urlCharacter":"http://www.imdb.com/character/ch0486202","main":true},{"actorName":"Ronda Rousey","urlProfile":"http://www.imdb.com/name/nm3313925","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzOTYwODY4NF5BMl5BanBnXkFtZTgwNzI2ODY4NTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 February 1987","placeOfBirth":" Riverside, California, USA","birthName":"Ronda Jean Rousey","height":"5' 7\" (1.7 m)","bio":"Ronda Rousey burst onto the women's MMA scene in August of 2010. Born in Riverside County, California on February 1, 1987 to parents Ron Rousey and AnnMaria DeMars, little Ronda was born with an umbilical cord wrapped around her neck that damaged her vocal cords. She didn't speak coherently until the age of six. Ronda was a self-professed tomboy and swam from the ages of 6 to 10. She competed on the Jr. Olympic swim team where she placed in the state level. Because of her mother, a 7th degree black belt and 1984 World Judo Champion, Ronda took up the sport. She had a hard time socializing with other kids and found that Judo gave her confidence. She holds a 4th degree black belt in the martial art. Ronda's Judo career is a storied one. At 17 she became the youngest judoka in the 2004 Olympic Games in Athens. That same year she won a gold medal at the World Junior Judo Championships in Budapest, and in 2006 she became the first U.S. female in almost 10 years to win an A-Level tournament going 5-0 to clench the gold at the World Cup in Great Britain. At 19 she won the bronze medal at the Junior World Championships. She is the first U.S. athlete to win two Junior World Medals. In 2007 she added a silver at the World Judo Championships and a gold at the Pan American Games. The pinnacle of her Judo career was a bronze at the 2008 Olympic Games in Beijing. Rousey became the first American to win an Olympic medal in women's Judo since it became an Olympic sport in 1992. After medaling in the Olympics, Ronda's career hit a dead end. She did some bartending to make ends meet and tried to find a better paying job, but it was tough finding anyone that needed her particular skill set. Throwing people down and putting them in armbars aren't really something you can put on a resume. By chance Ronda caught the Gina Carano vs. Julie Kedzie fight on television and things changed. She made her mixed martial arts debut as an amateur in 2010. Since then she has never lost a fight, winning the majority in the first round by armbar submission. Ronda took it upon herself to chase after and demand attention so that the UFC could no longer ignore women fighters. UFC President Dana White had publicly stated that women would never be allowed to fight in the UFC, but on February 23, 2013, Ronda did just that. She won the fight against Liz Carmouche in the first round with her signature armbar and became the first UFC Women's Bantamweight Champion. In 2014, Ronda appeared in her first motion picture - The Expendables 3 (2014). Other projects are Furious 7 (2015) and The Athena Project as well as Entourage (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzOTYwODY4NF5BMl5BanBnXkFtZTgwNzI2ODY4NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3313925","name":"Ronda Rousey","nicknames":["Rowdy","The Rowdy One","Rowdy Ronda","The Arm Collector"],"idIMDB":"nm3313925"},"actorId":"nm3313925","character":"Ronda","urlCharacter":"http://www.imdb.com/character/ch0508069","main":true},{"actorName":"Scott Mescudi","urlProfile":"http://www.imdb.com/name/nm3264596","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5MjI3NTIzNV5BMl5BanBnXkFtZTcwMTc1MzE5OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 January 1984","placeOfBirth":" Shaker Heights, Ohio, USA","birthName":"Scott Ramon Seguro Mescudi","height":"5' 8½\" (1.74 m)","bio":"Scott Mescudi was born on January 30, 1984 in Shaker Heights, Ohio, USA as Scott Ramon Seguro Mescudi.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5MjI3NTIzNV5BMl5BanBnXkFtZTcwMTc1MzE5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3264596","name":"Scott Mescudi","nicknames":["Juan Pablo","Cudder","The Lonely Stoner","Super Duper Cudi","Mr. Solo Dolo","Kid Cudi"],"idIMDB":"nm3264596"},"actorId":"nm3264596","character":"Allen","urlCharacter":"http://www.imdb.com/character/ch0069682","main":true},{"actorName":"Alan Dale","urlProfile":"http://www.imdb.com/name/nm0197638","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNzUxMTEyNl5BMl5BanBnXkFtZTcwNjA0MzM1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 May 1947","placeOfBirth":" Dunedin, Otago, New Zealand","birthName":"Alan Dale","height":"6' 2\" (1.88 m)","bio":"Alan Dale was born on May 6, 1947 in Dunedin, South Island, New Zealand. He is best known for his eight year role as Jim Robinson in the long running Australian soap opera Les voisins (1985), played Caleb in the hit Fox series The O.C. (2003), featured on Lost (2004) and has a long list of recurring roles. These include 24 (2001), NCIS (2003), The West Wing (1999), ER (1994) and The X-Files (1993). His film credits include The Girl with the Dragon Tattoo (2011), Priest (2011), After the Sunset (2004), Hollywood Homicide (2003) and Star Trek: Nemesis (2002). Alan has extensive theater credits. He played the lead role of King Arthur in \"Spamalot\" on the West End, London. He has hosted his own radio shows and is a successful voice-over artist in both Australia, the United Kingdom and the United States.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNzUxMTEyNl5BMl5BanBnXkFtZTcwNjA0MzM1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0197638","name":"Alan Dale","idIMDB":"nm0197638"},"actorId":"nm0197638","character":"John Ellis","urlCharacter":"http://www.imdb.com/character/ch0133171","main":true}],"seasons":[],"idIMDB":"tt1674771","urlIMDB":"http://www.imdb.com/title/tt1674771","business":{"budget":{"money":"$30,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$10,283,250","country":"USA","day":"07","month":"06","year":"2015","remarks":"3,108 Screens"}],"gross":[{"money":"$32,361,416","country":"USA","day":"09","month":"08","year":"2015","remarks":""},{"money":"$32,353,147","country":"USA","day":"02","month":"08","year":"2015","remarks":""},{"money":"$32,244,076","country":"USA","day":"19","month":"07","year":"2015","remarks":""},{"money":"$31,386,676","country":"USA","day":"28","month":"06","year":"2015","remarks":""},{"money":"$29,637,317","country":"USA","day":"21","month":"06","year":"2015","remarks":""},{"money":"$25,870,000","country":"USA","day":"14","month":"06","year":"2015","remarks":""},{"money":"$17,668,088","country":"USA","day":"07","month":"06","year":"2015","remarks":""},{"money":"$49,263,404","country":"Worldwide","day":"13","month":"08","year":"2015","remarks":""}],"weekendGross":[{"money":"$3,115","country":"USA","day":"09","month":"08","year":"2015","remarks":"21 Screens"},{"money":"$7,230","country":"USA","day":"02","month":"08","year":"2015","remarks":"41 Screens"},{"money":"$88,028","country":"USA","day":"19","month":"07","year":"2015","remarks":"188 Screens"},{"money":"$808,157","country":"USA","day":"28","month":"06","year":"2015","remarks":"544 Screens"},{"money":"$1,927,183","country":"USA","day":"21","month":"06","year":"2015","remarks":"1,304 Screens"},{"money":"$4,340,000","country":"USA","day":"14","month":"06","year":"2015","remarks":"3,108 Screens"},{"money":"$10,283,250","country":"USA","day":"07","month":"06","year":"2015","remarks":"3,108 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"Warner Bros. Entertainment Inc., Ratpac-Dune Entertainment LLC, Entourage Holdings LLC, and Home Box Office, Inc."},"technical":{"runtime":["1 hr 44 min (104 min)"],"soundMix":["Dolby Digital","Datasat"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam LT, Cooke S4, Fujinon Premier and Angenieux Optimo Lenses","Red Epic Dragon"],"laboratory":["Company 3, Los Angeles (CA), USA (digital intermediate)","FotoKem Laboratory, Burbank (CA), USA"],"filmLength":["(6 reels)"],"negativeFormat":["35 mm (Kodak Vision3 200T 5213, Vision3 500T 5219)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (3-perf) (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","D-Cinema"]},"rating":"6.6","metascore":"38","filmingLocations":[{"location":"Hollywood, California, USA"}],"rated":"R","awards":[],"votes":"63,984","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0008693","name":"Home Box Office (HBO)"},{"idCompany":"co0430860","name":"RatPac Entertainment"}],"keywords":{"keywords":["the golden globes","reference to paris hilton","reference to kim kardashian","arm sling","father son relationship","santa barbara california","helicopter","audition","reference to tupac shakur","reference to tonya harding","cameo","reference to johnny depp","flask","reference to instagram","therapy","movie studio","raised middle finger","caught having sex","slow motion scene","reference to steven spielberg","mansion","ecstasy","drugged drink","reference to scarlett johansson","gay character","reference to robert downey jr.","reference to yoko ono","amarillo texas","hospital","reference to karen carpenter","character repeating someone else's dialogue","convertible","husband wife relationship","skinny dipping","woman on top","film director","film producer","reference to mel gibson","reference to kevin costner","bleeped dialogue","friendship between men","ends with freeze frame","reference to britney spears","positano italy","american abroad","reference to natalie wood","bare chested male","spain","ibiza","jewish","gay wedding","topless female nudity","scene during end credits","one word title","written by director","actress playing herself","actor playing himself","actor","hollywood california","los angeles california","hotel","female rear nudity","party","cage fight","female fighter","cell phone","pregnant woman","swimming pool","yacht","film within a film","alcohol","pot smoking","sex talk","sex scene","male masturbation","viagra","lesbian cunnilingus","oral sex","based on tv series","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:29:55"}}