{"data":{"movies":[{"title":"L!fe Happens","originalTitle":"","year":"2011","releaseDate":"20120413","directors":[{"name":"Kat Coiro","id":"nm0192478"}],"writers":[{"name":"Kat Coiro","id":"nm0192478"},{"name":"Krysten Ritter","id":"nm1269983"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExOTk3MTcwNV5BMl5BanBnXkFtZTcwMjk1NDU2Nw@@._V1.jpg","countries":["USA","Canada"],"languages":["English"],"genres":["Comedy"],"plot":"Unabashed party girl, Kim, is in for a rush of reality after a one night stand results in unexpected motherhood. Clearly not ready for the dating \"buzz kill\" that having a baby can bring, Kim eventually comes to realize that being a good parent to a precious little boy has its own rewards...","simplePlot":"A comedy centered on two best friends, Kim and Deena, who fight to maintain normalcy in their lives after Kim gets pregnant and has a baby.","actors":[{"actorName":"Krysten Ritter","urlProfile":"http://www.imdb.com/name/nm1269983","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODgwMzUxODQ4NV5BMl5BanBnXkFtZTcwMjY1NTgxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 December 1981","placeOfBirth":" Bloomsburg, Pennsylvania, USA","birthName":"Krysten Alyce Ritter","height":"5' 9\" (1.75 m)","bio":"Krysten Ritter stars as Jessica Jones in the Peabody, Hugo, and Emmy Award winning Netflix original series, \"Marvel's Jessica Jones.\" Her performance, which earned her a prestigious Critics Choice nomination, a Saturn nomination, a Webby Award and a Glamour Best International TV Actress Award, has received rave reviews with the show being celebrated by critics and audiences alike for it's groundbreaking depiction of a reluctant anti-super-heroine with an alcohol problem and a wicked case of PTSD: who will not let a sexual assault from her past define her. She will also play Jessica Jones in \"Marvel's Defenders\" and the second season of \"Marvel's Jessica Jones\". Additional acting roles include her critically acclaimed turn as Jane Margolis on AMC's hit series, \"Breaking Bad\", the titular character in the cult favorite \"Don't Trust the B-- in Apartment 23\", \"Big Eyes\" directed by Tim Burton, indie darling \"Listen Up Phillip\", \"Life Happens\" which she co-wrote and co-produced, as well as roles in \"Veronica Mars\", \"The Blacklist\", \"Confessions of a Shopaholic\", and \"She's Out of My League.\" Growing up in a small-town farm in rural Pennsylvania, Ritter started her career in front of the camera as a model at 15-years-old. Her body of work has subsequently spanned film, television, theatre, writing, producing, music, and fashion design. In 2012, Ritter launched her production company Silent Machine where she juggles many projects in various stages of development, always with the objective of highlighting complex female protagonists. Ritter and her dog Mikey split their time between New York and Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODgwMzUxODQ4NV5BMl5BanBnXkFtZTcwMjY1NTgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1269983","name":"Krysten Ritter","idIMDB":"nm1269983"},"actorId":"nm1269983","character":"Kim","urlCharacter":"http://www.imdb.com/character/ch0363293","main":true},{"actorName":"Kate Bosworth","urlProfile":"http://www.imdb.com/name/nm0098378","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NTAwNDA0NV5BMl5BanBnXkFtZTcwNTk3MTg1Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 January 1983","placeOfBirth":" Los Angeles, California, USA","birthName":"Catherine Ann Bosworth","height":"5' 5\" (1.65 m)","bio":"Kate Bosworth was born in Los Angeles, California, to Patricia (Potter), a homemaker, and Harold Bosworth, who was an executive for Talbots. Unlike the characters Bosworth has portrayed in television and in film, which are known as \"townies\", Kate spent most of her childhood in different cities and states. At age 6, she and her parents moved to San Francisco, then to Connecticut at 9, and to Cohasset, Massachusetts, at 14. It was at 14 that Kate, a champion equestrian, learned of a casting call for a movie about horses. Although Kate attended the open audition in New York for the Robert Redford film The Horse Whisperer (1998) simply in hopes of getting the experience of what it was like to audition for a movie role, she won the role of the female lead's best friend and the chance to work with director/star Robert Redford. Her previous acting experience had consisted of singing at county fairs in California and acting in a community theatre production of \"Annie\". However, since landing the movie role, Kate seemed to be in more sound stages than ranches. Fearful that an early career would rob her of her childhood, she took 18 months off to live a normal life before opting to plunge into acting again. In 2000, she landed the role of the bratty sister in the feature film The Newcomers (2000) and the part of a football co-captain's girlfriend in the Denzel Washington movie Remember the Titans (2000). Throughout high school, Kate maintained academic excellence and was an honor roll student and a member of National Honor Society. In her spare time, she has volunteered with various non-profit organizations, including a Los Angeles program for physically challenged children who learn to ride horses with assistance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NTAwNDA0NV5BMl5BanBnXkFtZTcwNTk3MTg1Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0098378","name":"Kate Bosworth","nicknames":["Katie"],"idIMDB":"nm0098378"},"actorId":"nm0098378","character":"Deena","urlCharacter":"http://www.imdb.com/character/ch0363294","main":true},{"actorName":"Rachel Bilson","urlProfile":"http://www.imdb.com/name/nm1377375","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NjUxNzgxMV5BMl5BanBnXkFtZTcwNTc1Mjc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1981","placeOfBirth":" Los Angeles, California, USA","birthName":"Rachel Sarah Bilson","height":"5' 2\" (1.57 m)","bio":"Rachel Bilson was born in Los Angeles, to Janice (Stango), a sex therapist, and Danny Bilson. Her father is Ashkenazi Jewish and her mother is of Italian descent. She began acting while still at Notre Dame High School. She graduated high school in 1999 and went to Grossmont College but dropped out after a year and was encouraged to pursue a career in acting by her father, himself a writer, director and producer. She worked in commercials and landed a few one-off roles in high profile TV shows before landing the part of Summer Roberts in the hit TV series The O.C. (2003), establishing herself as a household name.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NjUxNzgxMV5BMl5BanBnXkFtZTcwNTc1Mjc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1377375","name":"Rachel Bilson","idIMDB":"nm1377375"},"actorId":"nm1377375","character":"Laura","urlCharacter":"http://www.imdb.com/character/ch0306123","main":true},{"actorName":"Geoff Stults","urlProfile":"http://www.imdb.com/name/nm0836176","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzEyMjMwMTQwNF5BMl5BanBnXkFtZTcwODE5OTcxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 December 1977","placeOfBirth":" Detroit, Michigan, USA","birthName":"Geoffrey Manton Stults","height":"6' 3½\" (1.92 m)","bio":"Geoff Stults was born in Detroit and raised in Colorado. Attended Whittier College from 1994-1998, where he performed in some theatrical productions and played division III football. Played professional Football in Europe as a wide receiver. He acted in the long running show, 7th Heaven (1996), in which he played Ben, the brother of Kevin Kinkirk who is portrayed by George Stults, his real life brother with whom he lives in Los Angeles. In 2006 he was cast as Eddie Latekka on ABC's \"October Road\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzBhZDEwYzItNTM3Yi00YzM2LTk1MGItZmNiN2ZjMTQ4ZjlhXkEyXkFqcGdeQXVyNTUwMTE2NzM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0836176","name":"Geoff Stults","idIMDB":"nm0836176"},"actorId":"nm0836176","character":"Nicholas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Justin Kirk","urlProfile":"http://www.imdb.com/name/nm0005095","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTE3NjAxNV5BMl5BanBnXkFtZTcwMDQ5NTk3MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1969","placeOfBirth":" Salem, Oregon, USA","height":"6' 1\" (1.85 m)","bio":"Born in Salem, Oregon, Justin Kirk spent his childhood in Union, Washington, where he attended grade school on a Native American reservation. Kirk knew from the age of 3 that he wanted to perform, and he made his acting debut at seven in a local college play. At 12, he moved with his mother to Minneapolis, Minnesota, and attended the Children's Theater School throughout high school. After graduation, he moved to New York and enrolled at Circle in the Square, where he completed a two-year conservatory acting program. He soon landed his first role on Broadway, in \"Any Given Day\" at the Longacre Theater, and quit his job as a bellboy at the Royalton Hotel. He has been working steadily ever since and is perhaps best known for his portrayal of the blind character Bobby on Broadway and in the feature film adaptation of Love! Valour! Compassion! (1997). Kirk was honored with an Obie Award for Distinguished Performance in the Ensemble. Additional stage work includes \"Old Wicked Songs\" at New York's Promenade Theater and Los Angeles' Geffen Playhouse, in which he starred as a piano prodigy, winning a Back Stage West Garland Award for Outstanding Performance. He also appeared in June Moon with the Drama Department, a theater company of which he is a founding member. A self-described radio nerd, Kirk divides his time between New York City and Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTE3NjAxNV5BMl5BanBnXkFtZTcwMDQ5NTk3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005095","name":"Justin Kirk","idIMDB":"nm0005095"},"actorId":"nm0005095","character":"Henri","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fallon Goodson","urlProfile":"http://www.imdb.com/name/nm3422132","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NDY5NjI0NF5BMl5BanBnXkFtZTcwNTUxMTU0OQ@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"birthName":"Fallon Patricia Goodson","height":"5' 2\" (1.57 m)","bio":"Fallon Goodson was born as Fallon Patricia Goodson. She is an actress and producer, known for L!fe Happens (2011), Maladies (2012) and Frontera (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NDY5NjI0NF5BMl5BanBnXkFtZTcwNTUxMTU0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3422132","name":"Fallon Goodson","idIMDB":"nm3422132"},"actorId":"nm3422132","character":"Jayde","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrea Savage","urlProfile":"http://www.imdb.com/name/nm0767242","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MTg4MTYxMV5BMl5BanBnXkFtZTgwNzk0MzEwMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1973","placeOfBirth":" Santa Monica, California, USA","birthName":"Andrea Kristen Savage","height":"5' 8\" (1.73 m)","bio":"Andrea Savage was born on February 20, 1973 in Santa Monica, California, USA as Andrea Kristen Savage. She is an actress and writer, known for Veep (2012), Step Brothers (2008) and The Hotwives of Las Vegas (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MTg4MTYxMV5BMl5BanBnXkFtZTgwNzk0MzEwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0767242","name":"Andrea Savage","idIMDB":"nm0767242"},"actorId":"nm0767242","character":"Patti","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kristen Johnston","urlProfile":"http://www.imdb.com/name/nm0005060","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMDIwNTg3OV5BMl5BanBnXkFtZTcwNTg1MTQyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 September 1967","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Kristen Angela Johnston","height":"6' (1.83 m)","bio":"Kristen Johnston studied acting at the Atlantic Theater Company Acting School in New York City. She won two Emmys for her role on 3rd Rock from the Sun (1996). She has appeared on many other television shows, including Ugly Betty (2006), ER (1994), Bored to Death (2009) and, perhaps most memorably, as the party girl whose famous final words were \"I'm so bored I could die\" on Sex and the City (1998). She's currently, on television, on TV Land's hit series, The Exes (2011), which is now in its fourth season. Just a few of Johnston's many stage credits are \"So Help Me God!\" (Drama desk nomination), \"The Women\", \"Aunt Dan & Lemon\", \"Love Song\" on the West End, as well as starring in three \"Shakespeare in Central Park\" productions, \"Much Ado About Nothing\", \"12th Night\", and \"The Skin of our Teeth\". She is a long-time member of The Atlantic Theater Company, and her roles over the years have included \"The Lights\" (Drama Desk Nomination) and \"Scarcity\". Kristen's film credits include Austin Powers: The Spy Who Shagged Me (1999), the 2nd Austin Powers film (as \"Ivana Humpalot\"), Finding Bliss (2009), Bad Parents (2012), Bride Wars (2009), L!fe Happens (2011), Vamps (2012), Strangers with Candy (2005), and the upcoming independent film, Lovesick (2014), with Matt LeBlanc. Johnston teaches acting at The Atlantic Theater Company's Acting School at NYU. She founded an organization called SLAM, whose goal is the creation of a desperately needed sober high school in New York City. Johnston's first book was a New York Times Bestselling memoir, entitled \"GUTS: the endless follies and tiny triumphs of a giant disaster\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMDIwNTg3OV5BMl5BanBnXkFtZTcwNTg1MTQyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005060","name":"Kristen Johnston","idIMDB":"nm0005060"},"actorId":"nm0005060","character":"Francesca","urlCharacter":"http://www.imdb.com/character/ch0407963","main":true},{"actorName":"Rhys Coiro","urlProfile":"http://www.imdb.com/name/nm1711052","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzODExMzY1MF5BMl5BanBnXkFtZTcwNjA2NDIzMQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 March 1979","placeOfBirth":" Calabria, Italy","height":"6' 2\" (1.88 m)","bio":"As a teenager, Coiro, a talented visual artist, spent summers building sets and operating lights at the New Jersey Shakespeare Festival. Inspired by numerous productions, including Julie Taymor's \"Titus Andronicus\" at Theater For A New Audience, Coiro decided to study theater at Carnegie Mellon University, where he eventually graduated with a BFA. He also spent time studying at The Moscow Art Theater in Russia. Coiro got his first professional gig as an understudy to three roles in the American premiere of Conor McPherson's off-Broadway play \"This Lime Tree Bower\" directed by Harris Yulin at Primary Stages. Within a month of graduating from CMU, Coiro landed the role of Eddie the Bellhop in the Lincoln Center revival of George S. Kauffman's \"Dinner at Eight\", directed by the late Gerald Gutierrez. Coiro then moved to Los Angeles and began working in construction, including a stint building a house with Nick Offerman. As recounted on Jerry Ferrara's podcast \"Bad 4 Business\", Coiro received the call that he'd landed his first on-screen acting gig, as Billy Walsh on \"Entourage\", while digging a hole for a deck in Echo Park. The role of Walsh was originally meant to be a guest star but soon evolved into an iconic character that has defined Coiro's career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzODExMzY1MF5BMl5BanBnXkFtZTcwNjA2NDIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1711052","name":"Rhys Coiro","idIMDB":"nm1711052"},"actorId":"nm1711052","character":"Marc","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Biggs","urlProfile":"http://www.imdb.com/name/nm0004755","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4Mzg0NjMwMV5BMl5BanBnXkFtZTcwNDgyNzE4NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1978","placeOfBirth":" Pompton Plains, New Jersey, USA","birthName":"Jason Matthew Biggs","height":"5' 9\" (1.75 m)","bio":"Jason Matthew Biggs was born on May 12, 1978, in Pompton Plains, New Jersey, to Angela (Zocco), a nurse, and Gary Biggs, a shipping company manager. Jason has two sisters, Heather, a tax specialist born in 1971, and Chiara, born in 1980. He was raised Catholic, and is of English and mostly Italian descent. Jason started acting at age five, appearing in several national commercials. In 1991, at 13 he won a part on the FOX sitcom Drexell's Class (1991), but the show was canceled after one season. Also during that year, he made his Broadway debut opposite Judd Hirsch in the play, Conversations With My Father. The play helped earn him a spot on As the World Turns (1956), as the rebellious Pete Wendall. The role earned him a nomination for Best Younger Actor in a Drama Series at the Daytime Emmy's. After graduating high school in 1996, he studied briefly at New York University and Montclair State University in New Jersey but dropped out to pursue acting again. In 1997, he costarred in the short lived television series Camp Stories (1997). In 1999 came his breakthrough role in the teen sex comedy American Pie (1999). His performance shocked yet wooed audiences, critics, and casting agents to bring him for the first time the chance to choose new roles and scripts. He chose such roles in Loser (2000) and Boys and Girls (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4Mzg0NjMwMV5BMl5BanBnXkFtZTcwNDgyNzE4NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004755","name":"Jason Biggs","idIMDB":"nm0004755"},"actorId":"nm0004755","character":"Sergei","urlCharacter":"http://www.imdb.com/character/ch0407961","main":true},{"actorName":"Seymour Cassel","urlProfile":"http://www.imdb.com/name/nm0001025","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NzE3MjMyNl5BMl5BanBnXkFtZTYwMzgyMzkz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 January 1935","placeOfBirth":" Detroit, Michigan, USA","birthName":"Seymour Joseph Cassel","height":"5' 7¾\" (1.72 m)","bio":"Seymour Cassel, the veteran character actor who was nominated for a Best Supporting Actor Oscar for his role as the hippie swinger Chet in John Cassavetes' Faces (1968), studied acting at the American Theatre Wing and at the Actors Studio. He made his movie debut in Cassavetes' first film, Shadows (1959), on which he also served as associate producer. Cassel's early career was tied to Cassavetes, who himself had a flourishing career as an actor on television and in major Hollywood productions in addition to becoming, arguably, the first great independent movie director after the collapse of the studio system in the late 1950s/early 1960s. As for Cassel, after his uncredited role in \"Shadows,\" he co-starred with Cassavetes in The Webster Boy (1962) and Too Late Blues (1961) before winding up in support of his friend in Don Siegel's The Killers (1964), a movie shot for TV that had to be released theatrically due to its heightened violence (it was also Ronald Reagan's last movie). Cassel primarily made his living on TV in the 1960s, frequently typecast as beatniks and hippies. He had a supporting role in the Cassavetes-directed episode \"A Pair of Boots\" (1962) for The Lloyd Bridges Show (1962) as well as appearing on such popular programs as 12 O'Clock High (1964), Combat! (1962) and The F.B.I. (1965) before scoring with his aging hippie in \"Faces\" at the end of that tumultuous decade. Along with \"Shadows,\" \"Faces\" remains his favorite Cassavettes film. In addition to acting, Cassel was also a crew member on the film, as the technical staff numbered all of seven. He helped shoot the film as a second cameraman, as well as adjusting the lighting. As the film was financed by Cassavettes himself, there were no union regulations to deal with, nor a studio schedule to keep. Several of Cassavettes' films were shot in continuity, so the actors could develop a character in sequence--similar to stage acting--rather than the traditional method of film making, which is shot out of sequence. Cassel has stated that this technique enhanced the success of his works by eliminating the \"fourth wall\" between the audience and the actors. He believes that acting tells the film's story, not the images and that what is important is how the audience relates to the characters on screen. As their careers matured, Cassel also co-starred with Cassavetes in two TV movies, Nightside (1973) and Nightside (1973) and appeared in supporting roles in three more Cassavetes-directed films: The Killing of a Chinese Bookie (1976), Opening Night (1977) and Love Streams (1984). In addition to appearing in studio films, Cassel has remained prominent in the American independent film community since the death of his friend and collaborator. He contributed a cameo appearance in the directorial debut of Steve Buscemi (with whom he appeared as a co-star in the black comedy In the Soup (1992)), Trees Lounge (1996), and has appeared in three films by Wes Anderson: Rushmore (1998), The Royal Tenenbaums (2001) and The Life Aquatic with Steve Zissou (2004). Cassel is prized by independent directors for two things: his positive nature, and his (perhaps) facetious declaration that he'd be in any independent film for the price of a plane ticket if he liked the script.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NzE3MjMyNl5BMl5BanBnXkFtZTYwMzgyMzkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001025","name":"Seymour Cassel","idIMDB":"nm0001025"},"actorId":"nm0001025","character":"Pop Pop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Louis Silvers","urlProfile":"http://www.imdb.com/name/nm0799008","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0OTIxMDQwOV5BMl5BanBnXkFtZTgwOTEwNTczNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Louis Silvers is known for his work on L!fe Happens (2011), Hot Stuff (1979) and Sharky's Machine (1981).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0OTIxMDQwOV5BMl5BanBnXkFtZTgwOTEwNTczNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0799008","name":"Louis Silvers","idIMDB":"nm0799008"},"actorId":"nm0799008","character":"Barry Robert Philips","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zachary Ross","urlProfile":"http://www.imdb.com/name/nm4130645","urlPhoto":"","biography":{"bio":"Zachary Ross is an actor, known for L!fe Happens (2011) and Matumbo Goldberg (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4130645","name":"Zachary Ross","idIMDB":"nm4130645"},"actorId":"nm4130645","character":"Baby Max","urlCharacter":"http://www.imdb.com/character/ch0300641","main":true},{"actorName":"Connor Ross","urlProfile":"http://www.imdb.com/name/nm4130903","urlPhoto":"","biography":{"bio":"Connor Ross is an actor, known for L!fe Happens (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4130903","name":"Connor Ross","idIMDB":"nm4130903"},"actorId":"nm4130903","character":"Baby Max","urlCharacter":"http://www.imdb.com/character/ch0300641","main":true},{"actorName":"Colin Egglesfield","urlProfile":"http://www.imdb.com/name/nm1148573","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTkwNDg0MTc4OF5BMl5BanBnXkFtZTgwMDE1ODU3NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1973","placeOfBirth":" Dearborn, Michigan, USA","birthName":"Colin Joseph Egglesfield","height":"6' (1.83 m)","bio":"Colin Egglesfield (born February 9, 1973) is an American actor. He is known for his roles as \"Josh Madden\" in the long-running soap opera, All My Children (1970), \"Auggie Kirkpatrick\" on The CW's short-lived drama series, Melrose Place (2009), and \"Evan Parks\" on The Client List (2012). He was born in Farmington Hills, Michigan, the second child of Kathleen (née Dineen) and William Egglesfield, a physician. His mother is Irish. He has two siblings: an older sister, Kerry, and a younger brother, Sean. He was brought up in a Catholic household.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTkwNDg0MTc4OF5BMl5BanBnXkFtZTgwMDE1ODU3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1148573","name":"Colin Egglesfield","idIMDB":"nm1148573"},"actorId":"nm1148573","character":"Ivan #1","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1726589","urlIMDB":"http://www.imdb.com/title/tt1726589","business":{"budget":{"money":"$930,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$20,186","country":"USA","day":"15","month":"04","year":"2012","remarks":"16 Screens"}],"gross":[{"money":"$2,000,000","country":"USA","day":"02","month":"09","year":"2016","remarks":""},{"money":"$20,186","country":"USA","day":"15","month":"04","year":"2012","remarks":""}],"weekendGross":[{"money":"$20,186","country":"USA","day":"15","month":"04","year":"2012","remarks":"16 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"19","month":"10","year":"2010","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 40 min (100 min) (USA)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Techniscope"],"printedFilmFormat":["35 mm"]},"rating":"5.6","metascore":"44","filmingLocations":[{"location":"1802 South Oxford Ave, Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"6,448","type":"Movie","companyCreditsSimple":[{"idCompany":"co0174383","name":"Stardust Pictures"},{"idCompany":"co0316216","name":"Dot Dot Dot Productions"}],"keywords":{"keywords":["one night stand","f rated","rapping in a car","singing in a car","los angeles california","roommate","friendship","single mother","emotional depression","limo driver","maid costume","pool scene","dog walker","writer","surfer","reality show","virgin","unplanned pregnancy","punctuation in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:15:15"}}