{"data":{"movies":[{"title":"Shadow People","originalTitle":"The Door","year":"2013","releaseDate":"20130319","directors":[{"name":"Matthew Arnold","id":"nm0036559"}],"writers":[{"name":"Matthew Arnold","id":"nm0036559"},{"name":"Matthew Arnold","id":"nm0036559"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYwMDk1MzY2N15BMl5BanBnXkFtZTcwNDk5OTU1OQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Thriller"],"plot":"A radio talk show host unravels a conspiracy about encounters with mysterious beings known as The Shadow People and their role in the unexplained deaths of several hundred victims in the 1980s.","simplePlot":"A radio talk show host unravels a conspiracy about encounters with mysterious beings known as The Shadow People and their role in the unexplained deaths of several hundred victims in the 1980s.","actors":[{"actorName":"Dallas Roberts","urlProfile":"http://www.imdb.com/name/nm1316767","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyOTIzMjQzN15BMl5BanBnXkFtZTcwOTk4NTc2OQ@@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 May 1970","placeOfBirth":" Houston, Texas, USA","birthName":"Dallas Mark Roberts","height":"5' 10½\" (1.79 m)","bio":"A native of Houston, Texas, Roberts, who attended Juilliard, has lived in New York City for 14 years. He was nominated for a Drama Desk Award for his role in the Off-Broadway play, \"Nocturne,\" by Adam Rapp. He is married to Christine Jones, who is the Set Designer for Spring Awakening and a professor at NYU. They have two sons, one of whom is named Ever Reverend Jones.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyOTIzMjQzN15BMl5BanBnXkFtZTcwOTk4NTc2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1316767","name":"Dallas Roberts","idIMDB":"nm1316767"},"actorId":"nm1316767","character":"Charlie Crowe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alison Eastwood","urlProfile":"http://www.imdb.com/name/nm0002055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MTQxMjc2OF5BMl5BanBnXkFtZTcwMDA2NTEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 May 1972","placeOfBirth":" Santa Monica, California, USA","height":"5' 8\" (1.73 m)","bio":"Alison Eastwood was born on May 22, 1972 in Santa Monica, California, USA. She is an actress and director, known for Midnight in the Garden of Good and Evil (1997), Tightrope (1984) and Absolute Power (1997). She has been married to Stacy Poitras since March 15, 2013. She was previously married to Kirk Fox.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MTQxMjc2OF5BMl5BanBnXkFtZTcwMDA2NTEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002055","name":"Alison Eastwood","idIMDB":"nm0002055"},"actorId":"nm0002055","character":"Sophie Lacombe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anne Dudek","urlProfile":"http://www.imdb.com/name/nm0240043","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MTc3MTY0N15BMl5BanBnXkFtZTgwOTYwMTE0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1975","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Anne Louise Dudek","height":"5' 10\" (1.78 m)","bio":"Anne was raised in Newton, Massachusetts. She got the role of Iphigenia in \"The Iphigenia Cycle\" in Chicago while still in theater school at Northwestern University. She was a resident artist at The Court Theatre in Chicago. The production moved off-Broadway to New York City, where she won the Joseph E. Calloway award for her performance, and was profiled in American Theater Magazine as one of ten young theater artists to watch. She then appeared on Broadway in Wrong Mountain, in productions in several regional theaters, and won the Connecticut Critics Circle Award for outstanding performance in The Glass Menagerie. Anne also worked in the United Kingdom as Clare in the BAFTA-nominated television series The Book Group (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MTc3MTY0N15BMl5BanBnXkFtZTgwOTYwMTE0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0240043","name":"Anne Dudek","idIMDB":"nm0240043"},"actorId":"nm0240043","character":"Ellen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mariah Bonner","urlProfile":"http://www.imdb.com/name/nm1751251","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk5ZjFkNzUtYjgyYS00MTM0LThjYTgtMWJiZDlkOTMwZTY2XkEyXkFqcGdeQXVyMjAwNzU1NzY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Mariah Bonner was born in Baltimore, Maryland, USA. She is an actress and producer, known for The Social Network (2010), Universal Soldier: Day of Reckoning (2012) and Lionne Blanche (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk5ZjFkNzUtYjgyYS00MTM0LThjYTgtMWJiZDlkOTMwZTY2XkEyXkFqcGdeQXVyMjAwNzU1NzY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1751251","name":"Mariah Bonner","idIMDB":"nm1751251"},"actorId":"nm1751251","character":"Maggie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mattie Liptak","urlProfile":"http://www.imdb.com/name/nm4001975","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0NDI3MjQ4M15BMl5BanBnXkFtZTgwMzQxNjI3NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1996","placeOfBirth":" Walker, Louisiana, USA","bio":"Mattie Liptak was born on April 10, 1996 in Walker, Louisiana, USA. He is an actor, known for Quarantine 2: Terminal (2011), Trumbo (2015) and Maggie (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0NDI3MjQ4M15BMl5BanBnXkFtZTgwMzQxNjI3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4001975","name":"Mattie Liptak","idIMDB":"nm4001975"},"actorId":"nm4001975","character":"Preston Camfield","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Berry","urlProfile":"http://www.imdb.com/name/nm0077512","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxNzIzMjgzM15BMl5BanBnXkFtZTgwMTU0MzkwODE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Christopher Berry is an actor, known for 12 Years a Slave (2013), Django Unchained (2012) and Dawn of the Planet of the Apes (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxNzIzMjgzM15BMl5BanBnXkFtZTgwMTU0MzkwODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0077512","name":"Christopher Berry","nicknames":["Charlie Bravo"],"idIMDB":"nm0077512"},"actorId":"nm0077512","character":"Tom DiMartino","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonathan Baron","urlProfile":"http://www.imdb.com/name/nm3247418","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNjM2MTA0MV5BMl5BanBnXkFtZTgwNDY4NjYwMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 May 1986","placeOfBirth":" California, USA","birthName":"Jonathan Radner Baron","bio":"Jonathan Baron was born on May 21, 1986 in California, USA as Jonathan Radner Baron. He is an actor and production manager, known for Stan Against Evil (2016), The Mentalist (2008) and True Blood (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNjM2MTA0MV5BMl5BanBnXkFtZTgwNDY4NjYwMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3247418","name":"Jonathan Baron","idIMDB":"nm3247418"},"actorId":"nm3247418","character":"Jeff Pyatt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Schiena","urlProfile":"http://www.imdb.com/name/nm1460101","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MjQzMjAwOV5BMl5BanBnXkFtZTcwMjQ3MTkyMQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"birthName":"Antonio Schiena","height":"6' 3\" (1.91 m)","bio":"Tony Schiena got his start in the film business with the role of Leonardo in William Shakespeare's Merchant of Venice, starring Al Pacino and Jeremy Irons. He quickly followed that with a starring role in the action thriller \"Wake of Death\", theatrically released in Europe, Asia and various other territories, Tony garnered great revues for his dramatic and action skills a like. Lead roles in John Irvin's Dot Kill and The Number One Girl opposite Oscar nominee Pat Morita and action villain Vinnie Jones, had Tony further showcase his dramatic range. His first appearance on television was as the main \"guest star\" opposite Oscar nominee's Gary Sinise in CSI NY. A quick succession of roles have seen Tony progress to leading man with incredible pace. Tony has since taken on a diverse array of roles. Bringing humor to the role of Johnny in \"The Bleeding\". Light romance as the charming treasure hunter, Max Belvedere in \"The Gold & The Beautiful\", versatility as a roaming warrior lost in the desert, in \"The Infidel\" and shock and betrayal in the sci-fi feature \"Saurian\". His latest action roles include starring in Lionsgate's Circle of Pain, in which Tony plays a destitute former mixed martial arts fighter, battling to get back on his feet and \"Locked Down\", starring Tony as an undercover cop thats infiltrated a crime syndicate operating from within a prison. \"Shadow People\" see's Tony's first exploration in the horror genre in the role of Robert, a stern and serious doctor witnessing the inexplicable. Tony's first venture behind the camera is executive producing \"Wilde Salome\", directed by and starring Al Pacino and Jessica Chastain. \"The Sheriff\" is a documentary television show that see's Tony lead a team of US special forces into Sheriff departments who are losing the battle against the Mexican drug cartels. Produced by Ben Silverman, Spike TV names Tony \"One of the most highly trained ex-military operatives in the world\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MjQzMjAwOV5BMl5BanBnXkFtZTcwMjQ3MTkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1460101","name":"Tony Schiena","idIMDB":"nm1460101"},"actorId":"nm1460101","character":"Robert","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ritchie Montgomery","urlProfile":"http://www.imdb.com/name/nm0599907","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NDY1OTY2N15BMl5BanBnXkFtZTgwNjM5MjIxMDI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Ritchie Montgomery is an actor, known for The Magnificent Seven (2016), One Mississippi (2015) and True Detective (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NDY1OTY2N15BMl5BanBnXkFtZTgwNjM5MjIxMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0599907","name":"Ritchie Montgomery","idIMDB":"nm0599907"},"actorId":"nm0599907","character":"Sparky","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marco St. John","urlProfile":"http://www.imdb.com/name/nm0820660","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3Njk3NjAwN15BMl5BanBnXkFtZTgwMjM4MjY2NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 May 1939","placeOfBirth":" New Orleans, Louisiana, USA","birthName":"Mark S. Figueroa","bio":"Marco St John graduated from Fordham Univ. in NYC and subsequently started as a stage actor there, doing several off Broadway plays, and regional theater, playing the role of Hamlet in that play at the San Diego Shakespeare Festival when he was 28 and subsequently nine productions on Broadway, the last of these a David Merrick production playing opposite Julie Harris in 40 Carats. While in this production he also played Dr. Paul Stewart in As the World Turns. He went on to do several TV Guest star roles and a series Ball Four, and several films as IMDB can attest to. At present he lives on the Mississippi Gulf Coast and works frequently in films and television in Louisiana and Georgia and in the Southeast, the last film Novitiate.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3Njk3NjAwN15BMl5BanBnXkFtZTgwMjM4MjY2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0820660","name":"Marco St. John","nicknames":["Fig"],"idIMDB":"nm0820660"},"actorId":"nm0820660","character":"Prof. Norman Fisher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Han Soto","urlProfile":"http://www.imdb.com/name/nm2404349","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MzY2MjI3OF5BMl5BanBnXkFtZTgwMzg2MDE5NDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Prior to working in the entertainment industry, Han was a successful businessman in the building trades industry, created and operates a website and branding business, has worked as an independent consultant in corporate Information Technology, and has decades of retail experience. As a new father to a beautiful daughter, Han is a family man who essentially raised his younger siblings and guided their education and professional careers while supporting his parents, assuming the role of head of the home, as his own father was stricken with a terminal disease. In addition to his endless family support, Han has contributed much to international relief organizations, including traveling to remote parts of India to document the plight of blind children at a school where the boys live after being rejected from their families. He is also a leader among North American students who come from Southeast Asia, and helps provide fund-raising, scholarships, direction, and support for these 1st and 2nd generation young Asian Americans. Han is a natural leader who has the ability to inspire and encourage people to do their very best, and his entire focus in life is to help and support people to achieve excellence in their personal lives, as well as in their families and communities, both locally and abroad. He recently completed producing a documentary about a Civil Rights worker, a man who was a friend and colleague of Dr. Martin Luther King, Jr. and had a significant and long-lasting impact on race relations in America. Future projects include producing inspirational and educational film and television projects, and helping provide to others opportunities similar to those that helped him early in his career, and continuing work with non-profits by guidance, viral marketing support, being a high visibility spokesperson and networker, and personally funding permanent projects in some of the neediest areas of the planet.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MzY2MjI3OF5BMl5BanBnXkFtZTgwMzg2MDE5NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2404349","name":"Han Soto","nicknames":["Bullet"],"idIMDB":"nm2404349"},"actorId":"nm2404349","character":"Coroner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Billy Slaughter","urlProfile":"http://www.imdb.com/name/nm1551999","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MTQ4OTUyNV5BMl5BanBnXkFtZTgwOTY3NTAxMDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 June 1980","placeOfBirth":" New Orleans, Louisiana, USA","birthName":"William H. Slaughter","height":"5' 7\" (1.7 m)","bio":"A New Orleans native, Billy Slaughter is considered one of the top actors to come out of \"Hollywood South\" and was brought to Los Angeles at the invite of Dustin Hoffman. Since he began acting, Billy was recognized for being an outstanding young talent. He was the youngest lead actor recipient of The Marquee Award for his role in \"Equus,\" the youngest acting instructor in New Orleans, and the youngest company member of Louisiana's Shakespeare Festival. Billy trained classically in England at The British American Dramatic Academy (BADA) and has lived and worked in New York and L.A. He holds a B.A. in Drama and Communications from the University of New Orleans, where he graduated #1 in the Drama program (Cum Laude), and was offered a personal scholarship to The Strasberg Institute by Anna Strasberg. Slaughter has performed in over 75 feature films and television series, including: \"The Campaign,\" \"The Big Short,\" \"Max Steel,\" \"American Horror Story,\" and \"Zoo.\" And he has worked with numerous icons in the business from Robert DeNiro, Anthony Hopkins, and Gene Hackman to Will Ferrell, Will Smith, and Sylvester Stallone. Recently, Billy had a major role in \"The Magnificent 7\" opposite Denzel Washington, Chris Pratt, and Ethan Hawke; worked opposite Tom Cruise in \"Jack Reacher 2\"; and opposite Kevin Spacey in \"Billionaire Boys Club.\" He additionally starred in the dark comedy \"Laundry Day\" and the crime thriller \"Dark Meridian,\" which he also executive produced. Billy has a slate of upcoming projects he will be producing in association with his company Panta Rei Productions, including the literary biopic \"Butterfly in the Typewriter.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MTQ4OTUyNV5BMl5BanBnXkFtZTgwOTY3NTAxMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1551999","name":"Billy Slaughter","nicknames":["Billy the Kid"],"idIMDB":"nm1551999"},"actorId":"nm1551999","character":"TV Anchor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Angelena Swords","urlProfile":"http://www.imdb.com/name/nm1823134","urlPhoto":"","biography":{"height":"5' 6\" (1.68 m)","bio":"Angelena Swords is from Patterson, Louisiana. After graduating from LSU in Baton Rouge, Louisiana she and her husband moved to Los Angeles. She now resides in New Orleans, Louisiana where she works as an actor, host of \"The Sean Payton Show\" along with head coach of the New Orleans Saints, Sean Payton. She is also a photographer and owns the popular Brocato Photojournalism along with her husband. She is represented by Claudia Speicher with New Orleans Model and Talent.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1823134","name":"Angelena Swords","idIMDB":"nm1823134"},"actorId":"nm1823134","character":"Reporter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bryan Massey","urlProfile":"http://www.imdb.com/name/nm0557287","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MTM3Njc2N15BMl5BanBnXkFtZTgwNDAwNTM0MzE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1971","placeOfBirth":" Pontiac, Michigan, USA","birthName":"Bryan William Massey","height":"5' 10\" (1.78 m)","bio":"Bryan Massey was born in Pontiac, Michigan but moved to Dallas, Texas when he was just 7 years old. He began his illustrious acting career at the tender age of 9 when he made the local paper by winning the 5th grade talent show lip syncing to Steve Martin's \"King Tut.\" At the age of 13, Bryan showed an interest in cartooning and filmmaking, so his Dad bought him a Super 8mm camera. Recruiting the neighborhood and his family, Bryan would spend his weekend's shooting comedic action shorts with his beloved camera. During high school, Bryan dropped out of football because it conflicted with his theater schedule. In college, Bryan had lead roles in several musicals, participated in community theater, made several short movies with his buddies on campus, and was a nationally ranked member of the cheer-leading squad. After earning an Associate's Degree in Radio/Television, Bryan decided to pursue his acting career and moved to Hollywood, where he got his SAG card playing a Nazi on the X-Files. After spending 4 years in Los Angeles Bryan returned home to Texas, working in local improvisation troupes and continuing to write his own projects. With no local agent he would later go on to get a stint on Prison Break, only after crashing the audition! He quickly went on to sign with a local agent and due to his unique gruff voice, Bryan was able to participate in his love of cartoons by doing voice over work for many anime shows and video games. Bryan has booked several commercials and acted in many short films and independents. Bryan has also been able to go onto more prolific roles including playing Detective Brinkley, a cop in hot pursuit of Diane Keaton and Ted Danson in \"Mad Money\", as Skeeter, an oil man friend to Josh Brolin's portrayal of George W. Bush in Oliver Stones critically acclaimed \"W\" and can also be seen in this summer's much anticipated Judd Apatow comedy \"Year One\" starring Jack Black and Michael Cera, coming to theaters June 19th.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MTM3Njc2N15BMl5BanBnXkFtZTgwNDAwNTM0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0557287","name":"Bryan Massey","nicknames":["Mass Attack"],"idIMDB":"nm0557287"},"actorId":"nm0557287","character":"Bill Ryder","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Grubbs","urlProfile":"http://www.imdb.com/name/nm0344196","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGNlY2EyMGMtMzE3NS00NGJkLTg5YzMtNmYwNjU2NWU1NTdlXkEyXkFqcGdeQXVyNzQ4ODA3ODk@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 November 1949","placeOfBirth":" Amory, Mississippi, USA","birthName":"Jon Gary Grubbs","height":"6' 4\" (1.93 m)","bio":"Gary and his wife Glenda, moved to Los Angeles in 1977 for Gary to pursue a writing career. He went on an open call as an actor, got the part, and now two hundred parts later Gary is still acting. Gary and Glenda now have a home in Mississippi and an apartment in Los Angeles and Gary works both the southern and L.A. markets. In the last few years Gary has devoted much of his time to writing and has successfully sold two pilot scripts to CBS, two screenplays and had his first full length equity play, \"As The Crow Flies,\" receive it's world premier. The production was both a creative and financial success and received many positive reviews. Currently he has a project in development at Warner Horizon. In 2008 Gary can be seen in \"In The Electric Mist\" with Tommie Lee Jones,\" \"Deal\" with Burt Reynolds, \"Good Intentions\" with Elaine Hendrix, \"Major Movie Star\" with Jessica Simpson, and \"My Mom's New Boyfriend\" with Meg Ryan and Antonio Banderas. Gary has worked as an actor for some of the most distinguished film directors of our time in a number of motion pictures, including \"JFK\" (Oliver Stone), \"Silkwood\" (Mike Nichols), \"Nadine\" (Robert Benton), \"Honkytonk Man\" (Clint Eastwood), and \"The Border\" (Tony Richardson). Other feature credits include \"X-Files The Movie,\" \"Doubletake,\" and \"Astronaut's Wife\". On television, Grubbs made a name for himself by portraying attorneys in two of the highest rated programs in television history, \"The Burning Bed\" and \"Fatal Vision\". He has also starred in numerous Movies-of-the-Week and Mini-series, including \"Canal Street Brothel,\" \"For One Night\" \"Foxfire,\" and many others. Gary's recent series and episodic work includes appearances on ER, Angel, NCIS, K-ville, Will & Grace and The O.C. Gary and Glenda have a daughter Molly who is employed at Team One Advertising in Los Angeles, and their son Logan is a grad student at The University of Southern Mississippi.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGNlY2EyMGMtMzE3NS00NGJkLTg5YzMtNmYwNjU2NWU1NTdlXkEyXkFqcGdeQXVyNzQ4ODA3ODk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0344196","name":"Gary Grubbs","idIMDB":"nm0344196"},"actorId":"nm0344196","character":"CDC Director","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1764647","urlIMDB":"http://www.imdb.com/title/tt1764647","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 29 min (89 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.4","filmingLocations":[{"location":"Baton Rouge, Louisiana, USA"}],"rated":"PG-13","awards":[],"votes":"2,578","type":"Movie","companyCreditsSimple":[{"idCompany":"co0119072","name":"Infinity Media"},{"idCompany":"co0195173","name":"Upload Films"}],"keywords":{"keywords":["radio talk show host","shadow person","paranormal activity","psychological experiment","talk show host","found footage","female rear nudity","two word title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:58:36"}}