{"data":{"movies":[{"title":"The Little Lamb: A Christmas Story","originalTitle":"","year":"1955","releaseDate":"1955","writers":[],"runtime":"9 min","countries":["USA"],"languages":["English"],"genres":["Short","Drama","Family"],"plot":"A lamb that had wandered off plays a significant part in the Nativity.","simplePlot":"A lamb that had wandered off plays a significant part in the Nativity.","actors":[{"actorName":"Morris Ankrum","urlProfile":"http://www.imdb.com/name/nm0030194","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTIyZjM1ZDItNjNhZS00ZDgxLWExMmUtM2FmZTg5ZDYyZjhhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1897","placeOfBirth":" Danville, Illinois, USA","birthName":"Morris Winslow Ankrum","height":"6' (1.83 m)","bio":"A graduate of the University of Southern California School of Law, Morris Ankrum was an attorney and an economics professor before switching careers and joining the theater. He was a veteran stage actor by the time he entered the film industry in the 1930s, where he spent much time in westerns, playing everything from Indian chiefs to crooked town bankers. He was often cast as the villain in numerous films of the highly popular Hoplaong Cassidy series. It was in the 1950s, though, that he hit his stride in the genre for which he is most fondly remembered - science-fiction films, where his gruff, no-nonsense demeanor and authoritative voice perfectly fit the role of the military officer helping scientists fight an outer-space menace, most memorably as Col. Fielding in the classic Invaders from Mars (1953). Toward the end of his career Ankrum had a recurring role as a judge on the Perry Mason (1957) TV series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTIyZjM1ZDItNjNhZS00ZDgxLWExMmUtM2FmZTg5ZDYyZjhhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0030194","name":"Morris Ankrum","nicknames":["Morrie"],"idIMDB":"nm0030194"},"actorId":"nm0030194","character":"Azar the Shepherd","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maureen O'Sullivan","urlProfile":"http://www.imdb.com/name/nm0001577","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDAyOTIzNDgxM15BMl5BanBnXkFtZTYwNjc5ODQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1911","placeOfBirth":" Boyle, County Roscommon, Ireland","birthName":"Maureen Paula O'Sullivan","height":"5' 3\" (1.6 m)","bio":"Maureen Paula O'Sullivan was born on May 17, 1911 in County Roscommon, Ireland, to Evangeline \"Mary Eva\" Lovatt (Frazer) and Charles Joseph O'Sullivan, an officer in the Connaught Rangers. She was of Irish, English, and Scottish descent. The future mother of Mia Farrow was educated in private Catholic girls schools in London, Dublin, and Paris. Maureen was a classmate of Vivien Leigh, another actress destined for screen immortality. Even as a schoolgirl, Maureen desired an acting career; she studied hard and read widely. When the opportunity to be an actress came along, it almost dropped in her lap. The director Frank Borzage was in Dublin filming Song o' My Heart (1930) when Maureen, then 18, met him. Borzage suggested a screen test, which she took. The results were more than favorable, as she won the part of Eileen O'Brien. The part was a substantial one, so much so that Maureen went on to Hollywood to complete the filming. Once in sunny California, Maureen wasted no time landing roles in other films such as Just Imagine (1930), Princess and the Plumber (1930), and So This Is London (1930). She was perhaps MGM's most popular ingenue throughout the 1930s in a number of non-Tarzan vehicles. Maureen was on a roll that her contemporaries could only have wished for when they were coming up through the ranks. In 1932, Maureen was teamed up with Olympic medal winner Johnny Weissmuller for the first time in Tarzan the Ape Man (1932). Five other Tarzan films followed, the last being Tarzan's New York Adventure (1942). The Tarzan epics rank as one of the most memorable series ever made. Most people agree that those movies would not have been successful had it not been for the fine acting talents, not to mention beauty, of Maureen O'Sullivan. But she was more than Jane Parker in the Tarzan films; she had great roles and played beautifully in films such as The Flame Within (1935), David Copperfield (1935), and Anna Karenina (1935). She turned in yet another fine performance in Pride and Prejudice (1940). After the 1940s, Maureen made far fewer films, not because she lost popularity but by choice. It isn't always easy to walk away from a lucrative career, but she did because she wanted to devote more time to her husband, John Farrow, an Australian writer, and their seven children: Michael, Patrick, Maria (Mia Farrow), John, Prudence, Theresa (Tisa Farrow), and Stephanie Farrow. The couple were married from 1936 until his death in 1963. After her last Tarzan she asked for release from her contract to care for her husband, who had just left the Navy with typhoid. She did not, however, retire completely; Maureen still found time to make occasional movies, television and stage appearances, and operate a bridal consulting service (Wediquette International).. Later movie patrons remember her as Elizabeth Alvorg in the hit film Peggy Sue Got Married (1986). Her final silver screen appearance was in The River Pirates (1988). Some TV movies followed, but only until 1996. She maintained homes in New Hampshire and Arizona, and it was in Scottsdale that Maureen died on June 23, 1998, of a heart attack. She was 87 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDAyOTIzNDgxM15BMl5BanBnXkFtZTYwNjc5ODQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001577","name":"Maureen O'Sullivan","idIMDB":"nm0001577"},"actorId":"nm0001577","character":"Mother","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1727546","urlIMDB":"http://www.imdb.com/title/tt1727546","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["9 min (approx)"],"soundMix":["Mono"],"color":["Black and White"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.8","filmingLocations":[],"awards":[],"votes":"13","type":"Movie","companyCreditsSimple":[{"idCompany":"co0149686","name":"United World Films"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 05:25:47"}}