{"data":{"movies":[{"title":"Persecuted","originalTitle":"","year":"2014","releaseDate":"20140718","directors":[{"name":"Daniel Lusko","id":"nm2662079"}],"writers":[{"name":"Daniel Lusko","id":"nm2662079"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNjg2MTY4N15BMl5BanBnXkFtZTgwNzE1NDc3MTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Drama","Mystery","Thriller"],"plot":"Nationally acclaimed evangelist John Luther is the last obstacle in the way of sweeping religious reform in the States. When a U.S. Senator and Luther's own supporters abduct and frame him in the murder of an innocent teenage girl, an unprecedented era of persecution is unleashed. Out on personal recognizance, Luther escapes police surveillance in search of the truth. And suddenly a once-normal life is targeted by a team of ex-military operatives who wage a relentless campaign to eliminate the incriminating evidence. As evangelist turned fugitive, Luther vows to expose anyone involved with, or profiting from, the girl's murder. It's a mission that brings him face-to-face with the coming storm of persecution that will threaten the entire American Christian community.","simplePlot":"An evangelist finds himself framed for murder and on the run after he refuses to back a senator's proposition calling for sweeping religious reform.","actors":[{"actorName":"James Remar","urlProfile":"http://www.imdb.com/name/nm0001664","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NzMwNjAyN15BMl5BanBnXkFtZTgwNDA5NTkyMDI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1953","placeOfBirth":" Boston, Massachusetts, USA","birthName":"William James Remar","height":"5' 10\" (1.78 m)","bio":"James is a rugged, intense character player with leading man good looks. Having first gained recognition in 1979 as Ajax, in his second film, The Warriors (1979). That same year he garnered acclaim on Broadway with Richard Gere in the concentration camp drama \"Bent\". In a career spanning nearly four decades, James has run the gamut of roles and solid career choices. Ranging from the psychopaths, Dutch Schultz in 'Francis Copolla''s The Cotton Club (1984) and 'Albert Ganz' in Walter Hill's 48 Hrs. (1982) to Samantha's lover, the billionaire playboy, Richard Wright, in the HBO series Sex and the City (1998).\" James has also garnered roles which highlight a more vulnerable side, such as his guitarist who gets a break in the Oscar-winning short, Session Man (1991) or his artist who falls in love with a gargoyle come to life in the best segment of the horror anthology, Tales from the Darkside: The Movie (1990) and as Mary Louise Parker's lover in Boys on the Side. More recently James starred along side Michael C. Hall in the hit Showtime series Dexter (2006) where he played Dexter's wise, compassionate, adoptive father, Harry Morgan. Grey's Anatomy fans have recently enjoyed seeing James as Karev's long-lost Dad. While remaining active with top feature films James enjoys the distinction of being the only actor to die twice, as two different characters in Quentin Tarintino's smash hit Django Unchained. James won the 8th annual SAG award as a member of the Outstanding Comedy Ensemble for his work in Sex and the City. As a member of the ensemble cast of Dexter, James has been nominated for the SAG award and the Emmy. In recognition for his work in Sci-Fi Fantasy and Horror James was honored with the Saturn Lifetime Achievement Award in 2013.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NzMwNjAyN15BMl5BanBnXkFtZTgwNDA5NTkyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001664","name":"James Remar","idIMDB":"nm0001664"},"actorId":"nm0001664","character":"John Luther","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dean Stockwell","urlProfile":"http://www.imdb.com/name/nm0001777","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM3NTk3OTcwOV5BMl5BanBnXkFtZTcwNTUzNzgwMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 March 1936","placeOfBirth":" North Hollywood, Los Angeles, California, USA","birthName":"Robert Dean Stockwell","height":"5' 7\" (1.7 m)","bio":"Photogenic American child actor of the 1940s, popular due in no small measure to his air of innocence and his beautiful, cherubic face with its dimples and his sparkling eyes, topped with a crown of curls. Still an actor in demand while well into his middle years, he is one of the few juvenile performers to succeed lifelong in films. Considering child actors who matured gracefully, his career can be likened perhaps only to that of Natalie Wood, excepting her degree of stardom.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM3NTk3OTcwOV5BMl5BanBnXkFtZTcwNTUzNzgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001777","name":"Dean Stockwell","idIMDB":"nm0001777"},"actorId":"nm0001777","character":"Dave Wilson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Raoul Max Trujillo","urlProfile":"http://www.imdb.com/name/nm0874232","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA3ODAxMTk5MV5BMl5BanBnXkFtZTgwODA1NDExMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 May 1955","placeOfBirth":" New Mexico, USA","height":"6' 1\" (1.85 m)","bio":"Raoul Max Trujillo, aka Raoul Maximiano Trujillo de Chauvelon was born in Northern New Mexico. He is a mixed blood descendant of Ute,Apache,Comanche, Pueblo, Tlascalan, French, Sephardic Jew and Andalusian Moor. After high school, he spent three years serving in the military in Germany. After his discharge, he worked as an alpine ski instructor in Taos, New Mexico. Ski Flash Magazine out of France wrote about him and his unique style of teaching skiing. He left the world of professional skiing after traveling extensively through Mexico, Central and South America on his way to teach in San Carlos de Bariloche in Argentina. It was a wake up call to exploring native America and beginning his journey in creating art based on his cultural roots.. He started work in the theatre as a scenic painter and landed his first job in 1977 as an actor/dancer in a production of \"EQUUS\", in Santa Fe, N.M. It was his first paid professional work as well as his debut in the theatre with no training at all albeit high school drama. He now had the bug to study formally. He began dancing in Los Angeles in 1978 at USC and saw his first modern dance and ballet productions; Pilobolus, Martha Graham and Rudolph Nureyev. He was hooked. The next two years, he trained extensively with the Toronto Dance Theatre and Nikolais/Louis Dance Lab in New York City on scholarships. He was asked to join Nikolais Dance Theatre under the direction of the master Alwin Nikolais, who became his mentor and he began touring the world performing in the grandest of opera houses and old Roman theaters in northern Africa to bamboo fields in China. He also learned scenic, costume and lighting design during this time from 1980 to 1987. After leaving the company, he began his solo work as dancer and choreographer and commenced his journey into shamanic ceremonials and incorporating native myths and legends in his work. After the first decade of performing as a dancer, he became the choreographer and co-director for the American Indian dance Theatre, the first professional native dance company incorporating traditional dance with contemporary retelling of myths and legends. He choreographed, \"The Shaman's Journey\", for the Asia Society in New York City and later was adapted into a short film for PBS on Alive From Off Center. He went on to join creative partners Alejandro Roncerria and Rene Highway in Toronto. This work resulted in creating successful theatre pieces for Native Earth Theatre Company. He directed, \"The Son Of Ayash\" and \"The Jaguar Project\". For Buffalo State College and the Repertory Dance Theatre of Utah, he directed,\"The Maid of the Mist and the Thunder Beings\", and for the Ordway Music Theatre, \"Tribe\". His work with Alejandro continued and he helped establish the Aboriginal Dance Project at the Banff Center for the Arts to further train Indigenous dancers from all over the world. For New Line Cinema, he choreographed the dances, ceremonies and rituals for Terrence Malick's film, \"The New World\". Raoul began work as an actor in film and television in 1988 and continues to work up to the present. See resume for those projects. Finally, he created his present company Tzacol productions, Inc. in 1992. It is the umbrella company for Tzacol Tantric Theatre and Tzacol Tribal Theatre made up of dancer, actor and aerial artists, producing original work in the realm of tartaric and tribal spectacle. \"Forbidden Goddesses\", is the first realized work. Work on \"Journey\", a multi-media piece for Roots and Rhythms Festival in Santa Fe resulted in the full evening work, \"Homo Erectus\". These last works are multi-media and inter-disciplinary theatre and film projects. \"The Dreamer\" is his first completed screenplay. In 2002 he received the CANCOM Ross Charles award in Canada to attend the Banff Center's screenwriters workshop for aboriginal storytellers. The last branch of the company, Tzacol Tantric Arts produces painting and sculptural art. His work now spans more than three decades as an artist in varied disciplines and media. He has gone from dancer to choreographer, actor to director and screenwriter during this time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA3ODAxMTk5MV5BMl5BanBnXkFtZTgwODA1NDExMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0874232","name":"Raoul Max Trujillo","idIMDB":"nm0874232"},"actorId":"nm0874232","character":"Mr. Gray","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bruce Davison","urlProfile":"http://www.imdb.com/name/nm0001117","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmExMzM3ZmMtYjRmYi00YmRlLTliOGMtYTk2ODcxMjkxMTBmL2ltYWdlXkEyXkFqcGdeQXVyMTQyNjk5Mzc@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1946","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"6' 1\" (1.85 m)","bio":"With his blond, clean-cut, Ivy League handsomeness and ready-whipped smile reminiscent of Kennedyesque times, actor Bruce Davison fits the prototype of today's more current crop of fresh-faced, likable blonds such as Brian Kerwin and Aaron Eckhart. While it proved difficult at times for the actor to get past those perfect features and find meatier roles, his talent certainly overcame the \"handicap\". Extremely winning and versatile, the award-worthy actor, now enjoying an over four decade career, has included everything from Shakespeare to Seinfeld. He has also served as a writer, producer and director on an infrequent basis. Born on June 28, 1946, in Philadelphia, Pennsylvanis, the son of Clair, an architect and musician, and Marian (Holman) Davison, a secretary, Bruce's parents divorced when he was just three. He developed a burgeoning interest in acting while majoring in art at Penn State and after accompanying a friend to a college theater audition. Making his professional stage debut in 1966 as Jonathan in \"Oh Dad, Poor Dad, Mama's Hung You in the Closet and I'm Feelin' So Bad\" at the Pennsylvania Festival Theatre, he had made it to Broadway within just a couple of years (1968) in the role of Troilus in \"Tiger at the Gates\" at the Vivian Beaumont Theatre. The year after that he was seen off-Broadway in \"A Home Away from Home\" and appeared at the Lincoln Center in the cast of \"King Lear\". Success in the movies came immediately for the perennially youthful-looking actor after he and a trio of up-and-coming talents (Barbara Hershey [then known as Barbara Seagull], Richard Thomas and Catherine Burns) starred together in the poignant but disturbing coming-of-age film Last Summer (1969). From this he was awarded a starring role opposite Kim Darby in The Strawberry Statement (1970), an offbeat social commentary about 60s college radicalism, and in the cult horror flick Willard (1971) in which he bonded notoriously with a herd of rats. Moving further into the 70s decade, his film load did not increase significantly as expected and the ones he did appear in were no great shakes. With the exception of his co-starring role alongside Burt Lancaster in the well-made cavalry item Ulzana's Raid (1972) and the powerful low-budget Short Eyes (1977) in which he played a child molester, Bruce was surprisingly ill-used or underused. Insignificant as the elder Patrick Dennis in the inferior Lucille Ball musical film version of Mame (1974), he was just as overlooked in such movies as The Jerusalem File (1972), Mother, Jugs & Speed (1976), Grand Jury (1976) and Brass Target (1978). Bruce wisely looked elsewhere for rewarding work and found it on the stage and on the smaller screen. Earning strong theatrical roles in \"The Skin of Our Teeth,\" \"The Little Foxes\" and \"A Life in the Theatre,\" he won the Los Angeles Drama Critics Award for his work in \"Streamers\" in 1977. On TV, he scored in mini-movie productions of Mourning Becomes Electra (1978), Deadman's Curve (1978) (portraying Dean Torrence of the surf-era pop duo Jan and Dean) and, most of all, Summer of My German Soldier (1978) co-starring Kristy McNichol as a German prisoner of war in the American South who falls for a lonely Jewish-American girl. In 1972 Bruce married actress Jess Walton who appeared briefly as a college student in The Strawberry Statement (1970) and later became a daytime soap opera fixture. The marriage was quickly annulled the following year. The 1980s was also dominated by strong theater performances. Bruce took over the role of the severely deformed John Merrick as \"The Elephant Man\" on Broadway; portrayed Clarence in \"Richard III\" at the New York Shakespeare Festival; was directed by Henry Fonda in \"The Caine Mutiny Court Martial\"; played a moving Tom Wingfield opposite Jessica Tandy's Amanda in \"The Glass Menagerie\"; received a second Los Angeles Drama Critics Award for his work in the AIDS play \"The Normal Heart\"; and finished off the decade gathering up fine reviews in the amusing A.R. Gurney period piece \"The Cocktail Hour\". While hardly lacking for work on film (Kiss My Grits (1982), Crimes of Passion (1984), Spies Like Us (1985), and The Ladies Club (1986)), few of them made use of his talents and range. It was not until he was cast in the ground-breaking gay drama Longtime Companion (1989) that his film career revitalized. Giving a quiet, finely nuanced, painfully tender performance as the middle-aged lover and caretaker of a life partner ravaged by AIDS, Bruce managed to stand out amid the strong ensemble cast and earn himself an Oscar nomination for \"Best Supporting Actor\". Although he lost out to the flashier antics of Joe Pesci in the mob drama Goodfellas (1990) that year, Bruce was not overlooked -- copping Golden Globe, Independent Spirit, New York Film Critics and National Society of Film Critics awards. Other gay-themed films also welcomed his presence, including The Cure (1995) and It's My Party (1996). The actor eventually served as a spokesperson for a host of AIDS-related organizations, including Hollywood Supports, and, elsewhere, is active with foundations that help children who are abused. Bruce has been all over the screen since his success in Longtime Companion (1989). Predominantly seen as mature, morally responsible dads and politicians, his genial good looks and likability have on occasion belied a weak or corrupt heart. Bruce married actress Lisa Pelikan in 1986 (well over a decade after his first marriage ended) and they have one son, Ethan, born in 1996. The handsome couple became well known around town and worked frequently together on stage (\"The Downside,\" \"Love Letters,\" \"Breaking the Silence,\" \"To Kill a Mockingbird\") and in TV movies (Color of Justice (1997)). Bruce's more popular films these days have included Six Degrees of Separation (1993) starring Will Smith, the family adventure film Far from Home: The Adventures of Yellow Dog (1995) and the box-office hit X-Men (2000) and its sequel in the role of Senator Kelly. More controversial art-house showcases include Dahmer (2002), as serial killer Jeffrey Dahmer's father, and Hate Crime (2005), as a bigoted, murderous pastor. Bruce has attempted TV series leads in later years. With Harry and the Hendersons (1991), he ably directed a number of the show's episodes. He has also been tapped for recurring parts on The Practice (1997) and The L Word (2004), and is fondly remembered for his comedy episodes on Seinfeld (1989) as an attorney who goes for George's (Jason Alexander) throat when George's fiancée dies inexplicably of toxic poisoning. The actor recently completed a TV series revival of Knight Rider (2008). Divorced from Lisa Pelikan, Bruce is married these days to third wife Michele Correy and has a daughter by her, Sophia, born in 2006. They live in the Los Angeles area.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmExMzM3ZmMtYjRmYi00YmRlLTliOGMtYTk2ODcxMjkxMTBmL2ltYWdlXkEyXkFqcGdeQXVyMTQyNjk5Mzc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001117","name":"Bruce Davison","idIMDB":"nm0001117"},"actorId":"nm0001117","character":"Sen. Donald Harrison","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fred Dalton Thompson","urlProfile":"http://www.imdb.com/name/nm0000669","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyODM4MDQ2M15BMl5BanBnXkFtZTcwODEyNjQ0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1942","placeOfBirth":" Sheffield, Alabama, USA","birthName":"Freddie Dalton Thompson","height":"6' 6\" (1.98 m)","bio":"Fred Dalton Thompson was born on August 19, 1942 in Sheffield, Alabama, USA as Freddie Dalton Thompson. He was an actor, known for Sinister (2012), Law & Order (1990) and Die Hard 2 (1990). He was married to Jeri Kehn Thompson and Sarah Elizabeth Lindsey. He died on November 1, 2015 in Nashville, Tennessee, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyODM4MDQ2M15BMl5BanBnXkFtZTcwODEyNjQ0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000669","name":"Fred Dalton Thompson","idIMDB":"nm0000669"},"actorId":"nm0000669","character":"Dr. Charles Luther","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tabatha Shaun","urlProfile":"http://www.imdb.com/name/nm3731746","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg3NDE0OTctMmQ3MS00NDMzLThmYjUtMDM0Y2YzNjQ2MTJhL2ltYWdlXkEyXkFqcGdeQXVyMjIzMTEwMDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 3\" (1.6 m)","bio":"Tabatha Shaun was born on September 19, 1988 in Milwaukee, WI. She trained in gymnastics, ballet, and modern dance until the age of 17. She attended State University of New York at Purchase College and graduated with a B.A. in Theatre with a minor in Evolutionary Anthropology at University of New Mexico. Most recently she worked alongside Dan Stevens and Maika Monroe in Adam Wingard's (You're Next) action/thriller \"The Guest\" and with James Remar on Daniel Lusko's \"Persecuted.\" Tabatha resides in New Mexico.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM0YjM3MGEtMmEzYy00N2I2LWI4OTYtZWQxZDJmMzdlZGY5XkEyXkFqcGdeQXVyMjIzMTEwMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3731746","name":"Tabatha Shaun","idIMDB":"nm3731746"},"actorId":"nm3731746","character":"Alex O'Connor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Debrianna Mansini","urlProfile":"http://www.imdb.com/name/nm1833916","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM5Mjc3NzEzMl5BMl5BanBnXkFtZTcwMTUzNTYxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Debrianna Mansini is an actress and writer, known for Better Call Saul (2015), Crazy Heart (2009) and Drunktown's Finest (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM5Mjc3NzEzMl5BMl5BanBnXkFtZTcwMTUzNTYxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1833916","name":"Debrianna Mansini","idIMDB":"nm1833916"},"actorId":"nm1833916","character":"Agent Rivera","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matthew Page","urlProfile":"http://www.imdb.com/name/nm0656275","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDM0MDE0M15BMl5BanBnXkFtZTgwOTc4MjkxMzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Matt Page holds a Bachelor's Degree in Moving Image Arts from the College of Santa Fe. In 2006, Page co-founded Riffraff New Media, a New Mexico-based production company through which he has written and directed multiple award-winning short films that have screened all over the world. Page has appeared regularly on the WGN show \"Manhattan\" and has been seen in several feature films. He is also the creator and star of \"Enter The Dojo\", a comedic web series that has achieved over 11 million views on YouTube.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDM0MDE0M15BMl5BanBnXkFtZTgwOTc4MjkxMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0656275","name":"Matthew Page","idIMDB":"nm0656275"},"actorId":"nm0656275","character":"William","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Sivertsen","urlProfile":"http://www.imdb.com/name/nm0803390","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5MzMzMjcwNl5BMl5BanBnXkFtZTgwODkyMzkzOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 May 1959","placeOfBirth":" Fairfield, California, USA","birthName":"Mark D. Sivertsen","height":"6' 1\" (1.85 m)","bio":"Mark Sivertsen has been an actor for over 29 years. As an Air Force brat, Mark was raised in Fairfield, California before moving to Los Angeles at 18 years of age. Early on, Mark started out as a stuntman before transitioning into modeling. Acting came next and his screen career took off in 1985. Since then, Mark has appeared in films. Mark Sivertsen is thrilled to once again be working with director Ric Roman Waugh as a cast member of Shot Caller, currently filming in New Mexico. Mark started as a stuntman and has since built a career in film and television as an actor. Some notable roles include: The Last Stand (2013), Paul (2011), North Country (2005), Love Ranch (2010), Breaking Bad (2010), Castle (2015), Criminal Minds (2014), Dig (2014), Messengers (2015), Drop Dead Diva (2013), and Necessary Roughness (2013). Mark has appeared in over 300 commercials and has recently been turning up in films at many prominent festivals. Mark has five films that will be released within the next 12 months: Hellbent (2016), Bottom of the World (2015), Big Sky (2015), Kepler's Dream (2015), and The Condemned 2 (2015). Mark is especially proud of a film that debuted at the Sundance Film Festival: Drunk Town's Finest (2014). After Sundance, the film screened at 36 festivals worldwide. Life in Color (2015) premiered at the SXSW this year, and is making the rounds at many more festivals. Mark is particularly proud of his involvement in director Ric Roman Waugh's Felon (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2MDU5Mzk0OTNeQTJeQWpwZ15BbWU4MDI4MjM5Mzkx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0803390","name":"Mark Sivertsen","idIMDB":"nm0803390"},"actorId":"nm0803390","character":"Mr. Broad","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brandon K. Hampton","urlProfile":"http://www.imdb.com/name/nm3346272","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDNhYjFmMDItZGZmNy00MWQyLTlkMmYtZmE0YTk5NWFkNmY0XkEyXkFqcGdeQXVyMzExNDM0NDQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1990","placeOfBirth":" Houston, Texas, USA","height":"5' 10\" (1.78 m)","bio":"Brandon K. Hampton is an American Actor/Filmmaker from Houston, TX. Starting at the age of 13 years old, Brandon found himself thrown into the world of entertainment. Not knowing where to begin, he often found himself going down the hard road. Often going on cattle calls and following blind radio advertisements that led to spending lots of money to no resolve. In middle school Brandon was heavily involved in Performing Arts and started competing in Speech & Debate. It was as a sophomore In High School when he found his first agent and and started going on auditions. As he continued to pursue acting, he performed plays at Houston's Midtown Art Center, University of Houston's Wortham Theatre, and Tulane's Lupin Theatre in New Orleans. Brandon got his start in television in 2009 after he ditched college and moved to Austin, TX to be a featured football player on the critically acclaimed TV show \"Friday Night Lights\" in which he landed a speaking role on later in the season. This wasn't enough and Brandon knew he had to move forward in a place where he could thrive. And in so, moved to New Mexico where he booked roles on television and films, while pursuing his Bachelors in Film. Still not satisfied, Brandon set out on the world again, in search of the perfect team. Moved to Los Angeles and the rest of the story is still in the making. Brandon can seen Recurring as a Guest Star on the critically acclaimed TV series \"Better Call Saul\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY5Njk5YjAtMTY1Yi00NjhmLWJhM2YtNTZiYzU0NTZjZTdiXkEyXkFqcGdeQXVyMzExNDM0NDQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3346272","name":"Brandon K. Hampton","idIMDB":"nm3346272"},"actorId":"nm3346272","character":"Nolan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David House","urlProfile":"http://www.imdb.com/name/nm1450145","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NzI5OTU4Ml5BMl5BanBnXkFtZTcwMDA0MTY3Nw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 December 1958","placeOfBirth":" Detroit, Michigan, USA","birthName":"David Holton House","bio":"David House was born on December 15, 1958 in Detroit, Michigan, USA as David Holton House. He was an actor, known for Paul (2011), Maze Runner: The Scorch Trials (2015) and The Last Stand (2013). He died on November 27, 2016 in Albuquerque, New Mexico, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NzI5OTU4Ml5BMl5BanBnXkFtZTcwMDA0MTY3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1450145","name":"David House","idIMDB":"nm1450145"},"actorId":"nm1450145","character":"Agent Clark","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Muto","urlProfile":"http://www.imdb.com/name/nm2502702","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNDg5MDg3OV5BMl5BanBnXkFtZTgwOTkxNDg0MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1977","placeOfBirth":" USA","height":"6' (1.83 m)","bio":"Chris Muto was born and raised in upstate New York. He started out professionally modeling in New York and Milan. After working with various top fashion designers including Tommy Hilfiger, Prada and Zegna, Chris transitioned into acting in 2005 when he booked his first on-screen job on Days of Our Lives playing opposite of Allison Sweeney. Following this, he landed his first play in Hollywood, The Graduate. Next came the lead in the play Brooklyn USA, and he hasn't looked back since. He has also booked several national commercials including McDonald's, Gateway, Charter Communications, Craftsman and Discover Card which was directed by Peter Berg. He recently Recurred on ABCs hit drama Greys Anatomy playing Nurse Michael. You can catch him playing opposite of Robert Patrick in Last Rampage set to be released in 2017. He has worked opposite of some of Hollywood's top actors such as Ryan Gosling in Drive, Alley Sheedy in Citizen Jane and James Remar in Decommissioned. Chris continues to work hard, having recently wrapped on a TV pilot that he wrote and produced called Meat.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNDg5MDg3OV5BMl5BanBnXkFtZTgwOTkxNDg0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2502702","name":"Chris Muto","idIMDB":"nm2502702"},"actorId":"nm2502702","character":"Byrnes - Federal Agent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lauren Poole","urlProfile":"http://www.imdb.com/name/nm3460083","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNDI2MDM2Nl5BMl5BanBnXkFtZTcwNzU3NDg1OA@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"height":"5' 8\" (1.73 m)","bio":"Lauren was born in Santa Fe, New Mexico. In 2008 she graduated from the University of New Mexico with a degree in Theatre. She resides in Albuquerque, NM where aside from her film work Lauren is an ensemble member of \"The Show\", a weekly improv comedy show in downtown Albuquerque, and is constantly creating and performing new work as a member of Blackout Theatre Company, and The Sugarbabies, a burlesque troupe.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNDI2MDM2Nl5BMl5BanBnXkFtZTcwNzU3NDg1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3460083","name":"Lauren Poole","idIMDB":"nm3460083"},"actorId":"nm3460083","character":"Hotel Clerk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amy Baklini","urlProfile":"http://www.imdb.com/name/nm3526934","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzODI0NTI4OF5BMl5BanBnXkFtZTgwNDc0NjUyMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 4½\" (1.64 m)","bio":"Amy Baklini is known for her work on The Merry Maids of Madness (2016), The Dramatics: A Comedy (2015) and Furthest Witness (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzODI0NTI4OF5BMl5BanBnXkFtZTgwNDc0NjUyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3526934","name":"Amy Baklini","idIMDB":"nm3526934"},"actorId":"nm3526934","character":"Staffer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gretchen Carlson","urlProfile":"http://www.imdb.com/name/nm1977944","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMTUxNDg4OF5BMl5BanBnXkFtZTgwOTgyNjYzOTE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1966","placeOfBirth":" Anoka, Minnesota, USA","birthName":"Gretchen Elizabeth Carlson","height":"5' 3\" (1.6 m)","bio":"Gretchen Carlson was born on June 21, 1966 in Anoka, Minnesota, USA as Gretchen Elizabeth Carlson. She is an actress, known for The Real Story with Gretchen Carlson (2013), Fox and Friends (1998) and The 2011 Miss America Pageant (2011). She has been married to Casey Richard Close since October 4, 1997. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMTUxNDg4OF5BMl5BanBnXkFtZTgwOTgyNjYzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1977944","name":"Gretchen Carlson","idIMDB":"nm1977944"},"actorId":"nm1977944","character":"TV Anchor","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1761005","urlIMDB":"http://www.imdb.com/title/tt1761005","business":{"budget":null,"openingWeekend":[{"money":"$851,391","country":"USA","day":"20","month":"07","year":"2014","remarks":"736 Screens"}],"gross":[{"money":"$1,546,219","country":"USA","day":"03","month":"08","year":"2014","remarks":""},{"money":"$851,391","country":"USA","day":"20","month":"07","year":"2014","remarks":""}],"weekendGross":[{"money":"$21,194","country":"USA","day":"03","month":"08","year":"2014","remarks":"32 Screens"},{"money":"$851,391","country":"USA","day":"20","month":"07","year":"2014","remarks":"736 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 31 min (91 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"3.6","metascore":"11","filmingLocations":[{"location":"Albuquerque, New Mexico, USA"}],"rated":"PG-13","awards":[],"votes":"1,310","type":"Movie","companyCreditsSimple":[{"idCompany":"co0223795","name":"Indieproduction"},{"idCompany":"co0424898","name":"One Media"},{"idCompany":"co0135994","name":"Vocal Yokels"}],"keywords":{"keywords":["murder","evangelist","persecution","senator","religious","framed for murder","on the run","framed","fugitive","money falling through the air","politics","undercover","foot chase","husband wife relationship","race against time","suspicion","injection","shootout","picture of suspect","cabin","ballroom","disguise","drugged","rain","suspense","cover up","double cross","emergency brake","manhunt","small town","arrest","beating","fistfight","priest","rape","attempted murder","handcuffs","conference room","abduction","reckless driving","helicopter","fbi","home invasion","blood","faith","chase","forest","political thriller","two word title","slow motion","freedom","compassion","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 07:40:13"}}