{"data":{"movies":[{"title":"Servitude","originalTitle":"","year":"2011","releaseDate":"20120429","directors":[{"name":"Warren P. Sonoda","id":"nm1284464"}],"writers":[{"name":"Michael Sparaga","id":"nm1618293"}],"runtime":"85 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MTk3NzU0M15BMl5BanBnXkFtZTcwNTEwOTA0Nw@@._V1.jpg","countries":["Canada"],"languages":["English"],"genres":["Comedy"],"plot":"A group of frustrated waiters at a kitschy steakhouse take over their restaurant for one final, glorious, revenge-filled night when they discover they are all about to be fired.","simplePlot":"A group of frustrated waiters at a kitschy steakhouse take over their restaurant for one final, glorious, revenge-filled night when they discover they are all about to be fired.","actors":[{"actorName":"Joe Dinicol","urlProfile":"http://www.imdb.com/name/nm0227710","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzkwNTU2NzE1M15BMl5BanBnXkFtZTcwODc5MDQ4Nw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 December 1983","placeOfBirth":" Stratford, Ontario, Canada","bio":"Joe Dinicol was born on December 22, 1983 in Stratford, Ontario, Canada. He is known for his work on Scott Pilgrim vs. the World (2010), The Virgin Suicides (1999) and Diary of the Dead (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzkwNTU2NzE1M15BMl5BanBnXkFtZTcwODc5MDQ4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0227710","name":"Joe Dinicol","idIMDB":"nm0227710"},"actorId":"nm0227710","character":"Josh Stein","urlCharacter":"http://www.imdb.com/character/ch0298782","main":true},{"actorName":"John Bregar","urlProfile":"http://www.imdb.com/name/nm1456426","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMDg2NzgzNF5BMl5BanBnXkFtZTgwOTgxMjM5ODE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 March 1985","placeOfBirth":" North York, Ontario, Canada","birthName":"John Francis Bregar","height":"6' (1.83 m)","bio":"John Bregar was born on March 1, 1985 in North York, Ontario, Canada as John Francis Bregar. He is known for his work on Kick-Ass 2 (2013), Chop Shop (2014) and Servitude (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMDg2NzgzNF5BMl5BanBnXkFtZTgwOTgxMjM5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1456426","name":"John Bregar","nicknames":["Bregz","Bon","Breezy"],"idIMDB":"nm1456426"},"actorId":"nm1456426","character":"Tommy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kristen Hager","urlProfile":"http://www.imdb.com/name/nm1982266","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMjc1Nzc0Ml5BMl5BanBnXkFtZTgwMDU5ODgzODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 January 1984","placeOfBirth":" Red Lake, Ontario, Canada","bio":"Kristen Hager was born on January 2, 1984 in Red Lake, Ontario, Canada. She is an actress, known for Wanted (2008), Aliens vs. Predator: Requiem (2007) and Being Human (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMjc1Nzc0Ml5BMl5BanBnXkFtZTgwMDU5ODgzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1982266","name":"Kristen Hager","idIMDB":"nm1982266"},"actorId":"nm1982266","character":"Jenny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Linda Kash","urlProfile":"http://www.imdb.com/name/nm0440514","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0NzI0NzkzNV5BMl5BanBnXkFtZTcwNDIzMTIzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1967","placeOfBirth":" Montreal, Quebec, Canada","bio":"Linda Kash began her professional life at the Second City in Toronto. She has also appeared in a number of plays for Canadian Stage. She was a series regular cast member in The Comedy Mill, Max Glick, Variety Tonight in Canada and SheTV, Minor Adjustments and Style and Substance in the US. As well Linda has been a guest on Seinfeld, Third Rock From The Sun, Cybill, Everybody Loves Raymond, Ellen and Sabrina. She recently worked on Ken Finklemen's new series for CBC \"Hotel Metropolitan\", Hatching, Matching & Dispatching also on CBC, and the pilot \"Sex Life'\" for HBO which was directed by Patricia Rozema. Her list of films include Waiting For Guffman and Best in Show both directed by Christopher Guest, the multi nominated Cinderella Man directed by Ron Howard and most recently Man of the Year directed by Barry Levinson. Linda has co created several shows for TV including My Talk Show, Lovin' Spoonfuls Go Girl!, and most recently The Joe Blow Show, which she also directed. Linda has also taught sketch writing and improvisation for Humber College and teaches corporate workshops for Beyond The Box. She is also known as Canada's beloved Kraft Philadelphia Cream Cheese Angel, which has become one of Canadian advertising's most successful campaigns and is now in its 11th year.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0NzI0NzkzNV5BMl5BanBnXkFtZTcwNDIzMTIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0440514","name":"Linda Kash","idIMDB":"nm0440514"},"actorId":"nm0440514","character":"Barb","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeigh Madjus","urlProfile":"http://www.imdb.com/name/nm4138479","urlPhoto":"","biography":{"bio":"Jeigh Madjus is an actor, known for Prison Dancer (2012), Servitude (2011) and Kafka's Little Fable (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4138479","name":"Jeigh Madjus","idIMDB":"nm4138479"},"actorId":"nm4138479","character":"Simon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Enrico Colantoni","urlProfile":"http://www.imdb.com/name/nm0170186","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmVmMWE1MDAtZDA5Ni00MTQxLWIwZTItMTY5Y2EzN2ZlNWNjXkEyXkFqcGdeQXVyMTEyMDU4NDk@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1963","placeOfBirth":" Toronto, Ontario, Canada","bio":"Enrico Colantoni was born on February 14, 1963 in Toronto, Ontario, Canada. He is an actor and director, known for Just Shoot Me! (1997), Galaxy Quest (1999) and Veronica Mars (2004). He has been married to Rosanna Francioni since November 11, 2011. They have four children. He was previously married to Nancy Snyder.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmVmMWE1MDAtZDA5Ni00MTQxLWIwZTItMTY5Y2EzN2ZlNWNjXkEyXkFqcGdeQXVyMTEyMDU4NDk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0170186","name":"Enrico Colantoni","nicknames":["Rico"],"idIMDB":"nm0170186"},"actorId":"nm0170186","character":"Franz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dave Foley","urlProfile":"http://www.imdb.com/name/nm0004929","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE5MjgyODYxNV5BMl5BanBnXkFtZTcwMzQxNTU3MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 January 1963","placeOfBirth":" Toronto, Ontario, Canada","birthName":"David Scott Foley","height":"5' 8\" (1.73 m)","bio":"Dave Foley dropped out of an alternative high school to do stand-up comedy. He met Kevin McDonald at an improv class and, while employed as movie ushers, they began working as a comedy team. In 1984 they merged with another team to form \"The Kids in the Hall\". Foley made his film debut at 22 as the lead in the Canadian film High Stakes (1986).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE5MjgyODYxNV5BMl5BanBnXkFtZTcwMzQxNTU3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004929","name":"Dave Foley","nicknames":["Dave"],"idIMDB":"nm0004929"},"actorId":"nm0004929","character":"Godfrey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rachel Skarsten","urlProfile":"http://www.imdb.com/name/nm0803896","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjcyNjc0Mzg5OF5BMl5BanBnXkFtZTgwMDcxNTM0NzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 April 1985","placeOfBirth":" Toronto, Ontario, Canada","height":"5' 10\" (1.78 m)","bio":"Rachel Alice Marie Skarsten was born April 23, 1985 to Mary Aileen Self Skarsten and Dr. Stan Skarsten. She has a younger brother Jonathan Skarsten, six years her junior whom she regards as her best friend. At the age of nine, her father died suddenly of pancreatic cancer. Rachel danced for the Royal Academy of Dance for 12 years, earning her Elementary Level with distinction in 1999. After an injury to her ankle, Rachel was forced to give up dance and turned to sports. She played at the highest level of competitive female hockey as a goalie for the Leaside Wildcats in Toronto, where in 2002 she won the Toronto City Championships in a shootout. At 17 she won a major role - that of superhero Black Canary/Dinah Lance - in the WB series \"Birds of Prey\", after being discovered by Producer Brian Robins. After the show was canceled, she moved home from Los Angles eager to take a hiatus from acting, to graduate high school and pursue an undergraduate degree. After graduating from Earl Haig Secondary School in the top 10% of her class, and being named an Ontario Scholar, she was accepted into the prestigious Canadian Queen's University. There she completed a double major in English Literature and Classical History. After graduation, she backpacked around Western Europe for four months with friends. She moved back to Los Angeles in the spring of 2008. She is a qualified lifeguard who feels most comfortable in the water, and is happy to be near the ocean in Santa Monica.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjcyNjc0Mzg5OF5BMl5BanBnXkFtZTgwMDcxNTM0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0803896","name":"Rachel Skarsten","nicknames":["Rachie"],"idIMDB":"nm0803896"},"actorId":"nm0803896","character":"Alex","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Margot Kidder","urlProfile":"http://www.imdb.com/name/nm0452288","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NDQ2MDI0OF5BMl5BanBnXkFtZTYwMTc1MzI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1948","placeOfBirth":" Yellowknife, Northwest Territories, Canada","birthName":"Margaret Ruth Kidder","height":"5' 6\" (1.68 m)","bio":"Margot Kidder was born Margaret Ruth Kidder in Yellowknife, Northwest Territories, Canada, to Jocelyn Mary \"Jill\" (Wilson), a history teacher from British Columbia, and Kendall Kidder, a New Mexico-born mining engineer and explosives expert. Margot was a delightful child who took pride in everything she did. At an early age she became aware of the great emotions she felt towards expressing herself, and caught the acting bug. As a child she wrote in a diary that she wanted to become a movie star, and that one day it would happen, but she had to overcome something else first. She was aware that she was constantly facing mood swings, but wasn't aware why. At odd times she would try to kill herself - the first time was at age 14 - but the next day she would be just fine. Her father's hectic schedule and moving around so much didn't help matters, either, causing her to attend 11 schools in 12 years. Finally, in an attempt to help Margot with her troubles, her parents sent\" her to a boarding school, where she took part in school plays, such as Romeo and Juliet\", in which she played the lead. After graduation Margot moved to Los Angeles to start a film career. She found herself dealing with a lot of prejudice, and hotheads, but later found solace with a Canadian agent. This was when she got her first acting job, in the Norman Jewison film Gaily, Gaily (1969). This led to another starring role in Quackser Fortune Has a Cousin in the Bronx (1970), in which she co-starred with Gene Wilder. After some harsh words from the film's director, Margot temporarily left films to study acting in New York, doing television work to pay her bills, but when the money ran out, she decided it was time to make a second try at acting. When she arrived in Hollywood she met up at a screen test with actress Jennifer Salt, resulting in a friendship that still stands strong today. Margot and Jennifer moved into a lofty beach house and befriended other, then unknown, struggling filmmakers such as Martin Scorsese, Brian De Palma, Steven Spielberg and Susan Sarandon, among others. Late nights would see the hot, happening youngsters up until all hours talking around a fire about how they were all going to change the film industry. It was crazy living and within the Christmas season, Margot had become involved with De Palma, and as a Christmas present he gave her the script to his upcoming film Sisters (1972). Margot and Salt both had the leads in the film, and it was a huge critical success. The film made branded Margot as a major talent, and in the following years she starred in a string of critically acclaimed pictures, such as Black Christmas (1974), The Great Waldo Pepper (1975), 92 in the Shade (1975) - directed by Thomas McGuane, who was also her husband for a brief period - and a somewhat prophetic tale of self-resurrection, The Reincarnation of Peter Proud (1975). After three years of being a housewife, looking after her daughter Maggie and not working, Margot decided it was time to let her emotions take control and get back into acting. Once her marriage to McGuane was over she eyed a script that would change her life forever. Her new agent hooked her up with a little-known director named Richard Donner. He was going to be directing a film called Superman (1978), and she auditioned for and secured the leading female role of Lois Lane. That film and Superman II (1980) were to be filmed simultaneously. After the success of \"Superman\" she took on more intense roles, such as The Amityville Horror (1979) and Willie & Phil (1980). After that, Margot did numerous films, television and theater work throughout the 1980s, including Superman IV: The Quest for Peace (1987). When the 1990s erupted with the Gulf War, Margot found herself becoming involved in politics. She made a stir in the biz when she spoke out against the military for their actions in Kuwait. She also appeared in a cameo in Donner's Maverick (1994). In 1996, as she was preparing to write her autobiography, she began to become more and more paranoid. When her computer was infected with a virus, this gave her paranoia full rein, and she sank into bipolar disorder. She panicked, and the resulting psychological problems she created for herself resulted in her fantasizing that her first husband was going to kill her, so she left her home and faked her death, physically altering her appearance in the bargain. After an intervention took place, she got back on her feet and started the mental wellness campaign. Since then she has sustained her career in film, television, and theater, recently appearing in a Canadian stage production of \"The Vagina Monologues\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NDQ2MDI0OF5BMl5BanBnXkFtZTYwMTc1MzI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0452288","name":"Margot Kidder","nicknames":["Margie"],"idIMDB":"nm0452288"},"actorId":"nm0452288","character":"Mrs. Crank","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lauren Collins","urlProfile":"http://www.imdb.com/name/nm0172472","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0OTg4Nzk3N15BMl5BanBnXkFtZTgwNDUwODc1MzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1986","placeOfBirth":" Thornhill, Ontario, Canada","birthName":"Lauren Felice Collins","height":"5' 2\" (1.57 m)","bio":"Lauren Collins was born on August 29, 1986 in Thornhill, Ontario, Canada as Lauren Felice Collins. She is an actress and producer, known for Degrassi: la nouvelle génération (2001), Kroll Show (2013) and Take the Lead (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0OTg4Nzk3N15BMl5BanBnXkFtZTgwNDUwODc1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0172472","name":"Lauren Collins","idIMDB":"nm0172472"},"actorId":"nm0172472","character":"Krissy","urlCharacter":"http://www.imdb.com/character/ch0233224","main":true},{"actorName":"Aaron Ashmore","urlProfile":"http://www.imdb.com/name/nm0039148","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MjYyNDM4NV5BMl5BanBnXkFtZTYwODAwNDIz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 October 1979","placeOfBirth":" Richmond, British Columbia, Canada","birthName":"Aaron Richard Ashmore","height":"6' (1.83 m)","bio":"Aaron was born one minute before his twin, Shawn Ashmore, in Richmond, British Columbia, Canada. He is the son of homemaker Linda and manufacturing engineer Rick. When they were 10, their mother was a part of a club called the \"Multiple Births Association,\" or as Aaron likes to call it, \"The Multiple Rugrats.\" The support group, located in Alberta, Canada was where the twins were discovered by a talent agent. It didn't take long for the problem of rejection to arise. The twins started out in commercials, sometimes by themselves and sometimes together. When they were 12, Aaron got an offer to be in a commercial, but he fell ill on that day, and Shawn went in his brother's place. Ever since then, Shawn's career has always been 1 step in front of his brother's. Since high school, when they were routinely mixed up with one another, their talents have become a lot less identical. They have been offered different roles to play, and they are looking a lot less identical, now that they are growing older. Aaron is now more sturdily built, with a broader face and broad shoulders. He stands 6'0\", which is an inch taller than Shawn, who is 5'11\". To that, Shawn says, \"It's shoes and hair\". Aaron lives in Toronto, where he shares an apartment with Shawn.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MjYyNDM4NV5BMl5BanBnXkFtZTYwODAwNDIz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0039148","name":"Aaron Ashmore","idIMDB":"nm0039148"},"actorId":"nm0039148","character":"Chase Vanhaver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Boylan","urlProfile":"http://www.imdb.com/name/nm0102164","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NDg2OTEyM15BMl5BanBnXkFtZTgwOTU0ODg1OTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"A well-known Canadian actor, acting coach, teacher and mentor, John Boylan was the founder of Centre for the Arts, a community arts centre which served the community from 2003 to 2010. John is a graduate actor from The National Theatre School of Canada and 2016 film and television credits include Man Seeking Woman, The Meaning of Life, The Brief, Michael: Tuesday Thursday, From Noon to Starry Night, Running with Violet and in 1973 Alien Thunder. John delivers Directing the Actor workshops for The Directors Guild of Canada. He recently gave a hugely successful acting class at Centennial College. In addition to his ongoing classes at his studio, John has taught at Ryerson Theatre School since 2002 and for many years was a guest tutor at the Mountview Academy of Theatre Arts, London. He delivered a Master Class to members of the acting company at the Stratford Shakespeare Festival. John ran the Directing the Actor class at New York University, Graduate Film School. He created the acting for film and television course at The Gaiety School of Acting, Dublin; taught at the Guthrie Theatre, at Queen Margaret College, Edinburgh, at The Actors Centre, London, and in Zimbabwe for FIA (International Actor's Federation). He has taught at George Brown Theatre School, York University graduate and under-graduate theatre departments and Humber College. Across Canada at Workshops in the Performing Arts, Vancouver; Moving Images Group, Halifax, National Screen Institute, Winnipeg and Queens University. John designed and delivered workshops in the Vancouver, St. John's and Halifax CBC studios for ACTRAWORKS. A recent mentor under the Canadian Senior Artist's Resource Network (CSARN) program and, of course, he taught the first ever on-camera class at The Yale School of Drama.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NDg2OTEyM15BMl5BanBnXkFtZTgwOTU0ODg1OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0102164","name":"John Boylan","idIMDB":"nm0102164"},"actorId":"nm0102164","character":"Sam Stein","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Diego Fuentes","urlProfile":"http://www.imdb.com/name/nm0297402","urlPhoto":"","biography":{"bio":"Diego Fuentes is an actor, known for How to Lose a Guy in 10 Days (2003), Dark Water (2005) and Hollywoodland (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0297402","name":"Diego Fuentes","idIMDB":"nm0297402"},"actorId":"nm0297402","character":"Diego","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jayne Eastwood","urlProfile":"http://www.imdb.com/name/nm0247720","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0OTMyMDk1NDFeQTJeQWpwZ15BbWU4MDM2NDQ3OTIx._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1946","placeOfBirth":" Toronto, Ontario, Canada","height":"5' 6\" (1.68 m)","bio":"Jayne Eastwood was born on December 17, 1946 in Toronto, Ontario, Canada. She is an actress, known for Chicago (2002), Dawn of the Dead (2004) and Hairspray (2007). She is married to David Flaherty. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0OTMyMDk1NDFeQTJeQWpwZ15BbWU4MDM2NDQ3OTIx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0247720","name":"Jayne Eastwood","idIMDB":"nm0247720"},"actorId":"nm0247720","character":"Edna","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wayne Robson","urlProfile":"http://www.imdb.com/name/nm0733500","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NjgyNTAzMV5BMl5BanBnXkFtZTcwNzIwOTgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1946","placeOfBirth":" Vancouver, British Columbia, Canada","bio":"Wayne Robson was born on April 29, 1946 in Vancouver, British Columbia, Canada. He was an actor, known for Cube (1997), Interstate 60: Episodes of the Road (2002) and The Incredible Hulk (2008). He was married to Lynn Woodman. He died on April 4, 2011 in Toronto, Ontario, Canada.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NjgyNTAzMV5BMl5BanBnXkFtZTcwNzIwOTgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0733500","name":"Wayne Robson","idIMDB":"nm0733500"},"actorId":"nm0733500","character":"Donny","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1754478","urlIMDB":"http://www.imdb.com/title/tt1754478","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"01","month":"11","year":"2010","remarks":null},{"money":null,"country":null,"day":"19","month":"11","year":"2010","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 25 min (85 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":["Red One Camera"],"laboratory":["Technicolor"],"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"4.9","filmingLocations":[{"location":"Brampton, Ontario, Canada"}],"awards":[{"award":"Las Vegas International Film Festival 2012","titlesAwards":[{"titleAwardOutcome":"Won Jury Prize","categories":[{"category":"Feature film","names":[]}]}]},{"award":"Orlando Film Festival 2012","titlesAwards":[{"titleAwardOutcome":"Won Best Ensemble Cast","categories":[{"category":"Narrative Feature","names":[]}]}]}],"votes":"201","type":"Movie","companyCreditsSimple":[{"idCompany":"co0163979","name":"BUCK Productions"},{"idCompany":"co0126646","name":"Victory Man Productions"}],"keywords":{"keywords":["waiter","german stereotype","cowboy","ensemble","revenge"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:32:17"}}