{"data":{"movies":[{"title":"Annie","originalTitle":"","year":"2014","releaseDate":"20141219","directors":[{"name":"Will Gluck","id":"nm0323239"}],"writers":[{"name":"Will Gluck","id":"nm0323239"},{"name":"Aline Brosh McKenna","id":"nm0112459"}],"runtime":"118 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyNDYxOTI4MzNeQTJeQWpwZ15BbWU4MDQ3MDU3NjIx._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Family","Musical"],"plot":"Annie is a young, happy foster kid who's also tough enough to make her way on the streets of New York in 2014. Originally left by her parents as a baby with the promise that they'd be back for her someday, it's been a hard knock life ever since with her mean foster mom Miss Hannigan. But everything's about to change when the hard-nosed tycoon and New York mayoral candidate Will Stacks - advised by his brilliant VP, Grace and his shrewd and scheming campaign advisor, Guy - makes a thinly-veiled campaign move and takes her in. Stacks believes he's her guardian angel, but Annie's self-assured nature and bright, sun-will-come-out-tomorrow outlook on life just might mean it's the other way around.","simplePlot":"A foster kid, who lives with her mean foster mom, sees her life change when business tycoon and New York mayoral candidate Will Stacks makes a thinly-veiled campaign move and takes her in.","actors":[{"actorName":"Jamie Foxx","urlProfile":"http://www.imdb.com/name/nm0004937","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNjY1NDg3NF5BMl5BanBnXkFtZTgwNjA2MTg0MzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1967","placeOfBirth":" Terrell, Texas, USA","birthName":"Eric Marlon Bishop","height":"5' 9\" (1.75 m)","bio":"Jamie Foxx is an American actor, singer, and comedian. He won an Academy Award for Best Actor, BAFTA Award for Best Actor in a Leading Role, and Golden Globe Award for Best Actor in a Musical or Comedy, for his work in the 2004 biographical film Ray (2004). The same year, he was nominated for the Academy Award for Best Supporting Actor for his role in the action film Collateral (2004). Other prominent acting roles include the title role in the film Django Unchained (2012), the super villain Electro in The Amazing Spider-Man 2 (2014), and William Stacks in the 2014 version of Annie (2014). Jamie Foxx was born Eric Marlon Bishop in Terrell, Texas, to Louise Annette Talley and Darrell Bishop, who worked as a stockbroker and had later changed his name to Shahid Abdula. His mother was an adopted child. When her marriage to his father failed, his maternal grandparents, Mark and Estelle Talley, stepped in and, at age seven months, adopted Jamie too. He has said that he had a very rigid upbringing that placed him in the Boy Scouts and the church choir. During high school, he played quarterback for his high school team and was good enough that he got press in Dallas newspapers. He studied music in college. He released a music album in 1994, \"Peep This\", and sings the theme song for his 1999 movie, Any Given Sunday (1999). However, in 1989, his life changed when a girl friend challenged him to get up onstage at the Comedy Club. In fact, he says he took his androgynous stage name because he learned that women got preference for mike time on open stage nights. That led to his being cast in Roc (1991) and In Living Color (1990). Foxx had his own WB television show from 1996 to 2001, the sitcom The Jamie Foxx Show (1996), in which he played Jamie King Jr. Foxx is also a Grammy Award-winning musician, producing four albums which have charted highly on the US Billboard 200: Unpredictable (2005), which topped the chart, Intuition (2008), Best Night of My Life (2010), and Hollywood: A Story of a Dozen Roses (2015). In 2012, Foxx starred in the title role of the Quentin Tarantino written and directed Django Unchained. Foxx starred alongside his Ray co-star Kerry Washington, as well as Christoph Waltz, Leonardo DiCaprio and Samuel L. Jackson. In 2013, Foxx was cast as President James Sawyer in White House Down alongside Channing Tatum. The following year, Foxx appeared in The Amazing Spider-Man 2 as the villain Electro, and co-starred with Quvenzhané Wallis in Annie, Sony's Will Smith and Jay-Z produced update of the comic strip-turned-musical. He has two children, including Corinne Foxx, born in 1995, who lives with her mother.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNjY1NDg3NF5BMl5BanBnXkFtZTgwNjA2MTg0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004937","name":"Jamie Foxx","idIMDB":"nm0004937"},"actorId":"nm0004937","character":"Will Stacks","urlCharacter":"http://www.imdb.com/character/ch0028106","main":true},{"actorName":"Quvenzhané Wallis","urlProfile":"http://www.imdb.com/name/nm4832920","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTk4NzUzN15BMl5BanBnXkFtZTcwMzI5MjQ5OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 2003","placeOfBirth":" Houma, Louisiana, USA","height":"4' 11\" (1.5 m)","bio":"Wallis was born in Houma, Louisiana, to Qulyndreia (Jackson) Wallis, a teacher, and Venjie Wallis, Sr., a truck driver. She has one sister, Qunyquekya, and two brothers, Vejon and Venjie, Jr. \"Quven\", the first part of her name, combines the first syllables of her parents' first names. Wallis, at age five, lied about her age to audition for her very first acting job, the starring role in Beasts of the Southern Wild, because the minimum age to be considered was six. She eventually beat out 4,000 others for the role of Hushpuppy, the indomitable child prodigy and survivalist who lives with her dying father in the backwoods bayou squalor of Louisiana. At that time, she was just six years old during the filming. Wallis is the first African-American child actor and is also the first person born in the 21st century to receive an Academy Award nomination. In May 2014, Wallis was named the face of Armani Junior, Giorgio Armani's line for children and teens. This makes her the first major child celebrity to be the face of a luxury brand.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTk4NzUzN15BMl5BanBnXkFtZTcwMzI5MjQ5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4832920","name":"Quvenzhané Wallis","nicknames":["Nazie","Nayzie"],"idIMDB":"nm4832920"},"actorId":"nm4832920","character":"Annie","urlCharacter":"http://www.imdb.com/character/ch0454467","main":true},{"actorName":"Rose Byrne","urlProfile":"http://www.imdb.com/name/nm0126284","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTMxMDkwNV5BMl5BanBnXkFtZTcwOTQxOTg3NQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 July 1979","placeOfBirth":" Balmain, Sydney, New South Wales, Australia","birthName":"Mary Rose Byrne","height":"5' 6¼\" (1.68 m)","bio":"Rose Byrne was born in Balmain, Sydney, Australia. She is the daughter of Jane, a primary school administrator, and Robin Byrne, a semi-retired statistician and market researcher. She landed her first role in a movie, Dallas Doll (1994), when she was 15 years old. Since then, Rose has appeared in a variety of Australian televisions shows including Hartley, coeurs à vif (1994), Echo Point (1995), and the film Two Hands (1999) alongside Heath Ledger. After this, she appeared in various movies like The Date (1999), My Mother Frank (2000), and Clara Law's The Goddess of 1967 (2000) for which she obtained the Female Volpi Cup at the Venice Festival in 2000. Her first experience on a big-budget movie came when she played handmaiden, Dormé, to Natalie Portman, Padmé Amidala, in Star Wars: Episode II - Attack of the Clones (2002). In 2003, she starred, coincidentally, as Rose Mortmain in the adaptation of Dodie Smith's I Capture the Castle (2003). In 2004, she acted in Wicker Park (2004) with Diane Kruger and Josh Hartnett. Here, she heard Wolfgang Petersen was looking for an actress for Briseis in his next movie Troy (2004) with Brad Pitt, she got the part and was recognised as one of the most promising actresses in Hollywood. After Troy (2004), she played Edith in a TV adaptation of Casanova (2005). In September 2005, she started to act in Sunshine (2007), a Danny Boyle movie, where she plays the pilot in a space mission.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTMxMDkwNV5BMl5BanBnXkFtZTcwOTQxOTg3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0126284","name":"Rose Byrne","nicknames":["Rosie"],"idIMDB":"nm0126284"},"actorId":"nm0126284","character":"Grace","urlCharacter":"http://www.imdb.com/character/ch0398988","main":true},{"actorName":"Bobby Cannavale","urlProfile":"http://www.imdb.com/name/nm0134072","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NzM3MzQ4Ml5BMl5BanBnXkFtZTgwOTg2MjY4ODE@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1970","placeOfBirth":" Union City, New Jersey, USA","birthName":"Roberto M. Cannavale","height":"6' 2½\" (1.89 m)","bio":"In both career and in real life, Bobby Cannavale tends to choose the unconventional way of doing things. In the beginning, his decisions may have cost the dark, swarthily good-looking actor some acting roles and/or good-paying money but, in the end, his strong work ethic and sense of self, despite a lack of formal training, allowed him to take a successful path off the crowded acting trail. From character goofball and cut-up, he has broken into the leading man ranks with his recent starring role as a reincarnated matchmaker in the TV series Cupid (2009). Born Roberto M. Cannavale in Union City, New Jersey, to an Italian father, Sal, and Cuban mother, Isabel, he was involved in various activities at his Union City Catholic school, St. Michaels, while growing up. An altar boy, choir boy and lector, he also appeared in the church school's various musicals including his very first, \"Guys and Dolls\", in which he showed up as one of the gangsters, and \"The Music Man\", appearing as the lisping, scene-stealing tyke, \"Winthrop\". Bobby's parents divorced when he was five years old and his mother moved the family to Puerto Rico for a couple of years. Eventually, they returned to the States and settled in Coconut Creek, Florida, where he attended high school. Restless and uncomfortable in any sort of regimented setting, he often got suspended for playing the class clown. Graduating in the late 1980s, and bitten by the acting bug, Bobby chose to return to the New York/New Jersey area in order to jump start an acting career. Working in bars to support himself, he again avoided the confines of an acting school and, instead, gained experience as a \"reader\" on occasion with the Naked Angels theatre company. During this time (1994), he met and married Jenny Lumet, the actress-daughter of director Sidney Lumet. They had son, Jake, the following year. The couple divorced in 2003. Spotted by playwright Lanford Wilson while performing in an East Village production of Larry Kramer's \"The Normal Heart\", Bobby was invited to join Wilson's prestigious Circle Repertory Theatre. As a \"reader\" for the company, he eventually earned stage parts in \"Chilean Holidays\" (1996) and in Wilson's \"Virgil Is Still the Frog Boy.\" He also went on to serve as understudy to Mark Linn-Baker in a 1998 production of \"A Flea in Her Ear\" and later replaced him. A noticeable role in the company's play, \"The Most Fabulous Story Ever Told\" by Paul Rudnick led to Bobby's being cast in the recurring role of a tugboat operator in the TV series Trinity (1998). Having only appeared in bit parts thus far in such movies as Night Falls on Manhattan (1996), directed by Lumet, and I'm Not Rappaport (1996), it was \"Trinity\" creator John Wells who caught Bobby's stage performance and handed him this career-making break on camera. Bobby's \"nice-guy\" aura and blue-collar charm proved invaluable, if a bit restrictive. Once the \"Trinity\" series ended, Wells cast the 6'3\" lug with the trademark caterpillar brows and crooked smile as lovelorn paramedic \"Bobby Caffey\" in his series Third Watch (1999). The character became quite popular but Bobby, again feeling restricted and wishing to broaden his horizon as an actor, asked to be released from the show -- but \"in a big way\". Creator Wells obliged and had the paramedic fatally shot in the chest and then experience a \"beyond the grave\" union with his character's deceased, ne'er-do-well dad. Bobby next joined the cast of father-in-law Sidney Lumet's acclaimed TV courtroom drama 100 Centre Street (2001), starring Alan Arkin, cast against type as a brazenly opportunistic prosecutor. He subsequently earned recurring roles on Ally McBeal (1997) (in 2002) and Six Feet Under (2001) (in 2004). As for films, Bobby was featured in Gloria (1999), The Bone Collector (1999), Washington Heights (2002) and The Guru (2002) by the time he scored as the gregarious truck driver in the critically-hailed indie film The Station Agent (2003), which paired him intriguingly opposite the diminutive actor Peter Dinklage. Unwilling to shirk away from more controversial roles such as his gay drug dealer who has the hots for a fellow prisoner in the acclaimed series Oz (1997) or his closeted dancing neophyte in the film comedy Shall We Dance (2004) starring Richard Gere, Bobby continued to elevate his status seesawing between film (Shortcut to Happiness (2003), Happy Endings (2005), Romance & Cigarettes (2005)) and TV assignments (the miniseries Kingpin (2003)). He earned big viewer points with his recurring portrayal of \"Will Truman\"'s dour cop/boyfriend on the hit sitcom Will & Grace (1998) in 2004 and won a \"Guest Star\" Emmy award in the process. Elsewhere, on stage, he merited attention in such productions as \"Hurlyburly\" and earned a Tony Award nomination for his 2007 Broadway debut in \"Mauritius\". After five consecutive failed pilots, Bobby has come front-and-center with his quirky starring role in the ABC series Cupid (2009), recurring roles in Cold Case (2003) and Nurse Jackie (2009), and topnotch Emmy-winning part in Boardwalk Empire (2010). He also continues to rake up credits on the big screen (The Merry Gentleman (2008), Diminished Capacity (2008), The Take (2007), 100 Feet (2008), Roadie (2011)). This is a guy definitely here to stay.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NzM3MzQ4Ml5BMl5BanBnXkFtZTgwOTg2MjY4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0134072","name":"Bobby Cannavale","idIMDB":"nm0134072"},"actorId":"nm0134072","character":"Guy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adewale Akinnuoye-Agbaje","urlProfile":"http://www.imdb.com/name/nm0015382","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzA5MTI5MF5BMl5BanBnXkFtZTgwMTUxMjcwOTE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 August 1967","placeOfBirth":" Islington, London, England, UK","birthName":"Adewale Rotimi O. C. E. Akinnuoye Agbaje","height":"6' 2\" (1.88 m)","bio":"Born and raised in London, England, Adewale Akinnuoye-Agbaje began his career as a model in Milan. He graduated with a masters degree in Law from London's prestigious Kings College, before moving to Los Angeles to make the transition to acting. Fluent in several languages, including English, Italian, Yoruba and Swahili, he is best known for his roles in the movies Congo (1995) and The Mummy Returns (2001), and the HBO series Oz (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzA5MTI5MF5BMl5BanBnXkFtZTgwMTUxMjcwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0015382","name":"Adewale Akinnuoye-Agbaje","nicknames":["Triple A","Wally"],"idIMDB":"nm0015382"},"actorId":"nm0015382","character":"Nash","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Zayas","urlProfile":"http://www.imdb.com/name/nm0953882","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTkwMTg1N15BMl5BanBnXkFtZTcwNzU2ODE3Mw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 August 1962","placeOfBirth":" Ponce, Puerto Rico","height":"5' 11\" (1.8 m)","bio":"David Zayas was born on August 15, 1962 in Ponce, Puerto Rico. He is an actor and producer, known for Dexter (2006), Oz (1997) and The Expendables (2010). He is married to Liza Colón-Zayas.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTkwMTg1N15BMl5BanBnXkFtZTcwNzU2ODE3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0953882","name":"David Zayas","idIMDB":"nm0953882"},"actorId":"nm0953882","character":"Lou","urlCharacter":"http://www.imdb.com/character/ch0537475","main":true},{"actorName":"Cameron Diaz","urlProfile":"http://www.imdb.com/name/nm0000139","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNTI5NzM4MV5BMl5BanBnXkFtZTcwMTI3ODY3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 August 1972","placeOfBirth":" San Diego, California, USA","birthName":"Cameron Michelle Diaz","height":"5' 8½\" (1.74 m)","bio":"A tall, strikingly attractive blue-eyed natural blonde, Cameron Diaz was born in 1972 in San Diego, the daughter of a Cuban-American father and an Anglo-German mother. Self described as \"adventurous, independent and a tough kid,\" Cameron left home at 16 and for the next 5 years lived in such varied locales as Japan, Australia, Mexico, Morocco, and Paris. Returning to California at the age of 21, she was working as a model when she auditioned for a big part in The Mask (1994). To her amazement and despite having no previous acting experience, she was cast as the female lead in the film opposite Jim Carrey. Over the next 3 years, she honed her acting skills in such low budget independent films as The Last Supper (1995); Feeling Minnesota (1996); and Head Above Water (1996). She returned to main stream films in My Best Friend's Wedding (1997), in which she held her own against veteran actress Julia Roberts. She earned full fledged star status in 1998 for her performance in the box office smash There's Something About Mary (1998). With her name near the top on virtually every list of Hollyood's sexiest actresses, and firmly established as one of filmdom's hottest properties and most sought after actresses, Cameron Diaz appears to possess everything necessary to become one of the super stars of the new century.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNTI5NzM4MV5BMl5BanBnXkFtZTcwMTI3ODY3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000139","name":"Cameron Diaz","nicknames":["Cami"],"idIMDB":"nm0000139"},"actorId":"nm0000139","character":"Hannigan","urlCharacter":"http://www.imdb.com/character/ch0045523","main":true},{"actorName":"Zoe Margaret Colletti","urlProfile":"http://www.imdb.com/name/nm2292661","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNDg0MTEwN15BMl5BanBnXkFtZTgwNjczNTkzMDI@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"bio":"Zoe Margaret Colletti is an actress, known for Annie (2014), Rubicon (2010) and American Men (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNDg0MTEwN15BMl5BanBnXkFtZTgwNjczNTkzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2292661","name":"Zoe Margaret Colletti","idIMDB":"nm2292661"},"actorId":"nm2292661","character":"Tessie","urlCharacter":"http://www.imdb.com/character/ch0323514","main":true},{"actorName":"Nicolette Pierini","urlProfile":"http://www.imdb.com/name/nm3632172","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxOTU3MTMwNV5BMl5BanBnXkFtZTgwNjI2NDg2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 December 2003","placeOfBirth":" New York City, New York, USA","height":"4' 7\" (1.4 m)","bio":"Nicolette Pierini is an American child actress and performer. She was first noticed for her role in The Magic of Belle Isle (2012), opposite Morgan Freeman, and is known for the 2014 film adaptation of the musical Annie, where she played Mia Putnam. Pierini got her big break when she was cast opposite Morgan Freeman and Virginia Madsen in The Magic of Belle Isle, directed by Rob Reiner. Since then, she has been featured in many films and TV productions.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxOTU3MTMwNV5BMl5BanBnXkFtZTgwNjI2NDg2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3632172","name":"Nicolette Pierini","idIMDB":"nm3632172"},"actorId":"nm3632172","character":"Mia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eden Duncan-Smith","urlProfile":"http://www.imdb.com/name/nm5351647","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGNlNzZiZjEtNTEyOS00ZmIwLTk2NGYtYjRmOTI2MGEzNDNlL2ltYWdlXkEyXkFqcGdeQXVyNDc3MDc2MjM@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 3\" (1.6 m)","bio":"15 year old Brooklyn native, activist and actor who believes in universal equality, global peace and respect for every breathing creator. She uses all forms of art to articulate the belief and inspire others to take the same just stand. As a dancer, she has studied at Dance Theatre of Harlem, the American Ballet Theatre and Purelements: Evolution in Dance and has been mentored by choreographers such as Kenny Ortega, Zack Woodlee and Aubrey Lynch.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGNlNzZiZjEtNTEyOS00ZmIwLTk2NGYtYjRmOTI2MGEzNDNlL2ltYWdlXkEyXkFqcGdeQXVyNDc3MDc2MjM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5351647","name":"Eden Duncan-Smith","nicknames":["Suga Yam"],"idIMDB":"nm5351647"},"actorId":"nm5351647","character":"Isabella","urlCharacter":"http://www.imdb.com/character/ch0502044","main":true},{"actorName":"Amanda Troya","urlProfile":"http://www.imdb.com/name/nm4548936","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MTE0NzQ3MF5BMl5BanBnXkFtZTgwOTYyNjIxMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 2½\" (1.59 m)","bio":"Amanda Troya is an actress, known for Annie (2014), The 88th Annual Macy's Thanksgiving Day Parade (2014) and Are We There Yet? (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MTE0NzQ3MF5BMl5BanBnXkFtZTgwOTYyNjIxMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4548936","name":"Amanda Troya","idIMDB":"nm4548936"},"actorId":"nm4548936","character":"Pepper","urlCharacter":"http://www.imdb.com/character/ch0323513","main":true},{"actorName":"Dorian Missick","urlProfile":"http://www.imdb.com/name/nm0592923","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAwMDE3NjA3OV5BMl5BanBnXkFtZTgwMDA0OTk5ODE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 January 1976","placeOfBirth":" East Orange, New Jersey, USA","bio":"Dorian Missick was born on January 15, 1976 in East Orange, New Jersey, USA. He is an actor and producer, known for Southland (2009), Lucky Number Slevin (2006) and Big Words (2013). He has been married to Simone Missick since February 19, 2012.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAwMDE3NjA3OV5BMl5BanBnXkFtZTgwMDA0OTk5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0592923","name":"Dorian Missick","idIMDB":"nm0592923"},"actorId":"nm0592923","character":"Annie's \"Dad\"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tracie Thoms","urlProfile":"http://www.imdb.com/name/nm1139632","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTk5Nzc2OF5BMl5BanBnXkFtZTcwMjEyODUzNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1975","placeOfBirth":" Baltimore, Maryland, USA","birthName":"Tracie Nicole Thoms","height":"5' 5\" (1.65 m)","bio":"Tracie Thoms was born on August 19, 1975 in Baltimore, Maryland, USA as Tracie Nicole Thoms. She is an actress and producer, known for The Devil Wears Prada (2006), Looper (2012) and Death Proof (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTk5Nzc2OF5BMl5BanBnXkFtZTcwMjEyODUzNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1139632","name":"Tracie Thoms","idIMDB":"nm1139632"},"actorId":"nm1139632","character":"Annie's \"Mom\"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Birbiglia","urlProfile":"http://www.imdb.com/name/nm1898126","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NDIwMzczN15BMl5BanBnXkFtZTgwMjU2NDk0MjE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1978","placeOfBirth":" Shrewsbury, Massachusetts, USA","height":"5' 8½\" (1.74 m)","bio":"Mike Birbiglia was born on June 20, 1978 in Shrewsbury, Massachusetts, USA. He is an actor and writer, known for Sleepwalk with Me (2012), Mike Birbiglia: What I Should Have Said Was Nothing (2008) and Your Sister's Sister (2011). His 2013 special, My Girlfriend's Boyfriend, was nominated for comedy special of the year at the American Comedy Awards. He has been married to Jen Stein since July 7, 2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NDIwMzczN15BMl5BanBnXkFtZTgwMjU2NDk0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1898126","name":"Mike Birbiglia","nicknames":["Birbigs"],"idIMDB":"nm1898126"},"actorId":"nm1898126","character":"Social Services Inspector","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephanie Kurtzuba","urlProfile":"http://www.imdb.com/name/nm1368866","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0OTQwOTc2MF5BMl5BanBnXkFtZTgwMTUyOTk0NzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Stephanie Kurtzuba is a NYC based actress. Her career has spanned the mediums of film, television and live theatre. She was born and raised in Omaha, Nebraska and later graduated from New York University's Tisch School of the Arts with a degree and honors in Acting. She is married with 2 children and is represented by Tony Cloer of Blue Ridge Entertainment in NYC.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0OTQwOTc2MF5BMl5BanBnXkFtZTgwMTUyOTk0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1368866","name":"Stephanie Kurtzuba","idIMDB":"nm1368866"},"actorId":"nm1368866","character":"Mrs. Kovacevic","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1823664","urlIMDB":"http://www.imdb.com/title/tt1823664","business":{"budget":{"money":"$65,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$15,861,939","country":"USA","day":"21","month":"12","year":"2014","remarks":"3,116 Screens"},{"money":"€49,215","country":"Portugal","day":"15","month":"02","year":"2015","remarks":"38 Screens"}],"gross":[{"money":"$85,911,262","country":"USA","day":"15","month":"03","year":"2015","remarks":""},{"money":"$85,817,373","country":"USA","day":"08","month":"03","year":"2015","remarks":""},{"money":"$85,706,021","country":"USA","day":"01","month":"03","year":"2015","remarks":""},{"money":"$85,570,056","country":"USA","day":"22","month":"02","year":"2015","remarks":""},{"money":"$85,013,666","country":"USA","day":"08","month":"02","year":"2015","remarks":""},{"money":"$84,272,703","country":"USA","day":"25","month":"01","year":"2015","remarks":""},{"money":"$82,980,000","country":"USA","day":"18","month":"01","year":"2015","remarks":""},{"money":"$72,460,370","country":"USA","day":"04","month":"01","year":"2015","remarks":""},{"money":"$45,701,210","country":"USA","day":"28","month":"12","year":"2014","remarks":""},{"money":"$15,861,939","country":"USA","day":"21","month":"12","year":"2014","remarks":""}],"weekendGross":[{"money":"$52,376","country":"USA","day":"15","month":"03","year":"2015","remarks":"126 Screens"},{"money":"$90,199","country":"USA","day":"08","month":"03","year":"2015","remarks":"139 Screens"},{"money":"$95,277","country":"USA","day":"01","month":"03","year":"2015","remarks":""},{"money":"$157,191","country":"USA","day":"22","month":"02","year":"2015","remarks":"206 Screens"},{"money":"$160,326","country":"USA","day":"08","month":"02","year":"2015","remarks":"217 Screens"},{"money":"$793,837","country":"USA","day":"25","month":"01","year":"2015","remarks":"756 Screens"},{"money":"$2,800,000","country":"USA","day":"18","month":"01","year":"2015","remarks":"1,585 Screens"},{"money":"$11,251,393","country":"USA","day":"04","month":"01","year":"2015","remarks":"3,166 Screens"},{"money":"$16,474,065","country":"USA","day":"28","month":"12","year":"2014","remarks":"3,197 Screens"},{"money":"$15,861,939","country":"USA","day":"21","month":"12","year":"2014","remarks":"3,116 Screens"}],"admissions":[{"money":"171,041","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"23","month":"09","year":"2013","remarks":null},{"money":null,"country":null,"day":"13","month":"12","year":"2013","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 58 min (118 min)"],"soundMix":["SDDS","Datasat","Dolby Digital"],"color":["Color"],"aspectRatio":["2.39 : 1"],"camera":["Sony CineAlta F65, Panavision Primo Lenses","Sony CineAlta PMW-F55, Panavision Primo Lenses"],"laboratory":["ColorWorks, Culver City (CA), USA (digital intermediate)","DeLuxe, New York (NY), USA (dailies)"],"filmLength":["3,243.24 m (6 reels)"],"negativeFormat":["AXSM","SRMemory"],"cinematographicProcess":["Digital Intermediate (4K) (master format)","F55 RAW (4K) (source format)","F65 RAW (4K) (source format) (high-speed shots)"],"printedFilmFormat":["35 mm (anamorphic) (Kodak Vision 2383)","D-Cinema"]},"rating":"5.3","metascore":"33","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"PG","awards":[{"award":"Golden Globes, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Performance by an Actress in a Motion Picture - Comedy or Musical","names":[{"name":"Quvenzhané Wallis","id":"nm4832920","role":null}]},{"category":"Best Original Song - Motion Picture","names":[{"name":"Greg Kurstin","id":"nm1604203","role":null},{"name":"Sia","id":"nm2397981","role":null},{"name":"Will Gluck","id":"nm0323239","role":null}]}]}]},{"award":"Alliance of Women Film Journalists 2015","titlesAwards":[{"titleAwardOutcome":"Won EDA Special Mention Award","categories":[{"category":"Actress Most in Need of a New Agent","names":[{"name":"Cameron Diaz","id":"nm0000139","role":null},{"name":"The Other Woman","id":"tt2203939","role":null},{"name":"Sex Tape","id":"tt1956620","role":null}]}]}]},{"award":"BET Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated BET Award","categories":[{"category":"Best Movie","names":[]}]}]},{"award":"Black Reel Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Outstanding Actress, Motion Picture","names":[{"name":"Quvenzhané Wallis","id":"nm4832920","role":null}]}]}]},{"award":"Broadcast Film Critics Association Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Critics Choice Award","categories":[{"category":"Best Young Actor/Actress","names":[{"name":"Quvenzhané Wallis","id":"nm4832920","role":null}]}]}]},{"award":"Gay and Lesbian Entertainment Critics Association (GALECA) 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Dorian Award","categories":[{"category":"Campy Flick of the Year","names":[]}]}]},{"award":"Guild of Music Supervisors Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated GMS Award","categories":[{"category":"Best Music Supervision for Films Budgeted Over 25 Million Dollars","names":[{"name":"Matthew Rush Sullivan","id":"nm1200153","role":null},{"name":"Wende Crowley","id":"nm0311969","role":null}]}]}]},{"award":"Image Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Image Award","categories":[{"category":"Outstanding Actress in a Motion Picture","names":[{"name":"Quvenzhané Wallis","id":"nm4832920","role":null}]}]}]},{"award":"Kids' Choice Awards, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Blimp Award","categories":[{"category":"Favorite Villain","names":[{"name":"Cameron Diaz","id":"nm0000139","role":null}]},{"category":"Favorite Movie Actress","names":[{"name":"Cameron Diaz","id":"nm0000139","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing - Music in a Musical Feature Film","names":[{"name":"Jon Wakeham","id":"nm0906821","role":"supervising sound editor"},{"name":"Lisa Jaime","id":"nm0415799","role":"music editor"},{"name":"Sherry Whitfield","id":"nm0925959","role":"music editor"}]}]}]},{"award":"Razzie Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won Razzie Award","categories":[{"category":"Worst Remake, Rip-Off or Sequel","names":[]}]},{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Supporting Actress","names":[{"name":"Cameron Diaz","id":"nm0000139","role":null}]}]}]},{"award":"Women Film Critics Circle Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated WFCC Award","categories":[{"category":"Best Young Actress","names":[{"name":"Quvenzhané Wallis","id":"nm4832920","role":null}]}]}]},{"award":"Young Artist Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won Young Artist Award","categories":[{"category":"Best Performance in a Feature Film - Leading Young Actress","names":[{"name":"Quvenzhané Wallis","id":"nm4832920","role":null}]}]}]}],"votes":"26,929","type":"Movie","companyCreditsSimple":[{"idCompany":"co0448488","name":"Marcy Media"},{"idCompany":"co0219609","name":"Olive Bridge Entertainment"},{"idCompany":"co0072775","name":"Overbrook Entertainment"}],"keywords":{"keywords":["penthouse","billionaire","mayoral candidate","business tycoon","tween girl","reference to star trek","reference to the starship enterprise","new york city new york","villain turns good","comic villainess","kiss on the lips","car chase","adoptive father","adoption","adopted child","adopted daughter","adoptive father adopted daughter relationship","chase","helicopter","illiteracy","foster sister","publicity stunt","approval rating","almost hit by a truck","public image","harlem manhattan new york city","mayoral campaign","foster daughter","foster mother","foster child","based on comic strip","happy ending","10 year old","modernized setting","one word title","2010s","forename as title","title spoken by character","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:52:12"}}