{"data":{"movies":[{"title":"Rock Jocks","originalTitle":"","year":"2012","releaseDate":"20120901","directors":[{"name":"Paul V. Seetachitt","id":"nm2282414"}],"writers":[{"name":"Paul V. Seetachitt","id":"nm2282414"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5NjYyNzM1NDleQTJeQWpwZ15BbWU3MDQxODM5MDg@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Sci-Fi"],"plot":"A group of dysfunctional government employees find themselves responsible for shooting down asteroids that are headed for earth.","simplePlot":"A group of dysfunctional government employees find themselves responsible for shooting down asteroids that are headed for earth.","actors":[{"actorName":"Andrew Bowen","urlProfile":"http://www.imdb.com/name/nm0100793","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU3YTcwMWItOWMzYi00MGJjLWE2MzgtYjA0MmU2ZDZjZGY4XkEyXkFqcGdeQXVyMjQ2MTU5NDU@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1972","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Andrew S. Bowen","height":"6' 2\" (1.88 m)","bio":"Born in Boston and raised in Vermont, Andrew Bowen's career began when - after seeing the movie Grease he announced to his parents that he \"wanted to be like John Travolta when he grow up.\" With his parents full support, 6 month's later, he performed in his first play and after hearing his audience roar with laughter for the first time.... he never looked back. Over the next 12 years, Andrew studied Modern Jazz & Ballet and appeared in dozens of local theater productions in Vermont from Pippin to Guys and Dolls. At the end of his freshman year in High School, a bit of good luck (a director chose his grandmother's house to shoot a commercial at) landed Andrew an agent in New York. He began commuting to the city several times a year to audition and finally, after 4 years of being the \"Callback\" kid, Andrew landed his first role - as Katheryn Erby's love interest George Stark in the Bill Murray/Richard Dreyfuss comedy What About Bob? Although he received a personal letter from director Frank Oz before the film's release informing him that his role had ended up on the cutting room floor (essentially becoming the extra that just wouldn't go away) he headed for Hollywood undaunted. He was in the union, inspired by the advice Bill and Richard had given him and ready to become a star. Andrew began booking commercials and small movie and TV gigs almost immediately and for the next few years built his resume and honed his craft. His first big break finally came a few years later when he was cast as the lead in Capcom's a live-action interactive video game Fox Hunt playing Jack Fremont - a character best described as 'James Bond meets Dumb and Dumber'. The character gave Andrew a chance to do everything from slapstick physical comedy to drama and martial arts. His performance wound up being so funny, the game was was turned into a feature film, developed as a TV series and landed Andrew a Talent Deal at Warner Brothers Television. While waiting for the Fox Hunt pilot to be shot, Bowen (having studied screenwriting at USC) wrote, directed, financed and shot a short film called Lone Defender, intended as an auditioning piece to play Peter Parker for director James Cameron's Spider-Man movie. He also wrote a very personal and moving coming of age script for what would eventually be his directorial debut \"Along The Way\" . After the Fox Hunt pilot was not picked up, Andrew joined the cast of the 5th season of Fox's \"Mad TV\" where - due in no small part to his uncanny impressions - he was quickly called one of the \"New Talents to watch\" by TV Guide. After a season on the show, with the help of his father, Bowen raised enough money to realize his dream to make his directorial debut \"Along the Way\". Production started that fall where, aside from his directing and producing duties, he gained over 40lbs to play the films tragic outsider, Jocko. A year later, after receiving rave reviews and Winning ~ Best Feature~ at the Wilmington International Film Festival, Bowen's hopes of distribution were dashed when he found out his producer had stolen funds and the distribution company, while holding his semi-complete masters, went bankrupt: taking the film away from him for over a decade. Thought crushed by the loss of his film Andrew had started a family, found the love of a great women buckled down, kept moving forward and re-start his career. Luckily, Andrew's determination paid off as he has continued to write and land steady acting work ever since. Bowen has appeared in over a hundred and fifty commercials, dozen's of Films, TV shows and Video Games working with such high caliber talents as Gale Anne Hurd (The Walking Dead), Dean Devlin (Independence Day), James Mangold (Walk The Line), Lasse Hallstrom (What's Eating Gilbert Grape) and Jason Reitman (Juno, Up In The Air). Some of Bowen's credits include recurring role's on Magic City, Reno 911! and ER. Guest appearances include: Criminal Minds, Maron, Ricky, Nicky, Dicky and Dawn, Leverage, Big Time Rush, Cold Case, CSI:NY and Dollhouse. Feature work include starring opposite Uma Thurman in The Gift, Paul Seetachitt's hysterical comedy Rock Jocks (with Felicia Day and Doug Jones), Conjurer, Butterfly Dreaming, Evolution and his critically acclaimed work in The Work and The Glory 2 & 3 (playing American Frontier Legend Brigham Young). An established voice-over talent, Bowen has lent his voice to some of the most successful video games of all time including - Johnny Cage in Mortal Kombat X, Josh Birk/Nyte Blayde in Saint's Row (3-4), \"Doc\" in the Star Wars: The Old Republic, \"Sev\" in Killzone 3. and \"Private Hudson\" in Aliens: Colonial Marines based on James Cameron's massive hit. Bowen can currently be seen in the horror anthology Holidays opposite Lorenza Izzo (which premiered at the 2016 Tribeca Film Festival), Relativity's Summer Forever (with Megan Nicole and Alyson Stoner) and as the lead in Eric Won's award winning web-series The Division (available on Hulu). In 2016, Bowen finished work on the feature Tribes of Palos Verdes (starring Jennifer Garner) and will be seen in the black comedy All For Nikki and John Asher's powerful Autism drama PO (with Christopher Gorham and Julian Feder) that has won three best picture and two best acting awards since it's festival debut in April of 2016. A producer & accomplished screenwriter, Bowen has optioned several scripts and is currently in active development on two his high concept TV series and his latest feature The Mcauliffe Equation. A father of three and devoted family man (his son Seth Lucas Bowen has appeared in several commercials, Shameless, Rock Jocks & CBS's Bad Teacher) Andrew's laughter, exceptional range and ability to inhibit a wide range of complex characters has contributed to his continuing rise as a talented character actor and a commanding and charismatic leading man.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU3YTcwMWItOWMzYi00MGJjLWE2MzgtYjA0MmU2ZDZjZGY4XkEyXkFqcGdeQXVyMjQ2MTU5NDU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0100793","name":"Andrew Bowen","idIMDB":"nm0100793"},"actorId":"nm0100793","character":"John","urlCharacter":"http://www.imdb.com/character/ch0355877","main":true},{"actorName":"Felicia Day","urlProfile":"http://www.imdb.com/name/nm1260407","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4OTI4NzUxNF5BMl5BanBnXkFtZTcwNzg0NDgyMQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1979","placeOfBirth":" Huntsville, Alabama, USA","birthName":"Kathryn Felicia Day","height":"5' 5\" (1.65 m)","bio":"Felicia Day was born on June 28, 1979 in Huntsville, Alabama, USA as Kathryn Felicia Day. She is an actress and producer, known for her work on TV and the web video world. She has appeared in mainstream television shows and films, including \"Supernatural\", and a two-season arc on the SyFy series \"Eureka\". However, Felicia may be best known for her work in the web video world. She co-starred in Joss Whedon's Internet musical \"Dr. Horrible's Sing-Along Blog,\" and created and stars in the hit web series \"The Guild\". Felicia is creative chief officer of her production company Knights of Good, which produced the web series \"Dragon Age\" and the YouTube channel Geek & Sundry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4OTI4NzUxNF5BMl5BanBnXkFtZTcwNzg0NDgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1260407","name":"Felicia Day","idIMDB":"nm1260407"},"actorId":"nm1260407","character":"Alison","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Justin Chon","urlProfile":"http://www.imdb.com/name/nm2014390","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMzI0MTIwNV5BMl5BanBnXkFtZTcwMTIyMzIzMg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 May 1981","placeOfBirth":" Irvine, California, USA","birthName":"Justin Jitae Chon","height":"5' 5¾\" (1.67 m)","bio":"Justin Chon was born in Garden Grove, Orange County, California, and was raised in Irvine, California. He is the son of Kyung, a pianist, and Sang Chon, a former child actor. Justin is of Korean descent. His acting career started at 2005. He was in shows such as 'Jack & Bobby' and 'Taki & Luci'. He gained popularity in 2006 when he played Peter Wu in the Disney Channel film 'Wendy Wu: Homecoming Warrior'. He also played Tony Lee in the Nickelodeon sitcom 'Just Jordan'. Starting in 2008, he played Eric Yorkie in the film adaptations of the Twilight Saga. Chon's hobbies are surfing, skateboarding, snowboarding, playing the violin and guitar, and making comedic videos on YouTube with his friends.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMzI0MTIwNV5BMl5BanBnXkFtZTcwMTIyMzIzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2014390","name":"Justin Chon","idIMDB":"nm2014390"},"actorId":"nm2014390","character":"Seth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gerry Bednob","urlProfile":"http://www.imdb.com/name/nm0066144","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NjUxNjQ2Nl5BMl5BanBnXkFtZTcwMzE5NjI1Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Gerry Bednob is an actor and producer, known for The 40-Year-Old Virgin (2005), Zack and Miri Make a Porno (2008) and Honey 2 (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NjUxNjQ2Nl5BMl5BanBnXkFtZTcwMzE5NjI1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0066144","name":"Gerry Bednob","idIMDB":"nm0066144"},"actorId":"nm0066144","character":"Tom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin Wu","urlProfile":"http://www.imdb.com/name/nm3661913","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjA0OTYxMF5BMl5BanBnXkFtZTgwODEzNjQwMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 June 1990","placeOfBirth":" Houston, Texas, USA","height":"5' 11\" (1.8 m)","bio":"Kevin Wu was born on June 12, 1990 in Houston, Texas, USA. He is an actor and writer, known for Hang Loose (2012), Kev Jumba Dances with the Stars! (2012) and Man Up (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjA0OTYxMF5BMl5BanBnXkFtZTgwODEzNjQwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3661913","name":"Kevin Wu","idIMDB":"nm3661913"},"actorId":"nm3661913","character":"Danny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Woolley","urlProfile":"http://www.imdb.com/name/nm1296565","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTcxNDUxODIwNl5BMl5BanBnXkFtZTgwODA5NDEzOTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"A British actor and musician, began in theatre at the age of 14, joined the local Youth Theatre. Worked in local radio, both as a voice artist an on-air presenter. Appeared in several theatrical productions in Los Angeles, including Shakespeare's \"Hamlet\" and \"A Midsummer Nights Dream.\" Starred in the film \"Poet Heads\" which won the Best Mockumentary Feature at the Harlem International Film Festival. Co-wrote and recorded the song \"Back to You,\" which appears on the soundtrack of the independent film \"3 Days Gone.\" Writes and composes music, plays guitar, piano, and bass. Blends rock and classical, with occasional electronic overtones. Has played in several bands in the U.K","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTcxNDUxODIwNl5BMl5BanBnXkFtZTgwODA5NDEzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1296565","name":"Mark Woolley","idIMDB":"nm1296565"},"actorId":"nm1296565","character":"Austin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Doug Jones","urlProfile":"http://www.imdb.com/name/nm0427964","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNDY4MDc0OF5BMl5BanBnXkFtZTYwODM4MDY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1960","placeOfBirth":" Indianapolis, Indiana, USA","height":"6' 3½\" (1.92 m)","bio":"The youngest of four brothers, Doug Jones was born on May 24, 1960 in Indianapolis, Indiana, and grew up in the city's Northeastside. After attending Bishop Chatard High School, he headed off to Ball State University, where he graduated in 1982 with a Bachelor's degree in Telecommunications, with a minor in Theatre. He learned mime at school, joining a troupe and doing the whole white-face thing, and has also worked as a contortionist. After a hitch in theater in Indiana, he moved to Los Angeles in 1985, and has not been out of work since - he's acted in over 25 films, many television series (Including the award-winning Buffy the Vampire Slayer (1997), his episode 'Hush' garnered two Emmy nominations) and over 90 commercials and music videos with the likes of Madonna and Marilyn Manson. Although known mostly for his work under prosthetics, he has also performed as 'himself' in such highly-rated films as Adaptation. (2002) with Nicolas Cage and indie projects such as Phil Donlon's A Series of Small Things (2005). But it is his sensitive and elegant performance as 'Abe Sapien' in Hellboy (2004), which stormed to the top of the U.S. box office in the spring of 2004, that has brought him an even higher profile and much praise from audiences and critics alike. Doug is married and lives in California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNDY4MDc0OF5BMl5BanBnXkFtZTYwODM4MDY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0427964","name":"Doug Jones","nicknames":["Dougie"],"idIMDB":"nm0427964"},"actorId":"nm0427964","character":"Smoking Jesus","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Picardo","urlProfile":"http://www.imdb.com/name/nm0000585","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYxMDEwMjYwMV5BMl5BanBnXkFtZTcwNzEzNzUzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 October 1953","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"5' 9\" (1.75 m)","bio":"Robert Picardo was born on October 27, 1953 in Philadelphia, Pennsylvania, USA, where he spent his whole childhood. He graduated from the William Penn Charter School and attended Yale University. At Yale, he landed a role in Leonard Bernstein's \"Mass\" and at age 19, he played a leading role in the European premiere of \"Mass\". Later, he graduated with a Bachelor's degree in Drama from Yale University. He appeared in the David Mamet play \"Sexual Perversity in Chicago and with Diane Keaton in \"The Primary English Class\". In 1977, he made his Broadway debut in the comedy hit \"Gemini\" with Danny Aiello and also appeared in Bernard Slade's \"Tribute\", \"Beyond Therapy\" as well as \"Geniuses\" and \"The Normal Heart\" for which he won a Drama-Logue Award. Then, he became involved in television, where he soon was nominated for an Emmy Award for his role as Coach Cutlip on the series The Wonder Years (1988). Robert appeared in several other series: China Beach (1988), Frasier (1993), Ally McBeal (1997), Home Improvement (1991), Au-delà du réel - l'aventure continue (1995) and Sabrina, the Teenage Witch (1996). In 1995, he got the role of the holographic doctor on Star Trek: Voyager (1995) where he also directed two episodes. He also got roles in The Howling (1981), Star 80 (1983), Get Crazy (1983), Oh, God! You Devil (1984), Innerspace (1987), Munchies (1987), Samantha (1991), White Mile (1994), First Contact (1996), Small Soldiers (1998), Les Looney Tunes passent à l'action (2003), Quantum Quest: A Cassini Space Odyssey (2010), and so on. He resides in Los Angeles, California with his wife Linda, and their two daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYxMDEwMjYwMV5BMl5BanBnXkFtZTcwNzEzNzUzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000585","name":"Robert Picardo","nicknames":["Bob"],"idIMDB":"nm0000585"},"actorId":"nm0000585","character":"Guard 1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Mewes","urlProfile":"http://www.imdb.com/name/nm0582939","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MTU3MDYwNV5BMl5BanBnXkFtZTcwNjQ2OTUwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 June 1974","placeOfBirth":" Highlands, New Jersey, USA","birthName":"Jason Edward Mewes","height":"5' 11¼\" (1.81 m)","bio":"New Jersey born and bred actor, who burst onto cinema screens in 1994, playing the grass smoking, fast talking, foul mouthed and over sexed,...but very likable \"Jay\" in Kevin Smith's hilarious low budget hit Clerks (1994). The off beat & philosophical drug dealing characters of \"Jay and Silent Bob\" (Mewes and Smith) cropped up again in four more films directed by the talented Smith.....the tepidly received Mallrats (1995), was followed by more street wisdom in the scintillating romantic comedy Chasing Amy (1997), they tackled theological issues in the quirky religious comedy Dogma (1999) and then took on Hollywood, in the road trip epic Jay and Silent Bob Strike Back (2001). There was also a short-lived animated series Clerks (2000). Their characters also made a cameo appearance in Scream 3 (2000). Mewes has since kicked on to appearing in other non-Smith projects including Hot Rush (2002), R.S.V.P. (2002), High Times Potluck (2002), Pauly Shore Is Dead (2003), My Big Fat Independent Movie (2005) and Feast (2005). His last Kevin Smith's films are Clerks II (2006) and Zack and Miri Make a Porno (2008). Mewes has appeared in every film directed by Smith except Jersey Girl (2004), Cop Out (2010), and Red State (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MTU3MDYwNV5BMl5BanBnXkFtZTcwNjQ2OTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0582939","name":"Jason Mewes","nicknames":["Chronic"],"idIMDB":"nm0582939"},"actorId":"nm0582939","character":"Guard 2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Greg Benson","urlProfile":"http://www.imdb.com/name/nm0072504","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNjk2MjI1MF5BMl5BanBnXkFtZTYwMDcwOTgy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1968","placeOfBirth":" Dallas, Texas, USA","birthName":"Gregory Charles Benson","bio":"Greg Benson has firmly established himself as one of the hardest-working commercial actors in the business. With his strong performance as \"Homer\" in the Slamdance Film Festival, hit Black Days (2001), and a scene-stealing role opposite Karen Black in Don't Try This at Home! (1998), it seems Hollywood has finally begun to realize what he has to offer. Benson was born and raised in Dallas, Texas, and relocated to Los Angeles to pursue work in television and film. He quickly became one of the busiest commercial actors in town, performing in over 80 advertisements including Michelob, Hertz, Lean Pockets, Honda and M.C.I. His film career began with small roles, including a great turn as \"Jeff\", the smarmy coworker in Robby Benson's cult film Modern Love (1990), and he has appeared in character roles in over half a dozen films since then. He's also had guest appearances on numerous television shows, including a memorable comic performance as Jane's neighbor in the final season of Melrose Place (1992) in 1999.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNjk2MjI1MF5BMl5BanBnXkFtZTYwMDcwOTgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0072504","name":"Greg Benson","idIMDB":"nm0072504"},"actorId":"nm0072504","character":"Outgoing Deputy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Seth Lucas Bowen","urlProfile":"http://www.imdb.com/name/nm5505605","urlPhoto":"","biography":{"bio":"Seth Lucas Bowen is an actor, known for Rock Jocks (2012), Shameless (2011) and The 2nd Annual Geekie Awards (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5505605","name":"Seth Lucas Bowen","idIMDB":"nm5505605"},"actorId":"nm5505605","character":"Boy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eugene Byrd","urlProfile":"http://www.imdb.com/name/nm0126021","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMjQyNjU5M15BMl5BanBnXkFtZTcwMjE0MDMzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1975","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"5' 7\" (1.7 m)","bio":"Eugene Byrd was born on August 28, 1975 in Philadelphia, Pennsylvania, USA. He is an actor and producer, known for 8 Mile (2002), Dead Man (1995) and Sleepers (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMjQyNjU5M15BMl5BanBnXkFtZTcwMjE0MDMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0126021","name":"Eugene Byrd","idIMDB":"nm0126021"},"actorId":"nm0126021","character":"Layne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zach Callison","urlProfile":"http://www.imdb.com/name/nm2642131","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTFkYTlmNTgtZDMzNC00YzZjLTg1OGItMTllMzgzMDU3OGY2XkEyXkFqcGdeQXVyMTUyODk2MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 October 1997","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Zachry Callison","height":"5' 10\" (1.78 m)","bio":"Zach began acting at the age of seven. He was cast as Winthrop in The Music Man. Zach liked the fact that the lisp he had to use allowed him to spit without getting in trouble. Zach was cast in his first feature film role in \"Kingshighway\" 2007. He has an older brother Wes and older sister Andrea.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTFkYTlmNTgtZDMzNC00YzZjLTg1OGItMTllMzgzMDU3OGY2XkEyXkFqcGdeQXVyMTUyODk2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2642131","name":"Zach Callison","idIMDB":"nm2642131"},"actorId":"nm2642131","character":"Dylan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Clair","urlProfile":"http://www.imdb.com/name/nm3922324","urlPhoto":"","biography":{"bio":"Michael Clair is known for his work on Dogtor (2012), Rock Jocks (2012) and Rack City (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3922324","name":"Michael Clair","idIMDB":"nm3922324"},"actorId":"nm3922324","character":"Roomate","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James DuMont","urlProfile":"http://www.imdb.com/name/nm0003069","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTc3MDc0NF5BMl5BanBnXkFtZTgwMjEwNjk0MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 August 1965","placeOfBirth":"","height":"5' 9\" (1.75 m)","bio":"Actor/Producer James DuMont is one of the busiest performers in & out Hollywood, working in both feature films and television. He recently snagged the supporting lead role of J. Parnell Thomas in the autobiographical feature, Trumbo opposite Bryan Cranston, directed by Jay Roach & WB Nowlin in the Hank Williams bio-pic I Saw The Light opposite Tom Hiddleston as well as recurring for a 2nd season on the F/X series American Horror Story. DuMont's most recent supporting role was as Rayon's father opposite Oscar winner, Jared Leto in Focus Features' Dallas Buyers Club and in director Lee Daniels' The Butler, portraying Chief of Staff Sherman Adams opposite Robin Williams' Dwight D. Eisenhower. DuMont also appeared in TriStar Pictures' When the Game Stands Tall with Jim Caviezel and Laura Dern and Corporal Dooley in the James Brown bio-pic, Get On Up, starring Chadwick Boseman. James can be seen in the indie thriller Catch Hell starring Ryan Phillippe, which is also his directorial debut and this summer in the highly anticipated Jurassic World. Mr. DuMont can next be seen in Little Boy starring Emily Watson and Tom Wilkinson from Open Road Pictures and the indie comedy Mind Puppets starring Kevin Pollak & Vinne Jones. DuMont had a supporting role in Barefoot, opposite Evan Rachel Wood & Scott Speedman; Baytown Outlaws, with Billy Bob Thornton and Eva Longoria; and Jean-Claude Van Damme and Scott Adkins' Universal Soldier - Day of Reckoning. On the small screen, DuMont had recurring roles as Foster on this season's American Horror Story-Freak Show & Dr. Morrison on America Horror Story-Coven, and he completed his fourth and final season as Captain Richard La Fouchette on the critically-acclaimed HBO series, Treme, working opposite Oscar-winning actress Melissa Leo. Prior to that, he had a recurring role opposite Ray Romano on TNT's Men of a Certain Age. DuMont was recently seen in the Hallmark movie, Remember Sunday on ABC, with Zachary Levi and the Lifetime/History Channel mini-series, Bonnie and Clyde. Born and raised in Chicago and New York City attended Boston University then left for New York City, DuMont worked steadily in theater, discovered Buddhism (which he still practices today) and made his Broadway debut in Six Degrees of Separation (which required nudity for the part). Journalist George Plimpton wrote a piece for Esquire magazine about James and his experience as \"the Nudist Buddhist.\" After Six Degrees of Separation closed, DuMont performed opposite Mary Louise Parker, Brooke Smith and Sam Robards in Throwing Your Voice, a role that won him a rave review from the New York Times. DuMont then decided to \"go nude\" once more in the national tour of Six Degrees of Separation. When that tour ended, DuMont moved to Los Angeles, where he produced award-winning plays and started booking television acting gigs on The George Carlin Show, Lois & Clark, Grey's Anatomy, Mad Men, Rizzoli and Isles, Harry's Law and Desperate Housewives. On the film front, his early feature credits included Speed, S.W.A.T., Catch Me If You Can, War of the Worlds, Seabiscuit and Ocean's 13. DuMont, meanwhile had started to produce shorts and features. His short film, The Confession, won 20 of 25 international film festivals with documentary filmmaker Michael Moore calling it \"one of the darkest, funniest shorts I have ever seen.\" DuMont also co-produced Statistics, winner of the Audience Award at the Silverlake Film Festival. He also starred in and produced the critically-acclaimed stage production, Serious Games & Morphic Resonance, which won both the L.A. Weekly Award for Best Ensemble and the Los Angeles Times 'Critic's Choice Award.' With over 100 major feature films and television shows under his belt, DuMont's career is showing no signs of slowing down. He's currently developing feature films with producing partners in New York City, Los Angeles and Louisiana, his own Web Series while revising & adapting his one-man play, My Life as a DJ into a feature film. Currently living in both Los Angeles and New Orleans, DuMont considers himself to be \"Bayou Coastal.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTc3MDc0NF5BMl5BanBnXkFtZTgwMjEwNjk0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003069","name":"James DuMont","nicknames":["Jimmy Dime"],"idIMDB":"nm0003069"},"actorId":"nm0003069","character":"Rich","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1869653","urlIMDB":"http://www.imdb.com/title/tt1869653","business":{"budget":{"money":"$2,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 31 min (91 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.78 : 1 / (high definition)"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["Video"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"5.4","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"NOT RATED","awards":[{"award":"Young Artist Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in a Feature Film - Supporting Young Actor","names":[{"name":"Zach Callison","id":"nm2642131","role":null}]}]}]}],"votes":"437","type":"Movie","companyCreditsSimple":[{"idCompany":"co0065992","name":"Bright Penny Productions"},{"idCompany":"co0304835","name":"Intelligent Life Media"}],"keywords":{"keywords":["no opening credits","punched in the face","drinking","explosion","fight","father son relationship","youtube sensation","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:13:09"}}