{"data":{"movies":[{"title":"Le congrès","originalTitle":"The Congress","year":"2013","releaseDate":"20140724","directors":[{"name":"Ari Folman","id":"nm0284369"}],"writers":[{"name":"Stanislaw Lem","id":"nm0501015"},{"name":"Ari Folman","id":"nm0284369"}],"runtime":"122 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MTUzNDk3M15BMl5BanBnXkFtZTgwMTUwNTQ5MTE@._V1.jpg","countries":["Israel","Germany","Poland","Luxembourg","Belgium","France"],"languages":["English"],"genres":["Animation","Drama","Sci-Fi"],"plot":"An aging, out-of-work actress accepts one last job, though the consequences of her decision affect her in ways she didn't consider.","simplePlot":"An aging, out-of-work actress accepts one last job, though the consequences of her decision affect her in ways she didn't consider.","actors":[{"actorName":"Robin Wright","urlProfile":"http://www.imdb.com/name/nm0000705","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTc4MzEyOV5BMl5BanBnXkFtZTcwODY0ODkzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1966","placeOfBirth":" Dallas, Texas, USA","birthName":"Robin Virginia Gayle Wright","height":"5' 6\" (1.68 m)","bio":"Robin Virginia Wright was born in Dallas, Texas, to Gayle (Gaston), a national director at Mary Kay, and Freddie Wright, a pharmaceutical executive. She grew up in San Diego, California. She started her professional career as a model in 1980 at age 14, and worked both in Paris and Japan. After finishing high school she decided to become an actress. She got a role on the soap opera Santa Barbara (1984), for which she was nominated three times for a Daytime Emmy. During the first season of the show, she fell in love with fellow cast member Dane Witherspoon, whom she married in 1986. Meanwhile, she starred in The Princess Bride (1987), playing the title role. After leaving the cast of Santa Barbara, she got the starring role in Denial (1990) alongside Jason Patric. In 1990, she was in State of Grace (1990), where she met actor Sean Penn, by whom she had a daughter, Dylan Frances, and a son, Hopper Jack. After taking some time off, Robin was back to Hollywood with one the best roles of her career: She played Tara in The Playboys (1992). She was extremely stunning and brilliant. Then, she acted in Toys (1992) with Robin Williams, and she gave a funny performance. In 1994, Wright was in the blockbuster hit Forrest Gump (1994), with Tom Hanks. For her performance as Jenny, she got a nomination for a Golden Globe Award. She got a small role in The Crossing Guard (1995), which starred Jack Nicholson. After turning down 14 roles, she played the title role of MGM/UA upcoming Moll Flanders (1996), directed by Pen Densham. Her co-stars are Morgan Freeman and Stockard Channing. She just started to star in Erin Dignam's Loved (1997), with William Hurt.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTc4MzEyOV5BMl5BanBnXkFtZTcwODY0ODkzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000705","name":"Robin Wright","idIMDB":"nm0000705"},"actorId":"nm0000705","character":"Robin Wright","urlCharacter":"http://www.imdb.com/character/ch0410906","main":true},{"actorName":"Harvey Keitel","urlProfile":"http://www.imdb.com/name/nm0000172","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMDcxMjgxOV5BMl5BanBnXkFtZTcwODc2NTk2MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 May 1939","placeOfBirth":" Brooklyn, New York, USA","height":"5' 7½\" (1.71 m)","bio":"American actor and producer Harvey Keitel was born on May 13, 1939 in Brooklyn, New York City. An Oscar and Golden Globe Award nominee, he has appeared in films such as Martin Scorsese's Mean Streets (1973) and Taxi Driver (1976), Ridley Scott's The Duellists (1977) and Thelma & Louise (1991), Peter Yates' Mother, Jugs & Speed (1976), Quentin Tarantino's Reservoir Dogs (1992) and Pulp Fiction (1994), Jane Campion's La leçon de piano (1993), Abel Ferrara's Bad Lieutenant (1992), Robert Rodriguez's From Dusk Till Dawn (1996), James Mangold's Cop Land (1997), Paolo Sorrentino's Youth (2015). He is regarded as one of the greatest method actors ever. Along with actors Al Pacino and Ellen Burstyn, he is the current co-president of the Actors Studio. Keitel studied under both Stella Adler and Lee Strasberg and at the HB Studio, eventually landing roles in some Off-Broadway productions. During this time, Keitel auditioned for filmmaker Martin Scorsese and gained a starring role as \"J.R.\", in Scorsese's first feature film, Who's That Knocking at My Door (1967). Since then, Scorsese and Keitel have worked together on several projects. Keitel had the starring role in Scorsese's Mean Streets (1973), which also proved to be Robert De Niro's breakthrough film. Keitel re-teamed with Scorsese for Alice Doesn't Live Here Anymore (1974), in which he had a villainous supporting role, and appeared with Robert De Niro again in Scorsese's Taxi Driver (1976), playing the role of Jodie Foster's pimp.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMDcxMjgxOV5BMl5BanBnXkFtZTcwODc2NTk2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000172","name":"Harvey Keitel","idIMDB":"nm0000172"},"actorId":"nm0000172","character":"Al","urlCharacter":"http://www.imdb.com/character/ch0472395","main":true},{"actorName":"Sami Gayle","urlProfile":"http://www.imdb.com/name/nm3774109","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5MTQ3NTM3OV5BMl5BanBnXkFtZTcwNjkwNzUyOQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 January 1996","placeOfBirth":" Weston, Florida, USA","height":"5' 4\" (1.63 m)","bio":"Actress Sami Gayle stars as \"Nicky Reagan-Boyle\" on CBS' cop drama Blue Bloods. Gayle began her acting career as Baby June in the off-Broadway production of \"Gypsy,\" starring Patti LuPone. She then reprised her role when the production transferred to Broadway shortly thereafter. Gayle later co-starred in the off-Broadway plays \"Oohrah!\" at the Atlantic Theatre Company and MCC Theatre's \"Family Week,\" under the direction of Academy-Award winner Jonathan Demme. She was featured in the 2007 Broadway production of \"Dr. Seuss' How the Grinch Stole Christmas! The Musical.\" Gayle's breakthrough role in film came in 2012 when she co-starred as a young prostitute opposite Adrien Brody, in director Tony Kaye's DETACHMENT. Also that year,she starred opposite Nicolas Cage and Josh Lucas in Millennium Films' STOLEN. In February 2014, Gayle starred in the film adaptation of VAMPIRE ACADEMY for The Weinstein Company. She played \"Mia Rinaldi,\" nemesis to the film's Rose and Lissa. In April 2014, she appeared opposite Kristen Wiig and Guy Pierce in the indie, HATESHIP LOVESHIP, which premiered at the 2013 Toronto International Film Festival. Later in the year, Gayle will be seen with Robin Wright in THE CONGRESS, which had its world premiere at the 2013 Cannes Film Festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5MTQ3NTM3OV5BMl5BanBnXkFtZTcwNjkwNzUyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3774109","name":"Sami Gayle","idIMDB":"nm3774109"},"actorId":"nm3774109","character":"Sarah","urlCharacter":"http://www.imdb.com/character/ch0563889","main":true},{"actorName":"Jon Hamm","urlProfile":"http://www.imdb.com/name/nm0358316","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg0MzA4MTY5M15BMl5BanBnXkFtZTcwODg2MTIwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 March 1971","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Jonathan Daniel Hamm","height":"6' 2\" (1.88 m)","bio":"Jon Hamm was born on March 10, 1971 in St. Louis, Missouri, USA as Jonathan Daniel Hamm. He is an actor and producer, known for Mad Men (2007), The Town (2010) and Minions (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg0MzA4MTY5M15BMl5BanBnXkFtZTcwODg2MTIwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0358316","name":"Jon Hamm","idIMDB":"nm0358316"},"actorId":"nm0358316","character":"Dylan Truliner","urlCharacter":"http://www.imdb.com/character/ch0563885","main":true},{"actorName":"Kodi Smit-McPhee","urlProfile":"http://www.imdb.com/name/nm2240346","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE4ODU4NzY5NV5BMl5BanBnXkFtZTgwOTIwNTk5MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1996","placeOfBirth":" Adelaide, South Australia, Australia","height":"6' 2\" (1.88 m)","bio":"Kodi was born on June 13, 1996 in Adelaide, Australia, to Sonja Smit and Andy McPhee, who is an actor and professional wrestler. His sister is actress Sianoa Smit-McPhee. In 2014, Kodi starred in Twentieth Century Fox's Dawn of the Planet of the Apes opposite Andy Serkis, Jason Clarke, Gary Oldman, and Keri Russell. The project reunited him with director Matt Reeves with whom he previously worked with on the film Let Me in (opposite Chloe Moretz). The film has grossed over $700MM Worldwide. The film Young Ones (dir: Jake Paltrow) in which Kodi starred opposite Michael Shannon, Nicholas Hoult and Elle Fanning, premiered at the 2014 Sundance Film Festival. Kodi was recently at the 2015 Sundance Film Festival for the premiere of Slow West (dir. John MacLean), in which he stars opposite Michael Fassbender and Ben Mendelsohn. The film received the World Cinema Grand Jury Prize. It's a Western two hander that takes place in the Wild West in the 1870's. A24 has released the film in the US to rave reviews. Earlier in 2015, Kodi was seen as the lead role in an epic 8 part Australian television mini series Gallipoli (2015) (Channel Nine) based on the infamous WWI battle that took place 100 years ago. In 2016, Kodi co-starred in X-Men: Apocalypse (2016) (dir: Bryan Singer) for Twentieth Century Fox, portraying the role of Nightcrawler. He lives in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE4ODU4NzY5NV5BMl5BanBnXkFtZTgwOTIwNTk5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2240346","name":"Kodi Smit-McPhee","nicknames":["Koda Spekz"],"idIMDB":"nm2240346"},"actorId":"nm2240346","character":"Aaron Wright","urlCharacter":"http://www.imdb.com/character/ch0462161","main":true},{"actorName":"Danny Huston","urlProfile":"http://www.imdb.com/name/nm0396812","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1MTk4NDA0NjZeQTJeQWpwZ15BbWU3MDQ5NzIzNTk@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 May 1962","placeOfBirth":" Rome, Lazio, Italy","height":"6' 2\" (1.88 m)","bio":"Danny Huston is an American actor and director who has worked with Academy award-nominated actors from the very start of his career. No surprise for a man who was born into a legendary Hollywood family whose most noted members included his half-sister, his father, his grandfather, his nephew, and of course, himself. Born in Rome, Huston's parents were Zoe Sallis and John Huston. Sallis was an established author in her own right. John Huston was, by that point, famous for his many high caliber films, and notorious for his personal life, which included five marriages, two children, another adopted child, and many affairs, one of which resulted in Danny's conception. Like his half-sister, Anjelica Huston, Danny Huston chose to follow his father into the world of film. His birthright served as a blessing, so that his first film appearance as an actor was in The 'Human' Factor (1975), a revenge film directed by and starring men who already had Oscar nominations under their belts. Following that small appearance, Huston turned to directing for the next few years. It wasn't until the late 1980s that Huston directed his first made-for-television film, Mister Corbett's Ghost (1987). Based on a novella by Leon Garfied, the film starred such screen legends as Paul Scofield and Burgess Meredith. It is also notable for being the final acting project of Huston's father John, who spent his final years assisting his children in their own budding film careers. Shortly before his death, John helped produce his son's first feature length film, Mr. North (1988). The film was directed by Huston, and included his half-sister Anjelica in the cast, as well as Virginia Madsen, whom Huston would marry for a few years. Huston followed this up with the sexual drama Becoming Colette (1991), starring Klaus Maria Brandauer, and the horror film The Maddening (1995), starring Burt Reynolds. Neither film made a huge impact, and it was around this time, twenty years after his last acting role, that Huston returned to appearing in front of the camera. Starting modestly as a barman in the highly acclaimed Leaving Las Vegas (1995), Huston followed up with a supporting role in Anna Karenina (1997), alongside such would-be thespians as Sean Bean, Sophie Marceau, and Alfred Molina. The film was unfortunately a flop, as were Huston's next few film roles. In 2000, however, the tide finally turned, and Huston was able to break out as an established character actor. Re-uniting with his Anna Karenina director, Bernard Rose, Huston starred in the small-budget film Ivansxtc (2000), which was an adaptation of a book by Leo Tolstoy. While not a financial triumph, the film received very positive reactions from critics. The same fate awaited the film Hotel (2001), which included Huston in a diverse cast which included Lucy Liu, Rhys Ifans, Salma Hayek, and John Malkovich. It was also around this time that Huston met and married his second wife, Katie Jane Evans, though this marriage would end in great tragedy several years later. For now, though, Huston's career as an actor was just getting started. It was 21 Grams (2003) which secured Huston his first bona fide financial and critical success. Starring such names as Sean Penn and Benicio Del Toro, the film follows a non-linear storyline dealing with the lives of several people who are affected by an automobile accident. Huston followed up this success by appearing in John Sayle's Silver City (2004), the controversial feature film Birth (2004), and Martin Scorsese's wildly successful film about Howard Hughes known as Aviator (2004). Nominated for many awards, the film was also a success financially. But nothing Huston had done up to this point would equal to what he did next. John Hillcoat's Australian western The Proposition (2005) is a very dark film set mostly in a small community in the Australian Outback during the 19th century. A criminal is dispatched by the local law enforcement to hunt down his older brother, Arthur Burns, and kill him. As played by Huston, Burns is a psychopath who cares nothing for the various rapes and murders that he has committed. He does, however, find some chasm of his heart to enjoy music, poetry, and the glorious beauty of the Australian sunsets. This layered performance as the film's villain arguably ranks as Huston's greatest performance to date. That same year, Huston played in the highly acclaimed film The Constant Gardener (2005), which tackled corruption, love, and humanitarian efforts by the West in Africa. Huston moved from Oscar-winning film to Oscar-winning film the following year with the films Marie Antoinette (2006) and Children of Men (2006). In the former, Huston portrays the Holy Roman Emperor, Joseph II, as a cautious and thoughtful monarch who warns Marie Antoinette of her excessive lifestyle. He proves to be prophetic when the French mobs storm the Bastille and launch a revolution. In the latter film, set in a dystopian world of global human infertility, Huston portrays Nigel, a government official who uses his position to preserve famous artwork. Both films were highly successful, and further cemented Huston as a noted actor. Huston proceeded to play Orson Welles in the thriller Fade to Black (2006), and also acted in the financially successful war film The Kingdom (2007) and the poorly received The Number 23 (2007). From this point onward, Huston would appear in many films, portraying characters of various importance. Among the more noted examples would be the superhero film X-Men Origins: Wolverine (2009), where Huston played the villainous role of William Stryker, the man who imprisons Wolverine and is responsible for his experimentation with adamantium. Huston also portrayed the Greek god Poseidon in Clash of the Titans (2010), as well as its sequel two years later. Whether the crime film Edge of Darkness (2010), the historical epic Robin Hood (2010), the biographical Hitchcock (2012), or the comedy 2 Jacks (2012) (which was another adaptation of Leo Tolstoy's work, again directed by Bernard Rose and also starred Huston's nephew Jack Huston ), Huston has constantly showed his range of accents, characters, and genres. More recently, Huston has continued to appear in films, including the upcoming Tim Burton -directed biopic Big Eyes (2014) and \"Frankenstein\", which will once again reunite him with Bernard Rose. Huston has also moved into the world of television with such series as \"Magic City\" (which earned him a Golden Globe nomination), \"American Horror Story\", and \"Masters of Sex\". As busy and talented as he always has been through nearly four decades of work in the film industry, Danny Huston continues to work as one of Hollywood's veteran character actors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1MTk4NDA0NjZeQTJeQWpwZ15BbWU3MDQ5NzIzNTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0396812","name":"Danny Huston","idIMDB":"nm0396812"},"actorId":"nm0396812","character":"Jeff Green","urlCharacter":"http://www.imdb.com/character/ch0563887","main":true},{"actorName":"Michael Stahl-David","urlProfile":"http://www.imdb.com/name/nm1221863","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg4NTYyNzU1NF5BMl5BanBnXkFtZTcwMDI1MzM3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1982","placeOfBirth":" Chicago, Illinois, USA","height":"5' 10\" (1.78 m)","bio":"Michael Stahl-David was born on October 28, 1982 in Chicago, Illinois, USA. He is an actor and director, known for Cloverfield (2008), In Your Eyes (2014) and Le congrès (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg4NTYyNzU1NF5BMl5BanBnXkFtZTcwMDI1MzM3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1221863","name":"Michael Stahl-David","idIMDB":"nm1221863"},"actorId":"nm1221863","character":"Steve","urlCharacter":"http://www.imdb.com/character/ch0563891","main":true},{"actorName":"Paul Giamatti","urlProfile":"http://www.imdb.com/name/nm0316079","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc0MDAzMTU4N15BMl5BanBnXkFtZTcwNzA0NzcwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1967","placeOfBirth":" New Haven, Connecticut, USA","birthName":"Paul Edward Valentine Giamatti","height":"5' 9\" (1.75 m)","bio":"Paul Giamatti is an American actor who has worked steadily and prominently for over twenty years, and is best known for leading roles in the films American Splendor (2003), Sideways (2004), and Le monde de Barney (2010) (for which he won a Golden Globe), and supporting roles in the films Cinderella Man (2005), The Illusionist (2006), and San Andreas (2015). Paul Edward Valentine Giamatti was born June 6, 1967 in New Haven, Connecticut, and is the youngest of three children. His mother, the former Toni Marilyn Smith, was an actress before marrying. His father, Bart Giamatti (Angelo Bartlett Giamatti), was a professor of Renaissance Literature at Yale University, and went on to become the university's youngest president (in 1986, Bart was appointed president of baseball's National League. He became Commissioner of Baseball on April 1, 1989 and served for five months until his untimely death on September 1, 1989. He was commissioner at the time Pete Rose was banned from the game). Paul's father also wrote six books. Paul's older brother, Marcus Giamatti, is also an actor. His sister, Elena, designs jewelry. His ancestry is Italian (from his paternal grandfather), German, English, Dutch, Scottish, and Irish. Paul graduated from Choate Rosemary Hall prep school, majored in English at Yale, and obtained his Master's Degree in Fine Arts, with his major in drama from the Yale University School of Drama. His acting roots are in theatre, from his college days at Yale, to regional productions (Seattle, San Diego and Williamstown, Massachusetts), to Broadway.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc0MDAzMTU4N15BMl5BanBnXkFtZTcwNzA0NzcwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0316079","name":"Paul Giamatti","idIMDB":"nm0316079"},"actorId":"nm0316079","character":"Dr. Barker","urlCharacter":"http://www.imdb.com/character/ch0409249","main":true}],"seasons":[],"idIMDB":"tt1821641","urlIMDB":"http://www.imdb.com/title/tt1821641","business":{"budget":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"openingWeekend":null,"gross":[{"money":"$130,005","country":"USA","day":"28","month":"09","year":"2014","remarks":""}],"weekendGross":[{"money":"$3,175","country":"USA","day":"28","month":"09","year":"2014","remarks":"8 Screens"}],"admissions":[{"money":"1,743","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 2 min (122 min)"],"soundMix":["Dolby Atmos","Dolby Digital"],"color":["Color","Black and White"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":["35 mm","DCP"]},"rating":"6.5","metascore":"63","filmingLocations":[{"location":"Berlin, Germany"}],"awards":[{"award":"Antalya Golden Orange Film Festival 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Orange","categories":[{"category":"International Feature Film Competition","names":[{"name":"Ari Folman","id":"nm0284369","role":null}]}]}]},{"award":"Austin Fantastic Fest 2013","titlesAwards":[{"titleAwardOutcome":"Won Best Actress","categories":[{"category":"Fantastic Features","names":[{"name":"Robin Wright","id":"nm0000705","role":"actress"}]}]},{"titleAwardOutcome":"Won Best Picture","categories":[{"category":"Fantastic Features","names":[{"name":"Ari Folman","id":"nm0284369","role":"director"}]}]},{"titleAwardOutcome":"Won Best Screenplay","categories":[{"category":"Fantastic Features","names":[{"name":"Ari Folman","id":"nm0284369","role":"writer"}]}]}]},{"award":"Cannes Film Festival 2013","titlesAwards":[{"titleAwardOutcome":"Nominated SACD Prize (Directors' Fortnight)","categories":[{"category":"","names":[{"name":"Ari Folman","id":"nm0284369","role":null}]}]}]},{"award":"Chlotrudis Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Chlotrudis Award","categories":[{"category":"Best Actress","names":[{"name":"Robin Wright","id":"nm0000705","role":null}]},{"category":"Best Adapted Screenplay","names":[{"name":"Ari Folman","id":"nm0284369","role":null}]}]}]},{"award":"CinEuphoria Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won CinEuphoria","categories":[{"category":"Best Animated Film - International Competition","names":[{"name":"Ari Folman","id":"nm0284369","role":null}]}]}]},{"award":"Críticos de Cinema Online Portugueses Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won CCOP","categories":[{"category":"Best Animated Film (Melhor Filme de Animação)","names":[{"name":"Ari Folman","id":"nm0284369","role":null}]}]},{"titleAwardOutcome":"Nominated CCOP","categories":[{"category":"Best Adapted Screenplay (Melhor Argumento Adaptado)","names":[{"name":"Ari Folman","id":"nm0284369","role":null}]}]}]},{"award":"European Film Awards 2013","titlesAwards":[{"titleAwardOutcome":"Won European Film Award","categories":[{"category":"European Animated Feature Film","names":[{"name":"Ari Folman","id":"nm0284369","role":null}]}]}]},{"award":"International Cinephile Society Awards 2015","titlesAwards":[{"titleAwardOutcome":"2nd place ICS Award","categories":[{"category":"Best Animated Film","names":[]}]}]},{"award":"International Cinephile Society Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won ICS Award","categories":[{"category":"Best Picture Not Released in 2013","names":[]}]}]},{"award":"International Online Cinema Awards (INOCA) 2015","titlesAwards":[{"titleAwardOutcome":"2nd place INOCA","categories":[{"category":"Best Animated Feature","names":[]}]}]},{"award":"Italian Online Movie Awards (IOMA) 2015","titlesAwards":[{"titleAwardOutcome":"Nominated IOMA","categories":[{"category":"Best Animated Feature Film (Miglior film d'animazione)","names":[{"name":"Ari Folman","id":"nm0284369","role":null}]},{"category":"Best European Film (Miglior film europeo)","names":[{"name":"Ari Folman","id":"nm0284369","role":null}]}]}]},{"award":"Nashville Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Won Best Actress","categories":[{"category":"Graveyard Shift Competition","names":[{"name":"Robin Wright","id":"nm0000705","role":null}]}]}]},{"award":"Sitges - Catalonian International Film Festival 2013","titlesAwards":[{"titleAwardOutcome":"Won José Luis Guarner Critic's Award","categories":[{"category":"","names":[{"name":"Ari Folman","id":"nm0284369","role":null}]}]},{"titleAwardOutcome":"Nominated Maria","categories":[{"category":"Best Motion Picture","names":[{"name":"Ari Folman","id":"nm0284369","role":null}]}]}]},{"award":"Tokyo Anime Award 2014","titlesAwards":[{"titleAwardOutcome":"Won Open Entry - Competition","categories":[{"category":"Featured Film Category","names":[{"name":"Ari Folman","id":"nm0284369","role":null}]}]}]}],"votes":"13,644","type":"Movie","companyCreditsSimple":[{"idCompany":"co0232356","name":"Bridgit Folman Film Gang"},{"idCompany":"co0052813","name":"Pandora Filmproduktion"},{"idCompany":"co0054609","name":"Opus Film"}],"keywords":{"keywords":["satire","dystopia","cinema","actress","f rated","airstream trailer","dirigible","lobster","plane crash","animated nudity","animated sex scene","suspended animation","bull","execution","shot in the head","firing squad","b 52 stratofortress","cockroach","room service","some scenes animated","ampoule","porsche 911 carrera s cabrio","bar code license plate","flash forward","smiling","close up of mouth","reading lips","hearing loss","wright flyer scale model","reference to keanu reeves","body suit","laughing","german shepherd","guard dog","flying a kite","tear on cheek","airplane","airport","kite","disabled child","pill","hallucination","drug induced hallucination","drugs","doctor","congress","future","movie studio","actress playing herself","part animation","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:05:53"}}