{"data":{"movies":[{"title":"Black Panther","originalTitle":"","year":"2018","releaseDate":"20180216","directors":[{"name":"Ryan Coogler","id":"nm3363032"}],"writers":[{"name":"Joe Robert Cole","id":"nm1963288"},{"name":"Ryan Coogler","id":"nm3363032"}],"urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MzI5NDQ1MV5BMl5BanBnXkFtZTgwOTAxNTM2OTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Drama","Sci-Fi"],"plot":"T'Challa, the new ruler of the advanced kingdom of Wakanda, must defend his land from being torn apart by enemies from outside and inside the country.","simplePlot":"T'Challa, the new ruler of the advanced kingdom of Wakanda, must defend his land from being torn apart by enemies from outside and inside the country.","actors":[{"actorName":"Chadwick Boseman","urlProfile":"http://www.imdb.com/name/nm1569276","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NzE1MjUyOV5BMl5BanBnXkFtZTcwMzI0MTE1Mw@@._V1_UY44_CR19,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1976","placeOfBirth":" Anderson, South Carolina, USA","height":"6' (1.83 m)","bio":"Chadwick Boseman was born on November 29, 1976 in Anderson, South Carolina, USA. He is an actor and producer, known for Captain America: Civil War (2016), 42 (2013) and Get on Up (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NzE1MjUyOV5BMl5BanBnXkFtZTcwMzI0MTE1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1569276","name":"Chadwick Boseman","nicknames":["Chad"],"idIMDB":"nm1569276"},"actorId":"nm1569276","character":"T'Challa / Black Panther","urlCharacter":"http://www.imdb.com/character/ch0236126","main":true},{"actorName":"Michael B. Jordan","urlProfile":"http://www.imdb.com/name/nm0430107","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1ODAxMDk5Nl5BMl5BanBnXkFtZTgwOTE0MDgxODE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1987","placeOfBirth":" Santa Ana, California, USA","birthName":"Michael Bakari Jordan","height":"5' 11½\" (1.82 m)","bio":"Michael B. Jordan, middle of three children, was born in Santa Ana, California and raised in Newark, New Jersey by Donna (Davis), and Michael A. Jordan. His middle name Bakari means \"noble promise\" in Swahili. Jordan has starred in three of the most critically acclaimed television dramas of the past decade. First, Michael played the hard-shelled but softhearted Wallace in HBO's dramatic hit series The Wire (2002). He then went on to star as quarterback Vince Howard on Friday Night Lights (2006) (NBC), before playing a recovered alcoholic, Alex on NBC's Parenthood (2010). Michael successfully took on his first major leading film role when he starred as Oscar Grant in Fruitvale Station (2013). The film is an account of Oscar's controversial slaying by police officers on a San Francisco train platform. The cast includes Octavia Spencer and Melonie Diaz, and was produced by Forest Whitaker (Significant Films). It premiered at the 2013 Sundance Film Festival where it received the Grand Jury Prize and Audience Award for U.S. Dramatic Film. It also screened at the 2013 Cannes Film Festival in the Un Certain Regard category. The has garnered many awards including Best First Feature at the 2014 Independent Spirit Awards, Outstanding Independent Motion Picture at the 2014 NAACP Image Awards and the 2014 Stanley Kramer Award from the Producer's Guild of America. The 2013 New York Film Critics Circle honoured it with Best First Film and the picture was also chosen as one of the Top Ten Films at the 2013 National Board of Review Awards, where Michael took home the award for Breakthrough Actor. Michael also won the 2013 Gotham Award for Breakthrough Actor and was nominated for an Independent Spirit Award for Best Lead Actor. In 2015, Michael starred in Josh Trank's Fantastic Four (2015), playing the role of 'Johnny Storm' aka 'The Human Torch', opposite Miles Teller, Jamie Bell, and Kate Mara for 20th Century Fox. The film was released on August 7th 2015. Michael previously starred in 20th Century Fox's box office hit Chronicle (2012) (which was also directed by Trank), a supernatural thriller that follows three Portland teens (MBJ, Dane Dehaan, and Alex Russell) as they develop incredible powers after exposure to a mysterious substance; That Awkward Moment (2015) opposite Zac Efron and Miles Teller for Focus Films; and the George Lucas produced film Red Tails (2012), the story of the first African American pilots to fly in a combat squadron during WWII aka The Tuskegee Airmen. MBJ reunited with Ryan Coogler for Creed (2015), starring alongside Sylvester Stallone and Tessa Thompson. The film was released on Thanksgiving 2015 by MGM and Warner Brothers. He resides in Los Angeles, where he enjoys supporting the charity Lupus LA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1ODAxMDk5Nl5BMl5BanBnXkFtZTgwOTE0MDgxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0430107","name":"Michael B. Jordan","idIMDB":"nm0430107"},"actorId":"nm0430107","character":"Erik Killmonger","urlCharacter":"http://www.imdb.com/character/ch0545202","main":true},{"actorName":"Lupita Nyong'o","urlProfile":"http://www.imdb.com/name/nm2143282","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTQ4MDY2Nl5BMl5BanBnXkFtZTgwNDk1MTEyMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 March 1983","placeOfBirth":" Mexico City, Distrito Federal, Mexico","birthName":"Lupita Amondi Nyong'o","height":"5' 5\" (1.65 m)","bio":"Lupita Amondi Nyong'o was born March 1, 1983 in Mexico City, Mexico, to Kenyan parents, Dorothy and Peter Anyang' Nyong'o. Her father, a senator, was then a visiting lecturer in political science. She was raised in Kenya. At age 16, her parents sent her back to Mexico for seven months to learn Spanish. She read film studies at Hampshire College, Massachusetts and, after working as a production assistant on several films, graduated from the Yale School of Drama's acting program. In 2013, she impressed cinema audiences in her film debut, as brutalized slave Patsey in acclaimed director Steve McQueen's 12 Years a Slave (2013). She was also the lead in MTV's award-winning drama series, Shuga (2009), appeared in the thriller Non-Stop (2014), and will have roles in the big-budget films Star Wars: The Force Awakens (2015) and The Jungle Book (2016). Lupita's stage credits include playing \"Perdita\" in \"The Winter's Tale\", (Yale Repertory Theater), \"Sonya\" in \"Uncle Vanya\", \"Katherine\" in \"The Taming of the Shrew\", as well as being in the original production of Michael Mitnick's \"Elijah\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTQ4MDY2Nl5BMl5BanBnXkFtZTgwNDk1MTEyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2143282","name":"Lupita Nyong'o","idIMDB":"nm2143282"},"actorId":"nm2143282","character":"Nakia","urlCharacter":"http://www.imdb.com/character/ch0545142","main":true},{"actorName":"Danai Gurira","urlProfile":"http://www.imdb.com/name/nm1775091","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NjIyNTc4N15BMl5BanBnXkFtZTgwNzI5NzIyNjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1978","placeOfBirth":" Grinnell, Iowa, USA","height":"5' 7\" (1.7 m)","bio":"Danai Gurira was born in Grinnell, Iowa to parents from Zimbabwe, when her father was teaching Chemistry at Grinnell College. When she was 5, the family moved back to Zimbabwe. Gurira studied social psychology at Macalaster College, and received an MFA from New York University's Tisch School of the Arts. She is the co-author of the play, \"In the Continuum\", with Nikkole Salter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NjIyNTc4N15BMl5BanBnXkFtZTgwNzI5NzIyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1775091","name":"Danai Gurira","idIMDB":"nm1775091"},"actorId":"nm1775091","character":"Okoye","urlCharacter":"http://www.imdb.com/character/ch0545203","main":true},{"actorName":"Martin Freeman","urlProfile":"http://www.imdb.com/name/nm0293509","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MjAwOTMzMF5BMl5BanBnXkFtZTcwMDg1MjEyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 September 1971","placeOfBirth":" Aldershot, Hampshire, England, UK","birthName":"Martin John Christopher Freeman","height":"5' 6½\" (1.69 m)","bio":"Martin Freeman is an English actor, best known for portraying Bilbo Baggins in Peter Jackson's The Hobbit film trilogy, Tim Canterbury in the original UK version of sitcom mockumentary The Office (2001), Dr. John Watson in the British crime drama Sherlock (2010) and Lester Nygaard in the dark comedy-crime drama TV series Fargo (2014). His other notable film roles include the romantic comedy Love Actually (2003) and the comic science fiction film The Hitchhiker's Guide to the Galaxy (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MjAwOTMzMF5BMl5BanBnXkFtZTcwMDg1MjEyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0293509","name":"Martin Freeman","idIMDB":"nm0293509"},"actorId":"nm0293509","character":"Everett K. Ross","urlCharacter":"http://www.imdb.com/character/ch0532593","main":true},{"actorName":"Daniel Kaluuya","urlProfile":"http://www.imdb.com/name/nm2257207","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk1MzgzOTg5OV5BMl5BanBnXkFtZTcwNDQ4NjMxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1989","placeOfBirth":" London, England, UK","bio":"Daniel Kaluuya was born in 1989 in London, England. He is an actor and writer, known for Sicario (2015), Get Out (2017) and Johnny English Reborn (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk1MzgzOTg5OV5BMl5BanBnXkFtZTcwNDQ4NjMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2257207","name":"Daniel Kaluuya","idIMDB":"nm2257207"},"actorId":"nm2257207","character":"W'Kabi","urlCharacter":"http://www.imdb.com/character/ch0564231","main":true},{"actorName":"Angela Bassett","urlProfile":"http://www.imdb.com/name/nm0000291","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4OTQ1NTcxOF5BMl5BanBnXkFtZTcwOTc1NTU0OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1958","placeOfBirth":" New York City, New York, USA","birthName":"Angela Evelyn Bassett","height":"5' 4\" (1.63 m)","bio":"Captivating, gifted, and sensational, Angela Bassett's presence has been felt in theaters, stages, and television screens throughout the world. Angela Evelyn Bassett was born on August 16, 1958 in New York City, to Betty Jane (Gilbert), a social worker, and Daniel Benjamin Bassett, a preacher's son. Bassett and her sister D'nette grew up in St. Petersburg, Florida with their mother. As a single mother, Betty stressed the importance of education for her children. With the assistance of an academic scholarship, Bassett matriculated into Yale University. In 1980, she received her B.A. in African-American studies from Yale University. In 1983, she earned a Master of Fine Arts Degree from the Yale School of Drama. It was at Yale that Bassett met her husband, Courtney B. Vance, a 1986 graduate of the Drama School. Bassett first appeared in small roles on The Cosby Show (1984) and Spenser: For Hire (1985), but it was not until 1990 that a spate of television roles brought her notice. Her breakthrough role, though, was playing Tina Turner, whom she had never seen perform before taking the role, in What's Love Got to Do with It (1993). Bassett's performance earned her an Academy Award nomination and a Golded Globe Award for Best Actress.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4OTQ1NTcxOF5BMl5BanBnXkFtZTcwOTc1NTU0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000291","name":"Angela Bassett","idIMDB":"nm0000291"},"actorId":"nm0000291","character":"Ramonda","urlCharacter":"http://www.imdb.com/character/ch0554171","main":true},{"actorName":"Forest Whitaker","urlProfile":"http://www.imdb.com/name/nm0001845","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMDI3NTg2OV5BMl5BanBnXkFtZTcwNTgwMzg5Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1961","placeOfBirth":" Longview, Texas, USA","birthName":"Forest Steven Whitaker","height":"6' 2\" (1.88 m)","bio":"Forest Steven Whitaker has packaged a king-size talent into his hulking 6' 2\", 220 lb. frame. He won an Academy Award for his performance as Ugandan dictator Idi Amin in the 2006 film The Last King of Scotland (2006), and has also won a Golden Globe and a BAFTA. He is the fourth African-American male to win an Academy Award for Best Actor, following in the footsteps of Sidney Poitier, Denzel Washington, and Jamie Foxx. Whitaker was born on July 15, 1961 in Longview, Texas, to Laura Francis (Smith), a special education teacher, and Forest Steven Whitaker, an insurance salesman. His family moved to South Central Los Angeles in 1965. The athletically-inclined Whitaker initially found his way into college via a football scholarship. Later, however, he transferred to USC where he set his concentration on music and earned two more scholarships training as an operatic tenor. This, in turn, led to another scholarship at Berkeley with a renewed focus on acting and the performing stage. Whitaker made his film debut at the age of 21 in the raucous comedy Fast Times at Ridgemont High (1982) wherein he played, quite naturally, a footballer. He went on to play another sports-oriented student, a wrestler, in his second film Vision Quest (1985). He gained experience on TV as well with featured spots on such varied shows as Diff'rent Strokes (1978) and Cagney & Lacey (1981), not to mention the TV-movie Civil War epic North and South (1985) and its sequel. The movie that truly put him on the map was The Color of Money (1986). His one big scene as a naive-looking pool player who out-hustles Paul Newman's Fast Eddie Felson was pure electricity. This led to more visible roles in the \"A\" class films Platoon (1986), Stakeout (1987), and Good Morning, Vietnam (1987), which culminated in his breakout lead portrayal of the tortured jazz icon 'Charlie \"Bird\" Parker' in Clint Eastwood's passion project Bird (1988), for which Whitaker won the Cannes Film Festival award for \"best actor\" and a Golden Globe nomination. Whitaker continued to work with a number of well-known directors throughout the 1990s. While his \"gentle giant\" characters typically display innocence, indecision, and timidity along with a strong underlying humanity, he has certainly not shied away from the edgier, darker corners of life as his occasional hitmen and other menacing streetwise types can attest. Although in only the first section of the film, he was memorable as the IRA-captured British soldier whose bizarre relationship with a mysterious femme fatale serves as the catalyst for the critically-lauded drama The Crying Game (1992). Always a willing participant to push the envelope, he's gone on to enhance a number of lesser films. Among those was his plastic surgeon in Johnny Handsome (1989), gay clothing designer in Robert Altman's Ready to Wear (1994), alien hunter in Species (1995), absentee father confronted by his estranged son in Smoke (1995), and Mafia hitman who models himself after the samurai warrior in Ghost Dog, la voie du samouraï (1999), among many others. As would be expected, he's also had his share of epic-sized bombs, notoriously the L. Ron Hubbard sci-fi disaster Battlefield Earth (2000). On the TV front, he was the consulting producer and host of a revamped Rod Serling's cult series classic La treizième dimension (2002), which lasted a disappointing one season. In the early 1990s, Whitaker widened his horizons to include producing/directing and has since gained respect behind the camera as well. He started things off co-producing the violent gangster film A Rage in Harlem (1991), in which he co-starred with Gregory Hines and Robin Givens, and then made his successful directorial debut with the soulful Waiting to Exhale (1995), showcasing a legion of distaff black stars. He also directed co-star Whitney Houston's music video of the movie's theme song (\"Shoop Shoop\"). He also helmed the fluffy romantic comedy First Daughter (2004) with Katie Holmes and Michael Keaton. Whitaker also served as an executive producer on First Daughter. He had previously executive produced several made-for-television movies, most notably the 2002 Emmy-award winning Door to Door, starring William H. Macy. He produced these projects through his production company, Spirit Dance Entertainment, which he shut down in 2005 to concentrate on his acting career. In 2002, he co-starred in Joel Schumacher's thriller, Phone Booth, with Kiefer Sutherland and Colin Farrell. That year, he also co-starred with Jodie Foster in Panic Room. Whitaker's greatest success to date is the 2006 film, The Last King of Scotland. His performance earned him the 2007 Academy Award for Best Actor in a Leading Role, For that same role, he also received the Golden Globe Award, the Screen Actors Guild Award, a BAFTA Award, and many critical accolades. He has also received several other honors. In September 2006, the 10th Annual Hollywood Film Festival presented him with its \"Hollywood Actor of the Year Award,\" He was also honored at the Santa Barbara International Film Festival 2007, receiving the American Riviera Award. Previously, in 2005, the Deauville Festival of American Film paid tribute to him. In 2007, Forest Whitaker won the Cinema for Peace Award 2007. In 2007, Whitaker co-starred in The Great Debaters with fellow Oscar winner Denzel Washington, and in 2008, Whitaker played opposite Keanu Reeves in Street Kings and Dennis Quaid in Vantage Point. In 2009, Forest co-starred in the Warner Bros. film \"Where the Wild Things Are,\" directed by Spike Jonze, which was a mix of live-action, animation and puppetry as an adaptation of the Maurice Sendak classic children's book. Around the same time, he also starred in \"Repossession Mambo\", with Jude Law, \"Hurricane Season\", \"Winged Creatures\", and \"Powder Blue\". He appeared in the Olivier Dahan film \"My Own Love Song\", opposite Renée Zellweger, and was part of the Africa Movie Academy Awards in 2009, in Nigeria. He is married to former model Keisha Whitaker and has three children by her. His younger brothers Kenn Whitaker and Damon Whitaker are both actors as well. Forest was given a star on the Hollywood Walk in April of 2007. In November 2007, Whitaker was the creative mind behind DEWmocracy.com, a website that let people decide the next flavor of Mountain Dew in a \"People's Dew\" poll. He directed a short film and created the characters for the video game. Whitaker has done extensive humanitarian work, he has been involved with organizations like, Penny Lane, an organization that provides assistance to abused teenagers. PETA and Farm Sanctuary, organizations that protect animals' rights. Close friends with Neurosurgeon Dr. Keith Black, Forest has helped raise awareness and funds for Dr. Blacks research. During the last couple of years, he has become a spokesperson for Hope North Ugandan orphanage and Human Rights Watch. In the year 2001 Forest received a Humanitas Prize. He was recently honored by The City of Los Angeles with the Hope of Los Angeles Award. And his entire clan received the LA BEST Family Focus Award. Last year he joined forces with \"Idol Gives Back\" and \"Malaria No More\"; he has become a GQ Ambassador supporting and fundraising for Hope North. He was a Surrogate for Barrack Obama's campaign supporting him across the United States. Whitaker's multimedia company, Spirit Dance Entertainment, includes film, television and music production. He works closely with a number of charitable organizations, giving back to his community by serving as an Honorary Board Members for Penny Lane, an organization that provides assistance to abused teenagers, the Human Rights Watch and The Hope North organization.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMDI3NTg2OV5BMl5BanBnXkFtZTcwNTgwMzg5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001845","name":"Forest Whitaker","idIMDB":"nm0001845"},"actorId":"nm0001845","character":"Zuri","urlCharacter":"http://www.imdb.com/character/ch0554019","main":true},{"actorName":"Andy Serkis","urlProfile":"http://www.imdb.com/name/nm0785227","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNzI2OTA3Nl5BMl5BanBnXkFtZTYwNDIwNzA1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1964","placeOfBirth":" Ruislip, London, England, UK","birthName":"Andrew Clement G. Serkis","height":"5' 8\" (1.73 m)","bio":"Andrew Clement G. Serkis was born April 20, 1964, in Ruislip Manor, West London, England. He has three sisters and a brother. His father, Clement Serkis, an ethnic Armenian whose original family surname was \"Serkissian\", was a Medical Doctor working abroad, in Iraq; the Serkis family spent a lot of time traveling around the Middle East. For the first ten years of his life, Andy Serkis used to go backwards and forwards between Baghdad and London. His mother, Lylie (Weech), who is British-born, was busy working as a special education teacher of handicapped children, so Andy and his four siblings were raised with au pairs in the house. Young Andy Serkis wanted to be an artist; he was fond of painting and drawing, and visualized himself working behind the scenes in productions. He attended St. Benedict's School, a Roman Catholic School for boys at the Benedictine Abbey in London. Serkis studied visual arts at Lancaster University in the north-west of England. There, he became involved in mechanical aspects of the theatre and did stage design and set building for theatrical productions. Then, Serkis was asked to play a role in a student production, and made his stage debut in Barrie Keeffe's play, \"Gotcha\"; thereafter, he switched from stage design to acting, which was a real calling that transformed his life. Instead of going to an acting college, Serkis, in 1985, began his professional acting career at the Duke's Playhouse in Lancaster, where he was given an Equity card and performed in fourteen plays, one after another, as an apprentice of Jonathan Petherbridge. After that, he worked in touring theatre companies, doing it for no money, fueled by a sense of enthusiasm, moving to a new town every week. He has thus appeared in a host of popular plays and on almost every renowned British stage. In 1989, he appeared in a stage production of William Shakespeare's \"Macbeth\", so beginning his long association with the Royal Exchange Theatre, Manchester, where he would return many times, to appear in \"She Stoops to Conquer\", \"Your Home in the West\" and the \"True Nature of Love\", among other plays. In the 1990s, Serkis began to make his mark on the London stage, appearing at the Royal Court Theatre as \"The Fool\" in \"King Lear\", making his interpretation of \"The Fool\" as the woman that \"Lear\", a widower, could relate to - a man, in drag, as a Victorian musician. He also appeared as \"Potts\" in the hit play, \"Mojo\", playing in front of full houses and earning huge critical success. In 1987, Serkis made his debut on television, and he acted in several major British TV miniseries throughout the 1990s. In 1999, Andy Serkis landed the prize role of \"Gollum\" in Peter Jackson's epic film trilogy based on J.R.R. Tolkien's saga, \"The Lord of the Rings\". He spent four years in the part and received awards and nominations for his performance as \"Gollum\", a computer-generated character in The Lord of the Rings: The Return of the King (2003), which won 11 Oscars. \"Gollum\" was the collaborative team's effort around Serkis's work in performance capture - an art form based on CGI-assisted acting. Serkis's work was an interactive performance in a skin-tight CGI suit with markers allowing cameras to track and register 3D position for each marker. Serkis' every nuance was picked up by several cameras positioned at precisely calculated angles to allow for the software to see enough information to process the image. The images of Serkis' performances were translated into the digital format by animators at Weta Digital studio in New Zealand. There, his image was key-frame animated and then edited into the movie, Serkis did have one scene in \"The Return of the King\" showing how he originally had the ring, killing another hobbit to posses it after they found it during a fishing trip. He drew from his three cats clearing fur balls out of their throats to develop the constricted voice he produced for \"Gollum\" and \"Sméagol\", and it was also enhanced by sound editing in post-production. Serkis spent almost two years in New Zealand and away from his family, and much of 2002 and 2003 in post-production studios for large periods of time, due to complexity of the creative process of bringing the character of \"Gollum\" to the screen. Serkis had to shoot two versions for every scene; one version was with him on camera, acting with (chiefly) Elijah Wood and Sean Astin, which served both to show Wood and Astin the moves so that they could precisely interact with the movements of \"Gollum\", and to provide the CGI artists the subtleties of Gollum's physical movements and facial expressions for their manual finishing of the animated images. In the other version, he'd do the voice off-camera, as Wood and Astin repeated their movements as though \"Gollum\" were there with them; that take would be the basis for inserting the CGI Gollum used in the released movie. In post-production, Serkis was doing motion-capture wearing a skintight motion capture suit with CGI gear while acting as a virtual puppeteer redoing every single scene in the studio. Additional CGI rotomation was done by animators using the human eye instead of the computer to capture the subtleties of Serkis' performance. Serkis also used this art form in his performance as \"Kong\" in King Kong (2005), which won him a Toronto Film Critics Association Award (2005) for his unprecedented work helping to realize the main character in \"King Kong\", and a Visual Effects Society Award (2006) for Outstanding Animated Character in a Live Action Motion Picture. Apart from his line of CGI-driven characters, Serkis continued with traditional acting in several leading and supporting roles, such as his appearances as \"Richard Kneeland\" opposite Jennifer Garner in 13 Going on 30 (2004), and \"Alley\" opposite David Bowie in The Prestige (2006), among other film performances. On television, he starred as 'Vincent Van Gogh' in the sixth episode of Simon Schama's Power of Art (2006), the BBC2 series about artists. Serkis is billed as \"Capricorn\" in the upcoming adventure film, Coeur d'encre (2008). At the same time, he continued the development of performance capture while expanding his career into computer games. He starred as \"King Bothan\" in the martial arts drama, Heavenly Sword (2007), a Playstation 3 title, for which he provided a basis for his in-game face and also acts as a dramatic director on the project. Andy Serkis married actress and singer Lorraine Ashbourne, and the couple have three children: daughter Ruby Serkis (born in 1998), and two sons Sonny Serkis (born in 2000) and Louis George Serkis (born on 19 June 2004). Away from acting, Andy Serkis is an accomplished amateur painter. Since his school years at Lancaster, being so close to the Lake District, Serkis developed his other passion in life: mountaineering. He is pescetarian. Serkis has been active in charitable causes, such as The Hope Foundation, which provides essential life-saving medical aid for children suffering from Leukemia and children from countries devastated by war. In October 2006, he was a presenter at the first annual British Academy Video Games Awards at the Roundhouse, London. Andy Serkis lives with his family in North London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNzI2OTA3Nl5BMl5BanBnXkFtZTYwNDIwNzA1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0785227","name":"Andy Serkis","nicknames":["Gollum"],"idIMDB":"nm0785227"},"actorId":"nm0785227","character":"Ulysses Klaue / Klaw","urlCharacter":"http://www.imdb.com/character/ch0036517","main":true},{"actorName":"Florence Kasumba","urlProfile":"http://www.imdb.com/name/nm0441042","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NDM3ODkyNV5BMl5BanBnXkFtZTgwODg0NDM1NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1976","placeOfBirth":" Kampala, Uganda","height":"5' 8\" (1.73 m)","bio":"Florence Kasumba is a German actress living in Berlin. She has been filming in English, German and Dutch since 2000. She is known for: Ik ook van Jou (2001), Kongo (2009), Tatort- Der illegale Tod (2011), Transpapa (2012), Das Vermächtnis der Wanderhure (2013), The Quest (2014), Dominion (2015), Tatort- Im gelobten Land (2016), The First Avenger: Civil War (2016), Emerald City (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NDM3ODkyNV5BMl5BanBnXkFtZTgwODg0NDM1NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0441042","name":"Florence Kasumba","idIMDB":"nm0441042"},"actorId":"nm0441042","character":"Ayo","urlCharacter":"http://www.imdb.com/character/ch0550778","main":true},{"actorName":"John Kani","urlProfile":"http://www.imdb.com/name/nm0434712","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMzcxMDI1MF5BMl5BanBnXkFtZTcwMjU1NDExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1942","placeOfBirth":" New Brighton, South Africa","birthName":"Bonsile John Kani","bio":"John Kani was born on November 30, 1942 in New Brighton, South Africa as Bonsile John Kani. He is an actor and writer, known for Captain America: Civil War (2016), L'ombre et la proie (1996) and Final Solution (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMzcxMDI1MF5BMl5BanBnXkFtZTcwMjU1NDExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0434712","name":"John Kani","idIMDB":"nm0434712"},"actorId":"nm0434712","character":"King T'Chaka","urlCharacter":"http://www.imdb.com/character/ch0036496","main":true},{"actorName":"Winston Duke","urlProfile":"http://www.imdb.com/name/nm6328300","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNzQ0OTQ1M15BMl5BanBnXkFtZTgwMjAzMTUzMTE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"height":"6' 4½\" (1.94 m)","bio":"Winston Duke is an actor, known for Person of Interest (2011) and Law & Order: Special Victims Unit (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNzQ0OTQ1M15BMl5BanBnXkFtZTgwMjAzMTUzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm6328300","name":"Winston Duke","idIMDB":"nm6328300"},"actorId":"nm6328300","character":"M'Baku / Man-Ape","urlCharacter":"http://www.imdb.com/character/ch0236247","main":true},{"actorName":"Sterling K. Brown","urlProfile":"http://www.imdb.com/name/nm1250791","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmEzNmExM2ItNzg5Zi00NGRjLWI1NTEtMmQ5MGMwNjFlNWFhL2ltYWdlXkEyXkFqcGdeQXVyMTM0MzI5Nzc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Emmy Award winning actor Sterling K. Brown currently stars in NBC's dramedy series THIS IS US. Earlier this year, Brown portrayed prosecutor Christopher Darden in FX's highly-rated award-winning television event series THE PEOPLE V. O.J. SIMPSON: AMERICAN CRIME STORY. He also co-starred alongside Tiny Fey in the feature film WHISKEY TANGO FOXTROT. He recently wrapped production on Open Road's feature film MARSHALL alongside Chadwick Boseman, Josh Gad and Kate Hudson. A lover of theater, Brown has performed in a variety of staged shows, including NY and LA productions of FATHER COMES HOME FROM THE WARS (PARTS 1, 2 & 3), for which he has been nominated for an Ovation Award. His additional stage credits include MACBETH, THE BROTHER/SISTER PLAYS and THE RESISTABLE RISE OF ARTURO UI opposite Al Pacino. For seven years, Brown portrayed Dr. Roland Burton in the critically acclaimed Lifetime series ARMY WIVES. Additional television credits include SUPERNATURAL, PERSON OF INTEREST, MASTERS OF SEX, THE MENTALIST, CASTLE and CRIMINAL MINDS. His film credits include OUR IDIOT BROTHER, THE SUSPECT, RIGHTEOUS KILL, TRUST THE MAN and SPACEMAN. Brown graduated with a Bachelor of Arts in Drama from Stanford University, before receiving his Master's Degree in Fine Arts from NYU's Tisch School of the Arts. He currently resides in Los Angeles with his wife and two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmEzNmExM2ItNzg5Zi00NGRjLWI1NTEtMmQ5MGMwNjFlNWFhL2ltYWdlXkEyXkFqcGdeQXVyMTM0MzI5Nzc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1250791","name":"Sterling K. Brown","idIMDB":"nm1250791"},"actorId":"nm1250791","character":"N'Jobu","urlCharacter":"http://www.imdb.com/character/ch0559277","main":true},{"actorName":"Letitia Wright","urlProfile":"http://www.imdb.com/name/nm4004793","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMzgxMzc5N15BMl5BanBnXkFtZTgwNDg3NzYzMDI@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1993","placeOfBirth":" Georgetown, Guyana","birthName":"Letitia Michelle Wright","bio":"Letitia Wright was born on October 31, 1993 in Georgetown, Guyana as Letitia Michelle Wright. She is an actress, known for Glasgow Girls (2014), Urban Hymn (2015) and My Brother the Devil (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMzgxMzc5N15BMl5BanBnXkFtZTgwNDg3NzYzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4004793","name":"Letitia Wright","idIMDB":"nm4004793"},"actorId":"nm4004793","character":"Shuri","urlCharacter":"http://www.imdb.com/character/ch0177069","main":true},{"actorName":"Phylicia Rashad","urlProfile":"http://www.imdb.com/name/nm0711118","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMzcxNzYyN15BMl5BanBnXkFtZTcwMTAyMDQ2NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1948","placeOfBirth":" Houston, Texas, USA","birthName":"Phylicia Ayers-Allen","height":"5' 6\" (1.68 m)","bio":"Phylicia Rashad was born in Houston, Texas, to African-American parents, Vivian Elizabeth (Ayers), a poet and art director, and Andrew Arthur Allen, an orthodontist. As a child, Phylicia, her older brother Andrew (called Tex), and younger sister, dancer and actress Debbie Allen, lived in Mexico. She has another brother, Hugh Allen (a real estate banker in North Carolina). Their mother decided to live in Mexico to give the Allen children a brief experience of not having to endure the chronic racism and segregation that was typical of Texas during the 1950s. Phylicia and Debbie are fluent in Spanish. Phylicia graduated from Howard University and later taught drama there. With younger sister Debbie Allen, she has a production company, D.A.D., which stood for Doctor Allen's Daughters. Her Pulitzer-nominated mother is the artistic and free spirit that has influenced and encouraged the remarkable creativity that so marks Rashad as a performer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMzcxNzYyN15BMl5BanBnXkFtZTcwMTAyMDQ2NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0711118","name":"Phylicia Rashad","idIMDB":"nm0711118"},"actorId":"nm0711118","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1825683","urlIMDB":"http://www.imdb.com/title/tt1825683","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"15","month":"01","year":"2017","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":null,"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"filmingLocations":[{"location":"Pinewood Atlanta Studios, 461 Sandy Creek Road, Fayetteville, Georgia, USA"}],"awards":[],"type":"Movie","companyCreditsSimple":[{"idCompany":"co0051941","name":"Marvel Studios"},{"idCompany":"co0008970","name":"Walt Disney Pictures"}],"keywords":{"keywords":["martial arts","africa","marvel cinematic universe","superhero","based on comic","marvel comics","based on comic book"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:16:35"}}