{"data":{"movies":[{"title":"The Employer","originalTitle":"","year":"2013","releaseDate":"20130607","directors":[{"name":"Frank Merle","id":"nm3106201"}],"writers":[{"name":"Frank Merle","id":"nm3106201"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MzU0NjE0MF5BMl5BanBnXkFtZTcwNzY2Mjc0OQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Thriller"],"plot":"Five highly qualified applicants interview for a coveted job with the Carcharias Corporation, a powerful conglomerate whose business practices are shrouded in mystery. On the night before the last round of interviews, they are all kidnapped and drugged. The next day, they wake up trapped together in a locked room without any hope of escape. Soon the true nature of their situation is revealed when they receive a phone call from the mysterious CEO of Carcharias, known only as The Employer. He informs them that they are about to experience the final interview, but it's not at all what they were expecting.","simplePlot":"Five highly qualified applicants interview for a coveted job. On the night before the last round of interviews, they are all kidnapped and drugged. The next day, they wake up trapped together in a locked room without any hope of escape.","actors":[{"actorName":"Malcolm McDowell","urlProfile":"http://www.imdb.com/name/nm0000532","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjQxNzczM15BMl5BanBnXkFtZTcwMTg3MTMwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1943","placeOfBirth":" Horsforth, Yorkshire, England, UK","birthName":"Malcolm John Taylor","height":"5' 8½\" (1.74 m)","bio":"Malcolm John Taylor was born on June 13, 1943 in Leeds, England, to working-class parents Edna (McDowell), a hotelier, and Charles Taylor, a publican. His father was an alcoholic. Malcolm hated his parents' ways. His father was keen to send his son to private school to give him a good start in life, so Malcolm was packed off to boarding school at age 11. He attended the Tunbridge Boarding School and the Cannock House School in Eltham, Kent. At school, he was beaten with the slipper or cane every Monday for his wayward behavior. Whilst at school, he decided that he wanted to become an actor; it was also around this time that his love for race cars began. He attended the London Academy of Music and Dramatic Arts (LAMDA) to study acting. Meanwhile, he worked at his parents' pub but lost his job when the pub went bankrupt, his father drinking all the profits. He then had a variety of jobs, from coffee salesman to messenger. His first big-screen role was in Poor Cow (1967), although his two-minute scene was ultimately cut from the completed film. Soon after, he caught the attention of director Lindsay Anderson who cast him in the role of a rebellious student in his film If.... (1968). The film catapulted Malcolm to stardom in Britain but failed everywhere else. He was so enthusiastic about the film's success that he wanted to do another right away. He began writing what would become the semi-autobiographical O Lucky Man! (1973). Meanwhile, he starred as the infamous Alex DeLarge in Stanley Kubrick's controversial A Clockwork Orange (1971), a role that caused him to be typecast as a manic psychopathic villain. In early 1976, he spent nearly a year working on what would later be one of the most infamous films of all time, the semi-pornographic Caligula (1979), financed by Penthouse magazine founder Bob Guccione. Around that time, the British film industry collapsed, forcing him to flee to America to continue working. His first American film was Time After Time (1979). He then did Britannia Hospital (1982), the last part of Lindsay Anderson's working-class trilogy that started with If.... (1968). In the mid-1980s, the years of alcohol and drug abuse, including $1000 a week on cocaine, caught up with him. Years of abuse took its toll on him; his black hairs were now grey. Looking older than he really was, nobody wanted to cast him for playing younger roles. The big roles having dried up, he did many B-rated movies. The 1990s were kinder to him, though. In 1994, he was cast as Dr. Tolian Soran, the man who killed Captain James T. Kirk in Star Trek: Generations (1994). He was back on the track, playing villains again. He played another in the classic BBC miniseries Our Friends in the North (1996). Today, with more than 100 films under his belt, he is one of the greatest actors in America. He still does not have American citizenship, but he likes the no-nonsense American ways. He resides in the northern suburbs of Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjQxNzczM15BMl5BanBnXkFtZTcwMTg3MTMwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000532","name":"Malcolm McDowell","nicknames":["Mick"],"idIMDB":"nm0000532"},"actorId":"nm0000532","character":"The Employer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Dastmalchian","urlProfile":"http://www.imdb.com/name/nm2810287","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3Mjc0NzgyN15BMl5BanBnXkFtZTcwOTU3MTE3Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 July 1977","placeOfBirth":" Kansas, USA","height":"6' 0½\" (1.84 m)","bio":"David Dastmalchian is originally from Kansas. He moved to Chicago, IL, to study acting at The Theatre School, DePaul University. After college, David worked as a professional fisherman in Alaska, a circus performer, movie theatre usher and playwright. He is an ensemble member of Shattered Globe Theatre Company and Caffeine Theatre in Chicago.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3Mjc0NzgyN15BMl5BanBnXkFtZTcwOTU3MTE3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2810287","name":"David Dastmalchian","idIMDB":"nm2810287"},"actorId":"nm2810287","character":"James Harris","urlCharacter":"http://www.imdb.com/character/ch0415920","main":true},{"actorName":"Paige Howard","urlProfile":"http://www.imdb.com/name/nm2796645","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmExMWYyOTQtNDQ3MS00MjBlLWIyNmMtMzRlNDBhMTQzODYyXkEyXkFqcGdeQXVyMTcxMjE0NTg@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1985","placeOfBirth":" Los Angeles, California, USA","birthName":"Paige Carlyle Howard","bio":"Paige Howard was born on February 5, 1985 in Los Angeles, California, USA as Paige Carlyle Howard. She is an actress, known for Adventureland (2009), The Employer (2013) and stalkTALK (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmExMWYyOTQtNDQ3MS00MjBlLWIyNmMtMzRlNDBhMTQzODYyXkEyXkFqcGdeQXVyMTcxMjE0NTg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2796645","name":"Paige Howard","idIMDB":"nm2796645"},"actorId":"nm2796645","character":"Sandra Turner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael DeLorenzo","urlProfile":"http://www.imdb.com/name/nm0217716","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4Njg0MjM1OF5BMl5BanBnXkFtZTgwNzA1MDA3NDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1959","placeOfBirth":" Bronx, New York City, New York, USA","height":"5' 10\" (1.78 m)","bio":"Michael DeLorenzo was born on October 31, 1959 in Bronx, New York City, New York, USA. He is an actor and director, known for New York Undercover (1994), A Few Good Men (1992) and Head of the Class (1986).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4Njg0MjM1OF5BMl5BanBnXkFtZTgwNzA1MDA3NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0217716","name":"Michael DeLorenzo","idIMDB":"nm0217716"},"actorId":"nm0217716","character":"Keith Caverns","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matthew Willig","urlProfile":"http://www.imdb.com/name/nm2200632","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NjE5Mzg4MV5BMl5BanBnXkFtZTgwMzk1OTM4NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 January 1969","placeOfBirth":" La Mirada, California, USA","birthName":"Matthew Joseph Willig","height":"6' 6½\" (1.99 m)","bio":"Matthew is retired from the NFL after 14 seasons. He played for 6 teams (New York Jets, Atlanta Falcons, Green Bay Packers, St. Louis Rams, San Francisco 49ers and the Carolina Panthers). He went to 2 Super Bowls while winning 1 and losing the other. He is steadily rising up the Acting ladder and receiving acclaim as his roles get bigger and better.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NjE5Mzg4MV5BMl5BanBnXkFtZTgwMzk1OTM4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2200632","name":"Matthew Willig","idIMDB":"nm2200632"},"actorId":"nm2200632","character":"Mike Drake","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Katerina Kopel","urlProfile":"http://www.imdb.com/name/nm1620807","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc5OTY5MzkxNF5BMl5BanBnXkFtZTcwMjM2NDE2NQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Katerina Kopel is an actress and assistant director, known for Crazy, Stupid, Love. (2011), Burlesque (2010) and The Employer (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc5OTY5MzkxNF5BMl5BanBnXkFtZTcwMjM2NDE2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1620807","name":"Katerina Kopel","idIMDB":"nm1620807"},"actorId":"nm1620807","character":"Billie Lewis","urlCharacter":"http://www.imdb.com/character/ch0415921","main":true},{"actorName":"Billy Zane","urlProfile":"http://www.imdb.com/name/nm0000708","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzA2NTE0NF5BMl5BanBnXkFtZTcwNzAxMTUxMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1966","placeOfBirth":" Chicago, Illinois, USA","birthName":"William George Zane Jr.","height":"6' 0½\" (1.84 m)","bio":"William George Zane, better known as Billy Zane, was born on February 24, 1966 in Chicago, Illinois, to Thalia (Colovos) and William Zane, both of Greek ancestry. His parents were amateur actors and managed a medical technical school. Billy has an older sister, actress and singer Lisa Zane. Billy was bitten by the acting bug early on. In his early teens, he attended Harand Camp of the Theater Arts in Elkhart Lake, Wisconsin. In 1982, he attended the American School in Switzerland. His high school days were spent at Francis Parker High School in Chicago, Illinois. Daryl Hannah and Jennifer Beals also attended Parker, prior to Billy's attendance. Soon after graduating from high school, Billy decided to venture out to California to attempt acting for the first time. Within three weeks, he won his very first big screen role in Back to the Future (1985), playing the role of Match, one of Biff Tannen's thugs. He would later reprise that role for the sequel Back to the Future Part II (1989). Then after a small role in the science fiction horror film Critters (1986), he landed starring roles in several television films. Billy played villain Hughie Warriner in the Australian thriller film Calme blanc (1989), where he met his future wife, Lisa Collins. He also co-starred in Memphis Belle (1990), a film version of a 1944 documentary about a World War II bomber. In 1991, he appeared as John Justice Wheeler on several episodes of David Lynch's television series Twin Peaks (1990). Billy starred as the eponymous superhero in Le fantôme du Bengale (1996) and as Caledon Hockley in the billion dollar grossing Titanic (1997). Then, he starred in the television movie Cléopatre (1999) where he met his soon-to-be fiance, actress Leonor Varela from whom he subsequently separated. In 2005, he had a recurring role as the poetry loving ex-demon Drake on the television series Charmed (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzA2NTE0NF5BMl5BanBnXkFtZTcwNzAxMTUxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000708","name":"Billy Zane","idIMDB":"nm0000708"},"actorId":"nm0000708","character":"Alan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicki Aycox","urlProfile":"http://www.imdb.com/name/nm0043704","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA2NTk2MDAzMl5BMl5BanBnXkFtZTgwNDE5OTUwOTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1975","placeOfBirth":" Hennessey, Oklahoma, USA","birthName":"Nicki Lynn Aycox","height":"5' 4\" (1.63 m)","bio":"Nicki Aycox has lived a full artistic life since the age of nine, when she fell in love with the family piano and began playing music. By the time she had reached her preteens Nicki was performing Beethoven for audiences all around Oklahoma, until her family had a huge financial setback and was forced to sell her piano. Nicki has said that this sad circumstance played a major role in her shift to the theater. Like a lot of kids her age she began performing in her high school theater, and also in drama competitions. She won state titles in different categories, and became very comfortable with being in front of an audience. She once said that she was on stage long before she ever actually sat in an audience. After high school graduation she attended the University of Oklahoma and began serious academic study. Soon, however, she found herself driving to California to enroll in the theater department at Long Beach State. While working two jobs and participating in the theater department, Nicki found little time to study and take a full class load. In her second year at Long Beach State Nicki was able to sign with a small agency in Hollywood, and thus began her career as a professional performer - a career which began relatively quickly compared to most. She was working small bit parts on several popular networks and shows within a year of making the move from Oklahoma to Los Angeles. In the beginning of her career Nicki acted opposite actor Stephen Rae in an HBO film called \"Double Tap\", as well as appearing in shows like \"Third Rock from the Sun\", NBC's \"Providence\", David Kelley's \"Ally McBeal\", and in the X-Files episode \"Rush\" in 1999. That role from the TV show lead to a role in the second \"X-Files\" film \"I Want to Believe\" in 2008. In a time when an unspoken difference between \"film\" actors and \"television\" actors existed, Aycox did not allow this rule to apply to her. Her work during these early years has included guest spots on \"CSI\", and \"Dark Angel\", a recurring role n NBC's \"ED\" playing the wild and crazy sister of Julie Bowen. At some points Nicki would be pulling double duty playing roles on different shows. She played the sister of Katherine Morris on CBS's \"Cold Case\", while shooting the series \"LAX\" with Heather Locklear. By 2005, Aycox was made a series regular on shows such as FX's \"Over There\" created by Steven Bochco and Chris Gerolmo. She moved on from there to play a very memorable role as a psychotic serial killer in an episode of \"Criminal Minds\" titled \"The Perfect Switch\". The following year Nicki appeared in the Halle Berry film \"Perfect Stranger\". One of her most widely known roles has been that of Meg Masters in \"Supernatural\". In the years 2009-2013 Aycox enjoyed success as a series regular as Jamie Allen in the Bruckheimer series \"Dark Blue\". Next she was cast as Lisa Matthews in the Indie film \"Lifted\", directed by Oscar nominated director Lexi Alexander. Around this time she also awarded a best actress award by the Buffalo Niagara film festival for her portrayal as a German woman fighting to save her sanity in the World War II film \"Christina\". Her co-star, Stephen Lang, was also awarded for his role as Inspector Reinheart. Today Aycox has reclaimed her love of music, playing the guitar and singing for audiences, as well as continuing her acting career. She lives on both the East and West coasts.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA2NTk2MDAzMl5BMl5BanBnXkFtZTgwNDE5OTUwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0043704","name":"Nicki Aycox","idIMDB":"nm0043704"},"actorId":"nm0043704","character":"Maggie Jordan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Daniel Aldema","urlProfile":"http://www.imdb.com/name/nm2748450","urlPhoto":"","biography":{"bio":"Daniel Aldema is known for his work on G.I. Joe: The Rise of Cobra (2009), Super 8 (2011) and The Employer (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2748450","name":"Daniel Aldema","idIMDB":"nm2748450"},"actorId":"nm2748450","character":"Ted Simpson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Alexander Herz","urlProfile":"http://www.imdb.com/name/nm2660834","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU1NjI0NzE2OV5BMl5BanBnXkFtZTgwMzAwOTMxMTE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"height":"6' 2\" (1.88 m)","bio":"Mark Alexander Herz was born September 24 1976, in the city of Orange California and was raised in Los Angeles. His father was a professional soccer player from Germany, and his mother a hairstylist from Poland. Mark learned both foreign languages quite fluently from years of schooling and frequent summer European travels . He was constantly filming family events and travels with the camcorder as a child. He lived for two years in southern Germany where he played soccer trying to follow in his father's footsteps. After returning to Los Angeles, Mark first set foot on the Steven Spielberg film \"Catch me if you can\". Soon after, he began his professional training at the Margie Haber studio, attended several workshops, classes, and read books on acting for film. His first speaking role came to him in the short film \"The Hit\". This would be just the beginning of many more film projects to come. However, it was through his persistence, determination and hustle that he finally connected with a solid manger and landed a Co-Star role in the J.J. Abrams TV. Series -\"Undercovers\" utilizing his talents with languages as a German speaking guard. Mark continues to showcase his dynamic talents in all avenues of filming.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU1NjI0NzE2OV5BMl5BanBnXkFtZTgwMzAwOTMxMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2660834","name":"Mark Alexander Herz","idIMDB":"nm2660834"},"actorId":"nm2660834","character":"Dom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bryan Hanna","urlProfile":"http://www.imdb.com/name/nm2185009","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NjkyOTc0N15BMl5BanBnXkFtZTgwMjMzODA5NzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1962","placeOfBirth":" Los Angeles, California, USA","height":"5' 10\" (1.78 m)","bio":"Bryan Hanna was born on November 10, 1962 in Los Angeles, California, USA. He is known for his work on Tales of the Frontier (2012), Mega Shark vs. Kolossus (2015) and Callous (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NjkyOTc0N15BMl5BanBnXkFtZTgwMjMzODA5NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2185009","name":"Bryan Hanna","idIMDB":"nm2185009"},"actorId":"nm2185009","character":"Max","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicholas Vukasovich","urlProfile":"http://www.imdb.com/name/nm3812360","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWI0YjllNGYtODU0Yy00YzIyLWIwOGEtMWY4OWFkYThjNjNhXkEyXkFqcGdeQXVyMjIyODcyMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 5\" (1.96 m)","bio":"Nicholas Vukasovich is an actor, known for Chicago Fire (2012), Low Winter Sun (2013) and The Employer (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWI0YjllNGYtODU0Yy00YzIyLWIwOGEtMWY4OWFkYThjNjNhXkEyXkFqcGdeQXVyMjIyODcyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3812360","name":"Nicholas Vukasovich","idIMDB":"nm3812360"},"actorId":"nm3812360","character":"Ray","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennifer Grace Farmer","urlProfile":"http://www.imdb.com/name/nm4368244","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5MjIwODg4OV5BMl5BanBnXkFtZTcwMTI2ODQyNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jennifer Grace Farmer is a producer and actress, known for The Employer (2013), Animals (2014) and The Midnight Swim (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5MjIwODg4OV5BMl5BanBnXkFtZTcwMTI2ODQyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4368244","name":"Jennifer Grace Farmer","idIMDB":"nm4368244"},"actorId":"nm4368244","character":"Ms. Anderson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Cooney","urlProfile":"http://www.imdb.com/name/nm3558425","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNDI0MjEyOF5BMl5BanBnXkFtZTcwOTA3MTg0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"James Cooney is an assistant director and actor, known for Excision (2012), The Employer (2013) and Gutshot Straight (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNDI0MjEyOF5BMl5BanBnXkFtZTcwOTA3MTg0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3558425","name":"James Cooney","idIMDB":"nm3558425"},"actorId":"nm3558425","character":"Pete Miller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eli Goodman","urlProfile":"http://www.imdb.com/name/nm1787679","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMDE3ODI3N15BMl5BanBnXkFtZTcwMTgyODMyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 July 1971","placeOfBirth":"","bio":"Eli Goodman is originally from Santa Fe, New Mexico. Eli attended The University of New Mexico and The Theatre School at DePaul University. He spent one year traveling the country by train as a clown with the Ringling Brothers and Barnum and Bailey Circus. Having trained and worked for years in Chicago, Eli considers himself a Chicago actor. His theater credits there and through out the mid-west include: \"Intimate Apparel\" and \"World Set Free\" (Steppenwolf) \"The Action Against Sol Schumann\" (Victory Gardens), \"Return of the Hip Messiah\" (Prop THTR / Second City), \"The Last Night at Ballyhoo\" (Mercury Theatre), \"Incident at Vichy\" (Writers Theatre), \"Comedy of Errors\" and \"Much Ado About Nothing\" (Chicago Shakespeare), \"Wit\" and \"A Christmas Carol\" (Actors Theatre of Louisville) along with many others.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMDE3ODI3N15BMl5BanBnXkFtZTcwMTgyODMyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1787679","name":"Eli Goodman","idIMDB":"nm1787679"},"actorId":"nm1787679","character":"Greg","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1863203","urlIMDB":"http://www.imdb.com/title/tt1863203","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.4","filmingLocations":[{"location":"Los Angeles, California, USA"}],"awards":[{"award":"Chicago Indiefest 2012","titlesAwards":[{"titleAwardOutcome":"Won Festival Prize","categories":[{"category":"Best Feature","names":[{"name":"Frank Merle","id":"nm3106201","role":null}]}]}]},{"award":"Geneva Film Festival 2013","titlesAwards":[{"titleAwardOutcome":"Won Jury Special Prize","categories":[{"category":"Feature Filmmaker","names":[{"name":"Frank Merle","id":"nm3106201","role":null}]}]}]},{"award":"L.A. Indies Awards 2013","titlesAwards":[{"titleAwardOutcome":"Won L.A. Indie Award","categories":[{"category":"Best Feature Length Film","names":[{"name":"Frank Merle","id":"nm3106201","role":null}]},{"category":"Directing","names":[{"name":"Frank Merle","id":"nm3106201","role":null}]},{"category":"Lead Actor","names":[{"name":"Malcolm McDowell","id":"nm0000532","role":null}]},{"category":"Best Supporting Actor","names":[{"name":"Michael DeLorenzo","id":"nm0217716","role":null}]},{"category":"Supporting Actress","names":[{"name":"Paige Howard","id":"nm2796645","role":null}]},{"category":"Best Soundtrack","names":[{"name":"Jonathan Hartman","id":"nm3864019","role":null}]},{"category":"Award of Excellence","names":[{"name":"Vincent J. Guastini","id":"nm0345474","role":null}]},{"category":"Award of Excellence","names":[{"name":"Frank Merle","id":"nm3106201","role":null}]}]}]}],"votes":"1,020","type":"Movie","companyCreditsSimple":[{"idCompany":"co0332714","name":"Hyrax Entertainment"},{"idCompany":"co0190691","name":"Crafted Films"},{"idCompany":"co0489063","name":"Lone Morsel Productions"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:37:13"}}