{"data":{"movies":[{"title":"About Last Night","originalTitle":"","year":"2014","releaseDate":"20140214","directors":[{"name":"Steve Pink","id":"nm0684336"}],"writers":[{"name":"Leslye Headland","id":"nm2853516"},{"name":"Tim Kazurinsky","id":"nm0443730"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3OTc4NDMzNF5BMl5BanBnXkFtZTgwNjQ2NzY3MDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"Follow two couples as they journey from the bar to the bedroom and are eventually put to the test in the real world.","simplePlot":"Follow two couples as they journey from the bar to the bedroom and are eventually put to the test in the real world.","actors":[{"actorName":"Kevin Hart","urlProfile":"http://www.imdb.com/name/nm0366389","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTAxMjkxN15BMl5BanBnXkFtZTgwODg5MzYyMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1979","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"5' 4\" (1.63 m)","bio":"Kevin Hart was born on July 6, 1979 in Philadelphia, Pennsylvania, USA. He is an actor and producer, known for Kevin Hart: Let Me Explain (2013), Ride Along (2014) and The Wedding Ringer (2015). He has been married to Eniko Parrish since August 13, 2016. He was previously married to Torrei Hart.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTAxMjkxN15BMl5BanBnXkFtZTgwODg5MzYyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0366389","name":"Kevin Hart","idIMDB":"nm0366389"},"actorId":"nm0366389","character":"Bernie","urlCharacter":"http://www.imdb.com/character/ch0412719","main":true},{"actorName":"Michael Ealy","urlProfile":"http://www.imdb.com/name/nm1013003","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwODUwOTg1OV5BMl5BanBnXkFtZTcwMjg2NjM5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 August 1973","placeOfBirth":" Silver Spring, Maryland, USA","birthName":"Michael Brown","height":"5' 10\" (1.78 m)","bio":"Known for his charming looks and deep personality, Michael Ealy blessed the movie screen with his role in Barbershop (2002). When he left Silver Spring, Maryland, with a degree in English, he headed off to New York. From there he performed in several stage productions, including the Off-Broadway hits \"Joe Fearless\" and \"Whoa-Jack\". He's appeared in Showtime's Soul Food (2000), on NBC's Law & Order (1990) and the ABC sitcom Madigan Men (2000). When he moved to Los Angeles, he landed a lead role in \"Barbershop\" after a friend informed him about it. In addition, he appeared in Kissing Jessica Stein (2001) and Jerry Bruckheimer's Bad Company (2002), directed by Joel Schumacher. The natural, blue-eyed actor can be seen in HBO's Baseball Wives (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwODUwOTg1OV5BMl5BanBnXkFtZTcwMjg2NjM5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1013003","name":"Michael Ealy","idIMDB":"nm1013003"},"actorId":"nm1013003","character":"Danny","urlCharacter":"http://www.imdb.com/character/ch0022527","main":true},{"actorName":"Regina Hall","urlProfile":"http://www.imdb.com/name/nm0356021","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NjUyNjk2OF5BMl5BanBnXkFtZTcwNzEwMTYwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1970","placeOfBirth":" Washington, District of Columbia, USA","height":"5' 5\" (1.65 m)","bio":"Regina Hall was born December 12, 1970 in Washington, D.C., to Ruby, a teacher, and Odie Hall, a contractor. She graduated from Fordham University in 1992, and went on to earn a master's degree in journalism from New York University before shifting to an acting career. In 1997 at age 26, she began appearing in commercials, and then made the giant leap into movies. Her fame came with her role in the comedy-horror spoof Scary Movie, Regina Hall has frequented the big screen in roles that far from betrayed her age. Her recurring role in Scary Movie and the sequel Scary Movie 2 exhibited the 30-year-old's ability to maintain her youthful appearance, as she portrayed the high-school-aged Brenda Meeks. However, her first film role was in the 1999 film The Best Man. The following year, she made many other film appearances, including her starring role in Scary Movie in 2000. She first had a role in the movie Love and Basketball which also starred close friend Sanaa Lathan. In 2001, Hall's list of credits grew to include her first television role, as Corretta Lipp on the prime-time drama Ally McBeal, which was a recurring role for several episodes. Furthermore, in 2001 Scary Movie 2 was released, in addition to the Mandel Holland comedy The Other Brother, featuring Hall as Vicki. One year later, she starred in the action-drama Paid in Full, directed by Charles Stone III. She would later on start in other films such as;Malibu's Most Wanted, Scary Movie 3, The Honeymooners, and First Sunday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NjUyNjk2OF5BMl5BanBnXkFtZTcwNzEwMTYwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0356021","name":"Regina Hall","idIMDB":"nm0356021"},"actorId":"nm0356021","character":"Joan","urlCharacter":"http://www.imdb.com/character/ch0412720","main":true},{"actorName":"Joy Bryant","urlProfile":"http://www.imdb.com/name/nm0117146","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNTk1NTgwM15BMl5BanBnXkFtZTcwNTcyNjY0MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1974","placeOfBirth":" The Bronx, New York, USA","height":"5' 9\" (1.75 m)","bio":"Joy Bryant was born in a modest home in The Bronx, New York and as a young woman, was enrolled in an inner-city outreach organization called \"A Better Chance,\" designed to encourage minority talent. Joy was also blessed with brains as well beauty and remained an excellent student throughout her high school years. As a result, she was awarded a full academic scholarship to Yale University. While enrolled as a full-time student at Yale, Joy was discovered by a modeling scout from Next Models Management and subsequently pursued a career as a fashion model in Paris. Her slender yet classic beauty got her an exclusive contract with prestigious brand names such as Tommy Hilfiger and the Victoria's Secret lingerie catalogue. Joy's acting debut came about in 2001 in Robert Townsend's Carmen: A Hip Hopera (2001). An MTV production, the film also starred Beyoncé Knowles and Mekhi Phifer, along with several hip-hop superstars. After a small role in the Eddie Murphy action comedy Showtime (2002), she made her big breakthrough in Denzel Washington's directorial debut, Antwone Fisher. Bryant played Cheryl, the beautiful and supportive girlfriend of Antwone (Derek Luke). In 2003, she co-starred with Jessica Alba in Bille Woodruff's romantic drama Honey (2003). That same year, she appeared in Mario Van Peebles' _Baadasssss! (2003)_, based on his father Melvin Van Peebles' autobiographical novel. Projects for 2004 included the crime drama Three Way (2004) with Gina Gershon. The year 2005 turned out to be an even better year for the actress. Joy appeared in high-profile films such as The Skeleton Key (2005), London (2005), and Get Rich or Die Tryin' (2005). Her performances as the sassy Mallory in London (2005) and the strikingly pretty Charlene in Get Rich or Die Tryin' (2005) were critically acclaimed, and re-enforced her reputation as a versatile actress.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNTk1NTgwM15BMl5BanBnXkFtZTcwNTcyNjY0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0117146","name":"Joy Bryant","idIMDB":"nm0117146"},"actorId":"nm0117146","character":"Debbie","urlCharacter":"http://www.imdb.com/character/ch0412721","main":true},{"actorName":"Christopher McDonald","urlProfile":"http://www.imdb.com/name/nm0001520","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkyNDMxODc3M15BMl5BanBnXkFtZTgwNzQ3OTM2NDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 February 1955","placeOfBirth":" New York City, New York, USA","height":"6' 3\" (1.91 m)","bio":"Christopher McDonald was born and raised in New York City, New York, to Patricia, a real estate agent, and James R. McDonald, an educator. His breakout role was in Ridley Scott's Thelma and Louise (1991), followed shortly by playing Jack Barry in Robert Redford's Quiz show (1994). Other notable performances include Into Thin Air (1997) as John Krakauher and Tappy Timmons in Requiem for a Dream (2000) opposite Ellen Burstyn. Chris has co-starred in hit comedies Happy Gilmore, American Pie, Flubber and Leave it to Beaver. Harry's Law, Boardwalk Empire and Family Law highlight his television credits. Trained by legendary acting teacher Stella Adler and also at the Royal Academy of Dramatic Art, Chris has been singled out by the New York Times as one of the most prolific actor's in Hollywood. He has performed in over 100 films spanning thirty five years. His 40 stage credits include Billy Flynn in the Broadway production of Chicago and the 2013 hit, Lucky Guy opposite Tom Hanks. Since the loss of two siblings and a parent to cancer, Chris has been an active supporter of the Make a Wish foundation along with charities which help cancer research. He participates in celebrity fund raising events throughout the world. A graduate of Hobart and William Smith college in 1977, he is a principle donor for the building of their new performing arts center.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkyNDMxODc3M15BMl5BanBnXkFtZTgwNzQ3OTM2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001520","name":"Christopher McDonald","idIMDB":"nm0001520"},"actorId":"nm0001520","character":"Casey McNeil","urlCharacter":"http://www.imdb.com/character/ch0409845","main":true},{"actorName":"Adam Rodriguez","urlProfile":"http://www.imdb.com/name/nm0735226","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNjM5MTY0OF5BMl5BanBnXkFtZTcwOTE5NDI5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 April 1975","placeOfBirth":" New York City, New York, USA","birthName":"Adam Michael Rodriguez","height":"6' (1.83 m)","bio":"Adam Rodriguez, best known for his role as Eric Delko on the internationally acclaimed CBS crime drama, CSI: Miami (2002) was just cast as 'Cookies' love interest on Fox's record-breaking series Empire (2015). Adam currently stars opposite Channing Tatum in the Warner Brothers feature film Magic Mike XXL (2015), the sequel to the 2012 box-office hit Magic Mike (2012), directed by Steven Soderbergh. Rodriguez was recently seen recurring on the NBC drama The Night Shift (2014). Rodriguez's previous credits include, \"About Last Night,\" in which he starred alongside Michael Ealy and Paula Patton, and Tyler Perry's \"I Can Do Bad All By Myself,\" which won him the NAACP Image Award for Outstanding Supporting Actor in a Motion Picture. Rodriguez earned an ALMA Award in 2011 for his breakthrough role as Eric Delko on \"CSI: Miami.\" He is also credited for writing and directing two episodes of the hit show. Following that, Rodriguez starred in the final season of ABC's Ugly Betty (2006), playing sexy, bad boy Bobby Talercio, and guest starred on hit shows including Necessary Roughness (2011) and Psych (2006). He also landed a recurring role on the Fox comedy The Goodwin Games (2013) opposite Becki Newton and Scott Foley. He recently co-starred in the CBS drama, Reckless (2014), playing the role of Preston Cruz alongside Cam Gigandet and Anna Wood. A New York native, Rodriguez began his acting career with a starring role in the Steven Bochco-produced \"Brooklyn South,\" playing Officer Hector Villanueva. His earlier television credits include \"All Souls\" for UPN, WB's \"Felicity\" and Showtime's \"Resurrection Blvd.\" In 2002, he co-starred in the final season of the cult hit \"Roswell.\" Additionally, Rodriguez has been featured in popular music videos including Lionel Richie's, \"I Call It Love\" and Jennifer Lopez's breakthrough video, \"If You Had My Love.\" On his off time, Rodriguez plays the guitar and writes music. Rodriguez currently resides in Los Angeles with his family.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNjM5MTY0OF5BMl5BanBnXkFtZTcwOTE5NDI5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0735226","name":"Adam Rodriguez","idIMDB":"nm0735226"},"actorId":"nm0735226","character":"Steven Thaler","urlCharacter":"http://www.imdb.com/character/ch0412722","main":true},{"actorName":"Joe Lo Truglio","urlProfile":"http://www.imdb.com/name/nm0516266","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTAyMTI4ODQ3Ml5BMl5BanBnXkFtZTcwOTk0MjE1OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 December 1970","placeOfBirth":" Ozone Park, Queens, New York City, New York, USA","height":"5' 6½\" (1.69 m)","bio":"Joe Lo Truglio was born in Ozone Park, Queens and was raised in Margate, Florida. He is the son of Helen (Lynch) and Joseph Lo Truglio, and is of Italian and Irish descent. His childhood revolved around collecting Mad magazines, shooting horror movies on a Super 8, fishing in his backyard canal, and drawing homemade comics. He graduated Coconut Creek High School in 1988, where he was a member of Thespian troupe 2617, and there, along with classmate Russell Scherker, in category Duo Scene at Thespian VII district competition at Santaluces High School, snagged the coveted \"Critic's Choice\". The scene performed: the screwball, banter-laden opening scene of \"Say Goodnight, Gracie\". He attended NYU Film school where he met his future colleagues and co-founded the cult sketch group, \"The State\". Also during this time, he indulged in \"Jagger-Induced, Midnight Sidewalk-Stencil Missions\". After a short run on MTV, he and his cohorts were pistol-whipped by the realities of network television. After The State's hiatus in 1996, he hunkered down in Hell's Kitchen and immersed himself in commercial, video-game, and TV episodic work. He found a local watering hole, played poker, and trash-talked LA, where, ironically, he would move to 10 years later. Around the millennium, with \"Wet Hot American Summer\" and \"The Station Agent\", independent film work came back into the fray. It was all coming full-circle, the only missing element being a Super 8 camera. Now, he balances writing and producing web series and firebranding its originality over mainstream media with bike rides and matinées. He relishes jumping back and forth between studio and indie flicks. Guinness and Jameson is still his favorite buddy-comedy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTAyMTI4ODQ3Ml5BMl5BanBnXkFtZTcwOTk0MjE1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0516266","name":"Joe Lo Truglio","idIMDB":"nm0516266"},"actorId":"nm0516266","character":"Ryan Keller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paula Patton","urlProfile":"http://www.imdb.com/name/nm1745736","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTY2MzczMl5BMl5BanBnXkFtZTcwNjEzNTUxOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 December 1975","placeOfBirth":" Los Angeles, California, USA","birthName":"Paula Maxine Patton","height":"5' 7¼\" (1.71 m)","bio":"Paula Patton was born in Los Angeles, California, to Joyce (Vanraden) and Charles Patton. Her father is African-American and her mother, who is caucasian, has German, English, and Dutch ancestry. Her family lived across the street from the 20th Century Fox lot when she was growing up and she was a fan of films from her earliest years. Her mother, who also appreciated good films, was a schoolteacher, and her father was a lawyer. Paula claims that as a girl she would escape by \"pretending to be someone else\" so it was not a surprise that she acted in high school plays at Hamilton Magnet Arts High School. Her favorite role was that of \"Abigail\" in \"The Crucible\". However, she went on to study film at the University of Southern California in a summer program, and won a 3-month assignment making documentaries for PBS. This led to her working as a production assistant for TV documentaries, and also for Howie Mandel's talk show. She progressed to actually producing documentary segments for Medical Diaries (2000) airing on Discovery Health Channel. Paula now professes that she liked what she was doing, but her dream remained the same as when she was small so she took acting lessons and shifted gears to become a performer. She was almost immediately successful and, within three years, had played parts in major features, Hitch (2005) and Idlewild (2006) and the female lead in Deja Vu (2006) opposite Denzel Washington.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTY2MzczMl5BMl5BanBnXkFtZTcwNjEzNTUxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1745736","name":"Paula Patton","idIMDB":"nm1745736"},"actorId":"nm1745736","character":"Alison","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Terrell Owens","urlProfile":"http://www.imdb.com/name/nm0654468","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ5MzAwNDUyM15BMl5BanBnXkFtZTcwMTE0MDIyMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 December 1973","placeOfBirth":" Alexander City, Alabama, USA","birthName":"Terrell Eldorado Owens","height":"6' 3\" (1.91 m)","bio":"Terrell Owens was born on December 7, 1973 in Alexander City, Alabama, USA as Terrell Eldorado Owens. He is an actor and producer, known for Any Given Sunday (1999), About Last Night (2014) and The Sub (2013). He has been married to Rachel Snider since January 23, 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ5MzAwNDUyM15BMl5BanBnXkFtZTcwMTE0MDIyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0654468","name":"Terrell Owens","nicknames":["T.O.","The Player"],"idIMDB":"nm0654468"},"actorId":"nm0654468","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Catherine Shu","urlProfile":"http://www.imdb.com/name/nm3725758","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDUxZjYyN2MtNTg4MS00ZDU1LWI2MGEtYTVmNmIxN2I0MjJlXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Catherine Shu is an actress, known for A Million Ways to Die in the West (2014), About Last Night (2014) and Scary or Die (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDUxZjYyN2MtNTg4MS00ZDU1LWI2MGEtYTVmNmIxN2I0MjJlXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3725758","name":"Catherine Shu","idIMDB":"nm3725758"},"actorId":"nm3725758","character":"Asian Manicurist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Greenman","urlProfile":"http://www.imdb.com/name/nm1476528","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMDIzNjQyMV5BMl5BanBnXkFtZTgwNzQ0MTg3MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 October 1977","placeOfBirth":" Syracuse, New York, USA","height":"6' (1.83 m)","bio":"David Greenman was born on October 27, 1977 in Syracuse, New York, USA. He is an actor and producer, known for About Last Night (2014), Bones (2005) and Gilmore Girls (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMDIzNjQyMV5BMl5BanBnXkFtZTgwNzQ0MTg3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1476528","name":"David Greenman","idIMDB":"nm1476528"},"actorId":"nm1476528","character":"Isaac","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bryan Callen","urlProfile":"http://www.imdb.com/name/nm0130437","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDU2ODM4MV5BMl5BanBnXkFtZTcwOTc2ODE3Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 January 1967","placeOfBirth":" Manila, Philippines","birthName":"Bryan Christopher Callen","height":"5' 11\" (1.8 m)","bio":"Born in Manila, Philippines, Bryan Callen made his television debut as a series regular on MADtv (1995) and the HBO prison series Oz (1997). He was recently seen as Kirstie Alley's wisecracking assistant on Showtime's comedy series Fat Actress (2005). Callen has appeared on several television series including Sex and the City (1998), 7th Heaven (1996), Stacked (2005), The King of Queens (1998), Las Vegas (2003), Significant Others (1998), The West Wing (1999), CSI: Crime Scene Investigation (2000), Law & Order: Special Victims Unit (1999), NYPD Blue (1993), Suddenly Susan (1996), Frasier (1993) and NewsRadio (1995), among others. In addition, Callen has appeared in such feature films as Bad Santa (2003) and Old School (2003) and has performed stand up comedy on several TV shows including Late Night with David Letterman (1982).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDU2ODM4MV5BMl5BanBnXkFtZTcwOTc2ODE3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0130437","name":"Bryan Callen","idIMDB":"nm0130437"},"actorId":"nm0130437","character":"Trent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Quinn","urlProfile":"http://www.imdb.com/name/nm6254490","urlPhoto":"","biography":{"bio":"Paul Quinn is an actor, known for About Last Night (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6254490","name":"Paul Quinn","idIMDB":"nm6254490"},"actorId":"nm6254490","character":"Drunk Regular","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hailey Boyle","urlProfile":"http://www.imdb.com/name/nm5343885","urlPhoto":"","biography":{"bio":"Hailey Boyle is an actress, known for About Last Night (2014), Tales from the Toilet (2015) and Rubberhead (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5343885","name":"Hailey Boyle","idIMDB":"nm5343885"},"actorId":"nm5343885","character":"New Roommate","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Selita Ebanks","urlProfile":"http://www.imdb.com/name/nm2115545","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNzc5NzIzN15BMl5BanBnXkFtZTYwNDYyMDMz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 February 1983","placeOfBirth":" New York, New York, USA","height":"5' 5\" (1.65 m)","bio":"Selita Ebanks is best known for appearing in the 2007 Sports Illustrated Swimsuit edition and for her work as a Victoria's Secrets lingerie model. She appeared in six Victoria's Secret fashion Shows from 2005 to 2010 and was a Victoria's Secret Angel from 2005 to 2009. She has worked also as an actress making appearances on The Apprentice (2004), How I Met Your Mother (2005), South Beach (2006), \"Hawaii Five-O\" (2010) ( qv) as well as in several commercials, short films and music videos. She was born on February 17, 1983 in Georgetown, Grand Cayman, Cayman Islands.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwNzc5NzIzN15BMl5BanBnXkFtZTYwNDYyMDMz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2115545","name":"Selita Ebanks","idIMDB":"nm2115545"},"actorId":"nm2115545","character":"Pretty Lady","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1826590","urlIMDB":"http://www.imdb.com/title/tt1826590","business":{"budget":{"money":"$12,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$27,838,201","country":"USA","day":"16","month":"02","year":"2014","remarks":"2,253 Screens"}],"gross":[{"money":"$48,637,684","country":"USA","day":"27","month":"04","year":"2014","remarks":""},{"money":"$48,569,018","country":"USA","day":"20","month":"04","year":"2014","remarks":""},{"money":"$48,500,519","country":"USA","day":"13","month":"04","year":"2014","remarks":""},{"money":"$48,473,648","country":"USA","day":"06","month":"04","year":"2014","remarks":""},{"money":"$48,419,430","country":"USA","day":"30","month":"03","year":"2014","remarks":""},{"money":"$48,267,764","country":"USA","day":"23","month":"03","year":"2014","remarks":""},{"money":"$47,815,963","country":"USA","day":"16","month":"03","year":"2014","remarks":""},{"money":"$46,501,877","country":"USA","day":"09","month":"03","year":"2014","remarks":""},{"money":"$43,750,000","country":"USA","day":"02","month":"03","year":"2014","remarks":""},{"money":"$38,281,106","country":"USA","day":"23","month":"02","year":"2014","remarks":""},{"money":"$27,838,201","country":"USA","day":"16","month":"02","year":"2014","remarks":""}],"weekendGross":[{"money":"$33,563","country":"USA","day":"27","month":"04","year":"2014","remarks":"67 Screens"},{"money":"$63,486","country":"USA","day":"20","month":"04","year":"2014","remarks":"109 Screens"},{"money":"$13,495","country":"USA","day":"13","month":"04","year":"2014","remarks":"26 Screens"},{"money":"$26,851","country":"USA","day":"06","month":"04","year":"2014","remarks":"44 Screens"},{"money":"$74,145","country":"USA","day":"30","month":"03","year":"2014","remarks":"91 Screens"},{"money":"$201,594","country":"USA","day":"23","month":"03","year":"2014","remarks":"214 Screens"},{"money":"$670,063","country":"USA","day":"16","month":"03","year":"2014","remarks":"624 Screens"},{"money":"$1,653,487","country":"USA","day":"09","month":"03","year":"2014","remarks":"1,074 Screens"},{"money":"$3,400,000","country":"USA","day":"02","month":"03","year":"2014","remarks":"1,804 Screens"},{"money":"$7,534,816","country":"USA","day":"23","month":"02","year":"2014","remarks":"2,253 Screens"},{"money":"$27,838,201","country":"USA","day":"16","month":"02","year":"2014","remarks":"2,253 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"28","month":"10","year":"2012","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 40 min (100 min)"],"soundMix":["SDDS","Datasat","Dolby Digital"],"color":["Color (ACES)"],"aspectRatio":["2.35 : 1"],"camera":["Sony CineAlta F65, Leica Summilux-C Lenses"],"laboratory":["ColorWorks, Culver City (CA), USA (digital intermediate)","DeLuxe, Hollywood (CA), USA (prints)","The Creative Cartel, Culver City (CA), USA (dailies processing)"],"filmLength":null,"negativeFormat":["SRMemory"],"cinematographicProcess":["Digital Intermediate (4K) (master format)","F65 RAW (4K) (source format)"],"printedFilmFormat":["35 mm (anamorphic) (Fuji Eterna-CP 3514DI)","D-Cinema"]},"rating":"6.1","metascore":"62","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[{"award":"BET Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated BET Award","categories":[{"category":"Best Actor","names":[{"name":"Kevin Hart","id":"nm0366389","role":null},{"name":"Ride Along","id":"tt1408253","role":null},{"name":"Real Husbands of Hollywood","id":"tt2608368","role":null}]}]}]}],"votes":"17,905","type":"Movie","companyCreditsSimple":[{"idCompany":"co0010568","name":"Screen Gems"},{"idCompany":"co0219609","name":"Olive Bridge Entertainment"},{"idCompany":"co0045552","name":"Rainforest Films"}],"keywords":{"keywords":["bedroom","hug","interrupted sex","boyfriend girlfriend relationship","urban setting","city","apartment building","apartment","roommate","ex boyfriend ex girlfriend relationship","male nudity","female nudity","failed seduction","rejection","attempted seduction","seduction","black bra and panties","black bra","drinking","beer drinking","wine","beer","bare chested male","sex scene","kissing while having sex","sexy woman","sex in bed","dog","bench","dating","ex girlfriend","ex boyfriend","breakup","long black hair","drinking alcohol","nightclub","date","cheating","kiss","black woman","black man","black american","african american","three word title","sexuality","remake","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 21:44:48"}}