{"data":{"movies":[{"title":"Eating Out: The Open Weekend","originalTitle":"","year":"2011","releaseDate":"20140617","directors":[{"name":"Q. Allan Brocka","id":"nm0110654"}],"writers":[{"name":"Phillip J. Bartell","id":"nm0058442"},{"name":"Q. Allan Brocka","id":"nm0110654"}],"runtime":"82 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMjExNjA0MF5BMl5BanBnXkFtZTcwMzI0NDM1Nw@@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Comedy"],"plot":"Zack and his new boyfriend Benji are setting off to vacation at an all-male resort in Palm Springs with their friend Lilly. In light of the veritable smorgasbord of available men that are sure to be awaiting their arrival, Benji has proposed that he and Zack open up their relationship, just for the weekend. He's not ready to limit himself sexually and explains that this will be a good way for them to explore together. Zack is less than thrilled with the idea, but he's eager to keep Benji happy and, after all, he likes sex too. At the same time, Zack's ex, Casey, is making his way to the same resort with his hag-in-training, Penny. Knowing that Zack will be there with his new boyfriend, Casey immediately goes into panic mode, recruiting his new friend, Peter, to be his pretend boyfriend for the weekend, proving to Zack that he's had no trouble moving on from their relationship. It isn't long before all plans go awry, and Benji starts making eyes at Peter, while Zack realizes he might ...","simplePlot":"Zack is gaycationing in Palm Springs with new BF Benji who, to Zack's dismay, wants to try an open relationship. Adding confusion is Casey, Zack's ex, with Peter, his fake BF, plus Casey's fruity friend, Penny, and Zack's friend Lilly.","actors":[{"actorName":"Aaron Milo","urlProfile":"http://www.imdb.com/name/nm4378215","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ5NDU2ODU4MF5BMl5BanBnXkFtZTgwMzQ5Mjk0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 September 1984","placeOfBirth":" Rockford, Illinois, USA","bio":"Aaron Milo was born on September 28, 1984, just outside of Chicago in Rockford, IL. Milo caught the acting bug at the age of 8, when his mother was working in the costume shop of a local community theatre. He grew up doing regional theatre, and had his first New York City experience at the age of 14 and saw 10 Broadway shows in 6 days. While Milo loved the stage, he decided that he wanted to try out film, and at 17 he attended summer film camp at UCLA. He fell in love with California and film production on that trip, and established that California would be his future home. After graduating high school, he switched career goals for college and got his Bachelor's degree from Columbia College Chicago in Marketing Communication. He spent 6 months interviewing for jobs in that realm of business, and found himself longing more than ever for a career in film. Milo packed up, and headed for the California sun, where he spent 2 years working hard to support himself and to pursue his goals in film. After all the hard work he finally landed his debut role in the comedy Eating Out Drama Camp as the leading man Benji. Milo is continuing to pursue his career and living in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ5NDU2ODU4MF5BMl5BanBnXkFtZTgwMzQ5Mjk0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4378215","name":"Aaron Milo","idIMDB":"nm4378215"},"actorId":"nm4378215","character":"Benji","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Puckett","urlProfile":"http://www.imdb.com/name/nm3775208","urlPhoto":"","biography":{"bio":"Chris Puckett is an actor, known for Paranormal Activity: The Marked Ones (2014), Eating Out: The Open Weekend (2011) and Wini + George (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3775208","name":"Chris Puckett","idIMDB":"nm3775208"},"actorId":"nm3775208","character":"Congressman Piel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Salvatore","urlProfile":"http://www.imdb.com/name/nm3162943","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0NDU3NDEwODleQTJeQWpwZ15BbWU4MDM3NjQxNjQx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 May 1985","placeOfBirth":"","height":"6' 3\" (1.91 m)","bio":"Chris Salvatore grew up in Richboro, Pennsylvania, a small town outside Philadelphia. He started his career in entertainment as a singer/songwriter. In 2005 he studied vocal performance at Berklee College of Music in Boston. His music has been featured on MTV and is available in online music stores including iTunes. Chris graduated from The New York Conservatory for Dramatic Arts in 2008 where he studied acting. He starred in the romantic comedy 'Eating Out: All You Can Eat' directed by Q. Allan Brocka in 2009. Chris then went on to star in two more 'Eating Out' sequels adding to the franchise that premiered on the LOGO Network. Chris's latest project was his debut in the New York theatre scene in the new original play, Pieces. Pieces captured rave reviews from NY audiences following it's sold out run in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0NDU3NDEwODleQTJeQWpwZ15BbWU4MDM3NjQxNjQx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3162943","name":"Chris Salvatore","idIMDB":"nm3162943"},"actorId":"nm3162943","character":"Zack","urlCharacter":"http://www.imdb.com/character/ch0185715","main":true},{"actorName":"Harmony Santana","urlProfile":"http://www.imdb.com/name/nm3992614","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMjk4NDY4MF5BMl5BanBnXkFtZTcwODMzNzU0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Harmony Santana is an American film actress. She is most noted for her appearance in the 2011 film Gun Hill Road, for which she garnered an Independent Spirit Award nomination for Best Supporting Actress, and became the first openly transgender actress to be nominated for a major acting award in the United States. At the time of her performance in Gun Hill Road, Santana lived at Green Chimneys, a group home for LGBT youth in Manhattan. Being in Green Chimneys drove her to become an activist for HIV & AIDS, Homeless Youth, and Bullying. She was discovered by director Rashaad Ernesto Green at the Queens Pride parade after he had difficulty finding the right performer for the role. She is of mixed Puerto Rican and Dominican heritage. In addition to Gun Hill Road, Santana has also had supporting roles in Eating Out 4: Drama Camp and Eating Out 5: The Open Weekend. In 2014 she went on to do short films such as Futurestates: The Living and You're Dead To Me.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMjk4NDY4MF5BMl5BanBnXkFtZTcwODMzNzU0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3992614","name":"Harmony Santana","idIMDB":"nm3992614"},"actorId":"nm3992614","character":"Lilly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lilach Mendelovich","urlProfile":"http://www.imdb.com/name/nm3830712","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NzQxMzc5M15BMl5BanBnXkFtZTgwNzkwNzU3NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Lilach Mendelovich is known for her work on Eating Out: Drama Camp (2011), Eating Out: The Open Weekend (2011) and Love Sick (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NzQxMzc5M15BMl5BanBnXkFtZTgwNzkwNzU3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3830712","name":"Lilach Mendelovich","idIMDB":"nm3830712"},"actorId":"nm3830712","character":"Penny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Daniel Skelton","urlProfile":"http://www.imdb.com/name/nm3538440","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NjE0NTA2NF5BMl5BanBnXkFtZTcwNzg0OTMxOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Daniel Skelton is an actor, known for Eating Out: All You Can Eat (2009), Eating Out: Drama Camp (2011) and Eating Out: The Open Weekend (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NjE0NTA2NF5BMl5BanBnXkFtZTcwNzg0OTMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3538440","name":"Daniel Skelton","idIMDB":"nm3538440"},"actorId":"nm3538440","character":"Casey","urlCharacter":"http://www.imdb.com/character/ch0185714","main":true},{"actorName":"Jennifer Elise Cox","urlProfile":"http://www.imdb.com/name/nm0185078","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxODU1NDI4OF5BMl5BanBnXkFtZTcwMDkwNzI3Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1969","placeOfBirth":" New York City, New York, USA","height":"5' 5\" (1.65 m)","bio":"Jennifer Elise Cox combines a glowing personality with outlandish humor to invent her own comedic style. Jennifer burst on the scene in 1995 with her excellent yet underrated performance as middle child \"Jan Brady\" in \"The Brady Bunch\" movies. Growing up in New York City's lower East Side, Jennifer dreamed of becoming an actress and at the very young age of 4 began her career acting in commercials. Before comedy and film Jennifer, a highly trained ballerina, performed dramatic roles in New York stage operas such as \"Don Giovanni\" and \"Madame Butterfly\" before \"The Brady Bunch\" movies set her on a path to create her unique comedic roles. She has appeared in numerous films and TV shows, such as Fear and Loathing in Las Vegas, Edtv, Bewitched, The Backup Plan, Spooky Buddies and Stars in the upcoming indie comedy Out West, which she also produced. On Television Jennifer is considered one of Hollywood's \"go-to\" improv comedic actresses, creating hilarious characters on Web Therapy, 10 Items or Less, Lovespring International as well as many memorable guest starring roles on CSI: NY, Will & Grace, Nip/Tuck, Six Feet Under, and so many more.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxODU1NDI4OF5BMl5BanBnXkFtZTcwMDkwNzI3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0185078","name":"Jennifer Elise Cox","idIMDB":"nm0185078"},"actorId":"nm0185078","character":"Hotel Clerk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mink Stole","urlProfile":"http://www.imdb.com/name/nm0831467","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MjI2MzAyMV5BMl5BanBnXkFtZTcwOTI5NzkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1947","placeOfBirth":" Baltimore, Maryland, USA","birthName":"Nancy Paine Stoll","height":"5' 4\" (1.63 m)","bio":"Part of the original motley crew of cast players in underground shock master John Waters' bare-bones 8mm, 16mm and 35mm cult perversions during the late 60s and early 70s, Mink Stole was born Nancy Stoll in the late 1940s in Baltimore, Maryland. Waters took her under his wing in 1966 wherein she started \"acting out\" a number of his deviant creations for gross-out effect alongside other outré members that included transvestite actor Divine, Mary Vivian Pearce, David Lochary, Cookie Mueller and the not-to-be-believed grande dame Edith Massey. Calling themselves the Dreamland Players, Stole would become known as both the hysterical foil and vengeful nemesis of \"leading lady\" Divine, playing her annoying repulsive characters as pure evil incarnate. Her role in the infamous Pink Flamingos (1972) as Connie Marble, the carrot-domed villain complete with outlandish cats-eye glasses and seedy fur coat, set the tone for her subsequent gallery of grotesques, including the tantrum-throwing girl-child Taffy Davenport in Female Trouble (1974), murderous housewife-on-the-lam Peggy Gravel in Desperate Living (1977), and corn-rowed hussy Sandra Sullivan in Polyester (1981), which was the first Waters film to star a legit actor -- Tab Hunter. Stole's movie time in Waters' campfests would grow less and less as his movies/parodies grew more and more mainstream, but she remained an altruistic player for Waters nevertheless, appearing in nearly every one of his films. In 1994, she did bits in his wide releases of Hairspray (1988), Cry-Baby (1990), Serial Mom (1994), Cecil B. Demented (2000), and, his most recent, A Dirty Shame (2004). She appeared in numerous tongue-in-cheek cameos for other dubious directing talents as well with tacky, tawdry titles that begged for straight-to-video release. Over the years, Stole has made the rounds on the experimental stage. She played Van Helsing in a production of \"Dracula\" and the title papal role in \"Sister Mary Ignatius Explains It All for You,\" not to mention bizarre, contemporary treatments of the Bard's \"A Midsummer Night's Dream\" and \"A Winter's Tale.\" She recently attracted some attention in the play \"Sleeping with Straight Men\" which was seen on both coasts from 2002-2004. On the sly she has written an advice column, of all things, called \"Think Mink\" for a Baltimore newspaper. Mink Stole continues to reign as a prime film outlaw, having just completed a role in Another Gay Movie (2006) playing a character named Sloppi Seconds. Need I say more?","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MjI2MzAyMV5BMl5BanBnXkFtZTcwOTI5NzkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0831467","name":"Mink Stole","idIMDB":"nm0831467"},"actorId":"nm0831467","character":"Aunt Helen","urlCharacter":"http://www.imdb.com/character/ch0185718","main":true},{"actorName":"Rebekah Kochan","urlProfile":"http://www.imdb.com/name/nm1407022","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODEwMDEyNjczMl5BMl5BanBnXkFtZTcwMTM5NzI1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1984","placeOfBirth":" Las Vegas, Nevada, USA","height":"5' 7\" (1.7 m)","bio":"Rebekah Kochan was born in Las Vegas, Nevada. She began her acting career at age 9, when she played the lead in a local Las Vegas production of \"Annie\". Rebekah Kochan left Las Vegas at 17 to follow her dreams in Hollywood. Within her first month in Los Angeles, she landed lead roles in films. She has starred in numerous horror films. At any video store in the country, her face is the most prevalent in any horror aisle. She is also the most well-known female actress in gay films. She was the star of the highest grossing gay comedy film trilogy in history, the \"Eating Out\" series. She has gone on to star in many more gay films, since. Her fan base is huge. Every year, she receives e-mails, letters and gifts from thousands of fans all over the world. She is not only a great actress but you fall in love with her when she is on-screen. Rebekah is also one of the top female stand-up comedians in the country. She and her boyfriend, Dante (Last Comic Standing (2003)) travel all over the country, performing to hundreds of thousands of people each year. Her comedy timing in film and on stage are impeccable. She is one of the only comedians in the world who can get a laugh just from a facial expression. There has been no one better at this since Lucille Ball. With her beauty, talent and professionalism, Rebekah Kochan is destined to be the next big star of our time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODEwMDEyNjczMl5BMl5BanBnXkFtZTcwMTM5NzI1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1407022","name":"Rebekah Kochan","idIMDB":"nm1407022"},"actorId":"nm1407022","character":"Tiffani von der Sloot","urlCharacter":"http://www.imdb.com/character/ch0185695","main":true},{"actorName":"Joel Rush","urlProfile":"http://www.imdb.com/name/nm3151157","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxOTEwMTIxM15BMl5BanBnXkFtZTcwNDM2NDI1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 August 1981","placeOfBirth":"","height":"6' 1\" (1.85 m)","bio":"Joel Rush was born on August 26, 1981. He is an actor, known for If Loving You Is Wrong (2014), Days of Our Lives (1965) and The Ropes (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxOTEwMTIxM15BMl5BanBnXkFtZTcwNDM2NDI1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3151157","name":"Joel Rush","idIMDB":"nm3151157"},"actorId":"nm3151157","character":"Andy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alvaro Orlando","urlProfile":"http://www.imdb.com/name/nm1739400","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MTQ0OTYyMl5BMl5BanBnXkFtZTcwMjc0NzU2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Alvaro Orlando Manrique","height":"6' (1.83 m)","bio":"Born and raised in Miami, Florida, Alvaro Orlando is of Cuban/Colombian decent. Alvaro was an amateur Golden Gloves boxer (going into the professional level) and into mixed martial arts tournaments. He also became a professional break-dancer and an all around athlete. After graduating high school, he worked as a Camera Assistant for several shows for the Spanish network, Univision. One day he was asked by the host to play an impromptu character in a comedy skit in front of the live television show \"Sabado Gigante.\" Alvaro moved to New York and told his grandmother that Andy Garcia was not going to be the only famous Latino actor graduating from Miami Beach Senior High and added that when he gets famous, he would make a movie about how his grandmother, who came from Cuba to Miami with no money, not speaking English, no family to lean on, but still made it. As soon as he got into New York, he was cast as a host for a national bilingual urban show called \"The Roof,\" where he had the opportunity to use his charisma. He led interviews with famous celebrities while taking acting classes three times a week, studying with New York's finest. He discovered how to use his instrument and developed a craft by top notch Method Acting personal coaches. Alvaro got his biggest break as soon as he arrived in Hollywood. He was cast on Vh1's hit show \"Pick Up Artist,\" inspiring thousands of viewers with his quirky lovable high energy character and he went on to win the show with a grand prize of $50,000. He did a full media blitz, doing talk shows, radio interviews, and other personal appearances. The feature film \"Revenge\" which was released in the U.S. by the Weinstein Company in late November 2009 (it was initially distributed in Europe in 2008 with the title, \"Shadow Boxing 2\"), he lost 9 pounds to play the role of a young explosive boxer named Cesar Mendez. He starred as lead in Dir. Kenneth Castillo's first feature film \"Drive-By Chronicles: Sidewayz,\" (nominated for 2009 Imagen Awards - Best Director and Best Picture). He also played a very challenging role as \"Mariposa,\" the powerful and witty transvestite fortune teller in Kenneth Castillo's \"Drive-By Chronicles: Nicky and Jacky,\" the third feature from the trilogy. Alvaro also played an interesting role in the upcoming film \"Eating Out: The Open Weekend\" (2012), the fifth edition of the hit gay-themed film series. On television, he has appeared on Lie to Me, 90210, Breaking In, America's Most Wanted, and Hard Times of RJ Berger. Alvaro Orlando is a fearless strong and intense actor who will go that extra mile to find those gems in each character he portrays. He is a leading man with the ability to play range of characters -- from a tough boxer, to a shy autistic kid, from a crazy gang member, to a young articulate cop. Alvaro Orlando will be next seen in \"Counterpunch,\" his first feature","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MTQ0OTYyMl5BMl5BanBnXkFtZTcwMjc0NzU2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1739400","name":"Alvaro Orlando","nicknames":["Kosmo"],"idIMDB":"nm1739400"},"actorId":"nm1739400","character":"Luis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Vara","urlProfile":"http://www.imdb.com/name/nm4117495","urlPhoto":"","biography":{"bio":"Michael Vara is an actor and director, known for Marko (2010), Empty Halls (2009) and Eating Out: The Open Weekend (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4117495","name":"Michael Vara","idIMDB":"nm4117495"},"actorId":"nm4117495","character":"Peter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Greg McKeon","urlProfile":"http://www.imdb.com/name/nm3538459","urlPhoto":"","biography":{"bio":"Greg McKeon is an actor and writer, known for Eating Out: All You Can Eat (2009), Eating Out: The Open Weekend (2011) and Vampire Boys (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3538459","name":"Greg McKeon","idIMDB":"nm3538459"},"actorId":"nm3538459","character":"Dan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Will Brown","urlProfile":"http://www.imdb.com/name/nm4870763","urlPhoto":"","biography":{"bio":"Will Brown is an actor and producer, known for Eating Out: The Open Weekend (2011), Violet Tendencies (2010) and Straight Bashed (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4870763","name":"Will Brown","idIMDB":"nm4870763"},"actorId":"nm4870763","character":"Mitch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ralph Cole Jr.","urlProfile":"http://www.imdb.com/name/nm0170422","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTIyN2RiODAtNjE1NC00ZmZkLTlhNjctNzY5MzBlMjE2ODdlXkEyXkFqcGdeQXVyMzk1OTY2NA@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 April 1958","placeOfBirth":" Burbank, California, USA","bio":"Ralph Cole, Jr. is an award winning actor with phenomenal comic timing. The hilarity all started at Burbank Hospital in California where his intern father proudly assisted in the delivery. From that event on, equally encouraged by his school teacher mom, Ralph was destined to become an energetic crowd pleaser on stage, film and television. Remaining an only child lent its way for Ralph's various characters and musical enthusiasm to emerge and flourish. During his youth, Ralph attended St. Paul's Cathedral Choir School. While enrolled, he was honored to tour England singing (soprano) in many historical cathedrals. Later as a teenager with a deeper voice, Ralph proudly marched with the Los Angeles Police Department's Jr. Band playing the flute and piccolo. With their extensive touring, Ralph was no stranger to strutting in parades, marching in competitions and performing in big venue extravaganzas like L.A.'s Shrine Auditorium and Houston's Astrodome. At Beverly Hills High School, Ralph again marched proudly in the band and led in the original oratory category on the Forensics team. Ralph began studying acting at Inner City Cultural Center. U.C.L.A. productions of Born Yesterday and Lock Up Your Daughters introduced Ralph to his first summer stock experience. And how important he felt when he was cast as Chinese in L.A.'s Young Actor's Theater production of Flower Drum Song performed at Santa Monica Civic Auditorium. During his four years at Claremont's Pomona College, Ralph continued to pursue his theatrical delights and enthusiastically graduated with a Bachelor of Arts in Sociology. Then. New York City. A perfect town for Ralph because their energies blended and soared. Word processing jobs were plentiful and Ralph balanced freelance work with classes and auditions. It was not long before Ralph landed his first children's theater show where he earned his Equity card. Off-Broadway and regional theaters enabled him to hone his crafts in such hits as The Torch-Bearers, La Cage Aux Folles, Dreamgirls, My Fair Lady, and Grand Hotel. Ralph performed stand up at local New York city venues as well as performing comedy improvisation with Shock of the Funny. Broadway welcomed him in Bigger Than Bubblegum, the musical story of The Emotions. And back in L.A., Ralph successfully dazzled numerous times on stage. The Pasadena Playhouse was home to Larry Hart's rousing musical Sisterella where Ralph's creation of the plum role \"Babaloo\" garnered him both the NAACP Theater Award for Best Supporting Actor and the Playhouse's Friend's Recognizing Entertaining Drama (FRED) Award for Most Entertaining Actor. German audiences subsequently applauded his portrayal. The musical was produced by Robert DeNiro and the late, great Michael Jackson. Ralph had the profound circle of life honor care giving for his father until his peaceful passing where they held hands. He and his mom were pleased to care for a man who effortlessly gave so much of himself to others. And five days before his daddy died, Ralph booked a medical TV show called Scrubs. Daddy lit up like a Christmas tree when he heard the news! Fearlessly, Ralph has proceeded to appear on Mom, The Whole Truth, Harry's Law, Two and a Half Men, Desperate Housewives, Dexter, Cold Case and Twenty Good Years. And when you IMDb him, you will read where Ralph has graced the big screen in Untogether, The Soloist, Dirty Talk, No Saints for Sinners, Kiss the Bride, Birthday Cake, Trick, This Train and Boomerang. Ralph lives in Los Angeles and is repped by Mark Scroggs at Prestige Talent Agency, and managed by Charles Newman at Newman-Thomas Management.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTIyN2RiODAtNjE1NC00ZmZkLTlhNjctNzY5MzBlMjE2ODdlXkEyXkFqcGdeQXVyMzk1OTY2NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0170422","name":"Ralph Cole Jr.","idIMDB":"nm0170422"},"actorId":"nm0170422","character":"Jerry","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1833846","urlIMDB":"http://www.imdb.com/title/tt1833846","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"All rights reserved Distributed by 'Ariztical Entertainment' (qv) Copyright 2011 'EOSS Productions' (qv) Released by 'Ariztical Entertainment' (qv)"},"technical":{"runtime":["1 hr 22 min (82 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.4","filmingLocations":[{"location":"Palm Springs, California, USA"}],"rated":"NOT RATED","awards":[],"votes":"1,785","type":"Movie","companyCreditsSimple":[{"idCompany":"co0019518","name":"Ariztical Entertainment"},{"idCompany":"co0291786","name":"EOSS Productions"},{"idCompany":"co0378424","name":"Logo Films"}],"keywords":{"keywords":["gay","male frontal nudity","resort","confusion","fruit fly","vacation","reference to kristen stewart","male adjusting loins","female minister","wedding","flirtation","tail","jacuzzi","marriage proposal","foursome","reference to michelle obama","hormone treatment","medication","beach ball","fake orgasm","gay wedding","vibrator","yoga","belch","oral sex","cell phone","reference to angelina jolie","reference to brad pitt","reference to hermione granger","reference to ron weasley","reference to kathy griffith","reference to the incredible hulk","reference to mel gibson","reference to anderson cooper","reference to harry potter","reference to rachel maddow","reference to oprah","reference to madonna","reference to bono","reference to marmaduke","reference to jennifer aniston","reference to ryan kwanten","reference to ryan phillippe","reference to barack obama","reference to adam lambert","reference to george michael","reference to liberace","reference to casanova","reference to it gets better project","reference to mike sorrentino","reference to the situation","reference to lady gaga","reference to katy perry","urination","fantasy scene","groping","public bathroom","pubic hair","male pubic hair","promiscuity","sex romp","transgendered character","birth defect","fag hag","girl kissing girl","threesome","hotel room","love","gay cruising","sex comedy","group sex","pool","sequel","ex boyfriend","male nudity","gay interest","gay kiss","gay relationship","gay sex","homosexual"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:26:31"}}