{"data":{"movies":[{"title":"The Baytown Outlaws","originalTitle":"","year":"2012","releaseDate":"20130615","directors":[{"name":"Barry Battles","id":"nm2030556"}],"writers":[{"name":"Barry Battles","id":"nm2030556"},{"name":"Griffin Hood","id":"nm2032510"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NzE0ODIwMV5BMl5BanBnXkFtZTcwMzY5Mjg3OA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Comedy","Crime"],"plot":"After her ex-husband Carlos shoots Celeste three times in the gut, it's time to play dirty. In the fight for her godson, Rob, she hires three outlawed and redneck brothers to bring him back to her. But nothing can be that simple in the South. What begins as a small rescue mission rises to a southern battle royal. This odd team must shoot their way through gorgeous female assassins, Native American hunters, Federal agents, and a whole lot of metal coming after them, while protecting Celeste's innocent child.","simplePlot":"When three redneck brothers agree to help a woman save her godson from an abusive stepfather, they become targets on the run from an odd cast of characters.","actors":[{"actorName":"Clayne Crawford","urlProfile":"http://www.imdb.com/name/nm0186728","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMDY5ODQ5M15BMl5BanBnXkFtZTgwMzM2NzIzODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1978","placeOfBirth":" Clay, Alabama, USA","height":"6' (1.83 m)","bio":"Clayne Crawford was born on April 20, 1978 in Clay, Alabama, USA. He is an actor and director, known for A Walk to Remember (2002), Wristcutters: A Love Story (2006) and The Perfect Host (2010). He is married to Sunshine Kiki Brown.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMDY5ODQ5M15BMl5BanBnXkFtZTgwMzM2NzIzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0186728","name":"Clayne Crawford","idIMDB":"nm0186728"},"actorId":"nm0186728","character":"Brick Oodie","urlCharacter":"http://www.imdb.com/character/ch0397131","main":true},{"actorName":"Travis Fimmel","urlProfile":"http://www.imdb.com/name/nm1379938","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU0NjU0NzczN15BMl5BanBnXkFtZTcwMTc3MjMyOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1979","placeOfBirth":" nr. Echuca, Victoria, Australia","height":"6' (1.83 m)","bio":"Travis Fimmel was born near Echuca, Victoria, Australia, to Jennie, a recreation officer for the disabled, and Chris, a cattle farmer. He was raised on a 5500-acre farm located between Melbourne and Sydney. Until the age of seventeen, his life was spent at school and working on the family farm, morning and night-something he continues to relish on his trips back home. After high school, higher education called and he was accepted to Melbourne University. It was not long until his intense curiosity led him to begin his global adventures. While bar-tending in London, giving away almost as much beer as he sold, he met his would-be manager, David Seltzer. David saw a spark in Travis and suggested he move to the United States to become an actor and nurture his talent. Easily enticed by the arts, it was not long before Travis made the move to Los Angeles, and within a week began studying with renowned acting coach Ivana Chubbuck. The teaching veteran, in addition to Travis, has mentored Jake Gyllenhaal, Eva Mendes, Halle Berry, Brad Pitt and Charlize Theron. Years of struggling and hard work continue to pay off and Travis has chalked up starring roles in several projects including Rocky Point (with Lauren Holly), Southern Comfort (with Madeleine Stowe and Eric Roberts), Restraint (with True Blood's Stephen Moyer), Ivory (with Martin Landau and Peter Stomare), Surfer Dude (with Matthew McConaughey and Woody Harrelson), and AE's The Beast (with Patrick Swayze). Production has taken Travis all over the world but, between roles, he travels back to his family's farm as much as possible. Travis is quick to point out that it is his love for Australian Rules (AKA \"No\" Rules) Football, the countryside, his two older brothers, and a hard working lifestyle that keeps his feet firmly planted on the ground.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU0NjU0NzczN15BMl5BanBnXkFtZTcwMTc3MjMyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1379938","name":"Travis Fimmel","nicknames":["Rangi"],"idIMDB":"nm1379938"},"actorId":"nm1379938","character":"McQueen Oodie","urlCharacter":"http://www.imdb.com/character/ch0397130","main":true},{"actorName":"Daniel Cudmore","urlProfile":"http://www.imdb.com/name/nm1214436","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MTM4OTI4OF5BMl5BanBnXkFtZTgwNjMwNzEwMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1981","placeOfBirth":" Squamish, British Columbia, Canada","height":"6' 6¾\" (2 m)","bio":"Born in Vancouver and raised in Squamish, British Columbia, Daniel grew up in an athletic household. The middle of three boys, Daniel excelled at a number of different sports including ski racing, snowboarding, football and rugby. However, in addition to his vast interest in athletics, Daniel always had a passion for the arts. He took drama classes and performed in school and local theatre productions while his athleticism earned him a Football Scholarship to Gannon University. Unfortunately, his sports career was cut short due to a devastating injury while on the field. It was at this crucial crossroad that Daniel decided to move back to Vancouver and focus his attention on his other passion, acting. Daniel's breakout role came shortly after he made the transition from college star to actor, when Bryan Singer cast him alongside Patrick Stewart, Hugh Jackman, Sir Ian McKellen, and Halle Berry in the superhero film X-Men 2 (2003), as Colossus, the strongest member of the X-Men team. Daniel's character was brought back in the film's sequel X-Men: L'affrontement final (2006). He has since showcased his extraordinary talents on numerous television shows including Stargate SG-1 (1997), Supernatural (2005), and Psych (2006). However, it is Daniel's role as Felix in the popular Summit Entertainment film franchise The Twilight Saga that has given this actor international recognition. Off screen, Daniel has the same strength and physicality as his well-known characters. A glorified outdoorsman, this 6'6'' actor spends a great deal of time enjoying recreational activities including skiing, snowboarding, riding motor bikes and motor cycles, mountain biking and is a huge supporter of the Canadian National Rugby team, where his brother Jaime plays as a forward. Daniel has appeared in blockbuster films from hit series: The Twilight Saga and X-Men. Next up, see him reprise his role as Felix, the all-powerful Volturi guard in The Twilight Saga: New Moon (2009) and The Twilight Saga: Eclipse (2010), as he is once again bringing the larger than life character to the big screen in the last two installments of the Saga, The Twilight Saga: Breaking Dawn - Part 1 (2011) and The Twilight Saga: Breaking Dawn - Part 2 (2012). Additionally, Daniel has a leading role in the independent thriller Rites of Passage (2012). He shares the screen with seasoned actors Christian Slater, Stephen Dorff and Wes Bentley in the film about a young anthropology student seeking a traditional ceremony to mark his entry into manhood. He also has a role in the highly anticipated drama The Baytown Outlaws (2012) alongside Billy Bob Thornton, Paul Wesley and Eva Longoria. The movie, which was on the 2009 \"Black List\" of Hollywood's best unproduced movie projects, is about a federal agent who comes into a small Southern town to investigate the Oodies - three redneck brothers who get more than they bargained for after agreeing to help a woman get her son back from his seemingly abusive father.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MTM4OTI4OF5BMl5BanBnXkFtZTgwNjMwNzEwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1214436","name":"Daniel Cudmore","idIMDB":"nm1214436"},"actorId":"nm1214436","character":"Lincoln Oodie","urlCharacter":"http://www.imdb.com/character/ch0397132","main":true},{"actorName":"Thomas Brodie-Sangster","urlProfile":"http://www.imdb.com/name/nm1032473","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4OTUyMzY0OV5BMl5BanBnXkFtZTcwMTEyMTUwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1990","placeOfBirth":" London, England, UK","birthName":"Thomas Brodie Sangster","height":"5' 10½\" (1.79 m)","bio":"Thomas Brodie-Sangster was born on May 16, 1990 in London, England as Thomas Brodie Sangster. He is an actor and producer, known for Phineas and Ferb (2007), The Maze Runner (2014) and Maze Runner: The Scorch Trials (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4OTUyMzY0OV5BMl5BanBnXkFtZTcwMTEyMTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1032473","name":"Thomas Brodie-Sangster","idIMDB":"nm1032473"},"actorId":"nm1032473","character":"Rob","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adrian Spurlock","urlProfile":"http://www.imdb.com/name/nm4682080","urlPhoto":"","biography":{"bio":"Adrian Spurlock is an actor and director, known for The Baytown Outlaws (2012), Voice on the Phone (2012) and Breakout Kings (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4682080","name":"Adrian Spurlock","idIMDB":"nm4682080"},"actorId":"nm4682080","character":"EMT","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Billy Bob Thornton","urlProfile":"http://www.imdb.com/name/nm0000671","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxOTUwMDI0OF5BMl5BanBnXkFtZTcwNjIyNzkzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 August 1955","placeOfBirth":" Hot Springs, Arkansas, USA","birthName":"William Robert Thornton","height":"5' 10\" (1.78 m)","bio":"Billy Bob Thornton was born on August 4, 1955 in Hot Springs, Arkansas, to Virginia Roberta (Faulkner), a psychic, and William Raymond (Billy Ray) Thornton, an educator, high school history teacher, and basketball coach (now deceased). He is the older brother of James Donald (Jimmy Don) (born in 1958 and now deceased) and John David (born in 1969). He has been married six times and has four children: daughter Amanda Brumfield, with Melissa Lee Gatlin (now Parish); sons William and Harry, both with Pietra Dawn Cherniak; and daughter Bella with Connie Angland. Billy Bob began his artistic career as a musician, playing drums and singing in a band called Tres Hombres, which once opened for Hank Williams Jr.. In 1981, he moved to Los Angeles with childhood friend Tom Epperson to pursue an acting and writing career. On the side, Billy Bob also sought work as a singer and drummer. He and Epperson tried for years to sell their scripts but no one was buying. During those rough times, Billy Bob neglected his health and subsequently landed in the hospital with heart problems due to malnutrition. In 1992, Billy Bob starred in One False Move (1992), a movie he co-wrote with Epperson. The team finally received attention because of this work, which was very well received in Hollywood. His popularity increased steadily, especially after Sling Blade (1996) which he wrote, directed and in which he starred.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxOTUwMDI0OF5BMl5BanBnXkFtZTcwNjIyNzkzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000671","name":"Billy Bob Thornton","idIMDB":"nm0000671"},"actorId":"nm0000671","character":"Carlos","urlCharacter":"http://www.imdb.com/character/ch0397113","main":true},{"actorName":"Eva Longoria","urlProfile":"http://www.imdb.com/name/nm0519456","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MTE1NjMwOV5BMl5BanBnXkFtZTgwODg2MzUwMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 March 1975","placeOfBirth":" Corpus Christi, Texas, USA","birthName":"Eva Jacqueline Longoria","height":"5' 2\" (1.57 m)","bio":"Eva Longoria was born in Corpus Christi, Texas, to Ella Eva (Mireles) and Enrique Longoria, Jr. The youngest of four sisters who grew up on a ranch near Corpus Christi, Longoria attended Texas A&M University-Kingsville, where she received a Bachelor of Science degree in Kinesiology. After graduating from college, she entered a talent contest that brought her to Los Angeles, where she was spotted and subsequently signed by a theatrical agent. After landing roles on Amour, gloire et beauté (1987), General Hospital (1963) and co-starring on Beverly Hills, 90210 (1990), she auditioned for and won the role of \"Isabella\" on the popular series, The Young and the Restless (1973). After Y&R, Eva Longoria became well known worldwide thanks to Desperate Housewives (2004) where she plays adulteress \"Gabrielle Solis\". She also has a contract with L'Oreal and has been named one of the most beautiful people. A passionate advocate of education she founded The Eva Longoria Foundation which helps Latinas build better futures for themselves and their families through education and entrepreneurship and earned a Masters in Chicano Studies presenting her thesis on \"Success STEMS From Diversity: The Value of Latinas in STEM Careers.\" Eva has also contributed writing to publications on the subject of education.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MTE1NjMwOV5BMl5BanBnXkFtZTgwODg2MzUwMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0519456","name":"Eva Longoria","idIMDB":"nm0519456"},"actorId":"nm0519456","character":"Celeste","urlCharacter":"http://www.imdb.com/character/ch0390180","main":true},{"actorName":"Andre Braugher","urlProfile":"http://www.imdb.com/name/nm0105672","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyNTIwOTY5N15BMl5BanBnXkFtZTcwMTE2NzU3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1962","placeOfBirth":" Chicago, Illinois, USA","birthName":"Andre K. Braugher","height":"6' (1.83 m)","bio":"Andre Braugher was born on July 1, 1962 in Chicago, Illinois, USA as Andre K. Braugher. He is an actor and producer, known for Homicide: Life on the Street (1993), The Mist (2007) and La cité des anges (1998). He has been married to Ami Brabson since December 28, 1991. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyNTIwOTY5N15BMl5BanBnXkFtZTcwMTE2NzU3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0105672","name":"Andre Braugher","idIMDB":"nm0105672"},"actorId":"nm0105672","character":"Millard","urlCharacter":"http://www.imdb.com/character/ch0397112","main":true},{"actorName":"Michael Rapaport","urlProfile":"http://www.imdb.com/name/nm0001650","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NTQ0NTI1M15BMl5BanBnXkFtZTcwMjEwNTA3OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1970","placeOfBirth":" New York City, New York, USA","birthName":"Michael David Rapaport","height":"6' 2½\" (1.89 m)","bio":"A true New Yorker through and through, Michael Rapaport was born in Manhattan, to June Brody, a radio personality, and David Rapaport, a radio program manager. He is of Polish Jewish and Russian Jewish descent. Rapaport moved to Los Angeles to try stand-up comedy following high school graduation (which came after a series of expulsions), but he never lost, forgot nor deserted his New York roots. It's embedded in his work and is a major part of his low-keyed charm and ongoing appeal. His early idols were also New Yorkers (Robert De Niro, Christopher Walken, etc.). He toiled only briefly in L.A. Within a short amount of time Michael moved from the live comedy stage to working in front of a camera. The two developed an immediate rapport. A guest spot on the TV series China Beach (1988) led to a starring role in the quirky interracial indie Zebrahead (1992), which clinched it for him. This, in turn, led to a string of standout parts in films, such as Christian Slater's pal in True Romance (1993), an edgy collegiate-turned-skinhead in Higher Learning (1995) and a sympathetic none-too-bright boxer in Woody Allen's Mighty Aphrodite (1995), all enabling him to build up a higher profile. In later years he managed to show his ease at offbeat comedy, demonstrating a kid-like, goofy charm as Lisa Kudrow's cop boyfriend for a few episodes on Friends (1994) and as teacher Danny Hanson on Boston Public (2000). Lately he has formed his own production company, Release Entertainment, in search of that one big breakout role that could nab top stardom for him. Rapaport married writer Nicole Beatty in 2000, and they have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NTQ0NTI1M15BMl5BanBnXkFtZTcwMjEwNTA3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001650","name":"Michael Rapaport","idIMDB":"nm0001650"},"actorId":"nm0001650","character":"Lucky","urlCharacter":"http://www.imdb.com/character/ch0397111","main":true},{"actorName":"Paul Wesley","urlProfile":"http://www.imdb.com/name/nm0913587","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NTA1OTUwN15BMl5BanBnXkFtZTgwNjQ2NDAzODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1982","placeOfBirth":" New Brunswick, New Jersey, USA","birthName":"Paul Thomas Wasilewski","height":"5' 11\" (1.8 m)","bio":"Paul was raised in the Marlboro, New Jersey. His parents immigrated from Poland, where he spent a large portion of his childhood. Many of his relatives still reside there. During his high school years, Paul was actively involved in theater studies, primarily in New York City. He attended Christian Brothers Academy, Marlboro High School, and Lakewood Prep. He was expelled from the first school for getting into fights. Whilst his junior year he landed the role of Max in Guiding Light (1952). Due to his acting schedule, he transferred to several schools. He ultimately graduated in 2000 and went on to Rutgers University but, because he was being offered roles, decided to quit after one semester. In 2009 he was cast in The Vampire Diaries (2009). He auditioned for both the roles of Damon, the bad vampire brother, and Stefan, the good vampire brother. It was ultimately decided he would work better as Stefan. He resides in Los Angeles, New York City, and Atlanta, where he continues filming as well as directing 'The Vampire Diaries'.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NTA1OTUwN15BMl5BanBnXkFtZTgwNjQ2NDAzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0913587","name":"Paul Wesley","idIMDB":"nm0913587"},"actorId":"nm0913587","character":"Reese","urlCharacter":"http://www.imdb.com/character/ch0384615","main":true},{"actorName":"Zoë Bell","urlProfile":"http://www.imdb.com/name/nm1057928","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNzk4MjQ4MF5BMl5BanBnXkFtZTcwMTQwOTMzOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1978","placeOfBirth":" Waiheke Island, Auckland, New Zealand","height":"5' 8\" (1.73 m)","bio":"As an established and extremely talented stunt double and actress, Zoe Bell has made a name for herself through her unparalleled dedication, skills, and focus. Zoe Bell was born on Waiheke Island, New Zealand, to Tish, a nurse, and Andrew Bell, a doctor. She has a background in gymnastics and martial arts. She began working as a stunt woman when she doubled Lucy Lawless on the cult favorite TV series Xena: Warrior Princess (1995). Bell also appeared as a double in the ABC thriller Alias (2001) and on an episode of Cleopatra 2525 in 2000 as a double for Vicki Pratti. In the action packed-documentary Double Dare (2004), Bell, along with legendary stunt-woman Jeannie Epper, give an insight into the career of women who take falls and punches for a living. Double Dare also gives a glimpse into the struggles of stunt-women to stay thin, employed, and sane in a male-dominated career. After the cancellation of Alias, Bell's next gig was working with Quentin Tarantino in Kill Bill: Vol. 1 (2003) and Kill Bill: Vol. 2 (2004), playing the stunt double for Uma Thurman's role, The Bride. Bell was nominated for her work in Kill Bill, Vol. 1 in the categories of Best Stunt by a Stunt Woman and Best Fight for the Taurus World Stunt Awards, both of which she would win the following year for Kill Bill: Vol. 2. Bell also showed off her stunt-woman skills as a double for Sharon Stone in Halle Barry's Catwoman (2004). Bell was injured in the final days of filming, requiring surgery, but she has since recovered and returned to work. Bell appeared along with legendary stunt woman Jeannie Epper in Amanda Micheli's acclaimed documentary Double Dare (2004), which offers a glimpse at the lives and careers of both women, as well as the friendship they share. Bell debuted her acting career, with her already famous stunt skills, in the double feature Grindhouse (2007) written by Quentin Tarantino and Robert Rodriguez. She was hand-picked, by Tarentino himself, to star in his segment of the double feature, Death Proof, about four women working on the movie set of their next big hit. All seems to be going well on set until a psychotic killer begins to stalk them. Bell, a native of New Zealand, resides in Los Angeles but hopes to someday own a home in New Zealand.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNzk4MjQ4MF5BMl5BanBnXkFtZTcwMTQwOTMzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1057928","name":"Zoë Bell","nicknames":["Zoe the Cat"],"idIMDB":"nm1057928"},"actorId":"nm1057928","character":"Rose","urlCharacter":"http://www.imdb.com/character/ch0397110","main":true},{"actorName":"Julio Oscar Mechoso","urlProfile":"http://www.imdb.com/name/nm0575339","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMjYzMTg3OF5BMl5BanBnXkFtZTYwNjgzNjE1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1955","placeOfBirth":" Florida, USA","bio":"Julio Oscar Mechoso was born on May 31, 1955 in Florida, USA. He is an actor, known for Little Miss Sunshine (2006), The Legend of Zorro (2005) and Jurassic Park III (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMjYzMTg3OF5BMl5BanBnXkFtZTYwNjgzNjE1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0575339","name":"Julio Oscar Mechoso","idIMDB":"nm0575339"},"actorId":"nm0575339","character":"Padre","urlCharacter":"http://www.imdb.com/character/ch0397109","main":true},{"actorName":"Damien Moses","urlProfile":"http://www.imdb.com/name/nm4490301","urlPhoto":"","biography":{"bio":"Damien Moses is an actor, known for The Baytown Outlaws (2012), Arachnoquake (2012) and Carter & June.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4490301","name":"Damien Moses","idIMDB":"nm4490301"},"actorId":"nm4490301","character":"Montane","urlCharacter":"http://www.imdb.com/character/ch0397108","main":true},{"actorName":"Nito Larioza","urlProfile":"http://www.imdb.com/name/nm1045914","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NjkzOTQwNF5BMl5BanBnXkFtZTcwNTIxMTA1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1971","placeOfBirth":" Wahiawa, Hawaii, USA","height":"5' 7\" (1.7 m)","bio":"Nito Larioza was born on February 21, 1971 in Wahiawa, Hawaii, USA. He is known for his work on Inception (2010), The Dark Knight Rises (2012) and Avatar (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NjkzOTQwNF5BMl5BanBnXkFtZTcwNTIxMTA1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1045914","name":"Nito Larioza","idIMDB":"nm1045914"},"actorId":"nm1045914","character":"Tucker","urlCharacter":"http://www.imdb.com/character/ch0397107","main":true},{"actorName":"Bill Perkins","urlProfile":"http://www.imdb.com/name/nm2645116","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MDkxNzM4M15BMl5BanBnXkFtZTcwNDAwODM3Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Bill Perkins is a producer and actor, known for After.Life (2009), Unthinkable (2010) and The Baytown Outlaws (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MDkxNzM4M15BMl5BanBnXkFtZTcwNDAwODM3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2645116","name":"Bill Perkins","idIMDB":"nm2645116"},"actorId":"nm2645116","character":"Mewes","urlCharacter":"http://www.imdb.com/character/ch0397106","main":true}],"seasons":[],"idIMDB":"tt1836944","urlIMDB":"http://www.imdb.com/title/tt1836944","business":{"budget":{"money":"$4,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"02","month":"05","year":"2011","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 38 min (98 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Red One Camera"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.4","metascore":"33","filmingLocations":[{"location":"Louisiana, USA"}],"rated":"R","awards":[{"award":"Motion Picture Sound Editors, USA 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing - Direct to Video - Live Action","names":[{"name":"Eric Lalicata","id":"nm1300497","role":"supervising sound editor"},{"name":"Ryan Gegenheimer","id":"nm3271421","role":"sound designer"},{"name":"Jeremy B. Davis","id":"nm3691156","role":"sound designer"},{"name":"Shaun Cunningham","id":"nm1472369","role":"supervising foley editor"},{"name":"Tom Boykin","id":"nm3181581","role":"supervising dialogue editor"},{"name":"Tara Blume","id":"nm2817356","role":"foley artist"}]}]}]}],"votes":"11,618","type":"Movie","companyCreditsSimple":[{"idCompany":"co0250136","name":"Lleju Productions"},{"idCompany":"co0068765","name":"State Street Pictures"}],"keywords":{"keywords":["fight","neck breaking","female gang","mute","dead woman with eyes open","camera focus on female butt","woman with gun","woman shot","woman stabbed","woman's neck broken","female biker","biker gang","brother brother relationship","gunfight","shootout","police shootout","bar shootout","gas station","chase","midnight movie","painted face","cult film","hit in the crotch","girl gang","handcuffs","brawl","anti hero","face paint","bar fight","fistfight","violence","police","murder","street gang","warrior"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:31:50"}}