{"data":{"movies":[{"title":"Opération Casse-noisette","originalTitle":"The Nut Job","year":"2014","releaseDate":"20140117","directors":[{"name":"Peter Lepeniotis","id":"nm0503259"}],"writers":[{"name":"Lorne Cameron","id":"nm0131661"},{"name":"Peter Lepeniotis","id":"nm0503259"}],"runtime":"85 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NjAxMDUzN15BMl5BanBnXkFtZTgwOTE5NDM3MDE@._V1.jpg","countries":["Canada","South Korea","USA"],"languages":["English","Dutch"],"genres":["Animation","Adventure","Comedy","Family"],"plot":"In a city park, Surly the Squirrel has finally gone too far with his latest caper leading to the animal community's winter food cache being destroyed. Now exiled, Surly and his rat buddy Buddy's collective nightmare on the streets ends when they discover a nut store to raid. Meanwhile, the squirrels, the heroic Andie and the ditsy Grayson, are charged by Raccoon to find a new food source and Andie runs into Surly. With no other options, she arranges a deal to help in Surly's heist for the colony, even while Surly fully intends to betray it. However, there is more going on with the nut store being a front for bank robbers while Raccoon has his own agenda to ensure his own power. In the mayhem to come, Surly finds himself challenged in ways he never expected and discovering the real prize to treasure in this adventure.","simplePlot":"An incorrigibly self-serving exiled squirrel finds himself helping his former park brethren raid a nut store to survive, that is also the front for a human gang's bank robbery.","actors":[{"actorName":"Will Arnett","urlProfile":"http://www.imdb.com/name/nm0004715","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDkzMjEzNDMyN15BMl5BanBnXkFtZTcwNTk3ODEyOQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 May 1970","placeOfBirth":" Toronto, Ontario, Canada","birthName":"William Emerson Arnett","height":"6' 2½\" (1.89 m)","bio":"Will Arnett is a Canadian-American actor, voice actor, and comedian. He played George Oscar \"Gob\" Bluth II in the Fox series, Arrested Development (2003). He also appeared in films, such as The Lego Movie (2014), Teenage Mutant Ninja Turtles (2014), Teenage Mutant Ninja Turtles: Out of the Shadows (2016) and The LEGO Batman Movie (2017). Arnett also voices the title character of Netflix's original animated series, BoJack Horseman (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDkzMjEzNDMyN15BMl5BanBnXkFtZTcwNTk3ODEyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004715","name":"Will Arnett","idIMDB":"nm0004715"},"actorId":"nm0004715","character":"Surly","urlCharacter":"http://www.imdb.com/character/ch0396717","main":true},{"actorName":"Brendan Fraser","urlProfile":"http://www.imdb.com/name/nm0000409","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MjExMzY0M15BMl5BanBnXkFtZTgwNTMxOTg4MTI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1968","placeOfBirth":" Indianapolis, Indiana, USA","birthName":"Brendan James Fraser","height":"6' 3\" (1.91 m)","bio":"Brendan James Fraser was born in Indianapolis, Indiana, to Canadian parents Carol Mary (Genereux), a sales counselor, and Peter Fraser, a journalist and travel executive. He is of Irish, Scottish, German, Czech, and French-Canadian ancestry. As his parents frequently moved, Brendan can claim affinity with Ottawa, Indianapolis, Detroit, Seattle, London and Rome. His early exposure to theatre, particularly in London, led him to Seattle's Cornish Institute. After graduation he found a minor role as Sailor #1 in River Phoenix's Dogfight (1991), then somewhat more substantial roles in Encino Man (1992) and School Ties (1992). He expresses a preference for playing \"fish out of water\" men. Five more years of supporting work led finally to the title role in George of the Jungle (1997), a role which fully utilized his charm and beefy good looks, as well as offering him a chance to show off his comic talents. He describes this role as the one which dramatically altered his career. Critical raves for his role in Gods and Monsters (1998) pointed to yet another dimension to his dramatic persona.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MjExMzY0M15BMl5BanBnXkFtZTgwNTMxOTg4MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000409","name":"Brendan Fraser","idIMDB":"nm0000409"},"actorId":"nm0000409","character":"Grayson","urlCharacter":"http://www.imdb.com/character/ch0396719","main":true},{"actorName":"Liam Neeson","urlProfile":"http://www.imdb.com/name/nm0000553","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MTQ3NzU1MV5BMl5BanBnXkFtZTgwMDE3Mjg0MzE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1952","placeOfBirth":" Ballymena, Co. Antrim, Northern Ireland, UK","birthName":"William John Neeson","height":"6' 4\" (1.93 m)","bio":"Liam Neeson was born on June 7, 1952 in Ballymena, Northern Ireland, UK, to Katherine (Brown), a cook, and Bernard Neeson, a school caretaker. Liam worked as a forklift operator for Guinness, truck driver, assistant architect and an amateur boxer. He had originally sought a career as a teacher by attending St. Mary's Teaching College, Newcastle. However, in 1976, Neeson joined the Belfast Lyric Players' Theater and made his professional acting debut in the play \"The Risen People\". After two years, Neeson moved to Dublin's Abbey Theater where he performed the classics. It was here that he was spotted by director John Boorman and was cast in the film Excalibur (1981) as Sir Gawain, his first high-profile film role. Through the 1980s Neeson appeared in a handful of films and British TV series - including The Bounty (1984), A Woman of Substance (1984), The Mission (1986), and Duet for One (1986) - but it was not until he moved to Hollywood to pursue larger roles that he began to get noticed. His turn as a mute homeless man in Suspect (1987) garnered good reviews, as did supporting roles in The Good Mother (1988) and High Spirits (1988) - though he also starred in the best-to-be-forgotten Satisfaction (1988), which also featured a then-unknown Julia Roberts - but leading man status eluded him until the cult favorite Darkman (1990), directed by Sam Raimi. From there, Neeson starred in Under Suspicion (1991) and Ethan Frome (1993), was hailed for his performance in Woody Allen's Husbands and Wives (1992), and ultimately was picked by Steven Spielberg to play Oskar Schindler in Schindler's List (1993). The starring role in the Oscar-winning Holocaust film brought Neeson Academy Award, BAFTA and Golden Globe nominations for Best Actor. Also in 1993, he made his Broadway debut with a Tony-nominated performance in \"Anna Christie\", in which he co-starred with his future wife Natasha Richardson. The next year, the two also starred opposite Jodie Foster in the movie Nell (1994), and were married in July of that year. Leading roles as the 18th century Scottish Highlander Rob Roy (1995) and the Irish revolutionary leader Michael Collins (1996) followed, and soon Neeson was solidified as one of Hollywood's top leading men. He starred in the highly-anticipated Star Wars: Episode I - The Phantom Menace (1999) as Qui-Gon Jinn, received a Golden Globe nomination for Kinsey (2004), played the mysterious Ducard in Christopher Nolan's Batman Begins (2005), and provided the voice for Aslan in The Chronicles of Narnia: The Lion, the Witch and the Wardrobe (2005). Neeson found a second surprise career as an action leading man with the release of Taken (2008) in early 2009, an unexpected box office hit about a retired CIA agent attempting to rescue his daughter from being sold into prostitution. However, less than two months after the release of the film, tragedy struck when Richardson suffered a fatal head injury while skiing and passed away days afterward. Neeson returned to high-profile roles in 2010 with two back-to-back big-budget films, Clash of the Titans (2010) and The A-Team (2010), and returned to the action genre with Unknown (2011), The Grey (2011), Battleship (2012) and Taken 2 (2012), as well as the sequel La colère des Titans (2012). Neeson was awarded Officer of the Order of the British Empire in the 1999 Queen's New Year's Honours List for his services to drama. He has two sons from his marriage to Richardson: Micheal Richard Antonio Neeson (born June 22, 1995) and Daniel Jack Neeson (born August 27, 1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MTQ3NzU1MV5BMl5BanBnXkFtZTgwMDE3Mjg0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000553","name":"Liam Neeson","idIMDB":"nm0000553"},"actorId":"nm0000553","character":"Raccoon","urlCharacter":"http://www.imdb.com/character/ch0396720","main":true},{"actorName":"Katherine Heigl","urlProfile":"http://www.imdb.com/name/nm0001337","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM0NDEwMjA1MV5BMl5BanBnXkFtZTcwMzQxMDI3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 November 1978","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Katherine Marie Heigl","height":"5' 9\" (1.75 m)","bio":"Katherine Marie Heigl was born on November 24, 1978 in Washington, D.C., to Nancy Heigl (née Engelhardt), a personnel manager, and Paul Heigl, an accountant and executive. Her father is of German/Swiss-German and Irish descent, and her mother is of German ancestry. A short time after her birth, the family moved to New Canaan, Connecticut, where Katherine was to spend the majority of her childhood; the youngest member of her family, Katherine--or \"Katie\" as she is nicknamed--has two elder siblings, John and Meg. Tragically, her older brother Jason died in 1986 of brain injuries suffered in a car accident, after being thrown from the back of a pickup truck. When doctors determined he was brain-dead, the family made the difficult decision to donate his organs. Not only did this painful chapter give Katherine a greater perspective and appreciation for life, but it motivated her to use her celebrity to promote the importance of organ donation. Katherine was first thrust into the limelight as a child model. An aunt, visiting the family in New Canaan, took a number of photographs of Katherine, then aged nine, in a series of poses to advertise a hair care product she had invented. Upon returning to New York, with permission from Katherine's parents, she sent the photos to a number of modeling agencies. Within a few weeks, Katherine had been signed to Wilhelmina, a renowned international modeling agency. Almost immediately, she made her debut in a magazine advertisement and soon followed this with an inaugural television appearance in a national commercial for Cheerios breakfast cereal. Following a number of commercials and modeling assignments for Sears and Lord & Taylor, she made her big-screen debut in That Night (1992), which starred Juliette Lewis and C. Thomas Howell. It was then that she realized that acting rather than modeling was her passion. In 1993, Katherine appeared in Steven Soderbergh's critically-acclaimed Depression-era drama, King of the Hill (1993), before landing her first leading role as a rebellious teenager, alongside Gérard Depardieu, in My father, ce héros (1994). During this time, Katherine continued to attend New Canaan High School, balancing her academic studies with work on films and modeling, which she undertook during holidays, vacations and weekends. In 1995, she played \"Sarah Ryback\", the niece of Steven Seagal's character, in Under Siege 2: Dark Territory (1995), which was her \"debut\" in the action film genre. Acting was now becoming a stronger focus for Katherine, although she still modeled extensively, appearing regularly in magazines such as \"Seventeen\". Television appearances on The Tonight Show with Jay Leno (1992) and Late Night with Conan O'Brien (1993) soon followed, before she took the lead role in Disney's Wish Upon a Star (1996) in 1996. It was also during that year that Katherine's parents divorced and, following her graduation from high school in 1997, she moved with her mother into a four-bedroom house in Los Angeles' Malibu Canyon area. This enabled her to focus upon acting with the guidance and support of her mother, who now managed her career. In 1997, Katherine portrayed \"Taffy Entwhistle\", Rita Hayworth's stand-in, in Stand-ins (1997) and was also cast as the beauteous \"Princess Ilene\" in the European production, Prince Valiant (1997). She then made her made-for-TV movie debut, co-starring with Peter Fonda in a re-working of the classic Shakespearean play, The Tempest (1998), updated with an American Civil War theme. In this film, she played \"Miranda Prosper\", a young woman torn between her love for both her father and a Union soldier. Bug Buster (1998) and La fiancée de Chucky (1998) represented a venture into the horror genre for Katherine. While both films could be described as rather tongue-in-cheek despite their gory emphases, La fiancée de Chucky (1998) was the better received, both critically and commercially. In 1999, Katherine decided to branch out into series television when she accepted the role of the haughty, yet vulnerable, \"Isabel Evans\", on Roswell (1999), a show that blended teen angst with sci-fi drama. Though she had never planned to embark on a career in television, the role of Isabel, a teenager with a secret life, was an offer she found impossible to refuse. In the series, Isabel, her brother Max (Jason Behr) and their friend Michael (Brendan Fehr) are aliens passing as humans in Roswell, New Mexico, as they desperately try to hide the truth from government agencies, the people of Roswell and even their own adopted families. To publicize her role on the show, Katherine graced the covers of magazines such as \"TV Guide\", \"Maxim\" and \"Teen\" and was interviewed on Later (1994) and The Late Late Show with Craig Kilborn (1999). Along with her mother Nancy, she also appeared in an episode of the Sci-Fi TV talk show, Crossing Over with John Edward (1999), during which she spoke with John Edward, a psychic medium, about her late brother, Jason. During the three years Roswell (1999) was in production, Katherine found time to work on several movies. 100 Girls (2000), an independent film released in 2001, is the story of a college freshman who meets the girl of his dreams in an elevator during a blackout, and spends the rest of the movie trying to find her again. Her cameo role is that of Arlene, the competitive tomboy. The second film, Valentine (2001), a horror film starring David Boreanaz and Denise Richards, appeared in U.S. theaters on February 2, 2001. In this movie, which is based upon the 1996 novel by Tom Savage, Katherine plays \"Shelley\", a medical student who meets a sudden demise. In the spring of 2001, Katherine accepted a role in NBC's Critical Assembly (2002), a two-hour original television thriller. Katherine and Kerr Smith (Dawson's Creek (1998)) co-starred as brilliant and politically concerned college students who build a nuclear device to illustrate the need for a change in national priorities, but are betrayed by a fellow student when the bomb ends up in the hands of a terrorist. Unfortunately, the telefilm, directed by Eric Laneuville, written by Tom Vaughan, and based on the best-seller \"The Seventh Power\" by James Mills, was shelved when its storyline was deemed too close for comfort to the events of September 11, 2001. It was eventually broadcast in 2003. Since the cancellation of Roswell (1999) in the spring of 2002, Katherine has been busy with various projects, including an appearance on UPN's update of the classic television series, La treizième dimension (2002). That episode, entitled La treizième dimension: Cradle of Darkness (2002), aired on October 2, 2002, and featured Katherine in the role of a woman who goes back in time to stop one of the most notorious murders in history. In addition, she completed a movie, Descendant (2003), a psychological thriller inspired by Edgar Allan Poe's \"The Fall of the House of Usher\". She has also starred as \"Romy\" in ABC/Touchstone's two-hour telepic, Romy and Michele: In the Beginning (2005), a prequel to the 1997 feature, Romy and Michele's High School Reunion (1997). During the summer of 2002, Katherine made a major decision in the direction of her career when she signed on for representation in all areas with the William Morris Agency, one of the biggest and most prestigious agencies in the entertainment industry. She is now being represented by Norman Aladjem at Paradigm Agency and being managed by Nancy Heigl and Stephanie Simon and Jason Newman at Untitled Entertainment.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM0NDEwMjA1MV5BMl5BanBnXkFtZTcwMzQxMDI3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001337","name":"Katherine Heigl","nicknames":["Katie"],"idIMDB":"nm0001337"},"actorId":"nm0001337","character":"Andie","urlCharacter":"http://www.imdb.com/character/ch0396718","main":true},{"actorName":"Stephen Lang","urlProfile":"http://www.imdb.com/name/nm0002332","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NzYwNTc5Nl5BMl5BanBnXkFtZTcwMzQzOTUyNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1952","placeOfBirth":" New York City, New York, USA","height":"5' 10½\" (1.79 m)","bio":"A stage actor of great recognition, Stephen Lang has shaped a formidable career on and off the various stages of the United States and abroad. Though he is arguably most well-known for his acclaimed performance in James Cameron's Avatar (2009), Lang began his career in theater. Broadway roles include his Tony-nominated performance as Lou in \"The Speed of Darkness\", Happy in the Dustin Hoffman revival of \"Death of a Salesman\", Colonel Jessep in \"A Few Good Men\", and Mike Tallman alongside Quentin Tarantino and Marisa Tomei in \"Wait Until Dark\". Off-Broadway credits include John Patrick Shanley's \"Defiance\", Anne Nelson's \"The Guys\", Arthur Miller's \"Finishing the Picture\" and his own play, \"Beyond Glory\", for which he received numerous accolades. The play premiered in Washington, D.C. and has played the Goodman Theatre in Chicago, the Roundabout in New York City and a USO tour to various military bases and battleships around the world. In the fall of 2010, Lang received the Patriot Award from the Medal of Honor Society in honor of his theatrical and charitable works for the United States military. Television and film credits include celebrated performances as Babe Ruth in Babe Ruth (1991), Stonewall Jackson in Gods and Generals (2003) as well as acclaimed performances in Last Exit to Brooklyn (1989), Tombstone (1993), Gettysburg (1993), Public Enemies (2009), The Men Who Stare at Goats (2009), Michael Mann's hit TV show Crime Story (1986) , the NBC revival of The Fugitive (2000), featuring Tim Daly, and Fox's sci-fi epic Terra Nova (2011). He has been nominated for and won numerous awards including the Grace Prize, Outer Critics Circle, Drama Desk, Helen Hayes, and Tony Awards, as well as acting prizes at 2010's VisionFest and the Buffalo Niagara Film Festival. Stephen was born in New York City, New York, to Theresa (Volmer) and Eugene Lang, a prominent businessperson and philanthropist. He is of Hungarian Jewish and Irish Catholic descent. He is married to Kristina Watson, a costume designer and teacher, with whom he has four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NzYwNTc5Nl5BMl5BanBnXkFtZTcwMzQzOTUyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002332","name":"Stephen Lang","idIMDB":"nm0002332"},"actorId":"nm0002332","character":"King","urlCharacter":"http://www.imdb.com/character/ch0452547","main":true},{"actorName":"Maya Rudolph","urlProfile":"http://www.imdb.com/name/nm0748973","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzOTQwMzAyOF5BMl5BanBnXkFtZTYwNzA1OTc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1972","placeOfBirth":" Gainesville, Florida, USA","birthName":"Maya Khabira Rudolph","height":"5' 7\" (1.7 m)","bio":"Maya Rudolph was born in Gainesville, Florida, on July 27th, 1972, to Dick Rudolph, a music producer, and soul singer Minnie Riperton. Her mother was African-American and her father is Ashkenazi Jewish (from a family from Lithuania, Russia, Germany, and Hungary). In 1973, Maya, her parents, and her older brother, Marc Rudolph, moved to California to further Minnie's music career. Here Minnie recorded \"Lovin' You\", her most famous single, in which one can hear her sing \"Maya, Maya, Maya\" at the end of the song; Riperton claimed that this song was used as a lullaby for Maya. During adolescence, Maya attended St. Augustine by the Sea School, where she met childhood friend, Gwyneth Paltrow. The Paltrows and the Rudolphs became family friends and, in 2000, Dick Rudolph and Maya filled the role of music supervisors on the Bruce Paltrow-directed film Duets (2000), which starred Gwyneth. In 1990, Maya enrolled at the University of California at Santa Cruz, majoring in photography. It was here that Maya formed the band \"Supersauce\" with fellow students. After graduation in 1994, Maya left the band and soon joined The Rentals, fronted by Weezer bassist Matt Sharp. Maya was featured on the 1999 release \"Seven More Minutes\", where she sang backup vocals on \"Barcelona\" and \"My Head is in the Sun\". Maya began touring with the group, singing backup and playing Moog synthesizer. When The Rentals disbanded, Maya decided to pursue her dream of a career in comedy, joining the famed troupe \"The Groundlings\". On May 6, 2000, Maya joined the cast of Saturday Night Live (1975). and has since become one of that show's most popular performers. Favorite sketches include a dead-on impression of fashion diva Donatella Versace; high school flake \"Megan\", the host of her own morning talk show, \"Wake-up WakeField\"; and one of the members of the R&B parody \"Gemini's Twin\". In 2005, Maya gave birth to her first child with director Paul Thomas Anderson; in 2006, she was cast in the film, A Prairie Home Companion (2006), directed by the legendary Robert Altman and based on the NPR show by Garrison Keillor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzOTQwMzAyOF5BMl5BanBnXkFtZTYwNzA1OTc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0748973","name":"Maya Rudolph","idIMDB":"nm0748973"},"actorId":"nm0748973","character":"Precious","urlCharacter":"http://www.imdb.com/character/ch0409964","main":true},{"actorName":"Jeff Dunham","urlProfile":"http://www.imdb.com/name/nm0242278","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNDcxNzM3Nl5BMl5BanBnXkFtZTcwNzI5MDk4Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1962","placeOfBirth":" Dallas, Texas, USA","birthName":"Jeffrey Dunham","bio":"Jeff Dunham was born on April 18, 1962 in Dallas, Texas, USA as Jeffrey Dunham. He is an actor and writer, known for Jeff Dunham: Spark of Insanity (2007), Jeff Dunham: Arguing with Myself (2006) and Jeff Dunham's Very Special Christmas Special (2008). He has been married to Audrey Dunham since October 12, 2012. They have two children. He was previously married to Paige Dunham.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNDcxNzM3Nl5BMl5BanBnXkFtZTcwNzI5MDk4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0242278","name":"Jeff Dunham","idIMDB":"nm0242278"},"actorId":"nm0242278","character":"Mole","urlCharacter":"http://www.imdb.com/character/ch0538646","main":true},{"actorName":"Gabriel Iglesias","urlProfile":"http://www.imdb.com/name/nm0407101","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyNzk4NTQ4Ml5BMl5BanBnXkFtZTgwMTA1OTEwNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1976","placeOfBirth":" San Diego, California, USA","birthName":"Gabriel J. Iglecias","height":"5' 8\" (1.73 m)","bio":"Born in Chula Vista, California, Gabriel Iglesias is the youngest of six children, raised by a single mother. Growing up, the family lived in Section 8 housing in Long Beach, CA. It was during his childhood that he developed a strong sense of humor to deal with the obstacles he faced. In 1997, he set out to hone his comedic skills, and performed stand­up anywhere he could find an audience; including biker bars and hole­in­the­wall joints. Gabriel's stand­up comedy is a mixture of storytelling, parodies, characters and sound effects that bring his personal experiences to life. His unique and animated comedy style has made him popular among fans of all ages. Today, Iglesias is one of America's most successful stand­up comedians, and performs to sold­out concerts around the world. In 2009 and 2010, he headlined the Amman Jordan Comedy Festival, and has had sold­out performances in Canada, Australia, Europe (Netherlands, Belgium, Denmark, Sweden & Norway), the U.K., Singapore, Saudi Arabia, Qatar and the United Arab Emirates. In 2015, Gabriel performed at Madison Square Garden, will continue to tour in The United States, and will also be hitting new countries (Iceland and Finland) this year along with other dates in Europe. Gabriel is lighting up the small screen on ABC's hit sitcom Cristela in a recurring role as Alberto. He can also be seen co­starring alongside Channing Tatum in the highly anticipated Magic Mike XXL, the sequel to the box office hit Magic Mike, opening July 1, 2015. 2014 was a big year for Iglesias. Comedy Central aired Season 3 of Gabriel's hit series Stand­Up Revolution in the fall 2014, which features comedians he personally selects. Gabriel also appeared in 20th Century Fox's animated film The Book of Life alongside Zoe Saldana and Channing Tatum. In the summer of 2014, Iglesias's critically acclaimed stand­up comedy film, The Fluffy Movie (Open Road Films) hit theaters, and is now available on Blu Ray and DVD. Comedy Central premiered Gabriel Iglesias: Aloha Fluffy in an unprecedented two­night comedy special to over 15 million viewers. This was a great follow­up to his previous DVD specials, Hot & Fluffy and I'm Not Fat...I'm Fluffy, which has sold a combined total of 2 million copies. Gabriel also co­starred in A Haunted House 2 and the hit animated films The Nut Job and Disney's Planes. He was nominated for an ALMA Award; Favorite TV Reality, Variety, or Comedy Personality or Act and was top billed at the Just for Laughs Comedy Festivals in Montreal and Toronto. Gabriel has appeared on The Today Show, The View, Entertainment Tonight, The Tonight Show with Jimmy Fallon, Chelsea Lately, The Arsenio Hall Show, The Tonight Show with Jay Leno, Conan, Jimmy Kimmel Live, The Late Late Show with Craig Ferguson, Steve Harvey, Good Morning America, Cartoon Network's The Annoying Orange and FOX TV's The Family Guy. He has also co­hosted the top rated YouTube series Ray William Johnson's =3 and Epic Meal Time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyNzk4NTQ4Ml5BMl5BanBnXkFtZTgwMTA1OTEwNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0407101","name":"Gabriel Iglesias","nicknames":["Pikachu","Chippie","Fluffy"],"idIMDB":"nm0407101"},"actorId":"nm0407101","character":"Jimmy","urlCharacter":"http://www.imdb.com/character/ch0538647","main":true},{"actorName":"Sarah Gadon","urlProfile":"http://www.imdb.com/name/nm0300589","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY0MzA0MDg0MV5BMl5BanBnXkFtZTgwNjA5ODQ0OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1987","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Sarah Gadon","height":"5' 3\" (1.6 m)","bio":"Sarah Gadon was born in a quiet residential area in Toronto, Ontario, to a teacher mother and a psychologist father. She grew up with the support and encouragement of her parents and older brother, James, and with this was inspired to reach her limits in acting and dance alike. Sarah spent much of her adolescence training as a performer as a Junior Associate at the National Ballet School of Canada and as a student at the Claude Watson School for the Performing Arts. She also studied cinema at the prestigious University of Toronto. She is known for her roles in the films A Dangerous Method (2011), Antiviral (2012), Enemy (2013), and Indignation (2016), and the mini-series 11.22.63 (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY0MzA0MDg0MV5BMl5BanBnXkFtZTgwNjA5ODQ0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0300589","name":"Sarah Gadon","idIMDB":"nm0300589"},"actorId":"nm0300589","character":"Lana","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Rankin","urlProfile":"http://www.imdb.com/name/nm0710258","urlPhoto":"","biography":{"birthName":"James Christian Rankin","height":"6' 1\" (1.85 m)","bio":"James Rankin was born in Toronto, Ontario, Canada as James Christian Rankin. He is known for his work on The Adventures of Dudley the Dragon (1994), Puppets Who Kill (2002) and Opération Casse-noisette (2014). He has been married to Wendy since April 3, 2005.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0710258","name":"James Rankin","idIMDB":"nm0710258"},"actorId":"nm0710258","character":"Fingers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott Yaphe","urlProfile":"http://www.imdb.com/name/nm1064104","urlPhoto":"","biography":{"dateOfBirth":"16 February 1970","placeOfBirth":" Montréal, Québec, Canada","bio":"Scott Yaphe was born on February 16, 1970 in Montréal, Québec, Canada. He is an actor, known for The Tuxedo (2002), Opération Casse-noisette (2014) and Amelia (2009). He has been married to Jessica Holmes since 2002. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1064104","name":"Scott Yaphe","idIMDB":"nm1064104"},"actorId":"nm1064104","character":"Lucky","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Pingue","urlProfile":"http://www.imdb.com/name/nm0684187","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNTY1MzY5OF5BMl5BanBnXkFtZTcwMTU1NDgxNA@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"bio":"An actor Known for Blindness (2008), The Book of Eli (2010), Antiviral (2012), Pacific Rim (2013), Orphan Black (2013), Room (2015), Godless (2017) and Anon (2017). He is classically trained actor that began film and television work in the late 1990's and is both an Italian and Canadian citizen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNTY1MzY5OF5BMl5BanBnXkFtZTcwMTU1NDgxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0684187","name":"Joe Pingue","idIMDB":"nm0684187"},"actorId":"nm0684187","character":"Johnny","urlCharacter":"http://www.imdb.com/character/ch0538648","main":true},{"actorName":"Annick Obonsawin","urlProfile":"http://www.imdb.com/name/nm0643449","urlPhoto":"","biography":{"dateOfBirth":"12 October 1983","placeOfBirth":" Toronto, Ontario, Canada","height":"5' 2\" (1.57 m)","bio":"Annick Obonsawin was born on October 12, 1983 in Toronto, Ontario, Canada. She is an actress, known for Charlie Bartlett (2007), Les aventures de Shirley Holmes (1996) and Opération Casse-noisette (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0643449","name":"Annick Obonsawin","idIMDB":"nm0643449"},"actorId":"nm0643449","character":"Jamie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julie Lemieux","urlProfile":"http://www.imdb.com/name/nm0501306","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5MDA4NTQ5MF5BMl5BanBnXkFtZTgwOTM2NjIxMDE@._V1_UY44_CR9,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1962","placeOfBirth":" Toronto, Ontario, Canada","height":"5' 4\" (1.63 m)","bio":"Julie Lemieux was born on December 4, 1962 in Toronto, Ontario, Canada. She is known for her work on Beyblade (2001), Rupert (1991) and Busytown Mysteries (Hurray for Huckle!) (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5MDA4NTQ5MF5BMl5BanBnXkFtZTgwOTM2NjIxMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0501306","name":"Julie Lemieux","idIMDB":"nm0501306"},"actorId":"nm0501306","character":"Girl Scout","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rob Tinkler","urlProfile":"http://www.imdb.com/name/nm0863999","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3ODIzNDYxOF5BMl5BanBnXkFtZTgwMjE5NDc0ODE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Rob Tinkler is an actor, screenwriter, director and voice actor based in Toronto and LA. Rob was born in Winnipeg Manitoba, but moved to the Toronto, Ontario area while in grade school. In his late teens he became involved in community theatre, performing in plays and musicals and was subsequently accepted into the Theatre program at Ryerson University (later acquiring his BFA). At Ryerson he met future sketch comedy collaborators Mike Beaver, Jason Jones, and Stacey Depass. His first gig out of school was a series on YTV called \"It's Alive\". The show was of the sketch comedy variety, and while acting on the series Rob was introduced to and became interested in writing. After the show's cancellation, and growing frustrated with a dwindling influx of acting work at that time, Rob and his then roommates Mike Beaver and Shaun Majumder decided to form the comedy troupe \"Beaver, Tinkler, Majumder\". This triumvirate soon welcomed Jason Jones, and then Stacey Depass and Jenn Baxter (who were also on \"It's Alive\") and the troupe was renamed \"The Bobroom\". Also during this period, Rob realized an affinity for voice-overs and he booked several animated series including \"Sam & Max Freelance Police\", \"X-Men\" and \"Sailor Moon\". After writing, mounting and performing in many live sketch shows with The Bobroom at clubs across Toronto and excursions into Chicago and New York City, the troupe was soon approached by Milan Curry-Sharples about doing the comedy showcase series \"Comedy Now\". Although this show was more of a vehicle for stand-up comedians, this endeavor ultimately led to the development and creation of the sketch comedy series \"The Bobroom\" for the Comedy Network. Although the series ran only for a limited time, it was a learning ground for Rob as he not only amassed characters, but honed skills in writing for the screen. Also around this time, Rob landed several roles on feature film productions, including \"The Tuxedo\" and the cult classic \"Harold And Kumar Go To White Castle\". After embarking on a couple of pilot seasons in Los Angeles, Rob received the accreditation to relocate to the US on a full time basis. There, he has written for several animated series (\"Wayside\", \"Pandalian\" \"Almost Naked Animals\") and did voices on video games (\"Superman Returns\", \"Marvel: Ultimate Alliance 2\"), and several pilots and series (\"Celebrity Deathmatch\"), including the Fox prime time animated series \"American Dad\". He's also performed in countless commercials and even landed a recurring role as Rachael Harris' whipping boy in ABC's \"Notes From The Underbelly\". Rob plays too many characters to name on PBS's \"The Cat In The Hat Knows A Lot About That\", as well as voices leading danger dog Howie in Cartoon Network's \"Almost Naked Animals\" and Gingka in \"Beyblade Metal Fusion\". Rob divides his time between LA and Toronto as he continues to develop series and films. In addition to acting, writing, and directing, he is also a Creative Consultant on \"Almost Naked Animals\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3ODIzNDYxOF5BMl5BanBnXkFtZTgwMjE5NDc0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0863999","name":"Rob Tinkler","idIMDB":"nm0863999"},"actorId":"nm0863999","character":"Redline / Buddy","urlCharacter":"http://www.imdb.com/character/ch0563284","main":true}],"seasons":[],"idIMDB":"tt1821658","urlIMDB":"http://www.imdb.com/title/tt1821658","business":{"budget":{"money":"$42,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$20,550,000","country":"USA","day":"19","month":"01","year":"2014","remarks":"3,427 Screens"},{"money":"HUF 30,179,994","country":"Hungary","day":"26","month":"01","year":"2014","remarks":""}],"gross":[{"money":"$64,238,770","country":"USA","day":"04","month":"05","year":"2014","remarks":""},{"money":"$64,165,447","country":"USA","day":"27","month":"04","year":"2014","remarks":""},{"money":"$64,015,096","country":"USA","day":"20","month":"04","year":"2014","remarks":""},{"money":"$63,799,508","country":"USA","day":"13","month":"04","year":"2014","remarks":""},{"money":"$63,506,255","country":"USA","day":"06","month":"04","year":"2014","remarks":""},{"money":"$63,106,258","country":"USA","day":"30","month":"03","year":"2014","remarks":""},{"money":"$62,600,840","country":"USA","day":"23","month":"03","year":"2014","remarks":""},{"money":"$62,090,875","country":"USA","day":"16","month":"03","year":"2014","remarks":""},{"money":"$61,399,005","country":"USA","day":"09","month":"03","year":"2014","remarks":""},{"money":"$59,906,067","country":"USA","day":"23","month":"02","year":"2014","remarks":""},{"money":"$58,277,780","country":"USA","day":"16","month":"02","year":"2014","remarks":""},{"money":"$55,082,000","country":"USA","day":"09","month":"02","year":"2014","remarks":""},{"money":"$49,911,445","country":"USA","day":"02","month":"02","year":"2014","remarks":""},{"money":"$40,056,363","country":"USA","day":"26","month":"01","year":"2014","remarks":""},{"money":"$20,550,000","country":"USA","day":"19","month":"01","year":"2014","remarks":""}],"weekendGross":[{"money":"$49,745","country":"USA","day":"04","month":"05","year":"2014","remarks":"101 Screens"},{"money":"$101,646","country":"USA","day":"27","month":"04","year":"2014","remarks":"160 Screens"},{"money":"$110,117","country":"USA","day":"20","month":"04","year":"2014","remarks":"201 Screens"},{"money":"$186,577","country":"USA","day":"13","month":"04","year":"2014","remarks":"261 Screens"},{"money":"$273,434","country":"USA","day":"06","month":"04","year":"2014","remarks":"285 Screens"},{"money":"$312,530","country":"USA","day":"30","month":"03","year":"2014","remarks":"294 Screens"},{"money":"$336,447","country":"USA","day":"23","month":"03","year":"2014","remarks":"335 Screens"},{"money":"$482,320","country":"USA","day":"16","month":"03","year":"2014","remarks":"405 Screens"},{"money":"$325,398","country":"USA","day":"09","month":"03","year":"2014","remarks":"490 Screens"},{"money":"$1,066,564","country":"USA","day":"23","month":"02","year":"2014","remarks":"1,235 Screens"},{"money":"$2,527,124","country":"USA","day":"16","month":"02","year":"2014","remarks":"1,918 Screens"},{"money":"$3,809,000","country":"USA","day":"09","month":"02","year":"2014","remarks":"3,004 Screens"},{"money":"$7,278,450","country":"USA","day":"02","month":"02","year":"2014","remarks":"3,472 Screens"},{"money":"$12,101,118","country":"USA","day":"26","month":"01","year":"2014","remarks":"3,472 Screens"},{"money":"$20,550,000","country":"USA","day":"19","month":"01","year":"2014","remarks":"3,427 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 25 min (85 min)"],"soundMix":["Dolby Digital","Datasat"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Technicolor Asia, Bangkok, Thailand (lab services)","Technicolor, Toronto, Canada (digital intermediate)"],"filmLength":["2,339.4 m (5 reels)"],"negativeFormat":["Digital"],"cinematographicProcess":["Digital 3-D (source format)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["35 mm (spherical) (Fuji Eterna-CP 3514DI)","D-Cinema (also 3-D version)"]},"rating":"5.8","metascore":"37","filmingLocations":[],"rated":"PG","awards":[{"award":"Behind the Voice Actors Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated BTVA Feature Film Voice Acting Award","categories":[{"category":"Best Female Lead Vocal Performance in a Feature Film","names":[{"name":"Katherine Heigl","id":"nm0001337","role":null}]}]}]},{"award":"Canadian Cinema Editors Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won Canadian Cinema Editors Award","categories":[{"category":"Best Editing in Animation","names":[{"name":"Paul Hunter","id":"nm1019511","role":null}]}]}]},{"award":"Directors Guild of Canada 2014","titlesAwards":[{"titleAwardOutcome":"Nominated DGC Craft Award","categories":[{"category":"Sound Editing - Feature Film","names":[{"name":"Kevin Banks","id":"nm0052193","role":null},{"name":"Claire Dobson","id":"nm5118294","role":null},{"name":"David Evans","id":"nm0262679","role":null},{"name":"Paul Germann","id":"nm0314551","role":null},{"name":"David McCallum","id":"nm0564725","role":null},{"name":"Mark Shnuriwsky","id":"nm0794646","role":null}]}]}]},{"award":"Golden Trailer Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Viral Video or Campaign","names":[{"name":"Open Road Films","id":null,"role":null},{"name":"Aspect Ratio","id":null,"role":null}]}]}]},{"award":"San Diego Film Critics Society Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated SDFCS Award","categories":[{"category":"Best Animated Film","names":[]}]}]}],"votes":"20,844","type":"Movie","companyCreditsSimple":[{"idCompany":"co0391448","name":"Gulfstream Pictures"},{"idCompany":"co0295039","name":"Redrover Co. Ltd."},{"idCompany":"co0294917","name":"ToonBox Entertainment"}],"keywords":{"keywords":["raccoon","squirrel","bank robbery","heist","rat","cgi animation","sociopath","mousetrap","3 dimensional","three word title","scene after end credits","scene during end credits","mouse","betrayal","dog whistle","hearing problem","neglect","toilet humor","con artist","dynamite","running gag","pun in title","unconsciousness","threat","friend in danger","spoof","sabotage","near death experience","front organization","dam","chase","computer animation","pug","autumn","mole","groundhog","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:07:17"}}