{"data":{"movies":[{"title":"Dead Before Dawn 3D","originalTitle":"","year":"2012","releaseDate":"20121011","directors":[{"name":"April Mullen","id":"nm0611983"}],"writers":[{"name":"Tim Doiron","id":"nm1915955"}],"runtime":"88 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2ODIyNTU1OF5BMl5BanBnXkFtZTcwOTM1MTI2OQ@@._V1.jpg","countries":["Canada"],"languages":["English"],"genres":["Adventure","Comedy","Horror"],"plot":"A group of college kids accidentally create, and then unleash, a curse that makes anyone they come into contact with kill themselves and then turn into zombie demons.","simplePlot":"A group of college kids accidentally create, and then unleash, a curse that makes anyone they come into contact with kill themselves and then turn into zombie demons.","actors":[{"actorName":"Devon Bostick","urlProfile":"http://www.imdb.com/name/nm1256602","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzODUxODI2N15BMl5BanBnXkFtZTgwMzM0MjAyODE@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1991","placeOfBirth":" Canada","height":"6' (1.83 m)","bio":"Devon Bostick was born on November 13, 1991 in Canada. He is an actor and producer, known for The 100 (2014), Diary of a Wimpy Kid: Rodrick Rules (2011) and Diary of a Wimpy Kid (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzODUxODI2N15BMl5BanBnXkFtZTgwMzM0MjAyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1256602","name":"Devon Bostick","nicknames":["Dev"],"idIMDB":"nm1256602"},"actorId":"nm1256602","character":"Casper Galloway","urlCharacter":"http://www.imdb.com/character/ch0441820","main":true},{"actorName":"Martha MacIsaac","urlProfile":"http://www.imdb.com/name/nm0532900","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1OTUxMzY4N15BMl5BanBnXkFtZTcwNTIyNDE4MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1984","placeOfBirth":" Charlottetown, Prince Edward Island, Canada","height":"5' 4\" (1.63 m)","bio":"Martha MacIsaac was born on October 11, 1984 in Charlottetown, Prince Edward Island, Canada. She is an actress and writer, known for Superbad (2007), Émilie de la nouvelle lune (1998) and The Last House on the Left (2009). She was previously married to Torre Catalano.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1OTUxMzY4N15BMl5BanBnXkFtZTcwNTIyNDE4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0532900","name":"Martha MacIsaac","idIMDB":"nm0532900"},"actorId":"nm0532900","character":"Charlotte Baker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Lloyd","urlProfile":"http://www.imdb.com/name/nm0000502","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzQ0ODgxOV5BMl5BanBnXkFtZTcwMTAxMDY0Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1938","placeOfBirth":" Stamford, Connecticut, USA","birthName":"Christopher Allen Lloyd","height":"6' 1\" (1.85 m)","bio":"Christopher Lloyd was born on October 22, 1938 in Stamford, Connecticut, USA as Christopher Allen Lloyd. He is an actor, known for Back to the Future (1985), Back to the Future Part II (1989) and Back to the Future Part III (1990). He was previously married to Jane Walker Wood, Carol Vanek, Kay Tornborg and Catherine Boyd.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzQ0ODgxOV5BMl5BanBnXkFtZTcwMTAxMDY0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000502","name":"Christopher Lloyd","nicknames":["Chris"],"idIMDB":"nm0000502"},"actorId":"nm0000502","character":"Horus Galloway","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brandon Jay McLaren","urlProfile":"http://www.imdb.com/name/nm1564963","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzOTI4NzYyM15BMl5BanBnXkFtZTgwNzM1ODQ4MTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1982","placeOfBirth":" Vancouver, British Columbia, Canada","height":"5' 8\" (1.73 m)","bio":"Canadian actor Brandon Jay McLaren was born to parents from Grenada and Trindad on October 15, 1982. Hailing from Vancouver, Brandon attended the Johnston Heights Secondary School in Surrey, British Columbia, Canada where he studied Drama for five years, working with the Johnston Heights Theatre Company. He also attended the University of New York in Albany, furthering his study in acting. In 2003, he began his acting career and since then has been seen in both television and film. His extensive list of small screen credits include roles on Power Rangers S.P.D. (2005), Harper's Island (2009), The Best Years (2007) and AMC's original series The Killing (2011). Brandon also has strong ties to television movies, including the horror flicks The Sea Beast (2008) and Yeti: Curse of the Snow Demon (2008). He also had a recurring role on the Canadian comedic series Les vies rêvées d'Erica Strange (2009) from 2010-2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzOTI4NzYyM15BMl5BanBnXkFtZTgwNzM1ODQ4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1564963","name":"Brandon Jay McLaren","idIMDB":"nm1564963"},"actorId":"nm1564963","character":"Dazzle Darlington","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brittany Allen","urlProfile":"http://www.imdb.com/name/nm0020329","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDkzNDk5YzgtYzEzMC00YjY0LTk5YTEtY2VkZTI5NWRlYmNmL2ltYWdlXkEyXkFqcGdeQXVyMTU2OTcyNzc@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1986","placeOfBirth":" Toronto, Ontario, Canada","height":"5' 8½\" (1.74 m)","bio":"Brittany Allen was born on February 5, 1986 in Toronto, Ontario, Canada. She is an actress and writer, known for It Stains the Sands Red (2016), Saw: Legacy (2017) and The Rocker (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDkzNDk5YzgtYzEzMC00YjY0LTk5YTEtY2VkZTI5NWRlYmNmL2ltYWdlXkEyXkFqcGdeQXVyMTU2OTcyNzc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0020329","name":"Brittany Allen","idIMDB":"nm0020329"},"actorId":"nm0020329","character":"Lucy Winthrop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kyle Schmid","urlProfile":"http://www.imdb.com/name/nm0772704","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNjI5OTIwNV5BMl5BanBnXkFtZTgwOTQyNDUwMDI@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 August 1984","placeOfBirth":" Mississauga, Ontario, Canada","height":"5' 10\" (1.78 m)","bio":"Born in August 1984 in Ontario, Canada, Kyle Schmid has been acting for a majority of his life. Commercials and early modeling gigs turned into film auditions, and he shortly landed a small appearance in the Canadian film Virus (1996). After a small break, he landed two hits in the made for television movies Alley Cats Strike (2000) for which he beat out 400 other competitors for the lead role, and The Sandy Bottom Orchestra (2000). Both raised him to his current fan base. In 2001, he was nominated for a Young Artist Award for \"Best performance in a TV Movie-Supporting Young Actor\" for his performance as Sam Miller in the latter. Later he was playing bully Jordan Lynch on the popular Canadian series My Best Friend Is an Alien (1999). Residing in Ontario, Canada, Kyle spends a majority of his free time playing his favorite sport, soccer. Other hobbies include swimming, horseback riding and mountain biking. He plays on the Erin Mills soccer team which as of right now (2002) is ranked the highest division in Ontario. With more projects coming up, this teen star will most likely follow in the steps of former Canadian star Hayden Christensen and rise to international fame. More recently, Kyle was seen as both Henry Durham in the Syfy Channel series Being Human, and Robert Morehouse in the BBC America series Copper. Kyle may be best known for his starring role as vampire Henry Fitzroy on the Lifetime Television series, Blood Ties and will soon be seen in the upcoming feature film Saul: The Journey to Damascus. Other notable feature films include: The Sisterhood of the Traveling Pants, Croneberg's A History of Violence, Zerophilia, Adam Shankman's The Pacifier with Vin Diesel, The Covenant, Joy Ride 2: Dead Ahead and Dead Before Dawn 3D and Dark Hearts. Kyle has made guest appearances in such television series as CSI: Miami, Smallville and the lead in the FX/FOX pilot Three Inches as well as the recent NBC pilot Babylon Fields. He also had a recurring role as Evan Frasier in the ABC Family original series Beautiful People and co-starred in the Disney Channel Original Movies Alley Cats Strike and The Cheetah Girls. Kyle spends a majority of his free time writing screenplays and playing his favorite sport, soccer. Other hobbies include swimming, horseback riding and mountain biking.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNjI5OTIwNV5BMl5BanBnXkFtZTgwOTQyNDUwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0772704","name":"Kyle Schmid","idIMDB":"nm0772704"},"actorId":"nm0772704","character":"Patrick Bishop","urlCharacter":"http://www.imdb.com/character/ch0542807","main":true},{"actorName":"Tim Doiron","urlProfile":"http://www.imdb.com/name/nm1915955","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM4NzE3MjQ4N15BMl5BanBnXkFtZTgwMDY5MzU4NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 September 1979","placeOfBirth":" Fredericton, New Brunswick, Canada","bio":"Tim Doiron is co-founder of the award winning production company Wango Films alongside business partner April Mullen. Doiron has produced and written the majority of the company's feature films, including: CSA Nominated, 88; Dead Before Dawn 3D, which was awarded The Perron Crystal Award for its achievement in 3D; GravyTrain and Rock, Paper, Scissors: The Way of the Tosser, both of which were seen in festivals around the world and released by eOne. Doiron produced Farhope Tower, a paranormal thriller that had its world premiere at Fright Fest in London, England, and won two awards at its Canadian Premiere at the Blood In The Snow Fest in Toronto. As a writer, Doiron has twice been nominated for a Canadian Comedy Award and is head writer and supervising producer on the TV series, Real Detective-- Investigative Discovery's flagship narrative series. Doiron has attended Producer Events around the world including: Producers Without Borders (Berlinale - Feb. 2016) Strategic Partners (2015), Cannes Marche du Film, Producer's Network (2015, 2014, 2012), TIFF Producer's Network (2013) and IFF (2013). Doiron has also attended film markets around the world including: Cannes, Berlinale, TIFF, AFM, Banff TV Summit, MIPcom, Tokyo Film Market and the 3D Stereo Media Summit in Liege, Belgium. As a Producer, Doiron's next two feature films with Wango are: Bloody Knuckles(2017), an Irish/Canada Co-Pro, in conjunction with Alcina Pictures and Wander(2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM4NzE3MjQ4N15BMl5BanBnXkFtZTgwMDY5MzU4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1915955","name":"Tim Doiron","idIMDB":"nm1915955"},"actorId":"nm1915955","character":"Seth Munday","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"April Mullen","urlProfile":"http://www.imdb.com/name/nm0611983","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMDAwOTEzMl5BMl5BanBnXkFtZTcwODg4MTkzOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"A director, actress and producer, April Mullen was brought up in Niagara Falls, Ontario, Canada. She left to study at Ryerson Theatre School in Toronto where she received a B.F.A. Honors. She skipped over to the United Kingdom to further her training at the prestigious Royal Welsh College of Drama. Mullen's latest directorial offer is an action thriller entitled 88 (2015), released in the US by Millennium Films. Dead Before Dawn 3D (2012) marks her as the youngest person and first female to ever direct a live-action stereoscopic 3D feature film. It has sold all over the world and is a 3D success story in terms of its technological achievement. While in Belgium at the 3D StereoMedia summit, the film was awarded The Perron Crystal for its achievement in Stereoscopic 3D. Mullen is co-founder of the award-winning production company Wango Films with Tim Doiron. Wango produced the cult hit features Rock, Paper, Scissors: The Way of the Tosser (2007) and GravyTrain (2010), which were both distributed by Alliance Films. A true maverick in the independent feature film world, Miss Mullen is a young creator who stops at nothing to see a film from concept to screen. As an actress she was the lead in the HBO series Good God (2012), which showed off her skilled, unique comedic timing. It was her leading role in La vie d'une femme (2004), directed by Lisa Cholodenko (The Kids Are All Right (2010)), an original Showtime feature, that got her nominated for Best Leading Actress by the Young Artist Awards in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMDAwOTEzMl5BMl5BanBnXkFtZTcwODg4MTkzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0611983","name":"April Mullen","idIMDB":"nm0611983"},"actorId":"nm0611983","character":"Becky Fords","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin McDonald","urlProfile":"http://www.imdb.com/name/nm0567852","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2ODEyNzk3N15BMl5BanBnXkFtZTYwNzcyNTc3._V1._CR33,9,176,249_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1961","placeOfBirth":" Montréal, Québec, Canada","birthName":"Kevin Hamilton McDonald","height":"5' 9½\" (1.77 m)","bio":"Born in Montreal Canada. Drama major at Humber College, but kicked out for only being good at comedy. Enrolled in an improv class and met Dave Foley. They began working as a comedy team while employed as movie ushers. In 1984 they merged with another comedy team and formed The Kids in the Hall.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2ODEyNzk3N15BMl5BanBnXkFtZTYwNzcyNTc3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0567852","name":"Kevin McDonald","idIMDB":"nm0567852"},"actorId":"nm0567852","character":"Professor Reginald Duffy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ellen Dubin","urlProfile":"http://www.imdb.com/name/nm0239294","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMjU5ODQ3M15BMl5BanBnXkFtZTgwNDM0NDU1OTE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Ellen has enjoyed a unique and extremely diverse career as an actor. The striking, leggy 5'10-1/2\" native of Toronto began performing as a ballet dancer. When a temporary knee injury sidelined her, Ellen segued into acting with a wide variety of critically acclaimed stage roles from Shakespeare to musicals, from drama to comedy. A Gemini Award nominated actress for her series regular role Jeri Slate in the Leo Award winning supernatural drama THE COLLECTOR (which just aired on Chiller TV in the US, and has aired in 65 countries), Ellen is also a cult figure in the sci-fi world for playing the wild alien cannibal Giggerota the Wicked in the international cult hit LEXX. She has the distinction of doing all four seasons and playing four different characters in this very popular show. Ellen played the first female Pope in sci-fi history in LEXX. She recently wrapped two sci fi pilots NOBILITY with the legendary Walter Koenig, Doug Jones, Cas Anwar, James Kyson , Christopher Judge, Torri Higginson and Adrienne Wilkinson. The other pilot STARFALL, she worked with Andrew Jackson and Damien Puckler in Reno, Nevada. Both roles are very unique and intriguing! She also enjoyed working on two recent film roles playing a nerdy shy wallflower in BIG FAT STONE with Academy Award nominated Robert Loggia, Tony Nardi and Margot Kidder which won many awards including Best Picture at the Action on Film Festival in Pasadena and NO DEPOSIT where she played a foul mouthed alcoholic woman opposite Art Hindle, Peter Coyote, Doris Roberts and Eric Roberts. Her comedy zombie film DEAD BEFORE DAWN 3D with Devon Bostick and Christopher Lloyd opened at the Grauman's Theater in Los Angeles and across the United States. The zomedy won the Perron Crystal Award for Live Action 3D Film from the prestigious International 3D Stereo Media Summit and Film Festival. DBD was nominated for five Canadian Comedy Awards. In NAPOLEON DYNAMITE, the multi award winning Sundance Film Festival favorite and one of the most iconic film comedies of all time, Ellen plays the Tupperware-loving mom of Napoleon's potential prom date. Her affinity for the unusual has also lead her to starring roles in THE LISTENER, THE DEAD ZONE, EARTH: FINAL CONFLICT, BLOOD TIES, MUTANT X, A WRINKLE IN TIME and HIGHLANDER: THE RAVEN where she is the only female to have a broad-to-broad broadsword fight in that shows' history. She is also the go-to-girl for a host of movies on the Lifetime Network. She stars in THE WIVES HE FORGOT opposite Molly Ringwald, LIES AND DECEPTION with Madchen Amick and SECOND CHANCES with Melissa George, all airing now on LIFETIME. Her Hallmark Hall Of Fame Presents/ CBS Emmy nominated movie of the week THE LOIS WILSON story (opposite Winona Ryder) is among her favorites. Ellen voiced many characters in Time Magazine's #1 PC video game of 2012 GUILD WARS 2 and Ultimate Game of the Year ELDER SCROLLS V: SKYRIM. She also was thrilled to lend her voice to STAR WARS UPRISING, SKYFORGE, DEFENSE GRID:2, ELDER SCROLLS ONLINE, WORLD OF WARCRAFT:WARLORDS OF DRAENOR, WASTELAND 2 and MURDERED:SOUL SUSPECT. She is the voice of the highly acclaimed Disney California Adventure attraction THE WORLD OF COLOR and WORLD OF COLOR:WINTER DREAMS, and Disneyland's 60th ANNIVERSARY FIREWORKS SPECTACLE and and the new promo trailers for SCREAMRIDE and SKYFORGE. She is thrilled to be nominated for BEST PERFORMANCE in a VIDEO GAME and OUSTANDING PERFORMANCE in a NARRATION DEMO at the Voice Arts Awards 2015. Ellen is honored to be the spokesperson for the Make A Wish Foundation in Toronto and Central Ontario and volunteers at the Los Angeles Mission.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMjU5ODQ3M15BMl5BanBnXkFtZTgwNDM0NDU1OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0239294","name":"Ellen Dubin","idIMDB":"nm0239294"},"actorId":"nm0239294","character":"Beverly Galloway","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rossif Sutherland","urlProfile":"http://www.imdb.com/name/nm1160472","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NzQ5NTk2Nl5BMl5BanBnXkFtZTgwMTM0OTg2MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1978","placeOfBirth":" Vancouver, Canada","height":"6' 5¼\" (1.96 m)","bio":"Rossif Sutherland is a Canadian actor, son of Donald Sutherland and Francine Racette, who got his acting debut in a short film he directed while studying at Princeton University after his lead actor was a no-show on the first day of shooting.. Encouraged by his father, Rossif studied with Harold Guskin in New York, coach to Kevin Kline, Glen Close and the late James Gandolfini. He got his professional debut in Richard Donner's Timeline as a young French archaeologist. His first lead role was in Clement Virgo's Poor Boy's Game, playing an amateur boxer recently released from jail on a journey to redemption. The film starred Danny Glover and traveled the world's festivals including Toronto and Berlin. He was then in Gary Yates' High Life, starring Timothy Olyphant, portraying a morphine addict Don Juan who gets his pills from seducing nurses and gets to play cowboy for a day when he teams up with three other addicts to rob a bank. He was nominated for a Genie for his performance in the film. Rossif bounces around from one TV show to the next. He did a season of ER, King, and most recently Reign in which he played Nostradamus. He was nominated for an Actra award for his performance in Flashpoint playing an escaped convict who suffers from a crippling speech impediment desperate for justice having been wrongfully accused . His ambition was never to be an actor, he grew up in Paris far from Hollywood (he is fluent in French as a result), and spent his time writing and singing. However challenging it was for him to start a career in the shadows of his very successful father and brother, his love of the work has driven him to commit whole heartedly to the privileged life of experiencing the life of others.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NzQ5NTk2Nl5BMl5BanBnXkFtZTgwMTM0OTg2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1160472","name":"Rossif Sutherland","idIMDB":"nm1160472"},"actorId":"nm1160472","character":"Burt Rumsfeld","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dru Viergever","urlProfile":"http://www.imdb.com/name/nm1617355","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM0MDQ2MTc3OF5BMl5BanBnXkFtZTcwMTg5OTY3OQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 February 1981","placeOfBirth":"","height":"6' 6\" (1.98 m)","bio":"Dru Viergever was born in Hamilton, Ontario, Canada. He performed theatre and music from an early age. After studying at the University of Toronto, Dru was cast as Kubiak in NBC's Strange Days at Blake Holsey High. He has since appeared in commercials, feature films and television series, including Lionsgate's Saw 3D, and as the ruthless villain in The Colony, starring Laurence Fishburne and Bill Paxton.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM0MDQ2MTc3OF5BMl5BanBnXkFtZTcwMTg5OTY3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1617355","name":"Dru Viergever","idIMDB":"nm1617355"},"actorId":"nm1617355","character":"Zemon Josh","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Benjamin Ayres","urlProfile":"http://www.imdb.com/name/nm1534707","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxOTA2NjY2NV5BMl5BanBnXkFtZTgwMzMwMTYwOTE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1977","placeOfBirth":" Kamloops, British Columbia, Canada","birthName":"Benjamin James Ayres","height":"6' 2\" (1.88 m)","bio":"Benjamin Ayres was born on January 19, 1977 in Kamloops, British Columbia, Canada as Benjamin James Ayres. He is an actor and writer, known for Saving Hope (2012), Dan for Mayor (2010) and jPod (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxOTA2NjY2NV5BMl5BanBnXkFtZTgwMzMwMTYwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1534707","name":"Benjamin Ayres","nicknames":["Jimmy James"],"idIMDB":"nm1534707"},"actorId":"nm1534707","character":"Griffith Galloway","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Max Topplin","urlProfile":"http://www.imdb.com/name/nm2963060","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM2NjIyMTk2Nl5BMl5BanBnXkFtZTcwMjY4NDUxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1989","placeOfBirth":" Toronto, Ontario, Canada","height":"5' 11\" (1.8 m)","bio":"Max Topplin was born on December 14, 1989 in Toronto, Ontario, Canada. He is an actor and producer, known for Carrie (2013), Camp Rock (2008) and Suits (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM2NjIyMTk2Nl5BMl5BanBnXkFtZTcwMjY4NDUxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2963060","name":"Max Topplin","idIMDB":"nm2963060"},"actorId":"nm2963060","character":"Hillbilly Dave","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marty Adams","urlProfile":"http://www.imdb.com/name/nm1542156","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MTcxODQ5N15BMl5BanBnXkFtZTcwNDA1MTM3OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1981","placeOfBirth":" Parry Sound, Ontario, Canada","height":"6' (1.83 m)","bio":"Marty Adams was born on September 12, 1981 in Parry Sound, Ontario, Canada. He is an actor and writer, known for Saw IV (2007), The Second City Project (2015) and Hemlock Grove (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MTcxODQ5N15BMl5BanBnXkFtZTcwNDA1MTM3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1542156","name":"Marty Adams","idIMDB":"nm1542156"},"actorId":"nm1542156","character":"Hillbilly Cleitus","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1989485","urlIMDB":"http://www.imdb.com/title/tt1989485","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"$608,881","country":"Russia","day":"04","month":"11","year":"2012","remarks":""}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 28 min (88 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Red One MX (ET QUASAR 3D rig)","Silicon Imaging SI-2K (hand-held/steadicam shots)"],"laboratory":null,"filmLength":null,"negativeFormat":["CineForm RAW","Redcode RAW"],"cinematographicProcess":["CineForm RAW (2K) (dual-strip 3-D) (source format) (some scenes)","Digital Intermediate (2K) (master format)","Redcode RAW (4.5K) (dual-strip 3-D) (source format)"],"printedFilmFormat":["Stereoscopic 3D"]},"rating":"5.0","filmingLocations":[{"location":"Niagara Falls, Ontario, Canada"}],"rated":"R","awards":[{"award":"Canadian Comedy Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Canadian Comedy Award","categories":[{"category":"Best Performance by a Female - Film","names":[{"name":"Brittany Allen","id":"nm0020329","role":null},{"name":"WANGO Films","id":null,"role":null}]}]}]}],"votes":"3,061","type":"Movie","companyCreditsSimple":[{"idCompany":"co0349875","name":"WANGO Films"}],"keywords":{"keywords":["curse","demon","zombie","football player","graveyard","grave digging","grave","football","trophy","trophy cabinet","football game","dream sequence","grandfather grandson relationship","running out of gas","reference to ghostbusters","gas station explosion","zombie parody","gas station","crossbow","grenade","single friend","toaster","meatball","french kissing","zombie slave","hickey","mug","hippie","joint","weed","winnebago","skull","occult","explosion","fire","title directed by female","friend","african american","kiss","suicide","teenager","mother son relationship","friendship","blood","violence","death","3d","zemon"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:41:35"}}