{"data":{"movies":[{"title":"The Borrowers","originalTitle":"","year":"2011","releaseDate":"20121226","directors":[{"name":"Tom Harper","id":"nm2197777"}],"writers":[{"name":"Mary Norton","id":"nm0636260"},{"name":"Ben Vanstone","id":"nm1460452"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzc5NjkyMDI0Nl5BMl5BanBnXkFtZTgwNjA0NzAxMzE@._V1.jpg","countries":["UK","South Africa"],"languages":["English"],"genres":["Comedy","Family","Fantasy"],"plot":"Pod and Homily Clock and their sixteen year old daughter Arietty are 'Borrowers', four inch high people who live under the floor boards in Granny Driver's house and borrow what they need without her knowledge. She is determined to catch them. When Arietty defies her father and strays into the house alone young James hides her and they become friends but Granny contacts Professor Mildeye, who is obsessed with the existence of 'Homo Sapiens Redactus', whom he wants to exhibit to the world and he captures Pod and Homily. Fortunately Arietty and resourceful fellow Borrower Spiller join forces with James to effect a rescue before the professor can dissect his tiny captives.","simplePlot":"The Borrowers are four-inch high \"little people\" who live under the floorboards.","actors":[{"actorName":"Christopher Eccleston","urlProfile":"http://www.imdb.com/name/nm0001172","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwOTI1NjUxMl5BMl5BanBnXkFtZTYwMTAzNjI3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 February 1964","placeOfBirth":" Salford, Lancashire, England, UK","height":"6' (1.83 m)","bio":"Christopher Eccleston trained at the Central School of Speech and Drama and first came to public attention as Derek Bentley in L'âge de vivre (1991). However, it was a regular role in the television series Cracker (1993) that made him a recognizable figure in the United Kingdom. He appeared in the low-budget thriller Shallow Grave (1994), and in the same year, won the part of Nicky Hutchinson in the epic BBC drama serial Our Friends in the North (1996). It was the transmission of the latter series on BBC Two that really made him into a household name in the United Kingdom. In his film career, he has starred as a leading man alongside a number of major actresses, such as Renée Zellweger in A Price Above Rubies (1998), Cate Blanchett in Elizabeth (1998), and Cameron Diaz and Jordana Brewster in The Invisible Circus (2001), and Nicole Kidman in Les autres (2001). In addition to his successful film career, he has continued to work in his favourite medium, appearing in some of the most challenging and thought-provoking British television dramas of recent years. These have included Clocking Off (2000) and Flesh and Blood (2002) for the BBC and Hillsborough (1996), the Iago character in a modern adaptation of Shakespeare's \"Othello\", and the religious epic The Second Coming (2003), playing Steve Baxter, the son of God. His stage career, while not as extensive as his screen credits, has nevertheless shown him to be a formidable actor. He has given intense, focused performances in such plays as \"Hamlet\", \"Electricity\" and \"Miss Julie\", for which he received excellent reviews. A very highly regarded actor, Eccleston has twice been nominated in the Best Actor category at the BAFTA Television Awards, the British premiere television awards ceremony. His first nomination came in 1997 for \"Our Friends in the North\". Although he didn't win those awards, however, he did triumph in the Best Actor categories at the 1997 Broadcasting Press Guild Awards and the Royal Television Society Awards, winning for \"Our Friends in the North\". He won the RTS Best Actor award for a second time in 2003, this time for his performance in \"Flesh and Blood\". In 2005, he received the Most Popular Actor award in the National Television Awards for Doctor Who.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwOTI1NjUxMl5BMl5BanBnXkFtZTYwMTAzNjI3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001172","name":"Christopher Eccleston","nicknames":["Chris"],"idIMDB":"nm0001172"},"actorId":"nm0001172","character":"Pod Clock","urlCharacter":"http://www.imdb.com/character/ch0075604","main":true},{"actorName":"Sharon Horgan","urlProfile":"http://www.imdb.com/name/nm1279721","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk1NzAwMDM0N15BMl5BanBnXkFtZTcwMTY2NjIyNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1970","placeOfBirth":" Hackney, London, England, UK","height":"5' 8\" (1.73 m)","bio":"Sharon Horgan was born on July 13, 1970 in Hackney, London, England. She is an actress and writer, known for Catastrophe (2015), Man Up (2015) and Pulling (2006). She has been married to Jeremy Rainbird since October 16, 2006. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk1NzAwMDM0N15BMl5BanBnXkFtZTcwMTY2NjIyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1279721","name":"Sharon Horgan","idIMDB":"nm1279721"},"actorId":"nm1279721","character":"Homily Clock","urlCharacter":"http://www.imdb.com/character/ch0075605","main":true},{"actorName":"Aisling Loftus","urlProfile":"http://www.imdb.com/name/nm1528026","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2NjM0MTA3NjJeQTJeQWpwZ15BbWU3MDA0MzgyMjc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 September 1990","placeOfBirth":" Nottingham, Nottinghamshire, England, UK","height":"5' 6\" (1.68 m)","bio":"Aisling Loftus was born on September 1, 1990 in Nottingham, Nottinghamshire, England. She is an actress, known for Oranges and Sunshine (2010), Pride and Prejudice and Zombies (2016) and Mr Selfridge (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2NjM0MTA3NjJeQTJeQWpwZ15BbWU3MDA0MzgyMjc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1528026","name":"Aisling Loftus","idIMDB":"nm1528026"},"actorId":"nm1528026","character":"Arrietty Clock","urlCharacter":"http://www.imdb.com/character/ch0075606","main":true},{"actorName":"Robert Sheehan","urlProfile":"http://www.imdb.com/name/nm1588066","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU4ODI0MjQ2M15BMl5BanBnXkFtZTcwNjY4ODI3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1988","placeOfBirth":" Portlaoise, County Laois, Ireland","birthName":"Robert Michael Sheehan","height":"6' (1.83 m)","bio":"Robert Sheehan was born on January 7, 1988 in Portlaoise, County Laois, Ireland as Robert Michael Sheehan. He is an actor and producer, known for The Mortal Instruments: City of Bones (2013), Moonwalkers (2015) and Season of the Witch (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU4ODI0MjQ2M15BMl5BanBnXkFtZTcwNjY4ODI3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1588066","name":"Robert Sheehan","idIMDB":"nm1588066"},"actorId":"nm1588066","character":"Spiller","urlCharacter":"http://www.imdb.com/character/ch0182214","main":true},{"actorName":"Victoria Wood","urlProfile":"http://www.imdb.com/name/nm0940064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2Nzc2NTEyOF5BMl5BanBnXkFtZTgwOTQ0NDg2ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 May 1953","placeOfBirth":" Prestwich, Greater Manchester, Lancashire, England, UK","height":"5' 5\" (1.65 m)","bio":"From the mid-1980s right up until her premature death in April 2016, Victoria Wood's appearances on stage and television were always eagerly anticipated, whether it was laugh-a-minute stand-up, a beautifully judged dramatic performance in the TV film Housewife, 49 (2006) or the canteen sitcom Dinnerladies (1998). The incredible care and craft she lavished on each look and line of dialogue was as meticulous as it was matchless. A shy, isolated child, Victoria Wood was born in Prestwich, Lancashire, in May 1953, the youngest of four siblings. Her insurance salesman father Stanley Wood was a frustrated writer who made up songs for his office parties and eventually went on to write scripts for Coronation Street (1960). Largely ignored by her parents (\"Our house looked like an explosion in an Oxfam shop\"), Wood stayed in her bedroom and sought attention as a performer, joining a youth theatre group in Rochdale and teaching herself to play the piano. She also learnt to play the trumpet. Having been considered exceptionally bright at her primary school, Wood lost her way at Bury Grammar School, intimidated by the competition and envious of the more outgoing girls who appeared to be \"having a wonderful time\". While studying drama at Birmingham University she auditioned for the ITV talent show New Faces (1973), performing a song about a woman contemplating marriage to a man who washes his Cortina more than his neck. Though eliminated in the second round, she was talent-spotted by poet Roger McGough for a revue he took up to the Edinburgh Festival Fringe in 1976. Her first big break was the TV show That's Life! (1986), writing and performing satirical songs loosely inspired by topical events. Her lifelong friendship and collaboration with Julie Walters began in the 1970s when they both appeared in a revue, 'In at the Death', at London's tiny Bush Theatre, for which Wood wrote a sketch. Its success led to the commissioning of Talent, Wood's first full-length play, by the Crucible Theatre, Sheffield. Talent was later filmed by Granada TV, starring Julie Walters as a disillusioned talent-show contestant. The stage version won her the Evening Standard's most promising new playwright award. Granada commissioned two more plays from Wood, and urged her to write a sketch show for herself and Julie Walters, which became Wood and Walters (1981) and also featured Roger Brierley with who she would go on to work with again in her later productions in the 1980s and 1990s. In the mid-1980s she was poached by the BBC for her own series, Victoria Wood: As Seen on TV (1985), for which she assembled her own mini-repertory company consisting of Julie Walters, Celia Imrie and Duncan Preston. It was for this show that she also launched the much-loved Acorn Antiques, a low-budget TV soap of such ineptitude it made Crossroads (1986) look slick. The spoof was held in such affection that Wood, along with the original cast, was able to sell out the Theatre Royal Haymarket 20 years later with Acorn Antiques: The Musical (2006), for which she wrote the score. Despite generally favourable reviews and Olivier nominations for best new musical, best actress in a musical, Julie Walters and best performance in a supporting role in a musical Celia Imrie, Wood later claimed that the show was a bad idea because she felt it had undermined her credibility as a playwright. Victoria Wood: As Seen on TV (1985) ran for two series and also featured Patricia Routledge, Sue Wallace, Deborah Grant, Peter Lorenzelli, Jim Broadbent, Peter Martin, Jim Broadbent and Susie Blake. Victoria Wood and Julie Walters worked together again with Celia Imrie, Anne Reid, Susie Blake and Lill Roughley in 1989 in a series of six playlets for the series named simply Victoria Wood (1989) which included an appearance from Joan Sims as well as appearances from Jim Broadbent, Peter Martin, Patricia Hodge, Philip Lowrie, William Osborne and Maureen Lipman. Then again on television in 1992, Victoria Wood's All Day Breakfast (1992) starred Celia Imrie, Julie Walters, Susie Blake, Anne Reid and also featured Duncan Preston, William Osborne and Philip Lowrie. And yet again in 1994 in Wood's TV film Screen One: Pat and Margaret (1994) which also starred Julie Walters, Duncan Preston, Anne Reid, Deborah Grant, Peter Lorenzelli, Sue Wallace, Roger Brierley, Philip Lowrie and Angela Curran as well as a special appearance from Dame Thora Hird, about the strained reunion of two estranged sisters, one the star of an American TV soap, the other a waitress in a motorway service station in northern England. Wood cast herself as the dowdy Margaret, while acknowledging in an interview that she probably had more in common with Pat, a woman \"so determined to get on there's no room for anything else\". While developing as a dramatist, she continued to do stand-up, nailing the hypocrisies and absurdities of everyday life with stinging wit and whiplash delivery. Her targets were often \"people who think a lot of themselves\" in whatever field of endeavour. With her cropped hair and androgynous dress sense, Wood cleverly bypassed any gender preference - an unthreatening, even comforting stage presence to the majority. Fellow comedian Simon Fanshawe wrote of her: \"The point about Wood is that she makes you feel comfortable and then slips spiky material in under your guard.\" The commentator Judith Woods wrote in 2007: \"Quite simply, Victoria Wood is a performer for grown-ups. She has an everywoman appeal to female viewers, but none of the stridency that traditionally puts off male audiences. She isn't preoccupied with pastiche and celebrity. Real life is her forte, in all its peculiarities.\" An assiduous student of vintage comedy, Wood was keenly aware of her predecessors, both male and female. She saw what she did in a historical context, citing the likes of Vesta Victoria, Gracie Fields, Max Miller, Hetty King and Ken Dodd, the greats of music hall and variety, as her inspiration. She had no interest in reflecting the often racist, sexist stand-up style of the 1980s. Her more enlightened and sophisticated take on the changes taking place in society prevailed while the unreconstructed male chauvinists withered on the vine. In a Guardian interview in 1984, she said: \"I just assume that everyone believes the sexes are equal. When I go out there and make them laugh, I'm saying, 'This is my personality, I hope you like it.'\" In 1998 came the sitcom Dinnerladies (1998), again collaborating with 'Anne Reid', Duncan Preston and Celia Imrie with Julie Walters also making appearances, with Angela Curran, Graham Seed, Thora Hird (then aged 87 and in a wheelchair), Richenda Carey, Lill Roughley, Andrew Livingston (2 uncredited appearances in the first series), Dora Bryan, Henry Kelly, Peter Martin, Peter Lorenzelli, Sue Wallace, Kay Adshead and Bernard Wrigley (all of whom she had worked with previously) all making appearances in one or more episodes. The series also featured three actresses who appeared in every single episode, namely Thelma Barlow, Shobna Gulati and essentially launching the career of the actress Maxine Peake. Other regular cast members would also go on to star in Coronation Street (1960) such as Sue Cleaver and Andrew Dunn. The award-winning sitcom ran for two series and consisted of a total of sixteen episodes including Christmas and millennium specials. December 2000 saw the Christmas sketch show special Victoria Wood: With All the Trimmings (2000), featuring her regular troupe of actors including Celia Imrie, Julie Walters and Anne Reid, with further appearances from Richenda Carey, Maxine Peake and Shobna Gulati as well as a string of special guest stars such as Angela Rippon, Bob Monkhouse and Roger Moore. Such a prodigious talent always comes at a cost, and for Wood it was her 20-year marriage to the magician Geoffrey Durham, with whom she had two children. After the breakdown of their marriage in 2002, divorcing in 2003, she withdrew from the limelight for a couple of years and went into therapy, saying it was too painful to appear in public while her private life was in turmoil. She continued nevertheless to produce one-off specials including Victoria Wood's Sketch Show Story (2002) and Victoria Wood's Big Fat Documentary (2004). During this period Wood tended to move away from comedy to focus on drama,notably in her award-winning 2006 TV film Housewife, 49 (2006), an adaptation of the real-life wartime diaries of a Lancashire woman, Nella Last, whose life is unexpectedly turned around by the knock-on effects of war. Her beautifully judged script - and performance in the lead - deservedly won her a best actress BAFTA, as well as a best single drama award. On this occasion Wood chose to mainly work with a different set of actors and actresses including for example Stephanie Cole, Sylvestra Le Touzel and Wendy Nottingham, though Sue Wallace with whom she had worked with on at least three separate occasions previously also featured. In 2007 Wood appeared in a three-part BBC travel documentary Victoria's Empire (2007), in which she travelled around the world in search of the history, cultural impact and customs the British Empire placed on the parts of the world it ruled. She departed Victoria Station, London, for Calcutta, Hong Kong and Borneo in the first programme. In programme two she visited Ghana, Jamaica and Newfoundland and in the final programme, New Zealand, Australia and Zambia, finishing at the Victoria Falls. On Boxing Day 2007 she appeared as \"Nana\" in the Granada dramatisation of Noel Streatfeild's novel Ballet Shoes (2007). 2009 saw Wood reunite with Julie Walters to produce a Christmas special for the BBC Mid Life Christmas (2009). She again selected actors and actresses with who she had already worked with to fill complementary roles, on this occasion working with Sylvestra Le Touzel, Wendy Nottingham, Jason Watkins, Lorraine Ashbourne and Marcia Warren, who had all featured in Housewife, 49 (2006) a few years previous. On New Year's Day 2011 Wood appeared in a BBC drama Eric & Ernie (2011) as Eric Morecambe's mother, Sadie Bartholomew. In 2011, Wood's last major stage work, 'That Day We Sang', again based on a true story, garnered rave reviews at the Manchester International Festival, and was revived three years later at the Royal Exchange. The Stage called it \"an entirely original and authentically British musical that's the best of its kind about childhood aspiration since Billy Elliot\". Lyn Gardner, writing in The Guardian, said: \"Music runs through the show like an unstoppable river of emotion, and Wood's script is both tart as a plum, and unashamedly sentimental.\" On 23 December 2012 BBC One screened Loving Miss Hatto (2012), a drama written by Wood about the life of concert pianist Joyce Hatto, the centre of a scandal over the authenticity of her recordings and her role in the hoax. On 26 December 2014, a television adaptation of That Day We Sang (2014), starring Michael Ball and Imelda Staunton, was shown on BBC TV. In early 2015, Wood took part in a celebrity version of The Great Comic Relief Bake Off (2013) and was crowned Star Baker in her episode. She co-starred with Timothy Spall in Sky television's three-part television adaptation of Fungus the Bogeyman (2015), which was first broadcast over three days in December 2015, The miniseries was filmed in the summer of 2015. This was to be her last acting project and her final role and she was notably absent from the screening of the series in late autumn that year. Sadly in fact in the autumn of 2015 Wood fell ill with terminal cancer and withdrew from public life entirely, she was later hospitalized but she was subsequently released to be allowed to die at home with her two children at her bedside. Victoria Wood died on 20 April 2016 at her home in Highgate, North London. She had been appointed OBE in 1997 and had subsequently advanced to CBE in 2008. The writer and critic Clive James said Wood \"changed the field for women and indeed for everybody, because very few of the men were trying hard enough as writers before she came on the scene and showed them what penetrating social humour should actually sound like.\" She was survived by her daughter Grace Durham who is an accomplished concert singer and recitalist and her son Henry Durham.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2Nzc2NTEyOF5BMl5BanBnXkFtZTgwOTQ0NDg2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0940064","name":"Victoria Wood","idIMDB":"nm0940064"},"actorId":"nm0940064","character":"Granny Driver","urlCharacter":"http://www.imdb.com/character/ch0287632","main":true},{"actorName":"Stephen Fry","urlProfile":"http://www.imdb.com/name/nm0000410","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTEyNzc0MV5BMl5BanBnXkFtZTgwMDQwNDk0NjE@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1957","placeOfBirth":" Hampstead, London, England, UK","birthName":"Stephen John Fry","height":"6' 4½\" (1.94 m)","bio":"Writer, actor, comedian, doer of good works, excellent good friend to the famous and not, Fry lives in his London SW1 flat and his Norfolk house when not traveling. Famous for his public declaration of celibacy in the \"Tatler\" back in the 1980s, Emma Thompson has characterised her friend as \"90 percent gay, 10 percent other.\" Stephen Fry was born in Hampstead, London, to Marianne Eve (Newman) and Alan Fry, a physicist and inventor. His maternal grandparents were Hungarian Jewish immigrants, while his father's family was of English background. He grew up in Norfolk and attended Uppingham School and Stout's Hill. After his notorious three months in Pucklechurch prison for credit card fraud, he attended Queens College, Cambridge in 1979, finishing with a 2:1 in English in 1981/2. While at Cambridge, he was a member of the Cherubs drinking club, and Footlights with Thompson, Tony Slattery, Martin Bergman, and Hugh Laurie (to whom he was introduced by E.T.). His prolific writing partnership with Laurie began in 1981 with resulting Footlights revues for (among others) Mayweek, Edinburgh Festival, and a three month tour of Australia. In 1984, Fry was engaged to do the rewrite of the Noel Gay musical \"Me and My Girl,\" which made him a millionaire before the age of 30. It also earned him a nomination for a Tony award in 1987. (Sidenote: It was upon SF's suggestion that Emma Thompson landed a leading role in the London cast of this show.) Throughout the 1980s, Fry did a huge amount of television and radio work, as well as writing for newspapers (e.g. a weekly column in the \"Daily Telegraph\") and magazines (e.g. articles for \"Arena\"). He is probably best known for his television roles in Black-Adder II (1986) and Jeeves and Wooster (1990). His support of the Terence Higgins Trust through events such as the first \"Hysteria\" benefit, as well as numerous other charity efforts, are probably those works of which he is most proud. Fry's acting career has not been limited to films and television. He had successful runs in Alan Bennett's \"Forty Years On,\" Simon Gray's \"The Common Pursuit\" with John Sessions, Rik Mayall, John Gordon Sinclair, and others. Michael Frayn's \"Look Look\" and Gray's \"Cell Mates\" were less successful for both Fry and their playwrights, the latter not helped by his walking out of the play after only a couple of weeks. Fry has published four novels as well as a collection of his radio and journalistic miscellanea. He has recorded audiotapes of his novels (an unabridged version of \"The Liar\" was released in 1995), as well as many other works for both adults and children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTEyNzc0MV5BMl5BanBnXkFtZTgwMDQwNDk0NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000410","name":"Stephen Fry","idIMDB":"nm0000410"},"actorId":"nm0000410","character":"Professor Mildeye","urlCharacter":"http://www.imdb.com/character/ch0182216","main":true},{"actorName":"Shaun Dooley","urlProfile":"http://www.imdb.com/name/nm0233215","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NjU2MDA4Ml5BMl5BanBnXkFtZTgwNjAzNzY5MjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1974","placeOfBirth":" Barnsley, Yorkshire, England, UK","height":"6' (1.83 m)","bio":"Shaun was born in Barnsley, South Yorkshire, to Ann and Denis Dooley. He has two younger sisters, Stephanie Dooley and Kimberly Dooley. Shaun is married to Polly Cameron. Despite living in London, Shaun still attends all of Barnsley FC's home games. Shaun won the RTS Northwest award for best actor in the award-winning film The Mark of Cain (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NjU2MDA4Ml5BMl5BanBnXkFtZTgwNjAzNzY5MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0233215","name":"Shaun Dooley","idIMDB":"nm0233215"},"actorId":"nm0233215","character":"Robert Millman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charlie Hiscock","urlProfile":"http://www.imdb.com/name/nm4193460","urlPhoto":"","biography":{"bio":"Charlie Hiscock was born in England. He is an actor, known for The Borrowers (2011), Combat Kids (2010) and The Making of the Borrowers (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4193460","name":"Charlie Hiscock","idIMDB":"nm4193460"},"actorId":"nm4193460","character":"James Millman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anne Hirsch","urlProfile":"http://www.imdb.com/name/nm4805086","urlPhoto":"","biography":{"bio":"Anne Hirsch is an actress, known for The Borrowers (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4805086","name":"Anne Hirsch","idIMDB":"nm4805086"},"actorId":"nm4805086","character":"Jenny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Warona Seane","urlProfile":"http://www.imdb.com/name/nm1738644","urlPhoto":"","biography":{"bio":"Warona Seane is an actress, known for Machine Gun Preacher (2011), The Borrowers (2011) and Hillside (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1738644","name":"Warona Seane","idIMDB":"nm1738644"},"actorId":"nm1738644","character":"Karen Richards","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jane Hill","urlProfile":"http://www.imdb.com/name/nm1162378","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Jane Hill yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1162378","name":"Jane Hill","idIMDB":"nm1162378"},"actorId":"nm1162378","character":"BBC News Presenter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonathan Blake","urlProfile":"http://www.imdb.com/name/nm0086606","urlPhoto":"","biography":{"bio":"Jonathan Blake is known for his work on The Web (1950), Force 10 from Navarone (1978) and Release (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0086606","name":"Jonathan Blake","idIMDB":"nm0086606"},"actorId":"nm0086606","character":"BBC Reporter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Catherine Burns","urlProfile":"http://www.imdb.com/name/nm4304617","urlPhoto":"","biography":{"bio":"Catherine Burns is an actress, known for Breakfast (2000) and The Borrowers (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4304617","name":"Catherine Burns","idIMDB":"nm4304617"},"actorId":"nm4304617","character":"Radio Voiceover","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1975269","urlIMDB":"http://www.imdb.com/title/tt1975269","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["16:9 HD"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.4","filmingLocations":[{"location":"Cape Town Film Studios, Cape Town, Western Cape, South Africa"}],"rated":"NOT RATED","awards":[],"votes":"1,190","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0044704","name":"Moonlighting Films"},{"idCompany":"co0043107","name":"British Broadcasting Corporation (BBC)"},{"idCompany":"co0026907","name":"Working Title Television"}],"keywords":{"keywords":["discovery","friendship","grandma","christmas"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:28:57"}}