{"data":{"movies":[{"title":"L'extravagant voyage du jeune et prodigieux T.S. Spivet","originalTitle":"The Young and Prodigious T.S. Spivet","year":"2013","releaseDate":"20150731","directors":[{"name":"Jean-Pierre Jeunet","id":"nm0000466"}],"writers":[{"name":"Jean-Pierre Jeunet","id":"nm0000466"},{"name":"Guillaume Laurant","id":"nm0491011"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDU1MTc5Ml5BMl5BanBnXkFtZTgwNzk2NDY2NjE@._V1.jpg","countries":["France","Australia","Canada"],"languages":["English"],"genres":["Action","Adventure","Drama","Family"],"plot":"T.S. Spivet lives on a ranch in Montana with his mother who is obsessed with the morphology of beetles, his father (a cowboy born a hundred years too late) and his 14 year-old sister who dreams of becoming Miss America. T.S. is a 10 year-old prodigy with a passion for cartography and scientific inventions. One day, he receives an unexpected call from the Smithsonian museum telling him that he is the winner of the very prestigious Baird prize for his discovery of the perpetual motion machine and that he is invited to a reception in his honor where he is expected to give a speech. Without telling anyone, he sets out on a freight train across the U.S.A. to reach Washington DC. There is also Layton, twin brother of T.S., who died in an accident involving a firearm in the family's barn, which no one ever speaks of. T.S. was with him, measuring the scale of the gunshots for an experiment, and he doesn't understand what happened.","simplePlot":"A ten-year-old scientist secretly leaves his family's ranch in Montana where he lives with his cowboy father and scientist mother, scapes home, and travels across the country aboard a freight train to receive an award at the Smithsonian Institute.","actors":[{"actorName":"Kyle Catlett","urlProfile":"http://www.imdb.com/name/nm3714535","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDAzNTMxMDY2N15BMl5BanBnXkFtZTcwNDkyNzA4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Kyle Catlett is an actor, known for L'extravagant voyage du jeune et prodigieux T.S. Spivet (2013), Poltergeist (2015) and The Pale of Settlement (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDAzNTMxMDY2N15BMl5BanBnXkFtZTcwNDkyNzA4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3714535","name":"Kyle Catlett","idIMDB":"nm3714535"},"actorId":"nm3714535","character":"T.S. Spivet","urlCharacter":"http://www.imdb.com/character/ch0315289","main":true},{"actorName":"Helena Bonham Carter","urlProfile":"http://www.imdb.com/name/nm0000307","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzUzMDg5MV5BMl5BanBnXkFtZTcwMDA5NDMwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1966","placeOfBirth":" Golders Green, London, England, UK","height":"5' 2\" (1.57 m)","bio":"Helena Bonham Carter is an actress of great versatility, one of the UK's finest and most successful. Bonham Carter was born May 26, 1966 in Golders Green, London, England, the youngest of three children of Elena (née Propper de Callejón), a psychotherapist, and Raymond Bonham Carter, a merchant banker. Through her father, she is the great-granddaughter of former Prime Minister Herbert H. Asquith, and her blue-blooded family tree also contains Barons and Baronesses, diplomats, and a director, Bonham Carter's great-uncle Anthony Asquith, who made Pygmalion (1938) and The Importance of Being Earnest (1952), among others. Cousin Crispin Bonham-Carter is also an actor. Her maternal grandfather, Eduardo Propper de Callejón, was a Spanish diplomat who was awarded the honorific Righteous Among the Nations, by Israel, for helping save Jews during World War II (Eduardo's own father was a Czech Jew). Helena's maternal grandmother, Hélène Fould-Springer, was from an upper-class Jewish family from France, Austria, and Germany, and later converted to her husband's Catholic faith. Bonham Carter experiencing family dramas during her childhood, including her father's stroke - which left him wheelchair-bound. She attended South Hampstead High School and Westminster School in London, and subsequently devoted herself to an acting career. That trajectory actually began in 1979 when, at age thirteen, she entered a national poetry writing competition and used her second place winnings to place her photo in the casting directory \"Spotlight.\" She soon had her first agent and her first acting job, in a commercial, at age sixteen. She then landed a role in the made-for-TV movie A Pattern of Roses (1983), which subsequently led to her casting in the Merchant Ivory films A Room with a View (1985), director James Ivory's tasteful adaptation of E.M. Forster's novel, and Lady Jane (1986), giving a strong performance as the uncrowned Queen of England. She had roles in three other productions under the Merchant-Ivory banner (director Ivory, producer Ismail Merchant, and screenwriter Ruth Prawer Jhabvala): an uncredited appearance in Maurice (1987), and large roles in Where Angels Fear to Tread (1991) and Howards End (1992). Often referred to as the \"corset queen\" or \"English rose\" because of her early work, Bonham Carter continued to surprise audiences with magnificent performances in a variety of roles from her more traditional corset-clad character in The Wings of the Dove (1997) and Shakespearian damsels to the dark and neurotic anti-heroines of Fight Club (1999). Her acclaimed performance in The Wings of the Dove (1997) earned her a Best Actress Academy Award nomination, a Golden Globe Best Actress nomination, a BAFTA Best Actress nomination, and a SAG Awards Best Actress nomination. It also won her a Best Actress Award from the National Board of Review, the Los Angeles Film Critics, the Boston Society Film Critics, the Broadcast Film Critics Association, the Texas Society of Film Critics, and the Southeastern Film Critics Association. In the late 1990s, Bonham Carter embarked on the next phase of her career, moving from capable actress to compelling star. Audiences and critics had long been enchanted by her delicate beauty, evocative of another time and place. Her late '90s and early and mid 2000s roles included Mick Jackson's Live from Baghdad (2002), alongside Michael Keaton, receiving a nomination for both an Emmy and a Golden Globe; Paul Greengrass' The Theory of Flight (1998), in which she played a victim of motor neurone disease; Trevor Nunn's La nuit des rois (1996), in which she played Olivia; opposite Woody Allen in his Mighty Aphrodite (1995); Mort Ransen's Margaret's Museum (1995); Kenneth Branagh's Mary Shelley's Frankenstein (1994); and Franco Zeffirelli's Hamlet (1990). Other notable credits include her appearance with Steve Martin in Novocaine (2001), Tim Burton's remake of Planet of the Apes, in which she played an ape, Thaddeus O'Sullivan's The Heart of Me (2002), opposite Paul Bettany, and Big Fish (2003), her second effort with Tim Burton, in which she appeared as a witch. In between her films, Helena has managed a few television appearances, which include her portrayal of Jacqui Jackson in Magnificent 7 (2005), the tale of a mother struggling to raise seven children - three daughters and four autistic boys; as Anne Boleyn in the two parter biopic of Henry VIII starring Ray Winstone; and as Morgan Le Fey, alongside Sam Neill and Miranda Richardson, in Merlin. Earlier television appearances include Michael Mann's Miami Vice (1984) as Don Johnson's junkie fiancée, and as a stripper who wins Rik Mayall's heart in Dancing Queen (1993). Helena has also appeared on stage, in productions of Trelawney of the Wells, The Barber of Seville, House of Bernarda Alba, The Chalk Garden, and Woman in White. Bonham Carter was nominated for a Golden Globe for the fifth time for her role in partner Tim Burton's film adaptation of the Stephen Sondheim musical, Sweeney Todd: The Demon Barber of Fleet Street (2007), for which Burton and co-star Johnny Depp were also nominated. For the role, she was awarded Best Actress at the Evening Standard British Film Awards 2008. Other 2000s work includes playing Mrs Bucket in Tim Burton's massive hit Charlie and the Chocolate Factory (2005), providing the voices for the aristocratic Lady Campanula Tottington in The Curse of the Were-Rabbit (2005) and for the eponymous dead heroine in Tim Burton's spooky Corpse Bride (2005), and co-starring in Conversations with Other Women (2005) opposite Aaron Eckhart. Since their meeting while filming Planet of the Apes (2001), Bonham Carter and Tim Burton have made seven movies together. They live in adjoining residences in London, sharing a connecting hallway, and have two children: Billy Ray Burton, 4, and Nell Burton, who was born December 15, 2007. Ironically, a mutual love of Sweeney Todd was part of the initial attraction for the pair. Despite that, Bonham Carter has said in numerous interviews that her audition process for the role of Mrs. Lovett was the most grueling of her career and that, ultimately, it was Sondheim who she had to convince that she was right for the role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzUzMDg5MV5BMl5BanBnXkFtZTcwMDA5NDMwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000307","name":"Helena Bonham Carter","idIMDB":"nm0000307"},"actorId":"nm0000307","character":"Dr. Clair, mom","urlCharacter":"http://www.imdb.com/character/ch0314503","main":true},{"actorName":"Judy Davis","urlProfile":"http://www.imdb.com/name/nm0001114","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NzA1ODU0NV5BMl5BanBnXkFtZTcwNTk5ODQxOA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 April 1955","placeOfBirth":" Perth, Western Australia, Australia","height":"5' 5\" (1.65 m)","bio":"Judy Davis was born April 23, 1955 in Perth, Western Australia. She was educated at Loreto Convent and the Western Institute of Technology, and graduated from the National Institute of Dramatic Art (NIDA) in 1977. She came to prominence as Sybylla Melvyn in the film adaptation of Miles Franklin's novel, My Brilliant Career (1979). She came to international success with the role of Adela Quested, in A Passage to India (1984), for which she was nominated an Oscar. Judy Went on to appear in one of several Woody Allen films, Husbands and Wives (1992). She played Sally, one-half of a couple going through a divorce. Her performance earned Judy her second Oscar nomination.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NzA1ODU0NV5BMl5BanBnXkFtZTcwNTk5ODQxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001114","name":"Judy Davis","idIMDB":"nm0001114"},"actorId":"nm0001114","character":"G.H. Jibsen","urlCharacter":"http://www.imdb.com/character/ch0506794","main":true},{"actorName":"Callum Keith Rennie","urlProfile":"http://www.imdb.com/name/nm0719678","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MTUyMDczMl5BMl5BanBnXkFtZTgwOTk4MzI0OTE@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1960","placeOfBirth":" Sunderland, Tyne-and-Wear, England, UK","height":"5' 11\" (1.8 m)","bio":"Callum Keith Rennie was born in England, raised in Alberta, Canada and came late to acting - he discovered theatre in Edmonton at the age of 25. Starting out in university radio and working his way to the renowned Shaw Festival, Callum moved to Vancouver and quickly caught the eye of producers and directors. Currently he lives in Vancouver.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MTUyMDczMl5BMl5BanBnXkFtZTgwOTk4MzI0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0719678","name":"Callum Keith Rennie","idIMDB":"nm0719678"},"actorId":"nm0719678","character":"Father","urlCharacter":"http://www.imdb.com/character/ch0506793","main":true},{"actorName":"Niamh Wilson","urlProfile":"http://www.imdb.com/name/nm1509081","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjJmMWQyZTctODUxOC00YjU3LThkNTItM2ExZjZmNjViYmE4XkEyXkFqcGdeQXVyNzA0ODY0Nw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 March 1997","placeOfBirth":" Oakville, Ontario, Canada","height":"5' 7\" (1.7 m)","bio":"Niamh (pronounced \"Neve\") Wilson began her career while only in preschool. Only weeks after signing with an agent she landed a role in a Warner Bros. pilot, Chasing Alice, playing the title character as a young girl. While the pilot did not result in a series, the experience served Niamh well as she moved on to work in commercials, TV and film. The 2005 Lifetime TV original movie Haunting Sarah was Niamh's first challenging role. Director Ralph Hemecker remembered Niamh from his pilot, Chasing Alice, and cast her as a young girl haunted by the spirit of her cousin in this supernatural thriller. The result won Niamh a Best Supporting Actress in a MOW Young Artist Award in 2006 for Haunting Sarah. By the time she was in middle school she'd portrayed a ghost and an alien, been haunted, possessed, kidnapped and blown up. Over a decade of screen credits include Saw 3 through 6, The Marsh, and MOW such as Haunting Sarah (for which she won a Young Artist Award for best supporting Actress in a MOW at age eight) episodic appearances in Heartland, RookieBlue, Flashpoint, Falling Skies, Haven, My Babysitter is a Vampire,Warehouse 13, Hemlock Grove, Between, The Good Witch, the web series Inhuman Condition, and MOW Early Release. Comedic roles eluded Niamh until she landed the title role in Cookie Jar Entertainment's tween-oriented sitcom Debra! (for which she won a Young Artist Award for Best Performance in a TV Series - Leading Young Actress and Outstanding Young Ensemble in a TV Series in 2011.) Niamh takes a very craft-driven approach to her work, believing every member of the production team is critical to the final outcome of the project. Without the interconnection of talented crew and actors, her own efforts would not succeed. Her role as fame-hungry Gracie in Jean Pierre Jeunet's The Young and Prodigious T. S. Spivet was an exceptional opportunity to work with the celebrated French director. Her work in Spivet has garnered her a Young Artist Award for Best Supporting Film Actress. In 2013 she worked on David Cronenberg's Map to the Stars. She spent two seasons on the teen soap Degrassi, as Jack Jones. Niamh lives in Toronto, Ontario. She is known for her sarcastic wit and hard work; fluent in French, a devoted yogi, passionate dancer and vegan foodie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjJmMWQyZTctODUxOC00YjU3LThkNTItM2ExZjZmNjViYmE4XkEyXkFqcGdeQXVyNzA0ODY0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1509081","name":"Niamh Wilson","idIMDB":"nm1509081"},"actorId":"nm1509081","character":"Gracie","urlCharacter":"http://www.imdb.com/character/ch0465285","main":true},{"actorName":"Jakob Davies","urlProfile":"http://www.imdb.com/name/nm3240434","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2UxYjRhOGMtZDkwZi00MzU0LTgzNzUtMDVlMjVjMGI0NmE5XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 2003","placeOfBirth":" White Rock, British Columbia, Canada","height":"5' 1\" (1.55 m)","bio":"Jakob Davies began acting in 2009 and was featured in several National and International Commercials. Jakob quickly transitioned to Television and Movies where he has been cast in 24 productions to date. He has been fortunate to portray iconic characters such as \"Lex Luther\" (Smallville) and the recurring role of \"Pinocchio\" on ABC's \"Once Upon a Time\". He has worked with Director Jean-Pierre Jeunet (Amelie) in \"The Young and Prodigious Spivet\", and co starred with Chloe Grace Moretz in the feature film \"If I Stay\". Despite his acting credits, Jakob remains grounded attending public school where he enjoys spending time with his friends. He participates in team sports (Football) and continues to love acting where strives to be his best in each and every project put before him.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2UxYjRhOGMtZDkwZi00MzU0LTgzNzUtMDVlMjVjMGI0NmE5XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3240434","name":"Jakob Davies","idIMDB":"nm3240434"},"actorId":"nm3240434","character":"Layton","urlCharacter":"http://www.imdb.com/character/ch0315290","main":true},{"actorName":"Rick Mercer","urlProfile":"http://www.imdb.com/name/nm0580300","urlPhoto":"","biography":{"dateOfBirth":"17 October 1969","placeOfBirth":" St. John's, Newfoundland, Canada","birthName":"Rick Vincent Mercer","height":"5' 9½\" (1.77 m)","bio":"Rick Mercer was born on October 17, 1969 in St. John's, Newfoundland, Canada as Rick Vincent Mercer. He is a writer and actor, known for The Industry (1998), The Rick Mercer Report (2004) and Talking to Americans (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0580300","name":"Rick Mercer","nicknames":["Canadian Parliament's \"Unofficial Opposition\""],"idIMDB":"nm0580300"},"actorId":"nm0580300","character":"Roy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dominique Pinon","urlProfile":"http://www.imdb.com/name/nm0684500","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2Njg1MDQ2MF5BMl5BanBnXkFtZTcwODQ3Mjk1OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1955","placeOfBirth":" Saumur, Maine-et-Loire, Pays de la Loire, France","birthName":"Dominique Jean-Claude Pinon","height":"5' 6\" (1.68 m)","bio":"Born in Saumur, France on 4th March, 1955, Dominique Pinon made his first cinematic appearance in 1980, in La Decouverte. Since that time he has gained a somewhat cult status due to his 'rubber' features, gaining roles in French surrealist films. Pinon's most notable roles include Jean-Pierre Jeunet's Amélie and Delicatessen, in which he played the characters of Joseph and Louison, respectively. Pinon also played the role of Vriess in the 1997 film Alien: Resurrection alongside Sigourney Weaver and Winona Ryder.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2Njg1MDQ2MF5BMl5BanBnXkFtZTcwODQ3Mjk1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0684500","name":"Dominique Pinon","idIMDB":"nm0684500"},"actorId":"nm0684500","character":"Two Clouds / Deux Nuages","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julian Richings","urlProfile":"http://www.imdb.com/name/nm0724995","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc5YzExMGItZTNlYy00MzlhLWE0ODUtMzAwZTdkYmM4NjQ2L2ltYWdlXkEyXkFqcGdeQXVyNTE4ODI4ODE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 September 1955","placeOfBirth":" Hampstead, London, England, UK","height":"5' 10\" (1.78 m)","bio":"Julian Richings was born in Oxford, England, and has become a familiar figure to Canadian cinema and television audiences, appearing in over 50 films and 20 separate television series. After training in drama at the University of Exeter and touring North America with a British stage production, Mr. Richings moved to Toronto, Canada in 1984. Within five years, he had become a regular on the second season of the Canadian War of the Worlds (1988) TV series. Other roles followed, and he gained critical acclaim as the bitter, aging punk rock legend Bucky Haight in Bruce McDonald's mock-documentary Hard Core Logo (1996). His appearance in Vincenzo Natali's Cube (1997) was brief, but definitely memorable. In 2000, Mr. Richings appeared as Francis Bellanger, an itinerant railroad worker who falls in love with a prostitute (played by Shirley Henderson), in The Claim (2000), and the role earned him a Genie Award nomination for best supporting actor. His performance as the nearly-blind security guard Otto in Stephen King's Kingdom Hospital (2004) was considered especially impressive by many critics. A busy stage actor as well, Mr. Richings was presented with two Dora Awards in the late 1980s and continues to perform professionally in the Toronto area. He tends to appear in small, experimental theaters and has been known to work for free if he thinks the material is interesting enough. In addition to acting, Mr. Richings has taught seminars and classes on acting and on movement for actors in the Toronto area for nearly twenty years. Mr. Richings is married and has two children. He resides with his family in Toronto.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc5YzExMGItZTNlYy00MzlhLWE0ODUtMzAwZTdkYmM4NjQ2L2ltYWdlXkEyXkFqcGdeQXVyNTE4ODI4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0724995","name":"Julian Richings","idIMDB":"nm0724995"},"actorId":"nm0724995","character":"Ricky","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Jutras","urlProfile":"http://www.imdb.com/name/nm0433268","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMzQ4MDQwMV5BMl5BanBnXkFtZTgwMDUwODUzODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Born in Montreal, Quebec, Canada - and the son of a French Canadian taxi driver and an Irish/French homemaker - Richard has been acting and singing since he was 15 years old - after seeing a production of ''Same Time, Next Year'' on Broadway. Richard then let his fingers do the walking and found the Actor's Studio in Montreal. He has never looked back and has had the honor to work opposite some of The Finest Artists in the Entertainment Industry. Richard is writing a pilot with Joanne Vannicola for a new series that is in development.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMzQ4MDQwMV5BMl5BanBnXkFtZTgwMDUwODUzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0433268","name":"Richard Jutras","idIMDB":"nm0433268"},"actorId":"nm0433268","character":"Mr. Stenpock","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mairtin O'Carrigan","urlProfile":"http://www.imdb.com/name/nm1884858","urlPhoto":"","biography":{"bio":"Mairtin O'Carrigan is an actor, known for Spotlight (2015), The Boondock Saints II: All Saints Day (2009) and L'extravagant voyage du jeune et prodigieux T.S. Spivet (2013). He is married to Debi McGuin. They have three children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1884858","name":"Mairtin O'Carrigan","idIMDB":"nm1884858"},"actorId":"nm1884858","character":"Lecturer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michel Perron","urlProfile":"http://www.imdb.com/name/nm0674837","urlPhoto":"","biography":{"bio":"Born in Richmond, Quebec, he trained at Dawson College in Montreal from 1980-1983, where he discovered his calling in life and developed a serious passion for theatre. This passion has grown through the years to include film, television, radio, dubbing and original voice animation, cabaret, musicals... and the list goes on.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0674837","name":"Michel Perron","idIMDB":"nm0674837"},"actorId":"nm0674837","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dawn Ford","urlProfile":"http://www.imdb.com/name/nm0285603","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxOTY5ODUwMV5BMl5BanBnXkFtZTgwNDQ2NjEyMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Patricia Dawn Ford","bio":"Dawn Ford was born as Patricia Dawn Ford. She is known for her work on Garm Wars: The Last Druid (2014), L'extravagant voyage du jeune et prodigieux T.S. Spivet (2013) and Deus Ex: Mankind Divided (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxOTY5ODUwMV5BMl5BanBnXkFtZTgwNDQ2NjEyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0285603","name":"Dawn Ford","idIMDB":"nm0285603"},"actorId":"nm0285603","character":"Marge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harry Standjofski","urlProfile":"http://www.imdb.com/name/nm0822092","urlPhoto":"","biography":{"dateOfBirth":"22 May 1959","placeOfBirth":" Montreal, Quebec, Canada","bio":"Harry Standjofski was born on May 22, 1959 in Montreal, Quebec, Canada. He is an actor and writer, known for Aviator (2004), X-Men: Days of Future Past (2014) and The Walk (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0822092","name":"Harry Standjofski","idIMDB":"nm0822092"},"actorId":"nm0822092","character":"Policeman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susan Glover","urlProfile":"http://www.imdb.com/name/nm0323177","urlPhoto":"","biography":{"bio":"Susan Glover is known for her work on I'm Not There. (2007), L'extravagant voyage du jeune et prodigieux T.S. Spivet (2013) and Deus Ex: Human Revolution (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0323177","name":"Susan Glover","idIMDB":"nm0323177"},"actorId":"nm0323177","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1981107","urlIMDB":"http://www.imdb.com/title/tt1981107","business":{"budget":{"money":"$33,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$33,658","country":"USA","day":"02","month":"08","year":"2015","remarks":"100 Screens"},{"money":"HUF 2,307,160","country":"Hungary","day":"28","month":"09","year":"2014","remarks":""}],"gross":[{"money":"$99,462","country":"USA","day":"30","month":"08","year":"2015","remarks":""},{"money":"$89,750","country":"USA","day":"23","month":"08","year":"2015","remarks":""},{"money":"$69,694","country":"USA","day":"09","month":"08","year":"2015","remarks":""},{"money":"$33,658","country":"USA","day":"02","month":"08","year":"2015","remarks":""}],"weekendGross":[{"money":"$1,886","country":"USA","day":"30","month":"08","year":"2015","remarks":"4 Screens"},{"money":"$12,091","country":"USA","day":"23","month":"08","year":"2015","remarks":"11 Screens"},{"money":"$7,528","country":"USA","day":"09","month":"08","year":"2015","remarks":"30 Screens"},{"money":"$33,658","country":"USA","day":"02","month":"08","year":"2015","remarks":"100 Screens"}],"admissions":[{"money":"15,143","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""},{"money":"14,102","country":"Netherlands","day":"31","month":"12","year":"2013","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"18","month":"06","year":"2012","remarks":null},{"money":null,"country":null,"day":"15","month":"10","year":"2012","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 45 min (105 min)"],"soundMix":["Dolby Digital"],"color":["Color","Color (HD)"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa M, Zeiss Master Prime and Ultra Prime Lenses","Arri Alexa Plus, Zeiss Master Prime and Ultra Prime Lenses"],"laboratory":["Digimage Cinéma, Paris, France"],"filmLength":["2,871 m"],"negativeFormat":["Codex"],"cinematographicProcess":["ARRIRAW (2.8K) (dual-strip 3-D) (source format)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["35 mm (anamorphic)","D-Cinema (also 3-D version)"]},"rating":"7.1","metascore":"53","filmingLocations":[{"location":"Longview, Alberta, Canada"}],"rated":"PG","awards":[{"award":"3D Creative Arts Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won Harold Lloyd Award","categories":[{"category":"","names":[{"name":"Jean-Pierre Jeunet","id":"nm0000466","role":"director"}]}]}]},{"award":"Camerimage 2014","titlesAwards":[{"titleAwardOutcome":"Won Best 3D Feature Film","categories":[{"category":"","names":[{"name":"Thomas Hardmeier","id":"nm0362473","role":null}]}]}]},{"award":"César Awards, France 2014","titlesAwards":[{"titleAwardOutcome":"Won César","categories":[{"category":"Best Cinematography (Meilleure photo)","names":[{"name":"Thomas Hardmeier","id":"nm0362473","role":null}]}]},{"titleAwardOutcome":"Nominated César","categories":[{"category":"Best Costume Design (Meilleurs costumes)","names":[{"name":"Madeline Fontaine","id":"nm0284837","role":null}]},{"category":"Best Production Design (Meilleurs décors)","names":[{"name":"Aline Bonetto","id":"nm0094355","role":null}]}]}]},{"award":"Jupiter Award 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Jupiter Award","categories":[{"category":"Best International Actress","names":[{"name":"Helena Bonham Carter","id":"nm0000307","role":null}]}]}]},{"award":"Lumiere Awards, France 2014","titlesAwards":[{"titleAwardOutcome":"Won CST Award","categories":[{"category":"","names":[{"name":"Thomas Hardmeier","id":"nm0362473","role":null}]}]}]},{"award":"World Soundtrack Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated World Soundtrack Award","categories":[{"category":"Discovery of the Year","names":[{"name":"Denis Sanacore","id":"nm5322480","role":null}]}]}]},{"award":"Young Artist Awards 2016","titlesAwards":[{"titleAwardOutcome":"Won Young Artist Award","categories":[{"category":"Best Performance in a Feature Film - Supporting Young Actress (14 - 21)","names":[{"name":"Niamh Wilson","id":"nm1509081","role":null}]}]},{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in a Feature Film - Leading Young Actor (10 and Under)","names":[{"name":"Kyle Catlett","id":"nm3714535","role":null}]}]}]},{"award":"Young Entertainer Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Young Entertainer Award","categories":[{"category":"Best Supporting Young Actress- Feature Film","names":[{"name":"Niamh Wilson","id":"nm1509081","role":null}]}]}]}],"votes":"12,678","type":"Movie","companyCreditsSimple":[{"idCompany":"co0033266","name":"Epithète Films"},{"idCompany":"co0047606","name":"Tapioca Films"},{"idCompany":"co0316131","name":"Filmarto"}],"keywords":{"keywords":["train","smithsonian","cartographer","3 dimensional","punctuation in title","period in title","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:20:30"}}