{"data":{"movies":[{"title":"Magic Mike","originalTitle":"","year":"2012","releaseDate":"20120629","directors":[{"name":"Steven Soderbergh","id":"nm0001752"}],"writers":[{"name":"Reid Carolin","id":"nm1730221"}],"runtime":"110 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMDMzOTA5M15BMl5BanBnXkFtZTcwMjc4MTg4Nw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama"],"plot":"Mike Lane is a thirty-year old living in Tampa,Florida. By day he works as a roofer while at night, as Magic Mike, he is the star attraction of the Kings of Tampa, a group of male strippers. Secretly he wants out in order to further a projected furniture-making business but his credit rating precludes a bank loan for this despite his considerable savings. One night Adam, a teen-aged work-mate of Mike, follows him to the club and, when one of the acts is unable to go on,he is prevailed upon to strip - becoming a huge hit. However success goes to his head and his foolish actions not only threaten to jeopardize his sister Brooke's relationship with Mike but Mike's ambitions as well.","simplePlot":"A male stripper teaches a younger performer how to party, pick up women, and make easy money.","actors":[{"actorName":"Matthew McConaughey","urlProfile":"http://www.imdb.com/name/nm0000190","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDc3ODUwOV5BMl5BanBnXkFtZTcwMTk2NjY4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 November 1969","placeOfBirth":" Uvalde, Texas, USA","birthName":"Matthew David McConaughey","height":"6' (1.83 m)","bio":"American actor and producer Matthew David McConaughey was born in Uvalde, Texas. His mother, Mary Kathleen (McCabe), is a substitute school teacher originally from New Jersey. His father, James Donald McConaughey, was a Mississippi-born gas station owner who ran an oil pipe supply business. He is of Scottish, Irish, English, German, and Swedish descent. Matthew grew up in Longview, Texas, where he graduated from the local High School (1988). Showing little interest in his father's oil business, which his two brothers later joined, Matthew was longing for a change of scenery, and spent a year in Australia, washing dishes and shoveling chicken manure. Back to the States, he attended the University of Texas in Austin, originally wishing to be a lawyer. But, when he discovered an inspirational Og Mandino book \"The Greatest Salesman in the World\" before one of his final exams, he suddenly knew he had to change his major from law to film. He began his acting career in 1991, appearing in student films and commercials in Texas and directed short films as Chicano Chariots (1992). Once, in his hotel bar in Austin, he met the casting director and producer Don Phillips, who introduced him to director Richard Linklater for his next project. At first, Linklater thought Matthew was too handsome to play the role of a guy chasing high school girls in his coming-of-age drama Dazed and Confused (1993), but cast him after Matthew grew out his hair and mustache. His character was initially in three scenes but the role grew to more than 300 lines as Linklater encouraged him to do some improvisations. In 1995, he starred in Texas Chainsaw Massacre: The Next Generation (1994), playing a mad bloodthirsty sadistic killer, opposite Renée Zellweger. Shortly thereafter, moving to L.A., Matthew became a sensation with his performances in two high-profile 1996 films Lone Star (1996), where he portrayed killing suspected sheriff and in the film adaptation of John Grisham's novel A Time to Kill (1996), where he played an idealistic young lawyer opposite Sandra Bullock and Kevin Spacey. The actor was soon being hailed as one of the industry's hottest young leading man inspiring comparisons to actor Paul Newman. His following performances were Robert Zemeckis' Contact (1997) with Jodie Foster (the film was finished just before the death of the great astronomer and popularizer of space science Carl Sagan) and Steven Spielberg's Amistad (1997), a fact-based 1839 story about the rebellious African slaves. In 1998, he teamed again with Richard Linklater as one of the bank-robbing brothers in The Newton Boys (1998), set in Matthew's birthplace, Uvalde, Texas. During this time, he also wrote, directed and starred in the 20-minute short The Rebel (1998). In 1999, he starred in the comedy Edtv (1999), about the rise of reality television, and in 2000, he headlined Jonathan Mostow's U-571 (2000), portraying officer Lt. Tyler, in a WW II story of the daring mission of American submariners trying to capture the Enigma cipher machine. In the 2000s, he became known for starring in romantic comedies, such as Un mariage trop parfait (2001), opposite Jennifer Lopez, and How to Lose a Guy in 10 Days (2003), in which he co-starred with Kate Hudson. He played Denton Van Zan, an American warrior and dragons hunter in the futuristic thriller Reign of Fire (2002), where he co-starred with Christian Bale. In 2006, he starred in the romantic comedy Failure to Launch (2006), and later as head coach Jack Lengyel in We Are Marshall (2006), along with Matthew Fox. In 2008, he played treasure hunter Benjamin \"Finn\" Finnegan in Fool's Gold (2008), again with Kate Hudson. After playing Connor Mead in Ghosts of Girlfriends Past (2009), co-starring with Jennifer Garner, McConaughey took a two year hiatus to open different opportunities in his career. Since 2010, he has moved away from romantic comedies. That change came in 2011, in his first movie after that pause, when he portrayed criminal defense attorney Mickey Haller in The Lincoln Lawyer (2011), that operates mostly from the back seat of his Lincoln car. After this performance that was considered one of his best until then, Matthew played other iconic characters as district attorney Danny Buck Davidson in Bernie (2011), the wild private detective \"Killer\" Joe Cooper in Killer Joe (2011), Mud in Mud (2012), reporter Ward Jensen in The Paperboy (2012), male stripper club owner Dallas in Magic Mike (2012), starring Channing Tatum. McConaughey's career certainly reached it's prime, when he played HIV carrier Ron Woodroof in the biographical drama Dallas Buyers Club (2013), shot in less than a month. For his portrayal of Ron, Matthew won the Best Actor in the 86th Academy Awards, as well as the Golden Globe Award for Best Actor, among other awards and nominations. The same year, he also appeared in Martin Scorsese's The Wolf of Wall Street (2013). In 2014, he starred in HBO's True Detective (2014), as detective Rustin Cohle, whose job is to investigate with his partner Martin Hart, played by Woody Harrelson, a gruesome murder that happened in his little town in Louisiana. The series was highly acclaimed by critics winning 4 of the 7 categories it was nominated at the 66th Primetime Emmy Awards; he also won a Critics' Choice Award for the role. Later in 2014, Matthew starred in Christopher Nolan's sci-fi film Interstellar (2014), playing Cooper, a former NASA pilot.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDc3ODUwOV5BMl5BanBnXkFtZTcwMTk2NjY4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000190","name":"Matthew McConaughey","idIMDB":"nm0000190"},"actorId":"nm0000190","character":"Dallas","urlCharacter":"http://www.imdb.com/character/ch0294033","main":true},{"actorName":"Channing Tatum","urlProfile":"http://www.imdb.com/name/nm1475594","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4OTI3Mzg2Nl5BMl5BanBnXkFtZTcwMDAxNTU3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1980","placeOfBirth":" Cullman, Alabama, USA","birthName":"Channing Matthew Tatum","height":"6' 1\" (1.85 m)","bio":"Channing Tatum was born in a small town, Cullman, Alabama, 50 miles north of Birmingham. He is the son of Kay (Faust), an airline worker, and Glenn Matthew Tatum, who worked in construction. Growing up, he was full of energy and somewhat troublesome, so his parents decided to enroll him in different sports such as track and field, baseball, soccer, and football to keep him out of trouble. In the ninth grade he was sent to Catholic school. It was there that he discovered his passion for football and his hopes became centered on earning an athletic college scholarship. Channing's goal was finally met, and in his senior year in high school, he was recruited and earned a full athletic college scholarship to a school in West Virginia. Tatum is also skilled in Kung Fu and in Gor-Chor Kung Fu, a form of martial arts, in which he has earned belts. Channing later left college and, in the meantime, worked as a construction worker, a stripper, a mortgage broker and salesman. He has modeled for Abercrombie & Fitch, Nautica, Gap, Aeropostale, Emporio Armani, and has been featured in television commercials for American Eagle, Pepsi, and some very popular Mountain Dew commercials. Channing can be seen on the big screen as a featured actor in Coach Carter (2005), in which he plays a high school basketball player. He was also in the very popular TV series CSI: Miami (2002) where he played the role of Bob Davenport.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4OTI3Mzg2Nl5BMl5BanBnXkFtZTcwMDAxNTU3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1475594","name":"Channing Tatum","nicknames":["Chan"],"idIMDB":"nm1475594"},"actorId":"nm1475594","character":"Magic Mike","urlCharacter":"http://www.imdb.com/character/ch0258050","main":true},{"actorName":"Olivia Munn","urlProfile":"http://www.imdb.com/name/nm1601397","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2OTMyNTczMV5BMl5BanBnXkFtZTcwNDc5MzIzMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 July 1980","placeOfBirth":" Oklahoma City, Oklahoma, USA","birthName":"Lisa Olivia Munn","height":"5' 4\" (1.63 m)","bio":"Lisa Olivia Munn was born in Oklahoma City, Oklahoma. Her mother, Kimberly Schmid, lived in Vietnam, and is of Chinese ancestry, while her father, Winston Barrett Munn, is from a family with deep roots in the American South. Olivia's parents divorced when she was two years old, and she was raised by her mother and stepfather, a member of the United States Air Force. Although the family departed Oklahoma and resided in many locations, she was mainly raised in Tokyo, Japan. During this time, she appeared in a number of local theater productions and later became a model in the Japanese fashion industry. When the family eventually returned to the United States, Olivia moved to Los Angeles to pursue her dream of becoming an actress. After a few small roles, her career took a very promising turn when she landed the role of Mily Acuna on the Hawaii-lensed TV series Beyond the Break (2006) and the role of Rob Schneider's receptionist in Big Stan (2007). She hosts \"The Daily Nut\" and the \"Formula D\" Podcasts on G4.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2OTMyNTczMV5BMl5BanBnXkFtZTcwNDc5MzIzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1601397","name":"Olivia Munn","nicknames":["The Geek Goddess"],"idIMDB":"nm1601397"},"actorId":"nm1601397","character":"Joanna","urlCharacter":"http://www.imdb.com/character/ch0309982","main":true},{"actorName":"Alex Pettyfer","urlProfile":"http://www.imdb.com/name/nm1641117","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNDIxNTY0M15BMl5BanBnXkFtZTgwODM0MDUzODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1990","placeOfBirth":" Stevenage, Hertfordshire, England, UK","birthName":"Alexander Richard Pettyfer","height":"5' 11¼\" (1.81 m)","bio":"Alexander Richard Pettyfer was born in Hertfordshire and raised in Windsor. His mother, Lee (Robinson), is an interior designer. His father, Richard Pettyfer, is a fellow actor. His parents divorced and Alex now has a younger half-brother, James, from his mother's re-marriage to a property developer, Michael Ireland. James is a junior tennis player. At age 7, Alex started modeling for Gap's children range. He also appeared in TV commercials for other brands. When he was older, he modeled for Burberry to fund his traveling adventures. Alex attended various private schools. During this time, he enjoyed performing in school plays. At age 13, he auditioned and won a role in the TV movie Tom Brown's Schooldays (2005). At age 15, he went to Los Angeles and was cast as \"Alex Rider\", the main character in Alex Rider: Operation Stormbreaker (2006) (aka \"Alex Rider: Operation Stormbreaker\"). This was his breakthrough role and he was nominated for a Young Artist Award and an Empire Award for this role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNDIxNTY0M15BMl5BanBnXkFtZTgwODM0MDUzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1641117","name":"Alex Pettyfer","idIMDB":"nm1641117"},"actorId":"nm1641117","character":"Adam","urlCharacter":"http://www.imdb.com/character/ch0309983","main":true},{"actorName":"James Martin Kelly","urlProfile":"http://www.imdb.com/name/nm0446457","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ1MDgyMDYwNl5BMl5BanBnXkFtZTgwODUyNjU2MDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1954","placeOfBirth":" Brooklyn, New York, USA","birthName":"James Martin Kelly","height":"5' 10\" (1.78 m)","bio":"James Martin Kelly was born in 1954 in the Flatbush section of Brooklyn, New York. Within a few years he moved to suburban Valley Stream, Long Island where at the age of 11 he performed on stage as a musician singing, playing the guitar and drums. By the 1980s Jim was a published songwriter and performer working in the recording studios and nightclubs of New York in lower Manhattan. To supplement his income and now married to Mary-Ellen of Long Island and with children, Jim became a postman with the US Postal Service. He secured a transfer to Hudson, Florida, but once there he realized there were many less opportunities in the music industry that he loved so much. His wife saw an advertisement on the television for auditions for the community theater and encouraged Jim to go, where he soon learned the trade of rejection. But he didn't give up. He played Beadle in \"Sweeny Todd\" at the Richey Suncoast Theater. A director of another show saw Jim and booked him in his show, this led to one engagement after another including Alan Squire in \"The Petrified Forest\". Jim at this time had agents in the Tampa area and they were sending him out on several auditions landing him work in commercials. Being in constant demand he had to make the choice whether to take the risk and leave the Post Office or pursue his acting career full time. He chose the latter and has no regrets at all. He decided to go with the agent that got him the best and most consistent work, which was Melanie Hurt of the Hurt Agency, Orlando. He has attended workshops with Kathy Laughlin in Tampa, Lori Wyman in Miami and several others. He spent 3 years learning the Eric Morris Technique at the Performers Studio perfecting scene study. Recently he attended a Primetime Audition workshop in New York with 'Julie Tucker' who casts for the TV show _\"Law & Order: Special Victims Unit\" (1999) _. Jim has appeared on Walker, Texas Ranger (1993) as mob boss Billy Bob Jackson in three episodes where his New York accent came in handy. He also appeared in Safe Harbor (1999). In Noah Knows Best (2000), shot at Universal, he played Big Frankie, Hanson's bodyguard. Jim played \"Mack' the owner of the Big Ace Saloon on Dawson's Creek (1998). In between theater and television, he hosted his own show: \"Kelly's Cellar\", on public television, when he and his wife produced the series. His guests consisted of comedians, musicians and actors and ran for two years. Some of his films include Olive Juice (2001), which recently premiered in Orlando. In Animal Factory (2000) with Steve Buscemi and Willem Dafoe, he played a correctional guard who has a rough face-to-face confrontation with Davoe. His most recent film, shot in Miami, was Big Trouble (2002) directed by 'Barry Sonnerfeld', when he played a Geo Salesman trying to sell a car. He also has a film To Kill A Lawyer (2001) soon to be shown at the Tampa Bay Film Festival. The film was shot in Tarpon Springs. Jim is very proud of his eighteen-year-old daughter Amanda who was given a full scholarship to Southern Methodist University for vocal performance. Music seems to run in the family. His sixteen-year-old daughter, Vanessa, is interested in acting and film. Her fascination seems to be in continuity in films. Thirteen-year-old Jim Jr. is into painting, sculpting and now his historical interest is in building ancient medieval armaments. Colin, twelve, is into skateboarding. When not working as an actor, Jim spends all of his time with his family just hanging out together, living outside Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ1MDgyMDYwNl5BMl5BanBnXkFtZTgwODUyNjU2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0446457","name":"James Martin Kelly","idIMDB":"nm0446457"},"actorId":"nm0446457","character":"Sal","urlCharacter":"http://www.imdb.com/character/ch0307451","main":true},{"actorName":"Cody Horn","urlProfile":"http://www.imdb.com/name/nm3158974","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDk0MDI4MzQwNV5BMl5BanBnXkFtZTcwMDI1MDkwNg@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 June 1988","placeOfBirth":" Los Angeles, California, USA","birthName":"Cody Harrell Horn","height":"5' 10½\" (1.79 m)","bio":"Cody was born and raised in Los Angeles, California. Her mother is a former model and actress. Her father is the chairman of Walt Disney Studios and was, formerly, the president of Warner Bros.. Following in her mother's footsteps, she began as a model appearing in the Ralph Lauren Polo Jeans Give Campaign. She had read her first screenplay when she was age 9 and knew she wanted to be involved in the business. She started out on television appearing in the high profile series Rescue Me (2004), The Office (2005) and White Collar (2009). In 2012, she is appearing in Steven Soderbergh's male stripping film Magic Mike (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDk0MDI4MzQwNV5BMl5BanBnXkFtZTcwMDI1MDkwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3158974","name":"Cody Horn","idIMDB":"nm3158974"},"actorId":"nm3158974","character":"Brooke","urlCharacter":"http://www.imdb.com/character/ch0309984","main":true},{"actorName":"Reid Carolin","urlProfile":"http://www.imdb.com/name/nm1730221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNzI2ODQ3Nl5BMl5BanBnXkFtZTcwNDA4OTMwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 January 1982","placeOfBirth":" Lake Forest, Illinois, USA","height":"6' 5\" (1.96 m)","bio":"Reid Carolin was born on January 10, 1982 in Lake Forest, Illinois, USA. He is a producer and writer, known for Magic Mike (2012), 22 Jump Street (2014) and Magic Mike XXL (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNzI2ODQ3Nl5BMl5BanBnXkFtZTcwNDA4OTMwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1730221","name":"Reid Carolin","idIMDB":"nm1730221"},"actorId":"nm1730221","character":"Paul","urlCharacter":"http://www.imdb.com/character/ch0455732","main":true},{"actorName":"Avery Camp","urlProfile":"http://www.imdb.com/name/nm4549964","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxOTIzMzc4OV5BMl5BanBnXkFtZTgwODE2Mjk3OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Stephanie Avery Camp","height":"5' 5\" (1.65 m)","bio":"Born Stephanie Avery Camp in the small town of Brooksville, Florida. Avery got her start modeling & commercial acting. Quickly booking over 20+ national, regional & local ads upon her start as a teenager. Avery decided she wanted more creative room and enrolled in film acting classes at Art's Sake Studio's in Winter Park, Florida. Driving 4 hours to fulfill this creative need, she fell in love with the craft. Avery then made her acting debut in 2012 in the blockbuster film 'Magic Mike'. At the same time booking the recurring role as the smart, edgy, charismatic 'Lauren' in MTV's scripted comedy, 'The Inbetweeners'.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxOTIzMzc4OV5BMl5BanBnXkFtZTgwODE2Mjk3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4549964","name":"Avery Camp","idIMDB":"nm4549964"},"actorId":"nm4549964","character":"Girl in Line","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George A. Sack","urlProfile":"http://www.imdb.com/name/nm1825981","urlPhoto":"","biography":{"bio":"George A. Sack is known for his work on 300: Rise of an Empire (2014), Magic Mike (2012) and Suburbicon (2017).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1825981","name":"George A. Sack","idIMDB":"nm1825981"},"actorId":"nm1825981","character":"George","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Micaela Johnson","urlProfile":"http://www.imdb.com/name/nm2358643","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzc2MTk1NF5BMl5BanBnXkFtZTcwNjYzMTY1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 4\" (1.63 m)","bio":"Micaela Johnson is an actress, known for Magic Mike (2012), The Last Turn (2008) and Walker, Texas Ranger: Trial by Fire (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzc2MTk1NF5BMl5BanBnXkFtZTcwNjYzMTY1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2358643","name":"Micaela Johnson","idIMDB":"nm2358643"},"actorId":"nm2358643","character":"Portia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Denise Vasi","urlProfile":"http://www.imdb.com/name/nm2185141","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MTgyNzMzOF5BMl5BanBnXkFtZTcwMDg3MDU4NA@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 March 1983","placeOfBirth":" New York City, New York, USA","height":"5' 5\" (1.65 m)","bio":"A Brooklyn native, Vasi signed to Ford Models at the age of 12. She went on to grace the pages of international campaigns for ELLE, Marie Claire, GQ Italy and more. She appeared in numerous on-camera and print campaigns for leading cosmetic, hair care and fashion brands including Olay, Bobbi Brown, Dove, Urban Decay, M·A·C, L'Oreal, Target, Doll House, American Eagle, Republic and more. Her breakout role was in ABC's longstanding daytime soap opera \"All My Children\". Vasi starred as Randi Morgan, former prostitute and wife of series veteran Frankie Hubbard from 2008-2011. Vasi relocated with production from New York to Los Angeles. She was seen as Ruby in the critically acclaimed Steven Soderbergh-directed feature film Magic Mike, opposite Channing Tatum and Matthew McConaughey, and in Charles Murray's debut indie drama Things Never Said. Vasi starred as smart, savvy, businesswoman, and leading lady Raquel Lancaster in VH1's hit, one-hour scripted series, \"Single Ladies.\" Which was produced for three seasons by Queen Latifah's Flavor Unit Entertainment, \"Single Ladies\" chronicles three friends and their take on love, dating and female friendship. Vasi's additional credits include feature films \"The Good Guy\" opposite Alexis Bledel, and \"What's Your Number?\" opposite Anna Faris and Chris Evans, and roles on television shows \"White Collar,\" \"Law and Order: Criminal Intent,\" \"The Protector,\" and \"How To Make It In America.\" Vasi's other interests include dance, fitness and philanthropy. She helped raise over $800,000 for addiction recovery as co-chairman of Caron Renaissance's \"Save A Life Event.\" Vasi resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MTgyNzMzOF5BMl5BanBnXkFtZTcwMDg3MDU4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2185141","name":"Denise Vasi","idIMDB":"nm2185141"},"actorId":"nm2185141","character":"Ruby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Camryn Grimes","urlProfile":"http://www.imdb.com/name/nm0342190","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2ODE0Mzg5NzdeQTJeQWpwZ15BbWU3MDY4NzkzMDg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1990","placeOfBirth":" Van Nuys, California, USA","birthName":"Camryn Elizabeth Grimes","height":"5' 6\" (1.68 m)","bio":"Camryn Grimes was born on January 7, 1990 in Van Nuys, California, USA as Camryn Elizabeth Grimes. She is an actress and producer, known for The Young and the Restless (1973), Swordfish (2001) and Magic Mike (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2ODE0Mzg5NzdeQTJeQWpwZ15BbWU3MDY4NzkzMDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0342190","name":"Camryn Grimes","nicknames":["Cami"],"idIMDB":"nm0342190"},"actorId":"nm0342190","character":"Birthday Girl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kate Easton","urlProfile":"http://www.imdb.com/name/nm3234693","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGQwYjQ1NTQtMDgyNi00NjMwLTgzYTktZTc4YzI3YjBmY2U0XkEyXkFqcGdeQXVyMjA4Mjc4Mzg@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Kate Easton is an actress, known for Magic Mike (2012), Love & Other Drugs (2010) and The Knick (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGQwYjQ1NTQtMDgyNi00NjMwLTgzYTktZTc4YzI3YjBmY2U0XkEyXkFqcGdeQXVyMjA4Mjc4Mzg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3234693","name":"Kate Easton","idIMDB":"nm3234693"},"actorId":"nm3234693","character":"Liz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Asher Wallis","urlProfile":"http://www.imdb.com/name/nm5109714","urlPhoto":"","biography":{"bio":"Asher Wallis is an actor, known for Magic Mike (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5109714","name":"Asher Wallis","idIMDB":"nm5109714"},"actorId":"nm5109714","character":"Obnoxious Bar Guy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Manganiello","urlProfile":"http://www.imdb.com/name/nm0542133","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NTkyMDYyOF5BMl5BanBnXkFtZTgwNjkyNzc4OTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1976","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Joseph Michael Manganiello","height":"6' 5\" (1.96 m)","bio":"Joe Manganiello is an American actor. He was born in Pittsburgh, Pennsylvania, to Susan (Brachanow) and Charles John Manganiello, and has a younger brother, Nicholas. His father is of Italian descent and his mother has German/Austrian/Croatian and Armenian ancestry. Joe was raised in Mount Lebanon and attended Mount Lebanon high school. During school, he was good at sports and was captain of the football, basketball and volleyball teams. He went on to play varsity level in all three. It was during school that he enjoyed making films with his friends and, as a result, became interested in acting. He went on to study acting at Carnegie Mellon, after which he moved to Los Angeles. He landed a great first job as 'Flash Thompson' in Spider-Man (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NTkyMDYyOF5BMl5BanBnXkFtZTgwNjkyNzc4OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0542133","name":"Joe Manganiello","idIMDB":"nm0542133"},"actorId":"nm0542133","character":"Big Dick Richie","urlCharacter":"http://www.imdb.com/character/ch0304414","main":true}],"seasons":[],"idIMDB":"tt1915581","urlIMDB":"http://www.imdb.com/title/tt1915581","business":{"budget":{"money":"$7,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$39,127,170","country":"USA","day":"01","month":"07","year":"2012","remarks":"2,930 Screens"},{"money":"£2,651,015","country":"UK","day":"15","month":"07","year":"2012","remarks":"446 Screens"},{"money":"€93,067","country":"Portugal","day":"15","month":"07","year":"2012","remarks":"51 Screens"}],"gross":[{"money":"$113,721,571","country":"USA","day":"27","month":"09","year":"2012","remarks":""},{"money":"$113,709,992","country":"USA","day":"23","month":"09","year":"2012","remarks":""},{"money":"$113,665,031","country":"USA","day":"16","month":"09","year":"2012","remarks":""},{"money":"$113,578,737","country":"USA","day":"09","month":"09","year":"2012","remarks":""},{"money":"$113,427,040","country":"USA","day":"02","month":"09","year":"2012","remarks":""},{"money":"$112,720,182","country":"USA","day":"19","month":"08","year":"2012","remarks":""},{"money":"$112,238,949","country":"USA","day":"12","month":"08","year":"2012","remarks":""},{"money":"$110,928,677","country":"USA","day":"05","month":"08","year":"2012","remarks":""},{"money":"$107,625,983","country":"USA","day":"29","month":"07","year":"2012","remarks":""},{"money":"$101,966,459","country":"USA","day":"22","month":"07","year":"2012","remarks":""},{"money":"$91,841,198","country":"USA","day":"15","month":"07","year":"2012","remarks":""},{"money":"$72,829,107","country":"USA","day":"08","month":"07","year":"2012","remarks":""},{"money":"$39,127,170","country":"USA","day":"01","month":"07","year":"2012","remarks":""},{"money":"£8,111,970","country":"UK","day":"12","month":"08","year":"2012","remarks":""},{"money":"£7,638,076","country":"UK","day":"05","month":"08","year":"2012","remarks":""},{"money":"£6,697,323","country":"UK","day":"29","month":"07","year":"2012","remarks":""},{"money":"£5,250,974","country":"UK","day":"22","month":"07","year":"2012","remarks":""},{"money":"£2,651,015","country":"UK","day":"15","month":"07","year":"2012","remarks":""},{"money":"$167,221,571","country":"Worldwide","day":"27","month":"09","year":"2012","remarks":""},{"money":"€325,057","country":"Portugal","day":"08","month":"08","year":"2012","remarks":""},{"money":"€283,367","country":"Portugal","day":"01","month":"08","year":"2012","remarks":""},{"money":"€219,653","country":"Portugal","day":"25","month":"07","year":"2012","remarks":""},{"money":"€136,681","country":"Portugal","day":"18","month":"07","year":"2012","remarks":""}],"weekendGross":[{"money":"$20,557","country":"USA","day":"23","month":"09","year":"2012","remarks":"55 Screens"},{"money":"$49,163","country":"USA","day":"16","month":"09","year":"2012","remarks":"115 Screens"},{"money":"$92,919","country":"USA","day":"09","month":"09","year":"2012","remarks":"202 Screens"},{"money":"$158,066","country":"USA","day":"02","month":"09","year":"2012","remarks":"268 Screens"},{"money":"$199,389","country":"USA","day":"19","month":"08","year":"2012","remarks":"255 Screens"},{"money":"$422,331","country":"USA","day":"12","month":"08","year":"2012","remarks":"450 Screens"},{"money":"$1,414,372","country":"USA","day":"05","month":"08","year":"2012","remarks":"1,202 Screens"},{"money":"$2,619,128","country":"USA","day":"29","month":"07","year":"2012","remarks":"2,075 Screens"},{"money":"$4,291,432","country":"USA","day":"22","month":"07","year":"2012","remarks":"2,606 Screens"},{"money":"$9,021,123","country":"USA","day":"15","month":"07","year":"2012","remarks":"3,090 Screens"},{"money":"$15,642,337","country":"USA","day":"08","month":"07","year":"2012","remarks":"3,120 Screens"},{"money":"$39,127,170","country":"USA","day":"01","month":"07","year":"2012","remarks":"2,930 Screens"}],"admissions":null,"productionDates":{"money":null,"country":null,"day":"08","month":"08","year":"2011","remarks":null},"filmingDates":[{"money":null,"country":null,"day":"26","month":"09","year":"2011","remarks":null},null],"copyrightHolder":"The Estate of Redmond Barry, LLC"},"technical":{"runtime":["1 hr 50 min (110 min)"],"soundMix":["SDDS","Datasat","Dolby Digital"],"color":["Color","Black and White"],"aspectRatio":["2.35 : 1"],"camera":["Red Epic, Hawk V-Lite, V-Plus and V-Series Lenses"],"laboratory":["FotoKem Laboratory, Burbank (CA), USA (digital intermediate)"],"filmLength":null,"negativeFormat":["Redcode RAW (5K)"],"cinematographicProcess":["Digital Intermediate (4K) (master format)","Hawk Scope (anamorphic) (source format)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)","D-Cinema"]},"rating":"6.1","metascore":"72","filmingLocations":[{"location":"Tampa, Florida, USA"}],"rated":"R","awards":[{"award":"Austin Film Critics Association 2012","titlesAwards":[{"titleAwardOutcome":"Won Special Honorary Award","categories":[{"category":"","names":[{"name":"Matthew McConaughey","id":"nm0000190","role":null},{"name":"Bernie","id":"tt1704573","role":null},{"name":"Killer Joe","id":"tt1726669","role":null},{"name":"The Paperboy","id":"tt1496422","role":null}]}]}]},{"award":"Broadcast Film Critics Association Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Critics Choice Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Matthew McConaughey","id":"nm0000190","role":null}]}]}]},{"award":"Casting Society of America, USA 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Outstanding Achievement in Casting - Studio or Independent Feature - Drama","names":[{"name":"Carmen Cuba","id":"nm0002480","role":"casting director"},{"name":"Wittney Horton","id":"nm0395692","role":"associate"}]}]}]},{"award":"Central Ohio Film Critics Association 2013","titlesAwards":[{"titleAwardOutcome":"Won COFCA Award","categories":[{"category":"Actor of the Year","names":[{"name":"Matthew McConaughey","id":"nm0000190","role":null},{"name":"Killer Joe","id":"tt1726669","role":null},{"name":"Bernie","id":"tt1704573","role":null},{"name":"The Paperboy","id":"tt1496422","role":null}]}]},{"titleAwardOutcome":"Nominated COFCA Award","categories":[{"category":"Actor of the Year","names":[{"name":"Channing Tatum","id":"nm1475594","role":null},{"name":"21 Jump Street","id":"tt1232829","role":null},{"name":"Haywire","id":"tt1506999","role":null},{"name":"The Vow","id":"tt1606389","role":null}]}]}]},{"award":"Detroit Film Critic Society, US 2012","titlesAwards":[{"titleAwardOutcome":"Nominated DFCS Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Matthew McConaughey","id":"nm0000190","role":null}]}]}]},{"award":"Film Independent Spirit Awards 2013","titlesAwards":[{"titleAwardOutcome":"Won Independent Spirit Award","categories":[{"category":"Best Supporting Male","names":[{"name":"Matthew McConaughey","id":"nm0000190","role":null}]}]}]},{"award":"Gay and Lesbian Entertainment Critics Association (GALECA) 2013","titlesAwards":[{"titleAwardOutcome":"Won Dorian Award","categories":[{"category":"Campy Flick of the Year","names":[]}]}]},{"award":"Houston Film Critics Society Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated HFCS Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Matthew McConaughey","id":"nm0000190","role":null}]}]}]},{"award":"Indiewire Critics' Poll 2012","titlesAwards":[{"titleAwardOutcome":"2nd place ICP Award","categories":[{"category":"Best Supporting Performance","names":[{"name":"Matthew McConaughey","id":"nm0000190","role":null}]}]}]},{"award":"International Online Cinema Awards (INOCA) 2013","titlesAwards":[{"titleAwardOutcome":"Nominated INOCA","categories":[{"category":"Best Supporting Actor","names":[{"name":"Matthew McConaughey","id":"nm0000190","role":null}]}]}]},{"award":"MTV Movie Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best Male Performance","names":[{"name":"Channing Tatum","id":"nm1475594","role":null}]},{"category":"Best Shirtless Performance","names":[{"name":"Channing Tatum","id":"nm1475594","role":null}]},{"category":"Best Musical Moment","names":[{"name":"Channing Tatum","id":"nm1475594","role":null},{"name":"Matt Bomer","id":"nm0093589","role":null},{"name":"Joe Manganiello","id":"nm0542133","role":null},{"name":"Kevin Nash","id":"nm0621760","role":null},{"name":"Adam Rodriguez","id":"nm0735226","role":null}]}]}]},{"award":"National Society of Film Critics Awards, USA 2013","titlesAwards":[{"titleAwardOutcome":"Won NSFC Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Matthew McConaughey","id":"nm0000190","role":null},{"name":"Bernie","id":"tt1704573","role":null}]}]}]},{"award":"New York Film Critics Circle Awards 2012","titlesAwards":[{"titleAwardOutcome":"Won NYFCC Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Matthew McConaughey","id":"nm0000190","role":null},{"name":"Bernie","id":"tt1704573","role":null}]}]}]},{"award":"NewNowNext Awards 2012","titlesAwards":[{"titleAwardOutcome":"Nominated NewNowNext Award","categories":[{"category":"Cause You're Hot","names":[{"name":"Channing Tatum","id":"nm1475594","role":null}]}]}]},{"award":"People's Choice Awards, USA 2013","titlesAwards":[{"titleAwardOutcome":"Nominated People's Choice Award","categories":[{"category":"Favorite Dramatic Movie","names":[]}]}]},{"award":"Rembrandt Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Rembrandt Award","categories":[{"category":"Best International Film (Beste Buitenlandse Film)","names":[]}]}]},{"award":"Village Voice Film Poll 2012","titlesAwards":[{"titleAwardOutcome":"Won VVFP Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Matthew McConaughey","id":"nm0000190","role":null}]}]}]},{"award":"Women Film Critics Circle Awards 2012","titlesAwards":[{"titleAwardOutcome":"Won Just Kidding Award","categories":[{"category":"Best Male Images in a Movie","names":[]}]}]}],"votes":"113,014","type":"Movie","companyCreditsSimple":[{"idCompany":"co0380595","name":"Iron Horse Entertainment (II)"},{"idCompany":"co0265102","name":"Extension 765"},{"idCompany":"co0332172","name":"St. Petersburg Clearwater Film Commission"}],"keywords":{"keywords":["male objectification","stripper","male stripper","strip club","florida","dancing","male nudity","bank","money","party","bikini","homophobic slur","homophobia","breasts","female nudity","male pubic hair","rooftop","raincoat","stage","nightclub","boat","cell phone","ocean","tattoo","marilyn monroe dress","cross dressing","sleeping on a couch","briefcase","safe","fight","group sex","threesome","ecstasy","hurricane","bisexual","hugging","beach","debt","homoeroticism","mirror","telephone call","brother sister relationship","pig","lap dance","friendship","friend","bridge","swimming","leg shaving","man shaving his legs","razor","impersonating a police officer","penis","drugs","shaving","tiara","fourth of july","jumping into water","umbrella","f word","weightlifting","boxer briefs","large penis","penis pump","undressing","underwear","construction worker","construction site","aging","alcohol","apartment building","apartment","kiss","swimming with clothes on","friendship between men","cop impersonation","strip club owner","strip joint","muscular","thong","briefs","white briefs","male underwear","sandbar","criminal element","entrepreneur","drug overdose","striptease","dance","ecstasy pill","drug dealing","tampa florida","man wearing a towel","male wearing a thong","male dressed as female","male removes his clothes","male rear nudity","beefcake","bare chested male","novice","protege","reference to chatty cathy the doll","reference to craigslist","reference to valhalla","reference to tarzan","21 year old","19 year old","no title at beginning","no opening credits","young entrepreneur","argument","male bare feet","two word title","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:17:45"}}