{"data":{"movies":[{"title":"Automata","originalTitle":"Autómata","year":"2014","releaseDate":"20141017","directors":[{"name":"Gabe Ibáñez","id":"nm2688320"}],"writers":[{"name":"Gabe Ibáñez","id":"nm2688320"},{"name":"Igor Legarreta","id":"nm1672020"}],"runtime":"109 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgyMDcyMjMwMV5BMl5BanBnXkFtZTgwNjY5MTA1MjE@._V1.jpg","countries":["Bulgaria","USA","Spain","Canada"],"languages":["English"],"genres":["Action","Sci-Fi","Thriller"],"plot":"In 2044, solar storms have killed 99.7 % of the world's population and only 21 million people survive. The ROC Corporation has designed and built robots called Automata Pilgrim 7000 to help to rebuild the world. These robots have two security protocols; they can neither harm humans nor alter themselves or other robots. When police officer Sean Wallace shoots a robot and claims that it was altering itself, ROC insurance agent Jacq Vaucan is placed in charge of the investigation. Soon he believes that there is a \"clocksmith\" illegally modifying the robots. Jacq wants to live in the coast and asks his boss and friend Robert Bold to transfer him with his pregnant wife Rachel Vaucan to the coast. Robert offers the possibility if Jacq resolves the case. Jacq and Wallace go to a brothel where the modified robot Cleo attends and Wallace shoots its leg, expecting that the owner will lead them to the clocksmith. They meet Duprè but she is not the clocksmith that is modifying the robots. Soon ...","simplePlot":"Jacq Vaucan is an insurance agent of ROC robotics corporation who investigates cases of robots violating their primary protocols against altering themselves. What he discovers will have profound consequences for the future of humanity.","actors":[{"actorName":"Antonio Banderas","urlProfile":"http://www.imdb.com/name/nm0000104","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyOTQ3NTYyNF5BMl5BanBnXkFtZTcwMTY2NjIzNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1960","placeOfBirth":" Málaga, Málaga, Andalucía, Spain","birthName":"José Antonio Domínguez Banderas","height":"5' 8½\" (1.74 m)","bio":"Antonio Banderas, one of Spain's most famous faces, was a soccer player until breaking his foot at the age of fourteen; he is now an international film star known for playing Zorro in the eponymous film series. He was born José Antonio Domínguez Banderas on August 10, 1960, in Málaga, Andalusia, Spain. His father, Jose Dominguez, was a policeman in the Spanish civil guards. His mother, Doña Ana Banderas Gallego, was a school teacher. Young Banderas was brought up a Roman Catholic. He wanted to play soccer professionally and made much success playing for his school team until the age of 14, albeit his dream ended when he broke his foot. At that time he developed a passion for theatre after seeing the stage production of 'Hair'. Banderas began his acting studies at the School of Dramatic Art in Málaga, and made his acting debut at a small theatre in Málaga. He was arrested by the Spanish police for performance in a play by Bertolt Brecht, because of political censorship under the rule of General Francisco Franco. Banderas spent a whole night at the police station, he had three or four such arrests while he was working with a small theatre troupe that toured all over Spain and was giving performances in small town theatres and on the street. In 1979, at the age of 19, he moved to Madrid in pursuit of an acting career. Being a struggling young actor, he also worked as a waiter and took small modeling jobs. At that time he joined the troupe at the National Theatre of Spain, becoming the youngest member of the company. Banderas's stage performances caught the attention of film director Pedro Almodóvar, who cast the young actor in his film debut Labyrinth of Passion (1982). Banderas and Almodovar joined forces in making innovative and sexually provocative movies during the 1980s. In 1984 Banderas made headlines in Spain with his performance as a gay man, making his first male-to-male on-screen kiss in Almodovar's La loi du désir (1987). Banderas's long and fruitful collaboration with Pedro Almodóvar eventually prepared him for international recognition that came with his work in the Academy Award-nominated film Women on the Verge of a Nervous Breakdown (1988). In 1991 he appeared as an object of Madonna's affection in Madonna: Truth or Dare (1991). In 1992 Banderas made his Hollywood debut with Les mambo kings (1992). Because he did not speak English at that time, his dialogue for the film was taught to him phonetically. Banderas shot to international fame with his sensitive performance as a lover of Tom Hanks' AIDS-infected lawyer in Philadelphia (1993), then played opposite Tom Cruise and Brad Pitt in Interview with the Vampire: The Vampire Chronicles (1994). Banderas further established himself as one of Hollywood's leading men after co-starring in Evita (1996) opposite Madonna in the title role. In 1998 he won acclaim for his portrayal of Zorro, opposite Anthony Hopkins and Catherine Zeta-Jones, in The Mask of Zorro (1998). For the role as Zorro Banderas took training with the Olympic national fencing team in Spain, and practiced his moves with real steel swords, then he used the lighter aluminum swords in the movie. He also took a month-long course of horse-riding before the filming. He later returned to the role in The Legend of Zorro (2005). In 1999 Banderas made his directorial debut in La tête dans le carton à chapeaux (1999), starring his wife, Melanie Griffith. He received critical acclaim for his portrayal of Mexican artist David Alfaro Siqueiros opposite Salma Hayek in Frida (2002). He voiced Puss in Boots in the Shrek franchise. Banderas established himself as internationally known Latin heartthrob with charismatic looks, and was chosen as one of the 50 most beautiful people in the world by the People magazine in 1996. He won numerous awards and nominations for his works in film, including three ALMA awards and three Golden Globe nominations, among many other. From 1996 to 2014, Banderas was married to American actress Melanie Griffith and the couple have one daughter Stella born in 1996. Outside of his acting profession, Banderas has been a passionate soccer fan and a staunch supporter of the Real Madrid Football Club. He shares time between his two residencies, one is in the United States, and one in the South of Spain.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyOTQ3NTYyNF5BMl5BanBnXkFtZTcwMTY2NjIzNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000104","name":"Antonio Banderas","idIMDB":"nm0000104"},"actorId":"nm0000104","character":"Jacq Vaucan","urlCharacter":"http://www.imdb.com/character/ch0493398","main":true},{"actorName":"Dylan McDermott","urlProfile":"http://www.imdb.com/name/nm0001518","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMjY2NzU4OF5BMl5BanBnXkFtZTcwODg2NDc4Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1961","placeOfBirth":" Waterbury, Connecticut, USA","birthName":"Mark Anthony McDermott","height":"6' (1.83 m)","bio":"A Golden Globe winner and Emmy nominee, Dylan McDermott has proved his talent in film, television and theater. He was born Mark Anthony McDermott in Waterbury, Connecticut, to Diane (Marino) and Richard McDermott. Diane was 15 and Richard was 17 when Dylan was born. Richard earned money by hustling pool. Dylan is of Italian (from his maternal grandfather), Irish, English and French descent. During Dylan's early years, his parents separated. In 1967, when Dylan was five, his mother was murdered by her live-in boyfriend. The murder was initially ruled an accidental shooting occurring while her boyfriend cleaned his gun, but police reopened the case in 2012 and revealed evidence showing it was impossible for her death to be have been accidental. Dylan and his sister Robin, who was then six months old, were taken in by their grandmother, Avis (Rogers) Marino. When Dylan was 15, his father met and married playwright/activist Eve Ensler. Eve adopted Dylan. Eve encouraged him to go to acting school and Fordham University in New York City. He met his now ex-wife, Shiva Rose, at a coffee shop in Venice, California, on the same day he got a big acting break by being cast in the film In the Line of Fire (1993) with Clint Eastwood. As a result of his connection with Eastwood, Dylan attended a dinner honoring Clint. There, he met Jeffrey Kramer, a man who used to frequent a bar where Dylan had earlier worked. Kramer was, at that time, the president of David E. Kelley Productions. He asked Dylan to meet David E. Kelley for a then-upcoming series about lawyers, The Practice (1997), and the rest was history. Another mentor of Dylan is Joanne Woodward, who discovered him while he was doing workshops at the Neighborhood Playhouse. The series earned him a Golden Globe in 1999 and nominations in 2000 and 2001, as well as an Emmy nomination in 1999. His film credits include The Pang Brother's The Messengers (2007); Wonderland (2003); Home for the Holidays (1995); Steel Magnolias (1989); Hamburger Hill (1987); Miracle on 34th Street (1994); In the Line of Fire (1993) and Burning Palms (2010). McDermott's television credits include the Jerry Bruckheimer-produced TNT drama, Dark Blue (2009); and TNT's dramatic limited series, The Grid (2004), opposite Julianna Margulies. In 2008, McDermott starred in Nicky Silver's \"Three Changes\" at Playwrights Horizons. Starring opposite Maura Tierney, the play follows an uncomfortably married Upper West Side couple. Additionally, in September 2006, McDermott was on stage in Eve Ensler's new play, \"The Treatment\". Ensler's play explored the relationship between a traumatized former military interrogator (McDermott) and his psychologist Colonel, who is assigned to give him routine treatment. The play opened the Impact Festival 2006, a New York City-wide arts festival as part of the Culture Project. McDermott was nominated for a Drama League Award for his performance. McDermott appeared on television in the first season of Ryan Murphy and Brad Falchuk's FX drama, American Horror Story (2011), opposite Connie Britton and Jessica Lange. McDermott co-starred in Jay Roach's comedy, The Campaign (2012), opposite Will Ferrell and Zach Galifianakis. McDermott played \"Tim Wattley\", a political consultant who runs the campaign of a candidate from North Carolina. The Warner Bros. film was released on August 10, 2012. That year, McDermott was also seen in the indie coming-of-age drama, The Perks of Being a Wallflower (2012), alongside Logan Lerman (playing Lerman's character's father), Emma Watson, Paul Rudd, Ezra Miller and Mae Whitman. In 2013, McDermott had a supporting role in Antoine Fuqua's Olympus Has Fallen (2013), alongside Aaron Eckhart and Gerard Butler. The film followed a former Secret Service agent who becomes America's only hope when the President is taken hostage by terrorists. McDermott's additional theatre credits include Neil Simon's production of \"Biloxi Blues\" on Broadway and \"Golden Boy\", directed by Joanne Woodward at the Williamstown Theater Festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMjY2NzU4OF5BMl5BanBnXkFtZTcwODg2NDc4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001518","name":"Dylan McDermott","idIMDB":"nm0001518"},"actorId":"nm0001518","character":"Sean Wallace","urlCharacter":"http://www.imdb.com/character/ch0482929","main":true},{"actorName":"Melanie Griffith","urlProfile":"http://www.imdb.com/name/nm0000429","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwODc4NTgxOV5BMl5BanBnXkFtZTcwNzgyNjY0MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1957","placeOfBirth":" New York City, New York, USA","birthName":"Melanie Richards Griffith","height":"5' 9¼\" (1.76 m)","bio":"Melanie Griffith was born on August 9, 1957 in New York City, to then model/future actress Tippi Hedren and former child actor turned advertising executive Peter Griffith. Her parents' marriage ended in 1961 and Tippi brought Melanie to Los Angeles to get a new start. Tippi caught the eye of the great director Alfred Hitchcock, who gave her starring roles in The Birds (1963) and Marnie (1964). She married her then-agent, Noel Marshall, in 1964 (they divorced in 1982), and Melanie grew up with three stepbrothers. Meanwhile, her father married Nanita Greene Samuels and had two more children: Tracy Griffith and Clay A. Griffith. Melanie also grew up with tigers and lions, as Tippi and Noel were raising them for the movie Roar (1981), in which the family later starred. Melanie's acting career, however, began as a model at just nine months old in a commercial and she later appeared as an extra in Smith! (1969) and The Harrad Experiment (1973), where she fell in love with her mother's co-star, Don Johnson. She was only 14 years old, while he was a twice-divorced 22-year-old. Tippi took a very liberal approach and allowed Melanie to move in with Don at a tender age. Even though Melanie didn't like modeling, she continued to do it to pay the bills. One day she went to meet with director Arthur Penn for what she thought was a modeling assignment. It was actually an audition for his film Night Moves (1975), and Penn gave her the role of a runaway nymphet. She was hesitant, but Johnson encouraged her to take the role. She agreed but was terrified of performing in front of the camera. Penn took a paternal interest in her, and she felt confident and gave a riveting performance, doing racy nude scenes. It immediately typecast her and led to more nymphet roles, with her beautiful nude body a permanent fixture in movies like Ha-Gan (1977) and Joyride (1977). She also married Johnson, in Las Vegas in 1976, but the union ended within six months, possibly because her early movie success outshone his. Unfortunately, as her career progressed, she became increasingly dependent on drugs and alcohol, a fact well-known to studio executives, who stopped considering her for feature film roles. She started doing television work, where she met her second husband, Steven Bauer, on the set of the TV movie She's in the Army Now (1981). He helped her to overcome her drug and alcohol problems and got her to take acting classes with Stella Adler in New York. The classes paid off, as director Brian De Palma cast her as a porno actress in his murder mystery Body Double (1984) and her sexy, funny performance won her rave reviews and the Best Supporting Actress Award by the National Society of Film Critics and a Golden Globe nomination. Jonathan Demme was so impressed with her performance that he gave her the female lead in Something Wild (1986) without even auditioning her. The film became a cult favorite, with Melanie again getting critical plaudits and a Golden Globe nomination. The birth of her first child, Alexander, in 1985, didn't help to save her struggling marriage, and she and Bauer divorced shortly thereafter. She was given starring roles in Cherry 2000 (1987) and Stormy Monday (1988), but the films were barely released. Soon writers were asking when the public at large was going to take notice of this talented and unique actress. Melanie's career skyrocketed when Mike Nichols cast her as a spunky secretary named Tess McGill in Working Girl (1988), a box-office hit for which she received an Oscar nomination as Best Actress and won the Golden Globe Award as Best Actress in a Comedy. Behind the scenes, however, her ongoing substance abuse had become problematic, and Nichols pushed her into a rehabilitation clinic after production wrapped. En route to the clinic she called ex-husband Johnson for support, and they reconciled after her release from the clinic. She got pregnant and remarried Johnson in 1989, and later that year their daughter Dakota Johnson was born. A sober Melanie now concentrated on her film career, but the two-year absence after Working Girl (1988) took a toll, since younger actresses (Julia Roberts, Michelle Pfeiffer, Demi Moore, Meg Ryan, Jodie Foster(to whom Melanie lost the Oscar to)) became bankable stars, and there was stiff competition for the good roles. The films Melanie chose usually flopped badly, such as The Bonfire of the Vanities (1990), which reunited her with director Brian De Palma. Even though she gave heartfelt performances in all her films, she was often miscast, with her breathy little-girl voice not helping matters in her role as a spy in Shining Through (1992) and as a homicide detective going undercover in the Hassidic Jewish community in New York City in A Stranger Among Us (1992). Melanie made a minor comeback with her supporting role as a desperate housewife in Nobody's Fool (1994), which reunited her with Bruce Willis, her co-star in The Bonfire of the Vanities (1990), and Paul Newman, her co-star from The Drowning Pool (1975). She also earned a Golden Globe nomination for her work in the well-received TV miniseries Buffalo Girls (1995), followed by another hit film, the ensemble Now and Then (1995). Her personal life was making headlines again, though, as she left Johnson because of his own substance-abuse problems, reconciled with him briefly when he became sober, only to leave him again, this time for Antonio Banderas, her married co-star from Two Much (1996). Both she and Banderas created a scandal in 1995 with their torrid romance, and the tabloids followed their every move, including her divorce from Johnson and his divorce from wife Ana Leza. Melanie became pregnant with her third child, and she and Banderas married in 1996. Their daughter Stella Banderas was born the same year, and the notorious couple were forgiven by the public and the media. Melanie won strong reviews in independent films like Another Day in Paradise (1998), where she played a heroin-using criminal accomplice on the run, and the made-for-cable movie RKO 281 (1999), in which she portrayed actress Marion Davies, a part that garnered her Golden Globe and Emmy nominations as Best Supporting Actress. Melanie became dependent to pain killers, however, returning to rehab in 2000. She wrote about her struggle and recovery in her journal on her official website. Greenmoon Productions, the production company that she formed with Banderas, produced several flops, such as her starring vehicle La tête dans le carton à chapeaux (1999), directed by Banderas. Her career took another blow when her TV series, Me & George (1998), never even aired. After making Cecil B. Demented (2000) and Coup de foudre pour toujours (2000), Melanie did a voice-over role in Stuart Little 2 (2002) and played supporting roles in minor films Tempo (2003), as Sylvester Stallone's girlfriend in Shade (2003), and as Barbara Marx in The Night We Called It a Day (2003) with Dennis Hopper playing Frank Sinatra, but none of these films made a ripple at the box office. As a result, film and television offers started to dry up. In 2003, a resourceful Melanie turned to the Broadway stage, and packed houses with her turn as the murderess \"Roxie Hart\" in the musical \"Chicago,\" for which she received a rave review from the New York Times theater critic. It renewed her confidence, as she had never sang, danced or been on the Broadway stage before. In 2005 she surprised viewers by playing a mom to two grown women in the TV series Twins (2005), which was canceled after one season. She tried to resurrect her career with another attempt at a TV series, Viva Laughlin (2007), but it was canceled after just two episodes. Melanie didn't act again for the remainder of the decade, because, by self-admission, she couldn't obtain any worthwhile roles. In 2009, she was back in rehab after yet another relapse, emerging after a three-month stay. Professionally, she was faced with more disappointment in 2012 when This American Housewife (2012), a Lifetime series that Banderas produced for her to star in, never aired. She went back to the stage in 2012 and played Scott Caan's mother in a play that he wrote titled \"No Way Around but Through.\" She impressed Caan enough to recommend her to producers of his television show Hawaii Five-0 (2010). Since 2014, she started playing a recurring role as his mother on the show. Also in 2014, Melanie filed for divorce from Banderas citing \"irreconcilable differences\" after nearly twenty years together. She never publicly discussed her reasons for the divorce, and she didn't promote her feature film Automata (2014), the final time that she acted with Banderas. It took a year for the divorce to be finalized, during which time, she and Banderas made one important appearance together at their daughter Stella's high school graduation. She also made another public appearance with another ex-husband, Don Johnson, on Saturday Night Live (1975) to support their daughter Dakota, who was the host for that week. Dakota was promoting her star-making turn in Fifty Shades of Grey (2015), thus carrying on the family tradition of being a film actress. Melanie maintains close ties with her three children and her mother Tippi Hedren. She is involved in various charities, including raising funds for Tippi's Shambala preserve, a refuge for wild animals. Melanie also runs a non-profit organization for benefiting burned children. Melanie is single and her children are living on their own. So she has devoted most of her time seeking out acting roles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwODc4NTgxOV5BMl5BanBnXkFtZTcwNzgyNjY0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000429","name":"Melanie Griffith","idIMDB":"nm0000429"},"actorId":"nm0000429","character":"Duprè","urlCharacter":"http://www.imdb.com/character/ch0520504","main":true},{"actorName":"Birgitte Hjort Sørensen","urlProfile":"http://www.imdb.com/name/nm2171898","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0NTQyOTk1Ml5BMl5BanBnXkFtZTcwMTg1NTY1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 January 1982","placeOfBirth":" Hillerød, Denmark","height":"5' 7¾\" (1.72 m)","bio":"Birgitte Hjort Sørensen was born on January 16, 1982 in Hillerød, Denmark. She is an actress, known for Automata (2014), Pitch Perfect 2 (2015) and Borgen - Une femme au pouvoir (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0NTQyOTk1Ml5BMl5BanBnXkFtZTcwMTg1NTY1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2171898","name":"Birgitte Hjort Sørensen","idIMDB":"nm2171898"},"actorId":"nm2171898","character":"Rachel Vaucan","urlCharacter":"http://www.imdb.com/character/ch0493399","main":true},{"actorName":"Robert Forster","urlProfile":"http://www.imdb.com/name/nm0001233","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYyNzczNDk0N15BMl5BanBnXkFtZTcwNzM4ODQ2NA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1941","placeOfBirth":" Rochester, New York, USA","birthName":"Robert Foster","height":"5' 9½\" (1.77 m)","bio":"Robert Forster was born Robert Wallace Foster, Jr. in Rochester, New York, to Grace Dorothy (Montanarella) and Robert Wallace Foster, Sr., who worked as an elephant trainer and baking supply company executive. He is of English, Irish, and Italian descent. Forster first become interested in acting while attending Rochester's Madison High School, where he performed as a song-and-dance man in musical revues. After graduating in 1959, Forster attended Heidelberg College, Alfred University and the University of Rochester on football scholarships and continued to perform in student theatrical revues. After earning a BA in Psychology from Rochester in 1963, Forster took an apprenticeship at an East Rochester theater where he performed in such plays as \"West Side Story\". He moved to New York City in 1965, where his first big break came when he landed the lead in the two-character play \"Mrs. Dally Has a Lover\" opposite Arlene Francis. However, after the play ran its course work was hard to find in the theater. Forster returned to Rochester, where he worked as a substitute teacher and construction worker until an agent from 20th Century-Fox offered him a five-picture deal. His movie debut was a small part in the drama Reflections in a Golden Eye (1967), which starred Elizabeth Taylor and Marlon Brando. Forster went on to appear in small and minor roles alongside some top Hollywood actors in films like The Stalking Moon (1968) and Medium Cool (1969), and a large part in Justine (1969). Although he continued to act in feature films, he took the part of a hardboiled detective in the short-lived TV series Banyon (1971) Forster also appeared in notable parts in The Black Hole (1979), Avalanche (1978) and as the lead in the cult horror flick Alligator (1980), and played the part of a factory worker-turned-vigilante in the thriller Vigilante (1983). Forster also took the lead as a taxi driver in Walking the Edge (1985) by director Norbert Meisel. A series of action flicks followed, the most notable being The Delta Force (1986), starring Chuck Norris. By the late 1980s Forster's acting career had begun to slide, and he was getting less and less work; if there was any, he would be cast in small parts playing villains. Forster then began to work as a motivational speaker and an acting coach in Hollywood film schools. However, in the mid-'90s, Forster's career was resurrected by writer-director Quentin Tarantino, a big fan of Forster's early work, who offered him an audition for a part in his latest movie. After a seven-hour audition, Tarantino cast Forster in the role of the tough but sympathetic bail bondsman Max Cherry in Jackie Brown (1997), which netted him an Academy Award nomination and some nationwide recognition. His success landed him more high-profile starring roles, in such films as All the Rage (1999), Gus Van Sant's Psycho (1998)--a remake of Alfred Hitchcock's 1960 film--and Supernova (2000). Forster continues to act in many big-budget Hollywood productions, playing many charming characters who often steal the scene.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYyNzczNDk0N15BMl5BanBnXkFtZTcwNzM4ODQ2NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001233","name":"Robert Forster","nicknames":["Bob"],"idIMDB":"nm0001233"},"actorId":"nm0001233","character":"Robert Bold","urlCharacter":"http://www.imdb.com/character/ch0493401","main":true},{"actorName":"Tim McInnerny","urlProfile":"http://www.imdb.com/name/nm0570570","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NzEyMzg3MF5BMl5BanBnXkFtZTgwNjkzNTIyNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1956","placeOfBirth":" Cheadle Hulme, Cheshire, England, UK","birthName":"Timothy L. McInnerny","height":"6' 1\" (1.86 m)","bio":"Tim McInnerny was born on September 18, 1956 in Cheadle Hulme, Cheshire, England as Timothy L. McInnerny. He is an actor, known for Notting Hill (1999), MI-5 (2015) and Eddie the Eagle (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NzEyMzg3MF5BMl5BanBnXkFtZTgwNjkzNTIyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0570570","name":"Tim McInnerny","idIMDB":"nm0570570"},"actorId":"nm0570570","character":"Vernon Conway","urlCharacter":"http://www.imdb.com/character/ch0493402","main":true},{"actorName":"David Ryall","urlProfile":"http://www.imdb.com/name/nm0752379","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NjQ2NDUyNF5BMl5BanBnXkFtZTcwODgyOTgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1935","placeOfBirth":" Shoreham-by-Sea, West Sussex, England, UK","birthName":"David John Ryall","bio":"David Ryall was born on January 5, 1935 in Shoreham-by-Sea, West Sussex, England as David John Ryall. He was an actor, known for City of Ember (2008), Around the World in 80 Days (2004) and Harry Potter and the Deathly Hallows: Part 1 (2010). He was married to Penny England, Cathy Buchwald and Gillian Eddison. He died on December 25, 2014 in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NjQ2NDUyNF5BMl5BanBnXkFtZTcwODgyOTgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0752379","name":"David Ryall","idIMDB":"nm0752379"},"actorId":"nm0752379","character":"Dominic Hawk","urlCharacter":"http://www.imdb.com/character/ch0493404","main":true},{"actorName":"Javier Bardem","urlProfile":"http://www.imdb.com/name/nm0000849","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NTc4NTYzMF5BMl5BanBnXkFtZTcwNDIwOTY1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 March 1969","placeOfBirth":" Las Palmas de Gran Canaria, Gran Canaria, Canary Islands, Spain","birthName":"Javier Ángel Encinas Bardem","height":"5' 11¼\" (1.81 m)","bio":"Javier Bardem is the youngest member of a family of actors that has been making films since the early days of Spanish cinema. He was born in Las Palmas de Gran Canaria, Spain, to actress Pilar Bardem (María del Pilar Bardem Muñoz) and businessman José Carlos Encinas Doussinague. His maternal grandparents were actors Rafael Bardem and Matilde Muñoz Sampedro, and his uncle is screenwriter Juan Antonio Bardem. He got his start in the family business, at age six, when he appeared in his first feature, \"El picaro\" (1974) (A.K.A. The Scoundrel). During his teenage years, he acted in several TV series, played rugby for the Spanish National Team, and toured the country with an independent theatrical group. Javier's early film role as a sexy stud in the black comedy, Jamón, Jamón (1992) (aka Ham Ham) propelled him to instant popularity and threatened to typecast him as nothing more than a brawny sex symbol. Determined to avert a beefcake image, he refused similar subsequent roles and has gone on to win acclaim for his ability to appear almost unrecognizable from film to film. With over 25 movies and numerous awards under his belt, it is Javier's stirring, passionate performance as the persecuted Cuban writer, Reynaldo Arenas, in Avant la nuit (2000) that will long be remembered as his breakthrough role. He received five Best Actor awards and a Best Actor Oscar nomination for his portrayal.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NTc4NTYzMF5BMl5BanBnXkFtZTcwNDIwOTY1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000849","name":"Javier Bardem","idIMDB":"nm0000849"},"actorId":"nm0000849","character":"Blue Robot","urlCharacter":"http://www.imdb.com/character/ch0493410","main":true},{"actorName":"Boris Kabakchiev","urlProfile":"http://www.imdb.com/name/nm6952275","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0ODEwMjcwMl5BMl5BanBnXkFtZTgwNDgyMjY0MDI@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"Boris Kabakchiev is an actor, known for Automata (2014) and Leatherface.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0ODEwMjcwMl5BMl5BanBnXkFtZTgwNDgyMjY0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm6952275","name":"Boris Kabakchiev","idIMDB":"nm6952275"},"actorId":"nm6952275","character":"Boy #3","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lyubomir Neikov","urlProfile":"http://www.imdb.com/name/nm1747887","urlPhoto":"","biography":{"birthName":"Lyubomir Ivanov Neikov","bio":"Lyubomir Neikov is a Bulgarian comedian and actor . He is known for his work on television and in the theater. He graduated from the Technical School of electrical engineering and later he graduated from NATFIZ in 1998, specializing in Doll Acting. In 1998 he started working on Slavi's Show, where he was part of \"The Actor Trio\" together with Krasi Radkov and Viktor Kalev. He portrayed many different characters on the show, including The MC Pharaoh and Bate Boiko. In 2006 he quit the show . In 2007 he started his own show named \"Komitsite\" (\"The Comedians\" - in English) with the famous Bulgarian actors Hristo Garbov, Krastio Lafazanov and Ruslan Muynov. Neikov played the role of Omar Sharif in the 2008 political satire War, Inc.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1747887","name":"Lyubomir Neikov","idIMDB":"nm1747887"},"actorId":"nm1747887","character":"Poot","urlCharacter":"http://www.imdb.com/character/ch0493413","main":true},{"actorName":"Krasimir Kutsurapov","urlProfile":"http://www.imdb.com/name/nm6952276","urlPhoto":"","biography":{"bio":"Krasimir Kutsurapov is an actor, known for Automata (2014) and Stonehearst Asylum (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6952276","name":"Krasimir Kutsurapov","idIMDB":"nm6952276"},"actorId":"nm6952276","character":"Palance","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anton Lamrev","urlProfile":"http://www.imdb.com/name/nm6952277","urlPhoto":"","biography":{"bio":"Anton Lamrev is an actor, known for Automata (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6952277","name":"Anton Lamrev","idIMDB":"nm6952277"},"actorId":"nm6952277","character":"Unknown Boy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Geraldine Somerville","urlProfile":"http://www.imdb.com/name/nm0813893","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNjk5MjA3NF5BMl5BanBnXkFtZTcwMjUxNTY5OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 May 1967","placeOfBirth":" County Meath, Ireland","birthName":"Geraldine Margaret Agnew-Somerville","height":"5' 4¼\" (1.63 m)","bio":"Geraldine Somerville was born in Dublin. She lived in Co. Meath until she was six, when her parents moved to the Isle of Man. Geraldine went to dance classes from the age of 6 and, at the age of 8, she attended the Arts Educational School in Tring, Hertfordshire. There, she was taught ballet, music and drama. At sixteen, she left to continue her studies in London, where she gained a place at the Guildhall School of Music and Drama. Geraldine has, most recently, been seen in the film My Week with Marilyn (2011), directed by Simon Curtis, alongside Golden Globe-winner Michelle Williams, and has a leading role as \"Louisa Manton\" in the upcoming Julian Fellowes ITV Production of Titanic (2012), to be broadcast in March/April 2012. Geraldine's acting career began in 1989, immediately after graduating from the Guildhall. She was cast as \"Laura\" opposite Linus Roache in \"The Glass Menagerie\", at The Royal Exchange Theatre in Manchester, for which she was nominated for a Best Actress award by the Manchester Evening News. Geraldine's numerous theatre credits include: \"Three Birds Alighting on a Field\", directed by Max Stafford-Clark, \"A Jamaican Airman Foresees His Own Death\", directed by Hettie Macdonald and \"The Treatment\", directed by Lindsay Posner, all at The Royal Court, \"Juliet\" in \"Romeo and Juliet\", directed by Andy Hay at Bristol Old Vic, \"I Am Yours\", directed by Nancy Meckler for Shared Experience, \"A Doll's House\", \"Birmingham Rep\", 'Blue Remembered Hills\", with Steve Coogan and Nigel Lindsay, directed by Patrick Marber, and \"Power\" with Robert Lindsay and Rupert Penry-Jones, directed by Lindsey Posner for The National Theatre. More recently, Geraldine appeared at the Donmar Warehouse in \"Serenading Louis\", 2010, opposite Jason O'Mara, directed by Simon Curtis. Geraldine has starred in a wide variety of television dramas, her breakout role being, \"'Panhandle' Penhaligon\", alongside Robbie Coltrane, in the ground-breaking, award-winning drama series, Cracker (1993) (1993-1995), by Jimmy McGovern, a much-imitated series still shown around the world. Geraldine was nominated for the Best Actress Bafta for her role as \"Detective Penhaligon\". Other notable television dramas include: Performance: The Deep Blue Sea (1994) (1994), Aristocrats (1999), Performance: After Miss Julie (1995) (1995), Daylight Robbery (1999), Heaven on Earth (1998), The Safe House (2002), Daphne (2007) and The Children (2008). Films include: My Week with Marilyn (2011), director Simon Curtis, Sixty Six (2006), director Paul Weiland, Gosford Park (2001), director Robert Altman, Jilting Joe (1998), director Dan Zeff. Geraldine also played \"Lily Potter\", mother of \"Harry Potter\" in all the Harry Potter Films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNjk5MjA3NF5BMl5BanBnXkFtZTcwMjUxNTY5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0813893","name":"Geraldine Somerville","idIMDB":"nm0813893"},"actorId":"nm0813893","character":"Samantha","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harry Anichkin","urlProfile":"http://www.imdb.com/name/nm1017533","urlPhoto":"","biography":{"dateOfBirth":"27 July 1944","placeOfBirth":" Bulgaria","bio":"Harry Anichkin was born on July 27, 1944 in Bulgaria. He is an actor, known for The Expendables 3 (2014), Automata (2014) and Father (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1017533","name":"Harry Anichkin","idIMDB":"nm1017533"},"actorId":"nm1017533","character":"Clift","urlCharacter":"http://www.imdb.com/character/ch0493411","main":true},{"actorName":"Stanislav Pishtalov","urlProfile":"http://www.imdb.com/name/nm1169343","urlPhoto":"","biography":{"bio":"Stanislav Pishtalov is an actor, known for The Way Back (2010), Automata (2014) and Conan the Barbarian (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1169343","name":"Stanislav Pishtalov","idIMDB":"nm1169343"},"actorId":"nm1169343","character":"Lance","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1971325","urlIMDB":"http://www.imdb.com/title/tt1971325","business":{"budget":{"money":"$7,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"29","month":"04","year":"2013","remarks":null},null],"copyrightHolder":"© 2014 AUTOMATA PRODUCTIONS, INC."},"technical":{"runtime":["1 hr 49 min (109 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa, Hawk V-Lite 1.3x Anamorphic Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":["Hawk Scope"],"printedFilmFormat":["Digital (Digital Cinema Package DCP)"]},"rating":"6,1","metascore":"37","filmingLocations":[{"location":"New Boyana Film Studios, Sofia, Bulgaria"}],"rated":"R","awards":[{"award":"Goya Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Goya","categories":[{"category":"Best Costume Design (Mejor Diseño de Vestuario)","names":[{"name":"Armaveni Stoyanova","id":"nm4809431","role":null}]},{"category":"Best Cinematography (Mejor Fotografía)","names":[{"name":"Alejandro Martínez","id":"nm1830534","role":null}]},{"category":"Best Production Design (Mejor Dirección Artística)","names":[{"name":"Patrick Salvador","id":"nm2191210","role":null}]},{"category":"Best Sound (Mejor Sonido)","names":[{"name":"Gabriel Gutiérrez","id":"nm2105528","role":null}]}]}]},{"award":"International Film Music Critics Award (IFMCA) 2014","titlesAwards":[{"titleAwardOutcome":"Nominated IFMCA Award","categories":[{"category":"Best Original Score for a Fantasy/Science Fiction/Horror Film","names":[{"name":"Zacarías M. de la Riva","id":"nm1032289","role":null}]}]}]},{"award":"San Sebastián International Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Seashell","categories":[{"category":"Best Film","names":[{"name":"Gabe Ibáñez","id":"nm2688320","role":null}]}]}]}],"votes":"44 860","type":"Movie","companyCreditsSimple":[{"idCompany":"co0274453","name":"Green Moon"},{"idCompany":"co0489561","name":"Nu Boyana Viburno"}],"keywords":{"keywords":["robot","future","dystopia","child hitman","self repair","robot laws","fall to death","dancing","self immolation","nuclear battery","sniper","turtle","begins with text","solar flare","post apocalypse","insurance agent","pregnant","humvee","flare gun","car rollover","dead dog","2040s","one word title","corporation","robotics","brothel","police","pregnant wife","class differences","homeless man","begging","pollution","rain","younger version of character","childhood memory","scene before opening credits","domestic robot","insurance claim","dystopian future","prologue","scene during opening credits","drunkenness","boy","beach","flashback","childhood","tortoise","pistol","revolver","robot kills human","jukebox","human versus robot","ultrasound","leg injury","limp","apartment","knife","binoculars","airship","cable car","shootout","jalopy","kidnapped wife","ankle holster","shot in the shoulder","falling to death","falling from height","crane","construction crane","abandoned factory","blue wig","blue hair","shot to death","trenchcoat","overcoat","hostage","kidnapping","campfire","cave","radioactivity","hitman","raincoat","artificial intelligence","cave painting","robot human relationship","child killing an adult","newborn baby","chocolate bar","stranded in the desert","flare gun as weapon","held at gunpoint","hit with a rifle butt","suv","evil corporation","dragging someone","car seat","geiger counter","pregnant woman","hospital","near future","condenser","pager","car chase","battery","walled city","child with gun","laboratory","woman shot","body bag","talking robot","sex robot","pregnancy","husband wife relationship","slum","shanty town","wall","city","insurance company","female scientist","female robot","self destruction","sniper rifle","desert","newborn","radiation","attacked by a robot","pump action shotgun","ballroom dancing","juke box","canyon","woman in labor","cockroach","man crying","shot with a flare","biokernal","limping","car crash","child assassin","prosthetic leg","ultrasonography","hologram","test","decapitation","driving in the rain","weather control","playing in the surf","year 2044","second protocol","leg shot off","f word"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 07:57:10"}}