{"data":{"movies":[{"title":"Hijacked","originalTitle":"","year":"2012","releaseDate":"20121211","directors":[{"name":"Brandon Nutt","id":"nm1970885"}],"writers":[{"name":"Brandon Nutt","id":"nm1970885"},{"name":"Declan O'Brien","id":"nm0639508"}],"runtime":"86 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMTUzNzE4MzVeQTJeQWpwZ15BbWU3MDYyNzIwOTc@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Crime","Thriller"],"plot":"A special agent's plans to reconcile with his ex-fiancé are ruined when she boards a private jet that is targeted by hijackers working for the same crime lord that he is chasing.","simplePlot":"A special agent's plans to reconcile with his ex-fiancé are ruined when she boards a private jet that is targeted by hijackers working for the same crime lord that he is chasing.","actors":[{"actorName":"Vinnie Jones","urlProfile":"http://www.imdb.com/name/nm0005068","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTM5NDg2MV5BMl5BanBnXkFtZTgwNjYxNjc1ODE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1965","placeOfBirth":" Watford, Hertfordshire, England, UK","birthName":"Vincent Peter Jones","height":"6' 2\" (1.88 m)","bio":"Vincent Peter Jones was born on January 5, 1965 in Watford, England. He first came to public notice as a professional footballer, playing in the English Football League. Noted as one of soccer's hard men, he leaped to fame when a photographer, at a match, snapped him \"marking\" Newcastle United's Paul Gascoigne, by grabbing his testicles. He has played for Wimbledon, Leeds United, Sheffield United, Chelsea, and Queens Park Rangers. Internationally, he played for Wales, qualifying for that nationality through his grandparents. He made his first acting appearance in the British comedy/thriller, Lock, Stock and Two Smoking Barrels (1998), at age 33, although he had previous presented a video on football's hard men (for which he was censured by the Football Association). He starred in the blockbuster, X-Men: L'affrontement final (2006), as \"Cain Marko\", also known as \"The Juggernaut\". Prior to that, he played the scowling soccer coach illustrating both his likability and comedic side in Dreamworks' She's the Man (2006), with Amanda Bynes. Other projects include a lead role in Johnny Was (2006), starring Roger Daltrey, Eriq La Salle and Lennox Lewis, and he also appears in the independent feature, The Riddle (2007), starring Vanessa Redgrave and Derek Jacobi. Over the years, he has received a number of prestigious awards, which showcase his accomplishments as a talented actor. In 1997, he won Satellite TV's \"Personality of the Year\", from Satellite TV Europe Magazine. In 1998, GQ Magazine named Jones \"Man of the Year\". He was awarded Best Actor for Lock, Stock and Two Smoking Barrels (1998) at the Odeon Audience Awards and also won the award for Outstanding New Talent from the Sir James Carreras Award Variety Club of GB. Jones won Best Debut in 1999 for Lock, Stock and Two Smoking Barrels (1998) at Empire Magazine's \"The Awards 1999\" and was titled the Male Cigar Personality of the Year at the Millennium Cigar Awards. In 2001, he was named Best British Actor for Empire Magazine's \"The Awards 2001\". In 2002, Jones received the award for Best Supporting Actor for Night at the Golden Eagle (2001) at the New York Film Festival and, in 2005, he was honored with Best Newcomer for Slipstream (2005) at London's Sci-Fi Film Festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTM5NDg2MV5BMl5BanBnXkFtZTgwNjYxNjc1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005068","name":"Vinnie Jones","nicknames":["The Axe"],"idIMDB":"nm0005068"},"actorId":"nm0005068","character":"Joe Ballard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rob Steinberg","urlProfile":"http://www.imdb.com/name/nm0825805","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNDMwNDI3N15BMl5BanBnXkFtZTgwNjM0ODMzNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1959","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"6' (1.83 m)","bio":"Rob Steinberg was born in Philadelphia and partied at Tulane University in New Orleans where he actually graduated at the top of his class creating the university's first self-designed major in Communications. Rob spent the 80s in New York in \"the music biz\" -- and for what he can remember was involved in marketing, promotion, and management with such noted acts as Scorpions, War and Bob Marley. Rob switched careers and coasts after a near-fatal car accident, moved to Los Angeles and embarked on a second career, focusing his sites on the film business -- a decision his mom blames on the head injury from that car accident! Within the first six months, his breakthrough role came in Die Hard 2 (1990) as the assistant to Bill Atherton's obnoxious TV reporter. Since then, Rob has worked with and is about to drop the names of such noted Hollywood luminaries as Joel Silver, Lawrence Gordon, Renny Harlin, Barbet Schroeder, Jonathan Kaplan, Mimi Leder, Jim Carey, Denzel Washington, Jennifer Jason Leigh, Kurt Russell and Academy Award winners Delbert Mann & George Clooney. Rob has appeared in twenty films including the blockbusters Obsession fatale (1992), Single White Female (1992) and Ricochet (1991) while starring in mediocre films such as Casa Hollywood (1996), Staying on Top (2002), Resolution (2001) and the unbelievably schlocky Kraa! The Sea Monster (1998). Rob has appeared in a whole bunch of network television shows when network was the thing, including Charmed (1998), Melrose Place (1992), recurred as Dr. Webb on Amour, gloire et beauté (1987). On stage, Rob won a Virgo Award as male lead in \"Whispers of an Asian Bride\", a Telly Award in 2004 for an Academic Short produced by Publishers Media and a local area Emmy Award in 2002 starring in a UPN/FOX spot called \"Bad Day.\" Rob produced the feature films Resolution (2001) and In a Dark Place (2005). He co-wrote a six-part children's series with Scholastic Video called \"Posie Paints\" playing several characters and voicing the lead -- an animated pigeon. Rob and John Cleese starred together on several national radio spots. Rob claims to be adept with improvisation, impressions, dialects and can burp the alphabet -- and performed stand-up at the Improv and Second City. Rob's production company, Scarlet Fire Entertainment, has created a half-hour television pilot called Par for the Course -- it's \"Cheers\" meets \"Tin Cup\", and an animated feature called Birds of a Feather, where rival gangs of pigeons battle over territory and racial prejudice in New York's Central Park -- think \"West Side Story\" with pigeons -- but without all that death and stuff. Currently, Rob has written and is developing Tell It Like It Is, a romantic comedy set in New Orleans as well as a one-hour series of about graphic Rock n' Roll from his days in the music biz called, It's Ok. I'm with the Band or These Are Not the Droids You Want! A book of those bizarre tales is also underway. Rob anxiously awaits the day when all of his ambitions are realized and he can escort his mother to the Oscars -- but his mother is still hoping and praying that his head injury will heal!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNDMwNDI3N15BMl5BanBnXkFtZTgwNjM0ODMzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0825805","name":"Rob Steinberg","idIMDB":"nm0825805"},"actorId":"nm0825805","character":"Mike Meltzer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Craig Fairbrass","urlProfile":"http://www.imdb.com/name/nm0265492","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExMDQ3NjMwNzheQTJeQWpwZ15BbWU4MDA5NTU3Mzgx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1964","placeOfBirth":" London, England, UK","height":"6' 3\" (1.91 m)","bio":"At six foot three, Craig Fairbrass is an experienced award winning British actor. Craig has starred in over forty feature films, including the lead role in fifteen independent films in the U.K and U.S as well as Award winning British TV along with lead guest star roles in five major U.S. TV series. Craig also became one of the most iconic voices within the most successful video game franchise of all time, Call Of Duty Modern Warfare by lending his voice to Gaz, Ghost and Walcroft in Call of Duty MW: 1, 2 and 3 and now the new Infinite Warfare. Craig was born in Mile End hospital in London's East End, his father Jack was one of nine kids and was a Stevedore the best you could be as a London docker, his mother Maureen was a machinist dressmaker in Petticoat Lane, she was one of ten kids. Along with his younger sister Lindsey they lived in Stepney where Craig grew up. It was at Eaglesfield boys secondary comprehensive in Woolwich where Craig became fascinated with films and acting, although struggling from one year to the next and not top of the class academically he found drama an outlet, winning a place with the National Theatre youth company, it was here that he got the acting bug. After being expelled at 15 he worked as a roofer's labourer, a job he would return to time and time again in the coming years for support while securing acting roles, this earned him enough money to attend a course at drama school. Leaving drama school Craig soon realised that to survive he needed a second string to his bow if he was to pursue his dream as an actor, so he returned to roofing in the day and working on the doors of some of S.E. London's less desirable nightspots for the next five years until securing enough money to buy his own business, a sandwich bar in Woolwich market. Movie experience began as well in the breakout role of Challoner, opposite Denzel Washington in the powerful British film For Queen And Country. Television soon followed, with the BBC drama Big Deal a regular role in LWT'S award winning London's Burning and the highly acclaimed BAFTA /EMMY award-winning TV series Prime Suspect 1 and 2 in which Craig played hard-bitten detective Frank Burkin opposite Helen Mirren. 1992 saw Craig use this as a calling card in Los Angeles, securing a starring a role in one of the biggest action movies of the 90s, Cliffhanger with Sylvester Stallone, which opened doors in the U.S independent film arena, starring in the action films, Nightscare, Terminal Force and Proteus before returning to the UK to star in the British thriller Killing Time and the award-winning horror, Darklands. In 1999 Craig joined the cast of the BBC's flagship show EastEnders where his recurring character of Dan Sullivan over three years won record viewing figures and a four-hander Sunday evening special Directed by Tom Hooper won a TV BAFTA for best drama. Other strong roles followed, lead villain Ray Betson in TV movie - The Great Dome Robbery, then to Rome to complete his role on Moro, for controversial award-winning Italian art-house director Aurellio Grimaldi and guest lead in Radio 4's afternoon play Fair Maids Are Shining. Craig's role of the killer Henry Caine in White Noise 2, the sequel to the No. 1 box office hit White Noise reaches no. 5 in the top ten cinema films in London. It was in 2007 that saw Craig in his most powerful performance to date, that of true life gangster Pat Tate in Rise Of The Footsoldier the gangster epic based on true life events directed by BAFTA nominee Julian Gilbey, followed by a strong supporting role in The Bank Job, opposite Jason Statham. Craig returned to L.A to guest-star in U.S TV series Terminator The Sarah Connor Chronicles. David Mamet's top rated action drama series The Unit, Stargate SG1 and the action film Far Cry. Craig continues to forge a strong position in the independent film arena with lead roles in Freight, Dead Cert and Devils Playground - comedy cameos in The Shouting Men and Just For The Record. 2011 sees Craig in U.S action thriller House Of The Rising Sun opposite Dave Bautista, co-lead in British thriller St Georges Day, U.S actioner Hijacked and Universal's multi-million dollar Vikingdom 3D. 2012 kicks off with Universal's Get Lucky and Bula Quo the Status Quo action comedy and the male lead in Let Me Survive a drama based on the best selling book. Oct 2012 Craig plays the lead role of British mercenary Lex Walker opposite Jason Patric and James Caan in the L.A based U.S action thriller The Outsider, followed by Universal's gangster spoof The Hooligan Factory. In recent years, Craig takes the lead role of Alfie Jennings in Jonnie Malachi's violent, stylized contract killer movie Breakdown and Mark McQueens slick revenge thriller London Heist written by Craig - set in Spain's glamorous Marbella and London's underworld. The eagerly anticipated motion capture sci-fi game - Star Citizen/ Squadron 42 alongside Gary Oldman, Gillian Anderson and Mark Strong and the new Call of Duty Infinite Warfare with Kit Harrington. Craig has just completed filming on Rise of the Footsoldier 3 - The Pat Tate years.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExMDQ3NjMwNzheQTJeQWpwZ15BbWU4MDA5NTU3Mzgx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0265492","name":"Craig Fairbrass","idIMDB":"nm0265492"},"actorId":"nm0265492","character":"Bruce Leib","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gina Philips","urlProfile":"http://www.imdb.com/name/nm0005312","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTNiMDEwZDAtMDFlYS00MGY5LWIzNGItZmY4YzdhYjg1MmU4XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 May 1970","placeOfBirth":" Miami Beach, Florida, USA","birthName":"Gina Consolo","height":"5' 3\" (1.6 m)","bio":"Gina Philips, born Gina Consolo, is a native Floridian. She has one sibling, Bobby Consolo, who lives in Miami along with her parents, Fredi and Robert. None of them are involved in the business. She came close to completing her degree at the University of Pennsylvania, being only one class short of her degree before dropping out to take up acting as a full-time career. Starting in guest roles on television, and eventually moving into independent and made-for-tv movies, Philips eventually established recurring roles on David E. Kelley's Ally McBeal (1997) and Boston Public (2000) She has also ventured into the mainstream horror genre as the lead in Victor Salva's Jeepers creepers - Le chant du diable (2001). Playing the role of Trish brought a lot of attention and exposure to the doe-eyed beauty's ability to play strong, sometimes sarcastic, female leads, but she declined to reprise her role in the sequel. Philips continues to split her time between television and film. She has now segued into producing as well. She will next be seen in Love and Debate (2006) alongside Sean Astin, which she both produced and starred in.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTNiMDEwZDAtMDFlYS00MGY5LWIzNGItZmY4YzdhYjg1MmU4XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005312","name":"Gina Philips","idIMDB":"nm0005312"},"actorId":"nm0005312","character":"Michelle Leib","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tiffany Dupont","urlProfile":"http://www.imdb.com/name/nm1520988","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODEwNzMzMDY5MF5BMl5BanBnXkFtZTgwMDE5NzEwNzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1981","placeOfBirth":" Gainesville, Georgia, USA","height":"5' 7\" (1.7 m)","bio":"Tiffany Louise Dupont is an American actress known for her portrayal of Frannie Morgan on ABC Family's hit drama series Greek from 2007-2011 and most recently for her recurring role as feisty vlogger Serena Parrish on TNT's crime drama Murder in the First (2016) opposite Taye Diggs and Ian Anthony Dale. Aside from her role on Murder in the First, she has appeared in numerous television series, including Reckless (2014), Anger Management (2014), NCIS: Los Angeles (2014), Mom (2014), Hawaii Five-0 (2013), Supernatural (2013), Franklin & Bash (2012), Castle (2012), CSI: Miami (2012), The Big Bang Theory (2011), The Glades (2011), NCIS (2011), 90210 (2010), CSI: NY (2010), The Whole Truth (2010) and Melrose Place (2009), among others. She has also starred in several independent films starting with One Night With the King (2006), opposite Omar Sharif and Peter O'Toole and winning a C.A.M.I.E. award for her portrayal as Queen Esther. She also starred in The Work and the Glory (2004) and Cheaper By the Dozen opposite Steve Martin and Tom Welling (2003). Growing up, Tiffany was encouraged to participate in a diverse range of activities including dance, martial arts and music. She majored in music at The University of Georgia earning a full scholarship to study violin performance. She was very active in Student Government and was crowned Miss UGA during her junior year. Fully immersed in the arts from a young age, Tiffany's true passion was always acting and she has been a working actress in Los Angeles since 2002. Tiffany, a declared foodie, an accomplished dancer, loves to run, and is a motorcycle enthusiast. She is also super passionate about women's rights & gender equality, and enjoys supporting the cause in many ways, one of which involves regularly volunteering for The Geena Davis Institute for Gender in the Media.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODEwNzMzMDY5MF5BMl5BanBnXkFtZTgwMDE5NzEwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1520988","name":"Tiffany Dupont","idIMDB":"nm1520988"},"actorId":"nm1520988","character":"Olivia Rousseau","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brandon Cordon","urlProfile":"http://www.imdb.com/name/nm2897138","urlPhoto":"","biography":{"birthName":"Brandon Willis Cordon","height":"6' 3½\" (1.92 m)","bio":"Brandon Cordon was born as Brandon Willis Cordon. He is known for his work on Abraham Lincoln: Vampire Hunter (2012), Hijacked (2012) and The Perfect Breed (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2897138","name":"Brandon Cordon","idIMDB":"nm2897138"},"actorId":"nm2897138","character":"Bartender","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Randy Couture","urlProfile":"http://www.imdb.com/name/nm1330276","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMDkwMTI5OV5BMl5BanBnXkFtZTgwMjQ3NzI4MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1963","placeOfBirth":" Everett, Washington, USA","birthName":"Randy Duane Couture","height":"6' 0½\" (1.84 m)","bio":"Randy Couture is a collegiate wrestler and fighter turned actor from Everett, Washington. He served as a four time US Olympic wrestling team alternate as a soldier in the U.S. Army, and is also a 6 time world heavyweight and light heavyweight UFC champion and Hall of Famer. He is a graduate of Oklahoma State University with a bachelor's degree in foreign language literature and is also fluent in German. Randy's current girlfriend is actress Mindy Robinson. He is best known for starring in all three of The Expendables, Ambushed, and The Scorpion King 2.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMDkwMTI5OV5BMl5BanBnXkFtZTgwMjQ3NzI4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1330276","name":"Randy Couture","nicknames":["The Natural","Captain America"],"idIMDB":"nm1330276"},"actorId":"nm1330276","character":"Paul Ross","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ashley Cusato","urlProfile":"http://www.imdb.com/name/nm0960770","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5OTM3ODE2NV5BMl5BanBnXkFtZTgwODc0NDU3MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 July 1974","placeOfBirth":" New York City, New York, USA","birthName":"Ashley Love Cusato","height":"5' 5\" (1.65 m)","bio":"Ashley Cusato was born on July 5, 1974 in New York City, New York, USA as Ashley Love Cusato. She is known for her work on The Other Woman (2014), Piranha 3D (2010) and Cop Land (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5OTM3ODE2NV5BMl5BanBnXkFtZTgwODc0NDU3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0960770","name":"Ashley Cusato","idIMDB":"nm0960770"},"actorId":"nm0960770","character":"Liesel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick J. Rafferty","urlProfile":"http://www.imdb.com/name/nm3111536","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNzU0MDM5Ml5BMl5BanBnXkFtZTgwMTEwMDcwNDE@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Patrick J. Rafferty is an actor and director, known for Hijacked (2012), Run Wild and 21 and a Wake-Up (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNzU0MDM5Ml5BMl5BanBnXkFtZTgwMTEwMDcwNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3111536","name":"Patrick J. Rafferty","idIMDB":"nm3111536"},"actorId":"nm3111536","character":"Max","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Morgan Gillio","urlProfile":"http://www.imdb.com/name/nm2520863","urlPhoto":"","biography":{"bio":"Morgan Gillio is known for his work on The Kids Are All Right (2010), Dark Skies (2013) and Bad Words (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2520863","name":"Morgan Gillio","idIMDB":"nm2520863"},"actorId":"nm2520863","character":"Billy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeronimo Spinx","urlProfile":"http://www.imdb.com/name/nm0819007","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NjM2OTM4OV5BMl5BanBnXkFtZTgwNTY5MzA4OTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"birthName":"Jerome Spinks","bio":"Jeronimo is an American born, US Navy (Hospital Corpsman) veteran-turned-actor. He's best known for his semi-recurring role of NCIS Agent Thompson/Thompson on the hit CBS drama, NCIS: Los Angeles (2009). His most memorable TV moment (brief but significant) was his first TV moment, on the wildly popular FOX drama, 24 (2001), followed by the long running Criminal Minds (2005). His \"acting life\" started with live theater, with his very first stage production performance happening during his last few months of active duty in the military, a few miles off base, of Naval Air Station Lemoore, in the small town of Lemoore, CA., in a barn, of all places. Before coming to Los Angeles to pursue a TV/Film career, he performed (at a feverish pitch) in a few dozen stage productions, in and around San Francisco, and a handful in Los Angeles, primarily with the The Actors' Gang Theatre Company.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NjM2OTM4OV5BMl5BanBnXkFtZTgwNTY5MzA4OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0819007","name":"Jeronimo Spinx","idIMDB":"nm0819007"},"actorId":"nm0819007","character":"Eric Elmwood","urlCharacter":"http://www.imdb.com/character/ch0560211","main":true},{"actorName":"Jay Huguley","urlProfile":"http://www.imdb.com/name/nm0401132","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc3Nzg3NGEtMjc1YS00Y2Q0LTgzODAtYTJkODRhYzNkYTcxXkEyXkFqcGdeQXVyMTkwMzgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1966","placeOfBirth":" Tenafly, New Jersey, USA","birthName":"James S. Huguley","height":"6' 2\" (1.88 m)","bio":"Jay Huguley is an American film, television and theatre actor, best known for playing David on AMC's The Walking Dead, and Jimmy Ledoux on HBO's True Detective, opposite Matthew McConaughey and Woody Harrelson. Huguley also played Will Branson on Seasons 3 and 4 of the HBO series, Treme, and Whit Peyton in the Emmy Award-winning ABC TV series, Brothers & Sisters. In 2015, Huguley starred as Jonah Bock in the hit indie darling, \"Sunny in the Dark,\" a feature film directed by Courtney Ware, for which he took home the award for \"Best Actor\" from the Northeast Film Festival. He is set to appear in the highly anticipated horror film, \"Abattoir,\" by the man credited for furthering the Saw franchise, Darren Lynn Bousman. \"Abattoir\" has already nabbed a sequel deal, prior to its official theatrical release. In 2013, he appeared in Steve McQueen's Oscar-winning film (\"Best Picture\"), \"12 Years a Slave,\" with Chiwetel Ejiofor, Brad Pitt and Michael Fassbender. In addition to \"Treme,\" Huguley has also played recurring characters in ABC Family's Ravenswood (the spin-off to Pretty Little Liars), and in the CW's Star-Crossed. Huguley spent his teenage years attending The Peddie School, a boarding school in Hightstown, N. J., where he later graduated. He spent a year abroad at The University of London studying Political Science, and graduated from American University in Washington, D.C., with a double major in Political Science and Communications. Huguley studied acting at The Lee Strasberg Institute in New York, under the aegis of Anna Strasberg, and at the Beverly Hills Playhouse in L.A., under the world-renowned teacher Milton Katselas. He first realized his passion for acting while taking a Directing class in college, where one of his assignments was to audition for the school play to get an idea of what actors experience in their process of attempting to score acting roles. He got the part of the Gentleman Caller in Tennessee Williams' \"The Glass Menagerie.\" After rehearsing for his role, he knew this was all he wanted to do. Huguley also worked as a fashion model for brands like Armani, Valentino, Zegna, and Romeo Gigli, in London, Milan and Paris. In his earliest appearances on TV, Huguley starred in smaller roles on MADtv; Norm; Walker, Texas Ranger; Providence; and Strong Medicine; before getting more recurring roles on television series such as Summerland and Alias. He also starred as Richard Hightower on the highest-rated daytime drama, The Young and The Restless, in 2010. In 2008, Huguley starred in David Lindsay-Abaire's Tony Award-winning play \"Rabbit Hole\" at the Skylight Theatre. For his role, the Los Angeles Times said, \"Jay Huguley dwells inside the play's contradictions and connects us to its anguished, buoyant heart.\" The following year, Huguley played the lead role in Tom Stoppard's \"The Real Thing\" at Los Angeles' Skylight Theatre.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc3Nzg3NGEtMjc1YS00Y2Q0LTgzODAtYTJkODRhYzNkYTcxXkEyXkFqcGdeQXVyMTkwMzgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0401132","name":"Jay Huguley","idIMDB":"nm0401132"},"actorId":"nm0401132","character":"Tim","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brittany Soileau","urlProfile":"http://www.imdb.com/name/nm4634737","urlPhoto":"","biography":{"bio":"Brittany Soileau is an actress, known for Hijacked (2012), The Philly Kid (2012) and Abraham Lincoln: Vampire Hunter (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4634737","name":"Brittany Soileau","idIMDB":"nm4634737"},"actorId":"nm4634737","character":"Assistant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lynn Moore","urlProfile":"http://www.imdb.com/name/nm2062405","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDg0ZGQ2NzItMzE0Ni00YTdmLTk1ZWItMTRiOGM5N2MwZmUzL2ltYWdlXkEyXkFqcGdeQXVyOTQ2Mjc1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Lynn Moore is an actress with a BFA in Theatre Performance & Directing, beginning her career in touring theatre, performing numerous Shakespeare plays such as Much Ado About Nothing, Midsummer Night's Dream and The Taming of the Shrew with the Brittish Arts Exchange. Her father being an EOD diver, she grew up as a Navy brat, traveling most of her life before settling back in Los Angeles where she was born.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDg0ZGQ2NzItMzE0Ni00YTdmLTk1ZWItMTRiOGM5N2MwZmUzL2ltYWdlXkEyXkFqcGdeQXVyOTQ2Mjc1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2062405","name":"Lynn Moore","idIMDB":"nm2062405"},"actorId":"nm2062405","character":"Katia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jody Quigley","urlProfile":"http://www.imdb.com/name/nm3621308","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3ODI1NzMzMl5BMl5BanBnXkFtZTgwMjk4OTAxMTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Jody Quigley is an actor and producer, known for Apparition (2015), Wicked Blood (2014) and In the Bag (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3ODI1NzMzMl5BMl5BanBnXkFtZTgwMjk4OTAxMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3621308","name":"Jody Quigley","idIMDB":"nm3621308"},"actorId":"nm3621308","character":"Nick Stanton","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1986857","urlIMDB":"http://www.imdb.com/title/tt1986857","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"01","month":"08","year":"2011","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 26 min (86 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"3.8","filmingLocations":[{"location":"Baton Rouge, Louisiana, USA"}],"rated":"R","awards":[],"votes":"3,354","type":"Movie","companyCreditsSimple":[{"idCompany":"co0291767","name":"NuttHouse Moving Pictures Company"},{"idCompany":"co0275864","name":"Swift Street Productions"}],"keywords":{"keywords":["private jet","die hard scenario","bomb disposal","bomb","extortion","murder","silencer","girl on top","airplane hijack","hijack","bare breasts","female nudity","topless","sex scene","mile high club","cia agent","shootout","gunfight","ambush","stakeout","intelligence operative","party","businessman","police shootout","police officer killed","police officer shot in the chest","police officer shot in the head","police officer shot","police officer"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:46:31"}}