{"data":{"movies":[{"title":"Boys of Abu Ghraib","originalTitle":"","year":"2014","releaseDate":"20140328","directors":[{"name":"Luke Moran","id":"nm3099213"}],"writers":[{"name":"Luke Moran","id":"nm3099213"}],"runtime":"102 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE2Nzc2MTE1NF5BMl5BanBnXkFtZTgwNjUyODc5NjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Thriller","War"],"plot":"An American soldier deployed at Abu Ghraib finds himself behind the walls of the infamous Hard Site, where he develops a secret friendship with an Iraqi detainee.","simplePlot":"An American soldier deployed at Abu Ghraib finds himself behind the walls of the infamous Hard Site, where he develops a secret friendship with an Iraqi detainee.","actors":[{"actorName":"Luke Moran","urlProfile":"http://www.imdb.com/name/nm3099213","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNjgxODE1OF5BMl5BanBnXkFtZTgwMDA4NzY1MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Luke Moran is an actor and producer, known for Boys of Abu Ghraib (2014) and Listen to Your Heart (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNjgxODE1OF5BMl5BanBnXkFtZTgwMDA4NzY1MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3099213","name":"Luke Moran","idIMDB":"nm3099213"},"actorId":"nm3099213","character":"Jack Farmer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sean Astin","urlProfile":"http://www.imdb.com/name/nm0000276","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjczOTQ1NF5BMl5BanBnXkFtZTcwMzI2NzYyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 February 1971","placeOfBirth":" Santa Monica, California, USA","birthName":"Sean Patrick Duke","height":"5' 7\" (1.7 m)","bio":"Sean Astin is well known for his film debut portraying Mikey in Steven Spielberg's The Goonies (1985), for playing the title role in the critically acclaimed Rudy (1993), and for his role as the beloved Sam Gamgee in the Academy Award winning trilogy, The Lord of the Rings: The Fellowship of the Ring (2001), The Lord of the Rings: The Two Towers (2002), and The Lord of the Rings: The Return of the King (2003). Astin was born Sean Patrick Duke on February 25, 1971 in Santa Monica, California. His mother was actress Patty Duke. At the time of his birth, his biological father was believed to be entertainer Desi Arnaz Jr., but Astin discovered through a DNA test in the 1990s that his biological father is music promoter Michael Tell, who was married to Patty Duke in 1970. Sean was raised by his stepfather, actor John Astin, who married Patty Duke in 1972 and whose surname Sean took. Sean's mother was of Irish and more distant German ancestry, and Sean's biological father is of Austrian Jewish and Polish Jewish descent. At age nine, Sean starred with his mother in the after-school special Please Don't Hit Me, Mom (1981). Followed by Sean's feature debut The Goonies (1985) and since then, he has had a steady stream of roles. Starring in Toy Soldiers (1991), Where the Day Takes You (1991), Rudy (1993) and Harrison Bergeron (1995). He directed and co-produced the short film Kangaroo Court (1994), which was nominated in the best short film category at The 67th Annual Academy Awards (1995). Sean's adoptive father John Astin was nominated for the same award in 1969. Politically, Sean has been very active having served in two non-partisan Presidential appointments. Sean also hosts a live weekly 2 hour in-studio bi-partisan political radio talk show, 'Vox Populi Radio' which was made possible by a successful crowdfunding campaign in 2013. In 2004, Sean broke into the publishing world and authored the NY Times Best Selling release of There and Back Again a memoir of his film career (co-written with Joe Layden). Sean attended Crossroads High School for the Arts and studied with the famous Stella Adler. He graduated with honors from UCLA; B.A. in History & B.A. in English American Literature and Culture. Sean is married to Christine Astin, his co-producer on Kangaroo Court (1994). The couple lives in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjczOTQ1NF5BMl5BanBnXkFtZTcwMzI2NzYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000276","name":"Sean Astin","idIMDB":"nm0000276"},"actorId":"nm0000276","character":"Tanner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sara Paxton","urlProfile":"http://www.imdb.com/name/nm0668139","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NDUzNTIyOV5BMl5BanBnXkFtZTgwNTQxMjEyNTE@._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1988","placeOfBirth":" Woodland Hills, Los Angeles, California, USA","height":"5' 7\" (1.7 m)","bio":"Sara Paxton was born in Woodland Hills, California. At a young age she began acting in television commercials. She was cast in her first film at the age of 8 as a child at school and at the party in Liar Liar (1997). Her first major television series role was on the WB's Greetings from Tucson (2002). She filmed Sleepover (2004) in fall 2003 (released July 9, 2004), was in Aquamarine (2006) with Julia Roberts' niece, Emma Roberts. Her movie Return to Halloweentown (2006) opened on October 20, 2006. She has also starred in television shows such as SpongeBob SquarePants (1999) and Malcolm in the Middle (2000). She had a recurring TV role on the WB's Summerland (2004). Sara Paxton graduated from El Camino Real High School in Woodland Hills in 2006 and is fluent in both English and Spanish.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NDUzNTIyOV5BMl5BanBnXkFtZTgwNTQxMjEyNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0668139","name":"Sara Paxton","idIMDB":"nm0668139"},"actorId":"nm0668139","character":"Peyton","urlCharacter":"http://www.imdb.com/character/ch0404612","main":true},{"actorName":"Omid Abtahi","urlProfile":"http://www.imdb.com/name/nm1859475","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MzM2ODQyNF5BMl5BanBnXkFtZTcwMzc3ODAzMQ@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"bio":"Omid Abtahi is known for his work on Argo (2012), Brothers (2009) and The Hunger Games: Mockingjay - Part 2 (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MzM2ODQyNF5BMl5BanBnXkFtZTcwMzc3ODAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1859475","name":"Omid Abtahi","idIMDB":"nm1859475"},"actorId":"nm1859475","character":"Ghazi Hammoud","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Heard","urlProfile":"http://www.imdb.com/name/nm0001334","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzczODkyNzY4OV5BMl5BanBnXkFtZTcwNTU0NjQzMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 March 1945","placeOfBirth":" Washington, District of Columbia, USA","height":"5' 9¼\" (1.76 m)","bio":"John Heard is a very talented actor who established himself in the late 1970s and early '80s with roles in the movies Between the Lines (1977), Chilly Scenes of Winter (1979) (a.k.a. \"Head Over Heels\"), and Heart Beat (1981) (in which he played Jack Kerouac to Nick Nolte's Neal Cassady and Sissy Spacek's Carolyn Cassady) before giving a tour de force performance as a hideously wounded (both physically and psychologically) Vietnam veteran in Cutter's Way (1981) (a.k.a. \"Cutter and Bone\") opposite Jeff Bridges. He also shined as Reverend Dimmesdale (one of America's first religious hypocrites) in the 1979 PBS version of Nathaniel Hawthorne's The Scarlet Letter (1979). Both \"Chilly Scenes of Winter\" and Cutter's Way\" (originally released as \"Head Over Heels\" and \"Cutter and Bone\", respectively) had been re-released under new titles after failing in their first go-rounds, such was the quality of the films. The two re-releases helped redefine the practice by which major studios handled smaller, art house quality pictures by releasing them carefully to select theaters with bespoke marketing campaigns so they reached the proper audience. (Studios would later develop their own art film-independent film subsidiaries to handle such pictures, so they didn't \"fall through the cracks\" like the first releases of the two Heard films.) By the early 1980s John Heard seemed on his way to establishing himself as a major American actor if not on the path to movie stardom. At the time, there was joke that involved confusing Heard with John Hurt and William Hurt because of the similarity of their last names. At the time these contemporaries were considered equal in terms of their star power. That was 30 years ago. William Hurt (the erstwhile husband of Heard's \"Head Over Heels\" co-star Mary Beth Hurt) went on to win a Best Actor Oscar as well as enjoy leading man status as a movie star in the mid- to late-'80s before he flared out in the early 1990s. John Hurt become one of the most respected actors of his generation, nominated twice for the Academy Award. Among Heard's co-stars of his early endeavors, Bridges and Spacek also went on to win Oscars and Nolte has been a multiple nominee. In the early '80s it would not have been unreasonable to predict that Heard himself would become an Oscar winner or a multiple nominee. That didn't happen. (He did get nominated for an Emmy for his turn as a corrupt police detective on The Sopranos (1999).) Heard now is best known for his two turns as Macaulay Culkin's father in the Home Alone (1990) movies. In the 1980s he continued to work on A-List projects, playing the not-so-sympathetic son to Geraldine Page in The Trip to Bountiful (1985) (for which Page won her own Oscar) and Tom Hanks's adult rival in Big (1988) (for which Hanks won his first Oscar nomination), but this meant that by the latter part of the decade he had failed to establish himself as a leading man and was doing supporting roles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzczODkyNzY4OV5BMl5BanBnXkFtZTcwNTU0NjQzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001334","name":"John Heard","idIMDB":"nm0001334"},"actorId":"nm0001334","character":"Sam Farmer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Welch","urlProfile":"http://www.imdb.com/name/nm0919616","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwNTk1Nzk3MV5BMl5BanBnXkFtZTgwNjI5MjY3MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1987","placeOfBirth":" Los Angeles, California, USA","height":"5' 10\" (1.78 m)","bio":"Michael Welch is a veteran actor of 18 years with nearly 100 film and television credits to his name. He has received tremendous praise throughout his career by fans, critics, and industry insiders alike for the depth and diversity of his work. Michael continues to build his career, as he always has a new project on the horizon. Welch is best known for his role as the popular Mike Newton in the Twilight Film Series, a franchise that grossed $3.3 billion worldwide. More recently, he appeared as a series regular on Z Nation, Syfy's hit original zombie series that's just been renewed for a third season. Michael was also a regular as Luke Girardi in the beloved, Emmy-nominated CBS show, Joan of Arcadia, for which he received his second Young Artist Award. His first feature film experience was as Artim in Star Trek: Insurrection, the ninth installment of the iconic franchise. Welch is passionate about the issue of clean water and is heavily involved with The Thirst Project, a youth oriented non-profit that builds fresh-water wells in developing communities. Michael is represented by Primary Wave Entertainment and The Talent House LA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwNTk1Nzk3MV5BMl5BanBnXkFtZTgwNjI5MjY3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0919616","name":"Michael Welch","nicknames":["Mike"],"idIMDB":"nm0919616"},"actorId":"nm0919616","character":"Pits","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Robinson","urlProfile":"http://www.imdb.com/name/nm1440281","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwODI4MDc0OV5BMl5BanBnXkFtZTgwMDU2NjYzMDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1985","placeOfBirth":" Portland, Oregon, USA","birthName":"John C. Robinson","height":"5' 10½\" (1.79 m)","bio":"Likes snowboarding and plays lacrosse for his school. He was chosen out of 3000 children to play in the controversial film by Gus Van Sant which mirrors the Columbine school shootings called Elephant (2003). John took acting classes in Portland years prior to his acting debut in this movie. Coming up next for John is Lords of Dogtown (2005) a film that follows the surf and skateboarding trends that originated in Venice, California during the 1970s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwODI4MDc0OV5BMl5BanBnXkFtZTgwMDU2NjYzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1440281","name":"John Robinson","idIMDB":"nm1440281"},"actorId":"nm1440281","character":"Ryan Fox","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elijah Kelley","urlProfile":"http://www.imdb.com/name/nm0445903","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwMjQwMzI2NDBeQTJeQWpwZ15BbWU3MDY3NzE5MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 August 1986","placeOfBirth":" LaGrange, Georgia, USA","height":"5' 6½\" (1.69 m)","bio":"Elijah Kelley was born on August 1, 1986 in LaGrange, Georgia, USA. He is an actor, known for Hairspray (2007), Red Tails (2012) and Strange Magic (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwMjQwMzI2NDBeQTJeQWpwZ15BbWU3MDY3NzE5MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0445903","name":"Elijah Kelley","nicknames":["E.K."],"idIMDB":"nm0445903"},"actorId":"nm0445903","character":"Tunde","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott Patterson","urlProfile":"http://www.imdb.com/name/nm0666398","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NjQ5MjI0Ml5BMl5BanBnXkFtZTYwOTg3Mjg1._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1958","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Scott Gordon Patterson","height":"6' (1.83 m)","bio":"An accomplished actor in film, television and theater, Scott Patterson is well known to television audience from his seven seasons as diner owner Luke Danes in the hit series \"Gilmore Girls.\" Patterson now brings his many talents to the network's new comedy \"Aliens In America,\" playing Gary Tolchuk, the aspiring entrepreneur dad of a Wisconsin family whose lives are turned upside down by the arrival of a Pakistani Muslim exchange student. Patterson, born in Philadelphia and raised in New Jersey, attended Rutgers University and pursued a degree in comparative literature. He studied acting in New York with renowned coaches Robert Lewis and Sondra Lee and observed Paul Newman, Arthur Penn and Frank Corsaro at The Actors Studio, where he appeared in numerous productions. The theater company he founded in 1988 in New York City, Arc Light, produced the works of John Bishop, Sam Shepherd, Harold Pinter and Shakespeare. Patterson recently completed filming on the upcoming horror feature \"Saw IV.\" He appeared on the big screen in \"Her Best Move,\" \"Little Big League,\" \"Three Wishes,\" \"Highway 395\" and \"Rhapsody in Bloom.\" On television, in addition to his memorable role as Luke on \"Gilmore Girls,\" Patterson appeared on \"Seinfeld,\" \"Will & Grace,\" \"It's Like, You Know\" and \"Fired Up.\" He has also guest starred on \"Arli$$\" and \"Get Real,\" and voiced the character of Lieutenant Farraday in the 2004 animated series \"Justice League Unlimited,\" from Warner Bros. Animation. Patterson writes music and paints in his spare time. His gallery show of completed works will be announced in early 2008. Patterson also collects art, artifacts and rare writings. His prehistoric petrified baby frog collection is on loan to the Louvre in Paris through 2010. Patterson currently resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NjQ5MjI0Ml5BMl5BanBnXkFtZTYwOTg3Mjg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0666398","name":"Scott Patterson","idIMDB":"nm0666398"},"actorId":"nm0666398","character":"Captain Hayes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jermaine Williams","urlProfile":"http://www.imdb.com/name/nm0930892","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNDMzNjM5NV5BMl5BanBnXkFtZTYwODgyNTM3._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1982","placeOfBirth":"","height":"5' 5\" (1.65 m)","bio":"Jermaine Williams was born on December 31, 1982. He is an actor and producer, known for The Great Debaters (2007), Stomp the Yard (2007) and World's Greatest Dad (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNDMzNjM5NV5BMl5BanBnXkFtZTYwODgyNTM3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0930892","name":"Jermaine Williams","idIMDB":"nm0930892"},"actorId":"nm0930892","character":"Gable","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cru Ennis","urlProfile":"http://www.imdb.com/name/nm3172703","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMzk5MDM1ODdeQTJeQWpwZ15BbWU4MDE0Mzc0ODcx._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Cru Ennis is an actor and producer, known for Boys of Abu Ghraib (2014), A Beer Tale (2012) and Priceless (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMzk5MDM1ODdeQTJeQWpwZ15BbWU4MDE0Mzc0ODcx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3172703","name":"Cru Ennis","idIMDB":"nm3172703"},"actorId":"nm3172703","character":"Shaw","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bernhard Forcher","urlProfile":"http://www.imdb.com/name/nm2400472","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDIyNDYwMTA3OF5BMl5BanBnXkFtZTcwNDUyODIwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Bernhard Forcher is an actor and writer, known for Fury (2014), Counterpart (2017) and The Man in the High Castle (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDIyNDYwMTA3OF5BMl5BanBnXkFtZTcwNDUyODIwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2400472","name":"Bernhard Forcher","idIMDB":"nm2400472"},"actorId":"nm2400472","character":"Gates","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Luis Bordonada","urlProfile":"http://www.imdb.com/name/nm3287985","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEwNzgxOTU4Ml5BMl5BanBnXkFtZTgwMTE4NzY3MjE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"bio":"Luis Bordonada was born in Juarez, Chihuahua, Mexico to Mexican and Puerto Rican parents. He was raised in Parral, Chihuahua by his grandparents until his grandmother passed away when he was 10 years old. After his grandmother's death, Luis was sent to the United States to live with his parents in El Paso, Texas. He began participating in plays at the church his parents attended and in school. Luis enlisted in active duty Army after graduating High School in 1997 and was discharged honorably in 2001, but continued serving with the National Guard until 2003. He started his theatre education at El Paso Community College theater program under the guidance of Prof. Hector Serrano, founder of Viva El Paso and Shakespeare on The Rocks Theater Festival. Luis has since continued reinforcing his education through the University of New Mexico Theater Program. His first break in film came from the Hughes Brothers in their film The Book of Eli in 2010. In the same year Luis was cast as the lead in the award winning independent film, Ilegales (Illegal), for which he earned a Best Actor Award in Chicago's Naperville Independent Film Festival. He has had recurring roles FX's The Bridge, AMC's Better Call Saul, along with guest starring on A&E's Longmire. Luis recently finished his first directorial effort with the short, La Botella (The Bottle). He continues to work in both film and television.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEwNzgxOTU4Ml5BMl5BanBnXkFtZTgwMTE4NzY3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3287985","name":"Luis Bordonada","idIMDB":"nm3287985"},"actorId":"nm3287985","character":"Ramirez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jerry Hernandez","urlProfile":"http://www.imdb.com/name/nm1750860","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTA3OTQ0Nl5BMl5BanBnXkFtZTcwNTI3OTQxNQ@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"birthName":"Jerry Kenneth Hernandez","height":"5' 9\" (1.75 m)","bio":"Born in East Los Angeles, California, Jerry's introduction into the arts began early on. In high school he appeared in theater productions of Shakespeare's Macbeth and The Wiz. Jerry would later translate that into professional credits after being approached by an agent at a talent competition involving dance and acting. He was later signed and a career in entertainment soon took shape. Before focusing on acting, Jerry began as a professional dancer performing in music videos for artists, national tours, and commercials-working alongside such directors as Joseph Kahn and Paul Hunter, choreographers Laurie Ann Gibson and Nadine \"Hi-Hat\" Ruffin and musicians such as Madonna and Prince. Since transitioning from the dance world into acting, Jerry has appeared on television shows like The Shield, Invasion, Cold Case and The Bridge; film credits have included the independent film Ethan Mao (directed by Quentin Lee) and HBO's Walkout (directed by Edward James Olmos).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTA3OTQ0Nl5BMl5BanBnXkFtZTcwNTI3OTQxNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1750860","name":"Jerry Hernandez","idIMDB":"nm1750860"},"actorId":"nm1750860","character":"Rodeo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennifer Ferran","urlProfile":"http://www.imdb.com/name/nm4550864","urlPhoto":"","biography":{"bio":"Jennifer Ferran is an actress, known for Boys of Abu Ghraib (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4550864","name":"Jennifer Ferran","idIMDB":"nm4550864"},"actorId":"nm4550864","character":"Kelly Farmer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt1965162","urlIMDB":"http://www.imdb.com/title/tt1965162","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 42 min (102 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.4","metascore":"34","filmingLocations":[{"location":"New Mexico, USA"}],"rated":"R","awards":[{"award":"Gasparilla International Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Won Audience Award","categories":[{"category":"Feature","names":[{"name":"Luke Moran","id":"nm3099213","role":null},{"name":"Cru Ennis","id":"nm3172703","role":null}]}]}]},{"award":"Golden Trailer Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Best Independent Trailer","names":[{"name":"Vertical Entertainment","id":null,"role":null},{"name":"Rebel One Pictures","id":null,"role":null},{"name":"Aspect Ratio","id":null,"role":null}]}]}]}],"votes":"1,703","type":"Movie","companyCreditsSimple":[{"idCompany":"co0309321","name":"Rebel One Pictures"}],"keywords":{"keywords":["abu ghraib"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 06:32:16"}}