{"data":{"movies":[{"title":"Dragons: Gift of the Night Fury","originalTitle":"","year":"2011","releaseDate":"20111115","directors":[{"name":"Tom Owens","id":"nm0654475"}],"writers":[{"name":"Adam F. Goldberg","id":"nm1104057"},{"name":"Cressida Cowell","id":"nm2441763"}],"runtime":"22 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MzQ5MzYyMl5BMl5BanBnXkFtZTcwODM0MTY3OA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Short","Adventure","Family"],"plot":"The Viking town of Berk, now enjoying its new alliance with the dragons, is preparing for its annual winter holiday of Snoggletog. However, that spirit is threatened when all the dragons, except Toothless who needs Hiccup to help him, suddenly fly away for some reason. While Astrid ineffectually tries to salvage the occasion, Hiccup decides to build Toothless a new prosthetic to allow him to fly independently, only to have the dragon take off as well. However, as the holiday approaches, Hiccup finds himself swept up to learn the dragons' secret the hard way and to find a solution to bring them home early.","simplePlot":"As the village of Berk prepares for its winter holiday, the resident dragons all inexplicably fly away.","actors":[{"actorName":"Jay Baruchel","urlProfile":"http://www.imdb.com/name/nm0059431","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MjY0MzU0OV5BMl5BanBnXkFtZTcwOTE0NDA2NA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1982","placeOfBirth":" Ottawa, Ontario, Canada","birthName":"Jonathan Adam Saunders Baruchel","height":"6' (1.83 m)","bio":"Jay Baruchel was born in Ottawa, Ontario, and was raised in Montreal, Quebec, Canada. He is the son of Robyne (Ropell), a freelance writer, and Serge Victor Baruchel, an antiques dealer. He has a younger sister who also acts. He started acting in 1995 when he made his first of three appearances on the hit show Are You Afraid of the Dark? (1990). He was also in more localized shows such as My Hometown (1996) and Popular Mechanics for Kids (1997). Baruchel had spent some downtime and finally got a chance to be in a classic film called Almost Famous (2000) in 2000. He played \"Vic\", a devout fan of Led Zeppelin. Judd Apatow soon had a show in the works and Baruchel played \"Steven Karp\" on Undeclared (2001). He also had the chance to star alongside actors such as Ian Somerhalder and James Van Der Beek as \"Harry\" in The Rules of Attraction (2002). Things began to slow down a bit after a couple more failed shows. Soon enough, Baruchel came back as the courageous \"Danger Barch\" in Million Dollar Baby (2004). Bringing life to a role that could have been ruined so easily, Baruchel made \"Danger\" a well-loved character. The best part about this actor is his loyalty to his home country. He loves to be able to work in Canada as often as possible. He has been in many fantastic independent films such as Fetching Cody (2005), Just Buried (2007) and Real Time (2008). All three of those films appeal to sides of a person that are never known to exist until it's too late. He was also in many successful American comedy films. He was the lead in She's Out of My League (2010) and played one of Seth Rogen's best friends (which he really is) in the movie Knocked Up (2007). He's also made his mark in family-friendly films such as How to Train Your Dragon (2010), playing the unlikely \"Viking Hiccup\" and also played the title role in The Sorcerer's Apprentice (2010) alongside his newly-found kindred spirit, actor Nicolas Cage. It is no secret that while he enjoys acting, it truly is a means to an end. He lived his dream as he worked on the hockey comedy Goon (2011), and is working on many other films that are what he considers to be passion projects. Now he is making films that he has been preparing for all of his life and nothing can slow him down.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MjY0MzU0OV5BMl5BanBnXkFtZTcwOTE0NDA2NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0059431","name":"Jay Baruchel","idIMDB":"nm0059431"},"actorId":"nm0059431","character":"Hiccup Horrendous Haddock III","urlCharacter":"http://www.imdb.com/character/ch0184179","main":true},{"actorName":"Gerard Butler","urlProfile":"http://www.imdb.com/name/nm0124930","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDMwMzc4Ml5BMl5BanBnXkFtZTcwMDg4Nzg4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1969","placeOfBirth":" Paisley, Scotland, UK","birthName":"Gerard James Butler","height":"6' 2\" (1.88 m)","bio":"Gerard James Butler was born in Paisley, Scotland, to Margaret and Edward Butler, a bookmaker. His family is of Irish origin. Gerard spent some of his very early childhood in Montreal, Quebec, but was mostly raised, along with his older brother and sister, in his hometown of Paisley. His parents divorced when he was a child, and he and his siblings were raised primarily by their mother, who later remarried. He had no contact with his father between the ages of two and 16 years old, after which time they became close. His father passed away when Gerard was in his early 20s. Butler went on to attend Glasgow University, where he studied to be a lawyer/solicitor. He was president of the school's law society thanks to his outgoing personality and great social skills. His acting career began when he was approached in a London coffee shop by actor Steven Berkoff, who later appeared alongside Butler in Attila (2001), who gave him a role in a stage production of \"Coriolanus\". After that, Butler decided to give up law for acting. He was cast as Ewan McGregor's character \"Renton\" in the stage adaptation of Trainspotting. His film debut was as Billy Connolly's younger brother in Mrs Brown (1997). While filming the movie in Scotland, he was enjoying a picnic with his mother near the River Tay when they heard the shouts of a young boy, who had been swimming with a friend, who was in some trouble. Butler jumped in and saved the young boy from drowning. He received a Certificate of Bravery from the Royal Humane Society. He felt he only did what anyone in the situation would have done. His film career continued with small roles, first in the \"James Bond\" movie, Tomorrow Never Dies (1997), and then Russell Mulcahy's Tale of the Mummy (1998). In 2000, Butler was cast in two breakthrough roles, the first being \"Attila the Hun\" in the USA Network mini-series, Attila (2001). The film's producers wanted a known actor to play the part but kept coming back to Butler's screen tests and decided he was their man. He had to lose the thick Scottish accent, but managed well. Around the time \"Attila\" was being filmed, casting was in progress for Wes Craven's new take on the \"Dracula\" legacy. Also wanting a known name, Butler wasn't much of a consideration, but his unending tenacity drove him to hounding the producers. Eventually, he sent them a clip of his portrayal of \"Attila\". Evidently, they saw something because Dracula 2000 (2000) was cast in the form of Butler. Attila's producers, thinking that his big-screen role might help with their own film's ratings, finished shooting a little early so he could get to work on Dracula 2000 (2000). Following these two roles, Butler developed quite a fan base, an Internet site and began appearing on lists everywhere. Since then, he has appeared in Reign of Fire (2002) as \"Creedy\" and Lara Croft Tomb Raider: The Cradle of Life (2003) as \"Terry Sheridan\", alongside Angelina Jolie. The role that garnered him the most attention from both moviegoers and movie makers, alike, was that of \"Andre Marek\" in the big-screen adaptation of Michael Crichton's novel, Timeline (2003). Butler played an archaeologist who was sent back in time with a team of students to rescue a colleague. Last year, he appeared in Andrew Lloyd Webber's musical, The Phantom of the Opera (2004), playing the title character in the successful adaptation of the stage musical. It was a role that brought him much international attention. Other projects include Dear Frankie (2004), The Game of Their Lives (2005) and Beowulf, la légende viking (2005). In 2007, he starred as Spartan \"King Leonidas\" in the Warner Bros. production 300 (2006), based on the Frank Miller graphic novel, and Shattered (2007), co-starring Pierce Brosnan and Maria Bello, which aired on network TV under the title, \"Shattered\". He most recently starred in P.S. I Love You (2007), with Academy Award-winner Hilary Swank. In 2007, he appeared in Nim's Island (2008) and RocknRolla (2008), and completed the new Mark Neveldine / Brian Taylor film, Gamer (2009). His next films included The Ugly Truth (2009), co-starring Katherine Heigl, which began filming in April 2008, The Bounty Hunter (2010), How to Train Your Dragon (2010), Chasing Mavericks (2012) and Olympus Has Fallen (2013). Butler is also a relative of rising animator and film director Mark Flood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDMwMzc4Ml5BMl5BanBnXkFtZTcwMDg4Nzg4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0124930","name":"Gerard Butler","nicknames":["Gerry"],"idIMDB":"nm0124930"},"actorId":"nm0124930","character":"Stoick the Vast","urlCharacter":"http://www.imdb.com/character/ch0137637","main":true},{"actorName":"Craig Ferguson","urlProfile":"http://www.imdb.com/name/nm0272401","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NDYxNDM0OF5BMl5BanBnXkFtZTcwNDg4Mjc5Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1962","placeOfBirth":" Glasgow, Scotland, UK","height":"6' 2\" (1.88 m)","bio":"By August of 1994, Craig Ferguson was established as one of Great Britain's leading comedians - he had just had huge success at the Edinburgh Festival. In January 1995 he moved to Los Angeles where he now works as an actor-writer-director-producer-creator.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NDYxNDM0OF5BMl5BanBnXkFtZTcwNDg4Mjc5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0272401","name":"Craig Ferguson","nicknames":["Bing Hitler"],"idIMDB":"nm0272401"},"actorId":"nm0272401","character":"Gobber the Belch","urlCharacter":"http://www.imdb.com/character/ch0182922","main":true},{"actorName":"America Ferrera","urlProfile":"http://www.imdb.com/name/nm1065229","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDUzOTkxNF5BMl5BanBnXkFtZTcwNjMwNjk0OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1984","placeOfBirth":" Los Angeles, California, USA","birthName":"America Georgine Ferrera","height":"5' 1\" (1.55 m)","bio":"America Georgine Ferrera (born April 18, 1984) is an American actress. She is known for her leading role as Betty Suarez on the American Broadcasting Company's comedy-drama television series Ugly Betty (2006-10). Her acting garnered critical acclaim, and she won the Golden Globe Award for Best Actress - Television Series Musical or Comedy, the Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Comedy Series, and the Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDUzOTkxNF5BMl5BanBnXkFtZTcwNjMwNjk0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1065229","name":"America Ferrera","nicknames":["Georgina"],"idIMDB":"nm1065229"},"actorId":"nm1065229","character":"Astrid Hofferson","urlCharacter":"http://www.imdb.com/character/ch0137641","main":true},{"actorName":"Jonah Hill","urlProfile":"http://www.imdb.com/name/nm1706767","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNDU0NzAwNl5BMl5BanBnXkFtZTcwMzQxMzIzNw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 December 1983","placeOfBirth":" Los Angeles, California, USA","birthName":"Jonah Hill Feldstein","height":"5' 7\" (1.7 m)","bio":"Jonah Hill was born and raised in Los Angeles, the son of Sharon (Chalkin), a fashion designer and costume stylist, and Richard Feldstein, a tour accountant for Guns N' Roses. His siblings are music manager Jordan Feldstein and actress Beanie Feldstein. He graduated from Crossroads School in Santa Monica and went on to The New School in New York to study drama. He began writing and performing in plays while at college in New York, and managed to get himself introduced to Dustin Hoffman, through whom he got an audition for his first film role in I Heart Huckabees (2004). A succession of increasingly high profile film and TV parts followed until he eventually landed one of the starring roles in the teen hit, Superbad (2007). Continuing to write and act, more roles followed as well as popular appearances on US TV talk shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNDU0NzAwNl5BMl5BanBnXkFtZTcwMzQxMzIzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1706767","name":"Jonah Hill","idIMDB":"nm1706767"},"actorId":"nm1706767","character":"Snotlout","urlCharacter":"http://www.imdb.com/character/ch0137639","main":true},{"actorName":"Christopher Mintz-Plasse","urlProfile":"http://www.imdb.com/name/nm2395586","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjUzMDk5N15BMl5BanBnXkFtZTcwNzk0Nzk5Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1989","placeOfBirth":" Los Angeles, California, USA","birthName":"Christopher Charles Mintz-Plasse","height":"5' 7½\" (1.71 m)","bio":"Christopher Mintz-Plasse was born on June 20, 1989 in Los Angeles, California, USA as Christopher Charles Mintz-Plasse. He is an actor, known for Superbad (2007), How to Train Your Dragon (2010) and Kick-Ass (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjUzMDk5N15BMl5BanBnXkFtZTcwNzk0Nzk5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2395586","name":"Christopher Mintz-Plasse","nicknames":["Chris"],"idIMDB":"nm2395586"},"actorId":"nm2395586","character":"Fishlegs","urlCharacter":"http://www.imdb.com/character/ch0137638","main":true},{"actorName":"T.J. Miller","urlProfile":"http://www.imdb.com/name/nm2554352","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMzI0NTEwMF5BMl5BanBnXkFtZTcwMjk4MDkxNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1981","placeOfBirth":" Denver, Colorado, USA","birthName":"Todd Joseph Miller","height":"6' 2\" (1.88 m)","bio":"A comedian. Improvisation, Sketch and Stand-up comedy are his forte. Todd Joseph Miller was born in Denver, Colorado, to Leslie, a clinical psychologist, and Kent Miller, an attorney. He went to East High School, and college in Washington, D.C. There, he performed with the group receSs for 4 years, being the only person in his class out of 100 to audition and be accepted into the group. He remained the sole member of receSs until his junior year, when he was joined by Michael \"Tuck The Ruckus\" Tokaruk, an acclaimed comedian and equestrian, who taught T.J. how to ride a horse, a pastime he calls \"droll.\" He met his future wife, Kate Gorney, when they performed in \"A Chorus Line\" in university production of the musical. She played The Ballerina (being an accomplished ballerina herself) and he played Richie, the African American character. He credits the casting to East High School, which was a primarily black and Latino high school, and also that no black people auditioned for the part. During his Time in the nation's capital, he studied classical acting at B.A.D.A in Oxford, England and circus arts at Frichess Theatre Urbain. He was outstanding in the field of Stilt Walking, but was never able to execute any trick, at all, on Trapeze. He is an accomplished Clown and Juggler, having mastered 5 ball juggling, over fifty 3-ball tricks, clubs, torches, knives, and his specialty (which garnered him a Magician Membership to The Magic Castle in Hollywood, CA) Cigar Boxes. After graduating with honors (a bachelor's degree in Psychology with a concentration in Persuasion Theory and Social Influence) he moved to Chicago where he began performing with independent improvisation teams such as the group Chuckle Sandwich, the i.o. house team Bullet Lounge, The sketch group Heavy Weight (with Mark Raterman, Nick Vatterott & Brady Novak). He toured with Second City for almost 2 years (though he was never a company member of the MainStage), and during that time he missed over 15 flights to various cities the company toured to. During his time in Chicago, he performed Standup every night for almost 4 years, never taking a night off even on Holidays. He became a regular at Chicago's famed alternative room The Lincoln Lodge, and only performed at Chicago's Zanies Comedy Club 3 times in 4 years, apparently because they had an aversion to his absurdist style. Miller's first appearance on television was on The Standard Deviants, a PBS show aimed at providing educational DVDs and programming for schools. He played a knight and a dinosaur detective. Proficient in every medium of comedy (he considers even 'acting' simply another medium of comedy) he is also a Voice Over Artist, having worked for Old Style, Mucinex, Cars.com among other brands as well as in feature films & animated television shows. In 2011 he produced a 42 track E.P. entitled \"The Extended Play E.P.\" with Comedy Central Records, a Folk/Pop/Hip Hop concept album, which he describes as satirical; aimed at celebrities that cross over into other mediums they have no business being in simply because of their brand name (he also considers himself \"a proponent of the semicolon, \"it is underused and feared for no particular reason\"). He then remixed this album with Illegal Art, a legitimate music label, enlisting the roster of artists on the label (including the godfather of sampling, \"Steinski\") the same year. According to him, this was to prove that the album, when given to actual musicians, became superior to the original, in addition to satirizing artists that remix one song and sell it to listeners multiple times. He considers his greatest performance to be his portrayal of Ranger Jones, in Yogi Bear 3D, which filmed in New Zealand and wrapped shortly before his seizure that led to the discovery of an AVM (which he alleges confirmed rather than initiated his Absurdist Philosophy). He has stated multiple times that it was the pinnacle of his artistic career, and that \"it's in some ways comforting to have reached the pinnacle of his career so early on\" and that is has been all downhill since that point. Aside from being a major proponent of Denver, his hometown, he has done extensive charity work and continues to visit East High School, where he did his first stand-up performance in drama class. He credits his teacher, Melody Duggan, for much of his success and thanked her specifically in his speech when he won a Critic's Choice Award for best supporting actor in a comedy series (For HBO's Silicon Valley). He frequently cites his compulsive and almost pathologically driven work ethic as an altruistic effort to distract people from the tragedy that permeates everyday life, and believed that comedy would be more of a contribution than psychology, since instead of affecting only at most a few hundred people dramatically, he can affect millions of people in small increments. He has publicly stated he believes \"Comedians are the new philosophers\" and that academic philosophers are no longer relevant. However, he is a student of philosophy and subscribes to the ethical philosophy of John Stuart Mill (Utilitarianism), which states that one should make the most amount happiness for the most amount of people, which he cites as one of the reasons he made the his decision to be a comedian. His stand-up (as of 2015) is aimed at \"discussing Time and the release of the death anxiety.\" By the age of 33 he had read all of Nietzsche's works, and considers himself an Absurdist with philosophical roots in Nihilism. He resides in Los Angeles, where he struggles to make meaning in an uncertain world.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMzI0NTEwMF5BMl5BanBnXkFtZTcwMjk4MDkxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2554352","name":"T.J. Miller","idIMDB":"nm2554352"},"actorId":"nm2554352","character":"Tuffnut","urlCharacter":"http://www.imdb.com/character/ch0182921","main":true},{"actorName":"Kristen Wiig","urlProfile":"http://www.imdb.com/name/nm1325419","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MTA0MDA5NF5BMl5BanBnXkFtZTgwODMyMjA1NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 August 1973","placeOfBirth":" Canandaigua, New York, USA","birthName":"Kristen Carroll Wiig","height":"5' 5\" (1.65 m)","bio":"Kristen Carroll Wiig was born on August 22, 1973 in Canandaigua, New York, to Laurie J. (Johnston), an artist, and Jon J. Wiig, a lake marina manager. She is of Norwegian (from her paternal grandfather), Irish, English, and Scottish descent. The family moved to Lancaster, Pennsylvania, before settling in Rochester, New York. When Wiig was 9 years old, her parents divorced and she lived with her mother and older brother Erik. After graduating from Brighton High School in Rochester, Wiig attended the University of Arizona as an art student. She took her first acting class, as an elective, and was soon encouraged by her teacher to pursue acting. Years later, she moved to Los Angeles and Wiig worked as a main company member of the Los Angeles-based improv and sketch-comedy troupe The Groundlings. As a Groundlings alumna, she joins the ranks of such SNL cast mates as Maya Rudolph, Will Ferrell, Phil Hartman, and Jon Lovitz. Wiig made her big-screen debut to universal high praise as Katherine Heigl's passive-aggressive boss in Judd Apatow's smash-hit comedy Knocked Up (2007). Additional film credits include Drew Barrymore's directorial debut, Whip It (2009), starring Ellen Page; Greg Mottola's Adventureland (2009), with Ryan Reynolds, Kristen Stewart and Jesse Eisenberg; David Koepp's Ghost Town (2008), with Ricky Gervais; and Jake Kasdan's Walk Hard: The Dewey Cox Story (2007), another Apatow-produced film, in which she starred opposite John C. Reilly. She has also guest-starred on the Emmy-winning NBC series 30 Rock (2006), the HBO series Bored to Death (2009), with Jason Schwartzman, and Flight of the Conchords (2007). Wiig joined the cast of Saturday Night Live (1975) in 2008, and was known for playing such memorable characters as the excitable Target clerk, Lawrence Welk singer Doonese, the hilarious one-upper Penelope, House Speaker Nancy Pelosi, and Suze Orman, among others. Wiig earned two Emmy nominations for Outstanding Supporting Actress in a Comedy Series for her work on the show. She left the show in the spring of 2012. In 2011, Wiig co-wrote and starred in Bridesmaids (2011), along with Melissa McCarthy, Maya Rudolph, and Rose Byrne. The film was a box office hit and won several awards, plus earned two Oscar nominations (Best Supporting Actress and Best Original Screenplay), and two Golden Globes nominations (Best Motion Picture - Comedy or Musical and Best Actress). Wiig also appeared in such notable films as Greg Mottola's Paul (2011), opposite Simon Pegg and Nick Frost; Andrew Jarecki's All Good Things (2010), opposite Ryan Gosling, Kirsten Dunst and Frank Langella; DreamWorks Animation's How to Train Your Dragon (2010), with Gerard Butler and Jay Baruchel; the Universal Pictures' animated feature film Despicable Me (2010), starring Steve Carell and Jason Segel; and Jennifer Westfeldt's Friends with Kids (2011), opposite Jon Hamm, Megan Fox, Adam Scott, Maya Rudolph and Westfeldt.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MTA0MDA5NF5BMl5BanBnXkFtZTgwODMyMjA1NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1325419","name":"Kristen Wiig","idIMDB":"nm1325419"},"actorId":"nm1325419","character":"Ruffnut","urlCharacter":"http://www.imdb.com/character/ch0182043","main":true},{"actorName":"Bridget Hoffman","urlProfile":"http://www.imdb.com/name/nm0033977","urlPhoto":"","biography":{"dateOfBirth":"5 March 1962","placeOfBirth":" Los Angeles, California, USA","birthName":"Bridget Ellen Hoffman","bio":"Bridget Hoffman was born on March 5, 1962 in Los Angeles, California, USA as Bridget Ellen Hoffman. She is known for her work on Frozen (2013), Tangled (2010) and Big Hero 6 (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0033977","name":"Bridget Hoffman","idIMDB":"nm0033977"},"actorId":"nm0033977","character":"Female Viking","urlCharacter":"http://www.imdb.com/character/ch0318533","main":true},{"actorName":"Peter Lavin","urlProfile":"http://www.imdb.com/name/nm0492092","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NTgyODc2Nl5BMl5BanBnXkFtZTcwNzgxNTYzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Peter Lavin is known for his work on Mr. & Mrs. Smith (2005), Eragon (2006) and Beowulf (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NTgyODc2Nl5BMl5BanBnXkFtZTcwNzgxNTYzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0492092","name":"Peter Lavin","idIMDB":"nm0492092"},"actorId":"nm0492092","character":"Viking 1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Neil Dickson","urlProfile":"http://www.imdb.com/name/nm0225698","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NjQxMTU4M15BMl5BanBnXkFtZTgwOTI1NzQzMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Dickson has balanced a career on stage and film since graduating from the Guildhall School of Music and Drama in his native England. After several seasons in repertory throughout the UK, Dickson made his West End debut in London under the direction Sir John Gielgud and opposite Dame Judi Dench and Daniel Massey in \"The Gay Lord Quex\". He then created the role of Dean Rebel in the Mermaid Theatre production of \"Trafford Tanzi\", which brought him to the attention of the producers of NBC's 12-hour mini-series \"Anno Domini (A.D.)\" where he co-starred opposite Ian McShane, Susan Sarandon, James Mason and Ava Gardner. This led to Dickson playing the title role of James Bigglesworth in the Royal Premiere Film of \"Biggles: Adventures in Time\". Continuing to star in features and MOWs, Dickson finally arrived in America to star in the Universal TV series \"She Wolf of London\". Since then he has been seen in David Lynch's \"Inland Empire\", \"Time Cop2\", \"Lost Lake\", \"Romy and Michelle's High School Reunion\" and such TV series as \"Chuck\", \"Alias\", and \"Sliders\". His voice can be heard on numerous animated series including \"Rugrats\", \"The Wild Thornberries\", \"Gargoyles\", \"Johnny Quest\" and \"Iron Man\" as well as feature films including \"Body of Lies\", \"Beowulf\", \"Aragon\" and \"Pirates of the Carribean\". He has also been the voice of \"Jaguar\" motor cars, Propel water and Delphi among others. Dickson and his wife Lynda live in Los Angeles with their two daughters. He recently triumphed on stage as Stephen Wyatt's \"The Standard Bearer\", directed by Julian Sands both in London and Los Angeles. Neil Dickson plays the eponymous role in the continuing web series \"Atwill\". The pilot episode won the first Samuel Fuller Guerilla Filmmaker Award at the 2011 Buffalo International Film Festival. Prior to that he starred in the film, \"Chasing Chekov\", which won the BAFTA/LA Best Film Award. He had earlier played the role on stage in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NjQxMTU4M15BMl5BanBnXkFtZTgwOTI1NzQzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0225698","name":"Neil Dickson","idIMDB":"nm0225698"},"actorId":"nm0225698","character":"Viking 2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ian Ruskin","urlProfile":"http://www.imdb.com/name/nm0750823","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE3MDcwNTAwN15BMl5BanBnXkFtZTgwOTE1NzQ5OTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"bio":"Ian Ruskin is a graduate of The Royal Academy of Dramatic Art in London. In England, he worked in Repertory Theater and London's West End where work included the title role in Jack the Ripper, television including King Lear (1983) with Lawrence Olivier, and Michael Mann The Keep (1983). In Los Angeles, his work has ranged from Murder She Wrote's Murder, She Wrote: Dead Man's Gold (1986) , to the acclaimed one-man play, Alan Drury's The Man Himself. He has also done extensive voice work in radio, commercials, and in over 100 films and television programs. Ian founded The Harry Bridges Project in 2000 and has written, performed and produced many plays, radio, and film documentaries. Those include From Wharf Rats to Lords of the Docks (2007) about labor leader Harry Bridges, and most recently To Begin the World Over Again: The Life of Thomas Paine (2016)for airing on public television in the 2016 Presidential election year distributed by NETA. The film versions of the Bridges and Paine plays were directed and shot by multi-Academy Award winner Haskell Wexler. Ian has performed each play hundreds of times to close to 100,000 people, including the Houses of Parliament, the Scottish Parliament, ACLU, The American Philosophical Society, Harvard Law School, the California Judges Association, Conway Hall in London, the Annual Meeting of the Organization of American Historians, and in Canada, Hawai'i, Australia, and England. To Begin the World Over Again: The Life of Thomas Paine (2016) continues Ian's mission to present the stories of forgotten and misunderstood heroes from American and European history. He is also working on having the film distributed in England, France, Canada and Australia. Paine was, after all, a citizen of the world. In 2014 Ian completed a new radio documentary A Wild Woman Sings the Blues about the life and work of Barbara Dane, and is also working on a treatment for a feature film based on the 1934 San Francisco General Strike. Ian has begun work on his next project, to write a new one-man play about \"the man who invented the 20th century\" Nikola Tesla. When not running the Harry Bridges Project or writing and performing new plays, Ian Ruskin is a voice over actor in Los Angeles, CA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE3MDcwNTAwN15BMl5BanBnXkFtZTgwOTE1NzQ5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0750823","name":"Ian Ruskin","idIMDB":"nm0750823"},"actorId":"nm0750823","character":"Viking 3","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julian Barnes","urlProfile":"http://www.imdb.com/name/nm0055657","urlPhoto":"","biography":{"dateOfBirth":"8 November 1949","placeOfBirth":" London, England, UK","birthName":"Julian Patrick Barnes","bio":"Julian Barnes was born on November 8, 1949 in London, England as Julian Patrick Barnes. He is known for his work on Pacific Rim (2013), Eragon (2006) and Mars Attacks! (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0055657","name":"Julian Barnes","idIMDB":"nm0055657"},"actorId":"nm0055657","character":"Viking 4","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2065968","urlIMDB":"http://www.imdb.com/title/tt2065968","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["22 min"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.7","filmingLocations":[],"awards":[{"award":"Annie Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Annie","categories":[{"category":"Best Animated Special Production","names":[]}]}]},{"award":"Motion Picture Sound Editors, USA 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing - Direct to Video - Animation","names":[{"name":"Jonathan Null","id":"nm0637871","role":"supervising sound editor"},{"name":"Al Nelson","id":"nm0625131","role":"sound designer"},{"name":"Chris Gridley","id":"nm1017060","role":"supervising dialogue editor"},{"name":"Adam Milo Smalley","id":"nm0806551","role":"music editor"},{"name":"Jana Vance","id":"nm0888527","role":"foley artist"},{"name":"Dennie Thorpe","id":"nm0861658","role":"foley artist"},{"name":"Josh Gold","id":"nm2236268","role":"sound effects editor"},{"name":"Colette D. Dahanne","id":"nm1584690","role":"sound effects editor"},{"name":"Frank Clary","id":"nm1826189","role":"sound effects editor"}]}]}]}],"votes":"4,732","type":"Video","companyCreditsSimple":[{"idCompany":"co0129164","name":"DreamWorks Animation"}],"keywords":{"keywords":["dragon","viking","island","village","cgi animation","dragon egg","newborn","party","no title at beginning","giant creature","human animal relationship","best friend","artificial leg","teenage girl","teenage boy","teenage hero","sheep","explosion","egg","father son relationship","viking dragon ship","helmet","computer animation","reptile","baby","female warrior","exploding building","fish","flying","ship","flight","friendship","christmas","holiday special","migration","christmas special"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:16:16"}}