{"data":{"movies":[{"title":"The Gambler","originalTitle":"","year":"2014","releaseDate":"20141225","directors":[{"name":"Rupert Wyatt","id":"nm1012501"}],"writers":[{"name":"William Monahan","id":"nm1184258"},{"name":"James Toback","id":"nm0864812"}],"runtime":"111 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MjIzODE3N15BMl5BanBnXkFtZTgwNzUwNzYwMzE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Thriller"],"plot":"Jim Bennett is a risk taker. Both an English professor and a high-stakes gambler, Bennett bets it all when he borrows from a gangster and offers his own life as collateral. Always one step ahead, Bennett pits his creditor against the operator of a gambling ring and leaves his dysfunctional relationship with his wealthy mother in his wake. He plays both sides, immersing himself in an illicit, underground world while garnering the attention of Frank, a loan shark with a paternal interest in Bennett's future. As his relationship with a student deepens, Bennett must take the ultimate risk for a second chance...","simplePlot":"Lit professor and gambler Jim Bennett's debt causes him to borrow money from his mother and a loan shark. Further complicating his situation is his relationship with one of his students. Will Bennett risk his life for a second chance?","actors":[{"actorName":"Mark Wahlberg","urlProfile":"http://www.imdb.com/name/nm0000242","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MjYwNTE2M15BMl5BanBnXkFtZTYwNTI0NjI1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 June 1971","placeOfBirth":" Dorchester, Boston, Massachusetts, USA","birthName":"Mark Robert Michael Wahlberg","height":"5' 8\" (1.73 m)","bio":"American actor Mark Wahlberg is one of a handful of respected entertainers who successfully made the transition from teen pop idol to acclaimed actor. A Best Supporting Actor Oscar nominee for The Departed (2006) who went on to receive positive critical reviews for his performance in The Fighter (2010), Wahlberg also is a solid comedy actor, proven by his starring role in Ted (2012). Mark Robert Michael Wahlberg was born June 5, 1971 in a poor working class district, Dorchester, of Boston, Massachusetts. He is the son of Alma Elaine (Donnelly), a nurse's aide and clerk, and Donald Edward Wahlberg, a delivery driver. Wahlberg is the youngest of nine children. He is of Irish, Swedish (from his paternal grandfather), and more distant French-Canadian, English, and Scottish, descent. The large Wahlberg brood didn't have a lot growing up, especially after his parents divorced when he was eleven. The kids crammed into a three bedroom apartment, none of them having very much privacy. Mark's mother has said that after the divorce, she became very self-absorbed with her own problems. She has blamed herself for her son's subsequent problems and delinquency. Wahlberg dropped out of high school at age 14 (but later got his GED) to pursue a life of petty crime and drugs. He'd spend his days scamming and stealing, working on the odd drug deal before treating himself to the substances himself. The young man also had a violent streak - one which was often aimed at minorities. At age sixteen, he was convicted of assault against two Vietnamese men after he had tried to rob them. As a result of his assault conviction, he was sentenced to serve 50 days in prison at Deer Island penitentiary. Whilst there, he began working out to pass time and, when he emerged at the end of his sentence, he had gone from being a scrawny young kid to a buff young man. Wahlberg also credits jail time as being his motivation to improve his lifestyle and leave crime behind him. Around this time, his older brother Donnie Wahlberg had become an overnight teen idol as a member of the 1980s boy band New Kids on the Block. A precursor to the boy-band craze, the group was dominating the charts and were on top of their game. Mark himself had been an original member of the band but had backed out early on - uncomfortable with the squeaky clean image of the group. Donnie used his connections in the music business to help his little brother secure a recording contract, and soon the world was introduced to Marky Mark and the Funky Bunch, with Wahlberg as a bad-boy rapper who danced in his boxers. Despite a lack of singing ability, promoters took to his dance moves and a physique they knew teenage girls would love. Donnie scripted some easy songs for Mark, who collected a troupe of dancers and a DJ to become his \"Funky Bunch\" and \"Marky Mark and the Funky Bunch\" was born. His debut album, \"Music for the People\", was a smash hit, which was propelled along by the rapper's willingness to disrobe down to boxer-briefs on stage, not to mention several catchy tunes. Teenage girls thrilled to the rapping \"bad boy\". Record producer David Geffen saw in Wahlberg a cash-cow of marketing ability. After speaking to designer Calvin Klein, Marky Mark was set up as the designer's chief underwear model. His scantily clad figure soon adorned billboards across the nation. Ironically, while the New Kids on the Block's fame was dwindling as audiences tired of their syrupy lyrics, \"Marky Mark's\" bad boy image was becoming even more of a commodity. He was constantly in the headlines (often of the tabloids) after multiple scandals. In 1992, he released a book dedicated to his penis. Wahlberg was constantly getting into rumored fights, most memorably with Madonna and her entourage at a Los Angeles party. While things were always intense, they were relatively harmless and made for enjoyable reading for the public. However, when the story of his arrest for assault (and the allegations of racism) broke in the press, things took on a decidedly darker note. People were not amused. Soon after, while on a British talk show along with rapper Shabba Ranks, he got into even more trouble. After Ranks made the statement that gays should be crucified, Wahlberg was accused of condoning the comments by his silence. Marky Mark was suddenly surrounded by charges of brutality, homophobia and racial hatred. His second album, \"You Gotta Believe\", had not been faring well and, after the charges surfaced, it plummeted from the charts. Adding to the hoopla, Wahlberg was brought to court for allegedly assaulting a security guard. He was ordered to make amends by appearing in a series of anti-bias advertisements. Humbled and humiliated by his fall from grace in the music world, Wahlberg decided to pursue another angle, acting. He dropped the \"Marky Mark\" moniker and became known simply as Mark Wahlberg. His first big screen role came in Penny Marshall's Renaissance Man (1994). Despite the name change, many people snickered at the idea of the has-been rapper thinking he could make it as an actor. From the get-go, he was proving them wrong. In Renaissance Man (1994), he gave an utterly charming performance as a simple but sincere army recruit. What naysayers remained found it increasingly difficult to write Mark Wahlberg off as he delivered one fine performance after another. He blew them away in the controversial The Basketball Diaries (1995) and chilled them in Fear (1996) as every father's worst nightmare. The major turning point in Wahlberg's career came with the role of troubled porn star Dirk Diggler in Paul Thomas Anderson's Boogie Nights (1997). Since then, Wahlberg has chosen roles that demonstrate a wide range of dramatic ability, starring in critically acclaimed dramas such as Three Kings (1999) and The Perfect Storm (2000), popcorn flicks like Planet of the Apes (2001) and Contraband (2012), and even indies such as I Heart Huckabees (2004). Wahlberg was the executive producer of such television series as Boardwalk Empire (2010), In Treatment (2008) and the highly successful comedy Entourage (2004), which was partly based on his experiences in Hollywood. Wahlberg and his wife Rhea Durham have four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MjYwNTE2M15BMl5BanBnXkFtZTYwNTI0NjI1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000242","name":"Mark Wahlberg","nicknames":["Marky Mark","Monk D"],"idIMDB":"nm0000242"},"actorId":"nm0000242","character":"Jim Bennett","urlCharacter":"http://www.imdb.com/character/ch0474631","main":true},{"actorName":"George Kennedy","urlProfile":"http://www.imdb.com/name/nm0001421","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMTk0MDg5N15BMl5BanBnXkFtZTYwOTAzNTc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 February 1925","placeOfBirth":" New York City, New York, USA","birthName":"George Harris Kennedy Jr.","height":"6' 4\" (1.93 m)","bio":"George Harris Kennedy, Jr. was born on February 18, 1925 in New York City, to Helen A. (Kieselbach), a ballet dancer, and George Harris Kennedy, an orchestra leader and musician. Following high school graduation, Kennedy enlisted in the United States Army in 1943 with the hope to become a fighter pilot in the Army Air Corps. Instead, he wound up in the infantry, served under General George S. Patton and distinguished himself with valor. He won two Bronze Stars and four rows of combat and service ribbons. A World War II veteran, Kennedy at one stage in his career cornered the market at playing tough, no-nonsense characters who were either quite crooked or possessed hearts of gold. Kennedy notched up an impressive 200+ appearances in both television and films, and was well respected within the Hollywood community. He started out on television Westerns in the late 1950s and early 1960s (Have Gun - Will Travel (1957), Rawhide (1959), Maverick (1957), Colt .45 (1957), among others) before scoring minor roles in films including Lonely Are the Brave (1962), The Sons of Katie Elder (1965) and The Flight of the Phoenix (1965). The late 1960s was a very busy period for Kennedy, and he was strongly in favor with casting agents, appearing in Hurry Sundown (1967), The Dirty Dozen (1967) and scoring an Oscar win as Best Supporting Actor for his performance in Cool Hand Luke (1967). The disaster film boom of the 1970s was also kind to Kennedy and his talents were in demand for Airport (1970) and the three subsequent sequels, as a grizzled police officer in Earthquake (1974), plus the buddy/road film Thunderbolt and Lightfoot (1974) as vicious bank robber Red Leary. The 1980s saw Kennedy appear in a mishmash of roles, playing various characters; however, Kennedy and Leslie Nielsen surprised everyone with their comedic talents in the hugely successful The Naked Gun: From the Files of Police Squad! (1988), and the two screen veterans exaggerate themselves again, in The Naked Gun 2½: The Smell of Fear (1991) and Naked Gun 33 1/3: The Final Insult (1994). From 1988-1991, he also played Ewing family nemesis Carter McKay on the CBS prime-time soap opera Dallas (1978). Kennedy also played President Warren G. Harding in the miniseries Backstairs at the White House (1979) and had a long standing role on the CBS daytime soap opera The Young and the Restless (1973). He remained busy in Hollywood and lent his distinctive voice to the animated Cats Don't Dance (1997) and the children's action film Small Soldiers (1998). A Hollywood stalwart for nearly 50 years, he is one of the most enjoyable actors to watch on screen. His last role was in the film The Gambler (2014), as Mark Wahlberg's character's grandfather. George Kennedy died of natural causes in Middleton, Idaho on February 28, 2016, only ten days after his 91st birthday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMTk0MDg5N15BMl5BanBnXkFtZTYwOTAzNTc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001421","name":"George Kennedy","idIMDB":"nm0001421"},"actorId":"nm0001421","character":"Ed","urlCharacter":"http://www.imdb.com/character/ch0533082","main":true},{"actorName":"Griffin Cleveland","urlProfile":"http://www.imdb.com/name/nm2743940","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5Mjk0MjM4MV5BMl5BanBnXkFtZTgwMTkzNzM5ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Griffin Barrett Cleveland","height":"5' 9\" (1.75 m)","bio":"Griffin Cleveland was born as Griffin Barrett Cleveland. He is an actor, known for The Gambler (2014), Time Toys (2016) and The Walking Dead: Webisodes (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5Mjk0MjM4MV5BMl5BanBnXkFtZTgwMTkzNzM5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2743940","name":"Griffin Cleveland","idIMDB":"nm2743940"},"actorId":"nm2743940","character":"Young Jim","urlCharacter":"http://www.imdb.com/character/ch0474631","main":true},{"actorName":"Jessica Lange","urlProfile":"http://www.imdb.com/name/nm0001448","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg5ODIyMjY0NF5BMl5BanBnXkFtZTcwNDcyNjY0MQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1949","placeOfBirth":" Cloquet, Minnesota, USA","birthName":"Jessica Phyllis Lange","height":"5' 8\" (1.73 m)","bio":"Jessica Phyllis Lange was born 1949 in Cloquet, Minnesota, to Dorothy Florence (Sahlman) and Albert John Lange, a traveling salesman and teacher. She is of Finnish (mother) and Dutch and German (father) descent. She obtained a scholarship to study art at the University of Minnesota, but instead went to Paris to study drama. She moved to New York City, working as a model for many years, until producer Dino De Laurentiis cast her as the female lead in King Kong (1976). The film attracted much unfavorable comment and, as a result, Lange was off the screen for three years. She was given a small but showy part in Bob Fosse's All That Jazz (1979), before giving a memorable performance in Bob Rafelson's The Postman Always Rings Twice (1981), as an adulterous waitress. The following year, she won rave reviews for her exceptional portrayal of actress Frances Farmer in Frances (1982) and a Best Supporting Actress Academy Award for her work in Sydney Pollack's Tootsie (1982) (as a beautiful soap-opera actress). She was also outstanding as country singer Patsy Cline in Karel Reisz's Sweet Dreams (1985) and as a lawyer who defends her father and discovers his past in Music Box (1989). Other important films include Martin Scorsese's Cape Fear (1991) (as a frightened housewife) and Tony Richardson's Blue Sky (1994), for which she won a Best Actress Academy Award as the mentally unbalanced wife of a military officer. She made her Broadway debut in 1992, playing \"Blanche\" in Tennessee Williams \"A Streetcar Named Desire\". In addition to acting, Lange is a photographer with two published works,and is a humanitarian, holding a position as a Goodwill Ambassador for UNICEF, specializing in the HIV/AIDS epidemic in the Congo and Russia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg5ODIyMjY0NF5BMl5BanBnXkFtZTcwNDcyNjY0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001448","name":"Jessica Lange","nicknames":["Jessie"],"idIMDB":"nm0001448"},"actorId":"nm0001448","character":"Roberta","urlCharacter":"http://www.imdb.com/character/ch0415435","main":true},{"actorName":"Omar Leyva","urlProfile":"http://www.imdb.com/name/nm2077552","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNjI4MDgwNF5BMl5BanBnXkFtZTgwMjkwNTI2NTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Omar Leyva is a bilingual Mexican American Actor living in Los Angeles, CA. He was born in Mexico City and was raised by his grandmother in a small village in the state of Puebla until moving to Los Angeles at the age of 8. He discovered poetry as a teen and then acting during his last years at Santa Monica High School under the mentorship of Dr. Frank X. Ford. Leyva would later pay his dues in college and community stages while taking on roles like Shakespeare's Othello, various musical theater characters, and has continued to take on bilingual classical and original plays. The versatile actor also worked his way up in film; starting with student projects and then on short and independent films. In 2006 he began his professional career and has appeared on shows like Ray Donovan, Community, The Mentalist, Hart of Dixie, Criminal Minds, 24, Entourage, Heroes, CSI, and many more. Some of the actor's film credits include McFarland USA, Mosquita Y Mari, Go For Sisters, Weather Girl, Ilegal, and Beverly Hills Chihuahua. Always looking to expand his range as a character actor, Leyva has added improv training to his foundation in various acting styles. He is comfortable being vulnerable or threatening and can handle drama or comedy and everything in between. He has been a creative consultant on films, plays, corporate projects and is also hoping to expand into production and a long awaited return to his roots in writing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNjI4MDgwNF5BMl5BanBnXkFtZTgwMjkwNTI2NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2077552","name":"Omar Leyva","idIMDB":"nm2077552"},"actorId":"nm2077552","character":"Valet","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve Park","urlProfile":"http://www.imdb.com/name/nm0661950","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWI5ZWVjYzItMWNlNC00ZTIzLWJmOGItNmQ1NTFiY2QzZDBhXkEyXkFqcGdeQXVyMDcyMjk0MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Steve Park is an actor, known for Fargo (1996), Snowpiercer - le transperceneige (2013) and Chute libre (1993). He is married to Kelly Coffield Park.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWI5ZWVjYzItMWNlNC00ZTIzLWJmOGItNmQ1NTFiY2QzZDBhXkEyXkFqcGdeQXVyMDcyMjk0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0661950","name":"Steve Park","idIMDB":"nm0661950"},"actorId":"nm0661950","character":"Number 2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brie Larson","urlProfile":"http://www.imdb.com/name/nm0488953","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4MzAxOTI5NV5BMl5BanBnXkFtZTgwMzMzNTA4NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1989","placeOfBirth":" Sacramento, California, USA","birthName":"Brianne Sidonie Desaulniers","height":"5' 7\" (1.7 m)","bio":"Brie Larson has built an impressive career as an acclaimed television actress, rising feature film star and emerging recording artist. A native of Sacramento, Brie started studying drama at the early age of 6, as the youngest student ever to attend the American Conservatory Theater in San Francisco. She starred in one of Disney Channel's most watched original movies, Right on Track (2003), as well as the WB's Raising Dad (2001) and MGM's teen comedy Sleepover (2004) - all before graduating from middle school. Brie's work includes the coming-of-age drama Tanner Hall (2009) and the dark comedy, Just Peck (2009), with Marcia Cross and Keir Gilchrist. She earned critical praise for her role in the independent feature, Remember the Daze (2007) (aka \"The Beautiful Ordinary\"), singled out by Variety as the \"scene stealer\" of the film, opposite Amber Heard and Leighton Meester. Brie garnered considerable acclaim for her series regular role of \"Kate\", Toni Collette's sarcastic and rebellious daughter, in Showtime's breakout drama United States of Tara (2009), created by Academy Award-winning writer Diablo Cody and based on an original idea by Steven Spielberg. She starred in The Trouble with Bliss (2011) opposite Michael C. Hall, playing a young girl out to seduce him while, in turn, teaching him more about his own life. She also starred in Universal's Scott Pilgrim vs. the World (2010) and Noah Baumbach's Greenberg (2010). In Scott Pilgrim vs. the World (2010), Brie played rock star \"Envy Adams\", former flame of Michael Cera, and in Greenberg (2010), she starred as a young temptress trying to flirt with Ben Stiller, a New Yorker traveling West to try to figure out his life. In addition to her talents as an actress, Brie has simultaneously nurtured an ever-growing musical career. At 13, Brie landed her first record deal at Universal Records with Tommy Mottola, who signed her sight-unseen. Her first release in 2005 led to a nationwide tour.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4MzAxOTI5NV5BMl5BanBnXkFtZTgwMzMzNTA4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0488953","name":"Brie Larson","idIMDB":"nm0488953"},"actorId":"nm0488953","character":"Amy Phillips","urlCharacter":"http://www.imdb.com/character/ch0465407","main":true},{"actorName":"Chil Kong","urlProfile":"http://www.imdb.com/name/nm6996459","urlPhoto":"","biography":{"bio":"Chil Kong is an actor, known for The Gambler (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6996459","name":"Chil Kong","idIMDB":"nm6996459"},"actorId":"nm6996459","character":"Blackjack Dealer #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Kenneth Williams","urlProfile":"http://www.imdb.com/name/nm0931324","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNTg2NjA1Nl5BMl5BanBnXkFtZTcwMjQ4NzY5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1966","placeOfBirth":" Flatbush, Brooklyn, New York City, New York, USA","birthName":"Michael Kenneth Williams","height":"5' 10\" (1.78 m)","bio":"Born in Brooklyn, to an African American father from South Carolina and a Bahamian mother from Nassau, Michael K. Williams was raised in the Vandaveer housing projects in East Flatbush, Brooklyn, New York City and attended George Westinghouse Career and Technical Education High School. According to a DNA analysis, he is descended partly from the Mende people of Sierra Leone. After getting in some trouble as a youth, he enrolled at the National Black Theatre in New York City. He later got a job at a pharmaceutical company. Inspired by Janet Jackson's Rhythm Nation 1814, he left school and quit his job, against the wishes of his family, to pursue a career as a dancer. During a year in which he was intermittently homeless, Williams visited record labels and dance studios looking for work. He got a job as a background dancer on a music tour for Akym Sims' dance anthem Too Blind To See It, which led to more work appearing as a dancer in videos and on tours, such as with George Michael, Madonna, as well as some modelling work. He also choreographed Crystal Waters' 1994 single \"100% Pure Love\". He is an established actor and producer, perhaps best-known for his role on the highly-acclaimed HBO Television series The Wire (2002) where he played Omar Little. Other notable works he performed in have included The Road (2009) Boardwalk Empire (2010), 12 Years a Slave (2013) and RoboCop (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNTg2NjA1Nl5BMl5BanBnXkFtZTcwMjQ4NzY5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0931324","name":"Michael Kenneth Williams","idIMDB":"nm0931324"},"actorId":"nm0931324","character":"Neville Baraka","urlCharacter":"http://www.imdb.com/character/ch0474633","main":true},{"actorName":"Da'Vone McDonald","urlProfile":"http://www.imdb.com/name/nm1229681","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MzY0Mjc0NV5BMl5BanBnXkFtZTcwNzU4Mjg2MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Da'Vone McDonald is an actor, known for Forgetting Sarah Marshall (2008), Get Him to the Greek (2010) and The Gambler (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5MzY0Mjc0NV5BMl5BanBnXkFtZTcwNzU4Mjg2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1229681","name":"Da'Vone McDonald","idIMDB":"nm1229681"},"actorId":"nm1229681","character":"Neville's Muscle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amin Joseph","urlProfile":"http://www.imdb.com/name/nm1514763","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NjkxMDQ3NF5BMl5BanBnXkFtZTgwNjE1NjEwMDI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"birthName":"Amin Joseph","height":"6' 0½\" (1.84 m)","bio":"Amin Joseph's star is on the rise and he is continuing to make his mark in Hollywood. He will be seen on the big screen in Paramount's highly anticipated blockbuster film reboot of Baywatch with Dwayne Johnson, Zac Efron and Priyanka Chopra this spring. He will immediately follow this with a major role in FX's upcoming television series Snowfall. The hour-long drama, executive produced by John Singleton, is set in Los Angeles in the 1980s and covers the early days of the crack cocaine epidemic. The show is slated for a summer 2017 premiere. Joseph has been featured in many major films including The Expendables and Homefront, both Lionsgate action hits written by Sylvester Stallone; G.I. Joe: Retaliation with Bruce Willis and Dwayne Johnson; the film festival darling DOPE, which premiered at the Sundance Film Festival in competition and went on to screen at the Cannes Film Festival and Deauville American Film Festival in 2015; THE Gambler with Mark Wahlberg; and Frank Darabont's 2007 horror film, The Mist, based on the story by Stephen King, among many others. In 2004, he made his small screen debut in the action drama Rage and Discipline and his career took off from there, with over five dozen film and television credits in just twelve years. He reunited with Darabont for both FX's hit series The Shield as well as a recurring role on TNT's L.A Noir. He also starred in two Cinemax series, Zane's Sex Chronicles and Zane's The Jumpoff, both written by New York Times bestselling author Zane. His additional TV credits include appearances on major shows such as Sons of Anarchy, Southland, N.C.I.S. and CSI: Miami, among others. His production company, Dark Energy Pictures, specializes in action, horror, and Sci-fi content spanning digital, television, and feature films. The company's recent film Call Me King, an international action thriller, embodies their focus on multicultural, lingual, and ethnic content. His charitable work includes time with the grassroots organization The Awareness Movement in Los Angeles. The organization focuses on creating content in order to facilitate a positive dialogue between local communities and law enforcement as well as giving a voice to disenfranchised voters in urban communities. He also volunteers with several schools throughout Los Angeles, providing scene study classes with a focus on African American classic playwrights. Joseph is a graduate of Howard University and a protege of the World Famous Apollo Theater in his hometown Harlem, NYC, where he interned during his youth. He resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NjkxMDQ3NF5BMl5BanBnXkFtZTgwNjE1NjEwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1514763","name":"Amin Joseph","nicknames":["Act","Amin Hotep"],"idIMDB":"nm1514763"},"actorId":"nm1514763","character":"Neville's Bookkeeper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cjon Saulsberry","urlProfile":"http://www.imdb.com/name/nm6303353","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMDEzMTU3MF5BMl5BanBnXkFtZTgwMjEyNzA0MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Cjon Saulsberry is an actor, known for The Gambler (2014), Key and Peele (2012) and D-Sides (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMDEzMTU3MF5BMl5BanBnXkFtZTgwMjEyNzA0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm6303353","name":"Cjon Saulsberry","idIMDB":"nm6303353"},"actorId":"nm6303353","character":"Neville's Posse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Teebone Mitchell","urlProfile":"http://www.imdb.com/name/nm1843748","urlPhoto":"","biography":{"height":"5' 10\" (1.78 m)","bio":"Teebone Mitchell is an actor, known for The Gambler (2014), Disfigured (2008) and Gone Girl (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1843748","name":"Teebone Mitchell","idIMDB":"nm1843748"},"actorId":"nm1843748","character":"Neville's Posse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jasmond Carroll","urlProfile":"http://www.imdb.com/name/nm6823435","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNTY1MTY3OV5BMl5BanBnXkFtZTgwMzc2MjMwNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jasmond Carroll is an actor and casting director, known for The Gambler (2014), Straight Outta Compton (2015) and The Machine Man (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6823435","name":"Jasmond Carroll","nicknames":["J-Hustle"],"idIMDB":"nm6823435"},"actorId":"nm6823435","character":"Neville's Posse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ria Wilkinson","urlProfile":"http://www.imdb.com/name/nm6996460","urlPhoto":"","biography":{"bio":"Ria Wilkinson is an actress, known for The Gambler (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6996460","name":"Ria Wilkinson","idIMDB":"nm6996460"},"actorId":"nm6996460","character":"Neville's Posse","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2039393","urlIMDB":"http://www.imdb.com/title/tt2039393","business":{"budget":{"money":"$25,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$33,631,221","country":"USA","day":"08","month":"02","year":"2015","remarks":""},{"money":"$33,542,093","country":"USA","day":"25","month":"01","year":"2015","remarks":""}],"weekendGross":[{"money":"$55,416","country":"USA","day":"08","month":"02","year":"2015","remarks":"103 Screens"},{"money":"$29,422","country":"USA","day":"25","month":"01","year":"2015","remarks":"69 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"20","month":"01","year":"2014","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 51 min (111 min)"],"soundMix":["Datasat","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa XT, Panavision C- and E-Series Lenses"],"laboratory":["EFilm (digital intermediate)"],"filmLength":null,"negativeFormat":["Codex ARRIRAW (2.8K)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Panavision (anamorphic) (source format)"],"printedFilmFormat":["35 mm","D-Cinema"]},"rating":"6.0","metascore":"55","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[{"award":"Black Reel Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Outstanding Supporting Actor, Motion Picture","names":[{"name":"Michael Kenneth Williams","id":"nm0931324","role":null}]}]}]},{"award":"California on Location Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won COLA","categories":[{"category":"Location Team of the Year - Studio Feature Film","names":[{"name":"Chris Baugh","id":"nm0002744","role":"location manager"},{"name":"Michael Betz","id":"nm1289661","role":"key assistant location manager"},{"name":"Justin Harrold","id":"nm2191446","role":"key assistant location manager"},{"name":"David Park","id":"nm1783966","role":"key assistant location manager"},{"name":"Michael Soleau","id":"nm0812886","role":"key assistant location manager"},{"name":"Keomanee Vilaythong","id":"nm2844444","role":"key assistant location manager"},{"name":"Sofia Ochoa","id":"nm6373837","role":"assistant location manager"}]}]}]},{"award":"Location Managers Guild Awards (LMGA) 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Outstanding Achievement Award","categories":[{"category":"Outstanding Locations in a Contemporary Film","names":[{"name":"Chris Baugh","id":"nm0002744","role":null}]}]}]}],"votes":"51,871","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"},{"idCompany":"co0049390","name":"Winkler Films"}],"keywords":{"keywords":["risk","professor","gambler","gangster","gambling","return","pride","chip","game","stake","loser","holding one's breath underwater","dog","facial cut","running","philosophy","flood","downpour","wind farm","time lapse photography","hundred dollar bill","slot machine","limousine","omega wristwatch","pole dancer","playing tennis","reference to machiavelli","reference to robert greene","playing roulette","cigar smoking","in debt","man eating a lollypop","playing blackjack","money counter","male in bathtub","woman slaps a man","los angeles california","pistol","deadline","bag of money","bank teller","bank","korean","threat","tied to a chair","beating","head butt","kicked in the stomach","kicked in the chest","punched in the face","blackjack","roulette","sauna","desert","teacher student relationship","reference to william shakespeare","basketball game","basketball player","wealth","tennis player","casino","death of grandfather","mother son relationship","underwater scene","young version of character","flashback","character repeating someone else's dialogue","bare chested male","strip club","university","college student","title at the end","scene during opening credits","remake","gambling debt","gambling addiction","two word title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:23:09"}}