{"data":{"movies":[{"title":"The Frozen Ground","originalTitle":"","year":"2013","releaseDate":"20130711","directors":[{"name":"Scott Walker","id":"nm1960428"}],"writers":[{"name":"Scott Walker","id":"nm1960428"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MjAyMjIxMl5BMl5BanBnXkFtZTcwNTQ1NDc2OQ@@._V1.jpg","countries":["USA"],"languages":["English","French"],"genres":["Crime","Drama","Mystery","Thriller"],"plot":"Alaska Trooper Jack Holcombe believes Robert Hansen is a serial killer who abducts young girls, tortures and sexually assaults them, then kills them. But Holcombe doesn't have enough evidence to get a search warrant for Hansen's premises. Holcombe knows that one victim, Cyndy Paulsen, somehow survived, so he decides to seek her help, but he finds that she's now a junkie with trust issues. Holcombe has to earn her trust; meanwhile, Hansen is still hunting and killing girls.","simplePlot":"An Alaska State Trooper partners with a young woman who escaped the clutches of serial killer Robert Hansen to bring the murderer to justice. Based on actual events.","actors":[{"actorName":"Nicolas Cage","urlProfile":"http://www.imdb.com/name/nm0000115","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMDM4Nzk2MV5BMl5BanBnXkFtZTcwNTcwNjExOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1964","placeOfBirth":" Long Beach, California, USA","birthName":"Nicholas Kim Coppola","height":"6' (1.83 m)","bio":"Nicolas Cage was born Nicolas Kim Coppola in Long Beach, California, the son of comparative literature professor August Coppola (whose brother is director Francis Ford Coppola) and dancer/choreographer Joy Vogelsang. He is of Italian (father) and Polish, German, and English (mother) descent. Cage changed his name early in his career to make his own reputation, succeeding brilliantly with a host of classic, quirky roles by the late 1980s. Initially studying theatre at Beverly Hills High School (though he dropped out at seventeen), he secured a bit part in Fast Times at Ridgemont High (1982) -- most of which was cut, dashing his hopes and leading to a job selling popcorn at the Fairfax Theater, thinking that would be the only route to a movie career. But a job reading lines with actors auditioning for uncle Francis' Rumble Fish (1983) landed him a role in that film, followed by the punk-rocker in Valley Girl (1983), which was released first and truly launched his career. His one-time passion for method acting reached a personal limit when he smashed a street-vendor's remote-control car to achieve the sense of rage needed for his gangster character in The Cotton Club (1984). In his early 20s, he dated Jenny Wright for two years and later linked to Uma Thurman. After a relationship of several years with Christina Fulton, a model, they split amicably and share custody of a son, Weston Cage (b.1992). In 2004, he married Alice Kim Cage, with whom he has a son.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMDM4Nzk2MV5BMl5BanBnXkFtZTcwNTcwNjExOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000115","name":"Nicolas Cage","nicknames":["Nick"],"idIMDB":"nm0000115"},"actorId":"nm0000115","character":"Jack Halcombe","urlCharacter":"http://www.imdb.com/character/ch0409787","main":true},{"actorName":"Vanessa Hudgens","urlProfile":"http://www.imdb.com/name/nm1227814","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NzA2NTMxNV5BMl5BanBnXkFtZTYwMjA1ODEy._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1988","placeOfBirth":" Salinas, California, USA","birthName":"Vanessa Anne Hudgens","height":"5' 1\" (1.55 m)","bio":"Vanessa Anne Hudgens was born in Salinas, California. Her family moved to San Diego, California whilst she was still a toddler. She has a younger sister, Stella Hudgens, who is also an actress. Her mother, Gina Hudgens (Guangco), an officer worker, is from the Philippines. Her father, Greg Hudgens, a firefighter, has Irish and Native American ancestry. Vanessa was interested in acting and singing at a young age, inspired by her grandparents who were musicians. At the age of 8, she started appearing in musical theatre. She fell deeper in love with the arts and began studying acting, singing, and dance more seriously with Jailyn Osborne. Vanessa very briefly attended Orange County High School of the Arts. After years of auditioning, she began seeing some success. This prompted her family to move to Los Angeles, California. She started homeschooling - so she missed out on the high school experience - and she finally landed her breakthrough role in High School Musical (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NzA2NTMxNV5BMl5BanBnXkFtZTYwMjA1ODEy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1227814","name":"Vanessa Hudgens","nicknames":["Nessa","V","Van","Baby V","Vanney"],"idIMDB":"nm1227814"},"actorId":"nm1227814","character":"Cindy Paulson","urlCharacter":"http://www.imdb.com/character/ch0398777","main":true},{"actorName":"John Cusack","urlProfile":"http://www.imdb.com/name/nm0000131","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MTAwMjYzNV5BMl5BanBnXkFtZTcwNjIxNTU1OA@@._V1._CR286,2,351,422_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1966","placeOfBirth":" Evanston, Illinois, USA","birthName":"John Paul Cusack","height":"6' 2½\" (1.89 m)","bio":"John Cusack is, like most of his characters, an unconventional hero. Wary of fame and repelled by formulaic Hollywood fare, he has built a successful career playing underdogs and odd men out--all the while avoiding the media spotlight. John was born in Evanston, Illinois, to an Irish-American family. With the exception of mom Nancy (née Carolan), a former math teacher, the Cusack clan is all show business: father Dick Cusack was an actor and filmmaker, and John's siblings Joan Cusack, Ann Cusack, Bill Cusack and Susie Cusack are all thespians by trade. Like his brother and sisters, John became a member of Chicago's Piven Theatre Workshop while he was still in elementary school. By age 12, he already had several stage productions, commercial voice overs and industrial films under his belt. He made his feature film debut at 17, acting alongside Rob Lowe and Andrew McCarthy in the romantic comedy Class (1983). His next role, as a member of Anthony Michael Hall's geek brigade in Sixteen Candles (1984), put him on track to becoming a teen-flick fixture. Cusack remained on the periphery of the Brat Pack, sidestepping the meteoric rise and fall of most of his contemporaries, but he stayed busy with leads in films like The Sure Thing (1985) and Better Off Dead... (1985). Young Cusack is probably best remembered for what could be considered his last adolescent role: the stereo-blaring romantic Lloyd Dobler in Say Anything... (1989). A year later, he hit theaters as a grown-up, playing a bush-league con man caught between his manipulative mother and headstrong girlfriend in The Grifters (1990). The next few years were relatively quiet for the actor, but he filled in the gaps with off-screen projects. He directed and produced several shows for the Chicago-based theater group The New Criminals, which he founded in 1988 (modeling it after Tim Robbins' Actors' Gang in Los Angeles) to promote political and avant-garde stage work. Four years later, Cusack's high school friends Steve Pink and D.V. DeVincentis joined him in starting a sister company for film, New Crime Productions. New Crime's first feature was the sharply written comedy Grosse Pointe Blank (1997), which touched off a career renaissance for Cusack. In addition to co-scripting, he starred as a world-weary hit man who goes home for his ten-year high school reunion and tries to rekindle a romance with the girl he stood up on prom night (Minnie Driver). In an instance of life imitating art, Cusack actually did go home for his ten-year reunion (to honor a bet about the film's financing) and ended up in a real-life romance with Driver. Cusack's next appearance was as a federal agent (or, as he described it, \"the first post-Heston, non-biblical action star in sandals\") in Con Air (1997), a movie he chose because he felt it was time to make smart business decisions. He followed that with Clint Eastwood's Midnight in the Garden of Good and Evil (1997), in which he played a Yankee reporter entangled in a Savannah murder case. Cusack has always favored offbeat material, so it was no surprise when he turned up in the fiercely original Being John Malkovich (1999). Long-haired, bearded and bespectacled, he was almost unrecognizable in the role of a frustrated puppeteer who stumbles across a portal into the brain of actor John Malkovich. The convincing performance won him a Best Actor nomination at the Independent Spirit Awards. In 2000, Cusack was back to his clean-shaven self in High Fidelity (2000), another New Crime production. He worked with Steve Pink and D.V. DeVincentis to adapt Nick Hornby's popular novel (relocating the story to their native Chicago), then starred as the sarcastic record store owner who revisits his \"Top 5\" breakups to find out why he's so unlucky in love. The real Cusack has been romantically linked with several celebs, including Driver, Alison Eastwood, Claire Forlani and Neve Campbell. He's also something of a family man, acting frequently opposite sister Joan Cusack and pulling other Cusacks into his films on a regular basis. He seems pleased with the spate of projects on his horizon, but admits that he still hasn't reached his ultimate goal: to be involved in a \"great piece of art\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MTAwMjYzNV5BMl5BanBnXkFtZTcwNjIxNTU1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000131","name":"John Cusack","nicknames":["Johnny"],"idIMDB":"nm0000131"},"actorId":"nm0000131","character":"Robert Hansen","urlCharacter":"http://www.imdb.com/character/ch0415316","main":true},{"actorName":"Dean Norris","urlProfile":"http://www.imdb.com/name/nm0606487","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzOTQ2NDIzOF5BMl5BanBnXkFtZTcwMTE0OTYwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1963","placeOfBirth":" South Bend, Indiana, USA","birthName":"Dean Joseph Norris","height":"5' 7\" (1.7 m)","bio":"Dean Norris was born on April 8, 1963 in South Bend, Indiana, USA as Dean Joseph Norris. He is an actor and producer, known for Breaking Bad (2008), Total Recall (1990) and Little Miss Sunshine (2006). He has been married to Bridget since April 2001. They have five children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzOTQ2NDIzOF5BMl5BanBnXkFtZTcwMTE0OTYwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0606487","name":"Dean Norris","idIMDB":"nm0606487"},"actorId":"nm0606487","character":"Sgt. Lyle Haugsven","urlCharacter":"http://www.imdb.com/character/ch0447062","main":true},{"actorName":"Gia Mantegna","urlProfile":"http://www.imdb.com/name/nm1213456","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NTk1MDMwNV5BMl5BanBnXkFtZTgwNjUzMDk5MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1990","placeOfBirth":" New York City, New York, USA","birthName":"Gina Cristine Mantegna","height":"5' 4½\" (1.64 m)","bio":"Gia Mantegna was born on April 17, 1990 in New York City, New York, USA as Gina Cristine Mantegna. She is an actress, known for The Frozen Ground (2013), In the Land of Women (2007) and 13 Going on 30 (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NTk1MDMwNV5BMl5BanBnXkFtZTgwNjUzMDk5MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1213456","name":"Gia Mantegna","nicknames":["G"],"idIMDB":"nm1213456"},"actorId":"nm1213456","character":"Debbie Peters","urlCharacter":"http://www.imdb.com/character/ch0452306","main":true},{"actorName":"Robert Forgit","urlProfile":"http://www.imdb.com/name/nm4749828","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc4NjI0MDE3M15BMl5BanBnXkFtZTgwNjU0MjA5MzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Robert Forgit is an actor, known for The Frozen Ground (2013) and Big Miracle (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc4NjI0MDE3M15BMl5BanBnXkFtZTgwNjU0MjA5MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4749828","name":"Robert Forgit","idIMDB":"nm4749828"},"actorId":"nm4749828","character":"Sgt. Wayne Von Clasen","urlCharacter":"http://www.imdb.com/character/ch0452254","main":true},{"actorName":"Brad William Henke","urlProfile":"http://www.imdb.com/name/nm0377034","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1ODdhYWEtYzE1NC00MjFhLWJkZDMtODAwMWQ1MjZjYTZkXkEyXkFqcGdeQXVyMjMyMDg0OTI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1966","placeOfBirth":" Columbus, Nebraska, USA","birthName":"Brad William Henke","height":"6' 4\" (1.93 m)","bio":"Brad William Henke was born on April 10, 1966 in Columbus, Nebraska, USA. He is an actor, known for Orange Is the New Black (2013), Bright (2017) and Sneaky Pete (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1ODdhYWEtYzE1NC00MjFhLWJkZDMtODAwMWQ1MjZjYTZkXkEyXkFqcGdeQXVyMjMyMDg0OTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0377034","name":"Brad William Henke","idIMDB":"nm0377034"},"actorId":"nm0377034","character":"Carl Galenski","urlCharacter":"http://www.imdb.com/character/ch0452308","main":true},{"actorName":"Michael McGrady","urlProfile":"http://www.imdb.com/name/nm0569732","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNTU0NzY2Nl5BMl5BanBnXkFtZTcwODEyOTI3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Michael Steven McGrady","height":"6' 3\" (1.91 m)","bio":"Michael was born and raised in the Pacific Northwest in Washington State. He studied Business Administration at The University of Washington with plans to attend Law school. However, after having overcome a bout with malignant melanoma at the age of 19 - the same cancer that took his father's life only one year earlier - he decided to take a break from school and move to Los Angeles to pursue his secret and lifelong desire of acting. With his sister Shari's prompting and support, Michael moved to Los Angeles in 1983. Michael quickly rose to the rank of working actor with many guest-star appearances in the top tier television programs of the 80's and 90's. Additionally, he secured supporting roles in several studio films, from The Babe as baseball legend Lou Gehrig opposite John Goodman to Diggstown as Frank Mangrum along side Academy Award winners James Woods and Lou Gossett Jr. He also played John Shanssey in Wyatt Earp with Kevin Costner. Other notable films include Terrence Malick's The Thin Red Line, Ulu Grosbard's Deep End of The Ocean alongside Michelle Pfeiffer as well as several independent films such as 5 Aces with Charlie Sheen, Rage, with Nicholas Cage, The Perfect Family with Jason Ritter and Kathleen Turner and The Frozen Ground with Nicholas Cage and John Cusack. Michael can most recently be seen in the critically acclaimed FX event series, AMERICAN CRIME STORY: THE PEOPLE VS OJ SIMPSON as well as Showtime's Emmy nominated series RAY DONOVAN in major recurring roles. Prior to that Michael was a series regular on the Emmy winning series, SOUTHLAND. He is currently starring as Tom Mathews in Freeform's new show BEYOND. In addition to his success as an actor on stage, film and television, Michael is an accomplished fine artist as well. His work is currently represented in several galleries across the country. Michael and his wife Ilka own and operate McGrady Fine Art. When not filming, Michael can be found performing with his band Michael McGrady's Sonic Groove band in and around the Los Angeles area. Or you can find him outdoors sailing, surfing, riding his Harley or soaring his Hang Glider above the mountains of beautiful Santa Barbara. He holds two black belts in two different styles of Karate. He is actively involved in coaching youth sports having coached all three of his children in a variety of sports.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNTU0NzY2Nl5BMl5BanBnXkFtZTcwODEyOTI3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0569732","name":"Michael McGrady","idIMDB":"nm0569732"},"actorId":"nm0569732","character":"Vice Det. John Gentile","urlCharacter":"http://www.imdb.com/character/ch0452309","main":true},{"actorName":"Katherine LaNasa","urlProfile":"http://www.imdb.com/name/nm0478762","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNTMzOTA4M15BMl5BanBnXkFtZTcwMDkxMTc0OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 December 1966","placeOfBirth":" New Orleans, Louisiana, USA","height":"5' 8\" (1.73 m)","bio":"Actress, former ballet dancer and choreographer Katherine LaNasa was born in New Orleans, Louisiana and originally trained as a ballet dancer, but had attended the North Carolina School of Arts, in Winston-Salem, North Carolina, as well as the Neighbourhood Playhouse in New York. In 1989, she married Dennis Hopper, with whom she had a son, Henry Hopper (aka Henry Lee Hopper). They were later divorced in 1992. In 1998, she married French Stewart. LaNasa appeared in several movies and television series in the 1990s and, in 2001, received a lead role in the NBC sitcom, Three Sisters (2001), which was canceled after two seasons. She also starred in the short-lived TV series, Love Monkey (2006) and 12 Miles of Bad Road (2007) and, in 2012, starred in NBC drama series, \"Deception\", as glamorous and powerful socialite \"Sophia Bowers\". Her notable film credits include Alfie (2004), Valentine's Day (2010), Jayne Mansfield's Car (2012), The Campaign (2012) and The Frozen Ground (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNTMzOTA4M15BMl5BanBnXkFtZTcwMDkxMTc0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0478762","name":"Katherine LaNasa","idIMDB":"nm0478762"},"actorId":"nm0478762","character":"Fran Hansen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ryan O'Nan","urlProfile":"http://www.imdb.com/name/nm1645352","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0NzQ0OTkwNF5BMl5BanBnXkFtZTgwNjcwNDM1MTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"bio":"Ryan O'Nan is an actor and writer, known for Fargo (2014), Ray Donovan (2013) and Brooklyn Brothers Beat the Best (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0NzQ0OTkwNF5BMl5BanBnXkFtZTgwNjcwNDM1MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1645352","name":"Ryan O'Nan","idIMDB":"nm1645352"},"actorId":"nm1645352","character":"Gregg Baker","urlCharacter":"http://www.imdb.com/character/ch0452310","main":true},{"actorName":"Kevin Dunn","urlProfile":"http://www.imdb.com/name/nm0242656","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NTk4MTAwOF5BMl5BanBnXkFtZTcwODA4OTMwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1956","placeOfBirth":" Chicago, Illinois, USA","height":"5' 10\" (1.78 m)","bio":"Kevin Dunn was born in Chicago, Illinois, in 1956. He is an American actor who has made over 100 appearances in both TV and film. One of his earliest roles was in the Alan Parker film Mississippi Burning (1988) with Gene Hackman and Willem Dafoe. He followed this up with Kathryn Bigelow's Blue Steel (1990), Ghostbusters II (1989), and the Brian De Palma hit The Bonfire of the Vanities (1990). He has since appeared in a number of box office hits, such as Hot Shots! (1991), Chain Reaction (1996), and Godzilla (1998). He also appeared in the Oliver Stone epic, Nixon (1995) and the Ridley Scott fantasy film 1492: Christophe Colomb (1992). Dunn is able to fit into various roles in diverse genres with ease, whether the role in question be a political thriller like 'Robert Redford (I)'s Lions for Lambs (2007), an action film such as Tony Scotts Unstoppable (2010), or a romantic drama like Woody Allen's Vicky Cristina Barcelona (2008). He is an established and reliable supporting - and character - actor. He has gained considerable notoriety as the father in the hit movies Transformers (2007), Transformers: Revenge of the Fallen (2009), and Transformers: Dark of the Moon (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NTk4MTAwOF5BMl5BanBnXkFtZTcwODA4OTMwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0242656","name":"Kevin Dunn","idIMDB":"nm0242656"},"actorId":"nm0242656","character":"Lt. Bob Jent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Connor Rockom","urlProfile":"http://www.imdb.com/name/nm4771738","urlPhoto":"","biography":{"bio":"Connor Rockom is an actor, known for The Frozen Ground (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4771738","name":"Connor Rockom","idIMDB":"nm4771738"},"actorId":"nm4771738","character":"Hansen Son","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Radha Mitchell","urlProfile":"http://www.imdb.com/name/nm0593664","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU1MTUwMzYwM15BMl5BanBnXkFtZTgwNjEzODM3NTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 November 1973","placeOfBirth":" Melbourne, Victoria, Australia","birthName":"Radha Rani Amber Indigo Anunda Mitchell","height":"5' 5¾\" (1.67 m)","bio":"Radha Mitchell (born 12 November 1973) is an Australian actress. She started her career acting in various Australian TV series and movies, and later became known for her appearance in Hollywood films. Mitchell, a native of Melbourne, began acting when she was still in high school and had her professional debut on the popular Australian soap, Les voisins (1985) in 1994. Two years later, she made her film debut in the romantic comedy Love and Other Catastrophes (1996), in which she starred as a college student experiencing a messy breakup. The film proved to be fairly popular in Australia, but it wasn't until she was cast in High Art (1998) that Mitchell gained an introduction to a wider audience. The critical success of \"High Art\" made it possible for her to do more international work, and her increasing popularity was reflected by her subsequent casting in a number of projects. Among them were Pitch Black (2000), a sci-fi horror film in which Mitchell played a pilot whose ship crashes on a hostile planet, and Everything Put Together (2000), a drama where she plays a suburban woman shunned by her peers after the death of her baby. Her career continued with a diverse run of films, including Nobody's Baby (2001), Man on Fire (2004), Finding Neverland (2004), and landing the lead in Woody Allen's Melinda and Melinda (2004). Those last three films all hit the screens in 2004, and although kept working steadily, she never quite capitalized on the buzz she generated that year. Her other credits include Silent Hill (2006), Henry Poole Is Here (2008), Surrogates (2009) and The Crazies (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU1MTUwMzYwM15BMl5BanBnXkFtZTgwNjEzODM3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0593664","name":"Radha Mitchell","idIMDB":"nm0593664"},"actorId":"nm0593664","character":"Allie Halcombe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matt Gerald","urlProfile":"http://www.imdb.com/name/nm0313902","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY0ZDJiMDUtMzMxZC00NWQ4LTg1MTItMjAyZTNlZjE5MTE4L2ltYWdlXkEyXkFqcGdeQXVyMDcyNDk1OQ@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"bio":"Matt Gerald was born in Miami, Florida, USA. He is an actor, known for Daredevil (2015), Avatar (2009) and Dexter (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDgyZDEyZDktYThlMS00Y2E0LTkzZGQtZDRmMjI1YWVkODZkXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0313902","name":"Matt Gerald","idIMDB":"nm0313902"},"actorId":"nm0313902","character":"Ed Stauber","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jodi Lyn O'Keefe","urlProfile":"http://www.imdb.com/name/nm0005281","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODgxMDUwMzczMV5BMl5BanBnXkFtZTgwNjc3MzYyMDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1978","placeOfBirth":" Cliffwood Beach, New Jersey, USA","height":"5' 9\" (1.75 m)","bio":"Jodi Lyn O'Keefe was born in Cliffwood Beach, New Jersey, to Noreen and Jack O'Keefe, a director of labor relations for Merck. She began modeling at the age of 8 after seeing her eldest sister Heather modelling. She modeled for various companies such as Gitano Jeans and DreamPhone. When she reached her teen years she attended Saint John Vianney High School in Holmdel, New Jersey. After her sophomore year Jodi left school to star on the soap Another World (1964), where she played Marguerite Cory. After she left Another World she immediately landed the role of Cassidy Bridges on the hit CBS cop action/drama Nash Bridges (1996). She played Cassidy for all 6 seasons. While she was filming Nash Bridges she made her big screen debut in the 1998 Halloween sequel Halloween H20: 20 Years Later (1998). Jodi then hit the spotlight when she portrayed the snobby, popular and rich Taylor Vaughan in the 1999 hit teen flick She's All That (1999). She then starred in three more movies before she began to keep a lower profile.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODgxMDUwMzczMV5BMl5BanBnXkFtZTgwNjc3MzYyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005281","name":"Jodi Lyn O'Keefe","idIMDB":"nm0005281"},"actorId":"nm0005281","character":"Chelle Ringell","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2005374","urlIMDB":"http://www.imdb.com/title/tt2005374","business":{"budget":{"money":"$27,220,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"€13,003","country":"Netherlands","day":"14","month":"07","year":"2013","remarks":"8 Screens"}],"gross":[{"money":"€43,939","country":"Netherlands","day":"17","month":"07","year":"2013","remarks":""}],"weekendGross":[{"money":"€13,003","country":"Netherlands","day":"14","month":"07","year":"2013","remarks":"8 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"17","month":"10","year":"2011","remarks":null},null],"copyrightHolder":"© 2012 Georgia Film Fund Five, LLC"},"technical":{"runtime":["1 hr 45 min (105 min)"],"soundMix":["SDDS","DTS","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa, Zeiss Master Prime Lenses"],"laboratory":["Tunnel Post, Santa Monica (CA), USA (digital intermediate)"],"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":["D-Cinema"]},"rating":"6.4","metascore":"37","filmingLocations":[{"location":"Alaska, USA"}],"rated":"R","awards":[{"award":"Motion Picture Sound Editors, USA 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing - Direct to Video - Live Action","names":[{"name":"David Barber","id":"nm1997897","role":"supervising sound editor"},{"name":"Gonzalo Espinoza","id":"nm0261041","role":"supervising foley editor, supervising adr editor"},{"name":"David Kitchens","id":"nm0457672","role":"foley artist"},{"name":"David Paul Dorn","id":"nm3160020","role":"music editor"},{"name":"Peter D. Lago","id":"nm1185453","role":"sound effects editor"},{"name":"Steven Avila","id":"nm0043164","role":"sound effects editor"},{"name":"Alexander Pugh","id":"nm2933209","role":"sound effects editor"},{"name":"Sean Gray","id":"nm1924115","role":"dialogue editor"},{"name":"Ben Zarai","id":"nm0953357","role":"dialogue editor"}]}]}]}],"votes":"45,841","type":"Movie","companyCreditsSimple":[{"idCompany":"co0209560","name":"Grindstone Entertainment Group"},{"idCompany":"co0017712","name":"Emmett/Furla/Oasis Films (EFO Films)"},{"idCompany":"co0259889","name":"Cheetah Vision"}],"keywords":{"keywords":["based on true story","anchorage alaska","pole dancer","strip club","serial killer","prostitute","hunting","murder","man with glasses","witness","drug overdose","troubled teen","runaway","disbelieving authority","confession","playing dumb","held at gunpoint","car chase","contract killer","pimp","speech impediment","ends with portraits of victims","ends with dedication","ends with biographical notes","mobile home","handcuffed","year 1983","homicide detective","stripper","escape","gun","kidnapping","manhunt","elk","mounted animal head","alaska","woman","junkie","weapon","handcuffs","handcuffed woman","helicopter","death","state flag","trapdoor","grave site","reference to eklutna annie","reference to paula goulding","reference to sherry morrow","reference to joanna messina","ends with historical notes","confession to murder","caught having sex","moose","american flag","hunting trophy","ice skating rink","human hunting a human","smoking crack","hitman","pole dance","courvoisier","rape victim","chihuahua","1982 franklin roosevelt postage stamp","woman smoker","lighting a cigarette for a woman","true crime","trophy","husband wife relationship","rape and murder","winter","held captive","drugs","interrogation","off screen rape","rape","serial rapist","snow","trooper","young woman","what happened to epilogue","dough","sole black character dies cliche","stolen jewelry","bakery","carbine","woman wearing black lingerie","bush plane","zippo lighter","woman wearing a thong","bell 206 jet ranger helicopter","black bra and panties","spreadeagle"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:59:10"}}