{"data":{"movies":[{"title":"Crush","originalTitle":"","year":"2013","releaseDate":"20130313","directors":[{"name":"Malik Bader","id":"nm1471703"}],"writers":[{"name":"Sonny Mallhi","id":"nm1867458"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzYxODI5OV5BMl5BanBnXkFtZTgwNTMzNjA2MDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Thriller"],"plot":"The promising high school soccer player Scott is injured on the knee in a game and two years after, he is still trying to heal his knee. The teenager Jules feels unrequited love for him but Scott is concentrated in recovering his physical condition and considers her as a friend. The also teenager Bess that works in the store owned by David with her mature colleague Andie has a crush on Scott. When Scott is stalked by a mysterious person that threatens Jules, he believes that Bess is responsible for the weird situations. Is his assumption correct?","simplePlot":"A secret admirer's crush on a high school athlete takes a fatal turn.","actors":[{"actorName":"Ashleigh Craig","urlProfile":"http://www.imdb.com/name/nm4219564","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODUxNzUyNjU5M15BMl5BanBnXkFtZTgwNDA2MzAzMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"4' 11\" (1.5 m)","bio":"Ashleigh Craig is an actress, known for Crush (2013), Flare: The Hunt (2012) and Seeing Through (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODUxNzUyNjU5M15BMl5BanBnXkFtZTgwNDA2MzAzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4219564","name":"Ashleigh Craig","idIMDB":"nm4219564"},"actorId":"nm4219564","character":"Young Girl","urlCharacter":"http://www.imdb.com/character/ch0324367","main":true},{"actorName":"Cody Hamilton","urlProfile":"http://www.imdb.com/name/nm3089858","urlPhoto":"","biography":{"bio":"Cody Hamilton is an actor, known for Crush (2013), Dreams and Shadows (2009) and Glee (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3089858","name":"Cody Hamilton","idIMDB":"nm3089858"},"actorId":"nm3089858","character":"Young Boy","urlCharacter":"http://www.imdb.com/character/ch0324364","main":true},{"actorName":"Lucas Till","urlProfile":"http://www.imdb.com/name/nm1395771","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA5ODYwMDc4Nl5BMl5BanBnXkFtZTcwODM1MDA0NQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1990","placeOfBirth":" Fort Hood, Texas, USA","birthName":"Lucas Daniel Till","height":"5' 10\" (1.78 m)","bio":"Lucas Daniel Till was born in Fort Hood, Texas, to Dana Lyn (Brady) and John Mark Till, a lieutenant colonel in the army. He spent most of his childhood growing up in the suburbs of Atlanta, Georgia. At a very young age, Lucas' family quickly noticed that he had an affinity for impersonating voices and characters. When he was 11 years old, his mother enrolled him in local acting classes, and it wasn't long before he was discovered by Atlanta agent, Joy Pervis. Lucas began booking almost immediately in print, local, regional, and national commercials. Soon after, he was cast in his first movie role as Harry Vanderbilt in The Adventures of Ociee Nash, starring Keith Carradine and Mare Winningham. He was a natural for film roles and continued his success by landing his first co-starring role in Lightning Bug with Laura Prepon and Brett Harrison. Lucas made his first trip to Los Angeles when he was 13 year old. Shortly after returning to Atlanta, he booked the sought after role of Jack Cash, older brother of Johnny Cash, in the award winning biopic, Walk the Line, directed by James Mangold, produced by Cathy Konrad, starring Reese Witherspoon and Joaquin Phoenix. With high school quickly approaching, Lucas made the decision to stay in Atlanta to attend and experience public high school. He continued acting and was cast in movies for Lifetime Television and several independent features including Dance of the Dead (2008), which was directed by Gregg Bishop and hand-picked by director Sam Raimi for distribution through Lionsgate and Ghost House Pictures. Three weeks before graduating high school with honors, Lucas auditioned for Disney's Hannah Montana: The Movie and was cast in the lead role of Travis Brody. After only one week on the set, Lucas flew back to Atlanta to graduate with his high school class of 2008. Lucas now resides in Los Angeles pursuing his career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA5ODYwMDc4Nl5BMl5BanBnXkFtZTcwODM1MDA0NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1395771","name":"Lucas Till","idIMDB":"nm1395771"},"actorId":"nm1395771","character":"Scott","urlCharacter":"http://www.imdb.com/character/ch0324357","main":true},{"actorName":"Crystal Reed","urlProfile":"http://www.imdb.com/name/nm3706952","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMTk4OTY5M15BMl5BanBnXkFtZTcwNzY1NDA5OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 February 1985","placeOfBirth":" Detroit, Michigan, USA","birthName":"Crystal Marie Reed","height":"5' 7¾\" (1.72 m)","bio":"Crystal Reed was born in Detroit, Michigan and began to study dance at an early age. She attended Dort Elementary School in Roseville, Michigan, Roseville Junior High and Roseville High School, where she was president of the school's drama club was the dance captain. She also took part in a local community theater and performed in musicals such as Annie and Grease. After graduating high school, Reed attended Wayne State University where she pursued fine arts, but left before finishing her bachelor's degree to move to Chicago where she performed in local plays and continued to take improv and theater classes at places like Second City, iO Chicago Theater and Act One Studios before she moved to Hollywood. Since the start of her career, Crystal Reed has made guest appearances on television shows such as CSI: Crime Scene Investigation (2000), Rizzoli & Isles (2010), and CSI: NY (2004). In 2010, Reed appeared in the film Skyline (2010), and in 2011 she landed a role in MTV's Teen Wolf (2011) along with co-stars Tyler Posey and Dylan O'Brien.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMTk4OTY5M15BMl5BanBnXkFtZTcwNzY1NDA5OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3706952","name":"Crystal Reed","idIMDB":"nm3706952"},"actorId":"nm3706952","character":"Bess","urlCharacter":"http://www.imdb.com/character/ch0324355","main":true},{"actorName":"Isaiah Mustafa","urlProfile":"http://www.imdb.com/name/nm2248149","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NjQ3MjYyNV5BMl5BanBnXkFtZTcwNjk1MzgxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 February 1974","placeOfBirth":" USA","height":"6' 3\" (1.91 m)","bio":"Isaiah Mustafa was born on February 11, 1974 in the USA. He is an actor and director, known for Horrible Bosses (2011), Shadowhunters: The Mortal Instruments (2016) and Madea's Big Happy Family (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NjQ3MjYyNV5BMl5BanBnXkFtZTcwNjk1MzgxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2248149","name":"Isaiah Mustafa","idIMDB":"nm2248149"},"actorId":"nm2248149","character":"Coach Evans","urlCharacter":"http://www.imdb.com/character/ch0324369","main":true},{"actorName":"Dan Metcalfe","urlProfile":"http://www.imdb.com/name/nm0018351","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzg3OGFiNGItNzdhOS00NWE2LWEyODMtNjk5ZmI4YzNmMzhiL2ltYWdlXkEyXkFqcGdeQXVyMTk5OTIxNDM@._V1_UY44_CR19,0,32,44_AL_.jpg","biography":{"bio":"Dan Metcalfe is known for his work on Shark Attack 2 (2000), Kicking & Screaming (2005) and Crush (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzg3OGFiNGItNzdhOS00NWE2LWEyODMtNjk5ZmI4YzNmMzhiL2ltYWdlXkEyXkFqcGdeQXVyMTk5OTIxNDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0018351","name":"Dan Metcalfe","idIMDB":"nm0018351"},"actorId":"nm0018351","character":"Referee","urlCharacter":"http://www.imdb.com/character/ch0324363","main":true},{"actorName":"Derrick Kemp","urlProfile":"http://www.imdb.com/name/nm3896526","urlPhoto":"","biography":{"bio":"Derrick Kemp is an actor, known for Against the Grain (2012), Crush (2013) and The Doctor (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3896526","name":"Derrick Kemp","idIMDB":"nm3896526"},"actorId":"nm3896526","character":"Brock","urlCharacter":"http://www.imdb.com/character/ch0324362","main":true},{"actorName":"Preston Davis","urlProfile":"http://www.imdb.com/name/nm2186221","urlPhoto":"","biography":{"bio":"Preston Davis is an actor, known for Crush (2013), Arthur (2015) and The Prankster (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2186221","name":"Preston Davis","idIMDB":"nm2186221"},"actorId":"nm2186221","character":"Corey","urlCharacter":"http://www.imdb.com/character/ch0324365","main":true},{"actorName":"Mariah Buzolin","urlProfile":"http://www.imdb.com/name/nm2279757","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1MzEwODczMV5BMl5BanBnXkFtZTcwMjM4NzczOQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 February 1991","placeOfBirth":" Campinas, São Paulo, Brazil","birthName":"Mariah Buzolin Oliveira","height":"5' 5\" (1.65 m)","bio":"Mariah Buzolin, youngest child of two, was born on February 3, 1991 in Brazil. She moved to Los Angeles in 2007, where she began her career as an actress. Mariah Buzolin is best known for her role Maya Mercado in All my Children and for her role Zoe Mendez on Jane by design.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1MzEwODczMV5BMl5BanBnXkFtZTcwMjM4NzczOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2279757","name":"Mariah Buzolin","idIMDB":"nm2279757"},"actorId":"nm2279757","character":"Karen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sarah Bolger","urlProfile":"http://www.imdb.com/name/nm0092961","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NjU2NTEyNl5BMl5BanBnXkFtZTgwMTIzNjY4MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 February 1991","placeOfBirth":" Dublin, Ireland","birthName":"Sarah Lee Bolger","height":"5' 4\" (1.63 m)","bio":"Sarah Lee Bolger (born 28 February 1991) is an Irish actress. She is best known for her roles in the films In America (2002), Stormbreaker, and The Spiderwick Chronicles (2008), as well as her award winning role as Lady Mary Tudor in the TV series Les Tudors (2007), and for guest starring as Princess Aurora in Once Upon a Time (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NjU2NTEyNl5BMl5BanBnXkFtZTgwMTIzNjY4MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0092961","name":"Sarah Bolger","idIMDB":"nm0092961"},"actorId":"nm0092961","character":"Jules","urlCharacter":"http://www.imdb.com/character/ch0324356","main":true},{"actorName":"Holt McCallany","urlProfile":"http://www.imdb.com/name/nm0564697","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MzYzMjgyNV5BMl5BanBnXkFtZTcwMjk1MzMzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 September 1963","placeOfBirth":" New York City, New York, USA","birthName":"Michael Quinn McAloney","height":"6' 1\" (1.85 m)","bio":"Holt McCallany was born into a family of New York City actors; his mother was the renowned singer/actress Julie Wilson, and his father was Tony Award-winning actor and producer Michael McAloney. He began school in Dublin, Ireland at the age of five before his parents moved back to NY. At 14 years old, he ran away from home and took a Greyhound bus to Los Angeles to pursue his dream of becoming an actor but his parents tracked him down and sent him back to Ireland to boarding school. Following high school, Holt went to France to continue his education. He learned French at the Sorbonne, studied art history at the Paris American Academy, and theater at L'Ecole Marceau and L'Ecole Jacques Lecoq. He spent a summer studying Shakespeare in Oxford then moved back to New York City permanently to begin his acting career. McCallany has worked with the most prestigious directors and actors of our time in films like GANGSTER SQUAD (Sean Penn, Ryan Gosling, Josh Brolin, Emma Stone), FIGHT CLUB (Brad Pitt, Edward Norton, directed by David Fincher), THREE KINGS (George Clooney, Mark Wahlberg, directed by David O. Russell), MEN OF HONOR (Cuba Gooding Jr., Robert DeNiro), BELOW (written by Darren Aronofsky, Lucas Sussman & David Twohy), VANTAGE POINT (Dennis Quaid, Forest Whitaker, produced by Neil Moritz), THE LOSERS (Idris Elba, Zoe Saldana), BLACKHAT (Chris Hemsworth and directed, produced and co-written by Michael Mann), RUN ALL NIGHT (Liam Neeson, Joel Kinnaman, Ed Harris) and THE PERFECT GUY (Sanaa Lathan, Michael Ealy, Morris Chestnut). Holt also starred in THE GANZFELD EXPERIMENT, an exploration of extrasensory perception and WHITE SPACE, a futuristic retelling of Herman Melville's classic Moby Dick. Most recently he shot SULLY (Tom Hanks, directed by Clint Eastwood) and SHOT CALLER (Nikolaj Coster-Waldau, directed by Ric Roman Waugh). On television, McCallany starred in the critically acclaimed dramatic series LIGHTS OUT for FX earning rave reviews for his performance as heavyweight champion Patrick \"Lights\" Leary. He played a detective with psychological problems on CSI MIAMI, the district attorney and love interest to Bridget Moynahan's character on CBS's hit drama BLUE BLOODS and a soldier with post-traumatic stress disorder on CRIMINAL MINDS, among others. For the stage, Holt's credits include The Taming Of The Shrew, Twelfth Night, Bovver Boys, Rosetta Street, and By The Sea, By The Sea, By The Beautiful Sea.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MzYzMjgyNV5BMl5BanBnXkFtZTcwMjk1MzMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0564697","name":"Holt McCallany","idIMDB":"nm0564697"},"actorId":"nm0564697","character":"Mike","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Camille Guaty","urlProfile":"http://www.imdb.com/name/nm0345477","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE4NTA3MzI3OF5BMl5BanBnXkFtZTgwMTc2NzUzMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1976","placeOfBirth":" Santa Clara County, California, USA","birthName":"Camille Marie Guaty","height":"5' 3¾\" (1.62 m)","bio":"Camille Guaty, raised in Northern California and New Jersey, studied at Boston University and continued her education at R.A.D.A, the Royal Academy of Dramatic Arts in London. Here she learned the great works of the late William Shakespeare. It was in New York when she caught the eye of a casting director that helped her sign with Innovative Artist and Handprint Entertainment. After a ten day trip to meet her new Los Angeles reps, they immediately signed her and sent her out on her first pilot season. Camille was offered a holding deal with WB and booked her first role on Bob Sagets \"Raising Dad,\" as a feisty best friend to Kat Dennings and Brie Larson. She next landed the lead role in Disney Chanel's \"Gotta Kick It Up\" and hasn't stopped working ever since.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE4NTA3MzI3OF5BMl5BanBnXkFtZTgwMTc2NzUzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0345477","name":"Camille Guaty","nicknames":["Dimples"],"idIMDB":"nm0345477"},"actorId":"nm0345477","character":"Mrs. Brown","urlCharacter":"http://www.imdb.com/character/ch0324358","main":true},{"actorName":"Caitriona Balfe","urlProfile":"http://www.imdb.com/name/nm2928020","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5OTkzMTY3OF5BMl5BanBnXkFtZTcwMTk5Nzg2Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1979","placeOfBirth":" Dublin, Ireland","height":"5' 9¾\" (1.77 m)","bio":"Caitriona Balfe was born in Dublin, Ireland, and grew up in the village of Tydavnet, in County Monaghan. She started modeling at the age of 19 after she was scouted by an agent while she was collecting money for charity at a local mall. She has both walked the runway and been featured in advertising campaigns for many top fashion brands, including: Dolce & Gabbana, Fendi, DKNY, Burberry, Dior, Louis Vuitton, H&M, Marc Jacobs, Valentino, Cacharel, Roberto Cavalli, Givenchy, Hugo Boss, Armani, Dries van Noten, Calvin Klein and Chanel. She has also graced the covers of magazines such as Vogue and Elle. At the time she was scouted, Balfe was studying drama at the Dublin Institute of Technology, hoping to become an actress. She returned to her initial career choice in 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5OTkzMTY3OF5BMl5BanBnXkFtZTcwMTk5Nzg2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2928020","name":"Caitriona Balfe","idIMDB":"nm2928020"},"actorId":"nm2928020","character":"Andie","urlCharacter":"http://www.imdb.com/character/ch0324366","main":true},{"actorName":"Leigh Whannell","urlProfile":"http://www.imdb.com/name/nm1191481","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzA3OTI0Ml5BMl5BanBnXkFtZTcwNDUzMTEzMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1977","placeOfBirth":" Melbourne, Victoria, Australia","height":"5' 7\" (1.7 m)","bio":"Leigh Whannell grew up in Melbourne, Australia, where, at the age of four, he developed an obsession with telling stories. Whether it be through acting, writing or filmmaking, his primary love was getting a reaction from an audience. In 1995, at the age of 18, he was accepted into the Royal Melbourne Institute of Technology's prestigious Media Arts course, where he met fellow filmmaker James Wan. In his second year of college, he landed the role of \"film guy\" on a Saturday morning TV show aimed at teens called Recovery (1996). Filmed totally live in the studio and hosted by actual teenagers, the ground-breaking show was hugely popular down under and was the first to bring \"alternative culture\" to Australia's TV screens, featuring live performances from bands like Sonic Youth, Weezer, Public Enemy, Ben Harper, Pulp and hundreds more. Hosting the film component of the show, Leigh was lucky enough to interview people like Tim Burton, Peter Jackson, Russell Crowe, George Clooney, and eventually went on the host the show in 1999. After graduating from college, Leigh found himself working more and more as a \"host\" or \"presenter\" on Australian TV - all the while hatching a plan with James Wan to finally fulfill his dream of making a film. Small acting roles cropped up from time to time (including one in The Matrix Reloaded (2003), which Leigh has said was \"the most fun I've ever had in my life\") and, along with those, some frustrating near-misses (and not so near-misses: like his cringe-inducing audition for \"Lord Of The Rings\", in which he paid $90 to have \"hobbit ears\" grafted onto his head, turning up at the casting office dressed as a hobbit - needless to say he didn't get the role). However, it was missing out on a role in Alex Proyas Australian film Garage Days (2002) that finally broke the camel's back. He called Wan and told him that if they wanted to get a film made, they would have to pay for it themselves. Saw (2004) was born. After nine months of writing, Leigh had written the screenplay for what he thought would be a self-financed, \"Blair Witch\"-style feature, with him starring and James directing. The script gained so much attention that soon enough, they were shopping it around Hollywood....and the rest is history.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzA3OTI0Ml5BMl5BanBnXkFtZTcwNDUzMTEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1191481","name":"Leigh Whannell","idIMDB":"nm1191481"},"actorId":"nm1191481","character":"David","urlCharacter":"http://www.imdb.com/character/ch0324361","main":true},{"actorName":"Reid Ewing","urlProfile":"http://www.imdb.com/name/nm2938641","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNTQ4MDQ3N15BMl5BanBnXkFtZTgwMjg1NTM0ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 2\" (1.88 m)","bio":"Reid Ewing is an actor, known for Fright Night (2011), Modern Family (2009) and Temps (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNTQ4MDQ3N15BMl5BanBnXkFtZTgwMjg1NTM0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2938641","name":"Reid Ewing","idIMDB":"nm2938641"},"actorId":"nm2938641","character":"Jeffrey","urlCharacter":"http://www.imdb.com/character/ch0324370","main":true}],"seasons":[],"idIMDB":"tt2093977","urlIMDB":"http://www.imdb.com/title/tt2093977","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"24","month":"10","year":"2011","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 34 min (94 min)"],"soundMix":["Dolby Surround 7.1"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa"],"laboratory":["LightIRON Digital, Los Angeles (CA), USA (digital intermediate)"],"filmLength":null,"negativeFormat":null,"cinematographicProcess":["Digital Intermediate"],"printedFilmFormat":null},"rating":"5.7","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"PG-13","awards":[],"votes":"4,166","type":"Movie","companyCreditsSimple":[{"idCompany":"co0059753","name":"Intrepid Pictures"}],"keywords":{"keywords":["high school","crush","secret admirer","high school athlete","athlete","tween girl","bikini","lake","fireworks","beer","football","portrait","drawing","wound","bicycle","accident","attempt to murder","pillow","party","threatening","anonymous letter","love letter","high school student","one word title","student","obsession"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:13:53"}}