{"data":{"movies":[{"title":"Real Playing Game","originalTitle":"","year":"2013","releaseDate":"20130829","directors":[{"name":"Tino Navarro","id":"nm0623025"},{"name":"David Rebordão","id":"nm4802425"}],"writers":[{"name":"Tino Navarro","id":"nm0623025"},{"name":"Tino Navarro","id":"nm0623025"}],"runtime":"103 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MTc5NTYwMF5BMl5BanBnXkFtZTgwMTc1NDg5MjE@._V1.jpg","countries":["Portugal"],"languages":["English"],"genres":["Action","Adventure","Sci-Fi"],"plot":"In a future not too far away, Steve Battier, an elderly, terminally ill multi-millionaire, accepts the offer of a company - RPG - that in exchange for a high monetary sum, provides a very select group of clientèle the chance to be young again. For 10 hours, 10 millionaires from around the world, men and women of fame and power, are transferred to attractive and healthy younger bodies, to live in a world of temporary rejuvenation, in a game of real thrills, where every hour someone must die. After returning to the body of a man of 23 years, enjoying the pleasures of sex, and experiencing the adrenaline of violence and power over life and death, Steve is willing to do anything to stay young forever... But what we may have experienced is not always what appears to be.","simplePlot":"A wealthy individual is desperate to find a way to stay alive, as he is both old and terminally ill. When a company known as RPG offers him the chance to become young again in return for a large amount of money, he doesn't think twice.","actors":[{"actorName":"Cian Barry","urlProfile":"http://www.imdb.com/name/nm1152495","urlPhoto":"","biography":{"height":"6' (1.83 m)","bio":"Cian Barry is an actor, known for Nina Forever (2015), Help Point (2014) and Real Playing Game (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1152495","name":"Cian Barry","idIMDB":"nm1152495"},"actorId":"nm1152495","character":"Young Steve Battier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alix Wilton Regan","urlProfile":"http://www.imdb.com/name/nm2542896","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NDUyNzYzN15BMl5BanBnXkFtZTgwNzYzNzY4NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 January 1986","placeOfBirth":" London, England, UK","height":"5' 6\" (1.68 m)","bio":"Alix Wilton Regan was born on January 26, 1986 in London, England. She is an actress, known for The Wife (2017), The Isle (2017) and Dragon Age: Inquisition (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NDUyNzYzN15BMl5BanBnXkFtZTgwNzYzNzY4NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2542896","name":"Alix Wilton Regan","nicknames":["Lexi"],"idIMDB":"nm2542896"},"actorId":"nm2542896","character":"Young Alice","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nik Xhelilaj","urlProfile":"http://www.imdb.com/name/nm2956046","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MjY5MDc2MV5BMl5BanBnXkFtZTgwNjY4NDg0NjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Nik Xhelilaj is an actor, known for L'Albanais (2010), Winnetou & Old Shatterhand (2016) and Seven Lucky Gods (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MjY5MDc2MV5BMl5BanBnXkFtZTgwNjY4NDg0NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2956046","name":"Nik Xhelilaj","idIMDB":"nm2956046"},"actorId":"nm2956046","character":"Young Boris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pedro Granger","urlProfile":"http://www.imdb.com/name/nm1101722","urlPhoto":"","biography":{"dateOfBirth":"8 June 1979","placeOfBirth":" Lisbon, Portugal","birthName":"Pedro Guerra Tavares Granger Rodrigues","height":"5' 9\" (1.75 m)","bio":"Pedro Granger was born on June 8, 1979 in Lisbon, Portugal as Pedro Guerra Tavares Granger Rodrigues. He is an actor, known for Dei-te Quase Tudo (2005), Sedução (2010) and Jardins Proibidos (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1101722","name":"Pedro Granger","idIMDB":"nm1101722"},"actorId":"nm1101722","character":"Young Carlos","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Goh","urlProfile":"http://www.imdb.com/name/nm3664879","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMjQyMjY0N15BMl5BanBnXkFtZTgwMzU4Njg1NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1984","placeOfBirth":" Shrewsbury, Shropshire, England, UK","bio":"Christopher Goh was born in 1984 in Shrewsbury, Shropshire, England. He is an actor and producer, known for Hunter Killer (2017), The Five (2016) and Strike Back (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMjQyMjY0N15BMl5BanBnXkFtZTgwMzU4Njg1NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3664879","name":"Christopher Goh","idIMDB":"nm3664879"},"actorId":"nm3664879","character":"Young Li","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Genevieve Capovilla","urlProfile":"http://www.imdb.com/name/nm3006173","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk4NDExNzk4NF5BMl5BanBnXkFtZTcwMDEyNzY4OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Genevieve Capovilla was born to a Jamaican mother and an Italian father in Padova, Italy. She was raised in England and is fluent in Italian and French. From a young age Genevieve showed a passion for performing and at 11 years old, in addition to attending an all girls boarding school in Sussex, undertook examinations for speech and drama at the Guildhall School of Music and Drama. Whilst reading Psychology at Westminster University in London, Genevieve started a successful international modeling career. Her degree in Psychology and its insight into the workings of the mind, now proves to be an invaluable tool for her real passion: acting. She has so far acted in: TV commercials, TV shows, as well as various short films and music videos. Genevieve also performed on stage in Neil Simon's The Dinner Party, playing Mariette Levieux. She made her feature film debut playing Maria Moulineaux in the science fiction action drama Real Playing Game (2013) starring Rutger Hauer. Genevieve continues to nurture her craft at the Giles Foreman Centre for Acting in London.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk4NDExNzk4NF5BMl5BanBnXkFtZTcwMDEyNzY4OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3006173","name":"Genevieve Capovilla","idIMDB":"nm3006173"},"actorId":"nm3006173","character":"Young Maria","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dafne Fernández","urlProfile":"http://www.imdb.com/name/nm0273451","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNTA5MTY4OV5BMl5BanBnXkFtZTcwOTk3NDQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1985","placeOfBirth":" Madrid, Spain","height":"5' 10½\" (1.79 m)","bio":"Dafne Fernández was born on March 31, 1985 in Madrid, Spain. She is an actress, known for Box 507 (2002), Goya in Bordeaux (1999) and Tierra de lobos (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNTA5MTY4OV5BMl5BanBnXkFtZTcwOTk3NDQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0273451","name":"Dafne Fernández","idIMDB":"nm0273451"},"actorId":"nm0273451","character":"Young Kate","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Reuben-Henry Biggs","urlProfile":"http://www.imdb.com/name/nm1884247","urlPhoto":"","biography":{"bio":"Reuben-Henry Biggs is an actor, known for The Illusionist (2006), Starter for 10 (2006) and Real Playing Game (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1884247","name":"Reuben-Henry Biggs","idIMDB":"nm1884247"},"actorId":"nm1884247","character":"Young Okot","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cloudia Swann","urlProfile":"http://www.imdb.com/name/nm2014175","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MDk3MTQ0MV5BMl5BanBnXkFtZTcwNDYxNTIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Cloudia Rose Swann","height":"5' 6\" (1.68 m)","bio":"Cloudia is a British Film, Television and Stage actor best known for her role as Susan Porter in Sky's Dream Team 80's and Sophie in Shine Productions Dis/Conneceted. Cloudia began her career starring opposite Philip Winchester in Shaking Dreamland which played at Cannes Film Fesitval and LUFF (London Film Focus). Her career has seen her play PC Justine Miller in Shoot on Sight with Brian Cox, Om Puri. Guest leads in popular shows such as The Bill, Doctors and Hollyoaks to ITV Comedy, Bike Squad where she was cast as the run away daughter to Mark Addy. Shine Productions cast Cloudia as the lead in TV Movie Dis/connected based around a group of friends dealing with a Jenny Summers suicide. She then filmed Shines Demons before landing a semi regular in River City. Her roles have been as diverse on stage. Cloudia toured the West Coast of America in 2011-2012 with Award Winning \"The Great Game Afghanistan\" A 7.5hr epic written by 7 different playwrights including the Iron Lady's Abbi Morgan. Her roles included an army wife desperately wanting her husband to not go back to a young CSI Agent in Wood for the Fire. Due to the great success of the tour the cast were invited back to Washington to perform in front of a private audience of the Pentagon, Washington, DC.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MDk3MTQ0MV5BMl5BanBnXkFtZTcwNDYxNTIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2014175","name":"Cloudia Swann","idIMDB":"nm2014175"},"actorId":"nm2014175","character":"Young Yasmin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Débora Monteiro","urlProfile":"http://www.imdb.com/name/nm2296895","urlPhoto":"","biography":{"bio":"Débora Monteiro is an actress, known for Dancin' Days (2012), Os Nossos Dias (2013) and Tempo de Viver (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2296895","name":"Débora Monteiro","idIMDB":"nm2296895"},"actorId":"nm2296895","character":"Young Jorge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rutger Hauer","urlProfile":"http://www.imdb.com/name/nm0000442","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY4MjI0MjgyOV5BMl5BanBnXkFtZTgwMDA0MDkyODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1944","placeOfBirth":" Breukelen, Utrecht, Netherlands","birthName":"Rutger Oelsen Hauer","height":"6' 1½\" (1.87 m)","bio":"Blonde, blue-eyed, tall and handsome Dutch actor Rutger Hauer has an international reputation for playing everything from romantic leads to action heroes to sinister villains. Hauer was born in Breukelen, a town in the province of Utrecht, the Netherlands. He is the son of Teunke (Mellema) and Arend Hauer, both actors. Because his parents were often touring, he and his three sisters were raised by a nanny. A bit of a rebel during his childhood, he chafed at the rules and rigors of school and was often getting into mischief. His grandfather had been the captain of a schooner and at age 15, Hauer ran away to work on a freighter for a year. Like his great-grandfather, Hauer is color-blind, which prevented him from furthering his career as a sailor. Upon his return he attended night school and started working in the construction industry. When he again bombed at school, his parents enrolled him in drama classes. Fancying himself a poet, he spent most of his time writing poetry and hanging out in Amsterdam coffee houses instead of studying. He was expelled for poor attendance and afterward spent a brief period in the Dutch navy. Deciding he didn't like military life, he convinced his superiors that he was mentally unfit and was sent to a special home for psych patients. It was an unpleasant place, but Hauer remained there until he convinced his ranking officers that the military really did not need him.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY4MjI0MjgyOV5BMl5BanBnXkFtZTgwMDA0MDkyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000442","name":"Rutger Hauer","nicknames":["The Dutch Paul Newman"],"idIMDB":"nm0000442"},"actorId":"nm0000442","character":"Steve Battier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Tashima","urlProfile":"http://www.imdb.com/name/nm0850875","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MDA4NDk4M15BMl5BanBnXkFtZTgwOTM3NjcxMjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"In 1998, Chris Tashima received an Academy Award® for Live Action Short Film, for Visas and Virtue (1997) -- a 26-minute historical drama inspired by Holocaust rescuer Chiune 'Sempo' Sugihara -- which he directed, co-wrote (adapting an original one-act play by Tim Toyama), and starred as the Humanitarian diplomat. To produce the film, he co-founded Cedar Grove Productions -- with playwright and executive producer Toyama and producer Chris Donahue -- which remains active developing and producing projects which \"boldly defy mainstream Hollywood by giving Asian Americans the spotlight on stage, or the close-up on screen.\" Following that success, Tashima directed, co-wrote and acted in Day of Independence (2003), Cedar Grove Productions' tribute to the 120,000 Japanese Americans who endured America's World War II concentration camps. The half-hour drama received an Emmy® Nomination from the NATAS Northern California Chapter, in the category of Historical/Cultural - Program/Special, in addition to being officially selected to over sixty international film festivals, garnering twenty-five awards. Tashima studied film production at UC Santa Cruz, and with Visual Communications, an Asian Pacific American media arts organization in his hometown of Los Angeles. As actor, Tashima has starred in numerous independent films over the past 30-plus years. In his biggest role, he played the romantic lead opposite Joan Chen, in Eric Byler's festival favorite, Americanese (2006), which won the Audience Award for Best Narrative Feature and a Special Jury Prize for Outstanding Ensemble Cast at its world premiere at the SXSW Film Festival. More recently, he played the alcoholic father to Nichole Bloom's break-out starring debut in Lily Mariye's gritty urban indie, Model Minority (2012), and starred in the title role of Jeffrey Gee Chin's noir period dramatic short, Lil Tokyo Reporter (2012). Other feature roles range from the evil gangster Bong opposite Angus Macfadyen in Sherwood Hu's Lani Loa - The Passage (Lanai-Loa (1998)) from executive producers Francis Ford Coppola and Wayne Wang, to, most recently, the pivotal Papa role in Tim Savage's award-winning Under the Blood-Red Sun (2014) from producer Dana Satler Hankins, for which he received Best Actor in a Supporting Role at the inaugural Love International Film Festival (Los Angeles). Tashima's theatre appearances have included Ming in the world premiere of Chay Yew's A \"Language of Their Own\" at the Celebration Theatre, in West Hollywood (garnering an LA Weekly Theater Award for Ensemble Performance), Windrider in Laurence Yep's \"Dragonwings\" which he originated at Berkeley Repertory Theatre (and reprised at Seattle Children's Theatre, the Alliance Children's Theatre, in Atlanta, and Syracuse Stage), and Sugihara in Toyama's original one-act, \"Visas and Virtue,\" at the Road Theatre Company, in North Hollywood. He has worked extensively with East West Players, in Los Angeles, where among his early credits are \"Rashomon,\" \"Mishima\" and \"The Memento.\" In addition to theatre performance, Tashima has also directed for the stage, including the the world premieres of Dan Kwong's \"Be Like Water\" at East West Players, and Soji Kashiwagi's \"Nihonmachi: The Place to Be\" for the Grateful Crane Ensemble. In addition, Tashima is a multi-award-winning scenic designer (Ovation Award - \"Sweeney Todd,\" Drama-Logue Award - \"Into the Woods\"). Tashima has been the recipient of honors from community organizations from around the country, including the \"Japanese American of the Biennium\" awarded by the National JACL, a Community Award from the Japanese American Service Committee (Chicago), a \"Bridge Builder\" Asian American Leadership Award presented by A. Magazine (NYC), a Special Recognition Award from the Japanese American Cultural and Community Center (Los Angeles), a Visionary Award from East West Players (LA), and a Humanitarian Award from The \"1939\" Club, a Holocaust Survivors' organization (LA). Tashima is an active member of the Academy of Motion Picture Arts and Sciences, in the Short Films and Feature Animation Branch. He is a member of the Directors Guild of America, where he serves on the DGA's Asian American Committee. He is also an active member of SAG-AFTRA where he serves on the National APAM (Asian Pacific American Media) Committee. And in addition, he is a member of Actors Equity Association, and the Stage Directors and Choreographers Society.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MDA4NDk4M15BMl5BanBnXkFtZTgwOTM3NjcxMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0850875","name":"Chris Tashima","idIMDB":"nm0850875"},"actorId":"nm0850875","character":"Mr. Chan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Soraia Chaves","urlProfile":"http://www.imdb.com/name/nm2084836","urlPhoto":"","biography":{"dateOfBirth":"22 June 1982","placeOfBirth":" Lisbon, Portugal","bio":"She is a model who turned into a fantastic actress. Her first appearance as an actress was in \"O Crime do Padre Amaro\", a movie version of an successful Portuguese book. In this movie she has one of the leading roles, having to show her beautiful naked body. Soraia is now at SIC (Sociedade Independente de Comunicação), signing a contract with one of the biggest TV channel's in Portugal. Before being extremely famous she was the on the cover of several magazines such as FHM.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2084836","name":"Soraia Chaves","idIMDB":"nm2084836"},"actorId":"nm2084836","character":"Sarah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victória Guerra","urlProfile":"http://www.imdb.com/name/nm2386605","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3OTAyODUzNV5BMl5BanBnXkFtZTgwMDkwMjQ0NDE@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1989","placeOfBirth":" Faro, Portugal","bio":"Victória Guerra was born on April 16, 1989 in Faro, Portugal. She is an actress, known for Sol de Inverno (2013), Mar de Paixão (2010) and Dancin' Days (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3OTAyODUzNV5BMl5BanBnXkFtZTgwMDkwMjQ0NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2386605","name":"Victória Guerra","idIMDB":"nm2386605"},"actorId":"nm2386605","character":"Driver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Duarte Grilo","urlProfile":"http://www.imdb.com/name/nm4108017","urlPhoto":"","biography":{"bio":"Duarte Grilo is an actor and assistant director, known for Mulheres (2014), Fado (2016) and Quarta Divisão (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4108017","name":"Duarte Grilo","idIMDB":"nm4108017"},"actorId":"nm4108017","character":"Editor","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2043971","urlIMDB":"http://www.imdb.com/title/tt2043971","business":{"budget":{"money":"€600,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"€113,874","country":"Portugal","day":"15","month":"09","year":"2013","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/2011/\">2011</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 43 min (103 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex Cameras (Future Scenes)","Red One Camera (Game Scenes)"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":["DCP (Digital Cinema Package DCP)"]},"rating":"4.3","filmingLocations":[{"location":"Fundação Champalimaud, Lisbon, Portugal"}],"rated":"R","awards":[{"award":"Sophia Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Sophia","categories":[{"category":"Best Sound (Melhor Som)","names":[{"name":"Vasco Pedroso","id":"nm0670166","role":null},{"name":"Branko Neskov","id":"nm0626433","role":null}]},{"category":"Best Make-Up (Melhor Caracterização)","names":[{"name":"Ana Lorena","id":"nm0520599","role":null},{"name":"Rute Alves","id":"nm1498395","role":null}]}]}]}],"votes":"816","type":"Movie","companyCreditsSimple":[{"idCompany":"co0053397","name":"MGN Filmes"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:08:32"}}