{"data":{"movies":[{"title":"No Good Deed","originalTitle":"","year":"2014","releaseDate":"20140912","directors":[{"name":"Sam Miller","id":"nm0589284"}],"writers":[{"name":"Aimee Lagos","id":"nm1350938"}],"runtime":"84 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk0OTc3MDM5MF5BMl5BanBnXkFtZTgwOTMzMDMzMjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Thriller"],"plot":"A lonely mother, invites a handsome car accident victim into her home. Desperate for a little attention, she doesn't realize she's entertaining a sociopathic, yet charming escape convict. In one terrorizing night her life completely changes as she fight for her own life and the life of her children in No Good Deed.","simplePlot":"An unstable escaped convict terrorizes a woman who is alone with her two children.","actors":[{"actorName":"Idris Elba","urlProfile":"http://www.imdb.com/name/nm0252961","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEzMTI2NjEyNF5BMl5BanBnXkFtZTcwNTA0OTE4OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1972","placeOfBirth":" Hackney, London, England, UK","birthName":"Idrissa Akuna Elba","height":"6' 2¾\" (1.9 m)","bio":"An only child, Idris Elba was born and raised in Hackney, London, England. His father, Winston, is from Sierra Leone and worked at a Ford motor factory. His mother, Eve, is from Ghana and had a clerical duty. Idris attended school in Canning Town, where he first became involved in acting. He gained a place in the National Youth Music Theatre - thanks to a £1,500 Prince's Trust grant. He worked as a disc jockey in nightclubs under the nickname DJ Big Driis at age 19. However, he began auditioning for television roles in his early twenties. He has starred in both British and American productions. His first acting roles were on the soap opera Family Affairs (1997) and the television serial Ultraviolet (1998). His best known roles are as drug baron Russell \"Stringer\" Bell on the HBO series The Wire (2002) and as DCI John Luther on the BBC One series Luther (2010). He later starred in the films Daddy's Little Girls (2007), Prom Night (2008), RocknRolla (2008), The Unborn (2009) and Obsessed (2009). He also appeared in the films American Gangster (2007), Takers (2010), Thor (2011), Prometheus (2012), Pacific Rim (2013) and Thor: The Dark World (2013). Idris Elba was appointed Officer of the Order of the British Empire (OBE) by Queen Elizabeth II in the 2016 New Years Honours for his services to drama.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEzMTI2NjEyNF5BMl5BanBnXkFtZTcwNTA0OTE4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0252961","name":"Idris Elba","nicknames":["DJ Big Driis"],"idIMDB":"nm0252961"},"actorId":"nm0252961","character":"Colin","urlCharacter":"http://www.imdb.com/character/ch0497793","main":true},{"actorName":"Taraji P. Henson","urlProfile":"http://www.imdb.com/name/nm0378245","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NDQ2MTUwMl5BMl5BanBnXkFtZTcwODA2NDY3NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1970","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Taraji Penda Henson","height":"5' 4\" (1.63 m)","bio":"Taraji P. Henson was born on September 11, 1970 in Washington, District of Columbia, USA as Taraji Penda Henson. She is an actress and producer, known for Hidden Figures (2016), Person of Interest (2011) and The Curious Case of Benjamin Button (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NDQ2MTUwMl5BMl5BanBnXkFtZTcwODA2NDY3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0378245","name":"Taraji P. Henson","idIMDB":"nm0378245"},"actorId":"nm0378245","character":"Terry","urlCharacter":"http://www.imdb.com/character/ch0498039","main":true},{"actorName":"Leslie Bibb","urlProfile":"http://www.imdb.com/name/nm0004753","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NzAzNzE5N15BMl5BanBnXkFtZTcwMjMyODM0MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1974","placeOfBirth":" Bismarck, North Dakota, USA","birthName":"Leslie Louise Bibb","height":"5' 9\" (1.75 m)","bio":"Leslie Louise Bibb was born in Bismarck, North Dakota, on November 17, 1974, and raised in Nelson County, Virginia. Later she and her mother, along with her three older sisters, moved to Richmond, where Leslie attended an all-girls Catholic high school, St. Gertrude. In 1990 The Oprah Winfrey Show (1986) and the Elite Agency held a nationwide modeling search; Leslie's mother took photos of her then 16-year-old daughter and sent them in. Although Leslie wasn't impressed with the photos, the judges--John Casablancas, Naomi Campbell, Linda Evangelista and Iman--were, and they picked her as the winner. After finishing her junior year, Leslie flew to New York City and signed a contract with Elite. She modeled over the summer, and went on a trip to Japan. She returned home for her senior year and graduated in 1992, then decided to forgo a full-time modeling career to attend the University of Virginia. After a single semester, however, she dropped out and moved to New York City. She attended the William Esper acting studio for three years and took nine months off in which she did more modeling in Europe. Her photographs have appeared in such magazine as Maxim and FHM. Leslie had her first film role in the comedy Private Parts (1997), which was followed by her first television series (where she replaced the departed Susan Walters as the female lead) in the second season of The Big Easy (1996) on USA. Unfortunately, the show was canceled just months later. In 1999 she appeared as the lead character on the WB Network television series Popular (1999). The show was a success among teenagers, and led Leslie to more recognizable film roles, such as The Skulls (2000) and See Spot Run (2001). Most recently she has appeared as intern Erin Harkins in ER (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NzAzNzE5N15BMl5BanBnXkFtZTcwMjMyODM0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004753","name":"Leslie Bibb","nicknames":["The Bibbster, Lulu"],"idIMDB":"nm0004753"},"actorId":"nm0004753","character":"Meg","urlCharacter":"http://www.imdb.com/character/ch0497798","main":true},{"actorName":"Kate del Castillo","urlProfile":"http://www.imdb.com/name/nm0215487","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzODI3MzU2NTReQTJeQWpwZ15BbWU4MDgwMDg0Nzcx._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 October 1972","placeOfBirth":" Mexico City, Distrito Federal, Mexico","birthName":"Kate del Castillo Negrete Trillo","height":"5' 5\" (1.65 m)","bio":"One of Mexico's most acclaimed and popular actresses, Kate del Castillo broke through in America as a result of her award-winning performance in the hit Fox Searchlight/Weinstein movie Under the Same Moon (2007), which is to date the highest-grossing Spanish-language theatrical release in U.S. history. Kate is starring in the coveted role of \"Queen of the South\" in La Reina del Sur (2011) a short form prime-time telenovela for Telemundo (NBC/Universal) and Antena 3 (Spain.) This adaptation of the bestseller by Spanish novelist Arturo Perez-Reverte. drew more than 8.1 million viewers in its debut week, making it the most successful telenovela premiere week in the web's history. It continues to break records attracting male viewers and non-Spanish speaking viewers. Del Castillo appeared as a guest star in six episodes of the fifth season of the Showtime hit comedy series _Weeds_. She starred as 'Pilar Zuazo,' a powerful Mexican crime boss who threatened Nancy (Mary-Louise Parker) and Esteban's romance then hit with a mallet by Nancy's son. Del Castillo recently starred in Univision.com's first-ever webnovela (which she co-produced), \"Vidas Cruzadas\" (Crossed Lives). The series was a huge success and generated more than two million video streams through September 15, 2009 making it one of the three most-watched online properties ever according to the network. L'Oréal Paris signed del Castillo to an exclusive U.S. contract as a spokesperson for the company and its beauty brands. The advertising was shot in Los Angeles and Paris and is currently appearing in the U.S. and Mexico. The California Ford dealers tapped her as its spokesperson to star in their television and radio ads. The History Channel named her Network Spokesperson for Hispanic Heritage Month in 2007. Kate del Castillo, was appointed Ambassador for the Mexican Commission on Human Rights to combat human trafficking in 2009, and launched the Blue Heart campaign in Mexico City with U.N. Goodwill Ambassador Mira Sorvino in 2010.. She began her acting career as a child, but it wasn't until the enormously successful telenovela \"Muchachitas\" that she became a full-fledged star in Mexico. She went on to become the leading ingénue of nine telenovelas, including \"Ramona\" and \"La Mentira\" taking them to the top of the Nielsen charts every time. Her telenovelas have aired multiple times in more than 100 countries worldwide. Kate received various accolades for her critically acclaimed performance as a Bolivian dancer in American Visa (2005) including \"Best Actress\" awards in film festivals in Spain and Brazil, and a \"Best Actress\" nomination at the Ariel Awards, Mexico's equivalent to the Oscars. In the United States, the movie premiered at the AFI Film Festival in Los Angeles, to a sold-out crowd. She also did a cameo in Bordertown (2006) as Antonio Banderas's long-suffering wife. Kate returned to her theater roots in Mexico for a sold-out eight week theatre run in the two character David Harrower play \"Blackbird\" (\"Pájaro Negro.) She won the \"Best Actress\" award from the Theatre Critics Association in Mexico. Among her many awards, Kate received the \"Outstanding Performance in a Motion Picture\" award for her performances in _Trade_ and Under the Same Moon (2007) by the National Hispanic Media under the umbrella of the National Latino Media Council. In August 2008, she won the Imagen \"Best Actress\" award for \"Under the Same Moon.\" Kate has graced the covers of the top Spanish-language magazines, and was People en Español's 2007 cover Actress of the Year, as well as one of their \"Most Beautiful People.\" On September 13, 2009, Kate served as Grand Marshall in Los Angeles' Mexican Independence Day Parade. Kate was the voice of Sally Carrera in the Spanish version of Pixar/Disney's Cars (2006) and will soon appear in the animated Rio (2011)_ as a bird/wife to George Lopez. She made her crossover debut on television in the U.S. in the Golden Globe-nominated PBS series American Family (2002) alongside Edward James Olmos. She is currently developing a project for television, which she hopes will showcase her love of extreme sports. She published in Mexico her first novel called \"Tuya\" based on her screenplay, and it's now in its third printing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzODI3MzU2NTReQTJeQWpwZ15BbWU4MDgwMDg0Nzcx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0215487","name":"Kate del Castillo","idIMDB":"nm0215487"},"actorId":"nm0215487","character":"Alexis","urlCharacter":"http://www.imdb.com/character/ch0497799","main":true},{"actorName":"Henry Simmons","urlProfile":"http://www.imdb.com/name/nm0005431","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0ODE2NzM3NTNeQTJeQWpwZ15BbWU4MDIxMTI0Mjkx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1970","placeOfBirth":" Stamford, Connecticut, USA","birthName":"Henry Oswald Simmons Jr.","height":"6' 4\" (1.93 m)","bio":"Henry Simmons was born in Stamford, Connecticut, one of three children to Aurelia, a school teacher, and Henry Simmons, Sr., an IRS agent. One of his sisters is his twin. Simmons earned a basketball scholarship at Franklin Pierce College in New Hampshire. He graduated with a business degree and went to work for a Stamford financial firm. He quickly realized that was not his calling and left to pursue acting. He moved to New York City to study and pursue a career in acting. His first acting job was the movie Above The Rim, starring Tupac Shakur. He made his TV debut in a \"Saturday Night Live\" skit, that infamously starred Marin Lawrence. He then got numerous guest star roles on television, roles in film, as well as making his New York theater debut in William Inge's Boy In The Basement. This led to a continuous role on the soap opera \"Another World\" where he worked for two years. He then moved to Los Angeles and went on to star on \"NYPD Blue\" for six seasons.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0ODE2NzM3NTNeQTJeQWpwZ15BbWU4MDIxMTI0Mjkx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005431","name":"Henry Simmons","idIMDB":"nm0005431"},"actorId":"nm0005431","character":"Jeffrey","urlCharacter":"http://www.imdb.com/character/ch0497800","main":true},{"actorName":"Mirage Moonschein","urlProfile":"http://www.imdb.com/name/nm5073110","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzU1MzE3N15BMl5BanBnXkFtZTgwOTAwMjgwNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Mirage Moonschein is an actress, known for No Good Deed (2014) and Josephine (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzU1MzE3N15BMl5BanBnXkFtZTgwOTAwMjgwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5073110","name":"Mirage Moonschein","idIMDB":"nm5073110"},"actorId":"nm5073110","character":"Ryan","urlCharacter":"http://www.imdb.com/character/ch0337167","main":true},{"actorName":"Kenny Alfonso","urlProfile":"http://www.imdb.com/name/nm0019171","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NzM5MzM0OF5BMl5BanBnXkFtZTcwOTA0NDc4OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 November 1966","placeOfBirth":" Tampa, Florida, USA","height":"6' 1\" (1.85 m)","bio":"Sharing a birthday with Bruce Lee and Jimi Hendrix didn't add pressure to the skinny Spanish kid, it only inspired ambition. Raised on baseball fields in Tampa, Florida, Kenny Alfonso spent most of his youth following a funny Dad and older brother around, learning to hit a curveball, and secretly wishing he was Kung Fu - Rock Star. After a brief stint in a few minor league camps, Kenny spent time as a State Attorney's Investigator and Pharmaceautical Rep before becoming a full-time actor in 1994. On film Kenny can be seen in \"The Bay\" Directed by Barry Levinson, \"Trouble with The Curve\" starring Clint Eastwood, Amy Adams and Justin Timberlake, \"The Hot Flashes\" starring Brooke Shields, Virginia Madsen, Wanda Sykes, Daryl Hannah and Camryn Manheim, \"The Change Up\" starring Ryan Reynolds and Jason Bateman amongst others. On TV Kenny returns this Summer for a 4th season as Attorney Joe Cummings in the Lifetime Network Hit \"Drop Dead Diva\". Other TV credits include; ABC Family's \"Christmas Cupid, the Lifetime mini-series \"Marry Me\", USA Network's \"Necessary Roughness\", Lifetime's \"Army Wives\", Fox's \"Prison Break\" and Tyler Perry's \"House of Payne\" on TBS. Kenny was the Co-host and 'Barkitect' of \"Barkitecture\", a 'how to' show on the D.I.Y. Network and HGTV. He has appeared in over 80 national and regional commercials and has performed on stage from coast-to-coast in his one-man shows and The Goods Variety Show which he co-created. He is also the co-founder and principle owner of The Goods® Brand. Founded in 1997, TGI is the Atlanta-based entertainment and clothing company connected by The Goods® Brand and its meaning of self-belief and empowerment. Kenny makes his home in Atlanta with daughter Jessy and long time partner, actress Melissa Ponzio.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NzM5MzM0OF5BMl5BanBnXkFtZTcwOTA0NDc4OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0019171","name":"Kenny Alfonso","idIMDB":"nm0019171"},"actorId":"nm0019171","character":"Javier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dan Caudill","urlProfile":"http://www.imdb.com/name/nm1128118","urlPhoto":"","biography":{"bio":"Dan Caudill is an actor and producer, known for No Good Deed (2014), V/H/S Viral (2014) and Blame Society (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1128118","name":"Dan Caudill","idIMDB":"nm1128118"},"actorId":"nm1128118","character":"Cop","urlCharacter":"http://www.imdb.com/character/ch0475294","main":true},{"actorName":"Tatom Pender","urlProfile":"http://www.imdb.com/name/nm3827494","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjk0OTAwNjI1MV5BMl5BanBnXkFtZTgwOTExNjQ1NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Tatom Pender is known for her work on Being Mary Jane (2013), Billy Lynn's Long Halftime Walk (2016) and The Immortal Life of Henrietta Lacks (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjk0OTAwNjI1MV5BMl5BanBnXkFtZTgwOTExNjQ1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3827494","name":"Tatom Pender","idIMDB":"nm3827494"},"actorId":"nm3827494","character":"Sally","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kelly O'Neal","urlProfile":"http://www.imdb.com/name/nm0641914","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMzM2MjYzNl5BMl5BanBnXkFtZTgwMDg5NjM4NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Kelly O'Neal, actress, filmmaker, and visual artist. Known for work in classical theater, musical theater, performance art, film, television, commercials, and stand-up comedy. She is the co-writer, director, and star of \"Gilda Sue Rosenstern: The Motion Picture!\" based on her original series for the web and live one-woman show, \"The Gilda Sue Rosenstern Computer Internet Show.\" Kelly has a Bachelor of Fine Arts degree in theater from Florida State University where she studied with Joseph Papp, Roger Rees, and Raul Julia among others. Her musical career has included stints as vocalist in jazz, and country bands, and she was a founding member of the 90's glam/funk musical extravaganza, Superchick and Goodpussy. In addition, Kelly's paintings and drawings have been exhibited in galleries and appeared on book covers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMzM2MjYzNl5BMl5BanBnXkFtZTgwMDg5NjM4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641914","name":"Kelly O'Neal","idIMDB":"nm0641914"},"actorId":"nm0641914","character":"Officer Jacobs","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Rhino Smith","urlProfile":"http://www.imdb.com/name/nm1183986","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MzI2Mjc3Ml5BMl5BanBnXkFtZTgwMTQ3Mzk4NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1969","placeOfBirth":" London, England, UK","birthName":"Mark Smith","height":"5' 10\" (1.78 m)","bio":"Mark was born in London however he has a hugely colorful heritage - Jamaican, Cherokee Indian, Ghanian, White and Chinese. This mix along with his Green eyes has given him a very distinctive look. Mark first catapulted onto our screens as Rhino in the massive ITV series, GLADIATORS where he reigned for five years. Before the show he had enjoyed huge success as a bodybuilder, winning the Junior British Championships and London Mens Heavyweights. His aggressive style first earned him his nickname, Rhino, which later became his Gladiator name. As Mark Rhino Smith the actor he has gone on to appear in many films and TV dramas. His film work includes the blockbuster BATMAN BEGINS directed by Christopher Nolan for Warners. ARGO as the Evil Villain, Pirates of the Caribbean 4 and CREED in the corner of the opponent to Michael B Jordan. 2016 will also see the release of CRIMINAL and SECURITY. He is the voice of the Rhino, Officer McHorn in Walt Disney's latest movie ZOOTOPIA. \"When I got the call from Disney to be the voice for their Rhino it was surreal\" says Mark. Alongside his film work 2015 saw him as a recurring guest on the Michael Bay production THE LAST SHIP. He also filmed for NCIS LA and in 2016 just filmed CRIMINAL MINDS, as the love interest for Paget Brewster. On the BBC's Robin Hood series he played the role of an arabian knight, Karim as well as working on other BBC drama's EastEnders and Synchronicity. For ITV, Hustle, The Bill and the Lynda La' Plante production Trial and Retribution. My motto has always been #BelieveAndAchieve. Thanks to my wife and my family and all my friends for all your love and support.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MzI2Mjc3Ml5BMl5BanBnXkFtZTgwMTQ3Mzk4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1183986","name":"Mark Rhino Smith","nicknames":["Rhino"],"idIMDB":"nm1183986"},"actorId":"nm1183986","character":"EMT","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bobbie Elzey","urlProfile":"http://www.imdb.com/name/nm2522965","urlPhoto":"","biography":{"bio":"Bobbie Elzey is an actress, known for No Good Deed (2014), No Soliciting (2013) and The Bridge (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2522965","name":"Bobbie Elzey","idIMDB":"nm2522965"},"actorId":"nm2522965","character":"Landlord","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leon Lamar","urlProfile":"http://www.imdb.com/name/nm0482799","urlPhoto":"","biography":{"bio":"Leon Lamar is known for his work on The Hunger Games: Catching Fire (2013), Run Ronnie Run (2002) and The Legend of Bagger Vance (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0482799","name":"Leon Lamar","idIMDB":"nm0482799"},"actorId":"nm0482799","character":"McKinley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Brennan","urlProfile":"http://www.imdb.com/name/nm0107285","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmRjYmU5NDctYTA0Yy00NTZiLTliOTUtOTc0YzI0NmVlZDJhL2ltYWdlXkEyXkFqcGdeQXVyMjEzMDg3MDg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Frank Brennan is known for his work on Looper (2012), Abraham Lincoln: Vampire Hunter (2012) and Need for Speed (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmRjYmU5NDctYTA0Yy00NTZiLTliOTUtOTc0YzI0NmVlZDJhL2ltYWdlXkEyXkFqcGdeQXVyMjEzMDg3MDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0107285","name":"Frank Brennan","idIMDB":"nm0107285"},"actorId":"nm0107285","character":"Chairman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wilbur Fitzgerald","urlProfile":"http://www.imdb.com/name/nm0280409","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxMjQyMjU1NF5BMl5BanBnXkFtZTgwOTc2NDE2NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Wilbur Fitzgerald is an actor and attorney from Georgia, known for his TV work on series including In the Heat of the Night (1989-1995), Friday Night Lights (2007), Prison Break (2006-2008), and Drop Dead Diva (2009-2014), and for film work including The Hunger Games: Catching Fire (2013), The East (2013), The Curious Case of Benjamin Button (2008). Wilbur is a member in good standing of the Georgia Bar (admitted in 1973).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxMjQyMjU1NF5BMl5BanBnXkFtZTgwOTc2NDE2NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0280409","name":"Wilbur Fitzgerald","idIMDB":"nm0280409"},"actorId":"nm0280409","character":"Dr. Ross","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2011159","urlIMDB":"http://www.imdb.com/title/tt2011159","business":{"budget":{"money":"$13,200,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$46,532,221","country":"USA","day":"28","month":"09","year":"2014","remarks":""}],"weekendGross":[{"money":"$4,509,127","country":"USA","day":"28","month":"09","year":"2014","remarks":"2,130 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 24 min (84 min)"],"soundMix":["SDDS","Datasat","Dolby Digital"],"color":["Color (ACES)"],"aspectRatio":["2.35 : 1"],"camera":["Sony CineAlta F65, Leica Summilux-C and Angenieux Optimo Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["SRMemory"],"cinematographicProcess":["Digital Intermediate (4K) (master format)","F65 RAW (4K) (source format)"],"printedFilmFormat":["35 mm (anamorphic)","D-Cinema"]},"rating":"5.6","metascore":"26","filmingLocations":[{"location":"Atlanta, Georgia, USA"}],"rated":"PG-13","awards":[{"award":"BET Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won BET Award","categories":[{"category":"Best Actress","names":[{"name":"Taraji P. Henson","id":"nm0378245","role":null},{"name":"Empire","id":"tt3228904","role":null},{"name":"Think Like a Man Too","id":"tt2239832","role":null},{"name":"From the Rough","id":"tt1704586","role":null}]}]},{"titleAwardOutcome":"Nominated BET Award","categories":[{"category":"Best Actor","names":[{"name":"Idris Elba","id":"nm0252961","role":null},{"name":"Luther","id":"tt1474684","role":null}]}]}]},{"award":"Image Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won Image Award","categories":[{"category":"Outstanding Actress in a Motion Picture","names":[{"name":"Taraji P. Henson","id":"nm0378245","role":null}]}]},{"titleAwardOutcome":"Nominated Image Award","categories":[{"category":"Outstanding Actor in a Motion Picture","names":[{"name":"Idris Elba","id":"nm0252961","role":null}]}]}]}],"votes":"13,728","type":"Movie","companyCreditsSimple":[{"idCompany":"co0010568","name":"Screen Gems"},{"idCompany":"co0453699","name":"Will Packer Productions"}],"keywords":{"keywords":["psychopath","home invasion","three word title","police officer shot in the chest","police officer shot","police officer killed","police officer","tied feet","homicidal maniac","mass murder","psycho killer","psycho film","killer","hostage","sadistic","body count","blood","madman","sociopath","escaped criminal","escaped killer","serial murder","murderer","psychopathic killer","terror","bad guy","villain","maniac","psycho","human monster","slasher","serial killer","grim","deadly","house","deranged","mother daughter relationship","villain played by lead actor"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:45:02"}}