{"data":{"movies":[{"title":"Electric Boogaloo","originalTitle":"Electric Boogaloo: The Wild, Untold Story of Cannon Films","year":"2014","releaseDate":"20150605","directors":[{"name":"Mark Hartley","id":"nm0366867"}],"writers":[{"name":"Mark Hartley","id":"nm0366867"}],"runtime":"106 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDZjNmQzOGMtM2VkMy00NGFjLWE5ZTAtNmEzNjVhZDFiZWRmXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["Australia","USA","Israel","UK"],"languages":["English"],"genres":["Documentary"],"plot":"A documentary about Menahem Golan and Yoram Globus - two movie-obsessed cousins whose passion for cinema changed the way movies were made and marketed - and the tale of how this passion ultimately led to the demise of the company they built together.","simplePlot":"The history of the independent film company, The Cannon Film Group, Inc..","actors":[{"actorName":"Sam Firstenberg","urlProfile":"http://www.imdb.com/name/nm0278735","urlPhoto":"","biography":{"dateOfBirth":"13 March 1950","placeOfBirth":" Poland","birthName":"Shmulik Firstenberg","bio":"Since 1980 Sam Firstenberg has been in the independent filmmaking field. Directing 22 theatrical feature films since completing his graduate studies in film at Loyola Marymount University. One More Chance (1983), starring Kirstie Alley, won prizes in major film festivals and sparked the beginning of his career as a director. Subsequent films have become commercial hits and cult classics, especially the \"American Ninja\" series starring Michael Dudikoff and the break-dance phenomenon Breakin' 2: Electric Boogaloo (1984). Born in Poland, he grew up in Jerusalem, Israel. In 1972 he moved to the US where \"Shmulik\" became \"Sam\", and he completed his graduate studies in film at Loyola Marymount University in Los Angeles, California, where he resides with his wife and three daughters.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0278735","name":"Sam Firstenberg","idIMDB":"nm0278735"},"actorId":"nm0278735","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Paulsen","urlProfile":"http://www.imdb.com/name/nm0667299","urlPhoto":"","biography":{"bio":"To fans of 1980s prime time soap, David Paulsen is known as the guy who tried to make Dynasty more human in the last season (1988-89). Or perhaps \"the guy who tried to turn Dynasty into Dallas\" in the final season. For a few seasons Dynasty marched along with its so-bad-it's-good method of acting. In 1988, after just leaving several years of Dallas, Paulsen moved onto Dynasty and attempted to replace the show's melodramatic acting with a more happy and realistic tone. Now, all of a sudden, the Dynasty cast would be seen making light conversation, smiling and making jokes. Some viewers welcomed the change while many others single out Paulsen as the guy who killed Dynasty.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0667299","name":"David Paulsen","idIMDB":"nm0667299"},"actorId":"nm0667299","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Luigi Cozzi","urlProfile":"http://www.imdb.com/name/nm0185524","urlPhoto":"","biography":{"dateOfBirth":"7 September 1947","placeOfBirth":" Busto Arsizio, Italy","bio":"Luigi Cozzi was born on September 7, 1947 in Busto Arsizio, Italy. He is a director and writer, known for Contamination (1980), Hercule (1983) and Starcrash (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0185524","name":"Luigi Cozzi","idIMDB":"nm0185524"},"actorId":"nm0185524","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Menahem Golan","urlProfile":"http://www.imdb.com/name/nm0324875","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNDA0NDM4NV5BMl5BanBnXkFtZTcwNzE2MDkwMw@@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1929","placeOfBirth":" Tiberias, Palestine [now Israel]","birthName":"Menahem Globus","bio":"Menahem Golan was born Menahem Globus to parents of Polish decent in Tiberias, Israel, in May 1929. In his early years, he was a pilot for the fledgling Israeli Air Force, changing his surname to Golan for patriotic reasons in 1948. A few years later, he took the first step towards his future career by attending the Old Vic Theatre School in London. After returning to Israel, he produced for theater, until joining producer Roger Corman as an assistant on The Young Racers (1963). Golan's debut film in partnership with his younger cousin Yoram Globus was El Dorado (1963). The two cousins set up Noah Films to produce for the Israeli market. Golan's role was as producer and the creative partner, with Globus as the financial expert. The company was first recognized overseas when its production Sallah (1964) won an Oscar nomination for Best Foreign Language Film and then won the Golden Globe in the same category in 1965. However, the cousins were desperate to break into the international market. Some of their films had been picked up for distribution in America, such as Kazablan (1973) by MGM, but this was not enough. In 1979 the pair bought control of a failing production company, The Cannon Group Inc., from Dennis Friedland and Christopher C. Dewey, and it was this company that gave them international renown. Under their control, the Cannon Group grew from a small company making a few obscure pictures a year to a studio that produced 35 pictures in 1987 alone. They developed a large, independent, and international empire, with production, distribution, and exhibition interests across Europe. Golan and Globus hit their peak with Cannon in the mid-1980s, signing Sylvester Stallone for a record US$13 million in 1983 for Over the Top (1987) and purchasing the UK's Thorn-EMI Screen Entertainment in 1986. This last deal led to their ownership of the ABC cinema circuit and Elstree Studios in Britain. However, by 1987, the money was starting to run out. Many of their movies were not making enough at the box office despite the cousins' wide cinema ownership, and they had taken on a lot of debt during their rapid growth, making more expensive pictures in the process. They were initially rescued by Warner Bros., which took distribution rights to Cannon's better films--for example, Superman IV: The Quest for Peace (1987), based on a character that Warner already owned--and also took an interest in some of its assets. The end of Cannon came in 1989 when, virtually bankrupt, the company was bought by the now-disgraced financier Giancarlo Parretti and renamed Pathé Communications (after the new MGM-Pathé collapsed in 1992, Globus produced pictures with Christopher Pearce, which were released under a resurrected Cannon Pictures label. The last of these was American Cyborg: Steel Warrior (1993) before the company folded for good). Golan fell out with Parretti and Globus, leaving Pathé, and starting 21st Century Pictures. He produced a number of films that received widespread distribution, such as Death Wish V: The Face of Death (1994) and Captain America (1990), but by the mid-1990s this company had folded, too. Golan's name was later linked with other new companies, such as International Dynamic Pictures and Magic Entertainment, and he rejoined cousin Yoram for both. However, the two soon fell out again and went their separate ways, with Golan writing and directing for other producers in the interim. Golan's latest company is New Cannon Inc., and his recent works include Crime and Punishment (2002) and Open Heart (2002). Unfortunately for his fans, it now seems unlikely that Golan will recreate the success of his heyday. Menahem Golan has long been criticized (sometimes unfairly) for an emphasis on quantity rather than quality. It's true that some of the movies he has produced have been laughable or unwatchable. However, now out of the limelight of a critical industry, some of his company's once-derided films have achieved cult status, such as Mona Lisa (1986), Godfrey Reggio's Powaqqatsi (1988), and the \"Lemon Popsicle\" series. Golan's ongoing drive, energy, and past contribution to the world of cinema will undoubtedly and belatedly be recognized for the achievement this represents.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNDA0NDM4NV5BMl5BanBnXkFtZTcwNzE2MDkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0324875","name":"Menahem Golan","idIMDB":"nm0324875"},"actorId":"nm0324875","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alain Jakubowicz","urlProfile":"http://www.imdb.com/name/nm0416039","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNjk1ODE0N15BMl5BanBnXkFtZTgwNDcwMTg2NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Alain Jakubowicz is an editor and production manager, known for The Texas Chainsaw Massacre 2 (1986), The Delta Force (1986) and The Death and Life of Bobby Z (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNjk1ODE0N15BMl5BanBnXkFtZTgwNDcwMTg2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0416039","name":"Alain Jakubowicz","idIMDB":"nm0416039"},"actorId":"nm0416039","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Itzik Kol","urlProfile":"http://www.imdb.com/name/nm0463817","urlPhoto":"","biography":{"dateOfBirth":"1932","placeOfBirth":" Petah Tikvah, Palestine","bio":"Itzik Kol was born in 1932 in Petah Tikvah, Palestine. He was a producer and production manager, known for The Policeman (1971), Hansel and Gretel (1987) and I Love You Rosa (1972). He died on July 8, 2007 in Kfar Saba, Israel.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0463817","name":"Itzik Kol","idIMDB":"nm0463817"},"actorId":"nm0463817","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Hartman","urlProfile":"http://www.imdb.com/name/nm0366997","urlPhoto":"","biography":{"bio":"Michael Hartman is a producer and production manager, known for Robin Hood: Prince of Thieves (1991), Delta Force 2: The Colombian Connection (1990) and Braddock: Missing in Action III (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0366997","name":"Michael Hartman","idIMDB":"nm0366997"},"actorId":"nm0366997","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Quentin Falk","urlProfile":"http://www.imdb.com/name/nm4579111","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Quentin Falk yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4579111","name":"Quentin Falk","idIMDB":"nm4579111"},"actorId":"nm4579111","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Boaz Davidson","urlProfile":"http://www.imdb.com/name/nm0203246","urlPhoto":"","biography":{"dateOfBirth":"8 November 1943","placeOfBirth":" Tel Aviv, Palestine [now Israel]","bio":"Boaz Davidson was born on November 8, 1943 in Tel Aviv, Palestine. He is a producer and writer, known for Undisputed 2: Last Man Standing (2006), The Expendables (2010) and The Expendables 2 (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0203246","name":"Boaz Davidson","idIMDB":"nm0203246"},"actorId":"nm0203246","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Stout","urlProfile":"http://www.imdb.com/name/nm0832898","urlPhoto":"","biography":{"dateOfBirth":"1949","placeOfBirth":" Salt Lake City, Utah, USA","bio":"William Stout was born in 1949 in Salt Lake City, Utah, USA. He is known for his work on Pan's Labyrinth (2006), First Blood (1982) and The Mist (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0832898","name":"William Stout","idIMDB":"nm0832898"},"actorId":"nm0832898","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Womark","urlProfile":"http://www.imdb.com/name/nm0003720","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3Njc1OTMzN15BMl5BanBnXkFtZTgwMzA0Mjg5OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"As Producer of Ang Lee's Academy Award-winning \"Life of Pi (2012)\", Womark spent close to three years working with Ang Lee in an effort to bring this internationally renown award winning book to the big screen. Prior to this, Womark executive-produced \"G.I. Joe: The Rise of Cobra (2009)\", \"Stardust (2007), and \"The Chronicles of Riddick (2004). He previously worked with Ang Lee as Associate Producer/UPM on \"Hulk (2003)\". Womark began his career as an Assistant Director, working on over 20 movies, including the award-winning \"A Dangerous Woman (1993)\" with Debra Winger and Barbara Hershey; \"_Paris Trout (1991)_qv)\" starring Dennis Hopper; as well as the Emmy-Award winning miniseries \"Family of Spies (1990).\" He has also served as Associate Producer/UPM on \"'Dr Seuss''s How the Grinch Stole Christmas (2000)\", \"Jurassic Park III (2001)\" and the original \"The X Files (1998)\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3Njc1OTMzN15BMl5BanBnXkFtZTgwMzA0Mjg5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003720","name":"David Womark","idIMDB":"nm0003720"},"actorId":"nm0003720","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sybil Danning","urlProfile":"http://www.imdb.com/name/nm0000356","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQzMDcxODgxMF5BMl5BanBnXkFtZTgwOTExODAyOTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1952","placeOfBirth":" Wels, Upper Austria, Austria","birthName":"Sybille Johanna Danninger","height":"5' 7\" (1.7 m)","bio":"Tall, leggy, buxom and statuesque 5'7\" blonde beauty Sybil Danning reigns supreme as one of the sexiest, most dynamic and commanding actresses to achieve cult B-movie queen status. She was born Sybille Johanna Danninger on May 24, 1952, in Wels, Austria, the daughter of a US Army major father and an Austrian mother. She grew up on army bases in such places as New Jersey, Maryland and Sacramento, California. Sybil attended Etontown's Star of the Sea Catholic School. At age 14 she worked for her uncle as a dental assistant. Two years later she moved to Vienna, Austria, and worked for a dental supply company. She then relocated to Salzburg and worked as an assistant to a top oral surgeon. Danning then enrolled in the Buchner School of Cosmetology in Salzburg and received a diploma in facial treatment, decorative make-up, manicure and body massage. She soon began doing fashion shows and photo layouts. Danning made her film debut as Lorelei in Komm nur, mein liebstes Vögelein (1968). She next portrayed Kriemhild in The Long Swift Sword of Siegfried (1971). Sybil studied for three years with noted Munich drama coach Anne-Marie Hanschke. Sybil made memorable appearances in such mainstream features as Barbe-bleue (1972), The Three Musketeers (1973), Crossed Swords (1977) and The Concorde... Airport '79 (1979). She also continued to act in such enjoyably lowbrow exploitation items as Naughty Nymphs (1972), Das Mädchen mit der heißen Masche (1972) and Cat in the Cage (1978). Danning was especially excellent and impressive as the fierce Valkyrie warrior Saint-Exmin in the science-fiction cult classic Battle Beyond the Stars (1980). Other notable roles are tough prison inmate Ericka in the babes-behind-bars classic Chained Heat (1983), a formidable female swordfighter in I sette magnifici gladiatori (1983), wicked werewolf queen Stirba in Howling II: ... Your Sister Is a Werewolf (1985), a cunning femme fatale English professor in They're Playing with Fire (1984), the Queen of the Moon in the hilarious Amazon Women on the Moon (1987), the strict Warden Sutter in the amusing chicks-in-chains parody Reform School Girls (1986), an alien queen in The Phantom Empire (1988) and a rugged lady bounty hunter in L.A. Bounty (1989). Sybil has done guest spots on the television series Vega$ (1978), Simon & Simon (1981), V (1984), Masquerade (1983), The Fall Guy (1981), Deadly Nightmares (1983), Street Hawk (1985) and Superboy (1988). She did a ten-page pictorial for the August 1983 issue of \"Playboy\". Outside of acting, Danning has also worked on several movies as a producer and wrote the story for \"L.A. Bounty\". After a regrettably lengthy absence from acting, Sybil Danning has made a welcome comeback by appearing as an evil Nazi villainess in the \"Werewolf Women of the SS\" mock trailer for Grindhouse (2007) and a nurse in Rob Zombie's remake Halloween (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQzMDcxODgxMF5BMl5BanBnXkFtZTgwOTExODAyOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000356","name":"Sybil Danning","nicknames":["The Queen of the B movies"],"idIMDB":"nm0000356"},"actorId":"nm0000356","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roni Ya'ackov","urlProfile":"http://www.imdb.com/name/nm0944715","urlPhoto":"","biography":{"bio":"Roni Ya'ackov is a production manager and producer, known for Bloodsport (1988), Over the Top (1987) and Masters of the Universe (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0944715","name":"Roni Ya'ackov","idIMDB":"nm0944715"},"actorId":"nm0944715","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yftach Katzur","urlProfile":"http://www.imdb.com/name/nm0441955","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAzZTQxMzYtZGU2ZC00MDJhLTkzOGYtMDc1ODRkZTBiMDExXkEyXkFqcGdeQXVyMjMyMzI4MzY@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1958","placeOfBirth":" Israel","bio":"Yiftach Katzur started his acting career in 1975 at the age of 17 in Peter Shaffer's play Equus where he played the lead part of Alan Strang. He began his film career in the 'Lemon Popsicle' movies as Benji. He went on to star in other Israeli movies such as \"Atalia\", and a small role in \"Soldier of the Night\". In 1984 he starred in the Robert Mitchum movie \"The Ambassador\" which also starred Zachi Noy. Yiftach Katzur appeared in a popular talk-show on Israeli TV, just to give to Anat Atzmon (Nikki, from Lemon Popsicle) the present Benji intended to give to Nikki at the end of the film. His last film is reported as being \"Gentila\" in 1997 which won the 1998 Haifa Film Festival Award For Best Film. He has since abandoned his acting career and is now running an advertising business of his own called Acatmedia Israel. He is married and has a daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAzZTQxMzYtZGU2ZC00MDJhLTkzOGYtMDc1ODRkZTBiMDExXkEyXkFqcGdeQXVyMjMyMzI4MzY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0441955","name":"Yftach Katzur","idIMDB":"nm0441955"},"actorId":"nm0441955","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dan Wolman","urlProfile":"http://www.imdb.com/name/nm0938630","urlPhoto":"","biography":{"dateOfBirth":"1941","placeOfBirth":" Jerusalem, Palestine [now Israel]","bio":"Dan Wolman was born in 1941 in Jerusalem, Palestine. He is a director and writer, known for Tied Hands (2006), Ben's Biography (2003) and Valley Of Strength (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0938630","name":"Dan Wolman","idIMDB":"nm0938630"},"actorId":"nm0938630","character":"Himself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2125501","urlIMDB":"http://www.imdb.com/title/tt2125501","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 46 min (106 min)"],"soundMix":null,"color":["Color","Black and White (archive footage)"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.4","filmingLocations":[],"rated":"R","awards":[],"votes":"3,713","type":"Movie","companyCreditsSimple":[{"idCompany":"co0273554","name":"Fury Productions"},{"idCompany":"co0469295","name":"RatPac Documentary Films"},{"idCompany":"co0244345","name":"XYZ Films"}],"keywords":{"keywords":["movie studio","filmmaking","archive footage","schlockmeister","schlock","movie producer","film producer","actor","action movie","film history","title based on song"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 21:53:47"}}