{"data":{"movies":[{"title":"Into the Storm","originalTitle":"","year":"2014","releaseDate":"20140808","directors":[{"name":"Steven Quale","id":"nm0702797"}],"writers":[{"name":"John Swetnam","id":"nm4291727"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwODI2ODc3Nl5BMl5BanBnXkFtZTgwMDQwNjkwMjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Thriller"],"plot":"In the span of a single day, the town of Silverton is ravaged by an unprecedented onslaught of tornadoes. The entire town is at the mercy of the erratic and deadly cyclones, even as storm trackers predict the worst is yet to come. Most people seek shelter, while others run towards the vortex, testing how far a storm chaser will go for that once-in-a-lifetime shot.","simplePlot":"Storm trackers, thrill-seekers, and everyday townspeople document an unprecedented onslaught of tornadoes touching down in the town of Silverton.","actors":[{"actorName":"Richard Armitage","urlProfile":"http://www.imdb.com/name/nm0035514","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU1N2VmMjEtY2M1ZS00N2M4LWI4NGMtYjkwYTgxMzY4YTFhL2ltYWdlXkEyXkFqcGdeQXVyMjQxODUxMjA@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 August 1971","placeOfBirth":" Leicester, Leicestershire, England, UK","birthName":"Richard Crispin Armitage","height":"6' 2½\" (1.89 m)","bio":"Richard Crispin Armitage was born and raised in Leicester, England, to Margaret (Hendey), a secretary, and John Armitage, an engineer. He attended Pattison College in Binley Road, Coventry, and studied at LAMDA (the London Academy of Music and Dramatic Art). His first appearance on the screen was in a small role in This Year's Love (1999), but it was Sparkhouse (2002) that gave him a break-through role as the charming but a bit odd character of John Standring opposite Sarah Smart. After two guest-roles in Cold Feet (1997) in 2003 and Between the Sheets (2003), he landed a role as Steven in Frozen (2005), which eventually led him to play the lead role in the big hit BBC drama North & South (2004). Other than appearing on screen, he has also appeared on stage--in, for example, Macbeth and Hamlet.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU1N2VmMjEtY2M1ZS00N2M4LWI4NGMtYjkwYTgxMzY4YTFhL2ltYWdlXkEyXkFqcGdeQXVyMjQxODUxMjA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0035514","name":"Richard Armitage","idIMDB":"nm0035514"},"actorId":"nm0035514","character":"Gary","urlCharacter":"http://www.imdb.com/character/ch0461225","main":true},{"actorName":"Sarah Wayne Callies","urlProfile":"http://www.imdb.com/name/nm0915637","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEzODk3OTE3M15BMl5BanBnXkFtZTcwMDcyMzA1Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1977","placeOfBirth":" La Grange, Illinois, USA","birthName":"Sarah Anne Callies","height":"5' 9\" (1.75 m)","bio":"Sarah Wayne Callies was born in La Grange, Illinois, and was raised in Honolulu, Hawaii, the daughter of Valerie Wayne, an professor of English, and David E. Callies, a law professor. She graduated from Dartmouth College and received a Master of Fine Arts degree from Denver's National Theatre Conservatory. Her breakout role was on the FOX TV series Prison Break (2005), playing the role of Dr. Sara Tancredi. However, she is perhaps best known for her role as \"Lori Grimes\" in the hit AMC series The Walking Dead (2010). Additional television credits include the role of \"Officer Jane Porter\" on the WB's Tarzan (2003) as well as a recurring role on CBS' Queens Supreme (2003) with Oliver Platt. Callies has also appeared on Law & Order: Special Victims Unit (1999), and Dragnet (2003). She has also starred in three feature films, Bittersweet (2008), Stewart Hendler's Whisper (2007) for Universal Pictures and Barnet Bain's independent, The Celestine Prophecy (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEzODk3OTE3M15BMl5BanBnXkFtZTcwMDcyMzA1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0915637","name":"Sarah Wayne Callies","idIMDB":"nm0915637"},"actorId":"nm0915637","character":"Allison","urlCharacter":"http://www.imdb.com/character/ch0461226","main":true},{"actorName":"Matt Walsh","urlProfile":"http://www.imdb.com/name/nm0909768","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MDAyNzg4NF5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1964","placeOfBirth":" Chicago, Illinois, USA","height":"6' (1.83 m)","bio":"Matt Walsh was born on October 13, 1964 in Chicago, Illinois, USA. He is an actor and writer, known for Ted (2012), The Hangover (2009) and Due Date (2010). He has been married to Morgan Walsh since March 21, 2009. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MDAyNzg4NF5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0909768","name":"Matt Walsh","idIMDB":"nm0909768"},"actorId":"nm0909768","character":"Pete","urlCharacter":"http://www.imdb.com/character/ch0467867","main":true},{"actorName":"Max Deacon","urlProfile":"http://www.imdb.com/name/nm2666746","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Mzk5NzM1MF5BMl5BanBnXkFtZTgwMDMxNTczMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Max Deacon is an actor and writer, known for Into the Storm (2014), The Call Up (2016) and Summer in February (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Mzk5NzM1MF5BMl5BanBnXkFtZTgwMDMxNTczMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2666746","name":"Max Deacon","idIMDB":"nm2666746"},"actorId":"nm2666746","character":"Donnie","urlCharacter":"http://www.imdb.com/character/ch0467869","main":true},{"actorName":"Nathan Kress","urlProfile":"http://www.imdb.com/name/nm0470941","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzcwMTk4NzY5N15BMl5BanBnXkFtZTgwNTM3MjUwMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1992","placeOfBirth":" Glendale, California, USA","birthName":"Nathan Karl Kress","height":"5' 6½\" (1.69 m)","bio":"Known around the world for his lead role on Nickelodeon's hit show \"iCarly\", Nathan plays Freddie Benson, Carly's smitten next-door neighbor and technical producer of her web show. Now that iCarly has ended its stellar run, Nathan is breaking out into feature films, as a lead in \"Into the Storm,\" a Steve Quale tornado thriller for New Line Cinema, due to be released in August 2014. Born in Glendale, California, Nathan began acting at the age of three and quickly landed a feature film role as the voice of Easy the Chimp in \"Babe: Pig in the City.\" By fifth grade, he had landed a recurring role as a sketch performer on \"The Jimmy Kimmel Show\" playing various characters; one of his favorite being a young Simon Cowell of \"American Idol.\" Shortly thereafter, Nathan began to book guest-starring roles on such shows as \"Without a Trace,\" \"Standoff,\" \"The Suite Life of Zack and Cody,\" \"House MD,\" and \"Notes from the Underbelly.\" However, it was his guest role on Nickelodeon's top-rated show \"Drake and Josh\" that led the show's creator, Dan Schneider, to cast him in \"iCarly.\" Since then, Nathan has starred alongside Christopher Meloni in Nickelodeon's \"Gym Teacher: The Movie\" and has guest-starred on \"True Jackson, VP\" and \"CSI: Crime Scene Investigation.\" Recently, Nathan starred in NBC's movie for television, \"Game of Your Life,\" which revolved around college students studying video game design. His future plans are to continue acting and to attend college. As he is a die-hard Bruin fan, his number-one choice school is UCLA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzcwMTk4NzY5N15BMl5BanBnXkFtZTgwNTM3MjUwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0470941","name":"Nathan Kress","idIMDB":"nm0470941"},"actorId":"nm0470941","character":"Trey","urlCharacter":"http://www.imdb.com/character/ch0467870","main":true},{"actorName":"Alycia Debnam-Carey","urlProfile":"http://www.imdb.com/name/nm1486317","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MjUyMjMyMF5BMl5BanBnXkFtZTgwODI0MTM1OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Alycia Jasmin Debnam-Carey was born on July 20, 1993. She is an actress from Australia. She grew up in Sydney, and graduated from Newtown High School of the Performing Arts in 2011 where she was a percussionist. In 2010, in partnership with the Berlin Philharmonic, she and around 40 other musicians worked together, composed a piece together in a two week program. In her last year of school, Debnam-Carey took her HSC exams and managed to get top band in six of her courses. Debnam-Carey also received the Premier's award for receiving 90's in 6 subjects. Alycia has been acting since she was eight. She starred in a short feature called Martha's New Coat. She has also appeared in Dance Academy, McLeod's Daughter, among other television productions. She began to make her mark in Hollywood when she traveled to the U.S. for the first time at age 18. She starred as the youngest cast member in Next Stop Hollywood, a six-part documentary that followed six Australian actors as they competed for roles during the U.S. TV pilot season. Her mom, Leone Carey, is a television writer, and she accompanied Alycia on her journey. The documentary aired in 2013 on ABC1 in Australia. Alycia has since starred in major film productions, such as Into the Storm (2014). In addition, she has had large roles in many Australian short films, and in 2013 landed the lead role in the TV movie The Devil's Hand (2014). She starred in the unaired AMC pilot Galyntine, but unfortunately the series was not picked up. In 2014 Alycia began to guest-star in the second season of The CW's hit TV show The 100 as Commander Lexa. During San Diego Comic Con in July of 2015 it was announced that Lexa and Alycia would indeed return. On December 1, 2014, it was announced that she had been cast as Alicia (originally named Ashley), one of the lead roles, in the AMC series Fear The Walking Dead, the official companion series and prequel to The Walking Dead.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MjUyMjMyMF5BMl5BanBnXkFtZTgwODI0MTM1OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1486317","name":"Alycia Debnam-Carey","idIMDB":"nm1486317"},"actorId":"nm1486317","character":"Kaitlyn","urlCharacter":"http://www.imdb.com/character/ch0467871","main":true},{"actorName":"Arlen Escarpeta","urlProfile":"http://www.imdb.com/name/nm0260224","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODU4MDg5OF5BMl5BanBnXkFtZTgwMzY0MzIzODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1981","placeOfBirth":" Belize, Central America","birthName":"Arlen Alexander Escarpeta","height":"5' 8\" (1.73 m)","bio":"Arlen Escarpeta was born in Belize, Central America as Arlen Alexander Escarpeta. He is known for his work on Whitney (TV Movie) (2015), Final Destination 5 (2011), Into the Storm (2014) and Friday the 13th (2009). He currently resides in Los Angeles, California and has been able to make a name for himself within the world of TV, film, voiceover and print.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODU4MDg5OF5BMl5BanBnXkFtZTgwMzY0MzIzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0260224","name":"Arlen Escarpeta","idIMDB":"nm0260224"},"actorId":"nm0260224","character":"Daryl","urlCharacter":"http://www.imdb.com/character/ch0468284","main":true},{"actorName":"Jeremy Sumpter","urlProfile":"http://www.imdb.com/name/nm0838911","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NDMyODI3N15BMl5BanBnXkFtZTgwNzcwNDQyOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1989","placeOfBirth":" Monterey, California, USA","birthName":"Jeremy Robert Myron Sumpter","height":"6' (1.83 m)","bio":"Jeremy Robert Myron Sumpter was born on February 5, 1989 in Monterey, California, to Sandra (Johnson) and Gary Sumpter. He was raised in his mother's hometown, Mount Sterling, Kentucky. At a young age, he enjoyed mountain climbing and play with his friends like any other normal kid, but when he went to Lexington, Kentucky, to model, he won the numerous awards and met his manager Mark Robert. Soon after that, Jeremy, his twin sister Jessica Sumpter, his little sister Gigi Sumpter, and his mom and dad moved to Los Angeles, California. He started filming Local Boys (2002) and then Just a Dream (2002). His next movie was Frailty (2001), in which he played young Adam Meeks, opposite Bill Paxton and Matthew McConaughey. \"Bill had been one of my favorite actors so to be able to work with him was unbelievable,\" says Jeremy. The adult Adam Meeks was played by Matthew McConaughey. Next, Jeremy was chosen by Danny Glover to play Henry Sturbuck in the Showtime original film Just A Dream. \"Working with Danny was great, we had a great time filming in a small town in Utah,\" explains Jeremy. Jeremy received the \"Best Performance in a TV Movie, Mini-Series or Special - Leading Young Actor\" from the Young Artist Awards. Jeremy was able to use his surfing skills on his next film, \"Local Boys.\" This coming of age film was shot on location in southern California. \"This was a hard film to shoot since we were surfing at the beach almost everyday and there were all these girls around in bikinis,\" jokes Jeremy. After a worldwide search, Jeremy was chosen to play \"Peter\" in the P.J. Hogan film Peter Pan (2003). This was one of the most coveted roles in films for a teen actor in recent years. \"It was a part that I really wanted,\" says Jeremy, \"since I'd be able to fight pirates and fly around the stage on wires.\" Jeremy trained extensively in sword fighting and gymnastics prior to shooting the movie in Australia. Clubhouse (2004) was Jeremy's first television series, a dream role since he had always loved baseball and played little league when he was younger. Jeremy was cast in the role of Justin in Cyber Seduction: His Secret Life. After wrapping, he immediately went on to star in The Sasquatch Dumpling Gang in Oregon. A lot of the people from Napoleon Dynamite were involved in the film and it was a lot of fun for him to shoot. Jeremy shot \"Calvin Marshall\" in Oregon. Jeremy Sumpter shot the Warner Bros./New Line big budget film \"Into the Storm\" and the independent feature film \"Animal.\" \"The Squeeze,\" a feature film which was released in 2015 and starred Jeremy and Christopher McDonald. They teed off in a high stakes gambling matches careening throughout the South and landing in Las Vegas. Jeremy was also Co-Producer. Jeremy recently shot Take Down\" which is being distributed around the world. In the future, Jeremy hopes to also work behind the camera as a director and producer. In his spare time, he surfs, plays basketball, football, golf and shoots pool.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NDMyODI3N15BMl5BanBnXkFtZTgwNzcwNDQyOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0838911","name":"Jeremy Sumpter","idIMDB":"nm0838911"},"actorId":"nm0838911","character":"Jacob","urlCharacter":"http://www.imdb.com/character/ch0545625","main":true},{"actorName":"Lee Whittaker","urlProfile":"http://www.imdb.com/name/nm0924121","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDIxODMxMzA4MV5BMl5BanBnXkFtZTgwNDc0NTc4MTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"bio":"Lee Whittaker has worked extensively on both sides of the lens all over the world for over two decades. Lee Whittaker was born in North Carolina, USA, and started his career right out of high school with George Lucas in Japan. The George Lucas Super Live Adventure was the worlds first Hi-tech 25 million dollar live show celebrating the 20 year anniversary to Lucas Films. Whittaker began as one of the top stunt performers in the industry with two decades of elite work on some of Hollywoods biggest blockbuster films. After a decade's experience as a second unit director and stunt coordinator, Whittaker safely and creatively pushes the boundaries of designing & capturing the most intense extreme action through innovative styles of cinematography. While Mr. Whittaker still travels the world as a second unit action director, he also has a clear eye toward \"being the difference\" when it comes to addressing social causes like our world's 100 million homeless children who live on the streets. Lee is in development on a feature length version of \"Catching Fireflies\", his award winning short film. Writing scripts as well as music has kept him in multi-categories in a booming industry. \"Staying creative through a constant state of discovery & evolution has always been a goal of mine,\" Lee says which has always kept him outside the box.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDIxODMxMzA4MV5BMl5BanBnXkFtZTgwNDc0NTc4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0924121","name":"Lee Whittaker","idIMDB":"nm0924121"},"actorId":"nm0924121","character":"Lucas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kyle Davis","urlProfile":"http://www.imdb.com/name/nm1049386","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MzA3NTQ5NV5BMl5BanBnXkFtZTgwODA0NTQ5OTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1978","placeOfBirth":" Downey, California, USA","birthName":"Kyle Bradley Davis","height":"6' 1\" (1.85 m)","bio":"Actor Kyle Davis was born in Downey, California. He lived there until he moved at the age of 14, with his parents to Arizona. Kyle attended Sedona Red Rock High School and later he went on to study photography at Yavapi Community College. After his brief stay at Yavapi Community College, Kyle intended to enlist in the military, but months before departing, he was involved in a fight that left him blind in his left eye. In 1998 Kyle moved back to Southern California to pursue his dream at becoming a professional Skateboarder. A short while after moving he tore his ACL. Kyle's cousin pushed him to consider acting after the injury. Kyle began his acting career at the age of 20. For quick money, he got his first camera appearance on \"The Dating Game\" and started working as an extra for various shows and commercials. He was against using an acting coach and determined to teach himself. Kyle used a video camera and answering machine to help perfect his acting skills. Kyle learned the other end of the business when he took a job working with a talent agency. He also worked with several casting directors. He was later hired on as a professional reader, reading for Jamie Foxx in \"Collateral.\" Kyle got his SAG card after working on a Jack in the Box commercial. Since then his career took off. Kyle started doing guest spots on \"Felicity\", \"CSI\", \"The Shield\" and more. Most recently he was cast along with Sophia Bush and Sean Bean in Dave Meyers' remake of \"The Hitcher\". Kyle has been in over 70 commercials and 15 films and at least 20 television guest appearances. Kyle resides in North Hollywood with his wife 2 dogs and 3 cats.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MzA3NTQ5NV5BMl5BanBnXkFtZTgwODA0NTQ5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1049386","name":"Kyle Davis","idIMDB":"nm1049386"},"actorId":"nm1049386","character":"Donk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jon Reep","urlProfile":"http://www.imdb.com/name/nm1813499","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMTQ5Njc5N15BMl5BanBnXkFtZTcwNTc3NjgyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1972","placeOfBirth":" Hickory, North Carolina, USA","height":"5' 9\" (1.75 m)","bio":"Actor/Comedian Jon Reep was born in Hickory, NC. He lived there until he moved to Raleigh, NC in 1992. While attending North Carolina State University he began performing stand-up comedy at Goodnights comedy club. He graduated from NCSU in 1997 with a Bachelor of Arts degree in Theater, Mass Communication, and Public & Personal communication. After graduating Jon was employed at UNC-TV where he became the assistant director of such TV shows as \"North Carolina Now\" & \"Legislative Week in Review\", while at night simultaneously honing his skills as a stand-up comedian. In 1998 Jon left UNC-TV to pursue comedy full time. He traveled all over the country performing in comedy clubs and colleges in every state in America. In 2000, Jon was invited to perform at the Montreal Just for Laughs festival, and shortly thereafter moved to Los Angeles, CA to further is career as a stand-up comedian and actor. As an actor Jon has played the pot smoking farmer \"Raymus\" from the movie \"Harold and Kumar escape from Guantanamo Bay\", and the dim witted cop Gerald Bob from the ABC Sitcom \"Rodney\". He played a goodwill worker in Disney Channels \"Good Luck Charlie\" and was the HEMI guy in Dodge Truck's popular ad campaign. As a comedian he was the Winner of NBC's \"Last Comic Standing\" season 5. He's been on Comedy Central's \"Premium Blend\", the half-hour special \"Comedy Central Presents: Jon Reep\", & his on special \"Jon Reep: Metro Jethro\". He's been on TBS's \"Pit Stop Comedy\", NBC's \"Late Friday\" or CMT's \"Comedy Club\" & \"Comedy stage.\" Jon resides in Los Angeles with his wife and 2 dogs.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMTQ5Njc5N15BMl5BanBnXkFtZTcwNTc3NjgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1813499","name":"Jon Reep","nicknames":["The Hemi Guy"],"idIMDB":"nm1813499"},"actorId":"nm1813499","character":"Reevis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott Lawrence","urlProfile":"http://www.imdb.com/name/nm0493013","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTkyY2M5NmMtOWUwZi00OTIxLWE5ODQtYzgzNWMyMDM0ZTM0L2ltYWdlXkEyXkFqcGdeQXVyMTM0MjA0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 September 1963","placeOfBirth":" Los Angeles, California, USA","height":"6' 1\" (1.85 m)","bio":"Scott was born in Los Angeles and spent a lot of his childhood with his parents on picket lines campaigning for local civil rights. His father was the executive director of the University of Southern California, Community Services Center, and his mother worked for Operation Breadbasket and other organizations dedicated to improving economic conditions of black communities. After studying electrical engineering for two years at USC, he sat in on a friends acting class, was immediately bitten by the bug and auditioned for USC's Bachelor of Fine Arts acting conservatory the next semester. He started over as a freshman and completed the program in 1986. In 1987, Scott earned his SAG card on the feature film \"Punchline\". After several equity waiver plays and TV guest stars, Scott landed his first TV series regular role as Whoopi Goldberg's son on the short lived \"Bagdad Cafe\". The show ended in 1990 and after a few more years in Hollywood, Scott decided to pack up and move to New York to pursue his first love, the theatre. In NYC he worked in off and off-off Broadway shows and was invited into the elite Drama Department Theatre Company for which he performed Tennesee Williams' three character play, \"Kingdom of Earth\" with Cynthia Nixon and Peter Sarsgaard, directed by John Cameron Mitchell. Scott's proudest theater moment came when he was cast by Lloyd Richards to play Walter Lee in Lorraine Hansberry's, \"A Raisin in the Sun\". Lloyd fell sick but the production went on to rave reviews at Fords Theater in Washington DC, directed by Seret Scott in 1995. Scott stayed in New York for a few more years working in TV, film and theatre before returning to Los Angeles in 1998. In 1999, he was cast in a guest starring role on the pilot for the CBS drama, \"First Monday\". Producer/creator/ director, Don Bellasario admired his work enough to create the role of 'Cmdr. Sturgis Turner' for Scott on his long running, hit series \"JAG\". Scott played the role from 2000 to 2004, when the show was canceled. He continues to live and work in Hollywood, recent notable credits include \"The Social Network\" and James Cameron's \"Avatar\". Upcoming credits Include J.J. Abrams next \"Star Trek\" feature and \"The Host\", directed by Andrew Niccol. Both due for release in 2013. Scott is the very proud father of two sons, Morgan and Daniel.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTkyY2M5NmMtOWUwZi00OTIxLWE5ODQtYzgzNWMyMDM0ZTM0L2ltYWdlXkEyXkFqcGdeQXVyMTM0MjA0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0493013","name":"Scott Lawrence","idIMDB":"nm0493013"},"actorId":"nm0493013","character":"Principal Thomas Walker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Drumm","urlProfile":"http://www.imdb.com/name/nm2951317","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNjgyODQzNV5BMl5BanBnXkFtZTgwMjIxNjE2MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 9½\" (1.77 m)","bio":"David Drumm is an actor, known for Into the Storm (2014) and The Messenger: Based on a True Story (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNjgyODQzNV5BMl5BanBnXkFtZTgwMjIxNjE2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2951317","name":"David Drumm","nicknames":["Dave"],"idIMDB":"nm2951317"},"actorId":"nm2951317","character":"Chester","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brandon Ruiter","urlProfile":"http://www.imdb.com/name/nm4464348","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTE2OTQzMV5BMl5BanBnXkFtZTgwNjE4OTA0OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Brandon grew up in Grand Rapids Michigan. He graduated from Grand Rapids Christian High and later from Hope College with a BA in Theatre and Communication. He moved to Chicago IL and became an active artist in the rich Chicago Theatre Community. Brandon is now a proud company member with The House Theatre of Chicago (www.thehousetheatre.com), and considers the company his artistic home. Brandon is an Actor and Illustrator living in Los Angeles, CA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTE2OTQzMV5BMl5BanBnXkFtZTgwNjE4OTA0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4464348","name":"Brandon Ruiter","idIMDB":"nm4464348"},"actorId":"nm4464348","character":"Todd White","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jimmy Groce","urlProfile":"http://www.imdb.com/name/nm5285679","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxOTAzMTI1OV5BMl5BanBnXkFtZTgwMTUzOTcwOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jimmy Groce is an actor, known for Into the Storm (2014), Fawn and Smile (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxOTAzMTI1OV5BMl5BanBnXkFtZTgwMTUzOTcwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5285679","name":"Jimmy Groce","idIMDB":"nm5285679"},"actorId":"nm5285679","character":"Studious Male","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2106361","urlIMDB":"http://www.imdb.com/title/tt2106361","business":{"budget":{"money":"$50,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$18,015,000","country":"USA","day":"10","month":"08","year":"2014","remarks":"3,434 Screens"},{"money":"HUF 12,549,383","country":"Hungary","day":"10","month":"08","year":"2014","remarks":""}],"gross":[{"money":"$47,602,194","country":"USA","day":"24","month":"11","year":"2014","remarks":""},{"money":"$46,659,442","country":"USA","day":"28","month":"09","year":"2014","remarks":""},{"money":"$18,015,000","country":"USA","day":"10","month":"08","year":"2014","remarks":""},{"money":"$159,702,194","country":"Worldwide","day":"24","month":"11","year":"2014","remarks":""},{"money":"$573,257","country":"Portugal","day":"24","month":"11","year":"2014","remarks":""}],"weekendGross":[{"money":"$142,532","country":"USA","day":"28","month":"09","year":"2014","remarks":"257 Screens"},{"money":"$18,015,000","country":"USA","day":"10","month":"08","year":"2014","remarks":"3,434 Screens"}],"admissions":[{"money":"140,222","country":"Netherlands","day":"31","month":"12","year":"2014","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"23","month":"07","year":"2012","remarks":null},{"money":null,"country":null,"day":"28","month":"09","year":"2012","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 29 min (89 min)"],"soundMix":["SDDS","Datasat","Dolby Digital","Dolby Atmos"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arri Alexa M, Fujinon Alura Lenses","Arri Alexa Plus, Zeiss Master Prime and Fujinon Alura Lenses","Canon EOS 5D Mark II","GoPro Hero 3 Black Edition","Nikon D800","Red Epic, Zeiss Master Prime and Fujinon Alura Lenses"],"laboratory":["FotoKem Digital Film Services, Burbank (CA), USA (digital intermediate)","Technicolor (prints)"],"filmLength":["2,444.3 m (5 reels)"],"negativeFormat":["Codex","Redcode RAW","Video (HD)"],"cinematographicProcess":["ARRIRAW (2.8K) (source format)","Canon H264 (1080p/24) (source format)","Digital Intermediate (2K) (master format)","Redcode RAW (5K) (source format)"],"printedFilmFormat":["35 mm (spherical) (Kodak Vision 2383)","D-Cinema"]},"rating":"5.8","metascore":"44","filmingLocations":[{"location":"Detroit, Michigan, USA"}],"rated":"PG-13","awards":[{"award":"Golden Trailer Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won Golden Trailer","categories":[{"category":"Best Sound Editing","names":[{"name":"Warner Bros.","id":null,"role":null},{"name":"New Line Cinema","id":null,"role":null},{"name":"Buddha Jones","id":null,"role":null}]}]}]},{"award":"Society of Camera Operators 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Camera Operator of the Year Award","categories":[{"category":"Feature Film","names":[{"name":"Peter Rosenfeld","id":"nm0742560","role":null}]}]}]}],"votes":"56,081","type":"Movie","companyCreditsSimple":[{"idCompany":"co0163543","name":"Broken Road Productions"},{"idCompany":"co0046718","name":"New Line Cinema"},{"idCompany":"co0449458","name":"RatPac-Dune Entertainment"}],"keywords":{"keywords":["storm","teenage boy","tornado","danger","graduation","vortex","silverton oklahoma","storm chaser","graduation ceremony","meteorologist","cameraman","documentary crew","oklahoma","small town","van","vice principal","firenado","seeking shelter","ef5 tornado","culvert","boeing 747","airport hit by a tornado","american flag","school bus convoy","tornados converging","thunderstorm","hit by flying debris","downed electrical power line","truck rollover","multiple vortices","artificial respiration","devastation","barn hit by a tornado","school hit by a tornado","lightning strike","last chance","promotional video","all terrain vehicle jump","flaming swimming pool","drowned","trapped underwater","armored vehicle","killed by a tornado","car in a tornado","knife","panic","widower","weather","dog","amateur filmmaker","camcorder","burned to death","race against time","mother son relationship","hanging upside down","collapsing house","tree","redemption","pickup truck","umbrella","bicycle","employer employee relationship","employee employee relationship","helicopter","long take","airplane crash","airplane","airfield","gas station","burned alive","flying car","time capsule","self sacrifice","firefighter","natural disaster","disaster","rescue","child in peril","search","falling from height","freak weather","chaos","fear","flood","abandoned factory","library","basketball","jock","construction worker","construction site","montage","high school teacher","high school principal","armored car","film producer","no cell phone signal","camera phone","laptop","security camera","rookie","stupid victim","daredevil","southern accent","motel","hailstorm","rainstorm","media coverage","news report","prologue","no opening credits","single father","single parent","death","survival","one day","car accident","revolving door","bank","american midwest","storm drain","storm shelter","character's point of view camera shot","subjective camera","character says i love you","disaster film","soaked clothes","wet jeans","helmet camera","four wheeler","boss","family relationships","falling to death","tornado damage","siren","documentary filmmaker","filmmaker","mockumentary","fake documentary","car dealership","near death experience","argument","loss of friend","rain","hail","heavy rain","lightning","school bus","bus","hallway","building collapse","mother daughter relationship","redneck","stunt","swimming pool","explosion","church","fire","destruction","mouth to mouth","drowning","cell phone","video camera","handheld camera","found footage","brother brother relationship","father son relationship","disaster movie","student","high school","high school student","two word title","death of friend","surprise ending","teenage girl","teenager","shouting","crying boy","boy crying","actress shares first name with character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 20:07:24"}}