{"data":{"movies":[{"title":"Jusqu'à mon dernier souffle","originalTitle":"Jab Tak Hai Jaan","year":"2012","releaseDate":"20121121","directors":[{"name":"Yash Chopra","id":"nm0007181"}],"writers":[{"name":"Aditya Chopra","id":"nm0159147"},{"name":"Aditya Chopra","id":"nm0159147"}],"runtime":"176 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzM5OTM5NF5BMl5BanBnXkFtZTcwNTIwMjA3OA@@._V1.jpg","countries":["India"],"languages":["Hindi"],"genres":["Drama","Family","Romance"],"plot":"Samar Anand, a hard working young immigrant in the city of London, glimpses upon the love of his life, a gorgeous angelic looking girl, (Katrina Kaif). They meet and their bond blossoms into love with time spent together. Samar however meets with a serious accident, and Meera vows to God she will leave Samar forever if he allowed him to live again, their love affair ends as quickly as it began. Samar angered with God and fueled with his love for Meera, declares War against Him. Samar Anand vows to walk into the jaws of death everyday as a challenge to God to keep him alive. He becomes Major Samar Anand in the Indian Army, a bomb disposal chief, defusing bombs without ever wearing a bomb suit. It is here that Major Samar also known as 'the man who cannot die' meets Akira (Anushka Sharma), a spirited vibrant, 'today's generation' Discovery Channel correspondent with a WTF attitude. Aware of Samar Anand's story, Akira is determined to unravel the mystery of love in this intriguing story,...","simplePlot":"An uncompromising film on true love from the legendary and unforgettable director Yash Chopra which is fascinatingly distinctive and contemporary.","actors":[{"actorName":"Shah Rukh Khan","urlProfile":"http://www.imdb.com/name/nm0451321","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDk1ZmU0NGYtMzQ2Yi00N2NjLTkyNWEtZWE2NTU4NTJiZGUzXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 November 1965","placeOfBirth":" New Delhi, India","height":"5' 8\" (1.73 m)","bio":"Sharukh Khan was born on 2 November 1965 in New Delhi, India. He married Gauri Khan on 25 October 1991. They have three children, son Aryan Khan (b. 1997), son AbRam (b.2013) and daughter Suhana (b. 2000). Khan started out his career by appearing in several television serials during 1988-1990. He made his film debut with the commercially successful Deewana (1992). He began to achieve success at the box office from his villainous roles in films such as Darr (1993), Baazigar (1993), and Anjaam (1994). During his years in the Indian film industry, he won eight Filmfare best actor awards, which is highest by any actor and had significant box-office success. Some of his films include Kuch Kuch Hota Hai (1998), Om Shanti Om (2007), and Chak de! India (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDk1ZmU0NGYtMzQ2Yi00N2NjLTkyNWEtZWE2NTU4NTJiZGUzXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0451321","name":"Shah Rukh Khan","nicknames":["King Khan","SRK","The Badshah of Bollywood","The King of Bollywood"],"idIMDB":"nm0451321"},"actorId":"nm0451321","character":"Samar Anand","urlCharacter":"http://www.imdb.com/character/ch0337267","main":true},{"actorName":"Katrina Kaif","urlProfile":"http://www.imdb.com/name/nm1229940","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwODY3NzA3NF5BMl5BanBnXkFtZTcwNTEzNDg3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1984","placeOfBirth":" Hong Kong","height":"5' 8\" (1.73 m)","bio":"Katrina Kaif is one of eight siblings, 7 girls and 1 boy, from a mother who is a Caucasian of British Nationality, and a father who was formerly from Kashmir, India, but who has since acquired British citizenship. Her mother is now re-settled in Chennai (formerly known as Madras), the Capital of the state of Tamil Nadu in India. She spent subsequent years in Hawaii, and then in London, Britain, She started modeling accidentally when she was in Hawaii at the tender age of 14, when she was approached for a jewelry campaign. Thereafter she continued modeling in London. Continuing to model was the reason she got her break in a Bollywood movie Boom (2003) offered by none other than film-maker Kaizad Gustad. She was flooded with modeling assignments the minute she set her foot on Indian soil, especially with her innocent expressive face, hour-glass figure, and drop-dead gorgeous looks. Professionally she started off as a model with photographer Atul Kasbekar, and upon being accepted, she received offers from LG, Cola, Fevicol, Lakme, & Veet. It was the Lakme commercial that got her noticed. She retained Matrix as her Manager to accept work on her behalf and at the price she deserved. Moving to different culture and country was not much of a culture shock for her, as she states that no matter where you come from, the bottom line is that everyone wants to be loved, respected, and cared for. Despite of her positive attitude, she had been stereotyped as \"Indian\" by extreme right-wingers in Britain who made it clear that she did not quite fit-in with their \"Blonde\" Caucasian culture; while on the other hand in India itself she had been ranked as an 'outsider' very much like Sonia Gandhi. Unlike other artistes from foreign lands, Katrina did not experience any difficulties in getting a visa nor of getting it extended in India. Although linguistically challenged, Katrina puts on a bold face and states that other Bollywood artistes like Sridevi, who did not know Hindi, did get offers from Bollywood film-makers, and she is no different. She has taken Hindi and dancing lessons to fit in with the Bollywood culture. She likes to display a picture of her learning Kathak dancing where she used to dance 7 hours a day non-stop. Adorned with soft gorgeous looks, she is not easily intimidated, but admits that she is very emotional, sensitive, and concerned about her privacy, Almost an incurable romantic, she prefers to wear comfortable non-revealing clothes when at home, hates to do her hair, and above all dislikes make-up. Admitting to being lonely in the beginning, but now has several friends who she can hang out with. Although her first movie Boom (2003) was panned by the critics and shunned by the audiences, two other Telugu movies Malliswari (2004) and Allari Pidugu (2005) did get her noticed. She grossed 70 Lakh Rupees for Malliswari (2004) - making her top the list of the highest paid actresses during a South Indian movie debut. Not done with South Indian movies, she has been signed in a Tamil movie 'Bheema' opposite National Award Winner Vikram. She has received decent reviews for her part in \"Maine Pyar Kyon Kiya\", as well as a brief appearance in 'Sarkar'. Katrina had made Mumbai her base, didn't mind singing and dancing around trees and as a result is now one of the biggest mega-stars, perhaps one of the highest paid female-lead actresses in Bollywood, and a crowd-puller whenever she makes an appearance for a live song and dance number.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwODY3NzA3NF5BMl5BanBnXkFtZTcwNTEzNDg3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1229940","name":"Katrina Kaif","nicknames":["Kat"],"idIMDB":"nm1229940"},"actorId":"nm1229940","character":"Meera Thapar","urlCharacter":"http://www.imdb.com/character/ch0359397","main":true},{"actorName":"Anushka Sharma","urlProfile":"http://www.imdb.com/name/nm3087728","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGM5YmYwNjUtNzQyYS00OGY0LTljZDAtMDNiMjhiOTFiMzRiXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 May 1988","placeOfBirth":" Bangalore, Karnataka, India","height":"5' 9\" (1.75 m)","bio":"Anushka Sharma was born on 1 May 1988 in Ayodhya, Uttar Pradesh. Her father, Colonel Ajay Kumar Sharma, is an army officer, and her mother, Ashima Sharma, is a homemaker. Her father is a native of Uttar Pradesh, while her mother is a Garhwali. Her elder brother is film producer Karnesh Sharma, who earlier served in the Merchant Navy. Prior to joining the navy, Karnesh played for the under-19 Bangalore Ranji cricket team. Sharma has stated that being a military brat played an important role in shaping her as a person and contributing to her life. In an interview with The Times of India in 2012, she said, \"I take pride in saying that I am an army officer's daughter even more than being an actor. She studied in Army School and graduated with specialization in arts from Mount Carmel College, Bangalore. She then moved to Mumbai to further her modeling career. Sharma says she originally wished to make it big in the modeling world but had no strong aspirations for films. She began her modeling career at the Lakme Fashion Week as a model for Wendell Rodricks's Les Vamps Show and was picked to be Rodricks's finale model at the Spring Summer '07 Collection. Since then she has done campaigns for Silk & Shine, Whisper, Nathella Jewelry and Fiat Palio. Her first acting role was in Aditya Chopra's Rab Ne Bana Di Jodi (2008) opposite Shahrukh Khan. The film was a huge success and her performance was appreciated. Film critic Taran Adarsh said, \"Anushka looks the character and surprises you with a confident performance. It's no small achievement to share screen space with an actor of the caliber of SRK and Anushka manages it very well from start to end.\" Her second film, Badmaash Company, also under Yash Raj Films, was released on May 7, 2010. She was praised for breaking out of the shell of the conservative and homely Taani to play the feisty and independent Bulbul, and her performance was applauded. She has two other projects on hand. She began shooting for her first venture outside of Yash Raj with Nikhil Advani and Akshay Kumar in Patiala House in December 2009. Patiala House is scheduled to be released on February 11, 2011. She has also started filming for her third Yash Raj Film, Band Baaja Baaraat, directed by Maneesh Sharma and co-starring debutant Ranveer Singh.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGM5YmYwNjUtNzQyYS00OGY0LTljZDAtMDNiMjhiOTFiMzRiXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3087728","name":"Anushka Sharma","idIMDB":"nm3087728"},"actorId":"nm3087728","character":"Akira Rai","urlCharacter":"http://www.imdb.com/character/ch0363185","main":true},{"actorName":"Anupam Kher","urlProfile":"http://www.imdb.com/name/nm0451600","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyMjc1OTgzNF5BMl5BanBnXkFtZTgwMDY1NDMzOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 March 1955","placeOfBirth":" Shimla, Himachal Pradesh, India","height":"5' 9\" (1.75 m)","bio":"Anupam Kher was born on March 7, 1955 in Shimla, Himachal Pradesh, India. He is an actor and producer, known for Silver Linings Playbook (2012), A Wednesday (2008) and Bend It Like Beckham (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyMjc1OTgzNF5BMl5BanBnXkFtZTgwMDY1NDMzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0451600","name":"Anupam Kher","idIMDB":"nm0451600"},"actorId":"nm0451600","character":"Meera's father","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rishi Kapoor","urlProfile":"http://www.imdb.com/name/nm0438501","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NDU3MTEyMV5BMl5BanBnXkFtZTcwMjAwMTA1NA@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1952","placeOfBirth":" Bombay, State of Bombay, India","height":"5' 7\" (1.7 m)","bio":"Born in south Mumbai, Kapoor is the second son of film director and actor Raj Kapoor. He did his schooling with his brothers at Campion School,Mumbai. His brothers are well-known actors, Randhir Kapoor and Rajiv Kapoor. Rishi Kapoor debuted in his father's 1970 film Mera Naam Joker, playing his father's role as a child. Rishi Kapoor had his first lead role opposite Dimple Kapadia in the popular 1973 film Bobby which became an instant hit among youngsters. He made a popular pairing with future wife Neetu Singh in 1974-1981 but the pair was successful only in multi-star cast films as films with Rishi as main lead like Zehreela Insaan,Zinda Dil,Doosara Aadmi, Anjane Mein, Jhoota Kahin Ka, Dhan Daulat were box office flops.Rishi Neetu pair was successful in multi star films like Khel Khel Mein, Kabhie Kabhie, Amar Akbar Anthony,Pati Patni Aur Woh, Duniya Meri Jeb Mein.The only solo hit of the Rishi Neetu was Rafoo Chakkar. Rishi Kapoor got 51 films as the solo lead hero from 1974-1997 but of them 40 were box -office flops and managed only 11 hits - which were Bobby, Laila Majnu,Rafoo Chakkar, Sargam, Karz, Prem Rog, Nagina, Honeymoon, Banjaran, Heena and Bol Radha Bol.So he was offered the role of playing younger brother to lead heroes in multi star-cast movies from 1977-1994.Rishi Kapoor did 41 multi star cast films from 1976-2000 where Rishi was casted as 2nd or 3rd lead hero and of them 16 were flops and 25 were hits. He was often offered the role of playing younger brother to main lead heroes in the multi hero films he did where his character would be a romantic one and the story would revolve on the main lead hero of the film.In 90's his 2 hero films Deewana,Damini and Eena Meena Dika were a success. He got the plum lead hero roles in two-hero films only few times like in Hum Kisi Se Kum Nahin, Badalte Roshtey, Aap Ke Deewane, Saagar then in 90's with Chandni, Deewana(1992), Damini(1993) and Gurudev (1994); otherwise in the 2 hero films Rishi did in late 70's and through-out 80's, it was his other co-star whose character over-shadowed his and the other co-star was appreciated more like in case of Katilon Ke Kaatil, Coolie, Sitamgar, Zamana. After several box office failures from in 1990s, he eventually moved on to supporting roles in the 2000s. In 1999 he directed the film Aa Ab Laut Chalen.His last film as a romantic lead was the 5 year delayed release Karobaar: The Business of Love (2000)which was unsuccessful. He has since then played supporting roles in films like Yeh Hai Jalwa, Hum Tum, Fanaa, Namaste London, Love Aaj Kal and Patiala House. He also appeared in the British films Don't Stop Dreaming and Sambar Salsa. He was paired with Neetu Singh in the film Do Dooni Chaar (2010). Rishi has acted in the movie Chintu Ji in which he plays himself.In 2012 he appeared in a villainous role in Agneepath and in the multi-starer Housefull 2 where he appeared with brother Randhir for the first time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NDU3MTEyMV5BMl5BanBnXkFtZTcwMjAwMTA1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0438501","name":"Rishi Kapoor","nicknames":["Chintoo"],"idIMDB":"nm0438501"},"actorId":"nm0438501","character":"Imran","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Abbie Murphy","urlProfile":"http://www.imdb.com/name/nm7150152","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjQ5MWEwNzgtOGM0YS00NTQ0LWE3ZTMtOTk0ZDJlOTlhNDA4XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"When someone decides to perform an hour show at the Edinburgh Fringe Festival made up of self devised, self written and self performed material, it is a 12 month affair -Abbie Murphy went from decision to critically acclaimed comedy debut in just 6 months with no prior comedy experience - just raw talent, funny bones and one ballsy leap of faith.. Abbie previewed her character show 'Girl on Fire' staring Abbie's brainchild 'Stephanie Vange' in July at the Camden Solo Festival 2014 which saw her walk away with 'Winner of Best Act' and previous to that, she caught the keen eye of comedy legend Jennifer Saunders who grabbed an awe struck Abbie for a chat after her show. Saunders went on to support Girl on Fire via twitter once Abbie landed on Scottish soil. The free fringe welcomed Abbie at the famed comic haunt, The Counting House, where her character show staring Stephanie Vange completed the month run to a full house audience. Vange is a heightened version of a typical ditsy Essex girl of which The Skinny noted Abbie's talent for creation as an impressive achievement to portray such a caricature without being derogatory. Abbie's whirlwind year is seeing her fast becoming a regular on the comedy circuit, performing in line up's alongside Birthday Girls and Aisling Bea. Originally from an accomplished choreography and dance background, Abbie performed in the Bafta nominated BBC3 Bollywood Carmen last year as one of her final dance performances where she met Matt Lucas' producer and subsequently bagged herself a role in the new visual comedy series, \"Pompidou\" airing on BBC 1 and Netflix in 2015. Excitingly, Abbie is working on turning Girl on Fire into a sitcom with the team. Her next television appearance might just be a collision of worlds as a twerking career unfolds for Stephanie Vange across our screens; Abbie Murphy is a very exciting new writer and performer to join the female comedy ranks.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjQ5MWEwNzgtOGM0YS00NTQ0LWE3ZTMtOTk0ZDJlOTlhNDA4XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm7150152","name":"Abbie Murphy","idIMDB":"nm7150152"},"actorId":"nm7150152","character":"Nurse Montgomery","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susan Fordham","urlProfile":"http://www.imdb.com/name/nm4893364","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzMTAyMTc4MzVeQTJeQWpwZ15BbWU4MDczODMwNTAx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 3\" (1.6 m)","bio":"Sue is a Tv/Film Extra and likes working on set as well as off set, She like's working behind the scenes and being part of a production team, Sue has also gained experience in casting extras for films. She is a lively, happy, bubbly person and has a great sense of humor.. Plus she is a twin, if there are any twin fans out there.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzMTAyMTc4MzVeQTJeQWpwZ15BbWU4MDczODMwNTAx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4893364","name":"Susan Fordham","idIMDB":"nm4893364"},"actorId":"nm4893364","character":"Party Guest","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrew Bicknell","urlProfile":"http://www.imdb.com/name/nm0081070","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWU3ZTk5YzQtYmMzOC00NTBiLTg1NzUtMzZiM2RmYjMwMjRiXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"height":"6' 1½\" (1.87 m)","bio":"Andrew Bicknell was born In 1957 in Colchester. He is a completely Versatile Character Actor working On film in the USA, UK and European Film Industries. He lives with his long term Partner Alexandra in Surrey. He Trained in The Classics at Webber Douglas Academy London and started his career At The Bristol Old Vic Theatre and BBC simultaneously.. He moved to Los Angeles in 1987 and worked out of the USA and Europe for several years. His Hobbies include Travel, Horse Riding, Motorcycles and Driving Classic sports cars around Race Tracks","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWU3ZTk5YzQtYmMzOC00NTBiLTg1NzUtMzZiM2RmYjMwMjRiXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0081070","name":"Andrew Bicknell","idIMDB":"nm0081070"},"actorId":"nm0081070","character":"Frank","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lee Nicholas Harris","urlProfile":"http://www.imdb.com/name/nm3613279","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDQ4MjMzNV5BMl5BanBnXkFtZTgwMzQyNTAyNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Lee Nicholas Harris is known for his work on World War Z (2013), The Human Centipede II (Full Sequence) (2011) and Trance (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDQ4MjMzNV5BMl5BanBnXkFtZTgwMzQyNTAyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3613279","name":"Lee Nicholas Harris","nicknames":["Bomber Harris"],"idIMDB":"nm3613279"},"actorId":"nm3613279","character":"Builder / Tramp / Police Officer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julia St John","urlProfile":"http://www.imdb.com/name/nm0820653","urlPhoto":"","biography":{"dateOfBirth":"4 January 1960","placeOfBirth":" England, UK","bio":"Julia St John was born on January 4, 1960 in England. She is an actress, known for The Brittas Empire (1991), The Young Victoria (2009) and Jusqu'à mon dernier souffle (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0820653","name":"Julia St John","idIMDB":"nm0820653"},"actorId":"nm0820653","character":"Catherine","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Blackwell","urlProfile":"http://www.imdb.com/name/nm0085944","urlPhoto":"","biography":{"height":"5' 10\" (1.78 m)","bio":"Paul Blackwell is known for his work on Jusqu'à mon dernier souffle (2012), Fan (2016) and Thaandavam (2012). He has been married to Tracy since May 6, 1983. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0085944","name":"Paul Blackwell","idIMDB":"nm0085944"},"actorId":"nm0085944","character":"Police Officer - BTP","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vic Waghorn","urlProfile":"http://www.imdb.com/name/nm4880315","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0ZWZjNmEtMzQyYi00ZmYwLWI4ZGItMWVmOGU3MTI4YzQyXkEyXkFqcGdeQXVyMzExNTI3ODg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Actor: Vic Waghorn had spent 25 years + in the construction industry before changing direction and careers. For the past few years Vic has been chosen for many roles due to his skills both behind and in front of the camera. Vic is known for both his Film and TV work (TV mainly for the BBC, ITV and Channel 4) and to his credit Vic continues to grow from strength to strength, now he is being cast as a principle character in many projects he has a rewarding new career ahead of him.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0ZWZjNmEtMzQyYi00ZmYwLWI4ZGItMWVmOGU3MTI4YzQyXkEyXkFqcGdeQXVyMzExNTI3ODg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4880315","name":"Vic Waghorn","idIMDB":"nm4880315"},"actorId":"nm4880315","character":"Party Guest","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sarika","urlProfile":"http://www.imdb.com/name/nm0045136","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDAxMDNhNDItMmE3ZS00YmJjLWE4M2ItNWFhZTI1YzljNjYzXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 June 1962","placeOfBirth":" India","height":"5' 3½\" (1.61 m)","bio":"Started her film career as a child actress and has also played a boys role in the 1960s in Indian cinema. She did many films with Sachin and their pair gave several hits together. She has acted in many classic Indian films such as Kranti(1981). Married famous actor Kamal Haasan but they are now separated.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDAxMDNhNDItMmE3ZS00YmJjLWE4M2ItNWFhZTI1YzljNjYzXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0045136","name":"Sarika","idIMDB":"nm0045136"},"actorId":"nm0045136","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jasmine Jardot","urlProfile":"http://www.imdb.com/name/nm5221129","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NjE0MjMyMF5BMl5BanBnXkFtZTgwNzA5NDkzMzE@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"bio":"Jasmine Jardot is an actress, known for The Infiltrator (2016), Jusqu'à mon dernier souffle (2012) and The London Firm (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NjE0MjMyMF5BMl5BanBnXkFtZTgwNzA5NDkzMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5221129","name":"Jasmine Jardot","idIMDB":"nm5221129"},"actorId":"nm5221129","character":"Maria","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Atul Sharma","urlProfile":"http://www.imdb.com/name/nm4452726","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMTI2OTE1OV5BMl5BanBnXkFtZTgwNjIzNDgxNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Mr Atul Sharma is UK based Actor and Model. He has lived in Beaconsfield London. He has appeared in top Bollywood and Hollywood productions with stars such as Shah Rukh Khan, Amitabh Bachchan, Colin Firth, Anthony Hopkins and Jude Law. He is very professional, reliable and an excellent time keeper. He has done many featured roles and appeared in Bollywood films such as Bhoothnath Returns, Welcome 2 Karachi, Shaandaar and featured role in Hollywood movie The Black Prince. He has featured roles,TV shows such as Judge Rinder. He has also modelled for British Heart Foundation and starred in music videos with One Direction, Sam Smith, Shakka.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMTI2OTE1OV5BMl5BanBnXkFtZTgwNjIzNDgxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4452726","name":"Atul Sharma","idIMDB":"nm4452726"},"actorId":"nm4452726","character":"Party Guest","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2176013","urlIMDB":"http://www.imdb.com/title/tt2176013","business":{"budget":{"money":"$7,217,600","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$1,283,585","country":"USA","day":"18","month":"11","year":"2012","remarks":"160 Screens"},{"money":"$14,435,200","country":"India","day":"18","month":"11","year":"2012","remarks":""}],"gross":[{"money":"$3,047,539","country":"USA","day":"23","month":"11","year":"2012","remarks":""},{"money":"$1,941,805","country":"USA","day":"18","month":"11","year":"2012","remarks":""},{"money":"$26,524,680","country":"Worldwide","day":"18","month":"12","year":"2012","remarks":""},{"money":"$22,116,835","country":"Worldwide","day":"04","month":"12","year":"2012","remarks":""}],"weekendGross":[{"money":"$536,918","country":"USA","day":"23","month":"11","year":"2012","remarks":"164 Screens"},{"money":"$1,283,585","country":"USA","day":"18","month":"11","year":"2012","remarks":"160 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 56 min (176 min) (USA)","3 hr 18 min (198 min) (uncut)"],"soundMix":["Dolby (Dolby Surround 7.1)","DTS","Dolby Digital EX (Dolby Surround 7.1)"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex 435 Xtreme, Zeiss Master Prime Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Super 35 (also 3-perf) (source format)"],"printedFilmFormat":["35 mm (anamorphic)","D-Cinema"]},"rating":"6.9","filmingLocations":[{"location":"Kashmir"}],"rated":"NOT RATED","awards":[{"award":"Apsara Film Producers Guild Awards 2013","titlesAwards":[{"titleAwardOutcome":"Won Apsara Award","categories":[{"category":"Best Lyrics","names":[{"name":"Gulzar","id":"nm0347899","role":null}]}]},{"titleAwardOutcome":"Nominated Apsara Award","categories":[{"category":"Best Music Director","names":[{"name":"A.R. Rahman","id":"nm0006246","role":null}]},{"category":"Best Female Playback Singer","names":[{"name":"Shreya Ghoshal","id":"nm1304975","role":null}]},{"category":"Best Actress In A Supporting Role","names":[{"name":"Anushka Sharma","id":"nm3087728","role":"actress"}]}]}]},{"award":"Awards of the International Indian Film Academy 2013","titlesAwards":[{"titleAwardOutcome":"Won Popular Award","categories":[{"category":"Best Actress in a Supporting Role","names":[{"name":"Anushka Sharma","id":"nm3087728","role":null}]}]}]},{"award":"BIG Star Entertainment Awards, India 2012","titlesAwards":[{"titleAwardOutcome":"Won Film Award","categories":[{"category":"Most Entertaining Romantic Couple","names":[{"name":"Katrina Kaif","id":"nm1229940","role":null},{"name":"Shah Rukh Khan","id":"nm0451321","role":null}]}]}]},{"award":"Bollywood Hungama Surfers' Choice Movie Awards 2013","titlesAwards":[{"titleAwardOutcome":"2nd place Surfers' Choice Award","categories":[{"category":"Best Actor","names":[{"name":"Shah Rukh Khan","id":"nm0451321","role":null}]}]}]},{"award":"Filmfail Awards 2013","titlesAwards":[{"titleAwardOutcome":"Won Filmfail Award","categories":[{"category":"Worst Screenplay Award","names":[{"name":"Aditya Chopra","id":"nm0159147","role":null},{"name":"Devika Bhagat","id":"nm0080157","role":null}]}]},{"titleAwardOutcome":"Nominated Filmfail Award","categories":[{"category":"Worst Actress of the Year","names":[{"name":"Katrina Kaif","id":"nm1229940","role":null}]}]}]},{"award":"Filmfare Awards 2013","titlesAwards":[{"titleAwardOutcome":"Won Filmfare Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Anushka Sharma","id":"nm3087728","role":null}]},{"category":"Best Lyricist","names":[{"name":"Gulzar","id":"nm0347899","role":null}]}]},{"titleAwardOutcome":"Nominated Filmfare Award","categories":[{"category":"Best Actor","names":[{"name":"Shah Rukh Khan","id":"nm0451321","role":null}]},{"category":"Best Playback Singer - Male","names":[{"name":"Rabbi Shergill","id":"nm2593814","role":null}]},{"category":"Best Lyricist","names":[{"name":"Gulzar","id":"nm0347899","role":null}]},{"category":"Best Playback Singer - Female","names":[{"name":"Shreya Ghoshal","id":"nm1304975","role":null}]},{"category":"Best Playback Singer - Female","names":[{"name":"Neeti Mohan","id":"nm5642968","role":null}]}]}]},{"award":"HELLO! Hall of Fame Awards, India 2012","titlesAwards":[{"titleAwardOutcome":"Won HELLO! Hall of Fame Award","categories":[{"category":"Entertainer of the Year - Female","names":[{"name":"Katrina Kaif","id":"nm1229940","role":null},{"name":"Ek Tha Tiger","id":"tt2016894","role":null}]}]}]},{"award":"Stardust Awards, India 2013","titlesAwards":[{"titleAwardOutcome":"Won Reader's Choice","categories":[{"category":"Star of the Year - Male","names":[{"name":"Shah Rukh Khan","id":"nm0451321","role":null}]}]}]},{"award":"The Ghanta Awards 2013","titlesAwards":[{"titleAwardOutcome":"Won Ghanta Award","categories":[{"category":"WTF Was That","names":[]}]},{"titleAwardOutcome":"Nominated Ghanta Award","categories":[{"category":"Worst Actress","names":[{"name":"Katrina Kaif","id":"nm1229940","role":null},{"name":"Ek Tha Tiger","id":"tt2016894","role":null}]},{"category":"Worst Supporting Actor","names":[{"name":"Rishi Kapoor","id":"nm0438501","role":null},{"name":"Agneepath","id":"tt1849718","role":null},{"name":"Housefull 2","id":"tt1980986","role":null}]},{"category":"Worst Supporting Actress","names":[{"name":"Anushka Sharma","id":"nm3087728","role":null}]}]}]},{"award":"Times of India Film Awards 2013","titlesAwards":[{"titleAwardOutcome":"Won Popular Award","categories":[{"category":"Best Lyrics","names":[{"name":"Gulzar","id":"nm0347899","role":null}]}]}]},{"award":"Zee Cine Awards 2013","titlesAwards":[{"titleAwardOutcome":"Won Popular Award","categories":[{"category":"Best Actress in a Supporting Role","names":[{"name":"Anushka Sharma","id":"nm3087728","role":null}]},{"category":"Best Female Playback","names":[{"name":"Shreya Ghoshal","id":"nm1304975","role":null}]}]},{"titleAwardOutcome":"Won Special Award","categories":[{"category":"Power Club - Box Office Award","names":[{"name":"Yash Chopra","id":"nm0007181","role":null}]}]},{"titleAwardOutcome":"Nominated Popular Award","categories":[{"category":"Best Actor","names":[{"name":"Shah Rukh Khan","id":"nm0451321","role":null}]},{"category":"Best Music Director","names":[{"name":"A.R. Rahman","id":"nm0006246","role":null}]},{"category":"Best Female Playback","names":[{"name":"Neeti Mohan","id":"nm5642968","role":null}]},{"category":"Best Male Playback","names":[{"name":"Rabbi Shergill","id":"nm2593814","role":null}]},{"category":"Best Lyricist","names":[{"name":"Gulzar","id":"nm0347899","role":null}]}]},{"titleAwardOutcome":"Nominated Technical Award","categories":[{"category":"Best Dialogue","names":[{"name":"Aditya Chopra","id":"nm0159147","role":null}]}]}]}],"votes":"44,703","type":"Movie","companyCreditsSimple":[{"idCompany":"co0456697","name":"First Step Productions"},{"idCompany":"co0140937","name":"Helicopter Film Services"},{"idCompany":"co0280517","name":"Redchillies.VFX"}],"keywords":{"keywords":["love","army","bomb","indian army","accident","musician","bomb squad","death","amnesia","diary","immigrant","retrograde amnesia","motorcycle accident","london underground","kashmir","unrequited love","fearlessness","death wish","heartbreak","church","odd job","waiter","filmmaker","indian abroad","love triangle","father daughter relationship","reference to the discovery channel","camera","disarming a bomb","defusing bomb","defusing a bomb","dangerous job","explosive","london england","flashback","rescue from drowning"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:32:43"}}