{"data":{"movies":[{"title":"Ice Age: A Mammoth Christmas","originalTitle":"","year":"2011","releaseDate":"20111124","directors":[{"name":"Karen Disher","id":"nm0228327"}],"writers":[{"name":"Sam Harper","id":"nm0363958"},{"name":"Mike Reiss","id":"nm0718514"}],"runtime":"26 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTMzMjZhNjAtZDBmMS00MzA0LTljNjUtZGNlMGNiYTc5ODg4XkEyXkFqcGdeQXVyNTE0MDY4Mjk@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Short","Adventure","Comedy","Family","Fantasy"],"plot":"When Sid accidentally destroys Manny's heirloom Christmas rock and ends up on Santa's naughty list, he leads a hilarious quest to the North Pole to make things right and ends up making things much worse. Now it's up to Manny and his prehistoric posse to band together and save Christmas for the entire world.","simplePlot":"Sid, Eddie and Crash get in trouble with Santa and have to get their names off of the naughty list.","actors":[{"actorName":"Ray Romano","urlProfile":"http://www.imdb.com/name/nm0005380","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NzA4ODQxNV5BMl5BanBnXkFtZTYwMDA5Mjk1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 December 1957","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Raymond Albert Romano","height":"6' 1½\" (1.87 m)","bio":"Ray Romano grew up in Forest Hills, Queens. He performed in the NYC comedy club circuit before landing a guest spot on The Letterman Show. It was here that he propelled his TV show Everybody Loves Raymond. He was also the voice of the Mammoth in the extremely successful Ice Age Series Movies. He is also the inspiration for the character'Paul', written by his brother Rich in the film \"the Investigator.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NzA4ODQxNV5BMl5BanBnXkFtZTYwMDA5Mjk1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005380","name":"Ray Romano","idIMDB":"nm0005380"},"actorId":"nm0005380","character":"Manny","urlCharacter":"http://www.imdb.com/character/ch0004525","main":true},{"actorName":"John Leguizamo","urlProfile":"http://www.imdb.com/name/nm0000491","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEyMjMxNDg5NF5BMl5BanBnXkFtZTcwNzczOTY4MQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1964","placeOfBirth":" Bogotá, Colombia","birthName":"John Alberto Leguizamo","height":"5' 7\" (1.7 m)","bio":"Fast-talking and feisty-looking John Leguizamo has continued to impress movie audiences with his versatility: he can play sensitive and naive young men, such as Johnny in Hangin' with the Homeboys (1991); cold-blooded killers like Benny Blanco in Carlito's Way (1993); a heroic Army Green Beret, stopping aerial terrorists in Executive Decision (1996); and drag queen Chi-Chi Rodriguez in To Wong Foo Thanks for Everything, Julie Newmar (1995). Arguably, not since ill-fated actor and comedian Freddie Prinze starred in the smash TV series Chico and the Man (1974) has a youthful Latino personality had such a powerful impact on critics and fans alike. Leguizamo was born July 22, 1964, in Bogotá, Colombia, to Luz and Alberto Leguizamo. He was four when his family emigrated to the United States. He was raised in Queens, New York, attended New York University and studied under legendary acting coach Lee Strasberg for only one day before Strasberg passed away. The extroverted Leguizamo started working the comedy club circuit in New York and first appeared in front of the cameras in an episode of Miami Vice (1984). His first film appearance was a small part in Cocaïne (1984), and he had minor roles in Casualties of War (1989) and Die Hard 2 (1990) before playing a liquor store thief who shoots Harrison Ford in Regarding Henry (1991). His career really started to soar after his first-rate performance in the independent film Hangin' with the Homeboys (1991) as a nervous young teenager from the Bronx out for a night in brightly lit Manhattan with his buddies, facing the career choice of staying in a supermarket or heading off to college and finding out that the girl he loves from afar isn't quite what he thought she was. The year 1991 was also memorable for other reasons, as he hit the stage with his show Mambo Mouth (1991), in which he portrayed seven different Latino characters. The witty and incisive show was a smash hit and won the Obie and Outer Circle Critics Award, and later was filmed for HBO, where it picked up a CableACE Award. He returned to the stage two years later with another satirical production poking fun at Latino stereotypes titled John Leguizamo: Spic-O-Rama (1993). It played in Chicago and New York, and won the Drama Desk Award and four CableACE Awards. In 1995 he created and starred in the short-lived TV series House of Buggin' (1995), an all-Latino-cast comedy variety show featuring hilarious sketches and comedic routines. The show scored two Emmy nominations and received positive reviews from critics, but it was canceled after only one season. The gifted Leguizamo was still keeping busy in films, with key appearances in Super Mario Bros. (1993), Romeo + Juliet (1996) and Spawn (1997). In 1998 he made his Broadway debut in John Leguizamo: Freak (1998), a \"demi-semi-quasi-pseudo-autobiographical\" one-man show, which was filmed for HBO by Spike Lee. Utilizing his distinctive vocal talents, he next voiced a pesky rat in Doctor Dolittle (1998) before appearing in the dynamic Spike Lee-directed Summer of Sam (1999) as a guilt-ridden womanizer, as the Genie of The Lamp in the exciting Arabian Nights (2000) and as Henri DE Toulouse Lautrec in the visually spectacular Moulin Rouge (2001). He also voiced Sid in the animated Ice Age (2002), co-starred alongside Arnold Schwarzenegger in Collateral Damage (2002) and directed and starred in the boxing film Undefeated (2003). Afterward, Leguizamo starred in the remake of the John Carpenter hit Assaut sur le central 13 (2005) and George A. Romero's long-awaited fourth \"Dead\" film, Land of the Dead - Le territoire des morts (2005). There can be no doubt that the remarkably talented Leguizamo has been a breakthrough performer for the Latino community in mainstream Hollywood, in much the same way that Sidney Poitier crashed through celluloid barriers for African-Americans in the early 1960s. Among his many strengths lies his ability to not take his ethnic background too seriously but also to take pride in his Latino heritage. He has opened many doors for his countrymen. A masterly and accomplished performer, movie audiences await Leguizamo's next exciting performance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEyMjMxNDg5NF5BMl5BanBnXkFtZTcwNzczOTY4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000491","name":"John Leguizamo","nicknames":["Johnny Legs","John Leguizama"],"idIMDB":"nm0000491"},"actorId":"nm0000491","character":"Sid","urlCharacter":"http://www.imdb.com/character/ch0004523","main":true},{"actorName":"Denis Leary","urlProfile":"http://www.imdb.com/name/nm0001459","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MzM4NTA5OV5BMl5BanBnXkFtZTcwMTAxNjA3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1957","placeOfBirth":" Worcester, Massachusetts, USA","birthName":"Denis Colin Leary","height":"6' 2\" (1.88 m)","bio":"Denis Leary was born and raised in Worcester, Massachusetts, the son of Nora (Sullivan) and John Leary, Irish immigrants who had grown up together. His mother was a maid and his father was an auto mechanic. After a childhood in the 1960s, Leary went to Emerson College in Boston, where he tried his hand at acting and writing. He was a charter member of Emerson's Comedy Workshop, and taught at the college for five years after graduating. By that point, he had written several pieces for magazines and had worked at stand-up comedy for a time. In 1990, he and his wife, Ann Lembeck, flew to London to perform in the BBC's Paramount City. That weekend, Ann's water broke. Their planned weekend trip became a stay of months, and Denis, with not a whole lot to do in London, wrote a one-man comedy act. He brought friends in from the States, and they wrote songs to perform on stage. Leary, with Chris Phillips and Adam Roth on guitar, performed \"No Cure For Cancer\" at the Edinburgh International Arts Festival in Scotland. Despite some protests about the title, the show won the Critic's Award and the BBC Festival Recommendation. The next year, the show was moved to America, and it was eventually taped and broadcast on Showtime (Denis Leary: No Cure for Cancer (1992)). The show spawned a book, CD, cassette, and a videotape. It also started Leary's movie career. Since then, he has starred in several films and has had two of his own TV series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MzM4NTA5OV5BMl5BanBnXkFtZTcwMTAxNjA3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001459","name":"Denis Leary","idIMDB":"nm0001459"},"actorId":"nm0001459","character":"Diego","urlCharacter":"http://www.imdb.com/character/ch0004524","main":true},{"actorName":"Queen Latifah","urlProfile":"http://www.imdb.com/name/nm0001451","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjkxNzkyMF5BMl5BanBnXkFtZTcwNTQ1MTMyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 March 1970","placeOfBirth":" Newark, New Jersey, USA","birthName":"Dana Elaine Owens","height":"5' 10\" (1.78 m)","bio":"Often considered hip-hop's first lady (though some would attribute that to Roxanne Shanté), the woman behind the moniker Queen Latifah was born Dana Owens on March 18th, 1970, in East Orange, New Jersey. She is the daughter of Rita (Bray), a teacher, and Lancelot Owens, Sr. She came from a police family--both her father and older brother were cops, which would later influence her rhyming style and life philosophy. Owens witnessed both sides of Black urban life in the USA while growing up. After a brief stint as a Burger King employee, she soon found herself making waves in the hip-hop music scene. After working as the human beat box alongside Ladies Fresh, she was just 18 years old when she originally broke through in the late 1980s with a style that picked selectively from jazz, reggae, and soul traditions, from beats produced by 'D.J. Mark the 45 King'. Her debut single, \"Wrath of My Madness,\" was released in 1988. A year later, her debut long-player, \"All Hail the Queen,\" enjoyed favored reviews: an old, wise head was evident on the top of her young shoulders. The former Burger King employee maintained her early commitment to answer the misogynist armory of some of her male counterparts and, at the same time, imparted musical good times to all genders. Her name means \"delicate and sensitive\" in Arabic, but she has often been anything but in her rhymes and the messages she sends out through them. One of the most prominent female hip-hop artists on the scene for over a decade, Queen Latifah has also made tremendous inroads in movies, television, and artist management, with her management company, Flavor Unit, alongside her business partner Shakim Compere. A role model who takes the responsibility to heart, Latifah carefully constructed a fine career for herself--one that is constantly moving upward.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjkxNzkyMF5BMl5BanBnXkFtZTcwNTQ1MTMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001451","name":"Queen Latifah","nicknames":["Hip-Hop's First Lady"],"idIMDB":"nm0001451"},"actorId":"nm0001451","character":"Ellie","urlCharacter":"http://www.imdb.com/character/ch0004521","main":true},{"actorName":"Seann William Scott","urlProfile":"http://www.imdb.com/name/nm0005405","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjk1NTA1Ml5BMl5BanBnXkFtZTcwNjQyNjAwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1976","placeOfBirth":" Cottage Grove, Minnesota, USA","birthName":"Sean William Scott","height":"5' 11\" (1.8 m)","bio":"Seann William Scott was born in Cottage Grove, Minnesota, to Patricia Anne (Simons) and William Frank Scott, a factory worker. He was discovered at a talent competition in Los Angeles, and almost immediately was flown to New York by ABC to test for All My Children (1970). His face has also been seen from his basketball-playing appearance on a national Sunny Delight commercial and the recent American Express campaign with Magic Johnson. Seann was also seen on Something So Right (1996) for ABC. Seann shot a lead role in Aerosmith's music video, \"Hole in My Soul\" from the \"Nine Lives\" CD. Previously, Seann has worked with Mark-Paul Gosselaar (of Saved by the Bell (1989)) and Talia Shire (Rocky (1976)) on the NBC movie of the week, Born Into Exile (1997), and has had a recurring role in the Warner Brothers TV series, Unhappily Ever After (1995), as well as appearing on Sweet Valley High (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjk1NTA1Ml5BMl5BanBnXkFtZTcwNjQyNjAwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005405","name":"Seann William Scott","idIMDB":"nm0005405"},"actorId":"nm0005405","character":"Crash","urlCharacter":"http://www.imdb.com/character/ch0004515","main":true},{"actorName":"Josh Peck","urlProfile":"http://www.imdb.com/name/nm0669681","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MDQyMjEyMl5BMl5BanBnXkFtZTcwMTc3NDY2Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1986","placeOfBirth":" New York City, New York, USA","birthName":"Joshua Michael Peck","height":"6' (1.83 m)","bio":"Josh Peck was born on November 10, 1986 in New York City, New York, USA as Joshua Michael Peck. He is an actor and producer, known for Ice Age: The Meltdown (2006), Red Dawn (2012) and Drake & Josh (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MDQyMjEyMl5BMl5BanBnXkFtZTcwMTc3NDY2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0669681","name":"Josh Peck","nicknames":["Pudge Master Flex","Joshman","Snowday"],"idIMDB":"nm0669681"},"actorId":"nm0669681","character":"Eddie","urlCharacter":"http://www.imdb.com/character/ch0004522","main":true},{"actorName":"Ciara Bravo","urlProfile":"http://www.imdb.com/name/nm2731980","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4MDQ0Mjk2MDdeQTJeQWpwZ15BbWU4MDA1NDM0NDgx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 March 1997","placeOfBirth":" Alexandria, Kentucky, USA","birthName":"Ciara Quinn Bravo","height":"5' 4\" (1.63 m)","bio":"Ciara was born in Northern Kentucky on the 18 of March, 1997. She resides with her father, mother, sister and brother. In 2006, Ciara participated in the Mike Beaty Talent Expo held in Dallas, Texas. There she was discovered by talent managers, Frederick Levy and Bryan Leder of \"Management 101.\" She has had early success with voice over work and local commercials.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4MDQ0Mjk2MDdeQTJeQWpwZ15BbWU4MDA1NDM0NDgx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2731980","name":"Ciara Bravo","idIMDB":"nm2731980"},"actorId":"nm2731980","character":"Peaches","urlCharacter":"http://www.imdb.com/character/ch0273496","main":true},{"actorName":"T.J. Miller","urlProfile":"http://www.imdb.com/name/nm2554352","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMzI0NTEwMF5BMl5BanBnXkFtZTcwMjk4MDkxNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1981","placeOfBirth":" Denver, Colorado, USA","birthName":"Todd Joseph Miller","height":"6' 2\" (1.88 m)","bio":"A comedian. Improvisation, Sketch and Stand-up comedy are his forte. Todd Joseph Miller was born in Denver, Colorado, to Leslie, a clinical psychologist, and Kent Miller, an attorney. He went to East High School, and college in Washington, D.C. There, he performed with the group receSs for 4 years, being the only person in his class out of 100 to audition and be accepted into the group. He remained the sole member of receSs until his junior year, when he was joined by Michael \"Tuck The Ruckus\" Tokaruk, an acclaimed comedian and equestrian, who taught T.J. how to ride a horse, a pastime he calls \"droll.\" He met his future wife, Kate Gorney, when they performed in \"A Chorus Line\" in university production of the musical. She played The Ballerina (being an accomplished ballerina herself) and he played Richie, the African American character. He credits the casting to East High School, which was a primarily black and Latino high school, and also that no black people auditioned for the part. During his Time in the nation's capital, he studied classical acting at B.A.D.A in Oxford, England and circus arts at Frichess Theatre Urbain. He was outstanding in the field of Stilt Walking, but was never able to execute any trick, at all, on Trapeze. He is an accomplished Clown and Juggler, having mastered 5 ball juggling, over fifty 3-ball tricks, clubs, torches, knives, and his specialty (which garnered him a Magician Membership to The Magic Castle in Hollywood, CA) Cigar Boxes. After graduating with honors (a bachelor's degree in Psychology with a concentration in Persuasion Theory and Social Influence) he moved to Chicago where he began performing with independent improvisation teams such as the group Chuckle Sandwich, the i.o. house team Bullet Lounge, The sketch group Heavy Weight (with Mark Raterman, Nick Vatterott & Brady Novak). He toured with Second City for almost 2 years (though he was never a company member of the MainStage), and during that time he missed over 15 flights to various cities the company toured to. During his time in Chicago, he performed Standup every night for almost 4 years, never taking a night off even on Holidays. He became a regular at Chicago's famed alternative room The Lincoln Lodge, and only performed at Chicago's Zanies Comedy Club 3 times in 4 years, apparently because they had an aversion to his absurdist style. Miller's first appearance on television was on The Standard Deviants, a PBS show aimed at providing educational DVDs and programming for schools. He played a knight and a dinosaur detective. Proficient in every medium of comedy (he considers even 'acting' simply another medium of comedy) he is also a Voice Over Artist, having worked for Old Style, Mucinex, Cars.com among other brands as well as in feature films & animated television shows. In 2011 he produced a 42 track E.P. entitled \"The Extended Play E.P.\" with Comedy Central Records, a Folk/Pop/Hip Hop concept album, which he describes as satirical; aimed at celebrities that cross over into other mediums they have no business being in simply because of their brand name (he also considers himself \"a proponent of the semicolon, \"it is underused and feared for no particular reason\"). He then remixed this album with Illegal Art, a legitimate music label, enlisting the roster of artists on the label (including the godfather of sampling, \"Steinski\") the same year. According to him, this was to prove that the album, when given to actual musicians, became superior to the original, in addition to satirizing artists that remix one song and sell it to listeners multiple times. He considers his greatest performance to be his portrayal of Ranger Jones, in Yogi Bear 3D, which filmed in New Zealand and wrapped shortly before his seizure that led to the discovery of an AVM (which he alleges confirmed rather than initiated his Absurdist Philosophy). He has stated multiple times that it was the pinnacle of his artistic career, and that \"it's in some ways comforting to have reached the pinnacle of his career so early on\" and that is has been all downhill since that point. Aside from being a major proponent of Denver, his hometown, he has done extensive charity work and continues to visit East High School, where he did his first stand-up performance in drama class. He credits his teacher, Melody Duggan, for much of his success and thanked her specifically in his speech when he won a Critic's Choice Award for best supporting actor in a comedy series (For HBO's Silicon Valley). He frequently cites his compulsive and almost pathologically driven work ethic as an altruistic effort to distract people from the tragedy that permeates everyday life, and believed that comedy would be more of a contribution than psychology, since instead of affecting only at most a few hundred people dramatically, he can affect millions of people in small increments. He has publicly stated he believes \"Comedians are the new philosophers\" and that academic philosophers are no longer relevant. However, he is a student of philosophy and subscribes to the ethical philosophy of John Stuart Mill (Utilitarianism), which states that one should make the most amount happiness for the most amount of people, which he cites as one of the reasons he made the his decision to be a comedian. His stand-up (as of 2015) is aimed at \"discussing Time and the release of the death anxiety.\" By the age of 33 he had read all of Nietzsche's works, and considers himself an Absurdist with philosophical roots in Nihilism. He resides in Los Angeles, where he struggles to make meaning in an uncertain world.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMzI0NTEwMF5BMl5BanBnXkFtZTcwMjk4MDkxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2554352","name":"T.J. Miller","idIMDB":"nm2554352"},"actorId":"nm2554352","character":"Prancer","urlCharacter":"http://www.imdb.com/character/ch0120564","main":true},{"actorName":"Billy Gardell","urlProfile":"http://www.imdb.com/name/nm0974080","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzNjQ4MDE0Ml5BMl5BanBnXkFtZTYwOTcxNzky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 August 1969","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"William R. Gardell","height":"5' 11\" (1.8 m)","bio":"Billy Gardell was born on August 20, 1969 in Pittsburgh, Pennsylvania, USA as William R. Gardell. He is an actor and producer, known for Mike & Molly (2010), Bad Santa (2003) and You, Me and Dupree (2006). He has been married to Patty Knight since 2001. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzNjQ4MDE0Ml5BMl5BanBnXkFtZTYwOTcxNzky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0974080","name":"Billy Gardell","idIMDB":"nm0974080"},"actorId":"nm0974080","character":"Santa","urlCharacter":"http://www.imdb.com/character/ch0004985","main":true},{"actorName":"Judah Friedlander","urlProfile":"http://www.imdb.com/name/nm0295103","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUzNzkwODIzOV5BMl5BanBnXkFtZTgwNDIyMzM0MDI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1969","placeOfBirth":" Gaithersburg, Maryland, USA","height":"5' 9\" (1.75 m)","bio":"Judah Friedlander was born on March 16, 1969 in Gaithersburg, Maryland, USA. He is an actor, known for 30 Rock (2006), The Wrestler (2008) and Star Wars: The Force Awakens (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUzNzkwODIzOV5BMl5BanBnXkFtZTgwNDIyMzM0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0295103","name":"Judah Friedlander","idIMDB":"nm0295103"},"actorId":"nm0295103","character":"Head Mini-Sloth","urlCharacter":"http://www.imdb.com/character/ch0342260","main":true},{"actorName":"Karen Disher","urlProfile":"http://www.imdb.com/name/nm0228327","urlPhoto":"","biography":{"dateOfBirth":"6 August 1972","placeOfBirth":"","bio":"Karen Disher was born on August 6, 1972. She is known for her work on Ice Age: A Mammoth Christmas (2011), Daria in 'Is It College Yet?' (2002) and Daria in 'Is It Fall Yet?' (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0228327","name":"Karen Disher","idIMDB":"nm0228327"},"actorId":"nm0228327","character":"Molehog","urlCharacter":"http://www.imdb.com/character/ch0379768","main":true},{"actorName":"Cindy Slattery","urlProfile":"http://www.imdb.com/name/nm1682096","urlPhoto":"","biography":{"bio":"Cindy Slattery is known for her work on Ice Age: The Meltdown (2006), Rio (2011) and Ice Age: Dawn of the Dinosaurs (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1682096","name":"Cindy Slattery","idIMDB":"nm1682096"},"actorId":"nm1682096","character":"Miscellaneous Animal Voices","urlCharacter":"http://www.imdb.com/character/ch0432652","main":true},{"actorName":"Chris Wedge","urlProfile":"http://www.imdb.com/name/nm0917188","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3OTE5MjcxNV5BMl5BanBnXkFtZTgwMTE0MTU0MjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1957","placeOfBirth":" Binghamton, New York, USA","birthName":"Christian Wedge","height":"6' (1.83 m)","bio":"John Christian Wedge was born on March 20, 1957 in Binghamton, New York. After graduating from Fayetteville-Manlius High School, Wedge went to study at the State University of New York at Purchase, where he received a BFA in film, and soon after that he went on to study at Ohio State University, earning him a MA in computer graphics and art education. Wedge began his career as an effects artist for films such as Tron (1982). In February, 1987, he founded Blue Sky Studios, along with Carl Ludwig, Dr. Eugene Troubetzkoy, Alison Brown, David Brown and Michael Ferraro. Throughout the 80s and 90s the studio helped create visual effects for television commercials and films like \"Alien Resurrection\" (1997), \"Star Trek: Insurrection\" (1998), \"Fight Club\" (1999) and \"Titan A.E.\" (2000). Wedge produced the short animated \"Bunny\", in 1998, which earned him an Academy Award for Best Animated Short Film. After Wedge directed the critically acclaimed feature film \"Ice Age\" (2002), Blue Sky Studios was finally established in to one of the top animation studios in the United States.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3OTE5MjcxNV5BMl5BanBnXkFtZTgwMTE0MTU0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0917188","name":"Chris Wedge","idIMDB":"nm0917188"},"actorId":"nm0917188","character":"Scrat","urlCharacter":"http://www.imdb.com/character/ch0004528","main":true},{"actorName":"Isabella Acres","urlProfile":"http://www.imdb.com/name/nm2699362","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMDA4Mjc1M15BMl5BanBnXkFtZTgwNjcyNjA2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Isabella Acres is known for her work on Hello, My Name Is Doris (2015), The Spoils of Babylon (2014) and Better Off Ted (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMDA4Mjc1M15BMl5BanBnXkFtZTgwNjcyNjA2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2699362","name":"Isabella Acres","idIMDB":"nm2699362"},"actorId":"nm2699362","character":"Additional Voices","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maggie Baird","urlProfile":"http://www.imdb.com/name/nm0047896","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMTI5OTk5M15BMl5BanBnXkFtZTgwNTE0NjY0NDE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"bio":"Maggie Baird is known for her work on Life Inside Out (2013), Mass Effect 2 (2010) and Six Feet Under (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMTI5OTk5M15BMl5BanBnXkFtZTgwNTE0NjY0NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0047896","name":"Maggie Baird","idIMDB":"nm0047896"},"actorId":"nm0047896","character":"Additional Voices","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2100546","urlIMDB":"http://www.imdb.com/title/tt2100546","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["26 min"],"soundMix":null,"color":["Color"],"aspectRatio":["16 : 9"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.5","filmingLocations":[],"rated":"TV-PG","awards":[{"award":"Motion Picture Sound Editors, USA 2012","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing - Sound Effects, Foley, Dialogue and ADR Animation in Television","names":[{"name":"Michael Silvers","id":"nm0799011","role":"supervising sound editor"},{"name":"Sue Fox","id":"nm0289270","role":"supervising foley editor"},{"name":"Jana Vance","id":"nm0888527","role":"foley artist"},{"name":"Dennie Thorpe","id":"nm0861658","role":"foley artist"},{"name":"Mac Smith","id":"nm0809181","role":"sound effects editor"},{"name":"Gwendolyn Yates Whittle","id":"nm0946705","role":"adr editor"}]}]}]}],"votes":"8,214","type":"Movie","companyCreditsSimple":[{"idCompany":"co0047265","name":"Blue Sky Studios"},{"idCompany":"co0051162","name":"Reel FX Creative Studios"},{"idCompany":"co0179259","name":"Twentieth Century Fox Animation"}],"keywords":{"keywords":["christmas","cgi animation"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:22:44"}}