{"data":{"movies":[{"title":"Patrick","originalTitle":"","year":"2013","releaseDate":"20140314","directors":[{"name":"Mark Hartley","id":"nm0366867"}],"writers":[{"name":"Justin King","id":"nm2718005"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NDM2MjM5Nl5BMl5BanBnXkFtZTgwNzEwNjQxMTE@._V1.jpg","countries":["Australia"],"languages":["English"],"genres":["Horror","Sci-Fi","Thriller"],"plot":"When a young nurse begins work at an isolated psychiatric ward, she quickly becomes fascinated with Patrick, a brain dead patient who is the subject of a mad scientist's cruel and unusual experiments. What starts as an innocent fascination quickly takes a sinister turn as Patrick begins to use his psychic powers to manipulate her every move, and send her life into a terrifying spiral out of control.","simplePlot":"At a private clinic, a young nurse soon discovers that one of the comatose patients is quite sinister.","actors":[{"actorName":"Charles Dance","urlProfile":"http://www.imdb.com/name/nm0001097","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY0Mjg4MzM0Ml5BMl5BanBnXkFtZTcwODc4NTIxNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1946","placeOfBirth":" Redditch, Worcestershire, England, UK","birthName":"Walter Charles Dance","height":"6' 3\" (1.91 m)","bio":"Charles Dance is an English actor, screenwriter, and film director. Dance typically plays assertive bureaucrats or villains. Some of his most high-profile roles are Tywin Lannister in HBO's Game of Thrones (2011), Guy Perron in The Jewel in the Crown (1984), Sardo Numspa in The Golden Child (1986), Dr. Jonathan Clemens in Alien 3 (1992), Benedict in Last Action Hero (1993), the Master Vampire in Dracula Untold (2014), Lord Havelock Vetinari in Terry Pratchett's Going Postal (2010) and Alastair Denniston in The Imitation Game (2014). He played the role of Tywin Lannister in HBO's Game of Thrones (2011), based on the Song of Ice and Fire novels by George R. R. Martin. In 1989, he played Bond creator Ian Fleming in Anglia Television's drama biography.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzY0Mjg4MzM0Ml5BMl5BanBnXkFtZTcwODc4NTIxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001097","name":"Charles Dance","idIMDB":"nm0001097"},"actorId":"nm0001097","character":"Doctor Roget","urlCharacter":"http://www.imdb.com/character/ch0380239","main":true},{"actorName":"Rachel Griffiths","urlProfile":"http://www.imdb.com/name/nm0341737","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3OTQzNzA0M15BMl5BanBnXkFtZTcwNTQ0ODkyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1968","placeOfBirth":" Melbourne, Victoria, Australia","height":"5' 9½\" (1.77 m)","bio":"Her mother, Anna Griffiths, is an art consultant. Her uncle is a Jesuit priest. Has two older brothers. One brother, Ben, is a ski instructor. Lived on the Gold Coast, Queensland until age five, then moved to Melbourne. Attended Star of the Sea Catholic Girls' College, did well at school and learned ballet. When she was 11, her father left home with an 18 year old woman. She hasn't seen him for years. Her mother was an art teacher at the time and raised the children alone. Has an Education Degree in dance and drama. Worked for the theatre company The Woolly Jumpers, in Geelong. Made famous by Muriel (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3OTQzNzA0M15BMl5BanBnXkFtZTcwNTQ0ODkyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341737","name":"Rachel Griffiths","idIMDB":"nm0341737"},"actorId":"nm0341737","character":"Matron Cassidy","urlCharacter":"http://www.imdb.com/character/ch0380241","main":true},{"actorName":"Sharni Vinson","urlProfile":"http://www.imdb.com/name/nm1801800","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWUzZjE2ZWYtNGEwNC00Mzg2LWFlNjItYWU2MjUxN2VjMGFhXkEyXkFqcGdeQXVyMTg3OTc4MDY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1983","placeOfBirth":" Sydney, New South Wales, Australia","height":"5' 6½\" (1.69 m)","bio":"Sharni Vinson was born in New South Wales, Australia and grew up in Sydney's southern beach superb of Cronulla, in the Sutherland Shire. As a teenager, she trained and competed at a National Level in swimming, holding a total of 4 State records throughout high school. Sharni began singing, dancing and acting at a young age, becoming the 3rd generation of performers in her family. Her Mother was a performer in musical theater, and her grandmother was Australia's youngest ballerina in 1945 to be offered a scholarship in the Borovansky Ballet Company in England. At the age of 12, Sharni enrolled as a student in the Brent Street School of Performing Arts in Sydney, where she trained in ballet, contemporary, hip hop, tap, drama, singing, and musical theater over the next 10 years. At the age of 17 Sharni graduated high school and within a month, was signed to Roadshow Music Australia as a member of the all girl pop group, \"Foxfire IV\", whose debut single 'Roses' reached the top 50 on Australia's ARIA's charts. Vinson is still best known amongst Australian audiences for her role as 'Cassie Turner' in the long running television series, \"Home and Away\". After having previously appeared twice on the show as minor characters, Vinson was asked to join the show permanently in 2004. Her performance earned her a nomination for 'Most Popular New Talent' at the TV Week Logie Awards in 2006. In 2008, Sharni announced she would be leaving the #1 Australian drama series to pursue a career in America, where she was immediately embraced by the entertainment industry. In January 2008, she was chosen by director David Nutter (Smallville, Supernatural), to appear in the $50M LG 'Scarlet' TV series advertisement campaign, shot in Bangkok,Thailand. From there, she booked continuous guest roles on CSI:NY, NCIS, My Boys, Cold Case, and CW pilot 'Austin Golden Hour'. She also secured herself the lead role in the pilot presentation, 'The Depths', produced by Gregory Bonann (creator/producer 'Baywatch'). In March 2009, after an extensive search for a leading lady with amazing dance capability, Vinson booked the coveted lead role of 'Natalie' in Disney's \"Step Up 3D\"- the third installment of the 'Step Up' dance film franchise. The physically demanding role required a brutal 5 month 'boot camp', which included lengthly days of weight lifting, dance rehearsals, dialect coaching, capoeira classes and parkour training. The 'Step Up' series has since become the most successful series of dance films in the world, with a total of 5 films collectively grossing over $450M worldwide. 'Step Up 3D', was released in August 2010 and has since alone, grossed over $180M worldwide. In need of an actress highly accomplished in water skills, Vinson portrayed the bitchy, pro-surfer 'Tara' in 'Blue Crush 2, Wild Coast' - a role which was later written in to add Vinson to the film. It was then asked that Vinson display her ocean savvy skills in the middle of shark infested waters in Durban, South Africa. The film required all of its actors to partake in a vigorous surf camp, where they all learned the ambidextrous skills of surfing. The film was released in June 2011 by Universal Studios Home Entertainment. By the end of 2011, Sharni had headed back to her home country, where she joined the Australian/Singaporean co-produced shark thriller 'BAIT 3D', written by Russell Mulcahy (Resident Evil- Extinction). The film was renamed 'Shark 3D' for Chinese audiences, which literally took a bite out of the China box office after it opened #1 in October 2012, grossing over $25M in its first 3 weeks in theaters. But it was Vinson's next role which would finally earn her the industry credibility and recognition she had been seeking. In March 2011, Sharni had auditioned for the low budget, indie horror film, titled \"YOU'RE NEXT\", which for months had been unable to cast its lead female actress. It was during her audition that the director and producers became convinced they had finally found their lead girl, and writer Simon Barrett re-created the role of 'Erin' to suit the actresses' native Australian background. During the film's premiere screening in 2011 at the Toronto International Film Festival, an immediate bidding war erupted, which eventually saw 'Lionsgate' win the battle to acquire the film. The company then soon merged with Summit Entertainment, creating a back log in their combined list of films, and by the time \"YOU'RE NEXT\" was finally released in September 2013, it had sat 'on the shelf' for 2 years. However, due to the buzz which had been building throughout the industry and by word of mouth of horror fans across the globe, the film managed to open to overwhelming success. 'YOU'RE NEXT' was across the board, named one of the \"best horror movies of 2013\", and Vinson's role as the perfect blend of girl-next-door meets tough action survivalist, has since earned her the title of America's new 'scream queen'. Vinson's most critically acclaimed role saw her take home Best Horror Actress at Fantastic Fest 2011. In October 2012 Sharni starred in the music video \"Put Your Hands Up\" for Matchbox 20. In November 2012, Sharni led the way in 'PATRICK', the remake of an Australian cult classic, originally released in 1978. She was asked to play the lead role of 'Nurse Kathy' opposite Charles Dance (Game of Thrones, Alien) and Rachel Griffiths (Six Feet Under, Brothers and Sisters). The film was shot in Melbourne, Australia, and again, earned Sharni critical acclaim for her portrayal of a caring nurse who becomes the subject of her telepathic, murderous coma patient. The Australian Film Critics Association nominated her performance for Best Actress in 2014 at the AFCA Awards. In June 2014, Sharni was asked to join Jackie Chan in his latest action adventure epic, \"Dragon Blade\", opposite John Cusack (Being John Malkovich) and Adrien Brody (The Pianist). As one of most costly Chinese films of all time, it released in February 2015 breaking all records at the box office in China. In \"Dragon Blade\", Sharni plays the Queen of the Roman Empire in the days of early war on the Silk Road. In October 2014, Sharni teamed up with NYFA film student Shantal Freedman to play small town cop 'Jackie' in her final graduation project at the New York Film Academy. The short film titled \"TICKETED\" went on to become an official selection for the 2015 Short Film Corner at Cannes International Film Festival, the LA Shorts Fest, and won Best Student Film at the LA Cinema Festival of Hollywood. Vinson also received an honorable mention for Best Principal Actress at the Independent Film Awards 2015. Most recently, Sharni was asked to join Adi Shankar's highly anticipated 'Gods and Secrets' which has generated interest from HBO. In the dark superhero series, Sharni plays the first female version of superhero 'The Flash,' set for release in early 2016. The series also stars Jane Seymore, Denise Richards, and WWE wrestler Diamond Dallas Page.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWUzZjE2ZWYtNGEwNC00Mzg2LWFlNjItYWU2MjUxN2VjMGFhXkEyXkFqcGdeQXVyMTg3OTc4MDY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1801800","name":"Sharni Vinson","idIMDB":"nm1801800"},"actorId":"nm1801800","character":"Kathy Jacquard","urlCharacter":"http://www.imdb.com/character/ch0380243","main":true},{"actorName":"Peta Sergeant","urlProfile":"http://www.imdb.com/name/nm1560632","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNjMzMjIxMF5BMl5BanBnXkFtZTgwNDkwNDMzODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Peta Sergeant is an actress and director, known for Iron Sky (2012), Crawlspace (2012) and Patrick (2013). She has been married to Rohan Nichol since 2008.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNjMzMjIxMF5BMl5BanBnXkFtZTgwNDkwNDMzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1560632","name":"Peta Sergeant","idIMDB":"nm1560632"},"actorId":"nm1560632","character":"Nurse Williams","urlCharacter":"http://www.imdb.com/character/ch0380246","main":true},{"actorName":"Damon Gameau","urlProfile":"http://www.imdb.com/name/nm0303902","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTc3MzY3Ml5BMl5BanBnXkFtZTgwNDkyMzM2MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Damon Gameau is an actor and director, known for The Tracker (2002), Thunderstruck (2004) and Raw (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTc3MzY3Ml5BMl5BanBnXkFtZTgwNDkyMzM2MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0303902","name":"Damon Gameau","idIMDB":"nm0303902"},"actorId":"nm0303902","character":"Ed Penhaligon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Martin Crewes","urlProfile":"http://www.imdb.com/name/nm0187695","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ0MDA0NDE2Ml5BMl5BanBnXkFtZTgwMjYwNjMyNzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1968","placeOfBirth":" Barnet, London, England, UK","height":"5' 9\" (1.75 m)","bio":"Martin Crewes, was born in Barnet, London, England in the year 1968. At age ten, he moved to Perth, Australia. He graduated in 1990 from the Western Australian Academy of Performing Arts with a Bachelors of Arts degree in Musical Theater. His father David, who was born in New Zealand, was a performing arts actor, participating in many plays in the UK and Australia, such as the Homecoming (1968). His younger sister Amanda Crewes is also an actress, and graduated from WAAPA in 1998 with a Bachelors in Performing Arts. She just finished performing in the Barking Gecko Theatre Company's production, The Rodeo Kid. His mother Elizabeth and aunt Marie were also performing arts actresses, and the Crewes family were part of Playlovers, an organization that features amateurs in theater in Floreat, WA Australia, for many years. Martin is mainly a Performing Arts actor. His Australian theater credits include: Barnum, The Wizard of Oz, Aspects of Love, Joseph and His Amazing Technicolor Dreamcoat, West Side Story. Martin is also a TV actor, and has appeared in many Australian TV shows such as Neighbours, RFDS, Phoenix and The Newlyweds. In 1995 Martin went to Asia to perform the role of Lt. Joe Cable in the musical South Pacific in Chiang Mai, Thailand. In 1996, he played Marius in the international tour of Les Miserables performing in Singapore, Hong Kong, Korea and Cape Town. In 1997, Martin moved to and worked in the UK, and again performed the role of Marius in Les Miserables in London's West End. Martin also appeared in many other musicals while living in London, such as The Rink and Pal Joey . Martin gained popularity in the UK when he spent two years in the hit Sky TV series Dream Team (1997), as the Hispanic player and manager Luis Amor Rodriguez. In this role, he gained recognition, because of the illicit love affair between his character Luis Amor Rodriguez, and the chairman's wife, Linda Block. In 1999-2000, he played Anthony Sullivan in series 1 and 2 of ITV mini- series Daylight Robbery (1999). In December 2000 Martin performed the opening number of the Royal Variety Performance. Two years later, Martin portrayed the role of Kaplan in the film Resident Evil (2002). He returned to Australia in late 2001, and has done 3 musicals. \"Oh! What a night\", \"Hair\" and from August to October 2002, he portrayed the role as \"The Man\" Jim Ryan in \"The Man from Snowy River Arena Spectacular\", which was a huge success through out Australia. His most recent performance was when he played Marius in a concert tour of \"Les Miserables\" in Denmark, Sweden, Norway and Finland in October and November 2002.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ0MDA0NDE2Ml5BMl5BanBnXkFtZTgwMjYwNjMyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0187695","name":"Martin Crewes","idIMDB":"nm0187695"},"actorId":"nm0187695","character":"Brian Wright","urlCharacter":"http://www.imdb.com/character/ch0380247","main":true},{"actorName":"Eliza Taylor","urlProfile":"http://www.imdb.com/name/nm1343638","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjIxNjYyMl5BMl5BanBnXkFtZTcwMzAyNzk4OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 October 1989","placeOfBirth":" Melbourne, Victoria, Australia","birthName":"Eliza Jane Taylor-Cotter","height":"5' 5\" (1.65 m)","bio":"Eliza Jane Taylor (born on 24 October 1989 in Melbourne, Australia) is an Australian actress who is perhaps best known for her regular role as \"Janae Timmins\" on the Australian television series Les voisins (1985). Eliza has just finished the feature film Patrick (2013), alongside Rachel Griffiths, and nabbed the lead in the CW pilot The 100 (2014). \"The 100\" is Taylor's first American production.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjIxNjYyMl5BMl5BanBnXkFtZTcwMzAyNzk4OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1343638","name":"Eliza Taylor","nicknames":["Liza-Loo"],"idIMDB":"nm1343638"},"actorId":"nm1343638","character":"Nurse Panicale","urlCharacter":"http://www.imdb.com/character/ch0380249","main":true},{"actorName":"Simone Buchanan","urlProfile":"http://www.imdb.com/name/nm0118079","urlPhoto":"","biography":{"dateOfBirth":"11 March 1968","placeOfBirth":" Marrickville, Sydney, New South Wales, Australia","birthName":"Simone Louise Buchanan","height":"5' 1\" (1.55 m)","bio":"Simone Buchanan was born on March 11, 1968 in Marrickville, Sydney, New South Wales, Australia as Simone Louise Buchanan. She is an actress, known for Hey Dad..! (1987), Les voisins (1985) and Shame (1988). She has been married to Brett Smith since April 5, 2008. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0118079","name":"Simone Buchanan","nicknames":["Mon"],"idIMDB":"nm0118079"},"actorId":"nm0118079","character":"Patrick's Mother","urlCharacter":"http://www.imdb.com/character/ch0380251","main":true},{"actorName":"Shane Nagle","urlProfile":"http://www.imdb.com/name/nm2536529","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5ODU1Mjc4NF5BMl5BanBnXkFtZTcwMjg4NjMxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 3\" (1.91 m)","bio":"Shane Nagle is known for his work on Wakey Wakey (2012), Patrick (2013) and Water Me Before I Die (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5ODU1Mjc4NF5BMl5BanBnXkFtZTcwMjg4NjMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2536529","name":"Shane Nagle","idIMDB":"nm2536529"},"actorId":"nm2536529","character":"Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Fortuna","urlProfile":"http://www.imdb.com/name/nm1051037","urlPhoto":"","biography":{"bio":"Chris Fortuna is an actor and writer, known for You're Skitting Me (2012), The Heckler (2014) and Patrick (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1051037","name":"Chris Fortuna","idIMDB":"nm1051037"},"actorId":"nm1051037","character":"Fraser","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rod Mullinar","urlProfile":"http://www.imdb.com/name/nm0612367","urlPhoto":"","biography":{"dateOfBirth":"1942","placeOfBirth":" Hereford, England, UK","height":"6' 1½\" (1.87 m)","bio":"Rod Mullinar was born in 1942 in Hereford, England. He is an actor, known for Calme blanc (1989), Ryan (1973) and Five Mile Creek (1983).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0612367","name":"Rod Mullinar","idIMDB":"nm0612367"},"actorId":"nm0612367","character":"Morris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"María Mercedes","urlProfile":"http://www.imdb.com/name/nm0580224","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NTI0Mjk1N15BMl5BanBnXkFtZTgwMDcwNTkwNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"María Mercedes is an actress, known for De plein fouet (1998), Coma (1978) and Love Never Dies (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NTI0Mjk1N15BMl5BanBnXkFtZTgwMDcwNTkwNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0580224","name":"María Mercedes","idIMDB":"nm0580224"},"actorId":"nm0580224","character":"Doctor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Camilla Jackson","urlProfile":"http://www.imdb.com/name/nm2180928","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NTYzODg0OV5BMl5BanBnXkFtZTgwOTM3NjY4NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Camilla Jackson is an actress and producer, known for The Last Heist (2016), Patrick (2013) and Les voisins (1985).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NTYzODg0OV5BMl5BanBnXkFtZTgwOTM3NjY4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2180928","name":"Camilla Jackson","idIMDB":"nm2180928"},"actorId":"nm2180928","character":"Nurse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brendan Bacon","urlProfile":"http://www.imdb.com/name/nm1812240","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGI1MzlmOWEtNGM2NC00YzJlLTg5OTYtYTMxMjEyOWY1Mjc1L2ltYWdlXkEyXkFqcGdeQXVyMjczNDkxMDk@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"birthName":"Brendan John Bacon","height":"5' 9\" (1.75 m)","bio":"Brendan Bacon was born as Brendan John Bacon. He is known for his work on Spin Out (2016), The Mule (2014) and Knowing (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGI1MzlmOWEtNGM2NC00YzJlLTg5OTYtYTMxMjEyOWY1Mjc1L2ltYWdlXkEyXkFqcGdeQXVyMjczNDkxMDk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1812240","name":"Brendan Bacon","idIMDB":"nm1812240"},"actorId":"nm1812240","character":"Diving Accident","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carole-Ann Aylett","urlProfile":"http://www.imdb.com/name/nm0043856","urlPhoto":"","biography":{"dateOfBirth":"1936","placeOfBirth":" Bromley, Kent, England, UK","bio":"Carole-Ann Aylett was born in 1936 in Bromley, Kent, England. She is an actress, known for Coma (1978), Road Games (1981) and Never Was (1978). She was previously married to Terry Gill.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0043856","name":"Carole-Ann Aylett","idIMDB":"nm0043856"},"actorId":"nm0043856","character":"Barmaid","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2147459","urlIMDB":"http://www.imdb.com/title/tt2147459","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Hawk Anamorphic Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":["Hawk Scope"],"printedFilmFormat":null},"rating":"4.9","metascore":"48","filmingLocations":[{"location":"Docklands Studios, Melbourne, Victoria, Australia"}],"rated":"NOT RATED","awards":[{"award":"Australian Film Critics Association Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated AFCA Award","categories":[{"category":"Best Actress","names":[{"name":"Sharni Vinson","id":"nm1801800","role":null}]},{"category":"Best Supporting Actor","names":[{"name":"Charles Dance","id":"nm0001097","role":null}]}]}]}],"votes":"3,135","type":"Movie","companyCreditsSimple":[{"idCompany":"co0234956","name":"Screen Australia"},{"idCompany":"co0017788","name":"F.G. Film Productions"},{"idCompany":"co0003913","name":"Film Victoria"}],"keywords":{"keywords":["nurse","psychic power","comatose","latex gloves","bare breasts","horror movie remake","ozploitation","telekinesis","remake","hospital","one word title","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:59:41"}}