{"data":{"movies":[{"title":"Mockingbird","originalTitle":"","year":"2014","releaseDate":"20141007","directors":[{"name":"Bryan Bertino","id":"nm1052162"}],"writers":[{"name":"Bryan Bertino","id":"nm1052162"},{"name":"Bryan Bertino","id":"nm1052162"}],"runtime":"81 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ0NmYyMmEtMmRkNi00OGRkLWJjNTItMTMzYjlmZjY1MGJiXkEyXkFqcGdeQXVyNjAwNjQ1NTg@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Thriller"],"plot":"The middle class Emmy receives a video camera at home and her husband Tom starts filming. They believe they won a prize from the mall. The college student Beth is alone and bored in the empty campus and also receives a camera. Out of the blue, they are instructed to film and not call the police; otherwise they will die. Meanwhile the unemployed Leonard that lives with his mother receives a clown outfit and make-up and instructions to receive ten thousand dollars. After moments of tension, their lives are tragically entwined. Who is the stranger behind the prank?","simplePlot":"A couple are given a camera and a set of instructions which they must follow or else someone will die.","actors":[{"actorName":"Natalie Alyn Lind","urlProfile":"http://www.imdb.com/name/nm2480636","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzIyMzM3OTYtM2Y1OS00M2Q2LWJkYmEtNDg2M2U5ZThjYjA1XkEyXkFqcGdeQXVyMjEyNzkzMTU@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Natalie Alyn Lind, the oldest of the three Lind sisters, all working actresses, grew up surrounded by the entertainment industry. Her mother is also an actress who starred in feature films and on several TV series including the hit drama \"One Tree Hill\". Natalie booked her first guest role at 4 years old on the same drama alongside her mom. As a young girl, she spent her time traveling back and forth between the series location in North Carolina and her home in California. Her father is an LA based producer. Upon her family's permanent return to LA, Natalie began to book a number of guest star appearances on such series as Lifetime's \"Army Wives\", Nickelodeon's \"iCarly\", CBS's ''Flashpoint'', Disney's \"Wizards of Waverly Place\", CBS's \"Criminal Minds\", as well as a lead role in Lifetime's \"Playdate\". Natalie has matured into a fine actress whose credits include TNT's \"Murder In The First\", ABC's \"The Goldbergs\", and Fox's \"Gotham\". Natalie recurs on the hit ABC comedy \"The Goldbergs\" as 'Dana Caldwell', currently in its third season. She also recurs on Fox's gritty crime drama \"Gotham\" playing one of her favorite villains Silver St. Cloud, a dream role for a diehard Batman fan. An added plus of working on Gotham is being able to explore the iconic sets and locations only a city like New York can provide. Natalie also has many upcoming projects in the works, including the Universal horror film, \"Mockingbird\". Although Natalie is a very busy actress, especially living a bi-coastal lifestyle, she finds time to hike with her dog Georgie, and write scripts. One charity Natalie and her family hold dear to their hearts is the Make-A-Wish Foundation, a charity that grants wishes to children diagnosed with life-threatening medical conditions. Being a surfer, Natalie is also active with the Save the Bay Foundation and the Mermaid project to save our beaches.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzIyMzM3OTYtM2Y1OS00M2Q2LWJkYmEtNDg2M2U5ZThjYjA1XkEyXkFqcGdeQXVyMjEyNzkzMTU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2480636","name":"Natalie Alyn Lind","idIMDB":"nm2480636"},"actorId":"nm2480636","character":"Jacob's Friend #4","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Audrey Marie Anderson","urlProfile":"http://www.imdb.com/name/nm1017524","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ3NDQ3ODQ5NV5BMl5BanBnXkFtZTgwNDk5NTc2ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 March 1975","placeOfBirth":" Fort Worth, Texas, USA","height":"5' 6\" (1.68 m)","bio":"Audrey Marie Anderson born March 7, 1975 is an American actress and model.In the early 1990s, Anderson began a modeling career, being featured in advertisements for brands such as Armani, Gap, Biotherm, Target and American Eagle Outfitters over the course of it, before having a recurring role in ABC drama series Once and Again. She also appeared in the series Still Life and Going to California and was a guest star on Without a Trace. Her film credits include Drop Dead Sexy, Moonlight Mile, and Least Among Saints. She also guest starred on NCIS: Los Angeles, Private Practice, and House. In 2013, she had recurring roles on Arrow as Lyla Michaels, and The Walking Dead as Lilly.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ3NDQ3ODQ5NV5BMl5BanBnXkFtZTgwNDk5NTc2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1017524","name":"Audrey Marie Anderson","idIMDB":"nm1017524"},"actorId":"nm1017524","character":"Emmy","urlCharacter":"http://www.imdb.com/character/ch0507646","main":true},{"actorName":"Emily Alyn Lind","urlProfile":"http://www.imdb.com/name/nm3014840","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYxMzQ0OTE4NV5BMl5BanBnXkFtZTgwMjU1Mjc5NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 1\" (1.55 m)","bio":"Emily Alyn Lind's body of work would be impressive for any Hollywood actress, but for a rising star at such a young age, it is quite remarkable. It is not surprising though, given her family's film background. She is the middle daughter of producer and assistant director John Lind, and actress Barbara Alyn Woods, best known for her role as Deb Scott in the long-running CW series, \"One Tree Hill.\" Emily began her acting career with the role of 'Young Lily,' in \"The Secret Life of Bees.\" At the age of five years old, she played 'Young Linda' in Gaspar Noe's \"Enter the Void\" and the following year was the red carpet darling when the film premiered at the Cannes Film Festival. In 2009, Emily's venture into television began when she became a popular face, recurring as 'Emily Gardener' on the ABC series \"Eastwick\" and on the daytime drama \"All My Children\" as 'Emma Lavery.' She continued to be seen on hit television series such as \"Medium,\" \"Criminal Minds,\" \"Hawaii 5-O,\" \"Suburgatory,\" Lifetime's \"Who is Clark Rockefeller?\", and \"Sundays at Tiffany's.\" She is also widely known for the ABC hit series, \"Revenge,\" playing 'Young Amanda Clarke.' In 2011, Emily was given the amazing opportunity to play Shirley Temple in Clint Eastwood's \"J. Edgar,\" opposite Leonardo DiCaprio. And in 2012, she had two films premiere; the thriller, \"The Haunting in Connecticut 2,\" playing the lead role of 'Heidi,' and \"Won't Back Down,\" playing 'Malia Fitzpatrick,' a young girl struggling with dyslexia where she starred opposite Maggie Gyllenhaal. Following, Emily starred in the movie musical \"Dear Dumb Diary,\" playing the lead role of 'Jamie Kelly,' based on the popular children's book series. Alongside the release of the critically acclaimed film, her soundtrack for the film is currently available on iTunes. One of her favorite projects was Venice Film Festival's \"Jackie and Ryan\" (2014), co- starring Katherine Heigl and Ben Barnes, where she was able to once again show off her musical skills. From there, she went straight into production on the Warner Brothers thriller, \"Hidden\" (2015), where she takes on the challenging role of a young girl surviving underground, co-starring alongside Alexander Skarsgard and Andrea Riseborough. Along with working on the ABC pilot \"Code Black\" and the comedy/action series for CBS, \"Rush Hour\", Emily has just completed production on the New Line horror film, \"Lights Out\", playing 'Sophie' (a young Maria Bello) and the highly anticipated New Line feature comedy/horror film \"The Babysitter\" directed by McG and playing the lead love interest, 'Melanie'. Not only is Emily a talented young actress, but she feels strongly about giving back. She is passionate about the Make-A-Wish Foundation, an organization that grants the wish of a child diagnosed with a life-threatening medical condition, and has raised thousands of dollars for the charity. Her love for Make-A-Wish began when she played the part of 'Vanessa Marks,' a young girl battling cancer, in the movie \"November Christmas.\" Emily created a 'love box' to keep on the set of \"November Christmas,\" which encouraged people to donate to the charity. Emily raised so much money that she decided that she would create a 'love box' for every set she was on. From then on, her love and passion for the foundation only grew.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYxMzQ0OTE4NV5BMl5BanBnXkFtZTgwMjU1Mjc5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3014840","name":"Emily Alyn Lind","idIMDB":"nm3014840"},"actorId":"nm3014840","character":"Abby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Spencer List","urlProfile":"http://www.imdb.com/name/nm1478535","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMTI1MzIxMV5BMl5BanBnXkFtZTgwODIwNTE2ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 April 1998","placeOfBirth":" Florida, USA","birthName":"Spencer W. List","height":"6' 0½\" (1.84 m)","bio":"Born April 6th, 1998, Spencer List is an actor who began his career at an early age in various films, television series, and commercials. Spencer recently wrapped the independent feature \"The Bachelors,\" written and directed by Kurt Voelker, opposite J.K. Simmons and Josh Wiggins. Most recently, Spencer co-starred in \"Hard Sell\", opposite Skyler Gisondo and Kristin Chenoweth, as well as the lead in \"Night Has Settled,\" directed by Steve Clark, with Adriana Barraza and Pilar Lopez de Ayala. Spencer also starred as the title role in Famke Janssen's directorial debut \"Bringing Up Bobby,\" with Milla Jovovich, Bill Pullman and Marcia Cross. His additional film credits include James Franco's \"Black Dog Red Dog,\" Jason Blum's \"Mockingbird,\" and starred opposite his twin sister and fellow actor Peyton List in the indie horror thriller \"Bereavement.\" On the small screen, Spencer has guest-starred on such hit series as Disney's \"Bunk'd,\" CBS' \"CSI: Miami,\" Fox's \"Fringe,\" Nickelodeon's \"iCarly\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMTI1MzIxMV5BMl5BanBnXkFtZTgwODIwNTE2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1478535","name":"Spencer List","nicknames":["Spence"],"idIMDB":"nm1478535"},"actorId":"nm1478535","character":"Jacob Henry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Todd Stashwick","urlProfile":"http://www.imdb.com/name/nm0823693","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MzUyMDExNl5BMl5BanBnXkFtZTgwMTg0ODI2MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 October 1968","placeOfBirth":" Chicago, Illinois, USA","height":"6' 2\" (1.88 m)","bio":"Stashwick was born in Chicago and raised in the suburbs right outside of the city. As a child, he always loved making people laugh, and he aspired to one day perform at Chicago's famous The Second City. Soon after graduating from Illinois State University with a degree in Theatre, he began performing at several local improvisational theaters, and his dream came true when he was hired in 1992 to tour nationally with The Second City. Following productions at The Second City Detroit and The Second City Northwest, he moved to New York. There, he formed a company of improvisers and began staging the underground critically acclaimed \"Burn Manhattan\" all over the city. Other performers included Kate Walsh, Jeremy Piven and Spencer Kayden. Aside from his work in improvisational theatre, Stashwick worked for several years in late 1997 through Spring 2000 on \"Late Night With Conan O'Brien,\" performing as part of their rotating stable of comedy actors. Work in television and film ultimately drew him to Los Angeles where he soon landed roles in pilots and series and film. Stashwick remains true to his improvisational roots, and he produces, performs and teaches at his own improvisational theatre that he co-founded in North Hollywood called \"The Hothouse\". In addition he performs annually with the Macabre improv cabaret The Doubtful Guests who just celebrated their ten year anniversary. He has also taught and performed his unique style of avant-garde improvisation internationally. He directed a show in Liverpool called \"Hoof!,\" which still tours throughout Europe. He is also the writer and co-creator of the online action/horror web comic Devil Inside. He publishes a new free episode weekly on his website www.toddstashwick.com. The comic has brought him to comic book conventions across the country with his collaborator, comic book artist Dennis Calero. Stashwick resides in Los Angeles with his wife Charity, whom he married in 1997 in the middle of Times Square in front of twenty close family members and friends, as well as all of New York City. The couple has two children. Their household also includes two dogs, two cats and a Conure (small parrot). In his spare time, Stashwick enjoys surfing, noodling on the ukulele, writing screenplays and pilots. He's an avid TV (his current favorites are Breaking Bad, Walking Dead and Doctor Who) and a huge Film buff (Star Wars, There Will be Blood and Hedwig and the Angry Inch are among his favorites) . A shameless geek he can be found playing video games with his son or with his nose buried in a comic book. He's been a vegetarian since 1988. He loves traveling overseas as often as his hectic schedule permits. A self-professed Anglophile, Stashwick loves English comedy, music and television.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MzUyMDExNl5BMl5BanBnXkFtZTgwMTg0ODI2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0823693","name":"Todd Stashwick","idIMDB":"nm0823693"},"actorId":"nm0823693","character":"Tom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lee Garlington","urlProfile":"http://www.imdb.com/name/nm0307600","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MDgxMTMyNV5BMl5BanBnXkFtZTcwMzI4MzY3OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 July 1953","placeOfBirth":" Teaneck, New Jersey, USA","birthName":"Ann Leslie Garlington","height":"5' 9\" (1.75 m)","bio":"Lee Garlington was born on July 20, 1953 in Teaneck, New Jersey, USA as Ann Leslie Garlington. She is an actress and director, known for One Hour Photo (2002), A Lot Like Love (2005) and American Pie 2 (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MDgxMTMyNV5BMl5BanBnXkFtZTcwMzI4MzY3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0307600","name":"Lee Garlington","idIMDB":"nm0307600"},"actorId":"nm0307600","character":"Mom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alyvia Alyn Lind","urlProfile":"http://www.imdb.com/name/nm4865040","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMjA5ODM0N15BMl5BanBnXkFtZTgwNDQ2ODQyNzE@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"bio":"Alyvia Alyn Lind grew up in Los Angeles, and it is no wonder that at eight years old, the little blonde actress impresses any adult four times her age. \"I have a lot of fun being an actress, but I also know how serious it is\" is the exact attitude that has helped Alyvia land several recurring roles and six films. Alyvia is best known for her portrayal of the living legend, Dolly Parton, in the NBC Universal telefilm, \"Coat of Many Colors.\" Aly was recognized by the prestigious Critics' Choice Awards by being nominated for best actress alongside Rachel McAdams, Kathy Bates, and Kirsten Dunst, and she was also nominated and won the Movieguide's Grace Award for Best Actress. Not only did the MOW break records with 18.6 million viewers, which made COMC the highest-rated movie or miniseries on the broadcast networks in six years, the film walked away with numerous awards, including The Tex Ritter Award and the coveted Epiphany Prize given by the Movieguide Awards. One of Alyvia's favorite parts of working on the film was singing her solos, and recording \"Angel Hill\" an original duet with Dolly Parton. Alyvia is also known for the much publicized, campy Lifetime movie, \"A Deadly Adoption\" where she had the time of her life playing Will Ferrell's and Kristen Wiig's kidnapped daughter. The young actress can be seen in the Warner Bros. film \"Blended\" alongside Adam Sandler, Drew Barrymore and Bella Thorne. Alyvia plays the precocious and sweet 'Lou Friedman,' the youngest daughter of Sandler. Alyvia got her start on the hit ABC series \"Revenge\" as the five-year-old Amanda Clarke. She can be seen in the television daytime drama \"The Young and the Restless\" as 'Faith Newman,' as well as the sweet but wisecracking 'Charlotte' on the Nick @ Nite comedy \"See Dad Run\" with Scott Baio. Alyvia appeared on the big screen in Dimension Film's \"Dark Skies\" (2013) with Keri Russell and Josh Hamilton. Last year she was seen in Universal Pictures' \"Mockingbird,\" a thriller starring Spencer List and Audrey Marie Anderson (\"Arrow\" and \"The Unit\") and the feature film \"Shangri-La Suite\" opposite Ashley Greene and Emily Browning in which Alyvia portrays Lisa Marie Presley, daughter of Elvis and Priscilla Presley. Currently, Alyvia is juggling two series, recurring on the hit Amazon show \"Transparent\" as Gracie, and also the critically acclaimed \"Masters of Sex\" for Showtime, playing Masters' daughter. She also recently wrapped the TNT period pilot \"Miami Project\" for Michael Bay, squeezed in a guest appearance on the comedy \"Teachers\" playing Annika, a foreign exchange student (she learned to speak Swedish for the role), and just finished working with some of her favorite Disney actors on \"Gamers Guide\" playing a trash talking gamer. Alyvia grew up with two older sisters, Natalie and Emily, (both actresses)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMjA5ODM0N15BMl5BanBnXkFtZTgwNDQ2ODQyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4865040","name":"Alyvia Alyn Lind","idIMDB":"nm4865040"},"actorId":"nm4865040","character":"Megan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Benjamin Stockham","urlProfile":"http://www.imdb.com/name/nm2874462","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjIxMTYxN15BMl5BanBnXkFtZTgwMDEwMDAwNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Benjamin Stockham is an actor, known for About a Boy (2014), Lost & Found (2016) and B.O.O.: Bureau of Otherworldly Operations.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjIxMTYxN15BMl5BanBnXkFtZTgwMDEwMDAwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2874462","name":"Benjamin Stockham","idIMDB":"nm2874462"},"actorId":"nm2874462","character":"Jacob's Friend #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexandra Lydon","urlProfile":"http://www.imdb.com/name/nm1605097","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MDU5NTgzNV5BMl5BanBnXkFtZTcwNDkyMzM5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1979","placeOfBirth":"","bio":"Alexandra is originally from Dorchester, Massachusetts and comes from a family of Boston Irish cops. Alexandra moved to New York City to pursue a career in acting when she was 18. She graduated with honors from New York University's Tisch School of the Arts with a dual degree in Drama and Psychology and studied at the Stella Adler Studio. After graduating from NYU, Alexandra performed in Off-Broadway and Regional Theatre, studied with Joseph Chaikin in his final master classes in NYC, and continued her classical theatre training with Patsy Rodenburg from The National Theatre in London.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MDU5NTgzNV5BMl5BanBnXkFtZTcwNDkyMzM5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1605097","name":"Alexandra Lydon","idIMDB":"nm1605097"},"actorId":"nm1605097","character":"Beth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Colby French","urlProfile":"http://www.imdb.com/name/nm0294062","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MzY0MDMwOF5BMl5BanBnXkFtZTYwOTI1NzQz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Colby French is known for his work on Changeling (2008), Game Change (2012) and Eagle Eye (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MzY0MDMwOF5BMl5BanBnXkFtZTYwOTI1NzQz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0294062","name":"Colby French","idIMDB":"nm0294062"},"actorId":"nm0294062","character":"Gary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Isabella Murad","urlProfile":"http://www.imdb.com/name/nm2641113","urlPhoto":"","biography":{"bio":"Isabella Murad is an actress, known for Phineas and Ferb the Movie: Across the 2nd Dimension (2011), Phineas and Ferb (2007) and Special Agent Oso (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2641113","name":"Isabella Murad","idIMDB":"nm2641113"},"actorId":"nm2641113","character":"Jacob's Friend #3","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kai Caster","urlProfile":"http://www.imdb.com/name/nm2462476","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1OTQ3NDUwM15BMl5BanBnXkFtZTgwMzIyMzk0ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Kai Caster is an actor, known for The Darkness is Close Behind (2011), Children of the Corn: Genesis (2011) and Babysitter Wanted (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1OTQ3NDUwM15BMl5BanBnXkFtZTgwMzIyMzk0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2462476","name":"Kai Caster","idIMDB":"nm2462476"},"actorId":"nm2462476","character":"Jacob's Friend #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barak Hardley","urlProfile":"http://www.imdb.com/name/nm3462502","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWM0MzM1ZDctZjRkOS00MDYzLTk5NWQtOTNlOWQ2YTc1ODg4XkEyXkFqcGdeQXVyMTUzNjA4MzM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 July 1975","placeOfBirth":" St. Petersburg, Florida, USA","bio":"Barak Hardley was born on July 28, 1975 in St. Petersburg, Florida, USA. He is an actor and writer, known for Togetherness (2015), Bounty Killer (2013) and The Bronze (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWM0MzM1ZDctZjRkOS00MDYzLTk5NWQtOTNlOWQ2YTc1ODg4XkEyXkFqcGdeQXVyMTUzNjA4MzM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3462502","name":"Barak Hardley","idIMDB":"nm3462502"},"actorId":"nm3462502","character":"Leonard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny Vasquez","urlProfile":"http://www.imdb.com/name/nm2335463","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NDY5OTAyMF5BMl5BanBnXkFtZTcwOTUzNzIyOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Danny Vasquez is an actor, known for Ant-Man (2015), Elimination (2010) and Quinceañera (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NDY5OTAyMF5BMl5BanBnXkFtZTcwOTUzNzIyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2335463","name":"Danny Vasquez","idIMDB":"nm2335463"},"actorId":"nm2335463","character":"Guy 1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yelyna De Leon","urlProfile":"http://www.imdb.com/name/nm0209680","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg1MTI1NzgyM15BMl5BanBnXkFtZTgwNTUyNjU1ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Yelyna De Leon was born in Chicago, Illinois, USA. She is an actress and writer, known for A Better Life (2011), Bones (2005) and Ray Donovan (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg1MTI1NzgyM15BMl5BanBnXkFtZTgwNTUyNjU1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0209680","name":"Yelyna De Leon","idIMDB":"nm0209680"},"actorId":"nm0209680","character":"Roller Derby Mom","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2125685","urlIMDB":"http://www.imdb.com/title/tt2125685","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 21 min (81 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.1","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"NOT RATED","awards":[],"votes":"1,665","type":"Movie","companyCreditsSimple":[{"idCompany":"co0098315","name":"Blumhouse Productions"},{"idCompany":"co0093810","name":"Marc Platt Productions"},{"idCompany":"co0289755","name":"Unbroken Pictures"}],"keywords":{"keywords":["blood","found footage","child murder","death","blood splatter","one night","no survivors","death of protagonist","killer child","written by director","shot in the eye","shot in the chest","street in title","grocery store","cake","jack in the box","vcr","hiding in a closet","killing an animal","rollerskating rink","transmitter","kicked in the crotch","character repeating someone else's dialogue","pistol","mannequin","balloon","women's bathroom","vhs","title appears in writing","clown","lightning","polaroid camera","polaroid","storm","mother son relationship","rain","dead cat","no opening credits","husband wife relationship","video camera","child shot in the head","murder","shot to death","shot in the forehead","vinyl","subjective camera","year 1995","title spoken by character","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 00:04:20"}}