{"data":{"movies":[{"title":"The Muppets on Puppets","originalTitle":"","year":"1970","releaseDate":"19700105","directors":[{"name":"Tim Steele","id":"nm0824682"}],"runtime":"57 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGY0YWJlMjYtMmNmYS00YTQ0LWI0NzQtNjhiNzIyNDU3ZWYwXkEyXkFqcGdeQXVyNDUxNjc5NjY@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Documentary"],"plot":"Jim Henson and Rowlf the Dog explain the art and history of puppetry, and let the viewer in on some of the secrets in performing his own act, the Muppets.","simplePlot":"Jim Henson and Rowlf the Dog explain the art and history of puppetry, and let the viewer in on some of the secrets in performing his own act, the Muppets.","actors":[{"actorName":"Jim Henson","urlProfile":"http://www.imdb.com/name/nm0001345","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMzI3MjAwM15BMl5BanBnXkFtZTcwODIzMDk1OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 September 1936","placeOfBirth":" Greenville, Mississippi, USA","birthName":"James Maury Henson","height":"6' 1\" (1.85 m)","bio":"Jim Henson never thought that he would make a name of himself in puppetry; it was merely a way of getting himself on television. The vehicle that achieved it was Sam and Friends (1955), a late-night puppet show that was on after the 11:00 news in Washington DC. It proved to be very popular and inspired Jim to continue using puppets for his work. He made many commercials, developing the signature humor that Henson Productions is known for. A key reason for the success of his puppets is that Jim realized he didn't need to hide puppeteers behind a structure when they were in front of a camera. All he had to do was instruct the camera operators to focus on the puppets and keep the puppeteers out of the frame. This allowed the puppets to dominate the image and make them more lifelike. This work on puppets and television would lead to separate projects that had different goals. The first one was his work on the The Jimmy Dean Show (1963) with the character Rowlf the Dog, the oldest clearly identified character that Henson Productions still uses. This show provided an income that allowed Jim to work on a pet project. That project was Time Piece (1965), a surrealistic short about time which was nominated for best live-action short Oscar. Henson shot to prominence when he was approached to use his muppets for the revolutionary educational show Sesame Street (1969). The show was a smash hit and his characters have become staples on public television. Unforetunately, this also led to Henson being typecast as only an entertainer for children. He sought to disprove that by being part of the initial crew of Saturday Night Live (1975), but his style and that of the creative staff simply didn't jibe. It was this circumstance that encouraged him to develop a variety show format that had the kind of sophisticated humor that \"Sesame Street (1969)\" didn't work with. No American broadcaster was interested, but British producer Lew Grade was. This led to The Muppet Show (1976). It initially struggled both in the ratings and in the search for guest stars, but in the second season it became a smash hit and would eventually become the most widely watched series in television history. Hungry for a new challenge, Henson made The Muppet Movie (1979), defying the popular industry opinion that his characters would never work in a movie. The film became a hit and spawned a series of features which included the moody fantasy The Dark Crystal (1982), which was a drastic and bold departure from the amiable tone of his previous work. The most successful TV work in the 1980s was Fraggle Rock (1983), a fantasy series specifically designed to appeal to as many cultural groups as possible. During this time he also established the Creature Shop, a puppet studio that became renowned for being as brilliant with puppetry as ILM was at special effects. When he died all too soon in 1990, he was indisputably one of the geniuses of puppetry. More importantly, he was a man who achieved his phenomenal success while still retaining his social conscience and artistic integrity as his work in promoting environmentalism and his brilliant The Storyteller (1987) series respectively attest to.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMzI3MjAwM15BMl5BanBnXkFtZTcwODIzMDk1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001345","name":"Jim Henson","idIMDB":"nm0001345"},"actorId":"nm0001345","character":"Himself - Host / Rowlf the Dog / Kermit the Frog","urlCharacter":"http://www.imdb.com/character/ch0000598","main":true},{"actorName":"Frank Oz","urlProfile":"http://www.imdb.com/name/nm0000568","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTM4ODA0OV5BMl5BanBnXkFtZTYwODMxMjQ0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1944","placeOfBirth":" Hereford, England, UK","birthName":"Frank Richard Oznowicz","height":"6' 2\" (1.88 m)","bio":"Frank Richard Oznowicz was born in Hereford, England to puppeteers Frances and Isidore Oznowicz. His family moved to Montana in 1951, eventually settling in Oakland, California. As a teenager, he worked as an apprentice puppeteer at Children's Fairyland amusement park. He is one of the primary puppeteers responsible for the development of Jim Henson's Sesame Street (1969) and _\"The Muppet Show\" (1976)_ as well as over 75 other Muppet productions. 'George Lucas' originally contacted Henson to play the part of Yoda in Star Wars: Episode V - The Empire Strikes Back (1980), but he recommended Oz for the part instead. He developed the character's trademark syntax, returning to voice and puppet the Jedi Master in Star Wars: Episode VI - Return of the Jedi (1983) and Star Wars: Episode I - The Phantom Menace (1999). He voiced the CGI character in Star Wars: Episode II - Attack of the Clones (2002) and Star Wars: Episode III - Revenge of the Sith (2005), supporting the transition of the character's rendering to digital. In 2011, the Blu-Ray edition of The Phantom Menace replaced the puppet Yoda with CGI to match the other prequel films. He began a career of behind-the-camera puppet and live action filmmaking by co-directing The Dark Crystal (1982) with Henson. He went on to direct The Muppets Take Manhattan (1984), Little Shop of Horrors (1986), Dirty Rotten Scoundrels (1988), What About Bob? (1991), The Indian in the Cupboard (1995), Bowfinger (1999), The Score (2001), The Stepford Wives (2004) and Death at a Funeral (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NTM4ODA0OV5BMl5BanBnXkFtZTYwODMxMjQ0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000568","name":"Frank Oz","idIMDB":"nm0000568"},"actorId":"nm0000568","character":"Himself - Puppeteer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jerry Juhl","urlProfile":"http://www.imdb.com/name/nm0432075","urlPhoto":"","biography":{"dateOfBirth":"27 June 1938","placeOfBirth":" St. Paul, Minnesota, USA","birthName":"Jerome Ravn Juhl","bio":"Jerry Juhl became the first full-time employee of Jim Henson Co. in 1961 after meeting Henson at a puppeteer's convention. The company coined the term \"Muppet,\" a combination of the words marionette and puppet, and created a series of short skits parodying television news people. Juhl worked on Jim Henson's first television show, Sam and Friends (1955) as a puppeteer and later spent six years writing for Sesame Street (1969) after its 1969 premiere. He created scripts for the Cookie Monster, Oscar the Grouch, Big Bird, Elmo, Bert, Ernie and The Count. He also created Super Grover, a superhero version of Grover, and received two Emmy Awards for his work. Juhl served as head writer for The Muppet Show (1976) from 1977-1981. He also was the writer and creative producer of Fraggle Rock (1983), which featured his wife as a writer and script editor. The show was met with critical acclaim when it appeared on HBO in 1983 and lasted four years.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0432075","name":"Jerry Juhl","idIMDB":"nm0432075"},"actorId":"nm0432075","character":"Himself - puppeteer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Don Sahlin","urlProfile":"http://www.imdb.com/name/nm0756357","urlPhoto":"","biography":{"dateOfBirth":"19 June 1928","placeOfBirth":" Stratford, Connecticut, USA","birthName":"Donald Sahlin","bio":"Don Sahlin was born on June 19, 1928 in Stratford, Connecticut, USA as Donald Sahlin. He is known for his work on The Muppet Show (1976), The Muppet Movie (1979) and Emmet Otter's Jug-Band Christmas (1977). He died on February 19, 1978 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0756357","name":"Don Sahlin","idIMDB":"nm0756357"},"actorId":"nm0756357","character":"Himself - puppet builder","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dennis Stoner","urlProfile":"http://www.imdb.com/name/nm4867444","urlPhoto":"","biography":{"bio":"Dennis Stoner is a composer, known for The Muppets on Puppets (1970).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4867444","name":"Dennis Stoner","idIMDB":"nm4867444"},"actorId":"nm4867444","character":"Himself - pianist","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2198237","urlIMDB":"http://www.imdb.com/title/tt2198237","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["57 min (USA)"],"soundMix":null,"color":["Black and White"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.2","filmingLocations":[],"awards":[],"votes":"8","type":"TV Movie","companyCreditsSimple":[],"keywords":{"keywords":["the muppets","monster","fairy tale","art history","puppet"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:27:59"}}