{"data":{"movies":[{"title":"Tai Chi Hero","originalTitle":"","year":"2012","releaseDate":"20121025","directors":[{"name":"Stephen Fung","id":"nm0298691"}],"writers":[{"name":"Chia-lu Chang","id":"nm2310115"},{"name":"Kuo-Fu Chen","id":"nm0155295"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNTUwNzEyOV5BMl5BanBnXkFtZTcwNDY1NjY0OQ@@._V1.jpg","countries":["China"],"languages":["Mandarin"],"genres":["Action","Adventure"],"plot":"About the early years of Yang Luchan, a Tai chi master. The man who founded Tai Chi in the 19th century and what has now become the most popular Tai Chi style in the world. The second instalment of the \"Tai Chi\" trilogy continues the journey of Yang Luchan, a gifted child who helped save a village from soldiers.","simplePlot":"About the early years of Yang Luchan, a Tai chi master. The man who founded Tai Chi in the 19th century and what has now become the most popular Tai Chi style in the world. The second ... ","actors":[{"actorName":"Xiaochao Yuan","urlProfile":"http://www.imdb.com/name/nm5209475","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODgyNTg4Ml5BMl5BanBnXkFtZTcwOTAxODA1OA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1988","placeOfBirth":" Yuncheng, Shandong Province, China","height":"5' 6¼\" (1.68 m)","bio":"Xiaochao Yuan was born on August 7, 1988 in Yuncheng, Shandong Province, China. He is an actor, known for Tai Chi Hero (2012) and Tai Chi Zero (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODgyNTg4Ml5BMl5BanBnXkFtZTcwOTAxODA1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5209475","name":"Xiaochao Yuan","idIMDB":"nm5209475"},"actorId":"nm5209475","character":"Yang Lu Chan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Qi Shu","urlProfile":"http://www.imdb.com/name/nm0795517","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NjAwNDIyNV5BMl5BanBnXkFtZTYwMzg1MTI1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1976","placeOfBirth":" Taipei, Taiwan","birthName":"Li-Hui Lin","height":"5' 6\" (1.68 m)","bio":"Born in Taiwan, Qi Shu has won the prestigious Golden Horse Awards in Taiwan (regarded as the East Asian Oscars) for Best Supporting Actress. She has also received a nomination for Best Actress from the Golden Horse Awards. She appeared with Jackie Chan in the romantic comedy Gorgeous (1999) (\"Gorgeous\"). Her name is spelled in a variety of ways, including Hsu Qi, Hsu Chi, Qi Shu, and Shu Kei, and there are quite a few other variations on her name on foreign V.C.D.s, D.V.D.s, and internet sites.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NjAwNDIyNV5BMl5BanBnXkFtZTYwMzg1MTI1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0795517","name":"Qi Shu","idIMDB":"nm0795517"},"actorId":"nm0795517","character":"Mother Yang","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Ka Fai Leung","urlProfile":"http://www.imdb.com/name/nm0504899","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5OTM3OTk5M15BMl5BanBnXkFtZTcwMjMxODA1OA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 February 1958","placeOfBirth":" Hong Kong","height":"5' 10\" (1.78 m)","bio":"Tony Leung Ka-fai is a four-time Hong Kong Film Award-winning film actor. As he is often confused with actor Tony Chiu-Wai Leung, Tony Leung Ka-fai is known as \"Big Tony\", while Tony Chiu-Wai Leung is known as \"Little Tony\", nicknames which correspond to the actors' respective physical statures. Leung has been in the film industry for more than 30 years, starring in a variety of roles. His debut film was Burning of the Imperial Palace (1983), where he played the Xianfeng Emperor. He would later work with Yun-Fat Chow in three films, Prison on Fire (1987), A Better Tomorrow III: Love and Death in Saigon (1989), and The Return of the God of Gamblers (1994). In 1991, Leung went to France to appear in Jean-Jacques Annaud's The Lover (1992), based on Marguerite Duras's novel, as the older lover of a young teen schoolgirl, who was played by British actress Jane March. Leung's ongoing career has seen him star in films such as The Myth (2005), Double Vision (2002), Everlasting Regret (2005) and Election (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5OTM3OTk5M15BMl5BanBnXkFtZTcwMjMxODA1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0504899","name":"Tony Ka Fai Leung","idIMDB":"nm0504899"},"actorId":"nm0504899","character":"Master Chen Chang Xing","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Angelababy","urlProfile":"http://www.imdb.com/name/nm2854802","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NDE1NzM5OF5BMl5BanBnXkFtZTcwNzQ1NTE3Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 February 1989","placeOfBirth":" Shanghai, China","birthName":"Angela Yeung","height":"5' 4\" (1.63 m)","bio":"Angela Yeung Wing, also known by her stage name Angelababy, has made a career in Hong Kong as an actress and a model. Born in Shanghai to her half-Chinese, half-German father and Chinese mother, she moved to Hong Kong at thirteen years old and took her stage name Angelababy as a composition of her legal given name Angela and her family given nickname \"Baby\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NDE1NzM5OF5BMl5BanBnXkFtZTcwNzQ1NTE3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2854802","name":"Angelababy","idIMDB":"nm2854802"},"actorId":"nm2854802","character":"Chen Yu Niang","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eddie Peng","urlProfile":"http://www.imdb.com/name/nm2108643","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkxNzIyMzc3Ml5BMl5BanBnXkFtZTgwNDc4ODI5NjE@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 March 1982","placeOfBirth":" Taipei, Taiwan","height":"5' 11¾\" (1.82 m)","bio":"For someone who never really considered becoming an actor, Eddie Peng, who once aspired to be a businessman, has done pretty well for himself in showbiz. His almost meteoric rise from virtual unknown to in-demand heartthrob is the stuff of all wannabe actors' dreams. Born in Taiwan, Peng migrated to Canada with his family when he was 13 and spent the next 10 years there. In 2002, the Economics major at the University of British Columbia returned to Taiwan to attend his grandmother's funeral, and was \"discovered\" by director Yang Da Qing, who cast the 20-year-old as the second male lead in the TV series, Tomorrow. The Taiwanese romantic comedy, which also starred Rainie Yang, Shawn Yue and Christine Fan, is based on Japanese manga series, Asunaro Hakusho, written by Fumi Saimon. Unbeknownst to Peng then, this serendipitous casting marked the beginning of his very enviable and swift rise to fame. The following year, Peng landed yet another lead role in TV drama, Scent of Love, playing a star-crossed lover searching for his soulmate through different lifetimes. But it was his role as Tang Yu in the 2005 TV drama, Chinese Paladin, which truly propelled him onto a bigger stage. Banking on his newfound fame, Peng followed up with more TV roles in Only You (2005), When Dolphin Met Cat (2005), The Young Warriors (2006), Wayward Kenting (2007), Honey and Clover (2008), The Concerto (2009), My Sassy Girl (2012) and Sound of the Desert (2014). In 2006, Peng made his big screen debut in the Taiwanese teen flick, Exit No. 6 (2006), by Yu-Hsien Lin. Hooked by the acting bug, Peng made quick strides and soon proved just how committed he was to his newfound profession. Renowned for his 'take no prisoners' approach to each role, Peng is known to devote weeks and months to intense training. Peng also adheres to old-school method-acting techniques and has a reputation for striving to get under the skin of each character he plays. In Hear Me (2009), released to coincide with the 2009 Deaflympics, Peng played a delivery boy who falls for a hearing-impaired girl. The role required him to use sign language throughout the entire movie. To play a gymnast in the coming-of-age movie, Jump Ashin! (2011), he spent 12 hours a day over an eight-month period practising gymnastics. He endured rigorous workout regimes to play a boxer in Dante Lam's Unbeatable (2013) and put in weeks of gruelling training for his role as a professional cyclist in To the Fore (2015), which co-stars Korean heart-throb Si Won Choi. His dedication to the craft has not gone unnoticed. He's earned nominations for Best Supporting Actor for Only You (2006) at the 41st Golden Bell Award, and Best Male Actor for Wayward Kenting (2007) the subsequent year, Best Newcomer at the 44th Golden Horse Awards for the romcom My DNA Says I Love You (2007), Best Actor for Jump Ashin! (2011), and Best Supporting Actor for Unbeatable (2013). Peng's turn in 2011's inspirational box-office hit Jump Ashin! (2011) proved to be a crucial turning point in his career. It launched his career as an action star and put him firmly on the A-list of hot new Chinese actors. He went on to star in sci-fi flick, Love (2012), Hong Kong police thriller Cold War (2012), romcom A Wedding Invitation (2013) and Unbeatable (2013) opposite Nick Cheung, which also earned him a nomination for Best Supporting Actor at the Hong Kong Film Festival in 2014. That same year, he landed the coveted lead in Rise of the Legend (2014), taking on the role of Chinese martial arts legend Huang Fei Hung. To get into character, Eddie not only had to learn kungfu, he studied others who had also played this role, including Jackie Chan and Jet Li, and had to relearn how to walk, speak and think. Although not director Roy Chow 's first choice, Peng's performance and dedication earned him a Best Actor nomination at the Hong Kong Film Awards in 2015. With his good looks, six-pack abs and new title as this generation's kungfu hero, Peng could've easily become stuck as just another action movie typecast, but he refused to be pigeonholed, seeking out instead varied roles that allow him to portray a spectrum of different characters. Dialling back the alpha male posturing, he went on to star in Back in Time (2015) an emotive adaptation of Jiu Ye Hui's novel of the same name, which follows the journey of six best friends from their youth to their adulthood. Not content to just be an actor, the multi-talented Peng has also dabbled in music, releasing five songs on an EP called Must Love in 2009 with a photo book. He has also appeared in several music videos for well-known pop artists such as Maggie Chiang, Fish Leong, Fiona Sit and A-Lin. Now known affectionately as Taiwan's most successful million-dollar man, Peng's celluloid success has led to a strong of commercial sponsorships, including Longines, where he joins the elite ranks of Kate Winslet, Simon Baker, Chi Ling Lin, Aaron Kwok and Aishwarya Rai as Ambassador for Elegance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkxNzIyMzc3Ml5BMl5BanBnXkFtZTgwNDc4ODI5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2108643","name":"Eddie Peng","nicknames":["Yuyan Peng"],"idIMDB":"nm2108643"},"actorId":"nm2108643","character":"Fang Zi Jing","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Daniel Wu","urlProfile":"http://www.imdb.com/name/nm0943079","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzNTk3NTA2Ml5BMl5BanBnXkFtZTYwODI2MTY1._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1974","placeOfBirth":" Berkeley, California, USA","birthName":"Daniel N. Wu","height":"5' 11¾\" (1.82 m)","bio":"Daniel Wu was born on September 30, 1974 in Berkeley, California, USA as Daniel N. Wu. He is an actor and producer, known for Europa Report (2013), Warcraft: The Beginning (2016) and One Nite in Mongkok (2004). He has been married to Lisa S. since April 6, 2010. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzNTk3NTA2Ml5BMl5BanBnXkFtZTYwODI2MTY1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0943079","name":"Daniel Wu","nicknames":["Dan"],"idIMDB":"nm0943079"},"actorId":"nm0943079","character":"Mad Monk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shaofeng Feng","urlProfile":"http://www.imdb.com/name/nm2682046","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzM0MDRhYzctYTA5Ni00YjVmLWJkOWMtNjc5MWQ2MTdkNTQ1XkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 October 1978","placeOfBirth":" Shanghai, China","birthName":"Wei Feng","height":"5' 10\" (1.78 m)","bio":"Feng was born in an affluent family of Shanghai. He displayed his interests in acting and performance from a young age. Influenced by his mother, an art enthusiast, Feng entered the Shanghai Theater Academy and studied acting. After he graduated in 2001, Feng chose an acting career and worked as a television actor for ten years before rising to fame overnight with his performance in a period drama, Palace (2011). Feng soon turned his focus to film, and intends to pursue a diverse mix of roles. In White Vengeance (2011), he gives a distinctive performance by playing a tragic hero, Xiang Yu. Feng challenges himself in Détective Dee II: La légende du dragon des mers (2013) with intensive Kung Fu fight scenes. In the award-wining biopic The Golden Era (2014) directed by Ann Hui, Feng plays a controversial left-wing writer, Xiao Jun, and develops a love-hate relationship with one of China's greatest modern writer, Xiao Hong. Feng also displays his comedian talents in box-office hits like Painted Skin: The Resurrection (2012) and The Continent (2014). Handpicked by director Jean-Jacques Annaud, he stars the Chinese-French corporation Le dernier loup (2015), which is adapted from the renowned best-seller of the same name. Feng played a college student went to inner Mongolia during the Cultural Evolution. Feng also develops an interest in fantasy films after filming The Monkey King 2 (2016), in which he plays the famous Monk Tang Sanzang, along with megastar Li Gong and Aaron Kwok, going on the journey to the West. He stars China's first Sci-Fi movie, The Three-Body Problem: I (2017), based on the first translated novel winning the Hugo Award. Further, Feng takes producing duties behind the scenes in the fantasy TV shows that he stars, such as Ice Fantasy (2016) and Na pian xing kong na pian hai (2017). Shaofeng Feng is now one of the leading actors of his generation by keeping a balance between commercial hits and artistic films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzM0MDRhYzctYTA5Ni00YjVmLWJkOWMtNjc5MWQ2MTdkNTQ1XkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2682046","name":"Shaofeng Feng","idIMDB":"nm2682046"},"actorId":"nm2682046","character":"Chen Zai Yang","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Fung","urlProfile":"http://www.imdb.com/name/nm0298691","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNjQ3MzI3NF5BMl5BanBnXkFtZTgwMzA2MjQ4MzE@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1974","placeOfBirth":" Hong Kong","birthName":"Fung Chun Choi","height":"5' 9\" (1.75 m)","bio":"Stephen Fung was born in Hong Kong. Stephen made his acting debut in Forbidden Nights(1990), playing the childhood version of the male lead. By 1998, Stephen was voted by the Hong Kong press as \"Upcoming Actor of the Year.\" In 2004, Stephen wrote/directed/starred in his feature film directorial debut \"Enter the Phoenix\" for Jackie Chan's newly formed company JCE Movies; it became an instant hit. His second directing/starring feature \"House of Fury\" marks Stephen's first collaboration with legendary action director Yuen Wo Ping (Matrix, Kill Bill) proves also to be a success. \"House of Fury\" was the opening film for the Hong Kong International Film Festival 2005, official selection for the 18TH Tokyo International Film Festival, and at home, the highest grossing Hong Kong film for the first half of 2005. Besides continuing with his acting career, Stephen directed \"JUMP\" written and produced by Stephen Chow for Sony Columbia Pictures Asia in 2009. In 2012 Stephen directed the first two installment \"Tai Chi Zero\" and \"Tai Chi Hero\" in the \"Taichi Trilogy.\" The two films have won numerous awards and was the official selection for The Venice Film Festival, Toronto Film Festival, and Busan Film Festival among others. Stephen is the Executive Producer and Fight Director for the AMC Martial Arts Drama \"Into The Badlands.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNjQ3MzI3NF5BMl5BanBnXkFtZTgwMzA2MjQ4MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0298691","name":"Stephen Fung","idIMDB":"nm0298691"},"actorId":"nm0298691","character":"Nan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nikki Hsieh","urlProfile":"http://www.imdb.com/name/nm2116826","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTc3ZTAxOGYtMzE4Ni00Yjc5LTgyNDMtNWU0NWM0ZjVkMTczL2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 May 1985","placeOfBirth":" Taiwan","birthName":"Hsieh Hsin-Ying","height":"5' 4¼\" (1.63 m)","bio":"Nikki Hsieh was born on May 1, 1985 in Taiwan as Hsieh Hsin-Ying. She is an actress, known for The Assassin (2015), Make Up (2011) and When a Wolf Falls in Love with a Sheep (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTc3ZTAxOGYtMzE4Ni00Yjc5LTgyNDMtNWU0NWM0ZjVkMTczL2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2116826","name":"Nikki Hsieh","idIMDB":"nm2116826"},"actorId":"nm2116826","character":"Jin Yuner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Stormare","urlProfile":"http://www.imdb.com/name/nm0001780","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUyMDQ0MTEyNF5BMl5BanBnXkFtZTYwNDYxMDkz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1953","placeOfBirth":" Kumla, Örebro län, Sweden","birthName":"Peter Ingvar Storm","height":"6' 2\" (1.88 m)","bio":"Peter Stormare was born in Arbrå, Gävleborgs län, Sweden, to Gunhild (Holm) and Karl Ingvar Storm. He began his acting career at the Royal National Theatre of Sweden, performing for eleven years. In 1990 he became the Associate Artistic Director at the Tokyo Globe Theatre and directed productions of many Shakespeare plays, including \"Hamlet\". In 1993 he moved to New York, where he appeared in English productions. He continues to work in both the United States and his his homeland of Sweden. He resides in Los Angeles, California, USA, with his wife.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUyMDQ0MTEyNF5BMl5BanBnXkFtZTYwNDYxMDkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001780","name":"Peter Stormare","idIMDB":"nm0001780"},"actorId":"nm0001780","character":"Duke Fleming","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yin Tse","urlProfile":"http://www.imdb.com/name/nm0874868","urlPhoto":"","biography":{"dateOfBirth":"9 August 1936","placeOfBirth":" Guangdong, China","height":"5' 10½\" (1.79 m)","bio":"Yin Tse was born on August 9, 1936 in Guangdong, China. He is an actor and director, known for Shaolin Soccer (2001), Temptress Moon (1996) and Rouge (1987). He was previously married to Deborah Li and Zhen Zhen.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0874868","name":"Yin Tse","idIMDB":"nm0874868"},"actorId":"nm0874868","character":"the 10th Grandmaster","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Di Wu","urlProfile":"http://www.imdb.com/name/nm1886167","urlPhoto":"","biography":{"bio":"Di Wu is an actress, known for Le voile des illusions (2006), Dragon Gate, La légende des sabres volants (2011) and Tai Chi Zero (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1886167","name":"Di Wu","idIMDB":"nm1886167"},"actorId":"nm1886167","character":"Chen You Zhi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jade Xu","urlProfile":"http://www.imdb.com/name/nm4978635","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NTc0MzAyMF5BMl5BanBnXkFtZTcwMTIyNDg5OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jade Xu is an actress, known for Tai Chi Zero (2012), Tai Chi Hero (2012) and Lasko, le protecteur (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NTc0MzAyMF5BMl5BanBnXkFtZTcwMTIyNDg5OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4978635","name":"Jade Xu","idIMDB":"nm4978635"},"actorId":"nm4978635","character":"Sister Mahjong","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wei Ai Xuan","urlProfile":"http://www.imdb.com/name/nm5468674","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMzY1MTAwMV5BMl5BanBnXkFtZTcwNzg1MzcyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Wei Ai Xuan is an actor, known for Tai Chi Zero (2012) and Tai Chi Hero (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMzY1MTAwMV5BMl5BanBnXkFtZTcwNzg1MzcyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5468674","name":"Wei Ai Xuan","idIMDB":"nm5468674"},"actorId":"nm5468674","character":"Zhao Di","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Biao Yuen","urlProfile":"http://www.imdb.com/name/nm0950707","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWMyNmQ2YzMtNTVlZC00OTI4LTg3YTUtYmUyODM3NTI1NDhkXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1957","placeOfBirth":" Hong Kong","birthName":"Hsia Ling-Jun","height":"5' 6¼\" (1.68 m)","bio":"Yuen Biao is regarded as one of the most acrobatic martial artists ever. Unfortunately, he is still underrated and not as popular as other contemporaries such as Jackie Chan, Sammo Kam-Bo Hung, and Jet Li even though he is the most critically acclaimed out of all of them and the most talented as well. And now he is receiving a cult following due to word of mouth. Born of his parents Ha Kwong-Tai (father) and Ha Sau-Ying. Yuen Biao was first enrolled in the China Drama Academy at the age of 5 (he was the youngest there). He met Sammo Kam-Bo Hung and Jackie Chan while attending the Academy. Jackie Chan took him under his wing, and they became lifelong friends. Yuen Biao stayed at the Academy until the age of 16 where he moved with Master Jim-Yuen to America. However, two years later he came back, citing there were no opportunities for Chinese martial artists to star in American films. After being in some bit part roles in films such as Stoner (1974) (aka Stoner), Shing le fantastique Mandchou (1976) (aka Hand of Death), he didn't receive his first major breakthrough role until Sammo Kam-Bo Hung cast him in Knockabout (1979) (aka Knockabout). However, his first role which gave him full exposure and established his status as a A-list star was The Prodigal Son (1981) (aka The Prodigal Son), which also starred and was directed by Sammo Kam-Bo Hung. After that, 'Jackie Chan' cast him in the classic Project A (1983) (aka Project A). After starring in some other films with Sammo Kam-Bo Hung and/or Jackie Chan, he decided to go his own way and to forge his own career to get out of the shadows of Jackie Chan and Sammo Kam-Bo Hung. He met his future wife DiDi Phang Sau-Ha in 1984 while working as a stunt coordinator on the film DiDi Phang was working on: Tai fong siu sau (1982) (aka Carry On Pickpocket). They have two children. His daughter Yi-Bui was born in 1986 and his son Ming-Tsak in 1988. The film On the Run (1988) (aka On The Run) confirmed his abilities as a brilliant actor as his portrayal as a married man seeking vengeance for his wife's brutal murder was critically acclaimed. The following year he starred in probably his best film, The Iceman Cometh (1989) (aka The Iceman Cometh), in which he starred with acclaimed actress Maggie Cheung. The film is regarded as a cult classic and is remembered not only for the fantastic fighting scenes and hilarious comedy, but also the wonderful acting of Biao Yuen and Maggie Cheung and the wonderful simmering sexual chemistry between them. After starring in the acclaimed Once Upon a Time in China (1991) (aka Once Upon a Time in China, in which most of his scenes were cut), he directed his first movie (Xi Zang xiao zi (1992). aka A Kid From Tibet), in which he also starred. In 1994, he worked for the first time in years, with Sammo Kam-Bo Hung in the gloriously titled Mou mian bei (1995) (aka Don't Give a Damn). In recent years, Yuen Biao has complained of poor scripts, so he appears in films sparsely nowadays. He also has a second home in Canada where he spends most of time pursuing his hobby of golf.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWMyNmQ2YzMtNTVlZC00OTI4LTg3YTUtYmUyODM3NTI1NDhkXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0950707","name":"Biao Yuen","nicknames":["Little Brother"],"idIMDB":"nm0950707"},"actorId":"nm0950707","character":"Li Qiankun","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2296404","urlIMDB":"http://www.imdb.com/title/tt2296404","business":{"budget":{"money":"$40,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$12,624","country":"USA","day":"26","month":"04","year":"2013","remarks":"7 Screens"}],"gross":[{"money":"$35,067","country":"USA","day":"26","month":"04","year":"2013","remarks":""}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 40 min (100 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Red One Camera"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.2","metascore":"39","filmingLocations":[],"awards":[{"award":"Golden Trailer Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Trailer","categories":[{"category":"Most Original Foreign Trailer","names":[{"name":"Well Go USA Entertainment","id":null,"role":null},{"name":"Red Circle","id":null,"role":null}]}]}]},{"award":"Sitges - Catalonian International Film Festival 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Focus Asia Award","categories":[{"category":"","names":[{"name":"Stephen Fung","id":"nm0298691","role":null}]}]}]}],"votes":"2,813","type":"Movie","companyCreditsSimple":[{"idCompany":"co0215887","name":"Huayi Brothers & Taihe Film Investment"},{"idCompany":"co0390147","name":"Diversion Pictures"},{"idCompany":"co0157911","name":"Diversion Pictures"}],"keywords":{"keywords":["steampunk","sequel","second part"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:53:08"}}