{"data":{"movies":[{"title":"Northmen - A Viking Saga","originalTitle":"","year":"2014","releaseDate":"20141023","directors":[{"name":"Claudio Fäh","id":"nm0299603"}],"writers":[{"name":"Bastian Zach","id":"nm1749144"},{"name":"Matthias Bauer","id":"nm1746955"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI0ZjljMzMtNDFlZi00YTM1LTgxY2EtN2Q1ZjNiZTNkMzQ3L2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1.jpg","countries":["Switzerland","Germany","South Africa"],"languages":["English","Scots"],"genres":["Action","Adventure"],"plot":"A band of Vikings are stranded behind enemy lines on the coast of Alba as their longboat goes down in a dreadful storm. Their only chance of survival is to find a path to the Viking settlement, Danelagh, traversing an unfamiliar and hostile land they have never known. The journey becomes a race for their lives when the King of Alba sends his most feared mercenaries after them. But when the Vikings meet a kind Christian Monk who preaches with his sword, the hunters become the hunted as the Vikings set deadly traps, mercilessly decimating their pursuers one by one, culminating in a final and deadly encounter.","simplePlot":"A band of Vikings cross enemy lines and a panicked race begins. The losers will pay with their lives.","actors":[{"actorName":"Ed Skrein","urlProfile":"http://www.imdb.com/name/nm4534098","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMzA1MTM4Ml5BMl5BanBnXkFtZTcwNjQ4NzU0OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 March 1983","placeOfBirth":" Camden, London, England, UK","birthName":"Edward George Skrein","height":"6' 1\" (1.85 m)","bio":"Ed Skrein grew up in North London, graduated with a degree in Fine Arts from Central Saint Martins, and is one of the most highly versatile artists of his generation. He was selected by Screen International as one of their \"Stars of Tomorrow\" in 2013, which showcases the next generation of talent from the UK. Most recently, Skrein starred as the villain Ajax in Marvel's and Twentieth Century Fox's box office hit, Deadpool (2016), directed by Tim Miller and alongside Ryan Reynolds. The film shattered box office records, nearing $500 million worldwide. Deadpool (2016) chronicles the story of Marvel comic book character Deadpool (Reynolds), a former Special Forces operative turned mercenary who adopts an alter ego after being subjected to a rogue experiment that leaves him with accelerated healing powers. Skrein also recently starred in the Danish drama, The Model (2016), directed by Mads Matthiesen, who won the \"World Cinema - Dramatic\" award for his film, Teddy Bear at the 2012 Sundance Film Festival. The Model (2016) follows an emerging fashion model attempting to enter the Parisian fashion scene who develops a deadly obsession for top fashion photographer Shane White (Skrein). Nordisk Film Distribution released the film in Denmark on February 11th. This year, Skrein will appear in the comedy crime film, Kill Your Friends (2015), directed by Owen Harris (Black Mirror) and alongside Nicholas Hoult and James Corden. Based on John Niven's 2008 novel, the film accounts the story of a 27-year-old A&R man working at the height of the Britpop music craze and going to extremes in order to find his next hit. Kill Your Friends (2015) screened at Cannes and was purchased by Well Go USA Entertainment, which will release the film on April 1st. Last year, Skrein starred in the action crime thriller reboot, Le Transporteur: Héritage (2015), directed by Camille Delamarre and produced by Luc Besson and Mark Gao (Lucy, Taken Trilogy). Skrein portrayed the lead role of Frank Martin, a former special-ops mercenary who now spends his life as a transporter of classified packages for questionable people on the other side of the law. In 2013, Skrein appeared in the critically-acclaimed and BAFTA and Critics Choice Television Award winning HBO series, Game of Thrones. Skrein portrayed the character Daario Naharis, originally a lieutenant in the \"Second Sons,\" who takes over the company after killing his superiors and aligns with Daenerys Targaryen (Emilia Clarke). In 2012, Skrein starred in Revolver Entertainment's critically-acclaimed drama Ill Manors, written and directed by Ben Drew. The film revolves around the lives of eight characters as they struggle to survive on the streets. It takes place over the course of seven days, each story blending into the others, painting a gritty picture of a world on the brink of destruction. Other film credits include The Sweeney, Tiger House, Piggy, Northmen: A Viking Saga, Sword of Vengeance and Goldfish. Other television credits include The Tunnel. Ed Skrein currently resides in London.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMzA1MTM4Ml5BMl5BanBnXkFtZTcwNjQ4NzU0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4534098","name":"Ed Skrein","idIMDB":"nm4534098"},"actorId":"nm4534098","character":"Hjorr","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Hopper","urlProfile":"http://www.imdb.com/name/nm2584392","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWZkNWRkZjktMGFjYi00NzFkLWJmZGItZTM3MjYyZGUwMjRkL2ltYWdlXkEyXkFqcGdeQXVyMjAwNDc2MTQ@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 January 1985","placeOfBirth":" Coalville, Leicestershire, England, UK","height":"6' 5\" (1.96 m)","bio":"English-born Tom Hopper cultivated his acting career on the stage, starting out in work in theatre. He attended the Rose Bruford College to study acting. While in school at Rose Bruford, his theatrical roles included \"The Tempest\", \"The Way of the World\", \"Colliers Friday Night and Festen\". His screen appearances began in 2007 starting on Casualty (1986), Saxon (2007) and in 2010 on Doctor Who (2005). In 2011, he was cast in perhaps his most notable screen role as the valiant knight Sir Percival, the strongman on the BBC fantasy series Merlin (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWZkNWRkZjktMGFjYi00NzFkLWJmZGItZTM3MjYyZGUwMjRkL2ltYWdlXkEyXkFqcGdeQXVyMjAwNDc2MTQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2584392","name":"Tom Hopper","idIMDB":"nm2584392"},"actorId":"nm2584392","character":"Asbjorn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charlie Murphy","urlProfile":"http://www.imdb.com/name/nm3647676","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMDg2Nzk1Nl5BMl5BanBnXkFtZTcwMzQ0ODQzOQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"height":"5' 3¾\" (1.62 m)","bio":"Charlie Murphy is an actress and producer, known for Philomena (2013), To Walk Invisible: The Bronte Sisters (2016) and '71 (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMDg2Nzk1Nl5BMl5BanBnXkFtZTcwMzQ0ODQzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3647676","name":"Charlie Murphy","idIMDB":"nm3647676"},"actorId":"nm3647676","character":"Inghean","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Norton","urlProfile":"http://www.imdb.com/name/nm3584268","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc2Mzg5MjgxNF5BMl5BanBnXkFtZTgwODY4MDA1MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"James Geoffrey Ian Norton","height":"6' 1\" (1.85 m)","bio":"James Norton was born in 1985 to two teachers and has a younger sister who is a doctor. Growing up in North Yorkshire he espoused acting at a very early age - playing Joseph in his primary school nativity play aged five - and, after leaving Ampleforth College he did work experience at the Stephen Joseph Theatre in Scarborough. Rather than go straight to acting school he read theology at Fitzwilliam College, Cambridge and then travelled to Nepal, where he became interested in Buddhism. On return he enrolled at RADA in London, graduating in 2010 and, just before graduating bagging a (very) small part as Carey Mulligan's boyfriend in the final scene of 'An Education'. In 2011 he appeared on the London stage in revivals of 'Journey's End' and 'The Lion in Winter' with Joanna Lumley and Robert Lindsay. At the tail end of 2013 he was in the faux-Austen mystery 'Death Comes To Pemberley' on television but 2014 has been the year when he became known to a wider audience via the period films 'Mr Turner' and 'Belle' as the heroine's first love interest and most particularly violent serial 'Happy Valley' as a murderous kidnapper and rapist and, by contrast in the post-war set whodunit series 'Grantchester' as a tipsy young vicar with a penchant for solving cases.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc2Mzg5MjgxNF5BMl5BanBnXkFtZTgwODY4MDA1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3584268","name":"James Norton","idIMDB":"nm3584268"},"actorId":"nm3584268","character":"Bjorn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ryan Kwanten","urlProfile":"http://www.imdb.com/name/nm0477127","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk5NDE5OTQwNl5BMl5BanBnXkFtZTcwOTkyMjg3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1976","placeOfBirth":" Sydney, New South Wales, Australia","birthName":"Ryan Christian Kwanten","height":"5' 10\" (1.78 m)","bio":"An Australian actor, Ryan Kwanten was born and raised in Sydney, Australia. He appeared on several TV shows Down Under, including a five year stint on the popular series Home and Away. After graduating from business school at the University of Sydney, he came to Los Angeles for what was supposed to be a brief visit but decided to stay, quickly building a reputation as a leading man with roles in several films and TV shows, including Summerland (2003), before adopting a southern drawl and landing the lead role in HBO's True Blood alongside Academy Award-winner Anna Paquin. Kwanten performs many of his own stunts and has become a go-to for films on both sides of the Pacific, including The Effects of Blunt Force Trauma (2015) with Mickey Rourke, Kidnapping Mr. Heineken (2014) and as the title character in the critically acclaimed Griff the Invisible (2010). He also showed his lighthearted side in the rom-com Not Suitable for Children (2012), satire Knights of Badassdom (2013), and on Fox's hit comedy New Girl. Recently, Kwanten joined fellow Aussie Toni Collette in loaning his voice to the iconic Australian children's character Blinky Bill in Blinky Bill the Movie (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk5NDE5OTQwNl5BMl5BanBnXkFtZTcwOTkyMjg3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0477127","name":"Ryan Kwanten","idIMDB":"nm0477127"},"actorId":"nm0477127","character":"Conall","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Strepan","urlProfile":"http://www.imdb.com/name/nm5956436","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjM3ZGIwNjMtNzk5NS00ZGM1LTllZWEtODY1YmQ5MGEyOWRiXkEyXkFqcGdeQXVyNjgyODI1MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Mark Strepan is an actor, known for Northmen - A Viking Saga (2014), New Blood (2016) and The Mill (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjM3ZGIwNjMtNzk5NS00ZGM1LTllZWEtODY1YmQ5MGEyOWRiXkEyXkFqcGdeQXVyNjgyODI1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5956436","name":"Mark Strepan","idIMDB":"nm5956436"},"actorId":"nm5956436","character":"Grim","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leo Gregory","urlProfile":"http://www.imdb.com/name/nm0339877","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NTI3NDU4Nl5BMl5BanBnXkFtZTcwNzc1Mjc3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1978","placeOfBirth":" UK","height":"5' 10\" (1.78 m)","bio":"Leo Gregory was born on November 22, 1978 in the UK. He is an actor and producer, known for Green Street Hooligans (2005), Stoned (2005) and Tristan + Isolde (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NTI3NDU4Nl5BMl5BanBnXkFtZTcwNzc1Mjc3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0339877","name":"Leo Gregory","idIMDB":"nm0339877"},"actorId":"nm0339877","character":"Jorund","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ken Duken","urlProfile":"http://www.imdb.com/name/nm0241222","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQzNjUyMDE0MF5BMl5BanBnXkFtZTgwNDM2OTg5ODE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1979","placeOfBirth":" Heidelberg, Baden-Württemberg, Germany","height":"6' 0½\" (1.84 m)","bio":"Ken Duken was born on the 17th of April 1979 as a son of an actress and a doctor in Heidelberg / Germany. He started to learn acting from his stage actress mother Christina Loeb. Later he took courses by James Reynolds and Bruce McDonald but he never attended drama school. Before starting his career on television in 1997 Ken acted throughout different stage plays, for example \"Visit from an old Lady\". In the year 1998 he got a hold of his first leading role in the film \"Land of Milk and Honey\" (direction: Friedemann Fromm), and played side by side with Franka Potente and Heiner Lauterbach. BILD, largest daily paper in Germany, called him a \"Shootingstar\" with great talent and charisma. In 2000 Ken convinced in the role of Mark, a young guy confined to a wheelchair, in the motion picture \"Gran Paradiso\" from Miguel Alexandre. This film was nominated for the German Film Award. After some German productions, for example \"Nightshift\" (ZDF, direction: Lars Becker), Ken took part in the comedy \"100 per cent\" from Simon Verhoeven. Throughout the last years Ken Duken above all was shooting abroad together with great actors like Peter O'Toole, Klaus Maria Brandauer, Max von Sydow and Dominique Pinon. With the Italian production \"Hidden Children\" (2003, direction: Leone Pompucci) he gained great success and won amongst others the French Movie-Award at the 18th \"Reincontres de Television de Reims\". In 2003 Ken and some friends founded the film production company \"Grand Hotel Pictures\". The successful debut's name was \"From another Point of View\" (direction and production), which premiered on the 15th of April 2004 in Munich, starring his wife Marisa Leonie Bach and Dominique Pinon, famous French actor (Alien4, Amélie...). At the same time he put on Music-Videos (e.g. Curse - \"Gangster-Rap\", Oomph - \"Das letzte Streichholz\") and began to write the script for his first own film \"Waiting for Eve\". In 2005 Ken played the leading role in the movie \"Another league\" (produced by Wüste Film, winner of the Berlinale 2004 with \"Against the wall\") for which he was assigned as best actor at the Comedy-Festival in Monte Carlo. Furthermore he took part at the big Italian production \"Karol\" (film version of the life of the deceased Pope John Paul II (Karol Woytila)) for Channel 5 (Italy) which achieved an audience rating of 47%. In Poland this film beat all records and was more successful than \"Star Wars 3\" or \"War of the worlds\". In March 2005 Ken Duken was awarded with the Grimme Award for his role in \"Kiss and Run\" before he started filming \"Störtebeker\" (a movie about the life of the most famous German pirate) in May 2005. Afterwards he played the character Teddy Schrader in Lars Becker's \"Nightshift\". In summer 2006 Ken played the role of Anatol Kuragin in the international production \"War & Peace\", based on the novel of Tolstoj, directed by Robert Dornhelm, where he had to shoot in Vilnius/Lithuania and St. Petersburg and afterward he was shooting another international production in Morocco - \"Ali Baba\", directed by Pierre Aknine. After leading roles in the movies \"Distanz\" and \"Gellert\", which were produced by Grand Hotel Pictures, he took part in the Italian production \"Il Commissario de Luca\", directed by Antonio Frazzi and played Ben Winter, a war returnee from Afganistan in the tv movie \"Willkommen zuhause\". In 2008 Ken won his second Grimme Award for \"Eine andere Liga\" and the Franz Hofer Award. In the same year he played the name part in the fairy tale \"Koenig Drosselbart\", co-starred with Gary Dourdan in the international production \"Fire\", played the leading role in \"Das Unglueck von Ueberlingen\" (directed by Till Endemann), a tv movie about the air plane crash in Ueberlingen in 2002, and took part in Quentin Tarantino's \"Inglorious Basterds\". In 2009 he won the \"Bayerischen Fernsehpreis\" for \"Willkommen zuhause\" in the category \"best actor TV-movie\". At the moment he co-stars with Till Schweiger in his new movie \"Zweiohrkueken.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQzNjUyMDE0MF5BMl5BanBnXkFtZTgwNDM2OTg5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0241222","name":"Ken Duken","idIMDB":"nm0241222"},"actorId":"nm0241222","character":"Thorald","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anatole Taubman","urlProfile":"http://www.imdb.com/name/nm0851458","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNDU0OTE0MF5BMl5BanBnXkFtZTgwOTYyNTQ5MTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 December 1970","placeOfBirth":" Zurich, Switzerland","height":"6' 0½\" (1.84 m)","bio":"Anatole Taubman was born in Zurich, Switzerland and is of Russian-Polish-Slovakian-Austrian-and-former-East-Prussian blood. In 1991 he made his baccalauréat at the renowned Gymnasium of the Benedictine boarding school of the monastery Einsiedeln and in 1994 he graduated from the reputable drama-school 'Circle in the Square' in NYC. He's fluent in five languages (English, French, Swiss-German, German and Italian) and is also truly cosmopolitan in his work. Taubman has starred and co-starred in over 50 feature films and TV productions. Since 1998, he has been busy working and with international success in the UK, France, Germany, Switzerland and for the USA throughout Europe and beyond. Among other credits Anatole Taubman is best known for his impressive English-language TV work in Band of Brothers (HBO), Servants (BBC), POW (ITV), Spooks VI (BBC), Waking The Dead VII - Pièta (BBC) or The Tudors II (Showtime) and established himself as a fine character actor in feature films like Mein Name is Bach (CH/D), Luther (D), Marmorera (CH), Fay Grim (USA), Snipers Valley (D), Secret Défense (F), Taken / 96 Hours (F / USA) and in 2009 Pope Joan (D), Same Same But Different (D) or in Chanel & Stravinsky (F). Anatole Taubman is a member of the German Film Academy and of the European Film Academy. Anatole Taubman is Spokesperson for UNICEF Switzerland.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNDU0OTE0MF5BMl5BanBnXkFtZTgwOTYyNTQ5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0851458","name":"Anatole Taubman","idIMDB":"nm0851458"},"actorId":"nm0851458","character":"Bovarr","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Darrell D'Silva","urlProfile":"http://www.imdb.com/name/nm0195928","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2NjMmIzODgtNGFlMC00NzViLThlZjItNWUxM2JjMzY5ZGFjXkEyXkFqcGdeQXVyMjQ5MjE0NDM@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1963","placeOfBirth":" Rotherham, Yorkshire, England, UK","bio":"Darrell D'Silva was born in 1963 in Rotherham, Yorkshire, England. He is an actor, known for Northmen - A Viking Saga (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2NjMmIzODgtNGFlMC00NzViLThlZjItNWUxM2JjMzY5ZGFjXkEyXkFqcGdeQXVyMjQ5MjE0NDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0195928","name":"Darrell D'Silva","idIMDB":"nm0195928"},"actorId":"nm0195928","character":"Gunnar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Malani Coomes","urlProfile":"http://www.imdb.com/name/nm3076524","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA3MTk4ODItYmUyMC00MDU1LTgyOGMtYzQwOTcwNTVmN2Y4XkEyXkFqcGdeQXVyOTIxNDAyOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"birthName":"Malani Stacy Coomes","height":"5' 8\" (1.73 m)","bio":"Malani Coomes hails Tennessee as her home state. Born in Murfreesboro, her family later moved to Short Mountain just outside of Woodbury. As a child, she performed in multiple plays and musicals at the local Arts Center with her two brothers and two sisters and sometimes also with her dad. Her mother was more of a producer personality, which translated into Malani's growth into adulthood. She received her BFA in Theatre Performance from the University of Memphis, and studied improvisation at The Second City in Los Angeles. Malani now lives in Los Angeles, California, and enjoys health food, hiking in the canyons, and wine country.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA3MTk4ODItYmUyMC00MDU1LTgyOGMtYzQwOTcwNTVmN2Y4XkEyXkFqcGdeQXVyOTIxNDAyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3076524","name":"Malani Coomes","idIMDB":"nm3076524"},"actorId":"nm3076524","character":"Noblewoman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nic Rasenti","urlProfile":"http://www.imdb.com/name/nm3797176","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MTc5OTkzNl5BMl5BanBnXkFtZTgwMjA2ODAxNDE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Nic is known for his very action orientated role as Battle Ready \"Harty\" in the documentary styled, high octane Alien Outpost: 37 (IFC). In addition, his TV experience includes working on world wide airing series such as: Starz costume drama Black Sails as \"Mr Holmes\" and Syfys Dominion as \"O'Connor\". Nic Just finished shooting a featured role in the BBC 6 part mini series Undercover, playing alongside Sophie Okonedo. In 2015 Nic shot the highly acclaimed book adapted Pilot for Clan Of The Cave Bear as \"Zoug\" for Lifetime in conjunction with Imagine, Lionsgate and Fox, produced by Ron Howard. After starring in several prime time TV series and feature films Nic, has set his eyes firmly on American shores, looking to further his acting career and as he puts it, \"playing more questionable characters.\" Nic Rasenti is a South African born actor currently living in the coastal city of Cape Town. He trained at AFDA and coached by some of South Africa's top industry professionals. After Graduating in 2010 he landed his first feature role in Sony Pictures third installment of the Sniper franchise, Sniper Reloaded, as the young rookie \"Vincent Capabianco\" working with Director Claudio Fåh.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MTc5OTkzNl5BMl5BanBnXkFtZTgwMjA2ODAxNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3797176","name":"Nic Rasenti","idIMDB":"nm3797176"},"actorId":"nm3797176","character":"Gostun","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny Keogh","urlProfile":"http://www.imdb.com/name/nm0449044","urlPhoto":"","biography":{"dateOfBirth":"March1948","placeOfBirth":" Kampala, Uganda","bio":"Danny Keogh is a veteran actor whose work strongly ties itself to the theatre. A native of South African, born in Uganda, Danny's theatrical career earned him numerous award nominations. Danny's screen debut was in 1977 and since then added onto an extensive career spanning over 3 decades. His most notable screen credits include the Clint Eastwood-directed film Invictus (2009) and the Sci-Fi trilogy-marker Starship Troopers 3: Marauder (2008). Notable television appearances include The Lost Future (2010) (TV), The Sinking of Laconia (2011) (TV) and Labyrinth (2012) (TV).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0449044","name":"Danny Keogh","idIMDB":"nm0449044"},"actorId":"nm0449044","character":"King Dunchaid","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Lothian","urlProfile":"http://www.imdb.com/name/nm3462243","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjkzMjA2Njk1M15BMl5BanBnXkFtZTgwNzcxNTUwNzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Richard Lothian is an actor already making waves in both the international and South African film community with such movies as Northmen, Gettysburg and Momentum. Based in South Africa he takes full advantage of the natural playground of the stunning Cape Town landscape and can often be found surfing or honing himself with physical challenges of all kinds.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjkzMjA2Njk1M15BMl5BanBnXkFtZTgwNzcxNTUwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3462243","name":"Richard Lothian","idIMDB":"nm3462243"},"actorId":"nm3462243","character":"Haldor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Johan Hegg","urlProfile":"http://www.imdb.com/name/nm5956437","urlPhoto":"","biography":{"bio":"Johan Hegg (1973 Stockholm, Sweden) is the singer of melodic death metal band Amon Amarth. He joined in 1991 (by the time it was called \"scum\"). Known for his 35 cm beard and his deep down guttural voice. His first role as an actor will be in Northmen: A viking saga (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5956437","name":"Johan Hegg","idIMDB":"nm5956437"},"actorId":"nm5956437","character":"Valli","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2290553","urlIMDB":"http://www.imdb.com/title/tt2290553","business":{"budget":null,"openingWeekend":[{"money":"€7,537","country":"Portugal","day":"15","month":"02","year":"2015","remarks":"7 Screens"},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/2013/\">2013</a>"}],"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 37 min (97 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":["Digital (Digital Cinema Package DCP)"]},"rating":"5.4","metascore":"50","filmingLocations":[{"location":"South Africa"}],"rated":"R","awards":[{"award":"Motion Picture Sound Editors, USA 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing - Sound Effects, Foley, Dialogue and ADR in a Foreign Feature Film","names":[{"name":"Markus Glunz","id":"nm0323274","role":"supervising sound editor"},{"name":"Peter Staubli","id":"nm0823880","role":"supervising sound editor"},{"name":"Benjamin Krbetschek","id":"nm1709591","role":"sound designer"},{"name":"Christoph Ulbich","id":"nm1286006","role":"sound designer"},{"name":"Felix Andriessens","id":"nm1619145","role":"supervising adr editor"},{"name":"Dominik Schleier","id":"nm0444924","role":"supervising dialogue editor"},{"name":"Michael Stancyk","id":"nm2238995","role":"foley artist"},{"name":"Max Bauer","id":"nm0061897","role":"foley artist"},{"name":"Laura Plock","id":"nm2523687","role":"sound effects editor"},{"name":"Dietrich Körner","id":"nm0477984","role":"sound effects editor"},{"name":"David Rusitschka","id":"nm5942868","role":"sound effects editor"},{"name":"Jonathan Feurich","id":"nm5529005","role":"music editor"}]}]}]}],"votes":"7,190","type":"Movie","companyCreditsSimple":[{"idCompany":"co0322103","name":"Elite Filmproduktion"},{"idCompany":"co0178163","name":"Jumping Horse Film"},{"idCompany":"co0053452","name":"Two Oceans Production (TOP)"}],"keywords":{"keywords":["viking","noble","sword","violence","battle","ship"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:40:16"}}