{"data":{"movies":[{"title":"The Cut","originalTitle":"","year":"2014","releaseDate":"20150114","directors":[{"name":"Fatih Akin","id":"nm0015359"}],"writers":[{"name":"Fatih Akin","id":"nm0015359"},{"name":"Mardik Martin","id":"nm0552731"}],"runtime":"138 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MDExMDg3N15BMl5BanBnXkFtZTgwODkzMTk1NjE@._V1.jpg","countries":["Germany","France","Italy","Russia","Poland","Canada","Turkey","Jordan"],"languages":["Armenian","Arabic","Turkish","Kurdish","Spanish","English"],"genres":["Drama","History"],"plot":"This film is based on the Armenian Genocide in the Ottoman Empire 1915, which resulted in the forced migration and diaspora of the Armenian minority. One day a young family man, Nazaret Manoogian, gets deported by the Turkish authorities together with all the other Armenian men from his native village of Mardin. He becomes a forced laborer and only survives the mass murder by chance and an act of kindness, but loses his family, speech and faith. One night the devastated Nazaret learns that his daughters may still be alive and didn't die like his wife from starvation, violence or rape on death marches. Nazaret goes on a quest to find them and travels from his small village through the Mesopotamian deserts to the sea, always looking for clues that might lead him to his children. Nazaret's epic journey will take him from Asia to America, from the end to a new beginning...","simplePlot":"In 1915 a man survives the Armenian genocide in the Ottoman Empire, but loses his family, speech and faith. One night he learns that his twin daughters may be alive, and goes on a quest to find them.","actors":[{"actorName":"Tahar Rahim","urlProfile":"http://www.imdb.com/name/nm2588665","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NjYwNTMxMF5BMl5BanBnXkFtZTcwNjA2MjM1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 July 1981","placeOfBirth":" Belfort, Territoire de Belfort, France","height":"5' 7½\" (1.71 m)","bio":"Tahar Rahim was born on July 4, 1981 in Belfort, Territoire de Belfort, France. He is an actor, known for A Prophet (2009), Le passé (2013) and Day of the Falcon (2011). He has been married to Leïla Bekhti since 2010.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NjYwNTMxMF5BMl5BanBnXkFtZTcwNjA2MjM1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2588665","name":"Tahar Rahim","idIMDB":"nm2588665"},"actorId":"nm2588665","character":"Nazaret Manoogian","urlCharacter":"http://www.imdb.com/character/ch0473579","main":true},{"actorName":"Simon Abkarian","urlProfile":"http://www.imdb.com/name/nm0008787","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MDc4MDU5NV5BMl5BanBnXkFtZTYwNzc5OTc0._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 March 1962","placeOfBirth":" Gonesse, Val-d'Oise, France","birthName":"Simone Abkarian","bio":"Simon Abkarian was born Simone Abkarian on March 5, 1962, in Gonesse, a northeastern suburb of Paris, France, into a French - Armenian family. Young Simon Abkarian grew up in a trilingual environment, he learned French at school in addition to his native Armenian, and also learned English by watching American films since he was a kid. He spent most of his childhood in France until the age of nine, then went with his parents to Beirut, Lebanon. From 1971 to 1977 young Abkarian lived with his mother and father in Lebanon. He studied dancing with the Lori Dance Ensemble in Beirut. There he attended Armenian school and also studied French and English. In 1977, his father went to war in Lebanon, and 15-year-old Abkarian with his mother moved back to Paris. A few years later he moved to New York and continued his studies of dancing and acting at the Antranik company in New York, then moved to Los Angeles, California. In 1983-1985 he studied acting and joined the Armenian Theatre Company Artavadzt of the AGBU under the leadership of director Gerald Papazian. In 1984, he joined the workshop at renown Theatre du Soleil on tour in Los Angeles during the Olympics Art Festival. Abkarian took a month-long acting workshop from Mnouchkine's mask-maker, Georges Bigot, then was auditioned by Ariane Mnouchkine who invited him to join the company. In 1985 Abkarian returned to Paris, France. There he resumed a successful stage acting career, and had an eight-year-long collaboration with Ariane Mnouchkine, the legendary director of Théâtre du Soleil. There he played leading roles in Greek tragedies and became known for his charismatic performances. He also directed several stage plays in Paris, including Shakespeare's 'Love's Labour Lost' at the Bouffles du Nord, and Aeschylus's 'The Last Song of Troy' at Bobigny, among others. In 2001 Abkarian won the highest award in French theatre for an actor - the Prix Molière, for his performance in 'Une Bête Sur La Lune' (aka.. Beast on the Moon). Since 1993, Abkarian and his actress-director wife, Catherine Schaub, started their own theatre T.E.R.A. (Theatre Espace Recherche Acteur) in Paris. There he has been playing and directing classical and contemporary plays. In the season of 2005-2006, he was brought by The Actors' Gang to direct Shakespeare's 'Love's Labor's Lost' in Los Angeles. Abkarian made his film debut in 1989, in a short film 'Ce qui me meut' by director Cédric Klapisch. During his early film career, Abkarian enjoyed a fruitful collaboration with Cédric Klapisch in 6 French films, becoming noticed in the award winning When the Cat's Away (1996). He earned critical acclaim for his portrayal of painter Archil Gorky in Atom Egoyan's award winning epic Ararat (2002). Simon Abkarian won awards for his performance as Eliahou in 'To Take a Wife (2004) by director Ronit Elkabetz. That same year Abkarian gave a stellar performance in his first leading role in English, co-starring as He, a passionate Lebanese doctor turned cook who is in love with an American woman (Joan Allen) in Yes (2004) directed by Sally Potter. He made a step forward in his film career with the supporting role as Alex Dimitros in Casino Royale (2006), playing in several powerful scenes opposite Daniel Craig. Simon Abkarian has been generously involved in the humanitarian causes of the Armenian people across the world. He has been a frequent participant, host and presenter at numerous charitable events and ceremonies related to the Armenian causes. He was also a member of French President Jacques Chirac's delegation to Armenia in October of 2006.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MDc4MDU5NV5BMl5BanBnXkFtZTYwNzc5OTc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0008787","name":"Simon Abkarian","idIMDB":"nm0008787"},"actorId":"nm0008787","character":"Krikor","urlCharacter":"http://www.imdb.com/character/ch0473580","main":true},{"actorName":"Makram Khoury","urlProfile":"http://www.imdb.com/name/nm0403374","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4MDI2MjI0Nl5BMl5BanBnXkFtZTgwNTc5NzQ2NDE@._V1_UY44_CR22,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1945","placeOfBirth":" Jerusalem, Palestine [now Israel]","bio":"Palestinian-Israeli actor Makram Khoury was the youngest artist and the first Arab to win the Israel Prize, the highest artistic honor in the country. He is one of Israel's most respected actors, playing leads in all the major theatres as well as acting in films and on television. Khoury is an actor's actor: subtle, powerful and protean. He embodies many of the paradoxes of Israeli society. He was born to a Christian-Arab family who belonged to the Greek Orthodox church: Greek Orthodox, Christian, Arab, Palestinian. He and his family fled to Lebanon during the 1948 Arab-Israeli war. After five months of unemployment, Makram's lawyer father decided to risk returning rather than live in a refugee camp. Makram's family found housing in the Northern Israeli city of Acco. When he graduated high school in 1963, he went to study at The Hebrew University but soon dropped out to act. He trained with Jacqueline Kronberg-an American teacher who had worked with Second City-and also got involved with an Arab Theatre in Haifa. Eventually he went to Drama School in England. When he returned, even though he soon began getting work at The Cameri Theatre and the Haifa Municipal Theatre, he experienced an identity crisis. The Cameri arranged coaching for him in voice, diction and Hebrew. No professional Arabic theatre existed in Israel, only amateur companies. To fulfill himself as an actor, he had to work in Hebrew. Khoury came to a compromise with this situation through dreams.\" With help from his friend Anton Shamas, a distinguished Palestinian-Israeli writer, he decoded a message from his own unconscious. He saw himself as a clown in a circus sitting on a unicycle going around a circle, balancing with arms spread out, saying, 'I'm breathing, I'm alive! & saw a coin with two heads on the handlebars. On one side it said 'Israeli-Arab,' on the other, 'Israeli.' Acting managed to cure his wounds. Maintaining this balance is particularly challenging for Makram since the 2nd Intifada began. \"I started to blame and hate my colleagues. I said: How will I go up on the Israeli stage and act in Hebrew? I can't, I can't. Then I see all these bombs, these terrorist acts that I disagree with, like many other Palestinians, and that brings me back to the balancing.\" Makram's wife Wadia is an Art Teacher. Two of his children - Clara & Jamil- are also actors. His daughter Rula is a Project Manager at The Science Museum in Jerusalem.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4MDI2MjI0Nl5BMl5BanBnXkFtZTgwNTc5NzQ2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0403374","name":"Makram Khoury","idIMDB":"nm0403374"},"actorId":"nm0403374","character":"Omar Nasreddin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hindi Zahra","urlProfile":"http://www.imdb.com/name/nm3796377","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwOTc0MzU5MV5BMl5BanBnXkFtZTgwNzc4Nzg1MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"It looks like we don't have any Biography for Hindi Zahra yet.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwOTc0MzU5MV5BMl5BanBnXkFtZTgwNzc4Nzg1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3796377","name":"Hindi Zahra","idIMDB":"nm3796377"},"actorId":"nm3796377","character":"Rakel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevork Malikyan","urlProfile":"http://www.imdb.com/name/nm0539616","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg3NTY1OTg5OF5BMl5BanBnXkFtZTgwMjc5NDUxODE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 June 1943","placeOfBirth":" Turkey","height":"5' 6½\" (1.69 m)","bio":"Kevork is a British actor of Armenian descent, born in Diyarbakir. He spent seven years training for priesthood at the Holy Cross Seminary, in Istanbul. He received his acting,and,teaching qualifications from Rose Bruford College,(1964-67). His first major film was Midnight Express, followed by, Indiana Jones and The Last Crusade. His first major tv series was Mind Your Language, attracting 18 million viewers, weekly.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg3NTY1OTg5OF5BMl5BanBnXkFtZTgwMjc5NDUxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0539616","name":"Kevork Malikyan","idIMDB":"nm0539616"},"actorId":"nm0539616","character":"Hagob Nakashian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bartu Küçükçaglayan","urlProfile":"http://www.imdb.com/name/nm2071234","urlPhoto":"","biography":{"dateOfBirth":"1983","placeOfBirth":" Eskisehir, Turkey","bio":"Bartu Kucukcaglayan is a musician and actor, born in Eskisehir, Bartu. He went to Istanbul University-State Conservatory in 2011. He took a part in the play of \"Kent Oyunculari\" -Inishmore'lu Yuzbasi. Now, he is acting in a brand-new TV series - \"Yalan Dunya\". He is also leading a band called \"Buyuk Ev Ablukada.\"","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2071234","name":"Bartu Küçükçaglayan","nicknames":["Canavar Banavar"],"idIMDB":"nm2071234"},"actorId":"nm2071234","character":"Mehmet","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zein Fakhoury","urlProfile":"http://www.imdb.com/name/nm6691971","urlPhoto":"","biography":{"bio":"Zein Fakhoury is an actress, known for The Cut (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6691971","name":"Zein Fakhoury","idIMDB":"nm6691971"},"actorId":"nm6691971","character":"Arsinée","urlCharacter":"http://www.imdb.com/character/ch0473581","main":true},{"actorName":"Dina Fakhoury","urlProfile":"http://www.imdb.com/name/nm6691972","urlPhoto":"","biography":{"bio":"Dina Fakhoury is an actress, known for The Cut (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6691972","name":"Dina Fakhoury","idIMDB":"nm6691972"},"actorId":"nm6691972","character":"Lucinée","urlCharacter":"http://www.imdb.com/character/ch0473582","main":true},{"actorName":"Trine Dyrholm","urlProfile":"http://www.imdb.com/name/nm0245988","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNjUyMjY1OV5BMl5BanBnXkFtZTcwNjc2MjYyOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1972","placeOfBirth":" Odense, Denmark","height":"5' 7¾\" (1.72 m)","bio":"Trine Dyrholm was born on April 15, 1972 in Odense, Denmark. She is an actress and director, known for The Celebration (1998), A Royal Affair (2012) and Love Is All You Need (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNjUyMjY1OV5BMl5BanBnXkFtZTcwNjc2MjYyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0245988","name":"Trine Dyrholm","idIMDB":"nm0245988"},"actorId":"nm0245988","character":"Orphanage Headmistress","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arsinée Khanjian","urlProfile":"http://www.imdb.com/name/nm0451376","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4OTU3NTQ5NV5BMl5BanBnXkFtZTcwODUyNDIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1958","placeOfBirth":" Beirut, Lebanon","bio":"Arsinée Khanjian was born on September 6, 1958 in Beirut, Lebanon. She is known for her work on Le voyage de Felicia (1999), De beaux lendemains (1997) and Ararat (2002). She is married to Atom Egoyan. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4OTU3NTQ5NV5BMl5BanBnXkFtZTcwODUyNDIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0451376","name":"Arsinée Khanjian","idIMDB":"nm0451376"},"actorId":"nm0451376","character":"Mrs. Nakashian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Akin Gazi","urlProfile":"http://www.imdb.com/name/nm2141398","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MTU0MTEwNV5BMl5BanBnXkFtZTcwNTYxOTExNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1981","placeOfBirth":" London, England, UK","height":"5' 10\" (1.78 m)","bio":"Akin Gazi was born in Edmonton, London. He attended Queen Mary, University of London studying English and Drama graduating in 2003. In 2010 Gazi secured his first film role in \"The Devil's Double\" directed by Lee Tamahori, this was followed by appearances in \"Black Gold\" (Jean-Jacques Annaud) \"Zero Dark Thirty\" (Kathryn Bigelow) and \"The Cut\" (Fatih Akin). He has numerous TV credits including ''Silent Witness'' (BBC), ''Da Vinci's Demons'' (Starz), ''Knightfall'' (History) and ''Prison Break'' (FOX).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MTU0MTEwNV5BMl5BanBnXkFtZTcwNTYxOTExNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2141398","name":"Akin Gazi","idIMDB":"nm2141398"},"actorId":"nm2141398","character":"Hrant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shubham Saraf","urlProfile":"http://www.imdb.com/name/nm4788100","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NjM1NzY3MF5BMl5BanBnXkFtZTcwNjM2NzU4OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Shubham Saraf is an actor, known for Honour (2014), The Cut (2014) and Suspension of Disbelief (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NjM1NzY3MF5BMl5BanBnXkFtZTcwNjM2NzU4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4788100","name":"Shubham Saraf","idIMDB":"nm4788100"},"actorId":"nm4788100","character":"Levon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Georgiou","urlProfile":"http://www.imdb.com/name/nm1745190","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjE0NTI0OV5BMl5BanBnXkFtZTgwNTc2NzY2NTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"George trained at the prestigious Drama Centre London alongside Tom Hardy and Michael Fassbender. He grew up above his fathers grocery store in North London. His career started on the London stage in plays at the National Theatre, Theatre Royal S.E, Haymarket Theatre and numerous off West End productions. In 2012 he returned to the stage to play the leading role in a new play 'Chicken' at the Trafalgar Studio in the heart of London's West End. George has appeared in some of the most successful TV shows including Game of Thrones, The Honourable Woman, Homeland,The Americans, The Last Ship, Bones, Law & Order, Spooks and many more. On the big screen George starred in the mega hit movie Mamma Mia along side Meryl Streep. Other movies include 300:Rise of an Empire, RED 2, The Cut, The Mummy (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjE0NTI0OV5BMl5BanBnXkFtZTgwNTc2NzY2NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1745190","name":"George Georgiou","idIMDB":"nm1745190"},"actorId":"nm1745190","character":"Vahan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arevik Martirosyan","urlProfile":"http://www.imdb.com/name/nm1965969","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2OTUyMDcyNV5BMl5BanBnXkFtZTgwNTc4Nzg1MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Arevik Martirosyan is known for her work on The Cut (2014), Sunrise over Lake Van (2011) and The Earthquake (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2OTUyMDcyNV5BMl5BanBnXkFtZTgwNTc4Nzg1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1965969","name":"Arevik Martirosyan","idIMDB":"nm1965969"},"actorId":"nm1965969","character":"Ani","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lara Heller","urlProfile":"http://www.imdb.com/name/nm3946564","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NTU0MTE0OV5BMl5BanBnXkFtZTgwNjA5NzM2MDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Lara Heller is a well-seasoned action actress with a background in screen fighting. She performs in 4 languages fluently; English, German, French and Persian and can switch between 15 different accents. Lara first came to public attention as the actress in The Cut, which won the Vittorio Veneto Award at the Venice Film Festival. The story is about a father (Tahar Rahim) searching for his twin daughters (Lara Heller). The film was endorsed by Martin Scorsese who was quoted as saying \"Fatih Akin's The Cut is a genuine, hand-made epic, of the type that people just don't make anymore.\" Lara has just wrapped on Troy-The Odyssey, a Tekin Girgin film. The adventure movie expands on the Trojan War and is much in the spirit of Indiana Jones. Lara plays a swashbuckling Trojan warrior stolen out to sea against her will. New credits include Breaking The Bank, by Vadim Jean (Universal Pictures International) and Ben Hur, by Mark Atkins (Kaleidoscope Film). In this action drama, retired gladiator Ben Hur (Adrian Bouchet) trains Lucia (Lara Heller) and a group of young vigilantes to fight the Romans in their homeland. In the new British gangland film, Welcome To Curiosity, Lara shoots bullets as a sultry killer named Duffy. The role was originally written for a man and the producers specifically re-wrote the character for Lara. The British crime movie contains five tales that share one thing in common: curiosity kills. A successful gangster (Cristian Solimeno) is forced into a dangerous heist with unscrupulous assassin (Lara Heller) and mafia's elite (Richard Blackwood). Lara's 'appetite' for action roles and sports stunts keeps her fit. Water sports include trick-wakeboarding, waterskiing, surfing, swimming, fly boarding and diving. Winter sports include figure skating and skiing. Dance training includes contemporary, jazz, waltz, salsa and Persian dancing. Additionally, she is experienced in sword fighting and combat. Lara now splits her time between London and LA. She was born in England and raised in a mountain village in Germany, Switzerland and Luxembourg. Lara started on the stage in Belgium and trained at the drama studio Arts Educational Schools where Julie Andrews trained. The Cut, Ben Hur and Breaking The Bank can be seen on Apple iTunes and Amazon. Keep an eye out for Welcome To Curiosity and Troy-The Odyssey, which are due for release next year.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODNmZTEwZjgtZTY3MC00MDVhLWEzNjQtZWUxMWUzMTBmNjEyXkEyXkFqcGdeQXVyMjMzOTc0OTc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3946564","name":"Lara Heller","idIMDB":"nm3946564"},"actorId":"nm3946564","character":"Lucine","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2245171","urlIMDB":"http://www.imdb.com/title/tt2245171","business":{"budget":{"money":"€16,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$28,066","country":"USA","day":"15","month":"11","year":"2015","remarks":""},{"money":"$27,531","country":"USA","day":"08","month":"11","year":"2015","remarks":""},{"money":"$23,039","country":"USA","day":"11","month":"10","year":"2015","remarks":""},{"money":"$20,937","country":"USA","day":"04","month":"10","year":"2015","remarks":""},{"money":"$15,123","country":"USA","day":"27","month":"09","year":"2015","remarks":""}],"weekendGross":[{"money":"$255","country":"USA","day":"15","month":"11","year":"2015","remarks":"1 Screen"},{"money":"$355","country":"USA","day":"08","month":"11","year":"2015","remarks":"1 Screen"},{"money":"$457","country":"USA","day":"11","month":"10","year":"2015","remarks":"2 Screens"},{"money":"$2,476","country":"USA","day":"04","month":"10","year":"2015","remarks":"3 Screens"},{"money":"$4,880","country":"USA","day":"27","month":"09","year":"2015","remarks":"3 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 18 min (138 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arricam LT, Hawk V-Lite, V-Plus and V-Series Lenses","Arricam ST, Hawk V-Lite, V-Plus and V-Series Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Hawk Scope (anamorphic)"],"printedFilmFormat":["35 mm","D-Cinema"]},"rating":"6.2","metascore":"56","filmingLocations":[{"location":"Cuba"}],"rated":"TOUS PUBLICS","awards":[{"award":"CPH PIX 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Politiken's Audience Award","categories":[{"category":"","names":[{"name":"Fatih Akin","id":"nm0015359","role":null}]}]}]},{"award":"German Film Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Film Award in Gold","categories":[{"category":"Best Costume Design (Bestes Kostümbild)","names":[{"name":"Katrin Aschendorf","id":"nm0038492","role":null}]},{"category":"Best Makeup (Bestes Maskenbild)","names":[{"name":"Waldemar Pokromski","id":"nm0688718","role":null},{"name":"Sabine Schumann","id":"nm0776735","role":null}]},{"category":"Best Film Score (Beste Filmmusik)","names":[{"name":"Alexander Hacke","id":"nm0352391","role":null}]}]}]},{"award":"Hamburg Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Art Cinema Award","categories":[{"category":"","names":[{"name":"Fatih Akin","id":"nm0015359","role":null}]}]}]},{"award":"Sofia International Film Festival 2015","titlesAwards":[{"titleAwardOutcome":"Won Audience Award 'Silver Sea-Gull'","categories":[{"category":"Best Film","names":[{"name":"Fatih Akin","id":"nm0015359","role":null}]}]}]},{"award":"Venice Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Won Vittorio Veneto Film Festival Award - Special Mention","categories":[{"category":"","names":[{"name":"Fatih Akin","id":"nm0015359","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Lion","categories":[{"category":"","names":[{"name":"Fatih Akin","id":"nm0015359","role":null}]}]}]}],"votes":"3,197","type":"Movie","companyCreditsSimple":[{"idCompany":"co0440560","name":"Bombero International"},{"idCompany":"co0012835","name":"Pyramide Productions"},{"idCompany":"co0123730","name":"Corazón International"}],"keywords":{"keywords":["armenian genocide","ottoman empire","turkish history","armenian","genocide","diaspora","turkey the country","odyssey","deportation","world war one","mute","charlie chaplin","armenia","refugee","blacksmith","twin sisters"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 00:33:49"}}