{"data":{"movies":[{"title":"A Master Builder","originalTitle":"","year":"2013","releaseDate":"20140622","directors":[{"name":"Jonathan Demme","id":"nm0001129"}],"writers":[{"name":"Henrik Ibsen","id":"nm0406585"},{"name":"Wallace Shawn","id":"nm0001728"}],"runtime":"130 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MTcyNTU5MF5BMl5BanBnXkFtZTgwMjc4MTExNTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"A successful, ego-maniacal architect who has spent a lifetime bullying his wife, employees and mistresses wants to make peace as his life approaches its final act.","simplePlot":"A successful, ego-maniacal architect who has spent a lifetime bullying his wife, employees and mistresses wants to make peace as his life approaches its final act.","actors":[{"actorName":"Wallace Shawn","urlProfile":"http://www.imdb.com/name/nm0001728","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDYzMDQ1OF5BMl5BanBnXkFtZTcwMDQ3OTc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 November 1943","placeOfBirth":" New York City, New York, USA","birthName":"Wallace Michael Shawn","height":"5' 2\" (1.57 m)","bio":"American character actor and writer Wallace Shawn has one of those fun, mischievously homely faces just made to entertain. Though he got out of the starting gate rather slowly, he has since excelled on stage, television and film while managing to turn himself into a winner with his loser-type looks. Woody Allen's character in the movie Manhattan (1979) amusingly describes Wallace's character as \"a homunculus\", which is a pretty fair description of this predominantly bald, wan, pucker-mouthed, butterball-framed, slightly lisping gent. Wallace made his movie debut in Allen's heralded classic playing Diane Keaton's ex-husband. Born to privilege on November 12, 1943 in New York City, Wallace was the son of renowned editor William Shawn of \"The New Yorker\" fame and educated at both Harvard University, where he studied history, and Magdalen College, Oxford. Wallace initially taught English in India on a Fulbright scholarship, and then English, Latin and drama back in New York. However, a keen interest in writing and acting soon compelled him to leave his cushy position and pursue a stage career as both playwright and actor. During his distinguished career, Wallace turned out several plays. \"Our Late Night\", the first of his works to be performed, was awarded an off-Broadway Obie in 1975. \"A Thought in Three Parts\" (1976); \"The Mandrake\" (1977), which he translated from the original Italian and in which he made his acting debut; \"Marie and Bruce\" (1979); \"Aunt Dan and Lemon\" (1985) and \"The Fever\", for which he received his second Obie Award for \"Best New Play\" during the 1990-91 season, then followed. A popular support player in both comedy and occasional drama, his assorted kooks, creeps, eggheads and schmucks possessed both endearing and unappetizing qualities. He earned some of his best early notices partnered with theatre director/actor Andre Gregory in the unique Louis Malle-directed film My Dinner with Andre (1981). Shawn co-wrote the improvisatory, humanistic piece and his brother, Allen Shawn, was the composer. Shawn and Gregory would collaborate again for Malle in another superb, original-concept film Vanya on 42nd Street (1994). Among the quality offbeat filming involving has been Bruce Paltrow's A Little Sex (1982); James Ivory's The Bostonians (1984); Stephen Frears' Prick Up Your Ears (1987); Rob Reiner's The Princess Bride (1987); Alan Rudolph's The Moderns (1988) and Mrs. Parker and the Vicious Circle (1994); Paul Bartel's Scenes from the Class Struggle in Beverly Hills (1989); and several others for Woody Allen: Radio Days (1987), Shadows and Fog (1991), The Curse of the Jade Scorpion (2001) and Melinda and Melinda (2004). Of late, he has lent his vocal talents to a considerable number of animated pictures including A Goofy Movie (1995), Toy Story (1995) (and its sequel), The Jungle Book: Mowgli's Story (1998), The Incredibles (2004), Chicken Little (2005) and Happily N'Ever After (2006). Over the decades, Shawn has scurried about effortlessly in a number of television guest appearances including Taxi (1978), Homicide: Life on the Street (1993), Ally McBeal (1997), Law & Order: Criminal Intent (2001) and Desperate Housewives (2004), and has drummed up a few recurring roles for himself in the process, including The Cosby Show (1984), Murphy Brown (1988), Star Trek: Deep Space Nine (1993) and Crossing Jordan (2001). In the series Clueless (1996), based on the highly successful of the same name Clueless (1995), Shawn revisited his role as the owlish high school teacher.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDYzMDQ1OF5BMl5BanBnXkFtZTcwMDQ3OTc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001728","name":"Wallace Shawn","idIMDB":"nm0001728"},"actorId":"nm0001728","character":"Halvard Solness","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julie Hagerty","urlProfile":"http://www.imdb.com/name/nm0353546","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU4NzU4ODU1N15BMl5BanBnXkFtZTYwMDk1NzU1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 June 1955","placeOfBirth":" Cincinnati, Ohio, USA","height":"5' 7\" (1.7 m)","bio":"Julie Hagerty's unique personality and talent likely would have been better served had she worked under the Hollywood studio system. As it is, her place in cinema history is secure with her role of stewardess Elaine Dickinson in the comedy classic Airplane! (1980). Hagerty should have evolved into a latter-day Jean Arthur, or become a highly valued supporting player a la Zasu Pitts. Julie was born in Cincinnati, Ohio on June 15, 1955. Her father, Jerald William Hagerty, Jr., was a musician, and her mother, Harriet Yuellig (née Bishop), was a singer and model. Julie followed her mother in her latter career, signing with Ford Models agency at the age of 15. The teenager spent her summer vacations modeling in New York City, where she moved in 1972 after graduating from high school. Her older brother was part of a New York theatrical troupe, \"The Production Company\", and she studied acting with William Hickey. In 1979, she made her off-Broadway theatrical debut in The Production Company's show Mutual Benefit Life; subsequently, she appeared on Broadway in John Guare's comedy \"The House of Blue Leaves\" in 1986-87, for which she won a 1986 Theatre World Award. Airplane! (1980), ranked #10 on the American Film Institute's list of the Top 100 Comedies, rates as her official film debut, though she had a part in erstwhile lover Bob Fosse's All That Jazz (1979) that, unfortunately, wound up on the proverbial killing floor of the cutting room (which was actually featured in Fosse's impressionistic argosy influenced by Federico Fellini's 8½ (1963). After her smashing debut, Hagerty appeared in the inevitable sequel, and starred in major theatrical films, including Woody Allen's A Midsummer Night's Sex Comedy (1982), 'Albert Brooks (I)' Lost in America (1985), and Robert Altman's Beyond Therapy (1987). After the failure of the Altman film, her career cooled off; Hagerty began appearing mostly in supporting roles in feature films and in made-for-TV movies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU4NzU4ODU1N15BMl5BanBnXkFtZTYwMDk1NzU1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0353546","name":"Julie Hagerty","idIMDB":"nm0353546"},"actorId":"nm0353546","character":"Aline Solness","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lisa Joyce","urlProfile":"http://www.imdb.com/name/nm2436809","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg3NDQwNjkyOF5BMl5BanBnXkFtZTgwMzI2NzI0OTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"bio":"Born and raised in Chicago, Lisa Joyce received her BFA in Acting from the Theater School at DePaul University. She received a Joseph Jefferson nomination for her performance in Adam Rapp's \"Red Light Winter\", which premiered at the Steppenwolf Theater Company before transferring off-Broadway and being named a finalist for The Pulitzer Prize. Lisa made her West End/Broadway debut in \"La Bete\", starring Mark Rylance and David Hyde Pierce, and toured nationally, alongside Cherry Jones in the Tony Award-winning production of \"Doubt\". Some of her favorite off-Broadway credits include: Nora Ephron and Delia Ephron's beloved production of \"Love, Loss and What I Wore\" and Soho Rep.'s \"The Ugly One\", for which she earned a Drama Desk nomination. Lisa has also appeared in productions at The Public, New York Theater Workshop, The Signature, Classic Stage Company, Rattlestick, Transport Group, StageFARM, Williamstown and The Studio Theater in D.C., where she received a Helen Hayes Award for her role in \"Blackbird\". Lisa is a member of the LAByrinth Theater Company.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg3NDQwNjkyOF5BMl5BanBnXkFtZTgwMzI2NzI0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2436809","name":"Lisa Joyce","idIMDB":"nm2436809"},"actorId":"nm2436809","character":"Hilde Wangel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andre Gregory","urlProfile":"http://www.imdb.com/name/nm0339737","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY0MjA1ZTMtYWFiNy00YThkLWIzOGUtMDAwMGY4OGI5YzVmL2ltYWdlXkEyXkFqcGdeQXVyNTAyNDQ2NjI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 May 1934","placeOfBirth":" Paris, France","bio":"The director and actor Andre Gregory was born on May 11, 1934, to a family he describes as fugitives from Stalinist Russia and Nazi Germany. Gregory was born in a hotel in Paris, his mother reportedly having just played cards with the Turkish ambassador. His childhood was spent in Hollywood amongst the stars of the 1940s. Gregory attended Harvard and then studied acting, but was unable to find his feet in that profession. Theatrical success finally came to Gregory as a director in the avant-garde theater in Philadelphia, Los Angeles and New York. By the late 1960s he had established himself as a prominent director in New York experimental theater, collaborating with such luminaries as the legendary Polish director Jerzy Grotowski. Probably the most remarkable achievement in this early summit of Gregory's career came in 1970 when his theater group, The Manhattan Project, staged \"Alice's Adventures in Wonderland\" in New York for a year, which then went on to tour the world to acclaim, and earned him OBIE and Drama Desk Awards for his directing. In the early 1970s, Gregory underwent an existential crisis in his life and work which essentially brought this successful career to a halt. Five years later, as he began to emerge from a period of doubt and introspection, he met with and shared his many recent experiences -- all unique, some even bizarre -- with a friend, the actor and writer Wallace Shawn. (Gregory had met Shawn when Shawn famously attended every performance of Gregory's 1970 \"Alice in Wonderland\" staging.) Shawn was impressed by Gregory's humane, articulate way of relating this painful time in his life, and saw the potential for humor in the huge personality difference between the two friends, and suggested that the couple consider staging these discussions as a movie. The result, in collaboration with director Louis Malle, was My Dinner with Andre (1981), one of the most unique, touching, and funny movie-going experiences in modern cinema. The success of \"My Dinner with Andre\" marked the end of Gregory's hibernation, and he returned to directing plays in his extremely slow and deliberate way - Gregory often works with the cast of a play for a year or longer before taking the play to an audience. Remarkably, the exposure \"My Dinner with Andre\" gave him resulted, finally, in the acting career which eluded him so long ago, and has since led to roles in such films as The Last Temptation of Christ (1988) and The Mosquito Coast (1986) as well as acting work on Broadway. Gregory's work with an acting troupe on the play \"Uncle Vanya\" in a decaying theater in Times Square was brought to the screen in Vanya on 42nd Street (1994), also directed by Malle (it would be his last film). Ironically, one of Gregory's first roles after \"My Dinner with Andre\" brought him back to _Alice in Wonderland (1983) (TV)_, this time as an actor, in a production for PBS. A lifelong progressive, Gregory has increasingly devoted his time to political causes. Gregory was married to the prominent New York filmmaker and theater producer Mercedes (Chiquita) Gregory for many years. Mercedes passed away, and Gregory recently married filmmaker Cindy Kleine. Gregory and Kleine now live on Cape Cod.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY0MjA1ZTMtYWFiNy00YThkLWIzOGUtMDAwMGY4OGI5YzVmL2ltYWdlXkEyXkFqcGdeQXVyNTAyNDQ2NjI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0339737","name":"Andre Gregory","idIMDB":"nm0339737"},"actorId":"nm0339737","character":"Knut Brovik","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larry Pine","urlProfile":"http://www.imdb.com/name/nm0683978","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NzY3MzE4MF5BMl5BanBnXkFtZTYwMjI1MDE0._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1945","placeOfBirth":" Tucson, Arizona, USA","bio":"Larry Pine was born on March 3, 1945 in Tucson, Arizona, USA. He is an actor, known for The Grand Budapest Hotel (2014), One Life to Live (1968) and Moonrise Kingdom (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NzY3MzE4MF5BMl5BanBnXkFtZTYwMjI1MDE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0683978","name":"Larry Pine","idIMDB":"nm0683978"},"actorId":"nm0683978","character":"Dr. Herdal","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emily Cass McDonnell","urlProfile":"http://www.imdb.com/name/nm2632125","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzc5NzE1MDA0Ml5BMl5BanBnXkFtZTgwMTMyMjYxMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Emily Cass McDonnell is an actress, known for Ricki and the Flash (2015), Before It Had a Name (2005) and Marie and Bruce (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzc5NzE1MDA0Ml5BMl5BanBnXkFtZTgwMTMyMjYxMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2632125","name":"Emily Cass McDonnell","idIMDB":"nm2632125"},"actorId":"nm2632125","character":"Kaia Fosli","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joanna Howard","urlProfile":"http://www.imdb.com/name/nm2086831","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NjY0NDUxNl5BMl5BanBnXkFtZTcwMDY2MjU2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Joanna Howard is an actress, known for Broadcasting Christmas (2016), A Master Builder (2013) and Rocket (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NjY0NDUxNl5BMl5BanBnXkFtZTcwMDY2MjU2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2086831","name":"Joanna Howard","idIMDB":"nm2086831"},"actorId":"nm2086831","character":"Nurse Nora","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Winsome Brown","urlProfile":"http://www.imdb.com/name/nm1175113","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTRlOWU4NWYtMmMyZS00OWY3LTkyMzQtZWRiOTJmODc5YTIzL2ltYWdlXkEyXkFqcGdeQXVyNTYyNjc1ODg@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"bio":"Winsome Brown is an actress and writer, known for Nightfall (2000), On_Line (2002) and Heights (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTRlOWU4NWYtMmMyZS00OWY3LTkyMzQtZWRiOTJmODc5YTIzL2ltYWdlXkEyXkFqcGdeQXVyNTYyNjc1ODg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1175113","name":"Winsome Brown","idIMDB":"nm1175113"},"actorId":"nm1175113","character":"Nurse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeff Biehl","urlProfile":"http://www.imdb.com/name/nm1828069","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMzMwMDg3Nl5BMl5BanBnXkFtZTgwMTcyNDU4NjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 August 1973","placeOfBirth":" Medford, New Jersey, USA","birthName":"Jeffrey Robert Biehl","height":"5' 11\" (1.8 m)","bio":"Jeff Biehl was born on August 22, 1973 in Medford, New Jersey, USA as Jeffrey Robert Biehl. He is an actor, known for BioShock 2 (2010), Ricki and the Flash (2015) and Squad 85 (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMzMwMDg3Nl5BMl5BanBnXkFtZTgwMTcyNDU4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1828069","name":"Jeff Biehl","idIMDB":"nm1828069"},"actorId":"nm1828069","character":"Ragnar Brovik","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sheilagh Weymouth","urlProfile":"http://www.imdb.com/name/nm0923417","urlPhoto":"","biography":{"bio":"Sheilagh Weymouth is a classically trained, award winning actress, 1986 graduate of The Neighborhood Playhouse School of The Theatre, having studied with Sanford Meisner, is a classically trained mezzo soprano (E3-G5), as well as an actress who moves very well - a True Triple Threat. A seasoned leading lady and character actress who has experience in film, TV, theatre and radio - from comedy to drama to improv to musicals to Shakespeare - she easily moves amongst the genres, is a quick study and a graciously inventive collaborator with solutions. Born in Philadelphia, the eldest in her Irish Catholic family, a visit to NYC at 8 years old cemented Sheilagh's idea of a home she could live with. It took twenty years to get there, and Sheilagh still adores her beloved Manahatta, having now lived there for over half her life. However, Sheilagh also adores traveling and is always packed for a job's location. Sheilagh's interests inform her unique perspectives that she brings to her acting, from holistic doctoring to dancing with Maasai to Yoga to scuba diving to horseback riding to kayaking to green-thumbing, and moving around a bunch as a kid lends her to easily adapting to any accent or dialect a part calls for. Nobody laughs harder at life than Sheilagh. Nobody can make six cents out of a nickel better than Sheilagh. And nobody lives life more fully than Sheilagh.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0923417","name":"Sheilagh Weymouth","idIMDB":"nm0923417"},"actorId":"nm0923417","character":"Nurse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marjorie Graham","urlProfile":"http://www.imdb.com/name/nm5250166","urlPhoto":"","biography":{"bio":"Marjorie Graham is an actress, known for A Master Builder (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5250166","name":"Marjorie Graham","idIMDB":"nm5250166"},"actorId":"nm5250166","character":"Nurse","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2276069","urlIMDB":"http://www.imdb.com/title/tt2276069","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"$21,487","country":"USA","day":"03","month":"08","year":"2014","remarks":""}],"weekendGross":[{"money":"$4,135","country":"USA","day":"03","month":"08","year":"2014","remarks":"1 Screen"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 10 min (130 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["16 : 9 (some scenes)","2.35 : 1"],"camera":["Arri Alexa"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":["ARRIRAW"],"printedFilmFormat":null},"rating":"6.0","metascore":"67","filmingLocations":[],"rated":"NOT RATED","awards":[{"award":"Rome Film Fest 2013","titlesAwards":[{"titleAwardOutcome":"Nominated CinemaXXI Award","categories":[{"category":"","names":[{"name":"Jonathan Demme","id":"nm0001129","role":null}]}]}]}],"votes":"446","type":"Movie","companyCreditsSimple":[{"idCompany":"co0077074","name":"Polyphonic (II)"},{"idCompany":"co0372843","name":"Ibsen Project"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 18:32:35"}}