{"data":{"movies":[{"title":"Calvary","originalTitle":"","year":"2014","releaseDate":"20141126","directors":[{"name":"John Michael McDonagh","id":"nm0567620"}],"writers":[{"name":"John Michael McDonagh","id":"nm0567620"}],"runtime":"102 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MjQ1MjE2M15BMl5BanBnXkFtZTgwNTMzNjE4MTE@._V1.jpg","countries":["Ireland","UK"],"languages":["English"],"genres":["Drama"],"plot":"Father James is a small-town priest in Ireland whose Sunday confessionals suddenly include a threat to kill him in a week's time as a matter of principle. Deeply troubled and conflicted about how to respond, Father James tries to go on with his calling through that week. However, that proves impossible as he is confronted with a troubling variety of spiritual challenges from both his estranged daughter and his own parishioners. In those dispiriting struggles, Father James' life begins to fall apart as time runs out towards a confrontation that seems to crystallize his values and what he wants his life to be.","simplePlot":"After he is threatened during a confession, a good-natured priest must battle the dark forces closing in around him.","actors":[{"actorName":"Brendan Gleeson","urlProfile":"http://www.imdb.com/name/nm0322407","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3NTMxODI0OTBeQTJeQWpwZ15BbWU3MDQ1NTY5Mjc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 March 1955","placeOfBirth":" Dublin, Ireland","height":"6' 2\" (1.88 m)","bio":"Brendan Gleeson was born in Dublin, Ireland, to Pat and Frank Gleeson. From a very young age, he loved to learn, especially reading classical text in and outside the classroom. He took great attention to Irish play writers such as Samuel Beckett, which eventually led to him performing in his high school play production of \"Waiting for Godot\", and paying great attention to detail in his high school drama classes. Upon finishing 12th grade, he spent a couple of years with the Dublin Shakespeare Festival, and under the advice of a director there, headed across to London and auditioned for drama schools. Soon to follow, he was invited to audition for the Royal Shakespeare Company in Stratford upon Avon, and spent a couple of seasons back in England on the stage. He then, at the age of thirty five, decided to audition for films in the UK and began to build a very respectable resume playing many different diverse characters. He made his debut as a quarryman in The Field (1990). He had several small roles in major Hollywood movies based in Ireland, such as Far and Away (1992) and Le cheval venu de la mer (1992). Memorably played historical Irish figure \"Michael Collins\" in The Treaty (1991). Made his breakthrough in Scottish themed Braveheart (1995), which was largely filmed in Ireland, opposite Mel Gibson. He played Gibson's right-hand man \"Hamish\". Since then, he has appeared in numerous major films such as Mission: Impossible II (2000), Lake Placid (1999), Turbulence (1997). He has made a name for himself taking the titular role in The General (1998), based on the life of Irish criminal \"Martin Cahill\", for which he won the Boston Society of Film Critics Award. He appears in director John Boorman's film The Tailor of Panama (2001) as well as Martin Scorsese's Gangs of New York (2002) and Steven Spielberg's A.I. Artificial Intelligence (2001). Ever since, he has continued to bring his huge stage presence to the screen, always delivering the character in full development to his audience. He is married to his lovely wife, Mary, since 1982. They have four sons.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3NTMxODI0OTBeQTJeQWpwZ15BbWU3MDQ1NTY5Mjc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0322407","name":"Brendan Gleeson","idIMDB":"nm0322407"},"actorId":"nm0322407","character":"Father James","urlCharacter":"http://www.imdb.com/character/ch0329450","main":true},{"actorName":"Chris O'Dowd","urlProfile":"http://www.imdb.com/name/nm1483369","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MTQwNzk5NF5BMl5BanBnXkFtZTgwOTgzMDEwMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1979","placeOfBirth":" Sligo, Ireland","height":"6' 3\" (1.91 m)","bio":"Christopher \"Chris\" O'Dowd born 9 October 1979 is an Irish actor and comedian best known for his role as Roy Trenneman in the Channel 4 comedy The IT Crowd. O'Dowd created and is starring in the Sky 1 television series Moone Boy. He had a recurring role on the drama series Girls and starred in the television series Family Tree. O'Dowd is also known for his films, most notably Bridesmaids (2011), This Is 40 (2012), The Sapphires (2012), Thor: The Dark World (2013), Calvary (2014) and St. Vincent (2014). He made his Broadway debut in the play adaptation of Of Mice and Men in 2014, for which he was nominated for a Tony Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MTQwNzk5NF5BMl5BanBnXkFtZTgwOTgzMDEwMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1483369","name":"Chris O'Dowd","idIMDB":"nm1483369"},"actorId":"nm1483369","character":"Jack Brennan","urlCharacter":"http://www.imdb.com/character/ch0461265","main":true},{"actorName":"Kelly Reilly","urlProfile":"http://www.imdb.com/name/nm0717709","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjgzMzk2MjEzM15BMl5BanBnXkFtZTgwMTkzMDEwMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1977","placeOfBirth":" Surrey, England, UK","birthName":"Jessica Kelly Siobhán Reilly","height":"5' 6\" (1.68 m)","bio":"Kelly Reilly was born on July 18, 1977 in Surrey, England as Jessica Kelly Siobhán Reilly. She is an actress and producer, known for Sherlock Holmes (2009), Flight (2012) and Eden Lake (2008). She has been married to Kyle Baugher since 2012.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjgzMzk2MjEzM15BMl5BanBnXkFtZTgwMTkzMDEwMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0717709","name":"Kelly Reilly","idIMDB":"nm0717709"},"actorId":"nm0717709","character":"Fiona Lavelle","urlCharacter":"http://www.imdb.com/character/ch0440132","main":true},{"actorName":"Aidan Gillen","urlProfile":"http://www.imdb.com/name/nm0318821","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwNzE4MzMxNl5BMl5BanBnXkFtZTgwOTYwMTEyMDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1968","placeOfBirth":" Dublin, Ireland","birthName":"Aidan Murphy","height":"5' 9\" (1.75 m)","bio":"Aidan Gillen is an Irish actor. He is best known for portraying Petyr \"Littlefinger\" Baelish in the HBO series Game of Thrones (2011), CIA operative Bill Wilson in The Dark Knight Rises (2012), Stuart Alan Jones in the Channel 4 series Queer as Folk (2000), John Boy in the RTÉ Television series Love/Hate (2010), and Tommy Carcetti in the HBO series The Wire (2002). In 2011, Gillen began playing Petyr \"Littlefinger\" Baelish on the HBO series Game of Thrones (2011), for which he received his second Irish Film & Television Award nomination. In 2015 he starred in Maze Runner: The Scorch Trials (2015) the second film in the Maze Runner trilogy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwNzE4MzMxNl5BMl5BanBnXkFtZTgwOTYwMTEyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0318821","name":"Aidan Gillen","idIMDB":"nm0318821"},"actorId":"nm0318821","character":"Dr. Frank Harte","urlCharacter":"http://www.imdb.com/character/ch0468260","main":true},{"actorName":"Dylan Moran","urlProfile":"http://www.imdb.com/name/nm0602836","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMjM2Mjk1MF5BMl5BanBnXkFtZTYwOTIwMzE3._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1971","placeOfBirth":" Navan, Co. Meath, Ireland","height":"5' 11\" (1.8 m)","bio":"Irish comedian Dylan Moran was born in Navan, County Meath in 1971. Leaving school without any qualifications at age 16, Moran quickly became attracted to stand-up comedy and debuted, in 1992, at a comedy club in Dublin, The Comedy Cellar. A year later, he won the Channel Four comedy newcomer's \"So You Think You're Funny\" award at the Edinburgh Festival, and began developing his comedy routines into a one-man show, \"Gurgling for Money\", for which he won the prestigious Perrier Comedy Award in 1996, and which he subsequently took to a nationwide tour of the UK. His exposure at the Edinburgh Festival also led to him getting programmed at international stand-up comedy festivals, worldwide. Subsequently, Moran took to writing and performing for British television. He has starred in the BBC sitcom, How Do You Want Me? (1998), and - more importantly - in 2000, he was commissioned by Channel Four for the sitcom, Black Books (2000). He wrote and starred in three 6-episode series of this comedy. Co-starring popular British stand-up comedian Bill Bailey, who was nominated for the Perrier Award the year Moran won, Black Books (2000) sees Moran play a character close to his stand-up comedy persona: an unsociable misanthrope, reminiscent of the John Cleese sitcom character, \"Basil Fawlty\", that shares a great love of wine with one of razor-sharp put-downs of all things human. Also, his character Bernard Black's often surreal views on everyday things and on human behavior is close to his stand-up persona's dealing with them. The same year the first series of \"Black Books\" aired, Moran took his one-man show, \"Ready, Steady, Cough\", on a UK tour, followed two years later by Dylan Moran: Monster (2004). This was followed by Monster II in 2004. In the late 1990's, Moran also moved from doing stand-up to working on a film acting CV. He played opposite Julia Roberts and Hugh Grant in Notting Hill (1999), co-starred with Michael Caine in The Actors (2003) and had parts in the Simon Pegg comedy, Shaun of the Dead (2004) and the Michael Winterbottom film, Tristram Shandy: A Cock and Bull Story (2005). Moran's live stand-up comedy is unique in that it merges two strands of stand-up that seemed incompatible for a long time: sharp observational humor, and surreal and fantastical language-based absurdity. On the one hand, he has a clear influence from what could be called an American school of stand-up comedy that is heavily observational. On the other hand, Moran's comedy is characterized by a use of language similar to the stand-up comedy of Eddie Izzard and Ross Noble: surreal associative leaps between on the one side observations and on the other fantasies, verbally painting bizarre and absurd worlds, often through a use of stream-of-consciousness narration. His language is often highly poetic, resembling a James Joyce that has had one too many. Moran is very reluctant to give interviews on his personal life and even on his career, a fact parodied in a staged interview inter-cut with the recording of his live stand-up show, \"Monster\", on its DVD release.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMjM2Mjk1MF5BMl5BanBnXkFtZTYwOTIwMzE3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0602836","name":"Dylan Moran","idIMDB":"nm0602836"},"actorId":"nm0602836","character":"Michael Fitzgerald","urlCharacter":"http://www.imdb.com/character/ch0486596","main":true},{"actorName":"Isaach De Bankolé","urlProfile":"http://www.imdb.com/name/nm0207218","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MzE3OTgxMV5BMl5BanBnXkFtZTcwMzA4NTAzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 August 1957","placeOfBirth":" Abidjan, Ivory Coast","height":"5' 9\" (1.75 m)","bio":"Isaach De Bankole, C'sar award-winning actor, was born on the Ivory Coast. Isaach was discovered on the streets of Paris while studying to be an airline pilot. He has a degree in Acting from Cours Simon and a Masters in Mathematics from the Universite de Paris.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MzE3OTgxMV5BMl5BanBnXkFtZTcwMzA4NTAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0207218","name":"Isaach De Bankolé","idIMDB":"nm0207218"},"actorId":"nm0207218","character":"Simon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"M. Emmet Walsh","urlProfile":"http://www.imdb.com/name/nm0001826","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNjgyNzgwMl5BMl5BanBnXkFtZTcwODA2MTM0OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1935","placeOfBirth":" Ogdensburg, New York, USA","birthName":"Michael Emmet Walsh","height":"5' 10\" (1.78 m)","bio":"Wonderfully talented, heavyset character actor (from New York, but regularly playing Southerners) M. Emmet Walsh has made a solid career of playing corrupt cops, deadly crooks, and zany comedic roles since the early 1970s. Michael Emmet Walsh was born in Ogdensburg, to Agnes Katharine (Sullivan) and Harry Maurice Walsh, a customs agent. He is of Irish descent. Walsh first appeared in a few fairly forgettable roles both on TV and onscreen before cropping up in several well remembered films, including a courtroom police officer in What's Up, Doc? (1972), as the weird Dickie Dunn in Slap Shot (1977), and as a loony sniper hunting Steve Martin in The Jerk (1979). On-screen demand heated up for him in the early 1980s with attention-grabbing work in key hits, including Brubaker (1980), Reds (1981), and as Harrison Ford's police chief in the futuristic thriller Blade Runner (1982). Walsh then turned in a stellar performance as the sleazy, double-crossing private detective in the Joel Cohen and Ethan Coen film noir Blood Simple. (1984), and showed up again for the Coens as a loud-mouthed sheet-metal worker bugging Nicolas Cage in the hilarious Raising Arizona (1987). As Walsh moved into his fifties and beyond, Hollywood continued to offer him plenty of work, and he has appeared in over 50 movies since passing the half-century mark. His consistent ability to turn out highly entertaining portrayals led film critic Roger Ebert to coin the \"Stanton-Walsh Rule,\" which states that any film starring Walsh or Harry Dean Stanton has to have some merit. And the \"M\" stands for Michael!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNjgyNzgwMl5BMl5BanBnXkFtZTcwODA2MTM0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001826","name":"M. Emmet Walsh","idIMDB":"nm0001826"},"actorId":"nm0001826","character":"The Writer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marie-Josée Croze","urlProfile":"http://www.imdb.com/name/nm0189887","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1ODcxNDg5OV5BMl5BanBnXkFtZTgwNTU0ODA4NDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 February 1970","placeOfBirth":" Montréal, Québec, Canada","height":"5' 6¼\" (1.68 m)","bio":"Marie-Josée Croze first studied fine arts before opting for the stage at La Veillée-Prospero Theatre workshop in Montreal. In 1993 she got her first movie part in La Florida (1993) and started working for numerous Canadian TV series and movies. In 2000, with her performance in Denis Villeneuve's Maelstrom (2000) she got national (Jutra and Genie best actress awards) and international recognition, and began shooting with some of the most acclaimed Canadian directors: Atom Egoyan for Ararat (2002) and Denys Arcand for The Barbarian Invasions (2003), for which she got the best actress award at the Cannes Film Festival in 2003. After the Cannes award many French directors used her incredible versatility: she played a mysterious and glamorous movie star in Ordo (2004), adapted from Donald E. Westlake's novel, a single mother overwhelmed by her responsibilities in Jean-Pierre Denis' drama La petite Chartreuse (2005), a down-to-earth architect in the romantic comedy Mensonges et trahisons et plus si affinités... (2004). Chosen by Steven Spielberg to play the seductive Dutch assassin in Munich (2005), Marie-Josée Croze is now associated with high profile projects. She will be in 2006 the mother of the young and rebellious peasant from Eugène Le Roy's novel in the historical drama Jacquou le croquant (2007); and Dr. Beck's murdered wife in Tell No One (2006), the French adaptation of Harlan Coben's novel.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1ODcxNDg5OV5BMl5BanBnXkFtZTgwNTU0ODA4NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0189887","name":"Marie-Josée Croze","idIMDB":"nm0189887"},"actorId":"nm0189887","character":"Teresa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Domhnall Gleeson","urlProfile":"http://www.imdb.com/name/nm1727304","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MjI0MzY2MF5BMl5BanBnXkFtZTcwMzM3ODM3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1983","placeOfBirth":" Dublin, Ireland","height":"6' 1\" (1.85 m)","bio":"Domhnall Gleeson was born on May 12, 1983 in Dublin, Ireland. He is an actor and writer, known for Ex Machina (2014), The Revenant (2015) and About Time (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MjI0MzY2MF5BMl5BanBnXkFtZTcwMzM3ODM3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1727304","name":"Domhnall Gleeson","idIMDB":"nm1727304"},"actorId":"nm1727304","character":"Freddie Joyce","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Wilmot","urlProfile":"http://www.imdb.com/name/nm0932837","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4OTQxMjQ1Nl5BMl5BanBnXkFtZTcwNDQ4NDAyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"David Wilmot is an actor, known for Calvary (2014), King Arthur (2004) and Six Shooter (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4OTQxMjQ1Nl5BMl5BanBnXkFtZTcwNDQ4NDAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0932837","name":"David Wilmot","idIMDB":"nm0932837"},"actorId":"nm0932837","character":"Father Leary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pat Shortt","urlProfile":"http://www.imdb.com/name/nm0795169","urlPhoto":"","biography":{"dateOfBirth":"12 December 1966","placeOfBirth":" Co. Tipperary, Ireland","birthName":"Patrick Shortt","bio":"Pat Shortt was born on December 12, 1966 in Co. Tipperary, Ireland as Patrick Shortt. He is an actor and writer, known for Le chant de la mer (2014), Garage (2007) and Calvary (2014). He is married to Caroline Shortt. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0795169","name":"Pat Shortt","idIMDB":"nm0795169"},"actorId":"nm0795169","character":"Brendan Lynch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Lydon","urlProfile":"http://www.imdb.com/name/nm0527994","urlPhoto":"","biography":{"dateOfBirth":"11 September 1964","placeOfBirth":" London, England, UK","birthName":"Gary O'Brien","bio":"Gary was born in London, but moved to his father's hometown Wexford in the Republic of Ireland. After leaving school he joined Wexford Theatre Co-op, performing in plays by Sam Sheperd, Dario Fo and Joe Orton. During this time he began a collaboration with the Wexford writer, making his London debut in 1988 playing Jimmy Brady in A Handful of Stars (1993), and went on to perform in Billy Roche's Wexford Trilogy on stage and television.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0527994","name":"Gary Lydon","idIMDB":"nm0527994"},"actorId":"nm0527994","character":"Inspector Stanton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Killian Scott","urlProfile":"http://www.imdb.com/name/nm2832424","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NDAxNzA1MF5BMl5BanBnXkFtZTgwMTQ3MTk5ODE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Killian Scott is an actor and writer, known for Calvary (2014), Traders (2015) and '71 (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NDAxNzA1MF5BMl5BanBnXkFtZTgwMTQ3MTk5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2832424","name":"Killian Scott","idIMDB":"nm2832424"},"actorId":"nm2832424","character":"Milo Herlihy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Orla O'Rourke","urlProfile":"http://www.imdb.com/name/nm1365326","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNjc3NzQwMl5BMl5BanBnXkFtZTgwMzEzMjAxNzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Orla was born in Zambia to Irish parents and at the age of 5 moved back to Ireland where her mother made sure she did every conceivable activity from studying three instruments to ballet and gymnastics. At 13 she discovered drama school and at 16 performed in her first professional theatre performance 'Adult Child/ Dead Child'. After school, extensive traveling and minor acting roles Orla undertook a degree in film & broadcasting. During her studies she gained her first regular role as Sinead Kelly in the award winning television show 'The Clinic'. Shortly after she worked on ITVs 'Malice Aforethought' for director David Blair and her first Irish feature film 'The Front Line' for director David Gleeson. Soon after graduating she worked on British medical drama 'Casualty' and Daniel Barbers 'Harry Brown', with Michael Caine, Emily Mortimer and Charlie Creed-Miles. Her most recent work includes 'Case Histories' for BBC 1 with Jason Isaacs and HBO/SKYs 'Strike Back II' with Liam Cunningham. Orla believes that versatility is a necessity for an actor. 'You can train all you want but experience in different areas of work and life keeps your mind educated and active. It provides you with the necessary life resources to dip into. An actor can have a lot of spare time to kill ...so use it'","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNjc3NzQwMl5BMl5BanBnXkFtZTgwMzEzMjAxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1365326","name":"Orla O'Rourke","idIMDB":"nm1365326"},"actorId":"nm1365326","character":"Veronica Brennan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Owen Sharpe","urlProfile":"http://www.imdb.com/name/nm0789261","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMDE0Mzc1OF5BMl5BanBnXkFtZTgwNTIwNDE4MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Owen Sharpe is an actor, known for L'Irlandais (2011), Calvary (2014) and Borstal Boy (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMDE0Mzc1OF5BMl5BanBnXkFtZTgwNTIwNDE4MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0789261","name":"Owen Sharpe","idIMDB":"nm0789261"},"actorId":"nm0789261","character":"Leo","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2234003","urlIMDB":"http://www.imdb.com/title/tt2234003","business":{"budget":null,"openingWeekend":[{"money":"$74,149","country":"USA","day":"03","month":"08","year":"2014","remarks":"4 Screens"},{"money":"$956,273","country":"UK","day":"11","month":"04","year":"2014","remarks":"150 Screens"}],"gross":[{"money":"$3,541,350","country":"USA","day":"28","month":"09","year":"2014","remarks":""},{"money":"$74,149","country":"USA","day":"03","month":"08","year":"2014","remarks":""}],"weekendGross":[{"money":"$18,665","country":"USA","day":"28","month":"09","year":"2014","remarks":"34 Screens"},{"money":"$74,149","country":"USA","day":"03","month":"08","year":"2014","remarks":"4 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"31","month":"10","year":"2012","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 42 min (102 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Screen Scene (rushes)"],"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.4","metascore":"77","filmingLocations":[{"location":"Rush, County Dublin, Ireland"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best International Film","names":[]}]}]},{"award":"ASCAP Film and Television Music Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated ASCAP Award","categories":[{"category":"Best Film Score","names":[{"name":"Patrick Cassidy","id":"nm0144234","role":null}]}]}]},{"award":"Berlin International Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Won Prize of the Ecumenical Jury","categories":[{"category":"Panorama","names":[{"name":"John Michael McDonagh","id":"nm0567620","role":null}]}]}]},{"award":"Boston Online Film Critics Association 2014","titlesAwards":[{"titleAwardOutcome":"Won BOFCA Award","categories":[{"category":"Best Actor","names":[{"name":"Brendan Gleeson","id":"nm0322407","role":null}]},{"category":"Best Screenplay","names":[{"name":"John Michael McDonagh","id":"nm0567620","role":null}]},{"category":"Ten Best Films of the Year","names":[]}]}]},{"award":"British Independent Film Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won British Independent Film Award","categories":[{"category":"Best Actor","names":[{"name":"Brendan Gleeson","id":"nm0322407","role":null}]}]},{"titleAwardOutcome":"Nominated British Independent Film Award","categories":[{"category":"Best British Independent Film","names":[]},{"category":"Best Director","names":[{"name":"John Michael McDonagh","id":"nm0567620","role":null}]},{"category":"Best Screenplay","names":[{"name":"John Michael McDonagh","id":"nm0567620","role":null}]}]}]},{"award":"Chicago Film Critics Association Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated CFCA Award","categories":[{"category":"Best Original Screenplay","names":[{"name":"John Michael McDonagh","id":"nm0567620","role":null}]}]}]},{"award":"Detroit Film Critic Society, US 2014","titlesAwards":[{"titleAwardOutcome":"Nominated DFCS Award","categories":[{"category":"Best Actor","names":[{"name":"Brendan Gleeson","id":"nm0322407","role":null}]},{"category":"Best Screenplay","names":[{"name":"John Michael McDonagh","id":"nm0567620","role":null}]}]}]},{"award":"European Film Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated European Film Award","categories":[{"category":"European Actor","names":[{"name":"Brendan Gleeson","id":"nm0322407","role":null}]}]}]},{"award":"Georgia Film Critics Association (GFCA) 2015","titlesAwards":[{"titleAwardOutcome":"Nominated GFCA Award","categories":[{"category":"Best Original Screenplay","names":[{"name":"John Michael McDonagh","id":"nm0567620","role":null}]}]}]},{"award":"Indiewire Critics' Poll 2014","titlesAwards":[{"titleAwardOutcome":"Nominated ICP Award","categories":[{"category":"Best Screenplay","names":[{"name":"John Michael McDonagh","id":"nm0567620","role":null}]}]}]},{"award":"International Online Film Critics' Poll 2015","titlesAwards":[{"titleAwardOutcome":"Nominated IOFCP Award","categories":[{"category":"Best Original Screenplay","names":[{"name":"John Michael McDonagh","id":"nm0567620","role":null}]}]}]},{"award":"Irish Film and Television Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won IFTA Award","categories":[{"category":"Best Lead Actor - Film","names":[{"name":"Brendan Gleeson","id":"nm0322407","role":null}]},{"category":"Best Film","names":[]},{"category":"Best Screenplay - Film","names":[{"name":"John Michael McDonagh","id":"nm0567620","role":null}]}]},{"titleAwardOutcome":"Nominated IFTA Award","categories":[{"category":"Best Director - Film","names":[{"name":"John Michael McDonagh","id":"nm0567620","role":null}]},{"category":"Best Supporting Actress - Film","names":[{"name":"Orla O'Rourke","id":"nm1365326","role":null}]},{"category":"Best Original Score","names":[{"name":"Patrick Cassidy","id":"nm0144234","role":"composer"},{"name":"Reprisal Films","id":null,"role":"production company"}]}]}]},{"award":"North Carolina Film Critics Association 2015","titlesAwards":[{"titleAwardOutcome":"Nominated NCFCA Award","categories":[{"category":"Best Original Screenplay","names":[{"name":"John Michael McDonagh","id":"nm0567620","role":null}]},{"category":"Best Narrative Film","names":[]},{"category":"Best Actor","names":[{"name":"Brendan Gleeson","id":"nm0322407","role":null}]}]}]},{"award":"Online Film Critics Society Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated OFCS Award","categories":[{"category":"Best Actor","names":[{"name":"Brendan Gleeson","id":"nm0322407","role":null}]}]}]},{"award":"Phoenix Film Critics Society Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated PFCS Award","categories":[{"category":"Best Actor in a Leading Role","names":[{"name":"Brendan Gleeson","id":"nm0322407","role":null}]},{"category":"Overlooked Film of the Year","names":[]}]}]},{"award":"San Diego Film Critics Society Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated SDFCS Award","categories":[{"category":"Best Actor","names":[{"name":"Brendan Gleeson","id":"nm0322407","role":null}]}]}]},{"award":"St. Louis Film Critics Association, US 2014","titlesAwards":[{"titleAwardOutcome":"Nominated SLFCA Award","categories":[{"category":"Best Artistic/Creative Film (for excellence in art-house cinema)","names":[]}]}]},{"award":"Transilvania International Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Won FIPRESCI Prize","categories":[{"category":"","names":[{"name":"John Michael McDonagh","id":"nm0567620","role":null}]}]}]},{"award":"Village Voice Film Poll 2014","titlesAwards":[{"titleAwardOutcome":"Nominated VVFP Award","categories":[{"category":"Best Screenplay","names":[{"name":"John Michael McDonagh","id":"nm0567620","role":null}]},{"category":"Best Actor","names":[{"name":"Brendan Gleeson","id":"nm0322407","role":null}]}]}]},{"award":"World Soundtrack Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Public Choice Award","categories":[{"category":"","names":[{"name":"Patrick Cassidy","id":"nm0144234","role":null}]}]},{"titleAwardOutcome":"Nominated World Soundtrack Award","categories":[{"category":"Discovery of the Year","names":[{"name":"Patrick Cassidy","id":"nm0144234","role":null}]}]}]}],"votes":"45,188","type":"Movie","companyCreditsSimple":[{"idCompany":"co0028932","name":"Fox Searchlight Pictures"},{"idCompany":"co0316354","name":"Bord Scannan na hEireann / Irish Film Board"},{"idCompany":"co0438151","name":"BFI"}],"keywords":{"keywords":["priest","death threat","confessional","catholic church","death","infidelity","priest's daughter","recovering alcoholic","murder","church","ireland","small town","catholic","gun","reference to moby dick","reference to jesus","child sexual abuse","child abuse","child molestation","catholic priest","killing a dog","throwing a gun into water","murder of a priest","shot in the head","church on fire","fire","suicide attempt","father daughter relationship","death of pet","arson","beach","dancing","dog","old man","urinating on a painting","urination","child's painting","painting","altar boy","black man","sea","hospital","disillusionment","bar","romanian","one word title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:20:13"}}