{"data":{"movies":[{"title":"Spider-Man: Homecoming","originalTitle":"","year":"2017","releaseDate":"20170707","directors":[{"name":"Jon Watts","id":"nm1218281"}],"writers":[{"name":"Jonathan Goldstein","id":"nm0326246"},{"name":"John Francis Daley","id":"nm0197855"}],"urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk4ODQ1MzgzNl5BMl5BanBnXkFtZTgwMTMyMzM4MTI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Sci-Fi"],"plot":"A young Peter Parker/Spider-Man, who made his sensational debut in Captain America: Civil War, begins to navigate his newfound identity as the web-slinging superhero in Spider-Man: Homecoming. Thrilled by his experience with the Avengers, Peter returns home, where he lives with his Aunt May, under the watchful eye of his new mentor Tony Stark, Peter tries to fall back into his normal daily routine - distracted by thoughts of proving himself to be more than just your freindly neighborhood Spider-Man - but when the Vulture emerges as a new villain, everything that Peter holds most important will be threatened.","simplePlot":"Following the events of (2016), Peter Parker attempts to balance his life in high school with his career as the web-slinging superhero Spider-Man.","actors":[{"actorName":"Robert Downey Jr.","urlProfile":"http://www.imdb.com/name/nm0000375","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1965","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Robert John Downey Jr","height":"5' 8½\" (1.74 m)","bio":"Robert Downey Jr. has evolved into one of the most respected actors in Hollywood. With an amazing list of credits to his name, he has managed to stay new and fresh even after over four decades in the business. Downey was born April 4, 1965 in Manhattan, New York, the son of writer, director and filmographer Robert Downey Sr. and actress Elsie Downey (née Elsie Ann Ford). Robert's father is of half Lithuanian Jewish, one quarter Hungarian Jewish, and one quarter Irish, descent, while Robert's mother was of English, Scottish, German, and Swiss-German ancestry. Robert and his sister, Allyson Downey, were immersed in film and the performing arts from a very young age, leading Downey Jr. to study at the Stagedoor Manor Performing Arts Training Center in upstate New York, before moving to California with his father following his parents' 1978 divorce. In 1982, he dropped out of Santa Monica High School to pursue acting full time. Downey Sr., himself a drug addict, exposed his son to drugs at a very early age, and Downey Jr. would go on to struggle with abuse for decades. Downey Jr. made his debut as an actor at the age of five in the film Pound (1970), written and directed by his father, Robert Downey Sr.. He built his film repertoire throughout the 1980s and 1990s with roles in Tuff Turf (1985), Weird Science (1985), True Believer (1989), and Wonder Boys (2000) among many others. In 1992, Downey received an Academy Award nomination and won the BAFTA (British Academy Award) for Best Actor for his performance in the title role of Chaplin (1992). In Robert Altman's Short Cuts (1993), he appeared as an aspiring film make-up artist whose best friend commits murder. In Oliver Stone's Natural Born Killers (1994), with Woody Harrelson and Juliette Lewis, Downey starred as a tabloid TV journalist who exploits a murderous couple's killing spree to boost his ratings. For the comedy Heart and Souls (1993), Downey starred as a young man with a special relationship with four ghosts. In 1995, Downey starred in Restoration (1995), with Hugh Grant, Meg Ryan and Ian McKellen, directed by Michael Hoffman. Also that year, he starred in Richard III (1995), in which he appears opposite his Restoration (1995) co-star McKellen. In 1997, Downey was seen in Robert Altman's The Gingerbread Man (1998), alongside Kenneth Branagh, Daryl Hannah and Embeth Davidtz; in One Night Stand (1997), directed by Mike Figgis and starring Wesley Snipes and Nastassja Kinski; and in Hugo Pool (1997), directed by his father, Robert Downey Sr. and starring Sean Penn and Patrick Dempsey. In September of 1999, Downey appeared in Black & White (1999), written and directed by James Toback, along with Ben Stiller, Elijah Wood, Gaby Hoffmann, Brooke Shields and Claudia Schiffer. In January of 1999, he starred with Annette Bening and Aidan Quinn in In Dreams (1999), directed by Neil Jordan. In 2000, Downey co-starred with Michael Douglas and Tobey Maguire in Wonder Boys (2000), directed by Curtis Hanson. In this dramatic comedy, Downey played the role of a bisexual literary agent. In 2001, Downey made his prime-time television debut when he joined the cast of the Fox-TV series Ally McBeal (1997) as attorney \"Larry Paul\". For this role, he won the Golden Globe Award for Best Performance by an Actor in a Supporting Role in a Series, Mini-Series or Motion Picture Made for Television, as well as the Screen Actors Guild Award for Outstanding Performance by a Male in a Comedy Series. In addition, Downey was nominated for an Emmy for Outstanding Supporting Actor in a Comedy Series. The actor's drug-related problems escalated from 1996 to 2001, leading to arrests, rehab visits and incarcerations, and he was eventually fired from Ally McBeal (1997). Emerging clean and sober in 2003, Downey Jr. began to rebuild his career. He marked his debut into music with his debut album, titled \"The Futurist\", on the Sony Classics Label on November 23rd, 2004. The album's eight original songs, that Downey wrote, and his two musical numbers debuting as cover songs revealed his sultry singing voice and his musical talents. Downey displayed his versatility in two different films in October 2003: the musical/drama The Singing Detective (2003), a remake of the BBC hit of the same name, and the thriller Gothika (2003) starring Halle Berry and Penélope Cruz. Downey starred in powerful yet humbling roles inspired by real-life accounts of some of history's most precious kept secrets, including Richard Linklater's A Scanner Darkly (2006) in 2006 co-starring Keanu Reeves, Winona Ryder and Woody Harrelson, and Fur: An Imaginary Portrait of Diane Arbus (2006) co-starring Nicole Kidman, a film inspired by the life of Diane Arbus, the revered photographer whose images captured attention in the early 1960s. These roles exhibited Downey's momentum from the previous year of 2005, in which he starred in the Academy Award®-nominated feature film Good Night, and Good Luck. (2005), directed by George Clooney and in Shane Black's action comedy Kiss Kiss Bang Bang (2005) co-starring Val Kilmer. In 2007, he co-starred in David Fincher's suspenseful _Zodiac (2007/I)_ alongside Jake Gyllenhaal and Mark Ruffalo, about the notorious serial killer who haunted San Francisco during the 1970s. In May 2008, Downey achieved critical acclaim and worldwide box office success for his starring role in Iron Man (2008), Jon Favreau's big-screen rendering of the Marvel comic book superhero. The film co-starred Gwyneth Paltrow, Jeff Bridges and Terrence Howard. In August of 2008, Downey starred with Ben Stiller and Jack Black in the comedy Tropic Thunder (2008), and went on to receive an Academy Award®-nomination for Best Supporting Actor for his, Kirk Lazarus. In December 2009, Downey starred in the action-adventure Sherlock Holmes (2009). The film, directed by Guy Ritchie, co-starred Jude Law and Rachel McAdams and earned Downey a Golden Globe for Best Performance by an Actor in a Motion Picture - Comedy or Musical in January of 2010. In early Summer 2010, Downey re-teamed with director Jon Favreau and reprised his role as \"Tony Stark/Iron Man\" in the hugely successful sequel to the original film, Iron Man 2 (2010), starring Gwyneth Paltrow, Scarlett Johansson, Samuel L. Jackson and Mickey Rourke. Downey next starred in Due Date (2010), a comedy directed by Todd Phillips, in which he plays the role of an expectant father on a road trip racing to get back in time for the birth of his first child. Due Date (2010), starring The Hangover (2009)'s Zach Galifianakis, was released in November 2010. Downey was honored by Time Magazine's \"Time 100\" in 2008, an annual list of the 100 most influential people in the world. His laurels include two Academy Award nominations, three Golden Globe wins, numerous other award nominations and wins, and tremendous popular and commercial success, particularly in his roles as Sherlock Holmes and Tony Stark (the latter of which he has so far played in Iron Man (2008), Iron Man 2 (2010), The Avengers (2012), Iron Man 3 (2013), and Avengers: Age of Ultron (2015). For three consecutive years, from 2012 to 2015, Downey has topped the Forbes list of Hollywood's highest-paid actors, making an estimated $80 million in earnings between June 2014 and June 2015. In 2005, Downey Jr. married Susan Downey, who gave birth to their son, Exton Elias Downey, on February 7, 2012. Downey also has another son, Indio Falconer Downey, born September 7, 1993, from his first marriage to Deborah Falconer, from whom he was officially divorced in 2004. Robert has jump-started the Team Downey Production Company with wife Susan Downey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000375","name":"Robert Downey Jr.","nicknames":["Bob","RDJ"],"idIMDB":"nm0000375"},"actorId":"nm0000375","character":"Tony Stark / Iron Man","urlCharacter":"http://www.imdb.com/character/ch0556868","main":true},{"actorName":"Tom Holland","urlProfile":"http://www.imdb.com/name/nm4043618","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5NzY1NzUzNzJeQTJeQWpwZ15BbWU4MDczMDcyMzgx._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1996","placeOfBirth":" Kingston upon Thames, England, UK","birthName":"Thomas Stanley Holland","height":"5' 8\" (1.73 m)","bio":"Thomas Stanley Holland was born in Kingston-upon-Thames, Surrey, to Nicola Elizabeth (Frost), a photographer, and Dominic Holland (Dominic Anthony Holland), who is a comedian and author. His paternal grandparents were from the Isle of Man and Ireland, respectively. He lives with his parents and three younger brothers - Paddy and twins Sam and Harry. Tom attended Donhead Prep School. Then, after a successful eleven plus exam, he became a pupil at Wimbledon College. Having successfully completed his GCSEs, in September 2012 Tom started a two-year course in the BRIT School for Performing Arts & Technology notable for its numerous famous alumni. Holland began dancing at a hip hop class at Nifty Feet Dance School in Wimbledon, London. His potential was spotted by choreographer Lynne Page (who was an Associate to Peter Darling, choreographer of Billy Elliot and Billy Elliot the Musical) when he performed with his dance school as part of the Richmond Dance Festival 2006. After eight auditions and subsequent two years of training, on 28 June 2008 Tom made his West End debut in Billy Elliot the Musical as Michael, Billy's best friend. He gave his first performance in the title role of Billy on 8 September 2008 getting rave reviews praising his versatile acting and dancing skills. In September 2008 Tom (together with co-star Tanner Pflueger) appeared on the news programme on channel FIVE and gave his first TV interview. In 2009 Tom was featured on ITV1 show \"The Feel Good Factor\". At the launch show on 31 January he and two other Billy Elliots, Tanner Pflueger and Layton Williams, performed a specially choreographered version of Angry Dance from Billy Elliot the Musical, after which Tom was interviewed by host Myleene Klass. Then he became involved into training five ordinary British schoolboys learning to get fit and preparing their dance routine (fronted by Tom) for the final \"The Feel Good Factor\" show on 28 March 2009. On 11 March 2010 Tom Holland along with fellow Billy Elliots Dean-Charles Chapman and Fox Jackson-Keen appeared on The Alan Titchmarsh Show on ITV1. On 8 March 2010, to mark the fifth anniversary of Billy Elliot the Musical, four current Billy Elliots, including Tom Holland, were invited to 10 Downing Street to meet the Prime Minister Gordon Brown. It was Tom Holland who was chosen to be a lead at the special fifth anniversary show on 31 March 2010. Elton John, Billy Elliot the Musical composer, who was at the audience, called Tom's performance \"astonishing\" and said that he was \"blown away\" by it. Holland had been appearing on a regular basis as Billy in Billy Elliot the Musical rotating with three other performers till 29 May 2010 when he finished his run in the musical. In two months after leaving Billy Elliot the Musical, Holland successfully auditioned for a starring role in the film The Impossible[18] (directed by Juan Antonio Bayona) alongside Naomi Watts and Ewan McGregor. The Impossible was based on a true story that took place during the 2004 Indian Ocean earthquake. The film premiered at the Toronto International Film Festival on September 9, 2012, and was released in Europe in October 2012, and in North America in December 2012. Tom has received universal praise for his performance, in particular: \"What a debut, too, from Tom Holland as the eldest of their three lads\" (The Telegraph); \"Tom Holland, making one of the finest feature debuts in years\" (HeyUGuys); \"the excellent Tom Holland\" (The Guardian); \"The child performers are uncanny and there is an especially terrific performance from Tom Holland as the resourceful, levelheaded Lucas terrified but tenacious in the face of an unspeakable ordeal\" (Screen Daily); \"Young Holland in particular is astonishingly good as the terrified but courageous Lucas.\" (The Hollywood Reporter); \"However, the real acting standout in The Impossible is the performance of Tom Holland as the eldest son Lucas. His portrayal is genuine, and at no moment does it feel melodramatic and forced. The majority of his scenes are separate from the lead actors and for the most part it feels like The Impossible is Holland's film\" (Entertainment Maven); \"Mr. Holland, meanwhile, matures before our eyes, navigating the passage from adolescent self-absorption to profound and terrible responsibility. He is a terrific young actor\" (New York Times). Tom has given a number of interviews about his role in The Impossible. In particular, he talked on video to Vanity Fair Senior West Coast editor Krista Smith and with IAMROGUE's Managing Editor Jami Philbrick. He has also given interviews to The Hollywood Reporter,[32] to the MovieWeb, to Today Show on NBC and to other outlets. Tom's director and co-stars have also talked about him. Juan Antonio Bayona: \"He had this extraordinary ability to get into the emotion and portray it in a very, very easy way. The best I'd ever seen in a kid.\" Ewan McGregor: \"It was wonderful watching Tom who had never worked in front of a camera before, to see him really get it and grow as a film actor as he went along. He's really talented and polite to everyone. It's very easy for children to lose perspective but he's absolutely on the right road and a brilliant actor.\" Naomi Watts: \"He has an incredible emotional instrument and an unbelievable sense of himself... Tom Holland and I had a couple of moments where we came together and I could just tell how wonderful he was and what a beautiful instrument he had. It was just easy to work with him, that was one of the greatest highlights for me: discovering a friendship with Tom off-screen and this beautiful relationship between mother and son on-screen. The intimacy that develops through the course of the film between Lucas and Maria, I just loved that relationship. I mean, Tom is a beyond gifted actor. He's just a raw, open talent that is just so easy to work with. And Tom, he's inspiring, he kind of lifts everyone's game around him because he can do nothing but tell the truth. He was great.\" In his turn, Tom Holland has returned favours to Naomi Watts when he was asked to present Desert Palm Achievement Award to her at Palm Springs International Film Festival. According to HitFix: \"One recurring theme of the night was how the introductions were often better than actual winner's speeches... The best intro, however, had to go to 16-year-old Tom Holland who intro'd his \"Impossible\" co-star Watts. Holland admitted of all of Watts' great performances his dad had only let him see \"King Kong\" and while they spent six weeks shooting in a water tank he didn't know it was \"difficult\" because he actually \"loved it\"... Most important, this was Holland's first film role and he sweetly noted, \"From the moment I met you, you took my hand and you never let go.\" Cue the \"awwww\" from the audience.\" The presentation is available on video. In 2011, Holland was cast in British version of the animation film Arrietty, produced by Japan's cult Studio Ghibli. He has provided voice over for the principal character Sho. In 2012 Tom Holland played the starring role of Isaac in the film \"How I lived Now\"[44] (directed by Kevin Macdonald) alongside Saoirse Ronan. The film is due to be released in 2013. [edit]Awards, nominations and affiliations On 17 October 2012, Holland became a recipient of Hollywood Spotlight Award for his role in The Impossible. \"We are very excited that we will be able to recognize acting talents that are on the road to discovery and stardom,\" said Carlos de Abreu, founder and executive director of the Hollywood Film Awards in a statement. On 6 December 2012 it was announced that Holland became a winner of the National Board of Review award in the \"Breakthrough Actor\" category. In the end of December 2012, Holland was voted a winner for the year's Best Youth Performance in Nevada Critics Awards. In December 2012, Holland received a number of nominations (pending) for his role in The Impossible: for the 18th annual Critics' Choice Movie Awards, in the \"Best Young Acror/Acress\" category; for Chicago Film Critics Association Awards 2012 in the \"Most Promising Performer\" category; for the 27th Goya Awards in the \"Best New Actor\" category; for the Washington D.C. Area Film Critics Association Awards 2012 in the \"Best Youth Performance\" category; for the London Film Critics Circle Awards 2012 in the \"Young British Performer of the Year\" category. Kristopher Tapley, Editor-at-Large of HitFix, reported on 27 August 2012 that Summit Entertainment, the company responsible for distribution of The Impossible in USA, would be campaigning Holland rather than McGregor as the lead, and strongly argued that Tom Holland deserved to be nominated for an Academy Award in the Best Actor category. The fact of long-listing for an Academy Award was confirmed in the article in the Hollywood Reporter: \"And though McGregor stars as his father in the film, Holland has been submitted as the lead actor for awards consideration. Regardless if he receives any nominations, his performance as the strong-willed and determined eldest son is garnering critical acclaim.\" As one of the most promising young actors, Holland was featured in Screen International's \"UK Stars of Tomorrow - 2012\" and in Variety's \"Youth Impact Report 2012\". Holland has been signed up by William Morris Endeavor (WME) global talent agency and is represented by Curtis Brown literary and talent agency. In 2015, Tom was cast as Peter Parker/Spider-Man in Sony and Marvel's upcoming films. He will play the role starting with Captain America: Civil War (2016) and the Spider-Man: Homecoming (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5NzY1NzUzNzJeQTJeQWpwZ15BbWU4MDczMDcyMzgx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4043618","name":"Tom Holland","idIMDB":"nm4043618"},"actorId":"nm4043618","character":"Peter Parker / Spider-Man","urlCharacter":"http://www.imdb.com/character/ch0188706","main":true},{"actorName":"Marisa Tomei","urlProfile":"http://www.imdb.com/name/nm0000673","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMjA3OTc3N15BMl5BanBnXkFtZTcwNTA1MzY1Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1964","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"5' 4½\" (1.64 m)","bio":"Marisa Tomei was born on December 4, 1964, in Brooklyn, New York to mother Patricia \"Addie\" Tomei, an English teacher and father Gary Tomei, a lawyer. Marisa also has a brother, actor Adam Tomei. As a child, Marisa's mother frequently corrected her speech as to eliminate her heavy Brooklyn accent. As a teen, Marisa attended Edward R. Murrow High School and graduated in the class of 1982. She was one year into her college education at Boston University when she dropped out for a co-starring role on the CBS daytime drama As the World Turns (1956). Her role on that show paved the way for her entrance into film: in 1984, she made her film debut with a bit part in The Flamingo Kid (1984). Three years later, Marisa became known for her role as Maggie Lawton, Lisa Bonet's college roommate, on the sitcom A Different World (1987). Her real breakthrough came in 1992, when she co-starred as Joe Pesci's hilariously foul-mouthed, scene-stealing girlfriend in My Cousin Vinny (1992), a performance that won her a Best Supporting Actress Oscar. Later that year, she turned up briefly as a snippy Mabel Normand in director Richard Attenborough's biopic Chaplin (1992), and was soon given her first starring role in Untamed Heart (1993). A subsequent starring role -- and attempted makeover into Audrey Hepburn -- in the romantic comedy Only You (1994) proved only moderately successful. Marisa's other 1994 role as Michael Keaton's hugely pregnant wife in The Paper (1994) was well-received, although the film as a whole was not. Fortunately for Tomei, she was able to rebound the following year with a solid performance as a troubled single mother in Nick Cassavetes' Décroche les étoiles (1996) which earned her a Screen Actors Guild nomination for Best Supporting Actress. She turned in a similarly strong work in Welcome to Sarajevo (1997), and in 1998 did some of her best work in years as the sexually liberated, unhinged cousin of Natasha Lyonne's Vivian Abramowitz in Tamara Jenkins' Slums of Beverly Hills (1998). Marisa co-starred with Mel Gibson in the hugely successful romantic comedy What Women Want (2000) and during the 2002 movie award season, she proved her first Best Supporting Actress Oscar win was no fluke when she received her second nomination in the same category for the critically acclaimed dark drama, In the Bedroom (2001). She also made a guest appearance on the animated TV phenomenon The Simpsons (1989) as Sara Sloane, a movie star who falls in love with Ned Flanders. In 2006, she went on to do 4 episodes for Rescue Me (2004). She played Angie, the ex-wife of Tommy Calvin (Denis Leary)'s brother Johnny (Dean Winters). At age 42, Marisa took on a provocative role in legendary filmmaker Sidney Lumet's melodramatic picture Before the Devil Knows You're Dead (2007), in which she appeared nude in love scenes with costars Ethan Hawke and Philip Seymour Hoffman. Marisa then took on another provocative role as a stripper in the highly acclaimed film The Wrestler (2008) opposite Mickey Rourke. Her great performance earned her many awards from numerous film societies for Best Supporting Actress, a third Academy Award nomination, as well as nominations for a Golden Globe and a BAFTA. Many critics heralded this performance as a standout in her career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMjA3OTc3N15BMl5BanBnXkFtZTcwNTA1MzY1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000673","name":"Marisa Tomei","idIMDB":"nm0000673"},"actorId":"nm0000673","character":"Aunt May","urlCharacter":"http://www.imdb.com/character/ch0001361","main":true},{"actorName":"Donald Glover","urlProfile":"http://www.imdb.com/name/nm2255973","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzUxNTU5ODkxNl5BMl5BanBnXkFtZTgwOTIyNjc5MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1983","placeOfBirth":" Edwards Air Force Base, California, USA","birthName":"Donald McKinley Glover","height":"5' 9\" (1.75 m)","bio":"Donald McKinley Glover was born at the Edwards Air Force Base, California, and was raised in Stone Mountain, Georgia. His mother, Beverly (Smith), ran a daycare center, and his father, Donald Glover, was a postal worker. He is not, despite rumors, related to actor Danny Glover. Donald graduated from New York University with a degree in Dramatic Writing in 2006. Glover worked as a writer for the NBC comedy 30 Rock (2006), for which he also received a Writers Guild of America Award nomination in 2009. He is best known for his role as Troy on the comedy series Community (2009) in which he plays an athlete in a rather odd study group, opposite Chevy Chase and Joel McHale. Glover auditioned to play President Obama on Saturday Night Live in 2008, though he didn't get the role. His stand-up special aired on Comedy Central in March 2010.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzUxNTU5ODkxNl5BMl5BanBnXkFtZTgwOTIyNjc5MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2255973","name":"Donald Glover","idIMDB":"nm2255973"},"actorId":"nm2255973","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Martin Starr","urlProfile":"http://www.imdb.com/name/nm0771414","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM5NzY3NzAxMl5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1982","placeOfBirth":" Santa Monica, California, USA","height":"6' 1\" (1.85 m)","bio":"Martin Starr was born on July 30, 1982 in Santa Monica, California, USA. He is an actor, known for Knocked Up (2007), This Is the End (2013) and Superbad (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM5NzY3NzAxMl5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0771414","name":"Martin Starr","idIMDB":"nm0771414"},"actorId":"nm0771414","character":"Mr. Harrington","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Angourie Rice","urlProfile":"http://www.imdb.com/name/nm3886028","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzUzNzhkZjktYzczYS00MmFiLTgwMWUtYzdiNWVlNDNiN2FiXkEyXkFqcGdeQXVyMzI3NDI1MDU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 3\" (1.6 m)","bio":"From a creative family, Angourie began her career in Perth, Western Australia with several short films and national television commercials. She first came to industry attention with her work on Zak Hilditch's short film Transmission. Angourie travelled with the film to a number of festivals including the Tribeca Film Festival in New York and was awarded Best Actor at the St. Kilda Film Festival in 2012. Following a national search, Hilditch found he could not go past Angourie for the lead role in his follow-up feature film These Final Hours which was selected for inclusion in the Directors' Fortnight at the 2014 Cannes International Film Festival. Angourie can also be seen in the role of Jade in the BBC/20th Century Fox feature film Walking With Dinosaurs 3D. Other screen credits include Mako Mermaids, the Seven Network Pilot Hartman's Solution, The Dr Blake Mysteries (ABC), The Worst Year of My Life Again (ACTF) and several short films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzUzNzhkZjktYzczYS00MmFiLTgwMWUtYzdiNWVlNDNiN2FiXkEyXkFqcGdeQXVyMzI3NDI1MDU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3886028","name":"Angourie Rice","idIMDB":"nm3886028"},"actorId":"nm3886028","character":"Betty Brant","urlCharacter":"http://www.imdb.com/character/ch0001351","main":true},{"actorName":"Michael Keaton","urlProfile":"http://www.imdb.com/name/nm0000474","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTE2MzczOF5BMl5BanBnXkFtZTYwNTM4MjYz._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 September 1951","placeOfBirth":" Coraopolis, Pennsylvania, USA","birthName":"Michael John Douglas","height":"5' 9\" (1.75 m)","bio":"Quirky, inventive and handsome American actor Michael Keaton first achieved major fame with his door-busting performance as fast-talking ideas man Bill Blazejowski, alongside a nerdish morgue attendant (Henry Winkler), in Night Shift (1982). He played further comedic roles in Mr. Mom (1983), Johnny Dangerously (1984), and Beetlejuice (1988), earned further acclaim for his dramatic portrayal of Bruce Wayne / Batman in Tim Burton's Batman (1989) and Batman Returns (1992), and since then, has moved easily between film genres, ranging from drama and romantic comedy to thriller and action. Keaton was born Michael John Douglas on September 5, 1951 in Coraopolis, Pennsylvannia, to Leona Elizabeth (Loftus), a homemaker, and George A. Douglas, a civil engineer and surveyor. He is of Irish, as well as English, Scottish, and German, descent. Michael studied speech for two years at Kent State, before dropping out and moving to Pittsburgh. An unsuccessful attempt at stand-up comedy led Keaton to working as a TV cameraman in a cable station, and he came to realize he wanted to work in front of the cameras. Keaton first appeared on TV in several episodes of Mister Rogers' Neighborhood (1968). He left Pittsburgh and moved to Los Angeles to begin auditioning for TV. He began cropping up in popular TV shows including Maude (1972) and The Mary Tyler Moore Hour (1979). Around this time, Keaton decided to use an alternative surname to remove confusion with better-known actor Michael Douglas. After reading an article on actress Diane Keaton, he decided that Michael Keaton sounded good. His next break was scoring a co-starring role alongside Jim Belushi in the short-lived comedy series Working Stiffs (1979), which showcased his comedic talent and led to his co-starring role in Night Shift (1982). Keaton next scored the lead in the comedy hits Mr. Mom (1983), Johnny Dangerously (1984) , Gung Ho (1986), the Tim Burton horror-comedy Beetlejuice (1988), and The Dream Team (1989). Keaton's career was given another major boost when he was again cast by Tim Burton, this time as the title comic book superhero, millionaire playboy / crime-fighter Bruce Wayne, in Batman (1989). Burton cast him because he thought that Keaton was the only actor who could portray someone who has the kind of darkly obsessive personality that the character demands. To say there were howls of protest by fans of the caped crusader comic strip is an understatement! Warner Bros. was deluged with thousands of letters of complaint commenting that comedian Keaton was the wrong choice for the Caped Crusader, given his prior work and the fact that he lacked the suave, handsome features and tall, muscular physicality often attributed to the character in the comic books. However, their fears were proven wrong when Keaton turned in a sensational performance, and he held his own on screen with opponent Jack Nicholson, playing the lunatic villain, \"The Joker\". Keaton's dramatic work earned widespread acclaim from critics and audiences alike, and Batman (1989) became one of the most successful films of the year. Keaton remained active during the 1990s, appearing in a wide range of films. Keen to diversify his work, Keaton starred as a psychotic tenant in Pacific Heights (1990), as a hard-working cop in One Good Cop (1991), and then donned the black cape and cowl once more for Batman Returns (1992). He remained in demand during the 1990s, appearing in a wide range of films, including the star-studded Shakespearian Much Ado About Nothing (1993), the drama My Life (1993), another Ron Howard comedy The Paper (1994), with sexy Andie MacDowell in Multiplicity (1996), twice in the same role, dogged Elmore Leonard character Agent Ray Nicolette, in Jackie Brown (1997) and Out of Sight (1998). He also played a killer in the mediocre thriller Desperate Measures (1998). In the 2000s, Keaton appeared in several productions with mixed success, including Live from Baghdad (2002), First Daughter (2004), and Herbie Fully Loaded (2005). He also provided voices for characters in the animated films Cars (2006), Toy Story 3 (2010), and Minions (2015). He returned to major film roles in the 2010s, co-starring in The Other Guys (2010), RoboCop (2014) and Need for Speed (2014). Also that year, Keaton starred alongside Zach Galifianakis, Edward Norton, Emma Stone, and Naomi Watts in Birdman or (The Unexpected Virtue of Ignorance) (2014), a film by 21 Grams (2003) and Biutiful (2010) director Alejandro González Iñárritu. In the film, Keaton plays Riggan Thomson, a screen actor, famous for playing the iconic titular superhero, who puts on a Broadway play based on a Raymond Carver short story, to regain his former glory. Keaton's critically praised lead performance earned him a Golden Globe Award for Best Actor in a Musical or Comedy, the Critics' Choice Award for Best Actor and Best Actor in a Comedy, and nominations for the Screen Actors Guild Award, British Academy Film Award, and Academy Award for Best Actor. In 2015, he played a journalist in Spotlight (2015), which, like Birdman, won the Academy Award for Best Picture. In 2016, he starred as Ray Kroc, the developer of McDonald's, in the drama The Founder (2016). He is a visiting scholar at Carnegie Mellon University.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTE2MzczOF5BMl5BanBnXkFtZTYwNTM4MjYz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000474","name":"Michael Keaton","nicknames":["Michael Douglas"],"idIMDB":"nm0000474"},"actorId":"nm0000474","character":"Adrian Toomes / The Vulture","urlCharacter":"http://www.imdb.com/character/ch0304014","main":true},{"actorName":"Jon Favreau","urlProfile":"http://www.imdb.com/name/nm0269463","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzgwNDg0MTI1MF5BMl5BanBnXkFtZTcwNzg0MDQzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 October 1966","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Jonathan Kolia Favreau","height":"6' 1\" (1.85 m)","bio":"Initially an indie film favorite, actor Jon Favreau has progressed to strong mainstream visibility into the millennium and, after nearly two decades in the business, is still enjoying character stardom as well as earning notice as a writer/producer/director. The amiable, husky-framed actor with the tight, crinkly hair was born in Queens, New York on October 19, 1966, the only child of Madeleine, an elementary school teacher, and Charles Favreau, a special education teacher. His father has French-Canadian, German, and Italian ancestry, and his mother was from a Jewish family. He attended the Bronx High School of Science before furthering his studies at Queens College in 1984. Dropping out just credits away from receiving his degree, Jon moved to Chicago where he focused on comedy and performed at several Chicago improvisational theaters, including the ImprovOlympic and the Improv Institute. He also found a couple of bit parts in films. While there, he earned another bit role in the film, Rudy (1993), and met fellow castmate Vince Vaughn. Their enduring personal friendship would play an instrumental role in furthering both their professional careers within just a few years. Jon broke into TV with a role on the classic series, Seinfeld (1989) (as \"Eric the Clown\"). After filming rudimentary roles in the movies Mrs. Parker and the Vicious Circle (1994), Notes from Underground (1995) and Batman Forever (1995), he decided to do some risk taking by writing himself and friend Vaughn into what would become their breakthrough film. Swingers (1996), which he also co-produced, centers on Jon as a luckless, struggling actor type who is emotionally shattered after losing his girlfriend, but is pushed back into the L.A. social scene via the help of cool, worldly, outgoing actor/buddy Vaughn. These two blueprint roles went on to define the character types of both actors on film. In 1997, Jon appeared favorably on several episodes of the popular TV sitcom, Friends (1994), as \"Pete Becker\", the humdrum but extremely wealthy suitor for Courteney Cox's \"Monica\" character, and also appeared to fine advantage on the Tracey Takes On... (1996) comedy series. He later took on the biopic mini-movie, Rocky Marciano (1999), portraying the prizefighter himself in a highly challenging dramatic role and received excellent reviews. Other engagingly offbeat \"everyman\" films roles came Jon's way -- the ex-athlete in the working class film, Dogtown (1997); a soon-to-be groom whose bachelor party goes horribly awry in the comedy thriller Very Bad Things (1998); a newlywed opposite Famke Janssen in Love & Sex (2000); a wild and crazy linebacker in The Replacements (2000); as Ben Affleck's legal partner in Daredevil (2003); and another down-and-out actor in The Big Empty (2003). He wrote and directed himself and Vaughn as two fellow boxers who involve themselves in criminal activity in Made (2001). Both he and Vaughn produced. He also directed the highly popular Will Ferrell comedy, Elf (2003), in which he had a small part. Jon went on to re-team favorably with his friend, Vince Vaughn, who enjoyed a meteoric rise into the comedy star ranks, in such light-weight features as The Break-Up (2006), Tout... sauf en famille (2008) and Couples Retreat (2009), the last of which he co-wrote with Vaughn. He also made great strides as a producer/director in recent years with the exciting mega-box office action-packed Iron Man (2008), starring Robert Downey Jr. and its sequel, Iron Man 2 (2010). Favreau's marriage to Joya Tillem on November 24, 2000, produced son Max and two daughters, Madeleine and Brighton Rose. Joya is the niece of KGO (AM) lawyer and talk show host, Len Tillem. On the sly, the actor/writer/producer/director enjoys playing on the World Poker Tour.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzgwNDg0MTI1MF5BMl5BanBnXkFtZTcwNzg0MDQzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0269463","name":"Jon Favreau","nicknames":["Favs"],"idIMDB":"nm0269463"},"actorId":"nm0269463","character":"Happy Hogan","urlCharacter":"http://www.imdb.com/character/ch0036534","main":true},{"actorName":"Stan Lee","urlProfile":"http://www.imdb.com/name/nm0498278","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NDE3Njc5M15BMl5BanBnXkFtZTYwOTY5Nzc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1922","placeOfBirth":" New York City, New York, USA","birthName":"Stanley Martin Lieber","height":"5' 11\" (1.8 m)","bio":"Stan Lee was born on December 28, 1922 in New York City, New York, USA as Stanley Martin Lieber. He is a writer and producer, known for Iron Man (2008), Spider-Man (2002) and Iron Man 3 (2013). He has been married to Joan Lee since December 5, 1947. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NDE3Njc5M15BMl5BanBnXkFtZTYwOTY5Nzc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0498278","name":"Stan Lee","nicknames":["The Man","Generalissimo"],"idIMDB":"nm0498278"},"actorId":"nm0498278","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Logan Marshall-Green","urlProfile":"http://www.imdb.com/name/nm1334869","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNTY2OTI3MF5BMl5BanBnXkFtZTcwNDc1MTg4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 November 1976","placeOfBirth":" Charleston, South Carolina, USA","height":"5' 11\" (1.8 m)","bio":"Logan is a native of Charleston, South Carolina. His parents are both drama teachers. His mother, Lowry Marshall, is the artistic director of Brown University's repertory-theater department. Logan graduated with a Master's in Fine Arts from New York University's Graduate Acting Program at the Tisch School of the Arts. He made a few appearances in Law and Order, before landing recurring roles on The O.C. (2003) and 24 (2001). His breakthrough role came in Ridley Scott's Prometheus (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNTY2OTI3MF5BMl5BanBnXkFtZTcwNDc1MTg4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1334869","name":"Logan Marshall-Green","idIMDB":"nm1334869"},"actorId":"nm1334869","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zendaya","urlProfile":"http://www.imdb.com/name/nm3918035","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNzc3MDkxM15BMl5BanBnXkFtZTgwOTE3NDYzMTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 September 1996","placeOfBirth":" Oakland, California, USA","birthName":"Zendaya Maree Stoermer Coleman","height":"5' 10\" (1.78 m)","bio":"Zendaya, which means \"to give thanks\" in the language of Shona, was born in Oakland, California. She now lives in Los Angeles, California with her family and her dog, named \"Midnight\". She was a part of the California Shakespearian Theatre, where her mom worked as a House Manager. She would help out in the theatre and even got to do many plays after. Zendaya started her career as a fashion model for stores, such as Macy's, Old Navy, Sears, and Mervyn's. She is now on the show, Shake It Up! (2010), which also includes Bella Thorne, Kenton Duty and Roshon Fegan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNzc3MDkxM15BMl5BanBnXkFtZTgwOTE3NDYzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3918035","name":"Zendaya","nicknames":["Daya","Z"],"idIMDB":"nm3918035"},"actorId":"nm3918035","character":"Michelle","urlCharacter":"http://www.imdb.com/character/ch0562115","main":true},{"actorName":"Bokeem Woodbine","urlProfile":"http://www.imdb.com/name/nm0940158","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMDgwMzQwMV5BMl5BanBnXkFtZTcwNDc3NDg2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1973","placeOfBirth":" New York City, New York, USA","height":"6' (1.83 m)","bio":"Bokeem Woodbine grew up in Harlem New York. At the age of 19, he secured the lead role in the HBO production of Forest Whitaker's directorial debut Strapped (1993). Bokeem moved to Los Angeles shortly after completing the film Jason's Lyric (1994), and has pursued his dream of becoming a noteworthy film actor while balancing a passion for musical expression. Along the way he has appeared alongside Oscar- wining actors and worked with many of today's top directors, producers, and networks. To date he has appeared in biographical movies, like \"Ray,\" comedies like \"Life,\" horror, \"Devil,\" and most recently science fiction, in the much anticipated feature film, \"Riddick.\" Bokeem respects the responsibilities inherent in taking on any role, and enjoys the process.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMDgwMzQwMV5BMl5BanBnXkFtZTcwNDc3NDg2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0940158","name":"Bokeem Woodbine","nicknames":["Bo"],"idIMDB":"nm0940158"},"actorId":"nm0940158","character":"Herman Schultz / Shocker","urlCharacter":"http://www.imdb.com/character/ch0560855","main":true},{"actorName":"Kenneth Choi","urlProfile":"http://www.imdb.com/name/nm0158846","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU0NTgwNzA4OF5BMl5BanBnXkFtZTcwMTExMzk5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1971","placeOfBirth":" Chicago, Illinois, USA","height":"5' 7\" (1.7 m)","bio":"Growing up in the suburbs of Chicago, Choi dreamed of becoming an actor. Against his family's wishes, Choi left college to pursue that dream. He literally ran away from home, cutting all ties with his family for 5 years to train and study before moving to Los Angeles. His dream became a reality as he landed guest appearances in 6 television series during his first year including \"The West Wing\" and \"Roswell\". Choi gained recognition as both a comedic and dramatic actor with memorable guest turns on hit sitcoms \"The King of Queens\", \"Reba\", \"According to Jim\" and recurring roles in critically successful dramas such as \"House\" and \"24\". In 2008, Choi landed a starring role in the ABC Family series \"Samurai Girl\" opposite Jamie Chung, as well as recurring arcs in 2009 with Starz's \"Crash\" and Fox's \"Glee\", and in 2010 with TNT's \"Hawthorne\" and FX's critically-acclaimed \"Sons Of Anarchy\" playing Henry Lin. In 2004, Choi was cast in Steven Spielberg's \"The Terminal\". This sparked a surge in Choi's film career as he completed more than a dozen films through 2012 working with acclaimed writer/director David Ayer in \"Street Kings\" and \"Harsh Times\", and high profile roles in Lionsgate's \"War\" opposite Jason Statham, \"Red Dawn\" opposite Chris Hemsworth and Jeffrey Dean Morgan and his supporting lead role in the Marvel blockbuster, \"Captain America: The First Avenger\" playing Howling Commando Jim Morita. Choi gained 25 pounds to play the tough but hilarious Chester Ming alongside Leonardo DiCaprio and Jonah Hill in Martin Scorsese's Oscar-nominated, \"The Wolf Of Wall Street\". Along with his many film achievements, Choi has starred in several television shows including \"Ironside\" and \"Allegiance\" both for NBC Universal. Most notably, Choi inhabited the role of Judge Lance Ito for FX's highly-acclaimed Emmy-winning, Golden Globe-winning \"The People v. OJ Simpson: American Crime Story\" for Ryan Murphy. Choi has several feature films coming out in 2017 including, \"Spider-Man: Homecoming\" with Tom Holland, \"Bright\" with Will Smith, and \"American Express\" with Joel Edgerton. Also in 2017, he recurs on the television shows, \"The Last Man On Earth\" for FOX, \"Counterpart\" for Starz, and a leading role on NBC's \"Untitled Kourtney Kang Project\". Author: Fifteen Minutes","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU0NTgwNzA4OF5BMl5BanBnXkFtZTcwMTExMzk5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0158846","name":"Kenneth Choi","idIMDB":"nm0158846"},"actorId":"nm0158846","character":"Principal Morita","urlCharacter":"http://www.imdb.com/character/ch0562116","main":true},{"actorName":"Hannibal Buress","urlProfile":"http://www.imdb.com/name/nm2868110","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NzIwNTQ1N15BMl5BanBnXkFtZTgwMTQzNTc4NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1983","placeOfBirth":" Chicago, Illinois, USA","height":"5' 10\" (1.78 m)","bio":"Hannibal Buress was born on February 4, 1983 in Chicago, Illinois, USA. He is an actor and writer, known for The Eric Andre Show (2012), Comme des bêtes (2016) and Neighbors (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NzIwNTQ1N15BMl5BanBnXkFtZTgwMTQzNTc4NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2868110","name":"Hannibal Buress","idIMDB":"nm2868110"},"actorId":"nm2868110","character":"Coach Wilson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Revolori","urlProfile":"http://www.imdb.com/name/nm1727825","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NDEyMTE0NV5BMl5BanBnXkFtZTgwODI1Mzc5MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1996","placeOfBirth":" Anaheim, California, USA","height":"5' 8\" (1.73 m)","bio":"Tony Revolori was born Anthony Quinonez in Anaheim, California, and is the younger brother of actor Mario Revolori. He began acting when he was 2 years old. Tony plays the guitar, piano, bass guitar, and sings. He enjoys writing both songs and full-length feature films, as well as produce, direct, edit, and star in them. Tony is of Guatemalan descent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NDEyMTE0NV5BMl5BanBnXkFtZTgwODI1Mzc5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1727825","name":"Tony Revolori","idIMDB":"nm1727825"},"actorId":"nm1727825","character":"Flash Thompson","urlCharacter":"http://www.imdb.com/character/ch0001360","main":true}],"seasons":[],"idIMDB":"tt2250912","urlIMDB":"http://www.imdb.com/title/tt2250912","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"20","month":"06","year":"2016","remarks":null},{"money":null,"country":null,"day":"04","month":"10","year":"2016","remarks":null}],"copyrightHolder":"© 2016 Disney Enterprise"},"technical":{"runtime":null,"soundMix":["Dolby Atmos"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa Mini (Cooke S4/i & Angenieux lenses)"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"filmingLocations":[{"location":"Atlanta, Georgia, USA"}],"awards":[],"type":"Movie","companyCreditsSimple":[{"idCompany":"co0071509","name":"Columbia Pictures"},{"idCompany":"co0479739","name":"LStar Capital"},{"idCompany":"co0047120","name":"Marvel Entertainment"}],"keywords":{"keywords":["superhero","teenage superhero","super powers","teenage protagonist","marvel cinematic universe","reboot","re boot","based on comic book","based on comic","marvel comics"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 06:07:31"}}