{"data":{"movies":[{"title":"Alpha Alert","originalTitle":"Event 15","year":"2013","releaseDate":"20140617","directors":[{"name":"Matthew Thompson","id":"nm1434014"}],"writers":[{"name":"Scott Bolger","id":"nm5389461"},{"name":"Kent Murray","id":"nm3280651"}],"runtime":"84 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTgzNTczMF5BMl5BanBnXkFtZTgwNjY2NDI2MTE@._V1.jpg","countries":["UK","USA"],"languages":["English"],"genres":["Thriller"],"plot":"When a terrorist attack on Washington D.C. leaves three war veterans who are suffering from PTSD trapped in an elevator together, the isolation and highly stressful situation brings previous wartime experiences to the surface, and while dark forces are at work outside the elevator, a battle for control and survival ensues inside.","simplePlot":"Three soldiers get trapped in an elevator when terrorists set off a dirty bomb. But when one escapes, her world turns upside down as she realizes nothing is what it seems.","actors":[{"actorName":"Jennifer Morrison","urlProfile":"http://www.imdb.com/name/nm0607185","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjMwODQ5M15BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1979","placeOfBirth":" Chicago, Illinois, USA","birthName":"Jennifer Marie Morrison","height":"5' 5¼\" (1.66 m)","bio":"Jennifer Marie Morrison was born in Chicago, Illinois, the oldest child of teachers David and Judy Morrison. She was raised in Arlington Heights, IL, with a younger sister and brother. She attended the same school her parents taught at, Prospect High School. As a child, she did some work as a model. After graduating from high school, she attended Loyola University in Chicago, where she studied Theater and English. She then moved on to study at the Steppenwolf Theater Company, before relocating to Los Angeles, California to pursue her acting career. Morrison's movie debut came in 1994, playing the daughter of Richard Gere and Sharon Stone in Intersection (1994). Success followed with various film and television roles, including the lead in Urban Legend 2: Coup de grâce (2000). She came to wide scale public attention in 2004 for her role as Dr. Allison Cameron in the television series House (2004), for which she was nominated for a prestigious Screen Actors Guild Award. Since leaving \"House M.D.\", her career has continued to progress with roles in Star Trek (2009), How I Met Your Mother (2005) and Warrior (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjMwODQ5M15BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0607185","name":"Jennifer Morrison","nicknames":["Jen","J-mo"],"idIMDB":"nm0607185"},"actorId":"nm0607185","character":"White","urlCharacter":"http://www.imdb.com/character/ch0407826","main":true},{"actorName":"James Frain","urlProfile":"http://www.imdb.com/name/nm0289656","urlPhoto":"","biography":{"dateOfBirth":"14 March 1968","placeOfBirth":" Leeds, West Yorkshire, England, UK","birthName":"James Dominic Frain","height":"6' (1.83 m)","bio":"James Frain is one of Hollywood's most versatile and respected actors who has a reputation for bold, intelligent performances in a diverse body of work in which he's collaborated with some of the finest actors and directors working today. Recent film work includes Disney's TRON: Legacy opposite Jeff Bridges and Fox's Water for Elephants opposite Reese Witherspoon and Robert Pattinson and Transit opposite James Caviezel for producer Joel Silver. In television, he most recently starred in Season 3 of HBO's True Blood in which he portrayed the much-talked about character of Franklin Mott. Previously, he played Thomas Cromwell for three seasons in Showtime's critically acclaimed drama, The Tudors. James' past film credits include The Count of Monte Cristo with Jim Caviezel and Guy Pearce, Where the Heart Is opposite Natalie Portman, Reindeer Games with Ben Affleck and Charlize Theron, Into the Blue with Paul Walker, Elizabeth with Cate Blanchett and Hilary and Jackie opposite Emily Watson. He has recently completed filming starring roles in the BBC miniseries Bert & Dickie, the independent film Born of War, Lone Ranger for Disney and director Gore Verbinski opposite Johnny Depp and Armie Hammer, and BBC/Starz! series The White Queen. James has an extensive theatre background having performed with The Royal Shakespeare Company, Almeida, and Royal Court. In 2007 James co-starred with Ian McShane on Broadway in The Homecoming for which the cast won The Drama Critics Circle Best Ensemble Award. Born in the north of England he earned his degree in Drama and Film at the University of East Anglia and studied acting at London's Central School of Speech and Drama. While studying in London, James was spotted by Sir Richard Attenborough who immediately cast him in his first feature Shadowlands opposite Sir Anthony Hopkins and Debra Winger.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0289656","name":"James Frain","idIMDB":"nm0289656"},"actorId":"nm0289656","character":"Andrews","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Josh Stewart","urlProfile":"http://www.imdb.com/name/nm1577637","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2OTk3NTk3M15BMl5BanBnXkFtZTcwNDE2NTAzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 February 1977","placeOfBirth":" Diana, West Virginia, USA","birthName":"Joshua Regnall Stewart","height":"5' 10\" (1.78 m)","bio":"Joshua Regnall Stewart was born in Diana, West Virginia, to Margie (Skidmore) and Charles Regnall Stewart, a teacher and Baptist pastor. He studied at the T. Schreiber studios in New York City and was a company member of the 13th Street Repertory Theatre. He continued his work in theater in Los Angeles performing in 'Light Bulb,' and 'Beacon' alongside 'Robert Forster' and Brooke Shields. He is a competitive snowboarder and boxer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2OTk3NTk3M15BMl5BanBnXkFtZTcwNDE2NTAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1577637","name":"Josh Stewart","idIMDB":"nm1577637"},"actorId":"nm1577637","character":"Oldsman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kimberly Elise","urlProfile":"http://www.imdb.com/name/nm0253708","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MDMyNjExMV5BMl5BanBnXkFtZTcwODY1OTQ1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1967","placeOfBirth":" Minneapolis, Minnesota, USA","birthName":"Kimberly Elise Trammel","height":"5' 7\" (1.7 m)","bio":"Kimberly Elise was born on April 17, 1967 in Minneapolis, Minnesota, USA as Kimberly Elise Trammel. She is an actress, known for John Q (2002), Diary of a Mad Black Woman (2005) and For Colored Girls (2010). She was previously married to Maurice Oldham.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MDMyNjExMV5BMl5BanBnXkFtZTcwODY1OTQ1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0253708","name":"Kimberly Elise","idIMDB":"nm0253708"},"actorId":"nm0253708","character":"Blau","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jude Ciccolella","urlProfile":"http://www.imdb.com/name/nm0161980","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NzY2NzAzOV5BMl5BanBnXkFtZTcwMDc2OTkyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1947","placeOfBirth":" Burlington, Vermont, USA","birthName":"Richard Jude Ciccolella","height":"5' 10\" (1.78 m)","bio":"Jude was born in Burlington Vermont on March 11th, 1947. He spent his first three years in Middlebury Vermont where his father coached Football, Basketball and Baseball at Middlebury College. He then moved to Albany, New York, his hometown, where he would spend his formative years. After grade school at St. Catherine of Siena, He graduated from Christian Brothers Academy in 1965. He was an All City and All League first team selection in Football and Basketball, and was a member of the American Legion All Star team, and pitched in every All Star game all three years that he played. In Football he was voted the Most Valuable Player by the members of his HS team and was Captain of the Basketball team. Along with his father, Richard S. Ciccolella and his brother Thomas, Jude has been inducted into to the CBA Hall of Fame. Though as a kid Jude never participated in plays or learned to play a musical instrument and gave no obvious indication that he would make his living in the performing arts, looking back, there were signs along the way. Jude went to the movies a lot with his mother and father and his Aunt Jo, especially loving the swords and sandal epics, the sci-fi and horror films, and, of course, the westerns. He also would always have fantastic costumes designed by his mother for Halloween contests---the Pharaoh, the Monster, the Knight. He sang the tunes from the radio incessantly---trying to imitate the voices. Even in sports, it seemed to matter more that you stood at the plate like Henry Aaron, that you swung the bat like him---exactly---than whether you got a hit. Fantasy! Imitation! It was really at Brown University, though, that Jude discovered his vocation---something that, in hindsight, had been manifesting itself all along. Jude graduated from Brown with a BA in Philosophy and played football. But it was the theater department, headed by Jim Barnhill, that opened up the thespic world to Jude and pointed him toward his life goal. The campus band, Cool Clear Walter, which Jude fronted, was engendered by associations in the Theater Department-Terry Harkin (drums) and the Philosophy Department-Al Musgrave (lead guitar). After two years of social work in Albany, Jude went to Temple University in 1971 and received and MFA in Acting two years later. After a number of years in Philly writing songs, singing in pubs, doing plays, and supporting himself with stage hand work, it was time, finally---late in the game---to hit the BIG APPLE. Since he arrived, one of the lucky ones, he has earned his living on stage and screen for 35 years. For the first seven years it was tough---on call seven days a week while loading trucks to pay the bills---but there was always progress---a break here, a break there. Again, he was one of the lucky ones. He is a member of The Actors Studio and EST and is co-artistic director with Bill Bolender of The Eumenides Group, which has produced three plays in LA. He received a number of best actor awards for a short film (Last Call) which he co-produced with director Robert Bailey. The Jude Ciccolella Band has been playing for eight years in LA, playing the pop music of his generation and original stuff. He is also the composer and performer on five original CDs. Jude is married to the wonderful actress and award winning author Sylva Kelegian. They reside on the coast with their beloved dogs.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NzY2NzAzOV5BMl5BanBnXkFtZTcwMDc2OTkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0161980","name":"Jude Ciccolella","idIMDB":"nm0161980"},"actorId":"nm0161980","character":"General Black","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Rider","urlProfile":"http://www.imdb.com/name/nm2728757","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE3Mjc3OTI5NV5BMl5BanBnXkFtZTgwMjQ0NDkyODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Stephen Rider is an actor, known for Daredevil (2015), Sécurité rapprochée (2012) and Lee Daniels' The Butler (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE3Mjc3OTI5NV5BMl5BanBnXkFtZTgwMjQ0NDkyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2728757","name":"Stephen Rider","idIMDB":"nm2728757"},"actorId":"nm2728757","character":"Diego","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jared Butler","urlProfile":"http://www.imdb.com/name/nm2666826","urlPhoto":"","biography":{"bio":"Jared Butler is an actor and writer, known for Pirates of the Caribbean: At World's End (2007), Pirates of the Caribbean Online (2007) and Mad Max Renegade (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2666826","name":"Jared Butler","idIMDB":"nm2666826"},"actorId":"nm2666826","character":"News reader","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2363181","urlIMDB":"http://www.imdb.com/title/tt2363181","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 24 min (84 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.8","filmingLocations":[],"rated":"R","awards":[],"votes":"1,010","type":"Movie","companyCreditsSimple":[{"idCompany":"co0245273","name":"Millbrook Pictures"},{"idCompany":"co0223836","name":"Format Films"},{"idCompany":"co0104851","name":"Ipso Facto Films"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 07:41:55"}}