{"data":{"movies":[{"title":"Aim Low: The Best of Dylan Moran","originalTitle":"","year":"2010","releaseDate":"20101129","directors":[{"name":"Randall Churchill","id":"nm0161461"},{"name":"Michael Matheson","id":"nm0558567"}],"writers":[{"name":"Dylan Moran","id":"nm0602836"}],"runtime":"70 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWRkODNkMzgtNjc0NC00NjBiLTgyY2YtYzQ0ZGQxMmY1MzZkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjg5NTA5Mjg@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Comedy"],"plot":"Aim Low: The Very Best Of Dylan Moran is a compilation capturing Dylan Moran's most hilarious rants from Monster Live (2004), Like Totally (2005), and What It Is (2009). The very best bits of Moran, all delivered with his renowned charm, including his take on aging, religion, kids, relationships and the general absurdities of life.","simplePlot":"The very best bits of Moran, all delivered with his renowned charm, including his take on aging, religion, kids, relationships and the general absurdities of life.","actors":[{"actorName":"Dylan Moran","urlProfile":"http://www.imdb.com/name/nm0602836","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMjM2Mjk1MF5BMl5BanBnXkFtZTYwOTIwMzE3._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1971","placeOfBirth":" Navan, Co. Meath, Ireland","height":"5' 11\" (1.8 m)","bio":"Irish comedian Dylan Moran was born in Navan, County Meath in 1971. Leaving school without any qualifications at age 16, Moran quickly became attracted to stand-up comedy and debuted, in 1992, at a comedy club in Dublin, The Comedy Cellar. A year later, he won the Channel Four comedy newcomer's \"So You Think You're Funny\" award at the Edinburgh Festival, and began developing his comedy routines into a one-man show, \"Gurgling for Money\", for which he won the prestigious Perrier Comedy Award in 1996, and which he subsequently took to a nationwide tour of the UK. His exposure at the Edinburgh Festival also led to him getting programmed at international stand-up comedy festivals, worldwide. Subsequently, Moran took to writing and performing for British television. He has starred in the BBC sitcom, How Do You Want Me? (1998), and - more importantly - in 2000, he was commissioned by Channel Four for the sitcom, Black Books (2000). He wrote and starred in three 6-episode series of this comedy. Co-starring popular British stand-up comedian Bill Bailey, who was nominated for the Perrier Award the year Moran won, Black Books (2000) sees Moran play a character close to his stand-up comedy persona: an unsociable misanthrope, reminiscent of the John Cleese sitcom character, \"Basil Fawlty\", that shares a great love of wine with one of razor-sharp put-downs of all things human. Also, his character Bernard Black's often surreal views on everyday things and on human behavior is close to his stand-up persona's dealing with them. The same year the first series of \"Black Books\" aired, Moran took his one-man show, \"Ready, Steady, Cough\", on a UK tour, followed two years later by Dylan Moran: Monster (2004). This was followed by Monster II in 2004. In the late 1990's, Moran also moved from doing stand-up to working on a film acting CV. He played opposite Julia Roberts and Hugh Grant in Notting Hill (1999), co-starred with Michael Caine in The Actors (2003) and had parts in the Simon Pegg comedy, Shaun of the Dead (2004) and the Michael Winterbottom film, Tristram Shandy: A Cock and Bull Story (2005). Moran's live stand-up comedy is unique in that it merges two strands of stand-up that seemed incompatible for a long time: sharp observational humor, and surreal and fantastical language-based absurdity. On the one hand, he has a clear influence from what could be called an American school of stand-up comedy that is heavily observational. On the other hand, Moran's comedy is characterized by a use of language similar to the stand-up comedy of Eddie Izzard and Ross Noble: surreal associative leaps between on the one side observations and on the other fantasies, verbally painting bizarre and absurd worlds, often through a use of stream-of-consciousness narration. His language is often highly poetic, resembling a James Joyce that has had one too many. Moran is very reluctant to give interviews on his personal life and even on his career, a fact parodied in a staged interview inter-cut with the recording of his live stand-up show, \"Monster\", on its DVD release.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMjM2Mjk1MF5BMl5BanBnXkFtZTYwOTIwMzE3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0602836","name":"Dylan Moran","idIMDB":"nm0602836"},"actorId":"nm0602836","character":"Himself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2343610","urlIMDB":"http://www.imdb.com/title/tt2343610","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 10 min (70 min)"],"soundMix":null,"color":["Color (PAL)"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"8.0","filmingLocations":[{"location":"Vicar Street, County Dublin, Ireland"}],"awards":[],"votes":"44","type":"Video","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"}],"keywords":{"keywords":["stand up comedy"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 07:56:05"}}