{"data":{"movies":[{"title":"The First Gangster and the Last Gangster","originalTitle":"","year":"1937","releaseDate":"19371112","writers":[],"runtime":"4 min","countries":["USA"],"languages":["English"],"genres":["Documentary","Short"],"plot":"Edward G. Robinson talks to the audience about the history of gangster films and intro dues his latest vehicle.","simplePlot":"Edward G. Robinson talks to the audience about the history of gangster films and intro dues his latest vehicle.","actors":[{"actorName":"Edward G. Robinson","urlProfile":"http://www.imdb.com/name/nm0000064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzcwMzU5Nl5BMl5BanBnXkFtZTYwNTkwMjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1893","placeOfBirth":" Bucharest, Romania","birthName":"Emmanuel Goldenberg","height":"5' 7\" (1.7 m)","bio":"Edward G. Robinson arrived in the United States at age ten, and his family moved into New York's Lower East Side. He took up acting while attending City College, abandoning plans to become a rabbi or lawyer. The American Academy of Dramatic Arts awarded him a scholarship, and he began work in stock, with his new name, in 1913. Broadway was two years later; he worked steadily there for 15 years. His work included \"The Kibitzer\", a comedy he co-wrote with Jo Swerling. His film debut was a small supporting part in the silent The Bright Shawl (1923), but it was with the coming of sound that he hit his stride. His stellar performance as snarling, murderous thug Rico Bandello in Little Caesar (1931)--all the more impressive since in real life Robinson was a sophisticated, cultured man with a passion for fine art--set the standard for movie gangsters, both for himself in many later films and for the industry. He portrayed the title character in several biographical works, such as Dr. Ehrlich's Magic Bullet (1940) and A Dispatch from Reuter's (1940). Psychological dramas included Flesh and Fantasy (1943), Double Indemnity (1944), The Woman in the Window (1944)and Scarlet Street (1945). Another notable gangster role was in Key Largo (1948). He was \"absolved\" of allegations of Communist affiliation after testifying as a friendly witness for the House Un-American Activities Committee during the McCarthy hysteria of the early 1950s. In 1956 he had to sell off his extensive art collection in a divorce settlement and also had to deal with a psychologically troubled son. In 1956 he returned to Broadway in \"Middle of the Night\". In 1973 he was awarded a special, posthumous Oscar for lifetime achievement.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzcwMzU5Nl5BMl5BanBnXkFtZTYwNTkwMjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000064","name":"Edward G. Robinson","nicknames":["Eddie","Manny"],"idIMDB":"nm0000064"},"actorId":"nm0000064","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rose Stradner","urlProfile":"http://www.imdb.com/name/nm0833117","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzliYTlkOGQtMzQxMC00YzdlLTg4M2MtNjdjN2FkNzNhYTQxXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR24,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1913","placeOfBirth":" Vienna, Austria-Hungary [now Austria]","birthName":"Rosa Stradner","bio":"Pretty, soulful-eyed Austrian actress Rose Stradner was a rising 30s ingénue on the Viennese stage and in a few German film romances and musicals when MGM mogul Louis B. Mayer, who was in Europe searching for exotic talent, discovered Rose. Along with Greer Garson, Ilona Massey and Hedy Lamarr, she was brought to Hollywood and groomed as a foreign import. Unfortunately, her personal life became a shambles and eventually overwhelmed her ability to perform. She was born Rosa Stradner in Vienna in 1913 and educated at a convent. Her desire to become an actress came young. At 16 she studied at the Academy for Music and Art in Zurich, Switzerland, and at the age of 19, she auditioned for Max Reinhardt and handed a contract. She appeared for Reinhardt at the Voks and Josefstadt Theaters, often in the classics (Shakespeare, Ibsen, Moliere) but handled modern pieces (Dreiser, O'Neill) just as well. In Europe she also appeared in some films between 1933 and 1936. Fleeing Austria during the Nazi invasion, Rose, her then-husband Karl Heinz Martin, a stage director, and her mother arrived in the States in 1936. She and her husband divorced soon after however. Making her U.S. debut as Edward G. Robinson's put-upon wife in The Last Gangster (1937), she showed promise and was signed by MGM. Her second film Blind Alley (1939), which was more Freudian in nature, starred Chester Morris as a psychologically-disturbed mobster who abducts psychiatrist Ralph Bellamy. Rose had less to do in this picture. The budding star met well-known writer/producer/director Joseph L. Mankiewicz at around this time and she placed her career on hold. The couple married in 1939 had two sons, Chris and Tom. Christopher Mankiewicz, who was born a year later, went on to become a modest film producer in the 1980s. Although Rose returned for a small but key role as a Mother Superior in her husband's film The Keys of the Kingdom (1944), her career was officially over after only three films. In 1948 she was cast in the Edna Ferber play \"Bravo!\" but she had to be replaced during tryouts which caused her severe mental strain. On a positive note, her fluency in several languages helped her husband's screenplays but the marriage was rocky almost from the start. In addition to Mankiewcz' infamous affairs with such stars as Judy Garland and Linda Darnell, Rose did not take to being strictly a \"hausfrau\" easily and soon turned destructive with alcohol used to deaden her unhappiness. She would be known for going into emotional tirades and eventually she was admitted into clinics for her violent rages and psychological disturbances. Constantly threatening suicide, a lethal mix of bitterness and depression set in and on September 27, 1958 ended her pain with an overdose of sleeping pills in her Mt. Kisco, New York, residence. She was only 45.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzliYTlkOGQtMzQxMC00YzdlLTg4M2MtNjdjN2FkNzNhYTQxXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0833117","name":"Rose Stradner","idIMDB":"nm0833117"},"actorId":"nm0833117","character":"Herself - Actress in 'The Last Gangster'","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Stewart","urlProfile":"http://www.imdb.com/name/nm0000071","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNzMzODY0NV5BMl5BanBnXkFtZTcwMDk3NDQyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 May 1908","placeOfBirth":" Indiana, Pennsylvania, USA","birthName":"James Maitland Stewart","height":"6' 3\" (1.91 m)","bio":"James Maitland Stewart was born on 20 May 1908 in Indiana, Pennsylvania, to Elizabeth Ruth (Johnson) and Alexander Maitland Stewart, who owned a hardware store. He was of Scottish, Ulster-Scots, and some English, descent. Stewart was educated at a local prep school, Mercersburg Academy, where he was a keen athlete (football and track), musician (singing and accordion playing), and sometime actor. In 1929 he won a place at Princeton, where he studied architecture with some success and became further involved with the performing arts as a musician and actor with the University Players. After graduation, engagements with the University Players took him around the northeastern United States, including a run on Broadway in 1932. But work dried up as the Great Depression deepened, and it wasn't until 1934, when he followed his friend Henry Fonda to Hollywood, that things began to pick up. After his first screen appearance in Art Trouble (1934), he worked for a time for MGM as a contract player and slowly began making a name for himself in increasingly high-profile roles throughout the rest of the 1930s. His famous collaborations with Frank Capra, in You Can't Take It with You (1938), Mr. Smith Goes to Washington (1939), and, after World War II, It's a Wonderful Life (1946) helped to launch his career as a star and to establish his screen persona as the likable everyman. Having learned to fly in 1935, he was drafted into the U.S. Army in 1940 as a private (after twice failing the medical for being underweight). During the course of World War II he rose to the rank of colonel, first as an instructor at home in the United States, and later on combat missions in Europe. He remained involved with the U.S. Air Force Reserve after the war and retired in 1959 as a brigadier general. Stewart's acting career took off properly after the war. During the course of his long professional life he had roles in some of Hollywood's best remembered films, starring in a string of Westerns (bringing his \"everyman\" qualities to movies like The Man Who Shot Liberty Valance (1962)), biopics (The Stratton Story (1949), The Glenn Miller Story (1954), and The Spirit of St. Louis (1957), for instance) thrillers (most notably his frequent collaborations with Alfred Hitchcock) and even some screwball comedies . He continued to work into the 1990s and died at the age of 89 in 1997.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNzMzODY0NV5BMl5BanBnXkFtZTcwMDk3NDQyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000071","name":"James Stewart","nicknames":["Jimmy"],"idIMDB":"nm0000071"},"actorId":"nm0000071","character":"Himself - Actor in 'The Last Gangster'","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2321561","urlIMDB":"http://www.imdb.com/title/tt2321561","business":{"budget":{"money":"$1,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["4 min (USA)"],"soundMix":null,"color":["Black and White"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"filmingLocations":[{"location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA"}],"rated":"NOT RATED","awards":[],"type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"}],"keywords":{"keywords":["gangster","film star","trailer"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 00:48:35"}}