{"data":{"movies":[{"title":"Freezer","originalTitle":"","year":"2014","releaseDate":"20140619","directors":[{"name":"Mikael Salomon","id":"nm0004121"}],"writers":[{"name":"Tom Doganoglu","id":"nm3182265"},{"name":"Shane Weisfeld","id":"nm5202991"}],"runtime":"83 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMzY4MDA4M15BMl5BanBnXkFtZTgwNzE4MzU2MDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Thriller"],"plot":"Robert is an ordinary man who is faced with extraordinary circumstances. He is locked in a meat freezer by Russian thugs who believe that he owes them 8 million dollars. Robert, who is in every frame of the film soon discovers that he is not alone in the freezer. Sam, a stranger, is also locked in with him, and it becomes a struggle to survive the cold and the forces that are against them.","simplePlot":"Robert is an ordinary man who is faced with extraordinary circumstances. He is locked in a meat freezer by Russian thugs who believe that he owes them 8 million dollars. Robert, who is in ... ","actors":[{"actorName":"Peter Facinelli","urlProfile":"http://www.imdb.com/name/nm0004906","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGU0ZDkwODctM2QxMi00ODJlLWI2ODMtYjc3MjFlZWFjYjY0L2ltYWdlXkEyXkFqcGdeQXVyNzEwNjQwMTY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 November 1973","placeOfBirth":" Queens, New York City, New York, USA","height":"5' 10\" (1.78 m)","bio":"Peter Facinelli was born in Queens, New York, the youngest child of Bruna (Reich) and Pierino Facinelli, a waiter. His parents are Italian immigrants, originally from Trentino, Northern Italy. He has three sisters. Peter was educated at St. Francis Preparatory School in Fresh Meadows, New York, and went on to attend St. John's University, but left after a year to follow his interest in acting at the Atlantic Theater Company Acting School, also in New York. There Facinelli was taught by such distinguished actors as Academy Award nominees William H. Macy and Felicity Huffman. He made his screen debut in 1995, appearing in Rebecca Miller's Angela (1995) and has worked consistently ever since. Notable projects include The Price of Love (1995), An Unfinished Affair (1996) (where he met his future wife, Jennie Garth), Touch Me (1997) and The Scorpion King (2002). Facinelli has also had re-occurring roles in such TV shows such as Fastlane (2002), Six Feet Under (2001), Damages (2007) and Nurse Jackie (2009). In 2008, he won the role of Dr. Carlisle Cullen in the wildly popular Twilight (2008) and its sequels.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGU0ZDkwODctM2QxMi00ODJlLWI2ODMtYjc3MjFlZWFjYjY0L2ltYWdlXkEyXkFqcGdeQXVyNzEwNjQwMTY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004906","name":"Peter Facinelli","idIMDB":"nm0004906"},"actorId":"nm0004906","character":"Detective Sam Gurov","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dylan McDermott","urlProfile":"http://www.imdb.com/name/nm0001518","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMjY2NzU4OF5BMl5BanBnXkFtZTcwODg2NDc4Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1961","placeOfBirth":" Waterbury, Connecticut, USA","birthName":"Mark Anthony McDermott","height":"6' (1.83 m)","bio":"A Golden Globe winner and Emmy nominee, Dylan McDermott has proved his talent in film, television and theater. He was born Mark Anthony McDermott in Waterbury, Connecticut, to Diane (Marino) and Richard McDermott. Diane was 15 and Richard was 17 when Dylan was born. Richard earned money by hustling pool. Dylan is of Italian (from his maternal grandfather), Irish, English and French descent. During Dylan's early years, his parents separated. In 1967, when Dylan was five, his mother was murdered by her live-in boyfriend. The murder was initially ruled an accidental shooting occurring while her boyfriend cleaned his gun, but police reopened the case in 2012 and revealed evidence showing it was impossible for her death to be have been accidental. Dylan and his sister Robin, who was then six months old, were taken in by their grandmother, Avis (Rogers) Marino. When Dylan was 15, his father met and married playwright/activist Eve Ensler. Eve adopted Dylan. Eve encouraged him to go to acting school and Fordham University in New York City. He met his now ex-wife, Shiva Rose, at a coffee shop in Venice, California, on the same day he got a big acting break by being cast in the film In the Line of Fire (1993) with Clint Eastwood. As a result of his connection with Eastwood, Dylan attended a dinner honoring Clint. There, he met Jeffrey Kramer, a man who used to frequent a bar where Dylan had earlier worked. Kramer was, at that time, the president of David E. Kelley Productions. He asked Dylan to meet David E. Kelley for a then-upcoming series about lawyers, The Practice (1997), and the rest was history. Another mentor of Dylan is Joanne Woodward, who discovered him while he was doing workshops at the Neighborhood Playhouse. The series earned him a Golden Globe in 1999 and nominations in 2000 and 2001, as well as an Emmy nomination in 1999. His film credits include The Pang Brother's The Messengers (2007); Wonderland (2003); Home for the Holidays (1995); Steel Magnolias (1989); Hamburger Hill (1987); Miracle on 34th Street (1994); In the Line of Fire (1993) and Burning Palms (2010). McDermott's television credits include the Jerry Bruckheimer-produced TNT drama, Dark Blue (2009); and TNT's dramatic limited series, The Grid (2004), opposite Julianna Margulies. In 2008, McDermott starred in Nicky Silver's \"Three Changes\" at Playwrights Horizons. Starring opposite Maura Tierney, the play follows an uncomfortably married Upper West Side couple. Additionally, in September 2006, McDermott was on stage in Eve Ensler's new play, \"The Treatment\". Ensler's play explored the relationship between a traumatized former military interrogator (McDermott) and his psychologist Colonel, who is assigned to give him routine treatment. The play opened the Impact Festival 2006, a New York City-wide arts festival as part of the Culture Project. McDermott was nominated for a Drama League Award for his performance. McDermott appeared on television in the first season of Ryan Murphy and Brad Falchuk's FX drama, American Horror Story (2011), opposite Connie Britton and Jessica Lange. McDermott co-starred in Jay Roach's comedy, The Campaign (2012), opposite Will Ferrell and Zach Galifianakis. McDermott played \"Tim Wattley\", a political consultant who runs the campaign of a candidate from North Carolina. The Warner Bros. film was released on August 10, 2012. That year, McDermott was also seen in the indie coming-of-age drama, The Perks of Being a Wallflower (2012), alongside Logan Lerman (playing Lerman's character's father), Emma Watson, Paul Rudd, Ezra Miller and Mae Whitman. In 2013, McDermott had a supporting role in Antoine Fuqua's Olympus Has Fallen (2013), alongside Aaron Eckhart and Gerard Butler. The film followed a former Secret Service agent who becomes America's only hope when the President is taken hostage by terrorists. McDermott's additional theatre credits include Neil Simon's production of \"Biloxi Blues\" on Broadway and \"Golden Boy\", directed by Joanne Woodward at the Williamstown Theater Festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMjY2NzU4OF5BMl5BanBnXkFtZTcwODg2NDc4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001518","name":"Dylan McDermott","idIMDB":"nm0001518"},"actorId":"nm0001518","character":"Robert","urlCharacter":"http://www.imdb.com/character/ch0443371","main":true},{"actorName":"Yuliya Snigir","urlProfile":"http://www.imdb.com/name/nm2568364","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyMTQxNjQzMV5BMl5BanBnXkFtZTgwMzEyNTg4MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 June 1983","placeOfBirth":" Donskoy, Tulskaya oblast, RSFSR, USSR [now Russia]","birthName":"Yuliya Viktorovna Siriskina","height":"5' 5¾\" (1.67 m)","bio":"Born in a town of Tula in Russia, Yulia Snigir was playing chess professionally and at the age of 15 was awarded the prestigious title of Candidate of Chess Master by International Chess Federation. She was planning to have a professional chess player career but instead made a decision to continue her education and moved to Moscow on her own where she was accepted to State Pedagogical University. Yulia had to study and work at the same time to support herself financially. She was teaching English in the nursery school, when a friend showed photos of Yulia to a representative of one of the most prestigious Moscow modeling agency. While continuing her study program in University, Yulia became a successful model. She was offered a contract with a leading French jewelry brand and was planning to move to France when a casting-director saw her at the modeling agency and invited for an audition. Her acting career officially started when she was accepted to the famous Vakhtangov Theatre Academy and was cast in two independent films. Yulia's big break came when she was offered one of the leading roles in the Russian Sci-Fi blockbuster \"The Inhabited Island\" and the sequel \"The Inhabited Island 2: Rebellion\". It made her a star in Russia. Yulia became the face of L'Oreal, Mexx clothing and Mexx perfume. Yulia divided her time between TV series, theater and film playing the vast variety of roles and becoming a versatile actress with her projects ranging, from small indie films, to TV dramas, large studio projects and experimental theater. In the theater Yulia played a male role in a very successful production of King Lear, which won several European and Russian theater awards. In 2012 she was cast in a female leading role in the fifth installment of Die Hard which is scheduled for February 2013 release.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyMTQxNjQzMV5BMl5BanBnXkFtZTgwMzEyNTg4MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2568364","name":"Yuliya Snigir","idIMDB":"nm2568364"},"actorId":"nm2568364","character":"Alisa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Markus Parilo","urlProfile":"http://www.imdb.com/name/nm0661508","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNzI2MDQ0Nl5BMl5BanBnXkFtZTgwNTExMjYzMDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Markus Parilo is known for his work on Jason X (2001), The Boondock Saints (1999) and Crash (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNzI2MDQ0Nl5BMl5BanBnXkFtZTgwNTExMjYzMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0661508","name":"Markus Parilo","idIMDB":"nm0661508"},"actorId":"nm0661508","character":"Oleg","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrey Ivchenko","urlProfile":"http://www.imdb.com/name/nm3359985","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMzk0MTc3M15BMl5BanBnXkFtZTgwNjM2MDcyNjE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"bio":"Born in the heart of the Ukraine, in a city called Kharkov, Andrey Ivchenko was always a dreamer and very passionate about television and film. As his desire to be an actor grew, Andrey enrolled in his high school theater programs and realized he was a natural at memorizing lines quickly and learned how to own the stage. In between theater classes, Andrey would focus on another passion of his, which was bodybuilding. It all started when a classmate of Andrey's, who had smuggled a Muscle & Fitness magazine from the U.S., left it behind and even though at the time he didn't speak a word of English, he began to flip through it, was immediately hooked, and the rest is history. The obsession with bodybuilding and body sculpting began and he wanted to incorporate it with his acting. Now standing at 6'3, Andrey began to realize that having muscles, strength, and height could also get him work in heavy action and stunts as well. At the age of 18, Andrey joined the U.S.S.R. military and served for 2 years. After he got out, he attended college and got his Masters Degree in Kinesiology. During that time, all he could think about was having an acting career. Knowing his opportunities to succeed in film and television were extremely limited in the Ukraine, Andrey packed up and moved to Europe for the next few years hoping to find bigger opportunities. Not too long after, he moved to Toronto, Canada to try his luck knowing there were many more productions in television and film casting. Almost immediately, Andrey signed with an agent and began landing acting/stunt roles on such known shows as: \"Falling Skies,\" \"Nikita,\" and \"The Transporter\" (the TV series). He landed his first leading role in a Lionsgate feature called \"The Way Of The West\" which was released in 2011 as well as a lead role in the Envision Media feature \"Freezer\" opposite Dylan McDermot which was released in 2014. After having some great success in Canada, Andrey decided to make the move to Los Angeles. Since moving to LA a little over three years ago, Andrey has landed almost a dozen additional recognizable credits in television and film. His most recent credits include a guest star on the CW hit show \"Jane The Virgin\" as well as a supporting role, opposite Vin Diesel, in the very anticipated next installment of the successful \"xXx\" franchise, \"xXx3: The Return Of Xander Cage\" which he is set to start shooting at the beginning of February as well as a supporting role in 20th Century Fox's newest upcoming feature \"Why Him\" being produced by Ben Stiller and Jonah Hill. Andrey has definitely become a recognizable face and name within the entertainment industry and this next year will be very exciting with all of the upcoming projects he has in the works. In his spare time he likes to hang out with friends, go to the gym, and travel.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMzk0MTc3M15BMl5BanBnXkFtZTgwNjM2MDcyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3359985","name":"Andrey Ivchenko","idIMDB":"nm3359985"},"actorId":"nm3359985","character":"Kiril","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Milan Malisic","urlProfile":"http://www.imdb.com/name/nm4642763","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NjA5MzAwMl5BMl5BanBnXkFtZTgwNzE1ODU3MDE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"bio":"Milan Malisic is a Toronto born actor who has appeared in many television shows and films in both the USA and Canada. Milan recently wrapped filming Mikael Salomon's feature film Freezer, in which he stars opposite Dylan McDermott and Peter Facinelli. Milan has played in numerous theatre productions, including an award winning Taming of the Shrew at the Toronto Centre for the Arts, Finer Noble Gases at the historic Factory Theatre and at The Michigan Shakespeare Festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NjA5MzAwMl5BMl5BanBnXkFtZTgwNzE1ODU3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4642763","name":"Milan Malisic","idIMDB":"nm4642763"},"actorId":"nm4642763","character":"Stepan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rafael Petardi","urlProfile":"http://www.imdb.com/name/nm0676152","urlPhoto":"","biography":{"birthName":"Pascal Rafael Petardi","bio":"A native of Montreal, Canada, Rafael Petardi has been working extensively on the stage and screen since the age of nine. After spending time in Montreal's local theatre scene, Petardi joined the corporate world, building a successful career, but missing the Creative Arts. Following his passion, Petardi returned to the University of Montreal where he was awarded a scholarship to study theater in Italy. After gaining experience in Italy with several theater roles, as well as a film role, Petardi returned to Montreal, ready to further his career on television. His first audition in Montreal landed him a leading role in a mini series alongside several Quebecois stars. He has also starred in many award nominated and award winning television shows such as \"La vie, La vie\" (Recurring Character) and \"Rent-a-Goalie\" (Series Regular). His acting efforts on these programs resulted in three Gemini Award (Canadian Emmy) nominations, three years in a row. Today, Petardi continues to pursue film and television roles. He has appeared as a recurring character on top TV series such as ABC's \"Flash Forward,\" a guest star on CBS' \"The Unit\" and \"NCIS: Los Angeles.\" In addition, he has played roles in hit feature films such as Angel's & Demons with Tom Hanks and Beverly Hills Chihuahua (starring Drew Barrymore and Andy Garcia). Most recently, Petardi completed principal photography on the thriller, Freezer starring opposite Dylan McDermott, the feature House of Versace starring opposite Gina Gershon, as well as the French-Canadian mini-series La Marraine in which the supporting role Petardi played required him to be fluent in English, French and Spanish. He also joined the cast of the second season of \"Bomb Girls,\" the Canadian television drama starring Meg Tilly. In the series, Pascal plays the charming, but anti-authoritarian Frank Di Carlo. Petardi is fluent in English, French, Italian, Spanish, and has working knowledge of Russian and Mandarin Chinese. He currently lives in Los Angeles. (August, 2013)","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0676152","name":"Rafael Petardi","idIMDB":"nm0676152"},"actorId":"nm0676152","character":"Vadim","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David McNally","urlProfile":"http://www.imdb.com/name/nm0573588","urlPhoto":"","biography":{"dateOfBirth":"27 September 1961","placeOfBirth":" Edmonton, Alberta, Canada","bio":"David McNally was born on September 27, 1961 in Edmonton, Alberta, Canada. He is an actor, known for Ginger Snaps - Résurrection (2004), Forsaken, retour à Fowler City (2015) and 1132 Pleasant Street (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0573588","name":"David McNally","idIMDB":"nm0573588"},"actorId":"nm0573588","character":"Detective Al Dorian","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2325002","urlIMDB":"http://www.imdb.com/title/tt2325002","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 23 min (83 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.2","filmingLocations":[{"location":"Edmonton, Alberta, Canada"}],"rated":"R","awards":[],"votes":"2,762","type":"Movie","companyCreditsSimple":[{"idCompany":"co0340433","name":"Envision Media Arts"}],"keywords":{"keywords":["freezer","die hard scenario","claustrophobic setting","locked in a freezer"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:38:00"}}