{"data":{"movies":[{"title":"Dark Desire","originalTitle":"A Dark Plan","year":"2012","releaseDate":"20121123","directors":[{"name":"Armand Mastroianni","id":"nm0557857"}],"writers":[{"name":"Julie Lynch","id":"nm0528363"}],"runtime":"85 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAwNjY4NDAzNl5BMl5BanBnXkFtZTcwNDQ2NjM4OA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Mystery","Thriller"],"plot":"A young man desperate to be connected to the people close to him resorts to devious measures to achieve that desire.","simplePlot":"A young man desperate to be connected to the people close to him resorts to devious measures to achieve that desire.","actors":[{"actorName":"Kelly Lynch","urlProfile":"http://www.imdb.com/name/nm0001488","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODkwNzQ5MTE4Nl5BMl5BanBnXkFtZTYwNDUzMjE1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 January 1959","placeOfBirth":" Golden Valley, Minnesota, USA","birthName":"Kelly Ann Lynch","height":"5' 9\" (1.75 m)","bio":"Kelly Lynch was born in 1959 in Minneapolis, Minnesota. She started her acting career with a small job at the Guthrie Theater. She studied under acting teacher Sanford Meisner and became a model for the famous Elite Modeling Agency. She first gained acclaim for acting in the Gus Van Sant film Drugstore Cowboy (1989). Lynch earned an Independent Spirit Award nomination for her role in The Beans of Egypt, Maine (1994). She stars in the 20th-Century Fox film Homegrown (1998), co-starring Hank Azaria and Billy Bob Thornton.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODkwNzQ5MTE4Nl5BMl5BanBnXkFtZTYwNDUzMjE1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001488","name":"Kelly Lynch","idIMDB":"nm0001488"},"actorId":"nm0001488","character":"Caren","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nic Robuck","urlProfile":"http://www.imdb.com/name/nm3449103","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5ODU5MTIzMl5BMl5BanBnXkFtZTcwOTcxNDcxOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Nic Robuck is an actor, known for One Life to Live (1968), Dark Desire (2012) and Norm of the North (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5ODU5MTIzMl5BMl5BanBnXkFtZTcwOTcxNDcxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3449103","name":"Nic Robuck","idIMDB":"nm3449103"},"actorId":"nm3449103","character":"Shane","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Nouri","urlProfile":"http://www.imdb.com/name/nm0636694","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNDQxMjI2NV5BMl5BanBnXkFtZTcwMjkxNTE2Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1945","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Michael David Nouri","height":"6' 3\" (1.91 m)","bio":"Michael Nouri was born on December 9, 1945 in Washington, District of Columbia, USA as Michael David Nouri. He is an actor, known for Flashdance (1983), The Proposal (2009) and The Terminal (2004). He was previously married to Vicki Light and Lynn Goldsmith.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNDQxMjI2NV5BMl5BanBnXkFtZTcwMjkxNTE2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0636694","name":"Michael Nouri","idIMDB":"nm0636694"},"actorId":"nm0636694","character":"Phil","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Borello","urlProfile":"http://www.imdb.com/name/nm3376453","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNTQ3NjQ3MV5BMl5BanBnXkFtZTgwODQyNjE2MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Brian Borello is an actor, known for Dark Desire (2012), Girlfriends (2017) and The Other Side (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNTQ3NjQ3MV5BMl5BanBnXkFtZTgwODQyNjE2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3376453","name":"Brian Borello","idIMDB":"nm3376453"},"actorId":"nm3376453","character":"Brandon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mika Boorem","urlProfile":"http://www.imdb.com/name/nm0095561","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGYyOTA4MGMtYzljYi00OGZiLWJjNTgtMWE1YmQ3YmVhMTdjL2ltYWdlXkEyXkFqcGdeQXVyMjAwMDUxMDc@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1987","placeOfBirth":" Tucson, Arizona, USA","birthName":"Mika Sue Boorem","height":"5' 5\" (1.65 m)","bio":"Mika Boorem is a actress, director, writer, and producer based in Los Angeles. Boorem began directing and producing plays in 2010. Boorem is best known for her acting career that began in 1994. Her feature film credits include Smile, Sleepover, Blue Crush, The Patriot, Along Came a Spider, Hearts in Atlantis, The Ward, Virgin Alexander, Good Day For It, Dirty Dancing: Havana Nights, Jack Frost, A Dark Desire, Carolina, Riding in Cars with Boys, Things You Can Tell Just by Looking at Her, Mighty Joe Young, Trucker and others. She has appeared on Dawson's Creek, House, Touched by an Angel, Ghost Whisperer. She starred in ABC Family's The Initiation of Sarah and the Lifetime Movie drama, Augusta, Gone, for which she won a Prism Award. Her work in Smile was honored at the Stony Brook Film Festival where she received the Rising Star Award. Mika was also nominated for a Teen Choice Award and four Young Artist Awards.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGYyOTA4MGMtYzljYi00OGZiLWJjNTgtMWE1YmQ3YmVhMTdjL2ltYWdlXkEyXkFqcGdeQXVyMjAwMDUxMDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0095561","name":"Mika Boorem","idIMDB":"nm0095561"},"actorId":"nm0095561","character":"Erin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Annie Abbott","urlProfile":"http://www.imdb.com/name/nm0007931","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0ODg2MjA5Nl5BMl5BanBnXkFtZTgwMTAzODgxODE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"bio":"Originally from New York, Annie's career got off to a decisive start when she was hired for \"Dance With Me\", a Tony Award-nominated Broadway musical directed by legendary Joel Zwick (\"My Big Fat Greek Wedding\") just after graduating from Brooklyn College. More Broadway and Off-Broadway shows followed: \"Knockout\", \"Moonwalk\", \"To Bury A Cousin\", \"Emma Instigated Me\", and \"Myths of America Smith\" (Ellen Stewart's La Mama). Annie and her family eventually moved to L.A. just as episodic television was breaking new dramatic ground. The risk paid off - she was quickly hired by Steven Bochco to play the recurring role of irreverent Judge Janice Neiman on the iconic show \"LA Law\", a job that lasted 10 years. Selected films include: lead in Antwone Fisher's directorial debut, \"My Summer Friend\", winner of the 2010 Los Angeles Jewish Film Festival's Best Short; DGA-nominated five-hour miniseries \"The Beach Boys\"; \"The Gin Game\" with Mary Tyler Moore and Dick Van Dyke. Some recent TV appearances include \"Perception\", \"Californication\", and Disney's \"I Didn't Do It\", the latter directed by long-time collaborator Joel Zwick. Annie, a longtime member of the Interact Theatre Company, has appeared in many of their award-winning productions: \"Counsellor-At-Law\", \"A Little Night Music\", \"Into The Woods\", \"Urinetown\", \"Death of A Salesman\", and won an ADA Best Actress Award for the role of Mama in \"'night, Mother\". The premiere of Annie's first solo show as a writer, \"Giving Up Is Hard To Do\" (dir. Joel Zwick) was produced by the Victory Theatre Center in 2013. It continues to run as a guest production at Santa Monica Playhouse.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0ODg2MjA5Nl5BMl5BanBnXkFtZTgwMTAzODgxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007931","name":"Annie Abbott","idIMDB":"nm0007931"},"actorId":"nm0007931","character":"Dee Dee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Amico","urlProfile":"http://www.imdb.com/name/nm0024839","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA5MTk0OTkxOF5BMl5BanBnXkFtZTgwMzI4NjcyMDI@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1953","placeOfBirth":" Brooklyn, New York, USA","bio":"He honed his craft on stage in New York City and owes all he knows about acting to the Actor's Studio and \"The Method\". He NOW adds Producing, Writing,and Directing to his resume, as well as teaching acting through his \"The Reactors Studio\" at the Whitmore Lindley Theatre in North Hollywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA5MTk0OTkxOF5BMl5BanBnXkFtZTgwMzI4NjcyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0024839","name":"Robert Amico","idIMDB":"nm0024839"},"actorId":"nm0024839","character":"Paul","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maude Bonanni","urlProfile":"http://www.imdb.com/name/nm0093750","urlPhoto":"","biography":{"bio":"Maude is a French-Italian actress living in Los Angeles. The daughter of an Italian actor and French architect, she was raised in Rome, Cannes, and Paris, and was first trained as a dancer. Then, after graduating from high school, she moved to the United States to study acting. Upon obtaining her diploma from the prestigious Lee Strasberg Theatre Institute in New York, she toured Italy with the Teatro Belli company in the Woody Allen play \" PLay it Again Sam\". From that point on, she never stopped plying her craft, mostly in the USA, on stage, in film and television, on the Web, and doing voice overs. An award-winning actress (Sacher festival 1998), she kept training with different master teachers such as Larry Moss, Jack Waltzer, Patsy Rodenberg, Bob MacAndrew, and Bernard Hiller.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0093750","name":"Maude Bonanni","idIMDB":"nm0093750"},"actorId":"nm0093750","character":"Rose","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Austin Brooks","urlProfile":"http://www.imdb.com/name/nm2153152","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4Njk0ODA3MF5BMl5BanBnXkFtZTgwMjA3MDY4MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 October 1969","placeOfBirth":" McAllen, Texas, USA","height":"5' 10\" (1.78 m)","bio":"Austin Brooks was born on October 6, 1969 in McAllen, Texas, USA. He is known for his work on Criminal Minds: Beyond Borders (2016), Mistresses (2013) and Pandemic (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4Njk0ODA3MF5BMl5BanBnXkFtZTgwMjA3MDY4MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2153152","name":"Austin Brooks","idIMDB":"nm2153152"},"actorId":"nm2153152","character":"Detective","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Denise Grayson","urlProfile":"http://www.imdb.com/name/nm0337091","urlPhoto":"","biography":{"bio":"Denise Grayson, who portrays an intellectual property attorney in 'David Fincher''s movie _The Social Network is a perfect example of art imitating life. She is an actress who IS an intellectual property lawyer. Denise landed her role in The Social Network (2010) after being spotted at a party by the film's casting director, Laray Mayfield. Laray asked her if she was an actor. In the presence of Angelina Jolie and Brad Pitt, who were standing nearby, Denise was at first reluctant to admit that she was. But it was a nerve-wracking four months before she knew the role was hers. At first, she didn't even know she was auditioning for a David Fincher movie. In her first feature film, 1999's Puppet (1999), Denise played an FBI agent. Next came a short film Gasline (2001), which won the jury prize at the Sundance Film Festival. The writer/director, 'Dave Silver', cast her again in his first full-length feature Corn (2004). She followed with three movies for the Hallmark Channel. In Though None Go with Me (2006), she aged considerably, playing a sixty-year-old opposite Cheryl Ladd. This was followed by Pandemic (2007) and the 2009 movie Citizen Jane (2009), playing a bank manager. Ally Sheedy starred. Today, Denise divides her time between homes in New York and Los Angeles. She is licensed to practice law in New York and Florida. Although Denise is immersed in her acting career, she generously donates her time in California doing pro bono mediation work. She also coaches stand-up comedians, though there is no apparent connection between the two activities. While still in her twenties, Denise was in-house counsel for Paine Webber (now UBS) and then for Bankers Trust (now Deutsche Bank) as an intellectual property lawyer with a specialty in technology. Denise was something of a prodigy, entering college in her hometown of Brooklyn, New York at the age of 16, majoring in accounting and economics. She also took courses in public speaking to overcome her shyness. At twenty, she was already studying at the University of Miami School of Law. In her last year there, she successfully tried six supervised felony cases. Upon graduating, she had the opportunity to work as a state prosecutor, but realized this was not the work she wanted to do when she felt sympathy for the defendant in a major murder case. Moving back to New York to be near her parents, both teachers and artists, she embarked on a legal career that was far removed from sympathetic murder suspects. She worked in the early days of the technology boom and the beginning of the Internet. Denise soon struck out on her own, representing most of the major banks and financial institutions, including Merrill Lynch, Chase and Prudential. At the same time, she became involved in acting, reigniting her childhood creativity when she played the lead in a number of school plays. She started classes at Uta Hagen's famous HB Studios and continued to study there for years. Juggling two careers, Denise got work as a model and as an actress in commercials while she continued to work as an attorney. Her lawyer friends thought she was nuts, but she quickly found herself in a number of off-off-Broadway plays and low budget movies. Today, she is able to enjoy the fruits of her labors, with her career now moving to a higher level.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0337091","name":"Denise Grayson","idIMDB":"nm0337091"},"actorId":"nm0337091","character":"Doctor Maynard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Laughlin","urlProfile":"http://www.imdb.com/name/nm0490855","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2VjODdlZGEtMzRhNS00NTZiLWJkZTItMzFlMmI5N2Q2ZmEyXkEyXkFqcGdeQXVyODAwMzI0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1956","placeOfBirth":" Memphis, Tennessee, USA","bio":"Actor John Laughlin has had a remarkable career spanning several decades. At 19, John felt compelled to pursue his passion and moved to Los Angeles to learn his craft and become a serious actor. He initially went about it by taking two years at the Film Industry Workshop and then went on to study with some of the best in the business. After only two years of living in Hollywood, John landed two feature films, then his first series \"White Shadow,\" which allowed him to get a breakout role in \"An Officer and Gentleman.\" Paramount took note and springboarded him in to \"Footloose\" alongside Kevin Bacon. Laughlin then landed a three-picture deal starting with a lead in \"Crimes of Passion\" starring Kathleen Turner. He also had a significant role in \"The Rock\" with Sean Connery. Laughlin was offered a once-in-a-lifetime opportunity to pursue his other personal passion, philanthropy. He took a break from the industry and worked with a nonprofit organization in order to concentrate on helping children in need. Having had that dream fulfilled, he has returned to the industry he always loved by booking several great parts on \"Criminal Minds\" and \"The Defenders\" and is working on several of his own productions as well. He has had multiple starring roles in both film and television, as well as numerous guest-star and supporting roles throughout his career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2VjODdlZGEtMzRhNS00NTZiLWJkZTItMzFlMmI5N2Q2ZmEyXkEyXkFqcGdeQXVyODAwMzI0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0490855","name":"John Laughlin","idIMDB":"nm0490855"},"actorId":"nm0490855","character":"Gus","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrew Montanez","urlProfile":"http://www.imdb.com/name/nm4834346","urlPhoto":"","biography":{"bio":"Andrew Montanez was born and raised in Long Island. Is a lifelong martial artist and former professional MMA fighter. Has fought in some of the top companies in the world such as Strikeforce and in 2010 won the National Fighting Championship's Welterweight title. After accumulating over 25 professional bouts, he retired from competitive MMA and in 2010 moved to LA to pursue becoming an action hero. Transitioned smoothly into stunt work and acting and has worked on shows like CSI:NY and Touch and many other movies. Found his home as and fight choreographer/stunt coordinator and action director. He is also the host of MMA Surge, a popular martial arts teaching show on Youtube and works as a curator/producer for Pluto.TV. Some of his favorite projects have been the Robot Combat League, The Foam Weapon League and the High Fashion Action Short Film called Axiom.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4834346","name":"Andrew Montanez","nicknames":["The Squid"],"idIMDB":"nm4834346"},"actorId":"nm4834346","character":"Wallace","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Muto","urlProfile":"http://www.imdb.com/name/nm2502702","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNDg5MDg3OV5BMl5BanBnXkFtZTgwOTkxNDg0MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1977","placeOfBirth":" USA","height":"6' (1.83 m)","bio":"Chris Muto was born and raised in upstate New York. He started out professionally modeling in New York and Milan. After working with various top fashion designers including Tommy Hilfiger, Prada and Zegna, Chris transitioned into acting in 2005 when he booked his first on-screen job on Days of Our Lives playing opposite of Allison Sweeney. Following this, he landed his first play in Hollywood, The Graduate. Next came the lead in the play Brooklyn USA, and he hasn't looked back since. He has also booked several national commercials including McDonald's, Gateway, Charter Communications, Craftsman and Discover Card which was directed by Peter Berg. He recently Recurred on ABCs hit drama Greys Anatomy playing Nurse Michael. You can catch him playing opposite of Robert Patrick in Last Rampage set to be released in 2017. He has worked opposite of some of Hollywood's top actors such as Ryan Gosling in Drive, Alley Sheedy in Citizen Jane and James Remar in Decommissioned. Chris continues to work hard, having recently wrapped on a TV pilot that he wrote and produced called Meat.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNDg5MDg3OV5BMl5BanBnXkFtZTgwOTkxNDg0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2502702","name":"Chris Muto","idIMDB":"nm2502702"},"actorId":"nm2502702","character":"Ron","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nia Peeples","urlProfile":"http://www.imdb.com/name/nm0001604","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3ODMyMzA1NV5BMl5BanBnXkFtZTcwMDI3NjQ0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1961","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Virenia Gwendolyn Peeples","height":"5' 2\" (1.57 m)","bio":"Nia Peeples was born in Hollywood, California, on December 10, 1961. Her family moved to West Covina, California, where she and her two sisters, Paula and Cynthia, grew up. At eight years old she began performing with her family, giving concerts for community groups and conventions and doing dances of different cultures, Polynesian, Spanish and Irish. She attended West Covina High School and was an \"A\" student and a member of the marching band, involved in cheerleading, tumbling, volleyball, student government, choral singing and singing for a rock 'n roll band. She starred in the school production of \"South Pacific\" as Bloody Mary. She got her first standing ovation for her performance. She attended UCLA on a music scholarship, during which time she performed as Liberace's opening act in Las Vegas on weekends. She took one semester as a voice major, dropped out of UCLA and took three jobs in order to afford acting lessons. She studied singing with Gloria Rush and the Sanford Meisner acting technique at Playhouse West. She accompanied a friend to a rehearsal one day and was spotted by the producers, who cast her in the play \"Music Shop\". This led to guest appearances in such TV series as Hardcastle and McCormick (1983) and T.J. Hooker (1982). Her first starring role came when she played a deaf girl opposite William Atherton in the HBO film A Single Light (1981). She auditioned for and won the part of Nicole Chapman in the series Fame (1982). Her hobbies include hiking, tandem surfing, rollerblading and skiing. She also does a lot of charity work. She is of Scottish/Filipino descent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3ODMyMzA1NV5BMl5BanBnXkFtZTcwMDI3NjQ0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001604","name":"Nia Peeples","idIMDB":"nm0001604"},"actorId":"nm0001604","character":"Marta","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dalia Phillips","urlProfile":"http://www.imdb.com/name/nm1801062","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwODg0MzIxNTNeQTJeQWpwZ15BbWU3MDU5NTI4MDg@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"bio":"Dalia Phillips is an actress and producer, known for Akeelah and the Bee (2006), The Advocate (2013) and Dark Desire (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwODg0MzIxNTNeQTJeQWpwZ15BbWU3MDU5NTI4MDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1801062","name":"Dalia Phillips","idIMDB":"nm1801062"},"actorId":"nm1801062","character":"Nurse Khayla","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2343292","urlIMDB":"http://www.imdb.com/title/tt2343292","business":{"budget":{"money":"$1,800,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 25 min (85 min) (USA)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["16:9 HD"],"camera":["Red Epic, Zeiss Super Speed and Angenieux Optimo Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.8","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"TV-14","awards":[],"votes":"291","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0390635","name":"Shore Road Entertainment"},{"idCompany":"co0213776","name":"Everest Entertainment Group"},{"idCompany":"co0288542","name":"FishCorb Films"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:50:52"}}