{"data":{"movies":[{"title":"Smiling Through the Apocalypse","originalTitle":"","year":"2013","releaseDate":"20140912","directors":[{"name":"Tom Hayes","id":"nm5337398"}],"writers":[{"name":"Tom Hayes","id":"nm5337398"}],"runtime":"99 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3MDU0NDQwNzVeQTJeQWpwZ15BbWU4MDQ3NDgxNDIx._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Documentary","Biography","History"],"plot":"'Smiling Through the Apocalypse' chronicles a man whose editorial instincts produced one of the greatest magazines ever: Harold Hayes, the swinging editor and cultural provocateur of the iconic Esquire Magazine of the Sixties. Through the narrative of his son Tom, a journey ensues opening unprecedented access to some of the Esquire magazine's most compelling talents, from Nora Ephron to George Lois, and Tom Wolfe to Gore Vidal. The film is a story of risk, triumph, and challenge told by the people that helped make the magazine great, and a son who only come to understand his father's editorial greatness 23 years after his passing.","simplePlot":"'Smiling Through the Apocalypse' chronicles a man whose editorial instincts produced one of the greatest magazines ever: Harold Hayes, the swinging editor and cultural provocateur of the ... ","actors":[{"actorName":"Peter Bogdanovich","urlProfile":"http://www.imdb.com/name/nm0000953","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNzQ3NzAxMl5BMl5BanBnXkFtZTcwODQ5NDM5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1939","placeOfBirth":" Kingston, New York, USA","height":"5' 10\" (1.78 m)","bio":"Peter Bogdanovich was conceived in Europe but born in Kingston, New York. He is the son of immigrants fleeing the Nazis, Herma (Robinson) and Borislav Bogdanovich, a painter and pianist. His father was a Serbian Orthodox Christian, and his mother was from a rich Austrian Jewish family. Peter originally was an actor in the 1950s, studying his craft with legendary acting teacher Stella Adler and appearing on television and in summer stock. In the early 1960s he achieved notoriety for programming movies at the Museum of Modern Art in New York City. An obsessive cinema-goer, sometimes seeing up to 400 movies a year in his youth, Bogdanovich prominently showcased the work of American directors such as John Ford, about whom he subsequently wrote a book based on the notes he had produced for the MOMA retrospective of the director, and the then-underappreciated Howard Hawks. Bogdanovich also brought attention to such forgotten pioneers of American cinema as Allan Dwan. Bogdanovich was influenced by the French critics of the 1950s who wrote for Cahiers du Cinema, especially critic-turned-director François Truffaut. Before becoming a director himself, he built his reputation as a film writer with articles in Esquire Magazine. In 1968, following the example of Cahiers du Cinema critics Truffaut, Jean-Luc Godard, Claude Chabrol and Éric Rohmer who had created the Nouvelle Vague (\"New Wave\") by making their own films, Bogdanovich became a director. Working for low-budget schlock-meister Roger Corman, Bogdanovich directed the critically praised Targets (1968) and the not-so-critically praised Voyage to the Planet of Prehistoric Women (1968), a film best forgotten. Turning back to journalism, Bogdanovich struck up a lifelong friendship with the legendary Orson Welles while interviewing him on the set of Mike Nichols' film adaptation of Catch-22 (1970) from the novel by Joseph Heller. Subsequently, Bogdanovich has played a major role in elucidating Welles and his career with his writings on the great actor-director, most notably his book \"This is Orson Welles\" (1992). He has steadily produced invaluable books about the cinema, especially \"Who the Devil Made It: Conversations with Legendary Film Directors,\" an indispensable tome that establishes Bogdanovich, along with Kevin Brownlow, as one of the premier English-language chroniclers of cinema. The 32-year-old Bogdanovich was hailed by a critics as a Wellesian wunderkind when his most famous film, The Last Picture Show (1971) was released. The film received eight Academy Award nominations, including Bogdanovich as Best Director, and won two of them, for Cloris Leachman and \"John Ford Stock Company\" veteran Ben Johnson in the supporting acting categories. Bogdanovich, who had cast 19-year-old model Cybill Shepherd in a major role in the film, fell in love with the young beauty, an affair that eventually led to his divorce from the film's set designer Polly Platt, his longtime artistic collaborator and the mother of his two children. Bogdanovich followed up The Last Picture Show (1971) with a major hit, What's Up, Doc? (1972), a screwball comedy heavily indebted to Hawks' Bringing Up Baby (1938) and His Girl Friday (1940), starring Barbra Streisand and 'Ryan O'Neal'. Despite his reliance on homage to bygone cinema, Bogdanovich had solidified his status as one of a new breed of A-list directors that included Academy Award winners Francis Ford Coppola and William Friedkin, with whom he formed The Directors Company. The Directors Company was a generous production deal with Paramount Pictures that essentially gave the directors carte blanche if they kept within strict budget limitations. It was through this entity that Bogdanovich's next big hit, the critically praised Paper Moon (1973), was produced. Paper Moon (1973), a Depression-era comedy starring Ryan O'Neal that won his ten-year-old daughter Tatum O'Neal an Oscar as Best Supporting Actress, proved to be the highwater mark of Bogdanovich's career. Forced to share the profits with his fellow directors, Bogdanovich became dissatisfied with the arrangement. The Directors Company subsequently produced only two more pictures, Francis Ford Coppola's critically acclaimed The Conversation (1974) which was nominated for an Academy Award for Best Picture of 1974 and garnered Coppola an Oscar nod for Best Director, and Bogdanovich's Daisy Miller (1974), a film that had a quite different critical reception. An adaptation of the Henry James novella, Daisy Miller (1974) spelled the beginning of the end of Bogdanovich's career as a popular, critically acclaimed director. The film, which starred Bogdanovich's lover Cybill Shepherd as the title character, was savaged by critics and was a flop at the box office. Bogdanovich's follow-up, At Long Last Love (1975), a filming of the Cole Porter musical starring Cybill Shepherd, was derided by critics as one of the worst films ever made, noted as such in Harry Medved and Michael Medved's book \"The Golden Turkey Awards: Nominees and Winners, the Worst Achievements in Hollywood History\" (1980). The film also was a box office bomb despite featuring Burt Reynolds, a hotly burning star who would achieve super-nova status at the end of the 1970s. Once again beholden to the past, Bogdanovich insisted on filming the musical numbers for At Long Last Love (1975) live, a process not used since the early days of the talkies, when sound engineer Douglas Shearer developed lip-synching at Metro-Goldwyn-Mayer. The decision was widely ridiculed, as none of the leading actors were known for their singing abilities (Bogdanovich himself had produced a critically panned album of Cybill Shepherd singing Cole Porter songs in 1974). The public perception of Bogdanovich became that of an arrogant director hamstrung by his own hubris. Trying to recapture the lightning in the bottle that was his early success, Bogdanovich once again turned to the past, his own and that of cinema, with Nickelodeon (1976). The film, a comedy recounting the earliest days of the motion picture industry, reunited Ryan O'Neal and 'Tatum O'Neal' from his last hit, Paper Moon (1973) with Burt Reynolds. Counseled not to use the unpopular (with both audiences and critics) Cybill Shepherd in the film, Bogdanovich instead used newcomer Jane Hitchcock as the film's ingénue. Unfortunately, the magic of Paper Moon (1973) could not be repeated and the film died at the box office. Jane Hitchcock, Bogdanovich's discovery, would make only one more film before calling it quits. After a three-year hiatus, Bogdanovich returned with the critically and financially underwhelming Saint Jack (1979) for Hugh M. Hefner's Playboy Productions Inc. Bogdanovich's long affair with Cybill Shepherd had ended in 1978, but the production deal making Hugh M. Hefner the film's producer was part of the settlement of a lawsuit Shepherd had filed against Hefner for publishing nude photos of her pirated from a print of The Last Picture Show (1971) in Playboy Magazine. Bogdanovich then launched the film that would be his career Waterloo, They All Laughed (1981), a low-budget ensemble comedy starring Audrey Hepburn and the 1980 Playboy Playmate of the Year, Dorothy Stratten. During the filming of the picture, Bogdanovich fell in love with Stratten, who was married to an emotionally unstable hustler, Paul Snider, who relied on her financially. Stratten moved in with Bogdanovich, and when she told Snider she was leaving him, he shot and killed her, sodomizing her corpse before committing suicide. They All Laughed (1981) could not attract a distributor due to the negative publicity surrounding the Stratten murder, despite it being one of the few films made by the legendary Audrey Hepburn after her provisional retirement in 1967 (the film would prove to be Hepburn's last starring role in a theatrically released motion picture). The heartbroken Bogdanovich bought the rights to the negative so that it would be seen by the public, but the film had a limited release, garnered weak reviews and cost Bogdanovich millions of dollars, driving the emotionally devastated director into bankruptcy. Bogdanovich turned back to his first avocation, writing, to pen a memoir of his dead love, \"The Killing of the Unicorn: Dorothy Stratten (1960-1980)\" that was published in 1984. The book was a riposte to Teresa Carpenter's \"Death of a Playmate\" article written for The Village Voice that had won the 1981 Pulitzer Prize. Carpenter had lambasted Bogdanovich and Hugh M. Hefner, claiming that Stratten was as much a victim of them as she was of Paul Snider. The article served as the basis of Bob Fosse's film Star 80 (1983), in which Bogdanovich was portrayed as the fictional director \"Aram Nicholas\". Bogdanovich's career as a noted director was over, and though he achieved modest success with Mask (1985), his sequel to his greatest success The Last Picture Show (1971), Texasville (1990), was a critical and box office disappointment. He directed two more theatrical films in 1992 and 1993, but their failure kept him off the big screen until 2001's The Cat's Meow (2001). Returning once again to a reworking of the past, this time the alleged murder of director Thomas H. Ince by Welles' bete noir William Randolph Hearst, The Cat's Meow (2001) was a modest critical success but a flop at the box office. In addition to helming some television movies, Bogdanovich has returned to acting, with a recurring guest role on the cable television series The Sopranos (1999) as Dr. Jennifer Melfi's analyst. Bogdanovich's personal reputation suffered from gossip about his 13-year marriage to Dorothy Stratten's 19-year-old-kid sister Louise Stratten, who was 29 years his junior. Some gossip held that Bogdanovich's behavior was akin to that of the James Stewart character in Alfred Hitchcock's necrophiliac masterpiece Vertigo (1958), with the director trying to remold Stratten into the image of her late sister. The marriage ended in divorce in 2001. Now in his mid-60s, Bogdanovich clearly has imitated his hero Orson Welles, but in an unintended fashion, as a type of monumental failure much beloved by the mythmakers of Hollywood. However, unlike the widely acclaimed master Welles, the orbit of Bogdanovich's reputation has never recovered from the apogee it reached briefly in the early 1970s. There has been speculation that Peter Bogdanovich's ruin as a director was guaranteed when he ditched his wife and artistic collaborator Polly Platt for Cybill Shepherd. Platt had worked with Bogdanovich on all his early successes, and some critics believe that the controlling artistic consciousness on The Last Picture Show (1971) was Platt's. Parting company with Platt after Paper Moon (1973), Bogdanovich promptly slipped from the heights of a wunderkind to a has-been pursuing epic folly, as evidenced by Daisy Miller (1974) and At Long Last Love (1975). In 1998 the National Film Preservation Board of the Library of Congress named The Last Picture Show (1971) to the National Film Registry, an honor awarded only to the most culturally significant films. Viewing Daisy Miller (1974) alongside The Last Picture Show (1971) should be a standard part of film school curriculum, as it tends to debunk the auteur theory. Bogdanovich's career gives truth to the contention that film is an industrial process and each movie has many \"authors,\" not just one (the director). If the auteur theory were true, Bogdanovich arguably would have returned to form eventually and produced more good films, if not another masterpiece. He didn't - he didn't even come close. Thus, Bogdanovich will remain a footnote in cinema history, more valuable for his contributions to the literature of film than to the medium itself.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNzQ3NzAxMl5BMl5BanBnXkFtZTcwODQ5NDM5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000953","name":"Peter Bogdanovich","idIMDB":"nm0000953"},"actorId":"nm0000953","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nora Ephron","urlProfile":"http://www.imdb.com/name/nm0001188","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MTEyNDE0M15BMl5BanBnXkFtZTcwNzA5NjQwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 May 1941","placeOfBirth":" New York City, New York, USA","height":"5' 5\" (1.65 m)","bio":"Nora Ephron was educated at Wellesley College, Massachusetts. She was an acclaimed essayist (Crazy Salad 1975), novelist (Heartburn 1983), and had written screenplays for several popular films, all featuring strong female characters, such as anti-nuclear activist Karen Silkwood (Silkwood (1983), co-written with Alice Arlen) and a mobster's feisty independent daughter Cookie Voltecki (Cookie (1989), also co-written with Arlen). Ephron's hard-headed sensibilities helped make Rob Reiner's When Harry Met Sally... (1989) a clear-eyed view of modern romance, and she earned an Oscar nomination for her original screenplay. Ephron made her directorial debut with the comedy This Is My Life (1992), co-scripted by her sister Delia Ephron, which starred Julie Kavner as a single mother who struggles to establish herself as a stand-up comedienne. Ephron followed up by helming and co-writing Sleepless in Seattle (1993), a romantic comedy in which lovers Tom Hanks and Meg Ryan are separated for most of the film. Less about love than about love in the movies, the film drew inspiration from the beloved shipboard romance An Affair to Remember (1957), starring Cary Grant and Deborah Kerr. Ephron was the daughter of stage and screen-writing team Henry Ephron and Phoebe Ephron, who used her infancy as the subject of their play \"Three's a Family\" and based their comedy Take Her, She's Mine (1963) on letters their daughter wrote them from college. Their screenplays include There's No Business Like Show Business (1954), Carousel (1956) and Desk Set (1957). Formerly married to novelist Dan Greenburg and investigative journalist Carl Bernstein, Ephron was wed to crime journalist and screenwriter Nicholas Pileggi, at the time of her passing, who wrote such films as Goodfellas (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MTEyNDE0M15BMl5BanBnXkFtZTcwNzA5NjQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001188","name":"Nora Ephron","nicknames":["nor"],"idIMDB":"nm0001188"},"actorId":"nm0001188","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hugh M. Hefner","urlProfile":"http://www.imdb.com/name/nm0005005","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MzY1Mzk2OF5BMl5BanBnXkFtZTYwMDQxODQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1926","placeOfBirth":" Chicago, Illinois, USA","birthName":"Hugh Marston Hefner","height":"5' 9\" (1.75 m)","bio":"Hugh M. Hefner was born on April 9, 1926 in Chicago, Illinois, USA as Hugh Marston Hefner. He is a producer, known for The House Bunny (2008), Beverly Hills Cop II (1987) and Bettie Page Reveals All (2012). He has been married to Crystal Hefner since December 31, 2012. He was previously married to Kimberley Conrad and Mildred Williams.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MzY1Mzk2OF5BMl5BanBnXkFtZTYwMDQxODQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005005","name":"Hugh M. Hefner","nicknames":["Hef","Puffin"],"idIMDB":"nm0005005"},"actorId":"nm0005005","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gay Talese","urlProfile":"http://www.imdb.com/name/nm0848044","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NTY1MDg5Ml5BMl5BanBnXkFtZTgwMzQyMDU1MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1932","placeOfBirth":" Ocean City, New Jersey, USA","bio":"Gay Talese was born on February 7, 1932 in Ocean City, New Jersey, USA. He is a writer, known for Page One: Inside the New York Times (2011), Stranieri in America (1988) and Shortcut to Happiness (2003). He has been married to Nan Talese since June 10, 1959. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NTY1MDg5Ml5BMl5BanBnXkFtZTgwMzQyMDU1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0848044","name":"Gay Talese","idIMDB":"nm0848044"},"actorId":"nm0848044","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gore Vidal","urlProfile":"http://www.imdb.com/name/nm0000683","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTUxNjkzNF5BMl5BanBnXkFtZTYwNjY4NTM0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1925","placeOfBirth":" West Point, New York, USA","birthName":"Eugene Luther Gore Vidal","height":"5' 11½\" (1.82 m)","bio":"Gore Vidal was born Eugene Louis Vidal in 1925 in West Point, New York, to Nina (Gore) and West Point aeronautics instructor and aviation pioneer Eugene Luther Vidal. The Vidals endured a rocky marriage divorcing ten years after Gore's birth. Young Gore spent much of his childhood with his blind grandfather, Senator T.P. Gore of Oklahoma. Vidal would later become the confidant of Jacqueline Kennedy when Jacques mother married his former step father, Hugh D. Auchincloss. After graduating from Phillips Exeter Academy in 1943, Gore joined the US Army Reserves. Some of his Army experiences inspired his first novel, Williwaw, which was published when he was just 19. He dedicated the novel to J.T., a deceased prep-school friend. Subsequent novels would prominently feature gay male characters, and Gore found soon found his books had staying power on bestseller lists. In 1960, he unsuccessfully ran for Congress, backed by celebrity supporters like Paul Newman & Vidal's ex-fiancé Joanne Woodward. Another unsuccessful foray into politics would occur in 1982 when he ran for governor of California. In addition to being an accomplished writer, he is also a novice actor. His biggest roles to date have been in Gattaca (1997), Bob Roberts (1992), and With Honors (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTUxNjkzNF5BMl5BanBnXkFtZTYwNjY4NTM0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000683","name":"Gore Vidal","idIMDB":"nm0000683"},"actorId":"nm0000683","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Wolfe","urlProfile":"http://www.imdb.com/name/nm0004366","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNjEwMzc2MF5BMl5BanBnXkFtZTcwNzcxNjY3MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 March 1931","placeOfBirth":" Richmond, Virginia, USA","birthName":"Thomas Kennerly Wolfe Jr.","bio":"Tom Wolfe was born on March 2, 1931 in Richmond, Virginia, USA as Thomas Kennerly Wolfe Jr. He is a writer and actor, known for The Right Stuff (1983), Salinger (2013) and Bill Cunningham New York (2010). He is married to Sheila. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNjEwMzc2MF5BMl5BanBnXkFtZTcwNzcxNjY3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004366","name":"Tom Wolfe","idIMDB":"nm0004366"},"actorId":"nm0004366","character":"Himself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2466654","urlIMDB":"http://www.imdb.com/title/tt2466654","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"$4,198","country":"USA","day":"28","month":"09","year":"2014","remarks":""}],"weekendGross":[{"money":"$422","country":"USA","day":"28","month":"09","year":"2014","remarks":"1 Screen"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 39 min (99 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.9","metascore":"65","filmingLocations":[],"awards":[],"votes":"15","type":"Movie","companyCreditsSimple":[{"idCompany":"co0491627","name":"Big Mag"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:25:10"}}