{"data":{"movies":[{"title":"Alien Outpost","originalTitle":"Outpost 37","year":"2014","releaseDate":"20150130","directors":[{"name":"Jabbar Raisani","id":"nm2085752"}],"writers":[{"name":"Blake Clifton","id":"nm1910988"},{"name":"Jabbar Raisani","id":"nm2085752"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4ODY2MzIzNl5BMl5BanBnXkFtZTgwNTg3ODY0MzE@._V1.jpg","countries":["UK","South Africa"],"languages":["English"],"genres":["Action","Sci-Fi","Thriller"],"plot":"A documentary crew follows an elite unit of soldiers in the wake of an alien invasion.","simplePlot":"A documentary crew follows an elite unit of soldiers in the wake of an alien invasion.","actors":[{"actorName":"Reiley McClendon","urlProfile":"http://www.imdb.com/name/nm0565823","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg3ZTFiNTMtMDY3ZC00ODU2LTlkZjgtOTdjNzVmNDY4MjBiL2ltYWdlXkEyXkFqcGdeQXVyMjAyNTEwNjI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 March 1990","placeOfBirth":" Baton Rouge, Louisiana, USA","birthName":"Eric Reiley McClendon II","height":"6' 2\" (1.88 m)","bio":"Born in Baton Rouge, Louisiana, and raised in Roseland. Reiley McClendon first told his parents that he wanted to be an actor at the age of four. At six years old when he was still interested in acting his parents, Eric and Holly decided to allow and help Reiley to pursue his dream. After getting a local agent and working on some smaller projects Reiley's parents decided to try a pilot season in California. Reiley and his mother temporarily moved to Los Angeles for his first pilot season. By the end of this season his family decided to make the permanent move to California. After which, Reiley's career flourished. McClendon graduated Grace Brethren High School in June 2007. McClendon's favorite sports include cycling, golf, volleyball and baseball. He plays the drums, and is teaching himself to play the guitar.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjg3ZTFiNTMtMDY3ZC00ODU2LTlkZjgtOTdjNzVmNDY4MjBiL2ltYWdlXkEyXkFqcGdeQXVyMjAyNTEwNjI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0565823","name":"Reiley McClendon","idIMDB":"nm0565823"},"actorId":"nm0565823","character":"Andros","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adrian Paul","urlProfile":"http://www.imdb.com/name/nm0001600","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5MjM2NDQ1Ml5BMl5BanBnXkFtZTgwODM4ODE1MDE@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 May 1959","placeOfBirth":" London, England, UK","birthName":"Adrian Paul Hewett","height":"6' (1.83 m)","bio":"With over 30 films and 200 hours of television experience, versatility, discipline and a solid work ethic have been the underpinnings of Adrian's very successful 30-year acting career. Internationally recognized for his role as Duncan Macleod, in Highlander-The Series\", Adrian has also produced and directed both film and television projects. Born and raised in London, England, Adrian arrived in the United States in 1984, working as a choreographer and a model. After a year of taking acting classes with acting coaches, Ivana Chubbuck and Roy London, his first series role came on the ABC television show, The Colbys. This led to a role in the Broadway play, \"Bouncers\", in 1987, a guest role on the television show, Beauty and the Beast (1987) and his first film role in the film Last Rites (1988), with Tom Berenger. After a starring role in Roger Corman's,\" Masque of the Red Death \"(1989),he became a series regular in the second season of the television series \"War of the Worlds\"(1988), followed by four episode arc on the MGM, \"Dark Shadows\" series. Fast becoming known for his solid work ethic, CBS cast him as the lead in the television pilot, \"The Owl\" (1990). Although the series wasn't picked up, Adrian didn't stop working, guest starring on Angela Lansbury's \"Murder She Wrote\", and co starring opposite the up-and-coming Sandra Bullock in, \"Love Potion Number 9\". But it would be his next role that would bring him international recognition...that of \"Duncan MacLeod\" in the syndicated series, Highlander (1991-1997). During the 6 year run, Adrian directed four of the series' episodes, including the epic 100th episode, shot in Bordeaux France. Three of these episodes were voted in the top ten best of series for the 119 episode run. Although he was in demand when the series ended in 1997, Paul wanted to go back to his acting roots. After studying with renowned acting coach Larry Moss, he worked on John Landis' romantic comedy, \"Susan's Plan\", the action thriller, \"Dead Men Can't Dance\", and helped found Actors in Process, a theater group, where actors could meet weekly to showcase current work and receive positive critique from their peers. After two years, a production of an original play, \"Things Just Change\", was showcased at the Odyssey theater in Los Angeles, with Paul in the lead role. The success of the Highlander series however, was still current, leading Paul to be offered to star opposite Christopher Lambert in \"Highlander : Endgame\"(2000), to take over the franchise's lead position. Other films followed, including the now cult classic \"The Breed\" (2001), shot in Budapest, Hungary where Adrian met his future wife, Alexandra. In 2001, Lionsgate signed Adrian to a 3 picture deal, as well as to star in and executive produce the Sci Fi action thriller, \"Tracker\" (created by Gil Grant) for Lionsgate Television. With the advent of so many new media outlets however, the syndicated series was not renewed for a second season. Adrian continued to work on films such as \"Nemesis Game\" (Lionsgate) and \"Tides of War\", along with the Spelling Television and Paramount Pictures' hit TV series, \"Charmed\". This was the first time in thirteen years that Adrian had actually filmed again on US soil. In 2006 the Highlander Franchise was back again, this time filming in Lithuania, with Adrian starring in and Executive Producing, what would become his last sortie as Duncan Macleod, in \"Highlander :The Source\". After that came, \"The Legend of Roanoke\"(2007) and the Sci Fi Action Comedy \"The Immortal Voyages of Captain Drake\"(2009), a film in which Paul choreographed all the fight scenes. Always looking for interesting roles, Adrian found himself in Hungary and Tunisia, filming the Seven Arts production, \"Nine Miles Down\"(2009), that he now considers one of his most emotionally challenging roles. Next, he was off to London, in an out of character role, as a Conservative member of Parliament in the thriller, \"The Heavy \"(2010), with Gary Stretch, Stephen Rea and Christopher Lee. Also in 2010, Adrian co-founded his first production company Filmblips Inc. Since 2010, while working as an actor on several other films and TV movies, Adrian also wrote three screenplays, developed financial and artistic presentation packages for film and television, along with spearheading his charity, The Peace Fund, that he founded in 1997. Peace stands for Protect. Educate. Aid. Children. Everywhere. Over the past 17 years, Adrian has overseen the work of the fund in countries such as Romania, Bellarus, Niger, Hungary, Haiti, Cambodia, Thailand and the United States. In 2012, Adrian launched Peace Fund Radio that he co hosts with Ethan Dettanmaeir, with an estimated audience of between 1.8 and 2 million listeners a month. The innovative radio show, has been host to many celebrities with causes of their own and is the catalyst behind the Peace Fund's partnership and donation to bring computers into LAUSD schools. Through the radio shows influence the fund has also partnered with Kimberly Moore's,\" Adopt a Letter\" program to fulfill children's wishes at Christmas, brought books for libraries and lights for homes in El Salvador, along with connecting like minded charities to fulfill their initiatives. In 2015, Adrian helped launch his second production company, Radical Road, aimed at lower budget films, some of which Adrian is set to direct and act in. In 2016 Adrian has two movies, \"The Secret of Emily Blair\" and \"Stormageddon\", releasing and he is getting ready to direct his first feature, \"Chemical Influence\", a screenplay he wrote from an original script. Adrian also launched, \"The Sword Experience\" in 2016. Half day seminars of sword training, that include stage and real life combat and safety tips aimed at individuals, corporations, film, stage, re-enactment societies, martial artists and role playing groups. He is still married to Alexandra and they have two children together, Angelisa and Royce.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5MjM2NDQ1Ml5BMl5BanBnXkFtZTgwODM4ODE1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001600","name":"Adrian Paul","idIMDB":"nm0001600"},"actorId":"nm0001600","character":"General Dane","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rick Ravanello","urlProfile":"http://www.imdb.com/name/nm0712262","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc2MjYyMzQ3MV5BMl5BanBnXkFtZTgwMTg4NDc0MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 October 1967","placeOfBirth":" Cape Breton, Nova Scotia, Canada","birthName":"Richard Alexander Ravanello","height":"5' 10\" (1.78 m)","bio":"Rick Ravanello started his acting career back in 1996. Rick immediately started to earn many television and film roles which eventually lead to an audition that landed in the hands of Steven Spielberg of Dreamworks SKG. Mr. Spielberg quickly had Rick flown to Los Angeles where he met with Tom Hanks and Tony To. They discussed an upcoming project titled \"Band of Brothers\". Although Rick did not go on to film the mini-series, Mr. Spielberg offered Rick a deal to star in an upcoming Dreamworks television project. Since his arrival in L.A., Rick has since been very active. He earned a role in _Hart's War(2002)_ where he worked along side Bruce Willis in Prague, Czech Republic. \"The Cave\" put Rick back on screen with fellow \"Hart's War\" actor and friend Cole Hauser a couple of years later. Rick Ravanello has proved himself to be a very versatile performer with a range from character roles to the leading man. He has three younger brothers, Chris, Lawrence and Michael (Michael sustained a brain injury back in 1994 which has left him hospitalized since. Michael has since passed away). The loss of his youngest brother has been a life changer for him as he'll tell you. Rick has always been involved with many charitable groups ranging from those that support The United States Military to those supporting cancer patients and their families. He loves to play golf and is an avid practitioner of the Martial Arts. Muay Thai being his current passion. Rick resides in Southern California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc2MjYyMzQ3MV5BMl5BanBnXkFtZTgwMTg4NDc0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0712262","name":"Rick Ravanello","idIMDB":"nm0712262"},"actorId":"nm0712262","character":"Spears","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brandon Auret","urlProfile":"http://www.imdb.com/name/nm1409827","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyODkxODc5MzJeQTJeQWpwZ15BbWU4MDM0NjE4NjUx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Brandon Auret is an actor and producer, known for Elysium (2013), Chappie (2015) and District 9 (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyODkxODc5MzJeQTJeQWpwZ15BbWU4MDM0NjE4NjUx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1409827","name":"Brandon Auret","idIMDB":"nm1409827"},"actorId":"nm1409827","character":"Savino","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Douglas Tait","urlProfile":"http://www.imdb.com/name/nm1408752","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDY4OWNhMmYtMTA0Ny00MDlkLTgzZTEtY2Y4ZDVmMjY4YmJhXkEyXkFqcGdeQXVyNDU3ODAzMA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1978","placeOfBirth":" Tarzana, California, USA","birthName":"Douglas J. Tait","height":"6' 5\" (1.96 m)","bio":"Douglas Tait was born on December 17, 1978 in Tarzana, California, USA as Douglas J. Tait. He is known for his work on Star Trek (2009), Land of the Lost (2009) and Teen Wolf (2011). He has been married to Isabel Cueva since March 8, 2003.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDY4OWNhMmYtMTA0Ny00MDlkLTgzZTEtY2Y4ZDVmMjY4YmJhXkEyXkFqcGdeQXVyNDU3ODAzMA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1408752","name":"Douglas Tait","nicknames":["The Monster Man"],"idIMDB":"nm1408752"},"actorId":"nm1408752","character":"The Heavy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Reegan","urlProfile":"http://www.imdb.com/name/nm1235449","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNjI3ODkyNF5BMl5BanBnXkFtZTgwMDQ4MjkwNzE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"bio":"Joe will soon be seen in the feature film Outpost 37: Alien Outpost, directed by Emmy award winner, Jabbar Raisani. Outpost 37 tells a story of an elite unit of soldiers in the wake of a post-apocalyptic invasion. He is currently developing Craig Borten's, (writer of Dallas Buyer's Club), next feature film. Joe recently finished co-writing the film adaptation of the off Broadway play, Kid Champion, made famous by Christopher Walken during the 1970's. His previous feature credits include: the Sundance darling, I Melt With You, as part of a dynamic cast which included Carla Gugino, Thomas Jane, Jeremy Piven, Rob Lowe and BAFTA nominee Christian McKay. Joe's first experience with Sundance Film Festival was in 2005 where he made his debut starring in the Frank E. Flowers film Swallow, an Official Sundance Selection and multiple award-winning film. Immediately following the success of Swallow - Joe was cast in the controversial film titled Snuff Movie for cult director Bernard Rose. (Immortal Beloved). Joe played the memorable Pvt. Billy Babcock in George Romero's remake of The Crazies (directed by Breck Eisner). Joe's feature credits range from serious dramatic roles to action, broad comedy and genre. He has worked with a wide range of industry heavyweights including Academy Award winners Holly Hunter, Gary Sinese, Timothy Olyphant, Radha Mitchell, Annabella Sciorra -producers: Francis Ford Coppola, Rob Cohen, Neil Labute, and directors: Frank E. Flowers, Victor Salva, Eric Bross and Breck Eisner. Joe recently recurred on Chicago PD for NBC and in Luc Besson's, Taxi Brooklyn for NBC. Joe has recurred and done multi-episode arcs on the majority of prime-time's top ranked shows. Several of these include: CSI, CSI:NY, CSI:Miami , Cold Case, Without A Trace, The Whole Truth, Castle, Hawaii 5-0, NCIS, Criminal Minds, and the ABC pilot, Edgar Floats. His comedy TV credits include The Next Generation Wayans for BET and Hollywood Heights for Nickelodeon. Joe is recently wrapped filming CSI:Cyber opposite Patricia Arquette. Joe currently resides in Los Angeles and New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNjI3ODkyNF5BMl5BanBnXkFtZTgwMDQ4MjkwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1235449","name":"Joe Reegan","nicknames":["JR"],"idIMDB":"nm1235449"},"actorId":"nm1235449","character":"Omohundro","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stevel Marc","urlProfile":"http://www.imdb.com/name/nm2987241","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmEyMzI4MGQtNDhhMC00YzcwLThiNTAtYjVhZjg2YmU1ZTU3L2ltYWdlXkEyXkFqcGdeQXVyMTQyODU4Mjg@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Stevel Marc is the first of two children for Jasmine Williams and Carlton McDonald. He grew up in Portland, Jamaica where he attended Titchfield High School. His modeling career started when he was discovered professionally by Dwight Peters of Saint International Modelling Agency, shortly before he was honored as Mr. Titchfield 2000. This presented numerous opportunities with international modeling contracts jetting him off to London, New York, Asia, South Africa, and parts of Europe. He used South Africa as his hub where he is signed with the internationally recognized, Ice Model Management as well as Artist Connection theatrically and commercially. It was here that he began to shape and style his capabilities through various television and cinema commercials including Revlon (featuring Halle Berry and Eva Mendes), BlackBerry, Coca Cola, KFC, Nescafé, Momentum, Standard Bank, Nashua Mobile, South African Broadcasting Corporation (SABC), and DSTV. Stevel Marc also works as a voice over artist and has already lent his voice to Samsung Mobile, Budweiser, Malibu Caribbean Rum, Toyota, Highveld Stereo, Pigg's Peak Casino, Foundry Premium Cider, Spar, Pick 'n Pay, Standard Bank, Student radio, Exclusive Books, and The South African Tourism Board. He has emceed for Master Card, Heineken, Fashion Television International (FTV), De Beers, Standard Bank, MTN Go Rig (FIFA Confederations Cup), FIFA World Cup (Fan Fest and 22 World Cup games), Sony (World Cup Winners Trophy Tour), Calvin Klein, BlackBerry, Sansui Summer Cup, SAICA (South African Institute of Chartered Accountants), Cricket SA. He began auditioning for film roles in his early twenties in South Africa while shaping his craft at the Johannesburg Civic Theatre. In 2008 he enrolled at the New York Film Academy (NYFA) and TVI Actors Studio in Los Angeles, California to study and successfully completed his film studies. His first feature film role was in the internationally acclaimed and 13 Awards winner, Of Good Report. He also had remarkable roles in, The Challenger Disaster (2013) starring Oscar winner, William Hurt, OutPost 37 (2014), Dear Betty (2014), My Zulu Promise (2013), Donor (2014), The King's Rook (2014), The Triangle (2005), Anything for Wifey (2014), Trinity (2014), Hometown (2014), Adaption (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmEyMzI4MGQtNDhhMC00YzcwLThiNTAtYjVhZjg2YmU1ZTU3L2ltYWdlXkEyXkFqcGdeQXVyMTQyODU4Mjg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2987241","name":"Stevel Marc","idIMDB":"nm2987241"},"actorId":"nm2987241","character":"Righty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andy Davoli","urlProfile":"http://www.imdb.com/name/nm0205789","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE0NDU3MDQ4NjheQTJeQWpwZ15BbWU4MDcwNjAyNTkx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 September 1973","placeOfBirth":" Syracuse, New York, USA","birthName":"Andrew Michael Davoli","height":"5' 11\" (1.8 m)","bio":"Andy Davoli has been on stage since the age of six. He attended clown and magic school as a teen and eventually made his way to New York City. He began his formal acting training at the famed Stella Adler Academy, and was quickly discovered by Martin Scorsese, who cast him in a small role in Bringing Out the Dead (1999). He continued his career working opposite top talents such as Joaquin Phoenix, Mark Wahlberg and Charlize Theron in The Yards (2000). After an audition for the critically acclaimed HBO series The Sopranos (1999), series creator David Chase wrote the recurring role of Dino Zerilli for him in the third season of the show. His passion and irreverence grabbed the attention of playwright David Mamet, who immediately cast him in the room after auditioning for Spartan (2004). Next, Davoli beat out hundreds of other actors for the coveted role of \"Scarpa\" in New Line Cinema's Knockaround Guys (2001). Brian Koppelman and David Levein cast him in the lead role opposite 'Dennis Hopper (I)', John Malkovich and Vin Diesel. This led to the lead role of \"Basil\" in the George Clooney and Steven Soderbergh comedy Welcome to Collinwood (2002). He continued to prove himself as a multi-faceted actor in the role of Jake Perini opposite Kenneth Branagh and Cynthia Nixon in the Golden Globe-nominated HBO miniseries Warm Springs (2005). Davoli's dark good looks were used to stunning effect in a Stephen Meisel-shot Dolce & Gabbana campaign opposite international supermodel Gisele Bündchen. His starring turn in the neoclassic short film Lucky Clown (2007) paved the way for the film to premiere at both the 2007 Cannes Film Festival and the Venice Film Festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE0NDU3MDQ4NjheQTJeQWpwZ15BbWU4MDcwNjAyNTkx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0205789","name":"Andy Davoli","nicknames":["Andy"],"idIMDB":"nm0205789"},"actorId":"nm0205789","character":"Savino","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sven Ruygrok","urlProfile":"http://www.imdb.com/name/nm3922085","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGI4YjViOGQtZWU0ZS00YTZmLWExYTQtYmE5N2U0YmYyZTEwXkEyXkFqcGdeQXVyMjMyOTE0NjQ@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 6¼\" (1.68 m)","bio":"Dynamic 19 year-old Sven Ruygrok graduated from Beaulieu College in 2009 with two distinctions - one of them in his favorite subject, Drama. A natural leader, Sven was Deputy Head Boy and was awarded Full Drama Colours. Until recently, he was involved in Men's Artistic Gymnastics and received his Junior Protea Colours in this sport. He is a wonderful all-round performer and this was recognized early on in his life as he successfully auditioned for Cirque du Soleil in 2005. His abilities were also more recently acknowledged by the judges in the ACT/ Dalro Performing Arts Scholarship last year, where he was one of the 6 national finalists. 2010 saw Sven enroll as a student at University of Cape Town where he had been accepted for a Degree in Theatre and Performance, but he deferred his studies when he won the role of Rambo in Spud: The Movie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGI4YjViOGQtZWU0ZS00YTZmLWExYTQtYmE5N2U0YmYyZTEwXkEyXkFqcGdeQXVyMjMyOTE0NjQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3922085","name":"Sven Ruygrok","idIMDB":"nm3922085"},"actorId":"nm3922085","character":"Frankie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matthew Holmes","urlProfile":"http://www.imdb.com/name/nm2120271","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NTI3NzkyOF5BMl5BanBnXkFtZTcwNjk2OTI4OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1976","placeOfBirth":" Albury, New South Wales, Australia","bio":"Matthew Holmes was born on July 17, 1976 in Albury, New South Wales, Australia. He is an actor, known for Sea Patrol (2007), Blue Heelers (1994) and True Blood (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NTI3NzkyOF5BMl5BanBnXkFtZTcwNjk2OTI4OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2120271","name":"Matthew Holmes","nicknames":["Matty"],"idIMDB":"nm2120271"},"actorId":"nm2120271","character":"North","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nic Rasenti","urlProfile":"http://www.imdb.com/name/nm3797176","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MTc5OTkzNl5BMl5BanBnXkFtZTgwMjA2ODAxNDE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Nic is known for his very action orientated role as Battle Ready \"Harty\" in the documentary styled, high octane Alien Outpost: 37 (IFC). In addition, his TV experience includes working on world wide airing series such as: Starz costume drama Black Sails as \"Mr Holmes\" and Syfys Dominion as \"O'Connor\". Nic Just finished shooting a featured role in the BBC 6 part mini series Undercover, playing alongside Sophie Okonedo. In 2015 Nic shot the highly acclaimed book adapted Pilot for Clan Of The Cave Bear as \"Zoug\" for Lifetime in conjunction with Imagine, Lionsgate and Fox, produced by Ron Howard. After starring in several prime time TV series and feature films Nic, has set his eyes firmly on American shores, looking to further his acting career and as he puts it, \"playing more questionable characters.\" Nic Rasenti is a South African born actor currently living in the coastal city of Cape Town. He trained at AFDA and coached by some of South Africa's top industry professionals. After Graduating in 2010 he landed his first feature role in Sony Pictures third installment of the Sniper franchise, Sniper Reloaded, as the young rookie \"Vincent Capabianco\" working with Director Claudio Fåh.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MTc5OTkzNl5BMl5BanBnXkFtZTgwMjA2ODAxNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3797176","name":"Nic Rasenti","idIMDB":"nm3797176"},"actorId":"nm3797176","character":"Harty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kenneth Fok","urlProfile":"http://www.imdb.com/name/nm3022996","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIzMTE4ODI0Nl5BMl5BanBnXkFtZTgwOTcxNjk5ODE@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"After establishing himself on local small and big screens, South African actor Kenneth Fok has firmly worked his way into roles reaching a mainstream audience worldwide in Safe House (2012) and Eye in the Sky (2016). His versatility has led him to performances with William H. Macy in The Deal (2008) to Idris Elba and Matthew McConaughey in The Dark Tower (2017). Whilst still working on homegrown projects playing the formidable villain Chang in Night Drive (2010), he was cast in several series including Strike Back (2011), Dominion (2014) and Homeland (2014). Son of a vegetable farmer and housewife and the youngest of seven siblings, Kenneth was born on May 21, 1974 in Germiston, Johannesburg. After turning down the opportunity to partake in the family business he studied acting then moved to London where he landed a role as an extra on the Bond movie Die Another Day (2002). After his return he worked with the well-known South African icon Pieter-Dirk Uys in his successful stage play Macbeki playing four different characters. He also tried his luck in the long running local magazine programme Top Billing for their new Presenter Search Competition beating 8000 hopefuls and making it to the top four.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIzMTE4ODI0Nl5BMl5BanBnXkFtZTgwOTcxNjk5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3022996","name":"Kenneth Fok","idIMDB":"nm3022996"},"actorId":"nm3022996","character":"Zilla","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Darron Meyer","urlProfile":"http://www.imdb.com/name/nm2378861","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyNzE3Nzg0N15BMl5BanBnXkFtZTgwNTIzNjQwOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 July 1977","placeOfBirth":" Johannesburg, South Africa","birthName":"Darron Meyer","height":"5' 11¾\" (1.82 m)","bio":"Born in 1977 in the city of Johannesburg in South Africa. Darron first studied a degree in Quantity Surveying at the Cape Technikon in Cape Town. After attaining his qualification, his passion for film and stage led him to quit his job and return to his studies, only this time, to be trained as an actor. He currently lives and works out of Cape Town. 29 June 2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyNzE3Nzg0N15BMl5BanBnXkFtZTgwNTIzNjQwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2378861","name":"Darron Meyer","idIMDB":"nm2378861"},"actorId":"nm2378861","character":"Hollis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Guido Baechler","urlProfile":"http://www.imdb.com/name/nm2713790","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NzI1Mjg1Ml5BMl5BanBnXkFtZTcwNjc2NTExNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Guido Baechler is a producer and actor, known for A Million Miles from Home: A Rock'n'Roll Road Movie (2016), Battle for Terra (2007) and Delgo (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NzI1Mjg1Ml5BMl5BanBnXkFtZTcwNjc2NTExNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2713790","name":"Guido Baechler","idIMDB":"nm2713790"},"actorId":"nm2713790","character":"Lt Perry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott E. Miller","urlProfile":"http://www.imdb.com/name/nm2117015","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NDU0MjQ0M15BMl5BanBnXkFtZTgwOTA0NTg3NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 March 1975","placeOfBirth":" Windsor, Ontario, Canada","height":"6' (1.83 m)","bio":"Scott Edward Miller was born in Windsor, Ontario, Canada. He graduated from the University of Windsor with a degree in Science and was a record setting wide receiver for the Windsor Lancer Football team. Moving to Vancouver in 2000 he studied at the acclaimed Lyric School of Acting and began his career on the stage, first by performing in numerous original plays and then moving on to writing and directing his own shows. His credits include the critically acclaimed 'In the Eyes of God', and as the title character in the one-man play 'Walter', both written and directed by Raul Sanchez Inglis. Scott followed this with various film and television roles, and will now be playing one of the lead roles in Jabbar Raisani's feature film, Outpost 37, which is slated to hit movie theatres in 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NDU0MjQ0M15BMl5BanBnXkFtZTgwOTA0NTg3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2117015","name":"Scott E. Miller","idIMDB":"nm2117015"},"actorId":"nm2117015","character":"Wilks","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2474972","urlIMDB":"http://www.imdb.com/title/tt2474972","business":{"budget":{"money":"$4,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"29","month":"04","year":"2013","remarks":null},{"money":null,"country":null,"day":"10","month":"06","year":"2013","remarks":null}],"copyrightHolder":"© [2013] Outpost 37 Films Limited (on print)"},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.8","metascore":"26","filmingLocations":[{"location":"Johannesburg, South Africa"}],"rated":"NOT RATED","awards":[],"votes":"5,429","type":"Movie","companyCreditsSimple":[{"idCompany":"co0428939","name":"Bigscope Films"},{"idCompany":"co0398856","name":"Altitude Film Entertainment"},{"idCompany":"co0250636","name":"Out of Africa Entertainment"}],"keywords":{"keywords":["independent film","alien","alien invasion","soldier","ends with historical notes","hero","documentary style","resupply","demolition","scar","shot three times","flare","funeral","flag at half mast","american flag","aerial drone","taken prisoner","energy beam weapon","weight lifting","fairchild republic a 10 thunderbolt ii","throat cut","firefight","gi joe action figure","bug bite","alvis fv603 saracen","pakistan","bullet","uh 1 huey helicopter","year 2021","homoerotic","helmet camera","what happened to epilogue","sniper","human experiment","ambush","pony","goat","airplane","alien abduction","escape","desert","plane crash","drone","interview","translator","mind control","disobeying orders","photograph","rescue mission","mission","rescue","held at gunpoint","hostage","kidnapping","prisoner of war","mercenary","army base","afghanistan","outpost","fictional war","sergeant","lieutenant","suspense","captain","general","autopsy","filmed killing","cameraman","documentary filmmaker","dystopia","news report","2030s","2020s","scene after end credits","surprise after end credits","docudrama","self sacrifice","abandoned mine","electromagnetic pulse","laser gun","ufo","alien contact","corpse","german","australian","practical joke","f word","all male cast","male camaraderie","special forces","u.s. army","military","suicide bomber","bomb","hand grenade","bazooka","rocket launcher","night vision","binoculars","grenade launcher","gatling gun","ak 47","shotgun","c4 explosives","dynamite","assault rifle","machine gun","armored car","knife","pistol","torso cut in half","severed leg","severed arm","exploding head","exploding airplane","exploding body","explosion","blood splatter","blood","shot to death","shot in the leg","shot in the back","shot in the chest","shot in the arm","shot in the forehead","shot in the head","shootout","gunfight","battlefield","battle","combat","violence","death","murder","military life","insurgent"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 04:11:02"}}