{"data":{"movies":[{"title":"Christmas Bounty","originalTitle":"","year":"2013","releaseDate":"20131126","directors":[{"name":"Gil Junger","id":"nm0432627"}],"writers":[{"name":"Claudia Grazioso","id":"nm1257282"},{"name":"Andrew Black","id":"nm1321917"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NTQ1NjQ5Ml5BMl5BanBnXkFtZTgwMTQwNjU0MDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Comedy"],"plot":"A former bounty hunter turns into an elementary schoolteacher. Determined to have a normal life and keep her bounty hunter past a secret, she reluctantly returns home for Christmas to help save the family business by catching the one bounty that got away. But when her fiancé follows her home for the holiday, she struggles to hide her wild family business and a bounty hunter ex-boyfriend she thought she'd left behind.","simplePlot":"A former bounty hunter turns into an elementary schoolteacher. Determined to have a normal life and keep her bounty hunter past a secret, she reluctantly returns home for Christmas to help ... ","actors":[{"actorName":"Francia Raisa","urlProfile":"http://www.imdb.com/name/nm2116006","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2OTUyNzQ0NV5BMl5BanBnXkFtZTcwOTIwMTQyNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1988","placeOfBirth":" Los Angeles, California, USA","birthName":"Francia Raisa Almendárez","height":"5' 3\" (1.6 m)","bio":"Francia Raisa is a Gracie Award and La Femme Film Festival Rising Star Award recipient and a 2012 Teen Choice, IMAGEN and an ALMA award nominee for her portrayal of Adrian Lee on ABC Family's critically acclaimed series The Secret Life of the American Teenager (2008) and she continues to prove herself as a star on the rise. She was featured on the August cover of \"Backstage\" magazine as one of Young Hollywood's top Latinos in American TV and film, further cementing her status as a star to watch. Francia was born and raised in Southern California to mother Virginia Almendarez of Mexico and father Maximo Renán Almendariz Coello of Honduras (one of the most recognized radio personalities and #1 Latino DJs in Los Angeles). At age five Francia began taking dance lessons in all styles from tap to jazz to acrobatics to hip-hop and Polynesian. She also trained in karate and ice skating. Looking to expand her talents during her junior year of high school, she decided to take up both acting and modeling. She started to get noticed and soon began to model for print ads and national commercials. A month into her senior year of high school Francia booked her first lead role, starring opposite Hayden Panettiere in Bring It On: All or Nothing (2006). Not long after wrapping \"Bring it On,\" Francia booked the lead female role of MGM's made-for-TV movie shown on ABC Family, The Cutting Edge 3: Chasing the Dream (2008) before ultimately landing her breakout role as Adrian Lee in ABC Family's award-winning \"The Secret Life of the American Teenager.\" Created by Brenda Hampton (7th Heaven (1996)), the program broke all records for an original series on the network, including taking the #1 spot in its time slot for cable TV when it premiered in summer of 2008. The show is on its fifth season, and continues to be one of the most popular teen TV shows. In addition to her success on television, Francia made her return to the big screen in Chastity Bites (2013), a horror film. She has also wrapped production on Beyond Paradise (2016), alongside Daphne Zuniga and Ryan Guzman. She resides in the Los Angeles area and continues to stay true to her dancing roots with weekly advance classes at a dance studio in Hollywood. She strives to be a role model for all her female fans. In her spare time she works to raise awareness on important causes such as hunger, domestic violence, sex trafficking and female empowerment.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2OTUyNzQ0NV5BMl5BanBnXkFtZTcwOTIwMTQyNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2116006","name":"Francia Raisa","idIMDB":"nm2116006"},"actorId":"nm2116006","character":"Tory Bell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike 'The Miz' Mizanin","urlProfile":"http://www.imdb.com/name/nm1025616","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MTU5NDI5OF5BMl5BanBnXkFtZTcwMDQxNzU1OQ@@._V1_UY44_CR19,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 October 1980","placeOfBirth":" Parma, Ohio, USA","height":"6' 1¼\" (1.86 m)","bio":"Michael \"The Miz\" Mizanin was born in Cleveland, OH on October 8th, 1980 to Barbara and George Mizanin. He graduated with honors from Normandy High School before attending Miami University of Ohio (where he was a member of the Theta Chi Fraternity). While in college, he auditioned for The Real World after seeing a casting call on MTV. Despite doubts about his ability to perform on a reality show, Mike went on to become one of the most popular cast members of the show's 10th Season, subtitled \"Back to New York.\" It was on this show where he debuted his wrestling alter ego: \"The Miz.\" In the years following, Mike \"The Miz\" became a mainstay on MTV, hosting various popular shows on the network and competing on The Real World's sister show, \"Real World/Road Rules.\" \"The Miz\" went from alter ego to reality after Mike moved to Los Angeles, where he auditioned for the WWE's \"Tough Enough.\" Despite finishing in second place, Mike's performance impressed the WWE executives enough for them to grant him a developmental contract. In the 12 years and counting that followed, The Miz has become one of WWE's biggest stars. He has won the WWE, US, Intercontinental, and Tag Team titles (making him the 25th Triple Crown and 14th Grand Slam Champion in the history of the WWE). In addition to his wrestling stardom, Mike has established a robust film career as well. He is best known for playing Sgt. Jake Carter in \"The Marine 3: Homefront\" and \"The Marine 4: Moving Target.\" The next film in the series (\"The Marine 5: Battleground\") is set to be released in 2017.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MTU5NDI5OF5BMl5BanBnXkFtZTcwMDQxNzU1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1025616","name":"Mike 'The Miz' Mizanin","nicknames":["The Miz","\"The Awesome One\"","\"The Chick Magnet\"","The Grand Mizard of Lust"],"idIMDB":"nm1025616"},"actorId":"nm1025616","character":"Mike 'Mikey Muscles'","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Will Greenberg","urlProfile":"http://www.imdb.com/name/nm1435603","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTA2MjY4MV5BMl5BanBnXkFtZTYwOTY0Mjky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Will Greenberg is an actor best known for playing Todd on TBS's new hit comedy Wrecked. He's also very popular among \"bros\" worldwide for his portrayal of brociopath Stan Halen on Workaholics. He can recite Shakespeare as Matthew McConaughey and sell Subway sandwiches as Denzel Washington. He attended the University of Southern California where he ironically won a Doolittle award for Outstanding Achievement in Acting. He continues to do little yet achieve a lot when it comes to crushing acting roles big and small. If you're looking for someone to steal a scene on television, film, or theatre look no further than the man the myth, Will \"The Thrill\" Greenberg. He also has dimples and can play a mean harmonica.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTA2MjY4MV5BMl5BanBnXkFtZTYwOTY0Mjky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1435603","name":"Will Greenberg","idIMDB":"nm1435603"},"actorId":"nm1435603","character":"James","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Hanus","urlProfile":"http://www.imdb.com/name/nm2010074","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MzkwOTI1N15BMl5BanBnXkFtZTgwNTM4MDIyOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Michael Hanus is an actor and director, known for Arrow (2012), Jackhammer (2014) and Christmas Bounty (2013). He has been married to Silvana Azurdia since July 30, 2005.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MzkwOTI1N15BMl5BanBnXkFtZTgwNTM4MDIyOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2010074","name":"Michael Hanus","idIMDB":"nm2010074"},"actorId":"nm2010074","character":"Hawk Bell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"April Telek","urlProfile":"http://www.imdb.com/name/nm0854304","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMTUzOTc4Ml5BMl5BanBnXkFtZTgwNTAxMzgzNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1975","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"April Amber Telek","height":"5' 8\" (1.73 m)","bio":"Award-winning film & television actress April Telek was born and raised in North Vancouver, British Columbia. After landing her first modeling gig at the age of ten, April quickly realized her love for the camera, and while growing up as a child actor and international model, April was enrolled in a \"Super Achievers\" program designed specifically for kids with professional careers in school. Upon graduation, she decided to commit herself full-time to \"the craft\" and hasn't stopped working since. In 1994, April went on to win the title of \"Miss Canada\", which took her to 17 international competitions, including \"Miss Asia Pacific\" in the Philippines, and \"Miss Top Model of the World\" in Istanbul, Turkey. She has also had the honor of being titled \"Hottest Canadian Talent\" on the web and was voted \"First Wave Babe of the Month\" on more than one occasion. April's longevity as a film and television actor has led her to work on numerous projects over the years. She has worked with some of Hollywood's top A-List talent in feature films such as Mr. Troop Mom (2009) (George Lopez, Jane Lynch), Gray Matters (2006) (Heather Graham, Molly Shannon), and White Noise (2005) (Michael Keaton), just to name a few. April's television credits include a recurring role as \"Nell\" on AMC's highly-anticipated Hell on Wheels: L'Enfer de l'Ouest (2011), and co-starring in CTV's Canadian hit show, Robson Arms (2005), for the last two seasons as \"Sasha\". Her most recent television appearances include Hallmark Hall of Fame's Duke (2012), Disney's Radio Rebel (2012) (aka \"Shrinking Violet\"), as well as being featured, along with her beautiful home, on MTV Cribs (2000). Some of the roles April is most proud of include A&E's Emmy Award-winning MOW, 11 septembre - Le détournement du vol 93 (2006), where she played \"Liz Glyk\", the wife of one of the heroes/passengers on the ill-fated United Flight 93 that met its demise on September 11th, \"Cathy Evelyn Smith\" (the last person to see John Belushi alive), in Behind the Camera: The Unauthorized Story of Mork & Mindy (2005) (aka \"The Mork & Mindy Story\") for NBC, and most recently as \"Jana\" in Amazon Falls (2010), for which April won a number of awards. Despite her hectic schedule between acting and being a mom, April served as a director on the board for the Lions Gate Hospice Society for 3 years. She became passionate about the Hospice Society when her aunt was diagnosed with a terminal illness and passed away at St. James Cottage Hospice in Vancouver. April was very involved in the capital campaign to raise funds (over 7 million dollars) for the first free-standing hospice on the North Shore. April has also been involved with her church's outreach program for the Downtown Eastside and supports The Canadian National Institute for the Blind, Operation Smile and Canuck Place charities. April resides on the North Shore in her recently designed and renovated home with her husband, Jamie Campbell, and daughter, Ava Marie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMTUzOTc4Ml5BMl5BanBnXkFtZTgwNTAxMzgzNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0854304","name":"April Telek","nicknames":["Apes","Bunny"],"idIMDB":"nm0854304"},"actorId":"nm0854304","character":"Gale Bell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott Patey","urlProfile":"http://www.imdb.com/name/nm2814333","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzOTEyNDA2NDleQTJeQWpwZ15BbWU4MDg0NTI0MTAy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Scott Patey is an actor, known for Monster Trucks (2016), The Big Year (2011) and The Odds (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzOTEyNDA2NDleQTJeQWpwZ15BbWU4MDg0NTI0MTAy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2814333","name":"Scott Patey","idIMDB":"nm2814333"},"actorId":"nm2814333","character":"Bones","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aleks Paunovic","urlProfile":"http://www.imdb.com/name/nm0006820","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc3NDI1ODIyOF5BMl5BanBnXkFtZTgwNTI0MTk1NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1969","placeOfBirth":" Winnipeg, Manitoba, Canada","height":"6' 5\" (1.96 m)","bio":"Aleks Paunovic was born in Winnipeg, Manitoba to a Croatian mother and Serbian father. The result of this remarkable blend of bloodlines is the 6'5\" ruggedly handsome actor appearing on screens around the world at a rapidly escalating rate. Acting came to Aleks while he was onstage in his hometown playing in a heavy metal band, his livelihood since he was 16. Remarkably the role offered was one completely against type as it was that of Roddy McDowall's butler in the 1994 TV movie 'Heads'. Now bitten with the acting bug, Aleks combined his athleticism from his lifetime of boxing - he claims that he started boxing in the womb as all of the men in his family are boxers - and turned it into a very busy career as a stunt actor. In 2001 Aleks stopped in Vancouver on his way to Los Angeles with an impressive resume and ready to take on Hollywood when the most horrible event in America's recent history struck. 911 changed the way anyone could enter the states and so Aleks found himself a new home and career in busy Vancouver. Since coming to Vancouver Aleks has built an amazing resume with over 100 credits, most of which are lead and recurring roles like the one that he has on this hugely anticipated 4th season of 'Continuum'. Aleks credits three occurrences as the game-changers in his rocketing career: One was when the venerable acting coach Larry Moss called him out in front of 300 actors, telling him that he had massive talent and demanding to see his full range; another was when he respectfully declined an offer for a 4-episode-arc on a highly-rated TV series so that he could finish his run as 'Danny' in the play \"Danny and the Deep Blue Sea\" in a shaky old theatre to sold-out crowds. But the biggest catalyst in Aleks's career was when he fought three rounds of casting throughout all of Los Angeles and Vancouver to win the role of 'Tom', a developmentally disabled man accused of murder in 'Personal Effects' starring Ashton Kutcher, Michelle Pfieffer, and Kathy Bates. Aleks put on 65 pounds to perform the role, which was one of the most challenging and rewarding roles of his career so far. When you meet Aleks, or you watch him perform these difficult roles, you just know that with all of that leading man charisma there's star power in this man, and that you will be seeing a lot more of Aleks Paunovic.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc3NDI1ODIyOF5BMl5BanBnXkFtZTgwNTI0MTk1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006820","name":"Aleks Paunovic","idIMDB":"nm0006820"},"actorId":"nm0006820","character":"Manucci","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chelan Simmons","urlProfile":"http://www.imdb.com/name/nm0799706","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDc5Mzk5OV5BMl5BanBnXkFtZTcwNjg5MDQ4Nw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1982","placeOfBirth":" Vancouver, British Columbia, Canada","height":"5' 4\" (1.63 m)","bio":"Chelan Simmons was born in Vancouver, Canada. One of three children (one older brother and an older sister), she has been a natural performer since the age of 2. Her first movie role was as the title creature's first victim, Laurie Ann Winterbarger, in Stephen King's It (1990). Her most recognizable roles are in Destination finale 3 (2006) as Ashley Freund, and in Carrie (2002) and Monster Island (2004). She has also guest-starred in episodes of Smallville (2001) and Supernatural (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDc5Mzk5OV5BMl5BanBnXkFtZTcwNjg5MDQ4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0799706","name":"Chelan Simmons","nicknames":["Lanners"],"idIMDB":"nm0799706"},"actorId":"nm0799706","character":"Liz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Keith Dallas","urlProfile":"http://www.imdb.com/name/nm0198040","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjIyNDk0MTU3MV5BMl5BanBnXkFtZTgwMDE1ODM2NDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Keith Dallas is an actor, known for Des serpents dans l'avion (2006), Mission: Impossible - Ghost Protocol (2011) and I Spy (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjIyNDk0MTU3MV5BMl5BanBnXkFtZTgwMDE1ODM2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0198040","name":"Keith Dallas","idIMDB":"nm0198040"},"actorId":"nm0198040","character":"Leopold","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Malcolm Stewart","urlProfile":"http://www.imdb.com/name/nm0829121","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0ODI5NTUzOV5BMl5BanBnXkFtZTcwNjYwNDAzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 May 1948","placeOfBirth":" Montreal, Quebec, Canada","height":"6' 2\" (1.88 m)","bio":"After graduating from the University of Vermont and attending Columbia University Graduate School in New York, Malcolm Stewart made his Broadway debut in \"Dracula\" with Frank Langella. Other Broadway shows include \"Bedroom Farce\" and \"Torch Song Trilogy\". He is a licensed pilot, a proud father of a Summa Cum Laude graduate in Economics and is a citizen of three countries. Recently, he was honored to be the only actor featured in three films at the prestigious 2009 Sundance Film Festival. \"Moon\" with Sam Rockwell, \"Grace\" a psychological thriller and \"Helen\" with Ashley Judd. He is married to Dr. Thecla Schiphorst.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0ODI5NTUzOV5BMl5BanBnXkFtZTcwNjYwNDAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0829121","name":"Malcolm Stewart","idIMDB":"nm0829121"},"actorId":"nm0829121","character":"Gray Ballantine","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karen Kruper","urlProfile":"http://www.imdb.com/name/nm0472772","urlPhoto":"","biography":{"bio":"Karen Kruper is known for her work on Scary Movie (2000), Un fiancé qui tombe à pic (2016) and Far from Home: The Adventures of Yellow Dog (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0472772","name":"Karen Kruper","idIMDB":"nm0472772"},"actorId":"nm0472772","character":"Dina Ballantine","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sean Quan","urlProfile":"http://www.imdb.com/name/nm5883582","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MDI1MzAyMl5BMl5BanBnXkFtZTgwODI4OTY3MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 2003","placeOfBirth":" Vancouver, British Columbia, Canada","height":"5' 1\" (1.55 m)","bio":"Sean Quan enrolled in his first acting class at the age of 8, where he soon displayed a talent and a joy for performing in front of the camera. His first booking was a Walmart TV commercial, and he has been happily juggling his acting career with his schoolwork, sports, music, and video games ever since. Sean's favorite on-set experiences include working with actors Raugi Yu in \"8 Minutes Ahead\", Ryan Reynolds in \"Deadpool\", and Michael Rosenbaum in \"Impastor\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MDI1MzAyMl5BMl5BanBnXkFtZTgwODI4OTY3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5883582","name":"Sean Quan","idIMDB":"nm5883582"},"actorId":"nm5883582","character":"Bobby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Yi","urlProfile":"http://www.imdb.com/name/nm3041924","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMTA4NjM0MF5BMl5BanBnXkFtZTgwNjY2NzgzNzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"James Yi is an actor and producer, known for The Interview (2014), Colossal (2016) and The Bleeding Edge (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMTA4NjM0MF5BMl5BanBnXkFtZTgwNjY2NzgzNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3041924","name":"James Yi","idIMDB":"nm3041924"},"actorId":"nm3041924","character":"Bobby's Father","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Natalie Gibson","urlProfile":"http://www.imdb.com/name/nm0317131","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0NDA2OTcyNzReQTJeQWpwZ15BbWU4MDU0NDA2NTMx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Natalie Gibson is an actress, known for Love Is the Devil: Study for a Portrait of Francis Bacon (1998), Christmas Bounty (2013) and Restless Virgins (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0NDA2OTcyNzReQTJeQWpwZ15BbWU4MDU0NDA2NTMx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0317131","name":"Natalie Gibson","idIMDB":"nm0317131"},"actorId":"nm0317131","character":"Bobby's Mother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jessica Harmon","urlProfile":"http://www.imdb.com/name/nm1340738","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMTA3MzMwNl5BMl5BanBnXkFtZTgwMzY2OTYwODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 December 1985","placeOfBirth":" Barrie, Ontario, Canada","height":"5' 8\" (1.73 m)","bio":"Jessica Harmon was born on December 27, 1985 in Barrie, Ontario, Canada. She is known for her work on Black Christmas (2006), Hollow Man II (2006) and Agent Cody Banks (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMTA3MzMwNl5BMl5BanBnXkFtZTgwMzY2OTYwODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1340738","name":"Jessica Harmon","idIMDB":"nm1340738"},"actorId":"nm1340738","character":"Jessica","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2486490","urlIMDB":"http://www.imdb.com/title/tt2486490","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.8","filmingLocations":[{"location":"Canada"}],"awards":[{"award":"UBCP/ACTRA Awards, Vancouver 2014","titlesAwards":[{"titleAwardOutcome":"Nominated UBCP Award","categories":[{"category":"Best Actress","names":[{"name":"April Telek","id":"nm0854304","role":null}]}]}]}],"votes":"777","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0050794","name":"ABC Family"},{"idCompany":"co0242604","name":"WWE Studios"}],"keywords":{"keywords":["christmas","two word title","interrupted wedding","santa claus","christmas tree"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:12:04"}}