{"data":{"movies":[{"title":"Goodbye to All That","originalTitle":"","year":"2014","releaseDate":"20141217","directors":[{"name":"Angus MacLachlan","id":"nm0533666"}],"writers":[{"name":"Angus MacLachlan","id":"nm0533666"}],"runtime":"87 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgxOTkwMzEyMV5BMl5BanBnXkFtZTgwMDY1Mzg1MzE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Romance"],"plot":"The plot of this movie is not clear. The guy's wife informs him of her plans to divorce him at a counseling session. Husband is dumbfounded. He has several one night stands. Attends a class reunion and it appears that he wants to rekindle a relationship with an ex-girlfriend. At the end, wife approaches him about his new lifestyle and husband finally admits he now knows about her affair and that she has little room to speak when it comes to being a good role model for their daughter.","simplePlot":"When his wife unexpectedly informs him that she wants a divorce, well-meaning but oblivious husband Otto Wall finds himself thrust back into bachelorhood, where he searches for the real thing amidst a string of one night stands.","actors":[{"actorName":"Paul Schneider","urlProfile":"http://www.imdb.com/name/nm0773973","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MjczMTcxNF5BMl5BanBnXkFtZTcwMjkzOTQyNQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1976","placeOfBirth":" Asheville, North Carolina, USA","height":"5' 11½\" (1.82 m)","bio":"Paul Schneider was born on March 16, 1976 in Asheville, North Carolina, USA. He is an actor and writer, known for Lars and the Real Girl (2007), Water for Elephants (2011) and The Assassination of Jesse James by the Coward Robert Ford (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MjczMTcxNF5BMl5BanBnXkFtZTcwMjkzOTQyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0773973","name":"Paul Schneider","idIMDB":"nm0773973"},"actorId":"nm0773973","character":"Otto Wall","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Melanie Lynskey","urlProfile":"http://www.imdb.com/name/nm0001491","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNDg5NTg4Nl5BMl5BanBnXkFtZTcwMTU3NjgyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1977","placeOfBirth":" New Plymouth, New Zealand","birthName":"Melanie Jayne Lynskey","height":"5' 7\" (1.7 m)","bio":"At 16 years of age, Melanie Lynskey captivated audiences with her explosive debut in Peter Jackson's Academy Award-nominated Créatures célestes (1994), achieving worldwide acclaim and a Best Actress prize for her portrayal of an outcast teen whose relationship with her best friend (Kate Winslet) spirals dangerously out of control. Following a three-year hiatus spent studying at university and re-locating from New Zealand to Los Angeles, Lynskey made a welcome return to the silver screen when she was cast opposite Drew Barrymore in Ever After: A Cinderella Story (1998). Parts in Detroit Rock City (1999), But I'm a Cheerleader (1999), Coyote Ugly (2000), Snakeskin (2001), Abandon (2002), Sweet Home Alabama (2002), Shattered Glass (2003) and Clint Eastwood's Flags of Our Fathers (2006) came next. In recent years, Lynskey has worked her scene-stealing magic in a variety of projects, such as Sam Mendes's Away We Go (2009), Best Picture Oscar nominee Up in the Air (2009), Steven Soderbergh's The Informant! (2009), Leaves of Grass (2009), Win Win (2011), Seeking a Friend for the End of the World (2012), and The Perks of Being a Wallflower (2012). Prolific supporting roles - opposite the likes of George Clooney, Edward Norton and Matt Damon - aside, central parts in Hello I Must Be Going (2012), Happy Christmas (2014), Goodbye to All That (2014), We'll Never Have Paris (2014), The Intervention (2016) (for which she scooped a Special Jury Award at the Sundance Film Festival), Rainbow Time (2016) and I Don't Feel at Home in This World Anymore (2017) have proved that she is also a capable and charismatic leading lady. In addition to an impressive body of film work, Lynskey has appeared regularly on the small screen since her television debut in Stephen King's Rose Red (2002), which was followed by roles in Drive (2007) and Comanche Moon (2008), as well as guest stints on The Shield (2002), The L Word (2004), and House (2004). However, she's probably best known to TV audiences for her frequent appearances as Rose - Charlie Sheen's delightfully deranged stalker - on the Emmy Award-winning Two and a Half Men (2003), and her portrayal of Michelle Pierson on HBO's Togetherness (2015), for which she received a Critics' Choice Award nomination for Best Supporting Actress.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNDg5NTg4Nl5BMl5BanBnXkFtZTcwMTU3NjgyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001491","name":"Melanie Lynskey","nicknames":["Mel"],"idIMDB":"nm0001491"},"actorId":"nm0001491","character":"Annie Wall","urlCharacter":"http://www.imdb.com/character/ch0503978","main":true},{"actorName":"Audrey P. Scott","urlProfile":"http://www.imdb.com/name/nm3716878","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDE2Njc1M15BMl5BanBnXkFtZTgwNjEwOTU2MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Audrey Paris Scott","bio":"Audrey Scott made her screen debut at the age of 7 playing the younger version of Diane Lane in Disney's Secretariat then quickly moved to the ABC Family movie Revenge of the Bridesmaids. Her first leading role came at the age of 8 when she was cast in the independent film About Sunny (known as Think of Me during it's festival run) where she played \"Sunny\" opposite Lauren Ambrose. Following the film's premiere at the Toronto Film Festival, Audrey received several favorable critical reviews for her work including being lauded for her \"quietly natural thesping\" by Variety. For a teenager, she has had the opportunity to work alongside some of the most talented actors, writers and directors in the film and television industry. In 2011 she starred alongside Academy Award winner Ernest Borgnine, Academy Award nominee June Squibb and Independent Spirit Award nominee Dale Dickey in the independent film The Man Who Shook the Hand of Vicente Fernandez. The L.A. Times praised her performance and noted \"the unsentimental chemistry between them (Scott and Borgnine) is the strongest element of the film\". Audrey also appeared opposite Jean-Claude Van Damme in Universal Soldier: Day of Reckoning, which was recognized by Indiewire as one of their top ten films of 2012. She also had the opportunity to play the younger version of Amy Poehler in NBC's Parks & Recreation that same year. Audrey played the role of \"Young Karen\" (series regular) in the 2014 FOX pilot Fatrick, written by Nahnatchka Khan and Corey Nickerson and directed by the Academy Award winning duo Nat Faxon and Jim Rash (The Descendants). In the independent film Goodbye To All That, which was written and directed by Angus MacLachlan (Junebug), she received critical praise for her performance in the Washington Post, Forbes, RogerEbert.com, IndieWire and Variety. The film premiered at the Tribeca Film Festival in 2014. Born in Spartanburg, South Carolina and an only child, Audrey lives with her parents and her dog, Porter, in Houston, Texas. She is an A/P honors student and attend TCAH. In her spare time, she can often be found roaming the paleontology hall of her beloved HMNS, rapping to the soundtrack of \"Hamilton\" and hitting up the makeup counters for the latest shade of vintage lipstick. A self-proclaimed nerd, Audrey is an avid reader, world-traveler, math geek and considers herself a \"professional fangirl\" of Greek mythology, superhero comics and dystopian fiction novels.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDE2Njc1M15BMl5BanBnXkFtZTgwNjEwOTU2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3716878","name":"Audrey P. Scott","idIMDB":"nm3716878"},"actorId":"nm3716878","character":"Edie Wall","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Chernus","urlProfile":"http://www.imdb.com/name/nm1985974","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NDgyODMyM15BMl5BanBnXkFtZTgwNTQyNjA5NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 August 1977","placeOfBirth":" Rocky River, Ohio, USA","bio":"Also an accomplished stage actor, Michael won a 2011 OBIE Award and received a Lucille Lortel Award nomination for his performance in Lisa Kron's \"In the Wake\" at The Public Theater in New York City. On stage, he most recently co-starred with David Hyde Pierce in the Manhattan Theater Club production of \"Close Up Space\" at New York City Center. Other New York credits include such theaters as Playwrights Horizons, the Roundabout Theatre Company, Primary Stages, New York Theater Workshop, The Atlantic Theater Company, and many productions at the Rattlestick Playwrights Theater (where he played the lead role of \"KJ\" in Annie Baker's play \"The Aliens,\" which Charles Isherwood, of the New York Times, named the best play of 2010). His credits in regional theater include productions at the Williamstown Theater Festival, The Yale Repertory Theatre, and the Guthrie Theater, among others. Internationally, he appeared in Adam Rapp's \"Finer Noble Gases\" at the Edinburgh Fringe Festival (Fringe First Award) and in London at the Bush Theatre. Michael is a graduate of the Juilliard School's Drama Division (Group 28).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NDgyODMyM15BMl5BanBnXkFtZTgwNTQyNjA5NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1985974","name":"Michael Chernus","idIMDB":"nm1985974"},"actorId":"nm1985974","character":"Freddie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Celia Weston","urlProfile":"http://www.imdb.com/name/nm0922927","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNDIyMjE2NV5BMl5BanBnXkFtZTcwODk4NzY5Mg@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1951","placeOfBirth":" Spartanburg, South Carolina, USA","height":"5' 8\" (1.73 m)","bio":"Direct from Spartanburg, South Carolina, this tall, blonde actress may not exude shimmering star potential, but she certainly has earned the respect of stage and film audiences alike for her many touching portrayals of matter-of-fact, down-to-earth Southern folk. For someone who first attracted attention as a hash-slinging replacement for Diane Ladd (herself a replacement for the ever-popular Polly Holliday) in the final, languishing years of the popular CBS sitcom Alice (1976), Celia Weston certainly has evolved into one of the more sought-after character performers of \"Deep South\" film drama. Born December 14, 1951, and raised in South Carolina, Celia, along with her sister, enjoyed creating their own little world of characters, acting out small skits and later began appearing in local plays. She did not, however, meet the unanimous encouragement of her family when the one-time art and psychology major at Salem College in Winston-Salem, North Carolina, decided to do an abrupt about-face and study acting. She earned an Artist Diploma in Drama at the North Carolina School of the Arts before moving to London to continue her training. More than determined, she eventually returned to the States in 1977 and studied with Uta Hagen and Herbert Berghof while slinging hash herself in New York City. In between, there was sporadic regional and off-off-Broadway work along with summer stock. At age 28, Celia made a big leap with her Broadway debut in \"Loose Ends\" (1979) starring Kevin Kline. Following her prime theater role in Edward Albee's \"The Lady from Dubuque\" in 1980 and a small part in Clint Eastwood's film Honky Tonk Freeway (1981), Hollywood showed her the money when she became the new Southern-fried waitress in town alongside Linda Lavin and Beth Howland on the \"Alice\" series. Her character of Jolene was given rather short shrift during the four seasons (1981-1985) she appeared. Although Celia valiantly tried the invest the role with some sass, she was the newcomer and was too often overshadowed by the other two. Following the show's demise, she had a number of lean years before her luck changed again. In 1988, she was handed a couple of featured roles in the movies Stars and Bars (1988) and A New Life (1988). Her penchant for toned-down, unaffected realism was not overlooked. While interspersing theater roles with the sudden upswing of film parts now coming her way, she finally came into her own in both venues in the mid-to-late 1990s. After earning critical applause for her brittle dramatic turn as the backwoods mother of a murdered child in Dead Man Walking (1995), she went on to win an Outer Critics Award and Tony nomination for her Southern matron in Broadway's acclaimed \"The Last Night of Ballyhoo\" (1997). Preferring art-house obscurity to mainstream popularity, Celia has stayed true for the most part with classier, character-driven drama and it has paid off in career dividends. An always interesting presence, her gals can tangle and backbite with the best of them or show true grit and/or extreme emotional fragility at times of unbearable sorrow. Celia has also played a variety of dialects over the years. A gregarious and eccentric turn as a possible mother to a searching Ben Stiller in the wonderful Flirting with Disaster (1996) led to her Civil War wife in Ride with the Devil (1999); her grieving, prejudicial Teutonic mother in Snow Falling on Cedars (1999); the part of Cate Blanchett's haughty aunt in The Talented Mr. Ripley (1999); and the Southern belle-like mental patient in K-Pax (2001). In addition, her Southern roots have complimented such Tennessee Williams' plays as \"Summer and Smoke\" and \"Suddenly Last Summer\" on Broadway. Into the millennium, Celia is still going strong. She has been a vibrant presence in such ensemble films as In the Bedroom (2001), Far from Heaven (2002) and The Village (2004). In 2005, she received one of her best roles in years as the dressed-down Southern matriarch in the obscure independent film Junebug (2005), which premiered at the Sundance Film Festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNDIyMjE2NV5BMl5BanBnXkFtZTcwODk4NzY5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0922927","name":"Celia Weston","idIMDB":"nm0922927"},"actorId":"nm0922927","character":"Joan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve Coulter","urlProfile":"http://www.imdb.com/name/nm0183548","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ4YTg1OWYtZTNlZC00ZDUzLThiN2ItM2Y2MmQ1ZWVlYTNlXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1960","placeOfBirth":"","height":"6' (1.83 m)","bio":"A graduate of the North Carolina School of the Arts, Steve recently appeared in Hangman with Al Pacino. Other credits include Abundant Acreage Available, Coach Pom Pom in Hank Azaria's Brockmire, HBO's The Wizard of Lies, House of Cards, The Birth of a Nation, and Reg Monroe on AMC's The Walking Dead. He starred in James Wan's Insidious Chapter 2, The Conjuring, and appears in Wan's Furious 7. He has also appeared in The Hunger Games, in Billy Bob Thornton's Jayne Mansfield's Car opposite Robert Duvall, Flight with Denzel Washington, and Angus MacLachlan's Goodbye To All That, which premiered at the Tribeca Film Festival. He appeared opposite Jeremy Renner in Kill the Messenger and in Taken 3. He had a regular role in the Cinemax/HBO series, Banshee, and appeared opposite Mickey Rourke in Ashby, Tom Cruise in American Made, and Michael Keaton in The Founder. Steve was the head writer and executive story editor for both of Tyler Perry's television series, House of Payne and Meet the Browns, where he supervised over 100 episodes and won two consecutive NAACP Image Awards for Best Comedy Series. He wrote and directed the award-winning short film, The Etiquette Man, selected by the Sundance Channel and the National Gallery of Art in Washington DC. His screenplay, Keesha's House, won the $100,000 Southeastern Media Award. He wrote and is developing the original television series, The Land, with Shay Bentley Griffin.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ4YTg1OWYtZTNlZC00ZDUzLThiN2ItM2Y2MmQ1ZWVlYTNlXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0183548","name":"Steve Coulter","idIMDB":"nm0183548"},"actorId":"nm0183548","character":"Lawyer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Haulbrook","urlProfile":"http://www.imdb.com/name/nm2438151","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTE5MDMxOV5BMl5BanBnXkFtZTcwODIyODg0OQ@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"bio":"Robert Haulbrook is an actor and producer, known for Loving (2016), Goodbye to All That (2014) and Deviling (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTE5MDMxOV5BMl5BanBnXkFtZTcwODIyODg0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2438151","name":"Robert Haulbrook","idIMDB":"nm2438151"},"actorId":"nm2438151","character":"Real Estate Broker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amy Sedaris","urlProfile":"http://www.imdb.com/name/nm0781238","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIyNDE5NDg2OV5BMl5BanBnXkFtZTcwMDc0NDU5Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 March 1961","placeOfBirth":" Endicott, New York, USA","birthName":"Amy Louise Sedaris","height":"5' 1½\" (1.56 m)","bio":"Amy Sedaris was born on March 29, 1961 in Endicott, New York, USA as Amy Louise Sedaris. She is an actress and writer, known for Puss in Boots (2011), BoJack Horseman (2014) and Strangers with Candy (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIyNDE5NDg2OV5BMl5BanBnXkFtZTcwMDc0NDU5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0781238","name":"Amy Sedaris","idIMDB":"nm0781238"},"actorId":"nm0781238","character":"Holly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Melcher Smith","urlProfile":"http://www.imdb.com/name/nm5045490","urlPhoto":"","biography":{"bio":"Melcher Smith is an actor, known for Goodbye to All That (2014), Ambien (2012) and The Devil's Hand (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5045490","name":"Melcher Smith","idIMDB":"nm5045490"},"actorId":"nm5045490","character":"Dick","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steven Hall","urlProfile":"http://www.imdb.com/name/nm4126047","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTMxODI1NzUwMl5BMl5BanBnXkFtZTgwMjM3NjcyMTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"bio":"Steven Hall is an actor, known for Goodbye to All That (2014), Double Header (2013) and Special Things to Do (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTMxODI1NzUwMl5BMl5BanBnXkFtZTgwMjM3NjcyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4126047","name":"Steven Hall","idIMDB":"nm4126047"},"actorId":"nm4126047","character":"Doctor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Heather Graham","urlProfile":"http://www.imdb.com/name/nm0001287","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzk5MTM4NV5BMl5BanBnXkFtZTcwNTMxOTkwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1970","placeOfBirth":" Milwaukee, Wisconsin, USA","birthName":"Heather Joan Graham","height":"5' 8\" (1.73 m)","bio":"Heather Joan Graham was born in Milwaukee, Wisconsin, to Joan (Bransfield), a schoolteacher and children's book author, and James Graham, an FBI agent. She and her sister, actress Aimee Graham, were raised by their strictly Catholic parents. They relocated often, as a result of their father's occupation, and Heather became increasingly shy. Surprisingly, she had a passion for acting from an early age and despite being labeled a 'theater geek' by her peers, she was voted Most Talented by her high school senior class. Unfortunately, her love of acting created a tension between Heather and her family although her mother obligingly drove her to auditions in Hollywood throughout her adolescence. After high school Heather moved to Los Angeles and received small roles in a variety of films including Drugstore Cowboy (1989). When her career did not take off as quickly as was hoped, Heather enrolled in the University of California at Los Angeles to get her degree in drama. It was at UCLA that she was noticed by actor James Woods and received a subsequent part in a film Woods starred in, Diggstown (1992). Heather dropped out of UCLA after two years to pursue her acting career on a full time basis. Aside from gaining a modeling contract with Emanuel Ungaro Liberte, Heather has risen to star in such films as Swingers (1996), a role she received after being taken out swing dancing by Jon Favreau, to blockbusters like Austin Powers: The Spy Who Shagged Me (1999), and Boogie Nights (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzk5MTM4NV5BMl5BanBnXkFtZTcwNTMxOTkwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001287","name":"Heather Graham","idIMDB":"nm0001287"},"actorId":"nm0001287","character":"Stephanie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ashley Grace","urlProfile":"http://www.imdb.com/name/nm3358233","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1Mjg5MTk3MF5BMl5BanBnXkFtZTgwMTQ0MTMzMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 December 1988","placeOfBirth":" La Porte, Indiana, USA","height":"5' 4½\" (1.64 m)","bio":"Ashley Grace was born on December 11, 1988 in La Porte, Indiana, USA. She is an actress, known for Chronicle (2012), True Detective (2014) and LOL (2012). She has been married to Topher Grace since May 29, 2016.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1Mjg5MTk3MF5BMl5BanBnXkFtZTgwMTQ0MTMzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3358233","name":"Ashley Grace","idIMDB":"nm3358233"},"actorId":"nm3358233","character":"Mildred","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeffrey Dean Foster","urlProfile":"http://www.imdb.com/name/nm1842644","urlPhoto":"","biography":{"bio":"Jeffrey Dean Foster is an actor and composer, known for Billy Lynn's Long Halftime Walk (2016), Junebug (2005) and Goodbye to All That (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1842644","name":"Jeffrey Dean Foster","idIMDB":"nm1842644"},"actorId":"nm1842644","character":"Greeter at Church","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anna Camp","urlProfile":"http://www.imdb.com/name/nm2319871","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWZlMDI1YWEtODFlOC00NTAwLTllMTItMDg3MjdjZGEwNDMzXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 September 1982","placeOfBirth":" Aiken, South Carolina, USA","birthName":"Anna Ragsdale Camp","height":"5' 5\" (1.65 m)","bio":"Anna Camp was born on September 27, 1982 in Aiken, South Carolina, USA as Anna Ragsdale Camp. She is an actress, known for Pitch Perfect (2012), True Blood (2008) and The Help (2011). She has been married to Skylar Astin since September 10, 2016. She was previously married to Michael Mosley.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWZlMDI1YWEtODFlOC00NTAwLTllMTItMDg3MjdjZGEwNDMzXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2319871","name":"Anna Camp","idIMDB":"nm2319871"},"actorId":"nm2319871","character":"Debbie Spangler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Beth Bostic","urlProfile":"http://www.imdb.com/name/nm0098221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTMyMzcyNTM1OV5BMl5BanBnXkFtZTgwNjQ4NDMxNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Beth Bostic is an actress, known for Junebug (2005), Nell (1994) and The Road to Wellville (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTMyMzcyNTM1OV5BMl5BanBnXkFtZTgwNjQ4NDMxNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0098221","name":"Beth Bostic","idIMDB":"nm0098221"},"actorId":"nm0098221","character":"Ginny","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2437548","urlIMDB":"http://www.imdb.com/title/tt2437548","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"$13,790","country":"USA","day":"22","month":"01","year":"2015","remarks":""}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 27 min (87 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.2","metascore":"62","filmingLocations":[{"location":"North Carolina, USA"}],"rated":"UNRATED","awards":[{"award":"Tribeca Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Won Jury Award","categories":[{"category":"Best Actor in a Narrative Feature","names":[{"name":"Paul Schneider","id":"nm0773973","role":null}]}]},{"titleAwardOutcome":"Nominated Jury Award","categories":[{"category":"Best Narrative Feature","names":[{"name":"Angus MacLachlan","id":"nm0533666","role":null}]}]}]}],"votes":"1,895","type":"Movie","companyCreditsSimple":[{"idCompany":"co0130058","name":"Epoch Films"},{"idCompany":"co0396934","name":"RC Pictures"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 07:54:21"}}