{"data":{"movies":[{"title":"The Wizards Return: Alex vs. Alex","originalTitle":"","year":"2013","releaseDate":"20130315","directors":[{"name":"Victor Gonzalez","id":"nm0327591"}],"writers":[{"name":"Todd J. Greenwald","id":"nm0339261"},{"name":"Ben Montanio","id":"nm0598996"}],"runtime":"60 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MjgzMjYzMl5BMl5BanBnXkFtZTcwOTIxMzk1OQ@@._V1.jpg","countries":["USA"],"languages":["English","Italian"],"genres":["Adventure","Comedy","Drama","Family","Fantasy"],"plot":"The Russo family and friends are headed to Tuscany, Italy, to meet their long lost relatives... but when Alex tries to prove she's more than a seemingly carefree young Wizard, she inadvertently conjures a spell that creates a Good Alex and an Evil Alex. When Evil Alex gets roped into a charming young wizard's foreboding plan to take over the world, Good Alex must find a way to save her family and humankind, which leads to a monumental battle between the two versions of herself - all atop the Tower of Pisa.","simplePlot":"While visiting Tuscany, Italy, a young wizard accidentally creates an evil version of herself.","actors":[{"actorName":"Selena Gomez","urlProfile":"http://www.imdb.com/name/nm1411125","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNTE2MDMyMl5BMl5BanBnXkFtZTgwMjAyODM3MTI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1992","placeOfBirth":" Grand Prairie, Texas, USA","birthName":"Selena Marie Gomez","height":"5' 5\" (1.65 m)","bio":"Selena Marie Gomez was born and raised in Grand Prairie, Texas, to Mandy Teefey, who is of part Italian descent, and Ricardo Gomez, who is of Mexican descent and originally from New Mexico. Her parents divorced in 1997. Giving birth to Selena at 16, her mom Mandy recalls living \"paycheck-to-paycheck\". Selena started out on Barney & Friends (1992) as \"Gianna\" in 2001 where she really discovered her talent. Unfortunately, they dropped her from the series after just two years. In 2003, she had a very small role in the movie Spy Kids 3-D: Game Over (2003) and a bit part in 2005 when she played \"Julie\" in Walker, Texas Ranger: Trial by Fire (2005) with Mitchel Musso and in 2006 as \"Emily Grace Garcia\" in Brain Zapped (2006) when she recorded a song for the movie. She she guest starred as \"Gwen\" in The Suite Life of Zack and Cody (2005) and as Hannah's rival, the 'evil' \"Mikayla\", in Hannah Montana (2006). Selena's amazing talent landed her roles in two Disney series, both spin-offs. Unfortunately, neither show was picked up until 2007 when she got the role of \"Alex Russo\" in the magical series Wizards of Waverly Place (2007) which she auditioned for three times. In March 2008, she made her first animated movie Horton Hears a Who! (2008) and later starred in Another Cinderella Story (2008) with Disney Channel star Drew Seeley for ABC Family. Her two Disney Channel Original Movies Princess Protection Program (2009), with real-life BFF Demi Lovato, and Wizards of Waverly Place: The Movie (2009) will both air Summer 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNTE2MDMyMl5BMl5BanBnXkFtZTgwMjAyODM3MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1411125","name":"Selena Gomez","nicknames":["Sel","Selly","Selenita","Conchita"],"idIMDB":"nm1411125"},"actorId":"nm1411125","character":"Alex Russo","urlCharacter":"http://www.imdb.com/character/ch0033410","main":true},{"actorName":"Jake T. Austin","urlProfile":"http://www.imdb.com/name/nm1545471","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDMyMDI2NzQ3NF5BMl5BanBnXkFtZTcwMTQ4NDQ1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1994","placeOfBirth":" New York City, New York, USA","birthName":"Jake Toranzo Austin Szymanski","height":"5' 8\" (1.73 m)","bio":"He was born in New York, USA. His mother is Giny Rodriguez Toranzo and father is Joe Szymanski. His \"T\"-middle initial is taken from his mother's name 'Toranzo'. His younger sister, Ava, is his only sibling. His father has Polish, English, and Irish ancestry, and his mother is of Puerto Rican, Argentinian, and Spanish descent. Jake started acting at age of 7 in commercials. His first credited role was in a comedy sketch \"Kid 1698\". Jake starred in many animated movies, but he's mostly famous for his role as Max Russo in \"Wizards of Waverly place\"(2007-2012). He speaks English and Spanish fluently. Jake is living in L.A. but he often visits his family in New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDMyMDI2NzQ3NF5BMl5BanBnXkFtZTcwMTQ4NDQ1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1545471","name":"Jake T. Austin","nicknames":["Jakee"],"idIMDB":"nm1545471"},"actorId":"nm1545471","character":"Max Russo","urlCharacter":"http://www.imdb.com/character/ch0033956","main":true},{"actorName":"Jennifer Stone","urlProfile":"http://www.imdb.com/name/nm1259832","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNDkxMDUwMV5BMl5BanBnXkFtZTgwNjQ3NDM2NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1993","placeOfBirth":" Arlington, Texas, USA","birthName":"Jennifer Lindsay Stone","height":"5' 4\" (1.63 m)","bio":"At the age of 6 Jennifer Stone began her stage career after many hours of watching her brother rehearse for community theatre productions. Many leading theatrical roles (some award-winning) followed, and when she was 8 she signed with an agency and began auditioning for commercials. Jennifer has currently appeared in several commercials and voice-overs, but her break in came when she was cast as the great-niece of Robert Duvall and Michael Caine in New Line Cinema's Secondhand Lions (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNDkxMDUwMV5BMl5BanBnXkFtZTgwNjQ3NDM2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1259832","name":"Jennifer Stone","idIMDB":"nm1259832"},"actorId":"nm1259832","character":"Harper Finkle","urlCharacter":"http://www.imdb.com/character/ch0033957","main":true},{"actorName":"Gregg Sulkin","urlProfile":"http://www.imdb.com/name/nm2116419","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2Y5NTJlMDItYmE3Ni00YzA2LWE2NTEtYjFiODgwYTM4NjM4L2ltYWdlXkEyXkFqcGdeQXVyMjMwODIzMTA@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 May 1992","placeOfBirth":" London, England, UK","height":"5' 10\" (1.78 m)","bio":"Gregg was born in London, England, where he attended Highgate School. Gregg made his acting debut in 2002, with the mini-series Doctor Zhivago (2002). Gregg played the lead role, Will Wagner, in the Disney Channel Original movie Avalon High (2010), which premiered on November 12th, 2010. He also appeared as Alex Russo's werewolf boyfriend, Mason Greyback, on the Disney Channel Original series Wizards of Waverly Place (2007) & ABC Family's Melissa & Joey (2010). He has two feature films in post-production; \"Camilla Dickinson\" and White Frog (2012). Sulkin received the \"Rising Star Award\" at the Hawaii International Film Festival 2011 in Honolulu.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2Y5NTJlMDItYmE3Ni00YzA2LWE2NTEtYjFiODgwYTM4NjM4L2ltYWdlXkEyXkFqcGdeQXVyMjMwODIzMTA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2116419","name":"Gregg Sulkin","nicknames":["Greg Sulkin"],"idIMDB":"nm2116419"},"actorId":"nm2116419","character":"Mason Greyback","urlCharacter":"http://www.imdb.com/character/ch0177117","main":true},{"actorName":"Beau Mirchoff","urlProfile":"http://www.imdb.com/name/nm2155525","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWRlMjIxNjEtMzg0OS00NzllLWIzMjItY2RhYzY3NjFhY2FmXkEyXkFqcGdeQXVyNzQ5NzYyNw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1989","placeOfBirth":" Seattle, Washington, USA","birthName":"William Beau Mirchoff","height":"6' 1\" (1.85 m)","bio":"Beau Mirchoff was born on Friday the 13th of January, 1989, in Seattle, Washington. Two days later, he moved to his family's home in Victoria, British Columbia, Canada, on Vancouver Island. His father Bill, is a podiatrist from California and his mother Kelley, is a full-time homemaker from Washington State. Beau started training as an actor at the age of 13 in Vancouver, British Columbia. This required him to take a two hour ferry-boat venture from Vancouver Island to the mainland of British Columbia, and ride the bus an hour into the city. He did this every week until moving to Los Angeles in February of 2009 where Beau began training at the Michael Woolson Studio - the same studio he trains at today. In 2009 Beau landed the role of Danny Bolen on ABC's Desperate Housewives. In 2010 he snagged the role of Matty Mckibben on MTV's Awkward; he won a Teen Choice Award in 2012 for this portrayal. During the hiatuses from television Mirchoff focuses on the theatre: in 2012 he portrayed Treat in a production of Lyle Kessler's Orphans at the Hudson Theatre; in 2013 he played Kent in Neil Labute's Reason's to be Pretty at the MW Theatre. Other notable films include: Scary Movie 4, The Grudge 3, I am Number 4, and Poker Night alongside Ron Perlman, Giancarlo Esposito, Titus Welliver, and Ron Eldard.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWRlMjIxNjEtMzg0OS00NzllLWIzMjItY2RhYzY3NjFhY2FmXkEyXkFqcGdeQXVyNzQ5NzYyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2155525","name":"Beau Mirchoff","nicknames":["Beau"],"idIMDB":"nm2155525"},"actorId":"nm2155525","character":"Dominic","urlCharacter":"http://www.imdb.com/character/ch0392626","main":true},{"actorName":"Maria Canals-Barrera","urlProfile":"http://www.imdb.com/name/nm0133566","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwODE1ODUxMl5BMl5BanBnXkFtZTgwMjg3MzE5NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1966","placeOfBirth":" Miami, Florida, USA","birthName":"Maria Pilar Canals","height":"5' 6\" (1.68 m)","bio":"Maria Canals-Barrera was born on September 28, 1966 in Miami, Florida, USA as Maria Pilar Canals. She is an actress, known for Wizards of Waverly Place (2007), Justice League (2001) and Batman: The Dark Knight Returns, Part 1 (2012). She has been married to David Barrera since January 16, 1999. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwODE1ODUxMl5BMl5BanBnXkFtZTgwMjg3MzE5NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0133566","name":"Maria Canals-Barrera","idIMDB":"nm0133566"},"actorId":"nm0133566","character":"Theresa Russo","urlCharacter":"http://www.imdb.com/character/ch0048869","main":true},{"actorName":"David DeLuise","urlProfile":"http://www.imdb.com/name/nm0217936","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0ODMwMjYwN15BMl5BanBnXkFtZTcwMzE1MjUyOA@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 November 1971","placeOfBirth":" Burbank, California, USA","birthName":"David Dominick Deluise","height":"5' 10½\" (1.79 m)","bio":"The youngest son of legendary actor and comedian Dom DeLuise, David DeLuise is now perhaps the most popular dad on TV. He's won the admiration of millions of children and parents alike for his portrayal of family patriarch Jerry on the hit Emmy award-winning Disney Channel series, \"Wizards of Waverly Place.\" He also starred in \"Wizards of Waverly Place: The Movie,\" which aired on the Disney Channel to over 25 million viewers. DeLuise has been a familiar face to television audiences for years for his recurring roles in the hit series \"Stargate SG-1\" and \"3rd Rock from the Sun.\" He was a series regular opposite Christina Applegate on NBC's \"Jesse\", and guest starred in \"Hawaii Five-0,\"The mentalist,\" \"Rizzoli and Isles,\" \"baby daddy,\" \"Bones,\" \"Without a Trace,\" \"ER,\" \"Monk,\" \"Gilmore Girls,\" \"CSI\", \"CSI: New York\" and \"CSI: Miami.\" On the big screen, DeLuise has appeared in \"Vampires Suck,\" \"Believe,\" \"Pup Star, \" \"Terror Tract,\" \"Dirt Merchant,\" \"Dracula, Dead and Loving It,\" \"Kicking and Screaming,\" \"Robin Hood: Men In Tights,\" \"Last Call\" and \"BachelorMan,\" In addition to his father, who inspired David to begin his acting career, his older brothers Peter and Michael and his mother Carol are also actors. David began his career at the age of 8 when he starred as Dom's son in the TV movie, \"Happy\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0ODMwMjYwN15BMl5BanBnXkFtZTcwMzE1MjUyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0217936","name":"David DeLuise","idIMDB":"nm0217936"},"actorId":"nm0217936","character":"Jerry Russo","urlCharacter":"http://www.imdb.com/character/ch0044286","main":true},{"actorName":"Natalija Nogulich","urlProfile":"http://www.imdb.com/name/nm0634101","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODc4MzAyOF5BMl5BanBnXkFtZTcwNDQyNjE2Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1950","placeOfBirth":" Chicago, Illinois, USA","birthName":"Natalija Nogulich","bio":"Natalija Nogulich, newly published author of her debut novel, \"One Woman's War,\" is currently writing Book 2 of the trilogy. She recently performed in the show finale of GLEE, an episode of Disney's new show , KC UNDERCOVER, and prior to that, the season finale of NCIS followed by an episode of Disney's Kickin' It, 2 Broke Girls and Criminal Minds. Ms. Nogulich was a regular recurring character in ABC series, Red Widow, as Russian mob wife, Elena Petrova, and appeared in HBO's biopic, Phil Spector, as Italian journalist, Giovanetta Ricci, directed by David Mamet; on Disney Channel in Wizards of Waverly Place Reunion with Ms. Nogulich as Carmela. Originally from Chicago, she was educated in Illinois and in Spain and Italy. Studying and traveling throughout Europe, she gained command of five languages. After receiving her B.A. from Lake Forest College, where she graduated Phi Beta Kappa, she went on to study and work with David Mamet at his St. Nicholas Theatre Company in Chicago. Later she was under the tutelage of Stella Adler and Michael Moriarty, both in New York and Los Angeles. Natalija was also a student of Kenneth McMillan until he inaugurated her teaching and directing career in Los Angeles. On Broadway, she starred in Hurlyburly, the Iceman Cometh, and Accomplice; as well as innumerable off-Broadway productions, including Restoration at New York Theatre Workshop in 2010. On Los Angeles stages, she has been seen at the Mark Taper Forum in Scenes from an Execution; in the title role of TAMARA; and won four Drama-Logue Acting Awards for: The Three Sisters, Hedda Gabler, the White Rose and Once in a Lifetime. Additionally, she starred in many regional productions throughout the United States, including the Pulitzer Prize Finalist, THE WAVERLY GALLERY at the Pasadena Playhouse, (for which she was awarded the \"Entertainment Today\" Best Supporting Actress Award), and George Bernard Shaw's MISALLIANCE at Center Stage in Baltimore. Natalija has done five David Mamet Films: Phil Spector, Spartan, Homicide, Things Change, the Water Engine, and As Jack Nicholson's Wife, Hoffa. She has completed over thirty films including: Incarnate, Sharkskin, the Hollow, Steal Big - Steal Little, Above Suspicion, an Eye for an Eye, the Glass Shield, the Chase, Postcards from the Edge, Blood in - Blood Out, the Guardian, Christmas Vacation, Four Friends, Stony Island and others. Ms. Nogulich did two indie films, I'll Melt With You, and Commentary which were in 2011 Sundance Film Festival. On Television she is most known for her role as Admiral Nechayev in STAR TREK - THE NEXT GENERATION; and she's done numerous movies for television including: Jane Doe 9, Locusts, Pizza My Heart, Growing Pains, Dying to Dance, the Sleepwalker Killing, Lazarus Man, and Has Recurred On Episodes Of: the West Wing, the Practice, the Pretender, Brooklyn Bridge, Tracy Takes On, to name a few. She has guested on many other shows including David Mamet's hit series, The Unit, Bones, Nip/tuck, the Closer, Huff, Crossing Jordan, Without a Trace, Charmed, the award winning 24; and many others. As Artistic Director of The Grace Players Theatre Company, which she founded in 1994, Ms. Nogulich produced and directed the West Coast Premiere of David Mamet's adaptation of Chekhov's The Three Sisters, which garnered four Drama-Logue Awards including Best Direction and Best Production. She directed the World Premiere of Jason Milligan's comedy Walking On the Moon; six One Act Festivals, and over twenty other projects featuring actors Joe Mantegna, W.H. Macy, George Segal, Frank Langella, Burt Reynolds, Marion Ross, Carol Kane, Lolita Davidovitch and others. In Washington D.C.she directed David Selby in his play Lincoln and James at the 1400-seat Lincoln Theatre in honor of the dedication of the first Monument to Afro-American soldiers of the Civil War. In 2000, she directed her own adaptation of Romeo and Juliet in the American Civil War at Davis Theatre in Illinois, and in 2001 she directed a production of her own adaptation of An Enemy of the People at the same theatre. In Los Angeles at the Egyptian Arena Theatre, she directed Supreme Therapy, a world premiere play written by Michael Davidson starring Ray Abruzzo of \"The Sopranos.\" In the fall of 2004 she directed and starred in the World Premiere of her own adaptation of Alexander Dumas' novel, \"Camille,\" entitled THE DAME OF NEW ORLEANS. In 2006 she compiled, edited and directed A Tribute to Eugene O'neilL; and helmed a revival of Burn This, starring members of her theatre company, The Grace Players. The Grace Players then produced a Shakespeare Festival honoring the Bard's Birthday which Ms. Nogulich directed. Other theatrical projects include A Holiday Potopourri, a benefit for the children of severely wounded American troops in Iraq. As a filmmaker, she wrote and directed a documentary short called \"Corporal Jake,\" about World War I Congressional Medal of Honor Recipient Jake Allex. It was filmed in Kentucky and Chicago and was produced by BGFilmz of Chicago. Natalija is Adjunct Professor at renowned Art Center College of Design in Pasadena where she teaches graduate and undergraduate Film Directing students. She also teaches Producers at AFI Conservatory in Los Angeles. She has been a Visiting Professor in the Theatre Department at Principia College, Notre Dame University and Cal Poly in San Luis Obispo, and has also taught at the Los Angeles Country High School for the Performing Arts. She is a Private Coach to Los Angeles actors and directors. Natalija Nogulich currently lives in Los Angeles, where she continues to act, write, teach and direct.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODc4MzAyOF5BMl5BanBnXkFtZTcwNDQyNjE2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0634101","name":"Natalija Nogulich","idIMDB":"nm0634101"},"actorId":"nm0634101","character":"Carmela","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ella Lentini","urlProfile":"http://www.imdb.com/name/nm2965776","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MDk3ODc0OV5BMl5BanBnXkFtZTgwMTI4MTEyODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Antonella Lucia Lentini","height":"5' 4\" (1.63 m)","bio":"Ella Lentini was born and raised in New York City. She is the youngest of five kids. Her father, Lino Lentini was a renowned tailor, her mother, Jennifer De Lentini was a painter. As a child, she performed Charlie Chaplin-esque plays for family friends. As a teen she attended a weekend program at the Neighborhood Playhouse. Later, at the Beacon School she became involved in political and social activism, traveling to South Africa and New Orleans as a volunteer. At a young age, Ella discovered the importance of storytelling and film in society. After high school she attended New York University's Gallatin school of individualized study, where she was accepted for creative writing and photography before developing her own major, 'Screenwriting as a Weapon'. She continues to act while studying, writing and directing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MDk3ODc0OV5BMl5BanBnXkFtZTgwMTI4MTEyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2965776","name":"Ella Lentini","nicknames":["Ella","Nellie"],"idIMDB":"nm2965776"},"actorId":"nm2965776","character":"Francesca","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Donner","urlProfile":"http://www.imdb.com/name/nm0232800","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0OTI2ODM5OF5BMl5BanBnXkFtZTYwMjM0ODky._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1928","placeOfBirth":" Los Angeles, California, USA","birthName":"Jake Doner","bio":"Widely known and admired as Romulan Subcommander Tal in the original Star Trek (1966), Jack Donner has worked steadily in TV, film and theater since the 1950s. Born and raised in Los Angeles, he did his first professional theater and TV work there before heading for New York during the glory days of TV, appearing in many prestigious early shows like Studio One in Hollywood (1948), and soap operas such as As the World Turns (1956) and Guiding Light (1952). He also did seven seasons of New York regional and stock theater. Returning to L.A., he worked his way up to guest star and co-star status in shows like The Streets of San Francisco (1972), Mannix (1967), Kojak (1973), The Man from U.N.C.L.E. (1964), the aforementioned Star Trek (1966) episode \"The Enterprise Incident\", and eleven episodes (the most by any guest star in any series) of Mission: Impossible (1966). He also founded, with fellow actor Lee Delano, his own theater and drama school. His students included Barry Levinson, Craig T. Nelson, Barbara Parkins, and Don Johnson. Recent TV credits include Baywatch (1989), Buffy the Vampire Slayer (1997), Frasier (1993), Charmed (1998), General Hospital (1963), Chicken Soup for the Soul (1999), Good vs Evil (1999), Malcolm in the Middle (2000) and Roswell (1999), and as a regular in The Privateers (2000). Donner has assayed a wide variety of roles in recent feature films such as Gideon (1998) (with Christopher Lambert and Charlton Heston), and Family Tree (1999) (with Robert Forster). With his deep, resonant voice, silver-white hair and patrician profile, he has recently been compared with Vincent Price for his roles in a run of classy horror flicks, as Afzel the sorcerer in Retro Puppet Master (1999), the mysterious Father Almeida in Stigmata (1999), the manipulative Dr. Bassett in Demon Under Glass (2002), and the obsessed Father Lansing in Exorcism (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0OTI2ODM5OF5BMl5BanBnXkFtZTYwMjM0ODky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0232800","name":"Jack Donner","idIMDB":"nm0232800"},"actorId":"nm0232800","character":"Papa Fabrizio","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tera Hendrickson","urlProfile":"http://www.imdb.com/name/nm0376810","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MzU0NzY0N15BMl5BanBnXkFtZTcwODEyNjM3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Tera Hendrickson is a multi-lingual American actress and musician of Swedish and Peruvian descent. Also an accomplished dialectician, she has used foreign languages and accents in many of her acting roles, with some characters even utilizing invented languages. In the hit television show Charmed (1998), she portrays the French witch Simone; in Hannah Montana (2006) she plays the role of Hannah's Spanish teacher; in Cory in the House (2007) she co-stars as the Queen of Bahavia, a fabricated country. She has also portrayed Italian, Portuguese, Venezuelan, British and Austrian characters in various film and television productions. After appearing in a handful of independent films, she earned the role of an aspiring singer in the film Gunshy (1998), working alongside Diane Lane and William Petersen. In the Emmy-nominated mini-series The Beach Boys: An American Family (2000), her portrayal of legendary session bass player Carol Kaye afforded her the opportunity to use her skills as a professional musician. Her earliest credits include several music videos directed by Michael Bay and Gore Verbinski, featuring her as a principal dancer. A deep passion for music was sparked in childhood during which time she began her studies of piano and voice. Her acting and musical pursuits eventually dovetailed into a number of unique opportunities. Recruited by Academy Award-winning composer Hans Zimmer, she performed with his orchestra as the Edith Piaf vocalist for the Hollywood premiere of the blockbuster film Inception (2010). She also earned her first film composition credit for Say It in Russian (2007) starring Faye Dunaway, writing and performing the film's title track Embrasse Moi. In addition to acting, she continues to perform an eclectic mix of world music including French cabaret and gypsy jazz with the Les Zazous quartet.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MzU0NzY0N15BMl5BanBnXkFtZTcwODEyNjM3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0376810","name":"Tera Hendrickson","idIMDB":"nm0376810"},"actorId":"nm0376810","character":"Newscaster 1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anthony Palermo","urlProfile":"http://www.imdb.com/name/nm0657545","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzczMTY4Ml5BMl5BanBnXkFtZTgwNTQxMTY2MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Anthony Palermo is an actor, known for Live by Night (2016), The Wizards Return: Alex vs. Alex (2013) and Just Friends (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzczMTY4Ml5BMl5BanBnXkFtZTgwNTQxMTY2MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0657545","name":"Anthony Palermo","idIMDB":"nm0657545"},"actorId":"nm0657545","character":"Newscaster 2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Francesco Curá","urlProfile":"http://www.imdb.com/name/nm1832801","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MjM4MTIyN15BMl5BanBnXkFtZTcwNzM3NjEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 March 1977","placeOfBirth":" New York City, New York, USA","height":"6' 1½\" (1.87 m)","bio":"Born in New York City, Francesco Cura, spent much of his youth traveling. He is sometimes credited as Francis J. Cura, or Francesco Maria Cura. Francis grew up in a decidedly artistic family, often performing in plays that his father wrote, directed, and produced; had shot a commercial at the age of nine; and also worked in television during his formative years. He has starred in critically acclaimed feature films such as Hannah Can't Swim, Singularity, and The Deep and Dreamless Sleep. He has also guest starred in television series such as Criminal Minds, and Scrubs and has also worked in the theater, primarily in New York. Francis is also an accomplished visual artist across many mediums as well as a noted singer with a four-octave range. He resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MjM4MTIyN15BMl5BanBnXkFtZTcwNzM3NjEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1832801","name":"Francesco Curá","idIMDB":"nm1832801"},"actorId":"nm1832801","character":"Vineyard Worker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nikki Hahn","urlProfile":"http://www.imdb.com/name/nm3385478","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU4Mjg0NDgxOV5BMl5BanBnXkFtZTgwMTY5OTIzODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 2002","placeOfBirth":" San Antonio, Texas, USA","birthName":"Sofia Nicole Hahn","height":"5' 2\" (1.57 m)","bio":"Sofia Nicole Hahn was born in San Antonio, Texas, USA This Texas native began building a solid resume almost immediately after arriving in Hollywood at age 3. Before her first television appearance, Nikki enjoyed modeling for Disney Campaigns, GAP, American Girl, Agatha Ruiz De La Prada and Little Marc Jacobs to name a few but her but her real passion began to show through at an early age. In 2009 Nikki began landing solid roles in numerous network television shows including, CSI-Miami, NCIS-LA, The Closer, Criminal Minds as well as some of her favorite Disney and Nickelodeon shows, iCarly and Jessie. She also enjoys working on commercials and has landed over 23 national campaigns including her most recent State Farm commercial with Packers Quarterback Aaron Rodgers. In 2011 Nikki brought big laughs into everyone's living rooms when she starred as the daughter of Tom Hanks in a spoof skit of TLC's \"Toddlers & Tiaras\" on the Jimmy Kimmel Live post-Academy Awards special. Nikki played the role of \"Sophie Hanks,\" a child pageant queen with an overbearing stage Dad (Hanks). Immediately after the show's original airing, the segment went viral, giving the young actress a cult-like comedy following. The skit was also aired during the Oprah Winfrey Show in an interview with Tom Hanks and Julia Roberts. In 2012 Nikki displayed her ability in another genre when she was cast on her first \"villian\" role as sociopath child killer \"Jenny Reynolds\" for American Horror Story - Asylum in the episode \"Origins of Monstrosity\". Later this same year Nikki switches to a lighter role as she gets to play Selena Gomez's little cousin Bianca in \"Alex vs Alex\" The Wizards Return a Disney Channel Original Movie. 2013 was year of 'Mini-me's\" as Nikki gets to play young Lucy Hale when she lands the role of Mini Aria, for Pretty Little Liars in \"A is for ALIVE\". Although she only worked on that particular episode, this role really thrust her into the spotlight as Lucy Hale herself posted a couple of instagram pictures of Nikki and herself for the PLL fans to see. This same year she also played young Mia Mitchell as \"Young Callie\" in the episode \"Padre\" for The Fosters on ABC Family which received rave reviews. 2015 Nikki lands the coveted role of Emily Cooper in Disney's Adventures in Babysitting - 100th Disney Channel Original Movie (DCOM) with Sabrina Carpenter and Sofia Carson. The 100th DCOM was directed by John Schultz (Judy Moody and the Not Bummer Summer) and Exec.Produced by Michelle Manning (Teen Beach 2, The Breakfast Club, The Outsiders). Michelle Manning has become a personal friend and mentor for Nikki and friend of the family as well. Nikki is only 13 but has already been so fortunate to work alongside, and learn from Hollywood legends such as Jim Belushi, Kyra Sedgewick, Elijah Wood, Henry Winkler, cinematographer Janusz Kaminski, Elisabeth Rohm, Ken Leung and Two-Time Academy Awards Winners Tom Hanks and Jessica Lange.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU4Mjg0NDgxOV5BMl5BanBnXkFtZTgwMTY5OTIzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3385478","name":"Nikki Hahn","idIMDB":"nm3385478"},"actorId":"nm3385478","character":"Bianca","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Josiah Darden","urlProfile":"http://www.imdb.com/name/nm4824018","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NjU5NTkxOF5BMl5BanBnXkFtZTgwNDAxNzYzMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Josiah Darden is an actor, known for The Wizards Return: Alex vs. Alex (2013) and Bucket and Skinner's Epic Adventures (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NjU5NTkxOF5BMl5BanBnXkFtZTgwNDAxNzYzMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4824018","name":"Josiah Darden","idIMDB":"nm4824018"},"actorId":"nm4824018","character":"Gino","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2448374","urlIMDB":"http://www.imdb.com/title/tt2448374","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Disney Enterprises, Inc. © COPYRIGHT MCMXCI, MMI DISNEY ENTERPRISES, INC. All Rights Reserved"},"technical":{"runtime":["1 hr (60 min) (approx)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.6","filmingLocations":[{"location":"California, USA"}],"rated":"TV-G","awards":[{"award":"Imagen Foundation Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Imagen Award","categories":[{"category":"Best Actress/Television","names":[{"name":"Selena Gomez","id":"nm1411125","role":null}]},{"category":"Best Children's Programming","names":[]}]}]}],"votes":"3,763","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0135631","name":"It's a Laugh Productions"}],"keywords":{"keywords":["evil","girl slaps a boy","girl slaps boy","female hero","stupidity","villain played by lead actor","popcorn","split personality","double life","tickling","face slap","threat","italian","family reunion","alter ego","good versus evil"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:02:33"}}