{"data":{"movies":[{"title":"Get on Up","originalTitle":"","year":"2014","releaseDate":"20140801","directors":[{"name":"Tate Taylor","id":"nm0853238"}],"writers":[{"name":"Jez Butterworth","id":"nm0125336"},{"name":"John-Henry Butterworth","id":"nm3890871"}],"runtime":"139 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NjAyMTUzMl5BMl5BanBnXkFtZTgwMTM4NzQ4MTE@._V1.jpg","countries":["USA","UK"],"languages":["English"],"genres":["Biography","Drama","Music"],"plot":"On route to the stage, singer James Brown recalls a life with a turbulent childhood where music was his only constructive release for his passions. A chance demonstration of that in prison led to a new friend who helped get him out and into a musical career. With his fire and creative daring, Brown became a star who defiantly created new possibilities in show business both on and behind the stage in face of racism and conventional thinking. Along the way, James would also become a peacemaker who redefined and raised the African-American community's feeling of self-worth when it was needed most. However, those same domineering passions would lead James Brown alienating everyone around him as his appetites became ever more self-destructive. Only after he hit rock bottom with a serious mistake does Brown realize what he needs to do make his life as the Godfather of Soul truly worthwhile.","simplePlot":"A chronicle of 's rise from extreme poverty to become one of the most influential musicians in history.","actors":[{"actorName":"Chadwick Boseman","urlProfile":"http://www.imdb.com/name/nm1569276","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NzE1MjUyOV5BMl5BanBnXkFtZTcwMzI0MTE1Mw@@._V1_UY44_CR19,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1976","placeOfBirth":" Anderson, South Carolina, USA","height":"6' (1.83 m)","bio":"Chadwick Boseman was born on November 29, 1976 in Anderson, South Carolina, USA. He is an actor and producer, known for Captain America: Civil War (2016), 42 (2013) and Get on Up (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NzE1MjUyOV5BMl5BanBnXkFtZTcwMzI0MTE1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1569276","name":"Chadwick Boseman","nicknames":["Chad"],"idIMDB":"nm1569276"},"actorId":"nm1569276","character":"James Brown","urlCharacter":"http://www.imdb.com/character/ch0036196","main":true},{"actorName":"Nelsan Ellis","urlProfile":"http://www.imdb.com/name/nm1734700","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODI2NDI5MV5BMl5BanBnXkFtZTcwNDY4NDk0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Nelson Ellis","height":"5' 9¼\" (1.76 m)","bio":"Nelsan Ellis (born c. 1978) is an award-winning American film and television actor and playwright, perhaps best known as Lafayette Reynolds on HBO's True Blood. Ellis was born in Harvey, Illinois. Following his parents' divorce, Ellis and his mother moved to Alabama. He moved back to Illinois as a teenager, and graduated from Thornridge High School in Dolton, Illinois, in 1997. Ellis attended Juilliard and, while there, wrote a semi-autobiographical play titled Ugly that was performed at the school and later won the Lincoln Center's Martin E. Segal Award. Ellis won a 2008 Satellite Award from the International Press Academy for best supporting actor in a television series for his role as Lafayette Reynolds in HBO's True Blood. Ellis won the \"Brink of Fame: Actor\" award at the 2009 NewNowNext Awards.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODI2NDI5MV5BMl5BanBnXkFtZTcwNDY4NDk0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1734700","name":"Nelsan Ellis","idIMDB":"nm1734700"},"actorId":"nm1734700","character":"Bobby Byrd","urlCharacter":"http://www.imdb.com/character/ch0468259","main":true},{"actorName":"Dan Aykroyd","urlProfile":"http://www.imdb.com/name/nm0000101","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MDA3NTg0NF5BMl5BanBnXkFtZTYwMzM5ODgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1952","placeOfBirth":" Ottawa, Ontario, Canada","birthName":"Daniel Edward Aykroyd","height":"6' 1\" (1.85 m)","bio":"Daniel Edward Aykroyd was born on July 1, 1952 in Ottawa, Ontario, Canada, to Lorraine Hélène (Gougeon), a secretary from a French-Canadian family, and Samuel Cuthbert Peter Hugh Aykroyd, a civil engineer who advised prime minister Pierre Trudeau. Aykroyd attended Carleton University in 1969, where he majored in Criminology and Sociology, but he dropped out before completing his degree. He worked as a comedian in various Canadian nightclubs and managed an after-hours speakeasy, Club 505, in Toronto for several years. He worked with Second City Stage Troupe in Toronto and started his acting career at Carleton University with Sock'n'Buskin, the campus theater/drama club. Married to Donna Dixon since 1983, he has two daughters. His parents are named Peter and Lorraine and his brother Peter Aykroyd is a psychic researcher. Dan received an honorary Doctorate from Carleton University in 1994 and was made a Member of the Order of Canada in 1998.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MDA3NTg0NF5BMl5BanBnXkFtZTYwMzM5ODgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000101","name":"Dan Aykroyd","nicknames":["Danny"],"idIMDB":"nm0000101"},"actorId":"nm0000101","character":"Ben Bart","urlCharacter":"http://www.imdb.com/character/ch0468689","main":true},{"actorName":"Viola Davis","urlProfile":"http://www.imdb.com/name/nm0205626","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjYwMzI0NDY4OF5BMl5BanBnXkFtZTgwOTU4MDk1NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 August 1965","placeOfBirth":" Saint Matthews, South Carolina, USA","height":"5' 5\" (1.65 m)","bio":"Actress Viola Davis was born on her grandmother's farm, at the then-Singleton Plantation in St. Matthews, South Carolina. When she was two months old her family moved to Central Falls, Rhode Island, where her father, Dan Davis, worked as a horse groomer and trainer. Her mother, Mary Alice (Logan), a maid and factory worker, was also a civil rights activist. Davis was educated at Central Falls High School, where she developed a love of acting. She studied theater at Rhode Island College, and also attended the prestigious Juilliard School in New York City. Davis made her screen debut with a small role as a nurse in 1996's The Substance of Fire (1996). Guest spots followed in various TV shows and films, and in 2000 she won the role of Nurse Lynnette Peeler in City of Angels (2000). In 2001, Davis appeared on Broadway in the play, 'King Hedley II', for which she was awarded a Tony for Best Featured Actress in a Play. Davis has worked with Steven Soderbergh on three projects - Traffic (2000), Solaris (2002) and Syriana (2005). Other projects include Far from Heaven (2002), Antwone Fisher (2002) and Disturbia (2007). In 2008, she played Mrs. Miller in Doubt (2008), for which she was nominated for a Best Supporting Actress Oscar. In 2011, she won critical acclaim for her starring role as Aibileen Clark in the box-office hit The Help (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjYwMzI0NDY4OF5BMl5BanBnXkFtZTgwOTU4MDk1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0205626","name":"Viola Davis","idIMDB":"nm0205626"},"actorId":"nm0205626","character":"Susie Brown","urlCharacter":"http://www.imdb.com/character/ch0405386","main":true},{"actorName":"Lennie James","urlProfile":"http://www.imdb.com/name/nm0416694","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MzQ1MDEyMF5BMl5BanBnXkFtZTcwNjcwMDIyOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1965","placeOfBirth":" Nottingham, Nottinghamshire, England, UK","height":"5' 10\" (1.78 m)","bio":"Lennie James was born in Nottingham to Trinidadian parents, and grew up in South London. His mother, Phyllis Mary James, died when he was 12. Lennie and his older brother went into a council children's home. When he was 16 he was fostered with a social worker who had two older children, and they remain very close. Within a year Lennie began writing plays (Storm Damage was broadcast by the BBC in 2000 and won a Royal Television Society (RTS) award in 2001). Lennie received his training at the Guildhall School of Music & Drama from which he graduated in 1988.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MzQ1MDEyMF5BMl5BanBnXkFtZTcwNjcwMDIyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0416694","name":"Lennie James","idIMDB":"nm0416694"},"actorId":"nm0416694","character":"Joe Brown","urlCharacter":"http://www.imdb.com/character/ch0491623","main":true},{"actorName":"Fred Melamed","urlProfile":"http://www.imdb.com/name/nm0577329","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1MTM1MTc4MDZeQTJeQWpwZ15BbWU3MDQ4MjA3ODI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 May 1956","placeOfBirth":" New York City, New York, USA","height":"6' 1\" (1.85 m)","bio":"Highly gifted, heavy-set character actor Fred Melamed was born in New York City, the son of Syma (Krichefsky), an actress, and Louis Melamed. His father was a television producer, having contributed to such watershed comedies as Car 54, Where Are You, and Sargeant Bilko. He received his theatrical training at the Yale School of Drama, after which he appeared with resident companies including Minneapolis' Guthrie Theater, The Kennedy Center, The Yale Repertory Theater, and as a founding member of Shakespeare & Co. In 1983, he made his Broadway debut in the Tony Award-Winning Amadeus. On television, Melamed headlines with Maria Bamford on the hit Netflix series, Lady Dynamite, from Mitch Hurwitz and Pam Brady. He recurs as errant father Charles Cole on Hulu's Golden Globe-nominated Casual, patrician chick-magnet J. Cronkite Valley Forge on New Girl, sports casting legend Glen Klose on Now We're Talking, and Sir Patrick Stewart's messed-up psychiatrist Dr. Mendelson on Starz' Blunt Talk. In the past, Melamed's major small screen roles have included Harvey Oberholt on House of Lies, Avi Mensusen on Girls, Professor Donald Holt on Married, Leonard Hillman on Childrens Hospital, Larry David's name-dropping psychiatrist Arthur Thurgood from Curb Your Enthusiasm, tough-guy jurist Alan Karpman on The Good Wife, and irascible voiceover legend Fred Melamed opposite Robin Williams on The Crazy Ones. In film, Melamed has had a long association with Woody Allen. He has appeared in 7 Allen films, including the Oscar-Winning Hannah and Her Sisters, Another Woman, Crimes and Misdemeanors, Radio Days, Husbands & Wives, Hollywood Ending, and Shadows and Fog. But it was for his portrayal of \"sensitive\" villain Sy Ableman, in Joel and Ethan Coen's A Serious Man, nominated for Best Picture at the 2010 Academy Awards, that Melamed became most widely known. For his performance, he won the Independent Spirit Robert Altman Award, New York Magazine listed his as among the Best Performances of The Decade, and Empire called Sy Ableman \"One of The Best Coen Bros. Characters of All Time.\" Melamed appeared on the Best Supporting Actor Oscar ballot of several American critics, including A.O. Scott of The New York Times, Roger Ebert of The Chicago Sun-Times, and Michael Phillips of The Chicago Tribune. He was named by Harry Domenico Rossi as among The 25 Greatest Screen Villains of All Time. Melamed also starred as Sam Sotto, insecure king of movie trailer voices in Lake Bell's \"In a World...\" , a film about a father and daughter in the voiceover world. The film won the Waldo Salt Award for Best Screenplay at Sundance. He starred opposite Elliott Gould in Fred Won't Move Out, a picture detailing the decline of a stubborn patriarch and his family, and as James Brown's record company owner Syd Nathan in Get On Up. Among Melamed's other films are Bone Tomahawk, opposite Kurt Russell and Richard Jenkins, The Dictator, with Sacha Baron Cohen and Sir Ben Kingsley, Peter Yates' Suspect, with Cher, Dennis Quaid and Liam Neeson, The Good Mother, with Diane Keaton and Jason Robards, Roland Joffe's The Mission, with Robert De Niro and Jeremy Irons, James Toback's The Pickup Artist, with Robert Downey, Jr. and Dennis Hopper, and Marshall Brickman's Lovesick, with Dudley Moore and Sir Alec Guinness. As a writer, he has produced screenplays including Girl of the Perfume River, A Jones for Gash, and most recently The Preservationist, a fictional film inspired by the case of Melamed's college friend, Edward Forbes Smiley III, a renowned cartographic expert and dealer, who admitted to having been the most brazen and prolific map thief of all time. He lives with his wife and twin sons in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1MTM1MTc4MDZeQTJeQWpwZ15BbWU3MDQ4MjA3ODI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0577329","name":"Fred Melamed","idIMDB":"nm0577329"},"actorId":"nm0577329","character":"Syd Nathan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Craig Robinson","urlProfile":"http://www.imdb.com/name/nm0732497","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjIyMTU2Nl5BMl5BanBnXkFtZTcwMzExODEyMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1971","placeOfBirth":" Chicago, Illinois, USA","birthName":"Craig Phillip Robinson","height":"6' 2\" (1.88 m)","bio":"Craig Robinson was born on October 25, 1971 in Chicago, Illinois, USA as Craig Phillip Robinson. He is an actor, known for This Is the End (2013), Pineapple Express (2008) and Hot Tub Time Machine (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjIyMTU2Nl5BMl5BanBnXkFtZTcwMzExODEyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0732497","name":"Craig Robinson","idIMDB":"nm0732497"},"actorId":"nm0732497","character":"Maceo Parker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jill Scott","urlProfile":"http://www.imdb.com/name/nm0779325","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM2MDIzMzAxNV5BMl5BanBnXkFtZTcwNTQ1NDg1OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1972","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"5' 6\" (1.68 m)","bio":"Born in 1972 in North Philadelphia, Jill Scott grew up in the ghetto with her mother, Joyce, and grandmother. A deeply loved and gifted child, she learned to talk at only eight months and was reading by age four. Always the center of attention, her principal in elementary school described her as a little butterfly. After running from Jill's abusive stepfather, mother and child moved in with Jill's grandmother, with whom she had a very close bond. After a rough but memorable childhood, Scott attended Temple University, studying secondary education. She was planning on becoming a high-school English teacher. When she was placed at a school as a student-teacher, her fellow professors disapproved of her unique method of teaching the kids: she often incorporated singing and melody in order to help with memorization. Due to the negative comments she was receiving, she quit. Shortly thereafter, a friend helped her in joining a local theater troop. After some hard work, she earned a spot on the Canadian cast of Rent, began to do poetry readings and befriended some big names in the Philly artistic community, included DJ Jazzy Jeff (DJ Jazzy Jeff). It was here that Scott's musical career took off. Encouraged by Jazzy Jeff and Ahmir-Khalib Thompson (Ahmir \"Questolove\" Thompson) of the hip-hop group The Roots, Scott wrote several songs in only three days during the summer of 1999. One of them, entitled \"You Got Me,\" was performed by Erykah Badu and The Roots, and won a Grammy for Best Rap Performance (Duo or Group). A few months later, after Jeff burned 100 demo CDs and marketed the soul singer, Jill Scott signed with the new label Hidden Beach. During this whole process and since then, she collaborated with Will Smith and Common, and worked on soundtracks for Les pieds sur terre (2001), Wild Wild West (1999) and In Too Deep (1999) Amazingly, she made 50 songs for her debut album and had a lot of trouble trimming it down. Finally, after much deliberation, \"Who Is Jill Scott? Words & Sounds, Vol. I\" was released in July 2000. It featured music that was youthful enough for the younger generation and soulful enough for those above 40. Accolades came pouring in for her unique contribution to hip-hop: \"Who Is Jill Scott?\" was certified platinum, and she received three Grammy nominations (including one for Best New Artist), three NAACP Image rewards and one Soul Train Award for Best Female R&B Album. Her fame carried her on stage as she performed on VH1's Divas Live with Aretha Franklin; speaking of Aretha, Jill Scott was the 2001 recipient of the Aretha Franklin Award as \"Entertainer of the Year\" at the Lady of Soul Awards. Never limited to music, Jill Scott is a true multimedia brand across books, clothing, TV and film. Most recently, Jill starred in Get On Up: A James Brown Biopic, as DeeDee, the wife of James Brown. She also starred alongside Tyler Perry & Janet Jackson in the #1 national movie series Why Did I Get Married? (Pt. 1 and 2), Baggage Claim, Steel Magnolias and Sins of the Mother which aired on Lifetime and became the second-most watched premiere in the network's history. Jill was casted as the lead character in the HBO/BBC mini series filmed on location in Botswana, The No.1 Ladies Detective Agency, a Peabody Award-winning show directed by the late Oscar Award-winning director Anthony Minghella. A consummate writer at heart, she penned The Moments, The Minutes, The Hours, a compilation of poems that instantly became a New York Times bestseller. Scott also developed an intimates line for Ashley Stewart and founded Blues Babe, a registered 501(c)3 foundation that has raised over hundreds of thousands dollars to support minority students pursuing college degrees. Jill recently released her highly anticipated 5th studio album WOMAN on July 24, 2015 which opened on the music charts at #1 giving Jill her 2nd consecutive number one album. After a nationwide sold out tour in Summer 2015, Jill is working on Lionsgate's Coco and FX's Snowfall.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM2MDIzMzAxNV5BMl5BanBnXkFtZTcwNTQ1NDg1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0779325","name":"Jill Scott","nicknames":["Jilly from Philly","The Lady Jill Scott"],"idIMDB":"nm0779325"},"actorId":"nm0779325","character":"DeeDee Brown","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Octavia Spencer","urlProfile":"http://www.imdb.com/name/nm0818055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MjcwMjcxNl5BMl5BanBnXkFtZTcwMjkwODg0Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1970","placeOfBirth":" Montgomery, Alabama, USA","birthName":"Octavia Lenora Spencer","height":"5' 2\" (1.57 m)","bio":"Spencer is a native of Montgomery, Alabama, which she claims is the proverbial buckle of the Bible belt. She's the sixth of seven siblings and holds a BS in Liberal Arts from Auburn University. A \"closet\" lover of acting, this practical Alabamian knew that she'd someday work in the film industry, but never dreamed it would be in front of the camera. In 1995, acclaimed director Joel Schumacher changed all that by giving her a small part opposite Sandra Bullock in the hit film A Time to Kill, and Spencer was on her way. In 1996, she teamed up with Bullock again in Bullock's directorial debut of Making Sandwiches, a short film that premiered at the 1997 Sundance Film Festival. Spencer made her stage debut in Los Angeles and originated the role of \"LaSonia\" (pronounced lasagna) in famed writer/director Del Shore's, The Trials and Tribulations of a Trailer Trash Housewife, starring opposite veteran actors Beth Grant, Dale Dickey and David Steen (2003). The play garnered Spencer and her fellow cast mates critical acclaim and a bevy of awards. Since then, Spencer has continued to see success as an actor in both film and television, working alongside Hollywood's elite. In February 2009, she was lauded by Los Angeles Times publication: The Envelope, for her brief but memorable performance in the Will Smith drama Seven Pounds.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MjcwMjcxNl5BMl5BanBnXkFtZTcwMjkwODg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0818055","name":"Octavia Spencer","idIMDB":"nm0818055"},"actorId":"nm0818055","character":"Aunt Honey","urlCharacter":"http://www.imdb.com/character/ch0406616","main":true},{"actorName":"Josh Hopkins","urlProfile":"http://www.imdb.com/name/nm0005020","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNDMyNDM3MTVeQTJeQWpwZ15BcmVzdW1l._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1970","placeOfBirth":" Lexington, Kentucky, USA","birthName":"William Joshua Hopkins","height":"6' 2\" (1.88 m)","bio":"Josh Hopkins was born on September 12, 1970 in Lexington, Kentucky, USA as William Joshua Hopkins. He is an actor, known for Cougar Town (2009), The Perfect Storm (2000) and G.I. Jane (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNDMyNDM3MTVeQTJeQWpwZ15BcmVzdW1l._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005020","name":"Josh Hopkins","idIMDB":"nm0005020"},"actorId":"nm0005020","character":"Ralph Bass","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brandon Mychal Smith","urlProfile":"http://www.imdb.com/name/nm0807506","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MDY5NzczOF5BMl5BanBnXkFtZTgwODEwNTQyODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 May 1989","placeOfBirth":"","birthName":"Brandon Mychal Smith","height":"6' 1\" (1.85 m)","bio":"Brandon Smith started acting at the tender age of 8 years old. Soon, he booked his first national commercial for Nike with Tiger Woods. Brandon Smith has garnered a legion of loyal fans for playing the iconic role of super-suave Nico Harris on the Disney Channel series \"So Random\" (\"Sonny with a Chance\"). In 2006, Smith won a Family Television Award and a Young Artist Award for his portrayal as Tayshawn in the Emmy Award-nominated television movie \"The Ron Clark Story\" opposite Matthew Perry. His other film credits include \"Gridiron Gang\" opposite Dwayne \"The Rock\" Johnson and \"Weapons\" with Nick Cannon. Brandon just wrapped shooting the Universal feature film, \"Get On Up,\" opposite Chadwick Boseman, for Director Tate Taylor, playing the iconic role of Little Richard. As well, he recently completed shooting the FX pilot \"You're The Worst,\" Forest Whitaker's feature film \"Sacrifice\" starring Dermot Mulroney and the feature film \"Hoovey\" starring Patrick Warburton and Lauren Hollly. Brandon makes his home in Los Angeles and is very close with his parents and younger sister Kimberly.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MDY5NzczOF5BMl5BanBnXkFtZTgwODEwNTQyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0807506","name":"Brandon Mychal Smith","idIMDB":"nm0807506"},"actorId":"nm0807506","character":"Little Richard","urlCharacter":"http://www.imdb.com/character/ch0040091","main":true},{"actorName":"Tika Sumpter","urlProfile":"http://www.imdb.com/name/nm1754366","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MTAzMzg1NV5BMl5BanBnXkFtZTgwODIxOTc3MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1980","placeOfBirth":" Queens, New York, USA","birthName":"Euphemia L. Sumpter","height":"5' 7\" (1.7 m)","bio":"Tika Sumpter was born in New York and graduated from Marymount Manhattan College. Sumpter began her career as model, before she landed the role of \"Layla Williamson\" in ABC's daytime soap opera, One Life to Live (1968) (2005-2010, 2011). After she left the soap, Sumpter won a recurring role in the CW series, Gossip Girl (2007), and appeared in the BET sitcom, The Game (2006). After supporting roles in the films, Stomp the Yard 2: Homecoming (2010), Salt (2010), What's Your Number? (2011) and Think Like a Man (2012), she was cast alongside Jordin Sparks and Whitney Houston in the 2012 musical film, Sparkle (2012). In 2013, she was cast as vixen \"Candace Young\" in the OWN drama series, The Haves and the Have Nots (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MTAzMzg1NV5BMl5BanBnXkFtZTgwODIxOTc3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1754366","name":"Tika Sumpter","idIMDB":"nm1754366"},"actorId":"nm1754366","character":"Yvonne Fair","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aunjanue Ellis","urlProfile":"http://www.imdb.com/name/nm0254712","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2Mzk4NjQ3NF5BMl5BanBnXkFtZTYwMjE5MjIz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1969","placeOfBirth":" San Francisco, California, USA","birthName":"Aunjanue L. Ellis","height":"5' 9\" (1.75 m)","bio":"Aunjanue Ellis was born in San Francisco, California. She graduated from the Brown University, and later attended New York University's Tisch School of the Arts. During her career, Ellis performed on Off-Broadway theater, appeared in many film, and had roles on television. In film, she is best known for her roles in \"Men of Honor\" (2000), \"Undercover Brother\" (2002), \"Ray\" (2004), and \"The Help\" (2011). On television, Ellis had her most significant role on the 2015 mini-series, \"The Book of Negroes\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2Mzk4NjQ3NF5BMl5BanBnXkFtZTYwMjE5MjIz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0254712","name":"Aunjanue Ellis","idIMDB":"nm0254712"},"actorId":"nm0254712","character":"Vicki Anderson","urlCharacter":"http://www.imdb.com/character/ch0415843","main":true},{"actorName":"Tariq Trotter","urlProfile":"http://www.imdb.com/name/nm0873699","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5MTUwMTg2NjFeQTJeQWpwZ15BbWU4MDYwOTc2NzAx._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1971","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"5' 7\" (1.7 m)","bio":"Tariq Trotter was born on October 3, 1971 in Philadelphia, Pennsylvania, USA. He is known for his work on The Deuce (2017), Zoolander 2 (2016) and Popstar: Never Stop Never Stopping (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5MTUwMTg2NjFeQTJeQWpwZ15BbWU4MDYwOTc2NzAx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0873699","name":"Tariq Trotter","idIMDB":"nm0873699"},"actorId":"nm0873699","character":"Pee Wee Ellis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aloe Blacc","urlProfile":"http://www.imdb.com/name/nm3945456","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMTU0NzUzOF5BMl5BanBnXkFtZTcwNzU2MDQ1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Aloe Blacc has been married to Maya Jupiter since 2010. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMTU0NzUzOF5BMl5BanBnXkFtZTcwNzU2MDQ1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3945456","name":"Aloe Blacc","idIMDB":"nm3945456"},"actorId":"nm3945456","character":"Nafloyd Scott","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2473602","urlIMDB":"http://www.imdb.com/title/tt2473602","business":{"budget":{"money":"$30,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$13,585,915","country":"USA","day":"03","month":"08","year":"2014","remarks":"2,468 Screens"}],"gross":[{"money":"$22,927,000","country":"USA","day":"10","month":"08","year":"2014","remarks":""},{"money":"$13,585,915","country":"USA","day":"03","month":"08","year":"2014","remarks":""}],"weekendGross":[{"money":"$5,012,000","country":"USA","day":"10","month":"08","year":"2014","remarks":"2,469 Screens"},{"money":"$13,585,915","country":"USA","day":"03","month":"08","year":"2014","remarks":"2,468 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"Universal Studios"},"technical":{"runtime":["2 hr 19 min (139 min)"],"soundMix":["SDDS","Datasat","Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arri Alexa, Panavision Primo and Angenieux Optimo Lenses","Canon EOS C500, Canon Cinema and EF Lenses","Canon EOS Rebel T3, Canon EF Lenses","Ikegami EC-35, Canon Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["3,818.78 m (8 reels)"],"negativeFormat":["Gemini 4:4:4","Video (HD)"],"cinematographicProcess":["ARRIRAW (2.8K) (source format)","Canon Cinema RAW (4K) (source format) (some scenes)","Canon H264 (1080p/24) (source format) (some shots)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["35 mm (spherical) (Kodak Vision 2383)","D-Cinema"]},"rating":"6.9","metascore":"71","filmingLocations":[{"location":"Natchez, Mississippi, USA"}],"rated":"PG-13","awards":[{"award":"Screen Actors Guild Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Actor","categories":[{"category":"Outstanding Action Performance by a Stunt Ensemble in a Motion Picture","names":[{"name":"Tim Bell","id":"nm1419241","role":null},{"name":"Sean Paul Braud","id":"nm3762501","role":null},{"name":"Chris Bryant","id":"nm4482917","role":null},{"name":"Alan D'Antoni","id":"nm2151484","role":null},{"name":"Danny Epper","id":"nm0258342","role":null},{"name":"Philip Fornah","id":"nm4903281","role":null},{"name":"Lex D. Geddings","id":"nm0311470","role":null},{"name":"Thirl Haston","id":"nm0368640","role":null},{"name":"Floyd Anthony Johns Jr.","id":"nm5545351","role":null},{"name":"David Andrew Nash","id":"nm0621707","role":null},{"name":"Charlie Picerni","id":"nm0681604","role":null},{"name":"Steven Ritzi","id":"nm0728899","role":null},{"name":"William Scharpf","id":"nm0770179","role":null},{"name":"Buddy Sosthand","id":"nm0815383","role":null},{"name":"John Zimmerman","id":"nm0956729","role":null}]}]}]},{"award":"African-American Film Critics Association (AAFCA) 2014","titlesAwards":[{"titleAwardOutcome":"Won AAFCA Award","categories":[{"category":"Best Ensemble","names":[]},{"category":"Top 10 Films","names":[]}]}]},{"award":"BET Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated BET Award","categories":[{"category":"Best Actress","names":[{"name":"Viola Davis","id":"nm0205626","role":null},{"name":"The Disappearance of Eleanor Rigby: Them","id":"tt3729920","role":null},{"name":"How to Get Away with Murder","id":"tt3205802","role":null}]}]}]},{"award":"Black Film Critics Circle Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won BFCC Award","categories":[{"category":"Top Ten Films","names":[]}]}]},{"award":"Black Reel Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Outstanding Actor, Motion Picture","names":[{"name":"Chadwick Boseman","id":"nm1569276","role":null}]},{"category":"Outstanding Supporting Actor, Motion Picture","names":[{"name":"Nelsan Ellis","id":"nm1734700","role":null}]},{"category":"Outstanding Ensemble","names":[{"name":"Kerry Barden","id":"nm0054234","role":null},{"name":"Paul Schnee","id":"nm1312197","role":null}]}]}]},{"award":"Camerimage 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Frog","categories":[{"category":"Main Competition","names":[{"name":"Stephen Goldblatt","id":"nm0003552","role":null}]}]}]},{"award":"Grammy Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Grammy","categories":[{"category":"Best Compilation Soundtrack for Visual Media","names":[{"name":"Peter Afterman","id":"nm0012782","role":"compilation producer"},{"name":"Harry Weinger","id":"nm3277103","role":"compilation producer"}]}]}]},{"award":"Guild of Music Supervisors Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated GMS Award","categories":[{"category":"Best Music Supervision for Films Budgeted Over 25 Million Dollars","names":[{"name":"Budd Carr","id":"nm0139623","role":null},{"name":"Margaret Yen","id":"nm0947455","role":null}]}]}]},{"award":"Hollywood Makeup Artist and Hair Stylist Guild Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Artisan","categories":[{"category":"Best Period and/or Character Hair Styling - Feature Films","names":[{"name":"Carla Farmer","id":"nm0267732","role":null},{"name":"Shannon Bakeman","id":"nm3936461","role":null}]}]}]},{"award":"Image Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Image Award","categories":[{"category":"Outstanding Motion Picture","names":[]},{"category":"Outstanding Actor in a Motion Picture","names":[{"name":"Chadwick Boseman","id":"nm1569276","role":null}]},{"category":"Outstanding Supporting Actress in a Motion Picture","names":[{"name":"Jill Scott","id":"nm0779325","role":null}]},{"category":"Outstanding Supporting Actress in a Motion Picture","names":[{"name":"Octavia Spencer","id":"nm0818055","role":null}]},{"category":"Outstanding Supporting Actress in a Motion Picture","names":[{"name":"Viola Davis","id":"nm0205626","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 2015","titlesAwards":[{"titleAwardOutcome":"Won Golden Reel Award","categories":[{"category":"Best Sound Editing - Music in a Musical Feature Film","names":[{"name":"Curt Sobel","id":"nm0811749","role":"supervising music editor"},{"name":"Jordan Corngold","id":"nm0180383","role":"music editor"},{"name":"Bill Bernstein","id":"nm0077007","role":"music editor"},{"name":"Stephanie Lowry","id":"nm0523370","role":"music editor"},{"name":"Richard Henderson","id":"nm0376579","role":"music editor"}]}]}]},{"award":"New York Film Critics, Online 2014","titlesAwards":[{"titleAwardOutcome":"Won NYFCO Award","categories":[{"category":"Best Use of Music","names":[{"name":"Thomas Newman","id":"nm0002353","role":"original score"},{"name":"Budd Carr","id":"nm0139623","role":"music supervisor"}]}]}]},{"award":"Santa Barbara International Film Festival 2015","titlesAwards":[{"titleAwardOutcome":"Won Virtuoso Award","categories":[{"category":"","names":[{"name":"Chadwick Boseman","id":"nm1569276","role":null}]}]}]},{"award":"St. Louis Film Critics Association, US 2014","titlesAwards":[{"titleAwardOutcome":"Nominated SLFCA Award","categories":[{"category":"Best Soundtrack","names":[]}]}]},{"award":"Village Voice Film Poll 2014","titlesAwards":[{"titleAwardOutcome":"Nominated VVFP Award","categories":[{"category":"Best Actor","names":[{"name":"Chadwick Boseman","id":"nm1569276","role":null}]}]}]}],"votes":"16,791","type":"Movie","companyCreditsSimple":[{"idCompany":"co0003687","name":"Imagine Entertainment"},{"idCompany":"co0103895","name":"Jagged Films"},{"idCompany":"co0345136","name":"Wyolah Films"}],"keywords":{"keywords":["african american","in medias res","breaking the fourth wall","1970s","1980s","mother son relationship","1950s","1960s","gospel music","troubled childhood","brothel","popular music","concert","rhythm and blues","music promotion","performer","funky music","black man","black musician","soul music"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:07:10"}}