{"data":{"movies":[{"title":"Left Behind","originalTitle":"","year":"2014","releaseDate":"20141003","directors":[{"name":"Vic Armstrong","id":"nm0002184"}],"writers":[{"name":"Jerry B. Jenkins","id":"nm0420874"},{"name":"Tim LaHaye","id":"nm0481542"}],"runtime":"110 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4MjA2OTQxMF5BMl5BanBnXkFtZTgwMjcyMTI2MjE@._V1.jpg","countries":["USA","Canada"],"languages":["English"],"genres":["Action","Drama","Fantasy","Mystery","Thriller"],"plot":"A small group of survivors are left behind after millions of people suddenly vanish and the world is plunged into chaos and destruction.","simplePlot":"A small group of survivors are left behind after millions of people suddenly vanish and the world is plunged into chaos and destruction.","actors":[{"actorName":"Nicolas Cage","urlProfile":"http://www.imdb.com/name/nm0000115","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMDM4Nzk2MV5BMl5BanBnXkFtZTcwNTcwNjExOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1964","placeOfBirth":" Long Beach, California, USA","birthName":"Nicholas Kim Coppola","height":"6' (1.83 m)","bio":"Nicolas Cage was born Nicolas Kim Coppola in Long Beach, California, the son of comparative literature professor August Coppola (whose brother is director Francis Ford Coppola) and dancer/choreographer Joy Vogelsang. He is of Italian (father) and Polish, German, and English (mother) descent. Cage changed his name early in his career to make his own reputation, succeeding brilliantly with a host of classic, quirky roles by the late 1980s. Initially studying theatre at Beverly Hills High School (though he dropped out at seventeen), he secured a bit part in Fast Times at Ridgemont High (1982) -- most of which was cut, dashing his hopes and leading to a job selling popcorn at the Fairfax Theater, thinking that would be the only route to a movie career. But a job reading lines with actors auditioning for uncle Francis' Rumble Fish (1983) landed him a role in that film, followed by the punk-rocker in Valley Girl (1983), which was released first and truly launched his career. His one-time passion for method acting reached a personal limit when he smashed a street-vendor's remote-control car to achieve the sense of rage needed for his gangster character in The Cotton Club (1984). In his early 20s, he dated Jenny Wright for two years and later linked to Uma Thurman. After a relationship of several years with Christina Fulton, a model, they split amicably and share custody of a son, Weston Cage (b.1992). In 2004, he married Alice Kim Cage, with whom he has a son.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMDM4Nzk2MV5BMl5BanBnXkFtZTcwNTcwNjExOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000115","name":"Nicolas Cage","nicknames":["Nick"],"idIMDB":"nm0000115"},"actorId":"nm0000115","character":"Rayford Steele","urlCharacter":"http://www.imdb.com/character/ch0022176","main":true},{"actorName":"Chad Michael Murray","urlProfile":"http://www.imdb.com/name/nm0614877","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODcxNjYyMDU5NF5BMl5BanBnXkFtZTcwMTQ1NDcxNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1981","placeOfBirth":" Buffalo, New York, USA","birthName":"Chad Michael Murray","height":"6' (1.83 m)","bio":"Chad Michael Murray has showcased his brooding good looks and acting talent on television sets and silver screens for two decades. The 6-foot tall star, who resides in Wilmington, North Carolina, is known to audiences of One Tree Hill (2003), where he played the good son, Lucas Scott. The model-turned-actor has also serenaded Jamie Lee Curtis with Britney Spears' \"Baby One More Time\" in Freaky Friday (2003), became Hilary Duff's \"Prince Charming\" in A Cinderella Story (2004), and even watched Paris Hilton die a violent on-screen death in La maison de cire (2005). Chad Michael Murray was born in Buffalo, New York. Growing up, his mother left his family at a young age and he had to help take care of his younger siblings, together with his brother and his father, Rex Murray, an air traffic controller. While working his way through adolescence, he learned a lot about work ethics, which eventually helped built his character. Chad once said in an interview that he could call his father anytime of the day whenever he needs help as his father is \"his rock\". The One Tree Hill (2003) star started his life as a paper boy, delivering newspapers around the neighborhood before working as a janitor at Donut World. Chad only worked there for a few days when he lost his job because he was shooting Skittles into the deep-fryer. Sure enough, one of the Skittles got caught in the machine and Chad got fired. Chad also worked as a receptionist at a limousine company. When he was 15, he had a resection of his small intestines. His intestines were so twisted they had to be cut out, but there were some complications causing him to not be able to eat for three months. Chad also broke his nose when he was jumped at a Burger King outlet which then required him to be admitted into the hospital. It was there where he met the person who inspired him, his nurse. His nurse was a model and she told Chad to start modeling, but Chad only wanted to act. Chad then took a chance and went to a convention in Buffalo and they wanted him to go to another convention in Biloxi, Mississipi. There, he met a man named Eddie Winkler, who offered Chad a place to stay in Los Angeles to kick-start his career. Not long afterwards, Chad was hired for a Tommy Hilfiger campaign which helped paid his bills and that was when he thought he could really focus on acting. He started out on Dawson's Creek (1998) with his two One Tree Hill (2003) co-stars, Hilarie Burton and Lee Norris. Two years later, he scored the role of rich brat \"Tristian DuGrey\" on Gilmore Girls (2000) before playing \"Lucas Scott\", one half of the young Scott brothers in the popular teen drama One Tree Hill (2003), where he met best friends James Lafferty and Tyler Hilton. Chad also starred in the B-horror flick La maison de cire (2005). He starred in Lionsgate's The Haunting in Connecticut 2: Ghosts of Georgia (2013) and the socially important Indie film, To Write Love on Her Arms (2012) (Kat Dennings, Rupert Friend). Going round the festival circuit, Chad played \"Thatcher\", an HIV-positive character, in the short film The Carrier (2011) (Rita Wilson, Anna Paquin). Murray also released \"Everlast\", his first graphic novel. \"Everlast\" is a passion project of his that tells the story of the tragic hero, \"Derek Everlast\", as he follows his journey to save the world before the \"End of Days\". Chad played football growing up and his love for the sport was projected in a charity game where he would help underprivileged kids with the money he gains from audiences. A fan of philosophy himself, Chad's favorite book is \"Catcher in the Rye\" by J.D. Salinger. He enjoys listening to music from Incubus, Frank Sinatra, James Brown and watching shows such as The Simpsons (1989) and Fear Factor (2001). As for movies, Chad has given credit to Gladiator (2000), Fight Club (1999), Varsity Blues (1999) & Any Given Sunday (1999) as his favorites. Chad married his One Tree Hill (2003) co-star, Sophia Bush, when he was 23. He reportedly cried on his wedding day, the 16th of April, 2005. After less than a year of marriage, the couple signed for an annulment. Chad was also engaged to actress Kenzie Dalton for a few years. In 2015, Chad married actress and model Sarah Roemer, and the two are expecting a child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODcxNjYyMDU5NF5BMl5BanBnXkFtZTcwMTQ1NDcxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0614877","name":"Chad Michael Murray","nicknames":["CMM"],"idIMDB":"nm0614877"},"actorId":"nm0614877","character":"Buck Williams","urlCharacter":"http://www.imdb.com/character/ch0022173","main":true},{"actorName":"Cassi Thomson","urlProfile":"http://www.imdb.com/name/nm2216125","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NDE4OTk0MV5BMl5BanBnXkFtZTgwMTc0NzQwMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1993","placeOfBirth":" Australia","birthName":"Cassi Nicole Thomson","height":"5' 3\" (1.6 m)","bio":"Cassi Thomson was born on August 14, 1993 in Australia as Cassi Nicole Thomson. She is an actress, known for Left Behind (2014), Grave Halloween (2013) and The Last Bid (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NDE4OTk0MV5BMl5BanBnXkFtZTgwMTc0NzQwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2216125","name":"Cassi Thomson","idIMDB":"nm2216125"},"actorId":"nm2216125","character":"Chloe Steele","urlCharacter":"http://www.imdb.com/character/ch0022177","main":true},{"actorName":"Nicky Whelan","urlProfile":"http://www.imdb.com/name/nm1764351","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3NDY4NzUxNF5BMl5BanBnXkFtZTgwODI0OTExOTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"height":"5' 4¼\" (1.63 m)","bio":"Nicky Whelan is an Australian actress and model, best-known for her role as \"Pepper Steiger\" in the Australian television series, Les voisins (1985). She is the granddaughter of AFL Brownlow Medallist Marcus Whelan. Whelan has completed work for the movie, Hollywood & Wine (2011), in Los Angeles. She costarred with David Spade. Whelan appeared in the final season of Scrubs (2001) as \"Maya\", an Australian medical school student. Whelan also played the role of \"Leigh\" in the 2011 film, Hall Pass (2011), which co-starred Owen Wilson, Jason Sudeikis, Jenna Fischer and Christina Applegate.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3NDY4NzUxNF5BMl5BanBnXkFtZTgwODI0OTExOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1764351","name":"Nicky Whelan","idIMDB":"nm1764351"},"actorId":"nm1764351","character":"Hattie Durham","urlCharacter":"http://www.imdb.com/character/ch0022175","main":true},{"actorName":"Jordin Sparks","urlProfile":"http://www.imdb.com/name/nm2554052","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MTU5MjM0OV5BMl5BanBnXkFtZTcwNzQxMzQ5Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 December 1989","placeOfBirth":" Phoenix, Arizona, USA","birthName":"Jordin Brianna Sparks","height":"5' 10\" (1.78 m)","bio":"Jordin Sparks was born on December 22, 1989 in Phoenix, Arizona, USA as Jordin Brianna Sparks.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MTU5MjM0OV5BMl5BanBnXkFtZTcwNzQxMzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2554052","name":"Jordin Sparks","nicknames":["Jo Jo","Jordin Speezy"],"idIMDB":"nm2554052"},"actorId":"nm2554052","character":"Shasta Carvell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lea Thompson","urlProfile":"http://www.imdb.com/name/nm0000670","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5ODcyODUwMl5BMl5BanBnXkFtZTgwMTA3MDg1MjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1961","placeOfBirth":" Rochester, Minnesota, USA","birthName":"Lea Katherine Thompson","height":"5' 3\" (1.6 m)","bio":"Lea Katherine Thompson was born on May 31, 1961, in Rochester, Minnesota. She is the youngest of five children. Her parents are Barbara Anne (Barry) and Clifford Elwin \"Cliff\" Thompson. Since all her siblings were much older than she, Lea says it seemed like she had more than two parents. The family lived in the Starlight Motel, all the kids sharing a room. Things began to look up for the family when Lea's father got a job in Minneapolis, where the family moved. Lea's parents divorced when she was six, and her mother decided to maintain the family. This wasn't the easiest job, considering her mother was alcohol-addicted at the time. When she found the strength to quit drinking, she took a job playing the piano and singing in a bar to support Lea and her siblings. When Lea was seven, her mother remarried. Ever since Lea was little, she loved to dance -- ballet to be exact. She would practice three to four hours every day. Her first role was as a mouse in \"The Nutcracker\". After Lea turned fourteen, she had performed in more than 45 ballets on stages, such as The Minnesota Dance Theatre, The Pennsylvania Ballet Company, and The Ballet Repertory. She won scholarships to The American Ballet Theatre and The San Francisco Ballet. At age nineteen, she auditioned for Mikhail Baryshnikov, who later told her that she was \"a beautiful dancer... but too stocky\". Lea knew her dreams had been crushed. At that point, she decided to turn to acting. She began working as a waitress, also making 22 Burger King commercials and a few Twix commercials. She was perfect for these parts simply because she was the average girl-down-the-street, from the Midwest. Everyone who knows her can't believe she was and still is so completely different...trying to be independent and fight against the system. In 1982, Lea made some type of a computer game or interactive movie known as \"Murder, Anyone\". Her first role was in the movie, Jaws 3-D (1983), as a water ski bunny, although she couldn't swim or ski, which she still can't! There, she met Dennis Quaid, who became her fiancée and acting coach. Her next role was in All the Right Moves (1983), where she acted opposite Tom Cruise. Director Michael Chapman was so disappointed with her performance, that he almost fired her. Between 1983 and 1984, Lea appeared in other \"teen\" movies, such as Red Dawn (1984), The Wild Life (1984), and Going Undercover (aka Going Undercover (1985)), and believes it was lucky that, in these movies, they were able to use anyone who could walk and talk! Lea's biggest known accomplishment, and her big break, came from the first Back to the Future (1985). It was the biggest hit of 1985, and Lea was suddenly the most wanted actress. She could have her pick of any role she wanted to take on. She chose Howard the Duck (1986). Although it was a George Lucas production, the critics turned the movie, and Lea, down. Afterwards, director Howard Deutch offered Lea a part in his movie, Some Kind of Wonderful (1987), but she refused. After he urged her to do it, she reconsidered. She won the Young Artist Award for best young actress. During filming, Howard and Lea fell in love, and she called it off with Dennis. She then went on to film The Wizard of Loneliness (1988), which was her first movie as a woman, rather than a youngster. Lea went on to film Back to the Future Part II (1989) and an episode of Tales from the Crypt (1989). She then married Howard Deutch. She continued filming Back to the Future Part III (1990), Montana (1990), and Article 99 (1992). Lea then took a break to stay home with her first born, Madelyn Deutch. She jumped back into acting in Dennis the Menace (1993), where she says she just played herself. Then it was on to The Beverly Hillbillies (1993), Stolen Babies (1993), The Little Rascals (1994), and The Substitute Wife (1994). In 1994, she had her second child, Zoey Deutch. Lea then went into filming The Unspoken Truth (1995). It was then that she was first given the script of a new NBC sitcom, Caroline in the City (1995). It was probably the best decision Lea ever made. She won a People's Choice Award for best actress in a new sitcom. Unfortunately, with all of NBC's problems, Caroline in the City (1995) kept being moved to a worse and worse time slot, giving it horrible ratings. The show ended after only four seasons. Bad ideas from the creators (Julia, etc.) didn't help, either. Lea quickly went onto The Right to Remain Silent (1996), The Unknown Cyclist (1998), and A Will of Their Own (1998). She also guest-starred in the Friends (1994) episode, Friends: The One with the Baby on the Bus (1995), as \"Caroline Duffy\", and on The Larry Sanders Show (1992). Lea also did some stage work, including starring as \"Sally Bowles\" in \"Cabaret\". The show toured and also appeared on Broadway. She then did \"The Vagina Monologues\" in L.A. She had a stint in a dramatic role as a Chief Deputy Assistant District Attorney, \"Camille Paris\", on For the People (2002). Thompson has starred in more than 30 films, 25 television movies, 4 television series, more than 20 ballets, and starred on Broadway in \"Cabaret\". Lea can currently be seen on ABC Family's Peabody Award winning hit show \"Switched at Birth,\" where she acts and directs. Lea's movie credits include: \"All the Right Moves,\" \"Red Dawn,\" \"Some Kind of Wonderful,\" \"The Beverly Hillbillies,\" \"Howard The Duck\"(star and vocals), Clint Eastwood's \"J. Edgar;\" the 2014 Sundance favorite \"Ping Pong Summer;\" and soon to be released \"Left Behind\" starring Nicolas Cage. Lea lives in Los Angeles with her husband of twenty-five years, film/television director Howard Deutch, and their two talented daughters, Madelyn and Zoey, along with many dogs, fish, horses, chickens, a cat, tortoise, and parrot. She supports and often performs for breast cancer, mental health, and Alzheimer's charities. Lea is currently in pre-production on \"The Year of Spectacular Men\", a film written by her daughter Madelyn Deutch, and is writing her first book of essays. Lea Thompson will partner with international Mirrorball Trophy holder Artem Chigvintsev on the 19th season of \"Dancing With The Stars.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5ODcyODUwMl5BMl5BanBnXkFtZTgwMTA3MDg1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000670","name":"Lea Thompson","idIMDB":"nm0000670"},"actorId":"nm0000670","character":"Irene Steele","urlCharacter":"http://www.imdb.com/character/ch0398814","main":true},{"actorName":"Gary Grubbs","urlProfile":"http://www.imdb.com/name/nm0344196","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGNlY2EyMGMtMzE3NS00NGJkLTg5YzMtNmYwNjU2NWU1NTdlXkEyXkFqcGdeQXVyNzQ4ODA3ODk@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 November 1949","placeOfBirth":" Amory, Mississippi, USA","birthName":"Jon Gary Grubbs","height":"6' 4\" (1.93 m)","bio":"Gary and his wife Glenda, moved to Los Angeles in 1977 for Gary to pursue a writing career. He went on an open call as an actor, got the part, and now two hundred parts later Gary is still acting. Gary and Glenda now have a home in Mississippi and an apartment in Los Angeles and Gary works both the southern and L.A. markets. In the last few years Gary has devoted much of his time to writing and has successfully sold two pilot scripts to CBS, two screenplays and had his first full length equity play, \"As The Crow Flies,\" receive it's world premier. The production was both a creative and financial success and received many positive reviews. Currently he has a project in development at Warner Horizon. In 2008 Gary can be seen in \"In The Electric Mist\" with Tommie Lee Jones,\" \"Deal\" with Burt Reynolds, \"Good Intentions\" with Elaine Hendrix, \"Major Movie Star\" with Jessica Simpson, and \"My Mom's New Boyfriend\" with Meg Ryan and Antonio Banderas. Gary has worked as an actor for some of the most distinguished film directors of our time in a number of motion pictures, including \"JFK\" (Oliver Stone), \"Silkwood\" (Mike Nichols), \"Nadine\" (Robert Benton), \"Honkytonk Man\" (Clint Eastwood), and \"The Border\" (Tony Richardson). Other feature credits include \"X-Files The Movie,\" \"Doubletake,\" and \"Astronaut's Wife\". On television, Grubbs made a name for himself by portraying attorneys in two of the highest rated programs in television history, \"The Burning Bed\" and \"Fatal Vision\". He has also starred in numerous Movies-of-the-Week and Mini-series, including \"Canal Street Brothel,\" \"For One Night\" \"Foxfire,\" and many others. Gary's recent series and episodic work includes appearances on ER, Angel, NCIS, K-ville, Will & Grace and The O.C. Gary and Glenda have a daughter Molly who is employed at Team One Advertising in Los Angeles, and their son Logan is a grad student at The University of Southern Mississippi.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGNlY2EyMGMtMzE3NS00NGJkLTg5YzMtNmYwNjU2NWU1NTdlXkEyXkFqcGdeQXVyNzQ4ODA3ODk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0344196","name":"Gary Grubbs","idIMDB":"nm0344196"},"actorId":"nm0344196","character":"Dennis Beese","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Quinton Aaron","urlProfile":"http://www.imdb.com/name/nm2466842","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODI3Mjg0N15BMl5BanBnXkFtZTcwMjAyNjcwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 August 1984","placeOfBirth":" Bronx, New York City, New York, USA","height":"6' 8\" (2.03 m)","bio":"Quinton Aaron is best known for his portrayal of Michael Oher, aka Big Mike, alongside Oscar winner Sandra Bullock, in the Academy Award winning hit movie, The Blind Side (2009), which has grossed over $300 million in U.S. box office alone. Aaron has guest-starred on many television shows including Law & Order: Special Victims Unit (1999) playing the son of Jill Scott, NBC's Mercy (2009), and CBS' Harry's Law (2011). He also had recurring roles on _One Tree Hill_ and _Drop Dead Diva_. In 2016, Lions Gate released the film 1982 (2013), where Quinton starred opposite Hill Harper and Wayne Brady. Aaron has three films coming out in 2016. Halfway (2016) premiering at Dallas International Film Festival was filmed in Wisconsin, September-November 2014; My First Miracle (2016), was shot in New York February-April 2015; and It's Not My Fault and I Don't Care Anyway (2017) was shot in Canada June-July 2015. Quinton will also be appearing on the big screen May 6th 2016 in the feature film Mothers and Daughters (2016) starring Selma Blair, Susan Sarandon, Sharon Stone and Courteney Cox. He has also worked on 3 period piece films so far in 2016 2 westerns and a bio film called Heart Baby starring Gbenga Akinnagbe and Jackson Rathbone. Quinton is dedicated to advocating for the fight against bullying. He began The Quentin Aaron Foundation, whose mission is to provide hope, encouragement, confidence and resources to children on the brink of suicide or battling the damaging effects on self-esteem and confidence caused by the actions or words of others.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODI3Mjg0N15BMl5BanBnXkFtZTcwMjAyNjcwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2466842","name":"Quinton Aaron","nicknames":["Q"],"idIMDB":"nm2466842"},"actorId":"nm2466842","character":"Simon","urlCharacter":"http://www.imdb.com/character/ch0483133","main":true},{"actorName":"Martin Klebba","urlProfile":"http://www.imdb.com/name/nm0458514","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNzE5MzE2Nl5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 June 1969","placeOfBirth":" Troy, Michigan, USA","height":"4' (1.22 m)","bio":"Martin Klebba was born on June 23, 1969 in Troy, Michigan, USA. He is known for his work on Pirates of the Caribbean: Dead Men Tell No Tales (2017), Scrubs (2001) and Project X (2012). He has been married to Michelle Dilgard since June 18, 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNzE5MzE2Nl5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0458514","name":"Martin Klebba","nicknames":["Marty","Detroit"],"idIMDB":"nm0458514"},"actorId":"nm0458514","character":"Melvin Weir","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Georgina Armstrong","urlProfile":"http://www.imdb.com/name/nm0035709","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMDMyMzAxMV5BMl5BanBnXkFtZTgwNjI4MDgyMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Georgina was born and raised in Britain. Finding a love for horses at a young age - she rode competitively throughout the UK and even gained the chance to represent Great Britain, show jumping, and winning team gold. Being born into a family heavily involved in the film industry, and being a 3rd generation stunt woman, it was a natural progression for Georgina to find a love for acting and action! She started with acting roles in films such as, \"The Young Indiana Jones\" and \"Black Beauty\", and progressing, to enjoy a career as a stunt woman, actress and action actress.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMDMyMzAxMV5BMl5BanBnXkFtZTgwNjI4MDgyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0035709","name":"Georgina Armstrong","nicknames":["Georgie"],"idIMDB":"nm0035709"},"actorId":"nm0035709","character":"Venice Baxter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Han Soto","urlProfile":"http://www.imdb.com/name/nm2404349","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MzY2MjI3OF5BMl5BanBnXkFtZTgwMzg2MDE5NDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Prior to working in the entertainment industry, Han was a successful businessman in the building trades industry, created and operates a website and branding business, has worked as an independent consultant in corporate Information Technology, and has decades of retail experience. As a new father to a beautiful daughter, Han is a family man who essentially raised his younger siblings and guided their education and professional careers while supporting his parents, assuming the role of head of the home, as his own father was stricken with a terminal disease. In addition to his endless family support, Han has contributed much to international relief organizations, including traveling to remote parts of India to document the plight of blind children at a school where the boys live after being rejected from their families. He is also a leader among North American students who come from Southeast Asia, and helps provide fund-raising, scholarships, direction, and support for these 1st and 2nd generation young Asian Americans. Han is a natural leader who has the ability to inspire and encourage people to do their very best, and his entire focus in life is to help and support people to achieve excellence in their personal lives, as well as in their families and communities, both locally and abroad. He recently completed producing a documentary about a Civil Rights worker, a man who was a friend and colleague of Dr. Martin Luther King, Jr. and had a significant and long-lasting impact on race relations in America. Future projects include producing inspirational and educational film and television projects, and helping provide to others opportunities similar to those that helped him early in his career, and continuing work with non-profits by guidance, viral marketing support, being a high visibility spokesperson and networker, and personally funding permanent projects in some of the neediest areas of the planet.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MzY2MjI3OF5BMl5BanBnXkFtZTgwMzg2MDE5NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2404349","name":"Han Soto","nicknames":["Bullet"],"idIMDB":"nm2404349"},"actorId":"nm2404349","character":"Edwin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alec Rayme","urlProfile":"http://www.imdb.com/name/nm2302367","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmM3MjYzMjEtNzM3OC00YzJiLTllYjMtNWM3YjYzYzhlNjEwXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 0½\" (1.84 m)","bio":"Born Ali Alherimi in Akron, Ohio, on December 20th, 1978, Alec Rayme was raised mostly in Florida. He was very athletic spending most of his younger days playing sports. After high school he went on to play college football at USM and then Pro Arena football in Florida. After a short lived football career he hit the road in search of something new. He got approached by an agent while working for his fathers store, with nothing to lose he gave it a shot. The first audition he was sent on he booked as Batman in the Batman Stunt Spectacular at Six Flags New Orleans. He had always been into anything that had to do with art, but this very much got his foot into the entertainment industry. From there he fell into stunts and would usually book stunt acting roles. After almost 10 years of stunts he decided that it was enough for him and started to focus mainly on acting. After booking a couple big roles he knew he had made the right decision. He now acts full time as well as owns a food truck called \"The Holy Grill\" He has never been married and has no children. He hopes to continue to act and also will be making his directing debut in 2014. Recent films \"Left Behind\" and \"Lets Be Cops\" both will be released in 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmM3MjYzMjEtNzM3OC00YzJiLTllYjMtNWM3YjYzYzhlNjEwXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2302367","name":"Alec Rayme","idIMDB":"nm2302367"},"actorId":"nm2302367","character":"Hassid","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kamryn Johnson","urlProfile":"http://www.imdb.com/name/nm4559582","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1OTUwMDcyN15BMl5BanBnXkFtZTgwNzQ4ODY3NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Kamryn Johnson is an actress, known for Left Behind (2014), Bessie (2015) and Lovesick (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1OTUwMDcyN15BMl5BanBnXkFtZTgwNzQ4ODY3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4559582","name":"Kamryn Johnson","idIMDB":"nm4559582"},"actorId":"nm4559582","character":"Katie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lauren Swinney","urlProfile":"http://www.imdb.com/name/nm1751504","urlPhoto":"","biography":{"dateOfBirth":"25 February 1922","placeOfBirth":"","bio":"Lauren Swinney was born on February 25, 1922. She is an actress, known for Bad Lieutenant: Port of Call New Orleans (2009), Waiting... (2005) and Left Behind (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1751504","name":"Lauren Swinney","idIMDB":"nm1751504"},"actorId":"nm1751504","character":"Old Lady","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Major Dodson","urlProfile":"http://www.imdb.com/name/nm4161282","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNTA2NDczMF5BMl5BanBnXkFtZTgwOTM3MDY4OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Major Dodson is an actor, known for The Walking Dead (2010), American Horror Story (2011) and Left Behind (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNTA2NDczMF5BMl5BanBnXkFtZTgwOTM3MDY4OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4161282","name":"Major Dodson","idIMDB":"nm4161282"},"actorId":"nm4161282","character":"Raymie Steele","urlCharacter":"http://www.imdb.com/character/ch0395488","main":true}],"seasons":[],"idIMDB":"tt2467046","urlIMDB":"http://www.imdb.com/title/tt2467046","business":{"budget":{"money":"$16,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$6,300,147","country":"USA","day":"05","month":"10","year":"2014","remarks":"1,825 Screens"},{"money":"$63,585","country":"Lebanon","day":"09","month":"10","year":"2014","remarks":"15 Screens"},{"money":"$303,833","country":"Malaysia","day":"09","month":"10","year":"2014","remarks":"88 Screens"},{"money":"$259,303","country":"Philippines","day":"08","month":"10","year":"2014","remarks":"65 Screens"},{"money":"$620,636","country":"Russia","day":"02","month":"10","year":"2014","remarks":"470 Screens"},{"money":"$70,082","country":"Singapore","day":"02","month":"10","year":"2014","remarks":"13 Screens"}],"gross":[{"money":"$6,300,147","country":"USA","day":"05","month":"10","year":"2014","remarks":""},{"money":"$63,585","country":"Lebanon","day":"12","month":"10","year":"2014","remarks":""},{"money":"$303,833","country":"Malaysia","day":"12","month":"10","year":"2014","remarks":""},{"money":"$259,303","country":"Philippines","day":"12","month":"10","year":"2014","remarks":""},{"money":"$620,636","country":"Russia","day":"05","month":"10","year":"2014","remarks":""},{"money":"$221,731","country":"Singapore","day":"12","month":"10","year":"2014","remarks":""}],"weekendGross":[{"money":"$6,300,147","country":"USA","day":"05","month":"10","year":"2014","remarks":"1,825 Screens"}],"admissions":null,"productionDates":{"money":null,"country":null,"day":"29","month":"04","year":"2013","remarks":null},"filmingDates":[{"money":null,"country":null,"day":"09","month":"08","year":"2013","remarks":null},null],"copyrightHolder":"Left Behind Investments, LLC"},"technical":{"runtime":["1 hr 50 min (110 min)"],"soundMix":["SDDS","Datasat","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa Plus"],"laboratory":null,"filmLength":null,"negativeFormat":["Codex"],"cinematographicProcess":["ARRIRAW (2.8K) (source format)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["35 mm (anamorphic)","D-Cinema"]},"rating":"3.1","metascore":"12","filmingLocations":[{"location":"Baton Rouge, Louisiana, USA"}],"rated":"PG-13","awards":[{"award":"Houston Film Critics Society Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated HFCS Award","categories":[{"category":"Worst Picture","names":[]}]}]},{"award":"Razzie Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Picture","names":[]},{"category":"Worst Actor","names":[{"name":"Nicolas Cage","id":"nm0000115","role":null}]},{"category":"Worst Screenplay","names":[{"name":"Paul Lalonde","id":"nm0482510","role":null},{"name":"John Patus","id":"nm1146036","role":null}]}]}]}],"votes":"26,803","type":"Movie","companyCreditsSimple":[{"idCompany":"co0398908","name":"Stoney Lake Entertainment"}],"keywords":{"keywords":["chaos","bible quote","shrine","faith","riot","apocalypse","prophecy","bible","unfaithfulness","infidelity","adultery","suburb","airplane explosion","conspiracy theorist","abandoned house","wallet","southern accent","drug addict","englishwoman","alzheimer's disease","midget","church","preacher","baseball bat","purse snatcher","hospital","ambulance","stealing a car","motorcycle","no cell phone signal","car accident","car crashing through a window","slow motion scene","jewelry store","suicide attempt","held at gunpoint","shotgun","pistol","one day","product placement","birthday","airplane accident","explosion","new york city","news report","wedding ring","extramarital affair","family relationships","college student","paranoia","fear","end of the world","dystopia","camera","cell phone","investigative journalist","father son relationship","mother son relationship","husband wife relationship","christianity","cockpit","emergency landing","disaster","rapture aftermath","bible prophecy","panic","disappearance","airplane passenger","mother daughter relationship","christian","flight attendant","journalist","father daughter relationship","stewardess","pilot","religion","airplane","airport","suspense","rapture","remake","based on novel","melodrama","film ends with text","long island new york","police officer","tanker truck","pickup truck","running","aviation","mid air collision","obese man","concert ticket","breakdancing","school bus","car crash","looting","passenger","shower","lipstick","answering machine","bookstore","necklace","dog","bridge","wristwatch","department store","jewelry theft","construction site","gasoline","cigarette lighter","fire","brother sister relationship"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 20:13:30"}}