{"data":{"movies":[{"title":"Get Hard","originalTitle":"","year":"2015","releaseDate":"20150327","directors":[{"name":"Etan Cohen","id":"nm1000113"}],"writers":[{"name":"Jay Martel","id":"nm1007602"},{"name":"Ian Roberts","id":"nm0731168"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3OTc1NjM0M15BMl5BanBnXkFtZTgwNjAyMzE1MzE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Crime"],"plot":"Kevin Hart plays the role of Darnell--a family man desperate to get enough money to buy a house in a better area to benefit his family's well-being. He is hired by James (Will Ferrell), a wimpy stock trader who is about to go to prison for 10 years, to prepare him for life behind bars. The catch is that James thinks Darnell is an ex-con--not because Darnell told him that, but because James just assumed.","simplePlot":"When millionaire James King is jailed for fraud and bound for San Quentin, he turns to Darnell Lewis to prep him to go behind bars.","actors":[{"actorName":"Will Ferrell","urlProfile":"http://www.imdb.com/name/nm0002071","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMDIzMDEzNF5BMl5BanBnXkFtZTcwODcxMjE2Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1967","placeOfBirth":" Irvine, California, USA","birthName":"John William Ferrell","height":"6' 3\" (1.91 m)","bio":"John William Ferrell was born in Irvine, California, to Betty Kay (Overman), a teacher, and Roy Lee Ferrell, Jr., a musician. His parents were both originally from Roanoke Rapids, North Carolina. A graduate of the University of Southern California, Ferrell became interested in performing while a student at University High School in Irvine, where he made his school's daily morning announcements over the public address system in disguised voices. He started as a member of the Los Angeles comedy/improvisation group The Groundlings, where fellow cast members Ana Gasteyer, Maya Rudolph and former Saturday Night Live (1975) repertory players such as Laraine Newman, Jon Lovitz and Phil Hartman began their careers. It was there he met Chris Kattan and the two became good friends and both went on to Saturday Night Live (1975) later. He has also appeared on several television programs, including Strangers with Candy (1999), Grace Under Fire (1993) and Living Single (1993) during his time at The Groundlings. Will also lent his voice to the armless and legless dad of cartoon family \"The Oblongs\". In 1995 he became a feature cast member at Saturday Night Live (1975) during the show's rapid re-casting. He was declared quite possibly the worst cast member ever during his first season. However, his talents of impersonations and range of characters shot him forward to making him arguably the greatest Saturday Night Live (1975) cast member ever. During his seven year run he is one of the few cast members to ever be nominated for an Emmy for a performance and played George W. Bush during the 2000 elections. He's appeared in every Saturday Night Live (1975) movie since his premiere on the show in 1995. In 2002 he left Saturday Night Live (1975) and was the only cast member to ever receive a farewell from all the current cast members at the end of the season finale show. Since leaving the show Will has pursued a career in films. In 2000 he married and now lives in L.A.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMDIzMDEzNF5BMl5BanBnXkFtZTcwODcxMjE2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002071","name":"Will Ferrell","nicknames":["Wilf"],"idIMDB":"nm0002071"},"actorId":"nm0002071","character":"James","urlCharacter":"http://www.imdb.com/character/ch0512445","main":true},{"actorName":"Kevin Hart","urlProfile":"http://www.imdb.com/name/nm0366389","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTAxMjkxN15BMl5BanBnXkFtZTgwODg5MzYyMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1979","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"5' 4\" (1.63 m)","bio":"Kevin Hart was born on July 6, 1979 in Philadelphia, Pennsylvania, USA. He is an actor and producer, known for Kevin Hart: Let Me Explain (2013), Ride Along (2014) and The Wedding Ringer (2015). He has been married to Eniko Parrish since August 13, 2016. He was previously married to Torrei Hart.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTAxMjkxN15BMl5BanBnXkFtZTgwODg5MzYyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0366389","name":"Kevin Hart","idIMDB":"nm0366389"},"actorId":"nm0366389","character":"Darnell","urlCharacter":"http://www.imdb.com/character/ch0496206","main":true},{"actorName":"Craig T. Nelson","urlProfile":"http://www.imdb.com/name/nm0005266","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0ODQwMDU1OV5BMl5BanBnXkFtZTcwMDkxNTE2Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1944","placeOfBirth":" Spokane, Washington, USA","birthName":"Craig Theodore Nelson","height":"6' 3½\" (1.92 m)","bio":"Craig T. Nelson was born on April 4, 1944 in Spokane, Washington, USA as Craig Theodore Nelson. He is an actor and producer, known for The Incredibles (2004), Coach (1989) and Poltergeist (1982). He has been married to Doria Cook-Nelson since 1987. He was previously married to Robin McCarthy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0ODQwMDU1OV5BMl5BanBnXkFtZTcwMDkxNTE2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005266","name":"Craig T. Nelson","nicknames":["Fish","Coach"],"idIMDB":"nm0005266"},"actorId":"nm0005266","character":"Martin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alison Brie","urlProfile":"http://www.imdb.com/name/nm1555340","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MDc2NjY1NF5BMl5BanBnXkFtZTcwMDY2MjE3Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1982","placeOfBirth":" Los Angeles County, California, USA","birthName":"Alison Brie Schermerhorn","height":"5' 3\" (1.6 m)","bio":"Alison Brie was born in Hollywood, California, to Joanne (Brenner), who worked at a non-profit child care agency, and Charles Terry Schermerhorn, a musician and entertainment reporter. Her mother is Jewish and her father has Scottish, Dutch, English, German, and Norwegian ancestry. Brie grew up in the Los Angeles suburb of South Pasadena. Interested in acting at an early age, she began her career performing in community theater shows at the Jewish Community Center in Los Feliz. Her very first role was \"Toto\" in the Wizard of Oz. After graduating from South Pasadena High School in 2001; Alison attended California Institute of the Arts where she received her BFA in Acting. While there, she was one of the original cast members in the world premiere of The Peach Blossom Fan, performed as the inaugural theater production at Disney's REDCAT Theater in Downtown LA. During that time, Alison also studied at the Royal Scottish Academy of Music and Drama in Glasgow, Scotland. Since graduating, she has continued to work in all forms of media, including film, television, and theater. She has performed in the Blank Theater Company's Young Playwright's festival and in shows at the Odyssey, Write-Act, and Rubicon Theaters, receiving an Indy Award for her haunting performance as \"Ophelia\" in the Rubicon's production of Hamlet. She had performed guest spots for Comedy Central and Disney's Hannah Montana (2006) as well as leading roles in some independent films before landing her role on Mad Men (2007). Since then, she has continued to work in film and TV. Alison lives in South Pasadena.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MDc2NjY1NF5BMl5BanBnXkFtZTcwMDY2MjE3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1555340","name":"Alison Brie","idIMDB":"nm1555340"},"actorId":"nm1555340","character":"Alissa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edwina Findley Dickerson","urlProfile":"http://www.imdb.com/name/nm1731401","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NDEwODc0NV5BMl5BanBnXkFtZTgwNjcwMjgwNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Edwina Findley Dickerson is an award-winning film, television, and theatre actress, hailed by critics as \"A marvel to watch.\" She made her prime-time debut as \"Tosha Mitchell\" on HBO's critically acclaimed series THE WIRE, followed by four seasons as \"Davina Lambreaux\" on HBO's Emmy-Nominated drama series Treme, set in Post-Katrina New Orleans. On the big screen, Edwina garnered attention for her role as \"Rosie\" in director Ava Duvernay's (Selma) Sundance award-winning feature Middle of Nowhere, and delivered a \"skin prickling performance\" as \"Melva Neddy\" in Jake Mahaffy's Free In Deed, based on a true story. Free In Deed won two Best Film Awards and official selections at AFI, Venice, Stockholm, and Turkey's Malatya Uluslararasi Film Festivals. In 2015, Edwina gave a hilarious turn as Kevin Hart's wife, \"Rita\", in Warner Bros' hit comedy Get Hard with Will Ferrell, and as \"Dee\" in HBO's Emmy-winning comedy Veep starring Julia Louis-Dreyfus. She later joined FOX's daytime talk show, The Real, as both a guest and Guest Host. Edwina can be seen weekly on the Oprah Winfrey Network, starring as \"Kelly\" in Tyler Perry's hit drama series If Loving You Is Wrong, which premiered as the highest-rated series debut in OWN's network history. Theatrically, Edwina performed in Eclipsed, written by actress Danai Gurira (The Walking Dead) set during the Liberian war, and the historical drama Gee's Bend, for which Edwina was nominated for a Barrymore Award for Outstanding Lead Actress. Other theatre credits include Winter's Tale, Twelfth Night, Henry IV, Antigone, Cyrano De Bergerac, Into the Woods, Crowns, and Crumbs From the Table of Joy from Pulitzer prize-winner Lynn Nottage. Edwina studied theatre and classical music at the Duke Ellington School of the Arts in her hometown, Washington, DC, and is an alumna of NYU's Tisch School of the Arts, where she was honored with the prestigious Outstanding Artist and Scholar Award, Founder's Day Award, the Dean's List, and induction into the Tisch University Scholars Program. Edwina and her husband, Business Executive Kelvin Dickerson, are the Co-Founders of the national nonprofit organization AbundantLifeU, and Edwina regularly travels the country speaking, teaching, and inspiring millennials, women, and leaders to uncover their purpose and live their dreams.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NDEwODc0NV5BMl5BanBnXkFtZTgwNjcwMjgwNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1731401","name":"Edwina Findley Dickerson","idIMDB":"nm1731401"},"actorId":"nm1731401","character":"Rita","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ariana Neal","urlProfile":"http://www.imdb.com/name/nm4578163","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NzU3NjU5NV5BMl5BanBnXkFtZTgwNjU2NDM2MDI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"4' 10\" (1.47 m)","bio":"Ariana Neal has been acting and performing since she was 3 years old. She has been in several commercials and a few films. Ariana is signed with Babes N' Beaus, an agency based out of Atlanta, Ga. When she is not in front of the cameras she enjoys going to school and spending time with family and friends.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NzU3NjU5NV5BMl5BanBnXkFtZTgwNjU2NDM2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4578163","name":"Ariana Neal","idIMDB":"nm4578163"},"actorId":"nm4578163","character":"Makayla","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Erick Chavarria","urlProfile":"http://www.imdb.com/name/nm2974788","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQwNDA1ZjItZjQ2NS00YzhjLWFkNjAtYjVjOWZhMmIyNmViXkEyXkFqcGdeQXVyMTgzNTIzNzg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1979","placeOfBirth":" Guatemala City, Guatemala","birthName":"Erick J. Chavarria Rodriguez","height":"5' 6½\" (1.69 m)","bio":"Erick was born and raised in Guatemala. As early as 5 years old Erick knew he wanted to be an actor. While growing up in a small village with his grandparents he would reenact scenes from the Soap Operas he had watched with his grandmother the previous night. As a teenager he moved to the United States and got the opportunity to go to college to study business administration. Once in college he enrolled in an intro to acting class and that's where his childhood dream of being an actor was reawakened. After that intro to acting class and with much excitement and fear Erick changed his major to acting. A few years later Erick received his Bachelor's in Fine Arts degree in theater performance from the University of Maryland Baltimore County. Before pursuing acting for the camera Erick had the opportunity to perform for the stage. Some of his favorite roles include Valentin in The Kiss of the Spider Woman, and Marmeladov in an original production of Crime & Punishment. Some notable television credits include Eastbound & Down, The Bridge, Back in The Game and Southland. That combination of excitement and fear Erick felt when switching majors in college would become a recurring theme in his life as an actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQwNDA1ZjItZjQ2NS00YzhjLWFkNjAtYjVjOWZhMmIyNmViXkEyXkFqcGdeQXVyMTgzNTIzNzg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2974788","name":"Erick Chavarria","idIMDB":"nm2974788"},"actorId":"nm2974788","character":"Cecelio","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"T.I.","urlProfile":"http://www.imdb.com/name/nm1939267","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMDMwNjkxN15BMl5BanBnXkFtZTcwMDI0MTM5OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1980","placeOfBirth":" Atlanta, Georgia, USA","birthName":"Clifford Joseph Harris Jr.","height":"5' 8\" (1.73 m)","bio":"T.I. was born Clifford Joseph Harris, Jr. on September 25, 1980, in Atlanta, Georgia, to Violeta Morgan and Clifford \"Buddy\" Harris, Sr. He is also known as T.I.P. and \"Rubberband Man\". T.I. is from the streets of Westside Bankhead Zone 1 in Atlanta. His original stage name, T.I.P., it stems from his childhood nickname \"Tip\", given by his grandfather. He later changed it to T.I. out of respect for label mate Q-Tip. He was dubbed \"the Jay-Z of the South\" by Pharrell Williams, T.I. gradually established himself as one of rap's greatest and most successful MCs during the early 2000s. T.I. has been active with helping the community especially with Hurricane Katrina relief efforts, T.I. worked with troubled youths at Paulding Detention Center in Atlanta, provided scholarships for single parent families at Boys and Girls Clubs. He has had successful movies roles such as: ATL (2006) and most notably American Gangster(2007) along side Denzel Washington.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMDMwNjkxN15BMl5BanBnXkFtZTcwMDI0MTM5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1939267","name":"T.I.","nicknames":["King Of The South","Rubberband Man","T.I.P"],"idIMDB":"nm1939267"},"actorId":"nm1939267","character":"Russell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Ben-Victor","urlProfile":"http://www.imdb.com/name/nm0070115","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5OTI3MTk2OF5BMl5BanBnXkFtZTgwMzc3MTIxMjE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 July 1965","placeOfBirth":" Brooklyn, New York, USA","height":"5' 7½\" (1.71 m)","bio":"Actor Paul Ben-Victor has built a career on the small and big screen, with roles in over 50 films like Daredevil (2003), A Civil Action (1998), True Romance (1993), Tombstone (1993), Houseguest (1995), La tête dans le carton à chapeaux (1999) and The Corruptor (1999). On television, Paul stars as \"Chief Inspector Stan McQueen\" on USA's hit series, In Plain Sight (2008). Paul starred as \"Special Agent Bobby Hobbes\" in the international hit series The Invisible Man (2000), a role that earned him a Best Supporting Actor Audience Award for Sci-Fi. He received critical acclaim for his portrayal of \"Moe Howard\" in the ABC biopic The Three Stooges (2000), shined as the endearing hustler \"Steve Richards\" on NYPD Blue (1993), and made a lasting impression with his quiet ruthlessness as the Greek henchman, \"Spiros Vondas\", on the widely acclaimed HBO series, The Wire (2002). Paul has been a favorite on HBO with other standout roles including Warner Bros Studio Chief \"Alan Grey\" on the hit series Entourage (2004), the zany \"Palaka\" on John from Cincinnati (2007) and scalping tickets on Curb Your Enthusiasm (2000). He recently produced, wrote and starred in the soon to be released feature comedy, Should've Been Romeo (2012) alongside Edward Asner, Carol Kane and Michael Rapaport and, directed by his lifelong friend, Mark Bennett. After attending Carnegie Mellon University, he made his theater debut at the Nuyorican Poets Cafe on New York's lower east side with Miguel Pinero and Reinaldo Povod. He then became a member of the renowned Actor's Studio and appeared in several productions there including Lyle Kessler's \"Robbers\", which was then produced at the Seattle Repertory Theater directed by Daniel Sullivan, The Longwharf Theater starring Judd Hirsch and, the American Place Theater in NYC, directed by Marshall W. Mason.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5OTI3MTk2OF5BMl5BanBnXkFtZTgwMzc3MTIxMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0070115","name":"Paul Ben-Victor","idIMDB":"nm0070115"},"actorId":"nm0070115","character":"Gayle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Mayer","urlProfile":"http://www.imdb.com/name/nm1243604","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzk1MDczMF5BMl5BanBnXkFtZTYwMjg0Njc4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 October 1977","placeOfBirth":" Bridgeport, Connecticut, USA","birthName":"John Clayton Mayer","height":"6' 3\" (1.91 m)","bio":"John Mayer was born on October 16, 1977 in Bridgeport, Connecticut, USA as John Clayton Mayer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzk1MDczMF5BMl5BanBnXkFtZTYwMjg0Njc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1243604","name":"John Mayer","idIMDB":"nm1243604"},"actorId":"nm1243604","character":"John Mayer","urlCharacter":"http://www.imdb.com/character/ch0197442","main":true},{"actorName":"Jon Eyez","urlProfile":"http://www.imdb.com/name/nm1208510","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NjM1NjQ4Nl5BMl5BanBnXkFtZTgwMTkwMzMwNTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jon Eyez is an actor and composer, known for Looper (2012), Dawn of the Planet of the Apes (2014) and Django Unchained (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NjM1NjQ4Nl5BMl5BanBnXkFtZTgwMTkwMzMwNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1208510","name":"Jon Eyez","idIMDB":"nm1208510"},"actorId":"nm1208510","character":"Big Mike","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nito Larioza","urlProfile":"http://www.imdb.com/name/nm1045914","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NjkzOTQwNF5BMl5BanBnXkFtZTcwNTIxMTA1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1971","placeOfBirth":" Wahiawa, Hawaii, USA","height":"5' 7\" (1.7 m)","bio":"Nito Larioza was born on February 21, 1971 in Wahiawa, Hawaii, USA. He is known for his work on Inception (2010), The Dark Knight Rises (2012) and Avatar (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NjkzOTQwNF5BMl5BanBnXkFtZTcwNTIxMTA1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1045914","name":"Nito Larioza","idIMDB":"nm1045914"},"actorId":"nm1045914","character":"Jaoa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dan Bakkedahl","urlProfile":"http://www.imdb.com/name/nm2045884","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzOTE0MTU5MV5BMl5BanBnXkFtZTgwNzY0NzU4MTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1969","placeOfBirth":" Rochester, Minnesota, USA","bio":"Dan Bakkedahl was born on November 18, 1969 in Rochester, Minnesota, USA. He is an actor, known for The Heat (2013), Hitman: Agent 47 (2015) and Observe and Report (2009). He is married to Irene.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzOTE0MTU5MV5BMl5BanBnXkFtZTgwNzY0NzU4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2045884","name":"Dan Bakkedahl","idIMDB":"nm2045884"},"actorId":"nm2045884","character":"Leo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Greg Germann","urlProfile":"http://www.imdb.com/name/nm0314524","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjA3MDMxOF5BMl5BanBnXkFtZTYwNjAxMTUz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 February 1958","placeOfBirth":" Houston, Texas, USA","birthName":"Gregory Andrew Germann","height":"5' 10\" (1.78 m)","bio":"A native of Houston raised on Lookout Mountain outside of Golden, Colorado, Greg Germann was exposed to the performing arts at an early age, particularly through his father, an award-winning children's playwright and theater professor. As a Theater major at the University of Northern Colorado, a constant stream of plays led him to the gradual realization that acting would be his professional future. Buckling down at UNC, he graduated in two years and moved to New York. He became a member of Circle Repertory Company and Ensemble Studio Theatre, accumulating credits in such off-Broadway and Broadway plays as Steven Sondheim musical \"Assassins\", \"The Person I Once Was\" opposite Holly Hunter, and David Mamet's \"War Games\", among others. He has distinguished himself on the big screen portraying roles in various films. In addition to acting he also devotes himself to writing. His short film, Pete's Garden (1998), for which he also served as director and star, premiered in competition at the 1998 Sundance Film Festival and went on to air on The Sundance Channel in January 1999. He also wrote \"The Observatory\" a play performed at New York's Ensemble Studio Theatre.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjA3MDMxOF5BMl5BanBnXkFtZTYwNjAxMTUz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0314524","name":"Greg Germann","idIMDB":"nm0314524"},"actorId":"nm0314524","character":"Peter Penny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ron Funches","urlProfile":"http://www.imdb.com/name/nm3236733","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTAzYWYzZDgtYjZiYS00ZjhiLTk5OTctYzI4NGUxOTAzYjRiXkEyXkFqcGdeQXVyNTI5NjIyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Ron Funches is an actor and writer, known for Trolls (2016), Get Hard (2015) and Undateable (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTAzYWYzZDgtYjZiYS00ZjhiLTk5OTctYzI4NGUxOTAzYjRiXkEyXkFqcGdeQXVyNTI5NjIyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3236733","name":"Ron Funches","idIMDB":"nm3236733"},"actorId":"nm3236733","character":"Jojo","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2561572","urlIMDB":"http://www.imdb.com/title/tt2561572","business":{"budget":{"money":"$40,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$33,803,253","country":"USA","day":"29","month":"03","year":"2015","remarks":"3,175 Screens"}],"gross":[{"money":"$90,353,764","country":"USA","day":"28","month":"06","year":"2015","remarks":""},{"money":"$90,285,402","country":"USA","day":"21","month":"06","year":"2015","remarks":""},{"money":"$89,977,548","country":"USA","day":"07","month":"06","year":"2015","remarks":""},{"money":"$89,701,171","country":"USA","day":"31","month":"05","year":"2015","remarks":""},{"money":"$87,831,115","country":"USA","day":"10","month":"05","year":"2015","remarks":""},{"money":"$86,207,021","country":"USA","day":"03","month":"05","year":"2015","remarks":""},{"money":"$83,922,270","country":"USA","day":"26","month":"04","year":"2015","remarks":""},{"money":"$78,279,000","country":"USA","day":"19","month":"04","year":"2015","remarks":""},{"money":"$70,783,826","country":"USA","day":"12","month":"04","year":"2015","remarks":""},{"money":"$57,215,636","country":"USA","day":"05","month":"04","year":"2015","remarks":""},{"money":"$33,803,253","country":"USA","day":"29","month":"03","year":"2015","remarks":""}],"weekendGross":[{"money":"$35,440","country":"USA","day":"28","month":"06","year":"2015","remarks":"77 Screens"},{"money":"$72,521","country":"USA","day":"21","month":"06","year":"2015","remarks":"115 Screens"},{"money":"$155,651","country":"USA","day":"07","month":"06","year":"2015","remarks":"244 Screens"},{"money":"$269,283","country":"USA","day":"31","month":"05","year":"2015","remarks":"303 Screens"},{"money":"$1,057,382","country":"USA","day":"10","month":"05","year":"2015","remarks":"955 Screens"},{"money":"$1,189,012","country":"USA","day":"03","month":"05","year":"2015","remarks":"1,465 Screens"},{"money":"$3,761,030","country":"USA","day":"26","month":"04","year":"2015","remarks":"2,276 Screens"},{"money":"$4,830,000","country":"USA","day":"19","month":"04","year":"2015","remarks":"2,655 Screens"},{"money":"$8,218,246","country":"USA","day":"12","month":"04","year":"2015","remarks":"3,132 Screens"},{"money":"$13,128,219","country":"USA","day":"05","month":"04","year":"2015","remarks":"3,212 Screens"},{"money":"$33,803,253","country":"USA","day":"29","month":"03","year":"2015","remarks":"3,175 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"17","month":"03","year":"2014","remarks":null},null],"copyrightHolder":"(2014) Warner Bros. Entertainment Inc. and RatPac-Dune Entertainment LLC"},"technical":{"runtime":["1 hr 40 min (100 min)","1 hr 47 min (107 min) (unrated)"],"soundMix":["Datasat","Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arri Alexa XT Plus, Leica Summilux-C and Angenieux Optimo Lenses"],"laboratory":null,"filmLength":["(6 reels)"],"negativeFormat":null,"cinematographicProcess":["ARRIRAW (2.8K) (source format)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["35 mm (spherical)","D-Cinema"]},"rating":"6.0","metascore":"34","filmingLocations":[{"location":"New Orleans, Louisiana, USA"}],"rated":"R","awards":[{"award":"MTV Movie Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best Comedic Performance","names":[{"name":"Will Ferrell","id":"nm0002071","role":null}]}]}]}],"votes":"93,776","type":"Movie","companyCreditsSimple":[{"idCompany":"co0186190","name":"Gary Sanchez Productions"},{"idCompany":"co0026840","name":"Warner Bros."}],"keywords":{"keywords":["singing in a car","millionaire","camera focus on female butt","gay bar","two word title","kicked in the face","wealth","mansion","father daughter relationship","male frontal nudity","male rear nudity","car wash","split screen","title spoken by character","prison","lingerie","reference to franz beckenbauer","arrest","capoeira","yacht","blunt","pistol","flamethrower","neo nazi","racial slur","racist","cousin cousin relationship","gang","stabbed in the forehead","shiv","homosexual","beating","park","pepper spray","hiding in a car trunk","ankle monitor","countdown","face slap","slow motion scene","kicked in the chest","punched in the face","fistfight","montage","training","false accusation","news report","lawyer","party","fbi agent","cameo","fiancee","los angeles california","crenshaw los angeles","husband wife relationship","nurse","parking garage","racial stereotype","ex convict","bare chested male","written by director","character repeating someone else's dialogue","scene during opening credits","ignorance","nonlinear timeline"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 07:38:44"}}