{"data":{"movies":[{"title":"Army of the Damned","originalTitle":"","year":"2013","releaseDate":"20131203","directors":[{"name":"Tom DeNucci","id":"nm3848723"}],"writers":[{"name":"Tom DeNucci","id":"nm3848723"}],"runtime":"85 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0NDExMTM4N15BMl5BanBnXkFtZTgwMjQ1MzA1MDE@._V1.jpg","countries":["USA"],"languages":[],"genres":["Horror"],"plot":"The filming of a hit reality TV show goes horribly wrong when a group of small town cops respond to a call that brings a whole new meaning to the phrase, domestic disturbance.","simplePlot":"The filming of a hit reality TV show goes horribly wrong when a group of small town cops respond to a call that brings a whole new meaning to the phrase, domestic disturbance.","actors":[{"actorName":"Tony Todd","urlProfile":"http://www.imdb.com/name/nm0865302","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTI1Njc4NV5BMl5BanBnXkFtZTcwMDg4NzcyNg@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1954","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Anthony Tiran Todd","height":"6' 5\" (1.96 m)","bio":"Perhaps best known for his chilling performance as \"Candyman\", the charismatic 6' 5\" actor Tony Todd has consistently turned in compelling performances since his debut in the fantasy film Sleepwalk (1986). Born in Washington, D.C., Todd spent two years on a scholarship at the University of Connecticut, which, in turn, led to a scholarship from the renowned Eugene O'Neill National Theatre Institute. It proved to be the foundation for intense stints at the Hartman Conservatory in Stamford, Connecticut and the Trinity Square Repertory Theatre Conservatory in Providence, Rhode Island. Todd appeared in dozens of classical and many experimental plays, yet still managed to find time to teach playwriting to high school students in the Hartford public school system. Todd's extensive credits exemplify his versatility. They include such film classics as The Rock (1996), The Crow (1994), Lean on Me (1989), Bird (1988), Night of the Living Dead (1990), Destination finale (2000), the multiple Academy Award winning Oliver Stone film Platoon (1986) and Le secret (2000), which was nominated and screened at the Cannes Film Festival. Todd's recent films include the independent film Silence (2002) and Final Destination 2 (2003). He has had prominent guest starring roles in numerous critically-acclaimed television series, including recurring on Boston Public (2000), For the People (2002) and The District (2000), as well as NYPD Blue (1993), Smallville (2001), Law & Order (1990), Crossing Jordan (2001), Homicide: Life on the Street (1993) and The X-Files (1993). Todd recurred on three incarnations of \"Star Trek\" and guest starred on Xena: Warrior Princess (1995) and episodes of CSI: Miami (2002) and Andromeda (2000). His television movies include starring roles in True Women (1997), Black Fox (1995), Butter (1998), Ivory Hunters (1990), Babylon 5: A Call to Arms (1999) and Control Factor (2003). Todd's considerable theatre credits include the world premiere of award-winning playwright August Wilson's \"King Hedley II\", where he originated the title role in Pittsburgh, Seattle and Boston. Variety commented: \"Todd's King Hedley dominates the stage. A sour-faced mix of rage and resolve, anger and vulnerability. Todd's Hedley was a memorable tour-de-force even on opening.\" He also received a coveted Helen Hayes nomination for his performance in Athol Fugard's \"The Captain's Tiger at La Jolla, the Manhattan Theatre Club and the Kennedy Center. Other theatre credits include \"Les Blancs\", \"Playboy of the West Indies\", \"Othello\", \"Zooman and the Sign\", award-winning playwright Keith Glover's \"Dark Paradise\", \"Aida\" (on Broadway), and most recently, \"Levee James\" for the prestigious Eugene O'Neill Playwrights Conference and The New Dramatist Guild.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTI1Njc4NV5BMl5BanBnXkFtZTcwMDg4NzcyNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0865302","name":"Tony Todd","idIMDB":"nm0865302"},"actorId":"nm0865302","character":"Jackson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Berryman","urlProfile":"http://www.imdb.com/name/nm0077720","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0OTA0MTAwM15BMl5BanBnXkFtZTcwOTQ3MDQ4NA@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1948","placeOfBirth":" Los Angeles, California, USA","birthName":"Michael John Berryman","height":"6' 2\" (1.88 m)","bio":"Late 1970s horror genre icon who's best known for his creepy performance as \"Pluto\" in the uncompromising Wes Craven horror film The Hills Have Eyes (1977). Berryman (who suffers from Hypohidrotic Ectodermal Dysplasia, a rare condition leaving him with no sweat glands, hair, fingernails or teeth) reminds one of a latter-day Rondo Hatton who also suffered from a rare medical condition that distorted his features giving him a brutish look just right for horror movies. To Berryman's credit, he managed to develop upon his \"Pluto\" character, and has turned up in numerous sci-fi / fantasy movies such as My Science Project (1985), Weird Science (1985), Armed Response (1986) and Evil Spirits (1990). The tall & lean Berryman generally portrays mutant bikers, evil undertakers, monsters and other frightening characters! A genuine favorite of horror movie fans.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0OTA0MTAwM15BMl5BanBnXkFtZTcwOTQ3MDQ4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0077720","name":"Michael Berryman","idIMDB":"nm0077720"},"actorId":"nm0077720","character":"Crazy Earl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jackie Moore","urlProfile":"http://www.imdb.com/name/nm2624868","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMDYwODY5OV5BMl5BanBnXkFtZTgwNzcyMDI2NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Jacqueline Moore","height":"5' 9\" (1.75 m)","bio":"After breaking into acting with small roles in the feature films Fugly! (opposite John Leguizamo) and Chlorine (opposite Vincent D'Onofrio), she moved to Los Angeles to continue working in film and TV. During her first year in LA she booked the leads in six feature films. In addition to more film work Jackie has recently appeared on The Mindy Project, Westworld, Dr. Dre's upcoming series \"Vital Signs\", The Odd Couple, and soon to be released \"Barry\" (HBO) Since moving to LA, Jackie has studied improv at Groundlings, The Second City, and has trained consistently with Greg Braun since 2013. Jackie has also appeared in many publications including Cosmopolitan, Men's Fitness (interview and spread), Allure, Maxim, Loreal& FHM. She has also appeared on the Martha Stewart Show, Fox and Friends, The NBC Early Show, Access Hollywood, & was interviewed on the Howard Stern Show on January 7th, 2013 Jackie is also a trained singer, visual artist and recently co wrote her first screenplay.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMDYwODY5OV5BMl5BanBnXkFtZTgwNzcyMDI2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2624868","name":"Jackie Moore","idIMDB":"nm2624868"},"actorId":"nm2624868","character":"Kayla","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joey Fatone","urlProfile":"http://www.imdb.com/name/nm0004909","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzMwMDY1ODkyMV5BMl5BanBnXkFtZTcwOTQwMjc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 January 1977","placeOfBirth":" Brooklyn, New York, USA","birthName":"Joseph Anthony Fatone Jr.","height":"6' (1.83 m)","bio":"Joey Fatone was born on January 28, 1977 in Brooklyn New York, to Phyllis and Joseph Anthony Fatone, who is an actor and musician. He is of Italian descent. At age 13, his family moved down to Orlando Florida. After graduating from high school, he started to work at Universal Studios. There, he met a co-worker named Chris Kirkpatrick. Joey also became friends with a member of The All New Mickey Mouse Club (1989) named J.C. Chasez. In 1995, he was at a club and ran into Chris, JC and a another guy named Justin Timberlake. They started a singing group, but something was missing and so Justin called his vocal coach and got Lance Bass. So, Joey became a member of the dude-group called *NSYNC. Since his NSYNC days, Joey has branched out into film acting roles, co-starring in Mariage à la grecque (2002), and appearing as a contestant on Dancing with the Stars (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzMwMDY1ODkyMV5BMl5BanBnXkFtZTcwOTQwMjc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004909","name":"Joey Fatone","nicknames":["Super Joey","Superman","Phat One","phat-one"],"idIMDB":"nm0004909"},"actorId":"nm0004909","character":"Dave","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Chokachi","urlProfile":"http://www.imdb.com/name/nm0002003","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjYyMzkwNjI1NV5BMl5BanBnXkFtZTgwMDEwOTY2NzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 January 1968","placeOfBirth":" Plymouth, Massachusetts, USA","birthName":"David Al-Chokhachy","height":"5' 11\" (1.8 m)","bio":"David Chokachi was born on January 16, 1968 in Plymouth, Massachusetts, USA as David Al-Chokhachy. He is an actor, known for Baywatch (1989), Witchblade (2001) and Beyond the Break (2006). He has been married to Brooke Burke-Charvet since August 12, 2011. They have two children. He was previously married to Susan Brubaker.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjYyMzkwNjI1NV5BMl5BanBnXkFtZTgwMDEwOTY2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002003","name":"David Chokachi","idIMDB":"nm0002003"},"actorId":"nm0002003","character":"Rhodes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tommy Dreamer","urlProfile":"http://www.imdb.com/name/nm0490873","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGEwYTM2ZDMtYTYzMS00ZTk5LThhOTktMDEwNTMxMGViZGQ0XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1971","placeOfBirth":" Yonkers, New York, USA","birthName":"Thomas Laughlin","height":"6' 3\" (1.91 m)","bio":"Tommy Dreamer was born on February 14, 1971 in Yonkers, New York, USA as Thomas Laughlin. He is an actor and director, known for Eastern Championship Wrestling (1993), House of Hardcore X (2015) and Almost Mercy (2015). He has been married to Trisa Hayes since October 12, 2002. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGEwYTM2ZDMtYTYzMS00ZTk5LThhOTktMDEwNTMxMGViZGQ0XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0490873","name":"Tommy Dreamer","nicknames":["The Innovator of violence","King of Extreme","TD Madison","Tommy Dreamer"],"idIMDB":"nm0490873"},"actorId":"nm0490873","character":"Carpoza","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nick Principe","urlProfile":"http://www.imdb.com/name/nm1891137","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg5ODg2NjY0Ml5BMl5BanBnXkFtZTcwMjQzMzExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 December 1978","placeOfBirth":" Providence Rhode Island, USA","birthName":"Nicholas J Principe","height":"6' 7\" (2.01 m)","bio":"Nick Principe was born on December 30, 1978 in Providence Rhode Island, USA as Nicholas J Principe. He is known for his work on American Muscle (2014), Laid to Rest (2009) and The Summer of Massacre (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg5ODg2NjY0Ml5BMl5BanBnXkFtZTcwMjQzMzExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1891137","name":"Nick Principe","idIMDB":"nm1891137"},"actorId":"nm1891137","character":"Donald","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jasmin St. Claire","urlProfile":"http://www.imdb.com/name/nm0820580","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0ODU0MDgxMl5BMl5BanBnXkFtZTgwMTk2MTAzNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 October 1970","placeOfBirth":" St. Croix, U.S. Virgin Islands","birthName":"Rhea Alexandra DeVlugt","height":"5' 7\" (1.7 m)","bio":"Jasmin St. Claire shot to fame as \"America's Most Controversial Sex Symbol\" after appearing in the top-selling adult films of the late 1990s. She created an outlaw rock star image that at times scandalized the adult industry. Her acerbic humor and willingness to mock her own porn stardom made her one of the highest rated guests on Howard Stern's radio show and related broadcasts for E! Entertainment. St. Claire's first mainstream appearances were in significant comic roles in Communication Breakdown and in National Lampoon Dorm Daze 2. More recently, while studying in Bill O'Leary's Acting Workshop, St. Claire has turned to dramatic roles in thrillers like Angel of Reckoning and the talked about sci-fi drama Trial Run. St. Claire is often cast in ethnically ambiguous roles, or as Italian or Middle Eastern, but she identifies as a Latina due to her mixed Northern European and Brazilian ancestry. St. Claire's background is almost entirely at odds with her early adult-film career. She was born Rhea De Vlugt in the U.S. Virgin Islands. Her father, from Holland, operated a food distribution company. Her mother was a U.S.-educated lawyer, originally from Brazil. St. Claire grew up on Manhattan's Upper westside and attended the Lycee Francais and McBurney School, whose alumni include Henry Winkler and J.D. Salinger. St. Claire graduated from Brooklyn Friends School at age 16, with honors for her work in the pioneering \"Art without Walls\" tutoring program for inner city youth. Upon graduation from Columbia University, St, Claire became a financial consultant at S. G. Warburg (then, a division of Swiss Bank.). But while in a physically abusive relationship with a prominent Manhattan lawyer (whom St. Claire later outed in an interview with Howard Stern), she began a secret life as a topless dancer at Manhattan's infamous KitKat Club, then at Flashdancers. St. Claire entered the adult industry on a dare. Invited on the Jerry Springer Show for a scripted role as antagonistic stripper, St. Claire invented her larger-than-life \"Jasmin St. Claire\" persona. St. Claire's flare for theater and controversy marked her ascent in the adult film world. She polarized the industry by calling porn films \"by and large, disgusting and brainless.\" But she quickly dethroned Jenna Jameson as America's top-selling porn star, and became the first Latina to surpass traditional blond porn star archetypes when her films achieved number one sales position in 1998. She was inducted in AVN's \"Hall of Fame\" as one of the greatest porn stars of all time. St. Claire was among the first adult performers to be merchandized as an action figure and to star in an adult comic book series. At the height of her porn stardom, St. Claire was the subject of critical essays by David Foster Wallace and Evan Wright. She also served as inspiration for Chuck Palahniuk's novel Snuff, in which she appears as a character. For all the controversy she engendered, St. Claire only spent three years in the adult business and made just over two dozen films. In 1999, she retired. She never made an adult film again, though compilations of old footage re-released under new titles continued to be sold through the 2000s. St. Claire pushed herself to new extremes by becoming a pro-wrestler. In 1998 the Dudley Boyz invited her to appear in the ECW's Living Dangerously pay-per-view event. St. Claire subsequently trained under Sue Sexton and Mando Guerrero, then worked with wrestling legend Jimmy Lawler in the Memphis Championship and in the XWF and NWA-TNA. St. Claire often played the role of \"manager,\" who would enter the ring and fight alongside wrestlers. In real life, St. Claire created the upstart federation 3PW becoming the first female owner ever to operate and promote a wrestling league, five years before Stephanie McMahon took the reigns of the WWE. St. Claire closed the doors to 3PW in 2005. St. Claire became a heavy-metal journalist and on-air personality with the launch of the Metals Darkside series in 2004, which she also produced. Her interest in heavy metal stretches back to the first Black Sabbath show she attended at Madison Square Garden when she was nine. In 1998 she became the first female to emcee March Metal Meltdown in New Jersey, helping to introduce Sepultura to a North American audience. Through the mid-2000s St. Claire served as a veejay for The Metal Scene TV Show, AOL Noisecreep, Inferno TV and Stay Heavy TV, while writing articles as a contributor to Yahoo News and Guitar Player. She also served as a spokesmodel for B.C. Rich Guitars, Coffin Case, Krank Amplifiers and licensed her likeness to Guitar Hero for a controller made by Peavey. St. Claire returned to acting 2013 in a series of dramatic roles, portraying an FBI agent in Army of the Damned and hardened street criminal in Grand Auto Theft. Continuing intensive studies under Bill O' Leary, she has recently been cast in significant roles in Celebrapy, Angel of Reckoning and Blue Suede.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0ODU0MDgxMl5BMl5BanBnXkFtZTgwMTk2MTAzNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0820580","name":"Jasmin St. Claire","idIMDB":"nm0820580"},"actorId":"nm0820580","character":"Agent Hart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julie Ann Dawson","urlProfile":"http://www.imdb.com/name/nm5661359","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY4YzQ2NjktMzhhMS00Zjg2LWJmMDctNGM3ODQyMjg2NDBjL2ltYWdlXkEyXkFqcGdeQXVyNDMyNjUyOTA@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Julie Ann Dawson was raised in the smallest town in the smallest state in the United States- North Providence, Rhode Island. Julie is of English, Irish, and Swedish heritage. She has one younger brother, Dan. She developed a passion for acting and entertaining early on, starting her debut on stage at 2-years-old with dance, participating in school and church plays, and performing talent shows for her family on the weekends. Before Julie became an actress, she was an award-winning competitive cheerleader for 10 years, and involved with gymnastics, dance, and five months of professional wrestling training. Outside of athletics, Julie has worked in every area of the modeling industry, including hosting events like, \"Diamond In The Rough National Talent Artist Search,\" alongside Chris Kirkpatrick from 'N Sync, and Grammy-winning producer, Earl Cohen. Julie was also the main host in 2014 for all main events and giveaways for Foxwoods, New England's largest resort and casino, opening for concerts such as Jennifer Lopez, Smokey Robinson, and New Edition. Julie attended the University of Rhode Island, where she graduated just shy of Summa Cum Laude, with Bachelor of Arts degrees in both, journalism and public relations with a minor in theater. Right after graduation from college, Julie was hired in her first job interview by one of the top three full-service marketing communications agencies in Rhode Island as an account coordinator in public relations, working with several Fortune five companies. After several months on the job, she was consistently booking acting and modeling jobs, but found the balance of full-time work and following her passion for acting impossible to coexist. Julie made the decision to leave her full-time job and dedicate her life to pursuing a career in acting. In just one year after leaving her full-time career, Julie acted in 15 films, starred in five music videos, six commercials, two web episodes, and served as a personal assistant to three-time Emmy Award winner, John Wesley Shipp. In that time, she has modeled for many prominent designers, photographers, and national ad campaigns. Julie is a self-taught painter, and enjoys trap shooting in her free time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY4YzQ2NjktMzhhMS00Zjg2LWJmMDctNGM3ODQyMjg2NDBjL2ltYWdlXkEyXkFqcGdeQXVyNDMyNjUyOTA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5661359","name":"Julie Ann Dawson","idIMDB":"nm5661359"},"actorId":"nm5661359","character":"Laura","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maria Kanellis","urlProfile":"http://www.imdb.com/name/nm1675780","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1Mzc1MTIyOV5BMl5BanBnXkFtZTcwNDMxMzA1Mw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 February 1982","placeOfBirth":" Ottawa, Illinois, USA","birthName":"Maria Louise Kanellis","height":"5' 7\" (1.7 m)","bio":"Maria Kanellis is an actress, singer, TV hostess/personality, former WWE Diva and aspiring fashion designer. She is currently appearing on \"The Celebrity Apprentice\" on NBC. She is releasing her first music album, a 4 song EP, on April 13th, 2010. She is most well-known as a former professional wrestler and personality within World Wrestling Entertainment (WWE) for the past 5 years. Maria Louise Kanellis was born on February 25, 1982 in Ottawa, Illinois. The oldest of three siblings she grew up surrounded by cars and her free time was spent juggling sports, pageants and dancing. In 2004 Maria made her first of many television appearances when she was a contestant on the reality series Outback Jack. Soon after she tried out for the WWE Diva Search and placed fifth out of thousands of contestants. Although she was eliminated, Maria was later hired by WWE as a backstage interviewer on Monday Night Raw and began training for the next 3 years at the Ohio Valley Wrestling facility. She began competing in the ring as a wrestler in 2005. After her debut Maria worked alongside the company's biggest superstars including John Cena, Dwayne \"The Rock\" Johnson, and \"Stone Cold\" Steve Austin. Maria never shied away from angles or story lines and is most comfortable in the spotlight. She posed for the April 2008 cover and pictorial in Playboy magazine, which WWE incorporated into one of the year's most popular story-lines on Monday Night Raw. For the Playboy shoot, Maria chose several elements, including lighting, wardrobe and style. She even designed and produced some of her own wardrobe for this \"high-fashion\" themed layout. She has also created outfits for her wrestling matches, television appearances, red carpet charity events and high profile WWE ceremonies. Maria enjoyed some cross-over success while with the WWE, making several TV appearances. She has co-hosted G4 Network's \"Attack of the Show\" and she lists \"Deal or No Deal,\" \"Family Feud,\" \"Project Runway,\" \"VH1's Top 20 Video Countdown,\" \"The Insider,\" \"Best Damn Sports Show,\" \"Red Eye,\" and \"The Today Show,\" among several television appearances on her resume. In March 2010, she will appear as a cast member of NBC's hit series \"The Celebrity Apprentice\" alongside fellow contestants Sharon Osbourne, Brett Michaels, and Cindy Lauper to name a few. Maria worked with the Make-A-Wish Foundation as her charity of choice during filming. She is very active when it comes to other charitable organizations, such as Generation Rescue, Paws For Style, St. Jude's Children Hospital and The Kentucky Humane Society to name a few. Philanthropy holds a special place with Maria as she continually donates her time and money towards newfound, worthy causes. She has traveled overseas with the WWE from 2005-2008 for it's annual USO Tribute to the Troops Tour, donating her time and energy to entertain and spread goodwill to our servicemen and women stationed overseas. Maria was recently named WWE's Diva of the Year for 2009, a popular fan vote as decided by the WWE Universe. Shortly after she was released unexpectedly by the WWE, citing Maria's deep desire to pursue outside interests, such as TV, movies, and writing and producing her own music. Maria describes her rock music as a combination of glamour, twisted lyrics and sex appeal. The first EP is titled \"Sevin Sins.\" Maria has only began her rise to stardom but already has millions of fans worldwide and an intense drive for success. Her creativity is evident in everything she does. Maria's life mantra that inspires her is \"Passion is my Motivation.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1Mzc1MTIyOV5BMl5BanBnXkFtZTcwNDMxMzA1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1675780","name":"Maria Kanellis","nicknames":["Boop","Dancer"],"idIMDB":"nm1675780"},"actorId":"nm1675780","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sully Erna","urlProfile":"http://www.imdb.com/name/nm1263394","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzUwNDkxODcyNl5BMl5BanBnXkFtZTcwMjg0MjcxOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1968","placeOfBirth":" Lawrence, Massachusetts, USA","birthName":"Salvatore Paul Erna","height":"5' 6\" (1.68 m)","bio":"Sully Erna, best known as singer and main songwriter of acclaimed rock band Godsmack was born and raised in the suburbs of Boston Massachusetts. He has been a musician since the tender age of 3 years old, where he began his musical journey as a drummer. Already a proven commodity as the frontman of one of today's most powerful rock bands, Erna is also a successful producer, actor, and multi-instrumentalist, and has reaped a myriad of accolades, including several industry records such as: . 18 Million Albums World Wide . 3rd consecutive #1 debut album on the Billboard 200 charts o Faceless (2003) o Godsmack IV (2006) o The Oracle (2010) . 21-Top 10 singles - More than any other band in Active Rock history!! . Seven #1 Songs, including the smash hit \"I Stand Alone\" that stood at #1 for 17 weeks straight. . Billboard Music Award. \"Rock Artist of the Year\" . EMMY in 2005 for Best Sports Show on NESN with Charlie Moore the Mad Fisherman. . Four Grammy Nominations. . Soundtracks - The Expendables (Sylvester Stallone) , Any Given Sunday (Al Pacino), Scorpion King (Dwane Johnson), The One (Jet Li), and many many more. 2007 - Cast for \"Mark\" a small town junkie on the FX series \"Dirt\" starring Cortney Cox. 2013 - Cast for Paul \"sunny\" Wade, a prison assassin in the Eric Bross short film \"Goliath\" 2014 - Cast for Sherriff Bridge in the indy horror \"Army Of The Damned\" starring Tony Todd & Michael Berryman 2016 - Cast for the Feature \"Bleed For This\", Executive Producer, Martin Scorsese. Starring Miles Teller, Katie Segal and Aaron Eckheart, 2016 - Cast for \"Nature\" in the Feature \"Street Level\", starring various cast from Sons Of Anarchy\" including, David Labrava, Danny Trejo, Drea DeMatao, Emilio Rivera 2017 - Cast for lead detective in the Feature \"The Getter\", starring Tom Sizemore","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzUwNDkxODcyNl5BMl5BanBnXkFtZTcwMjg0MjcxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1263394","name":"Sully Erna","nicknames":["Sully"],"idIMDB":"nm1263394"},"actorId":"nm1263394","character":"Bridge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Madeline Merritt","urlProfile":"http://www.imdb.com/name/nm3201934","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE0Njk2MDA2M15BMl5BanBnXkFtZTgwMzMyNTY3NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Madeline Merritt is an actress and producer, known for The Guest House (2012), American Idiots (2013) and Auteur (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE0Njk2MDA2M15BMl5BanBnXkFtZTgwMzMyNTY3NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3201934","name":"Madeline Merritt","idIMDB":"nm3201934"},"actorId":"nm3201934","character":"Patricia Woods","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thea Trinidad","urlProfile":"http://www.imdb.com/name/nm4371077","urlPhoto":"","biography":{"dateOfBirth":"27 December 1990","placeOfBirth":" Queens, New York, USA","birthName":"Thea Megan Trinidad","height":"4' 11½\" (1.51 m)","bio":"Thea Trinidad was born on December 27, 1990 in Queens, New York, USA as Thea Megan Trinidad. She is an actress, known for Chilling Visions: 5 Senses of Fear (2013), Hope Bridge (2015) and House of Hardcore X (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4371077","name":"Thea Trinidad","nicknames":["Divina Fly","Rosita"],"idIMDB":"nm4371077"},"actorId":"nm4371077","character":"Lawson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Gere","urlProfile":"http://www.imdb.com/name/nm1020877","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMDY3ODU5N15BMl5BanBnXkFtZTcwOTQ4NTkyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 February 1975","placeOfBirth":" Cromwell, Connecticut, USA","birthName":"David James Gere","height":"5' 10\" (1.78 m)","bio":"David James Gere grew up in the small town of Cromwell, CT. His mother and sister were tragically killed in a mysterious drowning accident when he was very young. His father, James, an educator, later married Veronica Gere, who raised him. An outstanding student, Gere graduated from Providence College in Rhode Island (1997), receiving a BA in Political Science and a Minor in Film Studies. Early on, David began modeling and working on both sides of the camera in films and commercials. Despite a European print campaign for GUESS Jeans (1997), David was more inspired by acting and filmmaking. He soon began a run of short films, documentaries, and music videos (MTV2) that were critically well-received. He developed a relationship with the emerging Rhode Island directors, Michael Corrente and Peter Farrelly, and got his first acting break in Outside Providence (1999), a film which Peter and his brother Bobby Farrelly produced and Corrente directed. In 2006, David appeared in Rocky Balboa, which he cites as a significant turning point, having been directed by his childhood hero, Sylvester Stallone. In 2007, David appeared on the CW Network's hit show Gossip Girl as Frank Meltzer. David is also an experienced stuntman, having performed stunts in The Dark Knight (2008) as one of Bane's Mercenaries. After working closely with professional wrestling legend Tommy Dreamer on the horror movie set of Army Of The Damned (2013), David began a career in the squared circle. Under Dreamer's guidance, Gere began performing as the villainous heel manager, DG Haven. The character has a cult level following, and is established in major promotions throughout North America. David is currently continuing his acting career, and is a producing partner for several major production companies including Woodhaven Productions and The Switzer Entertainment Group. David Gere resides in Connecticut, where he owns several nightlife venues. David is also an accomplished abstract painter, his pieces have appeared in various films, and his work has been commissioned by celebrity peers. David is very devoted to charitable causes for children, ranging from The United Way, to local organizations, including his own youth mentor program. He often credits his focus for helping young people, along with his drive and desire to create, to the difficult loss he experienced as a boy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMDY3ODU5N15BMl5BanBnXkFtZTcwOTQ4NTkyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1020877","name":"David Gere","nicknames":["Shadow"],"idIMDB":"nm1020877"},"actorId":"nm1020877","character":"Agent Colton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Paolino","urlProfile":"http://www.imdb.com/name/nm0660057","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNTExOTE5OF5BMl5BanBnXkFtZTgwNjc2MDIyMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Thomas J. Paolino III","height":"5' 9\" (1.75 m)","bio":"Tom Paolino is an actor, writer, director and producer living in New York City. Upcoming films include \"A Little Something for your Birthday\" and \"Passaic\". Two stories he wrote are now short films, including \"Please Punish Me\" which has been accepted into 21 film festivals. Tom graduated from Brown University and trained with Sanford Meisner and Larry Moss. He currently studies with Austin Pendleton at HB Studios. When he is not acting, Tom directs original plays in the NYC prison system through his theatre company, Xavier Theatre.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNTExOTE5OF5BMl5BanBnXkFtZTgwNjc2MDIyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0660057","name":"Tom Paolino","idIMDB":"nm0660057"},"actorId":"nm0660057","character":"Sobecheck","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2570436","urlIMDB":"http://www.imdb.com/title/tt2570436","business":{"budget":{"money":"$1,200,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 25 min (85 min)"],"soundMix":null,"color":null,"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"3.9","filmingLocations":[],"awards":[],"votes":"343","type":"Movie","companyCreditsSimple":[{"idCompany":"co0313827","name":"Woodhaven Production Company"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:19:24"}}