{"data":{"movies":[{"title":"Life After Beth","originalTitle":"","year":"2014","releaseDate":"20140715","directors":[{"name":"Jeff Baena","id":"nm1337885"}],"writers":[{"name":"Jeff Baena","id":"nm1337885"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3OTUwOTMxOF5BMl5BanBnXkFtZTgwODg4NTkwMjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Horror","Romance"],"plot":"A hike alone in the woods ends tragically for Beth Slocum with a fatal snake bite. Her death leaves her parents and boyfriend Zach reeling. After the funeral, Zach tries to make friends with Mr. and Mrs. Slocum, but even they reject him, and he's determined to figure out why. Then he sees Beth. Her parents are trying to keep her resurrection a secret, but zombie Beth provides Zach with the opportunity to do everything with her that he didn't get to do while she was still alive. But with Beth's increasingly erratic behavior and even more strange occurrences around town, life with the undead Beth proves to be particularly complicated for her still-living loved ones.","simplePlot":"A young man's recently deceased girlfriend mysteriously returns from the dead, but he slowly realizes she is not the way he remembered her.","actors":[{"actorName":"Aubrey Plaza","urlProfile":"http://www.imdb.com/name/nm2201555","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMzYyMjQ5OV5BMl5BanBnXkFtZTcwMTA0MTkxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1984","placeOfBirth":" Wilmington, Delaware, USA","birthName":"Aubrey Christina Plaza","height":"5' 6\" (1.68 m)","bio":"Aubrey Christina Plaza (born June 26, 1984) is an American actress and comedian known for her deadpan style. She portrayed April Ludgate on Parks and Recreation (2009), and after appearing in supporting roles in several films, had her first leading role in the 2012 comedy Safety Not Guaranteed (2012). Plaza began her career as an intern. After performing improv and sketch comedy at the Upright Citizens Brigade Theater, she appeared in the web series The Jeannie Tate Show (2007). She later appeared in films such as Funny People (2009), Scott Pilgrim vs. the World (2010) and Life After Beth (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyMzYyMjQ5OV5BMl5BanBnXkFtZTcwMTA0MTkxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2201555","name":"Aubrey Plaza","idIMDB":"nm2201555"},"actorId":"nm2201555","character":"Beth Slocum","urlCharacter":"http://www.imdb.com/character/ch0396662","main":true},{"actorName":"Dane DeHaan","urlProfile":"http://www.imdb.com/name/nm2851530","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzOTgwNjg0OV5BMl5BanBnXkFtZTgwNTgyMTA1NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 February 1986","placeOfBirth":" Allentown, Pennsylvania, USA","birthName":"Dane William DeHaan","height":"5' 10\" (1.78 m)","bio":"Dane DeHaan has made a formidable impression on film and television audiences and is one of the industry's most sought after actors of his generation. Dane is shooting Gore Verbinski's A Cure for Wellness and will soon begin production starring in Luc Besson's Valerian. DeHaan has recently finished shooting the indie, Two Lovers and a Bear, directed by Kim Nguyen and starring opposite Tatiana Maslany. Dane can soon be seen in Weinstein Co's Tulip Fever, directed by Justin Chadwick opposite Alicia Vikander, Christoph Waltz, Zach Galifianakis and Jack O'Connell. DeHaan can also most recently be seen in the independent film Life, opposite Robert Pattinson and directed by photographer and film director Anton Corbijn. Based on a true story of James Dean (DeHaan). DeHaan was also recently seen in Sony Pictures' The Amazing Spider-Man 2 in the role of Harry Osbourne opposite Andrew Garfield, Emma Stone and Jamie Foxx. Directed by Marc Webb, the action-adventure film was released on May 2, 2014 and has grossed $694 million worldwide to-date. In 2013, DeHaan was nominated for a Gotham Award in the \"Breakthrough actor\" category and at the Hamptons International Film Festival in the \"Breakthrough Performer\" category for his leading role in Sony Picture Classics' critically acclaimed beat generation film Kill Your Darlings. Directed by John Krokidas, the film is loosely based on the life of poet Allen Ginsberg (Daniel Radcliffe). In March 2013, DeHaan starred in the critically lauded Focus Features film The Place Beyond the Pines, directed by Derek Cianfrance (Blue Valentine) opposite Ryan Gosling, Eva Mendes and Bradley Cooper. DeHaan portrayed the character of Gosling's young son, Jason. The film was recognized by the National Board of Review as one of their top 10 films of 2013. In 2012, Dane starred in The Weinstein Company's film Lawless, directed by John Hillcoat (The Road), opposite Shia LaBeouf, Tom Hardy, Jason Clark, Gary Oldman and Guy Pearce. The film, set in a depression-era, gritty Virginia, follows three brothers who are part of a bootlegging gang, illegally selling moonshine. Also in 2012, DeHaan starred in 20th Century Fox's box office hit, Chronicle, which was released in February 2012. DeHaan first came on the radar for his portrayal of Jesse on HBO's critically acclaimed drama series In Treatment, in which he starred in the third season of the series alongside Gabriel Byrne. His performance was praised as a \"revelatory breakthrough\" by Variety and \"brilliant\" by the Chicago Sun Times. Other film and television credits include Lincoln, directed by Steven Spielberg, Devil's Knot, True Blood, Stormy Weather, Woodrow Wilson and Magnolia Pictures' Jack and Diane, directed by Bradley Rust Gray. DeHaan began his film career under the direction of two-time Oscar Nominee John Sayles and opposite Chris Cooper in Amigo, released by Variance films in 2011. A graduate of the University of North Carolina School of the Arts, Dane currently resides in New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzOTgwNjg0OV5BMl5BanBnXkFtZTgwNTgyMTA1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2851530","name":"Dane DeHaan","idIMDB":"nm2851530"},"actorId":"nm2851530","character":"Zach Orfman","urlCharacter":"http://www.imdb.com/character/ch0396664","main":true},{"actorName":"John C. Reilly","urlProfile":"http://www.imdb.com/name/nm0000604","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDEzMDkzOF5BMl5BanBnXkFtZTYwNzQzNzcy._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1965","placeOfBirth":" Chicago, Illinois, USA","birthName":"John Christopher Reilly","height":"6' 2\" (1.88 m)","bio":"Character actor, dramatic leading man, or hilarious comic foil? With an astonishing range of roles already under his belt, John C. Reilly has played an eclectic host of rich characters to great effect over the years, from seedy ne'er-do-wells, to lovable, good-natured schlepps. The fifth of six children, John Christopher Reilly was born in Chicago, to a father of mostly Irish descent, and a Lithuanian-American mother, and was brought up on Chicago's tough Southwest territory. His father, also named John, ran an industrial linen supply company business. On the amateur stage from age eight, Reilly trained at the Goodman School of Drama and eventually became a member of Chicago's renowned Steppenwolf Theatre. His film break came with a small role in the Vietnam War drama Casualties of War (1989), wherein Brian De Palma liked his work so much during the early stages that he recast him in a major role by the start of shooting as a soldier bent on rape. Reilly gained momentum throughout the 1990s and showed his dazzling stretch of talent in such films as Days of Thunder (1990), Shadows and Fog (1991), What's Eating Gilbert Grape (1993) and The River Wild (1994). He became a major stock player in director Paul Thomas Anderson's films, while finding some of his best roles in Hard Eight (1996) as a compulsive gambler, Boogie Nights (1997) in which he played a narcissistic porn star, and in Magnolia (1999) as a compassionate policeman. He went on to earn further critical points for his role of the soldier sent to the front lines in Terrence Malick's war epic The Thin Red Line (1998). On stage, Reilly has wowed audiences in \"The Grapes of Wrath\" on Broadway, \"A Streetcar Named Desire\" and \"Othello\" at Steppenwolf, and earned an Outer Critics Circle Award and Tony nomination for \"True West\" alongside another impeccable character player Philip Seymour Hoffman. Reilly finally received the film recognition he deserved in 2002 with a slew of choice, high-profile parts in The Hours (2002), The Good Girl (2002), Gangs of New York (2002), and especially Chicago (2002) as the put-upon husband, Amos Hart, who is played for a patsy by murderous wife Roxie (Renée Zellweger). For this last part, he received both Golden Globe and Academy Award nominations for Best Supporting Actor. Since then his stock has risen considerably, and he has further widened his cinematic repertoire, appearing in everything from dramatic roles - We Need to Talk About Kevin (2011), Aviator (2004) and Carnage (2011) - to broader comic turns - Walk Hard: The Dewey Cox Story (2007), Talladega Nights: The Ballad of Ricky Bobby (2006), Step Brothers (2008), Cyrus (2010) and Cedar Rapids (2011). Most recently, he has voiced the lead in Disney's animated smash Wreck-It Ralph (2012). Reilly is married to producer Alison Dickey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDEzMDkzOF5BMl5BanBnXkFtZTYwNzQzNzcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000604","name":"John C. Reilly","idIMDB":"nm0000604"},"actorId":"nm0000604","character":"Maury Slocum","urlCharacter":"http://www.imdb.com/character/ch0396667","main":true},{"actorName":"Molly Shannon","urlProfile":"http://www.imdb.com/name/nm0788340","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDk3MDMyMDQ5MV5BMl5BanBnXkFtZTcwNTc5Mzk0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1964","placeOfBirth":" Shaker Heights, Ohio, USA","birthName":"Molly Helen Shannon","height":"5' 5\" (1.65 m)","bio":"Molly Shannon has successfully become one of Hollywood's most sought-after talents on television and the silver screen. Shannon was born in Shaker Heights, Ohio, to Mary Margaret (Keating), a teacher, and James Francis Shannon, a sales manager. Her parents were both of Irish descent. She earned a BFA in drama from New York University's prestigious Tisch School of the Arts. Prior to joining \"SNL\", Molly appeared at The Up Front Comedy Theater in Los Angeles in \"The Rob and Molly Show\", an improvisational show she co-wrote with Rob Muir. Shannon spent six seasons as a member of the repertory company on Saturday Night Live (1975), primarily known for the eclectic characters she created, such as \"Mary Katherine Gallagher\" and \"Sally O'Malley\". She is also praised for her parodies of Courtney Love, Liza Minnelli, Monica Lewinsky and Meredith Vieira. Shannon starred as \"Betty Lou Who\" in Ron Howard's worldwide blockbuster, How the Grinch Stole Christmas (2000); and the title role in Paramount's hit comedy, Superstar (1999), portraying everybody's favorite Catholic schoolgirl, \"Mary Katherine Gallagher\". Additionally, she also starred in the following feature films: A Night at the Roxbury (1998), a spin-off of the popular head-bopping, nightclubbing brothers on Saturday Night Live (1975); Warner Bros. comedy, Analyze This (1999), opposite Billy Crystal and Robert De Niro; Todd Solondz's controversial Happiness (1998); and Fox 2000's Never Been Kissed (1999), opposite 'Drew Barrymore'; Good Boy! (2003), a CGI-animated live-action comedy; My Boss's Daughter (2003) with Ashton Kutcher; Miramax's romantic comedy, Serendipity (2001), opposite John Cusack and Kate Beckinsale; Osmosis Jones (2001), the animated comedy co-starring Bill Murray; the independent feature film, Wet Hot American Summer (2001), opposite Janeane Garofalo and David Hyde Pierce; and a featured cameo opposite Tim Allen in Disney's The Santa Clause 2 (2002). Shannon's recent film credits include a cameo in Evan Almighty (2007), the sequel to the hilarious comedy, Bruce Almighty (2003), opposite Steve Carell; Keenen Ivory Wayans' Littleman (2006); Talladega Nights: The Ballad of Ricky Bobby (2006) with Will Ferrell and an appearance in the box-office smash hit, Scary Movie 4 (2006). Molly's independent film credits include Sue Kramer's Gray Matters (2006) opposite Heather Graham and Bruce Leddy's The Wedding Weekend (2006). On television, Shannon has been seen opposite Christopher McDonald and Jason Schwartzman in the off-beat comedy series, Cracking Up (2004), created by her Year of the Dog (2007) director, Mike White. Molly also starred in USA Networks original movie, The Twelve Days of Christmas Eve (2004), and appeared in the remake of the classic musical, The Music Man (2003), co-starring Matthew Broderick and Kristin Chenoweth. Additional television guest appearances include memorable roles on Will & Grace (1998), Sex and the City (1998) and Seinfeld (1989), among many others. Shannon returned to television in 2008, starring in the US version of the popular Australian sitcom, Kath & Kim (2008), for NBC with Selma Blair. \"Kath and Kim\" earned a \"Favorite New Comedy\" nomination from the People's Choice Awards in its first season. The very busy Shannon also lent her voice to Exodus Film Group's CG animated feature, Igor (2008), a comedy that brought a new twist to the classic monster genre, along with Jeremy Piven, Steve Buscemi and John Cleese. Shannon was also seen in the Lifetime Original movie, More of Me (2007), playing multiple versions of an overwhelmed and overextended career woman who struggles to find balance in her roles as a wife, mother and working professional. In her most recent big screen appearance, Shannon starred in the quirky Paramount Vantage comedy, Year of the Dog (2007), for writer-director Mike White.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDk3MDMyMDQ5MV5BMl5BanBnXkFtZTcwNTc5Mzk0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0788340","name":"Molly Shannon","idIMDB":"nm0788340"},"actorId":"nm0788340","character":"Geenie Slocum","urlCharacter":"http://www.imdb.com/character/ch0396669","main":true},{"actorName":"Cheryl Hines","urlProfile":"http://www.imdb.com/name/nm0385644","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2NTQ0MTQyNF5BMl5BanBnXkFtZTcwMDU5MTQyNg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 September 1965","placeOfBirth":" Miami Beach, Florida, USA","birthName":"Cheryl Ruth Hines","height":"5' 5\" (1.65 m)","bio":"Cheryl Ruth Hines was born on September 21, 1965 in Miami Beach, Florida, to Rosemary (Graham) and James Hines, and grew up in Tallahassee, Florida. She went to West Virginia University, Florida State University and graduated from the University of Central Florida. She studied theater and television production, but it was not until she moved to Los Angeles and studied at the Groundlings Theater that she felt she had really learned anything about comedy. Her first teacher there was Lisa Kudrow. She learned to improvise and write comedy sketches. This experience helped her prepare for the role of Larry David's wife on HBO's Curb Your Enthusiasm (2000). The dialogue on the situation comedy is improvised, so she feels right at home. She still performs at the Groundlings Theater when she has a chance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2NTQ0MTQyNF5BMl5BanBnXkFtZTcwMDU5MTQyNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0385644","name":"Cheryl Hines","idIMDB":"nm0385644"},"actorId":"nm0385644","character":"Judy Orfman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Reiser","urlProfile":"http://www.imdb.com/name/nm0001663","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MjUwMjI4M15BMl5BanBnXkFtZTcwNzc0NTg3NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1957","placeOfBirth":" New York City, New York, USA","height":"5' 10\" (1.78 m)","bio":"As a seasoned actor, writer, and stand-up comedian, Paul Reiser continues to add to his list of accomplishments. In addition to co-creating and starring in the critically-acclaimed NBC series, Mad About You (1992), which garnered him Emmy, Golden Globe, American Comedy Award and Screen Actors Guild nominations for Best Actor in a Comedy Series, his successes also include his book, \"Couplehood\", which sold over two million copies and reached the number one spot on \"The New York Times\" best-seller list, and \"Babyhood\", his follow-up book, which features his trademark humorous take on the adventures of being a first-time father, which also made \"The New York Times\" best-seller list. Last year, Paul made his theatrical debut in Woody Allen's \"Writer's Block\". The evening of one-act comedies marked Mr. Allen's first time out as a director for the stage. Born and raised in New York City, Reiser went to college at the State University of New York at Binghamton, where he majored in Music - Piano and Composition. (He co-wrote \"The Final Frontier\" - the theme song from Mad About You (1992), with Grammy-winning producer Don Was). Remembered for notable performances in films, such as Diner (1982), Bye Bye Love (1995), The Marrying Man (1991), Aliens (1986), One Night at McCool's (2001) and Beverly Hills Cop (1984) and Beverly Hills Cop II (1987). More recently, he starred in two original movies for Showtime - Strange Relations (2001) (aka \"Strange Relations\"), opposite Julie Walters, and Chazz Palminteri's Women vs. Men (2002), opposite Joe Mantegna and Christine Lahti. His next film project, The Thing About My Folks (2005)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MjUwMjI4M15BMl5BanBnXkFtZTcwNzc0NTg3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001663","name":"Paul Reiser","idIMDB":"nm0001663"},"actorId":"nm0001663","character":"Noah Orfman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matthew Gray Gubler","urlProfile":"http://www.imdb.com/name/nm1131557","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTAwNzE4NzAyMV5BMl5BanBnXkFtZTgwNzUzMTIyODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 March 1980","placeOfBirth":" Las Vegas, Nevada, USA","height":"6' 1\" (1.85 m)","bio":"Matthew Gray Gubler is an Emmy award winning actor, director, producer, painter, and voice over actor from Las Vegas Nevada. While studying film directing at NYU he interned for Wes Anderson who gave him his first feature film role as Bill Murray's loyal intern \"Nico\" in The Life Aquatic with Steve Zissou (2004). For the past eleven years Gubler has starred as the lovable genius Dr. Spencer Reid on the internationally popular crime drama Criminal Minds (2005). Some of his other film acting credits include 500 Days of Summer (2009), Life After Beth (2014), and the cult hit comedy Suburban Gothic (2014) for which he was awarded the 2015 Best Actor Award by Screamfest. In 2014 he won an Emmy for his participation in Drake Doremus' mini series The Beauty Inside (2012). He has provided the voice of Simon the chipmunk in the wildly popular Alvin and the Chipmunks (2007) film franchise and recently voiced the Riddler for DC comic's animated film Batman: Assault on Arkham (2014). As of 2015, Gubler has directed 8 episodes of Criminal Minds, a behind the scenes documentary of the making of \"The Life Aquatic,\" two music videos for \"The Killers,\" videos for \"Whirwlind Heat,\" and \"Soko,\" as well as a fake mockumentary entitled Matthew Gray Gubler: The Unauthorized Documentary (2006) which lampoons his behavior behind the scenes on \"Criminal Minds.\" Also and accomplished painter, Gubler is known for his vivid and expressionistic portraits of people, animals, and imaginary monsters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTAwNzE4NzAyMV5BMl5BanBnXkFtZTgwNzUzMTIyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1131557","name":"Matthew Gray Gubler","nicknames":["The Gube","MGG"],"idIMDB":"nm1131557"},"actorId":"nm1131557","character":"Kyle Orfman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anna Kendrick","urlProfile":"http://www.imdb.com/name/nm0447695","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzOTA0OTQyN15BMl5BanBnXkFtZTcwMjE1OTIwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1985","placeOfBirth":" Portland, Maine, USA","height":"5' 2\" (1.57 m)","bio":"Anna Kendrick was born in Portland, Maine, to Janice (Cooke), an accountant, and William Kendrick, a teacher. She has an older brother, Michael Cooke Kendrick, who has also acted. She is of English, Irish, and Scottish descent. For her role as \"Dinah\" in \"High Society\" on Broadway, Anna Kendrick was nominated for a Tony Award (second youngest ever), a Drama Desk Award, and a Fany Award (best actress featured in a musical). Her spectacular performance landed her the Drama League and Theatre World Award. She was a lead performer with Cabaret's Kit Kat Club at \"Carnegie Hall Live\" in Great Performances: My Favorite Broadway: The Leading Ladies (1999) (1999) (TV). She also had the privilege of working with director Scott Ellis and choreographer Susan Stroman at the New York City Opera House with Jeremy Irons amongst many more celebrity status actors, playing the role of \"Fredrika\" in \"A Little Night Music\". Anna work-shopped \"Jane Eyre\" & \"The Little Princess\" for Broadway and starred in the feature film Camp (2003) with director Todd Graff.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzOTA0OTQyN15BMl5BanBnXkFtZTcwMjE1OTIwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0447695","name":"Anna Kendrick","idIMDB":"nm0447695"},"actorId":"nm0447695","character":"Erica Wexler","urlCharacter":"http://www.imdb.com/character/ch0473292","main":true},{"actorName":"Eva La Dare","urlProfile":"http://www.imdb.com/name/nm0245749","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWQ1NjE4YzEtZDIzNS00ZDc2LThkYjYtMGVlNWNiZmEwMjBlL2ltYWdlXkEyXkFqcGdeQXVyMTE1MjY5MTk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Eva La Dare was born in Brooklyn, New York, USA. She is an actress and director, known for Baskets (2016), How to Get Away with Murder (2014) and Resident Evil 5 (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWQ1NjE4YzEtZDIzNS00ZDc2LThkYjYtMGVlNWNiZmEwMjBlL2ltYWdlXkEyXkFqcGdeQXVyMTE1MjY5MTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0245749","name":"Eva La Dare","idIMDB":"nm0245749"},"actorId":"nm0245749","character":"Pearline","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas McDonell","urlProfile":"http://www.imdb.com/name/nm2973459","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjBmM2Y4M2MtNzg5My00NjBhLThhZTUtOTRhNTU2NTYyYzgyL2ltYWdlXkEyXkFqcGdeQXVyMTcwNDM4NjU@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 May 1986","placeOfBirth":" Manhattan, New York City, New York, USA","height":"5' 9¼\" (1.76 m)","bio":"Thomas McDonell was born on May 2, 1986 in Manhattan, New York City, New York, USA. He is an actor, known for The Forbidden Kingdom (2008), The 100 (2014) and Prom (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjBmM2Y4M2MtNzg5My00NjBhLThhZTUtOTRhNTU2NTYyYzgyL2ltYWdlXkEyXkFqcGdeQXVyMTcwNDM4NjU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2973459","name":"Thomas McDonell","idIMDB":"nm2973459"},"actorId":"nm2973459","character":"Dan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alia Shawkat","urlProfile":"http://www.imdb.com/name/nm0790057","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxOTQ3NjY3MV5BMl5BanBnXkFtZTcwNzY1MzY1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1989","placeOfBirth":" Riverside, California, USA","birthName":"Alia Martine Shawkat","height":"5' 5\" (1.65 m)","bio":"Alia Shawkat was born in Riverside, California, to Dina Burke and actor Tony Shawkat. Her maternal grandfather, Paul Burke, was also an actor. Her father is from Baghdad, Iraq, and her mother has Irish, Italian, and Norwegian ancestry. Success arrived early for Alia. Her career began at the young age of 11 when she landed a role on the ABC Family series State of Grace (2001). She later starred as \"Maeby Funke\" on Fox's Emmy-award winning Arrested Development (2003) where she portrayed a rebellious and mischievous member of a dysfunctional Orange County family trying to adjust to their loss of wealth. Alia was introduced to show business by appearing in a Calvin Klein catalog, which immediately attracted the attention of commercial and theatrical agents in Hollywood. She soon landed a role opposite George Clooney in Three Kings (1999). This was followed by a supporting lead in the Ron Perlman' movie The Trial of Old Drum (2000). But it was State of Grace (2001) that catapulted her into the forefront of young actresses. She has also had guest-starring roles on JAG (1995), Without a Trace (2002), Boomtown (2002) and Presidio Med (2002) and she recently starred opposite Martin Lawrence in Rebound (2005). At 16 years old, when she was not filming, Alia attended a private school near her home in Rancho Mirage where she was able to continue her studies in English, Physics, Math, Geography and Drama. Her ambition is eventually to attend Yale University studying International Relations. In her free time, Alia enjoys horseback riding, ice-skating and dancing. She is an accomplished pianist and speaks several languages. She splits her time between her home and Rancho Mirage and Los Angeles where she resides with her parents and her two brothers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxOTQ3NjY3MV5BMl5BanBnXkFtZTcwNzY1MzY1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0790057","name":"Alia Shawkat","nicknames":["Allie"],"idIMDB":"nm0790057"},"actorId":"nm0790057","character":"Roz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Allan McLeod","urlProfile":"http://www.imdb.com/name/nm2005930","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MDA2OTIwMl5BMl5BanBnXkFtZTgwMDc1MTc5OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Allan McLeod is an actor and writer, known for Monsters University (2013), You're the Worst (2014) and Life After Beth (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MDA2OTIwMl5BMl5BanBnXkFtZTgwMDc1MTc5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2005930","name":"Allan McLeod","idIMDB":"nm2005930"},"actorId":"nm2005930","character":"Supermarket Stocker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Weitz","urlProfile":"http://www.imdb.com/name/nm0919369","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNDA4NDA4Nl5BMl5BanBnXkFtZTgwMDE5NzM0MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1965","placeOfBirth":" New York City, New York, USA","birthName":"Paul J. Weitz","bio":"Paul Weitz was born on November 19, 1965 in New York City, New York, USA as Paul J. Weitz. He is a director, writer and producer, known for Grandma (2015), About a Boy (2002), and Mozart in the Jungle (2014), for which he won a Golden Globe. He has been married to Patricia Brown since December 15, 2001. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNDA4NDA4Nl5BMl5BanBnXkFtZTgwMDE5NzM0MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0919369","name":"Paul Weitz","idIMDB":"nm0919369"},"actorId":"nm0919369","character":"Mr. Levin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michelle Azar","urlProfile":"http://www.imdb.com/name/nm0044110","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1ODI2MTkxMF5BMl5BanBnXkFtZTgwMjgyNzgyNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Michelle Azar is an actress, singer, and writer, having received awards for her work on stage both in New York and Los Angeles. Her most recent work is as ADA Leigh opposite Viola Davis in the award winning How To Get Away with Murder. Her kids's CD, The Treehouse Gang, is a best seller on I-tunes. She is married to Rabbi Jonathan Aaron and they have two daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1ODI2MTkxMF5BMl5BanBnXkFtZTgwMjgyNzgyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0044110","name":"Michelle Azar","idIMDB":"nm0044110"},"actorId":"nm0044110","character":"Mrs. Levin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim O'Heir","urlProfile":"http://www.imdb.com/name/nm0641389","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk3NTgwODc5Nl5BMl5BanBnXkFtZTcwMjczNTEzNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1962","placeOfBirth":" Chicago, Illinois, USA","bio":"Jim O'Heir was born on February 4, 1962 in Chicago, Illinois, USA. He is an actor, known for Parks and Recreation (2009), Seeking a Friend for the End of the World (2012) and Accepted (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk3NTgwODc5Nl5BMl5BanBnXkFtZTcwMjczNTEzNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641389","name":"Jim O'Heir","idIMDB":"nm0641389"},"actorId":"nm0641389","character":"Chip the Mailman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2581244","urlIMDB":"http://www.imdb.com/title/tt2581244","business":{"budget":{"money":"$2,400,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 29 min (89 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arri Alexa"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.6","metascore":"50","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[{"award":"BloodGuts UK Horror Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated BloodGuts UK Horror Award","categories":[{"category":"Best Supporting Actor/Actress","names":[{"name":"Anna Kendrick","id":"nm0447695","role":null}]},{"category":"Best Supporting Actor/Actress","names":[{"name":"John C. Reilly","id":"nm0000604","role":null}]}]}]},{"award":"Edinburgh International Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Audience Award","categories":[{"category":"","names":[{"name":"Jeff Baena","id":"nm1337885","role":null}]}]}]},{"award":"Fangoria Chainsaw Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Chainsaw Award","categories":[{"category":"Best Screenplay","names":[{"name":"Jeff Baena","id":"nm1337885","role":null}]}]}]},{"award":"Rondo Hatton Classic Horror Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Rondo Statuette","categories":[{"category":"Best Independent Film","names":[{"name":"Jeff Baena","id":"nm1337885","role":null}]}]}]},{"award":"Sundance Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Grand Jury Prize","categories":[{"category":"Dramatic","names":[{"name":"Jeff Baena","id":"nm1337885","role":null}]}]}]}],"votes":"14,951","type":"Movie","companyCreditsSimple":[{"idCompany":"co0419092","name":"Abbolita Productions"},{"idCompany":"co0020958","name":"American Zoetrope"},{"idCompany":"co0496310","name":"Destro Films"}],"keywords":{"keywords":["snake bite","undead","death","funeral","girlfriend","boyfriend","zombie","black comedy","brother","confusion","danger","destruction","chaos","out of control","loss of control","zombie violence","back from the dead","zombie attack","couple","shot in the head","house","attic","loss of loved one","living dead","talking while driving","car driving","car","shooting","gun","gore","blood","violence","scarf","gravestone","tombstone","grave","tomb","graveyard","cemetery","desire","attraction","affection","kiss","sex","man with glasses","caustic humor","dark humor","boyfriend girlfriend relationship","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:47:22"}}