{"data":{"movies":[{"title":"Midlife","originalTitle":"","year":"2015","releaseDate":"20150508","directors":[{"name":"Greg Travis","id":"nm0871393"}],"writers":[{"name":"Greg Travis","id":"nm0871393"}],"runtime":"103 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MDY2NjM3Ml5BMl5BanBnXkFtZTcwNjMxOTg3OQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Romance"],"plot":"The story takes place in Los Angeles and New York City. It explores the life of David Stanton as he hits the backside of middle age and is unsure of what he wants to do and how he wants to spend the rest of his life. David works as a business consultant but has lost his enthusiasm for the job. On a business trip to New York City he runs into his ex-wife Vicki and rekindles his attraction to her. Things become complicated when David visits Vicki's loft only to find that she is still living with her ex-husband. After a long night of knockdown, drag-out, drunken drama David and Vicki leave the loft and find a hotel room where they eventually are able to reconnect. David returns to Los Angeles and has trouble dealing with his new friend, his boss, and his daughter who lives with his sister Elaine. He also has another ex-wife, Melody, living in a rehabilitation house who he visits with his daughter. David is trying to keep his life in balance while doing a high-wire act trying to please ...","simplePlot":"An alcoholic salesman finds himself at the crossroads of his life.","actors":[{"actorName":"Greg Travis","urlProfile":"http://www.imdb.com/name/nm0871393","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2ODY5ODgzNl5BMl5BanBnXkFtZTcwODI2MTgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1958","placeOfBirth":" Dallas, Texas, USA","birthName":"Gregory Lloyd Travis","height":"6' (1.83 m)","bio":"A native of Dallas, Texas, Greg has been a natural actor and award winning- stage performer since the age of twelve. During his thirty year career with well over 70 professional credits, Greg has worked with such A-list directors as: Zack Snyder, David Lynch, Paul Verhoeven, Bob Rafelson & Milos Forman. Greg's 2009 films include featured roles as the beleaguered \"Deputy Neale\" in Rob Zombie's Halloween II (2009), and a dead-on performance as Andy Warhol in Zack Snyder's spring blockbuster, Watchmen (2009). His recent starring roles include Jeff Broadstreet's Night of the Living Dead 3D (2006), and Sex and Death 101 (2007), alongside Simon Baker. His upcoming films, in 2010, include co-starring roles in The Trouble with Cali (2012), directed by Paul Sorvino as well as Satin (2011) with Melissa Joan Hart and Robert Guillaume. Greg is often recognized for his co-starring roles in Showgirls (1995) and Starship Troopers (1997). A versatile performer, Greg has also starred in a long list of television shows, such as CSI: Miami (2002), Cold Case (2003), Strong Medicine (2000), JAG (1995) and American Gothic (1995). As a stand-up comedian, Greg enjoys world-wide fame for his character, \"David Sleaze, the Punk Magician\". He can be seen on Rodney Dangerfield's \"HBO Special\". Greg appeared over twenty times on An Evening at the Improv (1982), Saturday Night Live (1975), The Tonight Show Starring Johnny Carson (1962) and many others. Greg has headlined at most of the top comedy clubs in the country and has been the opening act for such entertainment icons as: Cher, Tom Jones and Dolly Parton. His comedic abilities have been described as \"absolutely inspired and truly magical\" by Duncan Strauss, LA Times. Possessing a talent for both comedy and drama, he has the chameleon-like ability to play a wide range of characters, from tough cops to outrageous criminals, turning on a dime to play a sensitive flower salesman or comedic clown. He can change his voice and looks so profoundly one might not always recognize him; yet, he is as unforgettable as the characters he portrays. \"Travis produces his series of characters and situations at a rapid fire pace and switches from one character to another with astonishing speed. It's hard to believe only 1 person is on stage\". Teresa Simons, Dallas Times Herald. As a filmmaker, Greg has written and directed over twenty-five inventive independent short films and three feature-length films. Remaining loyal to his theatrical beginnings, Greg also produced and starred in a stage production entitled \"America the Bizarre\", where he played seven different characters in full make-up and costume, ending with a spot-on impression of comedy legend, Richard Buckley (aka Lord Buckley). Gene Stout, Seattle Post Intelligence wrote, \"Greg Travis is a master of ethnic & regional accents, from the stuffy English chap to the gnarly California surfer dude\". Greg also received great reviews for his portrayal of Andy Warhol in the stage play, \"Girl of the Year\". With thirty years experience as an actor, comedian, and filmmaker, Greg Travis brings a 360 degree wide-ranging approach to every project he undertakes. His unique blend of talents makes him a lucrative contribution to any production.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2ODY5ODgzNl5BMl5BanBnXkFtZTcwODI2MTgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0871393","name":"Greg Travis","idIMDB":"nm0871393"},"actorId":"nm0871393","character":"David Stanton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leilani Sarelle","urlProfile":"http://www.imdb.com/name/nm0765048","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwOTYzNDcxOV5BMl5BanBnXkFtZTcwMzEzNTQwNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1966","placeOfBirth":" Los Angeles County, California, USA","birthName":"Leilani Sarelle Figalan","height":"5' 6½\" (1.69 m)","bio":"Leilani Sarelle was born on September 28, 1966 in Los Angeles County, California, USA as Leilani Sarelle Figalan. She is an actress, known for Basic Instinct (1992), Barbarians at the Gate (1993) and Days of Thunder (1990). She was previously married to Miguel Ferrer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwOTYzNDcxOV5BMl5BanBnXkFtZTcwMzEzNTQwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0765048","name":"Leilani Sarelle","idIMDB":"nm0765048"},"actorId":"nm0765048","character":"Victoria Brooks","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Billy Wirth","urlProfile":"http://www.imdb.com/name/nm0936198","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NTQxMTgxM15BMl5BanBnXkFtZTcwMTYzNTIxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 June 1962","placeOfBirth":" New York City, New York, USA","birthName":"William E. Wirth","height":"6' (1.83 m)","bio":"Wirth attended Collegiate Prep School in Manhattan and Brown University in Providence, Rhode Island. Discovered by photographer Bruce Weber while at Brown University, he started modeling in New York City in the mid 80s for such magazines as Seventeen, GQ, Interview, and teen magazines. While at Brown he did his first Diet Pepsi Commercial before moving on to television and movies. His first television show was The Equalizer and moved to LA to start an acting career. His first movie was Seven Minutes In Heaven. Fifteen years later he is fine tuning his craft and has moved on to being behind the camera. Besides acting, he is also serious about writing,directing,and his artwork is showing in many California galleries. Having completed a Short Film, Kismet, in 1999, he moved on to his first full length Independent film, MacArthur Park, for which he was the writer, director and producer. The film was screened at the Sundance Film Festival 2001 (Grand Prize nominee), Taos Talking Picture Festival (Land Grant nominee), and Seattle International Film Festival 2001 as part of the Black Experience in Films. In the early 1990s Billy fronted a rock band in LA called Dust N'Bones. He works off and on with a band called \"The Cronies\" and they are still in the working stage of a new acoustic CD with music written by Wirth and Steven Costentino. Billy seems to have found his calling behind the scenes of movie making and at the present time is working on a documentary that combines the plight of the homeless, one of Billy's long time interests, and behind the making of MacArthur Park. He changed management in 2007 by going with John Crosby Management of LA and will be working with manager looking for acting and directing projects. He has also opened his own online Art Gallery and completed a new film The Drone Virus, plus a feature for director Andrew Wagner called The Talent Given Us.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NTQxMTgxM15BMl5BanBnXkFtZTcwMTYzNTIxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0936198","name":"Billy Wirth","idIMDB":"nm0936198"},"actorId":"nm0936198","character":"Brian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Debra Wilson","urlProfile":"http://www.imdb.com/name/nm0933281","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMDY1NzI3N15BMl5BanBnXkFtZTcwMDY4NTUxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1962","placeOfBirth":" South Ozone Park, Queens, New York City, New York, USA","birthName":"Debra Renee Wilson","height":"5' 6½\" (1.69 m)","bio":"Debra Wilson was born on April 26, 1962 in South Ozone Park, Queens, New York City, New York, USA as Debra Renee Wilson. She is an actress and writer, known for MADtv (1995), Avatar (2009) and Over the Hedge (2006). She has been married to Cliff Skelton since April 8, 2006.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMDY1NzI3N15BMl5BanBnXkFtZTcwMDY4NTUxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0933281","name":"Debra Wilson","idIMDB":"nm0933281"},"actorId":"nm0933281","character":"Diane Freeland","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amanda Sorvino","urlProfile":"http://www.imdb.com/name/nm2079539","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMTIyNjE3MF5BMl5BanBnXkFtZTgwOTkxODMwNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1971","placeOfBirth":"","bio":"Amanda Sorvino was born in 1971. She is an actress and writer, known for The Trouble with Cali (2012), Midlife (2015) and Celebrity Family Feud (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMTIyNjE3MF5BMl5BanBnXkFtZTgwOTkxODMwNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2079539","name":"Amanda Sorvino","idIMDB":"nm2079539"},"actorId":"nm2079539","character":"Melody","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nancy Ma","urlProfile":"http://www.imdb.com/name/nm5068776","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjcyNDg3MjIzM15BMl5BanBnXkFtZTgwODY3ODQ2NzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Nancy Ma is an actress and writer, known for Words Apart (2013), Made in China (2014) and Tabloid (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjcyNDg3MjIzM15BMl5BanBnXkFtZTgwODY3ODQ2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5068776","name":"Nancy Ma","idIMDB":"nm5068776"},"actorId":"nm5068776","character":"Mae Ling","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Laci Kay","urlProfile":"http://www.imdb.com/name/nm3285044","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWRjOTEyMzYtMzQxNC00NTIzLWFjOWMtZjE3M2E2Mzg5OTk5L2ltYWdlXkEyXkFqcGdeQXVyMjA1NTk2ODU@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1998","placeOfBirth":" Tyler, Texas, USA","height":"5' 2\" (1.57 m)","bio":"Laci was born in Tyler, TX where her two sisters, (Meagan and Heather) and one brother (Jake) were also born. She is the baby of the family. She lived in Whitehouse, TX with them while she attended Stepping Stone preschool in Tyler, TX for 2 years and then she attended Kindergarten and 1st grade at Cain Elementary school in Whitehouse, TX. While in Texas, she loved cheer-leading and did this on a competitive team called the \"Tyler Twisters\". Her coach was Miss Kim and Mr. Derrick, who she just loved. She also sang and performed at her church a lot, with Pastor Ray at Tyler Metro Church. One day, an opportunity came up for her dad to take a job transfer to Goleta, CA with his company, \"Cox Communications\". Since her sisters and brother were almost out of high school, they chose to stay back in Texas; the sisters with their dad and her brother with his mom, you see we are a blended family and Laci Kay was the glue to keep us all attached, since she was part of everyone. So her mom and dad and her moved to Ojai, CA and Laci Kay attended Mira Monte Elementary for the end of the 1st grade and all of the 2nd grade. The acting bug hit as she performed in her first play in the 1st grade called \"Rumpus in the Rainforest\". She also attended Santa Clarita School of Performing Arts and met her favorite agent, Jeremy Apody from Abrams Artists, who she still has to this day, commercially. Her first job with him was playing young Christina Aguilera in her video, \"Hurt\". After this happened, she got very busy doing what she loves to do; perform! So, her parents decided to move to Ventura, CA where we still live to this day, so that dad's commute to work would not be any longer and mom's commute taking Laci into LA would be shorter. It seemed like a good choice as mom works for Macy Homes there, anyway. So, Laci attended Portola Elementary School in Ventura, CA for the 3rd thru 5th grade and attended Anacapa Middle School for the 6th grade. She also is attending there, now, for the 7th grade. She has performed in the local \"Elite\", \"Rubicon\" and \"Thousand Oaks Performing Arts\" Theaters. She has been in the G.A.T.E. (Gifted and Talented Education) program since 3rd grade. She was chosen to speak at her 5th grade graduation and wrote an inspiring speech to her class. She also attended Bible Fellowship Church in Ventura and participated in the 2 plays for Kids Choir they have every year. She loves helping out with the toddlers once a month and also the times they went to visit people at the Rescue Mission and also the Nursing Home to sing for them. Currently, she attends City Church in Ventura. When Laci is not shooting commercials, movies or videos or acting or singing, she still loves riding her bike, her electric scooter and razor scooter, flipping on her trampoline and, most recently, she is enjoying perfecting her skills on her new skate board! She also loves swimming and going to the beach and, of course, like all kids her age; texting and talking to her friends, watching Disney and Nickelodeon on TV and hanging out with all the family.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWRjOTEyMzYtMzQxNC00NTIzLWFjOWMtZjE3M2E2Mzg5OTk5L2ltYWdlXkEyXkFqcGdeQXVyMjA1NTk2ODU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3285044","name":"Laci Kay","nicknames":["Snookie"],"idIMDB":"nm3285044"},"actorId":"nm3285044","character":"Genie Stanton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sarah Alami","urlProfile":"http://www.imdb.com/name/nm4016192","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MzExOTk1MF5BMl5BanBnXkFtZTgwODkxNjE0NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 3\" (1.6 m)","bio":"Sarah Alami is a professional actress and model, Born in Chicago, Illinois. Her unique beauty can be attributed to the combination of her Arabic and Irish heritage. Sarah is the face of Olay Cosmetics and has been featured in over a hundred magazines and commercials nationwide. She was first thrown into the spotlight with her role in VH1's Scream Queens season 2. In 2012 she began working with Sony to play \"Lysandra\" The wife of Kratos in God Of War. She also is in the hit webseries \"Playdate\" directed by Melanie Mayron. After studying drama and theatre in Wilmette, Illinois, Sarah developed her love for acting at a very young age. Since then, Sarah has trained and showcases her talent on Chicago's Second City Stage and continues to do improv shows with her ensemble. She has also starred in Europe's hit series \"entrapment\" She recently has been featured in Ulta cosmetics,FHM,GQ, and Maxim.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MzExOTk1MF5BMl5BanBnXkFtZTgwODkxNjE0NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4016192","name":"Sarah Alami","idIMDB":"nm4016192"},"actorId":"nm4016192","character":"Sarah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lee Chen","urlProfile":"http://www.imdb.com/name/nm2011738","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyMjM3ODIzM15BMl5BanBnXkFtZTgwMDI0NjAwMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 2\" (1.57 m)","bio":"Lee Chen was born as Li Hui in Hohhot, Inner Mongolia of China. She toured with Chairman Mao Zedong's Communist Propaganda Performance Troupe in Inner Mongolia region through out her elementary school years. Then she got her BA in English Language and was one of the founding year graduate students in Chinese and American Studies Center of Johns-Hopkins University and Nanjing Unviersity. Later she came to the U.S.to earn a MA in Education and a MFA in Theatre. She studied acting with Jeremy Piven's parents Byrne and Joyce Piven at the Piven Workshop Theatre. She had been in many theatre and dance productions in Chicago, Honoulu and Los Angeles. She wrote and performed her original one woman show \"Life Flies\" and toured it in Honolulu and Los Angeles area. She left acting for nine years (2001-2010) to raise her two sons and teaching English to new immigrants. She came back to act in film/TV in 2011, by now in 2016, she has guest starred and co-starred in HBO's Veep, Disney's Girl Meets World, CBS's NCIS: Los Angeles and TNT's \"Southland\" among others. At the same time, she has appeared as lead and supporting characters in about 40 independent features and short films. One short film took her to Cannes International Film Festival in 2015 and another won her a Best Supporting Actress in a film festival. Because of her bilingual ability (Chinese Mandarin), she has played all kinds of characters but branded out naturally as a Chinese Mom both in drama and comedy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyMjM3ODIzM15BMl5BanBnXkFtZTgwMDI0NjAwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2011738","name":"Lee Chen","idIMDB":"nm2011738"},"actorId":"nm2011738","character":"Mother Ling","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jessica Courtemanche","urlProfile":"http://www.imdb.com/name/nm1863443","urlPhoto":"","biography":{"dateOfBirth":"4 April 1985","placeOfBirth":" Palma, Majorca, Spain","height":"5' 6½\" (1.69 m)","bio":"Jessica Courtemanche was born on April 4, 1985 in Palma, Majorca, Spain. She is an actress and producer, known for Myst IV: Revelation (2004), Midlife (2015) and Boots (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1863443","name":"Jessica Courtemanche","idIMDB":"nm1863443"},"actorId":"nm1863443","character":"Diane's Assistant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Francesca Fanti","urlProfile":"http://www.imdb.com/name/nm0266908","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MTAyOTYwNF5BMl5BanBnXkFtZTgwNjEzMjY1ODE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Born and raised in Italy, Francesca has been acting in all media between Europe and the States where she now resides. Francesca also presented the work of Dario Fo (Nobel Prize winner for Literature) and Franca Rame to American audiences with the bold one woman comedy show \"Orgasmo Adulto Escapes From the Zoo,\" for which she won the ADA Artistic Director Achievement Award for Best Actress in a Comedy (Los Angeles) and The Bay Area Critics Award for Best Solo Performance (San Francisco). She also received amazing recognition from the press in Los Angeles, San Francisco and Chicago. She has worked with unforgettable character actor Vincent Schiavelli presenting the show \"Cc'era 'Na Vota\" in Sicilian dialect (not her own) to audiences in Sicily. Milestone Italian Writer Dacia Maraini saw Francesca's performance of Maraini's one woman show \"Love Letter\" and invited her to present it during special events and festivals in Italy. Francesca also recently presented Maraini's famous play from the '70s \"Dialogue Between a Prostitute and Her Client\" in Pasadena, for which she received outstanding reviews. She was invited to perform at the Marsh Theater in San Francisco for an evening of \"Best Hit Shows\" which also got rave reviews. Francesca has appeared in many national commercials working with famous talents like Herb Ritts, Elizabeth Taylor and Bob Richardson. She studied with Dominic De Fazio, Susan Perez from the Actor's Studio and the legendary Jeff Corey. She can currently be seen as one of the leads in Bryan Singer's critically acclaimed digital web series \"H+\" and did voice overs for \"Madagascar 3: Europe's Most Wanted\". She also has very proudly worked with Oscar winner Daniel Day Lewis on the film \"Nine\" for director Rob Marshall.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MTAyOTYwNF5BMl5BanBnXkFtZTgwNjEzMjY1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0266908","name":"Francesca Fanti","idIMDB":"nm0266908"},"actorId":"nm0266908","character":"Julietta","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Michael Ferrari","urlProfile":"http://www.imdb.com/name/nm1940442","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NDU3NzY3Ml5BMl5BanBnXkFtZTcwNDc5NTEzNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"John Michael Ferrari is known for his work on Actors Entertainment (2009), Actor's Day in LA (2009) and Actors Reporter Interviews (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NDU3NzY3Ml5BMl5BanBnXkFtZTcwNDc5NTEzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1940442","name":"John Michael Ferrari","idIMDB":"nm1940442"},"actorId":"nm1940442","character":"Jeff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary E. Fry","urlProfile":"http://www.imdb.com/name/nm2926501","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5OTY5NjkyMTBeQTJeQWpwZ15BbWU4MDg4MzY2Mzkx._V1_UY44_CR9,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1959","placeOfBirth":" Las Vegas, Nevada, USA","height":"5' 8\" (1.73 m)","bio":"Mary Fry is known for her creativity, resourcefulness and her ability to connect the right person to the right opportunity. She has served as a Producer, Writer, Casting Director, and Art Director for various productions. You can also see her performing in movie and TV roles in, both, Spanish and English. She has translated/adapted scripts from Spanish to English for production companies in Mexico and South America. Before entering the entertainment industry, she held leadership positions with two top Fortune 500 companies, specializing in distribution, logistics and supply chain management. Earlier in her career, Mary taught English as a second language (ESL) and Spanish in the Washington, DC metropolitan area. She opened her own ESL program and created her own unique curriculum that was later picked up and funded by the U.S Immigration and Naturalization Service as part of their Amnesty program. Mary also developed the PAL (Partners Acquiring Languages) Program, a dual language immersion program, which was implemented in select Washington, DC area school systems. Mary has sailed from Newport, Rhode Island to the Virgin Islands, and from Los Angeles to Catalina Island. She enjoys swimming, sailing, hiking and most outdoor sports. She holds a BA in Business Management.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5OTY5NjkyMTBeQTJeQWpwZ15BbWU4MDg4MzY2Mzkx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2926501","name":"Mary E. Fry","idIMDB":"nm2926501"},"actorId":"nm2926501","character":"HR Rep","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pepper Jay","urlProfile":"http://www.imdb.com/name/nm1941244","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0ODg2NjM1MV5BMl5BanBnXkFtZTgwOTcyMTg4MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Pepper Jay began her performance career at age 5. When she wasn't appearing in television sitcoms, such as \"The Real McCoys,\" she was performing on stage in school, local parks, and community theater. From ages of 5 to 15, Pepper also tap danced, played the accordion, and performed skits for charity events and fund-raisers. After graduating from San Diego State University, Pepper Jay obtained a life time teaching credential from the State of California. Pepper taught several subjects for the Los Angeles Unified School District including performance, drama, dance, health education, and physical education, to name a few.. During the 1970's, she taught at Hollywood High School, John Muir Junior High School, and Crenshaw High School, in Los Angeles, California, where Pepper was also in charge of coordinating and producing shows by the 100+ member \"drill team.\" Although Pepper Jay completed her pubic teaching career in 1983, she continues to this day her private teaching and coaching, specializing in performance skills for actors, singers, lawyers, teachers, and public speakers. Some of her singing performance students include John Michael Ferrari, Montana Tucker, Nikki Nova, Erin Gavin, and Allison Iraheta. Peppper Jay is the author of \"Dynamic Song Performance, The Singer's Bible.\" Pepper Jay also continues her public speaking engagements; sharing topics such as \"Audience Psychology\" and \"Listen and Be Heard\" at film festivals, corporate events, conventions, schools, etc. In 1990, Pepper Jay formalized the entertainment company, Pepper Jay Productions. And, in 1993, created the Working Actors Group, which for a decade in Hollywood, California offered free on-camera and cold reading workshops to selected union actors. Today, Pepper Jay is found on both sides of the camera. She is the publisher and a producer and director for the Actors Reporter and for Pepper Jay Production clients, she continues to privately coach performance skills. Pepper Jay has returned to her acting roots and enjoys the world of the working actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0ODg2NjM1MV5BMl5BanBnXkFtZTgwOTcyMTg4MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1941244","name":"Pepper Jay","idIMDB":"nm1941244"},"actorId":"nm1941244","character":"Emily Green","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Lanza","urlProfile":"http://www.imdb.com/name/nm1615602","urlPhoto":"","biography":{"bio":"Robert Lanza is an actor, known for Telling Nicholas (2002), Midlife (2015) and Beyond Invention (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1615602","name":"Robert Lanza","idIMDB":"nm1615602"},"actorId":"nm1615602","character":"Bar Parton","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2629852","urlIMDB":"http://www.imdb.com/title/tt2629852","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"17","month":"01","year":"2015","remarks":null},"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 43 min (103 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"8.3","filmingLocations":[{"location":"Los Angeles, California, USA"}],"awards":[{"award":"Action on Film International Film Festival, USA 2014","titlesAwards":[{"titleAwardOutcome":"2nd place Action on Film Award","categories":[{"category":"Best Supporting Actress - Feature","names":[{"name":"Debra Wilson","id":"nm0933281","role":null}]},{"category":"Best Picture","names":[{"name":"Saravut Frank Sopapunta","id":"nm2880096","role":"cinematographer"}]},{"category":"Best Drama Feature","names":[{"name":"Greg Travis","id":"nm0871393","role":null}]}]},{"titleAwardOutcome":"Nominated AOF/WAB Award","categories":[{"category":"Best Actor in a Leading Role","names":[{"name":"Greg Travis","id":"nm0871393","role":"actor"}]}]},{"titleAwardOutcome":"Nominated Action on Film Award","categories":[{"category":"Best Supporting Actress - Feature","names":[{"name":"Debra Wilson","id":"nm0933281","role":null}]},{"category":"Best Drama Feature","names":[{"name":"Greg Travis","id":"nm0871393","role":"director"}]},{"category":"Best Dialogue - Feature","names":[{"name":"Greg Travis","id":"nm0871393","role":null}]}]}]},{"award":"Young Artist Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in a DVD Film - Young Actress","names":[{"name":"Laci Kay","id":"nm3285044","role":null},{"name":"G.T. Productions","id":null,"role":"Production Company"}]}]}]},{"award":"Young Entertainer Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Young Entertainer Award","categories":[{"category":"Best Performance in an Independent or Film Festival -Feature Film (15-21)","names":[{"name":"Laci Kay","id":"nm3285044","role":"actress"},{"name":"G.T. Productions","id":null,"role":"production company"}]}]}]}],"votes":"31","type":"Movie","companyCreditsSimple":[]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:28:41"}}