{"data":{"movies":[{"title":"Love Is Strange","originalTitle":"","year":"2014","releaseDate":"20141112","directors":[{"name":"Ira Sachs","id":"nm0755158"}],"writers":[{"name":"Ira Sachs","id":"nm0755158"},{"name":"Mauricio Zacharias","id":"nm0951592"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MTkxOTI1N15BMl5BanBnXkFtZTgwNzAwNDA4MTE@._V1.jpg","countries":["USA","Greece","Brazil"],"languages":["English","Russian"],"genres":["Drama","Romance"],"plot":"After nearly four decades together, Ben (John Lithgow) and George (Alfred Molina) finally tie the knot in an idyllic wedding ceremony in lower Manhattan. But when George loses his job soon after, the couple must sell their apartment and - victims of the relentless New York City real estate market - temporarily live apart until they can find an affordable new home. While George moves in with two cops (Cheyenne Jackson and Manny Perez) who live down stairs, Ben lands in Brooklyn with his nephew (Darren Burrows), his wife (Marisa Tomei), and their temperamental teenage son (Charlie Tahan), with whom Ben shares a bunk bed. While struggling with the pain of separation, Ben and George are further challenged by the intergenerational tensions and capricious family dynamics of their new living arrangements.","simplePlot":"After Ben and George get married, George is fired from his teaching post, forcing them to stay with friends separately while they sell their place and look for cheaper housing -- a situation that weighs heavily on all involved.","actors":[{"actorName":"Alfred Molina","urlProfile":"http://www.imdb.com/name/nm0000547","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNTgzNzgxNzNeQTJeQWpwZ15BbWU3MDQ5NzU1NjM@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1953","placeOfBirth":" London, England, UK","height":"6' 2½\" (1.89 m)","bio":"Alfred Molina was born in 1953 in London, England. His mother, Giovanna (Bonelli), was an Italian-born cook and cleaner, and his father, Esteban Molina, was a Spanish-born waiter and chauffeur. He studied at the Guildhall School of Music and Drama, London. His stage work includes two major Royal National Theatre productions, Tennessee Williams' \"The Night of the Iguana\" (as Shannon) and David Mamet's \"Speed the Plow\" (as Fox), plus a splendid performance in Yasmina Reza's \"Art\" (his Broadway debut), for which he received a Tony Award nomination in 1998. He made his film debut in Raiders of the Lost Ark (1981) and got a good part in Letter to Brezhnev (1985) (as a Soviet sailor who spends a night in Liverpool), but his movie breakthrough came two years later when he played--superbly--Kenneth Halliwell, the tragic lover of playwright Joe Orton, in Stephen Frears' Prick Up Your Ears (1987). He was also outstanding in Enchanted April (1991), The Perez Family (1995) (as a Cuban immigrant), Anna Karenina (1997) (as Levin) and Chocolat (2000) (as the narrow-minded mayor of a small French town circa 1950s, who tries to shut down a chocolate shop).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNTgzNzgxNzNeQTJeQWpwZ15BbWU3MDQ5NzU1NjM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000547","name":"Alfred Molina","nicknames":["Fred"],"idIMDB":"nm0000547"},"actorId":"nm0000547","character":"George Garea","urlCharacter":"http://www.imdb.com/character/ch0469833","main":true},{"actorName":"John Lithgow","urlProfile":"http://www.imdb.com/name/nm0001475","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzUyNDkzNF5BMl5BanBnXkFtZTcwNTMwNTU5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 October 1945","placeOfBirth":" Rochester, New York, USA","birthName":"John Arthur Lithgow","height":"6' 4\" (1.93 m)","bio":"If \"born to the theater\" has meaning in determining a person's life path, then John Lithgow is a prime example of this truth. He was born in Rochester, New York, to Sarah Jane (Price), an actress, and Arthur Washington Lithgow III, who was both a theatrical producer and director. John's father was born in Puerto Plata, Dominican Republic, where the Anglo-American Lithgow family had lived for several generations. John moved frequently as a child, while his father founded and managed local and college theaters and Shakespeare festivals throughout the Midwest of the United States. Not until he was 16, and his father became head of the McCarter Theater in Princeton New Jersey, did the family settle down. But for John, the theater was still not a career. He won a scholarship to Harvard University, where he finally caught the acting bug (as well as found a wife). Harvard was followed by a Fulbright scholarship to study at the London Academy of Music and Dramatic Art. Returning from London, his rigorous dramatic training stood him in good stead, and a distinguished career on Broadway gave him one Tony Award for \"The Changing Room\", a second nomination in 1985 for \"Requiem For a Heavyweight\", and a third in 1988 for \"M. Butterfly\". But with critical acclaim came personal confusion, and in the mid 1970s, he and his wife divorced. He entered therapy, and in 1982, his life started in a new direction, the movies - he received an Academy Award nomination for his portrayal of Roberta Muldoon in The World According to Garp (1982). A second Oscar nomination followed for Terms of Endearment (1983), and he met a UCLA economics professor who became his second wife. As the decade of the 1990s came around, he found that he was spending too much time on location, and another career move brought him to television in the hugely successful series 3rd Rock from the Sun (1996). This production also played a role in bringing him back together with the son from his first marriage, Ian Lithgow, who has a regular role in the series as a dimwitted student.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzUyNDkzNF5BMl5BanBnXkFtZTcwNTMwNTU5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001475","name":"John Lithgow","nicknames":["Jiggles"],"idIMDB":"nm0001475"},"actorId":"nm0001475","character":"Ben Hull","urlCharacter":"http://www.imdb.com/character/ch0468292","main":true},{"actorName":"Darren E. Burrows","urlProfile":"http://www.imdb.com/name/nm0123261","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NDkyMDA1N15BMl5BanBnXkFtZTcwNjgyNzc1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1966","placeOfBirth":" Winfield, Kansas, USA","birthName":"Darren Eugene Burrows","height":"6' 1\" (1.85 m)","bio":"Darren E. Burrows was born on September 12, 1966 in Winfield, Kansas, USA as Darren Eugene Burrows. He is an actor, known for Northern Exposure (1990), Love Is Strange (2014) and Amistad (1997). He has been married to Melinda Delgado since June 19, 1993. They have four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NDkyMDA1N15BMl5BanBnXkFtZTcwNjgyNzc1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0123261","name":"Darren E. Burrows","idIMDB":"nm0123261"},"actorId":"nm0123261","character":"Elliot Hull","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charlie Tahan","urlProfile":"http://www.imdb.com/name/nm2253071","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxODQzMjIwMV5BMl5BanBnXkFtZTgwMTYxNTE2MDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Charlie Tahan is an actor, known for I Am Legend (2007), Charlie St. Cloud (2010) and Frankenweenie (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxODQzMjIwMV5BMl5BanBnXkFtZTgwMTYxNTE2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2253071","name":"Charlie Tahan","idIMDB":"nm2253071"},"actorId":"nm2253071","character":"Joey Hull","urlCharacter":"http://www.imdb.com/character/ch0469835","main":true},{"actorName":"Cheyenne Jackson","urlProfile":"http://www.imdb.com/name/nm2091145","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzE1MzIwNTg2NF5BMl5BanBnXkFtZTgwNjAzNDExMDI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 July 1975","placeOfBirth":" Newport, Washington, USA","birthName":"Cheyenne David Jackson","height":"6' 4\" (1.93 m)","bio":"Cheyenne Jackson was born on July 12, 1975 in Newport, Washington, USA as Cheyenne David Jackson. He is an actor, known for American Horror Story (2011), 30 Rock (2006) and Glee (2009). He has been married to Jason Landau since September 13, 2014. They have two children. He was previously married to Monte Lapka.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzE1MzIwNTg2NF5BMl5BanBnXkFtZTgwNjAzNDExMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2091145","name":"Cheyenne Jackson","idIMDB":"nm2091145"},"actorId":"nm2091145","character":"Ted","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Manny Perez","urlProfile":"http://www.imdb.com/name/nm0673563","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3Njc5MjI1NF5BMl5BanBnXkFtZTcwMTM4MDAzMw@@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1969","placeOfBirth":" Baitoa, Santiago, Dominican Republic","bio":"Manny Perez is becoming one of the most recognized Latino Actors in Hollywood. He has embarked into the most pivotal steps in his career. In the past few years he has been cast from leads to co-starring roles in over a dozen films; in major and independent releases. He also won an Alma Award in 2008, for his performance in the film Bella (2006) Manny is one of eleven siblings, born in a small town in the Dominican Republic. At the age of 10, he and his family moved to Providence, Rhode Island. By the time he was done with high school, Manny knew the stage was his natural home. He moved to New York majoring in drama at Marymount Manhattan College. Manny Perez first got the industry's attention when he co-wrote, produced and starred in the critically acclaimed film Washington Heights (2002) an independent film set in his neighborhood. Manny's performance in the film garnered the praise of many film critics; The New York Times stated, \"Mr. Perez has charisma to burn.\" He won the 2002 Best Actor Award at The Milan International Film Festival in Italy for his performance in that film. His recent project La soga (2009) which had its world premiered at The Toronto International Film Festival in September of 2009 to standing ovations, sold-out shows and stellar reviews was produced, written and starred Perez. Variety stated, \"Perez, puts plenty of guts into his script and performance\". It was the first Dominican film EVER to have screened at the prestigious festival. The film was released by 7-57 Releasing and so far has made over 1 million dollars worldwide. Perez continues to write and co-write other scripts for future projects. In February of 2009, Perez co-wrote, co-produced and starred in the film titled, Forged (2010) shot completely in Scranton, PA. MAYA Entertainment will release it. He has worked with such film directors as Sidney Lumet, Arthur Penn, Spike Lee, Leon Ichaso, Mike Newell, Ed Zwick, Takeshi Kitano, Bob Giraldi, Darnell Martin, among others. With all the glitz and glamor of Hollywood, Manny has maintained loyal to his roots in the Latin community, both in the US and the Dominican Republic. He is the classic example of someone who has made the American dream happen. This kind of cavalier attitude is the reason he was honored by El Diario newspaper with the \"EL Award\", as one of the most prominent Latinos in New York. He recently received the Tony Bennett Excellence in Media Award, the Perry Ellis Humanitarian Award, and given the Key to the City from his hometown in Providence, Rhode Island. He was also honored with the Humanitarian Award in his native country of Dominican Republic for all of his charitable work during the devastation of Hurricane Noel. All of his hard working ethics and talent has brought him to such great success, which will continue to take him to greater heights as he continues his career. He has been featured in various magazines, newspapers and entertainment shows. Manny currently resides between Washington Heights, New York City and Los Angeles. Manny is also a member of the LAByrinth Theatre Company in New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3Njc5MjI1NF5BMl5BanBnXkFtZTcwMTM4MDAzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0673563","name":"Manny Perez","idIMDB":"nm0673563"},"actorId":"nm0673563","character":"Roberto","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christina Kirk","urlProfile":"http://www.imdb.com/name/nm0456454","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NjA1ODg0Ml5BMl5BanBnXkFtZTgwNTEwMDM5MTE@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1970","placeOfBirth":" New York City, New York, USA","bio":"Christina Kirk was born on November 10, 1970 in New York City, New York, USA. She is an actress, known for Along Came Polly (2004), Taking Woodstock (2009) and Love Is Strange (2014). She has been married to John Hamburg since September 24, 2005.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NjA1ODg0Ml5BMl5BanBnXkFtZTgwNTEwMDM5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0456454","name":"Christina Kirk","idIMDB":"nm0456454"},"actorId":"nm0456454","character":"Mindy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marisa Tomei","urlProfile":"http://www.imdb.com/name/nm0000673","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMjA3OTc3N15BMl5BanBnXkFtZTcwNTA1MzY1Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1964","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"5' 4½\" (1.64 m)","bio":"Marisa Tomei was born on December 4, 1964, in Brooklyn, New York to mother Patricia \"Addie\" Tomei, an English teacher and father Gary Tomei, a lawyer. Marisa also has a brother, actor Adam Tomei. As a child, Marisa's mother frequently corrected her speech as to eliminate her heavy Brooklyn accent. As a teen, Marisa attended Edward R. Murrow High School and graduated in the class of 1982. She was one year into her college education at Boston University when she dropped out for a co-starring role on the CBS daytime drama As the World Turns (1956). Her role on that show paved the way for her entrance into film: in 1984, she made her film debut with a bit part in The Flamingo Kid (1984). Three years later, Marisa became known for her role as Maggie Lawton, Lisa Bonet's college roommate, on the sitcom A Different World (1987). Her real breakthrough came in 1992, when she co-starred as Joe Pesci's hilariously foul-mouthed, scene-stealing girlfriend in My Cousin Vinny (1992), a performance that won her a Best Supporting Actress Oscar. Later that year, she turned up briefly as a snippy Mabel Normand in director Richard Attenborough's biopic Chaplin (1992), and was soon given her first starring role in Untamed Heart (1993). A subsequent starring role -- and attempted makeover into Audrey Hepburn -- in the romantic comedy Only You (1994) proved only moderately successful. Marisa's other 1994 role as Michael Keaton's hugely pregnant wife in The Paper (1994) was well-received, although the film as a whole was not. Fortunately for Tomei, she was able to rebound the following year with a solid performance as a troubled single mother in Nick Cassavetes' Décroche les étoiles (1996) which earned her a Screen Actors Guild nomination for Best Supporting Actress. She turned in a similarly strong work in Welcome to Sarajevo (1997), and in 1998 did some of her best work in years as the sexually liberated, unhinged cousin of Natasha Lyonne's Vivian Abramowitz in Tamara Jenkins' Slums of Beverly Hills (1998). Marisa co-starred with Mel Gibson in the hugely successful romantic comedy What Women Want (2000) and during the 2002 movie award season, she proved her first Best Supporting Actress Oscar win was no fluke when she received her second nomination in the same category for the critically acclaimed dark drama, In the Bedroom (2001). She also made a guest appearance on the animated TV phenomenon The Simpsons (1989) as Sara Sloane, a movie star who falls in love with Ned Flanders. In 2006, she went on to do 4 episodes for Rescue Me (2004). She played Angie, the ex-wife of Tommy Calvin (Denis Leary)'s brother Johnny (Dean Winters). At age 42, Marisa took on a provocative role in legendary filmmaker Sidney Lumet's melodramatic picture Before the Devil Knows You're Dead (2007), in which she appeared nude in love scenes with costars Ethan Hawke and Philip Seymour Hoffman. Marisa then took on another provocative role as a stripper in the highly acclaimed film The Wrestler (2008) opposite Mickey Rourke. Her great performance earned her many awards from numerous film societies for Best Supporting Actress, a third Academy Award nomination, as well as nominations for a Golden Globe and a BAFTA. Many critics heralded this performance as a standout in her career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMjA3OTc3N15BMl5BanBnXkFtZTcwNTA1MzY1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000673","name":"Marisa Tomei","idIMDB":"nm0000673"},"actorId":"nm0000673","character":"Kate Hull","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tank Burt","urlProfile":"http://www.imdb.com/name/nm5022042","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTc0MDk1OTAyOF5BMl5BanBnXkFtZTgwMzIzNTM2NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Tank Burt is an actress and assistant director, known for Love Is Strange (2014) and First Kiss (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTc0MDk1OTAyOF5BMl5BanBnXkFtZTgwMzIzNTM2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5022042","name":"Tank Burt","idIMDB":"nm5022042"},"actorId":"nm5022042","character":"Doreen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christian Coulson","urlProfile":"http://www.imdb.com/name/nm0183469","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzOTE3NTUwNV5BMl5BanBnXkFtZTgwMTczODk5MDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1978","placeOfBirth":" Manchester, England, UK","birthName":"Christian Peter Coulson","height":"5' 9\" (1.75 m)","bio":"Christian Coulson was born on October 3, 1978 in Manchester, England as Christian Peter Coulson. He is an actor, known for The Hours (2002), Harry Potter and the Chamber of Secrets (2002) and Gayby (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzOTE3NTUwNV5BMl5BanBnXkFtZTgwMTczODk5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0183469","name":"Christian Coulson","idIMDB":"nm0183469"},"actorId":"nm0183469","character":"Ian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Cullum","urlProfile":"http://www.imdb.com/name/nm0191633","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MDk5ODA5MV5BMl5BanBnXkFtZTYwNDI4OTky._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 March 1930","placeOfBirth":" Knoxville, Tennessee, USA","bio":"John Cullum was born on March 2, 1930 in Knoxville, Tennessee, USA. He is an actor, known for Northern Exposure (1990), One Life to Live (1968) and Before We Go (2014). He has been married to Emily Frankel since May 5, 1959. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MDk5ODA5MV5BMl5BanBnXkFtZTYwNDI4OTky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0191633","name":"John Cullum","idIMDB":"nm0191633"},"actorId":"nm0191633","character":"Father Raymond","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harriet Sansom Harris","urlProfile":"http://www.imdb.com/name/nm0364748","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MTU2ODM5NF5BMl5BanBnXkFtZTgwNDMyMTIyODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 January 1955","placeOfBirth":" Fort Worth, Texas, USA","birthName":"Harriet Harris","height":"5' 8\" (1.73 m)","bio":"Born in Texas, Harriet Sansom Harris got involved in acting as a youngster. At seventeen, Harris was accepted at New York's famed Juilliard School. Upon graduation, Harris joined The Acting Company, a repertory group formed by the first alumni of John Houseman's Drama Division of The Juilliard School. She spent three years with the Company before she left to work primarily in regional theater. This led to a successful Broadway and Off-Broadway career. Her life changed after appearing as the sole female in the original cast of \"Jeffrey\", Paul Rudnick's smash Off-Broadway hit about love in the time of AIDS. \"Jeffrey\" led to guest shots on series television, including Frasier (1993), where she created the memorable role of \"Bebe Glazer\", Frasier's cutthroat, neurotic, chain-smoking agent. She also won raves from critics for her role of \"Vivian Buchanan\" on CBS's The 5 Mrs. Buchanans (1994). She now calls New York her home, but frequently travels to California for film and television appearances.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MTU2ODM5NF5BMl5BanBnXkFtZTgwNDMyMTIyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0364748","name":"Harriet Sansom Harris","idIMDB":"nm0364748"},"actorId":"nm0364748","character":"Honey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adriane Lenox","urlProfile":"http://www.imdb.com/name/nm0502180","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMTU3Nzk2Nl5BMl5BanBnXkFtZTcwNDI4MzA1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1956","placeOfBirth":" Memphis, Tennessee, USA","bio":"Adriane Lenox was born on September 11, 1956 in Memphis, Tennessee, USA. She is an actress, known for The Blind Side (2009), Black Snake Moan (2006) and Lee Daniels' The Butler (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMTU3Nzk2Nl5BMl5BanBnXkFtZTcwNDI4MzA1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0502180","name":"Adriane Lenox","idIMDB":"nm0502180"},"actorId":"nm0502180","character":"Principal","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Stuart","urlProfile":"http://www.imdb.com/name/nm0835725","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmQ5ODIxNjgtYzEwNy00YjIzLWJiZTUtYmIzMmJlMWU5MmM4XkEyXkFqcGdeQXVyMTUwNzQ5MTM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1959","placeOfBirth":" Bronx, New York, USA","birthName":"Stuart Ted Greif","bio":"When you think one of the most prolific character actors, who's also an outrageous stand-up comedian, one name comes to mind.... Jason Stuart. Stuart has been making people laugh out loud with his hysterical performances all over the country. He has accomplished what few other out comics have ever achieved: brutal honesty with humor in a world that's not always kind. Not only is Stuart an all-out crowd pleaser, but he transcends the boundaries of race, gender and sexual orientation with his edgy comedic style. Stuart's material about his experiences as a single man living in Hollywood is original, cutting edge and just plain funny. Although his semi-celebrity came via stand-up, Stuart is also well-known for his work as an actor playing gay & straight roles on over forty popular television shows. Stuart has wowed audiences on the TV screen with guest roles in hits such shows as Sleepy Hollow, Real Rob, Entourage, The Closer, Will & Grace, George Lopez, Everybody Hates Chris, House, It's Always Sunny in Philadelphia and Charmed, to name a few. He is best known playing \"Dr. Thomas\", the gay family therapist on My Wife and Kids. As an actor his first love, Jason has a major role in the historic Nat Turner bio pic Birth Of A Nation from filmmaker & star Nate Parker opposite Armie Hammer. Jason has been to Sundance with the hit comedy, Sean Bakers' Tangerine, executive produced by Jay & Mark Duplass. Also the Spirit award nominated drama Love Is Strange from Ira Sacks, starring John Lithgow, Alfred Molina and Marsia Tomei. Next up, hitting the festival circuit with Baby Steps and Hush Up Sweet Charlotte? Stuart has performed at all of the top comedy clubs & comedy festivals and hundreds of gay events & prides, colleges & universities, and even on Broadway. Since Stuart makes such a strong connection with his audience, he is in high demand by corporate programs with his lecture, Coming Out In Hollywood, on being openly gay in the workplace. He made appearances on, One Night Stand-Up, Wisecrack & Comics Unleashed. Stuart released his stand-up comedy CD, Gay Comedy Without A Dress with the new hit mini CD I'm The Daddy And I Have Candy. In addition to that, his stand-up comedy special, Making It To The Middle. As a character actor, filmmakers say his talent is a cross between the depth of Paul Giamatti, the comedy timing of Alan Arkin and the quirkiness of Steve Buscemi. He has worked with heavy hitters George Clooney, Faye Dunaway, Angelina Jolie, Damon Wayans, Drew Carey, George Lopez, David Spade and even Arnold Schwarzenegger. Among the big studio pictures he appeared in, Kindergarten Cop, Lost & Found Vegas Vacation and the post smoking hit Puff, Puff Pass are favorites among TV fans. Stuart has become a major player in the independent film world after being nominated for a Gay International Film Award for best supporting actor in Coffee Date. Featured in the comedy hit A Day Without a Mexican, the cult hit Bearcity 2: The Proposal, Big Gay Love and the HBO award winning drama Gia. Proving that he is more than just an actor and comedian, Stuart also produced and starred in his own totally improvised independent film 10 Attitudes and directed and co stars & wrote & produced the award winning web-series Mentor with Alexandra Paul & Paul Elia. Stuart uses his talents as an openly gay actor and comedian to support the community by performing at countless benefits for issues from AIDS to the homeless. He is the National Co-Chairman of the first ever SAG/AFTRA, LGBT Committee, and also chaired the comedy shows for Lifeworks Mentoring Program for 8 years. He also fosters and mentors youth. His groundbreaking stand up comedy and his versatility as an actor make his career an amazing ride.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmQ5ODIxNjgtYzEwNy00YjIzLWJiZTUtYmIzMmJlMWU5MmM4XkEyXkFqcGdeQXVyMTUwNzQ5MTM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0835725","name":"Jason Stuart","idIMDB":"nm0835725"},"actorId":"nm0835725","character":"Officiant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Bell","urlProfile":"http://www.imdb.com/name/nm6450694","urlPhoto":"","biography":{"bio":"David Bell is an actor, known for Love Is Strange (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6450694","name":"David Bell","idIMDB":"nm6450694"},"actorId":"nm6450694","character":"David","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2639344","urlIMDB":"http://www.imdb.com/title/tt2639344","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"$1,833,139","country":"USA","day":"28","month":"09","year":"2014","remarks":""}],"weekendGross":[{"money":"$180,765","country":"USA","day":"28","month":"09","year":"2014","remarks":"138 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"© Love Is Strange, LLC 2014"},"technical":{"runtime":["1 hr 34 min (94 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":["Digital (Digital Cinema Package DCP)"]},"rating":"6.7","metascore":"82","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"R","awards":[{"award":"AARP Movies for Grownups Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won Movies for Grownups Award","categories":[{"category":"Best Grownup Love Story","names":[{"name":"John Lithgow","id":"nm0001475","role":null},{"name":"Alfred Molina","id":"nm0000547","role":null}]}]}]},{"award":"Dallas-Fort Worth Film Critics Association Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated DFWFCA Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Alfred Molina","id":"nm0000547","role":null}]}]}]},{"award":"Deauville Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Grand Special Prize","categories":[{"category":"","names":[{"name":"Ira Sachs","id":"nm0755158","role":null}]}]}]},{"award":"Film Independent Spirit Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Independent Spirit Award","categories":[{"category":"Best Feature","names":[{"name":"Lucas Joaquin","id":"nm1861210","role":null},{"name":"Lars Knudsen","id":"nm1185381","role":null},{"name":"Ira Sachs","id":"nm0755158","role":null},{"name":"Jayne Baron Sherman","id":"nm3246341","role":null},{"name":"Jay Van Hoy","id":"nm1082606","role":null}]},{"category":"Best Screenplay","names":[{"name":"Ira Sachs","id":"nm0755158","role":null},{"name":"Mauricio Zacharias","id":"nm0951592","role":null}]},{"category":"Best Male Lead","names":[{"name":"John Lithgow","id":"nm0001475","role":null}]},{"category":"Best Supporting Male","names":[{"name":"Alfred Molina","id":"nm0000547","role":null}]}]}]},{"award":"Gay and Lesbian Entertainment Critics Association (GALECA) 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Dorian Award","categories":[{"category":"LGBTQ Film of the Year","names":[]},{"category":"Unsung Film of the Year","names":[]}]}]},{"award":"GLAAD Media Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated GLAAD Media Award","categories":[{"category":"Outstanding Film - Wide Release","names":[]}]}]},{"award":"Gotham Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Audience Award","categories":[{"category":"","names":[{"name":"Ira Sachs","id":"nm0755158","role":null},{"name":"Lucas Joaquin","id":"nm1861210","role":null},{"name":"Jay Van Hoy","id":"nm1082606","role":null},{"name":"Lars Knudsen","id":"nm1185381","role":null},{"name":"Jayne Baron Sherman","id":"nm3246341","role":null}]}]},{"titleAwardOutcome":"Nominated Gotham Independent Film Award","categories":[{"category":"Best Feature","names":[{"name":"Ira Sachs","id":"nm0755158","role":null},{"name":"Lucas Joaquin","id":"nm1861210","role":null},{"name":"Jay Van Hoy","id":"nm1082606","role":null},{"name":"Lars Knudsen","id":"nm1185381","role":null},{"name":"Jayne Baron Sherman","id":"nm3246341","role":null}]}]}]},{"award":"Humanitas Prize 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Humanitas Prize","categories":[{"category":"Sundance Film Category","names":[{"name":"Ira Sachs","id":"nm0755158","role":"writer"},{"name":"Mauricio Zacharias","id":"nm0951592","role":"writer"}]}]}]},{"award":"North Carolina Film Critics Association 2015","titlesAwards":[{"titleAwardOutcome":"Nominated NCFCA Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Alfred Molina","id":"nm0000547","role":null}]}]}]},{"award":"San Sebastián International Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Sebastiane Award","categories":[{"category":"Best Film","names":[{"name":"Ira Sachs","id":"nm0755158","role":null}]}]}]},{"award":"Satellite Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Satellite Award","categories":[{"category":"Best Motion Picture","names":[]},{"category":"Best Screenplay, Original","names":[{"name":"Ira Sachs","id":"nm0755158","role":null},{"name":"Mauricio Zacharias","id":"nm0951592","role":null}]}]}]},{"award":"Village Voice Film Poll 2014","titlesAwards":[{"titleAwardOutcome":"Nominated VVFP Award","categories":[{"category":"Best Screenplay","names":[{"name":"Ira Sachs","id":"nm0755158","role":null},{"name":"Mauricio Zacharias","id":"nm0951592","role":null}]}]}]},{"award":"Women Film Critics Circle Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won WFCC Award","categories":[{"category":"Best Male Images in a Movie","names":[]}]}]}],"votes":"10,233","type":"Movie","companyCreditsSimple":[{"idCompany":"co0226159","name":"Parts and Labor"},{"idCompany":"co0273107","name":"Faliro House Productions"},{"idCompany":"co0215473","name":"Film50"}],"keywords":{"keywords":["older man older man relationship","gay marriage","gay couple","gay love","same sex marriage","new york city","teenage boy","chopin","death of husband","painter","loss of husband","religious hypocrisy","gay uncle","gay elderly","gay kiss","police officer","family relationships","uncle nephew relationship","choir director","fired from the job","homosexuality","homophobia","teacher","gay teacher","gay relationship","long term relationship","gay cop","homosexual","gay","wedding","bunk bed","new york","voice over letter","rent controlled apartment","accident","party","painting","rooftop","british man","apartment hunting","hospital","shoulder injury","russian american","staying with relatives","music teacher","three word title","piano lesson","arm in sling","writer","bechdel test failed","brooklyn new york city","choir","school","catholic school","catholic","claim in title","movement","2010s","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:44:13"}}