{"data":{"movies":[{"title":"Night at the Museum 3","originalTitle":"Night at the Museum: Secret of the Tomb","year":"2014","releaseDate":"20141219","directors":[{"name":"Shawn Levy","id":"nm0506613"}],"writers":[{"name":"David Guion","id":"nm1115862"},{"name":"Michael Handelman","id":"nm1911349"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MzM2ODEyMV5BMl5BanBnXkFtZTgwNTIzODAwMzE@._V1.jpg","countries":["UK","USA"],"languages":["English"],"genres":["Adventure","Comedy","Family","Fantasy"],"plot":"At the Museum of Natural History, there's a new exhibit being unveiled. Larry Daley, who manages the night exhibit where the exhibits come to life because of the Tablet of Ahkmenrah, is in charge of the presentation. But when the exhibits go awry, Larry finds himself in trouble. He learns the Tablet is corroding so he does some research and learns that Cecil, the former museum guard, was at the site when the Tablet was discovered. He tells Larry they were warned if they remove it could mean the end. Larry realizes it means the end of the magic. He talks to Ahkmenrah who says that he doesn't know anything. Only his father the Pharaoh knows the Tablet's secrets. He learns that the Pharaoh was sent to the London museum. So he convinces Dr. McPhee, the museum curator, to help send him to London. He takes Ahkmenrah with him but some of the others tag along, like Teddy Roosevelt, Attila, Octavius, and Jedediah.","simplePlot":"Larry spans the globe, uniting favorite and new characters while embarking on an epic quest to save the magic before it is gone forever.","actors":[{"actorName":"Ben Stiller","urlProfile":"http://www.imdb.com/name/nm0001774","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc4NDc3NDkzMl5BMl5BanBnXkFtZTcwMTAyNTQwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1965","placeOfBirth":" New York City, New York, USA","birthName":"Benjamin Edward Meara Stiller","height":"5' 7\" (1.7 m)","bio":"Benjamin Edward Meara Stiller was born on November 30, 1965, in New York City, New York, to legendary comedians Jerry Stiller and Anne Meara. His father is of Austrian Jewish and Polish Jewish descent, and his mother was of Irish ancestry (she converted to Judaism). It's not surprising that Ben has followed in his family's footsteps: his parents made no real effort to keep their son away from the Hollywood lifestyle and he grew up among the stars, wondering just why his parents were so popular. At a young age, he and his sister Amy Stiller would perform plays at home, wearing Amy's tights to perform Shakespeare. Ben also picked up an interest in being on the other side of the camera and, at age 10, began shooting films on his Super 8 camera. The plots were always simple: someone would pick on the shy, awkward Stiller...and then he would always get his revenge. This desire for revenge on the popular, good-looking people may have motivated his teen-angst opus Reality Bites (1994) later in his career. He both directed and performed in the film, which costarred Winona Ryder and Ethan Hawke. Before he even got his start in Hollywood, Ben put in several consistently solid years in the theater. After dropping out of UCLA, he performed in the Tony Award winner, \"The House of Blue Leaves\". While working on the play, Stiller shot a short spoof of The Color of Money (1986) starring him (in the Tom Cruise role) and his American Playhouse: The House of Blue Leaves (1987) costar John Mahoney (in the Paul Newman role). The short film was so funny that Lorne Michaels purchased it and aired it on Saturday Night Live (1975). This led to Ben spending a year on the show in 1989. Ben made his big screen debut in Steven Spielberg's Empire of the Sun (1987) in 1987. Demonstrating early on the multifaceted tone his career would take, he soon stepped behind the camera to direct Back to Brooklyn for MTV. The network was impressed and gave Stiller his own show, The Ben Stiller Show (1992). He recruited fellow offbeat comedians Janeane Garofalo and Andy Dick and created a bitingly satirical show. MTV ended up passing on it, but it was picked up by Fox. Unfortunately, the show was a ratings miss. Stiller was soon out of work, although he did have the satisfaction of picking up an Emmy for the show after its cancellation. For a while, Ben had to settle for guest appearance work. While he was doing this, he saved up his cash and in the end was able to scrape enough together to make Reality Bites (1994), now a cult classic which is looked upon favorably by the generation it depicted. Ben continued to work steadily for a time, particularly in independent productions where he was more at ease. However, he never quite managed to catch a big break. His first big budget directing job was Jim Carrey's The Cable Guy (1996). Although many critics were impressed, Jim Carrey's fans were not. In 1998, There's Something About Mary (1998) had propelled Ben into the mainstream spotlight. With his wince-inducing turn in the Farrelly brothers' gross-out film, Ben really \"struck a nerve\" with mainstream America. Ben has starred in such hit movies as Keeping the Faith (2000) and Meet the Parents (2000). Ben excels at cerebral comedy, but he knows how to get down and lowbrow when he needs to, making him one of America's most popular performers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc4NDc3NDkzMl5BMl5BanBnXkFtZTcwMTAyNTQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001774","name":"Ben Stiller","idIMDB":"nm0001774"},"actorId":"nm0001774","character":"Larry Daley / Laaa","urlCharacter":"http://www.imdb.com/character/ch0009973","main":true},{"actorName":"Robin Williams","urlProfile":"http://www.imdb.com/name/nm0000245","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYzMjc2Mjg4MF5BMl5BanBnXkFtZTcwODc1OTQwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 July 1951","placeOfBirth":" Chicago, Illinois, USA","birthName":"Robin McLaurin Williams","height":"5' 7\" (1.7 m)","bio":"Robin McLaurin Williams was born on Saturday, July 21st, 1951, in Chicago, Illinois, a great-great-grandson of Mississippi Governor and Senator, Anselm J. McLaurin. His mother, Laurie McLaurin (née Janin), was a former model from Mississippi, and his father, Robert Fitzgerald Williams, was a Ford Motor Company executive from Indiana. Williams had English, German, French, Welsh, Irish, and Scottish ancestry. Robin briefly studied political science before enrolling at Juilliard School to study theatre. After leaving Juilliard, he performed in nightclubs where he was discovered for the role of \"Mork, from Ork\", in an episode of Happy Days (1974). The episode, Happy Days: My Favorite Orkan (1978), led to his famous spin-off weekly TV series, Mork & Mindy (1978). He made his feature starring debut playing the title role in Popeye (1980), directed by Robert Altman. Williams' continuous comedies and wild comic talents involved a great deal of improvisation, following in the footsteps of his idol Jonathan Winters. Williams also proved to be an effective dramatic actor, receiving Academy Award nominations for Best Actor in a Leading Role in Good Morning, Vietnam (1987), Dead Poets Society (1989), and The Fisher King (1991), before winning the Academy Award for Best Actor in a Supporting Role in Good Will Hunting (1997). During the 1990s, Williams became a beloved hero to children the world over for his roles in a string of hit family-oriented films, including Hook (1991), Les aventures de Zak et Crysta dans la forêt de FernGully (1992), Aladdin (1992), Mrs. Doubtfire (1993), Jumanji (1995), Flubber (1997), and Bicentennial Man (1999). He continued entertaining children and families into the 21st century with his work in Robots (2005), Happy Feet (2006), Night at the Museum (2006), Night at the Museum: Battle of the Smithsonian (2009), Happy Feet 2 (2011), and Night at the Museum 3 (2014). Other more adult-oriented films for which Williams received acclaim include The World According to Garp (1982), Moscow on the Hudson (1984), Awakenings (1990), The Birdcage (1996), Insomnia (2002), One Hour Photo (2002), World's Greatest Dad (2009), and Boulevard (2014). On Monday, August 11th, 2014, Robin Williams was found dead at his home in Tiburon, California USA, the victim of an apparent suicide, according to the Marin County Sheriff's Department. A 911 call was received at 11:55 AM PDT, firefighters and paramedics arrived at his home at 12:00 PM PDT, and he was pronounced dead at 12:02 PM PDT.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYzMjc2Mjg4MF5BMl5BanBnXkFtZTcwODc1OTQwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000245","name":"Robin Williams","idIMDB":"nm0000245"},"actorId":"nm0000245","character":"Teddy Roosevelt / Voice of Garuda","urlCharacter":"http://www.imdb.com/character/ch0027501","main":true},{"actorName":"Owen Wilson","urlProfile":"http://www.imdb.com/name/nm0005562","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzQ4ODYxMV5BMl5BanBnXkFtZTcwNDAwMTc2NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1968","placeOfBirth":" Dallas, Texas, USA","birthName":"Owen Cunningham Wilson","height":"5' 10½\" (1.79 m)","bio":"Self-proclaimed troublemaker Owen Wilson was born in Dallas, to Irish-American parents originally from Massachusetts. He grew up in Texas with his mother, Laura (Cunningham), a photographer; his father, Robert Andrew Wilson, an ad exec; and his brothers, Andrew Wilson (the eldest) and Luke Wilson (the youngest). Expelled from St. Mark's School of Texas (Dallas, TX) in the tenth grade, Wilson finished his sophomore year at Thomas Jefferson School and then headed to a military academy in New Mexico. He then attended the University of Texas at Austin, where he met his future mentor and friend, Wes Anderson. They wrote a screenplay, Bottle Rocket (1996), and sent it to their family friend, screenwriter L.M. Kit Carson, who sent it to producer Polly Platt, who gave it to James L. Brooks, who gave the Texans $5 million dollars to make it into a feature film. Despite critical praise, Bottle Rocket (1996) only grossed one million dollars. After making the film, Wilson moved to Hollywood, setting up house with his two brothers and Anderson. Fairly quickly, Owen found himself acting in a series of big budget films, such as The Cable Guy (1996), Hantise (1999), Anaconda (1997) and Breakfast of Champions (1999). This led to more work, such as Shanghai Noon (2000), Meet the Parents (2000) and Behind Enemy Lines (2001). He's known not only for his nose, which has been broken several times, but also for his 'free wheeling ways' with a script. He co-wrote the film The Royal Tenenbaums (2001) with his oft partner Wes Anderson. He has been romantically linked with singer Sheryl Crow.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzQ4ODYxMV5BMl5BanBnXkFtZTcwNDAwMTc2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005562","name":"Owen Wilson","nicknames":["O"],"idIMDB":"nm0005562"},"actorId":"nm0005562","character":"Jedediah","urlCharacter":"http://www.imdb.com/character/ch0009974","main":true},{"actorName":"Steve Coogan","urlProfile":"http://www.imdb.com/name/nm0176869","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMTU2NjcwOF5BMl5BanBnXkFtZTcwNjczMzU4MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 October 1965","placeOfBirth":" Middleton, Manchester, England, UK","birthName":"Stephen John Coogan","height":"5' 10½\" (1.79 m)","bio":"Steve Coogan was born on October 14, 1965 in Middleton, Manchester, England as Stephen John Coogan. He is an actor and producer, known for Philomena (2013), Alan Partridge (2013) and Despicable Me 2 (2013). He was previously married to Caroline Hickman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMTU2NjcwOF5BMl5BanBnXkFtZTcwNjczMzU4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0176869","name":"Steve Coogan","nicknames":["Steve"],"idIMDB":"nm0176869"},"actorId":"nm0176869","character":"Octavius","urlCharacter":"http://www.imdb.com/character/ch0009975","main":true},{"actorName":"Ricky Gervais","urlProfile":"http://www.imdb.com/name/nm0315041","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNDQwMDUyMV5BMl5BanBnXkFtZTcwNzI2NzQ4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 June 1961","placeOfBirth":" Reading, Berkshire, England, UK","birthName":"Ricky Dene Gervais","height":"5' 8\" (1.73 m)","bio":"Ricky Dene Gervais was born in a suburb of Reading, Berkshire, to Eva Sophia (House) and Lawrence Raymond Gervais, who was a hod carrier and labourer. His father was born in Ontario, Canada, of French-Canadian descent, and his mother was English. He was educated at Ashmead Comprehensive School and went on to study at University College, London, where he gained a degree in Philosophy. After university, Gervais attempted to pursue a pop career with Seona Dancing, a duo he formed with a fellow student. Similar to many groups in the early 1980s, they were a synth-pop act with a somewhat pretentious name and exhibiting a strong musical influence by David Bowie. Gervais adopted a vocal style that has often been compared to Bowie; comedian Paul Merton would later joke that Bowie nicked their music. Seona Dancing were briefly signed to a recording contract and released two singles, \"More to Lose\" and \"Bitter Heart\". The latter was slightly reminiscent of Queen's \"Body Language\" from a year earlier, featuring a similar synthesizer riff. The act failed to breach the UK top 75 and earn a place in the Guinness Book of British Hit Singles, but clips have survived and they have been frequently used to tease Gervais in interviews. Despite his own lack of success, Gervais stayed within the music industry for a while and even spent time as the manager of Suede. Gervais had to wait a long time before achieving the fame he had hoped would come with a pop career. In the 1990s he formed a writing partnership with Stephen Merchant. In 2000, he landed his own comedy chat show on Channel 4, Meet Ricky Gervais (2000), which attracted legendary guests such as Jimmy Savile, Michael Winner, Paul Daniels, Peter Purves, Stefanie Powers, Jim Bowen and Midge Ure. The series only ran for six episodes but a year later greater stardom came for Gervais with the debut of BBC comedy The Office (2001). Although it was not initially received to great acclaim or viewing figures, it is now often cited as one of the greatest comedy series of all time and has been credited as reinventing the sitcom. Gervais starred as the obnoxious and embarrassing office manager David Brent, who has since been voted in various polls one of the greatest comic characters. It also prompted an American remake, The Office (2005). Gervais had further success with another sitcom, Extras (2005), which attracted a series of celebrity guests, including Ben Stiller, Samuel L. Jackson and his musical idol David Bowie. It served as a satire on the entertainment industry and leading stars were happy to play along by performing exaggerated versions of themselves. Gervais has become one of the most popular and omnipresent comedy performers of the 21st century, hosting the Golden Globe awards, lending his talent to films, becoming a voice artist and appearing on numerous talk shows, becoming one of the best known British comedy figures in America. He is also regularly the subject of controversy due to his dark comedy. Some critics have called him insensitive and outrageous. Gervais has responded by saying \"offense is the collateral damage of free speech\", he has said that he doesn't aim for a mass audience, he's just pleased he's managed to get one, and he has compared his style of comedy and the audience he has acquired with being Iggy Pop in preference to being Phil Collins.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNDQwMDUyMV5BMl5BanBnXkFtZTcwNzI2NzQ4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0315041","name":"Ricky Gervais","idIMDB":"nm0315041"},"actorId":"nm0315041","character":"Dr. McPhee","urlCharacter":"http://www.imdb.com/character/ch0009972","main":true},{"actorName":"Dan Stevens","urlProfile":"http://www.imdb.com/name/nm1405398","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTY5OTI2MF5BMl5BanBnXkFtZTgwNDkzMzIxMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1982","placeOfBirth":" Croydon, Surrey, England, UK","birthName":"Daniel Jonathan Stevens","height":"6' (1.83 m)","bio":"Dan Stevens was born at Croydon in Surrey on 10th October 1982. His parents are teachers. He was educated at Tonbridge School and trained in acting at the National Youth Theatre of Great Britain. He studied English Literature at Emmanuel College, Cambridge. Whilst he was a Cambridge undergraduate, he acted in several student drama productions. He played the title role in the Marlowe Dramatic Society's production of William Shakespeare's play, \"Macbeth\". This was staged at the Cambridge Arts Theatre from Tuesday 26th February to Saturday 2nd March 2002. The cast also featured Rebecca Hall in the roles of Lady Macbeth and Hecate. During one of his university summer holidays in August 2003 he went to Slovakia where he filmed his scenes for the Hallmark production of Frankenstein (2004). Dan played the part of Henry Clerval and the mini-series was first broadcast on American television on 5th October 2004. Shortly after graduating from Cambridge Dan was nominated for an Ian Charleson award for his performance as Orlando in \"As You Like It\" at the Rose Theatre at Kingston in Surrey. \"As You Like It\" was directed by Peter Hall and ran from 30th November to 18th December 2004. This production for the Peter Hall Company subsequently went on a tour of America in the early months of 2005, playing at the Ahmanson Theatre in Los Angeles, the Curran Theater in San Francisco and the Harvey Theater at the Brooklyn Academy of Music in New York City. It featured Rebecca Hall in the role of Rosalind. Dan was reunited with the director Peter Hall when he played Claudio in a new production of the Shakespeare play, \"Much ado about Nothing\", for the Peter Hall Company at the Theatre Royal in Bath from 29th June to 6th August 2005. In February 2006 Dan played the parts of Marban and Maitland in a revival of Howard Brenton's controversial play, \"The Romans in Britain\", directed by Samuel West at the Crucible Theatre in Sheffield. Then in May 2006 he played Nick Guest, the protagonist in The Line of Beauty (2006). This three part television mini-series was adapted by Andrew Davies from the 2004 Booker prize winning novel by Alan Hollinghurst. The Line of Beauty (2006) is about Nick Guest's relationship with his university friend Toby Fedden. The story takes place in the 1980s. It is set against the backdrop of Margaret Thatcher's free market economic policies and the spread of the acquired immunity deficiency syndrome, (AIDS). These two social developments directly affect the characters in the story because Toby's father Gerald is a Conservative member of parliament and Nick is homosexual. Whilst The Line of Beauty (2006) was being broadcast on BBC television, Dan was appearing as Simon Bliss in the Noël Coward play, \"Hay Fever\". This play was staged at the Theatre Royal Haymarket in London from 11th April to 5th August 2006 and the cast also included Judi Dench in the role of Judith Bliss. At the end of the year Dan played Lord Holmwood in a television dramatization of Dracula (2006), which was broadcast on 28th December 2006. In 2007 Dan played the part of Michael Faber in Agatha Christie's Marple: Miss Marple: Nemesis (2007), an Agatha Christie adaptation with Geraldine McEwan in the role of Miss Jane Marple. He also featured in the cast of Maxwell (2007), a television drama about the famous newspaper magnate. Maxwell (2007) was first broadcast on British television on 4th May 2007. David Suchet played Robert Maxwell, and Dan took the part of Basil Brookes, one of the press baron's financial directors. Dan played the part of Edward Ferrars in a television dramatization of Jane Austen's novel, Sense & Sensibility (2008). This was broadcast in three episodes on BBC1 between Tuesday 1st and Sunday 13th January 2008. The novel was adapted for television by Andrew Davies, whom Dan had previously worked with on The Line of Beauty (2006). Davies felt that the part of Edward Ferrars was underdeveloped in the book, and so he deliberately added scenes not included in the novel to help draw out the character. So, for instance, we saw Edward out horse riding on the Norland estate and chopping logs at Barton Cottage. In the DVD audio commentary Dan joked that this was the best example of log chopping ever seen on British television! After Sense & Sensibility (2008), Dan featured in the cast of \"The Tennis Court\", a BBC Radio 4 Saturday play broadcast on 19th January 2008. He also played Nicky Lancaster in a revival of the Noël Coward play, \"The Vortex\", at the Apollo Theatre in London from Wednesday 20th February to Saturday 7th June 2008. This was another collaboration with the stage director, Peter Hall. Dan played the eponymous hero of \"Dickens Confidential\", a six part radio drama series set in the 1830s which imagines what might have happened if Charles Dickens had continued his career as a journalist. This was broadcast on BBC Radio 4 between Monday 9th June and Monday 14th July 2008. He played the part of Peregrine in 'Orley Farm', the BBC Radio 4 Classic Serial. This was a three part adaptation of the novel by Anthony Trollope broadcast between Sunday 28th December 2008 and Sunday 11th January 2009. A month later he played Duval in the BBC Radio 4 Woman's Hour drama, 'The Lady of the Camellias'. This was broadcast between Monday 2nd and Friday 6th February 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTY5OTI2MF5BMl5BanBnXkFtZTgwNDkzMzIxMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1405398","name":"Dan Stevens","idIMDB":"nm1405398"},"actorId":"nm1405398","character":"Sir Lancelot","urlCharacter":"http://www.imdb.com/character/ch0027078","main":true},{"actorName":"Rebel Wilson","urlProfile":"http://www.imdb.com/name/nm2313103","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxNzYxNjg3Ml5BMl5BanBnXkFtZTgwNzEyMjc0NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 March 1980","placeOfBirth":" Sydney, New South Wales, Australia","birthName":"Melanie Elizabeth Bownds","height":"5' 4\" (1.63 m)","bio":"Rebel Wilson was born in Sydney, Australia. She trained at the Australian Theatre for Young People and at Second City in the US. After a successful stage and television career in Australia, this writer/actress/producer now focuses on feature film projects in the United States and is perhaps most known for her breakthrough roles in the films Bridesmaids and Pitch Perfect.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxNzYxNjg3Ml5BMl5BanBnXkFtZTgwNzEyMjc0NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2313103","name":"Rebel Wilson","nicknames":["Lil' Reb","Rebelicious"],"idIMDB":"nm2313103"},"actorId":"nm2313103","character":"Tilly","urlCharacter":"http://www.imdb.com/character/ch0497933","main":true},{"actorName":"Skyler Gisondo","urlProfile":"http://www.imdb.com/name/nm1711114","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQzNjcxMDE3M15BMl5BanBnXkFtZTgwODc3NjY1MDI@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1996","placeOfBirth":" Palm Beach County, Florida, USA","height":"5' 7½\" (1.71 m)","bio":"Skyler Gisondo was born on July 22, 1996 in Palm Beach County, Florida, USA. He is an actor, known for Vacation (2015), Night at the Museum 3 (2014) and The Amazing Spider-Man (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQzNjcxMDE3M15BMl5BanBnXkFtZTgwODc3NjY1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1711114","name":"Skyler Gisondo","idIMDB":"nm1711114"},"actorId":"nm1711114","character":"Nick Daley","urlCharacter":"http://www.imdb.com/character/ch0036350","main":true},{"actorName":"Rami Malek","urlProfile":"http://www.imdb.com/name/nm1785339","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODEwMjkzNDIzOV5BMl5BanBnXkFtZTgwOTQ4NTU0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1981","placeOfBirth":" Los Angeles, California, USA","birthName":"Rami Said Malek","height":"5' 9\" (1.75 m)","bio":"Rami Malek was born on May 12, 1981 in Los Angeles, California, USA as Rami Said Malek. He is an actor, known for Mr. Robot (2015), Short Term 12 (2013) and Need for Speed (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODEwMjkzNDIzOV5BMl5BanBnXkFtZTgwOTQ4NTU0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1785339","name":"Rami Malek","idIMDB":"nm1785339"},"actorId":"nm1785339","character":"Ahkmenrah","urlCharacter":"http://www.imdb.com/character/ch0046225","main":true},{"actorName":"Patrick Gallagher","urlProfile":"http://www.imdb.com/name/nm0302466","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDViNjM1Y2YtMTkzYy00YjQ3LTk4NzItZjg4YjBjNDEyY2Q1L2ltYWdlXkEyXkFqcGdeQXVyMzYxNzMyOTY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1968","placeOfBirth":" New Westminster, British Columbia, Canada","birthName":"Patrick James Gallagher","bio":"Patrick Gallagher was born in New Westminster, British Columbia, Canada, and grew up in Chilliwack, BC. He is of Irish and Chinese descent. Gallagher graduated from the National Theatre School of Canada in 1993. He began his career in Toronto working in the theater, in film and on television. In 2003 he gave a strong performance as Awkward Davies in Peter Weir's Oscar-nominated Master and Commander: The Far Side of the World (2003). His next role was Det. Joe Finn in the seventh season of the highly acclaimed Canadian television drama Da Vinci's Inquest (1998), carrying that character into the new series Da Vinci's City Hall (2005). He will also be remembered as Gary the Bartender in Alexander Payne's multi-award-winning Sideways (2004). He is a big supporter of the independent film scene, and has played numerous roles in projects by emerging filmmakers. He resides in Los Angeles, and is a dual US/Canadian citizen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDViNjM1Y2YtMTkzYy00YjQ3LTk4NzItZjg4YjBjNDEyY2Q1L2ltYWdlXkEyXkFqcGdeQXVyMzYxNzMyOTY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0302466","name":"Patrick Gallagher","idIMDB":"nm0302466"},"actorId":"nm0302466","character":"Attila","urlCharacter":"http://www.imdb.com/character/ch0027528","main":true},{"actorName":"Mizuo Peck","urlProfile":"http://www.imdb.com/name/nm0669693","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYyNjM2MjQwM15BMl5BanBnXkFtZTcwMzgwNzEyNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1977","placeOfBirth":" New York City, New York, USA","height":"5' 6\" (1.68 m)","bio":"Mizuo Peck was born on August 18, 1977 in New York City, New York, USA. She is an actress, known for Night at the Museum (2006), Night at the Museum: Battle of the Smithsonian (2009) and Night at the Museum 3 (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYyNjM2MjQwM15BMl5BanBnXkFtZTcwMzgwNzEyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0669693","name":"Mizuo Peck","idIMDB":"nm0669693"},"actorId":"nm0669693","character":"Sacajawea","urlCharacter":"http://www.imdb.com/character/ch0009977","main":true},{"actorName":"Ben Kingsley","urlProfile":"http://www.imdb.com/name/nm0001426","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2Njg2NzM4M15BMl5BanBnXkFtZTgwNjYwNjQwMTI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1943","placeOfBirth":" Scarborough, Yorkshire, England, UK","birthName":"Krishna Bhanji","height":"5' 8\" (1.73 m)","bio":"Ben Kingsley was born Krishna Bhanji on December 31, 1943 in Scarborough, Yorkshire, England. His father, Rahimtulla Harji Bhanji, was a Kenyan-born medical doctor, of Gujarati Indian descent, and his mother, Anna Lyna Mary (Goodman), was an English actress. Ben began to act in stage plays during the 1960s. He soon became a successful stage actor, and also began to have roles in films and television. His birth name was Krishna Bhanji, but he changed his name to \"Ben Kingsley\" soon after gaining fame as a stage actor, fearing that a foreign name could hamper his acting career. Kingsley first earned international fame for his performance in the drama movie Gandhi (1982). His performance as Mohandas K. Gandhi earned him international fame. He won many awards - including an Academy Award for Best Actor. He also won Golden Globe, BAFTA and London Film Critics' Circle Awards. After acting in Gandhi (1982), Ben was recognized as one of the finest British actors. After his international fame for appearing in Gandhi (1982), Kingsley appeared in many other famous movies. His success as an actor continued. His performance as Itzhak Stern in the drama movie Schindler's List (1993) earned him a BAFTA nomination. Schindler's List (1993) won seven Academy Awards, including Best Picture. During the late 1990s, Kingsley acted in many successful movies. He played Sweeney Todd in the television movie The Tale of Sweeney Todd (1997). For his performance in this movie, he was nominated for the Screen Actors' Guild Award. His other notable role was as Otto Frank in the television movie Anne Frank (2001), for which he won a Screen Actors' Guild Award. In 2002, Kingsley was appointed Knight Bachelor of the Order of the British Empire in the Queen's New Years Honours for his services to drama. In 2013, he received the BAFTA Los Angeles Britannia Award for Worldwide Contribution to Filmed Entertainment. That same year, he also received the Fellowship Award at the Asian Awards in London, England. Ben Kingsley currently resides in Spelsbury, Oxfordshire, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2Njg2NzM4M15BMl5BanBnXkFtZTgwNjYwNjQwMTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001426","name":"Ben Kingsley","idIMDB":"nm0001426"},"actorId":"nm0001426","character":"Merenkahre","urlCharacter":"http://www.imdb.com/character/ch0558804","main":true},{"actorName":"Crystal the Monkey","urlProfile":"http://www.imdb.com/name/nm2640714","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0NDEwMDY3MV5BMl5BanBnXkFtZTcwODI5NDIzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"1' 7\" (0.48 m)","bio":"Crystal the Monkey is no small bananas. In just five of her movies, she holds a box office gross of over $2.5 Billion. Her film, \"Hangover 2\" opened at $177.8 Million, the largest opening weekend in history for a comedy. She has worked with some of the biggest directors in Hollywood. She has held her own with Oscar Winners, stole scenes from top comedians and is beloved with the press as she commands Red Carpets. Paired with her extraordinary trainer, Tom Gunderson, she began in the business at the live animal show at Universal Studios. In 1997, she appeared in her first film \"George of the Jungle.\" In 2007, with over 20 features to her name came her big break came in \"Night at the Museum\" with Ben Stiller. With her naughty character, Dexter, she proved herself as not just a trained animal, but as an actor. In the second installment of\"Museum\" she reprised her role of Dexter and furthered her range by playing the duel character of Able. In 2011, Crystal solidified herself as an box-office actress. Beginning with \"Hangover 2\" where she was a tour de force as a drug dealing gangster. Also, starring in \"Hangover\" was the hilarious actor, Ken Jeong who said \"\"She's not a monkey, she's an actor. And quite possibly the best actor I've worked with.\" In the USA Today's review by Brian Alexander he said \"one cast member truly stood out: Crystal, a capuchin monkey. Maybe her name should be Hollywood's Hottest Monkey.\" She went onto play Donald the Monkey \"Zookeeper\" starring Kevin James with Adam Sandler dubbing her voice. Rounding out the year with Oscar winner, Matt Damon in \"We got a Zoo.\" When the new show \"Animal Practice\" aired in 2012, with Crystal on their cover, New York Magazine said \"NBC's most valuable commodity this fall: an irresistible, virtuoso capuchin monkey.\" She played the adorable sidekick Dr. Rizzo.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0NDEwMDY3MV5BMl5BanBnXkFtZTcwODI5NDIzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2640714","name":"Crystal the Monkey","idIMDB":"nm2640714"},"actorId":"nm2640714","character":"Dexter","urlCharacter":"http://www.imdb.com/character/ch0053203","main":true},{"actorName":"Dick Van Dyke","urlProfile":"http://www.imdb.com/name/nm0001813","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMTAzMTk3OV5BMl5BanBnXkFtZTYwNzcwNzU2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1925","placeOfBirth":" West Plains, Missouri, USA","birthName":"Richard Wayne Van Dyke","height":"6' 1\" (1.85 m)","bio":"Dick Van Dyke was born Richard Wayne Van Dyke in West Plains, Missouri, to Hazel Victoria (McCord), a stenographer, and Loren Wayne Van Dyke, a salesman. His younger brother is entertainer Jerry Van Dyke. His ancestry includes English, Scottish, German, Swiss-German, and Dutch. Although he'd had small roles beforehand, Van Dyke was launched to stardom in the 1960 musical \"Bye-Bye Birdie\", for which he won a Tony Award, and, then, later in the movie based on that play, Bye Bye Birdie (1963). He has starred in a number of films throughout the years including Mary Poppins (1964), Chitty Chitty Bang Bang (1968) and Fitzwilly (1967), as well as a number of successful television series which won him no less than four Emmys and three made-for-CBS movies. After separating from his wife, Margie Willett, in the 1970s, Dick later became involved with Michelle Triola. Margie and Dick had four children born during the first ten years of their marriage: Barry Van Dyke; Carrie Beth van Dyke; Christian Van Dyke and Stacy Van Dyke, all of whom are now in their forties and married themselves. He has seven grandchildren, including Shane Van Dyke, Carey Van Dyke, Wes Van Dyke and Taryn Van Dyke (Barry's children) and family members often appear with him on Diagnosis Murder (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMTAzMTk3OV5BMl5BanBnXkFtZTYwNzcwNzU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001813","name":"Dick Van Dyke","idIMDB":"nm0001813"},"actorId":"nm0001813","character":"Cecil","urlCharacter":"http://www.imdb.com/character/ch0009976","main":true},{"actorName":"Mickey Rooney","urlProfile":"http://www.imdb.com/name/nm0001682","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NjA4MDU0MV5BMl5BanBnXkFtZTYwMDI0MzQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1920","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Joseph Yule Jr.","height":"5' 2\" (1.57 m)","bio":"Mickey Rooney was born Joe Yule Jr. on September 23, 1920 in Brooklyn, New York. He first took the stage as a toddler in his parents vaudeville act at 17 months old. He made his first film appearance in 1926. The following year, he played the lead character in the first Mickey McGuire short film. It was in this popular film series that he took the stage name Mickey Rooney. Rooney reached new heights in 1937 with A Family Affair, the film that introduced the country to Andy Hardy, the popular all-American teenager. This beloved character appeared in nearly 20 films and helped make Rooney the top star at the box office in 1939, 1940 and 1941. Rooney also proved himself an excellent dramatic actor as a delinquent in Boys Town (1938) starring Spencer Tracy. In 1938, he was awarded a Juvenile Academy Award. Teaming up with Judy Garland, Rooney also appeared in a string of musicals, including Babes in Arms (1939) the first teenager to be nominated for an Oscar for Best Actor in a leading role, Strike Up the Band (1940), Babes on Broadway (1941), and Girl Crazy (1943). He and Garland immediately became best of friends. \"We weren't just a team, we were magic,\" Rooney once said. During that time he also appeared with Elizabeth Taylor in the now classic National Velvet (1944). Rooney joined the service that same year, where he helped to entertain the troops and worked on the American Armed Forces Network. He returned to Hollywood after 21 months in Love Laughs at Andy Hardy (1946), did a remake of a Robert Taylor film, The Crowd Roars (1932) called Killer McCoy (1947) and portrayed composer Lorenz Hart in Words and Music (1948). He also appeared in Breakfast at Tiffany's (1961), starring Audrey Hepburn and George Peppard. Rooney played Hepburn's Japanese neighbor, Mr. Yunioshi. A sign of the times, Rooney played the part for comic relief which he later regretted feeling the role was offensive. He once again showed his incredible range in the dramatic role of a boxing trainer with Anthony Quinn and Jackie Gleason in Requiem for a Heavyweight (1962). In the late 1960s and 1970s Rooney showed audiences and critics alike why he was one of Hollywood's most enduring stars. He gave an impressive performance in Francis Ford Coppola's 1979 film The Black Stallion (1979), which brought him an Academy Award nomination as Best Actor in a Supporting Role. He also turned to the stage in 1979 in Sugar Babies with Ann Miller, and was nominated for a Tony Award. During that time he also portrayed the Wizard in The Wonderful Wizard of Oz with Eartha Kitt at New York's Madison Square Garden, which also had a successful run nationally. Rooney appeared in four television series': The Mickey Rooney Show (1954) (1954-1955), a comedy sit-com in 1964 with Sammee Tong called Mickey, One of the Boys in 1982 with Dana Carvey and Nathan Lane, and The New Adventures of the Black Stallion (1990) from 1990-1993. In 1981, Rooney won an Emmy Award for his portrayal of a mentally challenged man in Bill (1981). The critical acclaim continued to flow for the veteran performer, with Rooney receiving an honorary Academy Award \"in recognition of his 60 years of versatility in a variety of memorable film performances\". More recently he has appeared in such films as Night at the Museum (2006) with Ben Stiller and The Muppets (2011) with Amy Adams and Jason Segel. Rooney's personal life, including his frequent trips to the altar, has proved to be just as epic as his on-screen performances. His first wife was one of the most beautiful women in Hollywood, actress Ava Gardner. Mickey permanently separated from his eighth wife Jan in June of 2012. In 2011 Rooney filed elder abuse and fraud charges against stepson Christopher Aber and Aber's wife. At Rooney's request, the Superior Court issued a restraining order against the Aber's demanding they stay 100 yards from Rooney, as well as Mickey's other son Mark Rooney and Mark's wife Charlene. Just prior, Rooney mustered the strength to break his silence and appeared before the Senate in Washington D.C. telling of his own heartbreaking story of abuse in an effort to live a peaceful, full life and help others who may be similarly suffering in silence. Rooney requested through the Superior Court to permanently reside with his son Mark Rooney, who is a musician and Marks wife Charlene, an artist, in the Hollywood Hills. He legally separated from his eighth wife in June of 2012. Ironically, after eight failed marriages he never looked or felt better and finally found happiness and peace in the single life. Mickey, Mark and Charlene focused on health, happiness and creative endeavors and it showed. Mickey Rooney had once again landed on his feet reminding us that he was a survivor. Rooney died on April 6th 2014. He was taking his afternoon nap and never woke. One week before his death Mark and Charlene surprised him by reunited him with a long lost love, the racetrack. He was ecstatic to be back after decades and ran into his old friends Mel Brooks and Dick Van Patten.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NjA4MDU0MV5BMl5BanBnXkFtZTYwMDI0MzQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001682","name":"Mickey Rooney","nicknames":["The Mick","The Mickster"],"idIMDB":"nm0001682"},"actorId":"nm0001682","character":"Gus","urlCharacter":"http://www.imdb.com/character/ch0041962","main":true}],"seasons":[],"idIMDB":"tt2692250","urlIMDB":"http://www.imdb.com/title/tt2692250","business":{"budget":{"money":"$127,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$5,541,830","country":"Russia","day":"12","month":"01","year":"2015","remarks":"1,690 Screens"}],"gross":[{"money":"$113,733,726","country":"USA","day":"28","month":"06","year":"2015","remarks":""},{"money":"$113,724,348","country":"USA","day":"21","month":"06","year":"2015","remarks":""},{"money":"$113,719,933","country":"USA","day":"18","month":"06","year":"2015","remarks":""},{"money":"$113,697,807","country":"USA","day":"07","month":"06","year":"2015","remarks":""},{"money":"$113,681,574","country":"USA","day":"31","month":"05","year":"2015","remarks":""},{"money":"$113,625,886","country":"USA","day":"14","month":"05","year":"2015","remarks":""},{"money":"$113,621,346","country":"USA","day":"10","month":"05","year":"2015","remarks":""},{"money":"$113,598,838","country":"USA","day":"03","month":"05","year":"2015","remarks":""},{"money":"$113,576,391","country":"USA","day":"30","month":"04","year":"2015","remarks":""},{"money":"$113,569,080","country":"USA","day":"26","month":"04","year":"2015","remarks":""},{"money":"$113,535,063","country":"USA","day":"23","month":"04","year":"2015","remarks":""},{"money":"$113,481,605","country":"USA","day":"16","month":"04","year":"2015","remarks":""},{"money":"$113,461,910","country":"USA","day":"12","month":"04","year":"2015","remarks":""},{"money":"$113,368,327","country":"USA","day":"09","month":"04","year":"2015","remarks":""},{"money":"$113,302,758","country":"USA","day":"05","month":"04","year":"2015","remarks":""},{"money":"$113,190,205","country":"USA","day":"01","month":"04","year":"2015","remarks":""},{"money":"$113,142,122","country":"USA","day":"29","month":"03","year":"2015","remarks":""},{"money":"$113,020,918","country":"USA","day":"26","month":"03","year":"2015","remarks":""},{"money":"$112,953,299","country":"USA","day":"22","month":"03","year":"2015","remarks":""},{"money":"$112,772,282","country":"USA","day":"19","month":"03","year":"2015","remarks":""},{"money":"$112,675,962","country":"USA","day":"15","month":"03","year":"2015","remarks":""},{"money":"$112,448,525","country":"USA","day":"12","month":"03","year":"2015","remarks":""},{"money":"$112,342,858","country":"USA","day":"08","month":"03","year":"2015","remarks":""},{"money":"$112,064,489","country":"USA","day":"05","month":"03","year":"2015","remarks":""},{"money":"$111,982,775","country":"USA","day":"01","month":"03","year":"2015","remarks":""},{"money":"$111,653,970","country":"USA","day":"25","month":"02","year":"2015","remarks":""},{"money":"$111,590,444","country":"USA","day":"22","month":"02","year":"2015","remarks":""},{"money":"$111,209,662","country":"USA","day":"18","month":"02","year":"2015","remarks":""},{"money":"$110,581,083","country":"USA","day":"11","month":"02","year":"2015","remarks":""},{"money":"$110,484,764","country":"USA","day":"08","month":"02","year":"2015","remarks":""},{"money":"$109,979,611","country":"USA","day":"05","month":"02","year":"2015","remarks":""},{"money":"$108,952,639","country":"USA","day":"29","month":"01","year":"2015","remarks":""},{"money":"$108,597,968","country":"USA","day":"25","month":"01","year":"2015","remarks":""},{"money":"$107,187,000","country":"USA","day":"22","month":"01","year":"2015","remarks":""},{"money":"$106,013,000","country":"USA","day":"18","month":"01","year":"2015","remarks":""},{"money":"$100,948,106","country":"USA","day":"15","month":"01","year":"2015","remarks":""},{"money":"$360,345,402","country":"worldwide","day":"18","month":"06","year":"2015","remarks":""},{"money":"$360,251,355","country":"worldwide","day":"14","month":"05","year":"2015","remarks":""},{"money":"$360,201,860","country":"worldwide","day":"30","month":"04","year":"2015","remarks":""},{"money":"$360,160,532","country":"worldwide","day":"23","month":"04","year":"2015","remarks":""},{"money":"$360,107,074","country":"worldwide","day":"16","month":"04","year":"2015","remarks":""},{"money":"$358,068,327","country":"worldwide","day":"09","month":"04","year":"2015","remarks":""},{"money":"$354,190,205","country":"worldwide","day":"01","month":"04","year":"2015","remarks":""},{"money":"$354,020,918","country":"worldwide","day":"26","month":"03","year":"2015","remarks":""},{"money":"$346,458,621","country":"worldwide","day":"19","month":"03","year":"2015","remarks":""},{"money":"$345,348,525","country":"worldwide","day":"12","month":"03","year":"2015","remarks":""},{"money":"$342,901,489","country":"worldwide","day":"05","month":"03","year":"2015","remarks":""},{"money":"$339,253,970","country":"worldwide","day":"25","month":"02","year":"2015","remarks":""},{"money":"$332,809,662","country":"worldwide","day":"18","month":"02","year":"2015","remarks":""},{"money":"$324,381,083","country":"worldwide","day":"11","month":"02","year":"2015","remarks":""},{"money":"$315,985,673","country":"worldwide","day":"05","month":"02","year":"2015","remarks":""},{"money":"$304,201,639","country":"worldwide","day":"29","month":"01","year":"2015","remarks":""},{"money":"$293,304,473","country":"worldwide","day":"22","month":"01","year":"2015","remarks":""},{"money":"$261,690,465","country":"worldwide","day":"15","month":"01","year":"2015","remarks":""},{"money":"$246,625,469","country":"Non-USA","day":"16","month":"04","year":"2015","remarks":""},{"money":"$244,700,000","country":"Non-USA","day":"09","month":"04","year":"2015","remarks":""},{"money":"$241,000,000","country":"Non-USA","day":"26","month":"03","year":"2015","remarks":""},{"money":"$233,686,339","country":"Non-USA","day":"19","month":"03","year":"2015","remarks":""},{"money":"$232,900,000","country":"Non-USA","day":"12","month":"03","year":"2015","remarks":""},{"money":"$230,837,000","country":"Non-USA","day":"05","month":"03","year":"2015","remarks":""},{"money":"$227,600,000","country":"Non-USA","day":"25","month":"02","year":"2015","remarks":""},{"money":"$221,600,000","country":"Non-USA","day":"18","month":"02","year":"2015","remarks":""},{"money":"$213,800,000","country":"Non-USA","day":"11","month":"02","year":"2015","remarks":""},{"money":"$206,006,062","country":"Non-USA","day":"05","month":"02","year":"2015","remarks":""},{"money":"$195,249,000","country":"Non-USA","day":"29","month":"01","year":"2015","remarks":""},{"money":"$186,117,473","country":"Non-USA","day":"22","month":"01","year":"2015","remarks":""},{"money":"$160,742,359","country":"Non-USA","day":"15","month":"01","year":"2015","remarks":""},{"money":"$9,809,644 (Russia)","country":"","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$4,575","country":"USA","day":"28","month":"06","year":"2015","remarks":"22 Screens"},{"money":"$4,415","country":"USA","day":"21","month":"06","year":"2015","remarks":"24 Screens"},{"money":"$8,420","country":"USA","day":"07","month":"06","year":"2015","remarks":"30 Screens"},{"money":"$13,048","country":"USA","day":"31","month":"05","year":"2015","remarks":"40 Screens"},{"money":"$17,516","country":"USA","day":"10","month":"05","year":"2015","remarks":"55 Screens"},{"money":"$22,447","country":"USA","day":"03","month":"05","year":"2015","remarks":"68 Screens"},{"money":"$34,017","country":"USA","day":"26","month":"04","year":"2015","remarks":"88 Screens"},{"money":"$93,583","country":"USA","day":"12","month":"04","year":"2015","remarks":"146 Screens"},{"money":"$89,878","country":"USA","day":"05","month":"04","year":"2015","remarks":"160 Screens"},{"money":"$121,204","country":"USA","day":"29","month":"03","year":"2015","remarks":"184 Screens"},{"money":"$181,017","country":"USA","day":"22","month":"03","year":"2015","remarks":"206 Screens"},{"money":"$227,437","country":"USA","day":"15","month":"03","year":"2015","remarks":"220 Screens"},{"money":"$278,369","country":"USA","day":"08","month":"03","year":"2015","remarks":"265 Screens"},{"money":"$305,115","country":"USA","day":"01","month":"03","year":"2015","remarks":"273 Screens"},{"money":"$346,207","country":"USA","day":"22","month":"02","year":"2015","remarks":"280 Screens"},{"money":"$505,153","country":"USA","day":"08","month":"02","year":"2015","remarks":"437 Screens"},{"money":"$1,785,807","country":"USA","day":"25","month":"01","year":"2015","remarks":"1,370 Screens"},{"money":"$5,065,000","country":"USA","day":"18","month":"01","year":"2015","remarks":"2,437 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 38 min (98 min)"],"soundMix":["Dolby","Dolby Digital","Dolby Atmos"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Red Epic Dragon, Angenieux Optimo Lenses"],"laboratory":null,"filmLength":["2,680.26 m (6 reels)"],"negativeFormat":["Redcode RAW"],"cinematographicProcess":["Digital Intermediate (4K) (master format)","Redcode RAW (5K) (6K) (source format)"],"printedFilmFormat":["35 mm (spherical) (Kodak Vision 2383)","D-Cinema"]},"rating":"6.2","metascore":"47","filmingLocations":[{"location":"London, England, UK"}],"rated":"PG","awards":[{"award":"International Film Music Critics Award (IFMCA) 2014","titlesAwards":[{"titleAwardOutcome":"Nominated IFMCA Award","categories":[{"category":"Best Original Score for a Comedy Film","names":[{"name":"Alan Silvestri","id":"nm0006293","role":null}]}]}]},{"award":"Kids' Choice Awards, USA 2015","titlesAwards":[{"titleAwardOutcome":"Won Blimp Award","categories":[{"category":"Favorite Movie Actor","names":[{"name":"Ben Stiller","id":"nm0001774","role":null}]}]}]},{"award":"Teen Choice Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie: Comedy","names":[]},{"category":"Choice Movie Actor: Comedy","names":[{"name":"Ben Stiller","id":"nm0001774","role":null}]}]}]}],"votes":"73,677","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"},{"idCompany":"co0158853","name":"21 Laps Entertainment"},{"idCompany":"co0046151","name":"1492 Pictures"}],"keywords":{"keywords":["night watchman","museum of natural history manhattan new york city","star died before release","museum","tablet","volcano","pompeii","lancelot","historic figures as characters","capuchin monkey","natural history museum london","tomb","archaeologist","pharaoh","magic","museum of natural history","lifting someone into the air","reference to wolverine","reference to hugh jackman","actor","urinating on someone","urination","lava","volcanic eruption","mobile phone","cell phone","ancient egypt","reference to facebook","reference to youtube","animate skeleton","monkey","natural history museum","london england","falling into a hole","egypt","year 1938","third in trilogy","third part","sequel","death of cast member","watchman","tyrannosaurus rex","horse","part of trilogy","air duct","keyboard","sacagawea","studio logo segues into film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:09:41"}}