{"data":{"movies":[{"title":"Fury","originalTitle":"","year":"2014","releaseDate":"20141017","directors":[{"name":"David Ayer","id":"nm0043742"}],"writers":[{"name":"David Ayer","id":"nm0043742"}],"runtime":"134 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MDU0NTUyN15BMl5BanBnXkFtZTgwMzQxMzY4MjE@._V1.jpg","countries":["USA","China","UK"],"languages":["English","German"],"genres":["Action","Drama","War"],"plot":"1945, in World War II Germany, the tough Sergeant Don 'Wardaddy' Collier commands a tank and survives a German attack with his veteran crew composed of Boyd 'Bible' Swan, Trini 'Gordo' Garcia and Grady 'Coon-Ass' Travis. He receives a rookie soldier Norman Ellison as the substitute for his deceased gunner and he tries to harden the youth along the way.","simplePlot":"A grizzled tank commander makes tough decisions as he and his crew fight their way across Germany in April, 1945.","actors":[{"actorName":"Brad Pitt","urlProfile":"http://www.imdb.com/name/nm0000093","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjE2MTQ2MV5BMl5BanBnXkFtZTcwMjE5MDY0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1963","placeOfBirth":" Shawnee, Oklahoma, USA","birthName":"William Bradley Pitt","height":"5' 11\" (1.8 m)","bio":"An actor and producer known as much for his versatility as he is for his handsome face, Golden Globe-winner Brad Pitt's most widely recognized role may be Tyler Durden in Fight Club (1999). However, his portrayals of Billy Beane in Moneyball (2011), and Rusty Ryan in the remake of Ocean's Eleven (2001) and its sequels, also loom large in his filmography. Pitt was born William Bradley Pitt on December 18th, 1963, in Shawnee, Oklahoma, and was raised in Springfield, Missouri. He is the son of Jane Etta (Hillhouse), a school counselor, and William Alvin Pitt, a truck company manager. He has a younger brother, Douglas (Doug) Pitt, and a younger sister, Julie Neal Pitt. At Kickapoo High School, Pitt was involved in sports, debating, student government and school musicals. Pitt attended the University of Missouri, where he majored in journalism with a focus on advertising. He occasionally acted in fraternity shows. He left college two credits short of graduating to move to California. Before he became successful at acting, Pitt supported himself by driving strippers in limos, moving refrigerators and dressing as a giant chicken while working for \"el Pollo Loco\". Pitt's earliest credited roles were in television, starting on the daytime soap opera Another World (1964) before appearing in the recurring role of Randy on the legendary prime time soap opera Dallas (1978). Following a string of guest appearances on various television series through the 1980s, Pitt gained widespread attention with a small part in Thelma & Louise (1991), in which he played a sexy criminal who romanced and conned Geena Davis. This lead to starring roles in badly received films such as Johnny Suede (1991) and Cool World (1992). But Pitt's career hit an upswing with his casting in A River Runs Through It (1992), which cemented his status as an multi-layered actor as opposed to just a pretty face. Pitt's subsequent projects were as quirky and varied in tone as his performances, ranging from his unforgettably comic cameo as stoner roommate Floyd in True Romance (1993) to romantic roles in such visually lavish films as Interview with the Vampire: The Vampire Chronicles (1994) and Legends of the Fall (1994), to an emotionally tortured detective in the horror-thriller Se7en (1995). His portrayal of frenetic oddball Jeffrey Goines in Twelve Monkeys (1995) won him a Globe for Best Performance by an Actor in a Supporting Role. Pitt's portrayal of Achilles in the big-budget period drama Troy (2004) helped establish his appeal as action star and was closely followed by a co-starring role in the stylish spy-versus-spy flick Mr. & Mrs. Smith (2005). It was on the set of Mr. & Mrs. Smith that Pitt, who married Jennifer Aniston in a highly publicized ceremony in 2000, met his current partner Angelina Jolie. Pitt left Aniston for Jolie in 2005, a break-up that continues to fuel tabloid stories years after its occurrence. He continues to wildly vary his film choices, appearing in everything from high-concept popcorn flicks such as Megamind (2010) to adventurous critic-bait like Inglourious Basterds (2009) and The Tree of Life (2011). He has received two Best Actor Oscar nominations, for The Curious Case of Benjamin Button (2008) and Moneyball (2011). In 2014, he starred in the war film Fury (2014), opposite Shia LaBeouf, Logan Lerman, Jon Bernthal, and Michael Peña. Pitt and Jolie have six children, including two sons and a daughter who were adopted.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjE2MTQ2MV5BMl5BanBnXkFtZTcwMjE5MDY0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000093","name":"Brad Pitt","idIMDB":"nm0000093"},"actorId":"nm0000093","character":"Don 'Wardaddy' Collier","urlCharacter":"http://www.imdb.com/character/ch0401212","main":true},{"actorName":"Shia LaBeouf","urlProfile":"http://www.imdb.com/name/nm0479471","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzODQ3NzczNF5BMl5BanBnXkFtZTgwODQ1NzY1MjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 June 1986","placeOfBirth":" Los Angeles, California, USA","birthName":"Shia Saide LaBeouf","height":"5' 9¼\" (1.76 m)","bio":"Shia Saide LaBeouf was born in Los Angeles, California, to Shayna (Saide) and Jeffrey Craig LaBeouf, and is an only child. His mother is from an Ashkenazi Jewish family, while his father has Cajun (French) ancestry. His parents are divorced. He started his career by doing stand-up comedy around places in his neighborhood, such as coffee clubs. One day, he saw a friend of his acting on Dr. Quinn, Medicine Woman (1993), and wanted to become an actor. Shia and his mother talked it over, and the next day, he started looking for an agent. He searched in the yellow pages, called one up, and did a stand-up routine in front of him. They liked him and signed him, and then he started auditioning. He is well known for playing Louis Stevens on the popular Disney Channel series Even Stevens (2000) and has won a Daytime Emmy Award for his performance. His best known role is as Sam Witwicky, the main protagonist of the first three installments of the Transformers series: Transformers (2007), Transformers: Revenge of the Fallen (2009) and Transformers: Dark of the Moon (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzODQ3NzczNF5BMl5BanBnXkFtZTgwODQ1NzY1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0479471","name":"Shia LaBeouf","idIMDB":"nm0479471"},"actorId":"nm0479471","character":"Boyd 'Bible' Swan","urlCharacter":"http://www.imdb.com/character/ch0460232","main":true},{"actorName":"Logan Lerman","urlProfile":"http://www.imdb.com/name/nm0503567","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzI3MjEzN15BMl5BanBnXkFtZTcwMzI5NzAwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1992","placeOfBirth":" Beverly Hills, Los Angeles, California, USA","birthName":"Logan Wade Lerman","height":"5' 9\" (1.75 m)","bio":"Logan was born in Beverly Hills, to a Jewish family. His parents are Lisa (Goldman), who works as his manager, and Larry Lerman, an orthotist and businessman. He has two siblings, Lindsey and Lucas, both older. His relatives operate the orthotics and prosthetics company Lerman & Son, which was founded by his great-grandfather, Jacob Lerman. When he was two and a half years old, Logan told his mother that he wanted to be an actor. At the age of four, Logan had an agent and was booked for two commercials. His first appearance on the big screen was as William, the youngest son of Mel Gibson's character in The Patriot (2000). Also in 2000, he appeared with the same actor (Gibson), this time as the younger version of his character Nick Marshall, in What Women Want (2000). After a small role in 2001's Riding in Cars with Boys (2001), he starred in John Grisham's A Painted House (2003). Logan played the younger version of Ashton Kutcher's character, Evan, in The Butterfly Effect (2004). After making his small screen debut in a guest-starring role in 10-8: Officers on Duty (2003), he stared as Bobby (Robert) McCallister in the WB Network's series Jack & Bobby (2004), where he portrayed a teenager who will be a future president of the United States. After the show's cancellation in 2005, Logan returned to film, starring in the family adventure Hoot (2006). The next year, he played the son of Walter Sparrow (Jim Carrey) in the dark thriller The Number 23 (2007), and co-starred with Russell Crowe and Christian Bale in the well-reviewed Western remake 3:10 to Yuma (2007). His next two roles were playing a foul-mouthed private school student in the comedy Meet Bill (2007) and a younger version of actor George Hamilton in the period drama My One and Only (2009). Both were independent films that received limited releases. Also in 2009, Logan appeared with Gerard Butler in the R-rated action thriller Gamer (2009), as a teenager who controls Butler's character in a real-life video game. In 2010, Logan played the title character in the fantasy adventure Percy Jackson & the Olympians: The Lightning Thief (2010), giving him notice among a wider audience. Subsequently, he starred as D'Artagnan in a remake of Les Trois Mousquetaires (2011), headlined The Perks of Being a Wallflower (2012), a film adaptation of the 1999 book of the same name, had a supporting role in the independent film Stuck in Love (2012), and returned to star in Percy Jackson: Sea of Monsters (2013). His first 2014 role was in the epic Biblical film Noah (2014), playing one of the title character's sons, Ham; the film grossed over $100 million at the North American box office. Logan next starred with Brad Pitt, Shia LaBeouf, Jon Bernthal, and Michael Peña in the World War II-set action drama Fury (2014); in the film, he played one of several American soldiers engaged in tank combat against the German forces, during the last weeks of the Nazi regime. In 2016, Logan starred in the 1950s-set drama Indignation (2016), playing Marcus Messner, a Jewish student from New Jersey who attends a midwestern college. Written and directed by James Schamus, the film is an adaptation of Philip Roth's 2008 novel. When Logan is not working, he likes to play soccer and baseball. He is an LA Lakers fan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzI3MjEzN15BMl5BanBnXkFtZTcwMzI5NzAwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0503567","name":"Logan Lerman","nicknames":["Loggie"],"idIMDB":"nm0503567"},"actorId":"nm0503567","character":"Norman Ellison","urlCharacter":"http://www.imdb.com/character/ch0397496","main":true},{"actorName":"Michael Peña","urlProfile":"http://www.imdb.com/name/nm0671567","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNzcxNTE5NV5BMl5BanBnXkFtZTcwOTE4MTMzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1976","placeOfBirth":" Chicago, Illinois, USA","height":"5' 7\" (1.7 m)","bio":"Peña was born and raised in Chicago, to Nicolasa, a social worker, and Eleuterio Peña, who worked at a button factory. His parents were originally from Mexico, his mother from Charcas in San Luis Potosí and his father from Villa Purificación in Jalisco. After graduating from high school, he went to an open casting call for the Peter Bogdanovich feature To Sir, with Love II (1996), and to his surprise, beat out hundreds of other young men for a role. After relocating to Los Angeles Peña quickly booked a succession of roles in features including Star Maps, My Fellow Americans (1996) (opposite Jack Lemmon and James Garner), La Cucaracha (1998) (winner of the Best Picture in the Austin Film Festival), Bellyfruit (1999), and the Disney/Jerry Bruckheimer feature Gone in Sixty Seconds (2000). Michael Peña resides in Los Angeles where he plays bass guitar with his band, plays golf and boxes for relaxation.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNzcxNTE5NV5BMl5BanBnXkFtZTcwOTE4MTMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0671567","name":"Michael Peña","idIMDB":"nm0671567"},"actorId":"nm0671567","character":"Trini 'Gordo' Garcia","urlCharacter":"http://www.imdb.com/character/ch0459976","main":true},{"actorName":"Jon Bernthal","urlProfile":"http://www.imdb.com/name/nm1256532","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNzA5MDg0OV5BMl5BanBnXkFtZTcwMTU2NjE0Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 September 1976","placeOfBirth":" Washington, District of Columbia, USA","height":"5' 11\" (1.8 m)","bio":"Jon Bernthal was born and raised in Washington D.C., the son of Joan (Marx) and Eric Bernthal, a lawyer. His grandfather was musician Murray Bernthal. Jon went to study at The Moscow Art Theatre School, in Moscow, Russia, where he also played professional baseball in the European professional baseball federation. While in Moscow, he was noticed by the director of Harvard University's Institute for Advanced Theatre Training at the American Repretory Theatre and was invited to obtain his M.F.A there. After graduating in 2002 he has performed in over 30 plays regionally and off-Broadway including many with his own award-winning theatre company Fovea Floods. He now lives in Venice, California with his dog, Boss.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNzA5MDg0OV5BMl5BanBnXkFtZTcwMTU2NjE0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1256532","name":"Jon Bernthal","idIMDB":"nm1256532"},"actorId":"nm1256532","character":"Grady 'Coon-Ass' Travis","urlCharacter":"http://www.imdb.com/character/ch0410361","main":true},{"actorName":"Jim Parrack","urlProfile":"http://www.imdb.com/name/nm1747924","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MTIwODQ5NF5BMl5BanBnXkFtZTcwMjQ5OTI5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1981","placeOfBirth":" Allen, Texas, USA","height":"6' 4\" (1.93 m)","bio":"Jim Parrack, born February 8, 1981, is an American actor. He had a starring role as \"Hoyt Fortenberry\" in the HBO series, True Blood (2008), and appeared in the film, Battle Los Angeles (2011), which was released in March 2011. He currently stars in the Broadway production of John Steinbeck's novel, \"Of Mice and Men\", in which he plays the character \"Slim\". The play also stars James Franco, Chris O'Dowd and Leighton Meester. Parrack was born in Allen, Texas on February 8, 1981. He attended the co-ed Allen High School for secondary education. In 2001, Parrack moved to Los Angeles, California, where he studied acting at The Stella Adler Academy and then at the Playhouse West.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MTIwODQ5NF5BMl5BanBnXkFtZTcwMjQ5OTI5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1747924","name":"Jim Parrack","nicknames":["Jimmy"],"idIMDB":"nm1747924"},"actorId":"nm1747924","character":"Sergeant Binkowski","urlCharacter":"http://www.imdb.com/character/ch0500269","main":true},{"actorName":"Brad William Henke","urlProfile":"http://www.imdb.com/name/nm0377034","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1ODdhYWEtYzE1NC00MjFhLWJkZDMtODAwMWQ1MjZjYTZkXkEyXkFqcGdeQXVyMjMyMDg0OTI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1966","placeOfBirth":" Columbus, Nebraska, USA","birthName":"Brad William Henke","height":"6' 4\" (1.93 m)","bio":"Brad William Henke was born on April 10, 1966 in Columbus, Nebraska, USA. He is an actor, known for Orange Is the New Black (2013), Bright (2017) and Sneaky Pete (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1ODdhYWEtYzE1NC00MjFhLWJkZDMtODAwMWQ1MjZjYTZkXkEyXkFqcGdeQXVyMjMyMDg0OTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0377034","name":"Brad William Henke","idIMDB":"nm0377034"},"actorId":"nm0377034","character":"Sergeant Davis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin Vance","urlProfile":"http://www.imdb.com/name/nm5244059","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2ODM1MTA3MV5BMl5BanBnXkFtZTgwMTg1MTYyMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 4\" (1.93 m)","bio":"Kevin Vance is the co-founder and lead military consultant of Vance and Brown. Additionally, he writes, script edits, acts and film consults. Got to vanceandbrown-dot-com to learn more about Kevin Vance's work history, services, training and qualifications. You may go to the Contact Us page to submit inquiries for his services.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2ODM1MTA3MV5BMl5BanBnXkFtZTgwMTg1MTYyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5244059","name":"Kevin Vance","idIMDB":"nm5244059"},"actorId":"nm5244059","character":"Sergeant Peterson","urlCharacter":"http://www.imdb.com/character/ch0486204","main":true},{"actorName":"Xavier Samuel","urlProfile":"http://www.imdb.com/name/nm1882152","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWY5MTUxNGQtNDhjOS00ZmJiLTgwOTQtOWVlYmY3NGRlZjE2L2ltYWdlXkEyXkFqcGdeQXVyMTQ3NTc0ODI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1983","placeOfBirth":" Hamilton, Victoria, Australia","height":"5' 10\" (1.78 m)","bio":"Xavier Samuel was born on December 10, 1983 in Hamilton, Victoria, Australia. He is an actor, known for Love & Friendship (2016), Fury (2014) and The Twilight Saga: Eclipse (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2Y1YWZiNjgtMjFlYy00MGZjLTgwMGYtZmE1ZjY2ZmM0MTJjXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1882152","name":"Xavier Samuel","idIMDB":"nm1882152"},"actorId":"nm1882152","character":"Lieutenant Parker","urlCharacter":"http://www.imdb.com/character/ch0464959","main":true},{"actorName":"Jason Isaacs","urlProfile":"http://www.imdb.com/name/nm0005042","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NTI5MzE2OF5BMl5BanBnXkFtZTgwODYyNjM4MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1963","placeOfBirth":" Liverpool, Merseyside, England, UK","height":"5' 11\" (1.8 m)","bio":"Jason Isaacs was born in Liverpool, the third of four children of Sheila (née Nathan) and Eric Isaacs. His parents were both from Jewish families (from Eastern Europe). He studied law at Bristol University and graduated in 1985 with a degree in law but decided to study acting. While at Bristol University, he directed and/or appeared in over 20 productions. He then attended the Central School of Speech and Drama and graduated in 1989. Jason's notable roles include Col. William Tavington in The Patriot (2000), Lucius Malfoy in the Harry Potter films, Mr. Darling/Captain Hook in Peter Pan (2003), and Maurice in Good (2008). In 2014, he will appear with Brad Pitt, Shia LaBeouf, Logan Lerman, and Jon Bernthal in the World War II-set film Fury (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NTI5MzE2OF5BMl5BanBnXkFtZTgwODYyNjM4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005042","name":"Jason Isaacs","idIMDB":"nm0005042"},"actorId":"nm0005042","character":"Captain Waggoner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anamaria Marinca","urlProfile":"http://www.imdb.com/name/nm1671512","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMDc0NjY5N15BMl5BanBnXkFtZTgwNTkwNDg1MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 April 1978","placeOfBirth":" Iasi, Romania","height":"5' 7\" (1.7 m)","bio":"Anamaria Marinca was born on April 1, 1978 in Iasi, Romania. She is an actress, known for 4 Months, 3 Weeks and 2 Days (2007), Fury (2014) and Europa Report (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMDc0NjY5N15BMl5BanBnXkFtZTgwNTkwNDg1MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1671512","name":"Anamaria Marinca","idIMDB":"nm1671512"},"actorId":"nm1671512","character":"Irma","urlCharacter":"http://www.imdb.com/character/ch0481841","main":true},{"actorName":"Alicia von Rittberg","urlProfile":"http://www.imdb.com/name/nm2736690","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyODEwNzY1OF5BMl5BanBnXkFtZTgwMTc3NjMwMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1993","placeOfBirth":" Munich, Bavaria, Germany","height":"5' 5\" (1.65 m)","bio":"Alicia von Rittberg was born on December 10, 1993 in Munich, Bavaria, Germany. She is an actress, known for Fury (2014), Barbara (2012) and Und alle haben geschwiegen (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyODEwNzY1OF5BMl5BanBnXkFtZTgwMTc3NjMwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2736690","name":"Alicia von Rittberg","idIMDB":"nm2736690"},"actorId":"nm2736690","character":"Emma","urlCharacter":"http://www.imdb.com/character/ch0481838","main":true},{"actorName":"Scott Eastwood","urlProfile":"http://www.imdb.com/name/nm2207222","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjk2NTIyNjU2NF5BMl5BanBnXkFtZTgwNjQ0NjMzMjE@._V1_UY44_CR20,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 March 1986","placeOfBirth":" Carmel, California, USA","birthName":"Scott Clinton Reeves","height":"5' 11\" (1.8 m)","bio":"Scott Eastwood was born Scott Clinton Reeves in Carmel, Monterey County, California, to Jacelyn Ann Reeves, a flight attendant, and Clint Eastwood, an actor and director. He grew up in Hawaii. Scott has a younger sister, Kathryn Eastwood, and several half-siblings. In 2006, Scott made his film debut in Flags of Our Fathers (2006), directed by his father. He has since co-starred in the sports drama Invictus (2009), as union rugby player Joel Stransky, horror sequel Texas Chainsaw 3D (2013), as Deputy Hartman, and war action film Fury (2014), as Sergeant Miles. Scott plays the lead, Luke Collins, in the romantic drama The Longest Ride (2015), opposite Britt Robertson, and will co-star in the drama Snowden (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjk2NTIyNjU2NF5BMl5BanBnXkFtZTgwNjQ0NjMzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2207222","name":"Scott Eastwood","idIMDB":"nm2207222"},"actorId":"nm2207222","character":"Sergeant Miles","urlCharacter":"http://www.imdb.com/character/ch0486205","main":true},{"actorName":"Laurence Spellman","urlProfile":"http://www.imdb.com/name/nm1736605","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzOTY1OTMxMV5BMl5BanBnXkFtZTgwNjM2MjUwMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Laurence Spellman is an actor and director, known for Fury (2014), Ready Player One (2018) and The Legend of Tarzan (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzOTY1OTMxMV5BMl5BanBnXkFtZTgwNjM2MjUwMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1736605","name":"Laurence Spellman","idIMDB":"nm1736605"},"actorId":"nm1736605","character":"Sergeant Dillard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Daniel Betts","urlProfile":"http://www.imdb.com/name/nm0079418","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NjIxNjg4NV5BMl5BanBnXkFtZTgwOTE4NTc1MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1970","placeOfBirth":" Cuckfield, West Sussex, England, UK","bio":"Daniel Betts was born in 1971 in Cuckfield, West Sussex, England. He trained under Yat Malmgren and Christopher Fettes at the Drama Centre, London, graduating in 1993. His varied career has included many roles on the British and International stage, as well as TV and film work including Fury (2014), and the upcoming Brad Pitt films War Machine (2016) and Allied (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NjIxNjg4NV5BMl5BanBnXkFtZTgwOTE4NTc1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0079418","name":"Daniel Betts","idIMDB":"nm0079418"},"actorId":"nm0079418","character":"Burgermeister","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2713180","urlIMDB":"http://www.imdb.com/title/tt2713180","business":{"budget":{"money":"$68,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$82,251,953","country":"USA","day":"04","month":"12","year":"2014","remarks":"3,313 Screens"}],"gross":[{"money":"$85,817,906","country":"USA","day":"11","month":"02","year":"2015","remarks":""},{"money":"$85,817,906","country":"USA","day":"29","month":"01","year":"2015","remarks":""},{"money":"$82,251,953","country":"USA","day":"04","month":"12","year":"2014","remarks":""},{"money":"$211,817,906","country":"Worldwide","day":"11","month":"02","year":"2015","remarks":""},{"money":"$208,417,906","country":"Worldwide","day":"29","month":"01","year":"2015","remarks":""},{"money":"$205,517,906","country":"Worldwide","day":"25","month":"01","year":"2015","remarks":""},{"money":"$172,051,953","country":"Worldwide","day":"04","month":"12","year":"2014","remarks":""},{"money":"$126,000,000","country":"Non-USA","day":"11","month":"02","year":"2015","remarks":""},{"money":"$122,600,000","country":"Non-USA","day":"29","month":"01","year":"2015","remarks":""},{"money":"$923,866","country":"Portugal","day":"04","month":"12","year":"2014","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/2014/\">2014</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 14 min (134 min)"],"soundMix":["Datasat","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Panaflex Millennium XL2, Panavision C-, G-Series, ATZ and AWZ2 Lenses"],"laboratory":["ColorWorks, Culver City (CA), USA (digital intermediate)","i-Dailies, London, UK (dailies)"],"filmLength":["3,688.6 m (8 reels)"],"negativeFormat":["35 mm (Kodak Vision3 250D 5207, Vision3 500T 5219)"],"cinematographicProcess":["Digital Intermediate (4K) (master format)","Panavision (anamorphic) (source format)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)","D-Cinema"]},"rating":"7,6","metascore":"64","filmingLocations":[{"location":"London, England, UK"}],"rated":"R","awards":[{"award":"Screen Actors Guild Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Actor","categories":[{"category":"Outstanding Action Performance by a Stunt Ensemble in a Motion Picture","names":[{"name":"Sean Button","id":"nm1397457","role":null},{"name":"Ben Cooke","id":"nm0177374","role":null},{"name":"Rob Hunt","id":"nm0402615","role":null},{"name":"Kai Martin","id":"nm1661740","role":null},{"name":"Nick McKinless","id":"nm0571791","role":null},{"name":"Brett Praed","id":"nm0695083","role":null},{"name":"Hayley Saywell","id":"nm6230425","role":null},{"name":"Stuart Thorp","id":"nm0861643","role":null},{"name":"Calvin Warrington-Heasman","id":"nm2823677","role":null}]}]}]},{"award":"Awards Circuit Community Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated ACCA","categories":[{"category":"Best Actor in a Supporting Role","names":[{"name":"Shia LaBeouf","id":"nm0479471","role":null}]}]}]},{"award":"Awards of the Japanese Academy 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Award of the Japanese Academy","categories":[{"category":"Best Foreign Film","names":[]}]}]},{"award":"Broadcast Film Critics Association Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Critics Choice Award","categories":[{"category":"Best Action Movie","names":[]},{"category":"Best Actor in an Action Movie","names":[{"name":"Brad Pitt","id":"nm0000093","role":null}]}]}]},{"award":"Camerimage 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Frog","categories":[{"category":"Main Competition","names":[{"name":"Roman Vasyanov","id":"nm1664042","role":null}]}]}]},{"award":"Cinema Bloggers Awards, Portugal 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Cinema Bloggers Award","categories":[{"category":"Best Sound - International Competition","names":[]}]}]},{"award":"Hollywood Film Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won Hollywood Film Award","categories":[{"category":"Editor of the Year","names":[{"name":"Jay Cassidy","id":"nm0144203","role":null},{"name":"Dody Dorn","id":"nm0233827","role":null}]}]}]},{"award":"Hollywood Music In Media Awards (HMMA) 2014","titlesAwards":[{"titleAwardOutcome":"Nominated HMMA Award","categories":[{"category":"Best Original Score - Feature Film","names":[{"name":"Steven Price","id":"nm1888527","role":null}]}]}]},{"award":"Jupiter Award 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Jupiter Award","categories":[{"category":"Best International Film","names":[]}]}]},{"award":"Location Managers Guild Awards (LMGA) 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Outstanding Achievement Award","categories":[{"category":"Outstanding Locations in a Period Film","names":[{"name":"Russell Lodge","id":"nm0517115","role":null},{"name":"Lee Robertson","id":"nm1144122","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing - Sound Effects and Foley in an English Language Feature","names":[{"name":"Paul N.J. Ottosson","id":"nm0653338","role":"supervising sound editor, sound designer"},{"name":"Mark Pappas","id":"nm0660612","role":"supervising foley editor"},{"name":"Gary A. Hecker","id":"nm0373036","role":"foley artist"},{"name":"Rick Owens","id":"nm0654446","role":"foley artist"},{"name":"Jamie Hardt","id":"nm0362504","role":"sound effects editor"},{"name":"Lee Gilmore","id":"nm1061529","role":"sound effects editor"},{"name":"Hamilton Sterling","id":"nm0827515","role":"sound effects editor"},{"name":"Bruce Tanis","id":"nm0849498","role":"sound effects editor"},{"name":"Jonathan Klein","id":"nm0458835","role":"foley editor"},{"name":"Scott Curtis","id":"nm0193503","role":"foley editor"},{"name":"Ryan Juggler","id":"nm0432033","role":"foley editor"}]}]}]},{"award":"National Board of Review, USA 2014","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Best Ensemble","names":[]},{"category":"Top Ten Films","names":[]}]}]},{"award":"Online Film & Television Association 2015","titlesAwards":[{"titleAwardOutcome":"Nominated OFTA Film Award","categories":[{"category":"Best Sound Mixing","names":[]}]}]},{"award":"Phoenix Film Critics Society Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated PFCS Award","categories":[{"category":"Best Actor in a Supporting Role","names":[{"name":"Logan Lerman","id":"nm0503567","role":null}]}]}]},{"award":"Santa Barbara International Film Festival 2015","titlesAwards":[{"titleAwardOutcome":"Won Virtuoso Award","categories":[{"category":"","names":[{"name":"Logan Lerman","id":"nm0503567","role":null}]}]}]},{"award":"Satellite Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Satellite Award","categories":[{"category":"Best Art Direction &amp; Production Design","names":[{"name":"Andrew Menzies","id":"nm0579980","role":null},{"name":"Peter Russell","id":"nm0751392","role":null}]},{"category":"Best Film Editing","names":[{"name":"Dody Dorn","id":"nm0233827","role":null},{"name":"Jay Cassidy","id":"nm0144203","role":null}]},{"category":"Best Original Score","names":[{"name":"Steven Price","id":"nm1888527","role":null}]}]}]},{"award":"Seattle Film Critics Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Seattle Film Critics Award","categories":[{"category":"Best Picture","names":[]},{"category":"Best Sound Design","names":[{"name":"Paul N.J. Ottosson","id":"nm0653338","role":null},{"name":"Marc Fishman","id":"nm0279892","role":null},{"name":"Lisa Pinero","id":"nm0684101","role":null}]}]}]},{"award":"Teen Choice Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Teen Choice Award","categories":[{"category":"Choice Movie: Drama","names":[]},{"category":"Choice Movie Actor: Drama","names":[{"name":"Logan Lerman","id":"nm0503567","role":null}]}]}]},{"award":"The BSC, ACO, GBCT Features Operators Award 2015","titlesAwards":[{"titleAwardOutcome":"Nominated BSC,ACO,GBCT Features Operators Award","categories":[{"category":"Camera Operator","names":[{"name":"Des Whelan","id":"nm0924024","role":"camera operator"}]}]}]},{"award":"World Stunt Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won Taurus Award","categories":[{"category":"Best Specialty Stunt","names":[{"name":"Sean Button","id":"nm1397457","role":null}]}]}]}],"votes":"328 313","type":"Movie","companyCreditsSimple":[{"idCompany":"co0071509","name":"Columbia Pictures"},{"idCompany":"co0178111","name":"QED International"},{"idCompany":"co0479739","name":"LStar Capital"}],"keywords":{"keywords":["battle","tank","brutality","battlefield","combat","suicide","world war two","soldier","nazi germany","nazi","behind enemy lines","american soldier","ambush","violence","death","child murder","child soldier","person on fire","murder","war violence","year 1945","mission","film starts with text","army","historically inaccurate","vomiting","war crime","automatic weapon","nco","firearm","gunfight","massacre","blood splatter","u.s. military","armor","heroic military","nazi soldier","bazooka","cannon","hatred","arm sling","military life","tough guy","male camaraderie","u.s. army","military","bomb","sociopath","prisoner of war","bloody body of child","machismo","ss","war hero","heroism","last stand","cigarette smoking","exploding tank","exploding head","exploding body","execution","hanged woman","pistol","burned alive","written by director","bilingualism","subtitled scene","face slap","blood","corpse","stabbed to death","stabbed in the face","machine gun","horse riding","explosion","death of child","death of friend","mexican american","army sergeant","uniform","military uniform","redneck","binoculars","fire","coming of age","army base","f word","american abroad","army private","army captain","piano playing","no opening credits","reference to adolf hitler","rookie","fight","platoon","woman","mass murder","u.s. soldier","main character shot","main character dies","death of protagonist","death of hero","fistfight","hand to hand combat","fighting","standoff","anti aircraft gun","exploding truck","praying","flare gun","50. caliber machine gun","air strike","landmine","hand grenade","smoke grenade","held at gunpoint","shootout","tommy gun","revolver","exploding house","exploding car","decapitation","crushed to death","mine","scars on back","death of loved one","severed leg","grenade","drunkenness","exploding building","stabbed in the throat","shot to death","shot in the forehead","shot in the head","shot in the arm","shot in the chest","shot in the back","shot in the leg","self sacrifice","rpg","sniper","rifle","knife","surrender","sergeant","street shootout","reading the bible","last man standing","whistle","bolt action rifle","christian","gun battle","firefight","photograph","survival","singing","beating","gasoline","horse","ethnic slur","forest","map","wine","dog tag","shaving","southern accent","premarital sex","swastika","gore","captain","one day","bible quote","bare chested male","lieutenant","head blown off","character repeating someone else's dialogue","hanged man","urination","severed face","shot in the shoulder","title appears in writing","stabbed in the eye","one word title","palm reading","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:08:49"}}