{"data":{"movies":[{"title":"Sex Ed","originalTitle":"","year":"2014","releaseDate":"20141107","directors":[{"name":"Isaac Feder","id":"nm1690967"}],"writers":[{"name":"Bill Kennedy","id":"nm5620591"},{"name":"Bill Kennedy","id":"nm5620591"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQxMDc4OTk5OV5BMl5BanBnXkFtZTgwOTY0ODg3MjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"When Eddie lands his first teaching gig at an inner city middle school, he quickly finds that his highly pubescent pupils are receiving no form of sexual education. Eddie isn't exactly equipped to teach them - he's not exactly experienced romantically. And he's falling in love with the older sister of one of his students. But Eddie goes off lesson plan anyway, delving into the world of menstrual cycles and sexually transmitted infections, and in doing so, incurs the wrath of the local reverend.","simplePlot":"Eddie lands his first teaching gig at an inner city middle school and finds his highly pubescent pupils are receiving no form of sexual education. Eddie isn't really equipped to teach them...he's not exactly experienced romantically.","actors":[{"actorName":"Haley Joel Osment","urlProfile":"http://www.imdb.com/name/nm0005286","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI1NDQyMDQ4Ml5BMl5BanBnXkFtZTYwNDIxMjMz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1988","placeOfBirth":" Los Angeles, California, USA","height":"5' 6\" (1.68 m)","bio":"Haley Joel Osment is an American actor who has proven himself as one of the best young actors of his generation. He is the first millennial male to have received an Academy Award nomination for acting. Osment was born in Los Angeles, California, to Theresa (Seifert), a teacher, and actor Eugene Osment. His sister is actress Emily Osment. His ancestry includes English, German, and Irish. Osment began acting at the age of four, when he tried out for a Pizza Hut commercial in a shopping mall. The commercial launched his career, and he landed his first television role later that year. As a young child, his first film role was as Forrest Gump (1994)'s son, also named Forrest Gump, in the 1994 film of the same name as well as making a small appearance in Mixed Nuts (1994). He had roles in numerous TV series, including Thunder Alley (1994), The Jeff Foxworthy Show (1995), and, most notably, the final season of Murphy Brown (1988), in which he replaced Dyllan Christopher as Murphy's son Avery. Osment also made numerous guest appearances in various TV series, including The Larry Sanders Show (1992), Walker, Texas Ranger (1993) (as a child dying from AIDS), Touched by an Angel (1994), Chicago Hope (1994), The Pretender (1996), and as a child dying from leukemia in the emotional episode 'Angels and Blimps' (1999) of the series Ally McBeal (1997). Osment starred in Bogus (1996) with Whoopi Goldberg and Gérard Depardieu, and appeared in the 1998 made-for-TV movie The Lake (1998) with Yasmine Bleeth, as well as I'll Remember April (2000) with future The Sixth Sense (1999) co-star Trevor Morgan. He first achieved stardom in 1999 when he appeared in the blockbuster The Sixth Sense (1999), co-starring Bruce Willis. For this role, Osment won the Saturn Award for best young actor. He was also nominated for the Academy Award for Best Supporting Actor, but lost to Michael Caine, with whom he would later star in Secondhand Lions (2003). Osment (voice) also made three minor guest appearances on Family Guy (1999) in 2000. One of Osment's lines in The Sixth Sense (1999), \"I see dead people,\" is often repeated or parodied on television programs and in other media. The 2000 Academy Awards ceremony honored another of Osment's future co-stars, BestActor Kevin Spacey, who, along with Helen Hunt, appeared in Osment's next film, Pay It Forward (2000). The following year, Osment appeared in Steven Spielberg's A.I. Artificial Intelligence (2001), cementing his stature as one of the leading young actors in Hollywood. This role earned him his second Saturn Award. Also in 2001, Osment starred in a Polish film, Edges of the Lord (2001), as Romek. The movie was never released theatrically in the United States. Osment has since provided voices for The Country Bears (2002) and The Jungle Book 2 (2003). More recently, Osment was the voice of Sora, the main protagonist of the Walt Disney Company and Square-Enix's Kingdom Hearts (2002) video-game series, which was extremely financially successful as well and generally well-received critically. He was also the voice of Takeshi Jinno in the \"Time to Shine\" episode of the IGPX: Immortal Grand Prix (2005) animé TV series. Osment also worked in Home of the Giants (2007), playing a high school journalist opposite Ryan Merriman and Danielle Panabaker. He also played Helmuth Hübener in the film Truth & Treason (????). On July 20, 2006, Osment was injured in a one-car accident. His blood-alcohol content was measured at 0.16%, twice the legal limit in California. On August 18, he was charged with four misdemeanors, including driving under the influence of alcohol and possession of marijuana while driving. He pleaded no contest on October 19 and was sentenced to three years' probation, 60 hours in an alcohol-rehabilitation and education program, a fine of $1,500, and a minimum requirement of 26 Alcoholics Anonymous meetings over a six-month period.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI1NDQyMDQ4Ml5BMl5BanBnXkFtZTYwNDIxMjMz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005286","name":"Haley Joel Osment","nicknames":["HJO"],"idIMDB":"nm0005286"},"actorId":"nm0005286","character":"Ed Cole","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Glen Powell","urlProfile":"http://www.imdb.com/name/nm1412974","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2E5NzFmNTMtZWJiMi00YmMxLWExZGEtMjY5MGE4YTgxNTdmXkEyXkFqcGdeQXVyNDg0MzQyNA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 October 1988","placeOfBirth":" Austin, Texas, USA","height":"6' (1.83 m)","bio":"Glen Powell was born on October 21, 1988 in Austin, Texas, USA. He is an actor and producer, known for The Dark Knight Rises (2012), Hidden Figures (2016) and Everybody wants Some!! (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2E5NzFmNTMtZWJiMi00YmMxLWExZGEtMjY5MGE4YTgxNTdmXkEyXkFqcGdeQXVyNDg0MzQyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1412974","name":"Glen Powell","idIMDB":"nm1412974"},"actorId":"nm1412974","character":"JT","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lorenza Izzo","urlProfile":"http://www.imdb.com/name/nm4448022","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxODA2MDQ2NF5BMl5BanBnXkFtZTcwNTIwNTY0OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 September 1989","placeOfBirth":" Las Condes, Santiago, Metropolitan Region, Chile","birthName":"Lorenza Francesca Izzo Parsons","height":"5' 8\" (1.73 m)","bio":"Lorenza Izzo was born on September 19, 1989 in Las Condes, Santiago, Metropolitan Region, Chile as Lorenza Francesca Izzo Parsons. She is an actress, known for Knock Knock (2015), The Green Inferno (2013) and Aftershock (2012). She has been married to Eli Roth since November 8, 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxODA2MDQ2NF5BMl5BanBnXkFtZTcwNTIwNTY0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4448022","name":"Lorenza Izzo","idIMDB":"nm4448022"},"actorId":"nm4448022","character":"Pilar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Eads","urlProfile":"http://www.imdb.com/name/nm0247040","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMDY1NjI4OV5BMl5BanBnXkFtZTcwMjk3NTYyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 March 1967","placeOfBirth":" Fort Worth, Texas, USA","birthName":"George Coleman Eads III","height":"5' 11\" (1.8 m)","bio":"A charismatic performer who spent years on television looking for his big break, actor George Eads finally became a television star portraying forensic investigator Nick Stokes on the hit procedural \"CSI: Crime Scene Investigation\" (CBS, 2000- ). Prior to that role, Eads eked out a living with roles on less-than-popular shows like \"Strange Luck\" (Fox, 1995-96) and Aaron Spelling's short-lived \"Savannah\" (The WB, 1996-97), before carving out a niche in TV movies like \"The Ultimate Lie\" (USA, 1996) and \"Crowned and Dangerous\" (ABC, 1997). He went on to score a few episodes of \"ER\" (NBC, 1994-2009) and had a regular role on the sitcom \"Grapevine\" (CBS, 2000), only to find himself out of work once more when that series was canceled after five episodes. But Eads segued right away into \"CSI,\" where he was fortunate enough to have landed on a series that ran well into the next decade, turning him into a known commodity while allowing the actor the comfort of tackling outside roles as he chose. During his time on the show, Eads landed a number of guest spots and TV movies, but none as high-profile as his starring turn as the iconic 1970s daredevil, \"Evel Knievel\" (TNT, 2004). With his portrayal of Stokes, Eads was elevated from unknown to fan favorite after years of struggle.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMDY1NjI4OV5BMl5BanBnXkFtZTcwMjk3NTYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0247040","name":"George Eads","idIMDB":"nm0247040"},"actorId":"nm0247040","character":"Jimmy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Parker Young","urlProfile":"http://www.imdb.com/name/nm2875233","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWFlZWVjYTItNzM1OC00NzMyLTg2NTYtNmE3ZDUxM2I2ODA4XkEyXkFqcGdeQXVyMTY1MjYxMjU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1988","placeOfBirth":" Tucson, Arizona, USA","height":"5' 11\" (1.8 m)","bio":"Parker Charles William Young was born in Tucson, Arizona, to Karl and Zarina Young. He is the oldest of three children, and as a youth he enjoyed playing sports, rock climbing, paintballing, and exploring the Sonoran desert. In high school, football became Parker's main focus. As a sophomore he started on the Varsity team, and by senior year he was captain. Parker first took the stage as a junior in high school as part of a one act play; that is if you don't count the mandatory theater class in middle school, or the time that he rapped Dr. Dre's \"Forgot About Dre\" in the 5th grade talent show. The one act play that he was a part of took first place out of three student written plays at the school's \"one act play competition.\" The victory was small and seemingly insignificant, but it was enough to inspire Parker to \"give this acting thing a shot.\" With the encouragement of his drama teacher, Parker decided to take acting more seriously, and thus his senior year became a whirlwind of preparing for college while juggling theater and football. Upon graduation Parker packed his bags and headed to Los Angeles for college. But when he got to LA he decided to drop out of school before he even started and dove head first into the entertainment industry; in other words headshots, acting class, and background work. Parker's break came when he booked the role of \"Ryan Shay\" on ABC's hit show Suburgatory, the hyperactive jock neighbor to Jeremy Sisto, and son of Ana Gasteyer and Chris Parnell. Following Suburgatory, Parker became a lead in the critically acclaimed Fox comedy, Enlisted, as the youngest of 3 brothers (Geoff Stultz and Chris Lowell) who are all soldiers in the US Army. In the film world, Parker starred in the Flower Films produced \"Animal\" and the upcoming indie \"Fourth Man Out.\" Parker resides in Los Angeles and enjoys staying active in a variety of different ways including rock climbing, Krav Maga, yoga, and camping. When he's not breaking a sweat you will most likely find him at the beach, on his motorcycle, or reading at Barnes & Noble. That is if he's not off backpacking somewhere with no cell service.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWFlZWVjYTItNzM1OC00NzMyLTg2NTYtNmE3ZDUxM2I2ODA4XkEyXkFqcGdeQXVyMTY1MjYxMjU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2875233","name":"Parker Young","idIMDB":"nm2875233"},"actorId":"nm2875233","character":"Montana","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Laura Harring","urlProfile":"http://www.imdb.com/name/nm0005009","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDIxODk5MzE2Nl5BMl5BanBnXkFtZTgwMzI3NDYzMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1964","placeOfBirth":" Los Mochis, Sinaloa, Mexico","birthName":"Laura Elena Martínez Herring","height":"5' 6\" (1.68 m)","bio":"Ever since astounding audiences and critics with her breakthrough performance in David Lynch's award-winning Mulholland Drive (2001) for which she received an Alma Award, Laura Harring has been one of Hollywood's most versatile stars. The International Herald Tribune compared Laura to Ava Gardner, and film critic Roger Ebert likened her to Rita Hayworth, while The Cannes Film Festival's \"Nice Matin\" compared Laura's appearance to the sensation Marilyn Monroe caused when she first arrived. Laura went on to work opposite John Travolta in The Punisher (2004), William Hurt in The King (2005), and Emma Roberts in Nancy Drew (2007). \"Laurita\" as her family called her, got her first taste as an actor at the age of five, after playing an angel in the Christmas play, \"The Nativity Story\". Her pursuit of excellence was inspired by her grandfather Isauro Martinez Cairo, a world class athlete who, in 1954, became the National Champion in Fencing and Equestrian for Mexico. During her teen years, Laura studied abroad at the prestigious boarding school, Aiglon College, in Switzerland, one of the top schools in the world, where she graduated with an Academic Diploma. It was here that Laura met the brother of her future husband of two years, Count Carl Eduard von Bismarck, making her Contessa von Bismarck. After graduating from boarding school, she traveled the world and spent time as a social worker in India, performing manual labor and working to fix the soil erosion problem that hit the foothills of the Himalayas. Upon returning, Laura became the first Latina to win the Miss USA title, and, after being cast opposite Raul Julia in The Alamo: Thirteen Days to Glory (1987), her acting passion was re-sparked and Laura went on to become classically-trained at the famous London Academy of Performing Arts in which she relished playing Shakespeare. Laura played opposite Denzel Washington in John Q (2002), as well as Javier Bardem in New Line's Love in the Time of Cholera (2007), which was written by Nobel Prize winner Gabriel García Márquez and directed by Mike Newell. She gained 30 lbs. for her comedic role of \"Sara Noriega\". Other credits include The Caller (2008), which won the 2008 Tribeca Film Festival's \"Made In New York Best Narrative Feature Film Award\" and then the 2009 Grand Jury Award, at Outfest, for Outstanding Actress in the feature film Drool (2009), a dark comedy for which she also won Special Mention Female at the Gasparilla International Film Festival, among others. At her first Oscar appearance, Laura wore the million dollar shoes designed by Stuart Weitzman, making her the most photographed woman at then 2002 Oscars. Her more recent television work includes the critically-acclaimed The Shield (2002), Gossip Girl (2007) and Chasing Life (2014). Her European upbringing and travels made it easy for her to find a niche playing strong, upscale, matriarchal women. Her early social work instilled a strong sense of philanthropy and Laura has worked as a Goodwill Ambassador for the \"David Lynch Foundation\", supported \"Children Uniting Nations\", traveled to Africa with \"Stop Hunger Now\" and visited more than 100 nursing homes and hospitals in personal appearances. Her passions include dancing Tango, Salsa, Merengue, ballroom, and performing Commedia Dell' Arte in both Italian and French styles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDIxODk5MzE2Nl5BMl5BanBnXkFtZTgwMzI3NDYzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005009","name":"Laura Harring","idIMDB":"nm0005009"},"actorId":"nm0005009","character":"Lupe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Abby Elliott","urlProfile":"http://www.imdb.com/name/nm2212031","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA5NjEyOTMwOF5BMl5BanBnXkFtZTcwNjEzMjYzNA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1987","placeOfBirth":" New York City, New York, USA","birthName":"Abigail Elliott","height":"5' 7½\" (1.71 m)","bio":"Abby Elliott is the first second-generation cast member on Saturday Night Live (1975). Her father is Chris Elliott, who was featured on the show during the 1994-1995 season. She is also the granddaughter of veteran comic Bob Elliott, from the \"Bob and Ray Show\". Before coming to \"Saturday Night Live\", Elliot worked with current SNL cast member Michaela Watkins at LA's Groundling's Theater. Since her arrival on SNL, she has skillfully portrayed Angelina Jolie, Chloë Sevigny and Joan Cusack.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA5NjEyOTMwOF5BMl5BanBnXkFtZTcwNjEzMjYzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2212031","name":"Abby Elliott","idIMDB":"nm2212031"},"actorId":"nm2212031","character":"Trish","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matt Walsh","urlProfile":"http://www.imdb.com/name/nm0909768","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MDAyNzg4NF5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1964","placeOfBirth":" Chicago, Illinois, USA","height":"6' (1.83 m)","bio":"Matt Walsh was born on October 13, 1964 in Chicago, Illinois, USA. He is an actor and writer, known for Ted (2012), The Hangover (2009) and Due Date (2010). He has been married to Morgan Walsh since March 21, 2009. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1MDAyNzg4NF5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0909768","name":"Matt Walsh","idIMDB":"nm0909768"},"actorId":"nm0909768","character":"Washout","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Retta","urlProfile":"http://www.imdb.com/name/nm0802876","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyMTQ2MjQ5Ml5BMl5BanBnXkFtZTgwNzY3MDAxNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Marietta Sangai Sirleaf","bio":"Retta was born as Marietta Sangai Sirleaf. She is an actress, known for Parks and Recreation (2009), Fracture (2007) and Middle School: The Worst Years of My Life (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyMTQ2MjQ5Ml5BMl5BanBnXkFtZTgwNzY3MDAxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0802876","name":"Retta","idIMDB":"nm0802876"},"actorId":"nm0802876","character":"Sydney","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lamorne Morris","urlProfile":"http://www.imdb.com/name/nm2031358","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NjI2OTk0NF5BMl5BanBnXkFtZTgwMjg3MDEwMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Lamorne Morris is an American actor, comedian and television personality. He is best known for playing Winston in the Fox sitcom New Girl. As a game show host, he hosted the Cartoon Network game show BrainRush. He also worked for BET in the past. He is Originally from Chicago, before wanting to become an actor, Morris wanted to be a basketball player. Morris studied at College of DuPage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NjI2OTk0NF5BMl5BanBnXkFtZTgwMjg3MDEwMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2031358","name":"Lamorne Morris","nicknames":["TV's Lamorne"],"idIMDB":"nm2031358"},"actorId":"nm2031358","character":"Bobby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Williams","urlProfile":"http://www.imdb.com/name/nm0930282","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTY0Mjk2OF5BMl5BanBnXkFtZTcwNDYyMTkwNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 November 1967","placeOfBirth":" Westchester, New York, USA","birthName":"Christopher James Williams","height":"5' 10\" (1.78 m)","bio":"An extremely versatile performer in film, television and on stage, Chris is no stranger to the entertainment arena both on and off camera in both comedy and drama. Film credits include the \"The World's Fastest Indian\" playing Tina, a transvestite opposite Sir Anthony Hopkins \"The Joneses\" opposite Demi Moore as well as a lead in the classic comedy \"Dodgeball: A True Underdog Story\". Other credits include \"The Lottery Ticket\" \"Friday After Next\", \"Sex Ed\", \"'TRI\" and \"Jimmy Vestvood American Hero\". As for television, he can be seen starring in the new CBS series \"The Great Indoors\" and is recurring on the the FX show \"Better Things\", the and as Hoover on \"Silicon Valley\". Chris was a series regular in the NBC \"One Big Happy\" and on David E. Kelley's series \"The Wedding Bells\" for FOX and has recurred on the Showtime series \"DICE\" starring Andrew Dice Clay,\"Satisfaction\", \"Californication\", while making his mark as 'Krazee Eyez Killa' on \"Curb Your Enthusiasm\". He has guest starred on Ugly Betty, CSI: Miami, Hot in Cleveland, Monk, Weeds, and numerous other shows. Chris had also appeared multiple times on Late Night with David Letterman as the angry audience member and has an upcoming self help show \"Be a Better Man with Chris Williams\" which he created, stars in and produces. Chris has also lent his vocal talents to such animated series as The Boondocks and Word Girl and can be heard on several video games including multiple characters in Crash Bandicoot. Chris is a successful stand-up, he has performed at several top comedy clubs around the world including: Caesar's Palace, The Improv, The Comedy Store and The Venetian. His innovative routines are included in his character-rich one-man show \"Old Blue Eyes Is Black\" while also having studied with the Groundlings. Chris has been coaching other professional actors the craft of scene work as well as improvisation for over 15 years and speaks to children across the nation about the art of performing. A graduate of Georgetown University, he is a magician's member of the Academy of Magical Arts (The Magic Castle) and when not practicing as a 3rd degree black belt in Tae Kwon Do or running marathons to raise money for the American Diabetes Association and Eye Bank of New York, he is a board member of the charity Special Kids Network. Chris divides his time between Los Angeles and New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NTY0Mjk2OF5BMl5BanBnXkFtZTcwNDYyMTkwNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0930282","name":"Chris Williams","idIMDB":"nm0930282"},"actorId":"nm0930282","character":"Reverend Marcus Hamilton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ray Santiago","urlProfile":"http://www.imdb.com/name/nm0763631","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NzIxNTEwM15BMl5BanBnXkFtZTgwMTY2MTM0MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 June 1984","placeOfBirth":" Bronx, New York, USA","height":"5' 6\" (1.68 m)","bio":"Ray Santiago was born on June 15, 1984 in Bronx, New York, USA. He is an actor and producer, known for In Time (2011), Meet the Fockers (2004) and Girlfight (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NzIxNTEwM15BMl5BanBnXkFtZTgwMTY2MTM0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0763631","name":"Ray Santiago","nicknames":["Iago"],"idIMDB":"nm0763631"},"actorId":"nm0763631","character":"Hector","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Monika Casey","urlProfile":"http://www.imdb.com/name/nm2279345","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NzA1OTE3NF5BMl5BanBnXkFtZTgwMzM5ODYzMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Monika Casey is an actress and producer, known for Miles (2016), Sex Ed (2014) and CSI: Crime Scene Investigation (2000). She has been married to George Eads since August 17, 2011. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NzA1OTE3NF5BMl5BanBnXkFtZTgwMzM5ODYzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2279345","name":"Monika Casey","idIMDB":"nm2279345"},"actorId":"nm2279345","character":"Suzanne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin Hernandez","urlProfile":"http://www.imdb.com/name/nm3172776","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MTI1MzM3NF5BMl5BanBnXkFtZTcwMzM0MjE1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Kevin Hernandez is an actor from Los Angeles. Born in El Salvador in March 20. He began acting at a young age with commercials and eventually other work. At 13 he worked alongside Mel Gibson and the next year with Jonah Hill in the sitter. In the fantastic indie film Short Term 12 with Brie Larson. He is bilingual Spanish and English. He has supportive parents and one sister. He is in college pursuing a degree in Theatre.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MTI1MzM3NF5BMl5BanBnXkFtZTcwMzM0MjE1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3172776","name":"Kevin Hernandez","idIMDB":"nm3172776"},"actorId":"nm3172776","character":"Tito","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Parvesh Cheena","urlProfile":"http://www.imdb.com/name/nm1231867","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MzY5ODkxOF5BMl5BanBnXkFtZTcwMjEwMTE3Nw@@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1979","placeOfBirth":" Elk Grove, Illinois, USA","birthName":"Parvesh Singh Cheena","height":"5' 6\" (1.68 m)","bio":"Parvesh Cheena was born on July 22, 1979 in Elk Grove, Illinois, USA as Parvesh Singh Cheena. He is an actor and producer, known for Outsourced (2010), Transformers: Rescue Bots - Mission Protection! (2011) and Crazy Ex-Girlfriend (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MzY5ODkxOF5BMl5BanBnXkFtZTcwMjEwMTE3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1231867","name":"Parvesh Cheena","nicknames":["Parv, Parvey, Parvert, Par, Parro, Vesh"],"idIMDB":"nm1231867"},"actorId":"nm1231867","character":"Hank","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2751310","urlIMDB":"http://www.imdb.com/title/tt2751310","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 32 min (92 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.6","metascore":"34","filmingLocations":[{"location":"Tampa, Florida, USA"}],"awards":[],"votes":"4,083","type":"Movie","companyCreditsSimple":[{"idCompany":"co0527198","name":"Sweet Tomato Films"}],"keywords":{"keywords":["middle school","female nudity","punch in face","reference to stephen hawking","prostitute","vomiting on someone","low self esteem","domineering father","brother sister relationship","first menstruation","menstruation","landlady","caught having sex","sex comedy","sexual frustration","sexuality","fired from a job","sex education","teacher","classroom","reverend","reference to pubic hair","breasts","virginity","woman in underwear","character says i love you","police","feet on table","23 year old virgin","shemale","arrest","erection","puritan","fight","pill","male friendship","card playing","playing cards","playing football","vomiting man","vomiting","vulgar language","jealousy","self pity","man child","23 year old","mistaken for being gay","female hysteria","sadistic father","father son relationship","sitting on a toilet","table soccer","table football","talking about masturbation","boyfriend girlfriend relationship","crying girl","crying","beatboxing","playing guitar","bartender","bar","new teacher","hysteria","role playing","barefoot male","kinky sex","reference to eddie murphy","sex talk","virgin","male virgin","friend","friendship","roommate roommate relationship","bare chested male","sex scene","teenage girl","vulgarity","vulgar humor","teenage boy","teenager","adolescence","puberty","masturbation reference","banana","high school student","high school teacher","high school","hysterical woman","condom","rum","date","puritanism"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 01:00:11"}}