{"data":{"movies":[{"title":"Top Five","originalTitle":"","year":"2014","releaseDate":"20141212","directors":[{"name":"Chris Rock","id":"nm0001674"}],"writers":[{"name":"Chris Rock","id":"nm0001674"}],"runtime":"102 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNTg4ODM3OV5BMl5BanBnXkFtZTgwMTk0MjkxMzE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"A comedian tries to make it as a serious actor when his reality-TV star fiancée talks him into broadcasting their wedding on her TV show.","simplePlot":"A comedian tries to make it as a serious actor when his reality-TV star fiancée talks him into broadcasting their wedding on her TV show.","actors":[{"actorName":"Chris Rock","urlProfile":"http://www.imdb.com/name/nm0001674","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyNjM5MjgyNzdeQTJeQWpwZ15BbWU3MDAzMzUyODc@._V1.._UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1965","placeOfBirth":" Andrews, South Carolina, USA","birthName":"Christopher Julius Rock III","height":"5' 10\" (1.78 m)","bio":"Christopher Julius Rock was born in Andrews, South Carolina and raised in Bedford-Stuyvesant, Brooklyn, New York. He is the son of Rosalie (Tingman), a teacher and social worker for the mentally handicapped, and Julius Rock, a truck driver and newspaper deliveryman, whose own father was a preacher. Rock has been in stand-up comedy for several decades. He made his big screen debut in Beverly Hills Cop II (1987) and spent three years on the cast of Saturday Night Live (1975). He does commercials for 1-800 Collect and Nike and covered the presidential campaign for the show Politically Incorrect (1993). He lives in Alpine, New Jersey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyNjM5MjgyNzdeQTJeQWpwZ15BbWU3MDAzMzUyODc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001674","name":"Chris Rock","nicknames":["Chrissy"],"idIMDB":"nm0001674"},"actorId":"nm0001674","character":"Andre Allen","urlCharacter":"http://www.imdb.com/character/ch0405070","main":true},{"actorName":"Rosario Dawson","urlProfile":"http://www.imdb.com/name/nm0206257","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NjQ3NTYyNF5BMl5BanBnXkFtZTcwODU4NzQ4NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 May 1979","placeOfBirth":" New York City, New York, USA","birthName":"Rosario Isabel Dawson","height":"5' 7\" (1.7 m)","bio":"This stunning and resourceful actress has been primarily a film player thus far. Only recently has she been opening herself up more to doing television (the series Gemini Division (2008), which she executive-produced), and animated voice-overs. Dawson's powerhouse talent stands out the most in edgy, urban filming that dates back to 1995 when she was only sixteen. A rags-to-riches article entitled \"Rosario Dawson: From Tenement to Tinseltown\" probably says it all. Rosario was born in New York City on May 9, 1979. Her mother, Isabel Celeste, of Puerto Rican and Afro-Cuban descent, is a singer, and her stepfather, who raised her, Greg Dawson, of Irish descent, is a construction laborer. Her parents, who married when both were teenagers, eventually divorced. Rosario and her younger brother, Clay Dawson, had it hard while growing up and was cared for by family members, most of whom were poverty-stricken and some of whom were HIV-positive. Her career actually started as a child when she made a minor showing on the children's show, Sesame Street (1969). As the story goes, she was \"discovered\" as an adolescent on her front porch step by two photographers. One of them, Harmony Korine, was an aspiring screenwriter who thought the inexperienced sixteen-year-old was ideal for the controversial cult film Kids (1995), in which she would portray a sexually active adolescent. It took time for Rosario's film career to kick in after that, but by the late 1990s, she had nabbed several independent films. Since then, she has moved into main-stream hits (and misses) and has surprised viewers with her earthy, provocative, uninhibited approach to her roles. Reflecting New York's tougher, tawdrier side as assorted streetwalkers, homeless mothers, drug addicts, etc., her film highlights have included Light It Up (1999), Edward Burns' Sidewalks of New York (2001), Spike Lee's 25th Hour (2002) and Shattered Glass (2003). For Oliver Stone, she portrayed the duped bride of Colin Farrell's famed B.C. Macedonian warrior, Alexander (2004) (as in \"...the Great\"), which featured a notoriously violent-tinged nude/sex scene. Expanding her horizons beyond film, she has always expressed interest in singing. She hooked up with Prince for the re-release of his 1980s hit \"1999\" and appeared in The Chemical Brothers' video for the song \"Out of Control\" from the album \"Surrender\". She is also featured on the Outkast track, \"She Lives in My Lap\". On stage, she co-starred as Julia in a revival of \"Two Gentlemen of Verona\" at the Public Theater's \"Shakespeare in the Park\" and appeared in \"The Vagina Monologues\". She lucked into and got to show off her singing chops in the film adaptation of the hit New York musical Rent (2005), when Daphne Rubin-Vega, the original Mimi, became pregnant and was unable to reprise her exotic dancer role. Rosario also appeared as a prostitute in the adaptation of the graphic novel Sin City (2005). Of late, she has turned to producing. One of those, Descent (2007), had her playing a college coed who is brutally attacked and raped by a fellow student. Her more popular ventures have thus far included the role of Valerie Brown in the live-action version of the comic strip Josie et les Pussycats (2001), the Will Smith starrer Men in Black II (2002), Eagle Eye (2008) with Shia LaBeouf and Seven Pounds (2008), again with Smith, in which she offered one of her more tender-hearted performances as a woman with a potentially fatal heart condition. Off-camera, the still-single Dawson is highly active in political, social and environmental causes and has been involved with such organizations/charities/campaigns as the Lower East Side Girls Club, Global Cool, the O.N.E. Campaign, Oxfam, Amnesty International, Parents, Families and Friends of Lesbians and Gays, Control Arms, International Rescue Committee, Voto Latino (which she founded), Conservation International, Doctors Without Borders, National Geographic Society, The Nature Conservancy and Save the Children. In October 2008, she lent her voice to the RESPECT! Campaign, a movement aimed at preventing domestic violence.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NjQ3NTYyNF5BMl5BanBnXkFtZTcwODU4NzQ4NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0206257","name":"Rosario Dawson","idIMDB":"nm0206257"},"actorId":"nm0206257","character":"Chelsea Brown","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"J.B. Smoove","urlProfile":"http://www.imdb.com/name/nm1356578","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjI1NjI3NDQzOF5BMl5BanBnXkFtZTcwMzYzMDQ1NA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 December 1965","placeOfBirth":" Plymouth, North Carolina, USA","birthName":"Jerry Brooks","height":"6' 2\" (1.88 m)","bio":"J.B. Smoove was born on December 16, 1965 in Plymouth, North Carolina, USA as Jerry Brooks. He is an actor and writer, known for Date Night (2010), The Sitter (2011) and We Bought a Zoo (2011). He is married to Shahidah Omar.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjI1NjI3NDQzOF5BMl5BanBnXkFtZTcwMzYzMDQ1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1356578","name":"J.B. Smoove","idIMDB":"nm1356578"},"actorId":"nm1356578","character":"Silk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gabrielle Union","urlProfile":"http://www.imdb.com/name/nm0005517","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjUzMDM2Nl5BMl5BanBnXkFtZTcwNDgyMDY4Mg@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1973","placeOfBirth":" Omaha, Nebraska, USA","birthName":"Gabrielle Monique Union","height":"5' 7½\" (1.71 m)","bio":"Gabrielle Union was born on October 29, 1972, in Omaha, Nebraska, to Theresa (Glass), who managed a phone company, and Sylvester E. Union, a military sergeant and business executive. When she was eight, her family moved to Pleasanton, California, where she grew up and attended high school. In high school, Union was an all-star point guard and a year-round athlete participating in soccer, basketball, and track. She graduated from Foothill High School (Class of 1991). After high school, Gabrielle attended college at University of Nebraska, where she played on the soccer team; and then later transferred to Cuesta College. Eventually, she ended up at UCLA. On her way to law school, just planning on being a working stiff, things started to happen during her senior year. Gabrielle had a college internship at a L.A. modeling agency, she thought it would be an easy way to pick up some extra credits. Little did she know that clients were eyeing the help. Upon the completion of the internship, she was asked to become a client with the agency. Gabby thought of it as a great way to pay off a stack of college loans, and modeled until her agent found that she could actually act. Her first audition/job was landed without any headshots, on Saved by the Bell (1989). Since then, she has gone on to have many small but substantial film roles and has guest-starred on several hit TV shows, all before landing the role of \"Dr. Courtney Ellis\", on CBS' short-lived medical drama City of Angels (2000). Although she plays parts that are opinionated and strong, Gabrielle believes that, \"Hollywood needs to recognize all shades of African-American beauty.\" Gabrielle is a 1996 graduate of UCLA with honors in sociology.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjUzMDM2Nl5BMl5BanBnXkFtZTcwNDgyMDY4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005517","name":"Gabrielle Union","idIMDB":"nm0005517"},"actorId":"nm0005517","character":"Erica Long","urlCharacter":"http://www.imdb.com/character/ch0495659","main":true},{"actorName":"Romany Malco","urlProfile":"http://www.imdb.com/name/nm0539082","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NzUzODMyM15BMl5BanBnXkFtZTgwMjM0MTQ1MzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1968","placeOfBirth":" Brooklyn, New York, USA","birthName":"Romany Romanic Malco Jr.","height":"5' 8½\" (1.74 m)","bio":"The first American-born member of his West Indian family, Brooklyn-bred Romany Malco began his career at the age of seven, when he picked up a microphone and started rapping. As a teen he moved to Texas and formed the rap group R.M.G., and upon relocating to Los Angeles, the crew signed a deal to Virgin Records. The group's name was changed to College Boyz and their first big hit, \"Victim of the Ghetto,\" went to #1 on the rap charts. Malco was working as a music producer on The Pest (1997) starring John Leguizamo when the actor, impressed by Malco's dynamic personality, encouraged him to pursue acting. Malco's rapping background soon came in handy when he landed the lead in the VH-1 telepic, Too Legit: The MC Hammer Story (2001), Weeds (2005) opposite Mary-Louise Parker and Elizabeth Perkins. Romany was most recently seen on the big screen in the Universal hit The 40-Year-Old Virgin (2005). He has received critical praise for his star-turning performance, play Jay, the streetwise, trash-talking womanizer who sets the tone for the film's antics. Malco recently co-starred in the independent film Churchill: The Hollywood Years (2004) opposite Neve Campbell and Christian Slater.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NzUzODMyM15BMl5BanBnXkFtZTgwMjM0MTQ1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0539082","name":"Romany Malco","idIMDB":"nm0539082"},"actorId":"nm0539082","character":"Benny Barnes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hayley Marie Norman","urlProfile":"http://www.imdb.com/name/nm1190513","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMjk1NTgwNF5BMl5BanBnXkFtZTgwNjQ2Mjk2MzE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1984","placeOfBirth":" Thousand Oaks, California, USA","height":"5' 9\" (1.75 m)","bio":"Hayley Marie Norman is an American film and television actress. Hayley was born and raised in Agoura Hills, California, the daughter of a retired baseball player. Her father is African-American and her mother is of Russian, German, and distant Dutch, descent. On her mother's side, Hayley is the great-granddaughter of production manager/assistant director Gene Anderson, and the great-niece of actor Robert J. Anderson, who played young George Bailey in It's a Wonderful Life (1946), and of assistant director Gene Anderson Jr.. Hayley was chosen to be one of the few and highly distinguished California Arts Scholars, in which she was awarded a Governor's medallion, the highest distinction in California for artistically talented students. She received this honor an unprecedented two years in a row. Hayley continued her training and graduated from the American Academy of Dramatic Arts and the Upright Citizens Brigade honing her skills as both a dramatic actress and comedienne. She continues to perform with popular sketch and improv groups around town and enjoys putting up new material on the UCB main stage. Hayley had a memorable breakout performance in Chris Rock's Top Five (2014), proving she can hold her own among some of Hollywood's most iconic comedians. The film, released on December 12, 2014, became a hot commodity at the Toronto International Film Festival, prompting Paramount Studios to purchase it, including it in the DGA's annual The Contenders event and preparing Top Five for an awards run. In addition to her role in Top Five, this multitalented actress also co-produces and stars in the semi-scripted hit online series Hello Cupid. Drawing largely on her improv and comedy skills, the series follows longtime friends Robyn (Hayley Marie Norman) and Whitney as they experience the ups and downs of online dating. The series, now in its second season, has garnered critical acclaim and has been named an official selection at the TriBeCa Film Festival and one of the \"Top 5 Great Web Series You Should Be Watching Now\" by Vulture. After starring as a perky cheerleader in Sony Pictures Screen Gems' film Fired Up, she received rave reviews from Robert Ebert who declared her \"the most intriguing member of the cast.\" She's had recurring roles on television shows like Crash acting alongside one of her favorite actors, Dennis Hopper, as well as abc's Selfie and BET's long running The Game. Her other credits include Hancock, Our Family Wedding, Norbit, New Girl, Bones, The Exes, CSI: NY, CSI: Miami, Studio 60, and many more. A bonafide LA valley girl, one of Hayley's first jobs was as the Mattel's official \"face\" of the African American Barbie, and she later filled iconic role of Briefcase #25 model on Deal or No Deal. Hayley also has a role in Relativity Media's Beyond The Lights which is slated to hit theaters this November. Hayley is a huge fan of the blaxploitation genre and is a self proclaimed fan girl of Pam Grier. She also speaks frequently about the films of John Cassavetes and her admiration for both him and Gena Rowlands. She is a classically trained dancer and a long time vegan and animal rights activist.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMjk1NTgwNF5BMl5BanBnXkFtZTgwNjQ2Mjk2MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1190513","name":"Hayley Marie Norman","nicknames":["HMN","Minnie"],"idIMDB":"nm1190513"},"actorId":"nm1190513","character":"Tammy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anders Holm","urlProfile":"http://www.imdb.com/name/nm2981082","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NDg2NTU5NV5BMl5BanBnXkFtZTgwOTA0NzY4NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 3\" (1.91 m)","bio":"Anders Holm is an actor and writer, known for Workaholics (2011), The Intern (2015) and The Interview (2014). He has been married to Emma Nesper Holm since September 2011. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NDg2NTU5NV5BMl5BanBnXkFtZTgwOTA0NzY4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2981082","name":"Anders Holm","nicknames":["Ders"],"idIMDB":"nm2981082"},"actorId":"nm2981082","character":"Brad","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cedric the Entertainer","urlProfile":"http://www.imdb.com/name/nm0147825","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODQ1NTU5NV5BMl5BanBnXkFtZTcwNjMwMjY0NA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1964","placeOfBirth":" Jefferson City, Missouri, USA","birthName":"Cedric Antonio Kyles","height":"5' 6\" (1.68 m)","bio":"Cedric the Entertainer was born on April 24, 1964 in Jefferson City, Missouri, USA as Cedric Antonio Kyles. He is an actor and writer, known for Ice Age (2002), The Steve Harvey Show (1996) and Madagascar (2005). He has been married to Lorna Wells since September 3, 1999. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODQ1NTU5NV5BMl5BanBnXkFtZTcwNjMwMjY0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0147825","name":"Cedric the Entertainer","idIMDB":"nm0147825"},"actorId":"nm0147825","character":"Jazzy Dee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karlie Redd","urlProfile":"http://www.imdb.com/name/nm0507417","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM3MTMyNjc2OV5BMl5BanBnXkFtZTgwMDMzNTk2NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1966","placeOfBirth":" New York City, New York, USA","bio":"Karlie Redd was born on April 20, 1966 in New York City, New York, USA. She is an actress and director, known for Love & Hip Hop: Atlanta (2012), Top Five (2014) and Black Spring Break 2: The Sequel (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM3MTMyNjc2OV5BMl5BanBnXkFtZTgwMDMzNTk2NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0507417","name":"Karlie Redd","nicknames":["Karlie Redd"],"idIMDB":"nm0507417"},"actorId":"nm0507417","character":"Rhonda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin Barnett","urlProfile":"http://www.imdb.com/name/nm4519044","urlPhoto":"","biography":{"bio":"Kevin Barnett is an actor and writer, known for Top Five (2014), Friends of the People (2014) and Sleepwalk with Me (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4519044","name":"Kevin Barnett","idIMDB":"nm4519044"},"actorId":"nm4519044","character":"Columbia Student","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Genevieve Angelson","urlProfile":"http://www.imdb.com/name/nm3017448","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MDI5MDI5M15BMl5BanBnXkFtZTgwMjAxOTM1MDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1987","placeOfBirth":" New York City, New York, USA","birthName":"Genevieve Rose Angelson","bio":"Genevieve Angelson was born on April 13, 1987 in New York City, New York, USA as Genevieve Rose Angelson. She is an actress and writer, known for Top Five (2014), True Story (2015) and Backstrom (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MDI5MDI5M15BMl5BanBnXkFtZTgwMjAxOTM1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3017448","name":"Genevieve Angelson","idIMDB":"nm3017448"},"actorId":"nm3017448","character":"Columbia Student","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ben Cole","urlProfile":"http://www.imdb.com/name/nm6872375","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NTEwOTU3NV5BMl5BanBnXkFtZTgwMDUxNDcxMzE@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"bio":"Ben Cole is an actor, known for Top Five (2014), Moondog Airwaves (2015) and Finding Life (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NTEwOTU3NV5BMl5BanBnXkFtZTgwMDUxNDcxMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm6872375","name":"Ben Cole","idIMDB":"nm6872375"},"actorId":"nm6872375","character":"Columbia Student","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Corey Brown","urlProfile":"http://www.imdb.com/name/nm4460822","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMzU0NjU2NTVeQTJeQWpwZ15BbWU4MDcxMjgxMTkx._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"height":"6' 2½\" (1.89 m)","bio":"Corey Brown is an American film, television, and theater actor. He was born in New York, NY and raised mostly in New Jersey. He majored in theater at William Paterson University and his professional career began while he was still in school. Despite splitting his time between his acting course work and athletics, he managed to attend an audition for a small film role, at the encouragement of a casting director that had seen one of his performances. Soon afterwards, that audition led to other television and film roles. His passion for acting has continued to grow with his success and focus to become one of Hollywood's premiere talents.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMzU0NjU2NTVeQTJeQWpwZ15BbWU4MDcxMjgxMTkx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4460822","name":"Corey Brown","idIMDB":"nm4460822"},"actorId":"nm4460822","character":"Columbia Student","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maia Wilson","urlProfile":"http://www.imdb.com/name/nm6104921","urlPhoto":"","biography":{"bio":"Maia Wilson is an actress, known for Frozen (2013), Top Five (2014) and I Take Thee Zoe (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6104921","name":"Maia Wilson","idIMDB":"nm6104921"},"actorId":"nm6104921","character":"Woman with Confidence","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Teddy Coluca","urlProfile":"http://www.imdb.com/name/nm0173335","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNzI3NjYwMl5BMl5BanBnXkFtZTgwNTI2ODM3OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Teddy Coluca is an actor, known for The Amazing Spider-Man 2 (2014), Music of the Heart (1999) and We Own the Night (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNzI3NjYwMl5BMl5BanBnXkFtZTgwNTI2ODM3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0173335","name":"Teddy Coluca","idIMDB":"nm0173335"},"actorId":"nm0173335","character":"Maurice","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2784678","urlIMDB":"http://www.imdb.com/title/tt2784678","business":{"budget":{"money":"$12,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$25,277,561","country":"USA","day":"25","month":"01","year":"2015","remarks":""}],"weekendGross":[{"money":"$22,065","country":"USA","day":"25","month":"01","year":"2015","remarks":"16 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 42 min (102 min)"],"soundMix":["Datasat","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa"],"laboratory":null,"filmLength":null,"negativeFormat":["SxS Pro"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","ProRes 4:4:4 (2K) (source format)"],"printedFilmFormat":["D-Cinema"]},"rating":"6.4","metascore":"81","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"R","awards":[{"award":"African-American Film Critics Association (AAFCA) 2014","titlesAwards":[{"titleAwardOutcome":"Won AAFCA Award","categories":[{"category":"Top 10 Films","names":[]}]}]},{"award":"BET Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated BET Award","categories":[{"category":"Best Movie","names":[]},{"category":"Best Actor","names":[{"name":"Kevin Hart","id":"nm0366389","role":null},{"name":"The Wedding Ringer","id":"tt0884732","role":null},{"name":"Think Like a Man Too","id":"tt2239832","role":null},{"name":"Real Husbands of Hollywood","id":"tt2608368","role":null}]},{"category":"Best Actress","names":[{"name":"Gabrielle Union","id":"nm0005517","role":null},{"name":"With This Ring","id":"tt3908634","role":null},{"name":"Being Mary Jane","id":"tt2345481","role":null},{"name":"Think Like a Man Too","id":"tt2239832","role":null}]}]}]},{"award":"Black Film Critics Circle Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won BFCC Award","categories":[{"category":"Top Ten Films","names":[]}]}]},{"award":"Black Reel Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won Black Reel","categories":[{"category":"Outstanding Screenplay (Original or Adapted), Motion Picture","names":[{"name":"Chris Rock","id":"nm0001674","role":null}]}]},{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Outstanding Motion Picture","names":[{"name":"Scott Rudin","id":"nm0748784","role":null},{"name":"Eli Bush","id":"nm4791912","role":null}]},{"category":"Outstanding Actor, Motion Picture","names":[{"name":"Chris Rock","id":"nm0001674","role":null}]},{"category":"Outstanding Actress, Motion Picture","names":[{"name":"Rosario Dawson","id":"nm0206257","role":null}]},{"category":"Outstanding Director, Motion Picture","names":[{"name":"Chris Rock","id":"nm0001674","role":null}]},{"category":"Outstanding Ensemble","names":[{"name":"Victoria Thomas","id":"nm0859625","role":null}]},{"category":"Outstanding Original Song","names":[{"name":"Ahmir-Khalib Thompson","id":"nm0859821","role":"performer, writer"},{"name":"Eliza Colby","id":"nm6995107","role":"performer, writer"}]}]}]},{"award":"Broadcast Film Critics Association Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Critics Choice Award","categories":[{"category":"Best Comedy Movie","names":[]},{"category":"Best Actor in a Comedy Movie","names":[{"name":"Chris Rock","id":"nm0001674","role":null}]},{"category":"Best Actress in a Comedy Movie","names":[{"name":"Rosario Dawson","id":"nm0206257","role":null}]}]}]},{"award":"Casting Society of America, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Outstanding Achievement in Casting - Studio or Independent Feature - Comedy","names":[{"name":"Victoria Thomas","id":"nm0859625","role":null},{"name":"Matthew Maisto","id":"nm3518554","role":"associate"}]}]}]},{"award":"Denver Film Critics Society 2015","titlesAwards":[{"titleAwardOutcome":"Nominated DFCS Award","categories":[{"category":"Best Comedy Film","names":[]}]}]},{"award":"Hollywood Film Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won Hollywood Film Award","categories":[{"category":"Comedy of the Year","names":[{"name":"Chris Rock","id":"nm0001674","role":null}]}]}]},{"award":"Image Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Image Award","categories":[{"category":"Outstanding Supporting Actor in a Motion Picture","names":[{"name":"Cedric the Entertainer","id":"nm0147825","role":null}]},{"category":"Outstanding Writing in a Motion Picture","names":[{"name":"Chris Rock","id":"nm0001674","role":null}]}]}]},{"award":"Imagen Foundation Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Imagen Award","categories":[{"category":"Best Actress - Feature Film","names":[{"name":"Rosario Dawson","id":"nm0206257","role":null}]}]}]},{"award":"Las Vegas Film Critics Society Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won Sierra Award","categories":[{"category":"Best Comedy Film","names":[]}]}]},{"award":"MTV Movie Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best WTF Moment","names":[{"name":"Rosario Dawson","id":"nm0206257","role":null},{"name":"Anders Holm","id":"nm2981082","role":null}]},{"category":"Best Comedic Performance","names":[{"name":"Chris Rock","id":"nm0001674","role":null}]}]}]},{"award":"National Board of Review, USA 2014","titlesAwards":[{"titleAwardOutcome":"Won Spotlight Award","categories":[{"category":"","names":[{"name":"Chris Rock","id":"nm0001674","role":null}]}]}]},{"award":"Palm Springs International Film Festival 2015","titlesAwards":[{"titleAwardOutcome":"Won Creative Impact in Comedy Award","categories":[{"category":"","names":[{"name":"Chris Rock","id":"nm0001674","role":null}]}]}]}],"votes":"22,776","type":"Movie","companyCreditsSimple":[{"idCompany":"co0093463","name":"IAC Films"},{"idCompany":"co0352965","name":"Jax Media"}],"keywords":{"keywords":["interview","journalist","in medias res","reference to planet of the apes","sex talk","celebrity","bare breasts","addiction","alcoholism","stand up comedy","two word title","bechdel test failed","directed by star","title spoken by character","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:17:06"}}