{"data":{"movies":[{"title":"Out-Takes from the Life of a Happy Man","originalTitle":"","year":"2012","releaseDate":"20130425","directors":[{"name":"Jonas Mekas","id":"nm0577263"}],"writers":[],"runtime":"68 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDEzOTU0M2UtY2RhZi00MTFkLTkwZmMtMTlmM2NhNDdmMDgyXkEyXkFqcGdeQXVyMTk2MDc1MjQ@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Documentary"],"simplePlot":"","actors":[{"actorName":"Friedl Bondy","urlProfile":"http://www.imdb.com/name/nm5657593","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Friedl Bondy yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5657593","name":"Friedl Bondy","idIMDB":"nm5657593"},"actorId":"nm5657593","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Broughton","urlProfile":"http://www.imdb.com/name/nm0112687","urlPhoto":"","biography":{"dateOfBirth":"10 November 1913","placeOfBirth":" Modesto, California, USA","bio":"James Broughton was born on November 10, 1913 in Modesto, California, USA. He was a director and writer, known for The Pleasure Garden (1953), The Potted Psalm (1946) and Scattered Remains (1988). He died on May 17, 1999 in Port Townsend, Washington, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0112687","name":"James Broughton","nicknames":["Father of West Coast Independent Cinema"],"idIMDB":"nm0112687"},"actorId":"nm0112687","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William S. Burroughs","urlProfile":"http://www.imdb.com/name/nm0123221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzIyMTIxMzk5NF5BMl5BanBnXkFtZTcwMjYyNjg5Mw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1914","placeOfBirth":" St. Louis, Missouri, USA","birthName":"William Seward Burroughs","height":"6' 1\" (1.85 m)","bio":"William S. Burroughs, one of the three seminal writers of the Beat Generation (the other two being his friends Jack Kerouac and Allen Ginsberg), was born in St. Louis, Missouri, on February 5, 1914, to the son of the founder of the Burroughs Adding Machine Co. He grew up in patrician surroundings and attended private school in Los Alamos, New Mexico, chosen due to the climate as he suffered from sinus trouble (the school was later used to house the Manhattan Project during World War II)). Burroughs took his undergraduate degree at Harvard College (Class of 1936) but rebelled inwardly against the life that the upper-class Harvard man was supposed to lead during the pre-war period (outwardly he dressed the part of a patrician, with three-piece suit, necktie, black homburg and chesterfield overcoat being his standard wardrobe. His political options generally were also of his class, i.e., right-wing). Planning to become a physician, Burroughs moved to Germany to study medicine. The plight of the Jews under the Nazis was desperate, and in 1937 Burroughs agreed to marry Ilse Herzfeld Klapper, a German Jewish woman, so she could leave Germany and eventually become a U.S. citizen. The two remained friends for many years after they moved back to the U.S., meeting often for lunch when Burroughs eventually settled in New York City in the early 1940s. They never lived together, and Burroughs formally divorced her in 1946 so he could marry his second wife, Joan. Perhaps it was his exposure to National Socialism in Adolf Hitler's Germany that raised Burroughs' interest in his lifelong fascination: control mechanisms used by the state against its citizens. Burroughs left Germany for the United States without completing his studies, bringing along Ilse. A homosexual in an extremely homophobic age, back in the U.S. he drifted from job to job while continuing his education as an autodidact. He lived in Chicago, where he was an exterminator, which he claimed was the best job he ever had. While in Chicago he met the young Lucien Carr (later to be the father of best-selling novelist Caleb Carr, author of \"The Alienist\") and David Kammerer. Kammerer was a homosexual 14 years Carr's senior who had been his private school tutor and had stalked Carr obsessively afterward, following him from city to city. While Carr was disturbed by Kammerer's behavior, he was also immature and flattered by the attention, a moth attracted to the flame. When the moth got singed, he would fly away. Carr dropped out of the University of Chicago to attend Columbia in New York in order to escape Kammerer, and when Kammerer inevitably followed, Burroughs tagged along. Through Carr, Burroughs made the connections that would change his life: Columbia drop-out Kerouac, then in the Merchant Marine, and Columbia undergrad Ginsberg, then studying pre-law with the idea of becoming a labor lawyer. Intrigued by what he heard from Carr and Kammerer of Kerouac, he dropped in to see him at the apartment of Kerouac's girlfriend Edie Kerouac Parker, who shared the flat with Burroughs' future wife Joan. Before the momentous meet-up, Burroughs had begun experimenting with morphine when he acquired a stash of the drug to sell, and he subsequently became hooked. Long fascinated by \"low lifes\" and the vitality they retained while the rest of \"normal\" Americans seemed wan and dessicated (this was the Great Depression, after all), Burroughs began conducting field \"research\" into New York's demimonde, aided and abetted by Herbert Huncke, a junkie and thief whom Burroughs befriended and let share his apartment in lower Manhattan. With Huncke playing Virgil to his Dante, Burroughs met the \"low-lifes\" who would become part of his fiction as he journeyed through the rings of hell that was World War II New York. \"Sailor\", who showed up as a character in Le festin nu (1991), was a thief and drug dealer who once borrowed Burroughs' pistol and went out and shot a storekeeper to death (Sailor later hanged himself in jail after being arrested for an unrelated crime. He was known as an informer and had turned in a rival narcotics dealer--he was facing beatings, torture and possibly murder when he decided to take his own life). Soon Burroughs began to deal drugs in earnest in order to keep up with his own habit and fence merchandise himself, becoming part of a den of thieves that spilled over into Edie and Joan's apartment. The patrician Burroughs, with his high standards, prided himself on giving the best \"cut\" of heroin available, with personal home delivery to boot. Jack Kerouac first urged Burroughs to write. Burroughs spent a lot of time at the apartment Kerouac shared with Edie and Joan. He particularly liked to psychoanalyze Kerouac and Ginsburg, and enjoyed having them act out scenarios, little dramas in which they would play roles: Burroughs an old queen/con artist, Ginsburg her pimp, and Kerouac as the gullible young American, mouth agape in a foreign land, ripe for the plucking. Their imaginations were quite fertile, and it fed Kerouac and Ginsberg's writing. Burroughs had never really had any inclination to write until he met Kerouac, but he and Jack collaborated on a mystery novel they eventually entitled \"And the Hippos Were Boiled in Their Tanks,\" after the last sentence of a BBC-Radio report on a fire at the London Zoo. Each wrote alternating chapters, and after the book was complete, the manuscript was passed around among New York publishers. There were no takers, and for the time, Burroughs lost interest in writing. In 1945 Lucien Carr stabbed David Kammerer to death during a stroll along the bank of the Hudson River below Morningside Heights that was a notorious gay cruising area. After holding the dying man in his arms, Carr weighted down the body of his former tutor with rocks and disposed of it in the Hudson. In bloodied clothes, Carr sought out Burroughs, soliciting advice. Ignoring the elder's wise counsel to get a good lawyer and turn himself in, Carr then went to see Kerouac, who helped him dispose of the murder weapon and Kammerer's glasses. Both Burroughs and Kerouac were arrested (Burroughs as a material witness; Kerouac as an accessory after the fact), but eventually both were released without being prosecuted. Carr pleaded guilty to manslaughter and was sent off to the Elmira Reformatory, where he was incarcerated for two years. New York City became increasingly untenable as Burroughs became known to the police, so -- after he and Joan married -- they moved to Louisiana to become farmers. Their crop was marijuana, and eventually they moved on to Mexico, where living was cheaper and drugs easier to come by (and there was less hassle from police). In 1951, at a party in which they both were drunk, an exhibitionistic Burroughs shot and killed Joan in an alleged accident where he reportedly attempted to mimic the \"apple on the son's head\" scene from \"William Tell\". As the story is told, Joan put a glass of liquor on top of her head after Burroughs beseeched her to perform their William Tell trick for the guests. There had never been a William Tell trick, Burroughs later ruefully admitted, and Joan wound up with a .32 ACP slug in her head. Accounts of the death, which the Mexican police ruled a misadventure caused by a mistake in judgment, have never been entirely satisfactory. Like Lucien Carr before him, Burroughs may have consciously or subconsciously rid himself of a lover whom he no longer had any use for, or was piqued at. Burroughs at the time of the shooting was in love, involved in a heavy gay affair. After the death of Joan, Burroughs spent time journeying through Central and South America, looking for the drug called \"Yage\", which like peyote was rumored to offer a key to opening the doors of perception and heightening consciousness. He found it and distributed it among friends. In 1953 Allen Ginsburg managed to get Burroughs into print under the pen name \"William Lee.\" His autobiographical novel, \"Junkie\", was published by Ace Books (the son of the owner, Carl Solomon, was one of Ginsburg's friends) as a 35-cent paperback original (its formal title was \"Junkie: Confessions of an Unredeemed Drug Adict\", and it was published as \"Two Books in One\" back-to-back with another paperback original in the same volume). Returning to Mexico City, in the mid-'50s he began writing in earnest while keeping up with his drug habit, living off the small trust fund he received as a scion of the Burroughs family. It was in Mexico City that he began writing the sketches that would turn into his major book, \"Naked Lunch\". In 1956 he left Mexico City for Tangiers, Morocco, as the living was even cheaper than it was in Mexico City (as were the drugs). He eventually returned to the US in the 1960s. \"Naked Lunch\" has the distinction of being the last major book to be prosecuted for obscenity in the United States. The novel was written in Mexico City and Tangiers, crafted from fragments he wrote while addicted to heroin. After it was published in Paris by the Olympia Press in 1959, it quickly became notorious for its graphic descriptions of sexual encounters, sadism and murder, as well as its no-holds-barred use of language. Many stalwart defenders of the First Amendment drew the line at \"Naked Lunch\", stating that they did not fight the good fight to get James Joyce's \"Ulysses\" and the works of D.H. Lawrence and Henry Miller before the American public so that something like \"Naked Lunch\" could be published. Grove Press acquired the rights to the book, but it was not published until 1962, as the publishing house awaited the outcome of other obscenity trials, including one involving Allen Ginsberg's epic poem \"Howl\", which featured Burroughs as one of its hipsters searching for \"an angry fix\". Guided by Justice William J. Brennan, the U.S. Supreme Court starting in the late 1950s had relaxed censorship standards to protect literature that had redeeming social value, no matter that passages in the works were accused of being obscene. To be banned, a work had to be utterly without redeeming social value. Undaunted, the Comonwealth of Massachusetts successfully prosecuted the book as obscene. For the initial trial, Grove Press had gathered together an impressive list of \"experts\" such as Norman Mailer to defend the book, but Burroughs' modern classic initially lost, was declared obscene, and was banned in Massachusetts (a banned book would be destroyed, the copies already having been confiscated by the police). However, in 1966 the Massachusetts Supreme Court (in Memoirs v. Massachusetts) found that \"Naked Lunch\" was \"not without social value, and therefore, not obscene.\" With this ruling an era that began in the 1870s when anti-smut crusader Anthony Comstock led the charge for stricter enforcement of obscenity laws by the federal and state governments came to an end. By the late 1970s Burroughs had lived long enough to be hailed by critics and the public as a major American writer. He was embraced by punk rockers in New York and became an iconic figure by the 1980s. He died in 1997 at the age of 83.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzIyMTIxMzk5NF5BMl5BanBnXkFtZTcwMjYyNjg5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0123221","name":"William S. Burroughs","nicknames":["Il hombre invisible","Bill"],"idIMDB":"nm0123221"},"actorId":"nm0123221","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Foreman","urlProfile":"http://www.imdb.com/name/nm1374182","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Richard Foreman yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1374182","name":"Richard Foreman","idIMDB":"nm1374182"},"actorId":"nm1374182","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Frank","urlProfile":"http://www.imdb.com/name/nm0291071","urlPhoto":"","biography":{"dateOfBirth":"9 November 1924","placeOfBirth":" Zurich, Switzerland","bio":"Robert Frank was born on November 9, 1924 in Zurich, Switzerland. He is a director and cinematographer, known for Pull My Daisy (1959), Me and My Brother (1969) and Candy Mountain (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0291071","name":"Robert Frank","idIMDB":"nm0291071"},"actorId":"nm0291071","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Flo Jacobs","urlProfile":"http://www.imdb.com/name/nm2502036","urlPhoto":"","biography":{"bio":"Flo Jacobs is an actress, known for Momma's Man (2008), Sleepless Nights Stories (2011) and Out-Takes from the Life of a Happy Man (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2502036","name":"Flo Jacobs","idIMDB":"nm2502036"},"actorId":"nm2502036","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ken Jacobs","urlProfile":"http://www.imdb.com/name/nm0414499","urlPhoto":"","biography":{"dateOfBirth":"25 May 1933","placeOfBirth":" Williamsburg, Brooklyn, New York City, New York, USA","bio":"Ken Jacobs was born on May 25, 1933 in Williamsburg, Brooklyn, New York City, New York, USA. He is a director and editor, known for Star Spangled to Death (2004), Tom, Tom, the Piper's Son (1969) and Razzle Dazzle (2007). He is married to Flo Jacobs. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0414499","name":"Ken Jacobs","idIMDB":"nm0414499"},"actorId":"nm0414499","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Kubelka","urlProfile":"http://www.imdb.com/name/nm0473421","urlPhoto":"","biography":{"dateOfBirth":"23 March 1934","placeOfBirth":" Vienna, Austria","bio":"Peter Kubelka was born on March 23, 1934 in Vienna, Austria. He is a director and editor, known for Unsere Afrikareise (1966), Schwechater (1958) and Arnulf Rainer (1960).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0473421","name":"Peter Kubelka","idIMDB":"nm0473421"},"actorId":"nm0473421","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adolfas Mekas","urlProfile":"http://www.imdb.com/name/nm0083017","urlPhoto":"","biography":{"dateOfBirth":"30 September 1925","placeOfBirth":" Semeniskiai, Lithuania","bio":"In 1972, Adolfas joined the Film Department at Bard College, which had been founded in 1970 by Jon Rubin and a group of radical students. In the years before his academic tenure, Mekas was an active writer, scholar, and filmmaker. He co-founded (along with his brother Jonas) and edited \"Film Culture\" Magazine from 1953-1976. His extensive filmography includes \"Hallelujah the Hills\" and \"Going Home, \" a personal documentary about his journey to native country Lithuania, his first return since he and his brother survived the country's WWII Nazi invasion. With the continued blessing of St. Tula, the patron saint of cinema, Mekas continues to teach film at Bard College in the Hudson River Valley where he lives with his wife Pola Chapelle.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0083017","name":"Adolfas Mekas","idIMDB":"nm0083017"},"actorId":"nm0083017","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonas Mekas","urlProfile":"http://www.imdb.com/name/nm0577263","urlPhoto":"","biography":{"dateOfBirth":"24 December 1922","placeOfBirth":" Semeniskiai, Lithuania","bio":"Jonas Mekas, born December 24, 1922, Semeniskiai, Birzai, Lithuania, is a director, cinematographer, editor, writer, actor, poet, artist and publicist. More than 60 years of tireless work in film, arts and media has earned him the epithet \"The Godfather of American Avant-Garde Cinema\". In 1944 Jonas Mekas left Lithuania, with his brother Adolfas, because of the war. The both of them were imprisoned in a labor-camp in Elmshorn, Germany. After eight months they escaped to Denmark. By the end of 1949 the Mekas brothers emigrated to the U.S., settling in Williamsburg, Brooklyn, New York. Two weeks after his arrival, he borrowed the money to buy his first Bolex 16mm camera and began to record brief moments of his life. Soon he got deeply involved in the American Avant-Garde film movement. In 1954, together with his brother, he started Film Culture magazine, which soon became the most important film publication in the US. In 1958 Jonas Mekas began his legendary Movie Journal column in the Village Voice. In 1962 he founded the Film-Makers' Cooperative, and in 1964 the Film-Makers' Cinematheque, which eventually grew into Anthology Film Archives, one of the world's largest and most important repositories of avant-garde cinema, and a screening venue. Jonas Mekas film \"The Brig\" was awarded the Grand Prize at the Venice Film Festival in 1963. Other films include \"Walden\" (1969), \"Reminiscences of a Journey to Lithuania\" (1972), \"Lost Lost Lost\" (1975), \"Scenes from the Life of Andy Warhol\" (1990), \"Scenes from the Life of George Maciunas\" (1992), \"As I was Moving Ahead I saw Brief Glimpses of Beauty\" (2000), \"Letter from Greenpoint\" (2005), \"Sleepless Nights Stories\" (2011) and \"Out-takes from the Life of a Happy Man\" (2012). In 2007, he completed a series of 365 short films released on the internet -- one film every day -- and since then has continued to share new work on his website. He currently lives and works in New York City.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0577263","name":"Jonas Mekas","idIMDB":"nm0577263"},"actorId":"nm0577263","character":"Jonas Mekas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Oona Mekas","urlProfile":"http://www.imdb.com/name/nm1671544","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1ODM0OTcwOF5BMl5BanBnXkFtZTcwMjY3MTQ2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Oona was born and raised in New York City, the daughter of filmmaker and poet Jonas Mekas and Hollis Melton. As well as being an actor, she has played the violin since the age of four, and has just finished writing a children's book. She had the honor of studying with the late Fred Kareman in New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1ODM0OTcwOF5BMl5BanBnXkFtZTcwMjY3MTQ2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1671544","name":"Oona Mekas","idIMDB":"nm1671544"},"actorId":"nm1671544","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hollis Melton","urlProfile":"http://www.imdb.com/name/nm5657157","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Hollis Melton yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5657157","name":"Hollis Melton","idIMDB":"nm5657157"},"actorId":"nm5657157","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amy Taubin","urlProfile":"http://www.imdb.com/name/nm0851449","urlPhoto":"","biography":{"dateOfBirth":"10 September 1939","placeOfBirth":" New York City, New York, USA","bio":"Amy Taubin was born on September 10, 1939 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0851449","name":"Amy Taubin","idIMDB":"nm0851449"},"actorId":"nm0851449","character":"Herself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2877528","urlIMDB":"http://www.imdb.com/title/tt2877528","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 8 min (68 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.8","filmingLocations":[],"awards":[],"votes":"57","type":"Movie","companyCreditsSimple":[{"idCompany":"co0024000","name":"Anthology Film Archives"}],"keywords":{"keywords":["experimental","avant garde"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:36:42"}}