{"data":{"movies":[{"title":"Non-Stop","originalTitle":"","year":"2013","releaseDate":"20131129","directors":[{"name":"Richard Gabai","id":"nm0299923"}],"writers":[{"name":"Leland Douglas","id":"nm2109519"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NzQwMTE3N15BMl5BanBnXkFtZTgwMjI1NzUzMTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Mystery","Thriller"],"plot":"Dr. Halperin's assistant, who helped write a book which may influence world peace while exposing a dark brotherhood's plot, was left at the altar and leaves on holiday, carrying the only manuscript. Aboard, she awakes to find it missing with her other luggage, the start of a sinister series of events. Several people aboard are either criminals or help fight them off, especially hunky gentleman flight attendant Ronnie. But things aren't what they seem, so the fiends are in for scary surprises too.","simplePlot":"A woman, after being left at the altar, has a brief liaison with a handsome stranger on a plane which ultimately puts her and everyone else on the flight in terrible danger.","actors":[{"actorName":"Lacey Chabert","urlProfile":"http://www.imdb.com/name/nm0000327","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1Nzc3NzAwMl5BMl5BanBnXkFtZTcwNzY1ODk0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1982","placeOfBirth":" Purvis, Mississippi, USA","birthName":"Lacey Nicole Chabert","height":"5' 2\" (1.57 m)","bio":"Lacey Nicole Chabert was born in Purvis, Mississippi, to Julie (Johnson) and Tony Chabert, a representative for an oil company. She is of Cajun (French), Italian, English, and Scottish ancestry. Chabert started in drama and music performances in and around her hometown in Mississippi from an early age, and was a finalist on Star Search (1983) in 1991. She gained her break in a cough syrup commercial, before successfully auditioning for the Broadway production of Les Miserables, where she played young Cosette for two years. Since then, she has been on a few television series, notably Party of Five (1994), a number of telemovies like Gypsy (1993), and her big-screen debut, Lost in Space (1998). Known for her natural acting skills and charming personality, her cotton candy voice has seen her record many advertising jingles, plus play parts in animated films and TV shows like Nickelodeon's The Wild Thornberrys (1998). A more than capable violinist, she enjoys various activities, especially shoe shopping, and she is particularly fond of Cajun cooking. As a result of her promising career, her family, including two sisters and a brother, have moved from Mississippi to California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1Nzc3NzAwMl5BMl5BanBnXkFtZTcwNzY1ODk0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000327","name":"Lacey Chabert","idIMDB":"nm0000327"},"actorId":"nm0000327","character":"Amy Nightingale","urlCharacter":"http://www.imdb.com/character/ch0405264","main":true},{"actorName":"Drew Seeley","urlProfile":"http://www.imdb.com/name/nm1192060","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NDUyNDU1OV5BMl5BanBnXkFtZTcwNTkzMjg4OQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 April 1982","placeOfBirth":" Ottawa, Ontario, Canada","birthName":"Andrew Michael Edgar Seeley","height":"5' 11\" (1.8 m)","bio":"Drew Seeley grew up in Toronto where he first fell in love with performing. At age 11, he was cast in Hal Prince's revival of Showboat and stayed with the production for a year. Two years later, he got his first guitar, began writing songs, and hasn't looked back since. In 2005 Drew started working with established producer Ray Cham and together they wrote \"Getcha Head in the Game\" for Disney's quadruple platinum High School Musical soundtrack. This garnered them an Emmy nomination in the \"Best Original Song and Lyrics\" category. In addition, Drew co-starred in the North American and Latin American tours of \"High School Musical: The Concert\" playing in 60,000 seat arenas. Drew's song and video \"Dance with Me\", from the platinum Cheetah Girls 2 soundtrack, can be seen on the Disney Channel and he also appeared in Belinda Peregrin's music video \"Ni Freud, Ni Tu Mama\". He wrote and performed music for the Disney Channel Original Movie \"Jump In!\" starring Corbin Bleu, and his spin on America's 'Magic' was released on the \"Wizards of Waverly Place\" soundtrack. Drew also made a guest appearance on the Chipmunks CD \"Undeniable\", singing Shake Your Groove Thing with Alvin and the gang. He has recently been on a national tour performing original music from his debut album 'The Resolution' Drew's acting career has included guest starring roles on One Tree Hill, Dawson's Creek, Guiding Light, and more recently, Warner Premiere's Another Cinderella Story in which he stars as pop star Joey Parker opposite Selena Gomez. Drew also co-wrote and performs 4 songs in the film. One of these songs, New Classic, enjoyed a slot on Radio Disney's Top 10 countdown for 2 months, and the music video has surpassed 3 million views on YouTube. In 2009, Drew tried his hand at Broadway, taking on the role of Prince Eric in 'The Little Mermaid'. He was part of the show through the end of it's run, and recorded an alternate version of Prince Eric's song 'Her Voice' which was released on the DisneyMania 7 album. The music video for 'Her Voice' can also now be seen on YouTube. Additionally, Drew starred alongside 30 Rock's Katrina Bowden in the Adam Sandler produced film, The Shortcut, reunited with HSM alum Lucas Grabeel for the rock musical, 'I Kissed A Vampire', and portrayed the title character in the Hallmark Channel original movie, 'Freshman Father'. The film, which is based on a true story, also includes 'Best at the Time', co-penned by Drew. Most recently, Drew starred in the TBS series, Glory Daze, playing an aspiring politician named Jason Wilson. Drew resides in sunny Los Angeles and spends as much time at the beach as possible.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NDUyNDU1OV5BMl5BanBnXkFtZTcwNTkzMjg4OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1192060","name":"Drew Seeley","nicknames":["Drew"],"idIMDB":"nm1192060"},"actorId":"nm1192060","character":"Ronnie","urlCharacter":"http://www.imdb.com/character/ch0405265","main":true},{"actorName":"Will Kemp","urlProfile":"http://www.imdb.com/name/nm0962261","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjgxMzU1NjA0MF5BMl5BanBnXkFtZTgwNDQ2NzE0NzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1977","placeOfBirth":" Hertfordshire, England, UK","birthName":"William Kemp","height":"5' 11\" (1.8 m)","bio":"Will Kemp comes from an English family, including one brother and one sister. His father is a graphic designer and his mother is a former model. At age 9, Will's mother suggested that he take up a new hobby and attend dance classes. Dancing turned out to be his God-given talent! Eventually, hard work with Elizabeth Harrison FISTD earned Will a place into the Royal Ballet Seniors and later the Royal Ballet Upper Class. Finally, at age 17, Will auditioned for Matthew Bourne's impressive dance company, Adventures in Motion Pictures (AMP), and was accepted. Will then was cast for the original showing of Swan Lake, working his way up to the lead role of the Swan. During a performance as the Swan, Will was spotted by Paramount Studio head, Sherry Lansing - immediately, she \"was so smitten by his performance\" that she dubbed him the \"James Dean of Ballet\". Matthew Bourne continued to involve Will in his works, including Cinderella, Spitfire, The Car Man, and Play Without Words. In fact, as the lead role of the Pilot in Cinderella, he was nominated for a Los Angeles Critics Drama Award for Outstanding Featured Performer. In 2002, Will became a sensational hit when shakin' his booty in a GAP campaign for loose-fitted jeans \"For Every Generation\". In 2004, Will made his big screen debut in 'Stephen Sommer''s monster thriller, Van Helsing (2004), as the Werewolf. Up next is Renny Harlin's Profession profiler (2004), where Will plays an FBI trainee trying to solve a mock crime. As we look forward to seeing Will on the silver screen, he still pursues his dancing career onstage in England, managing both dancing and acting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjgxMzU1NjA0MF5BMl5BanBnXkFtZTgwNDQ2NzE0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0962261","name":"Will Kemp","nicknames":["James Dean of Ballet"],"idIMDB":"nm0962261"},"actorId":"nm0962261","character":"Mark","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Betsy Russell","urlProfile":"http://www.imdb.com/name/nm0751018","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3MzAwMjg2NTReQTJeQWpwZ15BbWU4MDIwMDU1MTkx._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1963","placeOfBirth":" San Diego, California, USA","birthName":"Elizabeth Russell","height":"5' 5\" (1.65 m)","bio":"Born in San Diego, California, Betsy Russell is best known for her starring role as \"Jill Tuck,\" the ex-wife of the Jigsaw Killer in the \"Saw\" film series. Russell was born into a family of educators--her father, iconic economist Richard Russell, has written a news letter\"about the stock market for over 60 years called \"Dow Theory Letters,\" and her grandfather, Max Lerner, was an author and syndicated columnist, said to be one of the great minds of our time. Russell seemed to be destined for greatness and decided to set the bar high for herself when making career moves and setting goals. At 16 years of age she landed her first real gig in the business, a Pepsi commercial in her hometown of San Diego, California. This sparked a fire within her, and she immediately made the move to Los Angeles to pursue acting full time. Russell landed her first TV role on the series The Powers of Matthew Star (1982) with one line. After that TV roles began to pour in, until she landed an audition for a film that would change her career: the cult classic Private School (1983). She booked the role on the spot, being cast as \"Jordon Leigh-Jensen,\" playing opposite her idol Phoebe Cates. The film launched Russell into Hollywood stardom, and she quickly became known as the \"it-girl\". Her scene riding a horse topless in slow motion made her an '80s icon. She continued to work steadily in film, starring in such films as Tomboy (1985), Avenging Angel (1985) and Cheerleader Camp (1988), and did guest-starring roles in such top-rated television series as The A-Team (1983), T.J. Hooker (1982) and Family Ties (1982). At the height of her career she met actor and tennis star Vincent Van Patten at The Playboy Mansion, where she visited frequently as her grandfather was a close friend of Hugh M. Hefner. Van Patten and Russell married in 1989 and had two beautiful boys. She decided to take a hiatus from acting, to focus on her family and raising her children. Van Patten and Russell divorced in 2001, and she decided to move to Malibu, California, to continue raising her family. Soon after her divorce she received a call from \"Saw\" producer Mark Burg about an upcoming role in the series. Russell jumped at the opportunity to work in one of the biggest horror franchises in the history of film, and returned to the screen starring as \"Jill Tuck\" in Lionsgate and Twisted Pictures' Saw III (2006), Saw IV (2007), Saw V (2008), Saw VI (2009) and Saw 3D: The Final Chapter (2010). Russell is an avid writer, has a huge passion for various charities, she holds a real-estate license and is a certified hypnotist. While she continues to love acting, she considers \"Spiritual Psychology\" and life coaching her other passion. She completed a three-year Masters program at The University of Santa Monica in this field, with an emphasis on consciousness health and healing, and hopes to help others with healing their issues and learning communication skills and has begun teaching workshops to actors on this subject.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3MzAwMjg2NTReQTJeQWpwZ15BbWU4MDIwMDU1MTkx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0751018","name":"Betsy Russell","idIMDB":"nm0751018"},"actorId":"nm0751018","character":"Gayle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Lipper","urlProfile":"http://www.imdb.com/name/nm0513598","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1NDg1MDAwNjReQTJeQWpwZ15BbWU3MDE1NTEyNzM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"David grew up in Montreal and moved to Los Angeles immediately after completing his BFA in Musical Theater from Emerson College in Boston. It didn't take long for one time head of Warner Brothers Television (now head of CBS), Leslie Moonvees, to recognize Lipper's ability for comedy. Lipper was quickly given the starring role in the Kaufman/Bright/Crane pilot, Reality Check, playing opposite a young Tiffany Thiessen, Giovani Ribisi, and 2 time Oscar winner, Hillary Swank. The other pilot Kaufman/Bright /Crane made that year was the mega hit Friends. When Reality Check didn't go, Moonvees put Lipper on the Warner Brothers hit show, Full House, where he played D.J.'s boyfriend, Viper, for that final season. Lipper also got to showcase his musical theater roots, by playing in the show's band, with John Stamos, and even playing live his own original music on the show. Eager to go against type and show his range, Lipper soon after played the rapist Jace in the hit NBC movie, She Fought Alone. Lipper has bounced around between playing hero and villain in both comedy and drama ever since. This year is no exception, where Lipper both reprized his role as Viper on the new Fuller House, and played the Nazi, Kurt, in the acclaimed Exodus To Shanghai. Fans will have to watch the new show, Frequency, to see where Lipper lands in his key recurring role on this new Warner Brothers/CW show.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1NDg1MDAwNjReQTJeQWpwZ15BbWU3MDE1NTEyNzM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0513598","name":"David Lipper","idIMDB":"nm0513598"},"actorId":"nm0513598","character":"Nicolas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bo Svenson","urlProfile":"http://www.imdb.com/name/nm0004149","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDczMDAxM15BMl5BanBnXkFtZTgwMjM5ODExNTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1941","placeOfBirth":" Gothenburg, Västra Götalands län, Sweden","height":"6' 5½\" (1.97 m)","bio":"An award-winning actor, writer, producer and director, Bo Svenson has during his career worked with over one hundred Academy Award winners and/or nominees. He is a prolific writer in addition to being an accomplished actor. His first novel, \"For Love and Country\", was published in December 2015 and is on Amazon's \"Recommended Reading\" list. His screenplay \"Don't Call Me Sir!\" won the 2015 New York Screenplay Contest's \"Park Avenue Prize for Drama\", 1st Place in Drama at the 2015 Los Angeles Screenplay Contest, Best Original Screenplay at the 2016 All Sports Los Angeles Film Festival, Best Screenplay at the 2016 Artemis Film Festival, and a Gold Award for Best Screenplay at the 2016 International Independent Film Festival. Another screenplay \"For Love and Country\" won two Gold Awards at the International Independent Film Awards and Best Screenplay at the 2016 Illinois Independent Film Festival. He has several other screenplays in various stages of development and pre-production, including \"Yakuzano\"; \"Misguided\"; \"Viking: The Red Cloth\"; and \"Fate, Two Kids and an ET\". Born in Sweden to a Russian Jewish mother and a Swedish father, Svenson emigrated by himself to the US as a teenager and began by serving his new country with six years in the U.S. Marines. After an honorable discharge, he was spotted in Miami by James Hammerstein Jr. and cast in a revival of \"South Pacific\". Curious to find out if acting was for him, he headed to New York where he landed the lead role as Yang Sun in Bertolt Brecht's play \"The Good Woman of Szechuan\" at The Circle In The Square Theater in Greenwich Village -- and cast in a starring role in the CBS TV pilot The Freebooters. Other starring roles followed, as well as a recurring role as Big Swede on \"Here Come the Brides\". His role as the Creature in the three-hour TV movie \"Mary Shelley's Original Frankenstein\" brought him great acclaim and led to a starring role in \"Maurie\" and the co-starring role with Robert Redford in \"The Great Waldo Pepper\". Major starring roles followed: Sheriff Buford Pusser in \"Walking Tall Part II\", \"Walking Tall Final Chapter\" and the \"Walking Tall\" TV series; crazed football player Jo Bob in \"North Dallas Forty\"; heroic airline pilot Captain Campbell in \"The Delta Force\"; jealous bar-owner Roy Jennings in Clint Eastwood's \"Heartbreak Ridge\"; and cold-blooded killer Ivan in \"Magnum, P.I.\" In addition to recently being the Russian mob boss Vadim in \"Icarus\", he portrayed Reverend Harmony in Quentin Tarantino's \"Kill Bill\" and The Colonel in Tarantino's \"Inglourious Basterds\". He was the only actor from the original \"The Inglorious Bastards\" cast included by Tarantino in his homage to that movie, one of his all-time favorites. An accomplished athlete, he has competed in world championships, Olympic selections and/or international competition in judo, yachting, track, and ice hockey -- and he drove NASCAR. A black belt in judo, karate, and aikido, he has been inducted into the Martial Arts Masters Hall of Fame. He retired from judo competition after winning a silver in the 2009 USA Judo National Championships, a bronze in the IJF World Judo Masters Championships, and a gold in the 2013 USJA Winter Nationals. He was recently Sports Commissioner at the Special Olympics World Games: 2015 LA -- held at his alma mater UCLA where he had pursued a Ph.D. in metaphysics until his film career took over. He is president and CEO of MagicQuest Entertainment, a California corporation engaged in international motion picture and television development, production, and branded advertainment since 1975. MagicQuest also provides consulting service to actors and writers. In addition, he is CEO of CanAm Film Corporation, a British Columbia corporation incorporated in 1992. A member of the Academy of Motion Picture Arts and Sciences (Oscar.org) since 1985, he serves on the nominating committee for Best Foreign Language Film and is a juror on the Student Academy Award committee. He was Chairman of the Board and CEO of the Motion Picture Group of America from 1984-2004. His numerous honors and nominations include Lifetime Achievement Awards from Action On Film, the Movieville International Film Festival, and The Reel Cowboys Hall of Fame; the NAACP Image Award Nomination; the Academy of Science Fiction and Fantasy Golden Scroll Award; the Hollywood Women's Press Club Golden Apple; the Screen Actors Guild Award for Outstanding Performance by a Cast for Inglourious Basterds; and the Italian Institute of Art Award of Merit. His short film, \"Made For Each Other\" -- that he wrote, produced and directed starring Dennis Hopper -- was nominated for Best Short at numerous festivals and won the Award of Excellence at the Accolade Global Film Competition. He conducts \"Acting for Life - Be All You That You Can Be\" seminars in colleges, universities and corporate boardrooms around the globe.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDczMDAxM15BMl5BanBnXkFtZTgwMjM5ODExNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004149","name":"Bo Svenson","idIMDB":"nm0004149"},"actorId":"nm0004149","character":"Dr. Halperin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amy Davidson","urlProfile":"http://www.imdb.com/name/nm0203221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODY1ODI5NTg3Nl5BMl5BanBnXkFtZTgwNTAwOTM0OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1979","placeOfBirth":" Phoenix, Arizona, USA","height":"5' (1.52 m)","bio":"Radiating the screen with her engaging presence and captivating talent, Amy Davidson has quickly become one of Hollywood's most intriguing young actresses. Born in Phoenix, Arizona, Davidson discovered her love for entertaining when her parents enrolled her in dance classes as a young child. As a member of the award-winning dance production company, \"Dance Motion\", Davidson sharpened her skills for ballet, point, hip hop and modern dancing. After years of captivating audiences at national dance competitions and annual \"Dance Motion\" productions, the seasoned performer developed an affinity for acting. During her last years in high school, Davidson was introduced to an agent and soon began doing commercial work. She also began mentoring with acting coach Gene Fowler, who recognized her talent and encouraged her to move to Hollywood to further her acting career. Davidson took his advice and, without having any connections in the entertainment industry, she packed her belongings and headed west. Upon arriving in Los Angeles, Davidson continued to study her craft with a variety of coaches, each offering their own unique acting style. As a result of her perseverance and discipline, Davidson soon landed a recurring role as \"Cammie Morton\" in the Mary-Kate Olsen-Ashley Olsen series, So Little Time (2001), for ABC Family. She also guest-starred on the drama series, Judging Amy (1999), and appeared in Lifetime's original movie, The Truth About Jane (2000), prior to landing 8 Simple Rules (2002). Despite her active schedule, Davidson finds time to enjoy a variety of activities that keep her physically fit, such as running, weight training, hiking, boxing and snow skiing. She continues to keep her spirit of dance alive by attending classes at \"Cardio Barre\", a workout studio where exercisers can experience a high energy, aerobic class done at a ballet barre. In order to improve her \"jam sessions\" in the car, she recently began taking voice lessons. Davidson recently wrapped production in a starring role opposite television veterans Betty White and Richard Thomas in Annie's Point (2005), a Hallmark Channel original movie. Davidson portrayed \"Ella Eason\", a 19-year-old college dropout who agrees to travel cross country with her grandmother (White) in order to spread her grandfather's ashes in a significant spot - \"Annie's Point\". She co-starred on ABC's family comedy \"8 Simple Rules\" from 2002 to 2005, with an ensemble cast that included James Garner, Katey Sagal and David Spade. She played the cute middle child, \"Kerry Hennessy\", who is a confident and intelligent teenager who knows that she does not need to pretty herself up in order to succeed. In its second season, the Hennessy family faced the heart-wrenching task of moving on with their lives after the tragic death of \"Paul\", their beloved patriarch (John Ritter). Davidson currently resides in Los Angeles, where's she recently purchased a new home.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODY1ODI5NTg3Nl5BMl5BanBnXkFtZTgwNTAwOTM0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0203221","name":"Amy Davidson","idIMDB":"nm0203221"},"actorId":"nm0203221","character":"Sharon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Veronica Cartwright","urlProfile":"http://www.imdb.com/name/nm0001021","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg2NDE0MDkyOV5BMl5BanBnXkFtZTgwMDI1MzUyMDI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1949","placeOfBirth":" Bristol, England, UK","birthName":"Veronica A. Cartwright","height":"5' 6\" (1.68 m)","bio":"Born in Bristol, England, Veronica is the older sister of the popular child actress Angela Cartwright. In her early career, Veronica was cast in a number of popular movies such as The Children's Hour (1961), Spencer's Mountain (1963) and Alfred Hitchcock's The Birds (1963). As such, she was cast as \"Jemima Boone\" in the popular television series Daniel Boone (1964), which ran from 1964 to 66. Her career after \"Daniel Boone\" may have been influenced by Hitchcock, since she appeared in both the remake of Invasion of the Body Snatchers (1978) and the horror classic Alien (1979). On television, she appeared twice as Lumpy's younger sister, \"Violet Rutherford\" and once as \"Peggy MacIntosh\" on Leave It to Beaver (1957) and had a small role in the television movie Still the Beaver (1983). Cartwright also appeared in Robert Kennedy and His Times (1985), Tanner '88 (1988) and had a recurring role on L.A. Law (1986). Her big screen features included The Right Stuff (1983), Flight of the Navigator (1986) and The Witches of Eastwick (1987). Veronica worked on the stage in \"Electra\", \"Talley's Folly\", \"Homesteaders\", \"Butterflies are Free\" and \"The Triplet Connection\". Alternating between television and big screen movies in the 90s, Cartwright has appeared in such films as Hitler's Daughter (1990) and Candyman: Farewell to the Flesh (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg2NDE0MDkyOV5BMl5BanBnXkFtZTgwMDI1MzUyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001021","name":"Veronica Cartwright","idIMDB":"nm0001021"},"actorId":"nm0001021","character":"Rose","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim O'Heir","urlProfile":"http://www.imdb.com/name/nm0641389","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk3NTgwODc5Nl5BMl5BanBnXkFtZTcwMjczNTEzNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1962","placeOfBirth":" Chicago, Illinois, USA","bio":"Jim O'Heir was born on February 4, 1962 in Chicago, Illinois, USA. He is an actor, known for Parks and Recreation (2009), Seeking a Friend for the End of the World (2012) and Accepted (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk3NTgwODc5Nl5BMl5BanBnXkFtZTcwMjczNTEzNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641389","name":"Jim O'Heir","idIMDB":"nm0641389"},"actorId":"nm0641389","character":"Howard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Avery Phillips","urlProfile":"http://www.imdb.com/name/nm4185974","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MjI2MTY5NF5BMl5BanBnXkFtZTgwMTYwNjQ2NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Avery Brynne Phillips","height":"4' 7\" (1.4 m)","bio":"Avery Phillips was born as Avery Brynne Phillips. She is an actress, known for Stockholm, Pennsylvania (2015), Rock the Kasbah (2015) and Non-Stop (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1MjI2MTY5NF5BMl5BanBnXkFtZTgwMTYwNjQ2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4185974","name":"Avery Phillips","idIMDB":"nm4185974"},"actorId":"nm4185974","character":"Hailey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gigi Feshold","urlProfile":"http://www.imdb.com/name/nm4483825","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwODczMzMyMF5BMl5BanBnXkFtZTgwNjA5NDA2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7½\" (1.71 m)","bio":"Gigi Feshold is an actress, known for Paranormal Activity: The Marked Ones (2014), Non-Stop (2013) and Asura (2018).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwODczMzMyMF5BMl5BanBnXkFtZTgwNjA5NDA2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4483825","name":"Gigi Feshold","idIMDB":"nm4483825"},"actorId":"nm4483825","character":"Greta","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Kyson","urlProfile":"http://www.imdb.com/name/nm1645304","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGY4MWZjYTgtZjNiOC00NjcxLThhYzItM2NlMzYyMjk0YjM0XkEyXkFqcGdeQXVyMjg1MTM3MA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1975","placeOfBirth":" Seoul, South Korea","height":"5' 10\" (1.78 m)","bio":"Voted by TV Guide as \"Hollywood's 25 Hottest\", James recently finished filming Criminal Minds: Beyond Borders, NCIS:LA (CBS), the new HBO show Animals, the new sitcom School of Rock (Nickelodeon), and recurring on the FX drama Justified. He will next be appearing in FOX's hit series Sleepy Hollow, recently appeared in Hawaii Five-O, and is beloved to many for his 4-year run on NBC's Heroes as 'Ando'. James will be in two feature films released later this year: Another Time (Romantic Comedy), and The Livingston Gardener (Thriller). He also recently wrapped the feature Banana Season, where he had to train as a Mixed Martial Arts fighter for six weeks. A native of NYC, James graduated from Bronx H.S. of Science, then went on to study communications & broadcasting at Boston University, and New England Institute of the Arts. After a stint in a hip-hop group in college, and trying out improv comedy, James moved to LA on a one-way ticket & a single suitcase, where he began his training in music, dance, and acting. His first ever Television audition landed him on CBS's J.A.G. Other TV credits include CSI, NBC's Las Vegas, the West Wing, Heist, as well as ABC's Threat Matrix, & CW's All about the Andersons. A world traveler & adrenalin-junkie, James once bungee jumped 8 times in one day in Cairns, Australia, slid down waterfalls in Queenstown, New Zealand, scuba dived into caves in Maui, Hawaii, and deep water solo'ed at the island of Ko Phi Phi, Thailand - where he back-flipped for the first time 50 feet high off a limestone cliff. He & his wife Jamee also just ran the 2016 LA Half Marathon. James plays basketball for The Hollywood Knights, a charity celebrity team, and participated in Robbie Williams' Soccer Aid for UNICEF, at Manchester United's Old Trafford in England. He is also an Ambassador for the International Organization Good Neighbors, and their Water for Life campaign.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGY4MWZjYTgtZjNiOC00NjcxLThhYzItM2NlMzYyMjk0YjM0XkEyXkFqcGdeQXVyMjg1MTM3MA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1645304","name":"James Kyson","nicknames":["Kyson"],"idIMDB":"nm1645304"},"actorId":"nm1645304","character":"Kevin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brandon Beemer","urlProfile":"http://www.imdb.com/name/nm0066447","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2Mjc3MTQyNV5BMl5BanBnXkFtZTcwMzQ2MzA3OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1980","placeOfBirth":" Eugene, Oregon, USA","birthName":"Brandon Richard Beemer","height":"6' (1.83 m)","bio":"Brandon Beemer was born on February 27, 1980 in Eugene, Oregon, USA as Brandon Richard Beemer. He is an actor, known for Amour, gloire et beauté (1987), Days of Our Lives (1965) and Material Girls (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2Mjc3MTQyNV5BMl5BanBnXkFtZTcwMzQ2MzA3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0066447","name":"Brandon Beemer","idIMDB":"nm0066447"},"actorId":"nm0066447","character":"Dean","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Micah Alberti","urlProfile":"http://www.imdb.com/name/nm1226767","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMTQ0NzY2ODBeQTJeQWpwZ15BbWU3MDg2MzczMTU@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1984","placeOfBirth":" Oregon, Wisconsin, USA","height":"5' 9\" (1.75 m)","bio":"Micah Alberti was born on August 19, 1984 in Oregon, Wisconsin, USA. He is an actor, known for Wildfire (2005), American Pie Presents: Band Camp (2005) and Forget Me Not (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMTQ0NzY2ODBeQTJeQWpwZ15BbWU3MDg2MzczMTU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1226767","name":"Micah Alberti","idIMDB":"nm1226767"},"actorId":"nm1226767","character":"Peter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larry Poindexter","urlProfile":"http://www.imdb.com/name/nm0223315","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4NjkyMDg4NF5BMl5BanBnXkFtZTgwOTIxMTU4MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 December 1959","placeOfBirth":" Dallas, Texas, USA","birthName":"Lawrence Thomas Poindexter","bio":"The son of Tony Award winning lighting and set designer H.R. Poindexter, began acting in college, first appearing in summer stock in his native Texas, prior to moving with his family to Los Angeles (after spending a number of years in New York). First jobs in Los Angeles were with Franklin R. Levy and Catalina Production Group (which included a young producer named Leslie Moonves), as both an actor and production co-coordinator. Has been nominated for Los Angeles Ovation and LA Weekly awards for theatre work as well as having produced numerous theatre pieces in Los Angeles. He played with his band \"The High LOnesome\" for a number of years throughout the Southwest before landing a recording deal with local indie label, Spark Records. He has also composed for short films and placed numerous songs in features and is the co-author of a new rhythm and blues musical \"The Devil You Know\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4NjkyMDg4NF5BMl5BanBnXkFtZTgwOTIxMTU4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0223315","name":"Larry Poindexter","idIMDB":"nm0223315"},"actorId":"nm0223315","character":"Captain Collins","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2857160","urlIMDB":"http://www.imdb.com/title/tt2857160","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.8","filmingLocations":[],"rated":"TV-14","awards":[],"votes":"542","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0060230","name":"Check Entertainment"},{"idCompany":"co0425327","name":"Non-Stop"}],"keywords":{"keywords":["plane","hyphen in title","missing person","airplane","disappearance","undercover","ritual","false identity","kidnapping","knife","theft","contraband"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:13:17"}}