{"data":{"movies":[{"title":"Zhivaja mishen","originalTitle":"","year":"1990","releaseDate":"1990","directors":[{"name":"Mark Aizenberg","id":"nm0014947"}],"writers":[],"countries":["Soviet Union"],"languages":["Russian"],"genres":["Crime"],"simplePlot":"","actors":[{"actorName":"Aleksandr Abdulov","urlProfile":"http://www.imdb.com/name/nm0008311","urlPhoto":"","biography":{"dateOfBirth":"29 May 1953","placeOfBirth":" Tobolsk, Tyumen Oblast, Russian SFSR, USSR [now Russia]","birthName":"Aleksandr Gavrilovich Abdulov","height":"6' 2\" (1.88 m)","bio":"Aleksandr Abdulov, one of Russian cinema's best known sex symbols and was one of the most celebrated Russian film stars. He was born Aleksandr Gavrilovich Abdulov on May 29, 1953, in Tobolsk, Siberian Russia, into the family of a theatre director from Fergana, Uzbekistan. His father, named Gavriil Abdulov was a wounded veteran of the Second World War decorated for his courage at the front-line tank battles against the Nazis. Abdulov's mother was a make-up artist at several Russian theatres. Young Abdulov grew up in Uzbekistan, where he finished high school and also became the Master of Sports in fencing. He was admitted to a local college where he had the chance of becoming a sports coach. His dream of becoming an actor was almost ruined when he failed the admission tests at the Moscow State Institute of Theatrical Arts (GITIS). He could not go back to Uzbekistan so he stayed in various gloomy dorms in Moscow, working hard labor jobs at railway stations just to survive. He then studied acting at GITIS, made very little money working as an extra, and still was a hard laborer in order to pay for his living in Moscow. In 1975 he graduated from GITIS and was hired by the Lenkom Theatre director Mark Zakharov. Abdulov revealed the full range of his talent in popular films An Ordinary Miracle (1979) and S lyubimymi ne rasstavaytes (1980). The public adored Abdulov and he became the first big sex-symbol in the former USSR. Millions of his pictures has been decorating homes and student dorms in every big and small town of the former Soviet Union. The public loved Abdulov - the actor and the man - for his sincere talent and for his devotion to his ideas. He played his best roles under the direction of Mark Zakharov in such films as 'Obyknovennoe Chudo (1978), 'Tot samyi Munchgausen (1979), 'Formula Lyubvi' (1984), and Ubit drakona (1989). His best film partners were Oleg Yankovskiy, Evgeniy Leonov, Vyacheslav Tikhonov, Evgeniy Evstigneev, Leonid Bronevoy, Andrey Mironov, Irina Kupchenko, Leonid Yarmolnik, Semyon Farada, Aleksandr Zbruev, Sergey Nikonenko, Irina Alfyorova and others. This ensemble of fine actors and directors evolved into a special and uniquely Russian milieu, where Abdulov's multifaceted talent was supported by other actors. His range and nuanced acting reached a new level in the films made in the late 1980s and 1990s. Abdulov created powerful roles in a tandem with the masterful Innokentiy Smoktunovskiy in the innovative film 'Geniy' (1991) by director Viktor Sergeev. At that time, Abdulov also received a Nika Award nomination for supporting role in Sukiny deti (1991) by director Leonid Filatov. Abdulov made two equally interesting works in collaboration with director Sergey Solovev in 'Chyornaya roza - emblema pechali, krasnaya roza - emblema lyubvi' (1989) and in 'Dom pod zvyozdnym nebom' (1991). Both works were awarded, acclaimed by critics, and loved by the public. Abdulov showed his gift for transformation in the devilish character Korov'ev in 'Master i Margarita' (2005), a TV-series from director Vladimir Bortko based on the eponymous book by Mikhail A. Bulgakov. Abdulov's energy helped the film making him the most lively nerve in the group of 'super stars' (some say super old stars). His acting became more classic and restrained in the traditionally Russian period-film 'Anna Karenina' (2005) based on the eponymous novel by Leo Tolstoy from director Sergey Solovev. Later Abdulov worked with director Aleksandr Buravskiy in the epic film Leningrad (2009), about the historic siege during the Second World War; where his acting partners were Gabriel Byrne, Mira Sorvino, Kirill Lavrov, Mikhail Efremov, Donatas Banionis and other notable actors. Aleksandr Abdulov was designated People's Artist of Russia. He received numerous awards and nominations for his performances in film and on stage. He was a permanent member of the troupe at Lenkom Theatre in Moscow. He also directed several films as well as stage productions. Aleksandr Abdulov died of lung cancer, on January 3, 2008, and was laid to rest in Vagankovskoe cemetery in Moscow, Russia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0008311","name":"Aleksandr Abdulov","idIMDB":"nm0008311"},"actorId":"nm0008311","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Donatas Banionis","urlProfile":"http://www.imdb.com/name/nm0052023","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3NzgwNDU2Ml5BMl5BanBnXkFtZTgwNDIyOTIwOTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1924","placeOfBirth":" Kaunas, Lithuania","height":"5' 9\" (1.75 m)","bio":"Donatas Banionis was a popular Lithuanian actor known for Niekas nenorejo mirti (1966), Myortvyy sezon (1968), and Solaris (1972). He was born Donatas Juozas Banionis on April 28, 1924, in Kaunas, Lithuania. His mother, Blazhaitite-Banionene Ona, was a homemaker. His father, Juozas Banionis, was a tailor who took part in the Russian Revolution of 1917, was wounded in the Russian Civil War, then became a political prisoner, and briefly emigrated to Brasil during the 1920s. Young Banionis was raised with his elder sister during the years of Lithuanian independence before WWII. In 1941 Donatas Banionis was hired by the famous Lithuanian theatrical director Juozas Miltinis and became an actor at the newly formed Panevezys Drama Theatre. He studied acting under Juozas Miltinis and graduated from the Panevezys Acting Studio in 1945. In 1947 Banionis made his film debut: he appeared in a cameo role in 'Marite' (1947). His first major film work was the role of adventurer Daus in 'Adomas nori buti zmogumi' (Adam Wants to Be a Man 1959) by director Vytautas Zalakevicius. Long before becoming an acclaimed actor Banionis tried to escape from the Soviet Union at the end of the Second World War; but he failed to join his Lithuanian compatriots when they fled the Soviets. Soon the Iron curtain became impenetrable from either side. However, in 1970, as a member of an official Soviet delegation, he made his first visit to the Lithuanian community in Chicago. Then Banionis, being already a famous actor, came to realize that his former compatriots earned their good living and nice homes by working very hard from very poor beginnings. At that time, Banionis enjoyed a highly privileged life as a top film-star in the Soviet Union. He was awarded the State Prize in 1975, and was received by such Soviet leaders as Leonid Brezhnev and Mikhail Gorbachev. Banionis earned critical acclaim for his role of Vaitkus in 'Niekas nenorejo mirti' (Nobody Wanted to Die, 1966) by director Vytautas Zalakevicius. A powerful film, it was even dubbed the \"Lithuanian Seven Samurai.\" Banionis' tragical character Vaitkus is the undecided one among the Lithuanian \"brothers in the woods\", who are fighting against the Soviets after the end of the Second World War. Banionis demonstrated his range as a comedian in the comic role of a priest in 'Beregis avtomobilya' (Watch Out for the Automobile, 1966) by director Eldar Ryazanov. Banionis' sweet character blends well with the stellar ensemble of actors, such as Innokentiy Smoktunovskiy, Oleg Efremov, Andrey Mironov, Anatoliy Papanov, Evgeniy Evstigneev, Georgi Zhzhyonov, and other Russian film stars. Donatas Banionis is a refined intellectual actor with effortless style. His mastery of timing, his powerful silence, and his reserved energy shines in his major film-works; such as in 'King Lear' (1969) by Grigori Kozintsev, in 'Solaris' (1972) by Andrei Tarkovsky, in 'Goya - oder Der arge Weg der Erkenntnis' (1971) by director Konrad Wolf, in 'Begstvo mistera Mak-Kinli' by director Mikhail Shvejtser, in 'Beethoven - Days in a Life' (1976) by director Horst Seemann, and in other films. One of his memorable film-works is the character of a Russian spy 'Ladeinikov' in 'Myortvy Sezon' (The Dead Season, 1968) by director Savva Kulish. That film role provided Banionis with an auspicious connection. In 2004, the actor had a meeting with the Russian President Vladimir Putin. Mr. Putin confirmed that he made up his mind to become an intelligence officer after seeing Banionis in the role of a Russian spy. In his later works Donatas Banionis constitutes the link between cinema of the past and contemporary Lithuanian film. He showed reserved and convincing work in the role of 'The old man' in 'Kiemas' (Courtyard, 1999), a reflective film about a Lithuanian father and his family's depressing fate in the 1970's Soviet Union. He worked with director Aleksandr Buravskiy in 'Attack on Leningrad' (2006), a film about the historic siege during the Second World War; where his acting partners are Gabriel Byrne, Mira Sorvino, Aleksandr Abdulov, Kirill Lavrov, Mikhail Efremov and others. During his acting career spanning over sixty five years, Donatas Banionis played over 50 roles in film and on television. He also played over 100 stage roles, mainly at the Panevezys Juozas Miltinis' Drama Theatre. Banionis was designated People's Actor of the USSR (1974), and People's actor of the Lithuanian Republic (1973). He is Chevalier of the Order of the Lithuanian Grand Duke Gediminas. Donatas Banionis lived in the city of Panevezys, Lithuania. He was Honorable Citizen of Panevezys (1999). Actor died of heart related problems on 4th of September 2014 in Panevezys, Lithuania. He was ninety years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3NzgwNDU2Ml5BMl5BanBnXkFtZTgwNDIyOTIwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0052023","name":"Donatas Banionis","idIMDB":"nm0052023"},"actorId":"nm0052023","character":"Pavel Vasilievitch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emmanuil Vitorgan","urlProfile":"http://www.imdb.com/name/nm0900076","urlPhoto":"","biography":{"dateOfBirth":"27 December 1939","placeOfBirth":" Baku, Azerbaijan SSR, USSR [now Azerbaijan]","birthName":"Emmanuil Gedeonovich Vitorgan","height":"6' 2\" (1.88 m)","bio":"Emmanuil Vitorgan was born on December 27, 1939 in Baku, Azerbaijan SSR, USSR as Emmanuil Gedeonovich Vitorgan. He is an actor, known for Trevozhnoye voskresenye (1983), Po Taganke khodyat tanki (1991) and The Fortress (1979). He has been married to Irina Mlodik since 2002. He was previously married to Alla Balter.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0900076","name":"Emmanuil Vitorgan","nicknames":["Emma"],"idIMDB":"nm0900076"},"actorId":"nm0900076","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2860568","urlIMDB":"http://www.imdb.com/title/tt2860568","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":null,"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"filmingLocations":[],"awards":[],"type":"Movie","companyCreditsSimple":[{"idCompany":"co0043223","name":"Belarusfilm"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 05:25:34"}}