{"data":{"movies":[{"title":"Black or White","originalTitle":"","year":"2014","releaseDate":"20150130","directors":[{"name":"Mike Binder","id":"nm0082802"}],"writers":[{"name":"Mike Binder","id":"nm0082802"}],"runtime":"121 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMzE2NTE5MV5BMl5BanBnXkFtZTgwNDI3ODI2MzE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"Black or White is the story of a grandfather (Kevin Costner) who is suddenly left to care for his beloved granddaughter. When her paternal grandmother (Octavia Spencer) seeks custody with the help of her brother (Anthony Mackie), the little girl is torn between two families who love her deeply. With the best intentions at heart, both families fight for what they feel is right and are soon forced to confront their true feelings about race, forgiveness, and understanding. Anchored by an all-star cast and based on real events, the movie is a look at two seemingly different worlds, in which nothing is as simple as black or white.","simplePlot":"A grieving widower is drawn into a custody battle over his granddaughter, whom he helped raise her entire life.","actors":[{"actorName":"Kevin Costner","urlProfile":"http://www.imdb.com/name/nm0000126","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDU1OTEyNF5BMl5BanBnXkFtZTgwNjI0MTk2MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 January 1955","placeOfBirth":" Lynwood, California, USA","birthName":"Kevin Michael Costner","height":"6' 1\" (1.85 m)","bio":"Kevin Michael Costner was born on January 18, 1955 in Lynwood, California, the third child of Bill Costner, a ditch digger and ultimately an electric line servicer for Southern California Edison, and Sharon Costner (née Tedrick), a welfare worker. His older brother, Dan, was born in 1950. A middle brother died at birth in 1953. His father's job required him to move regularly, which caused Kevin to feel like an Army kid, always the new kid at school, which led to him being a daydreamer. As a teen, he sang in the Baptist church choir, wrote poetry, and took writing classes. At 18, he built his own canoe and paddled his way down the rivers that Lewis & Clark followed to the Pacific. Despite his present height, he was only 5'2\" when he graduated high school. Nonetheless, he still managed to be a basketball, football and baseball star. In 1973, he enrolled at California State University at Fullerton, where he majored in business. During that period, Kevin decided to take acting lessons five nights a week. He graduated with a business degree in 1978 and married his college sweetheart, Cindy Costner. He initially took a marketing job in Orange County. Everything changed when he accidentally met Richard Burton on a flight from Mexico. Burton advised him to go completely after acting if that is what he wanted. He quit his job and moved to Hollywood soon after. He drove a truck, worked on a deep sea fishing boat, and gave bus tours to stars' homes before finally making his own way into the films. After making one soft core sex film, he vowed to not work again if that was the only work he could do. He didn't work for nearly six years, while he waited for a proper break. That break came with The Big Chill (1983), even though his scenes ended up on the cutting room floor -- he was remembered by director Lawrence Kasdan when he decided to make Silverado (1985). Costner's career took off after that.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDU1OTEyNF5BMl5BanBnXkFtZTgwNjI0MTk2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000126","name":"Kevin Costner","idIMDB":"nm0000126"},"actorId":"nm0000126","character":"Elliott Anderson","urlCharacter":"http://www.imdb.com/character/ch0501426","main":true},{"actorName":"Octavia Spencer","urlProfile":"http://www.imdb.com/name/nm0818055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MjcwMjcxNl5BMl5BanBnXkFtZTcwMjkwODg0Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1970","placeOfBirth":" Montgomery, Alabama, USA","birthName":"Octavia Lenora Spencer","height":"5' 2\" (1.57 m)","bio":"Spencer is a native of Montgomery, Alabama, which she claims is the proverbial buckle of the Bible belt. She's the sixth of seven siblings and holds a BS in Liberal Arts from Auburn University. A \"closet\" lover of acting, this practical Alabamian knew that she'd someday work in the film industry, but never dreamed it would be in front of the camera. In 1995, acclaimed director Joel Schumacher changed all that by giving her a small part opposite Sandra Bullock in the hit film A Time to Kill, and Spencer was on her way. In 1996, she teamed up with Bullock again in Bullock's directorial debut of Making Sandwiches, a short film that premiered at the 1997 Sundance Film Festival. Spencer made her stage debut in Los Angeles and originated the role of \"LaSonia\" (pronounced lasagna) in famed writer/director Del Shore's, The Trials and Tribulations of a Trailer Trash Housewife, starring opposite veteran actors Beth Grant, Dale Dickey and David Steen (2003). The play garnered Spencer and her fellow cast mates critical acclaim and a bevy of awards. Since then, Spencer has continued to see success as an actor in both film and television, working alongside Hollywood's elite. In February 2009, she was lauded by Los Angeles Times publication: The Envelope, for her brief but memorable performance in the Will Smith drama Seven Pounds.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MjcwMjcxNl5BMl5BanBnXkFtZTcwMjkwODg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0818055","name":"Octavia Spencer","idIMDB":"nm0818055"},"actorId":"nm0818055","character":"Rowena Jeffers","urlCharacter":"http://www.imdb.com/character/ch0485223","main":true},{"actorName":"Jillian Estell","urlProfile":"http://www.imdb.com/name/nm4460358","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNTE3ODI1NV5BMl5BanBnXkFtZTgwODk3MDE4NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jillian Estell is an actress, known for Black or White (2014), The Night Shift (2014) and So This Is Christmas (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNTE3ODI1NV5BMl5BanBnXkFtZTgwODk3MDE4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4460358","name":"Jillian Estell","idIMDB":"nm4460358"},"actorId":"nm4460358","character":"Eloise Anderson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Burr","urlProfile":"http://www.imdb.com/name/nm0122987","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNDgwODg3NV5BMl5BanBnXkFtZTcwMTY5OTM3MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1968","placeOfBirth":" Canton, Massachusetts, USA","height":"5' 10\" (1.78 m)","bio":"Bill Burr was born on June 10, 1968 in Canton, Massachusetts, USA. He is an actor and writer, known for Date Night (2010), Daddy's Home (2015) and Walk of Shame (2014). He has been married to Nia Renee Hill since October 2013.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNDgwODg3NV5BMl5BanBnXkFtZTcwMTY5OTM3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0122987","name":"Bill Burr","idIMDB":"nm0122987"},"actorId":"nm0122987","character":"Rick Reynolds","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mpho Koaho","urlProfile":"http://www.imdb.com/name/nm0461945","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MTQyMTcwMV5BMl5BanBnXkFtZTcwNzQzMDgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Mpho Koaho is a series regular on Falling Skies for TNT. Other television credits include the Canadian miniseries Soul, for which he won a Gemini Award in 2009, and a critically acclaimed guest lead performance on the CBS series Flashpoint, for which he was also nominated for a Gemini Award. Koaho began his career when Maya Angelou cast him as the young lead in her film Down in the Delta for Mira...max, and he has continued to work steadily ever since. D.J. Caruso next cast Koaho in The Salton Sea opposite Val Kilmer and he has gone on to co-star in Four Brothers for John Singleton and Paramount, Get Rich or Die Tryin' for Jim Sheridan and Paramount, and Blindness for Fernando Meirelles and Focus Features. Other film credits include: Saw III, Haven and It's A Boy Girl Thing. Koaho resides in Toronto.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MTQyMTcwMV5BMl5BanBnXkFtZTcwNzQzMDgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0461945","name":"Mpho Koaho","idIMDB":"nm0461945"},"actorId":"nm0461945","character":"Duvan Araga","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anthony Mackie","urlProfile":"http://www.imdb.com/name/nm1107001","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NTM1MjE2M15BMl5BanBnXkFtZTcwNzc5OTI2Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1978","placeOfBirth":" New Orleans, Louisiana, USA","height":"5' 10½\" (1.79 m)","bio":"Anthony Mackie is an American actor. He was born in New Orleans, Louisiana, to Martha (Gordon) and Willie Mackie, Sr., who owned a business, Mackie Roofing. Anthony has been featured in feature films, television series and Broadway and Off-Broadway plays, including Ma Rainey's Black Bottom, Drowning Crow, McReele, A Soldier's Play, and Talk, by Carl Hancock Rux, for which he won an Obie Award in 2002. In 2002, he was featured in Eminem's debut film, 8 Mile, playing Papa Doc, a member of Leaders of the Free World. He was nominated for Best Supporting Actor at the 2009 Independent Spirit Awards for his role in _The Hurt Locker (2009)_(QV). This is Mackie's second ISA nomination, the first coming for his work in _Brother to Brother (2003)_, where he was nominated for Best Actor. Also in 2009, Mackie portrayed rapper Tupac Shakur in the film Notorious (2009). He appears in the Matt Damon film The Adjustment Bureau (2011) where he plays Harry Mitchell, a sympathetic member of a shadowy supernatural group that controls human destiny.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NTM1MjE2M15BMl5BanBnXkFtZTcwNzc5OTI2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1107001","name":"Anthony Mackie","idIMDB":"nm1107001"},"actorId":"nm1107001","character":"Jeremiah Jeffers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"André Holland","urlProfile":"http://www.imdb.com/name/nm2428245","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0MzI2ODI3M15BMl5BanBnXkFtZTgwNTYwMTEwOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1979","placeOfBirth":" Bessemer, Alabama, USA","height":"5' 9½\" (1.77 m)","bio":"André Holland was born on December 28, 1979 in Bessemer, Alabama, USA. He is an actor, known for 42 (2013), Moonlight (2016) and Selma (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0MzI2ODI3M15BMl5BanBnXkFtZTgwNTYwMTEwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2428245","name":"André Holland","idIMDB":"nm2428245"},"actorId":"nm2428245","character":"Reggie Davis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gillian Jacobs","urlProfile":"http://www.imdb.com/name/nm1843026","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTc5MTM1OV5BMl5BanBnXkFtZTcwMTU4NDI1NA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 October 1982","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Gillian McLaren Jacobs","height":"5' 4\" (1.63 m)","bio":"Gillian Jacobs was born on October 19, 1982 in Pittsburgh, Pennsylvania, USA as Gillian McLaren Jacobs. She is an actress, known for Community (2009), The Box (2009) and Don't Think Twice (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5OTc5MTM1OV5BMl5BanBnXkFtZTcwMTU4NDI1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1843026","name":"Gillian Jacobs","nicknames":["Gill"],"idIMDB":"nm1843026"},"actorId":"nm1843026","character":"Fay","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennifer Ehle","urlProfile":"http://www.imdb.com/name/nm0000383","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4MzMwMzg5NV5BMl5BanBnXkFtZTcwMDI4MTIyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1969","placeOfBirth":" Winston-Salem, North Carolina, USA","birthName":"Jennifer Anne Ehle","height":"5' 7\" (1.7 m)","bio":"Jennifer Ehle was born on December 29, 1969 in Winston-Salem, North Carolina, USA as Jennifer Anne Ehle. She is an actress, known for Zero Dark Thirty (2012), A Quiet Passion (2016) and Brooklyn Village (2016). She has been married to Michael Scott Ryan since November 29, 2001. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4MzMwMzg5NV5BMl5BanBnXkFtZTcwMDI4MTIyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000383","name":"Jennifer Ehle","idIMDB":"nm0000383"},"actorId":"nm0000383","character":"Carol","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paula Newsome","urlProfile":"http://www.imdb.com/name/nm0628420","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxODUyMDQ3M15BMl5BanBnXkFtZTcwODExMjMxNw@@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"bio":"Paula Newsome is known for her work on Little Miss Sunshine (2006), Reign Over Me (2007) and Guess Who (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxODUyMDQ3M15BMl5BanBnXkFtZTcwODExMjMxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0628420","name":"Paula Newsome","idIMDB":"nm0628420"},"actorId":"nm0628420","character":"Judge Cummins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Indigo","urlProfile":"http://www.imdb.com/name/nm0629525","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMjg3MjM0OF5BMl5BanBnXkFtZTYwOTgxMzk2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 June 1984","placeOfBirth":" Los Angeles, California, USA","birthName":"Alyssa Ashley Nichols","height":"5' 5½\" (1.66 m)","bio":"Indigo was born Alyssa Ashley Nichols in 1984, in Los Angeles, CA. Coming from an artistic family, she was exposed early on to various facets of the arts and attributes much of her interests in them to this. She booked her first commercial for Armour Hot Dog at age 5, and spent the next several years doing various student films and industrials, while simultaneously building up a reputation among casting directors in the industry. At age 10 she booked her first film role, playing opposite 'Louis Gossett Jr.', in the Showtime film, Zooman (1995); adapted from the play \"Zooman and the Sign\". During her freshman year in high school she was accepted from among applicants nationwide into the prestigious summer arts program; the California State Summer School for the Arts, (better known as CSSSA). In honor of her acceptance into this program, she was also made a recipient of the Governor's Medallion award. She auditioned and was accepted to the Los Angeles County High School of the Arts, (LACHSA), her junior year. It was during this time that she also decided to change her name to Indigo. Just before her junior year in high school however, Indigo took the CHSPE, (California High School Proficiency Exam), passed, and received her high school diploma a semester into the school year, prompting her to graduate a year and a half ahead of schedule. In recent years she's also established a name for herself on the voice-over scene, having done radio commercials for \"McDonald's\"; \"U.S. Army\"; \"Nestle's Crunch\" and \"Geico\", and having lent her voice to animation for the pilot episode of \"Boondocks\", where she played Huey; \"Curious George\" and several recurring gigs such as, \"Oscar Meyer\"; \"McDonald's\" and Family Guy (1999). From the time spanning from junior high school until now, Indigo has had guest star appearances on such shows as, Sister, Sister (1994); Chicago Hope (1994); NYPD Blue (1993); Crossing Jordan (2001); Judging Amy (1999); Girlfriends (2000); Strong Medicine (2000); Cold Case (2003); and CSI: Crime Scene Investigation (2000). She's had recurring roles on: Minor Adjustments (1995); Any Day Now (1998); Boston Public (2000); Buffy the Vampire Slayer (1997); and can be seen on Showtime's, Weeds (2005), which also earned her a SAG nomination for Outstanding Performance by an Ensemble in a Comedy Series, at the 2007 SAG awards. Her other interests include music and art.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMjg3MjM0OF5BMl5BanBnXkFtZTYwOTgxMzk2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0629525","name":"Indigo","idIMDB":"nm0629525"},"actorId":"nm0629525","character":"Young Nurse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bertha Bindewald","urlProfile":"http://www.imdb.com/name/nm7082369","urlPhoto":"","biography":{"bio":"Bertha Bindewald is an actress, known for Black or White (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7082369","name":"Bertha Bindewald","idIMDB":"nm7082369"},"actorId":"nm7082369","character":"Rosita","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Chrest","urlProfile":"http://www.imdb.com/name/nm0159609","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0OTQ4NDQ5M15BMl5BanBnXkFtZTgwMzU5ODY3NTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"A veteran of over 100 screen roles, and over 60 plays and musicals, Joe holds a BFA Degree in Directing from Marshall University in his home state of West Virginia, and an MFA Degree from Louisiana State University. He is a founding member of the regional theatre, Swine Palace, with RSC Director Emeritus Barry Kyle, and is the Founding Artistic Director of Ignition Film Repertory Company -- a company dedicated to nurturing and producing original works for the screen. Joe first appeared as the malevolent bellhop, Ben, in Steven Soderbergh's, \"King of the Hill\" and followed that with the widely acclaimed performance as Mr. Rodman in Soderbergh's,\"The Underneath.\" Nearly unrecognizable in many of his roles, Joe continues the chameleon-like range of these early performances to the widely different characters of recent films, from the steely quiet sharpshooter, Mitchell, in \"Mockingjay Part 2\" to Jonah Hill's nerdy dad, David Schmidt in \"21 Jump Street\" to the despicable Southern aristocrat, Amos Deason in \"Free State of Jones.\" Joe has also performed on stages from The Kennedy Center in Washington, D.C. to The Ahmanson Theatre in Los Angeles, working with Tony winning directors, Gordon Davidson and Jerry Zaks, and London Theatre Award winner and Olivier nominee, Barry Kyle. Joe served in The United States Air Force where he was recognized for \"Cold War\" service and expert marksmanship. Joe is married to choreographer (\"Pawn Shop Chronicles\") Christine Chrest. They have two kids, Nicolas and Samantha.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0OTQ4NDQ5M15BMl5BanBnXkFtZTgwMzU5ODY3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0159609","name":"Joe Chrest","idIMDB":"nm0159609"},"actorId":"nm0159609","character":"Dave","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ireyon Johnson","urlProfile":"http://www.imdb.com/name/nm5485293","urlPhoto":"","biography":{"height":"5' 2\" (1.57 m)","bio":"Ireyon \"Chase Dat Truth\" Johnson, is an American Actress, Lyricist and Entrepreneur. She started her acting career by preforming as Chase on a YouTube show titled Chase Dat Truth. It wasn't long after doing YouTube videos that she found her way unto the movie set. Ireyon booked her very first audition as Kris for an MTV movie Ladies Man: a MADE Movie.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5485293","name":"Ireyon Johnson","nicknames":["Chase Dat Truth"],"idIMDB":"nm5485293"},"actorId":"nm5485293","character":"Kristen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Janeline Hayes","urlProfile":"http://www.imdb.com/name/nm1699378","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjU0NTI5NzA3NV5BMl5BanBnXkFtZTgwODU3NjExMTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"height":"5' 4\" (1.63 m)","bio":"Janeline Condez Hayes was born in Tacoma, Washington at Fort Lewis military base. Her mother is a native of the Visanyan Islands of the Philippines, and her father an African American Army Sergeant from Tallahassee, Florida. Janeline is number seven of eleven children for her father and first-born of five for her mother. Naturally athletic as a child but hopelessly shy, Janeline wasn't introduced to acting until college, when she was encouraged to audition for the play How the Other Half Loves, winning the role of Teresa. Midway through rehearsals, Janeline and the director were confronted by the small cast of five actors to have Janeline replaced by the understudy. The director stood his ground in support of Janeline, thus starting her acting career. Janeline found her first agent in Eastern Washington. She booked her first regional commercial with John O'Hurley of Seinfeld. More commercial work quickly followed, which prompted Janeline to move Los Angeles in pursuit of an acting career. In LA Janeline found work in sports modeling and commercials. She has worked for such clients as Nike, Sony, Honda, JC Penney and many more. She then made the transition to film and television, landing roles on popular TV series Grey's Anatomy and Touch, as well as the blockbuster film 22 Jumpstreet. She has since appeared in the Kevin Costner film Black or White, working alongside Academy Award-winning actress Octavia Spencer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjU0NTI5NzA3NV5BMl5BanBnXkFtZTgwODU3NjExMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1699378","name":"Janeline Hayes","nicknames":["Janey, JL","Jelly","Bong, Lady J"],"idIMDB":"nm1699378"},"actorId":"nm1699378","character":"Dondi","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2883434","urlIMDB":"http://www.imdb.com/title/tt2883434","business":{"budget":{"money":"$9,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$6,456,000","country":"USA","day":"01","month":"02","year":"2015","remarks":"1,823 Screens"}],"gross":[{"money":"$21,569,041","country":"USA","day":"10","month":"05","year":"2015","remarks":""},{"money":"$21,560,226","country":"USA","day":"03","month":"05","year":"2015","remarks":""},{"money":"$21,548,294","country":"USA","day":"26","month":"04","year":"2015","remarks":""},{"money":"$21,474,763","country":"USA","day":"12","month":"04","year":"2015","remarks":""},{"money":"$21,420,382","country":"USA","day":"05","month":"04","year":"2015","remarks":""},{"money":"$21,401,142","country":"USA","day":"29","month":"03","year":"2015","remarks":""},{"money":"$21,356,808","country":"USA","day":"22","month":"03","year":"2015","remarks":""},{"money":"$21,265,751","country":"USA","day":"15","month":"03","year":"2015","remarks":""},{"money":"$21,052,926","country":"USA","day":"08","month":"03","year":"2015","remarks":""},{"money":"$20,602,166","country":"USA","day":"01","month":"03","year":"2015","remarks":""},{"money":"$19,647,036","country":"USA","day":"22","month":"02","year":"2015","remarks":""},{"money":"$17,780,000","country":"USA","day":"15","month":"02","year":"2015","remarks":""},{"money":"$13,139,951","country":"USA","day":"08","month":"02","year":"2015","remarks":""},{"money":"$6,456,000","country":"USA","day":"01","month":"02","year":"2015","remarks":""}],"weekendGross":[{"money":"$6,276","country":"USA","day":"10","month":"05","year":"2015","remarks":"16 Screens"},{"money":"$5,992","country":"USA","day":"03","month":"05","year":"2015","remarks":"22 Screens"},{"money":"$15,482","country":"USA","day":"26","month":"04","year":"2015","remarks":"41 Screens"},{"money":"$47,498","country":"USA","day":"12","month":"04","year":"2015","remarks":"85 Screens"},{"money":"$8,447","country":"USA","day":"05","month":"04","year":"2015","remarks":"21 Screens"},{"money":"$19,428","country":"USA","day":"29","month":"03","year":"2015","remarks":"45 Screens"},{"money":"$45,644","country":"USA","day":"22","month":"03","year":"2015","remarks":"88 Screens"},{"money":"$97,008","country":"USA","day":"15","month":"03","year":"2015","remarks":"158 Screens"},{"money":"$247,619","country":"USA","day":"08","month":"03","year":"2015","remarks":"389 Screens"},{"money":"$501,080","country":"USA","day":"01","month":"03","year":"2015","remarks":"718 Screens"},{"money":"$1,042,170","country":"USA","day":"22","month":"02","year":"2015","remarks":"1,166 Screens"},{"money":"$3,064,000","country":"USA","day":"15","month":"02","year":"2015","remarks":"1,591 Screens"},{"money":"$4,537,267","country":"USA","day":"08","month":"02","year":"2015","remarks":"1,823 Screens"},{"money":"$6,456,000","country":"USA","day":"01","month":"02","year":"2015","remarks":"1,823 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 1 min (121 min) (USA)"],"soundMix":["Datasat","Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa"],"laboratory":["FotoKem Laboratory, Burbank (CA), USA (digital intermediate)"],"filmLength":null,"negativeFormat":["SxS Pro"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","ProRes 4:4:4 (2K) (source format)"],"printedFilmFormat":["35 mm (anamorphic)","D-Cinema"]},"rating":"6.6","metascore":"45","filmingLocations":[{"location":"New Orleans, Louisiana, USA"}],"rated":"PG-13","awards":[{"award":"African-American Film Critics Association (AAFCA) 2014","titlesAwards":[{"titleAwardOutcome":"Won AAFCA Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Octavia Spencer","id":"nm0818055","role":null}]},{"category":"Top 10 Films","names":[]}]}]},{"award":"Black Reel Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Black Reel","categories":[{"category":"Outstanding Breakthrough Performance, Female","names":[{"name":"Jillian Estell","id":"nm4460358","role":null}]},{"category":"Outstanding Score","names":[{"name":"Terence Blanchard","id":"nm0005966","role":null}]}]}]}],"votes":"9,061","type":"Movie","companyCreditsSimple":[{"idCompany":"co0494580","name":"BlackWhite"},{"idCompany":"co0028319","name":"Sunlight Productions"},{"idCompany":"co0077634","name":"Treehouse Films (II)"}],"keywords":{"keywords":["color in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 00:59:51"}}