{"data":{"movies":[{"title":"Kung Fu Killer","originalTitle":"Yi ge ren de wu lin","year":"2014","releaseDate":"20150424","directors":[{"name":"Teddy Chan","id":"nm0151125"}],"writers":[{"name":"Teddy Chan","id":"nm0151125"},{"name":"Ho Leung Lau","id":"nm1210118"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMjY5NzcxMl5BMl5BanBnXkFtZTgwODYxNzIxNTE@._V1.jpg","countries":["China","Hong Kong"],"languages":["Cantonese","Mandarin"],"genres":["Action","Drama"],"plot":"A vicious killer named Fung goes around Hong Kong killing top martial arts exponents and leaving a secret weapon called the Moonshadow as his calling card. When a convicted killer and kung fu expert named Ha - formerly working as a martial arts instructor before accidentally killing a man and being imprisoned and convicted for the crime he didn't intend to do - hears of this, he offers to help the police catch the killer in return for his freedom. With Ha's help, the police realize from the chronological order of the victims that the killer is targeting his victims, all top masters in their respective martial arts style, and following a martial code of training. After a close encounter with Fung, Ha suddenly disappears and the police begin to suspect the worse: that the two are accomplices and Fung was the bait to help spring Ha from jail. But Ha has actually gone back to his home in Foshan to find out more about the mysterious calling card. While doing so, he discovers the killer's ...","simplePlot":"A martial arts instructor from the police force gets imprisoned after killing a man by accident. But when a vicious killer starts targeting martial arts masters, the instructor offers to help the police in return for his freedom.","actors":[{"actorName":"Donnie Yen","urlProfile":"http://www.imdb.com/name/nm0947447","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzA0MDk0M15BMl5BanBnXkFtZTcwMTc2MjM1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1963","placeOfBirth":" Canton, China","birthName":"Zhen Zidan","height":"5' 8\" (1.73 m)","bio":"Martial artist and Hong Kong action star Donnie Yen was born to newspaper editor Klyster Yen and martial arts master Bow Sim Mark. At the age of four Yen started taking up martial arts from his mother, who taught him wushu and tai chi until the age of eleven when his family emigrated to Boston, MA. From there he continued mastering wushi and tai chi. But after developing a huge interest in martial arts he eventually began getting into various others martial art styles, such as taekwondo, kick-boxing, boxing, karate etc. When Yen was sixteen his parents sent him to Beijing Wushu Academy so he could train Chinese martial arts under Master Wu Bin, well known as the coach of Jet Li. He underwent intensive training for three years. After three years Yen was about to leave back to the US but made a side trip to Hong Kong. There he was accidentally introduced to famous Hong Kong action film-maker Woo-Ping Yuen, who was responsible for bringing Jackie Chan to super stardom and was looking for someone new to star in his films. Yen was offered a screen test - which he passed - and thereafter a 4-picture deal. Yen started out with stunt doubling duty on the magical martial arts film The Miracle Fighters (1982). From there he starred in his first film, Drunken Tai Chi (1984) at the age of 19. He continued his early film career working independently with Woo-Ping Yuen and also applied for acting lessons as well as roles in TV series at TVB to gain more acting experience. He started getting a bit of attention in the late 1980s and mid 1990s, after he was offered a contract by D&B Films Co's Dickson Poon. Poon gave Yen major roles in the action films Tiger Cage (1988), In the Line of Duty 4 (1989) and Tiger Cage 2 (1990), which became cult classics after their initial releases. These films eventually spread outside the Hong Kong film circuit and gave Yen a good reputation as a formidable onscreen action performer. But after a while, the company did not do well and in the end went bankrupt. This left Yen with no choice but to go back to TVB as well as venture into low-budget film-making making films, such as Crystal Hunt (1991) and Revenge of the Cheetah (1992). But the misfortune didn't last long. Famous director Hark Tsui had just made a successful attempt to revive the kung fu genre with Once Upon a Time in China (1991) which starred Jet Li. For the sequel La secte du lotus blanc (1992) Hark was looking for someone to play the new nemesis. Through Yen's early films and his rep as one of the most effective pound-for-pound on-screen fighters in Hong Kong, Hark became fascinated and decided to approach, discuss, and eventually cast him in the role of General Lan. The film became a turning point in Yen's career and his two fight scenes with Jet Li revolutionized the standards of Hong Kong martial arts choreography at the time, and are still regarded as among the best fight scenes ever created in Hong Kong film history. Another acclaim by critics and movie goers was Yen's acting performance. It was so outstanding that he was nominated for \"Best Supporting Actor\" at the 1992 Hong Kong Film Awards. After the excellent showcase, Yen starred in other successful and classic films, such as L'auberge du dragon (1992) for director Raymond Lee and Butterfly and Sword (1993) by Michael Mak. But he still continued to work with Woo-Ping Yuen on films including Heroes Among Heroes (1993), Iron Monkey (1993) and Wing Chun (1994). But after creative differences between them became apparent, both of them decided it was best to work on their own so they ended up going separate ways and haven't collaborated with each other ever since. During this period Yen got into TV and worked on a couple of series for ATV as actor and action director. The first was The Kung Fu Master (1994) which depicted the life of martial arts legend Hung Hei-Kwan. The TV series was a big success and Yen continued the success by action directing and starring in the second successful series; Fist of Fury (1995). It retold the story of Chen Zhen, the character made famous by Bruce Lee in the original 1972 film classic with the same title. Aside the TV work, he was offered roles by prolific director/producer Jing Wong in films such as The Saint of Gamblers (1995) and got other offers which includes Circus Kids (1994) where he co-starred with action star Biao Yuen, and High Voltage (1994) which was shot in the Philippines. In 1996 - after fulfilling his contract deal with Wong Jing and returning deposit money to refuse making more films for him - Yen signed with the independent film company My Way Film Co. This became another turning point in his career in that he started learning directing and experimenting with film cameras. In 1997, he finally made his directorial debut with Legend of the Wolf (1997) and had created a different style of martial arts choreography. The film made a huge impact within fan communities around the world for its' daring, braving, and fresh attempt of accomplishing something new for the then dying martial arts action genre in Hong Kong. There was and still is a mixture of people both admiring and looking down on this particular style. Yen continued to work as lead actor/director/action director on films such as Ballistic Kiss (1998), Shanghai Affairs (1998). In 1999, he decided to try something different and ended up flying to Germany to work on the local TV film Der Puma - Kämpfer mit Herz: La loi du Puma (1999) and its' TV series counterpart. In 2000, things took a turn for Yen once again when US-based film company Dimension Films called and offered him a major role in Highlander: Endgame (2000) as the immortal Jin Ke, making it his US debut. But sadly the film didn't perform well at the box-office and many fans consider it to be a part of its' own franchise. Nevertheless, Yen's fan-base consider his action scenes to be highlights of the film; especially his duel with Adrian Paul. To Dimension Films' credit though, offers followed shortly afterward. Yen was invited to work behind the camera on The Princess Blade (2001) for Japanese director Shinsuke Sato and Blade II (2002) by Guillermo del Toro, the latter of which he also appeared in as the mute vampire Snowman. In 2002 and 2003 respectively, Yen's career further progressed after he took on two memorable roles. Firstly, highly acclaimed Chinese director Yimou Zhang offered Yen the part of assassin Sky in Hero (2002) starring Jet Li and resulted in one of the most anticipated Chinese films of 2002 which eventually became a mega hit around Asia. Secondly, director David Dobkin casted him alongside Jackie Chan as the traitorous Wu Chow in Shanghai Knights (2003), the sequel to Shanghai Noon (2000). This film marked the first time Yen worked with Chan in his career. Both of these collaborations gave Yen more recognition in the US and in Hong Kong, which in turn gave him more opportunities as an actor and action director. In the same year Yen decided to put hold of pursuing a career in Hollywood and flew back to Hong Kong to find quality work. Through his good friend and Hong Kong cinema expert Bey Logan he signed up as action director for Vampire Effect (2003), produced by Emperor Multimedia Group Co. (EMG) and starring the pop stars Gillian Chung and Charlene Choi with in a cameo appearance by Jackie Chan. The film earned him a nomination for \"Best Action Design\" at the 2003 Hong Kong Film Awards as well as the 2003 Golden Horse Awards, both of which he won prices for. He continued to work on few films after that, including Black Rose Academy (2004) as director and action director, and Blade of Kings (2004) as actor where he once again worked with Jackie Chan on an anticipated fight scene which was satisfying enough for fans to see. Later on in 2004 Yen's career took a totally different turn when Hark Tsui offered him a leading role in Seven swords (2005) which was an adaptation of a lengthy novel written by Liang Yu-Sheng about seven warriors and their mystical swords. Despite the disappointing box-office reception when it was released locally, the film was nonetheless a great showcase for Yen as an actor and action performer unlike anything he did previously in his career. Around the same time, Yen also teamed up with acclaimed Hong Kong director Wilson Yip and together they made the highly anticipated crime drama S.P.L. (2005). The film was remarkable in that it successfully combined strong acting and unique storytelling/visuals with groundbreaking martial arts action. This concept went on to become favored by action film fans and Hong Kong Cinema fans in general after its' release. Yen's way of shooting martial arts action - which was nothing like people had already seen - earned him a nomination and a price at the 2005 Hong Kong Film Awards for \"Best Action Design\". The movie also led to a trend of similar Hong Kong action films where storytelling/visuals along with hard-hitting action scenes were to be highlighted as much as possible. After the success, Yen and Yip teamed up immediately for more projects which includes the comic book adaptation Dragon Tiger Gate (2006) and the hard-hitting action drama Flashpoint (2007), both of which were very successful at the box-office and within fan communities globally. These accomplishments made people regard Yen as the new pinnacle of Hong Kong martial arts/action films. Yen both earned the \"Best Action Design\" nomination at the 2006 Hong Kong Film Awards as well as the \"Best Action Direction\" nomination at 2006 Golden Bauhinia Awards for Dragon Tiger Gate (2006). He won a price for the latter while he was awarded for his action design on Flashpoint (2007) at both the 2007 Golden Bauhinia Awards and the 2007 Hong Kong Film Awards. From there on Yen continued to work as a lead actor and also developed an interest in improving his acting skills. He got a leading role in the battle epic Kingdom of War (2008), directed by acclaimed Hong Kong action director Siu-Tung Ching, which was a big success in Mainland China. He continued work starring in the supernatural romance film Painted Skin (2008) by Gordon Chan. Then he starred in the martial arts biopic Ip Man (2008) helmed by Wilson Yip. This film was based on the life of one of Bruce Lee's wing chun teachers, Yip Man. The film became a sensational mega success all over Asia and people within the Hong Kong film industry started taking note after Wilson Yip's matured style of film-making, Sammo Hung's fresh martial arts choreography which many action film fans consider to be a redefinition of Hung's career as action director. But most impressive about the film for the audiences and critics was Yen's acting performance. During production, people had been very skeptical about Yen being the choice for the Yip Man role. But when the film was released, all pressure from the cast and crew were gone and people eventually went on to praise Yen for his portrayal of Yip Man. The success of the film also led to other successful directors and producers approaching Yen and giving him offers to work in front of the camera. Through his progression in the Hong Kong film industry from the start - when he was just like other action performers in Hong Kong trying to make a name for themselves - to nowadays as arguably among the most offering leading Hong Kong actors and the most promising action director, as long as Donnie Yen is still active in film-making (whether working in front of or behind the camera), he will almost certainly break new grounds and create more innovative concepts of action choreography for the martial arts action genre.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzA0MDk0M15BMl5BanBnXkFtZTcwMTc2MjM1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0947447","name":"Donnie Yen","nicknames":["Dan Yeh"],"idIMDB":"nm0947447"},"actorId":"nm0947447","character":"Hahou Mo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Baoqiang Wang","urlProfile":"http://www.imdb.com/name/nm1316170","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NzU3NTY3N15BMl5BanBnXkFtZTcwMDc2MjM1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1984","placeOfBirth":" Hebei, China","bio":"Baoqiang Wang was born on April 29, 1984 in Hebei, China. He is an actor and director, known for A Touch of Sin (2013), Kung Fu Killer (2014) and Blind Shaft (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NzU3NTY3N15BMl5BanBnXkFtZTcwMDc2MjM1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1316170","name":"Baoqiang Wang","idIMDB":"nm1316170"},"actorId":"nm1316170","character":"Fung Yu-Sau","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charlie Yeung","urlProfile":"http://www.imdb.com/name/nm0947777","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTc1MTM5MmMtMjFmZS00NjZmLTljMTgtMWVhMzU0MmFjNGFhL2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 May 1974","placeOfBirth":" Hong Kong","height":"5' 5\" (1.65 m)","bio":"Charlie Yeung was first cast to star in a jewelry commercial with pop idol Aaron Kwok in 1993, and thus began her versatile career. Within a year, she appeared in various movies including acclaimed director Kar-Wai Wong's Ashes of Time, and released her first album which won her The Most Promising Newcomer award. In the following four years, while continuing to release albums both in Hong Kong and Taiwan, Charlie further developed her acting career by working with various directors, including The Lovers (1994) (aka Butterfly Lovers) by 'Tsui Hark', Intimates (1997) (aka Intimates) by 'Chi Leung 'Jacob' Cheung', and once again worked with 'Wong Kar-Wai on the film Fallen Angels (1995) (aka Fallen Angels). Charlie Yeung's achievement in fame and success in just a span of four years created a phenomenal following. However, just when she reached the peak of her career, Charlie decided to take a break to pursue her real interests---Image Consulting. While busy developing her business, she had never forgotten about acting, she provided her voice for both Hark Tsui's animation A Chinese Ghost Story (1997) and Disney's Tarzan (1999). She has returned to the big screen, she is recently seen in 'Jackie Chan''s latest box-office hit, New Police Story (2004) (aka New Police Story).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTc1MTM5MmMtMjFmZS00NjZmLTljMTgtMWVhMzU0MmFjNGFhL2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0947777","name":"Charlie Yeung","idIMDB":"nm0947777"},"actorId":"nm0947777","character":"Luk Yuen-Sum","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bing Bai","urlProfile":"http://www.imdb.com/name/nm3138980","urlPhoto":"","biography":{"dateOfBirth":"2 May 1986","placeOfBirth":" Xi'an, Shaanxi, China","height":"5' 5\" (1.65 m)","bio":"Bing Bai was born on May 2, 1986 in Xi'an, Shaanxi, China. She is an actress, known for Kung Fu Killer (2014), Viral Factor (2012) and Shaolin (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3138980","name":"Bing Bai","idIMDB":"nm3138980"},"actorId":"nm3138980","character":"Sinn Ying","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alex Fong","urlProfile":"http://www.imdb.com/name/nm0284533","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2E5OThhMjgtOTM0My00NTUzLThiOWUtZWIyZjM2NGQwMjhkL2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 March 1963","placeOfBirth":" Portuguese Macau","birthName":"Lik Fu","height":"5' 11\" (1.8 m)","bio":"Alex Fong was born on March 17, 1963 in Portuguese Macau as Lik Fu. He is known for his work on One Nite in Mongkok (2004), Kung Fu Killer (2014) and Double Tap (2000). He has been married to Ho-Yan Mok since June 7, 2008. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2E5OThhMjgtOTM0My00NTUzLThiOWUtZWIyZjM2NGQwMjhkL2ltYWdlXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0284533","name":"Alex Fong","idIMDB":"nm0284533"},"actorId":"nm0284533","character":"Lam Sir","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Siu-Wong Fan","urlProfile":"http://www.imdb.com/name/nm0266658","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1NjkzMjg0NjNeQTJeQWpwZ15BbWU3MDQzNTA5MDg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1973","placeOfBirth":" Hong Kong, China","height":"5' 9¾\" (1.77 m)","bio":"Siu-Wong Fan was born in Hong Kong in 1973, the son of 1970s kung fu film actor Mei-Sheng Fan. At the age of 14, Siu-Wong traveled to Xushou on the request of his father to take up martial arts because he was virtually a toothpick. There, Siu-Wong studied gymnastics, kung fu, and taekwondo. Fan made his film debut as a teen in Zhi fa xian feng (1986), aka Righting Wrongs, alongside Biao Yuen, Cynthia Rothrock, and Corey Yuen. However, his breakout role came in 1991 when he starred as the titled character in Lik wong (1991), aka The Story of Ricky. By then, Siu-Wong has emerged into a true action star with the muscles to match. He continues to work in films today, although they are not exactly the big Hong Kong blockbusters everyone goes out to see.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1NjkzMjg0NjNeQTJeQWpwZ15BbWU3MDQzNTA5MDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0266658","name":"Siu-Wong Fan","idIMDB":"nm0266658"},"actorId":"nm0266658","character":"Hung Yip","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Xing Yu","urlProfile":"http://www.imdb.com/name/nm1789084","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE4ODJiOWEtOThkMS00MWJiLThlNzQtNTU2NTEyZWMxZGIxXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 December 1978","placeOfBirth":" Shandong, China","birthName":"Zhang Shuwu","height":"5' 9¾\" (1.77 m)","bio":"Xing Yu was born on December 27, 1978 in Shandong, China as Zhang Shuwu. He is an actor, known for Ip Man (2008), Kung Fu Hustle (2004) and Shaolin (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE4ODJiOWEtOThkMS00MWJiLThlNzQtNTU2NTEyZWMxZGIxXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1789084","name":"Xing Yu","nicknames":["Shi Xing Wu"],"idIMDB":"nm1789084"},"actorId":"nm1789084","character":"Tam King-Yiu","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Chiang","urlProfile":"http://www.imdb.com/name/nm0156955","urlPhoto":"","biography":{"dateOfBirth":"29 June 1947","placeOfBirth":" Suzhou, Jiangsu, China","birthName":"Wei-Nien Chiang","height":"5' 9\" (1.75 m)","bio":"David Chiang was born in Suzhou, China on June 29, 1947. His mother Hung Wei and father Yim Dut were very popular movie stars. Young David began his acting career at a very early age, appearing in black & white films while he was only 4 years old. \"John\" is David's real English name, while \"David\" was a stage name given to him by Director Chang Cheh. In 1966, while working as a Stuntman and Fight Instructor for the acclaimed Shaw Brothers Studio, he was spotted by Director Chang Cheh. The Director immediately saw potential & screen presence in the young actor & took David under his wing, slowly grooming him. The pair got along like father & son. With Wang Yu's sudden departure in 1969, Run Run Shaw and his senior executives were searching for their next leading man to take the reins to satisfy the frenzy left from the departed Wang Yu. The movie impresario made David an offer he could not refuse. With the guidance of Director Chang Cheh, David won \"The Best Actor\" Award at the 16th Asian Film Festival in 1970 for his role in \"Vengeance!\". In 1972, at the 18th Asian film Festival, David was awarded \"The Best Actor\" for his role in \"Blood Brothers\" & \"The Most Contemporary\" Award in 1973 at the 19th Asian Film Festival for \"The Generation Gap\". David left Hong Kong with his mentor Chang Cheh and set up an Independent Production Company in 1973 known as Chang's Scope Company. With the backing & blessings of Run Run Shaw, their films continued to be distributed through an enormous Shaw circuit. There, David was able to try his hand at directing, producing and script writing. As the 70s came to an end and the 80s approached, David continued to work his magic on the silver screen working with Directors Lee Han Chiang, Hsueh Li Pao, Ho Meng-hua and Chia-Liang Liu. 1980 was also the start of his first TV series \"The Green Dragon Conspiracy\", followed by \"Princess Chang Ping\" and \"Dynasty\" which are all classics. In the mid 80s, David worked alongside his two brothers, Paul Chun & Derek Yee, directing, producing and acting in the comedy \"Legend of the Owl\". David's talents in comedy also was showcased in the movies \"The Challenger\" and \"The Loot\" directed by Eric Tseng . In late 80s into the 90s David successfully directed movies: \"Heaven Can Help\", \"Silent Love\", \"The Wrong Couples\", \"Mr. Handsome\", \"Double Fattiness\", \"My Dear Son\", \"Will of Iron\" and \"Mother of a Different Kind\" . In 1991, David and his family emigrated from Hong Kong to Vancouver, Canada, returning to Hong Kong to make one or two TV series each year. As 2000 approached, David has continued to work in movies & TV series. He was nominated for \"Best Supporting Actor\" in 2006 for his role in \"Revolving Doors of Vengeance\". With over 4 decades under his belt, David is indeed an icon and a legend and is well regarded as one of Kung Fu's top action heroes.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0156955","name":"David Chiang","idIMDB":"nm0156955"},"actorId":"nm0156955","character":"Chan Pak-Kwong","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kang Yu","urlProfile":"http://www.imdb.com/name/nm0437655","urlPhoto":"","biography":{"height":"5' 11¾\" (1.82 m)","bio":"Yu Kang was born in Hubei, China. Kang started training traditional Kung Fu and Martial Arts at a very young age. In his youth he won championships for many wushu competitions. He stepped into the film business as a action stuntmen and quickly moved to action director. Kang has been in Donnie Yen's Action team for over 10 years and participated in most of Yen's films. His career as an actor started after with a small role in Dragon Tiger Gate and was well received, he then continued to develop his acting skills in films. Kang appeared in many successful films including Dragon Tiger Gate, Wuxia, Special Identity, Iceman 3D part 1, and future releases like Iceman 3D part 2 and Kung Fu Jungle. Kang's performance in Iceman was spectacular and gained amazing reviews and praise as the main villain.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0437655","name":"Kang Yu","idIMDB":"nm0437655"},"actorId":"nm0437655","character":"Wong Chit","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve Chan","urlProfile":"http://www.imdb.com/name/nm0151109","urlPhoto":"","biography":{"bio":"Steve Chan is known for his work on The Man with the Iron Fists (2012), Espion amateur (2001) and Beast Cops (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0151109","name":"Steve Chan","idIMDB":"nm0151109"},"actorId":"nm0151109","character":"Duty officer A","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hoi Mang","urlProfile":"http://www.imdb.com/name/nm0389885","urlPhoto":"","biography":{"bio":"Hoi Mang is known for his work on First Mission (1985), Pedicab Driver (1989) and Kung Fu Killer (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0389885","name":"Hoi Mang","idIMDB":"nm0389885"},"actorId":"nm0389885","character":"Hunan gangs leader","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wai-Fai Wong","urlProfile":"http://www.imdb.com/name/nm0939386","urlPhoto":"","biography":{"bio":"Wai-Fai Wong is known for his work on Pirates of the Caribbean: At World's End (2007), Crouching Tiger, Hidden Dragon (2000) and Rush Hour 2 (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0939386","name":"Wai-Fai Wong","idIMDB":"nm0939386"},"actorId":"nm0939386","character":"Duty officer B","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bey Logan","urlProfile":"http://www.imdb.com/name/nm0004214","urlPhoto":"","biography":{"dateOfBirth":"1963","placeOfBirth":" England, UK","birthName":"John Joyce","bio":"Born in Stamford, England, UK. Educated Uppingham Public School, Rutland. Former editor of 'Combat' and 'Impact' magazines. Resident in Hong Kong since 1995. Formerly employed my Media Asia Group and subsequently Emperor Multimedia Group. Previously ran own company, Shankara Productions, in partnership with actress Maggie Q. Subsequently employed as Asian Vice-President for the Weinstein Company. Currently runs HK based film company, B&E Productions. Father of four sons: Ryan, Calvin, Kyle, Sean, and one daughter, Taia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0004214","name":"Bey Logan","nicknames":["The Beast"],"idIMDB":"nm0004214"},"actorId":"nm0004214","character":"K-1 Kickboxer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Apple Chau","urlProfile":"http://www.imdb.com/name/nm2913257","urlPhoto":"","biography":{"bio":"Apple Chau is known for her work on Kung Fu Killer (2014), Mad detective (2007) and Shamo (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2913257","name":"Apple Chau","idIMDB":"nm2913257"},"actorId":"nm2913257","character":"Identification Bureau officer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wai-Keung Lau","urlProfile":"http://www.imdb.com/name/nm0490487","urlPhoto":"","biography":{"dateOfBirth":"4 April 1960","placeOfBirth":" Hong Kong","birthName":"Wai-Keung Lau","bio":"Andrew Lau Wai-Keung was born in Hong Kong in 1960, and has been fond of photography as a child. He joined Shaw Brothers (HK) Ltd. after secondary school graduation. The first film he participated in as a semi-skilled worker in cinematography was Legendary Weapons of China directed by Chia-Liang Liu. His position rose throughout the years with film such as City on Fire, Where's Officer Tuba?, As Tears Go By, Curry and Pepper, Lee Rock and Lee Rock II. His work as a cinematographer has also garnered him several nominations at the Hong Kong Film Awards. Lau had later gotten recognition for his loose style in capturing natural light and dynamic camera movements. His directorial debut arrived in 1990 with Against All, but he didn't give up his career as a cinematographer. He also co-directed the films To Live and Die in Tsimshatsui and Modern Romance, alongside director Jing Wong. In 1995, he took up the position of director and cinematographer once again for the films Love of the Last Emperor and The Mean Street Story. Lau founded B.O.B. & Partners Co. Ltd. jointly with Manfred Wong and Jing Wong. The first film of this company was Young and Dangerous which was released in 1996 and became a box office hit. In the same year, the 'B.O.B. trio' produced the film's first two sequels. From 1996 to 1998, he continued to direct films including the Young and Dangerous Saga--and \"The Storm Riders.\" Having been involved in the Young and Dangerous films including its four sequels, Lau finished his involvement with the franchise with \"Young and Dangerous: The Prequel\" in 1998, and \"Born to Be King\" in 2000. Lau has also made a name for himself for combining martial arts with computer-animated special effects on the movie screen in such acclaimed films as The Storm Riders and A Man Called Hero. Other films such as Sausalito and Dance of a Dream have lightened Andrew's film career. In 2002, Lau established Basic Pictures, a company that started out with the blockbuster movie Infernal Affairs, in which he co-directed alongside co-writer Alan Mak (Alan Mak). It would be the first of many collaborations involving the directing duo. The film starred the four top actors of its year--Andy Lau, Tony Chiu-Wai Leung, Eric Tsang and Anthony Chau-Sang Wong-- along with the year's two top actresses--Kelly Chen and Sammi Cheng. Infernal Affairs was the number one box-office hit in Hong Kong that year, breaking several box office records alone. Furthermore, the film won many Hong Kong Film Awards, including Best Picture, Best Directors (Lau and Mak), Best Screenplay (Mak and co-writer Chong), and Best Supporting Actor (Wong). Infernal Affairs also went on win awards at the 40th Golden Horse Awards and the Golden Bauhinia Awards. Not only was the film successful worldwide, but it later became the inspiration for Martin Scorsese's 2006 film, The Departed (2006). In 2003, Lau and Mak had completed the trilogy with the prequel Infernal Affairs II, and the sequel/prequel Infernal Affairs III. Later that year, the directing duo won the \"Leaders of the Year 2003\" Award in the Sports/Culture/Entertainment Category. In 2004, Lau and Mak worked on another blockbuster, Initial D, which was shot in Japan and released in Hong Kong during the summer. Once again, it was also another successful film for Lau and Mak, winning multiple awards at the Hong Kong Film Awards, winning for Best New Performer (Jay Chou), Best Supporting Actor (Anthony Chau-Sang Wong), and Best Visual Effects. In 2006, Lau, Mak and scriptwriter Felix Chong re-teamed to make the 2005 film, Moonlight in Tokyo. They re-teamed again for the 2006 film Confessions of Pain, once again re-teaming with Infernal Affairs star Tony Chiu-Wai Leung. With his difference in style and aspiration, Andrew Lau, as a prolific director/cinematographer continues to make good quality films that will appeal to a mass audience.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0490487","name":"Wai-Keung Lau","idIMDB":"nm0490487"},"actorId":"nm0490487","character":"Y.T.M. District officer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2952602","urlIMDB":"http://www.imdb.com/title/tt2952602","business":{"budget":{"money":"$25,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$58,664","country":"USA","day":"26","month":"04","year":"2015","remarks":"28 Screens"}],"gross":[{"money":"$129,115","country":"USA","day":"31","month":"05","year":"2015","remarks":""},{"money":"$116,700","country":"USA","day":"10","month":"05","year":"2015","remarks":""},{"money":"$97,921","country":"USA","day":"03","month":"05","year":"2015","remarks":""},{"money":"$58,664","country":"USA","day":"26","month":"04","year":"2015","remarks":""}],"weekendGross":[{"money":"$1,327","country":"USA","day":"31","month":"05","year":"2015","remarks":"2 Screens"},{"money":"$8,162","country":"USA","day":"10","month":"05","year":"2015","remarks":"7 Screens"},{"money":"$15,787","country":"USA","day":"03","month":"05","year":"2015","remarks":"25 Screens"},{"money":"$58,664","country":"USA","day":"26","month":"04","year":"2015","remarks":"28 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 40 min (100 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Red Epic, Zeiss Ultra Prime, Fujinon Alura and Angenieux Optimo Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["Redcode RAW"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Redcode RAW (5K) (source format)"],"printedFilmFormat":["35 mm (anamorphic)","D-Cinema"]},"rating":"6.5","metascore":"66","filmingLocations":[{"location":"Hong Kong, China"}],"awards":[{"award":"Golden Horse Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Horse Award","categories":[{"category":"Best Action Choreography","names":[{"name":"Donnie Yen","id":"nm0947447","role":null},{"name":"Wei Tung","id":"nm0876600","role":null},{"name":"Bun Yuen","id":"nm0082898","role":null},{"name":"Hua Yan","id":"nm2747215","role":null}]}]}]},{"award":"Hong Kong Film Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won Hong Kong Film Award","categories":[{"category":"Best Action Choreography","names":[{"name":"Donnie Yen","id":"nm0947447","role":null},{"name":"Wei Tung","id":"nm0876600","role":null},{"name":"Bun Yuen","id":"nm0082898","role":null},{"name":"Hua Yan","id":"nm2747215","role":null}]}]},{"titleAwardOutcome":"Nominated Hong Kong Film Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Baoqiang Wang","id":"nm1316170","role":null}]},{"category":"Best Visual Effects","names":[{"name":"Enoch Chan","id":"nm3121295","role":null}]},{"category":"Best Sound Design","names":[{"name":"Kinson Tsang","id":"nm0874686","role":null},{"name":"George Yiu-Keung Lee","id":"nm1806462","role":null}]}]}]},{"award":"Hong Kong Film Critics Society Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won Film of Merit","categories":[{"category":"","names":[]}]},{"titleAwardOutcome":"Nominated HKFCS Award","categories":[{"category":"Best Film","names":[]}]}]},{"award":"Huading Award 2015","titlesAwards":[{"titleAwardOutcome":"Won Huading Award","categories":[{"category":"Best Actor in a Motion Picture","names":[{"name":"Donnie Yen","id":"nm0947447","role":null}]}]},{"titleAwardOutcome":"Nominated Huading Award","categories":[{"category":"Best Action Choreography for a Motion Picture","names":[{"name":"Bun Yuen","id":"nm0082898","role":null},{"name":"Donnie Yen","id":"nm0947447","role":null},{"name":"Wei Dong","id":"nm3461127","role":null},{"name":"Hua Yan","id":"nm2747215","role":null}]}]}]},{"award":"Macau International Movie Festival 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Lotus Awards","categories":[{"category":"Best Picture","names":[{"name":"Teddy Chan","id":"nm0151125","role":null}]},{"category":"Best Director","names":[{"name":"Teddy Chan","id":"nm0151125","role":null}]},{"category":"Best Actor","names":[{"name":"Donnie Yen","id":"nm0947447","role":null}]},{"category":"Best Supporting Actor","names":[{"name":"Baoqiang Wang","id":"nm1316170","role":null}]},{"category":"Best Supporting Actress","names":[{"name":"Bing Bai","id":"nm3138980","role":null}]},{"category":"Best Cinematography","names":[{"name":"Wing-Hang Wong","id":"nm0911072","role":null}]}]}]}],"votes":"6,974","type":"Movie","companyCreditsSimple":[{"idCompany":"co0563005","name":"Emperor Film Production"},{"idCompany":"co0382817","name":"Sun Entertainment Culture"},{"idCompany":"co0268167","name":"Beijing Silver Moon Productions"}],"keywords":{"keywords":["martial arts","police","kung fu","fight","wire fu","shot to death","flashback","prison fight","prison","death of wife","blood","violence","murder"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 00:18:37"}}