{"data":{"movies":[{"title":"Camp X-Ray","originalTitle":"","year":"2014","releaseDate":"20141017","directors":[{"name":"Peter Sattler","id":"nm0972104"}],"writers":[{"name":"Peter Sattler","id":"nm0972104"}],"runtime":"117 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NjI1MjEwMV5BMl5BanBnXkFtZTgwNjc2Mzc3MjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","War"],"plot":"A young soldier escapes her suffocating small town by joining the military, only to find that she isn't going for a tour of duty in Iraq as she hoped. Instead, she's sent to Guantanamo. Met with hatred and abuse from the men in her charge, she forges an odd friendship with a young man who has been imprisoned at Gitmo for eight years.","simplePlot":"A soldier assigned to Guantanamo Bay befriends a man who has been imprisoned there.","actors":[{"actorName":"Nawal Bengholam","urlProfile":"http://www.imdb.com/name/nm4553019","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MTEyNTYwN15BMl5BanBnXkFtZTgwNTA5NjI1ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Nawal Bengholam is originally from Casablanca, Morocco. She grew up there and after high school spent a year in Paris, Madrid and Barcelona, then moved to San Diego to do her pre-medical studies at the University of California, San Diego. She double majored in Animal Physiology & Neuroscience and French Literature. She got very involved with several non-profit medical organizations such as Medicine for Humanity and The Flying Samaritans and worked on the field as well as behind the scenes in fundraising. Because she is fluent in French and Arabic, she also pursued a career in multimedia adapting software to foreign markets, and worked full time while in school. During her last year at UCSD, she took a couple of acting classes as electives and caught the bug instantly. Even though socially conscious, she decided not to pursue a career in medicine but rather acting which has proved to be a stronger passion. In her spare time, she loves to travel, read, do yoga, and cook big meals, red wine in hand while listening to Andrea Bocelli VERY loud! And then, there's her love for shoes...","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MTEyNTYwN15BMl5BanBnXkFtZTgwNTA5NjI1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4553019","name":"Nawal Bengholam","idIMDB":"nm4553019"},"actorId":"nm4553019","character":"Newscaster","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peyman Moaadi","urlProfile":"http://www.imdb.com/name/nm1818216","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTI2NDQ5NV5BMl5BanBnXkFtZTgwMjM3Mjc1MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1970","placeOfBirth":" New York City, New York, USA","height":"5' 7\" (1.7 m)","bio":"Peyman Maadi was born in 1972 in New York City to an Iranian couple. His father was a lawyer. His family moved back to Iran when he was 5 years old. He graduated in Metallurgical Engineering from Karaj Azad University. Maadi started his film career as a screenwriter in late 2000s. He is the writer of several famous Iranian films. He started his acting career in Asghar Farhadi's film À propos d'Elly (2009). Two years later, he received the Silver Bear award for Best Actor in Leading Role for his performance as Nader in Farhadi's A Separation (2011) from the Berlin International Film Festival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTI2NDQ5NV5BMl5BanBnXkFtZTgwMjM3Mjc1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1818216","name":"Peyman Moaadi","idIMDB":"nm1818216"},"actorId":"nm1818216","character":"Ali","urlCharacter":"http://www.imdb.com/character/ch0389413","main":true},{"actorName":"Lane Garrison","urlProfile":"http://www.imdb.com/name/nm1460812","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNzA1MjYxNV5BMl5BanBnXkFtZTgwNDQ2MTk5MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 May 1980","placeOfBirth":" Dallas, Texas, USA","birthName":"Lane Edward Garrison","height":"5' 9½\" (1.77 m)","bio":"Lane Garrison is an American actor,writer from Dallas, Texas. After he graduated from J.J. Pearce High School, where Jessica Simpson also attended, he moved to Los Angeles. He was 18 and only had 400$ to his name, but his love and passion for making movies paid off after years of perseverance when he landed the role of \" Tweener\" in the FOX hit TV series Prison Break. In addition to making movies and shooting TV shows as an actor, Lane is a successful screenwriter having sold three scripts he wrote on spec.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNzA1MjYxNV5BMl5BanBnXkFtZTgwNDQ2MTk5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1460812","name":"Lane Garrison","idIMDB":"nm1460812"},"actorId":"nm1460812","character":"Ransdell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"J.J. Soria","urlProfile":"http://www.imdb.com/name/nm1928515","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMTQwMzgxNl5BMl5BanBnXkFtZTcwNjcxMzI5Mw@@._V1_UY44_CR24,0,32,44_AL_.jpg","biography":{"height":"5' 8\" (1.73 m)","bio":"With distinguished roles in a variety of projects, Joseph Julian (J.J.) Soria is proving that he possesses the talent, energy and experience to bring memorable characters to life on the small and silver screen. Most recently, Soria was bumped up as a series regular on Lifetime's top rated series, \"Army Wives,\" so this year, he continues his role as Private First Class \"Hector Cruz.\" Although often cast as the bad boy, Soria has proven to have the chops to conquer many other roles, including comedic characters. His latest film Filly Brown (Olmos Productions), premiered at the 2012 Sundance Film Festival as part of the U.S. Dramatic Competition to rave reviews. Soria plays the lead antagonist, 'MC Wyatt' opposite Gina Rodriguez (Go For It). The film hits theaters in April 2013 after a long awaited delay and much controversy around the loss of the film's supporting actress, Latin superstar Jenni Rivera. Filly Brown was the fourth film to premiere at the Sundance Film Festival for Soria, his other films include All She Can (2011), High School (2010), and Hamlet 2 (2008). Soria additionally has a lead role the indie film Mission Park in the pipeline for 2013. This past year, Soria had remained in demand as he most recently wrapped two films. He shot a lead role in Ten Cent Pistol, a neo-noir heist film and stars alongside Joe Manegna and Jena Malone. In addition, he shot the lead in Salvatore Totino's directorial debut film: Every Hero's Dream. Every Hero's Dream, which focuses on Soria's character: a bad thug who boasts about outsmarting law enforcement but later has to come to terms with his own impending death. The projects do not have release dates yet. Additionally, Soria's acting resume includes featured guest spots on many of today's notable television shows including \"Dexter,\" \"The Shield,\" \"CSI: Miami, \"Sons of Anarchy, \"The Closer,\" \"Bones\" and \"Southland.\" In film, Soria's credits include Fast and Furious and Crank: High Voltage, High School (2010) and All She Can (2011). In 2008, he was buzzed about as one of the hottest breakout actors tied to his role in director Andrew Fleming's Hamlet 2, starring alongside Steve Coogan and Catherine Keener. The film is, and still remains, the third highest selling independent film coming out of the Sundance Film Festival. In his spare time, Soria finds ways to contribute to causes that are close to his heart. In 2011, he joined the Tough Mudder Run in northern and southern California to benefit the Wounded Warriors Program, an organization that provides assistance to wounded U.S. Veterans and their families. In addition, Soria, regularly contributes to The National Multiple Sclerosis Society, and recently participated on their annual walk in honor of his friend who was diagnosed with the condition. Soria resides in Los Angeles, CA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMTQwMzgxNl5BMl5BanBnXkFtZTcwNjcxMzI5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1928515","name":"J.J. Soria","nicknames":["J.J."],"idIMDB":"nm1928515"},"actorId":"nm1928515","character":"Rico","urlCharacter":"http://www.imdb.com/character/ch0389543","main":true},{"actorName":"Mark Naji","urlProfile":"http://www.imdb.com/name/nm3542722","urlPhoto":"","biography":{"dateOfBirth":"7 April 1976","placeOfBirth":" Lagos, Nigeria","height":"5' 9\" (1.75 m)","bio":"An actor who finds himself occasionally writing and directing, Mark Naji made his Big Screen debut opposite Kristen Stewart in the controversial indie drama Camp X-Ray (2014), director Peter Sattler praised Mark on his daring performance as the hatred fueled Detainee. Mark is no stranger to TV, he made his first TV appearance as Fadi on Fox's short lived drama Touch (2012) starring Kiefer Sutherland. Mark's dedication to his craft led him to the Stage, portraying one of the most popular figures in history, Lebanese Artist, Poet and Writer, Kahlil Gibran. Mark Naji was born in Lagos, Nigeria to Druze Immigrants as Marwan Naji Khouzam. His father Naji, was a successful General Contractor in Lagos up until his death in (2008). His mother Najah dedicated her life to raising him and his three sisters. Shortly after graduating Summa Cum Laude from St. John's University in New York with a degree in Computer Science, (January 2002), Mark decided to pursue acting full time.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3542722","name":"Mark Naji","nicknames":["Meemo"],"idIMDB":"nm3542722"},"actorId":"nm3542722","character":"Detainee #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anoop Simon","urlProfile":"http://www.imdb.com/name/nm5424765","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyODU0NTQ2OF5BMl5BanBnXkFtZTgwNjc4MzQ5MDE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"birthName":"Anoop Shamim","height":"5' 10\" (1.78 m)","bio":"Anoop Simon is a Pakistani American Actor born in Doha, Qatar and was raised in Reno, NV. While his parents are Pakistani Christians, they chose to give him a very traditional Indian first name. Anoop is oldest of three kids. While attending Galena High school he met one of his best friends Jeremy McGuigan. Anoop quickly joined Jeremy's stage magic show and got the bug for entertaining and acting. Anoop alongside Jeremy were performing big stage illusions in-front of live crowds. Anoop credits his now Improv and acting skills to those days of working with live audiences. He graduated from Galena H.S. and then joined the US Navy to pursue his education in Medicine at the age of 17. Anoop honorably served in the U.S. Navy for eight years and even had a chance to serve and live in Japan for three years. During his service he toured with the U.S. Marine Corps as a Hospital Corpsman/Combat Medic while stationed in Iraq and Kuwait during Operation Iraqi Freedom. Anoop has achieved numerous ribbons and medals during his service; most notably a Presidential Unit Citation medal awarded by the president of the United States to his unit for extraordinary heroism in action against armed enemies. Anoop's military training opened the door for a career as a professional Surgical Scrub/Asst. After his distinguished military service and medical career as a successful and respected Surgical Scrub/Asst. he took on a new vision. Anoop took the first step towards his lifelong dream of being an actor by enrolling in an acting school. The acting training received through Take2Performers Studio in Reno,NV. opened the door for representation from an L.A. based talent agency. In January 2012, Anoop left his hometown of Reno for Hollywood to pursue his dream of becoming a professional actor. Since his arrival in L.A. he has had many opportunities and doors open. In just his first year he became member of the prestigious Screen Actors Guild (SAG) and American Federation of Television and Radio Artists (AFTRA) making him a bona fide actor. He has been featured in numerous TV shows and upcoming feature films. Anoop has met and worked alongside some of Hollywood's greatest and continues to do so. He is actively living his dream as a professional working actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyODU0NTQ2OF5BMl5BanBnXkFtZTgwNjc4MzQ5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5424765","name":"Anoop Simon","nicknames":["Simon","Anoop"],"idIMDB":"nm5424765"},"actorId":"nm5424765","character":"Detainee #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kristen Stewart","urlProfile":"http://www.imdb.com/name/nm0829576","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMjUyOTY0Ml5BMl5BanBnXkFtZTcwNjI2MjA2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1990","placeOfBirth":" Los Angeles, California, USA","birthName":"Kristen Jaymes Stewart","height":"5' 5\" (1.65 m)","bio":"Though most famous for her role as Isabella \"Bella\" Swan in The Twilight (2008) Saga, Kristen Stewart has been a working actor since her early years in Los Angeles, California, where she was born. Her parents, John Stewart and Jules Stewart, both work in film and television. Her mother is Australian. The family includes three boys, her older brother Cameron Stewart and two adopted brothers Dana and Taylor. After a talent scout caught her grade school performance in a Christmas play at the age of eight, she appeared on television in a few small roles. Her first significant role came when she was cast as Sam Jennings in The Safety of Objects (2001). Soon after that, she starred alongside Jodie Foster in the hit drama, Panic Room (2002) and was nominated for a Young Artist Award. Praised for her Panic Room performance, she went on to join the cast of Cold Creek Manor (2003) as the daughter of Dennis Quaid and Sharon Stone. Though the film did not do well at the box office, she received another nomination for a Young Artist Award. After appearing in a handful of movies and a Showtime movie called Speak (2004), Stewart was cast in the role of a teenage singer living in a commune in Sean Penn's Into the Wild (2007), a critically acclaimed biopic. A third Young Artist Award nomination resulted in a win for this role. She also appeared in Mary Stuart Masterson's The Cake Eaters (2007) that same year. Just 17, Stewart took on the starring role in Twilight (2008) which was based on a series of the same name written by Stephenie Meyer, the novel already had a huge following and the film opened to fans anxious to see the vampire romance brought to life. Awarded the MTV Movie Award for Best Female Performance, Stewart's turn as Bella continued in the sequels The Twilight Saga: New Moon (2009) and The Twilight Saga: Eclipse (2010). The final installments of the series start filming in late 2010. Despite her stratospheric launch into stardom with the Twilight films, she stayed true to her roots by working on a number of indie projects, including Adventureland (2009) (filmed prior to the Twilight series) and Welcome to the Rileys (2010). And she took on the daunting task of playing hard rocker Joan Jett in Floria Sigismondi's The Runaways (2010) alongside Dakota Fanning. Stewart received praise for her acting and musical performances and later won the 2010 BAFTA Rising Star Award and best actress at the Milan International Film Festival for Welcome to the Rileys (2010). Stewart starred in several other movies filmed between the Twilight Saga installments including the #1 summer box office hit, Snow White and the Huntsman (2012), and the Cannes selection Sur la route (2012) A few of Stewart's following projects are: Sundance drama Camp X-Ray (2014), Cannes selection Sils Maria (2014) for which she won a César award, and the Lionsgate distributed action comedy, American Ultra (2015), starring the Adventureland (2009) duo. Stewart continues to live in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMjUyOTY0Ml5BMl5BanBnXkFtZTcwNjI2MjA2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0829576","name":"Kristen Stewart","nicknames":["Kris","KStew","Stew"],"idIMDB":"nm0829576"},"actorId":"nm0829576","character":"Cole","urlCharacter":"http://www.imdb.com/character/ch0389138","main":true},{"actorName":"Cory Michael Smith","urlProfile":"http://www.imdb.com/name/nm5754425","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NzY4NzgzOF5BMl5BanBnXkFtZTgwNDU2NzAzMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 0½\" (1.84 m)","bio":"Cory Michael Smith is an actor, known for Carol (2015), Gotham (2014) and Olive Kitteridge (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NzY4NzgzOF5BMl5BanBnXkFtZTgwNDU2NzAzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5754425","name":"Cory Michael Smith","idIMDB":"nm5754425"},"actorId":"nm5754425","character":"Bergen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ser'Darius Blain","urlProfile":"http://www.imdb.com/name/nm3843144","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE4MTQ0NzUzMF5BMl5BanBnXkFtZTcwNjE0NTc4OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 4½\" (1.94 m)","bio":"Ser'Darius Blain is an actor and writer, known for Star Trek Into Darkness (2013), Footloose (2011) and When the Game Stands Tall (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE4MTQ0NzUzMF5BMl5BanBnXkFtZTcwNjE0NTc4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3843144","name":"Ser'Darius Blain","idIMDB":"nm3843144"},"actorId":"nm3843144","character":"Jackson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tara Holt","urlProfile":"http://www.imdb.com/name/nm2849965","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NDA2MDU1M15BMl5BanBnXkFtZTgwMDkxMTExMDI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 February 1988","placeOfBirth":" Newport Beach, California, USA","birthName":"Tara Ashley Holt","height":"5' 5\" (1.65 m)","bio":"Tara Ashley Holt was born and raised in Newport Beach, California to parents Kristy and Steven Holt. She has two brothers, Trevor and Tyler and her sister Kelly. Tara began acting in drama classes and productions throughout elementary school and junior high. Her passion for acting soon got her accepted into one of the most prestigious art schools in the West: Orange County High School of the Arts (OCHSA), concentrating her round-the-clock studies on acting and drama courses. After graduating high school, Tara moved to Los Angeles and promptly began booking steady film, television, commercial, and print jobs. Continued dedication to developing her career allowed Tara to graduate top of her class at the Sanford Meisner Studio, where she trained to perfect her craft with uncommon discipline.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NDA2MDU1M15BMl5BanBnXkFtZTgwMDkxMTExMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2849965","name":"Tara Holt","idIMDB":"nm2849965"},"actorId":"nm2849965","character":"Mary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"LaDell Preston","urlProfile":"http://www.imdb.com/name/nm2803536","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDk0MzgzMF5BMl5BanBnXkFtZTcwODA1NTQzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"LaDell Preston is known for his work on Batman v Superman: Dawn of Justice (2016), The Hunger Games (2012) and Straight Outta Compton (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDk0MzgzMF5BMl5BanBnXkFtZTcwODA1NTQzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2803536","name":"LaDell Preston","idIMDB":"nm2803536"},"actorId":"nm2803536","character":"IRF #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Daniel Leavitt","urlProfile":"http://www.imdb.com/name/nm2513187","urlPhoto":"","biography":{"height":"6' 1\" (1.85 m)","bio":"Daniel Leavitt is known for his work on Jason Bourne (2016), Ted (2012) and The Amazing Spider-Man 2 (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2513187","name":"Daniel Leavitt","idIMDB":"nm2513187"},"actorId":"nm2513187","character":"IRF #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marco Khan","urlProfile":"http://www.imdb.com/name/nm0434879","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3MTUzNDI0NjheQTJeQWpwZ15BbWU4MDExMTA5NDQx._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Marco Khan(lian) is a true citizen of the world. He was born March 27th of Armenian parents in Tehran, Iran. His father, Levon was born in Lebanon and raised in Iran where he met his wife Anna, born in Babol, Iran. Marco's grandparents (from his mother's side) were a grandfather from Russia and a grandmother from the country of Georgia. Marco and his younger brother left Iran at age 11 in pursuit of higher education. Schooled in Venice, Italy and then in Catalina Island, California. Marco now calls Los Angeles, CA, home. At age 17, Marco picked up English as his 4th language and assumed the responsibility as the caretaker for his entire family. While operating a series of restaurants for 12 years to support his family, Marco enjoyed brief stints as a Professional Athlete in Soccer, Football and Pro Wrestling! After his father passed away, he decided to pursue his lifelong passion of becoming an actor. His looks, talent, and diverse background have allowed Marco to play a variety of interesting characters. He is a versatile actor, achieving success in comedy, action and drama. Despite his \"tough guy\" appearance, his demeanor is quiet, gentle, gracious and sincere. As a father, he loves children and animals. Almost everyone who meets Marco agrees that there is \"Just something special that draws you towards him.\" He is a kind and tolerant humanitarian who is relentless in his pursuit for peace. Always positive and encouraging to others, \"Never Give Up\" is the motto he lives by. Marco is a true believer that everything happens for a reason, that tests and trials in life shape your character and that his destiny is in God's hands.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyNjExNzk0MV5BMl5BanBnXkFtZTgwNDY2MTU5NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0434879","name":"Marco Khan","idIMDB":"nm0434879"},"actorId":"nm0434879","character":"Mahmoud","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julia Duffy","urlProfile":"http://www.imdb.com/name/nm0240564","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjdkZjVhZDEtYjNhMi00NDgyLWE2YzEtZTkzZDE1ODY2YzhhXkEyXkFqcGdeQXVyMTY1OTI0OTI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 June 1951","placeOfBirth":" Ramsey County, Minnesota, USA","birthName":"Julia Margaret Hinds","height":"5' (1.52 m)","bio":"Julia Duffy was born on June 27, 1951 in Ramsey County, Minnesota, USA as Julia Margaret Hinds. She is an actress, known for Newhart (1982), Designing Women (1986) and Looking (2014). She has been married to Jerry Lacy since June 21, 1984. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjdkZjVhZDEtYjNhMi00NDgyLWE2YzEtZTkzZDE1ODY2YzhhXkEyXkFqcGdeQXVyMTY1OTI0OTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0240564","name":"Julia Duffy","idIMDB":"nm0240564"},"actorId":"nm0240564","character":"Cole's Mother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Tarpinian","urlProfile":"http://www.imdb.com/name/nm4730243","urlPhoto":"","biography":{"bio":"Robert Tarpinian is known for his work on Camp X-Ray (2014), The Last Ship (2014) and Gone Girl (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4730243","name":"Robert Tarpinian","idIMDB":"nm4730243"},"actorId":"nm4730243","character":"Detainee #3","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2994190","urlIMDB":"http://www.imdb.com/title/tt2994190","business":{"budget":{"money":"$1,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":null,"country":null,"day":"25","month":"12","year":"2014","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/2013/\">2013</a>"},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/2013/\">2013</a>"},{"money":"<a","country":"href=\"/date/07-17/\">17","day":null,"month":null,"year":"","remarks":"<a href=\"/date/08-13/\">13 August</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 57 min (117 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa, Zeiss Ultra Prime and Fujinon Alura Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.0","metascore":"54","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[{"award":"Abu Dhabi Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Black Pearl Award","categories":[{"category":"New Horizons Competition","names":[{"name":"Peter Sattler","id":"nm0972104","role":null}]}]}]},{"award":"Casting Society of America, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Outstanding Achievement in Casting - Low Budget Feature - Drama","names":[{"name":"Richard Hicks","id":"nm0382947","role":null}]}]}]},{"award":"Humanitas Prize 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Humanitas Prize","categories":[{"category":"Sundance Film Category","names":[{"name":"Peter Sattler","id":"nm0972104","role":"writer"}]}]}]},{"award":"Sundance Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Grand Jury Prize","categories":[{"category":"Dramatic","names":[{"name":"Peter Sattler","id":"nm0972104","role":null}]}]}]},{"award":"Women Film Critics Circle Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated WFCC Award","categories":[{"category":"Best Movie About Women","names":[]},{"category":"Best Actress","names":[{"name":"Kristen Stewart","id":"nm0829576","role":null}]}]}]}],"votes":"31,692","type":"Movie","companyCreditsSimple":[{"idCompany":"co0329699","name":"GNK Productions"},{"idCompany":"co0080580","name":"Gotham Group"},{"idCompany":"co0291982","name":"Rough House Pictures"}],"keywords":{"keywords":["guantanamo bay","female protagonist","unlikely friendship","covered in feces","reference to harry potter","thick accent","american abroad","military police","female soldier","feces poured on someone","detainee","strong female lead","strong female character","hope","dignity","humanity","cuba"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:47:01"}}