{"data":{"movies":[{"title":"The Guest","originalTitle":"","year":"2014","releaseDate":"20140905","directors":[{"name":"Adam Wingard","id":"nm1417392"}],"writers":[{"name":"Simon Barrett","id":"nm1440023"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQyODc5MTAwM15BMl5BanBnXkFtZTgwNjMwMjA1MjE@._V1.jpg","countries":["USA","UK"],"languages":["English"],"genres":["Action","Crime","Mystery","Sci-Fi","Thriller"],"plot":"A soldier introduces himself to the Peterson family, claiming to be a friend of their son who died in action. After the young man is welcomed into their home, a series of accidental deaths seem to be connected to his presence.","simplePlot":"A soldier introduces himself to the Peterson family, claiming to be a friend of their son who died in action. After the young man is welcomed into their home, a series of accidental deaths seem to be connected to his presence.","actors":[{"actorName":"Dan Stevens","urlProfile":"http://www.imdb.com/name/nm1405398","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTY5OTI2MF5BMl5BanBnXkFtZTgwNDkzMzIxMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1982","placeOfBirth":" Croydon, Surrey, England, UK","birthName":"Daniel Jonathan Stevens","height":"6' (1.83 m)","bio":"Dan Stevens was born at Croydon in Surrey on 10th October 1982. His parents are teachers. He was educated at Tonbridge School and trained in acting at the National Youth Theatre of Great Britain. He studied English Literature at Emmanuel College, Cambridge. Whilst he was a Cambridge undergraduate, he acted in several student drama productions. He played the title role in the Marlowe Dramatic Society's production of William Shakespeare's play, \"Macbeth\". This was staged at the Cambridge Arts Theatre from Tuesday 26th February to Saturday 2nd March 2002. The cast also featured Rebecca Hall in the roles of Lady Macbeth and Hecate. During one of his university summer holidays in August 2003 he went to Slovakia where he filmed his scenes for the Hallmark production of Frankenstein (2004). Dan played the part of Henry Clerval and the mini-series was first broadcast on American television on 5th October 2004. Shortly after graduating from Cambridge Dan was nominated for an Ian Charleson award for his performance as Orlando in \"As You Like It\" at the Rose Theatre at Kingston in Surrey. \"As You Like It\" was directed by Peter Hall and ran from 30th November to 18th December 2004. This production for the Peter Hall Company subsequently went on a tour of America in the early months of 2005, playing at the Ahmanson Theatre in Los Angeles, the Curran Theater in San Francisco and the Harvey Theater at the Brooklyn Academy of Music in New York City. It featured Rebecca Hall in the role of Rosalind. Dan was reunited with the director Peter Hall when he played Claudio in a new production of the Shakespeare play, \"Much ado about Nothing\", for the Peter Hall Company at the Theatre Royal in Bath from 29th June to 6th August 2005. In February 2006 Dan played the parts of Marban and Maitland in a revival of Howard Brenton's controversial play, \"The Romans in Britain\", directed by Samuel West at the Crucible Theatre in Sheffield. Then in May 2006 he played Nick Guest, the protagonist in The Line of Beauty (2006). This three part television mini-series was adapted by Andrew Davies from the 2004 Booker prize winning novel by Alan Hollinghurst. The Line of Beauty (2006) is about Nick Guest's relationship with his university friend Toby Fedden. The story takes place in the 1980s. It is set against the backdrop of Margaret Thatcher's free market economic policies and the spread of the acquired immunity deficiency syndrome, (AIDS). These two social developments directly affect the characters in the story because Toby's father Gerald is a Conservative member of parliament and Nick is homosexual. Whilst The Line of Beauty (2006) was being broadcast on BBC television, Dan was appearing as Simon Bliss in the Noël Coward play, \"Hay Fever\". This play was staged at the Theatre Royal Haymarket in London from 11th April to 5th August 2006 and the cast also included Judi Dench in the role of Judith Bliss. At the end of the year Dan played Lord Holmwood in a television dramatization of Dracula (2006), which was broadcast on 28th December 2006. In 2007 Dan played the part of Michael Faber in Agatha Christie's Marple: Miss Marple: Nemesis (2007), an Agatha Christie adaptation with Geraldine McEwan in the role of Miss Jane Marple. He also featured in the cast of Maxwell (2007), a television drama about the famous newspaper magnate. Maxwell (2007) was first broadcast on British television on 4th May 2007. David Suchet played Robert Maxwell, and Dan took the part of Basil Brookes, one of the press baron's financial directors. Dan played the part of Edward Ferrars in a television dramatization of Jane Austen's novel, Sense & Sensibility (2008). This was broadcast in three episodes on BBC1 between Tuesday 1st and Sunday 13th January 2008. The novel was adapted for television by Andrew Davies, whom Dan had previously worked with on The Line of Beauty (2006). Davies felt that the part of Edward Ferrars was underdeveloped in the book, and so he deliberately added scenes not included in the novel to help draw out the character. So, for instance, we saw Edward out horse riding on the Norland estate and chopping logs at Barton Cottage. In the DVD audio commentary Dan joked that this was the best example of log chopping ever seen on British television! After Sense & Sensibility (2008), Dan featured in the cast of \"The Tennis Court\", a BBC Radio 4 Saturday play broadcast on 19th January 2008. He also played Nicky Lancaster in a revival of the Noël Coward play, \"The Vortex\", at the Apollo Theatre in London from Wednesday 20th February to Saturday 7th June 2008. This was another collaboration with the stage director, Peter Hall. Dan played the eponymous hero of \"Dickens Confidential\", a six part radio drama series set in the 1830s which imagines what might have happened if Charles Dickens had continued his career as a journalist. This was broadcast on BBC Radio 4 between Monday 9th June and Monday 14th July 2008. He played the part of Peregrine in 'Orley Farm', the BBC Radio 4 Classic Serial. This was a three part adaptation of the novel by Anthony Trollope broadcast between Sunday 28th December 2008 and Sunday 11th January 2009. A month later he played Duval in the BBC Radio 4 Woman's Hour drama, 'The Lady of the Camellias'. This was broadcast between Monday 2nd and Friday 6th February 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTY5OTI2MF5BMl5BanBnXkFtZTgwNDkzMzIxMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1405398","name":"Dan Stevens","idIMDB":"nm1405398"},"actorId":"nm1405398","character":"\"David\"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maika Monroe","urlProfile":"http://www.imdb.com/name/nm2140860","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwODE2MDg5N15BMl5BanBnXkFtZTcwNDM3MDQ0OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 May 1993","placeOfBirth":" Santa Barbara, California, USA","birthName":"Dillon Monroe Buckley","height":"5' 6\" (1.68 m)","bio":"Santa Barbara-born Maika Monroe's initial desire was to pursue a career in professional freestyle kiteboarding (kite surfer). Following in her father's footsteps, she started the sport at the age of 13. She moved to the Dominican Republic's north coast of Cabarete in her senior year of high school to train full-time while she completed her studies online. From then on, her athletic path prospered and she received second place in the International Red Bull Air Competition.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwODE2MDg5N15BMl5BanBnXkFtZTcwNDM3MDQ0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2140860","name":"Maika Monroe","idIMDB":"nm2140860"},"actorId":"nm2140860","character":"Anna Peterson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brendan Meyer","urlProfile":"http://www.imdb.com/name/nm2063811","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyNDg3NzE4N15BMl5BanBnXkFtZTgwOTQwNTI2NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1994","placeOfBirth":" Kitchener-Waterloo, Ontario, Canada","height":"5' 7\" (1.7 m)","bio":"Brendan Meyer is an accomplished actor in both theatre and film/TV. He has filmed throughout North America: in LA, New Mexico, Toronto and Vancouver, as well as his home town of Edmonton. In addition to his writing and directorial debut, the short film, A Job, Brendan has written several screenplays and shorts that he hopes to direct and produce in the future. Best known for his love for and extensive knowledge of live theatre, film, and TV, Brendan is a well respected contributor to the acting community. Brendan has performed in three seasons with the Freewill Shakespeare Festival in Edmonton. His past theatre credits include Macbeth, Much Ado About Nothing, Titus Andronicus, Comedy of Errors and Richard III (Freewill Players); and Beneath The Ice (Fringe Theatre Adventures). He also has numerous directing (Fourteen, The Tempest) and acting (The Haunting of Hathaway House, The Tempest, Twelfth Night and An Unnatural Turn) projects with Celsius Youth Theatre, where he is the co-founder and was a co-artistic director before his film/TV career took him to Vancouver. A self-professed Shakespeare nerd who has written many of his own Shakespeare adaptations, Brendan is an avid theatre goer who has traveled to New York, London, and Stratford-Upon-Avon to see many great plays and musicals. He maintains an extensive library of plays and books on the industry. When he has free time, you can find him in front of a movie screen, studying the greats such as Humphrey Bogart ,Leonardo DiCaprio and anything by Woody Allen. Brendan is very committed to giving back. He has strong ties with Vancouver based Project Limelight, an inner city youth theatre program, and One! International, an organization running schools for disadvantaged youth in India. He lives in Vancouver, BC.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyNDg3NzE4N15BMl5BanBnXkFtZTgwOTQwNTI2NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2063811","name":"Brendan Meyer","idIMDB":"nm2063811"},"actorId":"nm2063811","character":"Luke Peterson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sheila Kelley","urlProfile":"http://www.imdb.com/name/nm0445992","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NTkxMjI5NF5BMl5BanBnXkFtZTcwNDI4Mjc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1961","placeOfBirth":" Greensburg, Pennsylvania, USA","height":"5' 7\" (1.7 m)","bio":"When Sheila Kelley starred in and produced the film, Dancing at the Blue Iguana (2000), she prepared for the role of \"Stormy\" by learning how to striptease and pole dance. As a result, her body became long, lean and fit. She decided to take her knowledge of ballet, exercise and exotic dancing and combine them into a fitness dance workout for women called \"S Factor\"'. Kelley wrote \"The S Factor: Strip Workouts for Every Woman\" and has several \"S Factor\" exercise DVDs. Her roles on L.A. Law (1986), Sisters (1991), ER (1994) and The Sopranos (1999) and in films including Singles (1992), Matchstick Men (2003), Nurse Betty (2000) and One Fine Day (1996) have earned her respect, as an actress who is not afraid of embracing the power of her femininity. She is married to actor Richard Schiff, of The West Wing (1999), and has two children, Gus and Ruby. By: S Factor","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NTkxMjI5NF5BMl5BanBnXkFtZTcwNDI4Mjc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0445992","name":"Sheila Kelley","idIMDB":"nm0445992"},"actorId":"nm0445992","character":"Laura Peterson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leland Orser","urlProfile":"http://www.imdb.com/name/nm0650702","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwODE2ODM5OF5BMl5BanBnXkFtZTgwODc5NzIyMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1960","placeOfBirth":" San Francisco, California, USA","birthName":"Leland Jones Orser","height":"5' 8½\" (1.74 m)","bio":"Leland Orser was born on August 6, 1960 in San Francisco, California, USA as Leland Jones Orser. He is an actor and director, known for Taken (2008), Taken 2 (2012) and Se7en (1995). He has been married to Jeanne Tripplehorn since October 14, 2000. They have one child. He was previously married to Roma Downey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwODE2ODM5OF5BMl5BanBnXkFtZTgwODc5NzIyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0650702","name":"Leland Orser","idIMDB":"nm0650702"},"actorId":"nm0650702","character":"Spencer Peterson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lance Reddick","urlProfile":"http://www.imdb.com/name/nm0714698","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MDkyMjk5OV5BMl5BanBnXkFtZTcwNDUxMzc0Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1962","placeOfBirth":" Baltimore, Maryland, USA","height":"6' 2\" (1.88 m)","bio":"Lance Reddick was born in 1962 in Baltimore, Maryland, USA. He is an actor and producer, known for Fringe (2008), The Wire (2002) and John Wick (2014). He has been married to Stephanie Day since June 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MDkyMjk5OV5BMl5BanBnXkFtZTcwNDUxMzc0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0714698","name":"Lance Reddick","idIMDB":"nm0714698"},"actorId":"nm0714698","character":"Major Carver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tabatha Shaun","urlProfile":"http://www.imdb.com/name/nm3731746","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM0YjM3MGEtMmEzYy00N2I2LWI4OTYtZWQxZDJmMzdlZGY5XkEyXkFqcGdeQXVyMjIzMTEwMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 3\" (1.6 m)","bio":"Tabatha Shaun was born on September 19, 1988 in Milwaukee, WI. She trained in gymnastics, ballet, and modern dance until the age of 17. She attended State University of New York at Purchase College and graduated with a B.A. in Theatre with a minor in Evolutionary Anthropology at University of New Mexico. Most recently she worked alongside Dan Stevens and Maika Monroe in Adam Wingard's (You're Next) action/thriller \"The Guest\" and with James Remar on Daniel Lusko's \"Persecuted.\" Tabatha resides in New Mexico.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM0YjM3MGEtMmEzYy00N2I2LWI4OTYtZWQxZDJmMzdlZGY5XkEyXkFqcGdeQXVyMjIzMTEwMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3731746","name":"Tabatha Shaun","idIMDB":"nm3731746"},"actorId":"nm3731746","character":"Kristen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chase Williamson","urlProfile":"http://www.imdb.com/name/nm3311695","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkyMTcyOTc5N15BMl5BanBnXkFtZTgwNDkzMjA5MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 July 1988","placeOfBirth":" Coral Springs, Florida, USA","height":"5' 11\" (1.8 m)","bio":"Chase Williamson grew up in Southlake, Texas. In his youth, he received training at the Dallas Young Actors Studio and was heavily involved in theatre academically. He continued to further his training at the North Carolina School of the Arts summer session in 2005. He received a BFA in Acting from the University of Southern California. Within weeks of graduating, he landed the lead role in Don Coscarelli's John Dies at the End opposite Paul Giamatti. The film premiered at the Sundance Film Festival and his performance was critically acclaimed. He has since appeared in several more films including Adam Wingard's The Guest as well as the blockbuster web series Video Game High School.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjFlNWQ3NTEtZDkwOS00ZGUzLThhNGQtNTlhZmE1OTY5NGExXkEyXkFqcGdeQXVyMTMwMzE1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3311695","name":"Chase Williamson","idIMDB":"nm3311695"},"actorId":"nm3311695","character":"Zeke","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joel David Moore","urlProfile":"http://www.imdb.com/name/nm0601376","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEzZjlhMmQtYTNmNy00Yjc1LWE4N2YtNWRlNjAwN2MzYjY0L2ltYWdlXkEyXkFqcGdeQXVyMzk0NDMzOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1977","placeOfBirth":" Portland, Oregon, USA","birthName":"Joel David Moore","height":"6' 2\" (1.88 m)","bio":"Joel David Moore was born on September 25, 1977 in Portland, Oregon, USA. He is an actor and director, known for Avatar (2009), Dodgeball: A True Underdog Story (2004) and Grandma's Boy (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjVjNGUxMGUtYTA4Zi00NDY3LTk2ZGQtNDNjZjA2NWJmYmZhXkEyXkFqcGdeQXVyMzk0NDMzOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0601376","name":"Joel David Moore","idIMDB":"nm0601376"},"actorId":"nm0601376","character":"Craig","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve Brown","urlProfile":"http://www.imdb.com/name/nm5291520","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA5NTQzMTcxNV5BMl5BanBnXkFtZTgwNjA4Nzk3MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Steve Brown is known for his work on Ant-Man (2015), Batman v Superman: Dawn of Justice (2016) and X-Men: Apocalypse (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA5NTQzMTcxNV5BMl5BanBnXkFtZTgwNjA4Nzk3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5291520","name":"Steve Brown","idIMDB":"nm5291520"},"actorId":"nm5291520","character":"Mike","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brenden Wedner","urlProfile":"http://www.imdb.com/name/nm2833438","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MzAzOTEyNl5BMl5BanBnXkFtZTgwMjIzMjY0ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Brenden Wedner is known for his work on The Dark Knight Rises (2012), The Avengers (2012) and The Guest (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MzAzOTEyNl5BMl5BanBnXkFtZTgwMjIzMjY0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2833438","name":"Brenden Wedner","idIMDB":"nm2833438"},"actorId":"nm2833438","character":"Ian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alex Knight","urlProfile":"http://www.imdb.com/name/nm1790494","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODc0OTQzM15BMl5BanBnXkFtZTgwMzQ2NjI0MDI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Classically trained in performing arts, Alex Knight graduated from the University of New Mexico with a BFA in theatre. Alex spent over a decade performing and teaching improv at The Show in Albuquerque's Box Theater collecting well over 500 performances and a myriad of awards during his tenure. Now based in LA, Alex has found a comedy home with Gayley Street at The Improv Street, where he performs weekly. Alex is known for his role as Anthony in twenty-one episodes of the cult-hit web series Enter The Dojo, a wildly hilarious mockumentary about the world of franchised martial arts schools; often referred to as McDojos, where the self-defense they teach is so watered down and removed from its original art form that it's called \"Kool-Aid Karate\". Most recently, his short film, Slow Wallet took home a prize in the American Comedy Film category at the London-Worldwide Short Comedy Festival. Alex's formative years after theatre school graduation were spent mainly in New Mexico and enabled him to build a resume with credits in theatre, television and film. His television guest credits include Breaking Bad, Manhattan, The Messengers, In Plain Sight, and The Night Shift. Alex has had recurring roles in Scoundrels and Preacher and Supporting roles in features like Sicario, The Rediculous Six, Maze Runner: The Scorch Trials and Frank. On the legitimate stage, Alex has performed in countries around the world including Poland, Canada, Scotland, Uganda, Colombia and Serbia. Alex is a resident artist at of New Mexico's Tricklock Theatre Company, a touring ensemble that specializes in devised physical theatre. In addition to performing, Alex Knight is a professional visual artist. He is currently working on publishing his collected works.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3ODc0OTQzM15BMl5BanBnXkFtZTgwMzQ2NjI0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1790494","name":"Alex Knight","idIMDB":"nm1790494"},"actorId":"nm1790494","character":"Mr. Lyles","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ethan Embry","urlProfile":"http://www.imdb.com/name/nm0256121","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNTI4NDUyOF5BMl5BanBnXkFtZTgwMjc3OTYzNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1978","placeOfBirth":" Huntington Beach, California, USA","birthName":"Ethan Philian Randall","height":"5' 10\" (1.78 m)","bio":"Ethan Embry was born Ethan Philan Randall on June 13, 1978 in Huntington Beach, California, to Karen and Charles Randall. Before he started acting in movies, Ethan appeared in more than 100 TV and Radio commercials. In 1991, at the age of thirteen, he appeared in three films and has continued acting ever since. On average, Ethan released or filmed at least two films per year, which continued up until 1999, when he filmed about five films. Ethan spent most of his childhood in Southern California, growing up with his older brother, Aaron (said to be one of the best musicians in LA), and his little sister, Kessia. In 1998, he bought a home of his own. In the Fall of 1999, Ethan co-starred as Sebastian in the short-lived CBS sitcom Work with Me (1999). Sadly, due to lack of ratings, the show ended after only four episodes. 1999, however, did bring a happy event, Ethan's then-wife, Amelinda Smith, gave birth to their first child, whom they named Cogeian, after the Latin word \"cogeo,\" which means \"to think over.\" In the fall of 2000, Ethan starred as Derek Barnes in FreakyLinks (2000) on Fox. Thirteen episodes were shot, but the series was soon canceled after its debut. Later success include a role as detective Frank Smith on Dick Wolf's remake of the classic series Dragnet (2003), a part in the recent cult classic Harold & Kumar Go to White Castle (2004), and a guest-starring role on the series Numb3rs (2005). He has been married to actresses Amelinda Smith, with whom he has one child, and Sunny Mabrey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNTI4NDUyOF5BMl5BanBnXkFtZTgwMjc3OTYzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0256121","name":"Ethan Embry","idIMDB":"nm0256121"},"actorId":"nm0256121","character":"Higgings","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nancy Jeris","urlProfile":"http://www.imdb.com/name/nm0421956","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDU2OTE1MV5BMl5BanBnXkFtZTcwNDk4MzY1Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1935","placeOfBirth":" USA","height":"5' 8\" (1.73 m)","bio":"Nancy Jeris was born on March 16, 1935 in the USA. She is an actress, known for Transcendence (2014), The Guest (2014) and Sally and Sam (1965).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDU2OTE1MV5BMl5BanBnXkFtZTcwNDk4MzY1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0421956","name":"Nancy Jeris","idIMDB":"nm0421956"},"actorId":"nm0421956","character":"Secretary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matthew Page","urlProfile":"http://www.imdb.com/name/nm0656275","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDM0MDE0M15BMl5BanBnXkFtZTgwOTc4MjkxMzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Matt Page holds a Bachelor's Degree in Moving Image Arts from the College of Santa Fe. In 2006, Page co-founded Riffraff New Media, a New Mexico-based production company through which he has written and directed multiple award-winning short films that have screened all over the world. Page has appeared regularly on the WGN show \"Manhattan\" and has been seen in several feature films. He is also the creator and star of \"Enter The Dojo\", a comedic web series that has achieved over 11 million views on YouTube.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NDM0MDE0M15BMl5BanBnXkFtZTgwOTc4MjkxMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0656275","name":"Matthew Page","idIMDB":"nm0656275"},"actorId":"nm0656275","character":"Fireman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2980592","urlIMDB":"http://www.imdb.com/title/tt2980592","business":{"budget":{"money":"$5,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$199,763","country":"USA","day":"28","month":"09","year":"2014","remarks":""}],"weekendGross":[{"money":"$52,074","country":"USA","day":"28","month":"09","year":"2014","remarks":"21 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"17","month":"07","year":"2013","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 40 min (100 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa"],"laboratory":null,"filmLength":null,"negativeFormat":["Codex"],"cinematographicProcess":["ARRIRAW","Digital Intermediate"],"printedFilmFormat":null},"rating":"6.7","metascore":"76","filmingLocations":[{"location":"Moriarty, New Mexico, USA"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Actor","names":[{"name":"Dan Stevens","id":"nm1405398","role":null}]},{"category":"Best Thriller Film","names":[]}]}]},{"award":"BloodGuts UK Horror Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won BloodGuts UK Horror Award","categories":[{"category":"Best Actor","names":[{"name":"Dan Stevens","id":"nm1405398","role":"actor"}]}]}]},{"award":"BloodGuts UK Horror Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won BloodGuts UK Horror Award","categories":[{"category":"Best Film","names":[]},{"category":"Best Actor","names":[{"name":"Dan Stevens","id":"nm1405398","role":null}]},{"category":"Best Soundtrack/Score","names":[{"name":"Steve Moore","id":"nm1922014","role":null}]}]},{"titleAwardOutcome":"Nominated BloodGuts UK Horror Award","categories":[{"category":"Best Director","names":[{"name":"Adam Wingard","id":"nm1417392","role":null}]}]}]},{"award":"Detroit Film Critic Society, US 2014","titlesAwards":[{"titleAwardOutcome":"Nominated DFCS Award","categories":[{"category":"Breakthrough Artist","names":[{"name":"Dan Stevens","id":"nm1405398","role":"actor"}]}]}]},{"award":"Empire Awards, UK 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Empire Award","categories":[{"category":"Best Horror","names":[]},{"category":"Best Male Newcomer","names":[{"name":"Dan Stevens","id":"nm1405398","role":null}]}]}]},{"award":"Film Independent Spirit Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Independent Spirit Award","categories":[{"category":"Best Editing","names":[{"name":"Adam Wingard","id":"nm1417392","role":null}]}]}]},{"award":"Golden Schmoes Awards 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Best Horror Movie of the Year","names":[]},{"category":"Breakthrough Performance of the Year","names":[{"name":"Dan Stevens","id":"nm1405398","role":null}]}]}]},{"award":"iHorror Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated iHorror Award","categories":[{"category":"Best Male Horror Performance","names":[{"name":"Dan Stevens","id":"nm1405398","role":null}]},{"category":"Best Sleeper Horror","names":[{"name":"Adam Wingard","id":"nm1417392","role":null}]}]}]},{"award":"SXSW Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Nominated Audience Award","categories":[{"category":"Visions","names":[{"name":"Adam Wingard","id":"nm1417392","role":null}]}]}]},{"award":"The Joey Awards, Vancouver 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Joey Award","categories":[{"category":"Best Actor in a Feature Film Leading Role","names":[{"name":"Brendan Meyer","id":"nm2063811","role":null}]}]}]}],"votes":"69,967","type":"Movie","companyCreditsSimple":[{"idCompany":"co0133023","name":"HanWay Films"},{"idCompany":"co0188303","name":"Snoot Entertainment"}],"keywords":{"keywords":["ex soldier","teenager","neo 80s","murder","mysterious man","drug dealer","psychopath","experiment gone wrong","villain not really dead cliche","dog tag","blood splatter","pumpkin carving","running for your life","killing spree","hiding under a bed","harassment","classroom","shot in the neck","halloween decoration","bashing someone's head into a wall","halloween costume","strobe light","teenage boy","bullying","being followed","following someone","pickup truck","scarecrow","cellphone","farm","crawling on the floor","hall of mirrors","framed for murder","stabbed in the back","stabbed in the leg","shot in the shoulder","bloody footprint","jumping through a window","beer keg","breaking a bottle over someone's head","drink thrown into someone's face","bartender","grief","jack o'lantern","hit with a pool cue","one man army","stealing a car","british actor playing american character","quarry","firefighter","cd","party","jogging","man with no name","brawl","beating","underage drinking","nosebleed","small town","halloween","electronic music score","no opening credits","mercenary","pot smoking","diner","throat slitting","stabbed in the neck","stabbed in the chest","laptop","shot in the foot","shot in the leg","shot in the chest","shot in the forehead","shotgun","marijuana","waitress","arms dealer","fire","bar fight","bar","bully","high school student","grenade","car crash","detention","halloween party","maze","knife","bare chested male","kiss","sex scene","woman on top","black comedy","gay slur","death","stranger","slow motion weapon fire","faked death","commandeering a car","head on collision","chained door","crashing through a window","job promotion","bare breasts","face spattered with blood","shot with own gun","bloody nose","highball the drink","cosmopolitan the drink","hundred dollar bill","m67 grenade","tough guy","villain played by lead actor","overhead camera shot","corpse","beretta","assault rifle","homemade haunted house attraction","underground parking garage","false accusation of murder","special forces","blackmail","arrest","clothesline","360 degree well shot","restaurant","cigarette smoking","african american","rural setting","subjective camera","watching tv","20 year old","guest","friendship","medal","man wearing a towel","flashlight","protective male","title at the end","character says i love you","555 phone number","balisong","broken leg","character repeating someone else's dialogue","false identity","homage","escaped mental patient","suspense","car chase","one against many","slow motion scene","ambulance","fire truck","husband wife relationship","father son relationship","father daughter relationship","mother daughter relationship","mother son relationship","revenge","boyfriend girlfriend relationship","photograph","fistfight","bully comeuppance","bruise","deception","double cross","shot through a wall","shot through a window","betrayal","major","beer","high school principal","f word","strangulation","shot in the back","newspaper headline","shootout","revolver","pistol","punched in the face","brother sister relationship","military police","stabbed to death","shot to death","high school","suspicion","explosion","family relationships","machine gun","shot in the head","violence","blood","death of son","death of father","death of mother","death of friend","independent film","surprise ending","death of brother","woman wearing black lingerie","kissing while having sex","post traumatic stress disorder","premarital sex"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:22:56"}}