{"data":{"movies":[{"title":"Dolphin Tale 2","originalTitle":"","year":"2014","releaseDate":"20140912","directors":[{"name":"Charles Martin Smith","id":"nm0001747"}],"writers":[{"name":"Charles Martin Smith","id":"nm0001747"},{"name":"Karen Janszen","id":"nm0418321"}],"runtime":"107 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NzE4ODQwMV5BMl5BanBnXkFtZTgwMTc4OTA5MTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Family"],"plot":"It has been several years since young Sawyer Nelson and the dedicated team at the Clearwater Marine Hospital, headed by Dr. Clay Haskett, rescued Winter. With the help of Dr. Cameron McCarthy, who developed a unique prosthetic tail for the injured dolphin, they were able to save her life. Yet their fight is not over. Winter's surrogate mother, the very elderly dolphin Panama, has passed away, leaving Winter without the only poolmate she has ever known. However, the loss of Panama may have even greater repercussions for Winter, who, according to USDA regulations, cannot be housed alone, as dolphins' social behavior requires them to be paired with other dolphins. Time is running out to find a companion for her before the team at Clearwater loses their beloved Winter to another aquarium.","simplePlot":"The team of people who saved Winter's life reassemble in the wake of her surrogate mother's passing in order to find her a companion so she can remain at the Clearwater Marine Hospital.","actors":[{"actorName":"Morgan Freeman","urlProfile":"http://www.imdb.com/name/nm0000151","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MDMyMzI2OF5BMl5BanBnXkFtZTcwMzM2OTk1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1937","placeOfBirth":" Memphis, Tennessee, USA","height":"6' 2\" (1.88 m)","bio":"With an authoritative voice and calm demeanor, this ever popular American actor has grown into one of the most respected figures in modern US cinema. Morgan was born on June 1, 1937 in Memphis, Tennessee, to Mayme Edna (Revere), a teacher, and Morgan Porterfield Freeman, a barber. The young Freeman attended Los Angeles City College before serving several years in the US Air Force as a mechanic between 1955 and 1959. His first dramatic arts exposure was on the stage including appearing in an all-African American production of the exuberant musical Hello, Dolly!. Throughout the 1970s, he continued his work on stage, winning Drama Desk and Clarence Derwent Awards and receiving a Tony Award nomination for his performance in The Mighty Gents in 1978. In 1980, he won two Obie Awards, for his portrayal of Shakespearean anti-hero Coriolanus at the New York Shakespeare Festival and for his work in Mother Courage and Her Children. Freeman won another Obie in 1984 for his performance as The Messenger in the acclaimed Brooklyn Academy of Music production of Lee Breuer's The Gospel at Colonus and, in 1985, won the Drama-Logue Award for the same role. In 1987, Freeman created the role of Hoke Coleburn in Alfred Uhry's Pulitzer Prize-winning play Driving Miss Daisy, which brought him his fourth Obie Award. In 1990, Freeman starred as Petruchio in the New York Shakespeare Festival's The Taming of the Shrew, opposite Tracey Ullman. Returning to the Broadway stage in 2008, Freeman starred with Frances McDormand and Peter Gallagher in Clifford Odets' drama The Country Girl, directed by Mike Nichols. Freeman first appeared on TV screens as several characters including \"Easy Reader\", \"Mel Mounds\" and \"Count Dracula\" on the Children's Television Workshop (now Sesame Workshop) show The Electric Company (1971). He then moved into feature film with another children's adventure, Who Says I Can't Ride a Rainbow! (1971). Next, there was a small role in the thriller Blade (1973); then he played Casca in Julius Caesar (1979) and the title role in Coriolanus (1979). Regular work was coming in for the talented Freeman and he appeared in the prison dramas Attica (1980) and Brubaker (1980), Eyewitness (1981), and portrayed the final 24 hours of slain Malcolm X in Death of a Prophet (1981). For most of the 1980s, Freeman continued to contribute decent enough performances in films that fluctuated in their quality. However, he really stood out, scoring an Oscar nomination as a merciless hoodlum in Street Smart (1987) and, then, he dazzled audiences and pulled a second Oscar nomination in the film version of Driving Miss Daisy (1989) opposite Jessica Tandy. The same year, Freeman teamed up with youthful Matthew Broderick and fiery Denzel Washington in the epic Civil War drama Glory (1989) about freed slaves being recruited to form the first all-African American fighting brigade. His star continued to rise, and the 1990s kicked off strongly with roles in The Bonfire of the Vanities (1990), Robin Hood: Prince of Thieves (1991), and La puissance de l'ange (1992). Freeman's next role was as gunman Ned Logan, wooed out of retirement by friend William Munny to avenge several prostitutes in the wild west town of Big Whiskey in Clint Eastwood's de-mythologized western Unforgiven (1992). The film was a sh and scored an acting Oscar for Gene Hackman, a directing Oscar for Eastwood, and the Oscar for best picture. In 1993, Freeman made his directorial debut on Bopha! (1993) and soon after formed his production company, Revelations Entertainment. More strong scripts came in, and Freeman was back behind bars depicting a knowledgeable inmate (and obtaining his third Oscar nomination), befriending falsely accused banker Tim Robbins in The Shawshank Redemption (1994). He was then back out hunting a religious serial killer in Se7en (1995), starred alongside Keanu Reeves in Chain Reaction (1996), and was pursuing another serial murderer in Kiss the Girls (1997). Further praise followed for his role in the slave tale of Amistad (1997), he was a worried US President facing Armageddon from above in Deep Impact (1998), appeared in Neil LaBute's black comedy Nurse Betty (2000), and reprised his role as Alex Cross in Along Came a Spider (2001). Now highly popular, he was much in demand with cinema audiences, and he co-starred in the terrorist drama The Sum of All Fears (2002), was a military officer in the Stephen King-inspired Dreamcatcher (2003), gave divine guidance as God to Jim Carrey in Bruce Almighty (2003), and played a minor role in the comedy The Big Bounce (2004). 2005 was a huge year for Freeman. First, he he teamed up with good friend Clint Eastwood to appear in the drama, Million Dollar Baby (2004). Freeman's on-screen performance is simply world-class as ex-prize fighter Eddie \"Scrap Iron\" Dupris, who works in a run-down boxing gym alongside grizzled trainer Frankie Dunn, as the two work together to hone the skills of never-say-die female boxer Hilary Swank. Freeman received his fourth Oscar nomination and, finally, impressed the Academy's judges enough to win the Best Supporting Actor Oscar for his performance. He also narrated Steven Spielberg's War of the Worlds (2005) and appeared in Batman Begins (2005) as Lucius Fox, a valuable ally of Christian Bale's Bruce Wayne/Batman for director Christopher Nolan. Freeman would reprise his role in the two sequels of the record-breaking, genre-redefining trilogy. Roles in tentpoles and indies followed; highlights include his role as a crime boss in Lucky Number Slevin (2006), a second go-round as God in Evan Almighty (2007) with Steve Carell taking over for Jim Carrey, and a supporting role in Ben Affleck's directorial debut, Gone Baby Gone (2007). He co-starred with Jack Nicholson in the breakout hit The Bucket List (2007) in 2007, and followed that up with another box-office success, Wanted (2008), then segued into the second Batman film, The Dark Knight (2008). In 2009, he reunited with Eastwood to star in the director's true-life drama Invictus (2009), on which Freeman also served as an executive producer. For his portrayal of Nelson Mandela in the film, Freeman garnered Oscar, Golden Globe and Critics' Choice Award nominations, and won the National Board of Review Award for Best Actor. Recently, Freeman appeared in RED (2010), a surprise box-office hit; he narrated the Conan the Barbarian (2011) remake, starred in Rob Reiner's The Magic of Belle Isle (2012); and capped the Batman trilogy with The Dark Knight Rises (2012). Freeman has several films upcoming, including the thriller Now You See Me (2013), under the direction of Louis Leterrier, and the science fiction actioner Oblivion (2013), in which he stars with Tom Cruise.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MDMyMzI2OF5BMl5BanBnXkFtZTcwMzM2OTk1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000151","name":"Morgan Freeman","idIMDB":"nm0000151"},"actorId":"nm0000151","character":"Dr. Cameron McCarthy","urlCharacter":"http://www.imdb.com/character/ch0303992","main":true},{"actorName":"Ashley Judd","urlProfile":"http://www.imdb.com/name/nm0000171","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Mzg0ODcwOF5BMl5BanBnXkFtZTYwMzA2NDQz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 April 1968","placeOfBirth":" Granada Hills, California, USA","birthName":"Ashley Tyler Ciminella","height":"5' 7\" (1.7 m)","bio":"American actress and political activist Ashley Judd was born Ashley Tyler Ciminella on April 19, 1968, in Granada Hills, California. She grew up in a family of successful performing artists as the daughter of country music singer Naomi Judd and the sister of Wynonna Judd. While she is best known for an ongoing acting career spanning more than two decades, she has increasingly become involved in global humanitarian efforts and political activism.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Mzg0ODcwOF5BMl5BanBnXkFtZTYwMzA2NDQz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000171","name":"Ashley Judd","nicknames":["Ash","Sweet Pea"],"idIMDB":"nm0000171"},"actorId":"nm0000171","character":"Lorraine Nelson","urlCharacter":"http://www.imdb.com/character/ch0263745","main":true},{"actorName":"Kris Kristofferson","urlProfile":"http://www.imdb.com/name/nm0001434","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODM4NDY5MTYyMl5BMl5BanBnXkFtZTYwNjg1ODE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1936","placeOfBirth":" Brownsville, Texas, USA","birthName":"Kristoffer Kristofferson","height":"5' 11½\" (1.82 m)","bio":"Kris Kristofferson was born in Brownsville, Texas, to Mary Ann (Ashbrook) and Lars Henry Kristofferson. His paternal grandparents were Swedish, and his father was a United States Air Force general who pushed his son to a military career. Kris was a Golden Gloves boxer and went to Pomona College in California. From there, he earned a Rhodes scholarship to study literature at Oxford University. He ultimately joined the United States Army and achieved the rank of captain. He became a helicopter pilot, which served him well later. In 1965, he resigned his commission to pursue songwriting. He had just been assigned to become a teacher at USMA West Point. He got a job sweeping floors in Nashville studios. There he met Johnny Cash, who initially took some of his songs but ignored them. He was also working as a commercial helicopter pilot at the time. He got Cash's attention when he landed his helicopter in Cash's yard and gave him some more tapes. Cash then recorded Kristofferson's \"Sunday Morning Coming Down\", which was voted the 1970 Song of the Year by the Country Music Association. Kris was noted for his heavy boozing. He lost his helicopter pilot job when he passed out at the controls, and his drinking ruined his marriage to singer Rita Coolidge, when he was reaching a bottle and half of Jack Daniels daily. He gave up alcohol in 1976. His acting career nose-dived after making Heaven's Gate (1980). In recent years, he has made a comeback with his musical and acting careers. He does say that he prefers his music, but says his children are his true legacy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODM4NDY5MTYyMl5BMl5BanBnXkFtZTYwNjg1ODE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001434","name":"Kris Kristofferson","idIMDB":"nm0001434"},"actorId":"nm0001434","character":"Reed Haskett","urlCharacter":"http://www.imdb.com/character/ch0266052","main":true},{"actorName":"Juliana Harkavy","urlProfile":"http://www.imdb.com/name/nm3952890","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzYxMjY4MDg2OF5BMl5BanBnXkFtZTcwMTAzMjE3OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 8\" (1.73 m)","bio":"Juliana Harkavy is an American actress of Dominican, Russian, African, Chinese, and Hungarian descent. Born on New Years Day in New York City and raised in Los Angeles, Harkavy has been appearing in theater, film, and television since the age of nine. Juliana was born to mother Berta Carela, an artist, writer, and educator from Santo Domingo, and father Michael Harkavy, a Brooklyn native, also a writer, publisher, and athlete. Her only sibling, August, is thirteen years her junior. Juliana's passions were always based in the arts. She grew up playing music from the age of three, studying piano, guitar, voice, and flute. She also began writing and publishing music, stories, and poetry, as well as creating mixed-media visual art at a very young age. With a second passion for athletics and dance, she was able to create a balanced craft that would later prepare her for physically demanding roles, such as ex-military survivor Alicia in AMC's \"The Walking Dead\", and iconic comic book character Dinah Drake/The Black Canary on The CW's \"Arrow\". Harkavy studied theater under the Meisner studio at NYU's Tisch School of the Arts. Other working titles include: Two Streets Entertainment's \"To Write Love on Her Arms\", Warner Bros.' \"Dolphin Tale\", and \"Dolphin Tale 2\", NBC's \"Constantine\", and an award-winning performance as rookie detective Jessica Loren in Magnolia Picture's \"Last Shift.\" Harkavy resides in Los Angeles, CA with her husband and partner of ten years, Peter. Together they share a deep passion for animal rescue, with a focused interest in pit bulls.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzYxMjY4MDg2OF5BMl5BanBnXkFtZTcwMTAzMjE3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3952890","name":"Juliana Harkavy","idIMDB":"nm3952890"},"actorId":"nm3952890","character":"Rebecca","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harry Connick Jr.","urlProfile":"http://www.imdb.com/name/nm0001065","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwNjg0MTExOF5BMl5BanBnXkFtZTgwMTg4MTcxMDE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1967","placeOfBirth":" New Orleans, Louisiana, USA","birthName":"Joseph Harry Fowler Connick Jr.","height":"6' 1\" (1.85 m)","bio":"Joseph Harry Fowler Connick, Jr. was born in New Orleans, Louisiana. He is the son of Anita Frances (Levy), a lawyer and judge, and Harry Connick, Sr. (Joseph Harry Fowler Connick), who served as District Attorney of New Orleans from 1973 to 2003. His father is of Irish, English, and German ancestry, and his maternal grandparents were Jewish immigrants from Vienna, Austria and Minsk, Belarus. Harry, Jr.'s mother died of ovarian cancer when he was 13. His parents owned a record store and encouraged their son's interest in music - piano at age three, with a New Orleans jazz band aged ten. He won piano competitions while playing French Quarter clubs and attending the New Orleans Center for the Creative Arts. At eighteen, he studied at New York's Hunter College and later on at the Manhatan School of Music. At nineteen, he released his first album for Columbia Records and began an extended run performing at the Algonquin's Oak Room, followed a year later by his second album. He wrote the score and sang several songs for Rob Reiner's When Harry Met Sally... (1989), the soundtrack for which went multi-platinum. So far, while bringing back swing and big band music, he has earned one gold, four platinum and three multi-platinum albums, plus two Grammies. His film acting debut was as B-17 tail-gunner Clay Busby in Memphis Belle (1990). He played mass-murderer Daryll Lee Cullum in the Sigourney Weaver and Holly Hunter film Copycat (1995) and Captain Jimmy Wilder (\"Let's kick the tires and light the fires, big daddy!\") in Independence Day (1996). Harry lives in Connecticut, is married to the former model Jill Goodacre, and has three daughters, Georgia Tatom, Sara Kate and Charlotte.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwNjg0MTExOF5BMl5BanBnXkFtZTgwMTg4MTcxMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001065","name":"Harry Connick Jr.","nicknames":["The Vice-Chairman of the Board"],"idIMDB":"nm0001065"},"actorId":"nm0001065","character":"Dr. Clay Haskett","urlCharacter":"http://www.imdb.com/character/ch0263744","main":true},{"actorName":"Austin Stowell","urlProfile":"http://www.imdb.com/name/nm3271473","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2OTk0ODEwMl5BMl5BanBnXkFtZTgwNzc3ODY3NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Austin Stowell was born and raised in Kensington, Connecticut, by his father, Robert, a retired steelworker, and his mother, Elizabeth, a schoolteacher. He graduated from Berlin High School in 2003. Upon acceptance at the University of Connecticut in Storrs, Connecticut, he studied with the Department of Dramatic Arts, a division of the School of Fine Arts. He performed in several productions with the Connecticut Repertory Theatre, including Julius Caesar, It Can't Happen Here, and As You Like It. Stowell graduated with a Bachelor of Fine Arts in 2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2OTk0ODEwMl5BMl5BanBnXkFtZTgwNzc3ODY3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3271473","name":"Austin Stowell","idIMDB":"nm3271473"},"actorId":"nm3271473","character":"Kyle Connellan","urlCharacter":"http://www.imdb.com/character/ch0441665","main":true},{"actorName":"Nathan Gamble","urlProfile":"http://www.imdb.com/name/nm1997480","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NzI4MjgwMF5BMl5BanBnXkFtZTgwNzU0MjA1MjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 January 1998","placeOfBirth":" Tacoma, Washington, USA","height":"5' 4\" (1.63 m)","bio":"Nathan Gamble was born on January 12, 1998 in Tacoma, Washington, USA. He is an actor, known for The Dark Knight (2008), The Mist (2007) and Marley & Me (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NzI4MjgwMF5BMl5BanBnXkFtZTgwNzU0MjA1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1997480","name":"Nathan Gamble","idIMDB":"nm1997480"},"actorId":"nm1997480","character":"Sawyer Nelson","urlCharacter":"http://www.imdb.com/character/ch0250767","main":true},{"actorName":"Charles Martin Smith","urlProfile":"http://www.imdb.com/name/nm0001747","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDMxMDk2M15BMl5BanBnXkFtZTcwMzcxODYzMw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1953","placeOfBirth":" Van Nuys, California, USA","height":"5' 5\" (1.65 m)","bio":"Charles Martin Smith is an American film actor, writer, and director. Born in Van Nuys, California, Smith was discovered by a talent agent while acting in a school play, usually a rare occurrence. After a few years of working in film, he landed the role of Terry \"The Toad\" Fields in George Lucas' 1973 film, American Graffiti (1973). The sequel, More American Graffiti (1979), did not have the success of the original, but he gained notice in The Buddy Holly Story (1978), Never Cry Wolf (1983) and the successful Starman (1984). Smith's career continued mainly in supporting roles, but he received good reviews for his work in The Untouchables (1987). While his career was largely unremarkable in the 1990s after appearing in less successful films, such as Speechless (1994) and I Love Trouble (1994), Smith turned in a well-regarded performance in the TV miniseries Larry McMurtry's Streets of Laredo (1995) and a minor role in the big budget Deep Impact (1998). He was also one of the directors of the TV series Space: Above and Beyond (1995), as well as the director of the initial episode (\"Welcome to the Hellmouth\") that launched the hit TV series Buffy the Vampire Slayer (1997). Since the mid-1990s, Smith has increasingly focused on his work behind the camera. He directed the feature film Air Bud (1997) (Disney), and two TV miniseries for Hallmark Entertainment, Roughing It (2002) and Icon (2005). He also wrote and directed the feature film, The Snow Walker (2003), for Lion's Gate Films, based on a story by Farley Mowat (Never Cry Wolf (1983)), which marked a return to the Arctic for Smith. He then wrote and directed the feature film Stone of Destiny (2008), for Infinity Features and Odeon Sky, the true story of four young Scottish students who broke into Westminster Abbey in London to take back a sacred Scottish relic. The film stars Charlie Cox, Kate Mara and Robert Carlyle, and was nominated for Best Picture by the Scottish BAFTAS. He now resides in Canada and continues to add to production, directing, acting, and writing credits in a career that has spanned over 35 years. His next film, Dolphin Tale (2011), for Alcon (The Blind Side (2009)) and Warner Brothers, which he also wrote and directed, stars Harry Connick Jr., Ashley Judd, Morgan Freeman, and Winter, the dolphin, who plays herself in the film. The movie is scheduled to be released Sept. 23, 2011 by WB.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDMxMDk2M15BMl5BanBnXkFtZTcwMzcxODYzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001747","name":"Charles Martin Smith","idIMDB":"nm0001747"},"actorId":"nm0001747","character":"George Hughes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Austin Highsmith","urlProfile":"http://www.imdb.com/name/nm2047955","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmIwMjI1OGMtNmYwMS00YWY5LTg5OTItYjE5NGIyOWM2ODAyXkEyXkFqcGdeQXVyNzIyMjQyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1981","placeOfBirth":" Winston-Salem, North Carolina, USA","height":"5' 7\" (1.7 m)","bio":"Austin Highsmith was born on March 31, 1981 in Winston-Salem, North Carolina, USA. She is an actress and producer, known for Dolphin Tale (2011), Scream: The TV Series (2015) and Criminal Minds (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmIwMjI1OGMtNmYwMS00YWY5LTg5OTItYjE5NGIyOWM2ODAyXkEyXkFqcGdeQXVyNzIyMjQyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2047955","name":"Austin Highsmith","idIMDB":"nm2047955"},"actorId":"nm2047955","character":"Phoebe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carlos Gómez","urlProfile":"http://www.imdb.com/name/nm0326988","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjIzMDc2NzUwMV5BMl5BanBnXkFtZTgwMjg0MjE3MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1962","placeOfBirth":" New York City, New York, USA","bio":"Carlos Gomez's career spans over twenty years in film, television and theatre. The award winning actor first appeared as paramedic Raul Melendez in the hit series ER which garnered him a SAG Award for best ensemble cast for the episode \"The Healers\". He was also one of the leads of the A&E series \"THE GLADES\". Garnering critical praise prior to its launch, THE GLADES became the most watched original drama series telecast in A&E network history. Carlos also received a 2011 Imagen Award for best supporting actor in a television series for the show. He has portrayed an extensive variety of roles in some of the highest rated TV shows such as, FRIENDS, NYPD BLUE, BOSTON LEGAL, NCIS, CRIMINAL MINDS, CHARMED, SHARK, SLEEPER CELL, GANG RELATED, and most recently traveling to Cuba to film the last episode of HOUSE OF LIES for Showtime. His most recent role was as recurring character Jose Campos in the CBS hit series MADAM SECRETARY. His work in film has been equally impressive. These include DESPERADO, FOOLS RUSH IN, THE NEGOTIATOR, THE REPLACEMENT KILLERS, and HOUSE OF SAND AND FOG. Most recently he appeared in DOLPHIN TALE 2 and opposite Kevin Hart and Ice Cube in the franchise hit RIDE ALONG 2. In theatre, Carlos originated the role of Kevin Rosario on Broadway in the Tony Award winning musical 'In The Heights' with Lin Manuel Miranda. His two songs Inutil and Atencion were both part of the Grammy Award winning soundtrack musical as well. He reunited with Broadways HAMILTON and IN THE HEIGHTS director Tommy Kail in Quiara Algeria Hudes production DESTINY OF DESIRE at the Signature theater off broadway. Carlos resides in Los Angeles, New York and Miami.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjIzMDc2NzUwMV5BMl5BanBnXkFtZTgwMjg0MjE3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0326988","name":"Carlos Gómez","idIMDB":"nm0326988"},"actorId":"nm0326988","character":"Dr. Aslan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cozi Zuehlsdorff","urlProfile":"http://www.imdb.com/name/nm4077908","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0OTc5OTIyMF5BMl5BanBnXkFtZTgwMDQxNjA3OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 August 1998","placeOfBirth":" USA","height":"5' 4\" (1.63 m)","bio":"Cozi began her acting career at the age of eight when she was encouraged to audition for Annie at a local theater company in Aliso Viejo, Ca. At the time, Cozi thought it would be more fun to go see the musical than to be in it, but in the end decided to audition. She was cast as Annie and has been hooked on musical theater ever since. She has played Dorothy in The Wizard of Oz, JoJo in Seussical the Musical, Sally Brown in You're a Good Man Charlie Brown, and Brigitta in The Sound of Music, to name a few. Some time after she began performing in musicals, Cozi turned her attention to TV and film. She has been seen in commercials for Nestlé Water, Trident Layers gum, Blue Cross/ Blue Shield, Regions Bank, Amica Insurance and Buick. Cozi landed her first principal role as Hazel in the movie Dolphin Tale, produced by Alcon Entertainment and distributed by Warner Bros. Pictures. The film stars Morgan Freeman, Harry Connick Jr., Ashley Judd, Kris Kristofferson, and Nathan Gamble and was released on September 23, 2011, reaching number 1 at the box office in its second week. 3 years later, she reprised her role in Dolphin Tale 2. Cozi has also appeared in the TNT medical drama Monday Mornings as Trisha Miller, a young pianist with a brain tumor. She can be heard singing in many episodes of Sofia the First, as well as an episode of Jake and the Neverland Pirates (both on Disney Jr.), as part of the group vocals. In addition to acting, Cozi is also an accomplished musician, having studied piano for the past 8 years and performing in Regional Musical Theater Productions around Southern California. Cozi comes from a musical family and is now getting the chance to spread her musical wings with the release of her first project. Cozi's first serious attempt at songwriting came in November of 2013 during the filming of \"Dolphin Tale 2\". She started out with three songs, recorded them with a home studio software program and soon got the attention of Alcon Entertainment/ASG. Enter Eric Berdon, a writer/producer who met with Cozi to help her finish and produce \"Brave Souls\" which was featured in the end credits of the movie. Inspired by the success of \"Brave Souls,\" Zuehlsdorff has continued her songwriting and is now releasing her debut EP \"Originals\" on Thanksgiving Day, just in time for the holidays. \"Originals\" features seven songs, produced by Berdon and mixed by Grammy Award-winning mixer Craig Bauer at Hinge Studios in Los Angeles. This captivating EP blends Indie and Pop with an organic feel. Cozi lives in Orange County, California with her parents, her older sister, and their dog Bandit. She is a Christian and is home schooled, with a passion for singing, playing piano, writing music, working with children and making movies with her friends.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0OTc5OTIyMF5BMl5BanBnXkFtZTgwMDQxNjA3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4077908","name":"Cozi Zuehlsdorff","idIMDB":"nm4077908"},"actorId":"nm4077908","character":"Hazel Haskett","urlCharacter":"http://www.imdb.com/character/ch0303986","main":true},{"actorName":"Alana Cavanaugh","urlProfile":"http://www.imdb.com/name/nm6018094","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzU4NzA5NTM5NV5BMl5BanBnXkFtZTgwMTUzMTIzMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"4' 7\" (1.4 m)","bio":"Alana has always craved the spotlight. She began her acting career at age 5. In that short time, she has worked on 3 seasons of Halt and Catch Fire for AMC, Allegiant, Dolphin Tale 2 and now Dolly Parton's Christmas of Many Colors. Alana's passion for acting is fueled by her curiosity about \"how it's made\" and playing someone different for each project. When Alana's not in front of a camera, she is playing guitar, dancing, singing her heart out, or swimming with her little sister. She is extremely artistic and loves to create art and music.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzU4NzA5NTM5NV5BMl5BanBnXkFtZTgwMTUzMTIzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm6018094","name":"Alana Cavanaugh","idIMDB":"nm6018094"},"actorId":"nm6018094","character":"Toddler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cayla Brady","urlProfile":"http://www.imdb.com/name/nm6053666","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjkyMTA5NjMyMF5BMl5BanBnXkFtZTgwOTI3Njg4NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 November 1998","placeOfBirth":" Florida, USA","height":"5' 6½\" (1.69 m)","bio":"Cayla has been acting since the age of 7. She was chosen as one of the three little pigs in her school play and from there the stage was hers. Cayla continued with theater at school and local venues. In 2010, she was chosen as the stand-in/photo double for the feature film, Dolphin Tale, filmed in Clearwater, Florida. This opened Cayla's eyes to the world of film. She was asked to return for the same role in Dolphin Tale 2, and was also given a role as a Clearwater Marine Volunteer. Cayla continued her acting by shooting several commercials in Orlando, for Disney, Universal Studios, and various others. In the fall of 2014 Cayla wanted to experience the life of acting in Hollywood. She auditioned and was selected to be represented by the best agent in LA, in her opinion,The Osbrink Agency. Cayla has worked on the set of Killer Kids, an episodic that airs on Lifetime Network. She has also worked with some additional small, but great, production companies in TV series (web) called Tweet (season 1 & 2) and also The Awakening Tales. In early 2015 Cayla had the pleasure of working opposite Russell Crowe in the feature film, The Nice Guys. Being directed by Shane Black was an amazing experience. In her free time, Cayla enjoys playing guitar, piano, and video games. She also loves to sing and hang out with her friends. Cayla is a sweet, beautiful girl, inside and out. She is dedicated, smart and hardworking.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjkyMTA5NjMyMF5BMl5BanBnXkFtZTgwOTI3Njg4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm6053666","name":"Cayla Brady","idIMDB":"nm6053666"},"actorId":"nm6053666","character":"Clearwater Marine Volunteer","urlCharacter":"http://www.imdb.com/character/ch0466720","main":true},{"actorName":"Bethany Hamilton","urlProfile":"http://www.imdb.com/name/nm1703268","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgzMzg1NzgzNl5BMl5BanBnXkFtZTcwMjk2MDQ4NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1990","placeOfBirth":" Kauai, Hawaii, USA","height":"5' 11\" (1.8 m)","bio":"Bethany Hamilton is a Hawaii native who began her surfing career at age 11. By age 13, she was an accomplished surfer and well-respected in the surfing world. She came to national attention after her left arm was bitten off by a tiger shark on October 31, 2003. She has since made a full recovery and has returned to surfing. MTV Books published Hamilton's Book, 'Soul Surfer' from which the major motion picture is based.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgzMzg1NzgzNl5BMl5BanBnXkFtZTcwMjk2MDQ4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1703268","name":"Bethany Hamilton","idIMDB":"nm1703268"},"actorId":"nm1703268","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Nowicki","urlProfile":"http://www.imdb.com/name/nm0637441","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMDYwMDI5OV5BMl5BanBnXkFtZTYwNjM3NjAz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Tom Nowicki is an actor and producer, known for The Blind Side (2009), Flight (2012) and Remember the Titans (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMDYwMDI5OV5BMl5BanBnXkFtZTYwNjM3NjAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0637441","name":"Tom Nowicki","idIMDB":"nm0637441"},"actorId":"nm0637441","character":"Phillip J Hordern","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2978462","urlIMDB":"http://www.imdb.com/title/tt2978462","business":{"budget":{"money":"$36,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"HUF 9,495,355","country":"Hungary","day":"28","month":"09","year":"2014","remarks":""}],"gross":[{"money":"$33,618,190","country":"USA","day":"28","month":"09","year":"2014","remarks":""}],"weekendGross":[{"money":"$4,788,153","country":"USA","day":"28","month":"09","year":"2014","remarks":"3,376 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 47 min (107 min)"],"soundMix":["SDDS","Datasat","Dolby Digital","Dolby Atmos"],"color":["Color (ACES)"],"aspectRatio":["1.85 : 1"],"camera":["Sony CineAlta PMW-F55, Panavision Primo Lenses","Sony F65"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["2,398 m (6 reels)"],"negativeFormat":["AXSM","F55 4K 16bit Raw Digital","F65 4K 16bit Raw Digital"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","F55 RAW (4K) (source format)"],"printedFilmFormat":["35 mm (spherical) (Kodak Vision 2383)","D-Cinema"]},"rating":"6.4","metascore":"58","filmingLocations":[{"location":"Clearwater Beach, Florida, USA"}],"rated":"PG","awards":[{"award":"Young Artist Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in a Feature Film - Leading Young Actor","names":[{"name":"Nathan Gamble","id":"nm1997480","role":null}]},{"category":"Best Performance in a Feature Film - Leading Young Actress","names":[{"name":"Cozi Zuehlsdorff","id":"nm4077908","role":null}]}]}]}],"votes":"6,439","type":"Movie","companyCreditsSimple":[{"idCompany":"co0054452","name":"Alcon Entertainment"},{"idCompany":"co0080834","name":"Boxing Cat Films"},{"idCompany":"co0212151","name":"Color Force"}],"keywords":{"keywords":["dolphin","purple gloves","latex gloves","turtle","medical scrubs","syringe"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:06:14"}}