{"data":{"movies":[{"title":"Animal","originalTitle":"","year":"2014","releaseDate":"20150201","directors":[{"name":"Brett Simmons","id":"nm0799693"}],"writers":[{"name":"Thommy Hutson","id":"nm1443120"},{"name":"Catherine Trillo","id":"nm2067371"}],"runtime":"86 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3OTAxMjQzNl5BMl5BanBnXkFtZTgwODM4ODk4MTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Horror","Mystery","Thriller"],"plot":"When plans for a weekend vacation hit a dead end, a group of close-knit friends find themselves stranded in unfamiliar territory, pursued by a menacing, blood thirsty predator. Holed up in an isolated cabin, tensions mount as long-buried secrets are revealed. As the body count rises, the group must put their differences aside and fight for survival.","simplePlot":"When plans for a weekend vacation hit a dead end, a group of close-knit friends find themselves stranded in unfamiliar territory, pursued by a menacing, blood thirsty predator.","actors":[{"actorName":"Joey Lauren Adams","urlProfile":"http://www.imdb.com/name/nm0000725","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NzM0MjE0M15BMl5BanBnXkFtZTcwODQzODEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1968","placeOfBirth":" Little Rock, Arkansas, USA","height":"5' 4\" (1.63 m)","bio":"Joey Lauren Adams was born on January 9, 1968 in Little Rock, Arkansas, USA. She is an actress, known for Dazed and Confused (1993), Big Daddy (1999) and The Break-Up (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NzM0MjE0M15BMl5BanBnXkFtZTcwODQzODEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000725","name":"Joey Lauren Adams","idIMDB":"nm0000725"},"actorId":"nm0000725","character":"Vicky","urlCharacter":"http://www.imdb.com/character/ch0521344","main":true},{"actorName":"Elizabeth Gillies","urlProfile":"http://www.imdb.com/name/nm2566697","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2Q2NzcyNGEtNGFlNi00ZmExLWExODQtZDljMThiZjliZTBlL2ltYWdlXkEyXkFqcGdeQXVyMTk5OTM4Mjg@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1993","placeOfBirth":" Haworth, New Jersey, USA","birthName":"Elizabeth Egan Gillies","height":"5' 7\" (1.7 m)","bio":"Elizabeth Gillies (born July 26, 1993) is an American actress, singer and songwriter. Elizabeth began acting professionally at the age of 12. With a strong background in musical theater, Elizabeth made her Broadway debut at age 15, starring as the character \"Lucy\" in the original Broadway cast of \"13\". Shortly after the closing of \"13\", she went on to land the role of \"Jade West\" in the hit Nickelodeon series, Victorious (2010). Elizabeth has played recurring roles in television series, such as The Black Donnellys (2007) and most recently, the animated series, Winx Club (2004), where she voices the character of \"Daphne\". Elizabeth has also guest-starred on television shows, including Big Time Rush (2009) and White Collar (2009). Her film credits include The Clique (2008) and Harold (2008). In addition to acting, Elizabeth is also focusing heavily on music and is working on her album. Elizabeth plays piano and has been singing ever since she could. Having a strong passion for classic rock music, some of her more well-known covers include \"Wild Horses\" by The Rolling Stones, \"Jealous Guy\" by John Lennon, \"Father & Son\" by Cat Stevens and \"Fast Car\" by Tracy Chapman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2Q2NzcyNGEtNGFlNi00ZmExLWExODQtZDljMThiZjliZTBlL2ltYWdlXkEyXkFqcGdeQXVyMTk5OTM4Mjg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2566697","name":"Elizabeth Gillies","nicknames":["Liz"],"idIMDB":"nm2566697"},"actorId":"nm2566697","character":"Mandy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Iacono","urlProfile":"http://www.imdb.com/name/nm1476591","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NjcwMTk4NV5BMl5BanBnXkFtZTgwODExMDYzNDE@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1988","placeOfBirth":" Secaucus, New Jersey, USA","height":"5' 6\" (1.68 m)","bio":"A graduate of NYC's Professional Performing Arts High School, Iacono is best known for his portrayal of the title character on MTV's, \"The Hard Times of RJ Berger.\" Iacono was first featured on \"The Rosie O'Donnell Show,\" after she discovered his unique talents for impersonating Frank Sinatra and Ethel Merman, at age 8. Starting out as child actor in the NYC theater scene, Paul has appeared in over 100 theatrical productions, including Noël Coward's \"Sail Away\" at Carnegie Hall with Elaine Stritch and Marian Seldes, \"Mame\" opposite Christine Ebersole at the Papermill Play House and John Guare's \"Landscape of the Body\" at Signature Theater with Lili Taylor and Sherie Rene Scott. On the big screen, Paul starred in MGM's remake of \"Fame,\" \"No God, No Master\" with David Strathairn and Darren Stein's teen comedy, \"G.B.F.\" Upcoming films include Drew Barrymore's, \"Animal,\" \"Rhymes with Banana\" with Zosia Mamet and Judith Light, and \"Unreachable By Conventional Means,\" with Alexandra Daddario and Tovah Feldshuh. As a creator, Paul wrote and produced the NY play, \"Prince/Elizabeth,\" and is in development on his second pilot, \"GIF'ted.\" Paul is a Leukemia survivor, having been diagnosed in 1997. He works closely with the Leukemia and Lymphoma Society, helping raise hope and awareness for the disease. Iacono is openly gay and a major LGBTQ activist, having publicly come out in Michael Musto's Village Voice Column in April 2012. He was named one of OUT Magazine's 100 most influential gay, lesbian, bisexual, or transgender people for 2013.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NjcwMTk4NV5BMl5BanBnXkFtZTgwODExMDYzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1476591","name":"Paul Iacono","idIMDB":"nm1476591"},"actorId":"nm1476591","character":"Sean","urlCharacter":"http://www.imdb.com/character/ch0463622","main":true},{"actorName":"Thorsten Kaye","urlProfile":"http://www.imdb.com/name/nm0443406","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzY5NjM2Nl5BMl5BanBnXkFtZTYwMTI0ODA1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1966","placeOfBirth":" Mainz, Rhineland-Palatinate, Germany","birthName":"Thorsten Ernst Kieselbach","height":"6' 1\" (1.85 m)","bio":"Thorsten moved to the US in 1985 on a track (decathlon) scholarship to the United States International University in San Diego. Although Thorsten majored in physical education (and minored in drama), a serious motorcycle accident forced him to choose a different direction. He played soccer for a while, but ultimately changed his major to drama and received his Bachelor's Degree in fine arts. After a rugby tour through Europe, Kaye enrolled in graduate school at Wayne State University in Detroit, where he earned his master's degree in theater and theater history. Although he fondly remembers his first professional role as that of the \"Wicked Witch of the West\" when he was 17 years old in England, Thorsten portrayed some of the most memorable characters in classical theater, from Macbeth to Mark Antony, while a member of the Hilberry Repertory Theatre Company in Detroit. Thorsten then moved to Los Angeles, where he garnered roles in various television projects, including the CBS mini-series: Sidney Sheldon's \"Nothing Lasts Forever\", before moving to New York to accept the role of Professer Patrick Thornhart on the ABC-TV daytime drama \"One Life to Live.\" After leaving \"One life to Live,\" Thorsten starred in the 2000 film \"Shark Attack 2.\" Later in 2000, Thorsten returned to daytime television as Dr. Ian Thornhart (Patrick's older brother) on the ABC-TV drama \"Port Charles.\" In 2004, he accepted the role of the mysterious Zach Slater on ABC-TV's \"All My Children.\" Thorsten is the author of two books: \"From Timber Ridge to Daymer Gardens: A Journey in Words,\" co-written with the late Dorothy Bridges, and \"A Solid Wheel of Colored Ribbons,\" a book of children's poems with illustrations by Tami Evans Foster (to be published in the spring of 2009). When not working, Thorsten enjoys music, literature, riding American motorcycles, hockey (following the Detroit Red Wings), and football (he is a Miami Dolphins fan).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzY5NjM2Nl5BMl5BanBnXkFtZTYwMTI0ODA1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0443406","name":"Thorsten Kaye","idIMDB":"nm0443406"},"actorId":"nm0443406","character":"Carl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amaury Nolasco","urlProfile":"http://www.imdb.com/name/nm1004774","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NzQ4Njg3MF5BMl5BanBnXkFtZTgwODQ4NTUxNzE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 December 1970","placeOfBirth":" Puerto Rico","birthName":"Amaury Nolasco Garrido","height":"5' 10½\" (1.79 m)","bio":"Amaury Nolasco was born on December 24, 1970 in Puerto Rico as Amaury Nolasco Garrido. He is an actor and producer, known for Prison Break (2005), Transformers (2007) and 2 Fast 2 Furious (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NzQ4Njg3MF5BMl5BanBnXkFtZTgwODQ4NTUxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1004774","name":"Amaury Nolasco","idIMDB":"nm1004774"},"actorId":"nm1004774","character":"Douglas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Keke Palmer","urlProfile":"http://www.imdb.com/name/nm1551130","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWNhZDE1ZjAtMjZiNC00ZDJjLTkzYzktNTdkM2M4Yjk4OTRiL2ltYWdlXkEyXkFqcGdeQXVyMTMxMTU5NTU@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 August 1993","placeOfBirth":" Harvey, Illinois, USA","birthName":"Lauren Keyana Palmer","height":"5' 6\" (1.68 m)","bio":"Keke Palmer was born Lauren Keyana Palmer in Robbins, Illinois--a small town 20 miles south of Chicago-- to Sharon and Larry Palmer, both former actors. Palmer showed vocal promise as a five-year-old, when she belted out \"Jesus Loves Me\" in her church choir. A year later the singer-actress had a solo in her kindergarten play but, to her mom's dismay, the mike had not been adjusted to suit her daughter's height. Without missing a beat, Palmer lowered the mike and moved the crowd with her heavenly voice. At that very moment, her family knew there was something special about Keke (a nickname given to her by her sister). Although music was still her passion, Palmer's first big break came via her acting skills, making her big-screen debut in Barbershop 2: Back in Business (2004) as Queen Latifah's niece. Immediately recognizing her star potential, the film's producers encouraged her parents to take their daughter to California to explore other acting opportunities. Relocating required that Palmer's parents leave behind the security of their jobs, a newly purchased home and uproot their other three children. However, it didn't diminish the family's support of Palmer's aspirations. Once settled on the West Coast, Palmer did not waste any time. Within six weeks she had booked an episode of the critically acclaimed CBS series Cold Case (2003), a national K-Mart commercial and was chosen from a nationwide search to play opposite William H. Macy in a TNT movie, The Wool Cap (2004). Her performance was so amazing that it earned her a Screen Actors Guild nomination--to date, she is the youngest actress (then at age ten) ever to receive a nomination in a Lead Actress Category. In 2006 Palmer appeared as the lead character \"Akeelah Anderson\" in the critically acclaimed, award-winning film Akeelah and the Bee (2006). The film, about a young South Los Angeles girl who attempts to win a national spelling bee, won the hearts of audiences everywhere. Her breakthrough performance has received praise from many film critics and organizations. Among the list of nominations received, \"Akeelah and the Bee\" was listed as one of NBR's 2006 Top Independent Films of the Year, as well as four nominations from the NAACP Image Awards. Palmer, alone, won an NAACP Image Award for Outstanding Lead Actress in a Motion Picture, as well as Outstanding Lead Actress in a Motion Picture by the Black Movie Awards. She has also received nominations for Most Promising Newcomer by the Chicago Film Critics, Best Actress by the Black Reel Awards, and Best Young Actress by the Broadcast Film Critics Association. Keke held her own in scenes with veteran co-stars Angela Bassett and Laurence Fishburne. That very same year, Palmer appeared in Tyler Perry's Madea's Family Reunion (2006), which was #1 at the box office for two consecutive weeks. Palmer went on to win a 2007 NAACP Image Award for Outstanding Actress in a Motion Picture for her breakout role in \"Akeelah and the Bee\". She also received a ShoWest Award for Rising Star of the Year. Shortly after, Palmer lit up the small screen starring in the Disney Channel's hit movie, Jump In! (2007). This one-two punch of big-screen success coupled with small screen ratings power made Keke Palmer a household name in Hollywood. Palmer contributed her first recording, which was featured on the \"Akeelah and the Bee\" soundtrack, titled \"All My Girlz\", and followed it up with the ever popular \"My Turn Now\" on the \"Jump In!\" soundtrack. As if two soundtracks were not enough, she was also asked to sing \"Tonight\", an end title song from the smash-hit Ben Stiller movie, Night at the Museum (2006). Her Atlantic Records debut album, \"So Uncool\", is jammed with up-tempo R&B tracks, inspirational moments, and love songs. In 2008, Palmer starred in the Weinstein Co. feature, The Longshots (2008). The film was based on the true story of a young female quarterback, played by Palmer, that makes Pop Warner history; she starred opposite Ice Cube, for first time director and Limp Bizkit front man, Fred Durst. Palmer also starred as the title character in the hit Nickelodeon series, True Jackson, VP (2008), for 68 episodes, she played a high-school student who becomes the head of a major fashion label. In the fall of 2008, \"True Jackson\" bowed with over 4.8 million viewers, setting a record for Nickelodeon's largest audience for a live-action premiere. She has received four NAACP Awards for Best Actress in Children's Television for her role as \"True Jackson\". Keke starred in the movie, 23 ans d'absence (2012), for the Lifetime Network. She had a voice role in the 20th Century Fox animated film, Ice Age: Continental Drift (2012), as the character \"Peaches\". Her co-stars include Ray Romano, John Leguizamo, Denis Leary, Jennifer Lopez and Queen Latifah. Palmer was seen on the big screen in the Alcon/Warner Bros movie, Joyful Noise (2012), singing alongside legendary Queen Latifah and Dolly Parton, however, it was Palmer who the critics singled out for her \"young and inspiring\" rendition of the Michael Jackson song, \"Man in the Mirror\". Palmer resides in Los Angeles, CA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWNhZDE1ZjAtMjZiNC00ZDJjLTkzYzktNTdkM2M4Yjk4OTRiL2ltYWdlXkEyXkFqcGdeQXVyMTMxMTU5NTU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1551130","name":"Keke Palmer","idIMDB":"nm1551130"},"actorId":"nm1551130","character":"Alissa","urlCharacter":"http://www.imdb.com/character/ch0465011","main":true},{"actorName":"Jeremy Sumpter","urlProfile":"http://www.imdb.com/name/nm0838911","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NDMyODI3N15BMl5BanBnXkFtZTgwNzcwNDQyOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1989","placeOfBirth":" Monterey, California, USA","birthName":"Jeremy Robert Myron Sumpter","height":"6' (1.83 m)","bio":"Jeremy Robert Myron Sumpter was born on February 5, 1989 in Monterey, California, to Sandra (Johnson) and Gary Sumpter. He was raised in his mother's hometown, Mount Sterling, Kentucky. At a young age, he enjoyed mountain climbing and play with his friends like any other normal kid, but when he went to Lexington, Kentucky, to model, he won the numerous awards and met his manager Mark Robert. Soon after that, Jeremy, his twin sister Jessica Sumpter, his little sister Gigi Sumpter, and his mom and dad moved to Los Angeles, California. He started filming Local Boys (2002) and then Just a Dream (2002). His next movie was Frailty (2001), in which he played young Adam Meeks, opposite Bill Paxton and Matthew McConaughey. \"Bill had been one of my favorite actors so to be able to work with him was unbelievable,\" says Jeremy. The adult Adam Meeks was played by Matthew McConaughey. Next, Jeremy was chosen by Danny Glover to play Henry Sturbuck in the Showtime original film Just A Dream. \"Working with Danny was great, we had a great time filming in a small town in Utah,\" explains Jeremy. Jeremy received the \"Best Performance in a TV Movie, Mini-Series or Special - Leading Young Actor\" from the Young Artist Awards. Jeremy was able to use his surfing skills on his next film, \"Local Boys.\" This coming of age film was shot on location in southern California. \"This was a hard film to shoot since we were surfing at the beach almost everyday and there were all these girls around in bikinis,\" jokes Jeremy. After a worldwide search, Jeremy was chosen to play \"Peter\" in the P.J. Hogan film Peter Pan (2003). This was one of the most coveted roles in films for a teen actor in recent years. \"It was a part that I really wanted,\" says Jeremy, \"since I'd be able to fight pirates and fly around the stage on wires.\" Jeremy trained extensively in sword fighting and gymnastics prior to shooting the movie in Australia. Clubhouse (2004) was Jeremy's first television series, a dream role since he had always loved baseball and played little league when he was younger. Jeremy was cast in the role of Justin in Cyber Seduction: His Secret Life. After wrapping, he immediately went on to star in The Sasquatch Dumpling Gang in Oregon. A lot of the people from Napoleon Dynamite were involved in the film and it was a lot of fun for him to shoot. Jeremy shot \"Calvin Marshall\" in Oregon. Jeremy Sumpter shot the Warner Bros./New Line big budget film \"Into the Storm\" and the independent feature film \"Animal.\" \"The Squeeze,\" a feature film which was released in 2015 and starred Jeremy and Christopher McDonald. They teed off in a high stakes gambling matches careening throughout the South and landing in Las Vegas. Jeremy was also Co-Producer. Jeremy recently shot Take Down\" which is being distributed around the world. In the future, Jeremy hopes to also work behind the camera as a director and producer. In his spare time, he surfs, plays basketball, football, golf and shoots pool.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NDMyODI3N15BMl5BanBnXkFtZTgwNzcwNDQyOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0838911","name":"Jeremy Sumpter","idIMDB":"nm0838911"},"actorId":"nm0838911","character":"Matt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Parker Young","urlProfile":"http://www.imdb.com/name/nm2875233","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWFlZWVjYTItNzM1OC00NzMyLTg2NTYtNmE3ZDUxM2I2ODA4XkEyXkFqcGdeQXVyMTY1MjYxMjU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1988","placeOfBirth":" Tucson, Arizona, USA","height":"5' 11\" (1.8 m)","bio":"Parker Charles William Young was born in Tucson, Arizona, to Karl and Zarina Young. He is the oldest of three children, and as a youth he enjoyed playing sports, rock climbing, paintballing, and exploring the Sonoran desert. In high school, football became Parker's main focus. As a sophomore he started on the Varsity team, and by senior year he was captain. Parker first took the stage as a junior in high school as part of a one act play; that is if you don't count the mandatory theater class in middle school, or the time that he rapped Dr. Dre's \"Forgot About Dre\" in the 5th grade talent show. The one act play that he was a part of took first place out of three student written plays at the school's \"one act play competition.\" The victory was small and seemingly insignificant, but it was enough to inspire Parker to \"give this acting thing a shot.\" With the encouragement of his drama teacher, Parker decided to take acting more seriously, and thus his senior year became a whirlwind of preparing for college while juggling theater and football. Upon graduation Parker packed his bags and headed to Los Angeles for college. But when he got to LA he decided to drop out of school before he even started and dove head first into the entertainment industry; in other words headshots, acting class, and background work. Parker's break came when he booked the role of \"Ryan Shay\" on ABC's hit show Suburgatory, the hyperactive jock neighbor to Jeremy Sisto, and son of Ana Gasteyer and Chris Parnell. Following Suburgatory, Parker became a lead in the critically acclaimed Fox comedy, Enlisted, as the youngest of 3 brothers (Geoff Stultz and Chris Lowell) who are all soldiers in the US Army. In the film world, Parker starred in the Flower Films produced \"Animal\" and the upcoming indie \"Fourth Man Out.\" Parker resides in Los Angeles and enjoys staying active in a variety of different ways including rock climbing, Krav Maga, yoga, and camping. When he's not breaking a sweat you will most likely find him at the beach, on his motorcycle, or reading at Barnes & Noble. That is if he's not off backpacking somewhere with no cell service.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWFlZWVjYTItNzM1OC00NzMyLTg2NTYtNmE3ZDUxM2I2ODA4XkEyXkFqcGdeQXVyMTY1MjYxMjU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2875233","name":"Parker Young","idIMDB":"nm2875233"},"actorId":"nm2875233","character":"Jeff","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt2996684","urlIMDB":"http://www.imdb.com/title/tt2996684","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 26 min (86 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.8","filmingLocations":[{"location":"City of Manchester, Connecticut, USA"}],"rated":"NOT RATED","awards":[],"votes":"5,030","type":"Movie","companyCreditsSimple":[{"idCompany":"co0156396","name":"Chiller Films"},{"idCompany":"co0148520","name":"Flower Films (II)"},{"idCompany":"co0161020","name":"Synthetic Cinema International"}],"keywords":{"keywords":["weekend","cabin","vacation","wilderness","woods","boarded up window","walkie talkie","backpack","husband wife relationship","boyfriend girlfriend relationship","flare","trapped in a building","monster","creature","hiking","road trip","suv","posing for a photograph","african american","one word title","blood spatter","splatter","coming out","closed road","roadblock","reference to david bowie","reference to freddie mercury","final girl","interracial love relationship","interracial friendship","group of friends","closeted homosexual","gay friend","creature horror","animal attack","cabin in the woods","monster movie","loss of loved one","loss of wife","loss of brother"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 19:28:04"}}