{"data":{"movies":[{"title":"Tusk","originalTitle":"","year":"2014","releaseDate":"20140919","directors":[{"name":"Kevin Smith","id":"nm0003620"}],"writers":[{"name":"Kevin Smith","id":"nm0003620"}],"runtime":"102 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmQyMmUzMmYtMTA4OS00ZmRjLWE0NWYtNjc0ZGM0N2E4YzQ5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Horror"],"plot":"When podcaster Wallace travels to Canada to interview someone, he winds up meeting a strange man named Howe who has many stories to tell about his past life during his interview. Wallace wakes up the next day finding out Howe isn't the person he thought he was. Howe has plans to surgically and mentally turn Wallace into a walrus.","simplePlot":"When podcaster Wallace Bryton goes missing in the backwoods of Manitoba while interviewing a mysterious seafarer named Howard Howe, his best friend Teddy and girlfriend Allison team with an ex-cop to look for him.","actors":[{"actorName":"Michael Parks","urlProfile":"http://www.imdb.com/name/nm0662981","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjAwNTQ1NTI4NV5BMl5BanBnXkFtZTgwMzE4NjE2MjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1940","placeOfBirth":" Corona, California, USA","birthName":"Harry Samuel Parks","height":"6' (1.83 m)","bio":"Michael Parks is known as an actor's actor by his peers with a breadth of astonishing range that has allowed him to portray stunning contrasts - sometimes in the same film, like in 2014's \"TUSK\", starring in dual roles as an erudite serial killer opposite Justin Long, and as a feeble rube opposite Johnny Depp. In, \"KILL BILL: Vol.I and II\". Parks portrayed spot-on contrasting roles as Texas Ranger Earl McGraw and the heavily accented Esteban Vihaio opposite Uma Thurman. Writer/Directors, including Kevin Smith and Quentin Tarantino, wrote roles specifically for Parks claiming all they need to do is \"turn on the camera\" to elicit a masterful performance. Parks has played in more than 100 films and TV shows over a 50-year career .He starts as a contract player in 1961, with the portray of the nephew of the character George Mac Michael on the ABC sitcom \"The Real McCoys\". He played Adam in John Huston's \"The Bible: In the Beginning\" (1966). His other early roles includes appearances in two NBC series: the legal drama \"Sam Benedict\", as Larry Wilcox in the 1962 episode \"Too Many Strangers\" and the medical drama \"The Eleventh Hour\" as Mark Reynolds in the 1963 segment \"Pressure Breakdown\". He also starred in \"The China Lake Murders\" and \"Stranger by Night\", having portrayed a police officer in both. From 1969 to 1970 he starred in the series \"Then Came Bronson\" of which he was the only running star. He sang the theme song for the show, \"Long Lonesome Highway\", which became a #20 Billboard Hot 100 and #41 Hot Country Songs hit. Albums he recorded under MGM Records (the label of the studio which produced the series) include \"Closing The Gap\" (1969),\" Long Lonesome Highway\" (1970) and \"Blue\". He also had various records of songs included on these albums. He played Philip Colby during the second season (1986-1987) of ABC's \"Dynasty\" spin-off series \"The Colbys\". He played the antagonist Irish mob boss Tommy O'Shea in \"Death Wish V: The Face of Death\" (1994), French-Canadian drug runner Jean Renault in the ABC television series \"Twin Peaks\", Dr. Banyard in \"Deceiver\" (1997), Texas Ranger Earl McGraw in \"From Dusk till Dawn\" (1996), and Ambrose Bierce in \"From Dusk Till Dawn 3, The Hangman's Daughter\" (2000) .After playing Earl McGraw in the \"KILL BILL\" film series he reprised the role in both segments of the film \"Grindhouse\". In \"Red State\"(2011) as villain Abin Cooper, quoting the Bible and issuing homicidal directives in the same gently insinuating voice, Parks plays a disturbingly soft-spoken psycho making the talk all the more convincing and scary with his brilliant delivery affecting a folksy down home accent and knowing just how to modulate his remarks for maximum effect most reviewers agreed with \"Hollywood reporter\" Todd McCarthy that he is mesmerizing as he spews Cooper's hate in a way that brooks no argument . In \"TUSK\" (2014) as Howard Howe, a real-life ancient mariner (a role Kevin Smith's tailor-made for Parks) \"Parks has such light in his eyes, fire in his belly and a mellifluous purr in his voice\" that \"Variety wrote \" it would probably be a pleasure to watch him recite the Manitoba phone book\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjAwNTQ1NTI4NV5BMl5BanBnXkFtZTgwMzE4NjE2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0662981","name":"Michael Parks","idIMDB":"nm0662981"},"actorId":"nm0662981","character":"Howard Howe","urlCharacter":"http://www.imdb.com/character/ch0467285","main":true},{"actorName":"Justin Long","urlProfile":"http://www.imdb.com/name/nm0519043","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNTEwODY4NF5BMl5BanBnXkFtZTgwMzg0ODMwMjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 June 1978","placeOfBirth":" Fairfield, Connecticut, USA","birthName":"Justin Jacob Long","height":"5' 9\" (1.75 m)","bio":"A likable, boyish-looking actor with thick eyebrows and a friendly smile, Justin Long is a native of Connecticut. He was born and raised in Fairfield, the second of three sons. His father, R. James Long, is a Professor of Philosophy at Fairfield University, and his mother, Wendy Lesniak, is a former Broadway actress. He is of German, Sicilian, and Polish descent. He attended Fairfield Prep, and after graduating, he attended Vassar College. He first really showed his promise as a member of the comedy troupe \"LaughingStock.\" His performing talent garnered favorable notices and he won roles in some independent productions, notably Galaxy Quest (1999). However, he refused to act full time until after he graduated, which he did in 2000. He first gained notice when he played the nervous teenager Warren Cheswick in the TV series Ed (2000). The following year, he starred in the offbeat horror film Jeepers creepers - Le chant du diable (2001). The film, with its ghoulish ending, was a major hit on the horror circuit and raised his profile. He played the boyfriend of Britney Spears in Crossroads (2002), and won a supporting role in the Vince Vaughn comedy Dodgeball: A True Underdog Story (2004). He had high-profile roles in some offbeat independent films, most notably Raising Genius (2004) and Waiting... (2005), and scored commercial success again when he played Lindsay Lohan's boyfriend in Herbie Fully Loaded (2005). He continues to win acclaim and fans. He scored commercial success again with a role in the Jennifer Aniston romantic comedy The Break-Up (2006). He is private about his personal life and does not make a point of attending nightclubs and parties. However, his personal life did get scrutiny in 2008, due to his romance with actress Drew Barrymore that year. In addition to his film appearances, he is a spokesman for the Apple Mac computers, appearing with John Hodgman in its commercials.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNTEwODY4NF5BMl5BanBnXkFtZTgwMzg0ODMwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0519043","name":"Justin Long","nicknames":["The Mac Guy"],"idIMDB":"nm0519043"},"actorId":"nm0519043","character":"Wallace Bryton","urlCharacter":"http://www.imdb.com/character/ch0471949","main":true},{"actorName":"Genesis Rodriguez","urlProfile":"http://www.imdb.com/name/nm1270009","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU3MjM1ODM5Ml5BMl5BanBnXkFtZTgwODM3MTE1NjE@._V1_UY44_CR28,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1987","placeOfBirth":" Miami, Florida, USA","birthName":"Génesis Rodríguez Pérez","height":"5' 7\" (1.7 m)","bio":"Genesis Rodriguez was born in Miami, Florida. She is the daughter of José Luis 'El Puma' Rodríguez, the famous Venezuelan singer and actor, and Carolina Perez, a Cuban model. She has two half-sisters. She was educated at the Carrolton School of the Sacred Heart in Miami. From childhood, Rodriguez knew she wanted to act and attended summer classes at the renowned Lee Strasberg Theatre and Film Institute, as well as embarking on other acting training. Success followed and she won roles in Spanish language series such as Prisionera (2004), Dame Chocolate (2007) and Doña Bárbara (2008). She also appeared as Sarah in the hit show \"Entourage\" (2004). Film projects include Man on a Ledge (2012) and What to Expect When You're Expecting (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU3MjM1ODM5Ml5BMl5BanBnXkFtZTgwODM3MTE1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1270009","name":"Genesis Rodriguez","idIMDB":"nm1270009"},"actorId":"nm1270009","character":"Ally Leon","urlCharacter":"http://www.imdb.com/character/ch0514029","main":true},{"actorName":"Haley Joel Osment","urlProfile":"http://www.imdb.com/name/nm0005286","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI1NDQyMDQ4Ml5BMl5BanBnXkFtZTYwNDIxMjMz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1988","placeOfBirth":" Los Angeles, California, USA","height":"5' 6\" (1.68 m)","bio":"Haley Joel Osment is an American actor who has proven himself as one of the best young actors of his generation. He is the first millennial male to have received an Academy Award nomination for acting. Osment was born in Los Angeles, California, to Theresa (Seifert), a teacher, and actor Eugene Osment. His sister is actress Emily Osment. His ancestry includes English, German, and Irish. Osment began acting at the age of four, when he tried out for a Pizza Hut commercial in a shopping mall. The commercial launched his career, and he landed his first television role later that year. As a young child, his first film role was as Forrest Gump (1994)'s son, also named Forrest Gump, in the 1994 film of the same name as well as making a small appearance in Mixed Nuts (1994). He had roles in numerous TV series, including Thunder Alley (1994), The Jeff Foxworthy Show (1995), and, most notably, the final season of Murphy Brown (1988), in which he replaced Dyllan Christopher as Murphy's son Avery. Osment also made numerous guest appearances in various TV series, including The Larry Sanders Show (1992), Walker, Texas Ranger (1993) (as a child dying from AIDS), Touched by an Angel (1994), Chicago Hope (1994), The Pretender (1996), and as a child dying from leukemia in the emotional episode 'Angels and Blimps' (1999) of the series Ally McBeal (1997). Osment starred in Bogus (1996) with Whoopi Goldberg and Gérard Depardieu, and appeared in the 1998 made-for-TV movie The Lake (1998) with Yasmine Bleeth, as well as I'll Remember April (2000) with future The Sixth Sense (1999) co-star Trevor Morgan. He first achieved stardom in 1999 when he appeared in the blockbuster The Sixth Sense (1999), co-starring Bruce Willis. For this role, Osment won the Saturn Award for best young actor. He was also nominated for the Academy Award for Best Supporting Actor, but lost to Michael Caine, with whom he would later star in Secondhand Lions (2003). Osment (voice) also made three minor guest appearances on Family Guy (1999) in 2000. One of Osment's lines in The Sixth Sense (1999), \"I see dead people,\" is often repeated or parodied on television programs and in other media. The 2000 Academy Awards ceremony honored another of Osment's future co-stars, BestActor Kevin Spacey, who, along with Helen Hunt, appeared in Osment's next film, Pay It Forward (2000). The following year, Osment appeared in Steven Spielberg's A.I. Artificial Intelligence (2001), cementing his stature as one of the leading young actors in Hollywood. This role earned him his second Saturn Award. Also in 2001, Osment starred in a Polish film, Edges of the Lord (2001), as Romek. The movie was never released theatrically in the United States. Osment has since provided voices for The Country Bears (2002) and The Jungle Book 2 (2003). More recently, Osment was the voice of Sora, the main protagonist of the Walt Disney Company and Square-Enix's Kingdom Hearts (2002) video-game series, which was extremely financially successful as well and generally well-received critically. He was also the voice of Takeshi Jinno in the \"Time to Shine\" episode of the IGPX: Immortal Grand Prix (2005) animé TV series. Osment also worked in Home of the Giants (2007), playing a high school journalist opposite Ryan Merriman and Danielle Panabaker. He also played Helmuth Hübener in the film Truth & Treason (????). On July 20, 2006, Osment was injured in a one-car accident. His blood-alcohol content was measured at 0.16%, twice the legal limit in California. On August 18, he was charged with four misdemeanors, including driving under the influence of alcohol and possession of marijuana while driving. He pleaded no contest on October 19 and was sentenced to three years' probation, 60 hours in an alcohol-rehabilitation and education program, a fine of $1,500, and a minimum requirement of 26 Alcoholics Anonymous meetings over a six-month period.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI1NDQyMDQ4Ml5BMl5BanBnXkFtZTYwNDIxMjMz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005286","name":"Haley Joel Osment","nicknames":["HJO"],"idIMDB":"nm0005286"},"actorId":"nm0005286","character":"Teddy Craft","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Johnny Depp","urlProfile":"http://www.imdb.com/name/nm0000136","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODU5Nzk2OV5BMl5BanBnXkFtZTcwMzI2ODgyNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 June 1963","placeOfBirth":" Owensboro, Kentucky, USA","birthName":"John Christopher Depp II","height":"5' 10\" (1.78 m)","bio":"Johnny Depp is perhaps one of the most versatile actors of his day and age in Hollywood. He was born John Christopher Depp II in Owensboro, Kentucky, on June 9, 1963, to Betty Sue (Wells), who worked as a waitress, and John Christopher Depp, a civil engineer. Depp was raised in Florida. He dropped out of school when he was 15, and fronted a series of music-garage bands, including one named 'The Kids'. However, it was when he married Lori Anne Allison (Lori A. Depp) that he took up the job of being a ballpoint-pen salesman to support himself and his wife. A visit to Los Angeles, California, with his wife, however, happened to be a blessing in disguise, when he met up with actor Nicolas Cage, who advised him to turn to acting, which culminated in Depp's film debut in the low-budget horror film, A Nightmare on Elm Street (1984), where he played a teenager who falls prey to dream-stalking demon Freddy Krueger. In 1987 he shot to stardom when he replaced Jeff Yagher in the role of undercover cop Tommy Hanson in the popular TV series 21 Jump Street (1987). In 1990, after numerous roles in teen-oriented films, his first of a handful of great collaborations with director Tim Burton came about when Depp played the title role in Edward Scissorhands (1990). Following the film's success, Depp carved a niche for himself as a serious, somewhat dark, idiosyncratic performer, consistently selecting roles that surprised critics and audiences alike. He continued to gain critical acclaim and increasing popularity by appearing in many features before re-joining with Burton in the lead role of Ed Wood (1994). In 1997 he played an undercover FBI agent in the fact-based film Donnie Brasco (1997), opposite Al Pacino; in 1998 he appeared in Fear and Loathing in Las Vegas (1998), directed by Terry Gilliam; and then, in 1999, he appeared in the sci-fi/horror film The Astronaut's Wife (1999). The same year he teamed up again with Burton in Sleepy Hollow (1999), brilliantly portraying Ichabod Crane. Depp has played many characters in his career, including another fact-based one, Insp. Fred Abberline in From Hell (2001). He stole the show from screen greats such as Antonio Banderas in the finale to Robert Rodriguez's \"mariachi\" trilogy, Once Upon a Time in Mexico (2003). In that same year he starred in the marvelous family blockbuster Pirates of the Caribbean: The Curse of the Black Pearl (2003), playing a character that only the likes of Depp could pull off: the charming, conniving and roguish Capt. Jack Sparrow. The film's enormous success has opened several doors for his career and included an Oscar nomination. He appeared as the central character in the Stephen King-based movie, Secret Window (2004); as the kind-hearted novelist James Barrie in the factually-based Finding Neverland (2004), where he co-starred with Kate Winslet; and Rochester in the British film, The Libertine (2004). Depp collaborated again with Burton in a screen adaptation of Roald Dahl's novel, Charlie and the Chocolate Factory (2005), and later in Alice in Wonderland (2010) and Dark Shadows (2012). Off-screen, Depp has dated several female celebrities, and has been engaged to Sherilyn Fenn, Jennifer Grey, Winona Ryder and Kate Moss. He was married to Lori Anne Allison in 1983, but divorced her in 1985. Depp has two children with French singer/actress Vanessa Paradis: Lily-Rose Melody, born in 1999 and Jack, born in 2002. He married actress/producer Amber Heard in 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODU5Nzk2OV5BMl5BanBnXkFtZTcwMzI2ODgyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000136","name":"Johnny Depp","nicknames":["Mr. Stench","Colonel"],"idIMDB":"nm0000136"},"actorId":"nm0000136","character":"Guy Lapointe","urlCharacter":"http://www.imdb.com/character/ch0472212","main":true},{"actorName":"Harley Morenstein","urlProfile":"http://www.imdb.com/name/nm4375857","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNzc2MTg1OV5BMl5BanBnXkFtZTcwNjE4ODAwNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' 6\" (1.98 m)","bio":"The Co-creator of a YouTube channel known as Epic Meal Time, where he and several other men indulge in culinary creations which they release on YouTube every Tuesday. He has created over 100 episodes with the YouTube channel and it has been active ever since October 2010. On the show there have been several guest stars such as Tony Hawk, Deadmau5, Lights, and other YouTube sensations such as FPSRussia and Smosh. He has appeared on \"The Tonight Show with Jay Leno\" along with the rest of the cast and crew of Epic Meal Time; this was their first late night interview. On the show Harley is know as the \"Sauce Boss\" where he has tag-lines/catch-phrases such as \"A drippin' that sauce\" and \"Bacon flip\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNzc2MTg1OV5BMl5BanBnXkFtZTcwNjE4ODAwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4375857","name":"Harley Morenstein","nicknames":["Sauce Boss"],"idIMDB":"nm4375857"},"actorId":"nm4375857","character":"Border Agent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ralph Garman","urlProfile":"http://www.imdb.com/name/nm0307621","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MTc2NjczMl5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1964","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"6' (1.83 m)","bio":"Ralph Garman was born on November 17, 1964 in Philadelphia, Pennsylvania, USA. He is an actor and writer, known for Family Guy (1999), Ted (2012) and A Million Ways to Die in the West (2014). He has been married to Kari Watson since April 2005. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MTc2NjczMl5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0307621","name":"Ralph Garman","idIMDB":"nm0307621"},"actorId":"nm0307621","character":"Detective","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennifer Schwalbach Smith","urlProfile":"http://www.imdb.com/name/nm0777059","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1Njk5MDcwM15BMl5BanBnXkFtZTcwNTUwMjIzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 April 1971","placeOfBirth":" Newark, New Jersey, USA","birthName":"Jennifer Mary Schwalbach","height":"5' 10\" (1.78 m)","bio":"Jennifer Schwalbach Smith was born on April 7, 1971 in Newark, New Jersey, USA as Jennifer Mary Schwalbach. She is a producer and actress, known for Tusk (2014), Clerks II (2006) and Zack and Miri Make a Porno (2008). She has been married to Kevin Smith since April 25, 1999. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1Njk5MDcwM15BMl5BanBnXkFtZTcwNTUwMjIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0777059","name":"Jennifer Schwalbach Smith","idIMDB":"nm0777059"},"actorId":"nm0777059","character":"Gimli Slider Waitress","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harley Quinn Smith","urlProfile":"http://www.imdb.com/name/nm0808410","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjY1N2ZkODEtZDgyNS00MmM0LWEyZTItYmE4ZjA1OWU0NjdkXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR27,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1999","placeOfBirth":" Red Bank, New Jersey, USA","height":"5' 8\" (1.73 m)","bio":"At age 17, Harley Quinn Smith is already a star on the rise. She has been seen in several films and will next star in a lead role in Yoga Hosers opposite Lily Rose Depp. The film, written and directed by her father Kevin Smith, will also star Johnny Depp. Smith made her acting debut in Jay and Silent Bob Strike Back and had cameos in the drama film Jersey Girl and in the comedy film Clerks II. More recently she had a role in Tusk playing \"Colleen McKenzie,\" a role which she will reprise in Yoga Hosers next year and the upcoming Moose Jaws. Smith resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjY1N2ZkODEtZDgyNS00MmM0LWEyZTItYmE4ZjA1OWU0NjdkXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0808410","name":"Harley Quinn Smith","idIMDB":"nm0808410"},"actorId":"nm0808410","character":"Girl Clerk #1","urlCharacter":"http://www.imdb.com/character/ch0472211","main":true},{"actorName":"Lily-Rose Depp","urlProfile":"http://www.imdb.com/name/nm6675440","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4Mzg1MzUxOF5BMl5BanBnXkFtZTgwODIxMTI4NzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 May 1999","placeOfBirth":" Paris, France","birthName":"Lily-Rose Melody Depp","height":"5' 3\" (1.6 m)","bio":"Lily-Rose Depp was born 27 May, 1999 in Paris, France. Her mother is French singing sensation Vanessa Paradis, and her father is American actor Johnny Depp. Her little brother, John \"Jack\" Christoper III, joined the clan in 2002. During Lily-Rose's early years, the Depp-Paradis family divided their time between their homes in France and LA, and the children would often travel with their parents while they were working. Depp and Paradis split in 2012 after 14 years together. Following the split, both Lily-Rose and Jack spent most of their time stateside where they attended prestigious private schools in LA. At school, Lily-Rose performs well academically. She has participated on the debate team, and has also participated in dance and music performances. She is well liked by her teachers and peers and is said to have a dry, somewhat dark sense of humor. She is lauded by those close to her as being extremely bright, funny and kindhearted. Beyond acting, she has also dabbled in recording; the track \"La Ballade De Lily Rose\" appears on Paradis' album \"Bliss\" (2000.)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4Mzg1MzUxOF5BMl5BanBnXkFtZTgwODIxMTI4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm6675440","name":"Lily-Rose Depp","idIMDB":"nm6675440"},"actorId":"nm6675440","character":"Girl Clerk #2","urlCharacter":"http://www.imdb.com/character/ch0472211","main":true},{"actorName":"Ashley Greene","urlProfile":"http://www.imdb.com/name/nm6816497","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyODYyOTA0NF5BMl5BanBnXkFtZTgwMjgyMzMzODE@._V1_UY44_CR36,0,32,44_AL_.jpg","biography":{"bio":"Ashley Greene is an actress, known for Yoga Hosers (2016), Tusk (2014) and Holidays (2016). She has been married to Nick Hunter since February 28, 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyODYyOTA0NF5BMl5BanBnXkFtZTgwMjgyMzMzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm6816497","name":"Ashley Greene","idIMDB":"nm6816497"},"actorId":"nm6816497","character":"Convenient Store Customer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Douglas Banks","urlProfile":"http://www.imdb.com/name/nm2126451","urlPhoto":"","biography":{"dateOfBirth":"21 September 1985","placeOfBirth":" Titusville, Florida, USA","birthName":"Douglas Vincent Banks","height":"5' 8\" (1.73 m)","bio":"Douglas Banks was born on September 21, 1985 in Titusville, Florida, USA as Douglas Vincent Banks. He is known for his work on Tusk (2014), Jackass 3D (2010) and Jackass 3.5 (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2126451","name":"Douglas Banks","idIMDB":"nm2126451"},"actorId":"nm2126451","character":"Kill Bill Kid","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matthew Shively","urlProfile":"http://www.imdb.com/name/nm6097455","urlPhoto":"","biography":{"bio":"Matthew Shively is known for his work on Sleepy Hollow (2013), Banshee (2013) and Tusk (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6097455","name":"Matthew Shively","idIMDB":"nm6097455"},"actorId":"nm6097455","character":"Young Howard Howe","urlCharacter":"http://www.imdb.com/character/ch0467285","main":true}],"seasons":[],"idIMDB":"tt3099498","urlIMDB":"http://www.imdb.com/title/tt3099498","business":{"budget":{"money":"$3,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$1,427,014","country":"USA","day":"28","month":"09","year":"2014","remarks":""}],"weekendGross":[{"money":"$292,478","country":"USA","day":"28","month":"09","year":"2014","remarks":"449 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"04","month":"11","year":"2013","remarks":null},{"money":null,"country":null,"day":"22","month":"11","year":"2013","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 42 min (102 min)"],"soundMix":null,"color":["Color","Black and White (some scenes)"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa","Red Epic (some shots)"],"laboratory":["Light Iron (digital intermediate)"],"filmLength":null,"negativeFormat":["Codex"],"cinematographicProcess":["ARRIRAW (2.8K)"],"printedFilmFormat":null},"rating":"5.4","metascore":"55","filmingLocations":[{"location":"Charlotte, North Carolina, USA"}],"rated":"R","awards":[{"award":"Fangoria Chainsaw Awards 2015","titlesAwards":[{"titleAwardOutcome":"2nd place Chainsaw Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Michael Parks","id":"nm0662981","role":null}]},{"category":"Worst Film","names":[]}]}]},{"award":"Fright Meter Awards 2014","titlesAwards":[{"titleAwardOutcome":"Won Fright Meter Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Michael Parks","id":"nm0662981","role":null}]}]}]},{"award":"Golden Schmoes Awards 2014","titlesAwards":[{"titleAwardOutcome":"2nd place Golden Schmoes","categories":[{"category":"Best Horror Movie of the Year","names":[]}]}]},{"award":"iHorror Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won iHorror Award","categories":[{"category":"Best Male Horror Performance","names":[{"name":"Justin Long","id":"nm0519043","role":null}]}]},{"titleAwardOutcome":"Nominated iHorror Award","categories":[{"category":"Best Mainstream Horror","names":[{"name":"Kevin Smith","id":"nm0003620","role":null}]},{"category":"Best Horror Director","names":[{"name":"Kevin Smith","id":"nm0003620","role":null}]},{"category":"Best Horror Makeup","names":[{"name":"Wendy Bell","id":"nm0068582","role":null}]}]}]},{"award":"Toronto International Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"2nd place People's Choice Award","categories":[{"category":"Midnight Madness","names":[{"name":"Kevin Smith","id":"nm0003620","role":null}]}]}]}],"votes":"34,204","type":"Movie","companyCreditsSimple":[{"idCompany":"co0326257","name":"SModcast Pictures"}],"keywords":{"keywords":["walrus","canada","search","deception","mansion","convenience store clerk","convenience store","man in a wheelchair","drugged drink","nonlinear timeline","body horror","mutilation","severed leg","podcast","mad scientist","travel","death","cell phone","voice mail","spider","scene after end credits","human becoming an animal","part of trilogy","first part","satire","one word title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 00:06:00"}}