{"data":{"movies":[{"title":"Mortdecai","originalTitle":"","year":"2015","releaseDate":"20150123","directors":[{"name":"David Koepp","id":"nm0462895"}],"writers":[{"name":"Eric Aronson","id":"nm0036962"},{"name":"Kyril Bonfiglioli","id":"nm5795768"}],"runtime":"107 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3NDcxOTM5Ml5BMl5BanBnXkFtZTgwNTEwNzE0MzE@._V1.jpg","countries":["UK","USA"],"languages":["English"],"genres":["Action","Comedy","Crime","Mystery","Romance"],"plot":"Juggling some angry Russians, the British Mi5, his impossibly leggy wife and an international terrorist, debonair art dealer and part time rogue Charlie Mortdecai must traverse the globe armed only with his good looks and special charm in a race to recover a stolen painting rumored to contain the code to a lost bank account filled with Nazi gold.","simplePlot":"Juggling angry Russians, the British Mi5, and an international terrorist, debonair art dealer and part time rogue Charlie Mortdecai races to recover a stolen painting rumored to contain a code that leads to lost gold.","actors":[{"actorName":"Johnny Depp","urlProfile":"http://www.imdb.com/name/nm0000136","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODU5Nzk2OV5BMl5BanBnXkFtZTcwMzI2ODgyNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 June 1963","placeOfBirth":" Owensboro, Kentucky, USA","birthName":"John Christopher Depp II","height":"5' 10\" (1.78 m)","bio":"Johnny Depp is perhaps one of the most versatile actors of his day and age in Hollywood. He was born John Christopher Depp II in Owensboro, Kentucky, on June 9, 1963, to Betty Sue (Wells), who worked as a waitress, and John Christopher Depp, a civil engineer. Depp was raised in Florida. He dropped out of school when he was 15, and fronted a series of music-garage bands, including one named 'The Kids'. However, it was when he married Lori Anne Allison (Lori A. Depp) that he took up the job of being a ballpoint-pen salesman to support himself and his wife. A visit to Los Angeles, California, with his wife, however, happened to be a blessing in disguise, when he met up with actor Nicolas Cage, who advised him to turn to acting, which culminated in Depp's film debut in the low-budget horror film, A Nightmare on Elm Street (1984), where he played a teenager who falls prey to dream-stalking demon Freddy Krueger. In 1987 he shot to stardom when he replaced Jeff Yagher in the role of undercover cop Tommy Hanson in the popular TV series 21 Jump Street (1987). In 1990, after numerous roles in teen-oriented films, his first of a handful of great collaborations with director Tim Burton came about when Depp played the title role in Edward Scissorhands (1990). Following the film's success, Depp carved a niche for himself as a serious, somewhat dark, idiosyncratic performer, consistently selecting roles that surprised critics and audiences alike. He continued to gain critical acclaim and increasing popularity by appearing in many features before re-joining with Burton in the lead role of Ed Wood (1994). In 1997 he played an undercover FBI agent in the fact-based film Donnie Brasco (1997), opposite Al Pacino; in 1998 he appeared in Fear and Loathing in Las Vegas (1998), directed by Terry Gilliam; and then, in 1999, he appeared in the sci-fi/horror film The Astronaut's Wife (1999). The same year he teamed up again with Burton in Sleepy Hollow (1999), brilliantly portraying Ichabod Crane. Depp has played many characters in his career, including another fact-based one, Insp. Fred Abberline in From Hell (2001). He stole the show from screen greats such as Antonio Banderas in the finale to Robert Rodriguez's \"mariachi\" trilogy, Once Upon a Time in Mexico (2003). In that same year he starred in the marvelous family blockbuster Pirates of the Caribbean: The Curse of the Black Pearl (2003), playing a character that only the likes of Depp could pull off: the charming, conniving and roguish Capt. Jack Sparrow. The film's enormous success has opened several doors for his career and included an Oscar nomination. He appeared as the central character in the Stephen King-based movie, Secret Window (2004); as the kind-hearted novelist James Barrie in the factually-based Finding Neverland (2004), where he co-starred with Kate Winslet; and Rochester in the British film, The Libertine (2004). Depp collaborated again with Burton in a screen adaptation of Roald Dahl's novel, Charlie and the Chocolate Factory (2005), and later in Alice in Wonderland (2010) and Dark Shadows (2012). Off-screen, Depp has dated several female celebrities, and has been engaged to Sherilyn Fenn, Jennifer Grey, Winona Ryder and Kate Moss. He was married to Lori Anne Allison in 1983, but divorced her in 1985. Depp has two children with French singer/actress Vanessa Paradis: Lily-Rose Melody, born in 1999 and Jack, born in 2002. He married actress/producer Amber Heard in 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODU5Nzk2OV5BMl5BanBnXkFtZTcwMzI2ODgyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000136","name":"Johnny Depp","nicknames":["Mr. Stench","Colonel"],"idIMDB":"nm0000136"},"actorId":"nm0000136","character":"Mortdecai","urlCharacter":"http://www.imdb.com/character/ch0500812","main":true},{"actorName":"Gwyneth Paltrow","urlProfile":"http://www.imdb.com/name/nm0000569","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzIxOTQ1NTU1OV5BMl5BanBnXkFtZTcwMTQ4MDY0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 September 1972","placeOfBirth":" Los Angeles, California, USA","birthName":"Gwyneth Kate Paltrow","height":"5' 9\" (1.75 m)","bio":"A tall, wafer thin, delicate beauty, Gwyneth Kate Paltrow was born in Los Angeles, the daughter of noted producer and director Bruce Paltrow and Tony award-winning actress Blythe Danner. Her father was from a Jewish family, while her mother has German, and some English and Irish, ancestry. When Gwyneth was eleven, the family moved to Massachusetts, where her father began working in summer stock productions in the Berkshires. It was here that she received her early acting training under the tutelage of her parents. She graduated from the all-girls Spence School in New York City and moved to California where she attended the UC Santa Barbara, majoring in Art History. She soon quit, realizing it was not her passion. She made her film debut with a small part in Shout (1991) and for the next five years had featured roles in a mixed bag of film fare that included Flesh and Bone (1993); Mrs. Parker and the Vicious Circle (1994); Se7en (1995); Jefferson in Paris (1995); Moonlight and Valentino (1995); and The Pallbearer (1996). It was her performance in the title role of Emma Woodhouse in Emma (1996) that led to her being offered the role of Viola in Shakespeare in Love (1998), for which she was awarded the Golden Globe, Screen Actors Guild and Academy Awards for Best Actress in a Leading Role. She broke her much publicized engagement to actor Brad Pitt in 1997 citing as the reason the fact that neither she nor Pitt felt that they could pursue their respective careers and at the same time maintain a happy marriage. They remain good friends. Since then, her roles have included The Royal Tenenbaums (2001), Shallow Hal (2001), Sky Captain and the World of Tomorrow (2004), Iron Man (2008), Two Lovers (2008), and Country Strong (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzIxOTQ1NTU1OV5BMl5BanBnXkFtZTcwMTQ4MDY0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000569","name":"Gwyneth Paltrow","nicknames":["Gwynnie"],"idIMDB":"nm0000569"},"actorId":"nm0000569","character":"Johanna","urlCharacter":"http://www.imdb.com/character/ch0445977","main":true},{"actorName":"Paul Bettany","urlProfile":"http://www.imdb.com/name/nm0079273","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwODg1MTA5Ml5BMl5BanBnXkFtZTcwNDQwMTQxMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 May 1971","placeOfBirth":" Harlesden, London, England, UK","height":"6' 3½\" (1.92 m)","bio":"Paul Bettany was born in Harlesden, London, England, into a theatre family. His father, Thane Bettany, is still an actor, but his mother, Anne Kettle, has retired from acting. His maternal grandmother, Olga Gwynne (her maiden and stage name), was a successful actress, while his maternal grandfather, Lesley Kettle, was a musician and promoter. He has an older sister who is a writer. Paul was brought up in North West London and, after the age of nine, in Hertfordshire (Brookmans Park). Immediately after finishing at Drama Centre London, he went into the West End to join the cast of \"An Inspector Calls\", though when asked to go on tour with this play, he chose to stay in England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwODg1MTA5Ml5BMl5BanBnXkFtZTcwNDQwMTQxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0079273","name":"Paul Bettany","idIMDB":"nm0079273"},"actorId":"nm0079273","character":"Jock","urlCharacter":"http://www.imdb.com/character/ch0475573","main":true},{"actorName":"Ewan McGregor","urlProfile":"http://www.imdb.com/name/nm0000191","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MjQ0MDg0Nl5BMl5BanBnXkFtZTcwNjYyNjI5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1971","placeOfBirth":" Perth, Perthshire, Scotland, UK","birthName":"Ewan Gordon McGregor","height":"5' 9¾\" (1.77 m)","bio":"Ewan Gordon McGregor was born on March 31, 1971 in Perth, Perthshire, Scotland, to Carol Diane (Lawson) and James Charles McGregor, both teachers. His uncle is actor Denis Lawson. He was raised in Crieff. At age 16, he left Morrison Academy to join the Perth Repertory Theatre. His parents encouraged him to leave school and pursue his acting goals rather than be unhappy. McGregor studied drama for a year at Kirkcaldly in Fife, then enrolled at London's Guildhall School of Music and Drama for a three-year course. He studied alongside Daniel Craig and Alistair McGowan, among others, and left right before graduating after snagging the role of Private Mick Hopper in Dennis Potter's six-part Channel 4 series Lipstick on Your Collar (1993). His first notable role was that of Alex Law in Shallow Grave (1994), directed by Danny Boyle, written by John Hodge and produced by Andrew Macdonald. This was followed by The Pillow Book (1996) and Trainspotting (1996), the latter of which brought him to the public's attention. He is now one of the most critically acclaimed actors of his generation, and portrays Obi-Wan Kenobi in the first three Star Wars episodes. McGregor is married to French production designer Eve Mavrakis, whom he met while working on the television series Kavanagh QC (1995). They married in France in the summer of 1995 and have two daughters, Clara Mathilde and Esther Rose. McGregor formed a production company, with friends Jonny Lee Miller, Sean Pertwee, Jude Law, Sadie Frost, Damon Bryant, Bradley Adams and Geoff Deehan, called \"Natural Nylon\", and hoped it would make innovative films that do not conform to Hollywood standards. McGregor and Bryant left the company in 2002. He was awarded Officer of the Order of the British Empire in the 2013 Queen's New Years Honours List for his services to drama and charity.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MjQ0MDg0Nl5BMl5BanBnXkFtZTcwNjYyNjI5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000191","name":"Ewan McGregor","idIMDB":"nm0000191"},"actorId":"nm0000191","character":"Martland","urlCharacter":"http://www.imdb.com/character/ch0416276","main":true},{"actorName":"Olivia Munn","urlProfile":"http://www.imdb.com/name/nm1601397","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2OTMyNTczMV5BMl5BanBnXkFtZTcwNDc5MzIzMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 July 1980","placeOfBirth":" Oklahoma City, Oklahoma, USA","birthName":"Lisa Olivia Munn","height":"5' 4\" (1.63 m)","bio":"Lisa Olivia Munn was born in Oklahoma City, Oklahoma. Her mother, Kimberly Schmid, lived in Vietnam, and is of Chinese ancestry, while her father, Winston Barrett Munn, is from a family with deep roots in the American South. Olivia's parents divorced when she was two years old, and she was raised by her mother and stepfather, a member of the United States Air Force. Although the family departed Oklahoma and resided in many locations, she was mainly raised in Tokyo, Japan. During this time, she appeared in a number of local theater productions and later became a model in the Japanese fashion industry. When the family eventually returned to the United States, Olivia moved to Los Angeles to pursue her dream of becoming an actress. After a few small roles, her career took a very promising turn when she landed the role of Mily Acuna on the Hawaii-lensed TV series Beyond the Break (2006) and the role of Rob Schneider's receptionist in Big Stan (2007). She hosts \"The Daily Nut\" and the \"Formula D\" Podcasts on G4.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2OTMyNTczMV5BMl5BanBnXkFtZTcwNDc5MzIzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1601397","name":"Olivia Munn","nicknames":["The Geek Goddess"],"idIMDB":"nm1601397"},"actorId":"nm1601397","character":"Georgina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonny Pasvolsky","urlProfile":"http://www.imdb.com/name/nm0665188","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNTkwODQwMF5BMl5BanBnXkFtZTgwMjc0MjkxNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1972","placeOfBirth":" Cape Town, South Africa","birthName":"Jonathan Marc Pasvolsky","height":"6' 2\" (1.88 m)","bio":"Jonny Pasvolsky was born on July 26, 1972 in Cape Town, South Africa as Jonathan Marc Pasvolsky. He is known for his work on Westworld (2016), Mortdecai (2015) and The Moodys (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNTkwODQwMF5BMl5BanBnXkFtZTgwMjc0MjkxNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0665188","name":"Jonny Pasvolsky","nicknames":["Jonny Pas"],"idIMDB":"nm0665188"},"actorId":"nm0665188","character":"Emil","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Culkin","urlProfile":"http://www.imdb.com/name/nm0191410","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA2MTYzMzgyM15BMl5BanBnXkFtZTgwNjk3ODA0ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Michael Culkin is a veteran actor of film, screen and theater. An actor of British origins, Michael began his screen career in 1992 with the horror film Candyman, starring Virginia Madsen and Tony Todd in the title role of the killer 'The Candyman'. Three years later, he reprised his character of Philip Purcell in \"Candyman: Farewell to Flesh\" (1995). His name also ties in with Luc Besson's 1997 Sci-Fi futuristic adventure \"The Fifth Element\" starring Milla Jovovich and Bruce Willis. His small-screen appearances include \"Highlander\", \"Our Mutual Friend\" and \"Inspector Morse\" during the 1990s. Into the early to mid 2000s, Michael found a balanced amount of work between television and feature films. His work in the late 2000s included \"Treasured Island\" in 2007 as Captain Smollett. In 2009, he played a devious government project director in the Bulgarian-filmed Sci-Fi feature \"Star Runners\" (TV), followed that same year by the dark fantasy drama \"Dorian Gray\" starring Ben Barnes. He is best recognized as Judge Buller in the BBC period series drama \"Garrow's Law\" (TV).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA2MTYzMzgyM15BMl5BanBnXkFtZTgwNjk3ODA0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0191410","name":"Michael Culkin","idIMDB":"nm0191410"},"actorId":"nm0191410","character":"Sir Graham","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ulrich Thomsen","urlProfile":"http://www.imdb.com/name/nm0860947","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjE0MjQ0Ml5BMl5BanBnXkFtZTgwNDEyNjA3MDE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 December 1963","placeOfBirth":" Odense, Denmark","height":"5' 10¾\" (1.8 m)","bio":"Ulrich Thomsen graduated from The Danish National School of Theatre and Contemporary Dance in 1993, after which playing on several theaters in Copenhagen, i.e. Dr. Dantes Aveny, Mungo Park and Østre Gasværks Teater. His debut on film was in Ole Bornedal's Le veilleur de nuit (1994). Since then a number of roles in, among others, Thomas Vinterberg's The Biggest Heroes (1996), Susanne Bier's Credo (1997) and Anders Thomas Jensen's Flickering Lights (2000). However, the major breakthrough came in the film The Celebration (1998) by Thomas Vinterberg, playing the part as Christian, the son. This performance made him well known outside Denmark, earning him a bad guy role in the James Bond film The World Is Not Enough (1999) and a part in the English film Killing Me Softly (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjE0MjQ0Ml5BMl5BanBnXkFtZTgwNDEyNjA3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0860947","name":"Ulrich Thomsen","idIMDB":"nm0860947"},"actorId":"nm0860947","character":"Romanov","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alec Utgoff","urlProfile":"http://www.imdb.com/name/nm4110469","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MjkxMzQ4OF5BMl5BanBnXkFtZTgwMzY1ODAzMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 11¾\" (1.82 m)","bio":"Alec Utgoff (Alec Von Utgoff) is a British actor best known for playing 'Aleksandr Borovsky' in the Paramount feature, Jack Ryan: Shadow Recruit. He was born in Kiev, Ukraine. After moving to UK at a young age, Alec pursued acting and attended the prestigious Drama Centre London where he graduated in 2010 after completing his BA and MA degrees. He appeared in numerous Films and TV series including 'The Tourist' with Angelina Jolie and Johnny Depp, 'Jack Ryan' with Kevin Costner and Sir Kennneth Branagh, 'The Wrong Man's' and others... His parents and his older brother still live in Kiev. Alec's father, Vladimir, is a heart surgeon and his mother, Roza, is a musical conductor. His brother, Alan, is a financial advisor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MjkxMzQ4OF5BMl5BanBnXkFtZTgwMzY1ODAzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4110469","name":"Alec Utgoff","idIMDB":"nm4110469"},"actorId":"nm4110469","character":"Dmitri","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rob de Groot","urlProfile":"http://www.imdb.com/name/nm1545953","urlPhoto":"","biography":{"bio":"Rob de Groot is known for his work on Avengers: Age of Ultron (2015), Spectre (2015) and Guardians of the Galaxy (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1545953","name":"Rob de Groot","idIMDB":"nm1545953"},"actorId":"nm1545953","character":"Vladimir","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Guy Burnet","urlProfile":"http://www.imdb.com/name/nm1298458","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMTg5MjYzNV5BMl5BanBnXkFtZTgwOTE1MDcxODE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 August 1983","placeOfBirth":" England, UK","bio":"Guy Burnet was born on August 8, 1983 in England. He is an actor, known for Ray Donovan (2015), Mortdecai (2015) and Age of Heroes (2011). He is also known for his theater work in London and New York, including rave reviews for 'Murder in the first'. He's also a proficient amateur boxer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMTg5MjYzNV5BMl5BanBnXkFtZTgwOTE1MDcxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1298458","name":"Guy Burnet","idIMDB":"nm1298458"},"actorId":"nm1298458","character":"Maurice","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeff Goldblum","urlProfile":"http://www.imdb.com/name/nm0000156","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NzkyODg1Nl5BMl5BanBnXkFtZTYwMTY2OTE0._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1952","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Jeffrey Lynn Goldblum","height":"6' 4½\" (1.94 m)","bio":"Jeffrey Lynn Goldblum was born October 22, 1952 in Pittsburgh, Pennsylvania, one of four children of Shirley (Temeles), a radio broadcaster who also ran an appliances firm, and Harold L. Goldblum, a doctor. His father was of Russian Jewish descent and his mother was of Austrian Jewish ancestry. Goldblum began his career on the New York stage after moving to the city at age seventeen. Possessing his own unique style of delivery, Goldblum made an impression on moviegoers with little more than a single line in Woody Allen's Annie Hall (1977), when he fretted about having forgotten his mantra. Goldblum went on to appear in the remake Invasion of the Body Snatchers (1978) and co-starred with Ben Vereen in the detective series Tenspeed and Brown Shoe (1980) before a high-profile turn in the classic ensemble film The Big Chill (1983). The quirky actor turned up in the suitably quirky film The Adventures of Buckaroo Banzai Across the 8th Dimension (1984), which became a 1980s cult classic, starred in the modern-day film noir Into the Night (1985), then went on to a breakthrough role in the David Cronenberg remake The Fly (1986), which also featured actress Geena Davis, Goldblum's wife from 1987-1990 and co-star in two additional films: Transylvania 6-5000 (1985) and Julien Temple's Earth Girls Are Easy (1988). Goldblum was the rather unlikely star of some of the biggest blockbusters of the 1990s: Steven Spielberg's dinosaur adventure Jurassic Park (1993) and its sequel The Lost World: Jurassic Park (1997), as well as the alien invasion film Independence Day (1996). These films saw Goldblum playing the type of intellectual characters he has become associated with. More recently, roles have included critically acclaimed turns in Igby Goes Down (2002) and Wes Anderson's The Life Aquatic with Steve Zissou (2004). In 2009, he returned to television to star in his second crime series Law & Order: Criminal Intent (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NzkyODg1Nl5BMl5BanBnXkFtZTYwMTY2OTE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000156","name":"Jeff Goldblum","idIMDB":"nm0000156"},"actorId":"nm0000156","character":"Krampf","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Whitehouse","urlProfile":"http://www.imdb.com/name/nm0925768","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU5ODcwMjQ3OV5BMl5BanBnXkFtZTcwNjQ5MjEyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1958","placeOfBirth":" Stanleytown, Rhondda, Wales, UK","height":"5' 7\" (1.7 m)","bio":"Paul Whitehouse was born on May 17, 1958 in Stanleytown, Rhondda, Wales. He is an actor and writer, known for Corpse Bride (2005), Alice in Wonderland (2010) and Harry Potter and the Prisoner of Azkaban (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU5ODcwMjQ3OV5BMl5BanBnXkFtZTcwNjQ5MjEyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0925768","name":"Paul Whitehouse","idIMDB":"nm0925768"},"actorId":"nm0925768","character":"Spinoza","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Norma Atallah","urlProfile":"http://www.imdb.com/name/nm1850877","urlPhoto":"","biography":{"bio":"Norma Atallah is an actress, known for Mamma Mia! (2008), Les Misérables (2012) and Mortdecai (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1850877","name":"Norma Atallah","idIMDB":"nm1850877"},"actorId":"nm1850877","character":"Bronwen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicholas Farrell","urlProfile":"http://www.imdb.com/name/nm0268297","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MDk5MjA3MV5BMl5BanBnXkFtZTYwOTIxNDc2._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1955","placeOfBirth":" Brentwood, Essex, England, UK","birthName":"Nicholas C. Frost","bio":"Nicholas Farrell was born in 1955 in Brentwood, Essex, England as Nicholas C. Frost. He is an actor, known for Chariots of Fire (1981), Legend (2015) and Bloody Sunday (2002). He has been married to Stella Gonet since 2005. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MDk5MjA3MV5BMl5BanBnXkFtZTYwOTIxNDc2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0268297","name":"Nicholas Farrell","idIMDB":"nm0268297"},"actorId":"nm0268297","character":"Auctioneer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3045616","urlIMDB":"http://www.imdb.com/title/tt3045616","business":{"budget":{"money":"$60,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$4,200,586","country":"USA","day":"25","month":"01","year":"2015","remarks":"2,648 Screens"}],"gross":[{"money":"$7,605,668","country":"USA","day":"08","month":"02","year":"2015","remarks":""},{"money":"$4,200,586","country":"USA","day":"25","month":"01","year":"2015","remarks":""},{"money":"$30,418,560","country":"Worldwide","day":"22","month":"02","year":"2015","remarks":""}],"weekendGross":[{"money":"$138,508","country":"USA","day":"08","month":"02","year":"2015","remarks":"253 Screens"},{"money":"$4,200,586","country":"USA","day":"25","month":"01","year":"2015","remarks":"2,648 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"21","month":"10","year":"2013","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 47 min (107 min)"],"soundMix":["Datasat","Dolby Digital","Dolby Surround 7.1"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa XT, Panavision E- and G-Series Lenses (some scenes)","Red Epic, Panavision Primo, E- and G-Series Lenses"],"laboratory":["Company 3, London, UK (digital intermediate)","Technicolor, London, UK (rushes processing) (rushes transfers)"],"filmLength":null,"negativeFormat":["Codex ARRIRAW (2.8K)","Redcode RAW (5K)"],"cinematographicProcess":["Digital Intermediate (2K) (master format)","Panavision (anamorphic) (source format)"],"printedFilmFormat":["35 mm","D-Cinema"]},"rating":"5,5","metascore":"27","filmingLocations":[{"location":"Old Royal Naval College, Greenwich, London, England, UK"}],"rated":"R","awards":[{"award":"Houston Film Critics Society Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated HFCS Award","categories":[{"category":"Worst Picture","names":[]}]}]},{"award":"Razzie Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Actor","names":[{"name":"Johnny Depp","id":"nm0000136","role":null}]},{"category":"Worst Actress","names":[{"name":"Gwyneth Paltrow","id":"nm0000569","role":null}]},{"category":"Worst Screen Combo","names":[{"name":"Johnny Depp","id":"nm0000136","role":null}]}]}]},{"award":"Yoga Awards 2016","titlesAwards":[{"titleAwardOutcome":"Won Yoga Award","categories":[{"category":"Worst Foreign Actor","names":[{"name":"Johnny Depp","id":"nm0000136","role":null}]}]}]}],"votes":"51 272","type":"Movie","companyCreditsSimple":[{"idCompany":"co0113140","name":"OddLot Entertainment"},{"idCompany":"co0135149","name":"Infinitum Nihil"},{"idCompany":"co0034487","name":"Mad Chance"}],"keywords":{"keywords":["art dealer","stolen painting","moustache","fake painting","macguffin","code","terrorist","russian","mi5","painting","caution tape","forgery","shaving brush","man and woman in bath","luger","switch","ironing clothes","blindfold","woman in a bikini","sex on an airplane","man in a wheelchair","motorcycle with a sidecar","jumper cables","doberman pinscher","thrown from a moving car","stowaway on an airplane","gulfstream 550 business jet","hotel explosion","pheasant hunting","abduction","london cityscape","goya painting","injection in neck","art book","horse riding","cowgirl sex position","aromatic cheese","double barreled shotgun","clothes on fire","cleaver","gun held to head","handlebar mustache","dripping blood","woman goosing a man","horseback riding","united states of america","trip","mistaken for being gay","male vomiting","reference to paris","vomiting","razor","imitating terry thomas","reference to terry thomas","pointing a gun on someone","walking cane","widow","overhearing sex","erection showing through clothes","erection visible through clothing","feet on table","erection","love hate relationship","hotel receptionist","seductive behavior","reference to winston churchill","art collector","art collection","policeman","detective","police investigator","investigator","seductive woman","bitchy wife","drunken man","russian gangster","egoism","egocentrism","servant","selfish wife","selfish woman","bossy woman","bossy wife","lack of money","reference to margaret thatcher","gramophone","open coffin","chopper","swindle","reference to herman goering","nobleman","aristocrat","oxford england","reference to the eiffel tower","coffin","horse drawn hearse","bathroom","clicking one's tongue","motel explosion","motel on fire","setting a painting on fire","painting on fire","bank code","sexual frustration","knocking down a door","money transfer","computer","vomiting onto a car windshield","aspiring poet","shellfish as food","pursuit","jumping off a balcony","poisoning food","invisible ink","dead body","dog attack","ladder","doberman","stammering","nervousness","laughter","eating","dancer","intrigue","swimming pool","food","water fountain","pride","reflection in a mirror","ironing","calling someone stupid","touching someone's breasts","mint julep","guard dog","hotel room","throwing away a drink","orgasm","greece","reference to helen of troy","reference to agamemnon","reference to ajax the mythological greek hero","reference to judas","cactus","f word","eyeglasses","year 1943","rumor","bonfire","swiss bank account","burning a painting","king's mistress","year 1792","reference to king charles iv of spain","lost painting","etching","painting reproduction","reference to hermann goering","ring","banging someone's head into a table","reference to jesus christ","crossbow","police car","throwing someone out of a moving car","jumping onto a moving car","punched in the nose","falling out of a moving car","reckless driving","russia","vodka","caviar","whiskey","finger sandwich","snoring","old man","water bailiff","nickname","penis","winking","telephone call","telephone","duke","lady","airplane stowaway","climbing over a fence","men's bathroom","fortune","chocolate","wine","reference to gruyere cheese","secret bank account","motorcycle with sidecar","pants around ankles","pushing someone out a window","dropping someone's trousers","boxer shorts","russian music","record player","recording","ashtray","car battery","bloody nose","reference to henry edridge","reference to john varley","reference to james bourne","reference to william callow","year 1840","reference to the d'orsay museum paris","reference to the loire museum paris","reference to j. m. w. turner","hotel desk clerk","do not disturb sign","bikini","sperm","male promiscuity","animated sequence","baby","british ambassador","man carries a man in his arms","escalator","british 7th army second division","year 1945","reference to heathrow airport london","british embassy","shooting out a streetlight","hand bandage","falling from height","suit of armor","fencing","door buzzer","reference to fernand just quignon","van","suffering","pain","stepping on someone's foot","beating","reference to helen allingham","circular staircase","british flag","nose bandage","conundrum","back taxes","riding on the top of a car","jumping onto the hood of a car","running","franz joseph mustache","reference to franz joseph of austria","rearview mirror","backing a car into someone","hunting accident","hunting","gunfire","shooting","shooting at a car","calling someone a bastard","rudeness","overdue bill","name calling","urine","auto mechanic","art smuggler","garage","hopelessness","blackfriar's hall oxford","awkwardness","chardonnay","spaniard","cane","kensington west london","art specialist","watching wrestling on tv","watching tv","pajamas","pubic hair","financial ruin","reading a book","book","horniness","breaking a street light","cellphone","american","kiss on the cheek","metaphor","reclaiming one's youth","state secret","overhearing a conversation","tattoo on back","courage","cashew allergy","colorblindness","biological warfare","finder's fee","insurance money","insurance","welsh","escapade","revolutionary","fundamentalist","reference to francisco goya","flatulence","memory","art restorer","photograph","briefcase","sense of smell","cheese","reference to god","rubber gloves","decanter","knocking on a door","art collecting","fired from the job","jumping out a tree","stealing from a thief","hit on the head","shot in the back with an arrow","bow and arrow","artist","farmer's daughter","flash forward","shotgun","shooting out a car window","turkey farmer","sex","looking at oneself in a mirror","mirror","family heirloom","corgi","art auction","reference to george sheridan knowles","insolvency","calling someone darling","paris france","debt","overhead shot","throwing someone over a bar","man on fire","hiding under a table","gunshot","henchman","pointing a gun at someone's head","finger","mountebank","scoundrel","con man","cheater","mosquito","apology","face slap","chinese","egoist","fencer","art theft","scene during opening credits","flaming drink","drinking","drink","money","rivalry","stealing a painting","theft","death","scene of the crime","screwball comedy","murder of an old woman","shaving","circumcision","falling in love","implied nudity","bare chested male","bank check","mace spray","subtitled scene","cantonese","sadist","sadism","brutality","torture","public address system","gagging","shot in the back","pants falling down","pepper spray","toilet","war medal","dog","police station","caught having sex","robbery","thief","arrow","shot with an arrow","thug","eccentric","dancing","food poisoning","jumping from a car","foot chase","hit by a car","informant","magnifying glass","embassy","stupidity","femme fatale","gunfight","shootout","urination","trafalgar square london","investigation","library","motel","spy","secret agent","police inspector","police","arrest","impalement","assassin","assassination attempt","swastika","elevator","hotel","injection","knocked out","drunkenness","airplane","airport","conspiracy","mechanic","smuggler","smuggling","party","horse","father daughter relationship","nymphomaniac","los angeles california","moscow russia","kremlin","london eye","big ben london","sexual innuendo","double entendre","oxfordshire england","funeral","corpse","hearse","sword fight","cockney accent","world war two veteran","journey shown on a map","interrogation","rescue","escape","hostage","kidnapping","meat cleaver","restaurant","blood","straight razor","jumping from height","jumping through a window","threatened with a knife","knife","fish out of water","brawl","fight","fistfight","englishman abroad","england","rifle","bar","bar fight","nightclub","hong kong","mile high club","hit with a mallet","hit in the crotch","head butt","punched in the face","chase","car motorcycle chase","car accident","car chase","rolls royce","motorcycle","explosion","cigarette lighter","fire","blowtorch","billionaire","manor house","mansion","love triangle","repeated line","womanizer","held at gunpoint","slapstick comedy","caper","deception","cell phone","bumbling hero","unlikely hero","anti hero","race against time","money problems","husband wife relationship","revenge","red herring","revolver","pistol","bodyguard","manservant","shot in the foot","shot in the hand","shot in the arm","shot in the shoulder","shot to death","shot in the chest","no opening credits","flashback","two in a bathtub","bathtub","sword","accidental shooting","gun","kiss","london england","auction","murder","vase","mustache","voice over narration","based on novel","surprise ending","one word title","title spoken by character","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:30:50"}}