{"data":{"movies":[{"title":"Dr. Easy","originalTitle":"","year":"2013","releaseDate":"20130621","directors":[{"name":"Jason Groves","id":"nm1861182"},{"name":"Chris Harding","id":"nm1831845"}],"writers":[{"name":"Matthew De Abaitua","id":"nm0206821"},{"name":"Jason Groves","id":"nm1861182"}],"runtime":"9 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjcxYWMwMDItZTE0OS00ZjlkLTk4NzctOWIwOGI3Nzk0ZjUwXkEyXkFqcGdeQXVyNjAzNzExNTk@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Short","Sci-Fi"],"plot":"Dr. Easy shows us a futuristic world where robots are trained to deal with emergency situations. When a confused man becomes a threat to his bystanders and himself, the medical robot Dr. Easy is activated to withhold him from his act. For this task Dr. Easy must not only predict and interpret human behavior, but also show human empathy. The movie is based on the first chapter Matthew de Abaitua's novel 'The Red Men'.","simplePlot":"Dr. Easy, a medical robot, is activated when a confused man becomes a threat to his bystanders and himself.","actors":[{"actorName":"Tom Hollander","urlProfile":"http://www.imdb.com/name/nm0390903","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NjY0NjM4M15BMl5BanBnXkFtZTcwOTEwMjQzMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1967","placeOfBirth":" Bristol, England, UK","height":"5' 5\" (1.65 m)","bio":"Tom Hollander was born the second child of educated parents, both teachers. He grew up in Oxford, (UK). Hollander credits the happy atmosphere of the Dragon School with his childhood introduction to acting. There, encouraged by an influential teacher named Andrew Roberts, he won the title role in \"Oliver\". His studies continued at Abingdon, as did his pursuit of acting. At about this point, he won a place in the National Youth Theatre, a UK organization for young people in the field of musical theatre, based in London, and later at the Children's Music Theatre. It was during CMT's \"The Leaving of Liverpool\" (1981) that he came to the attention of BBC television, and subsequently found himself front and center as the young protagonist in a well-regarded John Diamond (1981), based on the popular Leon Garfield adventure novel. He was just fourteen years old. Other early projects included two roles in Bertholt Brecht's \"The Caucasian Chalk Circle\" (1985) for the National Youth Theatre, and \"A Midsummer Night's Dream\" for Oxford University Dramatic Society. Hollander attended Cambridge University at about the same time as his childhood friend Sam Mendes in a visually bold (and well-remembered) staging of \"Cyrano de Bergerac\" (1988). Other collaborations with Mendes have followed, including work at the West End production of \"The Cherry Orchard\" (1989, with Judi Dench), and the Chichester Festival Theatre (1989) as well as a Toronto staging of \"Kean\" (1991) with Derek Jacobi. He also appeared in the Cambridge Footlights Revue (1988). Upon graduation, Hollander hoped to gain entry to drama school, but found himself disappointed. The oversight did nothing to discourage a successful career already well under way: he garnered an Ian Charleson Award for his turn as Witwould in \"The Way of the World\" (1992), was nominated again for a \"splendidly sinister, manic\" performance as \"Tartuffe\" (1996), and yet again as a finalist for his Khlestakov (\"a performance of ideal vigour and impudence\"), in Gogol's \"The Government Inspector\" (1997). Inevitably, Hollander was urged to try films, and appeared in two films as early as 1996. True Blue (1996) (aka \"Miracle at Oxford\") found him in a small but memorable role as the cox for Oxford's noted 1987 \"mutiny crew\" that went on to win the that year's boat race against Cambridge, and in a thankless role in Some Mother's Son (1996), a sober drama about an IRA gunman, playing a Thatcher representative. Hollander's career has featured a number of memorable gay roles. His fans are especially fond of the larger-than-life Darren from Bedrooms and Hallways (1998), a romantic comedy with what one reviewer called the \"funniest bedroom scene of the year\" involving Hollander's character and Hugo Weaving. The over-the-top Darren was so convincing that some viewers assumed Hollander was gay. \"Sometimes I call myself a professional homosexual impersonator,\" he told an interviewer at the time, quickly adding, \"you could say that ...Sir Ian McKellen and Rock Hudson do straight actors.\" The following year, he would take on a very different kind of \"gay\" role, playing the notorious \"Bosie\" (Lord Alfred Douglas) against Liam Neeson's Oscar Wilde in \"The Judas Kiss\" (1998). \"Martha -- Meet Frank Daniel and Laurence\" (aka The Very Thought of You (1998), with Joseph Fiennes and Rufus Sewell, brought accolades for his standout role as Daniel, a difficult music executive. Variety, impressed, noted him for \"U.K. legit work\" and called him the \"undisputed hit of the pic\". 2001 brought Gosford Park (2001), Robert Altman's masterfully stylized murder mystery, in which he played the quietly desperate Anthony Meredith against Michael Gambon's callously indifferent paterfamilias. Hollander's name figures in a half dozen or more \"Best Ensemble\" awards for this complex, multi-storied film. Considered the character-actor-of-choice for roles with comedic qualities, Hollander has challenged assumptions about his capacity by taking on difficult, troubled characters such as the tightly-wound King George V in Stephen Poliakoff's The Lost Prince (2003) for BBC and the demented fascist dictator Maximillian II in Land of the Blind (2006). Hollander himself is particularly proud of the film Lawless Heart (2001), a slyly humorous, cleverly constructed comedy-drama told from three viewpoints. Hollander's character, the heart of the film, is a decent man, devastated by the death of his partner, and grieving privately as the stories of friends and family unfold around him. A study of desire, loyalty and courage, the film was very well reviewed and much respected. More recent film work has brought him to the attention of mainstream movie audiences, who now know him as the magnificently petty tyrant Lord Cutler Beckett in the second and third installments of Disney's \"Pirates of the Caribbean\" movies, Pirates of the Caribbean: Dead Man's Chest (2006) and Pirates of the Caribbean: At World's End (2007). This role brought another kind of achievement: Hollander could now say that he'd been commemorated in collectible action-figure form. He's worked three times with director Joe Wright, beginning with the prissy, yet strangely likeable Mr. Collins in Pride & Prejudice (2005), as a clueless classical cellist in an unfortunately truncated role in The Soloist (2009), and as Issacs, the German henchman in Hanna (2011). With In the Loop (2009), Hollander brought a perfectly unbearable, delicate tension to the role of Simon Foster, the earnestly clueless \"British Secretary of State for International Development\" who says the wrong thing at exactly the wrong moment. The film acted as a kind of companion piece to the critically-acclaimed The Thick of It (2005) on BBC2, Armando Iannucci's furious political satire on the machinations of war and media. Hollander's contribution to the expanded story was apparently so well-received he was \"brought back\" (but in a different role, entirely) from film to television for a series-ending surprise-appearance in series 3, delighting fans of the show. Recent work in television has brought him the opportunity to expand on his special capacity for conveying nuanced and contradictory characters. He earned an award for Best Actor at the FIPA International Television Festival for his portrayal of Guy Burgess in Cambridge Spies (2003), and earned praise for the monstrously rude yet oddly endearing Leon in the satire Freezing (2008), with Hugh Bonneville and Elizabeth McGovern) for BBC. He was unforgettable in an elegantly brief but very moving portrayal of King George III for HBO's John Adams (2008). 2010 brought Hollander to widespread attention with Rev. (2010), which he co-created with James Wood. The show, initially described in what was assumed to be familiar terms (\"vicar\", \"comedy\") became something entirely new: \"...an exploration of British hypocrisy and a warmly played character piece\", wrote Giles Fraser, Canon Chancellor at St Paul's Cathedral in a piece for The Sunday Telegraph. Rev. was much more than it appeared: reviews called it intelligent, realistic and very funny, with a stellar cast headed by Hollander as the sympathetic and very human vicar, Adam Smallbone. The show would garner a BAFTA in 2011 for Best Situation Comedy, among other awards and recognition. Hollander supports a variety of charitable causes in innovative ways. In 2006 he ran his first race for the Childline Crisis hotline, and in 2007 ran for the Teenage Cancer Trust. He is a long-time supporter of the Helen and Douglas House in Oxford, which provides Hospice care for children, and continues to support charitable organizations by contributing readings and other appearances throughout the year. Hollander is a patron of BIFA, the British Independent Film Awards, and has supported the efforts of the Old Vic's \"24 Hour Plays New Voices\" Gala, which forwards the cause of young writers for the British stage. Hollander continues to diversify with voicework roles in radio, reading audiobooks, doing voiceover work and onstage. He appeared in the Old Vic's production of Georges Feydeau's \"A Flea in Her Ear\" (2010), playing a demanding dual role: the upstanding Victor Emmanuel Chandebise and the lame-brained Poche. Reviews called it \"insanity\", and his performance \"a breathtaking combination of lightning physical precision and shockingly true confusion\". Hollander is in production for series 2 of the winning comedy Rev. (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NjY0NjM4M15BMl5BanBnXkFtZTcwOTEwMjQzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0390903","name":"Tom Hollander","idIMDB":"nm0390903"},"actorId":"nm0390903","character":"Michael","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Geraldine James","urlProfile":"http://www.imdb.com/name/nm0416524","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzkzNDY5OF5BMl5BanBnXkFtZTcwMzA2MzQxNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1950","placeOfBirth":" Maidenhead, Berkshire, England, UK","height":"5' 7\" (1.7 m)","bio":"Geraldine James, Officer of the Order of the British Empire (OBE) was born on July 6, 1950 in Maidenhead, Berkshire. She was educated at Downe House, a girls' independent school in Newbury, Berkshire, and later, at Drama Centre London. Geraldine has made several film and television appearances, she was nominated four times a BAFTA TV Award for her performances in Dummy (1979), The Jewel in the Crown (1984), Band of Gold (1995), and The Sins (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzkzNDY5OF5BMl5BanBnXkFtZTcwMzA2MzQxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0416524","name":"Geraldine James","idIMDB":"nm0416524"},"actorId":"nm0416524","character":"Dr. Easy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alex Macqueen","urlProfile":"http://www.imdb.com/name/nm1276507","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MDM3MDUxMl5BMl5BanBnXkFtZTcwOTc3OTc2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1974","placeOfBirth":" Epsom, Surrey, England, UK","bio":"Alex Macqueen was born in 1974 in Epsom, Surrey. He was in the National Youth Theatre in the 1990's while studying English at Durham University and International Relations at Pembroke College, Cambridge. He is best known for his roles as Julius Nicholson in 'The Thick of It' and Neil's Dad in 'The Inbetweeners'. He has worked alongside various Directors including, Woody Allen, Kenneth Branagh, Bryan Singer, Armando Ianucci and Richard Curtis. In 2011 he was cast by Shane Meadows in 'This Is England 88' and in 2012 took the lead in Sky Atlantic's 'Hunderby' opposite Julia Davis. In 2013 he was cast as the new 'Master' in the Dr Who Audio series produced by Big Finish. In 2009 he starred in the film The Hide (2008), directed by Marek Losey and written by Tim Whitnall. The Hide was described by Film Four as 'a brilliantly balanced understated drama' and by The Times as giving 'Misery and Sleuth a ride for their money'. The Hide is a psychological thriller set in a bird watchers retreat on the Suffolk marshes, shot in seven days at Pinewood and three on location, and filmed on a micro budget. Alex Macqueen has also made guest appearances in British comedies including Peep Show (2003), Pulling (2006), The Inbetweeners (2008), Lead Balloon (2006) and The IT Crowd (2006). He had a long-running part as Dr Keith Greene, an anaesthetist with a dry, sarcastic sense of humour, in Holby City (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MDM3MDUxMl5BMl5BanBnXkFtZTcwOTc3OTc2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1276507","name":"Alex Macqueen","idIMDB":"nm1276507"},"actorId":"nm1276507","character":"Superintendent","urlCharacter":"http://www.imdb.com/character/ch0509839","main":true},{"actorName":"Waj Ali","urlProfile":"http://www.imdb.com/name/nm5400084","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjZmMzE3MzEtMWI5MC00ZTViLWI0NDktOTU5MTcyMGYzZTZiL2ltYWdlXkEyXkFqcGdeQXVyMzgyOTQ3MTU@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Waj Ali is an actor, known for RED 2 (2013), Tyrant (2014) and Da Vinci's Demons (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjZmMzE3MzEtMWI5MC00ZTViLWI0NDktOTU5MTcyMGYzZTZiL2ltYWdlXkEyXkFqcGdeQXVyMzgyOTQ3MTU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5400084","name":"Waj Ali","idIMDB":"nm5400084"},"actorId":"nm5400084","character":"Swat Team","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve Campbell","urlProfile":"http://www.imdb.com/name/nm5782993","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Steve Campbell yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5782993","name":"Steve Campbell","idIMDB":"nm5782993"},"actorId":"nm5782993","character":"Police Officer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Al Gregg","urlProfile":"http://www.imdb.com/name/nm1527704","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2ODE4NDE0NV5BMl5BanBnXkFtZTgwMDMzODY1OTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Al Gregg is an actor and writer, known for Captive (2016), Passport to Murder (2016) and 50 Ways to Kill Your Lover (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2ODE4NDE0NV5BMl5BanBnXkFtZTgwMDMzODY1OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1527704","name":"Al Gregg","idIMDB":"nm1527704"},"actorId":"nm1527704","character":"Police Officer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julian Klinger","urlProfile":"http://www.imdb.com/name/nm5034777","urlPhoto":"","biography":{"bio":"Julian Klinger is known for his work on Dead Wood (2014), Got to Dance (2009) and Dr. Easy (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5034777","name":"Julian Klinger","idIMDB":"nm5034777"},"actorId":"nm5034777","character":"Tactical Officer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Rochester","urlProfile":"http://www.imdb.com/name/nm4112792","urlPhoto":"","biography":{"bio":"Chris Rochester is an actor, known for Dr. Easy (2013), The Interesting Narrative of Olaudah Equiano (2007) and Bridgetower (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4112792","name":"Chris Rochester","idIMDB":"nm4112792"},"actorId":"nm4112792","character":"Driver / Paramedic","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paris Stangl","urlProfile":"http://www.imdb.com/name/nm4823963","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDg1NjYyODc1MV5BMl5BanBnXkFtZTgwMDU2MDk2ODE@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"bio":"Paris Stangl is an actor, known for Jason Bourne (2016), Shady Lady (2012) and Chasing Robert Barker (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDg1NjYyODc1MV5BMl5BanBnXkFtZTgwMDU2MDk2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4823963","name":"Paris Stangl","idIMDB":"nm4823963"},"actorId":"nm4823963","character":"Swat Team","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rodney Tosh","urlProfile":"http://www.imdb.com/name/nm4717337","urlPhoto":"","biography":{"height":"6' 4¾\" (1.95 m)","bio":"Rodney was born in Coleraine, Northern Ireland. He was the middle child of three brothers. His father Don Tosh is a mechanical engineer and his mother Alice works with children with special educational needs. His mother's love of musical theatre ensured that theatre and music were ever present in the Tosh household. As a child Rodney first wanted to be a boxer, and then a scientist. In 1999 he moved to Dundee to study Biotechnology. After an existential crisis catalyzed by the excesses of his Scottish university's halls of residence, he left Scotland and moved back home to Northern Ireland where he enrolled at a local college and began a vocational performing arts qualification. It was here that he met the Benson twins, Northern Irish directors/writers with whom he has been working on various film projects since. Rodney soon joined a local drama group, performing at the University's Riverside Theatre in Coleraine. Following this he was encouraged to enroll on a Theatre Studies Degree course at the University of Ulster. Around the same time he began practicing Buddhism and it wasn't long before he'd dropped out of university (for a second time) and left to travel in India. He lived for some time in the hill stations, training in yoga and meditation and repairing the damage caused by the aforementioned excesses of the Scottish University. On his return from India in 2004 Rodney began singing with Irish rock band, Hunger's Mother, gigging in pubs and clubs across Northern Ireland and recording a self titled album. He filmed several short films with the Benson twins (including 0.0270270, also starring James Nesbitt and Rodney's own dog Billy Tosh). He also appeared in commercials for UTV internet. After witnessing his grandfather succumb to lung cancer in 2006, Rodney moved away once again, this time to London where his brother was living and working as a junior doctor. He was accepted onto a two year professional acting course at the Poor School in King's Cross. He performed in various productions including Cat on a Hot Tin Roof, The Importance of Being Earnest and Scenes from the Big Picture. He finally graduated in 2009 and has been working as an actor ever since. He worked for three months on David Ayer's 'Fury' in winter 2013. He writes and makes short films with his partner in London.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4717337","name":"Rodney Tosh","idIMDB":"nm4717337"},"actorId":"nm4717337","character":"Swat Team","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3013214","urlIMDB":"http://www.imdb.com/title/tt3013214","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["9 min"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.4","filmingLocations":[],"awards":[{"award":"British Independent Film Awards 2013","titlesAwards":[{"titleAwardOutcome":"Nominated British Independent Film Award","categories":[{"category":"Best British Short","names":[]}]}]},{"award":"Edinburgh International Film Festival 2013","titlesAwards":[{"titleAwardOutcome":"Nominated Best Short Film","categories":[{"category":"","names":[{"name":"Richard Kenworthy","id":"nm1858933","role":null},{"name":"Chris Harding","id":"nm1831845","role":null},{"name":"Jason Groves","id":"nm1861182","role":null}]}]}]}],"votes":"94","type":"Movie","companyCreditsSimple":[{"idCompany":"co0197272","name":"Film4"},{"idCompany":"co0104859","name":"Warp Films"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:16:11"}}