{"data":{"movies":[{"title":"Kenshin: La fin de la légende","originalTitle":"Rurôni Kenshin: Densetsu no saigo-hen","year":"2014","releaseDate":"20161012","directors":[{"name":"Keishi Ohtomo","id":"nm3311094"}],"writers":[{"name":"Nobuhiro Watsuki","id":"nm0914941"},{"name":"Sean Whitley","id":"nm0926075"}],"runtime":"134 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMjAyNDExMV5BMl5BanBnXkFtZTgwMzk0MzUxNTE@._V1.jpg","countries":["Japan"],"languages":["Japanese"],"genres":["Action","Adventure","Drama"],"plot":"Kenshin wakes up to find himself at his master(Hiko Seijuro)'s house after getting washed by the waves to land while he was unconscious at sea for 3 days. Kenshin asks Seijuro to teach him the ultimate and pinnacle technique of the Hiten Mitsurugi school, the Amakakeru Ryu no Hirameki. Seijuro accepts Kenshin's request after they spar with each other. Meanwhile in Tokyo, Prime Minister Hirobumi Ito attends a meeting with Makoto Shishio who forces him to declare Kenshin a wanted outlaw and have him publicly executed or else Shishio will destroy both Tokyo and the government.","simplePlot":"Shishio has set sail in his ironclad ship to bring down the Meiji government and return Japan to chaos, carrying Kaoru with him. In order to stop him in time, Kenshin trains with his old master to learn his final technique.","actors":[{"actorName":"Tatsuya Fujiwara","urlProfile":"http://www.imdb.com/name/nm0297885","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4Njc2OTYwMF5BMl5BanBnXkFtZTcwNDM1MzkwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 May 1982","placeOfBirth":" Chichibu, Japan","height":"5' 10\" (1.78 m)","bio":"Tatsuya Fujiwara was born on May 15, 1982 in Chichibu, Japan. He is known for his work on Battle Royale (2000), Le Cahier de la Mort (2006) and Death Note: The Last Name (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4Njc2OTYwMF5BMl5BanBnXkFtZTcwNDM1MzkwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0297885","name":"Tatsuya Fujiwara","idIMDB":"nm0297885"},"actorId":"nm0297885","character":"Makoto Shishio","urlCharacter":"http://www.imdb.com/character/ch0054423","main":true},{"actorName":"Takeru Satô","urlProfile":"http://www.imdb.com/name/nm2615398","urlPhoto":"","biography":{"dateOfBirth":"21 March 1989","placeOfBirth":" Saitama, Japan","height":"5' 7\" (1.7 m)","bio":"Takeru Satô was born on March 21, 1989 in Saitama, Japan. He is an actor, known for Rurouni Kenshin (2012), Kenshin Kyoto Inferno (2014) and Kenshin: La fin de la légende (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2615398","name":"Takeru Satô","idIMDB":"nm2615398"},"actorId":"nm2615398","character":"Kenshin Himura","urlCharacter":"http://www.imdb.com/character/ch0031599","main":true},{"actorName":"Ryûnosuke Kamiki","urlProfile":"http://www.imdb.com/name/nm1126340","urlPhoto":"","biography":{"dateOfBirth":"19 May 1993","placeOfBirth":" Saitama, Japan","height":"5' 5\" (1.65 m)","bio":"Ryûnosuke Kamiki was born on May 19, 1993 in Saitama, Japan. He is an actor, known for Spirited Away (2001), Howl's Moving Castle (2004) and Your Name (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1126340","name":"Ryûnosuke Kamiki","idIMDB":"nm1126340"},"actorId":"nm1126340","character":"Sôjirô Seta","urlCharacter":"http://www.imdb.com/character/ch0443655","main":true},{"actorName":"Emi Takei","urlProfile":"http://www.imdb.com/name/nm3191754","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2OTcwNTQ5N15BMl5BanBnXkFtZTcwNjA3NDA4Nw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1993","placeOfBirth":" Aichi Prefecture, Japan","height":"5' 5¼\" (1.66 m)","bio":"Emi Takei was born on December 25, 1993 in Aichi Prefecture, Japan. She is an actress, known for Rurouni Kenshin (2012), Kenshin Kyoto Inferno (2014) and For Love's Sake (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2OTcwNTQ5N15BMl5BanBnXkFtZTcwNjA3NDA4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3191754","name":"Emi Takei","idIMDB":"nm3191754"},"actorId":"nm3191754","character":"Kaoru Kamiya","urlCharacter":"http://www.imdb.com/character/ch0049671","main":true},{"actorName":"Yû Aoi","urlProfile":"http://www.imdb.com/name/nm1066974","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzODAxMTAzOF5BMl5BanBnXkFtZTcwOTYzNTMyNQ@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1985","placeOfBirth":" Fukuoka, Japan","birthName":"Yû Natsui","height":"5' 3\" (1.6 m)","bio":"Yû Aoi was born on August 17, 1985 in Fukuoka, Japan as Yû Natsui. She is an actress, known for Tekkonkinkreet (2006), Redline (2009) and Hula Girls (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzODAxMTAzOF5BMl5BanBnXkFtZTcwOTYzNTMyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1066974","name":"Yû Aoi","idIMDB":"nm1066974"},"actorId":"nm1066974","character":"Megumi Takani","urlCharacter":"http://www.imdb.com/character/ch0056178","main":true},{"actorName":"Yûsuke Iseya","urlProfile":"http://www.imdb.com/name/nm0410832","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2Mzk2NjAzOV5BMl5BanBnXkFtZTYwOTI3NDk2._V1_UY44_CR36,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 May 1976","placeOfBirth":" Tokyo, Japan","height":"5' 10¾\" (1.8 m)","bio":"Yûsuke Iseya was born on May 29, 1976 in Tokyo, Japan. He is an actor and director, known for Blindness (2008), 13 assassins (2010) and Casshern (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2Mzk2NjAzOV5BMl5BanBnXkFtZTYwOTI3NDk2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0410832","name":"Yûsuke Iseya","idIMDB":"nm0410832"},"actorId":"nm0410832","character":"Aoshi Shinomori","urlCharacter":"http://www.imdb.com/character/ch0394638","main":true},{"actorName":"Min Tanaka","urlProfile":"http://www.imdb.com/name/nm0849032","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MjM3MDM2N15BMl5BanBnXkFtZTgwNTk3OTE4MDE@._V1_UY44_CR37,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1945","placeOfBirth":" Tokyo, Japan","bio":"Min Tanaka was born in 1945 in Tokyo, Japan. He is known for his work on 47 Ronin (2013), Tekkonkinkreet (2006) and Carte des sons de Tokyo (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MjM3MDM2N15BMl5BanBnXkFtZTgwNTk3OTE4MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0849032","name":"Min Tanaka","idIMDB":"nm0849032"},"actorId":"nm0849032","character":"Okina / Nenji Kashiwazaki","urlCharacter":"http://www.imdb.com/character/ch0484040","main":true},{"actorName":"Masaharu Fukuyama","urlProfile":"http://www.imdb.com/name/nm0298048","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU3OTcwNDM1MF5BMl5BanBnXkFtZTcwODM4NDg0OQ@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 February 1969","placeOfBirth":" Nagasaki, Japan","height":"5' 10¾\" (1.8 m)","bio":"Fukuyama Masaharu is a musician, singer-songwriter, music producer, actor, radio personality and photographer from Japan. In 1987 at the age of 18, he left his hometown Nagasaki for Tokyo. The next year, artist management and entertainment company Amuse Inc. celebrated their 10th anniversary with the \"Amuse 10 Movie Auditions\" project. Fukuyama auditioned and won a co-lead part in the 1988 movie \"Hon no 5g\". Signed up with Amuse Inc., he formally made his debut as a singer-songwriter with the single \"Tsuioku no Ame no Naka\" in 1990. Initial years were hard and his first few CDs did not fare well. But he was slowly creating a following for himself through regular live house performances and a few drama parts. His first break came in 1992 with the 5th single \"Good Night\" and its namesake - a song he wrote for the TV drama \"Ai wa douda\" which he also co-starred in, and which gave him his first footing into the Oricon Top 10. From then on, he was able to tie-in song-writing with various TV drama and commercials, and by 1994 achieved his first Oricon chart-topper and million-seller with his 9th single \"It's Only Love/Sorry Baby\". Since 2011, Fukuyama holds the record as the all-time best-selling male solo singer in Japan. In 2015, after 25 years in the business, his 31st single \"I am a Hero\" earned him his 17th Oricon Singles chart-topper and the coveted title of Male Solo Artiste with the Most Oricon No.1 Single Hits. He had already been first in the Singer-songwriter category since 2011. His single \"Sakurazaka\" (released in 2000) still stands as the highest selling single by a Japanese male solo artiste in Oricon history. As an actor, Fukuyama's involvement in select movies and TV drama have also proven a great success. The TV series \"Hitotsu Yane no Shita\" in 1993 provided his big breakthrough in popularity not only within Japan but also in Asian countries where this drama was subsequently shown. In 1996, at the height of his career at that time, Fukuyama took a 2 year hiatus, withdrawing from almost all entertainment activities except his 2 weekly radio shows. It was during this time that he came under the guidance of acclaimed photographer Ueda Shoji with whom he had worked previously for his CD covers. In later interviews, Fukuyama would disclose that it was more than photography that he learnt from Ueda, but a mentality and passion for work. To this day, years after his mentor's passing, all of Fukuyama's music work are still credited with thanks to Ueda Shoji. Returning to the entertainment scene in 1998, Fukuyama has since scaled new heights in both music and acting. His lead roles in the highly popular Galileo tv series (2007, 2013) and the year-long Taiga drama Ryomaden (2010) further cemented his status within Japan and around the region. In 2008, Fukuyama appeared in his first major leading movie, \"Yougisha X no Kenshin\"(Suspect X) from the Galileo franchise. The film went on to top domestic box office for 4 consecutive weeks and grossed US$54,826,455 worldwide. It was the 2nd-highest grossing non-animation local film that year. Fukuyama partnered with Kanno Yugo on the movie soundtrack, each contributing a part of it. After a 5 year break from the movie scene, he reprised his role in the second Galileo movie \"Manatsu no Hoteshiki\" (Midsummer's Equation) in 2013, both as lead character Yukawa Manabu and co-composer for the film's music. The movie has since opened in Hong Kong, Taiwan, Singapore and around the region. 2013 also brought him numerous Best Actor nominations in major film festivals around the world, through his performance in the Cannes-winning movie Soshite Chichi ni Naru (Like Father Like Son). He won the accolade in the Yokohama Film Festival and Takasaki Film Festival. As a singer-songwriter by primary profession, Like Father Like Son was only Fukuyama's 3rd major movie (his 2nd in terms of shooting schedule, as Midsummer's Equation was filmed after Like Father Like Son). Premiered in the 2013 Cannes Film Festival, the film won the Jury Prize and has gone on to take numerous Best Feature, Audience Choice and Special Awards in film festivals around the world. To-date, it has been released in over 40 countries or territories globally. Fukuyama is also involved as narrator in the ongoing NHK documentary project on endangered species called \"Hot Spots, The Last Paradise\". The first season was co-produced with NHNZ, France Televisions, Science Channel and Animal Planet. Fukuyama did not appear in the internationally released version which was renamed \"Life Force\". Season 2 was released domestically between Oct 2014 to Mar 2015 and is scheduled to be aired around the region at time of writing. Known for his deep voice and live performances, Fukuyama concerts are constant sellouts in Japan. In addition to regular nation-wide tours, he holds a series of count-down concerts almost every year, called the Daikanshasai or \"thanksgiving fest\". This tradition stems from 1998 whereupon resuming his music activities, he was moved by the response of his many supporters who had waited through the years without any news of a return. The Daikanshasai was his way of thanking his fans and continues to this day, having passed its 14th time running at year-end 2014. Fukuyama has mentioned on more than one occasion that concerts are invariably his \"favourite part of the job\". His \"We're Bros Tour 2009: Michishirube\" tour set a personal record in concert audience participation, with upto 500,000 attending 36 performances in 12 major concert arenas around the country. In May the same year, to kick-start his 20th anniversary activities, Fukuyama had brought forward the traditional year-end Daikanshasai to prelude his nation-wide Michishirube tour, performing in the Budokan solo for the first time. As a token of gratitude to his fans for the past 20 years, ticket prices were set at an unprecedented low of JPY3,939, playing on the Japanese pronunciation of 3939 for \"thank you thank you\". All 4 shows totaling 60,000 seats were sold out in a matter of minutes. That same summer, he returned to his hometown Nagasaki for two outdoor concerts at the Mount Inasa Park. At the same time, 50,000 local residents were invited to a simultaneous free live broadcast viewing at the Big N baseball stadium nearby. It was reported that an estimated 80,000 people were brought in by the concerts for those 2 days alone (both from local surrounding regions and overseas), contributing to an estimated economic impact of JPY1.5 billion (equiv to USD16.5 million) for the city's tourism income. In 2011, Fukuyama furthered his audience record with the \"We're Bros Tour 2011: The Live Bang!\" tour. 52 performances in 18 major concert arenas resulted in a total attendance in excess of 600,000. Not included in this number was a special outdoor concert which was added in the Okinawa Nishihara Marine Park as an extension of the Tour. 2014 marked a number of concert firsts for Fukuyama - his first nation-wide Dome tour, his first overseas concert tour, and his first Men's Night and Ladies' Night gender specific concerts. Between April and May, the \"We're Bros Tour 2014\" was held in 5 of the country's biggest concert domes (Tokyo, Osaka, Nagoya, Fukuoka, Sapporo) and the Saitama Super Arena, with 14 sell-out performances bringing in total audience numbers in excess of 500,000. In June, he extended the tour to Taiwan and Hong Kong, holding one show in the Taipei Arena and 2 in the Hong Kong Convention and Exhibition Centre, allowing many overseas fans to see him live in concert for the first time. An estimated 12,000 attended the show in Taiwan and 11,000 in Hong Kong. The overseas concerts were met with critical acclaim from public and industry reviewers alike. Taiwan satellite TV network TVBS Senior Reporter Michael Chang applauded it as one of the few which can set the standards of excellence for concerts in the Taipei Arena. Hong Kong Skypost Assistant Chief Editor Elaine Tang wrote that she had never experienced such level of electricity in Hong Kong concerts before, and that this was the way a concert should be. Movie producer/director Peter Tsi described it as a performance which resonated with him and moved him deeply. In the summer of 2015, after 25 years in the business, Fukuyama embarked on his first ever stadium concerts. All shows at the Osaka Yanmar Stadium (50,000 capacity) and Yokohama Nissan Stadium (70,000 capacity, the nation's largest) were fully sold out, reaching a total audience count of 240,000 in just 4 days. The summer tour would end with a return trip to his hometown Nagasaki for 2 outdoor shows at Mount Inasa Park. Again, sold out within minutes, the homecoming concert was broadcast live not only to cinemas across Japan, Hong Kong and in Taiwan, but also free for public viewing at the Nagasaki Seaside Park. To celebrate his 25th anniversary, JR Kyushu converted one of their fully operational limited express trains into a travelling tribute to Fukuyama. The Fuku! Kamome express runs daily on the Hakata-Nagasaki route and others, between August 23 and October 16, 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU3OTcwNDM1MF5BMl5BanBnXkFtZTcwODM4NDg0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0298048","name":"Masaharu Fukuyama","idIMDB":"nm0298048"},"actorId":"nm0298048","character":"Seijuro Hiko","urlCharacter":"http://www.imdb.com/character/ch0394641","main":true},{"actorName":"Yukiyoshi Ozawa","urlProfile":"http://www.imdb.com/name/nm0654733","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNzg1NDUzOF5BMl5BanBnXkFtZTgwNjIwMjMzNzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1974","placeOfBirth":" New Hampshire, USA","bio":"Yukiyoshi Ozawa was born on June 6, 1974 in New Hampshire, USA. He is an actor, known for La servante et le samouraï (2004), Fireflies: River of Light (2003) and Mt. Tsurugidake (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNzg1NDUzOF5BMl5BanBnXkFtZTgwNjIwMjMzNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0654733","name":"Yukiyoshi Ozawa","idIMDB":"nm0654733"},"actorId":"nm0654733","character":"Hirobumi Ito","urlCharacter":"http://www.imdb.com/character/ch0483517","main":true},{"actorName":"Tao Tsuchiya","urlProfile":"http://www.imdb.com/name/nm3145634","urlPhoto":"","biography":{"height":"5' 0¾\" (1.54 m)","bio":"Tao Tsuchiya is an actress, known for Kenshin Kyoto Inferno (2014), Deep Red Love (2013) and Yell for the Blue Sky (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3145634","name":"Tao Tsuchiya","idIMDB":"nm3145634"},"actorId":"nm3145634","character":"Misao Makimachi","urlCharacter":"http://www.imdb.com/character/ch0394643","main":true},{"actorName":"Munetaka Aoki","urlProfile":"http://www.imdb.com/name/nm1328568","urlPhoto":"","biography":{"dateOfBirth":"14 March 1980","placeOfBirth":" Yao, Osaka, Japan","height":"6' (1.83 m)","bio":"Munetaka Aoki was born on March 14, 1980 in Yao, Osaka, Japan. He is an actor, known for Hara-Kiri: mort d'un samourai (2011), Silence (2016) and Kenshin Kyoto Inferno (2014). He has been married to Yuhka since June 27, 2016.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1328568","name":"Munetaka Aoki","idIMDB":"nm1328568"},"actorId":"nm1328568","character":"Sanosuke Sagara","urlCharacter":"http://www.imdb.com/character/ch0049672","main":true},{"actorName":"Yôsuke Eguchi","urlProfile":"http://www.imdb.com/name/nm0251139","urlPhoto":"","biography":{"dateOfBirth":"31 December 1967","placeOfBirth":" Tokyo, Japan","height":"6' 0¾\" (1.85 m)","bio":"Yôsuke Eguchi was born on December 31, 1967 in Tokyo, Japan. He is an actor, known for Goemon, the Freedom Fighter (2009), Soie (2006) and Kenshin Kyoto Inferno (2014). He has been married to Chisato Moritaka since 1999.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0251139","name":"Yôsuke Eguchi","idIMDB":"nm0251139"},"actorId":"nm0251139","character":"Hajime Saitô","urlCharacter":"http://www.imdb.com/character/ch0394639","main":true},{"actorName":"Maryjun Takahashi","urlProfile":"http://www.imdb.com/name/nm5156521","urlPhoto":"","biography":{"dateOfBirth":"8 November 1987","placeOfBirth":" Otsu, Shiga, Japan","height":"5' 6½\" (1.69 m)","bio":"Maryjun Takahashi was born on November 8, 1987 in Otsu, Shiga, Japan. She is an actress, known for Kenshin Kyoto Inferno (2014), Jun to Ai (2012) and Fukushû shitai (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5156521","name":"Maryjun Takahashi","idIMDB":"nm5156521"},"actorId":"nm5156521","character":"Yumi Komagata","urlCharacter":"http://www.imdb.com/character/ch0049675","main":true},{"actorName":"Maya Fukuzawa","urlProfile":"http://www.imdb.com/name/nm4881653","urlPhoto":"","biography":{"height":"5' 2¼\" (1.58 m)","bio":"Maya Fukuzawa is known for her work on Escape Plan (2013), Kenshin Kyoto Inferno (2014) and Mutant Girls Squad (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4881653","name":"Maya Fukuzawa","idIMDB":"nm4881653"},"actorId":"nm4881653","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lisa Ulliel","urlProfile":"http://www.imdb.com/name/nm5889381","urlPhoto":"","biography":{"dateOfBirth":"27 April 1996","placeOfBirth":" Boulogne-Billancourt, Hauts-de-Seine, France","birthName":"Elizabeth Camille Ulliel","bio":"Lisa Ulliel was born on April 27, 1996 in Boulogne-Billancourt, Hauts-de-Seine, France as Elizabeth Camille Ulliel. She is an actress, known for Kenshin Kyoto Inferno (2014), Kenshin: La fin de la légende (2014) and Ultimate Heist (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5889381","name":"Lisa Ulliel","idIMDB":"nm5889381"},"actorId":"nm5889381","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3029556","urlIMDB":"http://www.imdb.com/title/tt3029556","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 14 min (134 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.6","filmingLocations":[],"awards":[{"award":"Asian Film Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Asian Film Award","categories":[{"category":"Best Actor","names":[{"name":"Takeru Satô","id":"nm2615398","role":null}]}]}]}],"votes":"5,974","type":"Movie","companyCreditsSimple":[{"idCompany":"co0045026","name":"Warner Bros."},{"idCompany":"co0028938","name":"Amuse"},{"idCompany":"co0049595","name":"Shueisha"}],"keywords":{"keywords":["japan","1870s","katana","samurai","ronin","based on manga","based on anime","kyoto japan","tokyo japan","dojo"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 21:35:55"}}