{"data":{"movies":[{"title":"Les pendules de Noël","originalTitle":"A Very Merry Mix-Up","year":"2013","releaseDate":"20131110","directors":[{"name":"Jonathan Wright","id":"nm0942527"}],"writers":[{"name":"Barbara Kymlicka","id":"nm1672013"}],"runtime":"87 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExMzM4NDIxNjJeQTJeQWpwZ15BbWU4MDcwODUyMDMx._V1.jpg","countries":["Canada","USA"],"languages":["English"],"genres":["Comedy","Drama","Family","Romance"],"plot":"Shop owner Alice Chapman is nervous about meeting her future in-laws at Christmas, especially because she is arriving ahead of her new fiancé, Will Mitchum. Alice's trip becomes more stressful when her luggage is lost and her phone is damaged, leaving her no way to find Will's family!","simplePlot":"Shop owner Alice Chapman is nervous about meeting her future in-laws at Christmas, especially because she is arriving ahead of her new fiancé, Will Mitchum. Alice's trip becomes more ... ","actors":[{"actorName":"Alicia Witt","urlProfile":"http://www.imdb.com/name/nm0001860","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzkxNzI5NDkyNl5BMl5BanBnXkFtZTcwMDc1MTgyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 August 1975","placeOfBirth":" Worcester, Massachusetts, USA","birthName":"Alicia Roanne Witt","height":"5' 8½\" (1.74 m)","bio":"Actor/singer songwriter Alicia Witt has had a nearly three-decade long career, starting with her film debut, in 1984, as \"Alia\" in David Lynch's science fiction classic, Dune (1984). Witt was born in Worcester, Massachusetts, to Diane (Pietro), a high school teacher, and Robert Witt, a photographer and science teacher. Her ancestry includes Irish, Italian, French-Canadian, Polish, and English. Alicia is an accomplished singer/songwriter. A classically-trained pianist for the past five years, she has been performing her original piano-driven rock all across the world, and has opened for Ben Folds Five, Jimmy Webb and John Fullbright. Her self-titled first EP was released on iTunes in 2009 and her Kickstarter-funded first full length album, \"Live at Rockwood\", which was recorded at Rockwood Music Hall in NYC, was released following a self-booked national tour in 2012. Witt performed live as the musical guest on CBS' The Late Late Show with Craig Ferguson (2005). In 1994, Witt appeared in the critically-acclaimed Fun (1994), which debuted at the Sundance Film Festival. The film, directed by Rafal Zielinski, depicts a tale of two disturbed young girls whose quest for fun leads them to murder. Witt received the \"Special Jury Recognition\" Award at Sundance and a nomination for an Independent Spirit Award. In 1998, she starred in Columbia Tristar's hit horror movie, Urban Legend (1998). On television, Witt has made guest appearances on the phenomenally successful HBO series, The Sopranos (1999), and the Emmy award-winning Ally McBeal (1997), in which she sang opposite Randy Newman. She previously starred for four seasons, as Cybill Shepherd's daughter \"Zoey\", on the hit CBS sitcom, Cybill (1995). Witt combined her acting talents, with her skills as a pianist, in the romantic comedy, Playing Mona Lisa (2000). For this role, she won a Best Actress Award at the US Comedy Arts Festival. Alicia made her film debut in 1984 in David Lynch's Dune (1984), and by age 14, received her high school diploma and moved to Los Angeles to pursue acting full-time. Once in Los Angeles, Lynch cast her in his cult classic television series, Twin Peaks (1990), as \"Gersten Hayward\", a part that he had written specifically for Witt. Following this, Lynch utilized Alicia's talents once again in his HBO trilogy, Hotel Room (1993), in which she portrayed a young woman with a multiple personality disorder, opposite Crispin Glover. Witt was seen in Paramount's Last Holiday (2006), with Queen Latifah and Timothy Hutton. She also appeared, opposite Joan Allen, Kevin Costner, Erika Christensen, Evan Rachel Wood and Keri Russell in New Line's critically-acclaimed film, The Upside of Anger (2005), which premiered at the Sundance Film Festival. She is also well-known for her role in the Warner Bros. hit romantic comedy, Two Weeks Notice (2002), opposite Hugh Grant and Sandra Bullock. Witt appeared on-stage in fall 2006 at London's Royal Court Theatre in Terry Johnson's \"Piano/Forte\". She made her West End debut with Neil LaBute's \"The Shape of Things\". She was also seen on stage in \"Dissonance\" at the Williamstown Theatre Festival. In April 2013, Alicia performed in the 24 Hour Musicals off-Broadway, for the 3rd time. She has previously taken the stage in the 24 Hour Plays on Broadway and in the West End. Alicia made her directorial debut with the short film, Belinda's Swan Song (2006), which she also wrote. The film premiered at the 2006 Rhode Island International Film Festival and was screened at 9 additional festivals around the world, including the Los Angeles International Short Film Festival. She also appeared in Mr. Holland's Opus (1995), opposite Richard Dreyfuss, as clarinet player \"Gertrude Lang\", as well as Four Rooms (1995) (Miramax), with Tim Roth, Madonna, and Lili Taylor, and directed by Quentin Tarantino, Allison Anders, Robert Rodriguez and Alexandre Rockwell. She was also seen in the John Waters film, Cecil B. Demented (2000), with Stephen Dorff and Melanie Griffith, as well as director Cameron Crowe's Vanilla Sky (2001), opposite Tom Cruise. Other film credits include Mike Figgis' Liebestraum (1991), starring Kevin Anderson; Bodies, Rest & Motion (1993), starring Tim Roth and Bridget Fonda; Bongwater (1998), opposite Luke Wilson; Peep World (2010), with Sarah Silverman, Michael C. Hall and Rainn Wilson; The Pond (2010) with David Morse; and Away from Here (2014), opposite Nick Stahl. Alicia is on Season 5 of the Emmy-award winning FX series, Justified (2010) with Timothy Olyphant, in which she is heavily recurring as \"Wendy Crowe\", the smart and sexy paralegal sister of crime lord \"Danny Crowe\", played by Michael Rapaport. The season premiere, in which Alicia is introduced, airs January 5, 2014. She starred, opposite Peter Bogdanovich and Cheryl Hines, in the independent family dramedy Cold Turkey (2013), in limited theatrical release Nov 15, 2013, following its festival run. She also can be heard on the closing credits song, which she wrote and co-performed with Ben Folds. The music video can be seen at themefrompasadena.com. Alicia will appear that same month in her Hallmark film Les pendules de Noël (2013), in which she stars as a girl who goes home to spend Christmas with her fiancé for the first time, only to discover that she may or may not be about to marry the wrong guy. She also appeared in Tyler Perry's feature A Madea Christmas (2013), which was released through Lionsgate theatrically worldwide on December 14, 2013. To round out her trio of holiday films, A Snow Globe Christmas (2013) premieres on Lifetime on December 17. Additionally, she is recurring this year on the ABC series Betrayal (2013), as the long-estranged sister of Sara (Hannah Ware). Her first episode aired Nov. 10. The critically-acclaimed independent feature film, I Do (2012), opened nationwide in May 2013, after screening at 25 festivals worldwide and winning 10 awards. Alicia has two songs featured in this film as well, including her latest single, 'Do It'. In 2012, she was in the Samuel Goldwyn film Cowgirls 'n Angels (2012), with 'James Cromwell', which premiered at the Dallas Film Festival and opened on May 25, 2012. She appeared in the Emmy award-winning series finale of Friday Night Lights (2006) on NBC, in which she reprised her Season 4 role as Becky's mom \"Cheryl\", and recurred on CBS' The Mentalist (2008) as blind pianist \"Rosalind\". Alicia starred, opposite Al Pacino, in the feature film, 88 Minutes (2007), for director Jon Avnet. Witt played a graduate student and teaching assistant with whom Pacino's character, a forensic psychiatrist, has a complicated relationship. She played \"Detective Nola Falacci\", opposite Chris Noth, on NBC's Law & Order: Criminal Intent (2001) for half a season; she was also featured on the Emmy-award winning CBS comedy, Two and a Half Men (2003), as a teacher-turned-stripper in an episode featuring an extended lap dance that has been viewed nearly 2 million times on YouTube.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzkxNzI5NDkyNl5BMl5BanBnXkFtZTcwMDc1MTgyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001860","name":"Alicia Witt","idIMDB":"nm0001860"},"actorId":"nm0001860","character":"Alice Chapman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Wiebe","urlProfile":"http://www.imdb.com/name/nm3261468","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTA0MTQ3M15BMl5BanBnXkFtZTgwMzQ5MDM3ODE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"bio":"Mark Wiebe is an actor, known for Lost After Dark (2015), Les pendules de Noël (2013) and Sweet Karma (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTA0MTQ3M15BMl5BanBnXkFtZTgwMzQ5MDM3ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3261468","name":"Mark Wiebe","idIMDB":"nm3261468"},"actorId":"nm3261468","character":"Matt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lawrence Dane","urlProfile":"http://www.imdb.com/name/nm0199325","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzIxNTk5NF5BMl5BanBnXkFtZTcwMDMyMzgwOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1937","placeOfBirth":" Masson, Quebec, Canada","height":"6' 1\" (1.85 m)","bio":"Lawrence Dane is an exceptionally fine, versatile and shamefully underrated Canadian character actor who's equally adept at both comedy and drama alike. Tall and lean, with silver gray hair, a gaunt face and a distinguished air about him, Dane is often cast as smooth business executives, physicians, police officers and stern authority figures. Born on April 3 in 1937 in Masson, Quebec, Lawrence grew up in Ottawa and initially took acting lessons in order to overcome shyness. Dane first started acting in the early 1960's. He soon amassed a substantial volume of film and TV show credits. Lawrence gave an especially terrific performance as one of five doctors who find themselves being terrorized by vicious vengeful hillbillies when they go camping in the remote Canadian wilderness in the harrowing Deliverance (1972) variant The Creeper (1977); the multi-talented Dane also produced this gritty and suspenseful cult favorite thriller. Other notable roles Dane has played are Michael Ironside's evil business partner in David Cronenberg's Scanners (1981), Melissa Sue Anderson's father in the superior slasher item Happy birthday, souhaitez ne jamais être invité (1981) and Peter Weller's tough, but fair boss in the excellent killer rat knockout D'origine inconnue (1983). Moreover, Dane displayed a delightful flair for comedy in the amusing features It Seemed Like a Good Idea at the Time (1975) and Find the Lady (1976), in which he was nicely paired with a then-unknown John Candy. Now in his late 70s, Lawrence Dane still continues to act in both TV shows and movies with pleasing regularity.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MzIxNTk5NF5BMl5BanBnXkFtZTcwMDMyMzgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0199325","name":"Lawrence Dane","idIMDB":"nm0199325"},"actorId":"nm0199325","character":"Charles","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott Gibson","urlProfile":"http://www.imdb.com/name/nm0317181","urlPhoto":"","biography":{"birthName":"Scott Andrew Gibson","height":"6' 1\" (1.85 m)","bio":"Scott Gibson was born as Scott Andrew Gibson. He is an actor, known for Lucky Number Slevin (2006), Breach (2007) and The Skulls (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0317181","name":"Scott Gibson","idIMDB":"nm0317181"},"actorId":"nm0317181","character":"Will","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susan Hogan","urlProfile":"http://www.imdb.com/name/nm0389623","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMTg5NTgxNV5BMl5BanBnXkFtZTcwODQyNjE2NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Susan King","bio":"Susan Hogan was born as Susan King. She is an actress, known for Brigade de nuit (1985), White Fang (1991) and Chromosome 3 (1979). She is married to Michael Hogan. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMTg5NTgxNV5BMl5BanBnXkFtZTcwODQyNjE2NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0389623","name":"Susan Hogan","idIMDB":"nm0389623"},"actorId":"nm0389623","character":"Penny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Fitzpatrick","urlProfile":"http://www.imdb.com/name/nm0280584","urlPhoto":"","biography":{"bio":"An American citizen, native of Boston, Mass., member of ACTRA and SAG, Richard has worked professionally for more than forty years. In major feature films, movies for television, mini-series and episodic television he has appeared in a variety of leading and supporting roles that showcase his versatility and range as an actor. He is happily married to the Goddess of Magic and has one son, Alex, a warrior artist.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0280584","name":"Richard Fitzpatrick","idIMDB":"nm0280584"},"actorId":"nm0280584","character":"Joe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mimi Kuzyk","urlProfile":"http://www.imdb.com/name/nm0476906","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NDYxNjQ0OV5BMl5BanBnXkFtZTcwMDg1MDkzMg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1952","placeOfBirth":" Winnipeg, Manitoba, Canada","birthName":"Marilyn Iris Kuzyk","bio":"Mimi Kuzyk is a Winnipeg born actress, best know for her roles in the series Hill Street Blues and Blue Murder. Mimi grew up in Winnipeg with her brother and five sisters. She discovered her love of dance at the age of eight. Following her passion, Mimi joined the Rusalka Folk Ensemble, which she would participate in as both a dancer and a choreographer for the next fifteen years. Realizing she was happiest on stage, Mimi decided to pursue an acting career in Toronto. After a series of commercials and small TV rolls, Mimi moved to LA in 1983. After a only a short time in LA, she landed a recurring role as Patsy Mayo in the series Hill Street Blues. This hit show was undoubtedly the making of Mimi's career; but she considers her greatest achievement to be her daughter, Kaliopi. After a lengthy career is in LA, Mimi has returned to Toronto and continues to work. She enjoys quiet times reading the classics with her cats. Mimi's film credits include Camille opposite Sienna Miller and James Franco, The Human Stain starring Anthony Hopkins and Nicole Kidman, as well as the Sci-fi thrillers Final Cut with Robin Williams and The Day After Tomorrow. Her extensive body of film work also includes Lost and Delirious, which earned Ms. Kuzyk a Genie nomination for Best Supporting Actress. On television, Ms. Kuzyk has recently been seen in guest starring roles on such hit shows as Ghost Whisperer and NCIS. She is well recognized for her role as Detective Patsy Mayo on HIll Street Blues. Her performance as \"Rita Kapeli\" in the CBC drama Little Criminals, and as Deputy Chief Kay Barrow in Blue Murder earned her Gemini nominations for Best Supporting Actress. In 2013, she was introduced to the world of motion capture in the video game Splinter Cell: Black List . Her recent credits include Pegasus Versus Chimera, A Very Mix Up and Sorority Surrogate. She also stars with an incredible ensemble of Canadian stars in the independent film Sex After Kids.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NDYxNjQ0OV5BMl5BanBnXkFtZTcwMDg1MDkzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0476906","name":"Mimi Kuzyk","idIMDB":"nm0476906"},"actorId":"nm0476906","character":"Judith","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Judah Katz","urlProfile":"http://www.imdb.com/name/nm0441754","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzODA2NzU3OV5BMl5BanBnXkFtZTcwNDQ0NzU5OQ@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 June 1960","placeOfBirth":" Montreal, Quebec, Canada","bio":"Judah Katz was born on June 23, 1960 in Montreal, Quebec, Canada. He is an actor, known for Crash (1996), Cinderella Man (2005) and The Long Kiss Goodnight (1996). He was previously married to Wendy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzODA2NzU3OV5BMl5BanBnXkFtZTcwNDQ0NzU5OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0441754","name":"Judah Katz","idIMDB":"nm0441754"},"actorId":"nm0441754","character":"Roy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Justin Mader","urlProfile":"http://www.imdb.com/name/nm1328749","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1OTY5MDMzOF5BMl5BanBnXkFtZTgwMzM2OTA1MzE@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"bio":"Justin Mader is an actor and writer, known for Room (2015), Death Race (2008) and La folle histoire de La fete à la maison (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1OTY5MDMzOF5BMl5BanBnXkFtZTgwMzM2OTA1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1328749","name":"Justin Mader","idIMDB":"nm1328749"},"actorId":"nm1328749","character":"Billy Mitchum","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Russell Yuen","urlProfile":"http://www.imdb.com/name/nm0004067","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MzM5MDQyM15BMl5BanBnXkFtZTcwMjcwMzI2Mg@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1965","placeOfBirth":" Montreal, Quebec, Canada","height":"5' 8\" (1.73 m)","bio":"Toronto/Montreal-based Russell Yuen is one of Canada's busiest character actors. Like most actors Yuen spent his early career doing an assortment of jobs to make ends meet while he became established. Unlike most actors it wasn't waiting tables or serving drinks. A dedicated athlete, Yuen spent his time as a white water rescuer and rafting guide in Northern Quebec, ran a Nautilus facility and worked as a fitness trainer. Yuen is also an enthusiastic scuba diver, a mountain and ice-climber, an in-line skater, a mountain biker and a fencer. A former martial artist in Shaolin, Yuen used his stunt skills to move from bit parts, playing Asian gangsters and fighters, into meatier roles. His breakout opportunity came with The Red Violin and more feature film parts quickly followed for this versatile young actor whose skills range from action, to drama, to broad comedy. Other screen performances include Bulletproof Monk directed by John Woo, Owning Mahoney and Long Life, Happiness and Prosperity. He has appeared in Billy Ray's Shattered Glass, David Weaver's Indie feature Century Hotel; Between the Moon and Montevideo; Phillip Noyce's The Bone Collector, opposite Denzel Washington; David Mamet's The Heist; Ron Underwood's Pluto Nash, opposite Eddie Murphy, and Stephan Elliot's Eye Of The Beholder. Well known to Quebec audiences for his film work Yuen starred in the Quebec feature film Ballade des Dangereux, directed by Louis Saia. Yuen has an extensive list of television credits on both English and French projects and series. He was most recently featured on the popular French series Jack Carter, in the recurring role of impotent mobster \"Wong Phat\". He has a recurring role in Diva and other recent television credits include principal roles in: Relic Hunter; The Associates; A Touch of Hope; and The Adventures of Jules Verne. Television credits also include multiple appearances in Kung Fu:The Legend Continues, and roles in Urban Angel, Counterstrike, John Woo's Once A Thief, and PSI Factor. Fluently bilingual (French/English) Yuen maintains homes in both Toronto and Montreal. A fourth-generation Canadian, born and raised in the Montreal suburbs of St. Laurent and Pierrefond, with deep connections to Vancouver (all of his extended family live there still), Yuen was guided by his parents to become a doctor. However, his studies came to an abrupt halt when a chance Drama elective turned into a full-time pursuit. After studying Theatre at Concordia University, in the honors program, he quickly moved into film and television where he has found continuing success.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MzM5MDQyM15BMl5BanBnXkFtZTcwMjcwMzI2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004067","name":"Russell Yuen","idIMDB":"nm0004067"},"actorId":"nm0004067","character":"Dr. Stark","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alison Jutzi","urlProfile":"http://www.imdb.com/name/nm3018906","urlPhoto":"","biography":{"bio":"Alison Jutzi is an actress, known for Les pendules de Noël (2013), The Christmas Switch (2014) and Peg+Cat (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3018906","name":"Alison Jutzi","idIMDB":"nm3018906"},"actorId":"nm3018906","character":"Airport Employee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Reale","urlProfile":"http://www.imdb.com/name/nm0998489","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmJiMTRhOWUtNjkzMi00M2FjLWIyY2YtYmJhZTYwYmJhYTE1XkEyXkFqcGdeQXVyMjE1NjgzODY@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 December 1984","placeOfBirth":" Canada","height":"5' 7\" (1.7 m)","bio":"David Reale was born on December 19, 1984 in Canada. He is an actor and director, known for Beyblade (2001), Chloe (2009) and Splinter Cell: Blacklist (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmJiMTRhOWUtNjkzMi00M2FjLWIyY2YtYmJhZTYwYmJhYTE1XkEyXkFqcGdeQXVyMjE1NjgzODY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0998489","name":"David Reale","idIMDB":"nm0998489"},"actorId":"nm0998489","character":"Jeremy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Howard Hoover","urlProfile":"http://www.imdb.com/name/nm0393888","urlPhoto":"","biography":{"bio":"Howard Hoover is known for his work on Repo Men (2010), The Corruptor (1999) and The Boondock Saints II: All Saints Day (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0393888","name":"Howard Hoover","idIMDB":"nm0393888"},"actorId":"nm0393888","character":"Grant Lockley","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3131456","urlIMDB":"http://www.imdb.com/title/tt3131456","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 27 min (87 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["16:9 HD"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.8","filmingLocations":[],"rated":"TV-G","awards":[],"votes":"1,813","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0012678","name":"Chesler/Perlmutter Productions"}],"keywords":{"keywords":["in laws","future in laws","christmas","fate","businessman","shop owner","mix up","kiss","character says you snooze you lose","medical examination","gift","redhead","five word title","night walk","store owner","destiny","ends with a kiss","2010s","happy ending","breaking up with fiance","clock stopped","compliment","christmas present","christmas eve","flashlight","sitting on a bench","craftsman","bench","shakespearean quotation","reference to shakespeare's the merchant of venice","reference to william shakespeare","female tears","reference to the cub scouts","christmas tree","decorating a christmas tree","family home","grandfather","three generations","reference to katharine hepburn","reference to spencer tracy","reference to humphrey bogart","reference to lauren bacall","throwing flour in someone's face","christmas cookies","baking cookies","merry christmas","salesman","main character romance","hospital","clock","reference to shakespeare's romeo and juliet","reference to paris france","applause","hyphen in title","holiday season","broken cellphone","drink spilled on clothes","spilling drink on someone","car accident","car crashing into a tree","brooklyn new york city","antique shop owner","antique store","lost luggage","airport","misunderstanding","redheaded woman","marriage proposal on one's knees","marriage proposal","fiance fiancee relationship","storytelling"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:00:37"}}