{"data":{"movies":[{"title":"Men, Women & Children","originalTitle":"","year":"2014","releaseDate":"20141017","directors":[{"name":"Jason Reitman","id":"nm0718646"}],"writers":[{"name":"Jason Reitman","id":"nm0718646"},{"name":"Erin Cressida Wilson","id":"nm0933379"}],"runtime":"119 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMzc2OTgwOTZeQTJeQWpwZ15BbWU4MDg2ODA4NjIx._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama"],"plot":"Men, Women and Children follows the story of a group of high school teenagers and their parents as they attempt to navigate the many ways the internet has changed their relationships, their communication, their self-image, and their love lives. The film attempts to stare down social issues such as video game culture, anorexia, infidelity, fame hunting, and the proliferation of illicit material on the internet. As each character and each relationship is tested, we are shown the variety of roads people choose - some tragic, some hopeful - as it becomes clear that no one is immune to this enormous social change that has come through our phones, our tablets, and our computers.","simplePlot":"A group of high school teenagers and their parents attempt to navigate the many ways the Internet has changed their relationships, their communication, their self-image, and their love lives.","actors":[{"actorName":"Adam Sandler","urlProfile":"http://www.imdb.com/name/nm0001191","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyNzM2MjM1Ml5BMl5BanBnXkFtZTcwMDE5NjI3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1966","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Adam Richard Sandler","height":"5' 9½\" (1.77 m)","bio":"Adam Richard Sandler was born September 9, 1966 in Brooklyn, New York, to Judith (Levine), a teacher at a nursery school, and Stanley Alan Sandler, an electrical engineer. He is of Russian Jewish descent. At 17, he took his first step towards becoming a stand-up comedian when he spontaneously took the stage at a Boston comedy club. He found he was a natural comic. He nurtured his talent while at New York University (graduating with a Bachelor of Fine Arts degree in 1991) by performing regularly in clubs and at universities. During his freshman year, he snagged a recurring role as the Huxtable family's friend Smitty on The Cosby Show (1984). While working at a comedy club in L.A., he was \"discovered\" by Dennis Miller, who recommended him to Saturday Night Live (1975) producer Lorne Michaels and told him that Sandler had a big talent. This led to his being cast in the show in 1990, which he also wrote for in addition to performing. After Saturday Night Live (1975), Sandler went on to the movies, starring in such hit comedies as Airheads (1994), Happy Gilmore (1996), Billy Madison (1995) and Big Daddy (1999). He has also starred in Mr. Deeds (2002) alongside Winona Ryder; Eight Crazy Nights (2002), an animated movie about the Jewish festival of Chanukah; and Punch-Drunk Love (2002). He also writes and produces many of his own films and has composed songs for several of them, including The Wedding Singer (1998). Sandler has had several of his songs placed on the \"Billboard\" charts, including the classic \"The Chanukah Song\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyNzM2MjM1Ml5BMl5BanBnXkFtZTcwMDE5NjI3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001191","name":"Adam Sandler","nicknames":["Sandman"],"idIMDB":"nm0001191"},"actorId":"nm0001191","character":"Don Truby","urlCharacter":"http://www.imdb.com/character/ch0416480","main":true},{"actorName":"Jennifer Garner","urlProfile":"http://www.imdb.com/name/nm0004950","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA4MDgzMTc1Nl5BMl5BanBnXkFtZTcwNjQyMjIwNQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1972","placeOfBirth":" Houston, Texas, USA","birthName":"Jennifer Anne Garner","height":"5' 8\" (1.73 m)","bio":"Jennifer Garner, who catapulted into stardom with her lead role on the television series Alias (2001), has come a long way from her birthplace of Houston, Texas. Raised in Charleston, West Virginia by her mother, Patricia Ann (née English), a retired teacher of English, and her father, William John Garner, a former chemical engineer, Jennifer is the middle sibling of three girls. She spent nine years of her adolescence studying ballet and describes her years in dance as ones characterized by determination rather than talent, being driven mostly by a love of the stage. Jennifer took this determination with her when she enrolled at Denison University as a chemistry major, a decision that was later changed to a drama major when she found that her passions for the stage were stronger than her love of science. New York attracted the young actress after college where she worked as a hostess while pursuing a career in film and television. Her most recent move has been to Los Angeles, a decision that led to a role on the television series Felicity (1998), where she met her future husband Scott Foley. The couple divorced in 2004. Jennifer appeared on the television series, Alias (2001), as \"Agent Sydney Bristow\", who works for the Central Intelligence Agency. For her work, Garner has received four consecutive Emmy nominations for Outstanding Lead Actress in a Drama Series. She has also received four Golden Globe nominations and won once, as well as received two Screen Actors Guild Award nominations, and won once. She has appeared in numerous other television production as well as such films as Elektra (2005), 13 Going on 30 (2004), Daredevil (2003), Pearl Harbor (2001) and Dude, Where's My Car? (2000). Aside from filming Alias (2001), Jennifer enjoys cooking, gardening, hiking, and inspired by her character on the series, kickboxing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA4MDgzMTc1Nl5BMl5BanBnXkFtZTcwNjQyMjIwNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004950","name":"Jennifer Garner","idIMDB":"nm0004950"},"actorId":"nm0004950","character":"Patricia Beltmeyer","urlCharacter":"http://www.imdb.com/character/ch0476304","main":true},{"actorName":"Rosemarie DeWitt","urlProfile":"http://www.imdb.com/name/nm1679669","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMTg3ODA5M15BMl5BanBnXkFtZTcwOTA1NzQyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1971","placeOfBirth":" Flushing, Queens, New York City, New York, USA","height":"5' 5¾\" (1.67 m)","bio":"Rosemarie DeWitt was born on October 26, 1971 in Flushing, Queens, New York City, New York, USA. She is an actress, known for La La Land (2016), Cinderella Man (2005) and The Watch (2012). She has been married to Ron Livingston since November 2, 2009. They have two children. She was previously married to Chris Messina (I).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMTg3ODA5M15BMl5BanBnXkFtZTcwOTA1NzQyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1679669","name":"Rosemarie DeWitt","nicknames":["Rose"],"idIMDB":"nm1679669"},"actorId":"nm1679669","character":"Helen Truby","urlCharacter":"http://www.imdb.com/character/ch0499129","main":true},{"actorName":"Judy Greer","urlProfile":"http://www.imdb.com/name/nm0339460","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MTAyMzMzMl5BMl5BanBnXkFtZTcwMDY2Mzc2NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 July 1975","placeOfBirth":" Detroit, Michigan, USA","birthName":"Judith Therese Evans","height":"5' 8\" (1.73 m)","bio":"Judy Greer was born and raised outside of Detroit, Michigan, as Judith Therese Evans. She is the daughter of Mollie Ann (née Greer), a hospital administrator and former nun, and Richard Evans, a mechanical engineer. She has German, Irish, English, Welsh, and Scottish ancestry. After training for nearly ten years in classical Russian ballet, Greer shifted her interest to acting and was accepted into Chicago's prestigious Theater School at DePaul University. After a variety of odd jobs during college, from telemarketer to oyster shucker, Greer landed her first on-screen role just three days after graduation -- a small part in the Jason Lee-David Schwimmer comedy Kissing a Fool (1998). She flew to Los Angeles for the film's premiere and never left. Greer quickly landed a role in the dark comedy Jawbreaker (1999), with Rose McGowan and Rebecca Gayheart. Greer starred as a school wallflower-turned-babe in a story about high school girls who accidentally kill their best friend and try to cover up the murder. She went on to play a news correspondent in David O. Russell's Three Kings (1999), landing a memorable opening love scene with George Clooney. Her performance caught the eye of Hollywood, and she appeared next in Mike Nichols's What Planet Are You From? (2000) as a flight attendant opposite Garry Shandling. Her television credits include a recurring role as Jason Bateman's assistant Kitty on Fox's Arrested Development (2003), as well as guest-starring roles on Love & Money (1999), Maggie Winters (1998), and Early Edition (1996). Greer starred opposite Jennifer Garner in Columbia Pictures' romantic comedy 13 Going on 30 (2004), directed by Gary Winick. Greer played an office colleague alongside Garner's character, with whom she shares a checkered past. She co-starred in writer-director M. Night Shyamalan's The Village (2004), opposite Joaquin Phoenix, Adrien Brody, Bryce Dallas Howard, Sigourney Weaver, and William Hurt. Set in 1897, the film revolves around a close-knit community that lives with the knowledge that a mythical race of creatures resides in the woods surrounding them. The Village (2004) was released July 30, 2004, by Touchtone Pictures. Greer also co-starred in director Wes Craven's Cursed (2005), a modern twist on the classic werewolf tale written by Kevin Williamson. The busy actress also landed a co-starring role opposite Orlando Bloom and Susan Sarandon in writer-director Cameron Crowe's Elizabethtown (2005). Greer will play the sister of Bloom's character and daughter of Sarandon's character. She also joined Jeff Bridges and Jeanne Tripplehorn in the independent film The Amateurs (2005) by writer-director Michael Traeger. The film revolves around a motley group of friends who band together to make an amateur porn film. Greer plays a young temptress at the local mattress store who secures a role in the movie by allowing the store to be used as a film location. Greer wrapped production in New York on a co-starring role opposite Tom McCarthy (\"The Station Agent\") in Danny Leiner's The Great New Wonderful (2005) for Serenade Films/Sly Dog Films. The dark comedy tells five different stories against the backdrop of an uncertain post-September 11 New York. The cast also includes Maggie Gyllenhaal, Edie Falco and Tony Shalhoub. She also appeared in writer-director Adam Goldberg's psychological drama I Love Your Work (2003), opposite Giovanni Ribisi. The film is about a fictional movie star (Ribisi) and his gradual meltdown and increasing obsession with a young film student and his girlfriend. The stellar cast also included Franka Potente, Christina Ricci, and Jason Lee and debuted at the 2003 Toronto International Film Festival. In the film, Greer plays Samantha, the personal assistant of Ribisi's character. Greer had a starring role as the female lead role in the comedy The Hebrew Hammer (2003) as the feisty, fearless Esther, who joins forces with an Orthodox Jewish Blaxploitation hero (Adam Goldberg) to save Hanukkah from an evil son of Santa Claus (Andy Dick). The Hebrew Hammer (2003) debuted at the 2003 Sundance Film Festival and premiered on Comedy Central followed by a theatrical release. She also appeared in Adaptation. (2002), from director Spike Jonze. In the film, Nicolas Cage stars as self-loathing writer Charlie Kaufman (and twin brother Donald) as he attempts to adapt the novel \"The Orchid Thief\" for the big screen. Greer played Alice, the waitress with whom he becomes obsessed -- the object of his fantasies. Greer turned in a scene-stealing comedic performance in Un mariage trop parfait (2001), with Jennifer Lopez and Matthew McConaughey, in which she played Penny, Lopez's sweet but ditsy assistant who tries hard, but often falls a little short. Equally adept at more dramatic roles, Greer gave a standout performance opposite Mel Gibson in What Women Want (2000), playing a suicidal file clerk rescued by the one man who can hear women's thoughts. Greer's pivotal scene with Gibson is the heart of the film. With a genuine gift for comedy and an engaging on-screen presence, Judy Greer has quickly become one of Hollywood's most captivating young talents. Having appeared in such diverse films as Jawbreaker (1999), What Women Want (2000), Un mariage trop parfait (2001), and Adaptation. (2002), as well as a number of upcoming feature film projects, Greer turns in scene-stealing performances opposite some of the industry's biggest stars.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MTAyMzMzMl5BMl5BanBnXkFtZTcwMDY2Mzc2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0339460","name":"Judy Greer","nicknames":["Greer"],"idIMDB":"nm0339460"},"actorId":"nm0339460","character":"Donna Clint","urlCharacter":"http://www.imdb.com/character/ch0499130","main":true},{"actorName":"Dean Norris","urlProfile":"http://www.imdb.com/name/nm0606487","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzOTQ2NDIzOF5BMl5BanBnXkFtZTcwMTE0OTYwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1963","placeOfBirth":" South Bend, Indiana, USA","birthName":"Dean Joseph Norris","height":"5' 7\" (1.7 m)","bio":"Dean Norris was born on April 8, 1963 in South Bend, Indiana, USA as Dean Joseph Norris. He is an actor and producer, known for Breaking Bad (2008), Total Recall (1990) and Little Miss Sunshine (2006). He has been married to Bridget since April 2001. They have five children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzOTQ2NDIzOF5BMl5BanBnXkFtZTcwMTE0OTYwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0606487","name":"Dean Norris","idIMDB":"nm0606487"},"actorId":"nm0606487","character":"Kent Mooney","urlCharacter":"http://www.imdb.com/character/ch0477725","main":true},{"actorName":"Emma Thompson","urlProfile":"http://www.imdb.com/name/nm0000668","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNTAyOTg0MF5BMl5BanBnXkFtZTcwNTg0MzY1Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1959","placeOfBirth":" Paddington, London, England, UK","height":"5' 8\" (1.73 m)","bio":"Emma Thompson was born in London on April 15, 1959, into a family of actors - her father was Eric Thompson, who has passed away, and her mother, Phyllida Law, has co-starred with Thompson in several films (her sister, Sophie Thompson, is an actor as well). Her father was English-born and her mother is Scottish-born. Thompson's wit was cultivated by a cheerful, clever, creative family atmosphere, and she was a popular and successful student. She attended Cambridge University, studying English Literature, and was part of the university's Footlights Group, the famous group where, previously, many of the Monty Python members had first met. Thompson graduated in 1980 and embarked on her career in entertainment, beginning with stints on BBC radio and touring with comedy shows. She soon got her first major break in television, on the comedy skit program Alfresco (1983), writing and performing along with her fellow Footlights Group alums Stephen Fry and Hugh Laurie. She also worked on other TV comedy review programs in the mid-1980s, occasionally with some of her fellow Footlights alums, and often with actor Robbie Coltrane. Thompson found herself collaborating again with Fry in 1985, this time in his stage adaptation of the play \"Me and My Girl\" in London's West End, in which she had a leading role, playing Sally Smith. The show was a success and she received favorable reviews, and the strength of her performance led to her casting as the lead in the BBC television miniseries Fortunes of War (1987), in which Thompson and her co-star, Kenneth Branagh, play an English ex-patriate couple living in Eastern Europe as the Second World War erupts. Thompson won a BAFTA award for her work on the program. She married Branagh in 1989, continued to work with him professionally, and formed a production company with him. In the late 80s and early 90s, she starred in a string of well-received and successful television and film productions, most notably her lead role in the Merchant-Ivory production of Howards End (1992), which confirmed her ability to carry a movie on both sides of the Atlantic and appropriately showered her with trans-Atlantic honors - both an Oscar and a BAFTA award. Since then, Thompson has continued to move effortlessly between the art film world and mainstream Hollywood, though even her Hollywood roles tend to be in more up-market productions. She continues to work on television as well, but is generally very selective about which roles she takes. She writes for the screen as well, such as the screenplay for Ang Lee's Sense and Sensibility (1995), in which she also starred as Elinor Dashwood, and the teleplay adaptation of Margaret Edson's acclaimed play Wit (2001), in which she also starred. Thompson is known for her sophisticated, skillful, though her critics say somewhat mannered, performances, and of course for her arch wit, which she is unafraid to point at herself - she is a fearless self-satirist. Thompson and Branagh divorced in 1994, and Thompson is now married to fellow actor Greg Wise, who had played Willoughby in Ang Lee's Sense and Sensibility (1995). Thompson and Wise have one child, Gaia, born in 1999.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNTAyOTg0MF5BMl5BanBnXkFtZTcwNTg0MzY1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000668","name":"Emma Thompson","idIMDB":"nm0000668"},"actorId":"nm0000668","character":"Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Timothée Chalamet","urlProfile":"http://www.imdb.com/name/nm3154303","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4OTMyMjUzM15BMl5BanBnXkFtZTgwMzI0MzQ3NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 11½\" (1.82 m)","bio":"Timothée Chalamet is an actor, known for Interstellar (2014), Men, Women & Children (2014) and Love the Coopers (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4OTMyMjUzM15BMl5BanBnXkFtZTgwMzI0MzQ3NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3154303","name":"Timothée Chalamet","nicknames":["Teemo"],"idIMDB":"nm3154303"},"actorId":"nm3154303","character":"Danny Vance","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Olivia Crocicchia","urlProfile":"http://www.imdb.com/name/nm1478028","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAyNzk1NzQ0NV5BMl5BanBnXkFtZTcwMTk3MTYzNA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Olivia Crocicchia is an actress, known for Palo Alto (2013), Terri (2011) and Men, Women & Children (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAyNzk1NzQ0NV5BMl5BanBnXkFtZTcwMTk3MTYzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1478028","name":"Olivia Crocicchia","idIMDB":"nm1478028"},"actorId":"nm1478028","character":"Hannah Clint","urlCharacter":"http://www.imdb.com/character/ch0499131","main":true},{"actorName":"Kaitlyn Dever","urlProfile":"http://www.imdb.com/name/nm3239803","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MTYzNTk5MV5BMl5BanBnXkFtZTgwMTI5NTkyMDI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 December 1996","placeOfBirth":" Phoenix, Arizona, USA","height":"5' 3\" (1.6 m)","bio":"Having been named one of Variety's 10 Actors to Watch, Kaitlyn Dever has become one of Hollywood's top emerging young actresses. Dever has showcased her versatility, appearing in movies such as Clint Eastwood's J. Edgar, James Ponsoldt's The Spectacular Now, Destin Daniel Cretton's Short Term 12, Jason Reitman's Men, Women & Children and will soon be seen as one of the female leads in Kathryn Bigelow's Untitled Detroit Project. She truly shined in the dark drama Short Term 12 alongside Brie Larson, Keith Stanfield, John Gallagher Jr. and Rami Malek . Short Term 12 premiered at SXSW 2013, where it won the Grand Jury Prize for Best Narrative as well as the Audience Award. Kaitlyn was named Summer 2013's indie \"It\" girl and was highlighted as a SXSW breakout. In addition to her film career, she recently wrapped her memorable 4 season-long arc playing Loretta McCready on the FX drama Justified, for which she received critical acclaim. She also appeared in the award winning video game Uncharted 4: A Thief's End playing Cassie Drake, daughter of the game's lead, Nathan Drake.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MTYzNTk5MV5BMl5BanBnXkFtZTgwMTI5NTkyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3239803","name":"Kaitlyn Dever","idIMDB":"nm3239803"},"actorId":"nm3239803","character":"Brandy Beltmeyer","urlCharacter":"http://www.imdb.com/character/ch0499132","main":true},{"actorName":"Ansel Elgort","urlProfile":"http://www.imdb.com/name/nm5052065","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMzU5MDk0M15BMl5BanBnXkFtZTcwNzk4NzY4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1994","placeOfBirth":" New York City, New York, USA","height":"6' 3\" (1.91 m)","bio":"Ansel Elgort is an American actor, known for playing Augustus Waters in the romance The Fault in Our Stars (2014). Ansel was born in New York City to photographer Arthur Elgort and opera director Grethe Barrett Holby. His father is of Russian Jewish heritage, while his mother has English, German, and Norwegian ancestry. As a child, Ansel tried out for the School of American Ballet, and attended Stagedoor Manor summer camp and Fiorello H. LaGuardia High School. He began his professional acting career on stage, appearing in Matt Charman's play \"Regrets,\" which was performed off-Broadway. Ansel made his film debut in the horror remake Carrie (2013), and co-starred with Shailene Woodley in both the science-fiction tale Divergent (2014) (playing her character's brother) and the romantic drama The Fault in Our Stars (2014) (playing male lead Augustus Waters, who is Woodley's character's love interest). Ansel also had a role in Jason Reitman's drama film Men, Women & Children (2014), and returned for the sequel to Divergent, Insurgent (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMzU5MDk0M15BMl5BanBnXkFtZTcwNzk4NzY4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5052065","name":"Ansel Elgort","idIMDB":"nm5052065"},"actorId":"nm5052065","character":"Tim Mooney","urlCharacter":"http://www.imdb.com/character/ch0444872","main":true},{"actorName":"Katherine Hughes","urlProfile":"http://www.imdb.com/name/nm3675325","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNDg5MTQ4M15BMl5BanBnXkFtZTgwMDU2MzEyMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Katherine Hughes is an actress, known for Me and Earl and the Dying Girl (2015), Men, Women & Children (2014) and Kingdom (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNDg5MTQ4M15BMl5BanBnXkFtZTgwMDU2MzEyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3675325","name":"Katherine Hughes","idIMDB":"nm3675325"},"actorId":"nm3675325","character":"Brooke Benton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elena Kampouris","urlProfile":"http://www.imdb.com/name/nm4502102","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDk1N2U1MzktZmFlOC00NDQxLWExYWMtZWMxYWRmNWU1M2Q4XkEyXkFqcGdeQXVyMjY1NDU4NDc@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1997","placeOfBirth":" New York City, New York, USA","height":"5' 7\" (1.7 m)","bio":"Elena Kampouris was born on September 16, 1997 in New York City, New York, USA. She is an actress, known for My Big Fat Greek Wedding 2 (2016), Men, Women & Children (2014) and Labor Day (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDk1N2U1MzktZmFlOC00NDQxLWExYWMtZWMxYWRmNWU1M2Q4XkEyXkFqcGdeQXVyMjY1NDU4NDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4502102","name":"Elena Kampouris","idIMDB":"nm4502102"},"actorId":"nm4502102","character":"Allison Doss","urlCharacter":"http://www.imdb.com/character/ch0499134","main":true},{"actorName":"Will Peltz","urlProfile":"http://www.imdb.com/name/nm3816797","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NTk3NzkyNV5BMl5BanBnXkFtZTgwOTgyMzYxNzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1986","placeOfBirth":" New York City, New York, USA","height":"6' (1.83 m)","bio":"Will Peltz was born on May 30, 1986 in New York City, New York, USA. He is an actor, known for In Time (2011), Unfriended (2014) and Paranoia (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NTk3NzkyNV5BMl5BanBnXkFtZTgwOTgyMzYxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3816797","name":"Will Peltz","idIMDB":"nm3816797"},"actorId":"nm3816797","character":"Brandon Lender","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Travis Tope","urlProfile":"http://www.imdb.com/name/nm2506621","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTMyMjY5YjQtYTkxYi00MzA0LTgyZGItMGFkNjk1NWJiOGM2XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Travis Tope is an actor, known for Independence Day: Resurgence (2016), Men, Women & Children (2014) and Boardwalk Empire (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTMyMjY5YjQtYTkxYi00MzA0LTgyZGItMGFkNjk1NWJiOGM2XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2506621","name":"Travis Tope","idIMDB":"nm2506621"},"actorId":"nm2506621","character":"Chris Truby","urlCharacter":"http://www.imdb.com/character/ch0499135","main":true},{"actorName":"David Denman","urlProfile":"http://www.imdb.com/name/nm0219292","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDYxMjg1ODU5MV5BMl5BanBnXkFtZTgwMzM2NTYwNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1973","placeOfBirth":" Newport Beach, California, USA","birthName":"David Joseph Lamb","height":"6' 4\" (1.93 m)","bio":"Film, TV and stage actor David Denman was born in the Orange County, California suburb of Newport Beach. Denman grew up all over Southern California and spent some time in Sequim, Washington attending 8 different schools along the way. After becoming involved in high school theatrics at Fountain Valley High School, David attended the American Conservatory Theater Summer Training Congress in San Francisco in 1991. He then went on to receive his B.F.A. degree in Drama in 1997 from the famed Juilliard School in NYC. Denman spent numerous seasons doing summer stock before moving back to Los Angeles to pursue film and television. Upon his arrival he was immediately cast on the hit show ER (1994), which lead to numerous TV shows and movies of the week. He made his feature film debut in the Warner Bros comedy The Replacements (2000) with Gene Hackman and Keanu Reeves. While he had supporting roles in some other major productions, his breakthrough role came as \"Roy\" in The Office (2005). The series went on to receive numerous awards including the S.A.G. award for Outstanding Performance by an Ensemble in a Comedy Series. He went on to star in numerous indie films and play supporting roles in many blockbuster features. He starred in the short-lived but critically acclaimed Traffic Light (2011) for FOX and has recurred on many acclaimed television series such as Parenthood (2010) on NBC. Denman is also an avid Shakespeare buff, having seen the entire canon on stage and has performed in dozens of productions. He continues to return to the stage as often as possible.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDYxMjg1ODU5MV5BMl5BanBnXkFtZTgwMzM2NTYwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0219292","name":"David Denman","idIMDB":"nm0219292"},"actorId":"nm0219292","character":"Jim Vance","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3179568","urlIMDB":"http://www.imdb.com/title/tt3179568","business":{"budget":{"money":"$16,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"16","month":"12","year":"2013","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 59 min (119 min)"],"soundMix":["Dolby Digital","Datasat"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arri Alexa XT Plus, Panavision PVintage Lenses"],"laboratory":["FotoKem Laboratory, Burbank (CA), USA"],"filmLength":["3,272.5 m (7 reels)"],"negativeFormat":["Codex"],"cinematographicProcess":["ARRIRAW (2.8K) (source format)","Digital Intermediate (2K) (master format)"],"printedFilmFormat":["35 mm (spherical) (Kodak Vision 2383)","D-Cinema"]},"rating":"6.7","metascore":"38","filmingLocations":[{"location":"Austin, Texas, USA"}],"rated":"R","awards":[],"votes":"24,468","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"},{"idCompany":"co0280848","name":"Right of Way Films"}],"keywords":{"keywords":["internet","high school","computer","anorexia","video game","domineering mother","facebook","teen angst","window smashing","bully comeuppance","violence","rebellion","depression","suicide attempt","bloody nose","boyfriend girlfriend relationship","fight","face slap","blood","running away from home","masturbation","teenage girl","teenage boy","social commentary","hospital","internet chat","tablet computer","family relationships","ensemble cast","text on screen","cell phone","sexuality","virginity","affair","aspiring actress","overprotective parent","father son relationship","mother daughter relationship","husband wife relationship","social media","sex scene","playing against type"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:38:48"}}