{"data":{"movies":[{"title":"The Good Witch's Wonder","originalTitle":"","year":"2014","releaseDate":"20141025","directors":[{"name":"Craig Pryce","id":"nm0003588"}],"writers":[],"runtime":"84 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MTAxMTk0Nl5BMl5BanBnXkFtZTgwMTA0MTQ5MjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Family","Fantasy"],"plot":"Cassie Nightingale is given little time to plan her stepson Brandon's wedding to Tara. In addition, Martha, Middleton's new mayor, wants Cassie to head a silent auction fundraiser for the Middleton Botanical Gardens. When Audrey arrives in town looking for a job, Cassie hires her to work in her store, Bell, Book & Candle. Audrey even offers to help with the auction. However, Cassie becomes suspicious when items for the auction go missing. She must use her powers, and the help of Martha and husband/police chief Jake, to uncover the truth.","simplePlot":"Cassie looks for a lost/stolen precious family memento.","actors":[{"actorName":"Catherine Bell","urlProfile":"http://www.imdb.com/name/nm0004738","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMTYxMDk0OF5BMl5BanBnXkFtZTYwMjA1MzA2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1968","placeOfBirth":" London, England, UK","birthName":"Catherine Lisa Bell","height":"5' 9\" (1.75 m)","bio":"Catherine was born in London, but moved to California with her Iranian mother at age 2. Her mother still acts as her personal assistant. As a child, she acted in various TV adverts. She went to UCLA to study biology, but dropped out to become a model in Japan. She moved back into acting with a Mexican commercial for Amex and then followed that up by being Isabella Rossellini's nude body double in Death Becomes Her (1992), where she also met her future husband, Adam Beason, who was director Robert Zemeckis's assistant. The couple currently live near L.A. with their daughter Gemma.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMTYxMDk0OF5BMl5BanBnXkFtZTYwMjA1MzA2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004738","name":"Catherine Bell","idIMDB":"nm0004738"},"actorId":"nm0004738","character":"Cassandra Nightingale","urlCharacter":"http://www.imdb.com/character/ch0497027","main":true},{"actorName":"Chris Potter","urlProfile":"http://www.imdb.com/name/nm0693243","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmI3NjMzMTgtZDY2YS00M2I3LWI1YTItMzMyNzI5YjM4YTYzL2ltYWdlXkEyXkFqcGdeQXVyNzMwNzM0NQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 August 1960","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Christopher Jay Potter","height":"6' (1.83 m)","bio":"Chris Potter was born in Toronto, Canada. He grew up in London, Ont. As a child, his parents instilled in him, a love of academics, art and athletics. He was in his 20's before he realized this. His professional acting career began seemingly overnight. He was 'discovered' in an amateur play and swept into the professional world of acting. Grateful for absolutely everything in his life, Chris chose to stay true to what meant most to him when making career decisions. He and his wife,Karen have raised 4 children. Together, they have shared the ups and downs of an unpredictable profession and through it all stayed close to family and friends.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmI3NjMzMTgtZDY2YS00M2I3LWI1YTItMzMyNzI5YjM4YTYzL2ltYWdlXkEyXkFqcGdeQXVyNzMwNzM0NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0693243","name":"Chris Potter","idIMDB":"nm0693243"},"actorId":"nm0693243","character":"Jake Russell","urlCharacter":"http://www.imdb.com/character/ch0155065","main":true},{"actorName":"Catherine Disher","urlProfile":"http://www.imdb.com/name/nm0228324","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwODM3NzQzOF5BMl5BanBnXkFtZTgwMDQ3NzM2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1960","placeOfBirth":" Montréal, Québec, Canada","birthName":"Catherine Wilder Disher","bio":"Born in England and raised in Montreal, Catherine Disher attended Phillips Exeter Academy in New Hampshire and McGill University in Montreal ( as an English Literature Major ) before being accepted by and graduating from one of the most prestigious theatre schools in North America- The National Theatre School of Canada. Ms Disher is best known for her varied work in series television for which she has received seven Gemini Award nominations, the first being for her role in \"Grand Larceny\". She was nominated twice for her role as Natalie Lambert in the cult vampire series \"Forever Knight\". She won the Gemini for best actress in 2004 for her portrayal of volatile federal cabinet minister Audrey Flankman in the CBC series \"Snakes and Ladders\" and won another Gemini in 2010 for best supporting actress for her role as Superintendent Maggie Norton in the CBC drama series \"The Border\". She was nominated three times for the \"Border\"- one nomination for each season of the show. Ms. Disher has also appeared in many television movies in roles as diverse as showgirl Dulcie Dobbs in the period heist \"Grand Larceny\", Betty Fox in \"The Terry Fox Story\" and Chief Catherine Novak in the recent, highly rated Lifetime movie \"An Officer And A Murderer\". Ms Disher has been honored to portray busybody Martha Tinsdale, the doyenne of Middleton society, in the popular Hallmark series of \"Good Witch\" movies. Ms. Disher is also an accomplished voice performer appearing in countless radio dramas, video games ( such as Resident Evil as Jill Valentine ) and cartoons such as X-Men ( as Jean Grey ), Sailor Moon, Care bears, Atomic Betty, Franklin, Babar and as Mom in the Emmy winning Rolie Polie Olie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwODM3NzQzOF5BMl5BanBnXkFtZTgwMDQ3NzM2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0228324","name":"Catherine Disher","nicknames":["The Dish"],"idIMDB":"nm0228324"},"actorId":"nm0228324","character":"Martha Tinsdale","urlCharacter":"http://www.imdb.com/character/ch0172307","main":true},{"actorName":"Matthew Knight","urlProfile":"http://www.imdb.com/name/nm1342743","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0ODc1NzA5Nl5BMl5BanBnXkFtZTYwMjk1Njc2._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 February 1994","placeOfBirth":" Los Angeles, California, USA","bio":"Matthew Knight was born on February 16, 1994 in Los Angeles, California, USA. He is an actor, known for The Grudge 3 (2009), The Grudge 2 (2006) and Ma Babysitter est un Vampire (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0ODc1NzA5Nl5BMl5BanBnXkFtZTYwMjk1Njc2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1342743","name":"Matthew Knight","idIMDB":"nm1342743"},"actorId":"nm1342743","character":"Brandon Russell","urlCharacter":"http://www.imdb.com/character/ch0172312","main":true},{"actorName":"Hannah Endicott-Douglas","urlProfile":"http://www.imdb.com/name/nm1754070","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMjA4MTY0Nl5BMl5BanBnXkFtZTgwNjYwMjA5OTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1994","placeOfBirth":" Toronto, Ontario, Canada","height":"5' 6\" (1.68 m)","bio":"Hannah Endicott-Douglas was born on November 29, 1994 in Toronto, Ontario, Canada. She is an actress, known for Casino Jack (2010), Un soupçon de magie (2008) and The Good Witch's Wonder (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMjA4MTY0Nl5BMl5BanBnXkFtZTgwNjYwMjA5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1754070","name":"Hannah Endicott-Douglas","idIMDB":"nm1754070"},"actorId":"nm1754070","character":"Lori Russell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ashley Leggat","urlProfile":"http://www.imdb.com/name/nm1430154","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MjcxOTc2MF5BMl5BanBnXkFtZTcwNzc1NzEzMQ@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 September 1986","placeOfBirth":" Hamilton, Ontario, Canada","birthName":"Ashley Margaret Anne Leggat","height":"5' 5½\" (1.66 m)","bio":"Ashley Leggat, a twice Gemini nominated actress, was born into a large family in Hamilton, Ontario. She joined her parents, Roy (a car dealer) and Patty (a former Secondary School teacher) and four older brothers -Rob, Brett, and twins Todd and Bram. Ashley's four brothers, all very athletic, played hockey in the winters and baseball in the summers, meaning she basically grew up in arenas and baseball parks. Ashley never actually walked -she danced, so when she was two and a half she started Baby Ballet -and she fell in love. This was the beginning of Ashley's passion for dance. Until she graduated from high school, Ashley danced competitively in the top divisions in tap, jazz, ballet, pointe, acrobatics, lyrical, musical theatre and hip hop. She was crowned the top soloist awards at all of the major dance competitions including, International Dance Challenge, Showstoppers, 5-6-7-8 Showtime, Flash Dance, and Dance, Dance, Dance to name a few. Ashley excelled in all aspects of her dance career, but another passion had already taken her heart. When Ashley was just eight she heard about a summer school acting program at Theatre Aquarius in Hamilton and insisted that she had to attend. Theatre became Ashley's second passion and without hesitation, she auditioned and won the coveted role in her first professional theatrical role of Marta in \"The Sound of Music\". Over the next four years, she managed to combine her school work, 30 hours a week of dancing, and continued her acting career by starring in the following plays: \"Jekyll and Hyde\", \"Jacob Two-Two Meets the Hooded Fang\", \"The Wizard of Oz\", \"Anne of Green Gables\", \"Cinderella\", and \"The Lion, The Witch and The Wardrobe\". When she was age 13, she won the role of Clara in \"The Nutcracker\". That same year, the young theatre veteran began to work in television and movies, and quickly discovered this was her third passion. Her first TV role was to star in \"Real Kids, Real Adventures\". She shone on set and there was no looking back. By the time she was just age 18, she had recurring roles on: \"I was a Sixth Grade Alien\", \"Ace Lightning\", and guest starred in \"The Zack Files\", and \"In A Heartbeat\" (Shawn Ashmore). She appeared in Disney's \"Cadet Kelly\" (Hilary Duff), \"What Girls Learn\", (Elizabeth Perkins), ABC's MOW \"The Music Man\" (Matthew Broderick), and \"A Very Married Christmas\" (Joe Mategna). Next, she hit the big screen with a lead role in \"Confessions of a Teenage Drama Queen\" (Lindsay Lohan and Megan Fox). On her 18th birthday she decided she would put her acting career on hold to attend University in pursuit of a teaching degree, but fate had other plans for her. One week after classes began, she got an offer she couldn't refuse. Ashley had won the sought after lead role of Casey in \"Life With Derek\" and she made the decision to put school on hold. The next four years were an exciting adventure, collaborating with Shaftesbury Productions on this incredibly successful show. \"Life with Derek\" was ultimately sold to Disney and shown in over 100 countries around the world, breaking records on many networks. The success of this show led to a movie called \"Vacation with Derek\"which opened to the highest ratings ever recorded by Family Channel and earned her second Gemini nomination for Best Actress. During breaks from shooting \"Life with Derek\", Ashley was a recurring character on \"Darcy's Wild Life\" (Sara Paxton), a regular on the new genre TV series \"11 Cameras\", and guest starred on \"The Latest Buzz\", \"Aaron Stone\", and \"Unnatural History\". In 2008, a rare opportunity came to this rising star's lap. She was asked to play Baby in \"Dirty Dancing\" at the Royal Alexandra Theatre in Toronto. Although she hadn't been on stage in nearly ten years, she returned with a vengeance and won critical acclaim for her dead on portrayal of Baby. Following a year back in the spotlight of the theatre, she returned to the small screen guest-starring in the popular TV show \"Murdoch Mysteries\". Ashley had a lead role in MTV's \"Made, The Movie\", the feature film \"My Dog's Christmas Miracle\" (Cynthia Gibb) and \"The Perfect Roommate\". She most recently guest starred on one of her favorite prime time shows \"Criminal Minds\". She then went on to join the popular Hallmark movie series \"The Good Witch's Charm\" and the upcoming \"The Good Witch's Destiny\". Next up, Ashley is very excited for the premiere \"The Perfect Boss\" which airs on May 24th on Lifetime. In her personal life, Ashley is heavily involved with children's hospitals, spending her spare time fundraising for McMaster Sick Kids Hospital, Toronto Sick Kids and Manitoba Hospital for Children. She is also a huge advocate for anti-bullying, and has toured across Canada to help the cause. She most enjoys spending time with her family and close friends, and her \"fur-baby\" Teacup Yorkie, Rambo -who has also had cameos in many of her TV shows and movies. As for her love life, Ashley married her long time boyfriend Jeremy Williams in August 2011. Jeremy is a successful hockey player, formerly with the Toronto Maple Leafs, Detroit Red Wings organization, and New York Rangers organization. Most recently he played in Austria and Germany, and this year he will play in Sweden, where Ashley will join him in her off time. They have a daughter together, Olivia Patricia Anne Williams (b. February 17, 2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MjcxOTc2MF5BMl5BanBnXkFtZTcwNzc1NzEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1430154","name":"Ashley Leggat","nicknames":["Ash"],"idIMDB":"nm1430154"},"actorId":"nm1430154","character":"Tara","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter MacNeill","urlProfile":"http://www.imdb.com/name/nm0534132","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDI3ODg5M15BMl5BanBnXkFtZTcwNTQ1MzM3Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' 1¼\" (1.86 m)","bio":"Peter MacNeill was born in New Brunswick, Canada. He is known for his work on A History of Violence (2005), Crash (1996) and Frequency (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDI3ODg5M15BMl5BanBnXkFtZTcwNTQ1MzM3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0534132","name":"Peter MacNeill","idIMDB":"nm0534132"},"actorId":"nm0534132","character":"George O'Hanrahan","urlCharacter":"http://www.imdb.com/character/ch0172309","main":true},{"actorName":"Rachel Wilson","urlProfile":"http://www.imdb.com/name/nm0933987","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjAzODBjMWEtOTQxOS00ZmU0LWI2ZTAtNzY4YTJjMTUwOWU1L2ltYWdlXkEyXkFqcGdeQXVyNjY4NTExNA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1977","placeOfBirth":" Ottawa, Ontario, Canada","bio":"Rachel Wilson was born on May 12, 1977 in Ottawa, Ontario, Canada. She is an actress and producer, known for Austin Powers: The Spy Who Shagged Me (1999), Total Drama (2007) and Breaker High (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjAzODBjMWEtOTQxOS00ZmU0LWI2ZTAtNzY4YTJjMTUwOWU1L2ltYWdlXkEyXkFqcGdeQXVyNjY4NTExNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0933987","name":"Rachel Wilson","idIMDB":"nm0933987"},"actorId":"nm0933987","character":"Audrey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kathleen Laskey","urlProfile":"http://www.imdb.com/name/nm0489632","urlPhoto":"","biography":{"height":"5' 2\" (1.57 m)","bio":"Kathleen Laskey is an actress, known for Check It Out (1985), Les vies rêvées d'Erica Strange (2009) and Georges rétrécit (2000). She is married to Jeff Pustil.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0489632","name":"Kathleen Laskey","idIMDB":"nm0489632"},"actorId":"nm0489632","character":"Beverly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ted Atherton","urlProfile":"http://www.imdb.com/name/nm0040470","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMDA1NDExOV5BMl5BanBnXkFtZTcwOTQzNjAzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1962","placeOfBirth":" Winnipeg, Manitoba, Canada","height":"6' 3\" (1.91 m)","bio":"Ted Atherton's big break came when he was cast as Pan Philips in the CBC TV series \"Nothing Too Good For A Cowboy.\" This series gave him a Gemini Award nomination in 2000,as \"Best Lead in a Continuing Dramatic Role.\" Now Ted is well known by fans everywhere as the sarcastic yet funny F.B.I. Agent Myles Leland III on the Syndicated TV series \"Sue Thomas: F.B.Eye.\" Aside from Ted performing in front of the cameras, another passion of his is performing on stage. He's a well accomplished Shakespearean actor. He's done \"As You Like It\" at the Du Maurier World Stage, \"Much Ado About Nothing\" at the Theater Calgary, \"Richard III\" & \"All Well That Ends Well\" at the Stratford Festival. Other major stage performances by Ted has been in \"Death Of A Salesman\" & \"The Lion King\", at the Royal Alexandra, \"The Cryptogram\", at the Tarragon Theater, \"Hay Fever\" at the Canadian Stage, & \"The Last Comedy\" at the Banff Centre. Ted graduated with honors, receiving a Bachelor's Degree in English & Drama from the University of Toronto. He also completed a 3 year Masters program at the Banff Centre.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMDA1NDExOV5BMl5BanBnXkFtZTcwOTQzNjAzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0040470","name":"Ted Atherton","idIMDB":"nm0040470"},"actorId":"nm0040470","character":"Adam","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"AJ Vaage","urlProfile":"http://www.imdb.com/name/nm3626918","urlPhoto":"","biography":{"bio":"AJ Vaage is an actor and director, known for Split Focus (2010), The Good Witch's Wonder (2014) and Uncommon Enemies (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3626918","name":"AJ Vaage","idIMDB":"nm3626918"},"actorId":"nm3626918","character":"Sean","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael York","urlProfile":"http://www.imdb.com/name/nm5816845","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDIxMzgwNTkxMF5BMl5BanBnXkFtZTgwOTU2NTYzNjE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"bio":"Michael started his film career in Toronto, Canada. Originally studying acting in both high school and college, he then began pursuing writing and directing his own independent films. Some of Michael's hobbies include amateur stand up comedy, mixed martial arts, and surfing. He first realized he wanted to make movies when he would use his G.I. Joe action figures as stand-ins on intricate home sets, giving them different character names, traits and dialects.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDIxMzgwNTkxMF5BMl5BanBnXkFtZTgwOTU2NTYzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5816845","name":"Michael York","idIMDB":"nm5816845"},"actorId":"nm5816845","character":"Waiter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Martin Roach","urlProfile":"http://www.imdb.com/name/nm6883844","urlPhoto":"","biography":{"bio":"Martin Roach is an actor, known for The Good Witch's Wonder (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6883844","name":"Martin Roach","idIMDB":"nm6883844"},"actorId":"nm6883844","character":"My. Tyler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paula Brancati","urlProfile":"http://www.imdb.com/name/nm1273957","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTgyNjE3M15BMl5BanBnXkFtZTcwODcyMzQ5OA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1989","placeOfBirth":"","height":"5' 4\" (1.63 m)","bio":"Paula Brancati is a Canadian actress born in Markham, Ontario on June 6, 1989. During her high school years, Paula studied Improvisation and Musical Theatre with the CharActors Theatre Troupe. She also studied jazz and ballet at the AB Dance School. Her first break into screen acting began in 1999, marking the beginning of a career well over 10 years. Paula is best recognized for her roles on such television series \"Dark Oracle\" (2004-2006), \"Degrassi: The Next Generation\" (2007-2010) and \"Being Erica\" (2009-2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNTgyNjE3M15BMl5BanBnXkFtZTcwODcyMzQ5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1273957","name":"Paula Brancati","idIMDB":"nm1273957"},"actorId":"nm1273957","character":"Ms. Bryson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Noah Cappe","urlProfile":"http://www.imdb.com/name/nm0135471","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyOTkxNjczN15BMl5BanBnXkFtZTcwMDA2NjQ1Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 December 1977","placeOfBirth":" Toronto, Ontario, Canada","bio":"Noah Cappe was born on December 27, 1977 in Toronto, Ontario, Canada. He is an actor, known for Un soupçon de magie (2008), Un mariage féerique (2010) and Baby's First Christmas (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyOTkxNjczN15BMl5BanBnXkFtZTcwMDA2NjQ1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0135471","name":"Noah Cappe","idIMDB":"nm0135471"},"actorId":"nm0135471","character":"Derek Sanders","urlCharacter":"http://www.imdb.com/character/ch0353382","main":true}],"seasons":[],"idIMDB":"tt3197176","urlIMDB":"http://www.imdb.com/title/tt3197176","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 24 min (84 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["16:9 HD"],"camera":["Arri Alexa"],"laboratory":null,"filmLength":null,"negativeFormat":["Digital"],"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.2","filmingLocations":[],"rated":"TV-G","awards":[{"award":"Directors Guild of Canada 2014","titlesAwards":[{"titleAwardOutcome":"Nominated DGC Craft Award","categories":[{"category":"Direction - Television Movie/Mini-Series","names":[{"name":"Craig Pryce","id":"nm0003588","role":null}]},{"category":"Production Design - Television Movie/Mini-Series","names":[{"name":"Marian Wihak","id":"nm0927898","role":null}]},{"category":"Picture Editing - Television Movie/Mini-Series","names":[{"name":"Mark Sanders","id":"nm0002828","role":null}]},{"category":"Sound Editing - Television Movie/Mini-Series","names":[{"name":"Nelson Ferreira","id":"nm0274399","role":null},{"name":"Dashen Naidoo","id":"nm2361971","role":null},{"name":"John Douglas Smith","id":"nm0808798","role":null}]}]}]}],"votes":"589","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0076583","name":"Whizbang Films"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:31:50"}}