{"data":{"movies":[{"title":"Miss Meadows","originalTitle":"","year":"2014","releaseDate":"20141114","directors":[{"name":"Karen Leigh Hopkins","id":"nm0394212"}],"writers":[{"name":"Karen Leigh Hopkins","id":"nm0394212"}],"runtime":"88 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMzQ5Njc5MV5BMl5BanBnXkFtZTgwNDEwNzk3MjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Thriller"],"plot":"Prim schoolteacher Miss Meadows (Katie Holmes) is not entirely what she appears. Well-mannered, sweet, and caring, yes, but underneath the candy-sweet exterior hides the soul of a vigilante, taking it upon herself to right the wrongs in this cruel world by whatever means necessary. Things get complicated, however, when Miss Meadows gets romantically entangled with the town sheriff (James Badge Dale) and her steadfast moral compass is thrown off, begging the question: \"Who is the real Miss Meadows and what is she hiding?\"","simplePlot":"A story centered on a proper elementary school teacher who moonlights as a vigilante.","actors":[{"actorName":"Katie Holmes","urlProfile":"http://www.imdb.com/name/nm0005017","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA2NjY5OTkzNl5BMl5BanBnXkFtZTcwMDE2NTkxNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1978","placeOfBirth":" Toledo, Ohio, USA","birthName":"Kate Noelle Holmes","height":"5' 9\" (1.75 m)","bio":"Born two months premature at four pounds, Kate Noelle Holmes made her first appearance on December 18, 1978, in Toledo, Ohio. She is the daughter of Kathleen Ann (Craft), a philanthropist, and Martin Joseph Holmes, Sr., a lawyer. She is of German, Irish, and English ancestry. Her parents have said that her strong-willed personality is probably from being born premature. Being the youngest in the Holmes clan, completing the family of three other sisters and one brother, Katie was always the baby. As a teenager, she began attending modeling school. When she was sixteen, her teacher invited her to go to a modeling competition with other girls from her class. She competed in the International Modeling and Talent Association by singing, dancing, and reciting a monologue from To Kill a Mockingbird (1962). By the end of that time in New York, Katie won many awards. But she said she didn't want to model because it wasn't challenging enough. So when she was seventeen, Katie went to Los Angeles to audition for movies. Luckily, on her second audition, she was cast in the movie, Ice Storm (1997), directed by Ang Lee. Katie's character was Libbets Casey, a rich New Yorker, who is pursued by two of the main characters. It was a small part, but it marked the beginning of her professional acting career. After the excitement of her first movie, Katie began sending in audition tapes for pilot shows. During that time, she was also starring in her all-girls Catholic high school musical, Damn Yankees, as Lola. After Kevin Williamson received her audition tape for his new show, Dawson's Creek (1998), the producers wanted her to come to Hollywood right away and read live for them. But because they wanted her to come on the opening night for Damn Yankees, Katie had to tell them she couldn't make it. Fortunately, the show's producers wanted her so much for that role, they rescheduled her callback and the result was she got the part as Joey Potter. During her first year with Dawson's Creek (1998), Katie was able to do two movies, Comportements troublants (1998) and Go (1999), and, for the former, she won Best Breakthrough Female Performance in the 1999 MTV Movie Awards. The following year, she starred next to Michael Douglas in Wonder Boys (2000), playing Hannah Green, a published author and a boarder at her teacher's (Douglas) house, who has a crush on him, and tries to seduce him. Her first leading role came in 2002, with Abandon (2002). She played a college student named Katie Burke, who is haunted by the mysterious disappearance of her boyfriend who vanished two years prior. With Dawson's Creek (1998) coming to a close after six years in May of 2003, it was a bittersweet thing for all the cast. Accustomed to being in North Carolina filming ten months out of a year, the cast members now had the opportunity to make more movies. Katie demonstrated this in October, when she had two new movies, Pieces of April (2003) and The Singing Detective (2003), coming out in that month alone. Pieces of April (2003) is a charming Thanksgiving movie about April (Holmes), the black sheep of her family, who wants to give her family the perfect dinner before her mother passes on. The Singing Detective (2003) is a dark musical where the main character (Robert Downey Jr.) is a writer in a hospital for skin conditions who writes a dark world of seduction and murder in his mind. Katie Holmes plays the kind Nurse Mills who tends to his every need. She also gets to lip sync and dance in this movie. In 2004, she starred in the romantic movie First Daughter (2004), in which she played the President's (Michael Keaton) daughter, Samantha, who wants to go to college without any Secret Service tagging along. In 2005, Holmes co-starred in Batman Begins (2005), where she played Rachel Dawes, a childhood sweetheart and love interest to Batman/Bruce Wayne.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA2NjY5OTkzNl5BMl5BanBnXkFtZTcwMDE2NTkxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005017","name":"Katie Holmes","idIMDB":"nm0005017"},"actorId":"nm0005017","character":"Miss Meadows","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Badge Dale","urlProfile":"http://www.imdb.com/name/nm0197647","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNzEyMDkwOV5BMl5BanBnXkFtZTcwNDcxOTAyMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 May 1978","placeOfBirth":" New York City, New York, USA","birthName":"James Badgett Dale","height":"5' 10\" (1.78 m)","bio":"James Badge Dale was born on May 1, 1978 in New York City, New York, USA as James Badgett Dale. He is an actor, known for World War Z (2013), The Departed (2006) and Iron Man 3 (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNzEyMDkwOV5BMl5BanBnXkFtZTcwNDcxOTAyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0197647","name":"James Badge Dale","nicknames":["Badge"],"idIMDB":"nm0197647"},"actorId":"nm0197647","character":"Sheriff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Callan Mulvey","urlProfile":"http://www.imdb.com/name/nm0612534","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MjQ5ODQ4Nl5BMl5BanBnXkFtZTcwNTMyMDA2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 February 1975","placeOfBirth":" Auckland, New Zealand","birthName":"Callan Francis Mulvey","height":"6' 2\" (1.88 m)","bio":"Callan Mulvey (born 24 February 1975) is one of Australia's leading actors. Callan is best known for his leading roles in the television series Rush, Bikie Wars: Brothers in Arms and Underbelly, as well as Darren Ashton's feature film Thunderstruck. Callan first graced Australian screens in the hugely successful series Heartbreak High, as well as Head Start and McLeod's Daughters. Callan, now firmly established internationally, made his American film debut in Katherine Bigelow's Zero Dark Thirty. His additional film credits include Scyllias in 300: Rise of an Empire, Captain America: The Winter Soldier, was part of an all-star ensemble cast for the critically acclaimed film The Turning, as well as starring opposite Katie Holmes in Miss Meadows, and opposite Sullivan Stapleton, Simon Pegg and Teresa Palmer in Kriv Stenders' crime thriller Kill Me Three Times. In 2016 Callan will be seen in Zack Snyder's highly anticipated Batman vs Superman: Dawn of Justice, co-star in Delirium, a thriller produced by Leonardo DiCaprio, as a series regular on the Starz network's television drama series Power, Warner Bros' Warcraft, and Beyond Skyline with Frank Grillo.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MjQ5ODQ4Nl5BMl5BanBnXkFtZTcwNTMyMDA2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0612534","name":"Callan Mulvey","idIMDB":"nm0612534"},"actorId":"nm0612534","character":"Skylar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean Smart","urlProfile":"http://www.imdb.com/name/nm0005443","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjg0MjUxMF5BMl5BanBnXkFtZTcwMTcyNjY0MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 September 1951","placeOfBirth":" Seattle, Washington, USA","birthName":"Jean Elizabeth Smart","height":"5' 10\" (1.78 m)","bio":"Seattle native Jean Smart was born on September 13, 1951. Attending the University of Washington after high school, she received her BA degree in fine arts. Her first professional season was with the Oregon Shakespeare Festival where she performed in \"Much Ado About Nothing,\" among others. During this time she built up a strong resume in regional theater with such companies as the Hartford Stage Company, Pittsburgh Public Theatre, Seattle Repertory Theatre, Alaska Repertory Theatre and Alliance Theatre. Her first significant break came with a starring role in the potent, critically-acclaimed lesbian drama \"Last Summer at Bluefish Cove,\" which earned her an Off-Broadway Drama Desk nomination in 1980. She capped this honor with a Los Angeles Drama Critics award in 1983 when she repeated her triumph on the West Coast. Jean made an auspicious Broadway debut in 1981 playing Marlene Dietrich in \"Piaf\", and it was the subsequent TV taping of that show that brought about Hollywood interest. She struggled for a time in unsuccessful sitcoms (Teachers Only (1982), Reggie (1983) and Maximum Security (1984)) before hitting gold as the feather-brained Charlene Frazier on Designing Women (1986). She met future husband Richard Gilliland on the set of the hit show; he played the recurring role of Annie Potts' boyfriend for a few seasons. Jean and Richard's son Connor was born in 1989. Feeling confined and typecast in light material, Jean left the show in 1991 to branch out and drew major acclaim in such made-for-TV movies as Overkill: The Aileen Wuornos Story (1992). She gave a chilling portrayal as the well-known serial killer more than a decade before Charlize Theron copped an Oscar for her cinematic version. On the other side of the coin, Jean offered gentle, heartfelt performances in such TV films as The Yarn Princess (1994), in which she played a mentally disabled mom, and the TV remake of The Yearling (1994), allowing audiences to rediscover her amazing versatility. On stage she earned a Tony nomination for her delightfully madcap part in the Broadway farce \"The Man Who Came to Dinner\" opposite Nathan Lane, and on TV won bookend Emmy awards for her guest appearances on the sitcom Frasier (1993). Films would never be a reliable venue for Jean, who made her big-screen debut in Flashpoint (1984). She did, however, receive an Independent Spirit Award nomination for her part in Guinevere (1999). Diagnosed with juvenile diabetes at age 13, Jean has played an active part over the years in public awareness.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjg0MjUxMF5BMl5BanBnXkFtZTcwMTcyNjY0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005443","name":"Jean Smart","idIMDB":"nm0005443"},"actorId":"nm0005443","character":"Mother Meadows","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary Kay Place","urlProfile":"http://www.imdb.com/name/nm0005316","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNDk0NzIzOV5BMl5BanBnXkFtZTcwNzQ3MDMzNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1947","placeOfBirth":" Tulsa, Oklahoma, USA","height":"5' 1\" (1.55 m)","bio":"Mary Kay Place was born on September 23, 1947 in Tulsa, Oklahoma, USA. She is an actress and director, known for Mary Hartman, Mary Hartman (1976), Being John Malkovich (1999) and Sweet Home Alabama (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNDk0NzIzOV5BMl5BanBnXkFtZTcwNzQ3MDMzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005316","name":"Mary Kay Place","idIMDB":"nm0005316"},"actorId":"nm0005316","character":"Mrs. Davenport","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ava Kolker","urlProfile":"http://www.imdb.com/name/nm4795991","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzA4NzNhYTktZWZkOS00MmVhLTk0YmUtYTg3YmY4MjZiY2RhL2ltYWdlXkEyXkFqcGdeQXVyMzM4Nzk1Nzk@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"4' 1\" (1.24 m)","bio":"As a California native, Ava Kolker has been acting one way or another from the time she could walk and talk. Her first screen role came on the first season of \"American Horror Story\" at the age of four. Since then, Ava has worked on a lot different movies both indie and studio films, national commercials, a multitude of television shows, including her major guest star recurring role on all three seasons of the Emmy nominated Disney television series, \"Girl Meets World\". Ava's career has been very diverse in the types of roles she has been able to deliver successfully. She has also done some improv on a series of promo spots for Chelsea Lately acting with Chelsea Handler herself and has bantered with Jimmy Kimmel on Jimmy Kimmel Live. Her movie career started when she was cast out of hundreds of children at 5 years old to play a supporting lead as Kate Beckinsale's unhappy daughter, Augie in the drama \"Trials of Cate McCall\". Ava's first comedy role came when she worked on \"Scary Movie 5\" as Lily, which spoofs the horror flick \"Mama\". More recently Ava plays a major supporting role in the horror movie franchise, Insidious 4 due out in 2017. Ava not only does live acting work on film, television, and commercials, but she booked her first voice-over animation role for the feature film, \"Red Shoes and the Seven Dwarfs\". In addition, Ava models fashion by walking runways and even performs musical theatre where she has played roles such as Princess Jasmine in Aladdin, and Corny Collins in Hairspray. She also goes to charity events and gives back as much as she receives especially to animal charities since Ava is an avid dog lover. Ava has been nominated for both the 2016 Young Artist Awards and the Young Entertainer Awards. Ava won Best Actress in the Guest Star category aged 9 and under at the Young Entertainer Awards for her amazingly comedic and dramatic efforts in Disney's 'Girl Meets World'. Ava has a huge fan following over all major social media platforms and over 300,000 followers on Instagram. She does a lot of press interviews too. When not acting, Ava enjoys the outdoors such as playing tennis, hiking, swimming and going to the beach. She continues to grow as an actress without losing the natural spark of a child who loves her life, her pets and her family most of all.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzA4NzNhYTktZWZkOS00MmVhLTk0YmUtYTg3YmY4MjZiY2RhL2ltYWdlXkEyXkFqcGdeQXVyMzM4Nzk1Nzk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4795991","name":"Ava Kolker","idIMDB":"nm4795991"},"actorId":"nm4795991","character":"Heather","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Bishop","urlProfile":"http://www.imdb.com/name/nm1212071","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4Njg3NTQxMF5BMl5BanBnXkFtZTcwNzY5MjM0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Stephen Bishop is an actor, known for Moneyball (2011), Battleship (2012) and The Rundown (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4Njg3NTQxMF5BMl5BanBnXkFtZTcwNzY5MjM0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1212071","name":"Stephen Bishop","idIMDB":"nm1212071"},"actorId":"nm1212071","character":"Lt. Danny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kate Linder","urlProfile":"http://www.imdb.com/name/nm0511721","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MDY1MTQyMF5BMl5BanBnXkFtZTcwMzQyOTU1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 November 1947","placeOfBirth":" Pasadena, California, USA","height":"5' 4\" (1.63 m)","bio":"Kate Linder was born on November 2, 1947 in Pasadena, California, USA. She is an actress and producer, known for Mother's Day (2016), The Young and the Restless (1973) and Miss Meadows (2014). She has been married to Ronald Linder since February 14, 1976.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MDY1MTQyMF5BMl5BanBnXkFtZTcwMzQyOTU1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0511721","name":"Kate Linder","idIMDB":"nm0511721"},"actorId":"nm0511721","character":"Trudy Navis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Landry Hébert","urlProfile":"http://www.imdb.com/name/nm2566469","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMTY1MTMzM15BMl5BanBnXkFtZTcwMzk3NTU1NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1984","placeOfBirth":" New Orleans, Louisiana, USA","height":"5' 11\" (1.8 m)","bio":"James Landry Hébert was born on October 4, 1984 in New Orleans, Louisiana, USA. He is known for his work on Gangster Squad (2013), Looper (2012) and Seven Psychopaths (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMTY1MTMzM15BMl5BanBnXkFtZTcwMzk3NTU1NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2566469","name":"James Landry Hébert","nicknames":["Jamie"],"idIMDB":"nm2566469"},"actorId":"nm2566469","character":"Derek Pierson / Young Man at Weenie Stand","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Keane","urlProfile":"http://www.imdb.com/name/nm0443856","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MTcwNzYyN15BMl5BanBnXkFtZTcwOTY3NzEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 September 1952","placeOfBirth":" Buffalo, New York, USA","bio":"James Keane was born on September 26, 1952 in Buffalo, New York, USA. He is an actor, known for Apocalypse Now (1979), Crazy Heart (2009) and Seabiscuit (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MTcwNzYyN15BMl5BanBnXkFtZTcwOTY3NzEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0443856","name":"James Keane","idIMDB":"nm0443856"},"actorId":"nm0443856","character":"Father Peter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Graham Beckel","urlProfile":"http://www.imdb.com/name/nm0065320","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyODQzODg0N15BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 December 1949","placeOfBirth":" Old Lyme, Connecticut, USA","birthName":"Graham Stuart Beckel","bio":"Graham Beckel was born on December 22, 1949 in Old Lyme, Connecticut, USA as Graham Stuart Beckel. He is an actor and director, known for L.A. Confidential (1997), Brokeback Mountain (2005) and Leaving Las Vegas (1995). He has been married to Elizabeth Briggs Bailey since December 1, 1984.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyODQzODg0N15BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0065320","name":"Graham Beckel","nicknames":["Bud"],"idIMDB":"nm0065320"},"actorId":"nm0065320","character":"Tony Weaver / Driver of Truck","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gregory Allen Smith","urlProfile":"http://www.imdb.com/name/nm6912395","urlPhoto":"","biography":{"bio":"Gregory Allen Smith is an actor, known for Miss Meadows (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6912395","name":"Gregory Allen Smith","idIMDB":"nm6912395"},"actorId":"nm6912395","character":"Willie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anna Moravcik","urlProfile":"http://www.imdb.com/name/nm6001760","urlPhoto":"","biography":{"bio":"Anna Moravcik is an actress, known for Miss Meadows (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6001760","name":"Anna Moravcik","idIMDB":"nm6001760"},"actorId":"nm6001760","character":"Little Miss Meadows","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tyler Corbet","urlProfile":"http://www.imdb.com/name/nm5548780","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0ODA4MDAyNV5BMl5BanBnXkFtZTgwMzUwODQ0MDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Tyler Corbet is an actor, known for Miss Meadows (2014), Instant Mom (2013) and Fresh Off the Boat (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0ODA4MDAyNV5BMl5BanBnXkFtZTgwMzUwODQ0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5548780","name":"Tyler Corbet","idIMDB":"nm5548780"},"actorId":"nm5548780","character":"Gordon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Milly Hopkins","urlProfile":"http://www.imdb.com/name/nm6081081","urlPhoto":"","biography":{"bio":"Milly Hopkins is an actress, known for Miss Meadows (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6081081","name":"Milly Hopkins","idIMDB":"nm6081081"},"actorId":"nm6081081","character":"Sarah","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3128900","urlIMDB":"http://www.imdb.com/title/tt3128900","business":{"budget":{"money":"$3,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 28 min (88 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.7","metascore":"43","filmingLocations":[{"location":"Cleveland, Ohio, USA"}],"rated":"NOT RATED","awards":[{"award":"Oldenburg Film Festival 2014","titlesAwards":[{"titleAwardOutcome":"Nominated German Independence Award - Audience Award","categories":[{"category":"","names":[{"name":"Karen Leigh Hopkins","id":"nm0394212","role":null}]}]}]}],"votes":"5,071","type":"Movie","companyCreditsSimple":[],"keywords":{"keywords":["vigilante","f rated","lingerie slip","child molester","school teacher","elementary school","sheriff","school","bird","bluebird","scene before opening credits","woman kills a man","black comedy","vigilante justice","accordian","framed for murder","planting a gun in someone's hand","planting evidence","fingerprints","baby","shot in the head","shot in the forehead","hit with a lamp","wedding day","talking to the dead","pedophile","murder investigation","police station","finger gun","funeral","wedding","imaginary person","murdered priest","tea set","teapot","basket","wicker basket","loss of mother","dead mother","talking to one's dead mother","knitting","younger version of character","purse","ice cream truck","hopscotch","pregnant woman","pregnancy","flower in hair","delusion","gun shooting","shotgun","gun in mouth","dead body","female killer","tea drinking","shot in the chest","semiautomatic pistol","engagement","fiance fiancee relationship","boyfriend girlfriend relationship","single woman","sex with clothes on","sex scene","kiss","fast food restaurant","lighting a candle in a church","church choir","dancing","repeated flashback","woman shot","bridesmaid","childhood flashback","little boy","date","two word title","book","etiquette","manners","childhood trauma","intergenerational friendship","tap dancer","shot to death","tied to a chair","love","child abduction","facial scar","substitute teacher","blood stain","classic car","woman crying","telephone call","mother daughter relationship","small town","dog","death threat","wedding dress","marriage proposal","picnic","female vigilante","toad","vigilantism","catchphrase","saying goodbye","held at gunpoint","sexual harassment","woman with gun","handbag","shot in the neck","pickup truck","squirrel","deer","church","drive by shooting","flashback","suburb","pistol","policeman","little girl","child molestation","pedophile priest","priest","classroom","female teacher","female protagonist","written by director","title directed by female","tap shoes","death of mother","independent film","character name in title","murder"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 07:50:43"}}