{"data":{"movies":[{"title":"Salomé","originalTitle":"","year":"2013","releaseDate":"20140921","directors":[{"name":"Al Pacino","id":"nm0000199"}],"writers":[{"name":"Oscar Wilde","id":"nm0928492"}],"runtime":"81 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MDUyMDQxM15BMl5BanBnXkFtZTgwMTI0NTM1MTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"The Biblical story of Salome, a girl who agrees to perform the \"dance of the seven veils\" in return for John the Baptist's head on a silver platter.","simplePlot":"The Biblical story of Salome, a girl who agrees to perform the \"dance of the seven veils\" in return for John the Baptist's head on a silver platter.","actors":[{"actorName":"Kevin Anderson","urlProfile":"http://www.imdb.com/name/nm0000754","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MDg1MjA3Ml5BMl5BanBnXkFtZTcwNjIyOTY5Nw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1960","placeOfBirth":" Gurnee, Illinois, USA","height":"5' 10½\" (1.79 m)","bio":"Kevin Anderson was born on January 13, 1960 in Gurnee, Illinois, USA. He is an actor, known for Sleeping with the Enemy (1991), Rising Sun (1993) and Risky Business (1983).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MDg1MjA3Ml5BMl5BanBnXkFtZTcwNjIyOTY5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000754","name":"Kevin Anderson","idIMDB":"nm0000754"},"actorId":"nm0000754","character":"John the Baptist","urlCharacter":"http://www.imdb.com/character/ch0006197","main":true},{"actorName":"Jessica Chastain","urlProfile":"http://www.imdb.com/name/nm1567113","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MDM5NjczOF5BMl5BanBnXkFtZTcwOTY2MDE4OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 March 1977","placeOfBirth":" Sacramento, California, USA","birthName":"Jessica Michelle Chastain","height":"5' 4\" (1.63 m)","bio":"Jessica Michelle Chastain was born in Sacramento, California, and was raised in a middle-class household in a northern California suburb. Her mother, Jerri Chastain, is a vegan chef whose family is originally from Kansas, and her stepfather is a fireman. She discovered dance at the age of nine and was in a dance troupe by age thirteen. She began performing in Shakespearean productions all over the Bay area. An actor in a production of \"Romeo & Juliet\" encouraged her to audition for Juilliard as a drama major. She became a member of \"Crew 32\" with the help of a scholarship from one of the school's famous alumni, Robin Williams. In her last year at Juilliard, she was offered a holding deal with TV writer/producer John Wells and she eventually worked in three of his TV shows. Jessica continues to do theatre, having played in \"The Cherry Orchard\", \"Rodney's Wife\", \"Salome\" and \"Othello\". She spends her time between New York and Los Angeles, working in theater, film and TV. In 2011, she had a prolific year in film. She was nominated for and won a number of awards, including a 2012 Oscar nomination for Best Performance by an Actress in a Supporting Role for The Help (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MDM5NjczOF5BMl5BanBnXkFtZTcwOTY2MDE4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1567113","name":"Jessica Chastain","idIMDB":"nm1567113"},"actorId":"nm1567113","character":"Salome","urlCharacter":"http://www.imdb.com/character/ch0006250","main":true},{"actorName":"Ralph Guzzo","urlProfile":"http://www.imdb.com/name/nm0350155","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYzNzM4Mjg0Ml5BMl5BanBnXkFtZTgwMDQ4MjA0NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Ralph Guzzo is an actor and producer, known for The Rift (2012), Starship: Rising (2014) and Starship: Apocalypse (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYzNzM4Mjg0Ml5BMl5BanBnXkFtZTgwMDQ4MjA0NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0350155","name":"Ralph Guzzo","idIMDB":"nm0350155"},"actorId":"nm0350155","character":"Nazarene / Jewish Leader","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roxanne Hart","urlProfile":"http://www.imdb.com/name/nm0366509","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ0MzM4Mzc0NV5BMl5BanBnXkFtZTcwNjIzNjEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1952","placeOfBirth":" Trenton, New Jersey, USA","height":"5' 8\" (1.73 m)","bio":"Roxanne Hart was born July 27, 1952 in Trenton, New Jersey, to Joan Irene (McKee) and Edward J. Hart, Jr. Her father was a teacher who later became the school principal at Horace Greeley High School in Chappaqua, New York. Roxanne graduated from Greeley in 1969. She appeared in several Broadway productions before she made her film debut performance in The Verdict (1982). She played the part of Sally Doneghy. Since, she made appearances in a number of films, including Once Around (1991) with Holly Hunter, Showtime's made-for-television film Alone (1997) supporting an all-star cast ensemble, including, Hume Cronyn, James Earl Jones, Chris Cooper and Shelley Duvall. And The Good Girl (2002) starring Jennifer Aniston.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ0MzM4Mzc0NV5BMl5BanBnXkFtZTcwNjIzNjEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0366509","name":"Roxanne Hart","idIMDB":"nm0366509"},"actorId":"nm0366509","character":"Herodias","urlCharacter":"http://www.imdb.com/character/ch0027832","main":true},{"actorName":"Al Pacino","urlProfile":"http://www.imdb.com/name/nm0000199","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzg1ODAyNl5BMl5BanBnXkFtZTYwMjAxODQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1940","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Alfredo James Pacino","height":"5' 7\" (1.7 m)","bio":"One of the greatest actors in all of film history, Al Pacino established himself during one of film's greatest decades, the 1970s, and has become an enduring and iconic figure in the world of American movies. Alfredo James Pacino was born on April 25, 1940, in the Bronx, New York, to an Italian-American family. His parents, Rose (Gerardi) and Sal Pacino, divorced when he was young. His mother moved them into his grandparents' house. Pacino found himself often repeating the plots and voices of characters he had seen in the movies, one of his favorite activities. Bored and unmotivated in school, the young Al Pacino found a haven in school plays, and his interest soon blossomed into a full-time career. Starting on the stage, he went through a lengthy period of depression and poverty, sometimes having to borrow bus fare to make it to auditions. He made it into the prestigious Actors Studio in 1966, studying under legendary acting coach Lee Strasberg, creator of the Method Approach that would become the trademark of many 1970s-era actors. After appearing in a string of plays in supporting roles, Pacino finally succeeded with \"The Indian Wants the Bronx\", winning an Obie Award for the 1966-67 season. That was followed by a Tony Award for \"Does the Tiger Wear a Necktie?\". His first feature films made little departure from the gritty realistic stage performances that earned him respect: he played a drug addict in The Panic in Needle Park (1971) after his film debut in Me, Natalie (1969). What came next would change his life forever. The role of Michael Corleone in The Godfather (1972) was one of the most sought-after of the time: Robert Redford, Warren Beatty, Jack Nicholson, Ryan O'Neal, Robert De Niro and a host of others either wanted it or were mentioned for it, but director Francis Ford Coppola had his heart set on the unknown Italian Pacino for the role, although pretty much everyone else--from the studio to the producers to some of the cast members--did not want him. Though Coppola won out through slick persuasion, Pacino was in constant fear of being fired during the hellish shoot. Much to his (and Coppola's) relief, the film was a monster hit that did wonders for everyone's career, including Pacino's, and earned him his first Academy Award nomination for Best Supporting Actor. However, instead of taking on easier projects for the big money he could now command, Pacino threw his support behind what he considered tough but important films, such as the true-life crime drama Serpico (1973) and the tragic real-life bank robbery film Dog Day Afternoon (1975). He opened eyes around the film world for his brave choice of roles, and he was nominated three consecutive years for the \"Best Actor\" Academy Award. He faltered slightly with Bobby Deerfield (1977), but regained his stride with ...and justice for all. (1979), for which he received another Academy Award nomination for Best Actor. Unfortunately, this would signal the beginning of a decline in his career, which produced such critical and commercial flops as Cruising - La Chasse (1980) and Author! Author! (1982). Pacino took on another vicious gangster role and cemented his legendary status in the ultra-violent cult film Scarface (1983)_, but a monumental mistake was about to follow. Revolution (1985) endured an endless and seemingly cursed shoot in which equipment was destroyed, weather was terrible, and Pacino became terribly ill with pneumonia. Constant changes in the script also further derailed a project that seemed doomed from the start anyway. The Revolutionary War film is considered one of the worst films ever, not to mention one of the worst of his career, resulted in his first truly awful reviews and kept him off the screen for the next four years. Returning to the stage, Pacino has done much to give back and contribute to the theatre, which he considers his first love. He directed a film, The Local Stigmatic (1990), but it remains unreleased. He lifted his self-imposed exile with the striking Sea of Love (1989) as a hard-drinking policeman. This marked the second phase of Pacino's career, being the first to feature his now famous dark, owl eyes and hoarse, gravelly voice. Returning to the Corleones, Pacino made The Godfather: Part III (1990) and earned raves for his first comedic role in the colorful Dick Tracy (1990). This earned him another Academy Award nomination for Best Supporting Actor, and two years later he was nominated for Glengarry Glen Ross (1992). He went into romantic mode for Frankie and Johnny (1991). In 1992, he finally won the Academy Award for Best Actor for his amazing performance in Scent of a Woman (1992). A mixture of technical perfection (he plays a blind man) and charisma, the role was tailor-made for him, and remains a classic. The next few years would see Pacino becoming more comfortable with acting and movies as a business, turning out great roles in great films with more frequency and less of the demanding personal involvement of his wilder days. Carlito's Way (1993) proved another gangster classic, as did the epic crime drama Heat (1995) directed by Michael Mann and co-starring Robert De Niro, although they only had a few scenes together. He returned to the director's chair for the highly acclaimed and quirky Shakespeare adaptation Looking for Richard (1996). City Hall (1996), Donnie Brasco (1997) and The Devil's Advocate (1997) all came out in this period. Reteaming with Mann and then Oliver Stone, he gave two commanding performances in The Insider (1999) and Any Given Sunday (1999). In the 2000s, Pacino starred in a number of theatrical blockbusters, including Ocean's Thirteen (2007), but his choice in television roles (the vicious Roy Cohn in HBO's miniseries Angels in America (2003) and his sensitive portrayal of Jack Kevorkian, in the television movie You Don't Know Jack (2010)) are reminiscent of the bolder choices of his early career. Each television project garnered him an Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie. In his personal life, Pacino is one of Hollywood's most enduring and notorious bachelors, having never been married. He has a daughter, Julie Marie, with acting teacher Jan Tarrant, and a new set of twins with longtime girlfriend Beverly D'Angelo. His romantic history includes a long-time romance with \"Godfather\" co-star Diane Keaton. With his intense and gritty performances, Pacino was an original in the acting profession. His Method approach would become the process of many actors throughout time, and his unbeatable number of classic roles has already made him a legend among film buffs and all aspiring actors and directors. His commitment to acting as a profession and his constant screen dominance has established him as one of the movies' true legends. Pacino has never abandoned his love for the theater, and Shakespeare in particular, having directed the Shakespeare adaptation Looking for Richard (1996) and played Shylock in The Merchant of Venice (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzg1ODAyNl5BMl5BanBnXkFtZTYwMjAxODQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000199","name":"Al Pacino","nicknames":["Sonny"],"idIMDB":"nm0000199"},"actorId":"nm0000199","character":"King Herod","urlCharacter":"http://www.imdb.com/character/ch0006200","main":true},{"actorName":"Phillip Rhys","urlProfile":"http://www.imdb.com/name/nm0722632","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQxMDA0Njc3M15BMl5BanBnXkFtZTgwOTA0OTE2ODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 June 1972","placeOfBirth":" London, England, UK","birthName":"Phillip Rhys","height":"6' 1\" (1.85 m)","bio":"Phillip was born in South London, the second of three sons. After graduating from Westminster College he spent a year living and working in Paris. He returned to London to study acting with Marianna Hill at the Lee Strasberg Institute, and later with Jeffrey Tambor and Milton Katselas at the Beverly Hills Playhouse in Los Angeles. Phillip developed his acting talent with a diverse range of roles across film, television and theatre. The British born Rhys starred in the blockbuster drama Survivors (2008), which aired for two seasons on BBC and BBC America. American audiences are familiar with his powerful performances in the Golden Globe winning -Nip/Tuck (2003) as Jude Sawyer, Joely Richardson love interest. Fans of the Emmy winning series 24 (2001) knew Rhys well as Reza Naiyeer. In 2002, Rhys was seen in Flatland (2002) with Dennis Hopper, a 22-episode sci-fi action drama series produced by Oscar winner, Al Ruddy. Other television credits include Bones (2005), NCIS (2003), Glee (2009), CSI: Crime Scene Investigation (2000) and as Ramone in the Doctor Who (2005) Christmas special: The Husbands of River Song. Rhys stars as Pete Drake in the new E4 series Tripped (2015). Alongside his extensive television work, Rhys is familiar to independent film audiences for his work in Salome (2013), starring Al Pacino, who also wrote and directed the film, Punks (2000), produced by music mogul Babyface, Woundings (1998) with Ray Winstone and Guy Pearce, the Sundance hit Kill the Man (1999), co-starring Luke Wilson, Fathers and Sons (2005) directed by Rodrigo García, The Space Between (2010) with Oscar winner Melissa Leo and The Magnificent Eleven (2013), co-written by Irvine Welsh Trainspotting (1996). Rhys also appeared in the wildly successful film The Adventures of Tintin (2011), directed by Steven Spielberg. Early in his career, Phillip achieved cult status as intergalactic rock star Proto Zoa in the hugely popular Zenon: Girl of the 21st Century (1999) series of films from Disney. On stage, he received outstanding reviews for his performance in Dario Fo's The Devil with Boobs and a Drama-Logue Award for his role in the Los Angeles stage production of Come Back to the Five and Dime, Jimmy Dean, Jimmy Dean. Other performances include \"John Buchanan Jr.\" in Tennessee Williams Summer and Smoke and a turn in John Patrick Shanley's The Dreamer Examines His Pillow at Theatre West. Additionally, Rhys has directed several documentary shorts and recently produced and directed his first narrative short film, The Scarecrow (2015). It stars Darren Pettie, Sandra Oh and Sandra Seacat. He is involved in various non-profit organizations including the BAFTA Outreach Program and is an Inner City Shakespeare Advisory Board Member. Phillip is a former member of the alternative rock band Egos Aside. Rhys now lives in London and Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQxMDA0Njc3M15BMl5BanBnXkFtZTgwOTA0OTE2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0722632","name":"Phillip Rhys","idIMDB":"nm0722632"},"actorId":"nm0722632","character":"The Young Syrian / Desert Sequence","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve Roman","urlProfile":"http://www.imdb.com/name/nm2276367","urlPhoto":"","biography":{"dateOfBirth":"12 August 1971","placeOfBirth":" Mountain View, California, USA","birthName":"Stephen M. Roman","height":"6' (1.83 m)","bio":"Steve Roman was born on August 12, 1971 in Mountain View, California, USA as Stephen M. Roman. He is an actor, known for Wilde Salomé (2011), Salomé (2013) and General Hospital (1963).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2276367","name":"Steve Roman","idIMDB":"nm2276367"},"actorId":"nm2276367","character":"Cappadocian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Roseto","urlProfile":"http://www.imdb.com/name/nm0742886","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI2NjY3NTc4MF5BMl5BanBnXkFtZTcwNzU2NDQ0Mg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Joe Roseto is originally from Northport, Long Island. He is a graduate of the NYU, Tisch School of the Arts. While at NYU he studied at the Circle in the Square Theater School and interned at Saturday Night Live. New York theater credits range from \"Tony 'n' Tina's Wedding\" to Shakespeare in the Park. Los Angeles theater credits include \"Salome\" with Al Pacino, directed by Estelle Parsons. Joe Roseto has also performed internationally with the New York-based theater company, The Talking Band, including, \"Partytime\" at the Napoli Scena Internationale in Italy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI2NjY3NTc4MF5BMl5BanBnXkFtZTcwNzU2NDQ0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0742886","name":"Joe Roseto","idIMDB":"nm0742886"},"actorId":"nm0742886","character":"The Young Syrian / Narraboth / Captain of the Guard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Stehlin","urlProfile":"http://www.imdb.com/name/nm0825276","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzkxNjEwMzkxOF5BMl5BanBnXkFtZTgwNTU0NDU5OTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 July 1966","placeOfBirth":" Allentown, Pennsylvania, USA","birthName":"John Anthony Stehlin III","bio":"A descendant of circus trapeze artists, jugglers, and acrobats on one side of his family, and coal miners and minor league ball players on the other side, Stehlin began his career at New York's prestigious Juilliard School, landing a role in Henry VI, Part I with fellow alums Kevin Spacey, Val Kilmer and Mandy Patinkin. After graduation, he joined the New York Shakespeare Festival, acting in dozens of plays including, Richard II,Henry V, Casanova, Julius Caesar, Timon of Athens, Don Juan and Romeo and Juliet, among others. Of his stage work, Stehlin has been a theatre critic darling, often calling him \"one of our very best actors\", \"unpredictable\", \"dangerous\", \"brimming with energy\", \"an electrified presence on the stage.\" Inheriting the circus performer work ethic, Stehlin founded his theatre company Circus Theatricals in 1983. The company's first performance was Chekov's Uncle Vanya in which Stehlin starred opposite Kevin Spacey and Tom Hewitt. Now based out of Los Angeles, Circus Theatricals continues to thrive today, producing classic and new plays to critical acclaim. Stehlin runs the company with his wife and partner Jeannine, an actress/producer he met in 1995. Together, they have produced more than 50 plays in NYC and Los Angeles. Jumping effortlessly from stage to screen, Stehlin's film credits range from the Weinstein Company's wildly popular cult sensation, Boston Strangler: The Untold Story to the thriller tale Blackout Effect alongside Eric Stoltz. Stehlin collaborated with film legend Al Pacino in an unraveling interpretation of Oscar Wilde's once banned and most controversial work in Salomaybe? written and Directed by Pacino. Fall 2010, Stehlin completed filming the role of Marshall Jones in The Chicago 8, directed by Pinchas Perry. The Chicago 8 is based on actual court transcripts of 8 anti-war protesters on trial for conspiring to cause riots at the 1968 Democratic National Convention in Chicago. Constantly lighting up the small screen, Stehlin has guest-starred on countless hit TV series such as Without a Trace, Monk, NCIS., ER, and NYPD Blue. He has also had memorable recurring roles in fan favorites: Buffy the Vampire Slayer, JAG and The Practice.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzkxNjEwMzkxOF5BMl5BanBnXkFtZTgwNTU0NDU5OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0825276","name":"Jack Stehlin","idIMDB":"nm0825276"},"actorId":"nm0825276","character":"Nazarene / Jewish Leader","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3112900","urlIMDB":"http://www.imdb.com/title/tt3112900","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 21 min (81 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.9","filmingLocations":[],"rated":"R","awards":[],"votes":"1,117","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000881","name":"Stonelock Pictures"},{"idCompany":"co0180526","name":"Salome Productions"}],"keywords":{"keywords":["forename as title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 20:12:32"}}