{"data":{"movies":[{"title":"Free Fall","originalTitle":"","year":"2014","releaseDate":"20141017","directors":[{"name":"Malek Akkad","id":"nm0015443"}],"writers":[{"name":"Dwayne Alexander Smith","id":"nm0808051"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MjQ1MDMxNV5BMl5BanBnXkFtZTgwNjAwNTk0MjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Crime","Thriller"],"plot":"When the sudden and shocking death of a coworker sends everyone reeling at Gault Capital, JANE, uncovers a very dangerous secret. Her boss, charismatic billionaire Thaddeus Gault, is suspected of massive financial fraud. An assassin, FRANK, is dispatched to silence her forever. Jane's flight from the office is forestalled when her pursuer shuts down her elevator. Now, trapped and alone, Jane must find a way to escape her steel cage before the killer reaches her. This brooding and relentless thriller plunges our heroine, Jane, into a free fall of betrayal and terror. To survive Jane must find the inner strength and courage to defeat the powers that hold her and her dreams captive by fear.","simplePlot":"An employee, working for Gault Capital in L.A, gets targeted by a ruthless assassin and locked in the elevator after she uncovers a chilling secret.","actors":[{"actorName":"D.B. Sweeney","urlProfile":"http://www.imdb.com/name/nm0000665","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MzUwNjExOV5BMl5BanBnXkFtZTgwNTM3MTA0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 November 1961","placeOfBirth":" Shoreham, Long Island, New York, USA","birthName":"Daniel Bernard Sweeney","height":"6' (1.83 m)","bio":"Daniel Bernard Sweeney was born on November 14, 1961 in Shoreham, Long Island, New York. He got his start in the New York theatre with appearances in dozens of productions including a run on Broadway in \"The Caine Mutiny Court Martial\". He was selected by Francis Ford Coppola to star in the Vietnam era drama Gardens of Stone (1987). This began a string of performances including Shoeless Joe Jackson in Eight Men Out (1988), Dish Boggett in Lonesome Dove (1989), Travis Walton in Fire in the Sky (1993), and as Doug Dorsey the hockey player turned figure skater in the classic romantic comedy The Cutting Edge (1992). His television work includes Strange Luck (1995), C-16: FBI (1997) and Harsh Realm (1999) with appearances in Jericho (2006), Crash (2008), The Event (2010), and the Emmy-winning Miss Rose White (1992). He recently migrated to the other side of the camera to produce, direct and co-write the cult film Two Tickets to Paradise (2006) which won over a dozen awards at major film festivals.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MzUwNjExOV5BMl5BanBnXkFtZTgwNTM3MTA0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000665","name":"D.B. Sweeney","idIMDB":"nm0000665"},"actorId":"nm0000665","character":"Frank","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sarah Butler","urlProfile":"http://www.imdb.com/name/nm1713632","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTVkZDRiZGQtYTExOC00ZDk2LTg4OGEtMjVkZDYzZmM0YmQ3XkEyXkFqcGdeQXVyNTA2MzU4MDY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 February 1985","placeOfBirth":" Tacoma, Washington, USA","height":"5' 6\" (1.68 m)","bio":"A native of Puyallup, Washington, Butler was interested in the arts while growing up. She sang in choirs, entered singing competitions, and performed in high school and community theatre. She relocated to Los Angeles to study theatre at the University of Southern California, and then played Belle, the princess in Beauty and the Beast, for a year and a half at Disneyland. She dropped out of college, focused on finding a talent agent, and began auditioning for work in television and film. Butler guest-starred on the television series CSI: Miami and CSI: NY.She was cast in the film A Couple of White Chicks at the Hair Dresser and the 2008 Syfy TV horror film Flu Bird Horror. She had a role that year on the web series Luke 11:17, directed by Don Stark. She also had a recurring role on the web series I Love Vampires.Butler won the lead in the 2010 rape and revenge thriller, I Spit on Your Grave, a remake of the 1978 cult film of the same title. Although initially put off by the film's nudity and violence, the film's strong character arc and \"feminist edge\" helped convince her to take the role.Butler starred as Jennifer Hills, a novelist who is brutally gang raped while staying at a cabin in the woods; her character then seeks revenge on her rapists. Directed by Steven R. Monroe, the film was released on October 8, 2010. Butler began filming the psychological thriller, The Stranger Within, alongside Estella Warren and William Baldwin in Mallorca, Spain in November 2011. The film was also scheduled to shoot in Copenhagen, Denmark and New York City.She joined the cast of the independent feature Treachery, starring Michael Biehn, which began filming in Los Angeles in June 2012. Butler starred in the 2013 horror film, The Demented, with Michael Welch and Kayla Ewell.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTVkZDRiZGQtYTExOC00ZDk2LTg4OGEtMjVkZDYzZmM0YmQ3XkEyXkFqcGdeQXVyNTA2MzU4MDY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1713632","name":"Sarah Butler","idIMDB":"nm1713632"},"actorId":"nm1713632","character":"Jane Porter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Malcolm McDowell","urlProfile":"http://www.imdb.com/name/nm0000532","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjQxNzczM15BMl5BanBnXkFtZTcwMTg3MTMwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1943","placeOfBirth":" Horsforth, Yorkshire, England, UK","birthName":"Malcolm John Taylor","height":"5' 8½\" (1.74 m)","bio":"Malcolm John Taylor was born on June 13, 1943 in Leeds, England, to working-class parents Edna (McDowell), a hotelier, and Charles Taylor, a publican. His father was an alcoholic. Malcolm hated his parents' ways. His father was keen to send his son to private school to give him a good start in life, so Malcolm was packed off to boarding school at age 11. He attended the Tunbridge Boarding School and the Cannock House School in Eltham, Kent. At school, he was beaten with the slipper or cane every Monday for his wayward behavior. Whilst at school, he decided that he wanted to become an actor; it was also around this time that his love for race cars began. He attended the London Academy of Music and Dramatic Arts (LAMDA) to study acting. Meanwhile, he worked at his parents' pub but lost his job when the pub went bankrupt, his father drinking all the profits. He then had a variety of jobs, from coffee salesman to messenger. His first big-screen role was in Poor Cow (1967), although his two-minute scene was ultimately cut from the completed film. Soon after, he caught the attention of director Lindsay Anderson who cast him in the role of a rebellious student in his film If.... (1968). The film catapulted Malcolm to stardom in Britain but failed everywhere else. He was so enthusiastic about the film's success that he wanted to do another right away. He began writing what would become the semi-autobiographical O Lucky Man! (1973). Meanwhile, he starred as the infamous Alex DeLarge in Stanley Kubrick's controversial A Clockwork Orange (1971), a role that caused him to be typecast as a manic psychopathic villain. In early 1976, he spent nearly a year working on what would later be one of the most infamous films of all time, the semi-pornographic Caligula (1979), financed by Penthouse magazine founder Bob Guccione. Around that time, the British film industry collapsed, forcing him to flee to America to continue working. His first American film was Time After Time (1979). He then did Britannia Hospital (1982), the last part of Lindsay Anderson's working-class trilogy that started with If.... (1968). In the mid-1980s, the years of alcohol and drug abuse, including $1000 a week on cocaine, caught up with him. Years of abuse took its toll on him; his black hairs were now grey. Looking older than he really was, nobody wanted to cast him for playing younger roles. The big roles having dried up, he did many B-rated movies. The 1990s were kinder to him, though. In 1994, he was cast as Dr. Tolian Soran, the man who killed Captain James T. Kirk in Star Trek: Generations (1994). He was back on the track, playing villains again. He played another in the classic BBC miniseries Our Friends in the North (1996). Today, with more than 100 films under his belt, he is one of the greatest actors in America. He still does not have American citizenship, but he likes the no-nonsense American ways. He resides in the northern suburbs of Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjQxNzczM15BMl5BanBnXkFtZTcwMTg3MTMwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000532","name":"Malcolm McDowell","nicknames":["Mick"],"idIMDB":"nm0000532"},"actorId":"nm0000532","character":"Thaddeus Gault","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ian Gomez","urlProfile":"http://www.imdb.com/name/nm0327020","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNTUwNTExMV5BMl5BanBnXkFtZTcwMTEwMjQyNg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 December 1964","placeOfBirth":" New York City, New York, USA","birthName":"Ian Braque Gomez","bio":"Ian Gomez was born on December 27, 1964 in New York City, New York, USA as Ian Braque Gomez. He is an actor, known for Cougar Town (2009), Edtv (1999) and Mariage à la grecque (2002). He has been married to Nia Vardalos since September 5, 1993. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNTUwNTExMV5BMl5BanBnXkFtZTcwMTEwMjQyNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0327020","name":"Ian Gomez","idIMDB":"nm0327020"},"actorId":"nm0327020","character":"Ronald Taft","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adam Tomei","urlProfile":"http://www.imdb.com/name/nm0866608","urlPhoto":"","biography":{"dateOfBirth":"24 October 1967","placeOfBirth":" New York City, New York, USA","birthName":"Adam Jeffrey Tomei","bio":"Adam Tomei was born on October 24, 1967 in New York City, New York, USA as Adam Jeffrey Tomei. He is an actor and producer, known for Flight (2012), The Truman Show (1998) and Independence Day (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0866608","name":"Adam Tomei","idIMDB":"nm0866608"},"actorId":"nm0866608","character":"Robert","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Coley Speaks","urlProfile":"http://www.imdb.com/name/nm2941860","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjM3MTU4ZjYtNGVkMy00YWQ1LWFjMWMtOTdiODRkMjU1N2UyXkEyXkFqcGdeQXVyMTg2NTYzODk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Coley Mustafa Speaks","bio":"Coley Mustafa Speaks is an American actor. Best known for his numerous national commercial campaigns for major brands as well as his menacing roles as \"Keshawn\" in Harry's Law (NBC) opposite Kathy Bates. Coley's breakout role was in Page 36 (HBO). Originally from Booker T. Washington Projects, in Jersey City, NJ, Coley attended Hampton University earning a degree in Marine & Environmental Science. As an undergraduate, he became internationally published for his work in shark behavior while performing in numerous stage, television and film productions. Since relocating to Los Angeles in September 2008, Coley has shared the screen with Academy Award-winning actors and worked with numerous other multi-award winning writers, directors, and producers. He is also the founder of SS3D Fit Club, one of Los Angeles' premiere private training facilities for celebrity entertainers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjM3MTU4ZjYtNGVkMy00YWQ1LWFjMWMtOTdiODRkMjU1N2UyXkEyXkFqcGdeQXVyMTg2NTYzODk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2941860","name":"Coley Speaks","idIMDB":"nm2941860"},"actorId":"nm2941860","character":"Lamont","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thea Rubley","urlProfile":"http://www.imdb.com/name/nm5741057","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MjI1MjA2MV5BMl5BanBnXkFtZTgwNTA1NDI4MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Thea was born in Colorado Springs, Colorado on May 3, 1989. The youngest of five siblings, and the daughter of an opera singer, Thea and her sister, Anna Rubley, began performing at a young age. In order to continue her education in the arts, she enrolled as a BFA Theatre Major at the University of Southern California. She graduated in 2011, and currently lives in Los Angeles, actively pursuing a career in the arts.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MjI1MjA2MV5BMl5BanBnXkFtZTgwNTA1NDI4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5741057","name":"Thea Rubley","idIMDB":"nm5741057"},"actorId":"nm5741057","character":"Colleen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jayson Blair","urlProfile":"http://www.imdb.com/name/nm2172460","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDIxOTQ3OTg3NF5BMl5BanBnXkFtZTgwMzkyNTI2NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jayson Blair is an actor, known for Whiplash (2014), The Hard Times of RJ Berger (2010) and The New Normal (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDIxOTQ3OTg3NF5BMl5BanBnXkFtZTgwMzkyNTI2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2172460","name":"Jayson Blair","idIMDB":"nm2172460"},"actorId":"nm2172460","character":"Ray","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Justin Beahm","urlProfile":"http://www.imdb.com/name/nm4278962","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODM5NzE5NTkzMF5BMl5BanBnXkFtZTgwOTg3MjkwOTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"height":"6' 2\" (1.88 m)","bio":"Justin Beahm is a writer, producer and director whose feature work appears in Fangoria, Delirium, Scream, Famous Monsters of Filmland, and Horrorhound magazines, as well as at ShockTillYouDrop.com. He has produced and directed for Anchor Bay Entertainment, Shout! Factory, Scream Factory, Trancas International, Prescribed Films, and Reverend Entertainment. He helmed the 2012 theatrical re-release of John Carpenter's HALLOWEEN. Justin appears on a number of video commentary tracks, and occasionally appears in front of the camera as well. His newest project is as host of the Justin Beahm Radio Hour podcast.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODM5NzE5NTkzMF5BMl5BanBnXkFtZTgwOTg3MjkwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4278962","name":"Justin Beahm","idIMDB":"nm4278962"},"actorId":"nm4278962","character":"Background","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kristina Klebe","urlProfile":"http://www.imdb.com/name/nm1640351","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMzgwMjcxM15BMl5BanBnXkFtZTcwOTczMjcwNA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 June 1979","placeOfBirth":" New York City, New York, USA","height":"5' 8\" (1.73 m)","bio":"Actor and director, Kristina Klebe was born in New York City in 1985 and raised between NY, Germany, France and Italy. She is the only daughter of two European immigrants making her first generation American. She speaks four languages fluently, though she didn't speak a single word until she was two. Her half German,half Sicilian, honorary French mother was officially knighted in 2015 into the Legion of Honour, the highest French order for military and civil merits, for her 20+ years of exceptional charity work helping French and American children. Her father is an Emmy award nominated documentary producer. Kristina attended an all girls Catholic high school in NYC and split most of her teenage years between playing the piano, horseback riding and taking after school acting classes. She also used to read for the blind. She was accepted early and graduated from Dartmouth College cum laude with a major in Politics and a minor in Theater/Film. She continued her theater studies at the Eugene O'Neill National Theater Institute and recently attended the Grad Film Program at NYU Tisch to get her masters in directing. Although Kristina's acting career started with her first and still greatest love, the theater (she performed on numerous Off-Broadway stages in NYC, including the prestigious Public Theater, Soho Rep and MTC), she is most known for her performance as the sassy, foul-mouthed Lynda in Rob Zombie's 2007 remake of Halloween, which has cemented her as an icon in the horror genre and garnered her a large fan base. In 2013, Kristina received much praise for her depiction of the tough-as-nails psychopath Anika in Zack Parker's TIFF hit Proxy. In December 2015, The New York Times chose her film Dementia, which she also cast, as New York Times Critics Pic of the Week and her performance in the lead role of Michelle was likened to Kathy Bates in Misery. In January 2016, Kristina was nominated as best German actress at the prestigious Jupiter Awards for her performance in Oscar winner Jochen Alexander Freydank's Kafka adaptation Der Bau, starring across from German superstar Axel Prahl. Kristina has managed to work as both a character actor and leading lady in over 50 productions of film and television in both the US and Europe. She has appeared across genres and platforms in horror movies, thrillers, musicals, comedies and numerous procedural dramas, working with the likes of Spike Lee, Kevin Hart, Neil Marshall, Tom DiCillo, Griffin Dunne and Darren Lynn Bousman. She often works with the same directors twice (Milan Todorovic, Mike Mendez, Rob Zombie, Adam Green and Marcos Siega) and has graced the cover of MAXIM (caveat: in Serbia). Kristina's most recent trend is playing kick-ass detectives. Neil Marshall (Constantine, Game of Thrones, Doomsday) first cast her as Detective McNally in his episode of Tales of Halloween (2015 Certified Fresh on Rotten Tomatoes) \"Bad Seed.\" She then played Detective Pierce across from 80s action star Dolph Lundgren in the Mike Mendez helmed Don't Kill It (to be released 2016/2017), and just wrapped the lead detective role, Detective Martin, in Kevin Shulman's Marvista Studios produced amnesia thriller. You can currently see Kristina on the interwebs as the sardonic Doctor in Mortal Kombat's new Beyond Mortal series. As a director, Kristina has produced and been the videographer on shoots in Hawaii, Haiti and Nicaragua as well as NY and LA. She has shot over a dozen open heart surgeries for organizations such as Doctors without Borders, Surgeons of Hope and Open Heart Haiti. Kristina's directorial debut short film \"As Human As Animal\" starring Diamond Dallas Page played in competition at Sitges and was bought by FEARnet. She produced and directed an ad campaign for the vape company Henley and most recently directed a female MMA fight on the phantom camera - part of which was shot as VR and showcased at Sundance 2016 as the first ever 1000fps VR piece. On the side, she has been working with a charity called French-American Aid for Children for over 10 years while also acting as a volunteer and foster parent at Best Friends Animal Society and Much Love Animal Rescue. She was a competitive equestrian for over a decade, including doing three day eventing, and is a certified rescue diver.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMzgwMjcxM15BMl5BanBnXkFtZTcwOTczMjcwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1640351","name":"Kristina Klebe","nicknames":["Wolf Kitten"],"idIMDB":"nm1640351"},"actorId":"nm1640351","character":"Pam","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Leaman","urlProfile":"http://www.imdb.com/name/nm1010351","urlPhoto":"","biography":{"height":"5' 10½\" (1.79 m)","bio":"Bill Leaman is known for his work on Furious 7 (2015), Deepwater (2016) and Indiana Jones and the Kingdom of the Crystal Skull (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1010351","name":"Bill Leaman","idIMDB":"nm1010351"},"actorId":"nm1010351","character":"Mike","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Annie Tedesco","urlProfile":"http://www.imdb.com/name/nm1595204","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MTI0NzY4NV5BMl5BanBnXkFtZTgwMDMzNzcxMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Annie Tedesco is an actress, known for Bella and the Bulldogs (2015), Granite Flats (2013) and Visions (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MTI0NzY4NV5BMl5BanBnXkFtZTgwMDMzNzcxMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1595204","name":"Annie Tedesco","idIMDB":"nm1595204"},"actorId":"nm1595204","character":"Helen","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3259178","urlIMDB":"http://www.imdb.com/title/tt3259178","business":{"budget":{"money":"$1,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.4","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"1,482","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005891","name":"Trancas International Films"},{"idCompany":"co0474118","name":"Stuck Film Group"}],"keywords":{"keywords":["assassin","elevator","fraud","office","trapped","die hard scenario","death of a co worker","co worker","ceo","business executive","security camera","skyscraper","high rise office building","high rise","helicopter","tycoon","murder disguised as suicide","suicide","suicide by jumping","falling to death","falling from height","cctv","security guard","kickboxing","female martial artist","trapped in a building","pistol","promotion","los angeles california","woman in danger","female protagonist","elevator shaft","office worker","office building","two word title","beaten to death","yacht","stuck in elevator","hitman","gun","hospital","cell phone","company","elevator repairman","memory stick"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:48:27"}}