{"data":{"movies":[{"title":"Pan","originalTitle":"","year":"2015","releaseDate":"20151009","directors":[{"name":"Joe Wright","id":"nm0942504"}],"writers":[{"name":"Jason Fuchs","id":"nm0297229"},{"name":"J.M. Barrie","id":"nm0057381"}],"runtime":"111 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk2MDg5MDczMl5BMl5BanBnXkFtZTgwNTE2NjYyNjE@._V1.jpg","countries":["USA","UK","Australia"],"languages":["English"],"genres":["Adventure","Family","Fantasy"],"plot":"12-year-old orphan Peter is spirited away to the magical world of Neverland, where he finds both fun and danger, and ultimately discovers his destiny -- to become the hero who will be forever known as Peter Pan.","simplePlot":"12-year-old orphan Peter is spirited away to the magical world of Neverland, where he finds both fun and danger, and ultimately discovers his destiny -- to become the hero who will be forever known as Peter Pan.","actors":[{"actorName":"Hugh Jackman","urlProfile":"http://www.imdb.com/name/nm0413168","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDExMzIzNjk3Nl5BMl5BanBnXkFtZTcwOTE4NDU5OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 October 1968","placeOfBirth":" Sydney, New South Wales, Australia","birthName":"Hugh Michael Jackman","height":"6' 2½\" (1.89 m)","bio":"Hugh Michael Jackman is an Australian actor, singer, multi-instrumentalist, dancer and producer. Jackman has won international recognition for his roles in major films, notably as superhero, period, and romance characters. He is best known for his long-running role as Wolverine in the X-Men film series, as well as for his lead roles in the romantic-comedy fantasy Kate & Leopold (2001), the action-horror film Van Helsing (2004), the drama The Prestige and The Fountain (2006), the epic historical romantic drama Australia (2008), the film version of Les Misérables (2012), and the thriller Prisoners (2013). His work in Les Misérables earned him his first Academy Award nomination for Best Actor and his first Golden Globe Award for Best Actor - Motion Picture Musical or Comedy in 2013. In Broadway theatre, Jackman won a Tony Award for his role in The Boy from Oz. A four-time host of the Tony Awards themselves, he won an Emmy Award for one of these appearances. Jackman also hosted the 81st Academy Awards on 22 February 2009. Jackman was born in Sydney, New South Wales, to Grace McNeil (Greenwood) and Christopher John Jackman, an accountant. He is the youngest of five children. His parents, both English, moved to Australia shortly before his birth. He also has Greek (from a great-grandfather) and Scottish (from a grandmother) ancestry. Jackman has a communications degree with a journalism major from the University of Technology Sydney. After graduating, he pursued drama at the Western Australian Academy of Performing Arts, immediately after which he was offered a starring role in the ABC-TV prison drama Correlli (1995), opposite his future wife Deborra-Lee Furness. Several TV guest roles followed, as an actor and variety compere. An accomplished singer, Jackman has starred as Gaston in the Australian production of \"Beauty and the Beast.\" He appeared as Joe Gillis in the Australian production of \"Sunset Boulevard.\" In 1998, he was cast as Curly in the Royal National Theatre's production of Trevor Nunn's Oklahoma. Jackman has made two feature films, the second of which, Erskineville Kings (1999), garnered him an Australian Film Institute nomination for Best Actor in 1999. Recently, he won the part of Logan/Wolverine in the Bryan Singer- directed comic-book movie X-Men (2000). In his spare time, Jackman plays piano, golf, and guitar, and likes to windsurf.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDExMzIzNjk3Nl5BMl5BanBnXkFtZTcwOTE4NDU5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0413168","name":"Hugh Jackman","idIMDB":"nm0413168"},"actorId":"nm0413168","character":"Blackbeard","urlCharacter":"http://www.imdb.com/character/ch0043873","main":true},{"actorName":"Levi Miller","urlProfile":"http://www.imdb.com/name/nm5920962","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDg2Mzg2NTMxMF5BMl5BanBnXkFtZTgwNTcxNDE0MDI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 2002","placeOfBirth":" Australia","birthName":"Levi Zane Miller","height":"5' 9\" (1.75 m)","bio":"Levi Miller was born on September 30, 2002 in Australia as Levi Zane Miller. He is an actor, known for Pan (2015), Red Dog: True Blue (2016) and Jasper Jones (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDg2Mzg2NTMxMF5BMl5BanBnXkFtZTgwNTcxNDE0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5920962","name":"Levi Miller","idIMDB":"nm5920962"},"actorId":"nm5920962","character":"Peter","urlCharacter":"http://www.imdb.com/character/ch0417727","main":true},{"actorName":"Garrett Hedlund","urlProfile":"http://www.imdb.com/name/nm1330560","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NDM1NTMwNF5BMl5BanBnXkFtZTYwMTE0NTgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 September 1984","placeOfBirth":" Roseau, Minnesota, USA","birthName":"Garrett John Hedlund","height":"6' 2½\" (1.89 m)","bio":"Born in Roseau, Minnesota, Garrett John Hedlund is the son of Kristi Anne (Yanish) and Robert Martin Hedlund. He has two older siblings, Nathaniel and Amanda. His father is of Swedish descent and his mother is of German and Norwegian ancestry. Garrett spent his early years growing up on a farm in a small town. When he was in the ninth grade, he moved to Scottsdale, Arizona, with his mother, and taking private acting lessons. After graduating from high school, he immediately moved to Los Angeles, California to pursue an acting career. One month later, he would landed the role of Achilles' cousin Patroclus in the major feature Troy (2004) opposite Brad Pitt. His next feature was Friday Night Lights (2004) starring Billy Bob Thornton, in which Garrett played a high school football player. He then landed a starring role opposite Mark Wahlberg in Four Brothers (2005), playing one of four brothers whose mother is murdered. He also starred opposite Jeff Bridges and Olivia Wilde in TRON: Legacy (2010), the long-awaited sequel to the science fiction cult classic TRON (1982).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NDM1NTMwNF5BMl5BanBnXkFtZTYwMTE0NTgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1330560","name":"Garrett Hedlund","idIMDB":"nm1330560"},"actorId":"nm1330560","character":"Hook","urlCharacter":"http://www.imdb.com/character/ch0005356","main":true},{"actorName":"Rooney Mara","urlProfile":"http://www.imdb.com/name/nm1913734","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NDE3MDk1OF5BMl5BanBnXkFtZTcwNjI1MDY0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1985","placeOfBirth":" Bedford, New York, USA","birthName":"Patricia Rooney Mara","height":"5' 3\" (1.6 m)","bio":"Actress and philanthropist Rooney Mara was born on April 17, 1985 in Bedford, New York. She made her screen debut in the slasher film Urban Legends: Bloody Mary (2005), went on to have a supporting role in the independent coming-of-age drama Tanner Hall (2009), and has since starred in the horror remake A Nightmare on Elm Street (2010), the biographical drama The Social Network (2010), the thriller remake The Girl with the Dragon Tattoo (2011), and the romantic drama Carol (2015). Patricia Rooney Mara is one of four children of Kathleen McNulty (née Rooney) and NFL football team New York Giants executive Timothy Christopher Mara. Her grandfathers were Wellington Mara, co-owner of the Giants, and Timothy Rooney, owner of Yonkers Raceway, and her grand-uncle is Steelers Chairman Dan Rooney, the former Ambassador to Ireland. She is the great-granddaughter of Art Rooney, the founder of the Pittsburgh Steelers football franchise. Her father has Irish, German, and French-Canadian ancestry, and her mother is of Irish and Italian descent. After graduating from Bedford's Fox Lane High School, she went to Ecuador, Peru and Bolivia in South America for four months as part of the Traveling School, an open learning environment. She attended George Washington University for a year and then transferred to New York University, where she studied international social policy psychology and nonprofits. She took her degree from New York University in 2010. Her studies focused on non-profit organizations, as her family has a tradition of involvement in philanthropic causes. She had thought of acting after watching old movies and attending musical theater, but did not think of it as a serious vocation and was afraid she might fail at this. As a result of her reservations, she appeared in only one play while in high school. She began seriously focusing on acting when she was at New York University, appearing in student films. Inspired by her older sister, actress Kate Mara, she began to pursue the craft, auditioning for acting jobs at age 19. She appeared with her sister Kate in the video horror movie Urban Legends: Bloody Mary (2005), billing herself as \"Patricia Mara\". As \"Tricia Mara\", she had guest roles on television and won her first lead in the movie Tanner Hall (2009), which was shot in the fall of 2007. She originally auditioned for the supporting role of Lucasta in \"Tanner Hall\", a $3-million independent film, but director Tatiana von Furstenberg was so impressed by the young actress, she had her return to audition for the lead role of Fernanda, which Mara won. Furstenberg was delighted with her nuanced performance, saying, \"Still waters run deep\". Continuing to call herself Tricia Mara, this was during the making of \"Tanner Hall\" that she considered changing her professional name to Rooney Mara, soliciting the advice of the cast and crew. After premiering at the 2009 Toronto International Film Festival, her performance in \"Tanner Hall\" brought the rechristened Rooney Mara a \"Rising Star\" award at the 2009 Hamptons Film Festival and a \"Stargazer Award\" at the 2010 Gen Art Film Festival. She received her first lead role in a major feature, in the $35 million remake A Nightmare on Elm Street (2010). The movie proved disappointing at the box office, grossing only $63 million domestically and racking up a worldwide gross of just under $116 million. However, she was noticed by critics in the small but pivotal role of the Boston University undergrad Erica Albright who dumps Facebook founder Mark Zuckerberg in The Social Network (2010). Director David Fincher subsequently cast her as the lead, Lisbeth Salander, in his thriller remake, The Girl with the Dragon Tattoo (2011), based on Stieg Larsson's Millennium book series. She received critical acclaim for her performance, and was nominated for an Academy Award for Best Actress and a Golden Globe Award for Best Actress in a Motion Picture - Drama. She starred in the thriller film Side Effects (2013), the independent drama Ain't Them Bodies Saints (2013), and the acclaimed sci-fi romantic drama Her (2013). The following year, she starred in the adventure drama Trash (2014). She garnered further critical acclaim for her performance in Todd Haynes' romantic drama Carol (2015), for which she won the Best Actress Award at the 2015 Cannes Film Festival, and was nominated for the Golden Globe Award for Best Actress in a Motion Picture - Drama and the SAG, BAFTA, and Academy Award for Best Supporting Actress. In the spirit of her family's philanthropic endeavors, Rooney created Faces of Kibera, a charity that provides food, medical care and housing to orphans in Nairobi, Kenya's Kibra district, a small slum that houses a million people. There are many orphans as AIDS is rampant in the slum.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NDE3MDk1OF5BMl5BanBnXkFtZTcwNjI1MDY0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1913734","name":"Rooney Mara","idIMDB":"nm1913734"},"actorId":"nm1913734","character":"Tiger Lily","urlCharacter":"http://www.imdb.com/character/ch0005375","main":true},{"actorName":"Adeel Akhtar","urlProfile":"http://www.imdb.com/name/nm2253821","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzODE2NTM5MF5BMl5BanBnXkFtZTgwMTMyNzMwNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Adeel Akhtar is an actor, known for The Dictator (2012), Four Lions (2010) and Pan (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzODE2NTM5MF5BMl5BanBnXkFtZTgwMTMyNzMwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2253821","name":"Adeel Akhtar","idIMDB":"nm2253821"},"actorId":"nm2253821","character":"Sam Smiegel","urlCharacter":"http://www.imdb.com/character/ch0005359","main":true},{"actorName":"Nonso Anozie","urlProfile":"http://www.imdb.com/name/nm1996829","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNTQwODY0MF5BMl5BanBnXkFtZTgwNjA3NTc1MDE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1979","placeOfBirth":" London, England, UK","height":"6' 6\" (1.98 m)","bio":"Nonso Anozie was born on May 28, 1979 in London, England. He is an actor, known for The Grey (2011), Cinderella (2015) and Atonement (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNTQwODY0MF5BMl5BanBnXkFtZTgwNjA3NTc1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1996829","name":"Nonso Anozie","idIMDB":"nm1996829"},"actorId":"nm1996829","character":"Bishop","urlCharacter":"http://www.imdb.com/character/ch0016650","main":true},{"actorName":"Amanda Seyfried","urlProfile":"http://www.imdb.com/name/nm1086543","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjUyODkwODUyMF5BMl5BanBnXkFtZTcwMzU3MjYxMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1985","placeOfBirth":" Allentown, Pennsylvania, USA","birthName":"Amanda Michelle Seyfried","height":"5' 2½\" (1.59 m)","bio":"Amanda Seyfried was born and raised in Allentown, Pennsylvania, to Ann (Sander), an occupational therapist, and Jack Seyfried, a pharmacist. She is of German, and some English and Scottish, ancestry. She began modeling when she was eleven, and acted in high school productions as well as taking singing lessons. She landed a recurring role in the long-running soap opera As the World Turns (1956) when she was just age 15. More soap work followed as she completed her schooling and had already secured a place at Fordham University when she was offered a role in the Tina Fey-penned teen comedy Mean Girls (2004). She deferred her university education to complete the film. More television work followed, raising her profile across America, while her appearances in Mamma Mia! (2008) and Red Riding Hood (2011) helped establish her international fame.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjUyODkwODUyMF5BMl5BanBnXkFtZTcwMzU3MjYxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1086543","name":"Amanda Seyfried","idIMDB":"nm1086543"},"actorId":"nm1086543","character":"Mary","urlCharacter":"http://www.imdb.com/character/ch0492678","main":true},{"actorName":"Kathy Burke","urlProfile":"http://www.imdb.com/name/nm0121755","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NjQ5NjQ0OF5BMl5BanBnXkFtZTcwMzg0MzExNw@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1964","placeOfBirth":" Camden, London, England, UK","birthName":"Katherine Lucy Bridget Burke","height":"5' 3\" (1.6 m)","bio":"Ms. Burke was born in Camden, London in 1964 at the Royal Free Hospital. Kathy's mother died when she was a baby and she was in foster homes for a short time until her father, who was a heavy drinker, could regain custody of Kathy and live with her two brothers. Kathy attended the Maria Fidelis Secondary School in Euston. She was encouraged to act at school and enrolled at the famous Anna Scher Theatre School in Islington. When Kathy was 17 years old, she was spotted by film director Mai Zetterling who was looking for young actresses to appear in the film Scrubbers (1982). At 22, Kathy wrote her first play \"Mr Thomas\". She directed it at the \"Old Red Lion\" and Ray Winstone appeared in the title role. Kathy is keenly interested in art and books and she collects first editions. She now lives in Highbury, London near Arsenal football ground.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NjQ5NjQ0OF5BMl5BanBnXkFtZTcwMzg0MzExNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0121755","name":"Kathy Burke","nicknames":["Kath"],"idIMDB":"nm0121755"},"actorId":"nm0121755","character":"Mother Barnabas","urlCharacter":"http://www.imdb.com/character/ch0502435","main":true},{"actorName":"Lewis MacDougall","urlProfile":"http://www.imdb.com/name/nm6484968","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExOTI4NDY5NzZeQTJeQWpwZ15BbWU4MDc2MzU3MDAy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 June 2002","placeOfBirth":" Edinburgh, Scotland, UK","bio":"Lewis MacDougall was born on June 5, 2002 in Edinburgh, Scotland. He is an actor, known for A Monster Calls (2016), Pan (2015) and Boundaries (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExOTI4NDY5NzZeQTJeQWpwZ15BbWU4MDc2MzU3MDAy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm6484968","name":"Lewis MacDougall","idIMDB":"nm6484968"},"actorId":"nm6484968","character":"Nibs","urlCharacter":"http://www.imdb.com/character/ch0005368","main":true},{"actorName":"Cara Delevingne","urlProfile":"http://www.imdb.com/name/nm5353321","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTg1MjAyMV5BMl5BanBnXkFtZTgwNDQ0MzY1ODE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 August 1992","placeOfBirth":" London, England, UK","height":"5' 8\" (1.73 m)","bio":"Cara Jocelyn Delevingne was born in London, England, to Pandora Anne (Stevens) and Charles Hamar Delevingne, a property developer. Her parents are both from prominent upper-class families, with her ancestors including Viscounts (Greenwood), Baronets (Hulton, Faudel-Phillips), Majors and Lord Mayors of London. Delevigne is a fashion model, and the face of Burberry's Beauty campaign. She was previously the face of Burberry's spring/summer 2012 campaign and spring/summer 2011 campaign. She has been featured in advertising campaigns for other brands including H&M, Zara and Chanel. She also appeared on the catwalk for brands such as Moschino, Jason Wu, Oscar de la Renta, Burberry, Dolce & Gabbana, Fendi and Stella McCartney. Delevigne was on the covers of Vogue UK, Vogue Korea, i-D, Love, Russh, Jalouse and Style.com's Spring 2013 issue. She also walked down the catwalk as a model at the 2012 Victoria's Secret fashion show. Delevigne is ranked #17 on models.com's 50 Top Models (2013). She also won Model Of The Year 2012 at the British Fashion Awards.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTg1MjAyMV5BMl5BanBnXkFtZTgwNDQ0MzY1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5353321","name":"Cara Delevingne","idIMDB":"nm5353321"},"actorId":"nm5353321","character":"Mermaids","urlCharacter":"http://www.imdb.com/character/ch0208238","main":true},{"actorName":"Tae-joo Na","urlProfile":"http://www.imdb.com/name/nm5173289","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYwNzY4MjQ3NF5BMl5BanBnXkFtZTgwMDE3MTQ1MjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Tae-joo Na is an actor, known for Pan (2015), The Kick (2011) and Hi-eo-ro (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYwNzY4MjQ3NF5BMl5BanBnXkFtZTgwMDE3MTQ1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5173289","name":"Tae-joo Na","idIMDB":"nm5173289"},"actorId":"nm5173289","character":"Kwahu","urlCharacter":"http://www.imdb.com/character/ch0558909","main":true},{"actorName":"Jack Charles","urlProfile":"http://www.imdb.com/name/nm0153048","urlPhoto":"","biography":{"dateOfBirth":"5 September 1943","placeOfBirth":" Cummeragunja, Australia","height":"5' 1\" (1.55 m)","bio":"Jack Charles was born on September 5, 1943 in Cummeragunja, Australia. He is an actor, known for Pan (2015), Mystery Road (2013) and The Last Supper (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0153048","name":"Jack Charles","idIMDB":"nm0153048"},"actorId":"nm0153048","character":"Chief","urlCharacter":"http://www.imdb.com/character/ch0179306","main":true},{"actorName":"Bronson Webb","urlProfile":"http://www.imdb.com/name/nm0916037","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTI4NjE1MV5BMl5BanBnXkFtZTcwMDA1NDg1OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1983","placeOfBirth":" London, England, UK","birthName":"Bronson John Webb","bio":"Bronson Webb was born on February 20, 1983 in London, England as Bronson John Webb. He is an actor, known for The Dark Knight (2008), Kingdom of Heaven (2005) and Pirates of the Caribbean: On Stranger Tides (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTI4NjE1MV5BMl5BanBnXkFtZTcwMDA1NDg1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0916037","name":"Bronson Webb","idIMDB":"nm0916037"},"actorId":"nm0916037","character":"Steps","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Shepherd","urlProfile":"http://www.imdb.com/name/nm4054611","urlPhoto":"","biography":{"bio":"Mike Shepherd is an actor, known for Anna Karenina (2012), Pan (2015) and Agatha Christie's Marple (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm4054611","name":"Mike Shepherd","idIMDB":"nm4054611"},"actorId":"nm4054611","character":"Fernley Trebilcock","urlCharacter":"http://www.imdb.com/character/ch0558910","main":true},{"actorName":"Brian Bovell","urlProfile":"http://www.imdb.com/name/nm0100598","urlPhoto":"","biography":{"dateOfBirth":"26 October 1959","placeOfBirth":" London, England, UK","bio":"Brian Bovell was born on October 26, 1959 in London, England. He is an actor, known for Love Actually (2003), Hollyoaks (1995) and Secrets & Lies (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0100598","name":"Brian Bovell","idIMDB":"nm0100598"},"actorId":"nm0100598","character":"Long John Standing","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3332064","urlIMDB":"http://www.imdb.com/title/tt3332064","business":{"budget":{"money":"$150,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$15,315,435","country":"USA","day":"11","month":"10","year":"2015","remarks":"3,515 Screens"}],"gross":[{"money":"$34,964,818","country":"USA","day":"20","month":"12","year":"2015","remarks":""},{"money":"$34,879,080","country":"USA","day":"13","month":"12","year":"2015","remarks":""},{"money":"$34,727,312","country":"USA","day":"06","month":"12","year":"2015","remarks":""},{"money":"$34,526,664","country":"USA","day":"29","month":"11","year":"2015","remarks":""},{"money":"$34,012,065","country":"USA","day":"22","month":"11","year":"2015","remarks":""},{"money":"$33,600,184","country":"USA","day":"15","month":"11","year":"2015","remarks":""},{"money":"$32,942,691","country":"USA","day":"08","month":"11","year":"2015","remarks":""},{"money":"$15,315,435","country":"USA","day":"11","month":"10","year":"2015","remarks":""}],"weekendGross":[{"money":"$49,064","country":"USA","day":"20","month":"12","year":"2015","remarks":"153 Screens"},{"money":"$107,336","country":"USA","day":"13","month":"12","year":"2015","remarks":"202 Screens"},{"money":"$142,935","country":"USA","day":"06","month":"12","year":"2015","remarks":"240 Screens"},{"money":"$295,526","country":"USA","day":"29","month":"11","year":"2015","remarks":"288 Screens"},{"money":"$325,111","country":"USA","day":"22","month":"11","year":"2015","remarks":"365 Screens"},{"money":"$369,044","country":"USA","day":"15","month":"11","year":"2015","remarks":"363 Screens"},{"money":"$571,341","country":"USA","day":"08","month":"11","year":"2015","remarks":"508 Screens"},{"money":"$15,315,435","country":"USA","day":"11","month":"10","year":"2015","remarks":"3,515 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 51 min (111 min)"],"soundMix":["Datasat","Dolby Digital","Dolby Atmos"],"color":["Color (ACES)"],"aspectRatio":["2.35 : 1"],"camera":["Arri Alexa XT, Panavision C-, E-, G-Series, PVintage, ATZ and AWZ2 Lenses","Phantom Flex (some shots)","Red Epic, Panavision C-, E-, G-Series, PVintage, ATZ and AWZ2 Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["Codex","Redcode RAW"],"cinematographicProcess":["ARRIRAW (3.4K) (source format)","Digital Intermediate (2K) (master format)","Panavision (anamorphic) (source format)","Redcode RAW (5K) (source format)"],"printedFilmFormat":["35 mm (Kodak Vision 2383)","D-Cinema (also 3-D version)"]},"rating":"5.8","metascore":"36","filmingLocations":[{"location":"Leavesden Studios, Leavesden, Hertfordshire, England, UK"}],"rated":"PG","awards":[{"award":"Camerimage 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Jury Award","categories":[{"category":"Best 3D Film","names":[{"name":"John Mathieson","id":"nm0558822","role":null},{"name":"Seamus McGarvey","id":"nm0568974","role":null}]}]}]},{"award":"Ivor Novello Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Ivor Novello Award","categories":[{"category":"Best Original Film Score","names":[{"name":"John Powell","id":"nm0694173","role":null}]}]}]},{"award":"Razzie Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Supporting Actress","names":[{"name":"Rooney Mara","id":"nm1913734","role":null}]},{"category":"Worst Supporting Actress","names":[{"name":"Amanda Seyfried","id":"nm1086543","role":null},{"name":"Love the Coopers","id":"tt2279339","role":null}]}]}]},{"award":"Young Artist Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in a Feature Film - Leading Young Actor (11 - 13)","names":[{"name":"Levi Miller","id":"nm5920962","role":null}]}]}]},{"award":"Young Entertainer Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated Young Entertainer Award","categories":[{"category":"Best Leading Young Actor- Feature Film","names":[{"name":"Levi Miller","id":"nm5920962","role":null}]}]}]}],"votes":"47,032","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0449458","name":"RatPac-Dune Entertainment"},{"idCompany":"co0330789","name":"Berlanti Productions"}],"keywords":{"keywords":["orphan","child hero","1940s","reference to peter pan","fantasy world","journey","kicked in the butt","destiny","hero","use of bloody as epithet","tiger lily","flash forward","voice over narration","comeuppance","hope","flagpole","falling to death","tinker bell","vision","river","princess","kingdom","death","murder","fugitive","eccentric","white makeup","rope","tree","heroism","warrior","violence","campfire","statue","tied up","character's point of view camera shot","subjective camera","stabbed in the head","spear","cowboy hat","face slap","pendant","nest","animal attack","shipwreck","spyglass","crash landing","guard","knocked out","absurdism","jolly roger","flag","cable car","jailbreak","threatened with a knife","knife","fish out of water","fear","mountain","on the run","search","flashlight","trampoline","tribal leader","tribe","betrayal","deception","hit with a shovel","pickaxe","slave labor","child slave","child slavery","slave","slavery","ship","totem","magic","falling from height","jumping from height","forest","woods","jail cell","explosive","hole in floor","booby trap","baby","henchman","eaten alive","outer space","zero gravity","captain","ship captain","key","illiteracy","near death experience","revenge","irish","hidden room","cellar","boat","cave","crystal","falling through the floor","torch","nun","immortality","bald man","evil man","insurrection","good versus evil","animated sequence","slapstick comedy","training","courage","bravery","fart joke","reluctant hero","child's point of view","anachronism","child in peril","cockney accent","american abroad","comic relief","escape","rescue","held at gunpoint","hostage","underwater scene","chase","subterranean","hanging upside down","surrealism","alternate world","giant","creature","giant animal","giant creature","skeleton","alligator","flying fish","giant bird","steampunk","sword and fantasy","exploding body","exploding airplane","explosion","flying ship","fighter pilot","fighter plane","blimp","1930s","prologue","map","dogfight","fighting in the air","aerial battle","royal air force","combat","battle","attack","ambush","air strike","bomb","chosen one","faith","prophecy","origin of hero","christ allegory","fictional war","social commentary","warrior race","axe fight","fire","pistol","gun","axe","sword","man fights a woman","woman punches a man","woman fights a man","slow motion scene","dual wield","stylized violence","hand to hand combat","mixed martial arts","martial arts","brawl","flamethrower","air battle","punched in the chest","punched in the face","kicked in the face","kicked in the stomach","humor","female fighter","female warrior","tough girl","action heroine","3 dimensional","3d","no opening credits","air raid","battlefield","mine","mining","adventure hero","miner","walking the plank","sword duel","flying boy","child protagonist","showdown","pirate captain","never neverland","kidnapping","musical number","cannonball","cannon","reference to nirvana","fistfight","fight","gangplank","attempted murder","mermaid","sword fight","friendship","boy crying","crying boy","letter","mother son relationship","coming of age","flirting","swashbuckler","world war two","london england","flying boat","delayed gravity","native american","blackbeard","pirate","pirate ship","fairy","boy","children","flying","crocodile","captain hook","orphanage","based on novel","surprise ending","altered version of studio logo","character repeating someone else's dialogue","martial artist","one word title","prequel","title spoken by character","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 18:27:35"}}