{"data":{"movies":[{"title":"Entertainment","originalTitle":"","year":"2015","releaseDate":"20151113","directors":[{"name":"Rick Alverson","id":"nm3687830"}],"writers":[{"name":"Rick Alverson","id":"nm3687830"},{"name":"Gregg Turkington","id":"nm0877203"}],"runtime":"103 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5OTEyMTQwODFeQTJeQWpwZ15BbWU4MDA0MzMyNDYx._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Drama"],"plot":"En route to meet his estranged daughter and attempting to revive his dwindling career, a broken, middle-aged comedian plays a string of dead-end shows in the Mojave desert.","simplePlot":"En route to meet his estranged daughter and attempting to revive his dwindling career, a broken, middle-aged comedian plays a string of dead-end shows in the Mojave desert.","actors":[{"actorName":"Gregg Turkington","urlProfile":"http://www.imdb.com/name/nm0877203","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU5NDU5NjI0Ml5BMl5BanBnXkFtZTgwNzYzNzE0NjE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 November 1967","placeOfBirth":" Darwin, Australia","bio":"Gregg Turkington was born in Darwin, Australia in 1967, of American parents, and grew up in Arizona and California, founding the independent record label Amarillo Records in San Francisco in the 1990s. As the stand-up comic character Neil Hamburger, he has repeatedly headlined nightclub worldwide since 1999, as well being selected as the support act on national and international tours by Faith No More, Puscifer, and Tenacious D. He has worked doing voice overs for cartoons produced for Disney, The Cartoon Network, and Nickelodeon, including the character \"Toby Determined' on _Gravity Falls (TV Series 2012-)_. After his breakthrough film role in Rick Alverson's The Comedy (2012), he reunited with frequent collaborator Tim Heidecker and director Rick Alverson to write and star in the feature film drama Entertainment (2015), which premiered at Sundance. That same year he appeared as the sad-sack Baskin-Robbins manager Dale in Marvel's Ant-Man (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU5NDU5NjI0Ml5BMl5BanBnXkFtZTgwNzYzNzE0NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0877203","name":"Gregg Turkington","idIMDB":"nm0877203"},"actorId":"nm0877203","character":"The Comedian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John C. Reilly","urlProfile":"http://www.imdb.com/name/nm0000604","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDEzMDkzOF5BMl5BanBnXkFtZTYwNzQzNzcy._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1965","placeOfBirth":" Chicago, Illinois, USA","birthName":"John Christopher Reilly","height":"6' 2\" (1.88 m)","bio":"Character actor, dramatic leading man, or hilarious comic foil? With an astonishing range of roles already under his belt, John C. Reilly has played an eclectic host of rich characters to great effect over the years, from seedy ne'er-do-wells, to lovable, good-natured schlepps. The fifth of six children, John Christopher Reilly was born in Chicago, to a father of mostly Irish descent, and a Lithuanian-American mother, and was brought up on Chicago's tough Southwest territory. His father, also named John, ran an industrial linen supply company business. On the amateur stage from age eight, Reilly trained at the Goodman School of Drama and eventually became a member of Chicago's renowned Steppenwolf Theatre. His film break came with a small role in the Vietnam War drama Casualties of War (1989), wherein Brian De Palma liked his work so much during the early stages that he recast him in a major role by the start of shooting as a soldier bent on rape. Reilly gained momentum throughout the 1990s and showed his dazzling stretch of talent in such films as Days of Thunder (1990), Shadows and Fog (1991), What's Eating Gilbert Grape (1993) and The River Wild (1994). He became a major stock player in director Paul Thomas Anderson's films, while finding some of his best roles in Hard Eight (1996) as a compulsive gambler, Boogie Nights (1997) in which he played a narcissistic porn star, and in Magnolia (1999) as a compassionate policeman. He went on to earn further critical points for his role of the soldier sent to the front lines in Terrence Malick's war epic The Thin Red Line (1998). On stage, Reilly has wowed audiences in \"The Grapes of Wrath\" on Broadway, \"A Streetcar Named Desire\" and \"Othello\" at Steppenwolf, and earned an Outer Critics Circle Award and Tony nomination for \"True West\" alongside another impeccable character player Philip Seymour Hoffman. Reilly finally received the film recognition he deserved in 2002 with a slew of choice, high-profile parts in The Hours (2002), The Good Girl (2002), Gangs of New York (2002), and especially Chicago (2002) as the put-upon husband, Amos Hart, who is played for a patsy by murderous wife Roxie (Renée Zellweger). For this last part, he received both Golden Globe and Academy Award nominations for Best Supporting Actor. Since then his stock has risen considerably, and he has further widened his cinematic repertoire, appearing in everything from dramatic roles - We Need to Talk About Kevin (2011), Aviator (2004) and Carnage (2011) - to broader comic turns - Walk Hard: The Dewey Cox Story (2007), Talladega Nights: The Ballad of Ricky Bobby (2006), Step Brothers (2008), Cyrus (2010) and Cedar Rapids (2011). Most recently, he has voiced the lead in Disney's animated smash Wreck-It Ralph (2012). Reilly is married to producer Alison Dickey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDEzMDkzOF5BMl5BanBnXkFtZTYwNzQzNzcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000604","name":"John C. Reilly","idIMDB":"nm0000604"},"actorId":"nm0000604","character":"Cousin John","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tye Sheridan","urlProfile":"http://www.imdb.com/name/nm4446467","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NDA5MTY0M15BMl5BanBnXkFtZTgwMzA3MDExOTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 November 1996","placeOfBirth":" Elkhart, Texas, USA","birthName":"Tye Kayle Sheridan","height":"5' 7½\" (1.71 m)","bio":"Having been named one of Variety's 10 Actors to Watch, Tye Sheridan has emerged as one of Hollywood's most sought after young talents. Most recently, he was seen in Bryan Singer's highly anticipated film X-Men: Apocalypse (2016), release on May 27, 2016. He starred as young Cyclops alongside a star studded cast including Jennifer Lawrence, James McAvoy, Michael Fassbender, Oscar Isaac and Olivia Munn. He will also be seen as the lead in the psychological thriller Detour (2016), opposite Emory Cohen and Bel Powley, which was acquired by Magnet Releasing shortly after the film premiered at the 2016 Tribeca Film Festival. Tye Kayle Sheridan was born in Elkhart, Texas, to Stephanie (Wright), a beauty salon owner, and Bryan Sheridan, a UPS employee. Tye had almost no acting experience when he was cast in a breakthrough role for Terrence Malick's movie The Tree of Life (2011) opposite Brad Pitt, Sean Penn and Jessica Chastain. The film won the 2011 Palme d'Or at the Cannes Film Festival and the 2011 Gotham Award for Best Picture, in addition to three Academy Award nominations. He was also featured in IndieWire's \"Top 25 Filmmakers and Actors\" of 2011. Sheridan won the 2013 Marcello Mastroianni Award at the Venice Film Festival for his captivating performance in the Southern drama Joe (2013) opposite Nicolas Cage. That same year, he was recognized by numerous film critics for his starring role in Jeff Nichol's coming-of-age drama Mud (2012) opposite Matthew McConaughey and Reese Witherspoon. He received a 2014 Critics' Choice nomination for Best Young Actor and the cast was honored with the 2014 Robert Altman Award at the Independent Spirit Awards. He had three films at the 2015 Sundance Film Festival: The Stanford Prison Experiment (2015), based on a shocking real-life psychological experiment; Rodrigo Garcia's Last Days in the Desert (2015) co-starring Ewan McGregor and the indie drama Entertainment (2015) starring alongside Michael Cera and John C. Reilly. These riveting performances were followed by a starring role opposite John Travolta in the crime thriller The Forger, Paramount's horror comedy Scouts Guide to the Zombie Apocalypse (2015), in addition to Gilles Paquet-Brenner's adaptation of Gillian Flynn's mystery novel Dark Places (2015) alongside Charlize Theron, Chloë Grace Moretz and Nicholas Hoult. Sheridan recently wrapped production for Alexandre Moors' film adaptation of Kevin Power's novel \"The Yellow Birds\" alongside Jennifer Aniston, Alden Ehrenreich and Jack Huston. The film centers around two young soldiers who are taken under the wing of an older sergeant after being deployed to Iraq.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NDA5MTY0M15BMl5BanBnXkFtZTgwMzA3MDExOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4446467","name":"Tye Sheridan","idIMDB":"nm4446467"},"actorId":"nm4446467","character":"Eddie the Opener","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lotte Verbeek","urlProfile":"http://www.imdb.com/name/nm2551311","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMzg3NTc5MV5BMl5BanBnXkFtZTgwNTYyMTE1ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 June 1982","placeOfBirth":" Venlo, Limburg, Netherlands","height":"5' 6\" (1.68 m)","bio":"Lotte Verbeek is an award-winning Dutch actress, dancer and model. Lotte was born in Venlo, Netherlands. She was educated at Gymnasium Collegium Marianum in Venlo and graduated in 2008 at the Theaterschool in Amsterdam. From 1999, Verbeek attended the Dance Academy in Arnhem and the Amsterdam Academy of Jazz/Musical Theatre and Dance, where she graduated in 2006. During her studies, she worked as a dancer and model for photographer Erwin Olaf.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMzg3NTc5MV5BMl5BanBnXkFtZTgwNTYyMTE1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2551311","name":"Lotte Verbeek","idIMDB":"nm2551311"},"actorId":"nm2551311","character":"The Chromotherapist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Amy Seimetz","urlProfile":"http://www.imdb.com/name/nm1541272","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNzQyNTkyOV5BMl5BanBnXkFtZTgwMTcwMTEyMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 November 1981","placeOfBirth":" Florida, USA","birthName":"Amy Lynne Seimetz","bio":"Amy Seimetz first came to prominence producing and directing shorts and independent films. Most notably associate producing Barry Jenkins' Medicine For Melancholy which was nominated for Gotham and Independent Spirit Awards, after playing at South By Southwest and the Toronto International Film Festival. She became notable as an actress after her performance in Joe Swanberg's Alexander The Last, a Noah Baumbach produced film which premiered at SXSW. This was the first of three films she worked on under the direction of Mumblecore king Joe Swanberg, including Silver Bullets (Berlin, SXSW) and Autoerotic. She continued her streak of solid indie performances in Lawrence Levine's \"Gabi On The Roof In July\", Lena Dunham's Tiny Furniture (SXSW), Kentucker Audley's \"Open Five\", and David Robert Mitchell's Myth of the American Sleepover (Cannes). Her performance in Adam Wingard's horror thriller A Horrible Way To Die won her the Best Actress award at Fantastic Fest, the biggest genre film festival in the US. The film premiered at the Toronto International Film Festival to rave reviews. Seimetz is probably most known for her performance in the Megan Griffiths drama \"The Off-Hours\", which premiered at the Sundance film festival in 2011. The Hollywood Reporter singled her out as one of the breakouts of Sundance that year, alongside Brit Marling, Elizabeth Olsen, and Felicity Jones. Seimetz rounded out an all-star cast in the Tribeca Film Festival premiere Revenge For Jolly directed by Chadd Harbold. The ensemble cast included Kristen Wiig, Elijah Wood, Oscar Isaac, Garrett Dillahunt, Ryan Phillippe, Gillian Jacobs, Adam Brody and Brian Petsos. The film marked a reunion for Seimetz with her co-stars Wiig, Dilahunt, and Petsos from the Chadd Harbold short film \"One Night Only\". In 2012 Seimetz made her narrative feature directorial debut with her Floridian thriller Sun Don't Shine, which she also wrote, produced, and co-edited. The film premiered at the South By Southwest film festival in the Emerging Visions section to rave reviews.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNzQyNTkyOV5BMl5BanBnXkFtZTgwMTcwMTEyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1541272","name":"Amy Seimetz","idIMDB":"nm1541272"},"actorId":"nm1541272","character":"Woman in Bar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Cera","urlProfile":"http://www.imdb.com/name/nm0148418","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTgyNDgxMjUyOV5BMl5BanBnXkFtZTcwMDYxNzY1OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1988","placeOfBirth":" Brampton, Ontario, Canada","birthName":"Michael Austin Cera","height":"5' 8½\" (1.74 m)","bio":"Canadian actor Michael Cera was born in Brampton, Ontario, to parents who worked for Xerox. His mother, Linda, who is from Quebec, has English, Irish, Scottish, and Dutch ancestry, and his father, Luigi Cera, is Sicilian. Michael is the middle child between two sisters. He was educated at Conestoga Public School, Robert H. Lagerquist Senior Public School and Heart Lake Secondary School until the grade nine. Cera then completed his high school education via correspondence. During a childhood illness he repeatedly viewed Ghostbusters (1984), learning the dialogue. It was this that sparked his interest in performing. He went on to take classes in improvisation at The Second City Toronto. Roles followed in commercials and TV, but he first came to major public attention when he was cast as George Michael Bluth in the critically acclaimed comedy series Arrested Development (2003). After the cancellation of this series, Cera successfully transitioned into movies, scoring starring roles in various projects such as Superbad (2007), Juno (2007), Youth in Revolt (2009) and as the eponymous hero in Scott Pilgrim vs. the World (2010). Alongside acting, Cera is also a musician - he sings and plays guitar and bass.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTgyNDgxMjUyOV5BMl5BanBnXkFtZTcwMDYxNzY1OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0148418","name":"Michael Cera","nicknames":["Mike"],"idIMDB":"nm0148418"},"actorId":"nm0148418","character":"Tommy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Annabella Lwin","urlProfile":"http://www.imdb.com/name/nm0527857","urlPhoto":"","biography":{"dateOfBirth":"31 October 1966","placeOfBirth":" Rangoon, Burma","birthName":"Myant Myant Aye Dunn-Lwin","bio":"Annabella Lwin was born on October 31, 1966 in Rangoon, Burma as Myant Myant Aye Dunn-Lwin.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0527857","name":"Annabella Lwin","idIMDB":"nm0527857"},"actorId":"nm0527857","character":"Airplane Tour Guide","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Hickey","urlProfile":"http://www.imdb.com/name/nm1358820","urlPhoto":"","biography":{"bio":"Mike Hickey is known for his work on La maison au bout de la rue (2012), The Day (2011) and Local Boys (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1358820","name":"Mike Hickey","idIMDB":"nm1358820"},"actorId":"nm1358820","character":"The Heckler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Craig Holland","urlProfile":"http://www.imdb.com/name/nm2189363","urlPhoto":"","biography":{"bio":"Craig Holland is an actor and writer, known for 48 Angels (2007) and Entertainment (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2189363","name":"Craig Holland","idIMDB":"nm2189363"},"actorId":"nm2189363","character":"Oil Field Tour Guide","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Juventino Martin","urlProfile":"http://www.imdb.com/name/nm7744313","urlPhoto":"","biography":{"bio":"Juventino Martin is an actor, known for Entertainment (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm7744313","name":"Juventino Martin","idIMDB":"nm7744313"},"actorId":"nm7744313","character":"Gael","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sergio Estrada","urlProfile":"http://www.imdb.com/name/nm2085332","urlPhoto":"","biography":{"bio":"Sergio Estrada is a cinematographer and actor, known for Siempre hoy día (2001), Elipsis (1999) and Esta manzana está podrida (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2085332","name":"Sergio Estrada","idIMDB":"nm2085332"},"actorId":"nm2085332","character":"Alejandro","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susan Cernas","urlProfile":"http://www.imdb.com/name/nm6162871","urlPhoto":"","biography":{"bio":"Susan Cernas is an actress, known for Entertainment (2015) and Borderland (2017).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6162871","name":"Susan Cernas","idIMDB":"nm6162871"},"actorId":"nm6162871","character":"Alejandro's Daughter Maria","urlCharacter":"http://www.imdb.com/character/ch0475978","main":true},{"actorName":"Kevin Guthrie","urlProfile":"http://www.imdb.com/name/nm6677835","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MTc4ODY0NV5BMl5BanBnXkFtZTgwOTE5NzIxOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Kevin Guthrie is an actor, known for Trash Humpers (2009), Entertainment (2015) and L'homme à la cervelle d'or (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MTc4ODY0NV5BMl5BanBnXkFtZTgwOTE5NzIxOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm6677835","name":"Kevin Guthrie","idIMDB":"nm6677835"},"actorId":"nm6677835","character":"Ghost Town Tour Guide","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fabian Euresti","urlProfile":"http://www.imdb.com/name/nm3277743","urlPhoto":"","biography":{"bio":"Fabian Euresti is an actor and director, known for Everybody's Nuts (2010), Dos, por favor (2010) and Carlos & Brandi (2011).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3277743","name":"Fabian Euresti","idIMDB":"nm3277743"},"actorId":"nm3277743","character":"Orange Grove Worker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tonantzin Carmelo","urlProfile":"http://www.imdb.com/name/nm0138371","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWJlY2VhNzktMzljMS00MGYyLWEyY2MtZGMzZTQ0MGRhMDA1L2ltYWdlXkEyXkFqcGdeQXVyMTk0ODYwMDY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Carmelo began her career as a native dancer and musician, recording 3 CDs with Canyon Records. She honed her acting craft in a myriad of professional theater productions, and is a member of the LA based professional theater company Native Voices, most recently as Lisa Yellowtree in the world premiere production of Carbon Black. Her maternal native ancestry comes from the original people of Southern California (Tongva and Kumeyaay) and her musical gifts come from her father, who is a professional Latin musician. She received her BA from UC Irvine in Environmental Anaysis and Design with a minor in Dance. She established herself as a leading actress with her break-out performance as Thunder Heart Woman in the Emmy-winning Steven Spielberg miniseries Into the West, and made her mark as a motion-capture/voice-over artist playing the villainous Kendra Daniels in the EA Game franchise Dead Space, which sold over two million copies. She is an award-winning and multifaceted actor who is cast in Westerns, Sci-fi, and everything in between. Highlights for Carmelo this year include three feature films: Child of Grace, Medicine Men, and Entertainment, where she plays opposite John C. Reilly. She adds to her voice-over credits by taking on the lead role of Roxanne in Ubisoft's The Crew. Carmelo also topped the \"The Hot List\" of must-see native actors in the national news publication Indian Country today. Her diverse body of work includes lead and supporting roles in over a dozen indie features films, most notably in the festival favorites Imprint, Unearthed, and Shouting Secrets. Carmelo has a background in theater and took the stage as Victoria Roubideaux in Eventide at the Denver Center for the Performing Arts and as Ms. Yellowtree in Carbon Black at Native Voices at the Autry. Her prime-time television guest-starring credits include CSI, Dragnet, and Dark Blue and American Dad!. Along the way she has garnered numerous awards and nominations including a coveted Screen Actors Guild nomination for Outstanding Performance by a Female Actor in Dreamworks' Into the West; Best-Actress awards and nominations for Imprint at the Hoboken International Film Festival (nomination), American Indian Film Festival (two nominations, and one win), and many others. Maxim Magazine also named her character Kendra Daniels on a list for the Hottest Video Game Babes of the year. In her spare time she sings lead and back up vocals with the band Trio Del Alma.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWJlY2VhNzktMzljMS00MGYyLWEyY2MtZGMzZTQ0MGRhMDA1L2ltYWdlXkEyXkFqcGdeQXVyMTk0ODYwMDY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0138371","name":"Tonantzin Carmelo","idIMDB":"nm0138371"},"actorId":"nm0138371","character":"Teresa","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3343784","urlIMDB":"http://www.imdb.com/title/tt3343784","business":{"budget":null,"openingWeekend":[{"money":"$5,132","country":"USA","day":"15","month":"11","year":"2015","remarks":"2 Screens"}],"gross":[{"money":"$44,242","country":"USA","day":"10","month":"01","year":"2016","remarks":""},{"money":"$39,864","country":"USA","day":"03","month":"01","year":"2016","remarks":""},{"money":"$39,800","country":"USA","day":"27","month":"12","year":"2015","remarks":""},{"money":"$31,744","country":"USA","day":"13","month":"12","year":"2015","remarks":""},{"money":"$28,530","country":"USA","day":"06","month":"12","year":"2015","remarks":""},{"money":"$23,461","country":"USA","day":"29","month":"11","year":"2015","remarks":""},{"money":"$19,945","country":"USA","day":"22","month":"11","year":"2015","remarks":""},{"money":"$5,132","country":"USA","day":"15","month":"11","year":"2015","remarks":""}],"weekendGross":[{"money":"$4,280","country":"USA","day":"10","month":"01","year":"2016","remarks":"1 Screen"},{"money":"$64","country":"USA","day":"03","month":"01","year":"2016","remarks":"1 Screen"},{"money":"$104","country":"USA","day":"27","month":"12","year":"2015","remarks":"1 Screen"},{"money":"$2,014","country":"USA","day":"13","month":"12","year":"2015","remarks":"7 Screens"},{"money":"$4,001","country":"USA","day":"06","month":"12","year":"2015","remarks":"9 Screens"},{"money":"$1,018","country":"USA","day":"29","month":"11","year":"2015","remarks":"3 Screens"},{"money":"$10,650","country":"USA","day":"22","month":"11","year":"2015","remarks":"8 Screens"},{"money":"$5,132","country":"USA","day":"15","month":"11","year":"2015","remarks":"2 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 43 min (103 min)"],"soundMix":null,"color":["Color"],"aspectRatio":["2.66 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.7","metascore":"65","filmingLocations":[{"location":"Ridgecrest, California, USA"}],"rated":"R","awards":[{"award":"Locarno International Film Festival 2015","titlesAwards":[{"titleAwardOutcome":"Won Junior Jury Award - \"Environment Is Quality of Life\" Prize","categories":[{"category":"","names":[{"name":"Rick Alverson","id":"nm3687830","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Leopard","categories":[{"category":"","names":[{"name":"Rick Alverson","id":"nm3687830","role":null}]}]}]},{"award":"Sarasota Film Festival 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Jury Prize","categories":[{"category":"Narrative Feature Film Competition","names":[{"name":"Rick Alverson","id":"nm3687830","role":null}]}]}]}],"votes":"1,950","type":"Movie","companyCreditsSimple":[{"idCompany":"co0488307","name":"Armando Montelongo Productions"},{"idCompany":"co0472567","name":"Arts+Labor"},{"idCompany":"co0016798","name":"Autumn Productions"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 00:03:11"}}