{"data":{"movies":[{"title":"Airplane vs. Volcano","originalTitle":"","year":"2014","releaseDate":"20140328","directors":[{"name":"James Kondelik","id":"nm3303482"},{"name":"Jon Kondelik","id":"nm3304337"}],"writers":[{"name":"James Kondelik","id":"nm3303482"},{"name":"Jon Kondelik","id":"nm3304337"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMzE1MzI4OF5BMl5BanBnXkFtZTgwMTcyMTA1MTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Sci-Fi"],"plot":"When a commercial airliner is trapped within a ring of erupting volcanoes, the passengers and crew must find a way to survive - without landing. But when the relentless onslaught of lava and ash causes fear and distrust amongst those onboard, it isn't just the volcanoes that are life-threatening. Everyone must learn to work together if they are to survive their epic flight of fire.","simplePlot":"Maybe the directors should consult anyone at all in aviation before making such a ridiculous but hilariously bad movie. Howling just thinking about how bad it is. I want 2 hours of my life back.","actors":[{"actorName":"Dean Cain","urlProfile":"http://www.imdb.com/name/nm0001002","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MzIwNTY3NF5BMl5BanBnXkFtZTgwMTc3MTEwMzE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1966","placeOfBirth":" Mt. Clemens, Michigan, USA","birthName":"Dean George Tanaka","height":"5' 11½\" (1.82 m)","bio":"Dean Cain was born Dean George Tanaka in Mount Clemens, Michigan, to actress Sharon Thomas Cain and Roger Tanaka. His mother married his adoptive father, director Christopher Cain, when Dean was three. Though he grew up in Malibu and attended Santa Monica High School, his career plans favored professional football over acting. While at Princeton, he completed a history major, dated Brooke Shields for two years, and set an NCAA record for interceptions in a season. After signing with the Buffalo Bills, a knee injury ended his pro career before it began. Though he had already played a part in his father's The Stone Boy (1984), he went through the usual route of commercials and tv-parts (notably, Beverly Hills, 90210 (1990) in 1990) before landing his break-through role as Superman/Clark Kent in the series Lois & Clark: The New Adventures of Superman (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MzIwNTY3NF5BMl5BanBnXkFtZTgwMTc3MTEwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001002","name":"Dean Cain","idIMDB":"nm0001002"},"actorId":"nm0001002","character":"Rick Pierce","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robin Givens","urlProfile":"http://www.imdb.com/name/nm0002101","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzQ5MTgxNF5BMl5BanBnXkFtZTcwMTY1Mzk1MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 November 1964","placeOfBirth":" New York City, New York, USA","birthName":"Robin Simone Givens","height":"5' 5\" (1.65 m)","bio":"Robin Simone Givens was born in New York City on 27th of November, 1964, to Ruth (Newby) and Reuben Givens. Robin's father left his family when Robin was a young girl and she seldom saw him after that. Robin's mother raised her and her younger sister in Westchester, CT. Her mother (once linked to Yankee outfielder Dave Winfield) always encouraged her children's creativity and helped them develop an interest in the arts. When she was young, Robin began playing the violin but quickly decided it was not for her. She chose instead to channel her artistic energy through acting and, at the age of ten, she started acting classes at the American Academy of Dramatic Arts in New York City. In 1980, at fifteen, Robin enrolled as a freshman at Sarah Lawrence College to study pre-med. By her junior year, however, Robin's excitement about the idea of a career in acting intensified and she began taking her craft more seriously. Robin's first experience in Hollywood was on The Cosby Show (1984), the hottest show on television. As a result of the role, she and comedian Bill Cosby forged a great friendship which would prove instrumental in Robin's career. She also landed a guest appearance on Diff'rent Strokes (1978). Her career was just about to take off. Robin first made it big in Hollywood in 1986. She took a role in a television movie, Beverly Hills Madam (1986), as \"April Baxter\". But, it was later that year that Robin became a recognizable actress in Hollywood. She was given a role on the television series Head of the Class (1986) as \"Darlene Merriman\". The series was a comedy about a group of gifted high school students that were placed in an enrichment class. In 1988, Robin married boxing legend Mike Tyson. This union put her into the national spotlight, as Tyson was on the top of his career. He was one of the youngest boxers ever to receive the attention, acclaim and financial success that Tyson garnered. The marriage ended (on Valentine's Day), just a year later. Rumors hinted at abuse and infidelity. Robin gave marriage another chance in 1997, by marrying her tennis instructor Svetozar Marinkovic. The marriage proved a total failure, as the two were separated since the day they married, and Robin filed for divorce citing \"irreconcilable differences\". Aside from a successful model and acclaimed actress, Robin is a mother. In October 1999, she gave birth to a baby boy. The baby's father is tennis player Murphy Jensen, but the couple are no longer together. She has another child, and she is raising the two boys today. In 2000, Robin took a controversial career move as she took over for Mother Love on the successful television talk show, Forgive or Forget (1998). Her stint was brief, as just a few months later, the show stopped production. Many point to Mother Love's devoted audience, and the odd dismissal of her from the show she pioneered and created. Robin has tried to forge a friendship with Mother Love, but Love doesn't appear interested. Robin called in during a Howard Stern interview of Mother Love, where she said she was \"on her way to work\", which although innocent, proved to upset Mother Love.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzQ5MTgxNF5BMl5BanBnXkFtZTcwMTY1Mzk1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002101","name":"Robin Givens","idIMDB":"nm0002101"},"actorId":"nm0002101","character":"Lisa Whitmore","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tamara Goodwin","urlProfile":"http://www.imdb.com/name/nm4252685","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0ODk2NTY1N15BMl5BanBnXkFtZTgwNzk2MzM4NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Born in Austin, Texas to an African American father and Belizean mother, Tamara Goodwin has developed a rich heritage evolving around education, culture and the arts. After graduating Who's Who among High school students at James Bowie High school in Austin Texas, she received a Bachelor's degree in Nursing from the University of Texas at Arlington, and then later received her Master's degree in Business Administration from Texas Woman's University. Although she had been involved in theater at a young age, it was in college where Tamara developed a strong passion for the arts. She is a multi-talented individual with notable experience in acting, modeling, writing, directing and producing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0ODk2NTY1N15BMl5BanBnXkFtZTgwNzk2MzM4NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4252685","name":"Tamara Goodwin","nicknames":["T.Good"],"idIMDB":"nm4252685"},"actorId":"nm4252685","character":"Rita Loss","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matt Mercer","urlProfile":"http://www.imdb.com/name/nm0580290","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMjQxNTg5OV5BMl5BanBnXkFtZTcwMjQ5MDY0NQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 March 1980","placeOfBirth":" Newport News, Virginia, USA","height":"5' 11\" (1.8 m)","bio":"Matt Mercer was born on March 17, 1980 in Newport News, Virginia, USA. He is an actor and producer, known for Contracted (2013), Contracted: Phase II (2015) and Beyond the Gates (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMjQxNTg5OV5BMl5BanBnXkFtZTcwMjQ5MDY0NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0580290","name":"Matt Mercer","idIMDB":"nm0580290"},"actorId":"nm0580290","character":"Landon Todd","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Morgan West","urlProfile":"http://www.imdb.com/name/nm3419517","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY5NzUzMTI0NV5BMl5BanBnXkFtZTgwNDg1NzM5MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Morgan West is an actor and writer, known for Age of Tomorrow (2014), Airplane vs. Volcano (2014) and Camp Abercorn: Shorts (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY5NzUzMTI0NV5BMl5BanBnXkFtZTgwNDg1NzM5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3419517","name":"Morgan West","idIMDB":"nm3419517"},"actorId":"nm3419517","character":"Specialist Neil Tully","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lawrence Hilton-Jacobs","urlProfile":"http://www.imdb.com/name/nm0385320","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MTY2NzQ3Nl5BMl5BanBnXkFtZTYwNjI1OTQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1953","placeOfBirth":" New York City, New York, USA","height":"6' 3\" (1.91 m)","bio":"Lawrence-Hilton Jacobs was born in New York City. He is one of nine children born to Hilton and Clothilda Jacobs. Larry, as his family and friends call him, attended public schools in New York City, so he has first-hand knowledge of what it is like to be a student in a big-city high school like the one pictured on \"Welcome Back, Kotter.\" After high school, Larry worked at an odd assortment of jobs before turning to acting. First, he was a delivery boy, then a florist, then a messenger boy, and then a stock boy in a department store. His first \"real important job,\" as he puts it, was as a freelance artist and package designer. This introduction to the world of the arts made up for all of the menial jobs he had performed while waiting to find himself. While working as an artist, Larry became interested in acting and began studying at Al Fann's Theatrical School and then with the Negro Emsemble Company. These are two all-black acting companies which produce experimental plays in New York City. They also train promising young black actors in the performing arts. With these companies, Larry acted in such plays as \"Cora's Second Cousin,\" \"The Dean,\" \"What the Wine Sellers Buy,\" \"Mask in Black,\" and \"The Exterminator.\" None of these productions made him famous, but they did bring him to the attention of film casting directors. He was given parts in the movies Claudine (1974) and Cooley High (1975). Cooley High (1975) was Larry's big breakthrough in show business. It was because of this film that he was given his 'Boom Boom Washington' role on Welcome Back, Kotter (1975). He also had two important roles in major made-for-television features, \"The Sojourner\" and the tremendously popular Roots (1977). Besides acting, Larry also sings, plays the piano and writes music.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MTY2NzQ3Nl5BMl5BanBnXkFtZTYwNjI1OTQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0385320","name":"Lawrence Hilton-Jacobs","idIMDB":"nm0385320"},"actorId":"nm0385320","character":"Jim Kirkland","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Graham Denman","urlProfile":"http://www.imdb.com/name/nm2735837","urlPhoto":"","biography":{"bio":"Graham Denman is known for his work on Blood Brothers (2015), The Haunting of Whaley House (2012) and Get the Girl (2017).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2735837","name":"Graham Denman","idIMDB":"nm2735837"},"actorId":"nm2735837","character":"Private Vaughn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Jerome Putnam","urlProfile":"http://www.imdb.com/name/nm4309786","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTExNzE1NDAyOF5BMl5BanBnXkFtZTcwNTIwMzIyOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 2\" (1.88 m)","bio":"Born Michael Jerome Putnam, Hamilton's bio reads like a bestseller: By the age of 17, he was a high school dropout and living out of his car with his dog. To survive, he found a job pumping gas and would often shower at friends' homes when their parents were at work. By the age of 33, this father of four was married and divorced. A second marriage added two more children to the family makeup. Things were looking up. And then the ceiling collapsed. In 2005, Hamilton fought the fight of his life when it was discovered he had lymphoma, but after a year of treatments and surgery, he was found to be cancer free. Once again life had returned to normal, until he received a random text message from his (now) ex-wife who said simply that she no longer wanted to be married. Devastated, Hamilton decided to start over and, in May 2010, he landed his first modeling gig for a Luis Vuitton charity event. The experience left a lasting impression on Hamilton, who has since landed roles on ABC's Body of Proof; CBS' Mike and Molly, and Two Broke Girls; and who even has screen time in the new Denzel Washington/Ryan Reynolds flick, Safe House. Things are finally looking up for Jerome Hamilton, who has survived homelessness, a cancer scare, divorce and other disappointments along his path.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTExNzE1NDAyOF5BMl5BanBnXkFtZTcwNTIwMzIyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4309786","name":"Mike Jerome Putnam","nicknames":["Jerome Hamilton","Martin Channing","Mike Putnam"],"idIMDB":"nm4309786"},"actorId":"nm4309786","character":"Colonel Ryker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anthony Marks","urlProfile":"http://www.imdb.com/name/nm2111014","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwODk0MDg1NF5BMl5BanBnXkFtZTgwMzc4MzQ0MzE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"bio":"Anthony Marks is an actor and assistant director, known for Unbreakable Kimmy Schmidt (2015), Blood Night: The Legend of Mary Hatchet (2009) and One Life to Live (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwODk0MDg1NF5BMl5BanBnXkFtZTgwMzc4MzQ0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2111014","name":"Anthony Marks","idIMDB":"nm2111014"},"actorId":"nm2111014","character":"Frank Matthews","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Vega","urlProfile":"http://www.imdb.com/name/nm2438386","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTE1MTMyYTctZmI1NC00MGJmLTlhZDktN2RkNTllY2VlN2IyL2ltYWdlXkEyXkFqcGdeQXVyMjA2MTc0NDQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"David Vega is a Spanish actor USA based.He is from a beautiful Village in Cantabria( North of Spain). He graduated from Atlantic's Acting school Evening Conservatory in 2013 . He can do Russian, Italian, French and Spanish... accents. He is Known for Cut to Black, Airplane vs Volcano, The Preppie Connection, You Have A Nice Flight among other movies.He has been acting for more than 20 years.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTE1MTMyYTctZmI1NC00MGJmLTlhZDktN2RkNTllY2VlN2IyL2ltYWdlXkEyXkFqcGdeQXVyMjA2MTc0NDQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2438386","name":"David Vega","idIMDB":"nm2438386"},"actorId":"nm2438386","character":"Carlos Crieger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ryan Budds","urlProfile":"http://www.imdb.com/name/nm5557506","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDQ5OTcwMV5BMl5BanBnXkFtZTcwNjUzNzk3OQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Ryan Budds is a comedian/writer/actor from the south suburbs of Chicago now living in Los Angeles. His jokes have grabbed attention from Comedy Central, Rooftop Comedy, WGN, CBS, Time Out Chicago, and United Healthcare's website. Most recently, you can see him in the SyFy Channel original movie Sharknado (2013) starring Tara Reid and 'Ian Ziering' (qv. On stage, Budds is a newlywed in his 20s who talks about his dad's obsession with malls, his worthless English degree, and over-phallic bachelorette parties, to name a few things. He's opened for many notably funny comics like Dennis Miller, Zach Galafianakis, and The Wayans Brothers. He's performed at many great clubs including The Improv, Zanies, and The Laugh Factory and frequents college stages like Indiana University and University of Michigan. Recently, Budds optioned a feature length comedy titled Colorful for Nickelodeon star Keke Palmer's production company. He also wrote and starred in a weekly web series called Between Gigs with award-winning screenwriter Dale Zawada, and produced, wrote and starred in a full-length comedy pilot with some of Chicago's finest comics/actors called Life Support.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDQ5OTcwMV5BMl5BanBnXkFtZTcwNjUzNzk3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5557506","name":"Ryan Budds","idIMDB":"nm5557506"},"actorId":"nm5557506","character":"Private Thatch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonathan Nation","urlProfile":"http://www.imdb.com/name/nm2316340","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5Mzg1MjM4N15BMl5BanBnXkFtZTgwNDc1NzgxMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jonathan Nation is an actor, known for Elvis Lives! (2016), Mega Shark vs. Giant Octopus (2009) and 2012 Doomsday (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5Mzg1MjM4N15BMl5BanBnXkFtZTgwNDc1NzgxMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2316340","name":"Jonathan Nation","idIMDB":"nm2316340"},"actorId":"nm2316340","character":"Captain Minor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeff Groff","urlProfile":"http://www.imdb.com/name/nm6078232","urlPhoto":"","biography":{"bio":"Jeff Groff is known for his work on Sharknado (2013) and Airplane vs. Volcano (2014).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6078232","name":"Jeff Groff","idIMDB":"nm6078232"},"actorId":"nm6078232","character":"Jeff Spair","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Natalie Burtney","urlProfile":"http://www.imdb.com/name/nm5334542","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI1OTk2MDg5M15BMl5BanBnXkFtZTgwNTIxMTA0MDI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 6\" (1.68 m)","bio":"Natalie Burtney is an actress and writer, known for Airplane vs. Volcano (2014), Bermuda Tentacles (2014) and The Werd (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI1OTk2MDg5M15BMl5BanBnXkFtZTgwNTIxMTA0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5334542","name":"Natalie Burtney","idIMDB":"nm5334542"},"actorId":"nm5334542","character":"Jennifer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zachary Haven","urlProfile":"http://www.imdb.com/name/nm4283262","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwNjc0Njk3MV5BMl5BanBnXkFtZTgwNjQ4MTgyMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 2\" (1.57 m)","bio":"Zachary Haven is known for his work on Bastards (2017), Airplane vs. Volcano (2014) and Criminal Minds (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwNjc0Njk3MV5BMl5BanBnXkFtZTgwNjQ4MTgyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4283262","name":"Zachary Haven","idIMDB":"nm4283262"},"actorId":"nm4283262","character":"Tony","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3417334","urlIMDB":"http://www.imdb.com/title/tt3417334","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 31 min (91 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["Video"],"cinematographicProcess":null,"printedFilmFormat":null},"rating":"2.5","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"TV-14","awards":[],"votes":"1,377","type":"Video","companyCreditsSimple":[{"idCompany":"co0042909","name":"Asylum, The"}],"keywords":{"keywords":["disaster movie","cgi","psychopath","pilot","flight attendant","death of protagonist","beach","hawaii","military","volcano","airplane"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 07:43:01"}}