{"data":{"movies":[{"title":"Vice","originalTitle":"","year":"2015","releaseDate":"20150116","directors":[{"name":"Brian A Miller","id":"nm2357819"}],"writers":[{"name":"Andre Fabrizio","id":"nm1061002"},{"name":"Jeremy Passmore","id":"nm0664920"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4OTg3Mjg5OV5BMl5BanBnXkFtZTgwMzYxMTg0MzE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Sci-Fi","Thriller"],"plot":"Julian Michaels (Bruce Willis) has designed the ultimate resort: VICE, where anything goes and the customers can play out their wildest fantasies with artificial inhabitants who look, think and feel like humans. When an artificial (Ambyr Childers) becomes self-aware and escapes, she finds herself caught in the crossfire between Julian's mercenaries and a cop (Thomas Jane) who is hell-bent on shutting down Vice, and stopping the violence once and for all.","simplePlot":"Bruce Willis stars in this Sci-Fi thriller about ultimate resort: VICE, where customers can play out their wildest fantasies with artificial inhabitants who look like humans.","actors":[{"actorName":"Ambyr Childers","urlProfile":"http://www.imdb.com/name/nm1024107","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MzkzNjI5NF5BMl5BanBnXkFtZTcwMzMyNDAyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Ambyr Childers was born in Cottonwood, Arizona and raised in Murrieta, California. She appeared in the 2003 film Dickie Roberts, and became well known for her role as Colby Chandler on the daytime soap opera All My Children from 2006 to 2008. She also played Elizabeth \"E\" Dodd in The Master.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MzkzNjI5NF5BMl5BanBnXkFtZTcwMzMyNDAyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1024107","name":"Ambyr Childers","idIMDB":"nm1024107"},"actorId":"nm1024107","character":"Kelly","urlCharacter":"http://www.imdb.com/character/ch0499591","main":true},{"actorName":"Thomas Jane","urlProfile":"http://www.imdb.com/name/nm0005048","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgwMjMwNzAxNF5BMl5BanBnXkFtZTcwNzIwMDg4Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1969","placeOfBirth":" Baltimore, Maryland, USA","birthName":"Thomas Elliott","height":"5' 11\" (1.8 m)","bio":"Thomas Jane was born on February 22, 1969 in Baltimore, Maryland, USA as Thomas Elliott. He is an actor and producer, known for The Mist (2007), Deep Blue Sea (1999) and Dreamcatcher (2003). He was previously married to Patricia Arquette and Ayesha Hauer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgwMjMwNzAxNF5BMl5BanBnXkFtZTcwNzIwMDg4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005048","name":"Thomas Jane","idIMDB":"nm0005048"},"actorId":"nm0005048","character":"Roy","urlCharacter":"http://www.imdb.com/character/ch0499592","main":true},{"actorName":"Bryan Greenberg","urlProfile":"http://www.imdb.com/name/nm1034965","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0ODE2OTE2Ml5BMl5BanBnXkFtZTcwNTAyOTAyMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1978","placeOfBirth":" Omaha, Nebraska, USA","birthName":"Bryan E. Greenberg","height":"6' (1.83 m)","bio":"Bryan Greenberg was born in Omaha, Nebraska, to Denise \"Denny\" and Carl Greenberg, who are both psychologists. He has a sister, Becca. His family is Jewish. At the age of twelve, Greenberg moved to St. Louis, Missouri, and graduated from Parkway Central High School in Chesterfield, MO. Having starring in summer camp productions, he moved to New York City to pursue an acting career. Greenberg studied at NYU, and made his television debut on a 1997 episode of Law & Order (1990), playing Matt Wheeler, followed by other television work (including episodes of The Sopranos (1999), Third Watch (1999), and Boston Public (2000), and a run on One Tree Hill (2003)). Moving into film, Greenberg had his first major movie role playing Matty Matthews in The Perfect Score (2004), with an even bigger part in Prime (2005), as David Bloomberg, the love interest of Uma Thurman's character. Since then, Greenberg has headlined the television series October Road (2007) and How to Make It in America (2010), and had notable supporting turns in the films Bride Wars (2009), as the brother of Kate Hudson's character, and Friends with Benefits (2011), opposite Mila Kunis's Jamie Rellis. On October 31, 2015, Bryan married actress Jamie Chung.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0ODE2OTE2Ml5BMl5BanBnXkFtZTcwNTAyOTAyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1034965","name":"Bryan Greenberg","nicknames":["BG"],"idIMDB":"nm1034965"},"actorId":"nm1034965","character":"Evan","urlCharacter":"http://www.imdb.com/character/ch0499593","main":true},{"actorName":"Bruce Willis","urlProfile":"http://www.imdb.com/name/nm0000246","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MjMzMTE5OF5BMl5BanBnXkFtZTcwMzQ2ODE3Mw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 March 1955","placeOfBirth":" Idar-Oberstein, West Germany","birthName":"Walter Bruce Willis","height":"6' (1.83 m)","bio":"Actor and musician Bruce Willis is well known for playing wisecracking or hard-edged characters, often in spectacular action films. Collectively, he has appeared in films that have grossed in excess of $2.5 billion USD, placing him in the top ten stars in terms of box office receipts. Walter Bruce Willis was born on March 19, 1955, in Idar-Oberstein, West Germany, to a German mother, Marlene K. (from Kassel), and an American father, David Andrew Willis (from Carneys Point, New Jersey), who were then living on a United States military base. His family moved to the U.S. shortly after he was born, and he was raised in Penns Grove, New Jersey, where his mother worked at a bank and his father was a welder and factory worker. Willis picked up an interest for the dramatic arts in high school, and was allegedly \"discovered\" whilst working in a café in New York City and then appeared in a couple of off-Broadway productions. While bartending one night, he was seen by a casting director who liked his personality and needed a bartender for a small movie role. After countless auditions, Willis contributed minor film appearances, usually uncredited, before landing the role of private eye \"David Addison\" alongside sultry Cybill Shepherd in the hit romantic comedy television series Moonlighting (1985). The series firmly established Bruce Willis as a hot new talent, and his sarcastic and wisecracking P.I. was in effect a dry run for the role of hard-boiled NYC detective \"John McClane\" in the monster hit Die Hard (1988). This superbly paced action film balanced laconic humor and wholesale destruction as Willis' character single handedly battles a gang of ruthless international thieves in a Los Angeles skyscraper. Willis reprized the role of tough guy cop \"John McClane\" in the eagerly anticipated sequel Die Hard 2 (1990) set at snowbound Washington's Dulles International Airport as a group of renegade Special Forces soldiers seek to repatriate a corrupt South American general. Excellent box office returns demanded a further sequel Die Hard with a Vengeance (1995) this time also starring Samuel L. Jackson as a cynical Harlem shopowner unwittingly thrust into assisting McClane during a terrorist bombing campaign on a sweltering day in NYC. Willis found time out from all the action mayhem to provide the voice of \"Mikey\" the baby in the very popular family comedies Look Who's Talking (1989), and its sequel Look Who's Talking Too (1990) also starring John Travolta and Kirstie Alley. Over the next decade, Willis starred in some very successful films, some very offbeat films and some unfortunate box office flops. The Bonfire of the Vanities (1990) and Hudson Hawk (1991) were both large scale financial disasters that were savaged by the critics, and both are arguably best left off the CVs of all the actors involved, however Willis was still popular with movie audiences and selling plenty of theatre tickets with the hyperviolent The Last Boy Scout (1991), the darkly humored Death Becomes Her (1992) and the mediocre police thriller Striking Distance (1993). During the 1990s, Willis also appeared in several independent and low budget productions that won him new fans and praise from the critics for his intriguing performances working with some very diverse film directors. He appeared in the oddly appealing North (1994), as a cagey prizefighter in the Quentin Tarantino directed mega-hit Pulp Fiction (1994), the Terry Gilliam directed apocalyptic thriller Twelve Monkeys (1995), the Luc Besson directed sci-fi opus The Fifth Element (1997) and the M. Night Shyamalan directed spine-tingling epic The Sixth Sense (1999). Willis next starred in the gangster comedy The Whole Nine Yards (2000), worked again with \"hot\" director M. Night Shyamalan in the less gripping Unbreakable (2000), and in two military dramas, Hart's War (2002) and Tears of the Sun (2003) that both failed to really fire with movie audiences or critics alike. However, Willis bounced back into the spotlight in the critically applauded Frank Miller graphic novel turned movie Sin City (2005), the voice of \"RJ\" the scheming raccoon in the animated hit Over the Hedge (2006) and \"Die Hard\" fans rejoiced to see \"John McClane\" return to the big screen in the high tech Live Free or Die Hard (2007) aka \"Die Hard 4.0\". Willis was married to actress Demi Moore for approximately thirteen years and they share custody to their three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MjMzMTE5OF5BMl5BanBnXkFtZTcwMzQ2ODE3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000246","name":"Bruce Willis","nicknames":["Bruno"],"idIMDB":"nm0000246"},"actorId":"nm0000246","character":"Julian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Johnathon Schaech","urlProfile":"http://www.imdb.com/name/nm0000628","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NDY2NjkwNV5BMl5BanBnXkFtZTcwMjUwODIwNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1969","placeOfBirth":" Edgewood, Maryland, USA","height":"5' 11\" (1.8 m)","bio":"Johnathon Schaech was born on September 10, 1969 in Edgewood, Maryland, USA. He is an actor and writer, known for That Thing You Do! (1996), Legends of Tomorrow (2016) and Prom Night (2008). He has been married to Julie Solomon since July 24, 2013. They have one child. He was previously married to Jana Kramer and Christina Applegate.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NDY2NjkwNV5BMl5BanBnXkFtZTcwMjUwODIwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000628","name":"Johnathon Schaech","idIMDB":"nm0000628"},"actorId":"nm0000628","character":"Chris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charlotte Kirk","urlProfile":"http://www.imdb.com/name/nm5016840","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA3ZTAxZGQtYWQ5MC00YTlkLThlZmItMDUxMGIwMWZjZjgwXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 8\" (1.73 m)","bio":"Charlotte Sophie Kirk was born in Kent, England. Her passion for acting began at the age of 11 when she fell in love with the stage. She has since performed in Greek dramas and plays such as \"Agamemnon,\" \"Arturo Ui,\" \"A Christmas Carol,\" \"Oliver Twist,\" and \"Hairspray.\" Having attended the prestigious Italia Conti School of Acting in London, her skills were further refined at The Miskin Theatre and Jigsaw Performing Arts. While studying theatre arts, she appeared in commercials for Nintendo Wii and UK Orange Telecom. Charlotte also became sought after and was photographed for magazines internationally, in particular by renowned Vogue photographer Patrick Demarchelier. In early 2015, Charlotte Kirk landed a starring role in \"Vice\" opposite Bruce Willis and Thomas Jane, a sci-fi futuristic thriller. Charlotte has completed seven feature films, including \"Black Dog Red Dog\" with James Franco, \"Fractured\" with Vinnie Jones, \"Seduced and Abandoned,\" directed by James Toback, and \"Tekken: Kazuya's Revenge,\" where she plays a female assassin. She will also be starring as Nicole Brown Simpson in the upcoming feature film \"An American Mystery\". \"Gone With The Wind\" is her all-time favorite film, as she admires strong heroines. Charlotte presently resides in Los Angeles and is managed by Endorse Management Group and Headline Talent Agency.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk3NTA2ODQtYmM1MS00MTU5LWEyMmUtYzY1ZWFhMjA4NTY2XkEyXkFqcGdeQXVyNTQ3Nzk5OTQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5016840","name":"Charlotte Kirk","idIMDB":"nm5016840"},"actorId":"nm5016840","character":"Melissa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brett Granstaff","urlProfile":"http://www.imdb.com/name/nm1616666","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MDA5ODEyMV5BMl5BanBnXkFtZTgwNTE4NzI2ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1980","placeOfBirth":" Signal Mountain, Tennessee, USA","birthName":"Brett K. Granstaff","bio":"Brett was a resident of many locations growing up and went to school in several cities, including Chattanooga, Tennessee (Baylor School), Denver,Colorado ( Colorado Academy), Las Vegas, Nevada (Bishop Gorman), Seattle, Washington (Woodinville School) and Hendersonville, Tennessee (N. Berry School). Brett is a graduate of New York University, Tisch School of Arts with a B.A. degree and a Graduate of Judge Business school at Cambridge University, UK with an M.B.A. in media/entertainment.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MDA5ODEyMV5BMl5BanBnXkFtZTgwNTE4NzI2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1616666","name":"Brett Granstaff","idIMDB":"nm1616666"},"actorId":"nm1616666","character":"James","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ryan O'Nan","urlProfile":"http://www.imdb.com/name/nm1645352","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0NzQ0OTkwNF5BMl5BanBnXkFtZTgwNjcwNDM1MTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"bio":"Ryan O'Nan is an actor and writer, known for Fargo (2014), Ray Donovan (2013) and Brooklyn Brothers Beat the Best (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0NzQ0OTkwNF5BMl5BanBnXkFtZTgwNjcwNDM1MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1645352","name":"Ryan O'Nan","idIMDB":"nm1645352"},"actorId":"nm1645352","character":"Det. Matthews","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Gordon","urlProfile":"http://www.imdb.com/name/nm6736495","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjcwNzA1ODAzOF5BMl5BanBnXkFtZTgwMzI4NTY2MzE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"height":"6' 3\" (1.91 m)","bio":"David Gordon is an actor, known for Vice (2015), The Prince (2014) and Marauders (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjcwNzA1ODAzOF5BMl5BanBnXkFtZTgwMzI4NTY2MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm6736495","name":"David Gordon","nicknames":["Gordo"],"idIMDB":"nm6736495"},"actorId":"nm6736495","character":"Mitch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Colin Egglesfield","urlProfile":"http://www.imdb.com/name/nm1148573","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTkwNDg0MTc4OF5BMl5BanBnXkFtZTgwMDE1ODU3NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1973","placeOfBirth":" Dearborn, Michigan, USA","birthName":"Colin Joseph Egglesfield","height":"6' (1.83 m)","bio":"Colin Egglesfield (born February 9, 1973) is an American actor. He is known for his roles as \"Josh Madden\" in the long-running soap opera, All My Children (1970), \"Auggie Kirkpatrick\" on The CW's short-lived drama series, Melrose Place (2009), and \"Evan Parks\" on The Client List (2012). He was born in Farmington Hills, Michigan, the second child of Kathleen (née Dineen) and William Egglesfield, a physician. His mother is Irish. He has two siblings: an older sister, Kerry, and a younger brother, Sean. He was brought up in a Catholic household.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTkwNDg0MTc4OF5BMl5BanBnXkFtZTgwMDE1ODU3NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1148573","name":"Colin Egglesfield","idIMDB":"nm1148573"},"actorId":"nm1148573","character":"Reiner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cameron Brexler","urlProfile":"http://www.imdb.com/name/nm4480309","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MjI2NTc5NF5BMl5BanBnXkFtZTgwNzc3NDU2NzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 10\" (1.78 m)","bio":"Cameron's entertainment career began while attending Louisiana State University where he graduated with a degree in Political Science and Performance Studies. During which time, he performed stand up comedy and music at local open mic nights. After graduating, he toured nationally for two years with Theatre A-GoGo's production of, The Queen of Bingo, as Father Mac/Bingo Caller. Since then, Cameron has studied comedy improv at Groundlings Theatre in Los Angeles, and can be seen in various commercials, television shows, and films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MjI2NTc5NF5BMl5BanBnXkFtZTgwNzc3NDU2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4480309","name":"Cameron Brexler","idIMDB":"nm4480309"},"actorId":"nm4480309","character":"Keith","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jesse Pruett","urlProfile":"http://www.imdb.com/name/nm3918567","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NTY1NjUwMl5BMl5BanBnXkFtZTgwMTA1NjIwMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Jesse Pruett was born in San Diego, California. He is a American Actor, Singer, Songwriter, Composer and Musician. He started the band Parker Theory in the summer of 2000 releasing 4 albums and 2 EP's. Songs he has written have been heard on MTV, VH1, NBC, ABC, CW and many other TV shows, Movies, and Radio. He has released albums through record labels in the U.S., Japan, Brazil, and Sweden. Over the years he has shared the stage with Blink 182, Jason Mraz, Switchfoot, Smashmouth, Eve 6, P.O.D., and many other great bands and artists. He continues to write, record and release music through Parker Theory and other projects. Recently he released a solo album called Relentless Love. He and T.J. Hill wrote the score and original soundtrack to the film General Education. He also wrote the original score and soundtrack to the film Oliver, Stoned with his friends Greg Camp and Michael Klooster.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NTY1NjUwMl5BMl5BanBnXkFtZTgwMTA1NjIwMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3918567","name":"Jesse Pruett","idIMDB":"nm3918567"},"actorId":"nm3918567","character":"Officer Pullman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tyler Jon Olson","urlProfile":"http://www.imdb.com/name/nm1476806","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5NzYwMTIyNDVeQTJeQWpwZ15BbWU3MDQ4ODU2NTM@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Tyler Jon Olson is an actor and producer, known for The Life and Death of John Gotti (2017), Marauders (2016) and Criminal Minds (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5NzYwMTIyNDVeQTJeQWpwZ15BbWU3MDQ4ODU2NTM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1476806","name":"Tyler Jon Olson","idIMDB":"nm1476806"},"actorId":"nm1476806","character":"Steve","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Don Harvey","urlProfile":"http://www.imdb.com/name/nm0367496","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MzgyNTk5N15BMl5BanBnXkFtZTcwMzAyMDY2Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1960","placeOfBirth":" St. Clair Shores, Michigan, USA","birthName":"Donald Patrick Harvey II","height":"5' 10¾\" (1.8 m)","bio":"Don Harvey was born in St. Clair Shores Michigan the sixth of eight children. He attended the University of Michigan and the Yale School of Drama before moving to New York City to pursue film, TV and theatre work. He has appeared in over forty feature films, but his most notable performances are in Casualties Of War (1989) alongside Sean Penn and Michael J. Fox, Eight Men Out (1988) with John Cusack and Charlie Sheen and American Heart (1993) with Jeff Bridges. His television work includes starring performances on Miami Vice, NYPD Blue, The Pretender, Medum, Numb3rs and HBO's Luck. He is constantly doing theater in New York and throughout the country, performing in classical plays by Shakespeare, Williams, Pinter, Mamet and others as well as contemporary and new works. He is married to Dyanne Court Harvey and shares his time between New York and Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MzgyNTk5N15BMl5BanBnXkFtZTcwMzAyMDY2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0367496","name":"Don Harvey","idIMDB":"nm0367496"},"actorId":"nm0367496","character":"Kasansky","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lydia Hull","urlProfile":"http://www.imdb.com/name/nm1055590","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1Nzg3ODIxOV5BMl5BanBnXkFtZTgwMDY5NzA4NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Lydia Hull is an actress, known for Escape Plan (2013), Van Wilder: Party Liaison (2002) and Heist (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1Nzg3ODIxOV5BMl5BanBnXkFtZTgwMDY5NzA4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1055590","name":"Lydia Hull","idIMDB":"nm1055590"},"actorId":"nm1055590","character":"Stacey","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3480796","urlIMDB":"http://www.imdb.com/title/tt3480796","business":{"budget":{"money":"$10,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":["Digital (Digital Cinema Package DCP)"]},"rating":"4.2","metascore":"17","filmingLocations":[{"location":"Mobile, Alabama, USA"}],"rated":"R","awards":[],"votes":"12,423","type":"Movie","companyCreditsSimple":[{"idCompany":"co0017712","name":"Emmett/Furla/Oasis Films (EFO Films)"},{"idCompany":"co0224058","name":"K5 International"},{"idCompany":"co0265611","name":"Aperture Entertainment"}],"keywords":{"keywords":["resort","mercenary","escape","violence","policewoman","title at the end","one word title","action hero","one man army","tough guy","anti hero","cynicism","riot","sexual fantasy","bare breasts","disarming someone","sabotage","woman kills a man","fire","genetic engineering","pier","race against time","falling from height","falling down stairs","ambush","pistol whip","scientist","drawing","threatened with a knife","black comedy","knife","interview","deception","fake identity","jumping through a window","jumping from height","electrocution","repressed memory","flashlight","crime scene","slow motion scene","shot to death","shot in the chest","shot in the back","shot in the shoulder","shot in the head","character's point of view camera shot","subjective camera","drunkenness","bartender","police corruption","police station","police captain","police detective","detective","police","lasersight","innocent person killed","police brutality","maverick cop","tracking device","handcuffs","arrest","f word","map","hit by a car","body landing on a car","armored car","futuristic","megacorporation","fight the system","social commentary","strangulation","artificial intelligence","tied to a chair","tied to a bed","sadist","topless female nudity","newscast","strip club","nightclub","grenade launcher","foot chase","chase","machine gun","pistol","security guard","surveillance","cover up","fugitive","computer hacker","computer cracker","entrepreneur","ceo","newspaper clipping","news report","photograph","engineer","nurse","doctor","memory implant","flashback","female bartender","rescue","hostage","kidnapping","held at gunpoint","attempted rape","rapist","rape","hedonism","death","abandoned shopping mall","brawl","fight","fistfight","beating","gunfight","existentialism","science runs amok","robot","sexbot","animosity","violent fantasy","investigation","no rules","android","shootout","best friend","commercial","curfew","simulation","bank robbery","cyberpunk","hacker","revenge","toothpick","corruption","manhunt","giving in","high tech","explosion","rude awakening","lesbian kiss","gunned down","bar","lookalike","dead wife","abandoned church","on the run","assault","strangled to death","murder","profanity","topless","near future","tough cop","memory alteration","humanoid robot","drinking","cyborg","low budget film","death of friend","independent film","title spoken by character","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 03:52:26"}}