{"data":{"movies":[{"title":"Almost Home","originalTitle":"","year":"2014","releaseDate":"20140307","directors":[{"name":"Todd Wilderman","id":"nm1392282"}],"writers":[{"name":"Adam Rex","id":"nm5199482"}],"runtime":"4 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MzU2ZWItODc5ZS00N2Q2LWE5NGQtYmE5NTdkNTZkNWQxXkEyXkFqcGdeQXVyMjExNjgyMTc@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Short","Comedy","Family","Sci-Fi"],"plot":"A group of aliens searching for a new planet on which to make home, with little success. Promotional short for Dreamworks Animation's forthcoming feature, Home.","simplePlot":"A group of aliens searching for a new planet on which to make home, with little success. Promotional short for Dreamworks Animation's forthcoming feature, Home.","actors":[{"actorName":"Steve Martin","urlProfile":"http://www.imdb.com/name/nm0000188","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY0ODYwNDM3OV5BMl5BanBnXkFtZTcwMTc3NjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1945","placeOfBirth":" Waco, Texas, USA","birthName":"Stephen Glenn Martin","height":"6' (1.83 m)","bio":"Steve Martin was born on August 14, 1945 in Waco, Texas, USA as Stephen Glenn Martin to Mary Lee (née Stewart; 1913-2002) and Glenn Vernon Martin (1914-1997), a real estate salesman and aspiring actor. He was raised in Inglewood and Garden Grove in California. In 1960, he got a job at the Magic shop of Disney's Fantasyland, and while there he learned magic, juggling, and creating balloon animals. At Santa Ana College, he took classes in drama and English poetry. He also took part in comedies and other productions at the Bird Cage Theatre, and joined a comedy troupe at Knott's Berry Farm. He attended California State University as a philosophy major, but in 1967 transferred to UCLA as a theatre major. His writing career began on The Smothers Brothers Comedy Hour (1967), winning him an Emmy Award. Between 1967 and 1973, he also wrote for many other shows, including The Glen Campbell Goodtime Hour (1969) and The Sonny and Cher Comedy Hour (1971). He also appeared on talk shows and comedy shows in the late 1960s and early 1970s. In 1972, he first appeared on The Tonight Show Starring Johnny Carson (1962), doing stand-up several times each year, and even guest hosting a few years later. In 1976, he served for the first time as guest-host on Saturday Night Live (1975). By 2016, he has guest-hosted 15 times, which is one less than Alec Baldwin's record, and also appeared 12 other times on SNL. In 1977, he released his first comedy album, a platinum selling \"Let's Get Small\". He followed it with \"A Wild and Crazy Guy\" (1978), which sold more than a million copies. Both albums went on to win Grammys for Best Comedy Recording. This is when he performed in arenas in front of tens of thousands of people, and begun his movie career, which was always his goal. His first major role was in the short film, The Absent-Minded Waiter (1977), which he also wrote. His star value was established in The Jerk (1979), which was co-written by Martin, and directed by Carl Reiner. The film earned more than $100 million on a $4 million budget. He also starred in Dead Men Don't Wear Plaid (1982), The Man with Two Brains (1983), and All of Me (1984), all directed by Reiner. To avoid being typecast as a comedian, he wanted do more dramatic roles, starring in Pennies from Heaven (1981), a film remake of Dennis Potter's 1978 series. Unfortunately, it was a financial failure. He also starred in John Landis's ¡Three Amigos! (1986), co-written by himself, opposite Martin Short and Chevy Chase. That year, he also appeared in the musical horror comedy, Little Shop of Horrors (1986) opposite Rick Moranis. Next year, he starred in Roxanne (1987), co-written by himself, and in John Hughes' Planes, Trains & Automobiles (1987), opposite John Candy. His other films include Parenthood (1989) and My Blue Heaven (1990), both opposite Moranis. In 1991, he wrote and starred in L.A. Story (1991), about a weatherman who searches meaning in his life and love in Los Angeles. It also starred his then-wife, Victoria Tennant. Same year, Father of the Bride (1991) was so successful that a 1995 sequel followed. During the 1990s, he continued to play more dramatic roles, in Grand Canyon (1991), playing a traumatized movie producer, in Leap of Faith (1992), playing a fake faith healer, in A Simple Twist of Fate (1994), playing a betrayed man adopting a baby, and in David Mamet's thriller The Spanish Prisoner (1997). Other, more comedic roles include in HouseSitter (1992) and The Out-of-Towners (1999), opposite Goldie Hawn, in Nora Ephron's Mixed Nuts (1994), and in Bowfinger (1999), written by himself and co-starring Eddie Murphy. After Bowfinger, he starred in Bringing Down the House (2003) and Cheaper by the Dozen (2003), both earning more than $130 million. He wrote and starred in Shopgirl (2005), and appeared in the sequel of Cheaper by the Dozen. After them, he appeared in The Pink Panther (2006) and The Pink Panther 2 (2009), which he both co-wrote, as Inspector Clouseau. He continues to do movies, more recently appearing in The Big Year (2011), Home (2015), and Love the Coopers (2015). Besides aforementioned, he has been an avid art collector since 1968, written plays, written for The New Yorker, written a well-received memoir (Born Standing Up), written a novel (An Object of Beauty; 2010), hosted the Academy Awards three times, released a Grammy award winning music album (The Crow: New Songs for the 5-String Banjo; 2009), and another album (Love Has Come For You; 2013) with Edie Brickell. Since 2007, he has been married to Anne Stringfield, with whom he has a daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY0ODYwNDM3OV5BMl5BanBnXkFtZTcwMTc3NjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000188","name":"Steve Martin","idIMDB":"nm0000188"},"actorId":"nm0000188","character":"Captain Smek","urlCharacter":"http://www.imdb.com/character/ch0505903","main":true},{"actorName":"Tom McGrath","urlProfile":"http://www.imdb.com/name/nm0569891","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzU4NjU0MDEyNF5BMl5BanBnXkFtZTcwMjY0MzUwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1964","placeOfBirth":" Lynwood, Washington, USA","bio":"Born on August 7, 1964. Hometown is Lynnwood, Washington. Most popular as Skipper of Madagascar movies & the TV show, Penguins Of Madagascar & was a voice actor for Shrek 3 as Gary, Monsters vs Aliens as Wilson, Megamind as Lord Scott, & a bit part in Puss In Boots as a bar thief as well as being a director, layout & storyboard artist for numerous other animated movies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzU4NjU0MDEyNF5BMl5BanBnXkFtZTcwMjY0MzUwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0569891","name":"Tom McGrath","nicknames":["Box","Pismo"],"idIMDB":"nm0569891"},"actorId":"nm0569891","character":"Jeff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Soren","urlProfile":"http://www.imdb.com/name/nm1659741","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmQyYWUyMjQtZTcxYS00ODBiLWE3ZTUtM2E2MzkyYWMxMmU4XkEyXkFqcGdeQXVyMTU2MTcxMzg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"David Soren is a director, writer, and actor known for Captain Underpants (2017), Turbo (2013), and Merry Madagascar (2009). A DreamWorks veteran of twenty years, Soren has worked as a story artist on \"The Road to El Dorado,\" \"Chicken Run\" and \"Shrek.\" He then served as the head of story on the hit animated comedy, \"Shark Tale.\" Soren joined DreamWorks after graduating from Sheridan College, located near his hometown of Toronto, Canada.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmQyYWUyMjQtZTcxYS00ODBiLWE3ZTUtM2E2MzkyYWMxMmU4XkEyXkFqcGdeQXVyMTU2MTcxMzg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1659741","name":"David Soren","idIMDB":"nm1659741"},"actorId":"nm1659741","character":"Ernie","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3597380","urlIMDB":"http://www.imdb.com/title/tt3597380","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["4 min"],"soundMix":null,"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.7","filmingLocations":[],"rated":"G","awards":[],"votes":"400","type":"Movie","companyCreditsSimple":[{"idCompany":"co0129164","name":"DreamWorks Animation"}],"keywords":{"keywords":["cgi animation","3 dimensional"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 06:30:27"}}