{"data":{"movies":[{"title":"A Novel Romance","originalTitle":"","year":"2015","releaseDate":"20150110","directors":[{"name":"Mark Griffiths","id":"nm0341716"}],"writers":[{"name":"Beverly Nuako","id":"nm2350794"},{"name":"Hanz Wasserburger","id":"nm2313590"}],"runtime":"86 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMTk4NzQ2OV5BMl5BanBnXkFtZTgwNTY0ODM0NDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Family","Romance"],"plot":"Liam, a big hit novelist hits a writer's block for his next work. He takes a break in Portland, where he falls for the journalist-cum-book critic Sophie. Considering Sophie's past , rough love life with a celebrity sports star, Liam keeps his identity concealed. But can he keep it secret forever.","simplePlot":"A best-selling romance novelist moves to Portland to cure his writer's block and unknowingly falls in love with his biggest critic. When their true identities are revealed, they have to find the courage and take a leap of faith.","actors":[{"actorName":"Amy Acker","urlProfile":"http://www.imdb.com/name/nm0009918","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNjg5Mzc0MV5BMl5BanBnXkFtZTcwODg0NTM2OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 December 1976","placeOfBirth":" Dallas, Texas, USA","birthName":"Amy Louise Acker","height":"5' 8\" (1.73 m)","bio":"Born and raised in Dallas, Texas where she graduated Lake Highlands High School, Amy Acker is the oldest of four children; she has two sisters and one brother. An acting major at Southern Methodist University, Amy acted in several college theater productions. She appeared in various roles during the fantasy segments for the popular award-winning children's TV series Wishbone (1995), which was filmed in Texas and consisted of Dallas theater actors. Upon graduation she worked in Wisconsin and New York before winning the role of \"Fred\" on Angel (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNjg5Mzc0MV5BMl5BanBnXkFtZTcwODg0NTM2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0009918","name":"Amy Acker","idIMDB":"nm0009918"},"actorId":"nm0009918","character":"Sophie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dylan Bruce","urlProfile":"http://www.imdb.com/name/nm1851313","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMDUyMDc5N15BMl5BanBnXkFtZTgwMjEzNTUzMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 April 1980","placeOfBirth":" Vancouver, British Columbia, Canada","height":"5' 11½\" (1.82 m)","bio":"Dylan Bruce has established himself well in television. Bruce was born in Vancouver, Canada on April 21, 1980, and raised in both Vancouver and Seattle, Washington. In 2005 Bruce appeared on the mini-series 24: Conspiracy (2005), the spin-off to the original Kiefer Sutherland series 24 (2001). The spin-off lasted for only a season, but the show landed him on the cover of Variety and Bruce continued making frequent television appearances across a steady length of series. Other series in which he has appeared include episodes in the 2005 season of Passions (1999), followed by work in 2006 on Joey (2004), the mob drama The Sopranos (1999), CSI: NY (2004), and Las Vegas (2003). Bruce scored a considerable level of notability by his portrayal of Dr. Chris Hughes on the daytime drama As the World Turns (1956). From 2007-2008, Dylan played this important character, making him the eighth actor to appear in this role, following the departure of actor Bailey Chase who played Hughes from January 2003-January 2005. In 2008, Bruce ended his time on the series and once more moved on to newer projects. He made his official film debut with the fast-paced action outing Unstoppable (2010), which stars veteran actor Denzel Washington and Chris Pine. Afterwards, Dylan had a recurring role on the series The Bay (2010) before landing work in the television movie thriller Karyn l'obstinée (2012). In 2013, Dylan joined the cast of the drama series Orphan Black (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMDUyMDc5N15BMl5BanBnXkFtZTgwMjEzNTUzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1851313","name":"Dylan Bruce","idIMDB":"nm1851313"},"actorId":"nm1851313","character":"Liam","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles S. Dutton","urlProfile":"http://www.imdb.com/name/nm0001165","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MTc0MDA2Nl5BMl5BanBnXkFtZTcwODY4Njg2Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 January 1951","placeOfBirth":" Baltimore, Maryland, USA","birthName":"Charles Stanley Dutton","height":"5' 9\" (1.75 m)","bio":"Charles S. Dutton was born on January 30, 1951 in Baltimore, Maryland, USA as Charles Stanley Dutton. He is an actor and producer, known for Alien 3 (1992), Gothika (2003) and Roc (1991). He was previously married to Debbi Morgan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MTc0MDA2Nl5BMl5BanBnXkFtZTcwODY4Njg2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001165","name":"Charles S. Dutton","nicknames":["Roc"],"idIMDB":"nm0001165"},"actorId":"nm0001165","character":"Harris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Camille Mitchell","urlProfile":"http://www.imdb.com/name/nm0593193","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MDE0NzgyNV5BMl5BanBnXkFtZTgwOTk3NjYzNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 March 1954","placeOfBirth":" Santa Monica, California, USA","birthName":"Camille Janclaire Mitchell","bio":"Camille Mitchell has garnered extraordinary acclaim for her versatility onstage and onscreen. A leading lady at the Stratford and Shaw festivals, The London Times hailed her as \"a gift to the theater.\" In 2011, she appeared as Mrs. Robinson in \"The Graduate\" at Vancouver's Arts Club Theatre. For her television role as tough-talking Sheriff Nancy Adams on Warner Brothers' Smallville (2001) over five seasons, she was nominated for the Leo Award for Best Supporting Performance by a Female in a Dramatic Series. Other recurring roles on television include Evelyn on \"Life Unexpected\"(2010); Becca in \"The L Word\"; the spiritual Ingrid Rayne on Poltergeist, les aventuriers du surnaturel (1996) for Showtime and the hyper model's agent Roxanne on Madison (1993) for CTV. Other guest-star roles include Vesta on \"Caprica\" (2010) with Eric Stoltz;The Chris Isaak Show (2001) (MuchMoreMusic), Les chemins de l'étrange (2000) (PAX/NBC), _\"The Outer Limits\" (1995)with Julie Harris_ (Showtime), and _\"Peacemakers\" (2003)with Tom Berenger_ (USA). Films include \"Concrete Blondes\"(2012) with Jonathan Rhy-Davies and \"Frankie and Hazel\" with Joan Plowright and Micah Barnes. She won Canada's Jessie Award for her portrayal of Ariel in Shakespeare's \"The Tempest\" opposite Gordon Pinsent at the Vancouver Playhouse and was also nominated for Best Actress Awards for Blanche in \"A Streetcar Named Desire,\" Madame Tourvel in \"Les Liaisons Dangereuses,\" and Elizabeth in \"The Crucible.\" Born in Santa Monica to Hollywood star Cameron Mitchell and Viennese actress Camille Janclaire, Camille was raised in Vancouver, Canada, and studied at the Central School of Speech and Drama in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2MDE0NzgyNV5BMl5BanBnXkFtZTgwOTk3NjYzNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0593193","name":"Camille Mitchell","idIMDB":"nm0593193"},"actorId":"nm0593193","character":"Jackie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tammy Gillis","urlProfile":"http://www.imdb.com/name/nm0319320","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGFjMTY3NDUtNDZiYS00YjZlLTg1ZDctZGM5YTgyZWM4NDRkXkEyXkFqcGdeQXVyMjUyNzM0MzQ@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"bio":"Tammy Gillis grew up in rural Manitoba, acting from a young age, playing a variety of roles in school plays. After high school, she went on to study at the University of Manitoba, where she was discovered by a modeling scout and cast in both a series of commercial for Greenkids and the award-winning short film \"Heart of the World\", directed by one of Canada's most celebrated filmmakers Guy Maddin. Since then, Tammy has added over 50 credits to her name and recently won the award for Best Actress at the Noida International Film Festival-17 in Delhi India for her performance in \"Menorca\". She was nominated for a 2016 Leo Award for Best Guest Performance by a Female for her work in \"Ties That Bind\" (also known as \"Detective McLean\") (UpTV). Upcoming appearances include her starring role in the feature film \"Menorca\" (Farpoint Films) which had its World Premiere at the Whistler Film Festival. \"Menorca\" will screening at the Cinequest Film Festival in March and then hitting Canadian theatres in April 2017. Tammy will also be seen in the thriller \"Tiny House of Horror\" (Lifetime), the popular \"Murder She Baked\" series (Hallmark Movies & Mystery), as well as a recurring role on the new E! Network series \"The Arrangement\" and a leading role in the comedic feature film \"Thirty-Seventeen\" (Hadron Films). Tammy has made guest appearances on ABC's \"Motive\", Bravo's \"Girlfriend's Guide To Divorce\", ABC's \"Once Upon A Time\", The CW's \"Supernatural\", SyFy's \"Lost Girl\", Spike TV's \"Blue Mountain State\" and many more. She has recurred on HBO's \"Less Than Kind\", CBC's \"jPod\" and Hallmark's \"Signed Sealed Delivered\". Some of her feature credits include Patrick Lussier's \"White Noise 2: The Light\", Antoine Fuqua's \"Shooter\" and Mark Sawers' \"No Men Beyond This Point\". A Hallmark Channel favourite, she had a leading role in one of Hallmark's highest rated movies \"Unleashing Mr. Darcy\", as well as leading roles in \"Wedding Bells\", \"A Novel Romance\" and \"Stolen from the Womb\" (Lifetime). She also acted in, produced, and directed \"The Support Group\", an original web comedy series. Divvying up her time among Vancouver, the east coast of Canada and Los Angeles, Tammy is a very diverse and talented actress who brings years of entertainment industry experience to the table. A well respected member of the community, she served as a jury member for the Canadian Screen Awards for the past couple of years. Tammy also volunteers as a mentor in the Women In Film & Television actor-mentorship program.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGFjMTY3NDUtNDZiYS00YjZlLTg1ZDctZGM5YTgyZWM4NDRkXkEyXkFqcGdeQXVyMjUyNzM0MzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0319320","name":"Tammy Gillis","idIMDB":"nm0319320"},"actorId":"nm0319320","character":"Nina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Casey Manderson","urlProfile":"http://www.imdb.com/name/nm2788169","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNjk0Mjc0M15BMl5BanBnXkFtZTgwOTU3NzMwOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Casey Manderson is an actor and producer, known for When Life Was Good (2008), The Red Rooster (2009) and Dirty Bill of Health (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNjk0Mjc0M15BMl5BanBnXkFtZTgwOTU3NzMwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2788169","name":"Casey Manderson","idIMDB":"nm2788169"},"actorId":"nm2788169","character":"Drew Clayton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Milo Shandel","urlProfile":"http://www.imdb.com/name/nm4215448","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyODgzNDE5Ml5BMl5BanBnXkFtZTcwMjAyMjQ5OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Milo Shandel is a well-respected actor and director. He is perhaps best known as the hapless 'Principal Tater' on the YTV/Disney XD hit youth sitcom Mr.Young, for which he was nominated 3 consecutive years for the Leo Award for best performance in a program for youth or children. Most recently, he has begun a busy directing career on shows such as YTV and NETFLIX's Some Assembly Required, and YTV's The Stanley Dynamic. He also directed the festival fave short, Hipster Brunch. He began his career in the theatre, having performed on stages throughout The US, Canada, and even Mexico in everything from Shakespeare to ABBA; hundreds-of-thousands were entertained by his 6-year run as Bill Austin 'The Awesome Aussie' in the North American Tour of Mamma Mia! Milo also spent time at The Startford Festival in Ontario appearing in Macbeth, The Merry Wives of Windsor, and Amadeus. Other stage credits include: Hairspray (Arts Club-Vancouver), Disney's Beauty and the Beast (Toronto), Six Degrees of Separation (Canstage-Toronto), and Forbidden Hollywood (Toronto, West Palm Beach, FL) He and his wife, actress and writer Christine Oddy, live in Vancouver and have three wonderful sons.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyODgzNDE5Ml5BMl5BanBnXkFtZTcwMjAyMjQ5OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm4215448","name":"Milo Shandel","idIMDB":"nm4215448"},"actorId":"nm4215448","character":"Phil Berkman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emily Tennant","urlProfile":"http://www.imdb.com/name/nm0855045","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDAxNjc0MWYtMDViYy00NDhkLWI3OWItOWIxY2RmOWNkNGY5L2ltYWdlXkEyXkFqcGdeQXVyMDkxNjY4Mw@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1990","placeOfBirth":" Vancouver, British Columbia, Canada","height":"5' 2\" (1.57 m)","bio":"Emily Tennant was born on August 9, 1990 in Vancouver, British Columbia, Canada. She is an actress, known for Motive (2013), Mr. Young (2011) and USS Indianapolis: Men of Courage (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDAxNjc0MWYtMDViYy00NDhkLWI3OWItOWIxY2RmOWNkNGY5L2ltYWdlXkEyXkFqcGdeQXVyMDkxNjY4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0855045","name":"Emily Tennant","idIMDB":"nm0855045"},"actorId":"nm0855045","character":"Tabitha","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alisson Amigo","urlProfile":"http://www.imdb.com/name/nm2589834","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ2NDQ3NTgzMF5BMl5BanBnXkFtZTgwMzM5OTE3OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Alisson Amigo is known for her work on Just in Time for Christmas (2015), Todd and the Book of Pure Evil (2010) and L'escapade de Noel (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ2NDQ3NTgzMF5BMl5BanBnXkFtZTgwMzM5OTE3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2589834","name":"Alisson Amigo","idIMDB":"nm2589834"},"actorId":"nm2589834","character":"Flight Attendant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matt Hamilton","urlProfile":"http://www.imdb.com/name/nm3788481","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMjMzNTQxNV5BMl5BanBnXkFtZTgwMDAxMTg0MDI@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Matt Hamilton graduated from Vancouver Film School for Writing for Film and Television and has his B.F.A in Writing from the University of Victoria. His screen writing has placed in numerous contests and festivals including Praxis Fellowship, CS Creative Screenwriting Open, Scriptoid Television Contest Top 3 Winner, Sunscreen Film Festival, Big Rock Eddies, Vancouver Web Fest, Hollyweb Film Festival, and the Leo Awards. He was 2015 Leo Award Best Actor nominee for his role in The Actress Diaries, which was also nominated for Best Web Series. He won Best Performance for The Fence at the Sunscreen Film Festival. He was born and raised in Victoria, BC and currently resides in Vancouver, BC.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMjMzNTQxNV5BMl5BanBnXkFtZTgwMDAxMTg0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3788481","name":"Matt Hamilton","idIMDB":"nm3788481"},"actorId":"nm3788481","character":"James","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Meneer","urlProfile":"http://www.imdb.com/name/nm6061567","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NzIzMjA0MV5BMl5BanBnXkFtZTgwNDcxNTAxODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Michael Meneer is an American-born film and television actor based in Vancouver, British Columbia. He also provides U.S. political commentary on local media and is contributing correspondent to the series Conversations That Matter. Michael earned degrees from The Ohio State University and American University. He has studied the Meisner Technique at the Actorium in Vancouver and on-camera technique with James Kot of Andrew McIlroy & Associates.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NzIzMjA0MV5BMl5BanBnXkFtZTgwNDcxNTAxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm6061567","name":"Michael Meneer","idIMDB":"nm6061567"},"actorId":"nm6061567","character":"Reporter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maria J. Cruz","urlProfile":"http://www.imdb.com/name/nm1043259","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyMTk4ODM5NF5BMl5BanBnXkFtZTgwOTkwNjIzNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Maria J. Cruz is a born and raised Vancouver, BC actor. She booked her first professional theatre gig while attending her final year of the University of British Columbia's Theatre program. As \"Tina\", in 'Tony 'n' Tina's Wedding', Vancouver's longest running stage play, she was married hundreds of times to over a half a dozen different \"Tony's\" and has gone onto play the independent stages of Vancouver and Toronto, including the iconic Second City. She lives best in acerbic comedic roles and the Classics - having had several favourable reviews in Restoration plays. Taking some time off shortly after the new millennium to obtain her Masters degree in Museum studies, she returned to her first love of acting over 6 years ago and plans to \"stay on the bus\". This year Maria had the opportunity to perform her one-woman stage play (in her native Portuguese and English) in the middle of the Atlantic at the 'Azores International Fringe Festival'. She is looking forward to taking on the role of creator, producer and actor in SMAK!Productions independent Feature Film, 'The Parties'.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQyMTk4ODM5NF5BMl5BanBnXkFtZTgwOTkwNjIzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1043259","name":"Maria J. Cruz","idIMDB":"nm1043259"},"actorId":"nm1043259","character":"Female Passenger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michelle Martin","urlProfile":"http://www.imdb.com/name/nm5004614","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0OTQxNDc3Ml5BMl5BanBnXkFtZTgwMzc1NzgwNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Michelle is an actor and producer who has worked extensively across Canada. Film and television credits include Frequency, Dead of Summer, The Romeo Section, The Whispers, Supernatural, A Novel Romance, Accidental Obsession, Traders on CTV, and two seasons as a series lead on the CBC evening drama, Riverdale. Michelle also completed the independent feature film, Backroads, which screened at the Sundance Film Festival and the short film Sleepwalk, which won the Audience Choice Award at the New York City Short Horror Film Festival. Michelle is an accomplished theatre actor. She is a founding member, producer and Marketing & Communications Director of Classic Chic Productions. www.classicchic.ca She played Tom Hagen in Classic Chic's production of Corleone: The Shakespearean Godfather at Pacific Theatre and Ricky Roma in David Mamet's Glengarry Glen Ross. She was also thrilled to play the tortured Antigonus in The Winter's Tale directed by Lisa Wolpe, Artistic Director, Los Angeles Women's Shakespeare Company. Michelle played the title role in Daniel MacIvor's one-woman show, See Bob Run, at One Yellow Rabbit Performance Theatre in Calgary and Workshop West Theatre in Edmonton. Both of these companies also presented her own acclaimed one-woman show, To Hear With Eyes, in their main stage seasons. Other selected theatre credits include Colette in Four Dogs and a Bone (Egg Theatre), Les Liaisons Dangereuses and A Christmas Carol (Theatre Calgary), The Importance of Being Earnest and Fool for Love (Theatre Junction), Cressida (Workshop West), Misalliance and Night Must Fall (Shaw Festival), 1-900-Dee-Lite (Persephone Theatre), All in the Timing (Summer at the Roxy), Hitting Town (Alchemy Theatre Projects), Cymbeline (Shakespeare in the Rough), Twelfth Night (University of Toronto, Graduate Centre for Drama) and Summerfolk (Equity Showcase Theatre). Michelle graduated from York University with a Bachelor of Fine Arts.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0OTQxNDc3Ml5BMl5BanBnXkFtZTgwMzc1NzgwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm5004614","name":"Michelle Martin","idIMDB":"nm5004614"},"actorId":"nm5004614","character":"Woman Fan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nathaniel Tenenbaum","urlProfile":"http://www.imdb.com/name/nm3228173","urlPhoto":"","biography":{"bio":"Nathaniel Tenenbaum is known for his work on A Novel Romance (2015), A Series of Unfortunate Events (2017) and Cats & Dogs: The Revenge of Kitty Galore (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3228173","name":"Nathaniel Tenenbaum","idIMDB":"nm3228173"},"actorId":"nm3228173","character":"Young Liam","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rebecca Georgelin","urlProfile":"http://www.imdb.com/name/nm6525160","urlPhoto":"","biography":{"height":"5' 4\" (1.63 m)","bio":"Rebecca Georgelin is an actress, known for Fifty Shades of Grey (2015), A Novel Romance (2015) and Tomorrowland (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm6525160","name":"Rebecca Georgelin","idIMDB":"nm6525160"},"actorId":"nm6525160","character":"Woman Fan","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3783746","urlIMDB":"http://www.imdb.com/title/tt3783746","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 26 min (86 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["16:9 HD"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.4","filmingLocations":[{"location":"Meadow Gardens Golf Club, Pitt Meadows, British Columbia, Canada"}],"rated":"TV-G","awards":[],"votes":"1,380","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0522882","name":"Write Man Films"},{"idCompany":"co0180696","name":"Larkin-Goldstein Productions"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 04:07:58"}}