{"data":{"movies":[{"title":"Hello Ladies: The Movie","originalTitle":"","year":"2014","releaseDate":"20141122","directors":[{"name":"Stephen Merchant","id":"nm0580351"}],"writers":[{"name":"Stephen Merchant","id":"nm0580351"},{"name":"Gene Stupnitsky","id":"nm1969144"}],"runtime":"85 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5MjYxMjkwOV5BMl5BanBnXkFtZTgwODE3MjY0MzE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"When Stuart learns that his British ex girlfriend is planning to visit Los Angeles with her husband, he sets out to impress them with his glamorous lifestyle, enlisting a Russian model he has just met to play the role of his beautiful girlfriend. What could go wrong?","simplePlot":"Stuart has recently split up with his girlfriend. When his girlfriend comes to visit LA, Stuart pretends to have a relationship with his tenant to make his ex feel jealous.","actors":[{"actorName":"Stephen Merchant","urlProfile":"http://www.imdb.com/name/nm0580351","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNzIwNjcxNV5BMl5BanBnXkFtZTcwOTQzMDQ1NA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 November 1974","placeOfBirth":" Bristol, England, UK","height":"6' 7\" (2.01 m)","bio":"Stephen Merchant was born on November 24, 1974 in Bristol, England. He is a writer and producer, known for The Office (2005), Cemetery Junction (2010) and The Ricky Gervais Show (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNzIwNjcxNV5BMl5BanBnXkFtZTcwOTQzMDQ1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0580351","name":"Stephen Merchant","nicknames":["Smerch","Spud"],"idIMDB":"nm0580351"},"actorId":"nm0580351","character":"Stuart","urlCharacter":"http://www.imdb.com/character/ch0526408","main":true},{"actorName":"Christine Woods","urlProfile":"http://www.imdb.com/name/nm2147876","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzMjI0NzgzMDleQTJeQWpwZ15BbWU4MDY1ODE2NzYx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 September 1983","placeOfBirth":" Lake Forest, California, USA","birthName":"Christine Elizabeth Woods","height":"5' 6\" (1.68 m)","bio":"Christine Woods was born on September 3, 1983 in Lake Forest, California, USA as Christine Elizabeth Woods. She is an actress, known for Hello Ladies (2013), Perfect Couples (2010) and Flashforward (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzMjI0NzgzMDleQTJeQWpwZ15BbWU4MDY1ODE2NzYx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2147876","name":"Christine Woods","idIMDB":"nm2147876"},"actorId":"nm2147876","character":"Jessica","urlCharacter":"http://www.imdb.com/character/ch0405385","main":true},{"actorName":"Nate Torrence","urlProfile":"http://www.imdb.com/name/nm1535594","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3ODg4NjI2M15BMl5BanBnXkFtZTcwMjcyMjY2OA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 December 1977","placeOfBirth":" Canton, Ohio, USA","birthName":"Nathan Andrew Torrence","height":"5' 8½\" (1.74 m)","bio":"Nate Torrence was born on December 1, 1977 in Canton, Ohio, USA as Nathan Andrew Torrence. He is an actor and producer, known for Zootopia (2016), She's Out of My League (2010) and Get Smart (2008). He is married to Christie Mullet. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3ODg4NjI2M15BMl5BanBnXkFtZTcwMjcyMjY2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1535594","name":"Nate Torrence","idIMDB":"nm1535594"},"actorId":"nm1535594","character":"Wade","urlCharacter":"http://www.imdb.com/character/ch0390743","main":true},{"actorName":"Kevin Weisman","urlProfile":"http://www.imdb.com/name/nm0918858","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4OTk0OTI5NV5BMl5BanBnXkFtZTcwMDc5MzIxOA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1970","placeOfBirth":" Los Angeles, California, USA","height":"5' 8\" (1.73 m)","bio":"Kevin Weisman is internationally known for his work as \"Marshall Flinkman\" on the ABC series 'Alias', which ran for five critically acclaimed seasons. TV Guide named Kevin one of television's \"Top Ten Scene Stealers\", and he appeared on Entertainment Weekly's \"Must List\" in 2006. Recently, Kevin appeared as series regular \"Kives\" on Stephen Merchant's two time Emmy nominated HBO comedy series, 'Hello Ladies' (TV.com named Kevin one of the ten best new characters in the fall, 2013 television season), as well as recurring characters \"Dr. Jeffrey Maynard\" on NBC's 'The Blacklist', \"Ray Spiewack\" on 'Scorpion' (CBS), and a memorable turn as \"Stevie\" in the critically acclaimed series, 'Better call Saul' on AMC. He will recur as \"Ned Berring\" in the upcoming first season of the David Kelly/Jonathan Shapiro drama, \"Goliath\", opposite academy award winners, Billy Bob Thornton and William Hurt, as well as Molly Parker, Nina Arianda and Maria Bello. \"Goliath\" premieres in the fall of 2016 on Amazon. Kevin received a BA from Ucla's school of Theatre/Film/Television and studied at New York's Circle in the Square Theater. In the spring of 2014, Kevin appeared as the title character, Francios Villon, in Murray Mednick's world premiere play, 'Villon', at the Odyssey Theater in Los Angeles (Stage Raw nomination for 'Best leading male performance 2014') Kevin has worked extensively in the theater, recently at the La Mirada Theater for Performing Arts, where he appeared as 'Gabe' in Donald Margulies' Pulitzer prize winning play, \"Dinner with Friends\", and as 'Uncle Louie' in Neil Simon's Pulitzer prize winning \"Lost in Yonkers\". A founding member of the award-winning and critically acclaimed Buffalo Nights Theatre Company, Kevin has served as an actor and producer on numerous productions. He starred as Griffith J. Griffith in the award- winning \"Crazy Drunk\" at the John Anson Ford Theatre. He also appeared in the title role in Arthur Schnitzler's \"Anatol,\" Jean Giraudoux's \"Apollo of Bellac,\" which received a Garland for Production of the Year and seven LA Weekly award nominations, Archibald McCleish's \"J.B.,\" \"Suburban Motel,\" Arthur Miller's \"Incident at Vichy,\" Oscar Wilde's \"Salome\" and the West Coast premiere of Jonathon Marc Sherman's \"Sophistry.\" Additional theatre credits include \"Tis Pity She's a Whore,\" \"The Greeks,\" which received the LA Weekly 2000 Production of the Year Award, and \"The Goldoni Trilogy\" at the Mark Taper. Since finishing 'Alias', Weisman has worked with esteemed director Rob Reiner on 'Flipped', reunited with JJ Abrams and Jeff Pinkner on 'Fringe', and with Anthony Zuiker on all three installments of 'CSI', in addition to Zuiker's New York Times Best Selling dig novel, 'Level 26'. Recent television projects include the Emmy nominated 'Better Call Saul', recurring roles as Dr. Jeffrey Maynard on NBC's 'The Blacklist', Ray Spiewack in season 2 of 'Scorpion' on CBS, and simultaneously playing both the mysterious 'Mr. Blonde' and the straight shooting, intense 'Detective Hawkins' on NBC's critically acclaimed drama, \"Awake\". Other work includes, the duplicitous fight promoter on 'Kingdom' (Audience Network/Direct TV), the mad genius, Martin Gleason, on 'Human Target' (Fox), the villainous poisoner, Reardon Payne on 'Chuck' (NBC), Joseph Feller on 'Fringe' (FOX), Additional television credits include 'Felicity', 'Roswell', 'Buffy the Vampire Slayer' (as fan favorite 'Dreg', Glory's right-hand minion), 'The X-Files' (in a memorable season 7 episode entitled \"Je Souhaite'), 'Frasier', 'E.R.' 'CSI', CSI: New York, CSI: Miami, 'The Forgotten' (ABC), 'Numbers' (CBS), 'Fairly Legal (USA), and 'October Road (ABC). Kevin also portrayed Steve Balfour, the 'sarcastic cameraman', on the cult hit, 'Moonlight' starring Alec O'Loughlin (CBS). '. Kevin's recent film work includes 'Flipped', the Rob Reiner-directed feature adaptation of Wendelin Van Draanen's young adult novel, which revolves around the confusing romantic developments of 2 young neighbors as they age from 7 to 13. Aidan Quinn and Penelope Ann Miller play the girl's parents, and Weisman plays her mentally-challenged uncle. He also stars in the independent horror film, 'Undocumented' (playing a member of a documentary crew that is captured by a gang of sadistic radicals while accompanying a group of illegal immigrants crossing the border), as well as 'The Trust', starring Nicholas Cage and Elijah Wood. Previous film work includes Michael Bay's 'Gone in Sixty Seconds', 'Robbers', 'Buying the Cow', Disney's 'Space Buddies', B.O.H.I.C.A., (2008 Winner of Special Jury Award at the WorldFest-Houston Intl. Film Festival and Audience Award at the Newport Intl. Film Festival), 'Man of the Century', the 1998 Slamdance Audience Award winner, and 'Clerks 2', Kevin Smith's cult classic which featured Kevin as the very popular 'hobbit-lover'. Weisman produced and acted in the feature film Illusion, which was released at theaters in 2006. Fellow Buffalo Nights founder & Emmy winner, Michael Goorjian directed, as well as starred in the film opposite screen legend Kirk Douglas. Illusion won the \"Best Screenplay\" award at the 12th Annual Hamptons International Film Festival, and it was an official selection of the 16th Annual Palm Springs Int. Film Festival. The film also competed at the 8th Annual Sonoma Valley Film Festival, the 1st Annual Inspiration Film Festival (Santa Monica), & the Maui Film Festival. Kevin has also become quite prolific in the world of voice-over. You've probably heard his soul soothing vocal timbre on radio and television ads for such companies as Apple (Ipad), Nike, Coke, ATT, and as one of the current voices of Honda. Kevin has also been busy in the burgeoning world of Internet content, recurring in Level 26: The Dark Chronicles, written and directed by CSI franchise creator, Anthony Zuiker. Kevin was an original member of 'Trainwreck', the L.A. based band featuring Kyle Gass of Tenacious D. Weisman takes advantage of every opportunity to participate in celebrity golf, ski & poker tournaments (he is an avid player) that benefit organizations such as Tony LaRussa's Celebrities Fore! ARF (Animal Recue Foundation), The Special Olympics, The Urban Health Institute, The Melanoma Research Foundation, and The Clear View Treatment Center, which provides a residential treatment program for adolescent boys who have been neglected,, abused & abandoned. Most importantly, Kevin is the proud parent of Maya Rose (born on 3/31/06) and Eli Samuel (born on 2/11/08). Kevin is an avid supporters of numerous children's charities and Jewish organizations, including the L.A. Children's Hospital, The Children's Defense Fund, Wheels For Humanity, Bet Tzedek, a non-profit law-firm that provides free legal services to low-income, disabled & elderly residents of Los Angeles Country, and Koreh LA, a local Jewish organization that assists kids in advancing their reading skills. Particularly close to his heart is Kevin's involvement in the fight against Duchenne Muscular Dystrophy, serving as a board member of the Dmd Fund.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4OTUyMDQ2OV5BMl5BanBnXkFtZTcwNDU4OTI4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0918858","name":"Kevin Weisman","idIMDB":"nm0918858"},"actorId":"nm0918858","character":"Kives","urlCharacter":"http://www.imdb.com/character/ch0390742","main":true},{"actorName":"Kyle Mooney","urlProfile":"http://www.imdb.com/name/nm3324982","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4MTI2NTkwNzVeQTJeQWpwZ15BbWU4MDU5MzM4MDcx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 7\" (1.7 m)","bio":"Kyle Mooney is an actor and writer, known for Saturday Night Live (1975), Neighbors 2: Sorority Rising (2016) and Zoolander 2 (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4MTI2NTkwNzVeQTJeQWpwZ15BbWU4MDU5MzM4MDcx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3324982","name":"Kyle Mooney","idIMDB":"nm3324982"},"actorId":"nm3324982","character":"Rory","urlCharacter":"http://www.imdb.com/character/ch0444198","main":true},{"actorName":"Adam Campbell","urlProfile":"http://www.imdb.com/name/nm0968405","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNDM4MTQ5OV5BMl5BanBnXkFtZTgwNjY4ODkzMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1980","placeOfBirth":" Bath, Somerset, England, UK","birthName":"Adam Jones","height":"5' 7½\" (1.71 m)","bio":"Adam Campbell was born on August 19, 1980 in Bath, Somerset, England as Adam Jones. He is an actor and writer, known for Epic Movie (2007), Date Movie (2006) and The Five-Year Engagement (2012). He has been married to Jayma Mays since October 28, 2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNDM4MTQ5OV5BMl5BanBnXkFtZTgwNjY4ODkzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0968405","name":"Adam Campbell","idIMDB":"nm0968405"},"actorId":"nm0968405","character":"Mike","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carly Craig","urlProfile":"http://www.imdb.com/name/nm2092503","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDUxMDg3MjMtMTc5Ni00YTk3LThiM2UtZWY2NzgzMDI0NTVmXkEyXkFqcGdeQXVyMTA5NzIyMjU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 June 1980","placeOfBirth":" La Mesa, California, USA","birthName":"Carly Christina Craig","height":"5' 7\" (1.7 m)","bio":"Born and raised in San Diego, California, Carly comes from a large Italian-Irish family that includes two professional baseball players: her father, Rocky Craig, and little brother, Casey Craig. She has one sister and two brothers. Carly is well-known on the internet for her hilarious and disturbingly-edgy songs and improv pieces, most notably \"The Daddy Song\", and \"Judy Garland Orgasm\". Though she studied drama for years at The Stella Adler Academy, a conversation with Dan Akroyd would change her life when he suggested she study at Second City, where she later graduated. She met famed manager Bernie Brillstein while waiting tables and decided to put on a comedy show with her classmates. Bernie came to that show and soon after, signed her as a client. Before long, Director David Wain cast her in \"Role Models\" as the object of Seann William Scott's desire and the rest, as they say, is history. Other projects would include Mike Leigh's critically-lauded live show \"Ecstasy\", Neil LaBute's \"Bash\", independent feature film \"Star Sucker\" with Tom Arnold, Rob Corddry's \"Children's Hospital\", and The Farrelly Brother's \"The Heartbreak Kid.\" Carly most recently co-starred opposite Owen Wilson and Jason Sudeikis in the Farrelly Brother's film, \"Hall Pass\". Her comedic talents are highlighted in this role in a film-stealing moment in the bathroom with Jason that exemplifies the Farrelly's slapstick humor. The standout role sealed her a place as a \"Vanities Girl\" for the April 2011 edition of \"Vanity Fair\" where she follows many young ingenues like Kristen Bell, Lesly Mann and Mila Kunis. She will next be seen in the Farrelly's next feature, \"Three Stooges\", playing Mrs. Harter, the wife of Stephen Collins' character. Together the couple sets out to adopt the Stooges. The film began shooting in May 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDUxMDg3MjMtMTc5Ni00YTk3LThiM2UtZWY2NzgzMDI0NTVmXkEyXkFqcGdeQXVyMTA5NzIyMjU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2092503","name":"Carly Craig","idIMDB":"nm2092503"},"actorId":"nm2092503","character":"Carrie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Crista Flanagan","urlProfile":"http://www.imdb.com/name/nm1556400","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjMzZmQ4MGQtMmUyOS00OWY0LTk4YTUtNzdlODdjNmExYTQ2XkEyXkFqcGdeQXVyMjI3OTA1Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1976","placeOfBirth":" Mount Vernon, Illinois, USA","height":"5' 2\" (1.57 m)","bio":"Crista Flanagan was born on February 24, 1976 in the small town of Mount Vernon, Illinois. Flanagan went on to the University of Evansville in Indiana, where she received a Bachelors Degree in Theatre. She proved even greater when she received her Masters Degree from The University of California, Irvine sharpening her skills in many plays such as Oaklahoma, Fool For Love and Cat on a Hot Tin Roof. Crista's fine performance in her theatre work led to her one woman show, But Wait...I Have Impressions. She then went on to star in TV shows such as ER, The Practice and Curb Your Enthusiasum. In 2005, Flanagan became a cast member on FOX's popular late night sketch comedy show, MADtv. Currently a cast member as well as contributing writing for MADtv, Crista can also be seen on the popular pod cast series, Hope Is Emo. She portrays Hope, a 19 year old High School student on the verge of a break down because of her depression, worries and the never ending problems in her life. Crista starred in Epic Movie and Meet The Spartans and has also been featured on MTV's, You've Got A Friend, Who's A Better Castmate? and VH1's Free Radio.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjMzZmQ4MGQtMmUyOS00OWY0LTk4YTUtNzdlODdjNmExYTQ2XkEyXkFqcGdeQXVyMjI3OTA1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1556400","name":"Crista Flanagan","idIMDB":"nm1556400"},"actorId":"nm1556400","character":"Marion","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nelson Franklin","urlProfile":"http://www.imdb.com/name/nm1815689","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NDk2OTQ3N15BMl5BanBnXkFtZTgwNjE3NjAyOTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 5\" (1.96 m)","bio":"Nelson Franklin is an actor, known for Scott Pilgrim vs. the World (2010), Argo (2012) and Jobs (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NDk2OTQ3N15BMl5BanBnXkFtZTgwNjE3NjAyOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1815689","name":"Nelson Franklin","idIMDB":"nm1815689"},"actorId":"nm1815689","character":"Yogurt Director","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ryan Hansen","urlProfile":"http://www.imdb.com/name/nm1218621","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU4NDE2NjgxOF5BMl5BanBnXkFtZTgwMjQ1MTA1MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 July 1981","placeOfBirth":" San Diego, California, USA","height":"6' (1.83 m)","bio":"Ryan Hansen is an American actor. He was born in Fountain Valley, California, and raised in El Cajon, California, but has since moved with his wife, Amy Hansen, to Los Angeles. His wife is a former roommate of Kristen Bell (star of Veronica Mars (2004)). Hansen is involved in the campaign, \"Invisible Children\", and has appeared in the online series, \"The LXD\", of which 50% of the profits are going to the Invisible Children Campaign.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU4NDE2NjgxOF5BMl5BanBnXkFtZTgwMjQ1MTA1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1218621","name":"Ryan Hansen","idIMDB":"nm1218621"},"actorId":"nm1218621","character":"Pig Dream","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Hyatt","urlProfile":"http://www.imdb.com/name/nm0404924","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjU5MTg2NTcwOF5BMl5BanBnXkFtZTYwMDk4MTc3._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"height":"5' 9\" (1.75 m)","bio":"Born in England of Jamaican parents (her mother Vera an art historian and museologist and her father Charles an actor/broadcaster/comedian), Michael received her earliest education and what she considers her most formative years abroad. At the age of ten she migrated to the United States with her mother and two siblings. Living in Maryland and later Washington, DC, Michael slowly adjusted to the American way of life. She went on to study acting at Howard University for her undergraduate degree and continued at New York University's Tisch School of the Arts for her Masters. Before Michael's work in film and television she enjoyed memorable performances on stages throughout the country, most notably is her experience on Broadway in the critically acclaimed Ragtime. Although Michael is automatically considered an African-American, because of her international background she eagerly acknowledges that she is more specifically an African/British/Jamaican/American and any attempt to exclude any part of that reality would be an incorrect representation of who she truly is.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjU5MTg2NTcwOF5BMl5BanBnXkFtZTYwMDk4MTc3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0404924","name":"Michael Hyatt","idIMDB":"nm0404924"},"actorId":"nm0404924","character":"H.R. Woman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Henrietta Meire","urlProfile":"http://www.imdb.com/name/nm2068465","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDk4NTg4OTYtN2U0Zi00MjRkLWE2NjgtMjMwOWVjZDllODkyXkEyXkFqcGdeQXVyMTM5MTE1MDI@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"bio":"Henrietta Meire is an actress, known for Hello Ladies (2013), Playing It Cool (2014) and Low Down (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDk4NTg4OTYtN2U0Zi00MjRkLWE2NjgtMjMwOWVjZDllODkyXkEyXkFqcGdeQXVyMTM5MTE1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2068465","name":"Henrietta Meire","idIMDB":"nm2068465"},"actorId":"nm2068465","character":"Trudy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Allison Tolman","urlProfile":"http://www.imdb.com/name/nm2798112","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmU5ZTJmN2ItZmI0OC00NTQ3LWI0YzktMDNkNjkwNDg2OTVlL2ltYWdlXkEyXkFqcGdeQXVyMTkyNjMwNzc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1981","placeOfBirth":" Houston, Texas, USA","birthName":"Allison Cara Tolman","height":"5' 6\" (1.68 m)","bio":"Born in Sugarland, Texas, Allison Tolman earned a BFA in theatrical performance from Baylor University. After graduation, she moved to Dallas where she helped found and foster the independent ensemble based non-profit Second Thought Theatre while also learning that the whole being an adult thing is like, super hard. In 2009, she was accepted into Second City's Conservatory Training Program and later went on to write and perform sketch and satire with several groups throughout Chicago, most notably the monthly comedy podcast The City Life Supplement. Throughout her career, Tolman has played a veterinary receptionist, personal assistant, children's theatre teacher, vocal coach, phone sales associate, client services representative, and dog walker - never on film, but in her actual life in order to pay her rent and be able to afford more tank tops from Target than any human actually needs. (2014) Tolman lives in Chicago with a portly cat named Annie who enjoys staring at her blankly whenever there is a house centipede in the kitchen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmU5ZTJmN2ItZmI0OC00NTQ3LWI0YzktMDNkNjkwNDg2OTVlL2ltYWdlXkEyXkFqcGdeQXVyMTkyNjMwNzc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2798112","name":"Allison Tolman","idIMDB":"nm2798112"},"actorId":"nm2798112","character":"Kate","urlCharacter":"http://www.imdb.com/character/ch0526409","main":true},{"actorName":"Frankie Shaw","urlProfile":"http://www.imdb.com/name/nm1951390","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4OTk0MjE3Ml5BMl5BanBnXkFtZTgwNzM2MDE0NzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 6½\" (1.69 m)","bio":"Frankie grew up in Brookline, Massachusetts. Her mother is from South Boston and raised her Jewish. She graduated from Barnard College of Columbia University with a degree in English literature. She first gained recognition in the completely improvised Sundance film, The Freebie (a Duplass Brother production) and then as the oddball drunken cheerleader in the sitcom Blue Mountain State.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4OTk0MjE3Ml5BMl5BanBnXkFtZTgwNzM2MDE0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1951390","name":"Frankie Shaw","idIMDB":"nm1951390"},"actorId":"nm1951390","character":"Nikki","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Tobolowsky","urlProfile":"http://www.imdb.com/name/nm0864997","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYyMTU5NzcyMF5BMl5BanBnXkFtZTcwNDYxNDk3Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1951","placeOfBirth":" Dallas, Texas, USA","birthName":"Stephen Harold Tobolowsky","height":"6' 2\" (1.88 m)","bio":"Character actor Stephen Tobolowsky was born on May 30, 1951 in Dallas, Texas. Over the past three decades, Tobolowsky has racked up a lengthy list of roles in movies and television across many different genres. While Tobolowsky initially attended Southern Methodist University in Dallas, Texas with the intention of studying geology, he was quickly drawn in to acting there. He later attended the University of Illinois for one year. Tobolowsky worked primarily in theater during his early career, and wrote and directed a few plays including \"Two Idiots in Hollywood\" and \"True Stories\". His film career took off in the 1980s, though, thanks to roles in The Philadelphia Experiment (1984), Nobody's Fool (1986), Spaceballs (1987), and Mississippi Burning (1988). Since then, Tobolowsky has appeared in many popular movies including Bird on a Wire (1990), Basic Instinct (1992), Groundhog Day (1993), Radioland Murders (1994), Murder in the First (1995), Mr. Magoo (1997), The Insider (1999), Memento (2000), Freaky Friday (2003), Garfield (2004) and Wild Hogs (2007). He has also done a substantial amount of voice work, most recently taking on the role of Uncle Ubb in The Lorax (2012). Tobolowsky has been even more prolific in television over the past few decades. He's appeared on a diverse range of shows including Seinfeld (1989), Mad About You (1992), Chicago Hope (1994), The Practice (1997) and Curb Your Enthusiasm (2000), and has had recurring roles on CSI: Miami (2002), Deadwood (2004), Heroes (2006), Californication (2007) and Glee (2009). Tobolowsky is married to fellow actor Ann Hearn.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYyMTU5NzcyMF5BMl5BanBnXkFtZTcwNDYxNDk3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0864997","name":"Stephen Tobolowsky","idIMDB":"nm0864997"},"actorId":"nm0864997","character":"Alan","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3762944","urlIMDB":"http://www.imdb.com/title/tt3762944","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 25 min (85 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.8","filmingLocations":[],"rated":"TV-MA","awards":[{"award":"Primetime Emmy Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Primetime Emmy","categories":[{"category":"Outstanding Writing for a Limited Series, Movie or a Dramatic Special","names":[{"name":"Stephen Merchant","id":"nm0580351","role":null},{"name":"Gene Stupnitsky","id":"nm1969144","role":null},{"name":"Lee Eisenberg","id":"nm1072409","role":null}]},{"category":"Outstanding Television Movie","names":[{"name":"Stephen Merchant","id":"nm0580351","role":"executive producer"},{"name":"Gene Stupnitsky","id":"nm1969144","role":"executive producer"},{"name":"Lee Eisenberg","id":"nm1072409","role":"executive producer"},{"name":"Dan Kaplow","id":"nm0438430","role":"producer"}]}]}]}],"votes":"5,008","type":"TV Episode","seasonInfo":{"tvSerie":{"name":"Hello Ladies","id":"tt2378794"},"season":"Season 2","episode":"Episode 0"},"companyCreditsSimple":[{"idCompany":"co0008693","name":"Home Box Office (HBO)"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 03:14:11"}}