{"data":{"movies":[{"title":"Justice League: Throne of Atlantis","originalTitle":"","year":"2015","releaseDate":"20150113","directors":[{"name":"Ethan Spaulding","id":"nm2320725"}],"writers":[{"name":"Heath Corson","id":"nm1236620"},{"name":"Geoff Johns","id":"nm0424315"}],"runtime":"72 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGUxZDY1NzMtMDBkOS00ZTY4LTlhYWUtNWQxMDJlNjAyNmQyXkEyXkFqcGdeQXVyNjExODE1MDc@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Action","Adventure","Sci-Fi"],"plot":"In the aftermath of Justice League: War, the world is at peace or so it seems. When Atlantis attacks the Metropolis for the death of their king. But the Queen has different plans and requires the Justice League to find her lost son. But while they search for him, Atlantian troops; led by Ocean Master, continue their assault. Who will win?","simplePlot":"When Atlantian troops assault Metropolis as revenge for the death of their king, the Queen seeks help from the Justice League to find her son who has gone missing during the madness.","actors":[{"actorName":"Sean Astin","urlProfile":"http://www.imdb.com/name/nm0000276","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjczOTQ1NF5BMl5BanBnXkFtZTcwMzI2NzYyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 February 1971","placeOfBirth":" Santa Monica, California, USA","birthName":"Sean Patrick Duke","height":"5' 7\" (1.7 m)","bio":"Sean Astin is well known for his film debut portraying Mikey in Steven Spielberg's The Goonies (1985), for playing the title role in the critically acclaimed Rudy (1993), and for his role as the beloved Sam Gamgee in the Academy Award winning trilogy, The Lord of the Rings: The Fellowship of the Ring (2001), The Lord of the Rings: The Two Towers (2002), and The Lord of the Rings: The Return of the King (2003). Astin was born Sean Patrick Duke on February 25, 1971 in Santa Monica, California. His mother was actress Patty Duke. At the time of his birth, his biological father was believed to be entertainer Desi Arnaz Jr., but Astin discovered through a DNA test in the 1990s that his biological father is music promoter Michael Tell, who was married to Patty Duke in 1970. Sean was raised by his stepfather, actor John Astin, who married Patty Duke in 1972 and whose surname Sean took. Sean's mother was of Irish and more distant German ancestry, and Sean's biological father is of Austrian Jewish and Polish Jewish descent. At age nine, Sean starred with his mother in the after-school special Please Don't Hit Me, Mom (1981). Followed by Sean's feature debut The Goonies (1985) and since then, he has had a steady stream of roles. Starring in Toy Soldiers (1991), Where the Day Takes You (1991), Rudy (1993) and Harrison Bergeron (1995). He directed and co-produced the short film Kangaroo Court (1994), which was nominated in the best short film category at The 67th Annual Academy Awards (1995). Sean's adoptive father John Astin was nominated for the same award in 1969. Politically, Sean has been very active having served in two non-partisan Presidential appointments. Sean also hosts a live weekly 2 hour in-studio bi-partisan political radio talk show, 'Vox Populi Radio' which was made possible by a successful crowdfunding campaign in 2013. In 2004, Sean broke into the publishing world and authored the NY Times Best Selling release of There and Back Again a memoir of his film career (co-written with Joe Layden). Sean attended Crossroads High School for the Arts and studied with the famous Stella Adler. He graduated with honors from UCLA; B.A. in History & B.A. in English American Literature and Culture. Sean is married to Christine Astin, his co-producer on Kangaroo Court (1994). The couple lives in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjczOTQ1NF5BMl5BanBnXkFtZTcwMzI2NzYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000276","name":"Sean Astin","idIMDB":"nm0000276"},"actorId":"nm0000276","character":"Shazam","urlCharacter":"http://www.imdb.com/character/ch0027409","main":true},{"actorName":"Rosario Dawson","urlProfile":"http://www.imdb.com/name/nm0206257","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NjQ3NTYyNF5BMl5BanBnXkFtZTcwODU4NzQ4NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 May 1979","placeOfBirth":" New York City, New York, USA","birthName":"Rosario Isabel Dawson","height":"5' 7\" (1.7 m)","bio":"This stunning and resourceful actress has been primarily a film player thus far. Only recently has she been opening herself up more to doing television (the series Gemini Division (2008), which she executive-produced), and animated voice-overs. Dawson's powerhouse talent stands out the most in edgy, urban filming that dates back to 1995 when she was only sixteen. A rags-to-riches article entitled \"Rosario Dawson: From Tenement to Tinseltown\" probably says it all. Rosario was born in New York City on May 9, 1979. Her mother, Isabel Celeste, of Puerto Rican and Afro-Cuban descent, is a singer, and her stepfather, who raised her, Greg Dawson, of Irish descent, is a construction laborer. Her parents, who married when both were teenagers, eventually divorced. Rosario and her younger brother, Clay Dawson, had it hard while growing up and was cared for by family members, most of whom were poverty-stricken and some of whom were HIV-positive. Her career actually started as a child when she made a minor showing on the children's show, Sesame Street (1969). As the story goes, she was \"discovered\" as an adolescent on her front porch step by two photographers. One of them, Harmony Korine, was an aspiring screenwriter who thought the inexperienced sixteen-year-old was ideal for the controversial cult film Kids (1995), in which she would portray a sexually active adolescent. It took time for Rosario's film career to kick in after that, but by the late 1990s, she had nabbed several independent films. Since then, she has moved into main-stream hits (and misses) and has surprised viewers with her earthy, provocative, uninhibited approach to her roles. Reflecting New York's tougher, tawdrier side as assorted streetwalkers, homeless mothers, drug addicts, etc., her film highlights have included Light It Up (1999), Edward Burns' Sidewalks of New York (2001), Spike Lee's 25th Hour (2002) and Shattered Glass (2003). For Oliver Stone, she portrayed the duped bride of Colin Farrell's famed B.C. Macedonian warrior, Alexander (2004) (as in \"...the Great\"), which featured a notoriously violent-tinged nude/sex scene. Expanding her horizons beyond film, she has always expressed interest in singing. She hooked up with Prince for the re-release of his 1980s hit \"1999\" and appeared in The Chemical Brothers' video for the song \"Out of Control\" from the album \"Surrender\". She is also featured on the Outkast track, \"She Lives in My Lap\". On stage, she co-starred as Julia in a revival of \"Two Gentlemen of Verona\" at the Public Theater's \"Shakespeare in the Park\" and appeared in \"The Vagina Monologues\". She lucked into and got to show off her singing chops in the film adaptation of the hit New York musical Rent (2005), when Daphne Rubin-Vega, the original Mimi, became pregnant and was unable to reprise her exotic dancer role. Rosario also appeared as a prostitute in the adaptation of the graphic novel Sin City (2005). Of late, she has turned to producing. One of those, Descent (2007), had her playing a college coed who is brutally attacked and raped by a fellow student. Her more popular ventures have thus far included the role of Valerie Brown in the live-action version of the comic strip Josie et les Pussycats (2001), the Will Smith starrer Men in Black II (2002), Eagle Eye (2008) with Shia LaBeouf and Seven Pounds (2008), again with Smith, in which she offered one of her more tender-hearted performances as a woman with a potentially fatal heart condition. Off-camera, the still-single Dawson is highly active in political, social and environmental causes and has been involved with such organizations/charities/campaigns as the Lower East Side Girls Club, Global Cool, the O.N.E. Campaign, Oxfam, Amnesty International, Parents, Families and Friends of Lesbians and Gays, Control Arms, International Rescue Committee, Voto Latino (which she founded), Conservation International, Doctors Without Borders, National Geographic Society, The Nature Conservancy and Save the Children. In October 2008, she lent her voice to the RESPECT! Campaign, a movement aimed at preventing domestic violence.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NjQ3NTYyNF5BMl5BanBnXkFtZTcwODU4NzQ4NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0206257","name":"Rosario Dawson","idIMDB":"nm0206257"},"actorId":"nm0206257","character":"Wonder Woman","urlCharacter":"http://www.imdb.com/character/ch0000266","main":true},{"actorName":"Nathan Fillion","urlProfile":"http://www.imdb.com/name/nm0277213","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxODM3ODY2Nl5BMl5BanBnXkFtZTgwMzAyMjU2NzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 March 1971","placeOfBirth":" Edmonton, Alberta, Canada","birthName":"Nathan Craig Fillion","height":"6' 1½\" (1.87 m)","bio":"Nathan Fillion was born on 27 March 1971, in Edmonton, Alberta, Canada. He is the younger son of Cookie and Bob Fillion, both retired English teachers. He has an older brother, Jeff. In Canada, he attended Holy Trinity Catholic High School, Concordia University College of Alberta and University of Alberta. Before moving to New York City in 1994, he participated in improv theatre, including Theatresports with Rapid Fire Theatre and improvised soap opera Die-Nasty. He also appeared in a TV Movie Ordeal in the Arctic (1993) starring Richard Chamberlain and in Double enquête à Hamelin (1994). Fillion's first regular role was on a daytime soap opera, One Life to Live (1968), as Joey Buchanan, for which role he was nominated in 1996 for a Daytime Emmy Award. He left the series after three years in 1997. During the late 1990's, he appeared in small roles in the films Saving Private Ryan (1998) and Blast from the Past (1999). Fillion also guest starred on Total Security: Das Bootie, Maggie Winters: Mama's Got a Brand New Bag (1998) and Au-delà du réel - l'aventure continue: Star Crossed (1999). His biggest break by then happened in 1998, when he was cast as Johnny Donnelly on the 2nd season of Two Guys, a Girl and a Pizza Place (1998) opposite Traylor Howard, Ryan Reynolds, Richard Ruccolo and Suzanne Cryer. He starred on the show for 60 episodes. After \"Two Guys\" ended in 2001, Fillion gained critical acclaim and a large cult of fans when he starred as Captain Malcolm Reynolds on the Joss Whedon's Firefly (2002). Unfortunately the show was prematurely canceled in late 2002. He also guest starred on several episodes of two short lived TV shows, Pasadena (2001), as Rev. Glenn Collins and Miss Match (2003), as Adam Logan. In 2003, Whedon gave Fillion another chance to display his range when he cast Fillion as the twisted preacher Caleb, a villain, in the final season of Buffy the Vampire Slayer (1997). Before and after \"Firefly\", Fillion appeared in many movies, Dracula 2000 (2000), Alligator Point (2003), Water's Edge (2003), If Dad Only Knew (2004) and Hollywood Division (2004). Whedon vowed to resurrect \"Firefly\" in some way, and Fillion played Captain Reynolds again in the feature-film Serenity (2005). Fillion followed this film with more big screen leading roles, in the horror-comedy Horribilis (2006), in White Noise 2: The Light (2007), in the indie hit Waitress (2007) opposite Keri Russell and in Trucker (2008). He also continued to be a force in television, starring in the short-lived Fox-TV series Drive (2007) and appearing on a recurring role as Dr. Adam Mayfair on the 4th season of ABC's Desperate Housewives (2004), opposite Dana Delany. He also appeared on Lost: I Do (2006) and was a voice actor on many video games (e.g. Halo 3 (2007)). In 2008, he took his first singing part (and cemented his cult appeal) as Captain Hammer in Whedon's musical Internet smash Dr. Horrible's Sing-Along Blog (2008), with Neil Patrick Harris, Felicia Day and Simon Helberg. In 2009, he was cast as the title character Richard Castle in ABC's hit television series, Castle (2009). The show has aired more than 160 episodes and Nathan Fillion has won four People's Choice Awards for Favorite Dramatic TV Actor, as of 2016. Besides starring on \"Castle\", he has appeared in many movies, in Super (2010) as The Holy Avenger, in Joss Whedon's Much Ado About Nothing (2012) as Dogberry, the incompetent chief of security, in Percy Jackson: Sea of Monsters (2013) as Hermes and in Thrilling Adventure Hour Live (2015). His credits as a voice-actor are numerous: on The Venture Bros.: Bright Lights, Dean City (2010) as Brown Widow, in Wonder Woman (2009) as Steve Trevor, in Green Lantern: Emerald Knights (2011), Justice League: Doom (2012), Justice League: The Flashpoint Paradox (2013) and Justice League: Throne of Atlantis (2015) as Hal Jordan/Green Lantern, in Robot Chicken: DC Comics Special (2012) as Green Lantern/Mr. Freeze, on American Dad! (2005), in Pixar's Monsters University (2013) as Johnny, in Guardians of the Galaxy (2014) as Monstrous Inmate and on Gravity Falls (2012) as Preston Northwest. He also voices the lead, Shojun in the animated movie, Yamasong: March of the Hollows (2017). He has also continued voicing characters in video games, such as in Destiny (2014) and in Halo 5: Guardians (2015). He has also guest starred on The Daly Show: The Daly Superheroes (2012) as himself, on Community (2009) as Bob Waite, on The Big Bang Theory: The Comic Book Store Regeneration (2015) as himself, on Kroll Show: Twins (2015) as Mountie McMinniman, on Con Man (2015) as Jack Moore and on Drunk History: Space (2015) as Wernher Von Braun. He also narrated the documentary, Highway of Tears (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxODM3ODY2Nl5BMl5BanBnXkFtZTgwMzAyMjU2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0277213","name":"Nathan Fillion","idIMDB":"nm0277213"},"actorId":"nm0277213","character":"Green Lantern","urlCharacter":"http://www.imdb.com/character/ch0000232","main":true},{"actorName":"Christopher Gorham","urlProfile":"http://www.imdb.com/name/nm0330913","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NjExODc4N15BMl5BanBnXkFtZTcwMzc0NzA4MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 August 1974","placeOfBirth":" Fresno, California, USA","birthName":"Christopher David Gorham","height":"6' (1.83 m)","bio":"Christopher Gorham was born on August 14, 1974 in Fresno, California, USA as Christopher David Gorham. He is an actor and director, known for Covert Affairs (2010), Justice League: War (2014) and Popular (1999). He has been married to Anel Lopez Gorham since January 22, 2000. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NjExODc4N15BMl5BanBnXkFtZTcwMzc0NzA4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0330913","name":"Christopher Gorham","idIMDB":"nm0330913"},"actorId":"nm0330913","character":"The Flash / Barry Allen","urlCharacter":"http://www.imdb.com/character/ch0000203","main":true},{"actorName":"Matt Lanter","urlProfile":"http://www.imdb.com/name/nm1782667","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNjczNDQyNF5BMl5BanBnXkFtZTgwNjU2Mzk4ODE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 April 1983","placeOfBirth":" Massillon, Ohio, USA","birthName":"Matthew Mackendree Lanter","height":"5' 10\" (1.78 m)","bio":"Matthew Mackendree Lanter was born April 1, 1983 in Massillon, Stark County, Ohio, to Jana Kay (Wincek) and Joseph Hayes Lanter. He has a sister, Kara. When he was eight years old, he moved to Atlanta, Georgia, where his father's family is from. His recent ancestry includes Polish, English, Austrian, Scottish, and German. Growing up, the blue-eyed actor spent most of his time playing baseball, football and golf. His love for baseball led him to scoring a position as a bat boy with the Atlanta Braves. In the year 2001, he graduated from Collins Hill High School. His parents got divorced when he was a senior at Collins Hill. Matt majored in Sports Business at the University of Georgia, but eventually moved to Los Angeles to follow his dreams of being part of the showbiz industry. He attended the University of Georgia after attending a community college for two years. Lanter first gained the attention of fans when he was selected as a contestant in the 2004 reality television series, Manhunt: The Search for America's Most Gorgeous Male Model (2004). The show revolved around contestants having to compete with each other in a series of modeling events. Although he did not win the competition, Matt succeeded in making the show's top 10. It did not take too long before critics started noticing Matt. After landing roles on shows such as Grey's Anatomy (2005), CSI: Crime Scene Investigation (2000), Life (2007), Big Love (2006), Monk (2002), as well as the feature film, Bobby Jones: Stroke of Genius (2004), starring Jim Caviezel, he built a solid foundation and was already in demand for future projects. His big break came when he starred as \"Horace Calloway\", the John F. Kennedy-like first son on the short-lived ABC political series, Commander in Chief (2005) in 2005. However, most people do not know that he was, in fact, not in the original pilot. Instead, Matt was a re-cast. Matt has also recurred on two of television's most popular shows: NBC's Heroes (2006) as the sinister quarterback \"Brody Mitchumm\" opposite Hayden Panettiere and CBS' Shark (2006) as \"Eddie Linden\". His talent surpasses the ability to solely act for TV and film and on stage; Matt had the opportunity of starring in his theatrical debut, opposite Laurence Fishburne in Alfred Uhry's \"Without Walls\" at The Mark Taper Forum. Consistently booking role after role, he has starred in multiple other feature films merging him into a leading man. Lanter's films include: Warner Bros. animated feature film, Star Wars: The Clone Wars (2008), in which he voices the popular character \"Anakin Skywalker\", the lead in Liongate's comedy, Disaster Movie (2008), and MGM's feature film, WarGames: The Dead Code (2008). Prior to that, he established himself as a tween heartthrob, playing the lead in MGM/ABC Family's film, The Cutting Edge 3: Chasing the Dream (2008). Outside of acting, Matt has participated in various events for the Elizabeth Glaser Pediatric AIDS Foundation (one of which was a celebrity dodgeball team promoting the premiere of Ben Stiller's movie, Dodgeball: A True Underdog Story (2004), in which the proceeds also went to the Elizabeth Glaser Pediatric AIDS Foundation) and the Nautica Malibu Triathlon, where he was part of the \"Commander in Chief\" celebrity relay team. Despite being busy working in the industry, Matt says that he tries to stay as humble as possible. When he's not acting, he enjoys being outdoors, playing golf and relaxing at the beach. Matt married his longtime girlfriend, Angela Lanter, on June 14, 2013.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNjczNDQyNF5BMl5BanBnXkFtZTgwNjU2Mzk4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1782667","name":"Matt Lanter","idIMDB":"nm1782667"},"actorId":"nm1782667","character":"Aquaman / Arthur Curry","urlCharacter":"http://www.imdb.com/character/ch0524055","main":true},{"actorName":"Sumalee Montano","urlProfile":"http://www.imdb.com/name/nm0599019","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQzMTgzMjU5M15BMl5BanBnXkFtZTgwOTE3OTg3NjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 August 1972","placeOfBirth":" Columbus, Ohio, USA","bio":"Sumalee Montano was born on August 3, 1972 in Columbus, Ohio, USA. She is an actress, known for 10 Cloverfield Lane (2016), Transformers Prime (2010) and Justice League: Throne of Atlantis (2015). She has been married to Craig Zimmerman since June 18, 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQzMTgzMjU5M15BMl5BanBnXkFtZTgwOTE3OTg3NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0599019","name":"Sumalee Montano","idIMDB":"nm0599019"},"actorId":"nm0599019","character":"Mera","urlCharacter":"http://www.imdb.com/character/ch0056678","main":true},{"actorName":"Shemar Moore","urlProfile":"http://www.imdb.com/name/nm0005245","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczODMyOTQxOF5BMl5BanBnXkFtZTcwMzczMjU1Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1970","placeOfBirth":" Oakland, California, USA","birthName":"Shemar Franklin Moore","height":"6' 1\" (1.85 m)","bio":"Shemar Franklin Moore (born April 20, 1970) is an American actor and former fashion model. His notable roles are that of Malcolm Winters on The Young and the Restless from 1994 to 2005, Derek Morgan on CBS's Criminal Minds from 2005 to 2016, and as the third permanent host of Soul Train from 1999 to 2003.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczODMyOTQxOF5BMl5BanBnXkFtZTcwMzczMjU1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005245","name":"Shemar Moore","idIMDB":"nm0005245"},"actorId":"nm0005245","character":"Cyborg","urlCharacter":"http://www.imdb.com/character/ch0030600","main":true},{"actorName":"Jerry O'Connell","urlProfile":"http://www.imdb.com/name/nm0005278","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNTI3MjcyMF5BMl5BanBnXkFtZTcwNzIyMTA3Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1974","placeOfBirth":" New York City, New York, USA","birthName":"Jeremiah O'Connell","height":"6' 2\" (1.88 m)","bio":"Jeremiah O'Connell was born in New York City, to Linda (Witkowski), an art teacher, and Michael O'Connell, a British-born advertising agency art director. He is of half Irish, one quarter Italian, and one quarter Polish descent. He was raised in Manhattan with his parents and a younger brother, Charlie O'Connell, who is also an actor. He began his acting career at a very young age. He did commercial work and TV work before getting the role of \"Vern Tessio\" in the popular film Stand by Me (1986) opposite River Phoenix and Corey Feldman. After that, he worked on several TV-Movies and TV-series and had a starring role in Mon plus beau secret (1988). From 1991 to 1994, Jerry attended New York University where he majored in film, but he didn't graduate. In 1993, he starred in the film Calendar Girl (1993) opposite Jason Priestley. In 1995, he starred in the TV-movie western The Ranger, the Cook and a Hole in the Sky (1995) and, in 1996, he landed the role of \"Frank Cushman\" in the successful film Jerry Maguire (1996) opposite Tom Cruise. Over the next few years, he starred in Scream 2 (1997), had a small uncredited role in Can't Hardly Wait (1998), as well as appearing in several TV-movies and having starring roles in the TV-series Sliders (1995) and the film Body Shots (1999) opposite Sean Patrick Flanery and Tara Reid. In 2000, he appeared in the Brian De Palma film Mission to Mars (2000) with Gary Sinise, among others. He has also appeared in movies such as Tomcats (2001), Buying the Cow (2002), Kangaroo Jack (2003), Yours, Mine & Ours (2005), Man About Town (2006) and Room 6 (2006). In 2007, he married actress/model Rebecca Romijn and they are expecting twins in the winter of 2008.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNTI3MjcyMF5BMl5BanBnXkFtZTcwNzIyMTA3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005278","name":"Jerry O'Connell","idIMDB":"nm0005278"},"actorId":"nm0005278","character":"Superman","urlCharacter":"http://www.imdb.com/character/ch0000196","main":true},{"actorName":"Jason O'Mara","urlProfile":"http://www.imdb.com/name/nm0641816","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY3NDMwMDIzNl5BMl5BanBnXkFtZTcwNjE0NDg4Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1972","placeOfBirth":" Dublin, Ireland","height":"6' (1.83 m)","bio":"Jason was born and raised in Dublin, Ireland. Soon after graduating from Trinity College Dublin with a BA in Drama and Theatre he moved to London, England, to further pursue his acting career. Time spent in British repertory theater led to major roles in some of Britain and Ireland's great theaters, including The Royal Shakespeare Company, The Almeida, The Donmar, London's West End (Apollo and Comedy theaters) and the Gate Theatre, Dublin. Concurrently, he appeared in many British TV series for both the BBC and ITV. A permanent move to the US in 2002 resulted in Jason becoming a major presence on American and international screens, both big and small. Jason is an ambassador for The Lir, Ireland's National Academy of Dramatic Art at Trinity College Dublin and for The Movember Foundation, the global men's health charity organization. He lives in Los Angeles with his wife, the actress Paige Turco, and their son David. You can follow Jason on Twitter @jason_omara and Instagram @jasonomaraofficial and Facebook.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY3NDMwMDIzNl5BMl5BanBnXkFtZTcwNjE0NDg4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641816","name":"Jason O'Mara","idIMDB":"nm0641816"},"actorId":"nm0641816","character":"Batman","urlCharacter":"http://www.imdb.com/character/ch0000177","main":true},{"actorName":"Sam Witwer","urlProfile":"http://www.imdb.com/name/nm1022429","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMjQzNDY1Ml5BMl5BanBnXkFtZTgwNjY2NTYyMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1977","placeOfBirth":" Glenview, Illinois, USA","birthName":"Samuel Stewart Witwer","height":"6' 1\" (1.85 m)","bio":"Sam Witwer headlines the SyFy series, Being Human, the U.S. adaptation of the popular British television series. The darkly humorous, provocative drama stars Sam as the heroic, \"Aidan\", a sensual and brooding vampire. His excellent work was noticed soon after the show's premiere, as Sam received a Gemini Award nomination for Best Performance by an Actor in a Continuing, Leading Dramatic Role in 2011. Feature film fans remember Sam as the sacrificed \"Wayne Jessup\" in The Mist, Frank Darabont's adaptation of the Stephen King novella. Two independent features in which Sam stars await release: The Return of Joe Rich, starring opposite Armand Assante and Talia Shire and No God, No Master starring with David Strathairn and Edoardo Ballerini. A favorite in the science-fiction world, Sam began his career in the memorable role of \"Lt. Crashdown\" in SyFy's Battlestar Galactica and played \"Davis Bloom/ Doomsday\", the character fated to kill Superman, on CW's Smallville. Star Wars fans and the gaming community will also recognize Sam as Darth Vader's vengeful apprentice, \"StarKiller\" in the LucasArts' video game sensation Star Wars: The Force Unleashed (Parts One and Two). Through high-tech digital referencing and motion capture, Sam has become the voice and face of this LucasArts' creation in which the first title grossed over 500 million dollars. Sam has also done extensive voice work for the fan-favorite Clone Wars, the animated series airing on the Cartoon Network. Working opposite Jon Favreau and Clancy Brown as the voice of \"Darth Maul\" on Clone Wars, Sam received recognition with an Annie Award nomination for Best Voice Acting in an Animated Television/ Broadcast Production in 2012. Outside of sci-fi, audiences remember Sam in his recurring role of \"Neil Perry\" on the Emmy winning Showtime series Dexter. Sam's edge was a perfect compliment to the ground-breaking series in its first season. A Chicago native and a Juilliard-trained actor, Sam is also an accomplished musician who performed in the LA music scene with his band, The Crashtones.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMjQzNDY1Ml5BMl5BanBnXkFtZTgwNjY2NTYyMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1022429","name":"Sam Witwer","nicknames":["Stewart"],"idIMDB":"nm1022429"},"actorId":"nm1022429","character":"Orm","urlCharacter":"http://www.imdb.com/character/ch0235940","main":true},{"actorName":"Melique Berger","urlProfile":"http://www.imdb.com/name/nm0074289","urlPhoto":"","biography":{"bio":"Melique Berger is known for her work on Justice League: War (2014), Dr. Dolittle 2 (2001) and Justice League: Throne of Atlantis (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0074289","name":"Melique Berger","idIMDB":"nm0074289"},"actorId":"nm0074289","character":"Sarah Charles","urlCharacter":"http://www.imdb.com/character/ch0412075","main":true},{"actorName":"Steve Blum","urlProfile":"http://www.imdb.com/name/nm0089710","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIzMzk3ODEwN15BMl5BanBnXkFtZTgwNzY3MDg5MDE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1960","placeOfBirth":" Santa Monica, California, USA","birthName":"Steven Jay Blum","height":"5' 10\" (1.78 m)","bio":"Steve Blum was born on April 29, 1960 in Santa Monica, California, USA as Steven Jay Blum. He is an actor and writer, known for Digimon: Digital Monsters (1999), Batman: Arkham City (2011) and Star Wars Rebels (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIzMzk3ODEwN15BMl5BanBnXkFtZTgwNzY3MDg5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0089710","name":"Steve Blum","idIMDB":"nm0089710"},"actorId":"nm0089710","character":"Lex Luthor / Computer Voice","urlCharacter":"http://www.imdb.com/character/ch0000195","main":true},{"actorName":"Patrick Cavanaugh","urlProfile":"http://www.imdb.com/name/nm0146941","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc1NzQ0NTE2N15BMl5BanBnXkFtZTgwMDY0MjU3MDE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"bio":"Patrick Cavanaugh is an actor and director, known for Mad Men (2007), Agents of S.H.I.E.L.D. (2013) and Casting Call (2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc1NzQ0NTE2N15BMl5BanBnXkFtZTgwMDY0MjU3MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0146941","name":"Patrick Cavanaugh","idIMDB":"nm0146941"},"actorId":"nm0146941","character":"Jimmy Olsen","urlCharacter":"http://www.imdb.com/character/ch0000220","main":true},{"actorName":"Larry Cedar","urlProfile":"http://www.imdb.com/name/nm0147738","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NjQ5MDQxNl5BMl5BanBnXkFtZTgwNDYyOTM2MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1955","placeOfBirth":" Los Angeles County, California, USA","height":"6' (1.83 m)","bio":"Larry Cedar is an accomplished film, television, stage and voiceover artist. Admitted to Hastings Law School after earning his BA in Communication Studies, the course of his life was dramatically altered when he impulsively decided to audition for, and was accepted into, the MFA Theater program at UCLA. There he participated in and won the Hugh O'Brian Acting Competition award for Best Actor and as a result was signed to an exclusive one-year artist development contract with Universal Studios, where he subsequently appeared in his first television pilot. He went on to star in various projects for Walt Disney Studios, numerous episodics and several feature films, including a starring role opposite Rebecca De Mornay and Mary Gross in the Ivan Reitman-produced Feds (1988), as well as an unforgettable appearance opposite John Lithgow as \"The Creature on the Wing\" in the Steven Spielberg remake of Twilight Zone: The Movie (1983), directed by George Miller. Larry spent six years in New York starring in the award-winning PBS series Square One Television (1987) and later starred in 40 episodes of the Fox television series A.J.'s Time Travelers (1995) produced by Gianni Russo. An excellent singer, on stage he has portrayed Hoagy Carmichael in \"Hoagy, Bix, and Wolfgang Beethoven Bunkhaus\" at the Mark Taper Forum in Los Angeles, starred as \"Vernon\" opposite Lea Thompson in \"They're Playing Our Song\", and as \"Secretary Thompson\" in \"1776: The Musical\" opposite Roger Rees. An avid reader and monologist, he is currently developing a one-man show based on the works of one of his favorite authors, George Orwell. In 2003 he was nominated for two Los Angeles Theater Alliance \"Ovation\" awards for his performances in \"Anything Goes\" (as Lord Oakley) opposite Rachel York and \"She Loves Me\" (as Sipos, for which he ultimately won Best Featured Actor in a Musical). He also excels in the field of voiceovers, and in addition to lending his numerous vocal characterizations to hundreds of commercials, cartoon series, and video games, he specializes in the art of \"speed talking\". Demos of his voiceover work can be heard at www.disclaimerman.com. Larry currently recurs as \"Leon\", the opium-addicted card dealer and thief, in HBO's newest hit series, _\"Deadwood\" (2004/I)_ opposite Powers Boothe, Ricky Jay and Ian McShane. He most recently completed work opposite Keanu Reeves as the horrific \"Vermin Man\" (with special effects makeup by Stan Winston) in Constantine (2005), directed by Francis Lawrence.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NjQ5MDQxNl5BMl5BanBnXkFtZTgwNDYyOTM2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0147738","name":"Larry Cedar","idIMDB":"nm0147738"},"actorId":"nm0147738","character":"Thomas Curry","urlCharacter":"http://www.imdb.com/character/ch0562541","main":true},{"actorName":"Barry Dennen","urlProfile":"http://www.imdb.com/name/nm0219336","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM5NDgyNTcyN15BMl5BanBnXkFtZTcwODU4MzgwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1938","placeOfBirth":" Chicago, Illinois, USA","bio":"Best known for his nearly 40-year association with the musical sensation \"Jesus Christ Superstar,\" actor-singer-voice artist Barry Dennen has a multi-media resume. Dennen was born in Chicago on February 22, 1938; his family moved to Los Angeles when he was a child. After graduating from UCLA (where George Takei was a classmate), he began his career in New York City, performing in workshops and on the cabaret circuit while living with, and nurturing the singing career of, his girlfriend Barbra Streisand. After a couple years, Dennen decided to explore professional opportunities \"across the Pond\" and in 1968, shortly after relocating to London, he was selected by legendary theater producer Hal Prince to create the role of the Emcee in the original West End cast of \"Cabaret.\" Barry's striking performance opposite Dame Judi Dench - preserved on the cast album - earned him the \"Evening Standard Award\" for Best Actor. While living and working in London, Dennen was invited by Sir Andrew Lloyd Webber in 1970 to sing the part of Pontius Pilate on the famous double disk LP of Webber & Rice's groundbreaking \"Jesus Christ Superstar.\" A year later, Dennen co-starred as Pilate in the original Broadway production of the hit show, and again in Norman Jewison's acclaimed 1973 feature film version. (It was Dennen who suggested \"Superstar\" as the director's next project, while appearing as Mendel in Jewison's movie of the Tony-winning \"Fiddler on the Roof.\") Throughout the 1970s and '80s, Dennen worked in both the U.K. and the States, settling in Los Angeles in the mid-1980s. In addition to sporadic film and TV roles, notable stage appearances include the ventriloquist's Dummy in \"Ghetto\" (Mark Taper, Los Angeles); the testy Headwaiter in \"She Loves Me\" (Ahmanson, Los Angeles); Mr. Wilson in \"Annie Get Your Gun\" (A.C.T., San Francisco); and the Major-General in \"The Pirates of Penzance\" (Santa Barbara CLO, Santa Barbara). Dennen created the role of Bertold Brecht in the world premiere of \"Silent Partners\" by Charles Marowitz at the Scena Theatre in Washington, DC; and in 2009 was seen as The Old Actor in \"The Fantasticks\" for Jason Alexander's Reprise Theater at the Freud Playhouse in Los Angeles. Over the years, he has reprised his role of Pilate in a variety of tours and anniversary productions of \"Jesus Christ Superstar,\" frequently appearing with other original cast members (from both Broadway and the movie). In 2006, Dennen and his friends and co-stars Ted Neeley, Yvonne Elliman and Ben Vereen were joined by comedian Jack Black in a one-night only, sold-out performance at the Ricardo Montalban Theatre. The author of several teleplays and screenplays, Barry published his moving personal memoir, \"My Life with Barbra: A Love Story,\" in 1997, sharing for the first time in his own words the fascinating background behind the nightclub act he created and directed that launched Streisand's early stardom.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM5NDgyNTcyN15BMl5BanBnXkFtZTcwODU4MzgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0219336","name":"Barry Dennen","idIMDB":"nm0219336"},"actorId":"nm0219336","character":"Defense Advisor","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt3878542","urlIMDB":"http://www.imdb.com/title/tt3878542","business":{"budget":{"money":"$3,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 12 min (72 min)"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.7","filmingLocations":[],"rated":"PG-13","awards":[{"award":"Behind the Voice Actors Awards 2016","titlesAwards":[{"titleAwardOutcome":"Nominated BTVA Special/DVD Voice Acting Award","categories":[{"category":"Best Female Vocal Performance in a TV Special/Direct-to-DVD Title or Theatrical Short","names":[{"name":"Sumalee Montano","id":"nm0599019","role":null}]}]}]}],"votes":"12,416","type":"Video","companyCreditsSimple":[{"idCompany":"co0072876","name":"Warner Bros. Animation"},{"idCompany":"co0038332","name":"DC Comics"}],"keywords":{"keywords":["king","queen","ocean","ocean master","justice league","atlantis","animal human communication","speeding vehicle","extraterrestrial man","extraterrestrial human","extraterrestrial alien","humanoid cyborg","supervillain","masked supervillain","brother versus brother","mask","electrical shock","trident","underwater scene","tube","futuristic tank","flashback","energy construct","tank","hover tank","metropolis the city","sea","flying superheroine","superheroine","red cape","alien superhero","human alien","telepathic communication","green lantern the character","hydrokinesis","bald man","sword","coronation","hologram","army tank","lightning as weapon","flying cyborg","fire fight","magical weapon","good versus evil","masked man","prison guard","prison cell","belle reve prison","scene after end credits","prison","killer whale","breathing apparatus","cheering crowd","kneeling","atlantean warrior","atlantean","holographic projection","brother brother fight","aquaman","punched in the face","van","stabbed in the chest","giant shark","lightning","shark attack","shark","female amazon warrior","amazon warrior","amazon woman","news photographer","female news reporter","sledgehammer","sledgehammer as weapon","construction worker","bulldozer","construction site","humvee","general","four star general","soldier","battle tank","army general","cargo ship","cityscape","undersea kingdom","undersea monster","animal ally","humpback whale","heat vision","giant monster","tidal wave","undersea trench","sea monster","trencher","woman killed","matricide","mother killed by son","son kills mother","mother killed","stabbed in the back","half brother","throne","humanoid creature","flying woman","spear","head cut off","hyper speed","younger version of character","running on water","cut in half","seagull","reflection in water","island","holographic map","world map","warrior","female warrior","hammerhead shark","giant aquarium","man killed","hand to hand combat","half breed","futuristic submarine","man shaving","father and son","glowing eyes","female aquatic humanoid","aquatic humanoid","blonde woman","swimming underwater","prince","black manta","underwater city","undersea city","professor","hovering aircraft","jet aircraft","futuristic aircraft","masked superhero","female superhero","rocket launcher","bazooka","muscle car","gadget aircraft","batwing","handshake","diner","headquarters","ferris air base","the flash","shazam","framed photograph","lighthouse","teleportation","portal","knife","gun arm","scanning","security footage","sunken submarine","walking underwater","talking to a lobster","knife attack","head butt","blond man","man with glasses","fight","one against many","metal pipe as weapon","thrown through a window","man with gills","lobster","maine","heroine","flying man","caped superhero","flying superhero","wonder woman","athens greece","navy submarine","scientist","woman wearing a lab coat","dreaming","air base","woman wearing glasses","cyborg the character","jogging","scissor lift","s.t.a.r. labs","submarine captain","submarine crew","marianas trench","submarine","under sea","underwater","alien","cyborg","based on comic book","dc comics","team","superhero team","superhero"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 01:16:28"}}