{"data":{"movies":[{"title":"The Concert for Valor","originalTitle":"","year":"2014","releaseDate":"20141111","directors":[{"name":"Joel Gallen","id":"nm0302778"}],"countries":["USA"],"languages":["English"],"genres":["Music"],"plot":"A live HBO concert honoring United States veterans in Washington DC.","simplePlot":"A live HBO concert honoring United States veterans in Washington DC.","actors":[{"actorName":"The Black Keys","urlProfile":"http://www.imdb.com/name/nm2370642","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MzM0ODE5N15BMl5BanBnXkFtZTgwNTc1NjM0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MzM0ODE5N15BMl5BanBnXkFtZTgwNTc1NjM0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2370642","name":"The Black Keys","idIMDB":"nm2370642"},"actorId":"nm2370642","character":"Themselves - Performers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Black","urlProfile":"http://www.imdb.com/name/nm0085312","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MjI4NTQxN15BMl5BanBnXkFtZTgwMDMyMDg4NTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1969","placeOfBirth":" Hermosa Beach, California, USA","birthName":"Thomas Jacob Black","height":"5' 6\" (1.68 m)","bio":"Jack Black was born Thomas Jacob Black in Santa Monica, California, to Judith Love (Cohen) and Thomas William Black, both satellite engineers. He is of British-German (father) and Russian Jewish (mother) ancestry. Black attended the University of California at Los Angeles. While at UCLA, he was a member of Tim Robbins's acting troupe and it was through this collaboration that led to his 1992 film debut in Bob Roberts (1992). Although he was just a background voice in his first film, Jack's appearances in such television shows as The X-Files (1993), his breakthrough performance in High Fidelity (2000), and his rock-comedy band, Tenacious D, have created an ever-growing cult following.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MjI4NTQxN15BMl5BanBnXkFtZTgwMDMyMDg4NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0085312","name":"Jack Black","nicknames":["JB","Jables"],"idIMDB":"nm0085312"},"actorId":"nm0085312","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bryan Cranston","urlProfile":"http://www.imdb.com/name/nm0186505","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2NjEyMTY4MTVeQTJeQWpwZ15BbWU3MDQ5NDAzNDc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 March 1956","placeOfBirth":" Hollywood, California, USA","birthName":"Bryan Lee Cranston","height":"5' 10½\" (1.79 m)","bio":"Bryan Cranston is an American actor, voice actor, screenwriter, director and producer. He is known for portraying Walter White on the AMC crime drama series Breaking Bad (2008), Hal on the Fox comedy series Malcolm in the Middle (2000), Doug Heffernan's neighbor Tim Sacksky on the CBS comedy series King of Queens, Dr. Tim Whatley on the NBC comedy series Seinfeld (1989), astronaut Buzz Aldrin in From the Earth to the Moon (1998), and Ted Mosby's boss on How I Met Your Mother (2005). His role in Breaking Bad earned him four Outstanding Lead Actor in a Drama Series Emmy Awards, five Golden Globe nominations and one win in 2014, nine Screen Actors Guild Awards nominations with four wins, and six Satellite Awards nominations with four wins. In June 2014, he won a Tony Award for Best Actor in a Play for his portrayal of Lyndon B. Johnson in the play All the Way on Broadway. He reprise his role in the television film of the same name, which debuted on HBO in May 2016. For the Trumbo (2015), he received widespread acclaim and was nominated for the Academy Award for Best Actor. Cranston also appeared in several acclaimed films, such as Saving Private Ryan (1998), Little Miss Sunshine (2006), Drive (2011), Argo (2012), and Godzilla (2014). Series for his role in Malcolm in the Middle. Bryan was born in Canoga Park, California, to Audrey Peggy Sell, a radio actress, and Joe Cranston (Joseph Louis Cranston), who was also an actor (and a boxer). His maternal grandparents were German, and his father was of Irish, Austrian-Jewish, and German descent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2NjEyMTY4MTVeQTJeQWpwZ15BbWU3MDQ5NDAzNDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0186505","name":"Bryan Cranston","idIMDB":"nm0186505"},"actorId":"nm0186505","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eminem","urlProfile":"http://www.imdb.com/name/nm0004896","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MDAxMDYwOV5BMl5BanBnXkFtZTcwMTQ1MjE2Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1972","placeOfBirth":" St. Joseph, Missouri, USA","birthName":"Marshall Bruce Mathers III","height":"5' 8\" (1.73 m)","bio":"Eminem was born Marshall Bruce Mathers III in St. Joseph, Missouri, to Deborah R. (Nelson) and Marshall Bruce Mathers, Jr., who were in a band together, Daddy Warbucks. He is of English, as well as some German, Scottish, and Swiss-German, ancestry. Marshall spent his early childhood being shoved back and forth from Kansas City and Detroit. He settled on the Eastside of Detroit when he was 12. Switching schools every two to three months made it difficult to make friends, graduate and to stay out of trouble. Marshall attended Lincoln High School in Warren, Michigan, 1986-1989. Being a rap fan for most of his life, Marshall began rapping at the early age of 4. Rhyming words together, battling schoolmates in the lunchroom brought joy to what was otherwise a painful existence. At the age of 14, he began to get very serious about his rapping but it wasn't until he was 17 that he actually made a name for himself, becoming M&M, which he would later respell as \"Eminem\". Being rejected by most fellow rappers because of his race, Marshall grew an anger that flows through his music to this day. After failing the 9th grade for three times in a row, he quit school, but has remarked that he does not consider himself stupid and does not advise that people should follow his example. He says that it just wasn't for him. Forcing himself on radio shows, freestyle battles, Marshall threw himself head first into the rap game, where he was swallowed up most of the time. His very first album was titled \"Infinite\" and, while the album sold less than a thousand copies, it was the gearing up stages for the rapper who became a millionaire. It was then that his daughter, Hailie Jade Scott, was born on December 25th of 1995 with long time girlfriend Kim Scott. Having nothing to lose at all, flat broke and not knowing where he would be living the next week, Marshall set out to rant about life in general, the set quickly caught the ear of hip-hop's difficult-to-please underground. What came out of this was the Slim Shady EP, the early work for the later Dr. Dre revised Slim Shady LP. Down to nearly his last dime, he went into the 1997 Rap Olympics in Los Angeles, basically hoping to win the $1,500 cash prize which he badly needed. After battling for an hour and throwing back every race diss thrown at him, Marshall made it to second place losing in a slip up. Furious that he had lost, Marshall didn't even notice that he had been spotted. In the crowd were a few producers from Interscope, and they were handed a copy of the \"Infinite\" tape by way of a demo. Dr. Dre got to hear it and eventually tracked him down. The two instantly hit it off, recording four songs in their first six hours of working - three which made it to his first LP. After the album was finished, Dr. Dre asked Marshall to come work with him on his new album. He helped produce several tracks and was on the best songs of the album. Now officially making it, Marshall and Dre set to make his second LP. The album became the Marshall Mathers LP and won 3 Grammies and was the first rap album ever to be nominated \"Album of the Year\", selling more than 8 million records in the United States alone. He also stunned critics when he shot down all homophobic remarks by performing \"Stan\" with Elton John. Eminem made a movie, 8 Mile (2002). Though 2001 was a rough year for the rapper, being charged with weapon offenses, divorcing his wife, and almost going to prison, Marshall has explained his life in one word: \"Claimer\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MDAxMDYwOV5BMl5BanBnXkFtZTcwMTQ1MjE2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004896","name":"Eminem","nicknames":["Slim Shady","Doody","M&M"],"idIMDB":"nm0004896"},"actorId":"nm0004896","character":"Himself - Performer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jamie Foxx","urlProfile":"http://www.imdb.com/name/nm0004937","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNjY1NDg3NF5BMl5BanBnXkFtZTgwNjA2MTg0MzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1967","placeOfBirth":" Terrell, Texas, USA","birthName":"Eric Marlon Bishop","height":"5' 9\" (1.75 m)","bio":"Jamie Foxx is an American actor, singer, and comedian. He won an Academy Award for Best Actor, BAFTA Award for Best Actor in a Leading Role, and Golden Globe Award for Best Actor in a Musical or Comedy, for his work in the 2004 biographical film Ray (2004). The same year, he was nominated for the Academy Award for Best Supporting Actor for his role in the action film Collateral (2004). Other prominent acting roles include the title role in the film Django Unchained (2012), the super villain Electro in The Amazing Spider-Man 2 (2014), and William Stacks in the 2014 version of Annie (2014). Jamie Foxx was born Eric Marlon Bishop in Terrell, Texas, to Louise Annette Talley and Darrell Bishop, who worked as a stockbroker and had later changed his name to Shahid Abdula. His mother was an adopted child. When her marriage to his father failed, his maternal grandparents, Mark and Estelle Talley, stepped in and, at age seven months, adopted Jamie too. He has said that he had a very rigid upbringing that placed him in the Boy Scouts and the church choir. During high school, he played quarterback for his high school team and was good enough that he got press in Dallas newspapers. He studied music in college. He released a music album in 1994, \"Peep This\", and sings the theme song for his 1999 movie, Any Given Sunday (1999). However, in 1989, his life changed when a girl friend challenged him to get up onstage at the Comedy Club. In fact, he says he took his androgynous stage name because he learned that women got preference for mike time on open stage nights. That led to his being cast in Roc (1991) and In Living Color (1990). Foxx had his own WB television show from 1996 to 2001, the sitcom The Jamie Foxx Show (1996), in which he played Jamie King Jr. Foxx is also a Grammy Award-winning musician, producing four albums which have charted highly on the US Billboard 200: Unpredictable (2005), which topped the chart, Intuition (2008), Best Night of My Life (2010), and Hollywood: A Story of a Dozen Roses (2015). In 2012, Foxx starred in the title role of the Quentin Tarantino written and directed Django Unchained. Foxx starred alongside his Ray co-star Kerry Washington, as well as Christoph Waltz, Leonardo DiCaprio and Samuel L. Jackson. In 2013, Foxx was cast as President James Sawyer in White House Down alongside Channing Tatum. The following year, Foxx appeared in The Amazing Spider-Man 2 as the villain Electro, and co-starred with Quvenzhané Wallis in Annie, Sony's Will Smith and Jay-Z produced update of the comic strip-turned-musical. He has two children, including Corinne Foxx, born in 1995, who lives with her mother.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNjY1NDg3NF5BMl5BanBnXkFtZTgwNjA2MTg0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004937","name":"Jamie Foxx","idIMDB":"nm0004937"},"actorId":"nm0004937","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dave Grohl","urlProfile":"http://www.imdb.com/name/nm0342970","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NzY4NzgxNV5BMl5BanBnXkFtZTcwMzcyOTQwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1969","placeOfBirth":" Warren, Ohio, USA","birthName":"David Eric Grohl","height":"6' (1.83 m)","bio":"Dave Grohl, Foo Fighters front-man, will always be remembered as the drummer for Nirvana. But, drumming for a great band such as Nirvana is not Dave's only claim in the world of music. Dave's musical career began at age 15 as the guitarist and later as the drummer for a punk band called \"Freak Baby\". A year later, he was behind the drums for \"Mission Impossible\" and later that summer drumming for \"Dain Bramage\". Another year down the road, an opportunity to drum with one of his favorite punk bands, \"Scream\", was just too great to pass up. This leads us to 1990 when \"Scream\" seemed to be coming to an end and \"Nirvana\" was in need of a drummer. While recording and touring with \"Nirvana\", Dave continued to write lyrics and music that he would record during breaks with \"Nirvana\". After the tragic end of \"Nirvana\", Dave eventually turned to his music to create Foo Fighters. While playing guitar and singing with Foo Fighters is his main job, you can also find Dave channeling his musical genius throughout the world of rock. Dave has drummed for \"Queens Of The Stone Age\" and \"Killing Joke\". He has also recorded and guest performed with his buddies \"Tenacious D\". All the while recording for his own hardcore project, \"Probot\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NzY4NzgxNV5BMl5BanBnXkFtZTcwMzcyOTQwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0342970","name":"Dave Grohl","nicknames":["Disco","Dr. G","Stinger","The Nicest Man In Rock","The Nicest Guy In Music"],"idIMDB":"nm0342970"},"actorId":"nm0342970","character":"Himself - Performer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Hanks","urlProfile":"http://www.imdb.com/name/nm0000158","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MjMwNDA3Nl5BMl5BanBnXkFtZTcwMTA2NDY3NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1956","placeOfBirth":" Concord, California, USA","birthName":"Thomas Jeffrey Hanks","height":"6' (1.83 m)","bio":"Thomas Jeffrey Hanks was born in Concord, California, to Janet Marylyn (Frager), a hospital worker, and Amos Mefford Hanks, an interant cook. His father had English and some German, ancestry, while his mother's family, originally surnamed \"Fraga\", was entirely Portuguese. Tom grew up in what he has called a \"fractured\" family. He moved around a great deal after his parents' divorce, living with a succession of step-families. No problems, no alcoholism - just a confused childhood. He has no acting experience in college and credits the fact that he could not get cast in a college play with actually starting his career. He went downtown, and auditioned for a community theater play, was invited by the director of that play to go to Cleveland, and there his acting career started. Ron Howard was working on Splash (1984), a fantasy-comedy about a mermaid who falls in love with a business executive. Howard considered Hanks for the role of the main character's wisecracking brother, which eventually went to John Candy. Instead, Hanks landed the lead role and the film went on to become a surprise box office success, grossing more than $69 million. After several flops and a moderate success with the comedy Dragnet (1987), Hanks' stature in the film industry rose. The broad success with the fantasy-comedy Big (1988) established him as a major Hollywood talent, both as a box office draw and within the film industry as an actor. For his performance in the film, Hanks earned his first Academy Award nomination as Best Actor. Hanks climbed back to the top again with his portrayal of a washed-up baseball legend turned manager in A League of Their Own (1992). Hanks has stated that his acting in earlier roles was not great, but that he subsequently improved. In an interview with Vanity Fair, Hanks noted his \"modern era of movie making ... because enough self-discovery has gone on ... My work has become less pretentiously fake and over the top\". This \"modern era\" began for Hanks, first with Sleepless in Seattle (1993) and then with Philadelphia (1993). The former was a blockbuster success about a widower who finds true love over the radio airwaves. Richard Schickel of Time magazine called his performance \"charming\", and most critics agreed that Hanks' portrayal ensured him a place among the premier romantic-comedy stars of his generation. In Philadelphia, he played a gay lawyer with AIDS who sues his firm for discrimination. Hanks lost 35 pounds and thinned his hair in order to appear sickly for the role. In a review for People, Leah Rozen stated, \"Above all, credit for Philadelphia's success belongs to Hanks, who makes sure that he plays a character, not a saint. He is flat-out terrific, giving a deeply felt, carefully nuanced performance that deserves an Oscar.\" Hanks won the 1993 Academy Award for Best Actor for his role in Philadelphia. During his acceptance speech, he revealed that his high school drama teacher Rawley Farnsworth and former classmate John Gilkerson, two people with whom he was close, were gay. Hanks followed Philadelphia with the blockbuster Forrest Gump (1994) which grossed a worldwide total of over $600 million at the box office. Hanks remarked: \"When I read the script for Gump, I saw it as one of those kind of grand, hopeful movies that the audience can go to and feel ... some hope for their lot and their position in life ... I got that from the movies a hundred million times when I was a kid. I still do.\" Hanks won his second Best Actor Academy Award for his role in Forrest Gump, becoming only the second actor to have accomplished the feat of winning consecutive Best Actor Oscars. Hanks' next role - astronaut and commander Jim Lovell, in the docudrama Apollo 13 (1995) - reunited him with Ron Howard. Critics generally applauded the film and the performances of the entire cast, which included actors Kevin Bacon, Bill Paxton, Gary Sinise, Ed Harris, and Kathleen Quinlan. The movie also earned nine Academy Award nominations, winning two. Later that year, Hanks starred in Disney/Pixar's computer-animated film Toy Story (1995), as the voice of Sheriff Woody. A year later, he made his directing debut with the musical comedy _That Thing You Do! (1996) about the rise and fall of a 1960s pop group, also playing the role of a music producer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2MjMwNDA3Nl5BMl5BanBnXkFtZTcwMTA2NDY3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000158","name":"Tom Hanks","idIMDB":"nm0000158"},"actorId":"nm0000158","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennifer Hudson","urlProfile":"http://www.imdb.com/name/nm1617685","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTczMDU5OV5BMl5BanBnXkFtZTcwNDI0ODY1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1981","placeOfBirth":" Chicago, Illinois, USA","birthName":"Jennifer Kate Hudson","height":"5' 9\" (1.75 m)","bio":"Jennifer Hudson is a Grammy Award-winning recording artist, Academy Award-winning actress and best-selling author. Bright and booming talent Hudson is a perfect example of how NOT winning the title of American Idol (2002) can actually be a boon to your career and not necessarily the end of a childhood dream. Hudson was born Jennifer Kate Hudson on September 12, 1981, in Chicago, Illinois, to Darnell Donnerson and Samuel Simpson. She earned minor attention as one of the twelve finalists on the third season of the FOX TV series in 2004. She came in an underwhelming sixth runner-up. Hudson grew up singing in gospel choirs, acting in community theater productions, singing on cruise ships and touring for in Disney's Hercules: The Musical. With no formal musical training, her gospel-tinged voice initially pleased the panel of judges. The songs were arguably ill-advised but evidence of her greatness peeked through at times. She, Fantasia Barrino and La Toya London were promoted as the show's own version of the Dreamgirls and were expected to be the final three standing in the competition when Jennifer was unexpectedly cut from the pack. Fantasia won the competition and all the glory and the fame. Hudson appeared with the \"American Idol\" summer tour and performed on the road in concerts over the next two years. She auditioned for the coveted role of Effie Melody White, the cast-off member of a popular 60s Supremes-like girl group in the long-awaited film version of the Broadway musical Dreamgirls. Among Jennifer's competition was Fantasia herself. This time Jennifer was the winner, and was ordered to gain weight for the role. With the insurmountable task of taking over a role so indelibly identified with Tony-winning legend Jennifer Holliday, the making of Dreamgirls (2006). In a role of a lifetime, Hudson no longer had to play second fiddle to anyone. Her role in Dreamgirls (2006) was one of the most triumphant musical film debuts since Barbra Streisand in Funny Girl (1968). Hudson made the role her own delivering the same heart-breaking, gut-wrenching one-two punch that made Holliday the toast of Broadway in 1981. To outshine Beyoncé Knowles and Eddie Murphy is no easy task but Hudson was the heart and soul of the movie. She copped awards from the National Board of Review, New York Film Critics, Phoenix Film Critics Society, Golden Satellite, Golden Globe, the British Film and the coveted Oscar. The late, tragic Florence Ballard, on whom the Effie character is based, would be very inspired indeed to see Jennifer Hudson's meteoric rise to musical star. Hudson has since made an impact in the world of music with the successful release of both of her Sony/Arista Records albums. Her sophomore album, \"I Remember Me,\" was introduced on March 22, 2011 to rave reviews. The album debuted at No. 2 on Billboard's Top 200 and R&B Albums charts and has since been certified RIAA Gold in the U.S. She went on to receive a 2012 Billboard Music Award nomination for Top R&B Album as well as taking home two 2012 NAACP Image Awards for Outstanding Music Video and Outstanding Album. Additional collaborations include \"Think Like A Man\" with Ne-Yo and Rick Ross for the title track of the film and critically acclaimed single \"Night Of Your Life\" with David Guetta for his most recent hit-album \"Nothing But The Beat.\" Hudson's 2008 debut self-titled record won a Grammy Award for \"Best R & B Album,\" which was presented by one of Hudson's idols, Whitney Houston. She also received three additional nominations including \"Best Female R&B Vocal Performance,\" \"Best R&B Performance by a Duo or Group with Vocals\" and \"Best R&B Song.\" The album then went on to win three awards at the 2009 NAACP Image Awards including \"Best Album.\" The RIAA Gold Certified album entered Billboard's Top 200 at No. 2 and marked the biggest first week sales for an R&B female entry since 2004 and has since sold over 1.1 million albums worldwide to date. 2013 was an exciting year for Hudson's music career, most recently being honored with a star on the Hollywood Walk of Fame. Hudson also ended the year by releasing the critically acclaimed single \"I Can't Describe (The Way I Feel),\" produced by Pharrell Williams and featuring T.I.. She was also honored with the privilege to perform the Presidential Inauguration, Super Bowl XLVII and the Academy Awards. In addition, Hudson was also honored by the Recording Academy at the Annual Grammy's on the Hill for her philanthropic efforts, specifically with her organization, the Julian D. King Gift Foundation. The same year, Hudson was honored at VH1's Do Something Awards for her charitable work and also at Variety's Power of Women luncheon with the Samsung Galaxy Impact Award. In 2014, Hudson released the third single off her Sony/RCA album, scheduled for release this fall. The song, \"It's Your World\" features R. Kelly, who also produced the Studio 54-inspired dance track. Just prior, Hudson released \"Walk It Out,\" produced by and featuring Timbaland, which functions as a reminder and a connection to Hudson's roots. The unreleased album has been garnering serious attention with the release of fresh tracks that show off a new sound, a thoughtful departure and a fearless rendering of her work produced by artists like Pharrell, Gorgon City, Timbaland, R. Kelly and others. In spring of 2014, Hudson was seen in \"Lullaby,\" a film by director Andrew Levitas. In November 2013, Hudson also appeared in her first movie musical since \"Dreamgirls,\" in \"Black Nativity.\" Just prior, Hudson was seen in \"The Inevitable Defeat of Mister and Pete.\" In September of the same year, Hudson starred alongside Terrence Howard in Darrell Roodt's \"Winnie Mandela.\" The role recently garnered Hudson an NAACP Image Award nomination for \"Best Actress\". Expanding her talents in the arts, Hudson added author to her list of accomplishments in January 2012 with the release her New York Times best-selling memoir, \"I Got This: How I Changed My Ways, Found Myself and Lost Everything that Weighed Me Down\". Hudson also received an NAACP Image Award nomination in 2009 for her role in Fox Searchlight's \"The Secret Life of Bees.\" Prior to \"Bees,\" Hudson co-starred in the box office hit \"Sex and the City: The Movie.\" In 2009, Jennifer, along with her sister Julia, founded The Julian D. King Gift Foundation, as a catalyst for change in children's health, education and welfare. The Foundation exists to provide stability, support and positive experiences for children of all backgrounds so that they will become productive, confident and happy adults.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTczMDU5OV5BMl5BanBnXkFtZTcwNDI0ODY1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1617685","name":"Jennifer Hudson","idIMDB":"nm1617685"},"actorId":"nm1617685","character":"Herself - Performer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jessie J","urlProfile":"http://www.imdb.com/name/nm3697476","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MjI4MjAwMF5BMl5BanBnXkFtZTcwMjU1ODc0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 March 1988","placeOfBirth":" Chadwell Heath, Essex, England, UK","birthName":"Jessica Ellen Cornish","height":"5' 9\" (1.75 m)","bio":"Jessie J was born on March 27, 1988 in Chadwell Heath, Essex, England as Jessica Ellen Cornish.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MjI4MjAwMF5BMl5BanBnXkFtZTcwMjU1ODc0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3697476","name":"Jessie J","idIMDB":"nm3697476"},"actorId":"nm3697476","character":"Herself - Performer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Lopez","urlProfile":"http://www.imdb.com/name/nm0520064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY4NDgwODUyOV5BMl5BanBnXkFtZTcwOTAyNTE2Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 April 1961","placeOfBirth":" Mission Hills, California, USA","birthName":"George Edward Lopez","height":"5' 10\" (1.78 m)","bio":"George Lopez was born on April 23, 1961 in Mission Hills, California, USA as George Edward Lopez. He is a producer and actor, known for Lopez Tonight (2009), George Lopez: It's Not Me, It's You (2012) and George Lopez (2002). He was previously married to Ann Serrano Lopez.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY4NDgwODUyOV5BMl5BanBnXkFtZTcwOTAyNTE2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0520064","name":"George Lopez","nicknames":["G. Lo"],"idIMDB":"nm0520064"},"actorId":"nm0520064","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Metallica","urlProfile":"http://www.imdb.com/name/nm0582376","urlPhoto":"","biography":{"urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0582376","name":"Metallica","idIMDB":"nm0582376"},"actorId":"nm0582376","character":"Themselves - Performers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Oliver","urlProfile":"http://www.imdb.com/name/nm1056659","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0Mjg2NDU2M15BMl5BanBnXkFtZTgwMzkwOTQzMjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 April 1977","placeOfBirth":" Birmingham, England, UK","birthName":"John William Oliver","height":"6' (1.83 m)","bio":"John Oliver was born on April 23, 1977 in Birmingham, England as John William Oliver. He is a writer and actor, known for The Daily Show (1996), John Oliver: Terrifying Times (2008) and The Rally to Restore Sanity and/or Fear (2010). He has been married to Kate Norley since October 2011. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0Mjg2NDU2M15BMl5BanBnXkFtZTgwMzkwOTQzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1056659","name":"John Oliver","idIMDB":"nm1056659"},"actorId":"nm1056659","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rihanna","urlProfile":"http://www.imdb.com/name/nm1982597","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNTI5ODg2NF5BMl5BanBnXkFtZTcwNDQ3MDA0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1988","placeOfBirth":" St. Michael, Barbados","birthName":"Robyn Rihanna Fenty","height":"5' 8\" (1.73 m)","bio":"Robyn Rihanna Fenty was born in a parish in Barbados called St. Michael, to Monica (Braithwaite), an accountant, and Ronald Fenty, a warehouse supervisor. Her mother has Afro-Guyanese ancestry and her father has Afro-Barbadian, English, Scottish and Irish ancestry (known as \"Redlegs\" in the Caribbean). Rihanna lived the life of a normal island girl going to Combermere, a top sixth form school. Rihanna won numerous beauty pageants and performed Mariah Carey's single \"Hero\" in a school talent show. Her life changed forever when one of her friends introduced her to Evan Rodgers, a producer from New York who was in Barbados for a vacation with his wife, who is a native. Rodgers arranged for her to go to New York to meet Jay Z, CEO of Def Jam Records. He heard her sing and knew she was going to be incredibly successful. She was age 16 when she was signed to Def Jam. Since then, she's amassed phenomenal success.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNTI5ODg2NF5BMl5BanBnXkFtZTcwNDQ3MDA0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1982597","name":"Rihanna","nicknames":["RiRi","The Caribbean Queen","The Barbados Babe","The Bajan Beauty","The Princess of Pop"],"idIMDB":"nm1982597"},"actorId":"nm1982597","character":"Herself - Performer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steven Spielberg","urlProfile":"http://www.imdb.com/name/nm0000229","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NjAzNzE1MV5BMl5BanBnXkFtZTYwNTk0ODc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1946","placeOfBirth":" Cincinnati, Ohio, USA","birthName":"Steven Allan Spielberg","height":"5' 7½\" (1.71 m)","bio":"Undoubtedly one of the most influential film personalities in the history of film, Steven Spielberg is perhaps Hollywood's best known director and one of the wealthiest filmmakers in the world. Spielberg has countless big-grossing, critically acclaimed credits to his name, as producer, director and writer. Steven Allan Spielberg was born in 1946 in Cincinnati, Ohio, to Leah Frances (Posner), a concert pianist and restaurateur, and Arnold Spielberg, an electrical engineer who worked in computer development. His parents were both born to Russian Jewish immigrant families. Steven spent his younger years in Haddon Township, New Jersey, Phoenix, Arizona, and later Saratoga, California. He went to California State University Long Beach, but dropped out to pursue his entertainment career. He gained notoriety as an uncredited assistant editor on the classic western Wagon Train (1957). Among his early directing efforts were Battle Squad (1961), which combined World War II footage with footage of an airplane on the ground that he makes you believe is moving. He also directed Escape to Nowhere (1961), which featured children as World War Two soldiers, including his sister Anne Spielberg, and The Last Gun (1959), a western. All of these were short films. The next couple of years, Spielberg directed a couple of movies that would portend his future career in movies. In 1964, he directed Firelight (1964), a movie about aliens invading a small town. In 1967, he directed Slipstream (1967), which was unfinished. However, in 1968, he directed Amblin' (1968), which featured the desert prominently, and not the first of his movies in which the desert would feature so prominently. Amblin' also became the name of his production company, which turned out such classics as E.T. the Extra-Terrestrial (1982). Spielberg had a unique and classic early directing project, Duel (1971), with Dennis Weaver. In the early 1970s, Spielberg was working on TV, directing among others such series as Rod Serling's Night Gallery (1969), Marcus Welby, M.D. (1969) and Columbo: Murder by the Book (1971). All of his work in television and short films, as well as his directing projects, were just a hint of the wellspring of talent that would dazzle audiences all over the world. Spielberg's first major directorial effort was The Sugarland Express (1974), with Goldie Hawn, a film that marked him as a rising star. It was his next effort, however, that made him an international superstar among directors: Jaws (1975). This classic shark attack tale started the tradition of the summer blockbuster or, at least, he was credited with starting the tradition. His next film was the classic Close Encounters of the Third Kind (1977), a unique and original UFO story that remains a classic. In 1978, Spielberg produced his first film, the forgettable I Wanna Hold Your Hand (1978), and followed that effort with Used Cars (1980), a critically acclaimed, but mostly forgotten, Kurt Russell\\\\Jack Warden comedy about devious used-car dealers. Spielberg hit gold yet one more time with Raiders of the Lost Ark (1981), with Harrison Ford taking the part of Indiana Jones. Spielberg produced and directed two films in 1982. The first was Poltergeist (1982), but the highest-grossing movie of all time up to that point was the alien story E.T. the Extra-Terrestrial (1982). Spielberg also helped pioneer the practice of product placement. The concept, while not uncommon, was still relatively low-key when Spielberg raised the practice to almost an art form with his famous (or infamous) placement of Reece's Pieces in \"E.T.\" Spielberg was also one of the pioneers of the big-grossing special-effects movies, like \"E.T.\" and \"Close Encounters\", where a very strong emphasis on special effects was placed for the first time on such a huge scale. In 1984, Spielberg followed up \"Raiders\" with Indiana Jones and the Temple of Doom (1984), which was a commercial success but did not receive the critical acclaim of its predecessor. As a producer, Spielberg took on many projects in the 1980s, such as The Goonies (1985), and was the brains behind the little monsters in Gremlins (1984). He also produced the cartoon An American Tail (1986), a quaint little animated classic. His biggest effort as producer in 1985, however, was the blockbuster Back to the Future (1985), which made Michael J. Fox an instant superstar. As director, Spielberg took on the book The Color Purple (1985), with Whoopi Goldberg and Oprah Winfrey, with great success. In the latter half of the 1980s, he also directed Empire of the Sun (1987), a mixed success for the occasionally erratic Spielberg. Success would not escape him for long, though. The late 1980s found Spielberg's projects at the center of pop-culture yet again. In 1988, he produced the landmark animation/live-action film Who Framed Roger Rabbit (1988). The next year proved to be another big one for Spielberg, as he produced and directed Always (1989) as well as Indiana Jones and the Last Crusade (1989), and Back to the Future Part II (1989). All three of the films were box-office and critical successes. Also, in 1989, he produced the little known comedy-drama Dad (1989), with Jack Lemmon and Ted Danson, which got mostly mixed results. Spielberg has also had an affinity for animation and has been a strong voice in animation in the 1990s. Aside from producing the landmark \"Who Framed Roger Rabbit\", he produced the animated series Tiny Toon Adventures (1990), Animaniacs (1993), Pinky and the Brain (1995), Freakazoid! (1995), Pinky, Elmyra & the Brain (1998), Family Dog (1993) and Toonsylvania (1998). Spielberg also produced other cartoons such as The Land Before Time (1988), We're Back! A Dinosaur's Story (1993), Casper (1995) (the live action version) as well as the live-action version of The Flintstones (1994), where he was credited as \"Steven Spielrock\". Spielberg also produced many Roger Rabbit short cartoons, and many Pinky and the Brain, Animaniacs and Tiny Toons specials. Spielberg was very active in the early 1990s, as he directed Hook (1991) and produced such films as the cute fantasy Joe Versus the Volcano (1990) and An American Tail: Fievel Goes West (1991). He also produced the unusual comedy thriller Arachnophobia (1990), Back to the Future Part III (1990) and Gremlins 2: The New Batch (1990). While these movies were big successes in their own right, they did not quite bring in the kind of box office or critical acclaim as previous efforts. In 1993, Spielberg directed Jurassic Park (1993), which for a short time held the record as the highest grossing movie of all time, but did not have the universal appeal of his previous efforts. Big box-office spectacles were not his only concern, though. He produced and directed Schindler's List (1993), a stirring film about the Holocaust. He won best director at the Oscars, and also got Best Picture. In the mid-90s, he helped found the production company DreamWorks, which was responsible for many box-office successes. As a producer, he was very active in the late 90s, responsible for such films as The Mask of Zorro (1998), Men in Black (1997) and Deep Impact (1998). However, it was on the directing front that Spielberg was in top form. He directed and produced the epic Amistad (1997), a spectacular film that was shorted at the Oscars and in release due to the fact that its release date was moved around so much in late 1997. The next year, however, produced what many believe was one of the best films of his career: Saving Private Ryan (1998), a film about World War Two that is spectacular in almost every respect. It was stiffed at the Oscars, losing best picture to Shakespeare in Love (1998). Spielberg produced a series of films, including Evolution (2001), Hantise (1999) and Shrek (2001). he also produced two sequels to Jurassic Park (1993), which were financially but not particularly critical successes. In 2001, he produced a mini-series about World War Two that definitely *was* a financial and critical success: Band of Brothers (2001), a tale of an infantry company from its parachuting into France during the invasion to the Battle of the Bulge. Also in that year, Spielberg was back in the director's chair for A.I. Artificial Intelligence (2001), a movie with a message and a huge budget. It did reasonably at the box office and garnered varied reviews from critics. Spielberg has been extremely active in films there are many other things he has done as well. He produced the short-lived TV series SeaQuest 2032 (1993), an anthology series entitled Amazing Stories (1985), created the video-game series \"Medal of Honor\" set during World War Two, and was a starting producer of ER (1994). Spielberg, if you haven't noticed, has a great interest in World War Two. He and Tom Hanks collaborated on Shooting War (2000), a documentary about World War II combat photographers, and he produced a documentary about the Holocaust called Eyes of the Holocaust (2000). With all of this to Spielberg's credit, it's no wonder that he's looked at as one of the greatest ever figures in entertainment.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NjAzNzE1MV5BMl5BanBnXkFtZTYwNTk0ODc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000229","name":"Steven Spielberg","idIMDB":"nm0000229"},"actorId":"nm0000229","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bruce Springsteen","urlProfile":"http://www.imdb.com/name/nm0819803","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NzM5NTQ4NV5BMl5BanBnXkFtZTcwMDA1MTUyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1949","placeOfBirth":" Long Branch, New Jersey, USA","birthName":"Bruce Frederick Joseph Springsteen","height":"5' 9½\" (1.77 m)","bio":"Bruce Frederick Joseph Springsteen was born September 23, 1949 in New Jersey, USA. His father, Douglas Frederick Springsteen, worked as a bus driver, and was of Irish and Dutch ancestry. His mother, Adele Ann (Zerilli), worked as a legal secretary, and was of Italian ancestry. He has an older sister, Virginia, and a younger sister Pamela Springsteen. Bruce was raised as a Catholic. He was inspired to take up music when he, at the age of seven, saw Elvis Presley on The Ed Sullivan Show (1948). When he was 13 he bought his first guitar for 18 dollars. His mother took out a loan when Bruce was 16 and bought him a Kent guitar for 60 dollars. In 1965, he became the lead guitarist in the band \"The Castiles\", he would later become lead singer in the band. The Castiles recorded two original songs at a public recording studio in Brick Township, New Jersey. From 1969 to 1971 he performed with Steven Van Zandt, Danny Federici and Vini \"Mad Dog\" Lopez in a band called \"Child\", that was renamed later to \"Steel Mill\" when guitarist Robbin Thompson joined the band. In 1972, he signed a record deal with Columbia Records and released his debut album, \"Greetings from Asbury Park, N.J.\", with his New Jersey-based colleagues, who would later be called \"The E Street Band\", In January, 1973. The album had critical success and so did their second album, \"The Wild, the Innocent & the E Street Shuffle\", released in September, 1973, but had little commercial success. In 1975, after more than 14 month of recording, their third album was released, \"Born to Run\", which had both critical and commercial success for Springsteen and the band. In 1977, he returned to the studio, after a two-year legal battle with former manager Mike Appel, and produced the album, \"Darkness on the Edge of Town\", released in 1978 and became a turning point musically for his career. In 1980 came the release of \"The River\", the album sold well and he followed up with the album \"Nebraska\" which had critical success but had little commercial success. Springsteen came back with a bang with the release of the album \"Born in the U.S.A.\" in 1984, which sold 15 million copies in the U.S. alone and had seven top ten singles. It became one of the best-selling albums of all time. After the huge success of the \"Born in the U.S.A.\" album he released a more calm and sedate album in 1987, \"Tunnel of Love\", which included songs about love lost and the challenges of love, after the break-up with first wife, Julianne Phillips. The albums released in 1992, \"Lucky Town\" and \"Human Touch\" were also popular, Human Touch being the most popular of the two, hitting the number one spot of the best-selling albums in the UK. In 1994 he won an academy award for the song \"Streets of Philadelphia\" featured in the film Philadelphia (1993). In 1995, he released the album \"The Ghost of Tom Joad\", which was mostly a solo guitar album and was inspired by \"Journey to Nowhere: The Saga of the New Underclass,\" a book by Pulitzer Prize-winning writer Dale Maharidge. After being apart from the E Street Band for several years they reunited with a successful tour which ended in Madison Square Garden in New York in the year 2000. In 2002 he released the first studio album with the full band in over 18 years, \"The Rising\", and it became a critical and commercial success. In 2005 he released his third folk album (after \"Nebraska\" and \"The Ghost of Tom Joad\"), \"Devils & Dust\" It was followed by \"We Shall Overcome: The Seeger Sessions\" in 2006 and \"Magic\" in 2007. His 16th album will be released on January 27, 2009 and is called \"Working on a Dream\". He married for the first time at the age of 35 to actress Julianne Phillips. The marriage helped boost her acting career, but his traveling took it's toll on the marriage and the final blow came when she found out his affair with the American singer/songwriter/guitarist Patti Scialfa. Their marriage ended in 1989. He then married Patti Scialfa on June 8th, 1991, They had lived together since the separation between him and his first wife and they had a child before they married. They have three children together: Evan James Springsteen (born July 25, 1990), Jessica Rae (born December 30, 1991) and Sam Ryan Springsteen (born January 5, 1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NzM5NTQ4NV5BMl5BanBnXkFtZTcwMDA1MTUyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0819803","name":"Bruce Springsteen","nicknames":["The Boss"],"idIMDB":"nm0819803"},"actorId":"nm0819803","character":"Himself - Performer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt4083124","urlIMDB":"http://www.imdb.com/title/tt4083124","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":null,"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.2","filmingLocations":[{"location":"National Mall, Washington, District of Columbia, USA"}],"awards":[],"votes":"30","type":"TV Special","companyCreditsSimple":[],"keywords":{"keywords":["tv special"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 04:39:39"}}