{"data":{"movies":[{"title":"Avengers: Infinity War","originalTitle":"","year":"2018","releaseDate":"20180504","directors":[{"name":"Anthony Russo","id":"nm0751577"},{"name":"Joe Russo","id":"nm0751648"}],"writers":[{"name":"Jack Kirby","id":"nm0456158"},{"name":"Christopher Markus","id":"nm1321655"}],"urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGQ5NTY3NjktYjIzNS00Y2ZjLWIyODQtMjQzYzg1ZTMzOGI5XkEyXkFqcGdeQXVyNDMwMzEyNzA@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Fantasy","Sci-Fi"],"plot":"The plot is unknown at this time.","simplePlot":"The plot is unknown at this time.","actors":[{"actorName":"Brie Larson","urlProfile":"http://www.imdb.com/name/nm0488953","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4MzAxOTI5NV5BMl5BanBnXkFtZTgwMzMzNTA4NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1989","placeOfBirth":" Sacramento, California, USA","birthName":"Brianne Sidonie Desaulniers","height":"5' 7\" (1.7 m)","bio":"Brie Larson has built an impressive career as an acclaimed television actress, rising feature film star and emerging recording artist. A native of Sacramento, Brie started studying drama at the early age of 6, as the youngest student ever to attend the American Conservatory Theater in San Francisco. She starred in one of Disney Channel's most watched original movies, Right on Track (2003), as well as the WB's Raising Dad (2001) and MGM's teen comedy Sleepover (2004) - all before graduating from middle school. Brie's work includes the coming-of-age drama Tanner Hall (2009) and the dark comedy, Just Peck (2009), with Marcia Cross and Keir Gilchrist. She earned critical praise for her role in the independent feature, Remember the Daze (2007) (aka \"The Beautiful Ordinary\"), singled out by Variety as the \"scene stealer\" of the film, opposite Amber Heard and Leighton Meester. Brie garnered considerable acclaim for her series regular role of \"Kate\", Toni Collette's sarcastic and rebellious daughter, in Showtime's breakout drama United States of Tara (2009), created by Academy Award-winning writer Diablo Cody and based on an original idea by Steven Spielberg. She starred in The Trouble with Bliss (2011) opposite Michael C. Hall, playing a young girl out to seduce him while, in turn, teaching him more about his own life. She also starred in Universal's Scott Pilgrim vs. the World (2010) and Noah Baumbach's Greenberg (2010). In Scott Pilgrim vs. the World (2010), Brie played rock star \"Envy Adams\", former flame of Michael Cera, and in Greenberg (2010), she starred as a young temptress trying to flirt with Ben Stiller, a New Yorker traveling West to try to figure out his life. In addition to her talents as an actress, Brie has simultaneously nurtured an ever-growing musical career. At 13, Brie landed her first record deal at Universal Records with Tommy Mottola, who signed her sight-unseen. Her first release in 2005 led to a nationwide tour.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM4MzAxOTI5NV5BMl5BanBnXkFtZTgwMzMzNTA4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0488953","name":"Brie Larson","idIMDB":"nm0488953"},"actorId":"nm0488953","character":"Carol Danvers / Captain Marvel","urlCharacter":"http://www.imdb.com/character/ch0562021","main":true},{"actorName":"Scarlett Johansson","urlProfile":"http://www.imdb.com/name/nm0424060","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTUwMDYwNl5BMl5BanBnXkFtZTcwNTUyNzc3Nw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1984","placeOfBirth":" New York City, New York, USA","birthName":"Scarlett Ingrid Johansson","height":"5' 3\" (1.6 m)","bio":"Scarlett Ingrid Johansson was born in New York City. Her mother, Melanie Sloan, is from a Jewish family from the Bronx, and her father, Karsten Johansson, is a Danish-born architect, from Copenhagen. She has a sister, Vanessa Johansson, who is also an actress, a brother, Adrian, a twin brother, Hunter Johansson, born three minutes after her, and a paternal half-brother, Christian. Her grandfather was writer Ejner Johansson. Johansson began acting during childhood, after her mother started taking her to auditions. She made her professional acting debut at the age of eight in the off-Broadway production of \"Sophistry\" with Ethan Hawke, at New York's Playwrights Horizons. She would audition for commercials but took rejection so hard her mother began limiting her to film tryouts. She made her film debut at the age of nine, as John Ritter's character's daughter in the fantasy comedy North (1994). Following minor roles in Just Cause (1995), as the daughter of Sean Connery and Kate Capshaw's character, and If Lucy Fell (1996), she played the role of Amanda in Manny & Lo (1996). Her performance in Manny & Lo garnered a nomination for the Independent Spirit Award for Best Lead Female, and positive reviews, one noting, \"[the film] grows on you, largely because of the charm of ... Scarlett Johansson\", while San Francisco Chronicle critic Mick LaSalle commentated on her \"peaceful aura\", and wrote, \"If she can get through puberty with that aura undisturbed, she could become an important actress.\". After appearing in minor roles in Fall (1997) and Home Alone 3 (1997), Johansson garnered widely spread attention for her performance in The Horse Whisperer (1998), directed by Robert Redford, where she played Grace MacLean, a teenager traumatized by a riding accident. She received a nomination for the Chicago Film Critics Association Award for Most Promising Actress for the film. In 1999, she appeared in My Brother the Pig (1999) and in the music video for Mandy Moore's single, \"Candy\". Although the film was not a box office success, she received praise for her breakout role in Ghost World (2001), credited with \"sensitivity and talent [that] belie her age\". She was also featured in the Coen Brothers' dark drama The Man Who Wasn't There (2001), opposite Billy Bob Thornton and Frances McDormand. She appeared in the horror comedy Eight Legged Freaks (2002) with David Arquette and Kari Wuhrer. In 2003, she was nominated for two Golden Globe Awards, one for drama (Girl with a Pearl Earring (2003)) and one for comedy (Lost in Translation (2003)), her breakout role, starring opposite Bill Murray, and receiving rave reviews and a Best Actress Award at the Venice Film Festival. Her film roles include the critically acclaimed Weitz brothers' film In Good Company (2004), as well as starring opposite John Travolta in A Love Song for Bobby Long (2004), which garnered her a third Golden Globe Award nomination. She dropped out of Mission: Impossible III (2006) due to scheduling conflicts. Her next film role was in The Island (2005) alongside Ewan McGregor which earned weak reviews from U.S. critics. After this, she appeared in Woody Allen's Match Point (2005) and was nominated again for a Golden Globe Award. In May 2008, she released her album \"Anywhere I Lay My Head\", a collection of Tom Waits covers featuring one original song. Also that year, she starred in Frank Miller's The Spirit (2008), the Woody Allen film Vicky Cristina Barcelona (2008), and played Mary Boleyn opposite Natalie Portman in The Other Boleyn Girl (2008). Since then, she has appeared as part of an ensemble cast in the romantic comedy He's Just Not That Into You (2009), the action superhero film Iron Man 2 (2010), the comedy-drama We Bought a Zoo (2011) and started as the original scream queen, Janet Leigh, in Hitchcock (2012). She then played her character, Black Widow, in the blockbuster action films The Avengers (2012), Captain America: The Winter Soldier (2014), Avengers: Age of Ultron (2015), Captain America: Civil War (2016), and Avengers: Infinity War (2018), and also headlined the science-fiction thriller Lucy (2014), a box office success. With more than a decade of work already under her belt, Scarlett has proven to be one of Hollywood's most talented young actresses. Scarlett and Canadian actor Ryan Reynolds were engaged in May 2008 and married in September of that same year. In 2010, the couple announced their separation, and subsequently divorced in 2011. In 2013, she became engaged to French journalist Romain Dauriac, the couple married in 2014, and have one daughter, Rose Dorothy Dauriac. In January 2017, the couple announced their separation, and subsequently divorced in March of that same year.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTUwMDYwNl5BMl5BanBnXkFtZTcwNTUyNzc3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0424060","name":"Scarlett Johansson","idIMDB":"nm0424060"},"actorId":"nm0424060","character":"Natasha Romanoff / Black Widow","urlCharacter":"http://www.imdb.com/character/ch0183355","main":true},{"actorName":"Chris Pratt","urlProfile":"http://www.imdb.com/name/nm0695435","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg3MTgwOTgzMV5BMl5BanBnXkFtZTgwODIxMTUwMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1979","placeOfBirth":" Virginia, Minnesota, USA","birthName":"Christopher Michael Pratt","height":"6' 2\" (1.88 m)","bio":"Christopher Michael Pratt is an American film and television actor. He came to prominence from his television roles, including Bright Abbott in Everwood (2002), Ché in The O.C. (2003), and Andy Dwyer and Parks and Recreation (2009), and notable film roles in Moneyball (2011), The Five-Year Engagement (2012), Zero Dark Thirty (2012), Delivery Man (2013), and Her (2013). In 2014, he broke out as a leading man after headlining two of the year's biggest films: he voiced Emmet Brickowoski, in The Lego Movie (2014), and starred as Peter Quill / Star-Lord in Guardians of the Galaxy (2014). In 2015, he headlined the sci-fi thriller Jurassic World (2015), the fourth installment in the Jurassic Park franchise and his most financially successful film. In 2016, he co-starred in the remake The Magnificent Seven (2016), with Denzel Washington and Ethan Hawke, and appeared with Jennifer Lawrence in the sci-fi drama Passengers (2016). In the near future, he returns as Star-Lord for Guardians of the Galaxy Vol. 2 (2017), with Untitled Jurassic World Sequel (2018) not far behind. He was born in Virginia, Minnesota, to Kathleen Louise (Indahl), who worked at a supermarket, and Daniel Clifton Pratt, who remodeled houses. His mother is of Norwegian descent and his father had English, German, Swiss, and French-Canadian ancestry. Chris grew up in Lake Stevens, Washington state. He is married to fellow Washington State native, Anna Faris, whom he met on the film set of Take Me Home Tonight (2011), and with whom he has one child, Jack Pratt. Chris's hobbies include fishing, hunting and working on cars. He has two older siblings, Cully and Angie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg3MTgwOTgzMV5BMl5BanBnXkFtZTgwODIxMTUwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0695435","name":"Chris Pratt","nicknames":["Monkeyboy"],"idIMDB":"nm0695435"},"actorId":"nm0695435","character":"Peter Quill / Star-Lord","urlCharacter":"http://www.imdb.com/character/ch0373829","main":true},{"actorName":"Benedict Cumberbatch","urlProfile":"http://www.imdb.com/name/nm1212722","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MDkzMDQwOF5BMl5BanBnXkFtZTgwOTE1Mjg1MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 July 1976","placeOfBirth":" Hammersmith, London, England, UK","birthName":"Benedict Timothy Carlton Cumberbatch","height":"6' (1.83 m)","bio":"Benedict Timothy Carlton Cumberbatch was born and raised in London, England. His parents, Wanda Ventham and Timothy Carlton (Timothy Carlton Congdon Cumberbatch), are both actors. He is a grandson of submarine commander Henry Carlton Cumberbatch, and a great-grandson of diplomat Henry Arnold Cumberbatch CMG. Cumberbatch attended Brambletye School and Harrow School. Whilst at Harrow, he had an arts scholarship and painted large oil canvases. It's also where he began acting. After he finished school, he took a year off to volunteer as an English teacher in a Tibetan monastery in Darjeeling, India. On his return, he studied drama at Manchester University. He continued his training as an actor at the London Academy of Music and Dramatic Art graduating with an M.A. in Classical Acting. By the time he had completed his studies, he already had an agent. Cumberbatch has worked in theatre, television, film and radio. His breakthrough on the big screen came in 2004 when he portrayed Stephen Hawking in the television movie Hawking (2004). In 2010, he became a household name as Sherlock Holmes on the British television series Sherlock (2010). In 2011, he appeared in two Oscar-nominated films - War Horse (2011) and La taupe (2011). He followed this with acclaimed roles in the science fiction fiction film Star Trek Into Darkness (2013), the Oscar-winning drama 12 Years a Slave (2013), The Fifth Estate (2013) and August: Osage County (2013). In 2014, he portrayed Alan Turing in The Imitation Game (2014) which earned him a Golden Globe, Screen Actors Guild Award, British Academy of Film and Television Arts and an Academy Award nominations for Best Actor in a Leading Role. Cumberbatch was appointed Commander of the Order of the British Empire (CBE) by Queen Elizabeth II in the 2015 Birthday Honours for his services to the performing arts and to charity. Cumberbatch's engagement to theatre and opera director Sophie Hunter, whom he has known for 17 years, was announced in the \"Forthcoming Marriages\" section of The Times newspaper on November 5, 2014. On February 14, 2015, the couple married at the 12th century Church of St. Peter and St. Paul on the Isle of Wight followed by a reception at Mottistone Manor. They have two sons, Christopher Carlton (born 2015) and Hal Auden (born 2017).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MDkzMDQwOF5BMl5BanBnXkFtZTgwOTE1Mjg1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1212722","name":"Benedict Cumberbatch","nicknames":["Ben"],"idIMDB":"nm1212722"},"actorId":"nm1212722","character":"Dr. Stephen Strange","urlCharacter":"http://www.imdb.com/character/ch0387980","main":true},{"actorName":"Vin Diesel","urlProfile":"http://www.imdb.com/name/nm0004874","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNzA4MDYxN15BMl5BanBnXkFtZTcwOTI1MDAxOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1967","placeOfBirth":" Alameda County, California, USA","birthName":"Mark Sinclair","height":"5' 11¾\" (1.82 m)","bio":"Vin Diesel was born Mark Sinclair in Alameda County, California, along with his fraternal twin brother, Paul Vincent. He was raised by his astrologer/psychologist mother, Delora Sherleen (Sinclair), and adoptive father, Irving H. Vincent, an acting instructor and theater manager, in an artist's housing project in New York City's Greenwich Village. He never knew his biological father. His mother is white (with English, German, Scottish, and Irish ancestry), and his adoptive father is African-American; referring to his biological father's background, Diesel has said that he himself is \"definitely a person of colour\". His first break in acting happened by chance, when at the age of seven he and his friends broke into a theatre to vandalize it. A woman stopped them and offered them each a script and $20, on the condition that they would attend everyday after school. From there, Vin's fledgling career progressed from the New York repertory company run by his father, to the Off-Off-Broadway circuit. At age seventeen and already sporting a well-honed physique, he became a bouncer at some of New York's hippest clubs to earn himself some extra cash. It was at this time that he changed his name to Vin Diesel. Following high school, Vin enrolled as an English major at Hunter College, but dropped out after three years to go to Hollywood to further his acting career. Being an experienced theatre actor did not make any impression in Hollywood and after a year of struggling to make his mark, he returned to New York. His mother then gave him a book called \"Feature Films at used Car Prices\" by Rick Schmidt. The book showed him that he could take control of his career and make his own movies. He wrote a short film based on his own experiences as an actor, called Multi-Facial (1995), which was shot in less than three days at a cost of $3,000. Multi-Facial (1995) was eventually accepted for the 1995 Cannes Film Festival where it got a tumultuous reception. Afterwards, Vin returned to Los Angeles and raised almost $50,000 through telemarketing to fund the making of his first feature, Strays (1997). Six months after shooting, the film was accepted for the 1997 Sundance Film Festival, and although it received a good reception, it did not sell as well as hoped. Yet again Vin returned disappointed to New York only to receive a dream phone call. Steven Spielberg was impressed by Multi-Facial (1995) and wanted to meet Vin, leading him to be cast in Saving Private Ryan (1998). Multi-Facial (1995) earned Vin more work, when the director of The Iron Giant (1999) saw it and decided to cast Vin in the title role. From there, Vin's career has steadily grown, with him securing his first lead role as Richard B. Riddick in the sci-fi film Pitch Black (2000). The role has earned him a legion of devoted fans and the public recognition he deserves. Since then, he has headlined a series of blockbusters, often but not only centered on fast-driving motor vehicles: The Fast and the Furious (2001), xXx (2002), Baby-sittor (2005), Fast & Furious (2009), Fast Five (2011), Fast & Furious 6 (2013), and Furious 7 (2015). He also voiced Groot in Guardians of the Galaxy (2014) and starred in the lower-budgeted courtroom drama Jugez-moi coupable (2006), the latter directed by Sidney Lumet.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNzA4MDYxN15BMl5BanBnXkFtZTcwOTI1MDAxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004874","name":"Vin Diesel","idIMDB":"nm0004874"},"actorId":"nm0004874","character":"Groot","urlCharacter":"http://www.imdb.com/character/ch0361372","main":true},{"actorName":"Robert Downey Jr.","urlProfile":"http://www.imdb.com/name/nm0000375","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1965","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Robert John Downey Jr","height":"5' 8½\" (1.74 m)","bio":"Robert Downey Jr. has evolved into one of the most respected actors in Hollywood. With an amazing list of credits to his name, he has managed to stay new and fresh even after over four decades in the business. Downey was born April 4, 1965 in Manhattan, New York, the son of writer, director and filmographer Robert Downey Sr. and actress Elsie Downey (née Elsie Ann Ford). Robert's father is of half Lithuanian Jewish, one quarter Hungarian Jewish, and one quarter Irish, descent, while Robert's mother was of English, Scottish, German, and Swiss-German ancestry. Robert and his sister, Allyson Downey, were immersed in film and the performing arts from a very young age, leading Downey Jr. to study at the Stagedoor Manor Performing Arts Training Center in upstate New York, before moving to California with his father following his parents' 1978 divorce. In 1982, he dropped out of Santa Monica High School to pursue acting full time. Downey Sr., himself a drug addict, exposed his son to drugs at a very early age, and Downey Jr. would go on to struggle with abuse for decades. Downey Jr. made his debut as an actor at the age of five in the film Pound (1970), written and directed by his father, Robert Downey Sr.. He built his film repertoire throughout the 1980s and 1990s with roles in Tuff Turf (1985), Weird Science (1985), True Believer (1989), and Wonder Boys (2000) among many others. In 1992, Downey received an Academy Award nomination and won the BAFTA (British Academy Award) for Best Actor for his performance in the title role of Chaplin (1992). In Robert Altman's Short Cuts (1993), he appeared as an aspiring film make-up artist whose best friend commits murder. In Oliver Stone's Natural Born Killers (1994), with Woody Harrelson and Juliette Lewis, Downey starred as a tabloid TV journalist who exploits a murderous couple's killing spree to boost his ratings. For the comedy Heart and Souls (1993), Downey starred as a young man with a special relationship with four ghosts. In 1995, Downey starred in Restoration (1995), with Hugh Grant, Meg Ryan and Ian McKellen, directed by Michael Hoffman. Also that year, he starred in Richard III (1995), in which he appears opposite his Restoration (1995) co-star McKellen. In 1997, Downey was seen in Robert Altman's The Gingerbread Man (1998), alongside Kenneth Branagh, Daryl Hannah and Embeth Davidtz; in One Night Stand (1997), directed by Mike Figgis and starring Wesley Snipes and Nastassja Kinski; and in Hugo Pool (1997), directed by his father, Robert Downey Sr. and starring Sean Penn and Patrick Dempsey. In September of 1999, Downey appeared in Black & White (1999), written and directed by James Toback, along with Ben Stiller, Elijah Wood, Gaby Hoffmann, Brooke Shields and Claudia Schiffer. In January of 1999, he starred with Annette Bening and Aidan Quinn in In Dreams (1999), directed by Neil Jordan. In 2000, Downey co-starred with Michael Douglas and Tobey Maguire in Wonder Boys (2000), directed by Curtis Hanson. In this dramatic comedy, Downey played the role of a bisexual literary agent. In 2001, Downey made his prime-time television debut when he joined the cast of the Fox-TV series Ally McBeal (1997) as attorney \"Larry Paul\". For this role, he won the Golden Globe Award for Best Performance by an Actor in a Supporting Role in a Series, Mini-Series or Motion Picture Made for Television, as well as the Screen Actors Guild Award for Outstanding Performance by a Male in a Comedy Series. In addition, Downey was nominated for an Emmy for Outstanding Supporting Actor in a Comedy Series. The actor's drug-related problems escalated from 1996 to 2001, leading to arrests, rehab visits and incarcerations, and he was eventually fired from Ally McBeal (1997). Emerging clean and sober in 2003, Downey Jr. began to rebuild his career. He marked his debut into music with his debut album, titled \"The Futurist\", on the Sony Classics Label on November 23rd, 2004. The album's eight original songs, that Downey wrote, and his two musical numbers debuting as cover songs revealed his sultry singing voice and his musical talents. Downey displayed his versatility in two different films in October 2003: the musical/drama The Singing Detective (2003), a remake of the BBC hit of the same name, and the thriller Gothika (2003) starring Halle Berry and Penélope Cruz. Downey starred in powerful yet humbling roles inspired by real-life accounts of some of history's most precious kept secrets, including Richard Linklater's A Scanner Darkly (2006) in 2006 co-starring Keanu Reeves, Winona Ryder and Woody Harrelson, and Fur: An Imaginary Portrait of Diane Arbus (2006) co-starring Nicole Kidman, a film inspired by the life of Diane Arbus, the revered photographer whose images captured attention in the early 1960s. These roles exhibited Downey's momentum from the previous year of 2005, in which he starred in the Academy Award®-nominated feature film Good Night, and Good Luck. (2005), directed by George Clooney and in Shane Black's action comedy Kiss Kiss Bang Bang (2005) co-starring Val Kilmer. In 2007, he co-starred in David Fincher's suspenseful _Zodiac (2007/I)_ alongside Jake Gyllenhaal and Mark Ruffalo, about the notorious serial killer who haunted San Francisco during the 1970s. In May 2008, Downey achieved critical acclaim and worldwide box office success for his starring role in Iron Man (2008), Jon Favreau's big-screen rendering of the Marvel comic book superhero. The film co-starred Gwyneth Paltrow, Jeff Bridges and Terrence Howard. In August of 2008, Downey starred with Ben Stiller and Jack Black in the comedy Tropic Thunder (2008), and went on to receive an Academy Award®-nomination for Best Supporting Actor for his, Kirk Lazarus. In December 2009, Downey starred in the action-adventure Sherlock Holmes (2009). The film, directed by Guy Ritchie, co-starred Jude Law and Rachel McAdams and earned Downey a Golden Globe for Best Performance by an Actor in a Motion Picture - Comedy or Musical in January of 2010. In early Summer 2010, Downey re-teamed with director Jon Favreau and reprised his role as \"Tony Stark/Iron Man\" in the hugely successful sequel to the original film, Iron Man 2 (2010), starring Gwyneth Paltrow, Scarlett Johansson, Samuel L. Jackson and Mickey Rourke. Downey next starred in Due Date (2010), a comedy directed by Todd Phillips, in which he plays the role of an expectant father on a road trip racing to get back in time for the birth of his first child. Due Date (2010), starring The Hangover (2009)'s Zach Galifianakis, was released in November 2010. Downey was honored by Time Magazine's \"Time 100\" in 2008, an annual list of the 100 most influential people in the world. His laurels include two Academy Award nominations, three Golden Globe wins, numerous other award nominations and wins, and tremendous popular and commercial success, particularly in his roles as Sherlock Holmes and Tony Stark (the latter of which he has so far played in Iron Man (2008), Iron Man 2 (2010), The Avengers (2012), Iron Man 3 (2013), and Avengers: Age of Ultron (2015). For three consecutive years, from 2012 to 2015, Downey has topped the Forbes list of Hollywood's highest-paid actors, making an estimated $80 million in earnings between June 2014 and June 2015. In 2005, Downey Jr. married Susan Downey, who gave birth to their son, Exton Elias Downey, on February 7, 2012. Downey also has another son, Indio Falconer Downey, born September 7, 1993, from his first marriage to Deborah Falconer, from whom he was officially divorced in 2004. Robert has jump-started the Team Downey Production Company with wife Susan Downey.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000375","name":"Robert Downey Jr.","nicknames":["Bob","RDJ"],"idIMDB":"nm0000375"},"actorId":"nm0000375","character":"Tony Stark / Iron Man","urlCharacter":"http://www.imdb.com/character/ch0556868","main":true},{"actorName":"Chris Hemsworth","urlProfile":"http://www.imdb.com/name/nm1165110","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2MTI0NTIyNV5BMl5BanBnXkFtZTcwMTA4Nzc3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 August 1983","placeOfBirth":" Melbourne, Victoria, Australia","height":"6' 2¾\" (1.9 m)","bio":"Chris Hemsworth was born in Melbourne, Australia, to Leonie (van Os), a teacher of English, and Craig Hemsworth, a social-services counselor. His brothers are actors Liam Hemsworth and Luke Hemsworth. He is of Dutch (from his immigrant maternal grandfather), Irish, English, Scottish, and German ancestry. His uncle, by marriage, was Rod Ansell, the bushman who inspired the film Crocodile Dundee (1986). Chris saw quite a bit of the country in his youth, after his family moved to the Northern Territory before finally settling on Phillip Island, to the south of Melbourne. In 2004, he unsuccessfully auditioned for the role of Robbie Hunter in the Australian soap opera Summer Bay (1988) but was recalled for the role of Kim Hyde which he played until 2007. In 2006, he entered the Australian version of Dancing with the Stars (2004) and his popularity in the soap enabled him to hang on until show 7 (Dancing with the Stars: Episode #5.7 (2006) when he became the fifth contestant to be eliminated. His first Hollywood appearance was in Star Trek (2009), but it was his titular role in Thor (2011) which propelled him to prominence worldwide. He reprised the character in the science fiction blockbuster The Avengers (2012). Chris's American representative, management company ROAR, also manages actress Elsa Pataky, and it was through them that the two met, marrying in 2010. The couple have a daughter and twin sons.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2MTI0NTIyNV5BMl5BanBnXkFtZTcwMTA4Nzc3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1165110","name":"Chris Hemsworth","nicknames":["Kip"],"idIMDB":"nm1165110"},"actorId":"nm1165110","character":"Thor","urlCharacter":"http://www.imdb.com/character/ch0560636","main":true},{"actorName":"Chris Evans","urlProfile":"http://www.imdb.com/name/nm0262635","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTg1OTQzMF5BMl5BanBnXkFtZTcwNjIyMjkyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1981","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Christopher Robert Evans","height":"6' (1.83 m)","bio":"Christopher Robert Evans began his acting career in typical fashion: performing in school productions and community theater. He was born in Boston, Massachusetts, the son of Lisa (Capuano), who worked at the Concord Youth Theater, and G. Robert Evans III, a dentist. His uncle is congressman Mike Capuano. Chris's father is of half German and half Welsh/English/Scottish ancestry, while Chris's mother is of half Italian and half Irish descent. He has an older sister, Carly Evans, and two younger siblings, a brother named Scott Evans, and a sister named Shana Evans. The family moved to suburban Sudbury when he was 11 years-old. Bitten by the acting bug in the first grade because his older sister, Carly, started performing, Evans followed suit and began appearing in school plays. While at Lincoln-Sudbury Regional High School, his drama teacher cited his performance as \"Leontes\" in \"The Winter's Tale\" as exemplary of his skill. After more plays and regional theater, he moved to New York and attended the Lee Strasberg Theater Institute. On the advice of friends, he landed an internship at a casting office and befriended a couple of the agents he regularly communicated with - one of whom later took him on as a client. The screen - not the stage - then became his focus; Evans soon began auditioning for feature films and television series. Evans made one of his first appearances on The Fugitive (2000) (CBS, 2000-2001), a remake of the 1960s series and feature film starring Harrison Ford. In the episode \"Guilt\", Evans played the son of a small-town sheriff who tries to exact revenge after Dr. Richard Kimble - incognito as a liquor store owner - refuses to sell him and his friends alcohol. After small roles in Cherry Falls (2000) and The Newcomers (2000) - two unknown low-budget features - Evans appeared in Boston Public (2000) (Fox, 2000-2004) as a murder suspect. He then appeared in his first major feature, Not Another Teen Movie (2001), a spoof on teen comedies wherein he played a jock who makes a bet that he can turn an unpopular and unkempt girl (Chyler Leigh) into prom queen. After filming a couple of television pilots he was confident would be successful - Just Married (2003) and Eastwick (2002) - he appeared in another listless teen comedy, The Perfect Score (2004), playing an average, ho-hum student who takes part in a plot to steal the SAT test. Hijinks naturally ensue. Then, Evans broke through to the Big Time, grabbing the lead in the kidnapping thriller, Cellular (2004), a suspenseful B movie with a cheesy gimmick - a random wrong number on his cell phone forces him into a high-stakes race to save an unknown woman's life. Despite an unassuming performance from Evans and Kim Basinger as the damsel in distress, Cellular (2004) failed to break any box office records or please a wide majority of critics. Evans then prepared himself for super stardom when he signed on to play Johnny Storm in Fantastic Four (2005), 20th Century Fox's long-awaited adaptation of the Marvel comic. Although the film was wildly uneven and disappointing, Evans nearly stole the show with his energetic, unfettered performance. In that year itself, Chris was noticed by critics and made it into magazine and Internet countdowns, scoring himself a third position of the hot body countdown from Gay.com and #18 on E! Television's 2006 101 Sexiest Celebrity Bodies. The year 2007 also proved to be one successful year for Chris, as he had two movies released around the world that same year, starting with the second installment of the Marvel franchise Fantastic Four. Chris received positive reviews for his performance. The Nanny Diaries (2007), where Evans played Harvard Hottie, showed his sensitive. The year 2008 saw Chris Evans' part of the movie Street Kings (2008), playing the character Detective Paul Diskant. The movie is about police officers trying to cover up their wrongdoings and audiences got to see a serious side of Chris. In the same year, Chris also worked on the movie The Loss of a Teardrop Diamond (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTg1OTQzMF5BMl5BanBnXkFtZTcwNjIyMjkyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0262635","name":"Chris Evans","nicknames":["Cevans"],"idIMDB":"nm0262635"},"actorId":"nm0262635","character":"Steve Rogers / Captain America","urlCharacter":"http://www.imdb.com/character/ch0565201","main":true},{"actorName":"Karen Gillan","urlProfile":"http://www.imdb.com/name/nm2394794","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMDQ0NDk1OV5BMl5BanBnXkFtZTcwNDcxOTExNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1987","placeOfBirth":" Inverness, Scotland, UK","birthName":"Karen Sheila Gillan","height":"5' 10\" (1.78 m)","bio":"Karen was born and raised in Inverness, Scotland, the daughter of Marie (Paterson) and John Gillan, who is a singer and recording artist. She developed a love for acting very early on, attending several youth theatre groups and taking part in a wide range of productions at her school, Charleston Academy. At age 16, Karen decided she wanted to pursue her acting career further and, studied under the renowned theatre director Scott Johnston at the Performing Arts Studio Scotlond. She later attended the prestigious Italia Conti academy in London. During her first year, she landed a role in Rebus (2000) and soon appeared in a variety of programs including Channel 4's Stacked (2008) and The Kevin Bishop Show (2008), as well as a two-year stint in the long-running series Doctor Who (2005). Karen also stars in the film Outcast (2010), starring James Nesbitt. Her most recent starring role is as Eliza Dooley in \"Selfie\" (2014), When she's not acting, Karen likes to play the piano and loves rummaging through vintage clothes shops.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMDQ0NDk1OV5BMl5BanBnXkFtZTcwNDcxOTExNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2394794","name":"Karen Gillan","nicknames":["Kaz"],"idIMDB":"nm2394794"},"actorId":"nm2394794","character":"Nebula","urlCharacter":"http://www.imdb.com/character/ch0036556","main":true},{"actorName":"Zoe Saldana","urlProfile":"http://www.imdb.com/name/nm0757855","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDk1NTA1OV5BMl5BanBnXkFtZTcwMTIzMjQ4Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1978","placeOfBirth":" Passaic, New Jersey, USA","birthName":"Zoë Yadira Saldaña Nazario","height":"5' 6½\" (1.69 m)","bio":"Zoe Saldana was born on June 19, 1978 in Passaic, New Jersey, to Asalia Nazario and Aridio Saldaña. Her father was Dominican and her mother is Puerto Rican. She was raised in Queens, New York. When she was 10 years old, she and her family moved to the Dominican Republic where they would live for the next seven years. While living in the Dominican Republic, Zoe discovered a keen interest in performance dance and began her training at the prestigious ECOS Espacio de Danza Dance Academy where she learned ballet as well as other dance forms. Not only did her training provide an excellent outlet for the enthusiastic and energetic youngster, it would also prove to be a fortunate precursor for the start of her professional acting career. At age 17, Zoe and her family moved back to the United States where her love for dance followed and an interest in theater performance became stronger. She began performing with the Faces theater troupe which put on plays geared to provide positive messages for teens with themes dealing with issues such as substance abuse and sex. These performances not only gave her valuable experience but also a source of great pride knowing that she was making a difference in the lives of young people like herself. While performing with the Faces troupe and also the New York Youth Theater, Zoe was recruited for a talent agency and her dance training years before coupled with her acting experience greatly helped her land her first big screen role as Eva Rodriguez, the talented and headstrong ballet dancer in the film Center Stage (2000). Since her professional career began several years ago, Zoe's talent and determination has allowed her to be involved in blockbuster films and act with major actors, actresses and industry insiders at a pace that very few young professionals have experienced. Zoe has not only held her own in major motion picture productions but gained the respect and praise from industry insiders such as Jerry Bruckheimer and Steven Spielberg and actors/actresses such as Tom Hanks, Bernie Mac, Keira Knightley, Ashton Kutcher, Kirsten Dunst and Orlando Bloom. According to many of her co-stars, producers and directors, the sky is no limit for this young star who has incredible range, intense concentration, and a steely determination to be involved with projects that challenge her professionally with wide-ranging subject matters and characters. Just to ask practically anyone who she has worked for or with about her, glowing comments abound and earned friendships and respect are readily revealed. A star has been born, and growing every day.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDk1NTA1OV5BMl5BanBnXkFtZTcwMTIzMjQ4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0757855","name":"Zoe Saldana","idIMDB":"nm0757855"},"actorId":"nm0757855","character":"Gamora","urlCharacter":"http://www.imdb.com/character/ch0036555","main":true},{"actorName":"Cobie Smulders","urlProfile":"http://www.imdb.com/name/nm1130627","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNTUyMTczM15BMl5BanBnXkFtZTcwMjMxNTM4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1982","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"Jacoba Francisca Maria Smulders","height":"5' 8\" (1.73 m)","bio":"Amazingly, newcomer Cobie Smulders never gave much thought to acting. She was born on April 3, 1982, in Vancouver, British Columbia, to a Dutch father and an English mother. As a girl, Cobie had set her sights on becoming a doctor or a marine biologist. In fact, it wasn't until high school that Cobie started to explore acting after appearing in several school productions. As a teenager, Cobie caught the eye of a modeling agency, which led to several years of world travel to places such as France, Japan, Italy, Greece, and Germany. Yet even as Cobie's modeling career was on the rise, she still managed to attend school, graduating from high school in 2000 with honors. Once out of high school, Cobie continued modeling internationally until the opportunity arose to audition for film and television. It was not long before Cobie's natural ability as an actress impressed casting directors, landing her guest spots on television series such as Special Unit 2 (2001) and Jeremiah (2002). In addition, Cobie also appeared in the short Candy from Strangers (2001) directed by fellow Canadian rising star Eric Johnson. Cobie got her big break just months later when she landed the role of Juliet Droil in the ABC program Veritas: The Quest (2003). The series marked her first series role for television.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNTUyMTczM15BMl5BanBnXkFtZTcwMjMxNTM4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1130627","name":"Cobie Smulders","idIMDB":"nm1130627"},"actorId":"nm1130627","character":"Maria Hill","urlCharacter":"http://www.imdb.com/character/ch0165041","main":true},{"actorName":"Samuel L. Jackson","urlProfile":"http://www.imdb.com/name/nm0000168","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NTQwMTYxNl5BMl5BanBnXkFtZTYwMjA1MzY1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 December 1948","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Samuel Leroy Jackson","height":"6' 2½\" (1.89 m)","bio":"Samuel L. Jackson is an American producer and highly prolific actor, having appeared in over 100 films, including Die Hard with a Vengeance (1995), Unbreakable (2000), Shaft (2000), Formula 51 (2001), Black Snake Moan (2006), Des serpents dans l'avion (2006), and the Star Wars prequel trilogy (1999-2005), as well as the Marvel Cinematic Universe. Samuel Leroy Jackson was born in Washington, D.C., to Elizabeth (Montgomery) and Roy Henry Jackson. He was raised by his mother, a factory worker. Jackson was active in the black student movement. In the seventies, he joined the Negro Ensemble Company (together with Morgan Freeman). In the eighties, he became well-known after three movies made by Spike Lee: Do the Right Thing (1989), Mo' Better Blues (1990) and Jungle Fever (1991). He achieved prominence and critical acclaim in the early 1990s with films such as Patriot Games (1992), Amos & Andrew (1993), True Romance (1993), Jurassic Park (1993), and his collaborations with director Quentin Tarantino, including Pulp Fiction (1994), Jackie Brown (1997), and later Django Unchained (2012). Going from supporting player to leading man, his performance in Pulp Fiction (1994) gave him an Oscar nomination for his character Jules Winnfield, and he received a Silver Berlin Bear for his part as Ordell Robbi in Jackie Brown (1997). Jackson usually played bad guys and drug addicts before becoming an action hero, co-starring with Bruce Willis in Die Hard with a Vengeance (1995) and Geena Davis in The Long Kiss Goodnight (1996). With Jackson's permission, his likeness was used for the Ultimate version of the Marvel Comics character, Nick Fury. He later did a cameo as the character in a post-credits scene from Iron Man (2008), and went on to sign a nine-film commitment to reprise this role in future films, including major roles in Iron Man 2 (2010), The Avengers (2012), Captain America: The Winter Soldier (2014) and Avengers: Age of Ultron (2015) and minor roles in Thor (2011) and Captain America: The First Avenger (2011). He has also portrayed the character in the second and final episodes of the first season of the TV show, Marvel's Agents of S.H.I.E.L.D. (2013). He has provided his voice to several animated films, television series and video games, including the roles of Lucius Best / Frozone in Pixar's film The Incredibles (2004), Mace Windu in Star Wars: The Clone Wars (2008), Afro Samurai in the anime television series Afro Samurai (2007), and Frank Tenpenny in the video game Grand Theft Auto: San Andreas (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NTQwMTYxNl5BMl5BanBnXkFtZTYwMjA1MzY1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000168","name":"Samuel L. Jackson","nicknames":["Sam","King of Cool","Mr Cool"],"idIMDB":"nm0000168"},"actorId":"nm0000168","character":"Nick Fury","urlCharacter":"http://www.imdb.com/character/ch0020752","main":true},{"actorName":"Elizabeth Olsen","urlProfile":"http://www.imdb.com/name/nm0647634","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjA0ODk1OF5BMl5BanBnXkFtZTcwMTA4ODM3OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 February 1989","placeOfBirth":" Sherman Oaks, California, USA","birthName":"Elizabeth Chase Olsen","height":"5' 6\" (1.68 m)","bio":"Elizabeth Chase \"Lizzie\" Olsen (born February 16, 1989) is an American actress. She is known for her roles in the films, Silent House (2011), Liberal Arts (2012), Godzilla (2014), Avengers: Age of Ultron (2015) and Captain America: Civil War (2016). For her role in the critically-acclaimed Martha Marcy May Marlene (2011), she was nominated for numerous awards, including the Independent Spirit Award for Best Female Lead. She is the younger sister of actresses and fashion designers Mary-Kate Olsen and Ashley Olsen. Olsen was born in Sherman Oaks, California, the daughter of Jarnette \"Jarnie\", a personal manager, and David \"Dave\" Olsen, a real estate developer and mortgage banker. She is the younger sister of twins Mary-Kate Olsen and Ashley Olsen, who became famous as TV and movie stars at an early age. Her oldest brother is named Trent Olsen, and she has two younger half-siblings as well. In 1996, Olsen's parents were divorced. The Olsens have Norwegian ancestry on their father's side and English ancestry on their mother's side. As a child, Olsen received ballet and singing lessons. She began acting at a very young age, with appearances in her sisters' films. Before the age of eleven, Olsen had small roles in How the West Was Fun and the straight-to-video series The Adventures of Mary-Kate & Ashley. Having appeared in her sisters' videos, when she was in the fourth grade, Olsen began to go on auditions for other projects. She attended Campbell Hall School in North Hollywood, California from kindergarten through grade 12. After graduation, she enrolled at New York University's Tisch School of the Arts. In 2009, Olsen spent a semester studying in Moscow, Russia at the Moscow Art Theatre School through the MATS program at the Eugene O'Neill Theater Center. Olsen began acting when she was four years of age and co-starred in six of Mary-Kate and Ashley's productions; she also auditioned for the film Spy Kids. She almost quit acting in 2004 due to the media frenzy surrounding Mary-Kate's eating disorder. Olsen's breakout role came in 2011, when she appeared in the film Martha Marcy May Marlene. The film, along with Olsen's performance, received critical acclaim. Olsen was nominated for and won numerous critics awards for her portrayal of the titular character Martha, a girl suffering from delusions and paranoia after fleeing her life in a cult and returning to her family. She next appeared in the horror film remake Silent House, in which she played the role of Sarah. The film received mixed reviews, although Olsen's performance was once again praised. Olsen also appeared in the music video \"The Queen\" by Carlotta. Olsen filmed the movie Red Lights during mid-2011, and it was released in the U.S. on July 13, 2012. She starred in Josh Radnor's film Liberal Arts, which was released on January 22, 2012. She and Dakota Fanning starred in Very Good Girls, a 2013 release. In January 2013, Olsen was nominated for the BAFTA Rising Star Award. She co-starred in the 2013 American remake of the 2003 South Korean film Oldboy; she played Marie, a young social worker who developed a relationship with the protagonist, played by Josh Brolin. She played Edie Parker, Jack Kerouac's first wife and the author of the Beat Generation memoir You'll Be Okay, in Kill Your Darlings. In 2014, Olsen starred in Legendary's Godzilla a reboot, opposite Bryan Cranston and Aaron Taylor-Johnson. Olsen joined the Marvel Cinematic Universe by playing the character of Scarlet Witch in Avengers: Age of Ultron, the 2015 sequel to The Avengers. She first appeared as the character in a mid-credits scene of the film Captain America: The Winter Soldier, again alongside her Godzilla co-star Taylor-Johnson, who portrayed her brother Quicksilver. She reprized her role as the Scarlet Witch in the 2015 film Avengers: Age of Ultron and the 2016 film Captain America: Civil War. In September 2014, it was announced that Olsen would portray Audrey Williams, Hank Williams' wife, manager, and duet partner in the upcoming 2015 biopic I Saw the Light directed by Marc Abraham and starring Tom Hiddleston as Hank Williams. In January 2016, it was announced that Olsen would team up with her Avengers: Age of Ultron co-star Jeremy Renner in Taylor Sheridan's directorial feature film debut, Wind River. Olsen attended New York University's Tisch School of the Arts and the Atlantic Theater Company and graduated in March 2013 after six years of intermittent study. Her sisters' clothing line \"Elizabeth and James\" was named after her and her older brother. Olsen started dating fellow actor Boyd Holbrook in September 2012 after meeting him on the film Very Good Girls. In March 2014, the couple became engaged but they split and called off their engagement in January 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjA0ODk1OF5BMl5BanBnXkFtZTcwMTA4ODM3OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0647634","name":"Elizabeth Olsen","nicknames":["Lizzie","Liz"],"idIMDB":"nm0647634"},"actorId":"nm0647634","character":"Wanda Maximoff / Scarlet Witch","urlCharacter":"http://www.imdb.com/character/ch0236028","main":true},{"actorName":"Pom Klementieff","urlProfile":"http://www.imdb.com/name/nm2962353","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNjE5MzY5M15BMl5BanBnXkFtZTgwMDI5ODMxODE@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1986","placeOfBirth":" Quebec City, Quebec, Canada","height":"5' 7\" (1.7 m)","bio":"Pom Klementieff was born on May 3, 1986 in Quebec City, Quebec, Canada. She is an actress, known for Old Boy (2013), Hacker's Game (2015) and Loup (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNjE5MzY5M15BMl5BanBnXkFtZTgwMDI5ODMxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2962353","name":"Pom Klementieff","nicknames":["Pominator"],"idIMDB":"nm2962353"},"actorId":"nm2962353","character":"Mantis","urlCharacter":"http://www.imdb.com/character/ch0231190","main":true},{"actorName":"Bradley Cooper","urlProfile":"http://www.imdb.com/name/nm0177896","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0OTIyMzY1M15BMl5BanBnXkFtZTgwMTg0OTE0NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1975","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Bradley Charles Cooper","height":"6' 1\" (1.85 m)","bio":"Bradley Charles Cooper was born in Philadelphia, Pennsylvania. His mother, Gloria (Campano), is of Italian descent, and worked for a local NBC station. His father, Charles John \"Charlie\" Cooper, who was of Irish descent, was a stockbroker. He has a sister, Holly. Immediately after Bradley graduated from the Honors English program at Georgetown University in 1997, he moved to New York City to enroll in the Masters of Fine Arts program at the Actors Studio Drama School at New School University. There, he developed his stage work, culminating with his thesis performance as \"John Merrick\" in Bernard Pomerance's \"The Elephant Man\", performed in New York's Circle in the Square. While still in school, Bradley began his professional career, appearing opposite Sarah Jessica Parker in Sex and the City (1998) and in the series, The Beat (2000). His weekends were spent with LEAP (Learning through the Expanded Arts Program), a non-profit organization that teaches acting and movement to inner city school children. The summers took him all across the globe, from kayaking in British Columbia with Orca Whales to ice-climbing in the Peruvian Andes, while hosting Lonely Planet's Treks in a Wild World (2000) for the Discovery Channel. Bradley had to skip his graduation ceremony from the Actor's Studio in order to star in his first feature film, Wet Hot American Summer (2001). After finishing his second feature, Bending All the Rules (2002), his plans to relocate to Los Angeles were delayed when Darren Star hired him to star in the series The $treet (2000). Bradley went on to win the role of young law student Gordon Pinella in the film Changing Lanes (2002), starring Ben Affleck and Samuel L. Jackson, and also played Travis Paterson in My Little Eye (2002). He finally decided that it was time to forgo his other New York projects and move to Los Angeles when he was cast in Alias (2001). After supporting roles in Wedding Crashers (2005), Failure to Launch (2006), The Comebacks (2007), The Rocker (2008), and Yes Man (2008), Cooper broke out with major roles in He's Just Not That Into You (2009), The Hangover (2009), and Valentine's Day (2010). He co-starred in the action film The A-Team (2010) and headlined the thriller Limitless (2011). Cooper received an Academy Award nomination for Best Actor after starring opposite 'Jennifer Lawrence' in David O. Russell's Silver Linings Playbook (2012), as Pat Solatano. He then received two more consecutive Oscar nominations, Best Supporting Actor for playing Richie DiMaso in Russell's American Hustle (2013) (again opposite Lawrence, though their characters shared no significant screen time), and Best Actor for playing Chris Kyle in Clint Eastwood's American Sniper (2014), the highest grossing film of 2014. During this time period, Cooper also reprised his role in The Hangover Part II (2011) and The Hangover III (2013)_, turned in another strong dramatic turn in The Place Beyond the Pines (2012), and voiced Rocket Raccoon in the third highest grossing film of 2014, Guardians of the Galaxy (2014). In 2015, Bradley headlined two comedies, Cameron Crowe's Aloha (2015), set in Hawaii, and John Wells' Burnt (2015), set in London, and will star opposite Jennifer Lawrence again in David O. Russell's Joy (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0OTIyMzY1M15BMl5BanBnXkFtZTgwMTg0OTE0NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0177896","name":"Bradley Cooper","nicknames":["Coop"],"idIMDB":"nm0177896"},"actorId":"nm0177896","character":"Rocket Raccoon","urlCharacter":"http://www.imdb.com/character/ch0258335","main":true}],"seasons":[],"idIMDB":"tt4154756","urlIMDB":"http://www.imdb.com/title/tt4154756","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"23","month":"01","year":"2017","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":null,"soundMix":["IMAX 6-Track","Dolby Surround 7.1","12-Track Digital Sound (IMAX 12 track)","Dolby Digital","Dolby Atmos"],"color":["Color"],"aspectRatio":["1.90:1 (IMAX)","2.35 : 1"],"camera":["ARRI Alexa 65","Arri Alexa IMAX"],"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":["ARRIRAW (6.5K)","Panavision (as Ultra Panavision 70®)"],"printedFilmFormat":null},"filmingLocations":[{"location":"Pinewood Atlanta Studios, 461 Sandy Creek Road, Fayetteville, Georgia, USA"}],"awards":[],"type":"Movie","companyCreditsSimple":[{"idCompany":"co0051941","name":"Marvel Studios"}],"keywords":{"keywords":["teenage superhero","superheroine","action hero","action heroine","ensemble cast","alien","super villain","cosmic","superhero team","superhero","third part","sequel","marvel cinematic universe","marvel comics","based on comic book","based on comic"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 01:46:43"}}