{"data":{"movies":[{"title":"Dragons: Dawn of the Dragon Racers","originalTitle":"","year":"2014","releaseDate":"20141111","directors":[{"name":"Elaine Bogan","id":"nm4136807"},{"name":"John Sanford","id":"nm0998551"}],"writers":[{"name":"Cressida Cowell","id":"nm2441763"},{"name":"Art Edler Brown","id":"nm0113061"}],"runtime":"26 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGFhY2RjNWUtYzhiMS00MWI0LThiNjUtNWM1N2ZhNzE2NTkzXkEyXkFqcGdeQXVyNDUxNjc5NjY@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Short","Adventure","Comedy","Family","Fantasy"],"plot":"Dawn of the Dragon Racers, is a short film describing how Dragon Racing was invented. Hiccup and all his friends from the dragon academy fight about who really invented it.","simplePlot":"Dawn of the Dragon Racers, is a short film describing how Dragon Racing was invented. Hiccup and all his friends from the dragon academy fight about who really invented it.","actors":[{"actorName":"Jay Baruchel","urlProfile":"http://www.imdb.com/name/nm0059431","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MjY0MzU0OV5BMl5BanBnXkFtZTcwOTE0NDA2NA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1982","placeOfBirth":" Ottawa, Ontario, Canada","birthName":"Jonathan Adam Saunders Baruchel","height":"6' (1.83 m)","bio":"Jay Baruchel was born in Ottawa, Ontario, and was raised in Montreal, Quebec, Canada. He is the son of Robyne (Ropell), a freelance writer, and Serge Victor Baruchel, an antiques dealer. He has a younger sister who also acts. He started acting in 1995 when he made his first of three appearances on the hit show Are You Afraid of the Dark? (1990). He was also in more localized shows such as My Hometown (1996) and Popular Mechanics for Kids (1997). Baruchel had spent some downtime and finally got a chance to be in a classic film called Almost Famous (2000) in 2000. He played \"Vic\", a devout fan of Led Zeppelin. Judd Apatow soon had a show in the works and Baruchel played \"Steven Karp\" on Undeclared (2001). He also had the chance to star alongside actors such as Ian Somerhalder and James Van Der Beek as \"Harry\" in The Rules of Attraction (2002). Things began to slow down a bit after a couple more failed shows. Soon enough, Baruchel came back as the courageous \"Danger Barch\" in Million Dollar Baby (2004). Bringing life to a role that could have been ruined so easily, Baruchel made \"Danger\" a well-loved character. The best part about this actor is his loyalty to his home country. He loves to be able to work in Canada as often as possible. He has been in many fantastic independent films such as Fetching Cody (2005), Just Buried (2007) and Real Time (2008). All three of those films appeal to sides of a person that are never known to exist until it's too late. He was also in many successful American comedy films. He was the lead in She's Out of My League (2010) and played one of Seth Rogen's best friends (which he really is) in the movie Knocked Up (2007). He's also made his mark in family-friendly films such as How to Train Your Dragon (2010), playing the unlikely \"Viking Hiccup\" and also played the title role in The Sorcerer's Apprentice (2010) alongside his newly-found kindred spirit, actor Nicolas Cage. It is no secret that while he enjoys acting, it truly is a means to an end. He lived his dream as he worked on the hockey comedy Goon (2011), and is working on many other films that are what he considers to be passion projects. Now he is making films that he has been preparing for all of his life and nothing can slow him down.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MjY0MzU0OV5BMl5BanBnXkFtZTcwOTE0NDA2NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0059431","name":"Jay Baruchel","idIMDB":"nm0059431"},"actorId":"nm0059431","character":"Hiccup","urlCharacter":"http://www.imdb.com/character/ch0184179","main":true},{"actorName":"America Ferrera","urlProfile":"http://www.imdb.com/name/nm1065229","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDUzOTkxNF5BMl5BanBnXkFtZTcwNjMwNjk0OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1984","placeOfBirth":" Los Angeles, California, USA","birthName":"America Georgine Ferrera","height":"5' 1\" (1.55 m)","bio":"America Georgine Ferrera (born April 18, 1984) is an American actress. She is known for her leading role as Betty Suarez on the American Broadcasting Company's comedy-drama television series Ugly Betty (2006-10). Her acting garnered critical acclaim, and she won the Golden Globe Award for Best Actress - Television Series Musical or Comedy, the Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Comedy Series, and the Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDUzOTkxNF5BMl5BanBnXkFtZTcwNjMwNjk0OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1065229","name":"America Ferrera","nicknames":["Georgina"],"idIMDB":"nm1065229"},"actorId":"nm1065229","character":"Astrid","urlCharacter":"http://www.imdb.com/character/ch0496001","main":true},{"actorName":"Christopher Mintz-Plasse","urlProfile":"http://www.imdb.com/name/nm2395586","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjUzMDk5N15BMl5BanBnXkFtZTcwNzk0Nzk5Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1989","placeOfBirth":" Los Angeles, California, USA","birthName":"Christopher Charles Mintz-Plasse","height":"5' 7½\" (1.71 m)","bio":"Christopher Mintz-Plasse was born on June 20, 1989 in Los Angeles, California, USA as Christopher Charles Mintz-Plasse. He is an actor, known for Superbad (2007), How to Train Your Dragon (2010) and Kick-Ass (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjUzMDk5N15BMl5BanBnXkFtZTcwNzk0Nzk5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2395586","name":"Christopher Mintz-Plasse","nicknames":["Chris"],"idIMDB":"nm2395586"},"actorId":"nm2395586","character":"Fishlegs","urlCharacter":"http://www.imdb.com/character/ch0137638","main":true},{"actorName":"T.J. Miller","urlProfile":"http://www.imdb.com/name/nm2554352","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMzI0NTEwMF5BMl5BanBnXkFtZTcwMjk4MDkxNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1981","placeOfBirth":" Denver, Colorado, USA","birthName":"Todd Joseph Miller","height":"6' 2\" (1.88 m)","bio":"A comedian. Improvisation, Sketch and Stand-up comedy are his forte. Todd Joseph Miller was born in Denver, Colorado, to Leslie, a clinical psychologist, and Kent Miller, an attorney. He went to East High School, and college in Washington, D.C. There, he performed with the group receSs for 4 years, being the only person in his class out of 100 to audition and be accepted into the group. He remained the sole member of receSs until his junior year, when he was joined by Michael \"Tuck The Ruckus\" Tokaruk, an acclaimed comedian and equestrian, who taught T.J. how to ride a horse, a pastime he calls \"droll.\" He met his future wife, Kate Gorney, when they performed in \"A Chorus Line\" in university production of the musical. She played The Ballerina (being an accomplished ballerina herself) and he played Richie, the African American character. He credits the casting to East High School, which was a primarily black and Latino high school, and also that no black people auditioned for the part. During his Time in the nation's capital, he studied classical acting at B.A.D.A in Oxford, England and circus arts at Frichess Theatre Urbain. He was outstanding in the field of Stilt Walking, but was never able to execute any trick, at all, on Trapeze. He is an accomplished Clown and Juggler, having mastered 5 ball juggling, over fifty 3-ball tricks, clubs, torches, knives, and his specialty (which garnered him a Magician Membership to The Magic Castle in Hollywood, CA) Cigar Boxes. After graduating with honors (a bachelor's degree in Psychology with a concentration in Persuasion Theory and Social Influence) he moved to Chicago where he began performing with independent improvisation teams such as the group Chuckle Sandwich, the i.o. house team Bullet Lounge, The sketch group Heavy Weight (with Mark Raterman, Nick Vatterott & Brady Novak). He toured with Second City for almost 2 years (though he was never a company member of the MainStage), and during that time he missed over 15 flights to various cities the company toured to. During his time in Chicago, he performed Standup every night for almost 4 years, never taking a night off even on Holidays. He became a regular at Chicago's famed alternative room The Lincoln Lodge, and only performed at Chicago's Zanies Comedy Club 3 times in 4 years, apparently because they had an aversion to his absurdist style. Miller's first appearance on television was on The Standard Deviants, a PBS show aimed at providing educational DVDs and programming for schools. He played a knight and a dinosaur detective. Proficient in every medium of comedy (he considers even 'acting' simply another medium of comedy) he is also a Voice Over Artist, having worked for Old Style, Mucinex, Cars.com among other brands as well as in feature films & animated television shows. In 2011 he produced a 42 track E.P. entitled \"The Extended Play E.P.\" with Comedy Central Records, a Folk/Pop/Hip Hop concept album, which he describes as satirical; aimed at celebrities that cross over into other mediums they have no business being in simply because of their brand name (he also considers himself \"a proponent of the semicolon, \"it is underused and feared for no particular reason\"). He then remixed this album with Illegal Art, a legitimate music label, enlisting the roster of artists on the label (including the godfather of sampling, \"Steinski\") the same year. According to him, this was to prove that the album, when given to actual musicians, became superior to the original, in addition to satirizing artists that remix one song and sell it to listeners multiple times. He considers his greatest performance to be his portrayal of Ranger Jones, in Yogi Bear 3D, which filmed in New Zealand and wrapped shortly before his seizure that led to the discovery of an AVM (which he alleges confirmed rather than initiated his Absurdist Philosophy). He has stated multiple times that it was the pinnacle of his artistic career, and that \"it's in some ways comforting to have reached the pinnacle of his career so early on\" and that is has been all downhill since that point. Aside from being a major proponent of Denver, his hometown, he has done extensive charity work and continues to visit East High School, where he did his first stand-up performance in drama class. He credits his teacher, Melody Duggan, for much of his success and thanked her specifically in his speech when he won a Critic's Choice Award for best supporting actor in a comedy series (For HBO's Silicon Valley). He frequently cites his compulsive and almost pathologically driven work ethic as an altruistic effort to distract people from the tragedy that permeates everyday life, and believed that comedy would be more of a contribution than psychology, since instead of affecting only at most a few hundred people dramatically, he can affect millions of people in small increments. He has publicly stated he believes \"Comedians are the new philosophers\" and that academic philosophers are no longer relevant. However, he is a student of philosophy and subscribes to the ethical philosophy of John Stuart Mill (Utilitarianism), which states that one should make the most amount happiness for the most amount of people, which he cites as one of the reasons he made the his decision to be a comedian. His stand-up (as of 2015) is aimed at \"discussing Time and the release of the death anxiety.\" By the age of 33 he had read all of Nietzsche's works, and considers himself an Absurdist with philosophical roots in Nihilism. He resides in Los Angeles, where he struggles to make meaning in an uncertain world.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMzI0NTEwMF5BMl5BanBnXkFtZTcwMjk4MDkxNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm2554352","name":"T.J. Miller","idIMDB":"nm2554352"},"actorId":"nm2554352","character":"Tuffnut","urlCharacter":"http://www.imdb.com/character/ch0182921","main":true},{"actorName":"Tim Conway","urlProfile":"http://www.imdb.com/name/nm0176792","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MjgwNTIyNl5BMl5BanBnXkFtZTcwNzczNjA0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 December 1933","placeOfBirth":" Willoughby, Ohio, USA","birthName":"Thomas Daniel Conway","height":"5' 6\" (1.68 m)","bio":"Funny man Tim Conway was born on December 15th, 1933 in Willoughby, Ohio. He was a fraternity man at Bowling Green State University, served in the army, and started his career working for a radio station. Conway got into comedy when he started writing and performing comedy skits between morning movies on CBS. Later, Rose Marie \"discovered\" him and he became a regular performer on The Steve Allen Plymouth Show (1956). However, Conway would not earn true fame until starring as \"Ensign Charles Parker\" on McHale's Navy (1962). Conway sought further success in several shows that were failures, including the embarrassingly short-lived, Turn-On (1969), with only one episode. The producers did not even want it back on after the commercial break! Even his own show, The Tim Conway Show (1970) flopped, with only 12 episodes. Conway starred in the Disney film, The Apple Dumpling Gang (1975), and also the films, The Prize Fighter (1979) and The Private Eyes (1980). Conway became a comical performer on The Carol Burnett Show (1967), with characters such as \"The Old Man\" and \"Mr. Tudball\". Even though it is widely thought he was always a regular performer throughout the whole show, he only became a regular performer in 1975. He was a hysterical addition to the team and memorably made co-star Harvey Korman laugh on-screen live many times. Conway had continued comedic roles such as \"Dorf\", and also in many more television appearances and films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MjgwNTIyNl5BMl5BanBnXkFtZTcwNzczNjA0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0176792","name":"Tim Conway","nicknames":["Timmy","Tom Conway"],"idIMDB":"nm0176792"},"actorId":"nm0176792","character":"Mulch","urlCharacter":"http://www.imdb.com/character/ch0363605","main":true},{"actorName":"Chris Edgerly","urlProfile":"http://www.imdb.com/name/nm0249283","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzODk5NjQyNV5BMl5BanBnXkFtZTcwODQxOTA4MQ@@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1969","placeOfBirth":" Silver Spring, Maryland, USA","birthName":"Christopher Edgerly","height":"6' (1.83 m)","bio":"Edgerly was born in Silver Spring, Maryland and moved at the age of 2 with his mom and two brothers to Savannah, Georgia. He attended Benedictine Military High School and the University of Georgia later on, where he would entertain his friends with lots of impressions. After a season of rugby at the university, he tried his hand at stand-up comedy at the urging of his roommates. A 10-year career touring the country followed (where his ability to do voices came in handy), punctuated by the occasional TV appearance on Nickelodeon. He relocated to Orlando in his early 20s and then later, he relocated to Los Angeles. Edgerly has since settled into the world of voiceover, in which he provides voices for movies, TV shows, and video games, and he still does the occasional stand-up gig around town. Edgerly is currently the voice of Gobber the Belch in Dragons: Riders of Berk, taking over from Craig Ferguson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzODk5NjQyNV5BMl5BanBnXkFtZTcwODQxOTA4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0249283","name":"Chris Edgerly","idIMDB":"nm0249283"},"actorId":"nm0249283","character":"Gobber","urlCharacter":"http://www.imdb.com/character/ch0182922","main":true},{"actorName":"Tom Kenny","urlProfile":"http://www.imdb.com/name/nm0444786","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MzkzNDI0NV5BMl5BanBnXkFtZTYwMTMyNzE3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1962","placeOfBirth":" East Syracuse, New York, USA","birthName":"Thomas James Kenny","height":"5' 11\" (1.8 m)","bio":"Tom Kenny grew up in East Syracuse, New York. When Tom was young he was into comic books, drawing funny pictures and collecting records. Tom turned to stand-up comedy in Boston and San Francisco. This led to appearances on every cable show spawned by the stand-up epidemic of the 80's and 90's as well as stints on The Dennis Miller Show (1992), The Pat Sajak Show (1989), Late Night with Conan O'Brien (1993) and Late Night with David Letterman (1982). Tom was a regular on Fox TV's The Edge (1992) and spent a year as the host of NBC's Friday Night (1983). His mainstream television appearances include Brotherly Love (1995) and David Alan Grier's sitcom debacle, The Preston Episodes (1995). Tom supplies the voice for \"Heffer\" the cow on Nickelodeon's Rocko's Modern Life (1993) and Nickelodeon's SpongeBob SquarePants (1999), as well as regular performances on The Cartoon Network's Dexter's Laboratory (1996), Justice League (2001), The Powerpuff Girls (1998), and Johnny Bravo (1997). Tom joined the cast of Mr. Show with Bob and David (1995) where he met his future wife Jill Talley. Together they've teamed up on Comedy Central's The Mark Thomas Comedy Product (1996), the stage show \"The Show With Two Heads\", HBO's Not Necessarily the Election (1996), the Smashing Pumpkins' \"Tonight, Tonight\" video and Travis \"Sing\" video.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MzkzNDI0NV5BMl5BanBnXkFtZTYwMTMyNzE3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0444786","name":"Tom Kenny","idIMDB":"nm0444786"},"actorId":"nm0444786","character":"Silent Sven","urlCharacter":"http://www.imdb.com/character/ch0535053","main":true},{"actorName":"Nolan North","urlProfile":"http://www.imdb.com/name/nm0636046","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2OTk2Mzc5OF5BMl5BanBnXkFtZTgwMjc3MzI0MDI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1970","placeOfBirth":" New Haven, Connecticut, USA","birthName":"Nolan Ramsay North","height":"6' 1\" (1.85 m)","bio":"Nolan North was born on October 31, 1970 in New Haven, Connecticut, USA as Nolan Ramsay North. He is known for his work on Uncharted: The Nathan Drake Collection (2015), Con Man (2015) and Pretty Little Liars (2010). He has been married to Jill Murray since June 4, 1999. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2OTk2Mzc5OF5BMl5BanBnXkFtZTgwMjc3MzI0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0636046","name":"Nolan North","idIMDB":"nm0636046"},"actorId":"nm0636046","character":"Stoick","urlCharacter":"http://www.imdb.com/character/ch0137637","main":true},{"actorName":"Zack Pearlman","urlProfile":"http://www.imdb.com/name/nm3994945","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ3Njc2NzYwOV5BMl5BanBnXkFtZTgwNzE0ODQ2MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Zachary Michael Pearlman","height":"5' 6½\" (1.69 m)","bio":"Pearlman's acting career began after he submitted an entry for a contest with the website Funny or Die and was given the opportunity to audition for a role in The Virginity Hit. The movie is described as a \"documentary style comedy\" that follows a group of friends and their exploits as they try to lose their virginity. To increase the realism of the movie the directors gave Pearlman and his cast mates cameras to film many of the scenes themselves. Pearlman began his TV career as Leslie Kaczander in the season 1 finale of Breaking In. In 2012, Pearlman played Jay in the American remake The Inbetweeners. He also voiced Snotlout Jorgenson in Dragons: Riders of Berk, replacing Jonah Hill.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ3Njc2NzYwOV5BMl5BanBnXkFtZTgwNzE0ODQ2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3994945","name":"Zack Pearlman","nicknames":["Zeekie","Z-Man","ZP"],"idIMDB":"nm3994945"},"actorId":"nm3994945","character":"Snotlout","urlCharacter":"http://www.imdb.com/character/ch0137639","main":true},{"actorName":"Andree Vermeulen","urlProfile":"http://www.imdb.com/name/nm3501247","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NTQzODc3OF5BMl5BanBnXkFtZTgwNTc4ODY4NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Andree Vermeulen is an actress and writer, known for Angie Tribeca (2016), Dragons: Race to the Edge (2015) and Doris & Mary-Anne Are Breaking Out of Prison (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NTQzODc3OF5BMl5BanBnXkFtZTgwNTc4ODY4NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm3501247","name":"Andree Vermeulen","idIMDB":"nm3501247"},"actorId":"nm3501247","character":"Ruffnut","urlCharacter":"http://www.imdb.com/character/ch0182043","main":true}],"seasons":[],"idIMDB":"tt4191768","urlIMDB":"http://www.imdb.com/title/tt4191768","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["26 min"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.7","filmingLocations":[],"awards":[{"award":"Annie Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated Annie","categories":[{"category":"Best Animated Special Production","names":[]}]}]},{"award":"Behind the Voice Actors Awards 2015","titlesAwards":[{"titleAwardOutcome":"Nominated BTVA Special/DVD Voice Acting Award","categories":[{"category":"Best Male Vocal Performance in a TV Special/Direct-to-DVD Title or Theatrical Short","names":[{"name":"Jay Baruchel","id":"nm0059431","role":null}]}]}]}],"votes":"696","type":"Video","companyCreditsSimple":[{"idCompany":"co0461500","name":"DreamWorks Animation Television"}],"keywords":{"keywords":["dragon","seasickness","broken arm","tournament","flashback","father son relationship","painted face","sheep"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 01:27:56"}}