{"data":{"movies":[{"title":"Clara's Heart","originalTitle":"","year":"1988","releaseDate":"19881007","directors":[{"name":"Robert Mulligan","id":"nm0612322"}],"writers":[{"name":"Joseph Olshan","id":"nm0647835"},{"name":"Mark Medoff","id":"nm0575865"}],"runtime":"108 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NTI1MjIwMl5BMl5BanBnXkFtZTYwMTY5MTk5._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"David is a teenager whose parents are in a deteriorating marriage after their infant daughter dies. Clara is a chambermaid at a Jamaican resort who's hired to be a housekeeper. She and David develop a close bond, opening his eyes and heart to new experiences, and eventually leading to a disturbing secret in Clara's past.","simplePlot":"David is a teenager whose parents are in a deteriorating marriage after their infant daughter dies. Clara is a chambermaid at a Jamaican resort who's hired to be a housekeeper. She and ... ","actors":[{"actorName":"Whoopi Goldberg","urlProfile":"http://www.imdb.com/name/nm0000155","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4ODgzNjQwOV5BMl5BanBnXkFtZTYwNzczNzc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1955","placeOfBirth":" New York City, New York, USA","birthName":"Caryn Elaine Johnson","height":"5' 5\" (1.65 m)","bio":"Whoopi Goldberg was born Caryn Elaine Johnson in the Chelsea section of Manhattan on November 13, 1955. Her mother, Emma (Harris), was a teacher and a nurse, and her father, Robert James Johnson, Jr., was a clergyman. Whoopi's recent ancestors were from Georgia, Florida, and Virginia. She worked in a funeral parlor and as a bricklayer while taking small parts on Broadway. She moved to California and worked with improv groups, including Spontaneous Combustion, and developed her skills as a stand-up comedienne. She came to prominence doing an HBO special and a one-woman show as Moms Mabley. She has been known in her prosperous career as a unique and socially conscious talent with articulately liberal views. Among her boyfriends were Ted Danson and Frank Langella. She was married three times and was once addicted to drugs. Goldberg first came to prominence with her starring role in The Color Purple (1985). She received much critical acclaim, and an Oscar nomination for her role and became a major star as a result. Subsequent efforts in the late 1980s were, at best, marginal hits. These movies mostly were off-beat to formulaic comedies like Pie voleuse (1987), The Telephone (1988) and Jumpin' Jack Flash (1986). She made her mark as a household name and a mainstay in Hollywood for her Oscar-winning role in the box office smash Ghost (1990). Whoopi Goldberg was at her most famous in the early 1990s, making regular appearances on Star Trek: The Next Generation (1987). She admitted to being a huge fan of the original Star Trek (1966) series and jumped at the opportunity to star in \"Star Trek: The Next Generation\". Goldberg received another smash hit role in Sister Act (1992). Her fish-out-of-water with some flash seemed to resonate with audiences and it was a box office smash. Whoopi starred in some highly publicized and moderately successful comedies of this time, including Made in America (1993) and Soapdish (1991). Goldberg followed up to her success with Sister Act 2: Back in the Habit (1993), which was well-received but did not seem to match up to the first. As the late 1990s approached, Goldberg seemed to alternate between lead roles in straight comedies such as Eddie (1996) and The Associate (1996), and took supporting parts in more independent minded movies, such as The Deep End of the Ocean (1999) and How Stella Got Her Groove Back (1998). Goldberg never forgot where she came from, hosting many tributes to other legendary entertainment figures. Her most recent movies include Rat Race (2001) and the quietly received Kingdom Come (2001). Goldberg contributes her voice to many cartoons, including The Pagemaster (1994) and Captain Planet and the Planeteers (1990), as Gaia, the voice of the earth. Alternating between big-budget movies, independent movies, tributes, documentaries, and even television movies (including Theodore Rex (1995)). Whoopi Goldberg is accredited as a truly unique and visible talent in Hollywood. Perhaps she will always be remembered as well for Comic Relief, playing an integral part in almost every benefit concert they had. Currently, Whoopi Goldberg is the center square in Hollywood Squares (1998) and frequently hosts the Academy Awards. She also is an author, with the book \"Book\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4ODgzNjQwOV5BMl5BanBnXkFtZTYwNzczNzc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000155","name":"Whoopi Goldberg","nicknames":["Da Whoop","Shuttlehead"],"idIMDB":"nm0000155"},"actorId":"nm0000155","character":"Clara Mayfield","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Ontkean","urlProfile":"http://www.imdb.com/name/nm0648920","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyODI4OTEyNF5BMl5BanBnXkFtZTcwMjc0OTgwMw@@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 January 1946","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"Michael Leonard Ontkean","height":"6' 1\" (1.85 m)","bio":"Michael Ontkean, the Cando-American actor best known for playing the minor league hockey player Ned Braden in the cult classic Slap Shot (1977), was born on January 24, 1946 in Vancouver, British Columbia. His parents Leonard and Muriel (née Cooper) Ontkean were actors. Michael appeared on the Canadian TV series Hudson's Bay (1959), which ran for one season in 1959-60, but did not appear again professionally as an actor until an episode of Ironside (1967) was broadcast in 1970. Like many a Canadian lad, Ontkean grew up playing hockey. He was good enough to earn a hockey scholarship to the University of New Hampshire, a Division I program. He was a standout player at UNH in his three seasons as a varsity player from 1966 to 1969. (Division I hockey teams did not allow freshmen to play on the varsity team in those days.) After graduating from UNH in 1969, he did not pursue a professional hockey career but moved to Los Angeles to become an actor. After taking roles on episodic TV shows and appearing in TV movies from 1970 to 1972, he had his breakthrough with a lead in the TV series The Rookies (1972), which debuted in September 1972. He played policeman Willie Gillis on the series, which was canceled after the 1973-74 season. His \"Rookies\" co-star Kate Jackson would later appear as his wife in the then-controversial 1982 film Making Love (1982), in which Ontkean played a married man who leaves his wife after coming out after an affair with his gay lover. Earlier, Ontkean's skill as a hockey player enabled Ontkean to beat out Peter Straus and other actors for the role as the disaffected Ned Braden in \"Slap Shot\". In the film, he performed all of his on-ice shots himself. Subsequently, he had a major role in Paul Mazursky's Willie & Phil (1980), but neither that movie or \"Making Love\" was a hit. (Peter Straus, who lost the role in \"Slap Shot\" to Ontkean but was the bigger star after the success of the TV mini-series Rich Man, Poor Man (1976), turned down the role of the closeted gay man played by Ontkean in \"Making Love.\") Ontkean's most memorable role since the early '80s was Sheriff Harry S Truman) in 'David Lynch''s cult classic TV series Twin Peaks (1990). He continues to appear in movies and on TV while living in Hawaii with his second wife, Jamie Smith Jackson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyODI4OTEyNF5BMl5BanBnXkFtZTcwMjc0OTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0648920","name":"Michael Ontkean","idIMDB":"nm0648920"},"actorId":"nm0648920","character":"Bill Hart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kathleen Quinlan","urlProfile":"http://www.imdb.com/name/nm0000599","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0ODIwNTk4OV5BMl5BanBnXkFtZTgwMzk3OTk4NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1954","placeOfBirth":" Pasadena, California, USA","birthName":"Kathleen Denise Quinlan","height":"5' 5\" (1.65 m)","bio":"Kathleen Quinlan was born in Pasadena, California, the only child of Josephine (Zachry), a military supply supervisor, and Robert Quinlan, a television sports director. She grew up in Mill Valley, Ca, and got her break in acting when George Lucas came to her high school to cast for his movie American Graffiti (1973). She followed up her one-line role four years later with Lifeguard (1976), and then several roles in the late 1970s and 1980s. Her breakthrough performance came in 1977, as Deborah in I Never Promised You a Rose Garden (1977). She was nominated for an Academy Award in 1995 for Apollo 13 (1995). She starred in the TV series Family Law (1999), but her contract stipulated that she cannot work later than 6 pm, so she can be home with her husband, She currently works in Film and Television (2015). Bruce Abbott, son Tyler Abbott (b. October 17, 1990), and stepson Dalton Abbott (b. October 4, 1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0ODIwNTk4OV5BMl5BanBnXkFtZTgwMzk3OTk4NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000599","name":"Kathleen Quinlan","idIMDB":"nm0000599"},"actorId":"nm0000599","character":"Leona Hart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Neil Patrick Harris","urlProfile":"http://www.imdb.com/name/nm0000439","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNjQ4MjU5Ml5BMl5BanBnXkFtZTcwMTY5NzAzNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 June 1973","placeOfBirth":" Albuquerque, New Mexico, USA","height":"6' (1.83 m)","bio":"Neil Patrick Harris was born in Albuquerque, New Mexico, on June 15, 1973. His parents, Sheila Gail (Scott) and Ronald Gene Harris, were lawyers and ran a restaurant. He grew up in Ruidoso, New Mexico, a small town 120 miles south of Albuquerque, where he first took up acting in the fourth grade. While tagging along with his older brother of 3 years, Harris won the part of Toto in a school production of The Wizard of Oz (1939). His parents moved the family to Albuquerque in 1988, the same year that Harris made his film debut in two movies: Purple People Eater (1988) and Clara's Heart (1988), which starred Whoopi Goldberg. A year later, when Neil was 16, he landed the lead role in Steven Bochco's television series about a teen prodigy doctor at a local hospital, Doogie Howser, M.D. (1989), which launched Harris into teen-heartthrob status. The series lasted1989-1993 and earned him a People's Choice Award for Favorite Male Performer in a New Series (1990) and a Golden Globe Nomination (1990). Harris attended the same high school as Freddie Prinze Jr., La Cueva High School in Albuquerque. Neil acted on stage in a few plays while there, one of which was his senior play, Fiddler on the Roof (1971), in which he portrayed Lazar Wolf the butcher (1991). When \"Doogie Howser, M.D.\" stopped production in 1993, Harris took up stage acting, which he had always wanted to do. After a string of made-for-television movies, Harris acted in his first big screen roles in nine years, Starship Troopers (1997) with Casper Van Dien and then The Proposition (1998). In July 1997, Harris accepted the role of Mark Cohen for the Los Angeles production of the beloved musical, Rent (2005). His performance in \"Rent\" garnered him a Drama-League Award in 1997. He continued in the musical, to rave reviews, until January 1998. He later reprised the role for six nights in his hometown of Albuquerque, New Mexico, in December 1998. In 1999, Harris returned to television in the short-lived sitcom Stark Raving Mad (1999), with Tony Shalhoub. He was also in the big-screen projects The Next Best Thing (2000) and Undercover Brother (2002), and he can be heard as the voice of Peter Parker/Spider-Man in the newest animated Spider-Man (2003) series. Harris has continued his stage work, making his Broadway debut in 2001 in \"Proof.\" He has also appeared on stage in \"Romeo and Juliet,\" \"Cabaret,\" Sweeney Todd: The Demon Barber of Fleet Street in Concert (2001), and, most recently, \"Assassins.\" In 2005, Harris returned to the small screen in a guest-starring role on Numb3rs (2005) and a starring role in the sitcom How I Met Your Mother (2005). Neil played the title role in the web-exclusive musical comedy Dr. Horrible's Sing-Along Blog (2008), widely downloaded via iTunes to become the #1 TV series for five straight weeks, despite not actually being on television.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNjQ4MjU5Ml5BMl5BanBnXkFtZTcwMTY5NzAzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000439","name":"Neil Patrick Harris","nicknames":["NPH"],"idIMDB":"nm0000439"},"actorId":"nm0000439","character":"David Hart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Spalding Gray","urlProfile":"http://www.imdb.com/name/nm0336960","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3Mzk3MDQ4Ml5BMl5BanBnXkFtZTcwMjc1OTAzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 June 1941","placeOfBirth":" Providence, Rhode Island, USA","birthName":"Spalding Rockwell Gray","bio":"Spalding Gray was born on June 5, 1941 in Providence, Rhode Island, USA as Spalding Rockwell Gray. He was an actor and writer, known for The Killing Fields (1984), Kate & Leopold (2001) and Beaches (1988). He was married to Kathleen Russo and Renée Shafransky. He died on January 10, 2004 in New York City, New York, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3Mzk3MDQ4Ml5BMl5BanBnXkFtZTcwMjc1OTAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0336960","name":"Spalding Gray","nicknames":["Spud or Spuddy"],"idIMDB":"nm0336960"},"actorId":"nm0336960","character":"Peter Epstein","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Beverly Todd","urlProfile":"http://www.imdb.com/name/nm0865119","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMjc1MTczMl5BMl5BanBnXkFtZTcwOTcxNTI4Mw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1946","placeOfBirth":" Chicago, Illinois, USA","bio":"Iconic actress Beverly Todd has distinguished herself on Broadway, the London stage, television and film. A People's Choice Award winner and a four-time nominee of the prestigious NAACP Image Award, Ms. Todd's work dates back to the 70's in film roles opposite her mentor Sidney Poitier in The Lost Man, They Call Me Mr. Tibbs, and Brother John. In the 80's she starred with Richard Pryor in Moving, Whoopi Goldberg in Clara's Heart, and Morgan Freeman in Lean on Me. She has a long list of television appearances including the PBS Television Special, Six Characters in Search of an Author, which was the first time the leading role of Stepdaughter was played by an actress of color, Roots, Don't Look Back opposite Louis Gossett, Jr., Lifetime's, Taken From Me, opposite Taraji P. Henson, Hope and Redemption, with major guest stars roles on Six Feet Under, Criminal Minds and Grey's Anatomy, to name a few. Recent credits in films include leads in Ava DuVernay's I Will Follow, Paul Haggis's Academy Award Best Picture winner Crash and Rob Reiner's The Bucket List. Beverly is starring in the soon to be released film Drive Me to Vegas and Mars, directed and written by Sidney J. Furie. Beverly is a youth advocate, conducting poetry workshops for delinquent boys, self-esteem workshops for at risk teen-age girls, and theatre programs for Inner City Junior High School Students.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMjc1MTczMl5BMl5BanBnXkFtZTcwOTcxNTI4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0865119","name":"Beverly Todd","idIMDB":"nm0865119"},"actorId":"nm0865119","character":"Dora","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hattie Winston","urlProfile":"http://www.imdb.com/name/nm0935589","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1Nzc5ODk5Nl5BMl5BanBnXkFtZTYwNzg2Nzg0._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1945","placeOfBirth":" Lexington, Mississippi, USA","bio":"Hattie Winston was born on March 3, 1945 in Lexington, Mississippi, USA. She is an actress, known for The Electric Company (1971), Becker (1998) and Jackie Brown (1997). She is married to Harold Wheeler. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1Nzc5ODk5Nl5BMl5BanBnXkFtZTYwNzg2Nzg0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0935589","name":"Hattie Winston","idIMDB":"nm0935589"},"actorId":"nm0935589","character":"Blanche Loudon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Downs","urlProfile":"http://www.imdb.com/name/nm0236187","urlPhoto":"","biography":{"dateOfBirth":"8 September 1973","placeOfBirth":" Columbia, Maryland, USA","birthName":"Jason Wright Downs","bio":"Jason Downs was born on September 8, 1973 in Columbia, Maryland, USA as Jason Wright Downs. He is an actor and producer, known for Hairspray (1988), Clara's Heart (1988) and Racing Daylight (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0236187","name":"Jason Downs","idIMDB":"nm0236187"},"actorId":"nm0236187","character":"Alan Lipsky","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Caitlin Thompson","urlProfile":"http://www.imdb.com/name/nm0859935","urlPhoto":"","biography":{"bio":"Caitlin Thompson is an actress, known for Clara's Heart (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0859935","name":"Caitlin Thompson","idIMDB":"nm0859935"},"actorId":"nm0859935","character":"Celeste","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maria Broom","urlProfile":"http://www.imdb.com/name/nm0112343","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MDQxNjczN15BMl5BanBnXkFtZTcwNjE2MTE2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Maria Broom is an actress, known for Clara's Heart (1988), The Wire (2002) and Jamesy Boy (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MDQxNjczN15BMl5BanBnXkFtZTcwNjE2MTE2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0112343","name":"Maria Broom","idIMDB":"nm0112343"},"actorId":"nm0112343","character":"Felicia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wanda Christine","urlProfile":"http://www.imdb.com/name/nm0160418","urlPhoto":"","biography":{"bio":"Wanda Christine is an actress, known for La cité des anges (1998), Ri¢hie Ri¢h (1994) and Backdraft (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0160418","name":"Wanda Christine","idIMDB":"nm0160418"},"actorId":"nm0160418","character":"Lydia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maryce Carter","urlProfile":"http://www.imdb.com/name/nm0141805","urlPhoto":"","biography":{"bio":"Maryce Carter is an actress, known for Clara's Heart (1988), Dragonfly (1976) and Siege (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0141805","name":"Maryce Carter","idIMDB":"nm0141805"},"actorId":"nm0141805","character":"Babs","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Angel Harper","urlProfile":"http://www.imdb.com/name/nm0363808","urlPhoto":"","biography":{"bio":"Angel Harper is an actress, known for Kiss the Girls (1997), Once Upon a Forest (1993) and The Rugrats Movie (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0363808","name":"Angel Harper","idIMDB":"nm0363808"},"actorId":"nm0363808","character":"Rita","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frederick Strother","urlProfile":"http://www.imdb.com/name/nm0835120","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MTg1NTMxNl5BMl5BanBnXkFtZTcwNTc1MjYzMQ@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"bio":"Frederick Strother is an actor, known for Twelve Monkeys (1995), Invincible (2006) and Beloved (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MTg1NTMxNl5BMl5BanBnXkFtZTcwNTc1MjYzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0835120","name":"Frederick Strother","idIMDB":"nm0835120"},"actorId":"nm0835120","character":"Bundy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joseph Muth","urlProfile":"http://www.imdb.com/name/nm0616092","urlPhoto":"","biography":{"bio":"Joseph Muth is an actor, known for Clara's Heart (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0616092","name":"Joseph Muth","idIMDB":"nm0616092"},"actorId":"nm0616092","character":"Father Joe","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0094882","urlIMDB":"http://www.imdb.com/title/tt0094882","business":{"budget":null,"openingWeekend":null,"gross":[],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 48 min (108 min) (Netherlands)","1 hr 48 min (108 min) (USA)"],"soundMix":["Dolby"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"6.3","filmingLocations":[{"location":"Baltimore, Maryland, USA"}],"rated":"PG-13","awards":[{"award":"Golden Globes, USA 1989","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Performance by an Actor in a Supporting Role in a Motion Picture","names":[{"name":"Neil Patrick Harris","id":"nm0000439","role":null}]}]}]},{"award":"Young Artist Awards 1989","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Family Motion Picture - Drama","names":[]},{"category":"Best Young Actor in a Motion Picture - Drama","names":[{"name":"Neil Patrick Harris","id":"nm0000439","role":null}]}]}]}],"votes":"1,759","type":"Movie","companyCreditsSimple":[{"idCompany":"co0038822","name":"MTM Enterprises"},{"idCompany":"co0026840","name":"Warner Bros."}],"keywords":{"keywords":["housekeeper","dysfunctional marriage","sexual harassment","patois","racism","rape","melodrama","jamaica","based on novel","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:56:38"}}