{"data":{"movies":[{"title":"Southern Comfort","originalTitle":"","year":"1981","releaseDate":"19810925","directors":[{"name":"Walter Hill","id":"nm0001353"}],"writers":[{"name":"Michael Kane","id":"nm0437393"},{"name":"Walter Hill","id":"nm0001353"}],"runtime":"106 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWFiNGJhN2UtNWY0My00ZWFlLTk2NzMtZTg5OTI5ZThjYWVhXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1.jpg","countries":["USA","Switzerland","UK"],"languages":["English","French"],"genres":["Action","Thriller"],"plot":"A squad of National Guards on an isolated weekend exercise in the Louisiana swamp must fight for their lives when they anger local Cajuns by stealing their canoes. Without live ammunition and in a strange country, their experience begins to mirror the Vietnam experience.","simplePlot":"A squad of National Guards on an isolated weekend exercise in the Louisiana swamp must fight for their lives when they anger local Cajuns by stealing their canoes. Without live ammunition ... ","actors":[{"actorName":"Keith Carradine","urlProfile":"http://www.imdb.com/name/nm0001018","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk4OTI4MjczOF5BMl5BanBnXkFtZTcwMzI3MTU5Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 August 1949","placeOfBirth":" San Mateo, California, USA","birthName":"Keith Ian Carradine","height":"6' 1\" (1.85 m)","bio":"It seems the second generation of acting Carradines -- David, Keith and Robert -- are proudly continuing the family tradition and begetting a third generation of talent. The dynasty began with veteran Hollywood patriarch John Carradine, the son of a surgeon and a correspondent for the Associated Press. Keith was a child, born of John's second marriage to actress Sonia Sorel. Lanky, laid-back and highly likable, Keith Ian Carradine was born in San Mateo, California, on August 8, 1949. His parents divorced when Keith was six. Following in the footsteps of older half-brother and mentor David Carradine, Keith studied theater arts at Colorado State University in Fort Collins, Colorado, but dropped out after only one semester to pursue his career. Soon after, he auditioned for \"Hair\" in Los Angeles and made his Broadway debut in the 1969 rock musical, playing the role of Claude for an extended period of time. Keith next appeared with his father in a stage production of \"Tobacco Road\" (1970) in Florida. The following year Keith broke into films with a part in the Kirk Douglas/Johnny Cash western A Gunfight (1971). Legendary director Robert Altman was quite taken by Keith's work in the film and gave him a part in his own movie McCabe & Mrs. Miller (1971), which sparked the first of many endeavors together. Keith also made a strong showing on TV, making his mini-movie debut with Man on a String (1972), and appearing with brother David in the TV movie pilot and various episodes of the cult series Kung Fu: Pilot (1972) as the teenage version (seen in flashbacks) of David's character Kwai Chang Caine. Keith continued to impress in Altman's films. He played one of three convicts in the critically-acclaimed movie Thieves Like Us (1974), but scored Oscar gold with his next Altman film, Nashville (1975) -- not with his acting but with his songwriting. His composition \"I'm Easy\" won both the Oscar and Golden Globe for \"Best Song\". Keith also earned a Grammy nomination in 1976 for his contribution to \"Nashville\" in the \"Best Original Score Written for a Motion Picture or Television Special\" category. Keith first association with Altman's protégé, Alan Rudolph, occurred filming Welcome to L.A. (1976), to which he again contributed his music talent. Keith's rangy handsomeness and low-keyed acting style were on full display as he increased his popularity with appearances in such films as Ridley Scott's The Duellists (1977); Louis Malle's first American film, the visually-striking Pretty Baby (1978), that made a controversial star out of young Brooke Shields; and the comedy/romance An Almost Perfect Affair (1979). One acting trick that worked was pairing all three Carradine brothers in The Long Riders (1980), which recalled the infamous lives of brothers Cole, Jim and Bob Younger, and boasted three other sets of acting brothers (Keach, Quaid and Guest) as various other outlaw siblings. Keith's acting reviews throughout much of his career would be decidedly mixed -- some would find his unassuming, introspective acting too listless while others found it beautifully realized and understated. Many of his best notices came from the Altman and Rudolph films, appearing in two of Rudolph acclaimed 80s works -- Choose Me (1984) and The Moderns (1988). He also persevered on TV with award-worthy work. His role in the mini-series Chiefs (1983) netted an Emmy nomination, while his recurring role as Wild Bill Hickok in Deadwood (2004) earned a Golden Satellite nomination and his work in the made-for-TV-film Half a Lifetime (1986) scored a CableACE nomination. Regular series work came late in his career, starring in Fast Track (1997), Outreach (1999) and Complete Savages (2004), all of which were short-lived. Keith's career was revitalized on the 80s and 90s stage. In addition to strong roles in \"Another Part of the Forest\" (1982) and \"Detective Story\" (1984), he won the Outer Critics Circle Award for his excellent work in 1982's \"Foxfire\" opposite Jessica Tandy and Hume Cronyn_ and then roped a Tony and Drama Desk nomination as humorist Will Rogers in the Broadway musical \"The Will Rogers Follies\" (1991). Most recently (2005) he starred in the American premiere of David Hare's satire \"Stuff Happens\" as none other than George W. Bush while expounding on the 2003 invasion of Iraq. Keith has been married twice. Of his two children born from his first union to actress Sandra Will, who played opposite him in the film Choose Me (1984), son Cade Carradine recently portrayed Lord Oxford in the film Richard III (2007) and daughter Sorel Carradine has been seen on TV. Keith and Sandra eventually divorced and he married actress Hayley DuMond in 2006; they met while appearing in the film The Hunter's Moon (1999). Keith's daughter Martha Plimpton, a highly gifted actress on her own, was a child from his relationship to actress Shelley Plimpton, whom he met when both were cast members in \"Hair\" back in 1969. Keith continues to write and compose. More recently he hosted The History Channel's Wild West Tech (2003) and appeared on a season of the hit cable series Dexter (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk4OTI4MjczOF5BMl5BanBnXkFtZTcwMzI3MTU5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001018","name":"Keith Carradine","idIMDB":"nm0001018"},"actorId":"nm0001018","character":"Spencer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Powers Boothe","urlProfile":"http://www.imdb.com/name/nm0000959","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NDQwMTI3MV5BMl5BanBnXkFtZTcwODcwMjM4NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1948","placeOfBirth":" Snyder, Texas, USA","birthName":"Powers Allen Boothe","height":"6' 2\" (1.88 m)","bio":"American actor born 1948, in Snyder, Texas. Leading man of the American stage, TV, and films. He made a strong presence in some films in the 80s, but he was most successful on TV. He won an Emmy award as Best Actor for his performance in the TV movie Guyana Tragedy: The Story of Jim Jones (1980).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NDQwMTI3MV5BMl5BanBnXkFtZTcwODcwMjM4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000959","name":"Powers Boothe","idIMDB":"nm0000959"},"actorId":"nm0000959","character":"Hardin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fred Ward","urlProfile":"http://www.imdb.com/name/nm0911542","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NDg0MTE2MF5BMl5BanBnXkFtZTcwNzMwODQ1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 December 1942","placeOfBirth":" San Diego, California, USA","birthName":"Freddie Joe Ward","height":"5' 9½\" (1.77 m)","bio":"A marvelous character actor with intense eyes, a sly grin and somewhat grizzled appearance, Golden Globe-winner Fred Ward has nearly 90 appearances under his belt in many tremendous films. He first became interested in acting after serving three years in the US Air Force and studied at New York's Herbert Berghof Studio. Ward then went to Europe, where he dubbed many Italian movies, and first appeared on-screen in two films by Roberto Rossellini. He then returned to the United States, and got his first decent role alongside Clint Eastwood in the nail-biting prison film Escape from Alcatraz (1979). Ward's looks often saw him cast as law enforcement or military characters, and he put in noteworthy performances in Southern Comfort (1981), Uncommon Valor (1983), as astronaut Gus Grissom in The Right Stuff (1983) and scored the lead in the interesting spy / martial arts movie Remo Williams: The Adventure Begins (1985), which unfortunately was not as successful as had been the mega-selling series of Remo Williams books. However, during \"Remo\", Ward demonstrated a great knack for comedic timing and satirical performance, and used this ability was to great effect in several films, including playing Kevin Bacon's fellow giant-worm-fighting handyman in the light-hearted sci-fi hit Tremors (1990), as \"Walter Stuckel\" in Robert Altman's The Player (1992), as TV anchorman \"Chip Daley\" in Tim Robbins' razor-sharp political satire Bob Roberts (1992) and as a vicious, but incompetent, gangster menacing Leslie Nielsen in Naked Gun 33 1/3: The Final Insult (1994). Ward's abilities as both a strong supporting actor and a truly versatile character actor ensured that he would be in steady demand, and he has continued to turn up in a wide variety of roles utilizing his skills. Keep an eye out for Fred Ward in the action-filled The Chaos Factor (2000), as David Spade's dad in Joe Dirt (2001), in the tongue-in-cheek Corky Romano (2001) and in the Reese Witherspoon romantic tale Sweet Home Alabama (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NDg0MTE2MF5BMl5BanBnXkFtZTcwNzMwODQ1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0911542","name":"Fred Ward","idIMDB":"nm0911542"},"actorId":"nm0911542","character":"Reece","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Franklyn Seales","urlProfile":"http://www.imdb.com/name/nm0780546","urlPhoto":"","biography":{"dateOfBirth":"15 July 1952","placeOfBirth":" Kingstown, St. Vincent, British West Indies [now Saint Vincent and the Grenadines]","birthName":"Franklyn Vincent Ellison Seales","bio":"Franklyn Seales was a stage and television actor best remembered for playing the finicky business manager Dexter Stuffins on the NBC sit-com \"Silver Spoons.\" He also appeared in films, most notably as the real-life cop killer in \"The Onion Field.\" One of eight children, Seales was born in 1952 on the Caribbean island of St. Vincent. In 1960, Seales' family emigrated to the United States, where they settled in New York City. A painter since age six, Seales planned to study art at Pratt Institute. But then John Houseman noticed Seales when he was helping a friend to audition by performing the balcony scene from \"Romeo and Juliet.\" Signed on the spot to a full scholarship at Julliard, Seales studied acting as a member of Houseman's Acting Company, during the early 1970s. Seales' first big break was the PBS broadcast of the television drama The Trial of the Moke (1978). He portrayed Lt. Henry O. Flipper, the first black graduate of West Point. Seales' film debut was in the true-crime drama The Onion Field (1979). He portrayed a weak, gullible ex-con who's just out of jail when a fast-talking killer, played by James Woods, talks him into a senseless crime that results in the murder of a police officer. From 1983 to 1987, Seales played the character for which he was best remembered, the finicky business manager Dexter Stuffins on the NBC situation-comedy Silver Spoons (1982), which also starred John Houseman as stoic Grandpa Stratton. Toward the end of his life, Seales worked mainly in the non-profit Equity-waver theatre on the Westside of Los Angeles. He appeared in plays ranging from the theater of the absurd to Shakespeare. Los Angeles Times critic Lawrence Christon called Seales \"one of America's most compelling stage actors.\" As a member of the all-star L.A. Theatre Works, Seales was one of a company of 36 actors who contributed $6,000 each for the pleasure of performing classic plays together on the radio. Some of the Theater Works other members were James Earl Jones, Ted Danson, Richard Dreyfuss, Bonnie Bedelia, Stacy Keach, Michael York, and Ed Asner. Seales last appeared in \"Nothing Sacred,\" at the Mark Taper Forum in Los Angeles in the fall of 1988. A comedic adaptation of Turgenev's \"Fathers and Sons,\" it was directed by Michael Lindsay-Hogg. Seales appeared as Uncle Havel, an aristocratic fop and former military man. For his characterization, Seales relied on his recollections of the English colonels and majors of his native St. Vincent, when it was still a British colony, \"with their little sticks and stiff mustaches.\" Although he was acclaimed for his versatility, Seales admitted that being a light-skinned black man had limited the roles that were available to him. Franklyn Seales died on Monday, May 14, 1990 from complications from AIDS at his family's home in Brooklyn, New York. He had been too ill to work for several months. In its obituary, the Los Angeles Times said that \"Seales as an actor came to be seen as a link between the tradition of black Africa and the sophistication of classical Anglo drama.\" He was survived by his mother, three brothers and three sisters. A memorial service was planned at Julliard.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0780546","name":"Franklyn Seales","idIMDB":"nm0780546"},"actorId":"nm0780546","character":"Simms","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"T.K. Carter","urlProfile":"http://www.imdb.com/name/nm0141953","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4OTc5NDQ5NF5BMl5BanBnXkFtZTcwNDAyNTQxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1956","placeOfBirth":" New York City, New York, USA","birthName":"Thomas Kent Carter","height":"6' 1\" (1.85 m)","bio":"T.K. Carter was raised just east of Los Angeles, California. He began his stand-up routine at age 12, and, by high school, appeared in Neil Simon's production of \"The Odd Couple.\" He began his professional stand-up routine at the Comedy Store in Los Angeles and has also worked at the Improvisation Cafe and Ye Little Club. His first role was in an episode of Police Woman (1974), and starred in the Los Angeles Actors Theatre's version of \"Sisters.\" He has since appeared in such films as Space Jam (1996), A Rage in Harlem (1991) and Ski Patrol (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4OTc5NDQ5NF5BMl5BanBnXkFtZTcwNDAyNTQxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0141953","name":"T.K. Carter","idIMDB":"nm0141953"},"actorId":"nm0141953","character":"Cribbs","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lewis Smith","urlProfile":"http://www.imdb.com/name/nm0809095","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxODgzMzQ5Ml5BMl5BanBnXkFtZTcwNzMwOTA0NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 August 1956","placeOfBirth":" Chattanooga, Tennessee, USA","birthName":"Lewis Collie Smith","height":"6' 1\" (1.85 m)","bio":"Lewis Smith was born on August 1, 1956 in Chattanooga, Tennessee, USA as Lewis Collie Smith. He is an actor and director, known for Django Unchained (2012), The Adventures of Buckaroo Banzai Across the 8th Dimension (1984) and The Heavenly Kid (1985).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxODgzMzQ5Ml5BMl5BanBnXkFtZTcwNzMwOTA0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0809095","name":"Lewis Smith","idIMDB":"nm0809095"},"actorId":"nm0809095","character":"Stuckey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Les Lannom","urlProfile":"http://www.imdb.com/name/nm0486985","urlPhoto":"","biography":{"dateOfBirth":"4 November 1946","placeOfBirth":" Johnston City, Illinois, USA","birthName":"Leslie Lannom","height":"6' (1.83 m)","bio":"Les Lannom was born on November 4, 1946 in Johnston City, Illinois, USA as Leslie Lannom. He is an actor, known for Southern Comfort (1981), Silkwood (1983) and Shoot to Kill (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0486985","name":"Les Lannom","idIMDB":"nm0486985"},"actorId":"nm0486985","character":"Casper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Coyote","urlProfile":"http://www.imdb.com/name/nm0001075","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NjYwOTczNF5BMl5BanBnXkFtZTgwMzA3MzgwMjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1941","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Rachmil Pinchus Ben Mosha Cohon","height":"6' 3\" (1.91 m)","bio":"Peter Coyote was born on October 10, 1941 in Manhattan, New York City, New York, USA as Rachmil Pinchus Ben Mosha Cohon. He is an actor, known for E.T. the Extra-Terrestrial (1982), A Walk to Remember (2002) and Sphere (1998). He was previously married to Stefanie Pleet and Marilyn McCann.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NjYwOTczNF5BMl5BanBnXkFtZTgwMzA3MzgwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001075","name":"Peter Coyote","idIMDB":"nm0001075"},"actorId":"nm0001075","character":"Poole","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alan Autry","urlProfile":"http://www.imdb.com/name/nm0042641","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMzM5MDI1NF5BMl5BanBnXkFtZTcwMzU2NTQ4NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1952","placeOfBirth":" Shreveport, Louisiana, USA","birthName":"Carlos Alan Autry","height":"6' 3\" (1.91 m)","bio":"He was raised in Riverdale, California, in the San Joaquin Valley. He was a star player at the University of the Pacific in Stockton, CA before being drafted by the Green Bay Packers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMzM5MDI1NF5BMl5BanBnXkFtZTcwMzU2NTQ4NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0042641","name":"Alan Autry","idIMDB":"nm0042641"},"actorId":"nm0042641","character":"Bowden","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brion James","urlProfile":"http://www.imdb.com/name/nm0001397","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5ODM3NzMyNl5BMl5BanBnXkFtZTYwMjAxOTYy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1945","placeOfBirth":" Redlands, California, USA","birthName":"Brion Howard James","height":"6' 3\" (1.91 m)","bio":"Brion James was born February 20, 1945, in Redlands, California, to Ida Mae (Buckelew) and Jimmy James. The family soon moved to Beaumont, California (between Los Angeles and Palm Springs), where his parents built and operated a movie theater, where stars such as Gene Autry would occasionally stop by. After graduating from Beaumont High School in 1962, Brion attended San Diego State University, majoring in theater arts. Upon graduation he moved to New York to study acting while working a variety of jobs to support himself in the early years. He also did a stint in the National Guard. He and fellow actor Tim Thomerson served in the army together and later made several films together. A veteran of over 100 television and 120+ movie roles, James is best remembered for roles such as the replicant Leon in Blade Runner (1982), Gen. Munro in The Fifth Element (1997), Big Teddy in Cabin Boy (1994), Max Jenke in The Horror Show (1989) (his personal favorite) as well as countless other parts in films like Southern Comfort (1981), The Player (1992), Tango & Cash (1989), 48 Hrs. (1982), Another 48 Hrs. (1990), Enemy Mine (1985) and Silverado (1985). Brion is survived by two brothers, Craig James of Scottsdale, Arizona, Chester James of Beaumont, California and their families.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5ODM3NzMyNl5BMl5BanBnXkFtZTYwMjAxOTYy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001397","name":"Brion James","idIMDB":"nm0001397"},"actorId":"nm0001397","character":"Trapper","urlCharacter":"http://www.imdb.com/character/ch0394967","main":true},{"actorName":"Sonny Landham","urlProfile":"http://www.imdb.com/name/nm0484739","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNzkyNzkzNV5BMl5BanBnXkFtZTYwMjg3MDc2._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 February 1941","placeOfBirth":" Canton, Georgia, USA","birthName":"William Landham","height":"6' 1½\" (1.87 m)","bio":"An actor with a powerful physique, booming voice and who has played several \"Native American\" characters, Sonny Landham first broke into mainstream film with a bit part as a police officer in Walter Hill's gang film The Warriors (1979), then other minor roles in Southern Comfort (1981) & Poltergeist (1982), before Walter Hill cast him in his first decent role as James Remar's gun happy, criminal partner in the high voltage hit 48 Hrs. (1982). Landham continued to turn up in high testosterone films of the mid 1980s including the action sci-fi film Predator (1987), alongside Sylvester Stallone in Lock Up (1989), and being hurled out a window by Carl Weathers in Action Jackson (1988). His career on screen wound down during the 1990s, but he still managed to crop up in several roles taking advantage of his strong physical presence.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNzkyNzkzNV5BMl5BanBnXkFtZTYwMjg3MDc2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0484739","name":"Sonny Landham","idIMDB":"nm0484739"},"actorId":"nm0484739","character":"Hunter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Allan Graf","urlProfile":"http://www.imdb.com/name/nm0333689","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MzM0MjU5M15BMl5BanBnXkFtZTcwNzk1MTU1NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 December 1949","placeOfBirth":" USA","birthName":"Allan Lee Graf","height":"6' 2½\" (1.89 m)","bio":"Graf is one of Hollywood's premier 2nd unit directors and stunt coordinators whose 35 year career behind the cameras includes the staging of stunts in over five dozen films while directing second unit action on three dozen features, including such recent films as Todd Phillips' comedy \"Due Date, \"Walt Disney's \"The Muppets\" (2011, on which he also cordinated stunts) and Phillips' independent feature, \"Project X\" (2012). A native of Southern California, Graf first made his mark on the gridiron, where he captained the 1967 San Fernando High School city championship team, winning All-American honors. He won a full athletic scholarship to the University of Southern California, and played offensive guard for John McKay's powerhouse Trojans. Graf started on McKay's legendary, undefeated (12-0) 1972 NCAA National Championship team, and was one of the heroes at the 1973 Rose Bowl, when USC defeated Ohio State 42-17. He next played in the 1973 college all-star game against the NFL's undefeated Miami Dolphins at Chicago's Soldier Field. Following graduation, Graf became a free agent with the Los Angeles Rams before joining the World Football League's Portland Storm during their inaugural 1974 season. When the league abruptly folded, Graf tackled a career change when he fatefully won a role as former Chicago Bears player Dick Butkus' stunt double in the 1976 Disney film, \"Gus,\" a comic opus about a field-goal kicking mule. Following his debut, Graf worked as a stunt player for several years on a variety of projects, notably Walter Hill's \"Southern Comfort,\" \"The Driver\" and \"The Long Riders,\" John Carpenter's \"They Live,\" Paul Verhoeven's \"Total Recall,\" \"Star Trek II: The Wrath of Khan,\" \"Raising Arizona,\" \"Action Jackson,\" \"S.W.A.T.,\" \"Pirates of the Caribbean: The Curse of the Black Pearl,\" \"Independence Day\" and, most recently, \"Captain America: The First Avenger.\" He has coordinated stunts on several other projects, including \"Punch Drunk Love,\" \"Domestic Disturbance,\" John Woo's \"Broken Arrow,\" \"Wayne's World,\"\"The Hangover, Part II\" (the highest-grossing, R-rated comedy of all time), and several of director Hill's actioners, including \"Supernova,\" \"Geronimo: An American Legend\" and \"Wild Bill,\" on which he also directed the films' 2nd unit. On Hill's 1990 sequel, \"Another 48 Hrs.,\" Graf, as the film's 2nd unit director and stunt coordinator, was the very first stuntman to cannon roll a bus at 60 mph. He subsequently flipped a bus again on the Jean-Claude Van Damme actioner, \"Nowhere to Run,\" cannon rolling a 40-foot bus underneath a 60-foot wide freeway overpass. The former college football great is also one of Hollywood's best known football coordinators and 2nd unit directors, designing and staging the gridiron action for such films as Oliver Stone's epic, \"Any Given Sunday,\" Howard Deutch's comedy, \"The Replacements,\" \"The Program,\" \"The Waterboy,\" \"Necessary Roughness,\" \"Man of the House,\" Gary Fleder's football biopic, \"The Express,\" Cameron Crowe's Oscar®-winning \"Jerry Maguire\" and Peter Berg's acclaimed football classic, \"Friday Night Lights.\" His work on \"Friday Night Lights\" and \"The Express\" all earned ESPY Awards. To further add to Graf's slate of talents, he has also logged several supporting acting roles, including that of 'Captain Turner' on HBO's \"Deadwood\" (again working with Walter Hill) along with many other projects such as \"L.A. Confidential\" (the abusive husband beaten down by Russell Crowe in the film's early moments), \"The Replacements,\" Paul Thomas Anderson's \"Magnolia\" and \"Boogie Nights,\" Oliver Stone's \"The Doors,\" Hill's \"Red Heat\" and \"Another 48 Hrs.,\" \"Poltergeist\" and \"Verhoeven's \"RoboCop,\" among dozens of others. Graf penned an original screenplay entitled \"Turning the Tide,\" a football drama which depicts the historic 1970 gridiron contest between McKay's USC Trojans and Bear Bryant's Crimson Tide of Alabama. The film is currently in development. Graf most recently reteamed with filmmaker Brian Helgeland on \"42\" after having served as 2nd unit director on his 2001 adventure film, \"A Knight's Tale,\" for whom he designed and directed all the jousting sequences.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MzM0MjU5M15BMl5BanBnXkFtZTcwNzk1MTU1NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0333689","name":"Allan Graf","idIMDB":"nm0333689"},"actorId":"nm0333689","character":"Hunter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ned Dowd","urlProfile":"http://www.imdb.com/name/nm0235684","urlPhoto":"","biography":{"dateOfBirth":"26 May 1950","placeOfBirth":" Boston, Massachusetts, USA","bio":"Ned Dowd was born on May 26, 1950 in Boston, Massachusetts, USA. He is known for his work on Apocalypto (2006), The Last of the Mohicans (1992) and King Arthur (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0235684","name":"Ned Dowd","idIMDB":"nm0235684"},"actorId":"nm0235684","character":"Hunter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rob Ryder","urlProfile":"http://www.imdb.com/name/nm0753139","urlPhoto":"","biography":{"bio":"Rob Ryder is known for his work on White Men Can't Jump (1992), Father of the Bride (1991) and Father of the Bride Part II (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0753139","name":"Rob Ryder","idIMDB":"nm0753139"},"actorId":"nm0753139","character":"Hunter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Greg Guirard","urlProfile":"http://www.imdb.com/name/nm0347483","urlPhoto":"","biography":{"bio":"Greg Guirard was born in St. Martinville, Louisiana, USA. He is known for his work on Southern Comfort (1981), Dans la brume électrique (2009) and Shy People (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0347483","name":"Greg Guirard","idIMDB":"nm0347483"},"actorId":"nm0347483","character":"Cajun Couple","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0083111","urlIMDB":"http://www.imdb.com/title/tt0083111","business":{"budget":null,"openingWeekend":[{"money":"$116,943","country":"USA","day":"27","month":"09","year":"1981","remarks":"17 Screens"}],"gross":[{"money":"$2,939,174","country":"USA","day":"08","month":"11","year":"1981","remarks":""},{"money":"$763,694","country":"USA","day":"18","month":"10","year":"1981","remarks":""},{"money":"$383,014","country":"USA","day":"10","month":"10","year":"1981","remarks":""},{"money":"$116,943","country":"USA","day":"27","month":"09","year":"1981","remarks":""}],"weekendGross":[{"money":"$985,630","country":"USA","day":"08","month":"11","year":"1981","remarks":"450 Screens"},{"money":"$363,701","country":"USA","day":"18","month":"10","year":"1981","remarks":"101 Screens"},{"money":"$60,384","country":"USA","day":"11","month":"10","year":"1981","remarks":"15 Screens"},{"money":"$116,943","country":"USA","day":"27","month":"09","year":"1981","remarks":"17 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 46 min (106 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Lenses and Panaflex Camera by Panavision"],"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":["2,915 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.2","filmingLocations":[{"location":"Caddo Lake, Texas, USA"}],"rated":"R","awards":[],"votes":"12,570","type":"Movie","companyCreditsSimple":[{"idCompany":"co0048902","name":"Cinema Group Ventures"},{"idCompany":"co0247611","name":"Phoenix (II)"}],"keywords":{"keywords":["louisiana","swamp","cajun","national guard","forest","black american","black man","black soldier","dead man","finding a dead body","theft","helicopter","southern u.s.","stalking","opening a door","actual animal killed","poacher","dying words","town","night","f word","profanity","travelling","journey","hiking","visit","killed with a gun","rural setting","manhunt","tragedy","cardinal direction in title","characters killed one by one","war violence","combat","carnage","knife fight","death","shootout","gun","gun duel","bloody spray","blood","massacre","gun battle","gunfight","bullet ballet","slaughter","exit wound","bloodbath","brutality","blood splatter","slow motion scene","violence","shooting","joke","gore","killing an animal","blank bullet","wilderness","bayou","paranoia","soldier","invincible enemy","trap","enemy","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:05:01"}}