{"data":{"movies":[{"title":"Under Pressure","originalTitle":"","year":"1935","releaseDate":"19350202","directors":[{"name":"Raoul Walsh","id":"nm0909825"}],"writers":[{"name":"Borden Chase","id":"nm0153698"},{"name":"Borden Chase","id":"nm0153698"}],"runtime":"72 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmJlOTRlZTMtMzQ3ZS00YTdiLTk4NDAtOWE5ZmRkMDQ2OGJiL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjU5OTg5NDc@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"Two members of a crew of \"sandhogs\", men who work on an underwater tunnel project, battle each other over the same woman and a rival team of sandhogs to see who will finish their half of the tunnel first, with the winning team getting more money and guaranteed future work.","simplePlot":"Two members of a crew of \"sandhogs\", men who work on an underwater tunnel project, battle each other over the same woman and a rival team of sandhogs to see who will finish their half of ... ","actors":[{"actorName":"Edmund Lowe","urlProfile":"http://www.imdb.com/name/nm0522926","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NjA1NTk4NF5BMl5BanBnXkFtZTcwNjg5MjIxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1890","placeOfBirth":" San Jose, California, USA","birthName":"Edmund Dantes Lowe","height":"6' (1.83 m)","bio":"Tall, athletic leading man, the son of a judge. Lowe was initially slated for the priesthood but switched career paths on several occasions, at one time studying law, then teaching English and elocution. The latter led to his involvement in the acting profession. After briefly appearing in vaudeville, he joined the Oliver Morosco stock company in 1911 and made his Broadway debut six years later in 'The Brat'. Motion pictures soon beckoned, and, with his imposing physique and debonair manner, he quickly rose to becoming a popular matinée idol, the Tuxedo-attired star of such A-grade productions as East of Suez (1925). In 1926, Lowe was cast, against type, in the role he would be identified with for the remainder of his career: that of the brash and profane Sergeant Harry Quirk in Maxwell Anderson's World War I drama What Price Glory (1926). He also featured in several sequels, invariably co-starring his on-screen adversary Victor McLaglen. After that, Lowe alternated between romantic lead (such as Dinner at Eight (1933)) and tough guy. In the latter category, he gave a strong central performance in the role of Specs Green in Dillinger (1945), one of the slickest productions turned out by little poverty row studio Monogram. The film elicited complaints from a few meekly-inclined civic groups and was even banned in Chicago for two years because of its 'brutal, sensational subject matter'. Irrespectively, it was a winner at the box office. Edmund Lowe remained much sought-after by producers, having eased effortlessly into supporting roles once his days as a star were over. He worked under contract at 20th Century Fox (1924-27, 1929-32, 1934-35), Paramount (1932-33), MGM (1936) and Universal (1938-39). From the 1940's, he still played leads for smaller studios, free-lanced and later acted in television. Late in his career, he starred in his own half-hour series, Front Page Detective (1951), as a sleuthing newspaper columnist. In private life, Lowe had a reputation for impeccable attire and sartorial elegance. Not as well remembered today as he deserves to be, he is nonetheless immortalized with a star on the 'Walk of Fame' on Hollywood Boulevard.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NjA1NTk4NF5BMl5BanBnXkFtZTcwNjg5MjIxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0522926","name":"Edmund Lowe","nicknames":["Eddie"],"idIMDB":"nm0522926"},"actorId":"nm0522926","character":"Shocker Dugan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victor McLaglen","urlProfile":"http://www.imdb.com/name/nm0572142","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNTYxNTcxNF5BMl5BanBnXkFtZTcwMDg1MTMxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1886","placeOfBirth":" Tunbridge Wells, Kent, England, UK","birthName":"Victor Andrew de Bier Everleigh McLaglen","height":"6' 3\" (1.9 m)","bio":"Rambunctious British leading man (contrary to popular belief, he was of Scottish ancestry, not Irish) and later character actor primarily in American films, Victor McLaglen was a vital presence in a number of great motion pictures, especially those of director John Ford. McLaglen (pronounced Muh-clog-len, not Mack-loff-len) was the son of the Right Reverend Andrew McLaglen, a Protestant clergyman who was at one time Bishop of Claremont in South Africa. The young McLaglen, eldest of eight brothers, attempted to serve in the Boer War by joining the Life Guards, though his father secured his release. The adventuresome young man traveled to Canada where he did farm labor and then directed his pugnacious nature into professional prizefighting. He toured in circuses, vaudeville shows, and Wild West shows, often as a fighter challenging all comers. His tours took him to the US, Australia (where he joined in the gold rush) and South Africa. In 1909 he was the first fighter to box newly-crowned heavyweight champion Jack Johnson, whom he fought in a six-round exhibition match in Vancouver (as an exhibition fight, it had no decision). When the First World War broke out, McLaglen joined the Irish Fusiliers and soldiered in the Middle East, eventually serving as Provost Marshal (head of Military Police) for the city of Baghdad. After the war he attempted to resume a boxing career, but was given a substantial acting role in The Call of the Road (1920) and was well received. He became a popular leading man in British silent films, and within a few years was offered the lead in an American film, The Beloved Brute (1924). He quickly became a most popular star of dramas as well as action films, playing tough or suave with equal ease. With the coming of sound, his ability to be persuasively debonair diminished by reason of his native speech patterns, but his popularity increased, particularly when cast by Ford as the tragic Gypo Nolan in The Informer (1935), for which McLaglen won the Best Actor Oscar. He continued to play heroes, villains and simple-minded thugs into the 1940s, when Ford gave his career a new impetus with a number of lovably roguish Irish parts in such films as She Wore a Yellow Ribbon (1949) and The Quiet Man (1952). The latter film won McLaglen another Oscar nomination, the first time a Best Actor winner had been nominated subsequently in the Supporting category. McLaglen formed a semi-militaristic riding and polo club, the Light Horse Brigade, and a similarly arrayed precision motorcycle team, the Victor McLaglen Motorcycle Corps, both of which led to apparently erroneous conclusions that he had fascist sympathies and was forming his own private army. The facts prove otherwise, and despite rumors to the contrary, McLaglen did not espouse the far right-wing sentiments often attributed to him. He continued to act in films into his 70s and died, from heart failure, not long after appearing in a film directed by his son, Andrew V. McLaglen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNTYxNTcxNF5BMl5BanBnXkFtZTcwMDg1MTMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0572142","name":"Victor McLaglen","idIMDB":"nm0572142"},"actorId":"nm0572142","character":"Jumbo Smith","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Florence Rice","urlProfile":"http://www.imdb.com/name/nm0723422","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2U1YWIwODQtMmM1OS00NDliLWFmYzItODM2ZGVhYTI2MjIwXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1907","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Florence Davenport Rice","height":"5' 4½\" (1.64 m)","bio":"She was everything you could want in a love interest -- pretty, wholesome, reliable, true-blue. Porcelain blonde Florence Rice would come to films in the mid-'30s but disappear within a decade, having made little of the impression she might have made. She was introduced to the limelight practically from the beginning as the daughter of famous sportswriter, documentary producer and radio commentator Grantland Rice (1880-1954). Rice was known for his many \"Grantland Rice Sportslights\" shorts in the 1920s and 1930s and would win an Oscar for Best Short Subject for Amphibious Fighters (1943). Florence, who was born in Cleveland, OH, in 1907, attended grammar and boarding schools in Englewood, NJ, and developed an early interest in acting. Gracing such Broadway stage productions as \"June Moon\" and \"She Loves Me Not,\" she began appearing regularly on the big screen in the mid-'30s and would work primarily for MGM in the light, sparkling comedy department over the years. Equally agreeable Robert Young would be a frequent co-star, appearing with her in such films as The Longest Night (1936), Sworn Enemy (1936), Married Before Breakfast (1937), Navy Blue and Gold (1937) and Paradise for Three (1938). Florence's best known role would come as the somewhat vapid singing ingénue (Kenny Baker was her bland male counterpart) in one of The Marx Brothers' lesser vehicles At the Circus (1939) (unlike Baker, her vocals were dubbed). As was usually the case, Florence was overshadowed in most of her pictures by flashier dames or zany comedians. Following her role as the bride in the spooky \"B\" comedy The Ghost and the Guest (1943), she left films altogether and found some work waiting for her on radio and TV. Two prior marriages, including one to actor Robert Wilcox, failed, but in the postwar years she happily met and married Fred Butler and retired to Hawaii. She died of lung cancer in 1974.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2U1YWIwODQtMmM1OS00NDliLWFmYzItODM2ZGVhYTI2MjIwXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0723422","name":"Florence Rice","idIMDB":"nm0723422"},"actorId":"nm0723422","character":"Pat Dodge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marjorie Rambeau","urlProfile":"http://www.imdb.com/name/nm0708081","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGY5ZGVlM2ItM2NlZi00NTUwLTk4NDQtOGE2NmUyNGRiM2FiXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1889","placeOfBirth":" San Francisco, California, USA","height":"5' 6\" (1.68 m)","bio":"Born July 15, 1889 in San Francisco, unappreciated character player Marjorie Rambeau worked on the stage from the age of 12. In the 1910s and 1920s, she became a prominent Broadway lead, noted for her serene beauty, elegant poise and touching theatrics. Around the same time she made a few silent films that went nowhere. Leaving the Broadway scene in the late 20s she focused on Hollywood but, by this time, her looks had hardened enough that she would only be considered for character, not romantic leads. Marjorie surprised everybody and turned in sterling, flashy support work as blowsy, aging floozies and other pathetic, hard-luck dames. She played an alcoholic mom in Min and Bill (1930) opposite Wallace Beery and Marie Dressler, then succeeded Dressler herself as the salty waterfront title character in Tugboat Annie Sails Again (1940). Nominated twice for Oscars as the prostitute mother of Ginger Rogers in Primrose Path (1940) and the mother at odds with daughter/star Joan Crawford in Torch Song (1953), Marjorie was never given the acclaim she deserved. Her versatility was for all to see in such roles as the backwoods Bessie Lester in Tobacco Road (1941), and she continued to own her own scenes in such films as _A Man Called Peter (1955)_ , The View from Pompey's Head (1955) and as Steve Cochran's alcoholic mom in Slander (1957). Offscreen, her private life proved as stormy and difficult as those of her characters. She married three times, her first husband being actor/writer/director Willard Mack. Moreover, alcohol played a strong, sad part in her personal life as well. A number of serious car accidents left her in disabled health for much of her later life. Sadly, she is little remembered except by the most devoted fans of film trivia. In all fairness, her films are definitely worth a look, if but for her scenes alone. Marjorie passed away in 1970 at age 80.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGY5ZGVlM2ItM2NlZi00NTUwLTk4NDQtOGE2NmUyNGRiM2FiXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0708081","name":"Marjorie Rambeau","idIMDB":"nm0708081"},"actorId":"nm0708081","character":"Amelia 'Amy' Hardcastle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Bickford","urlProfile":"http://www.imdb.com/name/nm0001948","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MDUxMjkxNF5BMl5BanBnXkFtZTcwNDQwNTYyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1891","placeOfBirth":" Cambridge, Massachusetts, USA (1889, often given in error)","birthName":"Charles Ambrose Bickford","height":"6' 1\" (1.85 m)","bio":"American character actor of gruff voice and appearance who was a fixture in Hollywood pictures from the earliest days of the talkies. The fifth of seven children, he was born in the first minute of 1891. He was a boisterous child, and at nine was tried and acquitted for attempted murder in the shooting of a motorman who had run over his dog. He worked as a lumberjack and investment promoter, and briefly ran his own pest extermination business. In his late teens, he gave up the business and traveled aimlessly about country. In San Francisco, an attempt to romance a burlesque actress resulted in an offer to join her show as a performer. He spent the next dozen years touring the country in road companies, then made a smash hit on Broadway in \"Outside Looking In\". Cecil B. DeMille saw Bickford on the stage and offered him the lead in Dynamite (1929). Contracted to MGM, Bickford fought constantly with studio head Louis B. Mayer and was for a time blacklisted among the studios. He spent several years working in independent films as a freelancer, then was offered a contract at Twentieth Century Fox. Before the contract could take effect, however, Bickford was mauled by a lion while filming 'East of Java (1935)'. He recovered, but lost the Fox contract and his leading man status due to the extensive scarring of his neck and also to increasing age. He continued as a character actor, establishing himself as a character star in films like The Song of Bernadette (1943), for which he received the first of three Oscar nominations. Burly and brusque, he played heavies and father figures with equal skill. He continued to act in generally prestigious films up until his death in 1967.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MDUxMjkxNF5BMl5BanBnXkFtZTcwNDQwNTYyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001948","name":"Charles Bickford","nicknames":["Charlie"],"idIMDB":"nm0001948"},"actorId":"nm0001948","character":"Nipper Moran","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sig Ruman","urlProfile":"http://www.imdb.com/name/nm0750079","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGMyYzY2YjgtNjk2ZS00ZTEzLTlkZjItODU3MzY5OTI2MzllXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1884","placeOfBirth":" Hamburg, Germany","birthName":"Siegfried Albon Rumann","height":"6' (1.83 m)","bio":"Wonderfully talented German-born actor, capable of tremendous comedic and dramatic performances, usually as some type of pompous bureaucrat or similarly arrogant individual. Ruman was born on October 11, 1884, in Hamburg, Germany, and actually studied electrotechnology in college before making the switch to acting. He served with the Imperial German Forces in World War I before coming to the United States in 1924. He became friendly with playwright George S. Kaufman and critic Alexander Woollcott and was regularly appearing in high-quality stage productions on Broadway. With the advent of talkies, he was kept very busy in the cinema and became a favorite of the Marx Brothers, appearing as stiff-shirted NYC opera owner Herman Gottlieb in the comedy classic A Night at the Opera (1935). He played a know-it-all surgeon crossing swords with Groucho Marx over what exactly was wrong with hypochondriac Margaret Dumont in A Day at the Races (1937). and a dual role in A Night in Casablanca (1946). With his German accent, he was also a regular in several WWII espionage thrillers, including Confessions of a Nazi Spy (1939), They Came to Blow Up America (1943), and The Hitler Gang (1944), and gave a superb portrayal of the two-faced POW guard Schulz in the splendid Stalag 17 (1953). He was also popular with famed director Ernst Lubitsch, who cast Ruman in Ninotchka (1939), and To Be or Not to Be (1942). In all, he notched up over 100 feature film appearances as well as guest star spots on many TV shows. Ruman suffered ill health for the final two decades of his life and passed away on February 14, 1967, from a heart attack.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGMyYzY2YjgtNjk2ZS00ZTEzLTlkZjItODU3MzY5OTI2MzllXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0750079","name":"Sig Ruman","idIMDB":"nm0750079"},"actorId":"nm0750079","character":"Doctor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roger Imhof","urlProfile":"http://www.imdb.com/name/nm0408184","urlPhoto":"","biography":{"dateOfBirth":"15 August 1875","placeOfBirth":" Rock Island, Illinois, USA","birthName":"Fred Roger Imhof","bio":"Roger Imhof was born on August 15, 1875 in Rock Island, Illinois, USA as Fred Roger Imhof. He was an actor, known for The Grapes of Wrath (1940), This Gun for Hire (1942) and Drums Along the Mohawk (1939). He was married to Marcelle Imhof. He died on April 15, 1958 in Hollywood, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0408184","name":"Roger Imhof","idIMDB":"nm0408184"},"actorId":"nm0408184","character":"George Breck","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Warner Richmond","urlProfile":"http://www.imdb.com/name/nm0725173","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTRjNjkzNGUtOGQzZi00MjY2LWJmZGEtYzM3MGU0Mjk4YTE1L2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1886","placeOfBirth":" Racine, Wisconsin, USA","birthName":"Werner Paul Raetzmann","height":"5' 11\" (1.8 m)","bio":"Werner Paul Raetzmann was one of seven children born to a German-born father and Wisconsin-born mother. He and one brother decided to change their last name to Richmond. Living in rural Wisconsin, he became an expert horseman as a young man, and this skill would later earn him roles in western movies. He had blue/gray eyes and brown hair, handsome, chiseled features and maintained an enviable physique. A Chicago census from 1910 gives his occupation as a traveling salesman of musical merchandise. Moving to New York City, Warner became a true pioneer of the American cinema, making his first films in 1912. By 1917 he was a regular in the New Jersey studios (Solax Studio in Fort Lee) of Maurice Tourneur. When the film industry moved to southern California, Richmond and his wife also moved to rural Toluca Lake with their only son. He was not a contract player, so he made films, silent and subsequently talking pictures, with every major and minor studio. Included in his many screen credits are short subjects and serials, such as 'Flash Gordon' and many westerns. For 34 years he was steadily employed as a screen actor. His co-stars included Carole Lombard, Pearl White, Mary Astor, Ben Lyon, Theda Bara, Dorothy Gish, Richard Barthelmess, Richard Dix, Hoot Gibson, Tex Ritter, ZaSu Pitts, Spencer Tracy, William Haines, Jason Robards, Sr., Frank Morgan, Gene Autry, John Wayne, William Boyd, Pola Negri and Gabby Hayes. In two different films he portrayed American patriot John Hancock. He made several films under the direction of John Ford, Karl Freund, King Vidor, W. S. Van Dyke, William A. Seiter, Lloyd Bacon, Ralph Ince, Albert S. Rogell, Raoul Walsh, Cecil B. DeMille and Harry Beaumont. He was often cast as a lawyer, judge, father, henchman, and district attorney. In his fourth decade of acting, he suffered partial facial paralysis after a nasty fall from a horse. Following a diligent regime of physiotherapy, he overcame his injury and returned to work in the Hollywood studios.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTRjNjkzNGUtOGQzZi00MjY2LWJmZGEtYzM3MGU0Mjk4YTE1L2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0725173","name":"Warner Richmond","idIMDB":"nm0725173"},"actorId":"nm0725173","character":"Weasel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Wallace","urlProfile":"http://www.imdb.com/name/nm0908687","urlPhoto":"","biography":{"bio":"Jack Wallace is an actor, known for Under Pressure (1935) and Klondike Annie (1936).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0908687","name":"Jack Wallace","idIMDB":"nm0908687"},"actorId":"nm0908687","character":"The Kid","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Donlan","urlProfile":"http://www.imdb.com/name/nm0232571","urlPhoto":"","biography":{"dateOfBirth":"23 July 1888","placeOfBirth":" San Francisco, California, USA","bio":"James Donlan was born on July 23, 1888 in San Francisco, California, USA. He was an actor, known for The Whole Town's Talking (1935), Big Dame Hunting (1932) and Belle of the Nineties (1934). He died on June 7, 1938 in Hollywood, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0232571","name":"James Donlan","idIMDB":"nm0232571"},"actorId":"nm0232571","character":"Corky","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0027154","urlIMDB":"http://www.imdb.com/title/tt0027154","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 12 min (72 min)"],"soundMix":["Mono"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["1,936.4 m (7 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.8","filmingLocations":[],"awards":[],"votes":"36","type":"Movie","companyCreditsSimple":[{"idCompany":"co0028775","name":"Fox Film Corporation"}],"keywords":{"keywords":["based on book"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 00:32:18"}}