{"data":{"movies":[{"title":"The Gang's All Here","originalTitle":"","year":"1943","releaseDate":"19431224","directors":[{"name":"Busby Berkeley","id":"nm0000923"}],"writers":[{"name":"Walter Bullock","id":"nm0120190"},{"name":"Nancy Wintner","id":"nm0936065"}],"runtime":"103 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1OTI2ODE3M15BMl5BanBnXkFtZTcwNzA5NTM0MQ@@._V1.jpg","countries":["USA"],"languages":["English","Portuguese"],"genres":["Comedy","Musical","Romance"],"plot":"Playboy Andy Mason, on leave from the army, romances showgirl Eadie Allen overnight to such effect that she's starry-eyed when he leaves next morning for active duty in the Pacific. Only trouble is, he gave her the assumed name of Casey. Andy's eventual return with a medal is celebrated by his rich father with a benefit show featuring Eadie's show troupe, at which she's sure to learn his true identity...and meet Vivian, his 'family-arrangement' fiancée. Mostly song and dance.","simplePlot":"A soldier falls for a chorus girl and then experiences trouble when he is posted to the Pacific.","actors":[{"actorName":"Alice Faye","urlProfile":"http://www.imdb.com/name/nm0269647","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5MTc0OTc4M15BMl5BanBnXkFtZTYwODExOTE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1915","placeOfBirth":" New York City, New York, USA","birthName":"Alice Jeanne Leppert","height":"5' 5\" (1.65 m)","bio":"As A&E's Biography put it, \"She rose from the mean streets of New York's Hell's Kitchen to become the most famous singing actress in the world. When the pressures of fame became too much, she had the courage to leave Hollywood on her own terms\". Alice Faye was born Alice Jeanne Leppert in NYC on May 5, 1915. She was to become one of Hollywood's biggest stars of the late 1930s and early 1940s. She started her career as a singer, but later gravitated to film roles. Alice's first role was in the film George White's Scandals (1934) in 1934 where she played \"Mona Vale\". Lilian Harvey was set to play the lead role in this film, but quit. Alice inherited the part. She went on to star in Tinseltown's popular and lucrative cookie-cutter musicals and, with her distinctive contralto, introduced several songs that became pop standards, notably \"You'll Never Know\" in the film Hello Frisco, Hello (1943) in 1943. After filming Fallen Angel in 1945, in which she was very disappointed because many of her best scenes were cut, she walked out on her contract. Her life after Hollywood was charmingly simple. She was married to Hoosier Phil Harris from 1941-1995 in a union that produced two daughters. She had previously been married to Tony Martin for four years. Alice had always said that her family always came before her professional life. She went back to Hollywood to make State Fair (1962) in 1962. At that time, she said \"I don't know what happened to the picture business. I'm sorry I went back to find out. Such a shame\". Her last film was The Magic of Lassie (1978) in 1978 opposite James Stewart. Most of her films are big hits at revival theaters across the country, confirming the power she had in the wonderful performances she gave. Ironically, Alice is more popular in Britain than in the US. Four days after her birthday on May 9, 1998, Alice Faye died in Rancho Mirage, California. She was 83 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5MTc0OTc4M15BMl5BanBnXkFtZTYwODExOTE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0269647","name":"Alice Faye","idIMDB":"nm0269647"},"actorId":"nm0269647","character":"Edie Allen","urlCharacter":"http://www.imdb.com/character/ch0498907","main":true},{"actorName":"Carmen Miranda","urlProfile":"http://www.imdb.com/name/nm0000544","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA5NjExODc4OF5BMl5BanBnXkFtZTYwNzYwMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1909","placeOfBirth":" Marco de Canavezes, Portugal","birthName":"Maria do Carmo Miranda da Cunha","height":"5' (1.52 m)","bio":"Carmen Miranda was born Maria do Carmo Miranda da Cunha on February 9, 1909, near Porto, Portugal, in the town of Marco de Canavezes. Not long after her birth her family moved to Brazil, where her father was involved in the produce business. The family settled in the then-capital city of Rio de Janeiro. After leaving school, Carmen got a job at a local store, and often began singing on the job. Before long she was discovered and got a singing job on a local radio station. She ultimately got a recording contract with RCA. By 1928 she was a genuine superstar in Brazil. As with other popular singers of the era, she eventually made her way into the film world. She made her debut in the Brazilian documentary A Voz do Carnaval (1933). Two years later she appeared in her first feature film, Alô, Alô, Brasil (1935). However. it was Estudantes (1935) that seemed to solidify Carmen in the minds of the Brazilian movie audiences. Now they realized she could act as well as sing. Although there was three years between \"Alo, Alo Carnaval\" and Banana-da-Terra (1939), Carmen continued to churn out musical hits in Brazil. The latter film would be the last in her home country. In late 1939 Carmen arrived, with much fanfare in the press, in New York City. She was now ready to capture Americans' hearts with her talent. She appeared in some musical revues on Broadway and, just as everyone thought, was a huge hit. In 1940 Carmen was signed to appear in the Twentieth Century-Fox production Down Argentine Way (1940), with Betty Grable and Don Ameche. The only complaint that critics had was the fact that Carmen was not on the screen enough. In 1941 she was, again, teamed with Ameche in addition to Alice Faye in That Night in Rio (1941). The film was extremely popular with the theater patrons. Her unique songs went a long way in making her popular. It was after Week-End in Havana (1941) that American cartoon artists began to cash in on Carmen's ever-growing popularity. In the 1930s and 1940s cartoons were sometimes shown as a prelude to whatever feature film was showing. Sure enough, the cartoon version of Carmen came wriggling across the screen, complete with her trademark fruit hat and wide, toothy grin. In 1942 Carmen starred in Springtime in the Rockies (1942) with Betty Grable and Cesar Romero, both of whom she had worked with before. It was shortly after this that America began adopting her style of dress as the latest fad. 1944 saw her in three films: Something for the Boys (1944), Four Jills in a Jeep (1944) and Greenwich Village (1944). The first two did well at the box-office, but the last one left a lot to be desired. It was her last busy year in film. Carmen made one film each in 1945, '46, '47 and '48. After that she didn't make a film for two years, until Nancy Goes to Rio (1950), a production for MGM. Once again didn't make a film for several years, returning with Scared Stiff (1953). She did stay busy, singing on the nightclub circuit and appearing on the relatively new medium of television. However, \"Scared Stiff\" was her final performance on the silver screen. On August 4, 1955, she suffered a heart attack, although she didn't realize it at the time, during a video taping of The Jimmy Durante Show (1954). She went home after attending a party. Early the next morning, on August 5, Carmen suffered a fatal heart attack. She was just 46 years old. Her body was flown to her adopted country of Brazil, where her death was declared a period of national mourning.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA5NjExODc4OF5BMl5BanBnXkFtZTYwNzYwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000544","name":"Carmen Miranda","nicknames":["The Brazilian Bombshell","A Pequena Notável"],"idIMDB":"nm0000544"},"actorId":"nm0000544","character":"Dorita","urlCharacter":"http://www.imdb.com/character/ch0557751","main":true},{"actorName":"Phil Baker","urlProfile":"http://www.imdb.com/name/nm0048831","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWUxYmFmYzAtNjVhMy00NmEyLThkNTUtZjJiMTRhOTczOTdmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 August 1896","placeOfBirth":" Philadelphia, Pennsylvania, USA","bio":"Composer, songwriter (\"Park Avenue Strut\"), comedian, author and accordionist, educated in Boston schools. His first stage appearance was in a Boston amateur show. He teamed up with violinist Ed Janis, and later with Ben Bernie. He served in the US Navy during World War I, and then worked in vaudeville and was featured on radio's \"Take It or Leave It.\" He also appeared in the Broadway musicals: \"Music Box Revue\", \"Crazy Quilt\", \"Artists and Models\", \"Greenwich Village Follies\", \"A Night in Spain\", and \"Calling All Stars\". He joined ASCAP in 1929, and his other popular song compositions include \"Look At Those Eyes\"; \"Just Suppose\"; \"Antoinette\"; \"Strange Interlude\"; \"Humming a Love Song\"; \"Rainy Day Pal\"; \"Pretty Little Baby\"; \"Did You Mean It?\"; \"My Heaven on Earth\"; and \"Invitation to a Broken Heart\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWUxYmFmYzAtNjVhMy00NmEyLThkNTUtZjJiMTRhOTczOTdmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0048831","name":"Phil Baker","idIMDB":"nm0048831"},"actorId":"nm0048831","character":"Phil Baker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Benny Goodman","urlProfile":"http://www.imdb.com/name/nm0329015","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMjYxNzUyOV5BMl5BanBnXkFtZTYwNDc0MzQ2._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1909","placeOfBirth":" Chicago, Illinois, USA","birthName":"Benjamin David Goodman","height":"6' 5\" (1.96 m)","bio":"The King of Swing! Famed clarinetist, composer (\"Stompin' at the Savoy\") and conductor, educated at the Lewis Institute in Chicago and a student of Schillinger and Schoepp. He was a clarinetist with the orchestras of Bix Beiderbecke, Jules Herbuveaux, Arnold Johnson and Ben Pollack, and also played in Broadway theater orchestras. He began to lead his own orchestras in 1934 at the Billy Rose Music Hall, then conducted the orchestra on the weekly radio program \"Let's Dance\" in 1934-1935, and played at numerous hotels, colleges and theaters. Expanding his musical efforts, he performed in chamber music concerts, later touring throughout the US, Europe, the Far East, South America and the USSR and made many recordings. Joining ASCAP in 1945, his chief musical collaborators included Count Basie, Harry James, Mitchell Parish, Andy Razaf, Edgar M. Sampson, Chick Webb, and Teddy Wilson. Some of his other popular songs and instrumental compositions include \"Lullaby in Rhythm,\" \"Don't Be That Way,\" \"Seven Come Eleven,\" \"Flying Home,\" \"Two O'Clock Jump,\" \"Air Mail Special,\" \"Dizzy Spells,\" \"If Dreams Come True,\" \"Georgia Jubilee,\" \"Four Once More,\" and \"The Kingdom of Swing\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMjYxNzUyOV5BMl5BanBnXkFtZTYwNDc0MzQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0329015","name":"Benny Goodman","nicknames":["The King of Swing"],"idIMDB":"nm0329015"},"actorId":"nm0329015","character":"Benny Goodman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Benny Goodman and His Orchestra","urlProfile":"http://www.imdb.com/name/nm1244714","urlPhoto":"","biography":{"urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1244714","name":"Benny Goodman and His Orchestra","idIMDB":"nm1244714"},"actorId":"nm1244714","character":"Benny Goodman's Orchestra","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eugene Pallette","urlProfile":"http://www.imdb.com/name/nm0657874","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5Nzk5NzA2NF5BMl5BanBnXkFtZTcwNTI1MDQxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1889","placeOfBirth":" Winfield, Kansas, USA","birthName":"Eugene William Pallette","height":"5' 9\" (1.75 m)","bio":"Gargantuan-bellied, frog-voiced character actor who was a staple in forties movies. After World War II his ultra-right-wing political views fuelled his 'bomb' paranoia and he bought a property in Oregon which he turned into a well-stocked compound in case the Russians attacked. Many of his old Hollywood friends, including Clark Gable, visited him there (some came to hunt and fish) but the property was later sold.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5Nzk5NzA2NF5BMl5BanBnXkFtZTcwNTI1MDQxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0657874","name":"Eugene Pallette","idIMDB":"nm0657874"},"actorId":"nm0657874","character":"Andrew Mason Sr.","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charlotte Greenwood","urlProfile":"http://www.imdb.com/name/nm0339307","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDg2MTVmYWEtNjc4ZC00NGQwLTk0MWUtOTllODM5NmE3MzE3XkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 June 1890","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Frances Charlotte Greenwood","height":"5' 8½\" (1.74 m)","bio":"Charlotte Greenwood was born Frances Charlotte Greenwood on June 25, 1890, in Philadelphia, Pennsylvania. She was a sickly child and her father left the family when she was very young. Charlotte grew into a healthy, six foot tall woman. She started her career dancing in vaudeville where she became known for her long legs. Her signature dance move was doing a high kick. She was nicknamed \"Lady Longlegs\". In 1915 Charlotte married actor Cyril Ring. She was deeply in love with him but he left her for another woman. Charlotte married songwriter Martin Broones in 1924. Although she dreamed of becoming a dramatic actress she had greater success in comedy. She starred in a series of stage shows playing a man crazy character named \"Letty\". The character became so popular that Charlotte starred in the movie version So Long Letty in 1929. She appeared in dozens of films including Down Argentine Way, Star Dust, and The Gang's All Here. Charlotte was usually cast as the comedic sidekick and became one the most recognizable character actresses. During World War 2 she joined the Hollywood Victory Caravan and traveled across the country with other film stars raising money. Charlotte returned to the stage in 1950 starring in Cole Porter's Out of This World. She was a devout Christian scientist and her faith made her turn down roles she felt were too risqué. In 1955 she played Aunt Eller in the hit musical Oklahoma. Charlotte made a few more films before retiring. She and Martin enjoyed a very happy marriage until his death in 1971. Charlotte died on December 28, 1977 from natural causes. She was cremated and her ashes were scattered at sea. Since she had no children she left her personal papers to playwright William Luce.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDg2MTVmYWEtNjc4ZC00NGQwLTk0MWUtOTllODM5NmE3MzE3XkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0339307","name":"Charlotte Greenwood","nicknames":["Lady Longlegs","Letty"],"idIMDB":"nm0339307"},"actorId":"nm0339307","character":"Mrs. Peyton Potter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edward Everett Horton","urlProfile":"http://www.imdb.com/name/nm0002143","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MzI5ODUzOF5BMl5BanBnXkFtZTYwMDMxNjAz._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 March 1886","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Edward Everett Horton Jr.","height":"6' (1.83 m)","bio":"It seemed like Edward Everett Horton appeared in just about every Hollywood comedy made in the 1930s. He was always the perfect counterpart to the great gentlemen and protagonists of the films. Horton was born in Brooklyn, New York City, to Isabella S. (Diack) and Edward Everett Horton, a compositor for the NY Times. His maternal grandparents were Scottish and his father was of English and German ancestry. Like many of his contemporaries, Horton came to the movies from the theatre, where he debuted in 1906. He made his film debut in 1922. Unlike many of his silent-film colleagues, however, Horton had no problems in adapting to the sound, despite--or perhaps because of--his crackling voice. From 1932 to 1938 he worked often with Ernst Lubitsch, and later with Frank Capra. He has appeared in more than 120 films, in addition to a large body of work on TV, among which was the befuddled Hekawi medicine man Roaring Chicken on the western comedy F Troop (1965).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MzI5ODUzOF5BMl5BanBnXkFtZTYwMDMxNjAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002143","name":"Edward Everett Horton","nicknames":["Eddie","Ned"],"idIMDB":"nm0002143"},"actorId":"nm0002143","character":"Peyton Potter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony De Marco","urlProfile":"http://www.imdb.com/name/nm0210084","urlPhoto":"","biography":{"dateOfBirth":"1 February 1898","placeOfBirth":" Buffalo, New York, USA","bio":"Tony De Marco was born on February 1, 1898 in Buffalo, New York, USA. He was an actor, known for The Gang's All Here (1943), Greenwich Village (1944) and In Caliente (1935). He was married to Sally De Marco, Renee De Marco, Mabel Scott and Nina Kroner (aka Nina De Marco). He died on November 14, 1965 in Palm Beach, Florida, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0210084","name":"Tony De Marco","idIMDB":"nm0210084"},"actorId":"nm0210084","character":"Tony","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Ellison","urlProfile":"http://www.imdb.com/name/nm0255199","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDdmMjcwMTEtYzQ3Zi00YjBhLTk1MTgtZTU5Yjg0ODVkMTA1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 May 1910","placeOfBirth":" Guthrie Center, Iowa, USA","birthName":"James Ellison Smith","height":"6' 2\" (1.88 m)","bio":"American light leading man, primarily of Westerns, James Ellison was born James Ellison Smith in Guthrie Center, Iowa, in 1910. He grew up on a ranch in Valier, Montana, where he learned the skills that would stand him in good stead as a movie cowboy. His family moved to Los Angeles when he was a young man, and it was there that he first became interested in the theatre. He studied at the Pasadena Playhouse briefly, traveled to New York (and by some accounts played some minor roles in productions of the visiting Moscow Art Theatre, probably as a supernumerary), then returned to California where he was spotted by a Warner Bros. talent scout at a production of the Beverly Hills Little Theatre. He played a number of bit parts for Warners and MGM before landing the plum part of Hopalong Cassidy's sidekick Johnny Nelson in Paramount's wildly successful series. Ellison played Nelson for eight films between the years 1935 and 1937, also playing in other films in between. Although he was a supporting player in the Hopalong films, his name was strangely billed in the same size and format as veteran actor and matinee idol William Boyd's. Although not confirmed, the reason for this oddity is thought to be because the character Johnny Nelson was very prominent in the Hopalong Cassidy book series. In 1936 he was plucked by Cecil B. DeMille for the role of Buffalo Bill Cody in De Mille's epic Western The Plainsman (1936) opposite Gary Cooper. De Mille reportedly hated Ellison's performance and wanted to ensure that Ellison never had as good a part in quite as good a film ever again. In the late 1930s and 1940s Ellison did follow up with quite a number of romantic leads in a wide variety of films, from musicals and light mysteries, with such co-stars as Maureen O'Hara (They Met in Argentina (1941)), Jimmy Stewart and Ginger Rogers (Vivacious Lady (1938)) to the cult horror classic I Walked with a Zombie (1943). In 1950 Ellison returned to westerns, this time as the lead (along with his Hopalong replacement and longtime friend Russell Hayden) in a series of 11 westerns featuring them as two frontier lawmen, Lucky (Hayden) and Shamrock (Ellison). In the late 1950s, Ellison retired from movies and became a successful real estate broker. He died in 1993, as the result of a fall in which he broke his neck, at the age of 83.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDdmMjcwMTEtYzQ3Zi00YjBhLTk1MTgtZTU5Yjg0ODVkMTA1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0255199","name":"James Ellison","nicknames":["Jimmy"],"idIMDB":"nm0255199"},"actorId":"nm0255199","character":"Andy Mason","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sheila Ryan","urlProfile":"http://www.imdb.com/name/nm0752846","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwYTBlNjYtOGYxNy00Yzg1LTkxMjctYmY1YmE0NjMzOTVhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1921","placeOfBirth":" Topeka, Kansas, USA","birthName":"Katherine Elizabeth McLaughlin","height":"5' 5\" (1.65 m)","bio":"Sheila Ryan was born on June 8, 1921 in Topeka, Kansas, USA as Katherine Elizabeth McLaughlin. She was an actress, known for Railroaded! (1947), Dead Men Tell (1941) and Great Guns (1941). She was married to Pat Buttram, Edward Norris and Allan Lane. She died on November 4, 1975 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwYTBlNjYtOGYxNy00Yzg1LTkxMjctYmY1YmE0NjMzOTVhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0752846","name":"Sheila Ryan","idIMDB":"nm0752846"},"actorId":"nm0752846","character":"Vivian Potter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dave Willock","urlProfile":"http://www.imdb.com/name/nm0932565","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0OTQ1OTYyNl5BMl5BanBnXkFtZTgwODE5OTU2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 August 1909","placeOfBirth":" Chicago, Illinois, USA","birthName":"David Winchester Willock","bio":"For over five decades veteran character actor Dave Willock could be spotted as your friendly neighbor, buddy or unassuming blue-collar in hundreds of assorted films--both comedy and drama. Tall and lanky marked with a slightly long, gaunt puss, flat vocal pattern and jug-like ears, he was for the most part an amiable guy who blended in unobtrusively as a benign servile -- cabbie, clerk, usher, soda jerk, photographer, messenger boy, bellhop, etc. Decades later he was handed minor but steady work via Jerry Lewis, Robert Aldrich and Walt Disney. Born in Chicago, Illinois on August 13, 1909 to non-professionals, Dave began his career in theater and drama while a student at the University of Wisconsin. Following college studies, he entered vaudeville as part of the comedy team of \"Willock & Carson,\" an act he put together with future actor Jack Carson. From vaudeville he and Carson transitioned into radio, appearing first on Bing Crosby's \"Kraft Music Hall\" in 1938. Carson became the bigger star of the two and when he received his own show (\"The Jack Carson Show\") he utilized his old friend and partner's talents in a second-banana position playing Carson's smart-mouthed nephew Tugwell. On his own, Dave made his film debut in a student bit in Good Girls Go to Paris (1939) and remained in the overlooked, often unbilled category throughout the war years. His small but amiable bits included various army buddies, benign suitors and dependable sidekicks. Some of his more visible featured roles came in war-era musicals and comedies such as Priorities on Parade (1942), Lucky Jordan (1942), Let's Face It (1943), The Gang's All Here (1943)- Pin Up Girl (1944), She's a Sweetheart (1944) and Joe Palooka, Champ (1946), but nothing he was seen in was big enough to maneuver him into the top character ranks. He was seen to better advantage with the coming of TV, where he dotted a number of comedies, dramas and sitcom series. A perennial support player, he appeared in a number of cult sci-fi classics of the 1950s including It Came from Outer Space (1953), Revenge of the Creature (1955) and Queen of Outer Space (1958). In later years he served as a minor foil for Jerry Lewis when the comedian went solo in such film vehicles as The Delicate Delinquent (1957), The Geisha Boy (1958), The Ladies Man (1961), The Nutty Professor (1963), The Patsy (1964) and The Disorderly Orderly (1964). Dave was a utility player as well for director Robert Aldrich in such films as Hush...Hush, Sweet Charlotte (1964), The Legend of Lylah Clare (1968), The Grissom Gang (1971), and Emperor of the North (1973), with his most famous Aldrich role being that of Bette Davis and Joan Crawford's vaudeville father in the classic grand guignol shocker What Ever Happened to Baby Jane? (1962). Disney kept him fairly busy in their TV and film features from the late 1950s into the 1970s, and he was a favorite casting choice of Jack Webb for Dragnet and Adam-12 (where he'd appear as a good-natured barfly or a pharmacist). Willock was also heard but not seen in animated cartoons, notably as the narrator of the Wacky Races (1968) kiddie cartoon. Retired by the late 1970s, Dave passed away on November 12, 1990 of complications from a stroke in Woodland Hills, California at the age of 81.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM0OTQ1OTYyNl5BMl5BanBnXkFtZTgwODE5OTU2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0932565","name":"Dave Willock","nicknames":["Tugwell"],"idIMDB":"nm0932565"},"actorId":"nm0932565","character":"Sgt. Pat Casey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bando da Lua","urlProfile":"http://www.imdb.com/name/nm0196125","urlPhoto":"","biography":{"dateOfBirth":"1929","placeOfBirth":" Rio de Janeiro, Rio de Janeiro, Brazil","bio":"Bando da Lua was born in 1929 in Rio de Janeiro, Rio de Janeiro, Brazil.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0196125","name":"Bando da Lua","idIMDB":"nm0196125"},"actorId":"nm0196125","character":"Dorita's Orchestra","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0035916","urlIMDB":"http://www.imdb.com/title/tt0035916","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"25","month":"04","year":"1943","remarks":null},null],"copyrightHolder":"Twentieth Century-Fox Film Corporation (original), U.S. Copyright LP12471, 24 December 1943"},"technical":{"runtime":["1 hr 43 min (103 min)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Color (Technicolor)"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":["Technicolor"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.9","filmingLocations":[{"location":"Stage 16, 20th Century Fox Studios - 10201 Pico Blvd., Century City, Los Angeles, California, USA"}],"rated":"APPROVED","awards":[{"award":"Academy Awards, USA 1944","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Art Direction-Interior Decoration, Color","names":[{"name":"James Basevi","id":"nm0059730","role":null},{"name":"Joseph C. Wright","id":"nm0942532","role":null},{"name":"Thomas Little","id":"nm0514673","role":null}]}]}]},{"award":"National Film Preservation Board, USA 2014","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"National Film Preservation Board","names":[]}]}]}],"votes":"1,166","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"}],"keywords":{"keywords":["dance","soldier","chorus girl","wealth","fictional variety show","singer","world war two","nightclub"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:32:33"}}