{"data":{"movies":[{"title":"Nicholas and Alexandra","originalTitle":"","year":"1971","releaseDate":"19711213","directors":[{"name":"Franklin J. Schaffner","id":"nm0769874"}],"writers":[{"name":"Robert K. Massie","id":"nm0557409"},{"name":"Edward Bond","id":"nm0093927"}],"runtime":"183 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODAxOTI3OV5BMl5BanBnXkFtZTcwOTI3OTgyMQ@@._V1.jpg","countries":["UK","USA"],"languages":["English","French","German","Russian"],"genres":["Biography","Drama","History","War"],"plot":"The tragic story of Nicholas II, the last Czar of Russia, set against the backdrop of the Russian Revolution. It is an inside look into the private lives of Nicholas and his wife Alexandra, their daughters, their only son and the painful secret about their son and heir apparent which bound the Imperial Couple to the mystical Rasputin, and the eventual execution of the entire family.","simplePlot":"Tsar Nicholas II, the inept monarch of Russia, insensitive to the needs of his people, is overthrown and exiled to Siberia with his family.","actors":[{"actorName":"Michael Jayston","urlProfile":"http://www.imdb.com/name/nm0419785","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzIyMDI3NzY2MV5BMl5BanBnXkFtZTgwMTAwMDM5MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1935","placeOfBirth":" Nottingham, Nottinghamshire, England, UK","birthName":"Michael James","height":"5' 10\" (1.78 m)","bio":"Michael Jayston was born on October 29, 1935 in Nottingham, Nottinghamshire, England as Michael James. He is an actor, known for Nicholas and Alexandra (1971), Emmerdale (1972) and Alice's Adventures in Wonderland (1972). He has been married to Elizabeth Ann Smithson since 1978. They have two children. He was previously married to Heather Mary Sneddon and Lynn Farleigh.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzIyMDI3NzY2MV5BMl5BanBnXkFtZTgwMTAwMDM5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0419785","name":"Michael Jayston","idIMDB":"nm0419785"},"actorId":"nm0419785","character":"Nicholas","urlCharacter":"http://www.imdb.com/character/ch0039321","main":true},{"actorName":"Janet Suzman","urlProfile":"http://www.imdb.com/name/nm0840531","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjczODYxMDk2OV5BMl5BanBnXkFtZTcwOTYxNTgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1939","placeOfBirth":" Johannesburg, South Africa","height":"5' 5½\" (1.66 m)","bio":"This alert and classy Britisher seemed poised for Hollywood stardom in the early 1970s. Although it wasn't meant to be, Janet Suzman has remained one of the more respected classical stage actresses of her time. Born in 1939, she was raised in a staunch, liberal family household in South Africa at a time when the country was confronted with the horrors of apartheid. Janet studied languages at the multi-racial Witwatersrand University in the late 1950s and was an active member of the drama society. She left South Africa during the height of her country's oppression and moved to England in 1959. Making her professional stage debut with \"Billy Liar\" in 1962, she almost immediately joined the Royal Shakespeare Company and received rave notices for her Joan of Arc in \"The War of the Roses.\" She made her official London debut in a production of \"A Comedy of Errors\" in 1963. In the ensuing years Janet built up an impressive classical resumé portraying most of Shakespeare's illustrious heroines including Rosalind, Portia, Ophelia, Beatrice and the shrewish Kate. She also appeared in several BBC-TV versions of the classics. In 1969 Janet married director Trevor Nunn and together they collaborated on some of England's finest stage productions during the early 1970s, notably \"Antony and Cleopatra\" (1972), \"Titus Andronicus\" (1972) and \"Hello and Goodbye\" (1973), which won Janet the Evening Standard award. She won a second for her role of Masha in the 1976 production of Chekhov's \"The Three Sisters.\" They had a son, Joshua, before they divorced in the 1980s. Later work included notable roles in \"She Stoops to Conquer,\" \"The Good Woman of Setzuan\" and her \"Hedda Gabler.\" In the early 1970s Janet branched out into films and, following an auspicious turn in A Day in the Death of Joe Egg (1972), won the coveted role of Czarina Alexandra in the florid historical piece Nicholas and Alexandra (1971) co-starring Michael Jayston. With a sterling British cast in support, including Harry Andrews, Jack Hawkins, Ian Holm, John McEnery, Laurence Olivier and Michael Redgrave. Janet received an Oscar nomination for her performance and bigger things seemed inevitable. She went on to grace a number of films including Voyage of the Damned (1976), Nijinsky (1980) and Priest of Love (1981). In a reprise of her real life family's activism, Suzman co-starred in the anti-apartheid film A Dry White Season (1989) portraying the wife of the Donald Sutherland character. The cast included other progressive activists such as Susan Sarandon and Marlon Brando (who received an Academy Award nomination for Best Supporting Actor). In a change-of-pace role, she played a Mother Superior in the hysterical farce Nuns on the Run (1990). In the 1980s Janet was inspired to direct and coach. She was a visiting professor of drama at Westfield College, London, and later returned to South Africa to provide multi-ethnic castings in versions of Shakespearean plays. Making her directing bow in a production of \"Othello\" at the Market Theatre in 1987, some of her more notable assignments included \"Death of a Salesman (1992) and a reworked politicized version of Chekhov's \"The Cherry Orchard\" called \"The Free State\" (1997), which is set in South Africa. In 2002 Janet returned to the RSC to perform in \"The Hollow Crown,\" and most recently appeared in a London production of \"Whose Life Is It Anyway?\" (2005) starring Kim Cattrall.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjczODYxMDk2OV5BMl5BanBnXkFtZTcwOTYxNTgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0840531","name":"Janet Suzman","idIMDB":"nm0840531"},"actorId":"nm0840531","character":"Alexandra","urlCharacter":"http://www.imdb.com/character/ch0040537","main":true},{"actorName":"Roderic Noble","urlProfile":"http://www.imdb.com/name/nm0633661","urlPhoto":"","biography":{"dateOfBirth":"3 October 1957","placeOfBirth":" Darley, Harrogate, North Yorkshire, England, UK","height":"6' 2\" (1.88 m)","bio":"Roderic Noble was born on October 3, 1957 in Darley, Harrogate, North Yorkshire, England. He is an actor, known for Nicholas and Alexandra (1971) and The Main Chance (1969).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0633661","name":"Roderic Noble","idIMDB":"nm0633661"},"actorId":"nm0633661","character":"Alexis","urlCharacter":"http://www.imdb.com/character/ch0393298","main":true},{"actorName":"Ania Marson","urlProfile":"http://www.imdb.com/name/nm0551323","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzJhYWYzNzAtN2Y4MS00ZGU4LTgxMzItNjgxZjYxNDE2MmZkXkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 May 1949","placeOfBirth":" Gdynia, Pomorskie, Poland","bio":"Ania Marson was born on May 22, 1949 in Gdynia, Pomorskie, Poland. She is an actress, known for Nicholas and Alexandra (1971), Howl (2015) and Bad Timing (1980). She has been married to Derek Lister since September 3, 1977. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzJhYWYzNzAtN2Y4MS00ZGU4LTgxMzItNjgxZjYxNDE2MmZkXkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0551323","name":"Ania Marson","idIMDB":"nm0551323"},"actorId":"nm0551323","character":"Olga","urlCharacter":"http://www.imdb.com/character/ch0040544","main":true},{"actorName":"Lynne Frederick","urlProfile":"http://www.imdb.com/name/nm0292802","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNDk4NzQ2MF5BMl5BanBnXkFtZTgwMDQ2NjIwMjE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1954","placeOfBirth":" Hillingdon, Middlesex, England, UK","birthName":"Lynne Maria Frederick","height":"5' 2½\" (1.59 m)","bio":"Lynne Frederick was a promising and ascending British actress of the 1970s. For ten years she captivated movie goers with her perfect combination of girl next door beauty, an angelic smile, an ethereal charm, and a classic fairy tale princess look that was all put into one gifted package. Although best remembered as the fourth and final wife of British comedian, Peter Sellers, Frederick has started gaining a cult following in recent years. Before there was Kate Winslet and Emma Watson, there was Lynne Frederick; the original English Rose. Lynne Wagner Harding Frederick was born in Hillingdon, Uxbridge, United Kingdom to Iris and Andrew Frederick on July 25, 1954. Frederick's father walked out of her life when she was no more than two years of age and she was raised by her grandmother and mother, who worked for Thames Television. Growing up Lynne attended Notting Hill and Ealing High School, and originally intended to become a teacher of physics and mathematics with no intentions of working in Hollywood. In much the same manner as Marilyn Monroe and Lana Turner, Frederick was plucked from obscurity when a talent agent discovered her in a shop and invited her to an audition. Despite no previous experience (in theater, commercials, or films) Frederick got her very first acting job at her first audition. Her debut role came in the 1970 British-American apocalyptic science fiction film, No Blade of Grass (1970). Her next, and more prestigious role, came as Tsar Nicholas's second eldest daughter, Tatiana, in the 1971 Oscar winning British biographical film, Nicholas and Alexandra (1971). In her next film, Henry VIII and His Six Wives (1972), she played another royal figure, the ill-fated fifth wife of Henry VIII, Catherine Howard. Her adaptation as Howard made Tudor cinema history as Frederick was the first actress to portray Howard in a historically accurate and sympathetic point of view. She continued in films with a supporting role in the now cult film, Vampire Circus (1972). Her most well-known screen role came in the 1972 family film, The Amazing Mr. Blunden (1972). For this role she garnered the very first London Evening Standard British Film Award for 'Best New coming Actress'. She followed in films with the 1974 science fiction thriller, Phase IV (1974), for which she was required to appropriate an American accent. Although not a success during its initial release, Phase IV gained a cult following in the years that followed due to its airings on late night television. Frederick co-starred with the Italian Casanovian actor, Fabio Testi, in two films back-to-back as his love interest. The first was the very graphic Italian spaghetti western The Four of the Apocalypse... (1975) which was followed by Red Coat (1975). Frederick then starred in two romantic Spanish films, El vicio y la virtud (1975) and Largo retorno (1975). But her acting credits were not limited to just movies. She also had a long running television career starring in various shows and films made for television. Frederick returned to the horror film scene with her leading role in the 1976 slasher film Schizo (1976). A year later she married fellow actor, Peter Sellers, and would make her final theatrical role alongside him in The Prisoner of Zenda (1979). Lynne Frederick and Peter Sellers relationship was good in the early stages but eventually turned destructive and tempestuous. Their marriage was often tampered with rumors of Frederick being a gold digger, drug use by both parties, and Sellers health issues. Much public scrutiny fell upon Frederick for marrying the much older Sellers, and she often became the target for negative press and tabloids. Further controversy followed after Sellers tragic death on July 24, 1980 (one day before Fredericks twenty sixth birthday) when Frederick was named the beneficiary of nearly his entire will and estate while his children (whom Sellers had never gotten along with and had been estranged from for many years) had gotten hardly anything. Despite pleas from Sellers friends, Frederick did not give Sellers children any further settlements due to her rocky relationship with them. It was then that the whole British public and film industry turned against Frederick, and she was no longer able to find work in Hollywood. Despite the blacklisting that followed Sellers death, Frederick was very protective of his name and reputation. She even won £1 million in a lawsuit against the makers of the Trail of the Pink Panther (1982), a film of Sellers released posthumously, claiming the film tarnished her late husband's memory. Frederick further added to the controversy when she remarried to British media personality, David Frost, six months after Sellers death. The marriage ended in divorce after seventeen months. Following her divorce from Frost, Frederick fled from Britain to America where she met surgeon and heart specialist, Barry Unger, whom she married on Christmas Day in 1982. The following year Frederick bore her only child, Cassie Unger, whom she had a very close relationship with. Her marriage to Unger ended in divorce in 1991. In the later years of her life, Frederick resided in Los Angeles, California where she lived in a spacious house with her daughter, whom she had joint custody of, and they spent most of their days hanging out by the family pool or cooking meals together. In the final years of her life, Lynne Frederick's health spiraled downward as she struggled with alcoholism and bouts of depression. Rumors of chronic drug addiction, clinical depression, failed rehab treatments, and suicide attempts where common news and tabloid reports of Frederick in the later years. The wear and tear of the struggles in life took an obvious tole on her appearance as her weight ballooned, her face became sunken and bloated, and her hair now cropped short and vitiated. Rumor has it that when the paparazzi stood outside her house attempting to get photos of Frederick, there where several occasions where she would walk past them unnoticed as the photographers did not recognize her drastically different appearance in contrast to that of the beautiful English rose that once stole the scenes of films she starred in. On the morning of April 27, 1994, Frederick's lifeless body was discovered by her mother, Iris, in her home. Immediately following Frederick's death, the media engaged in a firestorm of negative press accusing Frederick of being an alcoholic and cocaine addict. They even went as far as reporting her cause of death due to cocaine and alcohol binging. Although the exact cause of Frederick's death has never been disclosed to the public, the common belief is that she died of alcoholism. A year after Frederick's death, her mother revealed in an interview with 'Hello Magazine' that her daughters death had been brought about by natural causes due to a seizure in her sleep, although this has been disputed by some people. For many years, Lynne Frederick's legacy remained poisoned and she was seldom ever talked about. But in recent years, her films have resurfaced to a new generation of cinema buffs where she has been given a whole new fan base and cult following. Many classic movie followers have been taken by her beauty and fallen in love with her.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNDk4NzQ2MF5BMl5BanBnXkFtZTgwMDQ2NjIwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0292802","name":"Lynne Frederick","nicknames":["Lynnie","English Rose","Lynne Sellers","Sellers Widow"],"idIMDB":"nm0292802"},"actorId":"nm0292802","character":"Tatiana","urlCharacter":"http://www.imdb.com/character/ch0040531","main":true},{"actorName":"Candace Glendenning","urlProfile":"http://www.imdb.com/name/nm0322540","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTMzOGUwOWUtNzA5MC00NTA5LWJjOTYtMTc5Mzk3NTllZTJmXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1953","placeOfBirth":" Islington, London, England, UK","bio":"Candace Glendenning was born on August 9, 1953 in Islington, London, England. She is an actress, known for Nicholas and Alexandra (1971), Evil Heritage (1976) and The Flesh and Blood Show (1972).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTMzOGUwOWUtNzA5MC00NTA5LWJjOTYtMTc5Mzk3NTllZTJmXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0322540","name":"Candace Glendenning","idIMDB":"nm0322540"},"actorId":"nm0322540","character":"Marie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fiona Fullerton","urlProfile":"http://www.imdb.com/name/nm0298386","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmQ5MzE5N2ItY2VjNS00NTNjLTkzMmUtMzA3NmNhOGVjMDIzXkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1956","placeOfBirth":" Kaduna, Nigeria","bio":"The only child of Bernard and Pamela Fullerton, she was born in Kaduna, Nigeria on 10th October 1956. As a child she wanted to be a ballet dancer and at the age of 11 enrolled at the Elmhurst Ballet School in Surrey where she was spotted and signed to appear in the film 'Run Wild, Run Free' in 1969. This was followed by 'Nicholas and Alexandra' and in 1972 the title role in 'Alice's Adventures in Wonderland' which was her big break. In 1975 was one of the original leads in the BBC television hospital drama series 'Angels'. The following year she married the actor Simon MacCorkindale, divorcing him in 1981. Her career seems to have gone quiet for a while until in 1985 she became a Bond Girl playing Pola Ivanova in 'A View To A Kill' then moved on to be one of the women involved with Nigel Havers in the mini series 'The Charmer'. As her career was progressing she met Neil Shakell, an old family friend again, fell in love and married in 1994 becoming step mother to Neil's son James. A year later she gave birth to Lucy. In 1996 answering a knock on her door she found herself facing a gunman and later discovered that the only reason he didn't shoot her was because she had her baby in her arms. Having already become disillusioned with her career the incident made her want to escape the limelight. She started buying, renovating and selling houses and found herself so successful at it that she now owns a company looking after property and an interior design consultancy. Having written a property advice column for two national newspapers for 10 years it encouraged her to write 3 property focused books. In addition to her film and television work she played two well known women on stage - Guinevere in Camelot opposite Richard Harris and Eliza Dolittle in Pygmalion","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmQ5MzE5N2ItY2VjNS00NTNjLTkzMmUtMzA3NmNhOGVjMDIzXkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0298386","name":"Fiona Fullerton","nicknames":["Princess Fiona"],"idIMDB":"nm0298386"},"actorId":"nm0298386","character":"Anastasia","urlCharacter":"http://www.imdb.com/character/ch0015660","main":true},{"actorName":"Harry Andrews","urlProfile":"http://www.imdb.com/name/nm0028674","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MjQyMDg1Ml5BMl5BanBnXkFtZTcwNzgxOTM2NA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1911","placeOfBirth":" Tonbridge, Kent, England, UK","birthName":"Harry Fleetwood Andrews","height":"6' 2\" (1.88 m)","bio":"British character actor Harry Andrews had the sort of massive granite face and square jaw that would stamp that career, but he set himself apart with brilliant stage and screen work. He had graduated from Wrekin College in Shropshire and then moved on to the stage, appearing with Liverpool Repertory in 1933 and focusing on Shakespearean roles. He was befriended by stage star John Gielgud who invited him to New York and Broadway as part of the cast of \"Hamlet\" in 1935. On the return to London, Andrews did a run of plays in the West End. Then Gielgud invited him into his own stage company. Soon after he was asked into the Old Vic Company by its director Laurence Olivier. His roles were becoming increasingly substantial, authoritative parts to match his sharp and forceful, through-the-teeth delivery of lines. Next he did not pass up the opportunity to join the Stratford Memorial Theatre in Stratford-upon-Avon, where he spent a decade honing himself into an established, fine, versatile actor, described by the controversial London theater critic Kenneth Tynan as \"the backbone of British theater.\" He came to the small screen before the large, having debuted in British experimental television in 1939, followed over a decade later with his debut on the ever expanding and fecund American playhouse TV in 1952. His big screen debut came the next year in a character part which would accent his career-from ancient to modern-the disciplined military man in Paratrooper (1953). From there the roles came his way - three or four per year - well into 1979, when TV took up most of his time. His movie making was spent either before American or British cameras. And the military roles were always masterly done, whether a roughed out sergeant or a more dignified officer. Though his most famous noncom may be Sergeant Major Tom Pugh alongside John Mills in J. Lee Thompson's classic adventure Ice Cold in Alex (1958), his achievement as Sergeant Major Bert Wilson, the near psychotic martinet, opposite Sean Connery and Ian Bannen, in The Hill (1965) was an over-the-top tour de force. That same year he was back in costume - having played many an ancient and medieval noble role through the 1950s - in something different - playing the great Renaissance architect Donato Bramante against Charlton Heston as rival Michelangelo in The Agony and the Ecstasy (1965). Not a big part, nevertheless Andrews gave the role a subdued and matter-of-fact strength that well fit the ambitious architect of the fiery Pope Julius II (played with great verve by Rex Harrison). While Andrews was also excellent with a tongue-in-cheek style for comedic roles, as in the send up, The Ruling Class (1972), he excelled against type as a flamboyant homosexual in the black comedy Entertaining Mr. Sloane (1970). He had said something like: \"I don't want to be a star -- I want to be a good actor in good parts\" - but his presence always made him standout. It was ironic that he had difficulty in memorizing lines. Sometime later co-star Alan Bates thought him very courageous for his obvious triumph over this impediment. Bates further remarked that Andrews' great sense of humor and no-nonsense personable character made him a favorite with younger actors as a continuous well of encouragement and learning experiences. Though his parts were smaller as he grew older, he filled each of his roles, big or small - over 100 of them - with a giant's footsteps.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MjQyMDg1Ml5BMl5BanBnXkFtZTcwNzgxOTM2NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0028674","name":"Harry Andrews","idIMDB":"nm0028674"},"actorId":"nm0028674","character":"Grand Duke Nicholas","urlCharacter":"http://www.imdb.com/character/ch0040730","main":true},{"actorName":"Irene Worth","urlProfile":"http://www.imdb.com/name/nm0941683","urlPhoto":"","biography":{"dateOfBirth":"23 June 1916","placeOfBirth":" Fairbury, Nebraska, USA","birthName":"Harriet Elizabeth Abrams","bio":"Educated at UCLA, she made her Broadway debut in 1943. Primarily a stage actress she moved to Britain in 1944, where she worked at the Old Vic and with the Royal Shakespeare Company. She returned to the US in 1975, continuing her stage work on Broadway, and making occasional films. She has won three Tony Awards for her stage work.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0941683","name":"Irene Worth","idIMDB":"nm0941683"},"actorId":"nm0941683","character":"The Queen Mother Marie Fedorovna","urlCharacter":"http://www.imdb.com/character/ch0015662","main":true},{"actorName":"Tom Baker","urlProfile":"http://www.imdb.com/name/nm0048982","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDE5NzYyNF5BMl5BanBnXkFtZTgwODkyMzc2MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1934","placeOfBirth":" Liverpool, England, UK","birthName":"Thomas Stewart Baker","height":"6' 3\" (1.91 m)","bio":"The British character actor Tom Baker, best known as the fourth incarnation of The Doctor, was born in 1934 in Liverpool, England, to Mary Jane (Fleming) and John Stewart Baker. His father was of English and Scottish descent, while his mother's family was originally from Ireland. Tom, along with his younger sister, Lulu, and younger brother, John, was raised in a poor Catholic community by his mother, a house-cleaner and barmaid, who was a devout Catholic, and his father, a sailor, who was rarely at home. At age fifteen, Baker left school to become a monk with the Brothers of Ploermel on the island of Jersey. Six years later, he abandoned the monastic life and performed his National Service in the Royal Army Medical Corps., where he became interested in acting. Baker then served on the Queen Mary for seven months as a sailor in the Merchant Navy before attending Rose Bruford College of Speech and Drama in Kent, England, on scholarship. Baker acted in repertory theaters around Britain until the late 1960s when he joined up with the National Theatre, where he performed with such respected actors as Maggie Smith, Anthony Hopkins and Laurence Olivier, who helped him get his first prominent film role as Rasputin in Nicholas and Alexandra (1971). His performance in this film earned him two Golden Globe Award nominations, one for best actor in a supporting role and another for best new star of the year. A couple of years earlier, Baker had made his theatrical film debut in The Winter's Tale (1967). Despite appearances in a spate of films, including Pier Paolo Pasolini's The Canterbury Tales (1972), The Mutations (1974), The Vault of Horror (1973) and The Golden Voyage of Sinbad (1973), Baker was working as a labourer at a building site when he landed the role of the main character in the popular, long-running British television series Doctor Who (1963), a role that brought him international fame and popularity. After his seven-year stint as Dr. Who from 1974 to 1981, Baker returned to theatre and made occasional television and film appearances, playing Sherlock Holmes in The Hound of the Baskervilles (1982), Puddleglum in The Chronicles of Narnia story The Silver Chair (1990) and Hallvarth, Clan Leader of the Hunter Elves, in Dungeons & Dragons (2000). Throughout his career, Baker's acting style has been to portray his characters with a \"larger-than-life\" air.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDE5NzYyNF5BMl5BanBnXkFtZTgwODkyMzc2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0048982","name":"Tom Baker","idIMDB":"nm0048982"},"actorId":"nm0048982","character":"Rasputin","urlCharacter":"http://www.imdb.com/character/ch0009290","main":true},{"actorName":"Jack Hawkins","urlProfile":"http://www.imdb.com/name/nm0370144","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MTk0NzI5OF5BMl5BanBnXkFtZTcwNTI1NjQwOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1910","placeOfBirth":" Wood Green, London, England, UK","birthName":"John Edward Hawkins","height":"5' 11\" (1.81 m)","bio":"In Britain, special Christmas plays called pantomimes are produced for children. Jack Hawkins made his London theatrical debut at age 12, playing the elf king in \"Where The Rainbow Ends\". At 17, he got the lead role of St. George in the same play. At 18, he made his debut on Broadway in \"Journey's End\". At 21, he was back in London playing a young lover in \"Autumn Crocus\". He married his leading lady, Jessica Tandy. That year he also played his first real film role in the 1931 sound version of Alfred Hitchcock's The Phantom Fiend (1932). During the 30s, he took his roles in plays more seriously than the films he made. In 1940, Jessica accepted a role in America and Jack volunteered to serve in the Royal Welsh Fusiliers. He spent most of his military career arranging entertainment for the British forces in India. One of the actresses who came out to India was Doreen Lawrence who became his second wife after the war. Alexander Korda advised Jack to go into films and offered him a three-year contract. In his autobiography, Jack recalled: \"Eight years later I was voted the number one box office draw of 1954. I was even credited with irresistible sex appeal, which is another quality I had not imagined I possessed.\" A late 1940s film, The Black Rose (1950), where he played a secondary role to Tyrone Power, would be one of his most fortunate choices of roles. The director was Henry Hathaway who Jack said was \"probably the most feared, yet respected director in America, for he had a sharp tongue and fired people at the drop of a hat. Years later, after my operation when I lost my voice, he went out of his way to help me get back into films. What I did not know was that during the filming of 'The Black Rose' he was himself suffering from cancer.\" In the 1950s came the film that made Hawkins a star, The Cruel Sea (1953). Suffering from life long real life sea sickness, he played the captain of the Compass Rose. After surgery for throat cancer in 1966, requiring the removal of his larynx, Jack continued to make films. He mimed his lines and the voice was dubbed by either Charles Gray or Robert Rietty. His motto during those last years came from Milton's \"Comus\", a verse play in which he acted early in his career in Regent's Park. The lines: \"Yet where an equal poise of hope and fear does arbitrate the event, my nature is that I incline to hope, rather than to fear.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MTk0NzI5OF5BMl5BanBnXkFtZTcwNTI1NjQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0370144","name":"Jack Hawkins","idIMDB":"nm0370144"},"actorId":"nm0370144","character":"Count Fredericks","urlCharacter":"http://www.imdb.com/character/ch0042851","main":true},{"actorName":"Timothy West","urlProfile":"http://www.imdb.com/name/nm0922367","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMjEwNjI1OF5BMl5BanBnXkFtZTcwNjQwNDAyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1934","placeOfBirth":" Bradford, Yorkshire, England, UK","birthName":"Timothy Lancaster West","height":"5' 9\" (1.75 m)","bio":"A versatile British actor noted for his great power and command on the classical stage and in several other mediums including radio, film and television, Timothy West was born on October 20, 1934 in Bradford, Yorkshire, England, the son of actors (Harry) Lockwood West and his wife Olive (Carleton-Crowe). Educated at John Lyon School and the Polytechnic, he first appeared on the stage in 1956 at the Wimbledon Theatre in a production of \"Summertime\". He then spent several seasons in repertory at such venues as Wimbledon, Newquay, Hull, Northampton, Worthing and Salisbury. He made his London debut at the Piccadilly Theatre in the comical farce \"Caught Napping\" in 1959. For the Royal Shakespeare Company and the Aldwych (in 1964), he appeared in \"Afore Night Come\" and \"The Marat-Sade\", in addition to building up his Shakespeare repertoire with roles in \"The Merry Wives of Windsor\", \"Love's Labour's Lost\", \"The Merchant of Venice\", \"The Comedy of Errors\" and \"Timon of Athens\". For the Prospect Theatre Company, he appeared he took on the Shakespearean roles of Prospero (\"The Tempest\"), Claudius (\"Hamlet\"), Bolingbroke (\"Richard II\") and Mortimer (\"Edward II\"), among others. He also played the noted historical figure Samuel Johnson in two plays. Along with definitive portrayals of Lear, Macbeth, Falstaff and Shylock, he became well-respected as a stage director. More recently, he directed a touring production of \"H.M.S. Pinafore\" while delightfully grandstanding in the role of Sir Joseph Porter. Other recent performances at age 70+ include \"National Hero\" and the title role in \"The Life of Galileo\". Cutting a grand and imposing Wellesian figure, his acclaimed work on television has included recreating a number of his classical characters. He has played kingly roles, such as his superb Edward VII in the epic miniseries Edward the King (1975), and essayed a number of notable historical figures such as Cardinal Wolsey in Henry VIII (1979), Soviet Premier Mikhail Gorbechev in Breakthrough at Reykjavik (1987) and Martin Luther (2002). He has portrayed Winston Churchill a number of times in such master productions as Churchill and the Generals (1979), The Last Bastion (1984) and Hiroshima (1995), while his extended gallery of greats have gone on to include Sir Thomas Beecham and Joseph Stalin. Although his star shines less bright on film, he has nevertheless contributed greatly over the years with marvelously stern and scowling character roles in such prestigious fare as Nicholas and Alexandra (1971), The Day of the Jackal (1973), Hedda (1975) (as Judge Brack), Agatha (1979), Cry Freedom (1987), Ever After: A Cinderella Story (1998) and Iris (2001). Long married to second wife actress/comedienne Prunella Scales, the couple have appeared together on stage over the years in such productions as \"When We Are Married\", \"A Long Day's Journey Into Night\", \"The Birthday Party\" and \"The External\". They have two sons, Joseph West (Joe) and Samuel West, the latter also an actor of note. Timothy's daughter Juliet is from his first marriage. A gifted raconteur, he is the author of several books, including \"I'm Here I Think, Where are You?\", a collection of letters written while on tour, his autobiography \"A Moment Towards the End of the Play,\" and, his most recent, \"So You Want to Be an Actor?\" co-written with wife Prunella. In 1984, he was made Commander of the Order of the British Empire for his services to the profession and has received honorary doctorates from six different universities.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMjEwNjI1OF5BMl5BanBnXkFtZTcwNjQwNDAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0922367","name":"Timothy West","idIMDB":"nm0922367"},"actorId":"nm0922367","character":"Dr. Botkin","urlCharacter":"http://www.imdb.com/character/ch0040540","main":true},{"actorName":"Katherine Schofield","urlProfile":"http://www.imdb.com/name/nm0774530","urlPhoto":"","biography":{"dateOfBirth":"16 March 1939","placeOfBirth":" Yorkshire, England, UK","bio":"Katherine Schofield was born on March 16, 1939 in Yorkshire, England. She was an actress, known for The Naked Civil Servant (1975), Lifeforce (1985) and Nicholas and Alexandra (1971). She died on August 6, 2002 in Glamorgan, Wales.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0774530","name":"Katherine Schofield","idIMDB":"nm0774530"},"actorId":"nm0774530","character":"Tegleva","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean-Claude Drouot","urlProfile":"http://www.imdb.com/name/nm0238379","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmZlNzUyOTAtZjdjYi00MDEyLTllMjItYjU2MTAwMTA4YmVjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1938","placeOfBirth":" Lessines, Belgium","birthName":"Jean-Claude Constant Nestor Gustave Drouot","bio":"Jean-Claude Drouot was born on December 17, 1938 in Lessines, Belgium as Jean-Claude Constant Nestor Gustave Drouot. He is an actor, known for Thierry la Fronde (1963), Le Bonheur (1965) and Nicholas and Alexandra (1971). He has been married to Claire Drouot since 1960. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmZlNzUyOTAtZjdjYi00MDEyLTllMjItYjU2MTAwMTA4YmVjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0238379","name":"Jean-Claude Drouot","idIMDB":"nm0238379"},"actorId":"nm0238379","character":"Gilliard","urlCharacter":"http://www.imdb.com/character/ch0042852","main":true},{"actorName":"John Hallam","urlProfile":"http://www.imdb.com/name/nm0356268","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmMwMmUyZGUtY2Y3OS00NmI5LWJlODQtZmU0Y2RiMzUxNTJkXkEyXkFqcGdeQXVyMzE3OTU5Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1941","placeOfBirth":" Lisburn, Northern Ireland, UK","birthName":"John William Francis Hallam","bio":"Talented and diverse Irish born character actor whose career has embraced British institutions from Raffles to Dr Who. After apprenticing in provincial theatre this commanding, actor appeared in two contrasting war films in 1968 - The Charge of the Light Brigade and Carry On up the Khyber. His next two roles were equally diverse - appearing in the unusual John Huston directed A Walk with Love and Death, then with cheeky Cockney Tommy Steele in Where's Jack? By this stage his career had gathered some momentum and in 1971 he worked with several luminaries - Peter O'Toole in Murphy's War, Michael Caine and Omar Sharif in The Last Valley and Richard Burton in Villain. In 1973 it was the hard-bitten crime drama The Offence with Sean Connery and he also worked with Joss Ackland and James Cossins in Hitler: The Last Ten Days. That year he also featured in bona fide classic The Wicker Man. If film work wasn't hugely successful in the next few year, he kept himself working with a variety of roles in television in a diverse range of shows - Emmerdale Farm, Raffles, Return of the Saint. 1980 and 1981 saw roles in a couple of fantasy-spectaculars, Flash Gordon and special-effects bonanza Dragonslayer. It was 1991 before he returned to cinemas in any significant way, though, in Robin Hood: Prince of Thieves, then in 1997 in another fantasy adventure Kull the Conqueror. Meanwhile he appeared in popular soap opera Eastenders as 'Barnsey' Barnes for 2 years between 1988-90. Often portrayed as a hardman or heavy onscreen, offscreen Hallam likes gardening!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmMwMmUyZGUtY2Y3OS00NmI5LWJlODQtZmU0Y2RiMzUxNTJkXkEyXkFqcGdeQXVyMzE3OTU5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0356268","name":"John Hallam","idIMDB":"nm0356268"},"actorId":"nm0356268","character":"Nagorny","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0067483","urlIMDB":"http://www.imdb.com/title/tt0067483","business":{"budget":{"money":"$9,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"30","month":"11","year":"1970","remarks":null},null],"copyrightHolder":"COPYRIGHT © MCMLXXI By HORIZON PICTURES INC. ALL RIGHTS RESERVED (on print)"},"technical":{"runtime":["3 hr 3 min (183 min)","3 hr 9 min (189 min) (UK)"],"soundMix":["70 mm 6-Track (70 mm prints) (UK release)","Mono (35 mm prints)"],"color":["Color (Eastmancolor) (uncredited)"],"aspectRatio":["2.20 : 1 (70 mm prints)","2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic) (as Panavision ®)"],"printedFilmFormat":["35 mm","70 mm (blow-up)"]},"rating":"7.3","filmingLocations":[{"location":"Sa Conca Beach, S'Agaró, Castell-Paltja d'Aro, Girona, Catalonia, Spain"}],"rated":"GP","awards":[{"award":"Academy Awards, USA 1972","titlesAwards":[{"titleAwardOutcome":"Won Oscar","categories":[{"category":"Best Art Direction-Set Decoration","names":[{"name":"John Box","id":"nm0101501","role":null},{"name":"Ernest Archer","id":"nm0033658","role":null},{"name":"Jack Maxsted","id":"nm0561624","role":null},{"name":"Gil Parrondo","id":"nm0663597","role":null},{"name":"Vernon Dixon","id":"nm0228999","role":null}]},{"category":"Best Costume Design","names":[{"name":"Yvonne Blake","id":"nm0086762","role":null},{"name":"Antonio Castillo","id":"nm0145016","role":null}]}]},{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Picture","names":[{"name":"Sam Spiegel","id":"nm0818545","role":null}]},{"category":"Best Actress in a Leading Role","names":[{"name":"Janet Suzman","id":"nm0840531","role":null}]},{"category":"Best Cinematography","names":[{"name":"Freddie Young","id":"nm0002875","role":null}]},{"category":"Best Music, Original Dramatic Score","names":[{"name":"Richard Rodney Bennett","id":"nm0005961","role":null}]}]}]},{"award":"Golden Globes, USA 1972","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Supporting Actor - Motion Picture","names":[{"name":"Tom Baker","id":"nm0048982","role":null}]},{"category":"Most Promising Newcomer - Female","names":[{"name":"Janet Suzman","id":"nm0840531","role":null}]},{"category":"Most Promising Newcomer - Male","names":[{"name":"Tom Baker","id":"nm0048982","role":null}]}]}]},{"award":"BAFTA Awards 1972","titlesAwards":[{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best Art Direction","names":[{"name":"John Box","id":"nm0101501","role":null}]},{"category":"Best Costume Design","names":[{"name":"Yvonne Blake","id":"nm0086762","role":null},{"name":"Antonio Castillo","id":"nm0145016","role":null}]},{"category":"Most Promising Newcomer to Leading Film Roles","names":[{"name":"Janet Suzman","id":"nm0840531","role":null}]}]}]},{"award":"Grammy Awards 1973","titlesAwards":[{"titleAwardOutcome":"Nominated Grammy","categories":[{"category":"Best Original Score Written for a Motion Picture or TV Special","names":[{"name":"Richard Rodney Bennett","id":"nm0005961","role":null}]}]}]},{"award":"National Board of Review, USA 1972","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Top Ten Films","names":[]}]}]}],"votes":"3,486","type":"Movie","companyCreditsSimple":[{"idCompany":"co0071509","name":"Columbia Pictures"},{"idCompany":"co0218910","name":"Horizon Pictures"}],"keywords":{"keywords":["russia","czar","czarina","rasputin","peasant","execution","epic","siberia","parliament","duma","russian revolution","russian princess","letter","imperial family","world war one","russian history","mother daughter relationship","czarina alexandra of russia","reference to the madonna","sister sister relationship","mother son relationship","husband wife relationship","father son relationship","father daughter relationship","family relationships","brother sister relationship","winter palace","ural mountains","train","soviet","sleigh","sled","serf","secret police","russo japanese war","russian orthodox","red army","pamphlet","opera","mutiny","monk","log cabin","letter from home","hemophilia","flute","feudalism","feudal system","exile","emigre","crimea","cossack","civil war","bolshevism","ballet","aristocrat","aristocracy","ambassador","abdication","edwardian era","10 days in october","deep focus","czar nicholas ii of russia","1910s","independent film","based on book","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:25:29"}}