{"data":{"movies":[{"title":"The Ipcress File","originalTitle":"","year":"1965","releaseDate":"19650802","directors":[{"name":"Sidney J. Furie","id":"nm0002089"}],"writers":[{"name":"W.H. Canaway","id":"nm0133627"},{"name":"James Doran","id":"nm0233375"}],"runtime":"109 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxODU3MzUyNV5BMl5BanBnXkFtZTcwNjA5NDQzMQ@@._V1.jpg","countries":["UK"],"languages":["English","Albanian"],"genres":["Thriller"],"plot":"A number of leading Western scientists have been kidnapped only to reappear a fews days later. Unfortunately, each scientist has been brainwashed and is now completely useless. The British send their agent, Harry Palmer, to investigate. Palmer is surprised to be selected for such a mission (considering his past) and believes he has been chosen because he is expendable.","simplePlot":"In London, a counter espionage agent deals with his own bureaucracy while investigating the kidnapping and brainwashing of British scientists.","actors":[{"actorName":"Michael Caine","urlProfile":"http://www.imdb.com/name/nm0000323","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzIwNTQ4Ml5BMl5BanBnXkFtZTYwMzE1MTUz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1933","placeOfBirth":" Rotherhithe, London, England, UK","birthName":"Maurice Joseph Micklewhite","height":"6' 1\" (1.85 m)","bio":"Michael Caine was born Maurice Joseph Micklewhite in London, to Ellen Frances Marie (Burchell), a charlady, and Maurice Joseph Micklewhite, a fish-market porter. He left school at 15 and took a series of working-class jobs before joining the British army and serving in Korea during the Korean War, where he saw combat. Upon his return to England he gravitated toward the theater and got a job as an assistant stage manager. He adopted the name of Caine on the advice of his agent, taking it from a marquee that advertised The Caine Mutiny (1954). In the years that followed he worked in more than 100 television dramas, with repertory companies throughout England and eventually in the stage hit, \"The Long and the Short and the Tall.\" Zulu (1964), the 1964 epic retelling of a historic 19th-century battle in South Africa between British soldiers and Zulu warriors, brought Caine to international attention. Instead of being typecast as a low-ranking Cockney soldier, he played a snobbish, aristocratic officer. Although \"Zulu\" was a major success, it was the role of Harry Palmer in The Ipcress File (1965) and the title role in Alfie (1966) that made Caine a star of the first magnitude. He epitomized the new breed of actor in mid-'60s England, the working-class bloke with glasses and a down-home accent. However, after initially starring in some excellent films, particularly in the 1960s, including Gambit (1966), Funeral in Berlin (1966), Play Dirty (1969), Battle of Britain (1969), Too Late the Hero (1970), The Last Valley (1971) and especially Get Carter (1971), he seemed to take on roles in below-average films, simply for the money he could by then command. There were some gems amongst the dross, however. He gave a magnificent performance opposite Sean Connery in The Man Who Would Be King (1975) and turned in a solid one as a German colonel in The Eagle Has Landed (1976). Educating Rita (1983) and Hannah and Her Sisters (1986) (for which he won his first Oscar) were highlights of the 1980s, while more recently Little Voice (1998), The Cider House Rules (1999) (his second Oscar) and Last Orders (2001) have been widely acclaimed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzIwNTQ4Ml5BMl5BanBnXkFtZTYwMzE1MTUz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000323","name":"Michael Caine","idIMDB":"nm0000323"},"actorId":"nm0000323","character":"Harry Palmer","urlCharacter":"http://www.imdb.com/character/ch0021349","main":true},{"actorName":"Nigel Green","urlProfile":"http://www.imdb.com/name/nm0338210","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMDEyMDkzNzVeQTJeQWpwZ15BbWU4MDIxMTYyMDIx._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1924","placeOfBirth":" Pretoria, South Africa","height":"6' 4\" (1.93 m)","bio":"The character actor Nigel Green, born in Pretoria, South Africa, in 1924, was educated in England and studied chemical engineering before winning a scholarship to the Royal Academy of Dramatic Art in London. By age 24, he was appearing on stage at both the Old Vic and Stratford-on-Avon, and in the early 1950s, he made his film and television debuts. In 1956, he received serious injuries in an accident, but he fully recovered and established himself as a familiar figure in British film and television. His forceful, dominant manner inevitably led Green to military and authoritarian roles throughout his career while his tall, muscular physique was appropriate for playing such characters as Fertog \"The Bear\" in the television series William Tell (1958), Little John in Sword of Sherwood Forest (1960), and Hercules in Jason and the Argonauts (1963). Green had a number of small film roles in the early 1960s until his appearance in the critically acclaimed Zulu (1964), after which his film roles improved. Perhaps his best-known performance is that of Michael Caine 's superior in the stylish spy film The Ipcress File (1965). In addition to a few British horror films, such as The Skull (1965), The Face of Fu Manchu (1965), and Countess Dracula (1971), Green also appeared in a number of Hollywood films, including Tobruk (1967), The Wrecking Crew (1968) and The Kremlin Letter (1970). Green's later films brought him international recognition and a chance at stardom; however, his career was brought to an abrupt end by his sudden death in 1972 at age 47 from an accidental overdose of sleeping pills.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMDEyMDkzNzVeQTJeQWpwZ15BbWU4MDIxMTYyMDIx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0338210","name":"Nigel Green","idIMDB":"nm0338210"},"actorId":"nm0338210","character":"Major Dalby","urlCharacter":"http://www.imdb.com/character/ch0021352","main":true},{"actorName":"Guy Doleman","urlProfile":"http://www.imdb.com/name/nm0230934","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NjYwODEyMl5BMl5BanBnXkFtZTgwNzAxNjIwMjE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1923","placeOfBirth":" Hamilton, New Zealand","bio":"Tough-looking New Zealander, with a long string of credits as an actor in Australian films and theatre. He was also prolific on radio as actor, announcer and compère. In August 1952, Doleman won a £300 prize for his performance in an Actor's Choice half-hourly play, entitled \"The Coward\". He used this as a travelling fund for a trip to Hollywood and was duly cast in a supporting role in the adventure film His Majesty O'Keefe (1954). That was followed by an uncredited bit in Alfred Hitchcock's Dial M for Murder (1954). More substantial roles, however, failed to materialise. Doleman consequently returned to Australia, where he found regular work on radio and on stage in Sydney, Melbourne and Adelaide, between 1957 and 1960. Doleman had his best spell in Britain in the 1960's: fondly remembered as SPECTRE operative Count Lippe in the James Bond movie Thunderball (1965), and as the hard-edged spook Colonel Ross in the Harry Palmer trilogy, beginning with The Ipcress File (1965). In a similar vein, he also made a worthy antagonist for Patrick McGoohan as the first 'Number 2' in The Prisoner (1967). Doleman eventually settled in Los Angeles, where he died of lung cancer in January 1996.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NjYwODEyMl5BMl5BanBnXkFtZTgwNzAxNjIwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0230934","name":"Guy Doleman","idIMDB":"nm0230934"},"actorId":"nm0230934","character":"Colonel H.L. Ross","urlCharacter":"http://www.imdb.com/character/ch0021354","main":true},{"actorName":"Sue Lloyd","urlProfile":"http://www.imdb.com/name/nm0516145","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDEyMDU1OTI2NF5BMl5BanBnXkFtZTgwNTAxNjIwMjE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1939","placeOfBirth":" Aldeburgh, Suffolk, England, UK","birthName":"Susan Margery Jeaffreson Lloyd","height":"5' 8\" (1.73 m)","bio":"Born in 1939, British actress Sue Lloyd trained in dance as a child, studying at the Sadler's Wells School at age 11. Since her height (5' 8\") decreased her chances of a ballet career, the statuesque Sue instead became a chorus girl and showgirl. After some modeling assignments, she broke into television in the early 60s (The Saint (1962) and The Avengers (1961)), which, in turn, propelled her into a spy series (The Baron (1966)) and other espionage tales on film, notably The Ipcress File (1965) starring Michael Caine as Harry Palmer, No. 1 of the Secret Service (1977) and the comedy spoof Revenge of the Pink Panther (1978). She even played a sexy secret agent in a stage version of \"The Avengers\", playing Hannah Wild, John Steed's partner. For the next decade or so Sue alternated between film and TV assignments, not really making much of a dent anywhere but providing nice set decoration. After co-starring in a couple of Joan Collins vehicles, The Stud (1978) and The Bitch (1979), her career pretty much fell away. In 1991 she married actor Ronald Allen but he died shortly after of cancer. Glimpsed here and there, she came full circle in film intrigue by making a cameo appearance in Bullet to Beijing (1995), which again starred Michael Caine as private eye Harry Palmer. Sue wrote her own biography \"It Seemed Like a Good Idea at the Time\" in 1998.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDEyMDU1OTI2NF5BMl5BanBnXkFtZTgwNTAxNjIwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0516145","name":"Sue Lloyd","idIMDB":"nm0516145"},"actorId":"nm0516145","character":"Jean Courtney","urlCharacter":"http://www.imdb.com/character/ch0274287","main":true},{"actorName":"Gordon Jackson","urlProfile":"http://www.imdb.com/name/nm0413561","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg1NDA3NjgyNV5BMl5BanBnXkFtZTcwMTAzNzQwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 December 1923","placeOfBirth":" Glasgow, Scotland, UK","birthName":"Gordon Cameron Jackson","height":"5' 8\" (1.73 m)","bio":"Gordon Cameron Jackson was born on December 19, 1923, in Glasgow, Scotland, the youngest of five children, whose father taught painting in the city. His interest in acting began during his school years, when he took part in many amateur productions. This led to him being spotted by the BBC, and that led to work in such radio shows such as \"Children's Hour\" followed. However, by age 15 he left school and went to work for Rolls-Royce. However, when some film producers were looking for a young Scot for a role in The Foreman Went to France (1942), \"The Beeb\" hadn't forgotten Gordon (even if he had forgotten them) and recommended him. His abilities as an actor really came to the forefront at age 20 with his appearance as an airman in Millions Like Us (1943). Although his roles were limited by his Scottish accent, his versatility won him many film and TV roles in a career spanning almost 50 years. He was a very prolific actor and, although not always starring in high-profile films, he was rarely out of work. His early career also included work in radio and repertory theater in Glasgow, Worthing and Perth. He made his London stage debut in 1951, in the long-running farce \"Seagulls Over Sorrento\". Later stage roles included Horatio in \"Hamlet\", Banquo in \"Macbeth\", Ishmael in \"Moby Dick\" directed by Orson Welles and a range of other parts both classical and modern. In 1949 he starred in the film Floodtide (1949) alongside Rona Anderson, whom he married two years later. The couple had two children, Graham and Roddy. His film work remained steady throughout the 1950s and 1960s. In 1969 he played Horatio in Tony Richardson's production of \"Hamlet\" at the Round House, and won the Clarence Derwent Award for Best Supporting Actor. However, the public didn't really \"discover\" him until 1971 with London Weekend Television's classic Upstairs, Downstairs (1971). This series set in the 1910s and 1920s concerned the contrast between the lives of a wealthy family (upstairs) and their servants (downstairs). He played the \"middleman\" butler, Hudson. The series lasted five years and aired in dozens of countries worldwide, and was particularly popular in the US. In 1974 he was awarded British Actor of the Year award and a Supporting Actor Emmy in 1975 for \"Upstairs, Downstair\". In 1977 came the long-running The Professionals (1977), an action-based crime series in which he played the tough, ruthless, wily head of a government agency called Criminal Intelligence (essentially a cross between MI6, Special Branch and the SAS). This was a complete (if temporary) change of direction for his career and he appeared to relish the challenge of playing an entirely different role. Despite the controversial depiction of violence, the series was hugely successful all over the world (except America, as the TV network executives there felt it too violent). Reportedly the British royal family were fans of the series, and in 1979 he was awarded OBE (Officer of the Order of the British Empire) for his services to drama. Shortly after completion of the series in 1981, he appeared in the Australian mini-series A Town Like Alice (1981).. He won Australia's Logie award for this role. Yet despite his success, he claimed that he did not enjoy his own performances and never watched himself on screen, stating that he never felt very confident or comfortable in front of the camera or on stage. Throughout the remainder of the 1980s he generally took small roles in TV and film projects. Tragically his career was cut short when, in 1989, it was discovered he had irreversible bone cancer. He passed away on 14 January 1990 at the Cromwell Hospital in South Kensington, London.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg1NDA3NjgyNV5BMl5BanBnXkFtZTcwMTAzNzQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0413561","name":"Gordon Jackson","idIMDB":"nm0413561"},"actorId":"nm0413561","character":"Jock Carswell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aubrey Richards","urlProfile":"http://www.imdb.com/name/nm0723964","urlPhoto":"","biography":{"dateOfBirth":"6 June 1920","placeOfBirth":" Swansea, Wales, UK","birthName":"John Aubrey Richards","bio":"Aubrey Richards was born on June 6, 1920 in Swansea, Wales as John Aubrey Richards. He was an actor, known for The Ipcress File (1965), It! (1967) and Savage Messiah (1972). He was married to Diana Boddington. He died on May 29, 2000 in Chipping Barnet, Hertfordshire, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0723964","name":"Aubrey Richards","idIMDB":"nm0723964"},"actorId":"nm0723964","character":"Dr. Radcliffe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Gatliff","urlProfile":"http://www.imdb.com/name/nm0309698","urlPhoto":"","biography":{"dateOfBirth":"31 December 1927","placeOfBirth":" Melbourne, Victoria, Australia","bio":"Frank Gatliff was born on December 31, 1927 in Melbourne, Victoria, Australia. He was an actor, known for The Ipcress File (1965), C.A.B. (1986) and Hark at Barker (1969). He died on June 23, 1990 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0309698","name":"Frank Gatliff","idIMDB":"nm0309698"},"actorId":"nm0309698","character":"Bluejay","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas Baptiste","urlProfile":"http://www.imdb.com/name/nm0052675","urlPhoto":"","biography":{"dateOfBirth":"1936","placeOfBirth":" Georgetown, British Guiana","bio":"Thomas Baptiste was born in 1936 in Georgetown, British Guiana. He is an actor, known for The Ipcress File (1965), Sunday Bloody Sunday (1971) and Amin: The Rise and Fall (1981).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0052675","name":"Thomas Baptiste","idIMDB":"nm0052675"},"actorId":"nm0052675","character":"Barney - American Agent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Oliver MacGreevy","urlProfile":"http://www.imdb.com/name/nm0532301","urlPhoto":"","biography":{"dateOfBirth":"3 August 1928","placeOfBirth":" Dublin, Ireland","height":"6' 2\" (1.88 m)","bio":"Oliver MacGreevy was born on August 3, 1928 in Dublin, Ireland. He is an actor, known for The Ipcress File (1965), Flash Gordon (1980) and The Ruling Class (1972).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0532301","name":"Oliver MacGreevy","idIMDB":"nm0532301"},"actorId":"nm0532301","character":"Housemartin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Freda Bamford","urlProfile":"http://www.imdb.com/name/nm0051464","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTQyYWEyOGUtYjBhNC00YjhhLTkzZTctMDM5NjgyNjBkODM0XkEyXkFqcGdeQXVyMjIxMzMyMQ@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 February 1909","placeOfBirth":" Ashford, Middlesex, England, UK","birthName":"Freda Maud Mary Bamford","bio":"Freda Bamford was born on February 11, 1909 in Ashford, Middlesex, England as Freda Maud Mary Bamford. She was an actress, known for The Ipcress File (1965), The Snow Goose (1971) and Heights of Danger (1953). She was married to Ian Atkins. She died on May 15, 1986 in Torbay, Devon, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTQyYWEyOGUtYjBhNC00YjhhLTkzZTctMDM5NjgyNjBkODM0XkEyXkFqcGdeQXVyMjIxMzMyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0051464","name":"Freda Bamford","idIMDB":"nm0051464"},"actorId":"nm0051464","character":"Alice","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pauline Winter","urlProfile":"http://www.imdb.com/name/nm0935812","urlPhoto":"","biography":{"dateOfBirth":"1917","placeOfBirth":" Richmond, Surrey, England, UK","birthName":"Pauline Audrey Winter","height":"5' 5\" (1.65 m)","bio":"Pauline Winter was born in 1917 in Richmond, Surrey, England as Pauline Audrey Winter. She was an actress, known for The Ipcress File (1965), I'm All Right Jack (1959) and Away in a Manger (1954). She was married to Philip Dale. She died on February 9, 2015 in England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0935812","name":"Pauline Winter","idIMDB":"nm0935812"},"actorId":"nm0935812","character":"Charlady","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anthony Blackshaw","urlProfile":"http://www.imdb.com/name/nm0085831","urlPhoto":"","biography":{"dateOfBirth":"23 September 1929","placeOfBirth":" London, England, UK","birthName":"Anthony Thomas Blackshaw","height":"6' (1.83 m)","bio":"Anthony Blackshaw was born on September 23, 1929 in London, England as Anthony Thomas Blackshaw. He was an actor, known for The Ipcress File (1965), The Evil of Frankenstein (1964) and The Fiction-Makers (1968). He died on June 16, 1995.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0085831","name":"Anthony Blackshaw","idIMDB":"nm0085831"},"actorId":"nm0085831","character":"Edwards","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barry Raymond","urlProfile":"http://www.imdb.com/name/nm0713207","urlPhoto":"","biography":{"bio":"Barry Raymond is an actor, known for The Ipcress File (1965), Who, Me? (1959) and No Hiding Place (1959).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0713207","name":"Barry Raymond","idIMDB":"nm0713207"},"actorId":"nm0713207","character":"Gray","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Glover","urlProfile":"http://www.imdb.com/name/nm0323109","urlPhoto":"","biography":{"dateOfBirth":"24 September 1927","placeOfBirth":" London, England, UK","bio":"David Glover was born on September 24, 1927 in London, England. He was an actor, known for Conspiracy (2001), The Ipcress File (1965) and Edward II (1991). He died on February 16, 2015 in London.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0323109","name":"David Glover","idIMDB":"nm0323109"},"actorId":"nm0323109","character":"Chilcott-Oakes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stanley Meadows","urlProfile":"http://www.imdb.com/name/nm0575080","urlPhoto":"","biography":{"dateOfBirth":"14 July 1931","placeOfBirth":" Stepney, London, England, UK","birthName":"Stanley Meadows","bio":"Stanley Meadows was born on July 14, 1931 in Stepney, London, England. He is an actor, known for The Ipcress File (1965), Performance (1970) and The Mummy (1959).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0575080","name":"Stanley Meadows","idIMDB":"nm0575080"},"actorId":"nm0575080","character":"Inspector Pat Keightley","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0059319","urlIMDB":"http://www.imdb.com/title/tt0059319","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"© COPYRIGHT MCMLXV STEVEN S.A. ALL RIGHTS RESERVED (on print)"},"technical":{"runtime":["1 hr 49 min (109 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Technicolor, London, UK"],"filmLength":["2,980 m (1966) (Finland)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Techniscope"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"7.3","filmingLocations":[{"location":"Kennington Park, Oval, London, England, UK"}],"rated":"APPROVED","awards":[{"award":"BAFTA Awards 1966","titlesAwards":[{"titleAwardOutcome":"Won BAFTA Film Award","categories":[{"category":"Best British Art Direction (Colour)","names":[{"name":"Ken Adam","id":"nm0010553","role":null}]},{"category":"Best British Cinematography (Colour)","names":[{"name":"Otto Heller","id":"nm0005740","role":null}]},{"category":"Best British Film","names":[{"name":"Sidney J. Furie","id":"nm0002089","role":null}]}]},{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best British Actor","names":[{"name":"Michael Caine","id":"nm0000323","role":null}]},{"category":"Best British Screenplay","names":[{"name":"W.H. Canaway","id":"nm0133627","role":null},{"name":"James Doran","id":"nm0233375","role":null}]}]}]},{"award":"Cannes Film Festival 1965","titlesAwards":[{"titleAwardOutcome":"Nominated Palme d'Or","categories":[{"category":"","names":[{"name":"Sidney J. Furie","id":"nm0002089","role":null}]}]}]},{"award":"Directors Guild of America, USA 1966","titlesAwards":[{"titleAwardOutcome":"Nominated DGA Award","categories":[{"category":"Outstanding Directorial Achievement in Motion Pictures","names":[{"name":"Sidney J. Furie","id":"nm0002089","role":null}]}]}]},{"award":"Edgar Allan Poe Awards 1966","titlesAwards":[{"titleAwardOutcome":"Won Edgar","categories":[{"category":"Best Foreign Film","names":[{"name":"W.H. Canaway","id":"nm0133627","role":null},{"name":"James Doran","id":"nm0233375","role":null}]}]}]},{"award":"Laurel Awards 1966","titlesAwards":[{"titleAwardOutcome":"Won Golden Laurel","categories":[{"category":"Sleeper of the Year","names":[]}]}]}],"votes":"10,816","type":"Movie","companyCreditsSimple":[{"idCompany":"co0021421","name":"Rank Organisation, The"},{"idCompany":"co0103357","name":"Lowndes Productions Limited"},{"idCompany":"co0078735","name":"Steven S.A."}],"keywords":{"keywords":["brainwashing","scientist","british","kidnapping","cia","bureaucracy","espionage","major","sergeant","cia agent","spectacles","man wearing glasses","hero","railway station","fistfight","political thriller","mind control","mistaken identity","revelation","punched in the chest","character's point of view camera shot","subjective camera","passport","alarm clock","taxi","ambush","prison guard","jail cell","montage","professor","shootout","parking garage","suitcase full of money","martial arts","beating","framed for murder","frame up","home invasion","letter","abandoned factory","egg","camera","photograph","apartment","escape","interrogation","hostage","falling down stairs","brawl","fight","punched in the face","conspiracy","blackmail","undercover agent","undercover","spiral staircase","neo noir","police","scotland yard","phone booth","bowler hat","cigarette smoking","held at gunpoint","microfilm","female agent","female spy","implied sex","cooking","premarital sex","scottish accent","dutch angle","deception","betrayal","black comedy","london england","nelson's column london","trafalgar square london","royal albert hall","shot in the chest","self mutilation","shot in the head","shot through a window","shot to death","death","murder","corpse","impostor","machine gun","blood on hand","suspense","revolver","pistol","armorer","colonel","ex soldier","bodyguard","british secret service","government agent","cult film","1960s","first of series","albania","cockney accent","train","torture","supermarket","prison cell","pipe smoking","parking meter","marching band","library","intrigue","hallucination","dead body","brass band","attic","secret agent","deep focus","double agent","spy","stabbed in the hand","cold war","shot in the forehead","death of friend","based on novel","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:03:56"}}