{"data":{"movies":[{"title":"Remember the Night","originalTitle":"","year":"1940","releaseDate":"19400119","directors":[{"name":"Mitchell Leisen","id":"nm0500552"}],"writers":[{"name":"Preston Sturges","id":"nm0002545"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjg3NjU2MWItOTc2Ny00MjUyLTgwMTctMTQ3MzQxZDk4NTA4XkEyXkFqcGdeQXVyMjUxODE0MDY@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Romance"],"plot":"Just before Christmas, Lee Leander is caught shoplifting. It is her third offense. She is prosecuted by John Sargent. He postpones the trial because it is hard to get a conviction at Christmas time. But he feels sorry for her and arranges for her bail, and ends up taking her home to his mother for Christmas. Surrounded by a loving family (in stark contrast to Lee's own family background) they fall in love. This creates a new problem: how do they handle the upcoming trial?","simplePlot":"A shoplifter and her prosecuter fall in love, creating tensions in their family lives.","actors":[{"actorName":"Barbara Stanwyck","urlProfile":"http://www.imdb.com/name/nm0001766","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjMxODIzODEzNF5BMl5BanBnXkFtZTYwNDgwNjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1907","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Ruby Catherine Stevens","height":"5' 5\" (1.65 m)","bio":"Today Barbara Stanwyck is remembered primarily as the matriarch of the family known as the Barkleys on the TV western The Big Valley (1965), wherein she played Victoria, and from the hit drama The Colbys (1985). But she was known to millions of other fans for her movie career, which spanned the period from 1927 until 1964, after which she appeared on television until 1986. It was a career that lasted for 59 years. Barbara Stanwyck was born Ruby Catherine Stevens on July 16, 1907, in Brooklyn, New York, to working class parents Catherine Ann (McPhee) and Byron E. Stevens. Her father, from Massachusetts, had English ancestry, and her Canadian mother, from Nova Scotia, was of Scottish and Irish descent. Stanwyck went to work at the local telephone company for fourteen dollars a week, but she had the urge (a dream--that was all it was) somehow to enter show business. When not working, she pounded the pavement in search of dancing jobs. The persistence paid off. Barbara was hired as a chorus girl for the princely sum of $40 a week, much better than the wages she was getting from the phone company. She was seventeen, and was going to make the most of the opportunity that had been given her. In 1928 Barbara moved to Hollywood, where she was to start one of the most lucrative careers filmdom had ever seen. She was an extremely versatile actress who could adapt to any role. Barbara was equally at home in all genres, from melodramas, such as Forbidden (1932) and Stella Dallas (1937), to thrillers, such as Double Indemnity (1944), one of her best films, also starring Fred MacMurray (as you have never seen him before). She also excelled in comedies such as Remember the Night (1940) and The Lady Eve (1941). Another genre she excelled in was westerns, Union Pacific (1939) being one of her first and TV's The Big Valley (1965) (her most memorable role) being her last. In 1983, she played in the ABC hit mini-series The Thorn Birds (1983), which did much to keep her in the eye of the public. She turned in an outstanding performance as Mary Carson. Barbara was considered a gem to work with for her serious but easygoing attitude on the set. She worked hard at being an actress, and she never allowed her star quality to go to her head. She was nominated for four Academy Awards, though she never won. She turned in magnificent performances for all the roles she was nominated for, but the \"powers that be\" always awarded the Oscar to someone else. However, in 1982 she was awarded an honorary Academy Award for \"superlative creativity and unique contribution to the art of screen acting.\" Sadly, Barbara died on January 20, 1990, leaving 93 movies and a host of TV appearances as her legacy to us.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjMxODIzODEzNF5BMl5BanBnXkFtZTYwNDgwNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001766","name":"Barbara Stanwyck","nicknames":["Missy","The Queen","Babs"],"idIMDB":"nm0001766"},"actorId":"nm0001766","character":"Lee Leander","urlCharacter":"http://www.imdb.com/character/ch0493982","main":true},{"actorName":"Fred MacMurray","urlProfile":"http://www.imdb.com/name/nm0534045","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMTIyODQ4Nl5BMl5BanBnXkFtZTYwOTk1MTI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 August 1908","placeOfBirth":" Kankakee, Illinois, USA","birthName":"Fredrick Martin MacMurray","height":"6' 3\" (1.91 m)","bio":"Fred MacMurray was likely the most underrated actor of his generation. True, his earliest work is mostly dismissed as pedestrian, but no other actor working in the 1940s and 50s was able to score so supremely whenever cast against type. Frederick Martin MacMurray was born in Kankakee, Illinois, to Maleta Martin and Frederick MacMurray. His father had Scottish ancestry and his mother's family was German. His father's sister was vaudeville performer and actress Fay Holderness. When MacMurray was five years old, the family moved to Beaver Dam in Wisconsin, his parents' birth state. He graduated from Beaver Dam High School (later the site of Beaver Dam Middle School), where he was a three-sport star in football, baseball, and basketball. Fred retained a special place in his heart for his small-town Wisconsin upbringing, referring at any opportunity in magazine articles or interviews to the lifelong friends and cherished memories of Beaver Dam, even including mementos of his childhood in several of his films. In \"Pardon my Past\", Fred and fellow GI William Demarest are moving to Beaver Dam, WI to start a mink farm. MacMurray earned a full scholarship to attend Carroll College in Waukesha, Wisconsin and had ambitions to become a musician. In college, MacMurray participated in numerous local bands, playing the saxophone. In 1930, he played saxophone in the Gus Arnheim and his Coconut Grove Orchestra when Bing Crosby was the lead vocalist and Russ Columbo was in the violin section. MacMurray recorded a vocal with Arnheim's orchestra \"All I Want Is Just One Girl\" -- Victor 22384, 3/20/30. He appeared on Broadway in the 1930 hit production of \"Three's a Crowd\" starring Sydney Greenstreet, Clifton Webb and Libby Holman. He next worked alongside Bob Hope in the 1933 production of \"Roberta\" before he signed on with Paramount Pictures in 1934 for the then-standard 7-year contract (the hit show made Bob Hope a star and he was also signed by Paramount). MacMurray married Lillian Lamont (D: June 22, 1953) on June 20, 1936, and they adopted two children. Although his early film work is largely overlooked by film historians and critics today, he rose steadily within the ranks of Paramount's contract stars, working with some of Hollywood's greatest talents, including wunderkind writer-director Preston Sturges (whom he intensely disliked) and actors Humphrey Bogart and Marlene Dietrich. Although the majority of his films of the 30's can largely be dismissed as standard fare there are exceptions: he played opposite Claudette Colbert in seven films, beginning with The Gilded Lily (1935). He also co-starred with Katharine Hepburn in the classic, Alice Adams (1935), and with Carole Lombard in Hands Across the Table (1935), The Trail of the Lonesome Pine (1936) -- an ambitious early outdoor 3-strip Technicolor hit, co-starring with Henry Fonda and Sylvia Sidney directed by Henry Hathaway -- The Princess Comes Across (1936), and True Confession (1937). MacMurray spent the decade learning his craft and developing a reputation as a solid actor. In an interesting sidebar, artist C.C. Beck used MacMurray as the initial model for a superhero character who would become Fawcett Comics' Captain Marvel in 1939. The 1940s gave him his chance to shine. He proved himself in melodramas such as Above Suspicion (1943) and musicals (Where Do We Go from Here? (1945)), somewhat ironically becoming one of Hollywood's highest-paid actors by 1943, when his salary reached $420,000. He scored a huge hit with the thoroughly entertaining The Egg and I (1947), again teamed with Ms. Colbert and today largely remembered for launching the long-running Ma and Pa Kettle franchise. In 1941, MacMurray purchased a large parcel of land in Sonoma County, California and began a winery/cattle ranch. He raised his family on the ranch and it became the home to his second wife, June Haver after their marriage in 1954. The winery remains in operation today in the capable hands of their daughter, Kate MacMurray. Despite being habitually typecast as a \"nice guy\", MacMurray often said that his best roles were when he was cast against type by Billy Wilder. In 1944, he played the role of \"Walter Neff\", an insurance salesman (numerous other actors had turned the role down) who plots with a greedy wife Barbara Stanwyck to murder her husband in Double Indemnity (1944) -- inarguably the greatest role of his entire career. Indeed, anyone today having any doubts as to his potential depth as an actor should watch this film. He did another stellar turn in the \"not so nice\" category, playing the cynical, spineless \"Lieutenant Thomas Keefer\" in the 1954 production of The Caine Mutiny (1954), directed by Edward Dmytryk. He gave another superb dramatic performance cast against type as a hard-boiled crooked cop in Pushover (1954). Despite these and other successes, his career waned considerably by the late 1950s and he finished out the decade working in a handful of non-descript westerns. MacMurray's career got its second wind beginning in 1959 when he was cast as the dog-hating father figure (well, he was a retired mailman) in the first Walt Disney live-action comedy, The Shaggy Dog (1959). The film was an enormous hit and Uncle Walt green lighted several projects around his middle-aged star. Billy Wilder came calling again and he did a masterful turn in the role of Jeff Sheldrake, a two-timing corporate executive in Wilder's Oscar-winning comedy-drama The Apartment (1960), with Shirley MacLaine and Jack Lemmon -- arguably his second greatest role and the last one to really challenge him as an actor. Although this role would ultimately be remembered as his last great performance, he continued with the lightweight Disney comedies while pulling double duty, thanks to an exceptionally generous contract, on TV. MacMurray was cast in 1961 as Professor Ned Brainerd in Disney's The Absent Minded Professor (1961) and in its superior sequel, Son of Flubber (1963). These hit Disney comedies raised his late-career profile considerably and producer Don Fedderson beckoned with My Three Sons (1960) debuting in 1960 on ABC. The gentle sitcom staple remained on the air for 12 seasons (380 episodes). Concerned about his work load and time away from his ranch and family, Fred played hardball with his series contract. In addition to his generous salary, the \"Sons\" contract was written so that all the scenes requiring his presence to be shot first, requiring him to work only 65 days per season on the show (the contract was reportedly used as an example by Dean Martin when negotiating the wildly generous terms contained in his later variety show contract). This requirement meant the series actors had to work with stand-ins and posed wardrobe continuity issues. The series moved without a hitch to CBS in the fall of 1965 in color after ABC, then still an also-ran network with its eyes peeled on the bottom line, refused to increase the budget required for color production (color became a U.S. industry standard in the 1968 season). This freed him to pursue his film work, family, ranch, and his principal hobby, golf. Politically very conservative, MacMurray was a staunch supporter of the Republican Party; he joined his old friend Bob Hope and James Stewart in campaigning for Richard Nixon in 1968. He was also widely known one of the most -- to be polite -- frugal actors in the business. Stories floated around the industry in the 60s regarding famous hard-boiled egg brown bag lunches and stingy tips. After the cancellation of My Three Sons in 1972, MacMurray made only a few more film appearances before retiring to his ranch in 1978. As a result of a long battle with leukemia, MacMurray died of pneumonia at the age of eighty-three in Santa Monica on November 5, 1991. He was buried in the Holy Cross Cemetery in Culver City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMTIyODQ4Nl5BMl5BanBnXkFtZTYwOTk1MTI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0534045","name":"Fred MacMurray","nicknames":["Bud"],"idIMDB":"nm0534045"},"actorId":"nm0534045","character":"John Sargent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Beulah Bondi","urlProfile":"http://www.imdb.com/name/nm0094135","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyODAzNTIyOF5BMl5BanBnXkFtZTcwMzEwNjk5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1889","placeOfBirth":" Chicago, Illinois, USA","birthName":"Beulah Bondy","height":"5' 5\" (1.65 m)","bio":"Character actress Beulah Bondi was a favorite of directors and audiences and is one of the reasons so many films from the 1930s and 1940s remain so enjoyable, as she was an integral part of many of the ensemble casts (a hallmark of the studio system) of major and/or great films, including The Trail of the Lonesome Pine (1936), Mr. Smith Goes to Washington (1939), Our Town (1940) and Penny Serenade (1941). Highly respected as a first-tier character actress, Bondi won two Best Supporting Actress Oscar nominations, for The Gorgeous Hussy (1936) and Of Human Hearts (1938), and an Emmy Award in 1976 for her turn in the television program The Waltons (1971). She was born Beulah Bondy on May 3, 1888, in Chicago, and established herself as a stage actress in the first phase of her career. She made her Broadway debut in Kenneth S. Webb's \"One of the Family\" at the 49th Street Theatre on December 21, 1925. The show was a modest hit, racking up 238 performances. She next appeared in another hit, Maxwell Anderson's \"Saturday's Children,\" which ran for 326 performances, before appearing in her first flop, Clemence Dane's \"Mariners\" in 1927. Philip Barry's and Elmer Rice's \"Cock Robin\" was an extremely modest hit in 1928, reaching the century mark (100 performances), but it was Bondi's performance in Rice's \"Street Scene,\" which opened at the Playhouse Theatre on Jamuary 10, 1929, that made her career. This famous play won Rice the 1929 Pulitzer Prize for Drama and was a big hit, playing for 601 performances. Most importantly, though, it brought Bondi to the movies at the advanced age of 43. She made her motion picture debut in 1931 in the movie adaptation (Street Scene (1931)), recreating the role she had originated on the Broadway stage. The talkies were still new, and she had the talent and the voice to thrive in Hollywood. Bondi appeared in four more Broadway plays from 1931 to 1934, only one of which, \"The Late Christopher Bean\", a comedy by Sidney Howard, was a hit. Her last appearance on Broadway for a generation was in a flop staged by Melvyn Douglas, \"Mother Lode\" (she made two more appearances on the Great White Way, in \"Hilda Crane\" (1950) and \"On Borrowed Time\" in 1953; neither was a success). For the rest of her professional life, her career lay primarily in film and television. She was typecast as mothers and, later, grandmothers, and played James Stewart's mother four times, most famously as \"Ma Bailey\" in It's a Wonderful Life (1946). Her greatest role is considered her turn in Leo McCarey's Depression-era melodrama Make Way for Tomorrow (1937), in which she played a mother abandoned by her children. Beulah Bondi died on January 1, 1981, from complications from an accident, when she broke her ribs after falling over her cat. She was 92 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyODAzNTIyOF5BMl5BanBnXkFtZTcwMzEwNjk5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0094135","name":"Beulah Bondi","idIMDB":"nm0094135"},"actorId":"nm0094135","character":"Mrs. Sargent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elizabeth Patterson","urlProfile":"http://www.imdb.com/name/nm0666201","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM5MTM4ZTYtNDI2OS00NGQ2LThjMjEtYzMwOTQwMWNiZjM1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1875","placeOfBirth":" Savannah, Tennessee, USA","birthName":"Mary Elizabeth Patterson","height":"5' 2½\" (1.59 m)","bio":"A dainty but nevertheless feisty character actress, southern-bred Elizabeth Patterson started her career over her strict parent's objections and became a member of Chicago's Ben Greet Players, performing Shakespeare at the turn of the century. This followed college at Martin College where she studied music, elocution and English, and post-graduate work at Columbia Institute in Columbia, Tennessee. She eventually traveled in stock tours and moved to Broadway where she was seen throughout the 20s. By the time she moved into films, she was 51 years of age. Known for her drab, careworn, dressed-down appearances, she played small-town relatives, avid gossips, steadfast country women, persnickety town folk and other prickly pear types with great frequency, while adding greatly to the atmosphere of such films as A Bill of Divorcement (1932), Doctor Bull (1933), So Red the Rose (1935), Remember the Night (1940), Tobacco Road (1941), Hail the Conquering Hero (1941), and Out of the Blue (1948). It was in the 50s, however, that she became a familiar household face as Lucille Ball's fragile, elderly neighbor and part-time babysitter, Mrs. Trumbull, on the \"I Love Lucy\" series. Elizabeth died in 1966 of pneumonia at age 90.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM5MTM4ZTYtNDI2OS00NGQ2LThjMjEtYzMwOTQwMWNiZjM1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0666201","name":"Elizabeth Patterson","nicknames":["Patty"],"idIMDB":"nm0666201"},"actorId":"nm0666201","character":"Aunt Emma","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Willard Robertson","urlProfile":"http://www.imdb.com/name/nm0732062","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDI0NGY3YmMtN2VmOC00NTIzLTg1YTItZWY5OTRmNDI2Y2M4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1886","placeOfBirth":" Runnels, Texas, USA","height":"6' 1\" (1.85 m)","bio":"Lawyer who abandoned his profession to take up the actor's calling - although lawyer and actor are essentially kindred spirits, each deriving his livelihood from the art of pretending. Robertson acted in Hollywood films from 1930 until the year he died, typically portraying men of authority such as doctors, elected officials, military officers and - yes - lawyers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDI0NGY3YmMtN2VmOC00NTIzLTg1YTItZWY5OTRmNDI2Y2M4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0732062","name":"Willard Robertson","idIMDB":"nm0732062"},"actorId":"nm0732062","character":"Francis X. O'Leary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sterling Holloway","urlProfile":"http://www.imdb.com/name/nm0001359","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MDIwNzg5MV5BMl5BanBnXkFtZTcwNzU1ODcxOA@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 January 1905","placeOfBirth":" Cedartown, Georgia, USA","birthName":"Sterling Price Holloway Jr.","height":"5' 10½\" (1.79 m)","bio":"Popular American character actor of amusing appearance and voice whose long career led from dozens of highly enjoyable onscreen performances to world-wide familiarity as the voice of numerous Walt Disney animated films. Born in the American Deep South to grocer Sterling P. Holloway Sr. and Rebecca Boothby Holloway, he had a younger brother, Boothby. Holloway spent his early years as an actor playing comic juveniles on the stage. His bushy reddish-blond hair and trademark near-falsetto voice made him a natural for sound pictures, and he acted in scores of talkies, although he had made his picture debut in silents. His physical image and voice relegated him almost exclusively to comic roles, but in 1945, director Lewis Milestone cast him more or less against type in the classic war film A Walk in the Sun (1945), where Holloway's portrayal of a reluctant soldier was quite notable. He played frequently on television, becoming familiar to baby-boomers in a recurring role as Uncle Oscar on Adventures of Superman (1952), and later in television series of his own. His later work as the voice of numerous characters in Disney cartoons brought him new audiences and many fans, especially for his voicing of beloved Winnie the Pooh. He died in 1992.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MDIwNzg5MV5BMl5BanBnXkFtZTcwNzU1ODcxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001359","name":"Sterling Holloway","idIMDB":"nm0001359"},"actorId":"nm0001359","character":"Willie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Waldron","urlProfile":"http://www.imdb.com/name/nm0907289","urlPhoto":"","biography":{"dateOfBirth":"23 December 1874","placeOfBirth":" Waterford, New York, USA","birthName":"Charles Dieudonnee Waldron","bio":"Charles Waldron was born on December 23, 1874 in Waterford, New York, USA as Charles Dieudonnee Waldron. He was an actor, known for The Big Sleep (1946), Stranger on the Third Floor (1940) and Remember the Night (1940). He was married to May King. He died on March 4, 1946 in Hollywood, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0907289","name":"Charles Waldron","idIMDB":"nm0907289"},"actorId":"nm0907289","character":"Judge in New York","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Guilfoyle","urlProfile":"http://www.imdb.com/name/nm0002116","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmU0YjQzZDItYzEyNy00NWFjLWEyNzEtYTkwM2E2MWFlMzhjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 July 1902","placeOfBirth":" Jersey City, New Jersey, USA","bio":"American character actor. Upon his entry into films in 1930, he was typecast as a weakling or criminal type. He received great acclaim for his role as Garth Esdras, the haunted and hunted accessory to murder in Winterset (1936). Memorable as the weaselly convict who tries to kill James Cagney at Steve Cochran's behest, but gets his just deserts in the trunk of a car, in White Heat (1949). After two decades as a film actor, he made a small foray into film directing. He died at 58.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmU0YjQzZDItYzEyNy00NWFjLWEyNzEtYTkwM2E2MWFlMzhjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002116","name":"Paul Guilfoyle","idIMDB":"nm0002116"},"actorId":"nm0002116","character":"District Attorney","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Arnt","urlProfile":"http://www.imdb.com/name/nm0036792","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWZjNTc4OTItZmJlOC00MzkxLWEyYTYtMDAxMjZjMjk3MjdhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 August 1906","placeOfBirth":" Michigan City, Indiana, USA","bio":"Charles Arnt was born on August 20, 1906 in Michigan City, Indiana, USA. He was an actor, known for My Favorite Brunette (1947), Sweet Bird of Youth (1962) and Ball of Fire (1941). He died on August 6, 1990 in Orcas Island, Washington, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWZjNTc4OTItZmJlOC00MzkxLWEyYTYtMDAxMjZjMjk3MjdhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0036792","name":"Charles Arnt","idIMDB":"nm0036792"},"actorId":"nm0036792","character":"Tom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Wray","urlProfile":"http://www.imdb.com/name/nm0942046","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzY3NTI5MF5BMl5BanBnXkFtZTgwMDI3NDQ3MTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1887","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"John Griffith Malloy","height":"5' 8\" (1.73 m)","bio":"John Wray was born on February 13, 1887 in Philadelphia, Pennsylvania, USA as John Griffith Malloy. He was an actor and writer, known for All Quiet on the Western Front (1930), Mr. Deeds Goes to Town (1936) and Doctor X (1932). He was married to Florence Miller. He died on April 5, 1940 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzY3NTI5MF5BMl5BanBnXkFtZTgwMDI3NDQ3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0942046","name":"John Wray","idIMDB":"nm0942046"},"actorId":"nm0942046","character":"Hank","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas W. Ross","urlProfile":"http://www.imdb.com/name/nm0743885","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWE1MmQ3MmUtZDcxZS00NmU3LTgyZDAtMDUyMzFlNGY0ODVmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 January 1875","placeOfBirth":" Boston, Massachusetts, USA","bio":"Thomas W. Ross was born on January 22, 1875 in Boston, Massachusetts, USA. He was an actor, known for Remember the Night (1940), The Fatal Hour (1920) and Checkers (1913). He died on November 14, 1959 in Torrington, Connecticut, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWE1MmQ3MmUtZDcxZS00NmU3LTgyZDAtMDUyMzFlNGY0ODVmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0743885","name":"Thomas W. Ross","idIMDB":"nm0743885"},"actorId":"nm0743885","character":"Mr. Emory","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fred 'Snowflake' Toones","urlProfile":"http://www.imdb.com/name/nm0867560","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGY3YWQ5ZTgtMDFiZS00ODhkLWE5ZmEtNzViNGI4YzdmYTZkXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1906","placeOfBirth":" North Carolina, USA","bio":"Toones is one of the most \"colorful\" character faces in B-Westerns and cliffhangers. He appeared in over 200 films between 1928 and 1951; and during 1936 and 1947, Toones often worked under contract for Republic Pictures, appearing in about 40 of its films. Toones often played a bootblack or shoeshine man in at least six of his movies, and Toones actually ran the shoeshine stand at Republic Studios. Toones first appeared as a porter in 1932 in \"The Hurricane Express\", and was usually typecast as a porter -appearing in over 50 films in such a role. He also played a variety of other service-oriented or domestic worker roles such as stable grooms, janitors, elevator operators, valets, cooks, bellhops, doormen, butlers, and bartenders. Like other actors of the time, i.e. Anna May Wong and Franklin Pangborn, Toones is a prime example of racial and social stereotyping in the Hollywood film industry. His standard characterization was that of a middle-aged \"colored\" man with a high-pitched voice and childlike mannerisms. \"Snowflake\" was the stage name Toones was best known by, and he used this name as his credit as early as his third film, 1931's \"Shanghaied Love\". Likewise, in \"Shanghaied Love\" and over 35 other films, \"Snowflake\" was also Toones' character name. Toones acted in films such as \"Mississippi\"(1935), \"Hawk of the Wilderness\" (1938) and \"Daredevils of the Red Circle\"(1939) with Bruce Bennett and in many \"B\" westerns such as \"The Lawless Nineties\"(1936) with John Wayne. He also appeared in dozens of two-reeler's such as Columbia's \"Woman Haters\" (1934) with the Three Stooges, and had a bit role in Laurel and Hardy's classic feature \"Way Out West\"(1937). Toones is also a familiar face in four Preston Sturges comedies: \"Twentieth Century\"(1934), \"Remember the Night\"(1940),\"Christmas in July\"(1940) and \"The Palm Beach Story\"(1942).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGY3YWQ5ZTgtMDFiZS00ODhkLWE5ZmEtNzViNGI4YzdmYTZkXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0867560","name":"Fred 'Snowflake' Toones","idIMDB":"nm0867560"},"actorId":"nm0867560","character":"Rufus","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Kennedy","urlProfile":"http://www.imdb.com/name/nm0448366","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk0OTk2ZjctNTdiZi00OGZjLWFhYWUtMDgzYjQ0ZWQ2Y2ViL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1885","placeOfBirth":" New York City, New York, USA","height":"6' 2½\" (1.89 m)","bio":"Once a boxer, brawny character actor Tom Kennedy began his film career early in the silent era. He frequently played big, dumb, likable, working-class types, such as in The Case of the Stuttering Bishop (1937). He also worked with W.C. Fields, The Marx Brothers, and Stan Laurel and Oliver Hardy in a career that lasted until his death at the age of 80.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk0OTk2ZjctNTdiZi00OGZjLWFhYWUtMDgzYjQ0ZWQ2Y2ViL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0448366","name":"Tom Kennedy","idIMDB":"nm0448366"},"actorId":"nm0448366","character":"'Fat' Mike","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Georgia Caine","urlProfile":"http://www.imdb.com/name/nm0128990","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmUyZjY5N2ItZjM2MS00NTQyLWE0ZWItMWFkNzViNGNiNWFlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1876","placeOfBirth":" San Francisco, California, USA","height":"5' 5\" (1.65 m)","bio":"Georgia Caine was born on October 30, 1876 in San Francisco, California, USA. She was an actress, known for Hail the Conquering Hero (1944), The Count of Monte Cristo (1934) and Dodge City (1939). She was married to Alphonzo Bell Hudson and Charles Winters. She died on April 4, 1964 in Hollywood, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmUyZjY5N2ItZjM2MS00NTQyLWE0ZWItMWFkNzViNGNiNWFlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0128990","name":"Georgia Caine","idIMDB":"nm0128990"},"actorId":"nm0128990","character":"Lee's Mother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Virginia Brissac","urlProfile":"http://www.imdb.com/name/nm0109877","urlPhoto":"","biography":{"dateOfBirth":"11 June 1883","placeOfBirth":" San Jose, California, USA","bio":"Virginia Brissac was born on June 11, 1883 in San Jose, California, USA. She was an actress, known for Rebel Without a Cause (1955), Dark Victory (1939) and Monsieur Verdoux (1947). She was married to John Griffith Wray and Eugene D. Mockbee. She died on July 26, 1979 in Santa Fe, New Mexico, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0109877","name":"Virginia Brissac","idIMDB":"nm0109877"},"actorId":"nm0109877","character":"Mrs. Emory","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0032981","urlIMDB":"http://www.imdb.com/title/tt0032981","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"27","month":"07","year":"1939","remarks":null},{"money":null,"country":null,"day":"08","month":"09","year":"1939","remarks":null}],"copyrightHolder":"Copyright MCMXXXIX by Paramount Pictures, Inc.; © Paramount Pictures, Inc.; 19 January 1940; LP9372 (in copyright registry)"},"technical":{"runtime":["1 hr 34 min (94 min)","1 hr 26 min (86 min) (TV) (West Germany)"],"soundMix":["Mono (Western Electric Mirrophonic Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["(10 reels)","2,577 m (Netherlands)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.7","filmingLocations":[{"location":"Paramount Studios - 5555 Melrose Avenue, Hollywood, Los Angeles, California, USA"}],"rated":"PASSED","awards":[],"votes":"3,192","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["christmas","trial","shoplifting","wedding","song","singer","rummage sale","slang","minister","stepfather","cigarette smoking","juror","jury","yodel","trespassing","small town","singing","self sacrifice","popcorn","piano","pennsylvania","ohio","nightclub","niagara falls","new york city","new year's eve","mother son relationship","mother daughter relationship","moral reformation","lawyer","judge","jewelry store","indiana","gun","girdle","gift","fire","district attorney","cow","christmas tree","canada","barn dance","bail bondsman","automobile","aunt","arson"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 01:08:15"}}