{"data":{"movies":[{"title":"Unfaithfully Yours","originalTitle":"","year":"1984","releaseDate":"19840210","directors":[{"name":"Howard Zieff","id":"nm0956052"}],"writers":[{"name":"Preston Sturges","id":"nm0002545"},{"name":"Valerie Curtin","id":"nm0193224"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMTExMTA1OV5BMl5BanBnXkFtZTcwODg0OTgyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Music","Romance"],"plot":"Claude Eastman, is a composer and conductor. He is married to Daniella, who is half his age. While away on a trip he told his Italian driver, Giuseppe, to tell his friend Norman to keep an eye on her, or take care of her. But his english is not too good, so Norman thought he was saying that Claude wanted him to hire a private eye to keep tabs on her. Which he did. Claude tells him that it's ok but the man Norman hired gives him his report and it says something happened while he was away. Claude, of course, tells him to throw it away but after Norman leaves, Claude tries to retrieve it and tries to read it but Daniella's there, when Giuseppe destoys it, he goes to the man Norman hired to get a copy. He tells Claude that a man went into his apartment while he was away and left at an unusual hour, and that he also has a video. Claude tells him to destroy it but shortly after leaving returns so that he can watch it. Now the video's a little fuzzy but clearly he can see that the man wears ...","simplePlot":"A composer suspects his wife of cheating. He plots to kill her and frame it on her lover.","actors":[{"actorName":"Dudley Moore","urlProfile":"http://www.imdb.com/name/nm0001545","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MjY5MTQxOF5BMl5BanBnXkFtZTcwNTAxMTkwMw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 April 1935","placeOfBirth":" Dagenham, Essex, England, UK","birthName":"Dudley Stuart John Moore","height":"5' 2½\" (1.59 m)","bio":"Dudley Moore, the gifted comedian who had at least three distinct career phases that brought him great acclaim and success, actually started out as a musical prodigy as a child. He was born in Dagenham, Essex, England, in 1935, to working class parents, Ada Francis (Hughes), an English secretary, and John Havlin Moore, a Scottish railway electrician (originally from Glasgow). Dudley won a music scholarship to Magdalen College, Oxford, to study the organ. At university, he also studied composition and became a classically trained pianist, though his forte on the piano for public performance was jazz. After graduating from Magdalen College in 1958, Moore was offered a position as organist at King's College, Cambridge, but turned it down in order to go to London and pursue a music and acting career. Fellow Oxonian Alan Bennett (Exter Colelge, B.A., Medieval History, 1957) had already recommended him to John Bassett, who was putting together a satirical comedy revue called \"Beyond The Fringe\". \"Beyond The Fringe\" was to be Moore's first brush with fame, along with co-stars Bennett, future theatrical director Jonathan Miller (now Sir Jonathan, who studied Medicine at Cambridge and was a physician), and Peter Cook, who was destined to become Moore's comic partner during the 1960s and '70s. It was Miller who had recommended Cook for \"Beyond the Fringe\", in much the same way that Bennett had bird-dogged Moore. Cook, who had studied modern languages at Cambridge, had been part of the famous Cambridge theatrical, the Footlights revue in 1959, had subsequently gone to London to star in a West End revue for Kenneth Williams, \"Pieces of Eight\". This old-fashioned review was such a success there was a sequel, \"One Over The Eight\". He was advised by his agent not to star in the fringe with the three others as he was a professional whereas they were amateurs. Ironically, the great success of \"Beyond the Fringe\", which was a new kind of satirical comedy, would doom the very old-fashioned reviews that Cook had just tasted success in. \"Beyond the Fringe\" not only won great acclaim in the UK, but it was a hit in the U.S.. The four won a special Tony Award in 1963 for their Broadway production of \"Beyond The Fringe\" and there was a television program made of the revue in 1964. Moore and Cook were offered the TV show Not Only... But Also (1965) by the BBC in 1965. Peter Cook was on as a guest. Their pairing was so successful, it enjoyed a second season in 1966 and a third in 1970. They were particularly funny as the working-class characters \"Pete\" and \"Dud\". The duo then broke into the movies, including The Wrong Box (1966) and Bedazzled (1967). In 1974, the duo won their second Tony Award for their show \"Good Night\", which was the stage version of their TV series \"Not Only... But Also\". In the mid- to late 1970s, they issued three comic albums in the guise of the characters \"Derek\" and \"Clive\" (Moore and Cook, respectively), two lavatory attendants that many viewed as reincarnations of their earlier TV characters \"Pete\" and \"Dud\". The albums, ad libbed in a recording studio while the two drank vast quantities of alcohol, were noted at the time for their obscenity. Their typical routine was a stream-of-consciousness fugue by Cook, interspersed with interjections by Moore. With their obscenity-laden, free-formed riffs, Derke and Clive presaged the more free-wheeling shock comedy of the 1980s and '90s. After marrying American actress Tuesday Weld in 1975, Moore moved to the U.S. and began a second career as a solo screen comedian, stealing the show from Chevy Chase and Goldie Hawn as the horny conductor in the movie comedy, Foul Play (1978). When George Segal dropped out of the movie 10 (1979), director Blake Edwards cast Moore in the lead role as the composer undergoing a mid-life crisis. It was a huge hit, but was surpassed by his Oscar-nominated turn as the dipsomaniac billionaire in Arthur (1981). In the early 1980s, Moore was a top box office attraction. In 1983, the National Alliance of Theater Owners named him the Top Box Office Star-Male of the Year. His career began petering out after he turned down the lead in Splash (1984), a role that helped establish Tom Hanks as a top movie comedian and position him for his transition into movie drama and super-stardom. As Hanks star waxed, Moore's star waned, and by 1985 he was reduced to playing an elf in Santa Claus: The Movie (1985), one of the all time turkeys. Even a second turn as \"Arthur\" in Arthur 2: On the Rocks (1988) couldn't revive his box office, the dependent clause of the title all too well describing his career. His TV series Dudley (1993) [TV-Series] was a bust, and the 1990s proved a wasteland for the once-honored and prosperous comedian. Moore was deeply affected by the January 1995 death of Peter Cook by a gastrointestinal hemorrhage at the age of 57. Moore organized a two-day memorial to Cook in Los Angeles that was held in November 1995. Less than four years later, in September 1999, Moore announced that he was afflicted with progressive supra-nuclear palsy, a disease for which there is no treatment. Dudley Moore was invested as a Commander of the Order of The British Empire (one step below knighthood) in June 2001. Moore personally attended the ceremony at Buckingham Palace to accept his CBE from Prince Charles, despite being unable to speak and being wheelchair-bound. He died in Watchung, New Jersey on March 27, 2002, from the pneumonia related to progressive supra-nuclear palsy. He was 66 years old. Dudley Moore was married four times, to actresses Suzy Kendall, Tuesday Weld, Brogan Lane and 'Nicole Rothschild', and had two sons, one with Tuesday Weld and one with Nicole Rothschild.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MjY5MTQxOF5BMl5BanBnXkFtZTcwNTAxMTkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001545","name":"Dudley Moore","nicknames":["Cuddly Dudley","The Sex Thimble"],"idIMDB":"nm0001545"},"actorId":"nm0001545","character":"Claude Eastman","urlCharacter":"http://www.imdb.com/character/ch0074710","main":true},{"actorName":"Nastassja Kinski","urlProfile":"http://www.imdb.com/name/nm0000176","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MDgzNDU1MV5BMl5BanBnXkFtZTYwMDUzOTg1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 January 1961","placeOfBirth":" Berlin, Germany","birthName":"Nastassja Aglaia Nakszynski","height":"5' 6½\" (1.69 m)","bio":"Nastassja Kinski was born Nastassja Aglaia Nakszynski on January 24, 1961 in Berlin, Germany, the daughter of German actor Klaus Kinski. In 1976, she met director Roman Polanski, who urged her to study method acting with Lee Strasberg in the United States. Kinski starred in the Italian romantic drama Stay as You Are (1978) with Marcello Mastroianni, gaining her recognition in the United States after the film's release on December 21, 1979. She played the title character in Polanski's romantic drama Tess (1979), an adaptation of Thomas Hardy's novel \"Tess of the d'Urbervilles\" (1891). Kinski starred in Francis Ford Coppola's romantic musical One from the Heart (1981), her first film made in the United States. The film became a box office bomb and was a major loss for Coppola's production company Zoetrope Studios. She also starred in the erotic horror movie Cat People (1982) with Malcolm McDowell, a remake of the 1942 classic of the same name. She appeared in Wim Wenders' drama movie Paris, Texas (1984) with Harry Dean Stanton and Dean Stockwell. One of her most acclaimed films, the film won the Palme d'Or (Golden Palm) at the Cannes Film Festival. During the 1990s, Kinski appeared in a number of American films, including the action movie Terminal Velocity (1994) opposite Charlie Sheen, One Night Stand (1997), Your Friends & Neighbors (1998), John Landis' Susan's Plan (1998), and The Lost Son (1999). She has appeared in more than 60 films in Europe and the United States.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MDgzNDU1MV5BMl5BanBnXkFtZTYwMDUzOTg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000176","name":"Nastassja Kinski","idIMDB":"nm0000176"},"actorId":"nm0000176","character":"Daniella Eastman","urlCharacter":"http://www.imdb.com/character/ch0074711","main":true},{"actorName":"Armand Assante","urlProfile":"http://www.imdb.com/name/nm0000800","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDU1OGFjNWUtMzkzZS00NWFjLWI4N2YtMmE1M2YwNjliZDEwL2ltYWdlXkEyXkFqcGdeQXVyNjAyMTAwMzk@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1949","placeOfBirth":" New York City, New York, USA","birthName":"Armand Anthony Assante Jr.","height":"5' 10\" (1.78 m)","bio":"Armand Assante is a coarsely handsome American actor who has successfully portrayed a wide range of intriguing characters from numerous ethnic backgrounds, both on screen and in the theater. Armand Anthony Assante, Jr. was born on October 4, 1949 in New York City, to Katherine (Healey), a music teacher and poet, and Armand Anthony Assante, Sr., an artist and painter. His father was of Italian descent and his mother was of Irish ancestry. Assante graduated from Cornwall Central High School and received his dramatic training at the American Academy of Dramatic Arts. His first screen role was as a wedding guest in the minor cult film The Lords of Flatbush (1974) starring Henry Winkler and Sylvester Stallone, then after guest appearances in several soap operas, he was back alongside Sylvester Stallone in Paradise Alley (1978). He played a wealthy Frenchman seducing army recruit Goldie Hawn in Private Benjamin (1980), portrayed literary \"hard boiled\" detective Mike Hammer in I, the Jury (1982) plus, he was excellent as the title role in Belizaire the Cajun (1986). Assante continued on into the 1990s with more strong performances as a drug baron in Q & A (1990) directed by Sidney Lumet, he made a sensational team with Antonio Banderas for the Cuban music spectacular Les mambo kings (1992), he was very impressive in the mob drama Hoffa (1992), and once more he was on screen with Sylvester Stallone in the film adaptation of the futuristic comic book Judge Dredd (1995), and Assante co-starred in the uneven Demi Moore film Striptease (1996). Assante's acting talents remain in strong demand, and he has continued to stay busy on screen with recent appearances in One Eyed King (2001), Citizen Verdict (2003) and Two for the Money (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDU1OGFjNWUtMzkzZS00NWFjLWI4N2YtMmE1M2YwNjliZDEwL2ltYWdlXkEyXkFqcGdeQXVyNjAyMTAwMzk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000800","name":"Armand Assante","idIMDB":"nm0000800"},"actorId":"nm0000800","character":"Maxmillian Stein","urlCharacter":"http://www.imdb.com/character/ch0074712","main":true},{"actorName":"Albert Brooks","urlProfile":"http://www.imdb.com/name/nm0000983","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MzEwMTMxN15BMl5BanBnXkFtZTcwNTQwMTc2NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1947","placeOfBirth":" Beverly Hills, California, USA","birthName":"Albert Lawrence Einstein","height":"5' 10\" (1.78 m)","bio":"Albert Brooks was born on July 22, 1947 in Beverly Hills, California, USA as Albert Lawrence Einstein. He is an actor and writer, known for Finding Nemo (2003), Drive (2011) and Taxi Driver (1976). He has been married to Kimberly Shlain since March 15, 1997. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MzEwMTMxN15BMl5BanBnXkFtZTcwNTQwMTc2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000983","name":"Albert Brooks","idIMDB":"nm0000983"},"actorId":"nm0000983","character":"Norman Robbins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cassie Yates","urlProfile":"http://www.imdb.com/name/nm0946720","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNTEzODI2MV5BMl5BanBnXkFtZTgwNjg5NTU1MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 March 1951","placeOfBirth":" Macon, Georgia, USA","bio":"Cassie Yates was born on March 2, 1951 in Macon, Georgia, USA. She is an actress, known for Convoy (1978), F.I.S.T. (1978) and The Osterman Weekend (1983).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNTEzODI2MV5BMl5BanBnXkFtZTgwNjg5NTU1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0946720","name":"Cassie Yates","idIMDB":"nm0946720"},"actorId":"nm0946720","character":"Carla Robbins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Libertini","urlProfile":"http://www.imdb.com/name/nm0508844","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5OTE5NDMxNl5BMl5BanBnXkFtZTcwODgxMDkwMw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 May 1933","placeOfBirth":" Cambridge, Massachusetts, USA","birthName":"Richard Joseph Libertini","height":"6' 1½\" (1.87 m)","bio":"Richard Libertini was born in E. Cambridge, Massachusetts, to parents who had come to America from southern Italy. Having grown up in a household where both Italian and English were spoken, he developed an ear for foreign accents. A facility he would later use to advantage on stage and in films. He graduated from Emerson College in Boston, and for a while earned a living as a trumpet player in the Boston area. Later, he moved to New York, where he teamed up with two former college classmates, MacIntyre Dixon and Lynda Segal, to create an off-Broadway revue called \"Stewed Prunes.\" (This was during the coffee house revolution in the 1960s. Bob Dylan was playing around the corner.) The show was quite successful and after running a year in New York they took it on the road. While playing Chicago, he was asked to join the renowned Second City Improvisational Theatre Group, an association which continues to the present. After a number of years doing stage work in New York (Woody Allen's Don't Drink the Water (1969) and Paul Sills' Story Theatre (1971) among many others) he eventually moved to L.A. where he began doing films. Three of his most memorable characters are the Spanish-American dictator in The In-Laws (1979) with Alan Arkin and Peter Falk, the Tibetan Mystic in All of Me (1984) with Steve Martin, and Lily Tomlin and the justice of the peace in Best Friends (1982) with Goldie Hawn and Burt Reynolds. Other films include Fletch (1985) with Chevy Chase and Popeye (1980) with Robin Williams.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5OTE5NDMxNl5BMl5BanBnXkFtZTcwODgxMDkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0508844","name":"Richard Libertini","idIMDB":"nm0508844"},"actorId":"nm0508844","character":"Giuseppe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard B. Shull","urlProfile":"http://www.imdb.com/name/nm0795711","urlPhoto":"","biography":{"dateOfBirth":"24 February 1929","placeOfBirth":" Evanston, Illinois, USA","birthName":"Richard Bruce Shull","height":"6' 1\" (1.85 m)","bio":"Veteran character actor Richard B. Shull was born on February 24, 1929 in Evanston, Illinois and raised in the Midwest. He attended the University of Iowa, then served with the U.S. Army in 1953. Finding work as a stage manager following his release, he finally made his Broadway debut in the Marx Brothers musical bio \"Minnie's Boys\" starring Shelley Winters on Broadway in 1970. His hangdog demeanor, puffy features and bemused manner proved an excellent scene stealer in comedy roles and he moved easily into film and TV in mid-career. Following his film debut in the very obscure Watch the Birdie (1965), Richard came into his own starting in 1971 with regular roles in such movies as The Anderson Tapes (1971), Klute (1971), Made for Each Other (1971), Slither (1973), Hail (1972), Hearts of the West (1975), The Big Bus (1976), Splash (1984), Garbo Talks (1984), HouseSitter (1992), Trapped in Paradise (1994) and, his last, Private Parts (1997) with Howard Stern. On TV, he was probably best known for his title role on the silly, short-lived series Holmes and Yo-Yo (1976) as Det. Alexander Holmes, opposite John Schuck who played Yoyo, a robotic cop. The recipient of a Tony nomination for his Broadway work on \"Goodtime Charlie\" in 1975, Richard's later career included such theater notables as \"The Marriage of Bette and Boo\" (1985), for which he won an off-Broadway Obie award, and the ever-popular \"Victor/Victoria\" starring a resurgent Julie Andrews, in 1995. Married four times, Richard was appearing in the stage production of \"Epic Proportions\" in New York when he suffered a fatal heart attack on October 14, 1999 at age 70.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0795711","name":"Richard B. Shull","idIMDB":"nm0795711"},"actorId":"nm0795711","character":"Jess Keller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jan Tríska","urlProfile":"http://www.imdb.com/name/nm0873131","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmZlMTkwNjQtMDkzYS00OWVhLWE2MzktNTA2ZGU1YjgyOTA0XkEyXkFqcGdeQXVyMjIxMzMyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 November 1936","placeOfBirth":" Prague, Czechoslovakia [now Czech Republic]","bio":"Jan Tríska was born on November 4, 1936 in Prague, Czechoslovakia. He is an actor, known for Ronin (1998), The People vs. Larry Flynt (1996) and Lunacy (2005). He is married to Karla Chadimová. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmZlMTkwNjQtMDkzYS00OWVhLWE2MzktNTA2ZGU1YjgyOTA0XkEyXkFqcGdeQXVyMjIxMzMyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0873131","name":"Jan Tríska","idIMDB":"nm0873131"},"actorId":"nm0873131","character":"Jerzy Czyrek","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jane Hallaren","urlProfile":"http://www.imdb.com/name/nm0356284","urlPhoto":"","biography":{"bio":"Jane Hallaren is an actress and casting director, known for My Girl (1991), Body Heat (1981) and Lianna (1983).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0356284","name":"Jane Hallaren","idIMDB":"nm0356284"},"actorId":"nm0356284","character":"Janet","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bernard Behrens","urlProfile":"http://www.imdb.com/name/nm0067049","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NDU0MjQ3Ml5BMl5BanBnXkFtZTgwNTM5NDg0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1926","placeOfBirth":" London, England, UK","bio":"Character actor Bernard Behrens was born on September 28, 1926 in London, England. Behrens grew up in poverty in Depression-era London; he did his best to surmount the dire reality of his dismal situation by sneaking into movie theaters as a kid and aspired to become an actor since the age of seven. A child evacuee during World War II, Bernard was forced to live by his wits with a foster family. Behrens not only acted in stage productions for the Bristol Old Vic in the United Kingdom, but also for the Canadian Players, Halifax's Neptune Theatre (he starred in the Canadian premiere of \"Mary, Mary\" at this particular venue), and Toronto's Crest Theatre as well as the Shaw and Stratford Festivals in Canada. Outside of his stage work, Bernard also acted in a handful of films and made guest appearances on numerous television shows. His last acting role on stage was playing Young Farley in a Shaw Festival production of \"Belle Moral.\" Diagnosed with dementia four years prior to his death, Behren's final years were spent in Niagara-on-the-Lake, Ontario, Canada and, during the last year of his life, in Perth, Ontario, Canada, where he was cared for in Lanark Lodge. Bernard died at age 85 on September 19, 2012 in Perth, Ontario, Canada. The husband of actress Deborah Cass, who along with Behrens was a founding member of Neptune Theatre under the director of Leon Major and died in 2004, Behrens was survived by his sons Mark, Adam, and Matthew and his grandchildren Kate, Spenser, and Taylor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NDU0MjQ3Ml5BMl5BanBnXkFtZTgwNTM5NDg0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0067049","name":"Bernard Behrens","nicknames":["Bunny"],"idIMDB":"nm0067049"},"actorId":"nm0067049","character":"Bill Lawrence","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leonard Mann","urlProfile":"http://www.imdb.com/name/nm0542853","urlPhoto":"","biography":{"dateOfBirth":"1 March 1947","placeOfBirth":" Albion, New York, USA","birthName":"Leonardo Manzella","bio":"Leonard Mann was born on March 1, 1947 in Albion, New York, USA as Leonardo Manzella. He is an actor and director, known for Night School (1981), Amazonia: La jungle blanche (1985) and Flowers in the Attic (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0542853","name":"Leonard Mann","idIMDB":"nm0542853"},"actorId":"nm0542853","character":"Screen Lover","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Estelle Omens","urlProfile":"http://www.imdb.com/name/nm0648384","urlPhoto":"","biography":{"dateOfBirth":"11 October 1928","placeOfBirth":" Chicago, Illinois, USA","bio":"Estelle Omens was born on October 11, 1928 in Chicago, Illinois, USA. She was an actress, known for Dog Day Afternoon (1975), Stir Crazy (1980) and Marathon Man (1976). She was married to Frank Gregory. She died on December 5, 1983 in North Hollywood, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0648384","name":"Estelle Omens","idIMDB":"nm0648384"},"actorId":"nm0648384","character":"Celia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Penny Peyser","urlProfile":"http://www.imdb.com/name/nm0679018","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmQ3Y2M3MzctYzMyMi00NTIyLWE1MGQtYWE5N2E1YjQxYTM4XkEyXkFqcGdeQXVyOTQ0NzM5NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1951","placeOfBirth":" Irvington, New York, USA","bio":"Penny Peyser was born on February 9, 1951 in Irvington, New York, USA. She is an actress and writer, known for Crazy Like a Fox (1984), All the President's Men (1976) and The Frisco Kid (1979). She has been married to Doug McIntyre since July 6, 2002. She was previously married to David Brady and James Carroll Jordan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmQ3Y2M3MzctYzMyMi00NTIyLWE1MGQtYWE5N2E1YjQxYTM4XkEyXkFqcGdeQXVyOTQ0NzM5NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0679018","name":"Penny Peyser","idIMDB":"nm0679018"},"actorId":"nm0679018","character":"Jewelry Salesgirl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicholas Mele","urlProfile":"http://www.imdb.com/name/nm0577539","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NTU2NTAxNV5BMl5BanBnXkFtZTcwMTA0MTE5Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Nicholas Mele is known for his work on A Nightmare on Elm Street 5: The Dream Child (1989), I Am Sam (2001) and A Nightmare on Elm Street 4: The Dream Master (1988).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NTU2NTAxNV5BMl5BanBnXkFtZTcwMTA0MTE5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0577539","name":"Nicholas Mele","idIMDB":"nm0577539"},"actorId":"nm0577539","character":"Waiter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Benjamin Rayson","urlProfile":"http://www.imdb.com/name/nm0713544","urlPhoto":"","biography":{"bio":"Benjamin Rayson was born in New York City, New York, USA. He was an actor, known for The Purple Rose of Cairo (1985), Pippin: His Life and Times (1981) and Stardust Memories (1980). He died on June 11, 2005.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0713544","name":"Benjamin Rayson","idIMDB":"nm0713544"},"actorId":"nm0713544","character":"Judge","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0088326","urlIMDB":"http://www.imdb.com/title/tt0088326","business":{"budget":null,"openingWeekend":[{"money":"$3,774,126","country":"USA","day":"12","month":"02","year":"1984","remarks":"820 Screens"}],"gross":[{"money":"$19,928,200","country":"USA","day":"15","month":"04","year":"1984","remarks":""},{"money":"$19,733,052","country":"USA","day":"08","month":"04","year":"1984","remarks":""},{"money":"$19,420,206","country":"USA","day":"01","month":"04","year":"1984","remarks":""},{"money":"$18,783,634","country":"USA","day":"25","month":"03","year":"1984","remarks":""},{"money":"$17,739,437","country":"USA","day":"18","month":"03","year":"1984","remarks":""},{"money":"$16,200,299","country":"USA","day":"11","month":"03","year":"1984","remarks":""},{"money":"$14,071,671","country":"USA","day":"04","month":"03","year":"1984","remarks":""},{"money":"$11,352,078","country":"USA","day":"26","month":"02","year":"1984","remarks":""},{"money":"$7,910,385","country":"USA","day":"20","month":"02","year":"1984","remarks":""},{"money":"$3,774,126","country":"USA","day":"12","month":"02","year":"1984","remarks":""}],"weekendGross":[{"money":"$130,813","country":"USA","day":"15","month":"04","year":"1984","remarks":"189 Screens"},{"money":"$171,969","country":"USA","day":"08","month":"04","year":"1984","remarks":"239 Screens"},{"money":"$419,007","country":"USA","day":"01","month":"04","year":"1984","remarks":"404 Screens"},{"money":"$656,855","country":"USA","day":"25","month":"03","year":"1984","remarks":"515 Screens"},{"money":"$1,066,702","country":"USA","day":"18","month":"03","year":"1984","remarks":"630 Screens"},{"money":"$1,607,867","country":"USA","day":"11","month":"03","year":"1984","remarks":"720 Screens"},{"money":"$2,149,601","country":"USA","day":"04","month":"03","year":"1984","remarks":"769 Screens"},{"money":"$2,561,970","country":"USA","day":"26","month":"02","year":"1984","remarks":"809 Screens"},{"money":"$3,007,508","country":"USA","day":"20","month":"02","year":"1984","remarks":"831 Screens"},{"money":"$3,774,126","country":"USA","day":"12","month":"02","year":"1984","remarks":"820 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Lenses and Panaflex Camera by Panavision"],"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm (Eastman 400T 5294)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.0","filmingLocations":[],"rated":"PG","awards":[],"votes":"2,072","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"}],"keywords":{"keywords":["composer","italian","new york city","misunderstanding","screwball","jealous husband","concert","violin","restaurant","private detective","suspicion of adultery","halloween","classical music","adultery","jealousy","remake"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:15:16"}}