{"data":{"movies":[{"title":"Ein langer Ritt nach Eden","originalTitle":"","year":"1974","releaseDate":"19740802","directors":[{"name":"Günter Hendel","id":"nm0330568"}],"writers":[{"name":"Günter Hendel","id":"nm0330568"}],"runtime":"80 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzAyNjExODItNjA0ZC00NmZhLWEyYzEtMDU5MjhiZWE4ZTc5XkEyXkFqcGdeQXVyNjg5Nzc3NTU@._V1.jpg","countries":["West Germany"],"languages":["German"],"genres":["Western"],"simplePlot":"","actors":[{"actorName":"Michael Eder","urlProfile":"http://www.imdb.com/name/nm0249156","urlPhoto":"","biography":{"bio":"Michael Eder is an actor and assistant director, known for Ein langer Ritt nach Eden (1974), Im Jahre Neun (1966) and An Ideal Husband (1966).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0249156","name":"Michael Eder","idIMDB":"nm0249156"},"actorId":"nm0249156","character":"Langer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karin Heske","urlProfile":"http://www.imdb.com/name/nm0381379","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2JmOGU0NGQtMzFiMC00ZmQ0LWI4NDEtNDNjNzRlNjMxNGYyXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 July 1939","placeOfBirth":" Germany","bio":"Karin Heske was born on July 3, 1939 in Germany. She is an actress, known for She Devils of the SS (1973), He's at It Again (1970) and Ein langer Ritt nach Eden (1974).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2JmOGU0NGQtMzFiMC00ZmQ0LWI4NDEtNDNjNzRlNjMxNGYyXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0381379","name":"Karin Heske","idIMDB":"nm0381379"},"actorId":"nm0381379","character":"Lucy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ingrid Steeger","urlProfile":"http://www.imdb.com/name/nm0824377","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDg0YjE0ODItOWVmYi00OTk5LWI0MTEtNGUwYzMwMzM5ZmU5L2ltYWdlXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 April 1947","placeOfBirth":" Berlin, Germany","birthName":"Ingrid Anita Stengert","height":"5' 2½\" (1.59 m)","bio":"Ingrid Steeger was born Ingrid Anita Stengert in Berlin, April 1st, 1947, as the third child to Kurt and Käthe Stengert, who already had son Udo and daughter Jutta. After school she worked as a secretary when she was discovered by photographer Frank Quade. Soon pinup photos of her appeared in numerous men's magazines, especially SEXY, where even today she is the girl with the most cover shots. She was elected Miss Filmfestival (Berlin 1968) and soon was into movies herself. Her early movies were cheap sex movies, mostly of the \"Report\" type. Not wanting to use her real name, because her father objected, and not yet having decided on a stage name, her first movie billed her as \"Ingrid Stengel\". Her \"very\" first movie deserves a special mention. Before the age of video, pornos for home viewing were Super 8 shorts and Ingrid starred uncredited in one of those, called \"Die perverse Herrin und ihre Opfer\" (\"The perverted Mistress and her Victims\"). This movie had long been forgotten, when at the height of her career Mike Hunter reissued it on video, retitled \"Ingrid Steeger's Porno Action\". She went to court to stop distribution and won. The same thing happened again when Beate Uhse distributed a collection of old naturalist shots of Ingrid, titled \"Ingrid - blutjung und verführerisch\" (\"Ingrid - youngblooded and tempting\"). Again she had to go to court to stop distribution. In addition to her movies, she was given small serious roles in TV-productions, where, strange as it seems, nobody seemed to know about her sex-films. Helmut Holger, one of her colleagues suggested her to director Michael Pfleghar, who was casting for a new TV comedy series called \"Klimbim\", a German version of the American show \"Rowan and Martin's Laugh In\". This show became her breakthrough. The public loved her in her new role as \"Klimbim-clown\", and decent pictures of her appeared in women's and teen's magazines. The readers of Germany's biggest teen magazine BRAVO awarded her the \"Otto\", BRAVO's top award, four times. (1975: Bronze, 1976 & 1977: Silver, 1978: Gold). It seemed that nobody could stop her now. She followed \"Klimbim\" with \"Zwei himmlische Töchter\" (\"Two Heavenly Daughters\"), another successful comedy series, and flopped badly with \"Susi\", a third one, all directed by Pfleghar. From then on it was downhill for her. She went to France to live with her actor-friend Jean-Paul Zehnacker, but they soon separated. Ingrid returned to Germany to become a mature, serious actress, in the vein of her idols Shirley MacLaine or Goldie Hawn, but the public wouldn't let her. The same public that once had forgiven her sexfilm-past wouldn't forget \"Klimbim\", though the series hadn't been shown for ages. Nearly every article on her began with \"Ingrid Steeger, ex-clown (\"Klimbim\"), will ...\". Michael Pfleghar couldn't help her either, because he ran into severe personal problems and committed suicide a few years later. Though Ingrid can act, her few serious roles were doomed from the start. In recent years she has concentrated on theater and played mostly boulevard comedies. In 1995 she starred in the Karl May summer theater in Bad Segeberg as Cowgirl Mona. Her private life has been rather chaotic too. Her marriages, liaisons and affairs are well chronicled and are always listed when she is seen with somebody new. 1) When starting in the movies she married cameraman Lothar Stickelbrucks in 1973, but they got divorced two years later. 2) She had an affair with director Michael Pfleghar, though neither one admitted it at that time. She even wanted to leave Germany to go to Hollywood with him (Rumour?). 3) Next was Peter Koenecke, who organized safari tours in Kenia. They planned to marry in 1979 and to move to Kenia together. Allegedly she even learned Swahili. 4) Next was French actor Jean-Paul Zehnacker, who starred with her in \"Susi\". She moved to live with him in France, but when love turned to frienship she returned to Germany 1984. 5) Next was Lothar Köllner (1985-1986), owner of a hifi-shop in Murnau, and she even obtained her driver's license at the age of 38 to see him more often. 6) Next was movie director Dr. Dieter Wedel (1988-1991), whom she shared with another woman. At least he starred her in his TV-series \"Wilder Westen inklusive\" and \"Der große Bellheim\", giving her a chance for some serious acting. 7) Then she met Red Indian Dakota Tom LaBlanc at a World Uranium Hearing and they got married in a rush in August 1992. Nobody gave them much of a chance, because Tom didn't speak German and she didn't speak much English. Most photos show them side by side, Tom having to wear Red Indian clothing with feather headdress for the photographers, holding Ingrid's dachshund and looking very uneasy. Nevertheless the press never accepted him. The couple was always referred to as \"Ingrid and her Indian\". Soon he spend most of his time in America, fighting for the rights of his people, and Ingrid was left at home. They divorced after three years in October 1995. 8) Next was Swiss actor Bernd Seebacher. Immediately following her divorce from Tom LaBlanc she fell in love with Bernd and August 1996 was set as the date for the wedding. The couple was shown in magazines, choosing rings and posing in their wedding dresses, but in the last possible moment the wedding was postponed. Unfortunately Ingrid had already sold her apartment in Munich to live with her husband in Switzerland. Now that she remained a foreigner, she had to leave the country. Her only true friend in all those years was her dachshund Felix. There is scarcely one private photo of Ingrid without her dog. When Felix was killed in France by a hit-and-run driver, she mourned a long time and finally got Felix II. This one even went on stage with her in \"Champagner-Complex\" and was said to have been the matchmaker when she first met Dieter Wedel. When Felix II had to be put to sleep in 1995, she didn't want another one, but Dieter Wedel kept up the tradition by presenting her a young dachshund called Lucky Luke.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDg0YjE0ODItOWVmYi00OTk5LWI0MTEtNGUwYzMwMzM5ZmU5L2ltYWdlXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0824377","name":"Ingrid Steeger","idIMDB":"nm0824377"},"actorId":"nm0824377","character":"Rachel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Derek Brand","urlProfile":"http://www.imdb.com/name/nm0104453","urlPhoto":"","biography":{"bio":"Derek Brand is an actor, known for Ein langer Ritt nach Eden (1974).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0104453","name":"Derek Brand","idIMDB":"nm0104453"},"actorId":"nm0104453","character":"Elmer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Achim Hammer","urlProfile":"http://www.imdb.com/name/nm0358421","urlPhoto":"","biography":{"dateOfBirth":"12 December 1940","placeOfBirth":" Plauen, Saxony, Germany","bio":"Achim Hammer was born on December 12, 1940 in Plauen, Saxony, Germany. He is an actor, known for Ein langer Ritt nach Eden (1974), Erotic Center (1969) and Komm nach Wien, ich zeig dir was! (1970).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0358421","name":"Achim Hammer","idIMDB":"nm0358421"},"actorId":"nm0358421","character":"Joshua","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Boris Cavazza","urlProfile":"http://www.imdb.com/name/nm0136036","urlPhoto":"","biography":{"dateOfBirth":"2 February 1939","placeOfBirth":" Milan, Lombardy, Italy","bio":"Boris Cavazza was born on February 2, 1939 in Milan, Lombardy, Italy. He is an actor and writer, known for Robutanje koruze (2009), Short Circuits (2006) and Piran-Pirano (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0136036","name":"Boris Cavazza","idIMDB":"nm0136036"},"actorId":"nm0136036","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nevanka Dundek","urlProfile":"http://www.imdb.com/name/nm0242192","urlPhoto":"","biography":{"height":"5' 8\" (1.73 m)","bio":"Nevanka Dundek was born in Yugoslavia. She is an actress, known for Ein langer Ritt nach Eden (1974).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0242192","name":"Nevanka Dundek","idIMDB":"nm0242192"},"actorId":"nm0242192","character":"Kamiah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Günter Hendel","urlProfile":"http://www.imdb.com/name/nm0330568","urlPhoto":"","biography":{"bio":"Günter Hendel is an actor and director, known for So Much Naked Tenderness (1968), Der Porno-Graf von Schweden (1969) and Ein langer Ritt nach Eden (1974).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0330568","name":"Günter Hendel","idIMDB":"nm0330568"},"actorId":"nm0330568","character":"Jack","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0067325","urlIMDB":"http://www.imdb.com/title/tt0067325","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 20 min (80 min) (Germany)"],"soundMix":null,"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"4.3","filmingLocations":[],"awards":[],"votes":"18","type":"Movie","companyCreditsSimple":[{"idCompany":"co0065488","name":"Guenter Hendel"}],"keywords":{"keywords":["euro western","female nudity","sex","quaker","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 01:05:03"}}