{"data":{"movies":[{"title":"The Spanish Main","originalTitle":"","year":"1945","releaseDate":"194510","directors":[{"name":"Frank Borzage","id":"nm0097648"}],"writers":[{"name":"George Worthing Yates","id":"nm0946753"},{"name":"Herman J. Mankiewicz","id":"nm0542534"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWM0ZmU4YWItYzA0Zi00NjU1LTk2MjctNDhmODdmOTEyNzk0XkEyXkFqcGdeQXVyNjc0MzMzNjA@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Adventure","Drama","Romance"],"plot":"Laurent van Horn is the leader of a band of Dutch refugees on a ship seeking freedom in the Carolinas, when the ship is wrecked on the coast of Cartagene. governed by Don Juan Alvardo, Spainish ruler. Alvarado has Laurent thrown in prison, but the latter escapes, and five-years later is a pirate leader. He poses as the navigator on a ship in which Contessa Francesca, daughter of a Mexican noble, is traveling on her way to marry Alvarado, whom she has never seen. Laurent's pirates capture the ship and Francesa, in order to save another ship, gives her hand-in-marriage to Laurent, who sails her to the pirate hideout. This irks the jealous Anne Bonney and,also, Captain Benjamin Black, who was already irked, anyway. They overpower Laurent and send Francesa to Alvarado, and then Mario du Billar, trusted right-hand man, makes a deal to deliver Laurent to Alvarado also.","simplePlot":"After being wronged by the Caribbean authorities, a Dutch captain turns pirate to wage war.","actors":[{"actorName":"Paul Henreid","urlProfile":"http://www.imdb.com/name/nm0002134","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyOTQ0ODg1NF5BMl5BanBnXkFtZTcwMjM2MjYwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 January 1908","placeOfBirth":" Trieste, Austria-Hungary [now Trieste, Friuli-Venezia Giulia, Italy]","birthName":"Paul Georg Julius Hernreid Ritter von Wassel-Waldingau","height":"6' 3\" (1.91 m)","bio":"The son of aristocratic banker Baron Carl Alphons and Marie Luise von Hernried, Paul grew up in Vienna and studied at the prestigious Maria Theresa Academy (graduating in 1927) and the Institute of Graphic Arts. For four years, he worked as translator and book designer for a publishing outfit run by Otto Preminger, while training to be an actor at night. Preminger was also a protege (and managing director) of Max Reinhardt. After attending one of Henreid's acting school performances, Preminger introduced him to the famous stage director and this led to a contract. In 1933, Paul made his debut at the Reinhardt Theatre in \"Faust\". He subsequently had several leading roles on the stage and appeared in a couple of Austrian films. Paul, like his screen persona Victor Laszlo in Casablanca (1942) was avidly anti-fascist. He accordingly left continental Europe and went to London in 1935, first appearing on stage as Prince Albert in \"Victoria the Great\" two years later. Henreid made his English-speaking motion picture debut in the popular drama Goodbye, Mr. Chips (1939), as the sympathetic German master Max Staefel, who proves to be Chipping's truest friend and ally. After that, however, he became incongruously typecast as Nazi henchmen in Mad Men of Europe (1940) and Night Train to Munich (1940). That year, he moved to the United States (becoming a citizen the following year) and quickly established himself on Broadway with \"Flight to the West\", as a Ribbentrop-type Nazi consul. His powerful performance led to radio work in the serial \"Joyce Jordan-Girl Interne\" and a film contract with RKO in 1941. This marked a turning point in Paul Henreid's career. He finally escaped the stereotypical Teutonic image and began to play heroic or romantic leads, his first being Joan of Paris (1942), opposite Michèle Morgan, as French RAF pilot Paul Lavallier. Significantly, his next film, Now, Voyager (1942), defined his new screen persona: debonnaire, cultured and genteel, lighting two cigarettes simultaneously, then passing one to Bette Davis. According to Henreid, this legendary (and later often lampooned) scene was almost cut from the film because the director, Irving Rapper, had concerns about it. Next came \"Casablanca\", where Henreid played the idealistic, sensitive patriot Victor Laszlo; the poorly received Bronte sisters biopic Devotion (1946), as an Irish priest; and a stalwart performance as a Polish count and Ida Lupino's love interest, In Our Time (1944). After several dull romantic leads, Henreid reinvented himself yet again. He played a memorably athletic and lively Dutch pirate, the 'Barracuda', in RKO's colourful swashbuckler The Spanish Main (1945). Another of his best later performances was as a sadistic South African commandant in the underrated film noir Rope of Sand (1949), which re-united him with his former \"Casablanca\" co-stars Peter Lorre and Claude Rains. After the Arabian Technicolor adventure, Thief of Damascus (1952), Henreid's star began to fade. His last noteworthy appearance during the fifties was as an itinerant magician in the oriental extravaganza Siren of Bagdad (1953) . The most memorable of several in-jokes, had Henreid lighting two hookahs (water pipes) for one of his harem girls, spoofing his famous scene from \"Now, Voyager\". Outspoken in his opposition to McCarthyism and adhering to his rights under the First Amendment, he was subsequently blacklisted as a \"communist sympathiser\" by the House Committee on Un- American Activities. In spite of the damage this did to his career, he re-emerged as a director of second features and television episodes for Screen Gems, Desilu and other companies. In 1957, Alfred Hitchcock (in defiance of the blacklist) hired him to direct several episodes of Alfred Hitchcock Presents (1955). Towards the end of his career, Paul Henreid directed his former \"Now, Voyager\" co-star Bette Davis in the camp melodrama Dead Ringer (1964) and toured with Agnes Moorehead on stage in a short-lived revival of \"Don Juan in Hell\"(1972- 73). Henreid died of pneumonia in a Santa Monica hospital in April 1992, after having suffered a stroke. He has the distinction of having not just one but two stars on the Hollywood Walk of Fame, one for his films, and one for his television work.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyOTQ0ODg1NF5BMl5BanBnXkFtZTcwMjM2MjYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002134","name":"Paul Henreid","idIMDB":"nm0002134"},"actorId":"nm0002134","character":"Capt. Laurent Van Horn","urlCharacter":"http://www.imdb.com/character/ch0450640","main":true},{"actorName":"Maureen O'Hara","urlProfile":"http://www.imdb.com/name/nm0000058","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2OTA0ODA4MV5BMl5BanBnXkFtZTYwNjIwNzQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1920","placeOfBirth":" Ranelagh, County Dublin, Ireland, UK [now Ranelagh, Dublin, Republic of Ireland]","birthName":"Maureen FitzSimons","height":"5' 7½\" (1.71 m)","bio":"In America, the early performing arts accomplishments of young Maureen FitzSimons (who we know as Maureen O'Hara) would definitely have put her in the child prodigy category. However, for a child of Irish heritage surrounded by gifted parents and family, these were very natural traits. Maureen made her entrance into this caring haven on August 17, 1920, in Ranelagh (a suburb of Dublin), Ireland. Her mother, Marguerita Lilburn FitzSimons, was an accomplished contralto. Her father, Charles FitzSimons, managed a business in Dublin and also owned part of the renowned Irish soccer team \"The Shamrock Rovers\". Maureen was the second of six FitzSimons children - Peggy, Florrie, Charles B. Fitzsimons, Margot Fitzsimons and James O'Hara completed this beautiful family. Maureen loved playing rough athletic games as a child and excelled in sports. She combined this interest with an equally natural gift for performing. This was demonstrated by her winning pretty much every Feis award for drama and theatrical performing her country offered. By age 14 she was accepted to the prestigious Abbey Theater and pursued her dream of classical theater and operatic singing. This course was to be altered, however, when Charles Laughton, after seeing a screen test of Maureen, became mesmerized by her hauntingly beautiful eyes. Before casting her to star in Jamaica Inn (1939), Laughton and his partner, Erich Pommer, changed her name from Maureen FitzSimons to \"Maureen O'Hara\" - a bit shorter last name for the marquee. Under contract to Laughton, Maureen's next picture was to be filmed in America (The Hunchback of Notre Dame (1939)) at RKO Pictures. The epic film was an extraordinary success and Maureen's contract was eventually bought from Laughton by RKO. At 19, Maureen had already starred in two major motion pictures with Laughton. Unlike most stars of her era, she started at the top, and remained there - with her skills and talents only getting better and better with the passing years. Maureen has an enviable string of all-time classics to her credit that include the aforementioned \"The Hunchback of Notre Dame\", How Green Was My Valley (1941), Miracle on 34th Street (1947), Sitting Pretty (1948), The Quiet Man (1952), The Parent Trap (1961) and McLintock! (1963). Add to this the distinction of being voted one of the five most beautiful women in the world and you have a film star who was as gorgeous as she was talented. Although at times early in her career Hollywood didn't seem to notice, there was much more to Maureen O'Hara than her dynamic beauty. She not only had a wonderful lyric soprano voice, but she could use her inherent athletic ability to perform physical feats that most actresses couldn't begin to attempt, from fencing to fisticuffs. She was a natural athlete. In her career Maureen starred with some of Hollywood's most dashing leading men, including Tyrone Power, John Payne, Rex Harrison, James Stewart, Henry Fonda, Brian Keith, Sir Alec Guinness and, of course, her famed pairings with \"The Duke\" himself, John Wayne. She starred in five films with Wayne, the most beloved being The Quiet Man (1952). In addition to famed director John Ford, Maureen was also fortunate to have worked for some other great directors in the business: Alfred Hitchcock, William Dieterle, Henry Hathaway, Henry King, Jean Renoir, John M. Stahl, William A. Wellman, Frank Borzage, Walter Lang, George Seaton, George Sherman, Carol Reed, Delmer Daves, David Swift, Andrew V. McLaglen and Chris Columbus. In 1968 Maureen found much deserved personal happiness when she married Charles Blair. Gen. Blair was a famous aviator whom she had known as a friend of her family for many years. A new career began for Maureen, that of a full-time wife. Her marriage to Blair, however, was again far from typical. Blair was the real-life version of what John Wayne had been on the screen. He had been a Brigadier General in the Air Force, a Senior Pilot with Pan American, and held many incredible record-breaking aeronautic achievements. Maureen happily retired from films in 1973 after making the TV movie The Red Pony (1973) (which won the prestigious Peabody Award for Excellence) with Henry Fonda. With Blair, Maureen managed Antilles Airboats, a commuter sea plane service in the Caribbean. She not only made trips around the world with her pilot husband, but owned and published a magazine, \"The Virgin Islander\", writing a monthly column called \"Maureen O'Hara Says\". Tragically, Charles Blair died in a plane crash in 1978. Though completely devastated, Maureen pulled herself together and, with memories of ten of the happiest years of her life, continued on. She was elected President and CEO of Antilles Airboats, which brought her the distinction of being the first woman president of a scheduled airline in the United States. Maureen now lives quite happily in retirement in a home near her grandson and his family in Boise, Idaho. Fortunately, she was coaxed out of retirement several times - once in 1991 to star with John Candy in Only the Lonely (1991) and again, in 1995, in a made-for-TV movie, The Christmas Box (1995) on CBS. In the spring of 1998, Maureen accepted the second of what would be three projects for Polson Productions and CBS: Cab to Canada (1998) - and, in October, 2000, The Last Dance (2000). On November 4, 2014 Maureen was honored by a long overdue Oscar for \"Lifetime Achievement\" at the annual Motion Picture Arts and Sciences Governors Awards. Maureen O'Hara is still absolutely stunning, with that trademark red hair, dazzling smile and those huge, expressive eyes. She has fans from all over the world of all ages who are utterly devoted to her legacy of films and her persona as a strong, courageous and intelligent woman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2OTA0ODA4MV5BMl5BanBnXkFtZTYwNjIwNzQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000058","name":"Maureen O'Hara","nicknames":["Big Red","The Pirate Queen","The Queen of Technicolor"],"idIMDB":"nm0000058"},"actorId":"nm0000058","character":"Contessa Francesca","urlCharacter":"http://www.imdb.com/character/ch0503752","main":true},{"actorName":"Walter Slezak","urlProfile":"http://www.imdb.com/name/nm0805790","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTkzOGFmMDgtNWJkZS00NGQzLWJiZmMtZTM0Njk3MTEwYzM5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1902","placeOfBirth":" Vienna, Austria-Hungary [now Austria]","birthName":"Walter Leo Slezak","height":"6' (1.83 m)","bio":"Tall, portly Viennese character actor Walter Slezak simultaneously pursued two different careers after his arrival in America in 1930: one, as a star of musical comedy on the stage, and another, as a portrayer of villains, impish rogues or pompous buffoons on screen. Born of a musical family in May 1902, son of famous opera star Leo Slezak, Walter studied medicine but quickly lost interest. For a while, he held a position working in a bank. At the age of twenty, he was spotted in a beer garden by the Hungarian actor/director Mihaly Kertesz (Michael Curtiz) and persuaded to appear in his motion picture Le sixième commandement (1922). Subsequently, the then rather lean Walter Slezak was signed by Ufa and became a matinee idol in German films of the 1920's. Always somewhat too fond of the culinary arts, Slezak over the years put on so much weight that, by the end of the decade, he was no longer considered bankable as a romantic star and became relegated to playing character roles instead. In 1930, Slezak emigrated to the United States and instantly hit it off with public and critics alike in his Broadway debut with the musical comedy 'Meet My Sister' (1930-31). Though publicly modest about his vocal abilities, Slezak gained further plaudits for his role in the Oscar Hammerstein II production, 'Music in the Air' (1932-33), scored by Jerome Kern. By the 1950's, Slezak had become an established name on Broadway, star of shows like 'My 3 Angels' (1953-54), written by Sam and Bella Spewack and directed by José Ferrer; the hit comedy 'The Gazebo' (1958-59), in which he starred as Elliott Nash, opposite Jayne Meadows (filmed afterwards at MGM, with Glenn Ford and Debbie Reynolds in the lead roles); and his greatest success, as the likeable curmudgeon Panisse in the musical production of Marcel Pagnol's 'Fanny', directed by Joshua Logan. For this role, he won the 1955 Tony Award as Best Actor in a Musical. 'Fanny' chalked up an impressive run of 888 performances between 1954 and 1956. In 1959, Slezak fulfilled his dream of emulating his father by singing the part of Zsupan in 'The Gypsy Baron' at the Metropolitan Opera. In motion pictures, Walter Slezak's career took quite a different path. He started in films in 1942, and just two years later, walked away with most of the acting honours for Alfred Hitchcock's claustrophobic thriller Lifeboat (1944). In it, he gave a compelling performance as the callous, methodical Nazi captain, who gradually assumes command of the vessel containing the survivors of the passenger ship torpedoed and sunk by his U-boat. Film critic Bosley Crowther, who had already been impressed with Slezak's previous performance as a Nazi agent in Once Upon a Honeymoon (1942), commented \"Nor is he an altogether repulsive or invidious type. As Walter Slezak plays him, he is tricky and sometimes brutal, yes, but he is practical, ingenious and basically courageous in his lonely resolve. Some of his careful deceptions would be regarded as smart and heroic if they came from an American in the same spot\" (New York Times,Jan.13 1944). The perceived incongruity of the enemy being portrayed with any sympathy whatever, resulted in criticism from other quarters for both the film and its director. After 'Lifeboat', the ebullient Slezak appeared in a variety of lavish and colourful costume spectaculars: as a flamboyant pirate in the Bob Hope comedy The Princess and the Pirate (1944); as the reprehensible governor Don Alvarado, wooing Maureen O'Hara in the swashbuckler The Spanish Main (1945); and as yet another Spaniard, the boorish Don Pedro Vargas, having similar designs on Judy Garland in the MGM musical The Pirate (1948). He was also memorably evil as Sinbad's treacherous barber Melik in Sinbad, the Sailor (1947), the corrupt gumshoe Arnett in Robert Wise's gangster melodrama Born to Kill (1947), and as the scheming medicine-show man in The Inspector General (1949), starring Danny Kaye. (1949). He was again integral to the plot of Come September (1961), as enterprising major domo to Rock Hudson who secretly runs his employer's luxury villa as a hotel for eleven months of the year. Bosley Crowther described his comic performance as 'perfect'. Slezak further parodied his bad guy image in 'The Clock King' on TV's Batman (1966), then mellowed into the part of sagacious book dealer Strossel in The Wonderful World of the Brothers Grimm (1962) and the amiable Squire Trelawney in the 1972 version of 'Treasure Island'. In his private life, Walter Slezak was known as an experienced pilot, a connoisseur of art, lover of chess and good books. His long career as one of the outstanding character players of his time ended with his retirement in 1980. Despondent over a series of debilitating medical problems, Slezak took his own life in April 1983.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTkzOGFmMDgtNWJkZS00NGQzLWJiZmMtZTM0Njk3MTEwYzM5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0805790","name":"Walter Slezak","idIMDB":"nm0805790"},"actorId":"nm0805790","character":"Don Juan Alvarado","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Binnie Barnes","urlProfile":"http://www.imdb.com/name/nm0001931","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MzQzNjc3OV5BMl5BanBnXkFtZTgwOTA5OTgwMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 March 1903","placeOfBirth":" Finsbury, London, England, UK","birthName":"Gittel Enoyce Barnes (later called Gertrude Maude Barnes)","height":"5' 5\" (1.65 m)","bio":"British-born actress who appeared in both British and American films, but who found her greatest success in Hollywood second leads. After a variety of jobs, including nurse, chorus girl and milkmaid, Barnes entered vaudeville. She appeared in more than a score of short comedies with comedian Stanley Lupino before making her feature bow in 1931. Two years later she achieved prominence as one of the half-dozen wives of the King in The Private Life of Henry VIII. (1933). The following year she moved to Hollywood and began a career as the smart-aleck pal of the lead or as the angry \"other woman.\" Barnes also played numerous leading roles, but spent most of the 1930s and 40s in strong supporting parts. In 1940 she married football star (and later producer) M.J. Frankovich and after the war, they moved to Italy and appeared in several films there and elsewhere in Europe. She retired from films in 1954, but returned for a few roles in the late 60s and early 70s. She worked busily with numerous charities until her death in 1998.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MzQzNjc3OV5BMl5BanBnXkFtZTgwOTA5OTgwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001931","name":"Binnie Barnes","nicknames":["Texas Binnie Barnes"],"idIMDB":"nm0001931"},"actorId":"nm0001931","character":"Anne Bonney","urlCharacter":"http://www.imdb.com/character/ch0062790","main":true},{"actorName":"John Emery","urlProfile":"http://www.imdb.com/name/nm0256305","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmUxZDhjOTgtMzMwYS00NDdlLTk3MmQtY2ZiNTdjNWY1MTU4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 May 1905","placeOfBirth":" New York City, New York, USA","height":"5' 11\" (1.8 m)","bio":"John Emery was born on May 20, 1905 in New York City, New York, USA. He was an actor, known for Spellbound (1945), Blood on the Sun (1945) and Here Comes Mr. Jordan (1941). He was married to Tamara Geva, Tallulah Bankhead and Patricia Calvert. He died on November 16, 1964 in New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmUxZDhjOTgtMzMwYS00NDdlLTk3MmQtY2ZiNTdjNWY1MTU4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0256305","name":"John Emery","idIMDB":"nm0256305"},"actorId":"nm0256305","character":"Capt. Mario Du Billar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barton MacLane","urlProfile":"http://www.imdb.com/name/nm0533692","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NzYwMTExOV5BMl5BanBnXkFtZTcwNDgzMzIxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1902","placeOfBirth":" Columbia, South Carolina, USA","birthName":"Ernest Barton MacLane","height":"6' 1\" (1.85 m)","bio":"Barton MacLane graduated from Wesleyan University, where he displayed a notable aptitude for sports, in particular football and basketball. Not surprisingly, his physical prowess led to an early role in The Quarterback (1926) with Richard Dix. MacLane once commented that, as an actor, he needed to have the physical strength to tear the bad guys \"from limb to limb\", if necessary. Ironically, it was usually Barton himself who was destined to be at the end of a hiding (when not getting shot, instead), typically as snarling henchmen, outlaws and other assorted dubious or abrasive types throughout most of his 40-year acting career. In fact, Barton became so typecast, that his name was for a time used proverbially, to generally describe a shouting, hard-nosed ruffian. After training at the American Academy of Dramatic Arts, MacLane joined a stock company in Brooklyn. In 1927 he had his first part on Broadway, a brief moment as an assistant district attorney, in the melodrama \"The Trial of Mary Dugan\". He then played a small featured role as a police officer in \"Subway Express\" (1929-30), a drama enacted in the interior of a subway car. In mid-1932 MacLane tried his hand at writing his own starring vehicle for the stage, entitled \"Rendezvous\". While the play closed after just 21 performances, it led to a contract with Warner Brothers. Barton had already appeared in bit roles for Paramount at their Astoria Studios, including The Marx Brothers' debut film The Cocoanuts (1929). He portrayed mobster Brad Collins in 'G' Men (1935) (with James Cagney), which set the tone for most of his future assignments. Brawny, with squinty eyes and a rasping voice, MacLane was the ideal surly tough guy, particularly suitable for westerns and the type of films noir Warner Brothers excelled at. He was often cast as cops, be they bent or honest. Some of his most representative performances include gangster Al Kruger in Bullets or Ballots (1936), which won him some of the best critical notices of his career; outlaw Jack Slade in Western Union (1941); crooked construction boss Pat McCormick, who gets beaten up by Humphrey Bogart and Tim Holt over past-due wages in The Treasure of the Sierra Madre (1948); hard-nosed cops Detective Dundy in The Maltese Falcon (1941) and Lt. Reece in Kiss Tomorrow Goodbye (1950). MacLane, on loan to Universal, also had a starring role in Prison Break (1938) as an innocent tuna fisherman who is framed for murder. He was prominent as a tough but sympathetic cop, foil to sleuthing girl reporter Glenda Farrell in the \"Torchy Blaine\" series of the mid- to late 1930s. In the 1960s Barton began to cultivate a good-guy image as Marshal Frank Caine in the NBC western series Outlaws (1960) as well as showing up in a small recurring role as Air Force Gen. Martin Peterson in I Dream of Jeannie (1965). Barton was married to the actress Charlotte Wynters, who appeared with him in six of his films. When not on the set, the couple spent time on their 2000-acre cattle ranch in Madera County, California. For his work in television, Barton has a star on the Hollywood Walk of Fame.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NzYwMTExOV5BMl5BanBnXkFtZTcwNDgzMzIxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0533692","name":"Barton MacLane","idIMDB":"nm0533692"},"actorId":"nm0533692","character":"Capt. Benjamin Black","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"J.M. Kerrigan","urlProfile":"http://www.imdb.com/name/nm0449858","urlPhoto":"","biography":{"dateOfBirth":"16 December 1884","placeOfBirth":" Dublin, Ireland","birthName":"Joseph M. Kerrigan","bio":"J.M. Kerrigan was born on December 16, 1884 in Dublin, Ireland as Joseph M. Kerrigan. He was an actor and director, known for Gone with the Wind (1939), 20,000 Leagues Under the Sea (1954) and The Wolf Man (1941). He died on April 29, 1964 in Hollywood, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0449858","name":"J.M. Kerrigan","idIMDB":"nm0449858"},"actorId":"nm0449858","character":"Pillery Gow","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fritz Leiber","urlProfile":"http://www.imdb.com/name/nm0500021","urlPhoto":"","biography":{"dateOfBirth":"31 January 1882","placeOfBirth":" Chicago, Illinois, USA","birthName":"Fritz Reuter Leiber","bio":"Fritz Leiber was born on January 31, 1882 in Chicago, Illinois, USA as Fritz Reuter Leiber. He was an actor, known for The Hunchback of Notre Dame (1939), The Story of Louis Pasteur (1936) and The Sea Hawk (1940). He was married to Virginia Bronson. He died on October 14, 1949 in Pacific Palisades, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0500021","name":"Fritz Leiber","idIMDB":"nm0500021"},"actorId":"nm0500021","character":"Bishop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nancy Gates","urlProfile":"http://www.imdb.com/name/nm0309607","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODMwOTM5YTAtZjRlNC00MDNiLWIxZmYtNTIyMzAzNTM1MDM3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 February 1926","placeOfBirth":" Dallas, Texas, USA","birthName":"Nancy Jane Gates","bio":"Nancy Gates was born February 1, 1926 in Dallas, Texas. She entered show business, at an early age, when she was signed to a contract with RKO Studios when she was 15. Her first production with that studio was in 1942's Hitler's Children (1943). Nancy was also in two more films that year, those being The Great Gildersleeve (1942) and The Magnificent Ambersons (1942). The young actress was equally busy the following year with appearances in Gildersleeve's Bad Day (1943), Behind the Rising Sun (1943) and This Land Is Mine (1943). However, after 1949, Nancy didn't appear in another film until she was 26 years old. In 1952, Nancy appeared in five films, beginning with Target Hong Kong (1953). Up to this point, the beautiful actress appeared mostly in character roles. Two of her finest performances did come in the Fifties. In 1954, Nancy played \"Ellen Benson\", a woman whose home was commandeered by a would-be assassin (Frank Sinatra) of the President of the U.S., in Suddenly! (1954). The other was as \"Edith Barclay\", the secretary to a small-town jeweler, in 1958's Some Came Running (1958). After the production of Comanche Station (1960), Nancy left acting to be with her family. She had 34 films on her dossier, along with a host of television appearances.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODMwOTM5YTAtZjRlNC00MDNiLWIxZmYtNTIyMzAzNTM1MDM3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0309607","name":"Nancy Gates","idIMDB":"nm0309607"},"actorId":"nm0309607","character":"Lupita","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack La Rue","urlProfile":"http://www.imdb.com/name/nm0479011","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDdhODgwNzItZGUxNi00ZWVjLTgxZDYtOGY5N2EzYzNlM2I3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1902","placeOfBirth":" New York City, New York, USA","birthName":"Gaspere Biondolillo","height":"5' 11½\" (1.82 m)","bio":"Discovered on Broadway by director Howard Hawks, La Rue was originally brought to Hollywood to play a gangster in Scarface (1932). He lost that role to George Raft, and similarly was replaced by Humphrey Bogart in the film version of The Petrified Forest (1936). Eventually, he became well-known to movie-goers as a mean, sexy gangster type in sadistic roles like Miriam Hopkins' abductor in The Story of Temple Drake (1933). Film audiences, who loved to loathe him on-screen, were occasionally surprised by his being cast against type in such movies as A Farewell to Arms (1932). His final film was in the low-budget film Paesano: A Voice in the Night (1977).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDdhODgwNzItZGUxNi00ZWVjLTgxZDYtOGY5N2EzYzNlM2I3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0479011","name":"Jack La Rue","idIMDB":"nm0479011"},"actorId":"nm0479011","character":"Lt. Escobar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Mazurki","urlProfile":"http://www.imdb.com/name/nm0563417","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTQzMzkwMl5BMl5BanBnXkFtZTYwNjgwMTU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1907","placeOfBirth":" Tarnopol, Galicia, Austria-Hungary [now Ternopil, Ukraine]","birthName":"Michail Mazuruski","height":"6' 4¾\" (1.95 m)","bio":"With an intimidating face like craggy granite and a towering 6'5\" solid frame, Mike Mazurki (born Mikhail Mazuruski or Mikhail Mazurkiewicz) was one of cinema's first serial thugs and specialized in playing strongarm men, gangsters and bullies for over 50 years on screen. Nearly always portrayed as a lowbrow muscle, in real life Mazurski was highly intelligent, very well read and a witty conversationalist. He was also an accomplished sportsman, having been a football player and a professional wrestler. He first appeared onscreen in uncredited roles in films such as Gentleman Jim (1942) and About Face (1942); however, his daunting bruiser looks were soon noticed and he became phenomenally busy in the 1940s, appearing in nearly 50 movies during the decade, including his well remembered performance as ex-con \"Moose Malloy\" in the film noir thriller Murder, My Sweet (1944) and as the gruesome \"Splitface\" in Dick Tracy (1945). He continued his menacing onscreen presence throughout the 1950s and 1960s, often showing he could be quite adept at deadpan comedy in films including Bud Abbott and Lou Costello in Hollywood (1945), It's a Mad Mad Mad Mad World (1963), Donovan's Reef (1963) and The Adventures of Bullwhip Griffin (1967). Demand for his talents slowed down in the late 1970s and most of the 1980s, as younger villains came to the fore; however, he still turned up in support roles and was still acting at the age of 83 when he passed away in December, 1990.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTQzMzkwMl5BMl5BanBnXkFtZTYwNjgwMTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0563417","name":"Mike Mazurki","idIMDB":"nm0563417"},"actorId":"nm0563417","character":"Erik Swaine","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ian Keith","urlProfile":"http://www.imdb.com/name/nm0445246","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDkyZmVhYjAtYzcwMS00N2E1LWIyMjQtNzgxMzFiOTczMGJkXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1899","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Keith Ross","height":"6' 1\" (1.85 m)","bio":"Ian Keith became a well regarded fixture on the Broadway stage during the 1920s, but from 1924 through the remainder of the decade he expanded his acting into a string of silent movies as well. To begin the next decade, he appeared in the cast of Abraham Lincoln (1930), one of the later movies of D.W. Griffith. His forte was perhaps already becoming obvious -- his role was that of John Wilkes Booth. Keith had a sly look, and there was an irritated but deadpan demeanor and a side-of-the-mouth delivery to his speech that marked him as a great villain. And he played many -- including a surprising number in historic costume. There was never any emotional nuance, but his straight delivery was always completely effective. He figured prominently in some of the most ambitious of the early sound epics: The Sign of the Cross (1932), Cleopatra (1934), and The Crusades (1935) of Cecil B. DeMille, and in the latter Keith was -- a sort of good guy -- the great Sultan Saladin (surely a strange miscast but DeMille obviously liked him -- he showed up in the much later The Ten Commandments (1956) as well). He was the nemesis of John Gilbert in Queen Christina (1933) and of a similar cast in Mary of Scotland (1936), the early John Ford classic with Katharine Hepburn. He also portrayed an odd twist in the first sound The Three Musketeers (1935). Counter to the book, his Rochefort is the plotting genius, not Cardinal Richelieu, as it should be. Incidentally, he reprised Rochefort, but more in keeping with the original character, in The Three Musketeers (1948) version for Gene Kelly. In between those years were a lot of B level movies of everything from the comics to murder mysteries to mark a downturn said to be the result of too much nightlife. He still did Broadway intermittently throughout his career amid early TV theater and episodic fare from the late 1940s through the 1950s. The stage remained his first choice. At the time of his death he was appearing in \"The Andersonville Trial\" (1960) on Broadway.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDkyZmVhYjAtYzcwMS00N2E1LWIyMjQtNzgxMzFiOTczMGJkXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0445246","name":"Ian Keith","idIMDB":"nm0445246"},"actorId":"nm0445246","character":"Captain Lussan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Curt Bois","urlProfile":"http://www.imdb.com/name/nm0092290","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWM2NzNmZTctYjJkNi00YjBjLWIyMjgtNjMyMWYxNDZlZmI0XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 April 1901","placeOfBirth":" Berlin, Germany","bio":"Curt Bois was born on April 5, 1901 in Berlin, Germany. He was an actor and director, known for Casablanca (1942), Wings of Desire (1987) and Das Boot ist voll (1981). He was married to Dagmar and Hedy Ury. He died on December 25, 1991 in Berlin.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWM2NzNmZTctYjJkNi00YjBjLWIyMjgtNjMyMWYxNDZlZmI0XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0092290","name":"Curt Bois","idIMDB":"nm0092290"},"actorId":"nm0092290","character":"Paree","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Antonio Moreno","urlProfile":"http://www.imdb.com/name/nm0603875","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMzM2NTcyMF5BMl5BanBnXkFtZTgwMTk2MDU1MzE@._V1._CR108,135,532,720_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 September 1887","placeOfBirth":" Madrid, Spain","birthName":"Antonio Garride Monteagudo","height":"5' 10\" (1.78 m)","bio":"A serious rival to Rudolph Valentino as the smouldering 'Latin Lover' type was black-haired Spanish-born Antonio Moreno. One of the most prominent screen stars of the 1920's, he was equally adept at romance, melodrama or comedy and appeared opposite most of the legendary movie queens of the era, from the Gish sisters to Greta Garbo, to Gloria Swanson and Mary Pickford. He began working life as an employee of the Northhampton Electric Light and Gas Company. He first acted on stage under the tutelage of Maude Adams, whose theatre he had initially visited in order to fix the lighting. Moreno's heyday came years later, under contract to Paramount from 1923 to 1924, and at Metro-Goldwyn-Mayer in 1926. He had previously made his movie debut at Rex-Universal and then featured as a top drawing card for Vitagraph until 1921. Moreno also proudly held the sobriquet of \"King of the Cliff-hangers\" (usually as co-star to Pearl White), because of his prolific work in serials. After the advent of sound pictures, Moreno's career went into decline, largely due to his heavy Spanish accent. Nonetheless, he eventually segued into character parts and remained gainfully employed in the industry until the late 1950's. He was married from 1923 to Daisy Danziger, the daughter of an oil millionaire. Their lavish mansion, called 'Paramour', was one of the largest in Hollywood and the site of many a famous party. Daisy died ten years later in a tragic car crash near Mulholland Drive.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMzM2NTcyMF5BMl5BanBnXkFtZTgwMTk2MDU1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0603875","name":"Antonio Moreno","nicknames":["Tony","The Latin Lover"],"idIMDB":"nm0603875"},"actorId":"nm0603875","character":"Commandante","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victor Kilian","urlProfile":"http://www.imdb.com/name/nm0453081","urlPhoto":"","biography":{"dateOfBirth":"6 March 1891","placeOfBirth":" Jersey City, New Jersey, USA","birthName":"Victor Arthur Kilian","height":"6' 1½\" (1.87 m)","bio":"American character actor of gruff demeanor who played in dozens of films through the Thirties and Forties. A native of New Jersey, he was a wagon driver for his father's laundry business before joining a vaudeville company. He played in stock and touring companies, then was cast in the Walter Huston production of 'Desire Under the Elms' on Broadway. While working on the New York stage, he made a few appearances in films shot on Long Island. In 1935 he came to Hollywood and appeared with great frequency in supporting roles over the next decade and a half. In the early 1950s, he was blacklisted for his political beliefs during the Communist witchhunts, and returned to the stage almost exclusively thereafter. In 1976, he gained perhaps his greatest fame, as the title character's libidinous grandfather on the Mary Hartman, Mary Hartman (1976) TV series. But three years later, he was beaten to death by robbers burglarizing his apartment.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0453081","name":"Victor Kilian","idIMDB":"nm0453081"},"actorId":"nm0453081","character":"Santa Madre Captain","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0038108","urlIMDB":"http://www.imdb.com/title/tt0038108","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Copyright MCMXLV R K O Radio Pictures,Inc. All Rights Reserved (on print)"},"technical":{"runtime":["1 hr 40 min (100 min)"],"soundMix":["Mono (RCA Sound System)"],"color":["Color (Technicolor)"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["2,755 m (Netherlands)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.4","filmingLocations":[],"rated":"PASSED","awards":[{"award":"Academy Awards, USA 1946","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Cinematography, Color","names":[{"name":"George Barnes","id":"nm0055604","role":null}]}]}]}],"votes":"1,144","type":"Movie","companyCreditsSimple":[{"idCompany":"co0041421","name":"RKO Radio Pictures"}],"keywords":{"keywords":["ship","pirate","refugee","prison","navigator","hideout","freedom","dutch","coast","capture","escape","captain","redhead","swordswoman","swordsman","sword duel","sword fight","violence","rapier","combat","disarming someone","tavern","sword","spy","spanish","spanish main","spaniard","spain","song","singer","sea captain","sea battle","rum","royalty","prisoner","politics","politician","ocean","mexico","kidnapping","jolly roger","jealousy","intrigue","innkeeper","informant","impostor","heavy accent","governor","forced marriage","flag","duplicity","double cross","deception","deceit","custom","countess","atlantic ocean","arranged marriage","abduction","swashbuckler","ship wreck","rescue","mutiny","island","crew","cartagena"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 16:19:27"}}