{"data":{"movies":[{"title":"Mabel's Strange Predicament","originalTitle":"","year":"1914","releaseDate":"19140209","directors":[{"name":"Mabel Normand","id":"nm0635667"}],"writers":[{"name":"Henry Lehrman","id":"nm0499883"}],"runtime":"17 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc4NTA0OTk3Ml5BMl5BanBnXkFtZTgwNTE1MTkzMjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Short","Comedy"],"plot":"In a hotel lobby an inebriated Charlie runs into an elegant lady, gets tied hup in her dog's leash, and falls down. He later runs into her in the hotel corridor, locked out of her room. They run through various rooms. Mabel ends up in one of an elderly husband where she hides under the bed. Enter the jealous wife and Mabel's lover.","simplePlot":"In a hotel lobby an inebriated Charlie runs into an elegant lady, gets tied hup in her dog's leash, and falls down. He later runs into her in the hotel corridor, locked out of her room. ... ","actors":[{"actorName":"Mabel Normand","urlProfile":"http://www.imdb.com/name/nm0635667","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzI3ODI3Nl5BMl5BanBnXkFtZTgwMDAxMTkzMjE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1892","placeOfBirth":" New Brighton, Staten Island, New York, USA","birthName":"Mabel Ethelreid Normand","height":"5' 1\" (1.55 m)","bio":"Mabel Normand was one of the comedy greats of early film. In an era when women are deemed 'not funny enough' it seems film history has forgotten her contributions. Her films debuted the Keystone Cops, Charlie Chaplin's tramp and the pie in the face gag. She co-starred with both Chaplin and Roscoe \"Fatty\" Arbuckle in a series of shorts. She was a star in the first Keystone Comedy as well as the first feature film comedy. She was the only comedian to work with Charlie Chaplin, Roscoe \"Fatty\" Arbuckle, Mack Sennett, D.W. Griffith, Harold Lloyd, Mary Pickford, Hal Roach, Stan Laurel, Oliver Hardy, Fred Mace, Fred Sterling and John Bunny (she and Buster Keaton never had a chance to work together but they were friends.) Born in Staten Island, New York to Claude and Mary Normand. Normand started out as an artist model for Charles Dana Gibson (creator of the Gibson girl). Friends suggested she try out for the new medium of film and she did, working as an extra in Kalem and Biograph shorts. With Biograph's move to California she went to work for Vitagraph where she made a series of comedic shorts as 'Betty', one co-starring the first comedy film star John Bunny. Eventually Normand returned to Biograph where she began working with Mack Sennett on comedic shorts that would eventually turn into Keystone Comedies. Normand and Sennett were lovers, close friends and close co-workers. All of Sennett's early ideas seemed to revolve around Normand. His creation of Keystone was contingent on Normand joining him; and though he would underpay her as he underpaid everyone he worked with, he insisted Normand have credit and say in the company. When Normand eventually left Keystone for Goldwyn, Sennett left soon after. By 1912 Normand was writing her own films and by 1914 she was directing her films. By this point she was a major star, continually topping fan polls by new movie magazines. While the discovery of Charlie Chaplin varies from telling to telling, everyone involved agreed Sennett would not have hired (or kept him on) had it not been for Normand. Chaplin's second short for the company was Normand's \"Mabel's Strange Predicament\" which she starred and directed in. This was the first film Chaplin created his iconic tramp character for. Chaplin and Normand had a comedic chemistry and would go on to team in a series of shorts until Chaplin left Keystone in 1915. As Chaplin's star rose many fan magazines began to call Normand a 'female Chaplin'. Normand and Chaplin had similar subtle mannerisms and the influence Normand had on Chaplin can not be understated. Before Chaplin left Keystone, they starred, alongside Marie Dressler, in \"Tillie's Punctured Romance\" the first full length comedy film. With the loss of Chaplin, Normand and Roscoe \"Fatty\" Arbuckle began to team together in a series of shorts (though they had acted together before). This series was also popular and the pair continued acting together until they both left Keystone for better pay. Sennett and Normand became engaged around this time, though the engagement ended when Sennett was caught cheating on Normand. Friends report she suffered a severe head injury when Sennett's fling threw a vase at Normand's head. Those who knew Normand all believed Sennett was the love of her life; and she his. However they would never reconcile romantically. Sennett did convince Normand to create her own production company \"Mabel Normand Film Company\" to make her own features. The first project was \"Mickey\" and Sennett's handling of her business affairs resulted in the film not being released until 1918 (or having a definite version). Normand dissolved the company and signed with Goldwyn where she went on to make comedy features. These movies would be more akin to sitcoms: they were shorter than a lot of features, but still features. Many are lost though several have turned up in the past 10 years. Normand once again signed with Sennett to make features and this would result in her final feature films. However this would be a rocky venture. Normand's health was hit or miss (she had been diagnosed with tuberculosis when she was 10) and seemed to be worse than better. She also was drinking heavily. In 1922 her friend William Desmond Taylor was murdered. This case would become 'the case of the century' and became a media circus, it is still unsolved. Though Normand was cleared (she had been seen leaving his house with him waving goodbye to her; she was likely the last person to see him alive), the association left an unwelcome tarnish on her soon after the scandalous death of her friend Olive Thomas, and the unfair trial of Roscoe Arbuckle. Normand continued working, making The Extra Girl. Soon after its release in 1923 she was again near another crime (a butler was shot at a party she attended; though he survived.) Soon after Normand took a break from film. By 1926 Normand was ready for a comeback. She signed with Hal Roach to make comedy shorts. These were well received and by 1928 she had signed with the William Morris Agency to make talkies. However she did not realize how sick she was and her health soon interrupted these plans. Over the years Normand's tuberculosis has turned into rumors of a drug addiction. This started during the Taylor scandal when it was claimed that maybe he had been killed for interrupting a drug ring, and maybe Normand was part of it. While not prominent during her life it has become more commonly believed as time has passed despite no evidence. Normand's family, estate and personal nurse were all adamant she had never used any drugs. Sadly this rumor has become common place in Hollywood lore. Normand's drinking increased as did her partying. During one party she decided to marry longtime friend Lew Cody at 2am. She instantly regretted the marriage and they continued living separately. As Normand's health decreased and she was committed to a sanitarium (akin to a hospital/hospice in modern terms) by 1929. She died in 1930 from tuberculosis.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzI3ODI3Nl5BMl5BanBnXkFtZTgwMDAxMTkzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0635667","name":"Mabel Normand","nicknames":["Madcap Mabel","Keystone Mabel"],"idIMDB":"nm0635667"},"actorId":"nm0635667","character":"Mabel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Chaplin","urlProfile":"http://www.imdb.com/name/nm0000122","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDcwMDc0ODAzOF5BMl5BanBnXkFtZTgwNTY2OTI1MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1889","placeOfBirth":" Walworth, London, England, UK","birthName":"Charles Spencer Chaplin","height":"5' 5\" (1.65 m)","bio":"Considered to be one of the most pivotal stars of the early days of Hollywood, Charlie Chaplin lived an interesting life both in his films and behind the camera. He is most recognized as an icon of the silent film era, often associated with his popular character, the Little Tramp; the man with the toothbrush mustache, bowler hat, bamboo cane, and a funny walk. Charles Spencer Chaplin was born in Walworth, London, England on April 16, 1889, to Hannah Harriet Pedlingham (Hill) and Charles Chaplin, both music hall performers, who were married on June 22, 1885. After Charles Sr. separated from Hannah to perform in New York City, Hannah then tried to resurrect her stage career. Unfortunately, her singing voice had a tendency to break at unexpected moments. When this happened, the stage manager spotted young Charlie standing in the wings and led him on stage, where five-year-old Charlie began to sing a popular tune. Charlie and his half-brother, Syd Chaplin spent their lives in and out of charity homes and workhouses between their mother's bouts of insanity. Hannah was committed to Cane Hill Asylum in May 1903 and lived there until 1921, when Chaplin moved her to California. Chaplin began his official acting career at the age of eight, touring with the Eight Lancashire Lads. At age 18, he began touring with Fred Karno's vaudeville troupe, joining them on the troupe's 1910 United States tour. He traveled west to California in December 1913 and signed on with Keystone Studios' popular comedy director Mack Sennett, who had seen Chaplin perform on stage in New York. Charlie soon wrote his brother Syd, asking him to become his manager. While at Keystone, Chaplin appeared in and directed 35 films, starring as the Little Tramp in nearly all. In November 1914, he left Keystone and signed on at Essanay, where he made 15 films. In 1916, he signed on at Mutual and made 12 films. In June 1917, Chaplin signed up with First National Studios, after which he built Chaplin Studios. In 1919, he and Douglas Fairbanks, Mary Pickford and D.W. Griffith formed United Artists (UA). Chaplin's life and career was full of scandal and controversy. His first big scandal was during World War I, during which time his loyalty to England, his home country, was questioned. He had never applied for American citizenship, but claimed that he was a \"paying visitor\" to the United States. Many British citizens called Chaplin a coward and a slacker. This and his other career eccentricities sparked suspicion with FBI chief J. Edgar Hoover and the House Un-American Activities Committee (HUAC), who believed that he was injecting Communist propaganda into his films. Chaplin's later film The Great Dictator (1940), which was his first \"talkie\", also created a stir. In the film, Chaplin plays a humorous caricature of Adolf Hitler. Some thought the film was poorly done and in bad taste. However, the film grossed over $5 million and earned five Academy Award Nominations. Another scandal occurred when Chaplin briefly dated 22-year-old Joan Barry. However, Chaplin's relationship with Barry came to an end in 1942, after a series of harassing actions from her. In May 1943, Barry returned to inform Chaplin that she was pregnant and filed a paternity suit, claiming that the unborn child was his. During the 1944 trial, blood tests proved that Chaplin was not the father, but at the time, blood tests were inadmissible evidence and he was ordered to pay $75 a week until the child turned 21. Chaplin was also scrutinized for his support in aiding the Russian struggle against the invading Nazis during World War II, and the United States government questioned his moral and political views, suspecting him of having Communist ties. For this reason, HUAC subpoenaed him in 1947. However, HUAC finally decided that it was no longer necessary for him to appear for testimony. Conversely, when Chaplin and his family traveled to London for the premier of Limelight (1952), he was denied re-entry to the United States. In reality, the government had almost no evidence to prove that he was a threat to national security. Instead, he and his wife decided to settle in Switzerland. Chaplin was married four times and had a total of 11 children. In 1918, he married Mildred Harris and they had a son together, Norman Spencer Chaplin, who only lived three days. Chaplin and Mildred were divorced in 1920. He married Lita Grey in 1924, who had two sons, Charles Chaplin Jr. and Sydney Chaplin. They were divorced in 1927. In 1936, Chaplin married Paulette Goddard and his final marriage was to Oona O'Neill (Oona Chaplin), daughter of playwright Eugene O'Neill in 1943. Oona gave birth to eight children: Geraldine Chaplin, Michael Chaplin, Josephine Chaplin, Victoria Chaplin, Eugene Chaplin, Jane Chaplin, Annette-Emilie Chaplin and Christopher Chaplin. In contrast to many of his boisterous characters, Chaplin was a quiet man who kept to himself a great deal. He also had an \"un-millionaire\" way of living. Even after he had accumulated millions, he continued to live in shabby accommodations. In 1921, Chaplin was decorated by the French government for his outstanding work as a filmmaker, and was elevated to the rank of Officer of the Legion of Honor in 1952. In 1972, he was honored with an Academy Award for his \"incalculable effect in making motion pictures the art form of the century.\" He was appointed Knight Commander of the Order of the British Empire in the 1975 New Years Honours List. No formal reason for the honour was listed. The citation simply reads \"Charles Spencer Chaplin, Film Actor and Producer\". Chaplin's other works included musical scores he composed for many of his films. He also authored two autobiographical books, \"My Autobiography\" (1964) and its companion volume, \"My Life in Pictures\" (1974). Chaplin died at age 88 of natural causes on December 25, 1977 at his home in Vevey, Switzerland. His funeral was a small and private Anglican ceremony according to his wishes. In 1978, Chaplin's corpse was stolen from its grave and was not recovered for three months; he was re-buried in a vault surrounded by cement. Six of Chaplin's films have been selected for preservation in the National Film Registry by the United States Library of Congress: The Immigrant (1917), The Kid (1921), The Gold Rush (1925), City Lights (1931), Modern Times (1936) and The Great Dictator (1940). Charlie Chaplin was considered one of the greatest filmmakers in the history of American cinema, whose movies were and still are popular throughout the world, and have even gained notoriety as time progresses. His films show, through the Little Tramp's positive outlook on life in a world full of chaos, that the human spirit has and always will remain the same.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDcwMDc0ODAzOF5BMl5BanBnXkFtZTgwNTY2OTI1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000122","name":"Charles Chaplin","nicknames":["Charlie","Charlot","The Little Tramp"],"idIMDB":"nm0000122"},"actorId":"nm0000122","character":"Drunk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chester Conklin","urlProfile":"http://www.imdb.com/name/nm0174682","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MjgzMzAyMV5BMl5BanBnXkFtZTgwODczNjMwNDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1886","placeOfBirth":" Oskaloosa, Iowa, USA","birthName":"Chester Cooper Conklin","height":"5' 5\" (1.65 m)","bio":"Iowa-born Chester Conklin was raised in a coal-mining area by a devoutly religious father who hoped that his son would go into the ministry. However, Chester got the performing bug one day when he gave a recitation at a community singing festival and won first prize. Knowing his father would never approve of his desire to become a comedian, he left home. One night in St. Louis he caught a vaudeville act by the famous team of Joe Weber and Lew Fields, who were doing what was called at the time a \"German\" act. Conklin thought that he could do that act himself, and better, so he decided to develop a character patterned after his boss at the time, a Dutch baker named Schultz. Schultz had a thick accent and a very brushy \"walrus\"-type mustache, which Conklin appropriated for his new character. He managed to break into vaudeville with this act and spent several years on tour with various stock companies. Eventually he secured a job as a clown with a traveling circus. After seeing several of Mack Sennett's Keystone Kops shorts in theaters, Conklin went to the Sennett studio and applied for a job there. Sennett hired him as a Keystone Kop (at $3 a day). He stayed with Sennett for six years, and became famous for his pairing with burly comic Mack Swain in a series of \"Ambrose and Walrus\" shorts and appeared in several of Charles Chaplin's shorts for the studio (Chaplin adapted Conklin's \"walrus\" mustache as part of the costume for his \"Little Tramp\" character). Conklin was approached by Fox Films to do a series of comedy shorts, and when Sennett refused to match the offer Fox made, Conklin left Sennett and signed with Fox. He stayed with Fox for several years, then freelanced for several independent producers in a series of comedy shorts. Conklin worked steadily into the sound era, and retired from the screen in 1966. His last movie was the well-received Western comedy A Big Hand for the Little Lady (1966), in which his character was named \"Chester.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MjgzMzAyMV5BMl5BanBnXkFtZTgwODczNjMwNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0174682","name":"Chester Conklin","nicknames":["Chet"],"idIMDB":"nm0174682"},"actorId":"nm0174682","character":"Husband","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alice Davenport","urlProfile":"http://www.imdb.com/name/nm0202562","urlPhoto":"","biography":{"dateOfBirth":"29 February 1864","placeOfBirth":" New York City, New York, USA","birthName":"Alice Shepard","bio":"Alice was a silent screen comedic actress. She worked in a number of Keystone films and also appeared in the early films that Chaplin did. Other actors that Alice worked with who went on to become big stars were Mabel Normand and Marie Dressler. Alice was married and divorced from Broadway actor Harry Davenport. Alice was the mother of Dorothy Davenport who was married to Paramount matinee idol Wallace Reid.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0202562","name":"Alice Davenport","idIMDB":"nm0202562"},"actorId":"nm0202562","character":"Wife","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harry McCoy","urlProfile":"http://www.imdb.com/name/nm0566745","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjBiOTNiYTItMDgyZS00NzdhLThlOTItMmJhNzQ0ZjlkYmY1XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1889","placeOfBirth":" Philadelphia, Pennsylvania, USA","bio":"Harry McCoy was born on December 10, 1889 in Philadelphia, Pennsylvania, USA. He was an actor and writer, known for Hot Paprika (1935), His One Night Stand (1917) and Midnight Daddies (1930). He died on September 1, 1937 in Hollywood, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjBiOTNiYTItMDgyZS00NzdhLThlOTItMmJhNzQ0ZjlkYmY1XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0566745","name":"Harry McCoy","idIMDB":"nm0566745"},"actorId":"nm0566745","character":"Mabel's Admirer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0004284","urlIMDB":"http://www.imdb.com/title/tt0004284","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["17 min"],"soundMix":["Silent"],"color":["Black and White"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":["292 m (1 reel)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.6","filmingLocations":[],"awards":[],"votes":"950","type":"Movie","companyCreditsSimple":[{"idCompany":"co0040700","name":"Keystone Film Company"}],"keywords":{"keywords":["title directed by female","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:27:24"}}