{"data":{"movies":[{"title":"Le mystère du triangle des Bermudes","originalTitle":"The Bermuda Triangle","year":"1978","releaseDate":"19780414","directors":[{"name":"René Cardona Jr.","id":"nm0136552"}],"writers":[{"name":"Charles Berlitz","id":"nm0075688"},{"name":"René Cardona Jr.","id":"nm0136552"}],"runtime":"112 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGY1MTg4ZTEtOWQwYS00YWEzLWJjODAtYWFiZGMwNzIzMDJhXkEyXkFqcGdeQXVyMTQ2MjQyNDc@._V1.jpg","countries":["Mexico"],"languages":["English"],"genres":["Horror","Sci-Fi","Mystery"],"plot":"The passengers and crew of a boat on a summer cruise in the Caribbean stray near the famed Bermuda Triangle, and mysterious things start happening.","simplePlot":"The passengers and crew of a boat on a summer cruise in the Caribbean stray near the famed Bermuda Triangle, and mysterious things start happening.","actors":[{"actorName":"John Huston","urlProfile":"http://www.imdb.com/name/nm0001379","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0OTcyMDcxMF5BMl5BanBnXkFtZTcwNDY0MjE3Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1906","placeOfBirth":" Nevada, Missouri, USA","birthName":"John Marcellus Huston","height":"6' 1\" (1.85 m)","bio":"An eccentric rebel of epic proportions, this Hollywood titan reigned supreme as director, screenwriter and character actor in a career that endured over five decades. The ten-time Oscar-nominated legend was born John Marcellus Huston in Nevada, Missouri, on August 5, 1906. His ancestry included English, Scottish, and Scots-Irish. The age-old story goes that the small town of his birth was won by John's grandfather in a poker game. John's father was the equally magnanimous character actor Walter Huston, and his mother, Rhea Gore, was a newspaperwoman who traveled around the country looking for stories. The only child of the couple, John began performing on stage with his vaudevillian father at age 3. Upon his parents' divorce at age 7, the young boy would take turns traveling around the vaudeville circuit with his father and the country with his mother on reporting excursions. A frail and sickly child, he was once placed in a sanitarium due to both an enlarged heart and kidney ailment. Making a miraculous recovery, he quit school at age 14 to become a full-fledged boxer and eventually won the Amateur Lightweight Boxing Championship of California, winning 22 of 25 bouts. His trademark broken nose was the result of that robust activity. John married his high school sweetheart, Dorothy Harvey, and also took his first professional stage bow with a leading role off-Broadway entitled \"The Triumph of the Egg.\" He made his Broadway debut that same year with \"Ruint\" on April 7, 1925, and followed that with another Broadway show \"Adam Solitaire\" the following November. John soon grew restless with the confines of both his marriage and acting and abandoned both, taking a sojourn to Mexico where he became an officer in the cavalry and expert horseman while writing plays on the sly. Trying to control his wanderlust urges, he subsequently returned to America and attempted newspaper and magazine reporting work in New York by submitting short stories. He was even hired at one point by mogul Samuel Goldwyn Jr. as a screenwriter, but again he grew restless. During this time he also appeared unbilled in a few obligatory films. By 1932 John was on the move again and left for London and Paris where he studied painting and sketching. The promising artist became a homeless beggar during one harrowing point. Returning again to America in 1933, he played the title role in a production of \"Abraham Lincoln,\" only a few years after father Walter portrayed the part on film for D.W. Griffith. John made a new resolve to hone in on his obvious writing skills and began collaborating on a few scripts for Warner Brothers. He also married again. Warners was so impressed with his talents that he was signed on as both screenwriter and director for the Dashiell Hammett mystery yarn The Maltese Falcon (1941). The movie classic made a superstar out of Humphrey Bogart and is considered by critics and audiences alike--- 65 years after the fact--- to be the greatest detective film ever made. In the meantime John wrote/staged a couple of Broadway plays, and in the aftermath of his mammoth screen success directed bad-girl 'Bette Davis (I)' and good girl Olivia de Havilland in the film melodrama In This Our Life (1942), and three of his \"Falcon\" stars (Bogart, Mary Astor and Sydney Greenstreet) in the romantic war picture Across the Pacific (1942). During WWII John served as a Signal Corps lieutenant and went on to helm a number of film documentaries for the U.S. government including the controversial Let There Be Light (1946), which father Walter narrated. The end of WWII also saw the end of his second marriage. He married third wife Evelyn Keyes, of \"Gone With the Wind\" fame, in 1946 but it too lasted a relatively short time. That same year the impulsive and always unpredictable Huston directed Jean-Paul Sartre's experimental play \"No Exit\" on Broadway. The show was a box-office bust (running less than a month) but nevertheless earned the New York Drama Critics Award as \"best foreign play.\" Hollywood glory came to him again in association with Bogart and Warner Brothers'. The Treasure of the Sierra Madre (1948), a classic tale of gold, greed and man's inhumanity to man set in Mexico, won John Oscars for both director and screenplay and his father nabbed the \"Best Supporting Actor\" trophy. John can be glimpsed at the beginning of the movie in a cameo playing a tourist, but he wouldn't act again on film for a decade and a half. With the momentum in his favor, John hung around in Hollywood this time to write and/or direct some of the finest American cinema made including Key Largo (1948) and The African Queen (1951) (both with Bogart), The Asphalt Jungle (1950), The Red Badge of Courage (1951) and Moulin Rouge (1952). Later films, including Moby Dick (1956), The Unforgiven (1960), The Misfits (1961), Freud (1962), The Night of the Iguana (1964) and The Bible: In the Beginning... (1966) were, for the most part, well-regarded but certainly not close to the level of his earlier revered work. He also experimented behind-the-camera with color effects and approached topics that most others would not even broach, including homosexuality and psychoanalysis. An ardent supporter of human rights, he, along with director William Wyler and others, dared to form the Committee for the First Amendment in 1947, which strove to undermine the House Un-American Activities Committee. Disgusted by the Hollywood blacklisting that was killing the careers of many talented folk, he moved to St. Clerans in Ireland and became a citizen there along with his fourth wife, ballet dancer Enrica (Ricki) Soma. The couple had two children, including daughter Anjelica Huston who went on to have an enviable Hollywood career of her own. Huston and wife Ricki split after a son (director Danny Huston) was born to another actress in 1962. They did not divorce, however, and remained estranged until her sudden death in 1969 in a car accident. John subsequently adopted his late wife's child from another union. The ever-impulsive Huston would move yet again to Mexico where he married (1972) and divorced (1977) his fifth and final wife, Celeste Shane. Huston returned to acting auspiciously with a major role in Otto Preminger's epic film The Cardinal (1963) for which Huston received an Oscar nomination at age 57. From that time forward, he would be glimpsed here and there in a number of colorful, baggy-eyed character roles in both good and bad (some positively abysmal) films that, at the very least, helped finance his passion projects. The former list included outstanding roles in Chinatown (1974) and The Wind and the Lion (1975), while the latter comprised of hammy parts in such awful drek as Candy (1968) and Myra Breckinridge (1970). Directing daughter Angelica in her inauspicious movie debut, the thoroughly mediocre A Walk with Love and Death (1969), John made up for it 15 years later by directing her to Oscar glory in the mob tale Prizzi's Honor (1985). In the 1970s Huston resurged as a director of quality films with Fat City (1972), The Man Who Would Be King (1975) and Wise Blood (1979). He ended his career on a high note with Au-dessous du volcan (1984), the afore-mentioned Prizzi's Honor (1985) and The Dead (1987). His only certifiable misfire during that era was the elephantine musical version of Annie (1982), though it later became somewhat of a cult favorite among children. Huston lived the macho, outdoors life, unencumbered by convention or restrictions, and is often compared in style or flamboyancy to an Ernest Hemingway or Orson Welles. He was, in fact, the source of inspiration for Clint Eastwood in the helming of the film White Hunter Black Heart (1990) which chronicled the making of \"The African Queen.\" Illness robbed Huston of a good portion of his twilight years with chronic emphysema the main culprit. As always, however, he continued to work tirelessly while hooked up to an oxygen machine if need be. At the end, the living legend was shooting an acting cameo in the film Mr. North (1988) for his son Danny, making his directorial bow at the time. John became seriously ill with pneumonia and died while on location at the age of 81. This maverick of a man's man who was once called \"the eccentric's eccentric\" by Paul Newman, left an incredibly rich legacy of work to be enjoyed by film lovers for centuries to come.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0OTcyMDcxMF5BMl5BanBnXkFtZTcwNDY0MjE3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001379","name":"John Huston","idIMDB":"nm0001379"},"actorId":"nm0001379","character":"Edward","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrés García","urlProfile":"http://www.imdb.com/name/nm0305955","urlPhoto":"","biography":{"dateOfBirth":"24 May 1941","placeOfBirth":" Santo Domingo, Dominican Republic","bio":"Handsome and muscular leading man who made his screen debut in _Chanoc (1966)_. Born in Dominican Republic from Spanish parents who relocated to Mexico, García was a leading sex symbol from the late '60s into the '80s. He won a well-publicized bout with cancer in the '90s by -- it is claimed -- using an herbal remedy. His sons Andrés García Jr. and Leonardo García Vale are also actors. Nominated for a Best Supporting Actor Ariel in 1974 for _Principio, El (1972)_. Over the past decade, García has dedicated most of his time to soap operas.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0305955","name":"Andrés García","idIMDB":"nm0305955"},"actorId":"nm0305955","character":"Alan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hugo Stiglitz","urlProfile":"http://www.imdb.com/name/nm0830153","urlPhoto":"","biography":{"dateOfBirth":"28 August 1940","placeOfBirth":" Mexico City, Distrito Federal, Mexico","height":"6' 4\" (1.93 m)","bio":"Hugo Stiglitz was born on August 28, 1940 in Mexico City, Distrito Federal, Mexico. He is an actor and producer, known for Instructions Not Included (2013), Señorita Pólvora (2015) and Nightmare City (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0830153","name":"Hugo Stiglitz","idIMDB":"nm0830153"},"actorId":"nm0830153","character":"Capt. Mark Briggs","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gloria Guida","urlProfile":"http://www.imdb.com/name/nm0346708","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwZGMyMTQtZWIzZC00ZDQ5LWEwMTYtYThhZTA2YjM5YzY1L2ltYWdlXkEyXkFqcGdeQXVyMjU5OTg5NDc@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1955","placeOfBirth":" Merano, Trentino-Alto Adige, Italy","height":"5' 7\" (1.7 m)","bio":"Lovely and shapely blonde bombshell Gloria Guida was born into a family of Emilia-Romagna origin on November 19, 1955 in Merano, Trentino-South Tyrol, Italy. Guida moved with her family to Bologna when she was a child. Gloria started out in the entertainment business as a singer at her father's dancing place on the Romagna Riviera. Guida then embarked on a modeling career and was named Miss Teenage Italy in 1974. Gloria subsequently went on to star primarily in a slew of racy and playful Italian sex comedies made throughout the 1970's. Guida married actor and singer Johnny Dorelli on May 15, 1991. She's the mother of a daughter, Guendalina.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwZGMyMTQtZWIzZC00ZDQ5LWEwMTYtYThhZTA2YjM5YzY1L2ltYWdlXkEyXkFqcGdeQXVyMjU5OTg5NDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0346708","name":"Gloria Guida","idIMDB":"nm0346708"},"actorId":"nm0346708","character":"Michelle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marina Vlady","urlProfile":"http://www.imdb.com/name/nm0900557","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MDUyODU5NV5BMl5BanBnXkFtZTcwNTczMzcxNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 May 1938","placeOfBirth":" Clichy, Hauts-de-Seine, Île-de-France, France","birthName":"Marina Catherine De Poliakoff-Baidarov","bio":"She had the makings of a blonde bombshell and could have ended up in film history annals as merely a second-rate Brigitte Bardot, but sex symbol Marina Vlady proved she was capable of much more. In her prime she was nominated for a Golden Globe and won a \"Best Actress\" award at the 1963 Cannes Film Festival for her stunning performance in The Conjugal Bed (1963) [The Conjugal Bed] with Italy's Ugo Tognazzi. This provocative sex-kitten was born Marina De Poliakoff-Baïdaroff,in Clichy, France on May 10, 1938, the youngest of four acting sisters. Her Russian-born father was a well-established painter in France. While young Marina trained in dance and initially seemed to entertain thoughts of becoming a prima ballerina. But, like her sisters, she discovered a closer kinship to acting. The most outgoing of her siblings, Monica caught the eye of talent agents via more uninhibited roles. Older sister Odile Versois, who possessed a similar feline beauty, was the first of her family to enter pictures. Marina (playing a youthful roller-skater) and another sister Olga made their minor film debuts in Orage d'été (1949) [Summer Storm], which featured Odile. In 1955, at the ripe young age of 17, Marina met and married director/writer/actor Robert Hossein, who featured her prominently and seductively in a number of his films including The Wicked Go to Hell (1955) [The Wicked Go to Hell], as a femme fatale bent on revenge, Pardonnez nos offenses (1956), Double Agents (1959) [Double Agents] and, notably, Night Is Not for Sleep (1958) [Nude in a White Car], which co-starred sister Odile. She had two sons by Hossein but the marriage lasted only a few years. Gracing both French and Italian productions throughout most of her career, Marina was not shy at playing unsympathetic, even caustic characters, and proved adept at both saucy comedy and edgy drama, appearing for such notable directors as Jean-Luc Godard and Christian-Jaque. Playing opposite some of Europe's finest leading men, she was a vision in loveliness alongside Marcello Mastroianni in Black Feathers (1952) [Black Feathers], a touching WWII drama, she also co-starred with Italy's top character actor Aldo Fabrizi in Too Young for Love (1953) [Too Young for Love]. One of her rare English-speaking appearances came with Orson Welles' Chimes at Midnight (1965) [Chimes at Midnight]. Her later years included much TV. Married four times, Vlady was the widow of heralded Russian poet/songwriter/actor Vladimir Vysotskiy who allegedly died of heart failure in 1980 at the age 42 after years of alcohol and drug abuse. Her fourth husband passed away in 2003.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MDUyODU5NV5BMl5BanBnXkFtZTcwNTczMzcxNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0900557","name":"Marina Vlady","nicknames":["\"Miss Body\" of 1960."],"idIMDB":"nm0900557"},"actorId":"nm0900557","character":"Kim","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Claudine Auger","urlProfile":"http://www.imdb.com/name/nm0000805","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NDQwOTg1OV5BMl5BanBnXkFtZTYwOTU0ODgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1941","placeOfBirth":" Paris, France","birthName":"Claudine Oger","height":"5' 8\" (1.73 m)","bio":"Claudine Auger, a former Miss France (1958), received her dramatic training at the Paris Drama Conservatory and is best known to US / UK audiences as the stunning brunette \"Domino\" opposite Sean Connery in the James Bond thriller Thunderball (1965), She has kept fairly busy since her Bond days, acting in a number of Italian, French and Spanish films including Le mystère du triangle des Bermudes (1978), Credo (1983), and La bocca (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NDQwOTg1OV5BMl5BanBnXkFtZTYwOTU0ODgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000805","name":"Claudine Auger","idIMDB":"nm0000805"},"actorId":"nm0000805","character":"Sybil","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"René Cardona III","urlProfile":"http://www.imdb.com/name/nm0136551","urlPhoto":"","biography":{"bio":"René Cardona III is a director and actor, known for Vacaciones de terror (1989), Keiko en peligro (1990) and Serafín: La película (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0136551","name":"René Cardona III","idIMDB":"nm0136551"},"actorId":"nm0136551","character":"Dave","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carlos East","urlProfile":"http://www.imdb.com/name/nm0247513","urlPhoto":"","biography":{"dateOfBirth":"22 September 1942","placeOfBirth":" Orizaba, Veracruz, Mexico","birthName":"Carlos Eduardo East","height":"6' 1\" (1.85 m)","bio":"Carlos East was born on September 22, 1942 in Orizaba, Veracruz, Mexico as Carlos Eduardo East. He was an actor, known for Isle of the Snake People (1971), Fear Chamber (1968) and El diabólico (1977). He died on October 11, 1994 in Mexico City, Mexico.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0247513","name":"Carlos East","idIMDB":"nm0247513"},"actorId":"nm0247513","character":"Peter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gretha","urlProfile":"http://www.imdb.com/name/nm1411188","urlPhoto":"","biography":{"bio":"Gretha is an actress, known for Le mystère du triangle des Bermudes (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1411188","name":"Gretha","idIMDB":"nm1411188"},"actorId":"nm1411188","character":"Diana","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Catherine Piaget","urlProfile":"http://www.imdb.com/name/nm1412894","urlPhoto":"","biography":{"bio":"Catherine Piaget is an actress, known for Le mystère du triangle des Bermudes (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1412894","name":"Catherine Piaget","idIMDB":"nm1412894"},"actorId":"nm1412894","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mario Arévalo","urlProfile":"http://www.imdb.com/name/nm0038252","urlPhoto":"","biography":{"bio":"Mario Arévalo is an actor and director, known for Salvador (1986), Firewalker (1986) and Au-dessous du volcan (1984).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0038252","name":"Mario Arévalo","idIMDB":"nm0038252"},"actorId":"nm0038252","character":"Tony, crew member","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jorge Zamora","urlProfile":"http://www.imdb.com/name/nm0952692","urlPhoto":"","biography":{"dateOfBirth":"19 April 1928","placeOfBirth":" Havana, Cuba","birthName":"Jorge Zamora Montalvo","bio":"Jorge Zamora was born on April 19, 1928 in Havana, Cuba as Jorge Zamora Montalvo. He is an actor, known for Romancing the Stone (1984), Chispas de chocolate (1986) and Las aventuras del guardían (1963).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0952692","name":"Jorge Zamora","idIMDB":"nm0952692"},"actorId":"nm0952692","character":"Simon, the cook","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adalberto Arvizu","urlProfile":"http://www.imdb.com/name/nm0038131","urlPhoto":"","biography":{"bio":"Adalberto Arvizu is an actor, known for Siete en la mira (1984), Reclusorio (1997) and El barrendero (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0038131","name":"Adalberto Arvizu","idIMDB":"nm0038131"},"actorId":"nm0038131","character":"Pilot","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Miguel Ángel Fuentes","urlProfile":"http://www.imdb.com/name/nm0297450","urlPhoto":"","biography":{"bio":"Miguel Ángel Fuentes is an actor, known for Fitzcarraldo (1982), Herod's Law (1999) and The Mexican (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0297450","name":"Miguel Ángel Fuentes","idIMDB":"nm0297450"},"actorId":"nm0297450","character":"Gordon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrés García Jr.","urlProfile":"http://www.imdb.com/name/nm0305708","urlPhoto":"","biography":{"dateOfBirth":"1 September 1968","placeOfBirth":" Mexico","height":"6' 1½\" (1.87 m)","bio":"Andrés García Jr. was born on September 1, 1968 in Mexico. He is an actor, known for El Rostro de Analía (2008), Les épices de la passion (1992) and The Sins of Others (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0305708","name":"Andrés García Jr.","idIMDB":"nm0305708"},"actorId":"nm0305708","character":"Billy","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0078417","urlIMDB":"http://www.imdb.com/title/tt0078417","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":[{"money":null,"country":null,"day":"06","month":"06","year":"1977","remarks":null},{"money":null,"country":null,"day":"20","month":"07","year":"1977","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 52 min (112 min) (USA)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.78 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"4.5","filmingLocations":[{"location":"Cozumel, Quintana Roo, Mexico"}],"awards":[],"votes":"661","type":"Movie","companyCreditsSimple":[{"idCompany":"co0043105","name":"Corporación Nacional Cinematográfica (CONACINE)"},{"idCompany":"co0051022","name":"Productora Filmica Real"},{"idCompany":"co0011540","name":"Nucleo Internazionale"}],"keywords":{"keywords":["bermuda triangle","cruise","bermuda","actual animal killed","throat slitting","wetsuit","scuba","family relationships","ocean","storm","dead girl","radio","cruise ship","ship","shark","based on book"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:23:52"}}