{"data":{"movies":[{"title":"The Big Boss","originalTitle":"Tang shan da xiong","year":"1971","releaseDate":"198102","directors":[{"name":"Wei Lo","id":"nm0516344"},{"name":"Chia-Hsiang Wu","id":"nm0156927"}],"writers":[{"name":"Wei Lo","id":"nm0516344"}],"runtime":"99 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDk2MjM0NTI1MF5BMl5BanBnXkFtZTgwMzgzNjc0ODE@._V1.jpg","countries":["Hong Kong"],"languages":["Mandarin","Cantonese"],"genres":["Action","Crime","Drama","Thriller"],"plot":"Chein is a city boy who moves with his cousins to work at a ice factory. He does this with a family promise never to get involved in any fight. However, when members of his family begin disappearing after meeting the management of the factor, the resulting mystery and pressures forces him to break that vow and take on the villainy of the Big Boss.","simplePlot":"A young man sworn to an oath of non-violence works with his cousins in an ice factory where they mysteriously begin to disappear.","actors":[{"actorName":"Bruce Lee","urlProfile":"http://www.imdb.com/name/nm0000045","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTg4NDkzMV5BMl5BanBnXkFtZTYwMjU4Nzc2._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 November 1940","placeOfBirth":" San Francisco, California, USA","birthName":"Lee Jun Fan","height":"5' 7½\" (1.71 m)","bio":"Bruce Lee remains the greatest icon of martial arts cinema and a key figure of modern popular media. Had it not been for Bruce Lee and his movies in the early 1970s, it's arguable whether or not the martial arts film genre would have ever penetrated and influenced mainstream North American and European cinema and audiences the way it has over the past four decades. The influence of East Asian martial arts cinema can be seen today in so many other film genres including comedies, action, drama, science fiction, horror and animation.....and they all have their roots in the phenomenon that was Bruce Lee. Lee was born \"Lee Jun Fan\" November twenty-seventh 1940 in San Francisco, the son of Lee Hoi Chuen, a singer with the Cantonese Opera. Approximately one year later the family returned to Kowloon in Hong Kong and at the age of five years, a young Bruce begins appearing in children's roles in minor films including The Birth of Mankind (1946) and Fu gui fu yun (1948). At the age of 12, Bruce commenced attending La Salle College. Bruce was later beaten up by a street gang, which inspired him to take up martial arts training under the tutelage of \"Sifu Yip Man\" who schooled Bruce in wing chun kung fu for a period of approximately five years. This was the only formalized martial arts training ever undertaken by Lee. The talented & athletic Bruce also took up cha-cha dancing and, at the age of 18, won a major dance championship in Hong Kong. However, his temper and quick fists got him in trouble with the Hong Kong police on numerous occasions. His parents suggested that he head off to the United States. Lee landed in San Francisco's Chinatown in 1959 and worked in a close relative's restaurant. He eventually made his way to Seattle, Washington, where he enrolled at university to study philosophy and found the time to practice his beloved kung fu techniques. In 1963, Lee met Linda Lee Cadwell (aka Linda Emery) (later his wife) and also opened his first kung fu school at 4750 University Way. During the early half of the 1960s, Lee became associated with many key martial arts figures in the USA, including kenpo karate expert Ed Parker and tae kwon do master Jhoon Rhee. He made guest appearances at notable martial arts events including the Long Beach Nationals. Through one of these tournaments Bruce met Hollywood hair-stylist Jay Sebring who introduced him to T.V. producer William Dozier. Based on the runaway success of Batman (1966), Dozier was keen to bring the cartoon character of The Green Hornet to T.V. and was on the lookout for an East Asian actor to play the Green Hornet's sidekick, Kato. Around this time Bruce also opened a second kung fu school in Oakland, California and relocated to Oakland to be closer to Hollywood. Bruce's screen test was successful, and The Green Hornet (1966) starring Van Williams aired in 1966 with mixed success. His fight scenes were sometimes obscured by unrevealing camera angles, but his dedication was such that he insisted his character behave like a perfect bodyguard, keeping his eyes on whoever might be a threat to his employer except when the script made this impossible. The show was surprisingly terminated after only one season (twenty-six episodes), but by this time Lee was receiving more fan mail than the show's nominal star. He then opened a third branch of his kung fu school in Los Angeles and began providing personalized martial arts training to celebrities including film stars Steve McQueen and James Coburn as well as screenwriter Stirling Silliphant. In addition he refined his prior knowledge of wing chun and incorporated aspects of other fighting styles such as traditional boxing and Okinawan karate. He also developed his own unique style \"Jeet Kune Do\" (Way of the Intercepting Fist). Another film opportunity then came his way as he landed the small role of a stand over man named \"Winslow Wong\" who intimidates private eye James Garner in Marlowe (1969). Wong pays a visit to Garner and proceeds to demolish the investigator's office with his fists and feet, finishing off with a spectacular high kick that shatters the light fixture. With this further exposure of his talents, Bruce then scored several guest appearances as a martial arts instructor to blind private eye James Franciscus on the TV series Longstreet (1971). With his minor success in Hollywood and money in his pocket, Bruce returned for a visit to Hong Kong and was approached by film producer Raymond Chow who had recently started \"Golden Harvest\" productions. Chow was keen to utilize Lee's strong popularity amongst young Chinese fans, and offered him the lead role in The Big Boss (1971), (aka \"The Big Boss\", aka Fists Of Fury\"). In it, Lee plays a distant cousin coming to join relatives working at an ice house, where murder, corruption, and drug-running lead to his character's adventures and display of Kung-Fu expertise. The film was directed by Wei Lo, shot in Thailand on a very low budget and in terrible living conditions for cast and crew. However, when it opened in Hong Kong the film was an enormous hit. Chow knew he had struck box office gold with Lee and quickly assembled another script entitled The Chinese Connection (1972) (aka \"Fist Of Fury\", aka \"The Chinese Connection\"). The second film (with a slightly bigger budget) was again directed by Wei Lo and was set in Shanghai in the year 1900, with Lee returning to his school to find that his beloved master has been poisoned by the local Japanese karate school. Once again he uncovers the evil-doers and sets about seeking revenge on those responsible for murdering his teacher and intimidating his school. The film features several superb fight sequences and, at the film's conclusion, Lee refuses to surrender to the Japanese law and seemingly leaps to his death in a hail of police bullets. Once more, Hong Kong streets were jammed with thousands of fervent Chinese movie fans who could not get enough of the fearless Bruce Lee, and his second film went on to break the box office records set by the first! Lee then set up his own production company, Concord Productions, and set about guiding his film career personally by writing, directing and acting in his next film, The Way of the Dragon (1972) (aka \"Return of The Dragon\"). A bigger budget meant better locations and opponents, with the new film set in Rome, Italy and additionally starring hapkido expert Ing-Sik Whang, karate legend Robert Wall and seven-time U.S. karate champion Chuck Norris. Bruce plays a seemingly simple country boy sent to assist at a cousin's restaurant in Rome and finds his cousins are being bullied by local thugs for protection. By now, Lee's remarkable success in East Asia had come to the attention of Hollywood film executives and a script was hastily written pitching him as a secret agent penetrating an island fortress. Warner Bros. financed the film and also insisted on B-movie tough guy John Saxon starring alongside Lee to give the film wider appeal. The film culminates with another show-stopping fight sequence between Lee and the key villain, Han, in a maze of mirrors. Shooting was completed in and around Hong Kong in early 1973 and in the subsequent weeks Bruce was involved in completing overdubs and looping for the final cut. Various reports from friends and coworkers cite that he was not feeling well during this period and on July twentieth 1973 he lay down at the apartment of actress Betty Ting Pei after taking a head-ache tablet and was later unable to be revived. A doctor was called and Lee was taken to hospital by ambulance and pronounced dead that evening. The official finding was death due to a cerebral edema, caused by a reaction to the head-ache tablet. Fans world-wide were shattered that their virile idol had passed at such a young age, and nearly thirty thousand fans filed past his coffin in Hong Kong. A second, much smaller ceremony was held in Seattle, Washington and Bruce was laid to rest at Lake View Cemetary in Seattle with pall bearers including Steve McQueen, James Coburn and Dan Inosanto. Opération dragon (1973) was later released in the mainland United States, and was a huge hit with audiences there, which then prompted National General films to actively distribute his three prior movies to U.S. theatres... each was a box office smash. Fans throughout the world were still hungry for more Bruce Lee films and thus remaining footage (completed before his death) of Lee fighting several opponents including Dan Inosanto, Hugh O'Brian and Kareem Abdul-Jabbar was crafted into another film titled Le jeu de la mort (1978). The film used a look-alike and shadowy camera work to be substituted for the real Lee in numerous scenes. The film is a poor addition to the line-up and is only saved by the final twenty minutes and the footage of the real Bruce Lee battling his way up the tower. Amazingly this same shoddy process was used to create Game of Death II (1981) (A.K.A. \"Game of Death II\"), with a look-alike and more stunt doubles interwoven with a few brief minutes of footage of the real Bruce Lee. Tragically his son Brandon Lee, an actor and martial artist like his father, was killed in a freak accident on the set of The Crow (1994). Bruce Lee was not only an amazing athlete and martial artist but he possessed genuine superstar charisma and through a handful of films he left behind an indelible impression on the tapestry of modern cinema.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTg4NDkzMV5BMl5BanBnXkFtZTYwMjU4Nzc2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000045","name":"Bruce Lee","idIMDB":"nm0000045"},"actorId":"nm0000045","character":"Cheng Chao-an","urlCharacter":"http://www.imdb.com/character/ch0039046","main":true},{"actorName":"Maria Yi","urlProfile":"http://www.imdb.com/name/nm0947935","urlPhoto":"","biography":{"bio":"Maria Yi is an actress, known for The Big Boss (1971), The Chinese Connection (1972) and Slash: Blade of Death (1971).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0947935","name":"Maria Yi","idIMDB":"nm0947935"},"actorId":"nm0947935","character":"Chow Mei","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Tien","urlProfile":"http://www.imdb.com/name/nm0862875","urlPhoto":"","biography":{"birthName":"James Tien Chun","height":"5' 10\" (1.78 m)","bio":"James Tien was born in Hong Kong, China as James Tien Chun. He is an actor, known for The Chinese Connection (1972), The Big Boss (1971) and La hyène intrépide (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0862875","name":"James Tien","idIMDB":"nm0862875"},"actorId":"nm0862875","character":"Hsiu Chien","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marilyn Bautista","urlProfile":"http://www.imdb.com/name/nm0062531","urlPhoto":"","biography":{"dateOfBirth":"1952","placeOfBirth":" Thailand","bio":"Marilyn Bautista was born in 1952 in Thailand. She is an actress, known for The Big Boss (1971), Bloodfist (1989) and Walang duwag na pilipno (1983).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0062531","name":"Marilyn Bautista","idIMDB":"nm0062531"},"actorId":"nm0062531","character":"Miss Wuman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ying-Chieh Han","urlProfile":"http://www.imdb.com/name/nm0157300","urlPhoto":"","biography":{"dateOfBirth":"1927","placeOfBirth":" Shanghai, China","bio":"When Yin-Chieh Han was 3 years old, he moved to Beijing and from 9 to 18 years old joined a Pekin Opera group. In 1946, he went to Shanghai and debuted in the film industry at 19 years old as stuntman that same year. Next year he left the movies temporarily to do martial arts and circus exhibitions in Hong Kong and Singapore respectively. Later he returned to Hong Kong and joined Shaw Bros. Film Studio as stuntman and later martial arts choreographer. He also played bit parts in his movies. At that moment Han gained a large reputation and met director Wu Kam-Chuen, who asked for him in 1966 when he left Shaw Bros. to go to Taiwan. Han and Wu collaborated in several masterpieces of martial arts genre until 1970, when Han returned to Hong Kong, signing a contract with new film company Golden Harvest. Here he played his most famous evil role, Big Boss in the film with the same title of 1971, directed by Lo Wei, who also collaborated with Han in several famous films. Han worked with the most famous stars of his time and also directed a few films in the 70s. He died of cancer in 1991 at the age of 64.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0157300","name":"Ying-Chieh Han","idIMDB":"nm0157300"},"actorId":"nm0157300","character":"Hsiao Mi","urlCharacter":"http://www.imdb.com/character/ch0237008","main":true},{"actorName":"Tony Liu","urlProfile":"http://www.imdb.com/name/nm0490492","urlPhoto":"","biography":{"dateOfBirth":"7 February 1952","placeOfBirth":" Hong Kong","bio":"Tony Liu was born on February 7, 1952 in Hong Kong. He is an actor and director, known for The Big Boss (1971), The Way of the Dragon (1972) and The Chinese Connection (1972).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0490492","name":"Tony Liu","idIMDB":"nm0490492"},"actorId":"nm0490492","character":"Hsiao Chiun","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kun Li","urlProfile":"http://www.imdb.com/name/nm0498044","urlPhoto":"","biography":{"dateOfBirth":"18 February 1930","placeOfBirth":" Tianjin, China","birthName":"Xin Liang Li","bio":"Kun Li was born on February 18, 1930 in Tianjin, China as Xin Liang Li. He was an actor and assistant director, known for The Big Boss (1971), The Chinese Connection (1972) and La hyène intrépide (1979). He died on March 12, 2008 in Taipei, Taiwan.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0498044","name":"Kun Li","idIMDB":"nm0498044"},"actorId":"nm0498044","character":"Ah Kun","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nora Miao","urlProfile":"http://www.imdb.com/name/nm0583963","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgwNjkwNzA4NF5BMl5BanBnXkFtZTcwNzkxNzE0NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1952","placeOfBirth":" Hong Kong, China","height":"5' 4\" (1.63 m)","bio":"Nora Miao was born on February 8, 1952 in Hong Kong, China. She is an actress and production manager, known for The Chinese Connection (1972), The Way of the Dragon (1972) and The Big Boss (1971).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgwNjkwNzA4NF5BMl5BanBnXkFtZTcwNzkxNzE0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0583963","name":"Nora Miao","idIMDB":"nm0583963"},"actorId":"nm0583963","character":"Drinkstand owner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shan Chin","urlProfile":"http://www.imdb.com/name/nm0157780","urlPhoto":"","biography":{"bio":"Shan Chin is an actor, known for The Chinese Connection (1972), The Big Boss (1971) and Da zei wang (1970).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0157780","name":"Shan Chin","idIMDB":"nm0157780"},"actorId":"nm0157780","character":"Hua Sze","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chia-Chen Tu","urlProfile":"http://www.imdb.com/name/nm0875557","urlPhoto":"","biography":{"bio":"Chia-Chen Tu is known for his work on The Chinese Connection (1972), The Big Boss (1971) and The Prodigal Son (1981).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0875557","name":"Chia-Chen Tu","idIMDB":"nm0875557"},"actorId":"nm0875557","character":"Uncle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chih Chen","urlProfile":"http://www.imdb.com/name/nm0155168","urlPhoto":"","biography":{"bio":"Chih Chen is known for his work on The Big Boss (1971), Les coolies en ont ras le bol (1973) and Le dragon ne joue pas avec la mort (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0155168","name":"Chih Chen","idIMDB":"nm0155168"},"actorId":"nm0155168","character":"Ice Factory Manager","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Billy Chan","urlProfile":"http://www.imdb.com/name/nm0150807","urlPhoto":"","biography":{"bio":"Billy Chan is known for his work on Spooky Encounters (1980), Kung Fu Killer (2014) and The Chinese Connection (1972).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0150807","name":"Billy Chan","idIMDB":"nm0150807"},"actorId":"nm0150807","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lung Chan","urlProfile":"http://www.imdb.com/name/nm0151005","urlPhoto":"","biography":{"bio":"Lung Chan is known for his work on Snake in the Eagle's Shadow (1978), First Mission (1985) and Spooky Encounters (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0151005","name":"Lung Chan","idIMDB":"nm0151005"},"actorId":"nm0151005","character":"Gatekeeper / Blue Shirt Henchman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen Chang","urlProfile":"http://www.imdb.com/name/nm0151822","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NDA5NDU2Ml5BMl5BanBnXkFtZTcwODM5MDE5Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"A Grandmaster 1977 Grand Champion. Speaks 8 languages / 8 Chinese dialects. 1996 Guest Star: 2 roles as Young & Old Monks in \"Kung Fu Legend Continues\". 1983 as\"VC Commander\" in \"First Blood Rambo\". Star in \"International Rescue\"-WW2 - 1990 Hit - 70mm Feature. 1994 Double Happiness 6 Wins / 5 Nomination: Male Lead. Government Authorized \" Celebrity Ambassador\" to China Film Studios for JV Projects. Judges: 1995 Gemini Award / 1996 BCMPA Celebrity Presenter / Canada China Film Festival 2011-15 Head Judge / International Model Contest 2013-2015 Head Judge. 2016 Canada Golden Maple Film Festival-Red Carpet Awards - Committee Chair / Head Judge. 2015-2016 Successfully funded 3 Features in China-US-Canada. Each 20m US","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2NDA5NDU2Ml5BMl5BanBnXkFtZTcwODM5MDE5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0151822","name":"Stephen Chang","idIMDB":"nm0151822"},"actorId":"nm0151822","character":"Disciple","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ching-Ying Lam","urlProfile":"http://www.imdb.com/name/nm0482580","urlPhoto":"","biography":{"dateOfBirth":"27 December 1952","placeOfBirth":" Shanghai, China","birthName":"Lam Gun Bo","bio":"Ching-Ying Lam was born on December 27, 1952 in Shanghai, China, the third of six children. He attended Shun Yi Association Elementary School in Hong Kong for 2 years. He later attended the Chun Chau Drama Society to learn Peking Opera, where he portrayed female roles and did stunt-doubling for actresses. At age 17, he joined the film industry, working as a martial arts stunts man and coach for the Shaw Brothers and Golden Harvest studios. At age 19, he was a personal assistant for Bruce Lee, and later joined the stunt team of Sammo Kam-Bo Hung. Lam did stunt coordination and action choreography for numerous Chinese movies and appeared in scores of films playing fighters, henchmen and police officers. However, his shot to fame came when he appeared as \"Master Gau\" in Mr. Vampire (1985). From this film on, Lam was most famous for his various \"Vampire Buster\" roles in the dozens of ghost, fantasy, and horror movies from Hong Kong that followed, trying to rid the land of restless ghosts, evil demons, hopping vampires and bewitching elves. In these films, Lam often portrayed the \"Master\" of several apprentices, some of which have been played by actors Ricky Hui, Siu-Ho Chin, Biao Yuen and Hoi Mang. In addition to these movies, Lam originated the role of \"Master Mo Siu Fong\" in a TV-series produced by ATV Studios called \"Vampire Expert\" in the 1990s. Lam passed away in Hong Kong on November 8, 1997 at the age of 44.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0482580","name":"Ching-Ying Lam","idIMDB":"nm0482580"},"actorId":"nm0482580","character":"Ah Yen","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0067824","urlIMDB":"http://www.imdb.com/title/tt0067824","business":{"budget":{"money":"$100,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"23","month":"07","year":"1971","remarks":null},{"money":null,"country":null,"day":"18","month":"08","year":"1971","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 40 min (100 min)","1 hr 41 min (101 min) (UK)","1 hr 39 min (99 min) (USA)","1 hr 42 min (102 min) (Argentina)","1 hr 55 min (115 min) (uncut)","1 hr 27 min (87 min) (original rejected english dubbed)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Eastmancolor","Technicolor, USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Dyaliscope"],"printedFilmFormat":["35 mm"]},"rating":"7.1","filmingLocations":[{"location":"Pak Chong, Thailand"}],"rated":"R","awards":[],"votes":"19,538","type":"Movie","companyCreditsSimple":[{"idCompany":"co0015592","name":"Golden Harvest Company"}],"keywords":{"keywords":["jeet kune do","kung fu","cult film","martial arts","factory","ice factory","non violence","fight","grindhouse film","grindhouse","drug smuggling","bribe","tragedy","tragic event","arrest","corpse","block of ice","drunkenness","implied sex","female removes her clothes","bird in a cage","dog attack","german shepherd","brutality","cruelty","bloody violence","stabbed in the side","foreman","dinner","bully","street gang","family relationships","chinese immigrant","evil man","murder of a prostitute","prostitute","brothel","blood splatter","breasts","dead child","child stabbed in the back","child murder","punched in the stomach","punched in the face","flying kick","fighting","fistfight","brawl","ambush","gangster","showdown","martial artist","knife fight","disarming someone","combat","violence","stabbing","murder","murder of family","knife","blood","bloody body of child","heroin","death","thailand","revenge","bare chested male","hand to hand combat","tough guy","one against many","one man army","action hero","hero","chop socky"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:03:35"}}