{"data":{"movies":[{"title":"Kings of the Sun","originalTitle":"","year":"1963","releaseDate":"19631218","directors":[{"name":"J. Lee Thompson","id":"nm0496746"}],"writers":[{"name":"Elliott Arnold","id":"nm0036433"},{"name":"Elliott Arnold","id":"nm0036433"}],"runtime":"108 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDcyMTg5ZjItMTg2Yi00ODJjLTljZjEtZjY0YzFkYjUwZGYwXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Adventure","Drama","History","Thriller"],"plot":"In order to flee from powerful enemies, young Mayan king Balam leads his people north across the Gulf of Mexico to the coast of what will become the United States. They build a home in the new land but come into conflict with a tribe of Native Americans led by their chief, Black Eagle, while both Balam and Black Eagle fall in love the beautiful Mayan princess Ixchel.","simplePlot":"On the coast of the Gulf of Mexico, the Native American tribe of chief Black Eagle clashes with the Mayan tribe of king Balam.","actors":[{"actorName":"Yul Brynner","urlProfile":"http://www.imdb.com/name/nm0000989","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ2ODQ2MjQ5NV5BMl5BanBnXkFtZTYwODk4MjM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1920","placeOfBirth":" Vladivostok, Primorskaya Oblast, Far Eastern Republic [now Primorsky Krai, Russia]","birthName":"Yuli Borisovich Bryner","height":"5' 8\" (1.73 m)","bio":"Exotic leading man of American films, famed as much for his completely bald head as for his performances, Yul Brynner masked much of his life in mystery and outright lies designed to tease people he considered gullible. It was not until the publication of the books \"Yul: The Man Who Would Be King\" and \"Empire and Odyssey\" by his son, Yul \"Rock\" Brynner, that many of the details of Brynner's early life became clear. Yul sometimes claimed to be a half-Swiss, half-Japanese named Taidje Khan, born on the island of Sakhalin; in reality, he was the son of Marousia Dimitrievna (Blagovidova), the Russian daughter of a doctor, and Boris Yuliyevich Bryner, an engineer and inventor of Swiss-German and Russian descent. He was born in their home town of Vladivostok on 11 July 1920 and named Yuli after his grandfather, Jules Bryner. When Yuli's father abandoned the family, his mother took him and his sister Vera to Harbin, Manchuria, where they attended a YMCA school. In 1934 Yuli's mother took her children to Paris. Her son was sent to the exclusive Lycée Moncelle, but his attendance was spotty. He dropped out and became a musician, playing guitar in the nightclubs among the Russian gypsies who gave him his first real sense of family. He met luminaries such as Jean Cocteau and became an apprentice at the Theatre des Mathurins. He worked as a trapeze artist with the famed Cirque d'Hiver company. He traveled to the U.S. in 1941 to study with acting teacher Michael Chekhov and toured the country with Chekhov's theatrical troupe. That same year, he debuted in New York as Fabian in \"Twelfth Night\" (billed as Youl Bryner). After working in a very early TV series, Mr. Jones and His Neighbors (1944), he played on Broadway in \"Lute Song\" with Mary Martin, winning awards and mild acclaim. He and his wife, actress Virginia Gilmore, starred in the first TV talk show, Mr. and Mrs. (1948). Brynner then joined CBS as a television director. He made his film debut in Port of New York (1949). Two years later Mary Martin recommended him for the part he would forever be known for: the King in Richard Rodgers' and Oscar Hammerstein II's musical \"The King and I\". Brynner became an immediate sensation in the role, repeating it for film (The King and I (1956)) and winning the Oscar for Best Actor. For the next two decades, he maintained a starring film career despite the exotic nature of his persona, performing in a wide range of roles from Egyptian pharaohs to Western gunfighters, almost all with the same shaved head and indefinable accent. In the 1970s he returned to the role that had made him a star, and spent most of the rest of his life touring the world in \"The King and I\". When he developed lung cancer in the mid 1980s, he left a powerful public service announcement denouncing smoking as the cause, for broadcast after his death. The cancer and its complications, after a long illness, ended his life. Brynner was cremated and his ashes buried in a remote part of France, on the grounds of the Abbey of Saint-Michel de Bois Aubry, a short distance outside the village of Luzé. He remains one of the most fascinating, unusual and beloved stars of his time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ2ODQ2MjQ5NV5BMl5BanBnXkFtZTYwODk4MjM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000989","name":"Yul Brynner","idIMDB":"nm0000989"},"actorId":"nm0000989","character":"Chief Black Eagle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Chakiris","urlProfile":"http://www.imdb.com/name/nm0001995","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MDI0NTY2NF5BMl5BanBnXkFtZTcwMzI4Mjg3NA@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1934","placeOfBirth":" Norwood, Ohio, USA","height":"5' 11\" (1.8 m)","bio":"George Chakiris made his film debut at the age of 12 singing in the chorus of Song of Love (1947). Following his graduation from high school, he supported his night-time dancing, singing and dramatic lessons with a daytime job clerking in a Los Angeles department store. Later he started his acting/dancing career appearing in musicals such as Gentlemen Prefer Blondes (1953)--he is one of the ballet dancers escorting Marilyn Monroe in \"Diamonds Are A Girl's Best Friend\"--White Christmas (1954), The Girl Rush (1955), There's No Business Like Show Business (1954), Brigadoon (1954), and Meet Me in Las Vegas (1956). In 1957, he made his debut as a dramatic actor in Under Fire (1957). In 1958 he traveled to New York hoping for a Broadway \"break.\" Hearing that Jerome Robbins was casting the London company of \"West Side Story\", he auditioned and was awarded the co-starring role of Riff. He played the part for almost two years on the West End stage before acting, singing and dancing as Bernardo in the Robert Wise film version (West Side Story (1961)), a performance that earned him a Golden Globe and the Academy Award for Best Supporting Actor. Since then, he starred in a succession of films, including Diamond Head (1962) with Charlton Heston, Bebo's Girl (1964) with Claudia Cardinale, The Young Girls of Rochefort (1967) with Catherine Deneuve, Françoise Dorléac and Gene Kelly, The Big Cube (1969) with Lana Turner, Why Not Stay for Breakfast? (1979), Jekyll and Hyde... Together Again (1982), and Pale Blood (1990). He is one of the most traveled stars in motion pictures, having been to such locations as Hawaii, Japan, Mexico, Italy, England, Spain, and France. His nightclub career was launched to rave reviews at Caesar's Palace in Las Vegas and Harrah's Club in Lake Tahoe. In the 1970s and 1980s, his career focused on television and music. He appeared as guest star in several TV series such as Hawaii Five-O (1968) (Death is a Company Policy - 1972), Wonder Woman (1975) (Death in Disguise - 1978), CHiPs (1977) (Fox Trap - 1983), Scarecrow and Mrs. King (1983) (Lost and Found - 1984), Murder, She Wrote (1984) (Weave a Tangled Web - 1989), and he joined the cast of Dallas (1978) from 1985 to 1986. He has released several records: \"George Chakiris,\" \"Memories Are Made of These,\" \"The Gershwin Song Book,\" \"West Side Story's Dynamic...\". Recently, he has appeared in several plays and stage musicals: after \"The King and I\" in the US in 1995, he performed in Britain the role of Rochester in \"Jane Eyre\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MDI0NTY2NF5BMl5BanBnXkFtZTcwMzI4Mjg3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001995","name":"George Chakiris","idIMDB":"nm0001995"},"actorId":"nm0001995","character":"Balam","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shirley Anne Field","urlProfile":"http://www.imdb.com/name/nm0276043","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NTM3MjIxMF5BMl5BanBnXkFtZTgwMTM5NDUwOTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 June 1938","placeOfBirth":" Bolton, Lancashire, England, UK","birthName":"Shirley Anne Broomfield","height":"5' 4\" (1.63 m)","bio":"Shirley Anne Field is one of Britain's most highly respected actresses. She has starred opposite Laurence Olivier, Albert Finney, Steve McQueen, Michael Caine, Daniel Day-Lewis and Ned Beatty in such classic films as: The Entertainer, Saturday Night and Sunday Morning, The War Lover, Alfie, My Beautiful Laundrette and Hear My Song. As a teenager, Shirley Anne returned to London, her birthplace. She worked as a photographic model to pay her way through acting school, and had small parts in films. Her break came when she was cast as Tina the Beauty Queen opposite Sir Laurence Oliver in The Entertainer. Shirley Anne credits Tony Richardson, the director, with starting her (proper) career. Her role as \"Doreen\" in Saturday Night and Sunday Morning soon followed. Only 22 years old, Shirley Anne was a major film star. Her next movie, Man in the Moon, was featured in a Royal Command Performance. This resulted in her name being above the title in all the major cinemas around Leicester Square. Apparently this is a record to this day. Just a year or so ago George, Tony Richardson's house guest at that time, told Shirley Anne how Tony and he had gone to Leicester Square to see her name in lights. This made her very happy and to this day she still feels connected to all the wonderful people she met and worked with at this time. She worked with Albert Finney at the Royal Court in Lindsay Anderson production of Lily White Boy's. Then they worked together on Saturday Night Sunday Morning, written by Alan Sillitoe. Hollywood was paying attention. Shirley Anne was cast as the female lead in The War Lover opposite Steve McQueen and Robert Wagner. Then she starred in a Hollywood block buster called Kings of the Sun with Yul Brynner and George Chakiris, filmed in Mexico. Shirley Anne has interspersed her film career with theatre and TV performances in Britain and around the world. She played the lead in Wait until Dark in South Africa. She played the part of \"Pamela\" in the U.S. television drama Santa Barbara. In the eighties Shirley Anne met up again with Stephen Frears, who she had worked with when they were both beginners at the Royal Court. He cast her in My Beautiful Laundrette which was a big success and a break through movie Her next big film was Hear My Song as Cathleen Doyle, made in the nineties. In recent years Shirley Anne has toured in theatre productions such as The Cemetery Club and Five Blue Hair Ladies Sitting on a Green Park Bench. She was pleasantly surprised at how enthusiastically her performances were received all over the country and how much she enjoyed visiting so many different cities and towns and the wonderful welcome she received. Recently Shirley Anne appeared alongside the young very talented Flora Spencer Longhurst in Beautiful Relics, a short film directed by Adrian Hedgecock who she predicts a big future for.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NTM3MjIxMF5BMl5BanBnXkFtZTgwMTM5NDUwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0276043","name":"Shirley Anne Field","idIMDB":"nm0276043"},"actorId":"nm0276043","character":"Ixchel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Basehart","urlProfile":"http://www.imdb.com/name/nm0000865","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNzgwMTQ0NF5BMl5BanBnXkFtZTYwNzg3MzEz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 August 1914","placeOfBirth":" Zanesville, Ohio, USA","birthName":"John Richard Basehart","height":"5' 9\" (1.75 m)","bio":"Richard Basehart came to Hollywood in 1947, after beginning an acting career on Broadway. He made his mark in the gritty film-noir classic He Walked by Night (1948), among others, and proved his versatility in several international productions, most notably in Federico Fellini's poignant masterpiece La Strada (1954).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNzgwMTQ0NF5BMl5BanBnXkFtZTYwNzg3MzEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000865","name":"Richard Basehart","idIMDB":"nm0000865"},"actorId":"nm0000865","character":"Ah Min","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brad Dexter","urlProfile":"http://www.imdb.com/name/nm0223290","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MDc1NDgxNF5BMl5BanBnXkFtZTcwOTE1ODE1NA@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1917","placeOfBirth":" Goldfield, Nevada, USA","birthName":"Boris Milanovich","height":"6' 2\" (1.88 m)","bio":"American supporting player specializing in tough guys. Of Serbian extraction, he was born in Nevada in 1917. As a young man, he boxed in amateur bouts and had early training in theatre at the Pasadena Playhouse. He joined the Air Corps during World War II and was assigned to the troupe performing the Moss Hart Broadway tribute to the Corps, Winged Victory, acting under his first chosen stage name, Barry Mitchell. He appeared in the film version of the show, and after the war became active in radio drama as well as theatre. John Huston spotted him in a play and cast him as a bad guy in The Asphalt Jungle (1950), under the new sobriquet of Brad Dexter. Throughout the Fifties, he continued to play hard cases of a usually villainous stripe, in both crime dramas and Westerns. His most famous role came as one of title characters in The Magnificent Seven (1960), albeit his fame was considerably eclipsed by most of the other members of that band: Yul Brynner, Steve McQueen, Horst Buchholz, Charles Bronson, Robert Vaughn, and James Coburn. He continued acting into the 1970s, then made a shift into producing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MDc1NDgxNF5BMl5BanBnXkFtZTcwOTE1ODE1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0223290","name":"Brad Dexter","idIMDB":"nm0223290"},"actorId":"nm0223290","character":"Ah Haleb","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barry Morse","urlProfile":"http://www.imdb.com/name/nm0607579","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTQyMjMyMV5BMl5BanBnXkFtZTgwMzU2OTEyMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1918","placeOfBirth":" London, England, UK","birthName":"Herbert Morse","height":"5' 10\" (1.78 m)","bio":"Born in London's East End, Barry's career began when he won a full scholarship to the Royal Academy of Dramatic Art at the age of 15. Upon graduation, he followed with successful stage runs in London's West End and in theatrical productions throughout the United Kingdom, and appeared on the BBC's earliest live television broadcasts in the late 1930s. Barry relocated to Canada in the early 1950s, working in live theatre, on CBC Radio, and in the premiere CBC-TV broadcasts. While a staple in many of the anthology and dramatic series of the 1950s and 1960s, he is probably best known in North America for his TV roles as \"Lt. Philip Gerard\" in The Fugitive (1963) and as \"Prof. Victor Bergman\" in Space: 1999 (1975). A journalist once determined that Barry had played more than 3,000 roles on the stage, screen, and radio in a career spanning eight decades.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTQyMjMyMV5BMl5BanBnXkFtZTgwMzU2OTEyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0607579","name":"Barry Morse","idIMDB":"nm0607579"},"actorId":"nm0607579","character":"Ah Zok","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Armando Silvestre","urlProfile":"http://www.imdb.com/name/nm0799108","urlPhoto":"","biography":{"dateOfBirth":"6 January 1926","placeOfBirth":" San Diego, California, USA","birthName":"Armando Enrique Silvestre","bio":"Armando Silvestre was born on January 6, 1926 in San Diego, California, USA as Armando Enrique Silvestre. He is an actor, known for La Impostora (2014), Sierra torride (1970) and Waking Up with You (2016).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0799108","name":"Armando Silvestre","idIMDB":"nm0799108"},"actorId":"nm0799108","character":"Isatai","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leo Gordon","urlProfile":"http://www.imdb.com/name/nm0330388","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMWE4ZGItNDFkYi00ODY5LWE4ZmYtMDc1OGMzNzdhMTc5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 December 1922","placeOfBirth":" New York City, New York, USA","birthName":"Leo Vincent Gordon","height":"6' 2\" (1.88 m)","bio":"Big, burly, character actor, one of the toughest of screen heavies, Leo Gordon's powerful physique, combined with his deep, menacing voice, was guaranteed to strike fear into the heart of even the bravest screen hero. Director Don Siegel, who used Gordon in his prison film Riot in Cell Block 11 (1954), once said that \"Leo Gordon was the scariest man I have ever met\" - this coming from a man who had directed John Wayne, Clint Eastwood and Bette Midler! Siegel wasn't talking about just Gordon's screen presence. Before becoming an actor (he studied at the American Academy of Dramatic Arts), Gordon served 5 years in San Quentin State Prison for armed robbery. \"Riot in Cell Block 11\" was filmed at Folsom State Prison. The Folsom warden remembered Gordon from his prison stint, when he had a reputation as a troublemaker, and objected to his being in the film, but Siegel was able to convince him that Gordon was no threat to the prison. Contrary to his image, though, Gordon was not just a one-note villain. He did play sympathetic parts on occasion, notably in the western Black Patch (1957)--which he also wrote--and in Roger Corman's civil rights drama The Intruder (1962), and turned in first-rate performances, especially in the latter film. Gordon was also a screenwriter, turning out several screenplays for Corman. He wasn't just limited to writing low-budget sci-fi films, either; he penned the screenplay for the WWII epic Tobruk (1967), writing in a good part for himself as Kruger, a tough sergeant in a platoon of German Jews masquerading as Nazi soldiers to help blow up a German oil storage facility.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMWE4ZGItNDFkYi00ODY5LWE4ZmYtMDc1OGMzNzdhMTc5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0330388","name":"Leo Gordon","idIMDB":"nm0330388"},"actorId":"nm0330388","character":"Hunac Ceel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victoria Vetri","urlProfile":"http://www.imdb.com/name/nm0895407","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxOTQwNjk0MV5BMl5BanBnXkFtZTcwMDc1MzAyOA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 September 1944","placeOfBirth":" San Francisco, California, USA","birthName":"Victoria Cecilia Vetry","height":"5' 5\" (1.65 m)","bio":"Born Victoria Vetri (but also known as Angela Dorian) to Italian parents (her mother was from Rome, her father Sicily) and grew up in Los Angeles. She studied art at Los Angeles City College in the 60s before embarking on her movie-television career. Thanks to her beautiful, exotic looks she was cast in parts that required ethnic beauties or scantily clad lovelies. She then posed for Playboy, becoming Miss September, 1967; and was later honored as the 1968 Playmate of the Year, becoming one of the most popular Playmates of the Vietnam War era.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxOTQwNjk0MV5BMl5BanBnXkFtZTcwMDc1MzAyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0895407","name":"Victoria Vetri","idIMDB":"nm0895407"},"actorId":"nm0895407","character":"Ixzubin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rudy Solari","urlProfile":"http://www.imdb.com/name/nm0812732","urlPhoto":"","biography":{"dateOfBirth":"21 December 1934","placeOfBirth":" Modesto, California, USA","birthName":"Rudolph Jim Solari","bio":"Rudy Solari was born on December 21, 1934 in Modesto, California, USA as Rudolph Jim Solari. He was an actor, known for Garrison's Gorillas (1967), The Boss' Son (1978) and The Wackiest Ship in the Army (1965). He died on April 23, 1991 in Indio, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0812732","name":"Rudy Solari","idIMDB":"nm0812732"},"actorId":"nm0812732","character":"Pitz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ford Rainey","urlProfile":"http://www.imdb.com/name/nm0707077","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMDI2OTU5M15BMl5BanBnXkFtZTcwMjcwNjM5NA@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 August 1908","placeOfBirth":" Mountain Home, Idaho, USA","bio":"American character actor of stage, films, and television. A native of Idaho, Rainey was the son of a colorful character who was, among many other things, a champion of local dance contests. As a boy, Rainey was painfully shy, but found an outlet in school plays. He pursued stage work in regional companies, then went to New York to study with the legendary Michael Chekhov. He worked numerous \"civilian\" jobs while attempting to make a career as an actor, including work as a logger, a lineman, and a licensed carpenter. He served in the U.S. Coast Guard during World War II, then went to California where he helped start the Ojai Valley Players and then acted in his first film in 1949. He became a familiar face in films and television shows of all sorts during the next five decades while maintaining a deep attachment to the theatre. In his ninetieth year, he played Giles Corey in \"The Crucible\" at Theatricum Botanicum, the Topanga, California theatre founded by his friend, the late Will Geer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMDI2OTU5M15BMl5BanBnXkFtZTcwMjcwNjM5NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0707077","name":"Ford Rainey","idIMDB":"nm0707077"},"actorId":"nm0707077","character":"The Chief","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Angel Di Steffano","urlProfile":"http://www.imdb.com/name/nm0224347","urlPhoto":"","biography":{"bio":"Angel Di Steffano is an actress, known for Kings of the Sun (1963).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0224347","name":"Angel Di Steffano","idIMDB":"nm0224347"},"actorId":"nm0224347","character":"Balam","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"José Moreno","urlProfile":"http://www.imdb.com/name/nm0604024","urlPhoto":"","biography":{"dateOfBirth":"26 October 1933","placeOfBirth":" Chiclana, Cádiz, Andalucía, Spain","bio":"José Moreno was born on October 26, 1933 in Chiclana, Cádiz, Andalucía, Spain. He was an actor and manager, known for Las golondrinas (1968), Valencia (1957) and Teresa de Jesús (1962). He died on November 9, 2007 in Puerto Real, Cádiz.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0604024","name":"José Moreno","idIMDB":"nm0604024"},"actorId":"nm0604024","character":"The Youth","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0057225","urlIMDB":"http://www.imdb.com/title/tt0057225","business":{"budget":{"money":"$4,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"03","month":"01","year":"1963","remarks":null},{"money":null,"country":null,"day":"05","month":"04","year":"1963","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 48 min (108 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["DeLuxe"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"6.3","filmingLocations":[{"location":"Chichén Itzá, Yucatán, Mexico"}],"rated":"APPROVED","awards":[],"votes":"1,229","type":"Movie","companyCreditsSimple":[{"idCompany":"co0011112","name":"Mirisch Corporation, The"}],"keywords":{"keywords":["mayan","native american","king","love","epic","chichen itza","wrestling","machismo","male rivalry","friendship between men","loincloth","tied up","bondage","bare chested male bondage","bare chested male","death","indian war","long black hair","last stand","ends with funeral","stick fight","stabbed with a knife","stabbed with a stick","knife","self sacrifice","death of hero","bald hero","bald man","staff","beach","flaming arrow","temple","love triangle","hope","hand to hand combat","pagan","paganism","religion","capture","ambush","kiss","brunette","attempted rape","rape","fued","invasion","cape","bald","murder","redemption","canoe","burned alive","fire","blood splatter","blood","stabbed with a spear","spear","shot with an arrow","bow and arrow","main character dies","wooden sword","human sacrifice","indian chief","shield","club","sword","battle","battlefield","showdown","standoff","conqueror","native tribe","american indian","forbidden love","death of protagonist","sword duel","sword fight","hero","tough guy","mayan indian","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:26:05"}}