{"data":{"movies":[{"title":"2001: A Space Odyssey","originalTitle":"","year":"1968","releaseDate":"19680927","directors":[{"name":"Stanley Kubrick","id":"nm0000040"}],"writers":[{"name":"Stanley Kubrick","id":"nm0000040"},{"name":"Arthur C. Clarke","id":"nm0002009"}],"runtime":"149 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTZkZTBhYmUtMTIzNy00YTViLTg1OWItNGUwMmVlN2FjZTVkXkEyXkFqcGdeQXVyNDYyMDk5MTU@._V1.jpg","countries":["UK","USA"],"languages":["English","Russian"],"genres":["Adventure","Sci-Fi"],"plot":"\"2001\" is a story of evolution. Sometime in the distant past, someone or something nudged evolution by placing a monolith on Earth (presumably elsewhere throughout the universe as well). Evolution then enabled humankind to reach the moon's surface, where yet another monolith is found, one that signals the monolith placers that humankind has evolved that far. Now a race begins between computers (HAL) and human (Bowman) to reach the monolith placers. The winner will achieve the next step in evolution, whatever that may be.","simplePlot":"Humanity finds a mysterious, obviously artificial object buried beneath the Lunar surface and, with the intelligent computer H.A.L. 9000, sets off on a quest.","actors":[{"actorName":"Keir Dullea","urlProfile":"http://www.imdb.com/name/nm0001158","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczODgxNDU1NV5BMl5BanBnXkFtZTYwMzQxOTI2._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1936","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Keir Atwood Dullea","height":"6' 1\" (1.85 m)","bio":"Tall, slim, remote and boyishly handsome, one of Keir Dullea's most arresting features is his pale blue eyes, which featured in a number of watershed films of the 1960s. A major, up-and-coming film star from the \"Camelot\" years straight through the turbulent era of the U.S.-Viet Nam War, he never quite reached international fame. His shining star may have suffered a power outage into the next decade, but he persevered quite well on T.V. and (especially) the stage in a career now surpassing five decades. Dullea, who was born in Cleveland, Ohio, is the son of two book-store owners, and he was raised in New York's Greenwich Village section. He graduated from George School in Pennsylvania and attended both Rutgers and San Francisco State before deciding to pursue summer stock and regional theatre. Attending the Neighborhood Playhouse, he made his New York City acting debut in a production of \"Sticks and Bones\" in 1956. His first big break came with the pilot program of the Route 66 (1960) series, and he proceeded to find other TV roles in Naked City (1958), Checkmate (1960) and various dramatic programs. Following stage work in \"Season of Choice\" (1959) and \"A Short Happy Life\" (1961), Dullea made an auspicious film debut in a leading role with The Hoodlum Priest (1961), playing a troubled street gang member who crosses paths with Don Murray's determined minister. The young actor's characters from then on seemed to walk a dangerous tight-rope of emotions, and his apparent versatility at such a young age led him to a number of other psychologically scarred portrayals. Tending to play men younger than he really was, none were more disturbed than his haphephobic adolescent David (Dullea was twenty-six at the time) in the deeply felt love story David and Lisa (1962). Paired beautifully with Janet Margolin's schizophrenic Lisa, Dullea won the Golden Globe Award for \"Most Promising Male Newcomer.\" In the World War II military drama The Thin Red Line (1964)he played an edgy, nervous-eyed private who is pushed to his murderous brink by a brutal sergeant on Guadacanal. In Bunny Lake Is Missing (1965) Dullea portrayed the incestuous brother of Carol Lynley, who may or may not figure into the disappearance of Lynley's child. Keir also costarred as the mysterious intruder who inserts an emotional wedge between gay lovers Anne Heywood and Sandy Dennis in the ground-breaking film about homosexuals, Le renard (1967). Topping that off, Dullea played the salacious Marquis De Sade himself in a relatively tame, internationally flavored production of De Sade (1969). The apex of his film career, however, came with his lead role in Stanley Kubrick's epic science-fiction film, 2001: A Space Odyssey (1968), as the astronaut Dr. David Bowman. In the realm of stage acting, Keir made his debut on Broadway in 1967 with \"Dr. Cook's Garden\" costarring Burl Ives, and Dullea won some \"flower power\" stardom two years later as a sensitive young blind man who attempted to wriggle free of his protective, overbearing mother. His character also pursues love with a free-spirited girl, played by Blythe Danner, in the play \"Butterflies Are Free.\" By the time the movie of this story was released in 1972 both stars had been replaced by Goldie Hawn and Edward Albert. Dullea next went abroad to seek film work in England and in Canada, but with lukewarm results. He continued to show his odd-man-out appeal on the Broadway stage as \"Brick\" in 1970, and in the Broadway revival of \"Cat on a Hot Tin Roof\" in 1974, acting along with Elizabeth Ashley as \"Maggie,\" and in the black comedy \"P.S. Your Cat Is Dead!\" one year later. In the years since then, Dullea has acted steadily on the stage in New York City, and in U.S. regional theatres, in productions of \"Sweet Prince,\" \"The Seagull\" and \"The Little Foxes,\"among others. His cinematic roles since 1970 have included another \"mysterious stranger\" in The Next One (1984), and he also reprised his \"David Bowman\" role in 2010: The Year We Make Contact (1984), the sequel to \"2001: A Space Odyssey.\" Dullea has had four wives: his first was actress Margot Bennett, and he and his third wife, Susie Fuller (whom he met during the British performances of \"Butterflies are Free\" in London), cofounded the Theater Artists Workshop of Westport in 1983. Dullea, Fuller and her two children resided in London for quite a while. After Fuller's death in 1998, Dullea married for the fourth time in 1999 to actress Mia Dillon, who is best known for portraying the character \"Babe\" in in the play, \"Crimes of the Heart\" in New York City. Just a few weeks later they appeared together in the play \"Deathtrap.\" Dullea has worked infrequently in television roles. Among his more recent work in movies has been the role of a senator in The Good Shepherd (2006), along with Matt Damon and Angelina Jolie, which was directed by Robert De Niro.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczODgxNDU1NV5BMl5BanBnXkFtZTYwMzQxOTI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001158","name":"Keir Dullea","idIMDB":"nm0001158"},"actorId":"nm0001158","character":"Dr. Dave Bowman","urlCharacter":"http://www.imdb.com/character/ch0002896","main":true},{"actorName":"Gary Lockwood","urlProfile":"http://www.imdb.com/name/nm0516972","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDMzNjQ1Nl5BMl5BanBnXkFtZTYwNzMxOTI2._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1937","placeOfBirth":" Van Nuys, California, USA","birthName":"John Gary Yurosek","height":"6' 0½\" (1.84 m)","bio":"Gary Lockwood was born in Van Nuys, California. He attended the University of California at Los Angeles on a football scholarship. He began his career as a movie stuntman, and a stand-in for Anthony Perkins, prior to his acting debut in 1959 in an uncredited bit role in Warlock (1959). He also appeared as a police officer in Perry Mason: The Case of the Romantic Rogue (1959). Two series came early in his career, ABC's Hawaii-set Follow the Sun (1961), in 1961-1962, cast him in as an adventurous magazine writer in Honolulu. In 1961, he appeared as a rodeo cowboy in love with an 18-year-old singer, played by Tuesday Weld, in ABC's Bus Stop: Cherie (1961). He then starred with Jeff Bridges in The Lloyd Bridges Show: My Daddy Can Lick Your Daddy (1963). In 1964, he starred as a young U.S. Marine lieutenant in the NBC series, The Lieutenant (1963), which was produced by Star Trek (1966) creator, Gene Roddenberry, and The Man from U.N.C.L.E. (1964) creator, Norman Felton. He then starred in another NBC television series called Kraft Mystery Theater (1959), opposite Sally Kellerman, with whom he would again appear in the second Star Trek (1966) pilot, Star Trek: Where No Man Has Gone Before (1966), as \"Lt. Cmdr. Gary Mitchell\", and Kellerman as the ship's psychiatrist, \"Dr. Elizabeth Dehner\", who both develop super powers. In 1966, he guest-starred in the episode, The Legend of Jesse James: Reunion (1966), of ABC's The Legend of Jesse James (1965), starring Christopher Jones. That same year, he appeared as \"Danny Hamil\" on the episode, The Long, Hot Summer: Day of Thunder (1966), of NBC's drama, The Long, Hot Summer (1965), based loosely on the works of William Faulkner, as well as appearing as \"Jim Stark\" in the two-part episode \"The Raid\" of CBS's Gunsmoke (1955), with James Arness. He co-starred with Stefanie Powers (his wife at the time) in the episode, Love, American Style: Love and the Phone Booth/Love and the Doorknob (1969), of ABC's Love, American Style (1969). In 1968, he was cast as the co-star in director Stanley Kubrick's legendary Sci-Fi film, 2001: A Space Odyssey (1968), starring as \"Dr. Frank Poole\". In 1983, he made a guest-starring role as \"Alex Carmen\" in the Hart to Hart (1979) episode, Hart to Hart: Emily by Hart (1983), starring Robert Wagner, and [his now ex-wife] Stefanie Powers. Between 1959 and 2004, he had roles in some forty theatrical and made-for-TV features and made almost eighty TV guest appearances, including several as a villain on CBS-TV's Barnaby Jones (1973), starring Buddy Ebsen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MDMzNjQ1Nl5BMl5BanBnXkFtZTYwNzMxOTI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0516972","name":"Gary Lockwood","nicknames":["Lox"],"idIMDB":"nm0516972"},"actorId":"nm0516972","character":"Dr. Frank Poole","urlCharacter":"http://www.imdb.com/character/ch0002899","main":true},{"actorName":"William Sylvester","urlProfile":"http://www.imdb.com/name/nm0843213","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAzMDc5OTI1NV5BMl5BanBnXkFtZTcwNDQ1MzY2OQ@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 January 1922","placeOfBirth":" Oakland, California, USA","birthName":"William R. Silvester","height":"6' 3½\" (1.92 m)","bio":"William Sylvester was born on January 31, 1922 in Oakland, California, USA as William R. Silvester. He was an actor, known for 2001: A Space Odyssey (1968), Gorgo (1961) and Devil Doll (1964). He was married to Veronica Hurst and Sheila Sweet. He died on January 25, 1995 in Butte County, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAzMDc5OTI1NV5BMl5BanBnXkFtZTcwNDQ1MzY2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0843213","name":"William Sylvester","idIMDB":"nm0843213"},"actorId":"nm0843213","character":"Dr. Heywood R. Floyd","urlCharacter":"http://www.imdb.com/character/ch0002894","main":true},{"actorName":"Daniel Richter","urlProfile":"http://www.imdb.com/name/nm0725220","urlPhoto":"","biography":{"dateOfBirth":"1939","placeOfBirth":" Darien, Connecticut, USA","bio":"Daniel Richter was born in 1939 in Darien, Connecticut, USA. He is known for his work on 2001: A Space Odyssey (1968), Imagine (1972) and The U.S. vs. John Lennon (2006).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0725220","name":"Daniel Richter","idIMDB":"nm0725220"},"actorId":"nm0725220","character":"Moon-Watcher","urlCharacter":"http://www.imdb.com/character/ch0071788","main":true},{"actorName":"Leonard Rossiter","urlProfile":"http://www.imdb.com/name/nm0744436","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODMwMzQ5OV5BMl5BanBnXkFtZTcwNTgxOTgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 October 1926","placeOfBirth":" Liverpool, England, UK","height":"5' 9\" (1.75 m)","bio":"Leonard Rossiter was born on October 21st, 1926 in Liverpool. Unable to afford to go to university, he worked in an insurance office until he was 27, when he joined Preston repertory company and made his professional stage debut in \"The Gay Dog\". After Preston, he starred in productions at Wolverhampton, Salisbury and The Old Vic Company at Bristol's Theatre Royal. In 1962, he made his first big-screen appearance in A Kind of Loving (1962), followed by other films throughout the 1960s, including Billy Liar (1963) and TV appearances such as Z Cars (1962), The Avengers (1961) and Steptoe and Son (1962). His portrayal of \"Adolf Hitler\" in the 1969 play, \"The Resistible Rise of Arturo Ui\", made him a West End star. His roles as \"Rigsby\" in Rising Damp (1974) and the title role in The Fall and Rise of Reginald Perrin (1976) made him a household name, and his Cinzano commercials with Joan Collins were comic masterpieces. A keen sportsman, he excelled in squash, tennis and football. He was also a connoisseur of fine wines. His busy career came to a tragically premature end on October 5th 1984, just sixteen days short of his 58th birthday. During a performance of Joe Orton's play \"Loot\", Leonard suffered a heart attack in his dressing room. He was married to actress Gillian Raine and had a daughter, Camilla.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODMwMzQ5OV5BMl5BanBnXkFtZTcwNTgxOTgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0744436","name":"Leonard Rossiter","idIMDB":"nm0744436"},"actorId":"nm0744436","character":"Dr. Andrei Smyslov","urlCharacter":"http://www.imdb.com/character/ch0031317","main":true},{"actorName":"Margaret Tyzack","urlProfile":"http://www.imdb.com/name/nm0879239","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NTAzMzkzOV5BMl5BanBnXkFtZTcwMDMwNjIyMw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1931","placeOfBirth":" Plaistow, London, England, UK","birthName":"Margaret Maud Tyzack","height":"5' 6\" (1.68 m)","bio":"Margaret Tyzack was born on September 9, 1931 in Plaistow, London, England as Margaret Maud Tyzack. She was an actress, known for 2001: A Space Odyssey (1968), A Clockwork Orange (1971) and Match Point (2005). She was married to Alan R. Stephenson. She died on June 25, 2011 in Blackheath, London.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0NTAzMzkzOV5BMl5BanBnXkFtZTcwMDMwNjIyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0879239","name":"Margaret Tyzack","idIMDB":"nm0879239"},"actorId":"nm0879239","character":"Elena","urlCharacter":"http://www.imdb.com/character/ch0002901","main":true},{"actorName":"Robert Beatty","urlProfile":"http://www.imdb.com/name/nm0064235","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODE0NzkwOF5BMl5BanBnXkFtZTcwMjkwODUxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 October 1909","placeOfBirth":" Hamilton, Ontario, Canada","bio":"Robert Beatty graduated with a B.A. from the University of Toronto and started in amateur dramatics with the Hamilton Player's Guild. For a while, he made a living as a cashier for a gas and fuel company. In order to further hone his acting skills, he made his way to London in 1936 (on the advice of Leslie Howard) to train for acting at RADA. He made his theatrical debut in \"Idiot's Delight\" at the Apollo, and from there obtained regular work on both stage and screen in bit parts and walk-ons, eventually making his breakthrough on radio as a broadcaster for the BBC. He was famously on hand, reporting eyewitness accounts of the London Blitz for the Overseas News Service during the war years. On the strength of this, Beatty was promoted to more substantial film roles, beginning with San Demetrio London (1943), in which he played a brash, alcoholic American sailor mellowed by his good-natured British crewmates in the best 'stiff-upper-lip' tradition. This seemed to set the tone for his future screen personae, for he was henceforth typecast as tough, down-to-earth Canadians or Americans, many of them cops or gumshoes in low budget potboilers. That notwithstanding, he had his share of quality assignments as well, notably as loyal friend to IRA fugitive James Mason in Odd Man Out (1947); as a plausible Lord Beaverbrook in The Magic Box (1951); as Lieutenant William Bush, best friend and second-in-command to Gregory Peck's Captain Horatio Hornblower R.N. (1951); and as a washed-out heavyweight prizefighter in The Square Ring (1953). Throughout his career, Beatty's stock-in-trade was masculinity, dependability and forthrightness. Immensely popular on radio, Beatty provided the voice for private eye Philip Odell in a long-running series for the BBC \"Light Programme\" between 1947 and 1961. From the late 1950's, he also became increasingly prolific on television and as a narrator of documentaries. If his face was not yet recognisable enough, he appeared in commercials for a hair care product. For two years, Beatty starred in his own half-hour series, Dial 999 (1958), as a Canadian mountie seconded to Scotland Yard. On the big screen he was cast as Dr. Ralph Halvorsen in Stanley Kubrick's 2001: A Space Odyssey (1968). Towards the end of his lengthy career, he gave one of his finest performances, a thoroughly convincing impersonation of President Ronald Reagan in the documentary-drama Breakthrough at Reykjavik (1987).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODE0NzkwOF5BMl5BanBnXkFtZTcwMjkwODUxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0064235","name":"Robert Beatty","idIMDB":"nm0064235"},"actorId":"nm0064235","character":"Dr. Ralph Halvorsen","urlCharacter":"http://www.imdb.com/character/ch0071787","main":true},{"actorName":"Sean Sullivan","urlProfile":"http://www.imdb.com/name/nm0838330","urlPhoto":"","biography":{"dateOfBirth":"26 December 1921","placeOfBirth":" Toronto, Ontario, Canada","bio":"Sean Sullivan was born on December 26, 1921 in Toronto, Ontario, Canada. He was an actor, known for 2001: A Space Odyssey (1968), The Dead Zone (1983) and Atlantic City (1980). He died on June 3, 1985 in Toronto.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0838330","name":"Sean Sullivan","idIMDB":"nm0838330"},"actorId":"nm0838330","character":"Dr. Bill Michaels","urlCharacter":"http://www.imdb.com/character/ch0002904","main":true},{"actorName":"Douglas Rain","urlProfile":"http://www.imdb.com/name/nm0706937","urlPhoto":"","biography":{"dateOfBirth":"13 March 1928","placeOfBirth":" Winnipeg, Manitoba, Canada","birthName":"Douglas James Rain","bio":"Douglas Rain was born on March 13, 1928 in Winnipeg, Manitoba, Canada as Douglas James Rain. He is an actor, known for 2001: A Space Odyssey (1968), 2010: The Year We Make Contact (1984) and Festival (1960).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0706937","name":"Douglas Rain","idIMDB":"nm0706937"},"actorId":"nm0706937","character":"HAL 9000","urlCharacter":"http://www.imdb.com/character/ch0002900","main":true},{"actorName":"Frank Miller","urlProfile":"http://www.imdb.com/name/nm0588339","urlPhoto":"","biography":{"dateOfBirth":"1944","placeOfBirth":" Chicago, Illinois, USA","bio":"Frank Miller was born in 1944 in Chicago, Illinois, USA. He was an actor, known for 2001: A Space Odyssey (1968), Innerspace (1987) and Ricochet (1991). He died on June 2, 1998 in Zeeland, Michigan, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0588339","name":"Frank Miller","idIMDB":"nm0588339"},"actorId":"nm0588339","character":"Mission Controller","urlCharacter":"http://www.imdb.com/character/ch0214105","main":true},{"actorName":"Bill Weston","urlProfile":"http://www.imdb.com/name/nm0922916","urlPhoto":"","biography":{"dateOfBirth":"29 May 1941","placeOfBirth":"","height":"6' 1½\" (1.87 m)","bio":"Bill Weston was born on May 29, 1941. He is known for his work on Saving Private Ryan (1998), Titanic (1997) and Batman Begins (2005). He died on March 25, 2012.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0922916","name":"Bill Weston","idIMDB":"nm0922916"},"actorId":"nm0922916","character":"Astronaut","urlCharacter":"http://www.imdb.com/character/ch0091154","main":true},{"actorName":"Ed Bishop","urlProfile":"http://www.imdb.com/name/nm0084042","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExODU3OTc5NTVeQTJeQWpwZ15BbWU4MDYyOTY5MjEx._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 June 1932","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"George Victor Bishop","height":"5' 11\" (1.8 m)","bio":"Born as George Victor Bishop in 1932. He changed his name to Edward when he became a professional actor, as there was already an actor named George Bishop. Raised in Peekskill, New York through high school. Served in the US Army 1952-1954, worked as a disc jockey on Armed Forces Radio at St Johns' Newfoundland. Planned for a career in Business Administration and went back to school at Boston University. Decided he didn't like Business Administration and enrolled in Boston University Theater Division (1956). Graduated in 1960 with a Bachelor of Fine Arts Degree. Won a scholarship to study drama at London Academy of Music and Dramatic Art in 1960. Started his professional acting career in July 1961. Married his second wife, the economist Hilary Preen at Caxton Hall in 1962. Met Hilary in Trafalgar Square when he was visiting places of interest in London. They had four children, who were born in 1964 (Daniel, who later died in a car crash), 1967 (Georgina), 1968 (Jessica) and 1971 (Serina). They lived in Napton on the Hill, a little village in Warwickshire, where he bought a large old house in 1980. Here he founded Napton Open Air Theatre and Napton Little Theatre, which staged high quality village productions. He later lived with his third wife, Jane Skinner, at East Molesey. Ed became a grandfather in 1994. He was a keen anti-war campaigner, addressing meetings in Manchester and attending demonstrations at arms fairs. He notably crashed one such fair dressed as General Pinochet, along with four other dictators that Britain had supplied arms to - and who had subsequently turned nasty: General Galtieri, Saddam Hussein, Adolf Hitler and Ivan the Terrible. It made the national news.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExODU3OTc5NTVeQTJeQWpwZ15BbWU4MDYyOTY5MjEx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0084042","name":"Ed Bishop","idIMDB":"nm0084042"},"actorId":"nm0084042","character":"Aries-1B Lunar Shuttle Captain","urlCharacter":"http://www.imdb.com/character/ch0214132","main":true},{"actorName":"Glenn Beck","urlProfile":"http://www.imdb.com/name/nm0065140","urlPhoto":"","biography":{"dateOfBirth":"1 June 1935","placeOfBirth":" Cranbrook, British Columbia, Canada","bio":"Glenn Beck was born on June 1, 1935 in Cranbrook, British Columbia, Canada. He is an actor, known for 2001: A Space Odyssey (1968), Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb (1964) and National Treasure: Book of Secrets (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0065140","name":"Glenn Beck","idIMDB":"nm0065140"},"actorId":"nm0065140","character":"Astronaut","urlCharacter":"http://www.imdb.com/character/ch0091154","main":true},{"actorName":"Alan Gifford","urlProfile":"http://www.imdb.com/name/nm0317506","urlPhoto":"","biography":{"dateOfBirth":"11 March 1911","placeOfBirth":" Taunton, Massachusetts, USA","birthName":"John Lennox","bio":"Alan Gifford was born on March 11, 1911 in Taunton, Massachusetts, USA as John Lennox. He was an actor, known for 2001: A Space Odyssey (1968), Phase IV (1974) and Ragtime (1981). He was married to Blanch. He died on March 20, 1989 in Blairgowrie, Perthshire, Scotland.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0317506","name":"Alan Gifford","idIMDB":"nm0317506"},"actorId":"nm0317506","character":"Poole's Father","urlCharacter":"http://www.imdb.com/character/ch0213890","main":true},{"actorName":"Ann Gillis","urlProfile":"http://www.imdb.com/name/nm0319268","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjQ4MjM3M15BMl5BanBnXkFtZTgwMDM0MzUyMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1927","placeOfBirth":" Little Rock, Arkansas, USA","birthName":"Alma Mabel Conner","bio":"Ann Gillis was born Alma Mabel Conner on February 12, 1927, in Little Rock, Arkansas. At age seven, she appeared in her first film, Men in White (1934), as an extra. During the next two years, she had uncredited appearances in six more films until she received her first major role in King of Hockey (1936). Warner Brothers Studios gave significant screen time to Gillis in this movie, in hopes that she would become another Shirley Temple. Although (like all child stars of the 1930s) she never achieved Temple's level of fame, for the next several years Gillis starred in many films, almost always playing a spoiled, bratty character. She had two rare sympathetic roles as Becky Thatcher in The Adventures of Tom Sawyer (1938) and as the title character in Little Orphan Annie (1938). One scene in The Adventures of Tom Sawyer called for her to go into screaming hysterics when her character was trapped in a cave of bats, and Gillis delivered in a powerful performance that is probably the most memorable scene of her film career. As Gillis grew older, however, her career slowed down, and she left Hollywood in 1947. When she left Hollywood she married Paul Ziebold and had 2 sons. She then divorced, relocated to New York City and married Richard Fraser, a Scottish-born actor (they had a son born in 1958). During the 1950s and '60s, Gillis made sporadic television appearances, and in 1959, she hosted a national telecast presentation of The Adventures of Tom Sawyer. Gillis and her husband moved to England in 1961, and they were living in London when they heard of a casting call for 2001: A Space Odyssey (1968) that called for an American actress living in the city. Gillis auditioned and got the role; it remains her final film to date.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjQ4MjM3M15BMl5BanBnXkFtZTgwMDM0MzUyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0319268","name":"Ann Gillis","idIMDB":"nm0319268"},"actorId":"nm0319268","character":"Poole's Mother","urlCharacter":"http://www.imdb.com/character/ch0213891","main":true}],"seasons":[],"idIMDB":"tt0062622","urlIMDB":"http://www.imdb.com/title/tt0062622","business":{"budget":{"money":"$12,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"£69,567","country":"UK","day":"30","month":"11","year":"2014","remarks":"19 Screens"}],"gross":[{"money":"$56,954,992","country":"USA","day":"31","month":"05","year":"2016","remarks":""},{"money":"$56,954,992","country":"USA","day":"31","month":"12","year":"2001","remarks":""},{"money":"$239,621","country":"USA","day":"31","month":"12","year":"2001","remarks":""},{"money":"$56,715,371","country":"USA","day":"31","month":"12","year":"1977","remarks":""},{"money":"$21,500,000","country":"USA","day":"31","month":"12","year":"1970","remarks":""},{"money":"$32,700,000 (USA)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"$190,700,000 (Worldwide)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"$31,000,000 (Worldwide)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"$12,000,000","country":"Non-USA","day":"31","month":"12","year":"1969","remarks":""},{"money":"$49,782","country":"Australia","day":"18","month":"03","year":"2001","remarks":""},{"money":"$165,590","country":"Germany","day":"04","month":"03","year":"2001","remarks":""},{"money":"$2,978,768 (Hong","country":"Kong","day":"16","month":"05","year":"2010","remarks":""},{"money":"€1,871,524","country":"Spain","day":"20","month":"12","year":"2002","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/2002/\">2002</a>"},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1965/\">1965</a>"},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1965/\">1965</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 29 min (149 min)","2 hr 22 min (142 min) (theatrical release)","2 hr 41 min (161 min) (initial release)"],"soundMix":["4-Track Stereo (35 mm magnetic prints)","70 mm 6-Track (70 mm prints)","DTS 70 mm (2001 re-release)"],"color":["Color (Technicolor)","Color"],"aspectRatio":["2.20 : 1","2.35 : 1 (35 mm prints)"],"camera":["Mitchell Camera (Centrifuge Sequence)","Panavision Cameras and Lenses"],"laboratory":["Metrocolor","Technicolor"],"filmLength":["3,845 m (Sweden, 35 mm)","4,805 m (Sweden, 70 mm)","5,050 m (Finland, 70 mm)","5,520 m (premiere version) (70 mm) (USA)"],"negativeFormat":["65 mm (Eastman 50T 5251)"],"cinematographicProcess":["Cinerama","Todd-AO","Super Panavision 70"],"printedFilmFormat":["16 mm (\"flat\" version)","8 mm (Cineavision, 1:2,35, anamorphic)","Digital (Digital Cinema Package DCP)","35 mm","70 mm"]},"rating":"8.3","metascore":"86","filmingLocations":[{"location":"Desierto de Tabernas, Almería, Andalucía, Spain"}],"rated":"G","awards":[{"award":"Academy Awards, USA 1969","titlesAwards":[{"titleAwardOutcome":"Won Oscar","categories":[{"category":"Best Effects, Special Visual Effects","names":[{"name":"Stanley Kubrick","id":"nm0000040","role":null}]}]},{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Director","names":[{"name":"Stanley Kubrick","id":"nm0000040","role":null}]},{"category":"Best Writing, Story and Screenplay - Written Directly for the Screen","names":[{"name":"Stanley Kubrick","id":"nm0000040","role":null},{"name":"Arthur C. Clarke","id":"nm0002009","role":null}]},{"category":"Best Art Direction-Set Decoration","names":[{"name":"Anthony Masters","id":"nm0557650","role":null},{"name":"Harry Lange","id":"nm0486127","role":null},{"name":"Ernest Archer","id":"nm0033658","role":null}]}]}]},{"award":"BAFTA Awards 1969","titlesAwards":[{"titleAwardOutcome":"Won BAFTA Film Award","categories":[{"category":"Best Art Direction","names":[{"name":"Anthony Masters","id":"nm0557650","role":null},{"name":"Harry Lange","id":"nm0486127","role":null},{"name":"Ernest Archer","id":"nm0033658","role":null}]},{"category":"Best Cinematography","names":[{"name":"Geoffrey Unsworth","id":"nm0005910","role":null}]},{"category":"Best Sound Track","names":[{"name":"Winston Ryder","id":"nm0753160","role":null}]}]},{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best Film","names":[{"name":"Stanley Kubrick","id":"nm0000040","role":null}]}]},{"titleAwardOutcome":"Nominated UN Award","categories":[{"category":"","names":[{"name":"Stanley Kubrick","id":"nm0000040","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2012","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best DVD Collection","names":[{"name":"Warner Bros.","id":null,"role":null},{"name":"Spartacus","id":"tt0054331","role":null},{"name":"Lolita","id":"tt0056193","role":null},{"name":"Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb","id":"tt0057012","role":null},{"name":"A Clockwork Orange","id":"tt0066921","role":null},{"name":"Barry Lyndon","id":"tt0072684","role":null},{"name":"The Shining","id":"tt0081505","role":null},{"name":"Full Metal Jacket","id":"tt0093058","role":null},{"name":"Eyes Wide Shut","id":"tt0120663","role":null},{"name":"Stanley Kubrick: A Life in Pictures","id":"tt0278736","role":null}]}]}]},{"award":"Cinema Writers Circle Awards, Spain 1969","titlesAwards":[{"titleAwardOutcome":"Won CEC Award","categories":[{"category":"Best Foreign Film (Mejor Película Extranjera)","names":[]}]}]},{"award":"David di Donatello Awards 1969","titlesAwards":[{"titleAwardOutcome":"Won David","categories":[{"category":"Best Foreign Production (Migliore Produzione Straniera)","names":[{"name":"Stanley Kubrick","id":"nm0000040","role":null}]}]}]},{"award":"Directors Guild of America, USA 1969","titlesAwards":[{"titleAwardOutcome":"Nominated DGA Award","categories":[{"category":"Outstanding Directorial Achievement in Motion Pictures","names":[{"name":"Stanley Kubrick","id":"nm0000040","role":null}]}]}]},{"award":"Hugo Awards 1969","titlesAwards":[{"titleAwardOutcome":"Won Hugo","categories":[{"category":"Best Dramatic Presentation","names":[{"name":"Stanley Kubrick","id":"nm0000040","role":"screenplay/director"},{"name":"Arthur C. Clarke","id":"nm0002009","role":"story/screenplay"}]}]}]},{"award":"Kansas City Film Critics Circle Awards 1968","titlesAwards":[{"titleAwardOutcome":"Won KCFCC Award","categories":[{"category":"Best Film","names":[]},{"category":"Best Director","names":[{"name":"Stanley Kubrick","id":"nm0000040","role":null}]}]}]},{"award":"Laurel Awards 1968","titlesAwards":[{"titleAwardOutcome":"Won Golden Laurel","categories":[{"category":"Road Show","names":[]}]}]},{"award":"National Board of Review, USA 1969","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Top Ten Films","names":[]}]}]},{"award":"National Film Preservation Board, USA 1991","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"","names":[]}]}]},{"award":"National Society of Film Critics Awards, USA 1969","titlesAwards":[{"titleAwardOutcome":"3rd place NSFC Award","categories":[{"category":"Best Cinematography","names":[{"name":"Geoffrey Unsworth","id":"nm0005910","role":null}]}]}]},{"award":"Online Film & Television Association 1997","titlesAwards":[{"titleAwardOutcome":"Won OFTA Film Hall of Fame","categories":[{"category":"Motion Picture","names":[]}]}]}],"votes":"454,472","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"},{"idCompany":"co0038089","name":"Stanley Kubrick Productions"}],"keywords":{"keywords":["monolith","star child","number in title","computer","year 2001","spacecraft","message from outer space","orchestral music score","asphyxiation","subjective camera","famous line","ancient astronaut","spaceship","spaceship setting","space expedition","asphyxiation in space","spacesuit","space exploration","spacewalk","space station","jogging","space travel","astronaut","mission","evolution","moon","outpost","future","alien","technology","hibernation","ape","human in outer space","stargate","bracewell probe","alien probe","waterhole","space","drawing","baby","bed","hotel room","extreme close up","flashback","top secret","video recording","rescue attempt","deception","explosion","news report","pilot","orb","vortex","electromagnetic pulse","photographer","crater","council","escape pod","asteroid","russian","satellite","freeze frame","slow motion scene","solar system","sun","animal killing","animal attack","beaten to death","beating","sabotage","science runs amok","no opening credits","ufo","earth viewed from space","desert","film split into chapters","leopard","ambiguity","first part","miocene","prehistory","trapped in space","future shock","70mm film","avant garde","location in title","visual metaphor","airlock","flash forward","video telephone","pay phone","compilation music score","digit in title","overture","ambiguous ending","millennialism","rapid aging","toilet","metaphysics","bathroom","techne","voyage","voyage of discovery","technophobia","suspended animation","stars","space voyage","singing","silence","cryogenic suspension","bedroom","aging","year in title","psychadelic image","vacuum","number in character's name","long take","very little dialogue","computer chess","transfiguration","trans world airline","stewardess","space shuttle","rebirth","messiah","father daughter relationship","cold war","airline","soviet american relations","carl jung","scientist","surrealism","doctor","psychedelic","talking computer","super computer","space hero","outer space","man versus machine","man ape","evil computer","cult film","cult director","famous opening theme","classical music score","alien technology","alien intelligence","shuttle craft","quarantine","murder","lip reading","explosive decompression","bone","archeological dig","blue danube waltz","strauss also sprach zarathustra","moon base","human versus computer","blockbuster","prehistoric times","nasa","zero gravity","artificial intelligence","visionary","jupiter the planet","product placement","famous score","planetary alignment","cryonics","satellite dish","computer breakdown","based on short story","moon landing","epic","negative footage","alien contact","cryogenics","birthday","based on novel","independent film","surprise ending","character's point of view camera shot","tribe","chess"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:05:49"}}