{"data":{"movies":[{"title":"Flesh and Fantasy","originalTitle":"","year":"1943","releaseDate":"19431029","directors":[{"name":"Julien Duvivier","id":"nm0245213"}],"writers":[{"name":"Ellis St. Joseph","id":"nm0820713"},{"name":"Oscar Wilde","id":"nm0928492"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzMwMjQwN2UtOGM4My00YTZkLWFkODAtZDA2YWY4ZDM2NDg5XkEyXkFqcGdeQXVyNjc0MzMzNjA@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Fantasy","Romance"],"plot":"Two clubmen discuss the occult, introducing three weird tales: 1) Plain, bitter Henrietta secretly loves law student Michael. Then on Mardi Gras night, a mysterious stranger gives her a mask of beauty that she must return at midnight. 2) At a party, palmist Podgers makes uncannily accurate predictions, later telling skeptic Marshal Tyler that he will murder someone. The notion obsesses Tyler, with ironic consequences. 3) High wire artist Gaspar dreams of falling, then loses his nerve. He recognizes Joan from his dreams, and falls for her. Will any of his dreams, involving Joan and disaster, come true?","simplePlot":"An anthology of three loosely connected occult tales, with ironic and romantic twists.","actors":[{"actorName":"Edward G. Robinson","urlProfile":"http://www.imdb.com/name/nm0000064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzcwMzU5Nl5BMl5BanBnXkFtZTYwNTkwMjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1893","placeOfBirth":" Bucharest, Romania","birthName":"Emmanuel Goldenberg","height":"5' 7\" (1.7 m)","bio":"Edward G. Robinson arrived in the United States at age ten, and his family moved into New York's Lower East Side. He took up acting while attending City College, abandoning plans to become a rabbi or lawyer. The American Academy of Dramatic Arts awarded him a scholarship, and he began work in stock, with his new name, in 1913. Broadway was two years later; he worked steadily there for 15 years. His work included \"The Kibitzer\", a comedy he co-wrote with Jo Swerling. His film debut was a small supporting part in the silent The Bright Shawl (1923), but it was with the coming of sound that he hit his stride. His stellar performance as snarling, murderous thug Rico Bandello in Little Caesar (1931)--all the more impressive since in real life Robinson was a sophisticated, cultured man with a passion for fine art--set the standard for movie gangsters, both for himself in many later films and for the industry. He portrayed the title character in several biographical works, such as Dr. Ehrlich's Magic Bullet (1940) and A Dispatch from Reuter's (1940). Psychological dramas included Flesh and Fantasy (1943), Double Indemnity (1944), The Woman in the Window (1944)and Scarlet Street (1945). Another notable gangster role was in Key Largo (1948). He was \"absolved\" of allegations of Communist affiliation after testifying as a friendly witness for the House Un-American Activities Committee during the McCarthy hysteria of the early 1950s. In 1956 he had to sell off his extensive art collection in a divorce settlement and also had to deal with a psychologically troubled son. In 1956 he returned to Broadway in \"Middle of the Night\". In 1973 he was awarded a special, posthumous Oscar for lifetime achievement.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzcwMzU5Nl5BMl5BanBnXkFtZTYwNTkwMjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000064","name":"Edward G. Robinson","nicknames":["Eddie","Manny"],"idIMDB":"nm0000064"},"actorId":"nm0000064","character":"Marshall Tyler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Boyer","urlProfile":"http://www.imdb.com/name/nm0000964","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU0MzQ3ODU1Ml5BMl5BanBnXkFtZTcwNjc5NTYwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1899","placeOfBirth":" Figeac, Lot, France","height":"5' 9\" (1.75 m)","bio":"Charles Boyer studied philosophy before he went to the theater where he gave his debut in 1920. Although he had at first no intentions to pursue a career at the movies (his first movie was L'homme du large (1920) by Marcel L'Herbier) he used his chance in Hollywood after several filming stations all over Europe. In the beginning of his career his beautiful voice was hidden by the silent movies but in Hollywood he became famous for his whispered declarations of love (like in movies with Greta Garbo, Marlene Dietrich or Ingrid Bergman). In 1934 he married Pat Paterson, his first and (unusual for a star) only wife. He was so faithful to her that he decided to commit suicide two days after her death in 1978.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU0MzQ3ODU1Ml5BMl5BanBnXkFtZTcwNjc5NTYwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000964","name":"Charles Boyer","nicknames":["The Latin Lover"],"idIMDB":"nm0000964"},"actorId":"nm0000964","character":"Paul Gaspar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barbara Stanwyck","urlProfile":"http://www.imdb.com/name/nm0001766","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjMxODIzODEzNF5BMl5BanBnXkFtZTYwNDgwNjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1907","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Ruby Catherine Stevens","height":"5' 5\" (1.65 m)","bio":"Today Barbara Stanwyck is remembered primarily as the matriarch of the family known as the Barkleys on the TV western The Big Valley (1965), wherein she played Victoria, and from the hit drama The Colbys (1985). But she was known to millions of other fans for her movie career, which spanned the period from 1927 until 1964, after which she appeared on television until 1986. It was a career that lasted for 59 years. Barbara Stanwyck was born Ruby Catherine Stevens on July 16, 1907, in Brooklyn, New York, to working class parents Catherine Ann (McPhee) and Byron E. Stevens. Her father, from Massachusetts, had English ancestry, and her Canadian mother, from Nova Scotia, was of Scottish and Irish descent. Stanwyck went to work at the local telephone company for fourteen dollars a week, but she had the urge (a dream--that was all it was) somehow to enter show business. When not working, she pounded the pavement in search of dancing jobs. The persistence paid off. Barbara was hired as a chorus girl for the princely sum of $40 a week, much better than the wages she was getting from the phone company. She was seventeen, and was going to make the most of the opportunity that had been given her. In 1928 Barbara moved to Hollywood, where she was to start one of the most lucrative careers filmdom had ever seen. She was an extremely versatile actress who could adapt to any role. Barbara was equally at home in all genres, from melodramas, such as Forbidden (1932) and Stella Dallas (1937), to thrillers, such as Double Indemnity (1944), one of her best films, also starring Fred MacMurray (as you have never seen him before). She also excelled in comedies such as Remember the Night (1940) and The Lady Eve (1941). Another genre she excelled in was westerns, Union Pacific (1939) being one of her first and TV's The Big Valley (1965) (her most memorable role) being her last. In 1983, she played in the ABC hit mini-series The Thorn Birds (1983), which did much to keep her in the eye of the public. She turned in an outstanding performance as Mary Carson. Barbara was considered a gem to work with for her serious but easygoing attitude on the set. She worked hard at being an actress, and she never allowed her star quality to go to her head. She was nominated for four Academy Awards, though she never won. She turned in magnificent performances for all the roles she was nominated for, but the \"powers that be\" always awarded the Oscar to someone else. However, in 1982 she was awarded an honorary Academy Award for \"superlative creativity and unique contribution to the art of screen acting.\" Sadly, Barbara died on January 20, 1990, leaving 93 movies and a host of TV appearances as her legacy to us.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjMxODIzODEzNF5BMl5BanBnXkFtZTYwNDgwNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001766","name":"Barbara Stanwyck","nicknames":["Missy","The Queen","Babs"],"idIMDB":"nm0001766"},"actorId":"nm0001766","character":"Joan Stanley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Betty Field","urlProfile":"http://www.imdb.com/name/nm0275897","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTcwNjViYjgtNzQ1Mi00YWQzLWEwZTEtM2UyNDE5NzdkMjk4XkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1916","placeOfBirth":" Boston, Massachusetts, USA","height":"5' 5\" (1.65 m)","bio":"Thespian Betty Field was born in Boston on February 8, 1916, the daughter of a salesman and his wife. Ancestors on her father's side were Mayflower colonists Priscilla and John Alden. Her parents divorced while she was still young and Betty eventually learned to speak Spanish while traveling with her mother to various Spanish-speaking countries during her childhood. Mother and daughter settled in Newton, Massachusetts, after the mother remarried. Betty's passion for the theatre was sparked during her early teens and by 1932 she was enrolled at the American Academy of Dramatic Art. She made her professional debut in a 1933 summer stock production of \"The First Mrs. Fraser\" and soon was cast in stage roles elsewhere. She even found work in a London theater production of \"She Loves Me\" in early 1934. Rather plaintive in appearance with flat but highly distinctive tones, Betty's Broadway debut came about as an understudy in the comedy \"Page Miss Glory\" in November of 1934, courtesy of George Abbott, in which Betty also had a minor role. Therafter she performed frequently in the comedy mold, and in the service of Abbott, with such delightful plays as \"Three Men on a Horse (1935), \"Boy Meets Girl\" (1936) \"Room Service\" (1937) and \"The Primrose Path (1939), and earning fine reviews for the last two. After seeing her performance on stage as Henry Aldrich's girlfriend Barbara in \"What a Life\" (1938), Paramount executives utilized her services when they transferred What a Life (1939) to film. The studio not only liked what they saw but signed her to a seven-year contract. Throughout the 1940s Betty appeared in a variety of leading ingénue and co-star roles. The important part of Mae, the farm girl, in John Steinbeck's classic Of Mice and Men (1939) starring Burgess Meredith and Lon Chaney was an early highlight, although it didn't provide her the necessary springboard for stardom. Part of the problem was that the rather reserved actress tended to shun the Hollywood scene (she still lived quietly with her mother). While performing for Abbott again on Broadway in \"Ring Two\" (1939), Betty met the show's playwright Elmer Rice and the couple married in 1942. Their three children, John Alden, Judith and Paul, would appear on occasion with their mother on the summer stock stage. Betty also enhanced husband Rice's plays \"Flight to the West\" (1940) and \"A New Life\" (1943), which were designed especially for her. Betty offered consistent, quality work even when the movies she appeared in met with less-than-stellar reviews. She was afforded the opportunity to work with some of Hollywood's finest leading men, including Fredric March in Victory (1940) and Tomorrow, the World! (1944), John Wayne in The Shepherd of the Hills (1941), Robert Cummings in Flesh and Fantasy (1943) and Joel McCrea in The Great Moment (1944). Tops on the list was her heart-tugging performance as the anguished daughter victimized by father Claude Rains in the classic soaper Kings Row (1942). She purposely did not renew her Paramount contract at this point and, following another sterling performance in The Southerner (1945), took a long break from camera work. Back on Broadway, she appeared in such distinguished plays as \"The Voice of the Turtle\" and her husband's \"Dream Girl\" (Rice also directed) for career sustenance. She won the New York Drama Critics Circle award for the latter in 1946. Her Hedvig in Ibsen's \"The Wild Duck\" was also critically lauded. An isolated return to Paramount to play what should have been a career highlight ended up a major disappointment,. While her Daisy Buchanan in F. Scott Fitzgerald's The Great Gatsby (1949) had mixed reviews (some felt she was miscast and not glamorous enough for the part), the movie itself (which was extensively trimmed) and her underwhelming co-star Alan Ladd were also cited as problems. Still a marquee value on Broadway, however, she displayed great range in such fare as \"Twelfth Night\", \"The Rat Race\", \"Peter Pan\" (taking over for Jean Arthur), \"The Fourposter\" (she and Burgess Meredith replaced Jessica Tandy and Hume Cronyn) and \"Ladies of the Corridor\" Betty's soulful features took on a hardened, careworn veneer by the time she returned to Hollywood in the mid-1950's. Nevertheless, she had a \"Field\" day as a character player appearing in a number of drab, dressed-down roles. She lent credence to a number of fascinatingly flawed small-town moms and matrons in films, among them cream-of-the-crop hits Picnic (1955), starring Kim Novak, Bus Stop (1956) with Marilyn Monroe and Peyton Place (1957) headlining Lana Turner and Hope Lange. The stage plays \"The Seagull\", \"Waltz of the Toreadors\", \"Touch of the Poet\" and \"Separate Tables\" also accentuated this newly mature phase of her career. TV took up a large percentage of Betty's time in the 1950s and 1960s with a number of showcase roles. She continued at a fairly steady pace but without much fanfare (as she preferred). Divorced from Rice in 1956, she married and split from lawyer and criminologist Edwin J. Lukas before settling down permanently with husband/artist Raymond Olivere in 1968. Betty's swan song in films was a small, featured part in Clint Eastwood's Coogan's Bluff (1968) as a floozie type, looking noticeably older than she was. Mixing in such stalwart, brittle roles on stage as Amanda in \"The Glass Menagerie\" and Birdie in \"The Little Foxes\", she made one of her last theater appearances in the difficult role of the mother in \"The Effect of Gamma Rays on \"Man-in-the-Moon Marigolds\" in 1971. Betty suffered a fatal cerebral hemorrhage in Hyannis, Massachusetts in 1973, just as she was about to leave and film The Day of the Locust (1975). Cast in the flashy role of \"Big Sister\", an evangelist, her part was taken over by Geraldine Page. At age 57, Hollywood lost a somewhat undervalued talent who enjoyed the work more than the stardom that often accompanied it.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTcwNjViYjgtNzQ1Mi00YWQzLWEwZTEtM2UyNDE5NzdkMjk4XkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0275897","name":"Betty Field","idIMDB":"nm0275897"},"actorId":"nm0275897","character":"Henrietta","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Cummings","urlProfile":"http://www.imdb.com/name/nm0191950","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTg2NjU4NV5BMl5BanBnXkFtZTYwMDEwMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 June 1910","placeOfBirth":" Joplin, Missouri, USA","birthName":"Charles Clarence Robert Orville Cummings","height":"5' 10\" (1.78 m)","bio":"Effective light comedian of '30s and '40s films and '50s and '60s TV series, Robert Cummings was renowned for his eternally youthful looks (which he attributed to a strict vitamin and health-food diet). He was educated at Carnegie Tech and the American Academy of Dramatic Arts. Deciding that Broadway producers would be more interested in an upper-crust Englishman than a kid from Joplin, Missouri, Cummings passed himself off as Blade Stanhope Conway, British actor. The ploy was successful. Cummings decided that if it worked on Broadway, it would work in Hollywood, so he journeyed west and assumed the identity of a rich Texan named Bruce Hutchens. The plan worked once more, and he began securing small parts in films. He soon reverted to his real name and became a popular leading man in light comedies, usually playing well-meaning, pleasant but somewhat bumbling young men. He achieved much more success, however, in his own television series in the '50s, The Bob Cummings Show (1955) and My Living Doll (1964).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTg2NjU4NV5BMl5BanBnXkFtZTYwMDEwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0191950","name":"Robert Cummings","nicknames":["Bob"],"idIMDB":"nm0191950"},"actorId":"nm0191950","character":"Michael","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas Mitchell","urlProfile":"http://www.imdb.com/name/nm0593775","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTcwNjAwMDI2M15BMl5BanBnXkFtZTcwNDMyNTUwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1892","placeOfBirth":" Elizabeth, New Jersey, USA","birthName":"Thomas John Mitchell","height":"5' 10\" (1.78 m)","bio":"Thomas Mitchell was one of the great American character actors, whose credits read like a list of the greatest films of the 20th century: Lost Horizon (1937); Stagecoach (1939); The Hunchback of Notre Dame (1939); Mr. Smith Goes to Washington (1939); Gone with the Wind (1939); It's a Wonderful Life (1946) and High Noon (1952). His portrayals are so diverse and convincing that most people don't even realize that one actor could have played them all. He won a Best Supporting Actor Oscar in 1940 for his role as the drunken Doc Boone in John Ford's Stagecoach (1939).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTcwNjAwMDI2M15BMl5BanBnXkFtZTcwNDMyNTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0593775","name":"Thomas Mitchell","nicknames":["Tommy"],"idIMDB":"nm0593775"},"actorId":"nm0593775","character":"Septimus Podgers","urlCharacter":"http://www.imdb.com/character/ch0149267","main":true},{"actorName":"Charles Winninger","urlProfile":"http://www.imdb.com/name/nm0935415","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjZmOTEzOGEtOWRjMS00NGM2LWI4OGMtODcyOTM5NDliYTg1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1884","placeOfBirth":" Athens, Wisconsin, USA","height":"5' 6\" (1.68 m)","bio":"Short, chubby-framed, twinkle-eyed, ever-huggable Charles Winninger was a veteran vaudevillian by the time he arrived in talking films. Born in a trunk to show biz folk in Athens, Wisconsin, on May 26, 1884, he was initially christened Karl Winninger. He left school while quite young (age 8) to join and tour with his parent's vaudeville family act which was called Winninger Family Concert Co. Upon his parents' retirement, he and his five brothers went off to play in various stock and repertory companies. On film Charlie found an \"in\" with silent comedy shorts between 1915-1916 but never truly settled into the movie business until the advent of sound. In the meantime Broadway made great use of his musical comedy talents, marking his debut with \"The Yankee Girl\" in 1910 which also featured actress (and later stage star) Blanche Ring. He married Blanche in 1912 and the couple went on to star together quite frequently in vaudeville and on Broadway, including the musical \"When Claudia Smiles\" (1914) in which Blanche played the title role. Throughout the 1920s there were plenty of roles for Charlie on the Great White Way including a stint with the Ziegfeld Follies (1920), several Winter Garden productions, and in such musical comedy showcases as \"The Broadway Whirl\" (1921) (with Blanche), \"The Good Old Days\" (1923), \"No, No, Nanette\" (1925) and \"Yes, Yes, Yvette\" (1927). His most significant contribution was originating the role of beloved Cap'n Andy in \"Showboat\" (1927). Playing the Kern/Hammerstein musical for two years straight, he eagerly returned to the role on Broadway in 1932. With the success of \"Show Boat,\" Hollywood started taking more of an interest in the grey-haired song-and-dance man for character roles. Such early talking movies included the slapstick comedy Soup to Nuts (1930) with Ted Healy and The Three Stooges. Though Charlie was known for adding his immeasurable touch to the comedy genre (Flying High (1931) and Woman Chases Man (1937)), he was also a warm-hearted presence in heavier pictures as well, including the melodramas The Bad Sister (1931) with Bette Davis and The Sin of Madelon Claudet (1931) with Helen Hayes, and rugged adventures Gun Smoke (1931) and White Fang (1936). Although he did not play his famous stage role in the 1929 version, Charlie was thankfully able to preserve his beloved Cap'n Andy to film in the superb Irene Dunne/Allan Jones remake of Show Boat (1936). He became so associated with the riverboat captain that he was asked to create several variations of the character on radio. Charlie was relied upon for his benign, errant dads, old-theater entertainers, lovable drunks and other rather wanderlust types in film, characters that usually represented old-fashioned common sense or mores. He was quite entertaining in such classics as Nothing Sacred (1937), Three Smart Girls (1936) and Destry Rides Again (1939). In the 1940s he brightened up a number of MGM comedies and musicals including Babes in Arms (1939), Little Nellie Kelly (1940), Ziegfeld Girl (1941), When Ladies Meet (1941), Broadway Rhythm (1944)_ and Living in a Big Way (1947). One of his last important roles was playing Will Rogers' Judge Priest role in director John Ford's film The Sun Shines Bright (1953), his only leading film role. He and wife Blanche never appeared together in a film although Blanche did play herself in the film If I Had My Way (1940), a film that featured Charlie. His Broadway swan song was in \"Music in the Air\" in 1951 and his final film occurred about a decade later with Raymie (1960). He also played Santa Claus in the hour-long entertainment The Miracle of the White Reindeer (1960) that same year. TV roles dominated much of his work in the 50s. On the one-season The Charles Farrell Show (1956) he played the star's dear old dad. Divorced from wife Blanche in 1951, Charlie subsequently married stage actress-turned-novelist and screenwriter Gertrude Walker whom he originally met on Broadway when he returned to \"Show Boat\" in 1932 (Gertrude played the role of Lottie). Retired for many years, Charlie died in 1969 following an extended illness at the age of 84.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjZmOTEzOGEtOWRjMS00NGM2LWI4OGMtODcyOTM5NDliYTg1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0935415","name":"Charles Winninger","idIMDB":"nm0935415"},"actorId":"nm0935415","character":"King Lamarr","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anna Lee","urlProfile":"http://www.imdb.com/name/nm0496819","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzIxNjc0M15BMl5BanBnXkFtZTcwMzA5OTExOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 January 1913","placeOfBirth":" Ightham, Kent, England, UK","birthName":"Joan Boniface Winnifrith","height":"5' 4\" (1.63 m)","bio":"The daughter of a clergyman, Anna Lee was born Joan Boniface Winnifrith and encouraged to pursue an acting career by her father. After training at London's Royal Albert Hall, she took to the boards and later began appearing in English films, first as an extra, then working her way up to featured parts and finally earning the unofficial title \"Queen of the Quota Quickies.\" Lee and her husband, director Robert Stevenson, relocated to Hollywood in the late 1930s, and Lee began starring in stateside productions as well as becoming a fixture of the John Ford stock company (she appeared in How Green Was My Valley (1941), Fort Apache (1948) and a half-dozen others). In 1970, she became the seventh wife of novelist, poet and playwright Robert Nathan (Portrait of Jennie (1948), The Bishop's Wife (1947)); they married three months after they met. Now widowed, Lee soldiers on, regularly playing wealthy Lila Quartermaine on the TV soaper General Hospital (1963).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzIxNjc0M15BMl5BanBnXkFtZTcwMzA5OTExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0496819","name":"Anna Lee","nicknames":["Queen of the Quota Quickies"],"idIMDB":"nm0496819"},"actorId":"nm0496819","character":"Rowena","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dame May Whitty","urlProfile":"http://www.imdb.com/name/nm0926599","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NTIxMDQ4N15BMl5BanBnXkFtZTcwNTY4NDYwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1865","placeOfBirth":" Liverpool, Merseyside, England, UK","birthName":"Mary Louisa Whitty","bio":"Born Mary Whitty on June 19, 1865 to a Liverpool newspaper editor and his wife, she became known as May Whitty to the world. She first stepped on the London stage in 1882. She worked as an understudy at the St. James Theatre, and then, began playing leading roles when she joined a traveling stock company. After nearly 25 years as one of the leading British stage actresses, she appeared in her first film, Enoch Arden (1914), in Great Britain. She did not care much for the experience, and appeared in only a few silent films afterward. In 1918, based on her service to the arts and for performing for the troops during World War I, she was named Dame Commander of the British Empire by King George. After a string of 1930s Broadway successes, she went to Hollywood, following the example of many of her British contemporaries. She found herself usually cast in high-born roles, sometimes crotchety, sometimes imperious, but often warm-hearted. Classic examples of these were the crotchety Mrs. Bramson, an invalid who falls for the homicidal Robert Montgomery in Night Must Fall (1937), Miss Froy in The Lady Vanishes (1938) where she plays the title character enduring great physical exertion while maintaining her poise and dignity, and as Lady Beldon in Mrs. Miniver (1942), a role which garnered an Oscar nomination for best supporting actress. She proved herself equally capable of playing working-class roles, such as the dowdy phony psychic in The Thirteenth Chair (1937). Besides two Oscar nominations, she also won the National Board of Review best acting award for the 1937 film, Night Must Fall (1937). In 1892, she married London producer Ben Webster. They were the parents of a daughter, Margaret Webster, who became a playwright and actress in her own right. Margaret penned her mother's biography, The Same Only Different, published in 1969. Whitty died at the age of 82 from cancer in Beverly Hills, shortly after completed her scenes in the film The Sign of the Ram (1948). She once said, \"I've got everything Betty Grable has...only I've had it longer.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NTIxMDQ4N15BMl5BanBnXkFtZTcwNTY4NDYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0926599","name":"Dame May Whitty","nicknames":["Old Faithful"],"idIMDB":"nm0926599"},"actorId":"nm0926599","character":"Lady Pamela Hardwick","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"C. Aubrey Smith","urlProfile":"http://www.imdb.com/name/nm0807580","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDQxOTI0MV5BMl5BanBnXkFtZTYwMjM3MjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 July 1863","placeOfBirth":" London, England, UK","birthName":"Charles Aubrey Smith","height":"6' 2\" (1.88 m)","bio":"Movie roles are sometimes based upon what the audience expects to see. If the role called for the tall stereotypical Englishmen with the stiff upper lip and stern determination, that man would be C. Aubrey Smith, graduate of Cambridge University, a leading Freemason and a test cricketer for England. Smith was 30 by the time he embarked upon a career on the stage. It took another 20 plus years before he entered the flickering images of the movies. By 1915, Smith was over 50 in a medium that demanded young actors and starlets. For the next ten years, he appeared in a rather small number of silent movies, and after that, he faded from the scene. It was in 1930, with the advent of sound, that Smith found his position in the movies and that position would be distinguished roles. He played military officers, successful business men, ministers of the cloth and ministers of government. With the bushy eyebrows and stoic face, he played men who know about honour, tradition, and the correct path. He worked with big stars such as Greta Garbo, Douglas Fairbanks Jr. and Shirley Temple. As for honours, Smith received the Order of the British Empire in 1938 and was knighted in 1944. He continued to work up to the time of his death.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDQxOTI0MV5BMl5BanBnXkFtZTYwMjM3MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0807580","name":"C. Aubrey Smith","idIMDB":"nm0807580"},"actorId":"nm0807580","character":"Dean of Norwalk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Benchley","urlProfile":"http://www.imdb.com/name/nm0070361","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWNiMjE3NTktMzA2MC00ZjYyLWEzOTUtNWE4MTI1NDBiODdmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1889","placeOfBirth":" Worcester, Massachusetts, USA","birthName":"Robert Charles Benchley","bio":"Although by his own account Benchley was not quite a writer and not quite an actor, he managed to become one of the best-known humorists and comedians of his time. As a Harvard undergraduate, Benchley gave his first comic performance, impersonating a befuddled after-dinner speaker. The act made him a campus celebrity -- and remained in Benchley's repertoire for the rest of his life. (Landing the position of editor of the Harvard Lampoon was the other highlight of his college career.) As a post-graduate journalist, between frequent firings and other disruptions, Benchley made his mark as a theater critic and as writer of whimsical musings on the vagaries of modern life. He served briefly as managing editor of the magazine Vanity Fair, where his lieutenants were Dorothy Parker and Robert E. Sherwood, but he quit to protest Parker's firing. (Benchley, Parker and Sherwood were among the regulars at the so-called Algonquin Round Table, a social circle of New York wits that also included Harpo Marx and George S. Kaufman). Benchley was among the first contributors to The New Yorker, where his work influenced other writers -- such as E.B. White and James Thurber","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWNiMjE3NTktMzA2MC00ZjYyLWEzOTUtNWE4MTI1NDBiODdmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0070361","name":"Robert Benchley","nicknames":["Bob"],"idIMDB":"nm0070361"},"actorId":"nm0070361","character":"Doakes","urlCharacter":"http://www.imdb.com/character/ch0040207","main":true},{"actorName":"Edgar Barrier","urlProfile":"http://www.imdb.com/name/nm0057422","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmJhYTNlN2QtYTUwMi00YjUzLWFmZDEtZjUxYzcxOGZhOTFmL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1907","placeOfBirth":" New York City, New York, USA","bio":"Edgar Barrier was born on March 4, 1907 in New York City, New York, USA. He was an actor, known for Phantom of the Opera (1943), Macbeth (1948) and Cyrano de Bergerac (1950). He died on June 20, 1964 in Hollywood, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmJhYTNlN2QtYTUwMi00YjUzLWFmZDEtZjUxYzcxOGZhOTFmL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0057422","name":"Edgar Barrier","idIMDB":"nm0057422"},"actorId":"nm0057422","character":"Stranger in Mask Shop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Hoffman","urlProfile":"http://www.imdb.com/name/nm0388854","urlPhoto":"","biography":{"dateOfBirth":"2 February 1904","placeOfBirth":" Russia","bio":"David Hoffman was born on February 2, 1904 in Russia. He was an actor, known for A Night in Casablanca (1946), The Beast with Five Fingers (1946) and The Mask of Dimitrios (1944). He died on June 19, 1961 in Seattle, Washington, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0388854","name":"David Hoffman","idIMDB":"nm0388854"},"actorId":"nm0388854","character":"Davis","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0035885","urlIMDB":"http://www.imdb.com/title/tt0035885","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"08","month":"03","year":"1943","remarks":null},null],"copyrightHolder":"Universal Pictures Company, Inc. (original), U.S. Copyright LP12297, 30 September 1943"},"technical":{"runtime":["1 hr 34 min (94 min)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["2,567.65 m (10 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.0","filmingLocations":[{"location":"European Street, Backlot, Universal Studios - 100 Universal City Plaza, Universal City, California, USA"}],"rated":"APPROVED","awards":[],"votes":"570","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"}],"keywords":{"keywords":["dream","mask","occult","anthology","prediction","supernatural","mardi gras","law student","fortune teller","karma","kismet","predestination","midget","fatalism","nightmare","dutch angle","montage","pet cat","ocean liner","fate","double exposure","wooden mallet","palm reader","destiny","cat fancier","seer","wine cellar","last will and testament","vicar","port wine","biblical quote","shakespearean quotation","london england","strangled to death","throwing body off bridge","tower bridge","stroke of midnight","french quarter","london bobby","quote from hamlet","cafe","new orleans","death mask","costume shop","reference to joan of arc","reference to lucretia borgia","fireworks","broken mirror","reading a story","men's club","acting drunk","aerialist","transatlantic voyage","deja vu","fountain","omnibus film","chocolate candy","tightrope walker","episodic structure","circus"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:33:48"}}