{"data":{"movies":[{"title":"Destry","originalTitle":"","year":"1954","releaseDate":"19541201","directors":[{"name":"George Marshall","id":"nm0550892"}],"writers":[{"name":"Edmund H. North","id":"nm0636002"},{"name":"D.D. Beauchamp","id":"nm0064305"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NDM4ODQ4NF5BMl5BanBnXkFtZTcwNTcwOTYzMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Western"],"plot":"In the old West, a small frontier town is being controlled by ruthless mob boss Decker and his cronies. After the local sheriff dies under mysterious circumstances, Decker arranges to have the town drunk appointed sheriff, thinking he will be ineffectual. But the new sheriff sends for Tom Destry, son of a famous two-fisted lawman, to be his deputy. When Tom arrives, he isn't exactly the swaggering he-man the sheriff had in mind. In fact, Destry doesn't even carry a gun. But the new deputy's mild exterior masks a fierce determination to see justice done, as Decker and the other locals soon discover.","simplePlot":"In his desire to control a frontier town, ruthless town boss Decker appoints the town drunk as sheriff who, in return, hires gunfighter Destry as his deputy.","actors":[{"actorName":"Audie Murphy","urlProfile":"http://www.imdb.com/name/nm0001559","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMzMzNjc5MF5BMl5BanBnXkFtZTcwMzU3MzcxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1924","placeOfBirth":" Kingston, Texas, USA","birthName":"Audie Leon Murphy","height":"5' 8\" (1.73 m)","bio":"Audie Murphy became a national hero during World War II as the most decorated combat soldier of the war. Among his 33 awards was the Medal of Honor, the highest award for bravery that a soldier can receive. In addition, he was also decorated for bravery by the governments of France and Belgium, and was credited with killing over 240 German soldiers and wounding and capturing many more. Audie Leon Murphy was born 20 June 1925 in Kingston, Hunt County, Texas, to Josie Bell (Killian) and Emmett Berry Murphy, poor sharecroppers. After the death of his mother and the outbreak of WWII, Murphy enlisted in the army after being turned down by the Navy and the Marines. Being underage at the time, his older sister and designated legal guardian Corinne provided him a letter of consent. After undergoing basic military training, he was sent first to North Africa. But the Allies drove the German army from Tunisia, their last foothold in North Africa, before Murphys' unit could be sent into battle. His first engagement with Axis forces came when his unit was sent to Europe. First landing on the island of Sicily, next mainland Italy, and finally France, he fought in seven major campaigns over three years and rose from the rank of private to a battlefield commission as a second lieutenant. Part of Murphy's appeal to many people was that he didn't fit the \"image\" most had of a war hero. He was a slight, almost fragile-looking, shy and soft-spoken young man, whose boyish appearance (something he never lost throughout his life; he always looked at least 15 years younger than he actually was) often shocked people when they found out that, for example, during one battle he leaped on top of a burning tank--which was loaded with fuel and ammunition and could have exploded at any second--and used its machine gun to hold off waves of attacking German troops, killing dozens of them and saving his unit from certain destruction and the entire line from being overrun. In September 1945 Murphy was released from active duty, promoted to 1st Lieutenant, and assigned to inactive status. His story caught the interest of superstar James Cagney, who invited Murphy to Hollywood. Cagney Productions paid for acting and dancing lessons but was reluctantly forced to admit that Murphy--at least at that point in his career--didn't have what it took to become a movie star. For the next several years he struggled to make it as an actor, but jobs were few, specifically just two bit parts, in Beyond Glory (1948) and Texas, Brooklyn & Heaven (1948). He finally got a lead role in Bad Boy (1949), and starred in the trouble-plagued production of MGM's The Red Badge of Courage (1951), directed by John Huston. While this film is now considered a minor classic, the politics behind the production sparked an irreparable fissure within the ranks of the studio's upper management. Murphy proved adequate as an actor, but the film, with virtually no female presence (or appeal), bombed badly at the box office. Murphy, however, had already signed with Universal-International Pictures, which was putting him in a string of modestly budgeted Westerns, a genre that suited his easygoing image and Texas drawl. He starred in the film version of his autobiography, To Hell and Back (1955), which was a huge hit, setting a box-office record for Universal that wasn't broken for 20 years until it was finally surpassed by Jaws (1975)). One of his better pictures was Night Passage (1957), a Western in which he played the kid brother of James Stewart. He worked for Huston again on The Unforgiven (1960). Meanwhile, the studio system that Murphy grew into as an actor crumbled. Universal's new owners, MCA, dumped its \"International\" tag in 1962 and turned the studio's focus toward the more lucrative television industry. For theatrical productions, it dropped its roster of contract players and hired actors on a per-picture basis only. That cheap Westerns on the big screen were becoming a thing of the past bode no good for Murphy, either. The Texican (1966), his lone attempt at a new, European form of inexpensive horse opera, to be known as the Spaghetti Western, was unsuccessful. His star was falling fast. In addition to his acting career--he made a total of 44 films--Murphy was also a successful rancher and businessman. He bred and raised thoroughbred horses and owned several ranches in Texas, Arizona and California. He was also a songwriter, and penned hits for such singers as Dean Martin, Eddy Arnold, Charley Pride and many others. His postwar life wasn't all roses, however. He suffered from what is now called Post-Traumatic Stress Disorder (PTSD) but was then called \"combat fatigue\", and was known to have a hair-trigger temper. He woke up screaming at night and slept with a loaded M1911 .45 semi-automatic pistol nearby. He was acquitted of attempted murder charges brought about by injuries he inflicted on a man in a bar fight. Director Don Siegel said in an interview that Murphy often carried a pistol on the set of The Gun Runners (1958) and many of the cast and crew were afraid of him. He had a short-lived and turbulent marriage to actress Wanda Hendrix, and in the 1960s his increasing bouts of insomnia and depression resulted in his becoming addicted to a particularly powerful sleeping pill called Placidyl, an addiction he eventually broke. He ran into a streak of bad financial luck and was forced to declare bankruptcy in 1968. Admirably, he campaigned vigorously for the government to spend more time and money on taking care of returning Vietnam War veterans, as he more than most others knew exactly what kinds of problems they were going to have. On May 18, 1971, Murphy was aboard a private plane on his way to a business meeting when it ran into thick fog near Roanoke, VA, and crashed into the side of a mountain, killing all six aboard. He was buried with full military honors in Arlington National Cemetery. According to cemetery records, the only grave site visited by more people than Murphy's is that of assassinated President John F. Kennedy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMzMzNjc5MF5BMl5BanBnXkFtZTcwMzU3MzcxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001559","name":"Audie Murphy","idIMDB":"nm0001559"},"actorId":"nm0001559","character":"Tom Destry","urlCharacter":"http://www.imdb.com/character/ch0031141","main":true},{"actorName":"Mari Blanchard","urlProfile":"http://www.imdb.com/name/nm0087080","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2I0NWRkNjgtOGQyYi00NzI2LWI4NzktOGMwZGY0NTVkY2RjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1923","placeOfBirth":" Long Beach, California, USA","birthName":"Mary E. Blanchard","height":"5' 6½\" (1.69 m)","bio":"Petite, attractive Mari Blanchard rarely managed get the lucky breaks. The daughter of an oil tycoon and a psychotherapist, she suffered from severe poliomyelitis from the age of nine, which denied her a hoped-for dancing career. For several years, she worked hard to rehabilitate her limbs from paralysis, swimming and later even performing on the trapeze at Cole Brothers Circus. At the urging of her parents, she then attended the University of Southern California from where she graduated with a degree in international law. This was not to lead to a career, either. Sometime in the late 1940's, she joined the Conover Agency as an advertising model and, at the same time, was promoted by famed cartoonist and writer Al Capp, becoming the inspiration for one of his \"L'il Abner\" characters. As the result of an advertisement on the back page of the Hollywood Reporter, Mari was spotted by Paramount and signed to a contract. However, her early experience in the movie business proved an unhappy one, most of her roles being walk-ons and bit parts. Ten Tall Men (1951), for example, limited her to a token stroll down a street, twirling a parasol and smiling seductively at members of the Foreign Legion. It wasn't until Mari joined Universal that her fortunes improved somewhat, with a co-starring role (opposite Victor Mature) in The Veils of Bagdad (1953). After that, it was all downhill again. Burt Lancaster, co-producer and star (with Gary Cooper of the excellent A-grade western Vera Cruz (1954), had requested Mari as his leading lady, but Universal refused her release to United Artists and forbade her to accept the lucrative role (Denise Darcel ended up getting the part). Mari then lost the lead in a much lesser picture,O'Rourke of the Royal Mounted (1954), to Shelley Winters. Instead, she was cast as Venusian Queen Allura in one of the least exciting outings by Universal's leading comic duo, Abbott and Costello Go to Mars (1953). Mari did end up with a respectable starring role in the western Destry (1954), opposite Audie Murphy. A remake of the classic Destry Rides Again (1939), she was cast in the Marlene Dietrich part and took great pains to affect a totally different look, darkening her hair, so as not to be compared to the great star. Even the name of her character was changed from 'Frenchy' to 'Brandy'. \"Destry\" was not all smooth sailing. There was tension between her and director George Marshall (who had also directed the original version) and Mari suffered a facial injury as the result of a fight scene. The film was critically well received. Unfortunately, Universal failed to renew their contract with Miss Blanchard, and her career then went into free-fall. Free-lancing for lesser studios, she played a TB victim injected with a serum turning her into a Mr. Hyde-like killer in the lurid She Devil (1957) (during filming she nearly died of acute appendicitis). Mari then appeared for Republic in the eminently forgettable No Place to Land (1958), before briefly starring in her own short-lived adventure series Klondike (1960). Her last role of note was as the cheerful and likeable town madam in the rollicking John Wayne western comedy McLintock! (1963). Sometime that year, Mari Blanchard developed the cancer which was to claim her life in 1970 at the age of just 47.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2I0NWRkNjgtOGQyYi00NzI2LWI4NzktOGMwZGY0NTVkY2RjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0087080","name":"Mari Blanchard","idIMDB":"nm0087080"},"actorId":"nm0087080","character":"Brandy","urlCharacter":"http://www.imdb.com/character/ch0305525","main":true},{"actorName":"Lyle Bettger","urlProfile":"http://www.imdb.com/name/nm0079328","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjA2Mjc3OV5BMl5BanBnXkFtZTcwNzk5MjYwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1915","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Lyle Stathem Bettger","height":"6' (1.83 m)","bio":"Handsome, blond-haired, steely-eyed villain in many film Westerns. He was never the grizzled outlaw, covered in trail dust. No, he was the immaculate-looking, \"respectable\" (but two-faced) dandy in silk damask vest, often puffing suavely on a cheroot, whose ashes he then might contemptuously flick in the hero's face. He could confront an antagonist wearing a wry smile, even while neatly inserting his dirk between the latter's ribs. One wonders why Bettger, with his Aryan looks and menacing sneer, never became typecast as the stereotypical Nazi SS officer or Gestapo interrogator. (Perhaps the man was just fortunate in that regard.)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjA2Mjc3OV5BMl5BanBnXkFtZTcwNzk5MjYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0079328","name":"Lyle Bettger","idIMDB":"nm0079328"},"actorId":"nm0079328","character":"Decker","urlCharacter":"http://www.imdb.com/character/ch0305526","main":true},{"actorName":"Thomas Mitchell","urlProfile":"http://www.imdb.com/name/nm0593775","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTcwNjAwMDI2M15BMl5BanBnXkFtZTcwNDMyNTUwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1892","placeOfBirth":" Elizabeth, New Jersey, USA","birthName":"Thomas John Mitchell","height":"5' 10\" (1.78 m)","bio":"Thomas Mitchell was one of the great American character actors, whose credits read like a list of the greatest films of the 20th century: Lost Horizon (1937); Stagecoach (1939); The Hunchback of Notre Dame (1939); Mr. Smith Goes to Washington (1939); Gone with the Wind (1939); It's a Wonderful Life (1946) and High Noon (1952). His portrayals are so diverse and convincing that most people don't even realize that one actor could have played them all. He won a Best Supporting Actor Oscar in 1940 for his role as the drunken Doc Boone in John Ford's Stagecoach (1939).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTcwNjAwMDI2M15BMl5BanBnXkFtZTcwNDMyNTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0593775","name":"Thomas Mitchell","nicknames":["Tommy"],"idIMDB":"nm0593775"},"actorId":"nm0593775","character":"Rags Barnaby","urlCharacter":"http://www.imdb.com/character/ch0305528","main":true},{"actorName":"Edgar Buchanan","urlProfile":"http://www.imdb.com/name/nm0118000","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NjY3ODc1MV5BMl5BanBnXkFtZTcwODkxMDU4Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1903","placeOfBirth":" Humansville, Missouri, USA","birthName":"William Edgar Buchanan","height":"5' 11\" (1.8 m)","bio":"At the age of seven, he and his family moved to Oregon. After studying at the University of Oregon, he followed in his father's footsteps and became a dentist, graduating from North Pacific Dental College. From 1929 to 1937, he practiced oral surgery in Eugene, Oregon. He then moved his practice to Altadena, CA. There he joined the Pasadena Community Playhouse, eventually giving up dentistry at the age of 36 to become an actor. He made his film debut in 1939. His chubby face and gravelly voice were featured in over 100 films, but he is perhaps best known for TV roles in Hopalong Cassidy (1952), Judge Roy Bean (1956), Petticoat Junction (1963), and Cade's County (1971).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NjY3ODc1MV5BMl5BanBnXkFtZTcwODkxMDU4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0118000","name":"Edgar Buchanan","idIMDB":"nm0118000"},"actorId":"nm0118000","character":"Mayor Sellers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lori Nelson","urlProfile":"http://www.imdb.com/name/nm0625562","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAxYWY1MTUtOTgzYi00MmUxLWEzY2MtN2RmZThhN2I0OTFjXkEyXkFqcGdeQXVyMjU5OTg5NDc@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 August 1933","placeOfBirth":" Santa Fe, New Mexico, USA","birthName":"Dixie Kay Nelson","bio":"Lori Nelson began her show biz career at the age of two-and-a-half, dancing in a show in her native Santa Fe, New Mexico. She was voted Santa Fe's most talented and beautiful child, and toured the state billed as \"Santa Fe's Shirley Temple.\" At age four, Nelson moved to Hollywood with her parents and there was named Little Miss America. She worked as a fashion photographer's model, then (in the early 1940s) made her first bid for a movie career, testing (unsuccessfully) for a role in Warner Brothers' Kings Row (1942). There was a second false start a few years later, when Arthur M. Landau, a Hollywood producer and self-proclaimed \"discoverer\" of 1930s star Jean Harlow, expressed interest in casting teenage Nelson as Harlow in a movie bio. (The project never materialized.) Agent Milo O. Frank Jr. helped Nelson get into the movies, taking her to Universal to meet with casting people. Nelson trained with the studio dramatic coach, enacted a scene for the front office and ultimately was offered a seven-year contract, which was approved in court on her 17th birthday. After several years at Universal, she freelanced in movies and TV.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAxYWY1MTUtOTgzYi00MmUxLWEzY2MtN2RmZThhN2I0OTFjXkEyXkFqcGdeQXVyMjU5OTg5NDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0625562","name":"Lori Nelson","idIMDB":"nm0625562"},"actorId":"nm0625562","character":"Martha Phillips","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wallace Ford","urlProfile":"http://www.imdb.com/name/nm0285922","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDZjZTM3YzYtMzkwNS00NGZkLTg5OTctYzAyYWFmMmEzMWI2L2ltYWdlXkEyXkFqcGdeQXVyMjU5OTg5NDc@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1898","placeOfBirth":" Bolton, Lancashire, England, UK","birthName":"Samuel Jones Grundy","height":"5' 8\" (1.73 m)","bio":"A stocky, friendly-faced character actor, Ford was born Samuel Jones in England and his childhood rivaled the brutality that Charles Dickens ever dreamed up. He lived for a while in an orphanage after being separated from his parents. While still young, he was sent to a Toronto branch of the orphanage. There, he began a cycle that involved living in 17 foster homes - the longest being with a farm family that treated him like a slave. At age 11 he ran away and joined a vaudeville troupe called the Winnepeg Kiddies, with whom he stayed until 1914. He then joined a friend named Wallace Ford and the two 'hoboed\" their way into the United States. After the friend was crushed to death by a railroad car, he took the name Wallace Ford in his memory and found work in theatrical troupes and repertory companies. On Broadway he acted in \"Abraham Lincoln\", \"Abie's Irish Rose\", and \"Bad Girl\". He left Broadway in 1932 to appear with Joan Crawford in Possessed (1931); he also landed the lead in MGM's notorious Freaks (1932), although his fellow actors proved more memorable. He also co-starred as Walter Huston's amoral brother in one of the studio's few full-blown gangster melodramas, The Beast of the City (1932), starring Jean Harlow in arguably her most hard-bitten role. In all he appeared in over 200 films including five directed by John Ford (The Last Hurrah (1958), The Whole Town's Talking (1935), They Were Expendable (1945), The Lost Patrol (1934) and The Informer (1935)). He also appeared with Henry Fonda in the TV series, \"The Deputy\" that ran from 1959-60. Ford died of a heart attack soon after his last memorable role as \"Old Pa\" in the hit Sidney Poitier drama, A Patch of Blue (1965).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDZjZTM3YzYtMzkwNS00NGZkLTg5OTctYzAyYWFmMmEzMWI2L2ltYWdlXkEyXkFqcGdeQXVyMjU5OTg5NDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0285922","name":"Wallace Ford","idIMDB":"nm0285922"},"actorId":"nm0285922","character":"Doc Curtis","urlCharacter":"http://www.imdb.com/character/ch0305605","main":true},{"actorName":"Mary Wickes","urlProfile":"http://www.imdb.com/name/nm0926897","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzUyNzU3NDQ5MF5BMl5BanBnXkFtZTYwNjkwMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1910","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Mary Isabelle Wickenhauser","height":"5' 10\" (1.78 m)","bio":"From the grand old school of wisecracking, loud and lanky Mary Wickes had few peers while forging a career as a salty scene-stealer. Her abrupt, tell-it-like-it-is demeanor made her a consistent audience favorite on every medium for over six decades. She was particularly adroit in film parts that chided the super rich or exceptionally pious, and was a major chastiser in generation-gap comedies. TV holds a vault full of not-to-be-missed vignettes where she served as a brusque foil to many a top TV comic star. Case in point: who could possibly forget her merciless ballet taskmaster, Madame Lamond, putting Lucille Ball through her rigorous paces at the ballet bar in a classic I Love Lucy (1951) episode? Unlike the working-class characters she embraced, this veteran character comedienne was actually born Mary Isabella Wickenhauser on June 13, 1910, in St. Louis, Missouri, the daughter of a well-to-do banker. Of Irish and German heritage, she grew into a society débutante following high school and graduated from Washington University in St. Louis with a degree in political science. She forsook a law career, however, after being encouraged by a college professor to try theater, and she made her debut doing summer stock in Stockbridge, Massachusetts. The rest, as they say, is history. Prodded on by the encouragement of stage legend Ina Claire whom she met doing summer theater, Mary transported herself to New York where she quickly earned a walk-on part in the Broadway play \"The Farmer Takes a Wife\" starring Henry Fonda in 1934. In the show she also understudied The Wizard of Oz (1939)'s \"Wicked Witch\" Margaret Hamilton, and earned excellent reviews when she went on in the part. Plain and hawkish in looks while noticeably tall and gawky in build, Mary was certainly smart enough to see that comedy would become her career path and she enjoyed showing off in roles playing much older than she was. New York stage work continued to pour in, and she garnered roles in \"Spring Dance\" (1936), \"Stage Door\" (1936), \"Hitch Your Wagon\" (1937), \"Father Malachy's Miracle (1937) and, in an unusual bit of casting, Orson Welles' Mercury Theatre production of \"Danton's Death.\" All the while she kept fine-tuning her acting craft in summer stock. A series of critically panned plays followed until a huge door opened for her in the form of Miss Preen, the beleaguered nurse to an acid-tongued, wheelchair-bound radio star (played by the hilarious Monty Woolley) in the George S. Kaufman/Moss Hart comedy \"The Man Who Came to Dinner.\" Oddly enough, for once, it was Mary doing the cowering. The play was the toast of Broadway for two wacky years and she went on tour with it as well. She also become a Kaufman favorite. Hollywood took notice as well, and when Warner Bros. decided to film the play, it allowed both Mary and Woolley to recreate their classic roles. The Man Who Came to Dinner (1942), which co-starred Bette Davis and Ann Sheridan, was a grand film hit and Mary was now officially on board in Hollywood, given plenty of chances to freelance. At Warners she lightened up the proceedings a bit in the Bette Davis tearjerker Now, Voyager (1942) as the nurse to Gladys Cooper. Elsewhere she traded quips with Lou Costello as a murder suspect in the amusing whodunit Who Done It? (1942); played a WAC in Private Buckaroo (1942) with The Andrews Sisters; and dished out her patented smart-alecky services in both Happy Land (1943) and My Kingdom for a Cook (1943). Mary returned to Broadway for a few seasons, often for Kaufman, and did some radio work as well, but returned to Hollywood and played yet another nurse in The Decision of Christopher Blake (1948), a part written especially for her. She appeared with 'Bette Davis (I)' for a third time in June Bride (1948), finding some fine moments playing a magazine editor. Mary went on to perform yeoman work in On Moonlight Bay (1951) and its sequel, By the Light of the Silvery Moon (1953); I'll See You in My Dreams (1951); White Christmas (1954) and The Music Man (1962), the last as one of the \"Pick-A-Little, Talk-A-Little\" housewives of River City. Television roles also began filtering in for Mary as she continued to put her cryptic comedy spin on her harried housekeepers, teachers, servants and other working commoner types. Mary played second banana to a queue of comedy's best known legends in the 1950s and 1960s, notably Lucille Ball (who was a long-time neighbor and pal off-screen), Danny Thomas, Red Skelton, Bob Hope, Jack Benny, Jimmy Durante, Peter Lind Hayes and Gertrude Berg. Her stellar work with Ms. Berg on the series The Gertrude Berg Show (1961) garnered Mary an Emmy nomination. Among babyboomers, she is probably best remembered as Miss Cathcart in Dennis the Menace (1959). In later years Mary's gangly figure filled out a bit as she continued to appear here and there on the small screen in both guest star and series' regular parts. Later in life she enjoyed a bit of a resurgence. Recalled earlier for her Sister Clarissa in the madcap comedy films The Trouble with Angels (1966) and its sequel, Where Angels Go Trouble Follows! (1968), both with Rosalind Russell, Mary donned the habit once again decades later as crabby musical director Sister Mary Lazarus in the box-office smash Sister Act (1992) and its sequel, Sister Act 2: Back in the Habit (1993). She also churned out a few roles as cranky, matter-of-fact relatives in both Postcards from the Edge (1990) as Meryl Streep's grandmother and 'Shirley Maclaine''s mother, and in Little Women (1994) as Aunt March opposite Winona Ryder Jo. True to form, one of her last roles was voicing a gargoyle in the animated The Hunchback of Notre Dame (1996), which was released after her death. The never-married Los Angeles-based performer died in October of 1995 after entering the hospital with respiratory problems. While a patient there, Mary suffered a broken hip from an accidental fall and complications quickly set in following surgery. She was 85 years young. When it came to deadpan comedy, Mary was certainly no second banana. She was a truly a star.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzUyNzU3NDQ5MF5BMl5BanBnXkFtZTYwNjkwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0926897","name":"Mary Wickes","idIMDB":"nm0926897"},"actorId":"nm0926897","character":"Bessie Mae Curtis","urlCharacter":"http://www.imdb.com/character/ch0305606","main":true},{"actorName":"Alan Hale Jr.","urlProfile":"http://www.imdb.com/name/nm0001308","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMjY1ODIyM15BMl5BanBnXkFtZTcwMTQ1NDg5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 March 1921","placeOfBirth":" Los Angeles, California, USA","birthName":"Alan Hale Mackahan Jr.","height":"6' 2\" (1.88 m)","bio":"The son of the great character actor (and Errol Flynn sidekick) Alan Hale, Alan Hale Jr. (he dropped the Jr. after his father passed away) was literally born into the movies. Hale did his first movie as a baby and continued to act until his death. Unlike other child actors, Hale made a smooth transition in the movies and starred in several classics like Up Periscope (1959), The Lady Takes a Flyer (1957) and The West Point Story (1950), as well as many westerns. He did a lot of television guest appearances as well before getting his role as The Skipper on the cult comedy Gilligan's Island (1964). After the show went off the air, Hale continued to act and even teamed up with Gilligan co-star Bob Denver in the The Good Guys (1968), a CBS-TV comedy that lasted only two years. After that ended, Hale kept busy acting in guest shots and maintained his business interests which included a restaurant and travel agency.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMjY1ODIyM15BMl5BanBnXkFtZTcwMTQ1NDg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001308","name":"Alan Hale Jr.","nicknames":["The Skipper"],"idIMDB":"nm0001308"},"actorId":"nm0001308","character":"Jack Larson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Wallace","urlProfile":"http://www.imdb.com/name/nm0908647","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE2MzMyN2EtYjllNi00N2I5LTg1YjAtMzE1MTk2NGZlZTQzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1917","placeOfBirth":" New York City, New York, USA","birthName":"George Dewey Wallace","bio":"George Wallace was born in New York and, at age 13, moved with his mom and her new husband to McMechen, West Virginia, a coal mining town where the boy began working in the mines. He joined the Navy in 1936, got out in 1940, and then went right back in again when World War II started. A chief boatswain's mate, he ended up in Los Angeles after a total of eight years in the service. Wallace supported himself with an array of odd jobs, from working for a meat packer (\"knockin' steers in the head\") to lumber-jacking in the High Sierras. A stint as a singing bartender attracted the attention of Hollywood columnist Jimmy Fidler, who helped him get his show-biz start. Wallace enrolled in drama school in the late 1940s, while earning his living tending the greens at MGM. He soon began landing jobs in films and TV, most notably as Commando Cody in the Republic serial Radar Men from the Moon (1952). He later made his Broadway debut in Richard Rodgers' \"Pipe Dreams,\" replaced John Raitt in \"The Pajama Game\" and was nominated for a Tony for his leading role in \"New Girl in Town\" with Gwen Verdon. Other stage roles have included \"The Unsinkable Molly Brown\" opposite Ginger Rogers, \"Jennie\" with Mary Martin, \"Most Happy Fella\" (during production, he met his present wife, actress Jane A. Johnston), \"Camelot\" (as King Arthur), \"Man of La Mancha,\" \"Company,\" and more. In 1960, his career was stalled when a horse fell on him and broke his back during the making of an episode of TV's Walt Disney's Wonderful World of Color (1954)'s \"Swamp Fox.\" His painful recovery took seven months. He sometimes billed himself George D. H. Wallace, to avoid confusion with comic George Wallace.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDE2MzMyN2EtYjllNi00N2I5LTg1YjAtMzE1MTk2NGZlZTQzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0908647","name":"George Wallace","idIMDB":"nm0908647"},"actorId":"nm0908647","character":"Curly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Reeves","urlProfile":"http://www.imdb.com/name/nm0716279","urlPhoto":"","biography":{"dateOfBirth":"10 August 1912","placeOfBirth":" New York City, New York, USA","birthName":"Richard Jourdan Reeves","height":"6' 1\" (1.85 m)","bio":"Richard Reeves was born on August 10, 1912 in New York City, New York, USA as Richard Jourdan Reeves. He was an actor, known for Target Earth (1954), The Glass Wall (1953) and Running Target (1956). He died on March 17, 1967 in Northridge, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0716279","name":"Richard Reeves","idIMDB":"nm0716279"},"actorId":"nm0716279","character":"Mac","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Walter Baldwin","urlProfile":"http://www.imdb.com/name/nm0050019","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzQ3NDAzMF5BMl5BanBnXkFtZTgwMzMwODg3MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 January 1889","placeOfBirth":" Lima, Ohio, USA","bio":"Walter Baldwin was born on January 2, 1889 in Lima, Ohio, USA. He was an actor, known for The Best Years of Our Lives (1946), The Long, Long Trailer (1953) and Rachel and the Stranger (1948). He died on January 27, 1977 in Santa Monica, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzQ3NDAzMF5BMl5BanBnXkFtZTgwMzMwODg3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0050019","name":"Walter Baldwin","idIMDB":"nm0050019"},"actorId":"nm0050019","character":"Henry Skinner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lee Aaker","urlProfile":"http://www.imdb.com/name/nm0007342","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU1MzU1MjM0Nl5BMl5BanBnXkFtZTcwNzA3Nzg5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1943","placeOfBirth":" Inglewood, California, USA","birthName":"Lee William Aaker","bio":"As Rusty, the boy whose parents were killed by Indians and who was subsequently adopted by a cavalry unit at Fort Apache on the popular adventure The Adventures of Rin Tin Tin (1954), tyke actor Lee Aaker left a lasting mark in the early days of television, but he had in fact appeared in several major films prior to this series. He was born on September 25, 1943, in Los Angeles, where his mother owned a dance studio. On TV almost from infancy, he started appearing in unbilled film bits at the age of eight in such classics as The Greatest Show on Earth (1952) and High Noon (1952). He quickly moved to featured status before year's end. He showed promise as the kidnapped Indian \"Red Chief\" in a segment of the film O. Henry's Full House (1952) and another kidnap victim as the son of scientist Gene Barry in _Atomic City (1952)_. From there he co-starred in the John Wayne western classic Hondo (1953) as the inquisitive blond son of homesteader Geraldine Page, and appeared to good advantage in other movies such as the film noir thriller Jeopardy (1953) with Barbara Stanwyck, the hoss opera drama Arena (1953) with Gig Young and the comedies Mister Scoutmaster (1953) with Clifton Webb and Ricochet Romance (1954) with Marjorie Main. Stardom, however, was assured after nabbing the role of the famous dog's young master on the \"Rin Tin Tin\" series. After the show's demise, however, Aaker did not survive the transition into adult roles. He instead moved into the production end of the business, serving as an assistant to producer Herbert B. Leonard on the Route 66 (1960) series, then later dropped out altogether to become a carpenter. He still attends nostalgia conventions and was recently a \"Kids of the West\" honoree at the 2005 Golden Boot Awards.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU1MzU1MjM0Nl5BMl5BanBnXkFtZTcwNzA3Nzg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007342","name":"Lee Aaker","idIMDB":"nm0007342"},"actorId":"nm0007342","character":"Eli Skinner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anthony Lawrence","urlProfile":"http://www.imdb.com/name/nm0492626","urlPhoto":"","biography":{"dateOfBirth":"12 May 1928","placeOfBirth":" Hollywood, California, USA","bio":"Anthony Lawrence was born on May 12, 1928 in Hollywood, California, USA. He is a writer and producer, known for Elvis (1979), Roustabout (1964) and Paradise, Hawaiian Style (1966).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0492626","name":"Anthony Lawrence","nicknames":["Tony"],"idIMDB":"nm0492626"},"actorId":"nm0492626","character":"Professor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Richards","urlProfile":"http://www.imdb.com/name/nm0724090","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5OTk2NTM5MV5BMl5BanBnXkFtZTgwNzkwNDY2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1909","placeOfBirth":" New York City, New York, USA","bio":"Frank Richards was born on September 15, 1909 in New York City, New York, USA. He is known for his work on A Woman Under the Influence (1974), Pat and Mike (1952) and The Cowboy and the Indians (1949). He died on April 15, 1992 in Las Vegas, Nevada, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5OTk2NTM5MV5BMl5BanBnXkFtZTgwNzkwNDY2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0724090","name":"Frank Richards","idIMDB":"nm0724090"},"actorId":"nm0724090","character":"Dummy","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0046906","urlIMDB":"http://www.imdb.com/title/tt0046906","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"$1,500,000 (USA)","country":"","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 35 min (95 min)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Color (Technicolor)"],"aspectRatio":["2.00 : 1"],"camera":null,"laboratory":["Technicolor (print by)"],"filmLength":["2,490 m (Yugoslavia)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.6","filmingLocations":[{"location":"Alabama Hills, Lone Pine, California, USA"}],"rated":"APPROVED","awards":[],"votes":"814","type":"Movie","companyCreditsSimple":[{"idCompany":"co0021358","name":"Universal International Pictures (UI)"}],"keywords":{"keywords":["frontier town","reference to king david","land deed","deputy sheriff","murder by gunshot","double barreled shotgun","winchester rifle","repeating rifle","frontier justice","saloon singer","land grab","crooked gambling"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:25:03"}}