{"data":{"movies":[{"title":"Prince of Darkness","originalTitle":"","year":"1987","releaseDate":"19871023","directors":[{"name":"John Carpenter","id":"nm0000118"}],"writers":[{"name":"John Carpenter","id":"nm0000118"}],"runtime":"102 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzIyZWQ2MzgtM2Y5ZS00MTM2LTgwOGItOTlmMGMyOGY5ZmE2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English","Latin"],"genres":["Horror"],"plot":"A sinister secret has been kept in the basement of an abandoned Los Angeles church for many years. With the death of a priest belonging to a mysterious sect, another priest opens the door to the basement and discovers a vat containing a green liquid. The priest contacts a group of physics graduate students to investigate it. Unfortunately, they discover that the liquid contains the essence of Satan himself, and they also discover that he will release HIS father - an all-powerful Anti-God! The liquid later comes to life itself, turning some of the students into zombies as the Devil comes forward to release his father. Will these students be able to stop him?","simplePlot":"A research team finds a mysterious cylinder in a deserted church. If opened, it could mean the end of the world.","actors":[{"actorName":"Donald Pleasence","urlProfile":"http://www.imdb.com/name/nm0000587","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjYzNTQ2MV5BMl5BanBnXkFtZTcwMzA5MTkzNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1919","placeOfBirth":" Worksop, Nottinghamshire, England, UK","birthName":"Donald Henry Pleasence","height":"5' 6\" (1.68 m)","bio":"Balding, quietly-spoken, of slight build and possessed of piercing blue eyes -- often peering out from behind round, steel-rimmed glasses -- Donald Pleasence had the necessary physical attributes which make a great screen villain. In the course of his lengthy career, he relished playing the obsessed, the paranoid and the purely evil. Even the Van Helsing-like psychiatrist Sam Loomis in the Halloween (1978) franchise seems only marginally more balanced than his prey. An actor of great intensity, Pleasence excelled on stage as Shakespearean villains. He was an unrelenting prosecutor in Jean Anouilh's \"Poor Bitos\" and made his theatrical reputation in the title role of the seedy, scheming tramp in Harold Pinter's \"The Caretaker\" (1960). On screen, he gave a perfectly plausible interpretation of the head of the SS, Heinrich Himmler, in The Eagle Has Landed (1976). He was a convincingly devious Thomas Cromwell in Henry VIII and His Six Wives (1972), disturbing in his portrayal of the crazed, bloodthirsty preacher Quint in Will Penny (1967); and as sexually depraved, alcohol-sodden 'Doc' Tydon in the brilliant Aussie outback drama Wake in Fright (1971). And, of course, he was Ernst Stavro Blofeld in You Only Live Twice (1967). These are some of the films, for which we may remember Pleasence, but there was a great deal more to this fabulous, multi-faceted actor. Donald Henry Pleasence was born on October 5, 1919 in Worksop, Nottinghamshire, England, to Alice (Armitage) and Thomas Stanley Pleasence. His family worked on the railway; his grandfather had been a signal man and both his brother and father were station masters. When Donald failed to get a scholarship at RADA, he joined the family occupation working as a clerk at his father's station before becoming station master at Swinton, Yorkshire. While there he wrote letters to theatre companies eventually being accepted by one on the island of Jersey in Spring 1939 as an assistant stage manager. On the eve of World War II, he made his theatrical debut in \"Wuthering Heights\". In 1942, he played Curio in \"Twelfth Night\", but his career was then interrupted by military service in the RAF. He was shot down over France, incarcerated and tortured in a German POW camp. Once repatriated, Donald returned to the stage in Peter Brook's 1946 London production of \"The Brothers Karamazov\" with Alec Guinness although he missed the opening due to measles, followed by a stint on Broadway with Laurence Olivier's touring company in \"Caesar and Cleopatra\" and \"Anthony and Cleopatra\". Upon his return to England, he won critical plaudits for his performance in \"Hobson's Choice\". In 1952, Donald began his screen career, rather unobtrusively, in small parts. He was only really noticed once having found his métier as dastardly, sneaky Prince John in The Adventures of Robin Hood (1955). It took several more years, until international recognition came his way: first, through the filmed adaptation of The Guest (1963); and, secondly, with his blind forger in The Great Escape (1963), a role imbued with added conviction due to his own wartime experience. Some of his best acting Donald reserved for the small screen. In 1962, the producer of The Twilight Zone (1959), Buck Houghton, brought Donald to the United States ('damn the expense'!) to guest star in the third season episode \"The Changing of the Guard\". He was given a mere five days to immerse himself in the part of a gentle school teacher, Professor Ellis Fowler, who, on the eve of Christmas is forcibly retired after fifty-one years of teaching. Devastated, and believing himself a failure who has made no mark on the world, he is about to commit suicide when the school's bell summons him to his classroom. There, he is confronted by the spirits of deceased students who exhort him to consider that his lessons have had fundamental effects on their lives, even leading to acts of great heroism. Upon hearing this, Fowler is now content to graciously accept his retirement. Managing to avoid maudlin sentimentality, Donald's performance was intuitive and, arguably, one of the most poignant ever accomplished in a thirty-minute television episode. Once again, against type, he was equally delightful as the mild-mannered Reverend Septimus Harding in Anthony Trollope's The Barchester Chronicles (1982). Whether eccentric, sinister or given to pathos, Donald Pleasence was always great value-for-money and his performances have rarely failed to engage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjYzNTQ2MV5BMl5BanBnXkFtZTcwMzA5MTkzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000587","name":"Donald Pleasence","idIMDB":"nm0000587"},"actorId":"nm0000587","character":"Priest","urlCharacter":"http://www.imdb.com/character/ch0138319","main":true},{"actorName":"Jameson Parker","urlProfile":"http://www.imdb.com/name/nm0662321","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ0Mzc5NDYwOF5BMl5BanBnXkFtZTcwMTgyMjgxOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1947","placeOfBirth":" Baltimore, Maryland, USA","birthName":"Francis Jameson Parker Jr.","height":"5' 11½\" (1.82 m)","bio":"Jameson Parker is best known for his role as A.J. Simon on Simon & Simon (1981), which ran on CBS for eight seasons. He was born in Baltimore and saw most of the capitals of Europe during his father's foreign service career. Young Parker also managed to see an inordinate number of boarding schools, claiming to have attended 10 in 13 years, and being bounced out of two. During a recuperative year off, he acted and worked in production at the Arena Stage in Washington, D.C. and he returned to finish his Beloit degree in theater arts in 1972. After graduation, he moved to New York, getting his first big break in a commercial for a breath mint. It helped him to get his role on the NBC soap Somerset (1970), which led to a two year part on ABC's One Life to Live (1968). He moved to LA in 1980. He loves camping and hunting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ0Mzc5NDYwOF5BMl5BanBnXkFtZTcwMTgyMjgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0662321","name":"Jameson Parker","nicknames":["J.P.","Jamie"],"idIMDB":"nm0662321"},"actorId":"nm0662321","character":"Brian Marsh","urlCharacter":"http://www.imdb.com/character/ch0021211","main":true},{"actorName":"Victor Wong","urlProfile":"http://www.imdb.com/name/nm0939378","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTgxOTQzNjQ0NV5BMl5BanBnXkFtZTcwNjM1OTgwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1927","placeOfBirth":" San Francisco, California, USA","birthName":"Yee Keung Victor Wong","height":"5' 4\" (1.63 m)","bio":"Eccentric looking Chinese-American actor with a slightly drooping face (the result of a bout of Bell's palsy) who studied political science, art & journalism before becoming a news reporter for a San Francisco public TV station in the late 1960s. Apart from a brief stint in the mid-1970s on the TV soap opera Search for Tomorrow (1951), Wong didn't break into movies until he was in his late fifties in the minor telemovie American Playhouse: Nightsongs (1984). He then appeared in the explosive Mickey Rourke gang movie Year of the Dragon (1985), followed by the heart warming Dim Sum: A Little Bit of Heart (1985), before scoring the role he is probably best remembered for, as the Chinese wizard \"Egg Shen\" helping truck driver Kurt Russell defeat the evil \"Lo-Pan\" in Big Trouble in Little China (1986). His offbeat style remained in demand with more work in Prince of Darkness (1987) and then as an opportunistic store owner, who gets more than he bargained for, in the tongue in cheek horror film Tremors (1990). Wong then appeared as the wise grandfather / retired ninja in the kids martial arts adventure 3 Ninjas (1992), plus he repeated his popular role for the sequels 3 Ninjas Kick Back (1994), 3 Ninjas Knuckle Up (1995) and for his final film appearance 3 Ninjas: High Noon at Mega Mountain (1998). Wong retired from acting in 1998 due to ill health, and passed away in September 2001 from heart failure.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTgxOTQzNjQ0NV5BMl5BanBnXkFtZTcwNjM1OTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0939378","name":"Victor Wong","idIMDB":"nm0939378"},"actorId":"nm0939378","character":"Prof. Howard Birack","urlCharacter":"http://www.imdb.com/character/ch0030100","main":true},{"actorName":"Lisa Blount","urlProfile":"http://www.imdb.com/name/nm0089408","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NzMyMTYxMV5BMl5BanBnXkFtZTcwNDM2MjQwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1957","placeOfBirth":" Fayetteville, Arkansas, USA","birthName":"Lisa Suzanne Blount","height":"5' 9\" (1.75 m)","bio":"Lisa Blount was born on July 1, 1957 in Fayetteville, Arkansas, USA as Lisa Suzanne Blount. She was an actress and producer, known for An Officer and a Gentleman (1982), Prince of Darkness (1987) and Chrystal (2004). She was married to Ray McKinnon and Christopher Tufty. She died on October 25, 2010 in Little Rock, Arkansas.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NzMyMTYxMV5BMl5BanBnXkFtZTcwNDM2MjQwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0089408","name":"Lisa Blount","idIMDB":"nm0089408"},"actorId":"nm0089408","character":"Catherine Danforth","urlCharacter":"http://www.imdb.com/character/ch0021210","main":true},{"actorName":"Dennis Dun","urlProfile":"http://www.imdb.com/name/nm0241748","urlPhoto":"","biography":{"dateOfBirth":"19 April 1952","placeOfBirth":" Stockton, California, USA","birthName":"Dennis Gong Dun","height":"5' 5\" (1.65 m)","bio":"Dennis Dun was born on April 19, 1952 in Stockton, California, USA as Dennis Gong Dun. He is known for his work on Big Trouble in Little China (1986), Le dernier empereur (1987) and Midnight Caller (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0241748","name":"Dennis Dun","idIMDB":"nm0241748"},"actorId":"nm0241748","character":"Walter","urlCharacter":"http://www.imdb.com/character/ch0030622","main":true},{"actorName":"Susan Blanchard","urlProfile":"http://www.imdb.com/name/nm0087105","urlPhoto":"","biography":{"dateOfBirth":"11 December 1948","placeOfBirth":" USA","bio":"Susan Blanchard was born on December 11, 1948 in the USA. She is an actress, known for All My Children (1970), They Live (1988) and Prince of Darkness (1987). She has been married to Charles Frank since June 25, 1977. They have one child.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0087105","name":"Susan Blanchard","idIMDB":"nm0087105"},"actorId":"nm0087105","character":"Kelly","urlCharacter":"http://www.imdb.com/character/ch0032077","main":true},{"actorName":"Anne Marie Howard","urlProfile":"http://www.imdb.com/name/nm0397121","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MzI0NDc3MF5BMl5BanBnXkFtZTgwOTAxNjYxNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1960","placeOfBirth":" San Diego, California, USA","height":"5' 5\" (1.65 m)","bio":"Anne grew up in Ottumwa, Iowa, and first appeared onstage in the musical, \"Carousel\", at age 4. She began producing plays in her backyard shortly after that and, at 14, when the family moved to Davenport, Iowa, she starred in every high school play, musical & variety show. At 18, she moved to New York City to study acting at the American Academy of Dramatic Arts, the Neighborhood Playhouse & the Stella Adler Conservatory. Anne Marie appeared in the NYC Off-Broadway productions \"Summertree\" (w/Alec Baldwin) & \"Baseball Wives\" (w/Anne Pitoniak). She played \"Nicole Love\" on Another World (1964) & \"Kimberly Brady\" on Days of Our Lives (1965). She works regularly in feature films & television series. Recent TV credits include Private Practice (2007), Desperate Housewives (2004), Criminal Minds (2005), Monk (2002), Nip/Tuck (2003), and Anne Marie is recurring on the ABC Family series, Make It or Break It (2009). Her feature films include You Don't Mess with the Zohan (2008), The Weather Man (2005), Shopgirl (2005) and Prince of Darkness (1987), to name a few. She's been seen in hundreds of television commercials and was the spokesperson for the National Association of Realtors, Ditech and Maalox. She can also be heard in numerous voice-overs on the radio, web, & television.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MzI0NDc3MF5BMl5BanBnXkFtZTgwOTAxNjYxNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0397121","name":"Anne Marie Howard","idIMDB":"nm0397121"},"actorId":"nm0397121","character":"Susan Cabot","urlCharacter":"http://www.imdb.com/character/ch0032824","main":true},{"actorName":"Ann Yen","urlProfile":"http://www.imdb.com/name/nm0947441","urlPhoto":"","biography":{"bio":"Ann Yen is an actress, known for Prince of Darkness (1987), Love or Money (1990) and In Living Color (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0947441","name":"Ann Yen","idIMDB":"nm0947441"},"actorId":"nm0947441","character":"Lisa","urlCharacter":"http://www.imdb.com/character/ch0033592","main":true},{"actorName":"Ken Wright","urlProfile":"http://www.imdb.com/name/nm0942565","urlPhoto":"","biography":{"bio":"Ken Wright is an actor, known for Prince of Darkness (1987), The Hanoi Hilton (1987) and A.W.O.L. (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0942565","name":"Ken Wright","idIMDB":"nm0942565"},"actorId":"nm0942565","character":"Lomax","urlCharacter":"http://www.imdb.com/character/ch0033687","main":true},{"actorName":"Dirk Blocker","urlProfile":"http://www.imdb.com/name/nm0088781","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWUyOGM1NjYtMDE5Mi00ZTRiLTlmNTUtZWZkOGZmNjM5YmZkL2ltYWdlXkEyXkFqcGdeQXVyNDExMDM5Mjk@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1957","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Dennis Dirk Blocker","height":"5' 7\" (1.7 m)","bio":"Dirk Blocker was born on July 31, 1957 in Hollywood, Los Angeles, California, USA as Dennis Dirk Blocker. He is an actor, known for Brooklyn Nine-Nine (2013), Poltergeist (1982) and Starman (1984). He has been married to Danielle Aubuchon since November 3, 1990.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWUyOGM1NjYtMDE5Mi00ZTRiLTlmNTUtZWZkOGZmNjM5YmZkL2ltYWdlXkEyXkFqcGdeQXVyNDExMDM5Mjk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0088781","name":"Dirk Blocker","idIMDB":"nm0088781"},"actorId":"nm0088781","character":"Mullins","urlCharacter":"http://www.imdb.com/character/ch0033921","main":true},{"actorName":"Jessie Lawrence Ferguson","urlProfile":"http://www.imdb.com/name/nm0272480","urlPhoto":"","biography":{"dateOfBirth":"8 June 1941","placeOfBirth":" The Bronx, New York, USA","height":"6' 5\" (1.96 m)","bio":"Jessie Lawrence Ferguson was born on June 8, 1941 in The Bronx, New York, USA. He is an actor, known for Boyz n the Hood (1991), Darkman (1990) and Prince of Darkness (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0272480","name":"Jessie Lawrence Ferguson","idIMDB":"nm0272480"},"actorId":"nm0272480","character":"Calder","urlCharacter":"http://www.imdb.com/character/ch0034047","main":true},{"actorName":"Peter Jason","urlProfile":"http://www.imdb.com/name/nm0419273","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMjcxOTE3NF5BMl5BanBnXkFtZTcwMzYyNTg5Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1944","placeOfBirth":" Hollywood, California, USA","birthName":"Peter Edward Ostling","height":"5' 11\" (1.8 m)","bio":"Excellent, prolific and versatile character actor Peter Jason was born on July 22, 1944, in Hollywood, CA, and grew up in Balboa. He attended Newport Beach Elementary School, Horace Ensign Junior High and Newport Harbor High School. He originally planned on being a football player, but fell in love with acting after playing the lead in a high school production of \"The Man Who Came to Dinner.\" Following his high school graduation he attended Orange Coast Junior College and did a season of summer stock at the Peterborough Playhouse in New Hampshire. He then studied as a drama major at the Carnegie Institute of Technology in Pittsburgh, PA. More stage work followed with the acting group the South Coast Repertory Company. He made his film debut in Howard Hawks' final film, Rio Lobo (1970) (which Jason says is one of his favorites). He worked with Orson Welles on the uncompleted The Other Side of the Wind as an actor, boom operator, prop man and even cook for the cast and crew. Jason has appeared in many films for director Walter Hill; he's especially memorable as the racist redneck bartender in 48 Hrs. (1982). He has also appeared in many films for director John Carpenter: he's very engaging as the jolly Dr. Paul Leahy in Prince of Darkness (1987) and was terrific as underground guerrilla army leader Gilbert in They Live (1988). Other notable roles include a sinister government agent in Dreamscape (1984), rugged Maj. G.F. Devin in Clint Eastwood's Heartbreak Ridge (1986), jerky detective Fedorchuk in Alien Nation (1988), a newspaper reporter in Seabiscuit (2003) and the U.S. president in Alien Apocalypse (2005). Jason recently had a recurring role as dissolute gambler Con Stapleton in the superbly gritty cable Western TV series Deadwood (2004). He also had a regular part as Capt. Skip Gleason on Mike Hammer, Private Eye (1997). Among the many TV shows Peter has done guest spots on are Desperate Housewives (2004), Sabrina, the Teenage Witch (1996), Nash Bridges (1996), Coach (1989), The Golden Girls (1985), Murder, She Wrote (1984), Married with Children (1987), Roseanne (1988), Dear John (1988), Quantum Leap (1989), Dr. Quinn, Medicine Woman (1993), B.J. and the Bear (1978), The Incredible Hulk (1978), Gunsmoke (1955) and Hawaii Five-O (1968). In addition to his substantial film and TV show credits, Jason has acted in over 150 plays and hundreds of TV commercials. An accomplished baritone vocalist, Jason has sung in such musical stage productions as \"The Music Man\" (this is one of his favorite plays), \"Stop the World, I Want to Get Off,\" \"The Roar of the Greasepaint\" and \"Threepenny Opera\" (as Mack the Knife). He's been married to his wife Eileen for 33 years. In his spare time he makes his own furniture with found, recycled wood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMjcxOTE3NF5BMl5BanBnXkFtZTcwMzYyNTg5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0419273","name":"Peter Jason","idIMDB":"nm0419273"},"actorId":"nm0419273","character":"Dr. Paul Leahy","urlCharacter":"http://www.imdb.com/character/ch0034096","main":true},{"actorName":"Robert Grasmere","urlProfile":"http://www.imdb.com/name/nm0335835","urlPhoto":"","biography":{"bio":"Robert Grasmere is known for his work on Salt (2010), The Bone Collector (1999) and Demolition Man (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0335835","name":"Robert Grasmere","idIMDB":"nm0335835"},"actorId":"nm0335835","character":"Frank Wyndham","urlCharacter":"http://www.imdb.com/character/ch0034533","main":true},{"actorName":"Thom Bray","urlProfile":"http://www.imdb.com/name/nm0106257","urlPhoto":"","biography":{"dateOfBirth":"30 April 1954","placeOfBirth":" Lawrenceville, New Jersey, USA","birthName":"Thomas Edward Bray","bio":"Thom Bray was born on April 30, 1954 in Lawrenceville, New Jersey, USA as Thomas Edward Bray. He is an actor and writer, known for Riptide (1984), Prince of Darkness (1987) and DeepStar Six (1989). He has been married to Jane Staugas since May 22, 1983. They have three children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0106257","name":"Thom Bray","idIMDB":"nm0106257"},"actorId":"nm0106257","character":"Etchinson","urlCharacter":"http://www.imdb.com/character/ch0035114","main":true},{"actorName":"Joanna Merlin","urlProfile":"http://www.imdb.com/name/nm0581008","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYxNTUyNjgzM15BMl5BanBnXkFtZTcwMzU0MzMxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1931","placeOfBirth":" Chicago, Illinois, USA","birthName":"Joann Ratner","bio":"Joanna Merlin is an actress and casting director who was born in Chicago, Illinois. She made her motion-picture debut in Cecil B. DeMille's The Ten Commandments (1956). In 1961 she made her Broadway debut as a replacement performer in \"A Far Country,\" a play about Sigmund Freud. Next on Broadway she created the role of Tzeitel in the original production of \"Fiddler on the Roof,\" produced by Harold Prince. Beginning with the original production of \"Company,\" Merlin served as casting director for a now-legendary string of Broadway musical plays on which Prince collaborated with composer and lyricist Stephen Sondheim, including \"Follies,\" \"A Little Night Music,\" \"Pacific Overtures,\" \"Sweeney Todd,\" and \"Merrily We Roll Along.\" Merlin's other Broadway casting credits include the Prince-directed \"On the Twentieth Century,\" \"Evita,\" \"A Doll's Life,\" \"Play Memory,\" and \"End of the World.\" Since 1975, she has worked regularly as an actress in feature films, counting among her credits such notable motion pictures as Hester Street (1975); All That Jazz (1979); Fame (1980); The Killing Fields (1984); and Mystic Pizza (1988). Merlin appeared in several episodes of Law & Order (1990), and for the past four and one-half years she has appeared in the recurring role of Judge Lena Petrovsky on Law & Order: Special Victims Unit (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYxNTUyNjgzM15BMl5BanBnXkFtZTcwMzU0MzMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0581008","name":"Joanna Merlin","idIMDB":"nm0581008"},"actorId":"nm0581008","character":"Bag Lady","urlCharacter":"http://www.imdb.com/character/ch0035121","main":true}],"seasons":[],"idIMDB":"tt0093777","urlIMDB":"http://www.imdb.com/title/tt0093777","business":{"budget":{"money":"$3,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$4,657,401","country":"USA","day":"25","month":"10","year":"1987","remarks":"1,239 Screens"}],"gross":[{"money":"AUD","country":"4,881","day":null,"month":null,"year":null,"remarks":null},{"money":"ESP","country":"45,648,280","day":null,"month":null,"year":null,"remarks":null},{"money":"€1,959,941","country":"West","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1987/\">1987</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 42 min (102 min)"],"soundMix":["Ultra Stereo"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":["2,821 m (Spain)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision"],"printedFilmFormat":["35 mm"]},"rating":"6.7","metascore":"50","filmingLocations":[{"location":"Long Beach, California, USA"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1988","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Music","names":[{"name":"John Carpenter","id":"nm0000118","role":null}]}]}]},{"award":"Avoriaz Fantastic Film Festival 1988","titlesAwards":[{"titleAwardOutcome":"Won Critics Award","categories":[{"category":"","names":[{"name":"John Carpenter","id":"nm0000118","role":null}]}]}]}],"votes":"26,997","type":"Movie","companyCreditsSimple":[{"idCompany":"co0035544","name":"Alive Films"},{"idCompany":"co0324578","name":"Larry Franco Productions"}],"keywords":{"keywords":["church","priest","student","liquid","devil","basement","professor","diary","cylinder","green liquid","key","graduate student","end of the world","living dead","physics","sect","abandoned church","death","container","college","college student","secret","title in title","three word title","reference to schrodinger's cat","quantum mysticism","watching television","limousine","pay phone","symbol","telling a joke","worm","defying gravity","beating","improvised weapon","cover up","card game","pizza","insomnia","deception","boyfriend girlfriend relationship","escape","brawl","fight","fistfight","punched in the face","disfigurement","mind control","stabbed in the shoulder","blood on face","black comedy","vision","recurring dream","chinese takeout","theoretical physics","blood splatter","power outage","chase","engineer","faith","father son relationship","claustrophobic","escape attempt","rescue","racial slur","climbing out a window","catholic church","catholic priest","subliminal message","undead","translator","apocalypse","mirror","alternate dimension","looking at oneself in a mirror","self mutilation","throat slitting","invulnerability","dismemberment","homeless woman","homeless man","news report","social decay","knife","supernatural power","babe scientist","severed leg","stabbed through the chest","lightning","near death experience","demon","surrealism","christian horror","antichrist","beetle","supernatural","computer cracker","bible","unrequited love","comic relief","science vs religion","philosophy","paranoia","doctor","fear","suspense","survival","race against time","1980s","scientist","cult director","secret society","cult film","cartoon on tv","quantum physics","supernatural horror","yawn","hobo","dream","computer","bug","vagrant","classroom","candle","playing cards","religious icon","university campus","asian american","catholic","full moon","ambulance","dream within a dream","police car","parasite","african american","mark","pregnancy","unicycle","typewriter","trapped in a building","translation","transformation","title appears in writing","thrown through a window","telekinesis","supernova","suicide","stabbed with scissors","stabbed to death","stabbed in the throat","stabbed in the eye","stabbed in the chest","stabbed in the back","singing","shared dream","severed head","severed hand","severed arm","self sacrifice","regeneration","reanimated corpse","radiologist","possession","portal","physicist","nightmare","neck breaking","murder","maggot","los angeles california","looking at self in mirror","latin","kicked in the stomach","interracial kiss","impalement","homeless person","hit with a brick","hit in the face","hiding in a closet","gash in the face","flashlight","falling from height","dream sequence","disappearance","dead bird","crucifix","corpse","cigarette smoking","card trick","bruise","broken mirror","broadcast","breaking through a wall","breaking through a door","blood","bare chested male","axe","arm cut off","ant","ambiguous ending","1990s","reference to satan","nun","tachyon","dream transmission","electronic music score","science versus supernatural","evil god","science","research scientist","religion","good versus evil","ethnic slur","entrapment","demonic possession","crime scene","pessimism","music score composed by director","insect","siege","occult","zombie","decapitation","death of son","surprise ending","premarital sex","defecation","astral projection"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:05:35"}}