{"data":{"movies":[{"title":"Under the Yum Yum Tree","originalTitle":"","year":"1963","releaseDate":"19631023","directors":[{"name":"David Swift","id":"nm0842582"}],"writers":[{"name":"Lawrence Roman","id":"nm0738710"},{"name":"Lawrence Roman","id":"nm0738710"}],"runtime":"110 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NTk4MjEwN15BMl5BanBnXkFtZTYwODc4Njk4._V1.jpg","countries":["USA"],"languages":["English","Italian"],"genres":["Comedy"],"plot":"Hogan owns and operates the Centaur Apartment complex. He rents the units to young women only at less than half their market value in order to spy on them lasciviously and seduce them. After Hogan's latest conquest, Dr. Irene Wilson, a college professor, moves out when their romance goes sour, Hogan is more than happy to rent that apartment to blonde college student Robin Austin. Hogan is even happier when he learns Robin will have a slightly taller brunette roommate. What Hogan doesn't initially know is that Robin is Irene's student and niece, and that Robin's roommate will be her boyfriend, fellow college student David Manning. Not wanting to mistake lust for love, Robin convinced a sexually frustrated David - with who she has not yet had sex - to this platonic cohabitation arrangement solely to see if they are truly compatible as people before they decide to get married. When Hogan finds out about David and the arrangement, he tries subversively to thwart any romance between Robin ...","simplePlot":"A love-struck landlord tries to convince a pretty tenant to dump her fiance and give him a chance.","actors":[{"actorName":"Jack Lemmon","urlProfile":"http://www.imdb.com/name/nm0000493","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NTE3ODE1N15BMl5BanBnXkFtZTYwOTU1MTM2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1925","placeOfBirth":" Newton, Massachusetts, USA","birthName":"John Uhler Lemmon III","height":"5' 9\" (1.75 m)","bio":"Jack Lemmon was born in Newton, Massachusetts, to Mildred Burgess LaRue (Noel) and John Uhler Lemmon, Jr., the president of a doughnut company. His ancestry included Irish (from his paternal grandmother) and English. Jack attended Ward Elementary near his Newton, MA home. At age 9 he was sent to Rivers Country Day School, then located in nearby Brookline. After RCDS, he went to high school at Phillips Andover Academy. Jack was a member of the Harvard class of 1947, where he was in Navy ROTC and the Dramatic Club. After service as a Navy ensign, he worked in a beer hall (playing piano), on radio, off Broadway, TV and Broadway. His movie debut was with Judy Holliday in It Should Happen to You (1954). He won Best Supporting Actor as Ensign Pulver in Mister Roberts (1955). He received nominations in comedy (Some Like It Hot (1959), The Apartment (1960)) and drama (Days of Wine and Roses (1962), The China Syndrome (1979), Un fils pour l'été (1980) and Missing (1982)). He won the Best Actor Oscar for Save the Tiger (1973) and the Cannes Best Actor award for \"Syndrome\" and \"Missing\". He made his debut as a director with Kotch (1971) and in 1985 on Broadway in \"Long Day's Journey into Night\". In 1988 he received the Life Achievement Award of the American Film Institute.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NTE3ODE1N15BMl5BanBnXkFtZTYwOTU1MTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000493","name":"Jack Lemmon","idIMDB":"nm0000493"},"actorId":"nm0000493","character":"Hogan","urlCharacter":"http://www.imdb.com/character/ch0093334","main":true},{"actorName":"Carol Lynley","urlProfile":"http://www.imdb.com/name/nm0528595","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE1MzNjYTItODVlNC00NjA3LWI2MGMtOTY0MDBkMjc4ZWM1L2ltYWdlXkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1942","placeOfBirth":" New York City, New York, USA","birthName":"Carole Ann Jones","bio":"Carol Lynley was born on February 13, 1942 in New York City, New York, USA as Carole Ann Jones. She is an actress, known for The Poseidon Adventure (1972), Another World (1964) and The Cardinal (1963). She was previously married to Michael Selsman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE1MzNjYTItODVlNC00NjA3LWI2MGMtOTY0MDBkMjc4ZWM1L2ltYWdlXkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0528595","name":"Carol Lynley","idIMDB":"nm0528595"},"actorId":"nm0528595","character":"Robin Austin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dean Jones","urlProfile":"http://www.imdb.com/name/nm0427894","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzMzIxNDg4MjJeQTJeQWpwZ15BbWU4MDQ0NDIxNzYx._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 January 1931","placeOfBirth":" Decatur, Alabama, USA","birthName":"Dean Carroll Jones","height":"6' (1.83 m)","bio":"Dean Jones was born on Sunday, January 25th, 1931 in Decatur, Alabama, USA as Dean Carroll Jones. He is an actor, best known for Beethoven (1992) , The Love Bug (1968), Clear and Present Danger (1994), and especially St. John in Exile (1986). He has two daughters from his first marriage to Mae Entwisle: Caroline Jones (1955) and Deanna Demaree (1957). On Saturday, June 2nd, 1973, he married his life-long partner, Lori Basham Jones, who had one son, Michael Pastick. He resides in Tarzana California with his wife Lory Patrick Jones and they have eight grandchildren and three great-grandchildren. He has become a devout born-again Christian.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzMzIxNDg4MjJeQTJeQWpwZ15BbWU4MDQ0NDIxNzYx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0427894","name":"Dean Jones","idIMDB":"nm0427894"},"actorId":"nm0427894","character":"Dave Manning","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edie Adams","urlProfile":"http://www.imdb.com/name/nm0010944","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNTQxODI0Nl5BMl5BanBnXkFtZTcwMDc0MzYyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1927","placeOfBirth":" Kingston, Pennsylvania, USA","birthName":"Edith Elizabeth Enke","height":"5' 6\" (1.68 m)","bio":"The scintillating, sultry-eyed blonde (formerly a redhead) star of screen, TV and award-winning stage went on to become best known, however, for her sensual delivery pitching cigars in taunting '60s ads and commercials with her Mae Westian come-on line \"Why don't you pick one up and smoke it sometime?\" This, of course, was at a time when smoking was considered quite sexy and fashionable, and Edie Adams went above and beyond the call of duty in making these ads legendary. Edie had her hand dipped in all pools of entertainment. She was a singing siren, an award-winning Broadway musical entertainer, a deft impressionist and comedienne, a serious dramatic actress, a commercial saleswoman and a viable TV celebrity. Off-stage, she showed remarkable poise and resourcefulness when her famous first husband, landmark TV comic Ernie Kovacs, was tragically killed in a January 1962 car crash in Los Angeles and she found her family finances in dire straits. She was born Edith Elizabeth Enke on April 16, 1927, in the relatively small town of Kingston, Pennsylvania, but moved while fairly young to Grove City. Her family relocated again, this time to Tenafly, New Jersey, where she grew up. Following her graduation from high school, Edie aspired to become an opera singer and studied voice and piano at New York's Juilliard School of Music. She then went on to take acting classes at the Columbia School of Drama. Her theatrical debut occurred with a 1947 production of \"Blithe Spirit\", and a year later she appeared in the stage show \"Goodnight Ladies\". Gradually building up her singing reputation via the nightclub circuit, her big break came when Arthur Godfrey booked her on his \"Talent Scouts\" show. She didn't come out the winner, but a TV director who caught sight of her performance envisioned in her a seductive \"straight man\" who could mesh well with a certain zany comedian. In 1951, Edie (then known as Edith Adams) was signed up as a featured singer on Ernie Kovacs's comedy show that originated in Philadelphia. The show, live and unrehearsed, became an innovative, groundbreaking effort in the relatively new medium. Outrageous and even incomprehensible at times, his comedy was deemed way ahead of its time and, as a result, had problems reaching mainstream audiences who didn't \"get it\", and the programs were short-lived. Various Kovacs platforms that included Edie were Ernie in Kovacsland (1951), \"Kovacs on the Korner\" (1952), and, of course, The Ernie Kovacs Show (1952). She and Kovacs eloped to Mexico City in 1954 and their union produced a daughter, Mia Kovacs. The duo were a popular couple in the Hollywood social circuit (moving there from New York in the late '50s) and the connections she developed out there were quite valuable in furthering her career. Early '50s TV opened many doors for Edie and she waltzed right through them. Her New York stage debut in the popular musical \"Wonderful Town\" in 1952 had her walking away with the Theatre World Award for \"Best Newcomer\". A few years later, she slithered away with a supporting Tony Award for her bodacious take on the \"Daisy Mae\" character in the musical \"Li'l Abner\" (1956). Following that were more musical and dramatic ventures on the stage, including \"The Merry Widow\" (1957) (a show she would return to more than once), \"Sweet Bird of Youth\" (1960) and \"Free as a Bird\" (1960). On film, Edie showed the public that she wasn't just a pretty face with her sharply unsympathetic supporting performance in Billy Wilder's The Apartment (1960) and a funny, sexier one in the second of Rock Hudson and Doris Day's three battle-of-the-sexes romps, Lover Come Back (1961). Surprisingly, Edie and Ernie never appeared together in a film. Edie remained primarily a TV fixture and, outside of her Emmy-nominated coupling with Kovacs, winningly played the Fairy Godmother in Julie Andrews' popular TV version of Cinderella (1957), appeared regularly with Jack Paar and Dinah Shore on their respective variety shows, acted on various prime-time shows, and graced a number of celebrity game and talk show panels. One of Edie's last pairings with Kovacs was in 1960 when they appeared as guests on the very last episode of The Lucy-Desi Comedy Hour (1957). The pair appeared as themselves, with one of the highlights being Edie crooning the lovely ballad \"That's All\". Kovacs' sudden 1962 death was a terrible reversal of fortunes for Edie. An inveterate gambler, he left her owing much money to the IRS. Instead of filing bankruptcy, however, she worked her way out of debt. In the process, her career received a second wind. Perhaps it didn't hurt that the public adored Edie and that she was a genuinely sympathetic figure in the wake of her private tragedy. She returned to the nightclub circuit from whence she came, recorded albums, and also toured the country in various dramatic and musical comedy vehicles, including \"Rain\" (as Sadie Thompson), \"Bells Are Ringing\", \"Annie Get Your Gun\" (as Annie Oakley), \"I Do! I Do!\", \"Anything Goes\" and \"Bus Stop\". She also received outstanding notices in a few of her films, whether dramas (Love with the Proper Stranger (1963), The Best Man (1964)) or frivolous comedies (Call Me Bwana (1963), It's a Mad Mad Mad Mad World (1963), Under the Yum Yum Tree (1963), The Honey Pot (1967)). Moreover, she was handed her own musical variety show Here's Edie (1963) (aka \"The Edie Adams Show\") and received a couple of Emmy nominations for her efforts. She also took advantage of her famous impressions of Zsa Zsa Gabor and others, appearing in various TV comedy formats. More than anything, however, it was her come-hither temptress pitching Muriel cigars that had TV audiences' tongues wagging. It was a smashingly successful and highly profitable coup for Edie professionally. Her late husband, a notorious cigar smoker, at one time sold Dutch Master cigars on TV. The idea then for Edie to pitch a competing slimmer cigar on TV was only natural. She had much to do with the direction of the commercials, which ran throughout the 1960s, providing them with a perfect blend of class, glamour and sensuality. While growing noticeably heavier in later years, she never lost her trademark humor and sex appeal. Edie could still be seen from time to time on the stage in such shows as \"The Best Little Whorehouse in Texas\", the female version of \"The Odd Couple\", \"Hello, Dolly!\" and \"Nunsense\". She remained committed to the end to restoring/preserving her late husband's videotapes and kinescopes of his ground-breaking '50s TV work. She also recalled her offbeat life with Kovacs in the book \"Sing a Pretty Song\", which was published in 1990. Edie remarried in 1964, to photographer Marty Mills, with whom she had a son, Josh Mills. That union ended in divorce in 1971. The following year, Edie married jazz trumpeter Pete Candoli. She and Candoli, who died in January of 2008, divorced in 1989. In another eerie, tragic circumstance, daughter Mia Kovacs was killed in a 1982 Los Angeles auto accident at age 22 -- 20 years after her father's similar demise. Suffering from cancer and losing weight in her latter years, the beloved Edie died of complications from pneumonia at age 81 in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNTQxODI0Nl5BMl5BanBnXkFtZTcwMDc0MzYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0010944","name":"Edie Adams","idIMDB":"nm0010944"},"actorId":"nm0010944","character":"Dr. Irene Wilson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Imogene Coca","urlProfile":"http://www.imdb.com/name/nm0168042","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNDc2NzE1Nl5BMl5BanBnXkFtZTYwNDE5MTU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1908","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Imogene Fernandez de Coca","height":"5' 3\" (1.6 m)","bio":"Imogene Coca is best remembered for playing opposite Sid Caesar in the live 90-minute Your Show of Shows (1950), which ran every Saturday night in regular season on NBC from February 1950 to June 1954. Their repertoire of comedy acts included the very memorable, hilarious, timeless and irreconcilable married couple Charlie and Doris Hickenlooper. Coca, however, did not begin her career in comedy. Her father, who was the conductor at a small Philadelphia opera house, and her mother, who performed in vaudeville, certainly instilled in her a desire to perform, but nurtured that desire with piano lessons, vocal training and dance. \"I began as one of those horrible little children who sing with no voice,\" Coca said of her early training. By the time she was 13, she found herself tap dancing, somersaulting (along with various other acrobatics), dancing ballet and otherwise committed full-time as a serious vaudeville trouper. She left Philadelphia at 15 for New York, where she plied her trade as a dancer. She debuted in the chorus of \"When You Smile.\" For the next 30 years music and dance were her staple. She could be found in the troupes of musical revues and doing her own acts in Manhattan clubs, such as the Rainbow Room, the Silver Slipper and Cafe Society Uptown. Her first husband, Robert Burton (who died in 1955), arranged music for many of her performances. Comedy and pantomime filtered into her routines quite by accident. In the production of \"New Faces of 1934\" Leonard Sillman, the choreographer for the show, loaned her his coat to keep her warm in what was a very cold theater. To augment what warmth she was getting from the oversized coat, Coca, along with three male dancers in the chorus began jumping up and down and improvising dance steps. Stillman noticed them and immediately recognized the comedic affect. He encouraged them to repeat the routine in the show, coat and all, which they did. Although coolly received by the audience at first, eventually the bit had the audience in stitches. Even the critics laughed, crediting Coca with great comedic talent. To hone her skills in what would become her forte in show business, Coca did the next four summers in the Poconos working with Danny Kaye, Carol Channing and the like. It wasn't until near the end of WWII that she found much work in her new field and it wasn't until January 1949 that she was paired with Caesar in NBC's The Admiral Broadway Revue (1949), a show that aired only until that summer. In the fall of 1950 \"Your Show of Shows\" was launched on NBC. Coca won an Emmy the following year for her contributions to the program. She and Ceasar left the show in 1954 to pursue individual routes. They did not, however, match the success they enjoyed in \"Your Show of Shows.\" Coca attempted a solo with The Imogene Coca Show (1954), but it lasted only one season. In 1958 Caesar and she paired again on Sid Caesar Invites You (1958); still, it was not the same. Only in 1967 did some of that same magic again occur when the original cast from \"Your Show of Shows\" reunited on CBS in _The Sid Caesar, Imogene Coca, Carl Reiner, Howard Morris Special (1967) (TV)_; it won an Emmy for outstanding variety special. Coca starred in two single-season sitcoms in the 1960s: NBC's 1963-64 Grindl (1963) and CBS' 1966-67 It's About Time (1966). In the 1970s she could be found visiting on Dick Cavett's talk show and making guest appearances on The Carol Burnett Show (1967). Thereafter, she appeared only sporadically on TV and in the movies--her most notable appearance was as Aunt Edna in National Lampoon's Vacation (1983) with Chevy Chase. Coca and Caesar re-visited some of their old sketches and put together the 1991 show \"Together Again\", which they toured throughout the country on stage. In her later years Coca and her second husband, actor King Donovan (who died in 1987), lived in Connecticut and Manhattan, staying close to her roots in vaudeville, theatre and \"Your Show of Shows.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNDc2NzE1Nl5BMl5BanBnXkFtZTYwNDE5MTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0168042","name":"Imogene Coca","idIMDB":"nm0168042"},"actorId":"nm0168042","character":"Dorkus Murphy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Lynde","urlProfile":"http://www.imdb.com/name/nm0001489","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwODQ1MTg0Nl5BMl5BanBnXkFtZTcwMjMyMDU4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1926","placeOfBirth":" Mount Vernon, Ohio, USA","birthName":"Paul Edward Lynde","height":"5' 11\" (1.8 m)","bio":"Paul Lynde was born in 1926 in Mount Vernon, Ohio (one of six children and the middle of four boys). His father was a local police officer and the sheriff of the Mount Vernon Jail for two years. Lynde got his inspiration to become an actor at the age of four or five after his mother took him to see the original silent film Ben-Hur: A Tale of the Christ (1925). After graduating from Northwestern University, Lynde relocated to New York City where his first break came from being a stand-up comedian at the Number One Fifth Avenue nightclub. Then came an appearance on a Broadway show, \"New Faces of 1952\". Lynde also had a two-year run on TV with Perry Como's Kraft Music Hall (1948) and the Broadway and film versions of Bye Bye Birdie (1963). Throught his life, Lynde appeared in the Broadway plays \"The Impossible Years\", \"Don't Drink the Water\", and \"Plaza Suite\". His many film credits include New Faces (1954), Send Me No Flowers (1964), and Rabbit Test (1978). One of his most memorable roles was a recurring role on Bewitched (1964) playing the sneering, sarcastic Uncle Arthur. He appeared on TV's The Dean Martin Show (1965), The Kraft Music Hall (1967), Donny and Marie (1975), and both the prime-time and daytime versions of the game show The Hollywood Squares (1965) where he occupied the famous center square. He had two TV series of his own, The Paul Lynde Show (1972) and The New Temperatures Rising Show (1972). Paul Lynde's witty, wisecracking one-liners and his novel line delivery made him one of Hollywood's funniest and best loved entertainers. Paul Lynde died under mysterious circumstances when he was found dead in his bed after possibly suffering a heart attack in January 1982 at age 55. He had been in ill-health for over a year with cancer or some other illness that was never fully revealed to the public before or after his death.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwODQ1MTg0Nl5BMl5BanBnXkFtZTcwMjMyMDU4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001489","name":"Paul Lynde","idIMDB":"nm0001489"},"actorId":"nm0001489","character":"Murphy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Lansing","urlProfile":"http://www.imdb.com/name/nm0487108","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5MTE1ODgxMV5BMl5BanBnXkFtZTYwMTU2OTYy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 June 1928","placeOfBirth":" San Diego, California, USA","birthName":"Robert Howell Brown","height":"6' (1.83 m)","bio":"Robert Lansing was an actor whose tall stature, tough looks and commanding manner belied an often thoughtful and introspective screen personality. Not that acting had necessarily been his only choice - there was jazz. As a youngster, he played drums with various dance bands and was bitten by the acting bug after performing in and directing high school plays, winning the Southern California Shakespearean Festival for dramatic acting at the age of fifteen. Then came two years of army service in Japan, where he worked with the Armed Forces Radio Service. After his discharge, he hitched a ride to New York, but stopped over in Ft. Wayne, Indiana, to spend two years as a radio announcer and act in local theatre. Once finally arrived in the 'Big Apple', he became just another struggling hopeful, frequenting the soup kitchen on 6th Avenue and travelling to auditions. Like countless others in the same position, he had to do in-between jobs to make ends meet, which in his case meant, working in a plastics factory and as a hat check attendant at a Latin Quarter nightclub. His first big break came, when he was hired to play the part of Dunbar in 'Stalag 17' on Broadway in May 1951. This was followed by roles in several prestige plays, including 'Cyrano de Bergerac' and 'Richard III', but resulted neither in recognition nor financial reward. By 1956, he was still living with his wife and child in a vermin-infested tenement on Second Avenue. Considering himself the last 'no-name leading man' in New York, Lansing decided to return to California and try his luck in films. After a few small parts in TV anthology dramas, he landed his first leading role on the big screen as a scientist who stumbles upon a method to penetrate solid matter (needless to say, with predictably dire consequences) in the low budget, but slickly made sci-fi, 4D Man (1959). A throwback to earlier genre classics about man transformed into monster through scientific experimentation, it offered some innovative special effects and clever make-up in the deterioration of Lansing's latter-day Dr. Jekyll. More television work followed, including a lead in the short-lived detective series 87th Precinct (1961), which resulted in him and his family settling permanently on the West Coast. His next milestone did not eventuate until four years later, when he was cast as Brigadier General Frank Savage in 12 O'Clock High (1964). His performance was entirely convincing, of a military man attempting to balance duty with humanity and compassion. At the height of his popularity, Lansing's character was suddenly killed off half way through season two. Given the show's new timeslot at 7.30 P.M., the sponsors clamoured for a younger actor to woo the teen audience (ironically, his replacement, Paul Burke, was actually two years his senior!). Another spurious argument was, that audiences could not relate to a military man above middle-echelon rank. Understandibly a little bitter from this experience, Lansing moved on to playing the dual lead in the espionage drama The Man Who Never Was (1966). Filmed on location in Europe, this was yet another series destined to be axed after a brief run. In-between his regular series work, Lansing had also essayed George Armstrong Custer in three episodes of Branded (1965) (not without incident: on one occasion, he was thrown off his horse and landed in hospital with a broken hip) and starred as the sympathetic lead of the family feature, Namu, the Killer Whale (1966). In 1968, Lansing guested as Gary Seven in 'Assignment: Earth', one of the most likeable and well-written episodes of Star Trek (1966) . His self-assured performance, most certainly, stole the show. It was slated to be the pilot for a spin-off series. Sadly, by this time, the original series was already on the verge of cancellation and the project never got off the ground. Luck was not to be Bob Lansing's middle name. Nonetheless, he kept busy during the next two decades, acting on the stage, where he enjoyed rather more critical, if not financial, success, frequently performing at the Long Wharf and Cherry Lane Theatres. He received much praise for his one-man shows 'Damian' and 'The Disciple of Discontent'. His final Broadway appearance was as Benjamin Hubbard in a revival of 'The Little Foxes' in 1981. He also continued regular screen work, notably as Edward Woodward's 'Control' in The Equalizer (1985) and as the laconic lead of mutant bug monster movies like Empire of the Ants (1977) and The Nest (1988). A heavy smoker, Bob Lansing died from lung cancer one year into his last regular series, Kung Fu: The Legend Continues (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5MTE1ODgxMV5BMl5BanBnXkFtZTYwMTU2OTYy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0487108","name":"Robert Lansing","nicknames":["Bob"],"idIMDB":"nm0487108"},"actorId":"nm0487108","character":"Dr. Charles Howard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Darren","urlProfile":"http://www.imdb.com/name/nm0201626","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MTA2OTUyNF5BMl5BanBnXkFtZTYwNzA2NTU2._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1936","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"James William Ercolani","height":"5' 10½\" (1.79 m)","bio":"Tall, good-looking James Darren was a student of acting coach Stella Adler and made his name in the 1950s in a series of teenage-themed films. A better actor than most of his contemporary teenage heartthrobs, he nevertheless found it difficult to escape the teen-idol image he got in pictures like Gidget (1959) and Gidget Goes Hawaiian (1961). He also gained fame in the early and mid-1960s as a singer, with several hits to his credit, including \"Goodbye Cruel World\" and \"Her Royal Majesty\". His film work tapered off in the 1960s, but he did much TV work and had two hit series, The Time Tunnel (1966) in the 1960s and T.J. Hooker (1982) in the 1980s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MTA2OTUyNF5BMl5BanBnXkFtZTYwNzA2NTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0201626","name":"James Darren","idIMDB":"nm0201626"},"actorId":"nm0201626","character":"James Darren - Singer Behind Title Credits","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0057622","urlIMDB":"http://www.imdb.com/title/tt0057622","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 50 min (110 min)"],"soundMix":["Mono (RCA Sound Recording)"],"color":["Color (Pathécolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"6.1","filmingLocations":[],"awards":[{"award":"Golden Globes, USA 1964","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Motion Picture - Comedy or Musical","names":[]},{"category":"Best Actor - Comedy or Musical","names":[{"name":"Jack Lemmon","id":"nm0000493","role":null}]}]}]}],"votes":"1,285","type":"Movie","companyCreditsSimple":[{"idCompany":"co0037160","name":"Sonnis"}],"keywords":{"keywords":["apartment","student","professor","centaur","sex","marriage","love","landlord","gym","exercise bicycle","man wearing towel","hairy chest","repetition in title","smoking","silhouette","music score features xylophone","orchestral music score","bare chested male","watering can","push ups","artificial flower","toothbrush","stethoscope","eavesdropping","daffodil","sorority","greek letter","convertible","vacancy sign","talking cat","punched in the face","poetry","fire place","candle","dancing","mescal","bachelor pad","knocked unconscious","falling out a window","hit on the head","hand over mouth","carnation","flashlight","shower","the color red","strolling musician","exhaustion","jogging","swimming","watering plant","sprayed with water","barbershop","stuffed animal","cot","passionate kiss","seduction","platonic love","love triangle","jealousy","engagement","college life","celibacy","building","based on play","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:56:47"}}