{"data":{"movies":[{"title":"Bullets or Ballots","originalTitle":"","year":"1936","releaseDate":"19360606","directors":[{"name":"William Keighley","id":"nm0445033"}],"writers":[{"name":"Seton I. Miller","id":"nm0589316"},{"name":"Martin Mooney","id":"nm0600755"}],"runtime":"82 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjQ3ODAzMzM1N15BMl5BanBnXkFtZTgwNjc2OTcyMjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Film-Noir","Thriller"],"plot":"After Police Captain Dan McLaren becomes police commissioner former detective Johnny Blake knocks him down convincing rackets boss Al Kruger that Blake is sincere in his effort to join the mob. \"Buggs\" Fenner thinks Blake is a police agent.","simplePlot":"After Police Captain Dan McLaren becomes police commissioner former detective Johnny Blake knocks him down convincing rackets boss Al Kruger that Blake is sincere in his effort to join the ... ","actors":[{"actorName":"Edward G. Robinson","urlProfile":"http://www.imdb.com/name/nm0000064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzcwMzU5Nl5BMl5BanBnXkFtZTYwNTkwMjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1893","placeOfBirth":" Bucharest, Romania","birthName":"Emmanuel Goldenberg","height":"5' 7\" (1.7 m)","bio":"Edward G. Robinson arrived in the United States at age ten, and his family moved into New York's Lower East Side. He took up acting while attending City College, abandoning plans to become a rabbi or lawyer. The American Academy of Dramatic Arts awarded him a scholarship, and he began work in stock, with his new name, in 1913. Broadway was two years later; he worked steadily there for 15 years. His work included \"The Kibitzer\", a comedy he co-wrote with Jo Swerling. His film debut was a small supporting part in the silent The Bright Shawl (1923), but it was with the coming of sound that he hit his stride. His stellar performance as snarling, murderous thug Rico Bandello in Little Caesar (1931)--all the more impressive since in real life Robinson was a sophisticated, cultured man with a passion for fine art--set the standard for movie gangsters, both for himself in many later films and for the industry. He portrayed the title character in several biographical works, such as Dr. Ehrlich's Magic Bullet (1940) and A Dispatch from Reuter's (1940). Psychological dramas included Flesh and Fantasy (1943), Double Indemnity (1944), The Woman in the Window (1944)and Scarlet Street (1945). Another notable gangster role was in Key Largo (1948). He was \"absolved\" of allegations of Communist affiliation after testifying as a friendly witness for the House Un-American Activities Committee during the McCarthy hysteria of the early 1950s. In 1956 he had to sell off his extensive art collection in a divorce settlement and also had to deal with a psychologically troubled son. In 1956 he returned to Broadway in \"Middle of the Night\". In 1973 he was awarded a special, posthumous Oscar for lifetime achievement.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzcwMzU5Nl5BMl5BanBnXkFtZTYwNTkwMjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000064","name":"Edward G. Robinson","nicknames":["Eddie","Manny"],"idIMDB":"nm0000064"},"actorId":"nm0000064","character":"Johnny Blake","urlCharacter":"http://www.imdb.com/character/ch0237809","main":true},{"actorName":"Joan Blondell","urlProfile":"http://www.imdb.com/name/nm0000951","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMzM0MDEwMl5BMl5BanBnXkFtZTcwNzE1OTQyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 August 1906","placeOfBirth":" New York City, New York, USA","birthName":"Rose Joan Blondell","height":"5' 2\" (1.57 m)","bio":"With blonde hair, big blue eyes and a big smile, Joan was usually cast as the wisecracking working girl who was the lead's best friend. Born into vaudeville to a comic named Eddie, Joan was on the stage when she was three years old. For years, she toured the circuit with her parents and joined a stock company when she was 17. She made her New York debut with the Ziegfeld Follies and appeared in several Broadway productions. She was starring with James Cagney on Broadway in \"Penny Arcade\" (1929) when Warner Brothers decided to film the play as Sinners' Holiday (1930). Both Cagney and Joan were given the leads, and the film was a success. She would be teamed with Cagney again in The Public Enemy (1931) and Blonde Crazy (1931) among others. In The Office Wife (1930), she stole the scene when she was dressing for work. While Warner Brothers made Cagney a star, Joan never rose to that level. In gangster movies or musicals, her performances were good enough for second leads, but not first lead. In the 1930s, she made a career playing gold-diggers and happy-go-lucky girlfriends. She would be paired with Dick Powell in ten musicals during these years, and they were married for ten years. By 1939, Joan had left Warner Brothers to become an independent actress, but by then, the blonde role was being defined by actresses like Veronica Lake. Her work slowed greatly as she went into straight comedy or dramatic roles. Three of her better roles were in Topper Returns (1941), Cry 'Havoc' (1943), and A Tree Grows in Brooklyn (1945). By the 50s, Joan would garner an Academy Award nomination for The Blue Veil (1951), but her biggest career successes would be on the stage, including a musical version of \"A Tree Grows in Brooklyn.\" In 1957, Joan would again appear on the screen as a drunk in Lizzie (1957) and as mature companion to Jayne Mansfield in Will Success Spoil Rock Hunter? (1957). While she would appear in a number of television shows during the 50s and 60s, she had the regular role of Winifred on The Real McCoys (1957) during the 1963 season. Her role in the drama The Cincinnati Kid (1965) was well received, but most of her remaining films would be comedies such as Waterhole #3 (1967) and Support Your Local Gunfighter (1971). Still in demand for TV, she was cast as Lottie on Here Come the Brides (1968) and as Peggy on Banyon (1971).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMzM0MDEwMl5BMl5BanBnXkFtZTcwNzE1OTQyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000951","name":"Joan Blondell","idIMDB":"nm0000951"},"actorId":"nm0000951","character":"Lee Morgan","urlCharacter":"http://www.imdb.com/character/ch0481827","main":true},{"actorName":"Barton MacLane","urlProfile":"http://www.imdb.com/name/nm0533692","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NzYwMTExOV5BMl5BanBnXkFtZTcwNDgzMzIxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1902","placeOfBirth":" Columbia, South Carolina, USA","birthName":"Ernest Barton MacLane","height":"6' 1\" (1.85 m)","bio":"Barton MacLane graduated from Wesleyan University, where he displayed a notable aptitude for sports, in particular football and basketball. Not surprisingly, his physical prowess led to an early role in The Quarterback (1926) with Richard Dix. MacLane once commented that, as an actor, he needed to have the physical strength to tear the bad guys \"from limb to limb\", if necessary. Ironically, it was usually Barton himself who was destined to be at the end of a hiding (when not getting shot, instead), typically as snarling henchmen, outlaws and other assorted dubious or abrasive types throughout most of his 40-year acting career. In fact, Barton became so typecast, that his name was for a time used proverbially, to generally describe a shouting, hard-nosed ruffian. After training at the American Academy of Dramatic Arts, MacLane joined a stock company in Brooklyn. In 1927 he had his first part on Broadway, a brief moment as an assistant district attorney, in the melodrama \"The Trial of Mary Dugan\". He then played a small featured role as a police officer in \"Subway Express\" (1929-30), a drama enacted in the interior of a subway car. In mid-1932 MacLane tried his hand at writing his own starring vehicle for the stage, entitled \"Rendezvous\". While the play closed after just 21 performances, it led to a contract with Warner Brothers. Barton had already appeared in bit roles for Paramount at their Astoria Studios, including The Marx Brothers' debut film The Cocoanuts (1929). He portrayed mobster Brad Collins in 'G' Men (1935) (with James Cagney), which set the tone for most of his future assignments. Brawny, with squinty eyes and a rasping voice, MacLane was the ideal surly tough guy, particularly suitable for westerns and the type of films noir Warner Brothers excelled at. He was often cast as cops, be they bent or honest. Some of his most representative performances include gangster Al Kruger in Bullets or Ballots (1936), which won him some of the best critical notices of his career; outlaw Jack Slade in Western Union (1941); crooked construction boss Pat McCormick, who gets beaten up by Humphrey Bogart and Tim Holt over past-due wages in The Treasure of the Sierra Madre (1948); hard-nosed cops Detective Dundy in The Maltese Falcon (1941) and Lt. Reece in Kiss Tomorrow Goodbye (1950). MacLane, on loan to Universal, also had a starring role in Prison Break (1938) as an innocent tuna fisherman who is framed for murder. He was prominent as a tough but sympathetic cop, foil to sleuthing girl reporter Glenda Farrell in the \"Torchy Blaine\" series of the mid- to late 1930s. In the 1960s Barton began to cultivate a good-guy image as Marshal Frank Caine in the NBC western series Outlaws (1960) as well as showing up in a small recurring role as Air Force Gen. Martin Peterson in I Dream of Jeannie (1965). Barton was married to the actress Charlotte Wynters, who appeared with him in six of his films. When not on the set, the couple spent time on their 2000-acre cattle ranch in Madera County, California. For his work in television, Barton has a star on the Hollywood Walk of Fame.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NzYwMTExOV5BMl5BanBnXkFtZTcwNDgzMzIxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0533692","name":"Barton MacLane","idIMDB":"nm0533692"},"actorId":"nm0533692","character":"Al Kruger","urlCharacter":"http://www.imdb.com/character/ch0509183","main":true},{"actorName":"Humphrey Bogart","urlProfile":"http://www.imdb.com/name/nm0000007","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTE3MDM5Ml5BMl5BanBnXkFtZTYwMzA2MTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1899","placeOfBirth":" New York City, New York, USA","birthName":"Humphrey DeForest Bogart","height":"5' 8\" (1.73 m)","bio":"Humphrey DeForest Bogart was born in New York City, New York, to Maud Humphrey, a famed magazine illustrator and suffragette, and Belmont DeForest Bogart, a moderately wealthy surgeon (who was secretly addicted to opium). Bogart was educated at Trinity School, NYC, and was sent to Phillips Academy in Andover, Massachusetts, in preparation for medical studies at Yale. He was expelled from Phillips and joined the U.S. Naval Reserve. From 1920 to 1922, he managed a stage company owned by family friend William A. Brady (the father of actress Alice Brady), performing a variety of tasks at Brady's film studio in New York. He then began regular stage performances. Alexander Woollcott described his acting in a 1922 play as inadequate. In 1930, he gained a contract with Fox, his feature film debut in a ten-minute short, Broadway's Like That (1930), co-starring Ruth Etting and Joan Blondell. Fox released him after two years. After five years of stage and minor film roles, he had his breakthrough role in The Petrified Forest (1936) from Warner Bros. He won the part over Edward G. Robinson only after the star, Leslie Howard, threatened Warner Bros. that he would quit unless Bogart was given the key role of Duke Mantee, which he had played in the Broadway production with Howard. The film was a major success and led to a long-term contract with Warner Bros. From 1936 to 1940, Bogart appeared in 28 films, usually as a gangster, twice in Westerns and even a horror film. His landmark year was 1941 (often capitalizing on parts George Raft had stupidly rejected) with roles in classics such as High Sierra (1941) and as Sam Spade in one of his most fondly remembered films, The Maltese Falcon (1941). These were followed by Casablanca (1942), The Big Sleep (1946), and Key Largo (1948). Bogart, despite his erratic education, was incredibly well-read and he favored writers and intellectuals within his small circle of friends. In 1947, he joined wife Lauren Bacall and other actors protesting the House Un-American Activities Committee witch hunts. He also formed his own production company, and the next year made The Treasure of the Sierra Madre (1948). Bogie won the best actor Academy Award for The African Queen (1951) and was nominated for Casablanca (1942) and as Captain Queeg in The Caine Mutiny (1954), a film made when he was already seriously ill. He died in his sleep at his Hollywood home following surgeries and a battle with throat cancer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTE3MDM5Ml5BMl5BanBnXkFtZTYwMzA2MTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000007","name":"Humphrey Bogart","nicknames":["Bogie"],"idIMDB":"nm0000007"},"actorId":"nm0000007","character":"'Bugs' Fenner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank McHugh","urlProfile":"http://www.imdb.com/name/nm0570451","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMTYwNzE4MV5BMl5BanBnXkFtZTcwNzYyOTIyNw@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 May 1898","placeOfBirth":" Homestead, Pennsylvania, USA","birthName":"Francis Curray McHugh","height":"5' 7\" (1.7 m)","bio":"The parents of Frank McHugh ran their own stock company and he was on the stage as a child. When he was 10 he was part of an act that include his brother Matt McHugh and sister Kitty McHugh. After vaudeville and other stock companies, Frank debuted on Broadway \"The Fall Guy\" (1925). In 1930 he was hired at Warner Brothers as a contract player. Frank would usually play the sidekick to the lead actor and would provide the comedy relief in tense situations - if it were called for. With his nervous laugh and hangdog look, he appeared in over 90 movies in the first dozen years he worked at Warners. He would also appear with another very busy character actor, Allen Jenkins, in a dozen or so films. McHugh would be a mechanic, a song plugger, a pilot, a baseball player or a newspaperman, and would either be married or get the girl only if the girl was not the one the hero was interested in. Over the years he would work with most of the stars that Warners employed. By the early 1950s his film career started winding down. From 1964 to 1965 he played the role of Willis Walter on The Bing Crosby Show (1964).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMTYwNzE4MV5BMl5BanBnXkFtZTcwNzYyOTIyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0570451","name":"Frank McHugh","idIMDB":"nm0570451"},"actorId":"nm0570451","character":"Herman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe King","urlProfile":"http://www.imdb.com/name/nm0454870","urlPhoto":"","biography":{"dateOfBirth":"9 February 1883","placeOfBirth":" Austin, Texas, USA","birthName":"Joseph Sayers King","bio":"Joe King was born on February 9, 1883 in Austin, Texas, USA as Joseph Sayers King. He was an actor and director, known for Shifting Sands (1918), Destry Rides Again (1939) and Bullets or Ballots (1936). He was married to Hazel Buckham. He died on April 11, 1951 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0454870","name":"Joe King","idIMDB":"nm0454870"},"actorId":"nm0454870","character":"Capt. Dan McLaren","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dick Purcell","urlProfile":"http://www.imdb.com/name/nm0700711","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGE0NTJmNzgtMTRkOS00ODQ2LTg3ZDgtZGRhOTMzM2I3ZWRjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1908","placeOfBirth":" Greenwich, Connecticut, USA","bio":"Dick Purcell was born on August 6, 1908 in Greenwich, Connecticut, USA. He was an actor, known for King of the Zombies (1941), Captain America (1944) and The Bank Dick (1940). He was married to Ethelind Terry. He died on April 10, 1944 in Hollywood, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGE0NTJmNzgtMTRkOS00ODQ2LTg3ZDgtZGRhOTMzM2I3ZWRjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0700711","name":"Dick Purcell","idIMDB":"nm0700711"},"actorId":"nm0700711","character":"Ed Driscoll","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George E. Stone","urlProfile":"http://www.imdb.com/name/nm0831889","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA5NTQyMjg2Ml5BMl5BanBnXkFtZTcwMDQ5NzkxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1903","placeOfBirth":" Lódz, Poland, Russian Empire [now Lódz, Lódzkie, Poland]","birthName":"Gerschon Lichtenstein","height":"5' 3½\" (1.61 m)","bio":"A minor prototype of the \"Runyon-esque\" character for more than three decades, Polish-born actor George E. Stone (né George Stein) was in actuality a close friend of writer Damon Runyon and would play a host of colorful \"dees, dem and dos\" cronies throughout the 1920s, '30s, and '40s. With great names such as Johnnie the Shiek, Boots Burnett, Ice Box Hamilton, Wires Kagel, Ropes McGonigle, Society Max, and Toothpick Charlie, Stone delighted audiences in scores of crimers for decades. A vaudeville and Broadway hoofer in the interim, the runt-sized Stone (5' 3\") finally scored in his first \"grownup\" part as the Sewer Rat in the silent drama 7th Heaven (1927) starring the once-popular romantic pair Charles Farrell and (Academy Award winner) Janet Gaynor. As \"Georgie\" sounded too child-like, he began billing himself as \"George E. Stone.\" From there he was featured in a number of \"tough guy\" potboilers, particularly for Warner Bros. So typed was he as a henchman or thug, that he found few films outside the genre. His gunsels often possessed a yellow streak and could be both broadly comic or threatening in nature, with more than a few of them ending up on a morgue slab before film's end, including his Earl Williams on The Front Page (1931) and Otero in the classic gangster flick Little Caesar (1931). Stone's most popular role of the 1940s was as The Runt in the Boston Blackie film series which ran from 1941 to 1948 and starred Chester Morris. Suffering from failing eyesight in later years, he was virtually blind by the late 1950s but, thanks to friends, managed to secure sporadic film and TV work. From 1958 on, Stone could be glimpsed in a recurring role on the popular courtroom series Perry Mason (1957) as a court clerk. Married to second wife Marjorie Ramey in 1946, he died following a stroke in 1967 in Woodland Hills, California, and was survived by two sisters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA5NTQyMjg2Ml5BMl5BanBnXkFtZTcwMDQ5NzkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0831889","name":"George E. Stone","idIMDB":"nm0831889"},"actorId":"nm0831889","character":"Wires Kagel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joseph Crehan","urlProfile":"http://www.imdb.com/name/nm0003277","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjBiM2M0ZmEtMDA0MS00OTQ0LTk0MDItNDVkN2RlNzEyMDFhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1883","placeOfBirth":" Baltimore, Maryland, USA","birthName":"Joseph A. Creaghan","bio":"Joseph Crehan was born on July 15, 1883 in Baltimore, Maryland, USA as Joseph A. Creaghan. He was an actor, known for The Roaring Twenties (1939), Black Magic (1944) and Street Corner (1948). He was married to Dorothy Lord. He died on April 15, 1966 in Hollywood, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjBiM2M0ZmEtMDA0MS00OTQ0LTk0MDItNDVkN2RlNzEyMDFhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003277","name":"Joseph Crehan","idIMDB":"nm0003277"},"actorId":"nm0003277","character":"Grand Jury Spokesman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Henry O'Neill","urlProfile":"http://www.imdb.com/name/nm0642180","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGI0OTYxMTMtZDZhZi00OTA2LTg2YTAtNjQyYzE1NDllMGUyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1891","placeOfBirth":" Orange, New Jersey, USA","height":"5' 10\" (1.78 m)","bio":"Suave, well-mannered, silvery-haired character actor Henry O'Neill played top supports in hundreds of films, often as a benign, wise, sensible father, judge, doctor, executive or lawyer. Most of his uppercrust career was split between two studios: Warner Bros in the 1930s and MGM in the 1940s. O'Neill was born in New Jersey in 1891 and dropped out of college to join a traveling theatre troupe. World War I service in the military intervened but he returned to acting in 1919 and began a distinguished career on the New York stage in the 1920s, his prematurely gray hair lending an air of pride and confidence in his many distinctive roles, particularly those in works of playwright Eugene O'Neill. In 1933 he made a solid, unerring switch to films and settled in for the duration. Although he was typically cast in agreeable roles, he certainly had it in him to be an urbane villain when the call came in. In the 1950s, due to ill health, he spaced out his feature work, making his last film, The Wings of Eagles (1957) with John Wayne. He also found employment in TV anthologies as well. He died in 1961 at the age of 69.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGI0OTYxMTMtZDZhZi00OTA2LTg2YTAtNjQyYzE1NDllMGUyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0642180","name":"Henry O'Neill","nicknames":["Pop"],"idIMDB":"nm0642180"},"actorId":"nm0642180","character":"Ward Bryant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Henry Kolker","urlProfile":"http://www.imdb.com/name/nm0464137","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDRjMWYxYzItZDNmYS00MmVhLTljNzgtZGQwYzgwYTQ1ZjEzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1874","placeOfBirth":" Berlin, Germany","birthName":"Joseph Henry Kolker","height":"5' 10½\" (1.79 m)","bio":"Stalwart character actor Henry Kolker appeared on the Broadway stage from 1904, comedy being his forte early on. Later, as a leading man in romantic dramas, he partnered famous stars like Alla Nazimova. Moving on to films in 1914 as actor/director, he became noted in particular for directing Disraeli (1921), starring George Arliss (now a lost film, except for one reel). Plagued by ill-health and much publicised marital problems, Kolker's star had waned somewhat by the end of the silent era. However, he continued to remain in demand as a supporting actor, generally typecast as stern judges, priests, heavy fathers and cuckolded husbands. Usually scowling and sombre, he chided and glowered over stars like Melvyn Douglas, Gary Cooper and Katharine Hepburn (arguably his best role being the latter's father, Edward Seton, in Holiday (1938)). He was equally effective in the role of banker John Fair in The Crash (1932), and as Friar Laurence in George Cukor's Romeo and Juliet (1936). Kolker remained a prolific fixture on screen throughout the 1930's, managing to tally up in excess of twenty appearances each, for 1934 and 1935 alone.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDRjMWYxYzItZDNmYS00MmVhLTljNzgtZGQwYzgwYTQ1ZjEzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0464137","name":"Henry Kolker","idIMDB":"nm0464137"},"actorId":"nm0464137","character":"Mr. Hollister","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gilbert Emery","urlProfile":"http://www.imdb.com/name/nm0256298","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzlkYTUxODktNDA2ZC00YTM4LTg0NzItOWI1MDAxNTMyNDgxXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 June 1875","placeOfBirth":" Naples, New York, USA","birthName":"Gilbert Emery Bensley Pottle","height":"6' 2\" (1.88 m)","bio":"Gilbert Emery was born on June 11, 1875 in Naples, New York, USA as Gilbert Emery Bensley Pottle. He was an actor and writer, known for A Farewell to Arms (1932), Dracula's Daughter (1936) and That Hamilton Woman (1941). He died on October 28, 1945 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzlkYTUxODktNDA2ZC00YTM4LTg0NzItOWI1MDAxNTMyNDgxXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0256298","name":"Gilbert Emery","idIMDB":"nm0256298"},"actorId":"nm0256298","character":"Mr. Thorndyke","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Herbert Rawlinson","urlProfile":"http://www.imdb.com/name/nm0712660","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmJkZjhlN2EtYWYzNi00NGE3LTgzMWYtNjFjNGM1MTU1NGViXkEyXkFqcGdeQXVyMzI2MDEwNA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1885","placeOfBirth":" Brighton, East Sussex, England, UK","height":"6' (1.83 m)","bio":"Herbert Rawlinson was born on November 15, 1885 in Brighton, East Sussex, England. He was an actor and producer, known for Dark Victory (1939), Flash Gordon Conquers the Universe (1940) and Jail Bait (1954). He was married to Loraine Abigail Long, Roberta Arnold and Josephine Norman. He died on July 12, 1953 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmJkZjhlN2EtYWYzNi00NGE3LTgzMWYtNjFjNGM1MTU1NGViXkEyXkFqcGdeQXVyMzI2MDEwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0712660","name":"Herbert Rawlinson","idIMDB":"nm0712660"},"actorId":"nm0712660","character":"Mr. Caldwell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Louise Beavers","urlProfile":"http://www.imdb.com/name/nm0064792","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmU1NmU1ZDEtMTYyYy00NzYzLWJhY2MtZWU1ODAwZmZiOTI2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 March 1902","placeOfBirth":" Cincinnati, Ohio, USA","height":"5' 4\" (1.63 m)","bio":"1930s and 1940s film actress Louise Beavers was merely one of a dominant gallery of plus-sized and plus-talented African-American character actresses forced to endure blatant, discouraging and demeaning stereotypes during Depression-era and WWII Hollywood. It wasn't until Louise's triumphant role in Fannie Hurst's classic soaper Imitation of Life (1934) that a film of major significance offered a black role of meaning, substance and humanity. Despite the fact that Louise was playing yet another of her endless servile roles as housekeeper Delilah who works for single white mother Claudette Colbert, this time around her character was three-dimensional and not merely a source of servitude and/or or comic relief. She had her own dramatic story and brilliantly handled the heartbreaking co-plot of an appeasing single parent whose light-skinned daughter (played by Fredi Washington) went to cruel and desperate lengths to pass for white. While Louise certainly championed in the role and managed to steal the lion's share of reviews right from under the film's superstar, the movie triggered major controversy and just as many complaints as compliments from both black and white viewers. This certainly did not help what could have been a major, positive shift in black filmmaking. Instead, for the next two or more decades Louise was again forced to retreat into secondary status with precious few opportunities to shine. Ms. Beavers was born in Cincinnati, Ohio, on March 8, 1902 and moved with her family to the Los Angeles area at age 11. A student at Pasadena High School and a choir member at her local church, her mother, a voice teacher, trained Louise for the concert stage but instead the young girl joined an all-female minstrel company called \"Lady Minstrels\" and even hooked up for a time on the vaudeville circuit. A nursing career once entertained was quickly aborted in favor of acting. Her first break of sorts was earning a living as a personal maid and assistant to Paramount star Leatrice Joy (and later actress Lilyan Tashman). By 1924 she was performing as an extra or walk-on in between her chores. A talent agent spotted her and gave her a more noticeable role in Uncle Tom's Cabin (1927). She went on to gain even more visibility, but was invariably stuck in the background cooking or cleaning after the leads. Despite this her beaming smile and good nature paid off. Following scene-grabbing maid roles to such stars as Mary Pickford in Coquette (1929) Linda Watkins in Good Sport (1931), Mae West in She Done Him Wrong (1933), Constance Bennett in What Price Hollywood? (1932) and Jean Harlow in Bombshell (1933), Louise received the role of her career. Her poignant storyline and final death scene deserved an Oscar nomination and many insiders took her snub as deliberate and prejudicial. Five years later her compatriot (and close friend) Hattie McDaniel would become the first black actor to not only earn an Oscar nomination but capture the coveted trophy as well for her subordinate role in Gone with the Wind (1939). Despite their individual triumphs, both ladies continued to trudge through more of the same, albeit steadily. Occasionally Louise was rewarded with such Hollywood \"A\" treats as Made for Each Other (1939) with Carole Lombard, Holiday Inn (1942) starring Bing Crosby, and especially Mr. Blandings Builds His Dream House (1948) with Cary Grant and Myrna Loy. In The Jackie Robinson Story (1950), she offered lovely moments as the baseball star's mother. Although film offers dried up in the 1950s, Louise managed to transfer her talents to the new TV medium, and was one of a number of character actresses hired to play the wise-cracking, problem-solving maid Beulah (1950) during its run. \"Beulah\" was one of the first sitcoms to star a black actor. She also had a recurring role in Disney's \"The Swamp Fox\". In 1957, she made her professional stage debut in San Francisco with the short-lived play \"Praise House\" as a caregiver who extols the Bible through song. Her last few films, which included The Goddess (1958), All the Fine Young Cannibals (1960) and the Bob Hope comedy The Facts of Life (1960) were typical stereotypes and unmemorable. A long time bachelor lady who finally married in the 1950s, the short and stout actress was plagued by health issues in later years, her obesity and diabetes in particular. She lost her fight on October 26, 1962, at age 60 following a heart attack. In 1976 she was posthumously inducted into the Black Filmmakers Hall of Fame.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmU1NmU1ZDEtMTYyYy00NzYzLWJhY2MtZWU1ODAwZmZiOTI2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0064792","name":"Louise Beavers","idIMDB":"nm0064792"},"actorId":"nm0064792","character":"Nellie LaFleur","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Norman Willis","urlProfile":"http://www.imdb.com/name/nm0932425","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGRlM2UwYTQtMjk0OC00NWIwLThmNDUtM2JlN2IwMWRkMTYyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 May 1903","placeOfBirth":" Chicago, Illinois, USA","birthName":"Willis Norman","bio":"Norman Willis was born on May 27, 1903 in Chicago, Illinois, USA as Willis Norman. He was an actor, known for Out West (1947), Bullets or Ballots (1936) and Tim Tyler's Luck (1937). He died on January 27, 1988 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGRlM2UwYTQtMjk0OC00NWIwLThmNDUtM2JlN2IwMWRkMTYyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0932425","name":"Norman Willis","idIMDB":"nm0932425"},"actorId":"nm0932425","character":"Louie Vinci","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0027407","urlIMDB":"http://www.imdb.com/title/tt0027407","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Copyright MCMXXXVI by Warner Bros. Pictures, Inc. and The Vitaphone Corp'n (on print)"},"technical":{"runtime":["1 hr 22 min (82 min)"],"soundMix":["Mono"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["(9 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.1","filmingLocations":[{"location":"Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA"}],"rated":"APPROVED","awards":[],"votes":"2,005","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."}],"keywords":{"keywords":["police","manhattan new york city","new york city","street shootout","bar shootout","police shootout","three word title","death of main character","wainscoting","source music","solitary confinement","no music score","newspaper headline montage","main character dies","maid","gambling","friend","african american woman","shot to death","newsreel","gunfight","death of protagonist","newspaper headline","movie theater","movie screen","greedy businessman","evil businessman","fired from the job","crooked businessman","corrupt businessman","assassination","murder","banker","numbers racket","fistfight","undercover cop","madison square garden manhattan new york city","police raid","grand jury","boxing","reformer","political corruption","criminal","showgirl","businessman"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 21:27:46"}}