{"data":{"movies":[{"title":"WarGames","originalTitle":"","year":"1983","releaseDate":"19830603","directors":[{"name":"John Badham","id":"nm0000824"}],"writers":[{"name":"Lawrence Lasker","id":"nm0489623"},{"name":"Walter F. Parkes","id":"nm0662748"}],"runtime":"114 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMTE3OTk3NF5BMl5BanBnXkFtZTcwOTkwNDc3NA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Sci-Fi","Thriller"],"plot":"A young computer whiz kid accidentally connects into a top secret super-computer which has complete control over the U.S. nuclear arsenal. It challenges him to a game between America and Russia, and he innocently starts the countdown to World War 3. Can he convince the computer he wanted to play a game and not the real thing ?","simplePlot":"A young man finds a back door into a military central computer in which reality is confused with game-playing, possibly starting World War III.","actors":[{"actorName":"Matthew Broderick","urlProfile":"http://www.imdb.com/name/nm0000111","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NjA0MzM0OF5BMl5BanBnXkFtZTcwMDU5ODAxMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 March 1962","placeOfBirth":" New York City, New York, USA","height":"5' 8\" (1.73 m)","bio":"A slight comic actor chiefly known for his boyish charm, Matthew Broderick was born on March 21, 1962 in New York City, to Patricia Broderick (née Biow), a playwright and painter, and James Broderick, an actor. His father had Irish and English ancestry, and his mother was from a Jewish family (from Germany and Poland). Matthew initially took up acting at New York's upper-crust Walden School after being sidelined from his athletic pursuits (football and soccer) by a knee injury. His father got him his stage debut at age 17 in a workshop production of the play \"On Valentine's Day\". Matthew's career then accelerated with parts in two Neil Simon projects: the play \"Brighton Beach Memoirs\" (1982-83) and the feature film Max Dugan Returns (1983). Broderick reprised the role of Eugene in \"Biloxi Blues\" (1988), the second installment of the Simon trilogy, for both the Broadway production and the film adaptation (Biloxi Blues (1988)). For the third and final installment of the trilogy, he was replaced by Jonathan Silverman. In 1983, the same year as Max Dugan Returns (1983), Broderick had his first big-screen success in the light comedy WarGames (1983). Since then he has had his fair share of hits and misses, with some of his better films including Project X (1987) also starring Helen Hunt, whom he subsequently dated; Addicted to Love (1997); and Inspector Gadget (1999). Other films he has appeared in which may be known but not so much respected include Out on a Limb (1992) with his Ferris Bueller's Day Off (1986) co-star Jeffrey Jones; The Night We Never Met (1993); The Road to Wellville (1994); and The Cable Guy (1996) with Jim Carrey, which got him an MTV \"Best Fight\" award nomination; and the MTV film Election (1999) with Reese Witherspoon. In 1985 he was involved in a controversial car crash while driving in Ireland with his then fiancée Jennifer Grey. The crash killed a woman and her daughter. Broderick paid a small fine to the family of the victims. He broke his leg in the accident, which happened just as Ferris Bueller's Day Off (1986), his biggest hit, was coming out in the US. The box office success (but critical flop) and special effects blockbuster Godzilla (1998) gave Broderick his first action role (should any \"Godzilla\" sequels be planned, he is under contract for two more). He has occasionally returned to the stage in New York, either in revivals of old musical warhorses such as \"How To Succeed In Business Without Really Trying\" or in revivals of old \"show people\"plays, such as \"Night Must Fall\". In 1996 Broderick attempted to wear three hats as co-producer/director/actor in Infinity (1996), working very closely with his mother, who also wrote the screenplay. It was not a critical or commercial success, and he has not directed or produced since. Since May 1997 he has been married to actress Sarah Jessica Parker. He was previously engaged to both Helen Hunt and dated Lili Taylor. In 1999 he donned a trenchcoat for the children's film Inspector Gadget (1999), alongside Rupert Everett as the evil villain Claw. In March 2001 Broderick returned to Broadway in the musical smash \"The Producers\" (based on the 1968 Mel Brooks film of the same name). He was nominated for the Tony Award for Best Actor in a Musical, which he lost to his co-star, Nathan Lane.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NjA0MzM0OF5BMl5BanBnXkFtZTcwMDU5ODAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000111","name":"Matthew Broderick","idIMDB":"nm0000111"},"actorId":"nm0000111","character":"David","urlCharacter":"http://www.imdb.com/character/ch0012893","main":true},{"actorName":"Dabney Coleman","urlProfile":"http://www.imdb.com/name/nm0001056","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MjMxOTQyNV5BMl5BanBnXkFtZTYwNDQ3Mjg1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1932","placeOfBirth":" Austin, Texas, USA","birthName":"Dabney Wharton Coleman","height":"6' 1\" (1.85 m)","bio":"For decades, Dabney Coleman has often appeared as a smarmy, selfish, nervous person, often with money, who is mostly out for himself. He did such a good job in this type of part that he's made a career of it in film. Dabney Wharton Coleman was born in Austin, Texas, to Mary Wharton (Johns) and Melvin Randolph Coleman. He attended the Virginia Military Institute, and studied law in Texas. Coleman has a well deserved reputation as a fine character actor, and a reliable presence for almost any role in TV and movies. Dabney Coleman's early appearances in the cinema were in The Slender Thread (1965) and Downhill Racer (1969). On TV he starred in That Girl (1966). As the 1970s approached he became a well-known character actor in television and movies, appearing in The Towering Inferno (1974), Midway (1976), and Cinderella Liberty (1973). Television seemed Dabney Coleman's forum in the 1970s as Coleman played the role of Merle Jeeter in Mary Hartman, Mary Hartman (1976) and Fernwood Tonight (1977). Coleman made appearances in the popular North Dallas Forty (1979) and the Oscar-winning Melvin and Howard (1980). Dabney Coleman also became known for some satirical movies, starring in the comedy How to Beat the High Co$t of Living (1980) and snatched a lead role for the TV movie Pray TV (1980). Coleman's reputation for playing world-class jerks became cemented in 1980 as the boss to Dolly Parton , Jane Fonda and Lily Tomlin in 9 to 5 (1980). The next year, Coleman was in very good company working with legends Henry Fonda and Katharine Hepburn in On Golden Pond (1981). Coleman's hit streak would not end there. In 1982 Coleman landed a key role in the classic Tootsie (1982), further cementing his role as an unlikable wealthy boss in some capacity. In 1983 Coleman starred in the Cold War classic WarGames (1983). During this period he also found many parts in lesser known movies like Young Doctors in Love (1982) and Callie & Son (1981). In 1984 he starred in The Muppets Take Manhattan (1984) and in 1985 he starred with Tom Hanks in The Man with One Red Shoe (1985). In 1987 the actor won an Emmy for Sworn to Silence (1987). In 1990 Coleman took two lead roles, one in the disastrous Where the Heart Is (1990), and the other in the quirky comedy Short Time (1990). In 1993 Coleman starred in the slapstick comedy Amos & Andrew (1993) (a very funny part) and in a remake of the TV show The Beverly Hillbillies (1993) as Milburn Drysdale. Coleman took an extensive line of TV movies, such films as Texan, In the Line of Duty, among others. Coleman took an unusual part in the ABC cartoon, Recess (1997), and then starred in a couple of big money grossers, the Tom Hanks comedy, You've Got Mail (1998), as Chief Quimby in Inspector Gadget (1999), and in Stuart Little (1999), both 1999. Coleman is still very active.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MjMxOTQyNV5BMl5BanBnXkFtZTYwNDQ3Mjg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001056","name":"Dabney Coleman","idIMDB":"nm0001056"},"actorId":"nm0001056","character":"McKittrick","urlCharacter":"http://www.imdb.com/character/ch0012896","main":true},{"actorName":"John Wood","urlProfile":"http://www.imdb.com/name/nm0939795","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDUwMTAzNzUzMV5BMl5BanBnXkFtZTcwMzc0MDIyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 July 1930","placeOfBirth":" Derbyshire, England, UK","height":"6' 2\" (1.88 m)","bio":"Studied law at Jesus College, Oxford, but became president of OUDS by his final year, when he played the lead in \"Richard III\" to wide critical acclaim. Subsequently joined the Old Vic, where among other roles he played \"the Dauphin\" to Richard Burton's \"Henry V\". Left the Old Vic under less than happy circumstances and had even less luck with the Royal Court. Spent some time in France, where he briefly considered remaining, but returned to the UK and spent some seven years working in television and low-paying quickie films. In 1966, played one of the leads in Tom Stoppard's teleplay Thirty-Minute Theatre: Teeth (1967) -- an instant artistic rapport was the result, as was a second Stoppard role in Thirty-Minute Theatre: Another Moon Called Earth (1967), a sort of proto-Jumpers. Critical and commercial break came with the role of \"Guil\" in the NYC run of Rosencrantz & Guildenstern Are Dead, for which he received a Tony nomination. Back in the UK, won Most Promising Actor award in 1970 for his role in the Harold Pinter production of James Joyce's \"Exiles\". Invited to join the RSC, he began a series of highly individual Shakespearean roles, as well as more popularly-based efforts. His \"Sherlock Holmes\" in 1974 was reprised in NYC, resulting in a second Tony nomination. The following year, the New York run of Stoppard's \"Travesties\" -- in which he starred as \"Henry Carr\" -- gave him the Tony for Best Actor. Additional theatre work in America: \"Tartuffe\", \"Deathtrap\" and \"Amadeus\". UK theatre work included \"Devil's Disciple\", \"Every Good Boy Deserves Favour\", \"Undiscovered Country\", \"Man Who Came To Dinner\", title role in \"Richard III\", \"Prospero\" in \"Tempest\", \"Lear\" in \"King Lear\" and, of course, \"A.E. Housman\" in Stoppard's \"Invention of Love\" in 1997, for which he received an Laurence Olivier Award nomination. Married twice, four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDUwMTAzNzUzMV5BMl5BanBnXkFtZTcwMzc0MDIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0939795","name":"John Wood","idIMDB":"nm0939795"},"actorId":"nm0939795","character":"Falken","urlCharacter":"http://www.imdb.com/character/ch0012897","main":true},{"actorName":"Ally Sheedy","urlProfile":"http://www.imdb.com/name/nm0000639","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MzY0NTU3OF5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1962","placeOfBirth":" New York City, New York, USA","birthName":"Alexandra Elizabeth Sheedy","height":"5' 5\" (1.65 m)","bio":"Ally Sheedy was born in New York City, to Charlotte (Baum), a press agent and writer, and John J. Sheedy, Jr., an advertising executive. She is of Russian Jewish (mother) and Irish (father) descent. While at New York's Bank Street School, 12-year-old Ally Sheedy wrote about a mythical encounter between Queen Elizabeth I and an inquisitive mouse. The result, \"She Was Nice to Mice\", was published by McGraw-Hill and became an instant best seller. Although it proved a springboard to an acting career, Sheedy's strongest memories of childhood remain those of \"dancing and doing plays\". From six until fourteen, she danced with the American Ballet Theatre and, during summers at Fire Island, she'd \"get a bunch of kids together and stage shows on back lawns and porches\". When she discovered that to stay with dancing meant staying with starvation diets, she shifted her focus to acting for good. Meanwhile, her book brought her requests from several publications. The Village Voice asked her to review movies and the New York Times wanted her to review children's books. The assignment she accepted was from Ms. Magazine, which requested an article about her mother and herself. It was an appearance on \"The Mike Douglas Show (1961) to promote her book, however, that brought Sheedy work as a performer. Signed by an agent who caught the show, she was sent out on television commercials, immediately. Only 15 at the time, she also performed off-Broadway and on a series of after-school specials. The day she turned 18, Sheedy packed her bags and headed for Los Angeles, where she enrolled in the drama department at USC, and soon landed roles in the television drama The Best Little Girl in the World (1981), The Day the Loving Stopped (1981), Splendor in the Grass (1981) and Homeroom (1981) and played a recurring character on Hill Street Blues (1981). The strength of her performances led directly to her film debut as Sean Penn's naive-but-knowing girlfriend, \"J.C.\", in Bad Boys (1983). That same year (1983), she starred as Matthew Broderick's zany partner in WarGames (1983). After starring as Rob Lowe's would-be romantic interest in Oxford Blues (1984), the withdrawn adolescent of The Breakfast Club (1985) and Gene Hackman's adoring daughter in Twice in a Lifetime (1985), Sheedy played her first fully-adult role in St. Elmo's Fire (1985), the 1985 hit about college friends.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MzY0NTU3OF5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000639","name":"Ally Sheedy","idIMDB":"nm0000639"},"actorId":"nm0000639","character":"Jennifer","urlCharacter":"http://www.imdb.com/character/ch0012894","main":true},{"actorName":"Barry Corbin","urlProfile":"http://www.imdb.com/name/nm0179224","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNTYxMDg4Ml5BMl5BanBnXkFtZTcwNTc4ODM3OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 October 1940","placeOfBirth":" Lamesa, Texas, USA","birthName":"Leonard Barry Corbin","height":"5' 11\" (1.8 m)","bio":"Barry's full given name is Leonard Barrie Corbin, and he was born on October 16, 1940 in Lamesa, Texas, to Kilmer Blain Corbin, an attorney, and Alma Corbin, an elementary school teacher. Barry has a daughter named Shannon Ross, with whom he shares his 15-acre ranch in Fort Worth, Texas, when he isn't working. He says that he rides horses there every chance he gets.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNTYxMDg4Ml5BMl5BanBnXkFtZTcwNTc4ODM3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0179224","name":"Barry Corbin","idIMDB":"nm0179224"},"actorId":"nm0179224","character":"General Beringer","urlCharacter":"http://www.imdb.com/character/ch0012895","main":true},{"actorName":"Juanin Clay","urlProfile":"http://www.imdb.com/name/nm0165536","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDgxNzEzOV5BMl5BanBnXkFtZTcwMzU5MDYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 November 1949","placeOfBirth":" Los Angeles, California, USA","birthName":"Juanin Clay de Zalduondo","bio":"Juanin Clay was born on November 26, 1949 in Los Angeles, California, USA as Juanin Clay de Zalduondo. She was an actress, known for WarGames (1983), The Legend of the Lone Ranger (1981) and The Edge of Night (1956). She was married to Joe Lambie. She died on March 12, 1995 in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NDgxNzEzOV5BMl5BanBnXkFtZTcwMzU5MDYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0165536","name":"Juanin Clay","idIMDB":"nm0165536"},"actorId":"nm0165536","character":"Pat Healy","urlCharacter":"http://www.imdb.com/character/ch0226613","main":true},{"actorName":"Kent Williams","urlProfile":"http://www.imdb.com/name/nm5911607","urlPhoto":"","biography":{"dateOfBirth":"27 December 1950","placeOfBirth":" Harlem, New York City, New York, USA","bio":"Born in Manhattan, son of big band leader Glenn Williams and Marilyn Williams, a former June Taylor dancer. Studied music and theatre at SUNY Oswego where he graduated in 1973 along with classmate Christine Estabrook (\"Desperate Housewives\"). Studied acting at the American Conservatory Theatre in San Francisco in the mid-1970s where his classmates included Anna Deavere Smith and screenwriter Ken Hixon.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm5911607","name":"Kent Williams","idIMDB":"nm5911607"},"actorId":"nm5911607","character":"Cabot","urlCharacter":"http://www.imdb.com/character/ch0137579","main":true},{"actorName":"Dennis Lipscomb","urlProfile":"http://www.imdb.com/name/nm0513731","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDMwNjQ3MF5BMl5BanBnXkFtZTcwMDgwNDYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 March 1942","placeOfBirth":" Westbury, New York, USA","height":"6' 1\" (1.85 m)","bio":"Leading and supporting actor Dennis Lipscomb has been appearing in films since the early eighties. Trained as a Shakespearian stage actor, Lipscomb first starring role was the lead in Union City (1980), a film about the 1930s with mobsters and Nazi criminals. After co-starring in Love Child (1982), he took other lead roles in the ghost story Eyes of Fire (1983) and the thriller, Retribution (1988) in 1988. But Lipscomb's more significant roles have included him in supporting parts in major motion pictures including WarGames (1983), A Soldier's Story (1984), Crossroads (1986), The First Power (1990), and Steven Seagal's action hit film Piège en haute mer (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDMwNjQ3MF5BMl5BanBnXkFtZTcwMDgwNDYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0513731","name":"Dennis Lipscomb","idIMDB":"nm0513731"},"actorId":"nm0513731","character":"Watson","urlCharacter":"http://www.imdb.com/character/ch0137580","main":true},{"actorName":"Joe Dorsey","urlProfile":"http://www.imdb.com/name/nm0234154","urlPhoto":"","biography":{"dateOfBirth":"1925","placeOfBirth":"","bio":"Well-known and supported actor Joe Dorsey started acting in the early 70s, with The Longest Yard (1974). Though his acting career had just started, he got a great role which would also be his most remembered role as the greedy \"Parks Supervisor Kittridge\" in the 1976 box office hit Grizzly (1976). Dorsey got a great amount of profits with his second film. He then went on to supporting roles throughout the seventies in films like The Lincoln Conspiracy (1977), Wise Blood (1979) and The Prize Fighter (1979). His next remembered role was as \"Coach Spinks\" in The Great Santini (1979) and, by 1980, Dorsey was just getting better in Hopscotch (1980) and WarGames (1983). Dorsey occasionally took breaks from acting for golfing, going on a vacation and visiting family, until he was offered a role as a scientist in the science fiction box office smash with Christopher Walken and Natalie Wood in Brainstorm (1983). Dorsey was shocked when his new best friend (Wood) died during filming. Brainstorm (1983) and Grizzly (1976) were both Dorsey's greatest so far. He later did other films like Real Genius (1985), Club Paradise (1986), Stewardess School (1986), and the epic war drama Bat*21 (1988). As the 90s rolled, Dorsey was in Pet Sematary II (1992) and appeared uncredited in To Wong Foo Thanks for Everything, Julie Newmar (1995). He then worked with his relative Alexander Dorsey in Killing Midnight (1997) as \"Anthony Cambers\". Dorsey also has other relatives in films like actress Sandra Dorsey and his other relatives owned a music industry in the 50s. Dorsey also does Broadway plays.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0234154","name":"Joe Dorsey","nicknames":["Joey"],"idIMDB":"nm0234154"},"actorId":"nm0234154","character":"Conley","urlCharacter":"http://www.imdb.com/character/ch0137581","main":true},{"actorName":"Irving Metzman","urlProfile":"http://www.imdb.com/name/nm0582778","urlPhoto":"","biography":{"birthName":"Douglas Kahn","bio":"Irving Metzman was born as Douglas Kahn. He is an actor, known for The Purple Rose of Cairo (1985), WarGames (1983) and Crocodile Dundee (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0582778","name":"Irving Metzman","idIMDB":"nm0582778"},"actorId":"nm0582778","character":"Richter","urlCharacter":"http://www.imdb.com/character/ch0137583","main":true},{"actorName":"Michael Ensign","urlProfile":"http://www.imdb.com/name/nm0258117","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzOTg5ODU1OV5BMl5BanBnXkFtZTcwMzUwNDE1OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1944","placeOfBirth":" Safford, Arizona, USA","height":"6' 1\" (1.85 m)","bio":"Born in Arizona, he is of British/American descent;living extensively in both the USA and the UK. He trained as an actor at The London Academy of Music and Dramatic Art. He spent the first eleven years of his professional career in the theatre in Britain. He was a member of the Royal Shakespeare Company from 1972 to 1975. He played the leading man (Donald) in the musical, 'Irene', at London's Adelphi Theatre in 1978. He appeared in the London productions of The Curse Of The Starving Class (Royal Court Theatre), The Red Devil Battery Sign (Phoenix Theatre) and numerous English Repertory Theatres. His film and television work has been primarily in the USA. In 2009 he was awarded the Distinguished Alumnus Award by the College of Fine Arts, University of Utah, Salt Lake City, Utah. Michael Ensign is a member of the Academy of Motion Picture Arts and Sciences.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzOTg5ODU1OV5BMl5BanBnXkFtZTcwMzUwNDE1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0258117","name":"Michael Ensign","idIMDB":"nm0258117"},"actorId":"nm0258117","character":"Beringer's Aide","urlCharacter":"http://www.imdb.com/character/ch0226615","main":true},{"actorName":"William Bogert","urlProfile":"http://www.imdb.com/name/nm0091722","urlPhoto":"","biography":{"dateOfBirth":"25 January 1936","placeOfBirth":" New York City, New York, USA","bio":"William Bogert was born on January 25, 1936 in New York City, New York, USA. He is an actor, known for Dog Day Afternoon (1975), WarGames (1983) and A Perfect Murder (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0091722","name":"William Bogert","idIMDB":"nm0091722"},"actorId":"nm0091722","character":"Mr. Lightman","urlCharacter":"http://www.imdb.com/character/ch0137585","main":true},{"actorName":"Susan Davis","urlProfile":"http://www.imdb.com/name/nm0205522","urlPhoto":"","biography":{"bio":"Susan Davis is an actress, known for WarGames (1983), Crime + Punishment in Suburbia (2000) and Hot Wheels (1969).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0205522","name":"Susan Davis","idIMDB":"nm0205522"},"actorId":"nm0205522","character":"Mrs. Lightman","urlCharacter":"http://www.imdb.com/character/ch0137586","main":true},{"actorName":"James Tolkan","urlProfile":"http://www.imdb.com/name/nm0866055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NDcyNzQ4Nl5BMl5BanBnXkFtZTcwMjExNTgyMQ@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1931","placeOfBirth":" Calumet, Michigan, USA","birthName":"James Stewart Tolkan","height":"5' 6\" (1.68 m)","bio":"Fiery, forceful and intimidating character actor James Tolkan has carved out a nice little niche for himself in both movies and television alike as a formidable portrayer of fierce and flinty hard-boiled tough guy types. James Stewart Tolkan was born on June 20, 1931 in Calumet, Michigan. His father, Ralph M. Tolkan, was a cattle dealer. James attended the University of Iowa, Coe College and Eastern Arizona College. After serving a year-long stint in the United States Navy, Tolkan went to New York and studied acting with both Lee Strasberg and Stella Adler at the Actors Studio. Short and bald, with beady, intense eyes, a wiry, compact, muscular build, a gruff, jarring, high-decibel voice, and an aggressive, confrontational, blunt-as-a-battle-ax, rough-around-the-edges demeanor, Tolkan has been often cast as rugged, cynical no-nonsense cops, mean, domineering authority figures, and various ruthless and dangerous criminals. Tolkan first began acting in movies in the late 1960s and was highly effective in two pictures for Sidney Lumet: He was a rabidly homophobic police lieutenant in the superbly gritty Serpico (1973) and a sneaky district attorney in the equally excellent Prince of the City (1981). Best known as the obnoxiously overzealous high school principal Gerard Strickland in the Back to the Future films, Tolkan's other most memorable roles include Napolean in Woody Allen's Love and Death (1975), a ramrod army officer in WarGames (1983), mayor Robert Culp's mordant, wisecracking assistant in Turk 182! (1985), the hard-nosed Stinger in Top Gun (1986), the choleric Detective Lubric in Masters of the Universe (1987), meek mob accountant Numbers in Dick Tracy (1990), and Wesley Snipes' bullish superior in Boiling Point (1993). James has had recurring parts on the television series A Nero Wolfe Mystery (2000) (he also directed two episodes), Mary (1985), Cobra (1993), The Hat Squad (1992) and Remington Steele (1982). Among the television series James has done guest spots on are Naked City (1958), Hill Street Blues (1981), Miami Vice (1984), The Fresh Prince of Bel-Air (1990), The Equalizer (1985), The Wonder Years (1988) and The Pretender (1996). Besides his film and television work, Tolkan has also performed on stage in productions of such plays as \"Between Two Thieves\", \"Wings\", \"One Tennis Shoe\", \"The Front Page\", \"Twelve Angry Men\", \"Full Circle\", \"The Tempest\", \"Golda\", \"The Silent Partner\" and the original 1984 Broadway production of David Mamet's \"Glengary, Glen Ross\". When he isn't acting, James Tolkan spends his spare time collecting folk art.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NDcyNzQ4Nl5BMl5BanBnXkFtZTcwMjExNTgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0866055","name":"James Tolkan","idIMDB":"nm0866055"},"actorId":"nm0866055","character":"Wigan","urlCharacter":"http://www.imdb.com/character/ch0137584","main":true},{"actorName":"David Clover","urlProfile":"http://www.imdb.com/name/nm0167254","urlPhoto":"","biography":{"dateOfBirth":"12 March 1940","placeOfBirth":" Minnesota, USA","birthName":"David Grant Clover","bio":"David Clover was born on March 12, 1940 in Minnesota, USA as David Grant Clover. He was an actor and producer, known for WarGames (1983), Zipperface (1992) and The Kentucky Fried Movie (1977). He died on July 23, 2007 in Squaw Valley, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0167254","name":"David Clover","idIMDB":"nm0167254"},"actorId":"nm0167254","character":"Stockman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0086567","urlIMDB":"http://www.imdb.com/title/tt0086567","business":{"budget":{"money":"$12,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$6,227,804","country":"USA","day":"05","month":"06","year":"1983","remarks":"843 Screens"}],"gross":[{"money":"$79,567,667","country":"USA","day":"31","month":"05","year":"2012","remarks":""},{"money":"AUD","country":"2,336,000","day":null,"month":null,"year":null,"remarks":null},{"money":"SEK","country":"7,754,864","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$710,786","country":"USA","day":"25","month":"09","year":"1983","remarks":"681 Screens"},{"money":"$822,012","country":"USA","day":"19","month":"09","year":"1983","remarks":"745 Screens"},{"money":"$964,876","country":"USA","day":"11","month":"09","year":"1983","remarks":"800 Screens"},{"money":"$1,754,088","country":"USA","day":"05","month":"09","year":"1983","remarks":"849 Screens"},{"money":"$1,256,949","country":"USA","day":"28","month":"08","year":"1983","remarks":"821 Screens"},{"money":"$1,400,185","country":"USA","day":"21","month":"08","year":"1983","remarks":"816 Screens"},{"money":"$1,753,897","country":"USA","day":"14","month":"08","year":"1983","remarks":"842 Screens"},{"money":"$1,797,728","country":"USA","day":"07","month":"08","year":"1983","remarks":"862 Screens"},{"money":"$2,097,748","country":"USA","day":"31","month":"07","year":"1983","remarks":"843 Screens"},{"money":"$2,880,014","country":"USA","day":"24","month":"07","year":"1983","remarks":"913 Screens"},{"money":"$3,105,303","country":"USA","day":"17","month":"07","year":"1983","remarks":"948 Screens"},{"money":"$3,329,329","country":"USA","day":"10","month":"07","year":"1983","remarks":"977 Screens"},{"money":"$4,733,597","country":"USA","day":"04","month":"07","year":"1983","remarks":"977 Screens"},{"money":"$4,140,385","country":"USA","day":"26","month":"06","year":"1983","remarks":"974 Screens"},{"money":"$5,355,801","country":"USA","day":"19","month":"06","year":"1983","remarks":"973 Screens"},{"money":"$4,824,970","country":"USA","day":"12","month":"06","year":"1983","remarks":"843 Screens"}],"admissions":[],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"09","month":"08","year":"1982","remarks":null},{"money":null,"country":null,"day":"11","month":"11","year":"1982","remarks":null}],"copyrightHolder":"© MCMLXXXIII by United Artists Corporation All rights in this Motion Picture reserved under International Conventions (on print)"},"technical":{"runtime":["1 hr 54 min (114 min)"],"soundMix":["70 mm 6-Track (70 mm prints)","Dolby (35 mm prints)"],"color":["Color (Metrocolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":null,"filmLength":["3,100 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm","70 mm (blow-up)"]},"rating":"7.1","filmingLocations":[{"location":"Snohomish High School - 1316 5th Street, Snohomish, Washington, USA"}],"rated":"PG","awards":[{"award":"Academy Awards, USA 1984","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Writing, Screenplay Written Directly for the Screen","names":[{"name":"Lawrence Lasker","id":"nm0489623","role":null},{"name":"Walter F. Parkes","id":"nm0662748","role":null}]},{"category":"Best Cinematography","names":[{"name":"William A. Fraker","id":"nm0005710","role":null}]},{"category":"Best Sound","names":[{"name":"Michael J. Kohut","id":"nm0463489","role":null},{"name":"Carlos Delarios","id":"nm0216467","role":null},{"name":"Aaron Rochin","id":"nm0734099","role":null},{"name":"Willie D. Burton","id":"nm0123770","role":null}]}]}]},{"award":"BAFTA Awards 1984","titlesAwards":[{"titleAwardOutcome":"Won BAFTA Film Award","categories":[{"category":"Best Sound","names":[{"name":"Willie D. Burton","id":"nm0123770","role":null},{"name":"Michael J. Kohut","id":"nm0463489","role":null},{"name":"William L. Manger","id":"nm0542191","role":null}]}]},{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best Production Design/Art Direction","names":[{"name":"Angelo P. Graham","id":"nm0333908","role":null}]},{"category":"Best Special Visual Effects","names":[{"name":"Michael L. Fink","id":"nm0277842","role":null},{"name":"Joe Digaetano","id":"nm0226469","role":null},{"name":"Jack Cooperman","id":"nm0178470","role":null},{"name":"Don Hansard","id":"nm0360597","role":null},{"name":"Colin Cantwell","id":"nm0134764","role":null},{"name":"William A. Fraker","id":"nm0005710","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1984","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Director","names":[{"name":"John Badham","id":"nm0000824","role":null}]}]},{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Science Fiction Film","names":[]},{"category":"Best Actor","names":[{"name":"Matthew Broderick","id":"nm0000111","role":null}]},{"category":"Best Actress","names":[{"name":"Ally Sheedy","id":"nm0000639","role":null}]},{"category":"Best Supporting Actor","names":[{"name":"John Wood","id":"nm0939795","role":null}]},{"category":"Best Writing","names":[{"name":"Lawrence Lasker","id":"nm0489623","role":null},{"name":"Walter F. Parkes","id":"nm0662748","role":null}]}]}]},{"award":"American Cinema Editors, USA 1984","titlesAwards":[{"titleAwardOutcome":"Won Eddie","categories":[{"category":"Best Edited Feature Film","names":[{"name":"Tom Rolf","id":"nm0738196","role":null}]}]}]},{"award":"Hugo Awards 1984","titlesAwards":[{"titleAwardOutcome":"Nominated Hugo","categories":[{"category":"Best Dramatic Presentation","names":[{"name":"John Badham","id":"nm0000824","role":"director"},{"name":"Lawrence Lasker","id":"nm0489623","role":"written by"},{"name":"Walter F. Parkes","id":"nm0662748","role":"written by"}]}]}]},{"award":"Satellite Awards 2008","titlesAwards":[{"titleAwardOutcome":"Won Satellite Award","categories":[{"category":"Best Youth DVD","names":[]}]}]},{"award":"Writers Guild of America, USA 1984","titlesAwards":[{"titleAwardOutcome":"Nominated WGA Award (Screen)","categories":[{"category":"Best Drama Written Directly for the Screen","names":[{"name":"Lawrence Lasker","id":"nm0489623","role":null},{"name":"Walter F. Parkes","id":"nm0662748","role":null}]}]}]},{"award":"Young Artist Awards 1984","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Family Feature Motion Picture","names":[]},{"category":"Best Young Motion Picture Actress in a Feature Film","names":[{"name":"Ally Sheedy","id":"nm0000639","role":null}]}]}]}],"votes":"74,699","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026841","name":"United Artists"},{"idCompany":"co0007078","name":"Sherwood Productions"}],"keywords":{"keywords":["game","computer","norad","teenager","high school","thermonuclear war","super computer","military","school","1980s","modem","phreaking","hacker","payphone","video arcade","failing in school","biology","biology course","intelligence","boyfriend girlfriend relationship","computer genius","seattle washington","telephone number","tic tac toe","artificial intelligence","cold war","war game","acoustic coupler","u.s. army","ghost in the machine","kissing","teen movie","7 eleven","social engineering","mixed caps in title","overconfidence","naivety","immaturity","hacking","cheating","technology gone amok","reference to wonder woman","computer hacker","fictional war","break in","backdoor","armageddon","social commentary","nuclear threat","government","abuse of power","anti war","human versus computer","faked death","chess","blockbuster","teacher","helicopter","floppy drive","ferry boat","computer cracker","nuclear weapons","nuclear war"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:54:49"}}