{"data":{"movies":[{"title":"La comtesse aux pieds nus","originalTitle":"The Barefoot Contessa","year":"1954","releaseDate":"19540929","directors":[{"name":"Joseph L. Mankiewicz","id":"nm0000581"}],"writers":[{"name":"Joseph L. Mankiewicz","id":"nm0000581"}],"runtime":"128 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NDU3MzEzM15BMl5BanBnXkFtZTcwNTY1MTcyNA@@._V1.jpg","countries":["Italy","USA"],"languages":["English","Spanish","Italian"],"genres":["Crime","Drama","Mystery","Romance"],"plot":"At Maria Vargas' funeral, several people recall who she was and the impact she had on them. Harry Dawes was a not very successful writer/director when he and movie producer Kirk Edwards scouted her at a shabby nightclub where she worked as a flamenco dancer. He convinces her to take a chance on acting and her first film is a huge hit. PR man Oscar Muldoon remembers when Maria was in court supporting her father who was accused of murdering her mother. It was Maria's testimony that got him off and she was a bigger star than ever. Alberto Bravano, one of the richest men in South America, sets his sights on Maria and she goes off with him - as much to make Edwards angry as anything - but he treats her badly. When she meets Count Vincenzo Torlato-Favrini they fall deeply in love. They are married but theirs is not to be a happy life.","simplePlot":"At Maria Vargas' funeral, several people recall who she was and the impact she had on them. Harry Dawes was a not very successful writer/director when he and movie producer Kirk Edwards ... ","actors":[{"actorName":"Humphrey Bogart","urlProfile":"http://www.imdb.com/name/nm0000007","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTE3MDM5Ml5BMl5BanBnXkFtZTYwMzA2MTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1899","placeOfBirth":" New York City, New York, USA","birthName":"Humphrey DeForest Bogart","height":"5' 8\" (1.73 m)","bio":"Humphrey DeForest Bogart was born in New York City, New York, to Maud Humphrey, a famed magazine illustrator and suffragette, and Belmont DeForest Bogart, a moderately wealthy surgeon (who was secretly addicted to opium). Bogart was educated at Trinity School, NYC, and was sent to Phillips Academy in Andover, Massachusetts, in preparation for medical studies at Yale. He was expelled from Phillips and joined the U.S. Naval Reserve. From 1920 to 1922, he managed a stage company owned by family friend William A. Brady (the father of actress Alice Brady), performing a variety of tasks at Brady's film studio in New York. He then began regular stage performances. Alexander Woollcott described his acting in a 1922 play as inadequate. In 1930, he gained a contract with Fox, his feature film debut in a ten-minute short, Broadway's Like That (1930), co-starring Ruth Etting and Joan Blondell. Fox released him after two years. After five years of stage and minor film roles, he had his breakthrough role in The Petrified Forest (1936) from Warner Bros. He won the part over Edward G. Robinson only after the star, Leslie Howard, threatened Warner Bros. that he would quit unless Bogart was given the key role of Duke Mantee, which he had played in the Broadway production with Howard. The film was a major success and led to a long-term contract with Warner Bros. From 1936 to 1940, Bogart appeared in 28 films, usually as a gangster, twice in Westerns and even a horror film. His landmark year was 1941 (often capitalizing on parts George Raft had stupidly rejected) with roles in classics such as High Sierra (1941) and as Sam Spade in one of his most fondly remembered films, The Maltese Falcon (1941). These were followed by Casablanca (1942), The Big Sleep (1946), and Key Largo (1948). Bogart, despite his erratic education, was incredibly well-read and he favored writers and intellectuals within his small circle of friends. In 1947, he joined wife Lauren Bacall and other actors protesting the House Un-American Activities Committee witch hunts. He also formed his own production company, and the next year made The Treasure of the Sierra Madre (1948). Bogie won the best actor Academy Award for The African Queen (1951) and was nominated for Casablanca (1942) and as Captain Queeg in The Caine Mutiny (1954), a film made when he was already seriously ill. He died in his sleep at his Hollywood home following surgeries and a battle with throat cancer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyOTE3MDM5Ml5BMl5BanBnXkFtZTYwMzA2MTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000007","name":"Humphrey Bogart","nicknames":["Bogie"],"idIMDB":"nm0000007"},"actorId":"nm0000007","character":"Harry Dawes","urlCharacter":"http://www.imdb.com/character/ch0163468","main":true},{"actorName":"Ava Gardner","urlProfile":"http://www.imdb.com/name/nm0001257","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NTMwMzI2Ml5BMl5BanBnXkFtZTYwNzAyOTE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 December 1922","placeOfBirth":" Grabtown, North Carolina, USA","birthName":"Ava Lavinia Gardner","height":"5' 6\" (1.68 m)","bio":"Ava Lavina Gardner was born on December 24, 1922 in Grabtown, North Carolina, to Mary Elizabeth (née Baker) and Jonas Bailey Gardner. Born on a tobacco farm, where she got her lifelong love of earthy language and going barefoot, Ava grew up in the rural South. At age 18, her picture in the window of her brother-in- law's New York photo studio brought her to the attention of MGM, leading quickly to Hollywood and a film contract based strictly on her beauty. With zero acting experience, her first 17 film roles, 1942-1945, were one-line bits or little better. After her first starring role in B-grade Whistle Stop (1946), MGM loaned her to Universal for her first outstanding film The Killers (1946). Few of her best films were made at MGM which, keeping her under contract for 17 years, used her popularity to sell many mediocre films. Perhaps as a result, she never believed in her own acting ability, but her latent talent shone brightly when brought out by a superior director, as with John Ford in Mogambo (1953) and George Cukor in Bhowani Junction (1956). After three failed marriages, dissatisfaction with Hollywood life prompted Ava to move to Spain in 1955; most of her subsequent films were made abroad. By this time, stardom had made the country girl a cosmopolitan, but she never overcame a deep insecurity about acting and life in the spotlight. Her last quality starring film role was in The Night of the Iguana (1964), her later work being (as she said) strictly \"for the loot\". In 1968, tax trouble in Spain prompted a move to London, where she spent her last 22 years in reasonable comfort. Her film career did not bring her great fulfillment, but her looks may have made it inevitable; many fans still consider her the most beautiful actress in Hollywood history. Ava Gardner died at age 67 of bronchial pneumonia on January 25, 1990 in Westminister, London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NTMwMzI2Ml5BMl5BanBnXkFtZTYwNzAyOTE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001257","name":"Ava Gardner","nicknames":["Snowdrop","Angel","The Christmas Eve Girl"],"idIMDB":"nm0001257"},"actorId":"nm0001257","character":"Maria Vargas","urlCharacter":"http://www.imdb.com/character/ch0163469","main":true},{"actorName":"Edmond O'Brien","urlProfile":"http://www.imdb.com/name/nm0639529","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI3MjQ0OTMwMl5BMl5BanBnXkFtZTYwNDE4NDky._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1915","placeOfBirth":" New York City, New York, USA","birthName":"Redmond O'Brien","height":"5' 9\" (1.75 m)","bio":"Oscar-winner Edmond O'Brien was one of the most-respected character actors in American cinema, from his heyday of the mid-1940s through the late 1960s. Born on September 10, 1915, in the New York City borough of The Bronx, O'Brien learned the craft of performance as a magician, reportedly tutored by neighbor Harry Houdini. He took part in student theatrics in high school and majored in drama at Columbia University. He made his Broadway debut at the age of 21 in 1936 and, later that year, played \"The Gravedigger\" in the great Shakespearean actor John Gielgud's legendary production of \"Hamlet\". Four years later, he would play \"Mercutio\" to the \"Romeo\" of another legendary Shakespearean, Laurence Olivier, in Olivier's 1940 Brodway production of \"Romeo & Juliet\". O'Brien worked with another magician, Orson Welles, in the Mercury Theater's production of \"Julius Caesar\", appearing as \"Mark Antony\". He would later play \"Casca\" in Joseph L. Mankiewicz's film of the play, Julius Caesar (1953). Altough it has been stated that he made his debut as an uncredited extra in the 1938 film, Prison Break (1938), the truth is that his stage work impressed RKO boss Pandro S. Berman, who brought him to Hollywood to appear in the plum supporting part of \"Gringoire\" in The Hunchback of Notre Dame (1939), which starred Charles Laughton in the title role. After returning from his wartime service with the Army Air Force, O'Brien built up a distinguished career as a supporting actor in A-list films, and as an occasional character lead, such as in D.O.A. (1950). O'Brien won an Academy Award for Best Supporting Actor for his role in La comtesse aux pieds nus (1954) and also received a Best Supporting Actor Oscar nomination for his role as a drunken senator who ferrets out an attempted coup d'etat in Seven Days in May (1964). He also appeared as crusty old-timer \"Freddy Sykes\", who antagonizes Ben Johnson's character \"Tector Gorch\" in director Sam Peckinpah's classic Western, The Wild Bunch (1969). Increasingly, O'Brien appeared on television in the 1960s and '70s, but managed a turn in his old boss Welles' unfinished film, The Other Side of the Wind. He married and divorced actresses Nancy Kelly and Olga San Juan, the latter being the mother of his three children, including actors Maria O'Brien and Brendan O'Brien. He died in May of 1985 in Inglewood, California, of Alzheimer's Disease and was interred in Holy Cross Cemetery in Culver City, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI3MjQ0OTMwMl5BMl5BanBnXkFtZTYwNDE4NDky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0639529","name":"Edmond O'Brien","nicknames":["Eddy"],"idIMDB":"nm0639529"},"actorId":"nm0639529","character":"Oscar Muldoon","urlCharacter":"http://www.imdb.com/character/ch0034922","main":true},{"actorName":"Marius Goring","urlProfile":"http://www.imdb.com/name/nm0330961","urlPhoto":"","biography":{"dateOfBirth":"23 May 1912","placeOfBirth":" Newport, Isle of Wight, England, UK","birthName":"Marius Backman Goring","height":"5' 8\" (1.73 m)","bio":"The son of Dr. Charles Buckman Goring M.D. and Kate Winifred (nee MacDonald). Marius Goring was educated at Perse School, Cambridge, England and at the Universities of Frankfurt, Munich, Vienna and Paris. He studied for the stage under Harcourt Williams at the Old Vic dramatic school, London. His first stage appearance was at Cambridge in 1925 in \"Crossings\". His first London appearance was at the Rudolph Steiner Hall, December 1927 as Harlequin. He performed at the Old Vic, Sadler's Wells and toured France and Germany. he played Macbeth, Romeo, Trip in School for Scandal amongst others. His first west end appearance was at the Shaftesbury Theatre, May 1934 in the Voysey Inheritance. He joined the army in June 1940 and became the supervisor of productions of the BBC service broadcasts. Most of his army work was done under the alias Charles Richardson. For some reason the name GORING wasn't too popular at the time. He was a founder member of British Equity in 1929. He lists his recreations as walking, riding, skating and travelling.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0330961","name":"Marius Goring","idIMDB":"nm0330961"},"actorId":"nm0330961","character":"Alberto Bravano","urlCharacter":"http://www.imdb.com/character/ch0163470","main":true},{"actorName":"Valentina Cortese","urlProfile":"http://www.imdb.com/name/nm0181305","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc5Mzk2MzYxOF5BMl5BanBnXkFtZTcwODU2MTUzOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1923","placeOfBirth":" Milan, Lombardy, Italy","bio":"Valentina Cortese was born in Milan, Lombardy, Italy, in 1923. She made her movie debut in 1940 and played many \"ingenue\" parts in Italian films of that period, before making a real sensation in L'évadé du bagne (1948) and Tempesta su Parigi (1948), playing both female leads, Fantine and Cosette (the film was a competent screen adaptation of the Victor Hugo classic \"Les misérables\"). The international success of the British-made melodrama La montagne de verre (1949) brought her some Hollywood offers: she was very sensual as a truck-driver's mistress in Jules Dassin's film noir Thieves' Highway (1949) and particularly effective in Robert Wise's thriller The House on Telegraph Hill (1951), in which she portrayed a woman pursued by a killer. She then returned to Europe and worked with many great directors, like Michelangelo Antonioni, who cast her in his Le Amiche (1955), and Federico Fellini, who gave her a supporting part in his surrealist fantasy Juliet of the Spirits (1965). She had an especially robust part in Francois Truffaut's Day for Night (1973) as a fading alcoholic movie star (she won a Best Supporting Actress Academy Award Nomination for this). She also followed a fruitful stage career, working with directors like Giorgio Strehler and Franco Zeffirelli and starring in plays like Schiller's \"Mary Stewart\" (title role) and Wedekind's \"Lulu\" (title role).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc5Mzk2MzYxOF5BMl5BanBnXkFtZTcwODU2MTUzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0181305","name":"Valentina Cortese","idIMDB":"nm0181305"},"actorId":"nm0181305","character":"Eleanora Torlato-Favrini","urlCharacter":"http://www.imdb.com/character/ch0163471","main":true},{"actorName":"Rossano Brazzi","urlProfile":"http://www.imdb.com/name/nm0106387","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNTYzNDU3N15BMl5BanBnXkFtZTcwODA1NDk0NA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1916","placeOfBirth":" Bologna, Emilia-Romagna, Italy","height":"6' (1.83 m)","bio":"Rossano Brazzi was an Italian stage and film actor. He was married to Lydia Brazzi until her death, and to Isle Fischer, his second wife, until his death. His first break into films came in 1942, when Zarah Leander's film studio was casting for a leading man to play opposite Leander in the film Le foyer perdu (1943) (At That Time, Le Foyer Perdu). He's most familiar to English-speaking audiences for his role as Emile De Becque in South Pacific (1958), playing opposite Mitzi Gaynor. He died in Rome of complications following a neural virus, on December 24, 1994.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNTYzNDU3N15BMl5BanBnXkFtZTcwODA1NDk0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0106387","name":"Rossano Brazzi","idIMDB":"nm0106387"},"actorId":"nm0106387","character":"Count Vincenzo Torlato-Favrini","urlCharacter":"http://www.imdb.com/character/ch0163472","main":true},{"actorName":"Elizabeth Sellars","urlProfile":"http://www.imdb.com/name/nm0783288","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMDgxOTgzNF5BMl5BanBnXkFtZTgwNDIyMTU3MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 May 1923","placeOfBirth":" Glasgow, Scotland, UK","bio":"Elizabeth Sellars was born on May 6, 1923 in Glasgow, Scotland. She is an actress, known for La comtesse aux pieds nus (1954), The Chalk Garden (1964) and 55 Days at Peking (1963). She was previously married to Francis Austin Henley.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMDgxOTgzNF5BMl5BanBnXkFtZTgwNDIyMTU3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0783288","name":"Elizabeth Sellars","idIMDB":"nm0783288"},"actorId":"nm0783288","character":"Jerry","urlCharacter":"http://www.imdb.com/character/ch0163473","main":true},{"actorName":"Warren Stevens","urlProfile":"http://www.imdb.com/name/nm0828838","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU3MDMyMTYyNF5BMl5BanBnXkFtZTYwMzM1NjA1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 November 1919","placeOfBirth":" Clark's Summit, Pennsylvania, USA","birthName":"Warren Albert Stevens","height":"5' 8\" (1.73 m)","bio":"Warren Stevens was born in Pennsylvania and joined the Navy at age 17. His interest in acting was piqued while he was attending Annapolis, and this resulted in 12 weeks of summer stock in Virginia. His friends, Gregory Peck and Kenneth Tobey, later arranged interviews for Stevens at the renowned Neighborhood Playhouse in New York City. Following service as a Marine Corps pilot during World War II, Stevens began concentrating on his acting career, working in radio and summer stock and joining New York's Actors Studio.. His break came via a key role in Broadway's \"Detective Story\", which in turn led to offers from Hollywood studios and a contract with 20th Century-Fox. In the half-century since his movie debut, he has acted in dozens of features and hundreds of TV episodes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU3MDMyMTYyNF5BMl5BanBnXkFtZTYwMzM1NjA1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0828838","name":"Warren Stevens","idIMDB":"nm0828838"},"actorId":"nm0828838","character":"Kirk Edwards","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Franco Interlenghi","urlProfile":"http://www.imdb.com/name/nm0409421","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MzAzMDA2MV5BMl5BanBnXkFtZTcwODU1OTc0NQ@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1931","placeOfBirth":" Rome, Lazio, Italy","bio":"Franco Interlenghi was born on October 29, 1931 in Rome, Lazio, Italy. He was an actor and writer, known for I Vitelloni (1953), Shoeshine (1946) and The Little World of Don Camillo (1952). He was married to Antonella Lualdi. He died on September 10, 2015 in Rome.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MzAzMDA2MV5BMl5BanBnXkFtZTcwODU1OTc0NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0409421","name":"Franco Interlenghi","idIMDB":"nm0409421"},"actorId":"nm0409421","character":"Pedro Vargas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mari Aldon","urlProfile":"http://www.imdb.com/name/nm0017628","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDRmZjdjODktYzdiOC00Yjg3LWI0M2UtN2U1YzI3MmI2MDA4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1925","placeOfBirth":" Taurage, Lithuania","bio":"A former ballet dancer, graceful Mari Aldon married Hollywood director Tay Garnett, who encouraged her to become an actress. She did, but did not leave a deep imprint on film history, with one exception, the role of Judy Beckett, a prisoner of the Seminoles and Gary Cooper's charming romantic interest in Distant Drums (1951)(1951). Besides this, she appeared in few feature films, and then only briefly in two major movies, Joseph L. Mankiewicz's La comtesse aux pieds nus (1954) and David Lean's 'Summer Vacation' (1955). The rest of her career was devoted to television.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDRmZjdjODktYzdiOC00Yjg3LWI0M2UtN2U1YzI3MmI2MDA4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0017628","name":"Mari Aldon","idIMDB":"nm0017628"},"actorId":"nm0017628","character":"Myrna","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alberto Rabagliati","urlProfile":"http://www.imdb.com/name/nm0176328","urlPhoto":"","biography":{"dateOfBirth":"26 June 1906","placeOfBirth":" Milan, Lombardy, Italy","bio":"Alberto Rabagliati was born on June 26, 1906 in Milan, Lombardy, Italy. He was an actor, known for La comtesse aux pieds nus (1954), Street Angel (1928) and La vita è bella (1943). He was married to Maria Antonietta Tonnini. He died on March 7, 1974 in Rome, Lazio, Italy.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0176328","name":"Alberto Rabagliati","idIMDB":"nm0176328"},"actorId":"nm0176328","character":"Proprietor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Enzo Staiola","urlProfile":"http://www.imdb.com/name/nm0821543","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMzAyMzg1Nl5BMl5BanBnXkFtZTgwMzMyNzk0MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1939","placeOfBirth":" Rome, Lazio, Italy","bio":"Enzo Staiola was born on November 15, 1939 in Rome, Lazio, Italy. He is an actor, known for Bicycle Thieves (1948), La comtesse aux pieds nus (1954) and Times Gone By (1952).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzMzAyMzg1Nl5BMl5BanBnXkFtZTgwMzMyNzk0MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0821543","name":"Enzo Staiola","idIMDB":"nm0821543"},"actorId":"nm0821543","character":"Busboy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maria Zanoli","urlProfile":"http://www.imdb.com/name/nm0953088","urlPhoto":"","biography":{"dateOfBirth":"26 October 1896","placeOfBirth":" Milan, Lombardy, Italy","bio":"Maria Zanoli was born on October 26, 1896 in Milan, Lombardy, Italy. She was an actress, known for Le Notti Bianche (1957), La comtesse aux pieds nus (1954) and Europe '51 (1952). She died on November 15, 1977 in Milan.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0953088","name":"Maria Zanoli","idIMDB":"nm0953088"},"actorId":"nm0953088","character":"Maria's Mother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Renato Chiantoni","urlProfile":"http://www.imdb.com/name/nm0156989","urlPhoto":"","biography":{"dateOfBirth":"19 April 1906","placeOfBirth":" Brescia, Brescia, Lombardy, Italy","bio":"Renato Chiantoni was born on April 19, 1906 in Brescia, Brescia, Lombardy, Italy. He was an actor, known for La comtesse aux pieds nus (1954), Mon nom est Bulldozer (1978) and The Secret of Santa Vittoria (1969). He died on December 24, 1979 in Rome, Lazio, Italy.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0156989","name":"Renato Chiantoni","idIMDB":"nm0156989"},"actorId":"nm0156989","character":"Maria's Father","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Fraser","urlProfile":"http://www.imdb.com/name/nm0292077","urlPhoto":"","biography":{"dateOfBirth":"5 June 1908","placeOfBirth":" Perth, Scotland, UK","birthName":"William Simpson Fraser","bio":"Bill Fraser was born on June 5, 1908 in Perth, Scotland as William Simpson Fraser. He was an actor, known for Bootsie and Snudge (1960), Flesh and Blood (1980) and La comtesse aux pieds nus (1954). He was married to Pamela Cundell. He died on September 5, 1987 in Bushey, Hertfordshire, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0292077","name":"Bill Fraser","idIMDB":"nm0292077"},"actorId":"nm0292077","character":"J. Montague Brown","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0046754","urlIMDB":"http://www.imdb.com/title/tt0046754","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":[{"money":"1,976","country":"France","day":"07","month":"06","year":"2016","remarks":""},{"money":"1,321","country":"France","day":"31","month":"05","year":"2016","remarks":""}],"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 8 min (128 min)","2 hr 10 min (130 min) (dvd release) (TCM print)"],"soundMix":["Mono (Perspecta Sound encoding) (Western Electric Recording)"],"color":["Color (Technicolor)"],"aspectRatio":["1.75 : 1"],"camera":null,"laboratory":["Technicolor"],"filmLength":["3,469 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.1","filmingLocations":[{"location":"Cinecittà Studios, Cinecittà, Rome, Lazio, Italy"}],"rated":"APPROVED","awards":[{"award":"Academy Awards, USA 1955","titlesAwards":[{"titleAwardOutcome":"Won Oscar","categories":[{"category":"Best Actor in a Supporting Role","names":[{"name":"Edmond O'Brien","id":"nm0639529","role":null}]}]},{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Writing, Story and Screenplay","names":[{"name":"Joseph L. Mankiewicz","id":"nm0000581","role":null}]}]}]},{"award":"Golden Globes, USA 1955","titlesAwards":[{"titleAwardOutcome":"Won Golden Globe","categories":[{"category":"Best Supporting Actor","names":[{"name":"Edmond O'Brien","id":"nm0639529","role":null}]}]}]},{"award":"New York Film Critics Circle Awards 1954","titlesAwards":[{"titleAwardOutcome":"3rd place NYFCC Award","categories":[{"category":"Best Actor","names":[{"name":"Edmond O'Brien","id":"nm0639529","role":null}]}]}]},{"award":"Writers Guild of America, USA 1955","titlesAwards":[{"titleAwardOutcome":"Nominated WGA Award (Screen)","categories":[{"category":"Best Written American Drama","names":[{"name":"Joseph L. Mankiewicz","id":"nm0000581","role":null}]}]}]}],"votes":"7,485","type":"Movie","companyCreditsSimple":[{"idCompany":"co0314546","name":"Transoceanic Film"},{"idCompany":"co0044832","name":"Figaro"}],"keywords":{"keywords":["satire","count","dancer","nightclub","millionaire","love","friend","french riviera","wedding","producer","hollywood","funeral","fairy tale","war wound","funeral in the rain","husband murders wife","death of title character","war veteran","unhappy marriage","gypsy camp","multiple narrators","first person narration","1950s","jet set life","reference to cinderella","reference to faust","reference to ernst lubitsch","femme fatale","inside joke","yacht","wedding reception","wedding night","wealth","voice over narration","two narrators","trial","trenchcoat","swimming","sweat","statue","spanish","slap","shoes","sexuality","self defense","screenwriter","screening room","screen test","rain","publicist","press agent","posing","palazzo","nightclub patron","murder","murder of mother by father","mother daughter relationship","monte carlo","lawyer","kiss","judge","italian","impotence","gypsy","friendship","flashback","flamenco music","film premiere","film fan","father daughter relationship","drinking","film director","death","dancing","cynicism","crying","courtroom","contessa","champagne","cemetery","brother sister relationship","beverly hills california","beach","barefoot","affair","actress","rome italy","filmmaking","madrid spain","death of mother"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:56:36"}}