{"data":{"movies":[{"title":"Deadhead Miles","originalTitle":"","year":"1973","releaseDate":"1973","directors":[{"name":"Vernon Zimmerman","id":"nm0956796"}],"writers":[{"name":"Terrence Malick","id":"nm0000517"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjQ2MTAzNV5BMl5BanBnXkFtZTgwODEyODk1MDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"The story of a long-distance trucker and his experiences on the road.","simplePlot":"The story of a long-distance trucker and his experiences on the road.","actors":[{"actorName":"Donna Anderson","urlProfile":"http://www.imdb.com/name/nm0026634","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNTkzMjkzNF5BMl5BanBnXkFtZTgwODM3MDU3MTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 September 1939","placeOfBirth":" Gunnison, Colorado, USA","bio":"Donna Anderson was born on September 5, 1939 in Gunnison, Colorado, USA. She is known for her work on Inherit the Wind (1960), On the Beach (1959) and Deadhead Miles (1973).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNTkzMjkzNF5BMl5BanBnXkFtZTgwODM3MDU3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0026634","name":"Donna Anderson","idIMDB":"nm0026634"},"actorId":"nm0026634","character":"Waitress","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alan Arkin","urlProfile":"http://www.imdb.com/name/nm0000273","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDk5Njc3MF5BMl5BanBnXkFtZTYwNjc5NDc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1934","placeOfBirth":" New York City, New York, USA","birthName":"Alan Wolf Arkin","height":"5' 9½\" (1.77 m)","bio":"Alan Arkin is an Academy Award-winning American actor who is also an acclaimed director, producer, author, singer and composer. He was born Alan Wolf Arkin on March 26, 1934, in Brooklyn, New York. His family were Jewish immigrants from Russia and Germany. In 1946 the Arkins moved from Brooklyn to Los Angeles, California. His father, David I. Arkin, was an artist and writer, who worked as a teacher, and lost his job for merely refusing to answer questions about his political affiliation during the 1950s Red Scare. His father challenged the politically biased dismissal and eventually prevailed, but unfortunately it was after his death. His mother, Beatrice (Wortis) Arkin, a teacher, shared his fathers views. Young Arkin was fond of music and acting, he was taking various acting classes from the age of 10. He attended Franklin High School, in Los Angeles, then Los Angeles City College from 1951 - 1953, and Bennington College in Vermont from 1953 - 1954. He sang in a college folk-band, and was involved in a drama class. He dropped out of college to form the folk music group The Tarriers, in which Arkin was the lead singer and played guitar. He co-wrote the 1956 hit \"The Banana Boat Song\" - a Jamaican calypso folk song, which became better known as Harry Belafonte's popular version, and reached #4 on the Billboard chart. At that time Arkin was a struggling young actor who played bit parts on television and on stage, and made a living as a delivery boy, repairman, pot washer and baby sitter. From 1958 - 1968 he performed and recorded with the children's folk group, The Babysitters. He has also recorded an entire album for the Elektra label titled \"Folksongs - Once Over Lightly.\" In 1957 Arkin made his first big screen appearance as a lead singer with The Tarriers in Calypso Heat Wave (1957). Then he made his Off-Broadway debut as a singer in \"Heloise\" (1958). Next year he joined the Compass Theatre in St. Louis, Missouri. There he caught the eye of stage director Bob Sills and became the original member of the \"Second City\" troupe in Chicago. In 1961 Arkin made his Broadway debut in musical \"From the Second City\", for which he wrote lyrics and sketches, then starred as David Kolowitz in the Broadway comedy \"Enter Laughing\" (1963), for which he won a Tony Award. He starred in a Broadway musical \"From the Second City production, then returned to Broadway as Harry Berlin in \"Luv\" (1964). Arkin made his directorial debut with an Off-Broadway hit called \"Eh?\" (1966), which introduced the young actor, named Dustin Hoffman. He won a Drama Desk Award for his direction of the Off-Broadway production of \"Little Murders\" (1969), and another Drama Desk Award for \"The White House Murder Case\" (1970). He also directed the original version of Neil Simon's hilarious smash, \"The Sunshine Boys\" (1972), which ran over 500 performances. Arkin earned his first Academy Award nomination as Best Actor for his feature acting debut in a comedy The Russians Are Coming! The Russians Are Coming! (1966), by director Norman Jewison, co-starring as Lt. Rozanov, a Soviet submariner who is mistaken for a spy after his boat accidentally wrecks aground in New England. Arkin demonstrated his dramatic range as the psychopathic killer Roat in suspense film Wait Until Dark (1967), opposite Audrey Hepburn. He reinvented himself as the sensitive deaf-mute in The Heart Is a Lonely Hunter (1968), for which he received his second Academy Award nomination as Best Actor in the Leading role. He followed with what remained his best known role as Captain Yossarian in Catch-22 (1970), directed by Mike Nichols and based on the eponymous anti-war novel by Joseph Heller. In it Arkin arguably gave his strongest performance, however, his career suffered because the film initially did not live up to expectations. After a few years of directorial work on television, Arkin made a comeback with an impressive portrayal of doctor Sigmund Freud in The Seven-Per-Cent Solution (1976). In the early 1980s he acted in three movies that were family affairs, written by his wife, Barbara Dana, and co-starring his son, Adam Arkin. During the 1990s he turned out several notable performances, such as a bitter former baseball player in TNT's Cooperstown (1993), and as a hilarious psychiatrist opposite John Cusack in Grosse Pointe Blank (1997). He won raves for his portrayal of a divorced father who struggles to keep his kids enrolled in the Beverly Hills school system in Slums of Beverly Hills (1998). Arkin gave a brilliant performance opposite Robin Williams in Jakob le menteur (1999), a film about the Nazi occupation of Poland. He also returned to the New York stage co-starring with his son, Tony Arkin and Elaine May in \"Power Plays\", which he also co-authored. His most recent comeback as a heroin-snorting, sex-crazed, foul-mouthed grandfather in Little Miss Sunshine (2006), earned him his third Academy Award nomination for Best Performance by an Actor in a Supporting Role, and his first Academy Award. Alan Arkin has been a modern Renaissance man. In addition to his achievements as an actor, director, and producer, he made his mark as a singer-songwriter with his popular-song compositions \"Banana Boat Song\", \"Cuddle Bug,\" \"That's Me,\" and \"Best Time of the Year.\" Arkin also authored several books, including science-fiction and some children's stories, such as \"The Clearing\", \"The Lemming Condition\" and \"Cassie Loves Beethoven\" among his other publications. He is a father of three sons, Adam, Matthew, and Tony, and a grandfather of Molly Arkin. Alan Arkin has been a strong supporter of an organic way of living and also a proponent for preservation of the environment and natural habitat. He has been avoiding the show-biz-milieu and is known as an actor who does not really care about prestigious awards, but values having a good job and being acknowledged by his peers. In Arkin's own words he wants to \"Stay home for three months. Living as quietly as humanly possible.\" Arkin was given an Indian name, Grey Wolf, by his Native American friends in New Mexico.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NDk5Njc3MF5BMl5BanBnXkFtZTYwNjc5NDc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000273","name":"Alan Arkin","nicknames":["The Tarriers"],"idIMDB":"nm0000273"},"actorId":"nm0000273","character":"Cooper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Madison Arnold","urlProfile":"http://www.imdb.com/name/nm0036544","urlPhoto":"","biography":{"dateOfBirth":"7 February 1936","placeOfBirth":" Allentown, Pennsylvania, USA","bio":"Madison Arnold was born on February 7, 1936 in Allentown, Pennsylvania, USA. He is an actor, known for Donnie Brasco (1997), Escape from Alcatraz (1979) and Extremely Loud & Incredibly Close (2011). He has been married to LiJun Wang since 1999.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0036544","name":"Madison Arnold","idIMDB":"nm0036544"},"actorId":"nm0036544","character":"Hostler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Benedict","urlProfile":"http://www.imdb.com/name/nm0070801","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NzA0NjgwMl5BMl5BanBnXkFtZTcwNDczMTkyNA@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 September 1938","placeOfBirth":" Silver City, New Mexico, USA","height":"6' 4\" (1.93 m)","bio":"Paul Benedict was born on September 17, 1938 in Silver City, New Mexico, USA. He was an actor and director, known for The Jeffersons (1975), Guiding Light (1952) and The Addams Family (1991). He died on December 1, 2008 in Martha's Vineyard, Massachusetts, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NzA0NjgwMl5BMl5BanBnXkFtZTcwNDczMTkyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0070801","name":"Paul Benedict","idIMDB":"nm0070801"},"actorId":"nm0070801","character":"Hitchhiker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bruce Bennett","urlProfile":"http://www.imdb.com/name/nm0071636","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0Njc1ODk1NF5BMl5BanBnXkFtZTcwNDk5MjYwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 May 1906","placeOfBirth":" Tacoma, Washington, USA","birthName":"Harold Herman Brix","height":"6' 3\" (1.91 m)","bio":"Herman Brix was a star shot-putter in the 1928 Olympics. After losing the lead in MGM's Tarzan the Ape Man (1932) due to a shoulder injury, he was contracted by Ashton Dearholt for his independent production of The New Adventures of Tarzan (1935), a serial and the only Tarzan film between the silents and the 1960s to present the character accurately, as a sophisticated, educated English nobleman who preferred living in the jungle and was able to speak directly with animals in their own language. He subsequently found himself typecast and confined to starring roles in other serials and character and even bit parts in poverty row features and two-reeler comedies. After starring in the Republic Pictures serial Hawk of the Wilderness (1938) as the Tarzan-like Kioga, he dropped out of films for a few years, took acting lessons, and changed his name to Bruce Bennett. He made many movies after that, gaining fame as a leading man in many Warners products. In 1960, he retired from acting and went into business, becoming sales manager of a major vending machine company, making only occasional TV guest appearances. A reclusive man, he eschewed interviews, although he did appear at one Burroughs-oriented convention in the 1970s and discussed some of his experiences during the making of his Tarzan serial. In 2001, he allowed himself to be interviewed for a slender biography by a Mike Chapman, and held signings at local bookstores, enjoying his \"rediscovery\" by the general public in the few years remaining before his death.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0Njc1ODk1NF5BMl5BanBnXkFtZTcwNDk5MjYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0071636","name":"Bruce Bennett","idIMDB":"nm0071636"},"actorId":"nm0071636","character":"Johnny Mesquitero","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick Campbell","urlProfile":"http://www.imdb.com/name/nm0132769","urlPhoto":"","biography":{"dateOfBirth":"13 July 1924","placeOfBirth":" Waukegan, Illinois, USA","bio":"Patrick Campbell was born on July 13, 1924 in Waukegan, Illinois, USA. He was an actor, known for Silent Movie (1976), Critters 2 (1988) and Smokey Bites the Dust (1981). He died on May 30, 2003 in Covina, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0132769","name":"Patrick Campbell","idIMDB":"nm0132769"},"actorId":"nm0132769","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Oliver Clark","urlProfile":"http://www.imdb.com/name/nm0164339","urlPhoto":"","biography":{"dateOfBirth":"4 January 1939","placeOfBirth":" Buffalo, New York, USA","birthName":"Richard Mardirosian","bio":"Oliver Clark was born on January 4, 1939 in Buffalo, New York, USA as Richard Mardirosian. He is an actor and writer, known for A Star Is Born (1976), Ernest Saves Christmas (1988) and Lost Souls (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0164339","name":"Oliver Clark","idIMDB":"nm0164339"},"actorId":"nm0164339","character":"Durazno","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick Dennis-Leigh","urlProfile":"http://www.imdb.com/name/nm0219578","urlPhoto":"","biography":{"bio":"Patrick Dennis-Leigh is an actor, known for Deadhead Miles (1973), Doctor Death: Seeker of Souls (1973) and No Place to Land (1958).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0219578","name":"Patrick Dennis-Leigh","idIMDB":"nm0219578"},"actorId":"nm0219578","character":"Tile Loader","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Duell","urlProfile":"http://www.imdb.com/name/nm0240239","urlPhoto":"","biography":{"dateOfBirth":"30 August 1923","placeOfBirth":" Corinth, New York, USA","birthName":"George William Duell","height":"5' 6\" (1.68 m)","bio":"William Duell was born on August 30, 1923 in Corinth, New York, USA as George William Duell. He was an actor, known for One Flew Over the Cuckoo's Nest (1975), Guiding Light (1952) and How to Lose a Guy in 10 Days (2003). He was married to Mary Barto. He died on December 22, 2011 in Manhattan, New York City, New York.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0240239","name":"William Duell","idIMDB":"nm0240239"},"actorId":"nm0240239","character":"Auto Parts Salesman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Durning","urlProfile":"http://www.imdb.com/name/nm0001164","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMDk1NTU1OV5BMl5BanBnXkFtZTYwMDA2MjM0._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 February 1923","placeOfBirth":" Highland Falls, New York, USA","birthName":"Charles Edward Durning","height":"5' 8\" (1.73 m)","bio":"WWII veteran, dance instructor and diversely talented stage & screen actor were all inclusions on the resume of this perpetually busy US actor who didn't get in front of the cameras until around the time of his fortieth birthday. The stockily built Charles Durning was one of Hollywood's most dependable and sought after supporting actors. Durning was born in Highland Falls, New York, to Louise Marie (Leonard), a laundress, and James Gerald Durning. His father was an Irish immigrant and his mother was of Irish descent. Durning first got his start in guest appearances in early 1960's TV shows. He scored minor roles over the next decade until he really got noticed by film fans as the sneering, corrupt cop \"Lt. Snyder\" hassling street grifter 'Robert Redford' in the multi award winning mega-hit The Sting (1973). Durning was equally entertaining in the Billy Wilder production of The Front Page (1974), he supported screen tough guy Charles Bronson in the suspenseful western Breakheart Pass (1975) and featured as \"Spermwhale Whalen\" in the story of unorthodox police behavior in The Choirboys (1977). The versatile Durning is equally adept at comedic roles and demonstrated his skills as \"Doc Hopper\" in The Muppet Movie (1979), a feisty football coach in North Dallas Forty (1979), a highly strung police officer berating maverick cop Burt Reynolds in Sharky's Machine (1981), and a light footed, dancing Governor (alongside Burt Reynolds once more) in The Best Little Whorehouse in Texas (1982). Durning continued a regular on screen association with Burt Reynolds appearing in several more feature films together and as \"Dr. Harlan Elldridge\" in the highly popular TV series Evening Shade (1990). On par with his multitude of feature film roles, Durning has always been in high demand on television and has guest starred in Everybody Loves Raymond (1996), Monk (2002) and Rescue Me (2004). Plus, he has appeared in the role of \"Santa Claus\" in five different television movies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMDk1NTU1OV5BMl5BanBnXkFtZTYwMDA2MjM0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001164","name":"Charles Durning","nicknames":["Charlie","King of Character Actors"],"idIMDB":"nm0001164"},"actorId":"nm0001164","character":"Truck Driver in Cafe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hector Elizondo","urlProfile":"http://www.imdb.com/name/nm0001185","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMDEzMTE4MDFeQTJeQWpwZ15BbWU3MDk3ODU3MTM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 December 1936","placeOfBirth":" New York City, New York, USA","height":"5' 10\" (1.78 m)","bio":"Hector Elizondo was born in New York City, New York, where he was raised, on the Upper West Side of Manhattan. He is the son of Carmen Medina Reyes and Martín Echevarría Elizondo. Hector is of Basque and Puerto Rican descent, and \"Elizondo\" means \"at the foot of the church\" in Basque. His lifestyle in his pre-acting days was as diverse as the roles he plays today. He was a conga player with a Latin band, a classical guitarist and singer, a weightlifting coach, a ballet dancer and a manager of a bodybuilding gym. In his teens, he played basketball and baseball and was scouted by the New York Giants and Pittsburgh Pirates farm teams. After a knee injury ended his dance career, he switched to drama. Since then, he has frequently appeared on Broadway, most notably with George C. Scott in Arthur Penn's production of \"Sly Fox\" for which he received a Drama Desk nomination and for his role as \"God\" in \"Steambath\", which won him an Obie Award. Other theatre credits include; \"The Prisoner of Second Avenue\"; \"The Great White Hope\"; \"Dance of Death\" with Robert Shaw and \"The Rose Tattoo\" opposite Cicely Tyson. Countless starring roles in television include: Foley Square (1985); American Playhouse: Medal of Honor Rag (1982); Casablanca (1983) (in which he recreated the Claude Rains role of police chief \"Capt. Renault\"); Freebie and the Bean (1974); Popi (1975) and as Sophia Loren's husband in the CBS special Courage (1986). Guest appearances include: Kojak (1973); Kojak: Ariana (1989); Columbo: A Case of Immunity (1975); Baretta (1975); All in the Family (1971); The Rockford Files (1974) and Bret Maverick (1981). In addition, he also directed a.k.a. Pablo (1984), the first show to utilise seven cameras instead of the usual four. On the big screen, he has been seen in, among others, American Gigolo (1980); The Taking of Pelham One Two Three (1974); Cuba (1979); Valdez Is Coming (1971) and in four films directed by Garry Marshall: Young Doctors in Love (1982); The Flamingo Kid (1984); Nothing in Common (1986) and Overboard (1987). Elizondo starred with Dan Aykroyd and Michelle Pfeiffer in PBS' Great Performances: Tales from the Hollywood Hills: Natica Jackson (1987) (based on a collection of John O'Hara stories) and made his debut as a stage director with a production of \"Villa!\" starring Julio Medina. In addition, he performed in the 50th anniversary production of \"War of the Worlds\" co-starring Jason Robards and the TV-movie Addicted to His Love (1988) with Barry Bostwick.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMDEzMTE4MDFeQTJeQWpwZ15BbWU3MDk3ODU3MTM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001185","name":"Hector Elizondo","idIMDB":"nm0001185"},"actorId":"nm0001185","character":"Duke","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hal England","urlProfile":"http://www.imdb.com/name/nm0257435","urlPhoto":"","biography":{"dateOfBirth":"2 October 1932","placeOfBirth":" Kings Mountain, North Carolina, USA","birthName":"Harold F. England","bio":"Leading man of the American stage who played occasional character roles in film and television. England was a native of King's Mountain, North Carolina and a graduate of the University of North Carolina, Chapel Hill. He made his Broadway debut in 1958, directed by Alfred Drake in \"Love Me Little.\" He followed this with a success in \"Say, Darling\", written and directed by Abe Burrows, whom England credited as his mentor. He understudied Robert Morse in the lead of \"How to Succeed in Business...Without Really Trying\", playing Jenkins for a year on Broadway and then taking the lead role of J. Pierpont Finch in the national touring company. He starred on Broadway in Edna St. Vincent Millay's \"Conversations at Midnight\" in 1964 and appeared in three plays in the inaugural season of the Public Theatre's Shakespeare in the Park in New York. He moved to California in the early 1960s and guest-starred in numerous television programs. A longtime member of the Actors Studio, he also spent years as a member of Theatre West, in Hollywood, performing in scores of plays there. His life partner for forty years was producer Fred W. Bennett. England died at St. Joseph's Hospital in Burbank, of a heart attack at 71.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0257435","name":"Hal England","idIMDB":"nm0257435"},"actorId":"nm0257435","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Virgil Frye","urlProfile":"http://www.imdb.com/name/nm0296901","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MzI4NDQ4MV5BMl5BanBnXkFtZTcwODI0NzU2NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 August 1930","placeOfBirth":" Estherville, Iowa, USA","birthName":"Virgil Charles Frye","bio":"Character actor Virgil Charles Frye was born on August 21, 1930 in Estherville, Iowa. A former Golden Gloves boxing champion, Frye worked in the cornfields in Iowa and was active in the civil rights movement in Alabama before he first began acting in films and TV shows in the mid-1960's. Virgil often played either tough guys or police officers. The father of both Sean Frye and Soleil Moon Frye, Frye also ran his own successful acting school in the Hollywood Hills. Virgil suffered from Pick's Disease or Frontotemporal dementia (FTD) in his latter years and was the subject of the documentary Sonny Boy (2004) made by his daughter Soleil. Frye died at a nursing home in Orange County, California on May 7, 2012.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MzI4NDQ4MV5BMl5BanBnXkFtZTcwODI0NzU2NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0296901","name":"Virgil Frye","idIMDB":"nm0296901"},"actorId":"nm0296901","character":"Trouble Maker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ray Galvin","urlProfile":"http://www.imdb.com/name/nm0303468","urlPhoto":"","biography":{"dateOfBirth":"5 June 1917","placeOfBirth":" New Jersey, USA","birthName":"Raymond Galvin","bio":"Ray Galvin was born on June 5, 1917 in New Jersey, USA as Raymond Galvin. He was an actor, known for The Price of Life (1987), Wild Riders (1971) and The Swinging Barmaids (1975). He died on February 28, 1997 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0303468","name":"Ray Galvin","idIMDB":"nm0303468"},"actorId":"nm0303468","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ted Gehring","urlProfile":"http://www.imdb.com/name/nm0311811","urlPhoto":"","biography":{"dateOfBirth":"6 April 1929","placeOfBirth":" Bisbee, Arizona, USA","birthName":"Theodore Edwin Gehring Jr.","bio":"Ted Gehring was born on April 6, 1929 in Bisbee, Arizona, USA as Theodore Edwin Gehring Jr. He was an actor, known for The Thomas Crown Affair (1968), The Parallax View (1974) and Bound for Glory (1976). He was married to Barbara Coates. He died on September 28, 2000 in Steelville, Missouri, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0311811","name":"Ted Gehring","idIMDB":"nm0311811"},"actorId":"nm0311811","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0068452","urlIMDB":"http://www.imdb.com/title/tt0068452","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"03","month":"11","year":"1970","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 33 min (93 min)"],"soundMix":["Mono"],"color":["Color (Technicolor)"],"aspectRatio":null,"camera":null,"laboratory":["Technicolor"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"5.6","filmingLocations":[{"location":"Knoxville, Tennessee, USA"}],"rated":"R","awards":[],"votes":"165","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["trucker","on the road","surrealism","cigar smoking","dog","beer drinking","female taxi driver","cigarette smoking","taxi","driving","pool table","budweiser","ghost","southern accent","captain's hat","naval","metaphoric title","non sequitur","bizarre comedy","transport","police","passenger","journey","hitchhiker","highway","friendship","eccentric","drive in theater","drag racing","cross country","blow up doll","bar","18 wheeler"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:52:03"}}