{"data":{"movies":[{"title":"The Selfish Giant","originalTitle":"","year":"1971","releaseDate":"19730812","directors":[{"name":"Peter Sander","id":"nm1131488"}],"writers":[{"name":"Peter Sander","id":"nm1131488"},{"name":"Oscar Wilde","id":"nm0928492"}],"runtime":"26 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjRkYTk3ZDEtNGU2My00NzdlLWJiNzQtODI2NWNhZjg3MDEwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNTgwNTk5MDU@._V1.jpg","countries":["Canada"],"languages":["English"],"genres":["Animation","Short"],"plot":"A giant builds a wall to keep children out of his garden, but then winter sets in permanently.","simplePlot":"A giant builds a wall to keep children out of his garden, but then winter sets in permanently.","actors":[{"actorName":"Paul Hecht","urlProfile":"http://www.imdb.com/name/nm0372971","urlPhoto":"","biography":{"dateOfBirth":"16 August 1941","placeOfBirth":" London, England, UK","bio":"Paul Hecht was born on August 16, 1941 in London, England. He is an actor, known for As the World Turns (1956), Private Parts (1997) and The Selfish Giant (1971). He is married to Ingeberg Uta. They have one child. He was previously married to Lynn Vogt.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0372971","name":"Paul Hecht","idIMDB":"nm0372971"},"actorId":"nm0372971","character":"Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Aznavour","urlProfile":"http://www.imdb.com/name/nm0002198","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc1MzExODMzMV5BMl5BanBnXkFtZTYwMjU3OTg1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 May 1924","placeOfBirth":" Paris, France","birthName":"Chahnour Varinag Aznavourian","height":"5' 3\" (1.6 m)","bio":"Beloved French chanson entertainer Charles Aznavour, who wrote more than 800 songs, recorded more than 1,000 of them in French, English, German and Spanish and sold over 100 million records in all, was born Chahnour Varinag Aznavourian on May 22, 1924, in Paris, the younger of two children born to Armenian immigrants who fled to France. His mother was a seamstress as well as an actress and his father was a baritone who sang in restaurants. Both Charles and his sister waited on tables where he performed. He delivered his first poetic recital while just a toddler. Within a few years later he had developed such a passion for singing/dancing, that he sold newspapers to earn money for lessons. He took his first theatrical bow in the play \"Emil and the Detectives\" at age 9 and within a few years was working as a movie extra. He eventually quit school and toured France and Belgium as a boy singer/dancer with a traveling theatrical troupe while living the bohemian lifestyle. A popular performer at the Paris' Club de la Chanson, it was there that he was introduced in 1941 to the songwriter Pierre Roche. Together they developed names for themselves as a singing/writing cabaret and concert duo (\"Roche and Aznamour\"). A Parisian favorite, they became developed successful tours outside of France, including Canada. In the post WWII years Charles began appearing in films again, one of them as a singing croupier in Adieu chérie (1946). Eventually Aznavour earned a sturdy reputation composing street-styled songs for other established musicians and singers, notably Édith Piaf, for whom he wrote the French version of the American hit \"Jezebel\". Heavily encouraged by her, he toured with her as both an opening act and lighting man. He lived with Piaf out of need for a time not as one of her many paramours. His mentor eventually persuaded him to perform solo (sans Roche) and he made several successful tours while scoring breakaway hits with the somber chanson songs \"Sur ma vie\" and \"Parce que\" and the notable and controversial \"Après l'amour.\" In 1950, he gave the bittersweet song \"Je Hais Les Dimanches\" [\"I Hate Sundays\"] to chanteuse Juliette Gréco, which became a huge hit for her. In the late 50s, Aznavour began to infiltrate films with more relish. Short and stubby in stature and excessively brash and brooding in nature, he was hardly leading man material but embraced his shortcomings nevertheless. Unwilling to let these faults deter him, he made a strong impressions with the comedy Une gosse 'sensass' (1957) and with Paris Music Hall (1957). He was also deeply affecting as the benevolent but despondent and ill-fated mental patient Heurtevent in Head Against the Wall (1959). A year later, Aznavour starred as piano player Charlie Kohler/Edouard Saroyan in 'Francois Truffaut''s adaptation of the David Goodis' novel Shoot the Piano Player (1960) [Shoot the Piano Player], which earned box-office kudos both in France and the United States. This sudden notoriety sparked an extensive tour abroad in the 1960s. Dubbed the \"Frank Sinatra of France\" and singing in many languages (French, English, Italian, Spanish, German, Russian, Armenian, Portuguese), his touring would include sold-out performances at Carnegie Hall (1964) and London's Albert Hall (1967). Aznavour served as actor and composer/music arranger for many films, including Gosse de Paris (1961), which he also co-wrote with director Marcel Martin, and the dramas Three Fables of Love (1962) [Three Fables of Love\") and Dear Caroline (1968) [Dear Caroline]. The actor also embraced the title role in the TV series \"Les Fables de la Fontaine\" (1964), then starred in the popular musical \"Monsieur Carnaval\" (1965), in which he performed his hit song \"La bohême.\" His continental star continued to shine and Aznavour acted in films outside of France with more dubious results. While the sexy satire Candy (1968), with an international cast that included Marlon Brando, Richard Burton and Ringo Starr, and epic adventure The Adventurers (1970) were considered huge misfires upon release, it still showed Aznavour off as a world-wide attraction. While he was also seen in the English drama _Games, The (1970), _Blockhouse, The (1973) and an umpteenth film version of Agatha Christie's Ten Little Indians (1974) [And Then There Were None/Ten Little Indians], it was his music that kept him in the international limelight. Later films included Yiddish Connection (1986), which he co-wrote and provided music, and Il maestro (1990) with Malcolm McDowell; more recently he received kudos for his participation in the Canadian-French production Ararat (2002). Films aside, hus chart-busting single \"She\" (1972-1974) went platinum in Britain. He also received thirty-seven gold albums in all. His most popular song in America, \"Yesterday When I Was Young\" has had renditions covered by everyone from Shirley Bassey to Julio Iglesias. In 1997, Aznavour received an honorary César Award. He has written three books, the memoirs \"Aznavour By Aznavour\" (1972), the song lyrics collection \"Des mots à l'affiche\" (1991) and a second memoir \"Le temps des avants\" (2003). A \"Farewell Tour\" was instigated in 2006 at age 82 and, health permitting, could last to 2010. Married at least three times (some claim five) to Micheline Rugel, Evelyne Plessis and Ulla Thorsell, he is the father of six children (daughters Katia, Patricia and Seda Aznavour, and sons Misha, Nicholas and Patrick Aznavour).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc1MzExODMzMV5BMl5BanBnXkFtZTYwMjU3OTg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002198","name":"Charles Aznavour","idIMDB":"nm0002198"},"actorId":"nm0002198","character":"Récitant / Narrator","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0067731","urlIMDB":"http://www.imdb.com/title/tt0067731","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["26 min"],"soundMix":null,"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":["Bellevue Pathé Québec Inc., Montreal, Canada"],"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.4","filmingLocations":[],"awards":[{"award":"Academy Awards, USA 1972","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Short Subject, Animated Films","names":[{"name":"Peter Sander","id":"nm1131488","role":null},{"name":"Murray Shostak","id":"nm0795190","role":null}]}]}]},{"award":"Berlin International Film Festival 1972","titlesAwards":[{"titleAwardOutcome":"Won Silver Berlin Bear","categories":[{"category":"Short Film","names":[{"name":"Peter Sander","id":"nm1131488","role":null}]}]}]}],"votes":"224","type":"Movie","companyCreditsSimple":[{"idCompany":"co0032648","name":"Potterton Productions"},{"idCompany":"co0043149","name":"Reader's Digest"}],"keywords":{"keywords":["winter","snow","garden","christian parable","fable","based on short story","giant","redemption","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:49:27"}}