{"data":{"movies":[{"title":"Crack in the World","originalTitle":"","year":"1965","releaseDate":"19650415","directors":[{"name":"Andrew Marton","id":"nm0554249"}],"writers":[{"name":"Jon Manchip White","id":"nm0925011"},{"name":"Jon Manchip White","id":"nm0925011"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1Njk2MTEzN15BMl5BanBnXkFtZTcwNTU0MzQ2Mw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Sci-Fi"],"plot":"Dr. Stephen Sorenson plans to tap the geothermal energy of the Earth's interior by means of a thermonuclear device detonated deep within the earth. Despite dire warnings by fellow scientist Ted Rampion, Dr. Sorenson proceeds with the experiment after secretly learning that he is terminally ill. This experiment causes a crack to form and grow within the Earth's crust, which threatens to split the Earth in two if it is not stopped in time.","simplePlot":"A dying scientist pushes forward his project to tap through to the Earth's magma layer, with results that threaten to destroy the Earth as we know it.","actors":[{"actorName":"Dana Andrews","urlProfile":"http://www.imdb.com/name/nm0000763","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjQ3ODQzNjQ1MV5BMl5BanBnXkFtZTYwMjExMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1909","placeOfBirth":" Covington County, Mississippi, USA","birthName":"Carver Dana Andrews","height":"5' 10\" (1.78 m)","bio":"American leading man of the 1940s and 1950s, Dana Andrews, was born Carver Dana Andrews on a farm by Collins, Covington County, Mississippi. He was the son of Annis (Speed) and Charles Forrest Andrews, a Baptist minister. He was one of thirteen children, including actor Steve Forrest. Andrews studied business administration at Sam Houston State Teachers College in Texas, but took a bookkeeping job with Gulf Oil in 1929 prior to graduating. In 1931, he hitchhiked to California, hoping to get work as an actor. He drove a school bus, dug ditches, picked oranges, worked as a stock boy, and pumped gas while trying without luck to break into the movies. His employer at a Van Nuys gas station believed in him and agreed to invest in him, asking to be repaid if and when Andrews made it as an actor. Andrews studied opera and also entered the Pasadena Community Playhouse, the famed theatre company and drama school. He appeared in scores of plays there in the 1930s, becoming a favorite of the company. He played opposite future star Robert Preston in a play about composers Gilbert and Sullivan, and soon thereafter was offered a contract by Samuel Goldwyn. It was two years before Goldwyn and 20th Century-Fox (to whom Goldwyn had sold half of Andrews' contract) put him in a film, but the roles, though secondary, were mostly in top-quality pictures such as The Westerner (1940) and The Ox-Bow Incident (1943). A starring role in the hit Laura (1944), followed by one in The Best Years of Our Lives (1946), made him a star, but no later film quite lived up to the quality of these. During his career, he had worked with with such directors as Otto Preminger, Fritz Lang, William Wyler, William A. Wellman, Jean Renoir, and Elia Kazan. Andrews slipped into a steady stream of unremarkable films in which he gave sturdy performances, until age and other interests resulted in fewer appearances. In addition, his increasing alcoholism caused him to lose the confidence of some producers. Andrews took steps to curb his addiction and in his later years was an outspoken member of the National Council on Alcoholism, who decried public refusal to face the problem. He was probably the first actor to do a public service announcement about alcoholism (in 1972 for the U.S. Department of Transportation), and did public speaking tours. Andrews was one of the first to speak out against the degradation of the acting profession, particularly actresses doing nude scenes just to get a role. Andrews was elected president of the Screen Actors Guild in 1963, serving until 1965. He retired from films in the 1960s and made, he said, more money from real estate than he ever did in movies. Yet he and his second wife, actress Mary Todd, lived quietly in a modest home in Studio City, California. Andrews suffered from Alzheimer's Disease in his later years and spent his final days in a nursing facility. He died of congestive heart failure and pneumonia in 1992. A quote from Bob Greene in \"Chicago Tribune\", November 3, 1993, read, \"To me, Andrews . . . represented both the grand possibilities and the ultimate despair the movies can offer a man. He was a certified movie star, yet by the end of his life he enjoyed neither artistic acclaim granted a Fellini, nor the ease of getting a job taken for granted by a Phoenix.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjQ3ODQzNjQ1MV5BMl5BanBnXkFtZTYwMjExMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000763","name":"Dana Andrews","idIMDB":"nm0000763"},"actorId":"nm0000763","character":"Dr. Stephen Sorenson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Janette Scott","urlProfile":"http://www.imdb.com/name/nm0779285","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMmZlN2EtOTYyNS00MjdiLTkzYmQtMjMyZDlkZGExNGQyXkEyXkFqcGdeQXVyMjU4NzU2OTA@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1938","placeOfBirth":" Morecambe, Lancashire, England, UK","birthName":"Thora Janette Scott","bio":"Janette Scott was born on December 14, 1938 in Morecambe, Lancashire, England as Thora Janette Scott. She is an actress, known for The Day of the Triffids (1963), Paranoiac (1963) and School for Scoundrels (1960). She has been married to William Rademaekers since 1981. She was previously married to Mel Tormé and Jackie Rae.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMmZlN2EtOTYyNS00MjdiLTkzYmQtMjMyZDlkZGExNGQyXkEyXkFqcGdeQXVyMjU4NzU2OTA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0779285","name":"Janette Scott","idIMDB":"nm0779285"},"actorId":"nm0779285","character":"Dr. Maggie Sorenson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kieron Moore","urlProfile":"http://www.imdb.com/name/nm0601476","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTdlYmNiYWEtMmEwMC00MTY1LTk1MGMtZGZlZDI2ZmYyYzVkXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1924","placeOfBirth":" Skibbereen, County Cork, Ireland","birthName":"Kieron O'Hanrahan","height":"6' 1½\" (1.87 m)","bio":"With dark good looks and a brawny build, Irish actor Kieron Moore made a name for himself in post-war British films as both heroes and villains. Interestingly, he is better remembered for one of his more earnest failures, that of Count Vronsky opposite Vivien Leigh's Anna Karenina (1948). Born Kieron O'Hanrahan, he grew up in a hearty, Irish-speaking-only household. His father, Peter, was an Irish Nationalist writer, poet, editor and political activist who was imprisoned more than once by the British for his activities. Encouraged by their parents to pursue their artistic leanings, Kieron's sister Nease became an actress, brother Fachtna became a music director, and sister Blaithin played harp for the National Symphony Orchestra. Kieron himself was educated in Dublin and started to study medicine at University College. He abandoned his medical studies, however, after an Abbey Theatre rep saw him in a local play and accepted his application for membership. In 1943 the handsome Kieron moved to England and subsequently made his London stage debut as Heathcliff in a production of Wuthering Heights. He went on to gain more notice in such plays as Purple Dust by 'Sean O'Casey' and Everyman. He made an impressive film debut as an Irish Republican Army killer in The Voice Within (1946). The heroine in the film, murdered by Kieron's character, was played by actress Barbara White. Despite their fatal on-camera relationship, they formed a much more positive one away from the lens and married in 1947. Barbara retired shortly thereafter and they had three sons (Casey, Colm, Sean) and one daughter (Theresa). Kieron was a talented, durable player but seemed to lack the charisma or drive for top stardom despite his early promise. An impressed Alexander Korda signed him up with his London Films following a heralded performance in the West End version of Sean O'Casey 's play Red Roses for Me in 1946. The marquee name of Kieron Moore was bestowed upon him at this time. While he excelled in his next unsympathetic role, the psychological drama Mine Own Executioner (1947) in which he plays a schizophrenic POW treated by doctor Burgess Meredith (with real-wife Barbara playing his wife in one of her last film roles), Kieron failed to capitalize on the one role that could have made him a star. As the urbane count in Anna Karenina (1948), he was deemed miscast by many of his reviews. Kieron took a bite of the Hollywood apple when cast as Uriah the Hittite in the plush but stilted biblical epic David and Bathsheba (1951) opposite Gregory Peck and 'Susan Hayward' , and as a dashing Foreign Legion corporal in Ten Tall Men (1951), starring Burt Lancaster. Not much happened as a result and he returned to England. There he continued to offer fine and varied performances, notably in The Green Scarf (1954), in which he earned applause for his role as a deaf, blind and mute murder suspect. Another part that garnered some attention was his playing of the bully Pony Sugrue in the Disney classic Darby O'Gill and the Little People (1959). This was topped by the strong kudos he received in the top-drawer Jack Hawkins comedy starrer The League of Gentlemen (1960) as a gay former officer recruited by Hawkins to pull off a major bank heist. At the same time, he turned hero once again as a man forced to battle flesh-eating plants in the classic sci-fi thriller The Day of the Triffids (1963) co-starring Janette Scott. At this juncture Kieron's status started to regress with more and more routine films handed him, including Doctor Blood's Coffin (1961), I Thank a Fool (1962) and The Thin Red Line (1964). He played second fiddle to special effects in Crack in the World (1965) and to Gregory Peck (again) in Arabesque (1966). He took as his final film the underwhelming Custer of the West (1967) in which he was oddly cast as an Indian chief. Throughout the 1950s and 1960s he customarily performed on TV, including a short-lived series. After retiring from feature film work altogether in 1974, his life took a religious and socially-active turn. He joined the Catholic Agency for Overseas Development, for whom he worked for nine years, directing and narrating two film documentaries in the course of that time. The films dealt specifically with the struggle for survival in Third World countries. He also traveled extensively in the Middle East and India and provided voice-overs for other documentary features as well. Retiring quietly to France in 1994, Kieron was survived by his wife, Barbara, and children at the time of his death on July 15, 2007 at age 82.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTdlYmNiYWEtMmEwMC00MTY1LTk1MGMtZGZlZDI2ZmYyYzVkXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0601476","name":"Kieron Moore","idIMDB":"nm0601476"},"actorId":"nm0601476","character":"Dr. Ted Rampion","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexander Knox","urlProfile":"http://www.imdb.com/name/nm0461594","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0Mjg3MDEwMV5BMl5BanBnXkFtZTcwNjkwODExOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 January 1907","placeOfBirth":" Strathroy, Ontario, Canada","bio":"A Presbyterian minister's son, softly-spoken, intellectual-looking Alexander Knox received his education from the University of Western Ontario, where he studied English literature. An excellent elocutionist, member of the university's Hesperian Club, he had his first fling with dramatic acting playing the lead in \"Hamlet\". His professional theatrical debut began on the Boston stage in 1929, while simultaneously earning an income as a journalist for the Boston Post. After only a year, he went looking for better acting opportunities in England, specializing in 'serious', classical parts which required just the right measure of 'gravitas'. During another journalistic stint with the London Advertiser, he made the acquaintance of noted stage director and producer Tyrone Guthrie, who helped him to make a name for himself on the London stage at the Old Vic. As the decade progressed, Knox appeared opposite such theatrical icons as Ralph Richardson and Laurence Olivier (in \"The King of Nowhere\"), and in plays by James Bridie and George Bernard Shaw. Movie work followed in 1938, with appearances in The Phantom Strikes (1938) and a bit part in The Four Feathers (1939), but the outbreak of World War II prompted his return to America. In 1940, Knox got his big break on Broadway, playing the part of Friar Laurence in \"Romeo and Juliet\", written and staged by Olivier and starring Vivien Leigh as Juliet. A later leading role in \"The Three Sisters\" (1942-43), a turn-of-the-century drama set in Russia, saw him as Baron Tuzenbach opposite Katharine Cornell and Judith Anderson. With good critical notices, it became only a matter of time before the screen beckoned again. In 1941, Knox made his Hollywood film bow and was perfectly cast as the quiet intellectual Humphrey Van Weyden, protagonist of Jack London's maritime classic The Sea Wolf (1941). His performance was somewhat overshadowed by those of his co-stars, Edward G. Robinson (in the titular role of Wolf Larsen) and the dynamic John Garfield (as chief mutineer George Leech), but it led to further work as a reliable lead character player. For most of his career, Knox tended to be typecast as men of integrity (though he did play the odd villain): stern authority figures, psychiatrists, academics and politicians - undoubtedly, due to his sincere, though rather sombre on-screen personality. It was also the consequence of being cast in the starring role as Woodrow Wilson, the 28th U.S. President, in Darryl F. Zanuck's over-ambitious biopic Wilson (1944). Bosley Crowther commented for The New York Times (August 2, 1944): \"Much of the film's quality is due to the performance of Alexander Knox in the title role. Mr. Knox....draws a character that is full of inner strength - honest, forceful and intelligent, yet marked by a fine reserve... The casting of Mr. Knox, a comparative unknown, in this role was truly inspired\". Despite the excellent personal notices, 'Wilson' was a rather slow and ponderous affair, a flop at the box office and one of Zanuck's most conspicuous failures. His personal reputation intact, Knox had several leading roles come his way in the wake of 'Wilson', even a rare comedy part in The Judge Steps Out (1947), as a starchy, but like-able Boston judge. However, in 1952, his career suffered a serious setback when he was blacklisted by HUAC for supposed left-wing affinities, and forced to leave for England. From 1954, Alexander Knox appeared in scores of British films and was particularly good in two productions for the director Joseph Losey (who had also been black-listed in Hollywood): These Are the Damned (1962) and Accident (1967). He also played another U.S. president in the James Bond thriller You Only Live Twice (1967) and was a memorable spook (the ill-fated 'Control')in Tinker Tailor Soldier Spy (1979) on television. He made a successful return to the London stage, frequently in plays by Henrik Ibsen and Clifford Odets. Outside his principal occupation, he was finally able to devote himself whole-heartedly to his long-standing literary ambition, as author of plays (\"Old Master\", \"Trafalgar Square\"), screenplays and five adventure novels set in the wilds of 19th century Canada. Knox died in his adopted home in Benwick-Upon-Tweed, England, in 1995 at the age of 88.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0Mjg3MDEwMV5BMl5BanBnXkFtZTcwNjkwODExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0461594","name":"Alexander Knox","idIMDB":"nm0461594"},"actorId":"nm0461594","character":"Sir Charles Eggerston","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Damon","urlProfile":"http://www.imdb.com/name/nm0198944","urlPhoto":"","biography":{"bio":"Peter Damon is an actor, known for The Fall of the Roman Empire (1964), Crack in the World (1965) and Tout est possible à Grenade (1954).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0198944","name":"Peter Damon","idIMDB":"nm0198944"},"actorId":"nm0198944","character":"John Masefield","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Gillen","urlProfile":"http://www.imdb.com/name/nm0318833","urlPhoto":"","biography":{"bio":"Jim Gillen is an actor, known for Crack in the World (1965), The Thin Red Line (1964) and Les hors-la-loi de Casa Grande (1964).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0318833","name":"Jim Gillen","idIMDB":"nm0318833"},"actorId":"nm0318833","character":"Rand","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Lasdun","urlProfile":"http://www.imdb.com/name/nm0489490","urlPhoto":"","biography":{"bio":"Gary Lasdun is an actor, known for Crack in the World (1965), The Thin Red Line (1964) and Gunn (1967).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0489490","name":"Gary Lasdun","idIMDB":"nm0489490"},"actorId":"nm0489490","character":"Markov","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alfred Brown","urlProfile":"http://www.imdb.com/name/nm0112983","urlPhoto":"","biography":{"dateOfBirth":"1897","placeOfBirth":"","bio":"Alfred Brown was born in 1897. He was an actor, known for The 7th Voyage of Sinbad (1958), Europe '51 (1952) and Crack in the World (1965). He died on January 28, 1978 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0112983","name":"Alfred Brown","idIMDB":"nm0112983"},"actorId":"nm0112983","character":"Dr. Bill Evans","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Steen","urlProfile":"http://www.imdb.com/name/nm0824778","urlPhoto":"","biography":{"dateOfBirth":"16 February 1928","placeOfBirth":" Monroe, Louisiana, USA","birthName":"Malcolm H. Steen","bio":"Mike Steen was born on February 16, 1928 in Monroe, Louisiana, USA as Malcolm H. Steen. He was an actor, known for Sweet Bird of Youth (1962), This Property Is Condemned (1966) and Crack in the World (1965). He died on May 8, 1983 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0824778","name":"Mike Steen","idIMDB":"nm0824778"},"actorId":"nm0824778","character":"Steele","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emilio Carrere","urlProfile":"http://www.imdb.com/name/nm0140266","urlPhoto":"","biography":{"bio":"Emilio Carrere is an actor, known for Crack in the World (1965).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0140266","name":"Emilio Carrere","idIMDB":"nm0140266"},"actorId":"nm0140266","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sydna Scott","urlProfile":"http://www.imdb.com/name/nm0779826","urlPhoto":"","biography":{"dateOfBirth":"12 June 1915","placeOfBirth":" Chicago, Illinois, USA","birthName":"Sydna MacFetridge","bio":"Sydna Scott was born on June 12, 1915 in Chicago, Illinois, USA as Sydna MacFetridge. She was an actress, known for Scrooged (1988), Foreign Intrigue (1951) and 10 to Midnight (1983). She was married to Jerome Thor. She died on June 23, 1996 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0779826","name":"Sydna Scott","nicknames":["Scotty"],"idIMDB":"nm0779826"},"actorId":"nm0779826","character":"Angela","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Karlsen","urlProfile":"http://www.imdb.com/name/nm0439570","urlPhoto":"","biography":{"dateOfBirth":"20 October 1919","placeOfBirth":" Wellington, New Zealand","bio":"John Karlsen was born on October 20, 1919 in Wellington, New Zealand. He is an actor, known for Bill & Ted's Excellent Adventure (1989), The Black Stallion (1979) and The Order (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0439570","name":"John Karlsen","idIMDB":"nm0439570"},"actorId":"nm0439570","character":"Dr. Reynolds","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Todd Martin","urlProfile":"http://www.imdb.com/name/nm0551716","urlPhoto":"","biography":{"dateOfBirth":"11 February 1927","placeOfBirth":" Brooklyn, New York, USA","bio":"Todd Martin was born on February 11, 1927 in Brooklyn, New York, USA. He is an actor, known for Bad Company (1972), Magnet of Doom (1963) and Le chemin de l'or (1965).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0551716","name":"Todd Martin","idIMDB":"nm0551716"},"actorId":"nm0551716","character":"Simpson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ben Tatar","urlProfile":"http://www.imdb.com/name/nm0851063","urlPhoto":"","biography":{"dateOfBirth":"23 January 1930","placeOfBirth":" Pittsburgh, Pennsylvania, USA","bio":"Ben Tatar was born on January 23, 1930 in Pittsburgh, Pennsylvania, USA. He was an actor, known for Battle of the Bulge (1965), The Wind and the Lion (1975) and ...And Then I Helped (2010). He died on November 29, 2012 in Shadyside, Pennsylvania.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0851063","name":"Ben Tatar","idIMDB":"nm0851063"},"actorId":"nm0851063","character":"Indian Ambassador","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0059065","urlIMDB":"http://www.imdb.com/title/tt0059065","business":{"budget":{"money":"$873,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Paramount Pictures Corporation and Security Pictures Inc. (1964)"},"technical":{"runtime":["1 hr 36 min (96 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.1","filmingLocations":[{"location":"C.E.A. Studios, Madrid, Spain"}],"rated":"NOT RATED","awards":[],"votes":"1,548","type":"Movie","companyCreditsSimple":[{"idCompany":"co0020850","name":"Security Pictures"}],"keywords":{"keywords":["scientist","magma","love triangle","bridge collapse","underwater volcano eruption","train wreck","volcanic island","geologist","moon","screaming woman","steel door","reel to reel tape recorder","underground installation","evacuation","train disaster","hut","melting boot","shaft","high temperature","protective body suit","hydrogen","film footage","stampede","geological fault","lift","explosion","natural disaster","railroad bridge","train","subterranean","nuclear bomb","bomb","terminal illness","disaster film","helicopter","husband wife relationship","missile","nuclear missile","reference to louis pasteur","marianas trench","earthquake","disaster","volcano","nuclear","end of the world"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 03:17:06"}}