{"data":{"movies":[{"title":"Lies","originalTitle":"","year":"1985","releaseDate":"19850810","directors":[{"name":"Jim Wheat","id":"nm0923646"},{"name":"Ken Wheat","id":"nm0003117"}],"writers":[{"name":"Jim Wheat","id":"nm0923646"},{"name":"Ken Wheat","id":"nm0003117"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NjkyNjQ5Ml5BMl5BanBnXkFtZTcwODc0NTAzMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Thriller"],"plot":"Struggling actress accepts high paying job to play a rich heiress committed in a lunatic asylum, not knowing she's really being set up as a surrogate for the real girl who'd been murdered.","simplePlot":"Struggling actress accepts high paying job to play a rich heiress committed in a lunatic asylum, not knowing she's really being set up as a surrogate for the real girl who'd been murdered.","actors":[{"actorName":"Ann Dusenberry","urlProfile":"http://www.imdb.com/name/nm0244619","urlPhoto":"","biography":{"dateOfBirth":"13 September 1953","placeOfBirth":" Tucson, Arizona, USA","bio":"Ann Dusenberry was born on September 13, 1953 in Tucson, Arizona, USA. She is an actress, known for Jaws 2 (1978), Cutter's Way (1981) and Basic Training (1985). She is married to Brad Fiedel.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0244619","name":"Ann Dusenberry","idIMDB":"nm0244619"},"actorId":"nm0244619","character":"Robyn Wallace","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gail Strickland","urlProfile":"http://www.imdb.com/name/nm0834373","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNDQ5ODU3MV5BMl5BanBnXkFtZTcwOTcwODkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1947","placeOfBirth":" Birmingham, Alabama, USA","bio":"Gail Strickland attended acting courses at the University of Florida, then studied with Sanford Meisner. She made her debut on television in the series 'As the World Turns' and she landed her first theatrical role (as the schoolteacher who has all the answers) in Donald Driver's 'Status Quo Vadis' (1971-1972). Going out to California, she appeared as guest star in the series \"Barnaby Jones\", 'Hawaii Five-O', 'Police Story' and in other productions, before signing as Maureen Stapleton's partner in the television picture, 'The Gathering', and playing opposite Beau Bridges in 'The President's Mistress' Her first theatrical movie was 'The Drowning Pool', starring Paul Newman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNDQ5ODU3MV5BMl5BanBnXkFtZTcwOTcwODkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0834373","name":"Gail Strickland","idIMDB":"nm0834373"},"actorId":"nm0834373","character":"Jessica Brenner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bruce Davison","urlProfile":"http://www.imdb.com/name/nm0001117","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmExMzM3ZmMtYjRmYi00YmRlLTliOGMtYTk2ODcxMjkxMTBmL2ltYWdlXkEyXkFqcGdeQXVyMTQyNjk5Mzc@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1946","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"6' 1\" (1.85 m)","bio":"With his blond, clean-cut, Ivy League handsomeness and ready-whipped smile reminiscent of Kennedyesque times, actor Bruce Davison fits the prototype of today's more current crop of fresh-faced, likable blonds such as Brian Kerwin and Aaron Eckhart. While it proved difficult at times for the actor to get past those perfect features and find meatier roles, his talent certainly overcame the \"handicap\". Extremely winning and versatile, the award-worthy actor, now enjoying an over four decade career, has included everything from Shakespeare to Seinfeld. He has also served as a writer, producer and director on an infrequent basis. Born on June 28, 1946, in Philadelphia, Pennsylvanis, the son of Clair, an architect and musician, and Marian (Holman) Davison, a secretary, Bruce's parents divorced when he was just three. He developed a burgeoning interest in acting while majoring in art at Penn State and after accompanying a friend to a college theater audition. Making his professional stage debut in 1966 as Jonathan in \"Oh Dad, Poor Dad, Mama's Hung You in the Closet and I'm Feelin' So Bad\" at the Pennsylvania Festival Theatre, he had made it to Broadway within just a couple of years (1968) in the role of Troilus in \"Tiger at the Gates\" at the Vivian Beaumont Theatre. The year after that he was seen off-Broadway in \"A Home Away from Home\" and appeared at the Lincoln Center in the cast of \"King Lear\". Success in the movies came immediately for the perennially youthful-looking actor after he and a trio of up-and-coming talents (Barbara Hershey [then known as Barbara Seagull], Richard Thomas and Catherine Burns) starred together in the poignant but disturbing coming-of-age film Last Summer (1969). From this he was awarded a starring role opposite Kim Darby in The Strawberry Statement (1970), an offbeat social commentary about 60s college radicalism, and in the cult horror flick Willard (1971) in which he bonded notoriously with a herd of rats. Moving further into the 70s decade, his film load did not increase significantly as expected and the ones he did appear in were no great shakes. With the exception of his co-starring role alongside Burt Lancaster in the well-made cavalry item Ulzana's Raid (1972) and the powerful low-budget Short Eyes (1977) in which he played a child molester, Bruce was surprisingly ill-used or underused. Insignificant as the elder Patrick Dennis in the inferior Lucille Ball musical film version of Mame (1974), he was just as overlooked in such movies as The Jerusalem File (1972), Mother, Jugs & Speed (1976), Grand Jury (1976) and Brass Target (1978). Bruce wisely looked elsewhere for rewarding work and found it on the stage and on the smaller screen. Earning strong theatrical roles in \"The Skin of Our Teeth,\" \"The Little Foxes\" and \"A Life in the Theatre,\" he won the Los Angeles Drama Critics Award for his work in \"Streamers\" in 1977. On TV, he scored in mini-movie productions of Mourning Becomes Electra (1978), Deadman's Curve (1978) (portraying Dean Torrence of the surf-era pop duo Jan and Dean) and, most of all, Summer of My German Soldier (1978) co-starring Kristy McNichol as a German prisoner of war in the American South who falls for a lonely Jewish-American girl. In 1972 Bruce married actress Jess Walton who appeared briefly as a college student in The Strawberry Statement (1970) and later became a daytime soap opera fixture. The marriage was quickly annulled the following year. The 1980s was also dominated by strong theater performances. Bruce took over the role of the severely deformed John Merrick as \"The Elephant Man\" on Broadway; portrayed Clarence in \"Richard III\" at the New York Shakespeare Festival; was directed by Henry Fonda in \"The Caine Mutiny Court Martial\"; played a moving Tom Wingfield opposite Jessica Tandy's Amanda in \"The Glass Menagerie\"; received a second Los Angeles Drama Critics Award for his work in the AIDS play \"The Normal Heart\"; and finished off the decade gathering up fine reviews in the amusing A.R. Gurney period piece \"The Cocktail Hour\". While hardly lacking for work on film (Summer Heat (1982), Crimes of Passion (1984), Spies Like Us (1985), and The Ladies Club (1986)), few of them made use of his talents and range. It was not until he was cast in the ground-breaking gay drama Longtime Companion (1989) that his film career revitalized. Giving a quiet, finely nuanced, painfully tender performance as the middle-aged lover and caretaker of a life partner ravaged by AIDS, Bruce managed to stand out amid the strong ensemble cast and earn himself an Oscar nomination for \"Best Supporting Actor\". Although he lost out to the flashier antics of Joe Pesci in the mob drama Goodfellas (1990) that year, Bruce was not overlooked -- copping Golden Globe, Independent Spirit, New York Film Critics and National Society of Film Critics awards. Other gay-themed films also welcomed his presence, including The Cure (1995) and It's My Party (1996). The actor eventually served as a spokesperson for a host of AIDS-related organizations, including Hollywood Supports, and, elsewhere, is active with foundations that help children who are abused. Bruce has been all over the screen since his success in Longtime Companion (1989). Predominantly seen as mature, morally responsible dads and politicians, his genial good looks and likability have on occasion belied a weak or corrupt heart. Bruce married actress Lisa Pelikan in 1986 (well over a decade after his first marriage ended) and they have one son, Ethan, born in 1996. The handsome couple became well known around town and worked frequently together on stage (\"The Downside,\" \"Love Letters,\" \"Breaking the Silence,\" \"To Kill a Mockingbird\") and in TV movies (Color of Justice (1997)). Bruce's more popular films these days have included Six Degrees of Separation (1993) starring Will Smith, the family adventure film Far from Home: The Adventures of Yellow Dog (1995) and the box-office hit X-Men (2000) and its sequel in the role of Senator Kelly. More controversial art-house showcases include Dahmer (2002), as serial killer Jeffrey Dahmer's father, and Hate Crime (2005), as a bigoted, murderous pastor. Bruce has attempted TV series leads in later years. With Harry and the Hendersons (1991), he ably directed a number of the show's episodes. He has also been tapped for recurring parts on The Practice (1997) and The L Word (2004), and is fondly remembered for his comedy episodes on Seinfeld (1989) as an attorney who goes for George's (Jason Alexander) throat when George's fiancée dies inexplicably of toxic poisoning. The actor recently completed a TV series revival of Knight Rider (2008). Divorced from Lisa Pelikan, Bruce is married these days to third wife Michele Correy and has a daughter by her, Sophia, born in 2006. They live in the Los Angeles area.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmExMzM3ZmMtYjRmYi00YmRlLTliOGMtYTk2ODcxMjkxMTBmL2ltYWdlXkEyXkFqcGdeQXVyMTQyNjk5Mzc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001117","name":"Bruce Davison","idIMDB":"nm0001117"},"actorId":"nm0001117","character":"Stuart Russell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clu Gulager","urlProfile":"http://www.imdb.com/name/nm0347656","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2ODAxODAxMl5BMl5BanBnXkFtZTcwNzQ5NzcyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 November 1928","placeOfBirth":" Holdenville, Oklahoma, USA","birthName":"William Martin Gulager","height":"5' 11\" (1.8 m)","bio":"Clu Gulager was born William Martin Gulager in Holdenville, Hughes County Oklahoma. His nickname was given to him by his father for the clu-clu birds (known in English as martins, like his middle name) that were nesting at the Gulager home at the time Clu was born. He grew up on his uncle's ranch as a cowhand and when he was old enough he joined the United States Marine Corps for a stint from 1946-1948. He got the acting bug being in army plays so when he left he used the GI Bill of rights to study acting. During this time he met his wife another actress Miriam Byrd Nethery they had two children together John born in 1957 and Tom born 1965. He was married over 50 years until she passed away in 2003 from cancer. Clu's career started off as bit parts on popular western shows usually playing the heavy. Shows like Wanted Dead or Alive, Have Gun Will Travel, Laramie, Riverboat. He scored big with The Untouchables as Mad Dog Coll which led to him being offered Billy the Kid on The Tallman from 1960-1961 which also starred Barry Sullivan as Pat Garrett. The show was pulled after two seasons by congress because they didn't like the idea that kids were seeing the outlaw Billy the Kid as a hero. Clu's next big break was playing Deputy Emmett Ryker on the The Virginian from 1964-1968. During this time he also fared very well being Lee Marvin's side kick in the 1964 TV film The Killers, which was considered too violent for TV so it went to theaters. Having being burned out being a TV star he tried to break into films, mostly as a character actor. His stand out films being The Last Picture Show (1971) as Ellen Burstyn's lover and McQ (1974) with John Wayne, A Force of One (1979) with Chuck Norris, later will work with again in the 1990's on Walker, Texas Ranger. He also was part of San Francisco International Airport with Lloyd Bridges which failed big time. Throughout the 70's and 80's he was in almost every show around as bit parts. Then the unthinkable happened he found a second career as a horror film actor he followed the foot steps of other TV actors who were stuck in TV hell, like his costar from The Virginian Doug McClure and Christopher George. Both of them in late 70's and early 80's found new careers in B movie and late night horror films. Clu finally got a lead part in Dan O' Bannon's cult classic The Return of the Living Dead (1985) He also was in A Nightmare on Elm Street Part 2: Freddy's Revenge (1985) through out the 80's and 90's he would appear in TV and the occasional horror flick. In 2005 he started acting in his son's horror films the Feasts movies and Piranha DD in his 80's. Not letting age get in his way. He has been a horror fan favorite still shows up at conventions at almost 90 now. You can say one thing about Clu, what a diverse career it has been for this awesome cowboy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2ODAxODAxMl5BMl5BanBnXkFtZTcwNzQ5NzcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0347656","name":"Clu Gulager","idIMDB":"nm0347656"},"actorId":"nm0347656","character":"Doctor Bartlett","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Terence Knox","urlProfile":"http://www.imdb.com/name/nm0461679","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxOTAwMjc4Ml5BMl5BanBnXkFtZTcwMTkzNjU0MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 December 1946","placeOfBirth":" Richland, Washington, USA","birthName":"Terry Davis","height":"6' (1.83 m)","bio":"Terence Knox was born on December 16, 1946 in Richland, Washington, USA as Terry Davis. He is an actor, known for Tour of Duty (1987), St. Elsewhere (1982) and Children of the Corn II: The Final Sacrifice (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxOTAwMjc4Ml5BMl5BanBnXkFtZTcwMTkzNjU0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0461679","name":"Terence Knox","nicknames":["Terry"],"idIMDB":"nm0461679"},"actorId":"nm0461679","character":"Eric Macklin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bert Remsen","urlProfile":"http://www.imdb.com/name/nm0719037","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI1NDI0NDgyN15BMl5BanBnXkFtZTcwNTk5NzYxOA@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 February 1925","placeOfBirth":" Glen Cove, Long Island, New York, USA","birthName":"Herbert Birchell Remsen","bio":"American character actor who became a casting director following an accident, then returned to acting years later. The son of a New York policeman, Remsen lived a colorful life before turning to acting. He made his film debut in 1959 and was busy before the cameras in both film and television. Five years later, however, a collapsing crane on the set of the TV series No Time for Sergeants (1964) broke his back and nearly killed him. He recuperated for months and was able to walk again with crutches, but he believed his acting career was ended. He became a casting director, eventually heading the casting department of Lorimar Productions. While casting the film Brewster McCloud (1970), he was given a role by director Robert Altman. Though he continued to work in casting with his wife and partner Barbara Dodd, he resumed his acting career, working in scores of films and television episodes, most of the time requiring only a cane to walk. He appeared in many of Altman's films and was a popular figure in the film industry for his generosity and his vivid story-telling. He died in his sleep at age 74 in 1999.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI1NDI0NDgyN15BMl5BanBnXkFtZTcwNTk5NzYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0719037","name":"Bert Remsen","idIMDB":"nm0719037"},"actorId":"nm0719037","character":"Murrey Haliday","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stacy Keach Sr.","urlProfile":"http://www.imdb.com/name/nm0443762","urlPhoto":"","biography":{"dateOfBirth":"29 May 1914","placeOfBirth":" Chicago, Illinois, USA","birthName":"Walter Stacy Keach","height":"5' 11\" (1.8 m)","bio":"Stacy Keach Sr. was born on May 29, 1914 in Chicago, Illinois, USA as Walter Stacy Keach. He is known for his work on Pretty Woman (1990), The Parallax View (1974) and Saturday the 14th (1981). He was married to Mary Cain Peckham. He died on February 13, 2003 in Burbank, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0443762","name":"Stacy Keach Sr.","idIMDB":"nm0443762"},"actorId":"nm0443762","character":"Uncle Charles","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Douglas Leonard","urlProfile":"http://www.imdb.com/name/nm0502610","urlPhoto":"","biography":{"bio":"Douglas Leonard is an actor, known for Lies (1985) and CBS Playhouse (1967).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0502610","name":"Douglas Leonard","idIMDB":"nm0502610"},"actorId":"nm0502610","character":"Dr. Whitmyer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patience Cleveland","urlProfile":"http://www.imdb.com/name/nm0166495","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyOTcyNDU3NjNeQTJeQWpwZ15BbWU3MDk2OTI3ODQ@._V1_UY44_CR36,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 May 1931","placeOfBirth":" New York City, New York, USA","bio":"Patience Cleveland was born on May 23, 1931 in New York City, New York, USA. She was an actress, known for Donnie Darko (2001), General Hospital (1963) and Psychose III (1986). She was married to Peter Hobbs. She died on May 27, 2004 in Santa Monica, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyOTcyNDU3NjNeQTJeQWpwZ15BbWU3MDk2OTI3ODQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0166495","name":"Patience Cleveland","idIMDB":"nm0166495"},"actorId":"nm0166495","character":"Aunt Louise","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julie Philips","urlProfile":"http://www.imdb.com/name/nm0680091","urlPhoto":"","biography":{"birthName":"Julie Amanda Philips","bio":"Julie Philips was born as Julie Amanda Philips. She is an actress and producer, known for Racing with the Moon (1984), The Deliberate Stranger (1986) and The War Between the Tates (1977). She is married to John Putch.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0680091","name":"Julie Philips","idIMDB":"nm0680091"},"actorId":"nm0680091","character":"Elizabeth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ann Gibbs","urlProfile":"http://www.imdb.com/name/nm0316622","urlPhoto":"","biography":{"dateOfBirth":"26 September 1946","placeOfBirth":" Oklahoma City, Oklahoma, USA","bio":"Ann Gibbs was born on September 26, 1946 in Oklahoma City, Oklahoma, USA. She is an actress, known for Private Parts (1972), Dear Dead Delilah (1972) and Lies (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0316622","name":"Ann Gibbs","idIMDB":"nm0316622"},"actorId":"nm0316622","character":"Day Nurse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dick Miller","urlProfile":"http://www.imdb.com/name/nm0588241","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDM1OTY4NV5BMl5BanBnXkFtZTcwMDQ3NDcyNA@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1928","placeOfBirth":" The Bronx, New York, USA","birthName":"Richard Miller","height":"5' 5\" (1.65 m)","bio":"A native of the Bronx, New York, Richard \"Dick\" Miller served in the U.S. Navy for a few years and earned a prize title as a middleweight boxer. He settled in Los Angeles in the mid-1950s, where he was noticed by producer/director Roger Corman, who cast him in most of his low-budget films, usually playing unlikeable sorts, such as a vacuum-cleaner salesman in Not of This Earth (1957). His most memorable role would have to be that of the mentally unstable, busboy/beatnik artist Walter Paisley, whose clay sculptures are suspiciously lifelike in A Bucket of Blood (1959) (a rare starring role for him), and he is also fondly remembered for his supporting role as the flower-eating Vurson Fouch in Corman's legendary The Little Shop of Horrors (1960). Miller spent the next 20 years working in Corman productions, and starting in the late 1970s was often cast in films by director Joe Dante, appearing in credited and uncredited walk-on bits as quirky chatterboxes, and stole every scene he appeared in. He has played many variations on his famous Walter Paisley role, such as a diner owner (Twilight Zone: The Movie (1983)) or a janitor (Chopping Mall (1986)). One of his best bits is the funny occult-bookshop owner in The Howling (1981). Being short (so he never played a romantic lead or a threatening villain) with wavy hair, long sideburns, a pointed nose and a face as trustworthy as a used-car dealer's, he was, and is to this day, an immediately recognizable character actor whose one-scene appearances in countless movies and TV shows guarantee audience applause.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDM1OTY4NV5BMl5BanBnXkFtZTcwMDQ3NDcyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0588241","name":"Dick Miller","idIMDB":"nm0588241"},"actorId":"nm0588241","character":"Producer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Walter Wood","urlProfile":"http://www.imdb.com/name/nm0940072","urlPhoto":"","biography":{"bio":"Walter Wood is an actor, known for Lies (1985) and Matlock (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0940072","name":"Walter Wood","idIMDB":"nm0940072"},"actorId":"nm0940072","character":"Director","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jerry Vaughn","urlProfile":"http://www.imdb.com/name/nm0891191","urlPhoto":"","biography":{"bio":"Jerry Vaughn is an actor, known for Lies (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0891191","name":"Jerry Vaughn","idIMDB":"nm0891191"},"actorId":"nm0891191","character":"Maintenance Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Guy Remsen","urlProfile":"http://www.imdb.com/name/nm0719038","urlPhoto":"","biography":{"dateOfBirth":"1930","placeOfBirth":" Williston Park, New York, USA","bio":"Guy Remsen was born in 1930 in Williston Park, New York, USA. He is an actor, known for The Player (1992), Curfew (1989) and A Girl to Kill For (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0719038","name":"Guy Remsen","idIMDB":"nm0719038"},"actorId":"nm0719038","character":"Hospital Guard","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0085846","urlIMDB":"http://www.imdb.com/title/tt0085846","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 40 min (100 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.2","filmingLocations":[],"rated":"R","awards":[],"votes":"145","type":"Movie","companyCreditsSimple":[{"idCompany":"co0019836","name":"Midnight"},{"idCompany":"co0047622","name":"New Empire"},{"idCompany":"co0065795","name":"Wescom Productions"}],"keywords":{"keywords":["electroshock therapy","female nudity","mental institution","medical restraints","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 00:25:35"}}