{"data":{"movies":[{"title":"Gentle Annie","originalTitle":"","year":"1944","releaseDate":"19450504","directors":[{"name":"Andrew Marton","id":"nm0554249"}],"writers":[{"name":"MacKinlay Kantor","id":"nm0437969"},{"name":"Lawrence Hazard","id":"nm0371907"}],"runtime":"80 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjcyN2NiOWUtOTYwZC00ZWJlLTg2ZDItZWYwM2ZmZTAyZWZlXkEyXkFqcGdeQXVyMTIxOTk5MzY@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Romance","Western"],"plot":"The Goss family live on a farm they call the dust bowl where the wind blows during the day and the coyotes howl at night. When the train is robbed, everyone thinks that Cotton and Violet were the ones that did the job, but no one has any proof. US Marshal Lloyd Richland comes into town in disguise to find the truth and he finds that the sheriff is corrupt and that the Goss family is gosh darn nice. They take in Richland and a stranded woman named Mary without any questions. Cotton believes that Sheriff Tatum shot their pa in the back, and the sheriff is now trying to plug the boys. Richland is looking for the train robbers, and at the same time is keeping an eye on Tatum and the lovely young Mary.","simplePlot":"The Goss family live on a farm they call the dust bowl where the wind blows during the day and the coyotes howl at night. When the train is robbed, everyone thinks that Cotton and Violet ... ","actors":[{"actorName":"James Craig","urlProfile":"http://www.imdb.com/name/nm0185883","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDIxMjYyNDAtMzdlNC00MjUyLTkwNjUtZDA2YmU2ZTVhNjU0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1912","placeOfBirth":" Nashville, Tennessee, USA","birthName":"James Henry Meador","height":"6' 2\" (1.88 m)","bio":"Tall, rugged James Craig's career as a contract player at MGM blossomed in the 1940's, mainly due to his resemblance to the 'King of Hollywood' 'Clark Gable' (who was then serving in the U.S. Army Air Force). The Rice Institute graduate had studied to be a physician until a sojourn in the movie capital persuaded him to try his luck as an actor. He was tutored by thespian Cyril Delevanti in 1934 and began in the industry as an extra. Having lived for some time in Texas, he had the perfect drawl to be made into a western hero. James Henry Meador consequently transformed himself into James Craig when it looked like he might be given a role in the melodrama Craig's Wife (1936). Instead, he appeared mainly in second feature oaters for the first two years of his career. His breakthrough arrived courtesy of a loan-out to RKO, where he was co-starred opposite Ginger Rogers in Kitty Foyle (1940). He had some critical success as farmer Jabez Stone in The Devil and Daniel Webster (1941) and had high-profile parts in a couple of other A-grade features: the caliph in Kismet (1944), and as Halverson in Our Vines Have Tender Grapes (1945). However, before long, Mr. Gable returned from the war and it was back to low budget horse operas for James Craig. After working in episodic television for several years in the 60's, he called it a day and turned his talents towards a lucrative career in real estate.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDIxMjYyNDAtMzdlNC00MjUyLTkwNjUtZDA2YmU2ZTVhNjU0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0185883","name":"James Craig","idIMDB":"nm0185883"},"actorId":"nm0185883","character":"Lloyd Richland aka Rich Williams","urlCharacter":"http://www.imdb.com/character/ch0485071","main":true},{"actorName":"Donna Reed","urlProfile":"http://www.imdb.com/name/nm0001656","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNzA4MDc4NV5BMl5BanBnXkFtZTYwNTU2ODU2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1921","placeOfBirth":" Denison, Iowa, USA","birthName":"Donnabelle Mullenger","height":"5' 3½\" (1.61 m)","bio":"Donna Reed was born in the midwestern town of Denison, Iowa, on January 27, 1921, as Donna Belle Mullenger. A small town - a population of less than 3,000 people - Denison was located by the Boyer River, and was the county seat of Crawford County. Donna grew up as a farm girl, much like many young girls in western Iowa, except for one thing - Donna was very beautiful. That wasn't to say that others weren't as pretty, it's just that Donna's beauty stood out from all the other local girls, so much so that she won a beauty contest in Denison. Upon graduation from high school Donna left for college in Los Angeles, in the hopes of eventually entering movies. While at Los Angeles City College, she pursued her dream by participating in several college stage productions. In addition to the plays, she also won the title of Campus Queen. At one of those stage plays Donna was spotted by an MGM talent scout and was signed to a contract. Her first film was a minor role in MGM's The Getaway (1941). That was followed by a small part in Babes on Broadway (1941), with Mickey Rooney and Judy Garland as a secretary. Afterwards, MGM began giving her better parts, in films such as The Bugle Sounds (1942), The Courtship of Andy Hardy (1942) and The Man from Down Under (1943). In 1944 she received second billing playing Carol Halliday in See Here, Private Hargrove (1944), a comedy about a reporter drafted into the army who eventually meets up with Donna's character as a worker in the canteen. The following year Donna starred in The Picture of Dorian Gray (1945), her best role to date. It was a love story set in London in 1890. It got mixed critical reviews but did well at the box-office. Donna was now one of the leading ladies of Hollywood. In 1946 she starred in what is probably her best-known role, as the wife of James Stewart in the classic It's a Wonderful Life (1946). This timeless story is a holiday staple to this day. The film also starred Lionel Barrymore and Thomas Mitchell. The next year Donna starred as Ann Daniels in Paramount's Beyond Glory (1948) with Alan Ladd, which did well at the box-office. Her next role was the strongest she had had yet--Chicago Deadline (1949), again with Ladd. It was one of the best mystery dramas to come out of Hollywood in a long time, and did very well at the box office. As the 1940s faded out and the 1950s stormed in, Donna's roles got bigger but were mainly of the wholesome, girl-next-door type. In 1953, however, she starred as the hostess Alma in the widely acclaimed From Here to Eternity (1953). She was so good in that film she was nominated for and won the Academy Award for Best Supporting Actress, beating out such veterans as Thelma Ritter and Marjorie Rambeau. The film itself won for Best Picture and remains a classic to this day. Later that year Donna starred in The Caddy (1953), a comedy with Jerry Lewis and Dean Martin. Three years later she landed the role of Sacajawea in The Far Horizons (1955), the story of the Lewis and Clark Expedition, starring Charlton Heston and Fred MacMurray. After finishing The Whole Truth (1958), Donna began her own TV series (produced by her husband), The Donna Reed Show (1958), a hit that ran for eight years. She was so effective in the show that she was nominated for TV's prestigious Emmy Award as Best Actress every year from 1959-1962. She was far more popular in TV than on the screen. After the run of the program, Donna took some time away from show business before coming back in a couple of made-for-TV movies (in 1974, she had made a feature called Yellow-Headed Summer (1974), but it was never released). She did get the role of Ellie Ewing Farlow in the hit TV series Dallas (1978) during the 1984-85 season. It was to be her final public performance. On January 14, 1986, less than two weeks before her 65th birthday, she died of pancreatic cancer in Beverly Hills, California. Grover Asmus, her husband, created the Donna Reed Foundation for the Performing Arts in her hometown of Denison. The foundation helps others who desire a career in the arts. Donna never forgot her roots. She was still a farm girl at heart.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNzA4MDc4NV5BMl5BanBnXkFtZTYwNTU2ODU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001656","name":"Donna Reed","idIMDB":"nm0001656"},"actorId":"nm0001656","character":"Mary Lingen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marjorie Main","urlProfile":"http://www.imdb.com/name/nm0537685","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTNjMDIyN2ItYmNhZS00MTU1LWJkNTctYTEzMzc5YWMxMzlmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1890","placeOfBirth":" Acton, Indiana, USA","birthName":"Mary Tomlinson","height":"5' 7\" (1.7 m)","bio":"Her father was a minister, and when she joined a local stock company as a youngster she changed her name to avoid embarrassing her family. She worked in vaudeville and debuted on Broadway in 1916. Her film debut was in A House Divided (1931). She repeated her stage role in Dead End (1937) as Baby Face Martin (Humphrey Bogart)'s mother, which led to a number of slum mother parts. She played very strong role of Lucy, the dude ranch operator in The Women (1939). She achieved popularity as a comedienne in six 1940s movies made with Wallace Beery e.g., Barnacle Bill (1941). The character which would dominate her remaining career was established when she played Ma Kettle in The Egg and I (1947), for which she received an Academy Award nomination for best supporting actress. She began her co-starring series with Percy Kilbride the following year in Feudin', Fussin' and A-Fightin' (1948) and continued through seven more. Her last movie was a \"Kettle\" without Kilbride: The Kettles on Old MacDonald's Farm (1957).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTNjMDIyN2ItYmNhZS00MTU1LWJkNTctYTEzMzc5YWMxMzlmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0537685","name":"Marjorie Main","idIMDB":"nm0537685"},"actorId":"nm0537685","character":"Annie Goss","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harry Morgan","urlProfile":"http://www.imdb.com/name/nm0604702","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4OTc3NzE5MF5BMl5BanBnXkFtZTcwMTc4NDMxNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1915","placeOfBirth":" Detroit, Michigan, USA","birthName":"Harry Bratsberg","height":"5' 6\" (1.68 m)","bio":"Harry Morgan was a prolific character actor who starred in over 100 films and was a stage performer. Known to a younger generation of fans as \"Col. Sherman T. Potter\" on M*A*S*H (1972). Also known for his commanding personality throughout his career, he tackled movies and television in a way no other actor would do it. Born Harry Bratsberg in Detroit, Michigan, to parents Henry Bratsberg, who immigrated from Norway, who was a mechanic, and Anna Olsen, a housewife who immigrated from Sweden. After graduating from Muskegon High School in Muskegon, Michigan, he took on a job as a salesman, before becoming a successful actor. In the many films, several of his most memorable movies, he appeared in were: in one of his firsts, The Omaha Trail (1942), in the next quarter of a century, he would also appear in The Ox-Bow Incident (1943), Wing and a Prayer (1944), State Fair (1945), Dragonwyck (1946), All My Sons (1948), Red Light (1949), Outside the Wall (1950), Dark City (1950) where he met future Dragnet 1967 (1967) co-star Jack Webb, who would be best friends until Webb's death, late in 1982, along with Appointment with Danger (1951). His films credits also include: High Noon (1952), The Glenn Miller Story (1954), Strategic Air Command (1955), among many others. He also co-starred with James Garner in Support Your Local Sheriff! (1969) and its sequel Support Your Local Gunfighter (1971). On television, he is fondly remembered as Spring Byington's jokingly, henpecked neighbor, \"Pete Porter\" on December Bride (1954), where he became the show's scene-stealer. It was also based on a popular radio show that it transferred into television. The show was an immediate success to viewers, which led him into starring his own short-lived spin-off series, Pete and Gladys (1960), which co-starred Cara Williams, who met Morgan in the movie, The Saxon Charm (1948). Morgan began his eight-year association with old friend, Jack Webb, and Universal, starting with Dragnet 1967 (1967), which he played Off. Bill Gannon. For the second time, like December Bride (1954) before this, it was an immediate hit, where it tackled a lot of topics. Dragnet was canceled in 1970, after a 4-season run, due to Morgan's best friend and co-star (Jack Webb) leaving the show to continue producing other shows, such as: Adam-12 (1968) and Emergency! (1972). Morgan would later work with Webb in both short-lived series, The D.A. (1971), opposite Robert Conrad and Hec Ramsey (1972), opposite Richard Boone. After those roles, Morgan ended his contract with both Universal and Mark VII, to sign with 20th Century Fox. Morgan's biggest role was that of a tough-talking, commanding, fun-loving, serious Army Officer, \"Col. Sherman T. Potter\" on M*A*S*H (1972), when he replaced McLean Stevenson, who left the show to unsuccessfully star in his own sitcom. For the third time, the show was still a hit with fans, and at 60, he was nominated for Emmies nine times and won his first and only Emmy in 1980, for Outstanding Supporting Actor. By 1983, M*A*S*H's series was getting very expensive, as well as with the cast, hence, CBS reduced it to 16 episodes. Despite M*A*S*H's finale in 1983, Morgan went on to star in a short-lived spin-off series After MASH (1983), co-starring Jamie Farr and William Christopher, from the original M*A*S*H (1972) series, without series' star Alan Alda. He also co-starred in 2 more short-lived series, as he was over 70, beginning with Blacke's Magic (1986) with Hal Linden and his final role with You Can't Take It with You (1987). That same year, he reprised his role, for a second time as \"Off. Bill Gannon\" in the film, Dragnet (1987), which starred Dan Aykroyd and Tom Hanks. Then, he guest-starred in several shows such as: The Twilight Zone (1985), Renegade (1992), The Jeff Foxworthy Show (1995), for the third time, he also reprised his \"Off. Bill Gannon\" role, supplying his voice on The Simpsons (1989). Towards the end of his acting career, as he reached 80, he had a recurring role as the older college professor on 3rd Rock from the Sun (1996), opposite John Lithgow. Afterwards, he retired from show business and lived with his family. Harry Morgan died on December 7, 2011, at age 96. On confirming his death, his son Charles, said that he had been recently treated for pneumonia. Morgan was also one of the oldest living Hollywood male actors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4OTc3NzE5MF5BMl5BanBnXkFtZTcwMTc4NDMxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0604702","name":"Harry Morgan","idIMDB":"nm0604702"},"actorId":"nm0604702","character":"Cottonwood Goss","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Langton","urlProfile":"http://www.imdb.com/name/nm0486742","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzgzNDg0NjI0NF5BMl5BanBnXkFtZTgwMTAyNzQ3MTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1913","placeOfBirth":" Salt Lake City, Utah, USA","bio":"Paul Langton was born on April 17, 1913 in Salt Lake City, Utah, USA. He was an actor, known for Peyton Place (1964), The Incredible Shrinking Man (1957) and They Were Expendable (1945). He was married to Elda Piva. He died on April 15, 1980 in Burbank, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzgzNDg0NjI0NF5BMl5BanBnXkFtZTgwMTAyNzQ3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0486742","name":"Paul Langton","idIMDB":"nm0486742"},"actorId":"nm0486742","character":"Violet Goss","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barton MacLane","urlProfile":"http://www.imdb.com/name/nm0533692","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NzYwMTExOV5BMl5BanBnXkFtZTcwNDgzMzIxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1902","placeOfBirth":" Columbia, South Carolina, USA","birthName":"Ernest Barton MacLane","height":"6' 1\" (1.85 m)","bio":"Barton MacLane graduated from Wesleyan University, where he displayed a notable aptitude for sports, in particular football and basketball. Not surprisingly, his physical prowess led to an early role in The Quarterback (1926) with Richard Dix. MacLane once commented that, as an actor, he needed to have the physical strength to tear the bad guys \"from limb to limb\", if necessary. Ironically, it was usually Barton himself who was destined to be at the end of a hiding (when not getting shot, instead), typically as snarling henchmen, outlaws and other assorted dubious or abrasive types throughout most of his 40-year acting career. In fact, Barton became so typecast, that his name was for a time used proverbially, to generally describe a shouting, hard-nosed ruffian. After training at the American Academy of Dramatic Arts, MacLane joined a stock company in Brooklyn. In 1927 he had his first part on Broadway, a brief moment as an assistant district attorney, in the melodrama \"The Trial of Mary Dugan\". He then played a small featured role as a police officer in \"Subway Express\" (1929-30), a drama enacted in the interior of a subway car. In mid-1932 MacLane tried his hand at writing his own starring vehicle for the stage, entitled \"Rendezvous\". While the play closed after just 21 performances, it led to a contract with Warner Brothers. Barton had already appeared in bit roles for Paramount at their Astoria Studios, including The Marx Brothers' debut film The Cocoanuts (1929). He portrayed mobster Brad Collins in 'G' Men (1935) (with James Cagney), which set the tone for most of his future assignments. Brawny, with squinty eyes and a rasping voice, MacLane was the ideal surly tough guy, particularly suitable for westerns and the type of films noir Warner Brothers excelled at. He was often cast as cops, be they bent or honest. Some of his most representative performances include gangster Al Kruger in Bullets or Ballots (1936), which won him some of the best critical notices of his career; outlaw Jack Slade in Western Union (1941); crooked construction boss Pat McCormick, who gets beaten up by Humphrey Bogart and Tim Holt over past-due wages in The Treasure of the Sierra Madre (1948); hard-nosed cops Detective Dundy in The Maltese Falcon (1941) and Lt. Reece in Kiss Tomorrow Goodbye (1950). MacLane, on loan to Universal, also had a starring role in Prison Break (1938) as an innocent tuna fisherman who is framed for murder. He was prominent as a tough but sympathetic cop, foil to sleuthing girl reporter Glenda Farrell in the \"Torchy Blaine\" series of the mid- to late 1930s. In the 1960s Barton began to cultivate a good-guy image as Marshal Frank Caine in the NBC western series Outlaws (1960) as well as showing up in a small recurring role as Air Force Gen. Martin Peterson in I Dream of Jeannie (1965). Barton was married to the actress Charlotte Wynters, who appeared with him in six of his films. When not on the set, the couple spent time on their 2000-acre cattle ranch in Madera County, California. For his work in television, Barton has a star on the Hollywood Walk of Fame.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NzYwMTExOV5BMl5BanBnXkFtZTcwNDgzMzIxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0533692","name":"Barton MacLane","idIMDB":"nm0533692"},"actorId":"nm0533692","character":"Sheriff Tatum","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Philliber","urlProfile":"http://www.imdb.com/name/nm0680139","urlPhoto":"","biography":{"dateOfBirth":"6 July 1873","placeOfBirth":" Elkhart, Indiana, USA","bio":"John Philliber was born on July 6, 1873 in Elkhart, Indiana, USA. He was an actor, known for Double Indemnity (1944), It Happened Tomorrow (1944) and A Lady Takes a Chance (1943). He died on November 6, 1944 in Elkhart.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0680139","name":"John Philliber","idIMDB":"nm0680139"},"actorId":"nm0680139","character":"Barrow","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Morris Ankrum","urlProfile":"http://www.imdb.com/name/nm0030194","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTIyZjM1ZDItNjNhZS00ZDgxLWExMmUtM2FmZTg5ZDYyZjhhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1897","placeOfBirth":" Danville, Illinois, USA","birthName":"Morris Winslow Ankrum","height":"6' (1.83 m)","bio":"A graduate of the University of Southern California School of Law, Morris Ankrum was an attorney and an economics professor before switching careers and joining the theater. He was a veteran stage actor by the time he entered the film industry in the 1930s, where he spent much time in westerns, playing everything from Indian chiefs to crooked town bankers. He was often cast as the villain in numerous films of the highly popular Hoplaong Cassidy series. It was in the 1950s, though, that he hit his stride in the genre for which he is most fondly remembered - science-fiction films, where his gruff, no-nonsense demeanor and authoritative voice perfectly fit the role of the military officer helping scientists fight an outer-space menace, most memorably as Col. Fielding in the classic Invaders from Mars (1953). Toward the end of his career Ankrum had a recurring role as a judge on the Perry Mason (1957) TV series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTIyZjM1ZDItNjNhZS00ZDgxLWExMmUtM2FmZTg5ZDYyZjhhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0030194","name":"Morris Ankrum","nicknames":["Morrie"],"idIMDB":"nm0030194"},"actorId":"nm0030194","character":"Deputy Gansby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Noah Beery","urlProfile":"http://www.imdb.com/name/nm0001935","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMDkxNTg3Nl5BMl5BanBnXkFtZTgwMDk2MDU1MzE@._V1._CR102,137,545,728_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1882","placeOfBirth":" Kansas City, Missouri, USA","birthName":"Noah Nicholas Beery","height":"6' 1\" (1.85 m)","bio":"Respected character actor of the silent and early sound period, specializing in cruel villains. The son of Kansas City policeman Noah Webster Beery and Frances Margaret Fitzgerald Beery, Noah Nicholas Beery and his younger brother Wallace Beery both left home in their teens, each seeking a career as a performer. Noah made his stage debut at the age of 16 and worked steadily in the theatre until his early 30s. Following his brother into films, he quickly established himself as a competent player and a familiar heavy in all sorts of films, particularly westerns. He never achieved the great fame of his younger brother, but succeeded in carving a memorable niche for himself in the history of film. His son Noah Beery Jr. became equally familiar as a character actor, though usually in more genial roles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMDkxNTg3Nl5BMl5BanBnXkFtZTgwMDk2MDU1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001935","name":"Noah Beery","idIMDB":"nm0001935"},"actorId":"nm0001935","character":"Hansen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Darien","urlProfile":"http://www.imdb.com/name/nm0201227","urlPhoto":"","biography":{"dateOfBirth":"18 March 1876","placeOfBirth":" New Orleans, Louisiana, USA","birthName":"Frank Guderian","bio":"Frank Darien was born on March 18, 1876 in New Orleans, Louisiana, USA as Frank Guderian. He was an actor, known for The Grapes of Wrath (1940), The Little Colonel (1935) and A Laundry Clean-Up (1917). He died on October 20, 1955 in Hollywood, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0201227","name":"Frank Darien","idIMDB":"nm0201227"},"actorId":"nm0201227","character":"Jake","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Emmett O'Connor","urlProfile":"http://www.imdb.com/name/nm0640495","urlPhoto":"","biography":{"dateOfBirth":"18 March 1885","placeOfBirth":" Milwaukee, Wisconsin, USA","bio":"Stalwart Irish-American character actor Robert Emmet O'Connor, who was born on March 18, 1885, in Milwaukee, Wisconsin. He made his bones performing in circuses and in vaudeville. He made his Broadway debut in the musical \"Fritz in Tammany Hall\" at the Herald Square Theatre on October 16, 1905, ultimately appearing in 13 musical comedies and operettas on the Great White Way through 1930 (he also appeared in four straight plays during that period, mostly comedies such as \"The Old Soak\" during the 1922-23 season). After 1930, he never appeared on Broadway again, focusing instead on his movie career. He made his movie debut in 1920 in the Harold Lloyd comedy short His Royal Slyness (1920), directed by Hal Roach. He made six comedies for the Hal Roach Studios in the years 1920-21, including one more Harold Lloyd vehicle, Never Weaken (1921), before taking a five-year hiatus from films. He returned in the Thomas Meighan drama, Tin Gods (1926), directed by Allan Dwan, then spent the next 24 years acting in movies. In 1930, he went back to the Roach Studio to support Laurel and Hardy in two Spanish language shorts, then moved over to Warner Bros. as a bit player. He played the Irish bootlegger Paddy Ryan in the classic The Public Enemy (1931) in support of fellow Irish-American James Cagney, and appeared in another classic, Mystery of the Wax Museum (1933). He then settled into being typecast as Irish cops. After he moved on to MGM, the typecasting led to one of his most famous roles: the plain-clothes detective in pursuit of the Marx Brothers in A Night at the Opera (1935). During the 1940s, still under contract player to MGM, he was kept busy, appearing in every genre, including the \"Our Gang\" comedies. His last film role was as the Paramount Studios' guard who remembers Norma Desmond in Sunset Boulevard (1950). He virtually retired from his acting career at the age of 65, though he made some television appearances in the 1950s. Robert Emmett O'Connor died on September 4, 1962, of injuries sustained in a fire. He was 77 years old.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0640495","name":"Robert Emmett O'Connor","idIMDB":"nm0640495"},"actorId":"nm0640495","character":"Childers - Bartender","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0036859","urlIMDB":"http://www.imdb.com/title/tt0036859","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"07","month":"08","year":"1944","remarks":null},"filmingDates":null,"copyrightHolder":"Loew's Incorporated, 19 December 1944; LP13027 (in copyright registry)"},"technical":{"runtime":["1 hr 20 min (80 min)"],"soundMix":["Mono (Western Electric Sound System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["2,183.89 m (8 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.3","filmingLocations":[{"location":"Agoura, California, USA"}],"rated":"PASSED","awards":[],"votes":"113","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"}],"keywords":{"keywords":["sheriff","train","marshal","waitress","undercover operation","saloon","robbery","ranch","oklahoma","mother son relationship","money","loyalty","hat","gunfire","gunfight","gramophone","fight","dog","deputy","confession of crime","brother brother relationship","braid","based on novel","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:29:12"}}