{"data":{"movies":[{"title":"Horror Island","originalTitle":"","year":"1941","releaseDate":"19410328","directors":[{"name":"George Waggner","id":"nm0905729"}],"writers":[{"name":"Maurice Tombragel","id":"nm0866572"},{"name":"Victor McLeod","id":"nm0572876"}],"runtime":"60 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWQ0MjdiN2UtYjQwZi00MWI1LWIyMDAtZDliZTI3Y2E5ZTA5XkEyXkFqcGdeQXVyMTQ2MjQyNDc@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Mystery","Thriller"],"plot":"Down-on-his luck entrepreneur Bill Martin and sidekick Stuff Oliver try to stay one step in front of creditors in their seedy waterfront office when they meet \"The Captain,\" an idiosyncratic peg-legged old sailor. The Captain is convinced that the treasure of pirate Sir Henry Morgan is hidden somewhere in a castle on an offshore island recently inherited by Martin. His proof is a treasure map, half of which has been stolen by a mysterious Phantom who lurks in the shadows waiting for an opportunity to steal the other half. Sensing a moneymaking opportunity, Bill tries to recruit customers willing to pay $50 apiece for a \"treasure hunt\" outing to the \"haunted\" island. Among those signing up are heiress Wendy Creighton and her bored, ineffectual boy friend, a dimwitted police sergeant, a professor whose expertise is old maps, a wanted murderer and his moll, and Bill's cousin George, who has recently offered $20,000 to buy the supposedly worthless island. They all get more than the few ...","simplePlot":"A down-on-his luck businessman organizes an excursion to Sir Henry Morgan's Island for a treasure hunt only to encounter a mysterious phantom and murder.","actors":[{"actorName":"Dick Foran","urlProfile":"http://www.imdb.com/name/nm0285264","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMDgwNDg0MV5BMl5BanBnXkFtZTcwMTE5MjE5Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 June 1910","placeOfBirth":" Flemington, New Jersey, USA","birthName":"John Nicholas Foran","height":"6' 2¼\" (1.89 m)","bio":"Dick Foran was the matinée idol of the B movies. He started as a band singer and then sang on the radio. He was hired by Warner Brothers as a supporting actor who could croon a tune when called upon. His good looks and good natured personality made him a natural choice for the supporting cast. His first starring role was in the western Treachery Rides the Range (1936) which was Warner Brothers answer to Gene Autry. In the westerns that followed, he would sing the tune while riding the horse or romancing the gal. Whether it was Song of the Saddle (1936) or California Mail (1936), his character name may be different, but 'The Singing Cowboy' tag was always the same. While at Warner's he also played straight dramatic roles, supporting the star. In 1940, Dick headed for Universal where he was, again, in the supporting cast. He worked in serials, Rangers of Fortune (1940); horror, The Mummy's Hand (1940); to comedy, Ride 'Em Cowboy (1942). His signature theme \"I'll Remember April\" was introduced in Ride 'Em Cowboy (1942). After that, roles were sporadic. He made a half dozen films in the late fifties and did some Television. His last film role was in Donovan's Reef (1963) with his longtime friend John Wayne.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMDgwNDg0MV5BMl5BanBnXkFtZTcwMTE5MjE5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0285264","name":"Dick Foran","idIMDB":"nm0285264"},"actorId":"nm0285264","character":"Bill Martin","urlCharacter":"http://www.imdb.com/character/ch0130461","main":true},{"actorName":"Leo Carrillo","urlProfile":"http://www.imdb.com/name/nm0140504","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzFmY2ZiNGYtN2M3OC00NzdkLTkyYTYtYmY3ODJkMmRjZGZhL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1881","placeOfBirth":" Los Angeles, California, USA","height":"5' 10\" (1.78 m)","bio":"Leo Carrillo was born on August 6, 1881 in Los Angeles, California, USA. He was an actor, known for The Cisco Kid (1950), Viva Villa! (1934) and Phantom of the Opera (1943). He was married to Edith Shakespear Haeselbarth. He died on September 10, 1961 in Santa Monica, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzFmY2ZiNGYtN2M3OC00NzdkLTkyYTYtYmY3ODJkMmRjZGZhL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0140504","name":"Leo Carrillo","idIMDB":"nm0140504"},"actorId":"nm0140504","character":"Tobias Clump","urlCharacter":"http://www.imdb.com/character/ch0130462","main":true},{"actorName":"Peggy Moran","urlProfile":"http://www.imdb.com/name/nm0602955","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWM4MjliNmUtN2ZiMi00MmE4LWI0ZjMtYWE1NGUyZTg0Y2JjXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 October 1918","placeOfBirth":" Clinton, Iowa, USA","birthName":"Marie Jeanette Moran","bio":"Mary Jeanette Moran was born in Clinton, Iowa. The daughter of Louise Moran, a dancer with the famous Denishawn Dancers, and the celebrated artist Earl Moran, whose paintings graced many a barracks wall during World War II. One of Earl's favorite models was Norma Jean Baker, who later changed her name to Marilyn Monroe. Peggy never modeled for Earl, although a publicity still of the two of them was taken in Earl's atelier with Peggy posing. From early childhood, she was called by the nickname, \"Peggy\". Peggy's mother took six-year-old Peggy to the office of Derio, a famous psychic of the time. Louise wanted her fortune told. Derio did not have the time for them but, when he came out of his office into the hall, he passed Peggy and her mother. Looking down at Peggy, he caressed her cheek, and said, \"Hmm... an actress\". From that moment on, Peggy knew she was destined to act. Peggy appeared in some plays at school. She attended Hollywood High, where she was squired by Mike Stokey, founder of the original TV show, Stump the Stars (1947). She also attended John Marshall High for a time. There, she appeared in every play or show she could. Hollywood soon beckoned. Peggy went to the front door of Warner Brothers and told the startled guard that she wanted to get into the lot because she was going to be a movie star. The guard introduced her to a producer who introduced her to an agent, and her career was started. She acted in a few clunkers at the beginning, playing mostly bit parts and minor roles. Among them was Ernst Lubitsch's masterpiece, Ninotchka (1939), in which Peggy appeared in two scenes as a cute cigarette girl. Later, when the picture was released, it appeared in Clinton, Iowa's only movie theatre under the marquee: \"Clinton's Own Peggy Moran starring in Ninotchka (1939), with Greta Garbo\". Peggy moved from Warner Brothers to Universal Pictures in the late 1930s. In between, she played the female lead in a Gene Autry western entitled Rhythm of the Saddle (1938). Working now at Universal, she met the producer, Joe Pasternak, who introduced her to his director, Henry Koster. It was love at first sight. Henry cast her first in a Deanna Durbin film, First Love (1939). She played Deanna's schoolmate. In the meantime, Universal was keeping Peggy busy starring in many of their \"B\" films. During this time, also, she starred in her most famous movie, the one for which she would always be remembered, The Mummy's Hand (1940). Even up to her passing, she received four or five fan letters a week from people who wanted photos of her from that film though it was produced over sixty years ago. Henry had discovered two comedians, Bud Abbott and Lou Costello, and their first movie, One Night in the Tropics (1940), starred Alan Young, Nancy Kelly, Robert Cummings, and Peggy Moran. Henry did not direct that one, or any other Abbott and Costello film, but he was responsible for their introduction to Hollywood, and Peggy was their first film character foil. Peggy was also tapped to star with Franchot Tone in Trail of the Vigilantes (1940), a Western that had all the other contract players from Universal, whether they were cowboys or not, including Broderick Crawford and Mischa Auer. A year or so later, Henry and Peggy were married. Conrad Veidt was best man at the wedding in Las Vegas. Peggy was soon pregnant with her first son. Just after that, she was hired by Republic Pictures to play the female lead, opposite Roy Rogers, in King of the Cowboys (1943). Henry encouraged her to take the role even though she was pregnant. After that, whenever she saw the movie with her son, Nicolas Koster, she always told him, \"You were there!\". That was Peggy's last film appearance except for some very recent films about stars of the early era. Peggy's life with Henry was the picture of marital bliss. They had two children, Nicolas Koster, who also acted in several of Henry's films, and Peter Koster, who works in Contra Costa County. Henry passed away in 1988. Peggy was quite active during these last fourteen years, playing billiards, dancing, entertaining, and traveling around the country to attend movie nostalgia conventions, where she invariably amazed and impressed everyone from hardened veterans of movies to new fans, with her wit, charm, intelligence and beauty. She was also active in her church, the Camarillo Church of Religious Science, where she studied to become a practitioner. On 26 August 2002, she was being driven from a friend's apartment in Ventura back to her apartment in Woodland Hills when the driver lost control of the car on the freeway. Peggy never recovered from the terrible damage that accident caused. She finally left us on 24 October, one day after her 84th birthday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWM4MjliNmUtN2ZiMi00MmE4LWI0ZjMtYWE1NGUyZTg0Y2JjXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0602955","name":"Peggy Moran","idIMDB":"nm0602955"},"actorId":"nm0602955","character":"Wendy Creighton","urlCharacter":"http://www.imdb.com/character/ch0130463","main":true},{"actorName":"Fuzzy Knight","urlProfile":"http://www.imdb.com/name/nm0460906","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTBlN2IzZjQtNDAwYy00YWQ1LWE4NWUtM2Q1Y2EzYTU4NzIzL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 May 1901","placeOfBirth":" Fairmont, West Virginia, USA","birthName":"John Forrest Knight","height":"5' 8\" (1.73 m)","bio":"American character actor primarily of Western \"sidekick\" roles. Born John Forest Knight in Fairmont, West Virginia, Knight joined a traveling minstrel show as a musician at age 15. He attended The University of West Virginia as a law student, supporting himself as the drummer in his own band. Finding music more rewarding, he left school and played on the vaudeville and cabaret circuits. He appeared in Earl Carroll's Vanities of 1927 and on Broadway as a musical performer in \"Here's Howe\" and \"Ned Wayburn's Gambols.\" He also played drums for the Irving Aaronson and George Olsen big bands. According to Knight's \"Variety\" obituary, he appeared in a number of short films for MGM and Paramount from 1928 to 1931, though the titles of these films are apparently unknown. Mae West saw Knight in vaudeville and championed him for her film She Done Him Wrong (1933) and gave him his first substantive film role. His comic style and the soft voice which had given him his nickname stood him in good stead in movies, and he appeared in nearly 200 films over the next thirty years. His singing was a memorable part of the films The Trail of the Lonesome Pine (1936) and The Shepherd of the Hills (1941), but it was as a Western sidekick that he gained his greatest fame. He played the comic pal of Johnny Mack Brown and other cowboy heroes in scores of Westerns, and was listed among the Top Ten Money-Making Western Stars in 1940. In the 1950s, he gained new audiences with his sidekick role on Buster Crabbe's TV series Captain Gallant of the Foreign Legion (1955). He retired in 1960, but continued to make occasional appearances. He died in his sleep at the Motion Picture Country Home and Hospital in Woodland Hills, California at 74, survived by his wife, actress Patricia Ryan (née Thelma de Long). He is buried in an unmarked grave next to the grave of comedian Maxie Rosenbloom at Valhalla Memorial Park in Burbank, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTBlN2IzZjQtNDAwYy00YWQ1LWE4NWUtM2Q1Y2EzYTU4NzIzL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0460906","name":"Fuzzy Knight","idIMDB":"nm0460906"},"actorId":"nm0460906","character":"Stuff Oliver","urlCharacter":"http://www.imdb.com/character/ch0130464","main":true},{"actorName":"John Eldredge","urlProfile":"http://www.imdb.com/name/nm0253141","urlPhoto":"","biography":{"dateOfBirth":"30 August 1904","placeOfBirth":" San Francisco, California, USA","height":"5' 11\" (1.8 m)","bio":"John Eldredge was born on August 30, 1904 in San Francisco, California, USA. He was an actor, known for Meet Corliss Archer (1954), Dangerous (1935) and High Sierra (1941). He died on September 23, 1961 in Laguna Beach, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0253141","name":"John Eldredge","idIMDB":"nm0253141"},"actorId":"nm0253141","character":"Cousin George","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lewis Howard","urlProfile":"http://www.imdb.com/name/nm0397459","urlPhoto":"","biography":{"dateOfBirth":"16 January 1919","placeOfBirth":" New York City, New York, USA","bio":"Lewis Howard was born on January 16, 1919 in New York City, New York, USA. He was an actor, known for First Love (1939), Hellzapoppin' (1941) and Meet the Chump (1941). He died on September 29, 1951.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0397459","name":"Lewis Howard","idIMDB":"nm0397459"},"actorId":"nm0397459","character":"Thurman Coldwater","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hobart Cavanaugh","urlProfile":"http://www.imdb.com/name/nm0146928","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzJkODIwNjMtNTBlMi00NWY1LWI1ZmEtMmNmZmE5MTZkNGIwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 September 1886","placeOfBirth":" Virginia City, Nevada, USA","bio":"Worried-looking, balding, moustachioed and usually bespectacled small part character actor, prolific during the 1930s and 40s. Hobart Cavanaugh played downtrodden or henpecked little men -- the perennial victim, forever nervous or bewildered -- to absolute perfection. He was most at home as clerks, mailmen, minor officials, undertakers, shopkeepers and bank tellers. However, when called upon, he could be just as convincing as a sneaky or vaguely sinister villain's accomplice. A former engineering student at the University of California, Cavanaugh began his acting career on the stage, making his debut on Broadway in 1916. He entered films, somewhat inauspiciously, with a forgotten B-picture, which was shot in New York by the independent Gotham Company. It took another five years, until he was signed by First National/Warner Brothers, where he remained under contract until 1936, thereafter free-lancing. His mild-mannered personae remained in constant demand in Hollywood, for he tallied up an impressive 190 screen appearances -- though often uncredited -- right up until his death in 1950.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzJkODIwNjMtNTBlMi00NWY1LWI1ZmEtMmNmZmE5MTZkNGIwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0146928","name":"Hobart Cavanaugh","idIMDB":"nm0146928"},"actorId":"nm0146928","character":"Professor Jasper Quinley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Walter Catlett","urlProfile":"http://www.imdb.com/name/nm0146185","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDQzMmUxYTgtZjFjZS00YTY4LWI1MDUtZTgxOGNmNjA4MDY4XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1889","placeOfBirth":" San Francisco, California, USA","birthName":"Walter Leland Catlett","height":"5' 10½\" (1.79 m)","bio":"Walter Catlett carved out a career for himself playing excitable, officious blowhards, and few actors did it better. A San Francisco native, he started out in vaudeville - with a detour for a while in opera - before breaking into films in the mid-1920s. Two of his best remembered roles were as the stage manager driven to distraction by James Cagney in Yankee Doodle Dandy (1942) and the local constable who throws the entire cast in jail, and winds up there himself, in the classic screwball comedy Bringing Up Baby (1938). He retired after making Beau James (1957), and died of a stroke in 1960.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDQzMmUxYTgtZjFjZS00YTY4LWI1MDUtZTgxOGNmNjA4MDY4XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0146185","name":"Walter Catlett","idIMDB":"nm0146185"},"actorId":"nm0146185","character":"Sergeant McGoon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ralf Harolde","urlProfile":"http://www.imdb.com/name/nm0363753","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MTNjMWMtNGJkMy00MTJmLWE2NzMtOGYxYjRkZGMxYjg1XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1899","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Ralph Harold Wigger","height":"5' 11\" (1.8 m)","bio":"Ralf Harolde was born on May 17, 1899 in Pittsburgh, Pennsylvania, USA as Ralph Harold Wigger. He was an actor, known for Murder, My Sweet (1944), I'm No Angel (1933) and Smart Money (1931). He died on November 1, 1974 in Santa Monica, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MTNjMWMtNGJkMy00MTJmLWE2NzMtOGYxYjRkZGMxYjg1XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0363753","name":"Ralf Harolde","idIMDB":"nm0363753"},"actorId":"nm0363753","character":"Rod Grady","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Iris Adrian","urlProfile":"http://www.imdb.com/name/nm0012441","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDgyZjNiNWQtZTQyZi00MjUzLTlkNTktZGI2ODU4NTllNmEzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 May 1912","placeOfBirth":" Los Angeles, California, USA","birthName":"Iris Adrian Hostetter","height":"5' 4\" (1.63 m)","bio":"Sugar, Pepper, Pearl, Sunny, Goldie, Bubbles, all those are nicknames borne by petite actress Iris Adrian in several of the 160 movies she made. With such names, don't expect to see her playing Joan of Ark or Electra but it remains that all these pet names reflect her winning femininity, its sweetness, its spiciness, its radiance. What's more their funny overtones are telltale signs of Iris Adrian's own quick witty sense of humor. Sexy yes, but with a sharp tongue. This aspect of her personality helped her to evolve and last, changing from the roles of blonde chorines or waitresses or, on the wilder side, of streetwalkers and other gangsters' molls to colorful bit parts in comedies with Abbott and Costello, Jerry Lewis and Elvis Presley. She ended up playing almost exclusively for Walt Disney productions before retiring at the respectable age of 82. Though she never achieved star status she could easily have if the circumstances had been favorable. For she steals scenes in a lot of movies provided of course her role is fleshed out sufficiently. She was excellent, for instance, in more than one poverty row crime movies. Don't miss her in 'Gold Diggers of 1937', 'Go West' (with the Marx Brothers, 1940), 'Lady of Burlesque' (1943), 'The Paleface'(1948), 'Once a Thief' (1950) and 'The Errand Boy' (with Jerry Lewis, 1961).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDgyZjNiNWQtZTQyZi00MjUzLTlkNTktZGI2ODU4NTllNmEzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0012441","name":"Iris Adrian","idIMDB":"nm0012441"},"actorId":"nm0012441","character":"Arleen Grady","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Foy Van Dolsen","urlProfile":"http://www.imdb.com/name/nm0886608","urlPhoto":"","biography":{"dateOfBirth":"29 November 1911","placeOfBirth":" Jay County, Indiana, USA","birthName":"Foy Homer Van Dolsen","bio":"Foy Van Dolsen was born on November 29, 1911 in Jay County, Indiana, USA as Foy Homer Van Dolsen. He was an actor, known for Never Say Die (1939), Horror Island (1941) and Tom Sawyer, Detective (1938). He died on March 5, 1990 in Marin County, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0886608","name":"Foy Van Dolsen","idIMDB":"nm0886608"},"actorId":"nm0886608","character":"The Phantom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emmett Vogan","urlProfile":"http://www.imdb.com/name/nm0900850","urlPhoto":"","biography":{"dateOfBirth":"27 September 1893","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Charles Emmet Vogan","bio":"Emmett Vogan was born on September 27, 1893 in Cleveland, Ohio, USA as Charles Emmet Vogan. He was an actor, known for The Greener Hills (1939), The Mummy's Ghost (1944) and The Mummy's Tomb (1942). He died on October 6, 1969 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0900850","name":"Emmett Vogan","idIMDB":"nm0900850"},"actorId":"nm0900850","character":"The Stranger","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0033728","urlIMDB":"http://www.imdb.com/title/tt0033728","business":{"budget":{"money":"$93,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"15","month":"03","year":"1941","remarks":null},"filmingDates":[{"money":null,"country":null,"day":"03","month":"03","year":"1941","remarks":null},{"money":null,"country":null,"day":"15","month":"03","year":"1941","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr (60 min)"],"soundMix":["Mono (Western Electric Mirrophonic Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.0","filmingLocations":[{"location":"Backlot, Universal Studios - 100 Universal City Plaza, Universal City, California, USA"}],"rated":"PASSED","awards":[],"votes":"355","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"}],"keywords":{"keywords":["treasure","island","phantom","map","castle","death","professor","excursion","sidekick","heiress","entrepreneur","treasure map","murder","suit of armor","tapping","slippers","shadow on wall","staircase","counting down","fire in fireplace","secret passage","fireplace","murder mystery","blowing away dust","trap door","candle","lantern","skipper","revolver","gun","pistol","woman wearing a fur coat","fur coat","search","searching","skull","human skull","boat","guest","sleepwalking","woman fainting","waking from fainting","loudspeaker","fainting woman","scream","humor","harpoon","policeman","stock music","orchestral music score","usa","1940s","held at gunpoint","reward","police officer","cigarette smoking","stuttering sidekick","damsel in distress","stock footage","b movie","whodunit","wanted man","torture chamber","sleepwalker","secret passageway","red herring","pier","peg leg","mail bomb","gangster's moll","escaped murderer","detective sergeant","crossbow","cousin cousin relationship","convicted murderer","business card","buried treasure","overnight in a haunted house","night","mysterious villain","mysterious island","hidden door"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:58:28"}}