{"data":{"movies":[{"title":"The Stranger","originalTitle":"","year":"1973","releaseDate":"19730226","directors":[{"name":"Lee H. Katzin","id":"nm0441914"}],"writers":[{"name":"Gerald Sanford","id":"nm0762561"},{"name":"Gerald Sanford","id":"nm0762561"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWUzZmQ0MmEtMTQ0Yy00MTM2LWFiYWEtMTdmNzAyNzZmY2NiXkEyXkFqcGdeQXVyMzU0NzkwMDg@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Sci-Fi"],"plot":"TV series pilot (series never launched). After a freak mishap, an astronaut finds himself on an almost precise copy of Earth (right down to the Plymouth cars). However, this planet has three moons, and is run by an Orwellian government called The Perfect Order, who seek out and crush all dissidents either by outright assassination or by having them treated at \"Ward E.\" Hunted and alone, the story traces the astronaut's efforts to evade capture and return home.","simplePlot":"TV series pilot (series never launched). After a freak mishap, an astronaut finds himself on an almost precise copy of Earth (right down to the Plymouth cars). However, this planet has ... ","actors":[{"actorName":"Glenn Corbett","urlProfile":"http://www.imdb.com/name/nm0179148","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMjk2ODE1NV5BMl5BanBnXkFtZTcwNTgyMzYwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1933","placeOfBirth":" El Monte, California, USA","birthName":"Glen Edwin Rothenburg","height":"6' (1.83 m)","bio":"An American lead actor and supporting actor, rugged and commanding Glenn Corbett's background didn't seem like it would lead to Hollywood stardom. The son of a garage mechanic, Corbett served a hitch in the Navy and later met Judy, the woman who would become his wife, while she was working at a college. With her encouragement Corbett began to get parts in campus theatricals, and it was while he was in one of these that he came to the attention of the powers-that-be at Columbia Pictures, which signed him to a contract. His film debut was in The Crimson Kimono (1959). That was followed by supporting roles in The Mountain Road (1960) and Man on a String (1960). He eventually got the lead role in William Castle's suspense thriller, Homicidal (1961), and appeared in the TV series Route 66 (1960). His character in \"Route 66\" got him attention and he was cast in a new series, The Road West (1966), but that was short-lived. Corbett was also busy making major theatrical films in the 1970s. He snagged substantial supporting parts in two of John Wayne's westerns, playing good guy Pat Garrett in Chisum (1970) and one of the gang who kidnaps Wayne's son in Big Jake (1971), but he took the lead role in Nashville Girl (1976) and Universal's war epic Midway (1976). Throughout the '80s Corbett stayed busy with a regular part in the cast of the long-running television series Dallas (1978), up until his death in 1993 of lung cancer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxMjk2ODE1NV5BMl5BanBnXkFtZTcwNTgyMzYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0179148","name":"Glenn Corbett","idIMDB":"nm0179148"},"actorId":"nm0179148","character":"Neil Stryker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cameron Mitchell","urlProfile":"http://www.imdb.com/name/nm0593192","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNzU2NTc0Ml5BMl5BanBnXkFtZTcwMDc1MDg2OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 November 1918","placeOfBirth":" Dallastown, Pennsylvania, USA","birthName":"Cameron McDowell Mitzell","height":"5' 11\" (1.8 m)","bio":"Cameron Mitchell was the son of a minister, but chose a different path from his father. Prior to World War II, in which he served as an Air Force bombardier, Mitchell appeared on Broadway, and, in 1940, an experimental television broadcast, \"The Passing of the Third Floor Back\". He made his film debut in What Next, Corporal Hargrove? (1945), but continued with stage as well as film work. He gained early recognition for his portrayal of Happy in the stage and screen versions of \"Death of a Salesman\". Still, out of more than 300 film and TV appearances, he is probably best remembered for his work on The High Chaparral (1967) TV series in which he, as the happy-go-lucky Buck Cannon, and Henry Darrow, as Manolito Montoya, stole the show.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNzU2NTc0Ml5BMl5BanBnXkFtZTcwMDc1MDg2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0593192","name":"Cameron Mitchell","nicknames":["Cam","Nutty","Uncle Boots"],"idIMDB":"nm0593192"},"actorId":"nm0593192","character":"George Benedict","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sharon Acker","urlProfile":"http://www.imdb.com/name/nm0009943","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1Nzg5NTY3OV5BMl5BanBnXkFtZTgwMTQzMDI0MTI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 April 1935","placeOfBirth":" Toronto, Ontario, Canada","bio":"Although she was presented in 1969 the first Film Star of Tomorrow by The Motion Picture Exhibitors of Canada, the status of Sharon Acker as a star never materialized. Not that she was inactive, quite the opposite, but she worked almost only for TV and appeared only in a few undistinguished movie films. She will, nevertheless, remain remembered for her role as Lee Marvin's ex-wife in John Boorman's classic film noir Point Blank (1967). The victim of Marvin's rough manners, Acker/Lynne left a deep impact on male brains. Born in 1935, the Canadian-born actress started her film career in England when the play she was in, \"Lucky Jim\", Kingsley Amis' classic, was made into a movie. But, she was not seen in many a film, except during the sixties, either in Canada or in the U.S. On the contrary, she has been very active on TV, first in Canada from the age of 19, then in the U.S. in made-for-TV movies or series like Star Trek (1966), Mission: Impossible (1966), Gunsmoke (1955), Marcus Welby, M.D. (1969), Barnaby Jones (1973), etc. She was a regular in the series The Bold Ones: The Senator (1970) for one year and played \"Della Street\" in the short-lived The New Perry Mason (1973). A talented actress seen too little in movie theaters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1Nzg5NTY3OV5BMl5BanBnXkFtZTgwMTQzMDI0MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0009943","name":"Sharon Acker","idIMDB":"nm0009943"},"actorId":"nm0009943","character":"Dr. Bettina Cooke","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lew Ayres","urlProfile":"http://www.imdb.com/name/nm0000817","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3ODM3MjQ2Ml5BMl5BanBnXkFtZTcwMjg0OTY5Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1908","placeOfBirth":" Minneapolis, Minnesota, USA","birthName":"Lewis Frederick Ayer III","height":"5' 9½\" (1.77 m)","bio":"Lew Ayres was born in Minneapolis, Minnesota and raised in San Diego, California. A college dropout, he was found by a talent scout in the Coconut Grove nightclub in Los Angeles and entered Hollywood as a bit player. He was leading man to Greta Garbo in The Kiss (1929), but it was the role of Paul Baumer in All Quiet on the Western Front (1930) that was his big break. He was profoundly affected by the anti-war message of that film, and when, in 1942, the popular star of Young Dr. Kildare (1938) and subsequent Dr. Kildare films was drafted, he was a conscientious objector. America was outraged, and theaters vowed never to show his films again, but quietly he achieved the Medical Corps status he had requested, serving as a medic under fire in the South Pacific and as a chaplain's aid in New Guinea and the Phillipines. His return to film after the war was undistinguished until Johnny Belinda (1948) - his role as the sympathetic physician treating the deaf-mute Jane Wyman won him an Academy Award nomination as Best Actor. Subsequent movie roles were scarce; an opportunity to play Dr. Kildare in television was aborted when the network refused to honor his request for no cigarette sponsorship. He continued to act, but in the 1970s put his long experience into a project to bring to the west the philosophy of the East - the resulting film, Altars of the World (1976), while not a box-office success, won critical acclaim and a Golden Globe Award. Lew Ayres died in Los Angeles, California on December 30, 1996, just two days after his 88th birthday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3ODM3MjQ2Ml5BMl5BanBnXkFtZTcwMjg0OTY5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000817","name":"Lew Ayres","idIMDB":"nm0000817"},"actorId":"nm0000817","character":"Prof. Dylan MacAuley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Coulouris","urlProfile":"http://www.imdb.com/name/nm0183459","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjVkY2YwYWQtYTM5Yi00MmJiLWIzNTItMmI0MzhiZDUzOGQ3XkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1903","placeOfBirth":" Manchester, England, UK","bio":"The son of a Greek immigrant father (merchant) and an English mother, George Coulouris was educated at England's Manchester Grammar School. As an actor he was quite adept at playing villains, particularly wealthy businessmen, but he was just as suitable at playing nobler roles. A member of Orson Welles' famed Mercury Theater players, he appeared in such films as Citizen Kane (1941), For Whom the Bell Tolls (1943), Papillon (1973) and Murder on the Orient Express (1974). The film that established him as an interesting and reliable heavy, with his massive shoulders and hooded eyes, was Watch on the Rhine (1943). Coulouris studied with Elsie Fogerty at London's Central School of Speech and Drama. His London stage debut came in 1925 with \"Henry V\" at the Old Vic. He was soon playing the Yank at the first British staging of Eugene O'Neill's \"The Hairy Ape\". By 1929 he had reached Broadway, via a modern dress version of \"Measure for Measure\". His role as Tallant in \"The Late Christopher Bean\" took him to Hollywood in 1933 for MGM's film of the play. The next milestone in his burgeoning career occurred when he was playing in \"Ten Million Ghosts\" and met Orson Welles. They got on well and Coulouris joined Welles' Mercury Theatre, playing Mark Antony in the famous modern dress production of \"Julius Caesar\" (1937). When Welles went to Hollywood to make \"Citizen Kane\", Coulouris climbed into movie history in the part of Walter Parks Thatcher, the Kane family's crotchety lawyer and business manager. By that time his future as a cinema actor was assured and he went on to play character parts in a long string of Hollywood productions throughout the 1940s. At the end of the 1940s Coulouris returned to England, joining the Bristol Old Vic where he was notable as Tartuffe, transferring to London. In the '50s and '60s he remained a stalwart stage actor in spite of his movie reputation. He liked nothing better than to grapple with Henrik Ibsen, George Bernard Shaw, August Strindberg, Molière or William Shakespeare. During these years he tackled Dr. Stockman in Ibsen's \"An Enemy of the People\", Patrick Flynn in Sean O'Casey's \"The Plough and the Stars\", the father in Jean-Paul Sartre's \"Altona\", Edgar in Strindberg's \"The Dance of Death\" and Big Daddy in Tennessee Williams' \"Cat on a Hot Tin Roof\". All of these are parts to swell a scene and Coulouris had the flourish to fill them, sometimes to overflowing, always compellingly. In Britain his film parts tended towards the mundane, though he rose to the occasion as the native Babalatchi in Carol Reed's Outcast of the Islands (1951) and seized rare chances to play comedy in Doctor in the House (1954), Doctor at Sea (1955) and the Frankie Howerd vehicle The Runaway Bus (1954). Towards the end of his life he tried his hand at writing and produced some charming memoirs describing his early life in Manchester and his early stage experiences, as yet unpublished except for a vivid excerpt published in the Guardian newspaper in February 1986.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjVkY2YwYWQtYTM5Yi00MmJiLWIzNTItMmI0MzhiZDUzOGQ3XkEyXkFqcGdeQXVyMjUxODE0MDY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0183459","name":"George Coulouris","idIMDB":"nm0183459"},"actorId":"nm0183459","character":"Max Greene","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve Franken","urlProfile":"http://www.imdb.com/name/nm0291266","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NzEzMjAyNV5BMl5BanBnXkFtZTcwNjE3MDYzOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 May 1932","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Stephen Robert Franken","height":"5' 6\" (1.68 m)","bio":"Steve Franken was born on May 27, 1932 in Queens, New York City, New York, USA as Stephen Robert Franken. He was an actor, known for Angels & Demons (2009), Westworld (1973) and The Party (1968). He was married to Jean Garrett and Julia E. Carter. He died on August 24, 2012 in Canoga Park, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NzEzMjAyNV5BMl5BanBnXkFtZTcwNjE3MDYzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0291266","name":"Steve Franken","idIMDB":"nm0291266"},"actorId":"nm0291266","character":"Henry Maitland","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dean Jagger","urlProfile":"http://www.imdb.com/name/nm0415591","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1NzkxNDQ4MF5BMl5BanBnXkFtZTcwMzg0MjIyOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 November 1903","placeOfBirth":" Columbus Grove, Ohio, USA","birthName":"Ira Dean Jagger","height":"6' 2\" (1.88 m)","bio":"Dean Jagger was born in Lima, Ohio, on November 7, 1903. He dropped out of high school twice before finally graduating from Wabash College. Working first as a school teacher, he soon became interested in acting and enrolled at Chicago's \"Lyceum Art Conservatory\". Mr. Jagger made his first movie and only silent film, The Woman from Hell (1929) in 1929, starring Mary Astor. During 1929 he also appeared in the film Handcuffed (1929). He quickly found his niche as a character actor and the highlight of his career was winning an Oscar for \"Best Supporting Actor,\" in the 1949 movie Twelve O'Clock High (1949). Dean played Principal Albert Vane on TV for the 1963-1964 season of Mr. Novak (1963). Dean Jagger died in Santa Monica, California, on February 5, 1991.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg1NzkxNDQ4MF5BMl5BanBnXkFtZTcwMzg0MjIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0415591","name":"Dean Jagger","idIMDB":"nm0415591"},"actorId":"nm0415591","character":"Carl Webster","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tim O'Connor","urlProfile":"http://www.imdb.com/name/nm0640539","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MDU5NjAzMF5BMl5BanBnXkFtZTgwNDMzOTU1MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 July 1927","placeOfBirth":" Chicago, Illinois, USA","height":"5' 10\" (1.78 m)","bio":"Tim O'Connor was born on July 3, 1927 in Chicago, Illinois. Best known to viewers as Elliott Carson on the long-running television series Peyton Place (1964), he began his acting career with the Goodman Memorial Theatre in Chicago just after World War II. Moving to New York City in the early 1950s, he became one of television's busiest actors during the medium's dramatic coming-of-age. He appeared frequently on the The United States Steel Hour (1953) and became a mainstay of the \"Family Classics\" series, starring in such productions as \"The Three Musketeers\" and \"A Tale of Two Cities\". Until 1964, when \"Peyton Place\" became a runaway hit, O'Connor lived on an island in the center of Glen Wild Lake near Bloomingdale, New Jersey. He soon found that commuting between the East Coast and Los Angeles was too wearing, and moved to California. He settled in Santa Monica, a few short blocks from the Pacific Ocean, and established himself as one of filmdom's most versatile performers. O'Connor specialized in playing military officials and police officers. Some of his other best known roles include Dr. Elias Huer on Buck Rogers in the 25th Century (1979) and Jack Boland on General Hospital (1963). He also appeared in two episodes of the mystery television series \"Columbo\", starring Peter Falk as the rumpled detective. His credits included Wheels (1978), The Man with the Power (1977), Tail Gunner Joe (1977) and Murder in Peyton Place (1977) a TV special which reunited him with many of his co-stars in the original show. An avid sailor, O'Connor owns a 32-foot Pearson Vanguard sailboat and is studying both sailing to the waters off Mexico and Central America.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MDU5NjAzMF5BMl5BanBnXkFtZTgwNDMzOTU1MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0640539","name":"Tim O'Connor","idIMDB":"nm0640539"},"actorId":"nm0640539","character":"Dr. Revere","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jerry Douglas","urlProfile":"http://www.imdb.com/name/nm0235112","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMjYyNTg3Ml5BMl5BanBnXkFtZTYwNzQ1NjY1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 November 1932","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Gerald Rubenstein","bio":"Jerry Douglas was born on November 12, 1932 in Boston, Massachusetts, USA as Gerald Rubenstein. He is an actor, known for The Young and the Restless (1973), JFK (1991) and Mommie Dearest (1981). He has been married to Kym Douglas since April 6, 1985. They have one child. He was previously married to Arlene Martel.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMjYyNTg3Ml5BMl5BanBnXkFtZTYwNzQ1NjY1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0235112","name":"Jerry Douglas","idIMDB":"nm0235112"},"actorId":"nm0235112","character":"Steve Perry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arch Whiting","urlProfile":"http://www.imdb.com/name/nm0925990","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NTU5NTk3N15BMl5BanBnXkFtZTgwNjQ1NjU2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1936","placeOfBirth":" Larchmont, New York, USA","birthName":"Harold J. Archambault","bio":"Arch Whiting was born on September 29, 1936 in Larchmont, New York, USA as Harold J. Archambault. He was an actor, known for Voyage to the Bottom of the Sea (1964), Ordeal (1973) and The Stranger (1973). He died on May 7, 2007 in Black Mountain, North Carolina, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NTU5NTk3N15BMl5BanBnXkFtZTgwNjQ1NjU2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0925990","name":"Arch Whiting","idIMDB":"nm0925990"},"actorId":"nm0925990","character":"Mike Frome","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"H.M. Wynant","urlProfile":"http://www.imdb.com/name/nm0943894","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5ODk3NTM2Nl5BMl5BanBnXkFtZTYwNDM1NDgy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1927","placeOfBirth":" Detroit, Michigan, USA","birthName":"Haim Weiner","height":"6' (1.83 m)","bio":"H.M. Wynant's many-faceted career began at age 19 when he left his hometown of Detroit, Michigan, after having attended Wayne State University for just two years. He arrived in New York City with only $125 in his pocket and a lot of ambition. Jerome Robbins hired him on the spot at Wynant's first audition, an open call for the Broadway musical \"High Button Shoes\" starring Eddie Foy. H.M. was working as a draftsman and told Robbins that he had to go to work the next day, Robbins said, \"Then quit!\" Thus began a career in theater which included productions such as \"As You Like It\" with Katharine Hepburn, \"Love of Four Colonels\" starring Rex Harrison and Lilli Palmer, \"Venus Observed\" directed by Laurence Olivier, \"The Sound of Music\" with Shirley Jones and \"Teahouse of the August Moon\" starring David Wayne and John Forsythe. These performances garnered him many outstanding reviews and led to a prolific motion picture and television career. In 1956, RKO Pictures cast Wynant, based on his theatrical reputation, sight unseen, in a co-starring role of \"Crazy Wolf\" in the western, Run of the Arrow (1957). In those days, he was known as Haim Weiner, which was his given name. In New York, he had changed his name to Haim Winant, and the film's director, Samuel Fuller, changed it again to H.M. Wynant, and he's been known by that name ever since. Wynant was true to form as a wild Indian and performed many of his own stunts. A budding film career ensued. In addition to his theatrical career in New York and his film career in Hollywood, he became part of television history by appearing in many live, dramatic television shows. Recently, Wynant's Los Angeles stage performances included playing the lead role in \"Karlaboy\", a suspense ghost story written by screenwriter Steven Peros. Jules Aaron directed him in \"The Sisters Rosensweig\" and in \"Philadelphia Story\" and he continues his work in film, television, commercials, radio and voice-overs. H.M. is the proud father of three grown boys who also have successful show business careers: William Winant, a professor and avant-garde percussionist; Scott Winant, an Emmy-winning producer and director; and Bruce Winant, an actor and singer on Broadway as well as film and television. H.M. lives in Southern California with his wife, Paula, and their young daughter, Pasha (born in 2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5ODk3NTM2Nl5BMl5BanBnXkFtZTYwNDM1NDgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0943894","name":"H.M. Wynant","idIMDB":"nm0943894"},"actorId":"nm0943894","character":"Eric Stoner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Bryant","urlProfile":"http://www.imdb.com/name/nm0117252","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjQzOTQwMTgtYTJjMy00NzZhLWJjNDYtNDdjNTJjNDFmYzc4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 January 1924","placeOfBirth":" Detroit, Michigan, USA","birthName":"William Robert Klein","height":"5' 11\" (1.8 m)","bio":"William Bryant was born on January 31, 1924 in Detroit, Michigan, USA as William Robert Klein. He is known for his work on General Hospital (1963), The Great Race (1965) and King Dinosaur (1955). He was married to Patricia. He died on June 26, 2001 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjQzOTQwMTgtYTJjMy00NzZhLWJjNDYtNDdjNTJjNDFmYzc4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0117252","name":"William Bryant","idIMDB":"nm0117252"},"actorId":"nm0117252","character":"Truck Driver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Virginia Gregg","urlProfile":"http://www.imdb.com/name/nm0339615","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyNjA1NjgwMDJeQTJeQWpwZ15BbWU3MDIwNTU4MTg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1916","placeOfBirth":" Harrisburg, Illinois, USA","height":"5' 9\" (1.75 m)","bio":"Virginia Gregg was born on March 6, 1916 in Harrisburg, Illinois, USA. She was an actress, known for Operation Petticoat (1959), Love Is a Many-Splendored Thing (1955) and Calvin and the Colonel (1961). She was married to Jaime Del Valle. She died on September 15, 1986 in Encino, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyNjA1NjgwMDJeQTJeQWpwZ15BbWU3MDIwNTU4MTg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0339615","name":"Virginia Gregg","idIMDB":"nm0339615"},"actorId":"nm0339615","character":"Ward E Administrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steven Marlo","urlProfile":"http://www.imdb.com/name/nm0549194","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MTMzMjk4M15BMl5BanBnXkFtZTcwNDE4MTIzMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1927","placeOfBirth":" San Francisco, California, USA","bio":"Steven Marlo was born on July 13, 1927 in San Francisco, California, USA. He is known for his work on The Young Captives (1959), W.I.A. Wounded in Action (1966) and The Slender Thread (1965).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MTMzMjk4M15BMl5BanBnXkFtZTcwNDE4MTIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0549194","name":"Steven Marlo","nicknames":["Mo"],"idIMDB":"nm0549194"},"actorId":"nm0549194","character":"Guard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ben Wright","urlProfile":"http://www.imdb.com/name/nm0942220","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MmZlMjAtMzczMS00ZjQ4LWJiYzktOTBhZTY4NTQ1ODdmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1915","placeOfBirth":" London, England, UK","birthName":"Benjamin Huntington Wright","bio":"Ben Wright was born May 15, 1915, to an English mother and an American father in London, England, UK. At 16, he entered the Royal Academy of Dramatic Arts where classmates included such future stars as Ida Lupino. Upon graduating, he acted in several West End stage productions. When WWII broke out, he enlisted and served in the Kings Royal Rifle Corps. He came to America in 1946 to attend a cousin's wedding and settled in Hollywood. He began his American acting career in radio, establishing himself as a master of dialects with such roles as Hey Boy, the Chinese servant, on \"Have Gun, Will Travel\" with John Dehner. His talent for dialects also kept him busy in the many WWII-related films and TV shows of the 1950s and '60s wherein he played countless Germans and Frenchmen as well as a variety of Englishmen for which he ensured the dialects were accurate depending on which part of England they were from. After years of radio, TV, stage and film work, he entered semi-retirement in the late 1970s, accepting occasional voice work and small guest appearances on TV. On June 16, 1989, after completing his last role, providing the voice of Grimsby in Disney's The Little Mermaid (1989), he entered St. Joseph's Hospital in Burbank for quadruple bypass surgery from which he never recovered. He died of heart failure July 2, 1989.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3MmZlMjAtMzczMS00ZjQ4LWJiYzktOTBhZTY4NTQ1ODdmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0942220","name":"Ben Wright","idIMDB":"nm0942220"},"actorId":"nm0942220","character":"Doctor","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0070742","urlIMDB":"http://www.imdb.com/title/tt0070742","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 40 min (100 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"3.4","filmingLocations":[],"awards":[],"votes":"386","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0058998","name":"Bing Crosby Productions"},{"idCompany":"co0111881","name":"Fenady Associates"}],"keywords":{"keywords":["astronaut","orwellian","alternate reality","duplicate earth","space probe","parallel world","on the run","free speech","dictatorship","crash landing","unsold tv series pilot"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:23:35"}}