{"data":{"movies":[{"title":"Crackers","originalTitle":"","year":"1984","releaseDate":"19840217","directors":[{"name":"Louis Malle","id":"nm0001501"}],"writers":[{"name":"Jeffrey Alan Fiskin","id":"nm0279971"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3ODEyNzUxNF5BMl5BanBnXkFtZTcwMjUwMzk1Mw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Adventure","Comedy","Crime","Thriller"],"plot":"Garvey is a San Francisco pawnshop operator. His unemployed and criminal friends Dillard, Turtle, and Weslake, team up with Boardwalk, a local pimp, to burgle Garvey's shop while the owner is out of town. During the elaborate planning process, Dillard falls for a Hispanic woman, the sister of a friend. Also, Boardwalk is assigned to case a local apartment, where he meets and falls for the maid. Amidst all these romantic hijinks, Weslake puts together a burglary plan, which is executed by the makeshift gang.","simplePlot":"Garvey is a San Francisco pawnshop operator. His unemployed and criminal friends Dillard, Turtle, and Weslake, team up with Boardwalk, a local pimp, to burgle Garvey's shop while the owner ... ","actors":[{"actorName":"Donald Sutherland","urlProfile":"http://www.imdb.com/name/nm0000661","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MDI1NzcyMl5BMl5BanBnXkFtZTcwOTk0MjQwOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1935","placeOfBirth":" Saint John, New Brunswick, Canada","birthName":"Donald McNichol Sutherland","height":"6' 4\" (1.93 m)","bio":"The towering presence of Canadian actor Donald Sutherland is often noticed, as are his legendary contributions to cinema. He has appeared in almost 200 different shows and films. He is also the father of renowned actor Kiefer Sutherland, among others. Donald McNichol Sutherland was born in Saint John, New Brunswick, to Dorothy Isobel (McNichol) and Frederick McLea Sutherland, who worked in sales and electricity. He has Scottish, as well as German and English, ancestry. Sutherland worked several different jobs - he was a radio DJ in his youth - and was almost set on becoming an engineer after graduating from the University of Toronto with a degree in engineering. However, he also graduated with a degree in drama, and he chose to abandon becoming an engineer in favour of an actor. Sutherland's first roles were bit parts and consisted of such films as the horror film Dr. Terror's House of Horrors (1965) which starred Christopher Lee. He was also appearing in episodes of TV shows such as \"The Saint\" and \"Court Martial\". Sutherland's break would come soon, though, and it would come in the form of a war film in which he was barely cast. The reason he was barely cast was because he had been a last-minute replacement for an actor that had dropped out of the film. The role he played was that of the dopey but loyal Vernon Pinkley in the war film The Dirty Dozen (1967). The film also starred Lee Marvin, Charles Bronson, and Telly Savalas. The picture was an instant success as an action/war film, and Sutherland played upon this success by taking another role in a war film: this was, however, a comedy called MASH (1970) which landed Sutherland the starring role alongside Elliott Gould and Tom Skerritt. This is now considered a classic among film goers, and the 35-year old actor was only getting warmed up. Sutherland took a number of other roles in between these two films, such as the theatrical adaptation Oedipus the King (1968), the musical Joanna (1968) and the Clint Eastwood-helmed war comedy Kelly's Heroes (1970). It was Kelly's Heroes (1970) that became more well-known, and it reunited Sutherland with Telly Savalas. 1970 and 1971 offered Sutherland a number of other films, the best of them would have to be Klute (1971). The film, which made Jane Fonda a star, is about a prostitute whose friend is mysteriously murdered. Sutherland received no critical acclaim like his co-star Fonda (she won an Oscar) but his career did not fade. Moving on from Klute (1971), Sutherland landed roles such as the lead in the thriller Lady Ice (1973), and another lead in the western Alien Thunder (1974). These films did not match up to \"Klute\"'s success, though Sutherland took a supporting role that would become one of his most infamous and most critically acclaimed. He played the role of the murderous fascist leader in the Bernardo Bertolucci Italian epic 1900 (1976). Sutherland also gained another memorable role as a marijuana-smoking university professor in Animal House (1978) among other work that he did in this time. Another classic role came in the form of the Robert Redford film, Ordinary People (1980). Sutherland portrays an older father figure who must deal with his children in an emotional drama of a film. It won Best Picture, and while both the supporting stars were nominated for Oscars, Sutherland once again did not receive any Academy Award nomination. He moved on to play a Nazi spy in a film based on Ken Follett's book \"Eye of the Needle\" and he would star alongside Al Pacino in the commercial and critical disaster that was Revolution (1985). While it drove Al Pacino out of films for four years, Sutherland continued to find work. This work led to the dramatic, well-told story of apartheid A Dry White Season (1989) alongside the legendary actor Marlon Brando. Sutherland's next big success came in the Oliver Stone film JFK (1991) where Sutherland plays the chilling role of Mister X, an anonymous source who gives crucial information about the politics surrounding President Kennedy. Once again, he was passed over at the Oscars, though Tommy Lee Jones was nominated for his performance as Clay Shaw. Sutherland went on to appear in Buffy the Vampire Slayer (1992), Shadow of the Wolf (1992), and Disclosure (1994). The new millennium provided an interesting turn in Sutherland's career: reuniting with such former collaborators as Clint Eastwood and Tommy Lee Jones, Sutherland starred in Space Cowboys (2000). He also appeared as the father figure to Nicole Kidman's character in Cold Mountain (2003) and Charlize Theron's character in The Italian Job (2003). He has also made a fascinating, Oscar-worthy performance as the revolutionist Mr. Thorne in Land of the Blind (2006) and also as a judge in Reign Over Me (2007). Recently, he has joined forces with his son Rossif Sutherland and Canadian comic [error] with the new comedy The Con Artist (2010), as well as acting alongside Jamie Bell and Channing Tatum in the sword-and-sandal film The Eagle (2011). Sutherland has also taken a role in the remake of Charles Bronson's film The Mechanic (1972). Donald Sutherland has made a lasting legacy on Hollywood, whether portraying a chilling and horrifying villain, or playing the older respectable character in his films. A true character actor, Sutherland is one of Canada's most well-known names and will hopefully continue on being so long after his time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MDI1NzcyMl5BMl5BanBnXkFtZTcwOTk0MjQwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000661","name":"Donald Sutherland","idIMDB":"nm0000661"},"actorId":"nm0000661","character":"Weslake","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Warden","urlProfile":"http://www.imdb.com/name/nm0912001","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1Mjk3Njc5MV5BMl5BanBnXkFtZTcwMDk2MzUzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1920","placeOfBirth":" Newark, New Jersey, USA","birthName":"John Warden Lebzelter Jr.","height":"5' 10½\" (1.79 m)","bio":"Jack Warden was born John Warden Lebzelter, Jr. on September 18, 1920 in Newark, New Jersey, to Laura M. (Costello) and John Warden Lebzelter. His father was of German and Irish descent, and his mother was of Irish ancestry. Raised in Louisville, Kentucky, at the age of seventeen, young Jack Lebzelter was expelled from Louisville's DuPont Manual High School for repeatedly fighting. Good with his fists, he turned professional, boxing as a welterweight under the name \"Johnny Costello\", adopting his mother's maiden name. The purses were poor, so he soon left the ring and worked as a bouncer at a night club. He also worked as a lifeguard before signing up with the U.S. Navy in 1938. He served in China with the Yangtzee River Patrol for the best part of his three-year hitch before joining the Merchant Marine in 1941. Though the Merchant Marine paid better than the Navy, Warden was dissatisfied with his life aboard ship on the long convoy runs and quit in 1942 in order to enlist in the U.S. Army. He became a paratrooper with the elite 101st Airborne Division, and missed the June 1944 invasion of Normandy due to a leg badly broken by landing on a fence during a nighttime practice jump shortly before D-Day. Many of his comrades lost their lives during the Normandy invasion, but the future Jack Warden was spared that ordeal. Recuperating from his injuries, he read a play by Clifford Odets given to him by a fellow soldier who was an actor in civilian life. He was so moved by the play, he decided to become an actor after the war. After recovering from his badly shattered leg, Warden saw action at the Battle of the Bulge, Nazi Germany's last major offensive. He was demobilized with the rank of sergeant and decided to pursue an acting career on the G.I. Bill. He moved to New York City to attend acting school, then joined the company of Theatre '47 in Dallas in 1947 as a professional actor, taking his father's middle name as his surname. This repertory company, run by Margo Jones, became famous in the 1940s and '50s for producing 'Tennesse Williams''s plays. The experience gave him a valuable grounding in both classic and contemporary drama, and he shuttled between Texas and New York for five years as he was in demand as an actor. Warden made his television debut in 1948, though he continued to perform on stage (he appeared in a stage production in Arthur Miller's Death of a Salesman (1966)). After several years in small, local productions, he made both his Broadway debut in the 1952 Broadway revival of Odets' \"Golden Boy\" and, three years later, originated the role of \"Marco\" in the original Broadway production of Miller's \"A View From the Bridge\". On film, he and fellow World War II veteran, Lee Marvin (Marine Corps, South Pacific), made their debut in You're in the Navy Now (1951) (a.k.a. \"U.S.S. Teakettle\"), uncredited, along with fellow vet Charles Bronson, then billed as \"Charles Buchinsky\". With his athletic physique, he was routinely cast in bit parts as soldiers (including the sympathetic barracks-mate of Montgomery Clift and Frank Sinatra in the Oscar-winning From Here to Eternity (1953). He played the coach on TV's Mister Peepers (1952) with Wally Cox. Aside from From Here to Eternity (1953) (The Best Picture Oscar winner for 1953), other famous roles in the 1950s included Juror #7 (a disinterested salesman who wants a quick conviction to get the trial over with) in 12 Angry Men (1957) - a film that proved to be his career breakthrough - the bigoted foreman in Edge of the City (1957) and one of the submariners commended by Clark Gable and Burt Lancaster in the World War II drama, Run Silent Run Deep (1958). In 1959, Warden capped off the decade with a memorable appearance in The Twilight Zone (1959) episode, The Twilight Zone: The Lonely (1959), in the series premier year of 1959. As \"James Corry\", Warden created a sensitive portrayal of a convicted felon marooned on an asteroid, sentenced to serve a lifetime sentence, who falls in love with a robot. It was a character quite different from his role as Juror #7. In the 1960s and early 70s, his most memorable work was on television, playing a detective in The Asphalt Jungle (1961), The Wackiest Ship in the Army (1965) and N.Y.P.D. (1967). He opened up the decade of the 1970s by winning an Emmy Award playing football coach \"George Halas\" in Brian's Song (1971), the highly-rated and acclaimed TV movie based on Gale Sayers's memoir, \"I Am Third\". He appeared again as a detective in the TV series, Jigsaw John (1976), in the mid-1970s, The Bad News Bears (1979) and appeared in a pilot for a planned revival of Topper (1937) in 1979. His collaboration with Warren Beatty in two 1970s films brought him to the summit of his career as he displayed a flair for comedy in both Shampoo (1975) and Heaven Can Wait (1978). As the faintly sinister businessman \"Lester\" and as the perpetually befuddled football trainer \"Max Corkle\", Warden received Academy Award nominations as Best Supporting Actor. Other memorable roles in the period were as the metro news editor of the \"Washington Post\" in All the President's Men (1976), the German doctor in Death on the Nile (1978), the senile, gun-toting judge in ...and justice for all. (1979), the President of the United States in Being There (1979), the twin car salesmen in Used Cars (1980) and Paul Newman's law partner in The Verdict (1982). This was the peak of Warden's career, as he entered his early sixties. He single-handedly made Andrew Bergman's So Fine (1981) watchable, but after that film, the quality of his roles declined. He made a third stab at TV, again appearing as a detective in Crazy Like a Fox (1984) in the mid-1980s. He played the shifty convenience store owner \"Big Ben\" in Problem Child (1990) and its two sequels, a role unworthy of his talent, but he shone again as the Broadway high-roller \"Julian Marx\" in Woody Allen's Bullets Over Broadway (1994). After appearing in Warren Beatty's Bulworth (1998), Warden's last film was The Replacements (2000) in 2000. He then lived in retirement in New York City with his girlfriend, Marucha Hinds. He was married to French stage actress Wanda Ottoni, best known for her role as the object of Joe Besser's desire in The Three Stooges short, Fifi Blows Her Top (1958). She gave up her career after her marriage. They had one son, Christopher, but separated several years ago.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1Mjk3Njc5MV5BMl5BanBnXkFtZTcwMDk2MzUzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0912001","name":"Jack Warden","idIMDB":"nm0912001"},"actorId":"nm0912001","character":"Garvey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sean Penn","urlProfile":"http://www.imdb.com/name/nm0000576","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NjMzMjY3NF5BMl5BanBnXkFtZTcwMzkxNjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1960","placeOfBirth":" Santa Monica, California, USA","birthName":"Sean Justin Penn","height":"5' 8\" (1.73 m)","bio":"Sean Penn is a powerhouse film performer capable of intensely moving work, who has gone from strength to strength during a colourful film career, and who has drawn much media attention for his stormy private life and political viewpoints. Sean Justin Penn was born in Los Angeles, California, the second son of actress Eileen Ryan (née Annucci) and director, actor, and writer Leo Penn. His brother was actor Chris Penn. His father was from a Lithuanian Jewish/Russian Jewish family, and his mother is of half Italian and half Irish descent. Penn first appeared in roles as strong-headed or unruly youths such as the military cadet defending his academy against closure in Taps (1981), then as fast-talking surfer stoner Jeff Spicoli in Fast Times at Ridgemont High (1982). Fans and critics were enthused about his obvious talent and he next contributed a stellar performance alongside Timothy Hutton in the Cold War spy thriller The Falcon and the Snowman (1985), followed by a teaming with icy Christopher Walken in the chilling At Close Range (1986). The youthful Sean then paired up with his then wife, pop diva Madonna in the woeful, and painful, Shanghai Surprise (1986), which was savaged by the critics, but Sean bounced back with a great job as a hot-headed young cop in Colors (1988), gave another searing performance as a US soldier in Vietnam committing atrocities in Casualties of War (1989) and appeared alongside Robert De Niro in the uneven comedy We're No Angels (1989). However, the 1990s was the decade in which Sean really got noticed by critics as a mature, versatile and accomplished actor, with a string of dynamic performances in first-class films. Almost unrecognisable with frizzy hair and thin rimmed glasses, Penn was simply brilliant as corrupt lawyer David Kleinfeld in the Brian De Palma gangster movie Carlito's Way (1993) and he was still in trouble with authority as a Death Row inmate pleading with a caring nun to save his life in Dead Man Walking (1995), for which he received his first Oscar nomination. Sean then played the brother of wealthy Michael Douglas, involving him in a mind-snapping scheme in The Game (1997) and also landed the lead role of Sgt. Eddie Walsh in the star-studded anti-war film The Thin Red Line (1998), before finishing the 1990s playing an offbeat jazz musician (and scoring another Oscar nomination) in Sweet and Lowdown (1999). The gifted and versatile Sean had also moved into directing, with the quirky but interesting The Indian Runner (1991), about two brothers with vastly opposing views on life, and in 1995 he directed Jack Nicholson in The Crossing Guard (1995). Both films received overall positive reviews from critics. Moving into the new century, Sean remained busy in front of the cameras with even more outstanding work: a mentally disabled father fighting for custody of his seven-year-old daughter (and receiving a third Oscar nomination) for I Am Sam (2001); an anguished father seeking revenge for his daughter's murder in the gut-wrenching Clint Eastwood-directed Mystic River (2003) (for which he won the Oscar as Best Actor); a mortally ill college professor in 21 Grams (2003) and a possessed businessman in The Assassination of Richard Nixon (2004). Certainly Sean Penn is one of Hollywood's most controversial, progressive and gifted actors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NjMzMjY3NF5BMl5BanBnXkFtZTcwMzkxNjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000576","name":"Sean Penn","idIMDB":"nm0000576"},"actorId":"nm0000576","character":"Dillard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wallace Shawn","urlProfile":"http://www.imdb.com/name/nm0001728","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDYzMDQ1OF5BMl5BanBnXkFtZTcwMDQ3OTc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 November 1943","placeOfBirth":" New York City, New York, USA","birthName":"Wallace Michael Shawn","height":"5' 2\" (1.57 m)","bio":"American character actor and writer Wallace Shawn has one of those fun, mischievously homely faces just made to entertain. Though he got out of the starting gate rather slowly, he has since excelled on stage, television and film while managing to turn himself into a winner with his loser-type looks. Woody Allen's character in the movie Manhattan (1979) amusingly describes Wallace's character as \"a homunculus\", which is a pretty fair description of this predominantly bald, wan, pucker-mouthed, butterball-framed, slightly lisping gent. Wallace made his movie debut in Allen's heralded classic playing Diane Keaton's ex-husband. Born to privilege on November 12, 1943 in New York City, Wallace was the son of renowned editor William Shawn of \"The New Yorker\" fame and educated at both Harvard University, where he studied history, and Magdalen College, Oxford. Wallace initially taught English in India on a Fulbright scholarship, and then English, Latin and drama back in New York. However, a keen interest in writing and acting soon compelled him to leave his cushy position and pursue a stage career as both playwright and actor. During his distinguished career, Wallace turned out several plays. \"Our Late Night\", the first of his works to be performed, was awarded an off-Broadway Obie in 1975. \"A Thought in Three Parts\" (1976); \"The Mandrake\" (1977), which he translated from the original Italian and in which he made his acting debut; \"Marie and Bruce\" (1979); \"Aunt Dan and Lemon\" (1985) and \"The Fever\", for which he received his second Obie Award for \"Best New Play\" during the 1990-91 season, then followed. A popular support player in both comedy and occasional drama, his assorted kooks, creeps, eggheads and schmucks possessed both endearing and unappetizing qualities. He earned some of his best early notices partnered with theatre director/actor Andre Gregory in the unique Louis Malle-directed film My Dinner with Andre (1981). Shawn co-wrote the improvisatory, humanistic piece and his brother, Allen Shawn, was the composer. Shawn and Gregory would collaborate again for Malle in another superb, original-concept film Vanya on 42nd Street (1994). Among the quality offbeat filming involving has been Bruce Paltrow's A Little Sex (1982); James Ivory's The Bostonians (1984); Stephen Frears' Prick Up Your Ears (1987); Rob Reiner's The Princess Bride (1987); Alan Rudolph's The Moderns (1988) and Mrs. Parker and the Vicious Circle (1994); Paul Bartel's Scenes from the Class Struggle in Beverly Hills (1989); and several others for Woody Allen: Radio Days (1987), Shadows and Fog (1991), The Curse of the Jade Scorpion (2001) and Melinda and Melinda (2004). Of late, he has lent his vocal talents to a considerable number of animated pictures including A Goofy Movie (1995), Toy Story (1995) (and its sequel), The Jungle Book: Mowgli's Story (1998), The Incredibles (2004), Chicken Little (2005) and Happily N'Ever After (2006). Over the decades, Shawn has scurried about effortlessly in a number of television guest appearances including Taxi (1978), Homicide: Life on the Street (1993), Ally McBeal (1997), Law & Order: Criminal Intent (2001) and Desperate Housewives (2004), and has drummed up a few recurring roles for himself in the process, including The Cosby Show (1984), Murphy Brown (1988), Star Trek: Deep Space Nine (1993) and Crossing Jordan (2001). In the series Clueless (1996), based on the highly successful of the same name Clueless (1995), Shawn revisited his role as the owlish high school teacher.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDYzMDQ1OF5BMl5BanBnXkFtZTcwMDQ3OTc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001728","name":"Wallace Shawn","idIMDB":"nm0001728"},"actorId":"nm0001728","character":"Turtle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larry Riley","urlProfile":"http://www.imdb.com/name/nm0727104","urlPhoto":"","biography":{"dateOfBirth":"20 June 1952","placeOfBirth":" Memphis, Tennessee, USA","birthName":"Larry Dobie Riley","bio":"Larry D Riley was born June 20 1952. He is the son of George C Bass Sr and Corrine Riley. He started acting around 1975. He moved to New York and was in a lot of plays. He was cremated and ashes where spread on the beach in Malibu, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0727104","name":"Larry Riley","idIMDB":"nm0727104"},"actorId":"nm0727104","character":"Boardwalk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Trinidad Silva","urlProfile":"http://www.imdb.com/name/nm0798534","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4OTMzNzM4NF5BMl5BanBnXkFtZTcwODAxNDkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 January 1950","placeOfBirth":" Mission, Texas, USA","birthName":"Trinidad Silva Jr.","bio":"Trinidad Silva was born on January 30, 1950 in Mission, Texas, USA as Trinidad Silva Jr. He was an actor, known for UHF (1989), Colors (1988) and The Jerk (1979). He was married to Sofia Alvarez. He died on July 31, 1988 in Whittier, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4OTMzNzM4NF5BMl5BanBnXkFtZTcwODAxNDkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0798534","name":"Trinidad Silva","idIMDB":"nm0798534"},"actorId":"nm0798534","character":"Ramon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christine Baranski","urlProfile":"http://www.imdb.com/name/nm0004724","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTYwMDUyM15BMl5BanBnXkFtZTcwNTk1MzQxMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 May 1952","placeOfBirth":" Buffalo, New York, USA","birthName":"Christine Jane Baranski","height":"5' 8½\" (1.74 m)","bio":"Christine Baranski was born on May 2, 1952 in Buffalo, New York, USA as Christine Jane Baranski. She is an actress, known for The Good Wife (2009), How the Grinch Stole Christmas (2000) and Cybill (1995). She was previously married to Matthew Cowles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTYwMDUyM15BMl5BanBnXkFtZTcwNTk1MzQxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004724","name":"Christine Baranski","idIMDB":"nm0004724"},"actorId":"nm0004724","character":"Maxine","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charlayne Woodard","urlProfile":"http://www.imdb.com/name/nm0940128","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4OTAzNDExN15BMl5BanBnXkFtZTYwNDkyMjky._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1953","placeOfBirth":" Albany, New York, USA","bio":"Charlayne Woodard was born on December 29, 1953 in Albany, New York, USA. She is an actress, known for Unbreakable (2000), The Crucible (1996) and The Million Dollar Hotel (2000). She has been married to Alan Michael Harris since 1991.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4OTAzNDExN15BMl5BanBnXkFtZTYwNDkyMjky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0940128","name":"Charlayne Woodard","idIMDB":"nm0940128"},"actorId":"nm0940128","character":"Jasmine","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tasia Valenza","urlProfile":"http://www.imdb.com/name/nm0884419","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNDEwMjM0OF5BMl5BanBnXkFtZTgwMjMwMDg3MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 April 1967","placeOfBirth":" New York City, New York, USA","bio":"Tasia Valenza was born on April 5, 1967 in New York City, New York, USA. She is an actress, known for Batman: Arkham Asylum (2009), Batman: Arkham City (2011) and Sometimes They Come Back (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNDEwMjM0OF5BMl5BanBnXkFtZTgwMjMwMDg3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0884419","name":"Tasia Valenza","idIMDB":"nm0884419"},"actorId":"nm0884419","character":"Maria","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Irwin Corey","urlProfile":"http://www.imdb.com/name/nm0179782","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGU1NGRiMjEtM2U2Ny00OTY2LWJlNWItYzI1YmMzNGQ2ZDk2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1914","placeOfBirth":" Brooklyn, New York, USA","bio":"Professor Irwin Corey, \"The World's Foremost Authority,\" was born on July 29, 1914, in Brooklyn, New York. He and his five siblings were wards of the Brooklyn Hebrew Orphan Asylum, and during the Great Depression, he worked for the Civilian Conservation Corp. Possessing brawn as well as brains, Professor Irwin Corey is proud to tell anyone who will listen that he was the C.C.C.'s boxing champ in the 112-pound weight class. Before becoming certified (as a professor purveying the surreal), the young Irwin caught the performing bug by appearing in a borscht belt show, \"Pots and Pans,\" in a bit part. He made his debut in a musical comedy in a U.S.O. presentation of \"Oklahoma\" in Europe, in which he played the part of the Arab peddler Ali Hakim. Perfecting his crazy professor shtick, who always appeared in an old-fashioned tuxedo with tails like Groucho Marx, Corey broke through as a stand-up comic at San Francisco's \"hungry i\" and New York City's Copacabana and Village Vanguard nightclubs. His lectures, characterized by a constant barrage of non-sequitors and double-talk, were rooted in the word-play epitomized by Groucho Marx and Chico Marx in such classic routines as \"Why a Duck?\" However, whatever \"logic\" The Marx Brothers might display (at least in exasperated double takes by Groucho) was missing in the Professor's shtick. Before the Talking Heads ever sang about it, Professor Irwin Corey made an art form out of \"Stop Making Sense.\" Theater critic Kenneth Tynan said of the Professor, \"[Corey is] a cultural clown, a parody of literacy, a travesty of all that our civilization holds dear and one of the funniest grotesques in America. He is Chaplin's clown with a college education.\" Corey thrived on the radio, memorably appearing on Edgar Bergen's radio show as a tutor to Charlie McCarthy. Television was another natural medium for the professor, and he appeared as a regular on The Jackie Gleason Show (1952) and also made the rounds of the talk show circuit of the 1950s, '60s and '70s, appearing with 'Steve Allen', Jack Paar, Johnny Carson, Dick Cavett, Merv Griffin, and Mike Douglas. He also was on \"The Ed Sullivan Show\" (aka The Ed Sullivan Show (1948)) as well as appeared with the new lessor of the Ed Sullivan Theater, David Letterman. Irwin Corey also has appeared on Broadway, in \"Heaven on Earth,\" \"Happy as Larry,\" \"Fla-hooley,\" and \"Mrs. McThing,\" as well as recent productions of \"The Taming of the Shrew\" and \"Hamlet.\" Off-Broadway, he appeared as the eponymous lead in \"The Good Soldier Schweik\" and as Marlo Thomas' father in Herb Gardner's play \"Thieves,\" reprising the role in the film (Thieves (1977)). He also appeared in numerous episodes of series television, including The Andy Griffith Show (1960), \"Doc\" (with Barnard Hughes), The Smothers Brothers Comedy Hour (1967), and Pat Paulsen's Half a Comedy Hour (1970). The Professor's last film was Woody Allen's The Curse of the Jade Scorpion (2001). At 91, and still going strong, Professor Irwin Corey truly is the dean of stand-up comedians, if not quite at the head of his class.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGU1NGRiMjEtM2U2Ny00OTY2LWJlNWItYzI1YmMzNGQ2ZDk2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0179782","name":"Irwin Corey","nicknames":["The World's Foremost Authority"],"idIMDB":"nm0179782"},"actorId":"nm0179782","character":"Lazzarelli","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edouard DeSoto","urlProfile":"http://www.imdb.com/name/nm0221551","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3ODc1OTA4MV5BMl5BanBnXkFtZTcwNjM3NDc1MQ@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1941","placeOfBirth":" Santa Isabel, Puerto Rico","bio":"Edouard DeSoto was born on June 13, 1941 in Santa Isabel, Puerto Rico. He is an actor, known for Jumpin' Jack Flash (1986), Crackers (1984) and The Blue Diner (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3ODc1OTA4MV5BMl5BanBnXkFtZTcwNjM3NDc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0221551","name":"Edouard DeSoto","idIMDB":"nm0221551"},"actorId":"nm0221551","character":"Don Fernando","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anna Maria Horsford","urlProfile":"http://www.imdb.com/name/nm0395428","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyODkyNjkxN15BMl5BanBnXkFtZTcwODc3MDczMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1948","placeOfBirth":" New York City, New York, USA","height":"5' 8\" (1.73 m)","bio":"Anna Maria Horsford was born and raised in Harlem, New York. Her parents immigrated to the United States from the island nation Antigua & Barbuda, in the West Indies (then a British colony), during the 1940s. Anna grew up not really feeling American but not West Indian either, just somewhere in between. However, she vacationed in the Caribbean, and this stoked her desire to see the world. After high school she went to Stockholm, Sweden, to attend college. Her mother always knew Anna would be something big because she was very talkative, and kept Anna enrolled in community centers, after-school programs, church events, etc. She auditioned for the New York High School of Performing Arts and was accepted. As she recollects, \"My first big break came when I auditioned at the New York Shakespeare Festival.\" Working in many different aspects of show business has allowed her to venture into areas other than acting, such as directing. She also has an Art Institute in upstate New York. Her father was a Garveyite (following the \"back-to-Africa\" teachings of Marcus Garvey), journeyed to Africa and lived in Liberia for five years. As Anna said, \"He clearly taught us to love being black and not be ashamed of being black. We are all warriors and have to work to do.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyODkyNjkxN15BMl5BanBnXkFtZTcwODc3MDczMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0395428","name":"Anna Maria Horsford","idIMDB":"nm0395428"},"actorId":"nm0395428","character":"Slam Dunk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mitchell Lichtenstein","urlProfile":"http://www.imdb.com/name/nm0509033","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MjgzOTU2MV5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 March 1956","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Mitchell Wilson Lichtenstein","bio":"Mitchell Lichtenstein was born on March 10, 1956 in Cleveland, Ohio, USA as Mitchell Wilson Lichtenstein. He is an actor and director, known for Teeth (2007), The Wedding Banquet (1993) and Streamers (1983).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MjgzOTU2MV5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0509033","name":"Mitchell Lichtenstein","idIMDB":"nm0509033"},"actorId":"nm0509033","character":"Artiste","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marjorie Eaton","urlProfile":"http://www.imdb.com/name/nm0247856","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2YzNTNlNjYtNWE1Yy00M2QwLTliZDctOWQ0ZmQ4OGM3NjdhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1901","placeOfBirth":" San Francisco, California, USA","birthName":"Marjorie Lee Eaton","bio":"Marjorie Eaton was born on February 5, 1901 in San Francisco, California, USA as Marjorie Lee Eaton. She was an actress, known for Mary Poppins (1964), Monstrosity (1963) and The Trouble with Angels (1966). She died on April 21, 1986 in Hollywood, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2YzNTNlNjYtNWE1Yy00M2QwLTliZDctOWQ0ZmQ4OGM3NjdhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0247856","name":"Marjorie Eaton","idIMDB":"nm0247856"},"actorId":"nm0247856","character":"Mrs. O'Malley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ed Call","urlProfile":"http://www.imdb.com/name/nm0130092","urlPhoto":"","biography":{"bio":"Ed Call was an actor, known for A Nightmare on Elm Street (1984), Walking Tall (1973) and Airplane II: The Sequel (1982). He died on July 2, 2012 in Salem, Oregon, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0130092","name":"Ed Call","idIMDB":"nm0130092"},"actorId":"nm0130092","character":"Officer Darney","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0087096","urlIMDB":"http://www.imdb.com/title/tt0087096","business":{"budget":null,"openingWeekend":[{"money":"$58,689","country":"USA","day":"20","month":"02","year":"1984","remarks":"21 Screens"}],"gross":[{"money":"$58,689","country":"USA","day":"20","month":"02","year":"1984","remarks":""}],"weekendGross":[{"money":"$58,689","country":"USA","day":"20","month":"02","year":"1984","remarks":"21 Screens"}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"02","month":"11","year":"1982","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 31 min (91 min)"],"soundMix":["Mono"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panaflex Camera and Lenses by Panavision"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.1","filmingLocations":[{"location":"San Francisco, California, USA"}],"rated":"PG","awards":[{"award":"Berlin International Film Festival 1984","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Berlin Bear","categories":[{"category":"","names":[{"name":"Louis Malle","id":"nm0001501","role":null}]}]}]}],"votes":"976","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"}],"keywords":{"keywords":["pimp","gang","pawnshop","burglary","friendship","petty criminal","mexican american","pseudonym","racial slur","ne'er do well","traffic cop","short man","bar","1980s","pervert","working class","unemployment","thief","theft","sidekick","safecracker","robbery","prostitute","pawnbroker","mission district san francisco","love","illegal alien","foreign language adaptation","ethnic stereotype","buddy","brother sister relationship","black american","baby","aspiring musician","one word title","remake of italian film","san francisco california","safe","gay couple","burglar alarm","botched crime","african american","caper","remake"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:01:26"}}