{"data":{"movies":[{"title":"That Ragtime Band","originalTitle":"","year":"1913","releaseDate":"19130501","directors":[{"name":"Mack Sennett","id":"nm0784407"}],"writers":[],"runtime":"10 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNTM1NTg2M15BMl5BanBnXkFtZTcwMTE3NzQyMw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Short","Comedy"],"plot":"Band leader/clarinetist Ford Sterling is a romantic rival to trumpeter Raymond Hatton for the affections of pretty Mabel Normand. Sterling enters an amateur night contest at the local vaudeville house, where stage manager Edgar Kennedy gives the quick hook to most of the lame acts. Hatton positions himself in the audience across from Mabel and leads his fellow hecklers in taunting Sterling. Hatton's arsenal contains half-rotten fruits and vegetables which he throws at the haplessly helpless Sterling with amazing accuracy. Finally he heaves a pie that has managed to keep hidden under his jacket, and it glances off clarinetist. Attempting to return fire, Sterling errantly hits Mabel square in the chops with the pastry. The angry recipient of the first thrown pie the face in movie history enthusiastically joins the rest of the audience in throwing anything and everything at the band leader, who has lost the girl but gained the hook.","simplePlot":"Professor Smelts the band leader gets into a romantic rivalry with one of his musicians over the affections of a pretty girl.","actors":[{"actorName":"Ford Sterling","urlProfile":"http://www.imdb.com/name/nm0827509","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMTgzNDM4MV5BMl5BanBnXkFtZTgwMDkzODE1MzE@._V1._CR140,177,717,957_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1883","placeOfBirth":" La Crosse, Wisconsin, USA","birthName":"George Ford Stich","bio":"Ford Sterling was born on November 3, 1883 in La Crosse, Wisconsin, USA as George Ford Stich. He was an actor and director, known for Tango Tangle (1914), Between Showers (1914) and The Show Off (1926). He was married to Teddy Sampson. He died on October 13, 1939 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMTgzNDM4MV5BMl5BanBnXkFtZTgwMDkzODE1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0827509","name":"Ford Sterling","idIMDB":"nm0827509"},"actorId":"nm0827509","character":"Professor Smelts","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mabel Normand","urlProfile":"http://www.imdb.com/name/nm0635667","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzI3ODI3Nl5BMl5BanBnXkFtZTgwMDAxMTkzMjE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1892","placeOfBirth":" New Brighton, Staten Island, New York, USA","birthName":"Mabel Ethelreid Normand","height":"5' 1\" (1.55 m)","bio":"Mabel Normand was one of the comedy greats of early film. In an era when women are deemed 'not funny enough' it seems film history has forgotten her contributions. Her films debuted the Keystone Cops, Charlie Chaplin's tramp and the pie in the face gag. She co-starred with both Chaplin and Roscoe \"Fatty\" Arbuckle in a series of shorts. She was a star in the first Keystone Comedy as well as the first feature film comedy. She was the only comedian to work with Charlie Chaplin, Roscoe \"Fatty\" Arbuckle, Mack Sennett, D.W. Griffith, Harold Lloyd, Mary Pickford, Hal Roach, Stan Laurel, Oliver Hardy, Fred Mace, Fred Sterling and John Bunny (she and Buster Keaton never had a chance to work together but they were friends.) Born in Staten Island, New York to Claude and Mary Normand. Normand started out as an artist model for Charles Dana Gibson (creator of the Gibson girl). Friends suggested she try out for the new medium of film and she did, working as an extra in Kalem and Biograph shorts. With Biograph's move to California she went to work for Vitagraph where she made a series of comedic shorts as 'Betty', one co-starring the first comedy film star John Bunny. Eventually Normand returned to Biograph where she began working with Mack Sennett on comedic shorts that would eventually turn into Keystone Comedies. Normand and Sennett were lovers, close friends and close co-workers. All of Sennett's early ideas seemed to revolve around Normand. His creation of Keystone was contingent on Normand joining him; and though he would underpay her as he underpaid everyone he worked with, he insisted Normand have credit and say in the company. When Normand eventually left Keystone for Goldwyn, Sennett left soon after. By 1912 Normand was writing her own films and by 1914 she was directing her films. By this point she was a major star, continually topping fan polls by new movie magazines. While the discovery of Charlie Chaplin varies from telling to telling, everyone involved agreed Sennett would not have hired (or kept him on) had it not been for Normand. Chaplin's second short for the company was Normand's \"Mabel's Strange Predicament\" which she starred and directed in. This was the first film Chaplin created his iconic tramp character for. Chaplin and Normand had a comedic chemistry and would go on to team in a series of shorts until Chaplin left Keystone in 1915. As Chaplin's star rose many fan magazines began to call Normand a 'female Chaplin'. Normand and Chaplin had similar subtle mannerisms and the influence Normand had on Chaplin can not be understated. Before Chaplin left Keystone, they starred, alongside Marie Dressler, in \"Tillie's Punctured Romance\" the first full length comedy film. With the loss of Chaplin, Normand and Roscoe \"Fatty\" Arbuckle began to team together in a series of shorts (though they had acted together before). This series was also popular and the pair continued acting together until they both left Keystone for better pay. Sennett and Normand became engaged around this time, though the engagement ended when Sennett was caught cheating on Normand. Friends report she suffered a severe head injury when Sennett's fling threw a vase at Normand's head. Those who knew Normand all believed Sennett was the love of her life; and she his. However they would never reconcile romantically. Sennett did convince Normand to create her own production company \"Mabel Normand Film Company\" to make her own features. The first project was \"Mickey\" and Sennett's handling of her business affairs resulted in the film not being released until 1918 (or having a definite version). Normand dissolved the company and signed with Goldwyn where she went on to make comedy features. These movies would be more akin to sitcoms: they were shorter than a lot of features, but still features. Many are lost though several have turned up in the past 10 years. Normand once again signed with Sennett to make features and this would result in her final feature films. However this would be a rocky venture. Normand's health was hit or miss (she had been diagnosed with tuberculosis when she was 10) and seemed to be worse than better. She also was drinking heavily. In 1922 her friend William Desmond Taylor was murdered. This case would become 'the case of the century' and became a media circus, it is still unsolved. Though Normand was cleared (she had been seen leaving his house with him waving goodbye to her; she was likely the last person to see him alive), the association left an unwelcome tarnish on her soon after the scandalous death of her friend Olive Thomas, and the unfair trial of Roscoe Arbuckle. Normand continued working, making The Extra Girl. Soon after its release in 1923 she was again near another crime (a butler was shot at a party she attended; though he survived.) Soon after Normand took a break from film. By 1926 Normand was ready for a comeback. She signed with Hal Roach to make comedy shorts. These were well received and by 1928 she had signed with the William Morris Agency to make talkies. However she did not realize how sick she was and her health soon interrupted these plans. Over the years Normand's tuberculosis has turned into rumors of a drug addiction. This started during the Taylor scandal when it was claimed that maybe he had been killed for interrupting a drug ring, and maybe Normand was part of it. While not prominent during her life it has become more commonly believed as time has passed despite no evidence. Normand's family, estate and personal nurse were all adamant she had never used any drugs. Sadly this rumor has become common place in Hollywood lore. Normand's drinking increased as did her partying. During one party she decided to marry longtime friend Lew Cody at 2am. She instantly regretted the marriage and they continued living separately. As Normand's health decreased and she was committed to a sanitarium (akin to a hospital/hospice in modern terms) by 1929. She died in 1930 from tuberculosis.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzI3ODI3Nl5BMl5BanBnXkFtZTgwMDAxMTkzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0635667","name":"Mabel Normand","nicknames":["Madcap Mabel","Keystone Mabel"],"idIMDB":"nm0635667"},"actorId":"nm0635667","character":"Mabel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nick Cogley","urlProfile":"http://www.imdb.com/name/nm0169088","urlPhoto":"","biography":{"dateOfBirth":"4 May 1869","placeOfBirth":" New York City, New York, USA","birthName":"Nicholas P.J. Cogley","height":"5' 7½\" (1.71 m)","bio":"Nick Cogley was born on May 4, 1869 in New York City, New York, USA as Nicholas P.J. Cogley. He was an actor and director, known for Bangville Police (1913), A Chip Off the Old Block (1913) and Mrs. Jones' Birthday (1909). He died on May 20, 1936 in Santa Monica, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0169088","name":"Nick Cogley","idIMDB":"nm0169088"},"actorId":"nm0169088","character":"Trombonist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Raymond Hatton","urlProfile":"http://www.imdb.com/name/nm0369058","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzZjODYwYTktNjVkMC00MmJiLTk5ZmEtNjg5MzNiOWZlZmQyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 July 1887","placeOfBirth":" Red Oak, Iowa, USA","birthName":"Raymond William Hatton","height":"5' 7\" (1.7 m)","bio":"The son of a physician, Raymond Hatton entered films in 1909, eventually appearing in almost 500 other pictures. In early silents he formed a comedy team with big, burly Wallace Beery. He was best known as the tobacco-chewing, rip-snorting Rusty Joslin in the Three Mesquiteers series. He was also in the Rough Riders series and appeared as Johnny Mack Brown's sidekick as well. His last Western was, fittingly, Requiem for a Gunfighter (1965).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzZjODYwYTktNjVkMC00MmJiLTk5ZmEtNjg5MzNiOWZlZmQyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0369058","name":"Raymond Hatton","idIMDB":"nm0369058"},"actorId":"nm0369058","character":"Trumpet Player","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alice Davenport","urlProfile":"http://www.imdb.com/name/nm0202562","urlPhoto":"","biography":{"dateOfBirth":"29 February 1864","placeOfBirth":" New York City, New York, USA","birthName":"Alice Shepard","bio":"Alice was a silent screen comedic actress. She worked in a number of Keystone films and also appeared in the early films that Chaplin did. Other actors that Alice worked with who went on to become big stars were Mabel Normand and Marie Dressler. Alice was married and divorced from Broadway actor Harry Davenport. Alice was the mother of Dorothy Davenport who was married to Paramount matinee idol Wallace Reid.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0202562","name":"Alice Davenport","idIMDB":"nm0202562"},"actorId":"nm0202562","character":"Mabel's Mother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edgar Kennedy","urlProfile":"http://www.imdb.com/name/nm0448012","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDE0ZDdlZjktYjVhYi00Y2I0LTk0YjAtZjExZjgzYjc5MTQ2XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1890","placeOfBirth":" Lake San Antonio, Monterey County, California, USA","birthName":"Edgar Livingstone Kennedy","height":"6' 1\" (1.85 m)","bio":"Edgar Kennedy, who was born on April 26, 1890, near Monterey, California, hit the road as a young man and traveled across the country, working in a succession of jobs. He became a professional boxer, claiming to have gone 14 rounds against The Manassas Mauler, Jack Dempsey. In addition to his knowledge of the \"Sweet Science\", Kennedy possessed a good musical voice, and wound up singing in musical shows in the Midwest, his first taste of show business. During his cross-country peregrinations he wound up in Los Angeles, and found himself hired as an actor by comedy producer Mack Sennett. At the Sennett Studios he was allegedly one of the original Keystone Kops, but soon graduated from bit parts to supporting roles in Keystone comedies, including Tillie's Punctured Romance (1914) with Charles Chaplin. Kennedy had good roles in other Chaplin movies, but when his contract expired in 1921 he went freelance, though he did occasionally return to Sennett. After leaving Sennett Kennedy established himself as a first-rate supporting comic, and made a career out of playing harassed businessmen, next-door neighbors, cops, etc. By the late 1920s his craft was most prominently featured in comedies for Hal Roach, Sennett's arch-rival, where he flourished in support of Stan Laurel and Oliver Hardy. It was with Roach that he developed his mastery of the \"slow burn\", a routine for which he became famous. He often played a none-too-bright policeman brought to the boiling point by the absurdities of Laurel and Hardy. He also directed the two in From Soup to Nuts (1928) and You're Darn Tootin' (1928). RKO hired Kennedy to appear in a series of comedy shorts called \"The Average Man,\" in which he played the head of a family. The shorts had very tight shooting schedules, often as few as three days, but Kennedy was always a pro and delighted the audience by giving them his all. He made over 200 short subjects and appeared in over 100 feature films, still in demand right up to the day he died of cancer on November 9, 1948.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDE0ZDdlZjktYjVhYi00Y2I0LTk0YjAtZjExZjgzYjc5MTQ2XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0448012","name":"Edgar Kennedy","nicknames":["King of the Slow Burn","Master of the Slow Burn"],"idIMDB":"nm0448012"},"actorId":"nm0448012","character":"Stage Manager","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Avery","urlProfile":"http://www.imdb.com/name/nm0043018","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI0NTI3MDAtNzJjNC00MmFhLWFmNzUtYWFkYzg2ZWVlOWMwXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1873","placeOfBirth":" Chicago, Illinois, USA","birthName":"Charles Avery Bradford","height":"5' 4\" (1.63 m)","bio":"Charles Avery was born on May 28, 1873 in Chicago, Illinois, USA as Charles Avery Bradford. He was an actor and director, known for Across the Alley (1913), Bangville Police (1913) and Won in a Closet (1914). He died on July 23, 1926 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI0NTI3MDAtNzJjNC00MmFhLWFmNzUtYWFkYzg2ZWVlOWMwXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0043018","name":"Charles Avery","idIMDB":"nm0043018"},"actorId":"nm0043018","character":"Sousaphone Player","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rube Miller","urlProfile":"http://www.imdb.com/name/nm0587829","urlPhoto":"","biography":{"dateOfBirth":"22 May 1886","placeOfBirth":" Trottwood, Ohio, USA","bio":"Rube Miller was born on May 22, 1886 in Trottwood, Ohio, USA. He was an actor and director, known for Rube's Hotel Tangle (1916), Shot in the Excitement (1914) and Shy Thirty Cents (1916). He died on April 1, 1927 in Mexico City, Mexico.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0587829","name":"Rube Miller","idIMDB":"nm0587829"},"actorId":"nm0587829","character":"Acrobat","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Laura Oakley","urlProfile":"http://www.imdb.com/name/nm0643025","urlPhoto":"","biography":{"dateOfBirth":"10 July 1879","placeOfBirth":" Oakland, California, USA","bio":"Laura Oakley was born on July 10, 1879 in Oakland, California, USA. She was an actress and writer, known for A Darktown Wooing (1914), Gertie Gets the Cash (1914) and Just Mother (1914). She was married to Milton Moore and Frank Newburg. She died on January 30, 1957 in Altadena, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0643025","name":"Laura Oakley","idIMDB":"nm0643025"},"actorId":"nm0643025","character":"Tall Fatima Sister","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0003310","urlIMDB":"http://www.imdb.com/title/tt0003310","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["10 min (USA)"],"soundMix":["Silent"],"color":["Black and White"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":["306 m (1 reel) (USA)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.6","filmingLocations":[],"awards":[],"votes":"21","type":"Movie","companyCreditsSimple":[{"idCompany":"co0040700","name":"Keystone Film Company"}],"keywords":{"keywords":["band leader","romantic rivalry","trumpeter","vaudeville","stage manager","romantic rejection","pie in face","trumpet player","throwing rotten fruit","romantic triangle"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:38:27"}}