{"data":{"movies":[{"title":"The Single Girls","originalTitle":"","year":"1974","releaseDate":"197404","directors":[{"name":"Beverly Sebastian","id":"nm0780933"},{"name":"Ferd Sebastian","id":"nm0780944"}],"writers":[{"name":"Ann Cawthorne","id":"nm0147251"}],"runtime":"83 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDRlZTQzZGYtMWI3OS00NDM0LTllN2UtY2E0MTlhNTZhZjc5XkEyXkFqcGdeQXVyMjU5OTg5NDc@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama","Horror"],"plot":"A group of men and women travel to a Carribean resort to discover themselves sexually but unfortunately one of them has also discovered that they like to murder people too.","simplePlot":"A group of men and women travel to a Carribean resort to discover themselves sexually but unfortunately one of them has also discovered that they like to murder people too.","actors":[{"actorName":"Claudia Jennings","urlProfile":"http://www.imdb.com/name/nm0421128","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMTMyMDgzNF5BMl5BanBnXkFtZTYwOTI2NzE5._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 December 1949","placeOfBirth":" Evanston, Illinois, USA","birthName":"Mary Eileen Chesterton","height":"5' 6\" (1.68 m)","bio":"Born Mary Eileen \"Mimi\" Chesterton (nicknamed Mimi by her friends and family) in St. Paul, Minnesota, titian beauty Claudia Jennings was raised in Milwaukee, Wisconsin. In 1966, she moved to Evanston, Illinois, the first suburb north of Chicago just south of the Wisconsin state line, where she graduated high school in 1968. After joining the Hull House theater company in Chicago, she took a job as a receptionist at the offices of Playboy magazine in September 1968. Photographer Pompeo Posar asked her to test, and with a potential $5,000 check at stake -- enough for a ticket to Hollywood -- she agreed. She eventually appeared as a Playmate in November 1969, and later as 1970 Playmate of the Year. Re-naming herself Claudia Jennings to avoid family embarrassment due to posing in the nude, she became the most perennially popular Playmate of the 1970s, as well as the number one female star of \"Drive-In\" movies such as The Unholy Rollers (1972) and 'Gator Bait (1974). Her first film role was with the film Jud (1971), a low-budget, socially conscious, independent film about a Vietnam soldier's return home. While the film came and went without much notice, it encouraged Claudia to go into the acting business full time. From 1970 to 1975, she lived with songwriter/producer Bobby Hart but, after their split, her personal life began to spiral. She began using drugs and soon got a reputation for being unreliable. As her cocaine use began to escalate, her career from this point began to flounder. One of her last theatrical film roles was a co-starring part in the little-seen Canadian racetrack drama Fast Company (1979). After narrowly missing the role of Kate Jackson's replacement on Charlie's Angels (1976) to Shelley Hack in May 1979, she began a tumultuous relationship with Beverly Hills realtor Stan Herman. Following their split later that summer, Jennings turned her life around and tried to quit drugs and drinking, but sadly died before she could continue performing in better films. On the morning of October 3, 1979, she somehow fell asleep at the wheel of her VW convertible while on her way to pick up some of her personal things from Herman's home in Malibu and collided head-on with a van on Topanga Canyon Boulevard. She died a few minutes later from massive external and internal injuries before ambulance paramedics could arrive and get her to a nearby hospital. She was 29.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMTMyMDgzNF5BMl5BanBnXkFtZTYwOTI2NzE5._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0421128","name":"Claudia Jennings","nicknames":["Mimi"],"idIMDB":"nm0421128"},"actorId":"nm0421128","character":"Allison","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean Marie Ingels","urlProfile":"http://www.imdb.com/name/nm0408731","urlPhoto":"","biography":{"dateOfBirth":"7 December 1934","placeOfBirth":" San Diego, California, USA","bio":"Jean Marie (Ingels) Clarke began her career as a model, becoming a New York cover girl and TV commercial spokeswoman. A flair for comedy won her a commercial with comedian Buddy Hackett and brought her to the attention of Screen Gems, MGM and 20th - all of which offered her contracts. While working in sitcoms she became a comedy sketch artist 'regular' on Truth or Consequences and with Johnny Carson in his Mighty Carson Art Players and also worked in Specials with Lucille Ball, Carol Burnett, Julie Andrews and Danny Kaye as well as films with Elvis and Jerry Lewis. While working in television she also won rave reviews in Louis John Carlino's ensemble play, \"Telemachus Clay\" and co-starred with John Milford in \"Room Service\", following this with a two-year stint in repertory, where she acted, directed, and began writing for both theatre and film. While being considered for staff work on both \"Capitol\" and \"Days of Our Lives\" she was offered a contract by Aaron Spelling and became writer/story editor on \"Hotel\", with a short stint on \"Nightingales\". With the cancellation of both shows she was slated for the staff of (Charlie's) \"Angels 88\", possibly the first show Aaron Spelling ever had rejected by a network - sending Jean back to long form, her first love, and also to the fine art she had neglected, showing her paintings and sculpture in the Laguna Festival of Arts and Orange County Art & Jazz. These were followed by two one-woman shows in Los Angeles as well as group exhibits throughout Southern California. In addition to the above, Jean is a produced playwright, been a journalist with two bylines, a restaurant critic for \"Epicurean Rendezvous\" and published award-winning poetry. Currently, Jean is a novelist with two books and a short-story collection to her credit, with a third novel in progress. (1/1/12)","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0408731","name":"Jean Marie Ingels","idIMDB":"nm0408731"},"actorId":"nm0408731","character":"Phyllis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cheri Howell","urlProfile":"http://www.imdb.com/name/nm0397948","urlPhoto":"","biography":{"dateOfBirth":"12 January 1947","placeOfBirth":" USA","bio":"Cheri Howell was a gorgeous and voluptuous raven-haired stunner who greatly enlivened a couple of enjoyably trashy 70s drive-in pictures with her sparkling screen presence, striking good looks, and irresistibly naughty sex appeal in an acting career which regrettably spanned only a few years. Cheri was especially memorable as the saucy and enticing Shannon in the fun \"Ten Little Indians\" exploitation variant \"The Single Girls.\" She had a small part as one of the furniture girls in the bleak futuristic science fiction cult classic \"Soylent Green\" and made a guest appearance on an episode of the TV series \"Love, American Style.\" Following her typically fine turn as the icy and calculating Sylvia in the nifty body count horror outing \"Sisters of Death,\" Cheri Howell called it a day as an actress and seems to have vanished into thin air.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0397948","name":"Cheri Howell","idIMDB":"nm0397948"},"actorId":"nm0397948","character":"Shannon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joan Prather","urlProfile":"http://www.imdb.com/name/nm0695367","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY1MTEyOTUwMl5BMl5BanBnXkFtZTcwOTEzOTI0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1950","placeOfBirth":" Dallas, Texas, USA","birthName":"Joan Louise Prather","height":"5' 7\" (1.7 m)","bio":"Slim, lovely and beguiling brunette Joan Prather was born on October 17, 1950, in Dallas, Texas. She was a varsity cheerleader at Highland Park High School in her native Dallas and first began acting in grade-school stage productions. Moreover, she was a regular on the teen dance show \"Somethin' Else\" during her high school years. She graduated from Highland Park High in 1968. Joan started acting in films and TV shows in 1973. Her most memorable movie roles are demure but eager virgin Lola in The Single Girls (1974), stuck-up rich heiress Jane Kingston in Big Bad Mama (1974) and naive beauty pageant contestant Robin in Smile (1975). She achieved her greatest enduring popularity with her recurring part as Janet McArthur Bradford on Eight Is Enough (1977). In addition, Joan has made guest appearances on episodes of such TV series as Sanford and Son (1972), Happy Days (1974), The Love Boat (1977), CHiPs (1977) and Fantasy Island (1977). Prather quit acting in the late 1980s. She's married to lawyer Douglas J. Frye and lives in Malibu, California. In September 2008 she was arrested for felony hit-and-run in Malibu and was released on $50,000 bail.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY1MTEyOTUwMl5BMl5BanBnXkFtZTcwOTEzOTI0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0695367","name":"Joan Prather","idIMDB":"nm0695367"},"actorId":"nm0695367","character":"Lola","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Greg Mullavey","urlProfile":"http://www.imdb.com/name/nm0611976","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMDM5MDkxMl5BMl5BanBnXkFtZTYwNTA4MjM4._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1939","placeOfBirth":" Buffalo, New York, USA","bio":"Greg Mullavey was born on September 10, 1939 in Buffalo, New York, USA. He is an actor, known for Mary Hartman, Mary Hartman (1976), Bob & Carol & Ted & Alice (1969) and The Census Taker (1984). He was previously married to Meredith MacRae.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMDM5MDkxMl5BMl5BanBnXkFtZTYwNTA4MjM4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0611976","name":"Greg Mullavey","idIMDB":"nm0611976"},"actorId":"nm0611976","character":"George","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edward Blessington","urlProfile":"http://www.imdb.com/name/nm0088278","urlPhoto":"","biography":{"bio":"Edward Blessington is known for his work on The Tale of the Dean's Wife (1970), Marsha: The Erotic Housewife (1970) and Caged Men Plus One Woman (1971).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0088278","name":"Edward Blessington","idIMDB":"nm0088278"},"actorId":"nm0088278","character":"Bud","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victor Izay","urlProfile":"http://www.imdb.com/name/nm0412731","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk1NjM5NDMzN15BMl5BanBnXkFtZTcwOTk1NjUzOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 December 1923","placeOfBirth":" Watertown, New York, USA","bio":"Victor Izay was born on December 23, 1923 in Watertown, New York, USA. He was an actor, known for Wild Hogs (2007), Billy Jack (1971) and Employee of the Month (2006). He was married to Jo Roybal Izay and Connie Izay. He died on January 20, 2014 in Glendora, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk1NjM5NDMzN15BMl5BanBnXkFtZTcwOTk1NjUzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0412731","name":"Victor Izay","idIMDB":"nm0412731"},"actorId":"nm0412731","character":"Andrew","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wayne C. Dvorak","urlProfile":"http://www.imdb.com/name/nm0245325","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyOTA4MjgzM15BMl5BanBnXkFtZTYwMTIyNDIy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1941","placeOfBirth":" Milwaukee, Wisconsin, USA","bio":"As a young child, Wayne C. Dvorak grew up on black-and-white movies and was enthralled with actors and acting. At age 15, he was scouted as a promising actor while he was in a high school play, and then immediately went into performing in community theater. Later continuing drama study in college, he was mentored at the Guthrie Theater in Minnesota by the celebrated Sir Tyrone Guthrie, who during his lifetime was considered the greatest director on the English-speaking stage including in both London and New York. At the Guthrie, Dvorak experienced first-hand the rehearsals and performances of star legends like Jessica Tandy, Hume Cronyn, George Grizzard, and Ellen Greer. And he sat in on discussions about writing and directing with the great Arthur Miller and Harold Clurman. Later in Los Angeles, Dvorak performed at the Mark Taper Forum and he worked on television with such greats as Lucille Ball, Mary Tyler Moore, Beatrice Arthur, Betty White, Angela Lansbury, William Shatner, and Peter Falk. During his acting career, he appeared in such shows as Murder, She Wrote; Hill Street Blues; Seinfield; The Nanny; Evening Shade; Everybody Loves Raymond; and The Lindbergh Kidnapping Case with Anthony Hopkins. Dvorak has a B.A. in Theatre Arts and Psychology and a B.S. in Education from the University of Minnesota. He also has a Masters of Arts in Theatre and Art from the University of California-Fullerton -- the first masters candidate in the history of this university.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyOTA4MjgzM15BMl5BanBnXkFtZTYwMTIyNDIy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0245325","name":"Wayne C. Dvorak","idIMDB":"nm0245325"},"actorId":"nm0245325","character":"Dr. Phillip Stevens","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Albert Popwell","urlProfile":"http://www.imdb.com/name/nm0691620","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY2Yjk5ODgtM2YzYy00MjNiLWJlODktMzU1OWUzY2Q0ZTYxXkEyXkFqcGdeQXVyMTI3MDk3MzQ@._V1_UY44_CR37,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1926","placeOfBirth":" New York City, New York, USA","height":"6' 3\" (1.91 m)","bio":"Handsome, leanly built African-American actor who notched up guest appearances in dozens of popular US TV shows, including Mannix (1967), McCloud (1970), Emergency! (1972) and Magnum, P.I. (1980). However, he's better known to cult films fans for his portrayal of character \"Matthew Johnson\" in the successful blaxploitation films Cleopatra Jones (1973) and the sequel Cleopatra Jones and the Casino of Gold (1975). Popwell additionally co-starred alongside screen icon Clint Eastwood in five films, starting off as \"Wonderful Digby\" in Coogan's Bluff (1968). The next four occasions were entries in the highly popular \"Dirty Harry\" films, firstly as the wounded bank robber at the receiving end of Eastwood's now legendary, \"Do you feel lucky, punk?\" speech in the opening minutes of Dirty Harry (1971). He was back as a sadistic pimp who murders a greedy call girl with a can of drain cleaner and is later executed by a vigilante motorcycle cop in Magnum Force (1973), and he was still on the wrong side of the law as a \"Black Power\" activist named \"Big Ed\" Mustapha in The Enforcer (1976). For his final appearance alongside Eastwood, Popwell was on the right side of Clint for once as a fellow detective in Sudden Impact (1983). Popwell passed away on April 9, 1999, from complications arising after major surgery.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY2Yjk5ODgtM2YzYy00MjNiLWJlODktMzU1OWUzY2Q0ZTYxXkEyXkFqcGdeQXVyMTI3MDk3MzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0691620","name":"Albert Popwell","nicknames":["Poppy"],"idIMDB":"nm0691620"},"actorId":"nm0691620","character":"Morris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Ledger","urlProfile":"http://www.imdb.com/name/nm0496571","urlPhoto":"","biography":{"bio":"Jason Ledger is an actor, known for The Ballad of Billie Blue (1972), Domo Arigato (1972) and Johnny Firecloud (1975).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0496571","name":"Jason Ledger","idIMDB":"nm0496571"},"actorId":"nm0496571","character":"Blue","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Merci Montello","urlProfile":"http://www.imdb.com/name/nm0599314","urlPhoto":"","biography":{"dateOfBirth":"21 June 1950","placeOfBirth":" New Jersey, USA","height":"5' 4\" (1.63 m)","bio":"Merci Montello appeared as the Playboy Playmate of the Month for December 1972 under the name of \"Mercy Rooney\". The New Jersey native, who was born in the Garden State on June 21, 1950, acquired her new surname as the wife of Mickey Rooney Jr., whom she had met when she was a \"Bunny\" at the Los Angeles Playboy Club (or \"Hutch\"). The blonde-haired, blue-eyed Meci sported a classic 36-23-36 figure, which is a winning hand on both Coasts. Before she gained her chance to grab at the Big Brass Ring as a bunny at the L.A. Hutch, Merci was self-employed as a decorator, seamstress and dancer. On the back of her gate-fold in the December issue, Mercy listed her ambition as \"To become an actress\". Unfortunately, Merci Montello's career in pictures was distinguished only by the fact that she had a different name in each picture she appeared in: \"Mercy Mee\" in Space Thing (1968), \"Merci Montello\" in Erika's Hot Summer (1971), and -- cashing in on her Playboy notoriety -- \"Merci Rooney\" in \"Bloody Friday\" (1974). In the latter movie, a.k.a. The Single Girls (1974), she was shot in the stomach with a crossbow while gamboling in the woods. The body of the voluptuous Playmate was buried under leaves and straw by her slayer, though Mercy's hand was left sticking out of the improvised grave to provide a plot device. With that, she waved good-bye to her career and the limelight. She divorced Mickey Rooney Jr., who is now a born-again Christian and a minister who regales his audiences by testifying about the folly of \"Life in the Fast Lane\".","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0599314","name":"Merci Montello","idIMDB":"nm0599314"},"actorId":"nm0599314","character":"Cathy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robyn Hilton","urlProfile":"http://www.imdb.com/name/nm0385301","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNTYyMDAxMl5BMl5BanBnXkFtZTcwMzc3MDExOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1940","placeOfBirth":" Los Angeles, California, USA","birthName":"Robyn J. Molyneux","bio":"Robyn Hilton was born in 1940 in Los Angeles, California, USA as Robyn J. Molyneux. She is an actress, known for Blazing Saddles (1974), Doc Savage: The Man of Bronze (1975) and Video Vixens! (1974). She was previously married to William Hilton.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNTYyMDAxMl5BMl5BanBnXkFtZTcwMzc3MDExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0385301","name":"Robyn Hilton","idIMDB":"nm0385301"},"actorId":"nm0385301","character":"Denise","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0070697","urlIMDB":"http://www.imdb.com/title/tt0070697","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 23 min (83 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Movielab, USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"4.9","filmingLocations":[],"rated":"R","awards":[],"votes":"102","type":"Movie","companyCreditsSimple":[{"idCompany":"co0028248","name":"Sebastian Films Limited"}],"keywords":{"keywords":["murder","f rated","female killer","shirt ripped open","topless","abrupt ending","attack","cult film","1970s","1970s fashion","whodunit","swinging","woman fighting a woman","lesbianism","female nudity","slasher","sexual promiscuity","sexual exploration","sexual awakening","psychoanalysis","greenhouse","cave","caribbean","sex","nudity","axe murder","psychopath","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:47:40"}}