{"data":{"movies":[{"title":"The Falcon and the Snowman","originalTitle":"","year":"1985","releaseDate":"19850208","directors":[{"name":"John Schlesinger","id":"nm0772259"}],"writers":[{"name":"Robert Lindsey","id":"nm0512396"},{"name":"Steven Zaillian","id":"nm0001873"}],"runtime":"131 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM4NTI0MjUzNV5BMl5BanBnXkFtZTcwMTMzNzYzNA@@._V1.jpg","countries":["UK","USA"],"languages":["English"],"genres":["Biography","Crime","Drama","Thriller"],"plot":"The true story of Christopher Boyce, a young All-American man whose job as a guard for sensitive documents shatters his faith in his country and leads him to a sometimes comic, sometimes chilling sideline as a spy for the Soviets, aided by his scruffy buddy, Daulton; it can't last, though, and the consequences are tremendous for Boyce and his family.","simplePlot":"The true story of a disillusioned military contractor employee and his drug pusher childhood friend who became walk-in spies for the Soviet Union.","actors":[{"actorName":"Timothy Hutton","urlProfile":"http://www.imdb.com/name/nm0000459","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjYxODUwNV5BMl5BanBnXkFtZTcwNTg5Nzg4Mg@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1960","placeOfBirth":" Malibu, California, USA","birthName":"Timothy Tarquin Hutton","height":"6' (1.83 m)","bio":"Timothy Hutton was born in Malibu, California, to Maryline (Poole), a teacher, and actor Jim Hutton (Dana James Hutton). He set Hollywood ablaze when he burst onto the acting scene in the early 1980s. After only a small number of significant roles in TV movies, he bagged the part of Conrad in the Robert Redford-directed Ordinary People (1980). His convincing - and touching - performance as the troubled and self-accusing teenager trying to deal with the death of his older brother, won him an Academy Award. He is, to date, the youngest actor to receive an Oscar for Best Supporting Actor (1980). With over 70 film, TV, and stage appearances (including an impressive 15 features films between 2006-08), Tim Hutton is (of 2008) headlining the hit TV series Leverage (2008) as insurance investigator Nate Ford. He also starred in the acclaimed Roman Polanski film The Ghost Writer (2010). Tim made his Broadway debut in 1989 in the A.R. Gurney play 'Love Letters'.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjYxODUwNV5BMl5BanBnXkFtZTcwNTg5Nzg4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000459","name":"Timothy Hutton","nicknames":["Tim"],"idIMDB":"nm0000459"},"actorId":"nm0000459","character":"Christopher Boyce","urlCharacter":"http://www.imdb.com/character/ch0025341","main":true},{"actorName":"Sean Penn","urlProfile":"http://www.imdb.com/name/nm0000576","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NjMzMjY3NF5BMl5BanBnXkFtZTcwMzkxNjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1960","placeOfBirth":" Santa Monica, California, USA","birthName":"Sean Justin Penn","height":"5' 8\" (1.73 m)","bio":"Sean Penn is a powerhouse film performer capable of intensely moving work, who has gone from strength to strength during a colourful film career, and who has drawn much media attention for his stormy private life and political viewpoints. Sean Justin Penn was born in Los Angeles, California, the second son of actress Eileen Ryan (née Annucci) and director, actor, and writer Leo Penn. His brother was actor Chris Penn. His father was from a Lithuanian Jewish/Russian Jewish family, and his mother is of half Italian and half Irish descent. Penn first appeared in roles as strong-headed or unruly youths such as the military cadet defending his academy against closure in Taps (1981), then as fast-talking surfer stoner Jeff Spicoli in Fast Times at Ridgemont High (1982). Fans and critics were enthused about his obvious talent and he next contributed a stellar performance alongside Timothy Hutton in the Cold War spy thriller The Falcon and the Snowman (1985), followed by a teaming with icy Christopher Walken in the chilling At Close Range (1986). The youthful Sean then paired up with his then wife, pop diva Madonna in the woeful, and painful, Shanghai Surprise (1986), which was savaged by the critics, but Sean bounced back with a great job as a hot-headed young cop in Colors (1988), gave another searing performance as a US soldier in Vietnam committing atrocities in Casualties of War (1989) and appeared alongside Robert De Niro in the uneven comedy We're No Angels (1989). However, the 1990s was the decade in which Sean really got noticed by critics as a mature, versatile and accomplished actor, with a string of dynamic performances in first-class films. Almost unrecognisable with frizzy hair and thin rimmed glasses, Penn was simply brilliant as corrupt lawyer David Kleinfeld in the Brian De Palma gangster movie Carlito's Way (1993) and he was still in trouble with authority as a Death Row inmate pleading with a caring nun to save his life in Dead Man Walking (1995), for which he received his first Oscar nomination. Sean then played the brother of wealthy Michael Douglas, involving him in a mind-snapping scheme in The Game (1997) and also landed the lead role of Sgt. Eddie Walsh in the star-studded anti-war film The Thin Red Line (1998), before finishing the 1990s playing an offbeat jazz musician (and scoring another Oscar nomination) in Sweet and Lowdown (1999). The gifted and versatile Sean had also moved into directing, with the quirky but interesting The Indian Runner (1991), about two brothers with vastly opposing views on life, and in 1995 he directed Jack Nicholson in The Crossing Guard (1995). Both films received overall positive reviews from critics. Moving into the new century, Sean remained busy in front of the cameras with even more outstanding work: a mentally disabled father fighting for custody of his seven-year-old daughter (and receiving a third Oscar nomination) for I Am Sam (2001); an anguished father seeking revenge for his daughter's murder in the gut-wrenching Clint Eastwood-directed Mystic River (2003) (for which he won the Oscar as Best Actor); a mortally ill college professor in 21 Grams (2003) and a possessed businessman in The Assassination of Richard Nixon (2004). Certainly Sean Penn is one of Hollywood's most controversial, progressive and gifted actors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NjMzMjY3NF5BMl5BanBnXkFtZTcwMzkxNjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000576","name":"Sean Penn","idIMDB":"nm0000576"},"actorId":"nm0000576","character":"Daulton Lee","urlCharacter":"http://www.imdb.com/character/ch0040089","main":true},{"actorName":"Pat Hingle","urlProfile":"http://www.imdb.com/name/nm0385757","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MTc2MzU3NV5BMl5BanBnXkFtZTcwMzgyNTgxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 July 1924","placeOfBirth":" Miami, Florida, USA","birthName":"Martin Patterson Hingle","height":"5' 10\" (1.78 m)","bio":"Pat Hingle (real name: Martin Patterson Hingle) was born in Miami, Florida, the son of a building contractor. His parents divorced when Hingle was still in his infancy (he never knew his father) and his mother supported the family by teaching school in Denver. She then began to travel (with her son in tow) in search of more lucrative work; by age 13 Hingle had lived in a dozen cities. The future Tony Award nominee made his \"acting debut\" in the third grade, playing a carrot in a school play (\"At that time it didn't seem like much of a way to make a living!\", he recalled). Hingle attended high school in Texas and in 1941 entered the University of Texas, majoring in advertising. After serving in the Navy during WW II, he went back to the university and got involved with the drama department as a way to meet girls. With his wife Alyce (whom he first met at the university), Hingle moved to New York and began to get jobs on the stage and on TV. The apex of his stage career was \"J.B.\" by poet Archibald Macleish, with Hingle in the title role as a 20th-century Job. It was during the run of \"J.B.\" that Hingle took an accidental plunge down the elevator shaft of his New York apartment building, sustaining near-fatal injuries in the 54-foot fall. He was near death for two weeks (and lost the little finger of his left hand); his recovery took more than a year. In more recent years, Hingle has played Commissioner Gordon in the \"Batman\" movies. Just prior to his death, he resided in Carolina Beach, North Carolina, with his wife, Julia.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MTc2MzU3NV5BMl5BanBnXkFtZTcwMzgyNTgxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0385757","name":"Pat Hingle","idIMDB":"nm0385757"},"actorId":"nm0385757","character":"Mr. Charlie Boyce","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joyce Van Patten","urlProfile":"http://www.imdb.com/name/nm0887696","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI1MzMzNDIzNF5BMl5BanBnXkFtZTcwOTkwOTMyNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 March 1934","placeOfBirth":" New York City, New York, USA","birthName":"Joyce Benignia Van Patten","bio":"Adept at both comedy and drama, veteran actress Joyce Van Patten was born in New York City. Prodded by a typically assertive stage mother, Joyce and her equally famous older brother Dick Van Patten displayed natural talent and did quite well for themselves at an early age. Joyce was auditioning for modeling roles before reaching her first birthday, and by age eight, was appearing on radio and on Broadway in \"Love's Old Sweet Song\" by William Saroyan. One year later, she and Dick had bit roles in the film Reg'lar Fellers (1941) and appeared together in the play \"The Wind Is Ninety\" (1945). Following a relatively brief marriage to Thomas King at the age of 16 and the birth of their son Casey King a year later, Joyce grew into young adult roles and found parts in a number of popular plays including \"The Desk Set\" (1955) and \"A Hole in the Head\" (1957). She appeared with Dick in New York in \"The Male Animal\" (1953), \"The Tender Trap\" (1955), and \"Oh Men! Oh Women! (1955). Joyce downplayed her beauty for smart, cynical, earthier characters and specialized in wry comedy. Some of her other notable film appearances were in Fourteen Hours (1951), The Goddess (1958), I Love You, Alice B. Toklas! (1968), and Making It (1971), which also featured her brother Dick. Her career in television began to flourish with appearances on the TV daytime dramas As the World Turns (1956) and Young Dr. Malone (1958), The Danny Kaye Show (1963) for four seasons, The Good Guys (1968) for two seasons, and The Mary Tyler Moore Hour (1979) for one season, in addition to countless guest appearances on other comedy and drama series such as Judging Amy (1999), Desperate Housewives (2004), and The Good Wife (2009). Joyce has also been a wonderful presence in a number of popular shows on Broadway stage, including: \"Spoon River Anthology\". \"Same Time, Next Year\", \"I Oughta Be in Pictures\", \"The Supporting Cast\", \"Brighton Beach Memoirs\", \"Rumors\", \"Jake's Women\", \"Ring Round the Moon\" (1999), \"Taller Than a Dwarf\" (2000), \"Harvey\" (2003), \"The Oldest Profession\" (2004), and \"Rabbit Hole\" (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI1MzMzNDIzNF5BMl5BanBnXkFtZTcwOTkwOTMyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0887696","name":"Joyce Van Patten","idIMDB":"nm0887696"},"actorId":"nm0887696","character":"Mrs. Boyce","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rob Reed","urlProfile":"http://www.imdb.com/name/nm0715652","urlPhoto":"","biography":{"bio":"Rob Reed is an actor, known for The Falcon and the Snowman (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0715652","name":"Rob Reed","idIMDB":"nm0715652"},"actorId":"nm0715652","character":"Boyce Child","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rob Newell","urlProfile":"http://www.imdb.com/name/nm0627828","urlPhoto":"","biography":{"bio":"Rob Newell is an actor, known for The Falcon and the Snowman (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0627828","name":"Rob Newell","idIMDB":"nm0627828"},"actorId":"nm0627828","character":"Boyce Child","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karen West","urlProfile":"http://www.imdb.com/name/nm1188155","urlPhoto":"","biography":{"bio":"Karen West is an actress, known for The Falcon and the Snowman (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1188155","name":"Karen West","idIMDB":"nm1188155"},"actorId":"nm1188155","character":"Boyce Child","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Art Camacho","urlProfile":"http://www.imdb.com/name/nm0131064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMjk5OTg4NV5BMl5BanBnXkFtZTgwNDA2NzEyMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Award-winning action film Director/Fight choreographer/stunt performer Art Camacho has a vast experience in the entertainment industry. He is in production of Final Payback 2, a sequel to one of his successful action films, and in development of a Latino Vampire film called \"The Crossing\". Camacho recently produced two Spanish language action films and was Consulting Producer on \"The Jadagrace show\" starring Motown legend Barry Gordy's granddaughter Jadagrace. Camacho wrote the story for Cage fight in addition to producing the movie. His studio releases include Sony Pictures \"Half Past Dead 2\". HPD 2, he was the Action Coordinator/2nd unit director on the original (Half Past Dead starring Steven Seagal and Ja Rule). Camacho also Co-produced, wrote and Directed \"Confessions of a pit fighter\" which was released in by Lionsgate Pictures. He began his film career as an actor, appearing in various action films and television programs. He then went on to producer and direct commercials prior to making films. His background in martial arts and fighting helped him make the transition to Fight choreography in martial arts action films. With over 35 action films under his belt as a fight choreographer he was dubbed \"The Fight Master\" by the leading martial arts publications. Camacho then became a successful feature film director/Producer. In most of his action films Camacho also choreographed the action. In Lionsgate release: \"Confessions of a Pit fighter\" Camacho not only directed the feature but wrote, Co-produced it as well. It starred Armand Assante, James Russo and Flavor Flav. Camacho soon distinguished himself as one of the \"Promising directors in the action film genre\" according to Premier magazine. His Producing/directing film career has not been limited to action but all genres including family films. His film \"Little Bigfoot\" went on to become the third highest grossing DVD release for Republic pictures and garnered two stars in TV Guide. His directorial debut, \"The Power Within\" garnered rave reviews from the International film community and was extremely lucrative in the Foreign and Domestic film markets. Camacho also Directed episodes of \"LA Heat\"; a buddy cop action series and \"Reyes y Rey\", for Sony Pictures. He has been featured in numerous international magazines and books throughout the world including \"Black Belt magazine\", \"Inside Kung Fu\", \"Karate International\", and \"Cinturon Negro\", \"Masters and Styles, \"Secrets of the Masters\", \"Martial Arts Illustrated\", \"Who's Who in Entertainment\" \"Encyclopedia of Martial Arts\" and most recently graced the cover of Canada's \"Martial arts experts\" . L.A.'s largest Spanish Language Newspaper \"La Opinion\" has done several stories on Camacho and dubbed him \"One of Latino Hollywood's best action directors\" Proclaiming that with the right project Camacho will break through. He was also featured on \"Hola Los Angeles\", \"Cinemax\" Mexico's channel 12, \"Despierta America\" and \"Control\". Camacho was most recently featured on Latin Nation and he was the first recipient of the \"The Outstanding Director of the Year\" award from the Action on film, film festival 2005/2006, The Golden and Bronze halo awards from the Hollywood motion picture counsel. Camacho was also recipient of an award from the World Martial arts Association that was presented to him on behalf of Alan Horn (CEO of The Walt Disney Company) and Michael Klausman (President of CBS studios).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwMjk5OTg4NV5BMl5BanBnXkFtZTgwNDA2NzEyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0131064","name":"Art Camacho","idIMDB":"nm0131064"},"actorId":"nm0131064","character":"Boyce Child","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Annie Kozuch","urlProfile":"http://www.imdb.com/name/nm0469018","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1OTY4ODAxOF5BMl5BanBnXkFtZTgwNjYxNDYxMDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"For the multi-talented Annie Kozuch, music, theater and performance called to her from an early age and no other option was ever seriously considered. Born in New Jersey, Annie grew up in Mexico City, speaking both English and Spanish. Music was always a major part of the home atmosphere; especially Broadway musicals. Already participating in school plays and community theater, Annie was cast in Frankenstein's Great Aunt Tillie (1984) and had the powerful experience of being cast in Oscar-winning director's John Schlesinger highly acclaimed The Falcon and the Snowman (1985) during her senior year in high school. Graduating from Mills College in 1988 with degrees in Dramatic Arts and Psychology, she spent her junior year in London, studying at the Royal Academy of Dramatic Art. After graduation, she spent a summer at American Conservatory Theater, studying with the highly acclaimed actress and playwright, Anna Deavere Smith Shortly after moving to New York City in 1990 (where she still resides), Annie pursued an extremely active career in theater, film, television/radio and song, performing at a variety of New York and regional theaters, while continuing to pursue her craft (including studies with the great Co-founder and Artistic Director of The American Place Theater, Wynn Handman). By the year 2000, musical expression took full root, from intimate venues to symphonic concerts, including performing Broadway classics with the New Haven and Tokyo Symphony Orchestras. A two-year stint touring the U.S. in 2007/8 with the Nolan Gasser Quartet (now the San Francisco Jazz Quartet) laid the groundwork for more intimate performances, setting the stage for her longtime collaboration with the outstanding pianist Frank Ponzio. With Frank's musical support and direction, Annie began to tell her own story in bi-lingual song, blending musical theater with the Great American Songbook, Jazz standards and Mexican boleros with her first one-woman show, Diva's Lament. With the release of her critically-acclaimed debut CD Here With You in 2010, Annie was also busy shooting _Postales(2010)_ in Peru. Her most recent show Mostly Jobim premiered in 2012, with the CD release following in early 2013, with more concerts and touring in the works. Always eager to explore new music and new acting parts, her most recent film is Emily & Tim (2015), directed by Eric Weber. Among her other professional activities, Annie is quite busy in the world of on camera commercials and voice-over recordings in both English and Spanish. She's also heavily active in fund-raising on behalf of a number of charities.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1OTY4ODAxOF5BMl5BanBnXkFtZTgwNjYxNDYxMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0469018","name":"Annie Kozuch","idIMDB":"nm0469018"},"actorId":"nm0469018","character":"Boyce Child","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Dysart","urlProfile":"http://www.imdb.com/name/nm0246004","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNTE2MjI5NDheQTJeQWpwZ15BbWU3MDY1OTk4MDg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1929","placeOfBirth":" Brighton, Massachusetts, USA","birthName":"Richard Allen Dysart","height":"5' 9½\" (1.77 m)","bio":"Richard Dysart served for four years in the Air Force during the Korean War. He was a founding member of the American Conservatory Theatre, San Francisco. He received the Drama Desk Award in 1972 and a Emmy Award in 1992. He was good friends with Diana Muldaur, who played Rosalind Shays on L.A. Law.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNTE2MjI5NDheQTJeQWpwZ15BbWU3MDY1OTk4MDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0246004","name":"Richard Dysart","nicknames":["Dick"],"idIMDB":"nm0246004"},"actorId":"nm0246004","character":"Dr. Lee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Priscilla Pointer","urlProfile":"http://www.imdb.com/name/nm0688467","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzQ2NTczNl5BMl5BanBnXkFtZTcwODA2NjYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1924","placeOfBirth":" New York City, New York, USA","bio":"Though character actress Priscilla Pointer may be better known as the mother of Amy Irving, she has enjoyed a major stage, film and TV career herself for over four decades. The New York-born performer was trained on the stage and appeared in several tours and Broadway shows, including \"A Streetcar Named Desire\", \"The Country Wife\" and \"The Condemned of Altona\". Many of these were under the direction of husband Jules Irving, a former actor, whom she married in 1947. Together, they co-founded the San Francisco Actor's Workshop along with Herbert Blau and Beatrice Manley. Forsaking her career for a time to raise her children, Pointer returned full time and, at the age of 40+, decided to set her sights on film and TV. She seemed to be everywhere in the 1970s and 1980s as somebody's mom, both brittle and resilient. She also proved to be dependable as a stern, no-nonsense teacher, doctor or judge. She played the mother of daughter Amy Irving in the cult shocker Carrie (1976), Diane Keaton in Looking for Mr. Goodbar (1977), Sean Penn in The Falcon and the Snowman (1985) and Kyle MacLachlan in Blue Velvet (1986). On the nighttime soap hit Dallas (1978), she played mom to Victoria Principal's character. In 1979, her husband Jules passed away and, two years later, she married actor Robert Symonds. They have appeared together quite frequently on stage, including the plays \"Voices\" and \"The Road to Mecca\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzQ2NTczNl5BMl5BanBnXkFtZTcwODA2NjYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0688467","name":"Priscilla Pointer","idIMDB":"nm0688467"},"actorId":"nm0688467","character":"Mrs. Lee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Makepeace","urlProfile":"http://www.imdb.com/name/nm0538485","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNjI5OTY3MF5BMl5BanBnXkFtZTcwNzIxMjEyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 April 1964","placeOfBirth":" Montréal, Québec, Canada","height":"5' 9\" (1.75 m)","bio":"Chris Makepeace was born on April 22, 1964 in Montréal, Québec, Canada. He is an actor and assistant director, known for My Bodyguard (1980), Vamp (1986) and Arrête de ramer, t'es sur le sable (1979).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNjI5OTY3MF5BMl5BanBnXkFtZTcwNzIxMjEyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0538485","name":"Chris Makepeace","idIMDB":"nm0538485"},"actorId":"nm0538485","character":"David Lee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dorian Harewood","urlProfile":"http://www.imdb.com/name/nm0002126","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MjQzNzcxNV5BMl5BanBnXkFtZTcwMTU1NDg5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1950","placeOfBirth":" Dayton, Ohio, USA","birthName":"Willie Dorian Harewood","height":"5' 8½\" (1.74 m)","bio":"Dorian Harewood was born on August 6, 1950 in Dayton, Ohio, USA as Willie Dorian Harewood. He is an actor, known for Full Metal Jacket (1987), Gothika (2003) and 12 Angry Men (1997). He has been married to Nancy Harewood since February 14, 1979. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MjQzNzcxNV5BMl5BanBnXkFtZTcwMTU1NDg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002126","name":"Dorian Harewood","idIMDB":"nm0002126"},"actorId":"nm0002126","character":"Gene","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mady Kaplan","urlProfile":"http://www.imdb.com/name/nm0438306","urlPhoto":"","biography":{"dateOfBirth":"6 August 1956","placeOfBirth":" New York City, New York, USA","bio":"Mady Kaplan was born on August 6, 1956 in New York City, New York, USA. She is an actress, known for The Deer Hunter (1978), As the World Turns (1956) and The Falcon and the Snowman (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0438306","name":"Mady Kaplan","idIMDB":"nm0438306"},"actorId":"nm0438306","character":"Laurie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Macon McCalman","urlProfile":"http://www.imdb.com/name/nm0564782","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NTM5NjUzOV5BMl5BanBnXkFtZTYwNDUwMjky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 December 1932","placeOfBirth":" Memphis, Tennessee, USA","bio":"Macon McCalman was born on December 30, 1932 in Memphis, Tennessee, USA. He was an actor, known for Chute libre (1993), Fried Green Tomatoes (1991) and Deliverance (1972). He died on November 29, 2005 in Memphis.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NTM5NjUzOV5BMl5BanBnXkFtZTYwNDUwMjky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0564782","name":"Macon McCalman","nicknames":["Sonny"],"idIMDB":"nm0564782"},"actorId":"nm0564782","character":"Larry Rogers","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0087231","urlIMDB":"http://www.imdb.com/title/tt0087231","business":{"budget":{"money":"$12,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$17,130,087 (USA)","country":"","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 11 min (131 min)"],"soundMix":["Dolby Stereo"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panaflex Camera and Lenses by Panavision"],"laboratory":["DeLuxe, USA (color)"],"filmLength":["3,611 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.8","filmingLocations":[{"location":"Via Segovia, Palos Verdes Estates, California, USA"}],"rated":"R","awards":[{"award":"National Society of Film Critics Awards, USA 1986","titlesAwards":[{"titleAwardOutcome":"3rd place NSFC Award","categories":[{"category":"Best Actor","names":[{"name":"Sean Penn","id":"nm0000576","role":null}]}]}]}],"votes":"8,642","type":"Movie","companyCreditsSimple":[{"idCompany":"co0056805","name":"Hemdale"}],"keywords":{"keywords":["drugs","soviet union","spy","cia","embassy","mexico","walk in spy","childhood friend","true crime","chilean coup d'etat","u.s. foreign policy","classified information","imperialism","naivete","loss of innocence","united states","superpower","cryptography","spy satellite","nsa","national security agency","cia covert operations","political interventionism","national reconnaissance office","gay slur","intelligence agency","courier","middleman","f word","smuggling","1970s","drug smuggling","blackmail","disillusionment","forced confession","heroin","treason","torture","satellite","spy camera","police interrogation","falconry","russian","undercover","disinformation","cold war","drug dealing","espionage","father son relationship","based on book","independent film","based on true story"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 18:24:14"}}