{"data":{"movies":[{"title":"The Intruders","originalTitle":"","year":"1970","releaseDate":"19701110","directors":[{"name":"William A. Graham","id":"nm0334353"}],"writers":[{"name":"William Douglas Lansford","id":"nm0487091"},{"name":"Dean Riesner","id":"nm0718466"}],"runtime":"100 min","countries":["USA"],"languages":["English"],"genres":["Western"],"plot":"The James and Younger outlaw gangs ride into town, and it is up to the local marshal, who has lost both his nerve and his gun skills, to stop them.","simplePlot":"The James and Younger outlaw gangs ride into town, and it is up to the local marshal, who has lost both his nerve and his gun skills, to stop them.","actors":[{"actorName":"Don Murray","urlProfile":"http://www.imdb.com/name/nm0614916","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcwMzI5ODIzMF5BMl5BanBnXkFtZTgwMTUxODY4NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1929","placeOfBirth":" Hollywood, California, USA","birthName":"Donald Patrick Murray","height":"6' 2\" (1.88 m)","bio":"Don Murray was born on July 31, 1929 in Hollywood, California, USA as Donald Patrick Murray. He is an actor and writer, known for Conquest of the Planet of the Apes (1972), Bus Stop (1956) and A Hatful of Rain (1957). He has been married to Betty Murray since August 6, 1962. They have three children. He was previously married to Hope Lange.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcwMzI5ODIzMF5BMl5BanBnXkFtZTgwMTUxODY4NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0614916","name":"Don Murray","idIMDB":"nm0614916"},"actorId":"nm0614916","character":"Sam Garrison","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anne Francis","urlProfile":"http://www.imdb.com/name/nm0004282","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MTg3OTIwOV5BMl5BanBnXkFtZTcwMDMzNDcyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1930","placeOfBirth":" Ossining, New York, USA","birthName":"Anne Lloyd Francis","height":"5' 8\" (1.73 m)","bio":"Anne Francis got into show business quite early in life. She was born Ann Marvak on September 16, 1930 in Ossining, New York (which is near Sing Sing prison), the only child of Phillip Marvak, a businessman/salesman, and the former Edith Francis. A natural little beauty, she became a John Robert Powers model at age 6(!) and swiftly moved into radio soap work and television in New York. By age 11, she was making her stage debut on Broadway playing the child version of Gertrude Lawrence in the star's 1941 hit vehicle \"Lady in the Dark\". During this productive time, she attended New York's Professional Children's School. Metro-Goldwyn-Mayer put the lovely, blue-eyed, wavy-blonde hopeful under contract during the post-war World War II years. While Anne appeared in a couple of obscure bobbysoxer bits, nothing much came of it. Frustrated at the standard cheesecake treatment she was receiving in Hollywood, the serious-minded actress trekked back to New York where she appeared to good notice on television's \"Golden Age\" drama and found some summer stock work on the sly (\"My Sister Eileen\"). Discovered and signed by 20th Century-Fox's Darryl F. Zanuck after playing a seductive, child-bearing juvenile delinquent in the low budget film So Young So Bad (1950), Anne soon starred in a number of promising ingénue roles, including Elopement (1951), Lydia Bailey (1952) and Dreamboat (1952) but she still could not seem to rise above the starlet typecast. At MGM, she found promising leading lady work in a few noteworthy 1950s classics: Bad Day at Black Rock (1955); Blackboard Jungle (1955); and the science fiction cult classic Forbidden Planet (1956). While co-starring with Hollywood's hunkiest best, including Paul Newman, Dale Robertson, Glenn Ford and Cornel Wilde, her roles still emphasized more her glam appeal than her acting capabilities. In the 1960s, Anne began refocusing strongly on the smaller screen, finding a comfortable niche on television series. She found a most appreciative audience in two classic The Twilight Zone (1959) episodes and then as a self-sufficient, Emma Peel-like detective in Aaron Spelling's short-lived cult series Honey West (1965), where she combined glamour and a sexy veneer with judo throws, karate chops and trendy fashions. The role earned her a Golden Globe Award and Emmy Award nomination. The actress returned to films only on occasion, the most controversial being Funny Girl (1968), in which her co-starring role as Barbra Streisand's pal was heartlessly reduced to a glorified cameo. Her gratuitous co-star parts opposite some of filmdom's top comics' in their lesser vehicles -- Jerry Lewis' Hook, Line and Sinker (1969) and Don Knotts' The Love God? (1969) -- did little to show off her talents or upgrade her career. For the next couple of decades, Anne remained a welcome and steadfast presence in a slew of television movies (The Intruders (1970), Haunts of the Very Rich (1972), Little Mo (1978), A Masterpiece of Murder (1986)), usually providing colorful, wisecracking support. She billed herself as Anne Lloyd Francis on occasion in later years. For such a promising start and with such amazing stamina and longevity, the girl with the sexy beauty mark probably deserved better. Yet in reflection, her output, especially in her character years, has been strong and varied, and her realistic take on the whole Hollywood industry quite balanced. Twice divorced with one daughter from her second marriage, Anne adopted (as a single mother) a girl back in 1970 in California. She has long been involved with a metaphysical-based church, channeling her own thoughts and feelings into the inspirational 1982 book \"Voices from Home: An Inner Journey\". Lately, she has spent more time off-camera and involved in such charitable programs as \"Direct Relief\", \"Angel View\" and the \"Desert AIDS Project\", among others. Her health declined sharply in the final years. Diagnosed with lung cancer in 2007, the actress sadly died on January 2, 2011, from complications of pancreatic cancer in a Santa Barbara (California) retirement home.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MTg3OTIwOV5BMl5BanBnXkFtZTcwMDMzNDcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004282","name":"Anne Francis","idIMDB":"nm0004282"},"actorId":"nm0004282","character":"Leora Garrison","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edmond O'Brien","urlProfile":"http://www.imdb.com/name/nm0639529","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI3MjQ0OTMwMl5BMl5BanBnXkFtZTYwNDE4NDky._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1915","placeOfBirth":" New York City, New York, USA","birthName":"Redmond O'Brien","height":"5' 9\" (1.75 m)","bio":"Oscar-winner Edmond O'Brien was one of the most-respected character actors in American cinema, from his heyday of the mid-1940s through the late 1960s. Born on September 10, 1915, in the New York City borough of The Bronx, O'Brien learned the craft of performance as a magician, reportedly tutored by neighbor Harry Houdini. He took part in student theatrics in high school and majored in drama at Columbia University. He made his Broadway debut at the age of 21 in 1936 and, later that year, played \"The Gravedigger\" in the great Shakespearean actor John Gielgud's legendary production of \"Hamlet\". Four years later, he would play \"Mercutio\" to the \"Romeo\" of another legendary Shakespearean, Laurence Olivier, in Olivier's 1940 Brodway production of \"Romeo & Juliet\". O'Brien worked with another magician, Orson Welles, in the Mercury Theater's production of \"Julius Caesar\", appearing as \"Mark Antony\". He would later play \"Casca\" in Joseph L. Mankiewicz's film of the play, Julius Caesar (1953). Altough it has been stated that he made his debut as an uncredited extra in the 1938 film, Prison Break (1938), the truth is that his stage work impressed RKO boss Pandro S. Berman, who brought him to Hollywood to appear in the plum supporting part of \"Gringoire\" in The Hunchback of Notre Dame (1939), which starred Charles Laughton in the title role. After returning from his wartime service with the Army Air Force, O'Brien built up a distinguished career as a supporting actor in A-list films, and as an occasional character lead, such as in D.O.A. (1950). O'Brien won an Academy Award for Best Supporting Actor for his role in La comtesse aux pieds nus (1954) and also received a Best Supporting Actor Oscar nomination for his role as a drunken senator who ferrets out an attempted coup d'etat in Seven Days in May (1964). He also appeared as crusty old-timer \"Freddy Sykes\", who antagonizes Ben Johnson's character \"Tector Gorch\" in director Sam Peckinpah's classic Western, The Wild Bunch (1969). Increasingly, O'Brien appeared on television in the 1960s and '70s, but managed a turn in his old boss Welles' unfinished film, The Other Side of the Wind. He married and divorced actresses Nancy Kelly and Olga San Juan, the latter being the mother of his three children, including actors Maria O'Brien and Brendan O'Brien. He died in May of 1985 in Inglewood, California, of Alzheimer's Disease and was interred in Holy Cross Cemetery in Culver City, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI3MjQ0OTMwMl5BMl5BanBnXkFtZTYwNDE4NDky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0639529","name":"Edmond O'Brien","nicknames":["Eddy"],"idIMDB":"nm0639529"},"actorId":"nm0639529","character":"Col. William Bodeen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Saxon","urlProfile":"http://www.imdb.com/name/nm0768334","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjE1NTk3Ml5BMl5BanBnXkFtZTcwOTAzMjg0NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1935","placeOfBirth":" Brooklyn, New York, USA","birthName":"Carmine Orrico","height":"5' 10½\" (1.79 m)","bio":"John Saxon has appeared in nearly 200 roles in the movies and on television in a more-than half-century-long career that has stretched over seven decades since he made his big screen debut in 1954 in uncredited small roles in It Should Happen to You (1954) and George Cukor's A Star Is Born (1954). Born Carmine Orrico on August 5, 1936 in Brooklyn, New York, the son of Italian immigrants Antonio Orrico and Anna (née Protettore), he studied acting with Stella Adler after graduating from New Utrecht High School. He was discovered by talent agent Henry Willson, the man most famous for creating and representing Rock Hudson (as well as a stable of \"beefcake\" male stars and starlets), who signed him up after he saw Saxon's picture on the cover of a magazine. Willson brought the 16-year-old to Southern California, changed his name to John Saxon, and launched his career. Saxon made his television debut on Richard Boone's series Medic (1954) in 1955 and got his first substantial (and credited) role in Running Wild (1955), playing a juvenile delinquent. In the Esther Williams vehicle The Unguarded Moment (1956) (one of her rare dramatic roles), the film's marketing campaign spotlighted him, trumpeting the movie as \"Co-starring the exciting new personality John Saxon.\". By 1958, he seemed to have established himself as a supporting player in A-List pictures, being featured in Blake Edwards's comedy This Happy Feeling (1958) headlined by Debbie Reynolds and Vincente Minnelli's The Reluctant Debutante (1958) with Rex Harrison and Sandra Dee. In the next five years, he worked steadily, including supporting roles in John Huston's The Unforgiven (1960), the James Stewart comedy Mr. Hobbs Takes a Vacation (1962) and Otto Preminger's The Cardinal (1963) while having first billing in the B-movies Cry Tough (1959) and War Hunt (1962). Fluent in Italian, he made his first pictures in Italy in the period, Agostino (1962) and Mario Bava's Evil Eye (1963). Despite his good work with major directors, he failed to succeed as a star. By 1965, he was appearing in the likes of Blood Beast from Outer Space (1965), albeit, top-billed. A more emblematic picture was Sidney J. Furie's The Appaloosa (1966), in which he appeared in Mexican bandito drag as the man who steals the horse of Marlon Brando, another Stella Adler student. The \"ethnic-looking\" Saxon would reprise the role, of sorts, in John Sturges Joe Kidd (1972) in support of superstar Clint Eastwood. In those less politically correct times, many an Italian-American with a dark complexion would be relied on to play Mexicans, Native Americans and other \"exotic\" types like Mongols. Saxon played everything from an Indian chief on Bonanza (1959) to Marco Polo on The Time Tunnel (1966). From 1969 to 1972 season, he was a star of the television series The Bold Ones: The New Doctors (1969), playing the brilliant surgeon Theodore Stuart. When the series ended, he took one of his most famous roles when Bruce Lee demurred over casting Rod Taylor as he was too tall. A black belt in karate, Saxon appeared as Roper in Opération dragon (1973). He has continued to play a wide variety of roles on television and in motion pictures ever since.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjE1NTk3Ml5BMl5BanBnXkFtZTcwOTAzMjg0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0768334","name":"John Saxon","idIMDB":"nm0768334"},"actorId":"nm0768334","character":"Billy Pye","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gene Evans","urlProfile":"http://www.imdb.com/name/nm0262775","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjI5MjUyYzktYjY2YS00MzIyLTlkMDItMzFmMzRkN2FlYjEzXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1922","placeOfBirth":" Holbrook, Arizona, USA","birthName":"Eugene Barton Evans","height":"6' 1½\" (1.87 m)","bio":"Gene Evans was born in Holbrook, Arizona, on July 11, 1922, and was raised in Colton, California. He served in the Army during World War II as a combat engineer, and was awarded the Purple Heart and the Bronze Star for bravery in action. He began his acting career there, performing in a theatrical troupe of GIs in Europe. After the war, he went to Hollywood, where he made his film debut in 1947's Under Colorado Skies (1947). The rugged, red-headed character actor was a familiar face in such westerns as Cattle Queen of Montana (1954), The War Wagon (1967), Support Your Local Sheriff! (1969), The Ballad of Cable Hogue (1970) and Pat Garrett & Billy the Kid (1973). He also starred in the war films The Steel Helmet (1951) and Fixed Bayonets! (1951) and co-starred with future first lady Nancy Reagan (before she became Nancy Reagan) in Donovan's Brain (1953). His other major films include Park Row (1952), The Giant Behemoth (1959), Operation Petticoat (1959) and Walking Tall (1973). He became well known in the 1950s on television, playing the father in My Friend Flicka (1955). He remained active in films and television through the 1980s. Evans subsequently retired to a farm near Jackson, Tennessee. He was a popular guest at the Memphis Film Festival for the past decade.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjI5MjUyYzktYjY2YS00MzIyLTlkMDItMzFmMzRkN2FlYjEzXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0262775","name":"Gene Evans","idIMDB":"nm0262775"},"actorId":"nm0262775","character":"Cole Younger","urlCharacter":"http://www.imdb.com/character/ch0026634","main":true},{"actorName":"Edward Andrews","urlProfile":"http://www.imdb.com/name/nm0028647","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNzQ2OTY2M15BMl5BanBnXkFtZTcwNDk3MjYwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1914","placeOfBirth":" Griffin, Georgia, USA","height":"6' 2\" (1.88 m)","bio":"The son of a Georgia minister, Edward Andrews debuted on stage in 1926 at age 12 and by 1935 had landed on Broadway. A solid character actor, his large physique and amiable demeanor made him a natural for the jovial, grandfatherly type or genial, small-town businessman which he often played, but also served him well when cast against type as a sinister, corrupt businessman or official; memorable as the glad-handing, charming but murderous leader of a corrupt political machine in The Phenix City Story (1955) and, later in his career, as Molly Ringwald's solicitous grandfather in Sixteen Candles (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNzQ2OTY2M15BMl5BanBnXkFtZTcwNDk3MjYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0028647","name":"Edward Andrews","idIMDB":"nm0028647"},"actorId":"nm0028647","character":"Elton Dykstra","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shelly Novack","urlProfile":"http://www.imdb.com/name/nm0636796","urlPhoto":"","biography":{"dateOfBirth":"10 January 1944","placeOfBirth":" Los Angeles County, California, USA","birthName":"Sheldon Lennard Novack","height":"5' 10\" (1.78 m)","bio":"Shelly Novack was a star athlete at Venice High School in California. He later played football at Santa Monica City College, Long Beach State, and was drafted by the San Diego Chargers in 1965. He became an actor through football, much like some other athletes do. Shelly won the first Toyota Grand Prix Pro Celebrity Race in 1977. Although he was a decent actor his passion was sports.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0636796","name":"Shelly Novack","idIMDB":"nm0636796"},"actorId":"nm0636796","character":"Theron Pardo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harry Dean Stanton","urlProfile":"http://www.imdb.com/name/nm0001765","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDYyMTQ2Ml5BMl5BanBnXkFtZTYwMjU2NjE0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 July 1926","placeOfBirth":" West Irvine, Kentucky, USA","height":"5' 8\" (1.73 m)","bio":"Prolific character actor Harry Dean Stanton's drooping, weather-beaten appearance and superb acting talent have been his ticket to appearing in over 100 films, and 50 TV episodes. Stanton was born in West Irvine, Kentucky, to Ersel (Moberly), a cook, and Sheridan Harry Stanton, a barber and tobacco farmer. Stanton served as a cook in the U.S. Navy during World War II, and was on board an LST during the Battle of Okinawa. He then returned to the University of Kentucky to appear in a production of \"Pygmalion\", before heading out to California and honing his craft at the prestigious Pasadena Playhouse. Stanton then toured around the United States with a male choir, worked in children's theater, and then headed back to California. His first role on screen was in the tepid movie Tomahawk Trail (1957), but he was quickly noticed and appeared regularly in minor roles as cowboys and soldiers through the late 1950s and early 1960s. His star continued to rise and he received better roles in which he could showcase his laid-back style, such as in Cool Hand Luke (1967), Kelly's Heroes (1970), Dillinger (1973), The Godfather: Part II (1974), and in Alien (1979). It was around this time that Stanton came to the attention of director Wim Wenders, who cast him in his finest role yet as Travis in the moving Paris, Texas (1984). Next indie director Alex Cox gave Stanton a role that really brought him to the forefront, in the quirky cult film Repo Man (1984). Stanton was now heavily in demand, and his unique look got him cast as everything from a suburban father in the mainstream Pretty in Pink (1986) to a soft-hearted, but ill-fated, private investigator in Wild at Heart (1990) and a crazy yet cunning scientist in Escape from New York (1981). Apart from his film performances, Stanton is also an accomplished musician, and \"The Harry Dean Stanton Band\" and their unique spin on mariachi music have been playing together for well over a decade. They have toured internationally to rave reviews. Stanton became a cult figure of cinema and music and when Debbie Harry sang the lyric \"I want to dance with Harry Dean...\" in her 1990s hit \"I Want That Man\", she was talking about him. As he moved into the time in his life when most other people would be calling it a day, Harry Dean Stanton has remained consistently active on screen, most recently appearing in films including Fear and Loathing in Las Vegas (1998), The Green Mile (1999) and The Man Who Cried (2000). A true gem amongst character actors, and with an on screen presence capable of adding that something extra to any production.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDYyMTQ2Ml5BMl5BanBnXkFtZTYwMjU2NjE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001765","name":"Harry Dean Stanton","idIMDB":"nm0001765"},"actorId":"nm0001765","character":"Whit Dykstra","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stuart Margolin","urlProfile":"http://www.imdb.com/name/nm0546765","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzkxNTE3MjgzNF5BMl5BanBnXkFtZTcwOTM1MDg2OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 January 1940","placeOfBirth":" Davenport, Iowa, USA","height":"5' 10\" (1.78 m)","bio":"Stuart Margolin, the Emmy Award-winning actor and director, was born in Davenport, Iowa. He won two Best Supporting Actor Emmies playing James Garner's former cell-mate \"Angel\" Martin in The Rockford Files (1974). Margolin made his debut in The Gertrude Berg Show (1961) before becoming a series regular on Ensign O'Toole (1962) the following year. His acting career has now spanned more than 50 years. Most of Margolin's work has been on television, where he also has worked as a director since he helmed an episode of Love, American Style (1969) in 1973. He has been directing episodic TV and made-for-TV movies for 37 years. He has been nominated twice for directing Emmies: in 1987 for a Prime Time Emmy for Outstanding Directing in a Variety or Music Program for The Tracey Ullman Show (1987) and in 1999 and a Daytime Emmy for Outstanding Directing in a Children's Special for The Sweetest Gift (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzkxNTE3MjgzNF5BMl5BanBnXkFtZTcwOTM1MDg2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0546765","name":"Stuart Margolin","idIMDB":"nm0546765"},"actorId":"nm0546765","character":"Jesse James","urlCharacter":"http://www.imdb.com/character/ch0000001","main":true},{"actorName":"Zalman King","urlProfile":"http://www.imdb.com/name/nm0455394","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAwNzQzMzE3N15BMl5BanBnXkFtZTcwNjE0OTUzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 May 1942","placeOfBirth":" Trenton, New Jersey, USA","birthName":"Zalman King Lefkowitz","bio":"Zalman King was born on May 23, 1942 in Trenton, New Jersey, USA as Zalman King Lefkowitz. He was a producer and director, known for Two Moon Junction (1988), Wild Orchid (1989) and 9½ Weeks (1986). He was married to Patricia Louisianna Knop. He died on February 3, 2012 in Santa Monica, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAwNzQzMzE3N15BMl5BanBnXkFtZTcwNjE0OTUzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0455394","name":"Zalman King","idIMDB":"nm0455394"},"actorId":"nm0455394","character":"Bob Younger","urlCharacter":"http://www.imdb.com/character/ch0026636","main":true},{"actorName":"Phillip Alford","urlProfile":"http://www.imdb.com/name/nm0019221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMjA1NDQ1OF5BMl5BanBnXkFtZTcwMzM3MjYwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1948","placeOfBirth":" Gadsden, Alabama, USA","birthName":"Phillip Michael Alford","bio":"Phillip Alford was born on September 11, 1948 in Gadsden, Alabama, USA as Phillip Michael Alford. He is an actor, known for To Kill a Mockingbird (1962), Shenandoah (1965) and Fair Play (1972).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMjA1NDQ1OF5BMl5BanBnXkFtZTcwMzM3MjYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0019221","name":"Phillip Alford","idIMDB":"nm0019221"},"actorId":"nm0019221","character":"Harold Gilman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harrison Ford","urlProfile":"http://www.imdb.com/name/nm0000148","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4Mjg0NjIxOV5BMl5BanBnXkFtZTcwMTM2NTI3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1942","placeOfBirth":" Chicago, Illinois, USA","height":"6' 1\" (1.85 m)","bio":"Harrison Ford was born on July 13, 1942 in Chicago, Illinois, to Dorothy (Nidelman), a radio actress, and Christopher Ford (born John William Ford), an actor turned advertising executive. His father was of Irish and German ancestry, while his maternal grandparents were Jewish immigrants from Minsk, Belarus. Harrison was a lackluster student at Maine Township High School East in Park Ridge Illinois (no athletic star, never above a C average). After dropping out of Ripon College in Wisconsin, where he did some acting and later summer stock, he signed a Hollywood contract with Columbia and later Universal. His roles in movies and television (Ironside (1967), The Virginian (1962)) remained secondary and, discouraged, he turned to a career in professional carpentry. He came back big four years later, however, as Bob Falfa in American Graffiti (1973). Four years after that, he hit colossal with the role of Han Solo in Star Wars: Episode IV - A New Hope (1977). Another four years and Ford was Indiana Jones in Raiders of the Lost Ark (1981). Four years later and he received Academy Award and Golden Globe nominations for his role as John Book in Witness (1985). All he managed four years after that was his third starring success as Indiana Jones; in fact, many of his earlier successful roles led to sequels as did his more recent portrayal of Jack Ryan in Patriot Games (1992). Another Golden Globe nomination came his way for the part of Dr. Richard Kimble in The Fugitive (1993). He is clearly a well-established Hollywood superstar. He also maintains an 800-acre ranch in Jackson Hole, Wyoming. Ford is a private pilot of both fixed-wing aircraft and helicopters, and owns an 800-acre (3.2 km2) ranch in Jackson, Wyoming, approximately half of which he has donated as a nature reserve. On several occasions, Ford has personally provided emergency helicopter services at the request of local authorities, in one instance rescuing a hiker overcome by dehydration. Ford began flight training in the 1960s at Wild Rose Idlewild Airport in Wild Rose, Wisconsin, flying in a Piper PA-22 Tri-Pacer, but at $15 an hour, he could not afford to continue the training. In the mid-1990s, he bought a used Gulfstream II and asked one of his pilots, Terry Bender, to give him flying lessons. They started flying a Cessna 182 out of Jackson, Wyoming, later switching to Teterboro, New Jersey, flying a Cessna 206, the aircraft he soloed in. Ford is an honorary board member of the humanitarian aviation organization Wings of Hope. On March 5, 2015, Ford's plane, believed to be a Ryan PT-22 Recruit, made an emergency landing on the Penmar Golf Course in Venice, California. Ford had radioed in to report that the plane had suffered engine failure. He was taken to Ronald Reagan UCLA Medical Center, where he was reported to be in fair to moderate condition. Ford suffered a broken pelvis and broken ankle during the accident, as well as other injuries.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4Mjg0NjIxOV5BMl5BanBnXkFtZTcwMTM2NTI3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000148","name":"Harrison Ford","nicknames":["Harry"],"idIMDB":"nm0000148"},"actorId":"nm0000148","character":"Carl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Hoyt","urlProfile":"http://www.imdb.com/name/nm0398466","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MDEzNTM3MF5BMl5BanBnXkFtZTcwNTk1MjYxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1905","placeOfBirth":" Bronxville, New York, USA","birthName":"John McArthur Hoysradt","height":"5' 10\" (1.78 m)","bio":"John Hoyt was born on October 5, 1905 in Bronxville, New York, USA as John McArthur Hoysradt. He was an actor and writer, known for Gimme a Break! (1981), Spartacus (1960) and Blackboard Jungle (1955). He was married to Doroth Oltman Haveman. He died on September 15, 1991 in Santa Cruz, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MDEzNTM3MF5BMl5BanBnXkFtZTcwNTk1MjYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0398466","name":"John Hoyt","idIMDB":"nm0398466"},"actorId":"nm0398466","character":"Appleton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marlene Tracy","urlProfile":"http://www.imdb.com/name/nm0870548","urlPhoto":"","biography":{"bio":"Marlene Tracy is an actress, known for I Dismember Mama (1972), The Woman Inside (1981) and Picture Mommy Dead (1966).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0870548","name":"Marlene Tracy","idIMDB":"nm0870548"},"actorId":"nm0870548","character":"Kate Guerrera","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ken Swofford","urlProfile":"http://www.imdb.com/name/nm0842855","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMjU5NjY1NTheQTJeQWpwZ15BbWU3MDgxNjU0ODQ@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1933","placeOfBirth":" Du Quoin, Illinois, USA","birthName":"Kenneth Charles Swofford","bio":"Ken Swofford was born on July 25, 1933 in Du Quoin, Illinois, USA as Kenneth Charles Swofford. He is an actor, known for Thelma & Louise (1991), The Andromeda Strain (1971) and Annie (1982). He has been married to Barbara A. Biggs since 1958. They have five children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMjU5NjY1NTheQTJeQWpwZ15BbWU3MDgxNjU0ODQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0842855","name":"Ken Swofford","idIMDB":"nm0842855"},"actorId":"nm0842855","character":"Pomerantz","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0065896","urlIMDB":"http://www.imdb.com/title/tt0065896","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"MCMLXX Universal City Studios, Inc."},"technical":{"runtime":["1 hr 40 min (100 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Color (Technicolor)"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":["Technicolor"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.9","filmingLocations":[{"location":"Universal Studios - 100 Universal City Plaza, Universal City, California, USA"}],"awards":[],"votes":"106","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0046592","name":"Universal Television"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 06:27:55"}}