{"data":{"movies":[{"title":"Frankie and Johnny","originalTitle":"","year":"1966","releaseDate":"19660331","directors":[{"name":"Frederick De Cordova","id":"nm0208111"}],"writers":[{"name":"Alex Gottlieb","id":"nm0331944"},{"name":"Nat Perrin","id":"nm0674759"}],"runtime":"87 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDhlNDUzMjItMGQ3Ni00NTFlLThhMjMtYTllOGNiMDZiODQ2XkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Musical","Romance"],"plot":"A riverboat singer with a weakness for gambling wants to find his lucky red head, but his girlfriend Frankie is not amused.","simplePlot":"A riverboat singer with a weakness for gambling wants to find his lucky red head, but his girlfriend Frankie is not amused.","actors":[{"actorName":"Elvis Presley","urlProfile":"http://www.imdb.com/name/nm0000062","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTEzMTI3Nl5BMl5BanBnXkFtZTYwNTg4MDQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 January 1935","placeOfBirth":" Tupelo, Mississippi, USA","birthName":"Elvis Aron Presley","height":"5' 11¾\" (1.82 m)","bio":"Elvis Aaron Presley was born on January 8, 1935 in East Tupelo, Mississippi, to Gladys Presley (née Gladys Love Smith) and Vernon Presley (Vernon Elvis Presley). He had a twin brother who was stillborn. In September 1948, Elvis and his parents moved to Memphis, Tennessee where he attended Humes High School. In 1953, he attended the senior prom with the current girl he was courting, Regis Wilson. After graduating from high school in Memphis, Elvis took odd jobs working as a movie theater usher and a truck driver for Crown Electric Company. He began singing locally as \"The Hillbilly Cat\", then signed with a local recording company, and then with RCA in 1955. Elvis did much to establish early rock and roll music. He began his career as a performer of rockabilly, an up-tempo fusion of country music and rhythm and blues, with a strong backbeat. His novel versions of existing songs, mixing 'black' and 'white' sounds, made him popular - and controversial - as did his uninhibited stage and television performances. He recorded songs in the rock and roll genre, with tracks like \"Jailhouse Rock\" and \"Hound Dog\" later embodying the style. Presley had a versatile voice and had unusually wide success encompassing other genres, including gospel, blues, ballads and pop music. Teenage girls became hysterical over his blatantly sexual gyrations, particularly the one that got him nicknamed \"Elvis the Pelvis\" (television cameras were not permitted to film below his waist). In 1956, following his six television appearances on The Dorsey Brothers' \"Stage Show\", Elvis was cast in his first acting role, in a supporting part in Love Me Tender (1956), the first of 33 movies he starred in. In 1958, Elvis was drafted into the military, and relocated to Bad Nauheim, Germany. There he met and fell in love with 14-year old army damsel Priscilla Ann Wagner (Priscilla Presley), whom he would eventually marry after an eight-year courtship, and with whom he had his only child, Lisa Marie Presley. Elvis' military service and the \"British Invasion\" of the 1960s reduced his concerts, though not his movie/recording income. Through the 1960s, Elvis settled in Hollywood, where he starred in the majority of his thirty-three movies, mainly musicals, acting alongside some of the most well known actors in Hollywood. Critics panned most of his films, but they did very well at the box office, earning upwards of $150 million total. His last fiction film, Change of Habit (1969), deals with several social issues; romance within the clergy, an autistic child, almost unheard of in 1969, rape, and mob violence. It has recently received critical acclaim. Elvis made a comeback in the 1970s with live concert appearances starting in early 1970 in Las Vegas with over 57 sold-out shows. He toured throughout the United States, appearing on-stage in over 500 live appearances, many of them sold out shows. His marriage ended in divorce, and the stress of constantly traveling as well as his increasing weight gain and dependence upon stimulants and depressants took their toll. Elvis Presley died at age 42 on August 16, 1977 at his mansion in Graceland, near Memphis, shocking his fans worldwide. At the time of his death, he had sold more than 600 million singles and albums. Since his death, Graceland has become a shrine for millions of followers worldwide. Elvis impersonators and purported sightings have become stock subjects for humorists. To date, Elvis Presley is the only performer to have been inducted into three separate music 'Halls of Fame'. Throughout his career, he set records for concert attendance, television ratings and recordings sales, and remains one of the best-selling and most influential artists in the history of popular music.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTEzMTI3Nl5BMl5BanBnXkFtZTYwNTg4MDQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000062","name":"Elvis Presley","nicknames":["The Pelvis","The King","The King of Rock 'n' Roll"],"idIMDB":"nm0000062"},"actorId":"nm0000062","character":"Johnny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Donna Douglas","urlProfile":"http://www.imdb.com/name/nm0235031","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5MzAxNjY2MTReQTJeQWpwZ15BbWU2MDcyMzM0Ng@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 September 1932","placeOfBirth":" Pride, Louisiana, USA","birthName":"Doris Smith","bio":"An honest-to-goodness Southern Belle, similar to her most famous character role, \"Elly May Clampett\" on The Beverly Hillbillies (1962), Donna Douglas grew up in the Baton Rouge, Louisiana area, loving \"critters\". She got married soon after high school, had a son, divorced and won a couple of beauty contests, all within the span of a few years. She moved to New York and soon appeared on television series, including a well-remembered guest-star shot on The Twilight Zone (1959) in one of the series' most famous episodes, _\"The Twilight Zone\" (1959) {Eye of the Beholder (#2.6)_, in which she plays a woman who tries to undergo a series of experimental treatments to make her beautiful, only for the treatments to fail. The twist was she was beautiful, at least to the viewers, but considered hideous to the pig people of the planet, she was on. She immediately won the character role of \"Elly May Clampett\" on one of the greatest situation comedies of all time, The Beverly Hillbillies (1962). This extremely comical series debuted with The Beverly Hillbillies: The Clampetts Strike Oil (1962), on her 30th birthday, Wednesday, September 26th, 1962, which is among the narrowest & sheerest coincidences, that are hardest to believe.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5MzAxNjY2MTReQTJeQWpwZ15BbWU2MDcyMzM0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0235031","name":"Donna Douglas","idIMDB":"nm0235031"},"actorId":"nm0235031","character":"Frankie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harry Morgan","urlProfile":"http://www.imdb.com/name/nm0604702","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4OTc3NzE5MF5BMl5BanBnXkFtZTcwMTc4NDMxNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1915","placeOfBirth":" Detroit, Michigan, USA","birthName":"Harry Bratsberg","height":"5' 6\" (1.68 m)","bio":"Harry Morgan was a prolific character actor who starred in over 100 films and was a stage performer. Known to a younger generation of fans as \"Col. Sherman T. Potter\" on M*A*S*H (1972). Also known for his commanding personality throughout his career, he tackled movies and television in a way no other actor would do it. Born Harry Bratsberg in Detroit, Michigan, to parents Henry Bratsberg, who immigrated from Norway, who was a mechanic, and Anna Olsen, a housewife who immigrated from Sweden. After graduating from Muskegon High School in Muskegon, Michigan, he took on a job as a salesman, before becoming a successful actor. In the many films, several of his most memorable movies, he appeared in were: in one of his firsts, The Omaha Trail (1942), in the next quarter of a century, he would also appear in The Ox-Bow Incident (1943), Wing and a Prayer (1944), State Fair (1945), Dragonwyck (1946), All My Sons (1948), Red Light (1949), Outside the Wall (1950), Dark City (1950) where he met future Dragnet 1967 (1967) co-star Jack Webb, who would be best friends until Webb's death, late in 1982, along with Appointment with Danger (1951). His films credits also include: High Noon (1952), The Glenn Miller Story (1954), Strategic Air Command (1955), among many others. He also co-starred with James Garner in Support Your Local Sheriff! (1969) and its sequel Support Your Local Gunfighter (1971). On television, he is fondly remembered as Spring Byington's jokingly, henpecked neighbor, \"Pete Porter\" on December Bride (1954), where he became the show's scene-stealer. It was also based on a popular radio show that it transferred into television. The show was an immediate success to viewers, which led him into starring his own short-lived spin-off series, Pete and Gladys (1960), which co-starred Cara Williams, who met Morgan in the movie, The Saxon Charm (1948). Morgan began his eight-year association with old friend, Jack Webb, and Universal, starting with Dragnet 1967 (1967), which he played Off. Bill Gannon. For the second time, like December Bride (1954) before this, it was an immediate hit, where it tackled a lot of topics. Dragnet was canceled in 1970, after a 4-season run, due to Morgan's best friend and co-star (Jack Webb) leaving the show to continue producing other shows, such as: Adam-12 (1968) and Emergency! (1972). Morgan would later work with Webb in both short-lived series, The D.A. (1971), opposite Robert Conrad and Hec Ramsey (1972), opposite Richard Boone. After those roles, Morgan ended his contract with both Universal and Mark VII, to sign with 20th Century Fox. Morgan's biggest role was that of a tough-talking, commanding, fun-loving, serious Army Officer, \"Col. Sherman T. Potter\" on M*A*S*H (1972), when he replaced McLean Stevenson, who left the show to unsuccessfully star in his own sitcom. For the third time, the show was still a hit with fans, and at 60, he was nominated for Emmies nine times and won his first and only Emmy in 1980, for Outstanding Supporting Actor. By 1983, M*A*S*H's series was getting very expensive, as well as with the cast, hence, CBS reduced it to 16 episodes. Despite M*A*S*H's finale in 1983, Morgan went on to star in a short-lived spin-off series After MASH (1983), co-starring Jamie Farr and William Christopher, from the original M*A*S*H (1972) series, without series' star Alan Alda. He also co-starred in 2 more short-lived series, as he was over 70, beginning with Blacke's Magic (1986) with Hal Linden and his final role with You Can't Take It with You (1987). That same year, he reprised his role, for a second time as \"Off. Bill Gannon\" in the film, Dragnet (1987), which starred Dan Aykroyd and Tom Hanks. Then, he guest-starred in several shows such as: The Twilight Zone (1985), Renegade (1992), The Jeff Foxworthy Show (1995), for the third time, he also reprised his \"Off. Bill Gannon\" role, supplying his voice on The Simpsons (1989). Towards the end of his acting career, as he reached 80, he had a recurring role as the older college professor on 3rd Rock from the Sun (1996), opposite John Lithgow. Afterwards, he retired from show business and lived with his family. Harry Morgan died on December 7, 2011, at age 96. On confirming his death, his son Charles, said that he had been recently treated for pneumonia. Morgan was also one of the oldest living Hollywood male actors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4OTc3NzE5MF5BMl5BanBnXkFtZTcwMTc4NDMxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0604702","name":"Harry Morgan","idIMDB":"nm0604702"},"actorId":"nm0604702","character":"Cully","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sue Ane Langdon","urlProfile":"http://www.imdb.com/name/nm0486057","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzljMGUxYzgtNzI0NC00MGY5LTg5ZGMtMWE2ZWMyMDdjNTc1XkEyXkFqcGdeQXVyMjU5OTg5NDc@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 March 1936","placeOfBirth":" Paterson, New Jersey, USA","birthName":"Sue Lookhoff","height":"5' 6\" (1.68 m)","bio":"Perky American actress with a sexy style and a flair for comedy. Born in New Jersey, she was raised by her singer mother in New York, Michigan, and Oregon. She began acting as a child, in school and local productions. After college at North Texas State and the University of Idaho, she went to New York and landed work as a singer at the Radio City Music Hall and then as a performer in Broadway musicals. She went to Las Vegas as part of a comedy act and, there, she met Jack Emrek, who introduced her to film and television executives in Los Angeles. She made numerous appearances on television in both comic and dramatic roles and, by the 1960s, was a familiar and popular personality in movies. She specialized in spunky types of great humor, innocent sexiness. Although she was off the screen for much of the late 1970s, she reappeared in a few roles in the 1980s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzljMGUxYzgtNzI0NC00MGY5LTg5ZGMtMWE2ZWMyMDdjNTc1XkEyXkFqcGdeQXVyMjU5OTg5NDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0486057","name":"Sue Ane Langdon","idIMDB":"nm0486057"},"actorId":"nm0486057","character":"Mitzi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nancy Kovack","urlProfile":"http://www.imdb.com/name/nm0468222","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MzgyMTkwN15BMl5BanBnXkFtZTcwMzU4MDMyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 March 1935","placeOfBirth":" Flint, Michigan, USA","birthName":"Nancy Kovach","height":"5' 8½\" (1.74 m)","bio":"A native of Flint, Michigan, Nancy Kovack was a student at the University of Michigan at 15, a radio deejay at 16, a college graduate at 19 and the holder of eight beauty titles by 20. Her professional acting career began on television in New York, first as one of Jackie Gleason's \"Glea Girls\" and then, more prominently, on The Dave Garroway Show (1953), Today (1952) and Beat the Clock (1950). A stage role opened Hollywood doors for Kovack, who signed with Columbia. She later racked up an impressive list of episodic television credits, and was Emmy-nominated for a 1969 guest shot on Mannix (1967). The wife of world-renowned maestro Zubin Mehta of New York Philharmonic fame, Kovack publicly alleges that she was recently bamboozled (to the tune of $150,000) by Susan McDougal, a central figure in the Whitewater scandal.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MzgyMTkwN15BMl5BanBnXkFtZTcwMzU4MDMyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0468222","name":"Nancy Kovack","idIMDB":"nm0468222"},"actorId":"nm0468222","character":"Nellie Bly","urlCharacter":"http://www.imdb.com/character/ch0098310","main":true},{"actorName":"Audrey Christie","urlProfile":"http://www.imdb.com/name/nm0160287","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg0MDhjYmUtNmM4OC00YTYyLWJmOTQtNDY5Y2ZjY2QxZjE0XkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 June 1912","placeOfBirth":" Chicago, Illinois, USA","bio":"Audrey Christie was born on June 27, 1912 in Chicago, Illinois, USA. She was an actress, known for Splendor in the Grass (1961), Carousel (1956) and Frankie and Johnny (1966). She died on December 19, 1989 in West Hollywood, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg0MDhjYmUtNmM4OC00YTYyLWJmOTQtNDY5Y2ZjY2QxZjE0XkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0160287","name":"Audrey Christie","idIMDB":"nm0160287"},"actorId":"nm0160287","character":"Peg","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Strauss","urlProfile":"http://www.imdb.com/name/nm0833865","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTUzMzU0Mzg5OV5BMl5BanBnXkFtZTcwNTQwODkxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 November 1913","placeOfBirth":" New York City, New York, USA","height":"5' 11\" (1.8 m)","bio":"Burly American character actor with a deep gravelly voice who was equally adept at comedy and drama. The son of a theatrical costume designer, Strauss worked as a salesman and also as a singing waiter and busboy before finding success in the stage version of \"Detective Story\" on Broadway. He appeared with José Ferrer in the Broadway revival of \"Twentieth Century.\" Also on Broadway, he played \"Animal\" in \"Stalag, 17\", and repeated the role in the film version (Stalag 17 (1953)). The wildly comic yet appealing character brought Strauss an Oscar nomination for Best Supporting Actor. He had appeared in films as early as 1942 but became most familiar during the 1950s in memorable roles in such films as The Bridges at Toko-Ri (1954) and The Man with the Golden Arm (1955). He continued to appear on stage and also in many television programs and commercials into the '70s. He died of complications from a stroke, leaving a widow and three children from his first marriage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTUzMzU0Mzg5OV5BMl5BanBnXkFtZTcwNTQwODkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0833865","name":"Robert Strauss","idIMDB":"nm0833865"},"actorId":"nm0833865","character":"Blackie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anthony Eisley","urlProfile":"http://www.imdb.com/name/nm0252111","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjE4MzY0MV5BMl5BanBnXkFtZTgwMzE5NDQ2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1925","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Frederick Glendinning Eisley","height":"6' (1.83 m)","bio":"The future stage, screen and TV star (real name: Fred Eisley) was born in Philadelphia. His father was general sales manager and \"troubleshooter\" for a large company, and his work kept the family on the move (up and down the East Coast) throughout Eisley's young life. As early as the days of school plays Eisley knew that he wanted to be an actor, but because he lacked show-business contacts he felt nothing would come of his aspiration. He later took drama courses at the University of Miami, \"not because I thought I could really be an actor, but because I was taking the easy way out to get a degree\". Finally following up on his longtime ambition, Eisley landed a job with a stock company in Pennsylvania, where he worked opposite James Dunn in a stage production of \"A Slight Case of Murder.\" Later roles in long-running plays like \"Mister Roberts\", \"Picnic\" and \"The Desperate Hours\" ensued, along with some early movie (Operation Pacific (1951), Fearless Fagan (1952)) and television (Racket Squad (1950)) work. Eisley later went on to TV and exploitation movie stardom.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjE4MzY0MV5BMl5BanBnXkFtZTgwMzE5NDQ2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0252111","name":"Anthony Eisley","idIMDB":"nm0252111"},"actorId":"nm0252111","character":"Braden","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joyce Jameson","urlProfile":"http://www.imdb.com/name/nm0417055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwOTA1OTQ1MV5BMl5BanBnXkFtZTcwOTA3MjYxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 September 1927","placeOfBirth":" Chicago, Illinois, USA","birthName":"Joyce Beverly Kingsley","bio":"Well-endowed, attractive Joyce Jameson was typecast as 'broads', 'dames' and dizzy blondes - somewhat in the vein of Barbara Nichols. In real life, she was said to have been the antithesis of her screen personae, a graduate in theatre arts from UCLA, highly intelligent and well-read. Joyce began acting in films from 1951, after being 'spotted' at the small Cabaret Club by Steve Allen. At that time, she was already a seasoned performer on stage in musical revue, featured playing multiple parts in shows staged by her then-husband and mentor, Billy Barnes, initially at the Cabaret Club, then at the Las Palmas Theatre in Hollywood, and finally on Broadway. After several small supporting bits on the big screen and the odd ghost-written TV script, Joyce's career gained momentum from the late 1950's. She was seen in better productions, such as Billy Wilder's The Apartment (1960). Adept at dialects and mimicry, Joyce also made a name for herself on The Jack Paar Tonight Show (1957) with a ventriloquist act, featuring her 'alter ego', an imaginary dummy unsurprisingly named 'Marilyn' (the idea of being subsumed by this 'other personality', Joyce was said to have derived from the British horror classic Dead of Night (1945)). Reputedly still more uproarious, were her biting impersonations of Judy Garland, Grace Kelly, and, above all, Marlene Dietrich. Joyce is most fondly remembered for the first of two 'cult' Gothic horrors she made for Roger Corman, loosely based on stories by Edgar Allan Poe. Tales of Terror (1962), finds her (in story number two, 'The Black Cat') as perpetually inebriated Peter Lorre's philandering wife Annabel, who suffers the ignominious fate of being entombed alive in a wine cellar, alongside paramour Vincent Price. Her performance on the way to that demise - at once funny and tragic - amply demonstrated her ability to hold her own in a leading role opposite such dominant personalities as Lorre and Price. She was quite good, too (and certainly very decorative) in her second outing for Corman, The Comedy of Terrors (1963) albeit in a more typical role as decrepit Boris Karloff's ditzy daughter, Amaryllis Trumbull. On television, Joyce had a recurring spot on The Andy Griffith Show (1960) and guested in many classic series, including westerns and science fiction, though her forte was almost certainly comedy. Unable to escape her typecasting, she rarely got the roles her acting talent undoubtedly merited, commenting with justifiable bitterness: \"Everyone expects to cast me as the dumb or victimized blonde. After they interview me, I can just hear them say, 'Hey! She's intelligent, but what do you do with it?'\" (The Pittsburgh Press, July 27,1958).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwOTA1OTQ1MV5BMl5BanBnXkFtZTcwOTA3MjYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0417055","name":"Joyce Jameson","idIMDB":"nm0417055"},"actorId":"nm0417055","character":"Abigail","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0060429","urlIMDB":"http://www.imdb.com/title/tt0060429","business":{"budget":{"money":"$4,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"25","month":"05","year":"1965","remarks":null},{"money":null,"country":null,"day":"30","month":"06","year":"1965","remarks":null}],"copyrightHolder":"© Copyright MCMLXV by F &amp; J Pictures, Inc. All Rights Reserved"},"technical":{"runtime":["1 hr 27 min (87 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Color (Technicolor)"],"aspectRatio":["1.66 : 1"],"camera":null,"laboratory":["Technicolor"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.7","filmingLocations":[{"location":"Samuel Goldwyn Studios - 7200 Santa Monica Boulevard, West Hollywood, California, USA"}],"rated":"APPROVED","awards":[{"award":"Laurel Awards 1966","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Laurel","categories":[{"category":"Musical","names":[]}]}]}],"votes":"1,320","type":"Movie","companyCreditsSimple":[{"idCompany":"co0134950","name":"Edward Small Productions"}],"keywords":{"keywords":["death","bartender","harmonica","fainting","confetti","banjo","parade","guitarist","float","costume","acoustic guitar","drunkenness","audience","gunshot","ritual","mississippi river","blanks","shoeshine boy","knocked unconscious","horse and carriage","punched in the face","reference to marie antoinette","impersonation","reference to madame pompadour","costume ball","new orleans louisiana","marching band","fantasy sequence","oil lamp","songwriter","lucky charm","reference to lillian russell","sheet music","reference to stephen foster","gypsy camp","accordion","tea leaves","fortune teller","husband wife relationship","roulette wheel","pianist","riverboat","dancer","louisiana","performer","rehearsal","dancing","caravan","nylons","chorine","campfire","gypsy","card dealer","music band","chorus line","superstition","pantaloon","casino","boyfriend girlfriend relationship","love triangle","theme song","title based on song","table","gambling","guitar","held at gunpoint","revolver","kiss","womanizer","tough girl","tough guy","fistfight","brawl","violence","card","card game","playing cards","musician","song","singing","singer","acting musician","new york city","manhattan new york city","stage","murder","money","gun","gambler","fair","broadway manhattan new york city","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:25:25"}}