{"data":{"movies":[{"title":"Fun in Acapulco","originalTitle":"","year":"1963","releaseDate":"19631127","directors":[{"name":"Richard Thorpe","id":"nm0861703"}],"writers":[{"name":"Allan Weiss","id":"nm0918902"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzc0YTlmNzktNjBhZS00ZGU2LWI0M2MtNzRhZDMzZWU2MzIzXkEyXkFqcGdeQXVyMTgzOTAxMzA@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Music"],"plot":"Mike works on a boat in Acapulco. When the bratty daughter of the boat owner gets him fired, Mike must find new work. Little boy Rauol helps him get a job as a lifeguard and singer at a local hotel. Clashes abound when Mike runs into the rival lifeguard, who is the champion diver of Mexico. He is angry at Mike for taking some of his hours, and stealing his woman.","simplePlot":"Mike works on a boat in Acapulco. When the bratty daughter of the boat owner gets him fired, Mike must find new work. Little boy Rauol helps him get a job as a lifeguard and singer at a ... ","actors":[{"actorName":"Elvis Presley","urlProfile":"http://www.imdb.com/name/nm0000062","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTEzMTI3Nl5BMl5BanBnXkFtZTYwNTg4MDQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 January 1935","placeOfBirth":" Tupelo, Mississippi, USA","birthName":"Elvis Aron Presley","height":"5' 11¾\" (1.82 m)","bio":"Elvis Aaron Presley was born on January 8, 1935 in East Tupelo, Mississippi, to Gladys Presley (née Gladys Love Smith) and Vernon Presley (Vernon Elvis Presley). He had a twin brother who was stillborn. In September 1948, Elvis and his parents moved to Memphis, Tennessee where he attended Humes High School. In 1953, he attended the senior prom with the current girl he was courting, Regis Wilson. After graduating from high school in Memphis, Elvis took odd jobs working as a movie theater usher and a truck driver for Crown Electric Company. He began singing locally as \"The Hillbilly Cat\", then signed with a local recording company, and then with RCA in 1955. Elvis did much to establish early rock and roll music. He began his career as a performer of rockabilly, an up-tempo fusion of country music and rhythm and blues, with a strong backbeat. His novel versions of existing songs, mixing 'black' and 'white' sounds, made him popular - and controversial - as did his uninhibited stage and television performances. He recorded songs in the rock and roll genre, with tracks like \"Jailhouse Rock\" and \"Hound Dog\" later embodying the style. Presley had a versatile voice and had unusually wide success encompassing other genres, including gospel, blues, ballads and pop music. Teenage girls became hysterical over his blatantly sexual gyrations, particularly the one that got him nicknamed \"Elvis the Pelvis\" (television cameras were not permitted to film below his waist). In 1956, following his six television appearances on The Dorsey Brothers' \"Stage Show\", Elvis was cast in his first acting role, in a supporting part in Love Me Tender (1956), the first of 33 movies he starred in. In 1958, Elvis was drafted into the military, and relocated to Bad Nauheim, Germany. There he met and fell in love with 14-year old army damsel Priscilla Ann Wagner (Priscilla Presley), whom he would eventually marry after an eight-year courtship, and with whom he had his only child, Lisa Marie Presley. Elvis' military service and the \"British Invasion\" of the 1960s reduced his concerts, though not his movie/recording income. Through the 1960s, Elvis settled in Hollywood, where he starred in the majority of his thirty-three movies, mainly musicals, acting alongside some of the most well known actors in Hollywood. Critics panned most of his films, but they did very well at the box office, earning upwards of $150 million total. His last fiction film, Change of Habit (1969), deals with several social issues; romance within the clergy, an autistic child, almost unheard of in 1969, rape, and mob violence. It has recently received critical acclaim. Elvis made a comeback in the 1970s with live concert appearances starting in early 1970 in Las Vegas with over 57 sold-out shows. He toured throughout the United States, appearing on-stage in over 500 live appearances, many of them sold out shows. His marriage ended in divorce, and the stress of constantly traveling as well as his increasing weight gain and dependence upon stimulants and depressants took their toll. Elvis Presley died at age 42 on August 16, 1977 at his mansion in Graceland, near Memphis, shocking his fans worldwide. At the time of his death, he had sold more than 600 million singles and albums. Since his death, Graceland has become a shrine for millions of followers worldwide. Elvis impersonators and purported sightings have become stock subjects for humorists. To date, Elvis Presley is the only performer to have been inducted into three separate music 'Halls of Fame'. Throughout his career, he set records for concert attendance, television ratings and recordings sales, and remains one of the best-selling and most influential artists in the history of popular music.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTEzMTI3Nl5BMl5BanBnXkFtZTYwNTg4MDQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000062","name":"Elvis Presley","nicknames":["The Pelvis","The King","The King of Rock 'n' Roll"],"idIMDB":"nm0000062"},"actorId":"nm0000062","character":"Mike Windgren","urlCharacter":"http://www.imdb.com/character/ch0099329","main":true},{"actorName":"Ursula Andress","urlProfile":"http://www.imdb.com/name/nm0000266","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMjE4NjMzNDReQTJeQWpwZ15BbWU3MDk4OTU2MDQ@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 March 1936","placeOfBirth":" Ostermundigen, Bern, Switzerland","height":"5' 5\" (1.65 m)","bio":"The quintessential jet-set Euro starlet, Ursula Andress was born in the Swiss canton of Berne on March 19, 1936, one of six children in a strict German Protestant family. Although often seeming icily aloof, a restless streak early demonstrated itself in her personality, and she had an impetuous desire to explore the world outside Switzerland. (For instance, she was tracked down by Interpol for running away from boarding school at 17 years old.) The stunning young woman found work as an art model in Rome and did walk-ons in three quickie Italian features before coming to Hollywood. At 19, she met fading matinée idol John Derek, who left his first wife and two children to marry Ursula in 1957, despite the fact that she only spoke a few words of English at the time, and persuaded the new bride to put her acting ambitions on hold for a few years thereafter. The year 1962 saw the virtually unknown Swiss beauty back on the set, playing a small role in the first movie version of Ian Fleming's fanciful \"James Bond\" espionage novels, Dr. No (1962), opposite Sean Connery. Due to the heaviness of her Swiss/German accent, Andress' entire performance had to be dubbed by a voiceover artist. Nevertheless, her striking beauty and smoldering screen presence made a strong impression on moviegoers, immediately establishing her as one of the most desired women in the world and as an ornament to put on-screen alongside some of the most bankable talent of the era, such as Elvis Presley in Fun in Acapulco (1963) and Dean Martin in 4 for Texas (1963). In 1965, she was one of several European starlets to co-star in Quoi de neuf, Pussycat? (1965) -- a film that perhaps sums up mid-'60s pop culture better than any other -- written by Woody Allen, starring Allen and Peter Sellers, with music by Burt Bacharach, a title song performed by Tom Jones and much on-screen sexual romping. Andress appeared in many more racy-for-their time movies in both the United States and Europe, including The 10th Victim (1965), in which she wore a famously ballistic bra, and The Blue Max (1966), where she was aptly cast as the sultry, sexually insatiable wife of an aristocratic World War I German general. She was also featured in Casino Royale (1967), a satirical foray into the world of James Bond, and gave a sparkling performance in the crime caper Perfect Friday (1970). Roles as a prostitute kidnapped by outlaws in Red Sun (1971) and a bombshell nurse hired to titillate a doddering millionaire to death in The Sensuous Nurse (1975) provided plenty of excuses to throw her clothes to the wind, and she was notoriously stripped and slathered in orange paint by a pair of nubiles in The Mountain of the Cannibal God (1978), before taking on the role of King Louis XIV's alluring mistress in Le 5e mousquetaire (1979) . Unmarried since 1966 (she divorced Derek after falling in love with French actor Jean-Paul Belmondo on the Malaysian set of Up to His Ears (1965)), Andress played the field for years, reportedly involved at various times with a host of lovers including (but by no means limited to) Dennis Hopper, Ryan O'Neal, Marcello Mastroianni and Fabio Testi. In 1979, she began what would be a long-term romance with Harry Hamlin, her handsome young co-star from Clash of the Titans (1981) (in which she was cast, predictably, as \"Aphrodite\"). While subsequently traveling in India, Andress' belly began to swell out of her clothing, and she felt very nauseous. What at first seemed a severe case of \"Delhi Belly\" turned out to be pregnancy, her first and only, at age 43. She and Hamlin named the child, who was born in 1980, Dimitri Hamlin. After the birth of her son, Andress scaled back her career, which now focused mostly on slight European films and occasional television roles, as she was raising Dimitri in Rome. Her relationship with Hamlin ended in 1983, and she last worked on a film in 2005. Ursula divides her time between family in Switzerland, friends in Spain and Virginia, and her properties in California and Italy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMjE4NjMzNDReQTJeQWpwZ15BbWU3MDk4OTU2MDQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000266","name":"Ursula Andress","nicknames":["Urs"],"idIMDB":"nm0000266"},"actorId":"nm0000266","character":"Marguerita Dauphin","urlCharacter":"http://www.imdb.com/character/ch0099330","main":true},{"actorName":"Elsa Cárdenas","urlProfile":"http://www.imdb.com/name/nm0194597","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzVlYmZmMGUtMTg4OC00YmRjLWI0MjEtZWY5ZDAyNjA4MThhXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 August 1935","placeOfBirth":" Tijuana, Baja California, Mexico","birthName":"Elsa Cárdenas Rentería","bio":"Elsa Cárdenas was born on August 3, 1935 in Tijuana, Baja California, Mexico as Elsa Cárdenas Rentería. She is known for her work on The Wild Bunch (1969), Código postal (2006) and Giant (1956).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzVlYmZmMGUtMTg4OC00YmRjLWI0MjEtZWY5ZDAyNjA4MThhXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0194597","name":"Elsa Cárdenas","idIMDB":"nm0194597"},"actorId":"nm0194597","character":"Dolores Gomez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Lukas","urlProfile":"http://www.imdb.com/name/nm0510134","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyOTUxMzYxOF5BMl5BanBnXkFtZTcwNzM4MTY5Ng@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1891","placeOfBirth":" Budapest, Austria-Hungary [now Hungary]","birthName":"Pál Lukács","height":"6' 1½\" (1.87 m)","bio":"Oscar-winning actor Paul Lukas was born in Hungary and graduated from the School for Dramatic Arts. In 1916 he went to Kosice (Kassa) to be an actor; in 1918 he became an actor specializing in comedy. For ten years he was the most popular character player and romantic lead of the company. In 1918 he began making in Budapest and in the 1920s he began appearing in films in Austria as well. He journeyed to Hollywood in 1927, where he finally settled down. He wasn't untrue to the stage--he played Dr. Rank to Ruth Gordon's Nora in Henrik Ibsen's \"A Doll's House\" in the Morosco Theatre in New York in 1937--but concentrated on films until 1948. In the '50s he started appearing on stage more and more, and worked in films and on TV only sporadically.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyOTUxMzYxOF5BMl5BanBnXkFtZTcwNzM4MTY5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0510134","name":"Paul Lukas","idIMDB":"nm0510134"},"actorId":"nm0510134","character":"Maximillian Dauphin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larry Domasin","urlProfile":"http://www.imdb.com/name/nm0231315","urlPhoto":"","biography":{"dateOfBirth":"5 March 1955","placeOfBirth":" Los Angeles, California, USA","birthName":"Larry Edward Domasin","bio":"Larry Domasin was born on March 5, 1955 in Los Angeles, California, USA as Larry Edward Domasin. He is an actor, known for Fun in Acapulco (1963), Island of the Blue Dolphins (1964) and The Rare Breed (1966).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0231315","name":"Larry Domasin","idIMDB":"nm0231315"},"actorId":"nm0231315","character":"Raoul Almeido","urlCharacter":"http://www.imdb.com/character/ch0099331","main":true},{"actorName":"Alejandro Rey","urlProfile":"http://www.imdb.com/name/nm0721031","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ3NmM2YTAtOGMwYy00ZjEzLWJjNWUtNDEyNDJlNDRkZjM0L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjU0ODkwMTU@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1930","placeOfBirth":" Buenos Aires, Argentina","height":"5' 10\" (1.78 m)","bio":"Alejandro Rey was born on February 8, 1930 in Buenos Aires, Argentina. He was an actor and director, known for The Flying Nun (1967), Moscow on the Hudson (1984) and The Ninth Configuration (1980). He was married to Joyce E Bowman and Beatriz C Roberto. He died on May 21, 1987 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ3NmM2YTAtOGMwYy00ZjEzLWJjNWUtNDEyNDJlNDRkZjM0L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjU0ODkwMTU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0721031","name":"Alejandro Rey","idIMDB":"nm0721031"},"actorId":"nm0721031","character":"Moreno","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Carricart","urlProfile":"http://www.imdb.com/name/nm0140351","urlPhoto":"","biography":{"dateOfBirth":"18 January 1917","placeOfBirth":" Bordeaux, France","bio":"Robert Carricart was born on January 18, 1917 in Bordeaux, France. He was an actor, known for Robin and the 7 Hoods (1964), T.H.E. Cat (1966) and Fun in Acapulco (1963). He died on March 3, 1993 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0140351","name":"Robert Carricart","idIMDB":"nm0140351"},"actorId":"nm0140351","character":"Jose Garcia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Teri Hope","urlProfile":"http://www.imdb.com/name/nm0394047","urlPhoto":"","biography":{"dateOfBirth":"February1939","placeOfBirth":"","birthName":"Natalie Hope Ronson","height":"5' 2\" (1.57 m)","bio":"Cute and busty 5'2\" blonde Teri Hope was born Natalie Hope Ronson in February, 1939. Teri studied drama at Carnegie Tech in Pittsburgh, Pennsylvania. Hope attended a \"Playboy\"-themed party at the Beta Sigma Rho fraternity house; chapter members at said bash proclaimed Hope the \"Party Playmate\" and submitted her photos to \"Playboy\" magazine. Teri was subsequently chosen as the Playmate of the Month for the September, 1958 issue of \"Playboy.\" In the wake of her Playmate stint Hope went on to a brief acting career which lasted up until the mid 60s: She not only made guest appearances on episodes of such TV series as \"The Gertrude Berg Show,\" \"Hennesey,\" and \"\"Shannon,\" but also has small roles in the Elvis Presley pictures \"Fun in Acapulco\" and \"Roustabout.\"","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0394047","name":"Teri Hope","idIMDB":"nm0394047"},"actorId":"nm0394047","character":"Janie Harkins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mariachi Los Vaqueros","urlProfile":"http://www.imdb.com/name/nm3861532","urlPhoto":"","biography":{"bio":"Mariachi Los Vaqueros is an actor, known for Fun in Acapulco (1963).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3861532","name":"Mariachi Los Vaqueros","idIMDB":"nm3861532"},"actorId":"nm3861532","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mariachi Aguila","urlProfile":"http://www.imdb.com/name/nm3861733","urlPhoto":"","biography":{"bio":"Mariachi Aguila is an actor, known for Fun in Acapulco (1963).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3861733","name":"Mariachi Aguila","idIMDB":"nm3861733"},"actorId":"nm3861733","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0057083","urlIMDB":"http://www.imdb.com/title/tt0057083","business":{"budget":null,"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1963/\">1963</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 37 min (97 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Technicolor"],"filmLength":["2,675 m"],"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"5.8","filmingLocations":[{"location":"Acapulco, Guerrero, Mexico"}],"rated":"PG","awards":[],"votes":"2,125","type":"Movie","companyCreditsSimple":[{"idCompany":"co0197491","name":"Wallis-Hazen"}],"keywords":{"keywords":["lifeguard","singer","diver","rival","fired from the job","diving","rivalry","acapulco mexico"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:25:40"}}