{"data":{"movies":[{"title":"The Tijuana Story","originalTitle":"","year":"1957","releaseDate":"195710","directors":[{"name":"László Kardos","id":"nm0439107"}],"writers":[{"name":"Lou Morheim","id":"nm0605215"}],"runtime":"72 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmFhODEyZDQtMDRkMS00ZmYzLThkMGQtZmRhMjkxNDkwNDUzXkEyXkFqcGdeQXVyNzM0MDQ1Mw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Film-Noir"],"plot":"Tijuana is a city ridden with crime, vice and corruption, with the local Mexican mob stopping anyone who attempts to clean up the city. However, the mob meets its match when it is challenged by a brave newspaper editor.","simplePlot":"Tijuana is a city ridden with crime, vice and corruption, with the local Mexican mob stopping anyone who attempts to clean up the city. However, the mob meets its match when it is ... ","actors":[{"actorName":"Rodolfo Acosta","urlProfile":"http://www.imdb.com/name/nm0010240","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc4NDU5M2QtOWU3Yy00ZDRmLWFkN2MtODc4Y2QwOGRlNTA0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1920","placeOfBirth":" Chamizal, El Paso, Texas","birthName":"Rodolfo Acosta Perez","bio":"Mexican character actor Rodolfo Acosta (born Rodolfo Acosta Pérez) achieved his greatest success in the US, primarily as a villain in westerns. He was born in Chamizal, a section of land disputed by Mexico and Texas due to changes in the Rio Grande river which forms the border. At the time of Acosta's birth, the area was generally accepted by both Mexican and Texas governments as U.S. territory, and Acosta was born an American citizen. He served in the U.S. Navy in naval intelligence during World War II and married Jeanine Cohen, a woman he met in Casablanca during the North African campaign. (She later filed for divorce as a result of his affair with actress Ann Sheridan in the 1950s.) After the war, Acosta worked in Mexico in films of the great director Emilio Fernández, which led to a bit in John Ford's film The Fugitive (1947). He came to the US and was signed by Universal for a small role in One Way Street (1950). He stayed in the US and his sharp, ruthless features led him to a long succession of roles as bandits, Indian warriors and outlaws. In The Tijuana Story (1957), he actually had a sympathetic leading role, but in general he spent his career as a very familiar western bad guy. He died of cancer in 1974 at the age of 54, leaving five children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc4NDU5M2QtOWU3Yy00ZDRmLWFkN2MtODc4Y2QwOGRlNTA0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0010240","name":"Rodolfo Acosta","nicknames":["Rudy"],"idIMDB":"nm0010240"},"actorId":"nm0010240","character":"Manuel Acosta Mesa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Darren","urlProfile":"http://www.imdb.com/name/nm0201626","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MTA2OTUyNF5BMl5BanBnXkFtZTYwNzA2NTU2._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1936","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"James William Ercolani","height":"5' 10½\" (1.79 m)","bio":"Tall, good-looking James Darren was a student of acting coach Stella Adler and made his name in the 1950s in a series of teenage-themed films. A better actor than most of his contemporary teenage heartthrobs, he nevertheless found it difficult to escape the teen-idol image he got in pictures like Gidget (1959) and Gidget Goes Hawaiian (1961). He also gained fame in the early and mid-1960s as a singer, with several hits to his credit, including \"Goodbye Cruel World\" and \"Her Royal Majesty\". His film work tapered off in the 1960s, but he did much TV work and had two hit series, The Time Tunnel (1966) in the 1960s and T.J. Hooker (1982) in the 1980s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MTA2OTUyNF5BMl5BanBnXkFtZTYwNzA2NTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0201626","name":"James Darren","idIMDB":"nm0201626"},"actorId":"nm0201626","character":"Mitch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert McQueeney","urlProfile":"http://www.imdb.com/name/nm0574374","urlPhoto":"","biography":{"dateOfBirth":"5 March 1919","placeOfBirth":" Bridgeport, Connecticut, USA","bio":"After leaving acting, Bob McQueeney became a golf pro. After he and his wife separated, he studied to be a Catholic priest. He was ordained and for the last twenty years of his life served as the director of the Padre Pio Foundation in Cromwell, Connecticut. His wife Patricia became one of Hollywood's most popular agents.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0574374","name":"Robert McQueeney","idIMDB":"nm0574374"},"actorId":"nm0574374","character":"Eddie March","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean Willes","urlProfile":"http://www.imdb.com/name/nm0929795","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDcxYjMxYWYtMmM5My00MGEwLThiNWQtY2IxYjQyNmY1YTcyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1923","placeOfBirth":" Los Angeles, California, USA","bio":"Jean Willes is best known for her roles in a number of B movies in the 1950s and 1960s as well as on the small screen. Lovely and curvaceous, she often played hard-boiled gold-diggers, party girls, gun molls, and saloon girls. She came off as a wily, smarter version of Barbara Nichols or Iris Adrian, and although she was versatile, she never rose to the first tier of stardom; in retrospect, she seems to have been capable of much more than she was given during her three-decade-plus career. Born Jean Donahue in Los Angeles on April 15, 1923, she was raised in Utah and in Seattle, Washington. Interested in an acting career, she returned to the town of her birth and in 1942 started showing up in comedy film shorts for Columbia under her birth name. She was a smart and sexy foil to such enjoyable comics as Harry Langdon, Andy Clyde, Eddie Foy Jr., Joe DeRita, Sterling Holloway, Hugh Herbert, Harry von Zell, Max Baer, the duo of Wally Vernon and Eddie Quillan, and The Three Stooges. After bit parts in such feature-length films as So Proudly We Hail! (1943), Here Come the Waves (1944), and Salty O'Rourke (1945), Willes -- who married a professional wrestler in 1947 and was using her married surname -- began earning co-star status in such post-war feature-length programmers as Revenue Agent (1950) opposite Douglas Kennedy, in A Yank in Indo-China (1952), and in one of Johnny Weissmuller's \"Jungle Jim\" outings; even so, she wisely continued to appear in her bread-and-butter comedy shorts. Willes became a cheesecake fixture in Hollywood, and film and TV work was steady. But when she was lucky enough to score a role in an \"A\" film, she was barely glimpsed, as in the Bob Hope comedy Son of Paleface (1952) and the \"Best Picture\" war epic From Here to Eternity (1953). She had more screen time as the nurse who succumbs to the aliens in the cult sci-fi classic Invasion of the Body Snatchers (1956) and as one of four women vying for the attentions of an aging Clark Gable in The King and Four Queens (1956), one of his lesser efforts. Guest spots on TV gave her greater visibility, and she was frequently seen in westerns (The Life and Legend of Wyatt Earp (1955), Maverick (1957)) and crime dramas (_Perry Mason_), usually playing unsympathetic women although she occasionally played more-respectable characters. Willes had fewer roles in the 1960s. She could be spotted in Ocean's 11 (1960) and as Ernest Borgnine's girlfriend in the film version of McHale's Navy (1964). Her last films were The Cheyenne Social Club (1970) and Bite the Bullet (1975). After a few more TV roles, she retired in 1976. Willes died of liver cancer on January 3, 1989, at the age of 65. Her second husband, NFL football player Gerard Cowhig, died at their Van Nuys, Calif., home in 1995. They had one son, Gerry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDcxYjMxYWYtMmM5My00MGEwLThiNWQtY2IxYjQyNmY1YTcyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0929795","name":"Jean Willes","idIMDB":"nm0929795"},"actorId":"nm0929795","character":"Liz March","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joy Stoner","urlProfile":"http://www.imdb.com/name/nm0832298","urlPhoto":"","biography":{"bio":"Joy Stoner is an actress, known for The Tijuana Story (1957), I Was a Teenage Frankenstein (1957) and Loving You (1957).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0832298","name":"Joy Stoner","idIMDB":"nm0832298"},"actorId":"nm0832298","character":"Linda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Newlan","urlProfile":"http://www.imdb.com/name/nm0627945","urlPhoto":"","biography":{"dateOfBirth":"29 June 1903","placeOfBirth":" Plattsburgh, New York, USA","birthName":"Paul Emory Newland","bio":"Paul Newlan was born on June 29, 1903 in Plattsburgh, New York, USA as Paul Emory Newland. He was an actor, known for M Squad (1957), The Americanization of Emily (1964) and The Slender Thread (1965). He died on November 23, 1973 in Studio City, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0627945","name":"Paul Newlan","idIMDB":"nm0627945"},"actorId":"nm0627945","character":"Peron Diaz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George E. Stone","urlProfile":"http://www.imdb.com/name/nm0831889","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA5NTQyMjg2Ml5BMl5BanBnXkFtZTcwMDQ5NzkxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1903","placeOfBirth":" Lódz, Poland, Russian Empire [now Lódz, Lódzkie, Poland]","birthName":"Gerschon Lichtenstein","height":"5' 3½\" (1.61 m)","bio":"A minor prototype of the \"Runyon-esque\" character for more than three decades, Polish-born actor George E. Stone (né George Stein) was in actuality a close friend of writer Damon Runyon and would play a host of colorful \"dees, dem and dos\" cronies throughout the 1920s, '30s, and '40s. With great names such as Johnnie the Shiek, Boots Burnett, Ice Box Hamilton, Wires Kagel, Ropes McGonigle, Society Max, and Toothpick Charlie, Stone delighted audiences in scores of crimers for decades. A vaudeville and Broadway hoofer in the interim, the runt-sized Stone (5' 3\") finally scored in his first \"grownup\" part as the Sewer Rat in the silent drama 7th Heaven (1927) starring the once-popular romantic pair Charles Farrell and (Academy Award winner) Janet Gaynor. As \"Georgie\" sounded too child-like, he began billing himself as \"George E. Stone.\" From there he was featured in a number of \"tough guy\" potboilers, particularly for Warner Bros. So typed was he as a henchman or thug, that he found few films outside the genre. His gunsels often possessed a yellow streak and could be both broadly comic or threatening in nature, with more than a few of them ending up on a morgue slab before film's end, including his Earl Williams on The Front Page (1931) and Otero in the classic gangster flick Little Caesar (1931). Stone's most popular role of the 1940s was as The Runt in the Boston Blackie film series which ran from 1941 to 1948 and starred Chester Morris. Suffering from failing eyesight in later years, he was virtually blind by the late 1950s but, thanks to friends, managed to secure sporadic film and TV work. From 1958 on, Stone could be glimpsed in a recurring role on the popular courtroom series Perry Mason (1957) as a court clerk. Married to second wife Marjorie Ramey in 1946, he died following a stroke in 1967 in Woodland Hills, California, and was survived by two sisters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA5NTQyMjg2Ml5BMl5BanBnXkFtZTcwMDQ5NzkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0831889","name":"George E. Stone","idIMDB":"nm0831889"},"actorId":"nm0831889","character":"Pino","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Fox","urlProfile":"http://www.imdb.com/name/nm0289147","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDExNzYxNl5BMl5BanBnXkFtZTgwNzkxNTc3MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1921","placeOfBirth":" Yonkers, New York, USA","birthName":"Myron Melvin Fox","bio":"Michael Fox first \"trod the boards\" in grade school plays in his hometown of Yonkers, New York. After toying with the idea of becoming a history teacher, Fox did \"something as foreign to my nature as one could think of\", becoming a \"boomer\" (a migratory railroad worker) and taking jobs as a brakeman with various lines. His interest in acting was rekindled in the mid-'40s and he appeared in several \"little theater\" plays in Los Angeles. An acting-directing stint in a Players Ring production of \"Home of the Brave\" caught the eye of Harry Sauber, an associate of exploitation mogul \"Jungle Sam\" Sam Katzman, and Fox landed his first film role (A Yank in Indo-China (1952)). He appeared in dozens of movies (and innumerable TV episodes) in the decades since; one of his regular TV roles was as the coroner in the courtroom drama Perry Mason (1957).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3NDExNzYxNl5BMl5BanBnXkFtZTgwNzkxNTc3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0289147","name":"Michael Fox","idIMDB":"nm0289147"},"actorId":"nm0289147","character":"Reuben Galindo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Blake","urlProfile":"http://www.imdb.com/name/nm0086706","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MDI0OTc0NF5BMl5BanBnXkFtZTYwNjk3ODU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1933","placeOfBirth":" Nutley, New Jersey, USA","birthName":"Michael James Gubitosi","height":"5' 4\" (1.63 m)","bio":"American actor who began as a child in Our Gang comedies and reappeared as a powerful adult performer of leading and character roles. Born in New Jersey, the young Mickey Gubitosi won a role in MGM's Our Gang series at the age of 5. As one of the more prominent children in the Gang, he gained attention for his cute good looks and his lovable, if somewhat melancholy, personality. In 1940 he took on the stage name Bobby Blake (though he continued to use the name Mickey Gubitosi in the Our Gang series for another three years) and began playing child roles in a wide range of films. He gained a good deal of fame as the Indian sidekick Little Beaver in the Red Ryder series of Westerns. Though roles were sporadic as he grew to manhood, he was never long off the screen (except for a period of military service, 1954-56). But despite some fine work in films like Pork Chop Hill (1959) and Town Without Pity (1961), his career did not take off until his stunning portrayal of killer Perry Smith in In Cold Blood (1967). A number of telling performances in films of the next decade, stardom in a popular television series (Baretta (1975), and several ruefully comic appearances as a guest on The Tonight Show Starring Johnny Carson (1962) made him a popular figure even as his personal difficulties increased. Consumed with anger over his treatment by his family and the studio as a child, he denigrated his early work, suffered bouts of difficulty with drugs, and became known as a difficult, perfectionist person to work with. He quit his successful TV series Hell Town (1985) when his personal demons became overwhelming. After a self-imposed exile of nearly eight years, during which he struggled to right his life, he successfully returned to films and television work, appearing renewed and more confident in himself and his work. In 2001, though, the murder of his wife, Bonnie Bakley, thrust Blake into the limelight in a different way. Admittedly having married Bakley through the coercion of her pregnancy, a routine Bakley had apparently tried with various other celebrities, Blake made no denial of his distaste for the woman, but was by all accounts thrilled with the daughter born to them. Blake was arrested for his wife's murder, but the presumption of innocence trumped what jurors believed to be flimsy evidence, and Blake was acquitted in a trial that made worldwide headlines. Reportedly broke from legal costs, Blake indicated hopefulness that he might be allowed to return to acting work.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MDI0OTc0NF5BMl5BanBnXkFtZTYwNjk3ODU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0086706","name":"Robert Blake","nicknames":["Mickey","Bobby"],"idIMDB":"nm0086706"},"actorId":"nm0086706","character":"Enrique Acosta Mesa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Fawcett","urlProfile":"http://www.imdb.com/name/nm0269514","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDYwNThmMjYtOGI5YS00YzU1LTg1NzQtYjczNGVhZDc4YzI4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 September 1894","placeOfBirth":" High Forest, Minnesota, USA","birthName":"William Fawcett Thompson","bio":"\"Doc T\". as he was known, was a Ph.D., and Professor of Theatre at Michigan State University in the early 1940's, just before World War II. He often spoke about leaving academia and actually trying his hand at the craft he taught. After the war, he got his chance and never looked back.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDYwNThmMjYtOGI5YS00YzU1LTg1NzQtYjczNGVhZDc4YzI4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0269514","name":"William Fawcett","nicknames":["Doc T"],"idIMDB":"nm0269514"},"actorId":"nm0269514","character":"Alberto Rodriguez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Coates","urlProfile":"http://www.imdb.com/name/nm0167656","urlPhoto":"","biography":{"dateOfBirth":"10 March 1921","placeOfBirth":" New York City, New York, USA","bio":"A newspaper and television interviewer, Coates got his start as a columnist for the \"Los Angeles Mirror,\" later doing restaurant coverage. Paul was also a regular on The Tonight Show. He retired in 1966.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0167656","name":"Paul Coates","idIMDB":"nm0167656"},"actorId":"nm0167656","character":"Himself - the Narrator","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0051081","urlIMDB":"http://www.imdb.com/title/tt0051081","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 12 min (72 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Black and White"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.6","filmingLocations":[{"location":"Tijuana, Baja California Norte, Mexico"}],"awards":[],"votes":"28","type":"Movie","companyCreditsSimple":[{"idCompany":"co0015756","name":"Clover Productions"}],"keywords":{"keywords":["mexico","criminal"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:21:29"}}