{"data":{"movies":[{"title":"Mask","originalTitle":"","year":"1985","releaseDate":"19850322","directors":[{"name":"Peter Bogdanovich","id":"nm0000953"}],"writers":[{"name":"Anna Hamilton Phelan","id":"nm0357703"}],"runtime":"120 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxOTgzNTg0Nl5BMl5BanBnXkFtZTgwOTYyMzcxMTE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Biography","Drama"],"plot":"Rusty Dennis is the mother of Rocky, a seriously deformed but extremely intelligent and emotionally warm teenager. Rusty is a no-nonsense mother whose wild lifestyle is often at odds with her tenderness and protectiveness towards Rocky. She is determined that Rocky be given the same chances and happiness that everyone else takes for granted.","simplePlot":"A teenager with a massive facial skull deformity and biker gang mother attempt to live as normal a life as possible under the circumstances.","actors":[{"actorName":"Cher","urlProfile":"http://www.imdb.com/name/nm0000333","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NTM4NzQ1Ml5BMl5BanBnXkFtZTcwNjc3MDgwNA@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 May 1946","placeOfBirth":" El Centro, California, USA","birthName":"Cheryl Sarkisian","height":"5' 8½\" (1.74 m)","bio":"The beat goes on ... and on ... and as strong as ever for this superstar entertainer who has well surpassed the four-decade mark while improbably transforming herself from an artificial, glossy \"flashionplate\" singer into a serious, Oscar-worthy, dramatic actress ... and back again! With more ups and downs than the 2008 Dow Jones Industrial Average, Cher managed to rise like a phoenix from the ashes each time she was down and counted out, somehow re-inventing herself with every changing decade and finding herself on top all over again. As a singer Cher is the only performer to have earned \"top 10\" hit singles in four consecutive decades; as an actress, she and Barbra Streisand are the only two Best Actress Oscar winners to have a #1 hit song on the Billboard charts. At age 62, Cher has yet to decide to get completely off her fabulous roller coaster ride, although she has threatened to on occasion. The daughter of a truck driver, John Sarkisian, and an Arkansas-born mother, Georgia Holt (the former Jackie Jean Crouch), Cher was born in El Centro, California, on May 20, 1946. She has a sister, Georganne LaPiere. Cher is of Armenian heritage on her father's side, and of English and German, with more distant Irish, Dutch, and French, heritage on her mother's side. The father deserted the family when Cher was young, and she was raised by their mother who later married Gilbert LaPiere, a banker. Cher's mother, who had aspirations of being an actress and model herself, paid for Cher's acting classes despite her daughter having undiagnosed dyslexia, which acutely affected her studies. Frustrated, Cher quit Fresno High School at the age of 16 in search of her dream. At that time, she had a brief relationship with actor Warren Beatty. Meeting the quite older (by 11 years) Sonny Bono in 1962 changed the 16-year-old's life forever. Bono was working for record producer Phil Spector at Gold Star Studios in Hollywood at the time and managed to persuade Spector to hire Cher as a session singer. As such, she went on to record backup on such Spector classics as \"You've Lost That Lovin' Feeling\" and \"Be My Baby\". The couple's relationship eventually shifted from soul mates to lovers and she and Sonny married on October 27, 1964. At first Cher sang solo with Sonny behind the scenes writing, arranging and producing her songs. The records went nowhere. Sonny then decided they needed to perform as a team so they put out two songs in 1964 under the recording names of Caesar and Cleo (\"The Letter\" and \"Baby Don't Go\"). Again, no success. The changing of their names, however, seemed to make a difference and in 1965, they officially took on the music world as Sonny & Cher and earned instant rewards. The now 19-year-old Cher and 30-year-old Sonny became huge hits following the release of their first album, \"Look at Us\" (summer, 1965), which contained the hit single \"I Got You Babe\". With the song catapulting to #1, they decided to re-release their earlier single \"Baby Don't Go\", and it also raced up the charts to #8. An assembly line of mild hits dotted the airwaves over the next year or two, culminating in the huge smash hit \"The Beat Goes On\" (#6, 1967). Between 1965 and 1972 Sonny & Cher charted a total of six \"Top 10\" hits. The kooky couple became icons of the late '60s \"flower power\" scene, wearing garish garb and outlandish hairdos and makeup. However, they found a way to make it trendy and were embraced around the world. TV musical variety and teen pop showcases relished their contrasting styles -- the short, excitable, mustachioed, nasal-toned simpleton and the taller, exotic, unflappable fashion maven. They found a successful formula with their repartee, which became a central factor in their live concert shows, even more than their singing. With all this going on, Sonny still endeavored to promote Cher as a solo success. Other than such hits with \"All I Really Want to Do\" (#16) and \"Bang, Bang\" (#2), she struggled to find a separate identity. Sonny even arranged film projects for her but Good Times (1967), an offbeat fantasy starring the couple and directed by future powerhouse William Friedkin, and Cher's serious solo effort Chastity (1969) both flickered out and died a quick death. By the end of the 1960s, Sonny & Cher's career had stumbled as they witnessed the American pop culture experience a drastic evolutionary change. The couple maintained their stage act and all the while Sonny continued to polish it up in a shrewd gamble for TV acceptance. While Sonny on stage played the ineffectual object of Cher's stinging barbs on stage, he was actually the highly motivated mastermind off stage and, amazingly enough, his foresight and chutzpah really paid off. Although the couple had lost favor with the new 70s generation, Sonny encouraged TV talent scouts to catch their live act. The network powers-that-be saw potential in the duo as they made a number of guest TV appearances in specials and on variety and talk shows and in what was essentially \"auditioning\" for their own TV vehicle. The Sonny and Cher Comedy Hour (1971) was given the green light as a summer replacement series and was an instant sensation when it earned its own time spot that fall season. The show received numerous Emmy Award nominations during its run and the couple became stars all over again. Their lively, off-the-wall comedy sketch routines, her outré Bob Mackie fashions and their harmless, edgy banter were the highlights of the hour-long program. Audiences took strongly to the couple who appeared to have a deep-down sturdy relationship. Their daughter Chaz Bono occasionally added to the couple's loving glow on the show. Cher's TV success also generated renewed interest in her as a solo recording artist and she came up with three #1 hits during this time (\"Gypsys, Tramps & Thieves,\" \"Half-Breed\" and \"Dark Lady\"). Behind the scenes, though, it was a different story. A now-confident Cher yearned to be free of husband Sonny's Svengali-like control over her life and career. The marriage split at the seams in 1974 and they publicly announced their separation. The show, which had earned Cher a Golden Globe Award, took a fast tumble as the separation and divorce grew more acrimonious. Eventually they both tried to launch their own solo variety shows, but both failed to even come close to their success as a duo. Audiences weren't interested in Cher without Sonny, and vice versa. In late June of 1975, only three days after the couple's divorce, Cher married rock musician Gregg Allman of The Allman Brothers Band. That marriage imploded rather quickly amid reports of out-of-control drug use on his part. They were divorced by 1977 with only one bright outcome -- son Elijah Allman. In 1976 Sonny and Cher attempted to \"make up\" again, this time to the tune of a second The Sonny and Cher Show (1976). Audiences, however, did not accept the \"friendly\" divorced couple after so much tabloid nastiness. After the initial curiosity factor wore off, the show was canceled amid poor ratings. Moreover, the musical variety show format was on its way out as well. Once again, another decade was looking to end badly for Cher. Cher found a mild success with the \"top 10\" disco hit \"Take Me Home\" in 1979, but not much else. Not one to be counted out, however, the ever resourceful singer decided to lay back and focus on acting instead. At age 36, Cher made her Broadway debut in 1982 in what was essentially her first live acting role with \"Come Back to the Five and Dime, Jimmy Dean, Jimmy Dean\". Centering around a reunion of girlfriends from an old James Dean fan club, her performance was critically lauded. This earned her the right to transfer her stage triumph to film alongside Karen Black and Sandy Dennis. Cher earned critical raves for Come Back to the 5 & Dime, Jimmy Dean, Jimmy Dean (1982), her first film role since 1969. With film #2 came a Best Supporting Actress Oscar nomination and a Golden Globe win for her portrayal of a lesbian toiling in a nuclear parts factory in Silkwood (1983), starring Meryl Streep and Kurt Russell. This in turn was followed by her star turn in Mask (1985) as the blunt, footloose mother of a son afflicted with a rare disease (played beautifully by Eric Stoltz). Once again Cher received high praise and copped a win from the Cannes Film Festival for her poignant performance. Fully accepted by this time as an actress of high-caliber, she integrated well into the Hollywood community. Proving that she could hold up a film outright, she was handed three hit vehicles to star in: The Witches of Eastwick (1987), Suspect (1987), and Moonstruck (1987), for which she won the Academy Award for Best Actress. Along with all this newfound Hollywood celebrity came interest in her as a singer and recording artist again. \"If I Could Turn Back Time (#3) and the Peter Cetera duet \"After All\" (#6) placed her back on the Billboard charts. During the 1990s Cher continued to veer back and forth among films, TV specials and expensively mounted concerts. In January of 1998, tragedy struck when Cher's ex-husband Sonny Bono, who had forsaken an entertainment career for California politics and became a popular Republican congressman in the process, was killed in a freak skiing accident. That same year the duo received a star on the Hollywood Walk of Fame for their contribution to television. In the meantime an astounding career adrenalin rush came in the form of a monstrous, disco-flavored hit single (\"Believe\"). The song became a #1 hit and the same-titled album the biggest hit of her career. \"Believe\" reached #1 in 23 different countries. Having little to prove anymore to anyone, Cher decided to embark on a \"Farewell Tour\" in the early part of the millennium and, after much stretching, her show finally closed in 2005 in Los Angeles. It didn't take long, however, for Cher to return from this self-imposed exile. In 2008, she finalized a deal with Las Vegas' Caesars Palace for the next three years to play the Colosseum. Never say never. Cher returned to films, co-starring opposite Christina Aguilera in Burlesque (2010). In other facets of her life, Cher has been involved with many humanitarian groups and charity efforts over the years, particularly her work as National Chairperson and Honorary Spokesperson of the Children's Craniofacial Association, which was inspired by her work in Mask (1985).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NTM4NzQ1Ml5BMl5BanBnXkFtZTcwNjc3MDgwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000333","name":"Cher","idIMDB":"nm0000333"},"actorId":"nm0000333","character":"Florence 'Rusty' Dennis","urlCharacter":"http://www.imdb.com/character/ch0019904","main":true},{"actorName":"Sam Elliott","urlProfile":"http://www.imdb.com/name/nm0000385","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTk4NDgzMl5BMl5BanBnXkFtZTYwNjU5Nzc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1944","placeOfBirth":" Sacramento, California, USA","birthName":"Samuel Pack Elliott","height":"6' 2\" (1.88 m)","bio":"Tall, thin, wiry Sam Elliott is the classic picture of the American cowboy. Elliott began his acting career on the stage and his film debut was in Butch Cassidy and the Sundance Kid (1969). Although his future wife, Katharine Ross co-starred in the film, the two did not meet until they filmed The Legacy (1978) Together. Over the years there would be few opportunities to act in feature westerns, but it would be television that gave him that opportunity, in The Sacketts (1979), The Shadow Riders (1982) and The Yellow Rose (1983), among others. He would also work in non-westerns, usually as a tough guy, as in Lifeguard (1976) and Road House (1989). In the 1990s, Elliott was back on the western trail, playing everyone from Brig. Gen. John Buford in the film Gettysburg (1993) to Wild Bill Hickok in the made-for-TV movie Buffalo Girls (1995). In 1991 he wrote the screenplay and co-starred with his wife in the made-for-TV western Conagher (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTk4NDgzMl5BMl5BanBnXkFtZTYwNjU5Nzc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000385","name":"Sam Elliott","idIMDB":"nm0000385"},"actorId":"nm0000385","character":"Gar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Stoltz","urlProfile":"http://www.imdb.com/name/nm0000655","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1Njc5MjQyOF5BMl5BanBnXkFtZTYwNzQzNzgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1961","placeOfBirth":" Whittier, California, USA","birthName":"Eric Cameron Stoltz","height":"5' 11\" (1.8 m)","bio":"Eric Cameron Stoltz is a theater-trained actor and producer who has starred in both independent and studio films. He was born on September 30, 1961 in Whittier, California, to Evelyn Vawter, a violinist and schoolteacher, and Jack Stoltz, an elementary school teacher. He has German, English, and Scottish ancestry. Eric was raised in both American Samoa and Santa Barbara, California, where by the age of fourteen, he was earning money by playing piano for the local musical theater productions, including \"Mame\" starring Anthony Edwards, whom he co-starred with as two of Jeff Spicoli's stoner friends in Fast Times at Ridgemont High (1982). The two became friends, and then college roommates when both attended the University of Southern California. Dropping out in his junior year, Eric joined a repertory company that did 10 plays at the Edinburgh Festival in Scotland. Moving to New York in 1981, he studied with Stella Adler and Peggy Feury, and soon appeared in his first film, Fast Times at Ridgemont High (1982). In the 1980s, he garnered attention (and a Golden Globe Nomination) starring as Rocky Dennis in Mask (1985), and in John Hughes' Some Kind of Wonderful (1987). In 1988, he made his Broadway debut in Great Performances: Our Town (1989), for which he was nominated for a Tony Award. In the 1990s, he went back and forth from stage to film, building up an eclectic resume that included studio films (Pulp Fiction (1994), independent films (Sundance Festival Winner The Waterdance (1992), and films that he himself produced (Mr. Jealousy (1997). He also continued to appear on the New York stage both on Broadway (Three Sisters, Two Shakespearean Actors) and off-Broadway (The Importance of Being Ernest, The Glass Menagerie). He continued to work in television as well, doing a recurring role as Helen Hunt's ex on Mad About You (1992), a year on Chicago Hope (1994), and in the television and cable movies Inside (1996) (directed by Arthur Penn), A Killer in the Family (1983) (with Robert Mitchum) and The Passion of Ayn Rand (1999) (with Helen Mirren). Eric Stoltz lives in New Mexico, and has been romantically linked to Ally Sheedy, Jennifer Jason Leigh, Lili Taylor, and Bridget Fonda,. Since 2002 he has concentrated mainly on directing, having done a television movie, several short films, several independent films, and television shows such as Grey's Anatomy (2005), Boston Legal (2004), Nashville (2012), and Glee (2009). In 2014 he became the producing director of the hit CBS show, Madam Secretary (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1Njc5MjQyOF5BMl5BanBnXkFtZTYwNzQzNzgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000655","name":"Eric Stoltz","idIMDB":"nm0000655"},"actorId":"nm0000655","character":"Roy L.'Rocky' Dennis","urlCharacter":"http://www.imdb.com/character/ch0019903","main":true},{"actorName":"Estelle Getty","urlProfile":"http://www.imdb.com/name/nm0001268","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NTkwODI2OF5BMl5BanBnXkFtZTcwMjQzNDg5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1923","placeOfBirth":" New York City, New York, USA","birthName":"Estelle Scher","height":"4' 10½\" (1.49 m)","bio":"She was truly one mother of a mom...on stage, on film and on TV. A favorite firecracker on 80s and 90s television, tiny character player Estelle Getty became best known for her carping, meddlesome moms -- complete with bemused, cynical looks, irreverent digs and dead-pan Henny Youngman-like one-liners. Blunt and down-to-earth off-stage as she was on-, she scored big points with both the young and the old...and all those who fell in between. The middle-class masses and society's underdogs deemed Estelle one of their own. The star who had a hard time playing the star card also taught an earnest lesson to the millions of actor wannabes that it was never too late to get into the big leagues, pursue your dream and come out a winner. After nearly five decades of stage work, she achieved \"overnight\" stardom at age 62. Ill health forced her retirement in 2000 after only a decade and a half of celebrity. Yet even something as sinister as Lewy body dementia, a degenerative brain disease, couldn't take away her indomitable spirit and feistiness. The affliction, which slowly clouds then erases the memory banks, should have claimed her a couple of years after its detection, but she proved the doctors wrong and lived nearly eight years from its onset, dying peacefully in her Hollywood home on July 22, 2008. Getty was born Estelle Scher on July 25, 1923, on the Lower East Side of Manhattan in New York City, the daughter of Sarah (Lacher) and Charles Scher, Polish Jewish immigrants who worked in the glass business. Starry-eyed as a very young child when her father first took her to see a vaudeville show at the New York Academy of Music, Estelle already had a mindset about her future. She almost immediately started taking singing, dancing and acting lessons and, following her graduation from Seward Park High School, began building up experience in the Yiddish theater. She even attempted the stand-up comedy stage on the Catskills \"borscht belt\" circuit in upstate New York, but it was a time of rampant sexism and women comics were a rarity and seldom successful. She wasn't. Her young life took an abrupt, post-World War II turn when she married New York businessman Arthur Gettleman at age 24 in December of 1947 (she went on to use a derivative of her married last name for the stage). Not your typical domesticated wife by any stretch of the imagination, Estelle nevertheless raised two children, sons Barry and Carl, and worked as a secretary for various companies over time. Determined as ever to be an actress, she found moderate compensation performing in community theatre plays. Adept at playing abrasive, insinuating types, she had an innate gift for comedy and stole many scenes in such light-hearted plays as \"Arsenic and Old Lace,\" \"Blithe Spirit,\" \"6 Rms Riv Vu,\" \"Light Up the Sky\" and \"Lovers and Other Strangers\". On the flip side, Estelle demonstrated surprising dramatic stamina in such classics as \"All My Sons,\" \"The Glass Menaqerie\" and \"Death of a Salesman.\" Following decades of obscurity, it was her connection to the actor/playwright Harvey Fierstein that turned the tide and started the ball rolling. Forging a deep friendship in the late 70s after appearing in small New York theaters together, and after considerable prodding by Estelle, Harvey wrote a part for his diminutive friend in the ground-breaking, autobiographical \"Torch Song Trilogy\". Playing Harvey's recalcitrant mother, the show eventually made it to Broadway and Estelle's big debut was a resounding success. Winning the Helen Hayes Award for her performance, she played the feisty foil to Fierstein's raspy-voiced drag queen for five years. While on tour with the play in Los Angeles, Estelle secured an audition for and won the role of viper-tongued Sicilian mama Sophia Petrillo on The Golden Girls (1985). She nearly lost out on the part when it was thought she came off too young to play Bea Arthur's mother. In truth, Estelle was 14 months younger than Bea. Given another go-around, and this time donning a grey wig, age makeup and frumpy apparel, Estelle fully convinced the powers-that-be that she WAS Sophia and the rest is history. The role was a breath of fresh air during an era of strong political correctness. A seven-time consecutive Emmy Award nominee for \"Best Supporting Actress Award,\" she took home the trophy in 1988. In both 1991 and 1992 Estelle won the American Comedy Award for \"Best Supporting Actress\" in a series. The Sophia character was so popular she even went on to play the impish octogenarian in several other shows, including two \"Golden Girls\" spin-offs -- the short-lived The Golden Palace (1992) and \"Empty Nest\". Estelle went on to mother other stars on the big screen as well, including Cher in Mask (1985) and Sylvester Stallone in Stop! Or My Mom Will Shoot (1992), the latter in which she received second billing. The one maternal film role she wanted more than anything did not come her way. When Torch Song Trilogy (1988) was made into a film, actor Fierstein needed star power surrounding him. Anne Bancroft replaced Estelle in the part and she was heartbroken. The movie itself lost much of its impact in its transition from the stage. At the peak of her TV fame, Estelle wrote a 1988 autobiography entitled \"If I Knew Then, What I Know Now... So What?\" with Steve Delsohn. The diminutive dynamo (4'10\") with a big heart was an outspoken activist for gay rights and regularly involved herself in AIDS causes, part of it propelled by a nephew who was diagnosed and later succumbed to the disease. She also became a spokesperson for Alternative Living for the Aging, a nonprofit organization that locates cooperative housing for senior citizens. In 2000, Getty stopped making public appearances after her health and mind began its slow decline. One of her last sightings was in the L.A. audience of \"The Vagina Monologues,\" which starred \"Golden Girls\" co-star Rue McClanahan. Misdiagnosed as having both Parkinson's and Alzheimer's diseases, it was later learned she was suffering from advanced dementia. Estelle died of complications from her disease just three days before her 85th birthday. Long-time husband Arthur, who was only 5'3\" tall himself, never adjusted to Estelle's meteoric rise and the media attention that accompanied it. He quietly maintained her parents' glass business far from the Hollywood glitz...in Florida. He died in 2004. Lifetime television hosted a \"Golden Girls\" reunion, but by this time Estelle was too ill to appear. Shortly after her death, and in tribute to Ms. Getty, Lifetime, which shows reruns of \"The Golden Girls\" almost on a daily basis, announced that it would air ten episodes of the series featuring the \"best of Sophia\". A simple, unadorned service was conducted, as she would have wanted, and she was interred at Hollywood Forever Memorial Park in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NTkwODI2OF5BMl5BanBnXkFtZTcwMjQzNDg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001268","name":"Estelle Getty","nicknames":["Stella","Ettle","Slats"],"idIMDB":"nm0001268"},"actorId":"nm0001268","character":"Evelyn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Dysart","urlProfile":"http://www.imdb.com/name/nm0246004","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNTE2MjI5NDheQTJeQWpwZ15BbWU3MDY1OTk4MDg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1929","placeOfBirth":" Brighton, Massachusetts, USA","birthName":"Richard Allen Dysart","height":"5' 9½\" (1.77 m)","bio":"Richard Dysart served for four years in the Air Force during the Korean War. He was a founding member of the American Conservatory Theatre, San Francisco. He received the Drama Desk Award in 1972 and a Emmy Award in 1992. He was good friends with Diana Muldaur, who played Rosalind Shays on L.A. Law.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNTE2MjI5NDheQTJeQWpwZ15BbWU3MDY1OTk4MDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0246004","name":"Richard Dysart","nicknames":["Dick"],"idIMDB":"nm0246004"},"actorId":"nm0246004","character":"Abe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Laura Dern","urlProfile":"http://www.imdb.com/name/nm0000368","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NzY0MDQxMF5BMl5BanBnXkFtZTcwNzMwMzcyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1967","placeOfBirth":" Saint John's Health Center, Santa Monica, Los Angeles County, California, USA","birthName":"Laura Elizabeth Dern","height":"5' 10½\" (1.79 m)","bio":"Laura Dern was born on February 10, 1967 in Los Angeles, the daughter of actors Bruce Dern and Diane Ladd. Dern was exposed to movie sets and the movie industry from infancy, and obtained several bit parts as a child. Her parents divorced when Dern was two and Dern lost contact with her father for several years as a result. Her parents' background and her own early taste of the moviemaking world soon convinced the young Dern to pursue acting herself. Like so many young actors, her decision may have been influenced by social awkwardness -- the child of 60s counterculture parents, she was steeped in Eastern mysticism and political radicalism, and was seen as an oddball by her more conservative classmates. Her gawky physical appearance didn't help - even before her teens, she had achieved most of her impressive 5' 10\" height, was rail-skinny (other than precociously wide hips), had huge feet and a slouching posture, and for all this was often teased by classmates. Perhaps the nine-year-old Dern found refuge by studying acting at the Lee Strasberg Theater Institute. The first success for the young Dern came in 1980, with a role in Adrian Lyne's Foxes (1980), a teen movie starring Jodie Foster. She followed this with several small parts, or parts in small movies, such as Ladies and Gentlemen, the Fabulous Stains (1982) and Teachers (1984), as a student who has an affair with a teacher. (Her mother objected to her active presence on movie sets at age thirteen, which required Dern to sue for emancipation so she could play her role in \"The Fabulous Stains\"). Her next roles, as the blind girl who befriends the deformed boy in Mask (1985), and as a teenaged girl whose sexual awakening collides with a mysterious older man in Smooth Talk (1985), gave her career an important boost. Dern appeared to have made it with a leading role in David Lynch's acclaimed Blue Velvet (1986), but it was four years before her next notable film, and this was the bizarre Wild at Heart (1990), also directed by Lynch. The following year, Dern starred in Rambling Rose (1991), which would become her signature performance, as a sexually-precocious, free-spirited young housemaid in the South in the 1930s. Dern earned an Oscar nomination for her performance, and so did her mother and co-star, Diane Ladd. Dern continues to win prominent roles on the big screen, often in smaller, highly-regarded human dramas such as October Sky (1999), I Am Sam (2001) and We Don't Live Here Anymore (2004), although she is perhaps most widely known for her repeat role as Ellie Sattler in the summer adventure movies Jurassic Park (1993) and Jurassic Park III (2001), or for her guest performance on Ellen (1994), as the woman to whom Ellen finally comes out as a lesbian. Dern's pre-teen gawkiness matured into lithe beauty, but this doesn't prevent Dern from fearlessly throwing herself into a wide variety of roles which are sometimes unflattering, an excellent example being her unflinchingly comic portrayal of an intensely annoying loser whose pregnancy becomes a social and political football in Citizen Ruth (1996). This results in Dern being one of the most interesting actors working in Hollywood today. Having previously dated such Hollywood talent as Treat Williams, Renny Harlin, Kyle MacLachlan, Jeff Goldblum and Billy Bob Thornton, Dern eventually married musician Ben Harper in 2005. Early in her career, Dern was roommate to Marianne Williamson, the spirituality guru. Dern attended two days of college at UCLA and one semester at USC.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NzY0MDQxMF5BMl5BanBnXkFtZTcwNzMwMzcyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000368","name":"Laura Dern","idIMDB":"nm0000368"},"actorId":"nm0000368","character":"Diana Adams","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Micole Mercurio","urlProfile":"http://www.imdb.com/name/nm0580526","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjVlYzY4MjYtOTNiNS00N2NhLWI3NGItYzFmOTJjNzMxYWYwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 March 1938","placeOfBirth":" Chicago, Illinois, USA","birthName":"Micole Diana Mercurio","bio":"Micole Diana Mercurio was born Diana Mercurio in Chicago, to Mary and Michael Mercurio, on March 10, 1938. The first born of her generation and a beautiful child, she flourished under the attention of her extended Italian-American family. Her father had been a captain in the Italian Army and became a private in the American Army to serve his country and support his family. Her mother was a working woman. The house Micole grew up in was a multi-family home because it takes a village. She grew up, married a local boy, and had four children. Tragically, SIDS took one child. Ever-resilient, she forged on enduring more tragedy until she went West. Once in California, she had a series of jobs, the kinds of things you do to make ends meet. She worked at a magazine, did some legal assistant work as a temp and pursued the dream of acting. Micole studied acting with Milton Katselas, working as an \"intern\" in lieu of paying tuition. She accepted all and any roles and endured through a lot of rejection. Hollywood is not kind to women over 40, especially back in 1980. Big blond hair, a winning smile and that sparkle that lights up a room, she soon got her AFTRA and SAG cards. She taught ESL to adults at night and would audition during the day. She continued to do theater and worked really hard, using her emotional history to bring depth and range to her acting. Micole helped to mentor the next generation of actors after she formally retired from film, television and theater. She helped coach new talent and continued to teach. She volunteered at rehabilitation facility, driving for hours round trip to do so. She was a warm and wonderful person and a tremendous talent and will be greatly missed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjVlYzY4MjYtOTNiNS00N2NhLWI3NGItYzFmOTJjNzMxYWYwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0580526","name":"Micole Mercurio","idIMDB":"nm0580526"},"actorId":"nm0580526","character":"Babe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harry Carey Jr.","urlProfile":"http://www.imdb.com/name/nm0001013","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjAyODY2MV5BMl5BanBnXkFtZTcwNjE4MTg5Nw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1921","placeOfBirth":" Saugus, California, USA","birthName":"Henry George Carey","height":"6' 1\" (1.85 m)","bio":"Harry Carey, Jr., had been reliable character actor for decades, mostly in Westerns, before he retired. He is the son of the actor Harry Carey and the actress Olive Carey. He was born on his parents' 1000-acre ranch near Saugus, in the northwestern part of Los Angeles County, which is now next door to Santa Clarita, a large town that certainly did not exist in 1947 or for decades longer. Thus, the young Harry Carey, Jr., grew up among cattle and horses at the ranch. Because of a large group of Navajo Indians who worked on his parents' ranch, he learned to speak the Navajo language at the same time that he was learning to speak English. During World War II, Carey enlisted in the U.S. Navy, and he served in the Pacific Theater first as a Navy medical corpsman. However, he was transferred back to the United States (against his wishes) to serve under his father's good friend, the director John Ford, in making movies for the Navy (training films)and the O.S.S. (propaganda films). After World War II ended, Carey tried to make a career in singing, but he was not successful at this. Hence, he moved into acting, and after a couple of small acting parts, he was given a chance to work in a motion picture with his father, the John Wayne film Red River (1948). (However, the father and the son did not have any scenes with one another). After the death of Harry Carey, Sr., in 1946, Mr. Ford gave the younger Carey a leading role in the movie that Ford dedicated to the memory of Harry Carey, Sr., in 1948, 3 Godfathers (1948). As a full-fledged member of the noted John Ford Stock Company, Carey, Jr., appeared in many of Mr. Ford's epic Westerns during the following two decades. Carey also starred in a series-within-a-series on TV, The Adventures of Spin and Marty (1955), which was shown as a part of The Mickey Mouse Club (1955). Very boyish looks characterized Carey's early years, but he matured into a strong and familiar character actor over the following four decades, and he acted in scores of films and TV programs in his long career. Carey, Jr., is married to Marilyn Fix Carey, the daughter of the actor Paul Fix.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjAyODY2MV5BMl5BanBnXkFtZTcwNjE4MTg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001013","name":"Harry Carey Jr.","nicknames":["Dobe"],"idIMDB":"nm0001013"},"actorId":"nm0001013","character":"Red","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dennis Burkley","urlProfile":"http://www.imdb.com/name/nm0122036","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMjAzNDg4Ml5BMl5BanBnXkFtZTcwNTc4NjQyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1945","placeOfBirth":" Van Nuys, Los Angeles, California, USA","birthName":"Dennis Henry Burkely","height":"6' 3\" (1.91 m)","bio":"Dennis Burkley was born on September 10, 1945 in Van Nuys, Los Angeles, California, USA as Dennis Henry Burkely. He was an actor and director, known for The Doors (1991), Tin Cup (1996) and Mask (1985). He was married to Laura Alderdice. He died on July 14, 2013 in Sherman Oaks, Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMjAzNDg4Ml5BMl5BanBnXkFtZTcwNTc4NjQyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0122036","name":"Dennis Burkley","nicknames":["Big D"],"idIMDB":"nm0122036"},"actorId":"nm0122036","character":"Dozer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lawrence Monoson","urlProfile":"http://www.imdb.com/name/nm0598413","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzAyOTAzOF5BMl5BanBnXkFtZTcwOTU4MTU5Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 August 1964","placeOfBirth":" Yonkers, New York, USA","height":"5' 9\" (1.75 m)","bio":"Lawrence Monoson, a New York native is a veteran actor with a career spanning over 20 years. Born on August 11, 1964, in Yonkers, Lawrence is easily known for his early film roles starting back in the early to mid 1980s. Monoson appeared in the film The Last American Virgin (1982), followed three years later with a role in the horror movie Friday the 13th: The Final Chapter (1984). Going into the 1990s, Lawrence Monoson mostly found work throughout various television series, including Star Trek: Deep Space Nine (1993), Beverly Hills, 90210 (1990), JAG (1995), Touched by an Angel (1994), ER (1994) and Prince Street (1997). As the 21st century arrived, Lawrence continued working mostly on the small screen, with work on Star Trek: Enterprise (2001), CSI: Crime Scene Investigation (2000) and CSI: Miami (2002). He also co-starred in the direct-to-video sequel Starship Troopers 2: Hero of the Federation (2004). His work has been strongly focused in television where he added more episodic contributions in NCIS (2003), Cold Case (2003), The Closer (2005) and CSI: NY (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NzAyOTAzOF5BMl5BanBnXkFtZTcwOTU4MTU5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0598413","name":"Lawrence Monoson","idIMDB":"nm0598413"},"actorId":"nm0598413","character":"Ben","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ben Piazza","urlProfile":"http://www.imdb.com/name/nm0681319","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc2Y2MzZmEtMmI5Ni00MjQ3LTk4NzItODgwMjU3N2UzYmIwL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1933","placeOfBirth":" Little Rock, Arkansas, USA","birthName":"Benito Daniel Piazza","bio":"Ben Piazza was born on July 30, 1933 in Little Rock, Arkansas, USA as Benito Daniel Piazza. He was an actor, known for The Bad News Bears (1976), The Blues Brothers (1980) and Mask (1985). He was married to Dolores Dorn. He died on September 7, 1991 in Sherman Oaks, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc2Y2MzZmEtMmI5Ni00MjQ3LTk4NzItODgwMjU3N2UzYmIwL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0681319","name":"Ben Piazza","idIMDB":"nm0681319"},"actorId":"nm0681319","character":"Mr. Simms","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"L. Craig King","urlProfile":"http://www.imdb.com/name/nm0454973","urlPhoto":"","biography":{"dateOfBirth":"20 October 1962","placeOfBirth":" Atlanta, Georgia, USA","bio":"L. Craig King was born on October 20, 1962 in Atlanta, Georgia, USA. He is an actor and director, known for Mask (1985), Here We Grow: A Restoration of Food (2009) and Dynasty (1981). He was previously married to Jessica Fox.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0454973","name":"L. Craig King","idIMDB":"nm0454973"},"actorId":"nm0454973","character":"Eric","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alexandra Powers","urlProfile":"http://www.imdb.com/name/nm0694490","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MTQxODU0Ml5BMl5BanBnXkFtZTYwOTkyMzg2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1967","placeOfBirth":" New York City, New York, USA","birthName":"Alexandra Kristin Powers","bio":"Alexandra Powers was born on September 9, 1967 in New York City, New York, USA as Alexandra Kristin Powers. She is an actress, known for Dead Poets Society (1989), Last Man Standing (1996) and Rising Sun (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MTQxODU0Ml5BMl5BanBnXkFtZTYwOTkyMzg2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0694490","name":"Alexandra Powers","idIMDB":"nm0694490"},"actorId":"nm0694490","character":"Lisa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kelly Jo Minter","urlProfile":"http://www.imdb.com/name/nm0591702","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NDY4NjMwMF5BMl5BanBnXkFtZTcwNzk1OTgwMw@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 September 1966","placeOfBirth":" North Trenton, New Jersey, USA","height":"5' (1.52 m)","bio":"Kelly Jo Minter was born on September 24, 1966 in North Trenton, New Jersey, USA. She is an actress and producer, known for A Nightmare on Elm Street 5: The Dream Child (1989), The Lost Boys (1987) and The People Under the Stairs (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NDY4NjMwMF5BMl5BanBnXkFtZTcwNzk1OTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0591702","name":"Kelly Jo Minter","idIMDB":"nm0591702"},"actorId":"nm0591702","character":"Lorrie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Unger","urlProfile":"http://www.imdb.com/name/nm0881161","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNzkxOTk0NF5BMl5BanBnXkFtZTcwNjczNzc0NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1949","placeOfBirth":" Lake County, Tennessee, USA","bio":"Joe Unger was born on May 25, 1949 in Lake County, Tennessee, USA. He is an actor, known for A Nightmare on Elm Street (1984), Escape from New York (1981) and Total Recall (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNzkxOTk0NF5BMl5BanBnXkFtZTcwNjczNzc0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0881161","name":"Joe Unger","idIMDB":"nm0881161"},"actorId":"nm0881161","character":"1st Boyfriend","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0089560","urlIMDB":"http://www.imdb.com/title/tt0089560","business":{"budget":{"money":"$8,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1984/\">1984</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr (120 min)","2 hr 7 min (127 min) (director's cut) (USA)"],"soundMix":["Mono"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.2","filmingLocations":[{"location":"William Howard Taft Charter High School, Woodland Hills, California, USA"}],"rated":"PG-13","awards":[{"award":"Academy Awards, USA 1986","titlesAwards":[{"titleAwardOutcome":"Won Oscar","categories":[{"category":"Best Makeup","names":[{"name":"Michael Westmore","id":"nm0922878","role":null},{"name":"Zoltan Elek","id":"nm0253227","role":null}]}]}]},{"award":"Golden Globes, USA 1986","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Performance by an Actress in a Motion Picture - Drama","names":[{"name":"Cher","id":"nm0000333","role":null}]},{"category":"Best Performance by an Actor in a Supporting Role in a Motion Picture","names":[{"name":"Eric Stoltz","id":"nm0000655","role":null}]}]}]},{"award":"BAFTA Awards 1986","titlesAwards":[{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best Make Up Artist","names":[{"name":"Michael Westmore","id":"nm0922878","role":null}]}]}]},{"award":"Cannes Film Festival 1985","titlesAwards":[{"titleAwardOutcome":"Won Best Actress","categories":[{"category":"","names":[{"name":"Cher","id":"nm0000333","role":null}]}]},{"titleAwardOutcome":"Nominated Palme d'Or","categories":[{"category":"","names":[{"name":"Peter Bogdanovich","id":"nm0000953","role":null}]}]}]},{"award":"Casting Society of America, USA 1986","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Best Casting for Feature Film, Drama","names":[{"name":"Jackie Burch","id":"nm0120799","role":null}]}]}]},{"award":"Los Angeles Film Critics Association Awards 1985","titlesAwards":[{"titleAwardOutcome":"Won New Generation Award","categories":[{"category":"","names":[{"name":"Laura Dern","id":"nm0000368","role":null},{"name":"Smooth Talk","id":"tt0090037","role":null}]}]}]},{"award":"Writers Guild of America, USA 1986","titlesAwards":[{"titleAwardOutcome":"Nominated WGA Award (Screen)","categories":[{"category":"Best Screenplay Written Directly for the Screen","names":[{"name":"Anna Hamilton Phelan","id":"nm0357703","role":null}]}]}]}],"votes":"21,417","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"}],"keywords":{"keywords":["teenager","prejudice","biker gang","biker","deformity","motorcycle","eighth grade graduation","main character dies","blind person reads a face","blind person experiences colors","funhouse mirror","craniodiaphyseal dysplasia","one word title","teenage girl","sex","young love","nonconformity","father daughter estrangement","drug addict","disfigured face","summer camp","death","california","broken dream","blindness","teenage boy","freak","disfigurement","dignity","compassion","mother son relationship","sport card","balisong","based on true story","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:13:13"}}