{"data":{"movies":[{"title":"La race des champions","originalTitle":"The Boy in Blue","year":"1986","releaseDate":"19860117","directors":[{"name":"Charles Jarrott","id":"nm0418986"}],"writers":[{"name":"Douglas Bowie","id":"nm0101147"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMDQ3NTA0OV5BMl5BanBnXkFtZTcwNjEwNjA0MQ@@._V1.jpg","countries":["Canada"],"languages":["English"],"genres":["Biography","Drama","Sport"],"plot":"Based on the life of Ned Hanlan, the late-19th century Canadian sculler and world champion. Hanlan was one of the first scullers to successfully utilize the \"sliding seat.\"","simplePlot":"Based on the life of Ned Hanlan, the late-19th century Canadian sculler and world champion. Hanlan was one of the first scullers to successfully utilize the \"sliding seat.\"","actors":[{"actorName":"Nicolas Cage","urlProfile":"http://www.imdb.com/name/nm0000115","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMDM4Nzk2MV5BMl5BanBnXkFtZTcwNTcwNjExOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1964","placeOfBirth":" Long Beach, California, USA","birthName":"Nicholas Kim Coppola","height":"6' (1.83 m)","bio":"Nicolas Cage was born Nicolas Kim Coppola in Long Beach, California, the son of comparative literature professor August Coppola (whose brother is director Francis Ford Coppola) and dancer/choreographer Joy Vogelsang. He is of Italian (father) and Polish, German, and English (mother) descent. Cage changed his name early in his career to make his own reputation, succeeding brilliantly with a host of classic, quirky roles by the late 1980s. Initially studying theatre at Beverly Hills High School (though he dropped out at seventeen), he secured a bit part in Fast Times at Ridgemont High (1982) -- most of which was cut, dashing his hopes and leading to a job selling popcorn at the Fairfax Theater, thinking that would be the only route to a movie career. But a job reading lines with actors auditioning for uncle Francis' Rumble Fish (1983) landed him a role in that film, followed by the punk-rocker in Valley Girl (1983), which was released first and truly launched his career. His one-time passion for method acting reached a personal limit when he smashed a street-vendor's remote-control car to achieve the sense of rage needed for his gangster character in The Cotton Club (1984). In his early 20s, he dated Jenny Wright for two years and later linked to Uma Thurman. After a relationship of several years with Christina Fulton, a model, they split amicably and share custody of a son, Weston Cage (b.1992). In 2004, he married Alice Kim Cage, with whom he has a son.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMDM4Nzk2MV5BMl5BanBnXkFtZTcwNTcwNjExOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000115","name":"Nicolas Cage","nicknames":["Nick"],"idIMDB":"nm0000115"},"actorId":"nm0000115","character":"Ned Hanlan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cynthia Dale","urlProfile":"http://www.imdb.com/name/nm0197664","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNjg1MTEyOV5BMl5BanBnXkFtZTcwMzQ1MTgwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1961","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Cynthia Ciurluini","bio":"Cynthia Dale was born in 1961 in Toronto, Ontario, Canada as Cynthia Ciurluini. She is an actress and producer, known for Street Legal (1987), Moonstruck (1987) and Meurtres à la St-Valentin (1981). She has been married to Peter Mansbridge since 1998. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNjg1MTEyOV5BMl5BanBnXkFtZTcwMzQ1MTgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0197664","name":"Cynthia Dale","idIMDB":"nm0197664"},"actorId":"nm0197664","character":"Margaret","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Plummer","urlProfile":"http://www.imdb.com/name/nm0001626","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzQ5MDY3NF5BMl5BanBnXkFtZTcwNzMxOTU5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1929","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Arthur Christopher Orme Plummer","height":"5' 10½\" (1.79 m)","bio":"Arthur Christopher Orme Plummer was born in Toronto, Ontario. He is the only child of Isabella Mary (Abbott), a secretary to the Dean of Sciences at McGill University, and John Orme Plummer, who sold securities and stocks. He is a great-grandson of John Abbott, who was Canada's third Prime Minister (from 1891 to 1892), and a great-great-great-grandson of Anglican clergyman John Bethune. He has Scottish, English, and Anglo-Irish ancestry. Plummer was raised in Senneville, Quebec, by Montreal. Until the 2009 Academy Awards were announced, it could be said about Plummer that he was the finest actor of the post-World War II period to fail to get an Academy Award. In that, he was following in the footsteps of the late great John Barrymore, whom Plummer so memorably portrayed on Broadway in a one-man show that brought him his second Tony Award. In 2010, Plummer finally got an Oscar nod for his portrayal of another legend, Leo Tolstoy in Tolstoï, le dernier automne (2009). Two years later, the first paragraph of his obituary was written when the 82-year-old Plummer became the oldest person in Academy history to win an Oscar. He won for playing a senior citizen who comes out as gay after the death of his wife in the movie Beginners (2010). As he clutched his statuette, the debonaire thespian addressed it thusly: \"You're only two years older than me darling, where have you been all of my life?\" Plummer then told the audience that at birth, \"I was already rehearsing my Academy acceptance speech, but it was so long ago mercifully for you I've forgotten it.\" The Academy Award was a long time in coming and richly deserved. Aside from the youngest member of the Barrymore siblings (which counted Oscar-winners Ethel Barrymore and Lionel Barrymore in their number), Christopher Plummer is the premier Shakespearean actor to come out of North America in the 20th century. He was particularly memorable as Hamlet, Iago and Lear, though his Macbeth opposite Glenda Jackson was -- and this was no surprise to him due to the famous curse attached to the \"Scottish Play\" -- a failure. Plummer also has given many fine portrayals on film, particularly as he grew older and settled down into a comfortable marriage with his third wife Elaine. He thanked her from the stage during the 2012 Oscar telecast, quipping that she \"deserves the Nobel Peace Prize for coming to my rescue every day of my life.\" Like another great stage actor, Richard Burton, the younger Plummer failed to connect with the screen in a way that would make him a star. Dynamic on stage, the charisma failed to transfer through the lens onto celluloid. Burton's early film career, when he was a contract player at 20th Century-Fox, failed to ignite despite his garnering two Oscar nominations early on. He did not become a superstar until the mid-1960s, after hooking up with Elizabeth Taylor on the set of Cleopatra (1963). It was Liz whom he credited with teaching him how to act on film. Christopher Plummer never made it as a leading man in films. Perhaps if he had been born earlier, and acted in the studio system of Hollywood's golden age, he could have been carefully groomed for stardom. As it was he shared the English stage actors' disdain -- and he was equally at home in London as he was on the boards of Broadway or on-stage in his native Canada -- for the movies, which did not help him in that medium, as he has confessed. As he aged, Plummer excelled at character parts. He was always a good villain, this man who garnered kudos playing Lucifer on Broadway in Archibald Macleish's Pulitzer Prize-winning \"J.B.\". Though he likely always be remembered as \"Captain Von Trapp\" in the atomic bomb-strength blockbuster The Sound of Music (1965) (a film he publicly despised until softening his stance in his 2008 autobiography \"In Spite of Me\"), his later film work includes such outstanding performances as the best cinema Sherlock Holmes--other than Basil Rathbone -- in Murder by Decree (1979), the chilling villain in L'argent de la banque (1978), his iconoclastic Mike Wallace in The Insider (1999), the empathetic psychiatrist in A Beautiful Mind (2001), and as Leo Tolstoy in Tolstoï, le dernier automne (2009). It was this last role that finally brought him recognition from the Academy of Motion Picture Arts & Sciences, when he was nominated as Best Actor in a supporting role. Plummer remains one of the most respected and honored actors performing in the English language. He's won two Emmy Awards out of six nominations stretching 46 years from 1959 and 2005, and one Genie Award in five nominations from 1980 to 2004. For his stage work, Plummer has racked up two Tony Awards on six nominations, the first in 1974 as Best Actor (Musical) for the title role in \"Cyrano\" and the second in 1997, as Best Actor (Play), in \"Barrymore\". Surprisingly, he did not win (though he was nominated) for his masterful 2004 performance of \"King Lear\", which he originated at the Stratford Festival in Ontario and brought down to Broadway for a sold-out run. His other Tony nominations show the wide range of his talent, from a 1959 nod for the Elia Kazan-directed production of Macleish's \"J.B.\" to recognition in 1994 for Harold Pinter's \"No Man's Land\", with a 1982 Best Actor (Play) nomination for his \"Iago\" in William Shakespeare's \"Othello\". He continues to be a very in-demand character actor in prestigious motion pictures. If he were English rather than Canadian, he'd have been knighted long ago. (In 1968, he was awarded Companion of the Order of Canada, the country's highest civilian honor and one which required the approval of the sovereign, Queen Elizabeth II.) If he lived in the company town of Los Angeles rather than in Connecticut, he likely would have several more Oscar nominations before winning his first for \"The Last Station\". As it is, as attested to in his witty and well-written autobiography, Christopher Plummer has been amply rewarded in life. In 1970, Plummer - a self-confessed 43-year-old \"bottle baby\" - married his third wife, dancer Elaine Taylor, who helped wean him off his dependency on alcohol. They live happily with their dogs on a 30-acre estate in Weston, Connecticut. Although he spends the majority of his time in the United States, he remains a Canadian citizen. His daughter, with actress Tammy Grimes, is actress Amanda Plummer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzQ5MDY3NF5BMl5BanBnXkFtZTcwNzMxOTU5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001626","name":"Christopher Plummer","nicknames":["Chris"],"idIMDB":"nm0001626"},"actorId":"nm0001626","character":"Knox","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Naughton","urlProfile":"http://www.imdb.com/name/nm0622544","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjMwNTg0ZjAtOTcxMS00MGExLWFkNzMtYzRlNGQ2YzVhNzU5L2ltYWdlXkEyXkFqcGdeQXVyMjI3MjU5NTQ@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1951","placeOfBirth":" Hartford, Connecticut, USA","birthName":"David Walsh Naughton","height":"5' 10½\" (1.79 m)","bio":"David Naughton made his professional debut in the New York Shakespeare Festival's production of \"Hamlet\" in Lincoln Center starring Sam Waterston. Was cast as the lead singer/dancer in the \"Be A Pepper\" Ad campaign for Dr. Pepper. Starred in John Landis's classic horror film An American Werewolf in London (1981) which won Rick Baker his first Oscar. Also starred in Michael J. Fox's film debut Midnight Madness (1980), as well as the ski comedy Hot Dog... The Movie (1984). Played opposite Pam Dawber and the late Rebecca Schaeffer in My Sister Sam (1986) on CBS. Recorded the hit disco single \"Makin It\" and also starred in the ABC series of the same name, Makin' It (1979).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjMwNTg0ZjAtOTcxMS00MGExLWFkNzMtYzRlNGQ2YzVhNzU5L2ltYWdlXkEyXkFqcGdeQXVyMjI3MjU5NTQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0622544","name":"David Naughton","idIMDB":"nm0622544"},"actorId":"nm0622544","character":"Bill","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sean Sullivan","urlProfile":"http://www.imdb.com/name/nm0838330","urlPhoto":"","biography":{"dateOfBirth":"26 December 1921","placeOfBirth":" Toronto, Ontario, Canada","bio":"Sean Sullivan was born on December 26, 1921 in Toronto, Ontario, Canada. He was an actor, known for 2001: A Space Odyssey (1968), The Dead Zone (1983) and Atlantic City (1980). He died on June 3, 1985 in Toronto.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0838330","name":"Sean Sullivan","idIMDB":"nm0838330"},"actorId":"nm0838330","character":"Walter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Melody Anderson","urlProfile":"http://www.imdb.com/name/nm0000758","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNjA0NjMxMF5BMl5BanBnXkFtZTcwNjM2NjczNA@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1955","placeOfBirth":" Edmonton, Alberta, Canada","height":"5' 7\" (1.7 m)","bio":"Melody Anderson was born on December 3, 1955 in Edmonton, Alberta, Canada. She is an actress, known for Flash Gordon (1980), Dead & Buried (1981) and Firewalker (1986).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNjA0NjMxMF5BMl5BanBnXkFtZTcwNjM2NjczNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000758","name":"Melody Anderson","idIMDB":"nm0000758"},"actorId":"nm0000758","character":"Dulcie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James B. Douglas","urlProfile":"http://www.imdb.com/name/nm0235096","urlPhoto":"","biography":{"dateOfBirth":"1928","placeOfBirth":" Cape Town, South Africa","bio":"James B. Douglas was born in 1928 in Cape Town, South Africa. He was an actor, known for Men with Brooms (2002), L'enfant du diable (1980) and Million Dollar Babies (1994). He died on December 29, 2009 in Stratford, Ontario, Canada.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0235096","name":"James B. Douglas","idIMDB":"nm0235096"},"actorId":"nm0235096","character":"Collins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Walter Massey","urlProfile":"http://www.imdb.com/name/nm0557355","urlPhoto":"","biography":{"dateOfBirth":"19 August 1928","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Walter Edward Hart Massey","height":"6' (1.83 m)","bio":"Quebec-based actor whose career has spanned nearly five decades. He studied at the Professional Broadway Workshops under Harold Clurman and Sanford Meisner. He has worked in the United States (notably for Joseph Papp's NY Shakespeare Festival) as well as for many of the major companies in Canada including the Bulldog, National Arts Centre and Centaur Theatre, Montreal. He was co-founder of the King's Theatre in Prince Edward Island, the Piggery Theatre and Playwrights Workshop. He is also a founding member of Canadian Actors' Equity and served in the governing bodies of both the local and national associations for over 34 years.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0557355","name":"Walter Massey","idIMDB":"nm0557355"},"actorId":"nm0557355","character":"Mayor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Austin Willis","urlProfile":"http://www.imdb.com/name/nm0932270","urlPhoto":"","biography":{"dateOfBirth":"1917","placeOfBirth":" Halifax, Nova Scotia, Canada","bio":"Austin Willis was born in 1917 in Halifax, Nova Scotia, Canada. He was an actor, known for Goldfinger (1964), Seaway (1965) and Firefox (1982). He was married to Gwen Laforty and Kate Reid. He died on April 4, 2004 in Dartmouth, Nova Scotia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0932270","name":"Austin Willis","idIMDB":"nm0932270"},"actorId":"nm0932270","character":"Bainbridge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Philip Craig","urlProfile":"http://www.imdb.com/name/nm0185980","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MDQ0NTc2OF5BMl5BanBnXkFtZTYwMTA4MjE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 11\" (1.8 m)","bio":"Philip Craig, lives in Ontario, Canada. He has a wife by the name of, Pauline Craig, and 4 kids; Cameron(20), Kirsty(18), Kim(18),and Courtney(16). He is Councillor of Ward 2 of Georgina, and is Creator/curator of the Georgina Military Museum. He also sits on the Queens York Rangers Regimental Council. He has 1 brother and 2 sisters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MDQ0NTc2OF5BMl5BanBnXkFtZTYwMTA4MjE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0185980","name":"Philip Craig","idIMDB":"nm0185980"},"actorId":"nm0185980","character":"Kinnear","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert McCormick","urlProfile":"http://www.imdb.com/name/nm0566597","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NTc0MDczNF5BMl5BanBnXkFtZTcwNzc2NzYxOA@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"bio":"Robert McCormick is an actor and producer, known for La race des champions (1986), Battle Report (1950) and Utilities (1983).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NTc0MDczNF5BMl5BanBnXkFtZTcwNzc2NzYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0566597","name":"Robert McCormick","idIMDB":"nm0566597"},"actorId":"nm0566597","character":"Trickett","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tim Weber","urlProfile":"http://www.imdb.com/name/nm0916772","urlPhoto":"","biography":{"bio":"Tim Weber is an actor, known for La race des champions (1986), The Long Island Incident (1998) and Mind Prey (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0916772","name":"Tim Weber","idIMDB":"nm0916772"},"actorId":"nm0916772","character":"Cooney","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George E. Zeeman","urlProfile":"http://www.imdb.com/name/nm0954197","urlPhoto":"","biography":{"bio":"George E. Zeeman is an actor, known for Police Academy (1984), La race des champions (1986) and Oh Heavenly Dog (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0954197","name":"George E. Zeeman","idIMDB":"nm0954197"},"actorId":"nm0954197","character":"Cop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Geordie Johnson","urlProfile":"http://www.imdb.com/name/nm0425132","urlPhoto":"","biography":{"dateOfBirth":"25 February 1953","placeOfBirth":" Claresholm, Alberta, Canada","height":"6' (1.83 m)","bio":"Geordie Johnson's career encompasses TV, movies and theatre. Aside from many guest appearances in TV shows and starring in the syndicated Dracula: The Series (1990), he recently appeared in the hit movie, The English Patient (1996), and played Franz Liszt in HBO's COMPOSERS' SPECIALS SERIES: Liszt's Rhapsody (1996). In 1996, Mr Johnson returned to the Stratford (Ont) Festival after an absence of several years, to play Edmund in KING LEAR and the lead role of Chance Wayne in SWEET BIRD OF YOUTH, for which he was nominated as Best Actor in a Drama by the Stage Door Awards. In 1988, Mr Johnson won the Dora Mavor Moore award for Outstanding Performance in a Play (Leading Role) for his performance in I AM YOURS at the Tarragon Theatre in","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0425132","name":"Geordie Johnson","idIMDB":"nm0425132"},"actorId":"nm0425132","character":"Andrew Bothwell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Thorne","urlProfile":"http://www.imdb.com/name/nm0861358","urlPhoto":"","biography":{"bio":"Brian Thorne is an actor, known for La race des champions (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0861358","name":"Brian Thorne","idIMDB":"nm0861358"},"actorId":"nm0861358","character":"Plaisted","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0090769","urlIMDB":"http://www.imdb.com/title/tt0090769","business":{"budget":{"money":"$CAD7,716,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$94,261","country":"USA","day":"19","month":"01","year":"1986","remarks":"44 Screens"}],"gross":[{"money":"$94,261","country":"USA","day":"19","month":"01","year":"1986","remarks":""}],"weekendGross":[{"money":"$94,261","country":"USA","day":"19","month":"01","year":"1986","remarks":"44 Screens"}],"admissions":null,"productionDates":{"money":null,"country":null,"day":"06","month":"10","year":"1984","remarks":null},"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 40 min (100 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"5.4","filmingLocations":[{"location":"Burritt's Rapids, Ontario, Canada"}],"rated":"R","awards":[{"award":"Genie Awards 1986","titlesAwards":[{"titleAwardOutcome":"Nominated Genie","categories":[{"category":"Best Performance by an Actor in a Supporting Role","names":[{"name":"Sean Sullivan","id":"nm0838330","role":null}]},{"category":"Best Achievement in Art Direction","names":[{"name":"William Beeton","id":"nm0066629","role":null}]},{"category":"Best Achievement in Sound Editing","names":[{"name":"Don White","id":"nm0924719","role":null},{"name":"David Appleby","id":"nm0032351","role":null},{"name":"Dan Latour","id":"nm0490322","role":null}]}]}]}],"votes":"892","type":"Movie","companyCreditsSimple":[{"idCompany":"co0045850","name":"Canadian Broadcasting Corporation (CBC)"},{"idCompany":"co0008615","name":"Regatta Productions"},{"idCompany":"co0053578","name":"Téléfilm Canada"}],"keywords":{"keywords":["rowing"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:40:37"}}