{"data":{"movies":[{"title":"Hopscotch","originalTitle":"","year":"1980","releaseDate":"19801010","directors":[{"name":"Ronald Neame","id":"nm0623768"}],"writers":[{"name":"Brian Garfield","id":"nm0307257"},{"name":"Brian Garfield","id":"nm0307257"}],"runtime":"106 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzMzYzMjUyMTheQTJeQWpwZ15BbWU2MDk1NjIxOQ@@._V1.jpg","countries":["USA"],"languages":["English","German","French","Russian"],"genres":["Adventure","Comedy"],"plot":"CIA agent Miles Kendig decides to get out of 'the game' and to ensure he's left alone he threatens to send his memoirs to the world's intelligence agencies. When the CIA doesn't believe him, he calls their bluff and starts writing and sending out chapters one by one. Realizing that their operations would be compromised, the CIA (led by Myerson and Cutter) set out to put an end to Kendig's plan by whatever means necessary. The heart of the movie follows a game of cat and mouse between a fumbling CIA and an artful Kendig.","simplePlot":"Grounded with a desk job by incompetent superiors, a clever CIA agent retires and writes a tell all memoir that will embarrass his bosses, prompting him to go on the run and elude them.","actors":[{"actorName":"Walter Matthau","urlProfile":"http://www.imdb.com/name/nm0000527","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NjYzOTc0NV5BMl5BanBnXkFtZTYwMjAxNDQ2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1920","placeOfBirth":" Lower East Side, Manhattan, New York City, New York, USA","birthName":"Walter Jake Matthow","height":"6' 2½\" (1.89 m)","bio":"Walter Matthau was born on October 1, 1920 in Lower East Side, Manhattan, New York City, New York, USA as Walter Jake Matthow. He was an actor, known for The Odd Couple (1968), Charade (1963) and Grumpy Old Men (1993). He was married to Carol Grace and Grace Geraldine Johnson. He died on July 1, 2000 in Santa Monica, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NjYzOTc0NV5BMl5BanBnXkFtZTYwMjAxNDQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000527","name":"Walter Matthau","nicknames":["Jake"],"idIMDB":"nm0000527"},"actorId":"nm0000527","character":"Miles Kendig / James Butler / Mr. Hannaway / Leonard Ross","urlCharacter":"http://www.imdb.com/character/ch0384650","main":true},{"actorName":"Glenda Jackson","urlProfile":"http://www.imdb.com/name/nm0413559","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI3OTYwMzg1Nl5BMl5BanBnXkFtZTcwNzIyMTM3NA@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 May 1936","placeOfBirth":" Birkenhead, Cheshire, England, UK","birthName":"Glenda May Jackson","height":"5' 6½\" (1.69 m)","bio":"Few in modern British history have come as far or achieved as much from humble beginnings as Glenda Jackson has. From acclaimed actress to respected MP (Member of Parliament), she is known for her high intelligence and meticulous approach to her work. She was born to a working-class household in Birkenhead, where her father was a bricklayer and her mother was a cleaning lady. When she was very young, her father was recruited into the Navy, where he worked aboard a minesweeper. She graduated from school at 16 and worked for a while in a pharmacy. However, she found this boring and dead-end and wanted better for herself. Her life changed forever when she was accepted into the prestigious Royal Acadamy of Dramatic Art (RADA) at the age of 18. Her work impressed all who observed it. In addition, she married Roy Hodges at 22. Her first work came on the stage, where she won a role in an adaptation of \"Separate Tables\", and made a positive impression on critics and audiences alike. This led to film roles, modest at first, but she approached them with great determination. She first came to the public's notice when she won a supporting role in the controversial film Marat/Sade (1967), and is acknowledged to have stolen the show. She quickly became a member of Britian's A-List. Her first starring role came in the offbeat drama Negatives (1968), in which she out-shone the oddball material. The following year, controversial director Ken Russell gave her a starring role in his adaptation of the 1920s romance Women in Love (1969), in which she co-starred with Oliver Reed. The beautifully photographed film was a major success, and Jackson's performance won her an Academy Award for Best Actress. In the process, she became an international celebrity, known world-wide, yet she didn't place as much value on the status and fame as most do. She did, however, become a major admirer of Russell (who had great admiration for her in return) and acted in more of his films. She starred in the controversial The Music Lovers (1970), even though it required her to do a nude scene, something that made her very uncomfortable. The film was not a success, but she agreed to do a cameo appearance in his next film, The Boy Friend (1971). Although her role as an obnoxious actress was very small, she once again performed with great aplomb. 1971 turned out to be a key year for her. She took a risk by appearing in Sunday Bloody Sunday (1971), as a divorced businesswoman in a dead-end affair with a shallow bisexual artist, but the film turned out to be another major success. Also, she accepted the starring role in the British Broadcasting Corporation's much anticipated biography of Queen Elizabeth I, and her performance in the finished film, Elizabeth R (1971), was praised not only by critics and fans, but is cited by historians as the most accurate portrayal of the beloved former queen ever seen. The same year, she successfully played the role of Queen Elizabeth I again in the historical drama Mary, Queen of Scots (1971). That same year, she appeared in the popular comedy series The Morecambe & Wise Show (1968) in a skit as Queen Cleopatra, which is considered on of the funniest TV skits in British television, and also proof that she could do comedy just as well as costume melodrama. One who saw and raved about her performance was director Melvin Frank, who proceeded to cast her in the romantic comedy A Touch of Class (1973), co-starring George Segal. The two stars had a chemistry which brought out the best in each other, and the film was not only a major hit in both the United States and Great Britian, but won her a second Academy Award. She continued to impress by refusing obvious commercial roles and seeking out serious artistic work. She gave strong performances in The Romantic Englishwoman (1975) and The Incredible Sarah (1976), in which she portrayed the legendary actress Sarah Bernhardt. However, some of her films didn't register with the public, like The Triple Echo (1972), The Maids (1975), and Nasty Habits (1977). In addition, her marriage fell apart in 1976. But her career remained at the top and in 1978 she was named Commander of the Order of the British Empire. That year, she made a comeback in the comedy House Calls (1978), co-starring Walter Matthau. The success of this film which led to a popular television spin-off in the United States the following year. In 1979, she and Segal re-teamed in Lost and Found (1979), but they were unable to overcome the routine script. She again co-starred with Oliver Reed in The Class of Miss MacMichael (1978), but the film was another disappointment. During the 1980s, she appeared in Hopscotch (1980) also co-starring Walter Matthau, and HealtH (1980) with Lauren Bacall, with disappointing results, although Jackson herself was never blamed. Her performance in the TV biography Sakharov (1984), in which she played Yelena Bonner, devoted wife of imprisoned Russian nuclear scientist Andrei Sakharov opposite Jason Robards, won rave reviews. However, the next film Turtle Diary (1985), was only a modest success, and the ensemble comedy Beyond Therapy (1987) was a critical and box office disaster and Jackson herself got some of the worst reviews of her career. As the 1980s ended, Jackson continued to act, but became more focused on public affairs. She grew up in a household that was staunchly supportive of the Labour Party. She had disliked the policies of Conservative Prime Minister Margaret Thatcher, even though she admired some of her personal attributes, and strongly disapproved of Thatcher's successor, John Major. She was unhappy with the direction of British government policies, and in 1992 ran for Parliament. Although running in an area (Hampstead and Highgate) which was not heavily supportive of her party, she won by a slim margin and immediately became its most famous newly elective member. However, those who expected that she would rest on her laurels and fame were mistaken. She immediately took an interest in transportation issues, and in 1997 was appointed Junior Transportation Minister by Prime Minister Tony Blair. However, she was critical of some of Blair's policies and is considered an inter-party opponent of Blair's moderate faction. She is considered a traditional Labour Party activist, but is not affiliated with the faction known as The Looney Left. In 2000, she ran for Mayor of London, but lost the Labour nomination to fellow MP Frank Dobson, an ally of Blair's, who then lost the election to an independent candidate, Ken Livingstone. In 2005, she ran again and won the nomination, but lost to Livingstone, winning 38% of the vote. When Blair announced he would not seek reelection as Prime Minister in 2006, Jackson's name was mentioned as a possible successor, although she didn't encourage this speculation. In 2010, she sought reelection to parliament and was almost defeated, winning by only 42 votes. In 2013, she responded to the death of Margaret Thatcher by strongly denouncing her policies, which was condemned by many as graceless. In 2015, elections for parliament were called again but she didn't seek reelection. She was succeeded in Parliament by Chris Philip, a Conservative Party member who had been Jackson's opponent in 2010.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI3OTYwMzg1Nl5BMl5BanBnXkFtZTcwNzIyMTM3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0413559","name":"Glenda Jackson","idIMDB":"nm0413559"},"actorId":"nm0413559","character":"Isobel","urlCharacter":"http://www.imdb.com/character/ch0384651","main":true},{"actorName":"Sam Waterston","urlProfile":"http://www.imdb.com/name/nm0001832","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MjA2MzMwOF5BMl5BanBnXkFtZTcwNzQ3MDgzMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1940","placeOfBirth":" Cambridge, Massachusetts, USA","birthName":"Samuel Atkinson Waterston","height":"6' 1\" (1.85 m)","bio":"Sam Waterston was born on November 15, 1940 in Cambridge, Massachusetts, USA as Samuel Atkinson Waterston. He is an actor and producer, known for Law & Order (1990), The Killing Fields (1984) and The Man in the Moon (1991). He has been married to Lynn Louisa Woodruff since January 26, 1976. They have three children. He was previously married to Barbara Rutledge Johns.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MjA2MzMwOF5BMl5BanBnXkFtZTcwNzQ3MDgzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001832","name":"Sam Waterston","idIMDB":"nm0001832"},"actorId":"nm0001832","character":"Cutter","urlCharacter":"http://www.imdb.com/character/ch0384652","main":true},{"actorName":"Ned Beatty","urlProfile":"http://www.imdb.com/name/nm0000885","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMzQ2Mzc3MF5BMl5BanBnXkFtZTYwMDIwMDM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1937","placeOfBirth":" Louisville, Kentucky, USA","birthName":"Ned Thomas Beatty","height":"5' 7\" (1.7 m)","bio":"Stocky, genial-looking supporting actor Ned Beatty was once hailed by Daily Variety as the \"busiest actor in Hollywood\". Ned Thomas Beatty was born in Louisville, Kentucky, to Margaret (Fortney) and Charles William Beatty. He grew up fishing and working on farms. His hometown of St. Matthews, Kentucky, is hardly the environment to encourage a career in the entertainment industry, though, so when asked, \"How did you get into show business?\" Beatty responds, \"By hanging out with the wrong crowd.\" That \"crowd\" includes some of the industry's most prominent names, such as John Huston, Steven Spielberg, Robert Altman, Paul Newman, Richard Burton, Charlton Heston, Marlon Brando and Robert Redford. Beatty has garnered praise from both critics and peers as a dedicated actor's actor. He started as a professional performer at age ten, when he earned pocket money singing in gospel quartets and a barber shop. The big city and bright lights did not come easy, though. The first ten years of Beatty's career were spent at the Barter Theater in Abingdon, Virginia. He then moved on to the Erie Playhouse in Pennsylvania, the Playhouse Theater in Houston, Texas, and the prestigious Arena Stage Company in Washington, D.C. He was also a member of Shakespeare in Central Park, Louisville, Kentucky. Later, he appeared in the Broadway production of \"The Great White Hope\". At the Mark Taper Forum in Los Angeles, he won rave reviews when he starred in \"The Accidental Death of an Anarchist\". In 1971, Beatty was chosen by director John Boorman for the role of Bobby Trippe in the hit film/backwoods nightmare Deliverance (1972). Co-star Burt Reynolds and Beatty struck up a friendship together, and Ned has since been cast by Burt in several other films together, including White Lightning (1973), W.W. and the Dixie Dancekings (1975), and the abysmal Stroker Ace (1983). Ned's talents were also noticed by others in Hollywood and he was cast in many key productions of the 1970s turning in stellar performance, including an Academy Award nomination of Best Supporting Actor for his role in Network (1976). Beatty was also marvelous in Nashville (1975), under fire from a crazed sniper in The Deadly Tower (1975), an undercover FBI man in the action/comedy Silver Streak (1976), as Lex Luthor's bumbling assistant, Otis, in the blockbuster Superman (1978)... and he returned again with Gene Hackman to play Otis and Lex Luthor again in Superman II (1980). Beatty continued to remain busy throughout the 1980s with appearances in several big budget television productions including Les derniers jours de Pompéi (1984). However, the overall caliber of the productions in general did not match up to those he had appeared in during the 1970s. Nonetheless, Beatty still shone in films including The Big Easy (1986) and The Fourth Protocol (1987). Into the 1990s, Beatty's work output swung between a mixture of roles in family orientated productions (Gulliver's Travels (1996), Back to Hannibal: The Return of Tom Sawyer and Huckleberry Finn (1990), etc.) taking advantage of his \"fatherly\" type looks, but he could still accentuate a hard edge, and additionally was cast in Radioland Murders (1994) and Just Cause (1995). His many other films include The Toy (1982), All the President's Men (1976), Wise Blood (1979), Rudy (1993), Spring Forward (1999), Hear My Song (1991) -- for which he earned a Golden Globe nomination for Best Supporting Actor -- Prelude to a Kiss (1992), He Got Game (1998) and Cookie's Fortune (1999). Beatty's numerous television credits include three years on the NBC series Homicide: Life on the Street (1993), Streets of Laredo (1995), and The Boys (1993). Beatty received an Emmy Award nomination for Best Actor for his performance in Friendly Fire (1979) opposite Carol Burnett, and a Best Supporting Actor nomination for Family Channel's Last Train Home (1989). Other notable credits include The Wool Cap (2004), The Execution of Private Slovik (1974), A Woman Called Golda (1982), Pray TV (1982), the miniseries Robert Kennedy and His Times (1985), Lockerbie: A Night Remembered (1998) and T Bone N Weasel (1992). He also had a recurring role on Roseanne (1988) and performed musically on television specials for Dolly Parton and The Smothers Brothers. In 2001, Beatty returned to his theatrical roots starring in London's West End revival production of Tennessee Williams' \"Cat on a Hot Tin Roof\" with Brendan Fraser. He also appeared in the production on Broadway in 2003/2004 with Jason Patric and Ashley Judd. In 2006, Beatty completed three features to be released next year: The Walker (2007); a Paul Schrader film also starring Woody Harrelson, Kristin Scott Thomas, and Lily Tomlin; Paramount's Shooter (2007) starring Mark Wahlberg; and Charlie Wilson's War (2007), a Mike Nichols film with Tom Hanks, Philip Seymour Hoffman and Julia Roberts. Blessed with eight children, Beatty enjoys golf and playing the bass guitar. He gives himself until the age of 70 to become proficient at both. Also in the 21st century, Beatty turned out a terrific performance in the popular Where the Red Fern Grows (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMzQ2Mzc3MF5BMl5BanBnXkFtZTYwMDIwMDM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000885","name":"Ned Beatty","nicknames":["The busiest actor in Hollywood"],"idIMDB":"nm0000885"},"actorId":"nm0000885","character":"Myerson","urlCharacter":"http://www.imdb.com/character/ch0384684","main":true},{"actorName":"Herbert Lom","urlProfile":"http://www.imdb.com/name/nm0007042","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg5OTc0OTA3Ml5BMl5BanBnXkFtZTcwOTIyOTYyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1917","placeOfBirth":" Prague, Bohemia, Austria-Hungary [now Czech Republic]","birthName":"Herbert Charles Angelo Kuchacevich ze Schluderpacheru","height":"5' 7¾\" (1.72 m)","bio":"Born September 11, 1917, Herbert Lom made his film debut in the Czech film Woman Below the Cross (1937) and played supporting and, occasionally, lead roles. His career picked up in the 1940s and he played, among other roles, Napoleon Bonaparte in The Young Mr. Pitt (1942) (and, again, in War and Peace (1956)). In a rare starring role, Lom played twin trapeze artists in Dual Alibi (1947). He continued into the 1950s with roles opposite Alec Guinness and Peter Sellers in The Ladykillers (1955) and Robert Mitchum, Jack Lemmon and Rita Hayworth in Fire Down Below (1957). His career really took off in the 1960s and he got the title role in Hammer Films' production of The Phantom of the Opera (1962). He also played \"Captain Nemo\" in Mysterious Island (1961) and landed supporting parts in Le Cid (1961) and an especially showy role in Spartacus (1960) as a pirate chieftain contracted to transport Spartacus' army away from Italy. The 1960s was also the decade in which Lom secured the role for which he will always be remembered: Peter Sellers' long-suffering boss, Commissioner Charles Dreyfus, in the \"Pink Panther\" films, in which he pulled off the not-inconsiderable feat of stealing almost every scene he and Sellers were in--a real accomplishment, considering what a veteran scene-stealer Sellers was. However, Lom did not concentrate solely on a film career. He had become a familiar face to British television viewers when he starred as Dr. Roger Corder in the series The Human Jungle (1963). He moved into horror films in the 1970s, with parts in Asylum (1972) and And Now the Screaming Starts! (1973). He played Prof. Abraham Van Helsing opposite Christopher Lee in Count Dracula (1970), matching wits against the sinister vampire himself. Lom appeared as one of the ten victims in Ten Little Indians (1974), playing the drunken Dr. Edward Armstrong. His career continued into the 1980s, a standout role being that of Christopher Walken's sympathetic doctor in The Dead Zone (1983). He also played opposite Walter Matthau in Hopscotch (1980) and returned to the murder mystery Ten Little Indians (1989), this time playing The General. Lom has been taking it easy since then, though he returned to his familiar role of Commissioner Dreyfus in Le fils de la panthère rose (1993). He has always been a reliable and eminently watchable actor, unfortunately not receiving the stardom he probably should have. Herbert Lom died in his sleep at age 95 on September 27, 2012, in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg5OTc0OTA3Ml5BMl5BanBnXkFtZTcwOTIyOTYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007042","name":"Herbert Lom","idIMDB":"nm0007042"},"actorId":"nm0007042","character":"Yaskov","urlCharacter":"http://www.imdb.com/character/ch0384653","main":true},{"actorName":"David Matthau","urlProfile":"http://www.imdb.com/name/nm0559880","urlPhoto":"","biography":{"dateOfBirth":"2 November 1953","placeOfBirth":"","bio":"David Matthau was born on November 2, 1953. He is known for his work on Hopscotch (1980), The Goodbye Girl (1977) and California Suite (1978). He has been married to Suzanne Huyot since September 10, 1983.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0559880","name":"David Matthau","idIMDB":"nm0559880"},"actorId":"nm0559880","character":"Ross","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Baker","urlProfile":"http://www.imdb.com/name/nm0048468","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NzY5MTUxM15BMl5BanBnXkFtZTcwOTYxMzk5Nw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 April 1931","placeOfBirth":" Varna, Bulgaria","birthName":"George Morris Baker","height":"6' 3\" (1.91 m)","bio":"George Baker was born on April 1, 1931 in Varna, Bulgaria as George Morris Baker. He was an actor and writer, known for The Ruth Rendell Mysteries (1987), The Spy Who Loved Me (1977) and On Her Majesty's Secret Service (1969). He was married to Louie Ramsay, Sally Home and Julia Squire. He died on October 7, 2011 in West Lavington, Wiltshire, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NzY5MTUxM15BMl5BanBnXkFtZTcwOTYxMzk5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0048468","name":"George Baker","idIMDB":"nm0048468"},"actorId":"nm0048468","character":"Westlake","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ivor Roberts","urlProfile":"http://www.imdb.com/name/nm0731175","urlPhoto":"","biography":{"dateOfBirth":"19 July 1925","placeOfBirth":" Nottingham, England, UK","bio":"Ivor Roberts (19 July 1925 - 5 September 1999) was an English actor and a television continuity announcer who often appeared in comedic roles. Born in Nottingham, he returned to acting following service in the Royal Navy during the Second World War. Roberts started his television career as a continuity announcer on regional television in Wales, working for TWW before that company lost its franchise in 1968. Among his better-known roles were the characters of Arnold Thomas in the 1995-97 television series Oh, Doctor Beeching! and Mr Barnes in the second, third and fourth series of You Rang, M'Lord?. He also made a guest appearance, as a police officer, in one episode of George and Mildred. Another notable appearance was as Mr. Chick in Dombey and Son. He also played a part in \"Porridge\". He died in Cardiff, Wales, in 1999 at the age of 74.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0731175","name":"Ivor Roberts","idIMDB":"nm0731175"},"actorId":"nm0731175","character":"Ludlum","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lucy Saroyan","urlProfile":"http://www.imdb.com/name/nm0765488","urlPhoto":"","biography":{"dateOfBirth":"17 January 1946","placeOfBirth":" San Francisco, California, USA","bio":"Lucy Saroyan was born on January 17, 1946 in San Francisco, California, USA. She was an actress, known for Blue Collar (1978), Hopscotch (1980) and The Taking of Pelham One Two Three (1974). She died on April 11, 2003 in Thousand Oaks, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0765488","name":"Lucy Saroyan","idIMDB":"nm0765488"},"actorId":"nm0765488","character":"Carla","urlCharacter":"http://www.imdb.com/character/ch0384654","main":true},{"actorName":"Severn Darden","urlProfile":"http://www.imdb.com/name/nm0201089","urlPhoto":"","biography":{"dateOfBirth":"9 November 1929","placeOfBirth":" New Orleans, Louisiana, USA","bio":"Severn Darden was born on November 9, 1929 in New Orleans, Louisiana, USA. He was an actor and writer, known for Battle for the Planet of the Apes (1973), Conquest of the Planet of the Apes (1972) and They Shoot Horses, Don't They? (1969). He died on May 27, 1995 in Santa Fe, New Mexico, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0201089","name":"Severn Darden","idIMDB":"nm0201089"},"actorId":"nm0201089","character":"Maddox","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Pravda","urlProfile":"http://www.imdb.com/name/nm0695590","urlPhoto":"","biography":{"dateOfBirth":"19 June 1918","placeOfBirth":" Prague, Bohemia, Austria-Hungary [now Prague, Czech Republic]","birthName":"Jirí Pravda","bio":"George Pravda was born on June 19, 1918 in Prague, Bohemia, Austria-Hungary as Jirí Pravda. He was an actor, known for Thunderball (1965), Frankenstein Must Be Destroyed (1969) and Hopscotch (1980). He was married to Hana Maria Pravda. He died on April 30, 1985 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0695590","name":"George Pravda","idIMDB":"nm0695590"},"actorId":"nm0695590","character":"Saint Breheret","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jacquelyn Hyde","urlProfile":"http://www.imdb.com/name/nm0404985","urlPhoto":"","biography":{"dateOfBirth":"19 March 1931","placeOfBirth":" New York City, New York, USA","bio":"Jacquelyn Hyde was born on March 19, 1931 in New York City, New York, USA. She was an actress, known for Take the Money and Run (1969), They Shoot Horses, Don't They? (1969) and Hopscotch (1980). She died on February 23, 1992 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0404985","name":"Jacquelyn Hyde","idIMDB":"nm0404985"},"actorId":"nm0404985","character":"Realtor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Gwilym","urlProfile":"http://www.imdb.com/name/nm0350334","urlPhoto":"","biography":{"dateOfBirth":"5 March 1949","placeOfBirth":" Neath, Glamorgan, Wales, UK","bio":"Mike Gwilym was born on March 5, 1949 in Neath, Glamorgan, Wales. He is an actor, known for Hopscotch (1980), Peter the Great (1986) and The Comedy of Errors (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0350334","name":"Mike Gwilym","idIMDB":"nm0350334"},"actorId":"nm0350334","character":"Alfie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Terry Beaver","urlProfile":"http://www.imdb.com/name/nm0064777","urlPhoto":"","biography":{"dateOfBirth":"2 June 1948","placeOfBirth":" West Palm Beach, Florida, USA","bio":"Terry Beaver was born on June 2, 1948 in West Palm Beach, Florida, USA. He is an actor, known for Hearts in Atlantis (2001), Going the Distance (2010) and To Dance with the White Dog (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0064777","name":"Terry Beaver","idIMDB":"nm0064777"},"actorId":"nm0064777","character":"Tobin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ray Charleson","urlProfile":"http://www.imdb.com/name/nm0153186","urlPhoto":"","biography":{"bio":"Ray Charleson is an actor, known for United 93 (2006), Empire of the Sun (1987) and Hawk the Slayer (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0153186","name":"Ray Charleson","idIMDB":"nm0153186"},"actorId":"nm0153186","character":"Clausen","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0080889","urlIMDB":"http://www.imdb.com/title/tt0080889","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"© COPYRIGHT MCMLXXX EDIE &amp; ELY LANDAU, INC."},"technical":{"runtime":["1 hr 46 min (106 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Movielab, Hollywood (CA), USA"],"filmLength":["2,860 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision"],"printedFilmFormat":["35 mm"]},"rating":"7.2","filmingLocations":[{"location":"Atlanta, Georgia, USA"}],"rated":"R","awards":[{"award":"Golden Globes, USA 1981","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Actor in a Motion Picture - Comedy or Musical","names":[{"name":"Walter Matthau","id":"nm0000527","role":null}]}]}]},{"award":"Edgar Allan Poe Awards 1981","titlesAwards":[{"titleAwardOutcome":"Nominated Edgar","categories":[{"category":"Best Motion Picture","names":[{"name":"Brian Garfield","id":"nm0307257","role":null},{"name":"Bryan Forbes","id":"nm0285302","role":null}]}]}]},{"award":"Writers Guild of America, USA 1981","titlesAwards":[{"titleAwardOutcome":"Nominated WGA Award (Screen)","categories":[{"category":"Best Comedy Adapted from Another Medium","names":[{"name":"Brian Garfield","id":"nm0307257","role":null},{"name":"Bryan Forbes","id":"nm0285302","role":null}]}]}]}],"votes":"4,997","type":"Movie","companyCreditsSimple":[{"idCompany":"co0095235","name":"Edie & Ely Landau Inc."},{"idCompany":"co0024716","name":"International Film Investors"},{"idCompany":"co0065579","name":"Sham Productions"}],"keywords":{"keywords":["cia","memoir","hoax","observation","american abroad","one word title","bestseller","car damage","bahamas","salzburg austria","munich germany","police car","exploding airplane","fool","border crossing","oktoberfest","kgb agent","reference to laurel and hardy","remote control airplane","seaplane","spy","false identity","book publishing","airplane accident","firework","new identity","false passport","secret agent","cold war","tape recorder","based on novel","independent film","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:44:05"}}