{"data":{"movies":[{"title":"The Missionary","originalTitle":"","year":"1982","releaseDate":"19821105","directors":[{"name":"Richard Loncraine","id":"nm0518644"}],"writers":[{"name":"Michael Palin","id":"nm0001589"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1ODE0MDQzN15BMl5BanBnXkFtZTcwNjI3NDYxMQ@@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Comedy"],"plot":"In 1905, after 10 years of missionary work in Africa, the Rev. Charles Fortesque is recalled to England, where his bishop gives him his new assignment - to minister to London's prostitutes. Charles hopes Deborah, his fiancee, will object and give him an excuse to say no to the bishop. But she is so imperturbably innocent that she totally fails to understand what he is being asked to do, and urges him to do his best. Wealthy Lady Ames is expected to fund the work, but once she makes it clear to Charles that there will be no contribution unless he shares her bed...","simplePlot":"In 1905, after 10 years of missionary work in Africa, the Rev. Charles Fortesque is recalled to England, where his bishop gives him his new assignment - to minister to London's prostitutes.... ","actors":[{"actorName":"Michael Palin","urlProfile":"http://www.imdb.com/name/nm0001589","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ5OTMyMzQ2MF5BMl5BanBnXkFtZTcwMTk5MzAxMw@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1943","placeOfBirth":" Ranmoor, Sheffield, Yorkshire, England, UK","birthName":"Michael Edward Palin","height":"5' 10½\" (1.79 m)","bio":"Michael Palin is an English comedian, actor, writer and television presenter. He was one of the members of the comedy group Monty Python. After the Monty Python television series ended in 1974, the Palin/Jones team worked on Ripping Yarns, an intermittent television comedy series broadcast over three years from 1976. In 1980, Palin co-wrote Time Bandits with Terry Gilliam. He also acted in the film. In 1984, he reunited with Terry Gilliam to appear in Brazil. He appeared in the comedy film A Fish Called Wanda (1988), for which he won the BAFTA Award for Best Actor in a Supporting Role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ5OTMyMzQ2MF5BMl5BanBnXkFtZTcwMTk5MzAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001589","name":"Michael Palin","idIMDB":"nm0001589"},"actorId":"nm0001589","character":"The Reverend Charles Fortescue","urlCharacter":"http://www.imdb.com/character/ch0490650","main":true},{"actorName":"Maggie Smith","urlProfile":"http://www.imdb.com/name/nm0001749","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NzYxNjc5Ml5BMl5BanBnXkFtZTYwMTMzOTg1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1934","placeOfBirth":" Ilford, Essex, England, UK","birthName":"Margaret Natalie Smith","height":"5' 5\" (1.65 m)","bio":"One of the world's most famous and distinguished actresses, Dame Maggie Smith was born Margaret Natalie Smith in Essex. Her Scottish mother, Margaret (Hutton), worked as a secretary, and her English father, Nathaniel Smith, was a teacher at Oxford University. Smith has been married twice: to actor Robert Stephens and to playwright Beverley Cross. Her marriage to Stephens ended in divorce in 1974. She was married to Cross until his death in 1999. She had two sons with Stephens, Chris Larkin and Toby Stephens who are also actors. Maggie Smith's career began at the Oxford Playhouse in the 1950s. She made her film debut in 1956 as one of the party guests in Child in the House (1956). She has since performed in over sixty films and television series with some of the most prominent actors and actresses in the world. These include: Othello (1965) with Laurence Olivier, The Prime of Miss Jean Brodie (1969), California Suite (1978) with Michael Caine and Jane Fonda, A Room with a View (1985), Richard III (1995) with Ian McKellen and Jim Broadbent, Franco Zeffirelli's Un thé avec Mussolini (1999) with Judi Dench, Joan Plowright and Cher and Gosford Park (2001) with Kristin Scott Thomas and Clive Owen, directed by Robert Altman. Maggie Smith has also been nominated for an Oscar six times and won twice, for The Prime of Miss Jean Brodie (1969) and California Suite (1978). Most recently, Smith has appeared in the very successful 'Harry Potter' franchise as the formidable Professor McGonagall. Smith is a breast cancer survivor. Her most recent role has been in Julian Fellowes' ITV drama series, Downton Abbey (2010) (2010-2011) as the Dowager Countess of Grantham.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NzYxNjc5Ml5BMl5BanBnXkFtZTYwMTMzOTg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001749","name":"Maggie Smith","idIMDB":"nm0001749"},"actorId":"nm0001749","character":"Lady Isabel Ames","urlCharacter":"http://www.imdb.com/character/ch0490651","main":true},{"actorName":"Trevor Howard","urlProfile":"http://www.imdb.com/name/nm0002145","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDAyOTQxN15BMl5BanBnXkFtZTYwNzg1MjI2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1913","placeOfBirth":" Cliftonville, Kent, England, UK","birthName":"Trevor Wallace Howard-Smith","height":"5' 11½\" (1.82 m)","bio":"The son of an insurance underwriter, who represented Lloyd's of London in Ceylon, Trevor Wallace Howard-Smith was born in Margate, Kent. He spent his early childhood globetrotting with his mother, frequently left in the care of strangers. After attending private school, he subsequently trained at RADA (due to his mother's insistence), and was voted best in his class following a performance in \"Much Ado About Nothing\". Spurning a contract with Paramount, he acted on the West End stage and with the Shakespeare Memorial Theatre in Stratford-upon-Avon from the mid-1930's, performing in classical plays ranging from \"Hamlet\" and \"Coriolanus\" to \"French without Tears\", by Terence Rattigan. Howard was initially turned down for military service by both the RAF and the British Army, but shortage of manpower led to his being called up in 1940 to serve as a second lieutenant with the Army Signal Corps. However, he neither saw action nor accumulated the illustrious wartime record (including winning the Military Cross) invented for him by his publicists. A 2001 biography by Terence Pettigrew claimed to have unearthed files from his war record, suggesting that he was dismissed from service in 1943 due to 'mental instability'. Ironically, on screen, the actor was often cast as solid, unflappable British officers, perhaps reflecting his own personal credo of always feeling best when impersonating someone else. Howard's career in films began quietly, with small roles in The Way Ahead (1944) and Johnny in the Clouds (1945). He unexpectedly leapt to stardom in just his third outing, as the stoic, decent Dr. Alec Harvey in David Lean's melancholic story of middle-class wartime romance, Brief Encounter (1945). Howard's mannered performance perfectly suited the required stiff-upper-lip mood of the film, his intensity and projected integrity more than compensating for his average looks. That 'jolly decent chap' persona continued on in another 'woman's picture', The Passionate Friends (1949), but Howard soon found his niche in more determined, worldly roles. He later admitted that \"for years I was practically hounded by my first part in Brief Encounter. I loved the film, mind you, but the role wasn't me, at all\" (Ottawa Citizen, February 17 1961). As a screen actor, Howard came of age in crime thrillers and war films, delivering his first genuine tour de force performance as a battle-hardened, cynical ex-pilot caught up in the world of post-war black market racketeering in I Became a Criminal (1947). His efficient, by-the-book intelligence officer, Major Calloway, in Carol Reed's The Third Man (1949) put him firmly on the map as a star character player. Rasping-voiced and becoming increasingly craggy as the years went by, Howard contrasted archetypal authoritarians (seasoned army veteran Captain Thomson of The Cockleshell Heroes (1955), Captain William Bligh in the remake of Mutiny on the Bounty (1962), Lord Cardigan in The Charge of the Light Brigade (1968)) with weaklings (best exemplified by morally corrupt, degenerate expatriate trader Peter Willems in Outcast of the Islands (1951) -- arguably one of Howard's finest performances); sympathetic victims (colonial cop Scobie, tormented by religious guilt in The Heart of the Matter (1953)) and obsessive, driven eccentrics (crusading elephant preservationist Morel in The Roots of Heaven (1958), the alcoholic, haunted Sir Henry at Rawlinson End (1980), and the weird Russian recluse of Light Years Away (1981)). In the midst of angst-ridden heroes, drunken clerics and assorted historical characters, ranging from Napoleon Bonaparte to Sir Isaac Newton, Howard even essayed a Cheyenne warrior returning from the dead to defend his family in Windwalker (1980). Remarkably, among a score of rather forgettable projects Howard lent his name to, it is difficult to fault a single one of his performances. Throughout his entire career, he was never out of favour with audiences and never out of work. As becoming one of the most British of actors, Howard was an ardent cricket supporter, member of the prestigious Marylebone Cricket Club. He insisted on having a clause inserted in his contracts which allowed him leave from filming to attend test matches. A rather solitary man, he had few other hobbies (except, perhaps, a fondness for alcohol, which likely contributed to his death at the age of 74) and was reputedly modest about his accomplishments as an actor. He once declared \"we don't have the Method School of acting in England. We simply read the script, let it seep in, then go put on whiskers - and do it\" (New York Times, January 8 1988).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDAyOTQxN15BMl5BanBnXkFtZTYwNzg1MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002145","name":"Trevor Howard","idIMDB":"nm0002145"},"actorId":"nm0002145","character":"Lord Henry Ames","urlCharacter":"http://www.imdb.com/character/ch0068144","main":true},{"actorName":"Denholm Elliott","urlProfile":"http://www.imdb.com/name/nm0001186","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2ODQ3NDc5Nl5BMl5BanBnXkFtZTcwNDAwMjg5Nw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1922","placeOfBirth":" Ealing, London, England, UK","birthName":"Denholm Mitchell Elliott","height":"5' 11½\" (1.82 m)","bio":"Much-loved character actor who specialised in playing slightly sleazy/slightly eccentric and often flawed upper middle class English gentlemen. His career spanned nearly 40 years, becoming a well-known face both in Britain and in the States.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2ODQ3NDc5Nl5BMl5BanBnXkFtZTcwNDAwMjg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001186","name":"Denholm Elliott","idIMDB":"nm0001186"},"actorId":"nm0001186","character":"The Bishop","urlCharacter":"http://www.imdb.com/character/ch0248503","main":true},{"actorName":"Michael Hordern","urlProfile":"http://www.imdb.com/name/nm0394588","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNTc4NzA3MV5BMl5BanBnXkFtZTcwNDYxMTExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1911","placeOfBirth":" Berkhamsted, Hertfordshire, England, UK","birthName":"Michael Murray Hordern","bio":"Following a brief teaching career, Michael Hordern made his stage debut in 1937. He made his film debut in 1939, but his career was stalled by WWII. He resumed his acting career in 1946, both in theatre and films. He hit his stride in the 1960s playing befuddled characters, particularly stuffy public officials. He was knighted in 1983.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNTc4NzA3MV5BMl5BanBnXkFtZTcwNDYxMTExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0394588","name":"Michael Hordern","idIMDB":"nm0394588"},"actorId":"nm0394588","character":"Slatterthwaite / Narrator","urlCharacter":"http://www.imdb.com/character/ch0490652","main":true},{"actorName":"Graham Crowden","urlProfile":"http://www.imdb.com/name/nm0189561","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NDczMTA2N15BMl5BanBnXkFtZTcwMzEzMTgwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1922","placeOfBirth":" Edinburgh, Scotland, UK","birthName":"Clement Graham Crowden","height":"6' 3\" (1.91 m)","bio":"The imposing Scottish character actor Graham Crowden was one of the most recognizable and reliable British screen actors who worked for over half a century. He was the third of four children of a Scottish Presbyterian classics teacher. His first job was in a tannery in Edinburgh. He joined the Royal Scots Youth Battalion in 1940, but was invalided out after being accidentally shot by his own platoon sergeant. After studies at Edinburgh Academy, he worked for the stage in 1944 as student assistant stage manager at the Memorial Theatre in Stratford-upon-Avon. This was followed by repertory experience in Dundee, Glasgow, Nottingham and with the Bristol Old Vic. A prolific actor at the Royal Court from the mid-1950's, and later with the Royal Shakespeare Company and Laurence Olivier's National Theatre. Tall and possessed of an incisive manner, resonant voice and larger-than-life personality, Crowden was at his best in eccentric portrayals as mad scientists or flawed men-of-the-cloth. One of his most memorable film appearances was as the maniacal chief surgeon in Lindsay Anderson's Britannia Hospital (1982). In television, he turned down the role of Doctor Who (1963) in 1974 but later appeared in it opposite Tom Baker, who had been cast as the Doctor instead, to give the series one of its most memorably over-the-top villains. He also achieved success in later life in television comedies such as A Very Peculiar Practice (1986) and opposite Stephanie Cole in Waiting for God (1990). He continued to act until shortly before his death.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NDczMTA2N15BMl5BanBnXkFtZTcwMzEzMTgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0189561","name":"Graham Crowden","idIMDB":"nm0189561"},"actorId":"nm0189561","character":"The Reverend Fitzbanks","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Suchet","urlProfile":"http://www.imdb.com/name/nm0837064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc4Mjg3ODA0OV5BMl5BanBnXkFtZTcwNzI4Njg4OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 May 1946","placeOfBirth":" Paddington, London, England, UK","birthName":"David C. Suchet","height":"5' 7\" (1.7 m)","bio":"Best known in the United Kingdom and abroad as Agatha Christie's suave Belgian super-sleuth Hercule Poirot in scores of late 1980s and '90s mini-movies, London-born actor David Suchet's early interest in the theater led to his membership with the National Youth Theatre of Great Britain in the 1960s following graduation from high school. He then studied for three years at the London Academy of Music and Dramatic Arts and, after a significant route in repertory work, became a company member of the Royal Shakespeare Company in 1973 where he was also evolved as one of its dominant players by decade's end. In the 1970s Suchet also began to come into his own on British television. In classical tradition, his first television movie was A Tale of Two Cities (1980). His first cinema detective has been a Greek inspector in the Disney mystery-comedy Trenchcoat (1983), followed by a range of film roles that express the width of his acting qualities, such as a Middle Eastern terrorist in The Little Drummer Girl (1984), a Russian operative in The Falcon and the Snowman (1985), a French hunter in Harry and the Hendersons (1987), a Polish bishop in Le complot (1988) and Napoleon in in Sabotage! (2000). His masterful work in television roles also includes portrayals of historical, biblical, entertainment and fictional figures, such as Sigmund Freud in Freud (1984), news reporter William L. Shirer in Murrow (1986), Aaron in La bible: Moise (1995), movie mogul Louis B. Mayer in RKO 281 (1999), Cardinal Wolsey in Henry VIII (2003)), vampire nemesis Van Helsing in Dracula (2006) and Robert Maxwell in Maxwell (2007). Widely regarded as the one of greatest stage and screen actors both in his native Great Britain and internationally, David Suchet always offers staggering work full of generously euphoric delight, with a theatre course that includes memorable stunning incarnations such as the Shakespearean ones of Iago in \"Othello\", Tybalt in \"Romeo and Juliet\", Caliban in \"The Tempest\" and \"Timon of Athens\", as well as in roles such as George in \"Who's Afraid of Virginia Woolf?\" in 1996 and, from 1998 to 2001, as composer Salieri in \"Amadeus\", a mesmerizing performance for which he received a Tony nomination after its Broadway presentation. Long wed to former actress Sheila Ferris, the couple has a son and daughter. His older brother is BBC newscaster-turned-journalist John Suchet.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjc4Mjg3ODA0OV5BMl5BanBnXkFtZTcwNzI4Njg4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0837064","name":"David Suchet","idIMDB":"nm0837064"},"actorId":"nm0837064","character":"Corbett","urlCharacter":"http://www.imdb.com/character/ch0490656","main":true},{"actorName":"Phoebe Nicholls","urlProfile":"http://www.imdb.com/name/nm0629498","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNTU3MTgxOF5BMl5BanBnXkFtZTcwNDY0MzIzOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 April 1957","placeOfBirth":" London, England, UK","birthName":"Sarah Phoebe Nicholls","height":"5' 5\" (1.65 m)","bio":"Phoebe Nicholls was born on April 7, 1957 in London, England as Sarah Phoebe Nicholls. She is an actress and writer, known for The Elephant Man (1980), Shackleton (2002) and Maurice (1987). She has been married to Charles Sturridge since July 6, 1985. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNTU3MTgxOF5BMl5BanBnXkFtZTcwNDY0MzIzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0629498","name":"Phoebe Nicholls","idIMDB":"nm0629498"},"actorId":"nm0629498","character":"Deborah Fitzbanks","urlCharacter":"http://www.imdb.com/character/ch0490653","main":true},{"actorName":"Tricia George","urlProfile":"http://www.imdb.com/name/nm0313633","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWFjNzI3MTQtNjY0MS00NGI3LTg4M2UtYTc2NGNkNWYxODk1L2ltYWdlXkEyXkFqcGdeQXVyMzM2NDc1Nzk@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Tricia George is known for her work on The Missionary (1982), The Waterloo Bridge Handicap (1978) and Maidens' Trip (1977).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWFjNzI3MTQtNjY0MS00NGI3LTg4M2UtYTc2NGNkNWYxODk1L2ltYWdlXkEyXkFqcGdeQXVyMzM2NDc1Nzk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0313633","name":"Tricia George","idIMDB":"nm0313633"},"actorId":"nm0313633","character":"Ada","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Valerie Whittington","urlProfile":"http://www.imdb.com/name/nm0926556","urlPhoto":"","biography":{"bio":"Valerie Whittington is an actress, known for The Meaning of Life (1983), The Missionary (1982) and The Return of the Soldier (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0926556","name":"Valerie Whittington","idIMDB":"nm0926556"},"actorId":"nm0926556","character":"Emmeline","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roland Culver","urlProfile":"http://www.imdb.com/name/nm0191745","urlPhoto":"","biography":{"dateOfBirth":"21 August 1900","placeOfBirth":" London, England, UK","birthName":"Roland Joseph Culver","bio":"Roland Culver was born on August 21, 1900 in London, England as Roland Joseph Culver. He was an actor, known for Thunderball (1965), Dead of Night (1945) and The Life and Death of Colonel Blimp (1943). He was married to Nan Hopkins and Daphne Rye. He died on March 1, 1984 in Henley-on-Thames, Oxfordshire, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0191745","name":"Roland Culver","idIMDB":"nm0191745"},"actorId":"nm0191745","character":"Lord Fermleigh","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rosamund Greenwood","urlProfile":"http://www.imdb.com/name/nm0339388","urlPhoto":"","biography":{"dateOfBirth":"12 June 1907","placeOfBirth":" Leeds, Yorkshire, England, UK","birthName":"Rosamund Mary Greenwood","height":"5' 6\" (1.68 m)","bio":"Rosamund Greenwood was born on June 12, 1907 in Leeds, Yorkshire, England as Rosamund Mary Greenwood. She was an actress, known for The Witches (1990), Curse of the Demon (1957) and Village of the Damned (1960). She was married to Leo de Pokorny. She died on July 15, 1997 in Malvern, Worcestershire, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0339388","name":"Rosamund Greenwood","idIMDB":"nm0339388"},"actorId":"nm0339388","character":"Lady Fermleigh","urlCharacter":"http://www.imdb.com/character/ch0490654","main":true},{"actorName":"Timothy Spall","urlProfile":"http://www.imdb.com/name/nm0001758","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzE2NzAxOF5BMl5BanBnXkFtZTYwNzIzODY1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1957","placeOfBirth":" Battersea, London, England, UK","birthName":"Timothy Leonard Spall","height":"5' 8\" (1.73 m)","bio":"Timothy Leonard Spall was born in Battersea, London, to Sylvia R. (Leonard), a hairdresser, and Joseph L. Spall, a postal worker. He was raised in London. Spall auditioned and earned a spot with the National Youth Theatre and later showed great promise at RADA where he portrayed the title roles in \"Macbeth\" and \"Othello.\" In 1979 he joined the Royal Shakespeare Company and stayed for approximately two years performing in \"The Merry Wives of Windsor,\" \"Cymbeline,\" \"The Three Sisters\" and \"Nicholas Nickleby.\" In the early 80s he moved into TV roles with Leigh's \"Home Sweet Home\" and later had his own drama series \"Frank Stubbs Promotes\" in 1993. With Leigh, Timothy's appeared in a number of award-winning features, particularly Life Is Sweet (1990) and Secrets & Lies (1996), for which he earned a BAFTA Award nomination, and the Gilbert & Sullivan biopic Topsy-Turvy (1999). He also worked for noted directors Ken Russell in Gothic (1986), Clint Eastwood in White Hunter Black Heart (1990), Bernardo Bertolucci in The Sheltering Sky (1990), and Kenneth Branagh in Hamlet (1996) as Rosenkrantz. A chronic illness curtailed his momentum in the mid-90s, coming back resourcefully on stage and TV. On a roll recently with more of his odd characterizations he lent his voice to the popular animated feature Chicken Run (2000) and appeared in Harry Potter and the Prisoner of Azkaban (2004) as Peter Pettigrew, and A Series of Unfortunate Events (2004) as Mr. Poe.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzE2NzAxOF5BMl5BanBnXkFtZTYwNzIzODY1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001758","name":"Timothy Spall","idIMDB":"nm0001758"},"actorId":"nm0001758","character":"Parswell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Neil Innes","urlProfile":"http://www.imdb.com/name/nm0409183","urlPhoto":"","biography":{"dateOfBirth":"9 December 1944","placeOfBirth":" Danbury, Essex, England, UK","height":"5' 10\" (1.78 m)","bio":"Neil Innes was born on December 9, 1944 in Danbury, Essex, England. He is an actor, known for Monty Python and the Holy Grail (1975), Life of Brian (1979) and The Rutles: All You Need Is Cash (1978). He has been married to Yvonne Hilton since March 5, 1966. They have three children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0409183","name":"Neil Innes","nicknames":["The Seventh Python"],"idIMDB":"nm0409183"},"actorId":"nm0409183","character":"Singer in Gin Palace","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Barrett","urlProfile":"http://www.imdb.com/name/nm0057179","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NjY1NzMzMl5BMl5BanBnXkFtZTgwMzY5NDEzMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 February 1910","placeOfBirth":" Rochdale, Lancashire, England, UK","birthName":"Jack Elvyn Barrett","height":"5' 7½\" (1.71 m)","bio":"John Barrett was born on February 18, 1910 in Rochdale, Lancashire, England as Jack Elvyn Barrett. He was an actor, known for The French Lieutenant's Woman (1981), Far from the Madding Crowd (1967) and Tess (1979). He died on May 22, 1983 in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NjY1NzMzMl5BMl5BanBnXkFtZTgwMzY5NDEzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0057179","name":"John Barrett","idIMDB":"nm0057179"},"actorId":"nm0057179","character":"Old Man outside Hotel","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0083449","urlIMDB":"http://www.imdb.com/title/tt0083449","business":{"budget":null,"openingWeekend":[{"money":"$1,864,852","country":"USA","day":"07","month":"11","year":"1982","remarks":"532 Screens"}],"gross":[{"money":"$7,241,180","country":"USA","day":"05","month":"12","year":"1982","remarks":""},{"money":"$6,398,559","country":"USA","day":"28","month":"11","year":"1982","remarks":""},{"money":"$5,121,400","country":"USA","day":"21","month":"11","year":"1982","remarks":""},{"money":"$3,890,388","country":"USA","day":"14","month":"11","year":"1982","remarks":""},{"money":"$1,864,852","country":"USA","day":"07","month":"11","year":"1982","remarks":""}],"weekendGross":[{"money":"$580,350","country":"USA","day":"05","month":"12","year":"1982","remarks":"460 Screens"},{"money":"$894,850","country":"USA","day":"28","month":"11","year":"1982","remarks":"407 Screens"},{"money":"$853,918","country":"USA","day":"21","month":"11","year":"1982","remarks":"393 Screens"},{"money":"$1,311,391","country":"USA","day":"14","month":"11","year":"1982","remarks":"528 Screens"},{"money":"$1,864,852","country":"USA","day":"07","month":"11","year":"1982","remarks":"532 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min) (USA)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":["82 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["J-D-C Scope"],"printedFilmFormat":["35 mm"]},"rating":"6.2","filmingLocations":[{"location":"Highclere Castle, Highclere, Hampshire, England, UK"}],"rated":"R","awards":[],"votes":"1,719","type":"Movie","companyCreditsSimple":[{"idCompany":"co0103514","name":"HandMade Films"}],"keywords":{"keywords":["bishop","africa","prostitute","london england","shooting party","secret past","scotland","photo album epilogue","nobility","murder plot","desperation","brothel","attraction","attempted poisoning","accidental shooting","turn of the century","country house","england","wedding","shot in the back","husband wife relationship","hitman","engagement","bedroom","aristocrat","vicar","memory loss","butler","boxing","bicycle","religion","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:22:05"}}