{"data":{"movies":[{"title":"Black Arrow","originalTitle":"","year":"1985","releaseDate":"19850106","directors":[{"name":"John Hough","id":"nm0396421"}],"writers":[{"name":"Robert Louis Stevenson","id":"nm0829044"},{"name":"David Pursall","id":"nm0700950"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWQyMjU5MDMtMTZlMC00MTBiLWI3YjEtYzBhZmRkYTcyNjNlXkEyXkFqcGdeQXVyNTI2Njg2OTI@._V1.jpg","countries":["USA","Spain"],"languages":["English"],"genres":["Adventure","History"],"plot":"In England, during the 15th century, many lords and noblemen vie for the throne.Among the contenders, two of the most powerful nobles fight a bitter war among one another.Sir Daniel is the head of the House of York while Sir Henry is the head of the House of Lancaster.Among all the English nobles,they stand the best chance of becoming the next king of England, given their wealth and power.But there can only be one monarch.The two Houses go to war. Each House chooses a symbol.The House of York chooses a white rose while the House of Lancaster chooses a red rose.The Earl of Warwick is the sitting monarch's advisor but he already starts to plot against the king in a secret alliance with Sir Daniel.The only party not having anything to gain from either House acceding to the throne is the English populace facing ever increasing royal taxes.However, a mysterious champion of the poor and the oppressed has appeared on the scene, attacking and killing any tax collecting officials and their ...","simplePlot":"In 15th century England, a civil war called Wars of the Roses is being fought between two rival houses who want the throne. Fresh from battle, a knight finds his family dead. He joins the outlaws led by the Black Arrow to seek justice.","actors":[{"actorName":"Benedict Taylor","urlProfile":"http://www.imdb.com/name/nm0852028","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc1NzQyMDQ3NF5BMl5BanBnXkFtZTgwNDM5NjI0MDI@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1960","placeOfBirth":" London, England, UK","birthName":"Benedict Sean Taylor","bio":"Benedict Taylor was born on April 18, 1960 in London, England as Benedict Sean Taylor. He is an actor, known for Star Wars: Episode I - The Phantom Menace (1999), Notes on a Scandal (2006) and The Watcher in the Woods (1980).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc1NzQyMDQ3NF5BMl5BanBnXkFtZTgwNDM5NjI0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0852028","name":"Benedict Taylor","idIMDB":"nm0852028"},"actorId":"nm0852028","character":"Richard","urlCharacter":"http://www.imdb.com/character/ch0216451","main":true},{"actorName":"Georgia Slowe","urlProfile":"http://www.imdb.com/name/nm0806264","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU2MDIxNTkxM15BMl5BanBnXkFtZTcwNzUwOTcxNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 June 1966","placeOfBirth":" London, England, UK","height":"5' 3\" (1.6 m)","bio":"Georgia Slowe was born on June 3, 1966 in London, England. She is an actress and producer, known for Emmerdale (1972), The Company of Wolves (1984) and Black Arrow (1985).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTU2MDIxNTkxM15BMl5BanBnXkFtZTcwNzUwOTcxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0806264","name":"Georgia Slowe","idIMDB":"nm0806264"},"actorId":"nm0806264","character":"Joanna","urlCharacter":"http://www.imdb.com/character/ch0216452","main":true},{"actorName":"Oliver Reed","urlProfile":"http://www.imdb.com/name/nm0001657","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NDg5MDg1MF5BMl5BanBnXkFtZTcwNzEwODkyOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1938","placeOfBirth":" Wimbledon, London, England, UK","birthName":"Robert Oliver Reed","height":"5' 11\" (1.8 m)","bio":"Oliver Reed was born on February 13, 1938 in Wimbledon, London, England as Robert Oliver Reed. He was an actor, known for Gladiator (2000), Oliver! (1968) and Tommy (1975). He was married to Josephine Burge and Kate Byrne. He died on May 2, 1999 in Valletta, Malta.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NDg5MDg1MF5BMl5BanBnXkFtZTcwNzEwODkyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001657","name":"Oliver Reed","nicknames":["Mr England","Ollie"],"idIMDB":"nm0001657"},"actorId":"nm0001657","character":"Sir Daniel","urlCharacter":"http://www.imdb.com/character/ch0216453","main":true},{"actorName":"Fernando Rey","urlProfile":"http://www.imdb.com/name/nm0721073","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODc3NDM0NV5BMl5BanBnXkFtZTYwNDI3MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 September 1917","placeOfBirth":" A Coruña, Galicia, Spain","birthName":"Fernando Casado Arambillet","height":"5' 9½\" (1.77 m)","bio":"Fernando Rey, the great Spanish movie actor primarily known in the United States for his role as \"Frog One\" in The French Connection (1971) and its sequel, was born Fernando Casado D'Arambillet on September 20 1917, in A Coruña, Galicia, Spain, the son of Colonel Casado Veiga. Originally, the young Fernando intended to become an architect. However, when the Spanish Civil War erupted in 1936, his architectural studies were interrupted, and he gained employment as a movie extra. He took the stage name \"Fernando Rey\" at the beginning of his career, equivalent, in English, to \"Fernando King\". Eight years after his movie debut, he was cast in his first major speaking role, as the Duke de Alba in José López Rubio's 1944 movie \"Eugenia de Montijo\". Rey enjoyed a long and prosperous career as an actor in movies, the theater, radio, and television. He also was a major voice-over artist in Spain, narrating films and dubbing the voices of actors in foreign films. Rey's most fruitful collaboration was with the great director Luis Buñuel, which began during the 1960s and continued thought the 1970s. The films that Rey appeared in for Buñuel' made him an international star, the first produced by the Spanish cinema. By the early 1970s, Rey's career reached its high point, with his co-starring role in \"The French Connection\" (Best Picture Oscar Winner for 1971) and his starring role in Buñuel's The Discreet Charm of the Bourgeoisie (1972) (\"The Discreet Charm of the Bourgeoisie\", Best Foreign Language Film Oscar winner for 1972). Rey followed up these successes by appearing in The French Connection (1971) in 1974, and Buñuel's tandem That Obscure Object of Desire (1977) (\"That Obscure Object of Desire\"), an art-house hit that was nominated for the Best Foreign Language Film Oscar. Ironically, in the film, Rey's voice was dubbed into French by Michel Piccoli. That same year, he won the Best Actor prize at Cannes for Carlos Saura' Elisa, My Life (1977). Many honors came to Rey in the twilight of his career, during the 1980s and 1990s. He was awarded at San Sebastián and Cannes, and was presented with the gold medal of the Spanish Art and Movie Sciences Academy. He became the president of that Academy from 1992 till his death from cancer two years later.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0ODc3NDM0NV5BMl5BanBnXkFtZTYwNDI3MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0721073","name":"Fernando Rey","idIMDB":"nm0721073"},"actorId":"nm0721073","character":"Warwick","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephan Chase","urlProfile":"http://www.imdb.com/name/nm0153833","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMTkzODIyOF5BMl5BanBnXkFtZTcwNjUwMDAwOQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1947","placeOfBirth":" UK","height":"6' 2\" (1.88 m)","bio":"Stephan Chase was born in 1947 in the UK. He is an actor, known for Maleficent (2014), Macbeth (1971) and Cry of the Banshee (1970).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMTkzODIyOF5BMl5BanBnXkFtZTcwNjUwMDAwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0153833","name":"Stephan Chase","idIMDB":"nm0153833"},"actorId":"nm0153833","character":"Black Arrow","urlCharacter":"http://www.imdb.com/character/ch0216462","main":true},{"actorName":"Donald Pleasence","urlProfile":"http://www.imdb.com/name/nm0000587","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjYzNTQ2MV5BMl5BanBnXkFtZTcwMzA5MTkzNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1919","placeOfBirth":" Worksop, Nottinghamshire, England, UK","birthName":"Donald Henry Pleasence","height":"5' 6\" (1.68 m)","bio":"Balding, quietly-spoken, of slight build and possessed of piercing blue eyes -- often peering out from behind round, steel-rimmed glasses -- Donald Pleasence had the necessary physical attributes which make a great screen villain. In the course of his lengthy career, he relished playing the obsessed, the paranoid and the purely evil. Even the Van Helsing-like psychiatrist Sam Loomis in the Halloween (1978) franchise seems only marginally more balanced than his prey. An actor of great intensity, Pleasence excelled on stage as Shakespearean villains. He was an unrelenting prosecutor in Jean Anouilh's \"Poor Bitos\" and made his theatrical reputation in the title role of the seedy, scheming tramp in Harold Pinter's \"The Caretaker\" (1960). On screen, he gave a perfectly plausible interpretation of the head of the SS, Heinrich Himmler, in The Eagle Has Landed (1976). He was a convincingly devious Thomas Cromwell in Henry VIII and His Six Wives (1972), disturbing in his portrayal of the crazed, bloodthirsty preacher Quint in Will Penny (1967); and as sexually depraved, alcohol-sodden 'Doc' Tydon in the brilliant Aussie outback drama Wake in Fright (1971). And, of course, he was Ernst Stavro Blofeld in You Only Live Twice (1967). These are some of the films, for which we may remember Pleasence, but there was a great deal more to this fabulous, multi-faceted actor. Donald Henry Pleasence was born on October 5, 1919 in Worksop, Nottinghamshire, England, to Alice (Armitage) and Thomas Stanley Pleasence. His family worked on the railway; his grandfather had been a signal man and both his brother and father were station masters. When Donald failed to get a scholarship at RADA, he joined the family occupation working as a clerk at his father's station before becoming station master at Swinton, Yorkshire. While there he wrote letters to theatre companies eventually being accepted by one on the island of Jersey in Spring 1939 as an assistant stage manager. On the eve of World War II, he made his theatrical debut in \"Wuthering Heights\". In 1942, he played Curio in \"Twelfth Night\", but his career was then interrupted by military service in the RAF. He was shot down over France, incarcerated and tortured in a German POW camp. Once repatriated, Donald returned to the stage in Peter Brook's 1946 London production of \"The Brothers Karamazov\" with Alec Guinness although he missed the opening due to measles, followed by a stint on Broadway with Laurence Olivier's touring company in \"Caesar and Cleopatra\" and \"Anthony and Cleopatra\". Upon his return to England, he won critical plaudits for his performance in \"Hobson's Choice\". In 1952, Donald began his screen career, rather unobtrusively, in small parts. He was only really noticed once having found his métier as dastardly, sneaky Prince John in The Adventures of Robin Hood (1955). It took several more years, until international recognition came his way: first, through the filmed adaptation of The Guest (1963); and, secondly, with his blind forger in The Great Escape (1963), a role imbued with added conviction due to his own wartime experience. Some of his best acting Donald reserved for the small screen. In 1962, the producer of The Twilight Zone (1959), Buck Houghton, brought Donald to the United States ('damn the expense'!) to guest star in the third season episode \"The Changing of the Guard\". He was given a mere five days to immerse himself in the part of a gentle school teacher, Professor Ellis Fowler, who, on the eve of Christmas is forcibly retired after fifty-one years of teaching. Devastated, and believing himself a failure who has made no mark on the world, he is about to commit suicide when the school's bell summons him to his classroom. There, he is confronted by the spirits of deceased students who exhort him to consider that his lessons have had fundamental effects on their lives, even leading to acts of great heroism. Upon hearing this, Fowler is now content to graciously accept his retirement. Managing to avoid maudlin sentimentality, Donald's performance was intuitive and, arguably, one of the most poignant ever accomplished in a thirty-minute television episode. Once again, against type, he was equally delightful as the mild-mannered Reverend Septimus Harding in Anthony Trollope's The Barchester Chronicles (1982). Whether eccentric, sinister or given to pathos, Donald Pleasence was always great value-for-money and his performances have rarely failed to engage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjYzNTQ2MV5BMl5BanBnXkFtZTcwMzA5MTkzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000587","name":"Donald Pleasence","idIMDB":"nm0000587"},"actorId":"nm0000587","character":"Sir Oliver Oates","urlCharacter":"http://www.imdb.com/character/ch0216454","main":true},{"actorName":"Roy Boyd","urlProfile":"http://www.imdb.com/name/nm0101902","urlPhoto":"","biography":{"dateOfBirth":"18 August 1938","placeOfBirth":" Croydon, Surrey, England, UK","bio":"Roy Boyd was born on August 18, 1938 in Croydon, Surrey, England. He is an actor, known for The Omen (1976), The Wicker Man (1973) and Asylum (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0101902","name":"Roy Boyd","idIMDB":"nm0101902"},"actorId":"nm0101902","character":"Lawless","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aldo Sambrell","urlProfile":"http://www.imdb.com/name/nm0759757","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNjY0NTQzMV5BMl5BanBnXkFtZTYwODEwMjI0._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 February 1931","placeOfBirth":" Madrid, Madrid, Spain","birthName":"Alfredo Sánchez Brell","bio":"Prolific, versatile, and ubiquitous character actor Aldo Sambrell was featured in over 140 international motion pictures in a remarkably long, varied, and illustrious career that spanned four and a half decades. Swarthy and burly, usually sporting a thick mustache, and often projecting an air of quiet oily menace, Sambrell was frequently cast in colorful supporting parts as hateful villains and lethal gunslingers in numerous Italian spaghetti Westerns. Sambrell was born Alfredo Sanchez Brell on February 23, 1931 in Madrid, Spain. His family fled Spain because of the Spanish Civil War and he was raised in Mexico. While in Mexico Aldo played professional soccer in the Mexican leagues in Pueblo and Monterrey. After beginning his career in the entertainment industry as a singer, Sambrell eventually returned to Spain and made his film debut in an uncredited bit role as a Jewish rebel in the biblical epic King of Kings (1961). Aldo appeared in his first spaghetti western in 1963. Sambrell was perhaps best known for his gritty portrayals of scruffy bandit gang members in Sergio Leone's classic spaghetti westerns A Fistful of Dollars (1964), For a Few Dollars More (1965), The Good, the Bad and the Ugly (1966) and Once Upon a Time in the Wild, Wild West (1973). Sambrell gave a memorably chilling performance as ruthless bandit gang leader Mervyn Duncan in Navajo Joe (1966). He had a rare lead role as voodoo priest Gatenebo in the laughably lousy horror clunker La vengeance du zombie (1974). Among the many directors Aldo worked for are David Lean, Richard Fleischer, John Milius, Sergio Corbucci, Umberto Lenzi, León Klimovsky, Jess Franco, Richard Lester, Jackie Chan, Charlton Heston, Matt Cimber and Enzo G. Castellari. Moreover, Sambrell also wrote, produced and directed a few films. He was married to actress Cándida López. His last film role was as an aging actor in the poignant short Río seco (2006). Aldo died at age 79 on July 10, 2010 in Alicante, Spain after suffering a series of strokes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNjY0NTQzMV5BMl5BanBnXkFtZTYwODEwMjI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0759757","name":"Aldo Sambrell","idIMDB":"nm0759757"},"actorId":"nm0759757","character":"Scar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carol Gotell","urlProfile":"http://www.imdb.com/name/nm0331769","urlPhoto":"","biography":{"bio":"Carol Gotell is an actress, known for Black Arrow (1985), Kate (1970) and The Main Chance (1969).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0331769","name":"Carol Gotell","idIMDB":"nm0331769"},"actorId":"nm0331769","character":"Hannah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Russell","urlProfile":"http://www.imdb.com/name/nm0751416","urlPhoto":"","biography":{"dateOfBirth":"24 May 1936","placeOfBirth":" Kent, England, UK","height":"6' 3\" (1.91 m)","bio":"Robert Russell was born on May 24, 1936 in Kent, England. He was an actor, known for The Conqueror Worm (1968), Bedazzled (1967) and The Sign of Four (1983). He died on May 12, 2008 in Maidenhead, Berkshire, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0751416","name":"Robert Russell","idIMDB":"nm0751416"},"actorId":"nm0751416","character":"Appleyard","urlCharacter":"http://www.imdb.com/character/ch0216455","main":true},{"actorName":"Frank Braña","urlProfile":"http://www.imdb.com/name/nm0106394","urlPhoto":"","biography":{"dateOfBirth":"24 February 1934","placeOfBirth":" Pola de Allande, Asturias, Spain","birthName":"Francisco Braña Pérez","bio":"Frank Braña was born on February 24, 1934 in Pola de Allande, Asturias, Spain as Francisco Braña Pérez. He was an actor, known for Pieces (1982), Return of the Evil Dead (1973) and God Forgives... I Don't! (1967). He died on February 13, 2012 in Majadahonda, Madrid, Spain.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0106394","name":"Frank Braña","idIMDB":"nm0106394"},"actorId":"nm0106394","character":"Sykes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ralph Brown","urlProfile":"http://www.imdb.com/name/nm0114460","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5MDQ3ODY3N15BMl5BanBnXkFtZTcwNDEzNDc3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 June 1957","placeOfBirth":" Cambridge, Cambridgeshire, England, UK","height":"5' 11\" (1.8 m)","bio":"Ralph Brown was born on June 18, 1957 in Cambridge, Cambridgeshire, England. He is an actor and writer, known for Alien 3 (1992), Star Wars: Episode I - The Phantom Menace (1999) and Wayne's World 2 (1993). He is married to Jenny Jules.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5MDQ3ODY3N15BMl5BanBnXkFtZTcwNDEzNDc3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0114460","name":"Ralph Brown","idIMDB":"nm0114460"},"actorId":"nm0114460","character":"Yardley","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0088813","urlIMDB":"http://www.imdb.com/title/tt0088813","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["Stereo"],"color":["Color (Eastmancolor)"],"aspectRatio":["1.33 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Kay Laboratories Ltd., London, UK"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.8","filmingLocations":[{"location":"Spain"}],"awards":[{"award":"CableACE Awards 1985","titlesAwards":[{"titleAwardOutcome":"Nominated ACE","categories":[{"category":"Costume Design","names":[{"name":"Vanessa Clark","id":"nm2656387","role":null},{"name":"Disney Channel","id":null,"role":null}]}]}]}],"votes":"414","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0013838","name":"Cabo Blanco Production Inc."},{"idCompany":"co0059468","name":"Compañía Iberoamericana de TV"},{"idCompany":"co0081423","name":"Jerawood Limited"}],"keywords":{"keywords":["knight","arrow","england","sword","armor","tax collector","horse","highwayman","bow","earl","castle","color in title","middle age romance","revenge","middle ages","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 05:23:11"}}