{"data":{"movies":[{"title":"Man in the Shadow","originalTitle":"","year":"1957","releaseDate":"195801","directors":[{"name":"Jack Arnold","id":"nm0000791"}],"writers":[{"name":"Gene L. Coon","id":"nm0177731"}],"runtime":"80 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODViMDZlZTQtMzcwOC00MWI1LTk2OTMtNzZhYTBiYTJlYzhkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Romance","Thriller","Western"],"plot":"In effect, modern cow town Spurline is run by Virgil Renchler, owner of the Golden Empire Ranch. One night, two of Virgil's henchmen go a little too far and beat a \"bracero\" ranch hand to death. Faced with an obvious cover-up and opposition on every hand, sheriff Ben Sadler is goaded into investigating. His unlikely ally: Renchler's lovely, self-willed and overprotected daughter. Will Ben survive Renchler's wrath?","simplePlot":"Virgil Renchler owns most of the town providing a thriving economy. When his men go too far and kill one of his migrant workmen, the sheriff goes after him even if it means his job and everyone else's.","actors":[{"actorName":"Jeff Chandler","urlProfile":"http://www.imdb.com/name/nm0001996","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTAxMDQ3NDk0OV5BMl5BanBnXkFtZTYwNTA4MjM2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 December 1918","placeOfBirth":" Brooklyn, New York, USA","birthName":"Ira Grossel","height":"6' 4\" (1.93 m)","bio":"Jeff was born in Brooklyn and attended Erasmus High School. After high school, he took a drama course and worked in stock companies for two years. His next role would be that of an officer in World War II. After he was discharged from the service, he became busy acting in radio drama's and comedies until he was signed by Universal. It would be in the fifties that Jeff would become a star making westerns and action pictures. He would be nominated for an Academy Award for his role as Cochise in Broken Arrow (1950). He would follow this by playing the role of Cochise in two sequels: The Battle at Apache Pass (1952) and Taza, Son of Cochise (1954). While his premature gray hair and tanned features served him well in his westerns and action pictures, the studio would put him into soaps and costume movies. In his films, his leading ladies would include Maureen O'Hara, Rhonda Fleming, Jane Russell, Joan Crawford, and June Allyson. Shortly after his last film Merrill's Marauders (1962), Jeff died, at 42, from blood poisoning after an operation for a slipped disc.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTAxMDQ3NDk0OV5BMl5BanBnXkFtZTYwNTA4MjM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001996","name":"Jeff Chandler","nicknames":["Big Gray"],"idIMDB":"nm0001996"},"actorId":"nm0001996","character":"Ben Sadler","urlCharacter":"http://www.imdb.com/character/ch0178763","main":true},{"actorName":"Orson Welles","urlProfile":"http://www.imdb.com/name/nm0000080","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE1Nzg5NzMwM15BMl5BanBnXkFtZTYwMDQwMTM2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 May 1915","placeOfBirth":" Kenosha, Wisconsin, USA","birthName":"George Orson Welles","height":"6' 1½\" (1.87 m)","bio":"His father was a well-to-do inventor, his mother a beautiful concert pianist; Orson Welles was gifted in many arts (magic, piano, painting) as a child. When his mother died (he was nine) he traveled the world with his father. When his father died (he was fifteen) he became the ward of Chicago's Dr. Maurice Bernstein. In 1931, he graduated from the Todd School in Woodstock, Illinois; he turned down college offers for a sketching tour of Ireland. He tried unsuccessfully to enter the London and Broadway stages, traveling some more in Morocco and Spain (where he fought in the bullring). Recommendations by Thornton Wilder and Alexander Woollcott got him into Katherine Cornell's road company, with which he made his New York debut as Tybalt in 1934. The same year, he married, directed his first short, and appeared on radio for the first time. He began working with John Houseman and formed the Mercury Theatre with him in 1937. In 1938, they produced \"The Mercury Theatre on the Air\", famous for its broadcast version of \"The War of the Worlds\" (intended as a Halloween prank). His first film to be seen by the public was Citizen Kane (1941), a commercial failure losing RKO $150,000, but regarded by many as the best film ever made. Many of his next films were commercial failures and he exiled himself to Europe in 1948. In 1956, he directed Touch of Evil (1958); it failed in the United States but won a prize at the 1958 Brussels World's Fair. In 1975, in spite of all his box-office failures, he received the American Film Institute's Lifetime Achievement Award, and in 1984, the Directors Guild of America awarded him its highest honor, the D.W. Griffith Award. His reputation as a filmmaker has climbed steadily ever since.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE1Nzg5NzMwM15BMl5BanBnXkFtZTYwMDQwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000080","name":"Orson Welles","idIMDB":"nm0000080"},"actorId":"nm0000080","character":"Virgil Renchler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Colleen Miller","urlProfile":"http://www.imdb.com/name/nm0588125","urlPhoto":"","biography":{"dateOfBirth":"10 November 1932","placeOfBirth":" Yakima, Washington, USA","bio":"The story goes that 19-year-old Colleen Miller was fishing in the California mountains when a resort photographer recruited her to pose with a prize trout; a movie scout saw the picture in print, and Colleen wound up with a small role in The Las Vegas Story (1952). A more noticeable role in Man Crazy (1953) brought the brunette beauty a contract at Universal, where she quickly became a second-rank star in westerns and film-noir. Her best notices were for Playgirl (1954), Four Guns to the Border (1954) and Man in the Shadow (1957), gaining critical praise for her fine natural talent and carefree sensuality. She retired in 1958 (except for one B-western in 1963) for a domestic life with her husband and 2 children. After her 1975 divorce she reportedly considered resuming her career, but has made no more films to date.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0588125","name":"Colleen Miller","idIMDB":"nm0588125"},"actorId":"nm0588125","character":"Skippy Renchler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ben Alexander","urlProfile":"http://www.imdb.com/name/nm0018273","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMzU2OTc2MV5BMl5BanBnXkFtZTcwOTk0MDk5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1911","placeOfBirth":" Goldfield, Nevada, USA","birthName":"Nicholas Benton Alexander III","height":"5' 10\" (1.78 m)","bio":"Starting out as a child actor in 1915, Ben Alexander's first roles were in the films of such directors as Cecil B. DeMille and D.W. Griffith. He later graduated to juvenile leads and supporting parts in sound films, most notably in All Quiet on the Western Front (1930). When his acting career slowed down in the mid-'30s, he found a new career as a successful radio announcer. Alexander was more or less retired when producer Jack Webb picked him for the part of his detective partner in the TV series Dragnet (1951). Alexander later played another detective on Howard Duff's TV series The Felony Squad (1966).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMzU2OTc2MV5BMl5BanBnXkFtZTcwOTk0MDk5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0018273","name":"Ben Alexander","idIMDB":"nm0018273"},"actorId":"nm0018273","character":"Ab Begley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barbara Lawrence","urlProfile":"http://www.imdb.com/name/nm0492631","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzEwZTdkMmQtYTY5NC00NDY3LWFlOTAtNzgyOGUyY2NiOTRlXkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1930","placeOfBirth":" Carnegie, Oklahoma, USA","birthName":"Barbara Jo Lawrence","height":"5' 8\" (1.73 m)","bio":"Her career may have only lasted a dozen years, and the number of films slightly more than twenty, but Barbara appeared in some interesting productions. As a young girl, she was a model. While completing her studies at UCLA, she co-starred in half a dozen movies for 20th Century Fox. She appeared in the critically acclaimed A Letter to Three Wives (1949). In 1952, she was cast in Here Come the Nelsons (1952), which was the film version of their popular Radio show. The movie also had Rock Hudson in the cast. The next year, Barbara was cast with Gig Young in Arena (1953), which was a 3-D feature film from MGM. As originally shown, special 3-D glasses were required to view the picture to bring all the action of the Rodeo to your seat. In 1954, she was cast in Her Twelve Men (1954), which was the last film that Greer Garson made at MGM. In 1955, she was cast as Gertie Cummings in the movie Oklahoma! (1955). Oklahoma! (1955) was filmed in TODD-AO wide screen and Barbara reprises the role she played on the stage. After a couple of movies in 1957, Barbara retired.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzEwZTdkMmQtYTY5NC00NDY3LWFlOTAtNzgyOGUyY2NiOTRlXkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0492631","name":"Barbara Lawrence","idIMDB":"nm0492631"},"actorId":"nm0492631","character":"Helen Sadler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Larch","urlProfile":"http://www.imdb.com/name/nm0488024","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzBmMDE2OWItYzk0NC00YjQxLWE1ODctZTNkODE3NDliMDhlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1914","placeOfBirth":" Salem, Massachusetts, USA","height":"6' (1.83 m)","bio":"Instantly recognizable American character actor with bulbous nose and heavily lined face, who could convey integrity or menace to equal effect. He first came to prominence on radio as (Captain) Starr of Space (1953), using ray guns to combat Martians and alien queens. Beginning in 1953, Larch accumulated an impressive resume of TV series credits, spanning almost the entire spectrum of the best western, crime and science-fiction shows the 1950's and 60's had to offer. His authoritarian personality and demeanor generally typecast him as police officers, military men, attorneys and politicians. Quite a few of these turned out to be either corrupt or outright villains. Point in case, his performance as a tough hood in The Phenix City Story (1955), described by Bosley Crowther as \"stinging\" in \"hard malevolence\" (New York Times, September 3, 1955). At his best, Larch was the nervous Mr. Fremont, father to the eminently dangerous Anthony (Bill Mumy) in the classic entry into The Twilight Zone (1959), 'It's a Good Life'. In The Invaders (1967) episode 'Genesis', he was again excellent as police officer Greg Lucather, at first skeptical, but subsequently swayed by irrefutable evidence to help in David Vincent's quest. On the big screen, he is perhaps best remembered as Harry Callahan's Chief of Police in the original Dirty Harry (1971).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzBmMDE2OWItYzk0NC00YjQxLWE1ODctZTNkODE3NDliMDhlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0488024","name":"John Larch","idIMDB":"nm0488024"},"actorId":"nm0488024","character":"Ed Yates","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Gleason","urlProfile":"http://www.imdb.com/name/nm0322299","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNTY0MDEzMF5BMl5BanBnXkFtZTcwOTk3OTkwOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 May 1882","placeOfBirth":" New York City, New York, USA","birthName":"James Austin Gleason","height":"5' 8\" (1.73 m)","bio":"James Gleason was born in New York City to William Gleason and Mina Crolius, who were both in the theatre. He was married to Lucile Gleason (born Lucile Webster), and had a son, Russell Gleason. As a young man James fought in the Spanish-American War. After the war he joined the stock company at the Liberty Theater in Oakland, California, which his parents were running. James and his wife then moved to Portland, Oregon, where they played in stock at the Baker Theater. For several years afterward they toured in road shows until James enlisted in the army during World War I. When he returned he appeared on the stage in \"The Five Million.\" He then turned to writing, including \"Is Zat So\", which he produced for the NY stage. He also wrote and acted in \"The Fall Guy\" and \"The Shannons on Broadway.\" Next he wrote The Broadway Melody (1929) for MGM. He collaborated, in 1930, on The Swellhead (1930), Dumbbells in Ermine (1930), What a Widow! (1930), Rain or Shine (1930) and His First Command (1929). He and his wife were then contracted to Pathe, Lucille to act, and James (or Jimmie as he was known) as a writer. Probably his most famous acting role was as Max Corkle, the manager of Joe Pendleton who was wrongly plucked from this life into the next, in the hit fantasy Here Comes Mr. Jordan (1941).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNTY0MDEzMF5BMl5BanBnXkFtZTcwOTk3OTkwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0322299","name":"James Gleason","idIMDB":"nm0322299"},"actorId":"nm0322299","character":"Hank James","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Royal Dano","urlProfile":"http://www.imdb.com/name/nm0200455","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDI5OTQzNF5BMl5BanBnXkFtZTcwMjg4MzI4Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 November 1922","placeOfBirth":" New York City, New York, USA","birthName":"Royal Edward Dano Sr.","height":"6' 2\" (1.88 m)","bio":"Royal Dano was undoubtedly one of the best, most quirky and striking character actors to ever grace the big and small screen alike in a lengthy and impressive career which spanned 42 years. Royal Edward Dano was born on November 16, 1922 in New York City, to Mary Josephine (O'Connor) and Caleb Edward Dano, a newspaper printer. He was of mostly Irish descent (his mother was an immigrant). Royal ran away from home at age twelve and lived in such states as Texas, Florida and California. He struck a deal with his father to continue his education, but still be able to travel around the country. Dano eventually attended New York University. His performing career began as part of the 44th Special Service Provisional Company during World War II. Dano soon branched out to the New York stage and made his Broadway debut with a small role in the hit musical \"Finian's Rainbow.\" He was nominated by the New York Critic's Circle as one of the Promising Actors of 1949. Tall and lean, with a gaunt face, dark hair, a rangy build, and a very distinctive deep croaky voice, Dano was usually cast in both movies and TV shows as gloomy and/or sinister characters. He appeared most often in westerns and worked several times with James Stewart and director Anthony Mann. He made his film debut in \"Undercover Girl.\" Dano's more memorable roles include the Tattered Soldier in \"The Red Badge of Courage,\" a sickly bookworm bad guy in \"Johnny Guitar,\" Elijah in \"Moby Dick,\" Peter in \"King of Kings,\" a cattle rustler in \"The Culpepper Cattle Company,\" a coroner in \"Electra Glide in Blue,\" a profanity-spewing preacher in \"Big Bad Mama,\" Ten Spot in \"The Outlaw Josey Wales,\" a weary factory line worker in \"Take This Job and Shove It,\" a lightening rod salesman in \"Something Wicked This Way Comes,\" a minister in \"The Right Stuff,\" a stuffy high school teacher in \"Teachers,\" rascally zombified old-timer Gramps in \"House II: The Second Story,\" a cantankerous farmer in \"Killer Klowns from Outer Space,\" and, in his last part, a cemetery caretaker in George Romero's \"The Dark Half.\" Among the numerous TV shows Dano did guest spots on are \"Twin Peaks,\" \"Amazing Stories,\" \"CHiPs,\" \"Quincy M.E.,\" \"Fantasy Island,\" \"Little House on the Prairie,\" \"Kung Fu,\" \"Ben Casey,\" \"Planet of the Apes,\" \"Cannon,\" \"Playhouse 90,\" \"Lost in Space,\" \"Gunsmoke,\" \"Bonanza,\" \"Wagon Train,\" \"The Virginian,\" \"Hawaii Five-O,\" \"Alfred Hitchcock Presents,\" \"Wanted; Dead or Alive,\" \"Night Gallery,\" \"Route 66,\" \"The Rifleman,\" and \"Rawhide.\" Moreover, Dano did the voice of the audioanimatronic Abraham Lincoln for Walt Disney's Hall of Presidents for both Disneyland and Disney World. Dano also portrayed Lincoln on the \"Omnibus\" television series. He's the father of actor Richard Dano. Royal Dano died at age 71 of a heart attack on May 15th, 1994.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4MDI5OTQzNF5BMl5BanBnXkFtZTcwMjg4MzI4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0200455","name":"Royal Dano","idIMDB":"nm0200455"},"actorId":"nm0200455","character":"Aiken Clay","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Fix","urlProfile":"http://www.imdb.com/name/nm0280707","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODA0OTIzOF5BMl5BanBnXkFtZTcwMTg4MzI4Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 March 1901","placeOfBirth":" Dobbs Ferry, New York, USA","birthName":"Peter Paul Fix","height":"6' (1.83 m)","bio":"Paul Fix, the well-known movie and TV character actor who played \"Marshal Micah Torrance\" on the TV series The Rifleman (1958), was born Peter Paul Fix on March 13, 1901 in Dobbs Ferry, New York to brew-master Wilhelm Fix and his wife, the former Louise C. Walz. His mother and father were German immigrants who had left their Black Forest home and arrived in New York City in the 1870s. (The name \"Fix\" is of Latin/Germanic origin, and is derived from St. Vitus and means \"animated\" or \"vital\"). Besides Peter Paul, the Fix family consisted of two girls and three boys, the youngest of whom was six years older than the future actor. Peter Paul's childhood was a happy one. He and his family lived on the 200-acre property on which the Manilla Anchor Brewery, where his father was brew-master, was situated. Such was the importance of Fix to the brewery that when he died at the age of 62 on the eve of America's entry into the First World War (two years after his 54-year old wife had died), the brewery closed. The orphaned Peter Paul, who kept to himself a lot and had a vivid imagination, was sent to live with his married sisters, first one who lived nearby in Yonkers, and then to another in Zanesville, Ohio. The just-turned-17-year-old Peter Paul Fix joined the U.S. Navy on March 12, 1918, and spent his state-side service time during World War I in Newport, Rhode Island and Charleston, South Carolina. He first tread the boards as an actor while a sailor stationed in Newport, when the baby-faced salt (who looked much younger than his age) was one of six gobs chosen to play female roles in the Navy Relief Show \"HMS Pinafore\". The Navy staging of the Gilbert and Sullivan operetta was a big hit and chalked up a run of several weeks in Providence and Boston. Fix was assigned as an able-bodied seaman to the troopship U.S.S. Mount Vernon, which was torpedoed by a German U-boat off the coast of France but did not sink as it was run aground. The rest of Fix's naval career was less exciting, and he was demobilized on September 5, 1919. After his discharge, Fix went back to his girlfriend Frances (Taddy) Harvey, whom he had left behind in Zanesville. He and Taddy were married in 1922 and they moved to California as Fix had always wanted to live in a warm climate. Fix and his bride settled in Hollywood, not so much because he had set ideas about becoming an actor but because he didn't know what he wanted to do with the rest of his life. He liked writing and acting in local plays, and soon became friends with the fellow tyro actor Clark Gable, who was his own age. Fix and Gable were discovered by the stage actress Pauline Frederick, who hired them to be members of her touring troupe that traveled by train the length of the West Coast putting on plays. In all, Fix - who had informally renamed himself Paul Peter - appeared in 20 plays with Gable. Paul Fix had one of his earliest acting roles on celluloid in the mid-1920s, appearing in a silent Western starring William S. Hart. The Western genre eventually would become the one he was most identified with. He played uncredited bit parts and small roles in silents before getting his first credited role in an early talkie (which was part-silent and part-talking), The First Kiss (1928), which starred future Hollywood superstar Gary Cooper and the dame that drove King Kong ape, Fay Wray. In all, Fix appeared in 300-400 films. The Western programmers of the silent and early talkie days could be shot in less than a week. In 1925, Taddy gave birth to their daughter Marilyn Carey, who eventually would marry Harry Carey Jr., the son of one of the first great Western superstars. They would have three more children and become part of the extended family gathered around the director John Ford. In his career, Paul Fix would appear with another Western legend, John Wayne, in 26 films, starting in 1931 with Three Girls Lost (1931). Urged on by Loretta Young, Fix became an acting coach for the young actor, and Wayne later paid him back when he became a star by having Fix appear in his movies. (The Duke also was a part of the close-knit group that collected around John Ford). With the Duke's patronage, the kinds of roles that Fix played changed. He had been typed as villains in the 1930s but, in the 40s, he began assaying a better class of character. Paul Fix was also a screenwriter, and is credited as the writer on three films: Tall in the Saddle (1944), Ring of Fear (1954) and The Notorious Mr. Monks (1958). His favorites parts included playing the stricken passenger in the John Wayne picture The High and the Mighty (1954), Elizabeth Taylor's father in George Stevens' classic Giant (1956), the grandfather of the eponymous The Bad Seed (1956) and the judge in To Kill a Mockingbird (1962). His last screen appearance was in the Brooke Shields movie Wanda Nevada (1979), but he is most famous for appearing in the recurring role of \"Marshal Micah Torrance\" in the popular Western TV series The Rifleman (1958). As of 1981, the 80-year old Fix was still getting mail from all over the world from \"Rifleman\" fans. Paul Fix died October 14, 1983 of kidney failure. He was survived by his daughter Marilyn Carey and son-in-law Harry \"Dobe\" Carey, three grandchildren and several great-grandchildren.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODA0OTIzOF5BMl5BanBnXkFtZTcwMTg4MzI4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0280707","name":"Paul Fix","idIMDB":"nm0280707"},"actorId":"nm0280707","character":"Herb Parker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leo Gordon","urlProfile":"http://www.imdb.com/name/nm0330388","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMWE4ZGItNDFkYi00ODY5LWE4ZmYtMDc1OGMzNzdhMTc5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 December 1922","placeOfBirth":" New York City, New York, USA","birthName":"Leo Vincent Gordon","height":"6' 2\" (1.88 m)","bio":"Big, burly, character actor, one of the toughest of screen heavies, Leo Gordon's powerful physique, combined with his deep, menacing voice, was guaranteed to strike fear into the heart of even the bravest screen hero. Director Don Siegel, who used Gordon in his prison film Riot in Cell Block 11 (1954), once said that \"Leo Gordon was the scariest man I have ever met\" - this coming from a man who had directed John Wayne, Clint Eastwood and Bette Midler! Siegel wasn't talking about just Gordon's screen presence. Before becoming an actor (he studied at the American Academy of Dramatic Arts), Gordon served 5 years in San Quentin State Prison for armed robbery. \"Riot in Cell Block 11\" was filmed at Folsom State Prison. The Folsom warden remembered Gordon from his prison stint, when he had a reputation as a troublemaker, and objected to his being in the film, but Siegel was able to convince him that Gordon was no threat to the prison. Contrary to his image, though, Gordon was not just a one-note villain. He did play sympathetic parts on occasion, notably in the western Black Patch (1957)--which he also wrote--and in Roger Corman's civil rights drama The Intruder (1962), and turned in first-rate performances, especially in the latter film. Gordon was also a screenwriter, turning out several screenplays for Corman. He wasn't just limited to writing low-budget sci-fi films, either; he penned the screenplay for the WWII epic Tobruk (1967), writing in a good part for himself as Kruger, a tough sergeant in a platoon of German Jews masquerading as Nazi soldiers to help blow up a German oil storage facility.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMWE4ZGItNDFkYi00ODY5LWE4ZmYtMDc1OGMzNzdhMTc5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0330388","name":"Leo Gordon","idIMDB":"nm0330388"},"actorId":"nm0330388","character":"Chet Huneker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Martin Garralaga","urlProfile":"http://www.imdb.com/name/nm0307986","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjJhYWEyZTAtODQ2Zi00YjlhLTk1YTEtMmIxZDZhZDU1NzVhXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1894","placeOfBirth":" Barcelona, Catalonia, Spain","birthName":"Norman Garralaag","bio":"Martin Garralaga was born on November 10, 1894 in Barcelona, Catalonia, Spain as Norman Garralaag. He was an actor, known for Lonely Are the Brave (1962), For Whom the Bell Tolls (1943) and The Left Handed Gun (1958). He died on June 12, 1981 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjJhYWEyZTAtODQ2Zi00YjlhLTk1YTEtMmIxZDZhZDU1NzVhXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0307986","name":"Martin Garralaga","idIMDB":"nm0307986"},"actorId":"nm0307986","character":"Jesus Cisneros","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mario Siletti","urlProfile":"http://www.imdb.com/name/nm0797974","urlPhoto":"","biography":{"dateOfBirth":"22 July 1903","placeOfBirth":" Turin, Piedmont, Italy","birthName":"Mario Giovanni Siletti","height":"5' 5\" (1.65 m)","bio":"Mario Siletti was born on July 22, 1903 in Turin, Piedmont, Italy as Mario Giovanni Siletti. He was an actor, known for Kansas City Confidential (1952), The House on Telegraph Hill (1951) and The Great Caruso (1951). He died on April 19, 1964 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0797974","name":"Mario Siletti","idIMDB":"nm0797974"},"actorId":"nm0797974","character":"Tony Santoro, the barber","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Horvath","urlProfile":"http://www.imdb.com/name/nm0395731","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZThhMzQwZTAtZGFmNi00MzM3LWJlODktM2Y3M2NjZWZmZTU4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 October 1920","placeOfBirth":" Upper Macungie Township, Pennsylvania, USA","bio":"Began in films as stuntman, eventually becoming one of the top stuntmen in the business. Continued doing stuntwork throughout his acting career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZThhMzQwZTAtZGFmNi00MzM3LWJlODktM2Y3M2NjZWZmZTU4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0395731","name":"Charles Horvath","idIMDB":"nm0395731"},"actorId":"nm0395731","character":"Len Bookman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Schallert","urlProfile":"http://www.imdb.com/name/nm0769974","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5ODQzMTYxOF5BMl5BanBnXkFtZTYwMTc0MDI0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1922","placeOfBirth":" Los Angeles, California, USA","birthName":"William Joseph Schallert","height":"6' 1\" (1.85 m)","bio":"The son of Edwin Schallert, drama editor of the \"Los Angeles Times\" and the dean of West Coast critics, William Schallert became interested in an acting career while at UCLA in 1942. After graduation, he became involved with the Circle Theater (eventually becoming one of its owners) and made his film debut in The Foxes of Harrow (1947). He then became ubiquitous in movies and TV ever since, and from 1979 to 1981, he was president of the Screen Actors Guild. He stayed active with SAG projects and said he never gave retirement a thought.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5ODQzMTYxOF5BMl5BanBnXkFtZTYwMTc0MDI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0769974","name":"William Schallert","nicknames":["Bill"],"idIMDB":"nm0769974"},"actorId":"nm0769974","character":"Jim Shaney","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joseph J. Greene","urlProfile":"http://www.imdb.com/name/nm0338812","urlPhoto":"","biography":{"dateOfBirth":"17 November 1894","placeOfBirth":" Elm City, North Carolina, USA","birthName":"Joseph Johnson Green","bio":"Joseph J. Greene was born on November 17, 1894 in Elm City, North Carolina, USA as Joseph Johnson Green. He was an actor, known for The Devil's Playground (1946), The Baron of Arizona (1950) and Man in the Shadow (1957). He died on February 9, 1979 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0338812","name":"Joseph J. Greene","idIMDB":"nm0338812"},"actorId":"nm0338812","character":"Harry Youngquist","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0050680","urlIMDB":"http://www.imdb.com/title/tt0050680","business":{"budget":{"money":"$600,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$1,530,000 (USA)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1956/\">1956</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 20 min (80 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Black and White"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":["2,196 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["CinemaScope"],"printedFilmFormat":["35 mm"]},"rating":"6.9","filmingLocations":[{"location":"Conejo Valley, Thousand Oaks, California, USA"}],"rated":"APPROVED","awards":[],"votes":"607","type":"Movie","companyCreditsSimple":[{"idCompany":"co0021358","name":"Universal International Pictures (UI)"}],"keywords":{"keywords":["sheriff","ranch","daughter","good versus evil","torture","truck","final showdown","rope","gunfight","shootout","winchester rifle","repeating rifle","double barreled shotgun","revolver","pistol","hero","villain arrested","knocked unconcious","hit on the head","knife","knife attack","fistfight","justice","poetic justice","neo western","neo noir","modern western","forbidden love","unrequited love","blood","violence","four word title","opening action scene","accusation","vigilante","murder investigation","shot in the chest","bludgeoned to death","lingerie","barber","guard dog","father daughter relationship","small town","centerfold","italian american","barber shop","drunken cop","hispanic","identification of body","german shepherd","girlie magazine","town drunk","bunkhouse","mexican american","illegal immigrant","knife in chest","migrant worker","racism","cattle baron","coroner","deception","deceit","cigarette smoking","handcuffs","evidence","blood stain","deputy","eye witness","henchman","held at gunpoint","cattle ranch","rancher","investigation","usa","father","modern west","mexican","murder"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:07:44"}}