{"data":{"movies":[{"title":"Young Sherlock Holmes","originalTitle":"","year":"1985","releaseDate":"19851204","directors":[{"name":"Barry Levinson","id":"nm0001469"}],"writers":[{"name":"Arthur Conan Doyle","id":"nm0236279"},{"name":"Chris Columbus","id":"nm0001060"}],"runtime":"109 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmE0NTQ5ZjItN2MzNC00NjBhLTg0ZjYtYzFiMzFlMjhjNmNiXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Adventure","Fantasy","Mystery","Thriller"],"plot":"Sherlock Holmes and Dr. Watson meet as boys in an English Boarding school. Holmes is known for his deductive ability even as a youth, amazing his classmates with his abilities. When they discover a plot to murder a series of British business men by an Egyptian cult, they move to stop it.","simplePlot":"When assorted people start having inexplicable delusions that lead to their deaths, a teenage Sherlock Holmes decides to investigate.","actors":[{"actorName":"Nicholas Rowe","urlProfile":"http://www.imdb.com/name/nm0746583","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzEzMzZmOTMtYzNjMi00Mzk3LThhMWQtMTk2NTk5MmQ3M2U0L2ltYWdlXkEyXkFqcGdeQXVyNjk5NzA1ODA@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1966","placeOfBirth":" Edinburgh, Scotland, UK","birthName":"Nicholas James Sebastian Rowe","height":"6' 4\" (1.93 m)","bio":"Speaks fluent Spanish and French. Lives in London. Attended Bristol University (BA in Hispanic Studies). Has appeared in numerous British plays and television programs. Most recognized by Americans as Sherlock Holmes in Young Sherlock Holmes (1985). The son of a member of Parliament. Lived with Lou Gish for six years until her death in February, 2006.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzEzMzZmOTMtYzNjMi00Mzk3LThhMWQtMTk2NTk5MmQ3M2U0L2ltYWdlXkEyXkFqcGdeQXVyNjk5NzA1ODA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0746583","name":"Nicholas Rowe","idIMDB":"nm0746583"},"actorId":"nm0746583","character":"Sherlock Holmes","urlCharacter":"http://www.imdb.com/character/ch0026631","main":true},{"actorName":"Alan Cox","urlProfile":"http://www.imdb.com/name/nm0184893","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NDI3NzUxOV5BMl5BanBnXkFtZTYwNDI1ODc4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1970","placeOfBirth":" London, England, UK","bio":"Alan Cox was born on August 6, 1970 in London, England. He is an actor and producer, known for Young Sherlock Holmes (1985), The Dictator (2012) and Mrs Dalloway (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NDI3NzUxOV5BMl5BanBnXkFtZTYwNDI1ODc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0184893","name":"Alan Cox","idIMDB":"nm0184893"},"actorId":"nm0184893","character":"John Watson","urlCharacter":"http://www.imdb.com/character/ch0026702","main":true},{"actorName":"Sophie Ward","urlProfile":"http://www.imdb.com/name/nm0001830","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1NzUwMzE2OF5BMl5BanBnXkFtZTgwOTc4Mzk5MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 December 1964","placeOfBirth":" London, England, UK","height":"5' 8\" (1.73 m)","bio":"Sophie Ward was born on December 30, 1964 in London, England. She is an actress, known for Young Sherlock Holmes (1985), Wuthering Heights (1992) and Jane Eyre (2011). She has been married to Rena Brannan since 2000. She was previously married to Paul Hobson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1NzUwMzE2OF5BMl5BanBnXkFtZTgwOTc4Mzk5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001830","name":"Sophie Ward","idIMDB":"nm0001830"},"actorId":"nm0001830","character":"Elizabeth Hardy","urlCharacter":"http://www.imdb.com/character/ch0029767","main":true},{"actorName":"Anthony Higgins","urlProfile":"http://www.imdb.com/name/nm0001891","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzMjQ5NDM4MzNeQTJeQWpwZ15BbWU3MDg3MDk4MDM@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 May 1947","placeOfBirth":" Northampton, England, UK","height":"6' 2\" (1.88 m)","bio":"Higgins was born May 9, 1947 in East Northamptonshire, England to parents who had emigrated from Ireland just before World War II in search of economic opportunity. His parents lived in London during the Blitz. Eventually, they left London for Northamptonshire so that his father could obtain work as a builder for American army bases. Young Anthony completed his studies at a state school and then intended to be a journalist. He worked as a butcher in Bedford and then as a \"navvy,\" a builder's helper, in the small town of Grendon, near Northampton. At the age of 16, he obtained a job on a local paper but, by law, he had to be over 17 before he could work so he spent the time learning shorthand and typing. Then, a friend took him to a weekend drama course run by the distinguished Shavian actress, Margaretta Scott. She encouraged him to consider a career as an actor. He said, \"It felt right so I decided to pursue it.\" Higgins won a scholarship to the Birmingham School of Speech and Dramatic Arts in 1964 and studied there for three years. He made his first professional appearance at the Birmingham Repertory Theater Company in Shakespeare's \"A Winter's Tale\" as a walk-on while still at school. He then joined the company full time and was assigned principal roles nearly at once. His portrayal of Romeo, opposite Anna Calder-Marshall as Juliet, received rave reviews throughout England. He also played Cassio in \"Othello,\" and Louis Debedat in \"The Doctor's Dilemma.\" He then worked onstage in classics and contemporary plays in Chichester and London. However, it was a theatrical portrayal of Edmund Tyrone in Eugene O'Neill's, \"A Long Day's Journey Into Night\" in Birmingham that led to Higgins' cinema debut for director John Huston under the name, Anthony Corlan, (his mother's maiden name), in \"A Walk with Love and Death\" (1969). The film takes place during Europe's 100 Years War and was shot in Vienna and the Vienna Woods. The film is notable for the debut of Huston's daughter, Angelica. Corlan plays Robert, a nobleman, wearing authentic looking armor. It was Huston who taught him how to ride horses. Higgins rides with style in many subsequent films. Later, he would own a racehorse in Ireland. After appearing in \"A Walk with Love and Death,\" the actor was in several television plays for the BBC, including an original drama, \"The Blood of the Lamb,\" for \"The Wednesday Play\" and \"Mary, Queen of Scots\" for \"Play of the Month.\" He then made two films for television, one an episode of \"Journey to the Unknown\" with Janice Rule, and the other, a segment of \"Strange Report,\" with Anthony Quayle. His next feature film role was in \"Something for Everyone,\" also known as \"The Cook,\" (1970), after auditioning for director Hal Prince and producer John Flaxman in London. This was stage director Prince's first flirtation with film, with a script by Hugh Wheeler, author of \"Sweeney Todd.\" Higgins plays a quiet, sheltered young German royal, Helmuth, with Angela Lansbury as his mother. Helmut is forced into an arranged marriage with Annaliese, played by German actress, Heidelinde Weis. He discovers the darker motives that lurk beneath Michael York's gleaming blonde appearance against brilliant cinematography in the shadow of King Ludwig's Castle, in Neuschwanstein, Germany. In 1972, Higgins acted in \"Vampire Circus\" as a circus performer who changes into a panther-vampire. The film has become a cult classic. It was banned in Britain (because of its bestiality). The actor has said that it is the last of the great vampire films produced under the Hammer banner. There is a badly edited version for sale in the United States; an uncut edition has been seen in Europe that is much clearer. \"Flavia, the Moslem Nun,\" (1974), with Brazilian born Florinda Bolkan, gave Higgins an opportunity to work in Italy. The DVD is a great piece of cinema history rescued by high technology and enhanced by a recent interview with Ms. Bolkan, who became an international screen legend in her own time. The story is derived from actual events in the 1400s that culminated in \"The Martyrdom of the 800\" in Otranto. The exotic soundtrack is by Academy Award winning composer, Nicola Piovani (\"Life is Beautiful\"). If one can get past the explicit physical mutilation of animals and humans and the insults to the Catholic Church, the script can be seen as supportive of feminism. Director Gianfranco Mingozzi's vision is representative of the wild cinema of the sexual revolution of the 70s in which auteurs were bursting to break free from the establishment. \"Flavia\" has haunting performances by Bolkan, Maria Casares, (the princess in Cocteau's \"Orpheus\") and Higgins. He is dazzling as the Moslem commander with no name who initiates Flavia as a sexual being, encourages her to carry out a bloody revenge and then disillusions her. That Higgins does not speak much is of no consequence. He communicates some of his best acting with movements and facial expressions, particularly, with his eyes. He can say volumes with one mesmerizing gaze. The actor flourished on stage, television and screen throughout the 70s. Notably, he starred as a Roman soldier looking for his vanished father in Caledonia, in BBC Scotland's miniseries, \"Eagle of the Ninth\" with Patrick Malahide in 1977. However, Higgins has said that he is most proud to have been a member of the Royal Shakespeare Company's original London cast of \"Piaf,\" a biography of the French singer, Edith Piaf, written by Pam Gems, which starred Jane Lapotaire in 1979. The play was resurrected to rave reviews in London in 1994 but without any of the original players. Higgins won Best Actor of 1979 from Time Out magazine for his work with The Royal Shakespeare Company that year. He acted in mainly new work with the RSC but he also played Lucentio in \"The Taming of the Shrew\" opposite Zoe Wanamaker as his sweet Bianca. Older London stage audiences may discern that among his many stage to television appearances in the 80s was the role of Camille in \"Danton's Death.\" The play by George Buechner ran at the National Theater in London for a year and was then produced for television by the BBC. Zoe Wanamaker played opposite him once more. As the actor matured in his thirties, his persona grew more interesting with more unusual works. Higgins' face is often recognized for his having played the artist in \"The Draughtsman's Contract,\" (1982), opposite the brilliant Shakespearean actress, Janet Suzman. The film is suggestive of classical restoration drama with a mysterious plot, elegant landscape shots of England's County Kent and a Purcell-like soundtrack by Michael Nyman. Director Peter Greenaway has said that he cast Higgins in the lead because he best expressed a combination of arrogance and innocence. Higgins gives a subtle depiction of the outcast, the son of a tenant farmer, who turns out to be too trusting and is tragically deceived. After Draughtsman's initial release, many viewers wondered what the lead actor would do next but Higgins does not generally pursue publicity. Although he appeared at the Edinburgh Festival with the cast, he did not do many interviews. \"Draughtsman\" experienced resurgence in 1994 and the actor's face was plastered on larger than life posters across the high walls of London's underground tube stops. His face has often been well utilized to represent a variety of ethnic origins. It is an oval face with a long thin nose and high, almost oriental cheekbones. It is usually framed by dark, wavy hair, sometimes ending at his collar. His balanced brows can look calm but lying dormant behind his deeply inset, hazel eyes is a prospective fire. Behind the face lies great inventiveness that has not always been allowed to surface but when it does, the effect can be striking. Higgins seems to have unlocked a storeroom of intensity by taking on the role of Stephan, a hard-luck Polish immigrant to 1920s Paris in the Merchant-Ivory film, \"Quartet\" (1981). The film, based on the novel by Jean Rhys, is sharply directed by James Ivory and has a heart-felt script by Ruth Prawer Jhabvala (\"Le Divorce\"). Isabelle Adjani garnered a Cannes Film Festival award for Best Actress for her gut-wrenching performance as Stephan's defenseless wife. Stephan is an impetuous man, who takes the dishonest road to acquiring wealth, with a small amount of shiftiness and a large amount of charm. Higgins infuses the role with detailed mannerisms such as holding his cigarette by cupping the end with his fingers, as many Slavic men do. Higgins' height (6' 2\"), dark looks and air of moral strength have frequently rendered him romantic roles. He sometimes appears to be aloof but a warmth sneaks out. The tough guy who softens for a vulnerable female might be what he is all about. Thus, it seems only natural that an actor whom he greatly admires is Robert Mitchum. Indeed, in another era, Higgins himself might have fit nicely into film noir. Higgins stars in a dark mystery film, \"Sweet Killing,\" (1993), which was filmed in Montreal and also features F. Murray Abraham. Female admiration of Higgins became universal with his winsome portrayal of Abdullah, in \"Lace,\" (1984-5), a cleverly written television miniseries by Elliot Baker, based on the popular English novel by Shirley Conran. Angela Lansbury, Brooke Adams and Arielle Dombasle are outstanding. Most critics condemned Phoebe Cates for her unconvincing acting but unanimously praised Higgins' persuasive performance as an Arabian prince, who is the lynch pin of the plot. The film also captures glamorous scenery of the French Alps, Chamonix and other jet-set locales; it has wonderful women's fashions, particularly hats, by Barbara Lane; it is the ultimate \"chick flick.\" Higgins, astonished to hear that it is frequently repeated on cable in the U.S., has reacted, \"It was great fun to do, actually. It has no pretense to be Strindberg. It is glamorous trash. Still, we had great character actors in it like Anthony Quayle, an old friend, who is now dead; and the director, Billy Hale, and I hit it off in a big way.\" Far from charming in \"Reilly, Ace of Spies,\" (1983), the actor plays a cold Communist assassin in the British miniseries with Sam Neill in the title role; Higgins' innocence seen in previous roles is totally obscured here. In 1986, he acted with Jeanne Moreau in Agatha Christie's mystery, \"The Last Séance,\" for Granada TV. \"Max, Mon Amour,\" a feature film for the daring director Nagisa Oshima (\"Realm of the Senses\") followed in 1986. It has an outrageous plot about a bored wife (Charlotte Rampling) with a chimpanzee as her lover. Higgins plays her British diplomat husband who invites the ape to live with them in Paris. Higgins continued to work in France to play Napoleon's elder brother in \"Napoleon and Josephine,\" with Armand Assante and Jacqueline Bisset in the title roles in 1987. It gave Higgins the opportunity to work again with Jane Lapotaire as mother Bonaparte. After Napoleon cuts up Europe for his family, Joseph satirically delivers a memorable aside, \"Louis gets Holland and all I get is disease-ridden Naples.\" Lavishly photographed in Europe and North Africa, the television miniseries has subtle humor; it airs occasionally on cable in the U.S. A tendency of Higgins' style has been to hold something back, compelling the viewer to wonder what else he has stored up, adding mystery to his character. In \"Darlings of the Gods,\" an Australian television film, (1991), he may have held back a bit much in the lead as Laurence Olivier, opposite Mel Martin as Vivien Leigh, to the disappointment of some critics. Still, the film aired around the world, received good ratings and repeated several times. In spin offs of the Sherlock Holmes legend, Higgins is the only actor besides Orson Welles to have played both Moriarty (\"Young Sherlock Holmes\" 1985) and Holmes (\"Sherlock Holmes Returns\" 1993). Both works display his skills in fencing and oration of long monologues; both versions proved popular in several countries, among them Germany. Higgins is fluent in German. German artist and photographer, Heide Lausen, whom he met while working on \"Something for Everyone\" in Germany, widows him. He has one daughter, who was born in 1974 and raised in Bavaria. He is often recognized for having played a stereotypical Nazi villain in Stephen Spielberg's, \"Raiders of the Lost Ark,\" (1981). However, of the television film, \"One Against the Wind,\" also known as \"Mary Lindell,\" (1991), starring Judy Davis, Higgins has said that he enjoyed playing a non-typical German SS officer, who had been classically educated in England, because it was not a hackneyed image. \"The Bridge,\" (1992), based on the Whitbread award winning novel by Maggie Hemingway, is an engaging film that takes place in the 19th century with actress Saskia Reeves struggling against sociological constraints. Here, his power simmers rather than explodes, as he plays a husband, who makes a shrewd move to eliminate his wife's lover. In a scene with his daughters at the breakfast table, one can sense that his character might do anything to prevent his family from breaking apart. A family role that Higgins took on enthusiastically was that of Johann Strauss, Sr. in \"The Strauss Dynasty,\" (1991). The award winning television miniseries, which was filmed in Austria and Hungary over eight months, contains a cast of hundreds. The scope covers the entire Strauss family and the music and politics of their time. The twelve-hour program aired successfully in Europe and Australia in the 90s. The actor shows great range in this role, growing from young adored \"Waltz King\" conductor of Vienna to world weary, exhausted composer. The series shines with many international stars, enlightening history and music by the Strausses. Higgins grew up in a large musical and creative family of five brothers and one sister in Northamptonshire. Before Higgins was born, his father sang with a band in Cork in the 1930s. His mother was the local church organist and would sometimes accompany him on piano. Later, his father went to New York and studied opera but he returned to Ireland after six years. Anthony plays flugelhorn; he had an instrument especially crafted for him in Germany. He has said that his mother taught him to read even before he went to school. He is a voracious reader; he writes, having used an old manual typewriter prior to the computer era. He also has a penchant for classical music, jazz and fine art; when in New York, he likes to visit the Frick Museum and the Pierpont Morgan Library. He has always had a passion for athletics, having played rugby in his youth, then cricket and now it is golf. The actor's search for cutting-edge productions led him to \"Nostradamus\" (1994), an eccentric version of the 16th century visionary filmed in Romania. Tcheky Karyo plays the title role and Higgins brings up the ranks as King Henry II of France. Diana Quick (Higgins' mistress in \"Max, Mon Amour\") plays Diane de Poitier alongside Amanda Plummer as his quirky queen, Catherine de Medici. Higgins plays Henry as extremely effective politically and a great athlete. Higgins' research found that jousting was his other great love as evidenced from the time, effort and money that went into his armor, which is embossed with exquisite scenes from classical history and still exists as an extraordinary artifact. One of Higgins' best moments onscreen is as Korah, a Hebrew in \"Moses\" (1996), a television miniseries that aired internationally with Ben Kingsley in the title role. After initial skepticism, Korah silently communicates religious rapture as manna slowly falls from heaven on his ecstatic face, revealing a believer in the end. In the middle 1990s, it seems that there was a chic rush for heterosexual male stars to play roles as HIV-stricken patients, i.e., witness Jeremy Irons in \"Stealing Beauty.\" Higgins brings an understated dignity to the role of a Cuban choreographer in the AIDS-related film, \"Alive and Kicking,\" also known as \"Indian Summer\" (1996). The film stars Jason Flemyng as his student and has a hopeful conclusion by author Martin Sherman (\"Bent\"). Higgins returned to the stage in November 1996 with the title role in \"Max Klapper - A Life in Pictures.\" He received excellent notices as a post WWII German film director opposite Emily Lloyd as the actress whom he regards as his creation. The event marked the reopening as a live theater of the Electric Cinema in London, where, curiously, during WWII the theater's manager was suspected of sending messages to German Zeppelins from the roof. Higgins fervently plays Marcel, a Hungarian archaeologist in the Irish feature film, \"The Fifth Province,\" (1997), with Ian Richardson, with whom he previously appeared in \"Danton's Death\" on British television. Higgins has been particularly commended for the scene where he digs furiously for treasure that was buried by the high kings of Ireland. The script is by the Irish Times-Aer Lingus prize winning, hilarious novelist, Nina Fitzpatrick (Fables of the Irish Intelligentsia). The film sometimes surfaces on Sky TV. In the late 90s, Higgins continued to appear on British television in various roles and slipped into the snakeskins of seriously degenerated criminals in the television crime dramas, \"The Governor I,\" \"Supply and Demand I,\" and \"Trial and Retribution III\" (now available on DVD in Region 2). All were written by Lynda LaPlante (\"Prime Suspect\"), who was, coincidentally, an extra in \"The Draughtsman's Contract.\" However, the actor becomes orderly again in 2001, as he plays a talent agent of dubious trust in \"The Last Minute,\" directed by Stephen Norrington (\"League of Extraordinary Gentlemen\"). The theme is the unworthiness of fame in trendy London. The hero, labeled as \"the next big thing,\" rebels against the agent and descends into hell before finding out how to value his life. One key to understanding Higgins' personality might be to recognize that his true love is the horn. In 2000, he commissioned British trumpeter Guy Barker, (\"Great Expectations\" 1998), to write a jazz soundtrack for a short film that Higgins wrote and directed, starring himself and British actress, Frances Barber, \"Blood Count.\" It has been playing at European Film Festivals. In March 2003, Higgins lent his deep, but mellifluous, voice to narrate \"Sounds in Black and White,\" Barker's homage concert to film noir, with the 60 piece London Metropolitan Orchestra at the Barbican Theater in London. In 2004, American television viewers can look forward to seeing him in an \"Inspector Lynley Series II\" episode on PBS' \"Mystery Theater.\" A large part of Higgins' charisma is due to his voice, mannerisms and unique style that remain unruffled as he ages. He is not on the celebrity A list, the B list or even the Z list but he is high on many viewers' lists of interesting actors to watch because of his magnetism, intensity and unpredictability. The first decade of the new millennium has presented several new interesting British actors on the screen. However, many do not seem to have a strong classical stage training, which is Higgins' rock, and they often throw their lines away. Although not all of his roles have grandeur, people invariably comment about Higgins what he has said of Robert Mitchum, \"Even in terrible movies, he is always good.\" Higgins' light may have reached millions of viewers but he never sold out for money. Some have called him a \"career actor\" but he has yet to receive the recognition of which his talent is worthy. Where is he? He is building a legacy as a character actor. Film history will show that he is a noteworthy one.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzMjQ5NDM4MzNeQTJeQWpwZ15BbWU3MDg3MDk4MDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001891","name":"Anthony Higgins","idIMDB":"nm0001891"},"actorId":"nm0001891","character":"Professor Rathe","urlCharacter":"http://www.imdb.com/character/ch0027269","main":true},{"actorName":"Susan Fleetwood","urlProfile":"http://www.imdb.com/name/nm0281453","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3Njg0NjM2OV5BMl5BanBnXkFtZTcwMDgxOTgwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 September 1944","placeOfBirth":" St. Andrews, Scotland, UK","birthName":"Susan Maureen Fleetwood","bio":"Susan Fleetwood was born on September 21, 1944 in St. Andrews, Scotland as Susan Maureen Fleetwood. She was an actress, known for Sacrifice (1986), Clash of the Titans (1981) and Young Sherlock Holmes (1985). She died on September 29, 1995 in Salisbury, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3Njg0NjM2OV5BMl5BanBnXkFtZTcwMDgxOTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0281453","name":"Susan Fleetwood","idIMDB":"nm0281453"},"actorId":"nm0281453","character":"Mrs. Dribb","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Freddie Jones","urlProfile":"http://www.imdb.com/name/nm0428086","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNjc3MTQxOF5BMl5BanBnXkFtZTcwMjU2ODgwMw@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1927","placeOfBirth":" Stoke-on-Trent, Staffordshire, England, UK","birthName":"Frederick Charles Jones","height":"6' 1\" (1.85 m)","bio":"The British character actor Freddie Jones came to the acting profession after 10 years of working as a laboratory assistant and acting in amateur theater on the side. To kick off his mid-life career change, Jones attended Rose Bruford College of Speech and Drama in Kent, England, on a scholarship. He then worked in repertory theater, later joining up with the Royal Shakespeare Company and gaining recognition as an actor of exceptional cleverness, intelligence and perception. His theatrical film debut came in 1967 in Peter Brook's critically acclaimed, Marat/Sade (1967). Two years later, Jones made his mark on the acting world playing \"Claudius\" in the six-part television miniseries, The Caesars (1968). Based on this performance, he was named \"The World's Best Television Actor of the Year\" at the Monte-Carlo TV Festival in 1969. Also, around this time, Jones gave one of his most touching film performances, that of the \"monster\" in Frankenstein Must Be Destroyed (1969), in which he displayed pathos reminiscent of Boris Karloff's monster. Critical acclaim led Jones to more prominent roles in television, e.g., The Ghosts of Motley Hall (1976), Children of the Stones (1977), and Pennies from Heaven (1978), as well as in film, e.g., The Man Who Haunted Himself (1970), Antony and Cleopatra (1972), All Creatures Great and Small (1975) and Zulu Dawn (1979). Jones achieved international recognition as a film actor after appearing in such Hollywood films as Clint Eastwood's Firefox (1982) and David Lynch's The Elephant Man (1980), Dune (1984) and Wild at Heart (1990). Arguably one of his most endearing roles was the frequently drunk reporter \"Orlando\" in Federico Fellini's And the Ship Sails On (1983). His theatrical acting has been especially well-suited for literary drama, e.g., Far from the Madding Crowd (1967), Nicholas Nickleby (1977), Silas Marner (1985), Screen One: Adam Bede (1992), David Copperfield (2000) and The Count of Monte Cristo (2002). Jones' eccentric, twitchy portrayals, often bordering on caricature, although sometimes criticized, have nevertheless ensured his international recognition and popularity as a character actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNjc3MTQxOF5BMl5BanBnXkFtZTcwMjU2ODgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0428086","name":"Freddie Jones","idIMDB":"nm0428086"},"actorId":"nm0428086","character":"Chester Cragwitch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nigel Stock","urlProfile":"http://www.imdb.com/name/nm0830740","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NzU3NjM1OV5BMl5BanBnXkFtZTcwNDAyOTgwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 September 1919","placeOfBirth":" Malta","birthName":"Nigel Hector Munro Stock","bio":"A veteran of stage, screen, radio and TV, character actor Nigel Stock was born in Malta in 1919, the son of Captain W.H. Stock, RE, and his wife Margaret Marion Munro. In British India from childhood, he and his sister Angela returned to the UK in his early teens for schooling. Nigel was educated at St. Paul's School and studied for the stage at the Royal Academy of Dramatic Art, where he earned the Leverhulme Exhibition, Northcliffe Scholarship, and the Principal's Medal. He made his debut stage appearance at the Savoy Theatre in 1931, at the age of 12, in a production of \"The Traveller in the Dark\". He continued to rack up a number of classical and contemporary credits at various distinguished theaters, including the Old Vic, with productions of \"The Winter's Tale\", \"Macbeth\" (playing Macduff), \"Tobacco Road\" and \"Goodbye, Mr. Chips\". Stock interrupted his thriving career by serving in the Army from 1939 to 1941 with the London Irish Rifles, and with the Assam Regiment, Indian Army between 1941 and 1945 in Burma, China and Kohima. He was honorably discharged with the rank of Major. He returned to the stage in 1946 with \"And No Birds Sing\" and made his first appearance on the New York stage as \"Philip\" in \"You Never Can Tell\" in 1948. A reliable player who lent distinction to every aspect of the theatrical repertoire, from William Shakespeare through Anton Chekhov to modern farce, he impressed in \"She Stoops to Conquer\", \"The Caine Mutiny Court Martial\", \"Altona\", \"Uncle Vanya\" and \"Sleuth\", among others. An imposing, often bearded presence, he started off in films as a teenager in Lancashire Luck (1937), later appearing in such popular British releases as Brighton Rock (1947), The Dam Busters (1955), Damn the Defiant! (1962), The Lost Continent (1968), The Lion in Winter (1968), Cromwell (1970) and Russian Roulette (1975), often appearing in villainous roles. Interestingly, one of his last performances was a character part in the Steven Spielberg production of Young Sherlock Holmes (1985). Between 1964-1968, Stock made a household name for himself playing Dr. Watson\" in Sherlock Holmes (1964). He had a devout interest in ornithology. Stock's third wife was actress Richenda Carey. They appeared together on stage in the world premiere of \"Mumbo Jumbo\" from May 8-May 31, 1986. Less than a month later, Stock died on June 23rd of a heart attack. He was survived by four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NzU3NjM1OV5BMl5BanBnXkFtZTcwNDAyOTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0830740","name":"Nigel Stock","idIMDB":"nm0830740"},"actorId":"nm0830740","character":"Rupert T. Waxflatter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roger Ashton-Griffiths","urlProfile":"http://www.imdb.com/name/nm0004355","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NzIwMjAzMV5BMl5BanBnXkFtZTcwMDAzMjIzMQ@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1957","placeOfBirth":" Hertfordshire, England, UK","height":"5' 10\" (1.78 m)","bio":"Dual Canadian/British nationalities. Read Music at Lancaster University (1975-78) before joining English National Opera as singer (1979-81). Theatre credits subsequently include Gloucester (King Lear) at Colchester, Judge Turpin (Sweeney Todd) at Liverpool and Watford, Algol (Space Queen Maladjusta) at Southampton, Angelo (Archangels Don't Play Pinball) at Bristol. Married BBC studio manager Sharmini Thillaimuthu. Two children. Lives in London and Suffolk.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NzIwMjAzMV5BMl5BanBnXkFtZTcwMDAzMjIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004355","name":"Roger Ashton-Griffiths","idIMDB":"nm0004355"},"actorId":"nm0004355","character":"Det. Sgt. Lestrade","urlCharacter":"http://www.imdb.com/character/ch0035944","main":true},{"actorName":"Earl Rhodes","urlProfile":"http://www.imdb.com/name/nm0722419","urlPhoto":"","biography":{"bio":"Earl Rhodes is an actor, known for Young Sherlock Holmes (1985), The Sailor Who Fell from Grace with the Sea (1976) and The Medusa Touch (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0722419","name":"Earl Rhodes","idIMDB":"nm0722419"},"actorId":"nm0722419","character":"Dudley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Oulton","urlProfile":"http://www.imdb.com/name/nm0653580","urlPhoto":"","biography":{"dateOfBirth":"11 February 1908","placeOfBirth":" Liverpool, England, UK","bio":"Brian Oulton was born on February 11, 1908 in Liverpool, England. He was an actor, known for Young Sherlock Holmes (1985), Gandhi (1982) and The Kiss of the Vampire (1963). He was married to Peggy Thorpe-Bates. He died on April 13, 1992 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0653580","name":"Brian Oulton","idIMDB":"nm0653580"},"actorId":"nm0653580","character":"Master Snelgrove","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick Newell","urlProfile":"http://www.imdb.com/name/nm0627822","urlPhoto":"","biography":{"dateOfBirth":"27 March 1932","placeOfBirth":" Hadleigh, Suffolk, England, UK","height":"6' (1.83 m)","bio":"Patrick Newell was born on March 27, 1932 in Hadleigh, Suffolk, England. He was an actor, known for Young Sherlock Holmes (1985), The Avengers (1961) and Sherlock Holmes and Doctor Watson (1980). He was married to Derina Newell. He died on July 22, 1988 in Essex, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0627822","name":"Patrick Newell","idIMDB":"nm0627822"},"actorId":"nm0627822","character":"Bentley Bobster","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Donald Eccles","urlProfile":"http://www.imdb.com/name/nm0248324","urlPhoto":"","biography":{"dateOfBirth":"26 April 1908","placeOfBirth":" Nafferton, East Yorkshire, England, UK","birthName":"Donald Yarrow Eccles","bio":"Donald Eccles was born on April 26, 1908 in Nafferton, East Yorkshire, England as Donald Yarrow Eccles. He was an actor, known for The Wicker Man (1973), Young Sherlock Holmes (1985) and The Dresser (1983). He died on February 2, 1986 in Brighton, East Sussex, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0248324","name":"Donald Eccles","idIMDB":"nm0248324"},"actorId":"nm0248324","character":"The Reverend Duncan Nesbitt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matthew Ryan","urlProfile":"http://www.imdb.com/name/nm0752719","urlPhoto":"","biography":{"bio":"Matthew Ryan is an actor, known for Young Sherlock Holmes (1985), A Handful of Dust (1988) and Savior (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0752719","name":"Matthew Ryan","idIMDB":"nm0752719"},"actorId":"nm0752719","character":"Dudley's Friend","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matthew Blakstad","urlProfile":"http://www.imdb.com/name/nm0086873","urlPhoto":"","biography":{"dateOfBirth":"13 July 1967","placeOfBirth":" Hammersmith, London, England, UK","birthName":"Paul Matthew Bjorn Blakstad","bio":"Matthew Blakstad was born on July 13, 1967 in Hammersmith, London, England as Paul Matthew Bjorn Blakstad. He is an actor, known for Young Sherlock Holmes (1985), Enemies of the State (1983) and The Chain (1984).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0086873","name":"Matthew Blakstad","idIMDB":"nm0086873"},"actorId":"nm0086873","character":"Dudley's Friend","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jonathan Lacey","urlProfile":"http://www.imdb.com/name/nm0479933","urlPhoto":"","biography":{"bio":"Jonathan Lacey is an actor, known for The Baby of Mâcon (1993), Young Sherlock Holmes (1985) and The Shooting Party (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0479933","name":"Jonathan Lacey","idIMDB":"nm0479933"},"actorId":"nm0479933","character":"Dudley's Friend","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0090357","urlIMDB":"http://www.imdb.com/title/tt0090357","business":{"budget":{"money":"$18,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$2,538,000","country":"USA","day":"08","month":"12","year":"1985","remarks":"920 Screens"}],"gross":[{"money":"SEK","country":"4,138,376","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 49 min (109 min)"],"soundMix":["70 mm 6-Track (70 mm prints)","Dolby (35 mm prints)"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["70 mm (blow-up)","35 mm"]},"rating":"6.8","filmingLocations":[{"location":"Radcliffe Square, Oxford, Oxfordshire, England, UK"}],"rated":"PG-13","awards":[{"award":"Academy Awards, USA 1986","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Effects, Visual Effects","names":[{"name":"Dennis Muren","id":"nm0613830","role":null},{"name":"Kit West","id":"nm0922187","role":null},{"name":"John Ellis","id":"nm1290751","role":null},{"name":"David Allen","id":"nm0020406","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1986","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Music","names":[{"name":"Bruce Broughton","id":"nm0005976","role":null}]}]},{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Fantasy Film","names":[]},{"category":"Best Writing","names":[{"name":"Chris Columbus","id":"nm0001060","role":null}]}]}]},{"award":"Young Artist Awards 1987","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Exceptional Feature Film - Family Entertainment - Fantasy or Comedy","names":[]}]}]}],"votes":"15,549","type":"Movie","companyCreditsSimple":[{"idCompany":"co0009119","name":"Amblin Entertainment"},{"idCompany":"co0072491","name":"Industrial Light & Magic (ILM)"},{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["sherlock holmes","cult","delusion","death","girl","boy","graveyard","solution","school","hallucination","murder","boarding school","younger version of character","adolescent girl","teenage girl","adolescent boy","teenage boy","trail","friend","clue","conclusion","deduction","fright","fear","scare","grief","fighting","fight","evil","danger","surprise","love","boy with glasses","man with glasses","swashbuckler","self sacrifice","evil man","villain","rapier","good versus evil","horse and carriage","pipe smoking","pagan","warrior","cult figure","cult hero","cult film","glider","violence","police detective","chase","flintlock pistol","private eye","fire","torch","damsel in distress","blonde","rescue","death of girlfriend","boyfriend girlfriend relationship","kiss","stick fight","disarming someone","monster","suicide","murder mystery","ambush","teenager fighting adult","teenage hero","two man army","opening action scene","kidnapping","swordsman","sword","sword duel","duel","buddy movie","buddy cop","action hero","hero","interrupted sacrifice","scene after end credits","breaking the fourth wall","family relationships","teenager","student","private detective","murder investigation","investigation","home alone","friendship","coming of age","amateur","adolescent","19th century","teenage detective","warehouse","pyramid","london england","winter","snow","funeral","cemetery","flying machine","dog","sword fight","fencing","chess","1870s","stop motion animation","tavern","blow pipe","steampunk","stained glass window","detective","victorian era","amateur detective","egyptology","surprise after end credits","origin of hero","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:46:10"}}