{"data":{"movies":[{"title":"The Cockleshell Heroes","originalTitle":"","year":"1955","releaseDate":"19560327","directors":[{"name":"José Ferrer","id":"nm0001207"}],"writers":[{"name":"Bryan Forbes","id":"nm0285302"},{"name":"Richard Maibaum","id":"nm0537363"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDE3ODgyYzAtYTVjMi00NDdhLTlkYjYtZDBhMDk1MmQ2YWQzXkEyXkFqcGdeQXVyMjU5OTg5NDc@._V1.jpg","countries":["UK","USA"],"languages":["English","French","German"],"genres":["Action","War","Drama"],"plot":"A Royal Marine Reserve Major must work with a veteran Captain and a group of incorrigible recruits to attempt what is generally regarded as a suicide mission: the covert destruction of an entire German shipyard in occupied France.","simplePlot":"During WW2, German ships are \"safely\" docked upriver at Bordeaux, but the British send a team of kayakers to attack them.","actors":[{"actorName":"José Ferrer","urlProfile":"http://www.imdb.com/name/nm0001207","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwODAwMzM0M15BMl5BanBnXkFtZTYwNjc1MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 January 1912","placeOfBirth":" Santurce, Puerto Rico","birthName":"José Vicente Ferrer de Otero y Cintrón","height":"5' 10\" (1.78 m)","bio":"José Ferrer was born on January 8, 1912 in Santurce, Puerto Rico as José Vicente Ferrer de Otero y Cintrón. He was an actor, known for Lawrence of Arabia (1962), Dune (1984) and The Caine Mutiny (1954). He was married to Stella Daphne Magee, Rosemary Clooney, Phyllis Hill and Uta Hagen. He died on January 26, 1992 in Coral Gables, Florida, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwODAwMzM0M15BMl5BanBnXkFtZTYwNjc1MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001207","name":"José Ferrer","nicknames":["Joe"],"idIMDB":"nm0001207"},"actorId":"nm0001207","character":"Major Geoffrey Stringer","urlCharacter":"http://www.imdb.com/character/ch0175690","main":true},{"actorName":"Trevor Howard","urlProfile":"http://www.imdb.com/name/nm0002145","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDAyOTQxN15BMl5BanBnXkFtZTYwNzg1MjI2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1913","placeOfBirth":" Cliftonville, Kent, England, UK","birthName":"Trevor Wallace Howard-Smith","height":"5' 11½\" (1.82 m)","bio":"The son of an insurance underwriter, who represented Lloyd's of London in Ceylon, Trevor Wallace Howard-Smith was born in Margate, Kent. He spent his early childhood globetrotting with his mother, frequently left in the care of strangers. After attending private school, he subsequently trained at RADA (due to his mother's insistence), and was voted best in his class following a performance in \"Much Ado About Nothing\". Spurning a contract with Paramount, he acted on the West End stage and with the Shakespeare Memorial Theatre in Stratford-upon-Avon from the mid-1930's, performing in classical plays ranging from \"Hamlet\" and \"Coriolanus\" to \"French without Tears\", by Terence Rattigan. Howard was initially turned down for military service by both the RAF and the British Army, but shortage of manpower led to his being called up in 1940 to serve as a second lieutenant with the Army Signal Corps. However, he neither saw action nor accumulated the illustrious wartime record (including winning the Military Cross) invented for him by his publicists. A 2001 biography by Terence Pettigrew claimed to have unearthed files from his war record, suggesting that he was dismissed from service in 1943 due to 'mental instability'. Ironically, on screen, the actor was often cast as solid, unflappable British officers, perhaps reflecting his own personal credo of always feeling best when impersonating someone else. Howard's career in films began quietly, with small roles in The Way Ahead (1944) and Johnny in the Clouds (1945). He unexpectedly leapt to stardom in just his third outing, as the stoic, decent Dr. Alec Harvey in David Lean's melancholic story of middle-class wartime romance, Brief Encounter (1945). Howard's mannered performance perfectly suited the required stiff-upper-lip mood of the film, his intensity and projected integrity more than compensating for his average looks. That 'jolly decent chap' persona continued on in another 'woman's picture', The Passionate Friends (1949), but Howard soon found his niche in more determined, worldly roles. He later admitted that \"for years I was practically hounded by my first part in Brief Encounter. I loved the film, mind you, but the role wasn't me, at all\" (Ottawa Citizen, February 17 1961). As a screen actor, Howard came of age in crime thrillers and war films, delivering his first genuine tour de force performance as a battle-hardened, cynical ex-pilot caught up in the world of post-war black market racketeering in I Became a Criminal (1947). His efficient, by-the-book intelligence officer, Major Calloway, in Carol Reed's The Third Man (1949) put him firmly on the map as a star character player. Rasping-voiced and becoming increasingly craggy as the years went by, Howard contrasted archetypal authoritarians (seasoned army veteran Captain Thomson of The Cockleshell Heroes (1955), Captain William Bligh in the remake of Mutiny on the Bounty (1962), Lord Cardigan in The Charge of the Light Brigade (1968)) with weaklings (best exemplified by morally corrupt, degenerate expatriate trader Peter Willems in Outcast of the Islands (1951) -- arguably one of Howard's finest performances); sympathetic victims (colonial cop Scobie, tormented by religious guilt in The Heart of the Matter (1953)) and obsessive, driven eccentrics (crusading elephant preservationist Morel in The Roots of Heaven (1958), the alcoholic, haunted Sir Henry at Rawlinson End (1980), and the weird Russian recluse of Light Years Away (1981)). In the midst of angst-ridden heroes, drunken clerics and assorted historical characters, ranging from Napoleon Bonaparte to Sir Isaac Newton, Howard even essayed a Cheyenne warrior returning from the dead to defend his family in Windwalker (1980). Remarkably, among a score of rather forgettable projects Howard lent his name to, it is difficult to fault a single one of his performances. Throughout his entire career, he was never out of favour with audiences and never out of work. As becoming one of the most British of actors, Howard was an ardent cricket supporter, member of the prestigious Marylebone Cricket Club. He insisted on having a clause inserted in his contracts which allowed him leave from filming to attend test matches. A rather solitary man, he had few other hobbies (except, perhaps, a fondness for alcohol, which likely contributed to his death at the age of 74) and was reputedly modest about his accomplishments as an actor. He once declared \"we don't have the Method School of acting in England. We simply read the script, let it seep in, then go put on whiskers - and do it\" (New York Times, January 8 1988).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDAyOTQxN15BMl5BanBnXkFtZTYwNzg1MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002145","name":"Trevor Howard","idIMDB":"nm0002145"},"actorId":"nm0002145","character":"Captain Hugh Thompson","urlCharacter":"http://www.imdb.com/character/ch0175691","main":true},{"actorName":"Dora Bryan","urlProfile":"http://www.imdb.com/name/nm0116932","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4OTg5OTY4NV5BMl5BanBnXkFtZTgwODQwMDgyMjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1923","placeOfBirth":" Parbold, Lancashire, England, UK","birthName":"Dora May Broadbent","height":"5' 3\" (1.6 m)","bio":"Dora Bryan was born on February 7, 1923 in Parbold, Lancashire, England as Dora May Broadbent. She was an actress, known for A Taste of Honey (1961), Mirrormask (2005) and Apartment Zero (1988). She was married to Bill Lawton. She died on July 23, 2014 in Hove, East Sussex, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4OTg5OTY4NV5BMl5BanBnXkFtZTgwODQwMDgyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0116932","name":"Dora Bryan","idIMDB":"nm0116932"},"actorId":"nm0116932","character":"Myrtle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victor Maddern","urlProfile":"http://www.imdb.com/name/nm0534658","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NjQxODUxN15BMl5BanBnXkFtZTgwMDM5NzUyMTI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 March 1926","placeOfBirth":" Seven Kings, Ilford, Essex, England, UK","birthName":"Victor Jack Maddern","bio":"Victor Maddern was born on March 16, 1926 in Seven Kings, Ilford, Essex, England as Victor Jack Maddern. He was an actor, known for Chitty Chitty Bang Bang (1968), Exodus (1960) and Steptoe and Son (1972). He was married to Joan Neuville. He died on June 22, 1993 in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NjQxODUxN15BMl5BanBnXkFtZTgwMDM5NzUyMTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0534658","name":"Victor Maddern","idIMDB":"nm0534658"},"actorId":"nm0534658","character":"Marine Sgt. Craig","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anthony Newley","urlProfile":"http://www.imdb.com/name/nm0627969","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNjY0ODg0Ml5BMl5BanBnXkFtZTYwNDk0NjU2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 September 1931","placeOfBirth":" Hackney, London, England, UK","birthName":"George Anthony Newley","height":"5' 9\" (1.75 m)","bio":"Anthony Newley was born in Hackney, London, England, to Frances Grace Newley and George Kirby, a shipping clerk. He was attracted to acting, after seeing an ad for a child actor in a Fleet Street window. He attended the Italia Conti Stage School from the age of 14 and, two years later, played the Artful Dodger in David Lean's film, Oliver Twist (1948). Newley was called up to the Army for his National Service and, by the late 1950s, had a hit song Idol on Parade (1959), while in the movie of the same name. He married his first wife, Tiller Girl Ann Lynn in 1956 but it was a rocky marriage and they divorced in 1963. He was in the pop charts seven times in 1960, twice at Number One with \"Why?\" and \"Do You Mind?\" written by Lionel Bart. In 1961, he collaborated with Leslie Bricusse on the hit stage show, Stop the World: I Want to Get Off (1966). After long runs in London and on Broadway, it was made into a film, starring Millicent Martin, with the hit song \"What Kind of Fool Am I?\". In 1963, he married Rank starlet Joan Collins. She described him at the time as \"A half-Jewish Cockney git\" and herself as a \"half-Jewish princess from Bayswater via Sunset Boulevard\". Newley's film career thrived, most notably with acting roles in Doctor Dolittle (1967) and The Cockleshell Heroes (1955), and as a writer and composer. His partnership with Bricusse continued with \"The Roar of the Greasepaint: The Smell of the Crowd\" and many other Oscar, Grammy and Ivor Novello award-winning collaborations. They had hit songs such as \"The Candy Man\" and \"Goldfinger\". His marriage to Joan Collins broke up in 1971. He had two of his four children with her. Tony was married a third time, to former air hostess Dareth Rich, only to divorce again. He once said \"My only regret is that, in a show business career, you can have no private life\". Alone and facing a battle against cancer, Newley moved in with his mother Gracie - now in her 90s - at her home in Esher, Surrey. The stage performances continued but were nothing to match his heyday. His last TV appearance was in \"The Lakes\" in February 1999. Anthony Newley died in April of that year.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNjY0ODg0Ml5BMl5BanBnXkFtZTYwNDk0NjU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0627969","name":"Anthony Newley","nicknames":["Tony"],"idIMDB":"nm0627969"},"actorId":"nm0627969","character":"Marine Clarke","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Lodge","urlProfile":"http://www.imdb.com/name/nm0517084","urlPhoto":"","biography":{"dateOfBirth":"19 August 1921","placeOfBirth":" Rochester, Kent, England, UK","birthName":"David William Frederick Lodge","height":"6' (1.83 m)","bio":"David Lodge was born on August 19, 1921 in Rochester, Kent, England as David William Frederick Lodge. He was an actor, known for The Return of the Pink Panther (1975), A Shot in the Dark (1964) and Two Way Stretch (1960). He was married to Marilyn Garcia. He died on October 18, 2003 in Denville Hall, Northwood, Hillingdon, London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0517084","name":"David Lodge","idIMDB":"nm0517084"},"actorId":"nm0517084","character":"Marine Ruddock","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Arne","urlProfile":"http://www.imdb.com/name/nm0036170","urlPhoto":"","biography":{"dateOfBirth":"29 September 1920","placeOfBirth":" Kuala Lumpur, Malaya [now Malaysia]","birthName":"Peter Randolph Albrecht","bio":"Peter Arne was for a short time the perfect villain in British film. After a couple of roles in war movies (The Purple Plain (1954) and The Cockleshell Heroes (1955)) and a Tarzan movie (Tarzan and the Lost Safari (1957)) he became a villain in Strangers' Meeting (1957). From than on he continued to play sinister types in The Moonraker (1958), Intent to Kill (1958), Breakout (1959), Conspiracy of Hearts (1960), The Hellfire Club (1961) and The Secret of Monte Cristo (1961). He was very convincing as a Cromwell officer, an Italian camp commander or a Nazi officer. Several times he had sword fights as a devious count. In 1962 he was a pirate sidekick of Christopher Lee in The Pirates of Blood River (1962), but a new kid on the block by the name of Oliver Reed challenged him and killed him halfway through the picture. It seemed like a symbolic fight because for a while Oliver Reed played the roles in Hammer Pictures that Peter Arne could have played and Arne moved to TV roles. His days as a leading actor were over and he continued work in TV and in bit parts in features. Sometimes directors he worked with before brought him back for a little role. In 1972 he got a nice break with \"The Stallion\", a TV movie in which he starred with a horse. He was also in a couple of Blake Edwards movies. He became an antique dealer with his sister as a sideline. He was murdered at the age of 63 shortly after being cast in Doctor Who (1963).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0036170","name":"Peter Arne","idIMDB":"nm0036170"},"actorId":"nm0036170","character":"Marine Corporal Stevens","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Percy Herbert","urlProfile":"http://www.imdb.com/name/nm0378612","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTAyODE5NjA4OV5BMl5BanBnXkFtZTcwNzgwMDExOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1920","placeOfBirth":" London, England, UK","height":"6' (1.83 m)","bio":"The massive brooding face and nose of British actor Percy Herbert is familiar to movie goers and TV audiences alike. A seemingly unlikely stage discovery by no one less than the great Dame Sybil Thorndike of British theater, Herbert moved into movie roles by the early 1950s. Initially fitting in as a featured cockney character, he nevertheless moved on to a wide variety of roles, especially as British and American soldier characters, some notable early ones being in The Bridge on the River Kwai (1957) and The Guns of Navarone (1961). An interesting coincidence was that his character name was Grogan in both movies - though he was promoted from a private in the first movie to a sergeant in the second. He always seemed at home, lending a believable accent and memorable presence to such as: the menacing baron who joins in the killing of Archbishop Thomas Becket, Richard Burton, in Becket (1964), the hapless Confederate soldier-with a broad southern accent of Mysterious Island (1961), the sensible Scots-American deputy Mac Gregor in TV's short-lived Cimarron Strip (1968) with Stuart Whitman. In the course of over 90 film appearances, Herbert fitted in and lent to genres from fantasy and horror to history and drama with a sort of sturdy and matter-of-fact competence which makes him a most memorable big and small screen presence.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTAyODE5NjA4OV5BMl5BanBnXkFtZTcwNzgwMDExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0378612","name":"Percy Herbert","idIMDB":"nm0378612"},"actorId":"nm0378612","character":"Marine Lomas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Graham Stewart","urlProfile":"http://www.imdb.com/name/nm0829406","urlPhoto":"","biography":{"dateOfBirth":"5 September 1927","placeOfBirth":" Bridge of Earn, Perth and Kinross, Scotland, UK","bio":"Graham trained at RADA and moved into the production side of film and television in the 1960s. He was responsible for bringing the popular BBC series, Dr. Finlay's Casebook (1962) to television.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0829406","name":"Graham Stewart","idIMDB":"nm0829406"},"actorId":"nm0829406","character":"Marine Booth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Fabian","urlProfile":"http://www.imdb.com/name/nm0264563","urlPhoto":"","biography":{"dateOfBirth":"19 May 1927","placeOfBirth":" Wolverhampton, England, UK","bio":"John Fabian was born on May 19, 1927 in Wolverhampton, England. He is known for his work on A Town Like Alice (1956), First Man Into Space (1959) and The Cockleshell Heroes (1955). He died on April 11, 2012 in the UK.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0264563","name":"John Fabian","idIMDB":"nm0264563"},"actorId":"nm0264563","character":"Marine Cooney","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Van Eyssen","urlProfile":"http://www.imdb.com/name/nm0886881","urlPhoto":"","biography":{"dateOfBirth":"19 March 1922","placeOfBirth":" Fauresmith, South Africa","birthName":"Matthew John D. Van Eyssen","bio":"John van Eyssen (1922-1995) John van Eyssen wore several hats during his long professional career -- including that of Shakespearean thespian, movie actor, literary agent, producer and studio executive. Born and raised in South Africa, van Eyssen did not come to Great Britain until after WW II. Once in London, he studied drama at the Central School of Speech and Drama and, before graduation, joined the Royal Shakespeare Company. At the RSC, van Eyssen performed the major classical leads and also played Cassio in Orson Welles' production of Othello. As Lucifer in the York Cycle of Mystery Plays, van Eyssen inspired Dame Judi Dench, a teenager at the time, to pursue a career in acting. From there, van Eyssen branched out into radio, television and, beginning with The Angel with the Trumpet (1950), films, and went on to appear in a number of British movies of the period including Joseph Losey's Blind Date, Cockleshell Heroes and Carlton Browne of the F.O. In 1958, he appeared as Jonathan Harker in Hammer Films' cult classic, The Horror of Dracula. Van Eyssen abandoned acting in 1961 to become a literary agent for London Management. He proved to have a knack for the job and was quickly promoted to helm the literary department. He became so important that, when the company merged with London Artists, he was in charge of handling Franco Zeffirelli, Tennessee Williams, and Arthur Miller. Van Eyssen left the management business in 1965 to work at Columbia Pictures' UK division. Two years after his hiring, van Eyssen became the UK studio's Managing Director and was behind some of the studio's most popular British films, including Romeo and Juliet, To Sir With Love (1967), Born Free (1966), Georgy Girl (1966), Oliver! and A Man For All Seasons (1969). In 1969, he was promoted to Worldwide Head of Production (ex-US) and moved to New York. He left the studio in 1974 to work as an independent producer, and in 1981, produced Sidney Lumet's Daniel. Van Eyssen returned to England in 1991 and became an instrumental part of establishing Britain's premiere showcase for talented young filmmakers, the Chelsea Film Festival.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0886881","name":"John Van Eyssen","idIMDB":"nm0886881"},"actorId":"nm0886881","character":"Marine Bradley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Desmond","urlProfile":"http://www.imdb.com/name/nm0221476","urlPhoto":"","biography":{"dateOfBirth":"1928","placeOfBirth":" London, England, UK","bio":"Robert Desmond was born in 1928 in London, England. He was an actor, known for The Great Escape (1963), Compact (1962) and The Best of Enemies (1961). He died in 2002 in Putney, London.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0221476","name":"Robert Desmond","idIMDB":"nm0221476"},"actorId":"nm0221476","character":"Marine Todd","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Walter Fitzgerald","urlProfile":"http://www.imdb.com/name/nm0280406","urlPhoto":"","biography":{"dateOfBirth":"18 May 1896","placeOfBirth":" Keyhan, Derby, England, UK","birthName":"Walter Bond","bio":"Walter Fitzgerald was born on May 18, 1896 in Keyhan, Derby, England as Walter Bond. He was an actor, known for Treasure Island (1950), The Fallen Idol (1948) and Darby O'Gill and the Little People (1959). He was married to Angela Kirk and Rosalie Constance Grey. He died on December 20, 1976 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0280406","name":"Walter Fitzgerald","idIMDB":"nm0280406"},"actorId":"nm0280406","character":"Gestapo Commandant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karel Stepanek","urlProfile":"http://www.imdb.com/name/nm0826749","urlPhoto":"","biography":{"dateOfBirth":"29 October 1899","placeOfBirth":" Brünn, Austria-Hungary [now Brno, Czech Republic]","bio":"Though born in Czechoslovakia, actor Karel Stepanek was generally regarded as a German actor due to his extensive film work in Germany (as Karl Stepanek) in the years before World War II. Stepanek fled to England in 1940, where, like many European refugee actors, he specialized in portraying Teutonic villains. He tried to stay away from out-and-out Nazi roles, but his predilection for wearing black uniforms and barking out guttural commands left little doubt as to the political preferences of Stepanek's screen characters. One of his most typical characterizations could be found in the 1946 POW drama, The Captive Heart; Stepanek also registered well as a friendlier foreigner in The Fallen Idol (1949). Commuting between London and Hollywood, Karel Stepanek continued to fight World War II, usually on the wrong side, into such '60s films as Sink the Bismarck! (1960), I Aim at the Stars (1960) and Operation Crossbow (1965).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0826749","name":"Karel Stepanek","idIMDB":"nm0826749"},"actorId":"nm0826749","character":"Assistant Gestapo Officer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Beatrice Campbell","urlProfile":"http://www.imdb.com/name/nm0132224","urlPhoto":"","biography":{"dateOfBirth":"31 July 1922","placeOfBirth":" County Down, Northern Ireland, UK","birthName":"Beatrice Josephine Campbell","bio":"Beatrice Campbell was born on July 31, 1922 in County Down, Northern Ireland as Beatrice Josephine Campbell. She was an actress, known for Last Holiday (1950), The Master of Ballantrae (1953) and The Mudlark (1950). She was married to Nigel Patrick and Robert MacClancy. She died on May 10, 1979 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0132224","name":"Beatrice Campbell","idIMDB":"nm0132224"},"actorId":"nm0132224","character":"Mrs. Ruddock","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0049083","urlIMDB":"http://www.imdb.com/title/tt0049083","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"COPYRIGHT BY WARWICK FILM PRODUCTIONS LIMITED MDCCCCLIV (on print)"},"technical":{"runtime":["1 hr 37 min (97 min)","1 hr 37 min (97 min) (USA)"],"soundMix":["4-Track Stereo (Western Electric Recording)"],"color":["Color (Colour by) (Technicolor)"],"aspectRatio":["2.55 : 1 (CinemaScope) (magnetic stereo prints)","2.35 : 1 (optical prints)"],"camera":null,"laboratory":["Technicolor (colour by)"],"filmLength":["(11 reels)","2,656.02 m (UK)"],"negativeFormat":["35 mm"],"cinematographicProcess":["CinemaScope (uncredited)"],"printedFilmFormat":["35 mm"]},"rating":"6.6","filmingLocations":[{"location":"Portugal"}],"rated":"APPROVED","awards":[],"votes":"1,245","type":"Movie","companyCreditsSimple":[{"idCompany":"co0103268","name":"Warwick Film Productions"}],"keywords":{"keywords":["bordeaux","major","royal marines","river","submarine","limpet mine","mission","british","portsmouth","military officer","death of hero","canal lock","exploding ship","canal","execution","firing squad","shot in the back","shot to death","frogman","sten gun","dog","captured by enemy","knocked unconscious","policeman","depth charge","barroom brawl","pub brawl","pub","submachine gun","crashing through a window","fistfight","lodger","cheating wife","absent without leave","bomb","firing range","explosion","explosive","grappling hook","canoe","jumping off a bridge onto a moving train","jumping onto a train","jumping a train","train ticket","train","milk bottle","jogging","military uniform","nazi uniform","mission briefing","commando mission","secret mission","interview","harbor","bicycle","truck","hitchhiking","sergeant","cow dung","parachute caught in a tree","parachute","parachute drop","nazi occupation","behind enemy lines","military base","volunteer","military","british soldier","british army","directed by star","prologue","three word title","nazi occupied france","kriegsmarine","british military","elite team","dangerous mission","u boat","military training","army life","commando","world war two","based on true story"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:21:46"}}