{"data":{"movies":[{"title":"9½ Weeks","originalTitle":"Nine 1/2 Weeks","year":"1986","releaseDate":"19860221","directors":[{"name":"Adrian Lyne","id":"nm0001490"}],"writers":[{"name":"Elizabeth McNeill","id":"nm0573946"},{"name":"Patricia Louisianna Knop","id":"nm0461341"}],"runtime":"117 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NDY1NjA4MV5BMl5BanBnXkFtZTYwMzU0Mzk4._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Drama","Romance"],"plot":"An erotic story about a woman, the assistant of an art gallery, who gets involved in an impersonal affair with a man. She barely knows about his life, only about the sex games they play, so the relationship begins to get complicated.","simplePlot":"A woman gets involved in an impersonal affair with a man. She barely knows about his life, only about the sex games they play, so the relationship begins to get complicated.","actors":[{"actorName":"Mickey Rourke","urlProfile":"http://www.imdb.com/name/nm0000620","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MzYwNDA2MF5BMl5BanBnXkFtZTcwNDYzMjg4Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1952","placeOfBirth":" Schenectady, New York, USA","birthName":"Philip Andre Rourke Jr.","height":"5' 11\" (1.8 m)","bio":"Mickey Rourke was born Phillip Andre Rourke, Jr. on September 16, 1952, in Schenectady, New York, the son of Annette (Cameron) and Phillip Andre Rourke. His father was of Irish and German descent, and his mother was of French-Canadian, English, and German ancestry. When he was six years old, his parents divorced. A year later, his mother married Eugene Addis, a Miami Beach police officer, and moved to Miami Shores, Florida. After graduating from Horace Mann Junior High School, Rourke's family moved to a house located on 47th Street and Prairie Avenue in Miami Beach. In 1969 Rourke attended Miami Beach Senior High School, where he played second-string first baseman under coach Skip Berkman. He also acted in a school play, \"The Serpent,\" directed by legendary \"Teacher To The Stars\" Jay W. Jensen. In 1971 he graduated from Miami Beach Senior High School, and after working for a short time as a bus boy at the famed Forge Restaurant on Miami Beach, Rourke moved back to New York to seek out a career in acting. Rourke's teenage years were more aimed toward sports more than acting. He took up self-defense training at the Boys Club of Miami. It was there he learned boxing skills and decided on an amateur career. At the age of 12, Rourke won his first boxing match as an 118-pound bantamweight, defeating Javier Villanueva. Some of his early matches were fought as Andre Rourke. He continued his boxing training at the famed 5th Street Gym in Miami Beach,soon joining the Police Athletic League boxing program. In 1969 Rourke, now weighing 140 pounds, sparred with former World Welterweight champion Luis Rodriguez. Rodriguez was the number one-rated middleweight boxer in the world and was training for his match with world champion Nino Benvenuti. Rourke claims to have received a concussion in this sparring match. In 1971, at the Florida Golden Gloves, Rourke received another concussion from a boxing match. Doctors told him to take a year off and rest. In 1972 Rourke knocked out Ron Robinson in 18 seconds and John Carver in 39 seconds. On Aug. 20, 1973, Rourke knocked out 'Sherman \"Big Train\"' Bergman' in 31 seconds. Shortly after, Rourke decided to retire from amateur boxing. From 1964 to 1973, Rourke compiled an amateur boxing record of 27 wins (17 by knockout) and 3 defeats. At one point, he reportedly scored 12 consecutive first-round knockouts. As an amateur, Rourke had been friendly with pro-boxer Tommy Torino. When Rourke decided to return to boxing as a professional in 1991, Torino promoted some of Rourke's fights. Rourke was trained by former pro-boxer Freddie Roach at Miami Beach's 5th Street Gym and the Outlaw Boxing Club Gym in Los Angeles. He made $250 for his pro debut, but by the end of his second year of boxing, he had earned a million dollars. In June 1994, Rourke appeared on the cover of World Boxing Magazine. He sparred with world champions James Toney, John David Jackson, and Tommy Morrison. Rourke wished to have 16 professional fights and then fight for a world title. However, he retired in 1994 after eight bouts and never got his desired title fight. His boxing career resulted in severe facial injuries that required a number of operations to repair his damaged face. Rourke went back to acting but worked in relative obscurity until he won a Golden Globe Award for his role as Randy \"The Ram\" Robinson in The Wrestler (2008). He was nominated for Best Actor, as well, but lost.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MzYwNDA2MF5BMl5BanBnXkFtZTcwNDYzMjg4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000620","name":"Mickey Rourke","idIMDB":"nm0000620"},"actorId":"nm0000620","character":"John","urlCharacter":"http://www.imdb.com/character/ch0078365","main":true},{"actorName":"Kim Basinger","urlProfile":"http://www.imdb.com/name/nm0000107","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDkxNjcxNV5BMl5BanBnXkFtZTcwODMyNzgyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 December 1953","placeOfBirth":" Athens, Georgia, USA","birthName":"Kimila Ann Basinger","height":"5' 7\" (1.7 m)","bio":"Kim Basinger was born December 8, 1953, in Athens, Georgia, the third of five children. Both her parents had been in entertainment, her dad had played big-band jazz, and her mother had performed water ballet in several Esther Williams movies. Kim was introspective, from her father's side. As a schoolgirl, she was very shy. To help her overcome this, her parents had Kim study ballet from an early age. By the time she reached sweet sixteen, the once-shy Kim entered the Athens Junior Miss contest. From there, she went on to win the Junior Miss Georgia title and traveled to New York to compete in the national Junior Miss pageant. Kim, who had blossomed to a 5' 7\" beauty, was offered a contract on the spot with the Ford Modeling Agency. At the age of 20, Kim was a top model, commanding $1,000 a day. Throughout the early 1970s, she appeared on dozens of magazine covers and in hundreds of ads, most notably as the Breck girl. Kim took acting classes at the Neighborhood Playhouse, performed in various Greenwich Village clubs, and sang under the stage name Chelsea. Kim moved to Los Angeles in 1976, ready to conquer Hollywood. Kim broke into television doing episodes of such hit series as Charlie's Angels (1976). In 1980, she married Ron Snyder (they divorced in 1989). In movies, she had roles like being a Bond girl in Never Say Never Again (1983) and playing a small-town Texas beauty in Nadine (1987). Her breakout role was as photojournalist Vicki Vale in the blockbuster hit Batman (1989). There was no long-orchestrated campaign on her part to snag this plumb role, Kim was a last-minute replacement for Sean Young. This took her to a career high. With perhaps too much disposable income, Kim headed up an investment group that purchased the entire town of Braselton, in her native Georgia, for $20 million (she would later have to sell it). In 1993, Kim married Alec Baldwin, and in 1995 they had a daughter, Ireland Eliesse. Kim took some time off to stay at home with her child. Kim, who loves animals and is a strict vegetarian, devoted energy to animal rights issues and PETA (People for the Ethical Treatment of Animals), even posing for some ads. In 1997, Kim gave an Oscar-winning performance in the film noir classic L.A. Confidential (1997). Kim's salary for I Dreamed of Africa (2000) was $5,000,000, putting her firmly in the category of big-name movie star. And no doubt there are still many great things ahead, in the career of cover girl turned Oscar-winning actress Kim Basinger.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMDkxNjcxNV5BMl5BanBnXkFtZTcwODMyNzgyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000107","name":"Kim Basinger","idIMDB":"nm0000107"},"actorId":"nm0000107","character":"Elizabeth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Margaret Whitton","urlProfile":"http://www.imdb.com/name/nm0926592","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NDU4MzcyMl5BMl5BanBnXkFtZTcwMTc1Njc1OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1949","placeOfBirth":" Meade, Maryland, USA","birthName":"Margaret Ann Whitton","height":"5' 4\" (1.63 m)","bio":"Actress Margaret Whitton came from the New York stage, performing in off-Broadway gems \"Baba Goya\" (1973) and \"Nourish the Beast\" (1973). She made her Broadway debut in \"Steaming\" (1982). She impressed in films as well, effectively cast as sexy and strong supporting characters in such movies as the prison drama Love Child (1982), the football dramedy The Best of Times (1986) with Robin Williams and Kurt Russell, and especially her breakout role in The Secret of My Succe$s (1987) in which she nearly stole the movie right from under Michael J. Fox as his hard-as-nails aunt-by-marriage. She complimented her success with a hilarious role as the widow-cum-baseball-team owner Rachel Phelps in Major League (1989) and its sequel and as the resilient mother to young Nick Stahl in Mel Gibson's directorial debut The Man Without a Face (1993). Margaret has worked on television, appearing in the soap operas One Life to Live (1968) and The Doctors (1963). Her career includes memorable roles, in A Fine Romance (1989) in which she starred as a bickering wife opposite the late Christopher Cazenove and the soap-opera spoof Good & Evil (1991), where she played against type as the \"good girl\" opposite the more wicked-minded Teri Garr. In made-for-television movies she is best known for her portrayal of the tough-as-nails attorney Leslie Abramson in Menendez: A Killing in Beverly Hills (1994). She has more recently appeared on Broadway in \"And the Apple Doesn't Fall...\" (1995) and the original, award-winning musical \"Marlene\" (1999), the story of legendary Marlene Dietrich that starred Siân Phillips. She has also made a name for herself as a theater director. Her directing credits include Marina Carr's \"Portia Coughlin\" (1996) and \"By the Bog of Cats\" (1998), and The Public Theater's production of \"Dirty Tricks\" (2004), starring Judith Ivey as Martha Mitchell. Margaret is the President of independent film producer Tashtego Films, and has directed her first feature film, A Bird of the Air (2011), starring Rachel Nichols and Jackson Hurst.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NDU4MzcyMl5BMl5BanBnXkFtZTcwMTc1Njc1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0926592","name":"Margaret Whitton","idIMDB":"nm0926592"},"actorId":"nm0926592","character":"Molly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Margulies","urlProfile":"http://www.imdb.com/name/nm0546868","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NjE0MjA0Ml5BMl5BanBnXkFtZTYwMzQxMDc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 February 1937","placeOfBirth":" New York City, New York, USA","birthName":"David Joseph Margulies","height":"5' 2½\" (1.59 m)","bio":"David Margulies was born on February 19, 1937 in New York City, New York, USA as David Joseph Margulies. He was an actor, known for Ghostbusters (1984), Ace Ventura: Pet Detective (1994) and Ghostbusters II (1989). He was married to Carol Grant. He died on January 11, 2016 in New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3NjE0MjA0Ml5BMl5BanBnXkFtZTYwMzQxMDc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0546868","name":"David Margulies","idIMDB":"nm0546868"},"actorId":"nm0546868","character":"Harvey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christine Baranski","urlProfile":"http://www.imdb.com/name/nm0004724","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTYwMDUyM15BMl5BanBnXkFtZTcwNTk1MzQxMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 May 1952","placeOfBirth":" Buffalo, New York, USA","birthName":"Christine Jane Baranski","height":"5' 8½\" (1.74 m)","bio":"Christine Baranski was born on May 2, 1952 in Buffalo, New York, USA as Christine Jane Baranski. She is an actress, known for The Good Wife (2009), How the Grinch Stole Christmas (2000) and Cybill (1995). She was previously married to Matthew Cowles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTYwMDUyM15BMl5BanBnXkFtZTcwNTk1MzQxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004724","name":"Christine Baranski","idIMDB":"nm0004724"},"actorId":"nm0004724","character":"Thea","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karen Young","urlProfile":"http://www.imdb.com/name/nm0949744","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwOTE0NTEyN15BMl5BanBnXkFtZTcwMTkxMTIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1958","placeOfBirth":" Pequannock, New Jersey, USA","bio":"Karen Young was born in Pequannock, New Jersey, and educated at Rutgers University. She was the eldest of six children; her mother was a homemaker and her father was a stonemason. After college, she went to New York City to pursue a career in acting and has been a New Yorker ever since. One of her first successes was in the original theatrical production of \"A Lie of the Mind\", written and directed by Sam Shepard. She has consistently worked in film, most recently starring opposite Charlotte Rampling in the French production Heading South (2005), which was directed by the esteemed Laurent Cantet in both Haiti and the Dominican Republic. TV viewers can also see her as FBI Agent Robyn Sanseverino in the HBO series The Sopranos (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwOTE0NTEyN15BMl5BanBnXkFtZTcwMTkxMTIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0949744","name":"Karen Young","idIMDB":"nm0949744"},"actorId":"nm0949744","character":"Sue","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William De Acutis","urlProfile":"http://www.imdb.com/name/nm0206846","urlPhoto":"","biography":{"dateOfBirth":"17 September 1957","placeOfBirth":" Fairfield, Connecticut, USA","birthName":"William David De Acutis","bio":"William De Acutis was born on September 17, 1957 in Fairfield, Connecticut, USA as William David De Acutis. He was an actor, known for 9½ Weeks (1986), Other People's Money (1991) and Vampire's Kiss (1988). He died on May 5, 1991 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0206846","name":"William De Acutis","idIMDB":"nm0206846"},"actorId":"nm0206846","character":"Ted","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dwight Weist","urlProfile":"http://www.imdb.com/name/nm0919327","urlPhoto":"","biography":{"dateOfBirth":"16 January 1910","placeOfBirth":" Palo Alto, California, USA","bio":"Dwight Weist was born on January 16, 1910 in Palo Alto, California, USA. He is known for his work on Search for Tomorrow (1951), I Never Forget a Face (1956) and The Future Is Now (1955). He was married to Elizabeth Maxwell. He died on July 16, 1991 in Block Island, Rhode Island, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0919327","name":"Dwight Weist","nicknames":["\"The Man of a Thousand Voices\""],"idIMDB":"nm0919327"},"actorId":"nm0919327","character":"Farnsworth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roderick Cook","urlProfile":"http://www.imdb.com/name/nm0177260","urlPhoto":"","biography":{"dateOfBirth":"9 February 1932","placeOfBirth":" London, England, UK","bio":"Roderick Cook was born on February 9, 1932 in London, England. He was an actor, known for Amadeus (1984), One Life to Live (1968) and 9½ Weeks (1986). He died on August 17, 1990 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0177260","name":"Roderick Cook","idIMDB":"nm0177260"},"actorId":"nm0177260","character":"Sinclair - the Critic","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victor Truro","urlProfile":"http://www.imdb.com/name/nm0874397","urlPhoto":"","biography":{"bio":"Victor Truro is an actor, known for Manhattan (1979), 9½ Weeks (1986) and One Fine Day (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0874397","name":"Victor Truro","idIMDB":"nm0874397"},"actorId":"nm0874397","character":"Gallery Client","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Justine Johnston","urlProfile":"http://www.imdb.com/name/nm0425474","urlPhoto":"","biography":{"dateOfBirth":"13 June 1921","placeOfBirth":" Evanston, Illinois, USA","bio":"Justine Johnston was born on June 13, 1921 in Evanston, Illinois, USA. She was an actress, known for Fatal Attraction (1987), 9½ Weeks (1986) and Arthur (1981). She died on January 13, 2006 in West Hollywood, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0425474","name":"Justine Johnston","nicknames":["The Lady with the Hat"],"idIMDB":"nm0425474"},"actorId":"nm0425474","character":"Bedding Saleswoman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cintia Cruz","urlProfile":"http://www.imdb.com/name/nm0190282","urlPhoto":"","biography":{"bio":"Cintia Cruz is an actress, known for 9½ Weeks (1986), Alphabet City (1984) and Ringers (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0190282","name":"Cintia Cruz","idIMDB":"nm0190282"},"actorId":"nm0190282","character":"Whore","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kim Chan","urlProfile":"http://www.imdb.com/name/nm0150976","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjY3NjI2Nl5BMl5BanBnXkFtZTcwNDU2MzUzMQ@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1917","placeOfBirth":" Guangdong, China","height":"5' 8\" (1.73 m)","bio":"Born in China, Kim Chan fled China in 1928 with his father Lem and two older sisters. Settling first in Rhode Island, then in New York, Kim left his family after his father caught him lying about an afternoon spent at the cinema. Faced with an ultimatum, Kim left for years as a day laborer, occasionally homeless, frequently sleeping on vermin-infested ironing boards. Yet when he was not laboring in laundries and restaurants, Kim Chan sought work as an actor in film, television, and the theater. Many roles were small, often reflecting racial stereotypes - casting as a Japanese soldier was common in the 1940s. Chan's big break came only in 1983 with his comedic turn as Jonno, the butler to the late night talk show host Jerry Langford (Jerry Lewis) in Martin Scorsese's _The King of Comedy (1983)_. Since then he has appeared in numerous roles, seemingly never wanting for work.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjY3NjI2Nl5BMl5BanBnXkFtZTcwNDU2MzUzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0150976","name":"Kim Chan","idIMDB":"nm0150976"},"actorId":"nm0150976","character":"Chinatown Butcher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lee Lai Sing","urlProfile":"http://www.imdb.com/name/nm0801860","urlPhoto":"","biography":{"bio":"Lee Lai Sing is an actor, known for 9½ Weeks (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0801860","name":"Lee Lai Sing","idIMDB":"nm0801860"},"actorId":"nm0801860","character":"Angry Chinese Customer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rudolph Willrich","urlProfile":"http://www.imdb.com/name/nm0932607","urlPhoto":"","biography":{"bio":"Rudolph Willrich is an actor, known for All My Children (1970), General Hospital (1963) and Another World (1964).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0932607","name":"Rudolph Willrich","idIMDB":"nm0932607"},"actorId":"nm0932607","character":"Chinatown Shopper","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0091635","urlIMDB":"http://www.imdb.com/title/tt0091635","business":{"budget":{"money":"$17,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$328,804","country":"USA","day":"23","month":"02","year":"1986","remarks":"28 Screens"}],"gross":[{"money":"$5,317,870","country":"USA","day":"11","month":"05","year":"1986","remarks":""},{"money":"$5,072,422","country":"USA","day":"04","month":"05","year":"1986","remarks":""},{"money":"$4,724,275","country":"USA","day":"27","month":"04","year":"1986","remarks":""},{"money":"$4,298,936","country":"USA","day":"20","month":"04","year":"1986","remarks":""},{"money":"$3,806,889","country":"USA","day":"13","month":"04","year":"1986","remarks":""},{"money":"$3,316,534","country":"USA","day":"06","month":"04","year":"1986","remarks":""},{"money":"$2,996,014","country":"USA","day":"03","month":"04","year":"1986","remarks":""},{"money":"$2,607,080","country":"USA","day":"27","month":"03","year":"1986","remarks":""},{"money":"$1,870,770","country":"USA","day":"20","month":"03","year":"1986","remarks":""},{"money":"$1,031,688","country":"USA","day":"09","month":"03","year":"1986","remarks":""},{"money":"$692,473","country":"USA","day":"02","month":"03","year":"1986","remarks":""},{"money":"$328,804","country":"USA","day":"23","month":"02","year":"1986","remarks":""},{"money":"AUD","country":"1,055,380","day":null,"month":null,"year":null,"remarks":null},{"money":"SEK","country":"4,473,833","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$137,066","country":"USA","day":"11","month":"05","year":"1986","remarks":"129 Screens"},{"money":"$217,452","country":"USA","day":"04","month":"05","year":"1986","remarks":"198 Screens"},{"money":"$267,532","country":"USA","day":"27","month":"04","year":"1986","remarks":"216 Screens"},{"money":"$348,666","country":"USA","day":"20","month":"04","year":"1986","remarks":"237 Screens"},{"money":"$361,151","country":"USA","day":"13","month":"04","year":"1986","remarks":"194 Screens"},{"money":"$320,520","country":"USA","day":"06","month":"04","year":"1986","remarks":"193 Screens"},{"money":"$388,934","country":"USA","day":"03","month":"04","year":"1986","remarks":"173 Screens"},{"money":"$736,310","country":"USA","day":"27","month":"03","year":"1986","remarks":"250 Screens"},{"money":"$723,937","country":"USA","day":"20","month":"03","year":"1986","remarks":"192 Screens"},{"money":"$248,064","country":"USA","day":"09","month":"03","year":"1986","remarks":"41 Screens"},{"money":"$237,882","country":"USA","day":"02","month":"03","year":"1986","remarks":"28 Screens"},{"money":"$328,804","country":"USA","day":"23","month":"02","year":"1986","remarks":"28 Screens"}],"admissions":[],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"07","month":"06","year":"1984","remarks":null},{"money":null,"country":null,"day":"12","month":"08","year":"1984","remarks":null}],"copyrightHolder":"1986 Producers Sales Organization"},"technical":{"runtime":["1 hr 57 min (117 min)","1 hr 42 min (102 min) (Argentina)","1 hr 52 min (112 min) (DVD)"],"soundMix":["Dolby"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Metrocolor (prints)","Technicolor (color)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.9","metascore":"50","filmingLocations":[{"location":"Delancey Street South, Manhattan, New York City, New York, USA"}],"rated":"R","awards":[{"award":"Razzie Awards 1987","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Actress","names":[{"name":"Kim Basinger","id":"nm0000107","role":null}]},{"category":"Worst Screenplay","names":[{"name":"Patricia Louisianna Knop","id":"nm0461341","role":null},{"name":"Zalman King","id":"nm0455394","role":null},{"name":"Sarah Kernochan","id":"nm0449576","role":null}]},{"category":"Worst Original Song","names":[{"name":"Jonathan Elias","id":"nm0253486","role":null},{"name":"John Taylor","id":"nm0852616","role":null},{"name":"Michael Des Barres","id":"nm0220735","role":null}]}]}]}],"votes":"30,901","type":"Movie","companyCreditsSimple":[{"idCompany":"co0279836","name":"Producers Sales Organization (PSO)"},{"idCompany":"co0074577","name":"Jonesfilm"},{"idCompany":"co0023734","name":"Galactic Films"}],"keywords":{"keywords":["sex game","sex in public","male dominance","control","blindfolded woman","blindfolded","food play","dating","sexual desire","dominance","boyfriend girlfriend relationship","erotica","self destructiveness","obsession","new york city","sexual attraction","sexual awakening","seduction","masochist","sexuality","woman","friend","art gallery","watching television","american flag","female dressed as male","fake mustache","watch as a gift","snooping","stealing a necklace","cherry","breasts","famous song","woman crawling on the floor","sex in the rain","pet cat","sex scene","erotic thriller","sex on the floor","copulation","coitus","scantily clad female","1980s","man removes woman's shoes","female stockinged legs","female stockinged feet","camera shot of feet","pantyhose","stockings","leg spreading","sex standing up","sex in bed","female rear nudity","girl in panties","white panties","no panties","nipples visible through clothing","female removes her dress","female removes her clothes","female frontal nudity","cleavage","fatal attraction","brooklyn new york city","watching pornography","wristwatch","wine","whip","unsubtitled foreign language","underwear","uncle","trampoline","toy chicken that lays egg","threesome","telephone call","tearing off panties","taxi","striptease","street musician","soho manhattan new york city","slip the undergarment","slide projector","scarf","saleslady","sadist","s&m","roommate","restaurant","reference to billie holiday","possessiveness","possession","porno theater","pleasure","pier","personal ad","pay phone","party","panties","painter","office","mother daughter relationship","montage","massage","lust","lingerie","leather store","infatuation","illness","hypnosis","husband wife relationship","houseboat","holiday inn","heart attack","handcuffs","gay slur","gay bashing","friendship","ferris wheel","feeding someone","father daughter relationship","eating","drinking","dog collar","divorcee","dinner","dancing","dancer","cooking","coney island brooklyn new york city","computer","clothing","cigar smoking","chinatown manhattan new york city","children","chicken","chelsea hotel manhattan new york city","cat","cafe","business executive","brushing hair","boy","belt","bar","wall street manhattan new york city","manhattan new york city","controversy","fraction in title","cult film","urban setting","swinger","ex lover","crawling","wind up toy","watering plant","wassily chair","straw hat","riding crop","red hat","red dress","picket fence","persian cat","black cat","woman hitting man","woman dressed as man","white gloves","white dog","white cat","whispering","telescope","switchblade","strawberry","spoon hanging on face","shoplifting","shawl","rubber duck","reggae band","red pepper","orange juicer","olive","lily","knitting","juggler","japaleno pepper","honey","hitting a taxi","gold watch","gift","gelatin","football","fluted wine glass","fire escape","fasting","fake moustache","drawbridge","daisy","coughing","cough syrup","clockwork","chastity belt","cauliflower","can opener","baby bonnet","arbitrage","female nudity","obsessive love","rough sex","art dealer","wood","tree","pain","leaf","chase","blonde","masturbation","yelling","water","violence","telephone","running","rose","rain","plant","photograph","pepper","night","money","milk","mexican","knife","kiss","ice cube","hugging","hat","forest","food","flower","fish","fight","eyeglasses","ex husband ex wife relationship","drink","cup","closet","boat","bird","bed","beard","balloon","mirror","sadomasochism","spiral staircase","artist","revolving door","female masturbation","based on book","based on novel","number in title","egg slicer","cat with rat","flatulence"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 01:47:31"}}