{"data":{"movies":[{"title":"La course vers le pôle","originalTitle":"Cook & Peary: The Race to the Pole","year":"1983","releaseDate":"19831213","directors":[{"name":"Robert Day","id":"nm0206560"}],"writers":[{"name":"I.C. Rapoport","id":"nm0710787"}],"runtime":"100 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmMwMzk3NGYtMzQ2ZC00YTk1LTljOTktZTMyNmJiZDM3ZDQzXkEyXkFqcGdeQXVyMzU0NzkwMDg@._V1.jpg","countries":["Canada","USA"],"languages":["English"],"genres":["Adventure","Drama","History"],"simplePlot":"","actors":[{"actorName":"Richard Chamberlain","urlProfile":"http://www.imdb.com/name/nm0000328","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NTczMjI5Nl5BMl5BanBnXkFtZTcwMzcwNTMwNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1934","placeOfBirth":" Beverly Hills, Los Angeles, California, USA","birthName":"George Richard Chamberlain","height":"6' 1\" (1.85 m)","bio":"Richard Chamberlain became THE leading heartthrob of early 1960s TV. As the impeccably handsome Dr. Kildare, the slim, butter-haired hunk with the near-perfect Ivy-League charm and smooth, intelligent demeanor, had the distaff fans fawning unwavering over him throughout the series' run. While this would appear to be a dream situation for any new star, to Chamberlain it brought about a major, unsettling identity crisis. Born George Richard Chamberlain in Beverly Hills on March 31, 1934, he was the second son of Elsa Winnifred (von Benzon) (1902-1993) and Charles Axiom Chamberlain (1902-1984), a salesman. He has English and German ancestry. Richard experienced a profoundly unhappy childhood and did not enjoy school at all, making up for it somewhat by excelling in track and becoming a four-year letterman in high school and college. He also developed a strong interest and enjoyment in acting while attending Pomona College. Losing an initial chance to sign up with Paramount Pictures, the studio later renewed interest. Complications arose when he was drafted into the Army on December 7, 1956 for 16 months, serving in Korea. Chamberlain headed for Hollywood soon after his discharge and, in just a couple of years, worked up a decent resumé with a number of visible guest spots on such popular series as Gunsmoke (1955) and Mr. Lucky (1959). But it was the stardom of the medical series Dr. Kildare (1961) that garnered overnight female worship and he became a huge sweater-vested pin-up favorite. It also sparked a brief, modest singing career for the actor. The attention Richard received was phenomenal. True to his \"Prince Charming\" type, he advanced into typically bland, soap-styled leads on film befitting said image, but crossover stardom proved to be elusive. The vehicles he appeared in, Twilight of Honor (1963) with Joey Heatherton and Joy in the Morning (1965) opposite Yvette Mimieux, did not bring him the screen fame foreseen. The public obviously saw the actor as nothing more than a TV commodity. More interested in a reputation as a serious actor, Chamberlain took a huge risk and turned his back on Hollywood, devoting himself to the stage. In 1966 alone he appeared in such legit productions as \"The Philadelphia Story\" and \"Private Lives,\" and also showed off his vocal talents playing Tony in \"West Side Story\". In December of that year a musical version of \"Breakfast at Tiffany's\" starring Richard and Mary Tyler Moore in the sparkling George Peppard/Audrey Hepburn roles was headed for Broadway. It flopped badly in previews, however, and closed after only four performances. Even today it is still deemed one of Broadway's biggest musical disasters. An important dramatic role in director Richard Lester's Petulia (1968) led Richard to England, where he stayed and dared to test his acting prowess on the classical stage. With it, his personal satisfaction over image and career improved. Bravura performances as \"Hamlet\" (1969) and \"Richard II\" (1971), as well as his triumph in \"The Lady's Not for Burning\" (1972), won over the not-so-easy-to-impress British audiences. And on the classier film front, he ably portrayed Octavius Caesar opposite Charlton Heston's _Mark Antony_(1970)_ and Jason Robards' Brutus; composer Pyotr Ilyich Tchaikovsky in Ken Russell's grandiose The Music Lovers (1970) opposite Glenda Jackson; and Lord Byron alongside Sarah Miles_ in Lady Caroline Lamb (1972). While none of these three films were critical favorites, they were instrumental in helping to reshape Chamberlain's career as a serious, sturdy and reliable actor. With his new image in place, Richard felt ready to face American audiences again. While he made a triumphant Broadway debut as Reverend Shannon in \"The Night of the Iguana\" (1975), he also enjoyed modest box-office popularity with the action-driven adventure movies The Three Musketeers (1973) as Aramis and a villainous role in The Towering Inferno (1974), and earned cult status for the Aussie film The Last Wave (1977). On the television front, he became a TV idol all over again (on his own terms this time) as the \"King of 80s Mini-Movies\". The epic storytelling of The Count of Monte-Cristo (1975), The Thorn Birds (1983) and Shogun (1980), all of which earned him Emmy nominations, placed Richard solidly on the quality star list. He won Golden Globe awards for his starring roles in the last two miniseries mentioned. In later years the actor devoted a great deal of his time to musical stage tours as Henry Higgins in \"My Fair Lady\", Captain Von Trapp in \"The Sound of Music\" and Ebenezer Scrooge in \"Scrooge: The Musical\". Enormously private and having moved to Hawaii to avoid the Hollywood glare, at age 69 finally \"came out\" with a tell-all biography entitled \"Shattered Love,\" in which he quite candidly discussed the anguish of hiding his homosexuality to protect his enduring matinée idol image. Since then, he has accepted himself and shown to be quite a good sport in the process, appearing as gay characters in the film I Now Pronounce You Chuck & Larry (2007), and in TV episodes of Will & Grace (1998), Desperate Housewives (2004) and Brothers & Sisters (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NTczMjI5Nl5BMl5BanBnXkFtZTcwMzcwNTMwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000328","name":"Richard Chamberlain","idIMDB":"nm0000328"},"actorId":"nm0000328","character":"Frederick Cook","urlCharacter":"http://www.imdb.com/character/ch0044179","main":true},{"actorName":"Rod Steiger","urlProfile":"http://www.imdb.com/name/nm0001768","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NjQ1OTUxNl5BMl5BanBnXkFtZTYwNDA3NjA2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 April 1925","placeOfBirth":" Westhampton, New York, USA","birthName":"Rodney Stephan Steiger","height":"5' 10\" (1.78 m)","bio":"Rodney Stephen Steiger was born in Westhampton, New York, to Augusta Amelia (Driver) and Frederick Jacob Steiger, both vaudevillians. He was of German and Austrian ancestry. After his parents' divorce, Steiger was raised by his mother in Newark, New Jersey. He dropped out of Westside High school at age 16 and joined the Navy. He saw action in the Pacific on a destroyer. Steiger returned to New Jersey after the war and worked for the VA. He was part of an amateur acting group, and then joined the Actors' Studio using his GI Bill benefits. Steiger received his first film roles in the early 1950s. His first major one was in Teresa (1951), but his first lead role was in the TV version of The Philco-Goodyear Television Playhouse: Marty (1953). The movie version, however, had Ernest Borgnine in the lead and won him an Academy Award. Steiger's breakthrough role came in 1954, with the classic On the Waterfront (1954). Since then he has been a presence on the screen as everything from a popular leading man to a little-known character actor. Steiger made a name for himself in many different types of roles, from a crooked promoter in The Harder They Fall (1956) to the title character in Al Capone (1959). He was one of dozens of stars in the epic World War II film The Longest Day (1962). In 1964, he received his second Oscar nomination for The Pawnbroker (1964). The next couple of years he was at the height of his powers. In 1965, he starred in the dark comedy The Loved One (1965), and in David Lean's epic Doctor Zhivago (1965). In 1966, he starred in the BBC Play of the Month (1965) episode \"Death of a Salesman\" as Willy Loman in the TV version of his stage play \"Death of a Salesman,\" but in 1967, he landed what many consider his greatest role: Sheriff Bill Gillespie in In the Heat of the Night (1967), opposite Sidney Poitier. Steiger deservedly took home the Best Actor Oscar for his work in that film. He took another controversial role as a man with many tattoos in The Illustrated Man (1969) and as a serial killer in the classic No Way to Treat a Lady (1968). After that, he seemed to have withdrawn from high-profile movies and became more selective in the roles he chose. He turned down the lead in Patton (1970) and also in The Godfather (1972). Among his more notable roles in the 1970s are Happy Birthday, Wanda June (1971), Lolly-Madonna XXX (1973), as Benito Mussolini in The Last 4 Days (1974), Portrait of a Hitman (1979), Jésus de Nazareth (1977), F.I.S.T. (1978) and The Amityville Horror (1979). He starred in the critically acclaimed The Chosen (1981) with Robby Benson and Maximilian Schell, perhaps the highlight of his 1980s movie career. Steiger increasingly moved away from the big Hollywood pictures, instead taking roles in foreign productions and independent movies. As the 1980s ended, Steiger landed a role as the buttoned-up New York City Chief of Police in The January Man (1989). Steiger was seriously affected by depression for 8 years. As he returned to the screen in the late 1990s he began creating some of his most memorable roles. He was the doctor in the independently-made movie Shiloh (1996), about an abused dog. He was the crazed, kill-'em-all army general in Mars Attacks! (1996) who always called his enemies peace-mongers. He took a small part as a Supreme Court judge in The Hurricane (1999) and as a preacher in the badly produced film End of Days (1999). He was still active in films moving into the new millennium.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NjQ1OTUxNl5BMl5BanBnXkFtZTYwNDA3NjA2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001768","name":"Rod Steiger","idIMDB":"nm0001768"},"actorId":"nm0001768","character":"Robert E. Peary","urlCharacter":"http://www.imdb.com/character/ch0044180","main":true},{"actorName":"Diane Venora","urlProfile":"http://www.imdb.com/name/nm0893204","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0Mjg4ODY0Ml5BMl5BanBnXkFtZTcwNTc5MDkwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1952","placeOfBirth":" Hartford, Connecticut, USA","bio":"Diane Venora was born Diana Venora in East Hartford Connecticut. She left Hartford for a full scholarship in the Drama Division of The Juilliard School. After graduating from Juilliard, she performed extensively on the stage and developed a reputation as a talented stage actress, particularly in Shakespearian plays. In 1983, she starred in Joseph Papp's production of \"Hamlet\" at the New York Shakespeare Festival, in the lead role, the first woman to play the role at the New York Shakespeare Festival. In 1988, her critically acclaimed performance in Clint Eastwood's biographical feature of jazz great Charlie Parker, Bird (1988), as \"Chan Parker\", his wife, earned her a Golden Globe nomination and the New York Film Critics Award. These roles essentially made her famous. She was married to cinematographer Andrzej Bartkowiak (Speed (1994)) but later divorced him. After the divorce, she lived in New York with her daughter Madaket Bartkowiak, traveling often for work. She quit show business when Madzia was 8 to spend more time with her daughter. During her 7-year hiatus, Venora stayed close to home, teaching disadvantaged children, and acting in an occasional play. When Madzia was 15, Venora took her to Los Angeles and soon landed a starring role in the ABC series Thunder Alley (1994) playing Edward Asner's daughter and a recurring role in the Emmy award-winning series Chicago Hope (1994). In 1995, she starred opposite Al Pacino and Robert De Niro as Pacino's wife in Heat (1995), earning high regard from both critics and audiences for her of role of \"Justine Hanna\", caught in a troubled marriage. That performance, and her follow-up as Juliet's mother in William Shakespeare's Romeo + Juliet (1996) impressed the directors of both The Jackal (1997) and The 13th Warrior (1999) starring Antonio Banderas.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0Mjg4ODY0Ml5BMl5BanBnXkFtZTcwNTc5MDkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0893204","name":"Diane Venora","idIMDB":"nm0893204"},"actorId":"nm0893204","character":"Marie Fidele Hunt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Gross","urlProfile":"http://www.imdb.com/name/nm0343447","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzUyNjE0NjQwNV5BMl5BanBnXkFtZTYwNjUyNzMz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1947","placeOfBirth":" Chicago, Illinois, USA","birthName":"Michael Edward Gross","height":"6' 4\" (1.93 m)","bio":"Michael Gross was born in 1947 in Chicago, Illinois, to Virginia Ruth (Cahill), a telephone operator, and William Oscar Gross, a tool designer. He was involved with a gang for a couple of years during high school before becoming a better student. He went on to be senior class president. Received an M.F.A. from the Yale University School of Drama. Worked in theater before moving to New York to begin an acting career. This eventually led to his breakthrough role on the show Family Ties (1982). He has moved on to several other projects since the show's end, including three of the In the Line of Duty movies, narrating audio books, and, probably most notably, playing the character Burt in the Tremors (1990) films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzUyNjE0NjQwNV5BMl5BanBnXkFtZTYwNjUyNzMz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0343447","name":"Michael Gross","idIMDB":"nm0343447"},"actorId":"nm0343447","character":"James Troth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Samm-Art Williams","urlProfile":"http://www.imdb.com/name/nm0931638","urlPhoto":"","biography":{"dateOfBirth":"20 January 1946","placeOfBirth":" Burgaw, North Carolina, USA","birthName":"Samuel Arthur Williams","height":"6' 6\" (1.98 m)","bio":"Samm-Art Williams was born on January 20, 1946 in Burgaw, North Carolina, USA as Samuel Arthur Williams. He is a producer and writer, known for The Fresh Prince of Bel-Air (1990), Martin (1992) and The Good News (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0931638","name":"Samm-Art Williams","idIMDB":"nm0931638"},"actorId":"nm0931638","character":"Matt Henson","urlCharacter":"http://www.imdb.com/character/ch0044186","main":true},{"actorName":"Louis Negin","urlProfile":"http://www.imdb.com/name/nm0624369","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MzA4MDA1M15BMl5BanBnXkFtZTgwMTg2NzE4ODE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"bio":"Louis Negin is an actor and writer, known for Winnipeg mon amour (2007), Talking Dead (2008) and The Saddest Music in the World (2003). He is married to Charles Dunlop.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MzA4MDA1M15BMl5BanBnXkFtZTgwMTg2NzE4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0624369","name":"Louis Negin","idIMDB":"nm0624369"},"actorId":"nm0624369","character":"Maitre D'","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Walker","urlProfile":"http://www.imdb.com/name/nm0908008","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQwOTUxOTU5M15BMl5BanBnXkFtZTgwNDc5MzcxMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Mark Walker is an actor, known for Hemlock Grove (2013), Nuremberg (2000) and The List (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQwOTUxOTU5M15BMl5BanBnXkFtZTgwNDc5MzcxMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0908008","name":"Mark Walker","idIMDB":"nm0908008"},"actorId":"nm0908008","character":"1st Gentleman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barry Blake","urlProfile":"http://www.imdb.com/name/nm0086483","urlPhoto":"","biography":{"bio":"Barry Blake is an actor, known for Elvis Gratton II: Miracle à Memphis (1999), Wrong Number (2002) and Fahrenheit (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0086483","name":"Barry Blake","idIMDB":"nm0086483"},"actorId":"nm0086483","character":"2nd Gentleman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bronwen Mantel","urlProfile":"http://www.imdb.com/name/nm0544053","urlPhoto":"","biography":{"dateOfBirth":"29 October 1948","placeOfBirth":" Montreal, Québec, Canada","bio":"Bronwen Mantel was born on October 29, 1948 in Montreal, Québec, Canada. She is an actress, known for Gothika (2003), Secret Window (2004) and Arthur (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0544053","name":"Bronwen Mantel","idIMDB":"nm0544053"},"actorId":"nm0544053","character":"Mrs. Dudley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tara O'Donnell","urlProfile":"http://www.imdb.com/name/nm0640844","urlPhoto":"","biography":{"bio":"Tara O'Donnell is an actress, known for D'origine inconnue (1983), The Hotel New Hampshire (1984) and Les jeunes adultes (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0640844","name":"Tara O'Donnell","idIMDB":"nm0640844"},"actorId":"nm0640844","character":"Ruth Hunt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Daniel Nalbach","urlProfile":"http://www.imdb.com/name/nm0620500","urlPhoto":"","biography":{"dateOfBirth":"30 May 1937","placeOfBirth":" Buffalo, New York, USA","bio":"Daniel Nalbach was born on May 30, 1937 in Buffalo, New York, USA. He was an actor, known for Street Smart (1987), The Gig (1985) and Le marchand d'armes (1989). He died on May 27, 1997.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0620500","name":"Daniel Nalbach","idIMDB":"nm0620500"},"actorId":"nm0620500","character":"Bridgeman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Philip Spensley","urlProfile":"http://www.imdb.com/name/nm0818223","urlPhoto":"","biography":{"bio":"Philip Spensley is an actor, known for Moody Beach (1990), If Looks Could Kill (1991) and Rudy: The Rudy Giuliani Story (2003).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0818223","name":"Philip Spensley","idIMDB":"nm0818223"},"actorId":"nm0818223","character":"Morris Jessup","urlCharacter":"http://www.imdb.com/character/ch0527989","main":true},{"actorName":"Antony Parr","urlProfile":"http://www.imdb.com/name/nm0663298","urlPhoto":"","biography":{"dateOfBirth":"30 April 1925","placeOfBirth":" Nottingham, England, UK","bio":"Antony Parr was born on April 30, 1925 in Nottingham, England. He was an actor, known for M. Butterfly (1993), Les espions dans la ville (1980) and La marque de Caïn (1986). He was married to Elizabeth Beattie. He died in 2002 in Ontario, Canada.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0663298","name":"Antony Parr","idIMDB":"nm0663298"},"actorId":"nm0663298","character":"General Hubbard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Don Robinson","urlProfile":"http://www.imdb.com/name/nm0732562","urlPhoto":"","biography":{"bio":"Don Robinson is an actor, known for La course vers le pôle (1983) and Spearfield's Daughter (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0732562","name":"Don Robinson","idIMDB":"nm0732562"},"actorId":"nm0732562","character":"Alexander Graham Bell","urlCharacter":"http://www.imdb.com/character/ch0044182","main":true},{"actorName":"Walter Massey","urlProfile":"http://www.imdb.com/name/nm0557355","urlPhoto":"","biography":{"dateOfBirth":"19 August 1928","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Walter Edward Hart Massey","height":"6' (1.83 m)","bio":"Quebec-based actor whose career has spanned nearly five decades. He studied at the Professional Broadway Workshops under Harold Clurman and Sanford Meisner. He has worked in the United States (notably for Joseph Papp's NY Shakespeare Festival) as well as for many of the major companies in Canada including the Bulldog, National Arts Centre and Centaur Theatre, Montreal. He was co-founder of the King's Theatre in Prince Edward Island, the Piggery Theatre and Playwrights Workshop. He is also a founding member of Canadian Actors' Equity and served in the governing bodies of both the local and national associations for over 34 years.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0557355","name":"Walter Massey","idIMDB":"nm0557355"},"actorId":"nm0557355","character":"Theodore Roosevelt","urlCharacter":"http://www.imdb.com/character/ch0027501","main":true}],"seasons":[],"idIMDB":"tt0085360","urlIMDB":"http://www.imdb.com/title/tt0085360","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 40 min (100 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.3","filmingLocations":[{"location":"Greenland"}],"awards":[],"votes":"66","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0010995","name":"Robert Halmi"}],"keywords":{"keywords":["commander","navy","north pole","expedition","greenland","explorer","physician","arctic"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 05:18:12"}}