{"data":{"movies":[{"title":"In Like Flint","originalTitle":"","year":"1967","releaseDate":"19670315","directors":[{"name":"Gordon Douglas","id":"nm0235066"}],"writers":[{"name":"Hal Fimberg","id":"nm0277333"}],"runtime":"114 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0M2ZjZjctODI0OC00ZjMyLTg1N2UtMTY1NmRjMmUwMWE4XkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Comedy","Romance","Sci-Fi"],"plot":"Flint is again called out of retirement when his old boss finds that he seems to have missed three minutes while golfing with the president. Flint finds that the president has been replaced by an actor (Flint's line [with a wistful look] is \"An Actor as President?\") Flint finds that a group of women have banded together to take over the world through subliminal brainwashing in beauty salons they own.","simplePlot":"Super-spy Flint takes on a cabal of women plotting to rule the world.","actors":[{"actorName":"James Coburn","urlProfile":"http://www.imdb.com/name/nm0000336","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNTg3Njg4M15BMl5BanBnXkFtZTcwOTI1ODE1NA@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 August 1928","placeOfBirth":" Laurel, Nebraska, USA","birthName":"James Harrison Coburn Jr.","height":"6' 2\" (1.88 m)","bio":"Lanky, charismatic and versatile actor with an amazing grin that put everyone at ease, James Coburn studied acting at UCLA, and then moved to New York to study under noted acting coach Stella Adler. After being noticed in several stage productions, Coburn appeared in a handful of minor westerns before being cast as the knife-throwing, quick-shooting Britt in the John Sturges mega-hit The Magnificent Seven (1960). Sturges remembered Coburn's talents when he cast his next major film project, The Great Escape (1963), where Coburn played the Australian POW Sedgewick. Regular work now came thick and fast for Coburn, including appearing in Major Dundee (1965), the first of several films he appeared in directed by Hollywood enfant terrible Sam Peckinpah. The next two years were a key period for Coburn, with his performances in the wonderful 007 spy spoof Our Man Flint (1966) and the eerie Dead Heat on a Merry-Go-Round (1966). Coburn followed up in 1967 with a Flint sequel, In Like Flint (1967), and the much underrated political satire The President's Analyst (1967). The remainder of the 1960s was rather uneventful for Coburn. However, he became associated with martial arts legend Bruce Lee and the two trained together, traveled extensively and even visited India scouting locations for a proposed film project, but Lee's untimely death (Coburn, along with Steve McQueen, was a pallbearer at Lee's funeral) put an end to that. The 1970s saw Coburn appearing again in several strong roles, starting off in Peckinpah's Pat Garrett & Billy the Kid (1973), alongside Charles Bronson in the Depression-era Hard Times (1975) and as a disenchanted German soldier on the Russian front in Peckinpah's superb Cross of Iron (1977). Towards the end of the decade, however, Coburn was diagnosed with rheumatoid arthritis, which severely hampered his health and work output for many years. After conventional treatments failed, Coburn turned to a holistic therapist, and through a restructured diet program, made a definite improvement. By the 1990s he was once again appearing regularly in both film and TV productions. No one was probably more surprised than Coburn himself when he was both nominated for, and then won, the Best Supporting Actor Award in 1997 for playing Nick Nolte's abusive and alcoholic father in Affliction (1997). At 70 years of age, Coburn's career received another shot in the arm, and he appeared in another 14 films, including Chiens des neiges (2002) and The Man from Elysian Fields (2001), before his death from a heart attack in November of 2002. Coburn's passions in life included martial arts, card playing and enjoying fine Cuban cigars!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNTg3Njg4M15BMl5BanBnXkFtZTcwOTI1ODE1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000336","name":"James Coburn","idIMDB":"nm0000336"},"actorId":"nm0000336","character":"Derek Flint","urlCharacter":"http://www.imdb.com/character/ch0025045","main":true},{"actorName":"Lee J. Cobb","urlProfile":"http://www.imdb.com/name/nm0002011","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc3MTM0MDQyMF5BMl5BanBnXkFtZTYwMTczMTg2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 December 1911","placeOfBirth":" New York City, New York, USA","birthName":"Leo Jacoby","height":"5' 11\" (1.8 m)","bio":"Lee J. Cobb, one of the premier character actors in American film for three decades in the post-World War II period, was born Leo Jacoby in New York City's Lower East Side on December 8, 1911. The son of a Jewish newspaper editor, young Leo was a child prodigy in music, mastering the violin and the harmonica. Any hopes of a career as a violin virtuoso were dashed when he broke his wrist, but his talent on the harmonica may have brought him his first professional success. At the age of 16 or 17 he ran away from home to Hollywood to try to break into motion pictures as an actor. He reportedly made his film debut as a member of Borrah Minevitch and His Harmonica Rascals (their first known movie appearance was in the 1929 two-reeler Boyhood Days), but that cannot be substantiated. However, it's known that after Leo was unable to find work he returned to New York City, where he attended City College of New York at night to study accounting while acting in radio dramas during the day. An older Cobb tried his luck in California once more, making his debut as a professional stage actor at the Pasadena Playhouse in 1931. After again returning to his native New York, he made his Broadway debut as a saloonkeeper in a dramatization of Fyodor Dostoevsky's Crime and Punishment, but it closed after 15 performances (later in his career, Dostoevsky would prove more of a charm, with Cobb's role as Father Karamazov in The Brothers Karamazov (1958) garnering him his second Oscar nomination), Cobb joined the politically progressive Group Theater in 1935 and made a name for himself in Clifford Odets' politically liberal dramas Waiting for Lefty and Til the Day I Die, appearing in both plays that year in casts that included Elia Kazan, who later became famous as a film director. Cobb also appeared in the 1937 Group Theater production of Odets' Golden Boy, playing the role of Mr. Carp, in a cast that also included Kazan, Julius Garfinkle (later better known under his stage name of John Garfield), and Martin Ritt, all of whom later came under the scrutiny of the House Un-American Activities Committee during the heyday of the McCarthy Red Scare hysteria more than a decade later. Cobb took over the role of Mr. Bonaparte, the protagonist's father, in the 1939 film version of the play, despite the fact that he was not yet 30 years old. The role of a patriarch suited him, and he'd play many more in his film career. It was as a different kind of patriarch that he scored his greatest success. Cobb achieved immortality by giving life to the character of Willy Loman in the original 1949 Broadway production of Arthur Miller's Death of a Salesman. His performance was a towering achievement that ranks with such performances as Edwin Booth as Richard III and John Barrymore as Hamlet in the annals of the American theater. Cobb later won an Emmy nomination as Willy when he played the role in a made-for-TV movie of the play (Death of a Salesman (1966)). Miller said that he wrote the role with Cobb in mind. Before triumphing as Miller's Salesman, Cobb had appeared on Broadway only a handful of times in the 1940s, including in Ernest Hemingway's The Fifth Column (1940), Odets' \"Clash by Night\" (1942) and the US Army Air Force's Winged Victory (1943-44). Later he reprised the role of Joe Bonaparte's father in the 1952 revival of Golden Boy opposite Garfield as his son, and appeared the following year in The Emperor's Clothes. His final Broadway appearance was as King Lear in the Repertory Theatre of Lincoln Center's 1968 production of Shakespeare's play. Aside from his possible late 1920s movie debut and his 1934 appearance in the western The Vanishing Shadow (1934), Cobb's film career proper began in 1937 with the westerns North of the Rio Grande (1937) (in which he was billed as Lee Colt) and Rustlers' Valley (1937) and spanned nearly 40 years until his death. After a hiatus while serving in the Army Air Force during World War II, Cobb's movie career resumed in 1946. He continued to play major supporting roles in prestigious A-list pictures. His movie career reached its artistic peak in the 1950s, when he was twice nominated for Best Supporting Actor Academy Awards, for his role as Johnny Friendly in On the Waterfront (1954) and as the father in The Brothers Karamazov (1958). Other memorable supporting roles in the 1950s included the sagacious Judge Bernstein in The Man in the Gray Flannel Suit (1956), as the probing psychiatrist Dr. Luther in The Three Faces of Eve (1957) and as the volatile Juror #3 in 12 Angry Men (1957). It was in the 1950s that Cobb achieved the sort of fame that most artists dreaded: he was called before the House Un-American Activities Committee on charges that he was or had been a Communist. The charges were rooted in Cobb's membership in the Group Theater in the 1930s. Other Group Theater members already investigated by HUAC included Clifford Odets and Elia Kazan, both of whom provided friendly testimony before the committee, and John Garfield, who did not. Cobb's own persecution by HUAC had already caused a nervous breakdown in his wife, and he decided to appear as a friendly witness in order to preserve her sanity and his career, by bringing the inquisition to a halt. Appearing before the committee in 1953, he named names and thus saved his career. Ironically, he would win his first Oscar nomination in On the Waterfront (1954) directed and written by fellow HUAC informers Kazan and Budd Schulberg. The film can be seen as a stalwart defense of informing, as epitomized by the character Terry Malloy's testimony before a Congressional committee investigating racketeering on the waterfront. Major films in which Cobb appeared after reaching his career plateau include Otto Preminger's adaptation of Leon Uris' ode to the birth of Israel, Exodus (1960); the Cinerama spectacle How the West Was Won (1962); the James Coburn spy spoofs, Our Man Flint (1966) and In Like Flint (1967); Clint Eastwood's first detective film, Coogan's Bluff (1968); and legendary director William Wyler's last film, The Liberation of L.B. Jones (1970). In addition to his frequent supporting roles in film, Cobb often appeared on television. He played Judge Henry Garth on The Virginian (1962) from 1962-66 and also had a regular role as the attorney David Barrett on The Young Lawyers (1969) from 1970-71. Cobb also appeared in made-for-TV movies and made frequent guest appearances on other TV shows. His last major Hollywood movie role was that of police detective Lt. Kinderman in The Exorcist (1973). Lee J. Cobb died of a heart attack in Woodland Hills, California, on February 11, 1976, at the age of 64. He is buried in Mount Sinai Memorial Park Cemetery in Los Angeles, California. Though he will long be remembered for many of his successful supporting performances in the movies, it is as the stage's first Willy Loman in which he achieved immortality as an actor. Bearing in mind that the role was written for him, it is through Willy that he will continue to have an influence on American drama far into the future, for as long as Death of a Salesman is revived.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc3MTM0MDQyMF5BMl5BanBnXkFtZTYwMTczMTg2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002011","name":"Lee J. Cobb","idIMDB":"nm0002011"},"actorId":"nm0002011","character":"Lloyd C. Cramden","urlCharacter":"http://www.imdb.com/character/ch0025046","main":true},{"actorName":"Jean Hale","urlProfile":"http://www.imdb.com/name/nm0354933","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ1MzAwMTIwN15BMl5BanBnXkFtZTgwODEyMjY2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 December 1938","placeOfBirth":" Salt Lake City, Utah, USA","birthName":"Carol Jean Hale","bio":"Fetching, glossy-lipped, blue-eyed, white-hot blonde Jean Hale showed major promise playing superficial glamor girls, a la Carroll Baker and Virna Lisi, throughout the 1960s. Born to Mormon parents in Salt Lake City, Utah, she was raised in Darien, Connecticut and expressed an early interest in acting. As a promise to her parents, however, she attended college first to test her ambitions. After attending the University of Utah (for one semester, majoring in ballet) and then Skidmore College for Women (three additional semesters), Jean went directly to New York, where she was accepted as a student at the Neighbood Playhouse. There, she studied under Sydney Pollack and met (and later married) fellow acting student, Dabney Coleman. To supplement her income, Jean's incredible beauty served her well as a model for both the Conover and Huntington Hartford agencies. Upon her graduation from the Playhouse, she set out to find work -- her first professional job being a Hudnut commercial. More TV work came her way as a dancer on the 1960 Sing Along with Mitch (1961) series and she also appeared, on stage, in the plays, \"The Male Animal\" and \"Everybody Loves Opal\". Agent Len Luskin (Sandra Dee's agent) took an interest and signed her up in 1960. Turning down a part in BUtterfield 8 (1960) in order to stay put in New York with Coleman, the couple eventually married on December 11, 1961, and Coleman wound up accompanying her to Puerto Rico to shoot what should have been her debut film Felicia (1964). The movie was never released. Her second film, however, Violent Midnight (1963) [aka Psychomania], a gruesome low-budget horror film, was released. She plays the potential victim of a knifing stalker and she received decent reviews. It led to a Universal contract in 1963 and co-starring/featured parts in a modicum of films, including Taggart (1964) and McHale's Navy Joins the Air Force (1965). For the latter film as a man-hungry lieutenant, she dyed her hair platinum blonde and kept it). She also found TV guest parts in such shows as McHale's Navy (1962), The Alfred Hitchcock Hour (1962), The Wild Wild West (1965) and The Virginian (1962). It was the role of a spoiled movie diva in the overly melodramatic, poorly-received flick, The Oscar (1966), that gave Jean an unexpected career boost. This led to her sexy villainous cohort role to \"The Mad Hatter\" (David Wayne) on TV's Batman (1966). She also capitalized on her sensuality, with a key role opposite James Coburn, in the James Bond spoof, In Like Flint (1967), a move that earned her a Fox contract -- one picture a year for seven years. Jean followed this immediately with her co-star role in The St. Valentine's Day Massacre (1967), directed by Roger Corman, in which she looked period perfect as George Segal's moll. And then, her career hit a major decline. Soon after her third child was born, Jean and Dabney Coleman separated and the actress lost complete focus of her career. The studio was promoting Jean as a sex goddess but, much to its consternation, she was unwilling to fulfill the requirements of such an image -- wearing skimpy costumes; turning down film roles that required semi-nudity; turning down publicity tours in Europe for the sake of her family. Jean even refused a Playboy Magazine spread having her model men's pajama tops, while promoting the \"In Like Flint\" film. The frustrated heads at Fox released her. Turning back to the small screen once again (Tarzan (1966), Bonanza (1959), Hawaii Five-O (1968), Mod Squad (1968), Cannon (1971)), Jean then filmed Something Big (1971) with Dean Martin but all her scenes were excised from the final print. She left it all although, decades later, she returned briefly to appear in a few TV movies. Long separated, Jean's marriage to Coleman was finally dissolved on December 4, 1984. Her three children, daughters Kelly Johns and Mary (the latter aka singer-songwriter Quincy Coleman) and middle son Randy Coleman all pursued the music/acting careers at one time or another. In later years, Jean co-founded her own production company (\"Coleman/Tanasescu Entertainment\") with partner Gino Tanasescu and continues to reside in Southern California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ1MzAwMTIwN15BMl5BanBnXkFtZTgwODEyMjY2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0354933","name":"Jean Hale","idIMDB":"nm0354933"},"actorId":"nm0354933","character":"Lisa Norton / Nora Benson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrew Duggan","urlProfile":"http://www.imdb.com/name/nm0240887","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyMzAxMDgwMV5BMl5BanBnXkFtZTcwMjI3NDIyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1923","placeOfBirth":" Franklin, Indiana, USA","height":"6' 5\" (1.96 m)","bio":"Actor. Born in Franklin, Indiana on December 28, 1923, he was raised in Texas and went to college at Indiana University. There, on a speech and drama scholarship, he began to act and perform however this was interrupted by being called into the service. In World War II where he saw action overseas, he was befriended by actor Melvyn Douglas who led his division. With such encouragement, as well as meeting and becoming familiar with some Broadway folks, Duggan went into acting. From 1953 through practically the time of his death in 1988, he was a fixture in both movies and television. It is impossible to list all the different shows this prolific actor was part of either as support, guest or star. But to give an idea, he was General Ed Britt on 12 O'Clock High (1964), he was Cal Calhoun in Bourbon Street Beat (1959) and his most famous role as Murdoch Lancer in Lancer (1968) and the original John Walton opposite Patricia Neal in The Homecoming: A Christmas Story (1971). Many people will remember him as \"Howitzer\" Al Hoolihan, the father of Hotlips in M*A*S*H (1972). It was in 1954 that he married the Broadway actress Elizabeth Logue whom he always called \"Betty\". Both Andrew Duggan and his wife were cremated, their ashes scattered at Lake Arrowhead, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMyMzAxMDgwMV5BMl5BanBnXkFtZTcwMjI3NDIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0240887","name":"Andrew Duggan","idIMDB":"nm0240887"},"actorId":"nm0240887","character":"U.S. President Trent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anna Lee","urlProfile":"http://www.imdb.com/name/nm0496819","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzIxNjc0M15BMl5BanBnXkFtZTcwMzA5OTExOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 January 1913","placeOfBirth":" Ightham, Kent, England, UK","birthName":"Joan Boniface Winnifrith","height":"5' 4\" (1.63 m)","bio":"The daughter of a clergyman, Anna Lee was born Joan Boniface Winnifrith and encouraged to pursue an acting career by her father. After training at London's Royal Albert Hall, she took to the boards and later began appearing in English films, first as an extra, then working her way up to featured parts and finally earning the unofficial title \"Queen of the Quota Quickies.\" Lee and her husband, director Robert Stevenson, relocated to Hollywood in the late 1930s, and Lee began starring in stateside productions as well as becoming a fixture of the John Ford stock company (she appeared in How Green Was My Valley (1941), Fort Apache (1948) and a half-dozen others). In 1970, she became the seventh wife of novelist, poet and playwright Robert Nathan (Portrait of Jennie (1948), The Bishop's Wife (1947)); they married three months after they met. Now widowed, Lee soldiers on, regularly playing wealthy Lila Quartermaine on the TV soaper General Hospital (1963).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMzIxNjc0M15BMl5BanBnXkFtZTcwMzA5OTExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0496819","name":"Anna Lee","nicknames":["Queen of the Quota Quickies"],"idIMDB":"nm0496819"},"actorId":"nm0496819","character":"Elisabeth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hanna Hertelendy","urlProfile":"http://www.imdb.com/name/nm0381000","urlPhoto":"","biography":{"dateOfBirth":"5 October 1919","placeOfBirth":" Budapest, Hungary","birthName":"Ilona Zimka","height":"5' 3½\" (1.61 m)","bio":"Hanna Hertelendy was born on October 5, 1919 in Budapest, Hungary as Ilona Zimka. She was an actress, known for Rosemary's Baby (1968), Being There (1979) and In Like Flint (1967). She was married to William Kerwin, Robert Walker, Ernest Valentine Polutnik, Istvan Hertelendy and Stephen Bekassy. She died on May 15, 2008 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0381000","name":"Hanna Hertelendy","idIMDB":"nm0381000"},"actorId":"nm0381000","character":"Helena","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Totty Ames","urlProfile":"http://www.imdb.com/name/nm0024754","urlPhoto":"","biography":{"dateOfBirth":"3 November 1922","placeOfBirth":" Willow, Oklahoma, USA","birthName":"Winifred Cope","bio":"Totty Ames was born on November 3, 1922 in Willow, Oklahoma, USA as Winifred Cope. She was an actress, known for In Like Flint (1967), Skullduggery (1970) and The Twilight Zone (1959). She died on July 10, 2015 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0024754","name":"Totty Ames","idIMDB":"nm0024754"},"actorId":"nm0024754","character":"Simone","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve Ihnat","urlProfile":"http://www.imdb.com/name/nm0407307","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NTU2MzMzNl5BMl5BanBnXkFtZTgwMDk4NDQ2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1934","placeOfBirth":" Jastrabie, Czechoslovakia [now Jastrabie pri Michalovciach, Slovak Republic]","birthName":"Stefan Ihnat","bio":"Steve Ihnat was born on August 7, 1934 in Jastrabie, Czechoslovakia as Stefan Ihnat. He was an actor and writer, known for In Like Flint (1967), Hour of the Gun (1967) and Madigan (1968). He was married to Sally Carter-Ihnat. He died on May 12, 1972 in Cannes, Alpes-Maritimes, France.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NTU2MzMzNl5BMl5BanBnXkFtZTgwMDk4NDQ2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0407307","name":"Steve Ihnat","idIMDB":"nm0407307"},"actorId":"nm0407307","character":"Colonel / Gen. Carter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas Hasson","urlProfile":"http://www.imdb.com/name/nm0368532","urlPhoto":"","biography":{"bio":"Thomas Hasson is an actor and art director, known for In Like Flint (1967), Truck Stop Women (1974) and Bootleggers (1974).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0368532","name":"Thomas Hasson","idIMDB":"nm0368532"},"actorId":"nm0368532","character":"Lt. Avery","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary Michael","urlProfile":"http://www.imdb.com/name/nm0584174","urlPhoto":"","biography":{"bio":"Mary Michael was born in Denver, Colorado, USA. She was an actress, known for In Like Flint (1967), A String of Blue Beads (1953) and How Sweet It Is! (1968). She died on November 6, 1980.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0584174","name":"Mary Michael","idIMDB":"nm0584174"},"actorId":"nm0584174","character":"Terry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Diane Bond","urlProfile":"http://www.imdb.com/name/nm0093923","urlPhoto":"","biography":{"dateOfBirth":"25 September 1945","placeOfBirth":" Los Angeles, California, USA","birthName":"Diane Loretta Bond","bio":"Diane Bond was born on September 25, 1945 in Los Angeles, California, USA as Diane Loretta Bond. She is an actress, known for In Like Flint (1967), House of 1,000 Dolls (1967) and A Swingin' Summer (1965).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0093923","name":"Diane Bond","idIMDB":"nm0093923"},"actorId":"nm0093923","character":"Jan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jacqueline Ray","urlProfile":"http://www.imdb.com/name/nm0712851","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MDc2NDIwN15BMl5BanBnXkFtZTYwMzA0MDI2._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"birthName":"Jacqueline Mary Ray","bio":"Jacqueline Ray was born in Burbank, California, USA as Jacqueline Mary Ray. She is an actress, known for In Like Flint (1967), The Killings at Outpost Zeta (1980) and Beyond the Universe (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MDc2NDIwN15BMl5BanBnXkFtZTYwMzA0MDI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0712851","name":"Jacqueline Ray","idIMDB":"nm0712851"},"actorId":"nm0712851","character":"Denise","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Herb Edelman","urlProfile":"http://www.imdb.com/name/nm0248983","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0MTM1MTEwMTheQTJeQWpwZ15BbWU3MDE3Njg1MTg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1933","placeOfBirth":" Brooklyn, New York, USA","birthName":"Herbert Edelman","height":"6' 5\" (1.96 m)","bio":"Herb Edelman was born on November 5, 1933 in Brooklyn, New York, USA as Herbert Edelman. He was an actor and assistant director, known for The Odd Couple (1968), The Good Guys (1968) and Barefoot in the Park (1967). He was married to Louise Sorel and Marylin Cosgrove. He died on July 21, 1996 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0MTM1MTEwMTheQTJeQWpwZ15BbWU3MDE3Njg1MTg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0248983","name":"Herb Edelman","idIMDB":"nm0248983"},"actorId":"nm0248983","character":"Russian Premier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yvonne Craig","urlProfile":"http://www.imdb.com/name/nm0186051","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNzUyMTk5OF5BMl5BanBnXkFtZTYwMzcyNzI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1937","placeOfBirth":" Taylorville, Illinois, USA","birthName":"Yvonne Joyce Craig","height":"5' 4\" (1.63 m)","bio":"Yvonne Joyce Craig was born on May 16, 1937 in Taylorville, Illinois. As a young teenager, Yvonne showed such promise as a dancer that she was accepted to Denham's Ballet Russe de Monte Carlo. Her training progressed until she left the company in 1957 over a disagreement on casting changes. She moved to Los Angeles hoping to continue her dancing, but was soon cast in movies. At first, Yvonne had small roles in movies such as Gidget (1959) and The Gene Krupa Story (1959). After that, her film career just bumped along. As Yvonne was dating Elvis Presley at the time, she did have a supporting role in the two Elvis movies, It Happened at the World's Fair (1963) and Kissin' Cousins (1964). But her fame would come with the cult television series Batman (1966) in which she played Commissioner Gordon's daughter, Barbara. Her secret identity was Batgirl and as the Commissioner's daughter, she had access to all the calls of trouble that was taking place in Gotham City. Her character, Batgirl, was part of the 1967-68 season, which was the end of the run for the series. After Batman (1966), she also appeared on other television series such as Star Trek (1966) and The Six Million Dollar Man (1974). As her career wound down, Yvonne went into the real estate business. Yvonne Craig died at age 78 of breast cancer at her home in Pacific Palisades, California on August 17, 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNzUyMTk5OF5BMl5BanBnXkFtZTYwMzcyNzI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0186051","name":"Yvonne Craig","idIMDB":"nm0186051"},"actorId":"nm0186051","character":"Natasha, the Ballerina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert 'Buzz' Henry","urlProfile":"http://www.imdb.com/name/nm0377986","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzU3MDU2Njc1Ml5BMl5BanBnXkFtZTgwNzUwMDQxNTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1931","placeOfBirth":" Colorado, USA","bio":"Robert 'Buzz' Henry was born on September 4, 1931 in Colorado, USA. He is known for his work on In Like Flint (1967), The Sheepman (1958) and Danny Boy (1945). He died on September 30, 1971 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzU3MDU2Njc1Ml5BMl5BanBnXkFtZTgwNzUwMDQxNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0377986","name":"Robert 'Buzz' Henry","idIMDB":"nm0377986"},"actorId":"nm0377986","character":"Austin","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0061810","urlIMDB":"http://www.imdb.com/title/tt0061810","business":{"budget":{"money":"$3,775,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 54 min (114 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Color (DeLuxe)","Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["DeLuxe"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["CinemaScope"],"printedFilmFormat":["35 mm"]},"rating":"6.2","filmingLocations":[{"location":"Dunn's River Falls, Ocho Rios, St. Ann, Jamaica"}],"rated":"UNRATED","awards":[{"award":"Laurel Awards 1967","titlesAwards":[{"titleAwardOutcome":"3rd place Golden Laurel","categories":[{"category":"Action Performance","names":[{"name":"James Coburn","id":"nm0000336","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Laurel","categories":[{"category":"Action Drama","names":[]}]}]}],"votes":"4,087","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"}],"keywords":{"keywords":["doppelganger","brainwashing","explosion in space","cold war era","deep freeze","damsel in distress","triumvirate","superspy","american in russia","outer space","terrorist plot","martial arts master","hand to hand combat","femme fatale","island hideaway","nuclear threat","space station","secret headquarters","secret agent","cryogenics","surveillance"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 23:17:57"}}