{"data":{"movies":[{"title":"Back to the Future Part III","originalTitle":"","year":"1990","releaseDate":"19900525","directors":[{"name":"Robert Zemeckis","id":"nm0000709"}],"writers":[{"name":"Robert Zemeckis","id":"nm0000709"},{"name":"Bob Gale","id":"nm0301826"}],"runtime":"118 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjhlMGYxNmMtOWFmMi00Y2M2LWE5NWYtZTdlMDRlMGEzMDA3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Comedy","Sci-Fi","Western"],"plot":"Stranded in 1955, Marty McFly receives written word from his friend, Doctor Emmett Brown, as to where can be found the DeLorean time machine. However, an unfortunate discovery prompts Marty to go to his friend's aid. Using the time machine, Marty travels to the old west where his friend has run afoul of a gang of thugs and has fallen in love with a local schoolteacher. Using the technology from the time, Marty and Emmett devise one last chance to send the two of them back to the future.","simplePlot":"Enjoying a peaceable existence in 1885, Doctor Emmet Brown is about to be killed by Buford \"Mad Dog\" Tannen. Marty McFly travels back in time to save his friend.","actors":[{"actorName":"Michael J. Fox","urlProfile":"http://www.imdb.com/name/nm0000150","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNzM0MjE4NF5BMl5BanBnXkFtZTcwMDkxMzEwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 June 1961","placeOfBirth":" Edmonton, Alberta, Canada","birthName":"Michael Andrew Fox","height":"5' 4½\" (1.64 m)","bio":"Michael J. Fox was born Michael Andrew Fox on June 9, 1961 in Edmonton, Alberta, Canada, to Phyllis Fox (née Piper), a payroll clerk, and William Fox. His parents moved their ten-year-old son, his three sisters, Kelli Fox, Karen, and Jacki, and his brother, Steven, to Vancouver, British Columbia, after his father, a sergeant in the Canadian Army Signal Corps, retired. It was during these years that Michael developed his desire to act. At age fifteen, he successfully auditioned for the role of a 10-year-old in a series called Leo and Me (1978). Gaining attention as a bright new star in Canadian television and movies, Michael realized his love for acting when he appeared on stage in \"The Shadow Box\". At age 18, he moved to Los Angeles and was offered a few roles in television series but early acting success ended fast when the roles stopped coming. For a while, he survived on boxes of macaroni and cheese. Then his agent called to tell him that he got the part of Alex P. Keaton on the situation comedy Family Ties (1982). He starred in the feature films Teen Wolf (1985), High School U.S.A. (1983), Poison Ivy (1985) and Back to the Future (1985).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNzM0MjE4NF5BMl5BanBnXkFtZTcwMDkxMzEwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000150","name":"Michael J. Fox","nicknames":["Mike"],"idIMDB":"nm0000150"},"actorId":"nm0000150","character":"Marty McFly / Seamus McFly","urlCharacter":"http://www.imdb.com/character/ch0001829","main":true},{"actorName":"Christopher Lloyd","urlProfile":"http://www.imdb.com/name/nm0000502","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzQ0ODgxOV5BMl5BanBnXkFtZTcwMTAxMDY0Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1938","placeOfBirth":" Stamford, Connecticut, USA","birthName":"Christopher Allen Lloyd","height":"6' 1\" (1.85 m)","bio":"Christopher Lloyd was born on October 22, 1938 in Stamford, Connecticut, USA as Christopher Allen Lloyd. He is an actor, known for Back to the Future (1985), Back to the Future Part II (1989) and Back to the Future Part III (1990). He was previously married to Jane Walker Wood, Carol Vanek, Kay Tornborg and Catherine Boyd.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNzQ0ODgxOV5BMl5BanBnXkFtZTcwMTAxMDY0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000502","name":"Christopher Lloyd","nicknames":["Chris"],"idIMDB":"nm0000502"},"actorId":"nm0000502","character":"Dr. Emmett Brown","urlCharacter":"http://www.imdb.com/character/ch0001831","main":true},{"actorName":"Mary Steenburgen","urlProfile":"http://www.imdb.com/name/nm0005460","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1OTI5OTc0Nl5BMl5BanBnXkFtZTcwNjc5NDMwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1953","placeOfBirth":" Newport, Arkansas, USA","birthName":"Mary Nell Steenburgen","height":"5' 8\" (1.73 m)","bio":"Mary Steenburgen is an Academy Award-winning American actress. She was born February 8, 1953, in Newport, Arkansas, USA. Her mother, Nellie May (Wall) Steenburgen, was a school-board secretary, and her father, Maurice H. Steenburgen, was a freight-train conductor. Her surname comes from distant Dutch ancestry, and her roots also include English, Scottish, and Welsh. Young Steenburgen was fond of arts and literature. Mary grew up tap-dancing her way through talent shows and school functions. She was active in her school drama class. After appearing in a number of high school plays, she enrolled at Hendrix College, a highly progressive Southern School located in Conway, Arkansas. Upon the recommendation of her drama professor, she left college in 1972 and moved to New York to study acting professionally. In the past several years, Mary Steenburgen has emerged as one of the most accomplished and sought-after screen actresses. Ever since Jack Nicholson 'discovered' her and cast her as a sassy adventuress in his rollicking western, Goin' South (1978), her career has skyrocketed and she has won acclaim for exceptional performances in each of her diverse film roles. In Nicholas Meyer's Time After Time (1979), Steenburgen was afforded critical praise for her portrayal of a somewhat dippy but liberated young bank clerk in San Francisco who crosses paths, via time machine, with English author H.G. Wells (played by Malcolm McDowell, who later became her husband. In 1980 she shot to fame with her role as Lynda Dummar in Melvin and Howard (1980) for which she won Oscar for Best Actress in a Supporting Role. More recently, Steenburgen again impressed audiences and critics alike with her stunning performance as the strong-willed turn-of-the-century Mother in Ragtime (1981). Steenburgen is a notable patron of arts. She is also an active supporter of humanitarian causes. She has two children from her previous marriage to actor Malcolm McDowell. Since 1995 she has been married to actor Ted Danson, and the couple is living in Los Angeles area.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1OTI5OTc0Nl5BMl5BanBnXkFtZTcwNjc5NDMwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005460","name":"Mary Steenburgen","idIMDB":"nm0005460"},"actorId":"nm0005460","character":"Clara Clayton","urlCharacter":"http://www.imdb.com/character/ch0001834","main":true},{"actorName":"Thomas F. Wilson","urlProfile":"http://www.imdb.com/name/nm0001855","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzM4ODM4M15BMl5BanBnXkFtZTYwMDU1Mzky._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1959","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Thomas Francis Wilson Jr.","height":"6' 2½\" (1.89 m)","bio":"Tom Wilson is a creative artist whose professional career has explored almost every imaginable artistic discipline, blending them into a unique and very individual declaration of a life in the arts. A man of fervent but private faith his whole life, the last few years have been interesting, with hundreds of invitations to speak at conferences and retreats, as well as the opportunity to record the music that he began playing in church in the 1970s. Tom has enjoyed a successful career as an actor, writer and comedian for over 20 years. He has more than 50 films, television shows and comedy specials to his credit, and has appeared on talk shows with everyone from Johnny Carson to Jay Leno to David Letterman to Regis Philbin and Kathie Lee Gifford. As a voice-over actor, he has worked in dozens of animated series, including many episodes of Nickelodeon's SpongeBob SquarePants (1999). As a comedian he has been a regular performer at the world-famous Improv and Comedy Store since the day he arrived in Hollywood. His self-written one-man show, \"Cowboy Tommy,\" boasted a series of sold-out engagements. He continues to act in movies and television, and he performs comedy and music at theaters across America. As a writer and producer, he's written for several prestigious literary magazines, as well as for Universal Studios, Disney, Fox and Film Roman studios, and produced a groundbreaking series of debates for Canadian television called \"The Seven Deadly Sins\", which examined cultural values and the role of the arts within them. As an avocation, he is a photographer and painter, with a photograph in the permanent collection of the California Museum of Photography and paintings on the walls of the guest bedrooms of many close personal friends (or, as artists like to say, \"in many private collections.\") Actor, comedian, writer, musician, and artist - Tom Wilson has transcended the limitations of pop-cultural celebrity to become an artist of honesty, gravity and grace. Thomas is a graduate of Radnor high school in the suburbs of Philadelphia, Pennsylvania, where he was known for his comedic personality.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzM4ODM4M15BMl5BanBnXkFtZTYwMDU1Mzky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001855","name":"Thomas F. Wilson","nicknames":["Tom"],"idIMDB":"nm0001855"},"actorId":"nm0001855","character":"Buford 'Mad Dog' Tannen / Biff Tannen","urlCharacter":"http://www.imdb.com/character/ch0041859","main":true},{"actorName":"Lea Thompson","urlProfile":"http://www.imdb.com/name/nm0000670","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5ODcyODUwMl5BMl5BanBnXkFtZTgwMTA3MDg1MjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1961","placeOfBirth":" Rochester, Minnesota, USA","birthName":"Lea Katherine Thompson","height":"5' 3\" (1.6 m)","bio":"Lea Katherine Thompson was born on May 31, 1961, in Rochester, Minnesota. She is the youngest of five children. Her parents are Barbara Anne (Barry) and Clifford Elwin \"Cliff\" Thompson. Since all her siblings were much older than she, Lea says it seemed like she had more than two parents. The family lived in the Starlight Motel, all the kids sharing a room. Things began to look up for the family when Lea's father got a job in Minneapolis, where the family moved. Lea's parents divorced when she was six, and her mother decided to maintain the family. This wasn't the easiest job, considering her mother was alcohol-addicted at the time. When she found the strength to quit drinking, she took a job playing the piano and singing in a bar to support Lea and her siblings. When Lea was seven, her mother remarried. Ever since Lea was little, she loved to dance -- ballet to be exact. She would practice three to four hours every day. Her first role was as a mouse in \"The Nutcracker\". After Lea turned fourteen, she had performed in more than 45 ballets on stages, such as The Minnesota Dance Theatre, The Pennsylvania Ballet Company, and The Ballet Repertory. She won scholarships to The American Ballet Theatre and The San Francisco Ballet. At age nineteen, she auditioned for Mikhail Baryshnikov, who later told her that she was \"a beautiful dancer... but too stocky\". Lea knew her dreams had been crushed. At that point, she decided to turn to acting. She began working as a waitress, also making 22 Burger King commercials and a few Twix commercials. She was perfect for these parts simply because she was the average girl-down-the-street, from the Midwest. Everyone who knows her can't believe she was and still is so completely different...trying to be independent and fight against the system. In 1982, Lea made some type of a computer game or interactive movie known as \"Murder, Anyone\". Her first role was in the movie, Jaws 3-D (1983), as a water ski bunny, although she couldn't swim or ski, which she still can't! There, she met Dennis Quaid, who became her fiancée and acting coach. Her next role was in All the Right Moves (1983), where she acted opposite Tom Cruise. Director Michael Chapman was so disappointed with her performance, that he almost fired her. Between 1983 and 1984, Lea appeared in other \"teen\" movies, such as Red Dawn (1984), The Wild Life (1984), and Going Undercover (aka Going Undercover (1985)), and believes it was lucky that, in these movies, they were able to use anyone who could walk and talk! Lea's biggest known accomplishment, and her big break, came from the first Back to the Future (1985). It was the biggest hit of 1985, and Lea was suddenly the most wanted actress. She could have her pick of any role she wanted to take on. She chose Howard the Duck (1986). Although it was a George Lucas production, the critics turned the movie, and Lea, down. Afterwards, director Howard Deutch offered Lea a part in his movie, Some Kind of Wonderful (1987), but she refused. After he urged her to do it, she reconsidered. She won the Young Artist Award for best young actress. During filming, Howard and Lea fell in love, and she called it off with Dennis. She then went on to film The Wizard of Loneliness (1988), which was her first movie as a woman, rather than a youngster. Lea went on to film Back to the Future Part II (1989) and an episode of Tales from the Crypt (1989). She then married Howard Deutch. She continued filming Back to the Future Part III (1990), Montana (1990), and Article 99 (1992). Lea then took a break to stay home with her first born, Madelyn Deutch. She jumped back into acting in Dennis the Menace (1993), where she says she just played herself. Then it was on to The Beverly Hillbillies (1993), Stolen Babies (1993), The Little Rascals (1994), and The Substitute Wife (1994). In 1994, she had her second child, Zoey Deutch. Lea then went into filming The Unspoken Truth (1995). It was then that she was first given the script of a new NBC sitcom, Caroline in the City (1995). It was probably the best decision Lea ever made. She won a People's Choice Award for best actress in a new sitcom. Unfortunately, with all of NBC's problems, Caroline in the City (1995) kept being moved to a worse and worse time slot, giving it horrible ratings. The show ended after only four seasons. Bad ideas from the creators (Julia, etc.) didn't help, either. Lea quickly went onto The Right to Remain Silent (1996), The Unknown Cyclist (1998), and A Will of Their Own (1998). She also guest-starred in the Friends (1994) episode, Friends: The One with the Baby on the Bus (1995), as \"Caroline Duffy\", and on The Larry Sanders Show (1992). Lea also did some stage work, including starring as \"Sally Bowles\" in \"Cabaret\". The show toured and also appeared on Broadway. She then did \"The Vagina Monologues\" in L.A. She had a stint in a dramatic role as a Chief Deputy Assistant District Attorney, \"Camille Paris\", on For the People (2002). Thompson has starred in more than 30 films, 25 television movies, 4 television series, more than 20 ballets, and starred on Broadway in \"Cabaret\". Lea can currently be seen on ABC Family's Peabody Award winning hit show \"Switched at Birth,\" where she acts and directs. Lea's movie credits include: \"All the Right Moves,\" \"Red Dawn,\" \"Some Kind of Wonderful,\" \"The Beverly Hillbillies,\" \"Howard The Duck\"(star and vocals), Clint Eastwood's \"J. Edgar;\" the 2014 Sundance favorite \"Ping Pong Summer;\" and soon to be released \"Left Behind\" starring Nicolas Cage. Lea lives in Los Angeles with her husband of twenty-five years, film/television director Howard Deutch, and their two talented daughters, Madelyn and Zoey, along with many dogs, fish, horses, chickens, a cat, tortoise, and parrot. She supports and often performs for breast cancer, mental health, and Alzheimer's charities. Lea is currently in pre-production on \"The Year of Spectacular Men\", a film written by her daughter Madelyn Deutch, and is writing her first book of essays. Lea Thompson will partner with international Mirrorball Trophy holder Artem Chigvintsev on the 19th season of \"Dancing With The Stars.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5ODcyODUwMl5BMl5BanBnXkFtZTgwMTA3MDg1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000670","name":"Lea Thompson","idIMDB":"nm0000670"},"actorId":"nm0000670","character":"Maggie McFly / Lorraine McFly","urlCharacter":"http://www.imdb.com/character/ch0001832","main":true},{"actorName":"Elisabeth Shue","urlProfile":"http://www.imdb.com/name/nm0000223","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5ODk5OTU3MV5BMl5BanBnXkFtZTcwNjM1NDUxMg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 October 1963","placeOfBirth":" Wilmington, Delaware, USA","birthName":"Elisabeth Judson Shue","height":"5' 2\" (1.57 m)","bio":"Elisabeth Shue was born in Wilmington, Delaware, to Anne Brewster (Wells), who worked for the Chemical Banking Corporation, and James William Shue, a lawyer and real estate developer. She is of German and English ancestry, including descent from Mayflower passengers. Shue's parents divorced while she was in the fourth grade. Owing to the occupational demands of her parents, Shue and her siblings found plenty of time to get into trouble in their suburban neighborhood, but Elisabeth soon enrolled in Wellesley College, an all-female institution which kept her out of trouble. During her studies, she found a way to make a little extra money by acting in television commercials. Elisabeth became a common sight in ads for Burger King, DeBeers diamonds, and Hellman's mayonnaise. In 1984, she landed a role in the The Karate Kid (1984) as the on-screen girlfriend of Ralph Macchio and a role as the teenage daughter of a military family in the short-lived series Call to Glory (1984). At this time, Shue got herself an acting coach and transferred to Harvard, where she began studying political science. She continued her acting work with Adventures in Babysitting (1987), Cocktail (1988), Soapdish (1991) and The Marrying Man (1991). Unfortunately, time was catching up with the impressive girl-next-door. Her brother Andrew Shue had almost eclipsed her own fame by landing a starring role in the hit TV series Melrose Place (1992). It was at this time that Elisabeth took a chance on a low-budget, high-risk project entitled Leaving Las Vegas (1995), directed by Mike Figgis. Her gutsy portrayal of a prostitute mixed up with a suicidal alcoholic paid off as she was recognized with a Best Actress nomination at the Academy Awards that year. This was the turning point of her career. What followed was a barrage of film roles, including The Saint (1997), Woody Allen's Deconstructing Harry (1997), Palmetto (1998) and Hollow Man (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5ODk5OTU3MV5BMl5BanBnXkFtZTcwNjM1NDUxMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000223","name":"Elisabeth Shue","nicknames":["Lisa"],"idIMDB":"nm0000223"},"actorId":"nm0000223","character":"Jennifer Parker","urlCharacter":"http://www.imdb.com/character/ch0001828","main":true},{"actorName":"Matt Clark","urlProfile":"http://www.imdb.com/name/nm0164273","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIzODUzODI3NF5BMl5BanBnXkFtZTcwOTI5MDYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 November 1936","placeOfBirth":" Washington, District of Columbia, USA","bio":"Born In Washington, D.C., Matt grew up in Arlington, Va. Son of Frederick W. Clark, a boat builder and cabinet maker, and Theresa (Costello) Clark, owner and director of a private school in Arlington. Following a two-year stint in the army, Matt attended George Washington University, but dropped out to join a local Washington, D.C. theatre group. He moved to New York in the mid-50's and studied acting at the HB Studio with Herbert Berghof, William Hickey and Frank Naughton. After working at the famous Living Theater and starring in several off-Broadway plays, he moved to California to begin his film career. Matt has appeared in more than 50 feature films, in addition to countless television movies and TV series. He is the director of the film, Da (1988), starring Bernard Hughes, Martin Sheen, and his old acting teacher, Bill Hickey. Matt is father of 4 children: Matthias Clark (musician), Jason Clark (producer), Seth Clark (film editor) and Aimée Clark (producer).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIzODUzODI3NF5BMl5BanBnXkFtZTcwOTI5MDYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0164273","name":"Matt Clark","idIMDB":"nm0164273"},"actorId":"nm0164273","character":"Chester the Bartender","urlCharacter":"http://www.imdb.com/character/ch0001847","main":true},{"actorName":"Richard Dysart","urlProfile":"http://www.imdb.com/name/nm0246004","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNTE2MjI5NDheQTJeQWpwZ15BbWU3MDY1OTk4MDg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1929","placeOfBirth":" Brighton, Massachusetts, USA","birthName":"Richard Allen Dysart","height":"5' 9½\" (1.77 m)","bio":"Richard Dysart served for four years in the Air Force during the Korean War. He was a founding member of the American Conservatory Theatre, San Francisco. He received the Drama Desk Award in 1972 and a Emmy Award in 1992. He was good friends with Diana Muldaur, who played Rosalind Shays on L.A. Law.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNTE2MjI5NDheQTJeQWpwZ15BbWU3MDY1OTk4MDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0246004","name":"Richard Dysart","nicknames":["Dick"],"idIMDB":"nm0246004"},"actorId":"nm0246004","character":"Barbwire Salesman","urlCharacter":"http://www.imdb.com/character/ch0441115","main":true},{"actorName":"Pat Buttram","urlProfile":"http://www.imdb.com/name/nm0125426","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NjQ4MzQ3N15BMl5BanBnXkFtZTcwMjEyMDQwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1915","placeOfBirth":" Addison, Alabama, USA","birthName":"Maxwell Emmett Buttram","height":"6' (1.83 m)","bio":"The son of a circuit-riding Methodist preacher in rural Alabama, Pat Buttram became one of America's best-known comic entertainers. He left Alabama a month before his 18th birthday to attend the 1933 Chicago World's Fair. An announcer from radio station WLS was on hand to interview members of the crowd and settled on Pat as a typical visitor from the South. The interview that followed was anything but typical. Pat made a hit with his hilarious observations on the fair and was immediately offered a job with the station. This led to a long and happy association with the popular \"National Barn Dance\" radio program. During those years Pat met Gene Autry, who took a liking to the young comic and later brought him to Hollywood to replace Smiley Burnette, who had found other work while Gene served in WWII. Together Pat and Gene made many western films and a television series, The Gene Autry Show (1950), which aired from 1950 until 1956. They remained close friends until Pat's death in 1994. In 1952 Pat married actress Sheila Ryan, whom he had met on the set of Mule Train (1950). Over the next 40 years Pat prospered in radio, films and television, making stand-up appearances on The Ed Sullivan Show (1948) (aka \"The Ed Sullivan Show\") and lending his vocal talents to many animated television shows and films, including several Walt Disney features. In the early 1960s he revealed a flair for dramatic acting when Alfred Hitchcock tapped him for roles in two The Alfred Hitchcock Hour (1962) episodes. His big television break came in 1965 with the role of \"Mr. Haney\" in the long-running CBS comedy Green Acres (1965). Throughout his career Pat was in constant demand as a toastmaster and after-dinner speaker, where his agile and sophisticated wit belied his \"countrified\" appearance. In 1982 Pat founded the Golden Boot Awards to honor actors, directors, stunt people and other industry professionals who have made significant contributions to the western film genre. Proceeds from the annual event are donated to the Motion Picture Health and Welfare Fund.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NjQ4MzQ3N15BMl5BanBnXkFtZTcwMjEyMDQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0125426","name":"Pat Buttram","nicknames":["Pat"],"idIMDB":"nm0125426"},"actorId":"nm0125426","character":"Jeb, Saloon Old-Timer #3","urlCharacter":"http://www.imdb.com/character/ch0441116","main":true},{"actorName":"Harry Carey Jr.","urlProfile":"http://www.imdb.com/name/nm0001013","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjAyODY2MV5BMl5BanBnXkFtZTcwNjE4MTg5Nw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1921","placeOfBirth":" Saugus, California, USA","birthName":"Henry George Carey","height":"6' 1\" (1.85 m)","bio":"Harry Carey, Jr., had been reliable character actor for decades, mostly in Westerns, before he retired. He is the son of the actor Harry Carey and the actress Olive Carey. He was born on his parents' 1000-acre ranch near Saugus, in the northwestern part of Los Angeles County, which is now next door to Santa Clarita, a large town that certainly did not exist in 1947 or for decades longer. Thus, the young Harry Carey, Jr., grew up among cattle and horses at the ranch. Because of a large group of Navajo Indians who worked on his parents' ranch, he learned to speak the Navajo language at the same time that he was learning to speak English. During World War II, Carey enlisted in the U.S. Navy, and he served in the Pacific Theater first as a Navy medical corpsman. However, he was transferred back to the United States (against his wishes) to serve under his father's good friend, the director John Ford, in making movies for the Navy (training films)and the O.S.S. (propaganda films). After World War II ended, Carey tried to make a career in singing, but he was not successful at this. Hence, he moved into acting, and after a couple of small acting parts, he was given a chance to work in a motion picture with his father, the John Wayne film Red River (1948). (However, the father and the son did not have any scenes with one another). After the death of Harry Carey, Sr., in 1946, Mr. Ford gave the younger Carey a leading role in the movie that Ford dedicated to the memory of Harry Carey, Sr., in 1948, 3 Godfathers (1948). As a full-fledged member of the noted John Ford Stock Company, Carey, Jr., appeared in many of Mr. Ford's epic Westerns during the following two decades. Carey also starred in a series-within-a-series on TV, The Adventures of Spin and Marty (1955), which was shown as a part of The Mickey Mouse Club (1955). Very boyish looks characterized Carey's early years, but he matured into a strong and familiar character actor over the following four decades, and he acted in scores of films and TV programs in his long career. Carey, Jr., is married to Marilyn Fix Carey, the daughter of the actor Paul Fix.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NjAyODY2MV5BMl5BanBnXkFtZTcwNjE4MTg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001013","name":"Harry Carey Jr.","nicknames":["Dobe"],"idIMDB":"nm0001013"},"actorId":"nm0001013","character":"Zeke, Saloon Old-Timer #2","urlCharacter":"http://www.imdb.com/character/ch0441116","main":true},{"actorName":"Dub Taylor","urlProfile":"http://www.imdb.com/name/nm0852305","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1OTgxMzA0OF5BMl5BanBnXkFtZTcwNDY4ODUwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 February 1907","placeOfBirth":" Richmond, Virginia, USA","birthName":"Walter Clarence Taylor II","bio":"Dub Taylor was born on February 26, 1907 in Richmond, Virginia, USA as Walter Clarence Taylor II. He was an actor, known for Back to the Future Part III (1990), Bonnie and Clyde (1967) and Maverick (1994). He was married to Florence Gertrude Heffernan. He died on October 3, 1994 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1OTgxMzA0OF5BMl5BanBnXkFtZTcwNDY4ODUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0852305","name":"Dub Taylor","idIMDB":"nm0852305"},"actorId":"nm0852305","character":"Levi, Saloon Old-Timer #1","urlCharacter":"http://www.imdb.com/character/ch0441116","main":true},{"actorName":"James Tolkan","urlProfile":"http://www.imdb.com/name/nm0866055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NDcyNzQ4Nl5BMl5BanBnXkFtZTcwMjExNTgyMQ@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1931","placeOfBirth":" Calumet, Michigan, USA","birthName":"James Stewart Tolkan","height":"5' 6\" (1.68 m)","bio":"Fiery, forceful and intimidating character actor James Tolkan has carved out a nice little niche for himself in both movies and television alike as a formidable portrayer of fierce and flinty hard-boiled tough guy types. James Stewart Tolkan was born on June 20, 1931 in Calumet, Michigan. His father, Ralph M. Tolkan, was a cattle dealer. James attended the University of Iowa, Coe College and Eastern Arizona College. After serving a year-long stint in the United States Navy, Tolkan went to New York and studied acting with both Lee Strasberg and Stella Adler at the Actors Studio. Short and bald, with beady, intense eyes, a wiry, compact, muscular build, a gruff, jarring, high-decibel voice, and an aggressive, confrontational, blunt-as-a-battle-ax, rough-around-the-edges demeanor, Tolkan has been often cast as rugged, cynical no-nonsense cops, mean, domineering authority figures, and various ruthless and dangerous criminals. Tolkan first began acting in movies in the late 1960s and was highly effective in two pictures for Sidney Lumet: He was a rabidly homophobic police lieutenant in the superbly gritty Serpico (1973) and a sneaky district attorney in the equally excellent Prince of the City (1981). Best known as the obnoxiously overzealous high school principal Gerard Strickland in the Back to the Future films, Tolkan's other most memorable roles include Napolean in Woody Allen's Love and Death (1975), a ramrod army officer in WarGames (1983), mayor Robert Culp's mordant, wisecracking assistant in Turk 182! (1985), the hard-nosed Stinger in Top Gun (1986), the choleric Detective Lubric in Masters of the Universe (1987), meek mob accountant Numbers in Dick Tracy (1990), and Wesley Snipes' bullish superior in Boiling Point (1993). James has had recurring parts on the television series A Nero Wolfe Mystery (2000) (he also directed two episodes), Mary (1985), Cobra (1993), The Hat Squad (1992) and Remington Steele (1982). Among the television series James has done guest spots on are Naked City (1958), Hill Street Blues (1981), Miami Vice (1984), The Fresh Prince of Bel-Air (1990), The Equalizer (1985), The Wonder Years (1988) and The Pretender (1996). Besides his film and television work, Tolkan has also performed on stage in productions of such plays as \"Between Two Thieves\", \"Wings\", \"One Tennis Shoe\", \"The Front Page\", \"Twelve Angry Men\", \"Full Circle\", \"The Tempest\", \"Golda\", \"The Silent Partner\" and the original 1984 Broadway production of David Mamet's \"Glengary, Glen Ross\". When he isn't acting, James Tolkan spends his spare time collecting folk art.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NDcyNzQ4Nl5BMl5BanBnXkFtZTcwMjExNTgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0866055","name":"James Tolkan","idIMDB":"nm0866055"},"actorId":"nm0866055","character":"Marshal James Strickland","urlCharacter":"http://www.imdb.com/character/ch0041860","main":true},{"actorName":"Marc McClure","urlProfile":"http://www.imdb.com/name/nm0566013","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0OTk5MjUyMl5BMl5BanBnXkFtZTYwNDc4Njgy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1957","placeOfBirth":" San Mateo, California, USA","height":"5' 10\" (1.78 m)","bio":"Marc McClure was born on March 31, 1957 in San Mateo, California, USA. He is an actor, known for Back to the Future (1985), Back to the Future Part III (1990) and Apollo 13 (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0OTk5MjUyMl5BMl5BanBnXkFtZTYwNDc4Njgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0566013","name":"Marc McClure","idIMDB":"nm0566013"},"actorId":"nm0566013","character":"Dave McFly","urlCharacter":"http://www.imdb.com/character/ch0001842","main":true},{"actorName":"Wendie Jo Sperber","urlProfile":"http://www.imdb.com/name/nm0818274","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MTk1MDI0OF5BMl5BanBnXkFtZTcwODczNTcyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1958","placeOfBirth":" Hollywood, Los Angeles, California, USA","bio":"Though she was known best for drawing laughs as whiny, excitable characters throughout her raucous film and TV career, actress/comedienne Wendie Jo Sperber showed a brave, compassionate and humane side in the last years of her life. The Los Angeles-born performer developed a driving passion for acting in her teen years. She went on to attend the Summer Drama Workshop at California State University, Northridge. Producer Allan Carr discovered this comic bundle when she invited him to see her in an L.A. stage review. He gave her an unbilled part in the John Travolta/Olivia Newton-John smash musical Grease (1978) and she was off and running. Other films quickly fell into place, notably I Wanna Hold Your Hand (1978) as a no-holds-barred Beatles fanatic, and the role of Linda McFly in Back to the Future (1985) and one of its sequels. Other films included Corvette Summer (1978), Steven Spielberg's 1941 (1979) and Bachelor Party (1984) starring Tom Hanks. Some of her tongue-in-cheek film roles were beneath her, particularly when they used her excess poundage as the butt of a cruel joke, but the actress proved quite game in such lowbrow, youth-oriented comedies as Moving Violations (1985) and Stewardess School (1986). It was with a then fairly unknown Hanks and Peter Scolari that she earned her biggest laughs with the two-year run of Bosom Buddies (1980), which launched a number of inferior drag film/sitcoms. She also had series co-leads in Private Benjamin (1981), Women in Prison (1987), the plus-sized Babes (1990) and Hearts Afire (1992). In between were roles on the L.A. stage, including \"Pizza Man,\" \"Isn't It Romantic,\" \"Reality and Other Nightmares\" and Shakespeare's \"As You Like It\" starring Ron Silver. At age 39, Wendie was diagnosed with breast cancer. While her career momentum was certainly compromised, the comedienne continued to pursue roles. She even appeared on a poignant breast cancer episode of Murphy Brown (1988). Her cancer went into remission at one point but returned with a vengeance in 2002 and spread throughout her body. Instead of retreating, Wendie instead reached out and founded weSPARK Cancer Support Center in Sherman Oaks, California, in which free services, including support groups, information on the latest research and classes, provided invaluable aid to cancer patients, their families and friends. Her selfless determination throughout her illness to help others did not go unnoticed, earning several honors. Eight years later, on November 29, 2005, Wendie lost her battle. She was survived by her parents and two children from a former marriage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MTk1MDI0OF5BMl5BanBnXkFtZTcwODczNTcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0818274","name":"Wendie Jo Sperber","idIMDB":"nm0818274"},"actorId":"nm0818274","character":"Linda McFly","urlCharacter":"http://www.imdb.com/character/ch0001840","main":true},{"actorName":"Jeffrey Weissman","urlProfile":"http://www.imdb.com/name/nm0919297","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYwNzE2MTkwM15BMl5BanBnXkFtZTgwODI0NTE0ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1958","placeOfBirth":"","height":"5' 9\" (1.75 m)","bio":"Jeffrey Weissman has been performing as an actor since taking to the stage in 1972. He started in film in 1977, Jeffrey has co-starred in dozens of film and television productions. He had been screen testing for leads in various films during the early 1980's, and landed his first co-star role in 1982 in George Miller's \"Nightmare at 30,000 Feet\" episode of Twilight Zone the Movie. Jeffrey is best known for playing Teddy Conway in Clint Eastwood's Pale Rider (1985) and taking over the George McFly role in the \"Back to the Future\" sequels. His recent working indie films have garnered him raves from his comedic turn in \"corked!\" as an ocd wine maker, and his dramatic work in several features. Jeffrey guest starred on many television shows, such as Scarecrow and Mrs King, Max Headroom, Dallas, Wallace and Ladmo, Saved By The Bell, Diagnosis Murder (1993) and the Man Show. Jeffrey has continued in theater and film while venturing into theme parks, trade shows, improv and sketch shows with a great deal of success. He has developed characters and shows at renaissance fairs since 1973. In 1987 he became \"Stan Laurel\" for Universal Studios, Hollywood. While at Universal, he wrote shows for the parks, and promotional copy for hundreds of appearances. Jeffrey developed accurate portrayals of Chaplin's \"Little Tramp\", Groucho Marx and other characters. He's entertained at Six Flags, Disneyland, conventions, trade shows, television and radio appearances around the world (he can greet in over a dozen different languages). In 2000, Jeffrey directed three shows for the billion dollar Universal Theme Park in Osaka. He also trained the \"walk around\" entertainers to meeting the challenges of directing a multinational cast for an international audience. Jeffrey is writing, directing and producing film. He mentors writers for their scripts to resonate truth and Jeffrey has taught classes, seminars and lectures on \"the art of making it as an actor\" at universities, city colleges, high schools and fine-arts schools. He coaches and trains professionals and non-professionals in the art of improvisation, clowning, developing characters, stage, television, film and environmental acting and entertainment. Jeffrey was founder and artistic director of the Flying Penguins (formerly the Comedy Omelet) improv troupe, and he helped develop Los Angeles Theater Sports, now known as \"Impro Theater\" in its 21th year. He performed in the Second City Alumni jams at the Ashgrove, and performed for a year with the Laugh Factory All-star Improv Jam (aka \"Wrought Irony\"). He was a varsity member of Los Angeles Theater Sports, performing and directing with LATS and KIDPROV. Jeffrey co-wrote and directed the Laurel and Hardy Music and Magic Show that had an extensive run on the Star Cruise Line in the South China Sea, et all. He is an honorary member of four international \"Sons of the Desert\" tents, the official Laurel & Hardy fan club. He has become the #1 Chaplin for the Niles Essenay Studios Museum's \"Chaplin Days\", where Chaplin made a handful of films early in his career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYwNzE2MTkwM15BMl5BanBnXkFtZTgwODI0NTE0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0919297","name":"Jeffrey Weissman","idIMDB":"nm0919297"},"actorId":"nm0919297","character":"George McFly","urlCharacter":"http://www.imdb.com/character/ch0001830","main":true}],"seasons":[],"idIMDB":"tt0099088","urlIMDB":"http://www.imdb.com/title/tt0099088","business":{"budget":{"money":"$40,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$19,089,645","country":"USA","day":"27","month":"05","year":"1990","remarks":"2,070 Screens"}],"gross":[{"money":"$243,700,000 (Worldwide)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"SEK","country":"12,596,575","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$23,703,060","country":"USA","day":"28","month":"05","year":"1990","remarks":"2 Screens"}],"admissions":[{"money":"2,895,968","country":"UK","day":"31","month":"12","year":"1990","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"29","month":"08","year":"1989","remarks":null},{"money":null,"country":null,"day":"12","month":"01","year":"1990","remarks":null}],"copyrightHolder":"Copyright © 1990 Universal City Studios, Inc. and U-Drive Productions. Inc. All rights reserved."},"technical":{"runtime":["1 hr 58 min (118 min)"],"soundMix":["70 mm 6-Track (70 mm prints)","Dolby SR (35 mm prints)"],"color":["Color"],"aspectRatio":["1.37 : 1 (negative ratio)","1.85 : 1 (intended ratio)","1.85 : 1 (negative ratio, special effects)"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, USA"],"filmLength":["3,240 m (Sweden, cut version)","3,250 m (Sweden, uncut version)"],"negativeFormat":["35 mm (horizontal) (special effects)","35 mm"],"cinematographicProcess":["VistaVision (special effects)","Spherical"],"printedFilmFormat":["35 mm","70 mm (blow-up)"]},"rating":"7.4","metascore":"55","filmingLocations":[{"location":"161 N. Magnolia Avenue, Monrovia, California, USA"}],"rated":"PG","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2011","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best DVD Collection","names":[{"name":"Back to the Future","id":"tt0088763","role":null},{"name":"Back to the Future Part II","id":"tt0096874","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2003","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best DVD Classic Film Release","names":[{"name":"Back to the Future","id":"tt0088763","role":null},{"name":"Back to the Future Part II","id":"tt0096874","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1991","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Thomas F. Wilson","id":"nm0001855","role":null}]},{"category":"Best Music","names":[{"name":"Alan Silvestri","id":"nm0006293","role":null}]}]},{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Science Fiction Film","names":[]},{"category":"Best Supporting Actress","names":[{"name":"Mary Steenburgen","id":"nm0005460","role":null}]},{"category":"Best Director","names":[{"name":"Robert Zemeckis","id":"nm0000709","role":null}]},{"category":"Best Costumes","names":[{"name":"Joanna Johnston","id":"nm0426693","role":null}]}]}]},{"award":"BMI Film & TV Awards 1991","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"","names":[{"name":"Alan Silvestri","id":"nm0006293","role":null}]}]}]},{"award":"DVD Exclusive Awards 2003","titlesAwards":[{"titleAwardOutcome":"Won AOL Movies DVD Premiere Award","categories":[{"category":"Best Special Edition of the Year - Classic Movie","names":[{"name":"Back to the Future","id":"tt0088763","role":null},{"name":"Back to the Future Part II","id":"tt0096874","role":null}]}]},{"titleAwardOutcome":"Nominated DVD Premiere Award","categories":[{"category":"Original Retrospective Documentary, Library Release","names":[{"name":"Laurent Bouzereau","id":"nm0100522","role":null},{"name":"Back to the Future","id":"tt0088763","role":null},{"name":"Back to the Future Part II","id":"tt0096874","role":null}]}]}]},{"award":"Golden Schmoes Awards 2010","titlesAwards":[{"titleAwardOutcome":"Won Golden Schmoes","categories":[{"category":"Best DVD/Blu-Ray of the Year","names":[{"name":"Back to the Future","id":"tt0088763","role":null},{"name":"Back to the Future Part II","id":"tt0096874","role":null}]}]}]},{"award":"Golden Schmoes Awards 2002","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Schmoes","categories":[{"category":"Best DVD of the Year","names":[{"name":"Back to the Future","id":"tt0088763","role":null},{"name":"Back to the Future Part II","id":"tt0096874","role":null}]}]}]},{"award":"Hugo Awards 1991","titlesAwards":[{"titleAwardOutcome":"Nominated Hugo","categories":[{"category":"Best Dramatic Presentation","names":[{"name":"Robert Zemeckis","id":"nm0000709","role":"story/based on characters created by/director"},{"name":"Bob Gale","id":"nm0301826","role":"story/screenplaybased on characters created by"}]}]}]},{"award":"Young Artist Awards 1991","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Most Entertaining Family Youth Motion Picture - Comedy/Action","names":[]}]}]}],"votes":"303,588","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"},{"idCompany":"co0009119","name":"Amblin Entertainment"},{"idCompany":"co0010110","name":"U-Drive Productions"}],"keywords":{"keywords":["letter","tombstone","band","dog","time machine","cemetery","gunfight","library","blacksmith","teacher","outlaw","woman","female school teacher","time traveller","saving a life","steam engine","locomotive","transforming train","same actor playing two characters simultaneously on screen","same actor playing two characters","actress playing dual role","actor playing dual role","time travel comedy","suburb","reading a letter aloud","famous score","camera","film camera","steampunk comedy","woman riding a horse","face slap","buckboard","runaway buckboard","spittoon","firing a gun into the air","adult actor playing teenage boy","teenager","intergenerational friendship","17 year old","the end","porch swing","ravine","train bridge","steam locomotive","walkie talkie","purple dress","car on train tracks","train whistle","stealing a train","train hijack","climbing onto a moving train","steam train","horseback train chase","horseback riding","chases on horseback","punched in the face","colt peacemaker revolver","revolver","kicking gun out hand","saved from hanging","emergency stop","peg on one's nose","headstone","passed out drunk","year 1955","year 1985","handwritten letter","character says i love you","falling down a hill","town dance","white hair","female slaps a male","woman slaps a man","falling on bed sobbing","truth taken as a lie","bullet dancing","roman numbered sequel","six word title","roman numeral in title","street shootout","20th century","19th century","bulletproof vest","top hat","undertaker","reference to robert deniro","long johns","colt 45","derringer","reference to jules verne","disgruntled customer","lifting someone into the air","sliding glass down bar","child","waking up in strange surroundings","bullets fired at feet","train explosion","family relationships","dragged by a horse","reference to clint eastwood","numbered sequel","modern western","shot back to back","drunkenness","risking one's life for love","girl next door","hanging","part of trilogy","teenage boy","kiss","irish","gun","farm","clock","baby","alternate history","altering history","animal in cast credits","windmill","running out of gas","breakfast machine","1980s","california","blockbuster","third part","teenage hero","delorean dmc 12","train","futuristic train","native american attack","sequel","bear","mistaken identity","1950s","monument valley","small town","train wreck","computer cracker","street racing","automobile","lynching","dual role","product placement","chess","car accident","manure","train robbery","inventor","skateboard","model train","moonwalk dancing","time travel","photograph","flying train","frisbee","1880s","drive in theatre","festival","mad scientist","flying car","saloon","car trouble","destiny","love at first sight","marksman","irish american","rube goldberg machine","dancing","shooting gallery","cavalry","fireplace","abandoned mine"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:50:31"}}