{"data":{"movies":[{"title":"It Should Happen to You","originalTitle":"","year":"1954","releaseDate":"195403","directors":[{"name":"George Cukor","id":"nm0002030"}],"writers":[{"name":"Garson Kanin","id":"nm0437717"}],"runtime":"86 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTUwYTU5ZmQtYjM0MS00Mjg1LTgwNjMtZDg2N2Y3YjM0ZjhkXkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"Gladys Glover has just lost her modelling job when she meets filmmaker Pete Sheppard shooting a documentary in Central Park. For Pete it's love at first sight, but Gladys has her mind on other things -- like making a name for herself. Through a fluke of advertising she winds up with her name plastered over 10 billboards throughout city. Suddenly all of New York is clamoring for Gladys Glover without knowing why and playboy Evan Adams III is making a play for Gladys that even Pete knows will be hard to beat.","simplePlot":"Gladys Glover has just lost her modelling job when she meets filmmaker Pete Sheppard shooting a documentary in Central Park. For Pete it's love at first sight, but Gladys has her mind on ... ","actors":[{"actorName":"Judy Holliday","urlProfile":"http://www.imdb.com/name/nm0391062","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MTEzOTQ1NV5BMl5BanBnXkFtZTcwNDIyOTkxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1921","placeOfBirth":" New York City, New York, USA","birthName":"Judith Tuvim","height":"5' 8\" (1.73 m)","bio":"Judy Holliday was born Judith Tuvim in New York City on June 21, 1921. Her mother, a piano teacher, was attending a play when she went into labor and made it to the hospital just in time. Judy was an only child. By the age of four, her mother had her enrolled in ballet school which fostered a life-long interest in show business. Two years later her parents divorced. In high school, Judy began to develop an interest in theater. She appeared in several high school plays. After graduation, she got a job in the Orson Welles Mercury Theater as a switchboard operator. Judy worked her way on the stage with appearance in Boston, Philadelphia, Washington, D.C. and New York City. Judy toured on the nightclub circuit with a group called \"The Revuers\" founded by Betty Comden and Adolph Green. She went to Hollywood to make her first foray into the film world in Greenwich Village (1944). Most of her scenes ended up on the cutting room floor. Disappointed, but not discouraged, Judy earned two more roles that year in Something for the Boys (1944) and Winged Victory (1944). In the latter, Judy had a few lines of dialogue. Judy returned to New York to continue her stage career. She returned to Hollywood after five years to appear in Adam's Rib (1949) as Doris Attinger opposite screen greats Katharine Hepburn, Spencer Tracy and Tom Ewell. With her success in that role, Judy was signed to play Billie Dawn in Born Yesterday (1950), a role which she originated on Broadway. She was nominated for and won the best actress Oscar for her performance. After filming The Marrying Kind (1952), Judy was summoned before the Un-American Activities Committee to testify about her political affiliations. Fortunately for her, she was not blacklisted as were many of her counterparts, but damage was done. Her film career was curtailed somewhat, but rebounded. She continued with her stage and musical efforts, but with limited time on the screen. After filming The Solid Gold Cadillac (1956), she was off-screen for four years. Her last film was the MGM production of Bells Are Ringing (1960) with Dean Martin and it was one of her best. Judy died three weeks before her 44th birthday in New York City on June 7, 1965.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MTEzOTQ1NV5BMl5BanBnXkFtZTcwNDIyOTkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0391062","name":"Judy Holliday","idIMDB":"nm0391062"},"actorId":"nm0391062","character":"Gladys Glover","urlCharacter":"http://www.imdb.com/character/ch0093371","main":true},{"actorName":"Peter Lawford","urlProfile":"http://www.imdb.com/name/nm0492444","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MTIzNjczNl5BMl5BanBnXkFtZTYwNDMwNzM2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1923","placeOfBirth":" London, England, UK","birthName":"Peter Sydney Ernest Aylen","height":"6' (1.83 m)","bio":"Born in London, England and son of a British World War I hero, Lawford had spent most of his childhood in Paris, France and began his acting career at a very young age. His parents were not married when their son was born. As a result of the scandal, The Lawfords fled to America. As a young child, the young Peter injured his arm by in his own words, \"attempt to run through a glass door.\" Lawford's arm was badly injured however, the doctors could save it. The injury was so bad, it was slightly deformed and bothered him throughout life. But such was his luck, the injury kept him off the draft for World War II, which became the biggest boon of his acting career. When Lawford was signed to MGM, his mother approached studio head, Louis B. Mayer, to pay her a salary as her son's personal assistant. However, Mayer declined. She then claimed that her son was \"homosexual\" and needed to be \"supervised\". This damaged the relationship between her and her son. Lawford starred in his first major movie called A Yank at Eton (1942) , co-starring Mickey Rooney, Ian Hunter and Freddie Bartholomew. His performance was widely praised. During this time, Lawford started to get more leads when major MGM star Clark Gable was drafted into the war. Later, it was Good News (1947), co-starring June Allyson that became Lawford's greatest claim to fame. Probably Lawford's most controversial affair, amongst many, was with African-American actress Dorothy Dandridge. It was rumored that both Lawford and Dandridge were planning to get married but canceled fearing it would jeopardize their careers. Besides his successful career and being a socialite, Lawford was also part of the Rat Pack, with Dean Martin, Frank Sinatra, Joey Bishop and Sammy Davis Jr. .","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MTIzNjczNl5BMl5BanBnXkFtZTYwNDMwNzM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0492444","name":"Peter Lawford","nicknames":["Brother-in-Lawford"],"idIMDB":"nm0492444"},"actorId":"nm0492444","character":"Evan Adams III","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Lemmon","urlProfile":"http://www.imdb.com/name/nm0000493","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NTE3ODE1N15BMl5BanBnXkFtZTYwOTU1MTM2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1925","placeOfBirth":" Newton, Massachusetts, USA","birthName":"John Uhler Lemmon III","height":"5' 9\" (1.75 m)","bio":"Jack Lemmon was born in Newton, Massachusetts, to Mildred Burgess LaRue (Noel) and John Uhler Lemmon, Jr., the president of a doughnut company. His ancestry included Irish (from his paternal grandmother) and English. Jack attended Ward Elementary near his Newton, MA home. At age 9 he was sent to Rivers Country Day School, then located in nearby Brookline. After RCDS, he went to high school at Phillips Andover Academy. Jack was a member of the Harvard class of 1947, where he was in Navy ROTC and the Dramatic Club. After service as a Navy ensign, he worked in a beer hall (playing piano), on radio, off Broadway, TV and Broadway. His movie debut was with Judy Holliday in It Should Happen to You (1954). He won Best Supporting Actor as Ensign Pulver in Mister Roberts (1955). He received nominations in comedy (Some Like It Hot (1959), The Apartment (1960)) and drama (Days of Wine and Roses (1962), The China Syndrome (1979), Un fils pour l'été (1980) and Missing (1982)). He won the Best Actor Oscar for Save the Tiger (1973) and the Cannes Best Actor award for \"Syndrome\" and \"Missing\". He made his debut as a director with Kotch (1971) and in 1985 on Broadway in \"Long Day's Journey into Night\". In 1988 he received the Life Achievement Award of the American Film Institute.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NTE3ODE1N15BMl5BanBnXkFtZTYwOTU1MTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000493","name":"Jack Lemmon","idIMDB":"nm0000493"},"actorId":"nm0000493","character":"Pete Sheppard","urlCharacter":"http://www.imdb.com/character/ch0093306","main":true},{"actorName":"Michael O'Shea","urlProfile":"http://www.imdb.com/name/nm0642671","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NDUwMjg3OF5BMl5BanBnXkFtZTgwMjI0Nzk1MDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 March 1906","placeOfBirth":" Hartford, Connecticut, USA","bio":"His five brothers all became policemen, encouraged on by their father, but Hartford-born Irish-American Michael O'Shea defied family tradition and turned to acting. Born on March 17, 1906, Michael dropped out of school at age 12 and went the vaudeville route, touring with his boxing idol Jack Johnson's show. He tried everything. During the Prohibition years, he became a comedian and emcee at speakeasies. He put together his own dance band, \"Michael O'Shea and His Stationary Gypsies\", and later broke into radio. His career advanced with the legit stage, where he was billed for a time as \"Eddie O'Shea\". His noticeable performance in \"The Eve of St. Mark\" in 1942 led to a string of '40s films, notably as Barbara Stanwyck's boyfriend comic in Lady of Burlesque (1943). He also managed great reviews repeating his stage role in the film The Eve of St. Mark (1944). Other WWII-era films included the leading role opposite Anne Shirley in the romantic drama Man from Frisco (1944); a military man lead in the musical Something for the Boys (1944) in which he managed to show off a little of his Irish tenor in the song \"Wouldn't It Be Nice?\" with Vivian Blaine, Phil Silvers and Carmen Miranda; the male co-star in the Sonja Henie skating vehicle It's a Pleasure (1945); and lead and support roles in a string of crime dramas including Circumstantial Evidence (1945), Mr. District Attorney (1947), Violence (1947), Parole, Inc. (1948) and The Underworld Story (1950). The father of two, Michael met his second wife, the beautiful actress Virginia Mayo, during the time he was filming the title role of Jack London (1943). They married four years later and had one daughter. The couple subsequently appeared on the stock stage together in such productions as \"George Washington Slept Here\", \"Tunnel of Love\" and Fiorello! One of those fine talents who did not make a big name for himself, Michael was out of films by 1952, but revitalized on TV and starred in the mild TV sitcom It's a Great Life (1954) also starring James Dunn, William Bishop, Frances Bavier and Barbara Bates playing a former GI trying to find a civilian job. Interestingly, Michael became a plainclothes operative for the CIA after retiring from show business in the 1960s. He died suddenly of a heart attack in 1973.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NDUwMjg3OF5BMl5BanBnXkFtZTgwMjI0Nzk1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0642671","name":"Michael O'Shea","idIMDB":"nm0642671"},"actorId":"nm0642671","character":"Brod Clinton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vaughn Taylor","urlProfile":"http://www.imdb.com/name/nm0853299","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjQzNTUxMl5BMl5BanBnXkFtZTcwNzc5ODkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1911","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Vaughn Everett Taylor","bio":"Reedy, balding, often bespectacled American character actor with pencil-thin moustache, once described as the man with TV's 'most deceptive face'. He looked like - and was - a certified public accountant, graduate from Northeastern University. A struggling actor in his youth, he worked in stock, tent shows and on radio. After army service in World War II, he became a prolific performer in early anthology series on television (eg. Kraft Theatre (1947) and Robert Montgomery Presents (1950)), though he continued to alternate these with appearances on the New York stage. He was also glimpsed in movies, invariably in small supporting roles, most notably as Deacon Davis in Cat on a Hot Tin Roof (1958), and as George Lowery, boss to doomed Janet Leigh in Psycho (1960). Vaughn reserved his best for the small screen, where he showed his versatility in genial or waspish roles, often as doctors, judges and bankers. He was capable of portraying benevolence as easily as taking on the mantle of greedy or corrupt attorneys, or second-string grifters (his repertoire even included vicious real-life gangster, George 'Pa' Barker, in an episode of The Untouchables (1959)). Among his numerous TV credits, his five journeys into The Twilight Zone (1959) stand out in particular. Severe spinal deterioration brought about Vaughn's retirement from acting in 1976. His wife of many years, Ruth Moss, a fellow graduate of the Leland Powers School, was a noted Boston radio personality and Broadway actress.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjQzNTUxMl5BMl5BanBnXkFtZTcwNzc5ODkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0853299","name":"Vaughn Taylor","idIMDB":"nm0853299"},"actorId":"nm0853299","character":"Entrikin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Connie Gilchrist","urlProfile":"http://www.imdb.com/name/nm0318349","urlPhoto":"","biography":{"dateOfBirth":"2 February 1901","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Rose Constance Gilchrist","bio":"With more than two decades of stage experience in France, England and on Broadway behind her, this moon-faced, heavy-set character actress first entered films in 1940. But no matter a film's genre - contemporary drama, historical costumer or shoot 'em up western - her Brooklyn roots always sounded through.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0318349","name":"Connie Gilchrist","idIMDB":"nm0318349"},"actorId":"nm0318349","character":"Mrs. Riker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Walter Klavun","urlProfile":"http://www.imdb.com/name/nm0458479","urlPhoto":"","biography":{"dateOfBirth":"8 May 1906","placeOfBirth":" New York City, New York, USA","bio":"Walter Klavun was born on May 8, 1906 in New York City, New York, USA. He was an actor, known for It Should Happen to You (1954), Silent Night, Bloody Night (1972) and The Brink's Job (1978). He died on April 14, 1984 in New York City.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0458479","name":"Walter Klavun","idIMDB":"nm0458479"},"actorId":"nm0458479","character":"Bert Piazza","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Whit Bissell","urlProfile":"http://www.imdb.com/name/nm0000946","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNzAwOTU4NTdeQTJeQWpwZ15BbWU3MDE0NDI2MDg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1909","placeOfBirth":" New York City, New York, USA","birthName":"Whitner Nutting Bissell","height":"5' 8\" (1.73 m)","bio":"Whit Bissell came to Hollywood in the 1940s, and by the time he retired he had appeared in more than 200 movies and scores of TV series. He is best known for playing the evil scientist who turned Michael Landon into a half beast in the 1957 cult classic film I Was a Teenage Werewolf (1957). Bissell specialized in playing doctors, military officers and other authority figures. On television he was a regular on Bachelor Father (1957) and The Time Tunnel (1966). He also served on the Screen Actors Guild board of directors for 18 years and represented the actors branch in the Academy of Motion Picture Arts and Sciences board of governors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNzAwOTU4NTdeQTJeQWpwZ15BbWU3MDE0NDI2MDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000946","name":"Whit Bissell","idIMDB":"nm0000946"},"actorId":"nm0000946","character":"Robert Grau","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Constance Bennett","urlProfile":"http://www.imdb.com/name/nm0000909","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDIxMDg5NV5BMl5BanBnXkFtZTYwNDUyNjU2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1904","placeOfBirth":" New York City, New York, USA","birthName":"Constance Campbell Bennett","height":"5' 4\" (1.63 m)","bio":"Independent, outspoken Constance Bennett, the first of the Bennett sisters to enter films, appeared in New York-produced silents before a chance meeting with Samuel Goldwyn led to her Hollywood debut in Cytherea (1924). She abandoned a burgeoning career in silents for marriage to Philip Plant in 1925; after they divorced, she achieved stardom in talkies from 1929. The hit Common Clay (1930) launched her in a series of loose lady and unwed mother roles, but she really excelled in such sophisticated comedies as The Affairs of Cellini (1934), Ladies in Love (1936), Topper (1937) and Merrily We Live (1938). Her classy blonde looks, husky voice and unerring fashion sense gave her a distinctive style. In the 1940s she made fewer films, working in radio and theatre; shrewd in business, she invested wisely and started businesses marketing women's wear and cosmetics. Loving conflict, she feuded with the press and enjoyed lawsuits. Her last marriage, to a U.S. Air Force colonel, was happy and gave her a key role coordinating shows flown to Europe for occupying troops (1946-48) and the Berlin Airlift (1948-49), winning her military honors. Still young-looking, she died suddenly at age 60 shortly after completing the last of her 57 films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MDIxMDg5NV5BMl5BanBnXkFtZTYwNDUyNjU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000909","name":"Constance Bennett","idIMDB":"nm0000909"},"actorId":"nm0000909","character":"Guest Panelist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ilka Chase","urlProfile":"http://www.imdb.com/name/nm0153772","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmZjYzczMWItYTlmNC00ZWFhLWIzZGItYzQwOWM5NWQ2ODc0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1905","placeOfBirth":" New York City, New York, USA","height":"5' 6\" (1.68 m)","bio":"The daughter of Vogue's editor-in-chief for 40 years, Edna Woolman Chase, Ilka was named after a Hungarian friend of her mother's. She went to school in France and later acted in stock with Rube Miller in New York. Her first appearance on Broadway was as a maid in 'The Red Falcon' in 1924. After co-starring in her next play, the mystery 'Shall we Join the Ladies?' (with Leslie Howard, 1925), she established a reputation as an intelligent leading lady of the stage. She went on to have further successes in prestigious plays by Philip Barry ('The Animal Kingdom', 1932, as Grace Macomber), Thomas Mitchell ('Forsaking all Others', 1933, with Tallulah Bankhead), Eugene O'Neill ('Days Without End', 1934, as Lucy Hillman) and Clare Boothe Luce ('The Women', 1936, as Sylvia Fowler). In 1944, she starred in her adaptation of her novel 'In Bed we Cry', playing an actress somewhat inspired by, or modeled upon, her own experiences and personality. Ilka was known as much for her acting ability, as for her acidulous wit and sometimes scathing criticism, leveled at her contemporaries in general and her peers in particular. A member of the social elite herself, she used her insight in her best-selling autobiography, 'Past Imperfect', written in 1942. The book brought her nationwide fame, taking gratuitous pot-shots at writers, actors and socialites alike. It eventually led to her hosting a radio program, 'Luncheon at the Waldorf'. Although she appeared in several motion pictures, few came close to showcasing her caustic personality. The exception was, perhaps, The Big Knife (1955), in which she portrayed a Hedda Hopper-like newspaper columnist. An earlier role of note included Now, Voyager (1942). Bosley Crowther thought her 'cool' in Ocean's 11 (1960). Ilka Chase was actively involved in a number of charities and was a staunch advocate of wildlife preservation and protection.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmZjYzczMWItYTlmNC00ZWFhLWIzZGItYzQwOWM5NWQ2ODc0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0153772","name":"Ilka Chase","idIMDB":"nm0153772"},"actorId":"nm0153772","character":"Guest Panelist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wendy Barrie","urlProfile":"http://www.imdb.com/name/nm0057412","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwODc4ODM3MV5BMl5BanBnXkFtZTgwNDM0NzY5MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1912","placeOfBirth":" London, England, UK","birthName":"Marguerite Wendy Jenkin","height":"5' 5\" (1.65 m)","bio":"Wendy Barrie was born in Hong Kong of English-Irish parentage, the daughter of King's Counsel F.C. Jenkins. She received her education at a convent school in England and a finishing school in Switzerland. After working in a beauty parlour, she made her first foray into acting on the London stage in \"Wonder Bar\" (1930). Two years later, she was \"discovered\" by producer Alexander Korda while lunching at the Savoy Grill. After successful screen tests, she was famously cast in the role of \"Jane Seymour\", the second of the six wives at the centre of The Private Life of Henry VIII. (1933), starring Charles Laughton. Hollywood soon beckoned and Wendy left England for America in 1934. During the next decade and a bit, she found regular employment at Paramount (1935), Universal (1936-38) and RKO (1938-42). A blonde, vivacious young woman with a certain innocent charm and an instinctive acting ability, she was initially cast in ingenue roles in minor films, until the grittier role of \"Kay Burton\" in the social drama Dead End (1937) came along. Wendy's film career henceforth alternated between supporting roles in bigger pictures and leads in B-movies. From the late 1930s, she had more varied outings: as a gangster's moll in the crime melodrama I Am the Law (1938), as a plane crash victim in Five Came Back (1939), and as \"Beryl Stapleton\", Richard Greene's love interest in The Hound of the Baskervilles (1939), with Basil Rathbone as \"Sherlock Holmes\". By the 1940s, her star had faded. This was partly due to bad publicity generated by her real-life role as mistress of notorious mobster Bugsy Siegel. Wendy was effectively relegated to appearing in various entries in \"The Saint\" and \"Falcon\" series at RKO, and, after a number of other decidedly mediocre films, started out on a successful new career as television host of her own pioneering talk show, Picture This (1948) (1948-50). Her relaxed, informal style brought her great popularity and plaudits from television critics like Jack Gould of the New York Times. Wendy's other claim to fame was as one of the first celebrities to make television commercials, famously with Revlon, on The $64,000 Question. During the 1960s, she also broadcast her own radio interview show from the Biltmore Hotel. She was actively involved in various charities and was known to attend as guest speaker at philanthropic functions, freely giving of her time without remuneration. In the mid '70s, Wendy suffered a stroke which affected her mental state and she spent the last years of her life at a nursing home in Englewood, New Jersey, where she died in February 1978, aged 65.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwODc4ODM3MV5BMl5BanBnXkFtZTgwNDM0NzY5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0057412","name":"Wendy Barrie","idIMDB":"nm0057412"},"actorId":"nm0057412","character":"Guest Panelist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Melville Cooper","urlProfile":"http://www.imdb.com/name/nm0178259","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjNlYWVlODUtMGQ3My00YjAyLWI1MTItNTBjZmU4NDhmMGJmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1896","placeOfBirth":" Birmingham, England, UK","birthName":"George Melville Cooper","bio":"Born George Melville Cooper on October 15, 1896, in Birmingham England, he was the son of non-professionals W.C.J. and Frances (Brennan) Cooper, and attended various English public schools, including King Edward's School in Birmingham. Attracted to the stage as a teenager, he made his debut at Stratford-on-Avon at age 18, but his young career was interrupted by World War I. Serving in a Scottish regiment on the Western Front, he was captured and made prisoner of war for a time by the Germans. Following the war Cooper returned to the theatre and earned good reviews in the play \"The Farmer's Wife\" in 1921. He made his official London debut with a production of \"Back to Methuselah in 1924, and furthered his career on stage with roles in \"The Third Finger\" (1927) and \"Journey's End\" (1929). He turned to films in middle age with the English entry Black Coffee (1931) and, after supporting roles in the popular costumers The Private Life of Don Juan (1934) and The Scarlet Pimpernel (1934), decided to cross the waters to seek work in America. Taking his first Broadway curtain call with \"Laburnum Grove\" (1935), he also appeared in \"Jubilee\" (1935) and \"Tovarich\" (1937) and subsequently became a sometime stage director, as in the case of the 1947 production of \"We Love a Lassie.\" In Hollywood Cooper was effectively cast as ineffectual types and played in a number of \"A\" pictures. Giving great snob appeal, he made a most reliable and disdainful butler, chauffeur or doorman in such films as The Bishop Misbehaves (1935), Four's a Crowd (1938), Too Many Husbands (1940), And Baby Makes Three (1949) and The Petty Girl (1950). More quality roles, however, wormed their way outside this stereotype with his blundering and cowardly Sheriff of Nottingham opposite dashing Errol Flynn in The Adventures of Robin Hood (1938); conman sidekick to Barbara Stanwyck in The Lady Eve (1941); portentous Mr. Collins whom Greer Garson nearly married in Pride and Prejudice (1940); and Mr. Tringle, the wedding supervisor, in Father of the Bride (1950) being particular standouts. Cooper made an active jaunt into TV roles in the 1950s but returned strongly to the stage after biding farewell to films in 1958. In the 1960s he enjoyed such scene-stealing theatrical roles as Colonel Pickering in \"My Fair Lady,\" Pellinore in \"Camelot\" and Reverend Chasuble in \"The Importance of Being Earnest\". He made one last return to Broadway playing (what else?) a valet in a short-run revival of the farcical comedy \"Charley's Aunt\" in 1970, which co-starred Rex Thompson, Louis Nye and 'Maureen O'Sullivan'. Married three times, his first was to London-born actress Rita Page who had a bit part in one of his films This Above All (1942), and died in 1954. They had one daughter, Valerie. The 76-year-old Cooper died in Los Angeles of cancer in 1973, and was survived by third wife Elizabeth.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjNlYWVlODUtMGQ3My00YjAyLWI1MTItNTBjZmU4NDhmMGJmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0178259","name":"Melville Cooper","idIMDB":"nm0178259"},"actorId":"nm0178259","character":"Guest Panelist","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0047123","urlIMDB":"http://www.imdb.com/title/tt0047123","business":{"budget":null,"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1953/\">1953</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 26 min (86 min)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Black and White"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Columbia Studio Laboratory, USA"],"filmLength":["2,395 m (1981) (Finland)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.3","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"APPROVED","awards":[{"award":"Academy Awards, USA 1955","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Costume Design, Black-and-White","names":[{"name":"Jean Louis","id":"nm0521872","role":null}]}]}]},{"award":"Writers Guild of America, USA 1955","titlesAwards":[{"titleAwardOutcome":"Nominated WGA Award (Screen)","categories":[{"category":"Best Written American Comedy","names":[{"name":"Garson Kanin","id":"nm0437717","role":null}]}]}]}],"votes":"2,461","type":"Movie","companyCreditsSimple":[{"idCompany":"co0050868","name":"Columbia Pictures Corporation"}],"keywords":{"keywords":["billboard","filmmaker","advertising","model","fame","advertising campaign","new york city","jaguar xk","camera shot of feet","foot closeup","stockings","female stockinged feet","columbus circle manhattan new york city","manhattan new york city","macy's department store manhattan new york city","central park manhattan new york city","zoo","u.s. air force","test of character","television","television reporter","tv news","star","skywriting","showbiz","seduction","satire","publicity","publicity stunt","price of fame","motion picture projection","landlord","jealousy","happiness","fortune","failure","convertible","champagne","camera","businessman","bar","apartment","advertisement","actress","actor's life","documentary filmmaking"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:05:14"}}