{"data":{"movies":[{"title":"Mutiny on the Buses","originalTitle":"","year":"1972","releaseDate":"19720609","directors":[{"name":"Harry Booth","id":"nm0095710"}],"writers":[{"name":"Ronald Wolfe","id":"nm0938132"},{"name":"Ronald Chesney","id":"nm0156254"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2OTg3OTgxNV5BMl5BanBnXkFtZTcwODU3NDYxMQ@@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Comedy"],"plot":"Bus driver Stan Butler agrees to marry Suzy, much to the anguish of Mum, her son-in-law, Arthur, and daughter Olive. How, they wonder, will they ever manage without Stan's money coming in? Then Arthur is sacked, and Stan agrees to delay the wedding. Meanwhile, he hits on an idea: Arthur should learn to drive a bus. Somehow he does just that, and even gets a job. Stan then blackmails the Depot Manager into giving him the job of driver on the new money-making Special Tours Bus. A great idea ...if only the inspector hadn't taken Stan on his trial run to the Windsor Safari Park.","simplePlot":"Bus driver Stan Butler agrees to marry Suzy, much to the anguish of Mum, her son-in-law, Arthur, and daughter Olive. How, they wonder, will they ever manage without Stan's money coming in? Then Arthur is sacked, and Stan agrees to delay the wedding. Meanwhile, he hits on an idea: Arthur should learn to drive a bus. Somehow he does just that, and even gets a job. Stan then blackmails the Depot ... ","actors":[{"actorName":"Reg Varney","urlProfile":"http://www.imdb.com/name/nm0890118","urlPhoto":"","biography":{"dateOfBirth":"11 July 1916","placeOfBirth":" Canning Town, London, England, UK","birthName":"Reginald Alfred Varney","height":"5' 5\" (1.65 m)","bio":"Reg Varney was born on July 11, 1916 in Canning Town, London, England as Reginald Alfred Varney. He was an actor and writer, known for On the Buses (1969), The Rag Trade (1961) and On the Buses (1971). He was married to Lilian Varney. He died on November 16, 2008 in Budleigh Salterton, Devon, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0890118","name":"Reg Varney","idIMDB":"nm0890118"},"actorId":"nm0890118","character":"Stan Butler","urlCharacter":"http://www.imdb.com/character/ch0031019","main":true},{"actorName":"Doris Hare","urlProfile":"http://www.imdb.com/name/nm0362791","urlPhoto":"","biography":{"dateOfBirth":"1 March 1905","placeOfBirth":" Bargoed, Monmouthshire, Wales, UK","height":"5' 4\" (1.63 m)","bio":"Doris Hare was born on March 1, 1905 in Bargoed, Monmouthshire, Wales. She was an actress, known for On the Buses (1969), Nuns on the Run (1990) and On the Buses (1971). She was married to John Fraser Roberts. She died on May 30, 2000 in Denville Hall, Northwood, Hillingdon, London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0362791","name":"Doris Hare","idIMDB":"nm0362791"},"actorId":"nm0362791","character":"Stan's Mum","urlCharacter":"http://www.imdb.com/character/ch0031022","main":true},{"actorName":"Michael Robbins","urlProfile":"http://www.imdb.com/name/nm0730425","urlPhoto":"","biography":{"dateOfBirth":"14 November 1930","placeOfBirth":" London, England, UK","birthName":"Michael Anthony Robbins","bio":"Michael Robbins (14 November 1930 - 11 December 1992) was an English actor and comedian best known for his on-going role as Arthur Rudge in the TV sitcom and film versions of On the Buses (1969-72). Born in London, Robbins was a bank clerk who became an actor after appearing in amateur dramatic performances in Hitchin, Hertfordshire, where he and his family lived at the time. Robbins made his television debut as the cockney soldier in Roll-on Bloomin' Death. Primarily a comedy actor, he is best remembered for the role of Arthur Rudge, the persistently sarcastic husband of Olive (Anna Karen), in the popular sitcom On the Buses (1969-73). Robbins and Karen provided the secondary comic storyline to Reg Varney's comedy capers at the bus depot. Robbins also appeared in the series film spin-offs, On the Buses, Mutiny on the Buses, and Holiday on the Buses. His other comedy credits include non-recurring roles in Man About the House, The Good Life, One Foot in the Grave, The New Statesman, George and Mildred, Hi-de-Hi! and You Rang, M'Lord?. He appeared as a rather humorously portrayed police sergeant in the TV adaptation of Brendon Chase. As well as these comic roles, he assumed various straight roles in some of the major British television shows of the 1960s and 1970s: including Minder, The Sweeney, Z-Cars, Return of the Saint, Murder Most English, The Avengers, Dixon of Dock Green, The Bill and the 1982 Doctor Who story The Visitation. Robbins's film credits included The Whisperers, Up The Junction, The Looking Glass War, Zeppelin and Blake Edwards' films The Pink Panther Strikes Again and Victor/Victoria'. He also had an extensive career as a radio actor, including a role in the soap opera Waggoner's Walk and the satirical 1970s show Life is What Yer Make It. Robbins was an indefatigable worker for charity. He was active in the Grand Order of Water Rats (being elected 'Rat of the Year' in 1978) and the Catholic Stage Guild; and received a Papal Award for his services in 1987. In one of his last television appearances, in A Little Bit of Heaven Robbins recalled his childhood visits to Norfolk and spoke of his faith and love of the Shrine of Our Lady at Walsingham. In the mid-1970s he also directed a film: How Are You? Robbins was married to actress Hal Dyer from 1960 until he died from cancer in Caterham, Surrey, in late 1992 aged 62. Robbins was survived by his two children and four grandchildren. Hal Dyer almost 20 years later died in 2011 from a brain haemorrhage.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0730425","name":"Michael Robbins","idIMDB":"nm0730425"},"actorId":"nm0730425","character":"Arthur, Stan's Brother in Law","urlCharacter":"http://www.imdb.com/character/ch0031023","main":true},{"actorName":"Anna Karen","urlProfile":"http://www.imdb.com/name/nm0439162","urlPhoto":"","biography":{"dateOfBirth":"19 September 1936","placeOfBirth":" South Africa","bio":"Anna Karen was born on September 19, 1936 in South Africa. She is an actress, known for On the Buses (1969), Beautiful Thing (1996) and EastEnders (1985). She was previously married to Terry Duggan.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0439162","name":"Anna Karen","idIMDB":"nm0439162"},"actorId":"nm0439162","character":"Olive, Stan's Sister","urlCharacter":"http://www.imdb.com/character/ch0031017","main":true},{"actorName":"Bob Grant","urlProfile":"http://www.imdb.com/name/nm0335279","urlPhoto":"","biography":{"dateOfBirth":"14 April 1932","placeOfBirth":" Hammersmith, London, England, UK","birthName":"Robert Sinclair Grant","height":"5' 8\" (1.73 m)","bio":"Bob Grant was trained at Rada after spending some time as a Lieutenant with the Royal Artillery. He plied his trade to begin with in Repertory and appeared on stage for many years all around the UK. His work in rep continued up to the mid-90s. He will be best remembered for his role of Jack Harper, the cheeky bus conductor with his traditional cigarette, cheeky laugh and his passion for the ladies and, of course, winding up old Blakey, the Inspector in On the Buses (1969). On the Buses was a huge success for Bob and his co-star, Reg Varney, running from 1969 to 1973 with 76 episodes and 3 spin-off films. It sold in 38 countries and is a great tribute to his comedy acting talents. In 1971 his popularity proved a little too much as his wedding to Kim was attended by hundreds of fans and it meant that everyone had to walk to the wedding! Famous other roles included Sparrows Can't Sing (1963) and Mrs. Wilson's Diary (1969). He toured Australia, starring in 'No Sex please we're British'. He also appeared on stage in musicals and pantomime. Sadly, he suffered from a depressive illness for a number of years and was found dead in his car in Gloucestershire on November 8th 2003. He was 71 years old.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0335279","name":"Bob Grant","idIMDB":"nm0335279"},"actorId":"nm0335279","character":"Jack, Stan's Conductor","urlCharacter":"http://www.imdb.com/character/ch0031015","main":true},{"actorName":"Stephen Lewis","urlProfile":"http://www.imdb.com/name/nm0146237","urlPhoto":"","biography":{"dateOfBirth":"17 December 1926","placeOfBirth":" Poplar, London, England, UK","height":"6' 1\" (1.85 m)","bio":"Stephen Lewis, will be chiefly remembered for the comedy catchphrase: \"I 'ate you Butler!\" He delivered it week after week in the hit sitcom On The Buses, a saucy slice of life that ran on ITV from 1969 to 1973. Lewis was Cyril \"Blakey\" Blake, a bus inspector with a Hitler moustache and delusions of grandeur. His nemesis was Stan Butler, a driver played by Reg Varney, who used his route as an opportunity to pick up stray \"birds\". By today's standards of television, On The Buses has all the subtlety and political correctness of cave drawings. But it was wildly popular, and Lewis's comic timing reflected a considerable acting talent. Lewis entered acting in an era of social mobility that is almost inconceivable today. He was born in Poplar, East London, on December 17 1926. His first job was as a merchant seaman; he reconsidered his vocation after he was persuaded to go to a performance of the experimental Theatre Workshop group run by the brilliant Left-wing director Joan Littlewood. After the performance, the audience was invited on to the stage to meet the cast and discuss the play. Lewis enjoyed the experience and, after turning up to others, got to know the Workshop well. Eventually, Littlewood, perhaps exasperated by Lewis's suggested stage directions, said: \"You're so blooming clever, why not do it yourself?\" He agreed, auditioned and was offered a part. After a successful run, Littlewood asked Lewis if he would like to stick with the company but he said he wanted to return to the sea. The director persuaded him to stay on the stage and he made his West End debut in Brendan Behan's The Hostage in 1958. In 1960, he wrote Sparrers Can't Sing, a play about life in the East End that relied heavily on actors' improvisations. It was a success and was released as a film (Sparrows Can't Sing) in 1963, with a cast that included Barbara Windsor and Roy Kinnear - although even their talents could not sell the social realist dialogue to a global audience. The New York Times sniffed: \"This isn't a picture for anyone with a logical mind or an ear for language. The gabble of Cockney spoken here is as incomprehensible as the reasoning of those who speak it.\" It was the first English-language film to be released in the US with subtitles. Throughout the 1960s, Lewis took a series of small roles culminating in a large part in the 1969 television play, Mrs Wilson's Diary, alongside another Theatre Workshop regular called Bob Grant. That same year, he landed a role in a new series called On the Buses, which also featured Grant as a lascivious bus conductor teamed up with Reg Varney, his equally Dionysian mate. Although the show was undoubtedly rude, crude and occasionally prejudiced, it offered genuinely witty reflections on the nature of 1970s class conflict. In the world of On the Buses, workers were constantly on strike and after more money; managerial characters such as Lewis's Blakey were exploitative snobs who thought they had authority just because they wore a badge. It was plain where the audience's sympathies were supposed to lie: many was the time that a bus \"hilariously\" ran over poor Blakey's foot or a bucket of water was tipped over his head. The cry: \"I 'ate you Butler\" was born of impotent rage. Although Varney the actor was Lewis's senior, it was still Varney's character, Reg, that got all the \"crumpet\". Lewis was only in his early forties when he took the role of Blakey, but playing ageing authority figures became his stock in trade. In the 1970s, he appeared in the television sequel to On The Buses, Don't Drink the Water, three big-screen outings of On The Buses and two cinematic sex comedies (Adventures of a Taxi Driver, Adventures of a Plumber's Mate). He later had parts in the films Personal Services (1987) and The Krays (1990). In 1988, he played a new character in the long-running BBC series Last of the Summer Wine - Clem \"Smiler\" Hemmingway - which he thoroughly enjoyed. \"It's got so much charm,\" he said of the show. \"I don't think any other country in the world has comedy like that.\" From 1995 to 1997, he appeared in the equally gentle sitcom Oh, Doctor Beeching! In 2007, he stepped down from Last of the Summer Wine because of ill health. Stephen Lewis remained a committed socialist. In a stroke of irony, however, in 1981 he was hired to promote CH coaches, in the character of Blakey; it was the first private bus company to break the public transport monopoly of Cardiff city council. This was exactly the kind of Thatcherite revolution of which Blakey would probably have approved. In his diaries, Tony Benn recalled campaigning with Lewis in 1984, describing him as \"very direct\" and \"extremely amusing\". He lived until the age of 88.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0146237","name":"Stephen Lewis","idIMDB":"nm0146237"},"actorId":"nm0146237","character":"The Inspector","urlCharacter":"http://www.imdb.com/character/ch0031016","main":true},{"actorName":"Janet Mahoney","urlProfile":"http://www.imdb.com/name/nm0537143","urlPhoto":"","biography":{"dateOfBirth":"1938","placeOfBirth":" Stoke Newington, London, England, UK","bio":"Janet Mahoney was born in 1938 in Stoke Newington, London, England. She is an actress, known for Mutiny on the Buses (1972), Carry on Loving (1970) and Doctor in Trouble (1970).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0537143","name":"Janet Mahoney","idIMDB":"nm0537143"},"actorId":"nm0537143","character":"Susy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pat Ashton","urlProfile":"http://www.imdb.com/name/nm0039256","urlPhoto":"","biography":{"dateOfBirth":"1931","placeOfBirth":" Wood Green, London, England, UK","height":"5' 4½\" (1.64 m)","bio":"Pat Ashton was born in 1931 in Wood Green, London, England. She was an actress, known for The Gaffer (1981), On the Buses (1971) and Mutiny on the Buses (1972). She was married to Geoff Godwin. She died on June 23, 2013 in Diss, Norfolk, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0039256","name":"Pat Ashton","idIMDB":"nm0039256"},"actorId":"nm0039256","character":"Norah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin Brennan","urlProfile":"http://www.imdb.com/name/nm0107339","urlPhoto":"","biography":{"dateOfBirth":"12 September 1920","placeOfBirth":" Randwick, Sydney, New South Wales, Australia","birthName":"Kevin Martin Brennan","bio":"Kevin Brennan was born on September 12, 1920 in Randwick, Sydney, New South Wales, Australia as Kevin Martin Brennan. He was an actor, known for Get Carter (1971), On the Beach (1959) and Unidentified Flying Oddball (1979). He died on December 17, 1998 in Banstead, Surrey, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0107339","name":"Kevin Brennan","idIMDB":"nm0107339"},"actorId":"nm0107339","character":"Mr. Jenkins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bob Todd","urlProfile":"http://www.imdb.com/name/nm0865121","urlPhoto":"","biography":{"dateOfBirth":"15 December 1921","placeOfBirth":" Faversham, Kent, England, UK","height":"6' 2\" (1.88 m)","bio":"Bob Todd was born on December 15, 1921 in Faversham, Kent, England. He was an actor, known for Superman III (1983), The Four Musketeers: Milady's Revenge (1974) and The Best of Benny Hill (1974). He died on October 21, 1992 in Sussex, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0865121","name":"Bob Todd","idIMDB":"nm0865121"},"actorId":"nm0865121","character":"New Inspector","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Lodge","urlProfile":"http://www.imdb.com/name/nm0517084","urlPhoto":"","biography":{"dateOfBirth":"19 August 1921","placeOfBirth":" Rochester, Kent, England, UK","birthName":"David William Frederick Lodge","height":"6' (1.83 m)","bio":"David Lodge was born on August 19, 1921 in Rochester, Kent, England as David William Frederick Lodge. He was an actor, known for The Return of the Pink Panther (1975), A Shot in the Dark (1964) and Two Way Stretch (1960). He was married to Marilyn Garcia. He died on October 18, 2003 in Denville Hall, Northwood, Hillingdon, London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0517084","name":"David Lodge","idIMDB":"nm0517084"},"actorId":"nm0517084","character":"Safari Guard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tex Fuller","urlProfile":"http://www.imdb.com/name/nm0298358","urlPhoto":"","biography":{"bio":"Tex Fuller is known for his work on Brazil (1985), Willow (1988) and The Company of Wolves (1984).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0298358","name":"Tex Fuller","idIMDB":"nm0298358"},"actorId":"nm0298358","character":"Harry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Caroline Dowdeswell","urlProfile":"http://www.imdb.com/name/nm0235709","urlPhoto":"","biography":{"dateOfBirth":"7 March 1945","placeOfBirth":" Oldham, England, UK","bio":"Caroline Dowdeswell was born on March 7, 1945 in Oldham, England. She is an actress, known for Mutiny on the Buses (1972), On the Buses (1971) and Ours Is a Nice House (1969).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0235709","name":"Caroline Dowdeswell","idIMDB":"nm0235709"},"actorId":"nm0235709","character":"Sandra","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jan Rennison","urlProfile":"http://www.imdb.com/name/nm0719706","urlPhoto":"","biography":{"bio":"Jan Rennison is an actress, known for Mutiny on the Buses (1972), Adventures of the Seaspray (1965) and Alien Attack (1976).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0719706","name":"Jan Rennison","idIMDB":"nm0719706"},"actorId":"nm0719706","character":"Gloria","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Damaris Hayman","urlProfile":"http://www.imdb.com/name/nm0371341","urlPhoto":"","biography":{"dateOfBirth":"16 June 1929","placeOfBirth":" Kensington, London, England, UK","birthName":"Damaris Ann Kennedy Hayman","height":"5' 7\" (1.7 m)","bio":"Damaris Hayman was born on June 16, 1929 in Kensington, London, England as Damaris Ann Kennedy Hayman. She is known for her work on The Pink Panther Strikes Again (1976), Bunny Lake Is Missing (1965) and The Haunting of Julia (1977).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0371341","name":"Damaris Hayman","idIMDB":"nm0371341"},"actorId":"nm0371341","character":"Mrs. Jenkins","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0068981","urlIMDB":"http://www.imdb.com/title/tt0068981","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"21","month":"02","year":"1972","remarks":null},{"money":null,"country":null,"day":"01","month":"04","year":"1972","remarks":null}],"copyrightHolder":"© Copyright MCMLXXII Hammer Film Productions Limited All Rights Reserved"},"technical":{"runtime":["1 hr 29 min (89 min)"],"soundMix":["Mono (RCA Sound Recording)"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.9","filmingLocations":[{"location":"Windsor Safari Park, St. Leonards Hill, Windsor, Berkshire, England, UK"}],"awards":[],"votes":"937","type":"Movie","companyCreditsSimple":[{"idCompany":"co0056416","name":"Anglo-EMI"},{"idCompany":"co0060069","name":"Hammer Films"}],"keywords":{"keywords":["bus","based on tv series","sequel","working class","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:34:34"}}