{"data":{"movies":[{"title":"Turk 182!","originalTitle":"","year":"1985","releaseDate":"19850215","directors":[{"name":"Bob Clark","id":"nm0163706"}],"writers":[{"name":"James Gregory Kingston","id":"nm0455577"},{"name":"James Gregory Kingston","id":"nm0455577"}],"runtime":"102 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2OTk1ODA1MV5BMl5BanBnXkFtZTcwNjYwNjgyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Comedy","Drama"],"plot":"Jimmy Lynch is angry because his older brother, who was injured as a result of an off duty fire rescue, is denied benefits by the city. At the same time, Mayor Tyler is embroiled in a political scandal that he denies all previous knowledge of. Jimmy begins painting \"Tyler Knew, Turk 182\" as an embarrassment to the mayor. The mayor is furious at this grafitti appearing all over the city and orders the police to find the artist. Jimmy's \"Turk 182\" spraypaints continue to appear.","simplePlot":"Jimmy Lynch is angry because his older brother, who was injured as a result of an off duty fire rescue, is denied benefits by the city. At the same time, Mayor Tyler is embroiled in a ... ","actors":[{"actorName":"Timothy Hutton","urlProfile":"http://www.imdb.com/name/nm0000459","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjYxODUwNV5BMl5BanBnXkFtZTcwNTg5Nzg4Mg@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1960","placeOfBirth":" Malibu, California, USA","birthName":"Timothy Tarquin Hutton","height":"6' (1.83 m)","bio":"Timothy Hutton was born in Malibu, California, to Maryline (Poole), a teacher, and actor Jim Hutton (Dana James Hutton). He set Hollywood ablaze when he burst onto the acting scene in the early 1980s. After only a small number of significant roles in TV movies, he bagged the part of Conrad in the Robert Redford-directed Ordinary People (1980). His convincing - and touching - performance as the troubled and self-accusing teenager trying to deal with the death of his older brother, won him an Academy Award. He is, to date, the youngest actor to receive an Oscar for Best Supporting Actor (1980). With over 70 film, TV, and stage appearances (including an impressive 15 features films between 2006-08), Tim Hutton is (of 2008) headlining the hit TV series Leverage (2008) as insurance investigator Nate Ford. He also starred in the acclaimed Roman Polanski film The Ghost Writer (2010). Tim made his Broadway debut in 1989 in the A.R. Gurney play 'Love Letters'.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjYxODUwNV5BMl5BanBnXkFtZTcwNTg5Nzg4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000459","name":"Timothy Hutton","nicknames":["Tim"],"idIMDB":"nm0000459"},"actorId":"nm0000459","character":"Jimmy Lynch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Urich","urlProfile":"http://www.imdb.com/name/nm0001810","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc0NzkyMjAwMl5BMl5BanBnXkFtZTYwNjA0ODU2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 December 1946","placeOfBirth":" Toronto, Ohio, USA","birthName":"Robert Michael Urich","height":"6' 2\" (1.88 m)","bio":"Robert grew up in Toronto, Ohio, where his athletic ability led to a four year football scholarship at Florida State University (FSU). There he earned a B.A. in Communications. He later received an M.A. at Michigan State University and then joined WGN radio in Chicago as a sales account representative. He then briefly appeared as a TV weatherman, and soon realized that he wanted to become an actor. His big break came in 1972 when Robert played Burt Reynolds's younger brother in a stage production of \"The Rainmaker\". Burt and Robert were both alumni of FSU. Burt brought him to California and let him stay in his home until he got his acting break. Burt recommended him to producer Aaron Spelling for the TV series S.W.A.T. (1975). Although that series lasted only one season, Spelling remembered Robert and later cast him in Vega$ (1978), which had a longer run. He was starring in the TV series The Lazarus Man (1996) when he was diagnosed with cancer, which caused the cancellation of the series. The cancer went into remission after treatment and he resumed acting again with his role as Captain Jim Kennedy III on Love Boat: The Next Wave (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc0NzkyMjAwMl5BMl5BanBnXkFtZTYwNjA0ODU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001810","name":"Robert Urich","nicknames":["Bob"],"idIMDB":"nm0001810"},"actorId":"nm0001810","character":"Terry Lynch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kim Cattrall","urlProfile":"http://www.imdb.com/name/nm0000326","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NjMyMjAyMV5BMl5BanBnXkFtZTcwMDk1ODQ5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 August 1956","placeOfBirth":" Liverpool, England, UK","birthName":"Kim Victoria Cattrall","height":"5' 6½\" (1.69 m)","bio":"Kim Victoria Cattrall was born on August 21, 1956 in Mossley Hill, Liverpool, England to Gladys Shane (Baugh), a secretary, and Dennis Cattrall, a construction engineer. At the age of three months, her family emigrated to Canada, where a large number of her films have been made. At age 11, she returned to her native country and studied at the London Academy of Music and Dramatic Art. She returned to Vancouver and, at age 16, graduated from high school and won a scholarship to study at the American Academy of Dramatic Arts in New York City. During her final year at the Academy, she won a role in Otto Preminger's action thriller Rosebud (1975). Following her film debut, Kim returned to the theatre, first in Vancouver and then in repertory in Toronto prior to winning a contract at Universal Pictures in Los Angeles, California. Her best known film role is the Vulcan Lieutenant Valeris in Star Trek VI: The Undiscovered Country (1991). She is also best known for her role as public relations executive Samantha Jones on the situation comedy Sex and the City (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NjMyMjAyMV5BMl5BanBnXkFtZTcwMDk1ODQ5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000326","name":"Kim Cattrall","idIMDB":"nm0000326"},"actorId":"nm0000326","character":"Danny Boudreau","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Culp","urlProfile":"http://www.imdb.com/name/nm0191685","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NDg3NDMyMl5BMl5BanBnXkFtZTcwNDU3MTgyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 August 1930","placeOfBirth":" Oakland, California, USA","birthName":"Robert Martin Culp","height":"6' 1\" (1.85 m)","bio":"Tall, slim and exceedingly good-looking American leading man Robert Culp, a former cartoonist in his teen years, appeared off-Broadway in the 1950s before settling into polished, clean-cut film leads and \"other man\" supports a decade later. Hitting the popular TV boards in the hip, racially ground-breaking espionage program I Spy (1965), he made a slick (but never smarmy), sardonic name for himself during his over five-decade career with his sly humor, casual banter and tongue-and-cheek sexiness. Though he had the requisite looks and smooth, manly appeal (not to mention acting talent) for superstardom, a cool but cynical and somewhat detached persona may have prevented him from attaining it full-out. He was born Robert Martin Culp on August 16, 1930, in Oakland California. The son of attorney Crozie Culp and his wife, Bethel Collins, who was employed at a Berkeley chemical company, he offset his only-child loneliness by playacting in local theater productions. Culp also showed a talent for art while young and earned money as a cartoonist for Bay Area magazines and newspapers in high school, but the fascination with becoming an actor proved much stronger. He attended Berkeley High School and graduated in 1947. The athletically-inclined Culp dominated at track and field events and, as a result, earned athletic scholarships to six different universities. He selected the relatively minor College of the Pacific in Stockton, California primarily because of its active theater department. Transferring to various other colleges of higher learning (including San Francisco State in 1949), he never earned a degree. After performing in some theatre in the San Francisco area, he moved to Seattle and then New York in 1951. Studying under famed teacher Herbert Berghof and supporting himself during this time teaching speech and phonetics, Bob eventually found work on the theatre scene, making his 1953 Broadway debut (as Robert M. Culp) in \"The Prescott Proposals\" with Katharine Cornell. He eventually returned to Broadway with \"Diary of a Scoundrel\" starring Blanche Yurka and Roddy McDowall in 1956 and with a strong role in \"A Clearing in the Woods\" (alongside Kim Stanley) a year later. He earned an off-Broadway Obie Award for his very fine work in \"He Who Gets Slapped\" in 1956, and also appeared in the plays \"Daily Life\" and \"Easter\". Gracing a few live-TV dramas during his New York days, he returned to his native California for his first major TV role. It was an auspicious one as post-Civil War Texas Ranger \"Hoby Gilman\" in the western series Trackdown (1957). He earned widespread attention in the series that based many of its stories from actual Texas Ranger files, and the show itself received the official approval not only of the Rangers themselves but by the State of Texas. The series led to a CBS spin-off of its own: Wanted: Dead or Alive (1958), which made a TV star out of Steve McQueen. From there, Culp guested on a number of series dramas: Bonanza (1959), The Rifleman (1958), Rawhide (1959), The Detectives (1959), Ben Casey (1961), The Outer Limits (1963), Naked City (1958) and Combat! (1962). He also starred in the two-part Disney family-styled program \"Sammy the Way Out Seal\" (1962), which was subsequently released as a feature in Europe. He and Patricia Barry played the hapless parents of precocious Bill Mumy and Michael McGreevey whose \"adopted\" pet animal unleashes major chaos in their suburban neighborhood. During this time, Bob began to seek lead and supporting work in films. Despite his co-starring with Cliff Robertson, Rod Taylor and the very perky Jane Fonda (as her straight-laced boyfriend) in the sparkling Broadway-based sexcapade Sunday in New York (1963); playing Robertson's naval mate in the popular John F. Kennedy biopic PT 109 (1963); recreating the legendary \"Wild Bill\" Hickok in the western tale The Raiders (1963); and heading up the adventurous cast of the Ivan Tors' African yarn Rhino! (1964) (which included Harry Guardino and the very fetching British import Shirley Eaton), Culp wasn't able to make a serious dent in the medium. TV remained his best arena and gave him more lucrative offers, professionally. It rewarded him quite richly in 1965 with the debonair series lead \"Kelly Robinson\", a jet-setting, pro-circuit tennis player who leads a double life as an international secret agent in I Spy (1965). Running three seasons, Culp co-starred with fellow secret agent Bill Cosby, who, as \"Alexander Scott\", posed as Culp's tennis trainer. The role was tailor-made for the suave, Ivy-League-looking actor. He looked effortlessly cool posing in sunglasses amid the posh continental settings and remained handsomely unflinching in the face of danger. It was the first U.S. prime-time network drama to feature an African-American actor in a full-out starring role and the relationship between the two meshed perfectly and charismatically on screen. Both were nominated for acting Emmys in all three of its seasons, with Cosby coming out the victor each time. Filmed on location in such cities as Hong Kong, Acapulco and Tokyo, Culp also wrote and directed certain episodes of the show He also met his third wife, the gorgeous Eurasian actress France Nuyen, while on the set. They married in 1967 but divorced three years later. At this stage, the actor already had four children (by second wife, sometime actress Nancy Ashe). Following the series' demise, Culp took on perhaps his most-famous and controversial film role as Natalie Wood's husband \"Bob\" in the titillating but ultimately teasing \"flower power\" era film Bob & Carol & Ted & Alice (1969), with Elliott Gould and Dyan Cannon as the other-half couple who examine the late 60s \"free love\" idea of wife-swapping. The film was nominated for four Academy Awards (two went to supporting actors Gould and Cannon). The movie did not reignite Culp's popularity on the large screen, but it did lead to his rather strange pairing with buxom Raquel Welch in the violent-edged western Hannie Caulder (1971) and a reunion with his I Spy (1965) pal Cosby in the far-more entertaining Hickey & Boggs (1972), which reestablished their great tongue-in-cheek rapport as two weary-eyed private eyes. Culp also directed the film while his real-life wife, actress Sheila Sullivan, played his screen wife as well. The late 1970s produced a flood of routine mini-movies and B-pictures, the latter including Inside Out (1975), Sky Riders (1976), Coup de sang (1976), The Great Scout & Cathouse Thursday (1976), Flood (1976), Goldengirl (1979) and Hot Rod (1979). While he remained a sturdy and standard presence in such mini-movies as Houston, We've Got a Problem (1974), Spectre (1977) and Calendar Girl Murders (1984), his better TV-movie roles were in A Cold Night's Death (1973), Outrage (1973), A Cry for Help (1975) and as \"Lyle Pettyjohn\" in the acclaimed mini-series sequel Roots: The Next Generations (1979). Bob returned to series TV as stern \"CIA Chief Bill Maxwell\", whose job was to protect handsome Robert Redford lookalike William Katt, who starred as an ersatz The Greatest American Hero (1981). The show lasted three seasons. Other series guest spots, both comedic and dramatic, included Hotel (1983), Highway to Heaven (1984), The Golden Girls (1985) and an episode of his old buddy's show The Cosby Show (1984). He was also a guest murderer in three of the \"Columbo\" episodes. Although he was relegated to appearing in such film fodder as Turk 182! (1985), Big Bad Mama II (1987) and Pucker Up and Bark Like a Dog (1989), the 1990s offered him one of his best film roles in years as the ill-fated President in the Denzel Washington/Julia Roberts political thriller The Pelican Brief (1993). A year later, he again reteamed with Cosby in the TV-movie I Spy Returns (1994). Culp became very active in the 1960s Civil Rights movement and later became a prominent face in local civic causes, joining in a lawsuit to cease construction of an elephant exhibit at the Los Angeles Zoo and accusing officials there of mistreatment. In the long run, however, the construction was given the green light. Culp also married a fifth time to Candace Faulkner and, by her, had daughter Samantha Culp in 1982. Older sons Jason Culp (born 1961) and Joseph Culp (born 1963) became actors, while another son, Joshua Culp (born 1958), entered the visual effects field. Daughter Rachel, an outré clothing designer for rock stars, was born in 1964. In later years, Culp could be seen occasionally as Ray Romano's father-in-law on the hugely popular Everybody Loves Raymond (1996). His last film, the family drama The Assignment (2010), was unreleased at the time of his death. On March 24, 2010, the 79-year-old Culp collapsed from an apparent heart attack while walking near the lower entrance to Runyon Canyon Park, a popular hiking area in the Hollywood Hills. Found by a hiker, Culp was transported to a nearby hospital where he died from the head injuries he sustained in the fall. Five grandchildren also survive.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NDg3NDMyMl5BMl5BanBnXkFtZTcwNDU3MTgyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0191685","name":"Robert Culp","idIMDB":"nm0191685"},"actorId":"nm0191685","character":"Mayor Tyler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Darren McGavin","urlProfile":"http://www.imdb.com/name/nm0569000","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MDYwMjQ5NV5BMl5BanBnXkFtZTYwODE5MjU2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 May 1922","placeOfBirth":" Spokane, Washington, USA","birthName":"William Lyle Richardson","height":"5' 10\" (1.78 m)","bio":"A remarkably seasoned actor of stage, screen and television, Darren McGavin has notched in excess of 200 performances; however, he is most fondly remembered by cult TV fans as heroic newspaper reporter Carl Kolchak in the classic but short-lived horror TV series Kolchak: The Night Stalker (1974). In a long and varied career, McGavin has often turned up as authority figures including policemen, military officers, stern-faced business executives or father figures; however, he is equally adept at light-hearted comedic performances. Darren McGavin was born William Lyle Richardson on May 7, 1922, in Spokane, Washington, to Grace Mitton (Bogart) and Reed D. Richardson. His mother was from Ontario, Canada. He received his dramatic arts training at New York's Neighborhood Playhouse and the Actors Studio, and debuted on screen in an uncredited role in A Song to Remember (1945). Several standard roles followed over the next decade before he landed the key role of Louie the drug pusher in The Man with the Golden Arm (1955) and Capt. Russ Peters in The Court-Martial of Billy Mitchell (1955), both directed by Otto Preminger. Each of these performances showcased McGavin's versatility, and his virile looks scored him the role of Mickey Spillane's hard-boiled private eye in Mike Hammer (1958). McGavin stayed continually employed throughout the 1960s, appearing in such films as The Great Sioux Massacre (1965), The Outsider (1967), The Challengers (1970) and The Tribe (1970). In addition, he was regularly guest-starring in dozens of TV shows, including Gunsmoke (1955), Dr. Kildare (1961), Mission: Impossible (1966) and The Man from U.N.C.L.E. (1964). In 1971 he landed the role of cynical reporter Carl Kolchak in the low-budget horror thriller The Night Stalker (1972), about a vampire running amok in Las Vegas. The film was a monster ratings winner (pun intended!) and the highest-rated telemovie of 1972, and original scriptwriters were soon hard at work on a punchier sequel. The Night Strangler (1973) saw Kolchak in Seattle (after being booted out of Las Vegas by the police), and this time on the trail of a serial killer seeking the elixir of eternal youth. The second movie was equally successful, and spawned the short-lived TV series Kolchak: The Night Stalker (1974) with Simon Oakland as McGavin's long-suffering editor and a host of weekly guest stars including Jim Backus, Phil Silvers, Richard Kiel, Tom Skerritt, Scatman Crothers and Larry Storch. \"Kolchak\" only lasted one season, but it became a bona-fide cult classic, and many years later its premise of \"the unknown amongst us\" inspired writer Chris Carter to create the phenomenally successful long-running TV series The X-Files (1993), which saw McGavin guest-star in several episodes. McGavin remained busy throughout the rest of the 1970s and into the 1980s, appearing in Airport '77 (1977), as Gen. George S. Patton in the TV miniseries Ike: The War Years (1979), alongside Rock Hudson in the uneven sci-fi miniseries The Martian Chronicles (1980) and a few years later endeared himself to to a whole new generation of fans with his superb performance as the vitriolic, yet buffoonish, father in the delightful Christmas classic A Christmas Story (1983). The always versatile McGavin also popped up as a detective in Turk 182! (1985), assisted Arnold Schwarzenegger in cleaning up the mob in Raw Deal (1986) and was a doctor in the bizarre zombie/cop/zombie cop film Dead Heat (1988). At this point it's worth mentioning that, along with his film and TV work, McGavin has also enjoyed an illustrious career on the stage, with appearances in dozens of critically acclaimed productions across the length and breadth of the US. He has appeared in stage presentations of \"Death of a Salesman\", \"The Rainmaker\", \"The King and I\" and \"Blood Sweat & Stanley Poole\", to name a few. In 1990 the opportunity arose for McGavin to play another somewhat stern, yet comedic, father figure, this time as \"Bill Brown\" to Candice Bergen in the much loved sitcom Murphy Brown (1988). McGavin was again wonderful, and his entertaining performances resulted in an Emmy Award in 1990. Several other film roles followed in the 1990s, in such films as Adam Sandler's hit Billy Madison (1995). He died on 25th February 2006 at the age of 83.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MDYwMjQ5NV5BMl5BanBnXkFtZTYwODE5MjU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0569000","name":"Darren McGavin","idIMDB":"nm0569000"},"actorId":"nm0569000","character":"Det. Kowalski","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steven Keats","urlProfile":"http://www.imdb.com/name/nm0444198","urlPhoto":"","biography":{"dateOfBirth":"6 February 1945","placeOfBirth":" The Bronx, New York, USA","height":"5' 10½\" (1.79 m)","bio":"Excellent, prolific, and versatile film, stage, and television actor Steven Keats was born on February 6, 1945 in The Bronx, New York City. The son of Jewish immigrants from Denmark, Keats grew up in Canarsie, The Bronx and graduated from the High School for Performing Arts in Manhattan. He served in the Air Force during the Vietnam War in 1965 and 1966. Following his tour of duty, Steven returned to the United States and attended both the Yale School of Drama and Montclair State College. Keat made his Broadway stage debut in 1970 as part of the second cast for \"Oh! Calcutta.\" His most memorable movie roles include spaced-out punk hood Jackie Brown in \"The Friends of Eddie Coyle,\" Charles Bronson's son-in-law Jack Toby in \"Death Wish,\" Carol Kane's Americanized Jewish immigrant husband Jake Putkovsky in \"Hester Street,\" Robert Shaw's Israeli sidekick Moshevsky in \"Black Sunday,\" and obsessive mad scientist Dr. Philip Spires in \"Silent Rage.\" Steven was nominated for an Emmy for Outstanding Lead Actor in a Limited Series for his exceptional portrayal of ruthless Depression-era rag trade tycoon Jay Blackman in the mini-series \"Seventh Avenue.\" Among the many shows Keats made guest appearances on are \"Kojak,\" \"The Streets of San Francisco,\" \"The Rockford Files,\" \"Starsky and Hutch,\" \"Barnaby Jones,\" \"Cagney & Lacey,\" \"The Love Boat,\" \"The A-Team,\" \"Hunter,\" \"T.J. Hooker,\" \"Hill Street Blues,\" \"Miami Vice,\" \"Matlock,\" and \"MacGyver.\" Moreover, he played Thomas Edison on an episode of \"Voyagers!\". He was the father of sons Shane and Thatcher. Steven was found dead in his Manhattan apartment on May 8, 1994; the cause of death was ruled an apparent suicide. Keats was only 49 years old.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0444198","name":"Steven Keats","idIMDB":"nm0444198"},"actorId":"nm0444198","character":"Jockamo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Sorvino","urlProfile":"http://www.imdb.com/name/nm0000649","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNjkyMjk1OV5BMl5BanBnXkFtZTYwNjE1NjQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1939","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"6' 2½\" (1.89 m)","bio":"Tall, dark and imposing American actor Paul Sorvino has made a solid career of portraying authority figures. He was born in Brooklyn, New York City. His mother, Angela (Renzi), was a piano teacher, of Italian descent. His father, Ford Sorvino, was an Italian immigrant who worked in a robe factory as a foreman. Paul originally had his heart set on a life as an opera singer. He was exposed to dramatic arts while studying at the American Musical and Dramatic Academy in New York. He furthered his studies with Sanford Meisner and eventually made his film debut in Where's Poppa? (1970). Sorvino suffered from severe asthma, and worked hard at mastering various breathing techniques to manage the illness. He wrote a best-selling book entitled \"How to Become a Former Asthmatic\". He also started the Sorvino Asthma Foundation based in New York City. Sorvino has appeared in a variety of film, TV and theatrical productions over the the last four decades. He received critical praise for his role in the Broadway play \"That Championship Season\", and played the role again in the 1981 film alongside Robert Mitchum and Martin Sheen. Other noteworthy performances during the 1980s and 1990s included a stressed-out police chief in Cruising - La Chasse (1980), Mike Hammer's cop buddy in I, the Jury (1982), \"Lips Manlis\" in Dick Tracy (1990) with James Caan and in a standout performance as mob patriarch \"Paul Cicero\" in the powerhouse Goodfellas (1990). Always keeping himself busy, Sorvino has performed in nearly 50 movies just in the past decade, including a dynamic and under-appreciated portrayal of Henry Kissinger in Nixon (1995), as \"Fulgencio Capulet\" in the updated Romeo + Juliet (1996) and in the Las Vegas thriller The Cooler (2003). Sorvino is the proud father of Academy Award-winning actress Mira Sorvino.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyNjkyMjk1OV5BMl5BanBnXkFtZTYwNjE1NjQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000649","name":"Paul Sorvino","idIMDB":"nm0000649"},"actorId":"nm0000649","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Boyle","urlProfile":"http://www.imdb.com/name/nm0001967","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0ODc5NTE4M15BMl5BanBnXkFtZTYwNjY3MTI0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1935","placeOfBirth":" Norristown, Pennsylvania, USA","birthName":"Peter Lawrence Boyle Jr.","height":"6' 2\" (1.88 m)","bio":"A bold, blunt instrument of hatred and violence at the onset of his film career, Peter Boyle recoiled from that repugnant, politically incorrect \"working class\" image to eventually play gruff, gentler bears and even comedy monsters in a career that lasted four decades. He was born on October 18, 1935, in Norristown, Pennsylvania, to Alice (Lewis) and Francis Xavier Boyle. He eventually moved to Philadelphia, where his father was a sought-after local TV personality and children's show host. His paternal grandparents were Irish immigrants, and his mother was of mostly French and British Isles descent. Following a solid Catholic upbringing (he attended a Catholic high school), Peter was a sensitive youth and joined the Christian Brothers religious order at one point while attending La Salle University in Philadelphia. He left the monastery after only a few years when he \"lost\" his calling. Bent on an acting career, Boyle initially studied with guru Uta Hagen in New York. The tall (6' 2\"), hulking, prematurely bald actor wannabe struggled through a variety of odd jobs (postal worker, waiter, bouncer) while simultaneously building up his credits on stage and waiting for that first big break. Things started progressing for him after appearing in the national company of \"The Odd Couple\" in 1965 and landing TV commercials on the sly. In the late 60s he joined Chicago's Second City improv group and made his Broadway debut as a replacement for Peter Bonerz in Paul Sills' \"Story Theatre\" (1971) (Sills was the founder of Second City). Peter's breakout film role did not come without controversy as the hateful, hardhat-donning bigot-turned-murderer Joe (1970) in a tense, violence-prone film directed by John G. Avildsen. The role led to major notoriety, however, and some daunting supporting parts in T.R. Baskin (1971), Slither (1973) and as Robert Redford's calculating campaign manager in The Candidate (1972). During this time his political radicalism found a visible platform after joining Jane Fonda and Donald Sutherland on anti-war crusades, which would include the anti-establishment picture Steelyard Blues (1973). This period also saw the forging of a strong friendship with former Beatle John Lennon. Destined to be cast as monstrous undesirables throughout much of his career, he played a monster of another sort in his early film days, and thus avoided a complete stereotype as a film abhorrent. His hilarious, sexually potent Frankenstein's Monster in the cult Mel Brooks spoof Young Frankenstein (1974) saw him in a sympathetic and certainly more humorous vein. His creature's first public viewing, in which Boyle shares an adroit tap-dancing scene with \"creator\" Gene Wilder in full Fred Astaire regalia, was a show-stopping audience pleaser. Late 70s filmgoers continued to witness Boyle in seamy, urban settings with brutish roles in Taxi Driver (1976) and Hardcore (1979). At the same time he addressed several TV mini-movie roles with the same brilliant darkness such as his Senator Joe McCarthy in Tail Gunner Joe (1977), for which he received an Emmy nomination, and his murderous, knife-wielding Fatso in the miniseries remake of From Here to Eternity (1979). While the following decade found Peter in predominantly less noteworthy filming and a short-lived TV series lead as remote cop Joe Bash (1986), the 90s brought him Emmy glory (for a guest episode on The X-Files (1993)). Despite a blood clot-induced stroke in 1990 that impaired his speech for six months, he ventured on and capped his enviable career on TV wielding funny but crass one-liners in the \"Archie Bunker\" mold on the long-running sitcom Everybody Loves Raymond (1996). A major Emmy blunder had Boyle earning seven nominations for his Frank Barrone character without a win, the only prime player on the show unhonored. He survived a heart attack while on the set of \"Everybody Loves Raymond\" in 1999, but managed to return full time for the remainder of the series' run through 2005. Following a superb turn as Billy Bob Thornton's unrepentantly racist father in the sobering Oscar-winner Monster's Ball (2001), the remainder of his films were primarily situated in frivolous comedy fare such as The Adventures of Pluto Nash (2002), The Santa Clause 2 (2002), Scooby-Doo 2: Monsters Unleashed (2004), and The Santa Clause 3: The Escape Clause (2006), typically playing cranky curmudgeons. Boyle died of multiple myeloma (bone-marrow cancer) and heart disease at New York Presbyterian Hospital in 2006, and was survived by his wife Lorraine and two children. He was 71.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0ODc5NTE4M15BMl5BanBnXkFtZTYwNjY3MTI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001967","name":"Peter Boyle","idIMDB":"nm0001967"},"actorId":"nm0001967","character":"Det. Ryan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Tolkan","urlProfile":"http://www.imdb.com/name/nm0866055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NDcyNzQ4Nl5BMl5BanBnXkFtZTcwMjExNTgyMQ@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1931","placeOfBirth":" Calumet, Michigan, USA","birthName":"James Stewart Tolkan","height":"5' 6\" (1.68 m)","bio":"Fiery, forceful and intimidating character actor James Tolkan has carved out a nice little niche for himself in both movies and television alike as a formidable portrayer of fierce and flinty hard-boiled tough guy types. James Stewart Tolkan was born on June 20, 1931 in Calumet, Michigan. His father, Ralph M. Tolkan, was a cattle dealer. James attended the University of Iowa, Coe College and Eastern Arizona College. After serving a year-long stint in the United States Navy, Tolkan went to New York and studied acting with both Lee Strasberg and Stella Adler at the Actors Studio. Short and bald, with beady, intense eyes, a wiry, compact, muscular build, a gruff, jarring, high-decibel voice, and an aggressive, confrontational, blunt-as-a-battle-ax, rough-around-the-edges demeanor, Tolkan has been often cast as rugged, cynical no-nonsense cops, mean, domineering authority figures, and various ruthless and dangerous criminals. Tolkan first began acting in movies in the late 1960s and was highly effective in two pictures for Sidney Lumet: He was a rabidly homophobic police lieutenant in the superbly gritty Serpico (1973) and a sneaky district attorney in the equally excellent Prince of the City (1981). Best known as the obnoxiously overzealous high school principal Gerard Strickland in the Back to the Future films, Tolkan's other most memorable roles include Napolean in Woody Allen's Love and Death (1975), a ramrod army officer in WarGames (1983), mayor Robert Culp's mordant, wisecracking assistant in Turk 182! (1985), the hard-nosed Stinger in Top Gun (1986), the choleric Detective Lubric in Masters of the Universe (1987), meek mob accountant Numbers in Dick Tracy (1990), and Wesley Snipes' bullish superior in Boiling Point (1993). James has had recurring parts on the television series A Nero Wolfe Mystery (2000) (he also directed two episodes), Mary (1985), Cobra (1993), The Hat Squad (1992) and Remington Steele (1982). Among the television series James has done guest spots on are Naked City (1958), Hill Street Blues (1981), Miami Vice (1984), The Fresh Prince of Bel-Air (1990), The Equalizer (1985), The Wonder Years (1988) and The Pretender (1996). Besides his film and television work, Tolkan has also performed on stage in productions of such plays as \"Between Two Thieves\", \"Wings\", \"One Tennis Shoe\", \"The Front Page\", \"Twelve Angry Men\", \"Full Circle\", \"The Tempest\", \"Golda\", \"The Silent Partner\" and the original 1984 Broadway production of David Mamet's \"Glengary, Glen Ross\". When he isn't acting, James Tolkan spends his spare time collecting folk art.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NDcyNzQ4Nl5BMl5BanBnXkFtZTcwMjExNTgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0866055","name":"James Tolkan","idIMDB":"nm0866055"},"actorId":"nm0866055","character":"Hanley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas Quinn","urlProfile":"http://www.imdb.com/name/nm0704009","urlPhoto":"","biography":{"dateOfBirth":"6 October 1934","placeOfBirth":" New York City, New York, USA","height":"6' (1.83 m)","bio":"Thomas Quinn was born on October 6, 1934 in New York City, New York, USA. He is an actor, known for Witness (1985), 3 Men and a Baby (1987) and Homeboy (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0704009","name":"Thomas Quinn","idIMDB":"nm0704009"},"actorId":"nm0704009","character":"Hooly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Norman Parker","urlProfile":"http://www.imdb.com/name/nm0006559","urlPhoto":"","biography":{"bio":"Norman Parker was born in Brooklyn, New York, USA. He is an actor, known for Prince of the City (1981), The Bonfire of the Vanities (1990) and Family Ties (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0006559","name":"Norman Parker","idIMDB":"nm0006559"},"actorId":"nm0006559","character":"Dr. Salco","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dick O'Neill","urlProfile":"http://www.imdb.com/name/nm0642143","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMTkxMzgxMV5BMl5BanBnXkFtZTYwODA2MDcy._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1928","placeOfBirth":" New York City, New York, USA","birthName":"Richard Francis O'Neill","bio":"Dick O'Neill was born on August 29, 1928 in New York City, New York, USA as Richard Francis O'Neill. He was an actor, known for The Jerk (1979), The Mosquito Coast (1986) and The Taking of Pelham One Two Three (1974). He was married to Susan Jacqueline (Jackie) Shaw. He died on November 17, 1998 in Santa Monica, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwMTkxMzgxMV5BMl5BanBnXkFtZTYwODA2MDcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0642143","name":"Dick O'Neill","idIMDB":"nm0642143"},"actorId":"nm0642143","character":"Powerhouse chief","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maury Chaykin","urlProfile":"http://www.imdb.com/name/nm0001999","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NjA2NDg5Nl5BMl5BanBnXkFtZTcwOTMxNzkyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1949","placeOfBirth":" Brooklyn, New York, USA","birthName":"Maury Alan Chaykin","height":"6' 1\" (1.85 m)","bio":"The award-winning Canadian-American character actor Maury Chaykin was born on July 27, 1949 in Brooklyn, New York, the son of Professor Irving J. Chaykin and his wife Clarice. Irving Chaykin, an American citizen, taught accountancy at the City College of New York. The former Clarice Bloomfield, his mother, was born in Winnipeg, raised in Montreal, and educated at the Beth Israel Hospital nursing school in Newark, New Jersey. Because of his parents, Maury held dual Canadian and American citizenship. He was raised in New York City but moved to Toronto after graduating from the State University of New York, Buffalo, where he studied drama. His uncle, George Bloomfield, made his name in Canada as a movie and television writer, director and producer. Maury would later star in two theatrical movies, one TV movie and 14 TV episodes directed by his uncle. Maury made his debut in the 1975 Canadian film Me (1975). In his 35-year-long career, he appeared in over 150 parts in films and TV series shot in Canada and the U.S. He was best known for his eccentric role as Kevin Costner's commanding officer in the Oscar-winning Dances with Wolves (1990), three films of Atom Egoyan, including De beaux lendemains (1997), and his role as Nero Wolfe on cable TV. (His uncle George Bloomfield directed some of the Nero Wolfe episodes.) He won a Genie Award, the Canadian equivalent of the Oscar, as Best Supporting Actor for his performance as a has-been rock star in Whale Music (1994) and two Gemini Awards, the Canadian equivalent of the Emmy. Recently, he had a semi-recurring role as a movie producer based on Harvey Weinstein in the cable-TV series Entourage (2004) and a regular role on the Canadian TV series Less Than Kind (2008). Chaykin was suffering from kidney disease in the last years of his life. He died on his 61st birthday, July 27, 2010, at Toronto General Hospital, surrounded by members of his family. He was married to the Canadian actress Susannah Hoffmann, by whom he had a daughter, Rose.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NjA2NDg5Nl5BMl5BanBnXkFtZTcwOTMxNzkyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001999","name":"Maury Chaykin","idIMDB":"nm0001999"},"actorId":"nm0001999","character":"Man in Wheelchair","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Zobel","urlProfile":"http://www.imdb.com/name/nm0957517","urlPhoto":"","biography":{"dateOfBirth":"5 June 1952","placeOfBirth":" West Chester, Pennsylvania, USA","birthName":"Richard J. Zobel","bio":"Richard Zobel was born on June 5, 1952 in West Chester, Pennsylvania, USA as Richard J. Zobel. He is known for his work on Il était une fois en Amérique (1984), To Sleep with a Vampire (1993) and From the Hip (1987). He died on October 4, 2005.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0957517","name":"Richard Zobel","idIMDB":"nm0957517"},"actorId":"nm0957517","character":"TV interviewer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Wohl","urlProfile":"http://www.imdb.com/name/nm0937387","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNTIxMDIzMl5BMl5BanBnXkFtZTgwMTc5OTAxMTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 September 1953","placeOfBirth":" Brooklyn, New York, USA","bio":"David Wohl was born on September 22, 1953 in Brooklyn, New York, USA. He is an actor and producer, known for Saving Private Ryan (1998), Hot Shots! Part Deux (1993) and Sophie's Choice (1982).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNTIxMDIzMl5BMl5BanBnXkFtZTgwMTc5OTAxMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0937387","name":"David Wohl","idIMDB":"nm0937387"},"actorId":"nm0937387","character":"TV producer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0090217","urlIMDB":"http://www.imdb.com/title/tt0090217","business":{"budget":null,"openingWeekend":[{"money":"$1,589,234","country":"USA","day":"18","month":"02","year":"1985","remarks":"792 Screens"}],"gross":[{"money":"$3,563,635","country":"USA","day":"10","month":"03","year":"1985","remarks":""},{"money":"$3,395,160","country":"USA","day":"03","month":"03","year":"1985","remarks":""},{"money":"$2,905,994","country":"USA","day":"24","month":"02","year":"1985","remarks":""},{"money":"$1,589,234","country":"USA","day":"18","month":"02","year":"1985","remarks":""}],"weekendGross":[{"money":"$96,411","country":"USA","day":"10","month":"03","year":"1985","remarks":"154 Screens"},{"money":"$249,365","country":"USA","day":"03","month":"03","year":"1985","remarks":"260 Screens"},{"money":"$980,240","country":"USA","day":"24","month":"02","year":"1985","remarks":"801 Screens"},{"money":"$1,589,234","country":"USA","day":"18","month":"02","year":"1985","remarks":"792 Screens"}],"admissions":null,"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 42 min (102 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision"],"printedFilmFormat":["35 mm"]},"rating":"5.9","filmingLocations":[{"location":"Kaufman Astoria Studios - 3412 36th Street, Astoria, Queens, New York City, New York, USA"}],"rated":"PG-13","awards":[{"award":"Razzie Awards 1986","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Supporting Actor","names":[{"name":"Robert Urich","id":"nm0001810","role":null}]},{"category":"Worst Musical Score","names":[{"name":"Paul Zaza","id":"nm0006344","role":null}]}]}]}],"votes":"3,161","type":"Movie","companyCreditsSimple":[{"idCompany":"co0031772","name":"Interscope Communications"},{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"}],"keywords":{"keywords":["mayor","rescue","manhattan new york city","new york city","chrysler building manhattan new york city","reference to jack the ripper","television reporter","television news","revolver","picketing","panties","mayoral campaign","labor union","football stadium","firetruck","firefighter","drunkenness","cigar smoking","child in peril","burning building","bridge","betting","revolving door","subway","wheelchair","politician","firefighting","helicopter","body landing on a car","graffiti","product placement","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 19:50:45"}}