{"data":{"movies":[{"title":"The Autograph Hound","originalTitle":"","year":"1939","releaseDate":"19390901","directors":[{"name":"Jack King","id":"nm0454790"}],"writers":[],"runtime":"8 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjg1NTExM15BMl5BanBnXkFtZTcwNDc4NDAwMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Family","Animation","Comedy","Short"],"plot":"Autograph hound Donald, despite the security guard, manages to get signatures from , 'Mickey Rooney', , The Ritz Brothers, and before he's recognized and everyone wants his autograph.","simplePlot":"Autograph hound Donald, despite the security guard, manages to get signatures from , 'Mickey Rooney', , The Ritz Brothers, and before he's recognized ... ","actors":[{"actorName":"Sara Berner","urlProfile":"http://www.imdb.com/name/nm0076700","urlPhoto":"","biography":{"dateOfBirth":"12 January 1912","placeOfBirth":" Albany, New York, USA","birthName":"Lillian Herdan","bio":"This accomplished voice actress with an ear for accents, first made her mark on Jack Benny's radio program in the dual role of wisecracking, gum-chewing telephone operator Mabel Flapsaddle and Jack's plumber girlfriend Gladys. Brunette Sara Berner's real name was Lillian Herdan and she was born in Albany, New York, in January 1912. Her family moved to Oklahoma where she studied drama for two years at Tulsa University. Before she came to notice with the Major Bowes Amateur Hour on radio to embark on nationwide tours with their all-girl unit, Sara's instinctive talents sometimes got her into trouble -- such as being fired from an earlier job as a salesgirl at a Philadelphia department store for mimicking the customers. Of course, this turned out to be a blessing. Job offers in the entertainment industry abounded in the 1930's and 40's for those who possessed genuine talent, and, above all, versatility. As both a comedienne and a natural dialectician, Sara went on to earn five times the salary she would have made in retail. Her stock in trade were exaggerated ethnic dialects, her gallery of voices including Hillbilly, Yiddish (Mrs. Horowitz in \"Life with Luigi\"), Italian (Mrs. Mataratza on \"The Jimmy Durante Show\"), Spanish (Chiquita on the Gene Autry program), Greek, Polish and Armenian (to get the hang of this one, she resorted to telephoning assorted Armenian rug dealers!). By 1950, Sara had her own comedy detective series on network radio -- \"Sara's Private Caper\" -- as a former police secretary, turned sleuth. Sadly, despite the assemblage of a good supporting cast, the show flopped (then again, this was something even the great Mel Blanc had experienced four years earlier). Beginning in 1933, Sara worked extensively in Hollywood -- primarily in animation -- though rarely receiving screen credit. She was particularly successful mimicking Katharine Hepburn's voice, which she first did to much acclaim on the \"Eddie Cantor Show\". This led to a spate of cartoon roles with Walt Disney (Mother Goose Goes Hollywood (1938)); Walter Lantz (Hollywood Bowl (1938)) and Leon Schlesinger at Warner Brothers (Daffy Duck in Hollywood (1938)). Perhaps her 'signature voice' from those years was that of Beaky Buzzard's Italian Mamma, first heard on The Bashful Buzzard (1945). That same year, she also voiced the cartoon mouse Jerry, dancing with Gene Kelly in Anchors Aweigh (1945). According to a 1949 news article -- shortly after the movie was broadcast -- Sara received a parcel with an assortment of cheeses from a Wisconsin admirer. Such can be the fringe benefits of fame. Her subsequent work in animation encompassed providing the voices for Andy Panda and cartoon penguin Chilly Willy for Walter Lantz's studio. There was also regular work as a small-part supporting player in films and television. Sara repeated her Mabel role on The Jack Benny Program (1950). Other than that, she was destined to round off her career in no-name parts, cameos and walk-ons, most memorably as the dog-owning upstairs neighbour in Alfred Hitchcock's Rear Window (1954). Sara made her final TV appearance in 1967 and died just two years later in Van Nuys, California, aged 57.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0076700","name":"Sara Berner","idIMDB":"nm0076700"},"actorId":"nm0076700","character":"Greta Garbo / Shirley Temple / Bette Davis / Katharine Hepburn / Martha Raye / Joan Crawford","urlCharacter":"http://www.imdb.com/character/ch0049901","main":true},{"actorName":"Billy Bletcher","urlProfile":"http://www.imdb.com/name/nm0088285","urlPhoto":"","biography":{"dateOfBirth":"24 September 1894","placeOfBirth":" Lancaster, Pennsylvania, USA","birthName":"William Bletcher","height":"5' 2\" (1.57 m)","bio":"Billy Bletcher, standing 5' 2\", was known as the little guy with the big voice, who, ironically, started his film career during the silent era. Billy's show business career began in 1913 at the age of 19 in vaudeville, and within a year, he went to work for Vitagraph Studios in Brooklyn where he both acted and directed. Two years later, he met his wife, Arline Harriett Roberts with whom he would stay married until the day he died in 1979. In 1917, he took his wife westward to Hollywood where he started with smaller production companies, such as the Christie Film Company, writing and acting in shorts, and then moved on to larger and larger companies, such as the Fox Film Corporation where he did a few cowboy movies, one with Tom Mix, playing the comedic element. Then onto larger companies, such as Warner Brothers, RKO, Columbia, and Paramount where he had mostly bit parts, but got experience working with the likes of The Three Stooges and The Marx Brothers. But it was in Mack Sennett's comedy troupe where he started getting recognition doing two-reelers, and his biggest break came when Hal Roach studios pared him with Billy Gilbert and his career took off. Because pictures now had sound, directors and studios everywhere were clamoring for his deep, rich voice. Mack Sennett and Hal Roach put Bletcher in shorts with W.C. Fields and Laurel and Hardy and he even played Spanky's father in the Little Rascals series, but it was Disney who made Bletcher a star. Pinto Colvig, the original voice of Goofy and Pluto, told Bletcher that Disney needed a big, blustering voice to \"huff and puff and blow your house in,\" so he tried out, got the job, and within a very short time, Disney had him doing a session a week in the sound booth, sometimes doing two and three voices. His voice got so famous that when he auditioned to do the voice of one of the seven dwarfs in Blanche Neige et les sept nains (1937), Walt Disney took him aside and told him, \"Billy, your voice is heard so much in all of these singles that I make, I don't think I'd want to use you as one of the Seven Dwarfs.\" Bletcher admits that because his voice was so low and resonant, the characters he got to play were usually the \"heavies\" (bad guys). And as a heavy his voice became too recognizable for him to get a role in a feature length Disney production, with one exception: he did get a minor role in Dumbo as the voice of one of the clowns. As a voice actor, he could go anywhere and soon found himself working for Leon Schlesinger at Warner Brothers, but never got credit for his work since Mel Blanc had it in his contract that he'd be the sole credit for voice characterizations. And at that time there were only a dozen or so actors doing voicework that the jobs were plentiful. He worked for Disney, Warner, and at MGM he did the voice of the Captain in the Captain and the Kids cartoons. In the fifties, he did several characters on the Lone Ranger radio program, but before that he did what's known in the business as ADR (automated dialogue replacement) work, with his old pal Pinto Colvig. In The Wizard of Oz (1939), their voices were substituted for a few of the munchkins. All in all, Bletcher worked on just over 450 films spanning nearly 60 years, his last film being a made-for-TV version of Li'l Abner (1971) in which he played Pappy Yokum. He passed away 13 years later at the age of 84.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0088285","name":"Billy Bletcher","idIMDB":"nm0088285"},"actorId":"nm0088285","character":"Security Guard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clarence Nash","urlProfile":"http://www.imdb.com/name/nm0621699","urlPhoto":"","biography":{"dateOfBirth":"7 December 1904","placeOfBirth":" Watonga, Oklahoma, USA","birthName":"Clarence Charles Nash","height":"5' 2\" (1.57 m)","bio":"Clarence Nash was born on December 7, 1904 in Watonga, Oklahoma, USA as Clarence Charles Nash. He was an actor, known for The Three Caballeros (1944), Mickey and the Beanstalk (1947) and Mickey's Christmas Carol (1983). He was married to Margaret Seamans. He died on February 20, 1985 in Glendale, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0621699","name":"Clarence Nash","nicknames":["Ducky","Charlie Nash"],"idIMDB":"nm0621699"},"actorId":"nm0621699","character":"Donald Duck","urlCharacter":"http://www.imdb.com/character/ch0000719","main":true}],"seasons":[],"idIMDB":"tt0031064","urlIMDB":"http://www.imdb.com/title/tt0031064","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["8 min (Argentina)","8 min (USA)"],"soundMix":["Mono"],"color":["Color (Technicolor)"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":["Technicolor"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm","8 mm"]},"rating":"7.3","filmingLocations":[],"awards":[],"votes":"432","type":"Movie","companyCreditsSimple":[{"idCompany":"co0098836","name":"Walt Disney Productions"}],"keywords":{"keywords":["1930s","anthropomorphism","anthropomorphic animal","reference to the marx brothers","obsessed fan","revolving door","celebrity caricature"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:28:52"}}