{"data":{"movies":[{"title":"Road House","originalTitle":"","year":"1989","releaseDate":"19890519","directors":[{"name":"Rowdy Herrington","id":"nm0380705"}],"writers":[{"name":"R. Lance Hill","id":"nm0377792"},{"name":"R. Lance Hill","id":"nm0377792"}],"runtime":"114 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MTE2Mjk2OF5BMl5BanBnXkFtZTcwMTUzNjYzNA@@._V1.jpg","countries":["USA"],"languages":["English","Portuguese"],"genres":["Action","Thriller"],"plot":"Dalton is the Cooler in bars; He backs up and directs the bouncers. He takes a job in a Road House that has gotten far too rough. His attempts to clean things up put him in conflict with Brad Wesley, the town bully and rich person. Things heat up.","simplePlot":"A tough bouncer is hired to tame a dirty bar.","actors":[{"actorName":"Patrick Swayze","urlProfile":"http://www.imdb.com/name/nm0000664","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM2NjI0MjYyMV5BMl5BanBnXkFtZTYwMjY1ODMz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1952","placeOfBirth":" Houston, Texas, USA","birthName":"Patrick Wayne Swayze","height":"5' 10\" (1.78 m)","bio":"Patrick Wayne Swayze was born on August 18, 1952 in Houston, Texas, to Patsy Swayze (née Yvonne Helen Karnes), a choreographer, and Jesse Wayne Swayze, a chemical plant engineer draftsman. His mother owned a dance school in Houston, where Patrick was also a student. His father passed away in 1982. He graduated from Waltrip High School in Houston, and attended San Jacinto College in Pasadena, Texas. He married actress/dancer Lisa Niemi on June 12, 1975, whom he had known when she was 15 and a student at his mother's dance school. His New York City dance training included the Harkness Ballet School and Joffrey Ballet School. He first danced professionally as \"Prince Charming\" in \"Disney on Parade\". After a stint as \"Danny Zuko\" in the original Broadway production of \"Grease\", he made his film debut with a small role in Skatetown, U.S.A. (1979). He made his television debut in 1981 on M*A*S*H (1972), as a soldier diagnosed with leukemia. After many supporting roles in films and a lead role in the TV mini-series North and South (1985), he landed his breakthrough role as dance instructor \"Johnny Castle\" in the hit film Dirty Dancing (1987), for which he received a Golden Globe nomination. He received a second nomination for his portrayal of \"Sam Wheat\" in the blockbuster Ghost (1990). Ghost (1990) was the highest-grossing film of 1990, and at one point, the fourth highest-grossing film of all time. Unfortunately, he did not capitalize on its success. His subsequent films like La cité de la joie (1992), Tall Tale (1995), Black Dog (1998), and Waking Up in Reno (2002) did not fare well with critics or audiences. In December 2003, he returned to Broadway as a replacement for the lead role of \"Billy Flynn\" in the acclaimed revival of John Kander & Fred Ebb's musical, \"Chicago\". The production also went on tour in several cities of the United States, including Los Angeles. In January 2008, he was diagnosed with pancreatic cancer. He fought the illness for well over a year and was able to continue working, but died on September 14, 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM2NjI0MjYyMV5BMl5BanBnXkFtZTYwMjY1ODMz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000664","name":"Patrick Swayze","nicknames":["Buddy"],"idIMDB":"nm0000664"},"actorId":"nm0000664","character":"Dalton","urlCharacter":"http://www.imdb.com/character/ch0018224","main":true},{"actorName":"Kelly Lynch","urlProfile":"http://www.imdb.com/name/nm0001488","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODkwNzQ5MTE4Nl5BMl5BanBnXkFtZTYwNDUzMjE1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 January 1959","placeOfBirth":" Golden Valley, Minnesota, USA","birthName":"Kelly Ann Lynch","height":"5' 9\" (1.75 m)","bio":"Kelly Lynch was born in 1959 in Minneapolis, Minnesota. She started her acting career with a small job at the Guthrie Theater. She studied under acting teacher Sanford Meisner and became a model for the famous Elite Modeling Agency. She first gained acclaim for acting in the Gus Van Sant film Drugstore Cowboy (1989). Lynch earned an Independent Spirit Award nomination for her role in The Beans of Egypt, Maine (1994). She stars in the 20th-Century Fox film Homegrown (1998), co-starring Hank Azaria and Billy Bob Thornton.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODkwNzQ5MTE4Nl5BMl5BanBnXkFtZTYwNDUzMjE1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001488","name":"Kelly Lynch","idIMDB":"nm0001488"},"actorId":"nm0001488","character":"Doc","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Elliott","urlProfile":"http://www.imdb.com/name/nm0000385","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTk4NDgzMl5BMl5BanBnXkFtZTYwNjU5Nzc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1944","placeOfBirth":" Sacramento, California, USA","birthName":"Samuel Pack Elliott","height":"6' 2\" (1.88 m)","bio":"Tall, thin, wiry Sam Elliott is the classic picture of the American cowboy. Elliott began his acting career on the stage and his film debut was in Butch Cassidy and the Sundance Kid (1969). Although his future wife, Katharine Ross co-starred in the film, the two did not meet until they filmed The Legacy (1978) Together. Over the years there would be few opportunities to act in feature westerns, but it would be television that gave him that opportunity, in The Sacketts (1979), The Shadow Riders (1982) and The Yellow Rose (1983), among others. He would also work in non-westerns, usually as a tough guy, as in Lifeguard (1976) and Road House (1989). In the 1990s, Elliott was back on the western trail, playing everyone from Brig. Gen. John Buford in the film Gettysburg (1993) to Wild Bill Hickok in the made-for-TV movie Buffalo Girls (1995). In 1991 he wrote the screenplay and co-starred with his wife in the made-for-TV western Conagher (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTk4NDgzMl5BMl5BanBnXkFtZTYwNjU5Nzc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000385","name":"Sam Elliott","idIMDB":"nm0000385"},"actorId":"nm0000385","character":"Wade Garrett","urlCharacter":"http://www.imdb.com/character/ch0018225","main":true},{"actorName":"Ben Gazzara","urlProfile":"http://www.imdb.com/name/nm0001262","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NzA5NTAyOF5BMl5BanBnXkFtZTcwNDM0MDYzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1930","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Biagio Anthony Gazzara","height":"5' 10½\" (1.79 m)","bio":"Ben Gazzara's screen career began with two critically acclaimed roles as heavies in the late 1950s. He turned to television in the 1960s but made a big screen comeback with roles in three John Cassavetes films in the 1970s. The 1980s and 1990s saw Gazzara work more frequently than ever before in character parts. If he never became the leading man his early films and stage work promised, he had a career notable for its longevity. He was born Biagio Anthony Gazzara on August 28, 1930, in New York City. The son of a Sicilian immigrant laborer, he grew up on New York's tough Lower East Side. After seeing Laurette Taylor in \"The Glass Menagerie,\" Gazzara decided he wanted to become an actor. He studied engineering (unhappily) but quit after receiving an acting scholarship (he worked under well-known coach Erwin Piscator). Gazzara then joined the Actors Studio, where a group of students improvised a play from Calder Willingham's novel End as a Man. The tale of a brutal southern military academy reached Broadway slightly changed in 1953 but with Gazzara still in the principal role. It was a star making part (he won a Theatre World award) and he then played leads in the original productions of \"Cat on a Hot Tin Roof\" (1955) and \"A Hatful of Rain\" (1955) (he was nominated for a Tony). Bigger names Paul Newman and Don Murray played those last two roles on the big screen but Gazzara made his movie debut in The Strange One (1957) the film version of \"End as a Man.\" The film was a critical but not commercial success. His next role was as the defendant in Anatomy of a Murder (1959) which was a big hit. Gazzara followed this with an Italian venture co-starring Anna Magnani, Larmes de joie (1960), two Hollywood films The Young Doctors (1961) and Convicts 4 (1962) and then another Italian film Conquered City (1962). None of these did much for his career, and he turned to television. He appeared in the successful series Arrest and Trial (1963) and Run for Your Life (1965). In between, he made A Rage to Live (1965), a film version of John O'Hara's novel. He returned to films in The Bridge at Remagen (1969) and with a cameo appearance in If It's Tuesday, This Must Be Belgium (1969). His buddy in the cameo was John Cassavetes, who directed and co-starred with him in Husbands (1970), a critical success. Gazzara made two more well-received films with his good friend Cassavetes: The Killing of a Chinese Bookie (1976) and Opening Night (1977). Gazzara's other films in the 1970s were undistinguished apart from the sprawling Voyage of the Damned (1976) and a rare leading role in director Peter Bogdanovich's Saint Jack (1979). Bloodline (1979) and They All Laughed (1981) (also directed by Bogdanovich) were only notable because of Gazzara's off-screen relationship with co-star Audrey Hepburn (ironically, Gazzara had declined to make his screen debut in War and Peace (1956) starring Hepburn). Conte de la folie ordinaire (1981) was another lead for Gazzara, but it received a mixed critical reception. Other big-screen roles in the 1980s were scarce apart from Road House (1989), a Patrick Swayze vehicle that Gazzara believed out of all his films had been the most repeated on television. He worked much on the small screen, including the groundbreaking television movie An Early Frost (1985), playing the father of an AIDS victim. The 1990s saw Gazzara working like never before, appearing in 38 films. Most were for free-to-air television or cable but he also worked on the big screen in The Spanish Prisoner (1997), The Big Lebowski (1998), Happiness (1998) and Summer of Sam (1999). His television work included a guest appearance as an executive assistant attorney in a 2001 episode of Law & Order: Special Victims Unit (1999)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NzA5NTAyOF5BMl5BanBnXkFtZTcwNDM0MDYzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001262","name":"Ben Gazzara","nicknames":["Benny"],"idIMDB":"nm0001262"},"actorId":"nm0001262","character":"Brad Wesley","urlCharacter":"http://www.imdb.com/character/ch0160009","main":true},{"actorName":"Marshall R. Teague","urlProfile":"http://www.imdb.com/name/nm0853549","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY1NmUxZDgtNmViMy00MGM3LTlkZDgtYzhmMWFkMTA1ZTZkXkEyXkFqcGdeQXVyNzM2MzkwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1953","placeOfBirth":" Tennessee, USA","height":"6' (1.83 m)","bio":"Marshall Teague is an American actor who has appeared in over 130 films and Tv shows. His talent for balancing starring roles with powerful supporting characters has allowed him to build a varied and pivotal body of work. His theatrical breakout role was as Jimmy Reno in the 1989 cult classic Road House. From there he went on to work in The Rock with Sean Connery and Armageddon with Bruce Willis to name a few. He was also reoccurring star on TV series like Walker Tx. Ranger, American Heiress, and Babylon 5. Marshall holds an industry record of 103 deaths on screen. In addition to his acting, Marshall is a motivational speaker, also an accomplished singer and song writer and has a CD titled 'The Steps I Took'. He is also a writer delving into fiction and fact. From villain to hero; cowboy to physician; drama to comedy; from contemporary settings to the surreal world of science fiction, Marshall Teague has traversed the acting spectrum.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY1NmUxZDgtNmViMy00MGM3LTlkZDgtYzhmMWFkMTA1ZTZkXkEyXkFqcGdeQXVyNzM2MzkwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0853549","name":"Marshall R. Teague","idIMDB":"nm0853549"},"actorId":"nm0853549","character":"Jimmy","urlCharacter":"http://www.imdb.com/character/ch0018229","main":true},{"actorName":"Julie Michaels","urlProfile":"http://www.imdb.com/name/nm0584395","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ5MzgzMTIxOV5BMl5BanBnXkFtZTgwODMzMjU2NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Julie Michaels, best known for her role opposite Patrick Swayze in the film Road House (1989), has quite literally fought her way out of the blonde bombshell image. Her graphic fight scene with Keanu Reeves in Kathryn Bigelow's Point Break - Extrême limite (1991) inspired the New York Times to dub her \"The babe who nuked Keanu\". She also killed \"Jason\" in Jason Goes to Hell: The Final Friday (1993) and tangled with Dwayne Johnson in The Scorpion King (2002). Hold on, not done yet . . . she also fought the \"Ultimate Fighter\" in John Herzfeld's 15 Minutes (2001). Born in the Northwest, Julie attended the University of Washington as an NCAA gymnast. She then went on to win two titles in the Miss America Pageant before being cast in \"Follies on Broadway\". Her studies ultimately took her to Asia to study martial arts. She continues to study under sensei Benny Urquidez. Joel Silver discovered Julie and cast her as a seductress to Swayze. Since then she has been paired opposite Dean Cain, was frozen by \"The Governator\" (Arnold Schwarzenegger) in Batman & Robin (1997) and was cast as a temptress soul in Witchboard 2 (1993). Along with her feature credits, Julie has made her mark in television as well, on shows such as Desperate Housewives (2004), In Justice (2006), The Suite Life of Zack and Cody (2005), 24 (2001), The Man Show (1999), She Spies (2002) and many more. No matter if the character Julie playing is seducing or destroying, the strength and power she brings to the screen proves she is the actress for the new millennium!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ5MzgzMTIxOV5BMl5BanBnXkFtZTgwODMzMjU2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0584395","name":"Julie Michaels","idIMDB":"nm0584395"},"actorId":"nm0584395","character":"Denise","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Red West","urlProfile":"http://www.imdb.com/name/nm0922307","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1Nzk3NDc4OF5BMl5BanBnXkFtZTgwMDk5OTMxNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 November 1936","placeOfBirth":" Memphis, Tennessee, USA","birthName":"Robert Gene West","height":"6' 2\" (1.88 m)","bio":"Robert \"Red\" Gene West was a close friend of Elvis Presley and a member of Presley's inner circle, known as \"The Memphis Mafia\". He first met Elvis in high school, where he was a year behind him. West played football for the Memphis Tigers high school football team, boxed in the Golden Gloves and played football for Jones Junior College playing center. West lived with his mother, Lois West, in the Hurt Housing project in Memphis. West became Elvis's personal driver in driving Elvis and band members Scotty Moore, Bill Black and later D.J. Fontana to different cities in the South for live appearances from 1955 to 1956. West served in the US Marine Corps from 1956 to late 1958 and was stationed in Norfolk, Virginia, which allowed him to stay in contact with Elvis. On August 14, 1958, West's estranged father, Newton Thomas West, died, the same day as Elvis' mother, Gladys Presley. After Elvis' discharge from the US Army in 1960, West was employed as one of Elvis' bodyguards. Over the years Elvis bought West a number of vehicles as he became a world-famous celebrity. West also became a movie stuntman and appeared in 16 of Elvis' films in the 1960s, usually playing extras or bit and supporting parts. West married one of Elvis' secretaries, Pat West, on July 1, 1961. A man of many talents, West became a songwriter for songs that Elvis, Pat Boone, Ricky Nelson and Johnny Rivers recorded, including the classic tune \"Separate Ways\" for Elvis, which won a BMI Award. In addition to the Elvis movies, West appeared in three Robert Conrad TV series The Wild Wild West (1965), Black Sheep Squadron (1976) and The Duke (1979). During the 1970s West, his cousin Del 'Sonny' West and 'Dave Hebler' served as Elvis' bodyguards, in charge of his daily transportation and, especially, in keeping weirdo, or potentially dangerous, fans away from him. On July 13, 1976, Vernon Presley, Elvis' father, fired West, Sonny West and Hebler after criticizing what he believed to be their heavy-handed tactics. The three of them collaborated on a book about their lives as Elvis' bodyguards, which was published just two weeks before Elvis' death in 1977. West has since continued his acting and songwriting careers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1Nzk3NDc4OF5BMl5BanBnXkFtZTgwMDk5OTMxNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0922307","name":"Red West","idIMDB":"nm0922307"},"actorId":"nm0922307","character":"Red Webster","urlCharacter":"http://www.imdb.com/character/ch0018230","main":true},{"actorName":"Sunshine Parker","urlProfile":"http://www.imdb.com/name/nm0662641","urlPhoto":"","biography":{"dateOfBirth":"10 June 1927","placeOfBirth":" Lawn, Texas, USA","birthName":"Lloyd Olen Parker","bio":"Sunshine Parker was born on June 10, 1927 in Lawn, Texas, USA as Lloyd Olen Parker. He was an actor, known for Tremors (1990), Road House (1989) and Pee-wee's Big Adventure (1985). He died on February 17, 1999 in Burbank, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0662641","name":"Sunshine Parker","idIMDB":"nm0662641"},"actorId":"nm0662641","character":"Emmet","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeff Healey","urlProfile":"http://www.imdb.com/name/nm0372254","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI2NTA2NTQwMV5BMl5BanBnXkFtZTcwMzc0NzU2NA@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 March 1966","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Norman Jeffrey Healey","bio":"Jeff Healey was born on March 25, 1966 in Toronto, Ontario, Canada as Norman Jeffrey Healey. He was married to Cristie Hall and Krista Miller. He died on March 2, 2008 in Toronto.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI2NTA2NTQwMV5BMl5BanBnXkFtZTcwMzc0NzU2NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0372254","name":"Jeff Healey","idIMDB":"nm0372254"},"actorId":"nm0372254","character":"Cody","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kevin Tighe","urlProfile":"http://www.imdb.com/name/nm0001798","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NjQ3NDU5Nl5BMl5BanBnXkFtZTcwMTE0NDg5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 August 1944","placeOfBirth":" Los Angeles, California, USA","birthName":"Jon Kevin Fishburn","height":"6' 1\" (1.85 m)","bio":"This beefy, genial-looking character actor was born Jon Kevin Fishburn in Los Angeles. Performing as a child from age 10, Tighe initially attended Pasadena City College. He later obtained a Master's Degree in Theater, then taught drama at USC. Living Bohemian-style out of a suitcase after he decided to pursue acting professionally, he was in the United Kingdom trying to obtain work at various prestigious theater companies when producer Jack Webb acquired his services for the Emergency! (1972) medical series alongside Robert Fuller, Julie London, Bobby Troup and Randolph Mantooth. Tighe gained TV stardom as paramedic Roy DeSoto and the series lasted six years. Along with that came a spin-off animated series and some follow-up TV-movies. He returned to acting study in order to refresh his skills during the slow \"post-Emergency\" period and managed to work with such inspiring notables as Stella Adler. His perseverance paid off with a steady stream of gray-haired character roles starting in the 80s -- predominantly in rugged fare. Although he made his Broadway debut with \"Open Admissions\" in 1984, the show folded after only a couple of weeks. On film, however, Kevin did quite well by appearing in such high-profile movies as Matewan (1987), where he first played a \"bad guy,\" Eight Men Out (1988), Road House (1989), Another 48 Hrs. (1990), City of Hope (1991), Newsies (1992), What's Eating Gilbert Grape (1993), Jade (1995) and Mumford (1999). On TV he has had a number of prime support rules over the years playing everything from Thomas Jefferson and William Randolph Hearst to the Kansas patriarch who was senselessly slaughtered along with his family by the \"In Cold Blood\" killers. Known for his serious-minded roles, Kevin has tackled a number of generals, attorneys, governors, doctors, coaches, even psychics during his long career. He won the Canadian \"Genie\" Award for his supporting role in A Man in Uniform (1993). His only child, Jennifer Tighe, is also an actress.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NjQ3NDU5Nl5BMl5BanBnXkFtZTcwMTE0NDg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001798","name":"Kevin Tighe","idIMDB":"nm0001798"},"actorId":"nm0001798","character":"Tilghman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Doe","urlProfile":"http://www.imdb.com/name/nm0230335","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODUyNzM1NzY0NF5BMl5BanBnXkFtZTYwNjk5ODQ0._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 February 1953","placeOfBirth":" Decatur, Illinois, USA","birthName":"John Nommenson Duchac","bio":"John Doe was born on February 25, 1953 in Decatur, Illinois, USA as John Nommenson Duchac. He is an actor, known for The Bodyguard (1992), Great Balls of Fire! (1989) and The Good Girl (2002). He has been married to Gigi Blair since 1987. They have three children. He was previously married to Exene Cervenka.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODUyNzM1NzY0NF5BMl5BanBnXkFtZTYwNjk5ODQ0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0230335","name":"John Doe","idIMDB":"nm0230335"},"actorId":"nm0230335","character":"Pat McGurn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kathleen Wilhoite","urlProfile":"http://www.imdb.com/name/nm0001849","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgwMTU5OTIzOF5BMl5BanBnXkFtZTcwMzczNzUwNg@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1964","placeOfBirth":" Santa Barbara, California, USA","birthName":"Kathleen Alice Wilhoite","height":"5' 5\" (1.65 m)","bio":"Born in 1964, Kathleen Wilhoite grew up in Santa Barbara, California, and began singing in her church choir from the first grade. Two years later, she was performing on stage, as part of a back-up choir, with The Carpenters, at the Santa Barbara County Bowl. All the while, she studied piano and songwriting and appeared in her high school's theater productions, such as \"The House of Blue Leaves\". Kathleen wrote and sang as one of the \"Boogie Woogie Bugle Girls\", a harmony group inspired by The Andrews Sisters. She also became the youngest member of the Santa Barbara Songwriters Guild (age 16). After high school, Kathleen elected to pursue an acting career, as opposed to music, and enrolled at the USC Drama School. Just a couple of months later, she landed her first movie role in Private School (1983). Throughout the 1980s, she appeared in a number of film and TV projects as both leads and second leads where her brash sexuality and unconventional style was eagerly put on display. She appeared noticeably opposite Charles Bronson in Murphy's Law (1986), Jane Fonda in The Morning After (1986), Robert De Niro in Angel Heart (1987), Amy Irving in Crossing Delancey (1988), Patrick Swayze in Road House (1989), and Debra Winger and Nick Nolte in Everybody Wins (1990), and Susan Sarandon and Nolte in Lorenzo's Oil (1992). While her acting career flourished, she continued to expand her music skills but was dealt with a few setbacks, including a contract with Mercury Records that fell through. After a brief sojourn to Texas to refocus intently on her music, Kathleen returned to the Hollywood rat race and eased back in as a \"working actress\". A variety of offbeat roles in such movies as Nurse Betty (2000) and Pay It Forward (2000) has kept her name active on the credits list for over two decades. She landed a number of challenging roles on such shows as L.A. Law (1986) and ER (1994) and, more recently, Gilmore Girls (2000) -- portraying everything from drugged-out moms to the mentally-challenged. In the late 1980s, Kathleen was chosen by cartoonist Cathy Guisewite to give vocal life to her \"Cathy\" creation on animated TV. Married to record producer/drummer David Harte and the mother of three children, Kathleen was signed by her husband to his \"The Daves\" record label (the other \"Dave\" is booking agent David Surnow) and released two CDS - \"Pitch Like a Girl\" (1997) and \"Shiva\" (2000). In sync with both her edgy acting and music style, she wrote and performed an autobiographical one-woman show, \"Stop Yellin',\" directed by Kathy Najimy, in which she sings her own music and performs monologues.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgwMTU5OTIzOF5BMl5BanBnXkFtZTcwMzczNzUwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001849","name":"Kathleen Wilhoite","idIMDB":"nm0001849"},"actorId":"nm0001849","character":"Carrie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Travis McKenna","urlProfile":"http://www.imdb.com/name/nm0571438","urlPhoto":"","biography":{"dateOfBirth":"18 July 1960","placeOfBirth":" Lutherville, Maryland, USA","height":"6' 3\" (1.91 m)","bio":"Travis McKenna was born on July 18, 1960 in Lutherville, Maryland, USA. He is known for his work on Batman Returns (1992), Road House (1989) and Van Wilder: Party Liaison (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0571438","name":"Travis McKenna","nicknames":["T Bone"],"idIMDB":"nm0571438"},"actorId":"nm0571438","character":"Jack","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roger Hewlett","urlProfile":"http://www.imdb.com/name/nm0382122","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWQ5N2YyNDAtY2YzNy00YjdmLWI4NzQtZmE2M2Y3MzU2ZGE2XkEyXkFqcGdeQXVyNDY5ODU4MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 May 1958","placeOfBirth":" Joliet, Illinois, USA","bio":"Roger Hewlett was born on May 2, 1958 in Joliet, Illinois, USA. He is known for his work on Changeling (2008), Road House (1989) and Earth to Echo (2014).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWQ5N2YyNDAtY2YzNy00YjdmLWI4NzQtZmE2M2Y3MzU2ZGE2XkEyXkFqcGdeQXVyNDY5ODU4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0382122","name":"Roger Hewlett","idIMDB":"nm0382122"},"actorId":"nm0382122","character":"Younger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kurt James Stefka","urlProfile":"http://www.imdb.com/name/nm0825184","urlPhoto":"","biography":{"bio":"Kurt James Stefka is an actor, known for Road House (1989), The Adventures of Ford Fairlane (1990) and The Substitute (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0825184","name":"Kurt James Stefka","idIMDB":"nm0825184"},"actorId":"nm0825184","character":"Hank","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0098206","urlIMDB":"http://www.imdb.com/title/tt0098206","business":{"budget":{"money":"$17,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"SEK","country":"7,356,706","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1988/\">1988</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 54 min (114 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm (Eastman 400T 5295, 250D 5297)"],"cinematographicProcess":["Panavision"],"printedFilmFormat":["35 mm"]},"rating":"6.5","filmingLocations":[{"location":"24650 Arch St, Santa Clarita, California, USA"}],"rated":"R","awards":[{"award":"Razzie Awards 1990","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Picture","names":[{"name":"Joel Silver","id":"nm0005428","role":null}]},{"category":"Worst Actor","names":[{"name":"Patrick Swayze","id":"nm0000664","role":null},{"name":"Next of Kin","id":"tt0097967","role":null}]},{"category":"Worst Supporting Actor","names":[{"name":"Ben Gazzara","id":"nm0001262","role":null}]},{"category":"Worst Director","names":[{"name":"Rowdy Herrington","id":"nm0380705","role":null}]},{"category":"Worst Screenplay","names":[{"name":"R. Lance Hill","id":"nm0377792","role":"also story"},{"name":"Hilary Henkin","id":"nm0377088","role":null}]}]}]}],"votes":"45,551","type":"Movie","companyCreditsSimple":[{"idCompany":"co0019968","name":"Silver Pictures"},{"idCompany":"co0074647","name":"Star Partners II Ltd."}],"keywords":{"keywords":["violence","bikini","cult film","fired from the job","organized crime","martial arts","bouncer","bar","doctor","love","bully","old friend","stage","car","car dealership","gay subtext","blood splatter","breasts","electronic music score","having sex with skirt hiked up","wet g string contest","strip club","leg spreading","lust","copulation","sex in bed","female removes her dress","female removes her clothes","mini skirt","upskirt","girl in panties","white panties","panties","voyeur","voyeurism","nipples visible through clothing","public nudity","female frontal nudity","female nudity","no panties","scantily clad female","cleavage","man naked under covers","nude sleeping","kissing while having sex","explosion","revenge plot","shot to death","revolver","reluctant hero","good versus evil","karate kick","karate chop","roundhouse kick","kickboxing","blood","semiautomatic pistol","chop socky","first part","pump action shotgun","pistol","disarming someone","martial artist","martial arts master","mixed martial arts","one against many","opening action scene","action hero","hero","blind singer","hand to hand combat","blonde","karate","neon sign","diner","stripping","sex standing up","rear entry sex","male rear nudity","female rear nudity","breast fondling","bare butt","redneck","drifter","fish out of water","dance","concert","underwear","uncle niece relationship","tai chi","tough guy","stuffed animal","strip joint","spear","skinny dipping","shotgun","shattering glass","scar","rock music","polar bear","pick up","passionate kiss","mullet haircut","mirror","lake","kicked in the head","jukebox","jeep","henchman","guitarist","flat tire","firefighter","fire truck","female doctor","fat man","falling from height","exploding car","dark past","country music","convertible","cigarette smoking","burning building","bar keeper","acting musician","waitress","tycoon","trophy animal","thug","thrown through a window","throat slitting","table dance","small business","sex on first date","self defense","protection racket","protection money","derringer","mentor","male nudity","stabbed in the stomach","knife","knife wound","knife attack","kung fu","hospital","horse","gun","general store","bloody nose","one man army","exploding building","embezzler","embezzlement","drug dealing","car dealer","business tycoon","blindness","automobile salesman","arson","bar fight","bar brawl","rivalry","brawl","beer drinking","pool hall","swimming pool","murder","motorcycle","convicted felon","billiards","fistfight","revenge","helicopter","showdown","small town","automobile","machismo","vandalism","severe tire damage","class differences","nightclub","monster truck","stripper","pool cue","parking garage"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 01:54:41"}}