{"data":{"movies":[{"title":"The Missouri Breaks","originalTitle":"","year":"1976","releaseDate":"19760522","directors":[{"name":"Arthur Penn","id":"nm0671957"}],"writers":[{"name":"Thomas McGuane","id":"nm0570078"}],"runtime":"126 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NDY1Mzg5NF5BMl5BanBnXkFtZTcwMTIzODI1NA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Western"],"plot":"Tom Logan is a horse thief. Rancher David Braxton has horses, and a daughter, worth stealing. But Braxton has just hired Lee Clayton, an infamous \"regulator\", to hunt down the horse thieves; one at a time.","simplePlot":"Tom Logan is a horse thief. Rancher David Braxton has horses, and a daughter, worth stealing. But Braxton has just hired Lee Clayton, an infamous \"regulator\", to hunt down the horse thieves; one at a time.","actors":[{"actorName":"Marlon Brando","urlProfile":"http://www.imdb.com/name/nm0000008","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDYyMDE5OF5BMl5BanBnXkFtZTcwNjgyNTEzNA@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1924","placeOfBirth":" Omaha, Nebraska, USA","birthName":"Marlon Brando Jr.","height":"5' 9\" (1.75 m)","bio":"Marlon Brando is widely considered the greatest movie actor of all time, rivaled only by the more theatrically oriented Laurence Olivier in terms of esteem. Unlike Olivier, who preferred the stage to the screen, Brando concentrated his talents on movies after bidding the Broadway stage adieu in 1949, a decision for which he was severely criticized when his star began to dim in the 1960s and he was excoriated for squandering his talents. No actor ever exerted such a profound influence on succeeding generations of actors as did Brando. More than 50 years after he first scorched the screen as Stanley Kowalski in the movie version of Tennessee Williams' A Streetcar Named Desire (1951) and a quarter-century after his last great performance as Col. Kurtz in Francis Ford Coppola's Apocalypse Now (1979), all American actors are still being measured by the yardstick that was Brando. It was if the shadow of John Barrymore, the great American actor closest to Brando in terms of talent and stardom, dominated the acting field up until the 1970s. He did not, nor did any other actor so dominate the public's consciousness of what WAS an actor before or since Brando's 1951 on-screen portrayal of Stanley made him a cultural icon. Brando eclipsed the reputation of other great actors circa 1950, such as Paul Muni and Fredric March. Only the luster of Spencer Tracy's reputation hasn't dimmed when seen in the starlight thrown off by Brando. However, neither Tracy nor Olivier created an entire school of acting just by the force of his personality. Brando did. Marlon Brando, Jr. was born on April 3, 1924, in Omaha, Nebraska, to Marlon Brando, Sr., a calcium carbonate salesman, and his artistically inclined wife, the former Dorothy Julia Pennebaker. \"Bud\" Brando was one of three children. His ancestry included English, Irish, German, Dutch, French Huguenot, Welsh, and Scottish; his surname originated with a distant German immigrant ancestor named \"Brandau\". His oldest sister Jocelyn Brando was also an actress, taking after their mother, who engaged in amateur theatricals and mentored a then-unknown Henry Fonda, another Nebraska native, in her role as director of the Omaha Community Playhouse. Frannie, Brando's other sibling, was a visual artist. Both Brando sisters contrived to leave the Midwest for New York City, Jocelyn to study acting and Frannie to study art. Marlon managed to escape the vocational doldrums forecast for him by his cold, distant father and his disapproving schoolteachers by striking out for The Big Apple in 1943, following Jocelyn into the acting profession. Acting was the only thing he was good at, for which he received praise, so he was determined to make it his career - a high-school dropout, he had nothing else to fall back on, having been rejected by the military due to a knee injury he incurred playing football at Shattuck Military Academy, Brando Sr.'s alma mater. The school booted Marlon out as incorrigible before graduation. Acting was a skill he honed as a child, the lonely son of alcoholic parents. With his father away on the road, and his mother frequently intoxicated to the point of stupefaction, the young Bud would play-act for her to draw her out of her stupor and to attract her attention and love. His mother was exceedingly neglectful, but he loved her, particularly for instilling in him a love of nature, a feeling which informed his character Paul in Le dernier Tango à Paris (1972) (\"Last Tango in Paris\") when he is recalling his childhood for his young lover Jeanne. \"I don't have many good memories,\" Paul confesses, and neither did Brando of his childhood. Sometimes he had to go down to the town jail to pick up his mother after she had spent the night in the drunk tank and bring her home, events that traumatized the young boy but may have been the grain that irritated the oyster of his talent, producing the pearls of his performances. Anthony Quinn, his Oscar-winning co-star in Viva Zapata! (1952) told Brando's first wife Anna Kashfi, \"I admire Marlon's talent, but I don't envy the pain that created it.\" Brando enrolled in Erwin Piscator's Dramatic Workshop at New York's New School, and was mentored by Stella Adler, a member of a famous Yiddish Theatre acting family. Adler helped introduce to the New York stage the \"emotional memory\" technique of Russian theatrical actor, director and impresario Konstantin Stanislavski, whose motto was \"Think of your own experiences and use them truthfully.\" The results of this meeting between an actor and the teacher preparing him for a life in the theater would mark a watershed in American acting and culture. Brando made his debut on the boards of Broadway on October 19, 1944, in \"I Remember Mama,\" a great success. As a young Broadway actor, Brando was invited by talent scouts from several different studios to screen-test for them, but he turned them down because he would not let himself be bound by the then-standard seven-year contract. Brando would make his film debut quite some time later in Fred Zinnemann's The Men (1950) for producer Stanley Kramer. Playing a paraplegic soldier, Brando brought new levels of realism to the screen, expanding on the verisimilitude brought to movies by Group Theatre alumni John Garfield, the predecessor closest to him in the raw power he projected on-screen. Ironically, it was Garfield whom producer Irene Mayer Selznick had chosen to play the lead in a new Tennessee Williams play she was about to produce, but negotiations broke down when Garfield demanded an ownership stake in \"A Streetcar Named Desire.\" Burt Lancaster was next approached, but couldn't get out of a prior film commitment. Then director Elia Kazan suggested Brando, whom he had directed to great effect in Maxwell Anderson's play \"Truckline Café,\" in which Brando co-starred with Karl Malden, who was to remain a close friend for the next 60 years. During the production of \"Truckline Café\", Kazan had found that Brando's presence was so magnetic, he had to re-block the play to keep Marlon near other major characters' stage business, as the audience could not take its eyes off of him. For the scene where Brando's character re-enters the stage after killing his wife, Kazan placed him upstage-center, partially obscured by scenery, but where the audience could still see him as Karl Malden and others played out their scene within the café set. When he eventually entered the scene, crying, the effect was electric. A young Pauline Kael, arriving late to the play, had to avert her eyes when Brando made this entrance as she believed the young actor on stage was having a real-life conniption. She did not look back until her escort commented that the young man was a great actor. The problem with casting Brando as Stanley was that he was much younger than the character as written by Williams. However, after a meeting between Brando and Williams, the playwright eagerly agreed that Brando would make an ideal Stanley. Williams believed that by casting a younger actor, the Neanderthalish Kowalski would evolve from being a vicious older man to someone whose unintentional cruelty can be attributed to his youthful ignorance. Brando ultimately was dissatisfied with his performance, though, saying he never was able to bring out the humor of the character, which was ironic as his characterization often drew laughs from the audience at the expense of Jessica Tandy's Blanche Dubois. During the out-of-town tryouts, Kazan realized that Brando's magnetism was attracting attention and audience sympathy away from Blanche to Stanley, which was not what the playwright intended. The audience's sympathy should be solely with Blanche, but many spectators were identifying with Stanley. Kazan queried Williams on the matter, broaching the idea of a slight rewrite to tip the scales back to more of a balance between Stanley and Blanche, but Williams demurred, smitten as he was by Brando, just like the preview audiences. For his part, Brando believed that the audience sided with his Stanley because Jessica Tandy was too shrill. He thought Vivien Leigh, who played the part in the movie, was ideal, as she was not only a great beauty but she WAS Blanche Dubois, troubled as she was in her real life by mental illness and nymphomania. Brando's appearance as Stanley on stage and on screen revolutionized American acting by introducing \"The Method\" into American consciousness and culture. Method acting, rooted in Adler's study at the Moscow Art Theatre of Stanislavsky's theories that she subsequently introduced to the Group Theatre, was a more naturalistic style of performing, as it engendered a close identification of the actor with the character's emotions. Adler took first place among Brando's acting teachers, and socially she helped turn him from an unsophisticated Midwestern farm boy into a knowledgeable and cosmopolitan artist who one day would socialize with presidents. Brando didn't like the term \"The Method,\" which quickly became the prominent paradigm taught by such acting gurus as Lee Strasberg at the Actors Studio. Brando denounced Strasberg in his autobiography \"Songs My Mother Taught Me\" (1994), saying that he was a talentless exploiter who claimed he had been Brando's mentor. The Actors Studio had been founded by Strasberg along with Kazan and Stella Adler's husband, Harold Clurman, all Group Theatre alumni, all political progressives deeply committed to the didactic function of the stage. Brando credits his knowledge of the craft to Adler and Kazan, while Kazan in his autobiography \"A Life\" claimed that Brando's genius thrived due to the thorough training Adler had given him. Adler's method emphasized that authenticity in acting is achieved by drawing on inner reality to expose deep emotional experience Interestingly, Elia Kazan believed that Brando had ruined two generations of actors, his contemporaries and those who came after him, all wanting to emulate the great Brando by employing The Method. Kazan felt that Brando was never a Method actor, that he had been highly trained by Adler and did not rely on gut instincts for his performances, as was commonly believed. Many a young actor, mistaken about the true roots of Brando's genius, thought that all it took was to find a character's motivation, empathize with the character through sense and memory association, and regurgitate it all on stage to become the character. That's not how the superbly trained Brando did it; he could, for example, play accents, whereas your average American Method actor could not. There was a method to Brando's art, Kazan felt, but it was not The Method. After A Streetcar Named Desire (1951), for which he received the first of his eight Academy Award nominations, Brando appeared in a string of Academy Award-nominated performances - in Viva Zapata! (1952), Julius Caesar (1953) and the summit of his early career, Kazan's On the Waterfront (1954). For his \"Waterfront\" portrayal of meat-headed longshoreman Terry Malloy, the washed-up pug who \"coulda been a contender,\" Brando won his first Oscar. Along with his iconic performance as the rebel-without-a-cause Johnny in The Wild One (1953) (\"What are you rebelling against?\" Johnny is asked. \"What have ya got?\" is his reply), the first wave of his career was, according to Jon Voight, unprecedented in its audacious presentation of such a wide range of great acting. Director John Huston said his performance of Marc Antony was like seeing the door of a furnace opened in a dark room, and co-star John Gielgud, the premier Shakespearean actor of the 20th century, invited Brando to join his repertory company. It was this period of 1951-54 that revolutionized American acting, spawning such imitators as James Dean - who modeled his acting and even his lifestyle on his hero Brando - the young Paul Newman and Steve McQueen. After Brando, every up-and-coming star with true acting talent and a brooding, alienated quality would be hailed as the \"New Brando,\" such as Warren Beatty in Kazan's Splendor in the Grass (1961). \"We are all Brando's children,\" Jack Nicholson pointed out in 1972. \"He gave us our freedom.\" He was truly \"The Godfather\" of American acting - and he was just 30 years old. Though he had a couple of failures, like Désirée (1954) and The Teahouse of the August Moon (1956), he was clearly miscast in them and hadn't sought out the parts so largely escaped blame. In the second period of his career, 1955-62, Brando managed to uniquely establish himself as a great actor who also was a Top 10 movie star, although that star began to dim after the box-office high point of his early career, Sayonara (1957) (for which he received his fifth Best Actor Oscar nomination). Brando tried his hand at directing a film, the well-reviewed One-Eyed Jacks (1961) that he made for his own production company, Pennebaker Productions (after his mother's maiden name). Stanley Kubrick had been hired to direct the film, but after months of script rewrites in which Brando participated, Kubrick and Brando had a falling out and Kubrick was sacked. According to his widow Christiane Kubrick, Stanley believed that Brando had wanted to direct the film himself all along. Tales proliferated about the profligacy of Brando the director, burning up a million and a half feet of expensive VistaVision film at 50 cents a foot, fully ten times the normal amount of raw stock expended during production of an equivalent motion picture. Brando took so long editing the film that he was never able to present the studio with a cut. Paramount took it away from him and tacked on a re-shot ending that Brando was dissatisfied with, as it made the Oedipal figure of Dad Longworth into a villain. In any normal film Dad would have been the heavy, but Brando believed that no one was innately evil, that it was a matter of an individual responding to, and being molded by, one's environment. It was not a black-and-white world, Brando felt, but a gray world in which once-decent people could do horrible things. This attitude explains his sympathetic portrayal of Nazi officer Christian Diestl in the film he made before shooting One-Eyed Jacks (1961), Edward Dmytryk's filming of Irwin Shaw's novel The Young Lions (1958). Shaw denounced Brando's performance, but audiences obviously disagreed, as the film was a major hit. It would be the last hit movie Brando would have for more than a decade. One-Eyed Jacks (1961) generated respectable numbers at the box office, but the production costs were exorbitant - a then-staggering $6 million - which made it run a deficit. A film essentially is \"made\" in the editing room, and Brando found cutting to be a terribly boring process, which was why the studio eventually took the film away from him. Despite his proved talent in handling actors and a large production, Brando never again directed another film, though he would claim that all actors essentially direct themselves during the shooting of a picture. Between the production and release of One-Eyed Jacks (1961), Brando appeared in Sidney Lumet's film version of Tennessee Williams' play \"Orpheus Descending\", The Fugitive Kind (1960) which teamed him with fellow Oscar winners Anna Magnani and Joanne Woodward. Following in Elizabeth Taylor's trailblazing footsteps, Brando became the second performer to receive a $1-million salary for a motion picture, so high were the expectations for this re-teaming of Kowalski and his creator (in 1961 critic Hollis Alpert had published a book \"Brando and the Shadow of Stanley Kowalski). Critics and audiences waiting for another incendiary display from Brando in a Williams work were disappointed when the renamed The Fugitive Kind (1960) finally released. Though Tennessee was hot, with movie versions of Cat on a Hot Tin Roof (1958) and Suddenly, Last Summer (1959) burning up the box office and receiving kudos from the Academy of Motion Picture Arts & Sciences, The Fugitive Kind (1960) was a failure. This was followed by the so-so box-office reception of One-Eyed Jacks (1961) in 1961 and then by a failure of a more monumental kind: Mutiny on the Bounty (1962), a remake of the famed 1935 film. Brando signed on to Mutiny on the Bounty (1962) after turning down the lead in the David Lean classic Lawrence of Arabia (1962) because he didn't want to spend a year in the desert riding around on a camel. He received another $1-million salary, plus $200,000 in overages as the shoot went overtime and over budget. During principal photography, highly respected director Carol Reed (an eventual Academy Award winner) was fired, and his replacement, two-time Oscar winner Lewis Milestone, was shunted aside by Brando as Marlon basically took over the direction of the film himself. The long shoot became so notorious that President John F. Kennedy asked director Billy Wilder at a cocktail party not \"when\" but \"if\" the \"Bounty\" shoot would ever be over. The MGM remake of one of its classic Golden Age films garnered a Best Picture Oscar nomination and was one of the top grossing films of 1962, yet failed to go into the black due to its Brobdingnagian budget estimated at $20 million, which is equivalent to $120 million when adjusted for inflation. Brando and Taylor, whose Cleopatra (1963) nearly bankrupted 20th Century-Fox due to its huge cost overruns (its final budget was more than twice that of Brando's Mutiny on the Bounty (1962)), were pilloried by the show business press for being the epitome of the pampered, self-indulgent stars who were ruining the industry. Seeking scapegoats, the Hollywood press conveniently ignored the financial pressures on the studios. The studios had been hurt by television and by the antitrust-mandated divestiture of their movie theater chains, causing a large outflow of production to Italy and other countries in the 1950s and 1960s in order to lower costs. The studio bosses, seeking to replicate such blockbuster hits as the remakes of The Ten Commandments (1956) and Ben-Hur (1959), were the real culprits behind the losses generated by large-budgeted films that found it impossible to recoup their costs despite long lines at the box office. While Elizabeth Taylor, receiving the unwanted gift of reams of publicity from her adulterous romance with Cleopatra (1963) co-star Richard Burton, remained hot until the tanking of her own Tennessee Williams-renamed debacle Boom! (1968), Brando from 1963 until the end of the decade appeared in one box-office failure after another as he worked out a contract he had signed with Universal Pictures. The industry had grown tired of Brando and his idiosyncrasies, though he continued to be offered prestige projects up through 1968. Some of the films Brando made in the 1960s were noble failures, such as The Ugly American (1963), The Appaloosa (1966) and Reflections in a Golden Eye (1967). For every \"Reflections,\" though, there seemed to be two or three outright debacles, such as Bedtime Story (1964), Morituri (1965), The Chase (1966), A Countess from Hong Kong (1967), Candy (1968), The Night of the Following Day (1968). By the time Brando began making the anti-colonialist picture Burn! (1969) in Colombia with Gillo Pontecorvo in the director's chair, he was box-office poison, despite having worked in the previous five years with such top directors as Arthur Penn, John Huston and the legendary Charles Chaplin, and with such top-drawer co-stars as David Niven, Yul Brynner, Sophia Loren and Taylor. The rap on Brando in the 1960s was that a great talent had ruined his potential to be America's answer to Laurence Olivier, as his friend William Redfield limned the dilemma in his book \"Letters from an Actor\" (1967), a memoir about Redfield's appearance in Burton's 1964 theatrical production of \"Hamlet.\" By failing to go back on stage and recharge his artistic batteries, something British actors such as Burton were not afraid to do, Brando had stifled his great talent, by refusing to tackle the classical repertoire and contemporary drama. Actors and critics had yearned for an American response to the high-acting style of the Brits, and while Method actors such as Rod Steiger tried to create an American style, they were hampered in their quest, as their king was lost in a wasteland of Hollywood movies that were beneath his talent. Many of his early supporters now turned on him, claiming he was a crass sellout. Despite evidence in such films as The Appaloosa (1966) and Reflections in a Golden Eye (1967) that Brando was in fact doing some of the best acting of his life, critics, perhaps with an eye on the box office, slammed him for failing to live up to, and nurture, his great gift. Brando's political activism, starting in the early 1960s with his championing of Native Americans' rights, followed by his participation in the Southern Christian Leadership Conference's March on Washington in 1963, and followed by his appearance at a Black Panther rally in 1968, did not win him many admirers in the establishment. In fact, there was a de facto embargo on Brando films in the recently segregated (officially, at least) southeastern US in the 1960s. Southern exhibitors simply would not book his films, and producers took notice. After 1968, Brando would not work for three years. Pauline Kael wrote of Brando that he was Fortune's fool. She drew a parallel with the latter career of John Barrymore, a similarly gifted thespian with talents as prodigious, who seemingly threw them away. Brando, like the late-career Barrymore, had become a great ham, evidenced by his turn as the faux Indian guru in the egregious Candy (1968), seemingly because the material was so beneath his talent. Most observers of Brando in the 1960s believed that he needed to be reunited with his old mentor Elia Kazan, a relationship that had soured due to Kazan's friendly testimony naming names before the notorious House Un-American Activities Committee. Perhaps Brando believed this, too, as he originally accepted an offer to appear as the star of Kazan's film adaptation of his own novel, The Arrangement (1969). However, after the assassination of Martin Luther King, Brando backed out of the film, telling Kazan that he could not appear in a Hollywood film after this tragedy. Also reportedly turning down a role opposite box-office king Paul Newman in a surefire script, Butch Cassidy and the Sundance Kid (1969), Brando decided to make Burn! (1969) with Pontecorvo. The film, a searing indictment of racism and colonialism, flopped at the box office but won the esteem of progressive critics and cultural arbiters such as Howard Zinn. He subsequently appeared in the British film The Nightcomers (1971), a prequel to \"Turn of the Screw\" and another critical and box office failure. Kazan, after a life in film and the theater, said that, aside from Orson Welles, whose greatness lay in filmmaking, he only met one actor who was a genius: Brando. Richard Burton, an intellectual with a keen eye for observation if not for his own film projects, said that he found Brando to be very bright, unlike the public perception of him as a Terry Malloy-type character that he himself inadvertently promoted through his boorish behavior. Brando's problem, Burton felt, was that he was unique, and that he had gotten too much fame too soon at too early an age. Cut off from being nurtured by normal contact with society, fame had distorted Brando's personality and his ability to cope with the world, as he had not had time to grow up outside the limelight. Truman Capote, who eviscerated Brando in print in the mid-'50s and had as much to do with the public perception of the dyslexic Brando as a dumbbell, always said that the best actors were ignorant, and that an intelligent person could not be a good actor. However, Brando was highly intelligent, and possessed of a rare genius in a then-deprecated art, acting. The problem that an intelligent performer has in movies is that it is the director, and not the actor, who has the power in his chosen field. Greatness in the other arts is defined by how much control the artist is able to exert over his chosen medium, but in movie acting, the medium is controlled by a person outside the individual artist. It is an axiom of the cinema that a performance, as is a film, is \"created\" in the cutting room, thus further removing the actor from control over his art. Brando had tried his hand at directing, in controlling the whole artistic enterprise, but he could not abide the cutting room, where a film and the film's performances are made. This lack of control over his art was the root of Brando's discontent with acting, with movies, and, eventually, with the whole wide world that invested so much cachet in movie actors, as long as \"they\" were at the top of the box-office charts. Hollywood was a matter of \"they\" and not the work, and Brando became disgusted. Charlton Heston, who participated in Martin Luther King's 1963 March on Washington with Brando, believes that Marlon was the great actor of his generation. However, noting a story that Brando had once refused a role in the early 1960s with the excuse \"How can I act when people are starving in India?\", Heston believes that it was this attitude, the inability to separate one's idealism from one's work, that prevented Brando from reaching his potential. As Rod Steiger once said, Brando had it all, great stardom and a great talent. He could have taken his audience on a trip to the stars, but he simply would not. Steiger, one of Brando's children even though a contemporary, could not understand it. When James Mason' was asked in 1971 who was the best American actor, he had replied that since Brando had let his career go belly-up, it had to be George C. Scott, by default. Paramount thought that only Laurence Olivier would suffice, but Lord Olivier was ill. The young director believed there was only one actor who could play godfather to the group of Young Turk actors he had assembled for his film, The Godfather of method acting himself - Marlon Brando. Francis Ford Coppola won the fight for Brando, Brando won - and refused - his second Oscar, and Paramount won a pot of gold by producing the then top-grossing film of all-time, The Godfather (1972), a gangster movie most critics now judge one of the greatest American films of all time. Brando followed his iconic portrayal of Don Corleone with his Oscar-nominated turn in the high-grossing and highly scandalous Le dernier Tango à Paris (1972) (\"Last Tango in Paris\"), the first film dealing explicitly with sexuality in which an actor of Brando's stature had participated. He was now again a Top-Ten box office star and once again heralded as the greatest actor of his generation, an unprecedented comeback that put him on the cover of \"Time\" magazine and would make him the highest-paid actor in the history of motion pictures by the end of the decade. Little did the world know that Brando, who had struggled through many projects in good faith during the 1960s, delivering some of his best acting, only to be excoriated and ignored as the films did not do well at the box office, essentially was through with the movies. After reaching the summit of his career, a rarefied atmosphere never reached before or since by any actor, Brando essentially walked away. He would give no more of himself after giving everything as he had done in Le dernier Tango à Paris (1972)\", a performance that embarrassed him, according to his autobiography. Brando had come as close to any actor to being the \"auteur,\" or author, of a film, as the English-language scenes of \"Tango\" were created by encouraging Brando to improvise. The improvisations were written down and turned into a shooting script, and the scripted improvisations were shot the next day. Pauline Kael, the Brando of movie critics in that she was the most influential arbiter of cinematic quality of her generation and spawned a whole legion of Kael wanna-bes, said Brando's performance in Le dernier Tango à Paris (1972) had revolutionized the art of film. Brando, who had to act to gain his mother's attention; Brando, who believed acting at best was nothing special as everyone in the world engaged in it every day of their lives to get what they wanted from other people; Brando, who believed acting at its worst was a childish charade and that movie stardom was a whorish fraud, would have agreed with Sam Peckinpah's summation of Pauline Kael: \"Pauline's a brilliant critic but sometimes she's just cracking walnuts with her ass.\" Probably in a simulacrum of those words, too. After another three-year hiatus, Brando took on just one more major role for the next 20 years, as the bounty hunter after Jack Nicholson in Arthur Penn's The Missouri Breaks (1976), a western that succeeded neither with the critics or at the box office. Following The Godfather and Tango, Brando's performance was disappointing for some reviewers, who accused him of giving an erratic and inconsistent performance. In 1977, Brando made a rare appearance on television in the miniseries Roots: The Next Generations (1979), portraying George Lincoln Rockwell; he won a Primetime Emmy Award for Outstanding Supporting Actor in a Miniseries or a Movie for his performance. In 1978, he narrated the English version of Raoni (1978), a French-Belgian documentary film directed by Jean-Pierre Dutilleux and Luiz Carlos Saldanha that focused on the life of Raoni Metuktire and issues surrounding the survival of the indigenous Indian tribes of north central Brazil. Later in his career, Brando concentrated on extracting the maximum amount of capital for the least amount of work from producers, as when he got the Salkind brothers to pony up a then-record $3.7 million against 10% of the gross for 13 days work on Superman (1978). Factoring in inflation, the straight salary for \"Superman\" equals or exceeds the new record of $1 million a day Harrison Ford set with K-19: The Widowmaker (2002). He agreed to the role only on assurance that he would be paid a large sum for what amounted to a small part, that he would not have to read the script beforehand, and his lines would be displayed somewhere off-camera. Brando also filmed scenes for the movie's sequel, Superman II, but after producers refused to pay him the same percentage he received for the first movie, he denied them permission to use the footage. Before cashing his first paycheck for Superman (1978), Brando had picked up $2 million for his extended cameo in Francis Ford Coppola's Apocalypse Now (1979) in a role, that of Col. Kurtz, that he authored on-camera through improvisation while Coppola shot take after take. It was Brando's last bravura star performance. He co-starred with George C. Scott and John Gielgud in La formule (1980), but the film was another critical and financial failure. Years later though, he did receive an eighth and final Oscar nomination for his supporting role in A Dry White Season (1989) after coming out of a near-decade-long retirement. Contrary to those who claimed he now only was in it for the money, Brando donated his entire seven-figure salary to an anti-apartheid charity. He then did an amusing performance in the comedy The Freshman (1990), winning rave reviews. He portrayed Tomas de Torquemada in the historical drama 1492: Christophe Colomb (1992), but his performance was denounced and the film was another box office failure. He made another comeback in the Johnny Depp romantic drama Don Juan DeMarco (1994), which co-starred Faye Dunaway as his wife. He then appeared in The Island of Dr. Moreau (1996), co-starring Val Kilmer, who he didn't get along with. The filming was an unpleasant experience for Brando, as well as another critical and box office failure. Brando had first attracted media attention at the age of 24, when \"Life\" magazine ran a photo of himself and his sister Jocelyn, who were both then appearing on Broadway. The curiosity continued, and snowballed. Playing the paraplegic soldier of The Men (1950), Brando had gone to live at a Veterans Administration hospital with actual disabled veterans, and confined himself to a wheelchair for weeks. It was an acting method, research, that no one in Hollywood had ever heard of before, and that willingness to experience life.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDYyMDE5OF5BMl5BanBnXkFtZTcwNjgyNTEzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000008","name":"Marlon Brando","nicknames":["Bud","Mr Mumbles"],"idIMDB":"nm0000008"},"actorId":"nm0000008","character":"Lee Clayton","urlCharacter":"http://www.imdb.com/character/ch0455466","main":true},{"actorName":"Jack Nicholson","urlProfile":"http://www.imdb.com/name/nm0000197","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3OTY0ODk0M15BMl5BanBnXkFtZTYwNzE4Njc4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 April 1937","placeOfBirth":" Neptune, New Jersey, USA","birthName":"John Joseph Nicholson","height":"5' 9¾\" (1.77 m)","bio":"Jack Nicholson, an American actor, producer, director and screenwriter, is a three-time Academy Award winner and twelve-time nominee. Nicholson is also notable for being one of two actors - the other being Michael Caine - who have received Oscar nomination in every decade from the 1960s through the 1990s. Nicholson was born on April 22, 1937 in Neptune, New Jersey. He was raised believing that his grandmother was his mother, and that his mother, June Frances Nicholson, a show-girl, was his older sister. He discovered the truth in 1975 from a Time magazine journalist who was researching a profile on him. His real father is believed to have been either Donald Furcillo, an Italian-American show-man, or Eddie King (Edgar Kirschfeld), born in Latvia and also in show-business. Jack's mother's ancestry was Irish, English, as well as German, Scottish and Welsh. Nicholson made his film debut in a B-movie titled The Cry Baby Killer (1958). His rise in Hollywood was far from meteoric, and for years, he sustained his career with guest spots in television series and a number of Roger Corman films, including The Little Shop of Horrors (1960). Nicholson's first turn in the director's chair was for Drive, He Said (1971). Before that, he wrote the screenplay for The Trip (1967), and co-wrote Head (1968), a vehicle for The Monkees. His big break came with Easy Rider (1969) and his portrayal of liquor-soaked attorney George Hanson, which earned Nicholson his first Oscar nomination. Nicholson's film career took off in the 1970s with a definitive performance in Five Easy Pieces (1970). Nicholson's other notable work during this period includes leading roles in Roman Polanski's noir masterpiece Chinatown (1974) and One Flew Over the Cuckoo's Nest (1975), for which he won his first Best Actor Oscar. The 1980s kicked off with another career-defining role for Nicholson as Jack Torrance in Stanley Kubrick's adaptation of Stephen King's novel The Shining (1980). A string of well-received films followed, including Terms of Endearment (1983) which earned Nicholson his second Oscar; Prizzi's Honor (1985) and The Witches of Eastwick (1987). He portrayed another renowned villain, The Joker, in Tim Burton's Batman (1989). In the 1990s, he starred in such varied films as A Few Good Men (1992), for which he received another Oscar nomination, and a dual role in Mars Attacks! (1996). Although a glimpse at the darker side of Nicholson's acting range reappeared in The Departed (2006), the actor's most recent roles highlight the physical and emotional complications one faces late in life. The most notable of these is the unapologetically misanthropic Melvin Udall in As Good as It Gets (1997), for which he won his third Academy Award. Shades of this persona are apparent in About Schmidt (2002), Something's Gotta Give (2003) and The Bucket List (2007). In addition to his Academy Awards and Oscar nominations, Nicholson has seven Golden Globe Awards, and received a Kennedy Center Honor in 2001. He also became one of the youngest actors to receive the American Film Institute's Life Achievement award in 1994. Nicholson has five children: Eldest daughter Jennifer Nicholson (b. 1963), from his marriage to Sandra Knight which ended in 1968; Caleb James Goddard (b. 1970) with Susan Anspach; Honey Hollman (b. 1981) with Danish supermodel, Winnie Hollman; and Lorraine Nicholson (b. 1990) and Ray Nicholson (b. 1992) with Rebecca Broussard. Nicholson's longest relationship was the seventeen years he spent with actress Anjelica Huston; this ended when Broussard become pregnant with his child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3OTY0ODk0M15BMl5BanBnXkFtZTYwNzE4Njc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000197","name":"Jack Nicholson","nicknames":["Mulholland Man","Nick"],"idIMDB":"nm0000197"},"actorId":"nm0000197","character":"Tom Logan","urlCharacter":"http://www.imdb.com/character/ch0455465","main":true},{"actorName":"Randy Quaid","urlProfile":"http://www.imdb.com/name/nm0001642","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NDEwMjU3N15BMl5BanBnXkFtZTcwNjk2MTc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1950","placeOfBirth":" Houston, Texas, USA","birthName":"Randy Randall Rudy Quaid","height":"6' 5\" (1.96 m)","bio":"Randy Quaid is an Academy Award-nominated actor, for his performance in The Last Detail (1973). Hal Ashby directed Quaid in the role of Meadows opposite Jack Nicholson and Otis Young. Quaid is a great and much admired actor that has been recognized by Hollywood and the worlds finest directors, Midnight Exspress, The last Picture Show, Ice Harvest (2005), Real Time (2008), King Carlos in Goya's Ghosts (2006) for director Milos Forman. Forman cast Quaid as \"King Carlos IV of Spain\" after seeing his Golden globe nominated performance as The Colonel in Elvis. Quaid also starred in such main stream favorites as Kingpin (1996), Vacation (1983), Christmas Vacation (1989) and Independence day (1996). Quaid earned a Golden Globe for portraying Lyndon Johnson, and received a Golden Globe Nomination for incarnating \"Colonel\" Tom Parker in Elvis (2005). The portrait of Colonel Parker, a former carnival barker with a murky past, is dark. The New York Times said \"Mr. Quaid is riveting as the bully of Graceland\", when he has Elvis firmly under his thumb, he is the L.B.J. of rock 'n' roll - a towering, wheedling, tirelessly self-promoting Southern fox in the rare instances when Elvis defies him, Colonel Parker shrinks into a hand-wringing phony, cajoling his only client in the overly ornate language of Professor Marvel in \"The Wizard of Oz\". Quaid stars in and was nominated for The Screen Actors Guild Award for Outstanding Performance by a cast for his work in Brokeback Mountain(2005), directed by Ang Lee from a script written by Larry McMurtry, who also wrote The Last Picture Show (1971) in which Quaid had his first feature film role. Working with McMurtry and supporting his material has become a Randy Quaid career tradition. Quaid's performance in Brokeback Mountain (2005) was listed as one of the New York Observer's 2005 Noteworthy male performances.In 2009 Randy Quaid Won the Vancouver Critics Award for Best Male performance in the Feature Film Real Time for the Role of Rubin an Australian Hit Man. Randy Quaid was born in Houston, Texas, to Juanita Bonniedale (Jordan), a real estate agent, and William Rudy Quaid, an electrician. He grew up in the Houston suburban city of Bellaire, along with his brother, actor Dennis Quaid. Quaid is married to American Film Director Evi Quaid.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NDEwMjU3N15BMl5BanBnXkFtZTcwNjk2MTc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001642","name":"Randy Quaid","idIMDB":"nm0001642"},"actorId":"nm0001642","character":"Little Tod","urlCharacter":"http://www.imdb.com/character/ch0455464","main":true},{"actorName":"Kathleen Lloyd","urlProfile":"http://www.imdb.com/name/nm0516049","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ4MDY1MDk2M15BMl5BanBnXkFtZTgwNDA4MTk0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 September 1948","placeOfBirth":" Santa Clara, California, USA","birthName":"Kathleen Gackle","bio":"Kathleen Lloyd was born on September 13, 1948 in Santa Clara, California, USA as Kathleen Gackle. She is an actress, known for The Car (1977), The Missouri Breaks (1976) and It Lives Again (1978).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ4MDY1MDk2M15BMl5BanBnXkFtZTgwNDA4MTk0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0516049","name":"Kathleen Lloyd","idIMDB":"nm0516049"},"actorId":"nm0516049","character":"Jane Braxton","urlCharacter":"http://www.imdb.com/character/ch0455463","main":true},{"actorName":"Frederic Forrest","urlProfile":"http://www.imdb.com/name/nm0002078","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNDIyMDQwN15BMl5BanBnXkFtZTYwMzM5NzE1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 December 1936","placeOfBirth":" Waxahachie, Texas, USA","birthName":"Frederic Fenimore Forrest Jr.","height":"5' 10\" (1.78 m)","bio":"Frederic Forrest, the Oscar-nominated character actor, was born two days before Christmas Day 1936 in Waxahachie, Texas, the same home town as director Robert Benton. Forrest had long wanted to be an actor, but he was so nervous that he ran out of auditions for school plays. Later, at Texas Christian University, he took a minor in theater arts while majoring in radio and television studies. His parents opposed his aspirations as a thespian as it was a precarious existence, but he moved on to New York and studied with renowned acting teacher Sanford Meisner. He eventually became an observer at the Actors Studio, where he was tutored by Lee Strasberg. During this time, he supported himself as a page at the NBC Studios in Rockefeller Plaza. His theatrical debut was in the Off-Broadway production of \"Viet-Rock\", an anti-war play featuring music. He became part of avant-garde director Tom O'Horgan's stock company at La Mama, appearing in the infamous \"Futz\", among other productions. He made his uncredited debut in The Filthy Five (1968), a low-budget movie directed by sexploitation auteur Andy Milligan, but he racked up his first credit in O'Horgan's very bizarre screen adaptation of Futz (1969), a satire about a farmer who falls in love with a hog. After starring in the off-Broadway play \"Silhouettes\", Forrest moved with the production to Los Angeles, intent on breaking into movies. While the production ran for three months and was visited by agents bird-dogging new talent, Forrest got no offers and had to support himself as a pizza-baker after the show closed. Eventually, he began auditing classes at Actors Studio West, and director Stuart Millar saw him in a student showcase production of Clifford Odets' \"Watiting for Lefty\" and cast him in When the Legends Die (1972). He copped a 1973 Golden Globe nomination as \"Most Promising Newcomer - Male\" for the role, losing out to Edward Albert in Butterflies Are Free (1972). For the first time in his film acting career, Frederic Forrest looked like he was poised for stardom. His follow-up picture, the pitiful The Godfather (1972) rip-off The Don Is Dead (1973), did nothing for his career, although a small part in \"Godfather\" director Francis Ford Coppola's The Conversation (1974) would later pay dividends. Except for a small role in the disappointing The Missouri Breaks (1976) and his TV turn as Lee Harvey Oswald in CBS' Ruby and Oswald (1978), Forrest had little to show in the first part of his career. Coppola was about to change that. Playing \"Chef Hicks\" in Apocalypse Now (1979) garnered Forrest the best notices of his career, and he parlayed that into Academy Award and Golden Globe nominations as Best Supporting Actor for The Rose (1979), his second hit that year. He was named Best Supporting Actor by the National Society of Film Critics for both films, and once again he seemed poised on the verge of stardom. Like the first time, stardom did not come. His aspirations were to do quality work and play a romantic lead. \"I would like to not have to fit into somebody else's story and have my scenes cut because I'm too strong\", he told a journalist circa 1980. \"And next time, I'd like to get the girl instead of the horse\". He did get the romantic lead he pined for, but it was a case of \"Be careful what you wish for, as you might just get it\". Coppola, so instrumental in propelling Forrest into the first rank of character actors, cast him as the romantic lead in One from the Heart (1981), a picture that proved to be one of the great financial debacles of all time. It bankrupted Coppola's studio, American Zoetrope, and engendered a fierce backlash against the director and the film in Hollywood. Forrest and co-star Teri Garr were both egregiously miscast in Coppola's re-imagining of the musical due to the simple fact that neither could sing or dance and had no place in any kind of musical, traditional or re-imagined. Coppola reportedly never came out of \"Silverfish\", the Winnebago-like trailer he had transformed into a control center from which he directed the film via television monitors, a first in the industry. For his masterpieces The Godfather (1972), The Godfather: Part II (1974) and Apocalypse Now (1979), he had left the visuals in the very able hands of his cinematographers, Gordon Willis and Vittorio Storaro. Coppola was a first-rate screenwriter with a sure hand, eliciting performances from actors as notoriously difficult as Marlon Brando and Al Pacino, but by locking himself away from the set in a trailer to oversee the visual scope of his picture, there was little he seemingly could do to prevent the floundering of his two leads. More concerned with technology than his actors, he lost his touch. One from the Heart (1981) turned out to be a disaster and, except for one more lead in a Coppola-produced film, Wim Wenders' underwhelming Hammett (1982), Forrest's career as a leading man was through. In 1983, he played a supporting role in Valley Girl (1983) in an unmemorable performance, a role that could have been played by any actor, something one couldn't say about his \"Chef\" in Apocalypse Now (1979). Chef had been as essential to the success of the film as had Martin Sheen's Willard and Brando's Col. Kurtz. Increasingly, Forrest began appearing on television and, by 1987, was in the cast of the series 21 Jump Street (1987) on the new Fox TV network, lasting only one season before being ignominiously replaced by Steven Williams. In addition to an appearance in the mini-series Lonesome Dove (1989), Mr. Forrest's fine portrayal of \"Lomax\" in Die Kinder (1990), showed the ability which has been too often unrealized.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNDIyMDQwN15BMl5BanBnXkFtZTYwMzM5NzE1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002078","name":"Frederic Forrest","nicknames":["Daddy Freddy"],"idIMDB":"nm0002078"},"actorId":"nm0002078","character":"Cary","urlCharacter":"http://www.imdb.com/character/ch0455462","main":true},{"actorName":"Harry Dean Stanton","urlProfile":"http://www.imdb.com/name/nm0001765","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDYyMTQ2Ml5BMl5BanBnXkFtZTYwMjU2NjE0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 July 1926","placeOfBirth":" West Irvine, Kentucky, USA","height":"5' 8\" (1.73 m)","bio":"Prolific character actor Harry Dean Stanton's drooping, weather-beaten appearance and superb acting talent have been his ticket to appearing in over 100 films, and 50 TV episodes. Stanton was born in West Irvine, Kentucky, to Ersel (Moberly), a cook, and Sheridan Harry Stanton, a barber and tobacco farmer. Stanton served as a cook in the U.S. Navy during World War II, and was on board an LST during the Battle of Okinawa. He then returned to the University of Kentucky to appear in a production of \"Pygmalion\", before heading out to California and honing his craft at the prestigious Pasadena Playhouse. Stanton then toured around the United States with a male choir, worked in children's theater, and then headed back to California. His first role on screen was in the tepid movie Tomahawk Trail (1957), but he was quickly noticed and appeared regularly in minor roles as cowboys and soldiers through the late 1950s and early 1960s. His star continued to rise and he received better roles in which he could showcase his laid-back style, such as in Cool Hand Luke (1967), Kelly's Heroes (1970), Dillinger (1973), The Godfather: Part II (1974), and in Alien (1979). It was around this time that Stanton came to the attention of director Wim Wenders, who cast him in his finest role yet as Travis in the moving Paris, Texas (1984). Next indie director Alex Cox gave Stanton a role that really brought him to the forefront, in the quirky cult film Repo Man (1984). Stanton was now heavily in demand, and his unique look got him cast as everything from a suburban father in the mainstream Pretty in Pink (1986) to a soft-hearted, but ill-fated, private investigator in Wild at Heart (1990) and a crazy yet cunning scientist in Escape from New York (1981). Apart from his film performances, Stanton is also an accomplished musician, and \"The Harry Dean Stanton Band\" and their unique spin on mariachi music have been playing together for well over a decade. They have toured internationally to rave reviews. Stanton became a cult figure of cinema and music and when Debbie Harry sang the lyric \"I want to dance with Harry Dean...\" in her 1990s hit \"I Want That Man\", she was talking about him. As he moved into the time in his life when most other people would be calling it a day, Harry Dean Stanton has remained consistently active on screen, most recently appearing in films including Fear and Loathing in Las Vegas (1998), The Green Mile (1999) and The Man Who Cried (2000). A true gem amongst character actors, and with an on screen presence capable of adding that something extra to any production.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDYyMTQ2Ml5BMl5BanBnXkFtZTYwMjU2NjE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001765","name":"Harry Dean Stanton","idIMDB":"nm0001765"},"actorId":"nm0001765","character":"Calvin","urlCharacter":"http://www.imdb.com/character/ch0455461","main":true},{"actorName":"John McLiam","urlProfile":"http://www.imdb.com/name/nm0572897","urlPhoto":"","biography":{"dateOfBirth":"24 January 1918","placeOfBirth":" Alberta, Canada","birthName":"John Williams","bio":"John McLiam was born on January 24, 1918 in Alberta, Canada as John Williams. He was an actor and writer, known for First Blood (1982), Cool Hand Luke (1967) and Sleeper (1973). He was married to Roberta Williams. He died on April 16, 1994 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0572897","name":"John McLiam","idIMDB":"nm0572897"},"actorId":"nm0572897","character":"David Braxton","urlCharacter":"http://www.imdb.com/character/ch0455460","main":true},{"actorName":"John P. Ryan","urlProfile":"http://www.imdb.com/name/nm0752636","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDIyNjM4OF5BMl5BanBnXkFtZTcwNjMzOTgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1936","placeOfBirth":" New York City, New York, USA","height":"6' (1.83 m)","bio":"Character actor John P. Ryan was born on July 30, 1936 in New York City. The son of Irish immigrant parents, Ryan graduated from Rice High School and studied English at the City College of New York, where he first developed an interest in acting. He served six years in the US Army and worked as a welfare investigator prior to pursuing an acting career. John made his film debut in the 1967 comedy \"The Tiger Makes Out.\" He appeared in five pictures for Jack Nicholson; he's especially memorable as male nurse Spicer in \"Five Easy Pieces.\" Manic, pale-eyed and craggy-faced, with an often intense and explosive screen presence, Ryan was frequently cast as nasty villains, hard-boiled police officers, and strict military men. John gave a strong and touching performance in a rare change-of-pace sympathetic role as Frank Davis, the bitter and regretful father of a murderous monster mutant baby in Larry Cohen's excellent \"It's Alive.\" He also portrayed Davis in the okay sequel \"It Lives Again.\" Other notable movie parts include the fanatical Colonel Hardcore in \"Shamus,\" shrewd mob capo Patsy O'Neill in the witty \"Cops and Robbers,\" evil scientist Schneider in \"Futureworld,\" the dogged Lt. Parmental in \"Breathless,\" vicious Irish mobster Joe Flynn in \"The Cotten Club;\" at his ferocious best as sadistic prison Warden Ranken in the powerful \"Runaway Train,\" hateful fascist lunatic Glastenbury in the exciting \"Avenging Force,\" ruthless drug kingpin Nathan White in the cruddy \"Death Wish IV: The Crackdown,\" ramrod high school principal Mr. O'Rourke in the amusing \"Three O'Clock High,\" and lethal robot history teacher Mr. Hardin in \"Class of 1999.\" Among the TV shows Ryan did guest spots on are \"M.A.S.H.,\" \"The Rockford Files,\" \"Hawaii Five-O,\" \"Buck Rogers in the 25th Century,\" \"Starsky & Hutch,\" \"Kojak,\" \"Hart to Hart,\" \"The F.B.I.,\" and \"Miami Vice.\" John had a recurring role on the TV series \"Archer.\" In addition to his film and TV credits, Ryan also appeared in over 90 stage plays. Following his final film appearance in \"Bound,\" John spent his later years giving acting lessons and was an advocate of spiritual healing. John P. Ryan died from a stroke at age 70 on March 20, 2007 in Los Angeles, California; he's survived by two daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyMDIyNjM4OF5BMl5BanBnXkFtZTcwNjMzOTgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0752636","name":"John P. Ryan","idIMDB":"nm0752636"},"actorId":"nm0752636","character":"Si","urlCharacter":"http://www.imdb.com/character/ch0455459","main":true},{"actorName":"Sam Gilman","urlProfile":"http://www.imdb.com/name/nm0319462","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg0Y2JlYjUtNzc2Zi00OTgxLWE0ZGYtZjE5ZGYxNDA0Yzk2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1915","placeOfBirth":" Lynn, Massachusetts, USA","bio":"Sam Gilman was born on February 5, 1915 in Lynn, Massachusetts, USA. He was an actor and writer, known for One-Eyed Jacks (1961), Every Which Way But Loose (1978) and The Missouri Breaks (1976). He was married to Lisabeth Hush. He died on December 3, 1985 in North Hollywood, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg0Y2JlYjUtNzc2Zi00OTgxLWE0ZGYtZjE5ZGYxNDA0Yzk2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0319462","name":"Sam Gilman","idIMDB":"nm0319462"},"actorId":"nm0319462","character":"Hank Rate","urlCharacter":"http://www.imdb.com/character/ch0455458","main":true},{"actorName":"Steve Franken","urlProfile":"http://www.imdb.com/name/nm0291266","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NzEzMjAyNV5BMl5BanBnXkFtZTcwNjE3MDYzOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 May 1932","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Stephen Robert Franken","height":"5' 6\" (1.68 m)","bio":"Steve Franken was born on May 27, 1932 in Queens, New York City, New York, USA as Stephen Robert Franken. He was an actor, known for Angels & Demons (2009), Westworld (1973) and The Party (1968). He was married to Jean Garrett and Julia E. Carter. He died on August 24, 2012 in Canoga Park, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NzEzMjAyNV5BMl5BanBnXkFtZTcwNjE3MDYzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0291266","name":"Steve Franken","idIMDB":"nm0291266"},"actorId":"nm0291266","character":"The Lonesome Kid","urlCharacter":"http://www.imdb.com/character/ch0455457","main":true},{"actorName":"Richard Bradford","urlProfile":"http://www.imdb.com/name/nm0103071","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAxMzk2MDQ3NF5BMl5BanBnXkFtZTcwNzUxMzYwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1934","placeOfBirth":" Conroe, Texas, USA","birthName":"Richard Edwin Bradford Jr.","height":"5' 10\" (1.78 m)","bio":"Richard Bradford was born on November 10, 1934 in Conroe, Texas, USA as Richard Edwin Bradford Jr. He was an actor, known for The Untouchables (1987), Man in a Suitcase (1967) and The Milagro Beanfield War (1988). He was married to Eileen Elliott. He died on March 22, 2016 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAxMzk2MDQ3NF5BMl5BanBnXkFtZTcwNzUxMzYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0103071","name":"Richard Bradford","idIMDB":"nm0103071"},"actorId":"nm0103071","character":"Pete Marker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Greene","urlProfile":"http://www.imdb.com/name/nm0338783","urlPhoto":"","biography":{"dateOfBirth":"1 December 1926","placeOfBirth":" Lawrence, Massachusetts, USA","birthName":"James Nolan","bio":"James Greene was born on December 1, 1926 in Lawrence, Massachusetts, USA as James Nolan. He is an actor, known for Patch Adams (1998), Road to Perdition (2002) and The Days and Nights of Molly Dodd (1987). He has been married to Betty Miller since December 5, 1955.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0338783","name":"James Greene","idIMDB":"nm0338783"},"actorId":"nm0338783","character":"Hellsgate Rancher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Luana Anders","urlProfile":"http://www.imdb.com/name/nm0026035","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MzY4OTYyMV5BMl5BanBnXkFtZTcwMDM4NTMzNA@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1938","placeOfBirth":" New York City, New York, USA","birthName":"Luana Margo Anderson","height":"5' 4\" (1.63 m)","bio":"Born Luana Margo Anderson on May 12, 1938, Luana Anders began her show-business career as a bike messenger at MGM along with fellow thespians Jack Nicholson, Sandra Knight and future film producers George Edwards and Fred Roos. She convinced Nicholson to join her in her improv acting class with legendary teacher and veteran character actor Jeff Corey; her other classmates included Sally Kellerman, Richard Chamberlain, director/producer Roger Corman and screenwriter Robert Towne. Luana began her acting career in her teens in such 1950s \"B\" movies as Reform School Girl (1957) (alongside her lifelong friend Sally Kellerman) and Life Begins at 17 (1958), in which she co-starred with actor (and future producer) Mark Damon. She also worked with Damon in Roger Corman's The Young Racers (1963). The sound man on \"The Young Racers\" asked her if she wanted to star in his first directing effort. The sound man was Francis Ford Coppola and Anders played the conniving and duplicitous Louise Haloran in Coppola's debut feature, Dementia 13 (1963). She played Vincent Price's sister Catherine Medina in Corman's Pit and the Pendulum (1961). Anders acted opposite Charles Grodin and John Gabriel in Sex and the College Girl (1964). Luana was in three pictures for director Curtis Harrington: ingénue Ellen Sands in Night Tide (1961), a cameo as a party guest in Games (1967) and repressed librarian Louise in the perverse The Killing Kind (1973). Anders achieved cult status as groovy hippie commune dweller Lisa in Easy Rider (1969). Robert Altman frequently credited Luana with getting his career started; she has a small role as a streetwalker Sandy Dennis picks up in Altman's That Cold Day in the Park (1969). Friend Jack Nicholson made a point of seeing and commenting on the movie during the Cannes film festival where \"Easy Rider\" won the Palme D'or; the subsequent publicity gave Altman the notoriety to launch his career. She frequently acted in films with real-life good friend Nicholson; she was especially memorable as a Buddhist chanting party girl in The Last Detail (1973). Luana was terrorized by a deranged Mickey Rooney on an abandoned studio backlot in the unreleased gonzo oddity The Manipulator (1971) and starred in Robert Downey Sr.'s Greaser's Palace (1972). Anders appeared in Shampoo (1975), a film that's reportedly based on her romance with hairdresser Richard Alcala; the picture was written by her friend and fellow Corey classmate Robert Towne. She had a recurring part on the daytime soap opera Santa Barbara (1984). Among the TV shows Luana did guest spots on are Hunter (1984), Little House on the Prairie (1974), Mannix (1967), Bonanza (1959), Ironside (1967), Dragnet 1967 (1967), Hawaii Five-O (1968), The Andy Griffith Show (1960), One Step Beyond (1959), The Outer Limits (1963), Ben Casey (1961) and The Rifleman (1958). Anders co-wrote the script for the comedy Limit Up (1989) and was uncredited in scripting the action/adventure romp Fire on the Amazon (1993), which was Sandra Bullock's debut film for Roger Corman. She appeared in a number of movies with collaborator Richard Martini, including You Can't Hurry Love (1988), about which \"Variety\" declared, \"It's about time we see the great Luana Anders back on the screen\". She was a member of the improvisational comedy stage group The Committee. A lifelong Buddhist and supporter of the American chapter of Soka Gakkai International, Luana Anders died on July 21, 1996.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MzY4OTYyMV5BMl5BanBnXkFtZTcwMDM4NTMzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0026035","name":"Luana Anders","nicknames":["Lu"],"idIMDB":"nm0026035"},"actorId":"nm0026035","character":"Rancher's Wife","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny Goldman","urlProfile":"http://www.imdb.com/name/nm0325761","urlPhoto":"","biography":{"dateOfBirth":"30 October 1939","placeOfBirth":" New York City, New York, USA","birthName":"Daniel Goodman","bio":"Danny Goldman was born on October 30, 1939 in New York City, New York, USA as Daniel Goodman. He is an actor and casting director, known for The Smurfs (1981), General Hospital (1963) and Young Frankenstein (1974).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0325761","name":"Danny Goldman","idIMDB":"nm0325761"},"actorId":"nm0325761","character":"Baggage Clerk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hunter von Leer","urlProfile":"http://www.imdb.com/name/nm0902608","urlPhoto":"","biography":{"dateOfBirth":"3 April 1944","placeOfBirth":" Terre Haute, Indiana, USA","birthName":"Paul Hunter von Leer","bio":"Hunter von Leer was born on April 3, 1944 in Terre Haute, Indiana, USA as Paul Hunter von Leer. He is an actor, known for General Hospital (1963), Halloween II (1981) and History of the World: Part I (1981).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0902608","name":"Hunter von Leer","idIMDB":"nm0902608"},"actorId":"nm0902608","character":"Sandy","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0074906","urlIMDB":"http://www.imdb.com/title/tt0074906","business":{"budget":null,"openingWeekend":null,"gross":[],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 6 min (126 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Lenses and Panaflex Camera by Panavision"],"laboratory":["DeLuxe, Hollywood (CA), USA","TVC Laboratories, New York, USA (processing: Chem-tone)","Technicolor, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.6","filmingLocations":[{"location":"Billings, Montana, USA"}],"rated":"PG","awards":[],"votes":"7,403","type":"Movie","companyCreditsSimple":[{"idCompany":"co0106767","name":"Devon/Persky-Bright"},{"idCompany":"co0026841","name":"United Artists"}],"keywords":{"keywords":["horse","horse thief","money falling through the air","evil man","river in title","sadist","irreverence","bathtub","mountie","rebellion","visceral","tracking","tough guy","self made man","rustler","quarry","psychopath","land","hired gun","cattle","brutality","bad guy","lovable bandit","wyoming","virgin","transvestism","swimming horse","shot in the hand","shot in the back","shot during sex","sharpshooter","sex on horse","sex in shack","runaway wife","river crossing","revenge","rebellious daughter","real estate deal","rabbit","premarital sex","plain","oxbow river","outhouse","oedipus complex","northwest mounted police","murder","mother figure","mining town","master servant","lynching","love against the odds","loss of virginity","library","lewd conduct","law book","killing","killed during sex","irrigation","impalement","hymn","house burning","horse rustling","horse ranch","home library","frontier","frontiersman","foreman","farmers daughter","faithfulness","dying during sex","dry gulched","drowning","drag","crossing the border","corral","corpse","corpse in coffin","colt .45","church","canadian rockies","cabbage","buckskin jacket","border","barracks","bandanna","arson","royal canadian mounted police","missouri river","vigilante","ranch","cattle ranch","1880s","vigilantism","self justice","hired killer","hanging","evil landowner","father daughter relationship","train robbery","river","rifle","post civil war","outlaw","montana","harpoon","garden","farmer","eccentric","carrot","canada","bounty hunter","love","throat slitting","death of friend","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:44:41"}}