{"data":{"movies":[{"title":"The Four Feathers","originalTitle":"","year":"1929","releaseDate":"192906","directors":[{"name":"Merian C. Cooper","id":"nm0178260"},{"name":"Lothar Mendes","id":"nm0578985"}],"writers":[{"name":"A.E.W. Mason","id":"nm0556571"},{"name":"Hope Loring","id":"nm0521002"}],"urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY1NzI1MDU1Nl5BMl5BanBnXkFtZTgwMDAwODA1MjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Adventure","Drama","Romance","War"],"plot":"When British officer Harry resigns from his regiment, he is labeled a coward by his family and friends. Harry receives four white feathers as a mark of a coward. In order to redeem himself and win the heart of his fiancé back and the love of his best friend, Harry sets out to return the feathers to the pockets they came from.","simplePlot":"When British officer Harry resigns from his regiment, he is labeled a coward by his family and friends. Harry receives four white feathers as a mark of a coward. In order to redeem himself ... ","actors":[{"actorName":"Richard Arlen","urlProfile":"http://www.imdb.com/name/nm0035159","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MTI3NTM5NF5BMl5BanBnXkFtZTYwOTExMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 September 1899","placeOfBirth":" St. Paul, Minnesota, USA","birthName":"Sylvanus Richard Van Mattimore","height":"5' 11½\" (1.82 m)","bio":"During World War I, Richard Arlen served in the Royal Canadian Flying Corps as a pilot, but he never saw combat. After the war he drifted round and eventually wound up in Los Angeles, where he got a job as a motorcycle messenger at a film laboratory. When he crashed into the gates of Paramount Pictures and suffered a broken leg, the studio provided prompt medical attention. Impressed by his good looks, executives also gave him a contract after he had recovered. Starting as an extra in 1925, Arlen soon rose to credited roles, but the quality of his work left much to be desired. However, this was the silent era, which was more about looks than substance, and he continued on. His big break came when William A. Wellman cast him as a pilot in the silent film Wings (1927) with Charles 'Buddy' Rogers and Clara Bow. The story of fighter aces would win the Oscar for Best Picture and Arlen would continue to play the tough, cynical hero throughout his career. Arlen appeared in three more pictures directed by Wellman, Beggars of Life (1928), Ladies of the Mob (1928) and The Man I Love (1929). In \"Wings\" he had a scene with a young actor named Gary Cooper. In 1929, he again worked with Cooper in the western The Virginian (1929), only this time Cooper was the star and Arlen was the supporting actor. While Arlen moved easily into sound, his career just bumped along. By 1935 he was working in such \"B\" pictures as Three Live Ghosts (1936). It was in 1935 that he became a freelance actor and his freelance career soon waned. In 1939, he signed with Universal and began working in its action films. In 1941 he moved to the Pine-Thomas unit at Paramount, where he appeared in adventure films. With the war on, most of his earlier films included war scenarios. By the end of the 1940s Arlen was becoming deaf and this seemed to signal the end of his career. However, he had an operation in 1949 that restored his hearing and he went on making a handful of adventures and westerns through the 1950s and working more in the 1960s. He made 15 westerns for producer A.C. Lyles, who worked with the old western stars. Besides movies, Arlen also appeared on television and in commercials. After leaving the business in the late 1960s, he was coaxed back to the screen for three small roles in films that were released the same year that he died.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MTI3NTM5NF5BMl5BanBnXkFtZTYwOTExMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0035159","name":"Richard Arlen","nicknames":["Dick"],"idIMDB":"nm0035159"},"actorId":"nm0035159","character":"Lt. Harry Faversham","urlCharacter":"http://www.imdb.com/character/ch0016927","main":true},{"actorName":"Fay Wray","urlProfile":"http://www.imdb.com/name/nm0942039","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NjY2MDAzNF5BMl5BanBnXkFtZTcwODIwMTQ5Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1907","placeOfBirth":" Cardston, Alberta, Canada","birthName":"Vina Fay Wray","height":"5' 3\" (1.6 m)","bio":"Canadian-born Fay Wray was brought up in Los Angeles and entered films at an early age. She was barely in her teens when she started working as an extra. She began her career as a heroine in westerns at Universal during the silent era. In 1926 the Western Association of Motion Picture Advertisers selected 13 young starlets it deemed most likely to succeed in pictures. Fay was chosen as one of these starlets, along with Janet Gaynor and Mary Astor. Fame would indeed come to Fay when she played another heroine in Erich von Stroheim's The Wedding March (1928). She continued playing leads in a number of films, such as the good-bad girl in Thunderbolt (1929). By the early 1930s she was at Paramount working with Gary Cooper and Jack Holt in a number of average films, such as Master of Men (1933). She also appeared in such horror films as Doctor X (1932) and The Vampire Bat (1933). In 1933 Fay was approached by producer Merian C. Cooper, who told her that he had a part for her in a picture in which she would be working with a tall, dark leading man. What he didn't tell her was that her \"tall, dark leading man\" was a giant gorilla, and the picture turned out to be the classic King Kong (1933). Perhaps no one in the history of pictures could scream more dramatically than Fay, and she really put on a show in \"Kong\". Her character provided a combination of sex appeal, vulnerability and lung capacity as she was stalked by the giant beast all the way to the top of the Empire State Building. That was as far as Fay would rise, however, as this was, after all, just another horror movie. After \"Kong\", she began a slow decline that put her into low-budget action films by the mid '30s. In 1939 her 11-year marriage to screenwriter John Monk Saunders ended in divorce, and her career was almost finished. In 1942 she remarried and retired from the screen, forever to be remembered as the \"beauty who killed the beast\" in \"King Kong\". However, in 1953 she made a comeback, playing mature character roles, and also appeared on television as Catherine, Natalie Wood's mother, in The Pride of the Family (1953). She continued to appear in films until 1958 and television into the 1960s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NjY2MDAzNF5BMl5BanBnXkFtZTcwODIwMTQ5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0942039","name":"Fay Wray","nicknames":["The Queen of Scream","The Queen of the Bs"],"idIMDB":"nm0942039"},"actorId":"nm0942039","character":"Ethne Eustace","urlCharacter":"http://www.imdb.com/character/ch0016931","main":true},{"actorName":"Clive Brook","urlProfile":"http://www.imdb.com/name/nm0111612","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MjgwOTQ5Ml5BMl5BanBnXkFtZTgwMzg5NDQ3MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1887","placeOfBirth":" Tufnell Park, London, England, UK","birthName":"Clifford Hardman Brook","height":"5' 11\" (1.8 m)","bio":"Born in London, England to Charlotte Mary (opera singer) and George Alfred Brook. He was educated privately. Stage experience included: \"Oliver Twist\", \"Voysey Inheritence\", \"If I were King\", \"Importance of Being Ernest\", Fair and Warmer\", \"Over Sunday\", \"Clothes and the WOman\", and many others. Screen experience with Graham-Cutts Company in London. He appeared in \"Woman to Woman\", and others. In 1924 he came to America.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3MjgwOTQ5Ml5BMl5BanBnXkFtZTgwMzg5NDQ3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0111612","name":"Clive Brook","idIMDB":"nm0111612"},"actorId":"nm0111612","character":"Lt. Jack Durrance","urlCharacter":"http://www.imdb.com/character/ch0016932","main":true},{"actorName":"William Powell","urlProfile":"http://www.imdb.com/name/nm0001635","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MzcxMjExN15BMl5BanBnXkFtZTcwODA2NDQyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1892","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"William Horatio Powell","height":"5' 10½\" (1.79 m)","bio":"William Powell was on the New York stage by 1912, but it would be ten years before his film career would begin. In 1924 he went to Paramount Pictures, where he was employed for the next seven years. During that time, he played in a number of interesting films, but stardom was elusive. He did finally attract attention with The Last Command (1928) as Leo, the arrogant film director. Stardom finally came via his role as Philo Vance in The Canary Murder Case (1929), in which he investigates the death of Louise Brooks, \"the Canary.\" Unlike many silent actors, sound boosted Powell's career. He had a fine, urbane voice and his stage training and comic timing greatly aided his introduction to sound pictures. However, he was not happy with the type of roles he was playing at Paramount, so in 1931 he switched to Warner Bros. There, he again became disappointed with his roles, and his last appearance for Warners was as Philo Vance in The Kennel Murder Case (1933). In 1934 Powell went to MGM, where he was teamed with Myrna Loy in Manhattan Melodrama (1934). While Philo made Powell a star, another detective, Nick Charles, made him famous. Powell received an Academy Award nomination for The Thin Man (1934) and later starred in the Best Picture winner for 1936, The Great Ziegfeld (1936). Powell could play any role with authority, whether in a comedy, thriller, or drama. He received his second Academy Award nomination for My Man Godfrey (1936) and was on top of the world until 1937, when he made his first picture with Jean Harlow, Reckless (1935). The two clicked, off-screen as well as on-screen, and shortly became engaged. One day, while Powell was filming Double Wedding (1937) on one MGM sound stage, Harlow became ill on another. She was finally taken to the hospital, where she died. Her death greatly upset both Powell and Myrna Loy, and he took six weeks off from making the movie to deal with his sorrow. After that he traveled, not making another MGM film for a year. He eventually did five sequels to \"The Thin Man,\" the last one in 1947. He also received his third Academy Award nomination for his work in Life with Father (1947). His screen appearances became less frequent after that, and his last role was in 1955. He had come a long way from playing the villain in 1922.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MzcxMjExN15BMl5BanBnXkFtZTcwODA2NDQyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001635","name":"William Powell","idIMDB":"nm0001635"},"actorId":"nm0001635","character":"Capt. William Trench","urlCharacter":"http://www.imdb.com/character/ch0135508","main":true},{"actorName":"Theodore von Eltz","urlProfile":"http://www.imdb.com/name/nm0902226","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzdlMzUtM2QzOS00ZTIwLWE3YjQtMWRlYTU2MzcxYjRlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1893","placeOfBirth":" New Haven, Connecticut, USA","birthName":"Julius Theodor von Eltz","height":"5' 11\" (1.8 m)","bio":"Born in New Haven, Connecticut on November 5, 1893, silent screen lead Theodore Von Eltz was the son of a Yale professor and educated at Hill School at Pottstown Pennsylvania. Originally prepped to become a doctor, he decided instead to pursue acting. At age 19 he made his New York debut and soon was hitting the Broadway boards with performances in \"Children of Earth\" (1915), \"Rio Grande\" (1916) and \"The Old Lady Shows Her Medals (1917). Von Eltz evolved into a dark and dashingly handsome silent film actor. Well-dressed with a trimmed mustache, he romanced a number of the silent screen's most lovely stars in both comedy and drama, including Bebe Daniels in The Speed Girl (1921) and Viola Dana in Fourteenth Lover (1922), before moving into a pattern of disreputable second leads and support roles with Tiger Rose (1923), The Sporting Chance (1925), The Red Kimona (1925), The Sea Wolf (1926). He received lesser billing to a couple of animal heroes in White Fang (1925) and No Man's Law (1927). By the advent of sound Von Eltz was firmly entrenched in character parts and was often relied upon to drum up sinister support such as his deceptive culprit in The Arizona Kid (1930); his gangster in Red-Haired Alibi (1932); the Shirley Temple vehicle Bright Eyes (1934), in which he played Jane Withers' annoyingly vexatious father; his henchman in The Sun Never Sets (1939); and, more notably, his minor role as the blackmailing pornographer whose actions ignite the classic film noir The Big Sleep (1946). On the other hand, he could also play benevolent doctors, lawyers and servants and did so in a film career that nearly hit the 200 mark. By the late 1930's his billing had slipped considerably to the point he was frequently uncredited. A well-oiled player on radio, he voiced the part of Papa Barbour on the popular program \"One Man's Family\" from 1948-1949, but was later replaced. He also played on 50s TV. Von Eltz was married twice. First wife Peggy Prior was a screenwriter for Pathe Studios. They had two children, Teddy and Lori, the latter becoming the soap actress Lori March. Following their divorce and a bitter custody feud (which he lost), he married Elizabeth Lorimar in 1932. They remained together until his death. He passed away at the Motion Picture Country Home after an extended illness and was buried in Forest Lawn Memorial Park in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzdlMzUtM2QzOS00ZTIwLWE3YjQtMWRlYTU2MzcxYjRlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0902226","name":"Theodore von Eltz","idIMDB":"nm0902226"},"actorId":"nm0902226","character":"Lt. Castleton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Noah Beery","urlProfile":"http://www.imdb.com/name/nm0001935","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMDkxNTg3Nl5BMl5BanBnXkFtZTgwMDk2MDU1MzE@._V1._CR102,137,545,728_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1882","placeOfBirth":" Kansas City, Missouri, USA","birthName":"Noah Nicholas Beery","height":"6' 1\" (1.85 m)","bio":"Respected character actor of the silent and early sound period, specializing in cruel villains. The son of Kansas City policeman Noah Webster Beery and Frances Margaret Fitzgerald Beery, Noah Nicholas Beery and his younger brother Wallace Beery both left home in their teens, each seeking a career as a performer. Noah made his stage debut at the age of 16 and worked steadily in the theatre until his early 30s. Following his brother into films, he quickly established himself as a competent player and a familiar heavy in all sorts of films, particularly westerns. He never achieved the great fame of his younger brother, but succeeded in carving a memorable niche for himself in the history of film. His son Noah Beery Jr. became equally familiar as a character actor, though usually in more genial roles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMDkxNTg3Nl5BMl5BanBnXkFtZTgwMDk2MDU1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001935","name":"Noah Beery","idIMDB":"nm0001935"},"actorId":"nm0001935","character":"Slave Trader","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Zack Williams","urlProfile":"http://www.imdb.com/name/nm0931956","urlPhoto":"","biography":{"dateOfBirth":"6 October 1884","placeOfBirth":" Louisiana, USA","bio":"Zack Williams was born on October 6, 1884 in Louisiana, USA. He was an actor, known for Son of Ingagi (1940), The Four Feathers (1929) and The Yankee Clipper (1927). He died on May 25, 1958 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0931956","name":"Zack Williams","idIMDB":"nm0931956"},"actorId":"nm0931956","character":"Idris","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Noble Johnson","urlProfile":"http://www.imdb.com/name/nm0425903","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTdkM2IwNWQtYjQ5Yi00MGRhLWJkOTUtMDcwY2Q4M2E2NmJkXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1881","placeOfBirth":" Marshall, Missouri, USA","birthName":"Noble Mark Johnson","height":"6' 2\" (1.88 m)","bio":"African-American movie actor and producer Noble Johnson was born on April 18, 1881, in Marshall, Missouri. His family moved to Colorado Springs, Colorado, when Noble was very young, and it was there that he met Lon Chaney at school. They became friends as children, and later got re-acquainted when both were making movies in Hollywood and became friends all over again (surprisingly, they never made any movies together). Johnson, as an adult, was built like a bull. Standing 6'2\" at 215 pounds, his impressive physique and handsome features made him in demand as a character actor and bit player. In the silent era he essayed a wide variety of characters of different races in a plethora of films, primarily serials, westerns and adventure movies. While Johnson was cast as blacks in many films, he also played Native American and Latino parts and \"exotic\" characters such as Arabians or even a devil in hell in Dante's Inferno (1924) (the old black and white orthochromatic film stock of the early days was less discriminating about a person's color, as were B+W stocks in general, permitting some African-American actors a break, as their \"color\" was washed out or less obvious when photographed in B+W. As late as the early 1960s, there were very few African-American members of the Screen Actors Guild, since there was a lack of opportunity for them as black performers were confined mostly to race films until the 1960s). In all his roles, Johnson lived up to his Christian name: his was a noble and dignified presence that exhibited great power and substance. Johnson also was an entrepreneur. In 1916 he founded his own studio to produce what would be called \"race films\", movies made for the African-American audience, which was ignored by the \"mainstream\" film industry. The Lincoln Motion Picture Co., which was in existence until 1921, was an all-black company, the first to produce movies portraying African-Americans as real people instead of as racist caricatures (Johnson was followed into the race film business by Oscar Micheaux and others). Johnson, who served as president of the company and was its primary asset as a star actor, helped support the studio by acting in other companies' productions such as 20,000 Leagues Under the Sea (1916), and using the money he made in those films to invest in Lincoln. Lincoln's first picture was The Realization of a Negro's Ambition (1916). For four years Johnson managed to keep Lincoln a going concern, primarily due to his extraordinary commitment to African-American filmmaking. However, he reluctantly resigned as president in 1920, as he no longer could continue his double business life, maintaining a demanding career in Hollywood films while trying to run a studio. In the 1920s Johnson was a very busy character actor, appearing in such top-notch films as The Four Horsemen of the Apocalypse (1921) with Rudolph Valentino, Cecil B. DeMille's original The Ten Commandments (1923) and The Thief of Bagdad (1924). He made the transition to sound, appearing in the 1930 version of Moby Dick (1930) as Queequeg to John Barrymore's Captain Ahab. He was also the tribal leader on Skull Island in the classic King Kong (1933) (and its sequel, The Son of Kong (1933)) and appeared in Frank Capra's classic Lost Horizon (1937) as one of the porters. One of his last films was John Ford's classic She Wore a Yellow Ribbon (1949), in which he played Native American Chief Red Shirt. He retired from the movie industry in 1950. Johnson died on January 9, 1978, in Yucaipa (San Bernardino), California, at age 96. He is buried in the Garden of Peace at Eternal Valley Memorial Park in Newhall, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTdkM2IwNWQtYjQ5Yi00MGRhLWJkOTUtMDcwY2Q4M2E2NmJkXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0425903","name":"Noble Johnson","idIMDB":"nm0425903"},"actorId":"nm0425903","character":"Ahmed","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harold Hightower","urlProfile":"http://www.imdb.com/name/nm0383624","urlPhoto":"","biography":{"bio":"Harold Hightower is an actor, known for The Four Feathers (1929).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0383624","name":"Harold Hightower","idIMDB":"nm0383624"},"actorId":"nm0383624","character":"Ali","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Philippe De Lacy","urlProfile":"http://www.imdb.com/name/nm0209462","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzODcxMzIwMl5BMl5BanBnXkFtZTYwNjQyMjky._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1917","placeOfBirth":" Nancy, France","height":"5' 5\" (1.65 m)","bio":"Born in France during a World War I air raid in which his mother was killed, Philippe was adopted by Mrs. Edith DeLacy, who was associated with the Women's Overseas Hospital. After the war ended, Mrs. Lacy brought Philippe to America where his stunning looks soon made him a sought after model for advertisements and eventually brought him to the screen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzODcxMzIwMl5BMl5BanBnXkFtZTYwNjQyMjky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0209462","name":"Philippe De Lacy","idIMDB":"nm0209462"},"actorId":"nm0209462","character":"Harry Faversham - age 10","urlCharacter":"http://www.imdb.com/character/ch0016927","main":true},{"actorName":"E.J. Ratcliffe","urlProfile":"http://www.imdb.com/name/nm0711615","urlPhoto":"","biography":{"dateOfBirth":"10 March 1863","placeOfBirth":" London, England, UK","birthName":"Edward J. Ratcliffe","bio":"E.J. Ratcliffe was born on March 10, 1863 in London, England as Edward J. Ratcliffe. He was an actor, known for The Black Pirate (1926), In the Palace of the King (1915) and The Winning of Barbara Worth (1926). He was married to Eleanor Scott L'Estelle. He died on September 28, 1948 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0711615","name":"E.J. Ratcliffe","idIMDB":"nm0711615"},"actorId":"nm0711615","character":"Col. Eustace","urlCharacter":"http://www.imdb.com/character/ch0016936","main":true},{"actorName":"George Fawcett","urlProfile":"http://www.imdb.com/name/nm0269493","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjJhYWE0MGEtZDAzMy00NTI3LTkwMDctMzIzMjVmY2Q2NzViXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1860","placeOfBirth":" Alexandria, Virginia, USA","birthName":"George Deneale Fawcett","height":"5' 9½\" (1.77 m)","bio":"A grand, stoic presence of the silent screen, George Fawcett was an immensely popular stage thespian both here and in London at the turn of the century. During his heyday his eloquence rivaled that of both Lionel Barrymore and John Barrymore. A graduate of Virginia University, he was a formidable fixture under the Broadway lights, appearing in such classic plays as \"Ghosts\" (1903) and \"The Squaw Man\" (twice, in 1905 and 1911). Fawcett came very late to films (age 55) but soon became a favorite of D.W. Griffith, who used him in his silent masterpieces Intolerance: Love's Struggle Throughout the Ages (1916), A Romance of Happy Valley (1919), True Heart Susie (1919), Scarlet Days (1919) and The Greatest Question (1919), as well as Lady of the Pavements (1929). Affectionately dubbed \"The Grand Old Man of Films\", Fawcett appeared in over 100 movies within a relatively short span of time (15 years), playing to great effect various ports of authority -- often grim, often stubborn and often bigoted. He retired shortly after the advent of sound. Wife Percy Haswell, who frequently billed herself as \"Mrs. George Fawcett,\" appeared with him in the play \"Peacock\", which he produced in 1932. Fawcett died of heart problems at age 78 in 1939.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjJhYWE0MGEtZDAzMy00NTI3LTkwMDctMzIzMjVmY2Q2NzViXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0269493","name":"George Fawcett","idIMDB":"nm0269493"},"actorId":"nm0269493","character":"Col. Faversham","urlCharacter":"http://www.imdb.com/character/ch0016935","main":true},{"actorName":"Augustin Symonds","urlProfile":"http://www.imdb.com/name/nm0843356","urlPhoto":"","biography":{"dateOfBirth":"24 November 1868","placeOfBirth":" Newcastle, England, UK","bio":"Augustin Symonds was born on November 24, 1868 in Newcastle, England. He was an actor, known for The Four Feathers (1929). He died on July 14, 1944 in Los Angeles County, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0843356","name":"Augustin Symonds","idIMDB":"nm0843356"},"actorId":"nm0843356","character":"Col. Sutch","urlCharacter":"http://www.imdb.com/character/ch0016934","main":true}],"seasons":[],"idIMDB":"tt0018908","urlIMDB":"http://www.imdb.com/title/tt0018908","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":null,"soundMix":["Mono (Western Electric Sound System)","Mono (Movietone) (musical score and sound effects)"],"color":["Black and White"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":["2,277.47 m (8 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Magnascope","Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.2","filmingLocations":[{"location":"Buttercup Dunes, Imperial County, California, USA"}],"awards":[],"votes":"194","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["historical event","19th century","victorian era","sudan","redemption","north africa","friendship between men","desert","cavalry","british soldier","british empire","cowardice","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:07:56"}}