{"data":{"movies":[{"title":"Like Father Like Son","originalTitle":"","year":"1987","releaseDate":"19871002","directors":[{"name":"Rod Daniel","id":"nm0199722"}],"writers":[{"name":"Lorne Cameron","id":"nm0131661"},{"name":"Steve Bloom","id":"nm0089237"}],"runtime":"96 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MDc4NzY3Nl5BMl5BanBnXkFtZTYwOTQ2Nzc5._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Fantasy"],"plot":"Dr. Jack Hammond has best chances to become medical superintendent in the clinic. So he's completely absorbed in his work and has no understanding for his teenage son Chris' problems with school. By accident one of them drinks a brain-exchanging serum, and it switches their identities. This leads of course to extraordinary complications in school and at work, but also to insight in the problems and feelings of each other.","simplePlot":"A mysterious potion switches the personalities of a buttoned up doctor and his laid back son.","actors":[{"actorName":"Dudley Moore","urlProfile":"http://www.imdb.com/name/nm0001545","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MjY5MTQxOF5BMl5BanBnXkFtZTcwNTAxMTkwMw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 April 1935","placeOfBirth":" Dagenham, Essex, England, UK","birthName":"Dudley Stuart John Moore","height":"5' 2½\" (1.59 m)","bio":"Dudley Moore, the gifted comedian who had at least three distinct career phases that brought him great acclaim and success, actually started out as a musical prodigy as a child. He was born in Dagenham, Essex, England, in 1935, to working class parents, Ada Francis (Hughes), an English secretary, and John Havlin Moore, a Scottish railway electrician (originally from Glasgow). Dudley won a music scholarship to Magdalen College, Oxford, to study the organ. At university, he also studied composition and became a classically trained pianist, though his forte on the piano for public performance was jazz. After graduating from Magdalen College in 1958, Moore was offered a position as organist at King's College, Cambridge, but turned it down in order to go to London and pursue a music and acting career. Fellow Oxonian Alan Bennett (Exter Colelge, B.A., Medieval History, 1957) had already recommended him to John Bassett, who was putting together a satirical comedy revue called \"Beyond The Fringe\". \"Beyond The Fringe\" was to be Moore's first brush with fame, along with co-stars Bennett, future theatrical director Jonathan Miller (now Sir Jonathan, who studied Medicine at Cambridge and was a physician), and Peter Cook, who was destined to become Moore's comic partner during the 1960s and '70s. It was Miller who had recommended Cook for \"Beyond the Fringe\", in much the same way that Bennett had bird-dogged Moore. Cook, who had studied modern languages at Cambridge, had been part of the famous Cambridge theatrical, the Footlights revue in 1959, had subsequently gone to London to star in a West End revue for Kenneth Williams, \"Pieces of Eight\". This old-fashioned review was such a success there was a sequel, \"One Over The Eight\". He was advised by his agent not to star in the fringe with the three others as he was a professional whereas they were amateurs. Ironically, the great success of \"Beyond the Fringe\", which was a new kind of satirical comedy, would doom the very old-fashioned reviews that Cook had just tasted success in. \"Beyond the Fringe\" not only won great acclaim in the UK, but it was a hit in the U.S.. The four won a special Tony Award in 1963 for their Broadway production of \"Beyond The Fringe\" and there was a television program made of the revue in 1964. Moore and Cook were offered the TV show Not Only... But Also (1965) by the BBC in 1965. Peter Cook was on as a guest. Their pairing was so successful, it enjoyed a second season in 1966 and a third in 1970. They were particularly funny as the working-class characters \"Pete\" and \"Dud\". The duo then broke into the movies, including The Wrong Box (1966) and Bedazzled (1967). In 1974, the duo won their second Tony Award for their show \"Good Night\", which was the stage version of their TV series \"Not Only... But Also\". In the mid- to late 1970s, they issued three comic albums in the guise of the characters \"Derek\" and \"Clive\" (Moore and Cook, respectively), two lavatory attendants that many viewed as reincarnations of their earlier TV characters \"Pete\" and \"Dud\". The albums, ad libbed in a recording studio while the two drank vast quantities of alcohol, were noted at the time for their obscenity. Their typical routine was a stream-of-consciousness fugue by Cook, interspersed with interjections by Moore. With their obscenity-laden, free-formed riffs, Derke and Clive presaged the more free-wheeling shock comedy of the 1980s and '90s. After marrying American actress Tuesday Weld in 1975, Moore moved to the U.S. and began a second career as a solo screen comedian, stealing the show from Chevy Chase and Goldie Hawn as the horny conductor in the movie comedy, Foul Play (1978). When George Segal dropped out of the movie 10 (1979), director Blake Edwards cast Moore in the lead role as the composer undergoing a mid-life crisis. It was a huge hit, but was surpassed by his Oscar-nominated turn as the dipsomaniac billionaire in Arthur (1981). In the early 1980s, Moore was a top box office attraction. In 1983, the National Alliance of Theater Owners named him the Top Box Office Star-Male of the Year. His career began petering out after he turned down the lead in Splash (1984), a role that helped establish Tom Hanks as a top movie comedian and position him for his transition into movie drama and super-stardom. As Hanks star waxed, Moore's star waned, and by 1985 he was reduced to playing an elf in Santa Claus: The Movie (1985), one of the all time turkeys. Even a second turn as \"Arthur\" in Arthur 2: On the Rocks (1988) couldn't revive his box office, the dependent clause of the title all too well describing his career. His TV series Dudley (1993) [TV-Series] was a bust, and the 1990s proved a wasteland for the once-honored and prosperous comedian. Moore was deeply affected by the January 1995 death of Peter Cook by a gastrointestinal hemorrhage at the age of 57. Moore organized a two-day memorial to Cook in Los Angeles that was held in November 1995. Less than four years later, in September 1999, Moore announced that he was afflicted with progressive supra-nuclear palsy, a disease for which there is no treatment. Dudley Moore was invested as a Commander of the Order of The British Empire (one step below knighthood) in June 2001. Moore personally attended the ceremony at Buckingham Palace to accept his CBE from Prince Charles, despite being unable to speak and being wheelchair-bound. He died in Watchung, New Jersey on March 27, 2002, from the pneumonia related to progressive supra-nuclear palsy. He was 66 years old. Dudley Moore was married four times, to actresses Suzy Kendall, Tuesday Weld, Brogan Lane and 'Nicole Rothschild', and had two sons, one with Tuesday Weld and one with Nicole Rothschild.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MjY5MTQxOF5BMl5BanBnXkFtZTcwNTAxMTkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001545","name":"Dudley Moore","nicknames":["Cuddly Dudley","The Sex Thimble"],"idIMDB":"nm0001545"},"actorId":"nm0001545","character":"Dr. Jack Hammond / Chris Hammond","urlCharacter":"http://www.imdb.com/character/ch0215693","main":true},{"actorName":"Kirk Cameron","urlProfile":"http://www.imdb.com/name/nm0131647","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NTEwNDI5MV5BMl5BanBnXkFtZTcwNDQ2MjIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 October 1970","placeOfBirth":" Los Angeles, California, USA","birthName":"Kirk Thomas Cameron","height":"5' 10\" (1.78 m)","bio":"Kirk Thomas Cameron was born in Panorama City, California, to Barbara Cameron (née Barbara Jeanne Bausmith), a homemaker, and Robert Cameron, a teacher. Though his parents initially did not project show business aspirations onto their children, a family friend in the business noted to Barbara that both Kirk and his sister, Candace Cameron Bure, were cute enough that they could easily pick up lucrative work in commercials. After Cameron began appearing in TV ads for \"Polaroid\", \"McDonald's\" and \"Count Chocula\" cereal, he found himself wound up in Hollywood's notorious child-star mill, netting minor cute-kid parts in a handful of TV movies, including a couple of Disney projects and two ABC Afterschool Specials (1972) (1972-95). In 1983, he landed a regular gig, as a precocious kid, in ABC's Two Marriages (1983), a show that remained on the air less than a month. He found a more winning formula in 1985 with Growing Pains (1985), playing the oldest son of a family headed by a psychiatrist (Alan Thicke) and a journalist (Joanna Kerns), one in a sequence of family network sitcoms characterized by with-it parents and mischievous-but-squeaky-clean kids. On the show, Cameron played the incorrigible but dumb \"Mike Seaver\" and his winning portrayal won over a large number of teen fans. In spite of scathing critical notices, \"Growing Pains\" ranked among Nielsen's top 20 network shows for its first four seasons, rising to No. 5 in its 1987-88 year. On the heels of his sitcom success, Cameron appeared in his first feature film in 1986, the Robin Williams/Kurt Russell glory-days comedy, The Best of Times (1986). ABC would pump up Cameron as its \"It\" boy, and his trademark smirk in coming years would grace covers of a raft of teen magazines. Meanwhile, job offers cropped up to exploit his proverbial 15 minutes; he played the son/father of Dudley Moore in Like Father Like Son (1987), one of Hollywood's periodic flavor-du-jour retreads of the mystical parent/sibling body-switch comedies; netted the starring role in a high-profile Pepsi Super Bowl XXIV commercial; rated top-billing in Listen to Me (1989), an overwrought, widely-panned college drama about debate team wonks arguing against Roe v. Wade; and did a guest-shot, alongside sister Candace, on her ABC sister sitcom, Full House (1987) (1987-1995). Firmly established as the resident star of \"Growing Pains\", Cameron saw his pay jump to $50,000 a week and his fans sending him some 10,000 letters a week. But his coming-of-age took an unexpected turn, at least for everyone who worked with him. As he would later recall it in his autobiography, \"Still Growing\", the family of his first girlfriend initially exposed the 17-year-old to evangelical Christianity. Cameron experienced what he would later describe as a \"life-changing encounter with Jesus\" and declared himself \"born again\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NTEwNDI5MV5BMl5BanBnXkFtZTcwNDQ2MjIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0131647","name":"Kirk Cameron","idIMDB":"nm0131647"},"actorId":"nm0131647","character":"Chris Hammond / Dr. Jack Hammond","urlCharacter":"http://www.imdb.com/character/ch0215694","main":true},{"actorName":"Margaret Colin","urlProfile":"http://www.imdb.com/name/nm0171513","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg4NTMyNTcxMl5BMl5BanBnXkFtZTcwNDc2MTU5Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1958","placeOfBirth":" Brooklyn, New York, USA","height":"5' 9¾\" (1.77 m)","bio":"Margaret Colin was born in Brooklyn, New York and raised on Long Island. She graduated from Baldwin Senior High School in 1976. Margaret began acting in The Edge of Night (1956) (her character was a heiress and former terrorist, with seven murder attempts), and was employed next on As the World Turns (1956), portraying character Margo Montgomery. Margaret's first film appearance were as a teacher in John Hughes's Pretty in Pink (1986), followed by a role in Jonathan Demme's Something Wild (1986), where she played Irene, girlfriend to Ray Liotta's character. The following year, she had supporting roles in Like Father Like Son (1987), and 3 Men and a Baby (1987). In film, Margaret either had minor, or supporting, roles; it's her work in television that perhaps makes her most memorable. Ms Colin continued acting with parts in Chicago Hope (1994), and The Wright Verdicts (1995). In 2000, Margaret earned a Saturn Award for Best Genre TV Actress for her role as Lisa Wiseman in the series Now and Again (1999). From 2007 to 2013, she played Eleanor Waldorf in the series Gossip Girl (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzg4NTMyNTcxMl5BMl5BanBnXkFtZTcwNDc2MTU5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0171513","name":"Margaret Colin","idIMDB":"nm0171513"},"actorId":"nm0171513","character":"Ginnie Armbruster","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Catherine Hicks","urlProfile":"http://www.imdb.com/name/nm0382819","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NjY3NjkwNV5BMl5BanBnXkFtZTcwMjMyMDY5Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1951","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Catherine Mary Hicks","height":"5' 3\" (1.6 m)","bio":"Born in New York City and raised in Scottsdale, Arizona, Catherine Mary Hicks was a cheerleader at Gerard Catholic High School in Phoenix, Arizona, and graduated in 1969. Hicks attended Saint Mary's College-Notre Dame University and studied English literature. Moving east from South Bend, Indiana, she began her acting career at Cornell University, where she won a two-year scholarship to the Actor's Conservatory, where she received training in all aspects of the theatre. Leaving Cornell, she went to New York and, within a week, had landed a part on the ABC daytime drama, \"Ryan's Hope\" (1975). She became a notable actress of the 1980s, in film and television. After appearing on the soap opera, Ryan's Hope (1975) from 1976-78, she won a coveted role, starring with Jack Lemmon, in the Broadway stage production of \"Tribute\" for eight months. Catherine left Broadway to Hollywood, where, after several television guest appearances, she graduated to a leading role in the television movie Marilyn: The Untold Story (1980), playing Marilyn Monroe, which brought her international attention and an Emmy nomination. She appeared in several high profile films through the early 1980s, in leading and supporting roles whilst also appearing on television. Films included: Death Valley (1982), Garbo Talks (1984), The Razor's Edge (1984) and Peggy Sue Got Married (1986). She played \"Dr. Gillian Taylor\", opposite lead actor William Shatner, in Star Trek IV: The Voyage Home (1986), a cult sequel to the popular Star Trek films. In the late 1980s, she played the lead role of \"Karen Barclay\" in Child's Play (1988), a film that remains highly regarded in the horror genre. It was on the set of this film that Catherine met her future husband, Kevin Yagher, with whom she had a daughter in 1992. Despite her obvious talent, big movie roles never seemed to find their way to her in the early 1990s. In spite of this, she worked consistently, appearing in Liebestraum (1991), Dillinger and Capone (1995), the Hallmark Hall of Fame movie Redwood Curtain (1995), and a small role in the semi-high profile movie, Turbulence (1997). In 1996, she landed the lead role in the Warner Bros. television series, 7th Heaven (1996), playing \"Annie Jackson-Camden\". From that point on, her career revolved around the television series and her family, occasionally appearing in films. Her last to-date film was the television movie, For All Time (2000), opposite Mark Harmon. 7th Heaven (1996) was canceled in 2007, after a successful eleven-year run, but it is likely that this attractive and talented actress will remain in films and television for a long time to come.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NjY3NjkwNV5BMl5BanBnXkFtZTcwMjMyMDY5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0382819","name":"Catherine Hicks","nicknames":["Cathy"],"idIMDB":"nm0382819"},"actorId":"nm0382819","character":"Dr. Amy Larkin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick O'Neal","urlProfile":"http://www.imdb.com/name/nm0641929","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4OTUwOTg2Ml5BMl5BanBnXkFtZTcwMDg3NDYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 September 1927","placeOfBirth":" Ocala, Florida, USA","birthName":"Patrick Wisdom O'Neal","height":"6' 1\" (1.85 m)","bio":"Dark, dashing and coldly handsome with intense, penetrating eyes, Patrick O'Neal was known for walking that fine line between elegant heroics and elegant villainy during his five-decade career. Born in 1927 in Ocala, Florida, and of Irish descent, he served toward the end of WWII with the United States Army Air Corp and, in his late teens, was assigned to direct training shorts for the Signal Corps. A graduate of the University of Florida at Gainesville, he subsequently moved to New York and continued his dramatic studies at the Actor's Studio and Neighborhood Playhouse. O'Neal made an initial impact in the early 1950s when he replaced Tony Randall in the hit Broadway comedy \"Oh, Men! Oh, Women!\". Following a strong role in \"The Far Country\" (1961), he gave a superlative portrayal of the defrocked Reverend Shannon opposite Bette Davis and Margaret Leighton in Tennessee Williams' \"The Night of the Iguana\" later that year. Unfortunately for him, Richard Burton collared the role in its 1963 transition to film, The Night of the Iguana (1964). The attention nevertheless earned O'Neal both lead and support roles on camera, but most of those performances would be routine and, for the most part, overlooked. A capable player used regularly in 1960s films and 1970s television, he was usually cast as either a rugged trooper in the action adventures King Rat (1965) and Assignment to Kill (1968); a careerist sycophant in the naval spectacle In Harm's Way (1965); or as a flashy murderer in such gruesome yarns as Chamber of Horrors (1966), probably his best known film. In later years, it was almost strictly television movies and guest spots. His wife and brother owned several restaurants with him. He died in 1994 from respiratory failure while battling tuberculosis.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4OTUwOTg2Ml5BMl5BanBnXkFtZTcwMDg3NDYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641929","name":"Patrick O'Neal","idIMDB":"nm0641929"},"actorId":"nm0641929","character":"Dr. Larry Armbruster","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sean Astin","urlProfile":"http://www.imdb.com/name/nm0000276","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjczOTQ1NF5BMl5BanBnXkFtZTcwMzI2NzYyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 February 1971","placeOfBirth":" Santa Monica, California, USA","birthName":"Sean Patrick Duke","height":"5' 7\" (1.7 m)","bio":"Sean Astin is well known for his film debut portraying Mikey in Steven Spielberg's The Goonies (1985), for playing the title role in the critically acclaimed Rudy (1993), and for his role as the beloved Sam Gamgee in the Academy Award winning trilogy, The Lord of the Rings: The Fellowship of the Ring (2001), The Lord of the Rings: The Two Towers (2002), and The Lord of the Rings: The Return of the King (2003). Astin was born Sean Patrick Duke on February 25, 1971 in Santa Monica, California. His mother was actress Patty Duke. At the time of his birth, his biological father was believed to be entertainer Desi Arnaz Jr., but Astin discovered through a DNA test in the 1990s that his biological father is music promoter Michael Tell, who was married to Patty Duke in 1970. Sean was raised by his stepfather, actor John Astin, who married Patty Duke in 1972 and whose surname Sean took. Sean's mother was of Irish and more distant German ancestry, and Sean's biological father is of Austrian Jewish and Polish Jewish descent. At age nine, Sean starred with his mother in the after-school special Please Don't Hit Me, Mom (1981). Followed by Sean's feature debut The Goonies (1985) and since then, he has had a steady stream of roles. Starring in Toy Soldiers (1991), Where the Day Takes You (1991), Rudy (1993) and Harrison Bergeron (1995). He directed and co-produced the short film Kangaroo Court (1994), which was nominated in the best short film category at The 67th Annual Academy Awards (1995). Sean's adoptive father John Astin was nominated for the same award in 1969. Politically, Sean has been very active having served in two non-partisan Presidential appointments. Sean also hosts a live weekly 2 hour in-studio bi-partisan political radio talk show, 'Vox Populi Radio' which was made possible by a successful crowdfunding campaign in 2013. In 2004, Sean broke into the publishing world and authored the NY Times Best Selling release of There and Back Again a memoir of his film career (co-written with Joe Layden). Sean attended Crossroads High School for the Arts and studied with the famous Stella Adler. He graduated with honors from UCLA; B.A. in History & B.A. in English American Literature and Culture. Sean is married to Christine Astin, his co-producer on Kangaroo Court (1994). The couple lives in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjczOTQ1NF5BMl5BanBnXkFtZTcwMzI2NzYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000276","name":"Sean Astin","idIMDB":"nm0000276"},"actorId":"nm0000276","character":"Clarence / Trigger","urlCharacter":"http://www.imdb.com/character/ch0215695","main":true},{"actorName":"Camille Cooper","urlProfile":"http://www.imdb.com/name/nm0177914","urlPhoto":"","biography":{"height":"5' 6½\" (1.69 m)","bio":"Camille Cooper was born in Los Angeles and raised in New York. She stared in over 12 films and television series including Knots Landing and ABCs General Hospital. Camille is also recognized as one of the top national experts on issues related to the media. Camille serves as director of legislative affairs for The National Association to PROTECT Children . Camille helped spearhead The PROTECT Our Children Act of 2008, the largest crime bill of the 110th Congress, which was signed into law by President George W. Bush. This bill brought unprecedented changes, innovation, technology and resources to law enforcement, resulting in hundreds of millions of dollars of spending for law enforcement job creation and technology development, including a global law enforcement information sharing and de-confliction Internet portal.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0177914","name":"Camille Cooper","idIMDB":"nm0177914"},"actorId":"nm0177914","character":"Lori Beaumont","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Micah Grant","urlProfile":"http://www.imdb.com/name/nm0335562","urlPhoto":"","biography":{"dateOfBirth":"18 February 1966","placeOfBirth":" Cincinnati, Ohio, USA","bio":"Micah Grant was born on February 18, 1966 in Cincinnati, Ohio, USA. He is an actor, known for Waxwork (1988), Like Father Like Son (1987) and Terminal Bliss (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0335562","name":"Micah Grant","idIMDB":"nm0335562"},"actorId":"nm0335562","character":"Rick Anderson, Lori's Boyfriend","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Morrison","urlProfile":"http://www.imdb.com/name/nm3089580","urlPhoto":"","biography":{"bio":"Bill Morrison is an actor, known for Like Father Like Son (1987), Cyborg (1989) and The Wizard of Speed and Time (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3089580","name":"Bill Morrison","idIMDB":"nm3089580"},"actorId":"nm3089580","character":"Trigger's Uncle Earl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Skeeter Vaughan","urlProfile":"http://www.imdb.com/name/nm0891103","urlPhoto":"","biography":{"dateOfBirth":"4 December 1922","placeOfBirth":" Riverside County, California, USA","birthName":"George Vaughan","bio":"Skeeter Vaughan was born on December 4, 1922 in Riverside County, California, USA as George Vaughan. He was an actor, known for Like Father Like Son (1987), Revolution (1985) and Journey to Spirit Island (1988). He died on March 8, 1989 in Sequim, Washington, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0891103","name":"Skeeter Vaughan","idIMDB":"nm0891103"},"actorId":"nm0891103","character":"Medicine Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larry Sellers","urlProfile":"http://www.imdb.com/name/nm0783353","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MDgzNjc2OF5BMl5BanBnXkFtZTgwNjEyMjY1MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Larry Sellers was born in Pawhuska, Oklahoma, USA. He is known for his work on Dr. Quinn, Medicine Woman (1993), Wayne's World 2 (1993) and Like Father Like Son (1987).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MDgzNjc2OF5BMl5BanBnXkFtZTgwNjEyMjY1MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0783353","name":"Larry Sellers","idIMDB":"nm0783353"},"actorId":"nm0783353","character":"Navajo Helper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tami David","urlProfile":"http://www.imdb.com/name/nm0203074","urlPhoto":"","biography":{"bio":"Tami David is an actress, known for Like Father Like Son (1987) and Almost There! (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0203074","name":"Tami David","idIMDB":"nm0203074"},"actorId":"nm0203074","character":"Navajo Girl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maxine Stuart","urlProfile":"http://www.imdb.com/name/nm0835798","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1Mjg0NzQ2NV5BMl5BanBnXkFtZTgwNTEwNDI2MTE@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1918","placeOfBirth":" Deal, New Jersey, USA","birthName":"Maxine Shlivek","bio":"Maxine Stuart was born on June 28, 1918 in Deal, New Jersey, USA as Maxine Shlivek. She was an actress, known for General Hospital (1963), Days of Wine and Roses (1962) and Private Benjamin (1980). She was married to David Shaw and Frank Maxwell. She died on June 6, 2013 in Beverly Hills, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1Mjg0NzQ2NV5BMl5BanBnXkFtZTgwNTEwNDI2MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0835798","name":"Maxine Stuart","idIMDB":"nm0835798"},"actorId":"nm0835798","character":"Phyllis, Hammonds' Housekeeper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Wohl","urlProfile":"http://www.imdb.com/name/nm0937387","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNTIxMDIzMl5BMl5BanBnXkFtZTgwMTc5OTAxMTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 September 1953","placeOfBirth":" Brooklyn, New York, USA","bio":"David Wohl was born on September 22, 1953 in Brooklyn, New York, USA. He is an actor and producer, known for Saving Private Ryan (1998), Hot Shots! Part Deux (1993) and Sophie's Choice (1982).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwNTIxMDIzMl5BMl5BanBnXkFtZTgwMTc5OTAxMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0937387","name":"David Wohl","idIMDB":"nm0937387"},"actorId":"nm0937387","character":"Dr. Roger Hartwood","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Horton","urlProfile":"http://www.imdb.com/name/nm0395649","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQyMjU4NzUzOF5BMl5BanBnXkFtZTgwNjE2OTEzMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"Michael Horton is an actor, known for The Legend of Prince Valiant (1991), First Contact (1996) and Star Trek: Insurrection (1998). He is married to Debbie Zipp. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQyMjU4NzUzOF5BMl5BanBnXkFtZTgwNjE2OTEzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0395649","name":"Michael Horton","idIMDB":"nm0395649"},"actorId":"nm0395649","character":"Dr. Mike O'Donald","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0093418","urlIMDB":"http://www.imdb.com/title/tt0093418","business":{"budget":null,"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1987/\">1987</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 36 min (96 min)","1 hr 40 min (100 min) (UK)"],"soundMix":["Dolby"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex 35 III","Panavision Panaflex Gold"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm (Eastman 125T 5247, 400T 5294, 250D 5297)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.1","filmingLocations":[{"location":"Mojave Desert, California, USA"}],"rated":"PG-13","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1988","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Performance by a Younger Actor","names":[{"name":"Kirk Cameron","id":"nm0131647","role":null}]}]}]},{"award":"Young Artist Awards 1988","titlesAwards":[{"titleAwardOutcome":"Won Young Artist Award","categories":[{"category":"Best Family Motion Picture - Comedy","names":[]}]}]}],"votes":"4,704","type":"Movie","companyCreditsSimple":[{"idCompany":"co0310123","name":"Imagine Films Entertainment"}],"keywords":{"keywords":["serum","native american","surgeon","teenage boy","adult as a child","father son relationship","body swap","soul transference","child as an adult","role reversal","switching bodies","body switching","body transformation","teen movie","housekeeper","screaming","hangover","bar","climbing a tree","scene during opening credits","leg injury","professor","rock band","rock concert","medical intern","patient","surgery","baton","relay race","running race","track meet","sexually aggressive woman","listening to music","jeep","slow motion","kiss","cigarette smoking","stethoscope","close up of lips","classroom","cafeteria","chewing gum","cleavage","candle","couch on fire","repetition in title","clumsiness","couch","swimming pool","breaking a car window","beating","woman in labor","fainting","slipping on a wet floor","skeleton","punched in the face","reckless driving","flat tire","spaghetti","cat","dog","hospital","fire","crush on girl","friendship between boys","father son hug","cheating wife","bully","teenager","high school","friend","childbirth","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:12:10"}}