{"data":{"movies":[{"title":"The Jazz Singer","originalTitle":"","year":"1927","releaseDate":"19271006","directors":[{"name":"Alan Crosland","id":"nm0189076"}],"writers":[{"name":"Samson Raphaelson","id":"nm0710723"},{"name":"Alfred A. Cohn","id":"nm0169879"}],"runtime":"88 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MzM5MjkzMV5BMl5BanBnXkFtZTgwNjg0OTMyMjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Music","Musical","Romance"],"plot":"Cantor Rabinowitz is concerned and upset because his son Jakie shows so little interest in carrying on the family's traditions and heritage. For five generations, men in the family have been cantors in the synagogue, but Jakie is more interested in jazz and ragtime music. One day, they have such a bitter argument that Jakie leaves home for good. After a few years on his own, now calling himself Jack Robin, he gets an important opportunity through the help of well-known stage performer Mary Dale. But Jakie finds that in order to balance his career, his relationship with Mary, and his memories of his family, he will be forced to make some difficult choices.","simplePlot":"The son of a Jewish Cantor must defy the traditions of his religious father in order to pursue his dream of becoming a jazz singer.","actors":[{"actorName":"Al Jolson","urlProfile":"http://www.imdb.com/name/nm0427231","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MjA1MDg0NV5BMl5BanBnXkFtZTYwMDIwMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1886","placeOfBirth":" Srednik, Kovno Governorate, Russian Empire [now Seredzius, Lithuania]","birthName":"Asa Yoelson","height":"5' 8\" (1.73 m)","bio":"Al Jolson was known in the industry as \"The World's Greatest Entertainer,\" for well over 40 years. After his death his influence continued unabated with such performers as Sammy Davis Jr., Elvis Presley, Mick Jagger, David Bowie, Jackie Wilson and Jerry Lee Lewis all mentioning him as an inspiration. Jolson was born Asa Yoelson in Lithuania to Cantor Moishe Yoelson, who emigrated alone to Washington, DC, to establish himself. After four years he sent for his family. Nine months later his wife, Naomi, died (apparently during childbirth), which devastated the eight-year-old Asa. Young Al would soon find his outlet in the theater. Soon he was singing with his older brother, Harry, for senators and soldiers. He entertained the troops that were headed for the Spanish-American War. Jolson's career in vaudeville started with his brother in New York, but never really got off the ground. Different partners allowed Jolson to experiment, but it was as a solo act in San Francisco that he finally hit it big. He was signed eventually by Lew Dockstaders' Minstrels. It is important to note that, although performing in blackface, Dockstader's was not a minstrel show in the traditional sense of the \"Tambo and Bones\" variety of the previous century. It was a sophisticated, topical, Broadway-style revue. The myth lingers to this day that Jolson was a minstrel. He most certainly was not. Jolson's stay in vaudeville was relatively short, as his talent was quickly recognized by the Shubert Brothers, who signed him to appear in the opening show of their new Winter Garden Theater on Broadway in April of 1912. Thus began what many consider to be the greatest career in the history of Broadway. Not a headliner initially, Jolson soon became \"King of the Winter Garden,\" with shows specifically written for him. \"Winter Garden\" and \"Jolson\" became synonymous for close to 20 years. During that time Jolson received reviews that have yet to be matched. Audiences shouted, pleaded and often would not allow the show to proceed, such was the power of his presence. At one performance in Boston, the usually staid and conservative Boston audience stopped the show for 45 minutes! He was said to have had an \"electric' personality, along with the ability to make each member of the audience believe that he was singing only to them. In 1927 Jolson starred in the New York-shot The Jazz Singer (1927) and the rest is film history. But just before it was theatrically released, producer, Warner' His appearance in that film, nowadays considered a somewhat creaky, stodgy and primitive museum piece, electrified audiences and caused a sensation. Jolson was bigger than ever and Hollywood came a-calling. However, Jolson on film was a pale version of Jolson on stage. His screen appearances, with some exceptions, are stiff and wooden. Though he continued into the 1930s to star on radio, he was no longer quite the star he had been. During World War II, Jolson entertained troops in Africa and Sicily but was cut short by a bout of malaria and pneumonia. Always a favorite with audiences, he continued to entertain in the United States when he met his fourth wife, Erle Chenault Galbraith, an x-ray technician. By the mid-'40s, though. his stardom had faded quite a bit. Columbia Pictures, inspired by the success of Yankee Doodle Dandy (1942), decided that a Jolson biography might work as well. In 1946 it released The Jolson Story (1946), with song-and-dance man Larry Parks miming to Jolson's vocals. It was the surprise smash hit of the season and the highest grossing film of the year. Parks received an Academy Award nomination for Best Actor. Jolson was now as big, or bigger, than ever. So successful was the film that Columbia made a sequel, Jolson Sings Again (1949), which remains one of a few biography sequels in film history (Funny Girl/Funny Lady - the story of fellow Winter Garden performer Fannie Brice is another rare example). It was also quite successful at the box office. So big had Jolson's star risen that in 1948, when Bing Crosby, Frank Sinatra and Perry Como were at their peaks, Jolson was voted \"The Most Popular Male Vocalist\" by a Variety poll. In 1950, against his doctor's orders, Jolson went to Korea to entertain his favorite audience, American troops. While there his health declined and shortly after his return to the U.S. he suffered a massive heart attack and died. Jolson's legacy has suffered enormously since the 1960s. Few under the age of 50 even know his name, and those who do were taught that he was a \"white man who made millions making fun of black people.\" This is, of course, specious. In fact, blackface had long lost its pejorative racial implications by the turn of the century and became a convention of theater. Many stars, including Eddie Cantor, Fred Astaire, Bing Crosby, Judy Garland, Doris Day, Betty Grable and many black stars of the time, used blackface. There was no bigotry attached to it. So the man who was the king of Broadway for nearly 40 years is now largely forgotten or misunderstood, and there is no plaque or statue or even sign anywhere on Broadway to honor him.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MjA1MDg0NV5BMl5BanBnXkFtZTYwMDIwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0427231","name":"Al Jolson","nicknames":["Jolie"],"idIMDB":"nm0427231"},"actorId":"nm0427231","character":"Jakie Rabinowitz","urlCharacter":"http://www.imdb.com/character/ch0046234","main":true},{"actorName":"May McAvoy","urlProfile":"http://www.imdb.com/name/nm0564219","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MDk1NTA0NV5BMl5BanBnXkFtZTcwMzMxNjUzOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 September 1899","placeOfBirth":" New York City, New York, USA","height":"4' 11\" (1.5 m)","bio":"Silent-screen star May McAvoy was born in an upscale area of New York City. Her well-to-do family owned and operated a large livery stable situated where the Waldorf-Astoria Hotel now stands. She initially wanted to be a teacher but became intrigued with show business after watching a friend rehearse a show at a nearby vaudeville theater. A model whose first job was a commercial for Domino Sugar, she moved into extra work in films and received her first major break with The Devil's Garden (1920) co-starring Lionel Barrymore. Stardom was hers, however, as the lead in Sentimental Tommy (1921), which led to a Paramount contract. McAvoy later stated that she was not content to play whatever part the studio might choose for her and she demanded quality. She claimed that Cecil B. DeMille wanted her as the leading lady for _Adam's Rib (1923)_ but she balked at bobbing her hair and wearing the required pelt for the caveman sequence. She believed that he was able to have her unofficially suspended because of her refusal. Whatever her reasons for leaving Paramount, May bought out her contract and freelanced for the next six years. McAvoy wound up flourishing in such movies as The Enchanted Cottage (1924), Tessie (1925) and Lady Windermere's Fan (1925), while replacing Gertrude Olmstead as Esther in her best known silent film, Ben-Hur: A Tale of the Christ (1925). Mostly forgotten today except by more devoted film enthusiasts, May nevertheless holds a steadfast position in film history thanks to her co-starring role in Hollywood's first talkie, The Jazz Singer (1927) opposite Al Jolson, which is actually a silent film with several sound musical and speaking sequences; she herself had no talking scenes. Coincidentally, May also starred in England's first all-talking picture The Terror (1928). She retired after her marriage in 1929 and bore one son, Patrick. She returned to films for a decade and a half in the 1940s for MGM but never received any screen credit for these parts (her final role was as an extra in Ben-Hur (1959). She was widowed in 1973 and died a decade later of a heart attack.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MDk1NTA0NV5BMl5BanBnXkFtZTcwMzMxNjUzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0564219","name":"May McAvoy","idIMDB":"nm0564219"},"actorId":"nm0564219","character":"Mary Dale","urlCharacter":"http://www.imdb.com/character/ch0180639","main":true},{"actorName":"Warner Oland","urlProfile":"http://www.imdb.com/name/nm0645941","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDMyOTU0OF5BMl5BanBnXkFtZTYwMDM0NzU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1879","placeOfBirth":" Nyby, Västerbottens län, Sweden","birthName":"Johan Verner Öhlund","height":"5' 11\" (1.8 m)","bio":"Warner Oland was born Johan Verner Olund in the small village of Nyby in Bjurholm parish in the county of Vasterbotten, Sweden, on October 3, 1879. Bjurholm is situated about 60 kilometers outside the town of Umea. His family emigrated to the US on October 15, 1892. His father Jonas was a shopkeeper and his mother was Maria Johanna (nee Forsberg). After finishing grade school and working on Broadway during his 20s, Oland settled in California in the early 1910s, where he worked odd jobs. The movie industry was in its beginning stages in Hollywood, and Johan Olund--changing his name to the more Americanized \"Warner Oland\"--worked as a stage actor for a while before getting small parts in films in the 1910s and 1920s. As Hollywood made the transition from silent to sound pictures in the late 1920s (Oland co-starred in Warner Brothers' groundbreaking part-talkie The Jazz Singer (1927)), he began landing more prominent roles. His greatest success came in 1931 when he was cast in the role of Charlie Chan, a Honolulu-based Chinese-American police detective in Charlie Chan Carries On (1931), based on the popular detective mystery series by Earl Derr Biggers [1884-1933] which was produced by Fox Films. His performance as the seemingly mild-mannered but razor-sharp Asian detective won him critical acclaim, which resulted in his playing Chan again in the sequel, The Black Camel (1931). The success of the Chan character turned into a cash cow for Fox Studios and Oland became a valuable property. It seems incredible today, but in Fox's pre-Shirley Temple period, Oland was considered the only guaranteed profit maker on the lot. He became wealthy and bred miniature schnauzers. Although seemingly happy, Oland became increasingly dependent upon alcohol and exhibited bizarre delusional behavior after periods of drinking. Oland appeared in a total of 16 Charlie Chan feature films from 1931 to 1937. The Chan films were budgeted approaching 1930s A-picture levels (approximately $275,000) and were usually shot within tight 30-day schedules, three films per year (sadly, a number of these have apparently been lost). The series was pretty much the only guaranteed profit-maker the ailing studio could bank on during the days leading to its takeover by ex-Warner's production chief Darryl F. Zanuck in 1935, that resulted in its transformation from Fox Films into Twentieth Century-Fox. From 1931 to 1935 Oland did other films besides the Chan series, but he was increasingly relegated to roles that didn't vary much beyond mysterious Asians, and in mid-1935 he became so identified as Charlie Chan that he was assigned to the series exclusively. His last eight films were all Chan entries, usually co-starring Keye Luke, who played Chan's Number One Son. While considered somewhat stereotypical today, these films were met with wide critical acclaim and all were hugely profitable. The best of the series is generally considered to be Charlie Chan at the Opera (1936), featuring lavish set design and a particularly effective menacing villain in Boris Karloff. Oland's physical and mental problems slowly began to catch up to him, and in 1937 he was said to have suffered a nervous breakdown apparently due to some kind of mental dementia. The Fox executives, knowing that Oland was one of its biggest money earners, kept his alcoholism and mental problems hidden from the public. In November 1937, Edith, his wife of 30 years, filed for divorce. In January 1938 \"Charlie Chan at (the) Ringside\" began production at Fox's Western Avenue lot under the direction of James Tinling with an increasingly erratic Oland. After a few days shooting inside Studio 6, Oland walked out and never returned. He was heard complaining the studio was possessed by voodoo and feared contracting pneumonia. Over the next month there were numerous negotiations between Oland and SAG (Oland had been an early member) and production was briefly resumed, then suspended after Oland again failed to report to work. He was hospitalized and released, then decided to return to his mother's home in Sweden. Oland's film career, unbeknown to him, was over. In the interim, producer Sol M. Wurtzel, desperate to salvage the property, ordered the Chan picture reworked as Mr. Moto's Gamble (1938), with minor supporting cast changes. Successful negotiations were made with the Biggers' estate and the film was quickly shot with Peter Lorre and released April 7, 1938. The film itself remains an anachronism in the Moto series, as it contains much Chan-like dialog, tacked on Moto-esque action scenes and a guest-starring role by Keye Luke. Regardless, it was also a hit. During his visit to Sweden, Oland negotiated a reconciliation with Edith but contracted bronchial pneumonia and died there on August 6, 1938, at age 57. Ironically, Fox contract (and Chan series) director John G. Blystone died the same day. Numerous actors were tested to fill Oland's shoes as Charlie Chan, among them Cy Kendall, Walter Connolly, J. Edward Bromberg, Noah Beery Jr., Michael Visaroff and Leo Carillo (Kendall and Connelly had played Chan on radio). The series continued at Fox for another 11 entries with Sidney Toler, who was signed by Zanuck in mid-October 1938. Toler injected more humor into the character as scripts became somewhat more pedestrian. By 1942 Fox considered the series exhausted and it would ultimately be sold to low-budget studio Monogram Pictures and continue on even after Toler's death in 1947 with Roland Winters in the role through six dismal films into 1949. In a postscript, Fox director Norman Foster paid a subtle tribute to Oland in the next Moto film, Mr. Moto's Last Warning (1939). During that movie's production in August 1938, cast and crew learned of Oland's passing in his native Sweden. Over the title Charlie Chan in Honolulu (1938), on the bill of the Sultana Theatre of Variety, they placed the banner \"Last Day.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MDMyOTU0OF5BMl5BanBnXkFtZTYwMDM0NzU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0645941","name":"Warner Oland","nicknames":["Jack"],"idIMDB":"nm0645941"},"actorId":"nm0645941","character":"The Cantor","urlCharacter":"http://www.imdb.com/character/ch0499870","main":true},{"actorName":"Eugenie Besserer","urlProfile":"http://www.imdb.com/name/nm0078806","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjlmNWQ5ZjctYmEwYS00ODIyLWE0MTItN2U2MWU1YjBmMjAyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1868","placeOfBirth":" Watertown, New York, USA","height":"5' 2\" (1.57 m)","bio":"Eugenie Besserer was born in Watertown, New York on Christmas Day of 1868. She was largely a silent film actress who made her debut in 1910's silent version of The Wonderful Wizard of Oz (1910). She was 42 at the time. For the most part Eugenie was a character actress, much in demand for filling in roles. Because of her willingness to take just about any role, Eugenie was able to be a part of films such as Enemies of Children (1923), The Millionaire Policeman (1926), The Jazz Singer (1927) (the first \"talkie\"), and A Royal Romance (1930). Her final film was 1933's To the Last Man (1933). Eugenie died of natural causes on May 28, 1934 in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjlmNWQ5ZjctYmEwYS00ODIyLWE0MTItN2U2MWU1YjBmMjAyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0078806","name":"Eugenie Besserer","idIMDB":"nm0078806"},"actorId":"nm0078806","character":"Sara Rabinowitz","urlCharacter":"http://www.imdb.com/character/ch0180640","main":true},{"actorName":"Otto Lederer","urlProfile":"http://www.imdb.com/name/nm0496470","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODFjOGM1N2MtODg1MS00ODIzLWEyYjQtOGRjOWJlMGFkNGUzL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 April 1886","placeOfBirth":" Prague, Austria-Hungary [now Czech Republic]","height":"5' 9\" (1.75 m)","bio":"Otto Lederer was born on April 17, 1886 in Prague, Austria-Hungary [now Czech Republic]. He is known for his work on The Jazz Singer (1927), The Wooing of Riley (1918) and The Face of Fear (1913). He was married to Segunda Yrionda, Florita Mernci and Gretchen Lederer. He died on September 3, 1965 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODFjOGM1N2MtODg1MS00ODIzLWEyYjQtOGRjOWJlMGFkNGUzL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0496470","name":"Otto Lederer","idIMDB":"nm0496470"},"actorId":"nm0496470","character":"Moisha Yudelson","urlCharacter":"http://www.imdb.com/character/ch0180641","main":true},{"actorName":"Robert Gordon","urlProfile":"http://www.imdb.com/name/nm0330036","urlPhoto":"","biography":{"dateOfBirth":"21 August 1913","placeOfBirth":" Pittsburgh, Pennsylvania, USA","height":"5' 6\" (1.68 m)","bio":"Robert Gordon was born on August 21, 1913 in Pittsburgh, Pennsylvania, USA. He was a director and actor, known for It Came from Beneath the Sea (1955), The Joe Louis Story (1953) and The Gatling Gun (1971). He was married to Sophia Levine. He died on December 1, 1990 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0330036","name":"Robert Gordon","idIMDB":"nm0330036"},"actorId":"nm0330036","character":"Jakie Rabinowitz - Age 13","urlCharacter":"http://www.imdb.com/character/ch0046234","main":true},{"actorName":"Richard Tucker","urlProfile":"http://www.imdb.com/name/nm0875983","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWYyZTIxMWMtNDI2NC00MzUxLWE0MjEtY2EyYjI5N2IyNzJmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1884","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"5' 11½\" (1.82 m)","bio":"Richard Tucker was born on June 4, 1884 in Brooklyn, New York City, New York, USA. He was an actor, known for Wings (1927), The Jazz Singer (1927) and The Bat Whispers (1930). He was married to Ruth Mitchell. He died on December 5, 1942 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWYyZTIxMWMtNDI2NC00MzUxLWE0MjEtY2EyYjI5N2IyNzJmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0875983","name":"Richard Tucker","idIMDB":"nm0875983"},"actorId":"nm0875983","character":"Harry Lee","urlCharacter":"http://www.imdb.com/character/ch0180642","main":true},{"actorName":"Yossele Rosenblatt","urlProfile":"http://www.imdb.com/name/nm0742390","urlPhoto":"","biography":{"dateOfBirth":"9 May 1882","placeOfBirth":" Bila Tserkva, Kiev Governorate, Russian Empire [now Ukraine]","birthName":"Josef Rosenblatt","bio":"Yossele Rosenblatt was born on May 9, 1882 in Bila Tserkva, Kiev Governorate, Russian Empire as Josef Rosenblatt. He was an actor, known for The Jazz Singer (1927), The Voice of Israel (1934) and Halome Ami (1933). He was married to Taube Kaufman and Traube Kaufmann. He died on June 19, 1933 in Jerusalem, Palestine [now Israel].","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0742390","name":"Yossele Rosenblatt","idIMDB":"nm0742390"},"actorId":"nm0742390","character":"Cantor Rosenblatt - Concert Recital","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0018037","urlIMDB":"http://www.imdb.com/title/tt0018037","business":{"budget":{"money":"$422,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1927/\">1927</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 28 min (88 min)"],"soundMix":["Mono (Vitaphone)"],"color":["Black and White"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":["2,474 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.8","filmingLocations":[{"location":"Chatsworth, Los Angeles, California, USA"}],"rated":"UNRATED","awards":[{"award":"Academy Awards, USA 1929","titlesAwards":[{"titleAwardOutcome":"Won Honorary Award","categories":[{"category":"","names":[]}]},{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Writing, Adaptation","names":[{"name":"Alfred A. Cohn","id":"nm0169879","role":null}]}]}]},{"award":"National Film Preservation Board, USA 1996","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"","names":[]}]}]}],"votes":"7,237","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."}],"keywords":{"keywords":["blackface","cantor","jazz singer","singer","tradition","saloon","argument","train station","jew","tradition versus modernity","manhattan new york city","early sound","ethnic identity","painted face","face paint","stock footage","runaway","lower east side manhattan new york city","jewish ghetto","double exposure effects","child performer","yom kippur","theatrical agent","temple","showbiz","san francisco california","racial impersonation","price of fame","new york city","mother son relationship","jazz music","fame","entertainer","dysfunctional family","dying","death","dancer","concert","chicago illinois","broadway manhattan new york city","famous line","racial stereotype","jewish stereotype","prayer shawl","jewish service","part talkie","ambition","musician","jazz age","jewish culture","father son relationship","based on play"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:23:32"}}