{"data":{"movies":[{"title":"The Last Starfighter","originalTitle":"","year":"1984","releaseDate":"19840713","directors":[{"name":"Nick Castle","id":"nm0145309"}],"writers":[{"name":"Jonathan R. Betuel","id":"nm0079471"}],"runtime":"101 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM0ZjJjODYtOGM2ZC00YmExLThhODgtNzY4NTg2OWM4ZGQ4XkEyXkFqcGdeQXVyNjExODE1MDc@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Sci-Fi"],"plot":"Alex Rogan lives in a trailer court where his mother is manager and everyone is like a big extended family. He beats the Starfighter video game to the applause of everyone in the court and later that day finds he has been turned down for a student loan for college. Depressed, he meets Centauri, who introduces himself as a person from the company that made the game, before Alex really knows what is going on he is on the ride of his life in a \"car\" flying through space. Chosen to take the skills he showed on the video game into real combat to protect the galaxy from an invasion. Alex gets as far as the Starfighter base before he really realized that he was conscripted and requests to be taken back home. When he gets back home, he finds a Zando-Zan (alien bounty hunter) is stalking him. Unable to go home and live, Alex returns to the Starfighter base to find all the pilots have been killed and he is the galaxy's only chance to be saved from invasion. To defeat the invaders, who are ...","simplePlot":"A video game expert Alex Rogan finds himself transported to another planet after conquering The Last Starfighter video game only to find out it was just a test.He was recruited to join the team of best starfighters to defend their world from the attack.","actors":[{"actorName":"Kay E. Kuter","urlProfile":"http://www.imdb.com/name/nm0476484","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NTMzMTk5M15BMl5BanBnXkFtZTgwMjIyNTg0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1925","placeOfBirth":" Los Angeles, California, USA","birthName":"Kay Edwin Emmert Kuter","height":"6' 3½\" (1.92 m)","bio":"Kay E. Kuter was born on April 25, 1925 in Los Angeles, California, USA as Kay Edwin Emmert Kuter. He was an actor, known for The Last Starfighter (1984), Warlock (1989) and Guys and Dolls (1955). He died on November 12, 2003 in Burbank, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NTMzMTk5M15BMl5BanBnXkFtZTgwMjIyNTg0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0476484","name":"Kay E. Kuter","idIMDB":"nm0476484"},"actorId":"nm0476484","character":"Enduran","urlCharacter":"http://www.imdb.com/character/ch0258876","main":true},{"actorName":"Dan Mason","urlProfile":"http://www.imdb.com/name/nm0556660","urlPhoto":"","biography":{"bio":"Dan Mason is an actor, known for The Last Starfighter (1984), Roommates (1971) and White Mama (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0556660","name":"Dan Mason","idIMDB":"nm0556660"},"actorId":"nm0556660","character":"Lord Kril","urlCharacter":"http://www.imdb.com/character/ch0176602","main":true},{"actorName":"Lance Guest","urlProfile":"http://www.imdb.com/name/nm0346411","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODEwMzczNF5BMl5BanBnXkFtZTgwMDY3NTIyMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 July 1960","placeOfBirth":" Saratoga, California, USA","birthName":"Lance R. Guest","height":"6' 3\" (1.91 m)","bio":"Lance Guest's family lived on an 11 acre prune ranch in the then-rural Saratoga, Ca for most of the 1950's. More than 10 years younger than his boomer siblings, Lance was born in 1960, when his father, a Navy fighter pilot, moved the family to a larger house with running water. At a young age, he was memorizing the comedy records of Bill Cosby, Stan Freberg, Allan Sherman, and Mel Brooks, as well as all the early 60's Bob Dylan records. He learned to play guitar at age 10, and was performing plays in junior high school. At 15, his friend Michael Gurley asked him to join his garage band, Stillwater, for their first and only gig in the summer of 1975. He was cast in plays all throughout high school, his first being Nathan Detroit, and knowing nothing of New York, other than TV detectives, performed the entire role as Mel Brooks. He then trained in the summers at an intensive workshop created by former members of ACT in San Francisco. Planning to attend ACT and work at the Oregon Shakespeare Festival in Ashland, his acting teacher convinced him to attend college at UCLA instead. After two years of back to back college theatre, and garnering the school's Shakespeare award in 1980, Guest, upon discovering that they made films and TV shows in LA, made a plan to acquire an agent by his senior year, and moved out of the dorm and into a 2 bedroom apartment with 5 other roommates, including fellow students and future screenwriters Ed Solomon and Shane Black. He worked two part time jobs, attended UCLA, and began rehearsals for \" Transgressor\", an original play developed the previous year at school. Within weeks he had attended his first open call for the TV show \"Fame\", and though not initially cast, received a call from an agent the next day inviting him to come in for a meeting. Guest was then sent out on auditions so much over the next few months that he had to quit UCLA by the end of fall term to pursue acting full time. Within the next year, he had a recurring role on \"Lou Grant\", a pilot, 2 screen tests, an after school special, some episodic TV, and a role opposite Jamie Lee Curtis in the horror cult classic \"Halloween 2\". The Writer/producer of Halloween 2, John Carpenter, was going over the film before it's release and Carpenter's friend, Nick Castle, took note of the young actor, and remembered him for his current project in development, \"Centauri's Recruit\", later to be called. \"The Last Starfighter\". More television movies, recurring roles (St. Elsewhere) and small film roles followed, and Guest visited NYC for the first time. He came back to LA , inspired by the theater, and ready to move back east, when he was called in by Castle for what became \"The Last Starfighter\". Principal photography was completed in the spring of 1983, a couple months shy of his 23rd birthday. He was then cast as the protagonist in \"The Roommate\", an American Playhouse production, also starring Barry Miller and John Cameron Mitchell, based on a John Updike short story, which later won the grand prize at the LA Film Festival (1985). After wrapping \"The Roommate\", Guest escaped to New York and lived there for the first half of 1984 seeking theatre roles. He was working at the Santa Fe Festival theatre when The Last Starfighter opened in July of 1984. He was then cast in a TV drunk driving cautionary tale with Val Kilmer, Mare Winningham, and Michele Pfeiffer. Back in LA, he turned down a couple of subsequent offers in favor of a $3MIL indie about bluegrass musicians in the Blue Ridge mountains. When that project fell apart, he starred in another TV movie,\"My Father, My Rival\" for HBO, alongside Wendy Crewson. He was told that Starfighter reportedly made no money on it's initial release, so he returned to the theatre, this time in LA for the West coast premiere of Chris Durang's \"Baby With the Bathwater\" with Jennifer Tilly, which ran for 5 months at the Coronet Theatre. More regional theatre over the next year, \"Key Exchange\" with Anthony Edwards and Jennifer Beals, and \"Look Homeward Angel\" at Playmakers Rep in NC. Later that year he was offered the part of Michael Brody in 1987's \"Jaws: The Revenge.\" with Michael Caine. Wrapping \"Jaws\" in July, he was then cast in what he calls his favorite film, \"The Wizard of Loneliness\", a small WWII era piece about a 12 year old growing up in Vermont, with Lukas Haas, Lea Thompson, Dylan Baker and the late John Randolph. Over the next decade, it was mostly TV, co-starring with Robert Loggia as FBI agents in the political thriller miniseries \"Favorite Son\", a year as a bitter, ex-con photojournalist in \"Knot's Landing\", recurring on \"Life Goes On\" as an environmental metal-sculptor and street musician, McGoverns campaign manager on the '72 election episode of \" The Wonder Years\", a computer geek, a fireman, a high school teacher, another sculptor, an enviro-terrorist in \"The X-Files\", and back to the independent film \"Plan B\" with Jon Cryer, playing a regular-guy pilot who tries with his wife to conceive a child. Guest has continued to work in LA small theatre developing strictly original works, as well as touring for two and a half years('97-2000) with the satirical folk-group The Foremen, playing guitar and banjo. He also began planting vineyards in different locations in Northern California, and making wine. A handful of indie films: a wrongfully defrocked priest in \"The Least of These\", a gitmo-type interrogator in \"Shadowbox\", a hippie political adviser in \"Mach 2 \", a MASH type ER doctor in \"21 and a Wake-Up\" with Amy Acker, a recurring role as a no-nonsense Navy pilot on JAG, a couple of Disney Channel movies: one as wacky alien Cosmo Cola in \"Stepsister from Planet Weird\", and chimp-adopting primatologist Hugo Archibald in \"The Jenny Project\", episodic roles on\" Becker\", \"NYPD Blue\"('05),\"House\",('06) TV movie now called \"Alibi\", starring Famke Jahnsen ('07) and a cynical journalist on \"Jericho\".('07) After the birth of his, and partner Danna Hyams' son Jack in 2004, Guest started preliminary readings and workshops for a new musical created by Floyd Mutrux about an historic 1956 reunion at Sun Records in Memphis of Elvis Presley, Johnny Cash, Carl Perkins, and Jerry Lee Lewis. Based on the actual jam session these four attended, and hosted by legendary producer Sam Phillips, \"Million Dollar Quartet\" had two full tryout productions in Daytona Beach('06) and Issaquah, Wa. ('07) before moving to Chicago in 2008, where it still is running. The original production then moved to The Nederlander Theater on Broadway in March of 2010 and ran for 15 months (over 500 performances) before moving to the New World Stages Off-Broadway where it played for almost another year, closing in June of 2012. Guest created the role of Johnny Cash and has been in all productions since it's inception excluding London and now Las Vegas, choosing to stay in NY with his family rather than go out on the tour, which is set for it's third incarnation. The unique aspect of this play is that all the actors play their own instruments; they ARE the orchestra, and the show features blockbuster renditions of rockabilly and traditional hits, covered by the four main characters. It also tells the story of Sam Phillips' relationship to all the artists, and his particular contribution to pop culture and history in general. Guest received great reviews in particular as Cash, as well as a Distinguished Performance Award Nomination by the Drama League of New York. The show was also nominated for Best Musical in 2010. Guest completed filming indie thriller \"Late Phases\" in June 2013.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODEwMzczNF5BMl5BanBnXkFtZTgwMDY3NTIyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0346411","name":"Lance Guest","idIMDB":"nm0346411"},"actorId":"nm0346411","character":"Alex Rogan / Beta Alex","urlCharacter":"http://www.imdb.com/character/ch0018932","main":true},{"actorName":"Dan O'Herlihy","urlProfile":"http://www.imdb.com/name/nm0641397","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwNjYxOTEzMl5BMl5BanBnXkFtZTcwOTA3NTUwOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 May 1919","placeOfBirth":" Wexford, Ireland","height":"6' (1.83 m)","bio":"Irish-born Dan O'Herlihy decided not to follow in his father's footsteps, forsaking the life of an architect in favour of the acting profession. The tall, distinguished-looking university graduate boasted a rich, resonant voice, which enabled him to easily find work in radio plays, as well on the stage. He first came to note as a small part actor with the Gate and Abbey Theatre Players, on occasion putting his architectural qualifications to use as a set designer. His first leading role was in Sean O'Casey's play 'Red Roses for Me' in 1944. During one of his performances in Dublin, he was spotted by the director Carol Reed and cast as an IRA terrorist in Odd Man Out (1947). This, and another London-produced film, Hungry Hill (1947), resulted in good critical notices , prompting another genial filmmaker, Orson Welles, to cast O'Herlihy in the role of Macduff for his Mercury/Republic production of Macbeth (1948). While this enterprise was far from successful, O'Herlihy's rugged, bearded appearance for the Scottish play sufficiently impressed Luis Buñuel to cast him in the titular role of Robinson Crusoe (1954). Until the arrival of 'Friday' - the only other featured character - this definitive version of Daniel Defoe's shipwrecked 17th century mariner was a tour-de-force one man show, a compelling, wordless portrayal of agonising solitude. However, since the Mexican production was considered merely a B-movie in Hollywood, O'Herlihy was forced to invest some of his own money to have the film exhibited in Los Angeles. While he was rewarded with an Oscar nomination, few worthy job offers came his way. For the remainder of the decade, he worked under short-term contracts as a character actor (often billed as 'Daniel O'Herlihy') for Universal and 20th Century Fox, typically cast in costume dramas like The Black Shield of Falworth (1954), The Purple Mask (1955) and The Virgin Queen (1955). When movie roles became scarce, he branched out into anthology television, eventually becoming a much sought-after guest star on popular prime time shows like The Untouchables (1959), Bonanza (1959) and The Man from U.N.C.L.E. (1964). Work on radio shows, like 'Johnny Dollar', 'Suspense' and 'Lux Radio Theatre', also continued to provide him with a steady source of income. From the mid-1960's, he was afforded several better film opportunities: first, in a memorable dual role as the sinister, voyeuristic Dr. Caligari, and the handsome psychiatrist treating repressed mental patient Jane Lindstrom (Glynis Johns), in Robert Bloch's off-beat psycho-thriller, The Cabinet of Caligari (1962). Secondly, giving an absolutely mesmerizing performance, as an anguished Air Force general contemplating orders to drop a hydrogen bomb over New York, in Sidney Lumet's gripping anti-war drama Fail-Safe (1964). He was also, among later big screen appearances, one of many name actors in the star-studded military epic Waterloo (1970) (as Napoleon's Marshal Ney); unrecognisable in make-up as a reptilian alien in the 'Star Wars' clone The Last Starfighter (1984); as irredeemable villains in Halloween III: Season of the Witch (1982) and RoboCop (1987); and as the inscrutable Andrew Packard in Twin Peaks (1990) on TV. O'Herlihy continued to alternate film work with acting on stage in Los Angeles and at the Abbey Theater. He died in February 2005 at the age of 85, leaving his papers to the care of the University College Dublin, from where he had obtained his degree in architecture way back in 1945.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwNjYxOTEzMl5BMl5BanBnXkFtZTcwOTA3NTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641397","name":"Dan O'Herlihy","idIMDB":"nm0641397"},"actorId":"nm0641397","character":"Grig","urlCharacter":"http://www.imdb.com/character/ch0018933","main":true},{"actorName":"Catherine Mary Stewart","urlProfile":"http://www.imdb.com/name/nm0829252","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4NzE5NzM0NTJeQTJeQWpwZ15BbWU4MDM0MDQzMTgx._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 April 1959","placeOfBirth":" Edmonton, Alberta, Canada","birthName":"Catherine Mary Nursall","height":"5' 5¾\" (1.67 m)","bio":"Catherine Mary Stewart's career has spanned more than 30 years and over 50 different productions, from film to television to theater, in England, Canada and the United States. She was living in London studying dance, acting and singing when she was cast in her first professional acting role as the lead in the rock musical The Apple (1980), which was chosen to open the Montreal World Film Festival in 1980 and has since developed a cult following, being screened - twice, due to popular demand - at Lincoln Center in New York City. Catherine moved to Los Angeles in 1981 and soon landed a contract with Days of Our Lives (1965), originating the role of Kayla Brady. During Catherine's tenure with the soap opera, she was cast in the lead role of Maggie Gordon in The Last Starfighter (1984). She found steady employment in films, appearing in a variety of films including the cult classic Night of the Comet (1984), the teen comedy Mischief (1985) and the female lead in the comedy film Weekend at Bernie's (1989). Since that time, she has gone on to make 37+ films and numerous television appearances, and continues to delight her fans all over the world.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4NzE5NzM0NTJeQTJeQWpwZ15BbWU4MDM0MDQzMTgx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0829252","name":"Catherine Mary Stewart","idIMDB":"nm0829252"},"actorId":"nm0829252","character":"Maggie Gordon","urlCharacter":"http://www.imdb.com/character/ch0018930","main":true},{"actorName":"Barbara Bosson","urlProfile":"http://www.imdb.com/name/nm0098180","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIxNzIwODQ4Nl5BMl5BanBnXkFtZTcwMjYyODUxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 November 1939","placeOfBirth":" Charleroi, Pennsylvania, USA","height":"5' 7\" (1.7 m)","bio":"Barbara Bosson, who earned an Emmy Award nomination for her performance on Murder One (1995), was raised in Belle Vernon, Pennsylvania, a small coal-mining town about 30 miles south of Pittsburgh. When she was a teenager, she and her family moved to Florida, where she attended Boca Ciega High School in Gulfport. After graduation, she was accepted into the Drama Department of Carnegie Tech in Pittsburgh (now Carnegie Mellon). When Bosson learned the tuition would be too great a burden on her parents, she instead moved to New York. She supported herself in a variety of jobs -- secretary, television production assistant, Playboy Bunny, etc. -- while studying acting with Milton Katselas and Herbert Berghof, and musical comedy with Word Baker. Six years later, Bosson reevaluated her prospects while working as a secretary for ACT (the American Conservatory Theater). She spoke frequently with various drama department heads, including Earl Gister, head of Carnegie Tech's Drama Department. Deciding it wasn't too late to pursue her dream, she asked Gister for an audition. He agreed. Bosson can't remember her audition, but it convinced Gister to place her in the school and to assist her in finding scholarship money. So, at 26, she became Carnegie Tech's oldest freshman. While attending Carnegie Tech, Bosson met her future husband, Steven Bochco (whom she would not marry until years later), and fellow Hill Street Blues (1981) stars Bruce Weitz and Charles Haid. On a summer break from Carnegie Tech, she landed a job in San Francisco with the improvisational group, \"The Committee\". With Gister's blessing, she stayed with the group and performed with them for three years. Bosson is a five-time Emmy Award nominee for Best Supporting Actress in a Dramatic Series for her portrayal of \"Fay Furillo\" in the Emmy Award-winning series, Hill Street Blues (1981). An innovative cook, Bosson raises her own herbs and vegetables. She enjoys skiing, doing crossword puzzles and dancing. Bosson also hates dieting, which she has done unsuccessfully for 25 years. Bosson and Steven Bochco have two children and reside in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIxNzIwODQ4Nl5BMl5BanBnXkFtZTcwMjYyODUxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0098180","name":"Barbara Bosson","idIMDB":"nm0098180"},"actorId":"nm0098180","character":"Jane Rogan","urlCharacter":"http://www.imdb.com/character/ch0258875","main":true},{"actorName":"Norman Snow","urlProfile":"http://www.imdb.com/name/nm0811302","urlPhoto":"","biography":{"dateOfBirth":"29 March 1950","placeOfBirth":" Little Rock, Arkansas, USA","bio":"Norman Snow was born on March 29, 1950 in Little Rock, Arkansas, USA. He is an actor, known for General Hospital (1963), Guiding Light (1952) and Another World (1964).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0811302","name":"Norman Snow","idIMDB":"nm0811302"},"actorId":"nm0811302","character":"Xur","urlCharacter":"http://www.imdb.com/character/ch0218022","main":true},{"actorName":"Robert Preston","urlProfile":"http://www.imdb.com/name/nm0696481","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MDkxMzQ2Ml5BMl5BanBnXkFtZTcwNDc4OTAzOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1918","placeOfBirth":" Newton Highlands, Massachusetts, USA","birthName":"Robert Preston Meservey","height":"5' 10\" (1.78 m)","bio":"American leading man of vast charisma, Robert Preston was the son of a garment worker and a record store clerk and grew up in Los Angeles. He was a trained musician, playing several instruments, and in high school became interested in theatre. He joined the Pasadena Community Playhouse, taking classes and appearing in scores of plays alongside such soon-to-be-well-known actors as Dana Andrews, George Reeves, Victor Mature and Don DeFore. Even in the distinguished company of Playhouse veterans like Victor Jory and Samuel S. Hinds, young Preston Meservey--or Pres, as he was always known to intimates--was an acknowledged star in the making. During one play a Paramount scout saw him and he signed a contract with the studio, which renamed him Robert Preston. After several roles in inconsequential films, Preston became a favorite of director Cecil B. DeMille, who cast him in several films but became nevertheless one of the few people Preston actively and publicly disliked. In 1946, after serving in England with the Army Air Corps, Preston married Kay Feltus (aka Catherine Craig), whom he had known in Pasadena. He struggled through numerous unfulfilling roles in the '40s, then relocated to New York and concentrated on theatre. He played many roles on Broadway and in 1957 got the part that would immortalize him in entertainment history: Professor Harold Hill in the musical \"The Music Man\". He won a Tony Award for the role and repeated it in the film version (The Music Man (1962)). Now a star of the first magnitude, Preston alternated between stage and film, winning another Tony for \"I Do, I Do\" and appearing to enormous good effect in such films as The Dark at the Top of the Stairs (1960), All the Way Home (1963) and Junior Bonner (1972). He received an Oscar nomination for his triumphant portrayal of a witty, gay entertainer in Victor Victoria (1982). He died in 1987 from lung cancer, after a career that took him from modest supporting lead to national treasure.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI2MDkxMzQ2Ml5BMl5BanBnXkFtZTcwNDc4OTAzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0696481","name":"Robert Preston","nicknames":["Pres"],"idIMDB":"nm0696481"},"actorId":"nm0696481","character":"Centauri","urlCharacter":"http://www.imdb.com/character/ch0018931","main":true},{"actorName":"Chris Hebert","urlProfile":"http://www.imdb.com/name/nm0372859","urlPhoto":"","biography":{"dateOfBirth":"28 September 1973","placeOfBirth":" Fullerton, California, USA","birthName":"Christopher Robin Hebert","height":"5' 8\" (1.73 m)","bio":"Christopher Hebert was born on September 28, 1973 in Fullerton, California, where he has spent most of his life. His acting career began when he was allowed to audition for a local theater production of \"A Midsummer Night's Dream\" for one of the parts of the fairies. His mother apparently was reluctant but relented after Hebert's persistence. She had thought that he would not get picked for the part and that this experience would get the acting bug out of his system. However, Hebert got the part and through that summer production, he made connections to a professional agent who got him work in commercials and television before that summer even ended. Hebert continued to work pretty busily for the next five years. His most memorable project came with his feature film debut, The Last Starfighter (1984) as the precocious and likable younger brother, Louis Rogan. Other feature films include The Check Is in the Mail... (1986); a co-starring role for Hebert in a deficient satirical comedy, Invaders from Mars (1986), The Night Before (1988) and Mortuary Academy (1988). Hebert also did numerous episodic appearances, most notably Family Ties (1982), The Twilight Zone (1985) and Walt Disney's Wonderful World of Color: Fuzz Bucket (1986)- a Disney TV movie. Hebert's acting career dwindled down during his high school years, an experience fueled by personal problems at home, but one he does not regret now in hindsight. Hebert went on to study film at the University of Southern California's acclaimed School of Cinema-Television, graduating with his B.A. in 1997. During his studies there, he became more and more intrigued with film theory and aesthetics, rather than the technical side of movies. Hebert did star in a low-budget, independent film, Waiting for Mo (1996) made locally in the L.A. area but unfortunately was unable to find an audience after its completion. After graduating college, Hebert tried to rekindle his success as an actor but was unable to devote as much time and energy to it due to financial distress. This, to him, was a blessing in disguise. Hebert, fed by financial burdens, stumbled into substitute teaching and now has a passion for the classroom. He now is finishing his English teaching credential and already is teaching a high school film studies class that he has helped to create. He is also very involved in his church activities, coordinating a drama ministry and directing the youth group. He plans to get his masters degree in Christian Education. For now, Hebert loves teaching although he admits he still longs to produce, write, and direct films and videos if time and money allows. He is happily married and still resides in Fullerton.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0372859","name":"Chris Hebert","idIMDB":"nm0372859"},"actorId":"nm0372859","character":"Louis Rogan","urlCharacter":"http://www.imdb.com/character/ch0018934","main":true},{"actorName":"John O'Leary","urlProfile":"http://www.imdb.com/name/nm0641599","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NjgwNzk4Nl5BMl5BanBnXkFtZTcwOTcxOTI2MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1926","placeOfBirth":" Newton, Massachusetts, USA","bio":"John O'Leary was born on May 5, 1926 in Newton, Massachusetts, USA. He is an actor, known for Airplane! (1980), All the President's Men (1976) and The Last Starfighter (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NjgwNzk4Nl5BMl5BanBnXkFtZTcwOTcxOTI2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641599","name":"John O'Leary","idIMDB":"nm0641599"},"actorId":"nm0641599","character":"Rylan Bursar","urlCharacter":"http://www.imdb.com/character/ch0018935","main":true},{"actorName":"George McDaniel","urlProfile":"http://www.imdb.com/name/nm0567404","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTc0MDE5OTU4MF5BMl5BanBnXkFtZTgwNjYzMjc1ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"George McDaniel is an actor, known for General Hospital (1963), This Is Spinal Tap (1984) and The Last Starfighter (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTc0MDE5OTU4MF5BMl5BanBnXkFtZTgwNjYzMjc1ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0567404","name":"George McDaniel","idIMDB":"nm0567404"},"actorId":"nm0567404","character":"Kodan Officer","urlCharacter":"http://www.imdb.com/character/ch0258877","main":true},{"actorName":"Charlene Nelson","urlProfile":"http://www.imdb.com/name/nm0625223","urlPhoto":"","biography":{"bio":"Charlene Nelson is an actress, known for The Last Starfighter (1984), Tag: The Assassination Game (1982) and Amazing Stories (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0625223","name":"Charlene Nelson","idIMDB":"nm0625223"},"actorId":"nm0625223","character":"Rylan Technician","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Maio","urlProfile":"http://www.imdb.com/name/nm0537796","urlPhoto":"","biography":{"bio":"John Maio is known for his work on The Last Starfighter (1984), Tag: The Assassination Game (1982) and Nothing But Life (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0537796","name":"John Maio","idIMDB":"nm0537796"},"actorId":"nm0537796","character":"Friendly Alien","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Starr","urlProfile":"http://www.imdb.com/name/nm0823593","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzc2MDY4Nl5BMl5BanBnXkFtZTgwNjc1MDA4MjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Robert Starr is an actor, known for Airplane! (1980), The Last Starfighter (1984) and The Kentucky Fried Movie (1977).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzc2MDY4Nl5BMl5BanBnXkFtZTgwNjc1MDA4MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0823593","name":"Robert Starr","idIMDB":"nm0823593"},"actorId":"nm0823593","character":"Underling","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Al Berry","urlProfile":"http://www.imdb.com/name/nm0077469","urlPhoto":"","biography":{"bio":"Al Berry is an actor and producer, known for Re-Animator (1985), Halloween III: Season of the Witch (1982) and The Last Starfighter (1984).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0077469","name":"Al Berry","idIMDB":"nm0077469"},"actorId":"nm0077469","character":"Rylan Spy","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0087597","urlIMDB":"http://www.imdb.com/title/tt0087597","business":{"budget":{"money":"$15,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$6,011,695","country":"USA","day":"15","month":"07","year":"1984","remarks":"1,287 Screens"}],"gross":[],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 41 min (101 min)"],"soundMix":["70 mm 6-Track (70 mm prints)","Dolby (35 mm prints)"],"color":["Color (Technicolor)"],"aspectRatio":["2.20 : 1 (70 mm prints)","2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm (Eastman 5384)","70 mm (blow-up) (Eastman 5384)"]},"rating":"6.7","filmingLocations":[{"location":"Santa Clarita, California, USA"}],"rated":"PG","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1985","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Robert Preston","id":"nm0696481","role":null}]}]}]},{"award":"Avoriaz Fantastic Film Festival 1985","titlesAwards":[{"titleAwardOutcome":"Nominated Grand Prize","categories":[{"category":"","names":[{"name":"Nick Castle","id":"nm0145309","role":null}]}]}]},{"award":"Hugo Awards 1985","titlesAwards":[{"titleAwardOutcome":"Nominated Hugo","categories":[{"category":"Best Dramatic Presentation","names":[{"name":"Nick Castle","id":"nm0145309","role":"director"},{"name":"Jonathan R. Betuel","id":"nm0079471","role":"written by"}]}]}]},{"award":"Young Artist Awards 1985","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Young Supporting Actor in a Motion Picture Musical, Comedy, Adventure or Drama","names":[{"name":"Chris Hebert","id":"nm0372859","role":null}]}]}]}],"votes":"30,438","type":"Movie","companyCreditsSimple":[{"idCompany":"co0037360","name":"Lorimar Film Entertainment"},{"idCompany":"co0005073","name":"Universal Pictures"}],"keywords":{"keywords":["starfighter","alien","planet","trailer park","space battle","arcade game","handyman","spacecraft","humanoid alien","extraterrestrial alien","reference to christopher columbus","reference to playboy","grandmother granddaughter relationship","cult film","universal translator","kissing","space opera","escape pod","1980s","d box motion code","good versus evil","exploding car","baseball bat","undercover","trailer home","family relationships","reference to the wright brothers","young love","waitress","treason","shootout","shapeshifting","severed head","self sacrifice","self repair","rural setting","porn magazine","police officer","pickup truck","photograph","navigator","mother son relationship","meteor","hologram","flying car","father son estrangement","face slap","dual role","doppelganger","cavern","car accident","camping","california","brother brother relationship","asteroid","ambassador","alien contact","alien abduction","playboy viewed by child","outer space","cgi","frustrated dream","sabotage","part computer animation","fighter pilot","android","destiny","laser gun","space war","assassin","teenager","human needed to save alien planet","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:42:55"}}