{"data":{"movies":[{"title":"East Is West","originalTitle":"","year":"1930","releaseDate":"19301023","directors":[{"name":"Monta Bell","id":"nm0068419"}],"writers":[{"name":"John B. Hymer","id":"nm0405219"},{"name":"Tom Reed","id":"nm0715723"}],"runtime":"75 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMTczNDczNl5BMl5BanBnXkFtZTgwMzk4OTcwMjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama"],"plot":"Ming Toy is on the auction block in China. She is saved by Billy and taken to San Francisco by Lo Sang Kee. To save her from deportation she is sold to Charlie Yong, the Chop Suey King. Billy kidnaps her with plans of marriage.","simplePlot":"Ming Toy is on the auction block in China. She is saved by Billy and taken to San Francisco by Lo Sang Kee. To save her from deportation she is sold to Charlie Yong, the Chop Suey King. Billy kidnaps her with plans of marriage.","actors":[{"actorName":"Lupe Velez","urlProfile":"http://www.imdb.com/name/nm0892473","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTI4Mjg2OF5BMl5BanBnXkFtZTYwNjU3NzM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1908","placeOfBirth":" San Luis Potosi, Mexico","birthName":"María Guadalupe Vélez de Villalobos","height":"5' (1.52 m)","bio":"Lupe Velez was born on July 18, 1908, in San Luis de Potosi, Mexico, as Maria Guadalupe Villalobos Velez. She was sent to Texas at the age of 13 to live in a convent. She later admitted that she wasn't much of a student because she was so rambunctious. She had planned to become a champion roller-skater but that would change. Life was hard for her family, and Lupe returned to Mexico to help them out financially. She worked as a sales girl for a department store for the princely sum of $4 a week. Every week she would turn most of her salary over to her mother, but kept a little for herself so she could take dancing lessons. By now, she figured, with her mature shape and grand personality, she thought she could make a try at show business, and it was a lot more glamorous than dancing or being a sales clerk. In 1924 Lupe started that career on the Mexican stage and wowed audiences with her natural beauty and talent. By 1927 she had emigrated to Hollywood, where she was discovered by Hal Roach, who cast her in a comedy with Stan Laurel and Oliver Hardy. Douglas Fairbanks cast her in his feature film, The Gaucho (1927), with himself and wife Mary Pickford. Lupe played dramatic roles for five years before she switched to comedy. In 1933 she played the lead role of Pepper in Hot Pepper (1933). This film showcased her comedic talents and helped her to show the world her vital personality. She was delightful. In 1934 Lupe appeared in three fine comedies: Strictly Dynamite (1934), Palooka (1934) and Laughing Boy (1934). By now her popularity was such that a series of \"Mexican Spitfire\" films were written around her. She portrayed Carmelita Lindsay in Mexican Spitfire (1940), Mexican Spitfire Out West (1940), The Mexican Spitfire's Baby (1941) and Mexican Spitfire's Blessed Event (1943), among others. Audiences loved her in these madcap adventures but it seemed, at times, she was better known for her stormy love affairs. She married one of her lovers, Johnny Weissmuller, but that only lasted five years and was filled with battles. Lupe certainly did live up to her nickname. She had a failed romance with Gary Cooper, who never wanted to wed her. By 1943 her career was waning. She went to Mexico in the hopes of giving herself a jump start. She gained the best reviews yet in the Mexican version of Nana (1944). Bolstered by that movie, Lupe returned to the US where she starred in her final film as Pepita Zorita in Ladies' Day (1943). There were to be no others. On December 13, 1944, tired of yet another failed romance, with a part-time actor named Harald Maresch, and pregnant with his child, Lupe committed suicide with an overdose of Seconal. She was only 36 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTI4Mjg2OF5BMl5BanBnXkFtZTYwNjU3NzM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0892473","name":"Lupe Velez","nicknames":["Mexican Spitfire"],"idIMDB":"nm0892473"},"actorId":"nm0892473","character":"Ming Toy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lew Ayres","urlProfile":"http://www.imdb.com/name/nm0000817","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3ODM3MjQ2Ml5BMl5BanBnXkFtZTcwMjg0OTY5Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1908","placeOfBirth":" Minneapolis, Minnesota, USA","birthName":"Lewis Frederick Ayer III","height":"5' 9½\" (1.77 m)","bio":"Lew Ayres was born in Minneapolis, Minnesota and raised in San Diego, California. A college dropout, he was found by a talent scout in the Coconut Grove nightclub in Los Angeles and entered Hollywood as a bit player. He was leading man to Greta Garbo in The Kiss (1929), but it was the role of Paul Baumer in All Quiet on the Western Front (1930) that was his big break. He was profoundly affected by the anti-war message of that film, and when, in 1942, the popular star of Young Dr. Kildare (1938) and subsequent Dr. Kildare films was drafted, he was a conscientious objector. America was outraged, and theaters vowed never to show his films again, but quietly he achieved the Medical Corps status he had requested, serving as a medic under fire in the South Pacific and as a chaplain's aid in New Guinea and the Phillipines. His return to film after the war was undistinguished until Johnny Belinda (1948) - his role as the sympathetic physician treating the deaf-mute Jane Wyman won him an Academy Award nomination as Best Actor. Subsequent movie roles were scarce; an opportunity to play Dr. Kildare in television was aborted when the network refused to honor his request for no cigarette sponsorship. He continued to act, but in the 1970s put his long experience into a project to bring to the west the philosophy of the East - the resulting film, Altars of the World (1976), while not a box-office success, won critical acclaim and a Golden Globe Award. Lew Ayres died in Los Angeles, California on December 30, 1996, just two days after his 88th birthday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3ODM3MjQ2Ml5BMl5BanBnXkFtZTcwMjg0OTY5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000817","name":"Lew Ayres","idIMDB":"nm0000817"},"actorId":"nm0000817","character":"Billy Benson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edward G. Robinson","urlProfile":"http://www.imdb.com/name/nm0000064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzcwMzU5Nl5BMl5BanBnXkFtZTYwNTkwMjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1893","placeOfBirth":" Bucharest, Romania","birthName":"Emmanuel Goldenberg","height":"5' 7\" (1.7 m)","bio":"Edward G. Robinson arrived in the United States at age ten, and his family moved into New York's Lower East Side. He took up acting while attending City College, abandoning plans to become a rabbi or lawyer. The American Academy of Dramatic Arts awarded him a scholarship, and he began work in stock, with his new name, in 1913. Broadway was two years later; he worked steadily there for 15 years. His work included \"The Kibitzer\", a comedy he co-wrote with Jo Swerling. His film debut was a small supporting part in the silent The Bright Shawl (1923), but it was with the coming of sound that he hit his stride. His stellar performance as snarling, murderous thug Rico Bandello in Little Caesar (1931)--all the more impressive since in real life Robinson was a sophisticated, cultured man with a passion for fine art--set the standard for movie gangsters, both for himself in many later films and for the industry. He portrayed the title character in several biographical works, such as Dr. Ehrlich's Magic Bullet (1940) and A Dispatch from Reuter's (1940). Psychological dramas included Flesh and Fantasy (1943), Double Indemnity (1944), The Woman in the Window (1944)and Scarlet Street (1945). Another notable gangster role was in Key Largo (1948). He was \"absolved\" of allegations of Communist affiliation after testifying as a friendly witness for the House Un-American Activities Committee during the McCarthy hysteria of the early 1950s. In 1956 he had to sell off his extensive art collection in a divorce settlement and also had to deal with a psychologically troubled son. In 1956 he returned to Broadway in \"Middle of the Night\". In 1973 he was awarded a special, posthumous Oscar for lifetime achievement.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzcwMzU5Nl5BMl5BanBnXkFtZTYwNTkwMjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000064","name":"Edward G. Robinson","nicknames":["Eddie","Manny"],"idIMDB":"nm0000064"},"actorId":"nm0000064","character":"Charlie Yong","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"E. Alyn Warren","urlProfile":"http://www.imdb.com/name/nm0912810","urlPhoto":"","biography":{"dateOfBirth":"2 June 1874","placeOfBirth":" Richmond, Virginia, USA","birthName":"Edward Alyn Warren","bio":"E. Alyn Warren was born on June 2, 1874 in Richmond, Virginia, USA as Edward Alyn Warren. He was an actor, known for The Mysterious Mr. Wong (1934), Tarzan the Fearless (1933) and Revolt of the Zombies (1936). He died on January 22, 1940 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0912810","name":"E. Alyn Warren","idIMDB":"nm0912810"},"actorId":"nm0912810","character":"Lo Sang Kee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tetsu Komai","urlProfile":"http://www.imdb.com/name/nm0464514","urlPhoto":"","biography":{"dateOfBirth":"23 April 1894","placeOfBirth":" Kumamoto, Japan","height":"5' 11\" (1.8 m)","bio":"Tetsu Komai was born on April 23, 1894 in Kumamoto, Japan. He was an actor, known for The Letter (1940), Island of Lost Souls (1932) and Bulldog Drummond (1929). He died on August 10, 1970 in Gardena, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0464514","name":"Tetsu Komai","idIMDB":"nm0464514"},"actorId":"nm0464514","character":"Hop Toy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Henry Kolker","urlProfile":"http://www.imdb.com/name/nm0464137","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDRjMWYxYzItZDNmYS00MmVhLTljNzgtZGQwYzgwYTQ1ZjEzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1874","placeOfBirth":" Berlin, Germany","birthName":"Joseph Henry Kolker","height":"5' 10½\" (1.79 m)","bio":"Stalwart character actor Henry Kolker appeared on the Broadway stage from 1904, comedy being his forte early on. Later, as a leading man in romantic dramas, he partnered famous stars like Alla Nazimova. Moving on to films in 1914 as actor/director, he became noted in particular for directing Disraeli (1921), starring George Arliss (now a lost film, except for one reel). Plagued by ill-health and much publicised marital problems, Kolker's star had waned somewhat by the end of the silent era. However, he continued to remain in demand as a supporting actor, generally typecast as stern judges, priests, heavy fathers and cuckolded husbands. Usually scowling and sombre, he chided and glowered over stars like Melvyn Douglas, Gary Cooper and Katharine Hepburn (arguably his best role being the latter's father, Edward Seton, in Holiday (1938)). He was equally effective in the role of banker John Fair in The Crash (1932), and as Friar Laurence in George Cukor's Romeo and Juliet (1936). Kolker remained a prolific fixture on screen throughout the 1930's, managing to tally up in excess of twenty appearances each, for 1934 and 1935 alone.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDRjMWYxYzItZDNmYS00MmVhLTljNzgtZGQwYzgwYTQ1ZjEzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0464137","name":"Henry Kolker","idIMDB":"nm0464137"},"actorId":"nm0464137","character":"Mr. Benson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary Forbes","urlProfile":"http://www.imdb.com/name/nm0285376","urlPhoto":"","biography":{"dateOfBirth":"30 December 1879","placeOfBirth":" Hornsey, Middlesex [now in Haringey, London], England, UK","bio":"Mary Forbes was born on December 30, 1879 in Hornsey, Middlesex [now in Haringey, London], England. She was an actress, known for A Farewell to Arms (1932), You Can't Take It with You (1938) and Terror by Night (1946). She was married to Wesley Wall (house builder), E. J. Taylor and Charles Quatermaine. She died on July 22, 1974 in Beaumont, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0285376","name":"Mary Forbes","idIMDB":"nm0285376"},"actorId":"nm0285376","character":"Mrs. Benson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edgar Norton","urlProfile":"http://www.imdb.com/name/nm0636199","urlPhoto":"","biography":{"dateOfBirth":"11 August 1868","placeOfBirth":" London, England, UK","birthName":"Harry Mills","height":"5' 7\" (1.7 m)","bio":"Edgar Norton was born on August 11, 1868 in London, England as Harry Mills. He was an actor, known for Dr. Jekyll and Mr. Hyde (1931), Son of Frankenstein (1939) and The Love Parade (1929). He was married to Lillian Mabel Hubbard. He died on February 6, 1953 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0636199","name":"Edgar Norton","idIMDB":"nm0636199"},"actorId":"nm0636199","character":"Thomas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Middleton","urlProfile":"http://www.imdb.com/name/nm0585481","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwOTY2OTMzN15BMl5BanBnXkFtZTYwMTk3MjU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1874","placeOfBirth":" Elizabethtown, Kentucky, USA","height":"6' (1.83 m)","bio":"Charles Middleton was born on October 3, 1874 in Elizabethtown, Kentucky. He was the son of a millionaire and did not have to work, but apparently went into acting because he needed to find a way to express himself. He worked in a traveling circus, in vaudeville, and acted in live theatre before he turned to motion pictures in 1920. His career as a character actor came into full flower with the advent of sound films. His ominous baritone voice was perfect for villainous roles, and he became an excellent foil for comedy stars Harold Lloyd, Eddie Cantor, Wheeler and Woolsey, and Stan Laurel and Oliver Hardy. Middleton was then cast in Warner Brothers' Safe in Hell (1931), and in The Strange Love of Molly Louvain (1932) opposite Ann Dvorak and Richard Cromwell. His other notable performances during this period were both released the very next year from Paramount Pictures: first as the district attorney in This Day and Age (1933) directed by Cecil B. DeMille, and then as the prosecutor opposite The Marx Brothers in Duck Soup (1933). He also played Sheriff Ike Valton, the official who tries to arrest Julie La Verne (Helen Morgan) and her husband for being illegally married in Universal Pictures' version of the musical Show Boat (1936). Middleton's granite-hard features resemble those of Abraham Lincoln. He played Lincoln in a public-service short subject, The Road Is Open Again, appeared in a rare comic role as an actor exasperated at being typecast as Lincoln in the comedy film Stand-In (1937), and played Lincoln's father in the film version of Robert E. Sherwood's Abe Lincoln in Illinois (1940). Middleton was also featured in many adventure serials from 1935 to 1947. He is most famous for his villainous role as the evil Emperor Ming the Merciless in the three Flash Gordon serials: Rocket Ship (1936), Flash Gordon's Trip to Mars (1938), and Flash Gordon Conquers the Universe (1940). He was also featured in such serials as Dick Tracy Returns (1938), Daredevils of the Red Circle (1939), and Jack Armstrong (1947). Charles Middleton died at age 74 of a heart attack on April 22, 1949 in Los Angeles, California. He was interred in the Hollywood Forever Cemetary next to his wife of many years, stage and film actress Leora Spellman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwOTY2OTMzN15BMl5BanBnXkFtZTYwMTk3MjU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0585481","name":"Charles Middleton","nicknames":["Chuck"],"idIMDB":"nm0585481"},"actorId":"nm0585481","character":"Dr. Fredericks","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean Hersholt","urlProfile":"http://www.imdb.com/name/nm0380965","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MDE3NjAxMl5BMl5BanBnXkFtZTcwMjExMDExOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 July 1886","placeOfBirth":" Copenhagen, Denmark","birthName":"Jean Buron Hersholt","height":"5' 11\" (1.8 m)","bio":"If ever there was a Great Dane in Hollywood it was Jean Hersholt - and one of its great hearts as well. He was from a well-known Danish stage and entertainment family that had toured throughout Europe performing with young Jean as an essential cast member. He graduated from the Copenhagen Art School and continued expanding his stage experience and evidently decided early that he wanted to work in films. He did just two very early (1906) silent films in Germany. Hersholt emigrated from Denmark to the US while still a young man in 1913. Like many another European he came to America to seek further opportunities. Unlike many other European actors who appeared on Broadway in their early American careers, Hersholt never trod The Great White Way. He moved on to Hollywood in 1914 where the future of silent movies had taken the lead. He started as a movie extra then progressed into small feature player roles from 1915 through 1917. For that latter year he had no less than 17 bit parts. By the 1920s his roles were substantial feature pieces, but most of these were as villains - in fact, a concoction of really vile characters. His theater experience serving him well, he played them so well that he much sought after by directors. Several of his 1920s films were landmarks of the silent era, an early one being The Four Horsemen of the Apocalypse (1921) which helped propel Rudolf Valentino into the stellar heights. Hersholt became popular and well paid. And certainly his signature silent role was the lead character of Marcus Schouler in the Erich von Stroheim great film Greed (1924), based on the novel McTeague. Stroheim, who spent far more time in front of the camera as an actor, was already well know as a task master and perfectionist director. He went through 42 reels of film for the picture - a numbing nine hours of screen time (shown only once at that length in a private studio screening). He cut the film to five hours, but it was further whittled to a bit over two for release, causing Stroheim to quip bitterly of the editor, \"The only thing he had on his mind was his hat!\" The powerful film was still there, but the massive editing resulted in whole roles disappearing, not to mention some telltale continuity. Stroheim's need for realism resulted in the climax of the movie to be shot in Death Valley. Still hot in the fall time, Hersholt endured like a veteran but required a hospital stay after sweating away 27 pounds. Fortunately into the later 1920s Hersholt's roles expanded into a more realistic balance of characters-more virtuous roles - but still some shady fellows and especially the unsuspected, and thus surprising, guilty party in the ever popular murder mysteries. He worked for Samuel Goldwyn for about a year (1923-1924), for Paramount from 1927 through 1929, and several other studios during the period. By the end of the silent era, including those early primitive part mono features with small bits of audio music, sound effects, or dialog, Hersholt was a tried veteran of 75 films. His first all mono sound film was The Climax (1930) and despite a Germanic accent, he had a pleasant, mellow voice and a camera friendly presence that ensured him continued success. The variety ran the gamut from a sturdy supporting part in Grand Hotel (1932), to supporting Boris Karloff and a pretty hot Myrna Loy in The Mask of Fu Manchu (1932), and doing the same in Dinner at Eight (1933). Busy with nine movies in 1930, he also moved into people's living rooms on radio as well during that year. Of course, for some time Hersholt was a mature actor-simply meaning he had many secondary roles as doctors and professors and nobles of many sorts and increasingly he appeared as benign fatherly types. Father roles of the 20s continued into the 30s - augmented with grandfather roles as well. He was the father of Sonja Henie in that charismatic champion ice skater's first Hollywood film One in a Million (1936), and he is perhaps best remembered as the embittered but deeply caring grandfather of Shirley Temple in the beloved Heidi (1937). But it was another role as a doctor that would provide a continuing vehicle for Hersholt and something of a fateful direction for the actor. The mid-30s were abuzz with the births of the Dionne Quintuplets in Canada. Hollywood jumped on it with usual alacrity, highlighting the story and the officiating obstetrician, Dr. Dafoe, who was translated into Dr. John Luke, in The Country Doctor (1936). Hersholt brought the right ingredients to the part of Luke and two years later a sequel followed, Five of a Kind (1938). Hersholt thought the character good medicine all round and was enthusiastic about a series of movies, but Dafoe himself blocked this idea. Nevertheless, in 1937 Hersholt had already germinated a new radio series to continue portraying a dedicated and kindly small town doctor. For a character name Hersholt turned to his most beloved author, his countryman, literary light Hans Christian Andersen, for a name-Dr. Christian. It was a hit and, and he convinced RKO Radio Pictures to bankroll a series of six Dr. Christian films (1939-41). These latter and a few other films would mark the end of Hersholt's film career, but he was so very busy otherwise. His familiarity with Andersen was a scholarly avocation and labor of love, furthered by enthusiastic collecting of a library of important Andersen editions and related bibliography (which would later go to the Library of Congress). His English translation (see Trivia below) of the Andersen corpus of fairy tales (including his addition of several other Andersen stories from the author's private papers) remains perhaps the most comprehensive and best effort-even more so for Hersholt personal interpretation of Andersen. Hersholt would also write several articles about Andersen and edit The Andersen-Scudder-Letters (1948). Among other literary pursuits Hersholt also co-wrote a novel based on his Dr. Christian character. It was in Hersholt's generous nature to give back something in gratitude for the acting career afforded him in Hollywood. His payment was rich indeed: the Motion Picture Relief Fund, the retirement home and hospital inspired by it and generated from it (see Trivia below), and the great charitable work that Hersholt would perform were paid back with two Academy Awards, the second after his tenure as president of the Academy. These special honors would be the seed of the Jean Hersholt Humanitarian Award (see Trivia below). But in 1956 Hersholt was dying of cancer - and yet that would not stop him from one more good turn. His beloved Dr. Christian character was going to TV (produced by the Ziv Studios), and he was asked to symbolically pass the baton to the new Dr. Christian, Macdonald Carey. With a tremendous effort, Hersholt, now withered to 95 pounds braved the first episode shooting, capping his life with one last magnificent example of his humanity.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MDE3NjAxMl5BMl5BanBnXkFtZTcwMjExMDExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0380965","name":"Jean Hersholt","idIMDB":"nm0380965"},"actorId":"nm0380965","character":"Man","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0020850","urlIMDB":"http://www.imdb.com/title/tt0020850","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 15 min (75 min)"],"soundMix":["Mono (MovieTone)"],"color":["Black and White"],"aspectRatio":["1.20 : 1"],"camera":null,"laboratory":null,"filmLength":["2,037 m (8 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.6","filmingLocations":[{"location":"Universal Studios - 100 Universal City Plaza, Universal City, California, USA"}],"awards":[],"votes":"22","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"}],"keywords":{"keywords":["based on play"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:38:45"}}