{"data":{"movies":[{"title":"The Pleasure of His Company","originalTitle":"","year":"1961","releaseDate":"19610601","directors":[{"name":"George Seaton","id":"nm0780833"}],"writers":[{"name":"Cornelia Otis Skinner","id":"nm0804224"},{"name":"Samuel A. Taylor","id":"nm0853138"}],"runtime":"115 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNzMwNDg3N15BMl5BanBnXkFtZTYwMDQ0MTI2._V1.jpg","countries":["USA"],"languages":["English","French","Italian"],"genres":["Comedy"],"plot":"San Francisco debutante, Jessica Poole, is marrying Napa Valley cattle rancher, Roger Henderson, and hopes her peripatetic father, \"Pogo\" Poole, whom she hasn't seen for years, comes to the wedding. He arrives, disrupting the household of his ex-wife, Katharine, and her long-suffering husband, and befriending their cook, Toy. At first it seems that Pogo is set on breaking up the engagement, making up for years of neglect by wining and dining Jessica, showing up Roger as a hick, and enticing her to come to Europe with him. Then it seems his real goal is to win back Katharine's heart: why else would he have two tickets to Paris booked on a plane leaving right after the reception?","simplePlot":"San Francisco debutante, Jessica Poole, is marrying Napa Valley cattle rancher, Roger Henderson, and hopes her peripatetic father, \"Pogo\" Poole, whom she hasn't seen for years, comes to the... ","actors":[{"actorName":"Fred Astaire","urlProfile":"http://www.imdb.com/name/nm0000001","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU0NDYzMjA1MF5BMl5BanBnXkFtZTYwMTIzNjM2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 May 1899","placeOfBirth":" Omaha, Nebraska, USA","birthName":"Frederic Austerlitz Jr.","height":"5' 9\" (1.75 m)","bio":"Fred Astaire was born in Omaha, Nebraska, to Johanna (Geilus) and Fritz Austerlitz, a brewer. Fred entered show business at age 5. He was successful both in vaudeville and on Broadway in partnership with his sister, Adele Astaire. After Adele retired to marry in 1932, Astaire headed to Hollywood. Signed to RKO, he was loaned to MGM to appear in Dancing Lady (1933) before starting work on RKO's Flying Down to Rio (1933). In the latter film, he began his highly successful partnership with Ginger Rogers, with whom he danced in 9 RKO pictures. During these years, he was also active in recording and radio. On film, Astaire later appeared opposite a number of partners through various studios. After a temporary retirement in 1945-7, during which he opened Fred Astaire Dance Studios, Astaire returned to film to star in more musicals through 1957. He subsequently performed a number of straight dramatic roles in film and TV.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU0NDYzMjA1MF5BMl5BanBnXkFtZTYwMTIzNjM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000001","name":"Fred Astaire","idIMDB":"nm0000001"},"actorId":"nm0000001","character":"Biddeford 'Pogo' Poole","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Debbie Reynolds","urlProfile":"http://www.imdb.com/name/nm0001666","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTAzNzM0NF5BMl5BanBnXkFtZTcwMTY4OTY2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 April 1932","placeOfBirth":" El Paso, Texas, USA","birthName":"Mary Frances Reynolds","height":"5' 2\" (1.57 m)","bio":"Debbie Reynolds was born Mary Frances Reynolds in El Paso, Texas, the second child of Maxine N. (Harmon) and Raymond Francis Reynolds, a carpenter for the Southern Pacific Railroad. Her film career began at MGM after she won a beauty contest at age 16 impersonating Betty Hutton. Reynolds wasn't a dancer until she was selected to be Gene Kelly's partner in Singin' in the Rain (1952). Not yet twenty, she was a quick study. Twelve years later, it seemed like she had been around forever. Most of her early film work was in MGM musicals, as perky, wholesome young women. She continued to use her dancing skills with stage work. She was 31 when she gave an Academy Award-nominated performance in The Unsinkable Molly Brown (1964). She survived losing first husband Eddie Fisher to Elizabeth Taylor following the tragic death of Michael Todd. Her second husband, shoe magnate Harry Karl, gambled away his fortune as well as hers. With her children as well as Karl's, she had to keep working and turned to the stage. She had her own casino in Las Vegas with a home for her collection of Hollywood memorabilia until its closure in 1997. She took the time to personally write a long letter that is on display in the Judy Garland museum in Grand Rapids, Minnesota and to provide that museum with replicas of Garland's costumes. The originals are in her newly-opened museum in Hollywood. Nearly all the money she makes is spent toward her goal of creating a Hollywood museum. Her collection numbers more than 3000 costumes and 46,000 square-feet worth of props and equipment. With musician/actor Eddie Fisher, she was the mother of filmmaker Todd Fisher and actress Carrie Fisher. Debbie died of a stroke on December 28, 2016, one day after the death of her daughter Carrie. She was survived by her son and granddaughter, up-and-coming actress Billie Lourd.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTAzNzM0NF5BMl5BanBnXkFtZTcwMTY4OTY2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001666","name":"Debbie Reynolds","nicknames":["Princess Leia's Mom","Frannie","Aba Dabba"],"idIMDB":"nm0001666"},"actorId":"nm0001666","character":"Jessica Poole","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lilli Palmer","urlProfile":"http://www.imdb.com/name/nm0658339","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NDUxOTAwN15BMl5BanBnXkFtZTgwOTcxNDE2MDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1914","placeOfBirth":" Posen, Prussia, Germany [now Poznan, Wielkopolskie, Poland]","birthName":"Lilli Marie Peiser","bio":"A charming, elegant, and exceedingly popular international film star with a gentle, understated beauty, actress Lilli Palmer was born as Lilli Marie Peiser on May 24, 1914, in Posen, Prussia. She was the daughter of Rose Lissman, an Austrian Jewish actress, and Alfred Peiser, a German Jewish surgeon. In addition to her native German, she grew up becoming fluent in French and English as well. Of her two sisters, older sister Irene Prador became an actress and singer in her own right. Lillie studied drama in Berlin and made her theatrical debut there in 1932 at age 18. Within a short time, however, the family was forced to flee their native homeland with the rise of Hitler and settled in Paris. Eventually Lilli moved to England to rebuild the career she had started on stage and film. She made her British movie debut co-starring in the \"B\" mystery drama Crime Unlimited (1935), playing the distaff member of a syndicate of jewel thieves who becomes a romantic pawn for a policeman (Esmond Knight) who has infiltrated the crime ring as a plant. Throughout the rest of the decade she upped the value of her name in both \"A\" and \"B\" material, notably Alfred Hitchcock's Secret Agent (1936), Silent Barriers (1937) and The Man with 100 Faces (1938) where she provided the usual element of feminine mystery. Lillie's career took a major upswing during the early to mid 1940s. Several of her pictures centered around the omnipresent war, particularly Thunder Rock (1942), her film career-maker), which starred Michael Redgrave as an anti-fascist journalist who retreats to Canada, and Notorious Gentleman (1945), with Rex Harrison as a idle bounder who sees the error of his ways and becomes a war sacrifice. This was Lilli's first movie with husband Harrison; they married in 1943 and she bore him a son, Carey Harrison, the following year. Carey grew up to became a writer and director. The family moved to America in 1945 to further their careers. Rex and Lilli became a prominent acting couple, appearing together on the early 50s Broadway stage with \"Bell, Book and Candle\" (1950), \"Venus Observed\" (1952) and \"The Love of Four Colonels\" (1953), the last mentioned directed by Harrison. In movies, they co-starred in the murky crimer The Long Dark Hall (1951) and the vastly superior The Four Poster (1952), which later gave rise to the musical adaptation \"I Do! I Do!\". Lilli was award the Venice Film Festival Award for this performance and represented herself well with other handsome male acting partners, notably Gary Cooper in her debut American film Cloak and Dagger (1946) and John Garfield in the classic boxing film Body and Soul (1947), leaving audiences enthralled with one of its newer foreign imports. At one point, she was given her own own (short-lived) TV show to host, The Lilli Palmer Show (1953). Somewhat typecast by this time as heartless cads and opportunists on film, \"Sexy Rexy\", as husband Harrison was known in the tabloids, developed quite a reputation off-camera as well. A particularly disastrous romance with actress Carole Landis led to that actress's tragic suicide in 1948. Lilli took the high road and came off the better for it in the public's eye. She eventually called it quits, however, with both Harrison and Hollywood and returned to Europe in 1954. In 1956 Lilli filmed Between Time and Eternity (1956) [Between Time and Eternity] and fell in love with handsome Argentine co-star Carlos Thompson, who had developed matinée idol status in Germany. They married in September of 1957, several months after her divorce from Harrison became final. This marriage endured. Lilli matured gracefully in films, the epitome of poise and class, but she lost any potential for top stardom after leaving Hollywood. She made international productions for the rest of her career, primarily German and French, but they did not live up to her early successes and were not seen all that much outside of Europe. She managed to work, however, opposite a \"Who's Who\" of European male stars of the time, including Curd Jürgens, James Mason, Louis Jourdan, Jean Gabin, Jean Marais, Jean Sorel, Gérard Philipe and Klaus Kinski. Of those few movies she made in Hollywood, she played the prickly wife of Clark Gable, who has a May-December affair with young Carroll Baker in But Not for Me (1959); was a sparkling and witty standout in the ensemble cast of The Pleasure of His Company (1961); and proved quite moving in the William Holden spy thriller The Counterfeit Traitor (1962). On TV here, she was touchingly effective as Mrs. Frank in a production of The Diary of Anne Frank (1967) with Max von Sydow, and enjoyed one of her last roles in the acclaimed miniseries Peter the Great (1986). The final decade and a half played out rather routinely with supporting roles in such films as diverse as Oedipus the King (1968), De Sade (1969), and The Boys from Brazil (1978). She demonstrated her writing talents with her popular bestselling biography \"Change Lobsters and Dance\" in 1975, and later published a novel \"The Red Raven\" in 1978. Dying of cancer in 1986 at age 71 in Los Angeles, Lilli's surviving second husband Thompson, who had abandoned acting in the late 60s and turned to turned TV writing/producing, committed suicide four years later back in his native Argentina.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NDUxOTAwN15BMl5BanBnXkFtZTgwOTcxNDE2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0658339","name":"Lilli Palmer","idIMDB":"nm0658339"},"actorId":"nm0658339","character":"Katharine Dougherty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tab Hunter","urlProfile":"http://www.imdb.com/name/nm0002147","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMDExODI3NV5BMl5BanBnXkFtZTYwMjA5NzI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1931","placeOfBirth":" New York City, New York, USA","birthName":"Arthur Andrew Kelm","height":"6' (1.83 m)","bio":"Dreamy Tab Hunter stands out in film history as one of the hottest teen idols of the 1950s era. With blond, tanned, surfer-boy good looks, he was artificially groomed and nicknamed \"The Sigh Guy\" by the Hollywood studio system, yet managed to continue his career long after his \"golden boy\" prime. Hunter was born Arthur Kelm on July 11, 1931 in New York City, to Gertrude (Gelien) and Charles Kelm. His mother was a German (Catholic) immigrant, and his father was Jewish. Following his parents' divorce, Hunter grew up in California with his mother, older brother Walter, and maternal grandparents, Ida (Sonnenfleth) and John Henry Gelien. His mother changed her sons' surnames to her maiden name, Gelien. Leaving school and joining the Coast Guard at age 15 (he lied about his age), he was eventually discharged when the age deception was revealed. Returning home, his life-long passion for horseback riding led to a job with a riding academy. Hunter's fetching handsomeness and trim, athletic physique eventually steered the Californian toward the idea of acting. An introduction to famed agent Henry Willson had Tab signing on the dotted line and what emerged, along with a major career, was the stage moniker of \"Tab Hunter.\" Willson was also responsible with pointing hopeful Roy Fitzgerald towards stardom under the pseudonym Rock Hudson. With no previous experience Tab made his first, albeit minor, film debut in the racially trenchant drama The Lawless (1950) starring Gail Russell and Macdonald Carey. His only line in the movie was eventually cut upon release. It didn't seem to make a difference for he co-starred in his very next film, the British-made Island of Desire (1952) co-starring a somewhat older (by ten years) Linda Darnell, which was set during WWII on a deserted, tropical South Seas isle. His shirt remained off for a good portion of the film, which certainly did not go unnoticed by his ever-growing legion of female (and male) fans. Signed by Warner Bros., stardom was clinched a few years later with another WWII epic Battle Cry (1955), based on the Leon Uris novel, in which he again played a boyish soldier sharing torrid scenes with an older woman (this time Dorothy Malone, playing a love-starved Navy wife). Thoroughly primed as one of Hollywood's top beefcake commodities, the tabloid magazines had a field day initiating an aggressive campaign to \"out\" Hunter as gay, which would have ruined him. To combat the destructive tactics, Tab was seen escorting a number of Hollywood's lovelies at premieres and parties. In the meantime he was seldom out of his military fatigues on film, keeping his fans satisfied in such popular dramas as The Sea Chase (1955), The Burning Hills (1956) and The Girl He Left Behind (1956)--the last two opposite the equally popular Natalie Wood. At around this time, Hunter managed to parlay his boy-next-door film celebrity into a singing career. He topped the charts for over a month with the single \"Young Love\" in 1957 and produced other \"top 40\" singles as well. Like other fortunate celebrity-based singers such as Shelley Fabares and Paul Petersen, his musical reign was brief. Out of it, however, came the most notable success of his film career top-billing as baseball fan Joe Hardy in the classic Faustian musical Damn Yankees! (1958) opposite Gwen Verdon and Ray Walston, who recreated their devil-making Broadway roles. Musically Tab may have been overshadowed but he brought with him major star power and the film became a crowd pleaser. He continued on with the William A. Wellman-directed Lafayette Escadrille (1958) as, yet again, a wholesome soldier, this time in World War I. More spicy love scenes came with That Kind of Woman (1959), an adult comedy-drama which focused on soldier Hunter and va-va-voom mistress Sophia Loren demonstrating some sexual chemistry on a train. Seldom a favorite with the film critics, the 1960s brought about a career change for Tab. He begged out of his restrictive contract with Warners and ultimately paid the price. With no studio to protect him, he was at the mercy of several trumped-up lawsuits. Worse yet, handsome Troy Donahue had replaced him as the new beefcake on the block. With no film offers coming his way, he starred in his own series The Tab Hunter Show (1960), a rather featherweight sitcom that centered around his swinging bachelor pad. The series last only one season. On the positive side he clocked in with over 200 TV programs over the long stretch and was nominated for an Emmy award for his outstanding performance opposite Geraldine Page in a Playhouse 90 episode. Following the sparkling film comedy The Pleasure of His Company (1961) opposite Debbie Reynolds, the quality of his films fell off drastically as he found himself top-lining such innocuous fare as Operation Bikini (1963), Ride the Wild Surf (1964) (1965), City in the Sea (1965) [aka War-Gods of the Deep], and Birds Do It (1966) both here and overseas. As for stage, a brief chance to star on Broadway happened in 1964 alongside the highly volatile Tallulah Bankhead in Tennessee Williams's \"The Milk Train Doesn't Stop Here Anymore.\" It lasted five performances. He then started to travel the dinner theater circuit. Enduring a severe lull, Tab bounced back in the 1980s and 1990s -- more mature, less wholesome, but ever the looker. He gamely spoofed his old clean-cut image by appearing in delightfully tasteless John Waters' films as a romantic dangling carrot to heavyset transvestite \"actress\" Divine. Polyester (1981) was the first mainstream hit for Waters and Tab went on to team up with Allan Glaser to co-produce and co-star a Waters-like western spoof Lust in the Dust (1985). He is still working as a film producer at age 70+ in Southern California. Tab also \"came out\" with a tell-all memoir on his Hollywood years in October of 2005.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMDExODI3NV5BMl5BanBnXkFtZTYwMjA5NzI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002147","name":"Tab Hunter","nicknames":["the Sigh Guy"],"idIMDB":"nm0002147"},"actorId":"nm0002147","character":"Roger Henderson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Merrill","urlProfile":"http://www.imdb.com/name/nm0581282","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMDI5NzgzNF5BMl5BanBnXkFtZTYwMTI3MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 August 1915","placeOfBirth":" Hartford, Connecticut, USA","birthName":"Gary Franklin Merrill","height":"5' 8\" (1.73 m)","bio":"Gary Merrill was born August 2, 1915, in Hartford, Connecticut. He began his career acting in summer stock plays. He married Barbara Leeds, an actress, and then served a brief stint in the army. After the army, he landed in New York, where he was chosen to join the already popular play \"Born Yesterday\". In 1950 he was cast in the part of Bill Sampson in All About Eve (1950). It would be his first time meeting Bette Davis and they became an instant couple. After their respective divorces, they were married in Mexico. She was 42 and he was 35. During their marriage they adopted two children, Margot and Michael, and after ten years of fighting and financial problems they divorced. Merrill did not marry again, though he was involved with Rita Hayworth for a time. Later in his career Merrill made a lucrative living doing voice-overs for radio and television commercials. In 1988 he published his autobiography, \"Bette, Rita, And The Rest Of My Life\". He died of lung cancer at the age of 74.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMDI5NzgzNF5BMl5BanBnXkFtZTYwMTI3MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0581282","name":"Gary Merrill","idIMDB":"nm0581282"},"actorId":"nm0581282","character":"James Dougherty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Ruggles","urlProfile":"http://www.imdb.com/name/nm0749476","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTA5NTAzNV5BMl5BanBnXkFtZTcwNzQ2NzQyOA@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1886","placeOfBirth":" Los Angeles, California, USA","birthName":"Charles Sherman Ruggles","height":"5' 8\" (1.73 m)","bio":"Charles Ruggles had one of the longest careers in Hollywood, lasting more than 50 years and encompassing more than 100 films. He made his film debut in 1914 in The Patchwork Girl of Oz (1914) and worked steadily after that. He was memorably paired with Mary Boland in a series of comedies in the early 1930s, and was one of the standouts in the all-star comedy If I Had a Million (1932), as a harried, much-put-upon man who finally goes berserk in a china shop. Ruggles' slight stature and distinctive mannerisms - his fluttery, jumpy manner of speaking, his often befuddled look whenever events seemed about to overwhelm him, which was often - endeared him to generations of moviegoers. Memorable as Maj. Applegate the big-game hunter in the classic screwball comedy Bringing Up Baby (1938). Many will remember him as the narrator of the \"Aesop's Fables\" segment of the animated cartoon The Bullwinkle Show (1960). He was the brother of director Wesley Ruggles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTA5NTAzNV5BMl5BanBnXkFtZTcwNzQ2NzQyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0749476","name":"Charles Ruggles","nicknames":["Charlie"],"idIMDB":"nm0749476"},"actorId":"nm0749476","character":"Mackenzie Savage","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harold Fong","urlProfile":"http://www.imdb.com/name/nm0284564","urlPhoto":"","biography":{"dateOfBirth":"8 February 1911","placeOfBirth":" Sacramento, California, USA","birthName":"Gee Fong","bio":"Harold Fong was born on February 8, 1911 in Sacramento, California, USA as Gee Fong. He was an actor, known for Up in Smoke (1978), The Steel Helmet (1951) and The Pleasure of His Company (1961). He died on June 1, 1982 in Los Angeles, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0284564","name":"Harold Fong","idIMDB":"nm0284564"},"actorId":"nm0284564","character":"Toy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elvia Allman","urlProfile":"http://www.imdb.com/name/nm0021519","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MDM1MTAzNF5BMl5BanBnXkFtZTcwMzk2NjcxMw@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 September 1904","placeOfBirth":" Enochville, North Carolina, USA","birthName":"Elvia Beatrice Allman","bio":"Elvia Allman was born on September 19, 1904 in Enochville, North Carolina, USA as Elvia Beatrice Allman. She was an actress, known for Breakfast at Tiffany's (1961), The Nutty Professor (1963) and The Prince and the Pauper (1990). She was married to Jerome Laveck Bayler, Charles (\"C.C.\") Pyle and Wesley Benton Tourtellotte. She died on March 6, 1992 in Santa Monica, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MDM1MTAzNF5BMl5BanBnXkFtZTcwMzk2NjcxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0021519","name":"Elvia Allman","idIMDB":"nm0021519"},"actorId":"nm0021519","character":"Mrs. Mooney","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lynne Martin","urlProfile":"http://www.imdb.com/name/nm8016796","urlPhoto":"","biography":{"bio":"Lynne Martin is an actor, known for The Pleasure of His Company (1961).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm8016796","name":"Lynne Martin","idIMDB":"nm8016796"},"actorId":"nm8016796","character":"Young Woman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0055307","urlIMDB":"http://www.imdb.com/title/tt0055307","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 55 min (115 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Color (Technicolor)"],"aspectRatio":["1.66 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.9","filmingLocations":[{"location":"2700 Vallejo Street, Pacific Heights, San Francisco, California, USA"}],"awards":[{"award":"Golden Globes, USA 1962","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Actor - Comedy or Musical","names":[{"name":"Fred Astaire","id":"nm0000001","role":null}]}]}]},{"award":"Berlin International Film Festival 1961","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Berlin Bear","categories":[{"category":"","names":[{"name":"George Seaton","id":"nm0780833","role":null}]}]}]}],"votes":"574","type":"Movie","companyCreditsSimple":[{"idCompany":"co0513195","name":"Perlberg-Seaton Productions"}],"keywords":{"keywords":["rancher","san francisco california","football player","cowboy boots","father daughter relationship","based on play"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:07:28"}}