{"data":{"movies":[{"title":"Blue Streak O'Neil","originalTitle":"","year":"1926","releaseDate":"19261215","directors":[{"name":"Paul Hurst","id":"nm0403636"}],"writers":[],"urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmFjNmRiMWUtZTA0ZC00MDQ3LWJjZDUtODM5ZTQ4NTExZmQ3XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Western"],"simplePlot":"","actors":[{"actorName":"Al Hoxie","urlProfile":"http://www.imdb.com/name/nm0398299","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGNlZWE5NTQtMGFjYS00MmMwLWE5NGQtMjNhNzkyOTBiMTg3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 October 1901","placeOfBirth":" Nez Perce, Idaho, USA","birthName":"Alton J. Stone","bio":"American leading man of silent Westerns whose career was much overshadowed by that of his more famous brother Jack Hoxie. He grew up in the backwoods and mountains of Idaho. His older brother had become a champion rodeo rider, a talent he parlayed into early success in cowboy movies. Following in his brother's footsteps, Al Hoxie moved to Los Angeles, not yet twenty years old. His brother Jack soon got him work as a stuntman and wrangler, and Al doubled for his brother and other actors in numerous films of the early 1920s. He began to get bit parts, and then bigger roles, in his brother's films and then on his own. A Poverty Row studio called Anchor Films saw potential in the strapping cowboy with the famous (last) name. They signed him to play the lead in a series of Westerns, which then led to a new series contract with producer Bud Barsky. None of these pictures ventured far beyond mediocre, and with the coming of sound in the late 1920s, Hoxie, with no great following, quit the business. He returned to his Northwest roots for several years, then returned to Los Angeles, this time to work as a conductor on the Red Line streetcars. For a few years he was a forest ranger, then went into law enforcement, first for the Anaheim, California, police department, and then for the Patton State Hospital. While there, Hoxie regained some public attention by disarming a deranged man with hostages. He was presented California's highest award for bravery, the California Medal of Honor. He retired thereafter and spent his remaining years in Redlands, California, where he died in 1982, seventeen years after the death of his more famous older brother.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGNlZWE5NTQtMGFjYS00MmMwLWE5NGQtMjNhNzkyOTBiMTg3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0398299","name":"Al Hoxie","idIMDB":"nm0398299"},"actorId":"nm0398299","character":"Blue Streak","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ione Reed","urlProfile":"http://www.imdb.com/name/nm0715458","urlPhoto":"","biography":{"dateOfBirth":"11 February 1903","placeOfBirth":" Cade, Texas, USA","birthName":"Ione Novelle Reed","bio":"Ione Reed was born on February 11, 1903 in Cade, Texas, USA as Ione Novelle Reed. She is known for her work on Across the Plains (1928), Battling Kid (1926) and Western Honor (1930). She died in August 1981 in Garland, Texas.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0715458","name":"Ione Reed","idIMDB":"nm0715458"},"actorId":"nm0715458","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alfred Hewston","urlProfile":"http://www.imdb.com/name/nm0382141","urlPhoto":"","biography":{"dateOfBirth":"12 September 1882","placeOfBirth":" San Francisco, California, USA","height":"5' 7\" (1.7 m)","bio":"Alfred Hewston was born on September 12, 1882 in San Francisco, California, USA. He was an actor, known for Blind Circumstances (1922), The Arizona Streak (1926) and Flying Wheels (1926). He was married to Ollie Haywood. He died on September 6, 1947 in Los Angeles, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0382141","name":"Alfred Hewston","idIMDB":"nm0382141"},"actorId":"nm0382141","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cliff Lyons","urlProfile":"http://www.imdb.com/name/nm0529036","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzJjNTM1ZTQtYTc3Zi00M2MxLTg2YTQtYjRiOTI5NDg0ZDFiXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 July 1901","placeOfBirth":" near Clarno Township, Lake County, South Dakota, USA","birthName":"Clifford William Lyons","bio":"Cliff Lyons was an American actor, stuntman and second-unit director, primarily of Westerns, particularly the films of John Ford and John Wayne. Lyons, the son of Garrett Thomas Lyons and Wilhamena Johnson Lyons, was raised on a South Dakota farm, though his family lived for a time in Memphis, TN, where he attended business school. An expert horseman, he gave up the notion of a business career and opted for the rodeo arena instead, touring the country and eventually reaching Los Angeles at the age of 21. With accomplished cowboys in great demand, Lyons quickly became involved in movies, working both as a stuntman and actor. After only a couple of bit parts, he was signed by low-budget producer Bud Barsky to do seven inexpensive Westerns directed by Paul Hurst, with Lyons and Al Hoxie alternating as the hero and the heavy. Lyons and Hoxie alternated in another Western series produced by Morris R. Schlank, and, as Cliff \"Tex\" Lyons, he seemed headed for minor stardom as a B-Western lead. Unfortunately, Lyons' voice was not well-suited for sound and the talkie revolution confined him to small roles. As his small shot at stardom faded, however, his career as a stunt double for stars big and small was on the rise. He doubled such cowboy stars as Tom Mix, Ken Maynard, Buck Jones and Johnny Mack Brown. In 1936 he worked with John Wayne for the first and struck up a personal and business relationship that would remain strong for three decades. Wayne was influential in getting Lyons his first work as a second-unit director and in introducing Lyons to John Ford, for whom Lyons would do some of his finest work. Lyons' reputation as a stunt coordinator is comparable to that of acknowledged master Yakima Canutt, with whom Lyons partnered on numerous occasions. Perhaps Lyons' most impressive work was the massive and dynamic battle sequences of Wayne's The Alamo (1960). He was married from 1938-55 to actress Beth Marion, with whom he had two sons. Cliff Lyons died in 1974 at 72, not long after coordinating stunts for Wayne's The Train Robbers (1973).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzJjNTM1ZTQtYTc3Zi00M2MxLTg2YTQtYjRiOTI5NDg0ZDFiXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0529036","name":"Cliff Lyons","nicknames":["Tex"],"idIMDB":"nm0529036"},"actorId":"nm0529036","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Hurst","urlProfile":"http://www.imdb.com/name/nm0403636","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWYzMGIwMGItYWNiMS00ZDdhLWIwZmQtOWM1MzAyNjU5NzdhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1888","placeOfBirth":" Traver, Tulare County, California, USA","birthName":"Paul Causey Hurst","bio":"American character actor of prodigious output who also directed and wrote silent films, Paul Hurst spent much of his early work in low-budget western. A native of Traver, California (in the San Joaquin Valley), Hurst had a first-hand knowledge of Western lore, growing up surrounded by the multi-million-acre Lux & Miller ranches that ran cattle throughout the state. Visiting San Francisco as a young man, he became involved in amateur theatricals and thereafter traveled to Los Angeles to join the emerging film industry there. He began appearing in films as early as 1912, most of them Westerns. By 1916 Hurst was directing them as well (some sources report that he served in World War I as a member of the French Foreign Legion, but the dates of his film projects make this story highly suspect). In the early 1920s Hurst wrote several scenarios for films he directed and in which he appeared. He proved adept at working as a director for some of the cheapest producers along Gower Gulch, where movies were normally shot on location in a week or less and where stuntmen were often the highest-paid folks on the set. Within a few years he focused all of his energies into acting, however, notably becoming one of the few successes to emerge from \"Poverty Row\". Hurst quickly became one of the more prolific and familiar characters in American movies. With his stocky build and squinty demeanor, and with a raspy voice that enhanced his memorability once sound pictures came in, Hurst played villains, cops and comedy sidekicks in more than 250 films. His most famous role was that of the deserter shot dead on the stairway of Tara by Vivien Leigh in Gone with the Wind (1939). Hurst was the sidekick to Monte Hale in a number of B-Westerns. Former Gower Gulch veteran John Wayne hired Hurst for Big Jim McLain (1952), knowing that Hurst was ill with terminal cancer. In 1953, at age 64, due to his health problems, Paul Hurst committed suicide.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWYzMGIwMGItYWNiMS00ZDdhLWIwZmQtOWM1MzAyNjU5NzdhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0403636","name":"Paul Hurst","idIMDB":"nm0403636"},"actorId":"nm0403636","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0016665","urlIMDB":"http://www.imdb.com/title/tt0016665","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":null,"soundMix":["Silent"],"color":["Black and White"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":["1,371.6 m (5 reels) (USA)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"filmingLocations":[{"location":"Sequoia National Park, California, USA"}],"awards":[],"type":"Movie","companyCreditsSimple":[{"idCompany":"co0127416","name":"Bud Barsky Corporation"}]}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 06:03:51"}}