{"data":{"movies":[{"title":"Spite Marriage","originalTitle":"","year":"1929","releaseDate":"19290406","directors":[{"name":"Edward Sedgwick","id":"nm0781292"},{"name":"Buster Keaton","id":"nm0000036"}],"writers":[{"name":"Lew Lipton","id":"nm0513858"},{"name":"Ernest Pagano","id":"nm0656039"}],"runtime":"76 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI5MDUwOTUwMl5BMl5BanBnXkFtZTgwMDA2ODU2MzE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"Elmer is a dry cleaner. He is madly in love with stage star Trilby Drew; for each of her 35 performances, he dons someone else's tuxedo and races to the theatre. When Trilby's co-star boyfriend gets engaged to a socialite, she marries Elmer to get even, assuming Elmer is a millionaire (since his clothes are so snazzy.) But she's clearly still in love with her scoundrelous co-star, and her manager makes her leave Elmer, trying to pay him off so the papers don't hear about her marriage to a \"cheap pants presser.\" Can Elmer win her love? Maybe a sea voyage will help.","simplePlot":"An unimpressive but well intending man is given the chance to marry a popular actress, of whom he has been a hopeless fan. But what he doesn't realize is that he is being used to make the actress' old flame jealous.","actors":[{"actorName":"Buster Keaton","urlProfile":"http://www.imdb.com/name/nm0000036","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MjA4ODk5OF5BMl5BanBnXkFtZTYwNDQyNjI2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1895","placeOfBirth":" Piqua, Kansas, USA","birthName":"Joseph Frank Keaton","height":"5' 5\" (1.65 m)","bio":"When at six months of age he tumbled down a flight of stairs unharmed, he was given the name \"Buster\" by Harry Houdini who, along with W.C. Fields, Bill Robinson (\"Bojangles\"), Eddie Cantor and Al Jolson shared headlines with \"The Three Keatons\": Buster, his father Joe Keaton and mother Myra Keaton. Their act, one of the most dangerous in vaudeville, was about how to discipline a prankster child. Buster was thrown all over the stage and even into the audience. No matter what the stunt, he was poker-faced. By the time Buster turned 21, however, his father was such a severe alcoholic that the stunts became too dangerous to perform and the act dissolved. He first saw a movie studio in March 1917 and, on April 23, his debut film, Roscoe 'Fatty' Arbuckle's The Butcher Boy (1917), was released. He stayed with Fatty through 15 two-reelers, even though he was offered much more to sign with Fox or Warner Bros. after returning from ten months with the U.S. Army (40th Infantry Division) in France. His first full-length feature, The Saphead (1920), established him as a star in his own right. By the middle of 1921 he had his own production company--Buster Keaton Productions--and was writing, directing and starring in his own films. With a small and close team around him, Keaton created some of the most beautiful and imaginative films of the silent era. The General (1926), his favorite, was one of the last films over which he had artistic control. In 1928 he reluctantly signed with MGM after his contract with independent producer Joseph M. Schenck expired. MGM quickly began to enforce its rigid, mechanized style of filmmaking on Keaton, swamping him with gag writers and scripts. He fought against it for a time, and the compromise was initially fruitful, his first film for MGM--The Cameraman (1928)--being one of his finest. However,with his creativity becoming increasingly stifled he began to drink excessively, despondent at having to perform material that was beneath him. Ironically, his films around 1930 were his most successful to date in terms of box-office receipts, which confirmed to MGM that its formula was right. His drinking led to a disregard for schedules and erratic behavior on the MGM lot, and a disastrous confrontation with Louis B. Mayer resulted in him being fired. The diplomatic producer Irving Thalberg attempted to smooth things over but Keaton was past caring. By 1932 he was a divorced alcoholic, getting work where he could, mostly in short comedies. In 1935 he entered a mental hospital. MGM rehired him in 1937 as a $100-a-week gag writer (his salary ten years before was more than ten times this amount). The occasional film was a boost to this steady income. In 1947 his career rebounded with a live appearance at Cirque Medrano in Paris. In 1952 James Mason, who then owned Keaton's Hollywood mansion, found a secret store of presumably lost nitrate stock of many of Buster's early films; film historian and archivist Raymond Rohauer began a serious collection/preservation of Buster's work. In 1957 Buster appeared with Charles Chaplin in Limelight (1952) and his film biography, The Buster Keaton Story (1957), was released. Two years later he received a special Oscar for his life work in comedy, and he began to receive the accolades he so richly deserved, with festivals around the world honoring his work. He died in 1966, age 70.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MjA4ODk5OF5BMl5BanBnXkFtZTYwNDQyNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000036","name":"Buster Keaton","nicknames":["The Great Stone Face","Malec"],"idIMDB":"nm0000036"},"actorId":"nm0000036","character":"Elmer Gantry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dorothy Sebastian","urlProfile":"http://www.imdb.com/name/nm0780941","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyOTc2ODgxN15BMl5BanBnXkFtZTYwNzYzNDM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1903","placeOfBirth":" Birmingham, Alabama, USA","birthName":"Dorothy Sabiston","height":"5' 3\" (1.6 m)","bio":"The daughter of a clergyman and a mother, who was an accomplished painter of portraits and landscapes, Stella Dorothy Sabiston spent her formative years in her home state of Alabama. She had three siblings, all of whom died relatively young. She attended the University of Alabama, but always harbored ambitions of becoming an actress. In the early 1920s, the curly-haired brunette abandoned her studies and ran away to New York (as Dorothy Sebastian), where she took up acrobatic dancing at the prestigious Ned Wayburn academy. By the time she took elocution lessons to get rid of her noticeable southern drawl, Dorothy had her first failed marriage (1920-24) behind her. Living in a cheap apartment, and after several rejections, she landed her first job in show business as a chorus girl in \"George White's Scandals\" in June 1924. The show opened at the Apollo Theatre and ran for 198 performances, closing in December. Sometime prior to that, according to recollections of fellow cast member and friend Louise Brooks, Dorothy struck up a somewhat personal connection with then-British cabinet minister Lord Beaverbrook. Their meeting took place during a party at the Ritz Hotel in an apartment owned by producer Otto Kahn, at which several Scandals girls and Hollywood producers were present. The end result was an MGM contract for Dorothy. She showed promise in her first film, Sackcloth and Scarlet (1925), starring Alice Terry. Much to her chagrin, as her career went on she was often cast as vamps or, at least, disreputable or hard-boiled \"other women\" in films like Hell's Island (1930). On occasion she played nice girls, for instance in A Woman of Affairs (1928), with Greta Garbo. Then there were 'friends of the heroine' roles, which included her major successes, Our Dancing Daughters (1928) with Joan Crawford, and Spite Marriage (1929) with Buster Keaton(to whom she was romantically linked at the time). At the end of her five-year contract with MGM she asked for a raise (her weekly salary amounted to $1,000 per week), but was refused. Out of a contract, her film career faltered after several \"Poverty Row\" productions at Tiffany and, finally, a leading role in the (for her) ironically titled They Never Come Back (1932). Thereafter, like so many other actors who bucked the studio system or simply failed to make the grade as major stars, she was relegated to minor supporting roles (though some of them were in A-grade pictures like The Women (1939) and Reap the Wild Wind (1942), which starred Ray Milland and John Wayne). Sadly, Dorothy Sebastian grabbed the headlines not always as a result of her profession: the three-times-married actress was involved in several well-publicized court cases over tax evasion (1929), acrimonious divorce proceedings from ex-husband William Boyd (of 'Hopalong Cassidy' fame) (1936), a drunk driving charge after a party at Keaton's house in November 1938 (naively suggesting that a meal of spaghetti and garlic had been responsible for \"retaining the intoxicating odor of the wine\") and a charge by a San Diego hotel of not paying a $100 account, which was later dismissed (she eventually countersued the hotel for defamation of character and was awarded $10,000). During the war years Dorothy worked as an X-ray technician at a defense plant, Bohn Aluminium & Brass, but continued to act in small parts. She met her third husband at this time, the aircraft technician Herman Shapiro. Dorothy had a brief scene with Gloria Grahame in It's a Wonderful Life (1946), but it ended up on the cutting room floor. After being ill for some time, Dorothy died of cancer in August 1957 at the Motion Picture Country House, Woodland Hills. She has a star on the Hollywood Walk of Fame on Hollywood Boulevard.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyOTc2ODgxN15BMl5BanBnXkFtZTYwNzYzNDM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0780941","name":"Dorothy Sebastian","nicknames":["Slam","Little Alabam","Dottie"],"idIMDB":"nm0780941"},"actorId":"nm0780941","character":"Trilby Drew","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edward Earle","urlProfile":"http://www.imdb.com/name/nm0247305","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTM5ZTE4OWQtOWYyYS00MzcyLThhOWItMDg3ZTZkOTRjMmQ0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1882","placeOfBirth":" Toronto, Ontario, Canada","height":"6' (1.83 m)","bio":"Canadian native Edward Earle was born in Toronto on July 16, 1882, and was raised and schooled there. His stage career took form in Canada with an early emphasis on musical comedy, and he later toured in vaudeville and stock in association with Belasco, DeWolf Hopper Sr., Marie Cahill and the Schuberts, among other theatrical illuminaries. Making his Broadway debut in the comedy \"The Triumph of Love\" in 1904, his work on the stage eventually led to film parts in 1914. Earle entered via the Edison film company and emerged a star not long after, distinguishing himself at other studios as well, including Vitagraph, Famous Players, Metro, Warners and Columbia, with a tally of over 400 silent and talking films by the time he retired four decades later. Tawny blond, blue-eyed, well-built and with a clean-cut handsomeness, Earle was a natural for dashing, romantic silent film leads. He gained initial film attention starring in Edison's \"Olive's Opportunities\" one-reeler series paired opposite Mabel Trunnelle in 1914 and 1915. Adding dash and verve to such silents as Ranson's Folly (1915), a western also showcasing Ms. Trunelle; The Innocence of Ruth (1916); The Light of Happiness (1916) and The Gates of Eden (1916), all opposite a dramatic Viola Dana, he went on to dress up everything from stalwart war dramas (For France (1917)) to mystery comedies (The Blind Adventure (1918)). From 1917 through 1919, he and Agnes Ayres enjoyed great success in a series of two-reeler shorts based on the works of O. Henry. Earle ventured into the 1920s with such stylish movie showcases as East Lynne (1921), False Fronts (1922) and The Dangerous Flirt (1924), but then began to falter into second leads and support roles, which including the George Arliss starrer The Man Who Played God (1922), the Marie Prevost comedy How to Educate a Wife (1924), little Baby Peggy's showcase The Family Secret (1924), Colleen Moore's comedy romance Irene (1926), the John Gilbert/Joan Crawford sea tale Twelve Miles Out (1927), and Conrad Nagel's part talking prohibition tale Kid Gloves (1929). Come the advent of sound Earle was offered character parts and by the end of the pre-Code talkies era was relegated to bit and unbilled extra parts in Shirley Temple, Laurel and Hardy and Marx Bros. flicks. He continued to appear throughout the 1930s, 1940s and 1950s and tended to be more visible in oaters and serial cliffhangers. Extremely athletic with a daredevil instinct, he tried his hand as an artist, aviator and automobile racing car driver. Retiring in the early 1960s, Earle eventually retired to the Woodland Hills, California Motion Picture Country Home, where he passed away from complications of old age at age 90 in 1972.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTM5ZTE4OWQtOWYyYS00MzcyLThhOWItMDg3ZTZkOTRjMmQ0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0247305","name":"Edward Earle","idIMDB":"nm0247305"},"actorId":"nm0247305","character":"Lionel Benmore","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leila Hyams","urlProfile":"http://www.imdb.com/name/nm0404885","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0ODEyNDc0Ml5BMl5BanBnXkFtZTYwOTc5OTU2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 May 1905","placeOfBirth":" New York City, New York, USA","height":"5' 5\" (1.65 m)","bio":"Leila Hyams was one of the top leading ladies of the early talkie pre-code years. She was a likable, pleasing actress with a charming presence. She had much spark, personality and charisma, and a touch of down-to-earthiness and naturalness that won over movie fans; they could relate to her. A versatile, excellent actress she was, able to conform to any role and maintain that special heartfelt sincerity she always displayed in her role. Freaks (1932) was her best-known movie, in which she played Venus and gave a compassionate performance. Her image on screen was beautiful but not conceited, not high and mighty, tough but sweet and she had sex appeal but always came across as a lady who managed to keep her innocence. Those were the qualities that carried her to fame and set her apart from the other leading ladies of early Hollywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0ODEyNDc0Ml5BMl5BanBnXkFtZTYwOTc5OTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0404885","name":"Leila Hyams","idIMDB":"nm0404885"},"actorId":"nm0404885","character":"Ethyl Norcrosse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Bechtel","urlProfile":"http://www.imdb.com/name/nm0065038","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDVjNDA1MjgtNmFkZi00ZmJlLTgyYjYtMWNhYjM0ZDk3OTEyXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 June 1867","placeOfBirth":" Berlin, Germany","bio":"William Bechtel was born on June 12, 1867 in Berlin, Germany. He was an actor, known for Spite Marriage (1929), Friday the 13th (1911) and A Christmas Carol (1910). He was married to Mrs. William Bechtel. He died on October 27, 1930 in Hollywood, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDVjNDA1MjgtNmFkZi00ZmJlLTgyYjYtMWNhYjM0ZDk3OTEyXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0065038","name":"William Bechtel","idIMDB":"nm0065038"},"actorId":"nm0065038","character":"Frederick Nussbaum","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Byron","urlProfile":"http://www.imdb.com/name/nm0126391","urlPhoto":"","biography":{"dateOfBirth":"9 September 1895","placeOfBirth":" Kasota, Minnesota, USA","height":"6' (1.83 m)","bio":"Jack Byron was born on September 9, 1895 in Kasota, Minnesota, USA. He was an actor, known for Spite Marriage (1929), The Hard Hombre (1931) and Four Walls (1928). He died on May 30, 1991 in Placentia, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0126391","name":"Jack Byron","idIMDB":"nm0126391"},"actorId":"nm0126391","character":"Scarzi","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0020442","urlIMDB":"http://www.imdb.com/title/tt0020442","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"13","month":"11","year":"1928","remarks":null},{"money":null,"country":null,"day":"24","month":"12","year":"1928","remarks":null}],"copyrightHolder":"Copyright MCMXXIX in U.S.A. by Metro-Goldwin-Mayer (on print); © Joseph M. Schenck Productions; 22 April 1929; LP329 (in copyright registry)"},"technical":{"runtime":["1 hr 16 min (76 min) (Turner library print)"],"soundMix":["Silent (musical score and sound effects)"],"color":["Black and White"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":["2,139 m (9 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.1","filmingLocations":[{"location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA"}],"rated":"PASSED","awards":[],"votes":"1,382","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"}],"keywords":{"keywords":["marriage","pants presser","yacht","actor","theater"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:17:30"}}