{"data":{"movies":[{"title":"The Thin Red Line","originalTitle":"","year":"1964","releaseDate":"19640502","directors":[{"name":"Andrew Marton","id":"nm0554249"}],"writers":[{"name":"James Jones","id":"nm0428296"},{"name":"Bernard Gordon","id":"nm0330024"}],"runtime":"99 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNDAzNDc5M15BMl5BanBnXkFtZTcwNDc5NDMyMQ@@._V1.jpg","countries":["USA"],"languages":["English","Japanese"],"genres":["Drama","War"],"plot":"Dark tale of one man's determination to survive his tour of duty. Separated from his new wife after only eight days of marriage, private Doll suddenly decides that he will no longer blindly follow the orders of his superiors, following his own mind instead. What follows are a series of poorly planned attacks, in which Doll saves the day, time after time; eventually leading to the taking of the Elephant in the battle of Guadalcanal during World War II. Sgt. Welsh, Doll's immediate line officer grows an affinity for Doll, helping him through his first Kill, but never quite allowing himself to admit his admiration for the young soldier. The final scene of the movie brings home the true horror of war and the meaninglessness of it all.","simplePlot":"In Guadalcanal during World War II, a private and his sergeant clash during the heat of battle with the Japanese.","actors":[{"actorName":"Keir Dullea","urlProfile":"http://www.imdb.com/name/nm0001158","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczODgxNDU1NV5BMl5BanBnXkFtZTYwMzQxOTI2._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 May 1936","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Keir Atwood Dullea","height":"6' 1\" (1.85 m)","bio":"Tall, slim, remote and boyishly handsome, one of Keir Dullea's most arresting features is his pale blue eyes, which featured in a number of watershed films of the 1960s. A major, up-and-coming film star from the \"Camelot\" years straight through the turbulent era of the U.S.-Viet Nam War, he never quite reached international fame. His shining star may have suffered a power outage into the next decade, but he persevered quite well on T.V. and (especially) the stage in a career now surpassing five decades. Dullea, who was born in Cleveland, Ohio, is the son of two book-store owners, and he was raised in New York's Greenwich Village section. He graduated from George School in Pennsylvania and attended both Rutgers and San Francisco State before deciding to pursue summer stock and regional theatre. Attending the Neighborhood Playhouse, he made his New York City acting debut in a production of \"Sticks and Bones\" in 1956. His first big break came with the pilot program of the Route 66 (1960) series, and he proceeded to find other TV roles in Naked City (1958), Checkmate (1960) and various dramatic programs. Following stage work in \"Season of Choice\" (1959) and \"A Short Happy Life\" (1961), Dullea made an auspicious film debut in a leading role with The Hoodlum Priest (1961), playing a troubled street gang member who crosses paths with Don Murray's determined minister. The young actor's characters from then on seemed to walk a dangerous tight-rope of emotions, and his apparent versatility at such a young age led him to a number of other psychologically scarred portrayals. Tending to play men younger than he really was, none were more disturbed than his haphephobic adolescent David (Dullea was twenty-six at the time) in the deeply felt love story David and Lisa (1962). Paired beautifully with Janet Margolin's schizophrenic Lisa, Dullea won the Golden Globe Award for \"Most Promising Male Newcomer.\" In the World War II military drama The Thin Red Line (1964)he played an edgy, nervous-eyed private who is pushed to his murderous brink by a brutal sergeant on Guadacanal. In Bunny Lake Is Missing (1965) Dullea portrayed the incestuous brother of Carol Lynley, who may or may not figure into the disappearance of Lynley's child. Keir also costarred as the mysterious intruder who inserts an emotional wedge between gay lovers Anne Heywood and Sandy Dennis in the ground-breaking film about homosexuals, Le renard (1967). Topping that off, Dullea played the salacious Marquis De Sade himself in a relatively tame, internationally flavored production of De Sade (1969). The apex of his film career, however, came with his lead role in Stanley Kubrick's epic science-fiction film, 2001: A Space Odyssey (1968), as the astronaut Dr. David Bowman. In the realm of stage acting, Keir made his debut on Broadway in 1967 with \"Dr. Cook's Garden\" costarring Burl Ives, and Dullea won some \"flower power\" stardom two years later as a sensitive young blind man who attempted to wriggle free of his protective, overbearing mother. His character also pursues love with a free-spirited girl, played by Blythe Danner, in the play \"Butterflies Are Free.\" By the time the movie of this story was released in 1972 both stars had been replaced by Goldie Hawn and Edward Albert. Dullea next went abroad to seek film work in England and in Canada, but with lukewarm results. He continued to show his odd-man-out appeal on the Broadway stage as \"Brick\" in 1970, and in the Broadway revival of \"Cat on a Hot Tin Roof\" in 1974, acting along with Elizabeth Ashley as \"Maggie,\" and in the black comedy \"P.S. Your Cat Is Dead!\" one year later. In the years since then, Dullea has acted steadily on the stage in New York City, and in U.S. regional theatres, in productions of \"Sweet Prince,\" \"The Seagull\" and \"The Little Foxes,\"among others. His cinematic roles since 1970 have included another \"mysterious stranger\" in The Next One (1984), and he also reprised his \"David Bowman\" role in 2010: The Year We Make Contact (1984), the sequel to \"2001: A Space Odyssey.\" Dullea has had four wives: his first was actress Margot Bennett, and he and his third wife, Susie Fuller (whom he met during the British performances of \"Butterflies are Free\" in London), cofounded the Theater Artists Workshop of Westport in 1983. Dullea, Fuller and her two children resided in London for quite a while. After Fuller's death in 1998, Dullea married for the fourth time in 1999 to actress Mia Dillon, who is best known for portraying the character \"Babe\" in in the play, \"Crimes of the Heart\" in New York City. Just a few weeks later they appeared together in the play \"Deathtrap.\" Dullea has worked infrequently in television roles. Among his more recent work in movies has been the role of a senator in The Good Shepherd (2006), along with Matt Damon and Angelina Jolie, which was directed by Robert De Niro.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczODgxNDU1NV5BMl5BanBnXkFtZTYwMzQxOTI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001158","name":"Keir Dullea","idIMDB":"nm0001158"},"actorId":"nm0001158","character":"Pvt. Doll","urlCharacter":"http://www.imdb.com/character/ch0166920","main":true},{"actorName":"Jack Warden","urlProfile":"http://www.imdb.com/name/nm0912001","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1Mjk3Njc5MV5BMl5BanBnXkFtZTcwMDk2MzUzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1920","placeOfBirth":" Newark, New Jersey, USA","birthName":"John Warden Lebzelter Jr.","height":"5' 10½\" (1.79 m)","bio":"Jack Warden was born John Warden Lebzelter, Jr. on September 18, 1920 in Newark, New Jersey, to Laura M. (Costello) and John Warden Lebzelter. His father was of German and Irish descent, and his mother was of Irish ancestry. Raised in Louisville, Kentucky, at the age of seventeen, young Jack Lebzelter was expelled from Louisville's DuPont Manual High School for repeatedly fighting. Good with his fists, he turned professional, boxing as a welterweight under the name \"Johnny Costello\", adopting his mother's maiden name. The purses were poor, so he soon left the ring and worked as a bouncer at a night club. He also worked as a lifeguard before signing up with the U.S. Navy in 1938. He served in China with the Yangtzee River Patrol for the best part of his three-year hitch before joining the Merchant Marine in 1941. Though the Merchant Marine paid better than the Navy, Warden was dissatisfied with his life aboard ship on the long convoy runs and quit in 1942 in order to enlist in the U.S. Army. He became a paratrooper with the elite 101st Airborne Division, and missed the June 1944 invasion of Normandy due to a leg badly broken by landing on a fence during a nighttime practice jump shortly before D-Day. Many of his comrades lost their lives during the Normandy invasion, but the future Jack Warden was spared that ordeal. Recuperating from his injuries, he read a play by Clifford Odets given to him by a fellow soldier who was an actor in civilian life. He was so moved by the play, he decided to become an actor after the war. After recovering from his badly shattered leg, Warden saw action at the Battle of the Bulge, Nazi Germany's last major offensive. He was demobilized with the rank of sergeant and decided to pursue an acting career on the G.I. Bill. He moved to New York City to attend acting school, then joined the company of Theatre '47 in Dallas in 1947 as a professional actor, taking his father's middle name as his surname. This repertory company, run by Margo Jones, became famous in the 1940s and '50s for producing 'Tennesse Williams''s plays. The experience gave him a valuable grounding in both classic and contemporary drama, and he shuttled between Texas and New York for five years as he was in demand as an actor. Warden made his television debut in 1948, though he continued to perform on stage (he appeared in a stage production in Arthur Miller's Death of a Salesman (1966)). After several years in small, local productions, he made both his Broadway debut in the 1952 Broadway revival of Odets' \"Golden Boy\" and, three years later, originated the role of \"Marco\" in the original Broadway production of Miller's \"A View From the Bridge\". On film, he and fellow World War II veteran, Lee Marvin (Marine Corps, South Pacific), made their debut in You're in the Navy Now (1951) (a.k.a. \"U.S.S. Teakettle\"), uncredited, along with fellow vet Charles Bronson, then billed as \"Charles Buchinsky\". With his athletic physique, he was routinely cast in bit parts as soldiers (including the sympathetic barracks-mate of Montgomery Clift and Frank Sinatra in the Oscar-winning From Here to Eternity (1953). He played the coach on TV's Mister Peepers (1952) with Wally Cox. Aside from From Here to Eternity (1953) (The Best Picture Oscar winner for 1953), other famous roles in the 1950s included Juror #7 (a disinterested salesman who wants a quick conviction to get the trial over with) in 12 Angry Men (1957) - a film that proved to be his career breakthrough - the bigoted foreman in Edge of the City (1957) and one of the submariners commended by Clark Gable and Burt Lancaster in the World War II drama, Run Silent Run Deep (1958). In 1959, Warden capped off the decade with a memorable appearance in The Twilight Zone (1959) episode, The Twilight Zone: The Lonely (1959), in the series premier year of 1959. As \"James Corry\", Warden created a sensitive portrayal of a convicted felon marooned on an asteroid, sentenced to serve a lifetime sentence, who falls in love with a robot. It was a character quite different from his role as Juror #7. In the 1960s and early 70s, his most memorable work was on television, playing a detective in The Asphalt Jungle (1961), The Wackiest Ship in the Army (1965) and N.Y.P.D. (1967). He opened up the decade of the 1970s by winning an Emmy Award playing football coach \"George Halas\" in Brian's Song (1971), the highly-rated and acclaimed TV movie based on Gale Sayers's memoir, \"I Am Third\". He appeared again as a detective in the TV series, Jigsaw John (1976), in the mid-1970s, The Bad News Bears (1979) and appeared in a pilot for a planned revival of Topper (1937) in 1979. His collaboration with Warren Beatty in two 1970s films brought him to the summit of his career as he displayed a flair for comedy in both Shampoo (1975) and Heaven Can Wait (1978). As the faintly sinister businessman \"Lester\" and as the perpetually befuddled football trainer \"Max Corkle\", Warden received Academy Award nominations as Best Supporting Actor. Other memorable roles in the period were as the metro news editor of the \"Washington Post\" in All the President's Men (1976), the German doctor in Death on the Nile (1978), the senile, gun-toting judge in ...and justice for all. (1979), the President of the United States in Being There (1979), the twin car salesmen in Used Cars (1980) and Paul Newman's law partner in The Verdict (1982). This was the peak of Warden's career, as he entered his early sixties. He single-handedly made Andrew Bergman's So Fine (1981) watchable, but after that film, the quality of his roles declined. He made a third stab at TV, again appearing as a detective in Crazy Like a Fox (1984) in the mid-1980s. He played the shifty convenience store owner \"Big Ben\" in Problem Child (1990) and its two sequels, a role unworthy of his talent, but he shone again as the Broadway high-roller \"Julian Marx\" in Woody Allen's Bullets Over Broadway (1994). After appearing in Warren Beatty's Bulworth (1998), Warden's last film was The Replacements (2000) in 2000. He then lived in retirement in New York City with his girlfriend, Marucha Hinds. He was married to French stage actress Wanda Ottoni, best known for her role as the object of Joe Besser's desire in The Three Stooges short, Fifi Blows Her Top (1958). She gave up her career after her marriage. They had one son, Christopher, but separated several years ago.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1Mjk3Njc5MV5BMl5BanBnXkFtZTcwMDk2MzUzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0912001","name":"Jack Warden","idIMDB":"nm0912001"},"actorId":"nm0912001","character":"First Sgt. Welsh","urlCharacter":"http://www.imdb.com/character/ch0007301","main":true},{"actorName":"James Philbrook","urlProfile":"http://www.imdb.com/name/nm0679920","urlPhoto":"","biography":{"dateOfBirth":"22 October 1924","placeOfBirth":" Lebanon, Pennsylvania, USA","birthName":"James Frederick Philbrook","bio":"James Philbrook was born on October 22, 1924 in Lebanon, Pennsylvania, USA as James Frederick Philbrook. He was an actor, known for I Want to Live! (1958), Sound of Horror (1966) and The Thin Red Line (1964). He was married to Frances Faythe Cassling. He died on October 24, 1982 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0679920","name":"James Philbrook","idIMDB":"nm0679920"},"actorId":"nm0679920","character":"Col. Tall","urlCharacter":"http://www.imdb.com/character/ch0007311","main":true},{"actorName":"Bob Kanter","urlProfile":"http://www.imdb.com/name/nm0437895","urlPhoto":"","biography":{"dateOfBirth":"6 August 1929","placeOfBirth":"","bio":"Bob Kanter was born on August 6, 1929. He was an actor and writer, known for The Thin Red Line (1964), The War Lover (1962) and Winter A-Go-Go (1965). He died on August 2, 1993.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0437895","name":"Bob Kanter","idIMDB":"nm0437895"},"actorId":"nm0437895","character":"Fife","urlCharacter":"http://www.imdb.com/character/ch0007304","main":true},{"actorName":"Ray Daley","urlProfile":"http://www.imdb.com/name/nm0197877","urlPhoto":"","biography":{"dateOfBirth":"23 March 1932","placeOfBirth":" Florida, USA","bio":"Ray Daley was born on March 23, 1932 in Florida, USA. He was an actor, known for The Five Pennies (1959), The Thin Red Line (1964) and The Outsider (1961). He was married to Mary Hirschfeld Daley. He died on June 10, 2015 in Phoenix, Arizona, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0197877","name":"Ray Daley","idIMDB":"nm0197877"},"actorId":"nm0197877","character":"Capt. Stone","urlCharacter":"http://www.imdb.com/character/ch0007309","main":true},{"actorName":"Merlyn Yordan","urlProfile":"http://www.imdb.com/name/nm0948633","urlPhoto":"","biography":{"bio":"Merlyn Yordan is an actress, known for The Thin Red Line (1964), Winged Devils (1972) and The Divorce (1970).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0948633","name":"Merlyn Yordan","idIMDB":"nm0948633"},"actorId":"nm0948633","character":"Judy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kieron Moore","urlProfile":"http://www.imdb.com/name/nm0601476","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTdlYmNiYWEtMmEwMC00MTY1LTk1MGMtZGZlZDI2ZmYyYzVkXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1924","placeOfBirth":" Skibbereen, County Cork, Ireland","birthName":"Kieron O'Hanrahan","height":"6' 1½\" (1.87 m)","bio":"With dark good looks and a brawny build, Irish actor Kieron Moore made a name for himself in post-war British films as both heroes and villains. Interestingly, he is better remembered for one of his more earnest failures, that of Count Vronsky opposite Vivien Leigh's Anna Karenina (1948). Born Kieron O'Hanrahan, he grew up in a hearty, Irish-speaking-only household. His father, Peter, was an Irish Nationalist writer, poet, editor and political activist who was imprisoned more than once by the British for his activities. Encouraged by their parents to pursue their artistic leanings, Kieron's sister Nease became an actress, brother Fachtna became a music director, and sister Blaithin played harp for the National Symphony Orchestra. Kieron himself was educated in Dublin and started to study medicine at University College. He abandoned his medical studies, however, after an Abbey Theatre rep saw him in a local play and accepted his application for membership. In 1943 the handsome Kieron moved to England and subsequently made his London stage debut as Heathcliff in a production of Wuthering Heights. He went on to gain more notice in such plays as Purple Dust by 'Sean O'Casey' and Everyman. He made an impressive film debut as an Irish Republican Army killer in The Voice Within (1946). The heroine in the film, murdered by Kieron's character, was played by actress Barbara White. Despite their fatal on-camera relationship, they formed a much more positive one away from the lens and married in 1947. Barbara retired shortly thereafter and they had three sons (Casey, Colm, Sean) and one daughter (Theresa). Kieron was a talented, durable player but seemed to lack the charisma or drive for top stardom despite his early promise. An impressed Alexander Korda signed him up with his London Films following a heralded performance in the West End version of Sean O'Casey 's play Red Roses for Me in 1946. The marquee name of Kieron Moore was bestowed upon him at this time. While he excelled in his next unsympathetic role, the psychological drama Mine Own Executioner (1947) in which he plays a schizophrenic POW treated by doctor Burgess Meredith (with real-wife Barbara playing his wife in one of her last film roles), Kieron failed to capitalize on the one role that could have made him a star. As the urbane count in Anna Karenina (1948), he was deemed miscast by many of his reviews. Kieron took a bite of the Hollywood apple when cast as Uriah the Hittite in the plush but stilted biblical epic David and Bathsheba (1951) opposite Gregory Peck and 'Susan Hayward' , and as a dashing Foreign Legion corporal in Ten Tall Men (1951), starring Burt Lancaster. Not much happened as a result and he returned to England. There he continued to offer fine and varied performances, notably in The Green Scarf (1954), in which he earned applause for his role as a deaf, blind and mute murder suspect. Another part that garnered some attention was his playing of the bully Pony Sugrue in the Disney classic Darby O'Gill and the Little People (1959). This was topped by the strong kudos he received in the top-drawer Jack Hawkins comedy starrer The League of Gentlemen (1960) as a gay former officer recruited by Hawkins to pull off a major bank heist. At the same time, he turned hero once again as a man forced to battle flesh-eating plants in the classic sci-fi thriller The Day of the Triffids (1963) co-starring Janette Scott. At this juncture Kieron's status started to regress with more and more routine films handed him, including Doctor Blood's Coffin (1961), I Thank a Fool (1962) and The Thin Red Line (1964). He played second fiddle to special effects in Crack in the World (1965) and to Gregory Peck (again) in Arabesque (1966). He took as his final film the underwhelming Custer of the West (1967) in which he was oddly cast as an Indian chief. Throughout the 1950s and 1960s he customarily performed on TV, including a short-lived series. After retiring from feature film work altogether in 1974, his life took a religious and socially-active turn. He joined the Catholic Agency for Overseas Development, for whom he worked for nine years, directing and narrating two film documentaries in the course of that time. The films dealt specifically with the struggle for survival in Third World countries. He also traveled extensively in the Middle East and India and provided voice-overs for other documentary features as well. Retiring quietly to France in 1994, Kieron was survived by his wife, Barbara, and children at the time of his death on July 15, 2007 at age 82.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTdlYmNiYWEtMmEwMC00MTY1LTk1MGMtZGZlZDI2ZmYyYzVkXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0601476","name":"Kieron Moore","idIMDB":"nm0601476"},"actorId":"nm0601476","character":"Lt. Band","urlCharacter":"http://www.imdb.com/character/ch0007315","main":true},{"actorName":"Jim Gillen","urlProfile":"http://www.imdb.com/name/nm0318833","urlPhoto":"","biography":{"bio":"Jim Gillen is an actor, known for Crack in the World (1965), The Thin Red Line (1964) and Les hors-la-loi de Casa Grande (1964).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0318833","name":"Jim Gillen","idIMDB":"nm0318833"},"actorId":"nm0318833","character":"Capt. Gaff","urlCharacter":"http://www.imdb.com/character/ch0007303","main":true},{"actorName":"Charles Stalmaker","urlProfile":"http://www.imdb.com/name/nm0821750","urlPhoto":"","biography":{"dateOfBirth":"10 November 1933","placeOfBirth":" Elkins, West Virginia, USA","birthName":"Charles Fredrick Stalnaker","bio":"Charles Stalmaker was born on November 10, 1933 in Elkins, West Virginia, USA as Charles Fredrick Stalnaker. He was an actor, known for Battle of the Bulge (1965), Custer of the West (1967) and Captain Apache (1971). He was married to Assunta Menetrier. He died on August 2, 2012 in Flora, Illinois, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0821750","name":"Charles Stalmaker","idIMDB":"nm0821750"},"actorId":"nm0821750","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve Rowland","urlProfile":"http://www.imdb.com/name/nm0746743","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY5ZDhiNjMtNmQ2Ni00OGFjLWE4MGUtNThhYmRhNDI3YjliXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 September 1932","placeOfBirth":" Los Angeles, California, USA","birthName":"Stephen Jacob Rowland","bio":"Steve Rowland was born on September 3, 1932 in Los Angeles, California, USA as Stephen Jacob Rowland. He is known for his work on Battle of the Bulge (1965), Gun Glory (1957) and Wild Youth (1961).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY5ZDhiNjMtNmQ2Ni00OGFjLWE4MGUtNThhYmRhNDI3YjliXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0746743","name":"Steve Rowland","idIMDB":"nm0746743"},"actorId":"nm0746743","character":"Mazzi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Lasdun","urlProfile":"http://www.imdb.com/name/nm0489490","urlPhoto":"","biography":{"bio":"Gary Lasdun is an actor, known for Crack in the World (1965), The Thin Red Line (1964) and Gunn (1967).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0489490","name":"Gary Lasdun","idIMDB":"nm0489490"},"actorId":"nm0489490","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eddy King","urlProfile":"http://www.imdb.com/name/nm0454676","urlPhoto":"","biography":{"dateOfBirth":"8 March 1912","placeOfBirth":" Portland, Oregon, USA","birthName":"Edward King","bio":"Eddy King was born on March 8, 1912 in Portland, Oregon, USA as Edward King. He was an actor, known for The Thin Red Line (1964), Dragnet (1954) and Dragnet (1951). He died on August 29, 2011 in Simi Valley, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0454676","name":"Eddy King","idIMDB":"nm0454676"},"actorId":"nm0454676","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeffrey O'Kelly","urlProfile":"http://www.imdb.com/name/nm0641530","urlPhoto":"","biography":{"bio":"Jeffrey O'Kelly is a writer and actor, known for Doctor Snuggles (1979) and Tusk (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0641530","name":"Jeffrey O'Kelly","idIMDB":"nm0641530"},"actorId":"nm0641530","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Gaskins","urlProfile":"http://www.imdb.com/name/nm0309151","urlPhoto":"","biography":{"bio":"Jack Gaskins is an actor, known for Battle of the Bulge (1965), Custer of the West (1967) and The Thin Red Line (1964).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0309151","name":"Jack Gaskins","idIMDB":"nm0309151"},"actorId":"nm0309151","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Collins","urlProfile":"http://www.imdb.com/name/nm1396682","urlPhoto":"","biography":{"bio":"Joe Collins is an actor, known for The Thin Red Line (1964) and Prince Valiant (1954).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1396682","name":"Joe Collins","idIMDB":"nm1396682"},"actorId":"nm1396682","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0058648","urlIMDB":"http://www.imdb.com/title/tt0058648","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Copyright ¤ 1964 Security Pictures"},"technical":{"runtime":["1 hr 39 min (99 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Black and White"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Franscope (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"6.8","filmingLocations":[{"location":"Madrid, Spain"}],"awards":[],"votes":"541","type":"Movie","companyCreditsSimple":[{"idCompany":"co0086399","name":"A.C.E. Films"},{"idCompany":"co0020850","name":"Security Pictures"}],"keywords":{"keywords":["anti war","based on novel","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:30:44"}}