{"data":{"movies":[{"title":"The Great Dictator","originalTitle":"","year":"1940","releaseDate":"19410307","directors":[{"name":"Charles Chaplin","id":"nm0000122"}],"writers":[{"name":"Charles Chaplin","id":"nm0000122"}],"runtime":"125 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmExYWJjNTktNGUyZS00ODhmLTkxYzAtNWIzOGEyMGNiMmUwXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1.jpg","countries":["USA"],"languages":["English","Esperanto"],"genres":["Comedy","Drama","War"],"plot":"Twenty years after the end of WWI in which the nation of Tomainia was on the losing side, Adenoid Hynkel has risen to power as the ruthless dictator of the country. He believes in a pure Aryan state, and the decimation of the Jews. This situation is unknown to a simple Jewish-Tomainian barber who has since been hospitalized the result of a WWI battle. Upon his release, the barber, who had been suffering from memory loss about the war, is shown the new persecuted life of the Jews by many living in the Jewish ghetto, including a washerwoman named Hannah, with whom he begins a relationship. The barber is ultimately spared such persecution by Commander Schultz, who he saved in that WWI battle. The lives of all Jews in Tomainia are eventually spared with a policy shift by Hynkel himself, who is doing so for ulterior motives. But those motives include a want for world domination, starting with the invasion of neighboring Osterlich, which may be threatened by Benzino Napaloni, the dictator ...","simplePlot":"Dictator Adenoid Hynkel tries to expand his empire while a poor Jewish barber tries to avoid persecution from Hynkel's regime.","actors":[{"actorName":"Charles Chaplin","urlProfile":"http://www.imdb.com/name/nm0000122","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDcwMDc0ODAzOF5BMl5BanBnXkFtZTgwNTY2OTI1MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1889","placeOfBirth":" Walworth, London, England, UK","birthName":"Charles Spencer Chaplin","height":"5' 5\" (1.65 m)","bio":"Considered to be one of the most pivotal stars of the early days of Hollywood, Charlie Chaplin lived an interesting life both in his films and behind the camera. He is most recognized as an icon of the silent film era, often associated with his popular character, the Little Tramp; the man with the toothbrush mustache, bowler hat, bamboo cane, and a funny walk. Charles Spencer Chaplin was born in Walworth, London, England on April 16, 1889, to Hannah Harriet Pedlingham (Hill) and Charles Chaplin, both music hall performers, who were married on June 22, 1885. After Charles Sr. separated from Hannah to perform in New York City, Hannah then tried to resurrect her stage career. Unfortunately, her singing voice had a tendency to break at unexpected moments. When this happened, the stage manager spotted young Charlie standing in the wings and led him on stage, where five-year-old Charlie began to sing a popular tune. Charlie and his half-brother, Syd Chaplin spent their lives in and out of charity homes and workhouses between their mother's bouts of insanity. Hannah was committed to Cane Hill Asylum in May 1903 and lived there until 1921, when Chaplin moved her to California. Chaplin began his official acting career at the age of eight, touring with the Eight Lancashire Lads. At age 18, he began touring with Fred Karno's vaudeville troupe, joining them on the troupe's 1910 United States tour. He traveled west to California in December 1913 and signed on with Keystone Studios' popular comedy director Mack Sennett, who had seen Chaplin perform on stage in New York. Charlie soon wrote his brother Syd, asking him to become his manager. While at Keystone, Chaplin appeared in and directed 35 films, starring as the Little Tramp in nearly all. In November 1914, he left Keystone and signed on at Essanay, where he made 15 films. In 1916, he signed on at Mutual and made 12 films. In June 1917, Chaplin signed up with First National Studios, after which he built Chaplin Studios. In 1919, he and Douglas Fairbanks, Mary Pickford and D.W. Griffith formed United Artists (UA). Chaplin's life and career was full of scandal and controversy. His first big scandal was during World War I, during which time his loyalty to England, his home country, was questioned. He had never applied for American citizenship, but claimed that he was a \"paying visitor\" to the United States. Many British citizens called Chaplin a coward and a slacker. This and his other career eccentricities sparked suspicion with FBI chief J. Edgar Hoover and the House Un-American Activities Committee (HUAC), who believed that he was injecting Communist propaganda into his films. Chaplin's later film The Great Dictator (1940), which was his first \"talkie\", also created a stir. In the film, Chaplin plays a humorous caricature of Adolf Hitler. Some thought the film was poorly done and in bad taste. However, the film grossed over $5 million and earned five Academy Award Nominations. Another scandal occurred when Chaplin briefly dated 22-year-old Joan Barry. However, Chaplin's relationship with Barry came to an end in 1942, after a series of harassing actions from her. In May 1943, Barry returned to inform Chaplin that she was pregnant and filed a paternity suit, claiming that the unborn child was his. During the 1944 trial, blood tests proved that Chaplin was not the father, but at the time, blood tests were inadmissible evidence and he was ordered to pay $75 a week until the child turned 21. Chaplin was also scrutinized for his support in aiding the Russian struggle against the invading Nazis during World War II, and the United States government questioned his moral and political views, suspecting him of having Communist ties. For this reason, HUAC subpoenaed him in 1947. However, HUAC finally decided that it was no longer necessary for him to appear for testimony. Conversely, when Chaplin and his family traveled to London for the premier of Limelight (1952), he was denied re-entry to the United States. In reality, the government had almost no evidence to prove that he was a threat to national security. Instead, he and his wife decided to settle in Switzerland. Chaplin was married four times and had a total of 11 children. In 1918, he married Mildred Harris and they had a son together, Norman Spencer Chaplin, who only lived three days. Chaplin and Mildred were divorced in 1920. He married Lita Grey in 1924, who had two sons, Charles Chaplin Jr. and Sydney Chaplin. They were divorced in 1927. In 1936, Chaplin married Paulette Goddard and his final marriage was to Oona O'Neill (Oona Chaplin), daughter of playwright Eugene O'Neill in 1943. Oona gave birth to eight children: Geraldine Chaplin, Michael Chaplin, Josephine Chaplin, Victoria Chaplin, Eugene Chaplin, Jane Chaplin, Annette-Emilie Chaplin and Christopher Chaplin. In contrast to many of his boisterous characters, Chaplin was a quiet man who kept to himself a great deal. He also had an \"un-millionaire\" way of living. Even after he had accumulated millions, he continued to live in shabby accommodations. In 1921, Chaplin was decorated by the French government for his outstanding work as a filmmaker, and was elevated to the rank of Officer of the Legion of Honor in 1952. In 1972, he was honored with an Academy Award for his \"incalculable effect in making motion pictures the art form of the century.\" He was appointed Knight Commander of the Order of the British Empire in the 1975 New Years Honours List. No formal reason for the honour was listed. The citation simply reads \"Charles Spencer Chaplin, Film Actor and Producer\". Chaplin's other works included musical scores he composed for many of his films. He also authored two autobiographical books, \"My Autobiography\" (1964) and its companion volume, \"My Life in Pictures\" (1974). Chaplin died at age 88 of natural causes on December 25, 1977 at his home in Vevey, Switzerland. His funeral was a small and private Anglican ceremony according to his wishes. In 1978, Chaplin's corpse was stolen from its grave and was not recovered for three months; he was re-buried in a vault surrounded by cement. Six of Chaplin's films have been selected for preservation in the National Film Registry by the United States Library of Congress: The Immigrant (1917), The Kid (1921), The Gold Rush (1925), City Lights (1931), Modern Times (1936) and The Great Dictator (1940). Charlie Chaplin was considered one of the greatest filmmakers in the history of American cinema, whose movies were and still are popular throughout the world, and have even gained notoriety as time progresses. His films show, through the Little Tramp's positive outlook on life in a world full of chaos, that the human spirit has and always will remain the same.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDcwMDc0ODAzOF5BMl5BanBnXkFtZTgwNTY2OTI1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000122","name":"Charles Chaplin","nicknames":["Charlie","Charlot","The Little Tramp"],"idIMDB":"nm0000122"},"actorId":"nm0000122","character":"Hynkel - Dictator of Tomania / A Jewish Barber","urlCharacter":"http://www.imdb.com/character/ch0177142","main":true},{"actorName":"Jack Oakie","urlProfile":"http://www.imdb.com/name/nm0642988","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQxNjAzNjkyOF5BMl5BanBnXkFtZTgwNzA3MzU2MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 November 1903","placeOfBirth":" Sedalia, Missouri, USA","birthName":"Lewis Delaney Offield","height":"5' 11\" (1.8 m)","bio":"\"America's Joyboy,\" beefy, plump-faced comedian Jack Oakie, was one of the funniest top and second banana jokesters of stage, radio and especially film's \"Golden Age.\" He would accomplish so much despite the fact that he was \"functionally deaf\" throughout his career and performed primarily with the aid of lip reading or vibrations. The stories vary on how he became deaf -- scarlet fever at age 9, a Wall Street building explosion where he worked -- but, whatever the case, it seems a minor miracle that he managed to become a performing success not only for his famous \"triple take\" comedy but also for his work in Broadway and Hollywood musicals, which could not have been an easy task! A slapstick inspiration to future comedians like Jackie Gleason, Oakie's lightweight foolery and participation in films was pretty much standard cornball with a lot of mugging to boot, but then he surprised audiences by topping it all off in the hands of the legendary Charles Chaplin with a scene-stealing Oscar-nominated support role in a political satire masterpiece. Jack was born Lewis Delaney Offield in Sedalia, Missouri on November 12, 1903, the son of a grain dealer (who died while Jack was quite young) and a teacher of psychology (Mary Evelyn Oakie Offield). His family moved to moved to Muskogee, Oklahoma. He was raised at times with his grandmother in Kansas City, Missouri, and made extra money there as a paperboy for The Kansas City Star. Moving eventually to New York, Jack first worked as a runner for a brokerage firm on Wall Street, and nearly lost his life when a nearby Wall Street building was bombed on September 16, 1920. Interested in comedy and mime by this point, he began building up confidence on the amateur stage and giving himself a new name, Jack Oakie, which was comprised of the first character he ever played on stage and his mother's maiden name. Jack took his first professional curtain call on Broadway in 1923 as a chorus boy in George M. Cohan's production of \"Little Nellie Kelly.\" From there he found employment in a number of comedies, as well as musicals throughout the mid to late 1920s, including \"Sharlee\" (1923), the revues \"Innocent Eyes\" (1924) and \"Artists and Models\" (1925), and the musical \"Peggy-Ann\" in 1926. He also appeared in a couple of unbilled film parts in 1923 and 1924. Films came calling toward the end of the silent era in 1927, and he relocated to Los Angeles where he made several non-talkies on his arrival, including Finders Keepers (1928) starring Laura La Plante and John Harron (Bobby's little brother) and directed by Wesley Ruggles; Clara Bow's The Fleet's In (1928); and the western Sin Town (1929). With the advent of sound, Oakie was signed, with the help of director Ruggles, to a contract by Paramount and appeared in his first talkie, the Ruth Chatterton/Fredric March starrer The Dummy (1929). Jack went on to support Wallace Beery in Chinatown Nights (1929); Dorothy Mackaill in Hard to Get (1929); Betty Compson and John Harron in Street Girl (1929); and Nancy Carroll in the musical Sweetie (1929). Settling in, he never returned to the Broadway stage. Jack finally shared top billing with Evelyn Brent in the comedy film Fast Company (1929) as Elmer Kane, a character based on the George M. Cohan Broadway show \"Elmer the Great.\" This led to top billing in the film version of the Broadway hit musical Hit the Deck (1929), as well as the early talking comedy vehicles The Social Lion (1930), The Sap from Syracuse (1930), Let's Go Native (1930), Sea Legs (1930), The Gang Buster (1931), June Moon (1931), Dude Ranch (1931), Once in a Lifetime (1932), Madison Sq. Garden (1932), Uptown New York (1932), Sitting Pretty (1933) and Shoot the Works (1934). Occasional dramas came his way with Dancers in the Dark (1932) co-starring Miriam Hopkins and Sky Bride (1932) co-starring Richard Arlen. Throughout the 1930s, the 30-year-old plus actor appeared in a host of light college-themed comedies and was lovingly dubbed \"The World's Oldest Freshman\" while adding to the humor of such films as College Humor (1933), College Rhythm (1934) and Collegiate (1936). Elsewhere, in Too Much Harmony (1933), his mother Evelyn was featured as his mother, and he played Tweedledum to Roscoe Karns' Tweedledee in the all-star version of Alice in Wonderland (1933). Oakie's contract ended with Paramount in 1934 and he continued as a freelancing agent until an RKO contract came his way a couple of years later. Starting to now gain a bit in girth, Oakie went back into support roles in musicals, adventures and comedies. Among the better known films were Call of the Wild (1935) with Clark Gable and Loretta Young; Colleen (1936) with Dick Powell and Ruby Keeler; The Toast of New York (1937) with Edward Arnold and Frances Farmer; Tin Pan Alley (1940) with Alice Faye and Betty Grable and Iceland (1942) with Sonja Henie and John Payne. In the late 1930s, Jack traveled to Europe for some work and suffered a huge career setback when he returned to Hollywood and found himself unwanted. The draught lasted nearly two years until a major comeback thanks to Charles Chaplin. While such film highlights must include Million Dollar Legs (1932), King of Burlesque (1936), The Affairs of Annabel (1938) and Rise and Shine (1941), Oakie will in all probability be best remembered for his lip-smacking parody of Benito Mussolini (\"Il Duce\")in Chaplin's classic The Great Dictator (1940). As Benzino Napaloni, the dictator of the fictional country of Bacteria, Jack earned his only Oscar nomination in the \"Supporting Actor\" category. Throughout his lead career, he worked with a quality number of diverse leading ladies on film from Carole Lombard to Lily Pons. Oakie also found work on radio, hosting his own show, \"Jack Oakie's College,\" between 1936 and 1938. His deafness did not affect the output of his work, and, as a pro, seldom were there problems in accommodating his disability. Director Jules Dassin, in fact, once made it a point to state that Oakie never caused any delays in the filming of his film noir Thieves' Highway (1949). Into the 1950s and 1960s, his career slowed down quite a bit, primarily due to his disability. He appeared to good advantage in the films The Rat Race (1960) and Lover Come Back (1961) and with TV comedy and drama on such popular shows as \"The Real McCoys,\" \"Daniel Boone,\" \"Bonanza\" and, his last, \"Night Gallery\" in 1972. Jack Oakie was married twice. His first marriage (1936-1945) was to Venita Varden, who perished in the 1948 air crash of United Airlines Flight 624 at Mount Carmel, Pennsylvania. Oakie's second marriage was to actress Victoria Horne in 1950; they moved to an estate in Northridge and lived there until his death. The USC School of Cinematic Arts continues its durable ties with Hollywood history in the form of The Jack Oakie and Victoria Horne Oakie Charitable Foundation, which provides scholarships. The comic actor died on January 23, 1978, in Los Angeles, California at the age of 74 from an aortic aneurysm. His remains were interred at Forest Lawn Memorial Park, in the Los Angeles area.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQxNjAzNjkyOF5BMl5BanBnXkFtZTgwNzA3MzU2MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0642988","name":"Jack Oakie","nicknames":["America's Joy-Friend.","America's Joyboy."],"idIMDB":"nm0642988"},"actorId":"nm0642988","character":"Napaloni - Dictator of Bacteria","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Reginald Gardiner","urlProfile":"http://www.imdb.com/name/nm0306786","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNzQzMzQ2MV5BMl5BanBnXkFtZTcwOTY0NTY1Mg@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1903","placeOfBirth":" London, England, UK","birthName":"William Reginald Gardiner","bio":"English-born Reginald Gardiner graduated from the Royal Academy of Dramatic Arts and, by the early 1930's, had become an established revue and musical star on the London stage. His first foray into films was in the Alfred Hitchcock-directed The Lodger (1927) in 1926, but it was in Hollywood where his career really took off. At the prompting of Beatrice Lillie, he left for America in 1935. After appearing in two of her shows, he delighted Broadway audiences in \"An Evening with Beatrice Lillie and Reginald Gardiner\", performing a series of witty impersonations of various inanimate items, such as lighthouses and wallpaper. In 1936, he appeared in his first Hollywood film, Born to Dance (1936), with Eleanor Powell and James Stewart, as a traffic cop with symphonic delusions. His instant popularity resulted in other film offers, and Gardiner was soon in demand as butlers and \"silly ass\" upper-crust English twits. With his suave attire, thin moustache and obtuse mannerisms, he took to playing those caricatures with obvious glee. He enlivened many a film with his comic presence, notably A Damsel in Distress (1937), The Man Who Came to Dinner (1942)(his character \"Beverly Carlton\" brilliantly lampooning Noël Coward) - and Cluny Brown (1946). In later years, Gardiner was seen on television as co-star of The Phyllis Diller Show (1966), opposite Phyllis Diller. In 1964, he returned to the stage to play Alfred P. Doolittle, the role made famous by Stanley Holloway, in 'My Fair Lady' at the New York City Centre. John Canaday, reviewing for the New York Times, described his character as a \"wonderful, boozy, abominable, bug-ridden and altogether reprehensible charmer, a kind of defrocked Boy Scout, whose love for everybody is exceeded only by his propensity for chicanery and self-indulgence\". Reginald Gardiner was also celebrated for his classic monologue, simply called 'Trains', which so impressed King George VI that he summoned the actor to Buckingham Palace for a special performance. 'Trains' was recorded by Decca and has since become a collector's item.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNzQzMzQ2MV5BMl5BanBnXkFtZTcwOTY0NTY1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0306786","name":"Reginald Gardiner","idIMDB":"nm0306786"},"actorId":"nm0306786","character":"Schultz","urlCharacter":"http://www.imdb.com/character/ch0499296","main":true},{"actorName":"Henry Daniell","urlProfile":"http://www.imdb.com/name/nm0199787","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNDk5NzQ1OF5BMl5BanBnXkFtZTcwNTg5MjgwOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 March 1894","placeOfBirth":" London, England, UK","birthName":"Charles Henry Pywell Daniel","height":"6' (1.83 m)","bio":"London-born Henry Daniell began his career on the British stage, and continued it on the Broadway stage when he emigrated to the US. He entered films in 1929, and excelled at playing the suave, well-bred villain who could kill an enemy or start a war with a certain air of upper-class disdain, as if all of this effort was beneath him. His long and distinguished career ended in 1963, when he suffered a heart attack while filming My Fair Lady (1964).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNDk5NzQ1OF5BMl5BanBnXkFtZTcwNTg5MjgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0199787","name":"Henry Daniell","nicknames":["The Adolph Menjou of Menace"],"idIMDB":"nm0199787"},"actorId":"nm0199787","character":"Garbitsch","urlCharacter":"http://www.imdb.com/character/ch0443968","main":true},{"actorName":"Billy Gilbert","urlProfile":"http://www.imdb.com/name/nm0317970","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNTAxODg1MF5BMl5BanBnXkFtZTcwNzA2OTkwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1894","placeOfBirth":" Louisville, Kentucky, USA","birthName":"William Gilbert Barron","height":"5' 11\" (1.8 m)","bio":"The son of singers in the Metropolitan Opera, Billy Gilbert began performing in vaudeville at age 12. He developed a drawn-out, explosive sneezing routine that became his trademark (he was the model for, and voice of, Sneezy in Blanche Neige et les sept nains (1937)). Gilbert's exquisite comic timing made him the perfect foil for such comedians as Stan Laurel and Oliver Hardy, and he was especially memorable as the dim-witted process server Pettibone in His Girl Friday (1940).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNTAxODg1MF5BMl5BanBnXkFtZTcwNzA2OTkwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0317970","name":"Billy Gilbert","idIMDB":"nm0317970"},"actorId":"nm0317970","character":"Herring","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Grace Hayle","urlProfile":"http://www.imdb.com/name/nm0354916","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYxZDQwOWYtYTA0NC00ZDE3LWFhM2QtMDQ0MTIwOTFmMmU4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 July 1888","placeOfBirth":" Newark, New Jersey, USA","bio":"Grace Hayle was born on July 24, 1888 in Newark, New Jersey, USA. She was an actress, known for The Great Dictator (1940), Echo Mountain (1936) and She Married Her Boss (1935). She was married to Agar. She died on March 20, 1963 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTYxZDQwOWYtYTA0NC00ZDE3LWFhM2QtMDQ0MTIwOTFmMmU4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0354916","name":"Grace Hayle","idIMDB":"nm0354916"},"actorId":"nm0354916","character":"Madame Napaloni","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carter DeHaven","urlProfile":"http://www.imdb.com/name/nm0214924","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MjllZjEtZTliZi00OGJhLThhMjgtNDQ0NDIxOGVlOWE3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1886","placeOfBirth":" Chicago, Illinois, USA","birthName":"Francis O'Callaghan","bio":"Starting out his entertainment career in vaudeville and on the stage, Carter DeHaven entered films while still a teenager and soon achieved fame appearing in productions with his wife, Flora Parker DeHaven. During his long film career he also produced and directed several movies, and Charles Chaplin chose him to be his assistant during the filming of Modern Times (1936). DeHaven began somewhat of a show-business dynasty: in addition to his wife, his daughter Gloria DeHaven is also an actress, and his sister, his son, his grandson and his great-grandson were or still are in the film industry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MjllZjEtZTliZi00OGJhLThhMjgtNDQ0NDIxOGVlOWE3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0214924","name":"Carter DeHaven","idIMDB":"nm0214924"},"actorId":"nm0214924","character":"Bacterian Ambassador","urlCharacter":"http://www.imdb.com/character/ch0443969","main":true},{"actorName":"Paulette Goddard","urlProfile":"http://www.imdb.com/name/nm0002104","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NTk1Mjg4MF5BMl5BanBnXkFtZTcwMjAxMDIzNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 June 1910","placeOfBirth":" Whitestone Landing, Long Island, New York, USA","birthName":"Pauline Marion Goddard Levy","height":"5' 3\" (1.6 m)","bio":"Paulette Goddard was a child model who debuted in \"The Ziegfeld Follies\" at the age of 13. She gained fame with the show as the girl on the crescent moon, and was married to a wealthy man by the time she was 16. After her divorce she went to Hollywood in 1931, where she appeared in small roles in pictures for a number of studios. A stunning natural beauty, Paulette could mesmerize any man she met, a fact she was well aware of. One of her bigger roles in that period was as a blond \"Goldwyn Girl\" in the Eddie Cantor film The Kid from Spain (1932). In 1932 she met Charles Chaplin, and they soon became an item around town. He cast her in Modern Times (1936), which was a big hit, but her movie career was not going anywhere because of her relationship with Chaplin. They were secretly married in 1936, but the marriage failed and they were separated by 1940. It was her role as Miriam Aarons in The Women (1939), however, that got her a contract with Paramount. Paulette was one of the many actresses tested for the part of Scarlett O'Hara in Gone with the Wind (1939), but she lost the part to Vivien Leigh and instead appeared with Bob Hope in The Cat and the Canary (1939), a good film but hardly in the same league as GWTW. The 1940s were Paulette's busiest period. She worked with Chaplin in The Great Dictator (1940), Cecil B. DeMille in Reap the Wild Wind (1942) and Burgess Meredith in The Diary of a Chambermaid (1946). She was nominated for an Academy Award for Best Supporting Actress in So Proudly We Hail! (1943). Her star faded in the late 1940s, however, and she was dropped by Paramount in 1949. After a couple of \"B\" movies, she left films and went to live in Europe as a wealthy expatriate; she married German novelist Erich Maria Remarque in the late 1950s. She was coaxed back to the screen once more, although it was the small screen, for the television movie The Snoop Sisters: The Female Instinct (1972).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NTk1Mjg4MF5BMl5BanBnXkFtZTcwMjAxMDIzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002104","name":"Paulette Goddard","idIMDB":"nm0002104"},"actorId":"nm0002104","character":"Hannah","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maurice Moscovitch","urlProfile":"http://www.imdb.com/name/nm0608373","urlPhoto":"","biography":{"dateOfBirth":"23 November 1871","placeOfBirth":" Odessa, Kherson Governorate, Russian Empire [now Ukraine]","birthName":"Morris Maaskov","bio":"Maurice Moscovitch was born on November 23, 1871 in Odessa, Kherson Governorate, Russian Empire as Morris Maaskov. He was an actor, known for The Great Dictator (1940), Love Affair (1939) and Make Way for Tomorrow (1937). He died on June 18, 1940 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0608373","name":"Maurice Moscovitch","idIMDB":"nm0608373"},"actorId":"nm0608373","character":"Mr. Jaeckel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emma Dunn","urlProfile":"http://www.imdb.com/name/nm0242562","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmZjZWU2NmEtYWIzOS00YjBkLTg3NmUtNWE1MzdmZTY3YzQ2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 February 1874","placeOfBirth":" Cheshire, England, UK","height":"5' 8½\" (1.74 m)","bio":"Emma Dunn was a much noted stage actress before turning to films. She worked with such theatre luminaries as Richard Mansfield, Frances Starr, James Ellison and Blanche Yurka. She appeared in 3 productions under the direction of the legendary David Belasco. Miss Dunn also authored 2 books regarding diction and voice quality.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmZjZWU2NmEtYWIzOS00YjBkLTg3NmUtNWE1MzdmZTY3YzQ2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0242562","name":"Emma Dunn","idIMDB":"nm0242562"},"actorId":"nm0242562","character":"Mrs. Jaeckel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bernard Gorcey","urlProfile":"http://www.imdb.com/name/nm0329827","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmIwZDlkYTAtNWU0MS00MmQ5LWExODEtMTM4OTAyNTFmZDc0L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1886","placeOfBirth":" Russia","height":"4' 10\" (1.47 m)","bio":"Bernard Gorcey was born in Russia in 1888, of Swiss and Jewish descent. Around 1914, he married a Catholic, Irish lady, Josephine Condon (born 1901), and they came to the USA to work in Vaudeville. Bernard was 4' 10\" and Josie was 4' 11\" and weighed 95 pounds. Bernard kept active in show biz, while Josie would stay home to have and raise their kids. In 1915, 14-year-old Josie gave birth to Fred. In 1917, Leo was born -- they were very poor, Josie had cleared the kitchen table that night, because that is where Leo was born. Bernard was away doing such plays as \"Katinka\" and \"Rose-Marie.\" In 1921, David was born. Later, Bernard appeared on Broadway, in plays like \"Wild Flower\" and Oscar Hammerstein's \"Song of the Flame.\" He got the role of Isaac Cohen in Broadway's long-running \"Abie's Irish Rose\" -- he played for most of the 5 1/2 year run, from May 1922 until October 1927, at last giving him some financial stability (the play, almost autobiographically, was about the travails of a Jewish man and his Irish wife!). Bernard was later cast in the Paramount movie version of \"Abie's Irish Rose\" (1929). He also did some radio work also, for the \"Popeye\" show. The Great Depression started October 1929, and by 1931 it was terrible. Son Leo would later recall: \"We moved so many times during the Depression that we would have made a humming bird seem like a statue.\" In 1932, for a dime, one could see a double feature at the theatre; but many people made only 30 cents an hour (President Roosevelt's National Recovery Act raised that to 40 cents) -- and it was harder for the young: 15-year-old Leo worked for $6 a week, and David for $4 a week, when they could find work. Bernard was away from home most of the time; although he was fortunate (career-wise) to be in Broadway plays like \"The Joy of Living\" and \"Keeping Expenses Down,\" his marriage was falling apart. Josie then developed a relationship with a gigolo (he spent a lot of money on Josie, none of it his; ultimately he forged a check with Bernard's name on it). Josie then fell for a guy who said he was an opera singer; she married him and found out he hadn't sung in opera for 15 years -- but he made 60 cents an hour, and got her pregnant with her first daughter. For a long spell, Bernard had deserted his sons. In 1935, he reconciled with Leo and David, telling them he was sorry he hadn't visited or sent any money in ages, and urged them to try out for the stage play \"Dead End\"; (in 1937 this was made into a movie, and Leo was one of the busiest actors for the next 20 years). Bernard worked the New York stage with plays such as \"The Creeping Fire.\" In 1937, \"Abie's Irish Rose\" was revived, and Bernard played Isaac Cohen again. At age 52, Bernard started his second career, movies, in earnest. Beginning in 1940, he appeared in 55 movies, 44 of them with his sons Leo and David (most of them Bowery Boys films). Bernard had finally established the father/son relationship that he hadn't given them in their younger years. From 1946 through 1955, there were 4-5 Bowery Boys movies every year, and Bernard always played the part of Louie Dumbrowski. On August 31, 1955, his car collided with a bus at 4th & LaBrea, Los Angeles; he died of his injuries on September 11, 1955.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmIwZDlkYTAtNWU0MS00MmQ5LWExODEtMTM4OTAyNTFmZDc0L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0329827","name":"Bernard Gorcey","idIMDB":"nm0329827"},"actorId":"nm0329827","character":"Mr. Mann","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Weigel","urlProfile":"http://www.imdb.com/name/nm0917837","urlPhoto":"","biography":{"dateOfBirth":"18 February 1867","placeOfBirth":" Halle an der Saale, Province of Saxony, Prussia [now Saxony-Anhalt, Germany]","height":"5' 8\" (1.73 m)","bio":"Paul Weigel was born on February 18, 1867 in Halle an der Saale, Province of Saxony, Prussia. He was an actor, known for The Great Dictator (1940), For Heaven's Sake (1926) and The Invisible Ray (1936). He died on May 25, 1951 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0917837","name":"Paul Weigel","idIMDB":"nm0917837"},"actorId":"nm0917837","character":"Mr. Agar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chester Conklin","urlProfile":"http://www.imdb.com/name/nm0174682","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MjgzMzAyMV5BMl5BanBnXkFtZTgwODczNjMwNDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1886","placeOfBirth":" Oskaloosa, Iowa, USA","birthName":"Chester Cooper Conklin","height":"5' 5\" (1.65 m)","bio":"Iowa-born Chester Conklin was raised in a coal-mining area by a devoutly religious father who hoped that his son would go into the ministry. However, Chester got the performing bug one day when he gave a recitation at a community singing festival and won first prize. Knowing his father would never approve of his desire to become a comedian, he left home. One night in St. Louis he caught a vaudeville act by the famous team of Joe Weber and Lew Fields, who were doing what was called at the time a \"German\" act. Conklin thought that he could do that act himself, and better, so he decided to develop a character patterned after his boss at the time, a Dutch baker named Schultz. Schultz had a thick accent and a very brushy \"walrus\"-type mustache, which Conklin appropriated for his new character. He managed to break into vaudeville with this act and spent several years on tour with various stock companies. Eventually he secured a job as a clown with a traveling circus. After seeing several of Mack Sennett's Keystone Kops shorts in theaters, Conklin went to the Sennett studio and applied for a job there. Sennett hired him as a Keystone Kop (at $3 a day). He stayed with Sennett for six years, and became famous for his pairing with burly comic Mack Swain in a series of \"Ambrose and Walrus\" shorts and appeared in several of Charles Chaplin's shorts for the studio (Chaplin adapted Conklin's \"walrus\" mustache as part of the costume for his \"Little Tramp\" character). Conklin was approached by Fox Films to do a series of comedy shorts, and when Sennett refused to match the offer Fox made, Conklin left Sennett and signed with Fox. He stayed with Fox for several years, then freelanced for several independent producers in a series of comedy shorts. Conklin worked steadily into the sound era, and retired from the screen in 1966. His last movie was the well-received Western comedy A Big Hand for the Little Lady (1966), in which his character was named \"Chester.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0MjgzMzAyMV5BMl5BanBnXkFtZTgwODczNjMwNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0174682","name":"Chester Conklin","nicknames":["Chet"],"idIMDB":"nm0174682"},"actorId":"nm0174682","character":"Barber's Customer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Esther Michelson","urlProfile":"http://www.imdb.com/name/nm0585116","urlPhoto":"","biography":{"dateOfBirth":"2 September 1898","placeOfBirth":" Flushing, New York, USA","bio":"Esther Michelson was born on September 2, 1898 in Flushing, New York, USA. She was an actress, known for The Great Dictator (1940), I Wouldn't Be in Your Shoes (1948) and Sullivan's Travels (1941). She died on December 24, 1965 in Encino, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0585116","name":"Esther Michelson","idIMDB":"nm0585116"},"actorId":"nm0585116","character":"Jewish Woman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hank Mann","urlProfile":"http://www.imdb.com/name/nm0003424","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTkzMDQxNTktNDg3YS00MTQ4LWIzYWUtMTNhZmUyNzJhOTYxXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 May 1887","placeOfBirth":" New York City, New York, USA","birthName":"David William Lieberman","bio":"Hank Mann was born on May 28, 1887 in New York City, New York, USA as David William Lieberman. He was an actor and director, known for Modern Times (1936), City Lights (1931) and The Great Dictator (1940). He was married to Dolly Myers Robinson, Rae Max and Estelle. He died on November 25, 1971 in South Pasadena, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTkzMDQxNTktNDg3YS00MTQ4LWIzYWUtMTNhZmUyNzJhOTYxXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003424","name":"Hank Mann","idIMDB":"nm0003424"},"actorId":"nm0003424","character":"Storm Trooper Stealing Fruit","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0032553","urlIMDB":"http://www.imdb.com/title/tt0032553","business":{"budget":{"money":"$2,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"€9,826","country":"Italy","day":"22","month":"12","year":"2002","remarks":"2 Screens re-release limited"}],"gross":[{"money":"$5,000,000 (USA)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"$11,000,000 (worldwide)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"$6,000,000 (Non-USA)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"€395,872","country":"Italy","day":"23","month":"03","year":"2003","remarks":""},{"money":"€373,127","country":"Italy","day":"02","month":"03","year":"2003","remarks":""},{"money":"€363,535","country":"Italy","day":"23","month":"02","year":"2003","remarks":""},{"money":"€345,896","country":"Italy","day":"16","month":"02","year":"2003","remarks":""},{"money":"€326,308","country":"Italy","day":"09","month":"02","year":"2003","remarks":""},{"money":"€313,660","country":"Italy","day":"02","month":"02","year":"2003","remarks":""},{"money":"€277,125","country":"Italy","day":"26","month":"01","year":"2003","remarks":""},{"money":"€238,755","country":"Italy","day":"19","month":"01","year":"2003","remarks":""},{"money":"€182,102","country":"Italy","day":"12","month":"01","year":"2003","remarks":""},{"money":"€112,359","country":"Italy","day":"05","month":"01","year":"2003","remarks":"re-release"},{"money":"€54,009","country":"Italy","day":"29","month":"12","year":"2002","remarks":"re-release"},{"money":"€9,826","country":"Italy","day":"22","month":"12","year":"2002","remarks":"re-release"}],"weekendGross":[{"money":"€2,165","country":"Italy","day":"23","month":"03","year":"2003","remarks":"2 Screens"},{"money":"€2,478","country":"Italy","day":"02","month":"03","year":"2003","remarks":"9 Screens"},{"money":"€5,989","country":"Italy","day":"23","month":"02","year":"2003","remarks":"9 Screens"},{"money":"€5,442","country":"Italy","day":"16","month":"02","year":"2003","remarks":"8 Screens"},{"money":"€8,503","country":"Italy","day":"09","month":"02","year":"2003","remarks":"8 Screens"},{"money":"€20,219","country":"Italy","day":"02","month":"02","year":"2003","remarks":"10 Screens"},{"money":"€19,642","country":"Italy","day":"26","month":"01","year":"2003","remarks":"13 Screens"},{"money":"€29,797","country":"Italy","day":"19","month":"01","year":"2003","remarks":"15 Screens"},{"money":"€39,617","country":"Italy","day":"12","month":"01","year":"2003","remarks":"14 Screens"},{"money":"€37,147","country":"Italy","day":"05","month":"01","year":"2003","remarks":"7 Screens re-release limited"},{"money":"€22,855","country":"Italy","day":"29","month":"12","year":"2002","remarks":"4 Screens re-release limited"}],"admissions":[{"money":"6,589,012","country":"France","day":"29","month":"12","year":"1959","remarks":""}],"productionDates":{"money":null,"country":null,"day":"02","month":"10","year":"1940","remarks":null},"filmingDates":[{"money":null,"country":null,"day":"09","month":"09","year":"1939","remarks":null},{"money":null,"country":null,"day":"02","month":"10","year":"1940","remarks":null}],"copyrightHolder":"Copyright © MCMXL Charles Chaplin Film Corporation (on print); © Charles Chaplin Film Corporation; 31 October 1940; LP10041 (in copyright registry)"},"technical":{"runtime":["2 hr 5 min (125 min)"],"soundMix":["Mono (RCA Sound System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["(13 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"8.5","filmingLocations":[{"location":"Agoura Hills, California, USA"}],"rated":"APPROVED","awards":[{"award":"Academy Awards, USA 1941","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Picture","names":[]},{"category":"Best Actor in a Leading Role","names":[{"name":"Charles Chaplin","id":"nm0000122","role":null}]},{"category":"Best Actor in a Supporting Role","names":[{"name":"Jack Oakie","id":"nm0642988","role":null}]},{"category":"Best Writing, Original Screenplay","names":[{"name":"Charles Chaplin","id":"nm0000122","role":null}]},{"category":"Best Music, Original Score","names":[{"name":"Meredith Willson","id":"nm0932745","role":null}]}]}]},{"award":"Jussi Awards 1974","titlesAwards":[{"titleAwardOutcome":"Won Jussi","categories":[{"category":"Best Foreign Filmmaker","names":[{"name":"Charles Chaplin","id":"nm0000122","role":null},{"name":"Modern Times","id":"tt0027977","role":null}]}]}]},{"award":"Kinema Junpo Awards 1961","titlesAwards":[{"titleAwardOutcome":"Won Kinema Junpo Award","categories":[{"category":"Best Foreign Language Film","names":[{"name":"Charles Chaplin","id":"nm0000122","role":null}]}]}]},{"award":"National Board of Review, USA 1940","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Top Ten Films","names":[]},{"category":"Best Acting","names":[{"name":"Charles Chaplin","id":"nm0000122","role":null}]}]}]},{"award":"National Film Preservation Board, USA 1997","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"","names":[]}]}]},{"award":"New York Film Critics Circle Awards 1940","titlesAwards":[{"titleAwardOutcome":"Won NYFCC Award","categories":[{"category":"Best Actor","names":[{"name":"Charles Chaplin","id":"nm0000122","role":null}]}]}]},{"award":"Satellite Awards 2004","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Satellite Award","categories":[{"category":"Best Classic DVD Release","names":[{"name":"Modern Times","id":"tt0027977","role":null},{"name":"The Gold Rush","id":"tt0015864","role":null},{"name":"Limelight","id":"tt0044837","role":null}]}]}]}],"votes":"148,244","type":"Movie","companyCreditsSimple":[{"idCompany":"co0028083","name":"Charles Chaplin Productions"}],"keywords":{"keywords":["barber","dictator","jew","battle","persecution","jewish ghetto","soldier","invasion","radio","amnesia","anti war comedy","1910s","world war one veteran","cult film","slapstick","trenches","cannon","war violence","mild violence","shotgun","bolt action rifle","world war two","world war one","chase","foot chase","combat","fistfight","brawl","machine gun","love interest","battlefield","violence","opening action scene","comic hero","hero","biplane","propaganda","looking up to the sky","speech","globe","mistaken identity","invented language","falling down stairs","anti semitism","airplane accident","1930s","good versus evil","dual role","anti war","directed by star","megalomaniac","man with no name","controversy","political satire","geofiction","fictitious country","fascist spoof","hitler spoof","funny nazi","satire","substitution","prison camp","music score composed by director","nazi","actor playing multiple roles","impostor"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:15:59"}}