{"data":{"movies":[{"title":"Butley","originalTitle":"","year":"1974","releaseDate":"19761124","directors":[{"name":"Harold Pinter","id":"nm0056217"}],"writers":[{"name":"Simon Gray","id":"nm0336957"},{"name":"Simon Gray","id":"nm0336957"}],"runtime":"129 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODAzMjQ1OV5BMl5BanBnXkFtZTYwNDI0Mjg5._V1.jpg","countries":["UK","Canada","USA"],"languages":["English"],"genres":["Drama","Romance"],"plot":"A day in the life of Ben Butley. But definitely not a day to remember for this T.S. Eliot scholar at the University of London! Let's take for example Anne, his already estranged wife: today is the day she has chosen to tell him she is leaving him for good. And for a man Butley despises into the bargain! And what about Joey Kingston, whose close friendship Ben is losing, maybe forever today...? Decidedly, all the odds are against him. Will Butley, the bitter misanthropist, the unrepentant alcoholic, the teacher who bullies his students, his friends and his colleagues - in other words the self-destructive nihilist -, survive this horrible day?","simplePlot":"An English professor finds his life crumbling around him.","actors":[{"actorName":"Alan Bates","urlProfile":"http://www.imdb.com/name/nm0000869","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3ODM4OTkwM15BMl5BanBnXkFtZTYwOTczMTI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1934","placeOfBirth":" Allestree, Derbyshire, England, UK","birthName":"Alan Arthur Bates","height":"5' 9\" (1.75 m)","bio":"Alan Bates decided to be an actor at age 11. After grammar school in Derbyshire, he earned a scholarship to the Royal Academy of Dramatic Arts in London. Following two years in the Royal Air Force, he joined the new English Stage Company at the Royal Court Theatre. His West End debut in 1956, at 22, was also the company's first production. In the same year Bates appeared in John Osborne's \"Look Back in Anger,\" a play that gave a name to a generation of postwar \"angry young men.\" It made Bates a star and launched a lifetime of his performing in works written by great modern playwrights -- Harold Pinter, Simon Gray, Storey, Bennett, Peter Shaffer and Tom Stoppard (as well as such classic playwrights as Anton Chekhov, Henrik Ibsen, August Strindberg and William Shakespeare). Four years later Bates appeared in his first film, a classic: The Entertainer (1960), in which he plays one of Laurence Olivier's sons. More than 50 film roles have followed, one of which, The Fixer (1968) (from a novel by Bernard Malamud) earned an Academy Award nomination for Bates. He married Victoria Ward in 1970. Their twin sons, Benedick and Tristan, were born in 1971. Tristan died during an asthma attack in 1990; Ward died in 1992. Bates threw himself into his work to get through these tragedies, and spoke movingly about the effects of his losses in interviews. He was the Patron of the Actors Centre in Covent Garden, London; Bates and his family endowed a theatre there in memory of Tristan Bates, who, like his father and brother, was an actor. With few exceptions, Bates performed in premium works, guided by intuition rather than by box office. For each role he created a three-dimensional, unique person; there is no stereotypical Alan Bates character. Women appreciate the sensitivity he brought to his romantic roles; gay fans appreciate his well-rounded, unstereotyped gay characters; and the intelligence, humor and detail - the smile that started in the eyes, the extra pat or squeeze, the subtle nuances he gave to his lines, his beautiful, flexible voice - are Bates hallmarks that made him special to all his admirers. The rumpled charm of his youth weathered into a softer but still attractive (and still rumpled) maturity. In his 60s Alan Bates continued to divide his time among films, theatre and television. His 1997 stage portrayal of a travel writer facing life's big questions at the bedside of his comatose wife in Simon Gray's \"Life Support\" was called \"a magnificent performance, one of the finest of his career\" (Charles Spencer, Sunday Telegraph, 10 August 97). His last two roles in New York earned critical praise and all the Best Actor awards Broadway can bestow. He was knighted in January 2003, and only a few weeks later began treatment for pancreatic cancer. He was positive that he would beat the disease, and continued to work during its course, only admitting to being \"a bit tired.\" His courage and strength were remarkable, and even in his final days his humor remained intact. After his death, there was an outpouring of affection and respect. As Ken Russell said in his Evening Standard tribute, \"The airwaves have been heavy with unstinted praise for Alan Bates since his untimely death . . . All the tributes were more than justified for one of the great actors ever to grace the screen and stage.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3ODM4OTkwM15BMl5BanBnXkFtZTYwOTczMTI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000869","name":"Alan Bates","idIMDB":"nm0000869"},"actorId":"nm0000869","character":"Ben Butley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jessica Tandy","urlProfile":"http://www.imdb.com/name/nm0001788","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NjUyODQzNV5BMl5BanBnXkFtZTcwNzA5ODgwMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1909","placeOfBirth":" Stoke Newington, London, England, UK","birthName":"Jessie Alice Tandy","height":"5' 4\" (1.63 m)","bio":"A beloved, twinkly blue-eyed doyenne of stage and screen, actress Jessica Tandy's career spanned nearly six and a half decades. In that course of time, she enjoyed an amazing film renaissance at age 80, something unheard of in a town that worships youth and nubile beauty. She was born Jessie Alice Tandy in London in 1909, the daughter of Jessie Helen (Horspool), the head of a school for mentally handicapped children, and Harry Tandy, a traveling salesman. Her parents enrolled her as a teenager at the Ben Greet Academy of Acting where she showed immediate promise. She was 16 when she made her professional bow as Sara Manderson in the play \"The Manderson Girls\", and was subsequently invited to join the Birmingham Repertory Theatre. Within a couple of years, Jessica was making a number of other debuts as well. Her first West End play was in \"The Rumour\" at the Court Theatre in 1929; her Gotham bow was in \"The Matriarch\" at the Longacre Theatre in 1930; and her initial film role was as a maid in The Indiscretions of Eve (1932). Jessica married British actor Jack Hawkins in 1932 after the couple had met performing in the play \"Autumn Crocus\" the year before. They had one daughter, Susan, before parting ways after eight years of marriage. An unconventional beauty with slightly stern-eyed and sharp, hawkish features, she was passed over for leading lady roles in films, thereby focusing strongly on a transatlantic stage career throughout the 1930s and 1940s. She grew in stature while enacting a succession of Shakespeare's premiere ladies (Titania, Viola, Ophelia, Cordelia). At the same time, she enjoyed personal successes elsewhere in such plays as \"French Without Tears\", \"Honour Thy Father\", \"Jupiter Laughs\", \"Anne of England\" and \"Portrait of a Madonna\". And then she gave life to Blanche DuBois. When Tennessee Williams' masterpiece \"A Streetcar Named Desire\" opened on Broadway on December 3, 1947, Jessica's name became forever associated with this entrancing Southern belle character. One of the most complex, beautifully drawn, and still sought-after femme parts of all time, she went on to win the coveted Tony award. Aside from introducing Marlon Brando to the general viewing public, \"Streetcar\" shot Jessica's marquee value up a thousandfold. But not in films. While her esteemed co-stars Brando, Kim Hunter and Karl Malden were given the luxury of recreating their roles in Elia Kazan's stark, black-and-white cinematic adaptation of A Streetcar Named Desire (1951), Jessica was devastatingly bypassed. Vivien Leigh, who played the role on stage in London and had already immortalized another coy, manipulative Southern belle on celluloid (Scarlett O'Hara), was a far more marketable film celebrity at the time and was signed on to play the delusional Blanche. To be fair, Leigh was nothing less than astounding in the role and went on to deservedly win the Academy Award (along with Malden and Hunter). Jessica would exact her revenge on Hollywood in later years. In 1942, she entered into a second marriage with actor/producer/director Hume Cronyn, a 52-year union that produced two children, Christopher and Tandy, the latter an actor in her own right. The couple not only enjoyed great solo success, they relished performing in each other's company. A few of their resounding theatre triumphs included the \"The Fourposter\" (1951), \"Triple Play\" (1959), \"Big Fish, Little Fish (1962), \"Hamlet\" (he played Polonius; she played Gertrude) (1963), \"The Three Sisters (1963) and \"A Delicate Balance.\" They supported together in films too, their first being The Seventh Cross (1944). In the film The Green Years (1946), Jessica, who was two years older than Cronyn, actually played his daughter! Throughout the 1950s, they built up a sturdy reputation as \"America's First Couple of the Theatre.\" In 1963, Jessica made an isolated film appearance in Alfred Hitchcock's classic The Birds (1963). Low on the pecking order at the time (pun intended), Hitchcock gave Jessica a noticeable secondary role and Jessica made the most of her brittle scenes as the high-strung, overbearing mother of Rod Taylor who witnesses horror along the California coast. It was not until the 1980s that Jessica (and Hume, to a lesser degree) experienced a mammoth comeback in Hollywood. Alongside Hume she delighted movie audiences in such enjoyable fare as Honky Tonk Freeway (1981), The World According to Garp (1982), Cocoon (1985) and *batteries not included (1987). In 1989, however, octogenarian Jessica was handed the senior citizen role of a lifetime as the prickly Southern Jewish widow who gradually forms a trusting bond with her black chauffeur in the genteel drama Driving Miss Daisy (1989). Jessica was presented with the Oscar, Golden Globe and British Film Awards, among others, for her exceptional work in the film that also won \"Best Picture\". Deemed Hollywood royalty now, she was handed the cream of the crop in elderly film parts and went on to win another Oscar nomination for Fried Green Tomatoes (1991) a couple of years later. Jessica also enjoyed some of her biggest stage hits (\"Streetcar\" notwithstanding) during her twilight years, earning two more Tony Awards for her exceptional work in \"The Gin Game\" (1977) and \"Foxfire\" (1982). Both co-starred her husband Hume and both were beautifully transferred by the couple to television. Diagnosed with ovarian cancer in 1990, Jessica bravely continued working with Emmy-winning distinction on television. She died of her illness on September 11, 1994. Her last two films, Nobody's Fool (1994) and Camilla (1994), were released posthumously.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0NjUyODQzNV5BMl5BanBnXkFtZTcwNzA5ODgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001788","name":"Jessica Tandy","idIMDB":"nm0001788"},"actorId":"nm0001788","character":"Edna Shaft","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Georgina Hale","urlProfile":"http://www.imdb.com/name/nm0354914","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWU4ZjliZTItMzM4Yy00NDBjLTgzMWEtYmQyNDA5NzFkMzhlXkEyXkFqcGdeQXVyMjIxMzMyMQ@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 August 1943","placeOfBirth":" Ilford, Essex, England, UK","bio":"Georgina Hale is an accomplished stage actress who has made many memorable forays in cinema. Most notably in the films of Ken Russell including her performance as Alma Mahler, in a wonderful and visually rich biopic on the composer Mahler (1974) which she won a BAFTA (British Academy Award) for. Two other standout performances were in Russell's notorious The Devils (1971) and the Twiggy musical The Boyfriend in which she deliciously plays Fay, camping it up, in a backstage lesbian sub plot. She has made in-joke cameos in two further Russell films: Lisztomania (1975) and Valentino (1977). Unfortunately roles were not forthcoming after her BAFTA win (who knows why?) and she made some pretty bad movie choices such as the film version of the tacky Joan Collins novel The World Is Full of Married Men (1979) and McVicar (1980) as well as the occasional stunner such as Butley (1974), written by playwright Simon Gray. Georgina has appeared in many of Gray's stage plays (many have been filmed for British television with her starring) along side Alan Bates and Glenda Jackson and continues to work in British theatre. Georgina has made many appearances as guest star in television series including: Upstairs, Downstairs (1971), The Protectors (1972), Ladykillers (1980), Minder (1979), Boon (1986), One Foot in the Grave (1990), Murder Most Horrid (1991), The Vicar of Dibley (1994), three episodes of Doctor Who (1963) and many many more. She has starred in two television series: Budgie (1971), a successful series in the seventies, and in the early nineties a cult children's series based around a witch like figure called T-Bag. Most recently she has appeared in a comic role in Preaching to the Perverted (1997) in which her character points out that sometimes one has to debase one's self to further one's career. This film may not further her career (at age 55 she does a Sharon Stone under-table leg trick) but it will add to her growing reputation as one of the UK's favorite cult actresses.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWU4ZjliZTItMzM4Yy00NDBjLTgzMWEtYmQyNDA5NzFkMzhlXkEyXkFqcGdeQXVyMjIxMzMyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0354914","name":"Georgina Hale","idIMDB":"nm0354914"},"actorId":"nm0354914","character":"Carol Heasman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Byrne","urlProfile":"http://www.imdb.com/name/nm0126250","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMTQzMTA2MF5BMl5BanBnXkFtZTcwNjQ0NjQwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 November 1943","placeOfBirth":" London, England, UK","height":"5' 9½\" (1.77 m)","bio":"Michael Byrne was born on November 7, 1943 in London, England. He is an actor, known for Indiana Jones and the Last Crusade (1989), Braveheart (1995) and Gangs of New York (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMTQzMTA2MF5BMl5BanBnXkFtZTcwNjQ0NjQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0126250","name":"Michael Byrne","idIMDB":"nm0126250"},"actorId":"nm0126250","character":"Reg Nuttall","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susan Engel","urlProfile":"http://www.imdb.com/name/nm0257146","urlPhoto":"","biography":{"dateOfBirth":"25 March 1935","placeOfBirth":" Vienna, Austria","height":"5' 9\" (1.75 m)","bio":"Susan Engel was born on March 25, 1935 in Vienna, Austria. She is an actress, known for The Cedar Tree (1976), Damage (1992) and King Lear (1971). She has been married to Sylvester Morand since 1968. They have one child.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0257146","name":"Susan Engel","idIMDB":"nm0257146"},"actorId":"nm0257146","character":"Anne Butley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Simon Rouse","urlProfile":"http://www.imdb.com/name/nm0745869","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMDIzODAzNV5BMl5BanBnXkFtZTgwNzU5OTg0MDI@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 June 1951","placeOfBirth":" Bradford, West Yorkshire, England, UK","birthName":"John Simon Rouse","bio":"Simon Rouse was born on June 24, 1951 in Bradford, West Yorkshire, England as John Simon Rouse. He is an actor, known for The Bill (1984), The Ragman's Daughter (1972) and Butley (1974). He has been married to Ann Holloway since June 24, 1979. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwMDIzODAzNV5BMl5BanBnXkFtZTgwNzU5OTg0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0745869","name":"Simon Rouse","idIMDB":"nm0745869"},"actorId":"nm0745869","character":"Gardner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard O'Callaghan","urlProfile":"http://www.imdb.com/name/nm0639972","urlPhoto":"","biography":{"dateOfBirth":"7 March 1940","placeOfBirth":" London, England, UK","birthName":"Richard Rooke","bio":"Richard O'Callaghan was born on March 7, 1940 in London, England as Richard Rooke. He is an actor, known for Watership Down (1978), Dangerous Beauty (1998) and Carry on Loving (1970).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0639972","name":"Richard O'Callaghan","idIMDB":"nm0639972"},"actorId":"nm0639972","character":"Joey Keyston","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Oliver Maguire","urlProfile":"http://www.imdb.com/name/nm0536619","urlPhoto":"","biography":{"bio":"Oliver Maguire was an actor, known for Star Wars: Episode V - The Empire Strikes Back (1980), Au nom du père (1993) and The Boxer (1997). He died on January 10, 2012 in Dalkey, County Dublin, Ireland.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0536619","name":"Oliver Maguire","idIMDB":"nm0536619"},"actorId":"nm0536619","character":"Man in the Tube","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Darien Angadi","urlProfile":"http://www.imdb.com/name/nm0029397","urlPhoto":"","biography":{"dateOfBirth":"19 March 1949","placeOfBirth":" Stoke Newington, London, England, UK","birthName":"Darien Robert Kabir Angadi","bio":"Darien Angadi was born on March 19, 1949 in Stoke Newington, London, England as Darien Robert Kabir Angadi. He was an actor, known for Antony and Cleopatra (1974), Butley (1974) and Antony & Cleopatra (1981). He died on December 5, 1981 in Haringey, London.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0029397","name":"Darien Angadi","idIMDB":"nm0029397"},"actorId":"nm0029397","character":"First Student","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Colin Haigh","urlProfile":"http://www.imdb.com/name/nm0354096","urlPhoto":"","biography":{"bio":"Colin Haigh is an actor, known for The History Boys (2006), Butley (1974) and Hamlet (2015).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0354096","name":"Colin Haigh","idIMDB":"nm0354096"},"actorId":"nm0354096","character":"Second Student","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0071260","urlIMDB":"http://www.imdb.com/title/tt0071260","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"23","month":"05","year":"1973","remarks":null},null],"copyrightHolder":"Copyright MCMLXXXIII by AFT Distributing Corporation."},"technical":{"runtime":["1 hr 34 min (94 min) (USA)","2 hr 9 min (129 min) (USA)"],"soundMix":["Mono"],"color":["Color (Eastmancolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"7.2","filmingLocations":[],"rated":"R","awards":[],"votes":"535","type":"Movie","companyCreditsSimple":[{"idCompany":"co0123627","name":"Cinévision Ltée"},{"idCompany":"co0130370","name":"The American Film Theatre"}],"keywords":{"keywords":["university","student","professor","teacher","sock","barefoot","one word title","kidney as food","kidney","tears","crying","estrangement","ruthlessness","academia","imitation","reference to edmund spenser","reference to william shakespeare","velvet jacket","vagina","unfaithfulness","tutorial","tuberculosis","train","traffic warden","threesome","indifference","telephone call","teeth","subway","south africa","song","pair of socks","sneezing","singing","singer","shoes","shaving","reference to shakespeare's the winter's tale","seminar","self hate","security system","rhodesia","reference to wordsworth","reference to william blake","reference to henry james","reference to aristotle","reading","razor","raconteur","publishing","publisher","protege","pretending to vomit","pill","pig","pigsty","office","newspaper","mother son relationship","mother daughter relationship","masters thesis","lust","love triangle","london england","literature","lie","library","liar","leeds england","lamb's kidney","job promotion","jealousy","interior decorator","interior decoration","infidelity","husband wife relationship","hay fever","hat","halitosis","gurkha","fruit","football","feather","father son relationship","father daughter relationship","falling asleep","faculty","exam","ex husband ex wife relationship","english literature","drunkenness","drink","drinking","diarrhea","dentist","dean","cutting self while shaving","coughing","contraception","cigarette smoking","canteen","butcher","briefcase","book","birth control","bathroom","baby","affair","adultery","irony","unpublished novel","teacher student relationship","shaving accident","sarcasm","pub","poetry","one day","liquor","break up","bisexual","alcoholism","divorce","school","homosexual","teaching","based on play","independent film","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:38:29"}}