{"data":{"movies":[{"title":"Hollywood Canteen","originalTitle":"","year":"1944","releaseDate":"19441231","directors":[{"name":"Delmer Daves","id":"nm0202681"}],"writers":[{"name":"Delmer Daves","id":"nm0202681"}],"runtime":"124 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNDI3MDIzOV5BMl5BanBnXkFtZTgwNzE0MjczMjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Musical","Romance"],"plot":"Two soldiers on sick leave spend three nights at the Hollywood Canteen before going back to active duty. With a little friendly help from John Garfield, Slim gets to kiss Joan Leslie, whom he has been dreaming about while in the Pacific. He meets her later at the Farmer's Market. On the third night, Slim is the millionth man into the Canteen, earning him a date with Joan. Slim thinks he's been duped when she doesn't show up at his train. Slim's buddy Sergant dances with Joan Crawford. Canteen President Bette Davis praises the canteen and the war effort. Virtually everyone Warners could spare entertains.","simplePlot":"Two soldiers on sick leave spend three nights at the Hollywood Canteen before going back to active duty. With a little friendly help from John Garfield, Slim gets to kiss Joan Leslie, whom ... ","actors":[{"actorName":"The Andrews Sisters","urlProfile":"http://www.imdb.com/name/nm1679536","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODg5ODE5NDg2Nl5BMl5BanBnXkFtZTcwOTkyMjgwOQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"The defining sister act of all time with well over 75 million records sold by which the swinging big-band era could not be better represented were the fabulous Andrews Sisters: Patty, Maxene, and LaVerne. With their precise harmonies and perfectly syncopated dance moves, the girls reached heights of worldwide fame still unattained by any group which followed. They delivered an optimistic, upbeat war campaign that instilled hope, joy and allegiance through song, comedy, and lively movement. They provided a musical security blanket to a war-torn country via records, films, radio, clubs, stages, canteens, and overseas war zones emphasized the motto that America was strong and proud...and to keep on singing and swinging! Second only to perhaps Bob Hope in commitment and extensive USO touring, the girls' profound influence extends even today with such current pop idols as Bette Midler, The Pointer Sisters, Barry Manilow, The Manhattan Transfer, The Star Sisters, and Christina Aguilera all having reinvented themselves in Andrews Sisters' style at one time or another. Unfortunately, while the adhesive harmonies of The Andrews Sisters were intricately close, their personal harmonies were more discordant. Hailing from Minnesota, eldest sister LaVerne was born on July 6, 1911, followed by Maxene on January 3, 1916, and finally Patty on February 16, 1918. Greek father Peter was a restaurateur in the Minneapolis area; their mother Ollie was a Norwegian homemaker. Childhood was mostly lost to them. The trio's musical talents were quickly identified and they started performing on the road as youngsters, entering assorted kiddie contests and often winning for their efforts. The girls grew up on the vaudeville circuit, roughing it and toughing it with various bands and orchestras. Signed by orchestra leader Leon Belasco in 1937, the girls made their very first recordings with \"There's a Lull in My Life\" (an early solo by Patty), \"Jammin'\" and \"Wake Up and Live.\" Subsequent radio work eventually led to the Decca Records label. Although LaVerne read music and was in fact an accomplished pianist, they learned by sense memory, pure instinct and a strong ear. Blonde Patty was the lively melodic leader, engulfed by the warm harmonies of auburn-haired contralto LaVerne and brunette soprano Maxene. The old Yiddish song \"Bei Mir Bist Du Schon\" was translated into English for them by Sammy Cahn and the girls walked off with their first huge hit in late 1937 (they were paid a flat fifty dollars and no royalties!). An overnight sensation upon release (it sold more than a million copies), their contract was immediately revised by Decca and throughout the rest of the decade, they recorded smash after smash -- \"The Beer Barrel Polka (Roll Out the Barrel!),\" \"Well, All Right,\" \"Hold Tight, Hold Tight\" (with Jimmy Dorsey ), \"Oh, Johnny! Oh, Johnny! Oh!,\" and their first two duets with Bing Crosby in 1939: \"Ciribiribin\" and \"Yodelin' Jive\" (both featuring jazz violinist Joe Venuti and his orchestra). The country was absolutely captivated. Universal responded in like by signing them to some of their nonsensical \"B\" musicals derived purely for escapism as the U.S. prepared itself and became embroiled in WW2. Their first appearance co-starred the zany and sometimes corny antics of The Ritz Brothers in an unflattering ditty called Argentine Nights (1940). The frizzy-bobbed trio were introduced as a sort of specialty act with the songs \"Hit the Road,\" \"Oh, He Loves Me\" and \"Rhumboogie.\" This was followed by a 1-2-3 punch back at the recording studio with their renditions of the rollicking \"Beat Me, Daddy, Eight to the Bar,\" a reinvention of the WW1 waltz \"I'll Be with You in Apple Blossom Time\" and the soft, sentimental ballad \"Mean to Me.\" Their second film was the above-average Bud Abbott - Lou Costello vehicle Buck Privates (1941), which solidly showcased the tunes \"You're a Lucky Fellow, Mr. Smith,\" \"Bounce Me Brother with a Solid Four,\" \"I'll Be with You in Apple Blossom Time,\" and their infectious signature jump hit \"Boogie Woogie Bugle Boy.\" The girls vocalized perfectly and stepped in swinging time for two other Bud Abbott - Lou Costello comedies, In the Navy (1941) and Hold That Ghost (1941). Box-office sellouts on stage and in personal appearances across the nation, they were given their own radio show in late-1944, which continued through 1946, featuring such weekly guest stars as Bing Crosby, Frank Sinatra, Bob Hope, Eddie Cantor, Bud Abbott and Lou Costello, Carmen Miranda, Judy Garland, Ethel Merman, Rudy Vallee, and many other prominent celebrities. In late-1947, CBS Radio signed the sisters as regulars on \"Club Fifteen\" (they appeared three times a week for five years with alternating hosts Bob Crosby and crooner Dick Haymes. In 1942, Universal now decided it was the right time to spruce them up and give them a bit more on-screen persona by featuring them front-and-center in what turned out to be an unfortunate string of poorly-produced \"quickies.\" In Give Out, Sisters (1942), they posed as rich society matron types out to better their careers while featuring their big hit \"Pennsylvania Polka.\" In Private Buckaroo (1942), they put on a show for servicemen singing, among others, the huge hit \"Don't Sit Under the Apple Tree with Anyone Else But Me\". The plots may have been pancake-thin but they were sure-fire morale boosters and needed war-time tension relievers. No trained actresses by any margin, the girls emanated a down-home naturalness and appeal with a comedic flair that attracted audiences coast-to-coast. In later films they played everything from \"lonely hearts\" club managers in Always a Bridesmaid (1943), to elevator operators in How's About It (1943), to war-time factory workers in Swingtime Johnny (1944)_. Universal's Follow the Boys (1944) and Paramount's Hollywood Canteen (1944) were popular all-star productions for the war effort which featured the sisters prominently. With a never-say-die flair, they finished up their Universal contract rather inauspiciously with Her Lucky Night (1945), just as WW2 had come to an end. In the post-war years, they appeared in Paramount's _Road to Rio (1948)_ with Crosby, Hope and Lamour, which was the highest-grossing film of that year. Still highly in demand in the recording studio, on radio, on stage and in clubs, they had no trouble managing. In the meantime Disney utilized the girls' voices in their cartoon features Make Mine Music (1946) and Melody Time (1948). All three girls experienced down times in their personal lives as well during the late-1940s. There were rumblings amid the group. Maxene and Patty went through painful divorces -- Maxene split with the group's manager Lou Levy; Patty lost agent and husband, Martin Melcher to singer Doris Day, their parents passed away within a year of each other, as did their mentor Jack Kapp of Decca Records. Moreover, the girls squabbled over their parents' estate shares and individual career desires. In 1953, Patty, the group's lead, declared she was going solo. LaVerne and Maxene attempted to duo for a time until Maxene attempted suicide, of a drug overdose in 1954, heartbroken over the nasty breakup of the group, although LaVerne denied the suicide attempt to reporters. The girls reunited in 1956 and worked constantly for the next decade in recording studios (Capitol and Dot), on stages throughout the world (frequently in England), and in countless guest-star television spots. LaVerne's serious illness in 1966, however, promptly ended the trio permanently. She died of cancer in May of the next year. Maxene retired shortly after and became dean of women at a Tahoe, Nevada college. Patty, ever the trouper, continued on television, in clubs and in film cameos...wherever there was an audience. In 1973, Patty and Maxene reunited for their first Broadway musical, the nostalgic \"Over Here\" (Tony-winning Janie Sell played the LaVerne counterpart)in which they performed their old standards following the show's second act; but it did little to repair the Patty/Maxene off-stage relationship, especially since LaVerne wasn't around to foster peace-making tactics, and since Maxene blamed Patty's husband, Walter Weschler, as an instigator in separating her from Patty. The estrangement would last two decades until Maxene's death in 1995. The two sisters did reunite briefly when they earned a star on the Hollywood Walk of Fame in 1987. The group was also inducted into the Vocal Group Hall of Fame in 1998. Patty sang in shows and on cruise ships while Maxene continued soloing and did quite well for a time in such musical shows as \"Pippin\" and \"Swing Time Canteen\" (the latter as late as 1995). Plagued by heart problems (she suffered a massive heart attack in 1982), she died of a second coronary on October 21, 1995. Patty remained in seclusion in her Northridge home near Los Angeles with husband Wally for years. After his death in 2010, Patty began a steady decline and died on January 30, 2013, just two weeks before her 95th birthday. Fortunately, The Andrews Sisters' perhaps exaggerated but now legendary feuding can never overshadow their exhaustive musical contributions and unparalleled success during 36 years of performing together.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODg5ODE5NDg2Nl5BMl5BanBnXkFtZTcwOTkyMjgwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1679536","name":"The Andrews Sisters","nicknames":["The Androoze Sisters"],"idIMDB":"nm1679536"},"actorId":"nm1679536","character":"The Andrews Sisters","urlCharacter":"http://www.imdb.com/character/ch0486913","main":true},{"actorName":"Jack Benny","urlProfile":"http://www.imdb.com/name/nm0000912","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwODk0MzE2MF5BMl5BanBnXkFtZTcwOTQ2NjMyNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1894","placeOfBirth":" Chicago, Illinois, USA","birthName":"Benjamin Kubelsky","height":"5' 8½\" (1.74 m)","bio":"The son of a saloonkeeper, Jack Benny (born Benny Kubelsky) began to study the violin at the age six, and his \"ineptness\" at it later become his trademark (in reality, he was a very accomplished player). When given the opportunity to play in live theatre professionally, Benny quit school and joined vaudeville. In the same theatre that Benny was working with were the very young The Marx Brothers. Their mother, Minnie Marx, wanted Benny to go on the road with them. However, this plan was foiled by his parents who would not let their 17-year-old son on the road. Having a successful vaudeville career, Benny also had a greater career on radio for \"The Jack Benny Program\". The show was one of the few successful radio programs that also became a successful television show. Benny also starred in several movies, including The Hollywood Revue of 1929 (1929), Broadway Melody of 1936 (1935), The Horn Blows at Midnight (1945) and George Washington Slept Here (1942), although he had much greater success on radio and on TV than he did on the big screen. He was good friends with Fred Allen, with whom he had a long-standing comic \"feud\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwODk0MzE2MF5BMl5BanBnXkFtZTcwOTQ2NjMyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000912","name":"Jack Benny","idIMDB":"nm0000912"},"actorId":"nm0000912","character":"Jack Benny","urlCharacter":"http://www.imdb.com/character/ch0044741","main":true},{"actorName":"Joe E. Brown","urlProfile":"http://www.imdb.com/name/nm0113873","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4ODIyNTA4M15BMl5BanBnXkFtZTYwNTk2OTI2._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 July 1892","placeOfBirth":" Holgate, Ohio, USA","birthName":"Joseph Evans Brown","height":"5' 7½\" (1.71 m)","bio":"Joe E. Brown happily claimed that he was the only youngster in show business who ran way from home to join the circus with the blessings of his parents. In 1902, the ten-year-old Brown joined a circus tumbling act called the Five Marvellous Ashtons, which toured various circuses and vaudeville theaters. Joe later began adding comedy bits into his vaudeville act and added more as it became popular. In 1920 he debuted on Broadway in an all-star review called \"Jim Jam Jems\". As he developed skits and comedy routines throughout the 1920s, he built up his confidence and his popularity soared. The same could not be said for his debut in movies. Hired for a non comedy role in The Circus Kid (1928), he played a lion tamer whose fate is death. He didn't register with the public until he signed with Warner Brothers in 1929 to do comedy roles in the film adaptations of Broadway shows such as Sally (1929) and Top Speed (1930). Joe would be well known for his loud yell, his infectious grin and his cavernous mouth. Since many of his films revolved around sports, his natural athletic ability, combined with the physical comedy, made them hits. In Local Boy Makes Good (1931), Joe played a botanist who becomes a track star. As he had briefly played semi-pro baseball, he was a natural for films like Fireman, Save My Child (1932), in which he played a pitcher who was also a fireman. Two of his biggest hits involved the game of baseball, Elmer, the Great (1933) and Alibi Ike (1935). In his contract with Warners, he had it written that he would have his own baseball team at the studio to play when he was able. Joe was one of the top ten moneymaking stars for 1933 and 1936. In 1937, he left Warners to make films for David L. Loew, and it was a disaster. Most of the films were cheaply made with poor production values, and only a few were successful. Two of the better ones were Riding on Air (1937) and The Gladiator (1938). Brown always called signing with Loew his biggest professional mistake and with Loew his popularity fell. By the end of the 1930's he was working in \"B\" material which would have been unimaginable less than five years earlier. With the advent of World War II, Joe worked tirelessly to entertain the troops while his film career floundered. Their enthusiastic response enabled Joe to overcome the death of his son, Captain Donald Brown, on a training flight. In 1947 Joe was back in the biz and back on stage in a road company tour of the comedy \"Harvey\". His first movie role in three years was as a small-town minister in the drama The Tender Years (1948). Even though he gave a good performance, it would be another three years before he was again on the big screen, in the big-budget 1951 remake of Show Boat (1951), in which he played Captain Hawks. When his film career became almost nonexistent, Joe worked on radio and in television. He starred as the clown in the drama The Buick Circus Hour (1952) from 1952 to 1953 and made guest appearances on a number of other shows in the 1950s and early 1960s. His peers regarded him as one of the few truly nice people in Hollywood (a short list of his contemporaries would include Jean Hersholt and Jack Benny). After a few small movie roles in the 1950s, he was discovered by a new generation as the millionaire Osgood Fielding III in Billy Wilder's classic Some Like It Hot (1959), uttering the last immortal line of the film, \"Well, nobody's perfect.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4ODIyNTA4M15BMl5BanBnXkFtZTYwNTk2OTI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0113873","name":"Joe E. Brown","idIMDB":"nm0113873"},"actorId":"nm0113873","character":"Joe E. Brown","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eddie Cantor","urlProfile":"http://www.imdb.com/name/nm0134662","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxOTY3NTk0NV5BMl5BanBnXkFtZTcwMDQxMjYyNw@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 January 1892","placeOfBirth":" New York City, New York, USA","birthName":"Israel Iskowitz","height":"5' 8\" (1.73 m)","bio":"Singer, songwriter (\"Merrily We Roll Along\"), comedian, author and actor, educated in public schools. He made his first public appearance in Vaudeville in 1907 at New York's Clinton Music Hall, then became a member of the Gus Edwards Gang, later touring vaudeville with Lila Lee as the team Cantor & Lee. He made Broadway stage appearances in \"Canary Cottage,\" \"Broadway Brevities of 1920,\" \"Make It Snappy,\" \"Kid Boots,\" \"Whoopee,\" \"Banjo Eyes,\" and the Ziegfeld Follies of 1917, 1918, 1919 and 1927. He had his own radio program in the 1930s, appeared often on television in the 1950s, and made many records. Joining ASCAP in 1951, and his popular-song compositions also include \"Get a Little Fun Out of Life,\" \"It's Great to Be Alive,\" and \"The Old Stage Door.\" Eddie Cantor also wrote the books \"Ziegfeld, the Great Glorifier\" and \"As I Remember Them,\" and the autobiographies \"My Life Is In Your Hands\" and \"Take My Life.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxOTY3NTk0NV5BMl5BanBnXkFtZTcwMDQxMjYyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0134662","name":"Eddie Cantor","nicknames":["Banjo Eyes","The Apostle of Pep","Ol' Banjo Eyes"],"idIMDB":"nm0134662"},"actorId":"nm0134662","character":"Eddie Cantor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kitty Carlisle","urlProfile":"http://www.imdb.com/name/nm0137634","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MzM5MTIzOF5BMl5BanBnXkFtZTcwOTExMTc0MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 September 1910","placeOfBirth":" New Orleans, Louisiana, USA","birthName":"Catherine Conn","bio":"Kitty Carlisle Hart wore a cloak of many professional and elegant colors. Actress, opera singer, Broadway performer, TV celebrity, game show panelist, patron of the arts, and, at age 95, this vital woman continued her six-decade musical odyssey with songs and reminisces in her one-woman show: \"Kitty Carlisle Hart: An American Icon,\" which toured from her beloved New York to Los Angeles. She developed pneumonia soon after her tour folded toward the end of 2006 and passed away of congestive heart failure in April of 2007. Kitty Carlisle Hart was born Catherine Conn (pronounced \"Cohen\") on September 3, 1910 in New Orleans, Louisiana, to a family of German Jewish ancestry. Her father, Dr. Joseph Conn, was a gynecologist who died when she was only ten. Her very ambitious mother, Hortense (Holzman), escorted Kitty to Europe in 1921 with the intentions of marrying her off, Grace Kelly-style, into European royalty. When that plan didn't pan out, they stayed in Europe where Kitty received her adult education in Switzerland, London, Paris and Rome. She finally zeroed in on her acting career after being accepted into London's Royal Academy of Dramatic Art, and also went on to train at the Theatre de l'Atelier in Paris. She and her mother eventually returned to New York in 1932 wherein she first apprenticed with the Bucks County Playhouse in New Hope, Pennsylvania. She attracted notice quite early in her career. Billed as Kitty Carlisle, she found radio work and made her first appearance on the musical stage in the title role of \"Rio Rita.\" The legitimately-trained singer went on to appear in a number of operettas, including 1933's \"Champagne Sec\" (as Prince Orlofsky), as well as the musical comedies \"White Horse Inn\" (1936) and \"Three Waltzes\" (1937). Her early ingénue movie career included warbling in the musical mystery Murder at the Vanities (1934), and alongside Allan Jones amidst the zany goings-on of the Marx Brothers in the classic farce A Night at the Opera (1935). She also played a love interest to Bing Crosby's in two of his lesser known musical outings Here Is My Heart (1934) and She Loves Me Not (1934). Films were not her strong suit, however, and she returned to her theatre roots. Appearing in her first dramatic productions \"French Without Tears\" and \"The Night of January 16th\" in 1938, she went on to grace a number of chic and stylish plays and musicals throughout the 40s, including \"Walk with Music (1940), \"The Merry Widow\" (1943, \"Design for Living (1943) and \"There's Always Juliet\" (1944). She subsequently performed in Benjamin Britten's 1948 American premiere of \"The Rape of Lucretia.\" In 1946, she married Pulitzer Prize-winning playwright Moss Hart and appeared in a number of his works including his classic \"The Man Who Came to Dinner\" (1949) and the witty Broadway comedy \"Anniversary Waltz\" (1954). The couple had two children. He died in 1961 and she never remarried, spending much of her existing time keeping his name alive to future generations. It was the small screen that would make Kitty a welcome household commodity. The steadfast panelist of several quiz shows in the 1950s, it was the popular game show To Tell the Truth (1956) that anointed her game show doyenne and icon. A regular panelist for some 20 years, she appeared on each and every revamped format from its 1956 inception to its 2002 syndicated version. Known for her stately presence, infectious laugh, pouffy dark Prince Valiant hairstyle, and sweeping couture gowns on the show, audiences reveled at her effortless class to these simple parlor games. She also was a substitute panelist for other popular game shows such as \"What's My Line?\" and \"I've Got a Secret.\" In later years, she became an important society maven of New York City, an avid patron and zealous supporter of the performing arts. Appointed to various state-wide councils, she was chairman of the New York State Council of the Arts in 1976 and served in that capacity for 20 years, also serving on the boards of various New York City cultural institutions. A noted lecturer, the civic-minded Carlisle Hart was active in administrative capacities as well, notably as Chairman of Governor Rockefeller's Conference on Woman (1966) and as special consultant to the Governor on women's opportunities. At one time she wrote the column \"Kitty's Calendar\" for Women's Unit News. Kitty never stopped entertaining. Making her Metropolitan debut on New Year's Eve 1966 as Prince Orlovsky in \"Die Fledermaus,\" she joined the touring production the following year. She appeared in concert with the Philadelphia Orchestra and appeared with the Boston Opera Company at one point. She added stature to a number of summer stock plays including \"Kiss Me Kate,\" \"The Marriage-Go-Round\" and her husband's \"Light Up the Sky.\" Returning to Broadway as a replacement for Dina Merrill in the 1983 revival of \"On Your Toes,\" she was later spotted in Woody Allen's Radio Days (1987) and Six Degrees of Separation (1993). Carlisle penned her autobiography, Kitty, in 1984.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MzM5MTIzOF5BMl5BanBnXkFtZTcwOTExMTc0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0137634","name":"Kitty Carlisle","idIMDB":"nm0137634"},"actorId":"nm0137634","character":"Kitty Carlisle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Carson","urlProfile":"http://www.imdb.com/name/nm0007217","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNDgzMTcxOF5BMl5BanBnXkFtZTYwMDQxMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 October 1910","placeOfBirth":" Carman, Manitoba, Canada","birthName":"John Elmer Carson","height":"6' 2\" (1.88 m)","bio":"When Jack Carson arrived in Hollywood in 1937, he found work at RKO as an extra. His first major acting role came alongside Humphrey Bogart in the romantic comedy Stand-In (1937). After a few years, he developed into a popular character actor who would be seen in a large number of comedies, musicals and a few westerns. Not happy with the direction his career was heading, he went to Warner Brothers in 1941, where the quality of his supporting roles improved. It also did not hurt to be in films that starred James Cagney, such as The Strawberry Blonde (1941) and The Bride Came C.O.D. (1941). After three years, he starred with Jane Wyman in Make Your Own Bed (1944) and, again, in The Doughgirls (1944). Jack would play the nice guy with the heart of gold who was still a nice guy even when he was angry. He would take the double take and the quizzical look to a higher level, but he could also act in dramas. He provided a good portrayal of \"Albert\" in The Hard Way (1943) and was acclaimed for his performance in Mildred Pierce (1945). However, it was comedies that provided most of his work. He teamed up with his old friend, Dennis Morgan, for several films in the tradition of Bob Hope and Bing Crosby. It was in the 1940s that Jack would become popular as a wisecracking comedian on radio. This would lead him to TV in the 1950s, where he was one of 4 rotating hosts on All Star Revue (1950), until 1951, when he had left the show and the title was changed to \"All Star Revue\". He then hosted and performed on The Colgate Comedy Hour (1950) from 1952-55. He would also help host The U.S. Royal Showcase (1952). He would appear on a number of shows during the 1950s, one of his most remembered being an episode of The Twilight Zone (1959), where he was a somewhat shady used-car salesman who came into possession of an old Model-A Ford that was \"haunted\" in that whoever owned it had to tell the truth, whether he wanted to or not. Although his movie career slowed in the 1950s, he still appeared in a number of prestige pictures, such as A Star Is Born (1954) with Judy Garland, The Tarnished Angels (1957) with Rock Hudson and Cat on a Hot Tin Roof (1958) with Paul Newman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNDgzMTcxOF5BMl5BanBnXkFtZTYwMDQxMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007217","name":"Jack Carson","nicknames":["Jackaboy","King of the Double-Take","Jack the Ribbee"],"idIMDB":"nm0007217"},"actorId":"nm0007217","character":"Jack Carson","urlCharacter":"http://www.imdb.com/character/ch0497064","main":true},{"actorName":"Dane Clark","urlProfile":"http://www.imdb.com/name/nm0163816","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMzU4OTA5MV5BMl5BanBnXkFtZTcwMDk5ODg0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 February 1912","placeOfBirth":" Brooklyn, New York, USA","height":"5' 9\" (1.75 m)","bio":"Dane Clark was born Bernard Elliot Zanville in Brooklyn, New York City, to Rose (Korostoff) and Samuel Zanville, who were Russian Jewish immigrants. He graduated from Cornell University and St. John's Law School (Brooklyn). When he had trouble finding work in the mid-1930s he tried boxing, baseball, construction, sales and modeling, among other jobs. From there he went into acting on Broadway (\"Dead End\", \"Stage Door\", \"Of Mice and Men\"), which finally brought him to Hollywood. He acted under his own name until 1943 when, as Dane Clark (a name he said was given him by Humphrey Bogart), he took the role of sailor Johnnie Pulaski in Warner's Action in the North Atlantic (1943), a wartime tribute to the Merchant Marine. He was a regular in World War II movies, playing the part of a submariner in Destination Tokyo (1943), an airman in God Is My Co-Pilot (1945) and a Marine in Pride of the Marines (1945). Though he co-starred with such luminaries as Bogart, Cary Grant, Bette Davis and Raymond Massey, it was his self-described \"Joe Average\" image that got him his parts: \"They don't go much for the 'pretty boy' type [at Warner Brothers]. An average-looking guy like me has a chance to get someplace, to portray people the way they really are, without any frills.\" He was also proud of his role as Abe Saperstein, who founded the Harlem Globetrotters black basketball team, in Go Man Go (1954), a film he believed pioneered in opposing race hatred.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMzU4OTA5MV5BMl5BanBnXkFtZTcwMDk5ODg0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0163816","name":"Dane Clark","nicknames":["Brooklyn","Joe Average"],"idIMDB":"nm0163816"},"actorId":"nm0163816","character":"Sgt. Nowland","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joan Crawford","urlProfile":"http://www.imdb.com/name/nm0001076","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNzQ5Mjg5MF5BMl5BanBnXkFtZTYwNTg0NDM2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 March 1906","placeOfBirth":" San Antonio, Texas, USA","birthName":"Lucille Fay LeSueur","height":"5' 3\" (1.6 m)","bio":"Joan Crawford was born Lucille Fay LeSueur on March 23, 1905, in San Antonio, Texas, to Anna Belle (Johnson) and Thomas E. LeSueur, a laundry laborer. By the time she was born, her parents had separated, and by the time she was a teenager, she'd had three stepfathers. It wasn't an easy life; Crawford worked a variety of menial jobs. She was a good dancer, though, and -- perhaps seeing dance as her ticket to a career in show business -- she entered several contests, one of which landed her a spot in a chorus line. Before long, she was dancing in big Midwestern and East Coast cities. After almost two years, she packed her bags and moved to Hollywood. Crawford was determined to succeed, and shortly after arriving she got her first bit part, as a showgirl in Pretty Ladies (1925). Three films quickly followed; although the roles weren't much to speak of, she continued toiling. Throughout 1927 and early 1928, she was cast in small parts, but that ended with the role of Diana Medford in Our Dancing Daughters (1928), which elevated her to star status. Crawford had cleared the first big hurdle; now came the second, in the form of talkies. Many stars of the silents saw their careers evaporate, either because their voices weren't particularly pleasant or because their voices, pleasing enough, didn't match the public's expectations (for example, some fans felt that John Gilbert's tenor didn't quite match his very masculine persona). But Crawford wasn't felled by sound. Her first talkie, Untamed (1929), was a success. As the 1930s progressed, Crawford became one of the biggest stars at MGM. She was in top form in films such as Grand Hotel (1932), Sadie McKee (1934), No More Ladies (1935), and Love on the Run (1936); movie patrons were enthralled, and studio executives were satisfied. By the early 1940s, MGM was no longer giving her plum roles; newcomers had arrived in Hollywood, and the public wanted to see them. Crawford left MGM for rival Warner Bros., and in 1945 she landed the role of a lifetime. Mildred Pierce (1945) gave her an opportunity to show her range as an actress, and her performance as a woman driven to give her daughter everything garnered Crawford her first, and only, Oscar for Best Actress. The following year she appeared with John Garfield in the well-received Humoresque (1946). In 1947, she appeared as Louise Graham in Possessed (1947); again she was nominated for a Best Actress from the Academy, but she lost to Loretta Young in The Farmer's Daughter (1947). Crawford continued to choose her roles carefully, and in 1952 she was nominated for a third time, for her depiction of Myra Hudson in Sudden Fear (1952). This time the coveted Oscar went to Shirley Booth, for Come Back, Little Sheba (1952). Crawford's career slowed after that; she appeared in minor roles until 1962, when she and Bette Davis co-starred in What Ever Happened to Baby Jane? (1962). Their longstanding rivalry may have helped fuel their phenomenally vitriolic and well-received performances. (Earlier in their careers, Davis said of Crawford, \"She's slept with every male star at MGM except Lassie,\" and Crawford said of Davis, \"I don't hate [her] even though the press wants me to. I resent her. I don't see how she built a career out of a set of mannerisms instead of real acting ability. Take away the pop eyes, the cigarette, and those funny clipped words, and what have you got? She's phony, but I guess the public really likes that\".) Crawford's final appearance on the silver screen was in a flop called Trog (1970). Turning to vodka more and more, she was hardly seen afterward. On May 10, 1977, Joan died of cancer in New York City. She was 72 years old. She had disinherited her adopted daughter Christina and son Christopher; the former wrote a tell-all book called \"Mommie Dearest\", published in 1978. The book cast Crawford in a negative light and was cause for much debate, particularly among her friends and acquaintances, including Douglas Fairbanks Jr., Crawford's first husband. (In 1981, Faye Dunaway starred in Mommie Dearest (1981) which did well at the box office.) Crawford is interred in the same mausoleum as fellow MGM star Judy Garland, in Ferncliff Cemetery in Hartsdale, New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNzQ5Mjg5MF5BMl5BanBnXkFtZTYwNTg0NDM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001076","name":"Joan Crawford","nicknames":["Billie Cassin","Cranberry","Billie"],"idIMDB":"nm0001076"},"actorId":"nm0001076","character":"Joan Crawford","urlCharacter":"http://www.imdb.com/character/ch0025473","main":true},{"actorName":"Helmut Dantine","urlProfile":"http://www.imdb.com/name/nm0200626","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGU3YmNiMTUtNDFjYy00Njg4LWI5ZDgtYjQzODk0Mzg0ZjBiXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 October 1918","placeOfBirth":" Vienna, Austria-Hungary [now Austria]","birthName":"Helmut Guttman","height":"6' (1.83 m)","bio":"Actor/director/producer Helmut Dantine was born in Vienna, Austria on October 7, 1917. He made a name for himself as an actor during World War Two playing German soldiers and Nazi villains in Hollywood films, most notably in Mrs. Miniver (1942). The young Dantine was a fervent anti-fascist/anti-Nazi activist in Vienna. As a leader in the anti-Nazi youth movement the 19-year old was summarily rounded up and imprisoned at the Rosserlaende concentration camp. Family influence persuaded a physician to grant him a medical release that June and he was immediately sent to Los Angeles to stay with the only friend they had in America. Dantine joined the Pasadena Playhouse, where he was spotted by a Warner Bros. talent scout who was struck by Dantine's dark good looks. Signed to a Warner's contract, he appeared in a variety of films after making his debut as a Nazi in International Squadron (1941) starring Ronald Reagan. He played supporting, second lead and eventually, lead roles in such films as Casablanca (1942) (where he was the newlywed who gambles away his visa money), Edge of Darkness (1943) (his first lead), the infamous Mission to Moscow (1943) and Passage to Marseille (1944). Two of his best films came on loan-out from Warners in 1942: Ernst Lubitsch's comic masterpiece To Be or Not to Be (1942) and William Wyler's Oscar-winning Mrs. Miniver (1942). Dantine directed the the unsuccessful Thundering Jets (1958). His wife, Niki Dantine, was the daughter of Loew's president Nicholas Schenck, the overall boss of Metro-Goldwyn-Mayer -- ostensibly the most powerful man in Hollywood since 1927. After Schenck was forced out of Loew's, the wily old movie veteran formed his own production and distribution company. In 1959, Dantine's acting career was on the wane and his attempt to become a director a relative failure, he became a producer. He was appointed vice-president of his father-in-law's Schenck Enterprises, eventually becoming president of the company in 1970. Dantine produced three minor Sam Peckinpah films in the mid-1970s, including Bring Me the Head of Alfredo Garcia (1974) and The Killer Elite (1975) in both of which,he had small supporting roles. Helmut Dantine died on May 2, 1982, at age 63, in Beverly Hills after suffering a massive heart attack. His body was interred at Westwood Memorial Park in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGU3YmNiMTUtNDFjYy00Njg4LWI5ZDgtYjQzODk0Mzg0ZjBiXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0200626","name":"Helmut Dantine","idIMDB":"nm0200626"},"actorId":"nm0200626","character":"Helmut Dantine","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bette Davis","urlProfile":"http://www.imdb.com/name/nm0000012","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2OTQ4NTU2OF5BMl5BanBnXkFtZTcwMzI3MjY5Ng@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 April 1908","placeOfBirth":" Lowell, Massachusetts, USA","birthName":"Ruth Elizabeth Davis","height":"5' 3\" (1.6 m)","bio":"Ruth Elizabeth Davis was born April 5, 1908, in Lowell, Massachusetts, to Ruth Augusta (Favor) and Harlow Morrell Davis, a patent attorney. Her parents divorced when she was 10. She and her sister were raised by their mother. Her early interest was dance. To Bette, dancers led a glamorous life, but then she discovered the stage, and gave up dancing for acting. To her, it presented much more of a challenge. After graduation from Cushing Academy, she was refused admittance to Eva Le Gallienne's Manhattan Civic Repertory. She enrolled in John Murray Anderson's Dramatic School and was the star pupil. She was in the off-Broadway play \"The Earth Between\" (1923), and her Broadway debut in 1929 was in \"Broken Dishes\". She also appeared in \"Solid South\". Late in 1930, she was hired by Universal, where she made her first film, called Way Back Home (1931). When she arrived in Hollywood, the studio representative who went to meet her train left without her because he could find no one who looked like a movie star. An official at Universal complained she had \"as much sex appeal as Slim Summerville\" and her performance in The Bad Sister (1931) didn't impress. In 1932, she signed a seven-year deal with Warner Brothers Pictures. Her first film with them was Seed (1931). She became a star after her appearance in The Man Who Played God (1932), known as the actress that could play a variety of very strong and complex roles. More fairly successful movies followed, but it was the role of Mildred Rogers in RKO's Of Human Bondage (1934) that would give Bette major acclaim from the film critics. She had a significant number of write-in votes for the Best Actress Oscar, but didn't win. Warner Bros. felt their seven-year deal with Bette was more than justified. They had a genuine star on their hands. With this success under her belt, she began pushing for stronger and more meaningful roles. In 1935, she received her first Oscar for her role in Dangerous (1935) as Joyce Heath. In 1936, she was suspended without pay for turning down a role that she deemed unworthy of her talent. She went to England, where she had planned to make movies, but was stopped by Warner Bros. because she was still under contract to them. They did not want her to work anywhere. Although she sued to get out of her contract, she lost. Still, they began to take her more seriously after that. Returning after losing her lawsuit, her roles improved dramatically. In 1938, Bette received a second Academy Award nomination for her work in Jezebel (1938) opposite the soon-to-be-legendary Henry Fonda. The only role she didn't get that she wanted was Scarlett O'Hara in Gone with the Wind (1939). Warners wouldn't loan her to David O. Selznick unless he hired Errol Flynn to play Rhett Butler, which both Selznick and Davis thought was a terrible choice. It was rumored she had numerous affairs, among them George Brent and William Wyler, and she was married four times, three of which ended in divorce. She admitted her career always came first. She made many successful films in the 1940s, but each picture was weaker than the last and by the time her Warner Brothers contract had ended in 1949, she had been reduced to appearing in such films as the unintentionally hilarious Beyond the Forest (1949). She made a huge comeback in 1950 when she replaced an ill Claudette Colbert in, and received an Oscar nomination for, All About Eve (1950). She worked in films through the 1950s, but her career eventually came to a standstill, and in 1961 she placed a now famous Job Wanted ad in the trade papers. She received an Oscar nomination for her role as a demented former child star in What Ever Happened to Baby Jane? (1962). This brought about a new round of super-stardom for generations of fans who were not familiar with her work. Two years later, she starred in Hush...Hush, Sweet Charlotte (1964). Bette was married four times. In 1977 she received the AFI's Lifetime Achievement Award and in 1979 she won a Best Actress Emmy for Strangers: The Story of a Mother and Daughter (1979). In 1977-78 she moved from Connecticut to Los Angeles and filmed a pilot for the series Hotel (1983), which she called Brothel. She refused to do the TV series and suffered a stroke during this time. Her last marriage, to actor Gary Merrill, lasted ten years, longer than any of the previous three. In 1985, her daughter Barbara Davis (\"B.D.\") Hyman published a scandalous book about Bette called \"My Mother's Keeper.\" Bette worked in the later 1980s in films and TV, even though a stroke had impaired her appearance and mobility. She wrote a book, \"This 'N That\", during her recovery from the stroke. Her last book was \"Bette Davis, The Lonely Life\", issued in paperback in 1990. It included an update from 1962 to 1989. She wrote the last chapter in San Sebastian, Spain. Sadly, Bette Davis died on October 6, 1989, of metastasized breast cancer, in Neuilly-sur-Seine, Hauts-de-Seine, France. Many of her fans refused to believe she was gone.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2OTQ4NTU2OF5BMl5BanBnXkFtZTcwMzI3MjY5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000012","name":"Bette Davis","nicknames":["The Fourth Warner Brother","The First Lady of Film"],"idIMDB":"nm0000012"},"actorId":"nm0000012","character":"Bette Davis","urlCharacter":"http://www.imdb.com/character/ch0082752","main":true},{"actorName":"Faye Emerson","urlProfile":"http://www.imdb.com/name/nm0256207","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjdhZmQ3N2YtMTY5ZS00MWQzLTgxMjEtN2Q5NDdkYTU4N2NlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1917","placeOfBirth":" Elizabeth, Louisiana, USA","birthName":"Faye Margaret Emerson","height":"5' 4\" (1.63 m)","bio":"Synonymous with chic, the ever-fashionable Faye Emerson certainly qualified as one of the \"first ladies\" of TV glamor. Bedecked in sweeping, rather low-cut gowns and expensive, dangling jewelry, she was a highly poised and stylish presence on the small screen during its exciting \"Golden Age\". An enduring presence throughout the 1950s, she could have lasted much longer in her field of work had she so desired. Born in 1917 in Elizabeth, Louisiana, her father was both a rancher and court stenographer. The family subsequently lived in Texas and Illinois before settling in California. Her parents divorced after she entered her teens and she went to live with her mother (and new husband) in San Diego where she was subsequently placed in a convent boarding school. Following graduation from high school, she attended San Diego State College and grew interested in acting, performing in several Community Players productions. She made her stage debut with \"Russet Mantle\" in 1935. Her first marriage to a San Diego car dealer, William Crawford, was short-lived, but produced one child before it ended in 1942. Both Paramount and Warner Bros. talent scouts spotted her in a 1941 San Diego production of \"Here Today\" and were impressed, offering her contracts. She decided on Warner Bros. and began uncredited in such films as Manpower (1941) and Blues in the Night (1941). During her five-year tenure at Warners she progressed to a variety of swanky secondary and co-star roles in such \"B\" war-era movies as Murder in the Big House (1942) starring Van Johnson, Air Force (1943) with Gig Young, The Desert Song (1943) starring Dennis Morgan, The Mask of Dimitrios (1944) with Peter Lorre, Between Two Worlds (1944) with John Garfield, The Very Thought of You (1945) (again) with Dennis Morgan, Hotel Berlin (1945) starring Helmut Dantine, Danger Signal (1945) with Zachary Scott, and Nobody Lives Forever (1946) (again) starring John Garfield. A large portion of the roles she received were interesting at best. For the most part, however, Faye was caught in glittery roles that were submerged in \"men's pictures\". At this juncture, Faye was probably better known as Mrs. Elliott Roosevelt, the fourth child of Franklin and Eleanor Roosevelt, whom she married in 1944. Her husband was a war hero and author and the couple lived in the White House for a spell (FDR died in 1945). Faye abruptly abandoned the Hollywood scene after her marriage and the couple instead became major figures in the New York social scene. Sometime after the war Elliott and Faye entered the Soviet Union as journalists where they interviewed Joseph Stalin for a national publication. With her movie career on the outs, the recently-transplanted New Yorker made her Broadway debut in \"The Play's the Thing\" (1948), then entered the world of television where she truly found her niche. Managing to combine both beauty and brains, Faye was a sparkling actress of both drama and comedy and a stylish, Emmy-nominated personality who became an emcee on Paris Cavalcade of Fashions (1948); a hostess of her own show The Faye Emerson Show (1950); a moderator of Author Meets the Critics (1947); and a regular panelist on the game shows Masquerade Party (1952) and I've Got a Secret (1952). In addition she enjoyed time as a TV columnist, appeared on such covers as Look magazine, and was performed as guest host for other permanent TV headliners such as Garry Moore, Dave Garroway and even Edward R. Murrow on his \"Person to Person\" vehicle. All the while Faye continued to return sporadically to the stage and added to her array of Broadway credits such shows as \"Parisenne\" (1950), \"Heavenly Twins (1955), \"Protective Custody\" (1956) and \"Back to Methuselah\" (1958), the last mentioned pairing her with Tyrone Power. Regional credits included \"Goodbye, My Fancy\", \"State of the Union\", \"The Pleasure of His Company\", \"Mary Stuart\", \"Elizabeth the Queen\" and \"The Vinegar Tree\". One highlight was gracing the stage alongside such illustrious stage stars as Eva Le Gallienne, Viveca Lindfors and Basil Rathbone in the 1953 production of \"An Evening with Will Shakespeare\". Divorced from Roosevelt in 1950, her third (and final) marriage also would figure prominently in the public eye. She wed popular TV band leader Skitch Henderson shortly after her second divorce was final. The couple went on to co-host a 15-minute music show Faye and Skitch (1953) together. This union would last seven years. Faye was a welcomed as a guest panelist on other game fun too such as \"To Tell the Truth\" and \"What's My Line?\". The actress, once dubbed the \"Best-Dressed Woman on TV,\" focused on traveling in the early part of the 1960s and never returned actively to Hollywood. For nearly two decades she lived completely out of the limelight in and around Europe, including Switzerland and Spain, returning to America very infrequently and only for business purposes. She died of stomach cancer in 1983 in Majorca, Spain.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjdhZmQ3N2YtMTY5ZS00MWQzLTgxMjEtN2Q5NDdkYTU4N2NlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0256207","name":"Faye Emerson","idIMDB":"nm0256207"},"actorId":"nm0256207","character":"Faye Emerson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victor Francen","urlProfile":"http://www.imdb.com/name/nm0289858","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjQ5OGU2MmYtYmI1Ny00NWNiLWI3NmYtMjk1YWVjYTk0MDI5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1888","placeOfBirth":" Tienen, Flanders, Belgium","birthName":"Victor Franssen","bio":"Victor Francen was born on August 5, 1888 in Tienen, Flanders, Belgium as Victor Franssen. He was an actor, known for La fin du jour (1939), Hold Back the Dawn (1941) and Hell and High Water (1954). He was married to Eleanor Kreutzer, Renée Corciade and Mary Marquet. He died on November 18, 1977 in Aix-en-Provence, Bouches-du-Rhône, France.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjQ5OGU2MmYtYmI1Ny00NWNiLWI3NmYtMjk1YWVjYTk0MDI5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0289858","name":"Victor Francen","idIMDB":"nm0289858"},"actorId":"nm0289858","character":"Victor Francen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Garfield","urlProfile":"http://www.imdb.com/name/nm0002092","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjRiZGFiNzctOGU2Ni00Y2M3LWJiMDUtNGY2NTRjNWYyYmM1XkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1913","placeOfBirth":" New York City, New York, USA","birthName":"Jacob Julius Garfinkle","height":"5' 7\" (1.7 m)","bio":"John Garfield was born Jacob Julius Garfinkle on the Lower East Side of New York City, to Hannah Basia (Margolis) and David Garfinkle, who were Jewish immigrants from Zhytomyr (now in Ukraine). Jules was raised by his father, a clothes presser and part-time cantor, after his mother's death in 1920, when he was 7. He was sent to a special school for problem children, where he was introduced to boxing and drama. He won a scholarship to Maria Ouspenskaya's drama school. He joined the Civic Repertory Theatre in 1932, changing his name to Jules Garfield and making his Broadway debut in that company's Counsellor-at-Law. Joined the Group Theatre company, winning acclaim for his role in Awake and Sing. Embittered over being passed over for the lead in Golden Boy, which was written for him, he signed a contract with Warner Brothers, who changed his name to John Garfield. Won enormous praise for his role of the cynical Mickey Borden in Four Daughters (1938). Appeared in similar roles throughout his career despite his efforts to play varied parts. Children Katherine (1938-1945), David Garfield (1942-1995) and Julie Garfield (1946-). Active in liberal political and social causes, he found himself embroiled in Communist scare of the late 1940s. Though he testified before Congress that he was never a Communist, his ability to get work declined. While separated from his wife, he succumbed to long-term heart problems, dying suddenly in the home of a woman friend at 39. His funeral was mobbed by thousands of fans, in the largest funeral attendance for an actor since Rudolph Valentino.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjRiZGFiNzctOGU2Ni00Y2M3LWJiMDUtNGY2NTRjNWYyYmM1XkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002092","name":"John Garfield","nicknames":["Julie"],"idIMDB":"nm0002092"},"actorId":"nm0002092","character":"John Garfield","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sydney Greenstreet","urlProfile":"http://www.imdb.com/name/nm0002113","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU1MDc1NTc4MF5BMl5BanBnXkFtZTcwNTA5NDYwOA@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 December 1879","placeOfBirth":" Sandwich, Kent, England, UK","birthName":"Sydney Hughes Greenstreet","height":"5' 9\" (1.75 m)","bio":"Sydney Greenstreet's father was a leather merchant with eight children. Sydney left home at age 18 to make his fortune as a Ceylon tea planter, but drought forced him out of business and back to England. He managed a brewery and, to escape boredom, took acting lessons. His stage debut was as a murderer in a 1902 production of \"Sherlock Holmes\". From then on he appeared in numerous plays in England and the US, working through most of the 1930s with Alfred Lunt and Lynn Fontanne at the Theatre Guild. His parts ranged from musical comedy to Shakespeare. His film debut, occurring when he was 62 years old and weighing nearly 300 pounds, was as Kasper Guttman in the classic The Maltese Falcon (1941), with Humphrey Bogart and Peter Lorre. He teamed with Lorre in eight more movies after that. In eight years he made 24 films, all while beset by diabetes and Bright's disease. In 1949 he retired from films, and died four years later. He was 75.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU1MDc1NTc4MF5BMl5BanBnXkFtZTcwNTA5NDYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002113","name":"Sydney Greenstreet","idIMDB":"nm0002113"},"actorId":"nm0002113","character":"Sydney Greenstreet","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alan Hale","urlProfile":"http://www.imdb.com/name/nm0002118","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0ODAzMTc1MTheQTJeQWpwZ15BbWU3MDkxNjI2MDg@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1892","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Rufus Edward MacKahan","height":"6' 2\" (1.88 m)","bio":"Alan Hale decided on a film career after his attempt at becoming an opera singer didn't pan out. He quickly became much in demand as a supporting actor, starred in several films for Cecil B. DeMille and directed others for him. With the advent of sound Hale played leads in a few films, but soon settled down into a career as one of the busiest character actors in the business. He was one of the featured members of what became known as the \"Warner Brothers Stock Co.\", a corps of character actors and actresses who appeared in scores of Warner Bros. films of the 1930s and 1940s. Hale's best known role is probably in The Adventures of Robin Hood (1938), one of several films he made with his friend Errol Flynn, in which he played Little John, a role he played in two other films - Robin Hood (1922) and Rogues of Sherwood Forest (1950).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA0ODAzMTc1MTheQTJeQWpwZ15BbWU3MDkxNjI2MDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002118","name":"Alan Hale","idIMDB":"nm0002118"},"actorId":"nm0002118","character":"Alan Hale","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0036922","urlIMDB":"http://www.imdb.com/title/tt0036922","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"05","month":"06","year":"1944","remarks":null},"filmingDates":[{"money":null,"country":null,"day":"05","month":"06","year":"1944","remarks":null},{"money":null,"country":null,"day":"31","month":"08","year":"1945","remarks":null}],"copyrightHolder":"Copyright MCMXLIV Warner Bros. Pictures Inc. (on print); © Warner Bros. Pictures Inc.; 6 January 1945; LP13034 (in copyright registry)"},"technical":{"runtime":["2 hr 4 min (124 min)"],"soundMix":["Mono (RCA Sound System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["3,400 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.3","filmingLocations":[{"location":"Hollywood, Los Angeles, California, USA"}],"rated":"APPROVED","awards":[{"award":"Academy Awards, USA 1945","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Sound, Recording","names":[{"name":"Nathan Levinson","id":"nm0506080","role":"Warner Bros. SSD"}]},{"category":"Best Music, Original Song","names":[{"name":"M.K. Jerome","id":"nm0422031","role":"music"},{"name":"Ted Koehler","id":"nm0462752","role":"lyrics"}]},{"category":"Best Music, Scoring of a Musical Picture","names":[{"name":"Ray Heindorf","id":"nm0006127","role":null}]}]}]}],"votes":"1,396","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."}],"keywords":{"keywords":["kiss","soldier","hollywood","reference to ronald reagan","horse","shore leave","obsessed fan","hollywood sign","purple heart","starstruck","hollywoodland","dancing horse","sound stage","studio backlot"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:26:02"}}