{"data":{"movies":[{"title":"The League of Gentlemen","originalTitle":"","year":"1960","releaseDate":"19600415","directors":[{"name":"Basil Dearden","id":"nm0213136"}],"writers":[{"name":"John Boland","id":"nm0092675"},{"name":"Bryan Forbes","id":"nm0285302"}],"runtime":"116 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmM4YzcxYjEtMDU0ZC00NDcyLTg4ZDctMjE0MGEwYWRlOWQzL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Comedy","Crime","Thriller"],"plot":"Involuntarily-retired Colonel Hyde recruits seven other dissatisfied ex-servicemen for a special project. Each of the men has a skeleton in the cupboard, is short of money, and is a service-trained expert in his field. The job is a bank robbery, and military discipline and planning are imposed by Hyde and second-in-command Race on the team, although civilian irritations do start getting in the way.","simplePlot":"A disgruntled veteran recruits a group of disgraced colleagues to perform a bank robbery with military precision.","actors":[{"actorName":"Jack Hawkins","urlProfile":"http://www.imdb.com/name/nm0370144","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MTk0NzI5OF5BMl5BanBnXkFtZTcwNTI1NjQwOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1910","placeOfBirth":" Wood Green, London, England, UK","birthName":"John Edward Hawkins","height":"5' 11\" (1.81 m)","bio":"In Britain, special Christmas plays called pantomimes are produced for children. Jack Hawkins made his London theatrical debut at age 12, playing the elf king in \"Where The Rainbow Ends\". At 17, he got the lead role of St. George in the same play. At 18, he made his debut on Broadway in \"Journey's End\". At 21, he was back in London playing a young lover in \"Autumn Crocus\". He married his leading lady, Jessica Tandy. That year he also played his first real film role in the 1931 sound version of Alfred Hitchcock's The Phantom Fiend (1932). During the 30s, he took his roles in plays more seriously than the films he made. In 1940, Jessica accepted a role in America and Jack volunteered to serve in the Royal Welsh Fusiliers. He spent most of his military career arranging entertainment for the British forces in India. One of the actresses who came out to India was Doreen Lawrence who became his second wife after the war. Alexander Korda advised Jack to go into films and offered him a three-year contract. In his autobiography, Jack recalled: \"Eight years later I was voted the number one box office draw of 1954. I was even credited with irresistible sex appeal, which is another quality I had not imagined I possessed.\" A late 1940s film, The Black Rose (1950), where he played a secondary role to Tyrone Power, would be one of his most fortunate choices of roles. The director was Henry Hathaway who Jack said was \"probably the most feared, yet respected director in America, for he had a sharp tongue and fired people at the drop of a hat. Years later, after my operation when I lost my voice, he went out of his way to help me get back into films. What I did not know was that during the filming of 'The Black Rose' he was himself suffering from cancer.\" In the 1950s came the film that made Hawkins a star, The Cruel Sea (1953). Suffering from life long real life sea sickness, he played the captain of the Compass Rose. After surgery for throat cancer in 1966, requiring the removal of his larynx, Jack continued to make films. He mimed his lines and the voice was dubbed by either Charles Gray or Robert Rietty. His motto during those last years came from Milton's \"Comus\", a verse play in which he acted early in his career in Regent's Park. The lines: \"Yet where an equal poise of hope and fear does arbitrate the event, my nature is that I incline to hope, rather than to fear.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MTk0NzI5OF5BMl5BanBnXkFtZTcwNTI1NjQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0370144","name":"Jack Hawkins","idIMDB":"nm0370144"},"actorId":"nm0370144","character":"Col. Norman Hyde","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nigel Patrick","urlProfile":"http://www.imdb.com/name/nm0665902","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjkzY2M0ZDAtMzkzNi00NTYzLTlmOTEtMDFiZjkwMGFhYTUyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 May 1912","placeOfBirth":" Wandsworth, London, England, UK","birthName":"Nigel Dennis Patrick Wemyss-Gorman","height":"5' 11\" (1.8 m)","bio":"This droll, dry-witted London-born gent came from a family of actors. He made his stage debut in 1932 and established his reputation in stylish plays. He progressed to films in 1939 but his career was immediately interrupted after only one movie appearance by WWII, serving as a lieutenant colonel in the infantry. He managed to regain his footing in films during the post-war years and played a number of doubting debonairs and high ranking officials in both the lead and second lead capacity. Such films as Spring in Park Lane (1948) Trio (1950), Encore (1952), Breaking the Sound Barrier (1952), The Pickwick Papers (1952), How to Murder a Rich Uncle (1957) and The League of Gentlemen (1959) solidified his cinematic status and purposefulness. In the 60s he made a strong return to the theatre serving as both actor and director and also appeared on TV in the Zero One, which was briefly syndicated in the U.S. Long married to actress Beatrice Campbell until her death in 1979, he passed away two years later of lung cancer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjkzY2M0ZDAtMzkzNi00NTYzLTlmOTEtMDFiZjkwMGFhYTUyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0665902","name":"Nigel Patrick","idIMDB":"nm0665902"},"actorId":"nm0665902","character":"Peter Graham Race","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roger Livesey","urlProfile":"http://www.imdb.com/name/nm0515193","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NzU1NzMzMl5BMl5BanBnXkFtZTcwMjc5MzQ3OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 June 1906","placeOfBirth":" Barry, Wales, UK","height":"6' (1.83 m)","bio":"The son of Joseph Livesey and Mary Catherine (nee Edwards), Roger was educated at Westminster City School, London. His first stage appearance was the office boy in Loyalties at St. James' theatre in 1917. Subsequently, he played in everything from Shakespeare to modern comedies. He played various roles in the West End from 1920 to 1926. He toured the West Indies and South Africa the returned to join the Old Vic/Sadler's Wells company from September 1932 until May 1934. In 1936, he appeared in New York in the old English comedy \"The Country Wife\" and also married Ursula Jeans whom he had known previously in England. At the outbreak of war Roger and Ursula were among the first volunteers to entertain the troops before he volunteered for flying duties in the R.A.F. He was turned down as too old to fly so went to work in an aircraft factory at Desford aerodrome near Leicester to do his bit for the war effort. He was chosen by Michael Powell to play the lead in The Life and Death of Colonel Blimp (1943). This was shown in New York and established his international reputation as a brilliant character actor. He continued playing many theatrical roles during his film career from 1935 until 1969. Tall and broad with a luxurious mop of chestnut hair, Roger has (had) a deep voice, a gentle manner and the physique of an athlete. His favourite hobby is listed as \"tinkering.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NzU1NzMzMl5BMl5BanBnXkFtZTcwMjc5MzQ3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0515193","name":"Roger Livesey","idIMDB":"nm0515193"},"actorId":"nm0515193","character":"Mycroft","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Attenborough","urlProfile":"http://www.imdb.com/name/nm0000277","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDQzMTAwN15BMl5BanBnXkFtZTcwNTI4NTgwMw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1923","placeOfBirth":" Cambridge, Cambridgeshire, England, UK","birthName":"Richard Samuel Attenborough","height":"5' 7\" (1.7 m)","bio":"Lord Richard Attenborough was born in Cambridge, England, the son of Mary (née Clegg), a founding member of the Marriage Guidance Council, and Frederick Levi Attenborough, a scholar and academic administrator who was a don at Emmanuel College and wrote a standard text on Anglo-Saxon law. Attenborough was educated at Wyggeston Grammar School for Boys in Leicester and at the Royal Academy of Dramatic Art (RADA). His film career began with a role as a deserting sailor in In Which We Serve (1942), a part that contributed to his being typecast for many years as a coward in films like Dulcimer Street (1948), Operation Disaster (1950) and his breakthrough role as a psychopathic young gangster in the film adaptation of Graham Greene's novel, Brighton Rock (1947). During World War II, Attenborough served in the Royal Air Force. He worked prolifically in British films for the next 30 years, and in the 1950s appeared in several successful comedies for John Boulting and Roy Boulting, including Private's Progress (1956) and I'm All Right Jack (1959). Early in his stage career, Attenborough starred in the London West End production of Agatha Christie's \"The Mousetrap\", which went on to become one of the world's longest-running stage productions. Both he and his wife were among the original cast members of the production, which opened in 1952 and (as of 2007) is still running. In the 1960s, he expanded his range of character roles in films such as Seance on a Wet Afternoon (1964) and Guns at Batasi (1964), for which he won the BAFTA Award for Best Actor for his portrayal of the regimental Sergeant Major. He appeared in the ensemble cast of The Great Escape (1963), as Squadron Leader \"Roger Bartlett\" (\"Big X\"), the head of the escape committee. In 1967 and 1968, he won back-to-back Golden Globe Awards in the category of Best Supporting Actor, the first time for The Sand Pebbles (1966), starring Steve McQueen, and the second time for Doctor Dolittle (1967), starring Rex Harrison. He would win another Golden Globe for Best Director, for Gandhi (1982), in 1983. Six years prior to \"Gandhi\", he played the ruthless \"Gen. Outram\" in Indian director Satyajit Ray's period piece, Les joueurs d'échecs (1977). He has never been nominated for an Academy Award in an acting category. He took no acting roles following his appearance in Otto Preminger's The Human Factor (1979), until his appearance as the eccentric developer \"John Hammond\" in Steven Spielberg's Jurassic Park (1993). The following year, he starred as \"Kris Kringle\" in Miracle on 34th Street (1994), a remake of the 1947 classic. Since then, he has made occasional appearances in supporting roles, including the historical drama, Elizabeth (1998), as \"Sir William Cecil\". In the late 1950s, Attenborough formed a production company, \"Beaver Films\", with Bryan Forbes and began to build a profile as a producer on projects, including The League of Gentlemen (1960), The Angry Silence (1960) and Whistle Down the Wind (1961), also appearing in the first two of these as an actor. His feature film directorial debut was the all-star screen version of the hit musical, Oh! What a Lovely War (1969), and his acting appearances became more sporadic - the most notable being his portrayal of serial killer \"John Christie\" in 10 Rillington Place (1971). He later directed two epic period films: Young Winston (1972), based on the early life of Winston Churchill, and A Bridge Too Far (1977), an all-star account of Operation Market Garden in World War II. He won the 1982 Academy Award for Directing for his historical epic, Gandhi (1982), a project he had been attempting to get made for many years. As the film's producer, he also won the Academy Award for Best Picture. His most recent films, as director and producer, include Chaplin (1992), starring Robert Downey Jr. as Charles Chaplin, and Shadowlands (1993), based on the relationship between C.S. Lewis and Joy Gresham. Both films starred Anthony Hopkins, who also appeared in three other films for Attenborough: \"Young Winston\", \"A Bridge Too Far\" and the thriller, Magic (1978). Attenborough also directed the screen version of the hit Broadway musical, \"A Chorus Line\" (A Chorus Line (1985)), and the apartheid drama, Cry Freedom (1987), based on the experiences of Donald Woods. He was nominated for a Golden Globe Award for Best Director for both films. His most recent film as director was another biographical film, Grey Owl (1999), starring Pierce Brosnan. Attenborough is the President of RADA, Chairman of Capital Radio, President of BAFTA, President of the Gandhi Foundation, and President of the British National Film and Television School. He is also a vice patron of the Cinema and Television Benevolent Fund. He is also the patron of the UWC movement (United World Colleges), whereby he continually contributes greatly to the colleges that are part of the organization. He has frequented the United World College of Southern Africa(UWCSA) Waterford Kamhlaba. His wife and he founded the \"Richard and Sheila Attenborough Visual Arts Center\". He also founded the \"Jane Holland Creative Center for Learning\" at Waterford Kamhlaba in Swaziland in memory of his daughter, who died in the Tsunami on Boxing Day, 2004. He passionately believes in education, primarily education that does not judge upon color, race, creed or religion. His attachment to Waterford is his passion for non-racial education, which were the grounds on which Waterford Kamhlaba was founded. Waterford was one of his inspirations for directing Cry Freedom (1987), based on the life of Steve Biko. He was elected to the post of Chancellor of the University of Sussex on 20 March 1998, replacing the Duke of Richmond and Gordon. A lifelong supporter of Chelsea Football Club, Attenborough served as a director of the club from 1969-1982 and, since 1993, has held the honorary position of Life Vice President. He is also the head of the consortium, \"Dragon International\", which is constructing a film and television studio complex in Llanilid, Wales, often referred to as \"Valleywood\". In 1967, he was made a Commander of the Order of the British Empire (CBE). He was knighted in 1976 and, in 1993, he was made a life peer as Baron Attenborough, of Richmond-upon-Thames in the London Borough of Richmond upon Thames. On 13 July 2006, Attenborough and his brother, David Attenborough, were awarded the titles of Distinguished Honorary Fellows of the University of Leicester \"in recognition of a record of continuing distinguished service to the University\". Lord Attenborough is also listed as an Honorary Fellow of Bangor University for his continued efforts to film making. Attenborough has been married to English actress Sheila Sim, since 1945. They had three children. In December 2004, his elder daughter, Jane Holland, as well as her daughter Lucy and her mother-in-law, also named Jane, were killed in the tsunami caused by the Indian Ocean earthquake. A memorial service was held on 8 March 2005, and Attenborough read a lesson at the national memorial service on 11 May 2005. His grandson, Samuel Holland, and granddaughter, Alice Holland, also read in the service. Attenborough's father was principal of University College, Leicester, now the city's university. This has resulted in a long association with the university, with Lord Attenborough a patron. A commemorative plaque was placed on the floor of Richmond Parish Church. The university's \"Richard Attenborough Centre for Disability and the Arts\", which opened in 1997, is named in his Honor. His son, Michael Attenborough, is also a director. He has two younger brothers, the famous naturalist Sir David Attenborough and John Attenborough, who has made a career in the motor trade. He has collected Pablo Picasso ceramics since the 1950s. More than 100 items went on display at the New Walk Museum and Art Gallery in Leicester in 2007; the exhibition is dedicated to his family members lost in the tsunami.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDQzMTAwN15BMl5BanBnXkFtZTcwNTI4NTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000277","name":"Richard Attenborough","nicknames":["Dickie, Bunter."],"idIMDB":"nm0000277"},"actorId":"nm0000277","character":"Edward Lexy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bryan Forbes","urlProfile":"http://www.imdb.com/name/nm0285302","urlPhoto":"","biography":{"dateOfBirth":"22 July 1926","placeOfBirth":" Stratford, London, England, UK","birthName":"John Theobald Clarke","bio":"Bryan Forbes was born on July 22, 1926 in Stratford, London, England as John Theobald Clarke. He was an actor and writer, known for Chaplin (1992), Seance on a Wet Afternoon (1964) and The Slipper and the Rose: The Story of Cinderella (1976). He was married to Nanette Newman and Constance Smith. He died on May 8, 2013 in Virginia Water, Surrey, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0285302","name":"Bryan Forbes","idIMDB":"nm0285302"},"actorId":"nm0285302","character":"Martin Porthill","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kieron Moore","urlProfile":"http://www.imdb.com/name/nm0601476","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTdlYmNiYWEtMmEwMC00MTY1LTk1MGMtZGZlZDI2ZmYyYzVkXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1924","placeOfBirth":" Skibbereen, County Cork, Ireland","birthName":"Kieron O'Hanrahan","height":"6' 1½\" (1.87 m)","bio":"With dark good looks and a brawny build, Irish actor Kieron Moore made a name for himself in post-war British films as both heroes and villains. Interestingly, he is better remembered for one of his more earnest failures, that of Count Vronsky opposite Vivien Leigh's Anna Karenina (1948). Born Kieron O'Hanrahan, he grew up in a hearty, Irish-speaking-only household. His father, Peter, was an Irish Nationalist writer, poet, editor and political activist who was imprisoned more than once by the British for his activities. Encouraged by their parents to pursue their artistic leanings, Kieron's sister Nease became an actress, brother Fachtna became a music director, and sister Blaithin played harp for the National Symphony Orchestra. Kieron himself was educated in Dublin and started to study medicine at University College. He abandoned his medical studies, however, after an Abbey Theatre rep saw him in a local play and accepted his application for membership. In 1943 the handsome Kieron moved to England and subsequently made his London stage debut as Heathcliff in a production of Wuthering Heights. He went on to gain more notice in such plays as Purple Dust by 'Sean O'Casey' and Everyman. He made an impressive film debut as an Irish Republican Army killer in The Voice Within (1946). The heroine in the film, murdered by Kieron's character, was played by actress Barbara White. Despite their fatal on-camera relationship, they formed a much more positive one away from the lens and married in 1947. Barbara retired shortly thereafter and they had three sons (Casey, Colm, Sean) and one daughter (Theresa). Kieron was a talented, durable player but seemed to lack the charisma or drive for top stardom despite his early promise. An impressed Alexander Korda signed him up with his London Films following a heralded performance in the West End version of Sean O'Casey 's play Red Roses for Me in 1946. The marquee name of Kieron Moore was bestowed upon him at this time. While he excelled in his next unsympathetic role, the psychological drama Mine Own Executioner (1947) in which he plays a schizophrenic POW treated by doctor Burgess Meredith (with real-wife Barbara playing his wife in one of her last film roles), Kieron failed to capitalize on the one role that could have made him a star. As the urbane count in Anna Karenina (1948), he was deemed miscast by many of his reviews. Kieron took a bite of the Hollywood apple when cast as Uriah the Hittite in the plush but stilted biblical epic David and Bathsheba (1951) opposite Gregory Peck and 'Susan Hayward' , and as a dashing Foreign Legion corporal in Ten Tall Men (1951), starring Burt Lancaster. Not much happened as a result and he returned to England. There he continued to offer fine and varied performances, notably in The Green Scarf (1954), in which he earned applause for his role as a deaf, blind and mute murder suspect. Another part that garnered some attention was his playing of the bully Pony Sugrue in the Disney classic Darby O'Gill and the Little People (1959). This was topped by the strong kudos he received in the top-drawer Jack Hawkins comedy starrer The League of Gentlemen (1960) as a gay former officer recruited by Hawkins to pull off a major bank heist. At the same time, he turned hero once again as a man forced to battle flesh-eating plants in the classic sci-fi thriller The Day of the Triffids (1963) co-starring Janette Scott. At this juncture Kieron's status started to regress with more and more routine films handed him, including Doctor Blood's Coffin (1961), I Thank a Fool (1962) and The Thin Red Line (1964). He played second fiddle to special effects in Crack in the World (1965) and to Gregory Peck (again) in Arabesque (1966). He took as his final film the underwhelming Custer of the West (1967) in which he was oddly cast as an Indian chief. Throughout the 1950s and 1960s he customarily performed on TV, including a short-lived series. After retiring from feature film work altogether in 1974, his life took a religious and socially-active turn. He joined the Catholic Agency for Overseas Development, for whom he worked for nine years, directing and narrating two film documentaries in the course of that time. The films dealt specifically with the struggle for survival in Third World countries. He also traveled extensively in the Middle East and India and provided voice-overs for other documentary features as well. Retiring quietly to France in 1994, Kieron was survived by his wife, Barbara, and children at the time of his death on July 15, 2007 at age 82.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTdlYmNiYWEtMmEwMC00MTY1LTk1MGMtZGZlZDI2ZmYyYzVkXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0601476","name":"Kieron Moore","idIMDB":"nm0601476"},"actorId":"nm0601476","character":"Stevens","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Terence Alexander","urlProfile":"http://www.imdb.com/name/nm0018776","urlPhoto":"","biography":{"dateOfBirth":"11 March 1923","placeOfBirth":" Islington, London, England, UK","birthName":"Terence Joseph Alexander","height":"6' (1.83 m)","bio":"To say that Terence Alexander, the distinguished British thespian, was hyperactive is a statement that borders on the understatement! Judge for yourself : born in 1923, following a short period when he considered becoming a priest, Alexander exercised the acting profession for six full decades and he might have beaten Queen Victoria's record, had not Parkinson's disease (an illness he finally died of at 86) taken its toll. In 1939, at age 16, he was already in the theater, as the first assistant manager of The White Rose Players Company at the Harrogate Opera House. It did not take more than a few months before he made his acting debut on the aforementioned scene, with the first role in J.B. Priestley's \"The Good Companions\". And not only would he appear in dozens of plays (signed Jean Anouilh, Ray Cooney, T.S. Eliot, Alan Bennett, Margaret Kennedy, and many others) but he would appear in no fewer than... 340 films, TV movies and series episodes! And that is without counting his career as a voice talent on the radio, as a film and a trailer narrator. Of course, appearing in so many plays and filmed works means that, except on the boards, he was not always the lead. He even hardly ever was. But whether in a supporting role or even a bit part, Terence Alexander managed to establish himself as a well-mannered upper class type with suave manners, although quite often on the wrong side of the law (he was excellent as one of the seven retired army officers turned bank robbers in Basil Dearden's quite enjoyable The League of Gentlemen (1960)). But he could also be an effective foil to comics like Norman Wisdom, Benny Hill and Eric Morecambe & Ernie Wise. On TV, Terence Alexander was everywhere, in many quality TV films like \"Autumn Crocus\" (1952), \"The White Carnation\" (1956), \"A Room in Town\" (1970), \"Frankenstein\" (1984) and in more than one TV show. But he was first and foremost in an impressive number of series : these included Maigret (1959) (2 episodes, 1962-63), cult classics such as The Avengers (1961) (3 episodes, 1965-69), Chapeau melon et bottes de cuir (1976) (1 episode, 1977), Man in a Suitcase (1967) (1 episode, 1968), The Champions (1968) (1 episode, 1969), The Persuaders! (1971) (1 episode, 1971) and Doctor Who (1963) (2 episodes, 1985), prestigious classic serials such as Nicholas Nickleby (1968) (5 episodes, 1968), The Forsyte Saga (1967) (9 episodes, 1967) and The Pallisers (1974) (3 episodes, 1974), and this is only a sample of all the series the prolific actor appeared in. With such a hectic activity, Terence Alexander of course gained recognition both from his peers and from the public but fame did not come to him before 1981 when he accepted (rather reluctantly by his own admission) the role of Charlie Hungerford in the detective series \"Bergerac\". As the power broker and (disapproving) partner of detective Jim Bergerac, played by John Nettles, he appeared in 85 of its 86 episodes. Shown in 35 countries, the series allowed Alexander to be known (and cherished) not only by an international audience but by the younger generation too. More than a swan song for this exquisite actor. When he retired in 1999 he must have have felt satisfied with his professional life.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0018776","name":"Terence Alexander","idIMDB":"nm0018776"},"actorId":"nm0018776","character":"Rupert Rutland-Smith","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Norman Bird","urlProfile":"http://www.imdb.com/name/nm0083424","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjg2MDkwMV5BMl5BanBnXkFtZTgwNzk0MzUyMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1924","placeOfBirth":" Coalville, Leicestershire, England, UK","birthName":"John George Norman Bird","bio":"Norman Bird was born on October 30, 1924 in Coalville, Leicestershire, England as John George Norman Bird. He was an actor, known for The Lord of the Rings (1978), Whistle Down the Wind (1961) and The Hill (1965). He was married to Nona Blamire. He died on April 22, 2005 in Wolverhampton, West Midlands, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjg2MDkwMV5BMl5BanBnXkFtZTgwNzk0MzUyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0083424","name":"Norman Bird","idIMDB":"nm0083424"},"actorId":"nm0083424","character":"Weaver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Coote","urlProfile":"http://www.imdb.com/name/nm0178509","urlPhoto":"","biography":{"dateOfBirth":"4 February 1909","placeOfBirth":" London, England, UK","height":"5' 10\" (1.78 m)","bio":"Robert Coote (1909-1982) was an English actor who had a thriving career for 50 years. He is best remembered for originating the role of Colonel Pickering in My Fair Lady (1964), Alan Jay Lerner & Frederick Loewe's musical adaptation of George Bernard Shaw's Pygmalion (1938), for which he was nominated for a Tony Award as Best Featured Actor in a Musical in 1957. He also originated the role of King Pellinore in Lerner & Loewe's 1960 Broadway musical Camelot (1967). Coote played Colonel Pickering on Broadway and London, but Wilfrid Hyde-White was cast in the Oscar-winning 1964 movie despite Coote's extensive movie career. In fact, Coote had specialized in playing aristocrats and military men in countless films, most notably as Sergeant Bertie Higginbotham in George Stevens's 1939 classic Gunga Din (1939). (In real life, Coote served with the Royal Canadian Air Force during World War Two, becoming a squadron leader.) He possibly was overlooked for the movie (as was Julie Andrews, more notably) due to a strained relationship with star Rex Harrison, who stole business originated by Coote during the original Broadway production. Harrison resented Coote after unsuccessfully demanding to take over a famous piece of business created by Coote, Colonel Pickering's telephone call. Coote recreated the role in the 1976 Broadway revival.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0178509","name":"Robert Coote","idIMDB":"nm0178509"},"actorId":"nm0178509","character":"Bunny Warren","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Melissa Stribling","urlProfile":"http://www.imdb.com/name/nm0834320","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTQ1NDU2M15BMl5BanBnXkFtZTcwMDIwMzYyOA@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 November 1926","placeOfBirth":" Gourock, Scotland, UK","birthName":"Melissa Stribling Smith","bio":"Melissa Stribling was born on November 7, 1926 in Gourock, Scotland as Melissa Stribling Smith. She was an actress, known for Horror of Dracula (1958), The League of Gentlemen (1960) and Road to Saint Tropez (1966). She was married to Basil Dearden. She died on March 22, 1992 in Watford, Hertfordshire, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTQ1NDU2M15BMl5BanBnXkFtZTcwMDIwMzYyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0834320","name":"Melissa Stribling","idIMDB":"nm0834320"},"actorId":"nm0834320","character":"Peggy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nanette Newman","urlProfile":"http://www.imdb.com/name/nm0628216","urlPhoto":"","biography":{"dateOfBirth":"29 May 1934","placeOfBirth":" Northampton, Northamptonshire, England, UK","height":"5' 5\" (1.65 m)","bio":"Nanette Newman was born on May 29, 1934 in Northampton, Northamptonshire, England. She is an actress and writer, known for The Stepford Wives (1975), The Whisperers (1967) and Long Ago, Tomorrow (1971). She was previously married to Bryan Forbes.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0628216","name":"Nanette Newman","idIMDB":"nm0628216"},"actorId":"nm0628216","character":"Elizabeth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lydia Sherwood","urlProfile":"http://www.imdb.com/name/nm0792826","urlPhoto":"","biography":{"dateOfBirth":"5 May 1906","placeOfBirth":" London, England, UK","birthName":"Lily Shavelson","bio":"Lydia Sherwood was born on May 5, 1906 in London, England as Lily Shavelson. She was an actress, known for The League of Gentlemen (1960), Roméo et Juliette (1954) and Little Friend (1934). She died on April 20, 1989 in London.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0792826","name":"Lydia Sherwood","idIMDB":"nm0792826"},"actorId":"nm0792826","character":"Hilda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Doris Hare","urlProfile":"http://www.imdb.com/name/nm0362791","urlPhoto":"","biography":{"dateOfBirth":"1 March 1905","placeOfBirth":" Bargoed, Monmouthshire, Wales, UK","height":"5' 4\" (1.63 m)","bio":"Doris Hare was born on March 1, 1905 in Bargoed, Monmouthshire, Wales. She was an actress, known for On the Buses (1969), Nuns on the Run (1990) and On the Buses (1971). She was married to John Fraser Roberts. She died on May 30, 2000 in Denville Hall, Northwood, Hillingdon, London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0362791","name":"Doris Hare","idIMDB":"nm0362791"},"actorId":"nm0362791","character":"Molly Weaver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Lodge","urlProfile":"http://www.imdb.com/name/nm0517084","urlPhoto":"","biography":{"dateOfBirth":"19 August 1921","placeOfBirth":" Rochester, Kent, England, UK","birthName":"David William Frederick Lodge","height":"6' (1.83 m)","bio":"David Lodge was born on August 19, 1921 in Rochester, Kent, England as David William Frederick Lodge. He was an actor, known for The Return of the Pink Panther (1975), A Shot in the Dark (1964) and Two Way Stretch (1960). He was married to Marilyn Garcia. He died on October 18, 2003 in Denville Hall, Northwood, Hillingdon, London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0517084","name":"David Lodge","idIMDB":"nm0517084"},"actorId":"nm0517084","character":"C.S.M.","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick Wymark","urlProfile":"http://www.imdb.com/name/nm0943859","urlPhoto":"","biography":{"dateOfBirth":"11 July 1920","placeOfBirth":" Cleethorpes, Lincolnshire, England, UK","birthName":"Patrick Carl Cheeseman","bio":"Patrick Wymark was born on July 11, 1920 in Cleethorpes, Lincolnshire, England as Patrick Carl Cheeseman. He was an actor, known for Where Eagles Dare (1968), Repulsion (1965) and The Power Game (1965). He was married to Olwen Wymark. He died on October 20, 1970 in Melbourne, Australia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0943859","name":"Patrick Wymark","idIMDB":"nm0943859"},"actorId":"nm0943859","character":"Wylie","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0052997","urlIMDB":"http://www.imdb.com/title/tt0052997","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"A.F.M. PRODUCTIONS LIMITED © MCMLX All Rights Reserved"},"technical":{"runtime":["1 hr 56 min (116 min)"],"soundMix":["Mono"],"color":["Black and White"],"aspectRatio":["1.66 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.5","filmingLocations":[{"location":"Fleet Street, Holborn, London, England, UK"}],"rated":"UNRATED","awards":[{"award":"BAFTA Awards 1961","titlesAwards":[{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best British Screenplay","names":[{"name":"Bryan Forbes","id":"nm0285302","role":null}]}]}]},{"award":"San Sebastián International Film Festival 1960","titlesAwards":[{"titleAwardOutcome":"Won Zulueta Prize","categories":[{"category":"Best Actor","names":[{"name":"Richard Attenborough","id":"nm0000277","role":null},{"name":"Jack Hawkins","id":"nm0370144","role":null},{"name":"Bryan Forbes","id":"nm0285302","role":null},{"name":"Roger Livesey","id":"nm0515193","role":null},{"name":"Nigel Patrick","id":"nm0665902","role":null}]}]}]}],"votes":"2,813","type":"Movie","companyCreditsSimple":[{"idCompany":"co0137927","name":"Allied Film Makers (AFM)"}],"keywords":{"keywords":["bank robbery","army","raid","planning","veteran","explosive","recruiting","hiding","heist","depot","caper comedy","caper","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 07:52:03"}}