{"data":{"movies":[{"title":"The Miracle of Morgan's Creek","originalTitle":"","year":"1944","releaseDate":"194401","directors":[{"name":"Preston Sturges","id":"nm0002545"}],"writers":[{"name":"Preston Sturges","id":"nm0002545"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwMDU1MTE5N15BMl5BanBnXkFtZTgwMjEzNjQ1MjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance","War"],"plot":"Trudy Kockenlocker, a small-town girl with a soft spot for American soldiers, wakes up the morning after a wild farewell party for the troops to find that she married someone she can't remember--and she's pregnant. Norval Jones, the 4-F local boy who's been in love with Trudy for years, tries to help her find a way out of her predicament. Trudy complicates matters further by falling for Norval, and events snowball from there.","simplePlot":"After an all-night send-off party for the troops, a small-town girl wakes up to find herself married and pregnant, but with no memory of her husband's identity.","actors":[{"actorName":"Eddie Bracken","urlProfile":"http://www.imdb.com/name/nm0102787","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1OTk5MDA2N15BMl5BanBnXkFtZTcwNDkyMTE3OA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1915","placeOfBirth":" Astoria, New York, USA","birthName":"Edward Vincent Bracken","height":"5' 7\" (1.7 m)","bio":"This owl-faced comic actor enjoyed his first featured film role in the RKO production Too Many Girls (1940), in which he reprised the role of \"JoJo Jordan\" that he had played in the Broadway stage version of that musical. (Into the pantheon of pop-music standards came one that Bracken had introduced in \"Too Many Girls\", the melancholy \"I Didn't Know What Time It Was\"). But the then 20-year-old Eddie Bracken was by no means new to show business in general or Hollywood in particular. He had played in vaudeville and performed in nightclubs by the time he was 9, and had just later appeared on screen in four of the Hal Roach \"Our Gang\" comedy two-reeler film shorts. It was on account of his appearances in musicals and comedies as a shy, giggling, clumsy, stammering, sentimental, self-effacing, would-be hero that Bracken achieved popularity, not to say star status, among movie audiences of the 1940s. The director Preston Sturges served up those attributes of Eddie Bracken particularly well in two of Sturges's more memorable comedies. As \"Norval Jones\" in The Miracle of Morgan's Creek (1944) (filmed in 1942; released 1944), Bracken portrays a man whose destiny others have foisted upon him. A certain \"Trudy Kockenlocker\" (played by Betty Hutton), having attended a party for military servicemen, later finds herself to be pregnant but has no recollection of who the father might be. So she persuades the always-befuddled Norval to take credit for the child and marry her. Somehow, Norval emerges a true hero in the end, but you'll have to see the film to discover why. As Norval Jones was physically unfit for military service, so also was \"Woodrow Lafayette Pershing Truesmith\", with Eddie Bracken in the role, in Preston Sturges's Hail the Conquering Hero (1944). Solely on the basis of his father's reputation as a World War I U.S. Marine hero, a group of saloon-hopping World War II-era U.S. Marines, led by a crusty senior-level sergeant (played to a tee by William Demarest), elevate the physical reject Truesmith into a modern, combat-decorated veteran, and then usher him into an election campaign for Truesmith's hometown mayoralty. The complications, including a love interest (in the person of actress Ella Raines, are by now well under way. As Eddie Bracken's age increased his popularity -- or perhaps that of the genre of film vehicles that was his forte -- decreased, and in 1953 he essentially retired from the screen, moving on to pursue theatrical ventures. But he would return to Hollywood eventually, and we have been fortunate to see him in character roles in theatrical and TV films through the 80's and 90's.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1OTk5MDA2N15BMl5BanBnXkFtZTcwNDkyMTE3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0102787","name":"Eddie Bracken","idIMDB":"nm0102787"},"actorId":"nm0102787","character":"Norval Jones","urlCharacter":"http://www.imdb.com/character/ch0026138","main":true},{"actorName":"Betty Hutton","urlProfile":"http://www.imdb.com/name/nm0002149","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NTcyOTkxNV5BMl5BanBnXkFtZTYwNTYwMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 February 1921","placeOfBirth":" Battle Creek, Michigan, USA","birthName":"Elizabeth June Thornburg","height":"5' 4\" (1.63 m)","bio":"Betty Hutton was born Elizabeth June Thornburg on February 26, 1921, in Battle Creek, Michigan. Two years later Betty's father decided that the family way of life wasn't for him, so he left (he committed suicide 16 years later). Having to fend for themselves, Mrs. Thornburg moved the family to Detroit to find work in the numerous auto factories there, but times were hard and she decided to take advantage of Prohibition and opened a small tavern, at the time called a speakeasy. The police were always looking for those types of operation, both big and small, and when they detected one, they swooped in and closed it down. Mrs. Thornburg was no different from the other owners, they simply moved elsewhere. Poverty was a constant companion. In addition to that, Mrs. Thornburg was an alcoholic. At nine years old Betty began singing publicly for the first time in a school production. Realizing the voice Betty had, her mother took her around Detroit to have her sing to any group that would listen. This was a small way of getting some money for the poor family. When she was 13 Betty got a few singing jobs with local bands in the area. Thinking she was good enough to make the big time, she left for New York two years later to try a professional career. Unfortunately, it didn't work out and Betty headed back to Detroit. In 1937, Betty was hired by Vincent Lopez who had a popular band that appeared on the local radio. Later, she would return to New York and it was here that her career took off. Betty found herself on Broadway in 1940, and it was only a matter of time before her career took off to bigger heights. The following year she left New York for Hollywood, where she was to find new life in films. She was signed by Paramount Pictures and made her debut, at 21, in The Fleet's In (1942), along with Eddie Bracken, William Holden and Dorothy Lamour. Reviews were better than expected, with critics looking favorably upon her work. She had previously appeared in a few musical shorts, which no doubt helped her in her first feature film. She made one more musical in 1942 and two more in 1943. In 1944 she tried to break away from musicals and try her hand in a screwball comedy, The Miracle of Morgan's Creek (1944). She proved - to herself, the public and the critics - that she was marketable outside musicals. In subsequent films Betty was able to show her comedic side as well as her singing. In 1948 she appeared in her first big box-office bomb, Dream Girl (1948), which was ripped to shreds by critics, as was Betty's acting, and the movie flopped at the box office. It wasn't long before Betty became unhappy with her career. In truth she had the acting talent, but the parts she got weren't the types to showcase that. Though she did appear in three well received films later, Red, Hot and Blue (1949), Annie Get Your Gun (1950) and The Greatest Show on Earth (1952), her career was winding down. Later, after filming Somebody Loves Me (1952), Betty was all but finished. She had married 'Charles O'Curran' that year and he wanted to direct her in an upcoming film. Paramount didn't like the idea and the temper tantrum-prone Betty walked out of her contract and movies. She did concentrate on the relatively new medium of television and the stage, but she never recovered her previous form. Her final film was a minor one, Spring Reunion (1957). Her TV series, The Betty Hutton Show (1959), didn't fare too well at all. Betty lived in quiet retirement in Palm Springs, California until her death on March 11, 2007. She was 86 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NTcyOTkxNV5BMl5BanBnXkFtZTYwNTYwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002149","name":"Betty Hutton","idIMDB":"nm0002149"},"actorId":"nm0002149","character":"Trudy Kockenlocker","urlCharacter":"http://www.imdb.com/character/ch0026136","main":true},{"actorName":"Diana Lynn","urlProfile":"http://www.imdb.com/name/nm0528658","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2OTI0NTUyMV5BMl5BanBnXkFtZTcwODE0NjEwMw@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 October 1926","placeOfBirth":" Los Angeles, California, USA","birthName":"Dolores Marie Loehr","height":"5' 6½\" (1.69 m)","bio":"She was a child prodigy and pianist at age 10, and her first movie role was as one of the children in \"They Shall Have Music\" (1939), in which you see her playing the piano. She made another movie using the name Dolly (a short version of her real name (Dolores) in \"There's Magic in Music\" (1941). She signed a long-term contract with Paramount in 1942 and had her name changed to Diana Lynn. She had good roles in \"The Major and the Minor\" (1942) and \"The Miracle of Morgan's Creek\" and \"Our Hearts Were Young and Gay\" (both 1944). She had fewer roles as she matured; she did do \"Bedtime for Bonzo\" (1951) but had a nice career on TV shows. She died of a stroke when she was making a comeback in film. Her first marriage was from 1948 to 1954 to architect John C. Lindsay (no children); then on December 6,1956, she married Mortimer C.Hall, president of L.A. radio station KLAC. His mother was Dorothy Schiff, then publisher of the New York Post. She had four children with him between 1958 and 1964. They moved to New York City so he could assume a post on his mother's paper. She passed away on December 17, 1971, of a stroke/brain hemorrhage in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2OTI0NTUyMV5BMl5BanBnXkFtZTcwODE0NjEwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0528658","name":"Diana Lynn","nicknames":["Dolly"],"idIMDB":"nm0528658"},"actorId":"nm0528658","character":"Emmy Kockenlocker","urlCharacter":"http://www.imdb.com/character/ch0026139","main":true},{"actorName":"William Demarest","urlProfile":"http://www.imdb.com/name/nm0218131","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA2MjY5NDAxOF5BMl5BanBnXkFtZTcwNjM2MjcwOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1892","placeOfBirth":" St. Paul, Minnesota, USA","birthName":"Carl William Demarest","height":"5' 9½\" (1.77 m)","bio":"Born in St. Paul, Minnesota, William Demarest was a prolific actor in movies and TV, making more than 140 films. Demarest started his acting career in vaudeville and made his way to Broadway. His most famous role was in My Three Sons (1960), replacing a very sick William Frawley. Demarest was nominated for an Academy Award for Best Actor in a Supporting role in the real-life biography, The Jolson Story (1946). He did not win. This was the first and only time Demarest was nominated for any Academy Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA2MjY5NDAxOF5BMl5BanBnXkFtZTcwNjM2MjcwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0218131","name":"William Demarest","idIMDB":"nm0218131"},"actorId":"nm0218131","character":"Constable Edmund Kockenlocker","urlCharacter":"http://www.imdb.com/character/ch0501579","main":true},{"actorName":"Porter Hall","urlProfile":"http://www.imdb.com/name/nm0356004","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxOTQ4YTktN2YxNS00NjJmLWFlZWItOTBlMjEzZmM3MzdjXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 September 1888","placeOfBirth":" Cincinnati, Ohio, USA","birthName":"Clifford Porter Hall","height":"5' 7\" (1.7 m)","bio":"For over two decades, Porter Hall made a career out of playing villains and pompous, unpleasant people. His movie career was not a mirror of his real life, however. Mr. Hall was well known as a generous and outgoing person who was well-liked by almost everybody he knew. It is ironic that the role he is most often seen in today is that of an atheist in Going My Way (1944) - ironic because Hall was a deacon in his church. Hall, who didn't make his first movie until he was 43, remained active until his death in 1953.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxOTQ4YTktN2YxNS00NjJmLWFlZWItOTBlMjEzZmM3MzdjXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0356004","name":"Porter Hall","idIMDB":"nm0356004"},"actorId":"nm0356004","character":"Justice of the Peace","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emory Parnell","urlProfile":"http://www.imdb.com/name/nm0663183","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NTk3MzcxMF5BMl5BanBnXkFtZTgwNzQ3MzY2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1892","placeOfBirth":" St. Paul, Minnesota, USA","height":"6' 1\" (1.85 m)","bio":"Emory Parnell was born on December 29, 1892 in St. Paul, Minnesota, USA. He was an actor, known for The Miracle of Morgan's Creek (1944), Foreign Correspondent (1940) and Mr. Blandings Builds His Dream House (1948). He was married to Effie Laird. He died on June 22, 1979 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NTk3MzcxMF5BMl5BanBnXkFtZTgwNzQ3MzY2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0663183","name":"Emory Parnell","nicknames":["The Big Swede"],"idIMDB":"nm0663183"},"actorId":"nm0663183","character":"Mr. Tuerck","urlCharacter":"http://www.imdb.com/character/ch0026140","main":true},{"actorName":"Al Bridge","urlProfile":"http://www.imdb.com/name/nm0108653","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjI0OGUxMDctNmFmYy00NjU3LWJmNjYtNDkyYThmY2JhY2IwXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 February 1891","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Alfred Morton Bridge","bio":"American character actor, a fixture both in Westerns and in the comedies of Preston Sturges. Although frequently billed as \"Alan\" Bridge, he was born Alfred Morton Bridge in Philadelphia, Pennsylvania in 1891 (not as \"Alford\" Bridge in 1890, as his tombstone erroneously states), he and his sister, future actress Loie Bridge, were raised by their mother Loie and her second husband, butcher Wilmer Shinn. Following service as a corporal in the U.S. Army infantry in the first World War, Bridge joined a theatrical troupe which also included several of his relatives. The 1920 census showed him on tour in Kansas City, Missouri. He dabbled in writing and in 1930 sold a script to a short film, Her Hired Husband (1930). He followed this with a B-Western script, God's Country and the Man (1931), in which he made his film debut as an actor. For the next quarter century, he managed the atypical achievement of maintaining a career in both B-Westerns and in bigger dramatic and comedy features. Ten films for director Preston Sturges represent probably his most familiar contribution to Hollywood history. Bridge also appeared frequently on television until his death in 1957 at 66.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjI0OGUxMDctNmFmYy00NjU3LWJmNjYtNDkyYThmY2JhY2IwXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0108653","name":"Al Bridge","nicknames":["Alfred Bridge","Alford Morton Bridge","Alan L. Bridge","Alan Morton Bridge"],"idIMDB":"nm0108653"},"actorId":"nm0108653","character":"Mr. Johnson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julius Tannen","urlProfile":"http://www.imdb.com/name/nm0849582","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGM3Zjk4NTMtZjRhZC00YTM3LTg0YzgtOTEzOGIzOTBlZGRiL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UY44_CR9,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1880","placeOfBirth":" New York City, New York, USA","bio":"Julius Tannen was one of the first vaudeville stand-up comedians. He never used props, sets, costumes or stooges. He just put on his hat, walked on stage, took it off, and did his monologue, then put his hat on again and walked off. This was rather revolutionary in his day and Tannen paved the way for many stand-ups to come, such as Bob Hope, Milton Berle, Frank Faye and Jack Benny. Julius Tannen later had a long career as a character actor in Hollywood, and became an invaluable member of the Preston Sturges stock company, giving memorable performances in such Sturges classics as \"Christmas in July,\" \"The Miracle of Morgan's Creek,\" and \"Unfaithfully Yours.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGM3Zjk4NTMtZjRhZC00YTM3LTg0YzgtOTEzOGIzOTBlZGRiL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0849582","name":"Julius Tannen","idIMDB":"nm0849582"},"actorId":"nm0849582","character":"Mr. Rafferty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victor Potel","urlProfile":"http://www.imdb.com/name/nm0693055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjRmNmE4MDMtMTAwYS00N2ZlLTlmZjAtY2MxZTg2YjFkNTM4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 October 1889","placeOfBirth":" Lafayette, Indiana, USA","height":"6' 1\" (1.85 m)","bio":"Victor Potel was born in Lafayette, Indiana, in 1889. His first film was in 1910, for Essanay Film Manufacturing Company in Chicago. Potel worked for Essanay in most of the Broncho Billy series, as well as playing a character called \"Slippery Sam\" in almost 80 movies as well as Universal Pictures' \"Snakeville\" series. He moved to Universal in 1928 to make Melody of Love (1928) and worked steadily, playing small and sometimes uncredited bit parts, primarily comic roles due to his height and awkward look. Potel also wrote and directed. In 1935 he provided continuity and dialogue for several films. He became part of Preston Sturges' stock of character actors, appearing in nine films written and directed by Sturges. Potel work until his death on 8 March 1947, just after finishing playing \"Barfly\" in Relentless (1948).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjRmNmE4MDMtMTAwYS00N2ZlLTlmZjAtY2MxZTg2YjFkNTM4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0693055","name":"Victor Potel","idIMDB":"nm0693055"},"actorId":"nm0693055","character":"Newspaper Editor","urlCharacter":"http://www.imdb.com/character/ch0028855","main":true},{"actorName":"Brian Donlevy","urlProfile":"http://www.imdb.com/name/nm0002046","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwODA4ODAyOF5BMl5BanBnXkFtZTYwODMxMTM2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1901","placeOfBirth":" Portadown, County Armagh, Ireland [now in Northern Ireland], UK","birthName":"Waldo Brian Donlevy","height":"5' 8\" (1.73 m)","bio":"It seems that Brian Donlevy started out life as colorfully as any character he ever played on the stage or screen. He lied about his age (he was actually 14) in 1916 so he could join the army. When Gen. John J. Pershing sent American troops to invade Mexico in pursuit of Pancho Villa--Mexican rebels under Villa's command raided Columbus, NM, and killed 16 American soldiers and civilians--Donlevy served with that expedition and later, in WW I, was a pilot with the Lafayette Escadrille, a unit of the French Air Force comprised of American and Canadian pilots. His schooling was in Cleveland, OH, but in addition he spent two years at the US Naval Academy at Annapolis, MD. However, he gave up on a military career for the stage. After having landed several smaller roles, he got a part in \"What Price Glory\" and established himself as a bona fide actor. Later such roles on stage as \"Three for One\", \"The Milky Way\" and \"Life Begins at 8:30\" gave him the experience to head off to Hollywood. Donlevy began his Hollywood career with the silent film A Man of Quality (1926) and his first talkie was Gentlemen of the Press (1929) (in which he had a bit part). There was a five- to six-year gap before he reappeared on the film scene in 1935 with three pictures: Mary Burns, Fugitive (1935), Another Face (1935) and Barbary Coast (1935), which was his springboard into film history. Receiving rave reviews as \"the tough guy all in black\", acting jobs finally began to roll his way. In 1936 he starred in seven films, including Strike Me Pink (1936), in which he played the tough guy to Eddie Cantor's sweet bumpkin Eddie Pink. In all, from 1926 to 1969 Donlevy starred in at least 89 films, reprising one of his Broadway roles as a prizefighter in The Milky Way (1940), and had his own television series (which he also produced), Dangerous Assignment (1952). In 1939 he received an Oscar nomination for Best Supporting Actor for his portrayal of the sadistic Sgt. Markoff in Paramount's Beau Geste (1939), its remake of an earlier silent hit. The Great McGinty (1940), a Preston Sturges comedy about a poor homeless slob who makes it to Governor of a state with the mob's help, is a brilliant character study of a man and the changes he goes through to please himself, those around him and, eventually, the woman he loves. A line in the film, spoken by Mrs. McGinty, seems a fitting description of the majority of roles Brian Donlevy would play throughout his career: \". . . You're a tough guy, McGinty, not a wrong guy.\" Donlevy's ability to make the roughest edge of any character have a soft side was his calling card. He perfected it and no one has quite mastered it since. He later, in 1944, reprised that role in The Miracle of Morgan's Creek (1944). By 1935 Donlevy was working for 20th Century-Fox and had just completed filming 36 Hours to Kill (1936) when he became engaged to young singer Marjorie Lane, and they married the next year. The marriage produced one child, Judy, but ended in divorce in 1947. It was 19 years before he remarried. In 1966, Bela Lugosi's ex-wife Lillian became Mrs. Brian Donlevy, and they were married until his death in 1972. Donlevy had always derived great pleasure from his two diverse interests, gold mining and writing poetry, so it was fitting that after his last film, Pit Stop (1969), he retired to Palm Springs, CA, where he began to write short stories and had his income well supplemented from a prosperous California tungsten mine he owned. Having gone in for throat surgery in 1971 he re-entered the Motion Picture County Hospital in Woodland Hills, CA, on March 10th, 1972. Less than a month later, on April 6, he passed away from cancer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwODA4ODAyOF5BMl5BanBnXkFtZTYwODMxMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002046","name":"Brian Donlevy","idIMDB":"nm0002046"},"actorId":"nm0002046","character":"Governor McGinty","urlCharacter":"http://www.imdb.com/character/ch0253011","main":true},{"actorName":"Akim Tamiroff","urlProfile":"http://www.imdb.com/name/nm0848667","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NjEyNTEwOV5BMl5BanBnXkFtZTcwMjA2ODkxOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1899","placeOfBirth":" Tiflis, Russian Empire [now Tbilisi, Republic of Georgia]","height":"5' 7\" (1.7 m)","bio":"Though born in Russia and having a Russian-sounding name, Akim Tamiroff is actually of Armenian descent. At 19 he decided to pursue acting as a career and was chosen from among 500 applicants to the Moscow Art Theater School. There he studied under the great Konstantin Stanislavski, and launched a stage career. This included road company productions, in one such tour in 1920 Tamiroff came to New York City, which he liked so much he decided to stay there. Broadway suited him, and he worked steadily with the Theatre Guild from the mid-1920s to the early 1930s. He was a short, stout man with a guttural baritone voice and a thick but rather generic Russian accent that, with his skill in characterizations, seemed to mesh with any role calling for a foreign type--whether European, Middle Eastern or Asian. His voice became his principal asset. He came west to Hollywood in 1932 to break into the movie business, and first appeared on screen in a bit part in Okay America! (1932). Until 1934 his appearances were usually uncredited, but he managed to stand out in several films, one of his best roles of the time being the servant Pedro of John Gilbert Queen Christina (1933). By early 1934 he was much in demand, appearing in 12 films during that year. The next year was even busier for him, with roles in 15 films altogether, and not just bit parts--he was getting more feature supporting roles, such as Gopal the emir in The Lives of a Bengal Lancer (1935) and the comic puppet master Rudolpho in the adapted operetta Naughty Marietta (1935). He signed with Paramount in 1936 but was often loaned out to other studios. He went to Warner Bros. for one of his earliest big supporting characters: the sly Cuban mercantile agent Carlo Cibo in Anthony Adverse (1936). For Paramount, his General Yang in The General Died at Dawn (1936) brought him his first of two Oscar nominations for Best Supporting Actor. Along with substantial supporting roles in top movies, Tamiroff was getting starring roles in \"B\" pictures, allowing him to show his range by playing everything from amiable rogues to thoroughly evil villains. Two of his roles from that time exemplify what a versatile actor he was. As French trapper and scout Dan Duroc of North West Mounted Police (1940), he was something of a rascal but with a sense of humor and dignity. However, as the vile Colonna in The Corsican Brothers (1941), he is irredeemably wicked, and deservedly dies in the longest sword duel on film. For his role as the self-serving guerrilla Pablo in For Whom the Bell Tolls (1943), Tamiroff received his second Oscar nomination. He continued through the decade with more fine work, and in 1949 he joined the cast of Black Magic (1949) and met Orson Welles, who played late 18th-century charlatan Cagliostro. The two became friends and associates in Welles' later film projects. Through the 1950s Tamiroff's time was fairly divided between TV productions and films earlier in the decade and a surprising number of episodic TV and more films later. His three films with Welles, as director and sometime actor, were: Confidential Report (1955) with its Wellesian maze of flashbacks; the over-the-top Touch of Evil (1958) with its gritty surrealism and incredible cast; and The Trial (1962) (The Trial), Welles' stylistic spin on the Franz Kafka story. Certainly it was in \"Touch of Evil\" (the best of the lot) that Tamiroff's Tijuana boss Uncle Joe Grandi--outlandishly bug-eyed alternately with fear or mercurial anger intensified by Welles' wild camera angles--stood out as a most intriguing character. He took a last fling at Broadway in 1959. For the 1960s Tamiroff continued to sample American TV but was still very active in American, French and Italian movies. His voice and talent were still a draw in films like Topkapi (1964) and Alphaville (1965). In addition, he remained on call for Welles' meandering/unfinished Don Quixote (1992) as Sancho Panza for nearly twenty years. One of the great character actors of film history, Akim Tamiroff appeared in over 150 screen projects.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5NjEyNTEwOV5BMl5BanBnXkFtZTcwMjA2ODkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0848667","name":"Akim Tamiroff","idIMDB":"nm0848667"},"actorId":"nm0848667","character":"The Boss","urlCharacter":"http://www.imdb.com/character/ch0308426","main":true}],"seasons":[],"idIMDB":"tt0037077","urlIMDB":"http://www.imdb.com/title/tt0037077","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"21","month":"10","year":"1942","remarks":null},{"money":null,"country":null,"day":"23","month":"12","year":"1942","remarks":null}],"copyrightHolder":"Copyright MCMXLIII by Paramount Pictures, Inc. (on print); © Paramount Pictures, Inc.; 5 January 1944; LP12498 (in copyright registry)"},"technical":{"runtime":["1 hr 38 min (98 min)"],"soundMix":["Mono (Western Electric Mirrophonic Recording)"],"color":["Black and White"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":["(10 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.9","filmingLocations":[{"location":"Paramount Studios - 5555 Melrose Avenue, Hollywood, Los Angeles, California, USA"}],"rated":"UNRATED","awards":[{"award":"Academy Awards, USA 1945","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Writing, Original Screenplay","names":[{"name":"Preston Sturges","id":"nm0002545","role":null}]}]}]},{"award":"National Board of Review, USA 1944","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Top Ten Films","names":[]},{"category":"Best Acting","names":[{"name":"Betty Hutton","id":"nm0002149","role":null}]}]}]},{"award":"National Film Preservation Board, USA 2001","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"","names":[]}]}]},{"award":"New York Film Critics Circle Awards 1944","titlesAwards":[{"titleAwardOutcome":"2nd place NYFCC Award","categories":[{"category":"Best Director","names":[{"name":"Preston Sturges","id":"nm0002545","role":null},{"name":"Hail the Conquering Hero","id":"tt0036891","role":null}]}]}]}],"votes":"5,624","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["party","creek","soldier","small town","policeman","memory","friend","childhood friend","bank","bank clerk","4 f","pregnancy","scandal","pole the structure","1940s","new father faints","discovering one is pregnant","maternity ward","pregnant sister","newspaper headline montage","world war one","whiskey","wedding","wedding ring","watch","virgin birth","victory lemonade","unwed mother","u.s. soldier","u.s. president","u.s. army","turkey the bird","truck","trombone player","triple feature movie","traffic","tied up","theft","telephone call","teenage girl","tea","tears","tailor","swimming hole","swimmer","surrogate husband","surrogate father","sunglasses","suicide threat","snow","sheriff","shaking leg","sex","sandwich","safe","rocking chair","rifle","responsibility","resisting arrest","recording","record player","rationing","radio station","punctuality","promise","premarital sex","pratfall","porch","police","plum pudding","piano","piano player","phonograph","perjury","patriotism","party hat","orphan","orphanage","organ","organist","nurse","newspaper","newspaper man","nervousness","necktie","nativity","native american","indian costume","motorcycle","mother son relationship","motel","money","mirror ball","milkman","milk cart","military uniform","military police","military draft","merry christmas","marriage","marriage proposal","marriage license","marriage certificate","marriage by proxy","lawn party","landlady","kiss","kiss the boys goodbye","justice of the peace","just married","josef stalin","jitterbug","jingle bells","reference to jesus christ","jalopy","jail","jailbreak","immaculate conception","hypocrisy","husband wife relationship","hotel","hospital","horse","horse and carriage","honeymoon","hitler","high school","high school sweetheart","hero","harp","hair ribbon","gun","guard house","goodbye","reference to god","gas","gas rationing","fruitcake","friendship","fourth of july","flat tire","flashback","firehouse","fight","father son relationship","farce","family relationships","falling out of bed","falling off a porch","escape","editor","editorial","drunkenness","drink","drinking","door bell","doctor","death of wife","dance","dancer","curtain ring","crying","cow","cow shed","country club","corsage","cooking","cookie","circular staircase","cigarette smoking","cigar smoking","church","christmas tree","chandelier","champagne","carelessness","car dent","bus","burn in crotch","breaking and entering","boogie woogie","boarding house","blood pressure","billy club","bigamy","bible","bank robbery","band","baking","axe","arrest","apron","apple butter","americana","alarm","alarm clock","abduction","giving birth","expectant mother","childbirth","stuttering","uniform","sister sister relationship","single father","salesclerk","police officer","lawyer","governor","father daughter relationship","elopement","dating","christmas","birth","satire","paternity","multiple birth","mistaken identity","writer director","memory loss","sextuplets","music store","movie theater","lip synching","lemonade","head injury","dancing","banker","screwball","world war two","death of mother","death of father"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:51:06"}}