{"data":{"movies":[{"title":"Reveille with Beverly","originalTitle":"","year":"1943","releaseDate":"19430204","directors":[{"name":"Charles Barton","id":"nm0059106"}],"writers":[{"name":"Howard J. Green","id":"nm0337914"},{"name":"Jack Henley","id":"nm0377127"}],"runtime":"78 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxOTA4MjIxNF5BMl5BanBnXkFtZTcwNDQ0MjA4MQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Music","Romance","War"],"plot":"Beverly Ross moderates an 5:30 am radio show with swing music, dedicated to the local servicemen. Two buddies of her brother have a chance to meet her and both fall in love. One of them is a wealthy sponser, the other used to be his chauffeur, but before she can decide, which of them she likes more, the soldiers have their marching orders and are away to their destination.","simplePlot":"Beverly Ross moderates an 5:30 am radio show with swing music, dedicated to the local servicemen. Two buddies of her brother have a chance to meet her and both fall in love. One of them is ... ","actors":[{"actorName":"Ann Miller","urlProfile":"http://www.imdb.com/name/nm0587900","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NDc2ODM2OF5BMl5BanBnXkFtZTYwOTU5NzU2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1923","placeOfBirth":" Chireno, Texas, USA","birthName":"Johnnie Lucille Ann Collier","height":"5' 7\" (1.7 m)","bio":"Ann Miller was born Johnnie Lucille Ann Collier on April 12, 1923 in Chireno, Texas. She lived there until she was nine, when her mother left her philandering father and moved with Ann to Los Angeles, California. Even at that young age, she had to support her mother, who was hearing-impaired and unable to hold a job. After taking tap-dancing lessons, she got jobs dancing in various Hollywood nightclubs while being home-schooled. Then, in 1937, RKO asked her to sign on as a contract player, but only if she could prove she was 18. Though she was really barely 14, she managed to get hold of a fake birth certificate, and so was signed on, playing dancers and ingénues in such films as Stage Door (1937), You Can't Take It with You (1938), Room Service (1938) and Too Many Girls (1940). In 1939, she appeared on Broadway in \"George White's Scandals\" and was a smash, staying on for two years. Eventually, RKO released her from her contract, but Columbia Pictures snapped her up to appear in such World War II morale boosters as True to the Army (1942) and Reveille with Beverly (1943). When she decided to get married, Columbia released her from her contract. The marriage was sadly unhappy and she was divorced in two years. This time, MGM picked her up, showcasing her in such films as Easter Parade (1948), On the Town (1949) and Kiss Me Kate (1953). In the mid-1950s, she asked to leave to marry again, and her request was granted. This marriage didn't last long, either, nor did a third. Ann then threw herself into work, appearing on television, in nightclubs and on the stage. She was a smash as the last actress to headline the Broadway production of \"Mame\" in 1969 and 1970, and an even bigger smash in \"Sugar Babies\" in 1979, which she played for nine years, on Broadway and on tour. She has cut back in recent years, but did appear in the Paper Mill Playhouse (Millburn, New Jersey) production of Stephen Sondheim's \"Follies\" in 1998, in which she sang the song \"I'm Still Here\", a perfect way to sum up the life and career of Ann Miller. On January 22, 2004, Ann Miller died at age 80 of lung cancer and was buried at the Holy Cross Cemetary in Culver City, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NDc2ODM2OF5BMl5BanBnXkFtZTYwOTU5NzU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0587900","name":"Ann Miller","nicknames":["Annie"],"idIMDB":"nm0587900"},"actorId":"nm0587900","character":"Beverly Ross","urlCharacter":"http://www.imdb.com/character/ch0494028","main":true},{"actorName":"William Wright","urlProfile":"http://www.imdb.com/name/nm0942929","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDA2MmVhYTgtNjRlMy00NzNjLWExZTUtNGQ0NmI1ODU2NDc1L2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1911","placeOfBirth":" Ogden, Utah, USA","bio":"Handsome actor William Wright's mid-film 1940s career was pushed with a wave of Columbia Studio publicity promoting him as World War II's answer to Clark Gable. The push ultimately did not work and Wright's rather obscure career faded within a decade. The Utah-born actor moved to California after his schooling and studied at the Pasadena Playhouse. His film debut came about with the small role of a pilot in China Clipper (1936). Groomed in uncredited and featured roles for both large (Paramount) and small (Monogram) studios, his more visible work in Rookies on Parade (1941), World Premiere (1941), The Devil Pays Off (1941) and Glamour Boy (1941) eventually led to a Columbia contract in 1942. The handsome, dapper, mustachioed Wright proved reliable and lent a smooth air to his \"B\" series mixed bag of heroes and villains. Throughout the war-era he supported in such Columbia films as Not a Ladies' Man (1942), Night in New Orleans (1942), Sweetheart of the Fleet (1942) and Lucky Legs (1942) before earning his first co-star role opposite Marguerite Chapman in Parachute Nurse (1942) and A Man's World (1942). Wright continued reliably in a variety of parts. He was a major suspect in the two of the \"Boston Blackie\" series entitled Boston Blackie Goes Hollywood (1942) and One Mysterious Night (1944), and romanced Ann Miller in Reveille with Beverly (1943) and, despite she overshadowed him with her dance routines, reteamed with her again in both Eadie Was a Lady (1945) and Eve Knew Her Apples (1945). He also was fourth billed as a detective in Murder in Times Square (1943) which reunited him with Marguerite Chapman, played a slick-haired villain in the western Saddles and Sagebrush (1943) with Ann Savage and played alongside her again in Dancing in Manhattan (1944). Appearing in Escape in the Fog (1945) opposite Nina Foch, he pursued Martha O'Driscoll in the western Down Missouri Way (1946). Wright's leading man status would wane in the late 1940s with secondary roles for \"Poverty Row\" studios in Lover Come Back (1946) and The Beginning or the End (1947). What didn't help was a chronic problem with alcohol. Wright did manage to play the lead supersleuth Philo Vance in the cheapjack production of Philo Vance Returns (1947), however, and co-starred in such cheapies as King of the Gamblers (1948)) and Rose of the Yukon (1949). His last release was for Columbia playing a second lead alongside Marjorie Lord in Air Hostess (1949). Whether Wright could have progressed into unctuous character roles would never be known as he died of cancer at age 38. Although performing right up until the end, his death was generally overlooked.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDA2MmVhYTgtNjRlMy00NzNjLWExZTUtNGQ0NmI1ODU2NDc1L2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0942929","name":"William Wright","idIMDB":"nm0942929"},"actorId":"nm0942929","character":"Barry Lang","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dick Purcell","urlProfile":"http://www.imdb.com/name/nm0700711","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGE0NTJmNzgtMTRkOS00ODQ2LTg3ZDgtZGRhOTMzM2I3ZWRjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1908","placeOfBirth":" Greenwich, Connecticut, USA","bio":"Dick Purcell was born on August 6, 1908 in Greenwich, Connecticut, USA. He was an actor, known for King of the Zombies (1941), Captain America (1944) and The Bank Dick (1940). He was married to Ethelind Terry. He died on April 10, 1944 in Hollywood, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGE0NTJmNzgtMTRkOS00ODQ2LTg3ZDgtZGRhOTMzM2I3ZWRjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0700711","name":"Dick Purcell","idIMDB":"nm0700711"},"actorId":"nm0700711","character":"Andy Adams","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Franklin Pangborn","urlProfile":"http://www.imdb.com/name/nm0659427","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NTM3MTc3MF5BMl5BanBnXkFtZTgwOTgzODE1MzE@._V1._CR114,136,541,718_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1889","placeOfBirth":" Newark, New Jersey, USA","birthName":"Joseph Franklin Pangborn","height":"5' 10½\" (1.79 m)","bio":"Franklin Pangborn - a name more befitting a fictionalized bank president rather than a great comedic actor - was a singular character actor but little is known of his early years. He spent some time in developing acting talent prior to appearing on Broadway by March of 1911, and would do six plays until mid-1913. He was noticeably absent afterward and corresponding with the early years of World War I. He was in the US Army after America entered the war in 1917. Pangborn did one more play on Broadway in 1924. Interestingly, for someone immediately identified with comedy, Pangborn's roles were for the most part dramatic and included Armand Duval in \"Camille\", a role in a play adaptation of \"Ben Hur\", and two parts in \"Joseph and His Brethren\". Two years later, Pangborn turned to silent films. And although he would play some villains and romantic leads, that droopy pudding-face of his was bound for comedy. In all these early roles from his debut in 1926, his first talkie (On Trial (1928)), and on through most of 1932 (when he made 24 appearances on film), Pangborn was playing comedic roles, many of which were for short films (many by Mack Sennett) where the players usually had no on-screen persona and no billing credit. His many appearances in shorts tapered off and ended through 1935. These roles were quite varied and continued as such into the later 1930s. He played the compromised husband in two Bing Crosby vehicles (1933); no fewer than three photographers, reporters, radio announcers, bartenders, and much more, including a character meant to parody his own name: 'Mr. Pingboom' (Turnabout (1940)). But through the same period he was piling up a lot of clerk, floorwalker, and, perhaps most of all, hotel manager roles. These latter were the basis for Pangborn typed as the straight-laced, nervous minor official or service provider or manager of whatever whose smug self-assurance in his orderly world is sorely tested. The term 'sissy' (so prominent a condemnation from childhood memories) was used in early film (and still used today by some film historians) as a catchall name for a spectrum of rather gentle and nebulous male personalities; a simpering voice of any kind would be an instant label that also implied the taboo of homosexuality. Pangborn is often first on the list of actors noted as typed in this general category with Edward Everett Horton with his dignified but slightly simpering New England drawl a close second. Animator Robert Clampett at Warner Bros. in the late 1940s patterned his Goofy Gophers, Mac and Tosh, with their polite and flowery speech after both men. Pangborn had a mellow, lyrical voice which he could ramp up to a staccato, rapid-fire rhythm when perturbed. Indeed, the face and the voice fit well with characters of convention and control, as well as the fastidious to the point of being another slang term of many faces: 'prissy'. And maybe that does not include effeminate - he was not quite that - though the term is indelibly tagged to the character type. His characters were the sort of proper and snobby figures who the easygoing American public would find suspicious - and thus all the funnier on screen when they get their comeuppance. Yet Pangborn never implied 'gay' in his portrayals despite all the gender revisionism of today that might reinterpret his work as such. In real life, people are more complex; on the mainstream screen - as opposed to the shadowy blue one - of the 1930s and 40s, characters were more generally defined within usual convention. By the later 1930s, Pangborn had perfected a wonderful sense of timing of demeanor, manner, and voice to fit the control freak who is gradually dragged into his worst nightmare of relative chaos by hapless situation. By this time his characterizations were such a fixture of guaranteed laughs that the movie-going public expected to see him. Pangborn was in great demand to do what he did best. And having already worked from the silent era with great stars and directors, he continued to do so. W.C. Fields was a great fan of him and used him in several movies. He was a constant in smart comedy from Frank Capra and Gregory La Cava to the more extreme screwball comedies of Preston Sturges, though frequently upstaged with such a company of funny men as Sturges gathered around him. The Pangborn progression from very funny to uproarious is seen evolved, for example, from De Cava's My Man Godfrey (1936) to Sturges's Hail the Conquering Hero (1944). In the first he is the volunteer swell who coordinates store-keeping for the scavenger hunt of his fellow - if downright silly - affluent crust of New York society. As the flow of items brought to him for registering turns into a flood (including a live goat kid), his demeanor, mannerisms, and vocal speed display increasing irritation. Head spinning, he is in defensive mode as he fends off shouting, grabbing participants. The role perhaps was his defining moment as established celebrity comedian. In Sturges's movie, and Pangborn appeared in most of his best efforts, he is the committee chairman of the reception for false hero Eddie Bracken, trying to coordinate festivities and caught in a literal battle of bands at the beginning of the film. Converged upon by various hokey town bands who all want to play the featured pieces, Pangborn attempts order but is methodically carried away as people out of the blue arrive to suggest other songs, and the bands continue to assail him with arguments, and finally all play all the songs - and all at once - to prove the most deserving. It is musical chaos with Pangborn finally reduced to desperate blasts on a whistle and jumping up and down, yelling \"Not yet! Not yet!\" It is one of the actor's finest pieces. Yet Pangborn's usual stock of characters could fit drama as well. Actually, in \"Hero\", his coordinator also has some straight scenes as well. In Now, Voyager (1942) as the cruise tourist director, his only problem is that Bette Davis has not arrived on deck to be partnered for the land touring of Rio. As an accomplished stage actor, he did miss the boards. Friend of Edward Horton, he was able to exchange his quirky screen characters for dramatic ones, participating in Horton's Los Angeles-based Majestic Theatre productions. But times changed for Pangborn's specialties. Movies were more diverse and updated as the 1950s ensued. But he was immediately adaptable to the small screen which would re-introduce him. He was right at home as a guest star on TV comedy shows, playing his beloved characters as cameo celebrations of his matter-of-fact stardom. There were a handful of film roles in his last decade with perhaps the overambitious and black-and-white dull but star-studded The Story of Mankind (1957) a bit of a showcase. Also in 1957 he had the singular distinction of being honored as guest announcer - a familiar enough role - and first guest star on the premiere of the \"Tonight Show\" with its first host Jack Paar. To pass away after surgery seems such a disordered way to go for one such as Franklin Pangborn whose on-screen characters struggled for order above all else. There is no order in the frailty of life by definition, but Pangborn's legacy, rich in comedic gems, has and surely will continue to endure.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NTM3MTc3MF5BMl5BanBnXkFtZTgwOTgzODE1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0659427","name":"Franklin Pangborn","idIMDB":"nm0659427"},"actorId":"nm0659427","character":"Vernon Lewis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tim Ryan","urlProfile":"http://www.imdb.com/name/nm0752878","urlPhoto":"","biography":{"dateOfBirth":"5 July 1899","placeOfBirth":" Bayonne, New Jersey, USA","birthName":"Timothy Thomas Ryan","bio":"Tim Ryan was born on July 5, 1899 in Bayonne, New Jersey, USA as Timothy Thomas Ryan. He was an actor and writer, known for From Here to Eternity (1953), Detour (1945) and Will You Stop! (1937). He was married to Irene Ryan. He died on October 22, 1956 in Hollywood, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0752878","name":"Tim Ryan","idIMDB":"nm0752878"},"actorId":"nm0752878","character":"Mr. Kennedy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larry Parks","urlProfile":"http://www.imdb.com/name/nm0662972","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NDgwMzk2MF5BMl5BanBnXkFtZTYwNTg3NDE5._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1914","placeOfBirth":" Olathe, Kansas, USA","birthName":"Sam Klusman Lawrence Parks","height":"5' 10\" (1.78 m)","bio":"When amiable Columbia Pictures actor Larry Parks was entrusted the role of entertainer Al Jolson in the biopic The Jolson Story (1946), his career finally hit the big time. Within a few years, however, his bright new world crumbled courtesy of the House Un-American Activities Committee after the actor admitted under pressure that he was once affiliated with the Communist Party. Although he unwillingly testified in 1951, he was still (unofficially) blacklisted. Never-say-die Larry managed to continue his career in years to come - both here and abroad, on stage and in nightclubs - alongside steadfast wife Betty Garrett. His film career, however, literally came to a standstill and would never be the same again. Samuel Klausman Lawrence Parks was born in Olathe, Kansas, on December 13, 1914, of German and Irish descent. As a child growing up in Joliet, Illinois, he was plagued by a variety of illnesses, including rheumatic fever, but persevered with physical exercise and sheer strength of will. Majoring in science at the University of Illinois, his plans to become a doctor dissolved when, to the dismay of his parents, he found a passionate sideline in college dramatics. He began appearing in touring shows, then made the big move to New York, finding initial employment as an usher at Carnegie Hall and a tour guide at Radio City. Following a number of summer stock shows, he made an inauspicious 1937 Broadway debut with a minor role in the Group Theatre's presentation of \"Golden Boy\". Developing a close-knit relationship with the Group, he was just beginning to build up his resumé in such Broadway outings as \"All the Living\", \"My Heart's in the Highlands\" and \"Pure in Heart\" when he had to return to his Illinois home following the death of his father. He toiled for a time in Chicago as a Pullman inspector on the New York Central Railroad until the possibility of a film role had him re-setting his acting sights on Los Angeles. Although the film deal fell through, Larry stayed in L.A. and somehow made ends meet working construction. Columbia expressed interest in the fledgling actor and signed him up in 1941 after a favorable screen test. He stayed for nine years. His buildup was slow-moving, taking his first small step with a minor role in Mystery Ship (1941). Time, however, did not increase the tempo or quality of his movies. Either he was oddly cast, such as his role as an Indian opposite exotic Yvonne De Carlo in The Deerslayer (1943), or completely dismissed, as co-star of such obscurities as The Black Parachute (1944), Sergeant Mike (1944) or She's a Sweetheart (1944). His association with the Group Theatre back in New York led to a chance introduction to musical actress Betty Garrett and the couple married in 1944. Larry had settled by this time in Hollywood but Betty was a hot item on Broadway. MGM finally offered her a contract and she relocated to Los Angeles to join her husband. The couple eventually had two children, one of whom, Andrew Parks, became a fine actor in his own right. Their other son, Garrett Parks, served as composer for the film Diamond Men (2000). Larry scored an Oscar nomination playing Jolson (which was originally offered to both James Cagney and Danny Thomas), and hoped for equally challenging roles. His hopes were dashed as the studio instead continued casting him haphazardly in mild-mannered comedies and swashbuckling adventures. Other than the box-office sequel Jolson Sings Again (1949), most of Larry's films were hardly worthy of his obvious talent. To compensate somewhat, he managed to find a creative outlet in summer stock, and both he and Betty put together a successful vaudeville act with one tour ending up playing London's Palladium. Following the completion of Love Is Better Than Ever (1952) with Elizabeth Taylor, the political scandal erupted and erased all of his chances to do film. One of many casualties of Hollywood \"blacklisting\", he was forced to end his association with Columbia, and he and Betty, whose own career was damaged, traveled to Europe to find work. He found some TV parts after the controversy died down, and Betty and Larry were a delightful replacement for Judy Holliday and Sydney Chaplin on Broadway in \"Bells Are Ringing\". During the many meager times, he concentrated on becoming a successful businessman, including building apartment complexes. He made only two more films, last playing a doctor in the Montgomery Clift starrer Freud (1962). By the time he died of a heart attack on April 13, 1975, at age 60, Larry had long faded from view. Betty, however, managed to revitalize her career on TV sitcoms with regular roles on All in the Family (1971), Laverne & Shirley (1976), and roles on numerous other TV series before passing on February 12, 2011.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1NDgwMzk2MF5BMl5BanBnXkFtZTYwNTg3NDE5._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0662972","name":"Larry Parks","idIMDB":"nm0662972"},"actorId":"nm0662972","character":"Eddie Ross","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barbara Brown","urlProfile":"http://www.imdb.com/name/nm0113072","urlPhoto":"","biography":{"dateOfBirth":"18 October 1901","placeOfBirth":" Los Angeles, California, USA","birthName":"Barbara Ann Brown","bio":"Barbara Brown was born on October 18, 1901 in Los Angeles, California, USA as Barbara Ann Brown. She was an actress, known for Born Yesterday (1950), Jack and the Beanstalk (1952) and You Were Never Lovelier (1942). She was married to William Hinshaw. She died on July 7, 1975 in Los Angeles.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0113072","name":"Barbara Brown","idIMDB":"nm0113072"},"actorId":"nm0113072","character":"Mrs. Beverly Ross","urlCharacter":"http://www.imdb.com/character/ch0494028","main":true},{"actorName":"Douglas Leavitt","urlProfile":"http://www.imdb.com/name/nm0495382","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTc5ZDVhNjItYmQ2Yy00MDk0LWE5OTEtZDY3MTgxNzg4Y2M0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1883","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Abram Leavitt","bio":"Douglas Leavitt was born on January 7, 1883 in Boston, Massachusetts, USA as Abram Leavitt. He was an actor and writer, known for You Were Never Lovelier (1942), Oh, Say Can You Hear? (1937) and Cupid Takes a Holiday (1938). He died on March 3, 1960 in Leavittown, Pennsylvania, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTc5ZDVhNjItYmQ2Yy00MDk0LWE5OTEtZDY3MTgxNzg4Y2M0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0495382","name":"Douglas Leavitt","idIMDB":"nm0495382"},"actorId":"nm0495382","character":"Mr. Ross","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adele Mara","urlProfile":"http://www.imdb.com/name/nm0544711","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmU3MTcwOGItZjNlZi00YTUyLWI2YTctZTM3YzRlOTNkZDY2XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1923","placeOfBirth":" Highland Park, Michigan, USA","birthName":"Adelaide Delgado","bio":"Born Adelaide Delgado in 1925, Spanish-American Adele Mara was a singer/dancer with Xavier Cugat and His Orchestra in Detroit by the age of 15. Cugat took the beautiful, brown-eyed brunette to New York where she was spotted by a Columbia talent scout and signed in 1942. There she played brisk leading ladies in a series of standard, uneventful \"B\" films including Vengeance of the West (1942) with Tex Ritter and Alias Boston Blackie (1942) starring Chester Morris. A couple of years later she was transformed into a sexy platinum blonde pin-up after signing up with Republic Studios. She kept herself quite busy there predominantly cast as senorita-types opposite cowboy stars Roy Rogers in Bells of Rosarita (1945) and Gene Autry in Twilight on the Rio Grande (1947). She was also fetching fodder in crime dramas including Blackmail (1947) and Web of Danger (1947) and a pleasant diversion in adventure pictures such as Wake of the Red Witch (1948) with John Wayne and The Avengers (1950). Arguably her best parts would come with Angel in Exile (1948) and Sands of Iwo Jima (1949), the latter again starring Duke Wayne. Seldom was she given the chance to prove her acting talents, however, and her film career waned in the early 1950s. Her last screen appearance would be in The Big Circus (1959) with Victor Mature. Adele subsequently moved into TV and was featured in a number of guest spots, primarily in westerns. She eventually settled down to raise a family after her marriage to TV mogul Roy Huggins who produced many hit shows including 77 Sunset Strip (1958) and Maverick (1957). She would appear as a guest in a number of them. The couple had three sons. Huggins died in 2002.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmU3MTcwOGItZjNlZi00YTUyLWI2YTctZTM3YzRlOTNkZDY2XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0544711","name":"Adele Mara","idIMDB":"nm0544711"},"actorId":"nm0544711","character":"Evelyn Ross","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Walter Sande","urlProfile":"http://www.imdb.com/name/nm0761340","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWRlODgyYTEtMWEyMC00ZjY5LTllZGItZjlhZDkxYzE1ZjUyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1906","placeOfBirth":" Denver, Colorado, USA","height":"5' 6½\" (1.69 m)","bio":"Chances are you've seen his imposing character face scores of times but couldn't place the name. Colorado-born actor Walter Sande was one of those stern, heavyset character actors in Hollywood everyone recognized but no one could identify. Born in Denver on July 9, 1906, Sande showed an early passion for music as a youth and by his college years managed to start his own band. This led to a job as musical director for 20th Century-Fox's theater chain, which in turn led to acting in films beginning in 1937. Usually providing atmospheric bits with no billing, he made an initial impression in serial cliffhangers as a third-string heavy with the popular The Green Hornet Strikes Again! (1940) and Sky Raiders (1941). His first top featured role, however, would come with The Iron Claw (1941) as Jack \"Flash\" Strong, a photographer who--uncharacteristically for Walter--served as a comic sidekick to the serial's hero. Best of all would be his role in another serial as Red Pennington, the amusing sidekick to Don Winslow of the Navy (1942). he repeated his role again in Don Winslow of the Coast Guard (1943), the successful sequel. The role of Pennington sparked a long and steady supporting career in movies, usually a step or two behind Hollywood's elite on camera, which included Humphrey Bogart and Lauren Bacall in To Have and Have Not (1944) (prominently featured as the fisherman who tries to cheat Bogie), Gary Cooper in Along Came Jones (1945), Alan Ladd in The Blue Dahlia (1946), Charlton Heston in Dark City (1950) and Spencer Tracy in Bad Day at Black Rock (1955), among hundreds of others. He also lent an an authoritative presence to classic sci-fi films such as Red Planet Mars (1952), The War of the Worlds (1953) and Invaders from Mars (1953), and also had a recurring featured part in the 1940s \"Boston Blackie\" film series playing Detective Matthews alongside Chester Morris' former thief-turned-crime hero. A prolific supporting player during the \"golden age\" of TV, Sande worked on nearly every popular western and crime show that aired throughout the 1950s and 1960s. He had a regular series role on The Adventures of Tugboat Annie (1957) as Capt. Horatio Bullwinkle, Annie's tugboat rival, and a recurring one as Inger Stevens' Swedish father, Lars \"Papa\" Holstrum, on The Farmer's Daughter (1963). Walter Sande died of a heart attack in 1971 at age 65.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWRlODgyYTEtMWEyMC00ZjY5LTllZGItZjlhZDkxYzE1ZjUyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0761340","name":"Walter Sande","idIMDB":"nm0761340"},"actorId":"nm0761340","character":"Pvt. Puckett aka Canvassback","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wally Vernon","urlProfile":"http://www.imdb.com/name/nm0894734","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjk5NGM0NGEtMjkyYS00MTBkLTgxMDQtOWE4NjQzZmQ2MWVmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 May 1905","placeOfBirth":" New York City, New York, USA","birthName":"Walter J. Vernon","bio":"Both a great dancer and a hilarious comedian, in show business since the age of three, Wally Vernon could have had a more significant screen career than he had. Not in terms of quantity since he appeared in no fewer than ninety-five movies or TV episodes but in terms of quality. Indeed besides Henry King and his delightful Alexander's Ragtime Band (1938), no major director gave him a key role in a major picture. It is a pity, for Vernon was an excellent (eccentric) dancer à la Donald O'Connor who would have graced many a great musical with his dizzying presence. On the other hand his ability to deliver Runyon-esque dialogue would have been welcome in screwball comedy masterpieces by Frank Capra, George Cukor or Howard Hawks. Instead he served as a comical sidekick to Don 'Red' Barry in a series of low grade westerns or as a stooge to Eddie Quillan in a score of mildly amusing Columbia shorts. Television finally did justice to Vernon's special talents by making him a regular of the series \"Damon Runyon Theater\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjk5NGM0NGEtMjkyYS00MTBkLTgxMDQtOWE4NjQzZmQ2MWVmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0894734","name":"Wally Vernon","idIMDB":"nm0894734"},"actorId":"nm0894734","character":"Stomp McCoy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andrew Tombes","urlProfile":"http://www.imdb.com/name/nm0866558","urlPhoto":"","biography":{"dateOfBirth":"29 June 1885","placeOfBirth":" Ashtabula, Ohio, USA","height":"5' 11\" (1.8 m)","bio":"You'd think with a last name like that, character player Andrew Tombes was doomed to play gravediggers in horrors or coroners in crime drama. Not usually, and when he did, it was often played for laughs. Born June 29, 1885 in Ohio, he was an athletic sort who played a lively, talented game of college baseball at Phillips-Exeter Academy but the dreams of entertaining quickly took over. As a performer he started things off in minstrels and musical revues, and appeared notably as a vaudevillian comic. Appearances in \"Flo-FLo (1908), The College Girls\" (1909), \"Miss 1917\" (1917) and \"Poor Little Ritz Girl\" (1920) led to the really big time for a comedian -- Ziegfeld. He slayed 'em as a star headliner in the Ziegfeld Follies in the 1920s, and played a wide range of squirrely parts in everything from Shakespeare to screwball farce. It was friend 'Will Rogers' from his old Follies days, who invited Tombes, at age 50, to settle in Hollywood as a prime featured performer in Rogers' film vehicle Doubting Thomas (1935). Thereafter at Fox he played the quintessentially bald, bemused and bug-eyed executive, professor, police captain, movie mogul or school administrator, but the parts got smaller and smaller. He went on to freelance in scores of featherweight \"B\" movies, often uncredited, mostly musicals and/or comedies. On the funereal side, he did play a dour undertaker's assistant in the Hope/Crosby vehicle Road to Morocco (1942) and a mortician in The Mad Ghoul (1943). True to form, his last movie role was in a comedy, the forgettable The Go-Getter (1956). He died about two decades later at the age of 90 in New York City.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0866558","name":"Andrew Tombes","idIMDB":"nm0866558"},"actorId":"nm0866558","character":"Mr. Smith","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bob Crosby Orchestra","urlProfile":"http://www.imdb.com/name/nm1261210","urlPhoto":"","biography":{"bio":"The members of Ben Pollack's band had been left stranded in New York City when Pollack quit. After breaking up, the band regrouped without Pollack in New York in 1934 with the saxophonist Gil Rodin, Pollack's former right hand man, as leader. They played for Red Nichols on the \"Kellogg College Prom\" radio show, and subsequently recorded under the name of their singer Clark Randall. A year later the band ditched Randall to try to make it on their own. When Rodin decided he didn't want to be the front man for the band, they offered Jack Teagarden the job as leader. Contracted to Paul Whiteman, Teagarden declined the offer, and agent Corky O'Keefe suggested three alternatives: singer Johnnie Davis of Fred Waring and His Pennsylvanians, Whiteman trumpeter Harry \"Goldie\" Goldfield, and Bob Crosby, who was singing with the Dorsey Brothers. Rodin had met and liked Crosby, and he was offered the position. The Bob Crosby Orchestra was incorporated with Rodin, Crosby and the Rockwell-O'Keefe Booking Agency as owners. Rodin was the guiding force behind the band. The Bob Crosby Orchestra, and its combo side group, the Bob Cats, is considered one of the greatest jazz bands of all time, although in the mid- to late-1930s, when swing was king, Dixieland was considered old-fashioned by many young hipsters, who lionized Benny Goodman. Crosby turned out to be the perfect front man, as he was popular with the audience. A friendly man, Crosby respected and admired his musicians and never interfered with Rodin's running of the band. The rhythm section was led by bassist Bob Haggart and drummer Ray Bauduc, the duo who wrote \"South Rampart Street Parade\" and \"Big Noise from Winnetka,\" the latter turning out to be a huge hit. Other musicians featured in the band were Charlie Spivak and Billy Butterfield, and its singers included Kay Weber and Doris Day. The band's arranger was Deane Kincaide. Tommy Dorsey raided the Crosby band in 1938, purloining Kincaide, Spivak, and pianist Yank Lawson. As a consequence, the band began to deemphasize Dixieland in favor of more commercial arrangements. With lead vocalist Dorothy Claire, who was backed by Helen Ward and Johnny Mercer, the Bob Crosby Orchesstra became the featured band on the \"Camel Caravan\" radio program in 1939. Within a year, the band had left the Dixieland sound behind, using Paul Weston, Ray Conniff, Henry Mancini and Nelson Riddle as arrangers. The Bob-O-Links, which included future Glenn Miller vocalist Johnny Desmond, handled the vocals. By 1941, the band returned to its Dixieland roots, and featured Liz Tilton as vocalist. With the coming of World War II, the draft carried off many of the band's key members, including Rodin, and Crosby followed his older brother Bing into the movies in 1942. Eddie Miller was left in charge of the band, but it did not survive his induction into the service. Crosby himself was drafted, accepted a Marine Corps commission, and toured the Pacific Theater with various bands.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1261210","name":"Bob Crosby Orchestra","idIMDB":"nm1261210"},"actorId":"nm1261210","character":"Orchestra","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Freddie Slack and His Orchestra","urlProfile":"http://www.imdb.com/name/nm3634962","urlPhoto":"","biography":{"bio":"After spells with Jimmy Dorsey and Will Bradley, pianist Freddie Slack started out on his own as a leader in 1941. His orchestra played mainly on the West Coast adopting a boogie-woogie style akin to the Bradley/McKinley band. Slack enjoyed his greatest success after signing vocalist Ella Mae Morse. The Capitol recording of \"Cow Cow Boogie\" -- a substantial hit -- was followed by another in \"Mr. Five by Five\". The band's theme song was \"Strange Cargo,\" which Slack had composed himself. Among other numbers he contributed were \"Cuban Sugar Mill, \"Riffette\", \"Rib Joint\" and \"Mr. Freddie's Boogie\". Vocalist Margaret Whiting, a protégé of Slack, performed \"That Old Black Magic\" and \"Silver Wings in the Moonlight\". Slack briefly disbanded his orchestra from early 1945 to mid-1946. He then reorganised, continuing on until the early 1950's. He subsequently restricted his appearances to nightclubs and cocktail lounges, performing as part of a trio or piano duo. During its heyday, the Freddie Slack Band was featured in several musicals for Monogram and Universal, including Reveille with Beverly (1943) and Seven Days Ashore (1944). Sidemen included at various times the outstanding clarinettist and tenor saxophonist Barney Bigard, as well as trumpet players Manny Klein and Clyde Hurley.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm3634962","name":"Freddie Slack and His Orchestra","idIMDB":"nm3634962"},"actorId":"nm3634962","character":"Orchestra","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ella Mae Morse","urlProfile":"http://www.imdb.com/name/nm0607595","urlPhoto":"","biography":{"dateOfBirth":"12 September 1924","placeOfBirth":" Mansfield, Texas, USA","bio":"Ella Mae Morse was born on September 12, 1924 in Mansfield, Texas, USA. She was an actress, known for Sweet Dreams (1985), Reveille with Beverly (1943) and How DOooo You Do (1945). She was married to Jack Bradford. She died on October 16, 1999 in Bullhead City, Arizona, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0607595","name":"Ella Mae Morse","idIMDB":"nm0607595"},"actorId":"nm0607595","character":"Ella Mae Morse","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0036306","urlIMDB":"http://www.imdb.com/title/tt0036306","business":{"budget":{"money":"$40,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$2,100,000 (USA)","country":"","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 18 min (78 min)"],"soundMix":["Mono (Western Electric Mirrophonic Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["2,132.65 m (9 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.7","filmingLocations":[],"rated":"APPROVED","awards":[],"votes":"245","type":"Movie","companyCreditsSimple":[{"idCompany":"co0050868","name":"Columbia Pictures Corporation"}],"keywords":{"keywords":["radio","switchboard operator","swing","gay","twin","headline","mother daughter relationship","father daughter relationship","world war two","usa","u.s. army","tuxedo","train","tap dancer","slang","show business","recruit","radio program","radio announcer","racial stereotype","quartet","pop music","piano","performer","patriot","parade","orchestra","microphone","lead singer","jitterbug","jeep","jazz","high heels","hepcat","drummer","dancing","dance","dancer","costume","comedy team","boogie woogie","blues","big band","bass","based on radio show","bandleader","b movie","army base","sergeant","character name in title","actor shares last name with character","actor shares first and last name with character","actor shares first name with character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 01:50:59"}}