{"data":{"movies":[{"title":"The Big Blue","originalTitle":"Le grand bleu","year":"1988","releaseDate":"19880819","directors":[{"name":"Luc Besson","id":"nm0000108"}],"writers":[{"name":"Luc Besson","id":"nm0000108"},{"name":"Luc Besson","id":"nm0000108"}],"runtime":"168 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM3NDgzNDQzMF5BMl5BanBnXkFtZTgwOTg0NjE0MDE@._V1.jpg","countries":["France"],"languages":["English","French","Italian"],"genres":["Adventure","Drama","Sport"],"plot":"Enzo and Jacques have known each other for a long time. Their friendship started in their childhood days in the Mediterranean. They were not real friends in these days, but there was something they both loved and used to do the whole day long: diving. One day Jacques' father, who was a diver too, died in the Mediterranean sea. After that incident Enzo and Jacques lost contact. After several years, Enzo and Jacques had grown up, Johanna, a young clerk in an insurance office, has to go to Peru. There she meets Jacques who is being studied by a group of scientists. He dives for some minutes into ice-cold water and the scientists monitor his physical state that is more like a dolphin than human. Johanna can not believe what she sees and gets very interested in Jacques but she's unable to get acquainted with him. Some weeks later back in her office, she finds out that Jacques will be competing in a diving championship that takes place in Taormina, Sicily. In order to see Jacques again she ...","simplePlot":"The rivalry between Enzo and Jacques, two childhood friends and now world-renowned free divers, becomes a beautiful and perilous journey into oneself and the unknown.","actors":[{"actorName":"Rosanna Arquette","urlProfile":"http://www.imdb.com/name/nm0000275","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI0MjYxMzQ0OF5BMl5BanBnXkFtZTcwMTk0OTE3NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1959","placeOfBirth":" New York City, New York, USA","birthName":"Rosanna Lisa Arquette","height":"5' 4½\" (1.64 m)","bio":"Rosanna Arquette has acted extensively in film and television, and has come to be acknowledged as an actress of rare depth and scope. Arquette was born in New York City, New York. Her parents, Lewis Arquette, an actor, and Brenda Denaut (née Nowak), an acting teacher and therapist, had 4 other children: Richmond Arquette, Patricia Arquette, Alexis Arquette, and David Arquette, all actors. Her paternal grandfather, Cliff Arquette, was also an entertainer. Rosanna's mother was from an Ashkenazi Jewish family (from Poland and Russia), while Rosanna's father had French-Canadian, Swiss-German, and English ancestry. Growing up in a family of actors, she began working at a young age. Her first big break came as a teenager with a role in the Movie of the Week The Dark Secret of Harvest Home (1978), which starred Bette Davis. Several television roles followed, including an ABC Afterschool Specials (1972) and a part on the series James at 16 (1977) before her talents led to her film debut in Gorp (1980). Since then she has acted in a steady stream of films, including John Sayles' Baby It's You (1983), Fathers & Sons (1992) with Jeff Goldblum, Silverado (1985) (which also featured Goldblum), The Linguini Incident (1991), Martin Scorsese's segment of New York Stories (1989) with Nick Nolte, and many others. She feels particularly proud of her offbeat roles in such independent films as After Hours (1985), Nobody's Fool (1986), and Desperately Seeking Susan (1985), for which she won the British Academy Award. Ms. Arquette was nominated for an Emmy for her work in the controversial The Executioner's Song (1982). She continues her work on television as well as the big screen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI0MjYxMzQ0OF5BMl5BanBnXkFtZTcwMTk0OTE3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000275","name":"Rosanna Arquette","idIMDB":"nm0000275"},"actorId":"nm0000275","character":"Johana","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean-Marc Barr","urlProfile":"http://www.imdb.com/name/nm0000852","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzE3NjE0N15BMl5BanBnXkFtZTYwMjczNDcz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 September 1960","placeOfBirth":" Bitburg, Rhineland-Palatinate, Germany","height":"5' 11\" (1.8 m)","bio":"Jean-Marc Barr was born on September 27, 1960 in Bitburg, Rhineland-Palatinate, Germany. He is an actor and producer, known for Dogville (2003), Breaking the Waves (1996) and Europa (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzE3NjE0N15BMl5BanBnXkFtZTYwMjczNDcz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000852","name":"Jean-Marc Barr","idIMDB":"nm0000852"},"actorId":"nm0000852","character":"Jacques Mayol","urlCharacter":"http://www.imdb.com/character/ch0014933","main":true},{"actorName":"Jean Reno","urlProfile":"http://www.imdb.com/name/nm0000606","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNjA1MjY2M15BMl5BanBnXkFtZTYwMjgzOTk0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1948","placeOfBirth":" Casablanca, French Protectorate of Morocco [now Morocco]","birthName":"Juan Moreno y Herrera Jiménez","height":"6' 2\" (1.88 m)","bio":"Jean Reno was born Juan Moreno y Herrera-Jiménez in Casablanca, Morocco, to Spanish parents (from Andalucía) who moved to North Africa to seek work. His father was a linotypist. Reno settled in France at 17. He began studying drama and has credits in French television and theater as well as films. His first two marriages both ended in divorce, and he had two children with each of them. He keeps homes in Paris and Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNjA1MjY2M15BMl5BanBnXkFtZTYwMjgzOTk0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000606","name":"Jean Reno","idIMDB":"nm0000606"},"actorId":"nm0000606","character":"Enzo Molinari","urlCharacter":"http://www.imdb.com/character/ch0014932","main":true},{"actorName":"Paul Shenar","urlProfile":"http://www.imdb.com/name/nm0791502","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzOTA1NjA5Nl5BMl5BanBnXkFtZTcwNTg3MzkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1936","placeOfBirth":" Milwaukee, Wisconsin, USA","birthName":"Albert Paul Shenar","height":"6' 1½\" (1.87 m)","bio":"Attractive, dark-featured character actor with a voice like thunder, and eyes like a wolf, who was featured in less than sympathetic roles throughout his career. Born and raised in Milwaukee, Wisconsin, Albert Paul Shenar attended the University of Wisconsin. Soon after graduation, he relocated to New York City, where he quickly landed roles on the stage. These experiences led to a Broadway debut in 'Tiny Alice' as 'Brother Julian.' After a few satiating years on and off Broadway, Paul found himself again relocating, this time to Philadelphia. It was here where he made a considerable contribution to the arts. Along with fellow actors Rene Auberjonois and Bill Ball, to name a few, he co-founded the American Conservatory Theater, where he was not only a regular performer until the day he died, but a teacher and advisor as well. From there, roles on television, and the big screen followed. Shenar made a splash, portraying Orson Welles in The Night That Panicked America (1975). He received some of the best reviews of his career for this famous television film. Soon after he received more for his portrayal of another famous celebrity, as Florenz Ziegfeld in Ziegfeld: The Man and His Women (1978). He continued working steadily on television, even appearing in shot-for-television replacement footage for the disaster film, Two-Minute Warning (1976). And then feature films came calling. Shenar turned in credible and memorable performances in film, such as the diabolical Columbian drug lord Alejandro Sosa, in 'Brian De Palma''s _Scarface(1983)_, and most notably, voicing the evil conspiring rat, Jenner, in Don Bluth's The Secret of NIMH (1982). Other roles of note include Dr. Lawrence in Luc Besson's The Big Blue (1988), Joshua Adams in Deadly Force (1983), Paulo Rocca in the action packed Arnold Schwarzenegger film, Raw Deal (1986), and Ben Gardner, the father of a troubled Kristy MacNicol, in Alan J. Pakula's Dream Lover (1986), respectively. Though not a household name in his time, his candor, energy, and aesthetic performances have left a long lasting impression, that only gets better with age, and will not soon be forgotten.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzOTA1NjA5Nl5BMl5BanBnXkFtZTcwNTg3MzkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0791502","name":"Paul Shenar","idIMDB":"nm0791502"},"actorId":"nm0791502","character":"Dr. Laurence","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sergio Castellitto","urlProfile":"http://www.imdb.com/name/nm0144812","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMzAwNTQxMV5BMl5BanBnXkFtZTcwOTQ0MDgwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1953","placeOfBirth":" Rome, Lazio, Italy","height":"5' 10\" (1.78 m)","bio":"Sergio Castellitto was born in Rome in 1953. After graduating from the Silvio D'Amico National Academy of Dramatic Art in 1978, he began his theatrical career in Italian public theater with \"Shakespeare's Measure for Measure\" at the Teatro di Roma and with roles in other plays such as \"La Madre by Brecht\", \"Merchant of Venice\", and \"Candelaio\" by Giordano Bruno. At the Teatro di Genova he starred in the roles of Tuzenbach in \"Chekhov's Three Sisters\" and \"Jean in Strindberg's Miss Julie\", both under the direction of Otomar Krejka. In the coming years, he also starred in such theatrical productions as \"L'infelicità senza desideri\" and \"Piccoli equivoci\" at the Festival dei Due Mondi in Spoleto. He also appeared in \"Barefoot in the Park\" by Neil Simon. During his years in the theatre, he worked alongside many famous actors, including Luigi Squarzina, Aldo Trionfo, and Enzo Muzii. Castellitto began his film career in 1983 beside Marcello Mastroianni and Michel Piccoli in \"The General of the Dead Army\" by Luciano Tovoli. He interpreted many films like \"Sembra morto...ma è solo svenuto\" directed by Felice Farina, \"Piccoli equivoci\" by Ricky Tognazzi and \"Stasera a casa di Alice\" by Carlo Verdone. He became more famous with the films \"The Great Pumpkin\" by Francesca Archibugi and \"The Star Maker\" by Giuseppe Tornatore. In the late 1980s, Castellitto appeared in several Italian television miniseries, including \"Un siciliano in Sicilia\" (1987), \"Cinque storie inquietanti\" (1987), \"Piazza Navona\" (1988), \"Cinéma\" (1988), and \"Come stanno bene insieme\" (1989). He also appeared in the miniseries \"Victoire, ou la douleur des femmes\" (2000). Success arrived with the films \"La famiglia\", \"L'ultimo bacio\", \"Caterina in the Big City\", \"My Mother's Smile\", \"Mostly Martha\", and especially with \"Don't Move\", written by his wife Margaret Mazzantini. Other films that he interpreted include \"Il regista di matrimoni\" by Marco Bellocchio and La stella che non c'è by Gianni Amelio. In France Castellitto played the male lead opposite Jeanne Balibar in Jacques Rivette's Va savoir (2001). His most recent accomplishment as actor has been in his role as \"Padre Pio: Miracle Man\", arguably the defining role of his career. The first film that he directed is \"Libero Burro\", followed by \"Don't Move\". He played the role of the antagonist, King Miraz, in the film \"The Chronicles of Narnia: Prince Caspian\". His most recent film as director was \"Twice Born\", which played at the Toronto Film Festival (2012), where it was not well received by much of the English speaking press. Most recently, Castellitto appeared in the television series \"In Treatment\" in the role of Giovanni. Castellitto is married to Margaret Mazzantini with four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMzAwNTQxMV5BMl5BanBnXkFtZTcwOTQ0MDgwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0144812","name":"Sergio Castellitto","idIMDB":"nm0144812"},"actorId":"nm0144812","character":"Novelli","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean Bouise","urlProfile":"http://www.imdb.com/name/nm0099366","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NDE0Mjg4Nl5BMl5BanBnXkFtZTgwNzU0OTIwOTE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 June 1929","placeOfBirth":" Le Havre, Seine-Inférieure [now Seine-Maritime], France","bio":"Jean Bouise was born on June 3, 1929 in Le Havre, Seine-Inférieure [now Seine-Maritime], France. He was an actor, known for The Big Blue (1988), Le Dernier Combat (The Last Battle) (1983) and Subway (1985). He was married to Isabelle Sadoyan. He died on July 6, 1989 in Lyon, Rhône, France.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NDE0Mjg4Nl5BMl5BanBnXkFtZTgwNzU0OTIwOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0099366","name":"Jean Bouise","idIMDB":"nm0099366"},"actorId":"nm0099366","character":"Uncle Louis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marc Duret","urlProfile":"http://www.imdb.com/name/nm0244019","urlPhoto":"","biography":{"dateOfBirth":"28 September 1957","placeOfBirth":" Nice, Alpes-Maritimes, France","height":"5' 3\" (1.6 m)","bio":"Marc Duret was born on September 28, 1957 in Nice, Alpes-Maritimes, France. He is an actor and writer, known for La Femme Nikita (1990), The Big Blue (1988) and La Haine (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0244019","name":"Marc Duret","idIMDB":"nm0244019"},"actorId":"nm0244019","character":"Roberto","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Griffin Dunne","urlProfile":"http://www.imdb.com/name/nm0001162","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzM4MzM3Nl5BMl5BanBnXkFtZTYwODIyMzYz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1955","placeOfBirth":" New York City, New York, USA","birthName":"Thomas Griffin Dunne","height":"5' 7\" (1.7 m)","bio":"Griffin Dunne was born on June 8, 1955 in New York City, the oldest child of Dominick Dunne, a producer, actor, and writer, and Ellen Beatriz (Griffin) Dunne, an activist. His sister was actress Dominique Dunne. He grew up mainly in Los Angeles, California and attended school in Colorado before moving back to New York in the late 1970s. As an actor, Dunne has the distinction of having starred in two 1980s cult favorites. First came the John Landis monster movie An American Werewolf in London (1981), then the Martin Scorsese black comedy After Hours (1985). After Hours is also among the movies that Dunne has produced with partner Amy Robinson through their company Double Play Productions. Other Double Play productions include Running on Empty (1988), White Palace (1990) and Once Around (1991). Dunne has continued to appear on both sides of the camera, taking supporting roles as an actor in films like My Girl (1991) and I Like It Like That (1994). He made his directorial debut with a short film, Duke of Groove (1996), which was nominated for an Oscar. Dunne then made the leap to feature films with Addicted to Love (1997), Practical Magic (1998), Lisa Picard Is Famous (2000) and Fierce People (2005). Dunne produced and starred in the film Game 6 (2005), which premiered at the Sundance Film Festival in 2005. Griffin's ancestry is Irish (from his father) and Irish, English, German, Mexican, and Swedish (from his mother).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwMzM4MzM3Nl5BMl5BanBnXkFtZTYwODIyMzYz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001162","name":"Griffin Dunne","idIMDB":"nm0001162"},"actorId":"nm0001162","character":"Duffy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andréas Voutsinas","urlProfile":"http://www.imdb.com/name/nm0903867","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWVjZmNiNmMtMmJkNi00MDRhLWE5YjQtZWRjMmQyNTE2OGZhXkEyXkFqcGdeQXVyMTI3MDk3MzQ@._V1_UY44_CR25,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 August 1930","placeOfBirth":" Khartoum, Sudan","bio":"Andréas Voutsinas was born on August 22, 1930 in Khartoum, Sudan. He is known for his work on The Big Blue (1988), The Producers (1967) and The Twelve Chairs (1970). He died on June 8, 2010 in Athens, Greece.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWVjZmNiNmMtMmJkNi00MDRhLWE5YjQtZWRjMmQyNTE2OGZhXkEyXkFqcGdeQXVyMTI3MDk3MzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0903867","name":"Andréas Voutsinas","idIMDB":"nm0903867"},"actorId":"nm0903867","character":"Priest","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Valentina Vargas","urlProfile":"http://www.imdb.com/name/nm0889926","urlPhoto":"","biography":{"dateOfBirth":"31 December 1964","placeOfBirth":" Santiago, Chile","bio":"Valentina Vargas is a Chilean-born actress. She developed most of her career in France, where she was raised. Vargas began her career in the dramatic art within the workshop of Tania Balachova in Paris and also later at the Yves Pignot School of Los Angeles. Her cinematographic career started via the filming of three French movies, namely Pierre Jolivet's Strictement personnel (1985), Luc Besson's The Big Blue (1988) and Jean-Jacques Annaud's The Name of the Rose (1986). Over the years, Vargas also worked with Samuel Fuller in Samuel Fuller's Street of No Return (1989), Miguel Littín in Los Náufragos (1994) and Alfredo Arieta in Fuegos (1987). Vargas is trilingual in Spanish, French and English. This has enabled her to pass without notice in films as varied as the cinematic horror film Hellraiser: Bloodline (1996) where she played the Cenobite Angelique, to the comedy Chili con carne (1999) of Thomas Gilou. She appeared opposite Jan Michael Vincent (Dirty Games (1989)), Malcolm McDowell and Michael Ironside (Southern Cross (1999)), and James Remar (The Tigress (1992)). After her performance in Bloody Mallory (2002) where she played \"Lady Valentine/Carmina Belladone\", she turned to playing roles for television. Initially she played in a version of Dangerous Liaisons (2003) directed by Josée Dayan. She starred in this production with Catherine Deneuve, Rupert Everett, Leelee Sobieski and Nastassja Kinski.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0889926","name":"Valentina Vargas","idIMDB":"nm0889926"},"actorId":"nm0889926","character":"Bonita","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kimberly Beck","urlProfile":"http://www.imdb.com/name/nm0065206","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzg4MzE5MV5BMl5BanBnXkFtZTcwMDIxODUxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1956","placeOfBirth":" Glendale, California, USA","bio":"Kimberly Beck was born on January 9, 1956 in Glendale, California, USA. She is known for her work on General Hospital (1963), Independence Day (1996) and Friday the 13th: The Final Chapter (1984). She has been married to Jason Clark since December 28, 1988. They have two children. She was previously married to William Barron Hilton.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzg4MzE5MV5BMl5BanBnXkFtZTcwMDIxODUxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0065206","name":"Kimberly Beck","idIMDB":"nm0065206"},"actorId":"nm0065206","character":"Sally","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patrick Fontana","urlProfile":"http://www.imdb.com/name/nm0284938","urlPhoto":"","biography":{"bio":"Patrick Fontana is an actor, known for La Femme Nikita (1990), The Big Blue (1988) and Exit (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0284938","name":"Patrick Fontana","idIMDB":"nm0284938"},"actorId":"nm0284938","character":"Alfredo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alessandra Vazzoler","urlProfile":"http://www.imdb.com/name/nm0891490","urlPhoto":"","biography":{"bio":"Alessandra Vazzoler is an actress, known for The Big Blue (1988), Troppo forte (1986) and L'innocent (1976).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0891490","name":"Alessandra Vazzoler","idIMDB":"nm0891490"},"actorId":"nm0891490","character":"La Mamma","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Geoffrey Carey","urlProfile":"http://www.imdb.com/name/nm0136953","urlPhoto":"","biography":{"bio":"Geoffrey Carey is known for his work on Holy Motors (2012), Kings & Queen (2004) and The Big Blue (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0136953","name":"Geoffrey Carey","idIMDB":"nm0136953"},"actorId":"nm0136953","character":"Supervisor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bruce Guerre-Berthelot","urlProfile":"http://www.imdb.com/name/nm0346111","urlPhoto":"","biography":{"bio":"Bruce Guerre-Berthelot is an actor, known for The Big Blue (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0346111","name":"Bruce Guerre-Berthelot","idIMDB":"nm0346111"},"actorId":"nm0346111","character":"Young Jacques","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0095250","urlIMDB":"http://www.imdb.com/title/tt0095250","business":{"budget":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"openingWeekend":[{"money":"$14,234","country":"USA","day":"16","month":"07","year":"2000","remarks":"5 Screens"},{"money":"€157,806","country":"Italy","day":"29","month":"09","year":"2002","remarks":"71 Screens"}],"gross":[{"money":"$80,804","country":"USA","day":"27","month":"08","year":"2000","remarks":""},{"money":"$80,195","country":"USA","day":"20","month":"08","year":"2000","remarks":""},{"money":"$78,200","country":"USA","day":"13","month":"08","year":"2000","remarks":""},{"money":"$67,116","country":"USA","day":"06","month":"08","year":"2000","remarks":""},{"money":"$47,545","country":"USA","day":"30","month":"07","year":"2000","remarks":""},{"money":"$19,129","country":"USA","day":"23","month":"07","year":"2000","remarks":""},{"money":"$14,234","country":"USA","day":"16","month":"07","year":"2000","remarks":""},{"money":"€442,992","country":"Italy","day":"13","month":"10","year":"2002","remarks":""},{"money":"€340,610","country":"Italy","day":"06","month":"10","year":"2002","remarks":""},{"money":"€157,806","country":"Italy","day":"29","month":"09","year":"2002","remarks":""},{"money":"SEK","country":"2,182,633","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$98","country":"USA","day":"27","month":"08","year":"2000","remarks":"1 Screen"},{"money":"$593","country":"USA","day":"20","month":"08","year":"2000","remarks":"1 Screen"},{"money":"$2,826","country":"USA","day":"13","month":"08","year":"2000","remarks":"2 Screens"},{"money":"$10,166","country":"USA","day":"06","month":"08","year":"2000","remarks":"4 Screens"},{"money":"$16,165","country":"USA","day":"30","month":"07","year":"2000","remarks":"6 Screens"},{"money":"$4,895","country":"USA","day":"23","month":"07","year":"2000","remarks":"3 Screens"},{"money":"$14,234","country":"USA","day":"16","month":"07","year":"2000","remarks":"5 Screens"},{"money":"€49,384","country":"Italy","day":"13","month":"10","year":"2002","remarks":"35 Screens"},{"money":"€99,495","country":"Italy","day":"06","month":"10","year":"2002","remarks":"54 Screens"}],"admissions":[],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"15","month":"06","year":"1987","remarks":null},null],"copyrightHolder":"© 1988 Gaumont"},"technical":{"runtime":["2 hr 48 min (168 min) (director's cut)","2 hr 12 min (132 min) (original cut) (France)","1 hr 58 min (118 min) (edited) (USA)"],"soundMix":["70 mm 6-Track (70 mm prints)","Dolby SR (35 mm prints)"],"color":["Black and White","Color (Eastmancolor)"],"aspectRatio":["2.20 : 1 (70 mm prints)","2.35 : 1"],"camera":["Moviecam Cameras"],"laboratory":["Laboratoires Éclair, Paris, France"],"filmLength":["3,279 m (original version) (Sweden)","3,290 m (original version) (Finland)","4,611 m (director's cut) (Sweden)","4,097 m"],"negativeFormat":["35 mm (Eastman)"],"cinematographicProcess":["CinemaScope (anamorphic)"],"printedFilmFormat":["35 mm","70 mm (blow-up)"]},"rating":"7.6","metascore":"35","filmingLocations":[{"location":"Ios Island, Greece"}],"rated":"R","awards":[{"award":"César Awards, France 1989","titlesAwards":[{"titleAwardOutcome":"Won César","categories":[{"category":"Best Music (Meilleure musique)","names":[{"name":"Eric Serra","id":"nm0785385","role":null}]},{"category":"Best Sound (Meilleur son)","names":[{"name":"Pierre Befve","id":"nm0066657","role":null},{"name":"Gérard Lamps","id":"nm0483961","role":null},{"name":"François Groult","id":"nm0343911","role":null}]}]},{"titleAwardOutcome":"Nominated César","categories":[{"category":"Best Film (Meilleur film)","names":[{"name":"Luc Besson","id":"nm0000108","role":null}]},{"category":"Best Actor (Meilleur acteur)","names":[{"name":"Jean-Marc Barr","id":"nm0000852","role":null}]},{"category":"Best Supporting Actor (Meilleur acteur dans un second rôle)","names":[{"name":"Jean Reno","id":"nm0000606","role":null}]},{"category":"Best Director (Meilleur réalisateur)","names":[{"name":"Luc Besson","id":"nm0000108","role":null}]},{"category":"Best Cinematography (Meilleure photographie)","names":[{"name":"Carlo Varini","id":"nm0002299","role":null}]},{"category":"Best Poster (Meilleure affiche)","names":[]}]}]},{"award":"National Academy of Cinema, France 1989","titlesAwards":[{"titleAwardOutcome":"Won Academy Award","categories":[{"category":"","names":[{"name":"Luc Besson","id":"nm0000108","role":null}]}]}]}],"votes":"39,480","type":"Movie","companyCreditsSimple":[{"idCompany":"co0178269","name":"Gaumont"},{"idCompany":"co0054564","name":"Les Films du Loup"}],"keywords":{"keywords":["diver","dolphin","diving","sea","italy","helium","swimming underwater","deep sea diving","friend","rivalry","championship","peru","friendship","sicily","insurance","younger version of character","swimming with clothes on","jumping into sea","falling into a swimming pool","swimming with dolphins","jumping into a pool with clothes on","cult film","female frontal nudity","breasts","three word title","taormina italy","burglary","theft","thief","distorted sound","1980s","1960s","roommate","belgian","helicopter","speedboat","medal","balloon","medic","stretcher","champagne","heartbeat","heart","pregnancy","competition","montage","uncle nephew relationship","bathtub","air tank","coffee","researcher","research","train","mountain","llama","inca","south america","french riviera","new york city","taxi driver","taxi","tears","crying","ice cream","snow","snowmobile","cigarette smoking","tuxedo","pianist","shipwreck","whispering","running","mermaid","priest","porpoise","harbor","athlete","insurance investigator","investigation","eel","fishing","fish","flashlight","family relationships","male frontal nudity","bare chested male","male nudity","female nudity","drunkenness","drinking","drink","death","boy","absent mother","father son relationship","mother son relationship","underwater scene","kiss","swimming","swimmer","sex","local blockbuster","color in title","spaghetti","hotel","greek orthodox","greece","famous score","swimming pool","helium inhalation","oil platform","rescue","suicide","loneliness","boat","ocean","accident","piano","death of father","palm tree"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:55:58"}}