{"data":{"movies":[{"title":"A Hazard of Hearts","originalTitle":"","year":"1987","releaseDate":"19871227","directors":[{"name":"John Hough","id":"nm0396421"}],"writers":[{"name":"Barbara Cartland","id":"nm0142073"},{"name":"Terence Feely","id":"nm0270317"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0MzI2ODkyMV5BMl5BanBnXkFtZTcwOTQzNTEyMQ@@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Drama","Romance"],"plot":"When compulsive gambler Sir Giles Staverley has lost his estate and all his money playing dice, he realises that he only has one thing left of value: his daughter Serena. In a final game, he stakes his daughter's hand in marriage, convinced that this time he will not lose. Unfortunately, however, he does lose; to the evil Lord Wrotham. Unable to return home and tell his daughter that he has lost her in a game of dice, Sir Giles kills himself there and then. Lord Vulcan, who has witnessed the events, takes pity on Serena Staverley, although they have never met. He challenges Lord Wrotham to a game of dice in which the winner takes both Staverley Court and Miss Serena. Lord Vulcan wins and simply pleased that he has saved someone from the nasty Wrotham, he thinks no more about the event. One evening, however, Vulcan's friend Lord Peter Gillingham insists upon them going to Staverley Court to take a look at Vulcan's \"prize.\" When arriving there, Vulcan finds Serena Staverley more ...","simplePlot":"When compulsive gambler Sir Giles Staverley has lost his estate and all his money playing dice, he realises that he only has one thing left of value: his daughter Serena. In a final game, ... ","actors":[{"actorName":"Diana Rigg","urlProfile":"http://www.imdb.com/name/nm0001671","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg0OTcyOTExNl5BMl5BanBnXkFtZTcwMjUyODE0NA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 July 1938","placeOfBirth":" Doncaster, Yorkshire, England, UK","birthName":"Enid Diana Elizabeth Rigg","height":"5' 8½\" (1.74 m)","bio":"British actress Dame Diana Rigg was born on July 20, 1938 in Doncaster, Yorkshire, England. She has had an extensive career in film and theatre, including playing the title role in \"Medea\", both in London and New York, for which she won the 1994 Tony Award for Best Actress in a Play. Rigg made her professional stage debut in 1957 in the Caucasian Chalk Circle, and joined the Royal Shakespeare Company in 1959. She made her Broadway debut in the 1971 production of \"Abelard & Heloise\". Her film roles include Helena in A Midsummer Night's Dream (1968); Lady Holiday in The Great Muppet Caper (1981); and Arlene Marshall in Evil Under the Sun (1982). She won the BAFTA TV Award for Best Actress for the BBC miniseries Mother Love (1989), and an Emmy Award for her role as Mrs. Danvers in the adaptation of Rebecca (1997). In 2013, she appeared with her daughter Rachael Stirling on the BBC series Doctor Who (2005) in an episode titled \"The Crimson Horror\" and plays Olenna Tyrell on the HBO series Game of Thrones (2011). From 1965 to 1968, Rigg appeared on the British television series The Avengers (1961) playing the secret agent Mrs. Emma Peel. She became a Bond girl in On Her Majesty's Secret Service (1969), playing Tracy Bond, James Bond's only wife, opposite George Lazenby. In 1988, she was appointed Commander of the Order of the British Empire (CBE) at the Queen's New Years Honours for her services to drama. In June 1994, she was appointed Dame Commander of the Order of the British Empire (DBE) by Queen Elizabeth II for her services to drama.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg0OTcyOTExNl5BMl5BanBnXkFtZTcwMjUyODE0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001671","name":"Diana Rigg","idIMDB":"nm0001671"},"actorId":"nm0001671","character":"Lady Harriet Vulcan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edward Fox","urlProfile":"http://www.imdb.com/name/nm0002081","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMTcwNzI3Ml5BMl5BanBnXkFtZTcwODQ0NDcwNw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1937","placeOfBirth":" Chelsea, London, England, UK","birthName":"Edward Charles Morrice Fox","height":"5' 8\" (1.73 m)","bio":"Edward Fox was born on April 13, 1937 in Chelsea, London, England as Edward Charles Morrice Fox. He is an actor and producer, known for Gandhi (1982), The Day of the Jackal (1973) and Never Say Never Again (1983). He has been married to Joanna David since 2004. They have two children. He was previously married to Tracy Reed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMTcwNzI3Ml5BMl5BanBnXkFtZTcwODQ0NDcwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002081","name":"Edward Fox","idIMDB":"nm0002081"},"actorId":"nm0002081","character":"Lord Harry Wrotham","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Helena Bonham Carter","urlProfile":"http://www.imdb.com/name/nm0000307","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzUzMDg5MV5BMl5BanBnXkFtZTcwMDA5NDMwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1966","placeOfBirth":" Golders Green, London, England, UK","height":"5' 2\" (1.57 m)","bio":"Helena Bonham Carter is an actress of great versatility, one of the UK's finest and most successful. Bonham Carter was born May 26, 1966 in Golders Green, London, England, the youngest of three children of Elena (née Propper de Callejón), a psychotherapist, and Raymond Bonham Carter, a merchant banker. Through her father, she is the great-granddaughter of former Prime Minister Herbert H. Asquith, and her blue-blooded family tree also contains Barons and Baronesses, diplomats, and a director, Bonham Carter's great-uncle Anthony Asquith, who made Pygmalion (1938) and The Importance of Being Earnest (1952), among others. Cousin Crispin Bonham-Carter is also an actor. Her maternal grandfather, Eduardo Propper de Callejón, was a Spanish diplomat who was awarded the honorific Righteous Among the Nations, by Israel, for helping save Jews during World War II (Eduardo's own father was a Czech Jew). Helena's maternal grandmother, Hélène Fould-Springer, was from an upper-class Jewish family from France, Austria, and Germany, and later converted to her husband's Catholic faith. Bonham Carter experiencing family dramas during her childhood, including her father's stroke - which left him wheelchair-bound. She attended South Hampstead High School and Westminster School in London, and subsequently devoted herself to an acting career. That trajectory actually began in 1979 when, at age thirteen, she entered a national poetry writing competition and used her second place winnings to place her photo in the casting directory \"Spotlight.\" She soon had her first agent and her first acting job, in a commercial, at age sixteen. She then landed a role in the made-for-TV movie A Pattern of Roses (1983), which subsequently led to her casting in the Merchant Ivory films A Room with a View (1985), director James Ivory's tasteful adaptation of E.M. Forster's novel, and Lady Jane (1986), giving a strong performance as the uncrowned Queen of England. She had roles in three other productions under the Merchant-Ivory banner (director Ivory, producer Ismail Merchant, and screenwriter Ruth Prawer Jhabvala): an uncredited appearance in Maurice (1987), and large roles in Where Angels Fear to Tread (1991) and Howards End (1992). Often referred to as the \"corset queen\" or \"English rose\" because of her early work, Bonham Carter continued to surprise audiences with magnificent performances in a variety of roles from her more traditional corset-clad character in The Wings of the Dove (1997) and Shakespearian damsels to the dark and neurotic anti-heroines of Fight Club (1999). Her acclaimed performance in The Wings of the Dove (1997) earned her a Best Actress Academy Award nomination, a Golden Globe Best Actress nomination, a BAFTA Best Actress nomination, and a SAG Awards Best Actress nomination. It also won her a Best Actress Award from the National Board of Review, the Los Angeles Film Critics, the Boston Society Film Critics, the Broadcast Film Critics Association, the Texas Society of Film Critics, and the Southeastern Film Critics Association. In the late 1990s, Bonham Carter embarked on the next phase of her career, moving from capable actress to compelling star. Audiences and critics had long been enchanted by her delicate beauty, evocative of another time and place. Her late '90s and early and mid 2000s roles included Mick Jackson's Live from Baghdad (2002), alongside Michael Keaton, receiving a nomination for both an Emmy and a Golden Globe; Paul Greengrass' The Theory of Flight (1998), in which she played a victim of motor neurone disease; Trevor Nunn's La nuit des rois (1996), in which she played Olivia; opposite Woody Allen in his Mighty Aphrodite (1995); Mort Ransen's Margaret's Museum (1995); Kenneth Branagh's Mary Shelley's Frankenstein (1994); and Franco Zeffirelli's Hamlet (1990). Other notable credits include her appearance with Steve Martin in Novocaine (2001), Tim Burton's remake of Planet of the Apes, in which she played an ape, Thaddeus O'Sullivan's The Heart of Me (2002), opposite Paul Bettany, and Big Fish (2003), her second effort with Tim Burton, in which she appeared as a witch. In between her films, Helena has managed a few television appearances, which include her portrayal of Jacqui Jackson in Magnificent 7 (2005), the tale of a mother struggling to raise seven children - three daughters and four autistic boys; as Anne Boleyn in the two parter biopic of Henry VIII starring Ray Winstone; and as Morgan Le Fey, alongside Sam Neill and Miranda Richardson, in Merlin. Earlier television appearances include Michael Mann's Miami Vice (1984) as Don Johnson's junkie fiancée, and as a stripper who wins Rik Mayall's heart in Dancing Queen (1993). Helena has also appeared on stage, in productions of Trelawney of the Wells, The Barber of Seville, House of Bernarda Alba, The Chalk Garden, and Woman in White. Bonham Carter was nominated for a Golden Globe for the fifth time for her role in partner Tim Burton's film adaptation of the Stephen Sondheim musical, Sweeney Todd: The Demon Barber of Fleet Street (2007), for which Burton and co-star Johnny Depp were also nominated. For the role, she was awarded Best Actress at the Evening Standard British Film Awards 2008. Other 2000s work includes playing Mrs Bucket in Tim Burton's massive hit Charlie and the Chocolate Factory (2005), providing the voices for the aristocratic Lady Campanula Tottington in The Curse of the Were-Rabbit (2005) and for the eponymous dead heroine in Tim Burton's spooky Corpse Bride (2005), and co-starring in Conversations with Other Women (2005) opposite Aaron Eckhart. Since their meeting while filming Planet of the Apes (2001), Bonham Carter and Tim Burton have made seven movies together. They live in adjoining residences in London, sharing a connecting hallway, and have two children: Billy Ray Burton, 4, and Nell Burton, who was born December 15, 2007. Ironically, a mutual love of Sweeney Todd was part of the initial attraction for the pair. Despite that, Bonham Carter has said in numerous interviews that her audition process for the role of Mrs. Lovett was the most grueling of her career and that, ultimately, it was Sondheim who she had to convince that she was right for the role.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzUzMDg5MV5BMl5BanBnXkFtZTcwMDA5NDMwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000307","name":"Helena Bonham Carter","idIMDB":"nm0000307"},"actorId":"nm0000307","character":"Serena Staverley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fiona Fullerton","urlProfile":"http://www.imdb.com/name/nm0298386","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmQ5MzE5N2ItY2VjNS00NTNjLTkzMmUtMzA3NmNhOGVjMDIzXkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1956","placeOfBirth":" Kaduna, Nigeria","bio":"The only child of Bernard and Pamela Fullerton, she was born in Kaduna, Nigeria on 10th October 1956. As a child she wanted to be a ballet dancer and at the age of 11 enrolled at the Elmhurst Ballet School in Surrey where she was spotted and signed to appear in the film 'Run Wild, Run Free' in 1969. This was followed by 'Nicholas and Alexandra' and in 1972 the title role in 'Alice's Adventures in Wonderland' which was her big break. In 1975 was one of the original leads in the BBC television hospital drama series 'Angels'. The following year she married the actor Simon MacCorkindale, divorcing him in 1981. Her career seems to have gone quiet for a while until in 1985 she became a Bond Girl playing Pola Ivanova in 'A View To A Kill' then moved on to be one of the women involved with Nigel Havers in the mini series 'The Charmer'. As her career was progressing she met Neil Shakell, an old family friend again, fell in love and married in 1994 becoming step mother to Neil's son James. A year later she gave birth to Lucy. In 1996 answering a knock on her door she found herself facing a gunman and later discovered that the only reason he didn't shoot her was because she had her baby in her arms. Having already become disillusioned with her career the incident made her want to escape the limelight. She started buying, renovating and selling houses and found herself so successful at it that she now owns a company looking after property and an interior design consultancy. Having written a property advice column for two national newspapers for 10 years it encouraged her to write 3 property focused books. In addition to her film and television work she played two well known women on stage - Guinevere in Camelot opposite Richard Harris and Eliza Dolittle in Pygmalion","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmQ5MzE5N2ItY2VjNS00NTNjLTkzMmUtMzA3NmNhOGVjMDIzXkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0298386","name":"Fiona Fullerton","nicknames":["Princess Fiona"],"idIMDB":"nm0298386"},"actorId":"nm0298386","character":"Lady Isabel Gillingham","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Neil Dickson","urlProfile":"http://www.imdb.com/name/nm0225698","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NjQxMTU4M15BMl5BanBnXkFtZTgwOTI1NzQzMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Dickson has balanced a career on stage and film since graduating from the Guildhall School of Music and Drama in his native England. After several seasons in repertory throughout the UK, Dickson made his West End debut in London under the direction Sir John Gielgud and opposite Dame Judi Dench and Daniel Massey in \"The Gay Lord Quex\". He then created the role of Dean Rebel in the Mermaid Theatre production of \"Trafford Tanzi\", which brought him to the attention of the producers of NBC's 12-hour mini-series \"Anno Domini (A.D.)\" where he co-starred opposite Ian McShane, Susan Sarandon, James Mason and Ava Gardner. This led to Dickson playing the title role of James Bigglesworth in the Royal Premiere Film of \"Biggles: Adventures in Time\". Continuing to star in features and MOWs, Dickson finally arrived in America to star in the Universal TV series \"She Wolf of London\". Since then he has been seen in David Lynch's \"Inland Empire\", \"Time Cop2\", \"Lost Lake\", \"Romy and Michelle's High School Reunion\" and such TV series as \"Chuck\", \"Alias\", and \"Sliders\". His voice can be heard on numerous animated series including \"Rugrats\", \"The Wild Thornberries\", \"Gargoyles\", \"Johnny Quest\" and \"Iron Man\" as well as feature films including \"Body of Lies\", \"Beowulf\", \"Aragon\" and \"Pirates of the Carribean\". He has also been the voice of \"Jaguar\" motor cars, Propel water and Delphi among others. Dickson and his wife Lynda live in Los Angeles with their two daughters. He recently triumphed on stage as Stephen Wyatt's \"The Standard Bearer\", directed by Julian Sands both in London and Los Angeles. Neil Dickson plays the eponymous role in the continuing web series \"Atwill\". The pilot episode won the first Samuel Fuller Guerilla Filmmaker Award at the 2011 Buffalo International Film Festival. Prior to that he starred in the film, \"Chasing Chekov\", which won the BAFTA/LA Best Film Award. He had earlier played the role on stage in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NjQxMTU4M15BMl5BanBnXkFtZTgwOTI1NzQzMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0225698","name":"Neil Dickson","idIMDB":"nm0225698"},"actorId":"nm0225698","character":"Nicholas","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Plummer","urlProfile":"http://www.imdb.com/name/nm0001626","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzQ5MDY3NF5BMl5BanBnXkFtZTcwNzMxOTU5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1929","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Arthur Christopher Orme Plummer","height":"5' 10½\" (1.79 m)","bio":"Arthur Christopher Orme Plummer was born in Toronto, Ontario. He is the only child of Isabella Mary (Abbott), a secretary to the Dean of Sciences at McGill University, and John Orme Plummer, who sold securities and stocks. He is a great-grandson of John Abbott, who was Canada's third Prime Minister (from 1891 to 1892), and a great-great-great-grandson of Anglican clergyman John Bethune. He has Scottish, English, and Anglo-Irish ancestry. Plummer was raised in Senneville, Quebec, by Montreal. Until the 2009 Academy Awards were announced, it could be said about Plummer that he was the finest actor of the post-World War II period to fail to get an Academy Award. In that, he was following in the footsteps of the late great John Barrymore, whom Plummer so memorably portrayed on Broadway in a one-man show that brought him his second Tony Award. In 2010, Plummer finally got an Oscar nod for his portrayal of another legend, Leo Tolstoy in Tolstoï, le dernier automne (2009). Two years later, the first paragraph of his obituary was written when the 82-year-old Plummer became the oldest person in Academy history to win an Oscar. He won for playing a senior citizen who comes out as gay after the death of his wife in the movie Beginners (2010). As he clutched his statuette, the debonaire thespian addressed it thusly: \"You're only two years older than me darling, where have you been all of my life?\" Plummer then told the audience that at birth, \"I was already rehearsing my Academy acceptance speech, but it was so long ago mercifully for you I've forgotten it.\" The Academy Award was a long time in coming and richly deserved. Aside from the youngest member of the Barrymore siblings (which counted Oscar-winners Ethel Barrymore and Lionel Barrymore in their number), Christopher Plummer is the premier Shakespearean actor to come out of North America in the 20th century. He was particularly memorable as Hamlet, Iago and Lear, though his Macbeth opposite Glenda Jackson was -- and this was no surprise to him due to the famous curse attached to the \"Scottish Play\" -- a failure. Plummer also has given many fine portrayals on film, particularly as he grew older and settled down into a comfortable marriage with his third wife Elaine. He thanked her from the stage during the 2012 Oscar telecast, quipping that she \"deserves the Nobel Peace Prize for coming to my rescue every day of my life.\" Like another great stage actor, Richard Burton, the younger Plummer failed to connect with the screen in a way that would make him a star. Dynamic on stage, the charisma failed to transfer through the lens onto celluloid. Burton's early film career, when he was a contract player at 20th Century-Fox, failed to ignite despite his garnering two Oscar nominations early on. He did not become a superstar until the mid-1960s, after hooking up with Elizabeth Taylor on the set of Cleopatra (1963). It was Liz whom he credited with teaching him how to act on film. Christopher Plummer never made it as a leading man in films. Perhaps if he had been born earlier, and acted in the studio system of Hollywood's golden age, he could have been carefully groomed for stardom. As it was he shared the English stage actors' disdain -- and he was equally at home in London as he was on the boards of Broadway or on-stage in his native Canada -- for the movies, which did not help him in that medium, as he has confessed. As he aged, Plummer excelled at character parts. He was always a good villain, this man who garnered kudos playing Lucifer on Broadway in Archibald Macleish's Pulitzer Prize-winning \"J.B.\". Though he likely always be remembered as \"Captain Von Trapp\" in the atomic bomb-strength blockbuster The Sound of Music (1965) (a film he publicly despised until softening his stance in his 2008 autobiography \"In Spite of Me\"), his later film work includes such outstanding performances as the best cinema Sherlock Holmes--other than Basil Rathbone -- in Murder by Decree (1979), the chilling villain in L'argent de la banque (1978), his iconoclastic Mike Wallace in The Insider (1999), the empathetic psychiatrist in A Beautiful Mind (2001), and as Leo Tolstoy in Tolstoï, le dernier automne (2009). It was this last role that finally brought him recognition from the Academy of Motion Picture Arts & Sciences, when he was nominated as Best Actor in a supporting role. Plummer remains one of the most respected and honored actors performing in the English language. He's won two Emmy Awards out of six nominations stretching 46 years from 1959 and 2005, and one Genie Award in five nominations from 1980 to 2004. For his stage work, Plummer has racked up two Tony Awards on six nominations, the first in 1974 as Best Actor (Musical) for the title role in \"Cyrano\" and the second in 1997, as Best Actor (Play), in \"Barrymore\". Surprisingly, he did not win (though he was nominated) for his masterful 2004 performance of \"King Lear\", which he originated at the Stratford Festival in Ontario and brought down to Broadway for a sold-out run. His other Tony nominations show the wide range of his talent, from a 1959 nod for the Elia Kazan-directed production of Macleish's \"J.B.\" to recognition in 1994 for Harold Pinter's \"No Man's Land\", with a 1982 Best Actor (Play) nomination for his \"Iago\" in William Shakespeare's \"Othello\". He continues to be a very in-demand character actor in prestigious motion pictures. If he were English rather than Canadian, he'd have been knighted long ago. (In 1968, he was awarded Companion of the Order of Canada, the country's highest civilian honor and one which required the approval of the sovereign, Queen Elizabeth II.) If he lived in the company town of Los Angeles rather than in Connecticut, he likely would have several more Oscar nominations before winning his first for \"The Last Station\". As it is, as attested to in his witty and well-written autobiography, Christopher Plummer has been amply rewarded in life. In 1970, Plummer - a self-confessed 43-year-old \"bottle baby\" - married his third wife, dancer Elaine Taylor, who helped wean him off his dependency on alcohol. They live happily with their dogs on a 30-acre estate in Weston, Connecticut. Although he spends the majority of his time in the United States, he remains a Canadian citizen. His daughter, with actress Tammy Grimes, is actress Amanda Plummer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzQ5MDY3NF5BMl5BanBnXkFtZTcwNzMxOTU5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001626","name":"Christopher Plummer","nicknames":["Chris"],"idIMDB":"nm0001626"},"actorId":"nm0001626","character":"Sir Giles Staverley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stewart Granger","urlProfile":"http://www.imdb.com/name/nm0001289","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MjMxMTQyNV5BMl5BanBnXkFtZTcwNDMwNTYyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 May 1913","placeOfBirth":" Kensington, London, England, UK","birthName":"James Lablanche Stewart","height":"6' 1\" (1.85 m)","bio":"Stewart Granger was born James Leblanche Stewart in London, the grandson of the actor \"Luigi Lablache\". He attended Epsom College but left after deciding not to pursue a medical degree. He decided to try acting and attended Webber-Douglas School of Dramatic Art, London. By 1935, he made his stage debut in \"The Cardinal\" at the Little Theatre Hull . He was with the Birmingham Repertory Company between 1936 and 1937 and, in 1938, he made his debut in the West End, London in \"The Sun Never Sets\". He joined the Old Vic company in 1939 appearing in 'Tony Draws a Horse' at the Criterion and 'A House in the Square' at the St Martins He had been gradually rising through the ranks of better stage roles when World War II began, and he joined the British Army in 1940. However, he was eventually disabled (1942) which brought his release from military service. With a dearth of leading men for British movies he quickly landed his first film opportunity The Man in Grey (1943) for Gainsborough Pictures. This was the first installment of the company's successful series of romance films. Not to be confused with American actor James Stewart, James Leblanche Stewart became Stewart Granger (though he was \"Jimmy\" to his off-screen friends). But the film work was unsatisfying. He was forever cast as the dashing hero type, while fellow up-and-coming actor James Mason always garnered the more substantial Gainsborough part. When Mason got the nod from Hollywood, Granger inherited better parts and, in some star company in one case, the sophisticated Caesar and Cleopatra (1945) with Claude Rains and Vivien Leigh and a very young bit player already being noticed, Jean Simmons. Grangers lead roles to the end of the decade were substantial, but Simmons was unwittingly moving on into British film history with small but memorable roles for David Lean, Michael Powell, and, in a big way, Laurence Olivier, as \"Ophelia\" in his historic Hamlet (1948) for which she received an Oscar nomination. Granger and she were brought together as co-stars in the comedy Adam and Evalyn (1949). This time around, the chemistry off-camera was there as well, and they became engaged. About the same time, Granger's hope of interesting Hollywood was realized for him and his bride-to-be. He married and signed with MGM in 1950. Once in Hollywood, he was getting star billing leads in romantic roles that the audiences loved, but he found them still unsatisfying. He also found himself heir apparent to Errol Flynn as a swashbuckler in two popular films: the remake of The Prisoner of Zenda (1952) and Scaramouche (1952). He and Simmons were paired in Young Bess (1953), where Granger had the romantic lead, but Simmons was the focus of the movie. Through the 50s, the films of each might have fairly equal production values, but as the fortunes of Hollywood go, Simmons was the more memorable star in films that were more popular-some very big hits, the later Elmer Gantry (1960) and Spartacus (1960). That sort of undeclared competition for a married Hollywood couple was poison to the marriage. In 1960, they divorced. Granger did a lot of work in Germany, along with some in Italy and Spain in the 60s. Interestingly, in the same period Simmons was finding the same lack of challenging roles in the US. In the 70s and 80s, Granger was relegated to small screen subsistence with regular TV roles along with a few movies and a stint on the New York stage. And ironically, Simmons was in the same boat during that period. Granger's typecasting was nothing new, but certainly his often scathing criticism of Hollywood and its denizens that came out in his autobiography \"Sparks Fly Upwards\" was understandable and rang true with so many other stories dealing with illusive stardom. Though he was candid in his disgust with his whole career - and admittedly he did not have the depth for the range of roles allotted to bigger named actors - nonetheless he always turned in solid performances in the roles that became his legacy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MjMxMTQyNV5BMl5BanBnXkFtZTcwNDMwNTYyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001289","name":"Stewart Granger","nicknames":["Jimmy"],"idIMDB":"nm0001289"},"actorId":"nm0001289","character":"Old Vulcan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anna Massey","urlProfile":"http://www.imdb.com/name/nm0557281","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTg2MDk4NV5BMl5BanBnXkFtZTcwNzk0MDMxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 August 1937","placeOfBirth":" Thakeham, West Sussex, England, UK","birthName":"Anna Raymond Massey","height":"5' 6\" (1.68 m)","bio":"Anna Massey was born on August 11, 1937 in Thakeham, West Sussex, England as Anna Raymond Massey. She was an actress, known for The Machinist (2004), Frenzy (1972) and Peeping Tom (1960). She was married to Dr. Uri Andres and Jeremy Brett. She died on July 2, 2011 in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTg2MDk4NV5BMl5BanBnXkFtZTcwNzk0MDMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0557281","name":"Anna Massey","idIMDB":"nm0557281"},"actorId":"nm0557281","character":"Eudora","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eileen Atkins","urlProfile":"http://www.imdb.com/name/nm0040586","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0ODU4MTQ3Ml5BMl5BanBnXkFtZTcwMzg0MzMwMg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1934","placeOfBirth":" Clapton, London, England, UK","birthName":"Eileen June Atkins","height":"5' 6½\" (1.69 m)","bio":"Eileen Atkins was born in a Salvation Army Women's Hostel in north London. Her father was a gas meter reader; her mother, a seamstress and barmaid. A drama teacher taught her how to drop her Cockney accent, and she studied Shakespeare and Greek tragedies. Her breakthrough role in \"The Killing of Sister George\" took her to Broadway.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0ODU4MTQ3Ml5BMl5BanBnXkFtZTcwMzg0MzMwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0040586","name":"Eileen Atkins","idIMDB":"nm0040586"},"actorId":"nm0040586","character":"Lady Harriet's Maid","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gareth Hunt","urlProfile":"http://www.imdb.com/name/nm0402451","urlPhoto":"","biography":{"dateOfBirth":"7 February 1943","placeOfBirth":" Battersea, London, England, UK","birthName":"Alan Leonard Hunt","height":"6' (1.83 m)","bio":"Gareth Hunt was born on February 7, 1943 in Battersea, London, England as Alan Leonard Hunt. He was an actor and composer, known for Chapeau melon et bottes de cuir (1976), Fierce Creatures (1997) and Bloodbath at the House of Death (1984). He was married to Amanda, Annette Walter-Lax and Carol. He died on March 14, 2007 in Redhill, Surrey, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0402451","name":"Gareth Hunt","idIMDB":"nm0402451"},"actorId":"nm0402451","character":"Joker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marcus Gilbert","urlProfile":"http://www.imdb.com/name/nm0317956","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA2YjcwMmMtOGZiNi00M2M1LTk5ZGYtNTllNzY5ZDhiMzM1XkEyXkFqcGdeQXVyMzE3OTU5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1958","placeOfBirth":" UK","height":"6' 2\" (1.88 m)","bio":"Marcus Gilbert was born on July 29, 1958 in the UK. He is an actor, known for Army of Darkness (1992), Rambo III (1988) and Riders (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA2YjcwMmMtOGZiNi00M2M1LTk5ZGYtNTllNzY5ZDhiMzM1XkEyXkFqcGdeQXVyMzE3OTU5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0317956","name":"Marcus Gilbert","idIMDB":"nm0317956"},"actorId":"nm0317956","character":"Lord Justin Vulcan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Addie","urlProfile":"http://www.imdb.com/name/nm0011665","urlPhoto":"","biography":{"dateOfBirth":"10 February 1960","placeOfBirth":" London, England, UK","birthName":"Robert Alastair Addie","height":"6' 2\" (1.88 m)","bio":"Having left Marlborough College early, Robert went to London to follow up his ambition of becoming an actor by auditioning for and joining the National Youth Theatre. He then moved into film and television work. He went to R.A.D.A. for a year. His hobbies were polo and gardening.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0011665","name":"Robert Addie","idIMDB":"nm0011665"},"actorId":"nm0011665","character":"Lord Peter Gillingham","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Gaddas","urlProfile":"http://www.imdb.com/name/nm0300518","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE3ZjQzNjktZDcxZi00OTg1LWJiYTYtZWE0MzkyOTgyMTZkXkEyXkFqcGdeQXVyMzE3OTU5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 June 1960","placeOfBirth":" Ragworth, Stockton-on-Tees, Durham, England, UK","height":"6' 2½\" (1.89 m)","bio":"James Gaddas was born on June 17, 1960 in Ragworth, Stockton-on-Tees, Durham, England. He is an actor and writer, known for Starter for 10 (2006), Bad Girls (1999) and The Black Candle (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE3ZjQzNjktZDcxZi00OTg1LWJiYTYtZWE0MzkyOTgyMTZkXkEyXkFqcGdeQXVyMzE3OTU5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0300518","name":"James Gaddas","idIMDB":"nm0300518"},"actorId":"nm0300518","character":"Lord John Burley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Villiers","urlProfile":"http://www.imdb.com/name/nm0898369","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NzQ1MzQxNV5BMl5BanBnXkFtZTcwODE3MzM2OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1960","placeOfBirth":" London, England, UK","height":"5' 10\" (1.78 m)","bio":"Christopher Villiers was born on September 7, 1960 in London, England. He is an actor and writer, known for Emmerdale (1972), First Knight (1995) and Top Secret! (1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI5NzQ1MzQxNV5BMl5BanBnXkFtZTcwODE3MzM2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0898369","name":"Christopher Villiers","idIMDB":"nm0898369"},"actorId":"nm0898369","character":"Captain Jackson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ben Aris","urlProfile":"http://www.imdb.com/name/nm0034873","urlPhoto":"","biography":{"dateOfBirth":"16 March 1937","placeOfBirth":" London, England, UK","birthName":"Benjamin Patrick Aris","height":"6' 2\" (1.88 m)","bio":"Ben Aris was born on March 16, 1937 in London, England as Benjamin Patrick Aris. He was an actor, known for Tommy (1975), If.... (1968) and Get Carter (1971). He was married to Yemaiel Oven. He died on September 4, 2003 in Esher, Surrey, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0034873","name":"Ben Aris","idIMDB":"nm0034873"},"actorId":"nm0034873","character":"Lieutenant of Dragoons","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0093159","urlIMDB":"http://www.imdb.com/title/tt0093159","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.1","filmingLocations":[{"location":"Stairhole, Lulworth Cove, Lulworth Estate, UK"}],"awards":[],"votes":"926","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0103051","name":"Gainsborough Pictures"},{"idCompany":"co0103783","name":"The Grade Company"}],"keywords":{"keywords":["gambler","dice","gambling","english country dance","melodrama","empire fashion","damsel in distress","faked death","strawberry","period piece","costume drama","19th century","1800s","england","robbery","highwayman","wedding","villainess","sword duel","fencing","duel","cave","wager","suicide","aristocracy","smuggling","love triangle","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:00:44"}}