{"data":{"movies":[{"title":"Invasion of the Body Snatchers","originalTitle":"","year":"1978","releaseDate":"19781222","directors":[{"name":"Philip Kaufman","id":"nm0442241"}],"writers":[{"name":"Jack Finney","id":"nm0278277"},{"name":"W.D. Richter","id":"nm0725379"}],"runtime":"115 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1MTgxMTY2MF5BMl5BanBnXkFtZTgwODg0NTc1MDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Sci-Fi"],"plot":"The first remake of the paranoid infiltration classic moves the setting for the invasion from a small town to the city of San Fransisco and starts as Matthew Bennell notices that several of his friends are complaining that their close relatives are in some way different. When questioned later they themselves seem changed as they deny everything or make lame excuses. As the invaders increase in number they become more open and Bennell, who has by now witnessed an attempted \"replacement\" realises that he and his friends must escape or suffer the same fate. But who can he trust to help him and who has already been snatched?","simplePlot":"In San Francisco, a group of people discover the human race is being replaced one by one, with clones devoid of emotion.","actors":[{"actorName":"Donald Sutherland","urlProfile":"http://www.imdb.com/name/nm0000661","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MDI1NzcyMl5BMl5BanBnXkFtZTcwOTk0MjQwOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1935","placeOfBirth":" Saint John, New Brunswick, Canada","birthName":"Donald McNichol Sutherland","height":"6' 4\" (1.93 m)","bio":"The towering presence of Canadian actor Donald Sutherland is often noticed, as are his legendary contributions to cinema. He has appeared in almost 200 different shows and films. He is also the father of renowned actor Kiefer Sutherland, among others. Donald McNichol Sutherland was born in Saint John, New Brunswick, to Dorothy Isobel (McNichol) and Frederick McLea Sutherland, who worked in sales and electricity. He has Scottish, as well as German and English, ancestry. Sutherland worked several different jobs - he was a radio DJ in his youth - and was almost set on becoming an engineer after graduating from the University of Toronto with a degree in engineering. However, he also graduated with a degree in drama, and he chose to abandon becoming an engineer in favour of an actor. Sutherland's first roles were bit parts and consisted of such films as the horror film Dr. Terror's House of Horrors (1965) which starred Christopher Lee. He was also appearing in episodes of TV shows such as \"The Saint\" and \"Court Martial\". Sutherland's break would come soon, though, and it would come in the form of a war film in which he was barely cast. The reason he was barely cast was because he had been a last-minute replacement for an actor that had dropped out of the film. The role he played was that of the dopey but loyal Vernon Pinkley in the war film The Dirty Dozen (1967). The film also starred Lee Marvin, Charles Bronson, and Telly Savalas. The picture was an instant success as an action/war film, and Sutherland played upon this success by taking another role in a war film: this was, however, a comedy called MASH (1970) which landed Sutherland the starring role alongside Elliott Gould and Tom Skerritt. This is now considered a classic among film goers, and the 35-year old actor was only getting warmed up. Sutherland took a number of other roles in between these two films, such as the theatrical adaptation Oedipus the King (1968), the musical Joanna (1968) and the Clint Eastwood-helmed war comedy Kelly's Heroes (1970). It was Kelly's Heroes (1970) that became more well-known, and it reunited Sutherland with Telly Savalas. 1970 and 1971 offered Sutherland a number of other films, the best of them would have to be Klute (1971). The film, which made Jane Fonda a star, is about a prostitute whose friend is mysteriously murdered. Sutherland received no critical acclaim like his co-star Fonda (she won an Oscar) but his career did not fade. Moving on from Klute (1971), Sutherland landed roles such as the lead in the thriller Lady Ice (1973), and another lead in the western Alien Thunder (1974). These films did not match up to \"Klute\"'s success, though Sutherland took a supporting role that would become one of his most infamous and most critically acclaimed. He played the role of the murderous fascist leader in the Bernardo Bertolucci Italian epic 1900 (1976). Sutherland also gained another memorable role as a marijuana-smoking university professor in Animal House (1978) among other work that he did in this time. Another classic role came in the form of the Robert Redford film, Ordinary People (1980). Sutherland portrays an older father figure who must deal with his children in an emotional drama of a film. It won Best Picture, and while both the supporting stars were nominated for Oscars, Sutherland once again did not receive any Academy Award nomination. He moved on to play a Nazi spy in a film based on Ken Follett's book \"Eye of the Needle\" and he would star alongside Al Pacino in the commercial and critical disaster that was Revolution (1985). While it drove Al Pacino out of films for four years, Sutherland continued to find work. This work led to the dramatic, well-told story of apartheid A Dry White Season (1989) alongside the legendary actor Marlon Brando. Sutherland's next big success came in the Oliver Stone film JFK (1991) where Sutherland plays the chilling role of Mister X, an anonymous source who gives crucial information about the politics surrounding President Kennedy. Once again, he was passed over at the Oscars, though Tommy Lee Jones was nominated for his performance as Clay Shaw. Sutherland went on to appear in Buffy the Vampire Slayer (1992), Shadow of the Wolf (1992), and Disclosure (1994). The new millennium provided an interesting turn in Sutherland's career: reuniting with such former collaborators as Clint Eastwood and Tommy Lee Jones, Sutherland starred in Space Cowboys (2000). He also appeared as the father figure to Nicole Kidman's character in Cold Mountain (2003) and Charlize Theron's character in The Italian Job (2003). He has also made a fascinating, Oscar-worthy performance as the revolutionist Mr. Thorne in Land of the Blind (2006) and also as a judge in Reign Over Me (2007). Recently, he has joined forces with his son Rossif Sutherland and Canadian comic [error] with the new comedy The Con Artist (2010), as well as acting alongside Jamie Bell and Channing Tatum in the sword-and-sandal film The Eagle (2011). Sutherland has also taken a role in the remake of Charles Bronson's film The Mechanic (1972). Donald Sutherland has made a lasting legacy on Hollywood, whether portraying a chilling and horrifying villain, or playing the older respectable character in his films. A true character actor, Sutherland is one of Canada's most well-known names and will hopefully continue on being so long after his time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MDI1NzcyMl5BMl5BanBnXkFtZTcwOTk0MjQwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000661","name":"Donald Sutherland","idIMDB":"nm0000661"},"actorId":"nm0000661","character":"Matthew Bennell","urlCharacter":"http://www.imdb.com/character/ch0006359","main":true},{"actorName":"Brooke Adams","urlProfile":"http://www.imdb.com/name/nm0000724","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1OTMzMjgzNTVeQTJeQWpwZ15BbWU2MDIyMjQ3Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1949","placeOfBirth":" New York City, New York, USA","height":"5' 5\" (1.65 m)","bio":"Brooke Adams was born on February 8, 1949 in New York City, to Rosalind (Gould), an actress, and Robert K. Adams, a former CBS vice president. She is of English and German descent, and is said to be related to President John Adams. She was educated at the prestigious High School for the Performing Arts and the School of the American Ballet. Starting her career on the stage while still a juvenile, her film career took off when she became an adult with a well-received performance, opposite Richard Gere and Sam Shepard, in Terrence Malick's Days of Heaven (1978). Although she has starred in Philip Kaufman's Invasion of the Body Snatchers (1978), and repeated her off-Broadway role in the film version of Kevin Wade's romantic comedy Key Exchange (1985), her recent work has gotten sidetracked to mostly horror films and supernatural thrillers. In 1995, she retired from acting because of family responsibilities and a dearth of good roles, resuming her career in 2002. Adams most recently appeared in the films At Last (2005) and The Legend of Lucy Keyes (2005), starred on Broadway in \"The Cherry Orchard and \"Lend Me a Tenor\", and guest-starred on the television series Monk (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1OTMzMjgzNTVeQTJeQWpwZ15BbWU2MDIyMjQ3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000724","name":"Brooke Adams","idIMDB":"nm0000724"},"actorId":"nm0000724","character":"Elizabeth Driscoll","urlCharacter":"http://www.imdb.com/character/ch0006669","main":true},{"actorName":"Jeff Goldblum","urlProfile":"http://www.imdb.com/name/nm0000156","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NzkyODg1Nl5BMl5BanBnXkFtZTYwMTY2OTE0._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 October 1952","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Jeffrey Lynn Goldblum","height":"6' 4½\" (1.94 m)","bio":"Jeffrey Lynn Goldblum was born October 22, 1952 in Pittsburgh, Pennsylvania, one of four children of Shirley (Temeles), a radio broadcaster who also ran an appliances firm, and Harold L. Goldblum, a doctor. His father was of Russian Jewish descent and his mother was of Austrian Jewish ancestry. Goldblum began his career on the New York stage after moving to the city at age seventeen. Possessing his own unique style of delivery, Goldblum made an impression on moviegoers with little more than a single line in Woody Allen's Annie Hall (1977), when he fretted about having forgotten his mantra. Goldblum went on to appear in the remake Invasion of the Body Snatchers (1978) and co-starred with Ben Vereen in the detective series Tenspeed and Brown Shoe (1980) before a high-profile turn in the classic ensemble film The Big Chill (1983). The quirky actor turned up in the suitably quirky film The Adventures of Buckaroo Banzai Across the 8th Dimension (1984), which became a 1980s cult classic, starred in the modern-day film noir Into the Night (1985), then went on to a breakthrough role in the David Cronenberg remake The Fly (1986), which also featured actress Geena Davis, Goldblum's wife from 1987-1990 and co-star in two additional films: Transylvania 6-5000 (1985) and Julien Temple's Earth Girls Are Easy (1988). Goldblum was the rather unlikely star of some of the biggest blockbusters of the 1990s: Steven Spielberg's dinosaur adventure Jurassic Park (1993) and its sequel The Lost World: Jurassic Park (1997), as well as the alien invasion film Independence Day (1996). These films saw Goldblum playing the type of intellectual characters he has become associated with. More recently, roles have included critically acclaimed turns in Igby Goes Down (2002) and Wes Anderson's The Life Aquatic with Steve Zissou (2004). In 2009, he returned to television to star in his second crime series Law & Order: Criminal Intent (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5NzkyODg1Nl5BMl5BanBnXkFtZTYwMTY2OTE0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000156","name":"Jeff Goldblum","idIMDB":"nm0000156"},"actorId":"nm0000156","character":"Jack Bellicec","urlCharacter":"http://www.imdb.com/character/ch0006657","main":true},{"actorName":"Veronica Cartwright","urlProfile":"http://www.imdb.com/name/nm0001021","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg2NDE0MDkyOV5BMl5BanBnXkFtZTgwMDI1MzUyMDI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1949","placeOfBirth":" Bristol, England, UK","birthName":"Veronica A. Cartwright","height":"5' 6\" (1.68 m)","bio":"Born in Bristol, England, Veronica is the older sister of the popular child actress Angela Cartwright. In her early career, Veronica was cast in a number of popular movies such as The Children's Hour (1961), Spencer's Mountain (1963) and Alfred Hitchcock's The Birds (1963). As such, she was cast as \"Jemima Boone\" in the popular television series Daniel Boone (1964), which ran from 1964 to 66. Her career after \"Daniel Boone\" may have been influenced by Hitchcock, since she appeared in both the remake of Invasion of the Body Snatchers (1978) and the horror classic Alien (1979). On television, she appeared twice as Lumpy's younger sister, \"Violet Rutherford\" and once as \"Peggy MacIntosh\" on Leave It to Beaver (1957) and had a small role in the television movie Still the Beaver (1983). Cartwright also appeared in Robert Kennedy and His Times (1985), Tanner '88 (1988) and had a recurring role on L.A. Law (1986). Her big screen features included The Right Stuff (1983), Flight of the Navigator (1986) and The Witches of Eastwick (1987). Veronica worked on the stage in \"Electra\", \"Talley's Folly\", \"Homesteaders\", \"Butterflies are Free\" and \"The Triplet Connection\". Alternating between television and big screen movies in the 90s, Cartwright has appeared in such films as Hitler's Daughter (1990) and Candyman: Farewell to the Flesh (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg2NDE0MDkyOV5BMl5BanBnXkFtZTgwMDI1MzUyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001021","name":"Veronica Cartwright","idIMDB":"nm0001021"},"actorId":"nm0001021","character":"Nancy Bellicec","urlCharacter":"http://www.imdb.com/character/ch0006659","main":true},{"actorName":"Leonard Nimoy","urlProfile":"http://www.imdb.com/name/nm0000559","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMzY1MzEyNV5BMl5BanBnXkFtZTYwNjU4MTg1._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1931","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Leonard Simon Nimoy","height":"6' (1.83 m)","bio":"Leonard Simon Nimoy was born in Boston, Massachusetts, to Dora (Spinner) and Max Nimoy, who owned a barbershop. His parents were Ukrainian Jewish immigrants. Raised in a tenement and acting in community theaters since age eight, Nimoy did not make his Hollywood debut until he was 20, with a bit part in Queen for a Day (1951) and another as a ballplayer in the perennial Rhubarb (1951). After two years in the United States Army, he was still getting small, often uncredited parts, like an Army telex operator in Them! (1954). His part as Narab, a Martian finally friendly to Earth, in the closing scene in the corny Republic serial Zombies of the Stratosphere (1952), somewhat foreshadowed the role which would make him a household name: Mr. Spock, the half-human/half-Vulcan science officer on Star Trek (1966) one of television's all-time most successful series. His performance won him three Emmy nominations and launched his career as a writer and director, notably of Star Trek IV: The Voyage Home (1986), the story of a humpback whale rescue that proved the most successful of the Star Trek movies. Stage credits have included \"Fiddler on the Roof\", \"Oliver\", \"Camelot\" and \"Equus\". He has hosted the well-known television series In Search of... (1976) and Ancient Mysteries (1994), authored several volumes of poetry and guest-starred on two episodes of The Simpsons (1989). In the latter years of his career, he played Mustafa Mond in NBC's telling of Aldous Huxley's Brave New World (1998), voiced Sentinel Prime in the blockbuster Transformers: Dark of the Moon (2011), and played Spock again in two new Star Trek films, Star Trek (2009) and Star Trek Into Darkness (2013). Leonard Nimoy died on February 27, 2015 in Bel Air, Los Angeles, California, of end-stage chronic obstructive pulmonary disease. He was 83.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMzY1MzEyNV5BMl5BanBnXkFtZTYwNjU4MTg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000559","name":"Leonard Nimoy","nicknames":["Lenny"],"idIMDB":"nm0000559"},"actorId":"nm0000559","character":"Dr. David Kibner","urlCharacter":"http://www.imdb.com/character/ch0006664","main":true},{"actorName":"Art Hindle","urlProfile":"http://www.imdb.com/name/nm0385543","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NDkxMzA1NV5BMl5BanBnXkFtZTcwNDg3Mjg0NA@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 July 1948","placeOfBirth":" Halifax, Nova Scotia, Canada","height":"5' 10\" (1.78 m)","bio":"Born in Halifax to a Royal Canadian Navy father, Art's mother soon had him back in their home town of Toronto, Ontario. He grew up in the \"Beaches\" of Toronto a big fan of Elvis Presley and rock n' roll. Although shy as a child, he grew to be a rebellious and independent teenager. This lead him to much traveling, mostly by hitch-hiking, picking up odd jobs, meeting all sorts of people from red-necks to freedom marchers to surfers and everyone in between. By the time he was 21, he was a father, a stockbroker and an amateur photographer. A much admired uncle of Art's was Michael Caine, a talented and successful actor. This had piqued Art's interest in acting during his teens. Although fairly successful himself, as a broker, he basically felt unfulfilled and eventually, after being inspired and touched by a Toronto Workshop Productions play, he made the commitment to leave the stock market for theatre. Although he worked, basically, as an unglorified gofer for a few months with TWP, eventually he got an acting agent, mostly with a false resume, and started auditioning mostly for commercials. It was at this time that Art credits a discovery that changed his future. Someone, he can't remember who, directed him to the Eli Rill Workshop. Eli had moved to Toronto from New York, where he taught at the Actor's Studio. Kind, gentle and articulate, Eli lucidly communicated techniques and explorations of the Method. Art thrived in this environment and soon started applying his knowledge to getting acting jobs. His first big role was in a biker movie, The Proud Rider (1971), spawned by the popularity of Easy Rider (1969). Art actually worked with a real motorcycle gang, the Satan's Choice. It was during the making of this rather bad movie that Art almost changed his professional name to Jeremy Kane. The producers thought that Art should have a more \"show biz\" name and took his photo to a girls school and asked the students to suggest first names and last names. They then took these names to Art and asked him to pick one of each. He liked the name Jeremy and chose Caine in honor of his uncle. The first person he called was his uncle Michael. Michael told him in no uncertain terms to stick to his own name. Art did so, but the other name is still connected to the film. The other anecdote was when the producers asked Art if he could ride a \"bike,\" he took them \"literally\" and said he could, but that when it came to motorcycles his brother Lang Hindle was much better, being a champion road racer. Cast for the part late on a Thursday, Art had to learn to ride a motorcycle by Monday morning. The next big step was being cast as Billy Duke, the best hockey player in the world, drafted by the Maple Leafs to lead them back to the playoffs in the film Winter Comes Early (1971), Canada's first million-dollar movie. This film led to offers from Hollywood, which he resisted until work dried up and Art, who had 4 children by this time, finally moved to Los Angeles. Art credits much of his success in California to luck. He felt he was lucky having Patricia McQueeney as his manager and a dynamic pair of agents in Arnold Rifkin and Nichole David. Over the years Art has come to be known as a \"working actor\" involved as a leading actor in some \"classic\" films and numerous pilots and series. His work in ENG, one Canada's most successful series, won him a Acting Gemini and his Pete Braga in Bienvenue à Paradise Falls (2001) has been described as a \"classic performance\" although Art credits brilliant writing for all the plaudits. Also, in the early 1990s, Art added the credit Director to his impressive resume. He and his beautiful wife, Brooke now split time between California, Florida and Canada spending time with their much beloved children, all 8 of them, and their 6 grandchildren. Lucky? Indeed!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NDkxMzA1NV5BMl5BanBnXkFtZTcwNDg3Mjg0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0385543","name":"Art Hindle","idIMDB":"nm0385543"},"actorId":"nm0385543","character":"Dr. Geoffrey Howell, DDS","urlCharacter":"http://www.imdb.com/character/ch0176781","main":true},{"actorName":"Lelia Goldoni","urlProfile":"http://www.imdb.com/name/nm0325959","urlPhoto":"","biography":{"dateOfBirth":"1 October 1936","placeOfBirth":" New York City, New York, USA","bio":"Lelia Goldoni was born on October 1, 1936 in New York City, New York, USA. She is an actress and director, known for Invasion of the Body Snatchers (1978), Shadows (1959) and Alice Doesn't Live Here Anymore (1974). She was previously married to Ben Carruthers.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0325959","name":"Lelia Goldoni","idIMDB":"nm0325959"},"actorId":"nm0325959","character":"Katherine Hendley","urlCharacter":"http://www.imdb.com/character/ch0176783","main":true},{"actorName":"Kevin McCarthy","urlProfile":"http://www.imdb.com/name/nm0002994","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMTA2Mzc0NF5BMl5BanBnXkFtZTYwOTk1OTA2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 February 1914","placeOfBirth":" Seattle, Washington, USA","height":"5' 10\" (1.78 m)","bio":"Handsome, chisel-jawed character actor Kevin McCarthy appeared in nearly 100 movies in a career that spanned seven decades. He also had some starring roles, most notably the horror cult classic Invasion of the Body Snatchers (1956). He played the disillusioned son Biff Loman in the 1951 screen adaptation of Arthur Miller's classic Death of a Salesman (1951), for which he was nominated for a Best Supporting Actor Oscar and won the Golden Globe Award for most promising newcomer (male). He is the younger brother of the late author Mary McCarthy and distant cousin of former U.S. Senator and presidential candidate Eugene McCarthy. McCarthy was orphaned at the age of four when both his parents died in the great flu epidemic of 1918. He was raised by his father's parents in Minneapolis, Minnesota, and later by an uncle and aunt. He graduated from Campion Jesuit High School in Prairie du Chien, Wisconsin, in 1932. He attended the School of Foreign Service at Georgetown University, Washington, DC, in 1933, intending to enter into the diplomatic field. He also attended the University of Minnesota, Minneapolis, in 1936 and the Actors Studio New York, New York. He had roles in two short-lived TV series: The Survivors (1969), with Lana Turner, and Flamingo Road (1980) as Claude Weldon, the father of the character played by Morgan Fairchild. The stage-trained McCarthy frequently appeared on Broadway. He starred as Jerry in \"Two for the Seesaw\" (1959) and as Van Ackerman in \"Advise and Consent\" (1960). He also played President Harry S. Truman in the one-man show \"Give 'Em Hell, Harry!\" McCarthy showed no signs of retiring as late as June 2007. McCarthy acted in the film The Ghastly Love of Johnny X (2012), playing the role of the Grand Inquisitor, at age 93, which was finally released in 2011. He died of pneumonia on September 11, 2010.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMTA2Mzc0NF5BMl5BanBnXkFtZTYwOTk1OTA2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002994","name":"Kevin McCarthy","idIMDB":"nm0002994"},"actorId":"nm0002994","character":"Running man","urlCharacter":"http://www.imdb.com/character/ch0006663","main":true},{"actorName":"Don Siegel","urlProfile":"http://www.imdb.com/name/nm0796923","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODUyOTE1OGQtMWM2OS00YzhjLThhNDMtMmY5MjRlZjkxZmQ5XkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1912","placeOfBirth":" Chicago, Illinois, USA","birthName":"Donald Siegel","height":"5' 9\" (1.75 m)","bio":"Don Siegel was educated at Cambridge University, England. In Hollywood from the mid-'30s, he began his career as an editor and second unit director. In 1945 he directed two shorts (Hitler Lives (1945) and Star in the Night (1945)) which both won Academy Awards. His first feature as a director was 1946's The Verdict (1946). He made his reputation in the early and mid-'50s with a series of tightly made, expertly crafted, tough but intelligent \"B\" pictures (among them The Lineup (1958), Riot in Cell Block 11 (1954), Invasion of the Body Snatchers (1956)), then graduated to major \"A\" films in the 1960s and early 1970s. He made several \"side trips\" to television, mostly as a producer. Siegel directed what is generally considered to be Elvis Presley's best picture, Flaming Star (1960). He had a long professional relationship and personal friendship with Clint Eastwood, who has often said that everything he knows about filmmaking he learned from Don Siegel.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODUyOTE1OGQtMWM2OS00YzhjLThhNDMtMmY5MjRlZjkxZmQ5XkEyXkFqcGdeQXVyMjUxODE0MDY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0796923","name":"Don Siegel","idIMDB":"nm0796923"},"actorId":"nm0796923","character":"Taxi Driver","urlCharacter":"http://www.imdb.com/character/ch0253655","main":true},{"actorName":"Tom Luddy","urlProfile":"http://www.imdb.com/name/nm0524855","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNzAxMDIwMV5BMl5BanBnXkFtZTYwOTI2ODY1._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNzAxMDIwMV5BMl5BanBnXkFtZTYwOTI2ODY1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0524855","name":"Tom Luddy","idIMDB":"nm0524855"},"actorId":"nm0524855","character":"Ted Hendley","urlCharacter":"http://www.imdb.com/character/ch0253656","main":true},{"actorName":"Stan Ritchie","urlProfile":"http://www.imdb.com/name/nm0728633","urlPhoto":"","biography":{"bio":"Stan Ritchie is an actor, known for Invasion of the Body Snatchers (1978), Nightmare in Blood (1977) and Mr. Billion (1977).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0728633","name":"Stan Ritchie","idIMDB":"nm0728633"},"actorId":"nm0728633","character":"Stan","urlCharacter":"http://www.imdb.com/character/ch0223922","main":true},{"actorName":"David Fisher","urlProfile":"http://www.imdb.com/name/nm1546277","urlPhoto":"","biography":{"bio":"David Fisher is an actor, known for Invasion of the Body Snatchers (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1546277","name":"David Fisher","idIMDB":"nm1546277"},"actorId":"nm1546277","character":"Mr. Gianni","urlCharacter":"http://www.imdb.com/character/ch0253657","main":true},{"actorName":"Tom Dahlgren","urlProfile":"http://www.imdb.com/name/nm0197080","urlPhoto":"","biography":{"dateOfBirth":"22 September 1933","placeOfBirth":" Fresno, California, USA","bio":"Tom Dahlgren was born on September 22, 1933 in Fresno, California, USA. He is an actor and producer, known for The Godfather: Part II (1974), What Lies Beneath (2000) and The Man Who Wasn't There (2001). He is married to Joy.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0197080","name":"Tom Dahlgren","idIMDB":"nm0197080"},"actorId":"nm0197080","character":"Detective","urlCharacter":"http://www.imdb.com/character/ch0325166","main":true},{"actorName":"Garry Goodrow","urlProfile":"http://www.imdb.com/name/nm0329340","urlPhoto":"","biography":{"dateOfBirth":"4 November 1933","placeOfBirth":" Malone, New York, USA","bio":"Garry Goodrow was born on November 4, 1933 in Malone, New York, USA. He was an actor and writer, known for Dirty Dancing (1987), Invasion of the Body Snatchers (1978) and Escape from Alcatraz (1979). He died on July 22, 2014.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0329340","name":"Garry Goodrow","idIMDB":"nm0329340"},"actorId":"nm0329340","character":"Dr. Boccardo","urlCharacter":"http://www.imdb.com/character/ch0253658","main":true},{"actorName":"Jerry Walter","urlProfile":"http://www.imdb.com/name/nm0910054","urlPhoto":"","biography":{"dateOfBirth":"28 March 1925","placeOfBirth":" Illinois, USA","birthName":"Jerome Walter","bio":"Jerry Walter was born on March 28, 1925 in Illinois, USA as Jerome Walter. He was an actor, known for Invasion of the Body Snatchers (1978), The Enforcer (1976) and Nightmare in Blood (1977). He died on February 11, 1979 in Sausalito, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0910054","name":"Jerry Walter","idIMDB":"nm0910054"},"actorId":"nm0910054","character":"Restaurant Owner","urlCharacter":"http://www.imdb.com/character/ch0253660","main":true}],"seasons":[],"idIMDB":"tt0077745","urlIMDB":"http://www.imdb.com/title/tt0077745","business":{"budget":{"money":"$3,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$1,298,129","country":"USA","day":"25","month":"12","year":"1978","remarks":"445 Screens"}],"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1978/\">1978</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 55 min (115 min)"],"soundMix":["Stereo (Dolby Stereo)"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Technicolor, USA (prints)","DeLuxe, USA (color)"],"filmLength":["3,165 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.4","filmingLocations":[{"location":"1227 Montgomery Street, Telegraph Hill, San Francisco, California, USA"}],"rated":"PG","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1979","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Director","names":[{"name":"Philip Kaufman","id":"nm0442241","role":null}]},{"category":"Best Sound","names":[{"name":"Art Rochester","id":"nm0734053","role":null},{"name":"Mark Berger","id":"nm0074281","role":null},{"name":"Andy Wiskes","id":"nm0936556","role":null}]}]},{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Science Fiction Film","names":[]},{"category":"Best Actor","names":[{"name":"Donald Sutherland","id":"nm0000661","role":null}]},{"category":"Best Actress","names":[{"name":"Brooke Adams","id":"nm0000724","role":null}]},{"category":"Best Supporting Actor","names":[{"name":"Leonard Nimoy","id":"nm0000559","role":null}]},{"category":"Best Special Effects","names":[{"name":"Dell Rheaume","id":"nm0722206","role":null},{"name":"Russel Hessey","id":"nm0381622","role":null}]},{"category":"Best Make-Up","names":[{"name":"Thomas R. Burman","id":"nm0122207","role":null},{"name":"Edouard F. Henriques","id":"nm0377667","role":null}]}]}]},{"award":"Avoriaz Fantastic Film Festival 1979","titlesAwards":[{"titleAwardOutcome":"Won Antennae II Award","categories":[{"category":"","names":[{"name":"Philip Kaufman","id":"nm0442241","role":null}]}]}]},{"award":"Hugo Awards 1979","titlesAwards":[{"titleAwardOutcome":"Nominated Hugo","categories":[{"category":"Best Dramatic Presentation","names":[{"name":"Philip Kaufman","id":"nm0442241","role":"director"},{"name":"W.D. Richter","id":"nm0725379","role":"screenplay"},{"name":"Jack Finney","id":"nm0278277","role":"based on the novel by"}]}]}]},{"award":"National Society of Film Critics Awards, USA 1979","titlesAwards":[{"titleAwardOutcome":"Nominated NSFC Award","categories":[{"category":"Best Screenplay","names":[{"name":"W.D. Richter","id":"nm0725379","role":null}]}]}]},{"award":"Online Film & Television Association 2010","titlesAwards":[{"titleAwardOutcome":"Won OFTA Film Hall of Fame","categories":[{"category":"Motion Picture","names":[]}]}]},{"award":"Writers Guild of America, USA 1979","titlesAwards":[{"titleAwardOutcome":"Nominated WGA Award (Screen)","categories":[{"category":"Best Drama Adapted from Another Medium","names":[{"name":"W.D. Richter","id":"nm0725379","role":null}]}]}]}],"votes":"39,578","type":"Movie","companyCreditsSimple":[{"idCompany":"co0088143","name":"Solofilm"}],"keywords":{"keywords":["female nudity","sleep","psychiatrist","health inspector","capgras delusion","capgras syndrome","parasite","human face on animal","remake","escape","alien infiltration","cold war era","doppelganger","cold war","transamerica pyramid","capgras science fiction","breaking and entering","remade","horror movie remade","horror movie remake","uncharacteristic behavior","flashback","writer","telephone booth","surveillance","stairwell","stabbed in the neck","scream","police","nosebleed","marriage","lost love","joke","friendship","dog","dentist","dating","dart","body","biologist","banjo","human head on dog's body","murder","amazing grace hymn","rescue","pod","planet","book party","chinese laundry","garbage truck","hypodermic needle","taxi","restaurant","flower","turkish bath","paranoia","san francisco california","hit and run","alien invasion","alien","sabotage","conspiracy","human duplication","chase","transformation","fire","playground","harbor","based on novel","surprise ending","neoliberalism"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:41:00"}}