{"data":{"movies":[{"title":"Our Man Flint","originalTitle":"","year":"1966","releaseDate":"19660116","directors":[{"name":"Daniel Mann","id":"nm0542702"}],"writers":[{"name":"Hal Fimberg","id":"nm0277333"},{"name":"Ben Starr","id":"nm0823465"}],"runtime":"108 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmU5MjE4NWItMjVkNC00Njg5LTg0MDgtMGQ4M2JlOTRiZDFiXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1.jpg","countries":["USA"],"languages":["English","Italian"],"genres":["Action","Adventure","Comedy","Fantasy","Sci-Fi"],"plot":"The world's weather seems to have changed dramatically with violent storms everywhere and long dormant volcanoes suddenly erupting. No one is sure what is happening or why but when American intelligence chief Cramden loses yet another team of agents, there appears to be only one man who can do the job: Derek Flint, former super spy, incredibly rich and the ultimate ladies man. Despite Cramden's concerns, Flint is on the job and soon discovers that the Earth's weather is under the control of a secret organization known as GALAXY whose scientists are looking to pacify the world and devote humankind to scientific pursuits.","simplePlot":"When scientists use eco-terrorism to impose their will on the world by affecting extremes in the weather, Intelligence Chief Cramden calls in top agent Derek Flint.","actors":[{"actorName":"James Coburn","urlProfile":"http://www.imdb.com/name/nm0000336","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNTg3Njg4M15BMl5BanBnXkFtZTcwOTI1ODE1NA@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 August 1928","placeOfBirth":" Laurel, Nebraska, USA","birthName":"James Harrison Coburn Jr.","height":"6' 2\" (1.88 m)","bio":"Lanky, charismatic and versatile actor with an amazing grin that put everyone at ease, James Coburn studied acting at UCLA, and then moved to New York to study under noted acting coach Stella Adler. After being noticed in several stage productions, Coburn appeared in a handful of minor westerns before being cast as the knife-throwing, quick-shooting Britt in the John Sturges mega-hit The Magnificent Seven (1960). Sturges remembered Coburn's talents when he cast his next major film project, The Great Escape (1963), where Coburn played the Australian POW Sedgewick. Regular work now came thick and fast for Coburn, including appearing in Major Dundee (1965), the first of several films he appeared in directed by Hollywood enfant terrible Sam Peckinpah. The next two years were a key period for Coburn, with his performances in the wonderful 007 spy spoof Our Man Flint (1966) and the eerie Dead Heat on a Merry-Go-Round (1966). Coburn followed up in 1967 with a Flint sequel, In Like Flint (1967), and the much underrated political satire The President's Analyst (1967). The remainder of the 1960s was rather uneventful for Coburn. However, he became associated with martial arts legend Bruce Lee and the two trained together, traveled extensively and even visited India scouting locations for a proposed film project, but Lee's untimely death (Coburn, along with Steve McQueen, was a pallbearer at Lee's funeral) put an end to that. The 1970s saw Coburn appearing again in several strong roles, starting off in Peckinpah's Pat Garrett & Billy the Kid (1973), alongside Charles Bronson in the Depression-era Hard Times (1975) and as a disenchanted German soldier on the Russian front in Peckinpah's superb Cross of Iron (1977). Towards the end of the decade, however, Coburn was diagnosed with rheumatoid arthritis, which severely hampered his health and work output for many years. After conventional treatments failed, Coburn turned to a holistic therapist, and through a restructured diet program, made a definite improvement. By the 1990s he was once again appearing regularly in both film and TV productions. No one was probably more surprised than Coburn himself when he was both nominated for, and then won, the Best Supporting Actor Award in 1997 for playing Nick Nolte's abusive and alcoholic father in Affliction (1997). At 70 years of age, Coburn's career received another shot in the arm, and he appeared in another 14 films, including Chiens des neiges (2002) and The Man from Elysian Fields (2001), before his death from a heart attack in November of 2002. Coburn's passions in life included martial arts, card playing and enjoying fine Cuban cigars!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNTg3Njg4M15BMl5BanBnXkFtZTcwOTI1ODE1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000336","name":"James Coburn","idIMDB":"nm0000336"},"actorId":"nm0000336","character":"Derek Flint","urlCharacter":"http://www.imdb.com/character/ch0025045","main":true},{"actorName":"Lee J. Cobb","urlProfile":"http://www.imdb.com/name/nm0002011","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc3MTM0MDQyMF5BMl5BanBnXkFtZTYwMTczMTg2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 December 1911","placeOfBirth":" New York City, New York, USA","birthName":"Leo Jacoby","height":"5' 11\" (1.8 m)","bio":"Lee J. Cobb, one of the premier character actors in American film for three decades in the post-World War II period, was born Leo Jacoby in New York City's Lower East Side on December 8, 1911. The son of a Jewish newspaper editor, young Leo was a child prodigy in music, mastering the violin and the harmonica. Any hopes of a career as a violin virtuoso were dashed when he broke his wrist, but his talent on the harmonica may have brought him his first professional success. At the age of 16 or 17 he ran away from home to Hollywood to try to break into motion pictures as an actor. He reportedly made his film debut as a member of Borrah Minevitch and His Harmonica Rascals (their first known movie appearance was in the 1929 two-reeler Boyhood Days), but that cannot be substantiated. However, it's known that after Leo was unable to find work he returned to New York City, where he attended City College of New York at night to study accounting while acting in radio dramas during the day. An older Cobb tried his luck in California once more, making his debut as a professional stage actor at the Pasadena Playhouse in 1931. After again returning to his native New York, he made his Broadway debut as a saloonkeeper in a dramatization of Fyodor Dostoevsky's Crime and Punishment, but it closed after 15 performances (later in his career, Dostoevsky would prove more of a charm, with Cobb's role as Father Karamazov in The Brothers Karamazov (1958) garnering him his second Oscar nomination), Cobb joined the politically progressive Group Theater in 1935 and made a name for himself in Clifford Odets' politically liberal dramas Waiting for Lefty and Til the Day I Die, appearing in both plays that year in casts that included Elia Kazan, who later became famous as a film director. Cobb also appeared in the 1937 Group Theater production of Odets' Golden Boy, playing the role of Mr. Carp, in a cast that also included Kazan, Julius Garfinkle (later better known under his stage name of John Garfield), and Martin Ritt, all of whom later came under the scrutiny of the House Un-American Activities Committee during the heyday of the McCarthy Red Scare hysteria more than a decade later. Cobb took over the role of Mr. Bonaparte, the protagonist's father, in the 1939 film version of the play, despite the fact that he was not yet 30 years old. The role of a patriarch suited him, and he'd play many more in his film career. It was as a different kind of patriarch that he scored his greatest success. Cobb achieved immortality by giving life to the character of Willy Loman in the original 1949 Broadway production of Arthur Miller's Death of a Salesman. His performance was a towering achievement that ranks with such performances as Edwin Booth as Richard III and John Barrymore as Hamlet in the annals of the American theater. Cobb later won an Emmy nomination as Willy when he played the role in a made-for-TV movie of the play (Death of a Salesman (1966)). Miller said that he wrote the role with Cobb in mind. Before triumphing as Miller's Salesman, Cobb had appeared on Broadway only a handful of times in the 1940s, including in Ernest Hemingway's The Fifth Column (1940), Odets' \"Clash by Night\" (1942) and the US Army Air Force's Winged Victory (1943-44). Later he reprised the role of Joe Bonaparte's father in the 1952 revival of Golden Boy opposite Garfield as his son, and appeared the following year in The Emperor's Clothes. His final Broadway appearance was as King Lear in the Repertory Theatre of Lincoln Center's 1968 production of Shakespeare's play. Aside from his possible late 1920s movie debut and his 1934 appearance in the western The Vanishing Shadow (1934), Cobb's film career proper began in 1937 with the westerns North of the Rio Grande (1937) (in which he was billed as Lee Colt) and Rustlers' Valley (1937) and spanned nearly 40 years until his death. After a hiatus while serving in the Army Air Force during World War II, Cobb's movie career resumed in 1946. He continued to play major supporting roles in prestigious A-list pictures. His movie career reached its artistic peak in the 1950s, when he was twice nominated for Best Supporting Actor Academy Awards, for his role as Johnny Friendly in On the Waterfront (1954) and as the father in The Brothers Karamazov (1958). Other memorable supporting roles in the 1950s included the sagacious Judge Bernstein in The Man in the Gray Flannel Suit (1956), as the probing psychiatrist Dr. Luther in The Three Faces of Eve (1957) and as the volatile Juror #3 in 12 Angry Men (1957). It was in the 1950s that Cobb achieved the sort of fame that most artists dreaded: he was called before the House Un-American Activities Committee on charges that he was or had been a Communist. The charges were rooted in Cobb's membership in the Group Theater in the 1930s. Other Group Theater members already investigated by HUAC included Clifford Odets and Elia Kazan, both of whom provided friendly testimony before the committee, and John Garfield, who did not. Cobb's own persecution by HUAC had already caused a nervous breakdown in his wife, and he decided to appear as a friendly witness in order to preserve her sanity and his career, by bringing the inquisition to a halt. Appearing before the committee in 1953, he named names and thus saved his career. Ironically, he would win his first Oscar nomination in On the Waterfront (1954) directed and written by fellow HUAC informers Kazan and Budd Schulberg. The film can be seen as a stalwart defense of informing, as epitomized by the character Terry Malloy's testimony before a Congressional committee investigating racketeering on the waterfront. Major films in which Cobb appeared after reaching his career plateau include Otto Preminger's adaptation of Leon Uris' ode to the birth of Israel, Exodus (1960); the Cinerama spectacle How the West Was Won (1962); the James Coburn spy spoofs, Our Man Flint (1966) and In Like Flint (1967); Clint Eastwood's first detective film, Coogan's Bluff (1968); and legendary director William Wyler's last film, The Liberation of L.B. Jones (1970). In addition to his frequent supporting roles in film, Cobb often appeared on television. He played Judge Henry Garth on The Virginian (1962) from 1962-66 and also had a regular role as the attorney David Barrett on The Young Lawyers (1969) from 1970-71. Cobb also appeared in made-for-TV movies and made frequent guest appearances on other TV shows. His last major Hollywood movie role was that of police detective Lt. Kinderman in The Exorcist (1973). Lee J. Cobb died of a heart attack in Woodland Hills, California, on February 11, 1976, at the age of 64. He is buried in Mount Sinai Memorial Park Cemetery in Los Angeles, California. Though he will long be remembered for many of his successful supporting performances in the movies, it is as the stage's first Willy Loman in which he achieved immortality as an actor. Bearing in mind that the role was written for him, it is through Willy that he will continue to have an influence on American drama far into the future, for as long as Death of a Salesman is revived.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc3MTM0MDQyMF5BMl5BanBnXkFtZTYwMTczMTg2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002011","name":"Lee J. Cobb","idIMDB":"nm0002011"},"actorId":"nm0002011","character":"Cramden","urlCharacter":"http://www.imdb.com/character/ch0025046","main":true},{"actorName":"Gila Golan","urlProfile":"http://www.imdb.com/name/nm0324871","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NTI4NzQwM15BMl5BanBnXkFtZTcwNDA3MTAzNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1940","placeOfBirth":" Kraków, Malopolskie, Poland","birthName":"Miriam Goldberg","bio":"Gila Golan's career started as an Israeli fashion model, which led to appearances as a film actress. She was apparently born in Krakow, Poland, for she was discovered there in a train station during the German occupation in 1940. She was adopted by a Roman Catholic couple and later sent to a boarding school in France before emigrating to Israel after World War II where she changed her name from Zusia Sobetzcki to Miriam Goldberg. She became interested in fashion and her being spotted by an American photographer led to appearing in the Israeli magazine La'isha. It was a natural step for her to extend her fashion activities into the 1960 competition which led to her being crowned \"Na'arat Israel\" - Israel's Maiden of Beauty (IMB) - or using international usage, \"Miss Israel.\" For this competition she changed her name to Gila Golan. Such a change of names to one more typically Israeli was common at the time, but she may have done this to prevent any embarrassment to her religiously conservative family and friends. She went on to place second in the Miss World competition held later that year in London where she met the Columbia Pictures executive William Cohan and his wife. This led to her entrance into films with a debut in Ship of Fools (1965). Cohen and his wife came to view her as sort of a foster daughter. She married three times and has several children and reportedly she now runs an investment business.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NTI4NzQwM15BMl5BanBnXkFtZTcwNDA3MTAzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0324871","name":"Gila Golan","idIMDB":"nm0324871"},"actorId":"nm0324871","character":"Gila","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edward Mulhare","urlProfile":"http://www.imdb.com/name/nm0611811","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MzI5NDA5M15BMl5BanBnXkFtZTcwMDk2NDYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1923","placeOfBirth":" Cork, Ireland","height":"6' 2½\" (1.9 m)","bio":"Suave Irish-born actor with resonant voice and a commanding presence, who made his theatrical debut in 'The First of Mrs.Fraser' (1942) at the age of 19 at the Cork Opera House. Nine years later, after spells with the Gate Theatre in Dublin and the Liverpool Repertory Company, Mulhare appeared in a Laurence Olivier-directed London production of 'Othello' with Orson Welles. It was there, that he was spotted by Alan Jay Lerner and signed as an understudy to Rex Harrison for the part of Henry Higgins in 'My Fair Lady'. The play ran on Broadway from 1957 to 1962, totalling a massive 2,717 performances. Harrison dropped out of the part in December 1957, and Mulhare, a relative unknown in the U.S., took over the role. This sparked a controversy with Actor's Equity over the hiring of foreign actors, which required a noted labour negotiator to resolve. In the end, Mulhare played Higgins to both audience approval and critical acclaim more than 1,000 times between 1957 and 1960. The play subsequently toured the Soviet Union, before returning to London. On Broadway, Mulhare also replaced Michael Rennie in the leading role of Dirk Winsten in 'Mary,Mary' and starred as Giacome Nerone in Dore Schary's 'The Devil's Advocate', alongside actors Leo Genn and Eduardo Ciannelli. It was ironic, that Mulhare followed in Harrison's footsteps on television as well, playing the part of Captain Daniel Gregg (Harrison's in the 1947 movie), the titular spectre of The Ghost & Mrs. Muir (1968). The popular NBC series updated the setting from turn of the century New England to present day, and, by comparison with its cinematic predecessor, was less sentimental, but wittier by some degree. There was an undeniable on-screen chemistry between co-star Hope Lange and Mulhare, who was Emmy-nominated for his portrayal as the cantankerous, but thoroughly charming captain. From 1982 to 1986, Mulhare also appeared on television as the articulate Devon Miles, David Hasselhoff's boss, in the fantasy series Knight Rider (1982). Surprisingly, Edward Mulhare never achieved star status on the big screen. Among the few films he made, one only remembers his dastardly villains of Our Man Flint (1966) and Caprice (1967). He did, however, continue to make frequent guest appearances on television in series ranging from The Streets of San Francisco (1972) to Battlestar Galactica (1978). In 1988, he also hosted a series about the paranormal, entitled Secrets and Mysteries (1983). Mulhare, a confirmed bachelor, died during filming of the Jack Lemmon/Walter Matthau comedy Out to Sea (1997) at the age of 74.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MzI5NDA5M15BMl5BanBnXkFtZTcwMDk2NDYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0611811","name":"Edward Mulhare","idIMDB":"nm0611811"},"actorId":"nm0611811","character":"Malcolm Rodney","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Benson Fong","urlProfile":"http://www.imdb.com/name/nm0284538","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NzY0MjMwMl5BMl5BanBnXkFtZTgwNDY1ODgwMzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1916","placeOfBirth":" Sacramento, California, USA","height":"5' 9\" (1.75 m)","bio":"Benson Fong was born on October 10, 1916 in Sacramento, California, USA. He is known for his work on The Love Bug (1968), Flower Drum Song (1961) and Our Man Flint (1966). He was married to Maylia. He died on August 1, 1987 in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NzY0MjMwMl5BMl5BanBnXkFtZTgwNDY1ODgwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0284538","name":"Benson Fong","idIMDB":"nm0284538"},"actorId":"nm0284538","character":"Dr. Schneider","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shelby Grant","urlProfile":"http://www.imdb.com/name/nm0335649","urlPhoto":"","biography":{"dateOfBirth":"19 October 1936","placeOfBirth":" Orlando, Oklahoma, USA","birthName":"Brenda Lou Thompson","bio":"Shelby Grant was born on October 19, 1936 in Orlando, Oklahoma, USA as Brenda Lou Thompson. She was an actress, known for Fantastic Voyage (1966), Our Man Flint (1966) and The Witchmaker (1969). She was married to Chad Everett and Daniel Eugene Smith. She died on June 25, 2011 in Westlake Village, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0335649","name":"Shelby Grant","idIMDB":"nm0335649"},"actorId":"nm0335649","character":"Leslie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sigrid Valdis","urlProfile":"http://www.imdb.com/name/nm0883724","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MjM3NDczMV5BMl5BanBnXkFtZTYwMDk0OTcy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 September 1935","placeOfBirth":" Bakersfield, California, USA","birthName":"Patricia Annette Olson","bio":"A native Californian of Swedish descent, Sigrid Valdis (the professional stage name of Patricia Olson) was raised in the Westwood/Brentwood suburbs of Los Angeles, and attended many exclusive private schools, including Marymount High School. Upon graduation she moved to Europe, then to New York City to continue the modeling career she had begun as a teenager. While working as a designer's, showroom and runway model, she met and married a businessman in the fashion industry. After the birth of her first child, Melissa, she began studying at Stella Adler's Theatre School while at the same time working on her first feature film. Her natural talent and on-screen demeanor was impressive, and she found herself back in California in 1964 in pursuit of a promising acting career. Over the next 18 months she would accumulate an impressive list of credits and on-camera time: Her first film, Two Tickets to Paris (1962) starring Joey Dee of \"Peppermint Twist\" fame, was followed by big screen roles in Marriage on the Rocks (1965) (alongside Frank Sinatra and Dean Martin), Our Man Flint (1966) (starring James Coburn and Lee J. Cobb), and The Venetian Affair (1966) (with Robert Vaughn). The exposure of the movies brought her a plethora of work in television and opportunities to work with TV legends such as Phil Silvers, Steve Allen, Red Skelton and Sid Caesar. She shared the small screen with the likes of Allan Sherman, Dennis Hopper, Henry Silva, Robert Conrad and Ross Martin. Her numerous credits include Kraft Mystery Theater (1959), Arrest and Trial (1963), The Wild Wild West (1965) and The Mouse That Roared. She also performed on stage, most notably during the summer of 1968 when she toured with Bob Crane and Abby Dalton in the Broadway play \"Cactus Flower.\" In addition to the exposure and the opportunity to work with Hollywood's biggest names, Sigrid was becoming recognized for the ability to perform effectively in various types of roles in various genres and settings. She succeeded in movies and television, comedy and drama, commercials, sitcoms and skits, and was equally successful in both lead and supporting roles. Sadly, her husband died in 1967, just a short time after she had begun to gain exposure on a weekly network television show. Sigrid Valdis caught the eye of Hogan's Heroes (1965) producer Edward Feldman in 1965, leading to her guest appearance as Gretchen in Episode 10. When the second season began, Feldman brought her under contract as a regular cast member, playing the role of Hilda, Col. Klink's secretary. On October 16, 1970, Sigrid and Crane were married on the set of the show. At that time, theirs was the first reported \"actual\" marriage to be performed on a sound stage. A year later they had a son, Robert Scott Crane. Sigrid retired from acting following Scott's birth so that she could devote herself to her husband and family. Although the Cranes were separated during part of 1977, they reconciled in 1978. However, Sigrid met with tragedy again a few months later when Crane was brutally murdered. In the midst of such excruciating circumstances, Sigrid moved from the Los Angeles area to protect her family from the constant media scrutiny invited by the case.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MjM3NDczMV5BMl5BanBnXkFtZTYwMDk0OTcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0883724","name":"Sigrid Valdis","idIMDB":"nm0883724"},"actorId":"nm0883724","character":"Anna","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gianna Serra","urlProfile":"http://www.imdb.com/name/nm0785395","urlPhoto":"","biography":{"dateOfBirth":"14 November 1943","placeOfBirth":"","bio":"Gianna Serra was born on November 14, 1943. She is an actress, known for Our Man Flint (1966), The Hills Run Red (1966) and How to Win a Billion... and Get Away with It (1967).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0785395","name":"Gianna Serra","idIMDB":"nm0785395"},"actorId":"nm0785395","character":"Gina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Helen Funai","urlProfile":"http://www.imdb.com/name/nm0298571","urlPhoto":"","biography":{"bio":"Helen Funai is known for her work on Our Man Flint (1966), The Young and the Restless (1973) and Days of Our Lives (1965).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0298571","name":"Helen Funai","idIMDB":"nm0298571"},"actorId":"nm0298571","character":"Sakito","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael St. Clair","urlProfile":"http://www.imdb.com/name/nm0820464","urlPhoto":"","biography":{"dateOfBirth":"20 December 1922","placeOfBirth":" Sydney, New South Wales, Australia","bio":"Australian-born character actor Michael St Clair served in the Australian army during World War II and also worked as a ventriloquist. He was driving back from an audition when he suffered a stroke. Was taken to Cedars-Sinai Medical Center after passers-by discovered him unconscious in his car, died two days later.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0820464","name":"Michael St. Clair","idIMDB":"nm0820464"},"actorId":"nm0820464","character":"Hans Gruber","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rhys Williams","urlProfile":"http://www.imdb.com/name/nm0931525","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTM2MzQ2OF5BMl5BanBnXkFtZTcwNTI5NDUyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1897","placeOfBirth":" Clydach, Swansea, Wales, UK","bio":"Moviegoers can be forgiven if they thought that stocky, jaunty Rhys Williams was a jovial Irishman, as he often played that type of character, but his role as a Welsh miner in John Ford's classic How Green Was My Valley (1941) (his film debut) was much closer to home for him, as he was born and raised in Wales. In fact, he served as a technical advisor and Welsh language consultant on the film. He began his career on the British stage, and traveled the country as a member of various Shakespearean stock companies, even joining the famed Globe Theater company for a spell. Once he began his career in Hollywood, though, he became one of the busiest supporting actors in the business. He appeared in everything from action pictures to mysteries to westerns to musicals. One of his few villainous roles was as a weaselly American reporter in Tokyo on the payroll of the Japanese government just prior to World War II in Blood on the Sun (1945). In addition to his prolific film work, he did much television over the years, appearing in everything from Maverick (1957) to Mission: Impossible (1966). He died in Santa Monica, California, in 1969, shortly before his last film, Skullduggery (1970), was released.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NTM2MzQ2OF5BMl5BanBnXkFtZTcwNTI5NDUyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0931525","name":"Rhys Williams","idIMDB":"nm0931525"},"actorId":"nm0931525","character":"Dr. Krupov","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Russ Conway","urlProfile":"http://www.imdb.com/name/nm0176773","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NjczMTgxMV5BMl5BanBnXkFtZTgwNjkxNDY2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1913","placeOfBirth":" Brandon, Manitoba, Canada","birthName":"Russell Clarence Zink","bio":"Russ Conway was born on April 25, 1913 in Brandon, Manitoba, Canada as Russell Clarence Zink. He was an actor, known for What Ever Happened to Baby Jane? (1962), The Heiress (1949) and The Screaming Skull (1958). He was married to Muriel Morrison. He died on January 12, 2009 in Laguna Hills, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NjczMTgxMV5BMl5BanBnXkFtZTgwNjkxNDY2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0176773","name":"Russ Conway","idIMDB":"nm0176773"},"actorId":"nm0176773","character":"American General","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ena Hartman","urlProfile":"http://www.imdb.com/name/nm0366948","urlPhoto":"","biography":{"dateOfBirth":"1 April 1935","placeOfBirth":" Moscow, Arkansas, USA","bio":"Ena Hartman was born on April 1, 1935 in Moscow, Arkansas, USA. She is an actress, known for Airport (1970), Dan August (1970) and Our Man Flint (1966).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0366948","name":"Ena Hartman","idIMDB":"nm0366948"},"actorId":"nm0366948","character":"WAC","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Walker","urlProfile":"http://www.imdb.com/name/nm0907553","urlPhoto":"","biography":{"dateOfBirth":"1 July 1896","placeOfBirth":" Pendleton, Indiana, USA","birthName":"William Franklin Walker","bio":"Bill Walker was born on July 1, 1896 in Pendleton, Indiana, USA as William Franklin Walker. He is known for his work on The Long, Hot Summer (1958), Hush...Hush, Sweet Charlotte (1964) and Big Jake (1971). He was married to Peggy Cartwright. He died on January 27, 1992 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0907553","name":"Bill Walker","idIMDB":"nm0907553"},"actorId":"nm0907553","character":"American Diplomat","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Brocco","urlProfile":"http://www.imdb.com/name/nm0110480","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzZkZGMyM2UtNDFlMS00OWQ5LTgxMWMtOGYxODM2NmQ0YjE2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 January 1903","placeOfBirth":" Reading, Pennsylvania, USA","birthName":"Carl Peter Brocco","height":"5' 8½\" (1.74 m)","bio":"Prolific, sharp-featured American character actor of somewhat skeletal and dishevelled appearance, accentuated later in his career by thinning hair and a scraggly goatee. A former theology student, Brocco began his career playing leading roles in stock theatre. He subsequently honed his craft touring France, Italy, Spain and Switzerland, before returning to the U.S. in 1947, eventually joining the Federal Theater Group. On films from as early as 1932, he was at his most effective portraying eccentrics, scientists, small-time crooks, alcoholics, or nervous, downtrodden little men. His particular forte lay in the genre of science-fiction, where he graced the small screen on numerous occasions as assorted victims (The Outer Limits (1963), The Time Tunnel (1966), The Invaders (1967)) or aliens (Lost in Space (1965), Star Trek (1966), The Twilight Zone (1959)). His occasional film appearances include a dementia patent in One Flew Over the Cuckoo's Nest (1975) and a rare starring role in the black comedy Homebodies (1974), late in his career. As a liberal-minded individual, Brocco was briefly blacklisted during the McCarthy era, but this did not prove detrimental to his career in the long run.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzZkZGMyM2UtNDFlMS00OWQ5LTgxMWMtOGYxODM2NmQ0YjE2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0110480","name":"Peter Brocco","idIMDB":"nm0110480"},"actorId":"nm0110480","character":"Dr. Wu","urlCharacter":"http://www.imdb.com/character/ch0025047","main":true}],"seasons":[],"idIMDB":"tt0059557","urlIMDB":"http://www.imdb.com/title/tt0059557","business":{"budget":{"money":"$3,525,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 48 min (108 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["DeLuxe"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["CinemaScope"],"printedFilmFormat":["35 mm"]},"rating":"6.5","filmingLocations":[{"location":"USS Yorktown, Pacific Ocean"}],"rated":"UNRATED","awards":[{"award":"Laurel Awards 1966","titlesAwards":[{"titleAwardOutcome":"2nd place Golden Laurel","categories":[{"category":"Action Drama","names":[]},{"category":"Action Performance","names":[{"name":"James Coburn","id":"nm0000336","role":null}]}]}]},{"award":"Writers Guild of America, USA 1967","titlesAwards":[{"titleAwardOutcome":"Nominated WGA Award (Screen)","categories":[{"category":"Best Written American Comedy","names":[{"name":"Hal Fimberg","id":"nm0277333","role":null},{"name":"Ben Starr","id":"nm0823465","role":null}]}]}]}],"votes":"4,834","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"}],"keywords":{"keywords":["scientist","galaxy","earthquake","mad scientist","eco terrorism","spy","american","secret agent","reward room","blockbuster","knocked out","subtitled scene","telephone","binoculars","female assassin","escape","crushed to death","eavesdropping","ambush","violence","henchman","assassin","evacuation","dojo","kicked in the face","punched in the chest","punched in the face","strip club","stripper","map","undercover agent","undercover","deception","villain turns good","key","hero","coming out of retirement","private jet","apartment","airplane","government agent","super computer","pneumatic tube","united nations","secret government organization","lightning","flood","safe","hidden door","wiretapping","female soldier","race against time","general","sex slave","free love","tongue in cheek","absurdism","disguise","fight in the restroom","marseilles france","showdown","knife throwing","knife","tommy gun","revolver","silencer","pistol","terrorist plot","terrorist","terrorism","terrorist group","security guard","mind control","nightclub","hostage","foot chase","chase","dam","stick fight","hand to hand combat","brawl","fistfight","mission","espionage","one man army","action hero","weather control","hurricane","tornado","code book","presumed dead","gadgetry","explosive","detonator","1960s","scene before opening credits","harem","one against many","volcano","tuxedo","twist the dance","climate change","damsel in distress","rome italy","delta airlines","grindhouse","white house","taxi driver","satire","safecracking","renaissance man","polygamy","karate","hotline","hedonism","cold cream","bikini","avalanche","u boat","ex nazi","world domination","femme fatale","spy hero","new york","lighter","wristwatch","waterfall","washington d.c.","volcanic eruption","u.s. president","taxi","tarmac","sword fight","steam","shower","shaving","safecracker","sabotage","roma","restroom","restaurant","rescue","poison dart","playboy","new york city","nazi","murder","megalomaniac","marseille","ladder","kidnapping","judo","impostor","forklift","fight","fencing","falling from height","faked death","explosion","elevator","eagle","drive in theater","dog","disintegration","dancing","dam burst","computer","coffin","code","cigarette lighter","cardiopulmonary resuscitation","cafe","bouillabaisse","bomb","blow torch","betrayal","beauty salon","barrel","audio surveillance","assassination attempt","animal attack","airport","aircraft carrier","turban","electrofragmentizer","weather manipulation","island","mastermind","pleasure drone","submarine","secret headquarters","spy spoof","utopia","brainwashing","james bond spoof","drugs","hypnosis","technology","high dive","genius","gadget","global warming","harp","martial arts","morse code","spoof","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 22:54:10"}}