{"data":{"movies":[{"title":"Blow-Up","originalTitle":"Blowup","year":"1966","releaseDate":"19670524","directors":[{"name":"Michelangelo Antonioni","id":"nm0000774"}],"writers":[{"name":"Michelangelo Antonioni","id":"nm0000774"},{"name":"Julio Cortázar","id":"nm0181497"}],"runtime":"111 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGVjMmExMDctNGFhNy00M2UzLWI5MTEtYmE0NzhiODVkYWQ4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["UK","Italy","USA"],"languages":["English"],"genres":["Crime","Drama","Mystery","Thriller"],"plot":"A successful mod photographer in London whose world is bounded by fashion, pop music, marijuana, and easy sex, feels his life is boring and despairing. Then he meets a mysterious beauty, and also notices something frightfully suspicious on one of his photographs of her taken in a park. The fact that he may have photographed a murder does not occur to him until he studies and then blows up his negatives, uncovering details, blowing up smaller and smaller elements, and finally putting the puzzle together.","simplePlot":"A mod London photographer finds something very suspicious in the shots he has taken of a mysterious beauty in a desolate park.","actors":[{"actorName":"Vanessa Redgrave","urlProfile":"http://www.imdb.com/name/nm0000603","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MjE0OTgzNF5BMl5BanBnXkFtZTcwOTQ3ODMwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 January 1937","placeOfBirth":" Greenwich, London, England, UK","height":"5' 11\" (1.81 m)","bio":"On January 30, 1937, renowned theatre actor Michael Redgrave was performing in a production of Hamlet in London. During the curtain call, the show's lead, Laurence Olivier, announced to the audience: \"tonight a great actress was born\". This was in reference to his co-star's newborn daughter, Vanessa Redgrave. Vanessa was born in Greenwich, London, to Michael Redgrave and Rachel Kempson, both thespians. Three quarters of a century after her birth (despite numerous ups and down) this rather forward expectation has definitely been lived up to with an acclaimed actress that has won (among many others) an Academy Award, two Emmys, two Golden Globes, two Cannes Best Actress awards, a Tony, a Screen Actors Guild award, a Laurence Olivier theatre award and a BAFTA fellowship. Growing up with such celebrated theatrical parents, great expectations were put on both herself, her brother Corin Redgrave and sister Lynn Redgrave at an early age. Shooting up early and finally reaching a height just short of 6 foot, Redgrave initially had plans to dance and perform ballet as a profession. However she settled on acting and entered the Central School of Speech and Drama in 1954 and four years later made her West End debut. In the decade of the 1960s she developed and progressed to become one of the most noted young stars of the English stage and then film. Performances on the London stage included the classics: 'A Touch of Sun', 'Coriolanus', 'A Midsummer's Night Dream', 'All's Well that Ends Well', 'As You Like It', 'The Lady from the Sea', 'The Seagull' and many others. By the mid 1960s, she had booked various film roles and matured into a striking beauty with a slim, tall frame and attractive face. In 1966 she made her big screen debut as the beautiful ex-wife of a madman in an Oscar nominated performance in the oddball comedy Morgan! (1966), as well as the enigmatic woman in a public park in desperate need of a photographer's negatives in the iconic Blow-Up (1966) and briefly appeared in an unspoken part of Anne Boleyn in the Best Picture winner of the year A Man for All Seasons (1966). She managed to originate the title role in \"The Prime of Miss Jean Brodie\" the same year on the London stage (which was then adapted for the big screen a few years later, but Maggie Smith was cast instead and managed to win an Oscar for her performance). Her follow up work saw her play the lead in the box office hit adaptation Camelot (1967), a film popular with audiences but dismissed by critics, and her second Academy Award nominated performance as Isadora Duncan in the critically praised Isadora (1968). Her rise in popularity on film also coincided with her public political involvement, she was one of the lead faces in protesting against the Vietnam war and lead a famous march on the US embassy, was arrested during a Ban-the-Bomb demonstration, publicly supported Yasar Arafat's Palestine Liberation Organization (PLO) and fought for various other human rights and particularly left wing causes. Despite her admirably independent qualities, most of her political beliefs weren't largely supported by the public. In 1971 after 3 films back to back, Redgrave suffered a miscarriage (it would have been her fourth, after Natasha Richardson, Joely Richardson and Carlo Gabriel Nero) and a break up with her then partner and father of her son, Franco Nero. This was around the same time her equally political brother Corin introduced her to the Workers Revolutionary Party, a group who aimed to destroy capitalism and abolish the monarchy. Her film career began to suffer and take the back seat as she became more involved with the party, twice unsuccessfully attempting to run as a party member for parliament, only obtaining a very small percentage of votes. In terms of her film career at the time, she was given probably the smallest part in the huge ensemble who-dunnit hit, Murder on the Orient Express (1974) and given another thankless small part as Lola Deveraux in the Sherlock Holmes adventure The Seven-Per-Cent Solution (1976). After a celebrated Broadway debut, she created further controversy in 1977 with her involvement in two films, firstly in Julia (1977) where she acted opposite Jane Fonda as a woman fighting Nazi oppression and narrated and featured in the documentary The Palestinian (1977) where she famously danced holding a Kalashnikov rifle. She publicly stated her condemnation of what she termed \"Zionist hudlums\", which outraged Jewish groups and as a result a screening of her documentary was bombed and Redgrave was personally threatened by the Jewish Defense League (JDL). Julia (1977) happened to be a huge critical success and Redgrave herself was nominated for a Best Supporting Actress Oscar, but Jewish support groups demanded her nomination to be dropped and at the event of the Academy Awards burned effigies of Redgrave and protested and picketed. Redgrave was forced to enter the event via a rear entrance to avoid harm and when she won the award she famously remarked on the frenzy causes as \"Zionist hoodlums\" which caused the audience to audibly gasp and boo. The speech reached newspapers the next morning and her reputation was further damaged. It came as a surprise when CBS hired her for the part of real life Nazi camp survivor Fania Fenelon in Playing for Time (1980), despite more controversy and protesting (Fenelon herself didn't even want Redgrave to portray her) she won an Emmy for the part and the film was one of the highest rating programs of the year. Her follow up film work to her Oscar had been mostly low key but successful, performances in films such as Yanks (1979), Agatha (1979), The Bostonians (1984), Wetherby (1985) and Prick Up Your Ears (1987) further cemented her reputation as a fine actress and she received various accolades and nominations. However mainly in the 1980s, she focused on TV films and high budget mini-series as well as theatre in both London and New York. She made headlines in 1984 when she sued the Boston Symphony Orchestra for $5 million for wrongful cancellation of her contract because of her politics (she also stated her salary was significantly reduced in Agatha (1979) for the same reason). She became more mainstream in the 1990s where she appeared in a string of high profile films but the parts often underused Redgrave's abilities or they were small cameos/5-minute parts. Highlights included Howards End (1992), Little Odessa (1994), Mission: Impossible (1996) and Cradle Will Rock (1999), as well as her leading lady parts in A Month by the Lake (1995) and Mrs Dalloway (1997). In 2003 she finally won the coveted Tony award for her performance in 'The Long Day's Journey Into Night' and followed up with another two Tony nominated performances on Broadway, her one woman show 'The Year of Magical Thinking' in 2007 and 'Driving Miss Daisy' in 2010 which not only was extended due to high demand, but was also transferred to the West End for an additional three months in 2011. Vanessa continues to lend her name to causes and has been notable for donating huge amounts of her own money for her various beliefs. She has publicly opposed the war in Iraq, campaigned for the closure of Guantanamo Bay, supported the rights of gays and lesbians as well as AIDs research and many other issues. She released her autobiography in 1993 and a few years later she was elected to serve as a UNICEF Goodwill Ambassador. She also famously declined the invitation to be made a Dame for her services as an actress. Many have wondered the possible heights her career could have reached if it wasn't for her outspoken views, but being a celebrity and the artificial lifestyle usually attached doesn't seem to interest Redgrave in the slightest. Vanessa has worked with all three of her children professionally on numerous occasions (her eldest daughter, Natasha Richardson tragically died at the age of 45 due to a skiing accident) and in her mid 70s she still works regularly on television, film and theatre, delivering time and time again great performances.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MjE0OTgzNF5BMl5BanBnXkFtZTcwOTQ3ODMwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000603","name":"Vanessa Redgrave","idIMDB":"nm0000603"},"actorId":"nm0000603","character":"Jane","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sarah Miles","urlProfile":"http://www.imdb.com/name/nm0587234","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMTc0NDc4NF5BMl5BanBnXkFtZTcwMzYyOTkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1941","placeOfBirth":" Ingatestone, Essex, England, UK","height":"5' 5\" (1.65 m)","bio":"Sarah Miles is an English actress whose career flourished during the Swinging Sixties and in the early Seventies. The high point of her career came when her husband, screenwriter Robert Bolt, adapted \"Madame Bovary\" into a story set during the 1916 Easter Rebellion in Ireland. Directed by David Lean, Ryan's Daughter (1970), with Miles as the eponymous lead, brought her a Best Actress Oscar nomination. Lean equated her as a talent with Julie Christie, whom she physically resembled. However, Bolt's next script for her, Lady Caroline Lamb (1972), which he also directed, was a critical and box office flop when it was released in 1973. That same year, she was involved with scandal when her manager died under mysterious circumstances during the shooting of The Man Who Loved Cat Dancing (1973). She reportedly was cuckolding Robert Bolt with her \"Cat\" co-star, Burt Reynolds. After appearing in a TV adaptation of William Faulkner's \"Requiem for a Nun\" for the Hollywood Television Theatre (broadcast by PBS) in 1975 and The Sailor Who Fell from Grace with the Sea (1976) in 1976, Miles divorced Bolt and her career dropped off. Miles had one last burst of glory with Hope and Glory (1987) (1989). She is now retired from the acting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMTc0NDc4NF5BMl5BanBnXkFtZTcwMzYyOTkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0587234","name":"Sarah Miles","idIMDB":"nm0587234"},"actorId":"nm0587234","character":"Patricia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Hemmings","urlProfile":"http://www.imdb.com/name/nm0376101","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3OTY3Mjk2NV5BMl5BanBnXkFtZTYwOTkyNTM2._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1941","placeOfBirth":" Guildford, Surrey, England, UK","birthName":"David Leslie Edward Hemmings","height":"5' 8\" (1.73 m)","bio":"David Hemmings, one of the great English cinema icons of the 1960s, was born in Guildford, Surrey, on November 18, 1941, to a cookie merchant and his wife. He was educated at Glyn College, Epsom, but while still a child, Hemmings made his first forays into the world of entertainment. An accomplished singer, he toured as a boy soprano with the English Opera Group, famed for his performances of the works of Benjamin Britten. Britten, who befriended the youngster, wrote some roles specifically for Hemmings, including that of \"Miles\" in \"The Turn of the Screw\". Hemmings subsequently took up painting after his career as a soprano was ended by his transit through puberty. He studied painting at the Epsom School of Art, where he staged the first exhibition of his work at the school when he was 15 years old. Hemmings made his film debut in 1954, with The Rainbow Jacket (1954) for Ealing Studios. He also had bit part in Otto Preminger's 1957 version of Saint Joan (1957). In his 20s, he returned to singing, appearing at nightclubs before concentrating on the stage and the cinema. As the youth culture hit Britain in the late 50s (the Notting Hill race riots of August 1958 limned in Julien Temple's 1986 film Absolute Beginners (1986) being a kind of bookmark signaling its arrival), Hemmings was in the right place at the right time to capitalize on his skills and looks. Boyish-looking, with large, protuberant blue eyes covered with heavy lids, his face was at once startling and decadent while simultaneously conveying an air of fragility. He starred in pop music movies Sing and Swing (1963) and Be My Guest (1965), as well as co-starring in one of Michael Winner's first films, The Girl-Getters (1964), with Oliver Reed. The 24-year-old Hemmings desperately wanted what would become his career-defining role, as the morally jaded fashion photographer Thomas in master-director Michelangelo Antonioni's Blow-Up (1966). He was up against the crème of British actors, including Terence Stamp, who already had an Oscar nomination under his belt and was conventionally handsome. Hemmings thought he had blown his audition as Antonioni shook his head constantly throughout his audition. However, he later found out the great director had a mild form of Tourette's which caused him to move his head from side to side. The role made him a star and, for a while, a darling of the pop culture filmmaking that was expected to revolutionize the English-speaking cinema in the 1960s, after the 1964 Best Picture Oscar-win of Tony Richardson's Tom Jones (1963). He was cast as Mordred in the big-screen adaptation of Lerner & Lowe's musical Camelot (1967) with Richard Harris and Hemmings Blow-Up (1966) co-star Vanessa Redgrave to critically panned results. The same year that \"Camelot\" was released (1967), he put out a pop single (\"Back Street Mirror\") and an album, \"David Hemmings Happens\", recorded in Los Angeles. His album was produced by Jim Dickinson, the early producer of The Byrds, and featured instrumental backing by several members of group. It was re-released on CD in 2005. In 1968, he appeared as Dildano opposite Jane Fonda (in her incarnation as a sexpot) in Roger Vadim's kitsch klassic Barbarella (1968). However, to reduce stereotyping and his identification with pop culture filmmaking, he took on the role of the anti-hero Captain Nolan in Tony Richardson's masterful satire The Charge of the Light Brigade (1968) and later, the eponymous role in Alfred the Great (1969). While both films were imbued with the counter-cultural attitudes of their times, the roles themselves were rather straightforward. Hemmings had reached the summit of his career as an actor. These were the heights he never reached again. As the quality of his roles declined, Hemmings turned more to directing. He had directed his first film in 1972, helming the thriller Running Scared (1972) which starred Gayle Hunnicutt, his wife from 1968 to 1974. Hemmings also co-wrote the script. In the 1970s, he had relocated to Malibu, California to live with Hunnicutt, and the fabled beach community which was his home for the next generation. In 1975, he starred as Bertie Wooster in the Andrew Lloyd Webber musical, \"Jeeves\", one of Lord Webber's few flops. Hemmings formed the independent production company Hemdale Corp. with his business partner, John Daly, in the early 1970s as a tax shelter. He was able to use Hemdale and his role as a producer to vivify his directing career. In 1979, Hemmings the director first attracted major attention with Just a Gigolo (1978), but the film was a flop in spite of its interesting cast. After directing the 1981 adventure film Treasure of the Yankee Zephyr (1981) and an adaptation of James Herbert's novel \"The Survivor\", he focused on TV directing. He soon became one of the top directors of American action TV programs, including The A-Team (1983), Airwolf (1984), Magnum, P.I. (1980) and Quantum Leap (1989). However, in the nineties, he abandoned directing, and returned to live in the UK. The role of \"Cassius\" in Gladiator (2000) heralded his full-time return to acting. He was also memorable in a small role in Martin Scorsese's Gangs of New York (2002). But it was his last major role, in the cinema adaption of Graham Swift's Last Orders (2001), that showed Hemmings at the top of his talent. Unrecognizable from the boy-man of 1966-70, he was memorable as the ex-boxer who ruefully remembers the past with his remaining buddies as they travel to throw the ashes of a departed friend into the sea. That two of the other major roles were filled by Michael Caine and Tom Courtenay, two other British actors whose careers first flourished in the 1960s, added to the poignancy of this tale of men trying to recapture lost time. He also appeared, less memorably, in The League of Extraordinary Gentlemen (2003) opposite the ultimate 60s male British cinema icon, Sean Connery. David Hemmings died of a heart attack on December 3, 2003, in Bucharest, Romania, on the set of Blessed (2004), after playing his scenes for the day. He was 62 years old. His autobiography, \"Blow Up... and Other Exaggerations\" was published in 2004.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3OTY3Mjk2NV5BMl5BanBnXkFtZTYwOTkyNTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0376101","name":"David Hemmings","idIMDB":"nm0376101"},"actorId":"nm0376101","character":"Thomas","urlCharacter":"http://www.imdb.com/character/ch0032004","main":true},{"actorName":"John Castle","urlProfile":"http://www.imdb.com/name/nm0145284","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjIxMTk0NV5BMl5BanBnXkFtZTcwMTY1NTgwMw@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1940","placeOfBirth":" Croydon, Surrey, England, UK","birthName":"John Michael Frederick Castle","height":"5' 10\" (1.78 m)","bio":"John Castle was born on January 14, 1940 in Croydon, Surrey, England as John Michael Frederick Castle. He is an actor, known for Blow-Up (1966), The Lion in Winter (1968) and RoboCop 3 (1993). He has been married to Maggie Wadey since 1963. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjIxMTk0NV5BMl5BanBnXkFtZTcwMTY1NTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0145284","name":"John Castle","idIMDB":"nm0145284"},"actorId":"nm0145284","character":"Bill","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jane Birkin","urlProfile":"http://www.imdb.com/name/nm0000945","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MDM3NjczOV5BMl5BanBnXkFtZTcwNTQ0MDgwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1946","placeOfBirth":" London, England, UK","birthName":"Jane Mallory Birkin","height":"5' 8½\" (1.74 m)","bio":"Jane Birkin was born on December 14, 1946 in London, England as Jane Mallory Birkin. She is an actress, known for Death on the Nile (1978), Blow-Up (1966) and La belle noiseuse (1991). She was previously married to John Barry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MDM3NjczOV5BMl5BanBnXkFtZTcwNTQ0MDgwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000945","name":"Jane Birkin","idIMDB":"nm0000945"},"actorId":"nm0000945","character":"The Blonde","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gillian Hills","urlProfile":"http://www.imdb.com/name/nm0385122","urlPhoto":"","biography":{"dateOfBirth":"5 June 1944","placeOfBirth":" Cairo, Egypt","bio":"Gillian Hills was born on June 5, 1944 in Cairo, Egypt. She is an actress, known for A Clockwork Orange (1971), Blow-Up (1966) and Mesrine Part 1: Killer Instinct (2008). She is married to Stewart Young.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0385122","name":"Gillian Hills","idIMDB":"nm0385122"},"actorId":"nm0385122","character":"The Brunette","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Bowles","urlProfile":"http://www.imdb.com/name/nm0101248","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI1Mzk4NDk2Ml5BMl5BanBnXkFtZTcwNjMzNjk5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 October 1936","placeOfBirth":" London, England, UK","height":"6' 2½\" (1.9 m)","bio":"Peter Bowles was born on October 16, 1936 in London, England. He is an actor and writer, known for The Bank Job (2008), Blow-Up (1966) and Only When I Laugh (1979). He is married to Susan Bowles. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI1Mzk4NDk2Ml5BMl5BanBnXkFtZTcwNjMzNjk5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0101248","name":"Peter Bowles","idIMDB":"nm0101248"},"actorId":"nm0101248","character":"Ron","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Veruschka von Lehndorff","urlProfile":"http://www.imdb.com/name/nm0902610","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MzUwMjI4M15BMl5BanBnXkFtZTYwOTA2OTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 May 1939","placeOfBirth":" Königsberg, East Prussia, Germany","birthName":"Countess Vera Gottliebe Anna von Lehndorff","height":"6' (1.83 m)","bio":"Her father was a Prussian count (Count von Lehndorff-Steinort) who was involved in a plot to assassinate Hitler in 1944 and hanged that year, when Vera was three. Her mother was arrested, and Vera and her sisters spent the rest of the war in Gestapo camps. They were reunited with their mother after the war, but the family was destitute, and ostracised by other Germans for their father's treachery. She ended up studying textile design in Florence, where a fashion designer first asked her to model. She had first travelled to New York in 1961 as plain old Vera, but failed to secure a single booking. After retreating to Milan for a spell, she returned to take Manhattan under her new name.... Veruschka!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MzUwMjI4M15BMl5BanBnXkFtZTYwOTA2OTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0902610","name":"Veruschka von Lehndorff","idIMDB":"nm0902610"},"actorId":"nm0902610","character":"Verushka","urlCharacter":"http://www.imdb.com/character/ch0013601","main":true},{"actorName":"Julian Chagrin","urlProfile":"http://www.imdb.com/name/nm0149615","urlPhoto":"","biography":{"dateOfBirth":"22 February 1940","placeOfBirth":" London, England, UK","height":"6' 2\" (1.88 m)","bio":"Since 1976, Julian Chagrin has been living in Israel. Best known for his two Oscar Nominations for short live action, The Concert ('74) and The Morning Spider (1976) ('75) Chagrin also played the mime tennis player in Blow-Up, '66. Well-known in Israel as a comic performer, Julian has been producing both local and international television comedy programs ranging from The Orchestra, a 10-part half-hour comedy series, which won the Gold Rose of Montreux '86. He can be reached c/o robert@netvision.net.il","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0149615","name":"Julian Chagrin","nicknames":["None"],"idIMDB":"nm0149615"},"actorId":"nm0149615","character":"Mime","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Claude Chagrin","urlProfile":"http://www.imdb.com/name/nm0149613","urlPhoto":"","biography":{"bio":"Claude Chagrin is a director and producer, known for The Concert (1974), The Morning Spider (1976) and Blow-Up (1966).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0149613","name":"Claude Chagrin","idIMDB":"nm0149613"},"actorId":"nm0149613","character":"Mime","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0060176","urlIMDB":"http://www.imdb.com/title/tt0060176","business":{"budget":{"money":"$1,800,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1967/\">1967</a>"},{"money":"390,944","country":"Spain","day":"31","month":"12","year":"1975","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1966/\">1966</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 51 min (111 min)"],"soundMix":["Mono"],"color":["Color (Metrocolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Metrocolor, London, UK"],"filmLength":["3,045 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.7","filmingLocations":[{"location":"77 Pottery Lane, Notting Hill, London, England, UK"}],"rated":"NOT RATED","awards":[{"award":"Academy Awards, USA 1967","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Director","names":[{"name":"Michelangelo Antonioni","id":"nm0000774","role":null}]},{"category":"Best Writing, Story and Screenplay - Written Directly for the Screen","names":[{"name":"Michelangelo Antonioni","id":"nm0000774","role":"screenplay/story"},{"name":"Tonino Guerra","id":"nm0346096","role":"screenplay"},{"name":"Edward Bond","id":"nm0093927","role":"screenplay"}]}]}]},{"award":"Golden Globes, USA 1967","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best English-Language Foreign Film","names":[]}]}]},{"award":"BAFTA Awards 1968","titlesAwards":[{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best British Art Direction (Colour)","names":[{"name":"Assheton Gorton","id":"nm0331378","role":null}]},{"category":"Best British Cinematography (Colour)","names":[{"name":"Carlo Di Palma","id":"nm0005688","role":null}]},{"category":"Best British Film","names":[{"name":"Michelangelo Antonioni","id":"nm0000774","role":null}]}]}]},{"award":"Cannes Film Festival 1967","titlesAwards":[{"titleAwardOutcome":"Won Palme d'Or","categories":[{"category":"","names":[{"name":"Michelangelo Antonioni","id":"nm0000774","role":null}]}]}]},{"award":"French Syndicate of Cinema Critics 1968","titlesAwards":[{"titleAwardOutcome":"Won Critics Award","categories":[{"category":"Best Foreign Film","names":[{"name":"Michelangelo Antonioni","id":"nm0000774","role":null}]}]}]},{"award":"Italian National Syndicate of Film Journalists 1968","titlesAwards":[{"titleAwardOutcome":"Won Silver Ribbon","categories":[{"category":"Best Foreign Director (Regista del Miglior Film Straniero)","names":[{"name":"Michelangelo Antonioni","id":"nm0000774","role":null}]}]}]},{"award":"Kansas City Film Critics Circle Awards 1967","titlesAwards":[{"titleAwardOutcome":"Won KCFCC Award","categories":[{"category":"Best Director","names":[{"name":"Michelangelo Antonioni","id":"nm0000774","role":null}]}]}]},{"award":"Laurel Awards 1967","titlesAwards":[{"titleAwardOutcome":"Won Golden Laurel","categories":[{"category":"Sleeper of the Year","names":[]}]}]},{"award":"National Society of Film Critics Awards, USA 1967","titlesAwards":[{"titleAwardOutcome":"Won NSFC Award","categories":[{"category":"Best Film","names":[]},{"category":"Best Director","names":[{"name":"Michelangelo Antonioni","id":"nm0000774","role":null}]}]}]},{"award":"New York Film Critics Circle Awards 1966","titlesAwards":[{"titleAwardOutcome":"3rd place NYFCC Award","categories":[{"category":"Best Film","names":[]},{"category":"Best Director","names":[{"name":"Michelangelo Antonioni","id":"nm0000774","role":null}]}]}]}],"votes":"43,651","type":"Movie","companyCreditsSimple":[{"idCompany":"co0013928","name":"Bridge Films"},{"idCompany":"co0233810","name":"Carlo Ponti Production"},{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"}],"keywords":{"keywords":["park","photographer","photograph","fashion","blow up","sex","model","fashion photographer","marijuana","nudity","film camera","hiding behind a tree","jumping over a fence","following someone","spying on couple having sex","coitus","female removes her clothes","photo enlargement","murder witness","tennis court","pay phone","undressing","painting","kiss","female nudity","party","corpse","photography","female frontal nudity","independent film","mod","murder","flophouse","dead body","darkroom","sexy woman","female full frontal nudity","corruption","cover up","conspiracy","surveillance","psychological thriller","breasts","art movie","cult film","scantily clad female","coffee","gun","older man younger woman relationship","promise","honking a car horn","venetian blinds","airplane propeller","antique shop owner","biting someone's hand","tennis ball","being followed","bare chested male","reference to morocco","red dress","blonde","bikini","copulation","sex in bed","pantyhose pulled down","mini skirt","mini dress","female rear nudity","cleavage","pantyhose","female pubic hair","tights","smashing a guitar","poodle","paranoia","nightclub","free love","fight","female wrestling","feathers","fashion model","dress","dog","clothes rack","anarchy","wine","wind","whiteface","voyeur","voyeurism","venetian blind","tree","threesome","telephone","telephone call","search","searching","rock 'n' roll","pubic hair","proof sheet","photo studio","mime troupe","magnifying glass","jazz music","invisible tennis ball","husband wife relationship","film developing","eye witness","enigma","drug use","drink","drinking","death","dancing","camera","cafe","band","nikon camera","swinging london","foreign language adaptation","controversy","rock band","rock club","restaurant","protest march","photo shoot","phone booth","painter","menage a trois","london england","guitar","gay slur","drugs","convertible","burglary","based on short story","antique shop","witness","tennis","mime","surprise ending","surrealism","book","homeless shelter","one day","british giallo","philosophical conversation","ambiguous ending","jazz score","guitar smashing","punctuation in title","hyphen in title","two word title","self referential","reference to bertolt brecht","counter culture","hasselblad camera","medium format camera","famous score","sleeping","electric guitar","telephone number","subjective camera","jumping into the air and clicking one's heels","running after a car","listening to music","whistling","photographer's assistant","nun","chewing gum","reference to nepal","pot smoking","female stockinged feet","camera shot of feet","trailblazer","walkie talkie","vandalism","underground","truck","subway","street theater","rolling a joint","reveller","recording","record player","photography book","peace march","paris france","merry makers","march","loudspeaker","junk shop","intrigue","homosexual","guitarist","gay","french poodle","freedom","disorientation","demonstration","biting hand","ban the bomb","dancer","coin trick","cigarette smoking","children"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:10:45"}}