{"data":{"movies":[{"title":"Trancers","originalTitle":"","year":"1984","releaseDate":"19850522","directors":[{"name":"Charles Band","id":"nm0023929"}],"writers":[{"name":"Danny Bilson","id":"nm0082677"},{"name":"Paul De Meo","id":"nm0210290"}],"runtime":"76 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzUwNTI3NTIyNl5BMl5BanBnXkFtZTcwODE0NTYzNQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Sci-Fi"],"plot":"Jack Deth is a kind of cop/bounty hunter in the bleak Los Angeles of the future. He's become obssessed with chasing Whistler - an evil criminal who uses powerful hypnotic powers to convert people into zombie like creatures known as trancers. Whistler has managed to escape through time travel and is loose in 1980s L.A. but Deth is on his trail.","simplePlot":"Jack Deth is a kind of cop/bounty hunter in the bleak Los Angeles of the future. He's become obssessed with chasing Whistler - an evil criminal who uses powerful hypnotic powers to convert ... ","actors":[{"actorName":"Tim Thomerson","urlProfile":"http://www.imdb.com/name/nm0859772","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NzEyNzI4MV5BMl5BanBnXkFtZTYwNTY1MDAz._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1946","placeOfBirth":" Coronado, California, USA","birthName":"Joseph Timothy Thomerson","height":"5' 11\" (1.8 m)","bio":"Tim Thomerson rates highly as one of the best, most prolific, versatile and dependable character actors to ever grace both the big and small screens alike with pleasing regularity since the mid 70s. Although often cast as laconic rough 'n' tumble macho guys, Thomerson has proved on many occasions that he can essay comic roles and more substantial dramatic parts with equal skill and conviction. He was born on April 8th, 1946 in Coronado, California and was raised in Hawaii and San Diego. He did a stint in the National Guard prior to getting a job as a prop man and set builder at the Old Globe Theatre in San Diego. Character actor Anthony Zerbe advised Thomerson to get lessons from legendary acting teacher Stella Adler in New York; and he duly studied with Adler for four years. He began his show business career as a stand-up comedian; he performed at the clubs The Bitter End, Bud Friedman's Improvisation and Catch A Rising Star in New York and at the Comedy Store and the Improv in Los Angeles. He eventually even had a guest spot on \"The Tonight Show\" with Johnny Carson. His film debut was with a funny small role in the hilarious \"Car Wash.\" He achieved his greatest enduring cult popularity with his delightfully deadpan portrayal of rugged police detective Jack Deth in the terrific \"Trancers\" and its strictly so-so sequels. Other memorable parts include eccentric police detective Jerry Moriarty in the fine \"Fade to Black,\" weary factory worker Ray in \"Take This Job and Shove It,\" a highway patrolman in Clint Eastwood's poignant and underrated \"Honkytonk Man,\" burnt-out Vietnam vet helicopter pilot Charts in the exciting \"Uncommon Valor,\" grimy mercenary Rhodes in the cheesy \"Metalstorm: The Destruction of Jared-Syn,\" the crazed John Reynolds in \"Volunteers,\" demented cult leader Lester in \"Cherry 2000,\" the tough-as-nails the Sarge in the enjoyably quirky \"Zone Troopers;\" lovely and touching as the gentle Loy in the outstanding \"Near Dark,\" diminutive, but fearless alien lawman Brick Bardo in the funky \"Dollman,\" and a scruffy motorcyclist in Terry Gilliam's unjustly maligned \"Fear and Loathing in Las Vegas.\" Tim has appeared in a large number of films for low-budget independent director Albert Pyon and acted alongside real-life best buddy Brion James in numerous pictures (the two first met while both serving in the National Guard Reserves). On television Thomerson played the half-man, half-woman Gene-Jean on the uproarious, but sadly short-lived sci-fi parody program \"Quark.\" Thomerson also had recurring roles on the TV shows \"Sirens\" and \"Land's End\" and has made guest appearances on countless TV shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5NzEyNzI4MV5BMl5BanBnXkFtZTYwNTY1MDAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0859772","name":"Tim Thomerson","idIMDB":"nm0859772"},"actorId":"nm0859772","character":"Jack Deth","urlCharacter":"http://www.imdb.com/character/ch0028066","main":true},{"actorName":"Helen Hunt","urlProfile":"http://www.imdb.com/name/nm0000166","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1OTk1ODIwMV5BMl5BanBnXkFtZTcwMTA0MTIwOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 June 1963","placeOfBirth":" Culver City, California, USA","birthName":"Helen Elizabeth Hunt","height":"5' 7\" (1.7 m)","bio":"Helen Hunt began studying acting at the age of eight with her father, respected director and acting coach Gordon Hunt. A year later she made her professional debut and afterwards worked steadily in films, theatre and television.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1OTk1ODIwMV5BMl5BanBnXkFtZTcwMTA0MTIwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000166","name":"Helen Hunt","idIMDB":"nm0000166"},"actorId":"nm0000166","character":"Leena","urlCharacter":"http://www.imdb.com/character/ch0038507","main":true},{"actorName":"Michael Stefani","urlProfile":"http://www.imdb.com/name/nm0824966","urlPhoto":"","biography":{"dateOfBirth":"26 July 1933","placeOfBirth":" San Francisco, California, USA","bio":"Michael Stefani was born on July 26, 1933 in San Francisco, California, USA. He is an actor, known for Trancers (1984), Bonanza (1959) and The Young Marrieds (1964).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0824966","name":"Michael Stefani","idIMDB":"nm0824966"},"actorId":"nm0824966","character":"Whistler / Detective Weisling","urlCharacter":"http://www.imdb.com/character/ch0459673","main":true},{"actorName":"Art LaFleur","urlProfile":"http://www.imdb.com/name/nm0480869","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODY1Mjk4ODc4NF5BMl5BanBnXkFtZTYwMDY2MDAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1943","placeOfBirth":" Gary, Indiana, USA","height":"5' 11¾\" (1.82 m)","bio":"Art LaFleur was born on September 9, 1943 in Gary, Indiana, USA. He is an actor and writer, known for The Sandlot (1993), Field of Dreams (1989) and Cobra (1986).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODY1Mjk4ODc4NF5BMl5BanBnXkFtZTYwMDY2MDAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0480869","name":"Art LaFleur","idIMDB":"nm0480869"},"actorId":"nm0480869","character":"McNulty","urlCharacter":"http://www.imdb.com/character/ch0129258","main":true},{"actorName":"Telma Hopkins","urlProfile":"http://www.imdb.com/name/nm0394286","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNzAzNzQ3NV5BMl5BanBnXkFtZTYwNTYyODYz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1948","placeOfBirth":" Louisville, Kentucky, USA","birthName":"Telma Louise Hopkins","height":"5' 6\" (1.68 m)","bio":"Telma Hopkins was born on October 28, 1948 in Louisville, Kentucky, USA as Telma Louise Hopkins. She is an actress, known for Half & Half (2002), Family Matters (1989) and Bosom Buddies (1980). She was previously married to Donald B. Alen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNzAzNzQ3NV5BMl5BanBnXkFtZTYwNTYyODYz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0394286","name":"Telma Hopkins","idIMDB":"nm0394286"},"actorId":"nm0394286","character":"Engineer Raines","urlCharacter":"http://www.imdb.com/character/ch0129269","main":true},{"actorName":"Richard Herd","urlProfile":"http://www.imdb.com/name/nm0378800","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyOTgxNTUyMF5BMl5BanBnXkFtZTcwMDgzNzQ0MQ@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 September 1932","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Richard Thomas Herd Jr.","height":"5' 11\" (1.8 m)","bio":"Utilitarian character actor Richard Herd is one of those stern familiar faces you've seen countless times on film and TV but can't quite place the name. The stage-trained actor who shares a striking resemblance to actor Karl Malden never found the one role that would make him a household name, but he has made up for it with a number of rich and rewarding stage, film and TV assignments bolstered by his trademark authoritarian look and stance. Born on September 26, 1932, is the son of another Richard, a railroad engineer and WWII vet who died when the boy was quite young. The younger Herd suffered from bone marrow cancer which affected the growth of his legs as a child. As a result, he was educated at the Industrial School for Crippled Children during his formative years. Luckily, loving care and several operations saved his legs from deformity. It was his mother Katherine's love of music that ignited Richard's initial desire to perform. Trained on the drums, he received early acting training on radio and in summer stock (Liberty Mutual Theatre in Boston) during his high school years and in the late 1940s studied Shakespeare under veteran Claude Rains at one point. Other plays such as \"Our Town\" and \"Sing Out Sweet Land,\" and the children's theatre productions of \"Penrod\" and \"Robin Hood\" helped to beef up his early resume. Richard enlisted in the Army during the Korean War but injured a knee in basic training which led to an honorable discharge within 90 days of his enlistment. He did, however, go on to work for the Army Signal Corps in a host of training films. Richard continued to gather experience in such classical plays as \"The Miser\" and \"A Month in the Country\". With several summer stock runs, Shakespearean bus-and-truck tours and industrial films under his belt, he finally made his New York debut in the minor role of an usher in The Dress Circle\" at Carnegie Hall. He also became a member of the Player's Club. Making a highly inauspicious film debut in the minor role of a coach in the film Hercules in New York (1970), which was the showcase debut for the massively-muscled Arnold Schwarzenegger, Richard didn't settle in Hollywood until the mid 1970s after replacing actor Richard Long (who died before filming began) in the role of Watergate figure James McCord in All the President's Men (1976). Although Richard made a handful of other movies throughout the rest of the decade (I Never Promised You a Rose Garden (1977), F.I.S.T. (1978), The China Syndrome (1979), The Onion Field (1979)), he appeared with much more frequency on TV, playing stern, authoritarian types on episodes of \"Kojak,\" \"The Rockford Files,\" \"The Streets of San Francisco,\" (starring the similar-looking Karl Malden), \"Rafferty,\" \"Eight Is Enough\" and \"Starsky & Hutch,\" as well as in the TV movies Pueblo (1973), Captains and the Kings (1976), The Hunted Lady (1977), Dr. Scorpion (1978), Kate Bliss and the Ticker Tape Kid (1978), Terror Out of the Sky (1978) (TV)_, Marciano (1979) (TV)_ and, most notably, Ike: The War Years (1980) in which he portrayed General Omar Bradley. Never finding the one support role that might have made him a character star, Richard has nevertheless been featured impressively on all three mediums for the past four decades. On stage he appeared in a pre-Broadway tryout of \"On the Waterfront\" and played to great applause in productions of \"Other People's Money\" and \"The Big Knife\". His finest hour on stage, however, would come with his portrayal of the epic film producer in the one-man show \"Cecil B. DeMille Presents,\" which he has toured throughout the country. On TV, Richard has guested on most of the popular TV programs of late, including \"Desperate Housewives\" and CSI: Miami\" and is probably best remembered for his recurring roles as Admiral Noyce on SeaQuest 2032 (1993), as Jason Alexander's boss Wilhelm in the sitcom classic Seinfeld (1989) and as Admiral Owen Paris in Star Trek: Voyager (1995). A few of his lightweight cinematic crowd-pleasers include Private Benjamin (1980), Deal of the Century (1983), Planes, Trains & Automobiles (1987) and Sgt. Bilko (1996). On occasion Richard has moved into the director/producer/writer's chair. He directed the play \"Idle Wheels\" for the Road Theatre Company in North Hollywood, was a producer of the N.Y. play \"Agamemnon\" and co-producer (and performer) of the play \"The Couch with the Six Insides,\" and, as a playwright, had a presentation of his play \"Prisoner of the Crown\" produced at Dublin's Abbey Theatre. Married briefly at the age of 19, Richard remarried and had two children (Richard Jr. and Erica) by his second wife. That marriage also ended in divorce, but his third (in 1980), to actress Patricia Herd (Patricia Crowder Ruskin) has lasted. Patricia has a daughter from an earlier marriage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyOTgxNTUyMF5BMl5BanBnXkFtZTcwMDgzNzQ0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0378800","name":"Richard Herd","idIMDB":"nm0378800"},"actorId":"nm0378800","character":"Chairman Spencer","urlCharacter":"http://www.imdb.com/character/ch0459675","main":true},{"actorName":"Anne Seymour","urlProfile":"http://www.imdb.com/name/nm0786800","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNTM3NTk0OF5BMl5BanBnXkFtZTcwODg1MzkxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1909","placeOfBirth":" New York City, New York, USA","birthName":"Anne Seymour Eckert","height":"5' 5\" (1.65 m)","bio":"The daughter of a copper expert (William Stanley Eckert) and an actress and museum curator (May Davenport), character actress Anne Seymour was born on September 11, 1909 in New York City. She was the seventh generation of a theatrical family that could be tracked back to Ireland in 1740. Her great-uncle was the popular character actor Harry Davenport and her two older brothers were writer James Seymour (42nd Street (1933)) and actor John Seymour (The Sporting Club (1971)). Anne trained for the stage at the American Laboratory Theatre School with Richard Boleslawski and Maria Ouspenskaya, and began her career performing with The Jitney Players. She, as did her brothers, eventually changed her stage moniker from Eckert to her mother's maiden name of Seymour. After touring throughout New England, Anne made her New York debut in Mr. Moneypenny in 1928. Other Broadway shows followed including At the Bottom (1930) and A School for Scandal (1931). The following year, she entered the world of radio drama. Her distinctively warm style and vocal timbre were perfect for playing some of radio's noblest, self-sacrificing heroines. She portrayed \"Mary Marlin\" for 11 popular seasons; it turned out to be her most identifiable role. In the late 1940s Anne switched to film and made an auspicious debut as Lucy Stark in the Oscar-winning picture All the King's Men (1949). Although movie appearances would remain sporadic and relatively minor, Anne was a solid, capable player during the golden age of television and could be seen dressing up many glossy dramas, including Studio One in Hollywood (1948) and Robert Montgomery Presents (1950). Her rather hawkish, matronly features, which seemed in stark contrast to her smooth, modulated tones, nevertheless had her primarily playing benevolent roles as concerned relatives and professionals somewhat in the background. In 1958, Anne earned strong marks for her portrayal of Sara Delano Roosevelt alongside Tony-winning Ralph Bellamy's FDR in \"Sunrise at Campobello\" on Broadway. She lost the 1960 movie role to Ann Shoemaker. Anne was actively involved on the SAG and AFTRA boards throughout a good portion of her career. Unmarried, she died in 1988 of natural causes after completing a small part in the popular film Field of Dreams (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNTM3NTk0OF5BMl5BanBnXkFtZTcwODg1MzkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0786800","name":"Anne Seymour","idIMDB":"nm0786800"},"actorId":"nm0786800","character":"Chairman Ashe","urlCharacter":"http://www.imdb.com/character/ch0459676","main":true},{"actorName":"Miguel Fernandes","urlProfile":"http://www.imdb.com/name/nm0272883","urlPhoto":"","biography":{"bio":"Miguel Fernandes is an actor, known for The New Adam-12 (1989), True Believer (1989) and Rabid (1977).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0272883","name":"Miguel Fernandes","idIMDB":"nm0272883"},"actorId":"nm0272883","character":"Officer Lopez","urlCharacter":"http://www.imdb.com/character/ch0459677","main":true},{"actorName":"Biff Manard","urlProfile":"http://www.imdb.com/name/nm0541290","urlPhoto":"","biography":{"dateOfBirth":"1943","placeOfBirth":"","bio":"Biff Manard was born in 1943. He was an actor and writer, known for Trancers (1984), Eight Days a Week (1997) and Trancers II (1991). He died on May 19, 2014 in Las Vegas, Nevada, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0541290","name":"Biff Manard","idIMDB":"nm0541290"},"actorId":"nm0541290","character":"Hap Ashby","urlCharacter":"http://www.imdb.com/character/ch0245403","main":true},{"actorName":"Peter Schrum","urlProfile":"http://www.imdb.com/name/nm0775623","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjI2ZjhhNGQtMTZkNi00NWVjLTliMDEtMThiNjQ5MzkwMWY3XkEyXkFqcGdeQXVyNTAyNDQ2NjI@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 December 1934","placeOfBirth":" Canton, Ohio, USA","birthName":"Paul Richard Schrum","bio":"Attending a catholic school, Peter \"Pete\" Schrum realized that he wanted to be an actor. Born in 1934, Peter started doing play acting and drama all over the place. He was enthused to work and loved doing stage. He and lifelong friends vowed to become actors one day. Peter was the only one to uphold the promise. Every so often, Peter would be out of work and laugh about some of his characters. Most memorable for playing the shotgun-firing bartender, Lloyd, in Terminator 2: Judgment Day (1991). Schrum took up the job of the Coca-Cola Santa Claus, then stopped working for years. Pete's last film, Hulk (2003) was released in mid 2003. You can spot him as Sgt. Crowe.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjI2ZjhhNGQtMTZkNi00NWVjLTliMDEtMThiNjQ5MzkwMWY3XkEyXkFqcGdeQXVyNTAyNDQ2NjI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0775623","name":"Peter Schrum","nicknames":["Pig-iron Pete"],"idIMDB":"nm0775623"},"actorId":"nm0775623","character":"Santa Claus","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barbara Perry","urlProfile":"http://www.imdb.com/name/nm0674977","urlPhoto":"","biography":{"dateOfBirth":"22 June 1923","placeOfBirth":" Norfolk, Virginia, USA","birthName":"Barbara Mae Perry","bio":"Barbara Perry was born on June 22, 1923 in Norfolk, Virginia, USA as Barbara Mae Perry. She is an actress, known for Father of the Bride (1991), The Back-up Plan (2010) and Shock Corridor (1963). She was previously married to Art Babbitt and Bennett Warren James.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0674977","name":"Barbara Perry","idIMDB":"nm0674977"},"actorId":"nm0674977","character":"Mrs. Santa Claus","urlCharacter":"http://www.imdb.com/character/ch0234931","main":true},{"actorName":"Brad Logan","urlProfile":"http://www.imdb.com/name/nm0517519","urlPhoto":"","biography":{"bio":"Brad Logan is an actor, known for Vamp (1986), Trancers (1984) and Two Moon Junction (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0517519","name":"Brad Logan","idIMDB":"nm0517519"},"actorId":"nm0517519","character":"Bull","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Minnie Summers Lindsey","urlProfile":"http://www.imdb.com/name/nm0512282","urlPhoto":"","biography":{"dateOfBirth":"7 October 1912","placeOfBirth":" Missouri, USA","bio":"Minnie Summers Lindsey was born on October 7, 1912 in Missouri, USA. She was an actress, known for Ghost (1990), Rising Sun (1993) and Trancers (1984). She died on December 31, 2001 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0512282","name":"Minnie Summers Lindsey","idIMDB":"nm0512282"},"actorId":"nm0512282","character":"'Mom'","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Erdman","urlProfile":"http://www.imdb.com/name/nm0258757","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNDYwMzQ1MF5BMl5BanBnXkFtZTcwMzg4OTAyOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1925","placeOfBirth":" Enid, Oklahoma, USA","birthName":"John Richard Erdmann","height":"6' (1.83 m)","bio":"Richard Erdman was born on June 1, 1925 in Enid, Oklahoma, USA as John Richard Erdmann. He is an actor and director, known for Stalag 17 (1953), Community (2009) and Tora! Tora! Tora! (1970). He was previously married to Sharon Randall and Leza Holland.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxNDYwMzQ1MF5BMl5BanBnXkFtZTcwMzg4OTAyOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0258757","name":"Richard Erdman","nicknames":["Dick"],"idIMDB":"nm0258757"},"actorId":"nm0258757","character":"Drunken Wise Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wiley Harker","urlProfile":"http://www.imdb.com/name/nm0363119","urlPhoto":"","biography":{"bio":"Wiley Harker is an actor, known for General Hospital (1963), The Straight Story (1999) and Things to Do in Denver When You're Dead (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0363119","name":"Wiley Harker","idIMDB":"nm0363119"},"actorId":"nm0363119","character":"Dapper Old Man","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0090192","urlIMDB":"http://www.imdb.com/title/tt0090192","business":{"budget":{"money":"$400,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"© 1984 Lexyn Productions Inc."},"technical":{"runtime":["1 hr 16 min (76 min)"],"soundMix":["Ultra Stereo"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["DeLuxe, Hollywood (CA), USA (color)","Technicolor (uncredited)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.1","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"PG-13","awards":[],"votes":"4,094","type":"Movie","companyCreditsSimple":[{"idCompany":"co0022018","name":"Empire Pictures"},{"idCompany":"co0041901","name":"Lexyn Productions"},{"idCompany":"co0079400","name":"Altar Productions"}],"keywords":{"keywords":["police detective","laser gun","diner","city","future","1980s","zombie","criminal","detective","time travel","police","punk","villain","killed with a gun","cyberpunk","time travel agency","good versus evil","urban setting","male protagonist","blonde","see you in hell","one word title","spit in the face","restaurant","manipulation","antidote","chase","rescue","machine gun","baseball card","santa claus costume","held at gunpoint","hostage","race against time","neo noir","drunkenness","freeze frame","christmas tree","cigarette smoking","murder","death","violence","on the run","police chase","car motorcycle chase","motorcycle","falling from height","mission","revolver","near future","dystopia","beach","flood","flying car","meat cleaver","electronic music score","threatened with a knife","gadget","fish out of water","punched in the face","news report","shopping mall","homeless man","decomposing body","gunfight","shootout","martial arts","brawl","switchblade","fistfight","photographer","photograph","mind control","bounty hunter","maverick cop","tough cop","shot in the arm","shot in the chest","shot in the back","impersonating a police officer","police officer killed","knife","bullet time","bullet wound","slow motion scene","warrior","tough guy","one man army","anti hero","action hero","cult film","lapd","slow motion","quantum leap","first part","watch","wristwatch","scooter","bum","skid row","nightclub","fight","chinatown los angeles","los angeles california","reference to whistler's mother","futuristic","independent film","title spoken by character","surprise ending","christmas"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:42:58"}}