{"data":{"movies":[{"title":"Inserts","originalTitle":"","year":"1975","releaseDate":"19760213","directors":[{"name":"John Byrum","id":"nm0126440"}],"writers":[{"name":"John Byrum","id":"nm0126440"}],"runtime":"117 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGY5Y2Q0NTEtZGJkNy00MWE0LTkxOTgtOWU5NWRlMmMzM2U3XkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Comedy","Drama"],"plot":"A once-great silent film director, unable to make the transition to the new talkies, lives as a near-hermit in his Hollywood home, making cheap, silent sex films, and suffering in the knowledge of his sexual impotence, and apathetic about the plans to demolish his home to make way for a motorway. His producer and his producer's girlfriend come by to see how he is doing (and to supply heroin to the actress as her payment). The girlfriend stays to watch them filming, and is deeply impressed by his methods. When the actress goes to the bathroom, and dies there of an overdose, the girlfriend takes her place in the film. Then the producer returns...","simplePlot":"A young, once-great Hollywood film director refuses to accept changing times during the early 1930s, and confines himself to his decaying mansion to make silent porn flicks.","actors":[{"actorName":"Richard Dreyfuss","urlProfile":"http://www.imdb.com/name/nm0000377","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMjIzMjM2NV5BMl5BanBnXkFtZTcwNDAxMDY0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1947","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Richard Stephen Dreyfus","height":"5' 5\" (1.65 m)","bio":"Richard Dreyfuss is an American leading man, who has played his fair share of irritating pests and brash, ambitious hustlers. He was born Richard Stephen Dreyfus in Brooklyn, New York, to Geraldine (Robbins), an activist, and Norman Dreyfus, a restaurateur and attorney. His paternal grandparents were Austro-Hungarian Jewish immigrants, and his mother's family was Russian Jewish. Richard Dreyfuss worked his way up through bit parts (The Graduate (1967), for one) and TV before gaining attention with his portrayal of Baby Face Nelson in John Milius' Dillinger (1973). He gained prominence as a college-bound young man in American Graffiti (1973) and as a nervy Jewish kid with high hopes in L'apprentissage de Duddy Kravitz (1974). By the latter part of the 1970s Dreyfuss was established as a major star, playing leads (and alter-egos) for Steven Spielberg in two of the top-grossing films of the that decade: Jaws (1975) and Close Encounters of the Third Kind (1977). He won a Best Actor Oscar in his first romantic lead as an out-of-work actor in The Goodbye Girl (1977). Dreyfuss also produced and starred in the entertaining private eye movie The Big Fix (1978). After a brief lull in the early 1980s, a well-publicized drug problem and a string of box-office disappointments (The Competition (1980), Whose Life Is It Anyway? (1981), The Buddy System (1984)), a clean and sober Dreyfuss re-established himself in the mid-'80s as one of Hollywood's more engaging leads. He co-starred with Bette Midler and Nick Nolte in Paul Mazursky's popular Down and Out in Beverly Hills (1986). That same year he provided the narration and appeared in the opening and closing \"bookends\" of Rob Reiner's nostalgic Stand by Me (1986). He quickly followed that with Nuts (1987) opposite Barbra Streisand, Barry Levinson's Tin Men (1987) in a memorable teaming with Danny DeVito and Stakeout (1987) with Emilio Estevez. Dreyfuss continued working steadily through the end of the 1980s and into the 1990s, most notably in Mazursky's farce Moon Over Parador (1988), Spielberg's Always (1989), Postcards from the Edge (1990) and Rosencrantz & Guildenstern Are Dead (1990). He appeared as a member of an ensemble that included Holly Hunter, Gena Rowlands and Danny Aiello in the romantic comedy Once Around (1991) and as a pop psychiatrist, the author of several successful self-help books, who is driven to the edge by nutcase Bill Murray in the popular comedy What About Bob? (1991). Dreyfuss has also remained active in the theater (\"Death and Maiden\", 1992) and on TV. He returned to features in the adaptation of Neil Simon's play Lost in Yonkers (1993) and followed with a supporting turn as the querulous political opponent in The American President (1995). Dreyfuss received some of the best notices of his career as a determined, inspiring music teacher coping with a deaf son and the demands of his career in Mr. Holland's Opus (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMjIzMjM2NV5BMl5BanBnXkFtZTcwNDAxMDY0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000377","name":"Richard Dreyfuss","idIMDB":"nm0000377"},"actorId":"nm0000377","character":"Boy Wonder","urlCharacter":"http://www.imdb.com/character/ch0050543","main":true},{"actorName":"Jessica Harper","urlProfile":"http://www.imdb.com/name/nm0363888","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk1MDI2NzkxN15BMl5BanBnXkFtZTcwNTk1MzMyMw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1949","placeOfBirth":" Chicago, Illinois, USA","height":"5' 4\" (1.63 m)","bio":"American actress-author-composer Jessica Harper was born on October 10, 1949 in Chicago, Illinois, to Eleanor (Emery), a writer, and Paul Church Harper, Jr., a painter who was chairman of the Needham Harper Worldwide advertising agency in NY. Jessica launched her professional acting career soon after graduating from Sarah Lawrence. Drawing on her considerable singing skills, she was an understudy in the Broadway production of the \"tribal love\" rock musical Hair (1979) -- other understudies included Diane Keaton, Melba Moore, Keith Carradine, Meat Loaf and Cliff De Young, who would later co-star with Harper in Shock Treatment (1981),which also showcased her musical gifts. In the 1970s and 1980s, she developed quite a reputation for herself as a cult actress: her wide-eyed, fresh-faced beauty and air of melancholy made her a unique presence on film. As \"Cathy Cake\" in the X-rated Inserts (1975), she was arguably the first \"serious\" American actress to have a truly explicit on-screen sex scene. Other memorable films she appeared in were Brian De Palma's Phantom of the Paradise (1974), Dario Argento's seminal slasher film Suspiria (1977), and two for Woody Allen: Love and Death (1975) and Stardust Memories (1980). Since her appearance in the American remake of Dennis Potter's Pennies from Heaven (1981) and My Favorite Year (1982), her film career has cooled somewhat (likely as directors didn't know how to use this seemingly fragile, ethereal and always unique talent), though she continues to work steadily in film and on television. Since the 1990s, Harper -- the wife of motion picture executive Tom Rothman -- has developed a second successful career as an author of children's books and as a composer of music for children. She has written four picture books in collaboration with her sister, Lindsay Harper DuPont, including her most recent, \"A Place Called Kindergarten\". Her debut music CD, \"A Wonderful Life\" (1994), which won both a Parent's Choice Gold Award and a National Association of Parenting Publications Award, was particularly praised for the lyrics written by Harper. Her other five children's music CDs include \"Inside Out\" and \"Hey, Picasso\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzk1MDI2NzkxN15BMl5BanBnXkFtZTcwNTk1MzMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0363888","name":"Jessica Harper","idIMDB":"nm0363888"},"actorId":"nm0363888","character":"Cathy Cake","urlCharacter":"http://www.imdb.com/character/ch0050544","main":true},{"actorName":"Bob Hoskins","urlProfile":"http://www.imdb.com/name/nm0001364","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MTE0ODQyM15BMl5BanBnXkFtZTYwMTIyNTk1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1942","placeOfBirth":" Bury St. Edmunds, Suffolk, England, UK","birthName":"Robert William Hoskins","height":"5' 6\" (1.68 m)","bio":"Bob Hoskins was born on October 26, 1942, in Bury St. Edmund's, Suffolk, where his mother was living after being evacuated as a result of the heavy bombings. He is the son of Elsie Lillian (Hopkins), a nursery school teacher and cook, and Robert William Hoskins, Sr., who drove a lorry and worked as a bookkeeper. Growing up, Hoskins received only limited education and he left school at 15, but with a passion for language and literature instilled by his former English teacher. A regular theatre-goer, Hoskins dreamed of starring on stage, but before he could do so he had to work odd jobs for a long time to make ends meet. His acting career started out more by accident than by design, when he accompanied a friend to watch some auditions, only to be confused for one of the people auditioning, getting a script pushed into his hands with the message \"You're next\". He got the part and acquired an agent. After some stage success, he expanded to television with roles in television series such as Villains (1972) and Thick as Thieves (1974). In the mid-'70s, he started his film career, standing out when he performed alongside Richard Dreyfuss in John Byrum's Inserts (1975) and in a smaller part in Richard Lester's Royal Flash (1975). Hoskins broke through in 1978 in Dennis Potter's mini TV series, Pennies from Heaven (1978), playing \"Arthur Parker\", the doomed salesman. After this, a string of high-profile and successful films followed, starting with his true major movie debut in 1980's The Long Good Friday (1980) as the ultimately doomed \"Harold Shand\". This was followed by such works as The Cotton Club (1984), Mona Lisa (1986), which won him an Oscar nomination as well as a BAFTA award, Cannes Film Festival and Golden Globe), Who Framed Roger Rabbit (1988) (Golden Globe nomination), Mermaids (1990), Hook (1991), Nixon (1995), Le voyage de Felicia (1999) and Enemy at the Gates (2001). Hoskins always carefully balanced the riches of Hollywood with the labor of independent film, though leaned more towards the latter than the former. He worked at smaller projects such as Shane Meadows' debut 24 7: Twenty Four Seven (1997), in which he starred as \"Allen Darcy\". Besides this, he found time to direct, write and star in The Raggedy Rawney (1988), as well as direct and star in Rainbow (1995), and contributing to HBO's Tales from the Crypt (1989) and Tube Tales (1999). Suffering from Parkinson's disease in later years, Hoskins died of pneumonia at age 71 in a London hospital.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MTE0ODQyM15BMl5BanBnXkFtZTYwMTIyNTk1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001364","name":"Bob Hoskins","nicknames":["The Cockney Cagney"],"idIMDB":"nm0001364"},"actorId":"nm0001364","character":"Big Mac","urlCharacter":"http://www.imdb.com/character/ch0050545","main":true},{"actorName":"Veronica Cartwright","urlProfile":"http://www.imdb.com/name/nm0001021","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg2NDE0MDkyOV5BMl5BanBnXkFtZTgwMDI1MzUyMDI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1949","placeOfBirth":" Bristol, England, UK","birthName":"Veronica A. Cartwright","height":"5' 6\" (1.68 m)","bio":"Born in Bristol, England, Veronica is the older sister of the popular child actress Angela Cartwright. In her early career, Veronica was cast in a number of popular movies such as The Children's Hour (1961), Spencer's Mountain (1963) and Alfred Hitchcock's The Birds (1963). As such, she was cast as \"Jemima Boone\" in the popular television series Daniel Boone (1964), which ran from 1964 to 66. Her career after \"Daniel Boone\" may have been influenced by Hitchcock, since she appeared in both the remake of Invasion of the Body Snatchers (1978) and the horror classic Alien (1979). On television, she appeared twice as Lumpy's younger sister, \"Violet Rutherford\" and once as \"Peggy MacIntosh\" on Leave It to Beaver (1957) and had a small role in the television movie Still the Beaver (1983). Cartwright also appeared in Robert Kennedy and His Times (1985), Tanner '88 (1988) and had a recurring role on L.A. Law (1986). Her big screen features included The Right Stuff (1983), Flight of the Navigator (1986) and The Witches of Eastwick (1987). Veronica worked on the stage in \"Electra\", \"Talley's Folly\", \"Homesteaders\", \"Butterflies are Free\" and \"The Triplet Connection\". Alternating between television and big screen movies in the 90s, Cartwright has appeared in such films as Hitler's Daughter (1990) and Candyman: Farewell to the Flesh (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg2NDE0MDkyOV5BMl5BanBnXkFtZTgwMDI1MzUyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001021","name":"Veronica Cartwright","idIMDB":"nm0001021"},"actorId":"nm0001021","character":"Harlene","urlCharacter":"http://www.imdb.com/character/ch0050546","main":true},{"actorName":"Stephen Davies","urlProfile":"http://www.imdb.com/name/nm0203987","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNjU2Nzk1MF5BMl5BanBnXkFtZTgwNDYxNTkzNzE@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"bio":"Stephen Davies is an actor, known for The Long Good Friday (1980), The Razor's Edge (1984) and Dillinger and Capone (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzNjU2Nzk1MF5BMl5BanBnXkFtZTgwNDYxNTkzNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0203987","name":"Stephen Davies","idIMDB":"nm0203987"},"actorId":"nm0203987","character":"Rex, the Wonder Dog","urlCharacter":"http://www.imdb.com/character/ch0050547","main":true}],"seasons":[],"idIMDB":"tt0073172","urlIMDB":"http://www.imdb.com/title/tt0073172","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"02","month":"06","year":"1975","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 57 min (117 min)","1 hr 39 min (99 min) (cut) (USA)"],"soundMix":["Mono"],"color":["Black and White","Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Rank Film Laboratories, Denham, UK (processing)"],"filmLength":["3,190 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.3","filmingLocations":[{"location":"Lee International Studios, Shepperton, Surrey, England, UK"}],"rated":"NC-17","awards":[],"votes":"1,125","type":"Movie","companyCreditsSimple":[{"idCompany":"co0022137","name":"Film and General Productions"}],"keywords":{"keywords":["hollywood","actress","changing times","mansion","1930s","impotence","sex","single set production","male rear nudity","male nudity","male frontal nudity","gold digger","girl wearing panties","body double","love interest","exhibitionist","insert shot","burying a dead body","reference to clark gable","heroin overdose","death by overdose","cigar","caught cheating","attempted rape","hit on the head with a bottle","wine bottle","shot in real time","ambitious director","appointment","mortician","grass stain","white suit","movie actor","business deal","progress","holding onto the past","high pitched voice","movie actress turned porn star","porn actress","silent film star","waitress","ironic ending","agoraphobia","alcoholic","movie director","handheld camera","perfectionist","refusal to compromise","porn director","talkie","fallen on hard times","audience","stag film","sex in bed","breast suckling","breasts","cleavage","filmmaker","adult filmmaking","porn industry","promiscuous woman","white panties","panties","nipples visible through clothing","lingerie","lust","female rear nudity","female removes her clothes","female pubic hair","pubic hair","female nudity","female frontal nudity","leg spreading","minimal cast","one word title","female full frontal nudity","film camera","bathrobe","alcoholism","actor","alcohol","voyeur","film within a film","film industry","silent filmmaking","pornographer","exhibitionism","drug overdose","filmmaking","violence","necrophilia","erection","erotica","heroin addict","hollywood california","real time","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:44:36"}}