{"data":{"movies":[{"title":"Bagdad Cafe","originalTitle":"Out of Rosenheim","year":"1987","releaseDate":"19880422","directors":[{"name":"Percy Adlon","id":"nm0000727"}],"writers":[{"name":"Eleonore Adlon","id":"nm0012280"},{"name":"Percy Adlon","id":"nm0000727"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5Mjk4MDkzMF5BMl5BanBnXkFtZTcwNTkxNDcyNA@@._V1.jpg","countries":["West Germany"],"languages":["English","German"],"genres":["Comedy","Drama"],"plot":"Out of Rosenheim (Bagdad Café) is a look into the minds and lives of some people most of us have met but few of us know much about. This movie exemplifies how one person in the right place can affect a community of lives. The Adlons seem to express the view that all change and \"magic\" comes from hard work and mutual acceptance. A well-crafted view of the lives of tourists everywhere and the difficulties they can face. A Whimsical and lovingly Photographed look at the vast wasteland that is too often ignored by much of humanity.","simplePlot":"A lonely German woman ends up in the most desolate motel on Earth and decides to make it brighter.","actors":[{"actorName":"Marianne Sägebrecht","urlProfile":"http://www.imdb.com/name/nm0845270","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Nzg2NzI0OF5BMl5BanBnXkFtZTcwMTc4OTgwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1945","placeOfBirth":" Starnberg, Bavaria, Germany","height":"5' 6¼\" (1.68 m)","bio":"Marianne Sägebrecht, aka, \"mother of Munich's sub-culture\", a name that was dubbed to her while she was working as a producer and performer in avant garde theater productions, was discovered by Percy Adlon in 1977. The director gave her a minor part in his feature \"The Swing\" before he gave her the leading role of Marianne, a mortician, in Zuckerbaby (1985). Followed by the leading role of Jasmin Münchgstettner, a woman who mysteriously appears just to bring luminosity to the old, beaten down, and spiritually deprived Bagdad Café in, Bagdad Cafe (1987). Her performance in the film garnered a German Film Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Nzg2NzI0OF5BMl5BanBnXkFtZTcwMTc4OTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0845270","name":"Marianne Sägebrecht","idIMDB":"nm0845270"},"actorId":"nm0845270","character":"Jasmin Münchgstettner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"CCH Pounder","urlProfile":"http://www.imdb.com/name/nm0001634","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MTI0NzkzN15BMl5BanBnXkFtZTYwNzExNzgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1952","placeOfBirth":" Georgetown, British Guiana","birthName":"Carol Christine Hilaria Pounder","height":"5' 7\" (1.7 m)","bio":"CCH Pounder (the CCH standing for Carol Christine Hilaria, her birth name). As can be said of other similarly styled actresses such as Alfre Woodard and Cicely Tyson, most of Pounder's characters are enriched with these same positive attributes and it is a testament to this actress' abilities that she continues on such a high plane in a nearly three-decade career. Born on Christmas Day 1952 in Guyana, she was raised on a sugar cane plantation. Her parents moved to the States while she was still a young girl, but she and her sister were sent to a convent boarding school in Britain where they were introduced to art and the classics. Following high school graduation, she arrived in New York and studied at Ithaca College, where her acting talents were discovered. Regional and classical repertory theater followed, earning roles in such productions as \"The Mighty Gents\" with Morgan Freeman at the New York Shakespeare Festival and \"Open Admissions,\" her Broadway debut. Her preference for a warmer climate led to her move to Hollywood in the late 1970s. After bit roles in All That Jazz (1979) and I'm Dancing as Fast as I Can (1982), she found cult status in the art-house film Bagdad Cafe (1987) (\"Bagdad Café\" in the US) as the offbeat owner of a roadside café, but Pounder's prominence came with television. Usually cast as a confident, strong-minded professional, she is known for her understated intensity and earned an Emmy nomination for her stint on the hospital drama ER (1994). She has performed in a number of highly acclaimed topical dramas, including American Playhouse: Go Tell It on the Mountain (1985), Common Ground (1990), Murder in Mississippi (1990), Funny Valentines (1999) and Boycott (2001), for which a number of kudos have come her way.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MTI0NzkzN15BMl5BanBnXkFtZTYwNzExNzgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001634","name":"CCH Pounder","idIMDB":"nm0001634"},"actorId":"nm0001634","character":"Brenda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Palance","urlProfile":"http://www.imdb.com/name/nm0001588","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MDg1ODA4Ml5BMl5BanBnXkFtZTcwMTUxOTM0MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 February 1919","placeOfBirth":" Lattimer Mines, Pennsylvania, USA","birthName":"Vladimir Ivanovich Palahniuk","height":"6' 4\" (1.93 m)","bio":"Jack Palance exemplified evil incarnate on film -- portraying some of the most intensely despised villains witnessed in 50s westerns and melodrama. He received two Best Supporting Actor nominations early in his career, but it would take a grizzled, eccentric comic performance 40 years later for him to finally grab the coveted statuette. Of Ukrainian descent, Palance was born Volodymyr Jack Palahniuk on February 18, 1919, in Lattimer Mines, Pennsylvania coal country, to Anna (Gramiak) and Ivan Palahniuk. His father, an anthracite miner, died of black lung disease. The sensitive, artistic lad worked in the mines in his early years but averted the same fate as his father. Athletics was his ticket out of the mines when he won a football scholarship to the University of North Carolina. He subsequently dropped out to try his hand at professional boxing. Fighting under the name \"Jack Brazzo,\" he won his first 15 fights, 12 by knockout, before losing a 4th round decision to future heavyweight contender Joe Baksi on Dec. 17, 1940. With the outbreak of World War II, Palance's boxing career ended and his military career began, serving in the Army Air Force as a bomber pilot. Wounded in combat and suffering severe injuries and burns, he received the Purple Heart, Good Conduct Medal, and the World War II Victory Medal. He resumed college studies as a journalist at Stanford University and became a sportswriter for the San Francisco Chronicle. He also worked for a radio station until the acting bug bit. Palance made his stage debut in \"The Big Two\" in 1947 and immediately followed it understudying Marlon Brando as Stanley Kowalski in the groundbreaking Broadway classic \"A Streetcar Named Desire,\" a role he eventually took over. Following stage parts in \"Temporary Island\" (1948), \"The Vigil\" (1948) and \"The Silver Tassle\" (1949), Palance won a choice role in \"Darkness of Noon\" and also the Theatre World Award for \"promising new personality\". This recognition helped him secure a 20th Century-Fox contract. The facial burns and resulting reconstructive surgery following the crash and burn of his WWII bomber plane actually worked to the leathery actor's advantage in Hollywood. Hardly possessing the look of a glossy romantic leading man, Palance instead became an archetypal villain equipped with an imposing glare, intimidating stance and killer-shark smile. He stood out among a powerhouse cast (Richard Widmark, Paul Douglas') in his movie debut in Elia Kazan's Panic in the Streets (1950), as a plague-carrying fugitive. He was soon on his way. Initially billed as Walter Jack Palance, the actor made fine use of his former boxing skills and war experience for the film Halls of Montezuma (1951) as a boxing Marine in Richard Widmark's platoon. Palance followed this with the first of his back-to-back Oscar nods. In Sudden Fear (1952), only his third film, he played rich-and-famous playwright Joan Crawford's struggling actor husband who plots to murder her and run off with gorgeous Gloria Grahame. Finding the right menace and intensity to pretty much steal the proceedings, he followed this with arguably his finest villain of the decade, that of creepy, sadistic gunslinger Jack Wilson who becomes Alan Ladd's biggest nightmare (not to mention others) in the classic western Shane (1953). Their climactic showdown alone is text book. Throughout the 1950s Palance earned some very good film roles such as those in Man in the Attic (1953) (his first lead), The Big Knife (1955) and the war classic Attack (1956). Mixed in were a few routine to highly mediocre parts in Flight to Tangier (1953), Sign of the Pagan (1954), in which he played Attila the Hun, and the biblical bomb The Silver Chalice (1954). In between filmmaking were a host of powerful TV roles -- none better than his down-and-out boxer in Playhouse 90: Requiem for a Heavyweight (1956), a rare sympathetic role that earned him an Emmy. Overseas in the 1960s, Palance made a killing in biblical and war epics and in \"spaghetti -- Revak the Rebel (1960), Barabbas (1961) [Barabbas], and A Bullet for Rommel (1969) [A Bullet for Rommel]. Also included in his 60s foreign work was his participation in the Jean-Luc Godard masterpiece Contempt (1963) [Contempt]. On TV, Palance played a number of nefarious nasties to perfection ranging from Dracula to Dr. Jekyll/Mr. Hyde. Into his twilight years he showed a penchant for brash, quirky comedy capped by his Oscar-winning role in City Slickers (1991), its sequel, and others. He even played Ebenezer Scrooge in a TV-movie incongruously set in the Wild West. Married twice, his three children -- Holly, Brooke and Cody (the last died in 1998 of cancer) -- all dabbled in acting and appeared with their father at one time or another. A man of few words off the set, he owned his own cattle ranch and displayed other creative sides as a exhibited painter and published poet. Jack's last years were marred by failing health and he died at age 87 of natural causes at his daughter Holly's Montecito, California home.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MDg1ODA4Ml5BMl5BanBnXkFtZTcwMTUxOTM0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001588","name":"Jack Palance","idIMDB":"nm0001588"},"actorId":"nm0001588","character":"Rudi Cox","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christine Kaufmann","urlProfile":"http://www.imdb.com/name/nm0442304","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTMxNDU3NDI0Ml5BMl5BanBnXkFtZTcwNDU3NzQxOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1945","placeOfBirth":" Lengdorf, Styria, Austria","birthName":"Christine Maria Kaufmann","height":"5' 4\" (1.63 m)","bio":"Christine Kaufmann was born on January 11, 1945 in Lengdorf, Styria, Austria as Christine Maria Kaufmann. She was an actress, known for Bagdad Cafe (1987), Taras Bulba (1962) and Town Without Pity (1961). She was married to Klaus Zey, Reno Eckstein, Achim Lenz and Tony Curtis. She died on March 28, 2017 in Munich, Bavaria, Germany.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTMxNDU3NDI0Ml5BMl5BanBnXkFtZTcwNDU3NzQxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0442304","name":"Christine Kaufmann","idIMDB":"nm0442304"},"actorId":"nm0442304","character":"Debby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Monica Calhoun","urlProfile":"http://www.imdb.com/name/nm0004793","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MjI5NzQ5Nl5BMl5BanBnXkFtZTcwNTU3OTI4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1971","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"5' 1\" (1.55 m)","bio":"Monica Calhoun was born on July 29, 1971 in Philadelphia, Pennsylvania, USA. She is an actress and producer, known for The Best Man Holiday (2013), Bagdad Cafe (1987) and The Best Man (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MjI5NzQ5Nl5BMl5BanBnXkFtZTcwNTU3OTI4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004793","name":"Monica Calhoun","idIMDB":"nm0004793"},"actorId":"nm0004793","character":"Phyllis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Darron Flagg","urlProfile":"http://www.imdb.com/name/nm0280839","urlPhoto":"","biography":{"bio":"Darron Flagg is known for his work on Bagdad Cafe (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0280839","name":"Darron Flagg","idIMDB":"nm0280839"},"actorId":"nm0280839","character":"Salomo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Aguilar","urlProfile":"http://www.imdb.com/name/nm0013520","urlPhoto":"","biography":{"bio":"George Aguilar is known for his work on Bagdad Cafe (1987), The Scarlet Letter (1995) and Notre musique (2004). He has been married to Josiane Balasko since June 12, 2003.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0013520","name":"George Aguilar","idIMDB":"nm0013520"},"actorId":"nm0013520","character":"Cahuenga","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"G. Smokey Campbell","urlProfile":"http://www.imdb.com/name/nm0132462","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNzc0OTgyOTBeQTJeQWpwZ15BbWU4MDYzNTA5NjYx._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"G. Smokey Campbell is a veteran performer of Stage, Film and Television. He was chosen to study with the famous Negro Ensemble Company (NEC) of New York for three years in a row and also was a performing member of the NEC. In Los Angeles his stage performances earned him three Los Angeles NAACP Image Awards for the Best Actor in a Stage Performance. Smokey has been most recognizable from being a Series Regular on the WNET show \" Watch Your Mouth \" and as a Co Star in the Percy Adlon film, \" Bagdad Cafe \". He received an Associate Arts Degree from Los Angeles City College in Radio / TV Broadcasting. He also graduated from the University of Southern California with a Double Major and received his degrees in the areas of Film / Television Production and Dramatic Arts. His technical experience affords him yet another career as an IATSE member who works as a Lighting Technician within the Entertainment Industry. G Smokey Campbell continues to \"Live the Dream\" because he believes that \"Nothing Happens Unless We Dream\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNzc0OTgyOTBeQTJeQWpwZ15BbWU4MDYzNTA5NjYx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0132462","name":"G. Smokey Campbell","idIMDB":"nm0132462"},"actorId":"nm0132462","character":"Sal","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hans Stadlbauer","urlProfile":"http://www.imdb.com/name/nm0821136","urlPhoto":"","biography":{"dateOfBirth":"16 November 1945","placeOfBirth":" Munich, Bavaria, Germany","height":"5' 10¾\" (1.8 m)","bio":"Hans Stadlbauer was born on November 16, 1945 in Munich, Bavaria, Germany. He is an actor, known for Une famille en Bavière (1989), Bagdad Cafe (1987) and Chiemgauer Volkstheater (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0821136","name":"Hans Stadlbauer","idIMDB":"nm0821136"},"actorId":"nm0821136","character":"Münchgstettner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Alan S. Craig","urlProfile":"http://www.imdb.com/name/nm0185767","urlPhoto":"","biography":{"bio":"Alan S. Craig is an actor, known for Bagdad Cafe (1987) and Gold (1974).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0185767","name":"Alan S. Craig","idIMDB":"nm0185767"},"actorId":"nm0185767","character":"Eric","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Apesanahkwat","urlProfile":"http://www.imdb.com/name/nm0032009","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQzMjc4OTkyOF5BMl5BanBnXkFtZTgwMTQ0NDM4NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Apesanahkwat is an enrolled member of the Menominee Tribe of Wisconsin. He has been elected Tribal Chairman of his tribe 8 times, which is unprecedented. He served in the United States Marine Corps and is a Vietnam Combat Veteran. Apesanahkwat is widely considered by his peers to be one of the foremost knowledgeable originators of the Indian Gaming Regulatory Act (IGRA), which defined the Native Nations' involvement in National Gaming as we know it today. Apesanahkwat exemplifies the attributes of a traditionalist, as well as a progressive activist who exists for the true empowerment of his people and their well-being. An experienced orator on the political and social nuances of the Native experience in America, he is also a motivational speaker promoting language, culture and native spirituality, as well as education, anti-gangs, anti-smoking, drugs and alcohol rehabilitation. An accomplished actor, Apesanahkwat has appeared in films and starred in numerous television shows. Apesanahkwat is also a champion Northern Traditional Dancer who competes in powwows throughout the U.S. and Canada and he is a 2nd Degree Ogitchidaa (Warrior) of the Three Fires Midawin (Medicine Lodge) Society.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQzMjc4OTkyOF5BMl5BanBnXkFtZTgwMTQ0NDM4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0032009","name":"Apesanahkwat","nicknames":["AP"],"idIMDB":"nm0032009"},"actorId":"nm0032009","character":"Sheriff Arnie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ronald Lee Jarvis","urlProfile":"http://www.imdb.com/name/nm0419116","urlPhoto":"","biography":{"bio":"Ronald Lee Jarvis is an actor, known for Bagdad Cafe (1987), Brothers (1984) and The New Lassie (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0419116","name":"Ronald Lee Jarvis","idIMDB":"nm0419116"},"actorId":"nm0419116","character":"Trucker Ron","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mark Daneri","urlProfile":"http://www.imdb.com/name/nm0199405","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjYxYjVhN2UtNDQ3Ni00M2Q2LTkwY2QtZmU0NGIwZWU1YzNiL2ltYWdlXkEyXkFqcGdeQXVyMjQ2Nzg0MzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Mark Daneri is known for his work on Magic City (2012), Workaholics (2011) and Agents of S.H.I.E.L.D. (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjYxYjVhN2UtNDQ3Ni00M2Q2LTkwY2QtZmU0NGIwZWU1YzNiL2ltYWdlXkEyXkFqcGdeQXVyMjQ2Nzg0MzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0199405","name":"Mark Daneri","idIMDB":"nm0199405"},"actorId":"nm0199405","character":"Trucker Mark","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ray Young","urlProfile":"http://www.imdb.com/name/nm0949971","urlPhoto":"","biography":{"dateOfBirth":"9 May 1940","placeOfBirth":" Kansas City, Missouri, USA","bio":"Ray Young was born on May 9, 1940 in Kansas City, Missouri, USA. He was an actor, known for Bagdad Cafe (1987), Coffy (1973) and Blue Sunshine (1977). He died on July 6, 1999 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0949971","name":"Ray Young","idIMDB":"nm0949971"},"actorId":"nm0949971","character":"Trucker Ray","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gary Lee Davis","urlProfile":"http://www.imdb.com/name/nm0204632","urlPhoto":"","biography":{"bio":"Gary Lee Davis was born January 2, 1946, in a log a cabin beside Hwy. H near Charity, Missouri, and is the 4th great grandson of Danial Boone. He is the son of O.E. \"Gene\", a carpenter and long haul trucker, and Nettie Davis, a deputy sheriff and deputy conservation agent. As a child, he admired and loved the woods. Hunting and fishing were not only pastimes, but contributed to family daily life. His family moved to the big city of Buffalo, MO in 1953. City life did eventually rub off on Gary. One of his favorite pastimes was going to the picture show at the \"Buffalo\" and \"PIX\" Theaters. It cost a dime to get in, a nickel for popcorn, nickel for a candy bar, and a nickel for a coke. For one quarter, he would ride the range with Roy Rogers and Gabby Hayes. He wanted to grow up and be a cowboy and he did. Sometimes he would watch Audey Murphy movies and want to grow up to be a soldier.....and he did. Sometimes he would watch the fantastic things the stuntmen did and wanted to do what they did...and he did. He would watch movies about far off and exotic places and dream about going there. And he did. Needless to say the movies had a major influence on his life. After graduation from Buffalo High School as an outstanding athlete, he went on to attend Southwest Missouri State College (before it became a university). He unloaded boxcars at night to pay the bills. In 1964, Gary moved to Lees Summit, MO and worked at Western Electric Corp. until October 5, 1965 when he decided it was time to find out about the Vietnam War. He joined the Air Force, which was the only branch that could guarantee him a position running heavy equipment. Basic training was conducted at San Antonio, Texas then transferred to Chanute AFB, Illinois installing underground communication equipment in the central U.S. One year later, he was transferred to Hickem Air Force Base in Hawaii for the rest of his time in the U.S.A.F. Six months after arriving at Hickem, the Air Force was looking for volunteers for remote duty in South East Asia. He soon found himself at Ching Chung Kwan. His stay in S.E.A. included duty in Thailand, Vietnam, Taiwan, Laos and the Philippians. His tour of duty ended in April 1968. After 8 months at Vandenburg AFB CA, including a 3 month TDY in Guam, he was offered his Staff Sergeant stripes or an 8 month early out and took the latter without remorse. With a new 1968 Camero under him and a couple of laps around the USA, he returned to Western Electric Company. As a young man looking for adventure and ready to move on and pursue another childhood dream, to ride the range, he sold the Camero, bought a 1970 Ford Truck, loaded up his registered Buckskin Poco bred Quarter Horse \"Tom Star Buck\" and headed off to Leota, Kansas. Over the next 2 years, Gary led the life of a ranch cowboy, doing open range and feedlot work. He then went on to Sperry, Oklahoma to complete the course of study at the Oklahoma Farrier's College as a Master Farrier. Gary moved back to Missouri and shod horses for a year before he headed West again to the North side of L.A. California to an area with more privately owned horses than anywhere else in the United States. While doing farrier work, he picked up a job as a bouncer and head of security at the Palomino Club North Hollywood in 1973 to 1976 where he soon acquired many Hollywood Stuntmen, as well as Professional Rodeo Cowboy Association (PRCA) members as shoeing clients. These clients soon became friends and they owned cattle, practice arenas and bulldogging horses. He joined the PRCA in 1974 and rodeo'd hard for the next 5 years. During this same time (1976), Gary got his Screen Extras Guild Card, soon followed by his Screen Actors Guild card. By 1979, a big choice had to be made.....the life of a rodeo cowboy with nothing at the end, or a career in the Motion Picture Industry. Rodeo became a hobby and \"the business\" became a profession. Lasting over 30 years with 237 commercials and hundreds of movies, T.V. shows, and industrial films. In 1984 he married Carrie Campbell, a banker, and in 1990 his only son Jake was born. Up until the fall of 2000, Gary continued to work in the Motion Picture Industry, acting and doing stunts. For fun, he team roped, winning the L.A. Pro Celebrity Rodeo in 1991. With the Screen Actors Guild on strike, He was almost 55 years old with a broken kneecap and a break was needed. He headed to the Wildlife Waystation, a 160 acre rescue, rehabilitation, and relocation center for over 700 wild and exotic animals that he helped found in 1976. Since founded, the Waystation has saved over 76,000 animals. Founder and C.E.O. Marine Colette, who was like a sister to him, had called to say that county, state and federal agencies were trying to shut her down due to un-permitted construction. Gary, as facilities manager, had decided to stay and help out with everything, from reconstructing 160 animal enclosures, to re-landscaping, after relocating more than 180 people a and their 60 mobile home living quarters off the compound grounds and into apartments and being the project supervisor for the construction of 6 maximum security enclosures for adult chimpanzees. After 3 1/2 years of 7 days a week, 12-16 hour days, it put a strain on his relationship with his wife, Carrie. They divorced in April 2003. In 2005, he sold his properties in order to put his son through four years at a major university. For most of 2006, he worked as a trainer of movie animals in Piru, California. In 2007, Gary moved back to Missouri to help out his aging father. He also watches his son, Jake, develop his career as a stand-up comedian and actor. He currently (2015) resides in a totally refurbished USDA pig sale barn, known locally as Ft. Davis. It's a cowboy palace and a place to put your boots up.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0204632","name":"Gary Lee Davis","idIMDB":"nm0204632"},"actorId":"nm0204632","character":"Trucker Gary","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0095801","urlIMDB":"http://www.imdb.com/title/tt0095801","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"SEK","country":"15,558,848","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1988/\">1988</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 35 min (95 min)","1 hr 48 min (108 min) (Germany)"],"soundMix":["Dolby SR"],"color":["Color (Eastmancolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"7.5","metascore":"71","filmingLocations":[{"location":"Bagdad, Arizona, USA"}],"rated":"PG","awards":[{"award":"Academy Awards, USA 1989","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Music, Original Song","names":[{"name":"Bob Telson","id":"nm0854551","role":null}]}]}]},{"award":"Amanda Awards, Norway 1989","titlesAwards":[{"titleAwardOutcome":"Won Amanda","categories":[{"category":"Best Foreign Feature Film (Årets utenlandske spillefilm)","names":[{"name":"Percy Adlon","id":"nm0000727","role":null}]}]}]},{"award":"Bavarian Film Awards 1988","titlesAwards":[{"titleAwardOutcome":"Won Bavarian Film Award","categories":[{"category":"Best Screenplay (Drehbuchpreis)","names":[{"name":"Eleonore Adlon","id":"nm0012280","role":null},{"name":"Percy Adlon","id":"nm0000727","role":null}]}]}]},{"award":"Casting Society of America, USA 1989","titlesAwards":[{"titleAwardOutcome":"Won Artios","categories":[{"category":"Best Casting for Feature Film, Comedy","names":[{"name":"Al Onorato","id":"nm0648849","role":null},{"name":"Jerold Franks","id":"nm0291660","role":null}]}]}]},{"award":"César Awards, France 1989","titlesAwards":[{"titleAwardOutcome":"Won César","categories":[{"category":"Best Foreign Film (Meilleur film étranger)","names":[{"name":"Percy Adlon","id":"nm0000727","role":null}]},{"category":"Best Film of the European Community (Meilleur film de l'Europe communautaire)","names":[{"name":"Percy Adlon","id":"nm0000727","role":null}]}]}]},{"award":"Ernst Lubitsch Award 1988","titlesAwards":[{"titleAwardOutcome":"Won Ernst Lubitsch Award","categories":[{"category":"","names":[{"name":"Percy Adlon","id":"nm0000727","role":null}]}]}]},{"award":"Film Independent Spirit Awards 1989","titlesAwards":[{"titleAwardOutcome":"Nominated Independent Spirit Award","categories":[{"category":"Best Foreign Film","names":[{"name":"Percy Adlon","id":"nm0000727","role":null}]}]}]},{"award":"French Syndicate of Cinema Critics 1989","titlesAwards":[{"titleAwardOutcome":"Won Critics Award","categories":[{"category":"Best Foreign Film","names":[{"name":"Percy Adlon","id":"nm0000727","role":null}]}]}]},{"award":"German Film Awards 1988","titlesAwards":[{"titleAwardOutcome":"Won Film Award in Gold","categories":[{"category":"Best Performance by an Actress in a Leading Role (Beste darstellerische Leistung - Weibliche Hauptrolle)","names":[{"name":"Marianne Sägebrecht","id":"nm0845270","role":null}]}]},{"titleAwardOutcome":"Won Film Award in Silver","categories":[{"category":"Outstanding Feature Film (Bester Spielfilm)","names":[]}]},{"titleAwardOutcome":"Nominated Film Award in Gold","categories":[{"category":"Outstanding Feature Film (Bester Spielfilm)","names":[]}]}]},{"award":"Guild of German Art House Cinemas 1989","titlesAwards":[{"titleAwardOutcome":"Won Guild Film Award - Gold","categories":[{"category":"German Film (Deutscher Film)","names":[{"name":"Percy Adlon","id":"nm0000727","role":null}]}]}]},{"award":"Guldbagge Awards 1989","titlesAwards":[{"titleAwardOutcome":"Won Guldbagge","categories":[{"category":"Best Foreign Film (Bästa utländska film)","names":[]}]}]},{"award":"Robert Festival 1989","titlesAwards":[{"titleAwardOutcome":"Won Robert","categories":[{"category":"Best Foreign Film (Årets udenlandske spillefilm)","names":[{"name":"Percy Adlon","id":"nm0000727","role":"director"}]}]}]},{"award":"Seattle International Film Festival 1988","titlesAwards":[{"titleAwardOutcome":"Won Golden Space Needle Award","categories":[{"category":"Best Film","names":[]}]}]}],"votes":"10,001","type":"Movie","companyCreditsSimple":[{"idCompany":"co0017246","name":"Pelemele Film"},{"idCompany":"co0046948","name":"Pro-ject Filmproduktion"},{"idCompany":"co0051615","name":"Bayerischer Rundfunk (BR)"}],"keywords":{"keywords":["motel","magic","desert","cult film","motor home","water tower","woman woman relationship","rainbow","cleaning","baby","female protagonist","nude modeling","sneeze","piano","nudity","coffee","truck","painting","sheriff","sequel","boomerang","restaurant","immigration","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:01:35"}}