{"data":{"movies":[{"title":"Saddle Tramp","originalTitle":"","year":"1950","releaseDate":"19500921","directors":[{"name":"Hugo Fregonese","id":"nm0293707"}],"writers":[{"name":"Harold Shumate","id":"nm0795851"},{"name":"Harold Shumate","id":"nm0795851"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjQ5NWQ5NTAtZWE3Zi00YzJiLTgzZjItMTVmOTMzNDYwZmNhXkEyXkFqcGdeQXVyMTYzNTE3NDA@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Western"],"plot":"Carefree Chuck Connor is on his way west and stops off to see an old friend and his four lads. When his host is killed in a riding accident Chuck realises he must take care of the family. They hit the road and he takes a job on a ranch, but he has to keep the children hidden as his boss hates kids. There's also tension with the neighbouring ranch, and when a girl on the run from her nasty uncle joins the family unannounced Chuck wonders what he has done to deserve all this.","simplePlot":"A saddle tramp unexpectedly becomes foster parent to four children for whom he provides by working on a ranch that's embroiled in a feud with another ranch and cattle rustlers.","actors":[{"actorName":"Joel McCrea","urlProfile":"http://www.imdb.com/name/nm0566948","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMjI0NDIyOV5BMl5BanBnXkFtZTYwMzMxMjg2._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1905","placeOfBirth":" South Pasadena, California, USA","birthName":"Joel Albert McCrea","height":"6' 2½\" (1.89 m)","bio":"One of the great stars of American Westerns, and a very popular leading man in non-Westerns as well. He was born and raised in the surroundings of Hollywood and as a boy became interested in the movies that were being made all around. He studied acting at Pomona College and got some stage experience at the Pasadena Community Playhouse, where other future stars such as Randolph Scott, Robert Young, and Victor Mature would also get their first experience. He worked as an extra after graduation from the University of Southern California in 1928 and did some stunt work. In a rare case of an extra being chosen from the crowd to play a major role, McCrea was given a part in The Jazz Age. A contract at MGM followed, and then a better contract at RKO. Will Rogers took a liking to the young man (they shared a love of ranching and roping) and did much to elevate McCrea's career. His wholesome good looks and quiet manner were soon in demand, primarily in romantic dramas and comedies, and he became an increasingly popular leading man. He hoped to concentrate on Westerns, but several years passed before he could convince the studio heads to cast him in one. When he proved successful in that genre, more and more Westerns came his way. But he continued to make a mark in other kinds of pictures, and proved himself particularly adept at the light comedy of Preston Sturges, for whom he made several films. By the late Forties, his concentration focused on Westerns, and he made few non-Westerns thereafter. He was immensely popular in them, and most of them still hold up well today. He and Randolph Scott, whose career strongly resembles McCrea's, came out of retirement to make a classic of the genre, Sam Peckinpah's Ride the High Country (1962). Scott stayed retired thereafter; McCrea made a couple of appearances in small films afterwards, but was primarily content to maintain his life as a gentleman rancher. He was married for fifty-seven years to actress Frances Dee, who survived him.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMjI0NDIyOV5BMl5BanBnXkFtZTYwMzMxMjg2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0566948","name":"Joel McCrea","nicknames":["McFee"],"idIMDB":"nm0566948"},"actorId":"nm0566948","character":"Chuck Conner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wanda Hendrix","urlProfile":"http://www.imdb.com/name/nm0376905","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE2MjkwNjA4OV5BMl5BanBnXkFtZTgwMTk0MTkwMzE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1928","placeOfBirth":" Jacksonville, Florida, USA","birthName":"Dixie Wanda Hendrix","height":"5' 2\" (1.57 m)","bio":"Born Dixie Wanda Hendrix in Jacksonville, Florida to a logging camp boss (Max Sylvester Hendrix) and his wife (Mary Bailley), wholesome, green-eyed, dark-haired Wanda Hendrix was involved in her hometown's little theater group when she was \"discovered\" by a passing talent agent and signed up by Warner Bros. Her family moved to California. Forgoing bit parts, the petite and lovely up-and-comer was immediately featured in featured roles in both Confidential Agent (1945) and Nora Prentiss (1947) for Warner Bros. and Welcome Stranger (1947) for Paramount. Signing up with Paramount, she earned one of her best film roles with Ride the Pink Horse (1947), in which there was talk of an Oscar nomination, and appeared elsewhere in the light comedy Miss Tatlock's Millions (1948) and the melodrama My Own True Love (1949). After appearing on the cover of Coronet magazine, decorated WWII hero-turned-Universal star Audie Murphy took notice and arranged a meeting with her. They married on February 8 1949, and she co-starred with him a year later in one of his western vehicles, Sierra (1950). The marriage had problems from the beginning. Audie, who wanted her to give up her career, suffered from flashbacks and paranoia from his traumatic war-time experiences and often held her at gunpoint during violent episodes. The frightened woman left him after only seven months and divorced him soon after, charging him with mental cruelty. The final decree came on April 14, 1950. The negative publicity that came out of their stormy marriage did little to enhance Wanda's status in Hollywood and, after a few standard oaters and war yarns, the more notable ones being Captain Carey, U.S.A. (1950) co-starring Alan Ladd, The Highwayman (1951) with Charles Coburn, and Roger Corman's Highway Dragnet (1954) with Richard Conte, her career waned. The actress retired completely from pictures in 1954 to marry millionaire playboy and sportsman James L. Stack, Jr., brother of actor Robert Stack. She earlier appeared with her famous brother-in-law in the films Miss Tatlock's Millions (1948) and My Outlaw Brother (1951). The career sacrifice did little to help the marriage and the couple divorced in 1958. Returning to acting, she made a comeback on stage, film and TV but experienced little progression. Overlooked in her three 1960s films, her last film roles were filmed in the early 1970s. \"Mystic Mountain Massacre\", co-starring Ray Danton, was never released, and the Civil War horror One Minute Before Death (1972), based on a short story \"The Oval Portrait\" by Edgar Allan Poe, in which she co-starred with Barry Coe and Gisele MacKenzie, died a quicker death than even the title suggests. In 1969, she married a third and last time, to oil company executive Steve La Monte in Las Vegas. At one point, she considered collaborating with author Douglas Warren on an autobiography of her first husband, Audie Murphy, but it never came to fruition. Divorced from her third husband in 1980, Wanda died shortly thereafter at age 52 of double pneumonia in Los Angeles. She had no children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE2MjkwNjA4OV5BMl5BanBnXkFtZTgwMTk0MTkwMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0376905","name":"Wanda Hendrix","idIMDB":"nm0376905"},"actorId":"nm0376905","character":"Della","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Russell","urlProfile":"http://www.imdb.com/name/nm0751245","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NjU5MzYwNl5BMl5BanBnXkFtZTcwMDgyOTgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1921","placeOfBirth":" Los Angeles, California, USA","birthName":"John Lawrence Russell","height":"6' 3\" (1.91 m)","bio":"Handsome, rugged American leading man John Russell (whose credits are often confused with those of child actor Johnny Russell) attended the University of California, where he was a student athlete. Serving in the US Marine Corps in WW II, he earned a battlefield commission and decorations for valor at Guadalcanal. His dark good looks brought him to the attention of a talent scout after the war and he began playing second leads and occasional heavies in major productions. In the 1950s, he branched into television and starred in several popular series, most notably Lawman (1958). His appearances were sporadic after the 1960s, though he was a memorable villain in Clint Eastwood's Pale Rider (1985).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NjU5MzYwNl5BMl5BanBnXkFtZTcwMDgyOTgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0751245","name":"John Russell","idIMDB":"nm0751245"},"actorId":"nm0751245","character":"Rocky","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John McIntire","urlProfile":"http://www.imdb.com/name/nm0570615","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0Mjc4MDc3OF5BMl5BanBnXkFtZTcwODU0NzQ5Ng@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 June 1907","placeOfBirth":" Spokane, Washington, USA","birthName":"John Herrick McIntire","height":"6' (1.83 m)","bio":"John McIntire possessed the requisite grit, craggy features and crusty, steely-eyed countenance to make for one of television and film's most durable supporting players of western settings. Born in Spokane, Washington in 1907 and the son of a lawyer, he grew up in Montana where he learned to raise and ride broncos on the family homestead. After two years at USC, he spent some time out at sea before turning his attentions to entertainment and the stage. As a radio announcer, he gained quite a following announcing on the \"March of Time\" broadcasts. In the late 1940s, John migrated west and found a niche for himself in rugged oaters and crimers. Normally the politicians, ranchers and lawmen he portrayed could be counted on for their integrity, maturity and worldly wise, no-nonsense approach to life such as in Black Bart (1948), Down to the Sea in Ships (1949), The Asphalt Jungle (1950), Saddle Tramp (1950) and The World in His Arms (1952). However, director Anthony Mann tapped his versatility and gave him a few shadier, more interesting villains to play in three of his top-notch western films: Winchester '73 (1950), The Far Country (1954) and The Tin Star (1957). Television helped John gain an even stronger foothold in late 1950s Hollywood. Although his character was killed off on the Naked City (1958) program, he became a familiar face in two other classic western series. He won the role of Christopher Hale in 1961 after Wagon Train (1957) series' star Ward Bond died, and then succeeded the late Charles Bickford in The Virginian (1962) in 1967 playing Bickford's brother, Clay Grainger, for three years. John's deep, dusty, resonant voice was utilized often for narratives and documentaries. In the ensuing years, he and his longtime wife, actress Jeanette Nolan, became the Ossie Davis and Ruby Dee of the sagebrush set, appearing together as the quintessential frontier couple for decades and decades. They were married for 56 years until John's death of emphysema in 1991. They both outlived their son, Tim McIntire, a strapping, imposing actor himself, who died in 1986 of heart problems.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0Mjc4MDc3OF5BMl5BanBnXkFtZTcwODU0NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0570615","name":"John McIntire","idIMDB":"nm0570615"},"actorId":"nm0570615","character":"Jess Higgins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeanette Nolan","urlProfile":"http://www.imdb.com/name/nm0634282","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTcwNTQ0M15BMl5BanBnXkFtZTcwMDU5NTMxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 December 1911","placeOfBirth":" Los Angeles, California, USA","bio":"Jeanette Nolan began her acting career in the Pasadena Community Playhouse and, while a student at Los Angeles City College, made her radio debut in 1932 in \"Omar Khayyam\", the first transcontinental broadcast from station KHJ. Her film debut was probably also her best part, Lady Macbeth opposite director/actor Orson Welles's Macbeth (1948). Her final film role was as Tom Booker's (Robert Redford's) mother \"Ellen Booker\" in The Horse Whisperer (1998). She appeared in more than 300 television shows, including episode roles in Perry Mason (1957), I Spy (1965), MacGyver (1985), Alfred Hitchcock Presents (1955), and as a regular on The Richard Boone Show (1963) and The Virginian (1962). She received four Emmy nominations. She died, aged 86, at Cedars-Sinai Medical Center, following a stroke.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTcwNTQ0M15BMl5BanBnXkFtZTcwMDU5NTMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0634282","name":"Jeanette Nolan","idIMDB":"nm0634282"},"actorId":"nm0634282","character":"Ma Higgins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Russell Simpson","urlProfile":"http://www.imdb.com/name/nm0801193","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzRiMTE2YTktNWMzOS00ZWYyLWFhMTUtOTc5OGMxNDExMjMyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 June 1877","placeOfBirth":" Danville, California, USA","birthName":"Russell McCaskill Simpson","height":"6' 1\" (1.85 m)","bio":"His grim, beady-eyed, sharp-nosed, weatherbeaten face was always familiar despite the small roles he appeared in. Every once in a while character actor Russell Simpson would stand out in a small scene, but his main purpose seemed to be adding rustic authenticity to his westerns or small-town dramas. Born on June 17, 1880 in San Francisco, California, Simpson was involved in the Alaska gold rush as a teenager before settling upon an acting career. A member of a number of touring companies, he eventually made it to Broadway. His silent film debut in The Virginian (1914) was unbilled, but he went on to appear in occasional leads and top support roles in many others, with such roles as Trampas in the remake of The Virginian (1923) and President Andrew Jackson in The Frontiersman (1927) highlighting his silent era. Simpson's parts grew smaller with the advent of sound and his gents grew increasingly grizzled, stubborn and cranky. In the late 1930s he became a stock player in director John Ford's company of actors, which culminated in one of his finest roles as Pa Joad in the classic The Grapes of Wrath (1940). He appeared in other Ford pictures, including Drums Along the Mohawk (1939), Tobacco Road (1941), They Were Expendable (1945), My Darling Clementine (1946) and The Sun Shines Bright (1953). He would continue acting to the very end, making his last film (naturally) for Ford: The Horse Soldiers (1959). Appearing in hundreds of films over a span of four decades, he graced TV westerns as well with roles on The Lone Ranger (1949) and Adventures of Wild Bill Hickok (1951) to his credit. His more than 40-year marriage to Gertrude Aller produced a daughter, Roberta. Simpson passed away on December 12, 1959 of natural causes in Woodland Hills, California at the age of 79.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzRiMTE2YTktNWMzOS00ZWYyLWFhMTUtOTc5OGMxNDExMjMyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0801193","name":"Russell Simpson","idIMDB":"nm0801193"},"actorId":"nm0801193","character":"Pop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ed Begley","urlProfile":"http://www.imdb.com/name/nm0003225","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTM0Njg2N15BMl5BanBnXkFtZTcwNzgzNzg1MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 March 1901","placeOfBirth":" Hartford, Connecticut, USA","birthName":"Edward James Begley","height":"5' 7\" (1.7 m)","bio":"Charismatic character star Edward James Begley was born in Hartford, Connecticut of Irish parents and educated at St.Patrick's school. His interest in acting first surfaced at the age of nine, when he performed amateur theatricals at the Hartford Globe Theatre. Determined to make his own way, he left home aged eleven and drifted from job to job, had a four-year stint in the U.S. Navy, then worked in a bowling alley replacing pins, joined carnivals and circuses. In 1931, he appeared in vaudeville and was also hired as a radio announcer, his voice broadcast to nationwide audiences. It took him several years to establish himself on the legitimate stage, but in 1943, he had a role in the short-running play 'Land of Fame'. His first success was the 1947 Arthur Miller play 'All My Sons' and this was followed by the 1925 Scopes Trial fictionalisation 'Inherit the Wind' (1955-57), which ran for 806 performances at the National Theatre. Ed, co-starring with Paul Muni, played the part of Matthew Harrison Brady (played in the 1960 motion picture by Fredric March) and won the 1956 Tony Award for Best Featured Actor in a Play. Upon Paul Muni's departure from the cast, Ed used the opportunity to play the part of Henry Drummond (Spencer Tracy's role in the film) with equal vigour. In 1960, he starred as Senator Orrin Knox in the political drama 'Advise and Consent'. Ed's movie career began with Boomerang! (1947), a murder mystery set in his native Connecticut, directed by Elia Kazan. Heavy-set and with bushy eyebrows, the archetypal image of Ed Begley on screen is as a gruff, blustery, often heavily sweating (and sometimes corrupt) politician or industrialist. He proved his mettle in a number of classic films, including Sorry, Wrong Number (1948) and On Dangerous Ground (1951). Whether as the sympathetic executive in Patterns (1956), a bigoted ex-cop turned bank robber in Odds Against Tomorrow (1959), or the crazed billionaire bent on world domination of Billion Dollar Brain (1967), he tackled every part that came his way with conviction. The culmination of his work was a Best Supporting Actor Academy Award for his role of Boss Finley in Tennessee Williams's Sweet Bird of Youth (1962). In addition to countless radio broadcasts, Ed was also busy in television in the 1950's and 60's. Among frequent guest starring appearances, his dynamic characterisations in two episodes of The Invaders (1967) ('The Betrayed' and 'Labyrinth') stand out in particular. Ed Begley died of a heart attack in April 1970 in Hollywood at the age of 69.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMTM0Njg2N15BMl5BanBnXkFtZTcwNzgzNzg1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003225","name":"Ed Begley","idIMDB":"nm0003225"},"actorId":"nm0003225","character":"Mr. August Hartnagle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jimmy Hunt","urlProfile":"http://www.imdb.com/name/nm0402505","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWExMmI5NjgtOThiMS00MDBkLWJlYzctMjZjYTkzY2I2M2ViXkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1939","placeOfBirth":" Los Angeles, California, USA","birthName":"James Walter Hunt","bio":"Jimmy Hunt was born on December 4, 1939 in Los Angeles, California, USA as James Walter Hunt. He is an actor, known for Invaders from Mars (1953), Sorry, Wrong Number (1948) and Invaders from Mars (1986). He has been married to Roswitha T. Jager since January 26, 1963. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWExMmI5NjgtOThiMS00MDBkLWJlYzctMjZjYTkzY2I2M2ViXkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0402505","name":"Jimmy Hunt","idIMDB":"nm0402505"},"actorId":"nm0402505","character":"Robbie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Orley Lindgren","urlProfile":"http://www.imdb.com/name/nm0511854","urlPhoto":"","biography":{"dateOfBirth":"18 July 1939","placeOfBirth":" Long Beach, California, USA","bio":"Orley Lindgren was born on July 18, 1939 in Long Beach, California, USA. He is an actor, known for Young Man with a Horn (1950), Under My Skin (1950) and Red Planet Mars (1952).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0511854","name":"Orley Lindgren","idIMDB":"nm0511854"},"actorId":"nm0511854","character":"Tommie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gordon Gebert","urlProfile":"http://www.imdb.com/name/nm0311357","urlPhoto":"","biography":{"dateOfBirth":"17 October 1941","placeOfBirth":" Des Moines, Iowa, USA","bio":"Gordon Alan Gebert was the only son of Gordon and Violette Gebert. His father was a salesman for a trailer company and later managed sales of truck and bus fleets for the Ford Motor Co. in Iowa. In 1946, a boy was needed for a role in a play for Drake University. Gordon was chosen and received acting lessons through the theatre. In Spring of 1948, Gordon and his parents went to Los Angeles and Gordon started at Pasadena Playhouse in a production of 'Life With Father', opposite 'Victor Jory'. An agent saw him and he was given a bit part in Come to the Stable (1949), which starred screen greats Loretta Young and Celeste Holm. His next film was Holiday Affair (1949), where he got the pivotal role as Janet Leigh's son. As he tries to pair his widowed mother up with free-thinker Robert Mitchum, Gordon stole the show with an unforgettable performance. The Des Moines Tribune review stated, \"Gordon boldly and skillfully walks away with the whole 'Affair.' Not from unknowns or has-beens, either. He's up against such polished operators as Robert Mitchum, Janet Leigh and Wendell Corey.\" The Milwaukee Sentinel said that the film \"shows up young Gebert as a screen natural.\" He made more films with stars such as Burt Lancaster, Dan Duryea, Joel McCrea, Ray Milland, and John Wayne. He even portrayed young Audie Murphy in Audie's autobiographical film, To Hell and Back (1955). As he grew up, he became interested in architecture. Graduating from Van Nuys High School, he attended UCLA and USC for three years. Then he drove across country and stopped at the Massachusetts Institute of Technology, where he applied. He was accepted and never returned to acting. In June of 1966, he graduated with his bachelor's degree in architecture. He then attended Princeton University and graduated from there with his master's degree in January of 1968. He taught at Princeton for a year before becoming part of the staff of New York's City College School of Architecture in July 1969. He is a professor teaching Modeling, Digital Media, Design and Construction Technology. He has been a consultant to various agencies including US Veterans Affairs, US Public Health Service, and the Department of Defense. In 1986, while in line for a flight to a speaking engagement, he met Lizabeth Paravisini, a professor at Vassar. They married and have a son, Gordon Jr.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0311357","name":"Gordon Gebert","idIMDB":"nm0311357"},"actorId":"nm0311357","character":"Johnnie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gregory Moffett","urlProfile":"http://www.imdb.com/name/nm0595635","urlPhoto":"","biography":{"dateOfBirth":"14 March 1943","placeOfBirth":" Los Angeles, California, USA","birthName":"James Gregory Moffett","bio":"Gregory Moffett was born on March 14, 1943 in Los Angeles, California, USA as James Gregory Moffett. He is an actor, known for Robot Monster (1953), Let's Dance (1950) and Saddle Tramp (1950). He is married to Sandy. They have four children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0595635","name":"Gregory Moffett","idIMDB":"nm0595635"},"actorId":"nm0595635","character":"Butch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Antonio Moreno","urlProfile":"http://www.imdb.com/name/nm0603875","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMzM2NTcyMF5BMl5BanBnXkFtZTgwMTk2MDU1MzE@._V1._CR108,135,532,720_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 September 1887","placeOfBirth":" Madrid, Spain","birthName":"Antonio Garride Monteagudo","height":"5' 10\" (1.78 m)","bio":"A serious rival to Rudolph Valentino as the smouldering 'Latin Lover' type was black-haired Spanish-born Antonio Moreno. One of the most prominent screen stars of the 1920's, he was equally adept at romance, melodrama or comedy and appeared opposite most of the legendary movie queens of the era, from the Gish sisters to Greta Garbo, to Gloria Swanson and Mary Pickford. He began working life as an employee of the Northhampton Electric Light and Gas Company. He first acted on stage under the tutelage of Maude Adams, whose theatre he had initially visited in order to fix the lighting. Moreno's heyday came years later, under contract to Paramount from 1923 to 1924, and at Metro-Goldwyn-Mayer in 1926. He had previously made his movie debut at Rex-Universal and then featured as a top drawing card for Vitagraph until 1921. Moreno also proudly held the sobriquet of \"King of the Cliff-hangers\" (usually as co-star to Pearl White), because of his prolific work in serials. After the advent of sound pictures, Moreno's career went into decline, largely due to his heavy Spanish accent. Nonetheless, he eventually segued into character parts and remained gainfully employed in the industry until the late 1950's. He was married from 1923 to Daisy Danziger, the daughter of an oil millionaire. Their lavish mansion, called 'Paramour', was one of the largest in Hollywood and the site of many a famous party. Daisy died ten years later in a tragic car crash near Mulholland Drive.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMzM2NTcyMF5BMl5BanBnXkFtZTgwMTk2MDU1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0603875","name":"Antonio Moreno","nicknames":["Tony","The Latin Lover"],"idIMDB":"nm0603875"},"actorId":"nm0603875","character":"Martinez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Ridgely","urlProfile":"http://www.imdb.com/name/nm0725891","urlPhoto":"","biography":{"dateOfBirth":"6 September 1909","placeOfBirth":" Chicago, Illinois, USA","birthName":"John Huntington Rea","height":"6' 2\" (1.88 m)","bio":"John Ridgely was a versatile character actor who made over 100 films at Warner Brothers during the 1930s and 1940s. Starting out in bit roles in such films as Dark Victory (1939), They Died with Their Boots On (1941) and The Man Who Came to Dinner (1942), Ridgely eventually graduated to larger roles in such classics as Howard Hawks' Air Force (1943), The Big Sleep (1946), Destination Tokyo (1943) and Possessed (1947). After his Warner Brothers tenure ended, he freelanced at other studios and made stage and TV appearances until his untimely passing in 1968 at age 58.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0725891","name":"John Ridgely","idIMDB":"nm0725891"},"actorId":"nm0725891","character":"Slim","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Walter Coy","urlProfile":"http://www.imdb.com/name/nm0185341","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTZiNDAzZjgtOGM2ZS00ODE5LWExNjAtNTA3ZjhlMzIyM2QzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 January 1909","placeOfBirth":" Great Falls, Montana, USA","birthName":"Walter Darwin Coy","height":"6' 2\" (1.88 m)","bio":"Walter Coy was born on January 31, 1909 in Great Falls, Montana, USA as Walter Darwin Coy. He was an actor, known for The Searchers (1956), The Lusty Men (1952) and Zombie Bloodbath (1971). He was married to Ruth E. Harburger and Anne Burr. He died on December 11, 1974 in Santa Maria, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTZiNDAzZjgtOGM2ZS00ODE5LWExNjAtNTA3ZjhlMzIyM2QzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0185341","name":"Walter Coy","idIMDB":"nm0185341"},"actorId":"nm0185341","character":"The Stranger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joaquin Garay","urlProfile":"http://www.imdb.com/name/nm0304881","urlPhoto":"","biography":{"dateOfBirth":"15 November 1911","placeOfBirth":" El Mineral Del Oro, Estado de Mexico, Mexico","birthName":"Joaquin Aguilar Garay","bio":"Joaquin appeared in It Happened One Night, singing The Man On the Flying Trapeze in the 2nd and 3rd verses in the bus scene. He went on to appear in several films already listed. He is best known for his lively character of Ponchito, the Rooster, in Disney's The Three Cabelleros.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0304881","name":"Joaquin Garay","idIMDB":"nm0304881"},"actorId":"nm0304881","character":"Pancho","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0042915","urlIMDB":"http://www.imdb.com/title/tt0042915","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"MCML Universal Pictures Company, Inc."},"technical":{"runtime":["1 hr 30 min (90 min)","1 hr 16 min (76 min) (Encore-Westerns Library Print) (USA)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Color (Technicolor)"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":["Technicolor"],"filmLength":["2,092 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.0","filmingLocations":[{"location":"Andy Jauregui Ranch - Placerita Canyon Road, Newhall, California, USA"}],"rated":"PASSED","awards":[],"votes":"276","type":"Movie","companyCreditsSimple":[{"idCompany":"co0021358","name":"Universal International Pictures (UI)"}],"keywords":{"keywords":["children","widower","saddle tramp","rustling","rustler","cattle","uncle niece relationship","orphan","family relationships","wanderer","rescue","prisoner","henchman","held at gunpoint","gunfire","gang member","gang leader","escape","capture","1880s"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:33:00"}}