{"data":{"movies":[{"title":"Web of Danger","originalTitle":"","year":"1947","releaseDate":"19470610","directors":[{"name":"Philip Ford","id":"nm0285831"}],"writers":[{"name":"David Lang","id":"nm0485719"},{"name":"Milton Raison","id":"nm0707213"}],"runtime":"58 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDI2ZjIxYTEtZDE2ZS00MTVmLWIyNTYtODgzNTNiNTE4ZGY1XkEyXkFqcGdeQXVyMjU4NzU2OTA@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Drama","Romance"],"plot":"Ernie Reardon, the superintendent, and Bill O'Hara, the foreman, of a construction company crew working on a bridge to a remote valley, are constantly quarreling over small and minor matter, especially when it comes to Peg Mallory, whom both men are romancing and Peg enjoys the attention. Thed work is suspended when a worker is killed, but a flood is approaching and the valley citizens are in dire straits unless the bridge is completed - in a hurry.","simplePlot":"Ernie Reardon, the superintendent, and Bill O'Hara, the foreman, of a construction company crew working on a bridge to a remote valley, are constantly quarreling over small and minor matter... ","actors":[{"actorName":"Adele Mara","urlProfile":"http://www.imdb.com/name/nm0544711","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmU3MTcwOGItZjNlZi00YTUyLWI2YTctZTM3YzRlOTNkZDY2XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1923","placeOfBirth":" Highland Park, Michigan, USA","birthName":"Adelaide Delgado","bio":"Born Adelaide Delgado in 1925, Spanish-American Adele Mara was a singer/dancer with Xavier Cugat and His Orchestra in Detroit by the age of 15. Cugat took the beautiful, brown-eyed brunette to New York where she was spotted by a Columbia talent scout and signed in 1942. There she played brisk leading ladies in a series of standard, uneventful \"B\" films including Vengeance of the West (1942) with Tex Ritter and Alias Boston Blackie (1942) starring Chester Morris. A couple of years later she was transformed into a sexy platinum blonde pin-up after signing up with Republic Studios. She kept herself quite busy there predominantly cast as senorita-types opposite cowboy stars Roy Rogers in Bells of Rosarita (1945) and Gene Autry in Twilight on the Rio Grande (1947). She was also fetching fodder in crime dramas including Blackmail (1947) and Web of Danger (1947) and a pleasant diversion in adventure pictures such as Wake of the Red Witch (1948) with John Wayne and The Avengers (1950). Arguably her best parts would come with Angel in Exile (1948) and Sands of Iwo Jima (1949), the latter again starring Duke Wayne. Seldom was she given the chance to prove her acting talents, however, and her film career waned in the early 1950s. Her last screen appearance would be in The Big Circus (1959) with Victor Mature. Adele subsequently moved into TV and was featured in a number of guest spots, primarily in westerns. She eventually settled down to raise a family after her marriage to TV mogul Roy Huggins who produced many hit shows including 77 Sunset Strip (1958) and Maverick (1957). She would appear as a guest in a number of them. The couple had three sons. Huggins died in 2002.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmU3MTcwOGItZjNlZi00YTUyLWI2YTctZTM3YzRlOTNkZDY2XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0544711","name":"Adele Mara","idIMDB":"nm0544711"},"actorId":"nm0544711","character":"Peg Mallory","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Kennedy","urlProfile":"http://www.imdb.com/name/nm0447930","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDliMzI0M2YtNDQ3MS00NmQzLThmMjQtOTA5MmY3NzFiY2Q3XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 June 1908","placeOfBirth":" Cleveland Heights, Ohio, USA","birthName":"Willard Kennedy","bio":"\"...And who, disguised as Clark Kent, mild-mannered reporter for a great metropolitan newspaper, fights a never-ending battle for truth, justice and the American way!\" Remember that familiar voice on TV's Adventures of Superman (1952)? That belonged to Bill Kennedy. Kennedy's moneymaker was in his rich, resonant voice. One of the more prolific radio and (later) TV announcers to hit the airwaves, his career ran nearly five decades. Unlike others who established themselves and stayed comfortably behind a microphone, Bill gamely attempted a 1940s movie career with a big studio (Warner Bros.). And although he failed to make a strong impression visually, his face still is a familiar one thanks to the dozen or so \"B\" westerns he did for the smaller studios in post-war years. Born Willard A. Kennedy in Cleveland Heights, Ohio, on June 27, 1908, he became interested in radio speaking early on and, as a teen, diligently practiced strengthening and shaping his voice so it would be suitable for the medium. He studied at Assumption College, in Ontario, Canada for a couple of years before leaving to find on-hands work. Hired by WTAM in 1934 as a staff announcer, he eventually relocated to WWJ in Detroit, Michigan. A strong interest in acting propelled Bill to take a position as staff announcer in Los Angeles with KHJ. Hal B. Wallis caught his broadcasts and arranged for a Warner Bros. screen test. A genial and darkly handsome presence, the wavy-haired brunet was signed to a seven-year contract and groomed in minor, unbilled bits for the first couple of years in such classy fare as Now, Voyager (1942) and Air Force (1943). More visible roles came with the films Truck Busters (1943) and Mr. Skeffington (1944) but Bill's physical appearance proved to be less commanding on celluloid than his voice. The studio wound up using him more and more in bit parts as announcers, reporters and newsmen in such movies as Flying Fortress (1942), The Hard Way (1943), Mission to Moscow (1943) and This Is the Army (1943), to name a few. The studio let Bill go after a couple of tryout featured parts in Escape in the Desert (1945) and Night and Day (1945). Undaunted, he proceeded to freelance and earned his first leading role as Corporal Decker in the Universal 13-part cliffhanger The Royal Mounted Rides Again (1945). Other occasional post-war leads came his way from the smaller studios with The People's Choice (1946) and Web of Danger (1947), but he still failed to register strongly. For the most part, Bill found himself trapped in minor/secondary parts as in Don't Gamble with Strangers (1946), The Bachelor's Daughters (1946), the Bowery Boys entry News Hounds (1947), and I Wouldn't Be in Your Shoes (1948). Within a few years, however, Bill fell into a comfy niche as a featured \"good guy\" or \"bad guy\" in westerns -- Shadows of the West (1949), Gunslingers (1950), Law of the West (1949)_, Trail of the Yukon (1949), Storm Over Wyoming (1950), I Shot Billy the Kid (1950), Abilene Trail (1951) and Nevada Badmen (1951), among others. When film work waned, Bill found guest parts on the small screen in episodes of \"Boston Blackie,\" \"The Public Defender,\" \"Burns & Allen,\" \"I Married Joan\" and in several episodes of the western series \"The Cisco Kid,\" Death Valley Days\" and \"The Gene Autry Show\". In 1952, he was handed his most famous voiceover as Adventures of Superman (1952)'s opening credits announcer, while also finding work in the same vein in commercials. During severe career lulls Kennedy would find employment as a door-to-door salesman and truck driver. In 1956, after losing his hosting job with KNXT in Hollywood, he returned to Detroit and eventually hosted the weekday \"Bill Kennedy's Showtime\" at CKLWf-TV, a station just across the Detroit River in Ontario, Canada, where he showed movies and took calls and reminisced with ans on the air. The show was later moved to WKBD and renamed \"Bill Kennedy at the Movies.\" Bill remained a popular local personality until his retirement in 1983. The twice married actor with three children spent his last years in Palm Beach, Florida, where he died of emphysema at the age of 88.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDliMzI0M2YtNDQ3MS00NmQzLThmMjQtOTA5MmY3NzFiY2Q3XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0447930","name":"Bill Kennedy","idIMDB":"nm0447930"},"actorId":"nm0447930","character":"Ernie Reardon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Damian O'Flynn","urlProfile":"http://www.imdb.com/name/nm0641035","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmVjNGE5NDAtMjc4My00OTllLTkyMDAtYTFkZDhiY2E4MmNjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1907","placeOfBirth":" Boston, Massachusetts, USA","bio":"Damian O'Flynn was born on January 29, 1907 in Boston, Massachusetts, USA. He was an actor, known for The Life and Legend of Wyatt Earp (1955), The Snake Pit (1948) and A Foreign Affair (1948). He died on August 8, 1982 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmVjNGE5NDAtMjc4My00OTllLTkyMDAtYTFkZDhiY2E4MmNjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641035","name":"Damian O'Flynn","idIMDB":"nm0641035"},"actorId":"nm0641035","character":"Bill O'Hara","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Loo","urlProfile":"http://www.imdb.com/name/nm0519618","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGQwMGJhZDctZGIyNC00ZmIyLWI5ZGItYTAyZTQ4ZTBiZjI2XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1903","placeOfBirth":" Maui, Hawaii, USA","height":"5' 10\" (1.78 m)","bio":"One of the most familiar Asian character actors in American films of the 1930s and 1940s, Richard Loo was most often stereotyped as the Japanese enemy flier, spy or interrogator during the Second World War. Chinese by ancestry and Hawaiian by birth, Loo spent his youth in Hawaii, then moved to California as a teenager. He attended the University of California and attempted a career in business. However, the stock market crash of 1929 and the subsequent economic depression forced him to start over. He became involved with amateur, then professional, theater companies and in 1931 made his first film. Like most Asian actors in non-Asian countries, he played primarily small, stereotypical roles, though he rose quickly to familiarity, if not fame, in a number of fine films. His features led him to be a favorite movie villain, and the coming of World War II gave him greater prominence in roles as vicious Japanese soldiers in successful pictures such as The Purple Heart (1944) and God Is My Co-Pilot (1945). He had a rare heroic role as a weary Japanese-American soldier in the Korean War drama The Steel Helmet (1951), but spent far too much of his career in later years performing stock roles. His wife, Bessie Loo, was a well-known Hollywood agent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGQwMGJhZDctZGIyNC00ZmIyLWI5ZGItYTAyZTQ4ZTBiZjI2XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0519618","name":"Richard Loo","idIMDB":"nm0519618"},"actorId":"nm0519618","character":"Wing","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victor Sen Yung","urlProfile":"http://www.imdb.com/name/nm0950958","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODZiNjQyMWYtYzQ3ZS00MDdmLTljYzQtOWQwMTkxY2ZjZGUxXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1915","placeOfBirth":" San Francisco, California, USA","birthName":"Victor Cheung Young","height":"5' 4\" (1.63 m)","bio":"Achieving both film and TV notice during his lengthy career, this diminutive Asian-American character was born Sen Yew Cheung on October 18, 1915 in San Francisco of humble Chinese émigrés. When his mother died during the flu epidemic of 1919, his father placed Victor and his sister in a children's shelter and returned to his homeland. He arrived back in America in the mid-20s having remarried, and the children were released back to his guardianship where they began learning Chinese. To contribute to the family income, young Sen Yung was employed as a houseboy at age 11 and managed to earn his way through college at the University of California at Berkeley with an interest in animal husbandry and receiving a degree in economics. Following a move to Hollywood for some post graduate work at UCLA and USC, Victor gained an entrance into films via extra work, where he was in such roles as a peasant boy in The Good Earth (1937), and a soldier in Mr. Moto Takes a Chance (1938), among others. During this early period he also worked as a salesman for a chemical firm. In one of Hollywood's more interesting tales of being \"discovered\", the story goes that Victor was on the Twentieth Century-Fox studio lot at the time trying to pitch one of his company's flame retardant compounds to industry techies when one of them suggested he check out casting. The original Charlie Chan, Warner Oland, had passed away and the series was undergoing a major casting overhaul. In the end, Sidney Toler, who was replacing the late Mr. Oland and received cast approval, chose the fledgling actor following a screen test to play his #2 son, Jimmy Chan, for the film Charlie Chan in Honolulu (1938). Victor went on to play the role for seventeen other \"Charlie Chan\" features. Needless, to say he quit the sales business for good. Victor enjoyed playing Jimmy, the earnest rookie detective who, to his chagrin, was always under the watchful eye of his famous father while trying to help solve murder cases. Outside the role, however, Victor (billed as Sen Yung, Victor Yung and Victor Sen Yung at different times) found the atmosphere oppressive. Usually cast in nothing-special Asian stereotypes, sometimes villainous, in war-era films, parts in such movies as The Letter (1940) starring Bette Davis, Secret Agent of Japan (1942), Little Tokyo, U.S.A. (1942), Moontide (1942), Across the Pacific (1942), Manila Calling (1942), China (1943) and Night Plane from Chungking (1943), did little to advance his stature in Hollywood. His career was interrupted for U.S. Air Force duty as a Captain of Intelligence during WWII. His part in the Chan pictures was taken over by actor Benson Fong. Victor was able to pick up where he left off in Hollywood following the war and returned to his famous role as #2 son. The character's name, however, was eventually changed from \"Jimmy\" to \"Tommy\" after a third installment of Charlie Chan pictures were filmed with Roland Winters now the title sleuth after the passing of Mr. Toler in 1947. While Victor's workload was fairly steady, again the roles themselves were meager and hardly inspiring. Most were in \"B\" level crime mysteries and war pictures and many were accepted with no screen credit at all. Reduced often to playing middle-age servile roles (houseboys, laundrymen, valets, clerks, dock workers and waiters), some of his slightly more prominent roles include those in Woman on the Run (1950), Forbidden (1953), Target Hong Kong (1953), and Trader Tom of the China Seas (1954). His last film appearance was in The Man with Bogart's Face (1980). On TV, Victor appeared in two familiar recurring roles. On the John Forsythe series Bachelor Father (1957), he showed up as \"Peter Fong\" on the final season of the sitcom. He played the cousin to houseboy Sammee Tong's regular character. Victor is better remembered, however, for the part of Hop Sing, the earnest, volatile cook to the Cartwright clan, provided sporadic comic relief on the long-running Bonanza (1959) western series. He also appeared in the TV pilot and in several episodes of the popular philosophical western series Kung Fu (1972), as well as popping up in dramatic episodes of Hawaiian Eye (1959), The F.B.I. (1965). and Hawaii Five-O (1968). Sitcoms gave a hint of his gentle, humorous side in Here's Lucy (1968), Get Smart (1965) and Mister Ed (1958), but there was not a single role that truly improved his standing in Hollywood. Married and divorced with one child, Victor was looking for work outside of acting by the mid-1970s. At one point he was giving cooking demonstrations in department stores. An accomplished chef who specialized in Cantonese-style cooking, he wrote the 1974 Great Wok Cookbook and dedicated the book to his father, Sen Gam Yung. Victor was working on a second cookbook when he was suddenly found dead in November of 1980 under initially \"mysterious circumstances\" in his modest San Fernando Valley bungalow. Following an investigation it was determined that Victor was accidentally asphyxiated in his sleep after turning on a faulty kitchen stove for heat. He was survived by his son and two grandchildren.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODZiNjQyMWYtYzQ3ZS00MDdmLTljYzQtOWQwMTkxY2ZjZGUxXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0950958","name":"Victor Sen Yung","idIMDB":"nm0950958"},"actorId":"nm0950958","character":"Sam","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roy Barcroft","urlProfile":"http://www.imdb.com/name/nm0054117","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWI1NTkxNDEtNGVlZS00MzVjLTg1Y2QtMjdmZjBkZmNiMmQ2XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1902","placeOfBirth":" Crab Orchard, Nebraska, USA","birthName":"Howard Clifford Ravenscroft","height":"6' 0½\" (1.84 m)","bio":"After serving in World War I, Roy Barcroft spent most of the 1920s and early 1930s moving from job to job. It was in the 1930s, after he moved to California with his wife, that he found his calling while acting in amateur theatrical productions. In 1937 he was appearing in bit parts in various genres, but by 1938 he was in westerns, where he became a well-known (and memorable) \"heavy\". Roy would alternate among Monogram, Universal, Columbia and other studios. In 1943, however, he signed an exclusive ten-year contract with Republic Pictures and became the convincing, and tireless, menace to all the good people in the West. He also did more than sneer at the likes of Don 'Red' Barry, Bill Elliot, Sunset Carson and Allan Lane. Roy acted in The Fighting Seabees (1944), which starred John Wayne. He was the Purple Martian in The Purple Monster Strikes (1945) and Capt. Mephisto in Manhunt of Mystery Island (1945), and who can forget his Retik, The Moon Menace. from the classic Radar Men from the Moon (1952)? Roy even played the good-natured marshal in Oklahoma! (1955). It was westerns, though, that were his bread and butter, and he knocked out a lot of them over the years. Outlaws of Cherokee Trail (1941), Riders of the Rio Grande (1943) and Sun Valley Cyclone (1946) were but a few of the \"B\" westerns Roy turned out. Off-screen, he was known as one of the nicest, kindest and most helpful people anyone would want to meet, with a terrific sense of humor. More than once, many a leading hero type such as Barry or Elliot would find that their hairpieces would mysteriously disappear before they were to put them on prior to shooting. When the era of the \"B\" westerns started to fade out, Roy's volume of work also slowed. He appeared in a handful of films, but his movie career had stalled by the end of 1957. He moved into the small screen with roles in TV westerns and also a recurring role in the Walt Disney production of The Adventures of Spin and Marty (1955). In the early 1960s he worked in a couple of movies, but his resurgence began in the mid-'60s when he appeared in low-budget films like Billy the Kid Versus Dracula (1966). Roy would make some better films, such as Texas Across the River (1966) and The Reivers (1969).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWI1NTkxNDEtNGVlZS00MzVjLTg1Y2QtMjdmZjBkZmNiMmQ2XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0054117","name":"Roy Barcroft","nicknames":["Big Roy"],"idIMDB":"nm0054117"},"actorId":"nm0054117","character":"Monks, Worker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Hall","urlProfile":"http://www.imdb.com/name/nm0356219","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzc5Y2QwMmEtN2UwNC00ZmI4LTk3NGQtNWEwMmUzYjRmY2YyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1903","placeOfBirth":" Brooklyn, New York, USA","birthName":"William Langan","height":"6' 4\" (1.93 m)","bio":"William Hall was born on March 4, 1903 in Brooklyn, New York, USA as William Langan. He was an actor, known for The Bachelor and the Bobby-Soxer (1947), Escape by Night (1937) and The Time of Their Lives (1946). He died on September 14, 1986 in Kerr County, Texas, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzc5Y2QwMmEtN2UwNC00ZmI4LTk3NGQtNWEwMmUzYjRmY2YyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0356219","name":"William Hall","idIMDB":"nm0356219"},"actorId":"nm0356219","character":"Slim, Worker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"J. Farrell MacDonald","urlProfile":"http://www.imdb.com/name/nm0531759","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjVmOWRhZmYtZGQzNS00MTBiLTg5MTEtZGVjMjBhNzY3ZTRjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 April 1875","placeOfBirth":" Waterbury, Connecticut, USA","birthName":"Joseph Farrell MacDonald","height":"5' 10\" (1.78 m)","bio":"J. Farrell MacDonald was born on April 14, 1875 in Waterbury, Connecticut, USA as Joseph Farrell MacDonald. He was an actor and director, known for Sunrise (1927), Meet John Doe (1941) and My Darling Clementine (1946). He was married to Edith Bostwick. He died on August 2, 1952 in Hollywood, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjVmOWRhZmYtZGQzNS00MTBiLTg5MTEtZGVjMjBhNzY3ZTRjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0531759","name":"J. Farrell MacDonald","idIMDB":"nm0531759"},"actorId":"nm0531759","character":"Scotty MacKronish - Bus Driver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Archie Twitchell","urlProfile":"http://www.imdb.com/name/nm0878613","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMDVmNTQtNTI3Ny00OWUwLTk2ZWEtODY2NTIwMWIwMjViL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1906","placeOfBirth":" Pendleton, Oregon, USA","bio":"Archie Twitchell was born on November 28, 1906 in Pendleton, Oregon, USA. He was an actor, known for Young Bill Hickok (1940), Black Angel (1946) and Follow Me Quietly (1949). He died on January 31, 1957 in Pacoima, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMDVmNTQtNTI3Ny00OWUwLTk2ZWEtODY2NTIwMWIwMjViL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0878613","name":"Archie Twitchell","idIMDB":"nm0878613"},"actorId":"nm0878613","character":"Ramsey, Meteorologist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edward Gargan","urlProfile":"http://www.imdb.com/name/nm0307324","urlPhoto":"","biography":{"dateOfBirth":"17 July 1902","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"6' 2½\" (1.89 m)","bio":"Edward Gargan was born on July 17, 1902 in Brooklyn, New York City, New York, USA. He was an actor, known for Great Guy (1936), Wonder Man (1945) and Flying with Music (1942). He was married to Catherine Conlan. He died on February 19, 1964 in New York City.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0307324","name":"Edward Gargan","idIMDB":"nm0307324"},"actorId":"nm0307324","character":"Dolan, Restaurant Owner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chester Clute","urlProfile":"http://www.imdb.com/name/nm0167364","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmViMTExYWEtZjVjZi00M2Q4LTkwZjEtZmU2YjcyYTZkMTMyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 February 1891","placeOfBirth":" Orange, New Jersey, USA","birthName":"Chester Lamont Clute","bio":"Chester Clute was born on February 18, 1891 in Orange, New Jersey, USA as Chester Lamont Clute. He was an actor, known for Arsenic and Old Lace (1944), Yankee Doodle Dandy (1942) and Anchors Aweigh (1945). He was married to Eleanor Hicks. He died on April 2, 1956 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmViMTExYWEtZjVjZi00M2Q4LTkwZjEtZmU2YjcyYTZkMTMyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0167364","name":"Chester Clute","nicknames":["Chet"],"idIMDB":"nm0167364"},"actorId":"nm0167364","character":"Cornflakes Eater","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ralph Sanford","urlProfile":"http://www.imdb.com/name/nm0762596","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTVjY2ZhNTYtMTFkYS00OTFhLWIzNjQtZjY5NWE2OGRjNjZiXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 May 1899","placeOfBirth":" Springfield, Massachusetts, USA","bio":"Born on May 21, 1899 in Springfield, Massachusetts, veteran character actor Ralph Sanford came from a theatrical family. His parents were in the business, although not as actors. An actor and stage manager on the Broadway stage in the early years of his career, Sanford appeared in such productions as \"Half a Widow\" (1927), \"The Constant Sinner\" (1931) and \"Between Two Worlds\" (1934). He began his screen work in 1937 at Vitaphone Pictures working in shorts, as a burly foil to such established two-reeler comics as Shemp Howard, Roscoe 'Fatty' Arbuckle and Fritz Feld. He found steady employment in primarily unbilled bits (truck driver, guard, etc.), notably for Paramount. He upgraded to occasional featured parts in such films as Undercover Agent (1939), Wildcat (1942), A Night for Crime (1943) and My Pal Trigger (1946), but for the most part he was utilized solely in \"tough guy\" parts. He would play minor roles for other studios as well, usually typed as a two-bit gangster or hassled cop. He continued his busy schedule throughout the 1950s with TV work and had a recurring part as Jim \"Dog\" Kelly on Hugh O'Brian's The Life and Legend of Wyatt Earp (1955) series for the 1958-59 season. The heavyset actor died at the age of 64, succumbing to a heart ailment on June 20, 1963.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTVjY2ZhNTYtMTFkYS00OTFhLWIzNjQtZjY5NWE2OGRjNjZiXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0762596","name":"Ralph Sanford","idIMDB":"nm0762596"},"actorId":"nm0762596","character":"Peterson, 2nd Crew Foreman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Russell Hicks","urlProfile":"http://www.imdb.com/name/nm0382954","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDU0NWFiMjEtMTk2MS00NTIyLWE4MDEtYmM5YmQ3ZDc3NzVlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1895","placeOfBirth":" Baltimore, Maryland, USA","birthName":"Edward Russell Hicks","height":"6' 1½\" (1.87 m)","bio":"Tall, distinguished-looking Russell Hicks appeared in almost 300 films in his more than 40-year career (although his first known screen appearance was in 1915, he has screenwriting credits as early as 1913, so it's possible his screen debut was earlier than credited). His cultured bearing, grandfatherly appearance and soothing, resonant voice were perfect for the many military officers, attorneys, judges and business executives he excelled at playing. He was especially memorable in an atypical role as oily, fast-talking phony-stock salesman J. Frothington Waterbury in the W.C. Fields classic The Bank Dick (1940). Hicks made his last film in 1956, and died the next year.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDU0NWFiMjEtMTk2MS00NTIyLWE4MDEtYmM5YmQ3ZDc3NzVlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0382954","name":"Russell Hicks","idIMDB":"nm0382954"},"actorId":"nm0382954","character":"Mr. Gallagher","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0039972","urlIMDB":"http://www.imdb.com/title/tt0039972","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["58 min"],"soundMix":["Mono (RCA Sound System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["16 mm (1950s television prints)","35 mm"]},"rating":"4.8","filmingLocations":[{"location":"Republic Studios, Hollywood, Los Angeles, California, USA"}],"rated":"PASSED","awards":[],"votes":"6","type":"Movie","companyCreditsSimple":[{"idCompany":"co0020540","name":"Republic Pictures (I)"}],"keywords":{"keywords":["valley","bridge","worker","flood","construction","romantic rivalry","waiter","violence","stock footage","station wagon","slang","scot","irish","driver","destruction","death","construction work","co worker","cigarette smoking","california","cafe","bus","bus driver","bridge building","b movie","archive footage","accident","1940s"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 05:21:08"}}