{"data":{"movies":[{"title":"The Barbarian and the Geisha","originalTitle":"","year":"1958","releaseDate":"19580930","directors":[{"name":"John Huston","id":"nm0001379"}],"writers":[{"name":"Charles Grayson","id":"nm0337084"},{"name":"Ellis St. Joseph","id":"nm0820713"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDJhMWUzMTEtNDA5NC00YTU2LWFmYmUtMzQ4MmE1YTk4YWE3XkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1.jpg","countries":["USA"],"languages":["English","Japanese"],"genres":["Adventure","Drama","History","Romance"],"plot":"Townsend Harris is sent by President Pierce to Japan to serve as the first U.S. Consul-General to that country. Harris discovers enormous hostility to foreigners, as well as the love of a young geisha.","simplePlot":"Townsend Harris is sent by President Pierce to Japan to serve as the first U.S. Consul-General to that country. Harris discovers enormous hostility to foreigners, as well as the love of a ... ","actors":[{"actorName":"John Wayne","urlProfile":"http://www.imdb.com/name/nm0000078","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NDE0NzgzNl5BMl5BanBnXkFtZTcwNDMwMTUzNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1907","placeOfBirth":" Winterset, Iowa, USA","birthName":"Marion Robert Morrison","height":"6' 4\" (1.93 m)","bio":"John Wayne was born Marion Robert Morrison in Iowa, to Mary Alberta (Brown) and Clyde Leonard Morrison, a pharmacist. He was of English, Ulster-Scots, and Irish ancestry. Clyde developed a lung condition that required him to move his family from Iowa to the warmer climate of southern California, where they tried ranching in the Mojave Desert. Until the ranch failed, Marion and his younger brother Robert E. Morrison swam in an irrigation ditch and rode a horse to school. When the ranch failed, the family moved to Glendale, California, where Marion delivered medicines for his father, sold newspapers and had an Airedale dog named \"Duke\" (the source of his own nickname). He did well at school both academically and in football. When he narrowly failed admission to Annapolis he went to USC on a football scholarship 1925-7. Tom Mix got him a summer job as a prop man in exchange for football tickets. On the set he became close friends with director John Ford for whom, among others, he began doing bit parts, some billed as John Wayne. His first featured film was Men Without Women (1930). After more than 70 low-budget westerns and adventures, mostly routine, Wayne's career was stuck in a rut until Ford cast him in Stagecoach (1939), the movie that made him a star. He appeared in nearly 250 movies, many of epic proportions. From 1942-43 he was in a radio series, \"The Three Sheets to the Wind\", and in 1944 he helped found the Motion Picture Alliance for the Preservation of American Ideals, a Conservative political organization, later becoming its President. His conservative political stance was also reflected in The Alamo (1960), which he produced, directed and starred in. His patriotic stand was enshrined in The Green Berets (1968) which he co-directed and starred in. Over the years Wayne was beset with health problems. In September 1964 he had a cancerous left lung removed; in March 1978 there was heart valve replacement surgery; and in January 1979 his stomach was removed. He received the Best Actor nomination for Sands of Iwo Jima (1949) and finally got the Oscar for his role as one-eyed Rooster Cogburn in True Grit (1969). A Congressional Gold Medal was struck in his honor in 1979. He is perhaps best remembered for his parts in Ford's cavalry trilogy - Fort Apache (1948), She Wore a Yellow Ribbon (1949) and Rio Grande (1950).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1NDE0NzgzNl5BMl5BanBnXkFtZTcwNDMwMTUzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000078","name":"John Wayne","nicknames":["Duke","JW"],"idIMDB":"nm0000078"},"actorId":"nm0000078","character":"Townsend Harris","urlCharacter":"http://www.imdb.com/character/ch0199200","main":true},{"actorName":"Eiko Ando","urlProfile":"http://www.imdb.com/name/nm0027933","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzBmMDI2OTctMjdlNy00OWY1LTkzOGUtYWNkMDYyNjFiMWM2XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 May 1934","placeOfBirth":" Dairen, Manchuria, China","bio":"Eiko Ando was born on May 8, 1934 in Dairen, Manchuria, China. She is an actress, known for The Barbarian and the Geisha (1958) and The Ed Sullivan Show (1948).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzBmMDI2OTctMjdlNy00OWY1LTkzOGUtYWNkMDYyNjFiMWM2XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0027933","name":"Eiko Ando","idIMDB":"nm0027933"},"actorId":"nm0027933","character":"Okichi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Jaffe","urlProfile":"http://www.imdb.com/name/nm0415488","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3Njk3NjgwNl5BMl5BanBnXkFtZTcwNDg2MjYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 March 1891","placeOfBirth":" New York City, New York, USA","birthName":"Shalom Jaffe","height":"5' 7½\" (1.71 m)","bio":"Born Shalom Jaffe in New York City, he became known to the world as Sam Jaffe. From a Jewish family as a child he appeared in Yiddish theater productions with his mother, a well-known regional stage actress. He graduated from the City College of New York and then studied engineering at Columbia University graduate school. He began his career as a mathematics teacher in the Bronx. Around 1915 Jaffe joined the Washington Square Players. By 1918 he was no stranger to Broadway, having debuted in the original play Youth, and he appeared regularly through the 1920s, though less in the 1930s and only sporadically in the 1940s. He appeared in 21 plays on Broadway during his acting career, his final appearance in 1979. Jaffe was a method actor before it was defined and early on sported his signature shock of curly hair that some people would later misinterpret as part of some Harpo Marx characterization. Jaffe was anything but. His acting talents were considerable, and Hollywood noticed him first for the unusual role of the mad Grand Duke Peter in Josef von Sternberg 's The Scarlet Empress (1934). Frightening in his rendition of Peter, he was dispatched by the always magnificent Marlene Dietrich. Jaffe was no matinee idol but his homely features were made for unusual character roles. He did not disappoint in providing unforgettable performances. Frank Capra cast him as the mysterious High Lama in Lost Horizon (1937) (as last minute replacement; the actor originally cast had died). It would be another two years before Jaffe was once more called to Hollywood - he was back quite busy on Broadway. He appeared in George Stevens Gunga Din (1939) which sported big star names as well. Stevens gave Jaffe the lead, Gunga Din, native regimental bhisti (Hindi for water-carrier). It was probably Jaffe's most familiar film role. It was a standout part which Jaffe handled with great humanity, and the film was a huge hit. Jaffe would not appear in another film for eight years. His second of two movies in 1947 was Elia Kazan 's powerful anti-Semitic expose Gentleman's Agreement (1947) in which Jaffe played an Albert Einstein-like professor. Jaffe would play doctors of one sort or another in the handful of movies for the next few years. Then in 1950 he played a very different doctor - Doc Erwin Riedenschneider, criminal mastermind -- in John Huston's taut The Asphalt Jungle (1950). Jaffe would receive a nomination for a supporting actor Oscar for this effort. Of the three films he did in 1951, Jaffe also appeared in an Einstein-like role in the Robert Wise sci-fi classic The Day the Earth Stood Still (1951). Jaffe experienced the destructive anti-communist furor when his name was included on a listing of performers sympathetic to communism in the Red Channels pamphlet and like many, was blacklisted by the big Hollywood studios. He was considered essential by producer Julian Blaustein and Robert Wise to play Professor Jacob Barnhardt, and 20th Century Fox boss Darryl Zanuck (who had resisted much heat for Gentleman's Agreement (1947)) agreed. It was ironic that Einstein, veiled as the character Barnhardt, was a pacifist and being watched by the U.S. government at that time. There was some credence for rumors that Jaffe provided the calculus equations (mainly the gravitational force between bodies) on Barnhardt's blackboard - solved so easily by alien Michael Rennie. Jaffe didn't appear on-screen for seven years due to the punitive effects of the blacklisting. In 1958, John Huston wanted him for his very original The Barbarian and the Geisha (1958) with John Wayne, and director William Wyler also came forward later to cast him as faithful servant Simonides in the blockbuster Ben-Hur (1959). From then on Jaffe was very busy, especially with episodic TV through the 1960s which included his own recurring role as Dr. Zorba in the very popular Ben Casey (1961) series. Jaffe also appeared with his lifelong best friend, screen icon Edward G. Robinson in the made-for-TV film The Old Man Who Cried Wolf (1970) . Jaffe remained active into the year of his passing, a thoroughly engaging and unique actor and human being who never pushed his views on anyone.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3Njk3NjgwNl5BMl5BanBnXkFtZTcwNDg2MjYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0415488","name":"Sam Jaffe","idIMDB":"nm0415488"},"actorId":"nm0415488","character":"Henry Heusken","urlCharacter":"http://www.imdb.com/character/ch0199201","main":true},{"actorName":"Sô Yamamura","urlProfile":"http://www.imdb.com/name/nm0945522","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MzQzNDg2Nl5BMl5BanBnXkFtZTYwMjc2NjM3._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1910","placeOfBirth":" Tenri, Japan","birthName":"Hirosada Koga","bio":"Sô Yamamura was born on February 24, 1910 in Tenri, Japan as Hirosada Koga. He was an actor and director, known for Tora! Tora! Tora! (1970), Tokyo Story (1953) and Gung Ho (1986). He was married to Yuriko Yamamura. He died on May 26, 2000 in Suginami, Tokyo, Japan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MzQzNDg2Nl5BMl5BanBnXkFtZTYwMjc2NjM3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0945522","name":"Sô Yamamura","idIMDB":"nm0945522"},"actorId":"nm0945522","character":"Governor Tamura","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0051398","urlIMDB":"http://www.imdb.com/title/tt0051398","business":{"budget":{"money":"$3,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 45 min (105 min)"],"soundMix":["4-Track Stereo (Westrex Recording System)"],"color":["Color"],"aspectRatio":["2.55 : 1"],"camera":["Bausch & Lomb Lenses"],"laboratory":["DeLuxe"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["CinemaScope"],"printedFilmFormat":["35 mm"]},"rating":"5.5","filmingLocations":[{"location":"20th Century Fox Studios - 10201 Pico Blvd., Century City, Los Angeles, California, USA"}],"rated":"TV-G","awards":[],"votes":"1,352","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"}],"keywords":{"keywords":["japan","japanese history","intrigue","usa","tokyo japan","tokyo edo japan","shogun","samurai","japanese","japanese woman","asia","19th century","1950s","1850s","archery","xenophobia","telescope"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:24:56"}}