{"data":{"movies":[{"title":"My Lucky Stars 2: Twinkle Twinkle Lucky Stars","originalTitle":"Xia ri fu xing","year":"1985","releaseDate":"19850815","directors":[{"name":"Sammo Kam-Bo Hung","id":"nm0005033"}],"writers":[{"name":"Barry Haigh","id":"nm1691034"},{"name":"Kin Lo","id":"nm0516314"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NjQzMDU5N15BMl5BanBnXkFtZTcwNTc5OTEyMQ@@._V1.jpg","countries":["Hong Kong"],"languages":["Cantonese","English","Japanese"],"genres":["Action","Comedy"],"plot":"A police informant sent a letter containing sensitive information on an illegal drug operation to his friend, Yi-Ching. While on vacation in Thailand, the informant is assassinated by the drug lord's henchmen and, to cover-up their operation, they attempt to eliminate Yi-Ching and double-agent Lau. Back in Hong Kong, police detectives Muscles and Ricky Fung are assigned to protect Lau and Inspector Barbara Woo is assigned to protect Yi-Ching. She takes her to the hideout of the \"Five Lucky Stars\" and also enlists their help in bringing down the drug operation.","simplePlot":"A police informant sent a letter containing sensitive information on an illegal drug operation to his friend, Yi-Ching. While on vacation in Thailand, the informant is assassinated by the ... ","actors":[{"actorName":"Sammo Kam-Bo Hung","urlProfile":"http://www.imdb.com/name/nm0005033","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMTM3MzM4MzVeQTJeQWpwZ15BbWU3MDIzNjM3NzQ@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 January 1952","placeOfBirth":" Hong Kong, British Crown Colony","birthName":"Hung Kam-Bo","height":"5' 7\" (1.7 m)","bio":"Born in Hong Kong, Sammo Hung's acting career began while he was training in acrobatics, martial arts and dance as a child at the China Drama Academy, and he received acclaim for his performance with a troupe called \"The Seven Little Fortunes.\" He made his feature film debut as an actor at the age of 12, and has worked in numerous martial arts films as an actor, director, producer and/or choreographer, collaborating with Bruce Lee and Jackie Chan, two superstars of the genre. He is now internationally renowned as a pioneer and trend-setter in Hong Kong action films. Hung's big break as a film actor came with a role as a sparring partner in the Bruce Lee film Opération dragon (1973). He established his reputation as a skilled physical comedian in several kung-fu comedies, beginning with \"Enter the Fat Dragon\" (Enter the Fat Dragon (1978)). He also produced and starred in numerous successful films throughout the 1970s and 1980s for Hong Kong's leading film studio, Golden Harvest. Hung collaborated in the 1980s with long-time friend Jackie Chan in a highly successful series of action comedies that cemented Hung's reputation as a consummate actor/director and launched Chan's career as an international star. For a while, Hung also starred in an American TV series, Martial Law (1998). He directed Once Upon a Time in China and America (1997), his first film shot in the US. He and his wife, Mina, now divide their time between homes in Hong Kong and Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMTM3MzM4MzVeQTJeQWpwZ15BbWU3MDIzNjM3NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005033","name":"Sammo Kam-Bo Hung","nicknames":["Yuen Chu","Big Brother"],"idIMDB":"nm0005033"},"actorId":"nm0005033","character":"Kidstuff / Fastbuck","urlCharacter":"http://www.imdb.com/character/ch0027738","main":true},{"actorName":"Richard Ng","urlProfile":"http://www.imdb.com/name/nm0628827","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmFkN2MyZDMtNzE4OC00NWQ5LTk3MTUtOTMyYzBlMWZkNDdjXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1939","placeOfBirth":" Guangdong, China","bio":"Richard Ng was born on December 17, 1939 in Guangdong, China. He is an actor and writer, known for Lara Croft Tomb Raider: The Cradle of Life (2003), Winners & Sinners (1983) and Le flic de Hong Kong (1985).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmFkN2MyZDMtNzE4OC00NWQ5LTk3MTUtOTMyYzBlMWZkNDdjXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0628827","name":"Richard Ng","idIMDB":"nm0628827"},"actorId":"nm0628827","character":"Sandy","urlCharacter":"http://www.imdb.com/character/ch0027744","main":true},{"actorName":"Eric Tsang","urlProfile":"http://www.imdb.com/name/nm0874676","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGRjMjY5NjMtOGZiNi00M2VkLWExZjItYWRmZmI1MmQzN2Q4XkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 April 1953","placeOfBirth":" Hong Kong","birthName":"Chi-Wai Tsang","height":"5' 4\" (1.63 m)","bio":"Eric Tsang was born on April 14, 1953 in Hong Kong as Chi-Wai Tsang. He is an actor and producer, known for Infernal Affairs (2002), Infernal Affairs II (2003) and Espion amateur (2001). He was previously married to Mei-Hua Wang.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGRjMjY5NjMtOGZiNi00M2VkLWExZjItYWRmZmI1MmQzN2Q4XkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0874676","name":"Eric Tsang","idIMDB":"nm0874676"},"actorId":"nm0874676","character":"Roundhead / Blockhead","urlCharacter":"http://www.imdb.com/character/ch0027741","main":true},{"actorName":"Kiu Wai Miu","urlProfile":"http://www.imdb.com/name/nm0594226","urlPhoto":"","biography":{"dateOfBirth":"18 June 1958","placeOfBirth":" Hong Kong","birthName":"Michael Miu Kiu-wai","height":"5' 10¾\" (1.8 m)","bio":"Kiu Wai Miu was born on June 18, 1958 in Hong Kong as Michael Miu Kiu-wai. He is known for his work on My Lucky Stars 2: Twinkle Twinkle Lucky Stars (1985), Line Walker (2014) and Mu zhong wu ren (1989). He has been married to Jaime Mei Chun Chik since January 9, 1990. They have two children. He was previously married to Jaime Chik.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0594226","name":"Kiu Wai Miu","nicknames":["Sam Gaw"],"idIMDB":"nm0594226"},"actorId":"nm0594226","character":"Pagoda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stanley Sui-Fan Fung","urlProfile":"http://www.imdb.com/name/nm0298689","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYxYTE2OTctMjEwMi00YmE0LTk2ODktZjIwNTVhZjc0YjQyXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 June 1943","placeOfBirth":" Shunde, Guangdong, Republic of China","birthName":"Fung Sui-Fan","bio":"Shui-Fan Fung was born in Guangdong, China in 1945 to a Cantonese opera family. He joined show business in 1971, working with Television Broadcast Limited (TVB), where he appeared in a number of TV series. In 1976, he joined Commercial Television (CTV) as a producer and worked there until its collapse in 1978. Afterward, he returned to TVB. In addition to television, Fung appeared as an actor in scores of comedies and ghost and fantasy motion pictures in Hong Kong. One of his most notable roles was that of \"Rawhide\" in the \"Five Lucky Stars\" movie series, starring along side Sammo Kam-Bo Hung, Charlie Chin, Richard Ng, Eric Tsang and Kiu Wai Miu. The \"Five Lucky Stars\" series originated from the film Winners & Sinners (1983), where he played a different character named \"Rookie.\" The reoccurring characters of the series were introduced in the film's sequel, Le flic de Hong Kong (1985). Fung continues to appear in comedies throughout the 2000s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYxYTE2OTctMjEwMi00YmE0LTk2ODktZjIwNTVhZjc0YjQyXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0298689","name":"Stanley Sui-Fan Fung","idIMDB":"nm0298689"},"actorId":"nm0298689","character":"Rawhide","urlCharacter":"http://www.imdb.com/character/ch0027748","main":true},{"actorName":"Sibelle Hu","urlProfile":"http://www.imdb.com/name/nm0398904","urlPhoto":"","biography":{"dateOfBirth":"4 May 1958","placeOfBirth":" Taipei, Taiwan","birthName":"Hu Hui-Chung","bio":"Sibelle Hu was born on May 4, 1958 in Taiwan. She graduated from the Faculty of History of the University of Taiwan in 1981. When she was still in school, she made her film debut in Your Smiling Face (1979), which was a big hit in Hong Kong, and then went on to appear in a host of drama/romantic films from Taiwan. Hu later furthered her film career in Hong Kong, starring in mostly action films, at times taking on tough, no-nonsense police detective roles. However, she also starred in several action-comedies as well, most notably playing \"Madam Wu\" in three of the six \"My Lucky Stars\" films. Her role would be spun-off and take center stage in a different movie series called \"The Inspector Wears Skirts,\" where she trains a group of female police squad members at the Hong Kong Police Academy. Hu was seriously injured in a fire incident from a botched stunt scene while filming Raid pour l'honneur (1989). Fortunately, she received good treatment and recovered well enough to continue with her film career, appearing in movies well into the 1990s. Hu's film career phased out after she married Patrick Ho Chi-Ping, Hong Kong's former Secretary for Home Affairs. They have one daughter together.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0398904","name":"Sibelle Hu","idIMDB":"nm0398904"},"actorId":"nm0398904","character":"Swordflower / Chief Insp. Barbara Wu","urlCharacter":"http://www.imdb.com/character/ch0027749","main":true},{"actorName":"John Sham","urlProfile":"http://www.imdb.com/name/nm0762632","urlPhoto":"","biography":{"dateOfBirth":"1952","placeOfBirth":" Hong Kong, China","bio":"John Sham was born in 1952 in Hong Kong, China. He is an actor and producer, known for Winners & Sinners (1983), New Police Story (2004) and Huang jia shi jie (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0762632","name":"John Sham","idIMDB":"nm0762632"},"actorId":"nm0762632","character":"Wormgrass / Johnny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rosamund Kwan","urlProfile":"http://www.imdb.com/name/nm0263851","urlPhoto":"","biography":{"dateOfBirth":"24 September 1962","placeOfBirth":" Hong Kong","birthName":"Guan Ga Wei","height":"5' 7\" (1.7 m)","bio":"Rosamund Kwan was born on September 24, 1962 in Hong Kong as Guan Ga Wei. She is an actress, known for Once Upon a Time in China (1991), La secte du lotus blanc (1992) and Mister Dynamite (1986). She was previously married to Pierre Chen and Guosheng Wang.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0263851","name":"Rosamund Kwan","nicknames":["Gigi"],"idIMDB":"nm0263851"},"actorId":"nm0263851","character":"Wang Yi-Ching","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jackie Chan","urlProfile":"http://www.imdb.com/name/nm0000329","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MDM0MDUzM15BMl5BanBnXkFtZTcwOTI4MzU1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 April 1954","placeOfBirth":" Victoria Peak, Hong Kong","birthName":"Kong-sang Chan","height":"5' 8½\" (1.74 m)","bio":"Hong Kong's cheeky, lovable and best known film star, Jackie Chan endured many years of long, hard work and multiple injuries to establish international success via his early beginnings in Hong Kong's manic martial arts cinema industry. Jackie was born Kong-sang Chan on Hong Kong's famous Victoria Peak on April 7, 1954, to Charles and Lee-Lee Chan, and the family emigrated to Canberra, Australia, in early 1960. The young Jackie was less than successful scholastically, so his father sent him back to Hong Kong to attend the rigorous China Drama Academy, one of the Peking Opera schools. Chan excelled at acrobatics, singing and martial arts and eventually became a member of the \"Seven Little Fortunes\" performing troupe and began lifelong friendships with fellow martial artists / actors Sammo Kam-Bo Hung and Biao Yuen. Chan journeyed back and forth to visit his parents and work in Canberra, but eventually he made his way back to Hong Kong as his permanent home. In the early 1970s Chan commenced his movie career and interestingly appeared in very minor roles in two films starring then rising martial arts superstar Bruce Lee: The Chinese Connection (1972), aka \"Fist of Fury\" aka \"The Chinese Connection\", and the Warner Bros. production Opération dragon (1973). Not long after Lee's untimely death Chan was often cast in films cashing in on the success of Bruce Lee by utilizing words like \"fist\", \"fury\" or \"dragon\" in their US release titles. Chan's own film career was off and running and he swiftly appeared in many low-budget martial arts films that were churned out at a rapid fire pace by Hong Kong studios eager to satisfy the early 1970s boom in martial-arts cinema. He starred in Shaolin Wooden Men (1976) (aka \"Shaolin Wooden Men\"), Jian hua yan yu jiang nan (1977) (aka \"To Kill With Intrigue\"), Le protecteur (1978) (aka \"Half A Loaf of Kung Fu\") and Fei du juan yun shan (1978) (aka \"Magnificent Bodyguards\"), which all fared reasonably well at the cinemas. However, he scored a major breakthrough with the hit Drunken Master (1978) (aka \"Drunken Master\"), which has become a cult favorite among martial arts film fans. Not too long after this, Chan made his directorial debut with La danse du lion (1980) (aka \"The Young Master\") and then \"Enter the Dragon\" producer Robert Clouse lured Jackie to the US for a film planned to break Jackie into the lucrative US market. Battle Creek Brawl (1980) (aka \"Battle Creek Brawl\") featured Jackie competing in a \"toughest street fighter\" contest set in 1940s Texas; however, Jackie was unhappy with the end result, and it failed to fire with US audiences. In a further attempt to get his name known in the US, Jackie was cast alongside Burt Reynolds, Roger Moore and Dean Martin in the Hal Needham-directed car chase flick The Cannonball Run (1981). Regrettably, Jackie was cast as a Japanese race driver and his martial arts skills are only shown in one small sequence near the film's conclusion. Stateside success was still a few years away for Jackie Chan! Undeterred, he returned to the Orient to do what he did best--make jaw-dropping action films loaded with amazing stunt work. Chan and his legendary stunt team were unparalleled in their ability to execute the most incredible fight scenes and action sequences, and the next decade would see some of their best work. Chan paired with the dynamic Sammo Hung Kam-Bo to star in Winners & Sinners (1983) (aka \"Winners & Sinners\"), Project A (1983) (aka \"Project \"A\"), Soif de justice (1984) (aka \"Wheels On Meals\"), Le flic de Hong Kong (1985) (aka \"Winners & Sinners 2\"), My Lucky Stars 2: Twinkle Twinkle Lucky Stars (1985) (aka \"My Lucky Stars 2\", aka \"Winners & Sinners 3\"(. Chan then journeyed back to the US for another shot at that market, starring alongside Danny Aiello in The Protector (1985),) filmed in Hong Kong and New York. However, as with previous attempts, Jackie felt the US director--in this case, James Glickenhaus--failed to understand his audience appeal and the film played to lukewarm reviews and box-office receipts. Jackie did, however, decide to \"harden\" up his on-screen image somewhat and his next film, Police Story (1985) (aka \"Police Story\") was a definite departure from previously light-hearted martial arts fare, and his fans loved the final product! This was quickly followed up with the Raiders of the Lost Ark (1981)-influenced Mister Dynamite (1986) (aka \"The Armour of God\"), during filming of which Jackie mistimed a leap from a wall to a tree on location in Yugoslavia and fell many quite a few feet onto his head, causing a skull fracture. It was another in a long line of injuries that Chan has suffered as a result of doing his own stunt work, and he was soon back in front of the cameras. Project A 2 (1987) (aka \"Project A: Part 2\"), Police Story 2 (1988) (aka \"Police Story 2\"), Miracles - Mr. Canton and Lady Rose (1989) (aka \"Mr. Canton and Lady Rose)\", Armour of God 2: Operation Condor (1991) (aka \"Armour of God 2\") and Police Story 3: Supercop (1992) (aka \"Police Story 3\") were all sizable hits for Jackie, escalating his status to phenomenal heights in Asia, and to his loyal fan base around the globe. US success was now just around the corner for the the hard-working Jackie Chan, and it arrived in the form of the action film Rumble in the Bronx (1995) (aka \"Rumble In The Bronx\", though it was actually filmed in Canada) that successfully blended humor and action to make a winning formula in US theaters. Jackie did not waste any time and went to work on Police Story 4: First Strike (1996) (aka \"Police Story 4\"), Mr. Nice Guy (1997) (aka \"Mr. Nice Guy\"), Who Am I? (1998) (aka \"Who Am I\"), which all met with positive results at the international box office. Jackie then went to work in the his biggest-budget US production, starring alongside fast-talking comedian Chris Tucker in the action / comedy Rush Hour (1998). The film was a bigger hit than \"Rumble In the Bronx\" and firmly established Jackie as a bona fide star in the US. Jackie then paired up with rising talent Owen Wilson to star in Shanghai Noon (2000) and its sequel, Shanghai Knights (2003), and re-teamed with Tucker in Rush Hour 2 (2001), as well as starring in The Tuxedo (2002), Le médaillon (2003) and the delightful Around the World in 80 Days (2004). Not one to forget his loyal fan base, Jackie returned to more gritty and traditional fare with New Police Story (2004) (aka \"New Police Story\") and The Myth (2005) (aka \"The Myth\"). The multi-talented Chan (he's also a major recording star in Asia) shows no sign of slowing down and has long since moved out of the shadow of Bruce Lee, to whom he was usually compared early in his career. Chan is truly one of the international film industry's true maverick actor / director / stuntman / producer combinations - he has done it the hard way, and always his way to achieve his dreams and goals to be an international cinematic star. Off screen he has been directly involved in many philanthropic ventures providing financial assistance to schools and universities around the world. He is a UNICEF GoodWill Ambassador, and he has campaigned against animal abuse and pollution and assisted with disaster relief efforts to the 2004 Indian Ocean Tsunami victims.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MDM0MDUzM15BMl5BanBnXkFtZTcwOTI4MzU1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000329","name":"Jackie Chan","nicknames":["Y'uen Lo","Sing Lung","Pao Pao","Kung-Fu Master"],"idIMDB":"nm0000329"},"actorId":"nm0000329","character":"Muscles","urlCharacter":"http://www.imdb.com/character/ch0027736","main":true},{"actorName":"Biao Yuen","urlProfile":"http://www.imdb.com/name/nm0950707","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWMyNmQ2YzMtNTVlZC00OTI4LTg3YTUtYmUyODM3NTI1NDhkXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1957","placeOfBirth":" Hong Kong","birthName":"Hsia Ling-Jun","height":"5' 6¼\" (1.68 m)","bio":"Yuen Biao is regarded as one of the most acrobatic martial artists ever. Unfortunately, he is still underrated and not as popular as other contemporaries such as Jackie Chan, Sammo Kam-Bo Hung, and Jet Li even though he is the most critically acclaimed out of all of them and the most talented as well. And now he is receiving a cult following due to word of mouth. Born of his parents Ha Kwong-Tai (father) and Ha Sau-Ying. Yuen Biao was first enrolled in the China Drama Academy at the age of 5 (he was the youngest there). He met Sammo Kam-Bo Hung and Jackie Chan while attending the Academy. Jackie Chan took him under his wing, and they became lifelong friends. Yuen Biao stayed at the Academy until the age of 16 where he moved with Master Jim-Yuen to America. However, two years later he came back, citing there were no opportunities for Chinese martial artists to star in American films. After being in some bit part roles in films such as Stoner (1974) (aka Stoner), Shing le fantastique Mandchou (1976) (aka Hand of Death), he didn't receive his first major breakthrough role until Sammo Kam-Bo Hung cast him in Knockabout (1979) (aka Knockabout). However, his first role which gave him full exposure and established his status as a A-list star was The Prodigal Son (1981) (aka The Prodigal Son), which also starred and was directed by Sammo Kam-Bo Hung. After that, 'Jackie Chan' cast him in the classic Project A (1983) (aka Project A). After starring in some other films with Sammo Kam-Bo Hung and/or Jackie Chan, he decided to go his own way and to forge his own career to get out of the shadows of Jackie Chan and Sammo Kam-Bo Hung. He met his future wife DiDi Phang Sau-Ha in 1984 while working as a stunt coordinator on the film DiDi Phang was working on: Tai fong siu sau (1982) (aka Carry On Pickpocket). They have two children. His daughter Yi-Bui was born in 1986 and his son Ming-Tsak in 1988. The film On the Run (1988) (aka On The Run) confirmed his abilities as a brilliant actor as his portrayal as a married man seeking vengeance for his wife's brutal murder was critically acclaimed. The following year he starred in probably his best film, The Iceman Cometh (1989) (aka The Iceman Cometh), in which he starred with acclaimed actress Maggie Cheung. The film is regarded as a cult classic and is remembered not only for the fantastic fighting scenes and hilarious comedy, but also the wonderful acting of Biao Yuen and Maggie Cheung and the wonderful simmering sexual chemistry between them. After starring in the acclaimed Once Upon a Time in China (1991) (aka Once Upon a Time in China, in which most of his scenes were cut), he directed his first movie (Xi Zang xiao zi (1992). aka A Kid From Tibet), in which he also starred. In 1994, he worked for the first time in years, with Sammo Kam-Bo Hung in the gloriously titled Mou mian bei (1995) (aka Don't Give a Damn). In recent years, Yuen Biao has complained of poor scripts, so he appears in films sparsely nowadays. He also has a second home in Canada where he spends most of time pursuing his hobby of golf.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWMyNmQ2YzMtNTVlZC00OTI4LTg3YTUtYmUyODM3NTI1NDhkXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0950707","name":"Biao Yuen","nicknames":["Little Brother"],"idIMDB":"nm0950707"},"actorId":"nm0950707","character":"Ricky Fung","urlCharacter":"http://www.imdb.com/character/ch0027740","main":true},{"actorName":"Fat Chung","urlProfile":"http://www.imdb.com/name/nm0161213","urlPhoto":"","biography":{"bio":"Fat Chung is an actor and producer, known for Spooky Encounters (1980), Crime story (1993) and Magnificent Butcher (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0161213","name":"Fat Chung","idIMDB":"nm0161213"},"actorId":"nm0161213","character":"Moustached Assassin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yasuaki Kurata","urlProfile":"http://www.imdb.com/name/nm0475602","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjBmYTcxZDYtYjNjOC00ODE0LWIwMTktOGUwNDhiNTA4MGQ2XkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1946","placeOfBirth":" Ibaraki, Japan","height":"5' 8\" (1.73 m)","bio":"Yasuaki Kurata was born on March 20, 1946 in Ibaraki, Japan. He is an actor and producer, known for Fist of Legend (1994), So Close (2002) and Blood: The Last Vampire (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjBmYTcxZDYtYjNjOC00ODE0LWIwMTktOGUwNDhiNTA4MGQ2XkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0475602","name":"Yasuaki Kurata","idIMDB":"nm0475602"},"actorId":"nm0475602","character":"Japanese Assassin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Norton","urlProfile":"http://www.imdb.com/name/nm0636280","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MTQ5NTk5N15BMl5BanBnXkFtZTgwOTI5MjQxMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 January 1950","placeOfBirth":" Melbourne, Victoria, Australia","height":"6' 2\" (1.88 m)","bio":"A powerful screen presence, Richard Norton wins the applause of international audiences with his engaging ability to play either the hero or the heavy. Rare versatility and focused work ethic have enabled him to build an expanding library of almost 100 film and television titles. The disciplines that brought Norton success originated in his hometown of Croydon, Australia, and his early fascination with martial arts. By age 17 he was a karate black belt working security for nightclubs and serving as chief instructor to 500 karate schools nationwide. He landed a job as bodyguard to The Rolling Stones during the band's Australian tour and experienced his first brush with the demands of global celebrity. Norton trained with Mick Jagger in 4:00 a.m. workouts after concerts. His competency attracted a dazzling roster of other rock star clientèle including James Taylor, ABBA, Fleetwood Mac, David Bowie and Linda Ronstadt, who invited him to California as her bodyguard. Before Aussies invaded Hollywood in posses, Norton ventured there alone. A friendship with Chuck Norris brought him work in motion pictures. Norris cast Norton as the lethal Kyo, a masked ninja, in The Octagon (1980), and their grueling final combat endures as a classic cinematic fight scene. Director Robert Clouse chose Norton to be one of the ensemble heroes in Force: Five (1981), an international hit, and the young martial artist's career in movies took off. His reputation for stellar performances emerged largely from high-energy Hong Kong films directed by Sammo Kam-Bo Hung and starring Jackie Chan in the mid-'80s. Muscular charisma made Norton the perfect Anglo bad boy for My Lucky Stars 2: Twinkle Twinkle Lucky Stars (1985) and Shanghai Express (1986). Taking the hits of his screen adversaries in those films earned Norton more Hong Kong work and, notably, Chan's abiding respect. Richard calls Jackie \"the maestro of martial arts movies.\" Jackie has returned the compliment by recruiting Norton as one of just two Western actors to perform in several of his Hong Kong-based productions, including the comedic cult favorite Cheng shi nu lie ren (1993) and the darker Mr. Nice Guy (1997), directed by Hung. Hung encouraged Norton to play the \"Guy\" nemesis, a well-heeled gangster, with eccentric edginess. Norton embraced the direction and delivered one of the best co-starring performances in all of Chan's films. The success of Norton's Hong Kong work made him an established star in action films and a frequent cover subject for global martial arts and movie magazines. His collaborations with Cynthia Rothrock catapulted them to a level of fame that inspired a British magazine to deem them the Fred Astaire and Ginger Rogers of martial arts movies. The recurring partners produced two Rage and Honor (1992) movies, besides co-starring in China O'Brien (1990) and Lady Dragon (1992), among other titles. They reunited for Redemption (2002) with 'Don 'The Dragon' Wilson'. Norton nurtured his leading man status in crime dramas, MIA pictures and futuristic adventures that often featured his real-life training partners in supporting roles, such as Chuck Jeffreys in Rage (1994) and Benny Urquidez in The Fighter (1989). With standout performances in Sword of the Bushido (1990) and Iron Fist (1995), Norton displayed his attraction to heroes with dimensions, even flaws, that force them into action. His style of action incorporates the humor essential to humanizing a hero. It is the dark comedy in Mind Games (2003), directed by Adrian Carr, that enables Norton to triumph in another well-textured role as a suspicious Texan, demonstrating that he takes risks as an actor who ventures beyond action genres. Norton's credits behind the camera have become as diverse as his screen roles. Apart from acting and producing, he is a sought-after stunt/fight coordinator, choreographing action in films such as Nomad: The Warrior (2005), produced by Milos Forman, and Devil's Pond (2003), with Tara Reid and Kip Pardue. Despite a busy career, he continues to achieve black belts in the martial arts, always a motivating force for Norton's accomplishments","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MTQ5NTk5N15BMl5BanBnXkFtZTgwOTI5MjQxMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0636280","name":"Richard Norton","nicknames":["King Richard; Richard the Lionhearted"],"idIMDB":"nm0636280"},"actorId":"nm0636280","character":"Caucasian Assassin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andy Lau","urlProfile":"http://www.imdb.com/name/nm0490489","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQzNDkxMjMxMl5BMl5BanBnXkFtZTYwMzMzODA3._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 September 1961","placeOfBirth":" Tai Po, Hong Kong","birthName":"Lau Fok Wing","height":"5' 9\" (1.75 m)","bio":"Andy Lau Tak-wah, (born 27 September 1961) is a Hong Kong actor, singer-songwriter, presenter, and film producer. Lau has been one of Hong Kong's most commercially successful film actors since the mid-1980s, performing in more than 160 films while maintaining a successful singing career at the same time. In the 1990s, Lau was branded by the media as one of the Four Heavenly Kings of Cantopop. Lau was entered into the Guinness World Records for the \"Most Awards Won by a Cantopop Male Artist\". By April 2000, he had already won a total unprecedented 292 awards. In 2005, Lau was awarded \"No.1 Box office Actor 1985-2005\" of Hong Kong, yielding a total box office of HKD 1,733,275,816 for shooting 108 films in the past 20 years. In 2007, Lau was also awarded the \"Nielsen Box Office Star of Asia\" by the Nielsen Company.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQzNDkxMjMxMl5BMl5BanBnXkFtZTYwMzMzODA3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0490489","name":"Andy Lau","nicknames":["Wah Jai"],"idIMDB":"nm0490489"},"actorId":"nm0490489","character":"Associate of Muscles","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wu Ma","urlProfile":"http://www.imdb.com/name/nm0943138","urlPhoto":"","biography":{"dateOfBirth":"18 August 1942","placeOfBirth":" Tianjin, China","birthName":"Hung-Yuan Feng","height":"5' 6\" (1.68 m)","bio":"Wu Ma was born on August 18, 1942 in Tianjin, China as Hung-Yuan Feng. He was an actor and director, known for Histoire de fantômes chinois (1987), Once Upon a Time in China (1991) and Miracles - Mr. Canton and Lady Rose (1989). He was married to Ma Yan. He died on February 4, 2014 in China.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0943138","name":"Wu Ma","idIMDB":"nm0943138"},"actorId":"nm0943138","character":"Magic Expert","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0090342","urlIMDB":"http://www.imdb.com/title/tt0090342","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 45 min (105 min)","1 hr 29 min (89 min) (UK)","1 hr 30 min (90 min) (Sweden)","1 hr 34 min (94 min) (Hong Kong)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.4","filmingLocations":[{"location":"Hong Kong, China"}],"rated":"TV-14","awards":[],"votes":"2,661","type":"Movie","companyCreditsSimple":[{"idCompany":"co0066816","name":"Bojon Films Company Ltd."},{"idCompany":"co0015592","name":"Golden Harvest Company"},{"idCompany":"co0069083","name":"Paragon Films Ltd."}],"keywords":{"keywords":["pretending to be blind","fight","fighting","violence","action violence","chinaman","asian","tough cop","kung fu fighting","kung fu","wing chun","hand to hand combat","fistfight","brawl","police officer","chop socky","martial arts"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:27:11"}}