{"data":{"movies":[{"title":"Trent's Last Case","originalTitle":"","year":"1929","releaseDate":"19290331","directors":[{"name":"Howard Hawks","id":"nm0001328"}],"writers":[{"name":"E.C. Bentley","id":"nm0072805"},{"name":"Malcolm Stuart Boylan","id":"nm0102167"}],"runtime":"66 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmRlNGNjNTItMjk5OS00MTJjLTk4MWUtM2U1Y2I2NmIwOTIxXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Mystery"],"simplePlot":"","actors":[{"actorName":"Raymond Griffith","urlProfile":"http://www.imdb.com/name/nm0341586","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMzU3NDY0NV5BMl5BanBnXkFtZTgwMjk5NDc0MzE@._V1._CR109,139,534,721_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1895","placeOfBirth":" Boston, Massachusetts, USA","height":"5' 6\" (1.68 m)","bio":"Raymond Griffith was born on January 23, 1895 in Boston, Massachusetts into a theatrical family. His parents, James Henry Griffith and Mary Guichard, were both actors, as were his grandfather, Gerald Griffith, and his great grandfather, Thomas Griffith. Young Raymond made his stage debut when he was 15 months old and by the age of seven played the eponymous lead in \"Little Lord Fauntleroy.\" By the time he was eight, he was playing a female role in \"Ten Nights in a Barroom.\" A childhood case of respiratory diphtheria permanently damaged his vocal chords, and when he was a young boy, Raymond lost his voice while playing a part in \"The Witching Hour.\" \"Photoplay\" magazine's May 1925 issue reported that his voice went out while he was letting out a scream as his character was about to be beaten, as was required by the script. \"The audience heard a piercing shriek from the boy as he cringed before the whip. That was all. The terror on the boy's face was the terror of realism; he was stricken dumb. He could not speak a line after that scream. He has never spoken a line from the stage since then. His recovery was so gradual that he could not speak above a whisper for years, and he has never recovered the full carrying power, which the stage demands.\" The loss of voice was permanent. No longer able to act, Raymond joined a circus, then worked as a dancer and dance teacher at New York City's Grand Central Palace. He subsequently joined the vaudeville circuit, eventually undertaking a European tour with a company of French pantomimists. Eventually, he joined the U.S. Navy in 1910, when he was 15 years old, and served a two year hitch. Many sources claim his both year as 1890, which likely is the date he gave the Navy in order to enlist. It has been claimed that after his discharge, he went to California in 1914 where he was hired as an extra by Vitagraph while visiting a friend on a set. Another story has him arriving in California as part of a vaudeville tour and staying to appear in the movies, getting his first job with Kalem in 1915. What is known for sure is that he was working for the L-KO Motion Picture Kompany in 1915, and that he left the studio in early 1916 to work for Mack Sennett, probably primarily as a gag man and scenario writer, though he did perform in Sennett's comedy shorts. Except for a brief stay at Fox, Griffith worked for Sennett until moving to Triangle in 1917, where he worked as a movie comedian as well as a gagman and scenario writer. Drafted for service in World War I, Griffith was not inducted because of his vocal problems. Griffith returned to Sennett in 1918, and stayed with him for three years. Eventually, he did less acting and focused more on scenario writing. Leaving Sennett in June 1921 for Marshall Neilan, Griffith returned to acting. The association with Neilan lasted until the Fall of 1922, when he signed with Goldwyn Pictures. Griffith's first movie for his new studio was the mystery-melodrama \"Red Lights\" (1924). He appeared in Tod Browning's \"The Day of Faith (1923)\" with Eleanor Boardman and 'Tyrone Power, Sr.' and \"The White Tiger\" (1923) with Priscilla Dean and Wallace Beery for Goldwyn, though the latter film was ultimately released by Universal. After the Browning picture, Griffith made just one more movie for Goldwyn, \"Nellie, the Beautiful Cloak Model\" (1924) with Hobart Bosworth and Mae Busch before signing on with Famous Players-Lasky (Paramount). During his Goldwyn period, Griffith created an acting style uniquely his own that was a hybrid of the comedic and the dramatic. In his Goldwyn films he played detectives & journalists and characters not entirely on the side of the law. His characters were not explicitly comic, but the characterizations were infused with Griffith's panache, spiced with comic business that occasionally crossed the threshold into slapstick. The style often tipped the scenarios over into farce. It was this style that attracted the attention of Paramount. The first movie Griffith made at Paramount was Cecil B. DeMille's \"Changing Husbands\" (1924). His turn in \"Paths to Paradise\" (1925) won him the highest critical praise, and \"Screenland\" predicted that he would soon become Charles Chaplin's top rival. In 1926, he made the Civil War comedy \"Hands Up!\" (1926) that is widely considered his best comedy. Movie critic Walter Kerr wrote in his 1975 book \"The Silent Clowns \"'Hands Up!' contains some work that is daring ­for its period, certainly ­ and some that is masterfully delicate, the work of an inventive, unaggressive, amiably iconoclastic intelligence.\" He continued to do highly praised work in 1926, but his two films of 1927 failed to engender positive reviews. Griffith and Paramount subsequently terminated his contract \"by mutual consent.\" On January 8, 1928, Raymond Griffith married the stage and film actress Bertha Mann, and they spent a six-month honeymoon in Europe. Griffith didn't appear in any movies in 1928, although he reportedly had several projects in development, including one with 'Howard Hughes' (qv. The couple's first child, Raymond, Jr., tragically was stillborn on June 6, 1929. They had a second child, Michael, who was born on July 16, 1931, and adopted a daughter, Patricia, in 1933. They were married almost 29 years, until Griffith's death. When Griffith returned to movie-making, he was faced with the prospect of sound. He soldiered on despite his vocal handicap, and made two sound short subjects in 1929. Alas, it was impossible to be a featured actor in the new medium with a voice that barely rose above a whisper. He made one last appearance, uncredited, as the French soldier whom Lew Ayres mortally wounds and then shares his shell-hole for the night in the classic All Quiet on the Western Front (1930). Because of his wounds, the French soldier cannot speak above a whisper, which enabled Griffith to play the role. The scene, in which the French soldier slowly dies, is made harrowing and haunting by Griffith's performance. Griffith's final appearance onscreen turned out to be one of the most memorable in movie history. Griffith retired from acting, but not from the movies. He continued to work in the movie industry as a production supervisor and associate producer. Raymond Griffith was dining at Los Angeles' Masquers Club, a private establishment for actors and producers, on November 25, 1957, when he choked on some food and died of asphyxia. He was 62 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMzU3NDY0NV5BMl5BanBnXkFtZTgwMjk5NDc0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341586","name":"Raymond Griffith","nicknames":["Silk Hat Harry","Ray"],"idIMDB":"nm0341586"},"actorId":"nm0341586","character":"Philip Trent","urlCharacter":"http://www.imdb.com/character/ch0085449","main":true},{"actorName":"Marceline Day","urlProfile":"http://www.imdb.com/name/nm0206496","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NzI2MjYzNF5BMl5BanBnXkFtZTcwNjM0NTUyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1908","placeOfBirth":" Colorado Springs, Colorado, USA","birthName":"Marceline Newlin","height":"5' 3\" (1.6 m)","bio":"The younger sister of actress Alice Day, Marceline Day achieved stardom in the mid-'20s, appearing opposite such stars as John Barrymore and Lon Chaney. Adept at comedy, she also starred with such top comics as Buster Keaton and Harry Langdon. Her career faltered in the early '30s, however, and she was soon reduced to appearing in low-budget thrillers and action pictures. She retired in the mid-'30s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NzI2MjYzNF5BMl5BanBnXkFtZTcwNjM0NTUyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0206496","name":"Marceline Day","idIMDB":"nm0206496"},"actorId":"nm0206496","character":"Evelyn Manderson","urlCharacter":"http://www.imdb.com/character/ch0085451","main":true},{"actorName":"Raymond Hatton","urlProfile":"http://www.imdb.com/name/nm0369058","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzZjODYwYTktNjVkMC00MmJiLTk5ZmEtNjg5MzNiOWZlZmQyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 July 1887","placeOfBirth":" Red Oak, Iowa, USA","birthName":"Raymond William Hatton","height":"5' 7\" (1.7 m)","bio":"The son of a physician, Raymond Hatton entered films in 1909, eventually appearing in almost 500 other pictures. In early silents he formed a comedy team with big, burly Wallace Beery. He was best known as the tobacco-chewing, rip-snorting Rusty Joslin in the Three Mesquiteers series. He was also in the Rough Riders series and appeared as Johnny Mack Brown's sidekick as well. His last Western was, fittingly, Requiem for a Gunfighter (1965).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzZjODYwYTktNjVkMC00MmJiLTk5ZmEtNjg5MzNiOWZlZmQyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0369058","name":"Raymond Hatton","idIMDB":"nm0369058"},"actorId":"nm0369058","character":"Joshua Cupples","urlCharacter":"http://www.imdb.com/character/ch0085461","main":true},{"actorName":"Donald Crisp","urlProfile":"http://www.imdb.com/name/nm0187981","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNjk0MDI0M15BMl5BanBnXkFtZTcwNjUwNTYwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1882","placeOfBirth":" Bow, London, England, UK","birthName":"George William Crisp","height":"5' 8½\" (1.74 m)","bio":"Donald Crisp was born George William Crisp at the family home in Bow, London. Donald's parents were James Crisp and Elizabeth Crisp, his birth was registered by his mother on 4th September 1882. Donald's sisters were Elizabeth, Ann, Alice (known as Louisa) and Eliza and his brothers were James, John and Mark. Family memories state that Donald's brother-in-law James Needham (Louisa's husband) lent/gave Donald the fare to USA. The family have a photo of Donald which he sent to 'Jimmy' and signed. On 16th February 1937 Donald applied for a US Social Security account number giving his address as N Vista Street Hollywood California, and his employers Warner Brothers Pictures Burbank California. On his application Donald did not know his mother's maiden name.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNjk0MDI0M15BMl5BanBnXkFtZTcwNjUwNTYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0187981","name":"Donald Crisp","idIMDB":"nm0187981"},"actorId":"nm0187981","character":"Sigsbee Manderson","urlCharacter":"http://www.imdb.com/character/ch0085452","main":true},{"actorName":"Lawrence Gray","urlProfile":"http://www.imdb.com/name/nm0336770","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2JiNzAxZWItZGE4NC00MGYzLTg2YWQtOWY1M2FiMjEwNzI0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 July 1898","placeOfBirth":" San Francisco, California, USA","bio":"Lawrence Gray was born on July 28, 1898 in San Francisco, California, USA. He was an actor, known for The Florodora Girl (1930), The Patsy (1928) and Stage Struck (1925). He was married to Mayme. He died on February 2, 1970 in Mexico City, Mexico.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BM2JiNzAxZWItZGE4NC00MGYzLTg2YWQtOWY1M2FiMjEwNzI0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0336770","name":"Lawrence Gray","idIMDB":"nm0336770"},"actorId":"nm0336770","character":"Jack Marlowe","urlCharacter":"http://www.imdb.com/character/ch0085456","main":true},{"actorName":"Nicholas Soussanin","urlProfile":"http://www.imdb.com/name/nm0816007","urlPhoto":"","biography":{"dateOfBirth":"16 January 1889","placeOfBirth":" Yalta, Taurida Governorate, Russian Empire [now Crimea, Ukraine]","bio":"Nicholas Soussanin was born on January 16, 1889 in Yalta, Taurida Governorate, Russian Empire. He was an actor and writer, known for The Last Command (1928), Hotel Imperial (1927) and The Spotlight (1927). He was married to Olga Baclanova. He died on April 27, 1975 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0816007","name":"Nicholas Soussanin","idIMDB":"nm0816007"},"actorId":"nm0816007","character":"Martin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anita Garvin","urlProfile":"http://www.imdb.com/name/nm0308793","urlPhoto":"","biography":{"dateOfBirth":"11 February 1906","placeOfBirth":" New York City, New York, USA","height":"5' 6\" (1.68 m)","bio":"Dark-haired beauty, best known for her portrayals of a shrewish wife in Laurel (Stan Laurel) & Hardy (Oliver Hardy) films. Retired in the early 1940's.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0308793","name":"Anita Garvin","idIMDB":"nm0308793"},"actorId":"nm0308793","character":"Ottilie Dunois","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edgar Kennedy","urlProfile":"http://www.imdb.com/name/nm0448012","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDE0ZDdlZjktYjVhYi00Y2I0LTk0YjAtZjExZjgzYjc5MTQ2XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR7,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1890","placeOfBirth":" Lake San Antonio, Monterey County, California, USA","birthName":"Edgar Livingstone Kennedy","height":"6' 1\" (1.85 m)","bio":"Edgar Kennedy, who was born on April 26, 1890, near Monterey, California, hit the road as a young man and traveled across the country, working in a succession of jobs. He became a professional boxer, claiming to have gone 14 rounds against The Manassas Mauler, Jack Dempsey. In addition to his knowledge of the \"Sweet Science\", Kennedy possessed a good musical voice, and wound up singing in musical shows in the Midwest, his first taste of show business. During his cross-country peregrinations he wound up in Los Angeles, and found himself hired as an actor by comedy producer Mack Sennett. At the Sennett Studios he was allegedly one of the original Keystone Kops, but soon graduated from bit parts to supporting roles in Keystone comedies, including Tillie's Punctured Romance (1914) with Charles Chaplin. Kennedy had good roles in other Chaplin movies, but when his contract expired in 1921 he went freelance, though he did occasionally return to Sennett. After leaving Sennett Kennedy established himself as a first-rate supporting comic, and made a career out of playing harassed businessmen, next-door neighbors, cops, etc. By the late 1920s his craft was most prominently featured in comedies for Hal Roach, Sennett's arch-rival, where he flourished in support of Stan Laurel and Oliver Hardy. It was with Roach that he developed his mastery of the \"slow burn\", a routine for which he became famous. He often played a none-too-bright policeman brought to the boiling point by the absurdities of Laurel and Hardy. He also directed the two in From Soup to Nuts (1928) and You're Darn Tootin' (1928). RKO hired Kennedy to appear in a series of comedy shorts called \"The Average Man,\" in which he played the head of a family. The shorts had very tight shooting schedules, often as few as three days, but Kennedy was always a pro and delighted the audience by giving them his all. He made over 200 short subjects and appeared in over 100 feature films, still in demand right up to the day he died of cancer on November 9, 1948.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDE0ZDdlZjktYjVhYi00Y2I0LTk0YjAtZjExZjgzYjc5MTQ2XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0448012","name":"Edgar Kennedy","nicknames":["King of the Slow Burn","Master of the Slow Burn"],"idIMDB":"nm0448012"},"actorId":"nm0448012","character":"Inspector Murch","urlCharacter":"http://www.imdb.com/character/ch0085470","main":true}],"seasons":[],"idIMDB":"tt0020513","urlIMDB":"http://www.imdb.com/title/tt0020513","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 6 min (66 min)"],"soundMix":["Mono (Western Electric Sound System) (musical score and sound effects)","Silent"],"color":["Black and White"],"aspectRatio":["1.20 : 1"],"camera":null,"laboratory":null,"filmLength":["1,770.6 m (6 reels) (silent version)","1,778.2 m (6 reels) (sound version)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.1","filmingLocations":[],"awards":[],"votes":"37","type":"Movie","companyCreditsSimple":[{"idCompany":"co0028775","name":"Fox Film Corporation"}],"keywords":{"keywords":["detective","suicide","melodrama","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:55:47"}}