{"data":{"movies":[{"title":"Tarzan's Savage Fury","originalTitle":"","year":"1952","releaseDate":"19520314","directors":[{"name":"Cy Endfield","id":"nm0256831"}],"writers":[{"name":"Cyril Hume","id":"nm0401738"},{"name":"Hans Jacoby","id":"nm0414989"}],"runtime":"81 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MzA3OTYwNF5BMl5BanBnXkFtZTcwMTE1MDAyMw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure"],"plot":"Tarzan's cousin comes to Africa in hopes that Tarzan will help him secure a fortune in diamonds essential to England's military security. The cousin is immediately killed off by his guide Rokov who persuades Edwards to impersonate the cousin. Joey (Boy's substitute) was used by natives as crocodile bate until Tarzan rescued him.","simplePlot":"Tarzan acts as a guide for two British government agents recently arrived in Africa to secure a great cache of diamonds for the English military. However, the agents are not what they seem.","actors":[{"actorName":"Lex Barker","urlProfile":"http://www.imdb.com/name/nm0000851","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MDc5OTM5NV5BMl5BanBnXkFtZTcwMTAxOTUyOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 May 1919","placeOfBirth":" Rye, New York, USA","birthName":"Alexander Crichlow Barker Jr.","height":"6' 4\" (1.93 m)","bio":"Barker was a direct descendant of the founder of Rhode Island, Roger Williams, and of Sir 'William Henry Crichlow', historical governor general of Barbados. He excelled in football and track at Fessenden School and Phillips-Exeter Academy. He went to Princeton but left to become an actor. A year later he was spotted in summer stock and received a contract offer from 20th Century Fox. World War II intervened; he enlisted as an infantry private and rose to the rank of major. Though later signed by Fox and then Warner, he was too tall for supporting parts and too unknown for leads. Tarzan's Magic Fountain (1949) (RKO) provided his first starring role. After five Tarzans he went into other adventure films. After 16 non-Tarzan films, mostly westerns, he went to Europe in 1957 (he spoke French, Spanish, Italian, and German). He went on to make more than 50 more films all over the world: Brazil, Germany, Spain, Yugoslavia, Italy, Lebanon, France. He became very popular in Germany because of his role as \"Old Shatterhand,\" \"Kara Ben Nemsi,\" and \"Dr. Karl Sternau\" in the movies based on books written by Karl May, a very popular author for adventure literature in Germany. Nearly every child in Germany knows some of his books. He won Germany's Bambi Award as Best Foreign Actor of 1966.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MDc5OTM5NV5BMl5BanBnXkFtZTcwMTAxOTUyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000851","name":"Lex Barker","nicknames":["Sexy Lexy"],"idIMDB":"nm0000851"},"actorId":"nm0000851","character":"Tarzan","urlCharacter":"http://www.imdb.com/character/ch0007728","main":true},{"actorName":"Dorothy Hart","urlProfile":"http://www.imdb.com/name/nm0366253","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyMzQxNDAyMjFeQTJeQWpwZ15BbWU3MDgzMzQ3MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1922","placeOfBirth":" Cleveland, Ohio, USA","bio":"A former model, the luminously beautiful Dorothy Hart was signed to a contract by Universal Pictures after having made only one film, Columbia's Gunfighters (1947). However, the studio system couldn't quite find a place for a woman with her carriage and elegance, and relegated her to westerns, costume dramas, prison sagas, Tarzan movies, and such dreck as I Was a Communist for the FBI (1951). She grew to detest Hollywood, left the film business in 1952, moved to New York and did occasional guest spots on TV dramas and game shows. She was very active in working through the United Nations for the world's children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyMzQxNDAyMjFeQTJeQWpwZ15BbWU3MDgzMzQ3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0366253","name":"Dorothy Hart","idIMDB":"nm0366253"},"actorId":"nm0366253","character":"Jane","urlCharacter":"http://www.imdb.com/character/ch0007726","main":true},{"actorName":"Patric Knowles","urlProfile":"http://www.imdb.com/name/nm0461549","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NjYzOTA2Nl5BMl5BanBnXkFtZTcwNjgwODExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 November 1911","placeOfBirth":" Horsforth, Yorkshire, England, UK","birthName":"Reginald Lawrence Knowles","height":"6' 2\" (1.88 m)","bio":"Fourteen-year-old Reginald Lawrence Knowles was being readied to take his place with other relatives in the family bookbinding business (in Leeds) when he ran off to become an actor. He was inevitably brought back home, but he made good his second escape a few years later - his willful Knowles Yorkshire origin would not be denied. What stage experience he had amounted to a few seasons in regional theater, but he started in British sound films early (1932), calling himself Patric Knowles. He was the proverbial tall, dark and handsome type and headed for romantic lead roles. He rose slowly rose up the ranks of featured players in an array of 14 British films that included one of director Michael Powell's early successes, The Girl in the Crowd (1935). The last of his British efforts was Crown v. Stevens (1936) which, being a British Warner Bros. production, was scouted for the studio's Hollywood home base. This and a few previous films that year were lead vehicles for Knowles, and for this last he was recommended for a Hollywood contract. His first American effort was the big-screen soap opera Give Me Your Heart (1936) with notable Warner players, in which he played a noble cad. His chance for a more romantic introduction came later in the year with The Charge of the Light Brigade (1936), where he joined an already popular new Angle face, Errol Flynn. Knowles played his younger brother in this well received bit of revisionist historical drama. Through the remainder of the 1930s Knowles had a few leads with second-tier featured stars, but more often he was second lead as strait-laced but engaging in comedies as well as dramas. There were other films with Flynn, most notably the classic The Adventures of Robin Hood (1938) in which he played Will Scarlett (in bright red jerkin). Knowles was a licensed private pilot and during free time provided some white-knuckle moments for Flynn, whose on-screen derring-do cloaked several phobias including vertigo. Knowles preferred freelancing to the confinement of long contract associations--one means of dodging the pitfall of being typecast. He was at RKO to play - with great verve - the shallow and rich playboy on the ill-fated plane of Five Came Back (1939). At Twentieth Century-Fox he played - very effectively - one of the big brothers of the Morgan family in the classic How Green Was My Valley (1941). Of course, freelancing could also lead to typecasting. Knowles parked himself at Universal in 1943, condemned to play clean-up hero in its formula horror films, such as The Wolf Man (1941) and the less engaging Frankenstein Meets the Wolf Man (1943). He also had to endure straight man duty to the insipid antics of Bud Abbott and Lou Costello, among other indignities suffered as a utility player at Universal. He continued through the 1940s to 1951 with a mix of capable first and second lead roles with other studios, but that somewhat bored and deepening grimness on his face perhaps reflected frustration with typecast characters, as well as the realization that big fame would never come his way. He continued to be game, though, and fairly leaped at the new live playhouse theater phenomenon of early television. Along with one or two movies a year, he worked in this pioneering small screen theater starting in 1951. He also embraced episodic TV and made the rounds of the popular western and private eye shows of the period. Big- and small-screen work gradually tapered off for him through the 1960s. In the late part of the decade he was playing dignified military officers, such as Lord Mountbatten in the hit The Devil's Brigade (1968). He spent time doing college lecturing, commercials, and wrote a novel called \"Even Steven.\" Retiring to the north end of the San Fernando Valley in Woodland Hills, Knowles was close to the Motion Picture Country Home in Calabasas, where he spent much time volunteering to help with the various functions provided for the many elderly show business people, many of whom had not been as fortunate as Knowles to have graced nearly 125 film efforts.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0NjYzOTA2Nl5BMl5BanBnXkFtZTcwNjgwODExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0461549","name":"Patric Knowles","nicknames":["Pat"],"idIMDB":"nm0461549"},"actorId":"nm0461549","character":"Edwards, English Traitor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Korvin","urlProfile":"http://www.imdb.com/name/nm0466814","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTNkY2Y2NGQtNDU5Ni00YTBhLTk4MjEtZjliMmFmODYyZjk4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 November 1907","placeOfBirth":" Piestany, Austria-Hungary [now Piestany, Slovakia]","birthName":"Geza Korvin Karpathi","height":"6' (1.83 m)","bio":"He was born in Piestany, Hungary, and came to the United States in 1940 after ten years studying at the Sorbonne where he worked in still and motion picture photography. After studying acting at the Barter Theater (Abingdon, VA), he made his 1943 debut on Broadway in \"Dark Eyes\" under the name Geza Korvin. It was then than movie producer Charles K. Feldman signed him to a contract with Universal. There, with the new name Charles Korvin, he played the title role, a French thief, in \"Enter Arsene Lupin\" (1944). His next three movies paired him romatically with Merle Oberon. After a contract disupte with Universal, and though blacklisted by HUAC in 1951, he played a number villain, thief and philanderer roles for different studios, including the part of the evil Russian agent Rokov in Lex Barker's \"Tarzan's Savage Fury\" (1952). He also appeared in many TV episodes, notably as The Eagle in the \"Zorro\" series (1957) and as the Latin dance instructor Carlos in \"The Honeymooners\". He returned to Hollywood in Stanley Kramer's \"Ship of Fools\" (1965). He had homes in Manhattan and Klosters, Switzerland, and died, aged 90, at the Lenox Hill Hospital in Manhattan, survived by his wife, Natasha; a daughter, Katherine Pers of Budapest; a son, Edward Danziger Dorvin of Santa Monica, CA; and three grandchildren.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTNkY2Y2NGQtNDU5Ni00YTBhLTk4MjEtZjliMmFmODYyZjk4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0466814","name":"Charles Korvin","idIMDB":"nm0466814"},"actorId":"nm0466814","character":"Rokov, Russian Agent","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tommy Carlton","urlProfile":"http://www.imdb.com/name/nm0138234","urlPhoto":"","biography":{"dateOfBirth":"1941","placeOfBirth":"","bio":"Tommy Carlton was born in 1941. He was an actor, known for Tarzan's Savage Fury (1952). He died on January 1, 2009 in Denver, Colorado, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0138234","name":"Tommy Carlton","idIMDB":"nm0138234"},"actorId":"nm0138234","character":"Joseph 'Joey' Martin","urlCharacter":"http://www.imdb.com/character/ch0067808","main":true}],"seasons":[],"idIMDB":"tt0045220","urlIMDB":"http://www.imdb.com/title/tt0045220","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 21 min (81 min)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["2,204 m (Netherlands)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.9","filmingLocations":[{"location":"Iverson Ranch - 1 Iverson Lane, Chatsworth, Los Angeles, California, USA"}],"rated":"APPROVED","awards":[],"votes":"280","type":"Movie","companyCreditsSimple":[{"idCompany":"co0027170","name":"Sol Lesser Productions"}],"keywords":{"keywords":["tarzan","diamond","impostor","guide","desert","jungle","africa","witch doctor","native chief","river","raft","rifle","russian","prisoner","safari","uncut diamond","treasure","deception","treachery","chimp","expedition","stock footage","damsel in distress","held at gunpoint","b movie","series","bare chested male","sequel","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:59:33"}}