{"data":{"movies":[{"title":"Histoire de fantômes chinois","originalTitle":"Sien nui yau wan","year":"1987","releaseDate":"19881228","directors":[{"name":"Siu-Tung Ching","id":"nm0155642"}],"writers":[{"name":"Songling Pu","id":"nm0699700"},{"name":"Kai-Chi Yuen","id":"nm0950699"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MDk0Mzk5MF5BMl5BanBnXkFtZTcwMDg2NDE2MQ@@._V1.jpg","countries":["Hong Kong"],"languages":["Cantonese"],"genres":["Action","Comedy","Fantasy","Romance","Thriller"],"plot":"Ning Tsai-Shen, a humble tax collector, arrives in a small town to carry out his work. Unsurprisingly, no-one is willing to give him shelter for the night, so he ends up spending the night in the haunted Lan Ro temple. There, he meets Taoist Swordsman Yen Che-Hsia, who warns him to stay out of trouble, and the beautiful Nieh Hsiao-Tsing, with whom he falls in love. Unfortunately, Hsiao-Tsing is a ghost, bound for all eternity by a hideous tree spirit with an incredibly long tongue that wraps itself round its victims and sucks out their life essence (or 'yang element')...","simplePlot":"Ning Tsai-Shen, a humble tax collector, arrives in a small town to carry out his work. Unsurprisingly, no-one is willing to give him shelter for the night, so he ends up spending the night ... ","actors":[{"actorName":"Leslie Cheung","urlProfile":"http://www.imdb.com/name/nm0002000","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyODY4MDM1N15BMl5BanBnXkFtZTcwOTcxMjM5MQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1956","placeOfBirth":" Hong Kong","birthName":"Cheung Kwok Wing","height":"5' 9\" (1.75 m)","bio":"Leslie Cheung was the youngest of 10 children. His father was tailor to the late William Holden. Leslie's parents divorced when he was young, and he claims this is one reason for his disinterest in marriage. Following graduation from secondary school, he studied at Leeds University in Great Britain. Upon his return to Hong Kong, he entered the 1976 ATV Asian Music Contest, where he took second prize. He went on to perform on stage, television and in teeny-bopper movies. It wasn't until he was cast in the role of \"Kit\" in John Woo's A Better Tomorrow (1986) that his acting career took off; he has since performed in some of the best-known Hong Kong movies of the last decade, working under the direction of such directors as Kaige Chen, Kar-Wai Wong, Hark Tsui and, of course, Woo. Leslie emigrated to Canada in 1992, but soon returned to Hong Kong, demonstrating his intention to remain past the 1997 handover of Hong Kong to China through his purchase of real estate and opening of a coffee shop in the colony. Leslie jumped from the landmark Mandarin Oriental hotel in the central business district early in the evening on 1st April 2003, leaving a suicide note that was found on the body.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyODY4MDM1N15BMl5BanBnXkFtZTcwOTcxMjM5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002000","name":"Leslie Cheung","nicknames":["Gor-gor"],"idIMDB":"nm0002000"},"actorId":"nm0002000","character":"Ling Choi San","urlCharacter":"http://www.imdb.com/character/ch0022985","main":true},{"actorName":"Joey Wang","urlProfile":"http://www.imdb.com/name/nm0939153","urlPhoto":"","biography":{"dateOfBirth":"31 January 1967","placeOfBirth":" Taiwan","height":"5' 8\" (1.73 m)","bio":"Joey Wang grew up in her native Taiwan, where she was spotted by a talent scout for a modeling agency. Her height and delicate beauty made her one of the most popular Taiwanese models, and Wang went on to have a successful film career. Her ethereal elegance was used to great effect by director Ching Siu-tung in A Chinese Ghost Story (1987) and its sequels. Wang has also appeared in dozens of contemporary feature films, including 'God of Gamblers' starring Chow Yun-Fat, and 'City Hunter' opposite Jackie Chan.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0939153","name":"Joey Wang","nicknames":["Joey Wong"],"idIMDB":"nm0939153"},"actorId":"nm0939153","character":"Lip Siu Sin","urlCharacter":"http://www.imdb.com/character/ch0148741","main":true},{"actorName":"Wu Ma","urlProfile":"http://www.imdb.com/name/nm0943138","urlPhoto":"","biography":{"dateOfBirth":"18 August 1942","placeOfBirth":" Tianjin, China","birthName":"Hung-Yuan Feng","height":"5' 6\" (1.68 m)","bio":"Wu Ma was born on August 18, 1942 in Tianjin, China as Hung-Yuan Feng. He was an actor and director, known for Histoire de fantômes chinois (1987), Once Upon a Time in China (1991) and Miracles - Mr. Canton and Lady Rose (1989). He was married to Ma Yan. He died on February 4, 2014 in China.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0943138","name":"Wu Ma","idIMDB":"nm0943138"},"actorId":"nm0943138","character":"Yin Chek Hsia","urlCharacter":"http://www.imdb.com/character/ch0022986","main":true},{"actorName":"Wai Lam","urlProfile":"http://www.imdb.com/name/nm0482708","urlPhoto":"","biography":{"bio":"Wai Lam is an actor, known for Histoire de fantômes chinois (1987), King of Beggars (1992) and The Silent War (2012).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0482708","name":"Wai Lam","idIMDB":"nm0482708"},"actorId":"nm0482708","character":"Hsia-hou","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Siu-Ming Lau","urlProfile":"http://www.imdb.com/name/nm0490618","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NDQ4NDk5M15BMl5BanBnXkFtZTgwNTc5NTg5MTE@._V1_UY44_CR34,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1931","placeOfBirth":" Hong Kong","bio":"Siu-Ming Lau was born in 1931 in Hong Kong. He is an actor, known for Histoire de fantômes chinois (1987), The Legend of Drunken Master (1994) and Le médaillon (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NDQ4NDk5M15BMl5BanBnXkFtZTgwNTc5NTg5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0490618","name":"Siu-Ming Lau","idIMDB":"nm0490618"},"actorId":"nm0490618","character":"Tree Devil","urlCharacter":"http://www.imdb.com/character/ch0022987","main":true},{"actorName":"Zhilun Xue","urlProfile":"http://www.imdb.com/name/nm0944684","urlPhoto":"","biography":{"bio":"Zhilun Xue is an actress, known for Histoire de fantômes chinois (1987), Triads: The Inside Story (1989) and Hua zhong xian (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0944684","name":"Zhilun Xue","idIMDB":"nm0944684"},"actorId":"nm0944684","character":"Ching","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jing Wong","urlProfile":"http://www.imdb.com/name/nm0939147","urlPhoto":"","biography":{"dateOfBirth":"3 May 1955","placeOfBirth":" Hong Kong, China","birthName":"Wong Yat Cheong","bio":"Wong Jing is one of Hong Kong's most prolific, talented and controversial filmmakers. His directorial style, at best, manages to combine commercial appeal and artistic aspects. Most of his films were among the biggest box office hits, partly due to possessing an amazing sense of what would play well. Some of his films have achieved groundbreaking success, artistically as well as financially. His films are so popular that in the mid to late '90s, Wong's movies accounted for as much as thirty percent of the total box office take in Hong Kong. Genre-wise, he's done comedy, drama, romance, action (including martial arts) and even erotica. He often combines genres. His screen-writing portfolio is impressive as there is so much scope in terms of plot, historical setting and quality. Even his credentials in the action movie genre are accomplished from films set in period China to a futuristic setting, whether it be a Chinese equivalent to Lord of the Rings, a Sci-Fi adventure that manages to be an adaptation of the famous computer game Street Fighter or a scathing satire on action films that also manages to pay tribute to films such as Reservoir Dogs, Invasion U.S.A. and Raw Deal. Ironically, regardless of his impressive list of credentials, there came a time when the one genre Wong Jing was most famous for (in the eyes of Western fans of Hong Kong cinema) was the erotic thriller. It became commonly associated with him due to him being the producer and screenwriter for Naked Killer - an exploitation film well known for combining scenes of action, dark humor, shocking violence and lesbianism. His true niche, however, can be found in the gambling genre (his favorite genre). He has, quite frankly created some of the best gambling scenes ever depicted on celluloid. His highest-grossing film in Hong Kong theaters was a gambling-themed genre-mixer (God of Gamblers Returns) starring Chow Yun-Fat (of Crouching Tiger, Hidden Dragon fame). Also known as The Return of the God of Gamblers, the film is still one of Hong Kong's top ten highest-grossing films. It had even made a lot more money than Jackie Chan's Drunken Master 2 (which was released in the same year - 1994). This is saying a lot since Drunken Master 2 is constantly referred to as Jackie's best film (the quality of the fight scenes have rarely been rivaled). It had people cheering and giving standing ovations in cinemas throughout Asia which led many to suggest that Drunken Master 2 is the pinnacle of his decorated and illustrious career. However, that didn't stop Jing from delivering a larger crowd-pleaser. His directorial debut was a gambling film. A multi-layered caper set in the early part of the twentieth century, Challenge of the Gamesters is a prequel to the popular Hong Kong TV mini-series The Shell Game (which Wong himself wrote, with his father Wong Tin-Lam handling the directing duties). Which brings us to Wong Jing's roots, he got his start in the entertainment industry early, since his father Wong Tin-Lam was a TV drama director and a renowned film director from the 1950s. It seemed inevitable that Jing would follow in his father's footsteps, but first Wong attended the Chinese University of Hong Kong, majoring in Chinese Literature. He was becoming disenchanted with university and was more interested in media art so he asked his father for permission to study film in England but his father said \"just observe and you will learn the craft\" and that is what he proceeded to do so he became a screenwriter by writing scripts for TV. In fact, he skipped class a lot to the extent that some of his professors said that they never saw him at all during the four years it took to earn his degree. He later said that the degree was worthless to him. Jing believed that he learned more about making movies and (perhaps more importantly) making money by cutting classes and hanging around studios, where he would get work as a director's assistant (basically a glorified errand boy) and writing scripts for his father's shows. As a devout fan of classical Cantonese cinema, Jing impressed many of the old-timers around the studios with his knowledge of movie trivia. Combined with his high work ethic and the ability to change scripts on the fly (a necessary skill in the fast-paced world of Hong Kong's entertainment industry), Wong had found his niche. By 1978, he made his entrance into the world of movies with his script Cunning Tendency before directing Challenge of the Gamesters in 1981. Both films were made for the Shaw Brothers film studio and were big hits but it wasn't until the late '80s where he began to show his commercial genius with Casino Raiders, which was a smash hit that actually began the gambling craze (that Wong was to capitalize on with the extremely popular God of Gamblers films). The one thing that Jing likes about making this genre of film is being able to direct the gambling duels at the end. Besides possessing a genuine interest in gambling, his main motivation for making gambling movies was because Wong saw there was a large audience for gambling films. This revelation was found after working on two films with his father: King of Gamblers (1980) and Return of King of Gamblers (1981). Wong Jing is also a highly influential filmmaker. Hong Kong's most popular film star - Stephen Chow - had become what he is today due to Wong. He had starred in a film, which was a parody/cash-in of God of Gamblers entitled All for the Winner, which became the highest-grossing film in Hong Kong and made Stephen a huge star in the process (virtually overnight). Wong went out of his way to not only adapt this new star in his own franchise but to add more comedy to the proceedings. This resulted in making an even more groundbreaking success with God of Gamblers II (which was also a sequel to All for the Winner). Chow's collaborations with Wong, which included yet another God of Gamblers movie had confirmed the basic template for Chow's films - a slightly dimwitted but talented man gets thrown into strange circumstances, where he ultimately finds redemption (and resolution) through love. In regards to Jing's influence, there came a point when nearly one third of the films coming out of Hong Kong yearly had Wong's touch on them in some way, either as a screenwriter, producer, director or actor. The script that Wong Jing helped to write for the early '80s traditional Kung Fu film Dreadnaught had proved to be the inspiration for one scene in the Hollywood blockbuster Batman Forever, which had Chris O'Donnell doing laundry chores with the aid of his martial arts skills. Wong Jing's New Legend of Shaolin had proved to be one of the main influences for Ang Lee's Crouching Tiger, Hidden Dragon via the use of a female duo of thieves dressed in black (one of whom is much older and proves to be an expert in poison darts) who try to steal a valuable object before confronting someone who's trying to stop them. Like many famous directors; Wong Jing has trademarks. Besides making a slew of films referencing or based on computer games, he likes using creative POV shots. Sometimes, Jing likes to trick the audience into thinking the film is over when it's not as a way of making things less predictable e.g. the endings of two of his films (i.e. City Hunter and Return to a Better Tomorrow) feature shots where the camera is being pulled further into the distance away from the action into an aerial shot (a shot which is accomplished either a crane or a helicopter) before concluding with an additional scene. Another Wong Jing trademark (or Jingism) is the vertigo shot (a shot that is accomplished by zooming the lens forward whilst physically moving the camera backwards). The way he uses it is either during a revelation of a plot point or a startled reaction from one of the main characters. He has used this shot in The Romancing Star, The Big Score, The Last Blood, Royal Tramp, City Hunter, God of Gamblers 3: Back to Shanghai, Kung Fu Cult Master, Return to a Better Tomorrow, God of Gamblers Returns and High Risk. Like Quentin Tarantino and Kevin Smith, Jing's films have plenty of pop culture references from a subtle reference to The Beatles (in City Hunter) to a blatant take on The Six Million Dollar Man. Another Jingism is to lampoon (as opposed to just referencing) other Chinese filmmakers such as Tsui Hark, John Woo and Wong Kar Wai. Jing's Last Hero in China is a parody of Hark's Once Upon a Time in China film series (which dealt with the nineteenth century Chinese hero, Wong Fei-Hung). Woo has been well known for making action films that deal with male bonding, so Jing had lampooned John Woo's macho male bonding in Boys are Easy with a scene that parodies Woo's A Better Tomorrow. Arthouse favorite Wong Kar Wai is mocked in Jing's Those Were the Days via a character called Wong Jing Wai. Unlike his fellow contemporaries, Jing chooses not to make films in Hollywood as he feels that most other American films directed by Hong Kong directors fail to live up to standards (considering the amount of money and time invested). Hence why he allegedly rejected Tom Cruise's offer to direct Mission: Impossible II. Coincidentally, Jing referenced Tom in The Big Score. Additionally, God of Gamblers has been described as a Chinese take on Rain Man. Also, Jing feels that he won't gain the same amount of control as he would in his Hong Kong productions. Perhaps that is the key to Wong's continued success - while many directors craft overly 'arty' films or overly 'commercial' movies, Wong Jing's films hit a nice middle ground. Yes, there is a good deal of bloodshed and talk of sexual-related things such as bodily functions, but the films themselves are technically sound and well-written. It is quite a testament to Wong's talent that his first film, made over 20 years ago, can stand up to (and surpass) much of today's output. Those wanting to get a bit of a H.K. film industry lesson, while having fun doing it, would be well-advised to check out Challenge of the Gamesters.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0939147","name":"Jing Wong","idIMDB":"nm0939147"},"actorId":"nm0939147","character":"Judge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Wu","urlProfile":"http://www.imdb.com/name/nm0398871","urlPhoto":"","biography":{"bio":"David Wu is an editor and director, known for Brotherhood of the Wolf (2001), Histoire de fantômes chinois (1987) and The Bride with White Hair 2 (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0398871","name":"David Wu","idIMDB":"nm0398871"},"actorId":"nm0398871","character":"Secretary Chiu","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ha Huang","urlProfile":"http://www.imdb.com/name/nm0398987","urlPhoto":"","biography":{"bio":"Ha Huang is known for his work on Histoire de fantômes chinois (1987), Mr. Vampire (1985) and Spooky Encounters (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0398987","name":"Ha Huang","idIMDB":"nm0398987"},"actorId":"nm0398987","character":"Boss at Tavern","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yau Cheung Yeung","urlProfile":"http://www.imdb.com/name/nm1303254","urlPhoto":"","biography":{"bio":"Yau Cheung Yeung is an actor, known for Histoire de fantômes chinois (1987), Winners & Sinners (1983) and Le flic de Hong Kong (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1303254","name":"Yau Cheung Yeung","idIMDB":"nm1303254"},"actorId":"nm1303254","character":"Charm Seller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mei-Yee Sze","urlProfile":"http://www.imdb.com/name/nm0843865","urlPhoto":"","biography":{"bio":"Mei-Yee Sze is an actor and writer, known for Histoire de fantômes chinois (1987), Black Mask (1996) and All for the Winner (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0843865","name":"Mei-Yee Sze","idIMDB":"nm0843865"},"actorId":"nm0843865","character":"Paintings Seller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kam Chiang","urlProfile":"http://www.imdb.com/name/nm0422626","urlPhoto":"","biography":{"bio":"Kam Chiang is known for his work on Histoire de fantômes chinois (1987), Magnificent Butcher (1979) and Snake in the Eagle's Shadow (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0422626","name":"Kam Chiang","idIMDB":"nm0422626"},"actorId":"nm0422626","character":"Policeman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0093978","urlIMDB":"http://www.imdb.com/title/tt0093978","business":{"budget":{"money":"$5,600,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 38 min (98 min)","1 hr 35 min (95 min) (TV premiere) (USA)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.6","filmingLocations":[{"location":"Hong Kong, China"}],"rated":"UNRATED","awards":[{"award":"Avoriaz Fantastic Film Festival 1988","titlesAwards":[{"titleAwardOutcome":"Won Special Jury Award","categories":[{"category":"","names":[{"name":"Hark Tsui","id":"nm0007139","role":null}]}]}]},{"award":"Fantafestival 1988","titlesAwards":[{"titleAwardOutcome":"Won Best Direction","categories":[{"category":"","names":[{"name":"Siu-Tung Ching","id":"nm0155642","role":null}]}]}]},{"award":"Fantasporto 1988","titlesAwards":[{"titleAwardOutcome":"Won International Fantasy Film Award","categories":[{"category":"Best Film","names":[{"name":"Siu-Tung Ching","id":"nm0155642","role":null}]}]}]},{"award":"Golden Horse Film Festival 1987","titlesAwards":[{"titleAwardOutcome":"Won Golden Horse Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Wu Ma","id":"nm0943138","role":null}]},{"category":"Best Adapted Screenplay","names":[{"name":"Kai-Chi Yuen","id":"nm0950699","role":null}]},{"category":"Best Costume Design","names":[{"name":"Shirley Chan","id":"nm0151096","role":null}]},{"category":"Best Film Editing","names":[{"name":"Cinema City (Film Production) Co. Ltd. Editing Unit","id":null,"role":null}]}]},{"titleAwardOutcome":"Nominated Golden Horse Award","categories":[{"category":"Best Feature Film","names":[{"name":"Cinema City Film Production","id":null,"role":null}]},{"category":"Best Art Direction","names":[{"name":"Chung Man Yee","id":"nm0354008","role":null}]},{"category":"Best Original Film Score","names":[{"name":"James Wong","id":"nm0399074","role":null},{"name":"Romeo Díaz","id":"nm0246738","role":null}]},{"category":"Best Original Film Song","names":[{"name":"James Wong","id":"nm0399074","role":null}]}]}]},{"award":"Hong Kong Film Awards 1988","titlesAwards":[{"titleAwardOutcome":"Won Hong Kong Film Award","categories":[{"category":"Best Art Direction","names":[{"name":"Chung Man Yee","id":"nm0354008","role":null}]},{"category":"Best Original Film Score","names":[{"name":"James Wong","id":"nm0399074","role":null}]},{"category":"Best Original Film Song","names":[{"name":"James Wong","id":"nm0399074","role":"music/lyrics"},{"name":"Sally Yeh","id":"nm0947313","role":"performer"}]}]},{"titleAwardOutcome":"Nominated Hong Kong Film Award","categories":[{"category":"Best Picture","names":[{"name":"Hark Tsui","id":"nm0007139","role":null}]},{"category":"Best Director","names":[{"name":"Siu-Tung Ching","id":"nm0155642","role":null}]},{"category":"Best Actress","names":[{"name":"Joey Wang","id":"nm0939153","role":null}]},{"category":"Best Supporting Actor","names":[{"name":"Wu Ma","id":"nm0943138","role":null}]},{"category":"Best Cinematography","names":[{"name":"Hang-Sang Poon","id":"nm0690940","role":null},{"name":"Moon-Tong Lau","id":"nm0490486","role":null},{"name":"Wing-Hang Wong","id":"nm0911072","role":null}]},{"category":"Best Action Choreography","names":[{"name":"Siu-Tung Ching","id":"nm0155642","role":null},{"name":"Chi-Ho Lau","id":"nm0490507","role":null},{"name":"Alan Chung San Chui","id":"nm0161177","role":null}]},{"category":"Best Film Editing","names":[]},{"category":"Best Original Film Song","names":[{"name":"James Wong","id":"nm0399074","role":"music/lyrics"},{"name":"Leslie Cheung","id":"nm0002000","role":"performer"}]},{"category":"Best Original Film Song","names":[{"name":"James Wong","id":"nm0399074","role":"music/lyrics/performer"}]}]}]},{"award":"Sitges - Catalonian International Film Festival 1987","titlesAwards":[{"titleAwardOutcome":"Won Best Special Effects","categories":[{"category":"","names":[]}]},{"titleAwardOutcome":"Nominated Best Film","categories":[{"category":"","names":[{"name":"Siu-Tung Ching","id":"nm0155642","role":null}]}]}]}],"votes":"7,088","type":"Movie","companyCreditsSimple":[{"idCompany":"co0004877","name":"Cinema City Film Productions"},{"idCompany":"co0000295","name":"Film Workshop"}],"keywords":{"keywords":["ghost human relationship","ghost","temple","tongue","female ghost","first part","cult film","asian horror","whip","stop motion animation","snake","hell","graveyard","bill collector","bell","archery","foot","cobra","anklet","magic","undead","monster","sword fight","wolf","martial arts","melodrama","wire fu","living dead","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 03:23:31"}}