{"data":{"movies":[{"title":"Pilot","originalTitle":"","year":"1974","releaseDate":"19740417","directors":[{"name":"Leonard Horn","id":"nm0394873"}],"writers":[{"name":"Christopher Trumbo","id":"nm0874307"},{"name":"Michael Butler","id":"nm0125060"}],"runtime":"73 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmQwMjk4NDItMmE5ZC00ODAzLTk0YWUtODgxZDU1NmU5OTNjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjcyMDU4NA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama"],"plot":"An American Indian deputy sheriff is caught in the middle of a community dispute when the tribe tries to save an historic mission from a housing developer.","simplePlot":"An American Indian deputy sheriff is caught in the middle of a community dispute when the tribe tries to save an historic mission from a housing developer.","actors":[{"actorName":"Robert Forster","urlProfile":"http://www.imdb.com/name/nm0001233","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYyNzczNDk0N15BMl5BanBnXkFtZTcwNzM4ODQ2NA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1941","placeOfBirth":" Rochester, New York, USA","birthName":"Robert Foster","height":"5' 9½\" (1.77 m)","bio":"Robert Forster was born Robert Wallace Foster, Jr. in Rochester, New York, to Grace Dorothy (Montanarella) and Robert Wallace Foster, Sr., who worked as an elephant trainer and baking supply company executive. He is of English, Irish, and Italian descent. Forster first become interested in acting while attending Rochester's Madison High School, where he performed as a song-and-dance man in musical revues. After graduating in 1959, Forster attended Heidelberg College, Alfred University and the University of Rochester on football scholarships and continued to perform in student theatrical revues. After earning a BA in Psychology from Rochester in 1963, Forster took an apprenticeship at an East Rochester theater where he performed in such plays as \"West Side Story\". He moved to New York City in 1965, where his first big break came when he landed the lead in the two-character play \"Mrs. Dally Has a Lover\" opposite Arlene Francis. However, after the play ran its course work was hard to find in the theater. Forster returned to Rochester, where he worked as a substitute teacher and construction worker until an agent from 20th Century-Fox offered him a five-picture deal. His movie debut was a small part in the drama Reflections in a Golden Eye (1967), which starred Elizabeth Taylor and Marlon Brando. Forster went on to appear in small and minor roles alongside some top Hollywood actors in films like The Stalking Moon (1968) and Medium Cool (1969), and a large part in Justine (1969). Although he continued to act in feature films, he took the part of a hardboiled detective in the short-lived TV series Banyon (1971) Forster also appeared in notable parts in The Black Hole (1979), Avalanche (1978) and as the lead in the cult horror flick Alligator (1980), and played the part of a factory worker-turned-vigilante in the thriller Vigilante (1983). Forster also took the lead as a taxi driver in Walking the Edge (1985) by director Norbert Meisel. A series of action flicks followed, the most notable being The Delta Force (1986), starring Chuck Norris. By the late 1980s Forster's acting career had begun to slide, and he was getting less and less work; if there was any, he would be cast in small parts playing villains. Forster then began to work as a motivational speaker and an acting coach in Hollywood film schools. However, in the mid-'90s, Forster's career was resurrected by writer-director Quentin Tarantino, a big fan of Forster's early work, who offered him an audition for a part in his latest movie. After a seven-hour audition, Tarantino cast Forster in the role of the tough but sympathetic bail bondsman Max Cherry in Jackie Brown (1997), which netted him an Academy Award nomination and some nationwide recognition. His success landed him more high-profile starring roles, in such films as All the Rage (1999), Gus Van Sant's Psycho (1998)--a remake of Alfred Hitchcock's 1960 film--and Supernova (2000). Forster continues to act in many big-budget Hollywood productions, playing many charming characters who often steal the scene.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYyNzczNDk0N15BMl5BanBnXkFtZTcwNzM4ODQ2NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001233","name":"Robert Forster","nicknames":["Bob"],"idIMDB":"nm0001233"},"actorId":"nm0001233","character":"Deputy Nakia Parker","urlCharacter":"http://www.imdb.com/character/ch0244635","main":true},{"actorName":"Arthur Kennedy","urlProfile":"http://www.imdb.com/name/nm0447913","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjNhMzU2OGMtNGQ5NC00MTA2LThmYmQtZGZjYTc3YjUwMzU1XkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1914","placeOfBirth":" Worcester, Massachusetts, USA","birthName":"John Arthur Kennedy","height":"5' 10\" (1.78 m)","bio":"Arthur Kennedy, one of the premier character actors in American film from the late 1940s through the early 1960s, achieved fame in the role of Biff in Elia Kazan's historic production of Arthur Miller's Pultizer-Prize winning play \"Death of a Salesman.\" Although he was not selected to recreate the role on screen, he won one Best Actor and four Best Supporting Academy Award nominations between 1949 and 1959 and ranked as one of Hollywood's finest players. Born John Arthur Kennedy to a dentist and his wife on February 17, 1914 in Worcester, Massachusetts. As a young man, known as \"Johnny\" to his friends, studied drama at the Carnegie Institute of Technology. By the time he was 20 years old, he was involved in local theatrical groups. Kennedy's first professional gig was was with the Globe Theatre Company, which toured the Midwest offering abbreviated versions of Shakespearian plays. Shakesperian star Maurice Evans hired Kennedy for his company, with which he appeared in the Broadway production of \"Richard II\" in 1937. While performing in Evans' repertory company, Kennedy also worked in the Federal Theatre project. Arthur Kennedy made his Broadway debut in \"Everywhere I Roam\" in 1938, the same year that he married Mary Cheffrey, who would remain his wife until her death in 1975. He also appeared on Broadway in \"Life and Death of an American\" in 1939 and in \"An International Incident\" in 1940 at the Ethel Barrymore Theatre, in support of the great American actress the theater had been named after. Kennedy and his wife moved west to Los Angeles, California in 1938, and it was while acting on the stage in L.A. that he was discovered by fellow Irish-American actor James Cagney, who cast him as his brother in the film City for Conquest (1940). The role brought with it a contract with Warner Bros., and the studio put him in supporting roles in some prestigious movies, including High Sierra (1941), the film that made Humphrey Bogart a star, They Died with Their Boots On (1941) with Errol Flynn, and Howard Hawks's Air Force (1943) alongside future Best Supporting Actor Oscar winner Gig Young and the great John Garfield. His career was interrupted by military service in World War Two. After the war, Kennedy went back to the Broadway stage, where he gained a reputation as an actor's actor, appearing in Arthur Miller's 1947 Tony Award-winning play \"All My Sons,\" which was directed by Kazan. He played John Proctor in the original production of Miller's reflection on McCarthyism, \"The Crucible\" - which Kazan, an informer who prostrated himself before the forces of McCarthyism, refused to direct - and also appeared in Miller's last Broadway triumph, \"The Price.\" When Kennedy returned to film work, he quickly distinguished himself as one of the best and most talented of supporting actors & character leads, appearing in such major films as Boomerang! (1947), Champion (1949) (for which he received his first Oscar nomination as Best Supporting Actor) and The Glass Menagerie (1950), playing Tom in a mediocre adaptation of Tennessee Williams's classic play. Kennedy won his first and only Best Actor nomination for Bright Victory (1951), playing a blinded vet, a role for which he won the New York Film Critics Circle award over such competition as Marlon Brando and Humphrey Bogart. Other films included Fritz Lang's 'Rancho Notorious (1951)', Anthony Mann's Bend of the River (1952), William Wyler's The Desperate Hours (1955), Richard Brooks' Elmer Gantry (1960), David Lean's Lawrence of Arabia (1962), and John Ford's Cheyenne Autumn (1964). In 1956, Kennedy won another Best Supporting Actor Oscar nomination for his role in Trial (1955), plus two more Supporting nods in 1958 and 1959 for his appearances in the screen adaptations of Grace Metalious's Peyton Place (1957), and James Jones Some Came Running (1958). Kennedy returned to Broadway frequently in the 1950s, and headlined the 1952 play \"See the Jaguar\", a flop best remembered for giving a young actor named James Dean one of his first important parts. A decade later, Kennedy replaced his good friend Anthony Quinn in the Broadway production of \"Becket\", alternating the roles of Becket and Henry II with Laurence Olivier, who was quite fond of working with him. In the 1960s, the prestigious movie parts dried up as he matured, but he continued working in movies and on TV until he retired in the mid-1980s. He moved out of Los Angeles to live with family members in Connecticut. In the last years of his life, he was afflicted with thyroid cancer and eye disease. He died of a brain tumor at 75, survived by his two children by his wife Mary, Terence and actress Laurie Kennedy. He is buried at Woodlawn Cemetery in Lequille, Nova Scotia, Canada.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjNhMzU2OGMtNGQ5NC00MTA2LThmYmQtZGZjYTc3YjUwMzU1XkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0447913","name":"Arthur Kennedy","nicknames":["Johnny"],"idIMDB":"nm0447913"},"actorId":"nm0447913","character":"Sheriff Sam Jericho","urlCharacter":"http://www.imdb.com/character/ch0244634","main":true},{"actorName":"Linda Evans","urlProfile":"http://www.imdb.com/name/nm0002067","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MjI4Mzc1MF5BMl5BanBnXkFtZTYwNjY1MDQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 November 1942","placeOfBirth":" Hartford, Connecticut, USA","birthName":"Linda Evanstad","height":"5' 8\" (1.73 m)","bio":"Linda Evans was born on November 18, 1942 in Hartford, Connecticut, USA as Linda Evanstad. She is an actress, known for Dynasty (1981), The Big Valley (1965) and Tom Horn (1980). She was previously married to Stan Herman and John Derek.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MjI4Mzc1MF5BMl5BanBnXkFtZTYwNjY1MDQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002067","name":"Linda Evans","idIMDB":"nm0002067"},"actorId":"nm0002067","character":"Samantha Lowell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Clutesi","urlProfile":"http://www.imdb.com/name/nm0167370","urlPhoto":"","biography":{"dateOfBirth":"1905","placeOfBirth":" Port Alberni, British Columbia, Canada","bio":"George Clutesi was born in 1905 in Port Alberni, British Columbia, Canada. He was an actor, known for Prophecy (1979), Dreamspeaker (1976) and The Legend of Walks Far Woman (1982). He died on February 27, 1988 in Victoria, British Columbia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0167370","name":"George Clutesi","idIMDB":"nm0167370"},"actorId":"nm0167370","character":"Naiche","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maria Elena Cordero","urlProfile":"http://www.imdb.com/name/nm0179533","urlPhoto":"","biography":{"dateOfBirth":"17 January 1943","placeOfBirth":" Santa Barbara, California, USA","bio":"Maria Elena Cordero was born on January 17, 1943 in Santa Barbara, California, USA. She is an actress, known for The Deadly Tower (1975), The Jordan Chance (1978) and Crash (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0179533","name":"Maria Elena Cordero","idIMDB":"nm0179533"},"actorId":"nm0179533","character":"Diane Little Eagle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Kapp","urlProfile":"http://www.imdb.com/name/nm0438528","urlPhoto":"","biography":{"dateOfBirth":"19 March 1938","placeOfBirth":" Santa Fe, New Mexico, USA","height":"6' 2\" (1.88 m)","bio":"Joe Kapp was born on March 19, 1938 in Santa Fe, New Mexico, USA. He is an actor and producer, known for The Longest Yard (1974), The Frisco Kid (1979) and Breakheart Pass (1975).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0438528","name":"Joe Kapp","idIMDB":"nm0438528"},"actorId":"nm0438528","character":"Deputy Hubbell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Taylor Lacher","urlProfile":"http://www.imdb.com/name/nm0480030","urlPhoto":"","biography":{"dateOfBirth":"2 April 1942","placeOfBirth":" Pittsburg, Kansas, USA","birthName":"Bluford Taylor Lacher Jr.","bio":"Taylor Lacher was born on April 2, 1942 in Pittsburg, Kansas, USA as Bluford Taylor Lacher Jr. He is known for his work on Mr. Majestyk (1974), Cade's County (1971) and Devil Times Five (1974). He died on June 21, 2005 in Killen, Alabama, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0480030","name":"Taylor Lacher","idIMDB":"nm0480030"},"actorId":"nm0480030","character":"Deputy Elliott","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stephen McNally","urlProfile":"http://www.imdb.com/name/nm0573640","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzY4NmJkYTktOGJlNi00YmQwLWIyMjUtYzEwODljNDU2Y2Q0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1911","placeOfBirth":" New York City, New York, USA","birthName":"Horace Vincent McNally","height":"5' 11½\" (1.82 m)","bio":"\"B\" actor Stephen McNally forsook a thriving career as a practicing attorney in the late 1930s when he made the decision to switch gears and pursue acting, which he did avidly. He began his career on stage using his real name of Horace McNally and earned minor status in World War II-era films as both a minor hero and heavy. In 1946 his career took a boost when he changed his stage name to Stephen McNally and carved out a niche as both villains and \"tough guy\" heroes. He was notably despicable in the Jane Wyman starrer Johnny Belinda (1948) and in Winchester '73 (1950) with James Stewart. His heroes fell into such secondary adventures as City Across the River (1949) and Air Cadet (1951). McNally continued duking it out with the leads in other 1950s fare, often for Universal Pictures, such as No Way Out (1950), Battle Zone (1952), the somewhat bizarre Don Siegel western The Duel at Silver Creek (1952), A Bullet Is Waiting (1954), Violent Saturday (1955), Tribute to a Bad Man (1956) and Johnny Rocco (1958). In the long run he proved much more interesting when his character had little redeeming qualities. He starred in a couple of TV series following his wave of movie-making but none of them really stuck and his name never became etched into the minds of audiences.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzY4NmJkYTktOGJlNi00YmQwLWIyMjUtYzEwODljNDU2Y2Q0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0573640","name":"Stephen McNally","nicknames":["Steve"],"idIMDB":"nm0573640"},"actorId":"nm0573640","character":"Alva Chambers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Nader","urlProfile":"http://www.imdb.com/name/nm0618865","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4MTA0OTE1N15BMl5BanBnXkFtZTcwMTYyNTEwOQ@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 October 1921","placeOfBirth":" Pasadena, California, USA","birthName":"George Garfield Nader","height":"6' 1\" (1.85 m)","bio":"Born in Pasadena, California, George Nader became interested in acting while still in school and appeared in several productions at the Pasadena Playhouse. This led to several small parts in movies before earning the lead role in the infamous 3D thriller Robot Monster (1953). The movie was bad but profitable, and Nader soon had a contract with Universal Pictures. Unfortunately, the studio already had on its roster such good-looking and athletic actors as Rock Hudson, Tony Curtis and Jeff Chandler, so Nader often found himself being cast in their leftovers, usually playing parts that emphasized his \"beefcake\" appeal. (At 6' 1\" and 180 pounds, Nader had the kind of physique fan magazines drooled over and unlike many of his colleagues, he frequently appeared with his chest hair intact.) However, he did enjoy a few good years in the mid-1950s, turning in a commendable performance in Away All Boats (1956) before his career began to decline. He tried his hand at three TV series and then relocated to Europe, where he enjoyed a modest revival in the late 1960s starring as \"Jerry Cotton\" in a series of West German films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4MTA0OTE1N15BMl5BanBnXkFtZTcwMTYyNTEwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0618865","name":"George Nader","idIMDB":"nm0618865"},"actorId":"nm0618865","character":"McMasters","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Stone","urlProfile":"http://www.imdb.com/name/nm0831791","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NTcwMzk0OF5BMl5BanBnXkFtZTcwNzgzMTI0NA@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1942","placeOfBirth":" Manchester, New Hampshire, USA","birthName":"Thomas Edward Bourassa","height":"6' (1.83 m)","bio":"Christopher Stone was an occasional lead and supporting actor. Although he never achieved major stardom, he was still quite a busy actor in films and on television throughout the 1980s and early 90s. Stone achieved his first major role as \"Dr. Pooch Hardin\" on the 1970s TV series The Interns (1970), and made occasional appearances in made-for-TV movies and guest-starring on such TV shows that included Mission: Impossible (1966), Hunter (1976) and Wonder Woman (1975). Stone later married actress Dee Wallace and co-starred with her in such theatrical feature films including The Howling (1981) and Cujo (1983), as well as the late 1980s TV series The New Lassie (1989). Stone continued appearing in TV guest-starring roles and made for TV films before he died of a heart attack at the age of 53 in 1995.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1NTcwMzk0OF5BMl5BanBnXkFtZTcwNzgzMTI0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0831791","name":"Christopher Stone","idIMDB":"nm0831791"},"actorId":"nm0831791","character":"Otis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barbara Sigel","urlProfile":"http://www.imdb.com/name/nm0797420","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NTc2MDgxM15BMl5BanBnXkFtZTcwMzI2NjI4Ng@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Barbara Sigel is an actress, known for Blow Out (1981), Time to Run (1973) and Howl (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NTc2MDgxM15BMl5BanBnXkFtZTcwMzI2NjI4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0797420","name":"Barbara Sigel","idIMDB":"nm0797420"},"actorId":"nm0797420","character":"Sally","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jed Horner Jr.","urlProfile":"http://www.imdb.com/name/nm0395086","urlPhoto":"","biography":{"bio":"Jed Horner Jr. is an actor, known for Nakia (1974).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0395086","name":"Jed Horner Jr.","idIMDB":"nm0395086"},"actorId":"nm0395086","character":"Half Cub","urlCharacter":"http://www.imdb.com/character/ch0341541","main":true},{"actorName":"Helene Nelson","urlProfile":"http://www.imdb.com/name/nm0625407","urlPhoto":"","biography":{"bio":"Helene Nelson is an actress, known for Switchblade Sisters (1975), Smile (1975) and ABC Afterschool Specials (1972).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0625407","name":"Helene Nelson","idIMDB":"nm0625407"},"actorId":"nm0625407","character":"Sheila","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Donner","urlProfile":"http://www.imdb.com/name/nm0232817","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM3ODY0MDU2Nl5BMl5BanBnXkFtZTcwMDI0MTYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 April 1931","placeOfBirth":" New York City, New York, USA","birthName":"Robert E. Morris","bio":"Robert Donner was born in New York City and grew up in New Jersey, Michigan and Texas. Robert joined the Navy after he graduated from high school and served almost 4 years. After he left the Navy he stayed on the West Coast and worked as a shipping clerk, salesman, bartender, commercial artist, gardener, and insurance investigator. Robert attended San Fernando Valley State College (now California State University, Northridge), at nights taking courses in Art History, Psychology and speech. During this time, Robert Donner lived in Studio City and became friends with actor Clint Eastwood who lived in his apartment building. Clint urged Robert to study drama, telling him he was humorous and had a good face. When Robert was not acting he was active in athletics, and was known as one of Hollywood's most enthusiastic golfers. He was a member of the former \"Hollywood Hackers\" and carried a seven handicap and was the leader of a group of entertainment industry professionals known as Don Porter's Thursday Golf Group as well as joining others at many of the Celebrity Golf Tournaments who raise money for various charities around the world. Robert also played in many tennis tournaments and was frequently called upon during \"Celebrity Nights\" in which he performed stand-up comedy and promised not to sing. His reputation in this area also led him to become known as one of Hollywood's \"in demand\" Corporate Speakers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM3ODY0MDU2Nl5BMl5BanBnXkFtZTcwMDI0MTYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0232817","name":"Robert Donner","idIMDB":"nm0232817"},"actorId":"nm0232817","character":"Fischer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jay Varela","urlProfile":"http://www.imdb.com/name/nm0885034","urlPhoto":"","biography":{"bio":"Jay Varela is an actor, known for The Man Who Loved Cat Dancing (1973), House Made of Dawn (1987) and The Unholy Rollers (1972).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0885034","name":"Jay Varela","idIMDB":"nm0885034"},"actorId":"nm0885034","character":"Indiana Johnny","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0071894","urlIMDB":"http://www.imdb.com/title/tt0071894","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 13 min (73 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.3","filmingLocations":[{"location":"Albuquerque, New Mexico, USA"}],"awards":[],"votes":"18","type":"TV Episode","seasonInfo":{"tvSerie":{"name":"Nakia","id":"tt0071017"},"season":"Season 1","episode":"Episode 0"},"companyCreditsSimple":[{"idCompany":"co0011777","name":"David Gerber Productions"},{"idCompany":"co0033007","name":"Screen Gems Television"}],"keywords":{"keywords":["american indian","sheriff","deputy sheriff","small town","police","tv series pilot","abc movie of the week","native american","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 00:52:49"}}