{"data":{"movies":[{"title":"Buried Alive","originalTitle":"","year":"1990","releaseDate":"19901003","directors":[{"name":"Gérard Kikoïne","id":"nm0048158"}],"writers":[{"name":"Jake Chesi","id":"nm0156200"},{"name":"Stuart Lee","id":"nm0498299"}],"runtime":"87 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2YzMTE5MmYtMjBmMi00OTdiLTkxZDctMjdiMjJiNGNkMDFlXkEyXkFqcGdeQXVyNTIwMTQxOTc@._V1.jpg","countries":["USA","South Africa"],"languages":["English"],"genres":["Thriller","Horror"],"plot":"A young woman goes to teach at the Ravenscroft Institute, a spooky old girls' school overrun by ants and staffed by various ex-mental patients. Spurred on by a series of horrific hallucinations, she begins to investigate the mysterious disappearances of several students.","simplePlot":"A young woman goes to teach at the Ravenscroft Institute, a spooky old girls' school overrun by ants and staffed by various ex-mental patients. Spurred on by a series of horrific ... ","actors":[{"actorName":"Robert Vaughn","urlProfile":"http://www.imdb.com/name/nm0001816","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MDQxODYxMV5BMl5BanBnXkFtZTYwNDQyNDI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1932","placeOfBirth":" New York City, New York, USA","birthName":"Robert Francis Vaughn","height":"5' 8½\" (1.74 m)","bio":"Robert Francis Vaughn was born on November 22, 1932 at Charity Hospital in New York City, the son of show business parents, Marcella Frances (Gaudel) and Gerald Walter Vaughn. His father was a radio actor and his mother starred on stage. Robert came to the public's attention first with his Oscar-nominated role, in The Young Philadelphians (1959). The next year, he was one of the seven in the western classic The Magnificent Seven (1960). Despite being in such popular films, he generally found work on television. He appeared over 200 times in guest roles in the late 1950s to early 1960s. It was in 1963 that he received his first major role in The Lieutenant (1963). Robert took the role with the intention of making the transition from being a guest-star actor to being a co-star on television. It was due to his work in this series that producer Norman Felton offered him the role of Napoleon Solo in The Man from U.N.C.L.E. (1964). Four extremely successful years (1964-68) followed as the series became one of the most popular television series of the 1960s. It made Vaughn an international television star, but he wanted to embark on a career in film, and did so soon after the series ended in 1968 by co-starring in Bullitt (1968) with Steve McQueen. Now working in film full-time, he starred in The Bridge at Remagen (1969) and The Mind of Mr. Soames (1970), before making a change by going back to television, this time in England. He took a lead role in the series The Protectors (1972) and stayed in England for the first half of the 1970s. He returned to the United States in the mid-1970s and embarked on a very successful run of television miniseries roles that resulted in his receiving an Emmy Award in 1978 for Washington: Behind Closed Doors (1977) and a nomination the following year for Backstairs at the White House (1979). The 1970s proved a important time in Robert's life, as in 1974, he married actress Linda Staab, and completed his thesis on Hollywood blacklisting during the McCarthy \"Red Scare\" era, published in 1972 as \"Only Victims: A Study of Show Business Blacklisting\". During the 1980s, he mixed television with film. Roles in such films as S.O.B. (1981), Superman III (1983), The Delta Force (1986) and Black Moon Rising (1986) were highlights. In television, he appeared in many successful series, most notably in The A-Team (1983) and Emerald Point N.A.S. (1983). He continued with a diverse range of projects, appearing on stage on numerous occasions. The 1990s saw the same variety of roles. Made-for-TV movies were a popular choice for him, as well as such series as As the World Turns (1956), The Nanny (1993) and Law & Order (1990). He had a role in the 1998 series remake of the classic film in which he appeared, The Magnificent Seven (1998). He also appeared in major features such as Joe's Apartment (1996) and BASEketball (1998), and in smaller roles in subsequent years. Robert died of acute leukemia on November 11, 2016 in Ridgefield, Connecticut. His last acting credit, Gold Star (2016), was released the year of his death.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MDQxODYxMV5BMl5BanBnXkFtZTYwNDQyNDI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001816","name":"Robert Vaughn","idIMDB":"nm0001816"},"actorId":"nm0001816","character":"Gary Julian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Donald Pleasence","urlProfile":"http://www.imdb.com/name/nm0000587","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjYzNTQ2MV5BMl5BanBnXkFtZTcwMzA5MTkzNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1919","placeOfBirth":" Worksop, Nottinghamshire, England, UK","birthName":"Donald Henry Pleasence","height":"5' 6\" (1.68 m)","bio":"Balding, quietly-spoken, of slight build and possessed of piercing blue eyes -- often peering out from behind round, steel-rimmed glasses -- Donald Pleasence had the necessary physical attributes which make a great screen villain. In the course of his lengthy career, he relished playing the obsessed, the paranoid and the purely evil. Even the Van Helsing-like psychiatrist Sam Loomis in the Halloween (1978) franchise seems only marginally more balanced than his prey. An actor of great intensity, Pleasence excelled on stage as Shakespearean villains. He was an unrelenting prosecutor in Jean Anouilh's \"Poor Bitos\" and made his theatrical reputation in the title role of the seedy, scheming tramp in Harold Pinter's \"The Caretaker\" (1960). On screen, he gave a perfectly plausible interpretation of the head of the SS, Heinrich Himmler, in The Eagle Has Landed (1976). He was a convincingly devious Thomas Cromwell in Henry VIII and His Six Wives (1972), disturbing in his portrayal of the crazed, bloodthirsty preacher Quint in Will Penny (1967); and as sexually depraved, alcohol-sodden 'Doc' Tydon in the brilliant Aussie outback drama Wake in Fright (1971). And, of course, he was Ernst Stavro Blofeld in You Only Live Twice (1967). These are some of the films, for which we may remember Pleasence, but there was a great deal more to this fabulous, multi-faceted actor. Donald Henry Pleasence was born on October 5, 1919 in Worksop, Nottinghamshire, England, to Alice (Armitage) and Thomas Stanley Pleasence. His family worked on the railway; his grandfather had been a signal man and both his brother and father were station masters. When Donald failed to get a scholarship at RADA, he joined the family occupation working as a clerk at his father's station before becoming station master at Swinton, Yorkshire. While there he wrote letters to theatre companies eventually being accepted by one on the island of Jersey in Spring 1939 as an assistant stage manager. On the eve of World War II, he made his theatrical debut in \"Wuthering Heights\". In 1942, he played Curio in \"Twelfth Night\", but his career was then interrupted by military service in the RAF. He was shot down over France, incarcerated and tortured in a German POW camp. Once repatriated, Donald returned to the stage in Peter Brook's 1946 London production of \"The Brothers Karamazov\" with Alec Guinness although he missed the opening due to measles, followed by a stint on Broadway with Laurence Olivier's touring company in \"Caesar and Cleopatra\" and \"Anthony and Cleopatra\". Upon his return to England, he won critical plaudits for his performance in \"Hobson's Choice\". In 1952, Donald began his screen career, rather unobtrusively, in small parts. He was only really noticed once having found his métier as dastardly, sneaky Prince John in The Adventures of Robin Hood (1955). It took several more years, until international recognition came his way: first, through the filmed adaptation of The Guest (1963); and, secondly, with his blind forger in The Great Escape (1963), a role imbued with added conviction due to his own wartime experience. Some of his best acting Donald reserved for the small screen. In 1962, the producer of The Twilight Zone (1959), Buck Houghton, brought Donald to the United States ('damn the expense'!) to guest star in the third season episode \"The Changing of the Guard\". He was given a mere five days to immerse himself in the part of a gentle school teacher, Professor Ellis Fowler, who, on the eve of Christmas is forcibly retired after fifty-one years of teaching. Devastated, and believing himself a failure who has made no mark on the world, he is about to commit suicide when the school's bell summons him to his classroom. There, he is confronted by the spirits of deceased students who exhort him to consider that his lessons have had fundamental effects on their lives, even leading to acts of great heroism. Upon hearing this, Fowler is now content to graciously accept his retirement. Managing to avoid maudlin sentimentality, Donald's performance was intuitive and, arguably, one of the most poignant ever accomplished in a thirty-minute television episode. Once again, against type, he was equally delightful as the mild-mannered Reverend Septimus Harding in Anthony Trollope's The Barchester Chronicles (1982). Whether eccentric, sinister or given to pathos, Donald Pleasence was always great value-for-money and his performances have rarely failed to engage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjYzNTQ2MV5BMl5BanBnXkFtZTcwMzA5MTkzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000587","name":"Donald Pleasence","idIMDB":"nm0000587"},"actorId":"nm0000587","character":"Dr. Schaeffer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karen Lorre","urlProfile":"http://www.imdb.com/name/nm0937016","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzFhMmQ4ZDMtZWRkZC00YzA0LTlhNzMtNzc0OTU4MGY0ZTYxL2ltYWdlXkEyXkFqcGdeQXVyMjM1NDAzMzI@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1961","placeOfBirth":" Long Beach, California, USA","birthName":"Karen Rachel Witter","height":"5' 6\" (1.68 m)","bio":"Karen Lorre has been acting since she was a teen. She studied pre-med in college, with an emphasis on Psychobiology, the study of how thoughts and feelings from the brain affect the body. While still in college at UCI, Karen took an acting class up in Hollywood. She had one of those bright light moments as she was acting that felt better than anything she had ever experienced before. She realized that acting was the only thing she wanted to do. Karen played Tina Lord Roberts on One Life to Live for 4 years and was nominated for an award. She also was a series regular on the Showtime show, Bedtime. Karen has done many guest stars on a variety of shows, both comedy and drama. Karen has done about 60 commercials. Karen also teaches people how to love unconditionally and she makes guided meditations so that people can feel incredible in many different areas of life. Karen is super fit, she loves to do yoga, acrobatics, skip on the beach, her TRX and her pro ski simulator.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzFhMmQ4ZDMtZWRkZC00YzA0LTlhNzMtNzc0OTU4MGY0ZTYxL2ltYWdlXkEyXkFqcGdeQXVyMjM1NDAzMzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0937016","name":"Karen Lorre","idIMDB":"nm0937016"},"actorId":"nm0937016","character":"Janet","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Carradine","urlProfile":"http://www.imdb.com/name/nm0001017","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MDcyMjkzOV5BMl5BanBnXkFtZTYwNzY1MzI2._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1906","placeOfBirth":" New York City, New York, USA","birthName":"Richmond Reed Carradine","height":"6' (1.83 m)","bio":"John Carradine, the son of a reporter/artist and a surgeon, grew up in Poughkeepsie, New York. He attended Christ Church School and Graphic Art School, studying sculpture, and afterward roamed the South selling sketches. He made his acting debut in \"Camille\" in a New Orleans theatre in 1925. Arriving in Los Angeles in 1927, he worked in local theatre. He applied for a job as as scenic designer to Cecil B. DeMille, who rejected his designs but gave him voice work in several films. His on-screen debut was in Tol'able David (1930), billed as Peter Richmond. A protégé and close friend of John Barrymore, Carradine was an extremely prolific film character actor while simultaneously maintaining a stage career in classic leading roles such as Hamlet and Malvolio. In his later years he was typed as a horror star, putting in appearances in many low- and ultra-low-budget horror films. He was a member of the group of actors often used by director John Ford that became known as \"The John Ford Stock Company\". John Carradine died at age 82 of natural causes on November 27, 1988.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MDcyMjkzOV5BMl5BanBnXkFtZTYwNzY1MzI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001017","name":"John Carradine","nicknames":["The Bard of Boulevard","The Voice"],"idIMDB":"nm0001017"},"actorId":"nm0001017","character":"Jacob Julian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ginger Lynn","urlProfile":"http://www.imdb.com/name/nm0000259","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNzc5MzYwN15BMl5BanBnXkFtZTcwMjQyMzExOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1962","placeOfBirth":" Rockford, Illinois, USA","height":"5' 4\" (1.63 m)","bio":"Born in Rockford, Illinois, on December 14, 1962, Ginger Lynn Allen went to California in 1982 to visit her ill grandfather. She decided to stay and found employment as a manager at a Musicland record store in Redlands. She had lived in a trailer in one of the worst parts of the city for almost a year when she answered an ad for figure models. This led to employment the same day and a layout in Penthouse magazine. Work in the adult-film industry soon followed. She worked in the industry from December 1983 through February 1986, making a total of 69 films (plus countless re-issues and compilations). She retired, partially because the work was no longer fun and she had very little time off. That same year, she was approached by the FBI to testify on behalf of Traci Lords, who had just been exposed as having been underage during her years in the adult-film industry. She refused and was eventually arrested for tax evasion. Following her years in adult movies, she appeared in many \"legit\" films throughout the late 1980s and 1990s-- most notably the \"Vice Academy\" films. She also starred in Metallica's music video \"Turn the Page.\" She has a son, whom she gave birth to on March 24, 1996. She tours gentlemen's clubs around the country, and signed a comeback deal with VCA Pictures in 1999. She has starred in four new adult movies so far: Torn (1999), White Lightning (2000), New Wave Hookers 6 (2000) and Taken (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNzc5MzYwN15BMl5BanBnXkFtZTcwMjQyMzExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000259","name":"Ginger Lynn","idIMDB":"nm0000259"},"actorId":"nm0000259","character":"Debbie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nia Long","urlProfile":"http://www.imdb.com/name/nm0000505","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE0NjM4NDY3Ml5BMl5BanBnXkFtZTgwODI5Njg5MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1970","placeOfBirth":" Brooklyn, New York, USA","birthName":"Nitara Carlynn Long","height":"5' 2\" (1.57 m)","bio":"Stunning pop culture icon, Hollywood leading lady and three-time NAACP award winner Nia Long returns to the big screen this fall in the highly anticipated Universal Pictures sequel The best man holiday (in theaters November 15th) where she reunites with original castmates Taye Diggs (\"Private Practice\"), Terrence Howard (Hustle & flow), Morris Chestnut (The brothers) and Harold Perrineau (\"Lost\"). Additionally in Spring 2014, Long will star in Tyler Perry's Single mom's club alongside Wendi McLendon- Covey (Bridesmaids), Tyler Perry (Madea) and Amy Smart (Crank). Early this year, Long joined the all-star cast of Showtime's \"House of Lies\" alongside Golden Globe Award winner Don Cheadle & Kristen Bell as \"Tamara,\" a business school classmate and former flame of Marty's (Don Cheadle) who has been hired by the same consulting firm Galweather Stearn after taking time off to raise a family. Long made her film debut in the poignant film portraying the social problems in inner-city Los Angeles, Boyz n the hood , and continued on to star in FRIDAY alongside Ice Cube and Chris Tucker as well as LOVE JONES which won the prestigious Audience Award at Sundance. Other notable film roles include Soul Food, Alfie opposite Jude Law, The Best man, Are We There Yet?, Big Momma's House 1 & 2 opposite Martin Lawrence, Stigmata, the Broken Hearts Club and Made in America. On the small screen, Long's portrayal of \"Officer Sasha Monroe\" on NBC's hit crime drama \"Third Watch\" awarded her two NAACP Image Awards for Outstanding Actress in a Drama series. Long's other TV accomplishments include \"The Fresh Prince of Bel-Air,\" \"Boston Legal,\" \"Judging Amy,\" and \"Big Shots.\" Long also voiced \"Roberta\" in the first season of the Fox hit \"the Cleveland Show.\" Making her directorial debut on Ashanti's music video \"Baby\" and Yolanda Adam's \"This Too Shall Pass,\" Nia continues her work behind the camera and is developing a feature film that centers on renowned world champion boxer and trainer Ann Wolfe. In addition to her film and TV work, Long's passion lies in serving her community. With her family roots planted in Trinidad, Grenada, and Barbados, Long's long term goals are to connect women in the US to those of the islands and to mentor young girls to regain their self-esteem. Additionally, Long lends her support to Black Girls Rock, an organization that promotes the arts for young women of color and encourages dialogue on the ways women of color are portrayed in the media. In 2012 she was named an official surrogate to the Barack Obama reelection campaign. A Brooklyn native, Long now calls Los Angeles home where she lives with her 12 year old son, Massai, 14 month old son, Kez and partner Ime Udoka, an Assistant Coach for the San Antonio Spurs. Long loves to cook organic farmer's market fresh meals adding a twist of her Trinidadian heritage. When she's not juggling between her career and motherhood, she enjoys staying active by doing pilates, boxing, hiking, and horseback riding. Long also finds pleasure in traveling and experiencing different cultures throughout the world. One of her favorite locations to visit is Jamaica, a place she calls her second home where she can reflect and refuel.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE0NjM4NDY3Ml5BMl5BanBnXkFtZTgwODI5Njg5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000505","name":"Nia Long","nicknames":["Nia"],"idIMDB":"nm0000505"},"actorId":"nm0000505","character":"Fingers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Butler","urlProfile":"http://www.imdb.com/name/nm0124834","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NTk3MjA2MF5BMl5BanBnXkFtZTYwMzcwMDgy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1968","placeOfBirth":"","height":"6' 1\" (1.85 m)","bio":"William Butler was born in 1968. He is a writer and director, known for Madhouse (2004), Gingerdead Man 2: Passion of the Crust (2008) and Gingerdead Man 3: Saturday Night Cleaver (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NTk3MjA2MF5BMl5BanBnXkFtZTYwMzcwMDgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0124834","name":"William Butler","idIMDB":"nm0124834"},"actorId":"nm0124834","character":"Tim","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Janine Denison","urlProfile":"http://www.imdb.com/name/nm0219216","urlPhoto":"","biography":{"bio":"Janine Denison is an actress, known for Barrett (1989), Gor (1987) and Impact (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0219216","name":"Janine Denison","idIMDB":"nm0219216"},"actorId":"nm0219216","character":"Shiro","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arnold Vosloo","urlProfile":"http://www.imdb.com/name/nm0903677","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NTI3NTA1N15BMl5BanBnXkFtZTYwMzA0NTIz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1962","placeOfBirth":" Pretoria, South Africa","height":"6' 2\" (1.88 m)","bio":"Arnold Vosloo was born in Pretoria, South Africa, to stage actor parents, Johanna Petronella Vorster and Johannes J. Daniel Vosloo. He is an Afrikaaner (of mostly Dutch, as well as German, Swiss-German, Danish, and French, descent). Vosloo quickly established a fine reputation as an actor in his native South Africa, winning several awards there for his theater work, including \"More Is 'n Lang Dag\", \"Don Juan\" and \"Torch Song Trilogy\". A regular performer with South Africa's State Theatre, he also played leading roles in \"Savages\", \"Twelfth Night\" and \"Hamlet\". His film career in the RSA brought him The Dalro Award as Best Actor for both Boetie Gaan Border Toe! (1984) and Circles in a Forest (1989), and the Dalro Best Actor Nomination for the film version of More Is 'n Lang Dag. After moving to the United States, he appeared in \"Born In The R.S.A.\" at Chicago's Northlight Theatre and starred with Al Pacino and Sheryl Lee in a Circle In The Square Uptown production of \"Salome\" (his character's name was \"Jokanaan\"). The latter running for a total of 18 performances only between June 28, 1992 and July 2, 1992. Vosloo's film credits include Ridley Scott's 1492: Christophe Colomb (1992), John Woo's Hard Target (1993) (produced by James Jacks and Sean Daniel), Darkman II: The Return of Durant (1995) and Darkman III: Die Darkman Die (1996), both directed by Bradford May, and George Miller's Zeus and Roxanne (1997). Equally at home on the television screen, Vosloo appeared in American Gothic (1995) for Fox and Nash Bridges (1996) for CBS.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5NTI3NTA1N15BMl5BanBnXkFtZTYwMzA0NTIz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0903677","name":"Arnold Vosloo","nicknames":["Arny","Boetie or Boeta"],"idIMDB":"nm0903677"},"actorId":"nm0903677","character":"Ken Wade","urlCharacter":"http://www.imdb.com/character/ch0094241","main":true},{"actorName":"Ashley Hayden","urlProfile":"http://www.imdb.com/name/nm0370712","urlPhoto":"","biography":{"birthName":"Ashley Mae Hayden","height":"5' 1\" (1.55 m)","bio":"Ashley Hayden was born as Ashley Mae Hayden. She is an actress, known for The Mangler (1995), Terminator Woman (1993) and Pride of Africa (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0370712","name":"Ashley Hayden","idIMDB":"nm0370712"},"actorId":"nm0370712","character":"Boze","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stefa Popic","urlProfile":"http://www.imdb.com/name/nm1973732","urlPhoto":"","biography":{"bio":"Stefa Popic is an actress, known for Buried Alive (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1973732","name":"Stefa Popic","idIMDB":"nm1973732"},"actorId":"nm1973732","character":"Amy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hayley Dorskey","urlProfile":"http://www.imdb.com/name/nm1974104","urlPhoto":"","biography":{"bio":"Hayley Dorskey is an actress, known for Buried Alive (1990), The Shadowed Mind (1988) and White Ghost (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1974104","name":"Hayley Dorskey","idIMDB":"nm1974104"},"actorId":"nm1974104","character":"Sue-Sue","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roslynn Farrell","urlProfile":"http://www.imdb.com/name/nm1977582","urlPhoto":"","biography":{"bio":"Roslynn Farrell is an actress, known for Buried Alive (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1977582","name":"Roslynn Farrell","idIMDB":"nm1977582"},"actorId":"nm1977582","character":"Tina","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dee Dee Eybers","urlProfile":"http://www.imdb.com/name/nm1971976","urlPhoto":"","biography":{"bio":"Dee Dee Eybers is an actress, known for Buried Alive (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1971976","name":"Dee Dee Eybers","idIMDB":"nm1971976"},"actorId":"nm1971976","character":"Yvonne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Isabel Kastrikis","urlProfile":"http://www.imdb.com/name/nm0441022","urlPhoto":"","biography":{"bio":"Isabel Kastrikis is an actress, known for Buried Alive (1990), Justice de femmes (1988) and The Tattoo Chase (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0441022","name":"Isabel Kastrikis","idIMDB":"nm0441022"},"actorId":"nm0441022","character":"Rita","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0099187","urlIMDB":"http://www.imdb.com/title/tt0099187","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"10","month":"08","year":"1988","remarks":null},{"money":null,"country":null,"day":"28","month":"09","year":"1988","remarks":null}],"copyrightHolder":"© MCMLXXXIX Breton Film Productions Ltd."},"technical":{"runtime":["1 hr 27 min (87 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"4.3","filmingLocations":[{"location":"South Africa"}],"rated":"R","awards":[],"votes":"494","type":"Movie","companyCreditsSimple":[{"idCompany":"co0022447","name":"Breton Film Productions"},{"idCompany":"co0156039","name":"Movie Group, The"}],"keywords":{"keywords":["ants","white pumps","hole in ground","white dress suit","foot closeup","camera shot of feet","suntan pantyhose","female stockinged feet","female stockinged legs","pantyhose","bare breasts","buried alive","blood","insanity","murder","ronald reagan mask","independent film","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 03:50:25"}}