{"data":{"movies":[{"title":"Valentino","originalTitle":"","year":"1977","releaseDate":"19770907","directors":[{"name":"Ken Russell","id":"nm0001692"}],"writers":[{"name":"Ken Russell","id":"nm0001692"},{"name":"Mardik Martin","id":"nm0552731"}],"runtime":"128 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1ODcyMjQwNF5BMl5BanBnXkFtZTcwNDY1Nzg0NQ@@._V1.jpg","countries":["UK","USA"],"languages":["English"],"genres":["Biography","Drama"],"plot":"In 1926 the tragic and untimely death of a silent screen actor caused female moviegoers to riot in the streets and in some cases to commit suicide - that actor was Rudolph Valentino. Ballroom dancer Valentino manipulated his good looks and animal-like grace into a Hollywood career. His smouldering love making, tinged with a touch of masterful cruelty, expressed a sexuality which was at once both shocking and sensual.","simplePlot":"In 1926 the tragic and untimely death of a silent screen actor caused female moviegoers to riot in the streets and in some cases to commit suicide - that actor was Rudolph Valentino. ... ","actors":[{"actorName":"Rudolf Nureyev","urlProfile":"http://www.imdb.com/name/nm0638159","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMDY2NzQyOF5BMl5BanBnXkFtZTcwNDAwMjgzNA@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 March 1938","placeOfBirth":" Irkutsk, RSFSR, USSR [now Russia]","birthName":"Rudolf Hametovich Nureyev","height":"5' 8\" (1.73 m)","bio":"He was an ethnic Tatar. He was educated at the Leningrad Ballet School and starred with Kirov Ballet. His first film was a USSR short Le Corsaire (1958). While performing in Paris in 1961 he defected to the West. He then performed internationally, becoming an Austrian citizen in 1982. The English/French documentary I Am a Dancer (1972), directed by Pierre Jourdan featured him and his long-time partner Margot Fonteyn. He played Rudolph Valentino in the film Valentino (1977) and Daniel Jelline in Exposed (1983), his last film. In 1982, he starred in the US stage revival of \"The King and I\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMDY2NzQyOF5BMl5BanBnXkFtZTcwNDAwMjgzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0638159","name":"Rudolf Nureyev","nicknames":["Rudi"],"idIMDB":"nm0638159"},"actorId":"nm0638159","character":"Rudolph Valentino","urlCharacter":"http://www.imdb.com/character/ch0030676","main":true},{"actorName":"Leslie Caron","urlProfile":"http://www.imdb.com/name/nm0001989","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjM5MTkyMV5BMl5BanBnXkFtZTYwODIwMDM2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1931","placeOfBirth":" Boulogne-Billancourt, Seine [now Hauts-de-Seine], France","birthName":"Leslie Claire Margaret Caron","height":"5' 1½\" (1.56 m)","bio":"Actress and dancer. Gene Kelly got her to the movies for the film An American in Paris (1951) in 1951. Got a world-wide reputation for her roles in Lili (1953) (1953) and Gigi (1958) (1958).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjM5MTkyMV5BMl5BanBnXkFtZTYwODIwMDM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001989","name":"Leslie Caron","idIMDB":"nm0001989"},"actorId":"nm0001989","character":"Alla Nazimova","urlCharacter":"http://www.imdb.com/character/ch0030678","main":true},{"actorName":"Michelle Phillips","urlProfile":"http://www.imdb.com/name/nm0680645","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3OTc0MDg2N15BMl5BanBnXkFtZTYwMTE4NzYz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1944","placeOfBirth":" Long Beach, California, USA","birthName":"Holly Michelle Gilliam","height":"5' 7\" (1.7 m)","bio":"Michelle Phillips first became known as a member of the pop group The Mamas and the Papas. She sang the Mamas and Papas song \"Dedicated To The One I Love\" on a March 1987 episode of Knots Landing (1979) in her role as Anne Matheson. She is the mother of singer Chynna Phillips and ex-stepmother of actress Mackenzie Phillips.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3OTc0MDg2N15BMl5BanBnXkFtZTYwMTE4NzYz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0680645","name":"Michelle Phillips","idIMDB":"nm0680645"},"actorId":"nm0680645","character":"Natasha Rambova","urlCharacter":"http://www.imdb.com/character/ch0090872","main":true},{"actorName":"Carol Kane","urlProfile":"http://www.imdb.com/name/nm0001406","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NDgzMzMwOV5BMl5BanBnXkFtZTYwNjg1NzY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 June 1952","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Carolyn Laurie Kane","height":"5' 2\" (1.57 m)","bio":"Carol Kane was born Carolyn Laurie Kane on June 18, 1952 in Cleveland, Ohio, to Elaine Joy (Fetterman), a jazz singer and pianist, and Michael Myron Kane, an architect. Her family is Jewish (from Russia, Poland, and Austria). Due to her parents' divorce, Carol spent most of her childhood in boarding schools, starting at age twelve, when she attended the Cherry Lawn School, a progressive boarding school in Darien, Connecticut, until 1965, followed by enrollment at the Professional Children's School in New York City. She made her professional theater debut in a 1966 production of \"The Prime of Miss Jean Brodie\". She worked prolifically in several successful received films of the 1970s, Carnal Knowledge (1971) (her film film debut), Dog Day Afternoon (1975), Hester Street (1975) (for which she earned an Oscar nomination for her performance), Annie Hall (1977) and When a Stranger Calls (1979). From 1981-1983 she played the part of what is considered to be her most memorable role. Simka Dahblitz-Gravas, the wife of Latka Gravas (played by 'Andy Kaufman), on the American television series _Taxi_. For her performance in the series, she earned two Emmy Awards. Other notable credits include: Pandemonium (1982), Racing with the Moon (1984), Transylvania 6-5000 (1985), Jumpin' Jack Flash (1986), Ishtar (1987), The Princess Bride (1987), Scrooged (1988), The Lemon Sisters (1989) and Addams Family Values (1993). Carol is first and foremost an actress of the stage and is known for her portrayal of the evil headmistress Madame Morrible in the Broadway musical \"Wicked\". She played in various productions from 2005-2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3NDgzMzMwOV5BMl5BanBnXkFtZTYwNjg1NzY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001406","name":"Carol Kane","idIMDB":"nm0001406"},"actorId":"nm0001406","character":"Fatty's Girl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Felicity Kendal","urlProfile":"http://www.imdb.com/name/nm0447555","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3Nzc5MjY0Ml5BMl5BanBnXkFtZTcwMDUwMTgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1946","placeOfBirth":" Olton, Warwickshire, England, UK","birthName":"Felicity Ann Bragg","height":"4' 11¾\" (1.52 m)","bio":"British leading woman best known at one time for \"cute\" roles but a formidable actress in a wide variety of parts. Born in England, she was raised in India where her parents Geoffrey Kendal and Laura Liddell toured the nation for decades with a traveling classical theatre troupe called Shakespeareana. Young Felicity first appeared on stage as an infant and grew up doing backstage chores and filling in on stage as boys or various supernumeraries. She attended whatever convent school was immediately convenient and by her teen years was appearing in important Shakespearean roles. Family friends James Ivory and Ismail Merchant fashioned their fictional film Shakespeare-Wallah (1965) around the Kendal troupe and gave Felicity the leading role. She returned to England following the film and struggled for a number of years getting work. She appeared on television opposite John Gielgud and soon thereafter was given the role that made her famous, Barbara Good in the TV series Good Neighbors (1975), about a couple who decides to live off the land in their decidedly suburban home. She followed \"The Good Life\" with several other TV programs, but made her most important contributions on the stage. She created roles in a number of plays by Tom Stoppard (with whom she had a highly publicized affair), and continued unabated her lifelong work in Shakespeare, playing Desdemona to Paul Scofield's Othello and a memorable Viola in a BBC production of Twelfth Night (1980). She continues to perform with regularity in London's West End. She was made a Commander of the Order of the British Empire (CBE) in 1995. In 1999, she published her memoirs, \"White Cargo.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3Nzc5MjY0Ml5BMl5BanBnXkFtZTcwMDUwMTgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0447555","name":"Felicity Kendal","nicknames":["Foo"],"idIMDB":"nm0447555"},"actorId":"nm0447555","character":"June Mathis","urlCharacter":"http://www.imdb.com/character/ch0522543","main":true},{"actorName":"Seymour Cassel","urlProfile":"http://www.imdb.com/name/nm0001025","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NzE3MjMyNl5BMl5BanBnXkFtZTYwMzgyMzkz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 January 1935","placeOfBirth":" Detroit, Michigan, USA","birthName":"Seymour Joseph Cassel","height":"5' 7¾\" (1.72 m)","bio":"Seymour Cassel, the veteran character actor who was nominated for a Best Supporting Actor Oscar for his role as the hippie swinger Chet in John Cassavetes' Faces (1968), studied acting at the American Theatre Wing and at the Actors Studio. He made his movie debut in Cassavetes' first film, Shadows (1959), on which he also served as associate producer. Cassel's early career was tied to Cassavetes, who himself had a flourishing career as an actor on television and in major Hollywood productions in addition to becoming, arguably, the first great independent movie director after the collapse of the studio system in the late 1950s/early 1960s. As for Cassel, after his uncredited role in \"Shadows,\" he co-starred with Cassavetes in The Webster Boy (1962) and Too Late Blues (1961) before winding up in support of his friend in Don Siegel's The Killers (1964), a movie shot for TV that had to be released theatrically due to its heightened violence (it was also Ronald Reagan's last movie). Cassel primarily made his living on TV in the 1960s, frequently typecast as beatniks and hippies. He had a supporting role in the Cassavetes-directed episode \"A Pair of Boots\" (1962) for The Lloyd Bridges Show (1962) as well as appearing on such popular programs as 12 O'Clock High (1964), Combat! (1962) and The F.B.I. (1965) before scoring with his aging hippie in \"Faces\" at the end of that tumultuous decade. Along with \"Shadows,\" \"Faces\" remains his favorite Cassavettes film. In addition to acting, Cassel was also a crew member on the film, as the technical staff numbered all of seven. He helped shoot the film as a second cameraman, as well as adjusting the lighting. As the film was financed by Cassavettes himself, there were no union regulations to deal with, nor a studio schedule to keep. Several of Cassavettes' films were shot in continuity, so the actors could develop a character in sequence--similar to stage acting--rather than the traditional method of film making, which is shot out of sequence. Cassel has stated that this technique enhanced the success of his works by eliminating the \"fourth wall\" between the audience and the actors. He believes that acting tells the film's story, not the images and that what is important is how the audience relates to the characters on screen. As their careers matured, Cassel also co-starred with Cassavetes in two TV movies, Nightside (1973) and Nightside (1973) and appeared in supporting roles in three more Cassavetes-directed films: The Killing of a Chinese Bookie (1976), Opening Night (1977) and Love Streams (1984). In addition to appearing in studio films, Cassel has remained prominent in the American independent film community since the death of his friend and collaborator. He contributed a cameo appearance in the directorial debut of Steve Buscemi (with whom he appeared as a co-star in the black comedy In the Soup (1992)), Trees Lounge (1996), and has appeared in three films by Wes Anderson: Rushmore (1998), The Royal Tenenbaums (2001) and The Life Aquatic with Steve Zissou (2004). Cassel is prized by independent directors for two things: his positive nature, and his (perhaps) facetious declaration that he'd be in any independent film for the price of a plane ticket if he liked the script.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NzE3MjMyNl5BMl5BanBnXkFtZTYwMzgyMzkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001025","name":"Seymour Cassel","idIMDB":"nm0001025"},"actorId":"nm0001025","character":"George Ullman","urlCharacter":"http://www.imdb.com/character/ch0522544","main":true},{"actorName":"Peter Vaughan","urlProfile":"http://www.imdb.com/name/nm0891092","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NDY4MzI5NV5BMl5BanBnXkFtZTcwMTk0ODg5NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1923","placeOfBirth":" Wem, Shropshire, England, UK","birthName":"Peter Ewart Ohm","height":"6' (1.83 m)","bio":"A true character actor in the best sense of the word, offbeat British thespian Peter Vaughan's hefty frame could appear intimidating or marshmallow benevolent; his beady, hollow eyes menacing or tender; his mere presence menacing or avuncular. Adept at playing both sides of the law, his characters usually possessed a strange, somewhat wary countenance that seemed to keep his audience slightly off balance. A homely sort with a bloated face, jutting chin, sliver lips and pronounced nose, this veteran has been a stalwart presence for nearly fifty years. Born Peter Ohm in 1923, he began on the stage and didn't enter films until 1959, well into his thirties. Married in 1952 to rising actress Billie Whitelaw, Peter was primarily in the background at first, offering a cheapjack gallery of thugs, unsmiling cops, and foreign agents in movies. An easily unsympathetic bloke, he played unbilled policemen in his first two films, then slowly gravitated up the credits list. He appeared as the chief of police in the spy drama The Devil's Agent (1962), which also featured his wife, and then gained a bit more attention in a prime part as an offbeat insurance investigator in the B movie Smokescreen (1964), a role that propelled him into the higher ranks. Noticeably shady roles came with playing Tallulah Bankhead's seedy handyman who meets a fatal end in the Gothic horror Die! Die! My Darling! (1965) [aka Die! Die! My Darling!]; his villainous roles in the spy thrillers The Naked Runner (1967) opposite Frank Sinatra and The Man Outside (1967); a German thug in A Twist of Sand (1968); and Sgt. Walker in The Bofors Gun (1968). Divorced from Whitelaw in 1966, he later married actress Lillias Walker, who had roles in a couple of his pictures: Malachi's Cove (1973) and Intimate Reflections (1974). TV became a large source of income for Vaughan in the 1970s, particularly in his role of Grouty in Porridge (1974) on both the large and small screen, and his quirky demeanor fitted like a glove for bizarre director Terry Gilliam, who cast him as the Ogre in Time Bandits (1981) and then as Mr. Helpman in Brazil (1985). For the past few decades he has maintained a healthy balance between film (including standout roles in Zulu Dawn (1979), The Remains of the Day (1993) and The Life and Death of Peter Sellers (2004)) and TV mini-movies, both contemporary and period. He was still performing into his 90s: his final role was Maester Aemon Targaryen in HBO's Game of Thrones (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI4NDY4MzI5NV5BMl5BanBnXkFtZTcwMTk0ODg5NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0891092","name":"Peter Vaughan","idIMDB":"nm0891092"},"actorId":"nm0891092","character":"Rory O'Neil","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Huntz Hall","urlProfile":"http://www.imdb.com/name/nm0355653","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA4YmNlMzQtODdmZi00NGFmLTgzYzUtNjE3ZmJmZGNkYzNhXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 August 1920","placeOfBirth":" New York City, New York, USA","birthName":"Henry Richard Hall","height":"5' 10\" (1.78 m)","bio":"The 14th of 16 children born to an air conditioning repairman, Henry Richard Hall (he got the name \"Huntz\" from a brother who said his large nose made him look German) was anything but the tough street kid he played in the East Side Kids/Bowery Boys films. He made his stage debut at the age of 1 in a play called \"Thunder on the Left\"; after graduating from a Catholic grammar school, he attended New York's famous Professional Children's School, was a boy soprano with the Madison Square Quintette, and appeared in an experimental 1932 television broadcast. Actor/director Martin Gabel got him an audition for the play \"Dead End\", and Hall got the part because he could imitate a machine gun to playwright Sidney Kingsley's satisfaction. Hall appeared in a total of 81 East Side Kids/Bowery Boys features and serials, more than any other actor. In 1940 he married 18-year-old dancer Elsie May Anderson (they divorced in 1944). During WWII Hall enlisted in the Army, and after his discharge returned to Hollywood, where his first jobs were in war films playing soldiers (for his impressive work in A Walk in the Sun (1945) he received the New York Theatre Critics Circle Blue Ribbon Award). In 1948 Hall found himself in the same kind of jam as did Robert Mitchum -- getting arrested for possession of marijuana, but he was acquitted by a jury. After the trial Hall married showgirl Leslie Wright. In the early 1950s, Hall and former Bowery Boys actor Gabriel Dell teamed up and for a \"Hall and Dell\" nightclub act that was so successful it cost both men their marriages; in 1953 Hall's and Dell's wives both sued for divorce, claiming the men thought more of the act than they did of them. In 1954 Hall was arrested for fighting with the manager of a building where he was attending a party; apparently the party was too noisy and the manager told the occupants to quiet down. Hall took offense at this, a fight ensued and Hall was arrested for assault, for which he paid a $50 fine and was put on probation. In 1959 he was arrested on a drunk driving charge. Having stayed out of trouble for quite some time now, Hall has been content in retirement, with occasional film and television work (not that he needed the money; in addition to owning 10% of the Bowery Boys pictures, Hall made some wise oil and gas investments that paid off handsomely).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA4YmNlMzQtODdmZi00NGFmLTgzYzUtNjE3ZmJmZGNkYzNhXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0355653","name":"Huntz Hall","idIMDB":"nm0355653"},"actorId":"nm0355653","character":"Jesse Lasky","urlCharacter":"http://www.imdb.com/character/ch0522542","main":true},{"actorName":"David de Keyser","urlProfile":"http://www.imdb.com/name/nm0209095","urlPhoto":"","biography":{"dateOfBirth":"1927","placeOfBirth":" London, England, UK","bio":"David de Keyser was born in 1927 in London, England. He is an actor and composer, known for Diamonds Are Forever (1971), Sunshine (1999) and Yentl (1983). He was previously married to Ethel de Keyser.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0209095","name":"David de Keyser","idIMDB":"nm0209095"},"actorId":"nm0209095","character":"Joseph Schenck","urlCharacter":"http://www.imdb.com/character/ch0225149","main":true},{"actorName":"Alfred Marks","urlProfile":"http://www.imdb.com/name/nm0548767","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzMzOTU3NGUtYTFkNi00ZjViLWE0ODAtNDQyZTQ3MDc4YjliL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 January 1921","placeOfBirth":" Holborn, London, England, UK","birthName":"Ruchel Kutchinsky","height":"6' (1.83 m)","bio":"Alfred Marks was born on January 28, 1921 in Holborn, London, England as Ruchel Kutchinsky. He was an actor, known for Alfred Marks Time (1956), The Yeomen of the Guard (1982) and Scream and Scream Again (1970). He was married to Paddie O'Neil. He died on July 1, 1996 in London.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzMzOTU3NGUtYTFkNi00ZjViLWE0ODAtNDQyZTQ3MDc4YjliL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0548767","name":"Alfred Marks","idIMDB":"nm0548767"},"actorId":"nm0548767","character":"Richard Rowland","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anton Diffring","urlProfile":"http://www.imdb.com/name/nm0226446","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjc3MGI4MjAtMDdjNy00NTgzLTk3NDctYzZmMGRiMjhkNjQ5XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1918","placeOfBirth":" Koblenz, Germany","birthName":"Alfred Pollack","height":"5' 11\" (1.8 m)","bio":"Anton Diffring was a character actor who worked continuously in motion pictures due to his aristocratic, German face and cool, clipped diction, making him ideal for typecasting in British and later American motion pictures as Nazis and other vile, despicable characters. What was ironic about his typecasting as a Nazi is that Diffring, born in Koblenz, Germany, on October 20, 1918, fled Nazi Germany in 1939. He was born into a family that boasted generations of actors, and he studied drama in Berlin and Vienna. At the outbreak of World War II he fled Germany and wound up in Canada, where he was interned as an enemy alien for the duration of the war. It was in Canada where he began his acting career after World War II, working primarily there and in the US before moving to Britain in 1950. He became popular playing Nazis in the postwar period, as the British film industry turned out film after film about the war, which created a great demand for actors who could convincingly play Nazis, the nastier the better. Diffring could play nasty, and his career as a character actor soared. He was still going at it in the 1960s, when he began appearing in American and international co-productions as German soldiers from both WW I and WW II, including The Blue Max (1966), Counterpoint (1967) and that Turner Network Television staple, Where Eagles Dare (1968). He was still going at it in the 1970s and 1980s, as he continued a nearly 40-year-long acting career that was terminated only by his death. He was a much better actor than most of his roles required. Diffring broadened his range as an actor with stage and television work, but the movies continually beckoned, as casting agents were hooked on him when it came to Nazi roles. It was that face that did it; it was both his blessing and his curse. He had the light hair, the piercing blue eyes and the chiseled face of the haughty aristocrat, the German Junker, but it was a face that could telegraph much in the few seconds that was the average shot of a motion picture. As a character actor, he got much done with less (time). In François Truffaut's Fahrenheit 451 (1966) he was cast in all likelihood as a counterpart to the Austrian actor Oskar Werner, so that Werner's own Teutonicness in the English setting wouldn't be as arch. He excelled as Werner's nemesis, as he could create a mood or signal an entire story line with just a look; dialog didn't matter (he likely would have been a superstar in silent films, when it was \"the faces\" that mattered). Diffring tried to break out of those silken villain roles, moving to Rome in 1968, but producers turned to him again and again to fill their needs for a foreign heavy. He appeared as one of the most infamous Nazis of all, Adolf Hitler's hangman Reinhard Heydrich, in Operation: Daybreak (1975), and as Hitler's foreign minister Joachim von Ribbentrop in the American mini-series The Winds of War (1983). It made him a good living and it made him known, even if it did not fulfill his artistic ambitions. What made his career such a success in terms of its longevity and fecundity was that Diffring was an actor who was enjoyable to watch. From Jack Clayton's I Am a Camera (1955) to Terence Fisher's The Man Who Could Cheat Death (1959), from Samuel Fuller's Tatort: Tote Taube in der Beethovenstraße (1973) to Ken Russell's Valentino (1977), Diffring gave memorable performances, sandwiched in with all the Nazi heavies one career could possibly bear. Anton Diffring died at his home in Chateauneuf-de-Grasse, France, of natural causes on May 20, 1989. He was 70 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjc3MGI4MjAtMDdjNy00NTgzLTk3NDctYzZmMGRiMjhkNjQ5XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0226446","name":"Anton Diffring","idIMDB":"nm0226446"},"actorId":"nm0226446","character":"Baron Long","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennie Linden","urlProfile":"http://www.imdb.com/name/nm0511614","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM3MDgwNjQyN15BMl5BanBnXkFtZTcwMDA5MTk3NA@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 December 1939","placeOfBirth":" Worthing, Sussex, England, UK","height":"5' 3\" (1.6 m)","bio":"Jennie Linden was born on December 8, 1939 in Worthing, Sussex, England. She is an actress, known for Women in Love (1969), Dr. Who and the Daleks (1965) and Nightmare (1964). She is married to Chris Mann. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM3MDgwNjQyN15BMl5BanBnXkFtZTcwMDA5MTk3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0511614","name":"Jennie Linden","idIMDB":"nm0511614"},"actorId":"nm0511614","character":"Agnes Ayres","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Hootkins","urlProfile":"http://www.imdb.com/name/nm0393853","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MjkzOTE1M15BMl5BanBnXkFtZTYwOTY2OTgy._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 July 1948","placeOfBirth":" Dallas, Texas, USA","birthName":"William Michael Hootkins","bio":"William Michael Hootkins was born on July 5, 1948, in Dallas, Texas. He moved to London, England in the early '70s and lived there up until 2002. Hootkins was an actor at Theatre Intime while attending Princeton University where he learned how to speak fluent Mandarin Chinese. He also trained as an actor at the London Academy of Music and Dramatic Arts, and attended St. Marks, where he was in the same theater group as Tommy Lee Jones. The imposingly bulky and heavyset Hootkins first began acting in films and TV shows alike in the mid '70s. His more noteworthy parts include the first of the Rebel fighter pilots to get killed while attacking the Death Star in \"Star Wars\", scientist Topol's bumbling oaf assistant in \"Flash Gordon\", Major Eaton, sent by the US government in \"Raiders of the Lost Ark\", one of Rod Steiger's demented sons in \"American Gothic\", a corrupt police lieutenant in \"Batman\", a disgusting sleazy voyeur in \"Hardware\", a coarse South African police chief in \"Dust Devil\", the mysterious and duplicitous Mr. X in \"Hear My Song\", a haughty corporate executive in \"Death Machine\", Santa Claus in \"Like Father, Like Santa\", and an opera-singing vampire in \"The Breed\". Moreover, Hootkins had small parts in two \"Pink Panther\" pictures: he's a taxi driver in both \"The Trail of the Pink Panther\" and \"Curse of the Pink Panther\". Among the TV shows he did guest spots on are \"Yanks Go Home\", \"Agony\", \"Play for Today\", \"Tales of the Unexpected\", \"The Life and Times of David Lloyd George\", \"Brett Maverick\", \"Cagney and Lacey\", \"Taxi\", \"Hammer House of Mystery and Suspense\", \"Poirot\", \"Chancer\", \"The Young Indiana Jones Chronicles\", \"The Tomorrow People\", \"The West Wing\", and \"Absolute Power\". Hootkins received many accolades for his outstanding performance as Sir Alfred Hitchcock in Terry Johnson's hit play \"Hitchcock Blonde\". In addition to his substantial film and TV credits, Hootkins was also a popular and prolific voice artist who recorded dozens of plays for BBC Radio Drama; he supplied the voices for such iconic individuals as Orson Welles, J. Edgar Hoover, and Winston Churchill. William Hootkins died of pancreatic cancer on October 23, 2005.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MjkzOTE1M15BMl5BanBnXkFtZTYwOTY2OTgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0393853","name":"William Hootkins","nicknames":["Bill"],"idIMDB":"nm0393853"},"actorId":"nm0393853","character":"Mr. Fatty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill McKinney","urlProfile":"http://www.imdb.com/name/nm0571853","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNzAxMzQ3NjZeQTJeQWpwZ15BbWU4MDAxMjYzNDIx._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1931","placeOfBirth":" Chattanooga, Tennessee, USA","birthName":"William Denison McKinney","height":"5' 10\" (1.78 m)","bio":"Bill McKinney, the movie and television character actor who was one of the great on-screen villains, was born in Chattanooga, Tennessee on September 12, 1931. He had an unsettled life as a child, moving 12 times before joining the Navy at the age of 19 during the Korean War. Once, when his family moved from Tennessee to Georgia, he was beaten by a local gang and thrown into a creek for the offense of being from the Volunteer State. In his four years on active duty in the Navy, McKinney served two years on a mine sweeper in Korean waters. He was also stationed at Port Hueneme in Ventura County, California, and he would journey to nearby Los Angeles while on liberty from his ship. During his years in the Navy, McKinney decided he wanted to be an actor and would make it his life if he survived the Korean War. Discharged in Long Beach, California, in 1954, McKinney settled in southern California. He attended acting school at the famous Pasadena Playhouse in 1957, and his classmates included Dustin Hoffman and Mako. McKinney supported himself as an arborist, trimming and taking down trees, a job he continued into the 1970s, when he was appearing in major films. McKinney has had a life-long love affair with trees since he was a child. After his time at the Pasadena Playhouse, McKinney was admitted to Lee Strasberg's Actors Studio. He made his movie debut in the exploitation picture, She Freak (1967), and was busy on television, making his debut in 1968 on The Monkees (1966) and attracting attention as \"Lobo\" on Alias Smith and Jones (1971). But it was as the Mountain Man in John Boorman's Deliverance (1972), a movie nominated for Best Picture of 1972 at the Academy Awards, that brought McKinney widespread attention and solidified his reputation as one of moviedom's all-time most heinous screen villains. In his autobiography, McKinney's Deliverance (1972) co-star, Burt Reynolds (whose character dispatches The Mountain Man with an arrow in the back) said of McKinney, \"I thought he was a little bent. I used to get up at five in the morning and see him running nude through the golf course while the sprinklers watered the grass....\" McKinney denies this, and also disputes Reynolds contention that he was overly enthusiastic playing the infamous scene where his character buggers Ned Beatty. \"He always played sickos\", Reynolds said of McKinney, \"but he played them well. With my dark sense of humor, I was kind of amused by him.... McKinney turned out to be a pretty good guy who just took the method way too far\". McKinney told Maxim magazine in an interview honoring him and his Mountain Man partner 'Herbert \"Cowboy\" Coward' as the #1 screen villains of all time that Reynolds' stories were untrue. \"If you lose control on a movie set\", McKinney told Maxim, \"it's not acting, it's indulgence\". McKinney's wild-and-reckless screen persona and penchant for on-screen villainy attracted offers from A-list directors, which is a testament to his professionalism. He began appearing in films directed by top directors: Sam Peckinpah's Junior Bonner (1972), John Huston's The Life and Times of Judge Roy Bean (1972), Peter Yates's For Pete's Sake (1974) and, most chillingly, as the assassin in Alan J. Pakula's The Parallax View (1974). (One director who did not hire him was Stanley Kubrick, who had considered him for the role of the Marine drill instructor in Full Metal Jacket (1987) but demurred as he thought he came across as too scary after screening \"Deliverance\".) McKinney also appeared in the classic TV movie, The Execution of Private Slovik (1974), while guest-starring on some of the top TV shows, including Baretta: He'll Never See Daylight (1975) and Columbo (1971). It was on the set working for a new director, who would go on to win an Oscar that McKinney made a fateful connection. He played the aptly named \"Crazy Driver\" in Michael Cimino's Thunderbolt and Lightfoot (1974), starring Clint Eastwood. McKinney became part of the Eastwood stock company and enjoyed one of his best roles as the commander of the Red Legs in The Outlaw Josey Wales (1976), under the direction of Eastwood, himself. McKinney appeared in another six Eastwood films from The Gauntlet (1977) to Pink Cadillac (1989), when the Eastwood stock company disbanded, and had another terrific turn in Eastwood's well-reviewed Bronco Billy (1980), this time playing a member of Bronco Billy's circus, a character that was neither crazy, demented or odd. The Outlaw Josey Wales (1976), which Orson Welles praised as an extremely well-directed film at a time when respectable critics did not associate Clint Eastwood with art, let alone craftsmanship, and Bronco Billy (1980), which was a hit with the critics but not with Eastwood fans, established the laconic superstar's reputation as a director, and McKinney was in both films. In the mid-'70s, McKinney also was a memorable misanthrope as 'Ron Howard''s employer who is done in by John Wayne's The Shootist (1976) in the eponymous film directed by Don Siegel, Eastwood's mentor. Other memorable movies that McKinney has appeared in during his career include the initial Rambo film, First Blood (1982), Against All Odds (1984), Heart Like a Wheel (1983), Back to the Future Part III (1990) and The Green Mile (1999). He never retired, continuing to act into his late seventies. He also performed as a singer and recorded a CD, \"Love Songs from Antry\", featuring Sinatra-like numbers and some country & western tunes. Bill McKinney died on December 1, 2011 in Van Nuys, California from cancer of the esophagus. He was 80 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNzAxMzQ3NjZeQTJeQWpwZ15BbWU4MDAxMjYzNDIx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0571853","name":"Bill McKinney","idIMDB":"nm0571853"},"actorId":"nm0571853","character":"Jail Cop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Don Fellows","urlProfile":"http://www.imdb.com/name/nm0271514","urlPhoto":"","biography":{"dateOfBirth":"2 December 1922","placeOfBirth":" Salt Lake City, Utah, USA","birthName":"Donald Fellows","bio":"Don Fellows was born on December 2, 1922 in Salt Lake City, Utah, USA as Donald Fellows. He was an actor, known for Raiders of the Lost Ark (1981), The Omen (1976) and Velvet Goldmine (1998). He was married to Miranda Willis. He died on October 21, 2007 in London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0271514","name":"Don Fellows","idIMDB":"nm0271514"},"actorId":"nm0271514","character":"George Melford","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0076868","urlIMDB":"http://www.imdb.com/title/tt0076868","business":{"budget":{"money":"$5,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"Copyright © United Artists Corporation MCMLXXVII ALL RIGHTS RESERVED"},"technical":{"runtime":["2 hr 8 min (128 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision"],"printedFilmFormat":["35 mm"]},"rating":"6.1","filmingLocations":[{"location":"S'Agaró, Castell-Paltja d'Aro, Girona, Catalonia, Spain"}],"rated":"R","awards":[{"award":"BAFTA Awards 1978","titlesAwards":[{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best Cinematography","names":[{"name":"Peter Suschitzky","id":"nm0005893","role":null}]},{"category":"Best Costume Design","names":[{"name":"Shirley Russell","id":"nm0751455","role":null}]},{"category":"Best Production Design/Art Direction","names":[{"name":"Philip Harrison","id":"nm0365812","role":null}]}]}]},{"award":"British Society of Cinematographers 1977","titlesAwards":[{"titleAwardOutcome":"Nominated Best Cinematography Award","categories":[{"category":"","names":[{"name":"Peter Suschitzky","id":"nm0005893","role":null}]}]}]}],"votes":"1,193","type":"Movie","companyCreditsSimple":[{"idCompany":"co0054262","name":"Chartoff-Winkler Productions"}],"keywords":{"keywords":["male frontal nudity","actor","riot","love","death","dancer","horseback riding","fired from a job","former champion","joy buzzer","hollywood california","one word title","year 1926","year 1919","1910s","paint","orgasm","poet","contract","recording","newspaper editorial","vaudeville","dance","policeman","cigarette smoking","drinking","lesbian","widow","belch","reference to omar khayyam","applause","gaucho","billy club","unconsciousness","man dancing with a man","demonstration","adoration","wristwatch","practical joker","california","erotica","stuffed bear","nudity","top hat","blood splatter","reference to douglas fairbanks","powder puff","chorus girl","self respect","business card","climbing through a window","mirror","tent","desert","infidelity","little boy","police","cigar smoking","spirituality","biting hand","veil","punched in the gut","wearing a lamp shade on one's head","dancing on a table","jail","mineral lava","umbrella","funeral wreath","cooking","dead body","reference to robinson crusoe","crystal ball","spaghetti","newspaper","hand kissing","fortune telling","masculinity","gigolo","rex ingram","breaking through a door","salute","pipe smoking","cigarette holder","mob","vulture","reference to mary pickford","tuxedo","tap dancing","sex","costume malfunction","referee","punching bag","pajamas","nightclub","penis","letter","bloody nose","beating","song","breaking a window","underwear","marriage","gramophone","boxing ring","reference to coconut grove","drunkenness","dance team","ketchup","duel","homosexual subtext","mexico","urination","machismo","whip","bracelet","prostitute","boxing gloves","tango","bone","reflection in the floor","challenged to a boxing match","cynicism","dog","piano","ballet","mother son relationship","jail cell","bonfire","piano player","undressing","beer","perfume business","male prostitute","listening to music","champagne","garter belt","burst appendix","broken heel","knocked out","topless female nudity","reference to anna pavlova","tears","bare chested male","money","reference to benito mussolini","bare butt","brutality","reference to afternoon of the faun","fight","mexican law","homosexual","dancing","reporter","satire","monkey","masturbation","photographer","watching a movie","rape threat","french fries","italian stereotype","flowers","bead curtain","hatchet","humiliation","sheik of araby","palm tree","arrest","kiss","bigamy","bail","woman on top","mexican jumping bean","telephone call","drinking contest","salesman","starlet","american","wallace reid","horse","tour","morgue","divorce","gun","open casket","blood","orange the fruit","lesbian subtext","american flag","falcon's lair","star spangled banner","spitting blood","singing","cane","gay","studio boss","boxing","sports car","pie in the face","unfaithfulness","drink","wife murders husband","western filmmaking","water thrown into someone's face","vanity","theatrical agent","theatre audience","stepfather stepdaughter relationship","satirical song","romance filmmaking","publicity","predicting the future","movie theater","movie fan","mourning","mental breakdown","megaphone","mansion","male rear nudity","male nudity","hysteria","honor","film director","film crew","dying","boxer","beauty products","bare breasts","autograph","singer","silent filmmaking","screenwriter","screening room","screen test","rumor","record player","portrait","photograph","orchestra","older woman younger man relationship","nonlinear timeline","newsreel footage","newspaper headline","new york city","murder","movie star","movie set","los angeles california","limousine","italian","italian slur","interview","husband wife relationship","gossip","flashback","flash forward","flash camera","film within a film","film producer","female female kiss","fan","extramarital affair","dressing room","dance hall","crying","coffin","cocaine","caught in the act","camera","black and white and color","ballet dancer","archive footage","appendicitis","adultery","actress","female nudity","boxing match","1920s","female frontal nudity","filmmaking","death of mother","based on novel","independent film","character name in title","cheerleader","hand on butt"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:47:11"}}