{"data":{"movies":[{"title":"Summer School Teachers","originalTitle":"","year":"1974","releaseDate":"19750604","directors":[{"name":"Barbara Peeters","id":"nm0676336"}],"writers":[{"name":"Barbara Peeters","id":"nm0676336"}],"runtime":"85 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGEwYzg1NDAtMzAwZi00ZmRiLTljODQtMDczNDQ1ZDI3ZDNmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Thriller"],"plot":"A trio of naive, but eager young Midwestern women go to California to teach summer school classes at Regency High School: Perky and willful Conklin T. starts up and coaches an all-female football team, stuffy chemistry teacher Sally Hanson manages to loosen up after she falls hard for a surly juvenile delinquent student, and pert and liberated photography instructor Denise Carter becomes involved with both a two-faced male chauvinist jerk and a more decent and understanding guy.","simplePlot":"A trio of naive, but eager young Midwestern women go to California to teach summer school classes at Regency High School: Perky and willful Conklin T. starts up and coaches an all-female ... ","actors":[{"actorName":"Candice Rialson","urlProfile":"http://www.imdb.com/name/nm0722681","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NTM4MTQ3MF5BMl5BanBnXkFtZTcwMDExODYyNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1951","placeOfBirth":" Santa Monica, California, USA","birthName":"Candice Ann Rialson","bio":"Lovely, radiant, enticing and charismatic blonde Candice Rialson was perhaps the most dynamic and personable actress to appear in enjoyably trashy drive-in pictures throughout the 70s. After making her film debut in an uncredited bit as a bikini-clad beauty on the beach in The Gay Deceivers (1969), the pert 'n' perky Candice enlivened a bunch of choice down 'n' dirty exploitation features: she was a naive, innocent hitchhiker who runs afoul of kinky perverts in the bizarre Pets (1973), one of Gloria Grahame's slutty daughters in the sleazy Mama's Dirty Girls (1974), a hapless lass with a talking and singing vagina (!) in the outrageously bawdy Chatterbox! (1977), a small-town tramp in the immensely entertaining Moonshine County Express (1977), and a stuck-up starlet in the nifty Stunts (1977). Following her winningly easy 'n' breezy turns in the amiably silly soft-core comedies Candy Stripe Nurses (1974) and Summer School Teachers (1974) for legendary B-movie filmmaker Roger Corman, Candice expertly essayed her best, most substantial and appealing role as \"Candy Wednesday\", a bubbly aspiring actress who winds up working for the chintzy schlock movie studio \"Miracle Pictures\" (\"If it's a good film, then it's a Miracle\") in the very clever and hilarious junk film parody Hollywood Boulevard (1976). Moreover, Rialson also had bit parts in the mainstream features The Eiger Sanction (1975), Logan's Run (1976) and Silent Movie (1976) and made guest appearances on the TV shows Maude (1972), Shaft (1973), Switch (1975), Adam's Rib (1973) and Fantasy Island (1977). After doing yet another minor part as a nurse playing with a rake in Winter Kills (1979), Candice Rialson voluntarily quit acting at the end of the 70s. However, she remained a cult favorite of 70s exploitation film fans. Quentin Tarantino, in particular, was such a strong admirer of Rialson's work that he reportedly patterned the Bridget Fonda character in Jackie Brown (1997) after her. Candice Rialson passed away at age 54 from liver disease on March 31st, 2006. She is much loved and missed by her many fans the world over.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NTM4MTQ3MF5BMl5BanBnXkFtZTcwMDExODYyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0722681","name":"Candice Rialson","idIMDB":"nm0722681"},"actorId":"nm0722681","character":"Conklin T.","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pat Anderson","urlProfile":"http://www.imdb.com/name/nm0027264","urlPhoto":"","biography":{"bio":"Pat Anderson was a lovely, shapely and buxom blonde actress who greatly enlivened a handful of enjoyably trashy 70's exploitation pictures with her winning blend of sweet sex appeal and infectiously exuberant energy. Pat was born in Superior, Wisconsin and first began acting in the early 70's. She made her film debut with an uncredited bit part in the excellent crime thriller \"Bonnie's Kids.\" Anderson's most memorable roles are endearingly klutzy eager beaver rookie stewardess Toby in the delightfully dippy \"Fly Me,\" enticing all girls basketball coach Lizzie in \"Dirty O'Neil: The Love Life of a Cop,\" spunky undercover cop Elaine in the supremely tacky \"T.N.T. Jackson,\" perky fashion model Barbara in \"Cover Girl Models,\" and uptight young teacher Sally in the amusingly inane \"Summer School Teachers.\" Moreover, Pat made guest appearances on the TV shows \"The Bold Ones: The New Doctors,\" \"Here We Go Again,\" \"Dynasty,\" and \"Jake and the Fatman.\" Alas, Pat Anderson's career slowed down in the 80's and she eventually stopped acting altogether by the end of that particular decade.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0027264","name":"Pat Anderson","idIMDB":"nm0027264"},"actorId":"nm0027264","character":"Sally","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rhonda Leigh Hopkins","urlProfile":"http://www.imdb.com/name/nm0394261","urlPhoto":"","biography":{"dateOfBirth":"11 December 1947","placeOfBirth":" USA","bio":"Rhonda Leigh Hopkins was born on December 11, 1947 in the USA. She is an actress, known for Tidal Wave (1973), Summer School Teachers (1974) and Cover Girl Models (1975).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0394261","name":"Rhonda Leigh Hopkins","idIMDB":"nm0394261"},"actorId":"nm0394261","character":"Denise","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Will Carney","urlProfile":"http://www.imdb.com/name/nm0138853","urlPhoto":"","biography":{"bio":"Will Carney is an actor, known for Summer School Teachers (1974), Hefner: Unauthorized (1999) and Dynasty (1981).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0138853","name":"Will Carney","idIMDB":"nm0138853"},"actorId":"nm0138853","character":"Jeremy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Grainger Hines","urlProfile":"http://www.imdb.com/name/nm0385674","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MDMwNTAzMF5BMl5BanBnXkFtZTgwMTUwMzA4MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1948","placeOfBirth":" Greenwood, South Carolina, USA","birthName":"Frank Hines","height":"6' 1\" (1.85 m)","bio":"Grainger recently appeared as, Captain August Robertson in the first two season of Steven Soderbergh's, \"The Knick\" on Cinemax. He also appeared in seasons two and three of the AMC series, \"Hell on Wheels\" as Doc Whitehead. Rounding out the last few years in period costume, as Secretary of the Navy, Gideon Welles in Steven Spielberg's, \"Lincoln.\" A long career in episodic television, Grainger recently appeared in, \"Elementary,\" \"Blue Bloods,\" \"Criminal Minds\" and the finale of, \"The Good Wife.\" Films released in 2016, \"C Street\" and \"Kenshaw at the Bedfellow,\" and Jason Bateman's, \" Family Fang. \" In 2017, \"The Final Interview,\" directed by Fred Vogal will be released. Grainger is an avid horseman and a playing member of the United States Polo Association.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MDMwNTAzMF5BMl5BanBnXkFtZTgwMTUwMzA4MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0385674","name":"Grainger Hines","idIMDB":"nm0385674"},"actorId":"nm0385674","character":"Bob","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christopher Barrett","urlProfile":"http://www.imdb.com/name/nm0308093","urlPhoto":"","biography":{"bio":"Christopher Barrett is a producer and talent agent, known for The Green Room with Paul Provenza (2010), The New Kind (2012) and Sex, Lies and Handwriting. He has been married to Anne Schedeen since 1984. They have one child.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0308093","name":"Christopher Barrett","idIMDB":"nm0308093"},"actorId":"nm0308093","character":"Jeff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dick Miller","urlProfile":"http://www.imdb.com/name/nm0588241","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDM1OTY4NV5BMl5BanBnXkFtZTcwMDQ3NDcyNA@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1928","placeOfBirth":" The Bronx, New York, USA","birthName":"Richard Miller","height":"5' 5\" (1.65 m)","bio":"A native of the Bronx, New York, Richard \"Dick\" Miller served in the U.S. Navy for a few years and earned a prize title as a middleweight boxer. He settled in Los Angeles in the mid-1950s, where he was noticed by producer/director Roger Corman, who cast him in most of his low-budget films, usually playing unlikeable sorts, such as a vacuum-cleaner salesman in Not of This Earth (1957). His most memorable role would have to be that of the mentally unstable, busboy/beatnik artist Walter Paisley, whose clay sculptures are suspiciously lifelike in A Bucket of Blood (1959) (a rare starring role for him), and he is also fondly remembered for his supporting role as the flower-eating Vurson Fouch in Corman's legendary The Little Shop of Horrors (1960). Miller spent the next 20 years working in Corman productions, and starting in the late 1970s was often cast in films by director Joe Dante, appearing in credited and uncredited walk-on bits as quirky chatterboxes, and stole every scene he appeared in. He has played many variations on his famous Walter Paisley role, such as a diner owner (Twilight Zone: The Movie (1983)) or a janitor (Chopping Mall (1986)). One of his best bits is the funny occult-bookshop owner in The Howling (1981). Being short (so he never played a romantic lead or a threatening villain) with wavy hair, long sideburns, a pointed nose and a face as trustworthy as a used-car dealer's, he was, and is to this day, an immediately recognizable character actor whose one-scene appearances in countless movies and TV shows guarantee audience applause.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIwNDM1OTY4NV5BMl5BanBnXkFtZTcwMDQ3NDcyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0588241","name":"Dick Miller","idIMDB":"nm0588241"},"actorId":"nm0588241","character":"Sam","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vince Barnett","urlProfile":"http://www.imdb.com/name/nm0055998","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmYxMzIyNGItZDk3YS00NmU3LTgzNjktNmYxYWI5YWQzODQ5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 July 1902","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Vincent Lysle Barnett","height":"5' 6\" (1.68 m)","bio":"Former vaudevillian, who acquired a solid reputation as a practical joker and master of insult, second only to the great Groucho Marx. Celebrity hosts would often hire Vince to perform gags and put-on jokes at their lavish parties, where he would insult the guests and create mayhem in his wake. He often posed as heavily-accented journalists with names like 'Timothy Glutzspiegel'. Among the many victims of his pranks were such luminaries as Winston Churchill, Charles Lindbergh, Henry Ford and the Norwegian polar explorer Roald Amundsen. Clark Gable nearly punched him out during a party given by Joan Crawford. Vince greeted Greta Garbo with \"Good Morning, Miss Hepburn\", and, as 'sound expert' Dr. Hoffman, instructed star Richard Barthelmess to take voice lessons from Texas Guinan or quit acting. During a trip to New York, he even cornered Mae West, posing as a member of the vice squad and threatening to close down her show ('Diamond Lil') unless she cut some of her bawdy dialogue. When the star acquiesced, the phoney inspector ordered her to burn the whole play and take the next train out of town. Not even Jack L. Warner was immune, being told by 'foreign producer' Barnett to learn the basics of film-making. Roly-poly, moustachioed, bald-pated Barnett followed in the footsteps of his father Luke, who had made a name for himself for playing similar pranks on people for thirty years in his home town of Pittsburgh. After studying at the Carnegie Institute of Technology, Vince, who was an avid amateur pilot, flew mail planes for a couple of years before making his stage debut with \"Earl Carroll's Vanities\" in 1926. The following year, he acted on Broadway in \"George White's Scandals\". Movie roles soon followed. From 1930, Vince appeared, usually as comedy relief, in films and on television in a career spanning 45 years. Among his best-regarded early roles were Scarface (1932),as a dumb gangster; The Big Cage (1933), Thirty Day Princess (1934) and, in a perfectly-suited Runyonesque part, Princess O'Hara (1935). In later years, Vince often relinquished his comedy image and was seen in innumerable small roles, often as careworn little men, undertakers, janitors, bartenders and drunks in pictures ranging from films noir like The Killers (1946), to westerns such as Springfield Rifle (1952). In one of his last public appearances, Vince showcased his unique brand of humour with a monologue, delivered at Madison Square Garden in the vaudeville revue 'The Big Show of 1936'. It was to his ever-lasting regret that he never got the chance to match wits (and insults) with his illustrious Irish contemporary George Bernard Shaw.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmYxMzIyNGItZDk3YS00NmU3LTgzNjktNmYxYWI5YWQzODQ5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0055998","name":"Vince Barnett","idIMDB":"nm0055998"},"actorId":"nm0055998","character":"Principal Adams","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Norman Bartold","urlProfile":"http://www.imdb.com/name/nm0058991","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNjgwNjk5Ml5BMl5BanBnXkFtZTcwMzAyMTIyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1928","placeOfBirth":" Alameda County, California, USA","birthName":"Norman Hillman Bartold","bio":"Norman Bartold was born on August 6, 1928 in Alameda County, California, USA as Norman Hillman Bartold. He was an actor, known for Close Encounters of the Third Kind (1977), Westworld (1973) and Capricorn One (1977). He was married to Sheila Bartold. He died on May 28, 1994 in Riverside County, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNjgwNjk5Ml5BMl5BanBnXkFtZTcwMzAyMTIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0058991","name":"Norman Bartold","idIMDB":"nm0058991"},"actorId":"nm0058991","character":"Agwin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Greer","urlProfile":"http://www.imdb.com/name/nm0337544","urlPhoto":"","biography":{"dateOfBirth":"20 April 1943","placeOfBirth":" Galesburg, Illinois, USA","birthName":"James R. Maley","bio":"Michael Greer was an actor and comedian. His most famous role was as Queenie, the prison drag queen in Sal Mineo's stage and the Harvey Hart film versions of \"Fortune and Men's Eyes\" (Fortune and Men's Eyes (1971)), which dealt with sex in prison. Mr. Greer appeared as Don Johnson's friend in the 1960s cult film The Magic Garden of Stanley Sweetheart (1970). That movie was also Don Johnson's big screen debut. Other credits include the B-Movie sex comedy Summer School Teachers (1974) and The Gay Deceivers (1969) about two guys avoiding combat in Vietnam by pretending to be gay. He also had bit parts in the Steve Martin comedy The Lonely Guy (1984) and the Bette Midler vehicle The Rose (1979) Michael was also famous for his live performances as a comedian. Of particular note was a monologue, as the Mona Lisa, holding a giant gilded frame around himself. He wrote supplemental material for Debbie Reynolds Vegas act, and was once called in to dub Bette Davis' voice when she refused to loop over scenes. Greer was somewhat a victim of early \"gaysploitation\" films. A talented actor, it never occurred to him that once he had turned in solid performances as designated that he would not be allowed to work as much else, partially because no one had done it before. He is not acknowledged much in gay cinema because of a climate of political correctness. He is probably more accurately remembered by friends, colleagues, and punters that saw his live work, than by Hollywood.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0337544","name":"Michael Greer","idIMDB":"nm0337544"},"actorId":"nm0337544","character":"John John Lacey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barbara Peil","urlProfile":"http://www.imdb.com/name/nm0215070","urlPhoto":"","biography":{"bio":"Barbara Peil is an actress, known for Summer School Teachers (1974).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0215070","name":"Barbara Peil","idIMDB":"nm0215070"},"actorId":"nm0215070","character":"Janice","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ka-Ron Sowell Brown","urlProfile":"http://www.imdb.com/name/nm0113945","urlPhoto":"","biography":{"bio":"Ka-Ron Sowell Brown is an actor, known for Summer School Teachers (1974) and An Evening with Diana Ross (1977).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0113945","name":"Ka-Ron Sowell Brown","idIMDB":"nm0113945"},"actorId":"nm0113945","character":"Jessie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Merie Earle","urlProfile":"http://www.imdb.com/name/nm0247338","urlPhoto":"","biography":{"dateOfBirth":"13 May 1889","placeOfBirth":" Morrow, Ohio, USA","bio":"Merie Earle was born on May 13, 1889 in Morrow, Ohio, USA. She was an actress, known for Fatso (1980), Crazy Mama (1975) and Gaily, Gaily (1969). She died on November 4, 1984 in Glendale, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0247338","name":"Merie Earle","idIMDB":"nm0247338"},"actorId":"nm0247338","character":"Ethel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cecil Elliott","urlProfile":"http://www.imdb.com/name/nm0254199","urlPhoto":"","biography":{"dateOfBirth":"25 October 1887","placeOfBirth":" Greenville, Illinois, USA","birthName":"Cecil Melvin","bio":"Cecil Elliott was born on October 25, 1887 in Greenville, Illinois, USA as Cecil Melvin. She was an actress, known for Chinatown (1974), The Killing (1956) and The Drowning Pool (1975). She died on April 8, 1982 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0254199","name":"Cecil Elliott","idIMDB":"nm0254199"},"actorId":"nm0254199","character":"Freida","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Kerry","urlProfile":"http://www.imdb.com/name/nm0449900","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ3MjgxNTY1OV5BMl5BanBnXkFtZTgwMzA0MDY3OTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1953","placeOfBirth":" New Jersey, USA","height":"6' 0½\" (1.84 m)","bio":"John Kerry was born on June 22, 1953 in New Jersey, USA. He is an actor, known for Dolemite (1975).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ3MjgxNTY1OV5BMl5BanBnXkFtZTgwMzA0MDY3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0449900","name":"John Kerry","idIMDB":"nm0449900"},"actorId":"nm0449900","character":"Hiram","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0073764","urlIMDB":"http://www.imdb.com/title/tt0073764","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 25 min (85 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Metrocolor (uncredited)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.3","filmingLocations":[{"location":"Hollywood, Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"88","type":"Movie","companyCreditsSimple":[{"idCompany":"co0065427","name":"New World Pictures"}],"keywords":{"keywords":["high school","f rated","breasts","scantily clad female","title directed by female","erotica","sex with teacher","sex with student","lust","leg spreading","blonde","unwanted kiss","shower","tan line","nude modeling","female rear nudity","cleavage","erotic 70s","female nudity","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:54:29"}}