{"data":{"movies":[{"title":"The Wraith","originalTitle":"","year":"1986","releaseDate":"19861121","directors":[{"name":"Mike Marvin","id":"nm0555549"}],"writers":[{"name":"Mike Marvin","id":"nm0555549"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNzY5NjQ4Ml5BMl5BanBnXkFtZTcwOTAzMTkzMQ@@._V1.jpg","countries":["USA","Canada"],"languages":["English"],"genres":["Action","Horror","Romance","Sci-Fi","Thriller"],"plot":"Packard Walsh and his motorized gang control and terrorize an Arizona desert town where they force drivers to drag-race so they can 'win' their vehicles. After Walsh stabs the decent teenager Jamie Hankins to death for being intimate with a girl whom Walsh wants for himself, the mysterious Jake Kesey arrives, an extremely cool motor-biker with an invincible car. Jake befriends Jamie's girlfriend Keri Johnson, takes Jamie's sweet brother Billy under his wing and manages what Sheriff Loomis can not - the methodical and otherworldly elimination of Packard's criminal gang.","simplePlot":"A mysterious figure suddenly appears to challenge a gang of motorhead thugs.","actors":[{"actorName":"Charlie Sheen","urlProfile":"http://www.imdb.com/name/nm0000221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyNDQ5Nzk2OF5BMl5BanBnXkFtZTcwODU4MTU5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 September 1965","placeOfBirth":" New York City, New York, USA","birthName":"Carlos Irwin Estevez","height":"5' 10\" (1.78 m)","bio":"Charlie Sheen was born Carlos Irwin Estévez on September 3, 1965, in New York City. His father, actor Martin Sheen (born Ramon Antonio Gerard Estevez), was at the time just breaking into the business, with performances on Broadway. His mother, Janet Sheen (née Templeton), was a former New York art student who had met Charlie's father right after he had moved to Manhattan. Martin and Janet had three other children, Emilio Estevez, Renée Estevez, and Ramon Estevez, all of whom became actors. His father is of half Spanish and half Irish descent, and his mother, whose family is from Kentucky, has English and Scottish ancestry. At a young age, Charlie took an interest in his father's acting career. When he was nine, he was given a small part in his dad's movie The Execution of Private Slovik (1974). In 1977, he was in the Philippines where his dad suffered a near-fatal heart attack on the set of Apocalypse Now (1979). While at Santa Monica High School, Charlie had two major interests: acting and baseball. Along with his friends, which included Rob Lowe and Sean Penn, he produced and starred in several amateur Super-8 films. On the Vikings baseball team, he was a star shortstop and pitcher. His lifetime record as a pitcher was 40-15. His interest and skill in baseball would later influence some of his movie roles. Unfortunately, his success on the baseball field did not translate to success in the classroom, as he struggled to keep his grades up. Just a few weeks before his scheduled graduation date, Charlie was expelled due to poor attendance and bad grades. After high school, Charlie aggressively pursued many acting roles. His first major role was as a high school student in the teen war film Red Dawn (1984). He followed this up with relatively small roles in TV movies and low-profile releases. His big break came in 1986 when he starred in Oliver Stone's Oscar winning epic Platoon (1986). He drew rave reviews for his portrayal of a young soldier who is caught in the center of a moral crisis in Vietnam. The success of Platoon (1986) prompted Oliver Stone to cast Charlie in his next movie Wall Street (1987) alongside his father and veteran actor Martin Sheen. The movie with its \"Greed is Good\" theme became an instant hit with viewers. Shortly after, Stone approached Charlie about the starring role in his next movie, Born on the Fourth of July (1989). When Tom Cruise eventually got the part, Sheen ended up hearing the news from his brother Emilio Estevez and not even getting as much as a call from Stone. This led to a fallout, and the two have not worked together since. The fallout with Stone, however, did nothing to hurt Charlie's career in the late 1980s and early '90s, as he continued to establish himself as one of the top box office draws with a string of hits that included Young Guns (1988), Major League (1989), and Hot Shots! (1991). However, as the mid-'90s neared, his good fortune both personally and professionally, soon came to an end. Around this time, Charlie, who had already been to drug rehab, was beginning to develop a reputation as a hard-partying, womanizer. In 1995, the same year he was briefly married to model Donna Peele, he was called to testify at the trial of Hollywood madam Heidi Fleiss. At the trial, while under oath he admitted to spending nearly $50,000 on 27 of Fleiss' $2,500-a-night prostitutes. His downward spiral continued the following year when his ex-girlfriend Brittany Ashland filed charges claiming that he physically abused her. He was later charged with misdemeanor battery to which he pleaded no contest and was given a year's suspended sentence, two years' probation and a $2,800 fine. He finally hit rock bottom in May 1998 when he was hospitalized in Thousand Oaks, California, following a near-fatal drug overdose. Later that month, he was ordered back to the drug rehab center, which he had previously left after one day. During this stretch, Charlie's film career began to suffer as well. He starred in a series of box office flops that included The Arrival (1996) and Shadow Conspiracy (1997). However as the 1990s came to end, so did Charlie's string of bad luck. In 2000, Charlie, now clean and sober, was chosen to replace Michael J. Fox on the ABC hit sitcom Spin City (1996). Though his stint lasted only two seasons, Charlie's performance caught the eye of CBS executives who in 2003 were looking for an established star to help carry their Monday night lineup of sitcoms that included Everybody Loves Raymond (1996). The sitcom Two and a Half Men (2003) starred Charlie as a swinging, irresponsible womanizer whose life changes when his nephew suddenly appears on his doorstep. The show became a huge hit, breathing much needed life into Charlie's fading career. Charlie's personal life also appeared to be improving. In 2002, he married actress Denise Richards, whom he first met while shooting the movie Good Advice (2001). In March 2004, they had a daughter, Sam, and it was announced shortly after that Denise was pregnant with the couple's second child. By all reports, the couple seemed to be very happy together. However, like all of Charlie's previous relationships, the stability did not last long. In March of 2005, Denise, who was six-months pregnant, filed for divorce, citing irreconcilable differences. She gave birth to a second daughter, Lola, in June of that same year. Their divorce became final in late 2006.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyNDQ5Nzk2OF5BMl5BanBnXkFtZTcwODU4MTU5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000221","name":"Charlie Sheen","nicknames":["The Machine","Good Time Charlie","Chuckles","The Warlock from Mars"],"idIMDB":"nm0000221"},"actorId":"nm0000221","character":"Jake Kesey / The Wraith","urlCharacter":"http://www.imdb.com/character/ch0060131","main":true},{"actorName":"Nick Cassavetes","urlProfile":"http://www.imdb.com/name/nm0001024","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNjA2MjI3Nl5BMl5BanBnXkFtZTYwMjkyNjMz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 May 1959","placeOfBirth":" New York City, New York, USA","birthName":"Nicholas David Rowland Cassavetes","height":"6' 6\" (1.98 m)","bio":"Nick Cassavetes was born in New York City, the son of actress Gena Rowlands and Greek-American actor and film director John Cassavetes. As a child, he appeared in two of his father's films: Husbands (1970) and A Woman Under the Influence (1974). After spending so much of his youth surrounded by the film industry, Cassavetes initially decided he did not want to go into the field. He instead attended Syracuse University on a basketball scholarship. His athletic career was effectively ended by an injury, and he decided to rethink his aspirations, ultimately deciding to attend his parents' alma mater, the American Academy of Dramatic Arts in New York. He has appeared in the films, Face/Off (1997), The Wraith (1986), Life (1999), Class of 1999 II: The Substitute (1994), Backstreet Dreams (1990) and The Astronaut's Wife (1999), among others. He has directed several films, including John Q (2002), Alpha Dog (2006), She's So Lovely (1997), Décroche les étoiles (1996), The Notebook (2004), and My Sister's Keeper (2009). He also adapted the screenplay for Blow (2001) and wrote the dialogue for the Justin Timberlake music video, \"What Goes Around... Comes Around\". In 1985, Cassavetes married Isabelle Rafalovich. They had two daughters together, Virginia Cassavetes (Virginia Sara Cassavetes) (born in 1986) and Sasha Cassavetes (born in 1988), before divorcing. He then married Heather Wahlquist (Heather \"Queenie\" Wahlquist), who has appeared in several of his films, including a small role in The Notebook (2004) as Sara, a secondary character and best friend to the female lead Allie Hamilton, portrayed by Rachel McAdams. The movie is effectively a family project, as Cassavetes's own mother, Gena Rowlands, appears as the older, married Allie Calhoun.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNjA2MjI3Nl5BMl5BanBnXkFtZTYwMjkyNjMz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001024","name":"Nick Cassavetes","idIMDB":"nm0001024"},"actorId":"nm0001024","character":"Packard Walsh","urlCharacter":"http://www.imdb.com/character/ch0060130","main":true},{"actorName":"Sherilyn Fenn","urlProfile":"http://www.imdb.com/name/nm0000145","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MDYwNTEyMV5BMl5BanBnXkFtZTYwMzM3NDk1._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 February 1965","placeOfBirth":" Detroit, Michigan, USA","birthName":"Sheryl Ann Fenn","height":"5' 4\" (1.63 m)","bio":"Her childhood was filled with change. Sheryl Ann (later \"Sherilyn\") was the youngest of 3 kids. She and her two older brothers were raised by their musician mom, Arlene Quatro, who moved the family around Michigan. She and her mom went to L.A. when Sherilyn was 17. Within a couple of years, Sherilyn was working in TV and film, with multiple projects every year since 1984. Sherilyn, the petite (5' 4\") beauty, had a small but memorable part in the gender-bender flick Just One of the Guys (1985). Her biggest claim to fame would come in 1990, when she got the prize role of Audrey in Twin Peaks (1990) after reading for all the female leads. Sherilyn made a memorable impression as the cherry stem-twisting siren. This was her breakout role; even now she says of her Twin Peaks (1990) experience: \"It still makes me feel kind of proud and special to be part of something like that\". Her most over-the-top movie role was as the armless, legless star of Boxing Helena (1993) (a role which Kim Basinger backed out of). Back on TV, Sherilyn plays the juicy part of Billie Frank, a former soap actress confronting alcohol and other demons in Rude Awakening (1998) on Showtime. A frequent visitor on the set is her son, Myles. On the set, Sherilyn is noted for having a quirky sense of humor and a joie de vivre. Off-screen, Sherilyn is proud of the friendship she has maintained with her ex-hubby Toulouse Holliday, a musician and film technician. Sherilyn lives with her son, Myles, and two cats: Ophelia and Redmond. Sherilyn practices meditative kundalini yoga, and every room in her house has feng shui elements-- crystals in one corner, water in another. Sherilyn enjoys biking, swimming and cooking, and of course being a mom: \"After I had my son, I found life much funnier and brighter\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MDYwNTEyMV5BMl5BanBnXkFtZTYwMzM3NDk1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000145","name":"Sherilyn Fenn","nicknames":["Sherri"],"idIMDB":"nm0000145"},"actorId":"nm0000145","character":"Keri Johnson","urlCharacter":"http://www.imdb.com/character/ch0060132","main":true},{"actorName":"Randy Quaid","urlProfile":"http://www.imdb.com/name/nm0001642","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NDEwMjU3N15BMl5BanBnXkFtZTcwNjk2MTc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1950","placeOfBirth":" Houston, Texas, USA","birthName":"Randy Randall Rudy Quaid","height":"6' 5\" (1.96 m)","bio":"Randy Quaid is an Academy Award-nominated actor, for his performance in The Last Detail (1973). Hal Ashby directed Quaid in the role of Meadows opposite Jack Nicholson and Otis Young. Quaid is a great and much admired actor that has been recognized by Hollywood and the worlds finest directors, Midnight Exspress, The last Picture Show, Ice Harvest (2005), Real Time (2008), King Carlos in Goya's Ghosts (2006) for director Milos Forman. Forman cast Quaid as \"King Carlos IV of Spain\" after seeing his Golden globe nominated performance as The Colonel in Elvis. Quaid also starred in such main stream favorites as Kingpin (1996), Vacation (1983), Christmas Vacation (1989) and Independence day (1996). Quaid earned a Golden Globe for portraying Lyndon Johnson, and received a Golden Globe Nomination for incarnating \"Colonel\" Tom Parker in Elvis (2005). The portrait of Colonel Parker, a former carnival barker with a murky past, is dark. The New York Times said \"Mr. Quaid is riveting as the bully of Graceland\", when he has Elvis firmly under his thumb, he is the L.B.J. of rock 'n' roll - a towering, wheedling, tirelessly self-promoting Southern fox in the rare instances when Elvis defies him, Colonel Parker shrinks into a hand-wringing phony, cajoling his only client in the overly ornate language of Professor Marvel in \"The Wizard of Oz\". Quaid stars in and was nominated for The Screen Actors Guild Award for Outstanding Performance by a cast for his work in Brokeback Mountain(2005), directed by Ang Lee from a script written by Larry McMurtry, who also wrote The Last Picture Show (1971) in which Quaid had his first feature film role. Working with McMurtry and supporting his material has become a Randy Quaid career tradition. Quaid's performance in Brokeback Mountain (2005) was listed as one of the New York Observer's 2005 Noteworthy male performances.In 2009 Randy Quaid Won the Vancouver Critics Award for Best Male performance in the Feature Film Real Time for the Role of Rubin an Australian Hit Man. Randy Quaid was born in Houston, Texas, to Juanita Bonniedale (Jordan), a real estate agent, and William Rudy Quaid, an electrician. He grew up in the Houston suburban city of Bellaire, along with his brother, actor Dennis Quaid. Quaid is married to American Film Director Evi Quaid.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NDEwMjU3N15BMl5BanBnXkFtZTcwNjk2MTc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001642","name":"Randy Quaid","idIMDB":"nm0001642"},"actorId":"nm0001642","character":"Sheriff Loomis","urlCharacter":"http://www.imdb.com/character/ch0060129","main":true},{"actorName":"Matthew Barry","urlProfile":"http://www.imdb.com/name/nm0058089","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI1MDIxNjU4OF5BMl5BanBnXkFtZTcwMTgwMzc1OA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 September 1962","placeOfBirth":" New York City, New York, USA","bio":"Matthew Barry was born on September 5, 1962 in New York City, New York, USA. He is a casting director and actor, known for Good Guys, The Other Woman (2014) and The Notebook (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI1MDIxNjU4OF5BMl5BanBnXkFtZTcwMTgwMzc1OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0058089","name":"Matthew Barry","idIMDB":"nm0058089"},"actorId":"nm0058089","character":"Billy Hankins","urlCharacter":"http://www.imdb.com/character/ch0060133","main":true},{"actorName":"David Sherrill","urlProfile":"http://www.imdb.com/name/nm0792679","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MTkwMzc0N15BMl5BanBnXkFtZTgwMDcxODAyMDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 November 1959","placeOfBirth":" North Carolina, USA","birthName":"Benjamin David Sherrill","height":"5' 11\" (1.8 m)","bio":"Benjamin David Sherrill was born in North Carolina to Ben Sherrill, a businessman and Alice Bost, a school teacher. Sherrill's father was of English/German descent and his mother is of German/Dutch lineage. He has a younger sister who works for sports, fashion and media giant, IMG World and a younger brother who lives and works in Washington, DC for Homeland Security. Sherrill originally attended Colorado State University as a Wildlife Biology Major but changed course after his sophomore year to become a Theater Major. \"Dave\" as he is know to family and friends performed in numerous plays at CSU until he was encouraged by his theater professor to attend New York University's Tisch School of the Arts where he studied with Sanford Meisner at the Neighborhood Playhouse. While at NYU and working as an intern at Warner Television, Atlantic Records and MTV, Dave landed a small but recurring role in the ABC daytime drama, \"All My Children\". After spending a year on and off the popular soap opera, he decided to complete his training at UCLA's School of Theater, Film & Television. Upon completing his studies at UCLA in 1985 and many auditions later... Dave landed the role that would begin his professional career when he was cast as Skank, a twitchy, mohawked, punk-rock, gang member in the 1986 cult film, \"The Wraith,\" along side Charlie Sheen, Nick Cassavetes, Randy Quaid, Sherilyn Fenn and Clint Howard. Sherrill's career soon began to pick up speed as he followed with his next role opposite Keanu Reeves in Thom Eberhardt's \"The Night Before\". Next, Dave traveled to the Israeli desert to appear in Columbia Pictures',\"The Beast Of War\" with Jason Patric and Steven Bauer. In the late 1980's, Dave appeared in several network television shows which included \"21 Jump Street\" and \"China Beach\". He also received critical notice from Henry Sheehan in the January 3, 1989 issue of Hollywood Reporter for his work in the CBS Movie of the Week, \"Terror On Highway 91,\" opposite Rick Schroeder and Lara Flynn Boyle. Wrote Sheehan, \"The most striking performance comes from sneering, sniveling David Sherrill as the sheriff's crooked son.\" Soon thereafter, Dave would go on to realize his childhood dream when he was cast in the role of Max in Warner Bros.', \"The Rookie,\" opposite his childhood hero, Clint Eastwood who was also the film's director. Sherrill's next television appearance was in 1992 in the recurring role of homeless Gulf War veteran, Sgt. Jack Canner, in the popular FOX television series, \"Beverly Hills, 90210\". His following film role would be as the upwardly mobile, yuppie son of Gena Rowlands in \"Unhook The Stars\" which was written and directed by Nick Cassavetes. Next, Dave starred along side Charlie Sheen and Christopher McDonald in the independent feature film, \"Five Aces\" which garnered The Spirit of Independent Film Award at the Ft. Lauderdale International Film Festival. Dave would later return to North Carolina to portray NASCAR legend and Charlotte Motor Speedway president, H.A. \"Humpy\" Wheeler in the ESPN/Disney television movie, \"3: The Dale Earnhardt Story\" opposite Barry Pepper. Soon thereafter, he was cast in popular television series such as \"One Tree Hill\",\"Surface\" and \"Army Wives\". He soon followed with appearances in several independent feature films that included, \"Insignificant Others\", \"House Of Fallen\" and \"The 27 Club\" for director, Erica Dunton which received recognition at the 2008 Tribeca Film Festival in New York. Most recently, Dave has appeared on television in AMC's series, \"Halt & Catch Fire\" and in the independent feature film, \"Careful What You Wish For\" as Brian Martin, the father of musician-turned-actor, Nick Jonas. Dave is married and resides with his wife Paige, their cat Sammy and white German Shepherd, Zuma.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MTkwMzc0N15BMl5BanBnXkFtZTgwMDcxODAyMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0792679","name":"David Sherrill","idIMDB":"nm0792679"},"actorId":"nm0792679","character":"Skank","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jamie Bozian","urlProfile":"http://www.imdb.com/name/nm0102487","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MDY0NDcwOV5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"bio":"Jamie Bozian is known for his work on Con Air (1997), The Wraith (1986) and She's So Lovely (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1MDY0NDcwOV5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0102487","name":"Jamie Bozian","idIMDB":"nm0102487"},"actorId":"nm0102487","character":"Gutterboy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clint Howard","urlProfile":"http://www.imdb.com/name/nm0397212","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjkyMDU3NDEwMV5BMl5BanBnXkFtZTgwMzM3MjA0MDI@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1959","placeOfBirth":" Burbank, California, USA","birthName":"Clinton E. Howard","height":"5' 7\" (1.7 m)","bio":"Clint Howard also had a recurring role in The Andy Griffith Show, as a little boy always dressed in a cowboy outfit and always eating a peanut butter and jelly sandwich. He never said a word, but was always offering someone a bite. He also had a co-starring role along with a black bear as the owner and friend of Gentle Ben, in that series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjkyMDU3NDEwMV5BMl5BanBnXkFtZTgwMzM3MjA0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0397212","name":"Clint Howard","idIMDB":"nm0397212"},"actorId":"nm0397212","character":"Rughead","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Griffin O'Neal","urlProfile":"http://www.imdb.com/name/nm0641906","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MDk5MjE3M15BMl5BanBnXkFtZTcwMTcxOTgwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 October 1964","placeOfBirth":" Los Angeles, California, USA","birthName":"Griffin Patrick O'Neal","bio":"Griffin O'Neal was born on October 28, 1964 in Los Angeles, California, USA as Griffin Patrick O'Neal. He is an actor, known for April Fool's Day (1986), The Wraith (1986) and The Escape Artist (1982). He is married to JoAnne Berry. They have three children. He was previously married to Rima Belinda Uranga.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MDk5MjE3M15BMl5BanBnXkFtZTcwMTcxOTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641906","name":"Griffin O'Neal","idIMDB":"nm0641906"},"actorId":"nm0641906","character":"Oggie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Nash","urlProfile":"http://www.imdb.com/name/nm0621694","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2OTg1MzkxMF5BMl5BanBnXkFtZTcwMjE1NDAxMw@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1961","placeOfBirth":" Farmington, Connecticut, USA","bio":"Chris Nash was born on April 12, 1961 in Farmington, Connecticut, USA. He is an actor and director, known for Mischief (1985), The Wraith (1986) and Satisfaction (1988).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2OTg1MzkxMF5BMl5BanBnXkFtZTcwMjE1NDAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0621694","name":"Chris Nash","idIMDB":"nm0621694"},"actorId":"nm0621694","character":"Minty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vickie Benson","urlProfile":"http://www.imdb.com/name/nm0072670","urlPhoto":"","biography":{"bio":"Vickie Benson is an actress, known for The Wraith (1986), Bimini Code (1983) and Cheerleader Camp (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0072670","name":"Vickie Benson","idIMDB":"nm0072670"},"actorId":"nm0072670","character":"Waitress","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peder Melhuse","urlProfile":"http://www.imdb.com/name/nm0577699","urlPhoto":"","biography":{"bio":"Peder Melhuse is an actor, known for Frozen (2010), Wayne's World (1992) and The Wraith (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0577699","name":"Peder Melhuse","idIMDB":"nm0577699"},"actorId":"nm0577699","character":"Murphy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeffrey Sudzin","urlProfile":"http://www.imdb.com/name/nm0837244","urlPhoto":"","biography":{"bio":"Jeffrey Sudzin is known for his work on Confessions of a Dangerous Mind (2002), Breakdown (1997) and Idle Hands (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0837244","name":"Jeffrey Sudzin","idIMDB":"nm0837244"},"actorId":"nm0837244","character":"Redd","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Hungerford","urlProfile":"http://www.imdb.com/name/nm0402242","urlPhoto":"","biography":{"dateOfBirth":"10 July 1947","placeOfBirth":" USA","bio":"Michael Hungerford was born on July 10, 1947 in the USA. He was an actor, known for River's Edge (1986), No Way Out (1987) and The Wraith (1986). He died on September 13, 2007 in Santa Monica, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0402242","name":"Michael Hungerford","idIMDB":"nm0402242"},"actorId":"nm0402242","character":"Stokes","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steven Eckholdt","urlProfile":"http://www.imdb.com/name/nm0248692","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MzcxNDI1Ml5BMl5BanBnXkFtZTcwNzc1NTU0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1961","placeOfBirth":" Los Angeles, California, USA","height":"6' 2\" (1.88 m)","bio":"Steven Eckholdt was born on September 6, 1961 in Los Angeles, California, USA. He is an actor and producer, known for Message in a Bottle (1999), It's Like, You Know... (1999) and The Wonderful World of Disney: Santa Who? (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5MzcxNDI1Ml5BMl5BanBnXkFtZTcwNzc1NTU0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0248692","name":"Steven Eckholdt","nicknames":["Mr Perfect"],"idIMDB":"nm0248692"},"actorId":"nm0248692","character":"George in Daytona","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0092240","urlIMDB":"http://www.imdb.com/title/tt0092240","business":{"budget":{"money":"$2,700,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$1,402,535","country":"USA","day":"23","month":"11","year":"1986","remarks":"588 Screens"}],"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1986/\">1986</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 33 min (93 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["MGM Laboratories Inc."],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.9","filmingLocations":[{"location":"2128 East 5th Street - Tucson, Arizona, USA"}],"rated":"PG-13","awards":[],"votes":"10,922","type":"Movie","companyCreditsSimple":[{"idCompany":"co0100389","name":"New Century Entertainment Corporation"},{"idCompany":"co0005210","name":"Alliance Entertainment"},{"idCompany":"co0102338","name":"Turbo Productions"}],"keywords":{"keywords":["pantyhose","gang","police","death","sheriff","arizona","teenager","driving a car","night","invincible enemy","violence","breasts","carsploitation","budweiser","coors beer","female stockinged legs","turbo interceptor","thief","theft","supernatural power","small town","policeman","love","dodge ppg turbo interceptor","car theft","car racing","car race","car goes over cliff","car chase","street racing","bikini","gay slur","cult film","killer car","sex","scar","cult","whipping","sunbathing","male rear nudity","beating","bare butt","abuse","punk","psychotronic","back from the dead","nudity","male nudity","female nudity","bully","bully comeuppance","shotgun","roller skates","motorcycle","cemetery","chevrolet corvette","chase","ghost","switchblade","murder","jealousy","automobile","super car","drag racing","wraith","car crash","explosion","revenge","reincarnation","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 01:42:00"}}