{"data":{"movies":[{"title":"High Plains Drifter","originalTitle":"","year":"1973","releaseDate":"19730822","directors":[{"name":"Clint Eastwood","id":"nm0000142"}],"writers":[{"name":"Ernest Tidyman","id":"nm0862781"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjRmZDg3M2UtNWRhNy00NDVlLWI2ZDktYzJiN2FjNjE5ZDQ5XkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Mystery","Western"],"plot":"A Stranger rides into in the dusty mining town of Lago, where the townspeople are living in the shadow of a dark secret. After a shootout leaves the town's hired-gun protectors dead, the town's leaders petition the Stranger to stay and protect them from three ruthless outlaws who are soon to be released from prison. The three have their sights set on returning to Lago to wreak havoc and take care of some unfinished business. A series of events soon has the townspeople questioning whether siding with the Stranger was a wise idea as they quickly learn the price that they each must pay for his services. As the outlaws make their way back into Lago, they discover that the town is not exactly as they had left it, and waiting in the shadows is the Stranger, ready to expose the town's secret and serve up his own brand of justice.","simplePlot":"A gunfighting stranger comes to the small settlement of Lago and is hired to bring the townsfolk together in an attempt to hold off three outlaws who are on their way.","actors":[{"actorName":"Clint Eastwood","urlProfile":"http://www.imdb.com/name/nm0000142","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDc0MjY0OV5BMl5BanBnXkFtZTcwNzU1MDAxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1930","placeOfBirth":" San Francisco, California, USA","birthName":"Clinton Eastwood Jr.","height":"6' 4\" (1.93 m)","bio":"Perhaps the icon of macho movie stars, and a living legend, Clint Eastwood has become a standard in international cinema. Born May 31, 1930 in San Francisco, the elder of two children in a middle-class family, Eastwood stayed in high school until the comparatively late age of nineteen and worked menial jobs over a period of several years before enrolling at Los Angeles City College, from which he dropped out after two semesters to pursue acting. He found uncredited bit parts in such nondescript B-films as Revenge of the Creature (1955) and Tarantula (1955) during the mid-'50s while simultaneously digging swimming pools for a living, until he got his first breakthrough in the long-running TV series Rawhide (1959) with Eric Fleming. Though only a secondary player in the early seasons, Clint made the show his own by end of its run and became a recognizable face to television viewers around the country. Eastwood found much bigger and better things in Italy with the excellent spaghetti westerns A Fistful of Dollars (1964) and For a Few Dollars More (1965). But it was the third installment in the trilogy where he found one of his signature roles: The Good, the Bad and the Ugly (1966). The movie was a big hit and he became an instant international star. Clint's first American-made western, Hang 'Em High (1968), was yet again a success, and he followed it up with another starring role in Coogan's Bluff (1968) (the loose inspiration to the TV series McCloud (1970)) before playing second fiddle to Richard Burton in the World War II epic Where Eagles Dare (1968) and Lee Marvin in the bizarre musical Paint Your Wagon (1969). In Sierra torride (1970) and Kelly's Heroes (1970), Eastwood went in an experimental direction by combining tough-guy action with offbeat humor. 1971 proved to be one of his best years in film, if not the best. He starred in The Beguiled (1971) and the classic thriller Play Misty for Me (1971), but it was his role as the hard edge police inspector in Dirty Harry (1971) that gave Eastwood one of his signature roles and invented the loose-cannon cop genre that has been imitated even to this day. Eastwood did a fairly consistent quality of work thereafter with the road movies Thunderbolt and Lightfoot (1974) and The Gauntlet (1977), the Dirty Harry sequels Magnum Force (1973) and The Enforcer (1976), the westerns Joe Kidd (1972), High Plains Drifter (1973) and The Outlaw Josey Wales (1976) (his first of six onscreen collaborations with then live-in love Sondra Locke), and the fact-based thriller Escape from Alcatraz (1979). In 1978 he branched out into the comedy genre in Every Which Way But Loose (1978), which became the biggest hit of his career up to that time; taking inflation into account, it still is. In short, notwithstanding The Eiger Sanction (1975), the '70s were an uninterrupted continuation of success. Eastwood kicked off the '80s with Any Which Way You Can (1980), the blockbuster sequel to Every Which Way But Loose. The fourth Dirty Harry film, Sudden Impact (1983), was the highest-grossing film of the franchise and spawned the character's trademark catchphrase, \"Make my day\". Clint also starred in Bronco Billy (1980), Firefox (1982), Tightrope (1984), City Heat (1984), Pale Rider (1985) and Heartbreak Ridge (1986), all of which were solid hits, with Honkytonk Man (1982) being his only commercial failure of the period. In 1988 he did his fifth and final Dirty Harry movie, The Dead Pool (1988). Although it was a success overall, it did not have the box office punch the previous films had. About this time, with outright bombs like Pink Cadillac (1989) and The Rookie (1990), it became apparent that Eastwood's star was declining as it never had before. He then started taking on more personal projects, such as directing Bird (1988), a biopic of Charlie Parker, and starring in and directing White Hunter Black Heart (1990), an uneven, loose biopic of John Huston. Eastwood bounced back in a big way with his western Unforgiven (1992), which garnered the then 62-year-old his first ever Academy Award nomination (Best Actor) and win for Best Director. Following up with a quick hit, he took on the secret service in In the Line of Fire (1993), then accepted second billing to Kevin Costner in the interesting but poorly received drama A Perfect World (1993). Next up was a love story, The Bridges of Madison County (1995), where Clint surprised audiences with a sensitive performance, but it soon became apparent he was going backwards after his brief revival. Subsequent films were credible, but nothing really stuck out. Among them were the moderately well-received Absolute Power (1997) and Space Cowboys (2000) as well as the badly received True Crime (1999) and Blood Work (2002). But Eastwood surprised yet again, returning to the top of the A-list with the hugely successful boxing drama Million Dollar Baby (2004). The movie earned him an Oscar for Best Director and a Best Actor nomination for the second time. Behind the camera, he had big successes directing the multi-award-winners Mystic River (2003), Flags of Our Fathers (2006), Letters from Iwo Jima (2006) and Changeling (2008) which starred Angelina Jolie. His next starring vehicle, Gran Torino (2008), earned $30 million in its opening weekend, proving his box office appeal has not waned. Eastwood has managed to keep his extremely convoluted personal life top secret and never discusses his families with the media. He had a long time relationship with frequent co-star Locke and has at least eight children by at least six other women, although he has only been married twice. Clint Eastwood lives in Los Angeles and owns homes in Monterey, Northern California, Idaho and Hawaii.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDc0MjY0OV5BMl5BanBnXkFtZTcwNzU1MDAxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000142","name":"Clint Eastwood","idIMDB":"nm0000142"},"actorId":"nm0000142","character":"The Stranger","urlCharacter":"http://www.imdb.com/character/ch0006029","main":true},{"actorName":"Verna Bloom","urlProfile":"http://www.imdb.com/name/nm0089244","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNDk2NTY0M15BMl5BanBnXkFtZTcwNTcwMzYwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1939","placeOfBirth":" Lynn, Massachusetts, USA","birthName":"Verna Frances Bloom","bio":"Verna Bloom was born on August 7, 1939 in Lynn, Massachusetts, USA as Verna Frances Bloom. She is an actress, known for High Plains Drifter (1973), After Hours (1985) and The Last Temptation of Christ (1988). She has been married to Jay Cocks since July 15, 1972.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNDk2NTY0M15BMl5BanBnXkFtZTcwNTcwMzYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0089244","name":"Verna Bloom","idIMDB":"nm0089244"},"actorId":"nm0089244","character":"Sarah Belding","urlCharacter":"http://www.imdb.com/character/ch0006039","main":true},{"actorName":"Marianna Hill","urlProfile":"http://www.imdb.com/name/nm0384494","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MTc3NTEzOF5BMl5BanBnXkFtZTcwMzIzMDU4Mg@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1942","placeOfBirth":" Santa Barbara, California, USA","birthName":"Mariana Schwarzkopf","height":"5' 4\" (1.63 m)","bio":"A familiar character actress, Mariana Hill was the daughter of a building contractor, who moved his family around. In addition to living in her native Southern California, Hill has lived in Canada, Spain and Great Britain. As a result, she learned and became quite accomplished in doing different accents and dialects. Whether it's a French accent (from a guest appearance on My Three Sons (1960)) or German (Hogan's Heroes (1965)), Hill could be counted on to belt it out. She started acting while a teenager, apprenticing at the La Jolla (Calif.) Playhouse, and also studied at the Neighborhood Playhouse in New York City. Having beautiful, exotic looks certainly didn't hurt her either as she has played a Hawaiian girl, Irish lass and Greek beauty. In addition, she has been a model and was an acting coach and teacher at the Lee Strasberg Institute in London.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4MTc3NTEzOF5BMl5BanBnXkFtZTcwMzIzMDU4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0384494","name":"Marianna Hill","idIMDB":"nm0384494"},"actorId":"nm0384494","character":"Callie Travers","urlCharacter":"http://www.imdb.com/character/ch0006045","main":true},{"actorName":"Mitchell Ryan","urlProfile":"http://www.imdb.com/name/nm0752751","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3ODQ5OTUzM15BMl5BanBnXkFtZTYwOTAzNjcz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1928","placeOfBirth":" Louisville, Kentucky, USA","height":"6' (1.83 m)","bio":"American character actor born in Cincinnati and raised in Louisville, Mitchell Ryan is a well known supporting actor in films and television. During his term in the Navy in 1951, he was assigned to the Special Services Entertainment and became hooked on acting. After his term in the Navy, he appeared in dozens of plays until he received notice as playing a regular in TV's Dark Shadows (1966) for three years. Beginning in the 70s, he received work in motion pictures including Monte Walsh (1970), Magnum Force (1973) and in Clint Eastwood's High Plains Drifter (1973). He had a small part in Universal's Midway (1976) and returned to act in numerous soaps and television series, among them included a recurring guest role in Having Babies (1978), Executive Suite (1976), The Chisholms (1979) and All My Children (1970) and a growing list of television films and TV guest appearances. Ryan is probably best known for portraying the villain that Mel Gibson and Danny Glover are after in Lethal Weapon (1987), but his career included several supporting roles in the past ten years including Judge Dredd (1995), Michael Myers' nemesis in Halloween: The Curse of Michael Myers (1995), Liar Liar (1997) with Jim Carrey and as Harrison Ford's chief out to get Brad Pitt in The Devil's Own (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3ODQ5OTUzM15BMl5BanBnXkFtZTYwOTAzNjcz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0752751","name":"Mitchell Ryan","idIMDB":"nm0752751"},"actorId":"nm0752751","character":"Dave Drake","urlCharacter":"http://www.imdb.com/character/ch0124417","main":true},{"actorName":"Jack Ging","urlProfile":"http://www.imdb.com/name/nm0319978","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmVjMjZkMDAtM2VkYS00NzE1LTgxYmEtZjQxMWIwY2VjZGMwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1931","placeOfBirth":" Alva, Oklahoma, USA","birthName":"Jack Lee Ging","height":"5' 8½\" (1.74 m)","bio":"Jack Ging was born on November 30, 1931 in Alva, Oklahoma, USA as Jack Lee Ging. He is an actor, known for The Eleventh Hour (1962), High Plains Drifter (1973) and Play Misty for Me (1971). He has been married to Sharon Ramona Thompson since September 23, 1978. They have two children. He was previously married to Gretchen Louise Graening and Katie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmVjMjZkMDAtM2VkYS00NzE1LTgxYmEtZjQxMWIwY2VjZGMwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0319978","name":"Jack Ging","nicknames":["Jackie"],"idIMDB":"nm0319978"},"actorId":"nm0319978","character":"Morgan Allen","urlCharacter":"http://www.imdb.com/character/ch0006049","main":true},{"actorName":"Stefan Gierasch","urlProfile":"http://www.imdb.com/name/nm0317369","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2NDk5OTc2NV5BMl5BanBnXkFtZTcwMjkwMjYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1926","placeOfBirth":" New York City, New York, USA","bio":"Stefan Gierasch was born on February 5, 1926 in New York City, New York, USA. He was an actor, known for Carrie (1976), The Hustler (1961) and High Plains Drifter (1973). He was married to Hedy Sontag and Jane E. Churchman. He died on September 6, 2014 in Santa Monica, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2NDk5OTc2NV5BMl5BanBnXkFtZTcwMjkwMjYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0317369","name":"Stefan Gierasch","idIMDB":"nm0317369"},"actorId":"nm0317369","character":"Mayor Jason Hobart","urlCharacter":"http://www.imdb.com/character/ch0006046","main":true},{"actorName":"Ted Hartley","urlProfile":"http://www.imdb.com/name/nm0366894","urlPhoto":"","biography":{"dateOfBirth":"6 November 1924","placeOfBirth":" Omaha, Nebraska, USA","birthName":"Theodore Ringwalt Hartley","bio":"Ted Hartley was born on November 6, 1924 in Omaha, Nebraska, USA as Theodore Ringwalt Hartley. He is an actor and producer, known for High Plains Drifter (1973), Barefoot in the Park (1967) and Race to Witch Mountain (2009). He has been married to Dina Merrill since November 18, 1989.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0366894","name":"Ted Hartley","idIMDB":"nm0366894"},"actorId":"nm0366894","character":"Lewis Belding","urlCharacter":"http://www.imdb.com/character/ch0006050","main":true},{"actorName":"Billy Curtis","urlProfile":"http://www.imdb.com/name/nm0193260","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMTk2NDQ4Ml5BMl5BanBnXkFtZTcwNTI2ODc4Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 June 1909","placeOfBirth":" Springfield, Massachusetts, USA","birthName":"Luigi Curto","height":"4' 2\" (1.27 m)","bio":"Diminutive American actor Billy Curtis avoided the usual onus of freak-show employment as a youth, opting for a mainstream job as a shoe clerk. Encouraged by stock company actress Shirley Booth to take a little person role in a stage production, Curtis soon became a professional actor, with numerous Broadway musical productions to his credit. Curtis' big movie season was 1938-39: he was cast in The Wizard of Oz (1939) (albeit with voice dubbed by Pinto Colvig) and as the cowboy hero of the all-dwarf western The Terror of Tiny Town (1938). This last epic was one of the few instances that Curtis was cast as a good guy; many of his screen characters were ill-tempered and pugnacious, willing to bite a kneecap if unable to punch out an opponent. Seldom accepting a role which demeaned or patronized little people, Curtis played an obnoxious vaudeville performer compelled to sit on Gary Cooper's lap in Meet John Doe (1941), a suspicious circus star willing to turn Robert Cummings over to the cops in Saboteur (1942), and one of the many fair-weather friends of The Incredible Shrinking Man (1957). Billy Curtis' career thrived into the 1970s, notably with solid parts in the Clint Eastwood western High Plains Drifter (1973) and the crime-caper melodrama Little Cigars (1973), in which he had second billing as a diminutive criminal mastermind. Billy Curtis retired in the 1980s, except for the occasional interview or Wizard of Oz cast reunion.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMTk2NDQ4Ml5BMl5BanBnXkFtZTcwNTI2ODc4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0193260","name":"Billy Curtis","idIMDB":"nm0193260"},"actorId":"nm0193260","character":"Mordecai","urlCharacter":"http://www.imdb.com/character/ch0006042","main":true},{"actorName":"Geoffrey Lewis","urlProfile":"http://www.imdb.com/name/nm0507212","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjM0MDU0MF5BMl5BanBnXkFtZTYwOTQ0NDky._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1935","placeOfBirth":" Plainfield, New Jersey, USA","birthName":"Geoffrey Bond Lewis","height":"5' 9\" (1.75 m)","bio":"Talented and highly capable character actor Geoffrey Lewis, with rustic (sometimes sour-faced) looks, grew up in Rhode Island but was moved out to California at the age of ten. Lewis was very keen on the dramatic arts at high school, but often preferred to put on his own one-man shows rather than participate in larger school productions. His drama teacher took note of his growing talent and referred him to the Plymouth Theater in Massachusetts, where he appeared in summer stock. Afterwards he appeared in several off-Broadway productions in New York City. After spending considerable time traveling, in both the United States and abroad, Lewis turned his attention back to his love of the dramatic arts, and scored his first minor movie role in The Culpepper Cattle Co. (1972) as a somewhat jovial but deadly cowhand. He then cropped up as gangster Harry Pierpont in Dillinger (1973) before beginning a long association with Clint Eastwood, starting off with High Plains Drifter (1973), then as kind-hearted thief Eddie Goody in Thunderbolt and Lightfoot (1974), as Clint's buddy Orville Boggs in Every Which Way But Loose (1978) and Any Which Way You Can (1980), then as a henpecked husband in Bronco Billy (1980), as Ricky Z in Pink Cadillac (1989), and in Midnight in the Garden of Good and Evil (1997). Equally busy on the small screen, he has guest-starred in dozens of episodes of high profile TV series. Additionally, he received a Golden Globe nomination for his performance in the series Flo (1980). Apart from his extensive film and TV exposure, Lewis is also a member of the rather unique musical/storytelling \"Celestial Navigations,\" along with award-winning composer songwriter Geoff Levin. Their performances have received terrific reviews from some of Hollywood's top actors and noted musicians, including Chick Corea. As Geoffrey Lewis approaches his seventh decade, nothing seems likely to slow down this multi-talented actor, storyteller and engaging entertainer!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjM0MDU0MF5BMl5BanBnXkFtZTYwOTQ0NDky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0507212","name":"Geoffrey Lewis","idIMDB":"nm0507212"},"actorId":"nm0507212","character":"Stacey Bridges","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott Walker","urlProfile":"http://www.imdb.com/name/nm0908198","urlPhoto":"","biography":{"bio":"Scott Walker is an actor, known for High Plains Drifter (1973), The Muppet Movie (1979) and Orca (1977).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0908198","name":"Scott Walker","idIMDB":"nm0908198"},"actorId":"nm0908198","character":"Bill Borders","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Walter Barnes","urlProfile":"http://www.imdb.com/name/nm0055812","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGJiZWJhYTUtNTkzZC00MjZmLTk4ZTYtOWU1MjE5MTkyYTNkXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 January 1918","placeOfBirth":" Parkersburg, West Virginia, USA","birthName":"Walter Lee Barnes","height":"6' 1\" (1.85 m)","bio":"An American character actor described to some as a 'rugged outdoor western/war type', proved to be Walter Barnes status in motion pictures for nearly thirty years. A pro football player, Barnes made a mark into playing roles in pictures with his performance in the 1957 film \"Westbound\". Although, Barnes found work in countless foreign films of the 1960s, he usually played roles ranging from crusty law officals to occasional villians, in notable roles in \"Captain Sinbad\", John Wayne's \"Cahill US Marshal\", Clint Eastwood's \"High Plains Drifter\", \"Pete's Dragon\" and \"Day of the Animals\". Also as a veteran of television, Barnes has had guest starring roles in such series including \"Gunsmoke\", \"Rawhide\" and \"Cheyenne\". He also played Bo Svenson's father on the early 80s TV series \"Walking Tall\" and appeared in the 1985-86 mini series \"North and South\". A diabetic, Barnes retired from acting in the late 1980s and eventually moved into the Motion Picture and Television Retirement Home in Woodland Hills, California, where he passed away in January of 1998.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGJiZWJhYTUtNTkzZC00MjZmLTk4ZTYtOWU1MjE5MTkyYTNkXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0055812","name":"Walter Barnes","nicknames":["Piggy"],"idIMDB":"nm0055812"},"actorId":"nm0055812","character":"Sheriff Sam Shaw","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Brinegar","urlProfile":"http://www.imdb.com/name/nm0109495","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5OTEyOTUwM15BMl5BanBnXkFtZTgwOTczOTEwMjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 December 1917","placeOfBirth":" Tucumcari, New Mexico, USA","birthName":"Paul Alden Brinegar","bio":"Paul Brinegar was born on December 19, 1917 in Tucumcari, New Mexico, USA as Paul Alden Brinegar. He was an actor, known for Rawhide (1959), Maverick (1994) and High Plains Drifter (1973). He was married to Shirley Talbott. He died on March 27, 1995 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5OTEyOTUwM15BMl5BanBnXkFtZTgwOTczOTEwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0109495","name":"Paul Brinegar","idIMDB":"nm0109495"},"actorId":"nm0109495","character":"Lutie Naylor","urlCharacter":"http://www.imdb.com/character/ch0006047","main":true},{"actorName":"Richard Bull","urlProfile":"http://www.imdb.com/name/nm0119993","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5Mzg3NjE1OF5BMl5BanBnXkFtZTcwMjgzMjYxOA@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1924","placeOfBirth":" Zion, Illinois, USA","bio":"Richard Bull was born on June 26, 1924 in Zion, Illinois, USA. He was an actor, known for Little House on the Prairie (1974), Normal (2003) and The Thomas Crown Affair (1968). He was married to Barbara Collentine. He died on February 3, 2014 in Calabasas, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE5Mzg3NjE1OF5BMl5BanBnXkFtZTcwMjgzMjYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0119993","name":"Richard Bull","nicknames":["Dick"],"idIMDB":"nm0119993"},"actorId":"nm0119993","character":"Asa Goodwin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Donner","urlProfile":"http://www.imdb.com/name/nm0232817","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM3ODY0MDU2Nl5BMl5BanBnXkFtZTcwMDI0MTYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 April 1931","placeOfBirth":" New York City, New York, USA","birthName":"Robert E. Morris","bio":"Robert Donner was born in New York City and grew up in New Jersey, Michigan and Texas. Robert joined the Navy after he graduated from high school and served almost 4 years. After he left the Navy he stayed on the West Coast and worked as a shipping clerk, salesman, bartender, commercial artist, gardener, and insurance investigator. Robert attended San Fernando Valley State College (now California State University, Northridge), at nights taking courses in Art History, Psychology and speech. During this time, Robert Donner lived in Studio City and became friends with actor Clint Eastwood who lived in his apartment building. Clint urged Robert to study drama, telling him he was humorous and had a good face. When Robert was not acting he was active in athletics, and was known as one of Hollywood's most enthusiastic golfers. He was a member of the former \"Hollywood Hackers\" and carried a seven handicap and was the leader of a group of entertainment industry professionals known as Don Porter's Thursday Golf Group as well as joining others at many of the Celebrity Golf Tournaments who raise money for various charities around the world. Robert also played in many tennis tournaments and was frequently called upon during \"Celebrity Nights\" in which he performed stand-up comedy and promised not to sing. His reputation in this area also led him to become known as one of Hollywood's \"in demand\" Corporate Speakers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM3ODY0MDU2Nl5BMl5BanBnXkFtZTcwMDI0MTYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0232817","name":"Robert Donner","idIMDB":"nm0232817"},"actorId":"nm0232817","character":"Preacher","urlCharacter":"http://www.imdb.com/character/ch0006041","main":true},{"actorName":"John Hillerman","urlProfile":"http://www.imdb.com/name/nm0384916","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyODA0MDQxM15BMl5BanBnXkFtZTcwNDM2MzYwOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 December 1932","placeOfBirth":" Denison, Texas, USA","birthName":"John Benedict Hillerman","height":"5' 7\" (1.7 m)","bio":"John Hillerman was born on December 20, 1932 in Denison, Texas, USA as John Benedict Hillerman. He is an actor, known for Magnum, P.I. (1980), Chinatown (1974) and Blazing Saddles (1974).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyODA0MDQxM15BMl5BanBnXkFtZTcwNDM2MzYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0384916","name":"John Hillerman","idIMDB":"nm0384916"},"actorId":"nm0384916","character":"Bootmaker","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0068699","urlIMDB":"http://www.imdb.com/title/tt0068699","business":{"budget":{"money":"$5,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"SEK","country":"1,512,351","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1972/\">1972</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 45 min (105 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["2,660 m (Sweden, cut)"],"negativeFormat":["35 mm (Eastman 100T 5254)"],"cinematographicProcess":["Panavision"],"printedFilmFormat":["35 mm"]},"rating":"7.6","filmingLocations":[{"location":"Inyo National Forest, California, USA"}],"rated":"R","awards":[],"votes":"38,553","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"},{"idCompany":"co0102264","name":"Malpaso Company, The"}],"keywords":{"keywords":["outlaw","gunfighter","gravestone","revenge","small town","rape","dwarf","anti hero","beating","desert","prison","vengeance","shootout","sequel","friends who live together","blood splatter","street shootout","19th century","anger","shot in the back","convict","mexican","knife","gun shop","hysteria","preacher","bullwhip","shot to death","sex scene","six gun","straight razor","gunshot","graveyard","frontier town","barber","arson","coffin","torch","church bell","slut","husband wife relationship","human shield","punched in the face","guilt","signal","beaten to death","candle","foot chase","torture","horse and wagon","greed","burial","pantaloon","explosion","cult film","cowboy boots","cowboy shirt","cowboy","cowboy hat","cigar smoking","man with no name","hitman","hotel fight","sex in a hotel","outlaw gang","gunslinger","seduction","poetic justice","blonde","kiss","disarming someone","colt .45","revolver","stabbed with a stick","winchester rifle","repeating rifle","six shooter","brutality","violence","gun violence","whip","stylized violence","gun fu","gunfight","western town","suspense","one against many","one man army","western hero","hero","ressentiment","mystery man","red paint","sex in a barn","quick draw","ghost","town tamer","maverick","fear","blood","whipping","unhappy marriage","tombstone","stable","stabbed in the throat","spit in the face","spirit","shaving","saloon","release from prison","paint","native american","minister","mayor","lake","hotel","hell","hanging","general store","fire","fata morgana","dynamite","dream","directed by star","cowardice","corruption","church","cemetery","betrayal","bathtub","barbershop","assault","arizona","ambush","adultery","1880s","shot in the forehead","savior","drifter","coat","murder","flashback","sheriff","showdown","midget","kissing while having sex"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:45:52"}}