{"data":{"movies":[{"title":"The Masque of the Red Death","originalTitle":"","year":"1964","releaseDate":"19691008","directors":[{"name":"Roger Corman","id":"nm0000339"}],"writers":[{"name":"Charles Beaumont","id":"nm0064579"},{"name":"R. Wright Campbell","id":"nm0132790"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjFjYmZmZDctZWUzZS00ZDY2LWE1MGMtMTIwMDAxODgzN2ZhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA","UK"],"languages":["English","Latin"],"genres":["Horror"],"plot":"The evil Prince Prospero is riding through the Catania village when he sees that the peasants are dying of Red Death plague. Prospero asks to burn down the village and he is offended by the villagers Gino and his father-in-law Ludovico. He decides to kill them, but Gino's wife, the young and beautiful Francesca, begs for the lives of her husband and her father and Prospero brings them alive to his castle expecting to corrupt Francesca. Propero worships Satan and invites his noble friends to stay in his castle that is a shelter of depravity against the plague. When Prospero invites his guests to attend a masked ball, he sees a red hooded stranger and he believes that Satan himself has attended his party. But soon he learns who his mysterious guest is.","simplePlot":"A European prince terrorizes the local peasantry while using his castle as a refuge against the \"Red Death\" plague that stalks the land.","actors":[{"actorName":"Vincent Price","urlProfile":"http://www.imdb.com/name/nm0001637","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1OTEyNzcyNl5BMl5BanBnXkFtZTYwMTgwOTU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 May 1911","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Vincent Leonard Price Jr.","height":"6' 4\" (1.93 m)","bio":"Actor, writer, and gourmet, Vincent Leonard Price, Jr. was born in St Louis, Missouri, to Marguerite Cobb (Wilcox) and Vincent Leonard Price, Sr., president of the National Candy Company. He traveled through Europe, studied at Yale and became an actor. He made his screen debut in 1938, and after many minor roles, he began to perform in low-budget horror movies such as House of Wax (1953), achieving his first major success with House of Usher (1960). Known for his distinctive, low-pitched, creaky, atmospheric voice and his quizzical, mock-serious facial expressions, he went on to star in a series of acclaimed Gothic horror movies, such as Pit and the Pendulum (1961) and The Abominable Dr. Phibes (1971). He abandoned films in the mid-1970s, going on to present cooking programs for television - he wrote \"A Treasury of Great Recipes\" (1965) with his second wife, Mary Grant - but had two final roles in The Whales of August (1987) and Edward Scissorhands (1990). He also recorded many Gothic horror short stories for the spoken-word label Caedmon Records. Vincent Price died at age 82 of lung cancer and emphysema on October 25, 1993.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1OTEyNzcyNl5BMl5BanBnXkFtZTYwMTgwOTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001637","name":"Vincent Price","nicknames":["The King of the Grand Guignol","The Merchant of Menace","The Renaissance Man"],"idIMDB":"nm0001637"},"actorId":"nm0001637","character":"Prince Prospero","urlCharacter":"http://www.imdb.com/character/ch0096952","main":true},{"actorName":"Hazel Court","urlProfile":"http://www.imdb.com/name/nm0183764","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNTc0MzkwMl5BMl5BanBnXkFtZTcwMDAzMTU2NA@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1926","placeOfBirth":" Sutton Coldfield, Birmingham, England, UK","bio":"Born in Birmingham, England, Hazel Court carried on a love affair with the world of movies and make-believe that made her a leading student at her hometown's School of Drama and later helped her land a contract with the J. Arthur Rank Organisation. Graduating from bits to supporting roles to leads, Court worked in English films from the mid-'40s until the early 1960s, when she relocated to Hollywood. The flame-haired Court was married to Irish actor Dermot Walsh before she married American actor-director Don Taylor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNTc0MzkwMl5BMl5BanBnXkFtZTcwMDAzMTU2NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0183764","name":"Hazel Court","nicknames":["The Queen of Scream","The Gothic Fox"],"idIMDB":"nm0183764"},"actorId":"nm0183764","character":"Juliana","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jane Asher","urlProfile":"http://www.imdb.com/name/nm0038870","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzYxMTcwNzQ0MF5BMl5BanBnXkFtZTcwNDMxMjk5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 April 1946","placeOfBirth":" Marylebone, London, England, UK","height":"5' 6\" (1.68 m)","bio":"Jane Asher (born 5 April 1946) is an English actress, author and entrepreneur, who achieved early fame as a child actress, and has worked extensively in film and TV throughout her career. She has appeared in TV shows and films such as The Masque of the Red Death (1964), Alfie (1966), Deep End (1970), The Mistress (1985-1987), Crossroads (2001-2003), Death at a Funeral (2007) and The Old Guys (2009-). She is also known for supplying specialist cakes and kitchenware, as well as publishing three bestselling novels. Asher was the middle of three children born to Richard Alan John and Margaret Asher, née Eliot, in Willesden, North West London. Her father was a consultant in blood and mental diseases at the Central Middlesex Hospital, as well as being a broadcaster and the author of notable medical articles. Asher's mother was a professor at the Guildhall School of Music and Drama. Asher attended Queen's College in Harley Street, London and is the elder sister of Clare Asher, a radio actress and school inspector. Asher's elder brother is record producer Peter Asher, of Peter and Gordon. She was a key figure of 1960s show-business society as the fiancée of Paul McCartney. Asher met the illustrator Gerald Scarfe in 1971, and they married ten years later. They have three children, daughter actress Katie Scarfe (born April 17, 1974), and sons Alex Scarfe (born December 1981) and Rory (born 1984).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzYxMTcwNzQ0MF5BMl5BanBnXkFtZTcwNDMxMjk5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0038870","name":"Jane Asher","idIMDB":"nm0038870"},"actorId":"nm0038870","character":"Francesca","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Weston","urlProfile":"http://www.imdb.com/name/nm0922935","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTViYWYxN2UtZTZlZi00NWQ2LTg2NmQtZTE4ZTMyYmE0NjQyXkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 July 1938","placeOfBirth":" Norwood, London, England, UK","bio":"David Weston was born on July 28, 1938 in Norwood, London, England. He is an actor, known for Becket (1964), The Masque of the Red Death (1964) and The Heroes of Telemark (1965).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTViYWYxN2UtZTZlZi00NWQ2LTg2NmQtZTE4ZTMyYmE0NjQyXkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0922935","name":"David Weston","idIMDB":"nm0922935"},"actorId":"nm0922935","character":"Gino","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nigel Green","urlProfile":"http://www.imdb.com/name/nm0338210","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMDEyMDkzNzVeQTJeQWpwZ15BbWU4MDIxMTYyMDIx._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1924","placeOfBirth":" Pretoria, South Africa","height":"6' 4\" (1.93 m)","bio":"The character actor Nigel Green, born in Pretoria, South Africa, in 1924, was educated in England and studied chemical engineering before winning a scholarship to the Royal Academy of Dramatic Art in London. By age 24, he was appearing on stage at both the Old Vic and Stratford-on-Avon, and in the early 1950s, he made his film and television debuts. In 1956, he received serious injuries in an accident, but he fully recovered and established himself as a familiar figure in British film and television. His forceful, dominant manner inevitably led Green to military and authoritarian roles throughout his career while his tall, muscular physique was appropriate for playing such characters as Fertog \"The Bear\" in the television series William Tell (1958), Little John in Sword of Sherwood Forest (1960), and Hercules in Jason and the Argonauts (1963). Green had a number of small film roles in the early 1960s until his appearance in the critically acclaimed Zulu (1964), after which his film roles improved. Perhaps his best-known performance is that of Michael Caine 's superior in the stylish spy film The Ipcress File (1965). In addition to a few British horror films, such as The Skull (1965), The Face of Fu Manchu (1965), and Countess Dracula (1971), Green also appeared in a number of Hollywood films, including Tobruk (1967), The Wrecking Crew (1968) and The Kremlin Letter (1970). Green's later films brought him international recognition and a chance at stardom; however, his career was brought to an abrupt end by his sudden death in 1972 at age 47 from an accidental overdose of sleeping pills.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMDEyMDkzNzVeQTJeQWpwZ15BbWU4MDIxMTYyMDIx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0338210","name":"Nigel Green","idIMDB":"nm0338210"},"actorId":"nm0338210","character":"Ludovico","urlCharacter":"http://www.imdb.com/character/ch0565000","main":true},{"actorName":"Patrick Magee","urlProfile":"http://www.imdb.com/name/nm0535861","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTRhMzg2N2UtN2E5ZC00MDI2LTljNDMtZTFlNWJiZGQyOWNiXkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1922","placeOfBirth":" Armagh, Northern Ireland, UK","birthName":"Patrick Joseph Gerard Magee","height":"5' 8\" (1.73 m)","bio":"Born in Armagh, Northern Ireland, Patrick Magee is a classic example of how certain actors rate the stage far more highly than the screen. Magee was well aware that the vast majority of the films that he appeared in were dreadful (he mostly played sinister villains in horror films), but the money came in very handy in financing his distinguished stage work (he was a favorite actor of Samuel Beckett one of whose greatest plays, 'Krapp's Last Tape', was written specifically for him). However, he did do some outstanding work on film, most notably in Stanley Kubrick's A Clockwork Orange (1971) as the crippled writer Mr.Alexander, and in Kubrick's Barry Lyndon (1975), as the chevalier. He also appeared in Joseph Losey's The Servant (1963), Peter Brook's Marat/Sade (1967) and William Friedkin's The Birthday Party (1968). He also appeared in films by such cult directors as Roger Corman, Lucio Fulci and Walerian Borowczyk.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTRhMzg2N2UtN2E5ZC00MDI2LTljNDMtZTFlNWJiZGQyOWNiXkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0535861","name":"Patrick Magee","idIMDB":"nm0535861"},"actorId":"nm0535861","character":"Alfredo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Whitsun-Jones","urlProfile":"http://www.imdb.com/name/nm0926402","urlPhoto":"","biography":{"dateOfBirth":"5 April 1923","placeOfBirth":" Newport, Monmouthshire, Wales, UK","bio":"Going through old copies of the Radio Times and scanning the cast lists of vintage television productions, some names keep turning up, over and over again. Peter Cushing and Donald Pleasence, prior to their horror stardom; Yvonne Mitchell, Andre Morell, Roger Delgado, Barry Letts, Patrick Troughton, John Robinson; and Paul Whitsun-Jones was another example of this breed. Corpulent, with thick black hair and often seen as appropriately solid authority figures, whether comically pompous or threatening in an oily manner, Whitsun-Jones facially resembled a heftier and rather bad-tempered version of Peter Bowles; his Avengers appearances are pretty representative of his work, respectively taking in Government man, fat villain and eccentric innocent bystander. Given the bluff, very old-school image he often projected, it's slightly surprising to find he was actually born in Wales, in 1923, though less surprisingly this was in Monmouthshire, near the border with England. One of his early TV credits was a ground-breaking one for the medium; The Quatermass Experiment (1953) (BBC), the first adventure for Nigel Kneale's scientist hero, who after masterminding an early space mission has to take action when one of the astronauts (played by Duncan Lamont from \"Stay Tuned\") comes under the control of an alien, mutating creature. In typical 50s gear of trilby and trenchcoat, Whitsun-Jones was a regular in the series (or serial as it would have been called then), playing James Fullalove, an ironically named, cynical newspaper columnist who complicates matters by attempting to get to the unfortunate astronaut. (In Kneale's work, journalists are always bad news.) Only the first two episodes of this - \"Contact Has Been Established\" and \"Persons Reported Missing\" - exist today, the BBC at the time deciding against recording the last four; whether this was because they were not satisfied with the poorly lit, distinctly indistinct picture quality of the first two, or if the still-new process of telerecording was simply too expensive, is debatable. Famously, its prefacing continuity announcement contained the warning that the programme was not suitable for \"those of you who may have a nervous disposition\", or children. By contrast, The Gordon Honour (BBC, 1956), was a children's series, hovering somewhere between drama and comedy, about two feuding families called the Gordons and the Fitzwilliams, their rivalry centring around a candlestick, with the Fitzwilliams generally on the losing side. It ran for two series, from which no episodes exist now; each episode took place at a different point in history, but with the same actors playing the various family members, among them Roger Delgado, in a tailor-made role as a sword-wielding Spaniard, and Whitsun-Jones as a family butler. Occasional guest stars included the great Arthur Lowe from \"Dead Man's Treasure\" and Dad's Army. In the first of several roles opposite Roger Moore, Ivanhoe, \"The Gentle Jester\" (Screen Gems, 1958) saw Whitsun-Jones as Sir Maverick, a fellow supporter of King Richard who seeks a replacement jester, after which it was a real switch for a deeply unusual entry in Sydney Newman's normally realistic Armchair Theatre, \"Death of Satan\" (ABC, 1958), set in Hell, in which he played Oscar Wilde, who along with Lord Byron was found to be rather enjoying himself there. In the theatre, Whitsun-Jones was in the original West End production of Oliver!, by Lionel Bart out of Charles Dickens, in 1960, with Ron Moody (seen in \"Honey for the Prince\" and \"The Bird Who Knew Too Much\") giving it 100% as Fagin, as he would in the film, which Whitsun-Jones wasn't in. The latter's next TV series was Bonehead (1957) (BBC), a children's sitcom which went out in the same early Saturday evening slot (around 5.30) later filled by Doctor Who. Colin Douglas, a heavily built actor who later starred on the early 70s WW2 series A Family At War, had the title role of a dim Cockney villain in a bowler hat, Whitsun-Jones was The Boss, and each week their gang's criminal plottings ended in slapstick disaster. Unlike the career of its writer-producer, Shaun Sutton, who ended up becoming Head of Drama at the BBC, then oversaw the Corporation's 80s televising of all Shakespeare's plays. Getting into the ITC series, where he was more often than not cast as foreigners of some kind, Whitsun-Jones was in the now obscure Man Of The World, \"A Family Affair\" (ATV/ITC, 1962), set in Paris, in which he was some way down the cast list as \"A Midwesterner\"; then, again with Roger Moore, he had three turns alone in the first batch of (black and white) episodes of The Saint. \"The Golden Journey\" (ATV/ITC, 1962), also with Roger Delgado (again) and Richard Montez, had Whitsun-Jones as a stereotyped lumberjack in a check shirt, who in one, deeply non-PC scene gives spoilt heroine Erica Rogers (seen in \"The Bird Who Knew Too Much\") a spanking; \"Starring the Saint\", which kept the budget down by involving Templar with the film industry, and had two Avengers spymasters-cum-villains, Whitsun-Jones and Ronald Radd, in similar roles as showbiz chancers; and \"Teresa\", which like the previous episode featured Alexander Davion, who with Whitsun-Jones, Richard Montez (again) and Coronation Street regular Alan Browning (seen in \"Intercrime\" and \"Who Was That Man I Saw You With?\"), here had to pretend to be Mexican. Paul Whitsun-Jones' film appearances were generally minor, and as easily defined types like policemen, stuffy gents, and pub customers (one suspects he probably liked a glass in real life). The Moonraker (1958) was a costume swashbuckler set in the English Civil War and decidedly on the side of the Royalists, with Peter Arne doing well as a villain, although John LeMesurier as Oliver Cromwell required some suspension of disbelief. Whitsun-Jones was in both the minor classic Room at the Top (1959), detailing the climb of Laurence Harvey and his phoney Northern accent, with Ian Hendry also among the bit-parters, and its less well remembered sequel Life at the Top (1965), which featured Honor Blackman as a journalist; intriguingly, as this was just after Goldfinger, Harvey and director Ted Kotcheff were compelled to cast Honor with the box office in mind, when they had actually wanted Vanessa Redgrave. The intense, Scottish-set military drama Tunes of Glory (1960), starring Alec Guinness and 'John Mills', had strong support from 'Dennis Price', Gordon Jackson, Duncan Macrae, Gerald Harper, and Whitsun-Jones as the Mess President. The latter also did a couple of the fondly recalled, British series of Edgar Wallace B-movies; Candidate for Murder (1962), with the splendid Michael Gough from \"The Cybernauts\" and \"The Correct Way to Kill,\" and The £20,000 Kiss (1963), plus that king of the American B-movie Roger Corman's The Masque of the Red Death (1964), with Vincent Price and Nigel Green. The Wild Affair (1965), a forgotten comedy-drama written and directed by Season Five director John Krish, with Whitsun-Jones as a party guest, is perhaps noteworthy as the only film in which the great Terry-Thomas appeared without his trademark moustache. Whitsun-Jones was also a stooge for the annoying, later bewilderingly knighted Norman Wisdom in There Was a Crooked Man (1960), having the bad luck to turn up later in What's Good for the Goose (1969), which killed off Wisdom's film career by having him leching after girls a third his age; strangely, the director was the notorious Menahem Golan, who with his lowest common denominator Cannon Group would try to take over Hollywood in the 80s (after pretty well destroying what was left of the industry in Britain). Remaining very busy on television, Whitsun-Jones guested in the highly successful Maigret, \"The Crime At Lock 14\" (BBC, 1963), with Rupert Davies as the French detective, plus Isa Miranda from \"Epic\"; and in The Odd Man, \"A Pattern Of Little Silver Devils\" (Granada, 1963), a moody, noir-ish crime series, here also guest-starring Donald Sutherland as a drummer in a jazz band, and secret drug addict. He was next one of a regular repertory company, also including former stand-up Alfred Marks and Welsh loon Kenneth Griffith, in Paris 1900 (Granada, 1964), vigorously performing six stage farces from that time by Georges Feydeau, adapted and produced by Philip Mackie, an unfairly overlooked TV hero of the 60s whose literary adaptations were always good value. The next two guest shots both saw Whitsun-Jones working with Patrick Macnee's then wife Catherine Woodville, killed off in \"Hot Snow,\" and stuntman-director Ray Austin; G.S.5, \"Scorpion Rock\" (ATV, 1964) starred Ray Barrett and Neil Hallett as agents, with Whitsun-Jones (as a Mediterranean dictator called Emilio Zafra) and Woodville guesting, Austin as stunt arranger and Brian Clemens as script editor, while yet another episode of The Saint, \"The Damsel in Distress\" (ATV/ITC, 1964), directed by Peter Yates, had Whitsun-Jones and John Bluthal as members of a slightly dodgy Italian family, with Woodville and Austin also in the cast, again. Miss Adventure, \"Journey to Copenhagen\" (ABC, 1964) was, as the title suggests, a light comedy thriller which starred, of all people, Hattie Jacques (Eric Sykes' sister on TV, and a Carry On-er in films), and the producer was Ernest Maxin, later noted for his work with Morecambe and Wise; Whitsun-Jones guested here as a Russian, along with Eric Flynn, who died recently and was in \"Murdersville.\" Whitsun-Jones occasionally turned up on the successful P.G . Wodehouse adaptation The World of Wooster (1965) (BBC), as the fearsome Sir Roderick Glossop, father of the drippy Honoria, and generally causing complications for Ian Carmichael as Bertie, to be sorted out by Dennis Price as Jeeves. Going back to children's programmes, he was in Doctor Who, \"The Smugglers\" (BBC, 1966), a Tale of Old Dartmoor with Whitsun-Jones as a local squire, later revealed to be in league with the nominal ruffians. It was the penultimate story of the visibly ailing (and frankly, having trouble with his lines) William Hartnell; later, in \"The Mutants\" (1972) with Jon Pertwee, Whitsun-Jones' character of the Marshal, treating the inhabitants of an Earth colony shabbily, was intended by writers Bob Baker and Dave Martin as a critique of British imperialism, although this rather got lost in the usual juvenile runaround. Returning to successful stage musicals, he was in the West End production of Fiddler On The Roof, in 1967, with Topol (and later, Alfie Bass) taking centre stage as Tevye; Whitsun-Jones would, again, miss out on the later film version. On TV, Mr. Rose, \"The Jolly Swagman\" (Granada, 1967), a spin-off from the aforementioned The Odd Man, starred bald-domed comedy actor William Mervyn as the retired Scotland Yard man of the title, here taking a cruise on which Whitsun-Jones, John LeMesurier, and Derek Farr (seen in \"Man-Eater of Surrey Green\" and \"The Eagle's Nest\") were also present. The first week of 1969 saw Whitsun-Jones as a regular in Wild, Wild Women (1968) (BBC), a vehicle for Barbara Windsor in between Carry Ons; it was written by Ronnie Wolfe and Ronald Chesney, who had earlier created The Rag Trade, and similarly this was set in a clothing factory with a truculent female workforce, the difference being it was set in 1902. Despite Windsor's (continuing) popularity, it only ran for one season; Whitsun-Jones played her pompous and somewhat lascivious employer, while his gormless assistant was forgotten stand-up Ken Platt, whose allegedly hilarious catchphrase was \"I won't take me coat off, I'm not stopping\". The pilot in 1968, unsurprisingly an episode of Comedy Playhouse, had Derek Francis (later in \"House of Cards\") in Whitsun-Jones' eventual role, similarly Penelope Keith (a very different type of comic actress from Windsor!) had been in this, but not the series. Then, two episodes, as different characters, of Department S; \"A Cellar Full of Silence\" (ATV/ITC, 1969), directed by former Hammer man John Gilling, with Peter Wyngarde and chums delving into the case of four corpses in fancy dress turning up in a cellar, and the later \"Death on Reflection\", involving killings somehow connected to a much sought-after mirror. The latter featured 40s leading man Guy Rolfe (who'd actually been in Dennis Spooner's mind when he created Jason King) as chief villain, and Whitsun-Jones, just as \"Fog\" did at around the same time. In a busy year, The Incredible Adventures of Professor Branestawm (1969) (Thames) was another children's series, from a series of books, published for over half a century, by one-time magician Norman Hunter. Jack Woolgar, seen in \"The Living Dead\" and a specialist in old codgers, played the other-worldly, multiple-spectacle-wearing professor, with Whitsun-Jones in what seems like a perfect bit of casting as his militaristic chum Colonel Dedshott. Next, he was in the then hugely popular, now deeply rickety Up Pompeii!, \"Exodus\" (BBC, 1970), with Frankie Howerd as slave Lurcio here put up for auction, and Whitsun-Jones and Gainsborough film star Jean Kent among the bidders; this was actually the last episode in the series, although Frankie carried on Up in three films and two belated TV specials (decades apart and for different networks, but both called Further Up Pompeii). Staying in comedy, Whitsun-Jones was in an early episode of another success of the 70s that many feel has not aged well, The Goodies, \"Give Police A Chance\" (BBC, 1970); its defenders point out it had some anti-Establishment elements, notably portraying the police as thuggish and corrupt, and certainly Whitsun-Jones, in an unrestrained performance as Commissioner Butcher, did much yelling and threatening towards the trio (especially Tim Brooke-Taylor), after being unamused by their attempts to give the force a \"nice\" image. He was then one of a team of regular performers, including the much-mourned young comedy actor Richard Beckinsale, in Elephant's Eggs In A Rhubarb Tree (Thames, 1971), yet another children's series and the kind of charmingly old-fashioned amalgam of poetry, prose and songs that sadly just isn't done any more. On the big screen, Simon Simon (1970) was a short oddity directed by character actor Graham Stark in which various names, including Michael Caine, Peter Sellers and David Hemmings, put in unbilled cameos for free, as favours to Stark (in Sellers' case, shot during his lunch break); Whitsun-Jones, along with John Junkin, was among the credited (and presumably paid) cast members. One review, in the Monthly Film Bulletin, commented that the next time Stark tried to make a film, he must realise it involves more than just sticking a load of well-known people in front of the camera; however, he clearly hadn't learned this by the time of the sketch-film The Magnificent Seven Deadly Sins (1971), with Whitsun-Jones in the segment on Avarice. He was a police sergeant in the intriguing but rather disappointing Dr Jekyll & Sister Hyde (1971), written by Brian Clemens and produced by him and Albert Fennell for Hammer. Then he had the colossal misfortune of being in the very smutty Keep It Up, Jack (1974), described by Verina Glaessner in Time Out as \"defining a whole new low in British comedy\", and with detachable naughty bits filmed for the continental version, without the knowledge of some of the cast; Whitsun-Jones and Frank Thornton (who deserved better than this, or Are You Being Served) played lawyers. His last film was Assassin (1973), a routine spy effort benefiting from Ian Hendry in the title role, plus various familiar faces including Frank Windsor; it was written by Michael Sloan, whose later revivals of old shows on American TV usually found space for Patrick Macnee, i.e. The Return Of The Man From Uncle (1983). Returning to TV episodes, Whitsun-Jones was a French police inspector in The Persuaders!, \"Powerswitch\" (ATV/ITC, 1971), yet again with Roger Moore, plus Annette Andre as a showgirl in trouble and, unbelievably, a cameo from deeply camp dancer and professional celebrity Lionel Blair; this episode was later stuck together with another, \"The Gold Napoleon\" and released in cinemas (and later on video) in some countries as Mission: Monte Carlo. And Whitsun-Jones' role was virtually identical in Jason King, \"Chapter One: The Company I Keep\" (ATV/ITC, 1972), his investigator was Italian this time but in a similar scenario, seen quizzing Ronald Radd in another teaming, with Stephanie Beacham as, yes, a showgirl in trouble. He was an innkeeper in The Adventures Of Don Quixote (BBC/Universal, 1972), filmed in Spain and shown in the prestige Play Of The Month strand, with a very rare TV role for Rex Harrison as Quixote, accompanied by Frank Finlay as Sancho Panza; Alexander Walker's biography of Harrison (Fatal Charm) claims this is one of the best things the star ever did, in which he really did act rather than just play himself (or Professor Higgins), and regrets how it remains virtually unseen since its premiere. One of the last sightings of Whitsun-Jones was in Bowler, \"Members Only\" (LWT, 1973), a forgotten sitcom about a would-be refined Cockney gangster, played by the normally serious and upright George Baker. Whitsun-Jones died, shamefully young, very early in 1974, a small obituary of him appearing in The Times on the 18th January of that year.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0926402","name":"Paul Whitsun-Jones","idIMDB":"nm0926402"},"actorId":"nm0926402","character":"Scarlatti","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Brown","urlProfile":"http://www.imdb.com/name/nm0114533","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTUxMzE0MF5BMl5BanBnXkFtZTcwOTU5OTgwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1921","placeOfBirth":" Swanage, Dorset, England, UK","birthName":"Robert James Brown","height":"5' 11\" (1.81 m)","bio":"Robert Brown was born on July 23, 1921 in Swanage, Dorset, England as Robert James Brown. He was an actor, known for The Living Daylights (1987), Octopussy (1983) and A View to a Kill (1985). He was married to Rita Becker. He died on November 11, 2003 in Swanage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTUxMzE0MF5BMl5BanBnXkFtZTcwOTU5OTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0114533","name":"Robert Brown","idIMDB":"nm0114533"},"actorId":"nm0114533","character":"Guard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julian Burton","urlProfile":"http://www.imdb.com/name/nm0123630","urlPhoto":"","biography":{"dateOfBirth":"4 June 1932","placeOfBirth":" Detroit, Michigan, USA","bio":"Julian Burton was born on June 4, 1932 in Detroit, Michigan, USA. He was an actor, known for A Bucket of Blood (1959), The Masque of the Red Death (1964) and It's Good to Be Alive (1974). He died on March 27, 2006 in Palm Springs, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0123630","name":"Julian Burton","idIMDB":"nm0123630"},"actorId":"nm0123630","character":"Señor Veronese","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Davies","urlProfile":"http://www.imdb.com/name/nm0203664","urlPhoto":"","biography":{"dateOfBirth":"3 April 1906","placeOfBirth":" Bryn Mawr, Wales, UK","height":"6' 4\" (1.93 m)","bio":"David Davies was born on April 3, 1906 in Bryn Mawr, Wales. He was an actor, known for Probation Officer (1959), The Masque of the Red Death (1964) and Treasure Island (1950). He died in June 1974 in Carmarthen, Wales.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0203664","name":"David Davies","idIMDB":"nm0203664"},"actorId":"nm0203664","character":"Lead Villager","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Skip Martin","urlProfile":"http://www.imdb.com/name/nm0553074","urlPhoto":"","biography":{"dateOfBirth":"28 March 1928","placeOfBirth":" London, England, UK","birthName":"Derek George Horowitz","bio":"Skip Martin was an excellent and underrated British actor who only acted in a handful of movies and TV shows throughout his regrettably sporadic career. He was born as Derek George Horowitz on March 28, 1928 in Sydenham, London, England. Martin made his film debut in Otto Preminger's historical drama \"Saint Joan.\" He was frequently cast in horror pictures. Skip gave an outstanding performance as the cunning Hop Toad in Roger Corman's magnificent \"The Masque of the Red Death.\" Martin was likewise fine as sneaky blackmailer Mr. Big in \"Circus of Fear,\" genuinely creepy as the sinister Michael in the wonderfully eerie and offbeat Hammer item \"Vampire Circus,\" very engaging and flat-out hilarious as the hapless Frederick in the delightfully campy \"Horror Hospital,\" and deliciously wicked as evil dwarf Igor in the failed horror comedy \"Son of Dracula.\" He worked as a tobacconist in between acting assignments. Skip Martin died at age 55 on January 4, 1984 in Hither Green, London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0553074","name":"Skip Martin","idIMDB":"nm0553074"},"actorId":"nm0553074","character":"Hop Toad","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gaye Brown","urlProfile":"http://www.imdb.com/name/nm0113605","urlPhoto":"","biography":{"dateOfBirth":"2 March 1941","placeOfBirth":" Twickenham, Middlesex, England, UK","birthName":"Gabrielle Elizabeth Brown","height":"5' 9\" (1.75 m)","bio":"Gaye Brown was born on March 2, 1941 in Twickenham, Middlesex, England as Gabrielle Elizabeth Brown. She is an actress and writer, known for A Clockwork Orange (1971), The Rocky Horror Picture Show (1975) and Sweeney Todd: The Demon Barber of Fleet Street (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0113605","name":"Gaye Brown","idIMDB":"nm0113605"},"actorId":"nm0113605","character":"Señora Escobar","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Verina Greenlaw","urlProfile":"http://www.imdb.com/name/nm0339110","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTU0ZmZkNmYtYmNkNi00NTE0LTkyN2QtNjBkYTdiNmMxZGE1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI2MDEwNA@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 June 1956","placeOfBirth":"","birthName":"Verina France Greenlaw","bio":"Verina Greenlaw was born on June 7, 1956 as Verina France Greenlaw. She is an actress, known for Father Goose (1964), The Masque of the Red Death (1964) and The Very Edge (1963).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTU0ZmZkNmYtYmNkNi00NTE0LTkyN2QtNjBkYTdiNmMxZGE1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI2MDEwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0339110","name":"Verina Greenlaw","idIMDB":"nm0339110"},"actorId":"nm0339110","character":"Esmeralda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Doreen Dawn","urlProfile":"http://www.imdb.com/name/nm0206003","urlPhoto":"","biography":{"dateOfBirth":"4 April 1923","placeOfBirth":" Sunderland, Tyne & Wear, England, UK","birthName":"Doreen Gaffney","bio":"Doreen Dawn was born on April 4, 1923 in Sunderland, Tyne & Wear, England as Doreen Gaffney. She was an actress, known for The Masque of the Red Death (1964), Son of Robin Hood (1958) and The Extra Day (1956). She died on January 2, 2005 in Wandsworth, London, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0206003","name":"Doreen Dawn","nicknames":["Doreen Dawne"],"idIMDB":"nm0206003"},"actorId":"nm0206003","character":"Anna-Marie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Hewlett","urlProfile":"http://www.imdb.com/name/nm0382107","urlPhoto":"","biography":{"dateOfBirth":"1939","placeOfBirth":" Henley-on-Thames, Oxfordshire, England, UK","bio":"Brian Hewlett was born in 1939 in Henley-on-Thames, Oxfordshire, England. He is an actor, known for The Masque of the Red Death (1964), Compact (1962) and The Younger Generation (1961).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0382107","name":"Brian Hewlett","idIMDB":"nm0382107"},"actorId":"nm0382107","character":"Senor Lampredi","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0058333","urlIMDB":"http://www.imdb.com/title/tt0058333","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"11","month":"11","year":"1963","remarks":null},null],"copyrightHolder":"Alta Vista Productions (1964)"},"technical":{"runtime":["1 hr 29 min (89 min)"],"soundMix":["Mono (RCA Sound Recording)"],"color":["Color (Pathécolor)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":["2,219 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Colorscope"],"printedFilmFormat":["35 mm","8 mm"]},"rating":"7.1","filmingLocations":[{"location":"Associated British Elstree Studios, Shenley Road, Borehamwood, Hertfordshire, England, UK"}],"rated":"UNRATED","awards":[],"votes":"9,328","type":"Movie","companyCreditsSimple":[{"idCompany":"co0108828","name":"Alta Vista Productions"}],"keywords":{"keywords":["plague","castle","death","prince","village","evil prince","refuge","costume horror","cult film","gothic horror","buxom wench","cleavage","red hot poker","massacre","baby girl","grim reaper","tarot card","red hooded man","medieval times","drugged drink","erotic dream","innocent woman","dance of the dead","masque","clawed to death","satanic ritual","devil worship","cruel joke","pestilence","dwarf","burned alive","gorilla suit","aztec indian","tragic villain","philosophical","captive","faith","hood","sacrifice","blood","mask","animal attack","revenge","crossbow","dungeon","dancer","rose","loss of father","person on fire","1100s","tarot","fog","satanism","dagger","betrayal","murder","middle ages","based on short story","sword fight","midget","face slap","jester","masquerade","branding","italy","falcon","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 00:53:10"}}