{"data":{"movies":[{"title":"Gun Crazy","originalTitle":"Deadly Is the Female","year":"1950","releaseDate":"19500120","directors":[{"name":"Joseph H. Lewis","id":"nm0507390"}],"writers":[{"name":"MacKinlay Kantor","id":"nm0437969"},{"name":"Dalton Trumbo","id":"nm0874308"}],"runtime":"86 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGRlOWYyZjItMzMwZS00ZTA5LTliYWUtZWQxZTllOTQ1Y2VlL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Film-Noir","Romance","Thriller"],"plot":"Since he was a child, Bart Tare has always loved guns. After leaving the army, his friends take him to a carnival, where he meets the perfect girl, Annie, a sharp-shooting sideshow performer who loves guns as much as he. The two run off and marry, but Annie isn't happy with their financial situation, so at her behest the couple begins a crosscountry string of daring robberies. Never one to use guns for killing, Bart is dragged down into oblivion by the greedy and violent nature of the woman he loves.","simplePlot":"A well meaning crack shot husband is pressured by his beautiful marksman wife to go on an interstate robbery spree, where he finds out just how depraved and deadly she really is.","actors":[{"actorName":"Peggy Cummins","urlProfile":"http://www.imdb.com/name/nm0192033","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAxNjcwOTg4Nl5BMl5BanBnXkFtZTcwOTQwMDg2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1925","placeOfBirth":" Prestatyn, Denbighshire, Wales, UK","birthName":"Augusta Margaret Diane Fuller","bio":"Peggy Cummins was born on December 18, 1925 in Prestatyn, Denbighshire, Wales as Augusta Margaret Diane Fuller. She is an actress, known for Gun Crazy (1950), Curse of the Demon (1957) and Green Grass of Wyoming (1948). She was previously married to Derek Dunnett.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAxNjcwOTg4Nl5BMl5BanBnXkFtZTcwOTQwMDg2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0192033","name":"Peggy Cummins","idIMDB":"nm0192033"},"actorId":"nm0192033","character":"Annie Laurie Starr","urlCharacter":"http://www.imdb.com/character/ch0068199","main":true},{"actorName":"John Dall","urlProfile":"http://www.imdb.com/name/nm0197982","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MjgzNTg2OV5BMl5BanBnXkFtZTcwMTU1NTcwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1918","placeOfBirth":" New York City, New York, USA","birthName":"John Dall Thompson","height":"6' 1\" (1.85 m)","bio":"John Dall was born John Dall Thompson (some sources state John Jenner Thompson) on May 26, 1918. He made his Broadway debut in Norman Krasna's comedy \"Dear Ruth,\" directed by Moss Hart, in 1944. The show was a hit, running for over a year and a half and 680 performances. He next appeared on Broadway in Jean-Paul Sartre's \"Red Gloves\" in 1948. The show ran for 113 performances. Dall's penultimate stint on Broadway, in the 1950 revival of \"The Heiress\", was a flop, closing after 16 performances. He had the role of the callow fortune hunter Morris Townsend, played so memorably by Montgomery Clift in William Wyler's 1949 movie version, The Heiress (1949). Dall received a Best Supporting Actor Oscar nomination for The Corn Is Green (1945), his first movie. He reached the height of his movie career in 1948, playing one of the two students modeled after the 1920s' thrill killers Leopold & Loeb in Alfred Hitchcock's Rope (1948). Unfortunately for Dall, \"Rope\" was a flop. The other role for which he is best remembered, the firearms fetishist in Deadly Is the Female (1950)_, (originally released as \"Deadly is the Female,\" the name of the short story the movie was based on), earned him a place in the film noir pantheon. It was a B-movie and, like \"Rope,\" also flopped. The only prominent film he appeared in subsequently was Stanley Kubrick-Kirk Douglas' Spartacus (1960) in 1960, which--like \"Gun Crazy\"--was scripted by Dalton Trumbo, the most famous member of the Hollywood 10. Dall, whose career started out so promisingly in the 1940s, getting an Oscar nod for his movie debut, never gained any traction. He appeared in only eight movies from 1945 to 1961, though he did many TV acting gigs. He died in 1971, reportedly of a heart attack but possibly from complications from a punctured lung.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MjgzNTg2OV5BMl5BanBnXkFtZTcwMTU1NTcwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0197982","name":"John Dall","idIMDB":"nm0197982"},"actorId":"nm0197982","character":"Barton Tare","urlCharacter":"http://www.imdb.com/character/ch0537139","main":true},{"actorName":"Berry Kroeger","urlProfile":"http://www.imdb.com/name/nm0471854","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk2MGRhZTYtMTI0My00MzdkLWIyODUtMTBiYmRkMzM2MjM4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI2MDEwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 October 1912","placeOfBirth":" San Antonio, Texas, USA","birthName":"Walker Berry Kroeger","bio":"Born and educated in the well-to-do Alamo Heights area of San Antonio, Texas, Berry Kroeger first acted in local theatrical productions at the San Pedro Playhouse. His silky voice seemed tailor-made for a lengthy career on radio. By 1931, he was active both as announcer and purveyor of dramatic exploits and crime detection on network serials. After being signed by CBS in 1936 he carved out a very lucrative career on the airwaves in anthologies like \"Inner Sanctum\" and Orson Welles's \"Mystery Theatre of the Air\", in addition to starring as suave private eye \"The Falcon\" (the role played on the screen by Tom Conway). Kroeger made his theatrical bow on Broadway in a 1943 play by Nunnally Johnson, entitled \"The World's Full of Girls\". In the course of the next decade he balanced his radio work with performing in classical plays opposite stars like Ingrid Bergman and Helen Hayes, but did not appear in the movies until 1948. When he finally did, it was -- invariably -- as venomous, sneering or smarmy villains. A burly, narrow-eyed and physically imposing character, he simply oozed menace. As his hair receded and turned white already in his twenties, he often tended to play men much older than their years. He tended to be less typecast on the small screen which permitted him to exhibit another side of his acting range. Kroeger adroitly parodied his sinister screen personae by caricaturing Sydney Greenstreet -- whom he somewhat resembled at this stage of his life -- in an episode of Get Smart (1965) ('Maxwell Smart, Private Eye'). Like many other 'professional screen villains', Kroeger was in private life rather the antithesis of the parts he essayed on screen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzk2MGRhZTYtMTI0My00MzdkLWIyODUtMTBiYmRkMzM2MjM4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI2MDEwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0471854","name":"Berry Kroeger","idIMDB":"nm0471854"},"actorId":"nm0471854","character":"Packett","urlCharacter":"http://www.imdb.com/character/ch0068202","main":true},{"actorName":"Morris Carnovsky","urlProfile":"http://www.imdb.com/name/nm0138885","urlPhoto":"","biography":{"dateOfBirth":"5 September 1897","placeOfBirth":" St. Louis, Missouri, USA","bio":"Morris Carnovsky was one of the more prominent victims of the Hollywood blacklist, being named as a Communist party member by both Elia Kazan -- the most infamous of the informers who sang before the House Un-American Activities Committee in the era blacklistee Lillian Hellman called the \"Scoundrel Time\" -- and Sterling Hayden. However, he had been effectively blacklisted -- unofficially banned from appearing in Hollywood films -- since 1950, two years before Kazan sang before HUAC, when Carnovsky himself refused to \"name names\" before the Committee. Carnovsky did not make any more movies for the better part of a decade -- in fact, his movie acting career essentially was over -- but he did have a thriving career on the Broadway stage, the venue where he established his reputation as a thespian back in the 1930s. Morris Carnovsky was born in St. Louis, Missouri on September 5, 1898, the son of a grocer. Upon graduation from high school he attended St. Louis' Washington University. Like most actors of his generation, he worked his way up the ladder by first appearing with traveling stock companies. Eventually, he landed in New York City, where he became a member of the Theatre Guild, the legendary theatrical company appearing as Kublai Khan in Nobel Prize winner 'Eugene O'Neill's play \"Marco Millions' (I)'. Subsequently, he became one of the founding members of the left-wing Group Theatre. Founded in 1931 by Lee Strasberg and Harold Clurman, and Cheryl Crawford, The Group Theatre contained Luther Adler, Stella Adler, Elia Kazan, and playwright Clifford Odets; the latter three were major forces in transforming American theater and acting, a process that began with the Provincetown Theatre. Stella Adler, Elia Kazan and Lee Strasberg, including their students/latter Group Theatre members like Bobby Lewis, were instrumental in making \"The Method\" -- a variation of Konstantin Stanislavski's acting theories, based on finding and cultivating \"motivation\" -- revolutionized American acting on stage and in the movies, most famously through Adler's student Marlon Brando. Kazan and Strasberg later founded the Actors Studio, America's premier acting school that promulgated \"The Method\" via such alumni as James Dean, Paul Newman and hundreds of others. Carnovsky was a member of the Group Theater until it broke up in 1940. He appeared prominently in Odets' plays \"Awake and Sing\" and Golden Boy (1939). Carnovsky's talents were in demand by other theatrical troupes, and he appeared on Broadway in the 1930s in multiple non-Group Theatre productions. Eventually, Hollywood beckoned and Carnovsky made his screen debut in The Life of Emile Zola (1937), playing Anatole France in support of Paul Muni. Settling in Los Angeles after the Group Theatre breakup, Carnovsky was one of the founders of the Actor's Laboratory and became involved with the the Hollywood Communist Party, whose cultural apparatchik, screenwriter John Howard Lawson, was later one of the Hollywood Ten, the first group of leftists blacklisted by the film industry. While Carnovsky was never involved in espionage or any overt acts against the interests of the United States (as were none of the Hollywood Ten or other blacklistees), he led Marxist study groups in his home, as Sterling Hayden testified to before HUAC. In his 1952 testimony before HUAC, Elia Kazan named Carnovsky as a member of the Communist Party cell he had belonged to in the Group Theatre. Other members included Lee Strasberg's wife, Paula (best known as Marilyn Monroe's acting coach). Kazan had quit the cell in the mid-1930s, he said, when it was ordered by the Party to undermine Harold Clurman and Lee Strasberg (who did not know his wife was a communist) and take over the Group Theatre. The attempted coup was never launched. In 1950, Carnovsky was hailed before HUAC, where he refused to \"name names.\" This resulted in his blacklisting, not Kazan's testimony. (Kazan said that Carnovsky, like others he named, already were known by the Committee.) The blacklist did not exist on Broadway, and producer (and future Osar-winning actor) John Houseman cast Carnovsky in the Broadway production of Henrik Ibsen's \"An Enemy of the People,\" whose script was written by future HUAC target Arthur Miller. He acted in many Broadway productions throughout the 1950s and into the '60s. A part in Sidney Lumet's film version of Arthur Miller's A View from the Bridge (1962) did not revive his movie career, and he continued to act on stage. He died on September 1, 1992, at the age of 94.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0138885","name":"Morris Carnovsky","idIMDB":"nm0138885"},"actorId":"nm0138885","character":"Judge Willoughby","urlCharacter":"http://www.imdb.com/character/ch0068205","main":true},{"actorName":"Anabel Shaw","urlProfile":"http://www.imdb.com/name/nm0378134","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjE1ZTlkOGYtMDI5My00MjQ3LWJkY2MtMDkzNWIzYmZiZGI2XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 June 1921","placeOfBirth":" Oakland, California, USA","birthName":"Marjorie Henshaw","height":"5' 5\" (1.65 m)","bio":"Anabel Shaw was born on June 24, 1921 in Oakland, California, USA as Marjorie Henshaw. She was an actress, known for Gun Crazy (1950), Shock (1946) and Secret Beyond the Door... (1947). She was married to George Scopecek and Joseph Ford. She died on April 16, 2010 in Santa Barbara, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjE1ZTlkOGYtMDI5My00MjQ3LWJkY2MtMDkzNWIzYmZiZGI2XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0378134","name":"Anabel Shaw","idIMDB":"nm0378134"},"actorId":"nm0378134","character":"Ruby Tare Flagler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harry Lewis","urlProfile":"http://www.imdb.com/name/nm0507252","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MjAxOTIxN15BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 April 1920","placeOfBirth":" Hollywood, California, USA","bio":"Harry Lewis was born on April 1, 1920 in Hollywood, California, USA. He was an actor, known for Key Largo (1948), Gun Crazy (1950) and The Unsuspected (1947). He was married to Marilyn Lewis. He died on June 9, 2013 in Beverly Hills, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0MjAxOTIxN15BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0507252","name":"Harry Lewis","idIMDB":"nm0507252"},"actorId":"nm0507252","character":"Deputy Clyde Boston","urlCharacter":"http://www.imdb.com/character/ch0133214","main":true},{"actorName":"Nedrick Young","urlProfile":"http://www.imdb.com/name/nm0949917","urlPhoto":"","biography":{"dateOfBirth":"23 March 1914","placeOfBirth":" Philadelphia, Pennsylvania, USA","bio":"Nedrick Young was born on March 23, 1914 in Philadelphia, Pennsylvania, USA. He was an actor and writer, known for Inherit the Wind (1960), The Defiant Ones (1958) and Jailhouse Rock (1957). He was married to Elizabeth MacRae and Frances Sage. He died on September 16, 1968 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0949917","name":"Nedrick Young","idIMDB":"nm0949917"},"actorId":"nm0949917","character":"Dave Allister","urlCharacter":"http://www.imdb.com/character/ch0133215","main":true},{"actorName":"Trevor Bardette","urlProfile":"http://www.imdb.com/name/nm0054253","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNTg3NDA5M15BMl5BanBnXkFtZTgwMTU0Nzk1MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1902","placeOfBirth":" Nashville, Arkansas, USA","birthName":"Terva Gaston Hubbard","bio":"Wavy-haired, articulate, quietly-spoken Bardette was one of Hollywood's archetypal villains of westerns and cliffhanger serials. He initially aspired to become a mechanical engineer after graduating from Oregon State University in June 1925. However, by the late 1920's, he had changed his name from Terva Gaston Hubbard to Trevor Bardette and embarked on a brief, unremarkable acting career on the East Coast stage, before moving to Hollywood in 1937. Though he went on to essay the occasional sheriff, rustic, frontiersman or hero's sidekick, his stoney features and deep-set, cold eyes ensured that he would invariably be cast as a ruthless heavy, sneaky spy, swindler, gangster or double-crosser. In the course of a thirty year career, the majority of his characters rarely survived until the final scene. A hard-working character player, Bardette took on just about any role offered him. Between 1938 and 1940 alone, he appeared in some 33 films, including bits in prestige pictures like Jezebel (1938), Marie Antoinette (1938), Gone with the Wind (1939), Abe Lincoln in Illinois (1940) and The Grapes of Wrath (1940). At the smaller studios and later for television, he fared rather better in terms of screen time. Serials, especially, gave him the opportunity to chew the scenery at his most menacing: as the scar-faced Pegleg (aka Mitchell) of Overland with Kit Carson (1939), the icily controlled, preening killer Raven of Winners of the West (1940); and the deceptively meek Jensen, head of a Nazi spy ring, in The Secret Code (1942). On TV, he was Old Man Clanton, cattle rustler and perpetual nemesis of law and order in The Life and Legend of Wyatt Earp (1955) (though, in actual fact, N.H. Clanton never faced the Earps, having met his fate earlier at the hands of Mexican cowboys in Guadalupe Canyon). Then there were recurring roles in series like Lassie (1954), Cheyenne (1955) and Gunsmoke (1955), to name but a few. Perhaps not surprisingly, Bardette bought his own ranch in Green Valley, Arizona, where he spent his remaining years after retiring from acting in 1970. In interesting footnote is his authorship (under his original name) of a short story entitled \"The Phantom Photoplay\", published in the August 1927 issue of Weird Tales magazine. His first name Terva, evidently sounded sufficiently feminine to be included among the publication's list of lady writers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNTg3NDA5M15BMl5BanBnXkFtZTgwMTU0Nzk1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0054253","name":"Trevor Bardette","idIMDB":"nm0054253"},"actorId":"nm0054253","character":"Sheriff Boston","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mickey Little","urlProfile":"http://www.imdb.com/name/nm0514635","urlPhoto":"","biography":{"dateOfBirth":"8 November 1941","placeOfBirth":" Toledo, Ohio, USA","birthName":"Michael Dennis Little","bio":"Mickey Little was born on November 8, 1941 in Toledo, Ohio, USA as Michael Dennis Little. He is an actor, known for Gun Crazy (1950), Bad Day at Black Rock (1955) and The Private War of Major Benson (1955). He has been married to Amanda (Nikki) Lombard since June 22, 1968. They have two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0514635","name":"Mickey Little","nicknames":["Mike"],"idIMDB":"nm0514635"},"actorId":"nm0514635","character":"Bart Tare","urlCharacter":"http://www.imdb.com/character/ch0537139","main":true},{"actorName":"Russ Tamblyn","urlProfile":"http://www.imdb.com/name/nm0848560","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNjM2NDMwMl5BMl5BanBnXkFtZTYwNjA3NTY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 December 1934","placeOfBirth":" Los Angeles, California, USA","birthName":"Russell Irving Tamblyn","height":"5' 9\" (1.75 m)","bio":"Russ Tamblyn might as well face it...he will be a Jet \"till his last dying day.\" Indelibly linked to the \"womb to tomb\" role of Riff, the knife-wielding, rocket-tempered, Edward Villella-styled gang leader of the streetwise Jets in the musical film masterpiece West Side Story (1961), it's not a bad way to be remembered! Russ was actually 27 when he portrayed the teenage troublemaker who became the '50s equivalent of the Mercutio character in the Romeo and Juliet-inspired adaptation. To describe Tamblyn as talented and extremely agile is a huge understatement. This awesome musical performer was born in Los Angeles, California on December 30, 1934, and groomed early for stardom. He is the son of Sally Aileen (Triplett) and Eddie Tamblyn (Edward Francis Tamblyn), both actors and entertainers. Discovered at age ten by actor Lloyd Bridges for the play \"Stone Jungle\", Russ was soon performing on radio and in L.A.-based musical revues. Billed as \"Rusty Tamblyn\" then, the tousle-haired scrapper played a student extra in his first film The Boy with Green Hair (1948) starring another child actor, Dean Stockwell. Having taken up dancing and acrobatics from the age of 6, Tamblyn marked his abilities with his very first TV appearance on the \"The Ed Sullivan Show.\" Eventually handed a starring role in the \"B\" film The Kid from Cleveland (1949), he was signed by an eager MGM who saw his potential as a juvenile actor. Featured in the popular family-oriented comedy Father of the Bride (1950), and its sequel Father's Little Dividend (1951), Tamblyn also had a prime role in the war drama Take the High Ground! (1953) before taking off in musical films. Demonstrating exceptional athleticism in one of MGM's best, Seven Brides for Seven Brothers (1954), Tamblyn's timing was regrettably off as musicals were quickly on the wane. He adjusted, however. A starring role in the low-budget The Young Guns (1956) led to excellent reviews in the ensemble box-office soaper Peyton Place (1957). Tamblyn, along with Lana Turner, Arthur Kennedy, Hope Lange and Diane Varsi, all received Oscar nominations for their participation. Russ scored quite well in the title role of Tom Thumb (1958), which became a large stepping stone in his being cast as Riff in 1961. Following this achievement, however, the offers started dwindling. Tamblyn's last co-starring roles in quality films were shot overseas with the British-produced chiller The Haunting (1963) with Julie Harris and Claire Bloom, and the British-Yugoslavian Viking costumer The Long Ships (1964) starring Richard Widmark and Sidney Poitier. After that, his career grew quite dismal. Titles such as The Female Bunch (1971), Satan's Sadists (1969), Scream Free! (1969), Dracula vs. Frankenstein (1971) and The Bloody Monks (1990) pretty much tells the story. On the road in the lean years with minor stage productions here and there, including the musical \"Cabaret,\" Russ all but disappeared from the viewing audience. When he finally nabbed the role of the overtly weird (and who wasn't on that show?) psychiatrist Dr. Lawrence Jacoby in the popular TV cult series Twin Peaks (1990), it was the first time Tamblyn had generated interest in over two decades. Barely recognizable with his wild-eyed look, mangy hair and frizzy beard, he has since gained employment off this eccentric image. Married three times, Tamblyn has lately taken on choreographic duties and the managing of actress/daughter Amber Tamblyn's career, she of Joan of Arcadia (2003) fame.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNjM2NDMwMl5BMl5BanBnXkFtZTYwNjA3NTY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0848560","name":"Russ Tamblyn","idIMDB":"nm0848560"},"actorId":"nm0848560","character":"Bart Tare","urlCharacter":"http://www.imdb.com/character/ch0537139","main":true},{"actorName":"Paul Frison","urlProfile":"http://www.imdb.com/name/nm0295910","urlPhoto":"","biography":{"bio":"Paul Frison is an actor, known for Gun Crazy (1950), Forgotten Women (1949) and Apartment for Peggy (1948).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0295910","name":"Paul Frison","idIMDB":"nm0295910"},"actorId":"nm0295910","character":"Clyde Boston","urlCharacter":"http://www.imdb.com/character/ch0133214","main":true},{"actorName":"David Bair","urlProfile":"http://www.imdb.com/name/nm0047835","urlPhoto":"","biography":{"dateOfBirth":"5 December 1940","placeOfBirth":" Los Angeles, California, USA","birthName":"David Lynn Bair","bio":"David Bair was born on December 5, 1940 in Los Angeles, California, USA as David Lynn Bair. He is an actor, known for Gun Crazy (1950), The Reckless Moment (1949) and The Space Children (1958).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0047835","name":"David Bair","idIMDB":"nm0047835"},"actorId":"nm0047835","character":"Dave Allister","urlCharacter":"http://www.imdb.com/character/ch0133215","main":true},{"actorName":"Stanley Prager","urlProfile":"http://www.imdb.com/name/nm0695111","urlPhoto":"","biography":{"dateOfBirth":"8 January 1917","placeOfBirth":" New York City, New York, USA","bio":"Stanley Prager was born on January 8, 1917 in New York City, New York, USA. He was a director and producer, known for The Patty Duke Show (1963), Car 54, Where Are You? (1961) and Kibbee Hates Fitch (1965). He was married to Georgann Johnson. He died on January 18, 1972 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0695111","name":"Stanley Prager","idIMDB":"nm0695111"},"actorId":"nm0695111","character":"Bluey-Bluey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Virginia Farmer","urlProfile":"http://www.imdb.com/name/nm0267808","urlPhoto":"","biography":{"dateOfBirth":"18 April 1898","placeOfBirth":" Marion, Indiana, USA","birthName":"Mary Virginia Farmer","bio":"Virginia Farmer was born on April 18, 1898 in Marion, Indiana, USA as Mary Virginia Farmer. She was an actress, known for Cyrano de Bergerac (1950), The Men (1950) and Gun Crazy (1950). She died on May 19, 1988 in Long Beach, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0267808","name":"Virginia Farmer","idIMDB":"nm0267808"},"actorId":"nm0267808","character":"Miss Wynn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anne O'Neal","urlProfile":"http://www.imdb.com/name/nm0641876","urlPhoto":"","biography":{"dateOfBirth":"23 December 1893","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Patsy Ann Epperson","bio":"Anne O'Neal was born on December 23, 1893 in St. Louis, Missouri, USA as Patsy Ann Epperson. She was an actress, known for The Bishop's Wife (1947), Gun Crazy (1950) and In Old Oklahoma (1943). She died on November 24, 1971 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0641876","name":"Anne O'Neal","idIMDB":"nm0641876"},"actorId":"nm0641876","character":"Miss Augustine Sifert","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0042530","urlIMDB":"http://www.imdb.com/title/tt0042530","business":{"budget":{"money":"$400,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"©1949 Pioneer Pictures, Corp."},"technical":{"runtime":["1 hr 26 min (86 min)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["2,386 m (9 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.7","filmingLocations":[{"location":"Reseda State Bank Building, Sherman Way and Reseda Blvd., Reseda, Los Angeles, California, USA"}],"rated":"PASSED","awards":[{"award":"National Film Preservation Board, USA 1998","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"","names":[]}]}]}],"votes":"8,474","type":"Movie","companyCreditsSimple":[{"idCompany":"co0004893","name":"King Brothers Productions"}],"keywords":{"keywords":["gun","carnival","robbery","shooting","reform school","sideshow","childhood friend","mountain","breaking a shop window","manhunt","gambling","trial","testimony","attraction","chicken","heist","firearm","stealing","payroll","judge","gas station","posse","crime spree","psychotronic film","psychotronic","noir","femme fatale","candle","dilemma","reed","trauma","marsh","hysteria","pursuit","ranger","desperation","national park","road construction","vocalist","highway","merry go round","consciousness","remorse","shoreline","suspicion","state line","caper","mania","plan","diagram","loot","snow","train","uniform","pet dog","flat tire","car chase","foot chase","siren","disguise","stick up","bound and gagged","illinois","getaway","carjacking","alarm","typewriter","escape","dragnet","held at gunpoint","motorcycle cop","passion","factory","grand larceny","breaking and entering","carcass","warehouse","classroom","student","woods","cafe","witness","diner","honeymoon","ring","waterfall","sentence","jealousy","trailer","costume","show people","stage","competition","cowgirl","barker","rifle","midway","audience","tent","yellowstone national park","rain","fog","fox fur stole","world war two veteran","writer","violinist","violence","vagrant","uncle niece relationship","uncle nephew relationship","u.s. army","truck","travelers aid society","teletype","telephone call","telegraph","teacher","teacher student relationship","taxi driver","target practice","stairway","st. louis missouri","song","slingshot","slacks","shore patrol","sheriff","secretary","santa cruz mountains california","san lorenzo river california","roller coaster","rodeo","revolver","restlessness","restaurant","reporter","pot belly stove","police","pawnshop","pasadena california","party","parking lot","nightclub","newspaper","mountain lion","mother son relationship","mother daughter relationship","montana","mirror","military uniform","mexico","mexican american border","marriage","marriage proposal","marksmanship","madera national park","kidnapping","justice of the peace","jewelry store","jail","jack knife","hound dog","hold up","hitchhiking","high altitude","hideout","guilt","grocery store","friendship","forest ranger","flashback","fire eater","filling station","father son relationship","father daughter relationship","family relationships","dueling pistol","dog","diamond ring","dancer","crown","courthouse","convertible","contest","collie dog","clown","chase","casino","cash register","carousel","car accident","camping trip","burglar alarm","broken mirror","breaking shop window","boxcar","border patrol","belly dancer","beach","bb gun","bank robbery","band","arnour meat","armour meat plant","armed robbery","amusement park","ammunition","acrobat","swamp","nevada","island","death of wife","self destructiveness","las vegas nevada","husband wife relationship","stolen money","marked bills","california","brother sister relationship","roadblock","juvenile delinquent","cross country","sociopath","sharpshooter","newlywed","murder","greed","fugitive","lovers on the lam"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:24:38"}}