{"data":{"movies":[{"title":"Something Wild","originalTitle":"","year":"1986","releaseDate":"19861107","directors":[{"name":"Jonathan Demme","id":"nm0001129"}],"writers":[{"name":"E. Max Frye","id":"nm0296861"}],"runtime":"114 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MjI2MDc0NV5BMl5BanBnXkFtZTgwNjgzNDIxMDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Crime","Romance","Thriller"],"plot":"The uneventful life of the businessman Charles Driggs suddenly changes when he meets the wild and sexy Lulu. When he accepts her offer to drive him back to his office, she instead takes him out of town and on a trip, leaving behind his old life. Posing as a married couple, Charles and \"Audrey\" (which turns out to be Lulu's real name) visit her mother and her high school reunion. At this reunion they meet Audrey's violent ex-husband Ray, who has just released from prison. When Ray makes it clear that he wants Audrey back, that is when the real trouble begins.","simplePlot":"A free-spirited woman \"kidnaps\" a yuppie for a weekend of adventure. But the fun quickly takes a dangerous turn when her ex-convict husband shows up.","actors":[{"actorName":"Jeff Daniels","urlProfile":"http://www.imdb.com/name/nm0001099","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA3MDI4NDcxNV5BMl5BanBnXkFtZTYwOTgyMzY1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 February 1955","placeOfBirth":" Athens, Georgia, USA","birthName":"Jeffrey Warren Daniels","height":"6' 2½\" (1.89 m)","bio":"Actor Jeff Daniels was born in Athens, Georgia, but was raised in Chelsea, Michigan. He is the son of Marjorie J. (Ferguson) and Robert Lee Daniels, who owned The Chelsea Lumber Company and was also mayor of Chelsea. Jeff attended Central Michigan University, but became involved in acting and dropped out to pursue a career as an actor. Daniels made his feature film debut in Milos Forman's Ragtime (1981). Daniels went on to prove himself to be one of Hollywood's most reliable and versatile actors with roles in successes such as Terms of Endearment (1983), The Purple Rose of Cairo (1985), Something Wild (1986), Arachnophobia (1990), Dumb & Dumber (1994), Pleasantville (1998), The Hours (2002) and Good Night, and Good Luck. (2005), to name a few. Alongside screen work, Daniels has many stage credits to his name and is the founder of The Purple Rose Theater Company in Chelsea, Michigan. He is also a musician and songwriter and has recorded two albums. Daniels is married to his childhood sweetheart, Kathleen Treado and they have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA3MDI4NDcxNV5BMl5BanBnXkFtZTYwOTgyMzY1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001099","name":"Jeff Daniels","idIMDB":"nm0001099"},"actorId":"nm0001099","character":"Charles Driggs","urlCharacter":"http://www.imdb.com/character/ch0524124","main":true},{"actorName":"Melanie Griffith","urlProfile":"http://www.imdb.com/name/nm0000429","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwODc4NTgxOV5BMl5BanBnXkFtZTcwNzgyNjY0MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1957","placeOfBirth":" New York City, New York, USA","birthName":"Melanie Richards Griffith","height":"5' 9¼\" (1.76 m)","bio":"Melanie Griffith was born on August 9, 1957 in New York City, to then model/future actress Tippi Hedren and former child actor turned advertising executive Peter Griffith. Her parents' marriage ended in 1961 and Tippi brought Melanie to Los Angeles to get a new start. Tippi caught the eye of the great director Alfred Hitchcock, who gave her starring roles in The Birds (1963) and Marnie (1964). She married her then-agent, Noel Marshall, in 1964 (they divorced in 1982), and Melanie grew up with three stepbrothers. Meanwhile, her father married Nanita Greene Samuels and had two more children: Tracy Griffith and Clay A. Griffith. Melanie also grew up with tigers and lions, as Tippi and Noel were raising them for the movie Roar (1981), in which the family later starred. Melanie's acting career, however, began as a model at just nine months old in a commercial and she later appeared as an extra in Smith! (1969) and The Harrad Experiment (1973), where she fell in love with her mother's co-star, Don Johnson. She was only 14 years old, while he was a twice-divorced 22-year-old. Tippi took a very liberal approach and allowed Melanie to move in with Don at a tender age. Even though Melanie didn't like modeling, she continued to do it to pay the bills. One day she went to meet with director Arthur Penn for what she thought was a modeling assignment. It was actually an audition for his film Night Moves (1975), and Penn gave her the role of a runaway nymphet. She was hesitant, but Johnson encouraged her to take the role. She agreed but was terrified of performing in front of the camera. Penn took a paternal interest in her, and she felt confident and gave a riveting performance, doing racy nude scenes. It immediately typecast her and led to more nymphet roles, with her beautiful nude body a permanent fixture in movies like Ha-Gan (1977) and Joyride (1977). She also married Johnson, in Las Vegas in 1976, but the union ended within six months, possibly because her early movie success outshone his. Unfortunately, as her career progressed, she became increasingly dependent on drugs and alcohol, a fact well-known to studio executives, who stopped considering her for feature film roles. She started doing television work, where she met her second husband, Steven Bauer, on the set of the TV movie She's in the Army Now (1981). He helped her to overcome her drug and alcohol problems and got her to take acting classes with Stella Adler in New York. The classes paid off, as director Brian De Palma cast her as a porno actress in his murder mystery Body Double (1984) and her sexy, funny performance won her rave reviews and the Best Supporting Actress Award by the National Society of Film Critics and a Golden Globe nomination. Jonathan Demme was so impressed with her performance that he gave her the female lead in Something Wild (1986) without even auditioning her. The film became a cult favorite, with Melanie again getting critical plaudits and a Golden Globe nomination. The birth of her first child, Alexander, in 1985, didn't help to save her struggling marriage, and she and Bauer divorced shortly thereafter. She was given starring roles in Cherry 2000 (1987) and Stormy Monday (1988), but the films were barely released. Soon writers were asking when the public at large was going to take notice of this talented and unique actress. Melanie's career skyrocketed when Mike Nichols cast her as a spunky secretary named Tess McGill in Working Girl (1988), a box-office hit for which she received an Oscar nomination as Best Actress and won the Golden Globe Award as Best Actress in a Comedy. Behind the scenes, however, her ongoing substance abuse had become problematic, and Nichols pushed her into a rehabilitation clinic after production wrapped. En route to the clinic she called ex-husband Johnson for support, and they reconciled after her release from the clinic. She got pregnant and remarried Johnson in 1989, and later that year their daughter Dakota Johnson was born. A sober Melanie now concentrated on her film career, but the two-year absence after Working Girl (1988) took a toll, since younger actresses (Julia Roberts, Michelle Pfeiffer, Demi Moore, Meg Ryan, Jodie Foster(to whom Melanie lost the Oscar to)) became bankable stars, and there was stiff competition for the good roles. The films Melanie chose usually flopped badly, such as The Bonfire of the Vanities (1990), which reunited her with director Brian De Palma. Even though she gave heartfelt performances in all her films, she was often miscast, with her breathy little-girl voice not helping matters in her role as a spy in Shining Through (1992) and as a homicide detective going undercover in the Hassidic Jewish community in New York City in A Stranger Among Us (1992). Melanie made a minor comeback with her supporting role as a desperate housewife in Nobody's Fool (1994), which reunited her with Bruce Willis, her co-star in The Bonfire of the Vanities (1990), and Paul Newman, her co-star from The Drowning Pool (1975). She also earned a Golden Globe nomination for her work in the well-received TV miniseries Buffalo Girls (1995), followed by another hit film, the ensemble Now and Then (1995). Her personal life was making headlines again, though, as she left Johnson because of his own substance-abuse problems, reconciled with him briefly when he became sober, only to leave him again, this time for Antonio Banderas, her married co-star from Two Much (1996). Both she and Banderas created a scandal in 1995 with their torrid romance, and the tabloids followed their every move, including her divorce from Johnson and his divorce from wife Ana Leza. Melanie became pregnant with her third child, and she and Banderas married in 1996. Their daughter Stella Banderas was born the same year, and the notorious couple were forgiven by the public and the media. Melanie won strong reviews in independent films like Another Day in Paradise (1998), where she played a heroin-using criminal accomplice on the run, and the made-for-cable movie RKO 281 (1999), in which she portrayed actress Marion Davies, a part that garnered her Golden Globe and Emmy nominations as Best Supporting Actress. Melanie became dependent to pain killers, however, returning to rehab in 2000. She wrote about her struggle and recovery in her journal on her official website. Greenmoon Productions, the production company that she formed with Banderas, produced several flops, such as her starring vehicle La tête dans le carton à chapeaux (1999), directed by Banderas. Her career took another blow when her TV series, Me & George (1998), never even aired. After making Cecil B. Demented (2000) and Coup de foudre pour toujours (2000), Melanie did a voice-over role in Stuart Little 2 (2002) and played supporting roles in minor films Tempo (2003), as Sylvester Stallone's girlfriend in Shade (2003), and as Barbara Marx in The Night We Called It a Day (2003) with Dennis Hopper playing Frank Sinatra, but none of these films made a ripple at the box office. As a result, film and television offers started to dry up. In 2003, a resourceful Melanie turned to the Broadway stage, and packed houses with her turn as the murderess \"Roxie Hart\" in the musical \"Chicago,\" for which she received a rave review from the New York Times theater critic. It renewed her confidence, as she had never sang, danced or been on the Broadway stage before. In 2005 she surprised viewers by playing a mom to two grown women in the TV series Twins (2005), which was canceled after one season. She tried to resurrect her career with another attempt at a TV series, Viva Laughlin (2007), but it was canceled after just two episodes. Melanie didn't act again for the remainder of the decade, because, by self-admission, she couldn't obtain any worthwhile roles. In 2009, she was back in rehab after yet another relapse, emerging after a three-month stay. Professionally, she was faced with more disappointment in 2012 when This American Housewife (2012), a Lifetime series that Banderas produced for her to star in, never aired. She went back to the stage in 2012 and played Scott Caan's mother in a play that he wrote titled \"No Way Around but Through.\" She impressed Caan enough to recommend her to producers of his television show Hawaii Five-0 (2010). Since 2014, she started playing a recurring role as his mother on the show. Also in 2014, Melanie filed for divorce from Banderas citing \"irreconcilable differences\" after nearly twenty years together. She never publicly discussed her reasons for the divorce, and she didn't promote her feature film Automata (2014), the final time that she acted with Banderas. It took a year for the divorce to be finalized, during which time, she and Banderas made one important appearance together at their daughter Stella's high school graduation. She also made another public appearance with another ex-husband, Don Johnson, on Saturday Night Live (1975) to support their daughter Dakota, who was the host for that week. Dakota was promoting her star-making turn in Fifty Shades of Grey (2015), thus carrying on the family tradition of being a film actress. Melanie maintains close ties with her three children and her mother Tippi Hedren. She is involved in various charities, including raising funds for Tippi's Shambala preserve, a refuge for wild animals. Melanie also runs a non-profit organization for benefiting burned children. Melanie is single and her children are living on their own. So she has devoted most of her time seeking out acting roles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwODc4NTgxOV5BMl5BanBnXkFtZTcwNzgyNjY0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000429","name":"Melanie Griffith","idIMDB":"nm0000429"},"actorId":"nm0000429","character":"Audrey Hankel","urlCharacter":"http://www.imdb.com/character/ch0406901","main":true},{"actorName":"George 'Red' Schwartz","urlProfile":"http://www.imdb.com/name/nm0777230","urlPhoto":"","biography":{"bio":"George 'Red' Schwartz is an actor, known for The Silence of the Lambs (1991), Something Wild (1986) and Married to the Mob (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0777230","name":"George 'Red' Schwartz","idIMDB":"nm0777230"},"actorId":"nm0777230","character":"Counter Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leib Lensky","urlProfile":"http://www.imdb.com/name/nm0502229","urlPhoto":"","biography":{"dateOfBirth":"15 December 1903","placeOfBirth":" Poland","birthName":"Leon K. Lensky","bio":"Leib Lensky was born on December 15, 1903 in Poland as Leon K. Lensky. He was an actor, known for The Silence of the Lambs (1991), Something Wild (1986) and The Verdict (1982). He died on May 2, 1991 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0502229","name":"Leib Lensky","idIMDB":"nm0502229"},"actorId":"nm0502229","character":"Frenchy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tracey Walter","urlProfile":"http://www.imdb.com/name/nm0910145","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NzkxOTgxMV5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 November 1947","placeOfBirth":" Jersey City, New Jersey, USA","height":"5' 6\" (1.68 m)","bio":"Tracey Walter was born on November 25, 1947 in Jersey City, New Jersey, USA. He is an actor, known for The Silence of the Lambs (1991), Batman (1989) and Matilda (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NzkxOTgxMV5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0910145","name":"Tracey Walter","idIMDB":"nm0910145"},"actorId":"nm0910145","character":"The Country Squire","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maggie T.","urlProfile":"http://www.imdb.com/name/nm2988025","urlPhoto":"","biography":{"bio":"Maggie was a descendent of Ugga from the university of Georgia. She was born in Tallahassee Florida. Her owners were Jim and Carole Smith. Jim Smith was Attorney General of the State of Florida. She died a few years after filming of a heat stroke. She was a wonderful loving pet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm2988025","name":"Maggie T.","nicknames":["Maggie"],"idIMDB":"nm2988025"},"actorId":"nm2988025","character":"Country Squire Bulldog","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patricia Falkenhain","urlProfile":"http://www.imdb.com/name/nm0266247","urlPhoto":"","biography":{"dateOfBirth":"3 December 1926","placeOfBirth":" Atlanta, Georgia, USA","bio":"Patricia Falkenhain was born on December 3, 1926 in Atlanta, Georgia, USA. She was an actress, known for Something Wild (1986), The House on Carroll Street (1988) and Heartburn (1986). She was married to Robert Gerringer. She died on January 5, 2004 in Newcastle, Maine, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0266247","name":"Patricia Falkenhain","idIMDB":"nm0266247"},"actorId":"nm0266247","character":"Charlie's Secretary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sandy McLeod","urlProfile":"http://www.imdb.com/name/nm0572865","urlPhoto":"","biography":{"bio":"Sandy McLeod is known for her work on Something Wild (1986), Romancing the Stone (1984) and Red Hot and Blue (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0572865","name":"Sandy McLeod","idIMDB":"nm0572865"},"actorId":"nm0572865","character":"Graves' Secretary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Ridgely","urlProfile":"http://www.imdb.com/name/nm0725894","urlPhoto":"","biography":{"dateOfBirth":"24 December 1931","placeOfBirth":" Teaneck, New Jersey, USA","bio":"Superbly talented vocal artist and character actor supreme Robert Ridgely was born on December 24, 1931 in New Jersey. Ridgely started out as a cabaret entertainer. He began his television acting career in the early 60s with guest appearances on such TV shows as Surfside 6 (1960), Sea Hunt (1958), and Maverick (1957). Ridgely had a recurring role as Lt. Frank Kimbro on the short-lived World War II TV series The Gallant Men (1962). Robert made his film debut in the 1963 feature FBI Code 98 (1963). Ridgely was occasionally cast as sleazy charmers such as unctuous emcees and announcers. Robert popped up in four comedies for Mel Brooks: Blazing Saddles (1974), High Anxiety (1977), Life Stinks (1991), and Sacré Robin des Bois (1993). Moreover, Ridgely was in several pictures for director Jonathan Demme; he's especially memorable (and delightful) as smarmy game show host Wally \"Mr. Love\" Williams in the wonderful Melvin and Howard (1980). Other noteworthy movie roles are boozy, moonshine-running airplane pilot Lester Boggs in the rowdy redneck romp The Great Lester Boggs (1974), radio talk show host Bob Morton in Heart Like a Wheel (1983), and Los Angeles Mayor Ted Egan in Beverly Hills Cop II (1987). Robert lent his strong, smooth, booming voice to countless animated TV programs and cartoon features; the characters he voiced include Tarzan in Tarzan, Lord of the Jungle (1976), Flash Gordon in Flash Gordon (1979), the Peculiar Purple Pieman of Porcupine Peak in the The World of Strawberry Shortcake (1980) and TV specials, and Thundarr in Thundarr the Barbarian (1980). Among the TV shows Ridgely had guest spots on are Designing Women (1986), Newhart (1982), Night Court (1984), Hunter (1984), The Incredible Hulk (1978), WKRP in Cincinnati (1978), Kung Fu (1972), _Bonanza_, and Get Smart (1965). In addition, he did voice-over work for numerous TV commercials. Robert gave a terrifically robust and engaging performance as jolly porno producer the Colonel James in the fantastic Boogie Nights (1997), which alas turned out to be his last movie and a worthy closer to his long and distinguished career. Robert Ridgely died at age 65 from cancer on February 8, 1997 in Toluca Lake, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0725894","name":"Robert Ridgely","idIMDB":"nm0725894"},"actorId":"nm0725894","character":"Richard Graves","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Buzz Kilman","urlProfile":"http://www.imdb.com/name/nm0453248","urlPhoto":"","biography":{"dateOfBirth":"19 August 1944","placeOfBirth":" Detroit, Michigan, USA","bio":"Buzz Kilman was born in Detroit, Michigan, but left almost immediately thanks to the quick thinking of his mother Bette. His father, Julian, was in public relations, and Buzz spent his formative years moving from city to city as his Dad partied his way to the top of his field, ultimately winding up in Miami. Buzz remained in Miami where he attended Coral Gables High School and went on to the University of Miami. While attending the University of Miami, Buzz became the Editor of the conservative newspaper at \"The U\" and worked as a copy boy at The Miami News. Soon after, Buzz became Entertainment Editor at the Coral Gables Times and, later, Editor of the Daily Planet, an alternative paper devoted to harassing the establishment. In 1972, Buzz got his first radio job as public service director for one of the first FM rock stations in the country, WBUS-FM \"The Magic Bus\" in Miami Beach. He remained there for almost two years before management discovered most of his late-night interviews were comic spoofs. In 1974, he took his first full-time radio job with WSHE-FM in Ft. Lauderdale. In addition to doing morning news, he also did a weekend public service talk show, which, once again, revolved around comedic spoofs. This time, however, station management valued his comedic approach. In 1980, Buzz came to Chicago and went to work for WLUP-FM, \"The Loop,\" doing news for the Steve Dahl Show. Buzz spent the next several years doing news for a series of morning personalities including Mark McEwen, who left to do the weather for CBS, and was replaced by Jonathon Brandmeier in 1983. Mr. Kilman is the yin to Steve Dahl's yang on WCKG's \"Steve Dahl Show,\" based in Chicago, IL. Buzz also appears in movies made by his high school buddy Jonathan Demme having played a devoured paramedic in The Silence of the Lambs (1991). Therefore, Buzz unfortunately did not appear in the sequel Hannibal (2001). Buzz Kilman has never won a major award and he does not dance. In September 2012, Buzz returned to the air as a sidekick and newsman, alongside Jonathon Brandmeier on WGN AM. As of September 2013 Buzz and Jonathon Brandmeier are now heard on 87.7 FM, \"The Game\", a Tribune Company radio station. The show is also simulcast on Comcast TV channel 877 in the Chicago area.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0453248","name":"Buzz Kilman","idIMDB":"nm0453248"},"actorId":"nm0453248","character":"TV Newscaster","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kenneth Utt","urlProfile":"http://www.imdb.com/name/nm0882588","urlPhoto":"","biography":{"dateOfBirth":"13 July 1921","placeOfBirth":" Winston-Salem, North Carolina, USA","bio":"Kenneth Utt was born on July 13, 1921 in Winston-Salem, North Carolina, USA. He was a producer and production manager, known for The Silence of the Lambs (1991), Philadelphia (1993) and All That Jazz (1979). He died on January 19, 1994 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0882588","name":"Kenneth Utt","idIMDB":"nm0882588"},"actorId":"nm0882588","character":"Dad","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adelle Lutz","urlProfile":"http://www.imdb.com/name/nm0527542","urlPhoto":"","biography":{"dateOfBirth":"13 November 1948","placeOfBirth":" New York City, New York, USA","bio":"Adelle Lutz was born on November 13, 1948 in New York City, New York, USA. She is an actress and costume designer, known for The Silence of the Lambs (1991), Beetlejuice (1988) and Wall Street (1987). She was previously married to David Byrne.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0527542","name":"Adelle Lutz","nicknames":["Bonnie"],"idIMDB":"nm0527542"},"actorId":"nm0527542","character":"Rose","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Napier","urlProfile":"http://www.imdb.com/name/nm0621008","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyODc4NjY0OF5BMl5BanBnXkFtZTcwNzk1NTg4Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1936","placeOfBirth":" Mt. Union, Kentucky, USA","birthName":"Sr. Charles Whitnel Napier","height":"5' 11\" (1.8 m)","bio":"Lively character actor who usually plays bodybuilding military types and menacing bad guys. Charles Napier's roles have changed little since his debut in Russ Meyer's Cherry, Harry & Raquel! (1970). Napier went on appearing in other Meyer movies, including the homicidal Harry Sledge in Supervixens (1975) and also became a regular playing smaller roles for Jonathan Demme. His granite-like jaw and wide, gate-like grin have contributed to his many memorable portrayals of tough guys, notably the scheming intelligence officer up against Sylvester Stallone in Rambo: First Blood Part II (1985) and the short-tempered front man of the Good Ole Boys in The Blues Brothers (1980), where he delivers the masterful 'corn on the cob' line.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyODc4NjY0OF5BMl5BanBnXkFtZTcwNzk1NTg4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0621008","name":"Charles Napier","idIMDB":"nm0621008"},"actorId":"nm0621008","character":"Irate Chef","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jim Roche","urlProfile":"http://www.imdb.com/name/nm0733940","urlPhoto":"","biography":{"bio":"Jim Roche is an actor, known for The Silence of the Lambs (1991), Philadelphia (1993) and The Manchurian Candidate (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0733940","name":"Jim Roche","idIMDB":"nm0733940"},"actorId":"nm0733940","character":"Motel Philosopher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Sayles","urlProfile":"http://www.imdb.com/name/nm0000626","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3Mzc4Mzk4OV5BMl5BanBnXkFtZTYwNDU0NjQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1950","placeOfBirth":" Schenectady, New York, USA","birthName":"John Thomas Sayles","height":"6' 4\" (1.93 m)","bio":"A bright child, John Sayles began reading novels before age 9. A Williams grad in 1972, he shunned a corporate career to work various blue-collar jobs, moving to east Boston to take a factory job. He wrote stories and submitted them to various magazines, and the Atlantic Monthly gave him the idea of publishing them in a novel--thus \"Pride of the Bimbos\" (1975) was born. In the late 1970s he worked for renowned low-budget producer Roger Corman as a screenwriter. He saved much of the money he earned from that job, got some friends together and made Return of the Secaucus Seven (1979) in 25 days. Altough it was a hit, he had trouble obtaining financing for the films he wanted to make because he would not give up his right of final cut. Baby It's You (1983) was Sayles' only film made under studio control. In 1983 the MacArthur Foundation Fellowship granted him a tax-free income of $32,000 a year for 5 years. That stipend and money he earned for writing such films as The Clan of the Cave Bear (1986), Enormous Changes at the Last Minute (1983) and Breaking In (1989) enabled him to make the kinds of films he wanted to make. Lone Star (1996) placed Sayles in the ranks of top American filmmakers. In it and his other films, a broadly appealing social consciousness emerges, showing Sayles to be concerned with what's going on with regional cultures, national values and what living in the US is like today. Sayles and Maggie Renzi, whom he met during college, have lived together since the 1970s, splitting their time between a Hoboken, NJ, house and a farm in upstate New York. They have no plans to marry.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3Mzc4Mzk4OV5BMl5BanBnXkFtZTYwNDU0NjQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000626","name":"John Sayles","idIMDB":"nm0000626"},"actorId":"nm0000626","character":"Motorcycle Cop","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0091983","urlIMDB":"http://www.imdb.com/title/tt0091983","business":{"budget":null,"openingWeekend":[{"money":"$1,825,717","country":"USA","day":"09","month":"11","year":"1986","remarks":"914 Screens"},{"money":null,"country":null,"day":"12","month":"08","year":"1987","remarks":"57 Screens"}],"gross":[{"money":"$7,313,043","country":"USA","day":"14","month":"12","year":"1986","remarks":""},{"money":"$6,972,504","country":"USA","day":"07","month":"12","year":"1986","remarks":""},{"money":"$6,377,472","country":"USA","day":"30","month":"11","year":"1986","remarks":""},{"money":"$5,341,684","country":"USA","day":"23","month":"11","year":"1986","remarks":""},{"money":"$3,965,461","country":"USA","day":"16","month":"11","year":"1986","remarks":""},{"money":"$1,825,717","country":"USA","day":"09","month":"11","year":"1986","remarks":""},{"money":null,"country":null,"day":"16","month":"09","year":"1987","remarks":""},{"money":null,"country":null,"day":"09","month":"09","year":"1987","remarks":""},{"money":null,"country":null,"day":"02","month":"09","year":"1987","remarks":""},{"money":null,"country":null,"day":"26","month":"08","year":"1987","remarks":""},{"money":null,"country":null,"day":"19","month":"08","year":"1987","remarks":""},{"money":null,"country":null,"day":"12","month":"08","year":"1987","remarks":""}],"weekendGross":[{"money":"$200,260","country":"USA","day":"14","month":"12","year":"1986","remarks":"309 Screens"},{"money":"$412,225","country":"USA","day":"07","month":"12","year":"1986","remarks":"403 Screens"},{"money":"$681,304","country":"USA","day":"30","month":"11","year":"1986","remarks":"462 Screens"},{"money":"$918,250","country":"USA","day":"23","month":"11","year":"1986","remarks":"686 Screens"},{"money":"$1,416,522","country":"USA","day":"16","month":"11","year":"1986","remarks":"842 Screens"},{"money":"$1,825,717","country":"USA","day":"09","month":"11","year":"1986","remarks":"914 Screens"},{"money":null,"country":null,"day":"16","month":"09","year":"1987","remarks":"56 Screens"},{"money":null,"country":null,"day":"09","month":"09","year":"1987","remarks":"403 Screens"},{"money":null,"country":null,"day":"02","month":"09","year":"1987","remarks":"462 Screens"},{"money":null,"country":null,"day":"26","month":"08","year":"1987","remarks":"58 Screens"},{"money":null,"country":null,"day":"19","month":"08","year":"1987","remarks":"64 Screens"},{"money":null,"country":null,"day":"12","month":"08","year":"1987","remarks":"57 Screens"}],"admissions":[{"money":"336,482","country":"West","day":null,"month":null,"year":null,"remarks":null}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"19","month":"03","year":"1986","remarks":null},null],"copyrightHolder":"CCOPYRIGHT© 1986 ORION PICTURES CORPORATION"},"technical":{"runtime":["1 hr 54 min (114 min)"],"soundMix":["Dolby Stereo"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["DeLuxe, USA (prints)","DuArt Film Laboratories Inc., New York, USA (color)"],"filmLength":["3,106 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.9","metascore":"73","filmingLocations":[{"location":"Quincy, Florida, USA"}],"rated":"R","awards":[{"award":"Golden Globes, USA 1987","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Performance by an Actress in a Motion Picture - Comedy or Musical","names":[{"name":"Melanie Griffith","id":"nm0000429","role":null}]},{"category":"Best Performance by an Actor in a Motion Picture - Comedy or Musical","names":[{"name":"Jeff Daniels","id":"nm0001099","role":null}]},{"category":"Best Performance by an Actor in a Supporting Role in a Motion Picture","names":[{"name":"Ray Liotta","id":"nm0000501","role":null}]}]}]},{"award":"Boston Society of Film Critics Awards 1987","titlesAwards":[{"titleAwardOutcome":"Won BSFC Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Ray Liotta","id":"nm0000501","role":null}]}]}]},{"award":"Casting Society of America, USA 1987","titlesAwards":[{"titleAwardOutcome":"Nominated Artios","categories":[{"category":"Best Casting for Feature Film, Comedy","names":[{"name":"Risa Bramon Garcia","id":"nm0305405","role":null},{"name":"Billy Hopkins","id":"nm0394119","role":null}]}]}]},{"award":"Edgar Allan Poe Awards 1987","titlesAwards":[{"titleAwardOutcome":"Won Edgar","categories":[{"category":"Best Motion Picture","names":[{"name":"E. Max Frye","id":"nm0296861","role":null}]}]}]},{"award":"National Society of Film Critics Awards, USA 1987","titlesAwards":[{"titleAwardOutcome":"3rd place NSFC Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Ray Liotta","id":"nm0000501","role":null}]}]}]},{"award":"New York Film Critics Circle Awards 1986","titlesAwards":[{"titleAwardOutcome":"3rd place NYFCC Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Ray Liotta","id":"nm0000501","role":null}]}]}]}],"votes":"12,524","type":"Movie","companyCreditsSimple":[{"idCompany":"co0620197","name":"Religioso Primitiva"}],"keywords":{"keywords":["reunion","ex convict","yuppie","motel","new york","convertible","female frontal nudity","bare butt","bare breasts","blonde wearing a dark wig","female sitting on a toilet","highway travel","road trip","cult film","road movie","bare chested male bondage","fatal attraction","haunted by the past","date from hell","opposites attract","lovers on the lam","role swap","on the road","travel","sex","ex husband ex wife relationship","deception","police","chase","femme fatale","dark comedy","cameo","moonwalk dancing","handcuffs","handcuffed to a bedpost","urination","dominatrix","diner","robbery","nudity","new york city","psychotic","murder","psychopath","violence","broken nose","stabbing","class reunion","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:16:41"}}