{"data":{"movies":[{"title":"Three Loves Has Nancy","originalTitle":"","year":"1938","releaseDate":"19380902","directors":[{"name":"Richard Thorpe","id":"nm0861703"}],"writers":[{"name":"Mortimer Braus","id":"nm0105965"},{"name":"David Hertz","id":"nm0381082"}],"runtime":"70 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjE3OTVlNTgtYjg2NS00NzliLWJmYWUtM2IyYmRmYTA1NzVmXkEyXkFqcGdeQXVyMTIxMDUyOTI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"The seduction plans of novelist Malcolm Niles go awry when actress Vivian Herford brings along her mother to a candlelight dinner in his New York apartment. When they talk of marriage, Malcolm decides to make a tour promoting his new book, and in a small southern town meets Nancy Briggs at an autographing session at the local bookstore. Nancy is getting married that night, but her fiancé, working in New York, doesn't come back for the wedding, so her family gives her the fare to go to New York to find him. At the same time, Malcolm gets a wire from his publisher and friend, Robert Hanson, telling him to come home because Vivian has left town. Traveling to New York on the same train, Nancy proves to be a pest who Malcolm hopes to avoid once they arrive, but when Nancy can't find her fiancé, she goes to Malcolm, since he's the only one she knows in the city. He is about to kick her out when Vivian returns, so he uses Nancy as an excuse to get rid of Vivian. In the ensuing days, Nancy ...","simplePlot":"A small-town country homebody goes to New York to find her missing fiancé and gets romantically involved with two sophisticated men.","actors":[{"actorName":"Janet Gaynor","urlProfile":"http://www.imdb.com/name/nm0310980","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MzE4Nzk0N15BMl5BanBnXkFtZTYwMjg0NzU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 October 1906","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Laura Augusta Gainor","height":"5' (1.52 m)","bio":"Janet Gaynor was born Laura Gainor on October 6, 1906, in Philadelphia, Pennsylvania. As a child, she & her parents moved to San Francisco, California, where she graduated from high school in 1923. She then moved to Los Angeles where she enrolled in a secretarial school. She got a job at a shoe store for the princely sum of $18 per week. However, since L.A. was the land of stars and studios, she wanted to try her hand at acting. She managed to land unbilled bit parts in several feature films and comedy shorts. She bided her time, believing \"Good things come to those who wait.\" She didn't have to wait too long, either. In 1926, at the age of 20, she turned in a superb performance as Anna Burger in The Johnstown Flood (1926). The Hollywood moguls knew they had a top star on their hands and cast her in several other leading roles that year, including The Shamrock Handicap (1926), The Blue Eagle (1926), The Midnight Kiss (1926) and The Return of Peter Grimm (1926). The next year she turned in acclaimed performances in two classic films, 7th Heaven (1927) and Sunrise (1927). Based on the strength of those two films plus Street Angel (1928), Janet received the very first Academy Award for best actress. This was the first and only time an actress won the Oscar for multiple roles. When \"talkies\" replaced silent films, Janet was one of the few who made a successful transition, not only because of her great acting ability but for her charming voice as well. Without a doubt, Janet had already lived a true rags-to-riches story. Throughout the mid-1930s she was the top drawing star at theaters. She turned in grand performances in several otherwise undistinguished films. Then came A Star Is Born (1937). She was very convincing as Vicki Lester (aka Esther Blodgett), struggling actress trying for the big time. Told by the receptionist at Central casting \"You know what your chances are? One in a hundred thousand,\" Esther/Vicki replies, \"But maybe--I'm that one.\" For her outstanding performance she was nominated for another Oscar, but lost to Luise Rainer's performance in The Good Earth (1937), her second in as many tries. After appearing in The Young in Heart (1938), Janet didn't appear in another film until 1957's Bernardine (1957). Her last performance was in a Broadway version of Harold and Maude. Although the play was a flop, Janet's performance salvaged it to any degree - she still had what it took to entertain the public. On September 14, 1984, Janet passed away from pneumonia in Palm Springs, California, at the age of 77.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MzE4Nzk0N15BMl5BanBnXkFtZTYwMjg0NzU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0310980","name":"Janet Gaynor","nicknames":["Lolly"],"idIMDB":"nm0310980"},"actorId":"nm0310980","character":"Nancy Briggs","urlCharacter":"http://www.imdb.com/character/ch0505211","main":true},{"actorName":"Robert Montgomery","urlProfile":"http://www.imdb.com/name/nm0599910","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4ODEyMzcyN15BMl5BanBnXkFtZTYwMTk3NjQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 May 1904","placeOfBirth":" Fishkill Landing [now Beacon], New York, USA","birthName":"Henry Montgomery Jr.","height":"6' 1\" (1.85 m)","bio":"As a child, Robert Montgomery enjoyed a privileged life, as his father was the president of the New York Rubber Co. When he died, the fortune was gone and Robert worked at a number of jobs. He later went to New York to be a writer, and on the advice of a friend tried acting. He worked with George Cukor on the stage and his first film, at MGM, was So This Is College (1929). When Norma Shearer picked him to be her leading man in Private Lives (1931), he was set. He played many likable characters over the years, covering the gamut from very poor to very rich. In 1935, he became President of the Screen Actors Guild. His stay with MGM lasted 16 years, and was only interrupted by WWII when he joined the navy. He saw action in both Europe and the Pacific. He returned to MGM in 1945 and co-starred with John Wayne in the John Ford-directed They Were Expendable (1945) and then made his directorial debut with Lady in the Lake (1947) (although he had directed a few scenes, uncredited, in They Were Expendable (1945) when John Ford took ill). He then left MGM to become an independent director, preferring work behind the camera instead of in front. He was a friendly witness before the House Un-American Activities in 1947 during the McCarthy era and then spent most of his time on television and stage. His popular show, Robert Montgomery Presents (1950), was where daughter Elizabeth Montgomery (who later gained fame as beautiful witch Samantha on TV's popular Bewitched (1964)) got her first acting job.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4ODEyMzcyN15BMl5BanBnXkFtZTYwMTk3NjQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0599910","name":"Robert Montgomery","nicknames":["Bob"],"idIMDB":"nm0599910"},"actorId":"nm0599910","character":"Malcolm 'Mal' Niles","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Franchot Tone","urlProfile":"http://www.imdb.com/name/nm0867144","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MTE4MDg0MV5BMl5BanBnXkFtZTYwNjI0NDgy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1905","placeOfBirth":" Niagara Falls, New York, USA","birthName":"Stanislas Pascal Franchot Tone","height":"5' 10\" (1.78 m)","bio":"President of the Dramatic Club at Cornell University, Franchot Tone gave up the family business for acting, making his Broadway debut in \"The Age of Innocence\". Tone then went into movies for MGM, making his film debut in The Wiser Sex (1932). With his theatrical background, Tone became one of the most talented movie actors in Hollywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MTE4MDg0MV5BMl5BanBnXkFtZTYwNjI0NDgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0867144","name":"Franchot Tone","idIMDB":"nm0867144"},"actorId":"nm0867144","character":"Robert 'Bob' Hanson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Guy Kibbee","urlProfile":"http://www.imdb.com/name/nm0452128","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTZkNjAzZjItMzkyNC00NjFhLTlmNWItYmNhYTI4ODIyNDQ2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1882","placeOfBirth":" El Paso, Texas, USA","birthName":"Guy Bridges Kibbee","bio":"Beginning his show business career at age 13 as an entertainer on Mississippi riverboats, Guy Kibbee graduated to the legitimate stage and spent many years in the theater. In the 1930s he was signed by Warner Brothers, and became part of what was known as \"the Warner Brothers Stock Company\", a cadre of seasoned character actors and actresses who enlivened many a Warners musical or gangster film. Kibbee specialized in playing jovial, but not particularly bright, businessmen and government officials. He was memorable as the stuffy lawyer with a secret weakness for showgirls in Gold Diggers of 1933 (1933).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTZkNjAzZjItMzkyNC00NjFhLTlmNWItYmNhYTI4ODIyNDQ2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0452128","name":"Guy Kibbee","idIMDB":"nm0452128"},"actorId":"nm0452128","character":"Pa Briggs","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Claire Dodd","urlProfile":"http://www.imdb.com/name/nm0230068","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE3MjNjZGQtODM3NC00OTI4LWE4MjQtZTgyNDY5MGRiMWMwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1908","placeOfBirth":" Des Moines, Iowa, USA","birthName":"Dorothy Arlene Dodd","height":"5' 6\" (1.68 m)","bio":"She was born Dorothy Anne Dodd on December 29, 1908, in Des Moines, Iowa while her mother was on a trip. This did not appeal to her Southern pride so she said she was born in Little Rock, Arkansas, where she was actually raised. Her father was a doctor who abandoned her and her mother before she was ten years old. Her mother suffered from tuberculosis and Dorothy was forced to support her. She went to New York at the age of fifteen, lied about her age, and joined the Ziegfeld Follies where she was eventually discovered by Fox head Darryl F. Zanuck. Zanuck brought her to Hollywood and shepherded her throughout most of her career. She worked for Warner Brothers, Paramount, and Universal. She typically played the conniving \"other\" woman and could not be cast as a \"dumb blonde\" because of her cerebral nature and demeanor. Good friends with Bette Davis with whom she worked in Ex-Lady (1933), she worked with everyone from Humphrey Bogart and Errol Flynn to Barbara Stanwyck, and James Cagney. She played Girl Friday Della Street in a couple of the \"Perry Mason\" mystery film thrillers of the 1930s starring Warren William and in one (The Case of the Velvet Claws (1936)), she married Mason, the only Della Street to do so. She played the female lead in In the Navy (1941) opposite Dick Powell but received lesser billing, which she claimed was a standard procedure practiced on her in recompense for her aloofness and refusal to go along with the Hollywood system. In fact, one reporter she rebuffed nicknamed her \"Ice Bucket\" and the reputation stuck. Claire worked in almost sixty films in twelve years from 1930 to 1942. She quit films and married second husband H. Brand Cooper to whom she gave and raised four children. She undertook and completed this phase of her life after she was forty years old, giving birth to her last child at the age of forty-seven. She was, to say the least, a remarkable woman. She died in the family home from cancer on November 23, 1973.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTE3MjNjZGQtODM3NC00OTI4LWE4MjQtZTgyNDY5MGRiMWMwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0230068","name":"Claire Dodd","nicknames":["Anne"],"idIMDB":"nm0230068"},"actorId":"nm0230068","character":"Vivian Herford","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Reginald Owen","urlProfile":"http://www.imdb.com/name/nm0654239","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMDA5NzcxOV5BMl5BanBnXkFtZTcwMTc4ODMxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1887","placeOfBirth":" Wheathampstead, Hertfordshire, England, UK","birthName":"John Reginald Owen","height":"6' (1.83 m)","bio":"Born August 5th, 1887 in England, Reginald Owen was probably Hollywood's busiest character actor - making more than 80 films. He was educated in England at Sir Herbert Tree's Academy of Dramatic Arts. Owen excelled and made his professional debut also in England at the age of 18. He came to New York in the early 1920s and started working on Broadway by 1924. He left New York in 1928 and moved to Hollywood, hoping to make it in films. In 1929, he landed his first role in The Letter. In 1932 he played Dr. Watson in Sherlock Holmes. Although, he didn't get many leading roles, he did get to work with some of Hollywood's most beautiful leading ladies like, Jean Harlow, Joan Crawford, Jeanette MacDonald (Owen's personal favorite), Barbara Stanwyck and Elizabeth Taylor. Owen continued to work into his 70s and 80s making family classics, such as Mary Poppins (1964) and Bedknobs and Broomsticks (1971). He died in 1972 at the ripe age of 85 of natural causes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMDA5NzcxOV5BMl5BanBnXkFtZTcwMTc4ODMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0654239","name":"Reginald Owen","idIMDB":"nm0654239"},"actorId":"nm0654239","character":"William - the Butler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cora Witherspoon","urlProfile":"http://www.imdb.com/name/nm0936755","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTdmZmRiNDAtNzQ1ZC00M2Q2LWI1MDQtMjUxYWY3ODZiYzBmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1890","placeOfBirth":" New Orleans, Louisiana, USA","bio":"A delightfully irksome, viper-tongued presence who usually played older than she was, actress Cora Witherspoon began her five-decade career in New York playing an elderly lady in the 1910 production of \"The Concert\". She was 20 years old at the time. Born in 1890, the brown-haired, Louisiana-born character player continued on the Broadway stage after her successful debut and became a generally unsympathetic audience favorite in such popular shows as \"Daddy Long Legs,\" \"Lillies of the Field\" and \"The Awful Truth\" for the next two decades. She began dividing her time between theater and film in the early 1930s wreaking havoc and rattling the nerves of many a male and female star with her imperious gallery of class-conscious matrons, haranguing wives, acidulous spinsters and aggressive busybodies. Notable film contributions were her cryptic socialites in the quality comedies Libeled Lady (1936) and Personal Property (1937), both starring Jean Harlow. She was equally unpleasant in such dramatic fare as Dark Victory (1939), and played her patented society snoot to perfection in the Shirley Temple vehicle Just Around the Corner (1938). A particular standout, and the movie role she is probably best remembered for, was her untidy, henpecking wife Agatha Sousé in the comedy classic The Bank Dick (1940), the prime source of W.C. Fields' misery. Though her home base was in New York City where she continued to perform in the theater, she made her living commuting to Hollywood in the post-war years, ending her career with brief appearances on TV. She died in 1957 at age 67 in New Mexico.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTdmZmRiNDAtNzQ1ZC00M2Q2LWI1MDQtMjUxYWY3ODZiYzBmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0936755","name":"Cora Witherspoon","idIMDB":"nm0936755"},"actorId":"nm0936755","character":"Mrs. Herford","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emma Dunn","urlProfile":"http://www.imdb.com/name/nm0242562","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmZjZWU2NmEtYWIzOS00YjBkLTg3NmUtNWE1MzdmZTY3YzQ2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 February 1874","placeOfBirth":" Cheshire, England, UK","height":"5' 8½\" (1.74 m)","bio":"Emma Dunn was a much noted stage actress before turning to films. She worked with such theatre luminaries as Richard Mansfield, Frances Starr, James Ellison and Blanche Yurka. She appeared in 3 productions under the direction of the legendary David Belasco. Miss Dunn also authored 2 books regarding diction and voice quality.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmZjZWU2NmEtYWIzOS00YjBkLTg3NmUtNWE1MzdmZTY3YzQ2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0242562","name":"Emma Dunn","idIMDB":"nm0242562"},"actorId":"nm0242562","character":"Mrs. Briggs","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charley Grapewin","urlProfile":"http://www.imdb.com/name/nm0335788","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyODYwMTMzNzNeQTJeQWpwZ15BbWU3MDI5NjM2MDg@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 December 1869","placeOfBirth":" Xenia, Ohio, USA","birthName":"Charles Ellsworth Grapewin","height":"5' 7½\" (1.71 m)","bio":"This old codger film favorite, born in 1869 (some reports say 1875), got into the entertainment field at an early age, first as a circus performer (aerialist and trapeze artist). When acting sparked his interest, he worked in a series of stock companies while writing stage plays that he himself could star in. He married actress Anna Chance around the turn of the century, and they remained a devoted couple until her death 47 years later. They had no children. Charley came into his own in films at the ripe old age of 60 as the ultimate humorous, toothless character in a range of films with rustic settings. Notable movies include The Petrified Forest (1936) with Leslie Howard and Humphrey Bogart, The Good Earth (1937) with Paul Muni and Luise Rainer, and They Died with Their Boots On (1941) with Errol Flynn. However, his best-remembered parts were as huggable Uncle Henry in the classic The Wizard of Oz (1939), ornery Grandpa Joad, who refused to leave the homestead in The Grapes of Wrath (1940), Inspector Queen in the Ellery Queen whodunits that ran from 1940 through 1942, and the amiable ne'er-do-well Jeeter Lester in Tobacco Road (1941). A soft, humorous presence who seemed frail around the edges, he was a thorough delight, his folksy presence gracing over 100 films. He died in 1956.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyODYwMTMzNzNeQTJeQWpwZ15BbWU3MDI5NjM2MDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0335788","name":"Charley Grapewin","idIMDB":"nm0335788"},"actorId":"nm0335788","character":"Grandpa Briggs","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lester Matthews","urlProfile":"http://www.imdb.com/name/nm0560091","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmQwODg5YTktMWQxYy00ODhjLWE4ZGUtMTE0NDAxOTgwYzY0XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 June 1900","placeOfBirth":" Nottingham, England, UK","birthName":"Arthur Lester Matthews","height":"6' (1.83 m)","bio":"Lester Matthews was born on June 6, 1900 in Nottingham, England as Arthur Lester Matthews. He was an actor, known for The Adventures of Robin Hood (1938), Werewolf of London (1935) and The Raven (1935). He was married to Anne Grey and Cicely Walper. He died on June 6, 1975 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmQwODg5YTktMWQxYy00ODhjLWE4ZGUtMTE0NDAxOTgwYzY0XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0560091","name":"Lester Matthews","idIMDB":"nm0560091"},"actorId":"nm0560091","character":"Dr. Alonzo Z. Stewart","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Grady Sutton","urlProfile":"http://www.imdb.com/name/nm0840316","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWY2OTg5NzMtZmEwMC00MjI5LWI1ZjEtZGM0YjIwN2JhYTY2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 April 1906","placeOfBirth":" Chattanooga, Tennessee, USA","birthName":"Grady Harwell Sutton","height":"6' 2\" (1.88 m)","bio":"Grady Sutton was born in Chattanooga, Tennessee. He arrived in California in 1924. He got his first break in Hollywood from director William A. Seiter who used him as an extra in The Mad Whirl (1925) starring May McAvoy. Grady remained a Hollywood staple for the next 55 years. He specialized in playing naive, slightly befuddled young men and country bumpkins, adding comedic bits to many films. His most famous association came from appearing in four movies with W.C. Fields: The Pharmacist (1933), Man on the Flying Trapeze (1935), You Can't Cheat an Honest Man (1939) and The Bank Dick (1940). He can also be seen in such classics as My Man Godfrey (1936), Stage Door (1937), Alexander's Ragtime Band (1938), Angels Wash Their Faces (1939), Anchors Aweigh (1945), White Christmas (1954) and A Star Is Born (1954). He was also a regular on The Egg and I (1951) and The Phyllis Diller Show (1966) television series. In total, he appeared in over 200 feature films and short subjects spanning 1924 to 1979. His final film appearance was in Rock 'n' Roll High School (1979). In 1994 he moved to the Motion Picture and Television Home and Hospital in Woodland Hills, California where he died September 17, 1995, of natural causes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWY2OTg5NzMtZmEwMC00MjI5LWI1ZjEtZGM0YjIwN2JhYTY2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0840316","name":"Grady Sutton","idIMDB":"nm0840316"},"actorId":"nm0840316","character":"George Wilkins, Jr.","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary Forbes","urlProfile":"http://www.imdb.com/name/nm0285376","urlPhoto":"","biography":{"dateOfBirth":"30 December 1879","placeOfBirth":" Hornsey, Middlesex [now in Haringey, London], England, UK","bio":"Mary Forbes was born on December 30, 1879 in Hornsey, Middlesex [now in Haringey, London], England. She was an actress, known for A Farewell to Arms (1932), You Can't Take It with You (1938) and Terror by Night (1946). She was married to Wesley Wall (house builder), E. J. Taylor and Charles Quatermaine. She died on July 22, 1974 in Beaumont, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0285376","name":"Mary Forbes","idIMDB":"nm0285376"},"actorId":"nm0285376","character":"Mrs. Hansen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Grant Withers","urlProfile":"http://www.imdb.com/name/nm0936728","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjQ4NzQ3MmYtZGFhNC00MTg3LWE3NzMtNDY5MTU3NDJkNDNhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1905","placeOfBirth":" Pueblo, Colorado, USA","birthName":"Granville G. Withers","height":"6' 3\" (1.91 m)","bio":"Appeared in over 200 films. He had worked as a salesman and newspaper reporter before breaking into movies near the end of the silent era. Tall and tough, his starring roles in major pictures soon gave way to supporting parts, mainly as a villain, in B movies and serials. His elopement to Yuma, Arizona, in 1930 with a 17-year-old Loretta Young was widely reported. From 1940 on, he took numerous supporting roles, working until his suicide in 1959.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjQ4NzQ3MmYtZGFhNC00MTg3LWE3NzMtNDY5MTU3NDJkNDNhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0936728","name":"Grant Withers","idIMDB":"nm0936728"},"actorId":"nm0936728","character":"Jack","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0030867","urlIMDB":"http://www.imdb.com/title/tt0030867","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"04","month":"08","year":"1938","remarks":null},"filmingDates":null,"copyrightHolder":"Loew's Inc., 29 August 1938, LP8264"},"technical":{"runtime":["1 hr 10 min (70 min)"],"soundMix":["Mono (Western Electric Sound System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["1,906.85 m (UK)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.5","filmingLocations":[{"location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA"}],"awards":[],"votes":"343","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"}],"keywords":{"keywords":["new york","publisher","somnambulism","psychiatrist","author"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:27:01"}}