{"data":{"movies":[{"title":"Romeo and Juliet","originalTitle":"","year":"1936","releaseDate":"19360903","directors":[{"name":"George Cukor","id":"nm0002030"}],"writers":[{"name":"William Shakespeare","id":"nm0000636"},{"name":"Talbot Jennings","id":"nm0421255"}],"runtime":"125 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNDYyOTIwMF5BMl5BanBnXkFtZTgwMTk1NTAwMjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Romance"],"plot":"The Montagues and the Capulets, two powerful families of Verona, hate each other. Romeo, son of Montague, crashes a Capulet party, and there meets Juliet, daughter of Capulet. They fall passionately in love. Since their families would disapprove, they marry in secret. Romeo gets in a fight with Tybalt, nephew of Lady Capulet, and kills him. He is banished from Verona. Capulet, not knowing that his daughter is already married, proceeds with his plans to marry Juliet to Paris, a prince. This puts Juliet in quite a spot, so she goes to the sympathetic Friar Laurence, who married her to Romeo. He suggests a daring plan to extricate her from her fix. Tragedy ensues.","simplePlot":"Young love is poisoned by a generations long feud between two noble families.","actors":[{"actorName":"Norma Shearer","urlProfile":"http://www.imdb.com/name/nm0790454","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4OTI0MjU5NV5BMl5BanBnXkFtZTYwNjYxNjU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1902","placeOfBirth":" Montréal, Québec, Canada","birthName":"Edith Norma Shearer","height":"5' 1\" (1.55 m)","bio":"She won a beauty contest at age fourteen. In 1920 her mother, Edith Shearer, took Norma and her sister Athole Shearer (Mrs. Howard Hawks) to New York. Ziegfeld rejected her for his \"Follies,\" but she got work as an extra in several movies. She spent much money on eye doctor's services trying to correct her cross-eyed stare caused by a muscle weakness. Irving Thalberg had seen her early acting efforts and, when he joined Louis B. Mayer in 1923, gave her a five year contract. He thought she should retire after their marriage, but she wanted bigger parts. In 1927, she insisted on firing the director Viktor Tourjansky because he was unsure of her cross-eyed stare. Her first talkie was in The Trial of Mary Dugan (1929); four movies later, she won an Oscar in The Divorcee (1930). She intentionally cut down film exposure during the 1930s, relying on major roles in Thalberg's prestige projects: The Barretts of Wimpole Street (1934) and Romeo and Juliet (1936) (her fifth Oscar nomination). Thalberg died of a second heart attack in September, 1936, at age 37. Norma wanted to retire, but MGM more-or-less forced her into a six-picture contract. David O. Selznick offered her the part of Scarlett O'Hara in Gone with the Wind (1939), but public objection to her cross-eyed stare killed the deal. She starred in The Women (1939), turned down the starring role in Mrs. Miniver (1942), and retired in 1942. Later that year she married Sun Valley ski instructor Martin Arrouge, eleven years younger than she (he waived community property rights). From then on, she shunned the limelight; she was in very poor health the last decade of her life.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4OTI0MjU5NV5BMl5BanBnXkFtZTYwNjYxNjU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0790454","name":"Norma Shearer","nicknames":["The First Lady Of MGM","Queen Norma"],"idIMDB":"nm0790454"},"actorId":"nm0790454","character":"Juliet - Daughter to Capulet","urlCharacter":"http://www.imdb.com/character/ch0000496","main":true},{"actorName":"Leslie Howard","urlProfile":"http://www.imdb.com/name/nm0001366","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NjM2MTE3Nl5BMl5BanBnXkFtZTYwNjY4NjQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1893","placeOfBirth":" Forest Hill, London, England, UK","birthName":"Leslie Howard Steiner","height":"5' 10½\" (1.79 m)","bio":"Leslie Howard Stainer was born in London, to Lilian (Blumberg) and Ferdinand \"Frank\" Steiner. His father was a Hungarian Jewish immigrant, and his English mother was of German Jewish, and mostly English, descent. Leslie went to Dulwich College. After school, he worked as a bank clerk until the outbreak of World War I, when he went into the army. In 1917, diagnosed as shell-shocked, he was invalided out and advised to take up acting as therapy. In a few years, his name was famous on the stages of London and New York. He made his first movie in 1914 (The Heroine of Mons (1914)). He became known as the perfect Englishman (slim, tall, intellectual and sensitive), a part that he played in many movies, and a part women would dream about. His first sound movie came in 1930, Outward Bound (1930), an adaptation of the stage play in which he starred. In Never the Twain Shall Meet (1931) and Smilin' Through (1932), he played the Englishman role to the hilt. His screen persona could perhaps best be summed up by his role as Sir Percy Blakeney in The Scarlet Pimpernel (1934), a foppish member of society. It was Howard who insisted that Humphrey Bogart get the role of Duke Mantee in The Petrified Forest (1936), a role that Bogart had played in the stage production. As he became more successful, he also became quite picky about which roles he would do, and usually performed in only two films a year. In 1939, he played the character that will always be associated with him, that of Ashley Wilkes, the honor-bound disillusioned intellectual Southern gentleman in Gone with the Wind (1939). However, war clouds were gathering over England, and he devoted all his energy on behalf of the war effort. He directed films, wrote articles and made radio broadcasts. He died in 1943, when the KLM plane he was in was shot down by German fighters over the Bay of Biscay.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NjM2MTE3Nl5BMl5BanBnXkFtZTYwNjY4NjQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001366","name":"Leslie Howard","idIMDB":"nm0001366"},"actorId":"nm0001366","character":"Romeo - Son to Montague","urlCharacter":"http://www.imdb.com/character/ch0000491","main":true},{"actorName":"John Barrymore","urlProfile":"http://www.imdb.com/name/nm0000858","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMTc5NzMwNV5BMl5BanBnXkFtZTYwNzAwNTQ2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 February 1882","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"John Sidney Blyth","height":"5' 10\" (1.78 m)","bio":"American stage and screen actor whose rise to superstardom and subsequent decline is one of the legendary tragedies of Hollywood. A member of the most famous generation of the most famous theatrical family in America, he was also its most acclaimed star. His father was Maurice Blyth (or Blythe; family spellings vary), a stage success under the name 'Maurice Barrymore'. His mother, Georgie Drew, was the daughter of actor John Drew. Although well known in the theatre, Maurice and Georgie were eclipsed by their three children, John, Lionel Barrymore, and Ethel Barrymore, each of whom became legendary stars. John was handsome and roguish. He made his stage debut at 18 in one of his father's productions, but was much more interested in becoming an artist. Briefly educated at King's College, Wimbledon, and at New York's Art Students League, Barrymore worked as a freelance artist and for a while sketched for the New York Evening Journal. Gradually, though, the draw of his family's profession ensnared him and by 1905 he had given up professional drawing and was touring the country in plays. He survived the 1906 San Francisco earthquake and in 1909 became a major Broadway star in \"The Fortune Hunter.\" In 1922, Barrymore became his generation's most acclaimed Hamlet, in New York and London. But by this time he had become a frequent player in motion pictures. His screen debut supposedly came in An American Citizen (1914), though records of several lost films indicate he may have made appearances as far back as 1912. He became every bit the star of films that he was on stage, eclipsing his siblings in both arenas. Though his striking matinee-idol looks had garnered him the nickname \"The Great Profile\", he often buried them under makeup or distortion in order to create memorable characters of degradation or horror. He was a romantic leading man into the early days of sound films, but his heavy drinking (since boyhood) began to take a toll, and he degenerated quickly into a man old before his time. He made a number of memorable appearances in character roles, but these became over time more memorable for the humiliation of a once-great star than for his gifts. His last few films were broad and distasteful caricatures of himself, though in even the worst, such as Playmates (1941), he could rouse himself to a moving soliloquy from Hamlet. He died in 1942, mourned as much for the loss of his life as for the loss of grace, wit, and brilliance which had characterized his career at its height.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMTc5NzMwNV5BMl5BanBnXkFtZTYwNzAwNTQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000858","name":"John Barrymore","nicknames":["The Great Profile","Jack"],"idIMDB":"nm0000858"},"actorId":"nm0000858","character":"Mercutio - Kinsman to the Prince and Friend to Romeo","urlCharacter":"http://www.imdb.com/character/ch0000528","main":true},{"actorName":"Edna May Oliver","urlProfile":"http://www.imdb.com/name/nm0646829","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNTM0NTA0MV5BMl5BanBnXkFtZTgwMzYxNjQ3MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 November 1883","placeOfBirth":" Malden, Massachusetts, USA","birthName":"Edna May Nutter","height":"5' 7\" (1.7 m)","bio":"She was born Edna May Nutter, a child of solid New England stock, on 9th November 1883 in Malden, Massachusetts. The daughter of Ida May and Charles Edward Nutter, Edna was a descendant of the 6th American president John Quincy Adams. Miss Oliver took an early interest in the stage, and she would quit school at the age of 14 to pursue her ambitions in the theater. Despite abandoning traditional schooling, Edna continued to study the performing arts, including speech and piano. One of her first jobs was as pianist with an all female orchestra which toured America around the turn of the century. By 1917 she had achieved success on Broadway in the hit play \"Oh, Boy\". By 1923 she had appeared in her first film. Edna May Oliver seems to have been born to play the classics of American and British literature. Some of her most memorable film roles were in adaptations of works of Charles Dickens. Although some have described her as plain or \"horse faced\", Edna May Oliver's comedic talents lent a beautiful droll warmth to her characters. She was usually called upon to play less glamorous roles such as a spinsters, but she played them with such soul, wit, and depth that to this day she remains one of the best loved of Hollywood's character actresses. A fine example of her comedic talent can be found in Laugh and Get Rich (1931). Here we find her playing a role almost autobiographical in nature, that of a proud woman with Boston roots who has married \"down\". As the plot unwinds, she is invited to a society gala despite her modest circumstances. At the gala she becomes tipsy. With a frolicsome air Edna May seems to use the role to gently mock her real self. Her slightly drunk character seizes upon a bit of flattery, and alluding to her old New England family, proudly proclaims to each who will listen, \"I am a Cranston. That explains everything!\". In real life, Edna May Oliver was a Nutter, and perhaps that explains everything. Edna May Oliver married stock broker David Pratt in 1928, but the marriage ended in divorce five years later. In 1939 she received an Oscar nomination for her supporting role as Widow McKlennar in the picture Drums Along the Mohawk (1939). That was to be one of her last films. Miss Oliver was struck ill in August of 1942. Although she seemed to recover briefly, she was re-admitted to Los Angeles's Cedars of Lebanon hospital in October Her dear friend actress Virginia Hammond flew out from New York to stay by her bedside. Edna May Oliver died on her 59th birthday, 9th November 1942. Virginia Hammond was with her and said, \"She died without ever being aware of the gravity of her condition. She just went peacefully asleep.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNTM0NTA0MV5BMl5BanBnXkFtZTgwMzYxNjQ3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0646829","name":"Edna May Oliver","idIMDB":"nm0646829"},"actorId":"nm0646829","character":"Nurse to Juliet","urlCharacter":"http://www.imdb.com/character/ch0153510","main":true},{"actorName":"Basil Rathbone","urlProfile":"http://www.imdb.com/name/nm0001651","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjkzNzU1NV5BMl5BanBnXkFtZTYwMDM2MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1892","placeOfBirth":" Johannesburg, South Africa","birthName":"Philip St. John Basil Rathbone","height":"6' 1½\" (1.87 m)","bio":"Basil Rathbone was born in Johannesburg, South Africa, in 1892, but three years later his family was forced to flee the country because his father was accused by the Boers of being a British spy at a time when Dutch-British conflicts were leading to the Boer War. The Rathbones escaped to England, where Basil and his two younger siblings, Beatrice and John, were raised. Their mother, Anna Barbara (George), was a violinist, who was born in Grahamstown, South Africa, of British parents, and their father, Edgar Philip Rathbone, was a mining engineer born in Liverpool. From 1906 to 1910 Rathbone attended Repton School, where he was more interested in sports--especially fencing, at which he excelled--than studies, but where he also discovered his interest in the theater. After graduation he planned to pursue acting as a profession, but his father disapproved and suggested that his son try working in business for a year, hoping he would forget about acting. Rathbone accepted his father's suggestion and worked as a clerk for an insurance company--for exactly one year. Then he contacted his cousin Frank Benson, an actor managing a Shakespearean troupe in Stratford-on-Avon. Rathbone was hired as an actor on the condition that he work his way through the ranks, which he did quite rapidly. Starting in bit parts in 1911, he was playing juvenile leads within two years. In 1915 his career was interrupted by the First World War. During his military service, as a second lieutenant in the Liverpool Scottish 2nd Battalion, he worked in intelligence and received the Military Cross for bravery. In 1919, released from military service, he returned to Stratford-on-Avon and continued with Shakespeare but after a year moved onto the London stage. The year after that he made his first appearance on Broadway and his film debut in the silent Innocent (1921). For the remainder of the decade Rathbone alternated between the London and New York stages and occasional appearances in films. In 1929 he co-wrote and starred as the title character in a short-running Broadway play called \"Judas\". Soon afterwards he abandoned his first love, the theater, for a film career. During the 1920s his roles had evolved from the romantic lead to the suave lady-killer to the sinister villain (usually wielding a sword), and Hollywood put him to good use during the 1930s in numerous costume romps, including Captain Blood (1935), David Copperfield (1935), A Tale of Two Cities (1935), Anna Karenina (1935), The Last Days of Pompeii (1935), The Adventures of Robin Hood (1938), Tower of London (1939), The Mark of Zorro (1940) and others. Rathbone earned two Oscar nominations for Best Supporting Actor as Tybalt in Romeo and Juliet (1936) and as King Louis XI in If I Were King (1938). However, it was in 1939 that Rathbone played his best-known and most popular character, Sherlock Holmes, with Nigel Bruce as Dr. Watson, first in The Hound of the Baskervilles (1939) and then in The Adventures of Sherlock Holmes (1939), which were followed by 12 more films and numerous radio broadcasts over the next seven years. Feeling that his identification with the character was killing his film career, Rathbone went back to New York and the stage in 1946. The next year he won a Tony Award for his portrayal of Dr. Sloper in the Broadway play \"The Heiress,\" but afterwards found little rewarding stage work. Nevertheless, during the last two decades of his life, Rathbone was a very busy actor, appearing on numerous television shows, primarily drama, variety and game shows; in occasional films, such as Casanova's Big Night (1954), The Court Jester (1955), Tales of Terror (1962) and The Comedy of Terrors (1963); and in his own one-man show, \"An Evening with Basil Rathbone\", with which he toured the U.S.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjkzNzU1NV5BMl5BanBnXkFtZTYwMDM2MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001651","name":"Basil Rathbone","nicknames":["Ratters"],"idIMDB":"nm0001651"},"actorId":"nm0001651","character":"Tybalt - Nephew to Lady Capulet","urlCharacter":"http://www.imdb.com/character/ch0000499","main":true},{"actorName":"C. Aubrey Smith","urlProfile":"http://www.imdb.com/name/nm0807580","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDQxOTI0MV5BMl5BanBnXkFtZTYwMjM3MjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 July 1863","placeOfBirth":" London, England, UK","birthName":"Charles Aubrey Smith","height":"6' 2\" (1.88 m)","bio":"Movie roles are sometimes based upon what the audience expects to see. If the role called for the tall stereotypical Englishmen with the stiff upper lip and stern determination, that man would be C. Aubrey Smith, graduate of Cambridge University, a leading Freemason and a test cricketer for England. Smith was 30 by the time he embarked upon a career on the stage. It took another 20 plus years before he entered the flickering images of the movies. By 1915, Smith was over 50 in a medium that demanded young actors and starlets. For the next ten years, he appeared in a rather small number of silent movies, and after that, he faded from the scene. It was in 1930, with the advent of sound, that Smith found his position in the movies and that position would be distinguished roles. He played military officers, successful business men, ministers of the cloth and ministers of government. With the bushy eyebrows and stoic face, he played men who know about honour, tradition, and the correct path. He worked with big stars such as Greta Garbo, Douglas Fairbanks Jr. and Shirley Temple. As for honours, Smith received the Order of the British Empire in 1938 and was knighted in 1944. He continued to work up to the time of his death.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDQxOTI0MV5BMl5BanBnXkFtZTYwMjM3MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0807580","name":"C. Aubrey Smith","idIMDB":"nm0807580"},"actorId":"nm0807580","character":"Lord Capulet","urlCharacter":"http://www.imdb.com/character/ch0000695","main":true},{"actorName":"Andy Devine","urlProfile":"http://www.imdb.com/name/nm0222596","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MTc5MTE1MF5BMl5BanBnXkFtZTYwODY1MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 October 1905","placeOfBirth":" Flagstaff, Arizona, USA","birthName":"Andrew Vabre Devine","height":"6' (1.83 m)","bio":"Rotund comic character actor of American films. Born Andrew Vabre Devine in Flagstaff, Arizona, the later-to-be Rotund comic character actor was raised in nearby Kingman, Arizona, the son of Irish-American hotel operator Thomas Devine and his wife Amy. Devine was an able athlete as a student and actually played semi-pro football under a phony name (Jeremiah Schwartz, often erroneously presumed to be his real name). Devine used the false name in order to remain eligible for college football. A successful football player at St. Mary & St. Benedict College, Arizona State Teacher's College, and Santa Clara University, Devine went to Hollywood with dreams of becoming an actor. After a number of small roles in silent films, he was given a good part in the talkie The Spirit of Notre Dame (1931) in part due to his fine record as a football player. His sound-film career seemed at risk due to his severely raspy voice, the result of a childhood injury. His voice, however, soon became his trademark, and he spent the next forty-five years becoming an increasingly popular and beloved comic figure in a wide variety of films. In the 1950s, his fame grew enormously with his co-starring role as Jingles opposite Guy Madison's Adventures of Wild Bill Hickok (1951), on television and radio simultaneously. In 1955, before the Hickok series ended, Devine took over the hosting job on a children's show retitled Andy's Gang (1955), in which he gained new fans among the very young. He continued active in films until his death in 1977. He was survived by his wife and two sons.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MTc5MTE1MF5BMl5BanBnXkFtZTYwODY1MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0222596","name":"Andy Devine","idIMDB":"nm0222596"},"actorId":"nm0222596","character":"Peter - Servant to Juliet's Nurse","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Conway Tearle","urlProfile":"http://www.imdb.com/name/nm0853604","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0OTYyNTM5NF5BMl5BanBnXkFtZTcwOTM4OTY1NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1878","placeOfBirth":" New York City, New York, USA","birthName":"Frederick Levy","height":"5' 10½\" (1.79 m)","bio":"This West Point-educated actor was a tall, dark and handsome American co-star who romanced some of the most illustrious femme stars ever to appear on the silent silver screen. Conway Tearle was born in New York City on May 17, 1878 to a family of entertainers. Christened Frederick Levy, his father, Jules, was a jazz musician, and mother Marianne Conway, an American actress. Divorced when Conway was quite young, his mother subsequently married British Shakespearean actor/theatre manager Osmond Tearle and Conway was raised in England from the age of 10. He gained experience on his stepfather's stage and was alternately billed as Frederick Levy and Frederick Conway before settling on the name Conway Tearle. Having returned to the U.S. in 1905, he made his Broadway debut with \"Abigail\" that same year and would make a name for himself as a reliable romancer for nearly a decade before attempting films in 1914. His two half brothers, Godfrey Tearle and Malcolm Tearle would also become actors on both the stage and screen. Conway's more famous films were deemed \"women's pictures\" where he appeared meticulously as a dashing hero or ardent lover. Among his more notable were Helene of the North (1915) opposite Marguerite Clark, The Foolish Virgin (1916) and The Common Law (1916) both starring Clara Kimball Young, Stella Maris (1918) with Mary Pickford, A Virtuous Vamp (1919) with Constance Talmadge, She Loves and Lies (1920) and The Eternal Flame (1922), both opposite Norma Talmadge, Lilies of the Field (1924) featuring Corinne Griffith, and Dancing Mothers (1926) starring Clara Bow. Conway made a smooth transition into sound pictures and remained a leading star or prime support in \"B\" level pictures. He ended his film career spurned by Mae West in Klondike Annie (1936) and with a lesser role in the lavish production Romeo and Juliet (1936) starring Norma Shearer and Leslie Howard. He died of a heart attack at age 60.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0OTYyNTM5NF5BMl5BanBnXkFtZTcwOTM4OTY1NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0853604","name":"Conway Tearle","idIMDB":"nm0853604"},"actorId":"nm0853604","character":"Escalus - Prince of Verona","urlCharacter":"http://www.imdb.com/character/ch0068055","main":true},{"actorName":"Ralph Forbes","urlProfile":"http://www.imdb.com/name/nm0285391","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzU5NTllNjYtODFhNi00YTNlLWIxNGItZjljYzk5NGU5OThjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1904","placeOfBirth":" London, England, UK","birthName":"Ralph Taylor","height":"6' (1.83 m)","bio":"Ralph Forbes had other ideas than the family wish for him to seek a career in law or the navy. He became interested in acting and began stage work in England. By 1917, he had come to the US to get his feet wet in the film medium with his first silent that year. But he returned to the UK to work in the early British film industry from 1921 to 1926. In the latter year, he joined fellow expatriate and A-list star Ronald Colman to play younger brother John in the first Hollywood rendering of Beau Geste (1926). Through the 1920s, he would work with some familiar names: Lon Chaney, Lillian Gish, Norma Shearer, and John Gilbert among many others in varied roles. His handsome features and bright blues eyes gave him an intense look that could well suit numerous young romantic gentleman characters. A rich, full voice to boot made the sound transition a smooth one. The unevenness and muffled nature of early sound movies was apparent in his first effort Lilies of the Field (1930) which was an early American-based effort by Alexander Korda. In that year of 1930 Forbes' six films prophesied a busy decade to come. In 1931, he did a sequel to Beau Geste which took up the continuing adventures of youngest Geste brother John, Beau Ideal (1931). By 1933, Forbes was much in demand with five or six movie roles a year through most of the decade. He made the costume rounds: including, the first sound The Three Musketeers (1935), Mary of Scotland (1936), and the classic George Cukor Romeo and Juliet (1936) in which he played Juliet's suitor Paris. With all that \"gesting\" under his belt. it was perhaps not surprising to find Forbes in the sand dunes again for The Legion of Missing Men (1937), where he played the lead in a \"gestique\"-sort of script with a younger brother coming to join him in the Legion -- some good finale action. It is, therefore, perhaps a bit of a surprise that he did not play John in the more famous remake of Beau Geste (1939) with Gary Cooper. But Ray Milland got the nod that time. Interestingly, this William A. Wellman directed version is almost a carbon copy of the 1926 effort. After 1940, his work was sporadic to the end of the decade. But he did some early TV playhouse productions in 1950 before his untimely passing the next year.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzU5NTllNjYtODFhNi00YTNlLWIxNGItZjljYzk5NGU5OThjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0285391","name":"Ralph Forbes","idIMDB":"nm0285391"},"actorId":"nm0285391","character":"Paris - Young Nobleman Kinsman to the Prince","urlCharacter":"http://www.imdb.com/character/ch0000664","main":true},{"actorName":"Henry Kolker","urlProfile":"http://www.imdb.com/name/nm0464137","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDRjMWYxYzItZDNmYS00MmVhLTljNzgtZGQwYzgwYTQ1ZjEzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1874","placeOfBirth":" Berlin, Germany","birthName":"Joseph Henry Kolker","height":"5' 10½\" (1.79 m)","bio":"Stalwart character actor Henry Kolker appeared on the Broadway stage from 1904, comedy being his forte early on. Later, as a leading man in romantic dramas, he partnered famous stars like Alla Nazimova. Moving on to films in 1914 as actor/director, he became noted in particular for directing Disraeli (1921), starring George Arliss (now a lost film, except for one reel). Plagued by ill-health and much publicised marital problems, Kolker's star had waned somewhat by the end of the silent era. However, he continued to remain in demand as a supporting actor, generally typecast as stern judges, priests, heavy fathers and cuckolded husbands. Usually scowling and sombre, he chided and glowered over stars like Melvyn Douglas, Gary Cooper and Katharine Hepburn (arguably his best role being the latter's father, Edward Seton, in Holiday (1938)). He was equally effective in the role of banker John Fair in The Crash (1932), and as Friar Laurence in George Cukor's Romeo and Juliet (1936). Kolker remained a prolific fixture on screen throughout the 1930's, managing to tally up in excess of twenty appearances each, for 1934 and 1935 alone.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDRjMWYxYzItZDNmYS00MmVhLTljNzgtZGQwYzgwYTQ1ZjEzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0464137","name":"Henry Kolker","idIMDB":"nm0464137"},"actorId":"nm0464137","character":"Friar Laurence","urlCharacter":"http://www.imdb.com/character/ch0038539","main":true},{"actorName":"Robert Warwick","urlProfile":"http://www.imdb.com/name/nm0913094","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGYwMWJlY2UtMjA4ZS00YzcwLWJlMzQtYjAwY2UzMzNmZDk1XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1878","placeOfBirth":" Sacramento, California, USA","birthName":"Robert Taylor Bien","height":"5' 11½\" (1.82 m)","bio":"A prominent matinée stage and silent-film star with handsome features offset only slightly by a prominent proboscis, Robert Warwick was born and raised in Sacramento, California, as Robert Taylor Bien. The gift of music was instilled at an early age (he sang in his church choir) and he initially prepared for an operatic career. Studying vocally in Paris, he abandoned legit singing for acting after being hired in 1903 to understudy in the Broadway play \"Glad of It\". He grew quickly in stature in such popular stage roles as \"Vronsky\" in \"Anna Karenina\" (1907), and was a strong presence in the musical operettas \"The Kiss Waltz\" (1911) and \"The Princess\" (1912), the latter featuring his first wife, actress Josephine Whittell. With effortless charm, Warwick segued into romantic film roles, playing dashing leads in Alias Jimmy Valentine (1915), The Face in the Moonlight (1915), The Heart of a Hero (1916)--in which he portrayed Revolutionary War hero Nathan Hale--The Mad Lover (1917) and A Girl's Folly (1917). At one point he even formed his own production company, Robert Warwick Film Corp. The company produced four films before Warwick temporarily left Hollywood in 1917 to serve in WWI as an infantry captain. In the 1920s he shifted between Broadway and film leads. His well-modulated voice proved ideal for sound pictures, and he subsequently enjoyed a long career (over 200 films) in grand, authoritative character parts. Among his plethora of movie roles were \"Neptune\" in Night Life of the Gods (1935), \"Col. Gray\" in Shirley Temple's The Little Colonel (1935), \"Sir Francis Knolly\" in Mary of Scotland (1936) and \"Lord Montague\" in the Norma Shearer/Leslie Howard starrer Romeo and Juliet (1936). He also was seen to fine advantage in several of Errol Flynn's rousing costumers such as The Prince and the Pauper (1937), The Adventures of Robin Hood (1938), The Private Lives of Elizabeth and Essex (1939), and The Sea Hawk (1940). A grand, stately gent, he was often seen impersonating high-ranking military officers, dapper businessmen or stern but benevolent father figure types. The legendary Preston Sturges utilized his services, giving him small roles in The Great McGinty (1940), Christmas in July (1940) and The Lady Eve (1941) before handing him a standout part as an avuncular studio mogul in Sullivan's Travels (1941). For the most part, however, Warwick was humbled into playing smaller, serviceable roles in adventures and crime dramas, with many of these characters embracing unyielding traditionalist values. Other exceptions to this rule were his hammy, downtrodden Hollywood actor \"Charlie Waterman\" in In a Lonely Place (1950) and his dying tycoon in While the City Sleeps (1956). Warwick continued performing well into his 80s. Primarily on TV in his twilight years, he could be spotted frequently on such programs as The Twilight Zone (1959), Maverick (1957) and Dr. Kildare (1961). Divorced from his first wife, he survived his second, actress Stella Lattimore (1905-1960), before dying in 1964 following an extended illness. He had one daughter by his first wife; Rosalind, who bore him two grandchildren, and with his second wife another daughter, Betsey, who was a prominent published poet in Los Angeles and was buried next to her father at Holy Cross Cemetary in Los Angeles in 2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGYwMWJlY2UtMjA4ZS00YzcwLWJlMzQtYjAwY2UzMzNmZDk1XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0913094","name":"Robert Warwick","idIMDB":"nm0913094"},"actorId":"nm0913094","character":"Lord Montague","urlCharacter":"http://www.imdb.com/character/ch0048752","main":true},{"actorName":"Virginia Hammond","urlProfile":"http://www.imdb.com/name/nm0358792","urlPhoto":"","biography":{"dateOfBirth":"20 August 1893","placeOfBirth":" Staunton, Virginia, USA","bio":"Virginia Hammond was born on August 20, 1893 in Staunton, Virginia, USA. She was an actress, known for Romeo and Juliet (1936), Miss Crusoe (1919) and The Discard (1916). She was married to Edward Earl Grady. She died on April 6, 1972 in Washington, District of Columbia, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0358792","name":"Virginia Hammond","idIMDB":"nm0358792"},"actorId":"nm0358792","character":"Lady Montague - Wife to Montague","urlCharacter":"http://www.imdb.com/character/ch0048753","main":true},{"actorName":"Reginald Denny","urlProfile":"http://www.imdb.com/name/nm0219666","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMTg0OTY2OV5BMl5BanBnXkFtZTYwOTUxNTU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 November 1891","placeOfBirth":" Richmond, Surrey, England, UK","birthName":"Reginald Leigh Dugmore","height":"6' (1.83 m)","bio":"Sometime in the early 1930s, Denny was between scenes on a movie set when he met a neighborhood boy who was trying to fly a bulky gas-powered model plane. When he tried to help by making an adjustment on the machine, Denny succeeded only in wrecking it. But this launched his infatuation with model aviation, and his new hobby grew into Reginald Denny Industries, maker of model plane kits. When the U.S. Army began hunting for a better and safer way to train anti-aircraft gunners than using targets towed by piloted planes, Denny and his associates Walter Righter and Paul Whittier began work on a radio-controlled target drone, and their third prototype won them an Army contract. Radioplane was formed in 1940, and during WWII produced nearly 15,000 target drones (the RP-5A) for the Army. Radioplane was later purchased by Northrop in 1952.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMTg0OTY2OV5BMl5BanBnXkFtZTYwOTUxNTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0219666","name":"Reginald Denny","idIMDB":"nm0219666"},"actorId":"nm0219666","character":"Benvolio - Nephew to Montgue and Friend to Romeo","urlCharacter":"http://www.imdb.com/character/ch0000579","main":true},{"actorName":"Violet Kemble Cooper","urlProfile":"http://www.imdb.com/name/nm0178439","urlPhoto":"","biography":{"dateOfBirth":"12 December 1886","placeOfBirth":" London, England, UK","bio":"Violet Kemble Cooper was born on December 12, 1886 in London, England. She was an actress and writer, known for The Invisible Ray (1936), David Copperfield (1935) and Our Betters (1933). She was married to Walter Ferris. She died on August 17, 1961 in Hollywood, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0178439","name":"Violet Kemble Cooper","idIMDB":"nm0178439"},"actorId":"nm0178439","character":"Lady Capulet - Wife to Capulet","urlCharacter":"http://www.imdb.com/character/ch0000587","main":true}],"seasons":[],"idIMDB":"tt0028203","urlIMDB":"http://www.imdb.com/title/tt0028203","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"15","month":"04","year":"1936","remarks":null},"filmingDates":null,"copyrightHolder":"Metro-Goldwyn-Mayer Corporation; 3 September 1936; LP6642 (in copyright registry)"},"technical":{"runtime":["2 hr 5 min (125 min)"],"soundMix":["Mono (Western Electric Sound System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["(14 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.7","filmingLocations":[{"location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA"}],"rated":"PASSED","awards":[{"award":"Academy Awards, USA 1937","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Picture","names":[]},{"category":"Best Actress in a Leading Role","names":[{"name":"Norma Shearer","id":"nm0790454","role":null}]},{"category":"Best Actor in a Supporting Role","names":[{"name":"Basil Rathbone","id":"nm0001651","role":null}]},{"category":"Best Art Direction","names":[{"name":"Cedric Gibbons","id":"nm0316539","role":null},{"name":"Fredric Hope","id":"nm0393978","role":null},{"name":"Edwin B. Willis","id":"nm0932320","role":null}]}]}]},{"award":"National Board of Review, USA 1936","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Top Ten Films","names":[]}]}]},{"award":"New York Film Critics Circle Awards 1937","titlesAwards":[{"titleAwardOutcome":"3rd place NYFCC Award","categories":[{"category":"Best Actress","names":[{"name":"Norma Shearer","id":"nm0790454","role":null}]}]}]}],"votes":"1,319","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"}],"keywords":{"keywords":["marry","banished","friar","prince","nephew","tragedy","feud","knife","epilogue","prologue","an eye for an eye","slain","guilt","fortune's fool","mortal wound","faithful to play","triumph","murderer","weeping","bravado","bravery","houses","rope ladder","grave","surgeon","scratch","love for cousin","confession","knave","fan","slip","entertainer","mother","verse","poet","talker","jealousy","tumbilng","youth","retribution","gentleman","mourning","sorrow","parting","message","morning","choreographed dance","hate and love","nightingale","contagion","vow","drunk","sing","lark","delay","shroud","letter","poem","challenge to a duel","scaling a wall","sentry","lips","punished","wife","husband","friar's cell","revelry","foe","rose","name","lady of the house","church","market","climbing","kiss","dagger","mausoleum","sin","cast out","fickle man","betrothal","only daughter","only son","renaissance music","boys' choir","balcony scene","kinsman","touching palms","love at first sight","daughter defies father","impending marriage","rival","costume","group dance","challenge","pilgrim","visor","entertainment","sale","only child","lust","young couple in love","party crashing","flute","bow and arrow","dance","feast","consent","county","marriage","bawd","nanny ward relationship","nanny","masque","mask","masquerade ball","party crasher","child","suitor","threat of death","peace","apothecary","feigned death","death by sword","invitation","sword and shield","messenger","duke","cousin cousin relationship","secret wedding","servant","provocation","bite your thumb","spit","feuding families","trumpet fanfare","town square","canopy","banner","tapestry","drums","verona","processional","all star cast","shakespeare adaptation","verona italy","tragic event","shakespeare play","reference to william shakespeare","adult actress playing teenage girl","sad ending","sword fight","ends with funeral","death of hero","tragic hero","tragic heroine","main character dies","main characters killed off","husband wife relationship","funeral","sword duel","revenge","rapier","sword","swordsman","swashbuckler","opening action scene","stick fight","staff","club","brawl","street fight","riot","mob","potion","nursemaid","exile","ball","arranged marriage","grief","friendship","balcony","middle ages","tomb","plague","clergy","adolescence","secret marriage","mother son relationship","mother daughter relationship","father son relationship","father daughter relationship","family relationships","tragic love","teenager","star crossed lovers","passion","obsessive love","melancholy","intimacy","forbidden love","family feud","death","suicide","murder","shakespeare's romeo and juliet","duel","banishment","nobility","poisoning","death of friend","based on play","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:57:36"}}