{"data":{"movies":[{"title":"A View to a Kill","originalTitle":"","year":"1985","releaseDate":"19850524","directors":[{"name":"John Glen","id":"nm0322515"}],"writers":[{"name":"Richard Maibaum","id":"nm0537363"},{"name":"Michael G. Wilson","id":"nm0933865"}],"runtime":"131 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMTYzOTIwM15BMl5BanBnXkFtZTcwODY5MDg0NA@@._V1.jpg","countries":["UK"],"languages":["English"],"genres":["Action","Adventure","Thriller"],"plot":"James Bond has one more mission. Bond returns from his travels in the USSR with a computer chip. This chip is capable of withstanding a nuclear electromagnetic pulse that would otherwise destroy a normal chip. The chip was created by Zorin Industries, and Bond heads off to investigate its owner, Max Zorin. Zorin may only seem like a innocent guilty man, but is really planning to set off an earthquake in San Andreas which will wipe out all of Silicon Valley. As well as Zorin, Bond must also tackle May Day and equally menacing companion of Zorin, whilst dragging Stacy Sutton along for the ride.","simplePlot":"An investigation of a horse-racing scam leads 007 to a mad industrialist who plans to create a worldwide microchip monopoly by destroying California's Silicon Valley.","actors":[{"actorName":"Roger Moore","urlProfile":"http://www.imdb.com/name/nm0000549","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3Njg5MDkxNl5BMl5BanBnXkFtZTYwNjczMzU0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 October 1927","placeOfBirth":" Stockwell, London, England, UK","birthName":"Roger George Moore","height":"6' 1\" (1.85 m)","bio":"Roger Moore will perhaps always be remembered as the man who replaced Sean Connery in the James Bond series, arguably something he never lived down. Roger George Moore was born on October 14, 1927 in Stockwell, London, England, the son of Lillian (Pope) and George Alfred Moore, a policeman. He first wanted to be an artist, but got into films full time after becoming an extra in the late 1940s. Moore also served in the British military during the Second World War. He came to the United States in 1953. Suave, extremely handsome, and an excellent actor, he received a contract with Metro-Goldwyn-Mayer. His initial foray met with mixed success, with movies like Diane (1956) and Interrupted Melody (1955), as well as The Last Time I Saw Paris (1954). Moore went into television in the 1950s on series such as Ivanhoe (1958) and The Alaskans (1959), but probably received the most recognition from Maverick (1957), as cousin Beau. He received his big breakthrough, at least internationally, as The Saint (1962). The series made him a superstar and he became very successful thereafter. Moore ended his run as the Saint, and was one of the premier stars of the world, but he was not catching on in America. In an attempt to change this, he agreed to star with Tony Curtis on ITC's The Persuaders! (1971), but although hugely popular in Europe, it did not catch on in the United States and was canceled. Just prior to making the series, he starred in The Man Who Haunted Himself (1970), which proved there was far more to Moore than the light-hearted roles he had previously accepted. He was next offered and accepted the role of James Bond, and once audiences got used to the change of style from Connery's portrayal, they also accepted him. Live and Let Die (1973), his first Bond movie, grossed more outside of America than Diamonds Are Forever (1971); Connery's last outing as James Bond. He went on to star in another six Bond films, before bowing out after A View to a Kill (1985). He was age 57 at the time the film was made and was looking a little too old for Bond - it was possibly one film too many. In between times, there had been more success with appearances in films such as That Lucky Touch (1975), Shout at the Devil (1976), The Wild Geese (1978), Escape to Athena (1979) and ffolkes (1980). Despite his fame from the Bond films and many others, the United States never completely took to him until he starred in The Cannonball Run (1981) alongside Burt Reynolds, a success there. After relinquishing his role as Bond, his work load tended to diminish a little, though he did star in the American box office flop Fire, Ice & Dynamite (1990), as well as the comedy Bullseye! (1990), with Michael Caine. He did the overlooked comedy Bed & Breakfast (1991), as well as the television movie The Man Who Wouldn't Die (1994), and then the major Jean-Claude Van Damme flop The Quest (1996). Moore then took second rate roles such as Spice World (1997), and the American television series The Dream Team (1999). Although his film work may have slowed down, he is still very much in the public eye, be it appearing on television chat shows or hosting documentaries. Roger Moore was appointed Commander of the Order of the British Empire on December 31, 1998 in the New Years Honours for services to UNICEF, and was promoted to Knight Commander of the same order on June 14, 2003 in the Queen's Birthday Honours for services to the charities UNICEF and Kiwanis International.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3Njg5MDkxNl5BMl5BanBnXkFtZTYwNjczMzU0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000549","name":"Roger Moore","idIMDB":"nm0000549"},"actorId":"nm0000549","character":"James Bond","urlCharacter":"http://www.imdb.com/character/ch0000007","main":true},{"actorName":"Christopher Walken","urlProfile":"http://www.imdb.com/name/nm0000686","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4ODUyNDQ2NV5BMl5BanBnXkFtZTYwODk2MTYz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1943","placeOfBirth":" Astoria, Queens, New York City, New York, USA","birthName":"Ronald Walken","height":"6' (1.83 m)","bio":"Nervous-looking lead and supporting actor of the American stage and films, with sandy colored hair, pale complexion and a somewhat nervous disposition. He won an Oscar as Best Supporting Actor for his performance in The Deer Hunter (1978), and has been seen in mostly supporting roles, often portraying psychologically unstable characters, though that generalization would not do justice to Walken's depth and breadth of performances. Walken was born in Astoria, Queens, to Rosalie (Russell), a Scottish immigrant, and Paul Walken, a German immigrant who ran Walken's Bakery. He learnt his stage craft, including dancing, at Hofstra University & ANTA, and picked up a Theatre World award for his performance in the revival of the Tennessee Williams play \"The Rose Tattoo\". Walken then first broke through into cinema in 1969 appearing in Me and My Brother (1969), before appearing alongside Sean Connery in the sleeper heist movie The Anderson Tapes (1971). His eclectic work really came to the attention of critics in 1977 with his intense portrayal of Diane Keaton suicidal younger brother in Annie Hall (1977), and then he scooped the Best Supporting Actor Academy Award in 1977 for his role as Nick in the electrifying The Deer Hunter (1978). Walken was lured back by The Deer Hunter (1978) director Michael Cimino for a role in the financially disastrous western Heaven's Gate (1980), before moving onto surprise audiences with his wonderful dance skills in Pennies from Heaven (1981), taking the lead as a school teacher with telepathic abilities in the Stephen King inspired The Dead Zone (1983) and then as billionaire industrialist Max Zorin trying to blow up Silicon Valley in the 007 adventure A View to a Kill (1985). Looking at many of Walken's other captivating screen roles, it is easy to see the diversity of his range and even his droll comedic talents with humorous appearances in Biloxi Blues (1988), Wayne's World 2 (1993), Joe Dirt (2001), Mousehunt (1997) and America's Sweethearts (2001). Most recently, he continued to surprise audiences again with his work as a heart broken and apologetic father to Leonardo DiCaprio in Catch Me If You Can (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4ODUyNDQ2NV5BMl5BanBnXkFtZTYwODk2MTYz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000686","name":"Christopher Walken","nicknames":["Chris","Ronnie"],"idIMDB":"nm0000686"},"actorId":"nm0000686","character":"Max Zorin","urlCharacter":"http://www.imdb.com/character/ch0000274","main":true},{"actorName":"Tanya Roberts","urlProfile":"http://www.imdb.com/name/nm0000617","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MTE4Mjg0NF5BMl5BanBnXkFtZTYwMDc1OTQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1955","placeOfBirth":" The Bronx, New York City, New York, USA","birthName":"Victoria Leigh Blum","height":"5' 7¼\" (1.71 m)","bio":"Tanya Roberts came from modest beginnings in the Bronx, New York, the daughter of a pen salesman (Irish) and a mother (Jewish) who were divorced before she reached high school. Tanya dropped out of high school at age 15, got married and hitchhiked around the country until her mother-in-law had the marriage annulled. She met psychology student Barry Roberts in New York while waiting in line to see a movie. A few months later, she proposed to him in a subway station, and they were married. She studied acting under Lee Strasberg and Uta Hagen. In her early years in New York, she supported herself as an Arthur Murray dance instructor and by modeling. She appeared in off-Broadway productions of \"Picnic\" and \"Antigone\", and in television commercials for Ultra Brite, Clairol and Cool Ray sunglasses. In 1977, Tanya and her husband--now a scriptwriter--moved to Hollywood. She began appearing in such made-for-TV films as Pleasure Cove (1979), Zuma Beach (1978) and Waikiki (1980). Her film debut was in Forced Entry (1975). After appearing in several minor films, her first big break came when she was selected as an angel (the last) for Charlie's Angels (1976) in its final season, and was featured on the cover of \"People\" magazine (2/9/81). The attention she garnered as the newest Charlie's Angel helped secure her most significant film parts: The Beastmaster (1982) (and posed for the cover and an inside spread in \"Playboy\" to promote the film), the title role in Sheena (1984) and as a Bond Girl in A View to a Kill (1985). She continues to appear in films, though mainly direct-to-video and direct-to-cable features. She is featured in the CD computer game The Pandora Directive (1996) and had a recurring lead role in the television series That '70s Show (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MTE4Mjg0NF5BMl5BanBnXkFtZTYwMDc1OTQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000617","name":"Tanya Roberts","idIMDB":"nm0000617"},"actorId":"nm0000617","character":"Stacey Sutton","urlCharacter":"http://www.imdb.com/character/ch0000310","main":true},{"actorName":"Grace Jones","urlProfile":"http://www.imdb.com/name/nm0005063","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4Njc1ODc2NV5BMl5BanBnXkFtZTYwNjc1MDU1._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 May 1948","placeOfBirth":" Spanish Town, Jamaica","birthName":"Beverly Grace Jones","height":"5' 8\" (1.73 m)","bio":"Grammy-nominee and three-time Saturn Award-nominee, Grace Jones can claim a career in show business by birthright. Her grandfather (on her mother's side) was a musician who traveled with Nat 'King' Cole. She was born May 19, 1948 in Spanish Town, St Catherine - Jamaica, to Marjorie Jones (née Williams) and Reverend Robert W. Jones. Though she was born in Jamaica, Grace was raised in Syracuse, New York, where she later studied Spanish at Syracuse University. Halfway through college, she was approached by a drama professor who proposed that she come work with him in a play he was putting on in Philadelphia, she accepted. She was 18 when she moved back to New York, and signed on as a model with Wilhelmina Modeling agency. But, since her looks were not successfully received, she moved to Paris, France, where her androgynous, bold, dark-skinned appearance fostered her potential. She modeled for Yves Saint-Laurent, Claude Montana, Kenzo Takada, Helmut Newton, Guy Bourdin, Hans Feurer and Azzedine Alaïa, and she appeared on the covers of \"Elle\", \"Vogue\", and \"Der Stern\". While modeling, she found herself acting, playing minor parts in film. Her debut film appearance was in Gordon's War (1973), she played the role of Mary, a drug smuggler. Grace started to work prolifically in the 1980s and became a successful American actress with her roles of Zula the amazonian in Conan the Destroyer (1984), and May Day in the 14th James Bond film A View to a Kill (1985). Other notable roles include: Katrina, the Egyptian queen vampire in Vamp (1986), Helen Strangé, the forceful and sex hungry model in the Eddie Murphy film, Boomerang (1992), and Christoph/Christine, an intersexed circus performer in the made-for-television film, Wolf Girl (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4Njc1ODc2NV5BMl5BanBnXkFtZTYwNjc1MDU1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005063","name":"Grace Jones","nicknames":["The Queen of Gay Discos"],"idIMDB":"nm0005063"},"actorId":"nm0005063","character":"May Day","urlCharacter":"http://www.imdb.com/character/ch0000321","main":true},{"actorName":"Patrick Macnee","urlProfile":"http://www.imdb.com/name/nm0001495","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxOTQ0MzEwNl5BMl5BanBnXkFtZTgwMDk4NDgwNjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 February 1922","placeOfBirth":" Paddington, London, England, UK","birthName":"Daniel Patrick Macnee","height":"6' 1\" (1.85 m)","bio":"British actor Patrick Macnee was born on February 6, 1922 in London, England into a wealthy and eccentric family. His father, Daniel Macnee, was a race horse trainer, who drank and gambled away the family fortune, leaving young Patrick to be raised by his gay mother, Dorothea Mary, and her lover. Shortly after graduating from Eton (from which he was almost expelled for running a gambling ring), Macnee first appeared on stage and made his film debut as an extra in Pygmalion (1938). His career was interrupted by World War II, during which he served in the Royal Navy. After military service, Macnee attended the Webber Douglas School of Dramatic Art in London on scholarship. He also resumed his stage and film career, with bit parts such as Young Jacob Marley in A Christmas Carol (1951). Disappointed with his limited roles, Macnee left England for Canada and the United States. In 1954, he went to Broadway with an Old Vic troupe and later moved on to Hollywood, where he made occasional television and film appearances until returning to England in 1959. Once back home, he took advantage of his producing experience in Canada to become coproducer of the British television series Winston Churchill: The Valiant Years (1960). Shortly thereafter, Macnee landed the role that brought him worldwide fame and popularity in the part of John Steed, in the classic British television series The Avengers (1961). His close identification with this character limited his career choices after the cancellation of the series in 1969, prompting him to reprise the role in Chapeau melon et bottes de cuir (1976), which, though popular, failed to recapture the magic of the original series. During the 1980s and 1990s, Macnee became a familiar face on American television in such series as Gavilan (1982), Empire (1984), Thunder in Paradise (1994) and NightMan (1997). In the past decade, Macnee has also made several audio recordings of book fiction.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxOTQ0MzEwNl5BMl5BanBnXkFtZTgwMDk4NDgwNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001495","name":"Patrick Macnee","nicknames":["Patty Nee","Pat"],"idIMDB":"nm0001495"},"actorId":"nm0001495","character":"Sir Godfrey Tibbett","urlCharacter":"http://www.imdb.com/character/ch0000361","main":true},{"actorName":"Patrick Bauchau","urlProfile":"http://www.imdb.com/name/nm0000872","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1MDM4MjczNl5BMl5BanBnXkFtZTgwMTAxNzQ4MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 December 1938","placeOfBirth":" Brussels, Belgium","birthName":"Patrick Nicolas Jean Sixte Ghislain Bauchau","height":"6' 3\" (1.91 m)","bio":"Patrick Nicolas Jean Sixte Ghislain Bauchau was born in Brussels, Belgium. His father, Henry Bauchau, is a noted author, psychoanalyst, and philosopher, while his mother was an educator who also helped operate a publishing company. Coming from an intellectual family, it's not surprising that Bauchau won an academic scholarship to Oxford University, where he received a degree in Modern Languages. In the early '60s, Bauchau became interested in film, and worked with French filmmaker Eric Rohmer; this led to Bauchau being cast in the leading role as Adrien in Rohmer's 1967 \"moral tale,\" La Collectionneuse. Bauchau and his fellow leading actors Haydee Politoff and Daniel Pommereulle were also credited with the film's dialogue. While this got Bauchau's acting career off to an impressive start, his naturalistic performance left many believing that Bauchau was simply playing himself. After \"Tuset Street\" (also released in 1967), Bauchau temporarily moved away from acting and worked with Salvador Dali constructing large pillow-like animal sculptures. In 1980, Bauchau re-launched his film career in Robert Kramer's \"Guns\", and in 1982, Wim Wenders cast him in the leading role of \"The State Of Things\". In 1984, Bauchau made his American film debut in Alan Rudolph's eccentric, romantic comedy \"Choose Me\", and through much of the rest of the decade he worked regularly on both sides of the Atlantic. In 1991, Bauchau scored an impressive role in Michael Tolkin's superb drama \"The Rapture\", and four years later the same director gave him a meaty role in \"The New Age\". Bauchau plays the villain the Bond flick, \"A View to a Kill\" and has starring roles in Entre Nous and The Music Teacher, both nominated for the Academy Award for Best Foreign Film In 1996. Bauchau was cast in the television series \"Kindred: The Embraced\" as a patriarch of the living dead; while the series lasted only a few weeks, it did lead to the series regular role of Sydney in \"The Pretender\", which debuted the same year and ran for four seasons on NBC. Bauchau's higher profile in television helped him win notable roles in high-profile films such as \"Clear and Present Danger\", \"The Cell\", \"Ray\" and \"Panic Room\". Bauchau also plays notable roles in the independent features \"The Five Obstructions\", \"Twin Falls Idaho\", \"The Secretary\", \"Boy Culture\" and \"The Gray Man\" among several others. Bauchau is a series regular playing the blind seer Lodz on the HBO hit show \"Carnivale\" and recurs in NBC's \"Revelation\" and ABC's \"Alias\". He guest stars on numerous television shows including \"Castle\", \"CSI\", \"How to Make It In America\", \"Numbers\", \"Women's Murder Club\", \"House\", \"Dead Zone\" and \"24\" among many others. More recently in Europe Bauchau finished shooting the feature films \"Ladrones\" in Spain, \"Suzanne\" (France), \"Glenn\" (Belgium), \"Chrysalis\" (Italy) and Michel Houellebecq's \"Possibility Of an Island\" also filmed in Spain. Bauchau currently stars in the hit French TV series\" Mystere\". More recently in the USA Bauchau appears in Roland Emmerich's \"2012\", the Polish Brothers film \"The Sweet Smell Of Success\" and \"Extraordinary Measures\" with Harrison Ford. He recently returned from filming in Vera Cruz, Mexico on \"How I Spent My Summer Vacation\" with Mel Gibson. Bauchau speaks at least 6 languages fluently and has acted in films in different languages throughout the world. He holds passports in 3 countries including the USA. When not busy with acting, Bauchau lives in a small village outside Paris, and, in Malibu Lake, California, where he is an avid gardener, reader and art collector. He's married to Mijanou Bardot, Brigitte's sister, who also appears in La Collectionneuse. They have 5 dogs, and an adult daughter that lives in Rome.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM1MDM4MjczNl5BMl5BanBnXkFtZTgwMTAxNzQ4MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000872","name":"Patrick Bauchau","idIMDB":"nm0000872"},"actorId":"nm0000872","character":"Scarpine","urlCharacter":"http://www.imdb.com/character/ch0000339","main":true},{"actorName":"David Yip","urlProfile":"http://www.imdb.com/name/nm0948118","urlPhoto":"","biography":{"dateOfBirth":"4 June 1951","placeOfBirth":" Liverpool, England, UK","birthName":"David Nicholas Yip","bio":"Born in Liverpool, one of eight children. David's father was a Chinese seaman from the Canton area of southern China, and his mother was from Liverpool. He trained at E15 Acting School, London in 1973 and since then worked in Film, Television, Theatre, Radio and other voice work both in the UK and internationally. David still visits and works there regularly, but lives with his wife in North Oxfordshire, UK.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0948118","name":"David Yip","idIMDB":"nm0948118"},"actorId":"nm0948118","character":"Chuck Lee","urlCharacter":"http://www.imdb.com/character/ch0112123","main":true},{"actorName":"Fiona Fullerton","urlProfile":"http://www.imdb.com/name/nm0298386","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmQ5MzE5N2ItY2VjNS00NTNjLTkzMmUtMzA3NmNhOGVjMDIzXkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1956","placeOfBirth":" Kaduna, Nigeria","bio":"The only child of Bernard and Pamela Fullerton, she was born in Kaduna, Nigeria on 10th October 1956. As a child she wanted to be a ballet dancer and at the age of 11 enrolled at the Elmhurst Ballet School in Surrey where she was spotted and signed to appear in the film 'Run Wild, Run Free' in 1969. This was followed by 'Nicholas and Alexandra' and in 1972 the title role in 'Alice's Adventures in Wonderland' which was her big break. In 1975 was one of the original leads in the BBC television hospital drama series 'Angels'. The following year she married the actor Simon MacCorkindale, divorcing him in 1981. Her career seems to have gone quiet for a while until in 1985 she became a Bond Girl playing Pola Ivanova in 'A View To A Kill' then moved on to be one of the women involved with Nigel Havers in the mini series 'The Charmer'. As her career was progressing she met Neil Shakell, an old family friend again, fell in love and married in 1994 becoming step mother to Neil's son James. A year later she gave birth to Lucy. In 1996 answering a knock on her door she found herself facing a gunman and later discovered that the only reason he didn't shoot her was because she had her baby in her arms. Having already become disillusioned with her career the incident made her want to escape the limelight. She started buying, renovating and selling houses and found herself so successful at it that she now owns a company looking after property and an interior design consultancy. Having written a property advice column for two national newspapers for 10 years it encouraged her to write 3 property focused books. In addition to her film and television work she played two well known women on stage - Guinevere in Camelot opposite Richard Harris and Eliza Dolittle in Pygmalion","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMmQ5MzE5N2ItY2VjNS00NTNjLTkzMmUtMzA3NmNhOGVjMDIzXkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0298386","name":"Fiona Fullerton","nicknames":["Princess Fiona"],"idIMDB":"nm0298386"},"actorId":"nm0298386","character":"Pola Ivanova","urlCharacter":"http://www.imdb.com/character/ch0000400","main":true},{"actorName":"Manning Redwood","urlProfile":"http://www.imdb.com/name/nm0715197","urlPhoto":"","biography":{"dateOfBirth":"16 February 1929","placeOfBirth":" New York City, New York, USA","height":"6' (1.83 m)","bio":"Lived in Harley street in London with his wife Kay, In 1986 they both moved to Fincham in Norfolk where they lived for many years, enjoying the quiet life. In 2004 after both their healths deteriorated, they moved to a nursing home in Surrey to be near the family. Sadly after a long illness Manning passed away at east Surrey hospital on 9th of July 2006. Cause of death, acute myocardial Infarction.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0715197","name":"Manning Redwood","nicknames":["Manny"],"idIMDB":"nm0715197"},"actorId":"nm0715197","character":"Bob Conley","urlCharacter":"http://www.imdb.com/character/ch0000465","main":true},{"actorName":"Alison Doody","urlProfile":"http://www.imdb.com/name/nm0233145","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NjI5MTExM15BMl5BanBnXkFtZTcwMjUxNDczMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 November 1966","placeOfBirth":" Dublin, Ireland","height":"5' 9\" (1.75 m)","bio":"Alison Doody was born in Dublin in 1966, in a well-off family. She is the youngest of three children. She was educated in a convent, where she gained a passion for the arts. She later studied at the National College of Fine Arts in Dublin, but left because she lacked the motivation and thought she would take a year off to think it out. Meanwhile, while sitting in a café with friends, she was approached by a still photographer who asked her if she would be interested to model. Thinking she could use the pocket money, she said yes. Modeling proved to be both fun and lucrative, and very soon she did it professionally. Her modeling contracts led to commercial work, which would take her around the world. One day, a casting director saw her work and suggested she try acting instead. She was sent to London at age 19, where she quickly won an audition to appear in the new James Bond film, A View to a Kill (1985). She so loved acting that she pursued a career in that direction. After her first film, she shot a few TV dramas in London and in Dublin, but her big break came when she was cast as Aryan seductress Dr. Elsa Schneider in Indiana Jones and the Last Crusade (1989). Apparently she made a huge impression on Steven Spielberg and George Lucas, who loved her great sense of humor and her Grace Kelly looks. After Indiana Jones, which introduced her to Hollywood and to the United States, she was chosen to replace Cybill Shepherd as spokeswoman for L'Oréal. After that she shot a few B-movies in the United States, but at one point felt she missed Ireland too much, so she went back to Dublin. In 1994, she put her career on hold to spend more time with media heir Gavin O'Reilly, whom she had been dating for two years. In 1996 they married, and later had two children. In 2002, she was asked to cameo in the 'Michael Caine (I)_ comedy The Actors (2003), and there she regained a lust for the movie industry. The following summer, she shot Allan Quatermain et la pierre des ancêtres (2004) with co-star Patrick Swayze, and it's then that the whole ball started rolling again. In 2005, she and her husband divorced and she decided to re-launch her stalled career, but she quickly realized how difficult it was to break into this kind of business for a second time, especially after ten years away from the camera. Recently she appeared in the short film Benjamin's Struggle (2005), directed by newcomer Jamie Breese, and played a role in the well-known British series Waking the Dead (2000). In a recent interview, she said she was thrilled to be acting again, but added that she wasn't willing to accept anything for the sake of working. She is determined to find the right part, but she also wants to do different things: \"I'm fed up playing the nasty Nazi. I'd like to do something quite extreme.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NjI5MTExM15BMl5BanBnXkFtZTcwMjUxNDczMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0233145","name":"Alison Doody","idIMDB":"nm0233145"},"actorId":"nm0233145","character":"Jenny Flex","urlCharacter":"http://www.imdb.com/character/ch0000320","main":true},{"actorName":"Willoughby Gray","urlProfile":"http://www.imdb.com/name/nm0337016","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MjkzMTg2NF5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR9,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1916","placeOfBirth":" London, England, UK","birthName":"John Willoughby Gray","bio":"Willoughby Gray was born on November 5, 1916 in London, England as John Willoughby Gray. He is known for his work on The Princess Bride (1987), A View to a Kill (1985) and The Hit (1984). He was married to Felicity Gray. He died on February 13, 1993 in Salisbury, Wiltshire, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2MjkzMTg2NF5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0337016","name":"Willoughby Gray","idIMDB":"nm0337016"},"actorId":"nm0337016","character":"Dr. Carl Mortner","urlCharacter":"http://www.imdb.com/character/ch0115103","main":true},{"actorName":"Desmond Llewelyn","urlProfile":"http://www.imdb.com/name/nm0005155","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2Njk1OTkwNV5BMl5BanBnXkFtZTcwNzg4OTgwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1914","placeOfBirth":" Newport, Wales, UK","birthName":"Desmond Wilkinson Llewelyn","height":"6' 2\" (1.88 m)","bio":"Desmond Llewelyn was born in South Wales in 1914, the son of a coal mining engineer. In high school, he worked as a stagehand in the school's productions and then picked up sporadic small parts. His family would not give up their effort to prevent him from a life on stage, so an uncle who was a high ranking police officer arranged for Llewelyn to take the department's physical exam. \"Thank God, I flunked the eye test, and they wouldn't take me. I suspect the inspector had a hangover because he also failed this other chap I knew, who went out the same day and passed the physical for the Royal Navy, which had a lot tougher test.\" After failing the police exam, Llewelyn thought about becoming a minister, realizing after a week-long retreat of quiet and meditation that the ministry \"was definitely not for me.\" Llewelyn persevered in his acting quest, and was accepted to the Royal Academy for the Dramatic Arts in the mid 1930s. The outbreak of World War II in September 1939, halted his acting career, and Llewelyn was commissioned as a second lieutenant in the British army. He was assigned to the Royal Welsh Fusiliers and was sent to France in early 1940. In a short time, his regiment was fighting the Germans, and Llewelyn's company was holding off a division of German tanks. Llewelyn explained that \"eventually, the tanks broke through and many of us jumped into this canal and started swimming down it to the other side, figuring that our chaps were still over there. But the Germans were the only ones there,\" and Llewelyn was captured, and held as a prisoner of war for five years. At one prison camp, the prisoners had dug a tunnel and were planning to escape the next morning. Llewelyn was down in the tunnel doing some maintenance work in preparation of the escape when the Germans found out about the tunnel and caught him down in it, a crime that earned Llewelyn 10 days in solitary, which Llewelyn called \"a blessing of sorts. After spending every day of several years sleeping in a room with 50 other people, the quiet and privacy was rather nice.\" After the war, Llewelyn returned to London and revived his career, eventually being cast as his trademark Q in From Russia with Love (1963). Since 1963, Llewelyn has appeared as Q in every Eon Productions Bond film, except Live and Let Die (1973). Llewelyn was omitted from Live and Let Die (1973) because producers Harry Saltzman and Albert R. Broccoli felt that too much was being made of the gadgets and they would play it down. Llewelyn said he \"was quite disappointed\" at being left out of Live and Let Die (1973). Fans, however, missed Q, and Llewelyn got a call shortly after the release of Live and Let Die (1973) telling him that he would be in the next Bond film, The Man with the Golden Gun (1974). Llewelyn, who admits that his mechanical abilities in real life are virtually nil, is geared up for the next Bond movie. \"I'd love to be in the next one,\" Llewelyn said. \"Of course, if you consider my age, they should have put me out to grass a long time ago.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2Njk1OTkwNV5BMl5BanBnXkFtZTcwNzg4OTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005155","name":"Desmond Llewelyn","idIMDB":"nm0005155"},"actorId":"nm0005155","character":"Q","urlCharacter":"http://www.imdb.com/character/ch0000297","main":true},{"actorName":"Robert Brown","urlProfile":"http://www.imdb.com/name/nm0114533","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTUxMzE0MF5BMl5BanBnXkFtZTcwOTU5OTgwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1921","placeOfBirth":" Swanage, Dorset, England, UK","birthName":"Robert James Brown","height":"5' 11\" (1.81 m)","bio":"Robert Brown was born on July 23, 1921 in Swanage, Dorset, England as Robert James Brown. He was an actor, known for The Living Daylights (1987), Octopussy (1983) and A View to a Kill (1985). He was married to Rita Becker. He died on November 11, 2003 in Swanage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTUxMzE0MF5BMl5BanBnXkFtZTcwOTU5OTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0114533","name":"Robert Brown","idIMDB":"nm0114533"},"actorId":"nm0114533","character":"M","urlCharacter":"http://www.imdb.com/character/ch0000295","main":true},{"actorName":"Lois Maxwell","urlProfile":"http://www.imdb.com/name/nm0561755","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMTM3MTQyNF5BMl5BanBnXkFtZTYwOTQ4NjU2._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1927","placeOfBirth":" Kitchener, Ontario, Canada","birthName":"Lois Ruth Hooker","height":"5' 8\" (1.73 m)","bio":"Everyone knows (or should know) Lois Maxwell as the one and only \"Miss Moneypenny\", but there's much more to her acting career than that. She started out against her parents' will, and without their knowledge, in a Canadian children's radio program, credited as \"Robin Wells\". Before the age of 15 she left for England with the Canadian army's Entertainment Corps and managed (after her age had been discovered) to get herself enrolled in The Royal Academy of Dramatic Art, where she met and became friends with Roger Moore. Her movie career started with a Michael Powell and Emeric Pressburger production, Stairway to Heaven (1946). After having won The Most Promising Newcomer Golden Globe Award in 1947, she went to Hollywood and made six films before she decided to try her luck in Italy. She ha to leave Italy to go to England when her husband became ill, and since then she has had roles in a number of movies besides the first 14 Bond movies. In 1989 she retired.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxMTM3MTQyNF5BMl5BanBnXkFtZTYwOTQ4NjU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0561755","name":"Lois Maxwell","idIMDB":"nm0561755"},"actorId":"nm0561755","character":"Miss Moneypenny","urlCharacter":"http://www.imdb.com/character/ch0000343","main":true},{"actorName":"Walter Gotell","urlProfile":"http://www.imdb.com/name/nm0331770","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA4OTE4NDQxMF5BMl5BanBnXkFtZTcwMDc1MDAxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 March 1924","placeOfBirth":" Bonn, Germany","height":"6' 2\" (1.88 m)","bio":"Walter Gotell was born on March 15, 1924 in Bonn, Germany. He was an actor, known for From Russia with Love (1963), One Life to Live (1968) and The Spy Who Loved Me (1977). He was married to Celeste F. Mitchell and Yvonne Hills. He died on May 5, 1997 in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA4OTE4NDQxMF5BMl5BanBnXkFtZTcwMDc1MDAxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0331770","name":"Walter Gotell","idIMDB":"nm0331770"},"actorId":"nm0331770","character":"General Gogol","urlCharacter":"http://www.imdb.com/character/ch0000407","main":true}],"seasons":[],"idIMDB":"tt0090264","urlIMDB":"http://www.imdb.com/title/tt0090264","business":{"budget":{"money":"$30,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$13,294,435","country":"USA","day":"27","month":"05","year":"1985","remarks":""}],"gross":[{"money":"$49,667,091","country":"USA","day":"11","month":"08","year":"1985","remarks":""},{"money":"$49,239,083","country":"USA","day":"04","month":"08","year":"1985","remarks":""},{"money":"$48,666,205","country":"USA","day":"28","month":"07","year":"1985","remarks":""},{"money":"$47,985,027","country":"USA","day":"21","month":"07","year":"1985","remarks":""},{"money":"$47,016,906","country":"USA","day":"14","month":"07","year":"1985","remarks":""},{"money":"$45,667,510","country":"USA","day":"07","month":"07","year":"1985","remarks":""},{"money":"$43,256,109","country":"USA","day":"30","month":"06","year":"1985","remarks":""},{"money":"$40,109,253","country":"USA","day":"23","month":"06","year":"1985","remarks":""},{"money":"$35,862,076","country":"USA","day":"16","month":"06","year":"1985","remarks":""},{"money":"$29,194,721","country":"USA","day":"09","month":"06","year":"1985","remarks":""},{"money":"$22,912,542","country":"USA","day":"02","month":"06","year":"1985","remarks":""},{"money":"$13,294,435","country":"USA","day":"27","month":"05","year":"1985","remarks":""},{"money":"AUD 5,189,000","country":"Australia","day":"24","month":"04","year":"2004","remarks":""},{"money":"SEK","country":"33,771,247","day":null,"month":null,"year":null,"remarks":null},{"money":"$13,452,089","country":"West","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$218,012","country":"USA","day":"11","month":"08","year":"1985","remarks":"195 Screens"},{"money":"$321,712","country":"USA","day":"04","month":"08","year":"1985","remarks":"318 Screens"},{"money":"$353,590","country":"USA","day":"28","month":"07","year":"1985","remarks":"389 Screens"},{"money":"$495,684","country":"USA","day":"21","month":"07","year":"1985","remarks":"472 Screens"},{"money":"$771,866","country":"USA","day":"14","month":"07","year":"1985","remarks":"674 Screens"},{"money":"$1,234,570","country":"USA","day":"07","month":"07","year":"1985","remarks":"841 Screens"},{"money":"$1,742,866","country":"USA","day":"30","month":"06","year":"1985","remarks":""},{"money":"$2,486,459","country":"USA","day":"23","month":"06","year":"1985","remarks":""},{"money":"$3,437,519","country":"USA","day":"16","month":"06","year":"1985","remarks":""},{"money":"$3,529,804","country":"USA","day":"09","month":"06","year":"1985","remarks":""},{"money":"$6,655,707","country":"USA","day":"02","month":"06","year":"1985","remarks":""},{"money":"$13,294,435","country":"USA","day":"27","month":"05","year":"1985","remarks":""}],"admissions":[],"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":[{"money":null,"country":null,"day":"03","month":"08","year":"1984","remarks":null},{"money":null,"country":null,"day":"14","month":"01","year":"1985","remarks":null}],"copyrightHolder":"Danjaq S.A."},"technical":{"runtime":["2 hr 11 min (131 min)"],"soundMix":["Dolby Stereo"],"color":["Color (Metrocolor)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Technicolor, UK"],"filmLength":null,"negativeFormat":["35 mm (Eastman 400T 5294)"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"6.3","filmingLocations":[{"location":"2201 Broadway, Oakland, California, USA"}],"rated":"PG","awards":[{"award":"Golden Globes, USA 1986","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Original Song - Motion Picture","names":[{"name":"John Barry","id":"nm0000290","role":null},{"name":"Duran Duran","id":"nm0243686","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1986","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Science Fiction Film","names":[]},{"category":"Best Supporting Actress","names":[{"name":"Grace Jones","id":"nm0005063","role":null}]}]}]},{"award":"Bambi Awards 1985","titlesAwards":[{"titleAwardOutcome":"Won Bambi","categories":[{"category":"Film - International","names":[{"name":"Willy Bogner","id":"nm0091854","role":null}]}]}]},{"award":"Golden Screen, Germany 1986","titlesAwards":[{"titleAwardOutcome":"Won Golden Screen","categories":[{"category":"","names":[]}]}]},{"award":"Razzie Awards 1986","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Actress","names":[{"name":"Tanya Roberts","id":"nm0000617","role":null}]}]}]},{"award":"Satellite Awards 2004","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Satellite Award","categories":[{"category":"Best Classic DVD Release","names":[{"name":"From Russia with Love","id":"tt0057076","role":null},{"name":"You Only Live Twice","id":"tt0062512","role":null},{"name":"Diamonds Are Forever","id":"tt0066995","role":null},{"name":"Moonraker","id":"tt0079574","role":null},{"name":"For Your Eyes Only","id":"tt0082398","role":null},{"name":"The Living Daylights","id":"tt0093428","role":null},{"name":"The World Is Not Enough","id":"tt0143145","role":null},{"name":"Thunderball","id":"tt0059800","role":null},{"name":"On Her Majesty's Secret Service","id":"tt0064757","role":null},{"name":"Live and Let Die","id":"tt0070328","role":null},{"name":"Octopussy","id":"tt0086034","role":null},{"name":"Die Another Day","id":"tt0246460","role":null}]}]}]}],"votes":"71,546","type":"Movie","companyCreditsSimple":[{"idCompany":"co0054040","name":"Eon Productions"}],"keywords":{"keywords":["official james bond series","silicon valley","microchip","007","earthquake","computer","san francisco","explosion","bridge","fire","investigation","city hall","explosive","horse racing","golden gate bridge","murder","chase","death","water","eiffel tower","weapon","streets of san francisco","paris","united states of america","exploding helicopter","returning actress with different character","helicopter explosion","london england","ice","snow","ascot racecourse","rolls royce","chantilly","chateau","old flame","ballerina","white dinner jacket","russian spy","cold war","ski chase","siberia","damsel in distress","1980s","screaming","knockout","mystery woman","dead girl","race against time","building on fire","chinese girl","teenager","escaped killer","mysterious girl","serial murder","tsunami","strange person","college student","teenage girl","mysterious woman","suicide","cameo appearance","semiautomatic pistol","ambush","bomb","kiss","sex","kissing while having sex","blonde","shoulder holster","walther ppk","pump action shotgun","disarming someone","karate","karate kick","karate chop","axe fight","massacre","police chase","hand to hand combat","uzi","fistfight","brawl","violence","showdown","gunfight","shootout","tough guy","one against many","one man army","action hero","hero","fourteenth part","jumping off a bridge","steroid","femme fatale","villain turns good","superhuman strength","strong woman","self sacrifice","interracial relationship","reference to dick tracy","ex kgb","cult figure","cult film","killed by a propeller","black woman","mini submarine","bond girl","surveillance","spying","sequel mentioned during end credits","secret agent","espionage","based on short story","tire","tape","stable","police car","lake","laboratory","kgb","fire hose","electrocution","check","chandelier","cat","cane","axe","vase","strangulation","mine shaft","flooding","falling from height","closed mine","spy hero","pistol","gun","france","blockbuster","paris france","skiing","seismologist","poetic justice","megalomaniac","psychotic","malice","jumper","sequel","villainess","police","helicopter","molotov cocktail","timebomb","sadist","genetic engineering","snowmobile","sadism","oil well","san francisco california","mass murder","base jumping","former nazi doctor","snowboard","mine","spy","horse track","betrayal","redemption","hitman","boat","horse","zeppelin","steeplechase","elevator","winnebago","safecracker","fire truck","eiffel tower paris","tyrant","martial arts","elevator shaft","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:47:13"}}