{"data":{"movies":[{"title":"Two-Gun Mickey","originalTitle":"","year":"1934","releaseDate":"19341215","directors":[{"name":"Ben Sharpsteen","id":"nm0789313"}],"writers":[],"runtime":"8 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjkzZGQ2ZjMtZDc3YS00Y2Y0LTg4ZDEtZmRjNDNiY2UzOTk2XkEyXkFqcGdeQXVyMjMzMzc0MjM@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Comedy","Family","Western","Short"],"plot":"Minnie rides into town and takes a large sack of money out of the bank. Pegleg Pete gathers his gang to take it from her, and they chase her out of town. Lonesome cowboy Mickey, who met Minnie earlier and was told she could take care of herself, sees this chase unfolding from his high perch, and rides down to save the day.","simplePlot":"Independent cowgirl Minnie ends up in over her head when pursued by bandit Pete, so it's up to Mickey to rescue her.","actors":[{"actorName":"Billy Bletcher","urlProfile":"http://www.imdb.com/name/nm0088285","urlPhoto":"","biography":{"dateOfBirth":"24 September 1894","placeOfBirth":" Lancaster, Pennsylvania, USA","birthName":"William Bletcher","height":"5' 2\" (1.57 m)","bio":"Billy Bletcher, standing 5' 2\", was known as the little guy with the big voice, who, ironically, started his film career during the silent era. Billy's show business career began in 1913 at the age of 19 in vaudeville, and within a year, he went to work for Vitagraph Studios in Brooklyn where he both acted and directed. Two years later, he met his wife, Arline Harriett Roberts with whom he would stay married until the day he died in 1979. In 1917, he took his wife westward to Hollywood where he started with smaller production companies, such as the Christie Film Company, writing and acting in shorts, and then moved on to larger and larger companies, such as the Fox Film Corporation where he did a few cowboy movies, one with Tom Mix, playing the comedic element. Then onto larger companies, such as Warner Brothers, RKO, Columbia, and Paramount where he had mostly bit parts, but got experience working with the likes of The Three Stooges and The Marx Brothers. But it was in Mack Sennett's comedy troupe where he started getting recognition doing two-reelers, and his biggest break came when Hal Roach studios pared him with Billy Gilbert and his career took off. Because pictures now had sound, directors and studios everywhere were clamoring for his deep, rich voice. Mack Sennett and Hal Roach put Bletcher in shorts with W.C. Fields and Laurel and Hardy and he even played Spanky's father in the Little Rascals series, but it was Disney who made Bletcher a star. Pinto Colvig, the original voice of Goofy and Pluto, told Bletcher that Disney needed a big, blustering voice to \"huff and puff and blow your house in,\" so he tried out, got the job, and within a very short time, Disney had him doing a session a week in the sound booth, sometimes doing two and three voices. His voice got so famous that when he auditioned to do the voice of one of the seven dwarfs in Blanche Neige et les sept nains (1937), Walt Disney took him aside and told him, \"Billy, your voice is heard so much in all of these singles that I make, I don't think I'd want to use you as one of the Seven Dwarfs.\" Bletcher admits that because his voice was so low and resonant, the characters he got to play were usually the \"heavies\" (bad guys). And as a heavy his voice became too recognizable for him to get a role in a feature length Disney production, with one exception: he did get a minor role in Dumbo as the voice of one of the clowns. As a voice actor, he could go anywhere and soon found himself working for Leon Schlesinger at Warner Brothers, but never got credit for his work since Mel Blanc had it in his contract that he'd be the sole credit for voice characterizations. And at that time there were only a dozen or so actors doing voicework that the jobs were plentiful. He worked for Disney, Warner, and at MGM he did the voice of the Captain in the Captain and the Kids cartoons. In the fifties, he did several characters on the Lone Ranger radio program, but before that he did what's known in the business as ADR (automated dialogue replacement) work, with his old pal Pinto Colvig. In The Wizard of Oz (1939), their voices were substituted for a few of the munchkins. All in all, Bletcher worked on just over 450 films spanning nearly 60 years, his last film being a made-for-TV version of Li'l Abner (1971) in which he played Pappy Yokum. He passed away 13 years later at the age of 84.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0088285","name":"Billy Bletcher","idIMDB":"nm0088285"},"actorId":"nm0088285","character":"Pegleg Pete","urlCharacter":"http://www.imdb.com/character/ch0048116","main":true},{"actorName":"Walt Disney","urlProfile":"http://www.imdb.com/name/nm0000370","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMTUyNjc5OF5BMl5BanBnXkFtZTcwMjMwNjYwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 December 1901","placeOfBirth":" Chicago, Illinois, USA","birthName":"Walter Elias Disney","height":"5' 10\" (1.78 m)","bio":"Walter Elias Disney was born on December 5, 1901 in Chicago, Illinois, the son of Flora Disney (née Call) and Elias Disney, a Canadian-born farmer and businessperson. He had Irish, German, and English ancestry. Walt moved with his parents to Kansas City at age seven, where he spent the majority of his childhood. At age 16, during World War I, he faked his age to join the American Red Cross. He soon returned home, where he won a scholarship to the Kansas City Art Institute. There, he met a fellow animator, Ub Iwerks. The two soon set up their own company. In the early 1920s, they made a series of animated shorts for the Newman theater chain, entitled \"Newman's Laugh-O-Grams\". Their company soon went bankrupt, however. The two then went to Hollywood in 1923. They started work on a new series, about a live-action little girl who journeys to a world of animated characters. Entitled the \"Alice Comedies\", they were distributed by M.J. Winkler (Margaret). Walt was backed up financially only by Winkler and his older brother Roy O. Disney, who remained his business partner for the rest of his life. Hundreds of \"Alice Comedies\" were produced between 1923 and 1927, before they lost popularity. Walt then started work on a series around a new animated character, Oswald the Lucky Rabbit. This series was successful, but in 1928, Walt discovered that M.J. Winkler and her husband, Charles Mintz, had stolen the rights to the character away from him. They had also stolen all his animators, except for Ub Iwerks. While taking the train home, Walt started doodling on a piece of paper. The result of these doodles was a mouse named Mickey. With only Walt and Ub to animate, and Walt's wife Lillian Disney (Lilly) and Roy's wife Edna Disney to ink in the animation cells, three Mickey Mouse cartoons were quickly produced. The first two didn't sell, so Walt added synchronized sound to the last one, Steamboat Willie (1928), and it was immediately picked up. With Walt as the voice of Mickey, it premiered to great success. Many more cartoons followed. Walt was now in the big time, but he didn't stop creating new ideas. In 1929, he created the 'Silly Symphonies', a cartoon series that didn't have a continuous character. They were another success. One of them, Flowers and Trees (1932), was the first cartoon to be produced in color and the first cartoon to win an Oscar; another, Three Little Pigs (1933), was so popular it was often billed above the feature films it accompanied. The Silly Symphonies stopped coming out in 1939, but Mickey and friends, (including Minnie Mouse, Donald Duck, Goofy, Pluto, and plenty more), were still going strong and still very popular. In 1934, Walt started work on another new idea: a cartoon that ran the length of a feature film. Everyone in Hollywood was calling it \"Disney's Folly\", but Blanche Neige et les sept nains (1937) was anything but, winning critical raves, the adoration of the public, and one big and seven little special Oscars for Walt. Now Walt listed animated features among his ever-growing list of accomplishments. While continuing to produce cartoon shorts, he also started producing more of the animated features. Pinocchio (1940), Dumbo (1941), and Bambi (1942) were all successes; not even a flop like Fantasia (1940) and a studio animators' strike in 1941 could stop Disney now. In the mid 1940s, he began producing \"packaged features\", essentially a group of shorts put together to run feature length, but by 1950 he was back with animated features that stuck to one story, with Cendrillon (1950), Alice au pays des merveilles (1951), and Peter Pan (1953). In 1950, he also started producing live-action films, with Treasure Island (1950). These began taking on greater importance throughout the 50s and 60s, but Walt continued to produce animated features, including La belle et le clochard (1955), Sleeping Beauty (1959), and 101 Dalmatians (1961). In 1955, he even opened a theme park in southern California: Disneyland. It was a place where children and their parents could take rides, just explore, and meet the familiar animated characters, all in a clean, safe environment. It was another great success. Walt also became one of the first producers of films to venture into television, with his series Walt Disney's Wonderful World of Color (1954) which he began in 1954 to promote his theme park. He also produced The Mickey Mouse Club (1955) and Zorro (1957). To top it all off, Walt came out with the lavish musical fantasy Mary Poppins (1964), which mixed live-action with animation. It is considered by many to be his magnum opus. Even after that, Walt continued to forge onward, with plans to build a new theme park and an experimental prototype city in Florida. He never did finish those plans, however; in 1966, he developed lung cancer brought on by his lifelong chain-smoking. He died in the hospital on December 15, 1966 at age 65. But not even his death, it seemed, could stop him. Roy carried on plans to build the Florida theme park, and it premiered in 1971 under the name Walt Disney World. What's more, his company continues to flourish, still producing animated and live-action films and overseeing the still- growing empire started by one man: Walt Disney, who will never be forgotten.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxMTUyNjc5OF5BMl5BanBnXkFtZTcwMjMwNjYwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000370","name":"Walt Disney","nicknames":["Uncle Walt"],"idIMDB":"nm0000370"},"actorId":"nm0000370","character":"Mickey Mouse","urlCharacter":"http://www.imdb.com/character/ch0000630","main":true},{"actorName":"Marcellite Garner","urlProfile":"http://www.imdb.com/name/nm0307732","urlPhoto":"","biography":{"dateOfBirth":"3 July 1910","placeOfBirth":" Redlands, California, USA","birthName":"Edna Marcellite Garner","bio":"Marcellite Garner was born on July 3, 1910 in Redlands, California, USA as Edna Marcellite Garner. She was an actress, known for Mickey's Rival (1936), The Birthday Party (1931) and Mickey Steps Out (1931). She was married to Harry Abraham Lincoln and Richard Bruce Wall. She died on July 26, 1993 in Grass Valley, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0307732","name":"Marcellite Garner","idIMDB":"nm0307732"},"actorId":"nm0307732","character":"Minnie Mouse","urlCharacter":"http://www.imdb.com/character/ch0000681","main":true}],"seasons":[],"idIMDB":"tt0025926","urlIMDB":"http://www.imdb.com/title/tt0025926","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["8 min"],"soundMix":["Mono (RCA Photophone System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.1","filmingLocations":[],"rated":"APPROVED","awards":[],"votes":"229","type":"Movie","companyCreditsSimple":[{"idCompany":"co0098836","name":"Walt Disney Productions"}],"keywords":{"keywords":["cowgirl","cowboy","bank","bandit","pegleg pete","character appears on wanted poster","thought bubble","shootout","rolling a cigarette","robber","pistol","old west","wanted poster","mouse","money bag","match","lasso","kicked in the butt","kidnapping","horse drawn carriage","horse","female slaps male","fear of water","falling into water","falling down a hill","exposed underwear","ends with a ride into the sunset","cigarette smoking","tobacco","cat","cartoon mouse","cartoon horse","cartoon cat","campfire","cactus","anthropomorphism","anthropomorphic animal","reference to minnie mouse","number in title","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:54:16"}}