{"data":{"movies":[{"title":"Gambit","originalTitle":"","year":"1966","releaseDate":"19670107","directors":[{"name":"Ronald Neame","id":"nm0623768"}],"writers":[{"name":"Jack Davies","id":"nm0203766"},{"name":"Alvin Sargent","id":"nm0765091"}],"runtime":"109 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTEwYzIxODEtMDBjNS00MjQ3LWJkMjEtMmYxYTg3YmIxNWVkXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","countries":["USA"],"languages":["English","French","Arabic"],"genres":["Comedy","Crime","Thriller"],"plot":"Cockney cat burglar Harry Dean needs Hong Kong dancer Nicole Chang's help to pull off the perfect heist. With a simple makeover and a new wardrobe; Nicole's resemblance to wealthy recluse Mr. Shahbandar's late wife is uncanny. While Shahbandar is distracted by the mesmerizing Nicole, Harry takes steps to swipe a priceless artifact from under the tycoon's nose. But even the most foolproof schemes have a way of backfiring...","simplePlot":"An English cat burglar needs a Eurasian dancer's help to pull off the perfect heist, but even the most foolproof schemes have a way of backfiring.","actors":[{"actorName":"Shirley MacLaine","urlProfile":"http://www.imdb.com/name/nm0000511","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MTE5MjQ1MF5BMl5BanBnXkFtZTYwMzU2MDg1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1934","placeOfBirth":" Richmond, Virginia, USA","birthName":"Shirley MacLean Beaty","height":"5' 7\" (1.7 m)","bio":"Shirley MacLaine was born Shirley MacLean Beaty in Richmond, Virginia. Her mother, Kathlyn Corinne (MacLean), was a drama teacher from Nova Scotia, Canada, and her father, Ira Owens Beaty, a professor of psychology and real estate agent, was from Virginia. Her brother, Warren Beatty, was born on March 30, 1937. Her ancestry includes English and Scottish. Shirley was the tallest in her ballet classes at the Washington School of Ballet. Just after she graduated from Washington-Lee High School, she packed her bags and headed for New York. While auditioning for Richard Rodgers and Oscar Hammerstein II's \"Me and Juliet\", the producer kept mispronouncing her name. She then changed her name from Shirley MacLean Beaty to Shirley MacLaine. She later had a role in \"The Pajama Game\", as a member of the chorus and understudy to Carol Haney. A few months into the run, Shirley was going to leave the show for the lead role in \"Can-Can\" but ended up filling in for Haney, who had broken her ankle and could not perform. She would fill in for Carol, again, three months later, following another injury, the very night that movie producer Hal B. Wallis was in the audience. Wallis signed MacLaine to a five-year contract to Paramount Pictures. Three months later, she was off to shoot The Trouble with Harry (1955). She then took roles in Hot Spell (1958) and Around the World in Eighty Days (1956), completed not too long before her daughter, Sachi Parker (born Stephanie), was born. With Shirley's career on track, she played one of her most challenging roles: \"Ginny Moorhead\" in Some Came Running (1958), for which she received her first Academy Award nomination for Best Actress. She went on to do The Sheepman (1958) and The Matchmaker (1958). In 1960, she got her second Academy Award nomination for The Apartment (1960). Three years later, she received a third nomination for Irma la Douce (1963). In 1969, she brought her friend Bob Fosse from Broadway to direct her in Sweet Charity (1969), from which she got her \"signature\" song, \"If My Friends Could See Me Now\". After a five-year hiatus, Shirley made a documentary on China called The Other Half of the Sky: A China Memoir (1975), for which she received an Oscar nomination for best documentary. In 1977, she got her fourth Best Actress Oscar nomination for The Turning Point (1977). In 1979, she worked with Peter Sellers in Being There (1979), made shortly before his death. After 20 years in the film industry, she finally took home the Best Actress Oscar for Terms of Endearment (1983). After a five-year hiatus, Shirley made Madame Sousatzka (1988), a critical and financial hit that took top prize at the Venice Film Festival. In 1989, she starred with Dolly Parton, Sally Field and Julia Roberts in Steel Magnolias (1989). She received rave reviews playing Meryl Streep's mother in Postcards from the Edge (1990) and for Guarding Tess (1994). In 1996, she reprised her role from \"Terms of Endearment\" as \"Aurora Greenway\" in The Evening Star (1996), which didn't repeat its predecessor's success at the box office. In mid-1998, she directed Bruno (2000), which starred Alex D. Linz. In February 2001, Shirley worked with close friends once again in These Old Broads (2001), and co-starred with Julia Stiles in Carolina (2003) and with Kirstie Alley in Salem Witch Trials (2002). MacLaine as her own website which includes her own radio show and interviews, the Encounter Board, and Independent Expression, a members-only section of the site. In the past few years, Shirley starred in a CBS miniseries based on the life of cosmetics queen Mary Kay Ash--The Battle of Mary Kay (2002), and wrote two more books, \"The Camino\" in 2001, and \"Out On A Leash\" in 2003. After taking a slight hiatus from motion pictures, Shirley returned with roles in the movies that were small, but wonderfully scene-stealing: Bewitched (2005) with Nicole Kidman and Will Ferrell, In Her Shoes (2005) with Cameron Diaz and Toni Collette, in which Shirley was nominated for a Golden Globe in the best supporting actress category, and Rumor Has It... (2005) with Jennifer Aniston and Kevin Costner. Shirley completed filming of Closing the Ring (2007), directed by Sir Richard Attenborough, in 2007. Her latest book is entitled \"Sage-ing While Ag-ing\"; Shirley's latest film is Valentine's Day (2010), which debuted in theaters on February 12, 2010.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MTE5MjQ1MF5BMl5BanBnXkFtZTYwMzU2MDg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000511","name":"Shirley MacLaine","idIMDB":"nm0000511"},"actorId":"nm0000511","character":"Nicole Chang","urlCharacter":"http://www.imdb.com/character/ch0048509","main":true},{"actorName":"Michael Caine","urlProfile":"http://www.imdb.com/name/nm0000323","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzIwNTQ4Ml5BMl5BanBnXkFtZTYwMzE1MTUz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1933","placeOfBirth":" Rotherhithe, London, England, UK","birthName":"Maurice Joseph Micklewhite","height":"6' 1\" (1.85 m)","bio":"Michael Caine was born Maurice Joseph Micklewhite in London, to Ellen Frances Marie (Burchell), a charlady, and Maurice Joseph Micklewhite, a fish-market porter. He left school at 15 and took a series of working-class jobs before joining the British army and serving in Korea during the Korean War, where he saw combat. Upon his return to England he gravitated toward the theater and got a job as an assistant stage manager. He adopted the name of Caine on the advice of his agent, taking it from a marquee that advertised The Caine Mutiny (1954). In the years that followed he worked in more than 100 television dramas, with repertory companies throughout England and eventually in the stage hit, \"The Long and the Short and the Tall.\" Zulu (1964), the 1964 epic retelling of a historic 19th-century battle in South Africa between British soldiers and Zulu warriors, brought Caine to international attention. Instead of being typecast as a low-ranking Cockney soldier, he played a snobbish, aristocratic officer. Although \"Zulu\" was a major success, it was the role of Harry Palmer in The Ipcress File (1965) and the title role in Alfie (1966) that made Caine a star of the first magnitude. He epitomized the new breed of actor in mid-'60s England, the working-class bloke with glasses and a down-home accent. However, after initially starring in some excellent films, particularly in the 1960s, including Gambit (1966), Funeral in Berlin (1966), Play Dirty (1969), Battle of Britain (1969), Too Late the Hero (1970), The Last Valley (1971) and especially Get Carter (1971), he seemed to take on roles in below-average films, simply for the money he could by then command. There were some gems amongst the dross, however. He gave a magnificent performance opposite Sean Connery in The Man Who Would Be King (1975) and turned in a solid one as a German colonel in The Eagle Has Landed (1976). Educating Rita (1983) and Hannah and Her Sisters (1986) (for which he won his first Oscar) were highlights of the 1980s, while more recently Little Voice (1998), The Cider House Rules (1999) (his second Oscar) and Last Orders (2001) have been widely acclaimed.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNzIwNTQ4Ml5BMl5BanBnXkFtZTYwMzE1MTUz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000323","name":"Michael Caine","idIMDB":"nm0000323"},"actorId":"nm0000323","character":"Harry Dean","urlCharacter":"http://www.imdb.com/character/ch0240282","main":true},{"actorName":"Herbert Lom","urlProfile":"http://www.imdb.com/name/nm0007042","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg5OTc0OTA3Ml5BMl5BanBnXkFtZTcwOTIyOTYyMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1917","placeOfBirth":" Prague, Bohemia, Austria-Hungary [now Czech Republic]","birthName":"Herbert Charles Angelo Kuchacevich ze Schluderpacheru","height":"5' 7¾\" (1.72 m)","bio":"Born September 11, 1917, Herbert Lom made his film debut in the Czech film Woman Below the Cross (1937) and played supporting and, occasionally, lead roles. His career picked up in the 1940s and he played, among other roles, Napoleon Bonaparte in The Young Mr. Pitt (1942) (and, again, in War and Peace (1956)). In a rare starring role, Lom played twin trapeze artists in Dual Alibi (1947). He continued into the 1950s with roles opposite Alec Guinness and Peter Sellers in The Ladykillers (1955) and Robert Mitchum, Jack Lemmon and Rita Hayworth in Fire Down Below (1957). His career really took off in the 1960s and he got the title role in Hammer Films' production of The Phantom of the Opera (1962). He also played \"Captain Nemo\" in Mysterious Island (1961) and landed supporting parts in Le Cid (1961) and an especially showy role in Spartacus (1960) as a pirate chieftain contracted to transport Spartacus' army away from Italy. The 1960s was also the decade in which Lom secured the role for which he will always be remembered: Peter Sellers' long-suffering boss, Commissioner Charles Dreyfus, in the \"Pink Panther\" films, in which he pulled off the not-inconsiderable feat of stealing almost every scene he and Sellers were in--a real accomplishment, considering what a veteran scene-stealer Sellers was. However, Lom did not concentrate solely on a film career. He had become a familiar face to British television viewers when he starred as Dr. Roger Corder in the series The Human Jungle (1963). He moved into horror films in the 1970s, with parts in Asylum (1972) and And Now the Screaming Starts! (1973). He played Prof. Abraham Van Helsing opposite Christopher Lee in Count Dracula (1970), matching wits against the sinister vampire himself. Lom appeared as one of the ten victims in Ten Little Indians (1974), playing the drunken Dr. Edward Armstrong. His career continued into the 1980s, a standout role being that of Christopher Walken's sympathetic doctor in The Dead Zone (1983). He also played opposite Walter Matthau in Hopscotch (1980) and returned to the murder mystery Ten Little Indians (1989), this time playing The General. Lom has been taking it easy since then, though he returned to his familiar role of Commissioner Dreyfus in Le fils de la panthère rose (1993). He has always been a reliable and eminently watchable actor, unfortunately not receiving the stardom he probably should have. Herbert Lom died in his sleep at age 95 on September 27, 2012, in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzg5OTc0OTA3Ml5BMl5BanBnXkFtZTcwOTIyOTYyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007042","name":"Herbert Lom","idIMDB":"nm0007042"},"actorId":"nm0007042","character":"Ahmad Shahbandar","urlCharacter":"http://www.imdb.com/character/ch0247046","main":true},{"actorName":"Roger C. Carmel","urlProfile":"http://www.imdb.com/name/nm0138354","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3OTEyNTUyOV5BMl5BanBnXkFtZTcwNzAzMDIyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 September 1932","placeOfBirth":" Brooklyn, New York, USA","birthName":"Roger Charles Carmel","height":"6' 3\" (1.91 m)","bio":"Roger C. Carmel, who was born September 27, 1932, was named after his grandfather, Roger Charles, who carved the horses for the carousel in New York's Central Park. He became an actor and won television immortality by appearing as Harry Mudd in two classic \"Star Trek\" episodes, \"I, Mudd\" and \"Mudd's Women.\" Carmel was one of the few actors, other than the regulars, to appear in two episodes of \"Star Trek\" as the same character. After appearing on stage, Carmel began working steadily on television in the early 1960s as a character actor, appearing on both dramas (\"Route 66\") and situation-comedies (\"The Dick Van Dyke Show\"). The highlight of Carmel's non \"Star Trek\" acting career came in 1967, when he was cast as Kay Ballard's husband in the TV situation comedy \"The Mothers in Law\" by Desi Arnaz, the Cuban-born actor and entertainment impresario's first production since I Love Lucy (1951). The network, NBC, was disappointed by the mediocre ratings of \"The Mothers-in-Law\" and almost canceled it. It picked the show up for a second season after rival network ABC expressed interest in the show, but the network informed Arnaz that they would not give any additional money for the show. Traditionally, salaries are increased when a TV show is picked up for a new season, and all the actors' contracts specifically called for raises in the event of renewal. Show creator Arnaz, who was also producer, director, and writer, called together the cast and crew and told them that although the series had been renewed, there was no money for salary increases. According to Carmel's own recollection, Arnaz was already drawing down multiple salaries on the program, and would shortly cast himself as a supporting character in the series, thus drawing another salary, although Carmel didn't know that at the time. Arnaz elicited a promise from the creative people, the crew and the actors to forgo salary increases to keep the show on the air. All the actors had agreed but one: Roger Carmel. He told Arnaz he would quit unless he received a raise, as per his contract. In a contemporaneous account of the incident, Carmel said, \"Desi called me and put it on a personal basis. I didn't feel it should be done that way - it was very unfair of him. Then Desi and the Morris Agency threatened I would be replaced. Kaye Ballard and Eve Arden also called me and asked me to go along, but I wouldn't.\" Arnaz's response to Carmel's ultimatum was dismissive. \"Where else is he going to make two thousand dollars a week?\" the producer asked rhetorically. If Arnaz's Desilu production company gave in to Carmel, it would be faced with giving all the cast members a raise, which was financially unviable with the money on offer from NBC. Arnaz was forced to terminate Carmel, who was replaced by fellow \"Dick Van Dyke Show\" alumnus Richard Deacon for the second season. The show had poor ratings and was canceled after its second season. After being fired from \"The Mothers-in-Law,\", Carmel's acting career suffered. Other than his Harry Mudd appearances, Carmel's most memorable gig on TV was as Colonel Gumm on \"Batman\" in 1967. He made regular appearances on the syndicated quiz TV show \"Stump The Stars\" from 1968 to 1970. Carmel even reprised his most famous role, that of Harry Mudd, in an episode of the animated version of \"Star Trek\" (1973-75), an indicator of the direction of his future career. However, during the 1970s, he could not secure another regular role as an ongoing character on a TV series, though he continued to appear regularly on sitcoms, mostly in ethnic roles, including appearances on \"All In The Family,\" \"Chico and The Man,\" and \"Three's Company.\" He also appeared in B-movie bombs, including the Jerry Lewis flop \"Hardly Working\" (1981). At the dawn of the new decade of the 1980s, Carmel finally got another opportunity for the first time in a dozen years, when he was cast as a regular on the network program \"Fitz and Bones.\" An hour-long drama starring the TV comedy-musical duo The Smothers Brothers as investigative reporters, the show was a ratings failure, lasting only one month. After this monumental flop (\"Fitz and Bones\" was the lowest-rated series for the entire 1981-82 season), character parts dried up and Carmel was reduced to doing voice-over work for children's cartoons, including \"The Transformers.\" Carmel's last triumph as an actor was in commercials. Carmel was a huge hit in advertising playing Senor Naugles, a faux-Mexican Colonel Sanders clone, for the West Coast region Mexican fast food chain Naugles. The commercials were a success and the chain began expanding rapidly. However, both the renewed success of Roger C. Carmel and the fresh success of the chain were, sadly, to prove short-lived. According to acquaintances, Carmel was struck by chest pains on the night he died and called a cab to take him to the hospital. When the cab showed up at his Hollywood high-rise but Carmel did not come down to get it, the doorman sent the cab away, never inquiring why he failed to appear. Carmel was found dead on the floor of his apartment the next morning, November 11, 1986. While there were rumors that he committed suicide (he was rumored to be a recreational drug user), the official cause of death was listed as hypertrophic cardiomyopathy, a disease of the heart muscle in which the organ becomes enlarged. The condition leads to congestive heart failure, which apparently is what struck down Carmel. He was only 54 years old. Roger C. Carmel's body was interred in Glendale, New York. After Carmel's death, Naugles failed to come up with another successful ad campaign, and eventually, its financial fortunes changed. It was eventually acquired by rival Del Taco.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3OTEyNTUyOV5BMl5BanBnXkFtZTcwNzAzMDIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0138354","name":"Roger C. Carmel","idIMDB":"nm0138354"},"actorId":"nm0138354","character":"Ram","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arnold Moss","urlProfile":"http://www.imdb.com/name/nm0608909","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MjMwNzkxNl5BMl5BanBnXkFtZTgwMzg3MTU2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 January 1910","placeOfBirth":" Brooklyn, New York, USA","bio":"Character actor Arnold Moss was born on January 28, 1910. Given his aristocratic bearing, perfect diction and resounding bass voice, it's not hard to believe that he was an experienced Shakespearean stage actor. It's quite rather harder to believe that he was born in Brooklyn, not London, but that's where he was from. An extremely well-educated man--Phi Beta Kappa, a Master's degree in French and a Ph.D in theater--he had originally planned to become a teacher, but the acting bug bit him and he headed for a career on the stage, eventually starting his own Shakespearean company. His stage training, and that remarkable voice, guaranteed him steady employment on radio, where he spent many years writing as well as acting. He made his film debut in 1946, and specialized in urbane villainy in the manner of George Macready, playing everything from Arab chieftains to Mexican bandits to Indian maharajahs over his career, and did much television work from the early 1950s onward. He appeared on Star Trek (1966) as mysterious actor Anton Karidian, alter-ego of the tyrannical Kodos the Executioner, in the episode \"The Conscience of the King\". He also appeared in the original Broadway production of Stephen Sondheim's \"Follies\", playing impresario Dimitri Weissman. Arnold Moss died at age 79 of lung cancer in New York City on December 15, 1989.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MjMwNzkxNl5BMl5BanBnXkFtZTgwMzg3MTU2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0608909","name":"Arnold Moss","idIMDB":"nm0608909"},"actorId":"nm0608909","character":"Abdul","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Abbott","urlProfile":"http://www.imdb.com/name/nm0007995","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNzc4MjMzMV5BMl5BanBnXkFtZTcwMjg2MjYwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 June 1905","placeOfBirth":" London, England, UK","birthName":"John Albert Chamberlain Kefford","height":"5' 11\" (1.8 m)","bio":"John Abbott was born on June 5, 1905 in London, England as John Albert Chamberlain Kefford. He was an actor, known for The Jungle Book (1967), Gigi (1958) and Mrs. Miniver (1942). He died on May 24, 1996 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNzc4MjMzMV5BMl5BanBnXkFtZTcwMjg2MjYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007995","name":"John Abbott","idIMDB":"nm0007995"},"actorId":"nm0007995","character":"Emile Fournier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Angarola","urlProfile":"http://www.imdb.com/name/nm0029409","urlPhoto":"","biography":{"dateOfBirth":"1 September 1920","placeOfBirth":" Traverse City, Michigan, USA","birthName":"Richard Anthony Angarola","bio":"Richard Angarola was born on September 1, 1920 in Traverse City, Michigan, USA as Richard Anthony Angarola. He was an actor, known for Papillon (1973), Jeremiah Johnson (1972) and Gambit (1966). He was married to Dagmar Woywodt and Hilda Simms. He died on July 7, 2008 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0029409","name":"Richard Angarola","idIMDB":"nm0029409"},"actorId":"nm0029409","character":"Colonel Salim","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maurice Marsac","urlProfile":"http://www.imdb.com/name/nm0550342","urlPhoto":"","biography":{"dateOfBirth":"23 March 1915","placeOfBirth":" Croix, Nord, France","height":"6' 1½\" (1.87 m)","bio":"Maurice Marsac was born on March 23, 1915 in Croix, Nord, France. He was an actor, known for The Big Red One (1980), Gambit (1966) and The Jerk (1979). He was married to Melanie Marsac. He died on May 6, 2007 in Santa Rosa, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0550342","name":"Maurice Marsac","idIMDB":"nm0550342"},"actorId":"nm0550342","character":"Hotel Clerk","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0060445","urlIMDB":"http://www.imdb.com/title/tt0060445","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"© MCMLXVI by Universal Pictures. All Rights Reserved (on print)"},"technical":{"runtime":["1 hr 49 min (109 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Techniscope"],"printedFilmFormat":["16 mm (anamorphic) (blow-up)","35 mm (anamorphic)"]},"rating":"7.1","filmingLocations":[{"location":"Stearns Wharf, Santa Barbara, California, USA"}],"rated":"APPROVED","awards":[{"award":"Academy Awards, USA 1967","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Art Direction-Set Decoration, Color","names":[{"name":"Alexander Golitzen","id":"nm0326529","role":null},{"name":"George C. Webb","id":"nm0916112","role":null},{"name":"John McCarthy Jr.","id":"nm0565042","role":null},{"name":"John P. Austin","id":"nm0042431","role":null}]},{"category":"Best Costume Design, Color","names":[{"name":"Jean Louis","id":"nm0521872","role":null}]},{"category":"Best Sound","names":[{"name":"Waldon O. Watson","id":"nm0910592","role":"Universal City SSD"}]}]}]},{"award":"Golden Globes, USA 1967","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Motion Picture - Comedy or Musical","names":[]},{"category":"Best Actress - Comedy or Musical","names":[{"name":"Shirley MacLaine","id":"nm0000511","role":null}]},{"category":"Best Actor - Comedy or Musical","names":[{"name":"Michael Caine","id":"nm0000323","role":null}]}]}]},{"award":"Laurel Awards 1967","titlesAwards":[{"titleAwardOutcome":"3rd place Golden Laurel","categories":[{"category":"Female Comedy Performance","names":[{"name":"Shirley MacLaine","id":"nm0000511","role":null}]}]}]}],"votes":"3,722","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"}],"keywords":{"keywords":["heist","dancer","hong kong","cockney","original artwork replaced with expert duplicate","unlikely criminal","swindle","stealing","sexual tension","sculpture","recruiting","painting","oil baron","nightclub","multi millionaire","man woman man relationship","long con","laser","hypothetical flash forward","hotel suite","helicopter","gentleman thief","garage","gadget","fictional city","elevator shaft","con trick","con artist","bust","art forgery","art dealer","art appraiser","arab","thief","singer","posing","posing as married couple","posing as husband and wife","planning","caper","art theft","surprise ending","plot twist"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:03:02"}}