{"data":{"movies":[{"title":"Cyborg","originalTitle":"","year":"1989","releaseDate":"19890407","directors":[{"name":"Albert Pyun","id":"nm0150034"}],"writers":[{"name":"Albert Pyun","id":"nm0150034"}],"runtime":"86 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NjQ5Mzk5NV5BMl5BanBnXkFtZTcwNzczOTYyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Sci-Fi","Thriller"],"plot":"Gibson Rickenbacker is a hired fighter living in a plague-ravaged apocalyptic America where a plague has infested most of the United States and the rest of the world. In New York City, Gibson encounters a woman named Pearl Prophet. Pearl reveals to Gibson that she is a cyborg who is carrying vital-information for a group of scientists in Atlanta who are working on a cure to the plague and Pearl hires Gibson to escort her back to Atlanta. But Pearl is kidnapped by \"Pirates\" a murderous gang led by Fender Tremolo, who wants the cure for themselves and they decide to take Pearl to Atlanta themselves. Gibson, joined by a young woman named Nady Simmons, goes in pursuit of Fender and his gang, as Gibson sets out to rescue Pearl, stop Fender and his gang from reaching Atlanta and defeat Fender who slaughtered Gibson's family.","simplePlot":"A martial artist hunts a killer in a plague-infested urban dump of the future.","actors":[{"actorName":"Jean-Claude Van Damme","urlProfile":"http://www.imdb.com/name/nm0000241","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2OTE1Njg4NjVeQTJeQWpwZ15BbWU3MDAyNjU4MDM@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1960","placeOfBirth":" Berchem-Sainte-Agathe, Brussels, Belgium","birthName":"Jean-Claude Camille François Van Varenberg","height":"5' 9¾\" (1.77 m)","bio":"Van Damme was born Jean-Claude Camille François Van Varenberg in Berchem-Sainte-Agathe, Brussels, Belgium, to Eliana and Eugène Van Varenberg, an accountant. \"The Muscles from Brussels\" started martial arts at the age of eleven. His father introduced him to martial arts when he saw his son was physically weak. At the age of 12, Van Damme began his martial arts training at Centre National De Karate (National Center of Karate) under the guidance of Master Claude Goetz in Ixelles, Belgium. Van Damme trained for 4 years and earned a spot on the Belgium Karate Team. He won the European professional karate association's middleweight championship as a teenager, and also beat the 2nd best karate fighter in the world. His goal was to be number one but got sidetracked when he left his hometown of Brussels. In 1976 at the age of sixteen, Jean-Claude started his Martial Arts fight career. Over the next 6-years, he competed in both full-contact and semi-contact matches. He debuted under his birth name of Jean Claude Van Varenberg. In his first match, Jean-Claude was staggered by a round-house kick thrown by fellow countryman, Toon Van Oostrum in Brussels, Belgium. Van Damme was badly stunned, but came back to knockout Van Oostrum moments later. In 1977, at the WAKO Open International in Antwerp, Belgium, Jean-Claude lost a decision to fellow team mate Patrick Teugels in a semi-contact match. At the 1978 Challenge De Espoirs Karate Tournament (1st Trials),Jean-Claude placed 2nd in the semi-contact division. He defeated twenty-five opponents during the week long tournament, but lost in the finals to Angelo Spataro from the Naha Club. Later in 1978, Jean-Claude lost a 3-round match for the Belgium Lightweight Championship (semi-contact) to his fellow team-mate to Patrick Teugels. In 1979, Jean-Claude traveled to the United States of America, to Tampa, Florida. In his first and only match against a United States opponent, Van Damme faced 'Sherman 'Big Train'Bergman', a kick-boxer from Miami Beach, Florida. For the first and only time in his career, Jean-Claude was knocked to the canvas after absorbing a powerful left hook from Bergman. However, Jean-Claude climbed off the canvas and with a perfectly timed ax-kick, knocked Bergman out in 56 seconds of the first round. Jean-Claude was a member of the Belgium team which competed on December 26, 1979 at the La Coupe Fancois Persoons Karate Tournament which was sanctioned by the Federation bruxelloise de Karate. Van Damme's final match victory enabled his team to win the European Team Karate Championship. In Full-Contact karate, Jean-Claude knocked out England's Micheal Heming in 46 seconds of the first round. In 1980, Van Damme knocked out France's Georges Verlugels in 2 rounds of a match fought under kick-boxing rules. Jean-Claude wanted to defeat his rival Patrick Teugels. At the Forest Nationals in Brussels, on March 8, 1980, Jean-Claude knocked Teugels down and Teugels suffered a nose injury and was unable to continue. Jean-Claude was awarded a first round victory. Jean-Claude retired from martial arts in 1982, following a knockout over Nedjad Gharbi in Brussels,Belgium. Jean-Claude posted a 18-1 (18 knockouts) Kickboxing record, and a Semi-Contact record of 41-4. He came to Hong Kong at the age of 19 for the first time and felt insured to do action movies in Hong Kong. In 1981 Van Damme moved to Los Angeles. He took English classes while working as carpet layer, pizza delivery man, limo driver, and thanks to Chuck Norris he got a job as a bouncer at a club. Norris gave Van Damme a small role in the movie Missing in Action (1984), but it wasn't good enough to get anybody's attention. Then in 1984 he got a role as a villain named Ivan in the low-budget movie No Retreat, No Surrender (1986). Then one day, while walking on the streets, Jean-Claude spotted a producer for Cannon Pictures, and showed some of his martial arts abilities which led to a role in Bloodsport (1988). But the movie, filmed in Hong Kong, was so bad when it was completed, it was shelved for almost two years. It might have never been released if Van Damme did not help them to recut the film and begged producers to release it. They finally released the film, first in Malaysia and France and then into the U.S. Shot on a meager 1.5 million dollar budget, it became a U.S box-office hit in the spring of 1988. It made about 30 million worldwide and audiences supported this film for its new sensational action star Jean-Claude Van Damme. His martial arts assets, highlighted by his ability to deliver a kick to an opponent's head during a leaping 360-degree turn, and his good looks led to starring roles in higher budgeted movies like Cyborg (1989), Lionheart (1990), Double Impact (1991) and Universal Soldier (1992). In 1994, he scored with his big breakthrough $100 million worldwide hit Timecop (1994). But in the meantime, his personal life was coming apart. A divorce, followed by a new marriage, followed by another divorce. It began to show up in his career when his projects began to tank at the box office - The Quest (1996), which he directed; Maximum Risk (1996) and Double Team (1997). The three films made less than $50 million combined. In 1999 he remarried his ex-wife Gladys Portugues and restarted his lost career to attain new goals. With help from his family he faced his problems and made movies like Replicant (2001), Derailed (2002), and In Hell (2003) which did averagely in box office terms, but he tried to give his fans the best, his acting in those movies got better, more emotional and each movie was basically in different action tones.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2OTE1Njg4NjVeQTJeQWpwZ15BbWU3MDAyNjU4MDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000241","name":"Jean-Claude Van Damme","nicknames":["Muscles from Brussels","J.C."],"idIMDB":"nm0000241"},"actorId":"nm0000241","character":"Gibson Rickenbacker","urlCharacter":"http://www.imdb.com/character/ch0038994","main":true},{"actorName":"Deborah Richter","urlProfile":"http://www.imdb.com/name/nm0725223","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMDQzOTg0NV5BMl5BanBnXkFtZTgwOTEzOTEzMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"September1961","placeOfBirth":"","bio":"Deborah Richter was born in September 1961. She is an actress and writer, known for Cyborg (1989), Promised Land (1987) and Square Dance (1987). She was previously married to Charles Haid.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMDQzOTg0NV5BMl5BanBnXkFtZTgwOTEzOTEzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0725223","name":"Deborah Richter","idIMDB":"nm0725223"},"actorId":"nm0725223","character":"Nady Simmons","urlCharacter":"http://www.imdb.com/character/ch0222465","main":true},{"actorName":"Vincent Klyn","urlProfile":"http://www.imdb.com/name/nm0460288","urlPhoto":"","biography":{"dateOfBirth":"30 June 1960","placeOfBirth":" New Zealand","height":"6' 2\" (1.88 m)","bio":"Before moving to Hawaii at the age of four, Vincent Klyn was born in New Zealand. He began surfing at a very young age and was already on the Pro Circuit by age 13. In the mid 80s, he was on the World Wide Surf Tour as one of the top five surfers in the world and as a result, received many endorsements. In the late 80s he was spotted by filmmaker Albert Pyun and played the role of Fender Tremelo in the movie Cyborg (1989) also starring Jean Claude Van Damme.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0460288","name":"Vincent Klyn","idIMDB":"nm0460288"},"actorId":"nm0460288","character":"Fender Tremolo","urlCharacter":"http://www.imdb.com/character/ch0222466","main":true},{"actorName":"Alex Daniels","urlProfile":"http://www.imdb.com/name/nm0199830","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NjE4Mzc3Nl5BMl5BanBnXkFtZTYwMjgzNzgy._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1956","placeOfBirth":" Columbia, South Carolina, USA","birthName":"Charles Alexander Daniels","height":"6' 1\" (1.85 m)","bio":"Alex Daniels was born on March 4, 1956 in Columbia, South Carolina, USA as Charles Alexander Daniels. He is known for his work on Star Trek: The Next Generation (1987), Sphere (1998) and Pearl Harbor (2001). He has been married to Carolyn Sapp Daniels since January 1, 2006. They have three children. He was previously married to Denise Daniels.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NjE4Mzc3Nl5BMl5BanBnXkFtZTYwMjgzNzgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0199830","name":"Alex Daniels","idIMDB":"nm0199830"},"actorId":"nm0199830","character":"Marshall Strat","urlCharacter":"http://www.imdb.com/character/ch0222467","main":true},{"actorName":"Dayle Haddon","urlProfile":"http://www.imdb.com/name/nm0352731","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU1OTMyMzExNF5BMl5BanBnXkFtZTcwMTAzMzMwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1949","placeOfBirth":" Montréal, Québec, Canada","height":"5' 7\" (1.7 m)","bio":"Dayle was born and raised in Toronto, Canada. As a child she was enrolled in dancing classes to develop her physique. It worked well enough that she became a member of Les Grands Ballets Canadiens at 13 and Miss Montreal at 18. Her elfin good looks provided an easy entree to modeling and she quickly became a highly successful fashion model. She moved to Hollywood in her early twenties to be with a boyfriend and decided to try out for movies. She quickly landed a role in a Disney movie The World's Greatest Athlete (1973). Disney saw her a future for her in ingenue roles, but Dayle had other ideas. To Disney's shock, she promptly did a nude pictorial in '\"Playboy\" (USA)', took off for Europe and landed a string of steamy roles. Her best known role is in Just Jaeckin's The French Woman (1977). She has worked primarily in Europe, cropping up occasionally in small roles in American movies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODU1OTMyMzExNF5BMl5BanBnXkFtZTcwMTAzMzMwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0352731","name":"Dayle Haddon","idIMDB":"nm0352731"},"actorId":"nm0352731","character":"Pearl Prophet","urlCharacter":"http://www.imdb.com/character/ch0222468","main":true},{"actorName":"Blaise Loong","urlProfile":"http://www.imdb.com/name/nm1175986","urlPhoto":"","biography":{"bio":"Blaise Loong is known for his work on Cyborg (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1175986","name":"Blaise Loong","idIMDB":"nm1175986"},"actorId":"nm1175986","character":"Furman Vux / Pirate / Bandit","urlCharacter":"http://www.imdb.com/character/ch0222469","main":true},{"actorName":"Ralf Moeller","urlProfile":"http://www.imdb.com/name/nm0005241","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDkzNDQ1Mjg4Ml5BMl5BanBnXkFtZTgwNjU0NTc4OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 January 1959","placeOfBirth":" Recklinghausen, North Rhine-Westphalia, Germany","birthName":"Ralf Rudolf Möller","height":"6' 5½\" (1.97 m)","bio":"Ralf Rudolf Moeller (born on 12. January 1959) is a German-American actor and former Mr. Universe. He is well-known for his roles as Brick Bardo in Cyborg, Kjartan in The Viking Sagas, as hero in the TV series \"Conan the Adventurer\", Hagen in Gladiator, Thorak in The Scorpion King and Ulfar in Pathfinder - The Legend of the Ghost Warrior. Since 2014, Moeller is both a German and an American citizen. Moeller's first role came in 1988, in the German \"Tatort: Gebrochene Blüten,\" where he appeared alongside the German actors Götz George and Eberhard Feik. In the following year, Moeller appeared in Cyborg and in 1992 he had a role in Roland Emmerich's Universal Soldier, where he appeared alongside global stars Dolph Lundgren and Jean-Claude van Damme. One year later, in 1993, he played the role of the villain Brakus, the archenemy of Philip Rhee and Eric Roberts in \"Best of the Best 2 - the Unbeatable.\" After Cyborg and Universal Soldier, \"Best of the Best 2\" was his third role in an American movie and the second time he played a supporting role. His two most popular and biggest roles were in Ridley Scott's Gladiator (2000), in which he starred alongside Oscar-winner Russell Crowe as well as his role in The Scorpion King (2002). Aside from these two films, he also played the starring role in The Viking Sagas and in Conan the Adventurer. The series ran from 1997-1998 and told the story of Conan, who had been - accompanied by his three cronies - anointed by Crom to fight the evil Hissah Zul and to destroy it so that Conan could become the king, as had once been predicted to him. Ralf Moeller's acting career continued in the movie \"El pardino (2004),\" a continuation of the movie The Bad Pack. In the movie he played the role of special agent Kurt Mayers. In 2005, he had a role as Bruno alongside Rosanna Arquette in \"My Suicidal Sweetheart.\" In the movie \"Beerfest (2006)\" - which included actors Donald Sutherland and Jürgen Prochnow - Moeller played the role of Hammacher. That same year he appeared in the film \"Ozzie\", a movie in which greats like Joan Collins appeared. In addition, he played the role of warden Arnold Calgrove in the movie \"Seed.\" In 2007, \"Seed\" received an award for having the best special effects at the horror film festival in New York. \"Pathfinder\" followed in 2007 - and in \"Postal\" Ralf Moeller played the role of Officer John. In the following years, he appeared in \"Alone in the Dark II (2008)\"and \"Dejection (2009)\" before landing roles in \"The Sword and the Sorcerer II,\" \"Tales of an Ancient Heart\" as well as \"The Tourist\" - all in 2010. \"The Sword and the Sorcerer II\" received nominations in six categories. \"The Tourist\" (Johnny Depp, Angelina Jolie, Timothy Dalton and others) was honored with the ASCAP Award for best box office movie. He was also awarded the Teen Choice Award for the best action role. In 2014, Ralf Moeller appeared in \"Love, Hate & Security.\" Apart from these US movies, Ralf Moeller also had numerous (guest) roles in German productions. However, in the made-for-TV movie \"Der Superbulle und die Halbstarken\" (RTL, 2000; 4 million viewers) Ralf Moeller played the lead role. Even in the 2003 movie \"Hai Alarm auf Mallorca (Shark Attack on Mallorca)\", Moeller had the lead role. \"Shark Attack\" remains one of RTLs most successful productions over the course of many years (almost 7 million viewers). Aside from a guest role (Ferox) in \"Held der Gladiatoren (2003)\", Moeller also played the role of King Thorklit in \"Die Nibelungen\" that same year. In 2008, Moeller appeared in \"Far Cry,\" a German-Canadian co-production also featuring Til Schweiger. In \"Time of the Comet,\" he appeared as Freiherr von Keittel. Ralf Moeller also had roles in the TV series \"Die Küstenwache\" und \"Alarm für Cobra 11 - Die Autobahnpolizei.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDkzNDQ1Mjg4Ml5BMl5BanBnXkFtZTgwNjU0NTc4OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005241","name":"Ralf Moeller","idIMDB":"nm0005241"},"actorId":"nm0005241","character":"Brick Bardo","urlCharacter":"http://www.imdb.com/character/ch0020014","main":true},{"actorName":"Haley Peterson","urlProfile":"http://www.imdb.com/name/nm0677178","urlPhoto":"","biography":{"dateOfBirth":"9 June 1968","placeOfBirth":" North Carolina, USA","height":"5' 7\" (1.7 m)","bio":"Haley Peterson was born on June 9, 1968 in North Carolina, USA. She is an actress, known for Cyborg (1989). She is married to Dale. They have three children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0677178","name":"Haley Peterson","idIMDB":"nm0677178"},"actorId":"nm0677178","character":"Haley","urlCharacter":"http://www.imdb.com/character/ch0222472","main":true},{"actorName":"Terrie Batson","urlProfile":"http://www.imdb.com/name/nm0061251","urlPhoto":"","biography":{"height":"5' 7\" (1.7 m)","bio":"Terrie Batson began dancing at the age of 5 and began teaching at 15 for the Baldwin-Copeland Studio of Dance. She taught students of all ages Tap, Ballet, Jazz, Pointe, Clogging and Acrobatics. In 1989 Terrie moved to Atlanta and then to Raleigh where she taught dance classes at several studios. Upon her return to Wilmington, at age 26, she continued to instruct students privately for pageants and dance competitions. Under her instruction many dancers have won numerous awards, scholarships and recognition in the dance arena and some have opened their own dance schools. Her routines and dancers have been awarded regional & national honors for choreography, dance spirit, overall placements, grand championships, etc. In 1993 Ms. Terrie opened Techniques In Motion School of Dance in Wilmington, NC. Model, dancer and actress, Terrie Batson's diverse artistic career includes being a Runway and Print Model as well as featured in several area & National TV Commercials & National Print Ads. She has acted in major feature films including Mary in \"Cyborg\" with Jean Claude VanDamme, \"Teenage Mutant Ninja Turtles II, \"29th Street\" and in several Wilmington area Independent feature films. Her acting career also includes appearances in Television productions such as \"Young Indiana Jones\", \"In A Childs Name\", \"Bitter Blood\" and most recently in \"One Tree Hill\", and recent featured roles in Wilmington, NC film productions of \"The Gritters\" and \"Change\". Theatre productions include Thalian Hall Theatre productions of \"Chicago\", \"West Side Story\" and BrownCoat Theatre productions \"Namaste, Indiana\", \"Catastropolis\" and \"Monk's Brew\". She is starring in and reprising her role as \"Mary\" in the feature length film entitled \"Rise of the Slingers\" Cyborg Sequel directed by Albert Pyun and set to be filmed in Vancouver, Canada this fall.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0061251","name":"Terrie Batson","idIMDB":"nm0061251"},"actorId":"nm0061251","character":"Mary","urlCharacter":"http://www.imdb.com/character/ch0222473","main":true},{"actorName":"Jackson 'Rock' Pinckney","urlProfile":"http://www.imdb.com/name/nm0683896","urlPhoto":"","biography":{"bio":"Jackson 'Rock' Pinckney is an actor, known for Cyborg (1989) and Chasers (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0683896","name":"Jackson 'Rock' Pinckney","idIMDB":"nm0683896"},"actorId":"nm0683896","character":"Tytus / Pirate / Bandit","urlCharacter":"http://www.imdb.com/character/ch0222474","main":true},{"actorName":"Janice Graser","urlProfile":"http://www.imdb.com/name/nm0335824","urlPhoto":"","biography":{"bio":"Janice Graser is an actress, known for Cyborg (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0335824","name":"Janice Graser","idIMDB":"nm0335824"},"actorId":"nm0335824","character":"Vorg","urlCharacter":"http://www.imdb.com/character/ch0222475","main":true},{"actorName":"Robert Pentz","urlProfile":"http://www.imdb.com/name/nm0672416","urlPhoto":"","biography":{"bio":"Robert Pentz is known for his work on Cyborg (1989), This World, Then the Fireworks (1997) and Burning Vengeance (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0672416","name":"Robert Pentz","idIMDB":"nm0672416"},"actorId":"nm0672416","character":"Base / Pirate / Bandit","urlCharacter":"http://www.imdb.com/character/ch0222476","main":true},{"actorName":"Sharon K. Tew","urlProfile":"http://www.imdb.com/name/nm0856692","urlPhoto":"","biography":{"bio":"Sharon K. Tew is an actress, known for Cyborg (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0856692","name":"Sharon K. Tew","idIMDB":"nm0856692"},"actorId":"nm0856692","character":"Prather / Pirate / Bandit","urlCharacter":"http://www.imdb.com/character/ch0222477","main":true},{"actorName":"Chuck Allen","urlProfile":"http://www.imdb.com/name/nm1740850","urlPhoto":"","biography":{"bio":"Chuck Allen is an actor, known for Cyborg (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1740850","name":"Chuck Allen","idIMDB":"nm1740850"},"actorId":"nm1740850","character":"Vondo / Pirate / Bandit","urlCharacter":"http://www.imdb.com/character/ch0222478","main":true},{"actorName":"Stefanos Miltsakakis","urlProfile":"http://www.imdb.com/name/nm0590719","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjgxMzc1ODktYzc4YS00YWFjLTk1MWEtMjVlOTk4Mjg3YTE3XkEyXkFqcGdeQXVyNzQ5MTQwMTI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Born in Greece. Stefanos Miltsakakis is a huge man, 220 lbs/100 kg. He has trained in Brazilian Jiu Jitsu and holds a 2-0-0 record on the tournament circuit. He won the World Vale Tudo Championships in 1999 and 2002 from Joe Charles and Mariano Mendoza. He is now a popular bad guy in action movies. He's a great fighter and unfortunately has to lose all fights since he's the bad guy. He has been in five movies with Jean Claude van Damme and also in a movie with Jet Li, The Master. He had his biggest role in Bloodsport 4 and proved to be great as a lead star with some cool fights.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjgxMzc1ODktYzc4YS00YWFjLTk1MWEtMjVlOTk4Mjg3YTE3XkEyXkFqcGdeQXVyNzQ5MTQwMTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0590719","name":"Stefanos Miltsakakis","idIMDB":"nm0590719"},"actorId":"nm0590719","character":"Xylo / Pirate / Bandit","urlCharacter":"http://www.imdb.com/character/ch0222479","main":true}],"seasons":[],"idIMDB":"tt0097138","urlIMDB":"http://www.imdb.com/title/tt0097138","business":{"budget":{"money":"$500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$3,179,811","country":"USA","day":"09","month":"04","year":"1989","remarks":"830 Screens"}],"gross":[{"money":"320,474","country":"West","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1988/\">1988</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 26 min (86 min)"],"soundMix":["Ultra Stereo"],"color":["Color (TVC)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.0","filmingLocations":[{"location":"Davis-Monthan Air Force Base, Tucson, Arizona, USA"}],"rated":"R","awards":[],"votes":"24,344","type":"Movie","companyCreditsSimple":[{"idCompany":"co0112851","name":"Cannon Entertainment"},{"idCompany":"co0206391","name":"Golan-Globus Productions"}],"keywords":{"keywords":["plague","pirate","cyborg","mercenary","vengeance","electronic music score","left for dead","wasteland","dark hero","one man army","cult film","slow motion scene","post apocalypse","low budget film","crucifixion","independent film","martial artist","future","pursuit","new york city","loss of loved one","beating","marsh","heavy rain","sunglasses","arson","paintball gun","rain","woman kills woman","knocked out","grey eyes","cockroach","female attempts to seduce male","breasts","modern day crucifixion","brutality","rage","well","barbed wire","charleston south carolina","opening action scene","punched in the ribs","kickboxing","bow and arrow","vigilante","fistfight","stabbed with a stick","female cyborg","foot chase","south carolina","manhunt","ambush","forest","boat","hand to hand combat","karate","showdown","pirate ship","sewer","kicked in the face","hit on the head","skinny dipping","female rear nudity","beach","severed hand","gore","ponytail","blood","catfight","brawl","duel","spear","sword fight","stop motion scene","bare chested male","stabbed in the stomach","telephoto lens","murder","murder of family","martial arts","gun","flashback","death","female nudity","stabbed in the chest","knife","knife fight","knife in shoe","atlanta georgia","crotch grab","crossbow","kukri dagger","lightning","reverse footage","impalement","severed head","violence","decapitation","hit in the crotch","throat slitting","compound bow","girl fight","sword"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 01:54:25"}}