{"data":{"movies":[{"title":"The Horn Blows at Midnight","originalTitle":"","year":"1945","releaseDate":"19450428","directors":[{"name":"Raoul Walsh","id":"nm0909825"}],"writers":[{"name":"Sam Hellman","id":"nm0375500"},{"name":"James V. Kern","id":"nm0449462"}],"runtime":"78 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxNTgyNzkxNDheQTJeQWpwZ15BbWU3MDQ0OTgzMjE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Fantasy","Music"],"plot":"Falling asleep during the Paradise Coffee (\"The Coffee that Makes You Sleep\") Program, the band's third trumpeter dreams he's Athanael, an angel deputized to blow the Last Trumpet at exactly midnight on Earth. But Osidro and Doremus, two fallen angels enjoying the physical pleasures of an earthly existence, try to steal Athanael's trumpet, enlisting the aid of suave jewel thief Archie Dexter. Athanael fumbles his first try when he saves Archie's accomplice, Fran, from suicide. His second chance seems doomed when he's forced to leave his trumpet as security for a meal he can't pay for. But he gets it back just in time for a final confrontation with his desperate adversaries, dangling with them from the roof, only seconds from Midnight.","simplePlot":"Falling asleep during the Paradise Coffee (\"The Coffee that Makes You Sleep\") Program, the band's third trumpeter dreams he's Athanael, an angel deputized to blow the Last Trumpet at ... ","actors":[{"actorName":"Jack Benny","urlProfile":"http://www.imdb.com/name/nm0000912","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwODk0MzE2MF5BMl5BanBnXkFtZTcwOTQ2NjMyNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1894","placeOfBirth":" Chicago, Illinois, USA","birthName":"Benjamin Kubelsky","height":"5' 8½\" (1.74 m)","bio":"The son of a saloonkeeper, Jack Benny (born Benny Kubelsky) began to study the violin at the age six, and his \"ineptness\" at it later become his trademark (in reality, he was a very accomplished player). When given the opportunity to play in live theatre professionally, Benny quit school and joined vaudeville. In the same theatre that Benny was working with were the very young The Marx Brothers. Their mother, Minnie Marx, wanted Benny to go on the road with them. However, this plan was foiled by his parents who would not let their 17-year-old son on the road. Having a successful vaudeville career, Benny also had a greater career on radio for \"The Jack Benny Program\". The show was one of the few successful radio programs that also became a successful television show. Benny also starred in several movies, including The Hollywood Revue of 1929 (1929), Broadway Melody of 1936 (1935), The Horn Blows at Midnight (1945) and George Washington Slept Here (1942), although he had much greater success on radio and on TV than he did on the big screen. He was good friends with Fred Allen, with whom he had a long-standing comic \"feud\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwODk0MzE2MF5BMl5BanBnXkFtZTcwOTQ2NjMyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000912","name":"Jack Benny","idIMDB":"nm0000912"},"actorId":"nm0000912","character":"Athanael","urlCharacter":"http://www.imdb.com/character/ch0404377","main":true},{"actorName":"Alexis Smith","urlProfile":"http://www.imdb.com/name/nm0807252","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMTk3NzI1Ml5BMl5BanBnXkFtZTcwOTE1NDkxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1921","placeOfBirth":" Penticton, British Columbia, Canada","birthName":"Gladys Smith","height":"5' 9\" (1.75 m)","bio":"Statuesque, smart Canadian-born Alexis Smith, with her blue/green eyes and a seductively husky voice, lent a touch of class to her leading ladies of the 1940s and 1950s. After her family moved to California, Alexis grew into a precocious talent, performing ballet in public by the age of thirteen, dancing to 'Carmen' at the Hollywood Bowl. She later graduated with a degree in drama from Los Angeles City College, having previously won an acting contest whilst still in high school. During a performance of a play on campus, she was spotted by a Warner Brothers talent scout and signed to a contract in 1941. Until the early 1950s she was paired with the top male stars in Hollywood, including Clark Gable, Humphrey Bogart, William Holden and Bing Crosby. While often simply decorative (as, for example, in Of Human Bondage (1946) and Stallion Road (1947)), stylishly attired by costume designers like Milo Anderson and Helen Rose in the most glamorous gowns, Alexis also proved to be a capable and spirited actress, in spite of relatively few opportunities to break out of the mold of \"the other woman\". At the beginning of her career the studio's publicity department touted Alexis, much to her chagrin, as the \"Dynamite Girl\". While she claimed in later years to have typecast herself, and that few of her assigned roles ever challenged her on any level, Alexis frequently enjoyed good critical reviews for many of her performances (she was also popular with directors and film crews, who appreciated her relaxed, professional manner on the set). To begin with, she was cast in two films with Errol Flynn (she would make a total of four films with him): Dive Bomber (1941) and the boxing drama Gentleman Jim (1942). Though decidedly second fiddle to both the action and the charismatic Flynn, Alexis made a good first impression as the fetching romantic interest. Her next performance, in The Constant Nymph (1943) opposite Charles Boyer, was described by a reviewer as an \"intelligent rendition\". Her biggest hit of the mid-1940s was as Cole Porter's wife in the inaccurate--but hugely successful--biopic Night and Day (1946). She also appeared in two \"noir\" films with Humphrey Bogart at his most menacing: the interesting and underrated Conflict (1945) and the excellent The Two Mrs. Carrolls (1947). As Clark Gable's wife in the gambling drama Any Number Can Play (1949), she was critically lauded as \"genuinely appealing\". In between there were also some conspicuous failures, in particular her somewhat stolid performance in the period drama The Woman in White (1948). She had little to do in Here Comes the Groom (1951) and The Turning Point (1952) and her best part in the 1950s, though small, was that of Carol Wharton in The Young Philadelphians (1959). During the 1960s Alexis took a sabbatical from the screen to appear on stage with her husband, actor Craig Stevens (her marriage, a rare Hollywood success, lasted 49 years) in \"Critic's Choice\", \"Cactus Flower\" and \"Mary, Mary\". She reserved her best acting for the stage, becoming the Tony Award-winning star of Stephen Sondheim's musical \"Follies\", in which she played Phyllis during the 1971 run on Broadway (which landed her on the cover of the May 3 issue of 'Time' Magazine) and at the Shubert Theatre in Los Angeles in 1972. In 1973 she played Sylvia Fowler in a revival of Clare Boothe Luce's \"The Women\" and was nominated for another Tony for her leading role of Lila Halliday in \"Platinum\" in 1979. On television Alexis was seen infrequently from the mid-'50s, sometimes appearing on the same show opposite her husband. She had a recurring role as the homicidal Lady Jessica Montfort in Dallas (1978) during the 1984 and 1990 seasons, and was nominated for an Emmy for a guest-starring role on Cheers (1982). It was fitting, or perhaps ironic, that her last film role, in The Age of Innocence (1993), was as a New York socialite, a type of character she had portrayed frequently in her heyday at Warners.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyMTk3NzI1Ml5BMl5BanBnXkFtZTcwOTE1NDkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0807252","name":"Alexis Smith","idIMDB":"nm0807252"},"actorId":"nm0807252","character":"Elizabeth","urlCharacter":"http://www.imdb.com/character/ch0450302","main":true},{"actorName":"Dolores Moran","urlProfile":"http://www.imdb.com/name/nm0602834","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE4OGQyZjAtY2YwZC00YmQyLTgzOWItNDQ3YjcyYjU0ZjMwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1926","placeOfBirth":" Stockton, California, USA","birthName":"Delores J. Moran","bio":"Better known for her scandalous private life than for her mild film input, the story goes that blonde, extremely well-endowed Dolores Moran was checked out at an annual Sacramento Elks Lodge picnic in 1941 by a Warner Brothers talent scout in the early 40s and a starlet was born. Born in Stockton, California in 1924, this bombshell looker, a one-time drive-in car hop, had started collecting beauty titles as a teen (\"Queen of the Butte County Fair\") by the time the major studio took notice of her and signed her up. The studio immediately promoted the darker-haired-now-platinum blonde as a WWII pin-up and her cover-girl appearances on magazines became a favorite with GI soldiers. From 1942 Dolores would start out as set decoration (including Yankee Doodle Dandy (1942)) and would typically be utilized in small, decorative film parts. She achieved a bit of distinction, or perhaps distraction, in a couple of larger roles -- Bette Davis and Miriam Hopkins' tearjerker Old Acquaintance (1943), Bogie and Bacall's To Have and Have Not (1944), and Jack Benny's The Horn Blows at Midnight (1945). Dolores' reputation of having affairs with married film heavyweights had already preceded her by the time the 22-year-old began dating 42-year-old producer Benedict Bogeaus, who was married to starlet Mimi Forsythe at the time. Bogeaus divorced his wife and married Moran in late 1946. Two years later Dolores bore him a son. Sadly, in 1952, Bogeaus' former wife committed suicide. Secondary roles followed for Moran with Too Young to Know (1945) and the film noir The Man I Love (1947). Dolores first worked with her producer/husband in the film Christmas Eve (1947). Her film career sagged after that as her Svengali-like husband insisted she appear strictly in his pictures from Johnny One-Eye (1950) and Count the Hours (1953) to her last as a burlesque queen in Silver Lode (1954), often giving her roles that showed off her \"bad girl\" image. In between she appeared on TV: \"Dangerous Assignment,\" \"My Hero\" and Mr. & Mrs. North\". The turbulent marriage of Dolores and Benedict finally came to an end in 1962. Moran decided to lay low after this and, as such, little was heard about her until newspapers reported her death from cancer at age 58 in 1982.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE4OGQyZjAtY2YwZC00YmQyLTgzOWItNDQ3YjcyYjU0ZjMwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0602834","name":"Dolores Moran","idIMDB":"nm0602834"},"actorId":"nm0602834","character":"Violinist / Fran Blackstone","urlCharacter":"http://www.imdb.com/character/ch0499613","main":true},{"actorName":"Allyn Joslyn","urlProfile":"http://www.imdb.com/name/nm0430870","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ5MDc4MDgxOF5BMl5BanBnXkFtZTgwMzk4Njc3MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 July 1901","placeOfBirth":" Milford, Pennsylvania, USA","height":"6' 0½\" (1.84 m)","bio":"Allyn Joslyn, the son of a Pennsylvania mining engineer, made his stage debut at 17. He was soon appearing regularly in Broadway productions, and headed for Hollywood in 1936, making his debut in They Won't Forget (1937). His nervous, at times dyspeptic demeanor and somewhat aristocratic looks fit in with the pompous, wealthy snobs he specialized in playing. Joslyn was also an extremely busy radio actor, performing on over 3,000 shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ5MDc4MDgxOF5BMl5BanBnXkFtZTgwMzk4Njc3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0430870","name":"Allyn Joslyn","idIMDB":"nm0430870"},"actorId":"nm0430870","character":"Second Trumpeter / Osidro","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Reginald Gardiner","urlProfile":"http://www.imdb.com/name/nm0306786","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNzQzMzQ2MV5BMl5BanBnXkFtZTcwOTY0NTY1Mg@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1903","placeOfBirth":" London, England, UK","birthName":"William Reginald Gardiner","bio":"English-born Reginald Gardiner graduated from the Royal Academy of Dramatic Arts and, by the early 1930's, had become an established revue and musical star on the London stage. His first foray into films was in the Alfred Hitchcock-directed The Lodger (1927) in 1926, but it was in Hollywood where his career really took off. At the prompting of Beatrice Lillie, he left for America in 1935. After appearing in two of her shows, he delighted Broadway audiences in \"An Evening with Beatrice Lillie and Reginald Gardiner\", performing a series of witty impersonations of various inanimate items, such as lighthouses and wallpaper. In 1936, he appeared in his first Hollywood film, Born to Dance (1936), with Eleanor Powell and James Stewart, as a traffic cop with symphonic delusions. His instant popularity resulted in other film offers, and Gardiner was soon in demand as butlers and \"silly ass\" upper-crust English twits. With his suave attire, thin moustache and obtuse mannerisms, he took to playing those caricatures with obvious glee. He enlivened many a film with his comic presence, notably A Damsel in Distress (1937), The Man Who Came to Dinner (1942)(his character \"Beverly Carlton\" brilliantly lampooning Noël Coward) - and Cluny Brown (1946). In later years, Gardiner was seen on television as co-star of The Phyllis Diller Show (1966), opposite Phyllis Diller. In 1964, he returned to the stage to play Alfred P. Doolittle, the role made famous by Stanley Holloway, in 'My Fair Lady' at the New York City Centre. John Canaday, reviewing for the New York Times, described his character as a \"wonderful, boozy, abominable, bug-ridden and altogether reprehensible charmer, a kind of defrocked Boy Scout, whose love for everybody is exceeded only by his propensity for chicanery and self-indulgence\". Reginald Gardiner was also celebrated for his classic monologue, simply called 'Trains', which so impressed King George VI that he summoned the actor to Buckingham Palace for a special performance. 'Trains' was recorded by Decca and has since become a collector's item.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNzQzMzQ2MV5BMl5BanBnXkFtZTcwOTY0NTY1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0306786","name":"Reginald Gardiner","idIMDB":"nm0306786"},"actorId":"nm0306786","character":"Composer / Archibald 'Archie' Dexter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Guy Kibbee","urlProfile":"http://www.imdb.com/name/nm0452128","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTZkNjAzZjItMzkyNC00NjFhLTlmNWItYmNhYTI4ODIyNDQ2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1882","placeOfBirth":" El Paso, Texas, USA","birthName":"Guy Bridges Kibbee","bio":"Beginning his show business career at age 13 as an entertainer on Mississippi riverboats, Guy Kibbee graduated to the legitimate stage and spent many years in the theater. In the 1930s he was signed by Warner Brothers, and became part of what was known as \"the Warner Brothers Stock Company\", a cadre of seasoned character actors and actresses who enlivened many a Warners musical or gangster film. Kibbee specialized in playing jovial, but not particularly bright, businessmen and government officials. He was memorable as the stuffy lawyer with a secret weakness for showgirls in Gold Diggers of 1933 (1933).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTZkNjAzZjItMzkyNC00NjFhLTlmNWItYmNhYTI4ODIyNDQ2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0452128","name":"Guy Kibbee","idIMDB":"nm0452128"},"actorId":"nm0452128","character":"Radio Director / The Chief","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Alexander","urlProfile":"http://www.imdb.com/name/nm0018514","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzgxZWFhMjAtNWU1NS00ZTQwLWIyMmItMDQ3N2JmNDBmOWY1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1897","placeOfBirth":" Newport, Kentucky, USA","height":"5' 10½\" (1.79 m)","bio":"Making his stage debut at age 16, John Alexander joined a Shakespearean repertory company and in 1917 appeared on Broadway in \"The Merchant of Venice.\" Although he played many parts on both stage and in films, his best known role was that of the crazed Teddy Brewster--the son who thinks he's Theodore Roosevelt - in Arsenic and Old Lace (1944), a part he played both on stage and in the movie.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzgxZWFhMjAtNWU1NS00ZTQwLWIyMmItMDQ3N2JmNDBmOWY1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0018514","name":"John Alexander","idIMDB":"nm0018514"},"actorId":"nm0018514","character":"First Trumpeter / Doremus","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Franklin Pangborn","urlProfile":"http://www.imdb.com/name/nm0659427","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NTM3MTc3MF5BMl5BanBnXkFtZTgwOTgzODE1MzE@._V1._CR114,136,541,718_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1889","placeOfBirth":" Newark, New Jersey, USA","birthName":"Joseph Franklin Pangborn","height":"5' 10½\" (1.79 m)","bio":"Franklin Pangborn - a name more befitting a fictionalized bank president rather than a great comedic actor - was a singular character actor but little is known of his early years. He spent some time in developing acting talent prior to appearing on Broadway by March of 1911, and would do six plays until mid-1913. He was noticeably absent afterward and corresponding with the early years of World War I. He was in the US Army after America entered the war in 1917. Pangborn did one more play on Broadway in 1924. Interestingly, for someone immediately identified with comedy, Pangborn's roles were for the most part dramatic and included Armand Duval in \"Camille\", a role in a play adaptation of \"Ben Hur\", and two parts in \"Joseph and His Brethren\". Two years later, Pangborn turned to silent films. And although he would play some villains and romantic leads, that droopy pudding-face of his was bound for comedy. In all these early roles from his debut in 1926, his first talkie (On Trial (1928)), and on through most of 1932 (when he made 24 appearances on film), Pangborn was playing comedic roles, many of which were for short films (many by Mack Sennett) where the players usually had no on-screen persona and no billing credit. His many appearances in shorts tapered off and ended through 1935. These roles were quite varied and continued as such into the later 1930s. He played the compromised husband in two Bing Crosby vehicles (1933); no fewer than three photographers, reporters, radio announcers, bartenders, and much more, including a character meant to parody his own name: 'Mr. Pingboom' (Turnabout (1940)). But through the same period he was piling up a lot of clerk, floorwalker, and, perhaps most of all, hotel manager roles. These latter were the basis for Pangborn typed as the straight-laced, nervous minor official or service provider or manager of whatever whose smug self-assurance in his orderly world is sorely tested. The term 'sissy' (so prominent a condemnation from childhood memories) was used in early film (and still used today by some film historians) as a catchall name for a spectrum of rather gentle and nebulous male personalities; a simpering voice of any kind would be an instant label that also implied the taboo of homosexuality. Pangborn is often first on the list of actors noted as typed in this general category with Edward Everett Horton with his dignified but slightly simpering New England drawl a close second. Animator Robert Clampett at Warner Bros. in the late 1940s patterned his Goofy Gophers, Mac and Tosh, with their polite and flowery speech after both men. Pangborn had a mellow, lyrical voice which he could ramp up to a staccato, rapid-fire rhythm when perturbed. Indeed, the face and the voice fit well with characters of convention and control, as well as the fastidious to the point of being another slang term of many faces: 'prissy'. And maybe that does not include effeminate - he was not quite that - though the term is indelibly tagged to the character type. His characters were the sort of proper and snobby figures who the easygoing American public would find suspicious - and thus all the funnier on screen when they get their comeuppance. Yet Pangborn never implied 'gay' in his portrayals despite all the gender revisionism of today that might reinterpret his work as such. In real life, people are more complex; on the mainstream screen - as opposed to the shadowy blue one - of the 1930s and 40s, characters were more generally defined within usual convention. By the later 1930s, Pangborn had perfected a wonderful sense of timing of demeanor, manner, and voice to fit the control freak who is gradually dragged into his worst nightmare of relative chaos by hapless situation. By this time his characterizations were such a fixture of guaranteed laughs that the movie-going public expected to see him. Pangborn was in great demand to do what he did best. And having already worked from the silent era with great stars and directors, he continued to do so. W.C. Fields was a great fan of him and used him in several movies. He was a constant in smart comedy from Frank Capra and Gregory La Cava to the more extreme screwball comedies of Preston Sturges, though frequently upstaged with such a company of funny men as Sturges gathered around him. The Pangborn progression from very funny to uproarious is seen evolved, for example, from De Cava's My Man Godfrey (1936) to Sturges's Hail the Conquering Hero (1944). In the first he is the volunteer swell who coordinates store-keeping for the scavenger hunt of his fellow - if downright silly - affluent crust of New York society. As the flow of items brought to him for registering turns into a flood (including a live goat kid), his demeanor, mannerisms, and vocal speed display increasing irritation. Head spinning, he is in defensive mode as he fends off shouting, grabbing participants. The role perhaps was his defining moment as established celebrity comedian. In Sturges's movie, and Pangborn appeared in most of his best efforts, he is the committee chairman of the reception for false hero Eddie Bracken, trying to coordinate festivities and caught in a literal battle of bands at the beginning of the film. Converged upon by various hokey town bands who all want to play the featured pieces, Pangborn attempts order but is methodically carried away as people out of the blue arrive to suggest other songs, and the bands continue to assail him with arguments, and finally all play all the songs - and all at once - to prove the most deserving. It is musical chaos with Pangborn finally reduced to desperate blasts on a whistle and jumping up and down, yelling \"Not yet! Not yet!\" It is one of the actor's finest pieces. Yet Pangborn's usual stock of characters could fit drama as well. Actually, in \"Hero\", his coordinator also has some straight scenes as well. In Now, Voyager (1942) as the cruise tourist director, his only problem is that Bette Davis has not arrived on deck to be partnered for the land touring of Rio. As an accomplished stage actor, he did miss the boards. Friend of Edward Horton, he was able to exchange his quirky screen characters for dramatic ones, participating in Horton's Los Angeles-based Majestic Theatre productions. But times changed for Pangborn's specialties. Movies were more diverse and updated as the 1950s ensued. But he was immediately adaptable to the small screen which would re-introduce him. He was right at home as a guest star on TV comedy shows, playing his beloved characters as cameo celebrations of his matter-of-fact stardom. There were a handful of film roles in his last decade with perhaps the overambitious and black-and-white dull but star-studded The Story of Mankind (1957) a bit of a showcase. Also in 1957 he had the singular distinction of being honored as guest announcer - a familiar enough role - and first guest star on the premiere of the \"Tonight Show\" with its first host Jack Paar. To pass away after surgery seems such a disordered way to go for one such as Franklin Pangborn whose on-screen characters struggled for order above all else. There is no order in the frailty of life by definition, but Pangborn's legacy, rich in comedic gems, has and surely will continue to endure.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NTM3MTc3MF5BMl5BanBnXkFtZTgwOTgzODE1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0659427","name":"Franklin Pangborn","idIMDB":"nm0659427"},"actorId":"nm0659427","character":"Radio Engineer / Sloan - House Detective","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Margaret Dumont","urlProfile":"http://www.imdb.com/name/nm0241669","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NjA4NjY3Nl5BMl5BanBnXkFtZTgwODAzODY3MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1882","placeOfBirth":" Brooklyn [now in New York City], New York, USA","birthName":"Daisy Juliette Baker","height":"5' 9\" (1.75 m)","bio":"Margaret Dumont would probably consider it a tragedy that she is best-known for her performances as the ultimate straight woman in seven of the Marx Brothers' films (including most of their best). By all accounts she never understood their jokes (offscreen and on), which is of course a major reason why she's so funny. Apart from a small role in a 1917 Dickens adaptation, she spent her early career on the stage, ending up with the Marxes in the late 1920s in the stage versions of The Cocoanuts (1929) and Animal Crackers (1930), and was given a Paramount contract at the same time they were. She played similar roles alongside other great comedians, including W.C. Fields, Laurel & Hardy and Jack Benny and also played straight dramatic parts (her chief love), but few of them made much impact - it is as Groucho Marx's foil that she ranks among the immortals, and she died shortly after being reunited with him on The Hollywood Palace (1964).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NjA4NjY3Nl5BMl5BanBnXkFtZTgwODAzODY3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0241669","name":"Margaret Dumont","idIMDB":"nm0241669"},"actorId":"nm0241669","character":"Mme. Traviata / Miss Rodholder","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Blake","urlProfile":"http://www.imdb.com/name/nm0086706","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MDI0OTc0NF5BMl5BanBnXkFtZTYwNjk3ODU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1933","placeOfBirth":" Nutley, New Jersey, USA","birthName":"Michael James Gubitosi","height":"5' 4\" (1.63 m)","bio":"American actor who began as a child in Our Gang comedies and reappeared as a powerful adult performer of leading and character roles. Born in New Jersey, the young Mickey Gubitosi won a role in MGM's Our Gang series at the age of 5. As one of the more prominent children in the Gang, he gained attention for his cute good looks and his lovable, if somewhat melancholy, personality. In 1940 he took on the stage name Bobby Blake (though he continued to use the name Mickey Gubitosi in the Our Gang series for another three years) and began playing child roles in a wide range of films. He gained a good deal of fame as the Indian sidekick Little Beaver in the Red Ryder series of Westerns. Though roles were sporadic as he grew to manhood, he was never long off the screen (except for a period of military service, 1954-56). But despite some fine work in films like Pork Chop Hill (1959) and Town Without Pity (1961), his career did not take off until his stunning portrayal of killer Perry Smith in In Cold Blood (1967). A number of telling performances in films of the next decade, stardom in a popular television series (Baretta (1975), and several ruefully comic appearances as a guest on The Tonight Show Starring Johnny Carson (1962) made him a popular figure even as his personal difficulties increased. Consumed with anger over his treatment by his family and the studio as a child, he denigrated his early work, suffered bouts of difficulty with drugs, and became known as a difficult, perfectionist person to work with. He quit his successful TV series Hell Town (1985) when his personal demons became overwhelming. After a self-imposed exile of nearly eight years, during which he struggled to right his life, he successfully returned to films and television work, appearing renewed and more confident in himself and his work. In 2001, though, the murder of his wife, Bonnie Bakley, thrust Blake into the limelight in a different way. Admittedly having married Bakley through the coercion of her pregnancy, a routine Bakley had apparently tried with various other celebrities, Blake made no denial of his distaste for the woman, but was by all accounts thrilled with the daughter born to them. Blake was arrested for his wife's murder, but the presumption of innocence trumped what jurors believed to be flimsy evidence, and Blake was acquitted in a trial that made worldwide headlines. Reportedly broke from legal costs, Blake indicated hopefulness that he might be allowed to return to acting work.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MDI0OTc0NF5BMl5BanBnXkFtZTYwNjk3ODU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0086706","name":"Robert Blake","nicknames":["Mickey","Bobby"],"idIMDB":"nm0086706"},"actorId":"nm0086706","character":"Junior Poplinski","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ethel Griffies","urlProfile":"http://www.imdb.com/name/nm0341100","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2ODA1NTMyMF5BMl5BanBnXkFtZTcwNzkxNTAxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1878","placeOfBirth":" Sheffield, Yorkshire, England, UK","birthName":"Daisy Ethel Griffies Woods","height":"5' 6\" (1.68 m)","bio":"The daughter of actor-manager Samuel Rupert Woods and actress Lillie Roberts, Ethel Griffies began her own stage career at the age of 3. She was 21 when she finally made her London debut in 1899, and 46 when she made her first Broadway appearance in \"Havoc\" (1924). Discounting a tentative stab at filmmaking in 1917, she made her movie bow in 1930, repeating her stage role in Old English (1930). Habitually cast as a crotchety old lady with the proverbial golden heart, she alternated between bits and prominently featured roles for the next 35 years. Her larger parts included Grace Poole in both the 1934 (Jane Eyre (1934)) and 1943 (Jane Eyre (1943)) versions of \"Jane Eyre\" and \"Mrs. Bundy\", the amateur ornithologist in Alfred Hitchcock's The Birds (1963). Every so often she'd take a sabbatical from film work to concentrate on the stage; she made her last Broadway appearance in 1967, at which time she was England's oldest working actress. Presumably at the invitation of fellow Briton Arthur Treacher, Ethel was a frequent guest on TV's The Merv Griffin Show (1962), never failing to bring down the house with her wickedly witty comments on her 80 years in show business.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2ODA1NTMyMF5BMl5BanBnXkFtZTcwNzkxNTAxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0341100","name":"Ethel Griffies","idIMDB":"nm0341100"},"actorId":"nm0341100","character":"Lady Stover","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Harvey","urlProfile":"http://www.imdb.com/name/nm0367670","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE3NThhNzAtNTU1NS00ODZlLWI4MjAtZDMyNzFjZWUxNWY0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1882","placeOfBirth":" Sandwich, Illinois, USA","birthName":"Roy Paul Harvey","height":"6' 2\" (1.88 m)","bio":"Paul Harvey was born on September 10, 1882 in Sandwich, Illinois, USA as Roy Paul Harvey. He was an actor, known for Spellbound (1945), Calamity Jane (1953) and Father's Little Dividend (1951). He was married to Ottye Henrietta Cramer (actress) and Merle Stanton. He died on December 15, 1955 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE3NThhNzAtNTU1NS00ODZlLWI4MjAtZDMyNzFjZWUxNWY0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0367670","name":"Paul Harvey","idIMDB":"nm0367670"},"actorId":"nm0367670","character":"Hotel Manager Thompson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mike Mazurki","urlProfile":"http://www.imdb.com/name/nm0563417","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTQzMzkwMl5BMl5BanBnXkFtZTYwNjgwMTU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1907","placeOfBirth":" Tarnopol, Galicia, Austria-Hungary [now Ternopil, Ukraine]","birthName":"Michail Mazuruski","height":"6' 4¾\" (1.95 m)","bio":"With an intimidating face like craggy granite and a towering 6'5\" solid frame, Mike Mazurki (born Mikhail Mazuruski or Mikhail Mazurkiewicz) was one of cinema's first serial thugs and specialized in playing strongarm men, gangsters and bullies for over 50 years on screen. Nearly always portrayed as a lowbrow muscle, in real life Mazurski was highly intelligent, very well read and a witty conversationalist. He was also an accomplished sportsman, having been a football player and a professional wrestler. He first appeared onscreen in uncredited roles in films such as Gentleman Jim (1942) and About Face (1942); however, his daunting bruiser looks were soon noticed and he became phenomenally busy in the 1940s, appearing in nearly 50 movies during the decade, including his well remembered performance as ex-con \"Moose Malloy\" in the film noir thriller Murder, My Sweet (1944) and as the gruesome \"Splitface\" in Dick Tracy (1945). He continued his menacing onscreen presence throughout the 1950s and 1960s, often showing he could be quite adept at deadpan comedy in films including Bud Abbott and Lou Costello in Hollywood (1945), It's a Mad Mad Mad Mad World (1963), Donovan's Reef (1963) and The Adventures of Bullwhip Griffin (1967). Demand for his talents slowed down in the late 1970s and most of the 1980s, as younger villains came to the fore; however, he still turned up in support roles and was still acting at the age of 83 when he passed away in December, 1990.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNTQzMzkwMl5BMl5BanBnXkFtZTYwNjgwMTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0563417","name":"Mike Mazurki","idIMDB":"nm0563417"},"actorId":"nm0563417","character":"Bass Player / Humphrey Rafferty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Truman Bradley","urlProfile":"http://www.imdb.com/name/nm0103423","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWJjMDI0NzgtODA4MS00YzRjLTkyOGQtOGQ2MTFmMmQwMDEyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1905","placeOfBirth":" Sheldon, Missouri, USA","bio":"Truman Bradley was born on February 8, 1905 in Sheldon, Missouri, USA. He was an actor, known for Science Fiction Theatre (1955), America the Beautiful (1945) and Northwest Passage (1940). He died on July 28, 1974 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWJjMDI0NzgtODA4MS00YzRjLTkyOGQtOGQ2MTFmMmQwMDEyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0103423","name":"Truman Bradley","idIMDB":"nm0103423"},"actorId":"nm0103423","character":"Radio Announcer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Alvin","urlProfile":"http://www.imdb.com/name/nm0023569","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmYwNDI1YjItMTI1YS00ZWVjLTkxMjgtNDA5NTk0YWQzYTdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 October 1917","placeOfBirth":" Chicago, Illinois, USA","birthName":"John Alvin Hoffstadt","bio":"John Alvin was born on October 24, 1917 in Chicago, Illinois, USA as John Alvin Hoffstadt. He was an actor, known for Somewhere in Time (1980), Objective, Burma! (1945) and Irma la Douce (1963). He was married to Betty June Lewis. He died on February 27, 2009 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmYwNDI1YjItMTI1YS00ZWVjLTkxMjgtNDA5NTk0YWQzYTdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0023569","name":"John Alvin","idIMDB":"nm0023569"},"actorId":"nm0023569","character":"Angel","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0037790","urlIMDB":"http://www.imdb.com/title/tt0037790","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":null,"copyrightHolder":"© Warner Bros. Pictures, Inc.; 28 April 1945; LP13228 (in copyright registry)"},"technical":{"runtime":["1 hr 18 min (78 min)","1 hr 20 min (80 min) (original cut)"],"soundMix":["Mono (RCA Sound System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.8","filmingLocations":[{"location":"Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA"}],"rated":"APPROVED","awards":[{"award":"Hugo Awards 1946","titlesAwards":[{"titleAwardOutcome":"Nominated Hugo","categories":[{"category":"Best Dramatic Presentation","names":[{"name":"Raoul Walsh","id":"nm0909825","role":"director"},{"name":"Sam Hellman","id":"nm0375500","role":"written by"},{"name":"James V. Kern","id":"nm0449462","role":"written by"}]}]}]}],"votes":"956","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."}],"keywords":{"keywords":["trumpet","angel","midnight","coffee","band","thief","trumpeter","fallen angel","manhattan new york city","womanizer","waiter","violin","umbrella","u.s. sailor","twinge","tuba","trumpet player","travelling through a tube","ticket agent","theft","telegram delivery man","swing shift","swing music","suicide threat","sugar","stranger in a strange land","spoon","spasm","snoring","sleeping","slang","shot from a cannon","seduction","saving a life","safety net","rooftop","rolling body","rocket","rocket man","restaurant","reference to saint vitus","reference to paderewski","reference to methuselah","reference to julius caesar","reference to george washington","radio studio","radio contest","pursuit","promotion","prayer","police","policeman","planet earth","picnic","pickle","piano","photograph","photographer","pearl necklace","party","pacing","orchestra conductor","oboe","new york city","musician","money","microphone","love","love triangle","landing in a haystack on a truck","kicked in the face","judgment day","jealousy","hypnosis","house detective","hotel","hotel manager","hotel lobby","hotel desk clerk","hit with an umbrella","hit on the head with a ball","hit in the face with a trumpet","herring","henchman","headwaiter","harp","harpist","hanging from height","hanging from a flagpole","hanging by suspenders","hand kissing","girdle","game playing","french horn","food","flute","flowers","father son relationship","falling into coffee","falling into a hole","eavesdropping","eavesdropping at door","drunkenness","drums","drink","drinking","dollar","death","daredevil","dancing","dancer","dance hall","crying","cry for help","cook","commercial","coffee pot","clock tower","clarinet","cigarette smoking","cigar smoking","choir director","chase","cash register","carnegie hall manhattan new york city","camera","cafe","bugle","boyfriend girlfriend relationship","billboard","bellhop","banana split","baby","baby talk","applause","apocalypse","announcer","amusement park","african american","1940s","thug","temptation","orchestra","musical acts","jitterbug","falling from height","elevator","clock","cigarette girl","heaven","advertisement","radio program","dream sequence","angel on earth"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:20:17"}}