{"data":{"movies":[{"title":"Halloween II","originalTitle":"","year":"1981","releaseDate":"19811030","directors":[{"name":"Rick Rosenthal","id":"nm0742819"}],"writers":[{"name":"John Carpenter","id":"nm0000118"},{"name":"Debra Hill","id":"nm0384185"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjZmYjg0ODctOTIyYy00YzhkLTgyMzEtNjUyY2JiZjVmYzI2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror"],"plot":"In a continuation of the plot of Halloween, Michael Myers shows off his indestructability by resuming his murder spree despite being gunned down with six bullets in the original movie. Laurie Strode is once more his intended victim, with Dr. Sam Loomis again in hot pursuit.","simplePlot":"While Sheriff Brackett and Dr. Loomis hunt for Michael Myers, a traumatized Laurie is rushed to hospital, and the serial killer is not far behind her.","actors":[{"actorName":"Jamie Lee Curtis","urlProfile":"http://www.imdb.com/name/nm0000130","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MTI0MDk2OV5BMl5BanBnXkFtZTgwODQ4MTE0NDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 November 1958","placeOfBirth":" Los Angeles, California, USA","height":"5' 7\" (1.7 m)","bio":"Jamie Lee Curtis was born on November 22, 1958 in Los Angeles, California, the daughter of legendary actors Janet Leigh and Tony Curtis. She got her big break at acting in 1978 when she won the role of Laurie Strode in Halloween (1978). After that, she became famous for roles in movies like Trading Places (1983), Perfect (1985) and A Fish Called Wanda (1988). She starred in one of the biggest action films ever, True Lies (1994), for which she won a Golden Globe Award for her performance. Curtis also appeared on Buck Rogers in the 25th Century (1979), and starred in Death of a Centerfold: The Dorothy Stratten Story (1981) as the title role. Her first starring role was opposite Richard Lewis on the ABC situation comedy Anything But Love (1989). In 1998, she starred in Halloween H20: 20 Years Later (1998) in which she reprised her role that made her famous back in 1978. Her paternal grandparents were Hungarian Jewish immigrants, while two of her maternal great-grandparents were Danish.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MTI0MDk2OV5BMl5BanBnXkFtZTgwODQ4MTE0NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000130","name":"Jamie Lee Curtis","nicknames":["The Scream Queen","The Queen of Screams","The Body"],"idIMDB":"nm0000130"},"actorId":"nm0000130","character":"Laurie Strode","urlCharacter":"http://www.imdb.com/character/ch0003212","main":true},{"actorName":"Donald Pleasence","urlProfile":"http://www.imdb.com/name/nm0000587","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjYzNTQ2MV5BMl5BanBnXkFtZTcwMzA5MTkzNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1919","placeOfBirth":" Worksop, Nottinghamshire, England, UK","birthName":"Donald Henry Pleasence","height":"5' 6\" (1.68 m)","bio":"Balding, quietly-spoken, of slight build and possessed of piercing blue eyes -- often peering out from behind round, steel-rimmed glasses -- Donald Pleasence had the necessary physical attributes which make a great screen villain. In the course of his lengthy career, he relished playing the obsessed, the paranoid and the purely evil. Even the Van Helsing-like psychiatrist Sam Loomis in the Halloween (1978) franchise seems only marginally more balanced than his prey. An actor of great intensity, Pleasence excelled on stage as Shakespearean villains. He was an unrelenting prosecutor in Jean Anouilh's \"Poor Bitos\" and made his theatrical reputation in the title role of the seedy, scheming tramp in Harold Pinter's \"The Caretaker\" (1960). On screen, he gave a perfectly plausible interpretation of the head of the SS, Heinrich Himmler, in The Eagle Has Landed (1976). He was a convincingly devious Thomas Cromwell in Henry VIII and His Six Wives (1972), disturbing in his portrayal of the crazed, bloodthirsty preacher Quint in Will Penny (1967); and as sexually depraved, alcohol-sodden 'Doc' Tydon in the brilliant Aussie outback drama Wake in Fright (1971). And, of course, he was Ernst Stavro Blofeld in You Only Live Twice (1967). These are some of the films, for which we may remember Pleasence, but there was a great deal more to this fabulous, multi-faceted actor. Donald Henry Pleasence was born on October 5, 1919 in Worksop, Nottinghamshire, England, to Alice (Armitage) and Thomas Stanley Pleasence. His family worked on the railway; his grandfather had been a signal man and both his brother and father were station masters. When Donald failed to get a scholarship at RADA, he joined the family occupation working as a clerk at his father's station before becoming station master at Swinton, Yorkshire. While there he wrote letters to theatre companies eventually being accepted by one on the island of Jersey in Spring 1939 as an assistant stage manager. On the eve of World War II, he made his theatrical debut in \"Wuthering Heights\". In 1942, he played Curio in \"Twelfth Night\", but his career was then interrupted by military service in the RAF. He was shot down over France, incarcerated and tortured in a German POW camp. Once repatriated, Donald returned to the stage in Peter Brook's 1946 London production of \"The Brothers Karamazov\" with Alec Guinness although he missed the opening due to measles, followed by a stint on Broadway with Laurence Olivier's touring company in \"Caesar and Cleopatra\" and \"Anthony and Cleopatra\". Upon his return to England, he won critical plaudits for his performance in \"Hobson's Choice\". In 1952, Donald began his screen career, rather unobtrusively, in small parts. He was only really noticed once having found his métier as dastardly, sneaky Prince John in The Adventures of Robin Hood (1955). It took several more years, until international recognition came his way: first, through the filmed adaptation of The Guest (1963); and, secondly, with his blind forger in The Great Escape (1963), a role imbued with added conviction due to his own wartime experience. Some of his best acting Donald reserved for the small screen. In 1962, the producer of The Twilight Zone (1959), Buck Houghton, brought Donald to the United States ('damn the expense'!) to guest star in the third season episode \"The Changing of the Guard\". He was given a mere five days to immerse himself in the part of a gentle school teacher, Professor Ellis Fowler, who, on the eve of Christmas is forcibly retired after fifty-one years of teaching. Devastated, and believing himself a failure who has made no mark on the world, he is about to commit suicide when the school's bell summons him to his classroom. There, he is confronted by the spirits of deceased students who exhort him to consider that his lessons have had fundamental effects on their lives, even leading to acts of great heroism. Upon hearing this, Fowler is now content to graciously accept his retirement. Managing to avoid maudlin sentimentality, Donald's performance was intuitive and, arguably, one of the most poignant ever accomplished in a thirty-minute television episode. Once again, against type, he was equally delightful as the mild-mannered Reverend Septimus Harding in Anthony Trollope's The Barchester Chronicles (1982). Whether eccentric, sinister or given to pathos, Donald Pleasence was always great value-for-money and his performances have rarely failed to engage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMjYzNTQ2MV5BMl5BanBnXkFtZTcwMzA5MTkzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000587","name":"Donald Pleasence","idIMDB":"nm0000587"},"actorId":"nm0000587","character":"Sam Loomis","urlCharacter":"http://www.imdb.com/character/ch0003219","main":true},{"actorName":"Charles Cyphers","urlProfile":"http://www.imdb.com/name/nm0194234","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MTQyMjI3OF5BMl5BanBnXkFtZTcwMDQ1MTgwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 July 1939","placeOfBirth":" Niagara Falls, New York, USA","height":"5' 10\" (1.78 m)","bio":"Charles is a graduate of the American Academy of Dramatic Arts. He also took drama classes at Los Angeles City College and is a graduate of Cal. State at LA, receiving his BA in theatre arts. Aside from his many film and tv credits he is especially proud of his body of work in the LA theatre. He was a member of the company of angels for 25 years. He is a recipient of the Los Angeles Drama Critics Award for best performance by an actor for his role in The Caretaker and a dramalogue award for best performance by an actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MTQyMjI3OF5BMl5BanBnXkFtZTcwMDQ1MTgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0194234","name":"Charles Cyphers","idIMDB":"nm0194234"},"actorId":"nm0194234","character":"Leigh Brackett","urlCharacter":"http://www.imdb.com/character/ch0003228","main":true},{"actorName":"Jeffrey Kramer","urlProfile":"http://www.imdb.com/name/nm0469552","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MTIwNjc1MV5BMl5BanBnXkFtZTcwNTU0ODcwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1945","placeOfBirth":" New York City, New York, USA","height":"5' 8\" (1.73 m)","bio":"Jeffrey Kramer was born on July 15, 1945 in New York City, New York, USA. He is a producer and actor, known for Jaws (1975), The Practice (1997) and Ally McBeal (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MTIwNjc1MV5BMl5BanBnXkFtZTcwNTU0ODcwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0469552","name":"Jeffrey Kramer","idIMDB":"nm0469552"},"actorId":"nm0469552","character":"Graham","urlCharacter":"http://www.imdb.com/character/ch0131421","main":true},{"actorName":"Lance Guest","urlProfile":"http://www.imdb.com/name/nm0346411","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODEwMzczNF5BMl5BanBnXkFtZTgwMDY3NTIyMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 July 1960","placeOfBirth":" Saratoga, California, USA","birthName":"Lance R. Guest","height":"6' 3\" (1.91 m)","bio":"Lance Guest's family lived on an 11 acre prune ranch in the then-rural Saratoga, Ca for most of the 1950's. More than 10 years younger than his boomer siblings, Lance was born in 1960, when his father, a Navy fighter pilot, moved the family to a larger house with running water. At a young age, he was memorizing the comedy records of Bill Cosby, Stan Freberg, Allan Sherman, and Mel Brooks, as well as all the early 60's Bob Dylan records. He learned to play guitar at age 10, and was performing plays in junior high school. At 15, his friend Michael Gurley asked him to join his garage band, Stillwater, for their first and only gig in the summer of 1975. He was cast in plays all throughout high school, his first being Nathan Detroit, and knowing nothing of New York, other than TV detectives, performed the entire role as Mel Brooks. He then trained in the summers at an intensive workshop created by former members of ACT in San Francisco. Planning to attend ACT and work at the Oregon Shakespeare Festival in Ashland, his acting teacher convinced him to attend college at UCLA instead. After two years of back to back college theatre, and garnering the school's Shakespeare award in 1980, Guest, upon discovering that they made films and TV shows in LA, made a plan to acquire an agent by his senior year, and moved out of the dorm and into a 2 bedroom apartment with 5 other roommates, including fellow students and future screenwriters Ed Solomon and Shane Black. He worked two part time jobs, attended UCLA, and began rehearsals for \" Transgressor\", an original play developed the previous year at school. Within weeks he had attended his first open call for the TV show \"Fame\", and though not initially cast, received a call from an agent the next day inviting him to come in for a meeting. Guest was then sent out on auditions so much over the next few months that he had to quit UCLA by the end of fall term to pursue acting full time. Within the next year, he had a recurring role on \"Lou Grant\", a pilot, 2 screen tests, an after school special, some episodic TV, and a role opposite Jamie Lee Curtis in the horror cult classic \"Halloween 2\". The Writer/producer of Halloween 2, John Carpenter, was going over the film before it's release and Carpenter's friend, Nick Castle, took note of the young actor, and remembered him for his current project in development, \"Centauri's Recruit\", later to be called. \"The Last Starfighter\". More television movies, recurring roles (St. Elsewhere) and small film roles followed, and Guest visited NYC for the first time. He came back to LA , inspired by the theater, and ready to move back east, when he was called in by Castle for what became \"The Last Starfighter\". Principal photography was completed in the spring of 1983, a couple months shy of his 23rd birthday. He was then cast as the protagonist in \"The Roommate\", an American Playhouse production, also starring Barry Miller and John Cameron Mitchell, based on a John Updike short story, which later won the grand prize at the LA Film Festival (1985). After wrapping \"The Roommate\", Guest escaped to New York and lived there for the first half of 1984 seeking theatre roles. He was working at the Santa Fe Festival theatre when The Last Starfighter opened in July of 1984. He was then cast in a TV drunk driving cautionary tale with Val Kilmer, Mare Winningham, and Michele Pfeiffer. Back in LA, he turned down a couple of subsequent offers in favor of a $3MIL indie about bluegrass musicians in the Blue Ridge mountains. When that project fell apart, he starred in another TV movie,\"My Father, My Rival\" for HBO, alongside Wendy Crewson. He was told that Starfighter reportedly made no money on it's initial release, so he returned to the theatre, this time in LA for the West coast premiere of Chris Durang's \"Baby With the Bathwater\" with Jennifer Tilly, which ran for 5 months at the Coronet Theatre. More regional theatre over the next year, \"Key Exchange\" with Anthony Edwards and Jennifer Beals, and \"Look Homeward Angel\" at Playmakers Rep in NC. Later that year he was offered the part of Michael Brody in 1987's \"Jaws: The Revenge.\" with Michael Caine. Wrapping \"Jaws\" in July, he was then cast in what he calls his favorite film, \"The Wizard of Loneliness\", a small WWII era piece about a 12 year old growing up in Vermont, with Lukas Haas, Lea Thompson, Dylan Baker and the late John Randolph. Over the next decade, it was mostly TV, co-starring with Robert Loggia as FBI agents in the political thriller miniseries \"Favorite Son\", a year as a bitter, ex-con photojournalist in \"Knot's Landing\", recurring on \"Life Goes On\" as an environmental metal-sculptor and street musician, McGoverns campaign manager on the '72 election episode of \" The Wonder Years\", a computer geek, a fireman, a high school teacher, another sculptor, an enviro-terrorist in \"The X-Files\", and back to the independent film \"Plan B\" with Jon Cryer, playing a regular-guy pilot who tries with his wife to conceive a child. Guest has continued to work in LA small theatre developing strictly original works, as well as touring for two and a half years('97-2000) with the satirical folk-group The Foremen, playing guitar and banjo. He also began planting vineyards in different locations in Northern California, and making wine. A handful of indie films: a wrongfully defrocked priest in \"The Least of These\", a gitmo-type interrogator in \"Shadowbox\", a hippie political adviser in \"Mach 2 \", a MASH type ER doctor in \"21 and a Wake-Up\" with Amy Acker, a recurring role as a no-nonsense Navy pilot on JAG, a couple of Disney Channel movies: one as wacky alien Cosmo Cola in \"Stepsister from Planet Weird\", and chimp-adopting primatologist Hugo Archibald in \"The Jenny Project\", episodic roles on\" Becker\", \"NYPD Blue\"('05),\"House\",('06) TV movie now called \"Alibi\", starring Famke Jahnsen ('07) and a cynical journalist on \"Jericho\".('07) After the birth of his, and partner Danna Hyams' son Jack in 2004, Guest started preliminary readings and workshops for a new musical created by Floyd Mutrux about an historic 1956 reunion at Sun Records in Memphis of Elvis Presley, Johnny Cash, Carl Perkins, and Jerry Lee Lewis. Based on the actual jam session these four attended, and hosted by legendary producer Sam Phillips, \"Million Dollar Quartet\" had two full tryout productions in Daytona Beach('06) and Issaquah, Wa. ('07) before moving to Chicago in 2008, where it still is running. The original production then moved to The Nederlander Theater on Broadway in March of 2010 and ran for 15 months (over 500 performances) before moving to the New World Stages Off-Broadway where it played for almost another year, closing in June of 2012. Guest created the role of Johnny Cash and has been in all productions since it's inception excluding London and now Las Vegas, choosing to stay in NY with his family rather than go out on the tour, which is set for it's third incarnation. The unique aspect of this play is that all the actors play their own instruments; they ARE the orchestra, and the show features blockbuster renditions of rockabilly and traditional hits, covered by the four main characters. It also tells the story of Sam Phillips' relationship to all the artists, and his particular contribution to pop culture and history in general. Guest received great reviews in particular as Cash, as well as a Distinguished Performance Award Nomination by the Drama League of New York. The show was also nominated for Best Musical in 2010. Guest completed filming indie thriller \"Late Phases\" in June 2013.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxODEwMzczNF5BMl5BanBnXkFtZTgwMDY3NTIyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0346411","name":"Lance Guest","idIMDB":"nm0346411"},"actorId":"nm0346411","character":"Jimmy","urlCharacter":"http://www.imdb.com/character/ch0175108","main":true},{"actorName":"Pamela Susan Shoop","urlProfile":"http://www.imdb.com/name/nm0794870","urlPhoto":"","biography":{"dateOfBirth":"7 June 1948","placeOfBirth":" Hollywood, California, USA","height":"5' 7½\" (1.71 m)","bio":"A veteran character actress with a prolific career, Pamela Susan Shoop began acting while in her teens and established herself as a television regular in the early seventies. Since that time, she has appeared in several guest spots on a variety of television programs while occasionally working in theatrical films. As recurring player for Glen A. Larson, Pamela has made many appearances in at least nine different shows associated with the famed TV writer, director, and producer. While she has worked primarily in supporting and guest roles, Pamela did hold the regular part of Allison MacKenzie in the television soap opera Return to Peyton Place (1972) from 1972 to 1973.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0794870","name":"Pamela Susan Shoop","idIMDB":"nm0794870"},"actorId":"nm0794870","character":"Karen","urlCharacter":"http://www.imdb.com/character/ch0175109","main":true},{"actorName":"Hunter von Leer","urlProfile":"http://www.imdb.com/name/nm0902608","urlPhoto":"","biography":{"dateOfBirth":"3 April 1944","placeOfBirth":" Terre Haute, Indiana, USA","birthName":"Paul Hunter von Leer","bio":"Hunter von Leer was born on April 3, 1944 in Terre Haute, Indiana, USA as Paul Hunter von Leer. He is an actor, known for General Hospital (1963), Halloween II (1981) and History of the World: Part I (1981).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0902608","name":"Hunter von Leer","idIMDB":"nm0902608"},"actorId":"nm0902608","character":"Gary Hunt","urlCharacter":"http://www.imdb.com/character/ch0245936","main":true},{"actorName":"Dick Warlock","urlProfile":"http://www.imdb.com/name/nm0006441","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2Q2MTQ5OGQtOWI5Yi00YmJmLWI4NWEtMWY5MDYzNTY4ODg3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1940","placeOfBirth":" Oakley, Ohio, USA","birthName":"Richard Anthony Leming","height":"5' 8½\" (1.74 m)","bio":"Dick Warlock was born on February 5, 1940 in Oakley, Ohio, USA as Richard Anthony Leming. He is known for his work on Escape from New York (1981), Casino (1995) and The Thing (1982).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2Q2MTQ5OGQtOWI5Yi00YmJmLWI4NWEtMWY5MDYzNTY4ODg3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006441","name":"Dick Warlock","nicknames":["Michael Myers H2"],"idIMDB":"nm0006441"},"actorId":"nm0006441","character":"The Shape / Patrolman #3","urlCharacter":"http://www.imdb.com/character/ch0003211","main":true},{"actorName":"Leo Rossi","urlProfile":"http://www.imdb.com/name/nm0744235","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY1MTc1NDU0NF5BMl5BanBnXkFtZTcwMTk1NjMzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1946","placeOfBirth":" Trenton, New Jersey, USA","height":"6' 1½\" (1.87 m)","bio":"Personable, dynamic and versatile character actor Leo Rossi has been working profusely in both movies and TV shows alike from the mid-70s to the present day. Rossi was born in 1947 in Trenton, New Jersey and grew up in Philadelphia, Pennsylvania. Leo first began acting in community theater. Although often cast as mean, loutish and despicable characters (he's portrayed more than his fair share of made Mafia guys as well as a substantial number of cops and government agents), Rossi has shown on many occasions that he can play more appealing and sympathetic roles with equal skill and conviction. Leo was solid as crass'n'crude sexist pig \"Budd\" in Halloween II (1981). He has appeared in several movies for director Jonathan Kaplan: he was excellent as Bonnie Bedelia's insecure, but basically decent husband \"Jack Muldowney\" in the wonderful Heart Like a Wheel (1983) and memorably chilling as the vile jerk who cheers on Jodie Foster's barroom rape in the acclaimed Les accusés (1988). Moreover, Leo has acted in three pictures for director William Lustig: very likable as antsy mob witness \"Frank DeSalvo\" in Hit List (1989), extremely engaging as eager beaver rookie homicide detective \"Sam Dietz\" in Relentless (1989) (Rossi reprised this part in three sequels and even co-produced the last two entries), and really funny as crazed serial killer \"Turkell\" in Maniac Cop 2 (1990). More recently, Rossi had a nice sizable supporting role as Robert De Niro's evil cousin \"Carlo\" in the hit comedy Analyze This (1999). Among the TV shows Leo Rossi has done guest spots on are ER (1994), Frasier (1993), Murder, She Wrote (1984), Tour of Duty (1987), 21 Jump Street (1987), Cagney & Lacey (1981), T.J. Hooker (1982), Amazing Stories (1985), Hunter (1984) and Hill Street Blues (1981).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY1MTc1NDU0NF5BMl5BanBnXkFtZTcwMTk1NjMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0744235","name":"Leo Rossi","idIMDB":"nm0744235"},"actorId":"nm0744235","character":"Budd","urlCharacter":"http://www.imdb.com/character/ch0131427","main":true},{"actorName":"Gloria Gifford","urlProfile":"http://www.imdb.com/name/nm0317524","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0OTE5NTQ4OV5BMl5BanBnXkFtZTcwMTQ2NzMzMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1946","placeOfBirth":" USA","height":"5' 6\" (1.68 m)","bio":"Gloria taught at the American Film Institute for six years in the Masters' Program. She taught Directors, Writers and Producers and among her successful AFI students: Patty Jenkins (Monster (2003), Brian Dannelly (Saved! (2004), Weeds (2005). In 2007, Gloria opened the prestigious Actors Academy Milano in Milan, Italy, where she taught Italian actors and actresses and International Models - male and female in intensive acting programs. The Academy's president is Edoardo Costa, her former student at the BHP and now starring with Bruce Willis in Live Free or Die Hard (2007). She is the Founder of the Rebel Planet Short Film Festival of Hollywood, rebelplanet.com, which just had the its very successful second year festival in North Hollywood, California in April 2007.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0OTE5NTQ4OV5BMl5BanBnXkFtZTcwMTQ2NzMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0317524","name":"Gloria Gifford","idIMDB":"nm0317524"},"actorId":"nm0317524","character":"Mrs. Alves","urlCharacter":"http://www.imdb.com/character/ch0003235","main":true},{"actorName":"Tawny Moyer","urlProfile":"http://www.imdb.com/name/nm0610463","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODg3MDM3OTk0MV5BMl5BanBnXkFtZTcwNTMwNzgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 March 1957","placeOfBirth":" San Diego, California, USA","height":"5' 7\" (1.7 m)","bio":"Tawny Moyer was born on March 30, 1957 in San Diego, California, USA. She is known for her work on Halloween II (1981), California Suite (1978) and House of the Rising Sun (1987).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODg3MDM3OTk0MV5BMl5BanBnXkFtZTcwNTMwNzgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0610463","name":"Tawny Moyer","idIMDB":"nm0610463"},"actorId":"nm0610463","character":"Jill","urlCharacter":"http://www.imdb.com/character/ch0175110","main":true},{"actorName":"Ana Alicia","urlProfile":"http://www.imdb.com/name/nm0019578","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWYwMDIyYjEtZmE3OS00YWQ4LTk2YjEtMDRlYjg2Yjc4MmQ3XkEyXkFqcGdeQXVyMjA0NjEzMDM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1956","placeOfBirth":" Mexico City, Distrito Federal, Mexico","birthName":"Ana Alicia Ortiz","bio":"Born in Mexico City, Mexico on December 12, 1956, Ana Alicia became the third of four children to Carlos Celestino Ortiz and Alicia Torres Ortiz. She grew up in El Paso, Texas from age 6 after the passing of her father. There, she lived with her grandmother, widowed mother, her uncle Louie and three siblings in a house her father had purchased for her grandmother. Ana Alicia received a full scholarship to attend the prestigious Wellesley College in Massachusetts. Upon arrival, Ana Alicia auditioned and won the lead role for Jules Feiffer's \"Crawling Arnold\". On summer break after her freshmen year, Ana Alicia auditioned for The Adobe Horseshoe Dinner Theatre outside El Paso, Texas. The theatre offered her a position as a recurring actress in all feature productions. The opportunity would allow her to work with name actors from Hollywood and New York and receive a large weekly salary. She accepted the offer and also acquired her actor's equity card through her term. She left Wellesley and finished her education at The University of Texas at El Paso (UTEP). Ana Alicia spent the next three years, performing in main stage productions at UTEP as well as having significant roles in the Adobe Horseshoe repertoire. After graduation, Ana Alicia moved to Los Angeles and struggled to attain success as an actress while studying for her law school entrance exam. Six months later, her big acting break came when she won the role of Alicia Nieves on ABC's Ryan's Hope (1975). According to Ana Alicia, working on the show in New York was exciting - not only because it was an acting job, but because she was a fan of the the show. Although the role was a secondary one - Nieves had romances with policeman Bob Reid and Dr. Pat Ryan. It provided her with much-needed exposure. After 15 months, Ana Alicia left the show to become one of the last Universal Studios contract players. She moved to Los Angeles and in addition to her work as a contract player, she attended Southwestern University Law School at night. As she acquired larger roles that required her to leave town, it became impossible to continue the grueling schedule of acting during the day and studying for school at night. She had to make a choice so she sat down and wrote the pros and cons of each decision and when she realized her passion was to act, she made the very difficult decision to drop out of law school. Once she was focused, her career began to open up quickly. She landed several roles on major television films and series' episodes. Within a year, the Universal terminated their contract player department. It was the end of an era. Soon after, her teacher Milton Katselis suggested she stop playing virginal roles and turn to roles such as the tortured, sexually deprived Maggie in \"Cat on a Hot Tin Roof\". Exploring this previously undiscovered part of her acting range, Ana Alicia pursued an audition for Falcon Crest (1981). In the room was a female casting director Doris Sabbagh along with Earl Hamner, Robert McCollough, and Larry Elikann. Ana Alicia's job was to seduce Lorenzo, played in the room by Doris. As Ana Alicia ran her fingers up Doris' stockings, conservative Southerner Earl Hamner stood up and stopped the scene, and said, \"Thank you very much. That was wonderful.\" Less than an hour later, Ana Alicia's agent called to let her know she had won the role of Melissa Agretti. Ana Alicia was on the show for seven years, playing the ambitious, scheming Melissa Agretti, and playing opposite Jane Wyman as Angela Channing and a plethora of handsome men. In October of 1988, Ana Alicia was written out of Falcon Crest (1981), and the show subsequently dropped considerably in the ratings. In a last ditch attempt to revitalize the show, she was brought back to the show later that season as a look-a-like of Melissa's, named Samantha Ross. The guest stint was short-lived and Ana Alicia quickly moved on to other projects, including the TV movies Miracle Landing (1990) and Rio Shannon (1993), as well as the feature film, Romero (1989). Ana Alicia has also devoted much of her time to various animal and human causes. She was the national spokesperson for the Humane Society, and has presented awards promoting Hispanic achievements in the media on behalf of the Golden Eagle Awards. Lorenzo Lamas was co-presenter. In 1991, while in France hosting an episode of The World's Greatest Stunts for GRB Entertainment, she met and fell madly in love with her now husband Gary Benz. In 1996, after finishing the pilot for Acapulco Heat, Ana Alicia made the decision to leave her acting career and invest in being a mother to her two young children Cathryn and Michael, her new passion in life. In March 2015, having raised her children and with her youngest in college, she returned to her first love but as a producer opening up her own production company Quebrada Entertainment: its purpose is to develop scripted and unscripted film and television that reaches a culturally and demographically diverse audience across all genres through the development and execution of quality storytelling.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWYwMDIyYjEtZmE3OS00YWQ4LTk2YjEtMDRlYjg2Yjc4MmQ3XkEyXkFqcGdeQXVyMjA0NjEzMDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0019578","name":"Ana Alicia","idIMDB":"nm0019578"},"actorId":"nm0019578","character":"Janet","urlCharacter":"http://www.imdb.com/character/ch0175111","main":true},{"actorName":"Ford Rainey","urlProfile":"http://www.imdb.com/name/nm0707077","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMDI2OTU5M15BMl5BanBnXkFtZTcwMjcwNjM5NA@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 August 1908","placeOfBirth":" Mountain Home, Idaho, USA","bio":"American character actor of stage, films, and television. A native of Idaho, Rainey was the son of a colorful character who was, among many other things, a champion of local dance contests. As a boy, Rainey was painfully shy, but found an outlet in school plays. He pursued stage work in regional companies, then went to New York to study with the legendary Michael Chekhov. He worked numerous \"civilian\" jobs while attempting to make a career as an actor, including work as a logger, a lineman, and a licensed carpenter. He served in the U.S. Coast Guard during World War II, then went to California where he helped start the Ojai Valley Players and then acted in his first film in 1949. He became a familiar face in films and television shows of all sorts during the next five decades while maintaining a deep attachment to the theatre. In his ninetieth year, he played Giles Corey in \"The Crucible\" at Theatricum Botanicum, the Topanga, California theatre founded by his friend, the late Will Geer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMDI2OTU5M15BMl5BanBnXkFtZTcwMjcwNjM5NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0707077","name":"Ford Rainey","idIMDB":"nm0707077"},"actorId":"nm0707077","character":"Dr. Mixter","urlCharacter":"http://www.imdb.com/character/ch0175112","main":true},{"actorName":"Cliff Emmich","urlProfile":"http://www.imdb.com/name/nm0256545","urlPhoto":"","biography":{"dateOfBirth":"13 December 1936","placeOfBirth":" Cincinnati, Ohio, USA","bio":"Tubby and engaging character actor Cliff Emmich was born on December 13, 1936 in Cincinnati, Ohio and raised in Los Angeles. His father Clifford was a popular exotic car dealer whose celebrity customers included Clark Gable, Gary Cooper and Ozzie Nelson. Following graduation from John Muir High School, Emmich served in the air force for four years as a photo technician. Cliff first began acting on stage. Veteran character actor Keenan Wynn advised Emmich to enroll at the Pasadena Playhouse. Cliff studied at the Pasadena Playhouse for eight months. Emmich then toured the country with the American Repertory Players and spent a summer performing in summer stock at the Pink Garter Theatre in Jackson Hole, Wyoming. He made his film debut in \"Gaily, Gaily.\" Cliff gave a superb performance as arrogant country singer Rip Torn's loyal, but long-suffering chauffeur Chicago in the outstanding indie drama gem \"Payday.\" Other memorable roles are a coroner in the fantastic \"Invasion of the Bee Girls,\" a sexist jerk business executive who insults Yvette Mimieux at the very start of the excellent redneck exploitation winner \"Jackson County Jail,\" a bumbling small town deputy in \"Barracuda;\" very likable as ill-fated hospital security guard Mr. Garrett in \"Halloween II,\" an asylum doctor in the trashy \"Hellhole,\" and a small town sheriff in \"Digital Man.\" Among the many TV shows Cliff has done guest spots on are \"Crossing Jordan,\" \"Walker, Texas Ranger,\" \"Nash Bridges,\" \"Coach,\" \"Baywatch,\" \"Murder, She Wrote,\" \"Knots Landing,\" \"Night Court,\" \"Hunter,\" \"Rip Tide,\" \"Simon & Simon,\" \"CHiPs,\" \"Knight Rider,\" \"The Incredible Hulk,\" \"Vega$,\" \"Fantasy Island,\" \"Happy Days,\" \"Little House on the Prairie\" (this is one of Emmich's favorite parts), \"Charlie's Angels,\" \"Baretta,\" \"Police Woman,\" and \"Starsky and Hutch.\" He's a member of both the Academy of Motion Picture Arts and Sciences and the Academy of Television Arts and Sciences.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0256545","name":"Cliff Emmich","idIMDB":"nm0256545"},"actorId":"nm0256545","character":"Mr. Garrett","urlCharacter":"http://www.imdb.com/character/ch0131426","main":true},{"actorName":"Nancy Stephens","urlProfile":"http://www.imdb.com/name/nm0827111","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA2MzdhNGEtMGQ4ZS00NmU3LTk4NTUtZmNlNjg1Y2ZhNmQ2XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 July 1949","placeOfBirth":" Texas, USA","birthName":"Nancy Jane Stephens","height":"5' 7\" (1.7 m)","bio":"Nancy Stephens was born on July 2, 1949 in Texas, USA as Nancy Jane Stephens. She is an actress and producer, known for Halloween (1978), Escape from New York (1981) and Halloween H20: 20 Years Later (1998). She has been married to Rick Rosenthal since May 23, 1981. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA2MzdhNGEtMGQ4ZS00NmU3LTk4NTUtZmNlNjg1Y2ZhNmQ2XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0827111","name":"Nancy Stephens","idIMDB":"nm0827111"},"actorId":"nm0827111","character":"Marion","urlCharacter":"http://www.imdb.com/character/ch0175113","main":true}],"seasons":[],"idIMDB":"tt0082495","urlIMDB":"http://www.imdb.com/title/tt0082495","business":{"budget":{"money":"$2,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$7,676,836","country":"USA","day":"01","month":"11","year":"1981","remarks":""}],"gross":[{"money":"$20,470,309","country":"USA","day":"29","month":"11","year":"1981","remarks":""},{"money":"$19,324,019","country":"USA","day":"22","month":"11","year":"1981","remarks":""},{"money":"$17,615,968","country":"USA","day":"15","month":"11","year":"1981","remarks":""},{"money":"$14,200,000","country":"USA","day":"08","month":"11","year":"1981","remarks":""},{"money":"$7,676,836","country":"USA","day":"01","month":"11","year":"1981","remarks":""},{"money":"$25,533,818","country":"Worldwide","day":"30","month":"10","year":"1981","remarks":""},{"money":"ESP","country":"35,213,609","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$790,205","country":"USA","day":"29","month":"11","year":"1981","remarks":"480 Screens"},{"money":"$1,300,000","country":"USA","day":"22","month":"11","year":"1981","remarks":"815 Screens"},{"money":"$2,255,317","country":"USA","day":"15","month":"11","year":"1981","remarks":""},{"money":"$4,400,000","country":"USA","day":"08","month":"11","year":"1981","remarks":""},{"money":"$7,676,836","country":"USA","day":"01","month":"11","year":"1981","remarks":""}],"admissions":[],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"18","month":"04","year":"1981","remarks":null},{"money":null,"country":null,"day":"25","month":"05","year":"1981","remarks":null}],"copyrightHolder":"copyright 1981 Dino DeLaurentiis Corp."},"technical":{"runtime":["1 hr 32 min (92 min)","1 hr 30 min (90 min) (cut) (Sweden)"],"soundMix":["Dolby Stereo"],"color":["Color (MGM Color)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Metrocolor, Culver City (CA), USA"],"filmLength":null,"negativeFormat":["35 mm (Eastman 100T 5247)"],"cinematographicProcess":["Panavision"],"printedFilmFormat":["35 mm"]},"rating":"6.5","metascore":"40","filmingLocations":[{"location":"California, USA"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1982","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Horror Film","names":[]},{"category":"Best Actor","names":[{"name":"Donald Pleasence","id":"nm0000587","role":null}]}]}]},{"award":"The Stinkers Bad Movie Awards 1981","titlesAwards":[{"titleAwardOutcome":"Nominated Stinker Award","categories":[{"category":"Worst Sequel","names":[]}]}]}],"votes":"54,135","type":"Movie","companyCreditsSimple":[{"idCompany":"co0014380","name":"Dino De Laurentiis Company"},{"idCompany":"co0005073","name":"Universal Pictures"}],"keywords":{"keywords":["hospital","paramedic","exsanguination","masked villain","camera shot of feet","female stockinged feet","pantyhose","lifting someone into the air","michael myers","serial killer","murder spree","murder","sheriff","halloween","extreme violence","passing out","vulnerable","self survival","childhood flashback","boom box","college student","cut phone line","murdered with a hammer","adult actress playing teenage girl","hospital fire","villain not really dead cliche","walking through a glass door","shot in the chest","marshal killed","it was only a cat","hand on shoulder scare","scalded face","scalding water","head dunked in water","double murder","kiss on the lips","small town","security guard killed","hit on the head with a hammer","store room","product placement","manhunt","small town sheriff","clinic","man on fire","charred body","radio news report","october","news report","year 1978","recap segment","two word title","teenager in danger","teenage girl","teenager","17 year old","21 year old","yelling for help","car won't start","stuck car horn","slipping and falling","hospital patient","murder in hospital","stabbed with a scalpel","knife murder","part of series","escaped mental patient","roman numbered sequel","boogeyman","american horror","body count","slasher killer","villain","bad guy","homicidal maniac","murderer","madman","psychopathic killer","serial murder","jumpsuit","injected air bubble","hand over mouth","woman stabbed","dead woman with eyes open","dead doctor","dead nurse","1970s","torture","sadistic psychopath","serial teen killer","human monster","subjective camera","character's point of view camera shot","scalding","obsession","alone","pool","glasses","psycho","mutilation","bandage","mercilessness","police officer","presumed dead","locked up","witness","silhouette","old man","watching tv","murder of a police officer","female nudity","dark killer","beaten to death","nudity","trap","wheelchair","dark past","fiend","needle","destruction","hit on the head","frustration","jacuzzi","searching","injection","fragments of glass","accident","homicide","burnt face","telephone call","glass","psychologist","boyfriend girlfriend relationship","policeman","neighbor","cigarette smoking","shadow","old woman","dead girl","closing eyes of dead person","blindness","hammer","scream","deeply disturbed person","murder attempt","sex","police officer throat slit","smoke","blonde","hot water","melting face","strangulation","car trouble","stalking","bloodbath","trauma","dying words","memory","characters killed one by one","walkie talkie","dead man","psychological trauma","robe","curiosity","bath","maniac","shooting","pool of blood","homicidal","paranoia","multiple homicide","attempted murder","stabbed in the stomach","detective","dripping blood","suit","sleeping girl","hit by a car","tv news","flat tire","nurse uniform","kissing","sexual attraction","confusion","stripping","dark secret","murder investigation","brawl","temperature","car accident","cowboy hat","slip","revolver","butcher knife","mute","push button","hitting","secret","hide","store","poison","cut","flashlight","voyeur","light","uniform","ambulance","hiding","voyeurism","seduction","back from the dead","nipples","flame","violence","accidental killing","broken glass","scalpel","jealousy","hypodermic needle","autopsy","psycho thriller","bleeding","male nudity","search","sleeping woman","cult film","electronic music score","throat slitting","stalking victim","stalking by night","stalker","stabbed to death","stabbed in the throat","stabbed in the back","slasher flick","sinister","shot in the eye","set on fire","sequel to cult film","second part","screaming","scare","psychopath","psycho killer","prologue","police","opening credits","nurse","nude bathing","night","neighborhood","mysterious man","murder witness","multiple stabbing","multiple murder","masked man","madness","insanity","gore","fire","female victim","female rear nudity","eye gouging","explosion","disfigurement","death","death by strangulation","dead woman","darkness","crying","burning","brutality","brunette","boiling water","blood","blood stain","blood splatter","needle in eye","good versus evil","holiday horror","stabbed in the eye","sequel","nude woman murdered","mask","stabbing","chase","person on fire","slasher","masked killer","blood draining","number in title","calling someone an idiot"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:15:41"}}