{"data":{"movies":[{"title":"The Lady Eve","originalTitle":"","year":"1941","releaseDate":"19410321","directors":[{"name":"Preston Sturges","id":"nm0002545"}],"writers":[{"name":"Monckton Hoffe","id":"nm0388743"},{"name":"Preston Sturges","id":"nm0002545"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQzNWM4Y2QtMWVhYS00MTNkLTgxMGMtNjM5Y2FmNjQ2MWFiXkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"Returning from a year up the Amazon studying snakes, the rich but unsophisticated Charles Pike meets con-artist Jean Harrington on a ship. They fall in love, but a misunderstanding causes them to split on bad terms. To get back at him, Jean disguises herself as an English lady, and comes back to tease and torment him.","simplePlot":"A trio of classy card sharps targets the socially awkward heir to brewery millions for his money, until one of them falls in love with him.","actors":[{"actorName":"Barbara Stanwyck","urlProfile":"http://www.imdb.com/name/nm0001766","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjMxODIzODEzNF5BMl5BanBnXkFtZTYwNDgwNjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1907","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Ruby Catherine Stevens","height":"5' 5\" (1.65 m)","bio":"Today Barbara Stanwyck is remembered primarily as the matriarch of the family known as the Barkleys on the TV western The Big Valley (1965), wherein she played Victoria, and from the hit drama The Colbys (1985). But she was known to millions of other fans for her movie career, which spanned the period from 1927 until 1964, after which she appeared on television until 1986. It was a career that lasted for 59 years. Barbara Stanwyck was born Ruby Catherine Stevens on July 16, 1907, in Brooklyn, New York, to working class parents Catherine Ann (McPhee) and Byron E. Stevens. Her father, from Massachusetts, had English ancestry, and her Canadian mother, from Nova Scotia, was of Scottish and Irish descent. Stanwyck went to work at the local telephone company for fourteen dollars a week, but she had the urge (a dream--that was all it was) somehow to enter show business. When not working, she pounded the pavement in search of dancing jobs. The persistence paid off. Barbara was hired as a chorus girl for the princely sum of $40 a week, much better than the wages she was getting from the phone company. She was seventeen, and was going to make the most of the opportunity that had been given her. In 1928 Barbara moved to Hollywood, where she was to start one of the most lucrative careers filmdom had ever seen. She was an extremely versatile actress who could adapt to any role. Barbara was equally at home in all genres, from melodramas, such as Forbidden (1932) and Stella Dallas (1937), to thrillers, such as Double Indemnity (1944), one of her best films, also starring Fred MacMurray (as you have never seen him before). She also excelled in comedies such as Remember the Night (1940) and The Lady Eve (1941). Another genre she excelled in was westerns, Union Pacific (1939) being one of her first and TV's The Big Valley (1965) (her most memorable role) being her last. In 1983, she played in the ABC hit mini-series The Thorn Birds (1983), which did much to keep her in the eye of the public. She turned in an outstanding performance as Mary Carson. Barbara was considered a gem to work with for her serious but easygoing attitude on the set. She worked hard at being an actress, and she never allowed her star quality to go to her head. She was nominated for four Academy Awards, though she never won. She turned in magnificent performances for all the roles she was nominated for, but the \"powers that be\" always awarded the Oscar to someone else. However, in 1982 she was awarded an honorary Academy Award for \"superlative creativity and unique contribution to the art of screen acting.\" Sadly, Barbara died on January 20, 1990, leaving 93 movies and a host of TV appearances as her legacy to us.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjMxODIzODEzNF5BMl5BanBnXkFtZTYwNDgwNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001766","name":"Barbara Stanwyck","nicknames":["Missy","The Queen","Babs"],"idIMDB":"nm0001766"},"actorId":"nm0001766","character":"Jean Harrington","urlCharacter":"http://www.imdb.com/character/ch0023423","main":true},{"actorName":"Henry Fonda","urlProfile":"http://www.imdb.com/name/nm0000020","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTEwNjQ2ODQ4Nl5BMl5BanBnXkFtZTYwMzEwMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1905","placeOfBirth":" Grand Island, Nebraska, USA","birthName":"Henry Jaynes Fonda","height":"6' 1½\" (1.87 m)","bio":"Henry Jaynes Fonda was born in Grand Island, Nebraska, to Elma Herberta (Jaynes) and William Brace Fonda, who worked in advertising and printing. His recent ancestry included Dutch, English, and Scottish. Fonda started his acting debut with the Omaha Community Playhouse, a local amateur theater troupe directed by Dorothy Brando. He moved to the Cape Cod University Players and later Broadway, New York to expand his theatrical career from 1926 to 1934. His first major roles in Broadway include \"New Faces of America\" and \"The Farmer Takes a Wife\". The latter play was transferred to the screen in 1935 and became the start-up of Fonda's lifelong Hollywood career. The following year he married Frances Seymour Fonda with whom he had two children: Jane Fonda and Peter Fonda, also to become screen stars (his granddaughter is actress Bridget Fonda). He is most remembered for his roles as Abe Lincoln in Young Mr. Lincoln (1939), Tom Joad in The Grapes of Wrath (1940), for which he received an Academy Award Nomination, and more recently, Norman Thayer in On Golden Pond (1981), for which he received an Academy Award for Best Actor in 1982. Henry Fonda is considered one of Hollywood's old-time legends and was friend and contemporary of James Stewart, John Ford and Joshua Logan. His movie career which spanned almost 50 years is completed by a notable presence in American theater and television.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTEwNjQ2ODQ4Nl5BMl5BanBnXkFtZTYwMzEwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000020","name":"Henry Fonda","nicknames":["One-Take Fonda","Hank"],"idIMDB":"nm0000020"},"actorId":"nm0000020","character":"Charles Poncefort Pike","urlCharacter":"http://www.imdb.com/character/ch0023422","main":true},{"actorName":"Charles Coburn","urlProfile":"http://www.imdb.com/name/nm0002013","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3ODUyNTE2OV5BMl5BanBnXkFtZTYwMTMzMzQ2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1877","placeOfBirth":" Savannah, Georgia, USA","birthName":"Charles Douville Coburn","height":"6' (1.83 m)","bio":"A cigar-smoking, monocled, swag-bellied character actor known for his Old South manners and charm. In 1918 he and his first wife formed the Coburn Players and appeared on Broadway in many plays. With her death in 1937, he accepted a Hollywood contract and began making films at the age of sixty.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3ODUyNTE2OV5BMl5BanBnXkFtZTYwMTMzMzQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002013","name":"Charles Coburn","nicknames":["The Monocle from Georgia"],"idIMDB":"nm0002013"},"actorId":"nm0002013","character":"'Colonel' Harrington","urlCharacter":"http://www.imdb.com/character/ch0363187","main":true},{"actorName":"Eugene Pallette","urlProfile":"http://www.imdb.com/name/nm0657874","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5Nzk5NzA2NF5BMl5BanBnXkFtZTcwNTI1MDQxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1889","placeOfBirth":" Winfield, Kansas, USA","birthName":"Eugene William Pallette","height":"5' 9\" (1.75 m)","bio":"Gargantuan-bellied, frog-voiced character actor who was a staple in forties movies. After World War II his ultra-right-wing political views fuelled his 'bomb' paranoia and he bought a property in Oregon which he turned into a well-stocked compound in case the Russians attacked. Many of his old Hollywood friends, including Clark Gable, visited him there (some came to hunt and fish) but the property was later sold.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5Nzk5NzA2NF5BMl5BanBnXkFtZTcwNTI1MDQxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0657874","name":"Eugene Pallette","idIMDB":"nm0657874"},"actorId":"nm0657874","character":"Mr. Pike","urlCharacter":"http://www.imdb.com/character/ch0500019","main":true},{"actorName":"William Demarest","urlProfile":"http://www.imdb.com/name/nm0218131","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA2MjY5NDAxOF5BMl5BanBnXkFtZTcwNjM2MjcwOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1892","placeOfBirth":" St. Paul, Minnesota, USA","birthName":"Carl William Demarest","height":"5' 9½\" (1.77 m)","bio":"Born in St. Paul, Minnesota, William Demarest was a prolific actor in movies and TV, making more than 140 films. Demarest started his acting career in vaudeville and made his way to Broadway. His most famous role was in My Three Sons (1960), replacing a very sick William Frawley. Demarest was nominated for an Academy Award for Best Actor in a Supporting role in the real-life biography, The Jolson Story (1946). He did not win. This was the first and only time Demarest was nominated for any Academy Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA2MjY5NDAxOF5BMl5BanBnXkFtZTcwNjM2MjcwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0218131","name":"William Demarest","idIMDB":"nm0218131"},"actorId":"nm0218131","character":"Muggsy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Blore","urlProfile":"http://www.imdb.com/name/nm0089314","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWVjODQ4YWQtZjg4OC00NDQ1LThkNzktNzIyNzYzZmNiMzQ1XkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 December 1887","placeOfBirth":" London, England, UK","height":"5' 8\" (1.73 m)","bio":"Born in London, Eric Blore came out of college and started his working life as an insurance agent. But while touring in Australia he took an interest in the stage and theater. He gave up his insurance job and turned to acting after returning to England. With his elfish long, straight nose, squint-eyed demeanor and a crisp voice, he successfully began a career starring in many shows and revues, focusing on traditional British comedy. Encouraged further, in 1923 he came to New York and was almost immediately using his London stage experience on Broadway. Though there were a few dramatic parts, he inevitably played comic roles in musical comedies and revues (in some of which he also received billing as a lyricist) regularly from 1923 to 1933. He would return once again some ten years later to take on multiple roles for Ziegfeld Follies of 1943. No stranger to film, as early as 1920 he had tried his hand in British cinema. And in 1926 he did the US silent version of The Great Gatsby (1926) that starred Warner Baxter. His familiar role as a head waiter began with his first Fred Astaire/Ginger Rogers film, Flying Down to Rio (1933). With a foot still on Broadway, in 1933 he played the waiter in the stage version of The Gay Divorcee and was then tapped to reprise the role in the film version with Fred and Ginger. Blore had been perfecting his basic comic characters since his London days -- a leering English gentlemen, brusque/wise-acre butler or waiter or other service provider -- with a lockjawed British accent. These characters accompanied by Blore's flawlessly timed delivery were thoroughly applicable and effective as he moved permanently to Hollywood character acting. He played a fair spectrum of other roles, even in a few rare dramas, such as the adventure The Soldier and the Lady (1937) and Island of Lost Men (1939). Blore was very busy with movies from 1934 through most of the 1940s. He appeared in five of the nine Fred and Ginger dance musicals. Some of his best mugging and scripted lines were in Top Hat (1935) and Shall We Dance (1937) of that series. He was also cast very effectively as valet/butler Jamison in the screen adaptations of the Wolfe Kaufman Lone Wolf mystery novel series. There were eleven films between 1940 and 1947, with all but the last three starring the dashing, sonorous-voiced Warren William (who had a greater profile than 'The Great Profile', 'John Barrymore' ) as Michael Lanyard. This was a popular series with first-rate scripts and good production values to keep the public coming back for more. Blore was also invited into the company of stock players ruled over by zany comedy director Preston Sturges. Though Blore only did two films for Sturges, his role in the first of these, The Lady Eve (1941), was a Blore tour de force. Playing the suave confidence man, Pearly, to his old bunko acquaintances Barbara Stanwyck and Charles Coburn, he took the role of pseudo-wealthy Sir Alfred McGlennan Keith out to fleece the local American business gentry. His scene with a gullible Henry Fonda taking in Sir Alfred's concocted story of Stanwyck's being a twin daughter of the lady of the manor by way of her coachman is a delight, punctuated with Blore interrupting perplexed Fonda's questions with a loud shhhhhhh of silence at each. Inevitably, the parts started to become less frequent. Several of Blore's 1940s movies were with lesser known up-and-comers or older stars such as himself. Still, he enjoyed a variety of roles, including the opportunity of animation immortality when Disney chose him for the voice of Mr. Toad in the classic short The Wind in the Willows (1949). But for two widely spaced appearances, Blore essentially retired by 1955. And as sometimes is the case when personalities move into obscurity, their deaths are prematurely announced. Such was the case with Blore when the New Yorker journalist Kenneth Tynan reported him as having already passed on. Blore's lawyer raised a flurry, as did the editor of the New Yorker, who claimed the periodical had never had to print a retraction. The night before the highly profiled retraction appeared, Blore indeed passed away. And the next morning the New Yorker was the only publication with the wrong information. It seems likely Blore would have been particularly tickled with the irony of this last comedic bit in honor of his passing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWVjODQ4YWQtZjg4OC00NDQ1LThkNzktNzIyNzYzZmNiMzQ1XkEyXkFqcGdeQXVyMjUxODE0MDY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0089314","name":"Eric Blore","idIMDB":"nm0089314"},"actorId":"nm0089314","character":"Sir Alfred McGlennan Keith","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Melville Cooper","urlProfile":"http://www.imdb.com/name/nm0178259","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjNlYWVlODUtMGQ3My00YjAyLWI1MTItNTBjZmU4NDhmMGJmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1896","placeOfBirth":" Birmingham, England, UK","birthName":"George Melville Cooper","bio":"Born George Melville Cooper on October 15, 1896, in Birmingham England, he was the son of non-professionals W.C.J. and Frances (Brennan) Cooper, and attended various English public schools, including King Edward's School in Birmingham. Attracted to the stage as a teenager, he made his debut at Stratford-on-Avon at age 18, but his young career was interrupted by World War I. Serving in a Scottish regiment on the Western Front, he was captured and made prisoner of war for a time by the Germans. Following the war Cooper returned to the theatre and earned good reviews in the play \"The Farmer's Wife\" in 1921. He made his official London debut with a production of \"Back to Methuselah in 1924, and furthered his career on stage with roles in \"The Third Finger\" (1927) and \"Journey's End\" (1929). He turned to films in middle age with the English entry Black Coffee (1931) and, after supporting roles in the popular costumers The Private Life of Don Juan (1934) and The Scarlet Pimpernel (1934), decided to cross the waters to seek work in America. Taking his first Broadway curtain call with \"Laburnum Grove\" (1935), he also appeared in \"Jubilee\" (1935) and \"Tovarich\" (1937) and subsequently became a sometime stage director, as in the case of the 1947 production of \"We Love a Lassie.\" In Hollywood Cooper was effectively cast as ineffectual types and played in a number of \"A\" pictures. Giving great snob appeal, he made a most reliable and disdainful butler, chauffeur or doorman in such films as The Bishop Misbehaves (1935), Four's a Crowd (1938), Too Many Husbands (1940), And Baby Makes Three (1949) and The Petty Girl (1950). More quality roles, however, wormed their way outside this stereotype with his blundering and cowardly Sheriff of Nottingham opposite dashing Errol Flynn in The Adventures of Robin Hood (1938); conman sidekick to Barbara Stanwyck in The Lady Eve (1941); portentous Mr. Collins whom Greer Garson nearly married in Pride and Prejudice (1940); and Mr. Tringle, the wedding supervisor, in Father of the Bride (1950) being particular standouts. Cooper made an active jaunt into TV roles in the 1950s but returned strongly to the stage after biding farewell to films in 1958. In the 1960s he enjoyed such scene-stealing theatrical roles as Colonel Pickering in \"My Fair Lady,\" Pellinore in \"Camelot\" and Reverend Chasuble in \"The Importance of Being Earnest\". He made one last return to Broadway playing (what else?) a valet in a short-run revival of the farcical comedy \"Charley's Aunt\" in 1970, which co-starred Rex Thompson, Louis Nye and 'Maureen O'Sullivan'. Married three times, his first was to London-born actress Rita Page who had a bit part in one of his films This Above All (1942), and died in 1954. They had one daughter, Valerie. The 76-year-old Cooper died in Los Angeles of cancer in 1973, and was survived by third wife Elizabeth.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjNlYWVlODUtMGQ3My00YjAyLWI1MTItNTBjZmU4NDhmMGJmXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0178259","name":"Melville Cooper","idIMDB":"nm0178259"},"actorId":"nm0178259","character":"Gerald","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Martha O'Driscoll","urlProfile":"http://www.imdb.com/name/nm0640930","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzExZGRkMGUtMjJiNy00NjVjLWI2YWItMjhmNzFiODYzYjMwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1922","placeOfBirth":" Tulsa, Oklahoma, USA","height":"5' 5\" (1.65 m)","bio":"Another gorgeous \"B\" movie blonde who came and went uneventfully in the 1940s, the beautiful Tulsa-born Martha O'Driscoll started off modeling as a child. Her parents were nonprofessionals. Trained in singing and dancing, Martha was discovered by choreographer Hermes Pan in a local theater production in Phoenix, AZ, which led to unbilled bits in musical movies from 1935. Once she had her foot in the door, she was groomed in more visible parts and began pitching products for Max Factor makeup and Royal Crown Cola, among others, in magazine ads while such endorsements promoted her upcoming pictures in return. Martha attracted film offers from both Paramount and Universal studios in her 12-year Hollywood career, which included musicals, silly slapstick and horror films. She appeared as \"Daisy Mae\" in Li'l Abner (1940) -- the first screen version of the famous comic strip -- and proved a sexy foil for the teams of Bud Abbott & Lou Costello and Ole Olson & Chic Johnson in their comedy vehicles. She played the pretty prairie flower to a couple of notable western film stars including Tim Holt, and was terrorized by the Wolfman, Dracula and the Frankenstein Monster in her most notable feature, House of Dracula (1945). In 1943 Martha married a US Navy lieutenant commander but they separated ten months later. Following her last film, Carnegie Hall (1947) and a divorce decree from her first marriage, she married a second time to Chicago businessman Arthur Appleton, heir to an industrial empire, and retired completely (at age 25), In Chicago she became one of the city's more civic-minded leaders, an interest that would last for more than four decades. She also served as an executive for many committees, including the Sarah Siddons Society, and was on the Board of Directors for a few of her husband's companies. From time to time she even appeared in nostalgia conventions. Martha died on November 3, 1998, in Miami.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzExZGRkMGUtMjJiNy00NjVjLWI2YWItMjhmNzFiODYzYjMwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0640930","name":"Martha O'Driscoll","idIMDB":"nm0640930"},"actorId":"nm0640930","character":"Martha","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Janet Beecher","urlProfile":"http://www.imdb.com/name/nm0066325","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDYxNTJkODMtYjM5Zi00ZjNmLWFhZGYtYjFkYzVkY2RlNmVlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 October 1884","placeOfBirth":" Jefferson City, Missouri, USA","birthName":"Janet Meysenburg","bio":"Janet Beecher, daughter of the German vice-consul in Chicago, studied acting at the Art Students League in New York. For almost three decades she made a name for herself as a leading actress in plays on the Broadway stage, beginning with a bit part in 'The Two Orphans' in 1903. Her hits included 'The Lottery Man' (1909-10), 'The Concert' (1910-11), 'A Bill of Divorcement' (1921-22) and 'Courage' (1928-29). She made her Hollywood debut in 1933. Despite consistently good critical reviews, her theatrical stardom never translated to the screen. She was destined to be typecast as forthright wives and was particularly droll as Mrs.Barnum in The Mighty Barnum (1934), opposite Wallace Beery. She also played sympathetic dowagers, genial friends of the heroine and a multitude of steadfast mothers (best of those being Margaret Sullavan's in So Red the Rose (1935) and Tyrone Power's in The Mark of Zorro (1940). In 1943, she returned to the stage and made her theatrical curtain call as the wife of the title character in 'The Late George Apley' the following year.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDYxNTJkODMtYjM5Zi00ZjNmLWFhZGYtYjFkYzVkY2RlNmVlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0066325","name":"Janet Beecher","idIMDB":"nm0066325"},"actorId":"nm0066325","character":"Mrs. Pike","urlCharacter":"http://www.imdb.com/character/ch0500018","main":true},{"actorName":"Robert Greig","urlProfile":"http://www.imdb.com/name/nm0340063","urlPhoto":"","biography":{"dateOfBirth":"27 December 1879","placeOfBirth":" Melbourne, Victoria, Australia","bio":"Robert Greig was born on December 27, 1879 in Melbourne, Victoria, Australia. He was an actor, known for Sullivan's Travels (1941), The Lady Eve (1941) and Trouble in Paradise (1932). He was married to Beatrice Denver Holloway. He died on June 27, 1958 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0340063","name":"Robert Greig","idIMDB":"nm0340063"},"actorId":"nm0340063","character":"Burrows","urlCharacter":"http://www.imdb.com/character/ch0023424","main":true},{"actorName":"Dora Clement","urlProfile":"http://www.imdb.com/name/nm0166076","urlPhoto":"","biography":{"dateOfBirth":"30 May 1891","placeOfBirth":" Spokane, Washington, USA","height":"5' 6\" (1.68 m)","bio":"Dora Clement was born on May 30, 1891 in Spokane, Washington, USA. She was an actress, known for The Lady Eve (1941), Buck Privates (1941) and The Phantom Creeps (1939). She died in May 1979 in Washington, District of Columbia, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0166076","name":"Dora Clement","idIMDB":"nm0166076"},"actorId":"nm0166076","character":"Gertrude","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Luis Alberni","urlProfile":"http://www.imdb.com/name/nm0016422","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODdjMmI5MGYtOGZiMC00MDdkLWFkYzktNTBiNjI3ZDVlYjE0XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1886","placeOfBirth":" Barcelona, Barcelona, Catalonia, Spain","height":"5' 7\" (1.7 m)","bio":"Spanish character actor Luis Alberni was born on the date of October 4, 1886 in Cataluna Barcelona, Spain. His mother's maiden name was Malo, and father's surname Alberni. Luis attended the University of Madrid and majored in drama, it was around this time that he began to get involved in acting in Europe. While acting in a Shakespearean play, (Hamlet), the audience went hysterical and loved him. Due to the recognition he received it was then that he decided to become a comedian. In 1914 he decided to move to the United States to continue with his career in acting. His first wife, whose name is unknown, bore him two sons, Luis and Carlos. He then got a divorce and married his last wife, Wanda Kay Wilson, with whom he stayed until his last days. In the process no children had been conceived. Around the age of mid-seventies, Luis lived in a home for the elderly devoted to actors, most of whom were from the Screen Actors guild or Masquers club. On the date of December 23, 1962 he passed away and was buried at Pierce Brothers Valhalla Memorial Park in North Hollywood, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODdjMmI5MGYtOGZiMC00MDdkLWFkYzktNTBiNjI3ZDVlYjE0XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0016422","name":"Luis Alberni","idIMDB":"nm0016422"},"actorId":"nm0016422","character":"Pike's Chef","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0033804","urlIMDB":"http://www.imdb.com/title/tt0033804","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":[{"money":null,"country":null,"day":"21","month":"10","year":"1940","remarks":null},{"money":null,"country":null,"day":"05","month":"12","year":"1940","remarks":null}],"copyrightHolder":"Copyright MCMXLI by Paramount Pictures, Inc. (on print); © Paramount Pictures, Inc.; 21 March 1941; LP10343 (in copyright registry)"},"technical":{"runtime":["1 hr 34 min (94 min)"],"soundMix":["Mono (Western Electric Mirrophonic Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["2,569.2 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"8.0","filmingLocations":[{"location":"Los Angeles County Arboretum & Botanic Garden - 301 N. Baldwin Avenue, Arcadia, California, USA"}],"rated":"NOT RATED","awards":[{"award":"Academy Awards, USA 1942","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Writing, Original Story","names":[{"name":"Monckton Hoffe","id":"nm0388743","role":null}]}]}]},{"award":"National Board of Review, USA 1941","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Top Ten Films","names":[]}]}]},{"award":"National Film Preservation Board, USA 1994","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"","names":[]}]}]}],"votes":"15,301","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["revenge","money","snake","heir","cartoon rattlesnake","animated title sequence","wealth","rich family","card shark","lady","con artist","bodyguard","connecticut","horse","colonel","book","gold digger","con","party","ship","ocean liner","cardsharp","millionaire","hit on the head with an apple","1940s","broken heart","character's point of view camera shot","dropping something on someone","tripping and falling","seasickness","writing a check","wedding night","wedding dress","wedding cake","watching through a mirror","waiter","valet","uncle niece relationship","tuxedo","tunnel","tripping","tiara","telephone","telephone call","telepathy","tears","tailor","sunset","straight edge razor","storytelling","stockings","stairway","song","slapstick","singing","singer","shipdeck","shipboard romance","ship cabin","shaving","sex","sexual tension","screwball","screaming","scam","running","royal flush","reference to napoleon","reference to manila","reference to josephine bonaparte","reference to houdini","reference to george washington","reference to faust","reference to thomas dewey","reading","rain","rainstorm","pursuit","purser","professor","pratfall","pith helmet","photograph","perfume","pastry chef","pacing","opera singer","nightmare","new york city","montage","monocle","mirror","marriage proposal","maraca","maid","lie","legs","lawyer","kneeling","kitchen","kiss","jealousy","impostor","husband wife relationship","horniness","honesty","hit on the head","havana cuba","harvard","gambler","frosting","forgiveness","football player","food","fly","flowers","fleeing","female wrestler","ophidiophobia","englishman","eligible bachelor","elevator","egg","dropping a handkerchief","drink","drinking","dressmaker","doubt","dishonesty","dinner","crying","crook","criminal","con woman","con man","con game","cockroach","coat of arms","clumsiness","circular staircase","cigarette smoking","cigarette holder","cigar smoking","check","cheating","cheater","chauffeur","chase","changing clothes","cartoon snake","card trick","card playing","cake","bridgefield connecticut","bride and groom","bookworm","blurry vision","binoculars","bartender","bare midriff","assumed identity","apple","animated sequence","american football","amazon river","yale","rich man","nickname","father son relationship","father daughter relationship","divorce","divorce settlement","card cheat","annulment","ale","naivety","victim","seduction","marriage","heartbreak","forbidden love","cruise","battle of the sexes","writer director","rose","hot water bottle","horse riding","flirting","beer","secret","gambling","train","poker","racetrack","nobility","wedding","mistaken identity","shoe","fake accent","mansion","honeymoon","fraud","ophiologist","dinner party","hitler spoof","sexual frustration","promiscuity"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 03:58:05"}}