{"data":{"movies":[{"title":"L'aile ou la cuisse","originalTitle":"","year":"1976","releaseDate":"19761027","directors":[{"name":"Claude Zidi","id":"nm0956022"}],"writers":[{"name":"Claude Zidi","id":"nm0956022"},{"name":"Michel Fabre","id":"nm0264686"}],"runtime":"104 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0MjI1NDYxMF5BMl5BanBnXkFtZTcwNDM2MjUxMQ@@._V1.jpg","countries":["France"],"languages":["French"],"genres":["Comedy","Family"],"plot":"Charles Duchemin, a well-known gourmet and publisher of a famous restaurant guide, is waging a war against fast food entrepreneur Tri- catel to save the French art of cooking. After having agreed to appear on a talk show to show his skills in naming food and wine by taste, he is confronted with two disasters: his son wants to become a clown rather than a restaurant tester and he, the famous Charles Duchemin, has lost his taste!","simplePlot":"Charles Duchemin, a well-known gourmet and publisher of a famous restaurant guide, is waging a war against fast food entrepreneur Tri- catel to save the French art of cooking. After having ... ","actors":[{"actorName":"Louis de Funès","urlProfile":"http://www.imdb.com/name/nm0000086","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc5NTkyMDU4Nl5BMl5BanBnXkFtZTgwNzk0NTM1NTE@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1914","placeOfBirth":" Courbevoie, Seine [now Hauts-de-Seine], France","birthName":"Louis Germain de Funès de Galarza","height":"5' 4½\" (1.64 m)","bio":"Louis Germain David de Funès de Galarza was born on July 31, 1914, in Courbevoie, France. His father, named Carlos Luis de Funes de Galarza, was a former lawyer of Seville, Spain, who became a diamond cutter. His mother, named Leonor Soto Reguera, was of Spanish and Portugese extraction. Young Louis de Funès was fond of drawing and piano playing. He dropped out of school and worked various jobs, mostly as a jazz pianist at Pigalle, making his customers laugh every time he made a grimace. He studied acting for one year at the Simon acting school. There he made some useful contacts, including Daniel Gélin among others. During the occupation of Paris in the Second World War, he continued his piano studies at a music school, where he fell in love with a secretary, named Jeanne de Maupassant, a grand-niece of writer Guy de Maupassant. She had fallen in love with \"the young man who played jazz like god\"; they married in 1943, and had two sons born in 1944 and 1949. Funès continued playing piano at clubs, knowing there wasn't much call for a short, balding, skinny actor. His wife and Daniel Gelin encouraged him until he managed to overcome his rejection. He made his film debut in 1945, at the age of 31, and went on playing about one hundred film roles in the next twenty years. Louis de Funès shot to international fame in the 1960's after his roles in such slapstick comedies as 'Le gendarme de St. Tropez' (The Gendarme of St. Tropez 1964) and the Fantomas (1964) trilogy. He brilliantly portrayed a funny French policeman, whose hilarious hyperactivity, uncontrolled anger, and sardonic laughter produced a highly comic effect. Funès was voted the most favorite actor in France in 1968, and remained very popular in Europe during the 1970's. He also continued to play on stage during his career as a film star, and was acclaimed for his stage works in classic French theatre. Funès was instrumental in making film adaptations of such theatre plays as 'Oscar continues' and the Moliere's 'Le Misere', among other plays. Nicknamed \"the man with the forty faces per minute\", Louis de Funès played bit parts in over eighty films, before he got his first leading roles, eventually becoming the leading French comedian. He co-starred with the major French actors of the time, including Jean Marais and Mylène Demongeot in the Fantomas trilogy, and also Jean Gabin, Fernandel, Bourvil, Coluche, Annie Girardot, and Yves Montand. Funès's collaboration with director 'Gerard Oury' produced a memorable tandem of Funès-Bourvil. He also worked with Jean Girault in the famous 'Gendarmes' series. In a departure from the Gendarme image, Funès collaborated with Claude Zidi, who wrote for him a new character full of nuances and frankness in L'aile ou la cuisse (1976), which is arguably the best of his roles. Funès played over 130 roles in film and over 100 roles on stage. From 1943-1983 Louis de Funès was married to Jeanne Barthelemy de Maupassant. Their son, named 'Olivier De Funes' , had a brief acting career before becoming a pilot with Air France, his other son, named Patric de Funes, became a medical doctor. Louis de Funès was also a rose grower, a variety of roses has been named the \"Louis de Funès rose\" after him. He died of a heart attack and complications of a stroke on January 27, 1983, in Nantes, France. He was laid to rest in the Cimetière du Cellier, and a monument of him was erected in the rose-garden of his wife's castle.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc5NTkyMDU4Nl5BMl5BanBnXkFtZTgwNzk0NTM1NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000086","name":"Louis de Funès","nicknames":["Fufu"],"idIMDB":"nm0000086"},"actorId":"nm0000086","character":"Charles Duchemin","urlCharacter":"http://www.imdb.com/character/ch0501787","main":true},{"actorName":"Coluche","urlProfile":"http://www.imdb.com/name/nm0173354","urlPhoto":"","biography":{"dateOfBirth":"28 October 1944","placeOfBirth":" Paris, France","birthName":"Michel Colucci","bio":"Coluche was born on October 28, 1944 in Paris, France as Michel Colucci. He is known for his work on Tchao pantin (1983), L'aile ou la cuisse (1976) and Inspecteur la Bavure (1980). He was married to Véronique K. Colucci. He died on June 19, 1986 in Opio, Alpes-Maritimes, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0173354","name":"Coluche","idIMDB":"nm0173354"},"actorId":"nm0173354","character":"Gérard Duchemin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ann Zacharias","urlProfile":"http://www.imdb.com/name/nm0951578","urlPhoto":"","biography":{"dateOfBirth":"19 September 1956","placeOfBirth":" Stockholm, Sweden","birthName":"Anne Zezette Zacharias","bio":"Ann Zacharias was born on September 19, 1956 in Stockholm, Sweden as Anne Zezette Zacharias. She is an actress and director, known for L'aile ou la cuisse (1976), The Last Adventure (1974) and A Young Emmanuelle (1976).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0951578","name":"Ann Zacharias","idIMDB":"nm0951578"},"actorId":"nm0951578","character":"Marguerite #2 - la secrétaire intérimaire","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julien Guiomar","urlProfile":"http://www.imdb.com/name/nm0347453","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc3NTYxOTE1NF5BMl5BanBnXkFtZTgwMDE4MzI1NTE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 May 1928","placeOfBirth":" Morlaix, Finistère, France","bio":"Passionate about acting, Julien Guiomar has left a lasting imprint on the theater (since 1952), on television (since 1958) and on the big screen (since 1966) in a career spanning five decades. And yet, Guiomar first saw himself as a dentist, ... like Daddy! But he finally proved the saying 'Like father like song' wrong. Too bad for dentistry but so much the better for entertainment which otherwise would have had to do without his singular talent. And, to tell the truth, Julien Guiomar did not coddle himself. He indeed appeared in over thirty plays with Jean Vilar's famed Théâtre National Populaire (TNP); he was in more than forty TV films, in which his incredible presence allowed him to embody such figures as Alexandre Borgia or Diafoirus in Molière's Le malade imaginaire (1971). His film parts are even more numerous and include authority figures (colonels, police commissioners, prelates and even God Himself in Arthur Joffé's curious comedy Let There Be Light (1998). As of his first two appearances, in Philippe de Broca's King of Hearts (1966), as a lunatic who takes himself for a bishop and in Louis Malle's The Thief of Paris (1967) as a phony priest, Julien Guiomar has imposed an image of authority tinged with eccentricity. Always colorful in his expression, he can also exert sheer spitefulness (the colonel in Costa-Gavras Z (1969)) or warm humanity (the surgeon of Serge Korber's Je vous ferai aimer la vie (1979)). He may have been in too many campy comedies but he saves them from total crassness by his mere inspired presence. Julien Guiomar retired in 2004 after a final TV Film.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc3NTYxOTE1NF5BMl5BanBnXkFtZTgwMDE4MzI1NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0347453","name":"Julien Guiomar","idIMDB":"nm0347453"},"actorId":"nm0347453","character":"Jacques Tricatel","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Claude Gensac","urlProfile":"http://www.imdb.com/name/nm0312985","urlPhoto":"","biography":{"dateOfBirth":"1 March 1927","placeOfBirth":" Acy-en-Multien, Oise, France","birthName":"Claude Jeanne Malca Gensac","bio":"Claude Gensac was born on March 1, 1927 in Acy-en-Multien, Oise, France as Claude Jeanne Malca Gensac. She was an actress, known for L'immortel (2010), L'aile ou la cuisse (1976) and The Cabbage Soup (1981). She was married to Henri Chemin and Pierre Mondy. She died on December 27, 2016 in Paris, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0312985","name":"Claude Gensac","idIMDB":"nm0312985"},"actorId":"nm0312985","character":"Marguerite #1 - la secrétaire de Duchemin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Georges Chamarat","urlProfile":"http://www.imdb.com/name/nm0150115","urlPhoto":"","biography":{"dateOfBirth":"30 March 1901","placeOfBirth":" Paris, France","bio":"Georges Chamarat was born on March 30, 1901 in Paris, France. He was an actor, known for Diabolique (1955), L'aile ou la cuisse (1976) and The Adventures of Arsène Lupin (1957). He died on November 21, 1982 in Paris.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0150115","name":"Georges Chamarat","idIMDB":"nm0150115"},"actorId":"nm0150115","character":"Le doyen des académiciens","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean Martin","urlProfile":"http://www.imdb.com/name/nm0552483","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY2MDA0ODUyMF5BMl5BanBnXkFtZTcwNjI5ODQwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1922","placeOfBirth":" Paris, France","height":"6' 2¾\" (1.9 m)","bio":"Jean Martin was born on March 6, 1922 in Paris, France. He was an actor, known for The Battle of Algiers (1966), My Name Is Nobody (1973) and The King and the Mockingbird (1980). He died on February 2, 2009 in Paris.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY2MDA0ODUyMF5BMl5BanBnXkFtZTcwNjI5ODQwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0552483","name":"Jean Martin","idIMDB":"nm0552483"},"actorId":"nm0552483","character":"Le médecin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fernand Guiot","urlProfile":"http://www.imdb.com/name/nm0347462","urlPhoto":"","biography":{"dateOfBirth":"7 August 1932","placeOfBirth":" Namur, Belgium","bio":"Fernand Guiot was born on August 7, 1932 in Namur, Belgium. He is an actor, known for L'aile ou la cuisse (1976), Le vélo de Ghislain Lambert (2001) and Impromptu (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0347462","name":"Fernand Guiot","idIMDB":"nm0347462"},"actorId":"nm0347462","character":"Dubreuil - un collaborateur de Duchemin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gérard Boucaron","urlProfile":"http://www.imdb.com/name/nm0098859","urlPhoto":"","biography":{"bio":"Gérard Boucaron is an actor, known for L'aile ou la cuisse (1976), Going Places (1974) and A Genius, Two Friends, and an Idiot (1975).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0098859","name":"Gérard Boucaron","idIMDB":"nm0098859"},"actorId":"nm0098859","character":"Ficelle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Antoine Marin","urlProfile":"http://www.imdb.com/name/nm0547433","urlPhoto":"","biography":{"dateOfBirth":"24 August 1926","placeOfBirth":" Lyon, Rhône, Rhône-Alpes, France","bio":"Antoine Marin was born on August 24, 1926 in Lyon, Rhône, Rhône-Alpes, France. He was an actor, known for L'aile ou la cuisse (1976), Les lendemains qui tuent (1990) and The Troops & Aliens (1979). He died on January 21, 1994 in Paris, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0547433","name":"Antoine Marin","idIMDB":"nm0547433"},"actorId":"nm0547433","character":"Un collaborateur de Duchemin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yves Afonso","urlProfile":"http://www.imdb.com/name/nm0012734","urlPhoto":"","biography":{"dateOfBirth":"13 February 1944","placeOfBirth":" Saulieu, Côte-d'Or, France","bio":"Yves Afonso was born on February 13, 1944 in Saulieu, Côte-d'Or, France. He is an actor, known for The Clockmaker of St. Paul (1974), L'aile ou la cuisse (1976) and Made in U.S.A (1966).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0012734","name":"Yves Afonso","idIMDB":"nm0012734"},"actorId":"nm0012734","character":"Le faux plombier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Raymond Bussières","urlProfile":"http://www.imdb.com/name/nm0124482","urlPhoto":"","biography":{"dateOfBirth":"3 November 1907","placeOfBirth":" Ivry-la-Bataille, Eure, Haute-Normandie, France","bio":"Raymond Bussières was born on November 3, 1907 in Ivry-la-Bataille, Eure, Haute-Normandie, France. He was an actor and writer, known for The King and the Mockingbird (1980), Paris When It Sizzles (1964) and Casque d'Or (1952). He was married to Annette Poivre. He died on April 29, 1982 in Paris, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0124482","name":"Raymond Bussières","idIMDB":"nm0124482"},"actorId":"nm0124482","character":"Henri - le chauffeur de Duchemin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Philippe Bouvard","urlProfile":"http://www.imdb.com/name/nm0100410","urlPhoto":"","biography":{"dateOfBirth":"6 November 1929","placeOfBirth":" Coulommiers, Seine-et-Marne, France","bio":"Philippe Bouvard was born on November 6, 1929 in Coulommiers, Seine-et-Marne, France. He is an actor and writer, known for Samedi soir (1971), Le petit théâtre de Bouvard (1982) and Les grosses têtes (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0100410","name":"Philippe Bouvard","idIMDB":"nm0100410"},"actorId":"nm0100410","character":"Philippe Bouvard - l'animateur du débat","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marcel Dalio","urlProfile":"http://www.imdb.com/name/nm0197950","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyODk3OTIyOF5BMl5BanBnXkFtZTcwNDMwMjgwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1900","placeOfBirth":" Paris, France","birthName":"Israel Moshe Blauschild","height":"5' 6\" (1.68 m)","bio":"Sunday, November the 20th is the anniversary of Marcel Dalio's death in 1983. It was the end of a serendipitous life. You know him. He was a citizen of the world. Born Israel Moshe Blauschild, in Paris, in 1900, he became a much sought-after character actor. His lovely animated face with its great expressive eyes became familiar across Europe. He appeared in Jean Renoir's idiosyncratic \"Rules of the Game\" (The Rules of the Game (1939)) and \"Grand Illusion\" (La Grande Illusion (1937)), arguably the greatest of all films. True to his Frenchman's heart, he married the very young, breathtaking beauty Madeleine Lebeau. He worked with von Stroheim and Pierre Chenal. He had it all. But then the Germans crushed Poland, swept across Belgium and pressed on toward Paris. He waited until the last possible moment and finally, with the sound of artillery clearly audible, with Madeleine, fled in a borrowed car to Orleans and then, in a freight train, to Bordeaux and finally to Portugal. In Lisbon, they bribed a crooked immigration official and were surreptitiously given two visas for Chile. But on arriving in Mexico City, it was discovered the visas were rank forgeries. Facing deportation, Marcel and Madeleine found themselves making application for political asylum with virtually every country in the western hemisphere. Weeks passed until Canada finally issued them temporary visas, and they left for Montreal. Meanwhile, France had fallen and, in the process of subjugating the country, the Germans had found some publicity stills of Dalio. A series of posters were produced and were then displayed throughout the city with the caption 'a typical Jew' so that citizens could more easily report anyone suspected of unrepentant Jewishness. The madness continued. The Curtain Rises (1938), a popular film, was ordered re-edited so that Dalio's scenes could be deleted and re-shot with another, non-Jewish, actor. After a short time, friends in the film industry arranged for them to arrive in Hollywood. Nearly broke, Marcel was immediately put to work in a string of largely forgettable films. Madeleine, a budding actress in her own right, was ironically cast in Hold Back the Dawn (1941), a vehicle for Charles Boyer with a plot driven by the efforts of an émigré (Boyer) trying desperately to cross into the United States from Mexico. But the real irony was waiting at Warner Brothers. In early 1942, Jack L. Warner was driving production of a film based on a one act play, 'Everybody Comes to Rick's' but had no screenplay. What he had was a mishmash of treatments loosely based on the play and two previous movies. But he had a projected release date and a commitment to his distributors to have a movie for that time slot and little else. Warner Brothers started to wing it. Shooting started without a screenplay and little plot. Principal players were cast and a director hired but casting calls for supporting roles and bit players continued, and sometime in the early spring Marcel Dalio and Madeleine Lebeau were cast as, respectively, a croupier and a romantic entanglement for the male lead. Veteran screen-writers were hired to produce a running screenplay, sometimes delivering pages of dialogue one day, for scenes to be shot the following day. No one knew exactly where the plot would go or how the story would turn out. No one was sure of the ending. And, of course, they produced a classic, perhaps the finest, American movie. They produced a screenplay of multiple genres, rich with characterizations, perfectly in tune with the unfolding events in Europe and loaded with talent from top to bottom. Oh, and they changed the title to Casablanca (1942). It is so well known, that many lines of long-memorized dialogue have passed into the slang idiom. 'We'll always have Paris', 'I was misinformed', 'Here's looking at you, kid', ' I am shocked! Shocked! To find that there's gambling going on in here!', 'Louis, I think this is the beginning of a beautiful friendship', 'Oh he's just like any other man, only more so', 'I don't mind a parasite. I object to a cut-rate one', 'Round up the usual suspects', and, of course, the iconic 'Play it, Sam,' often misquoted as 'Play it again, Sam,' the title of the Woody Allen movie. Madeleine Lebeau plays Yvonne, the jilted lover of Humphrey Bogart, who is seen drowning her sorrows at the bar early in the film and who later, to get back at Rick and looking for solace takes up with a German officer finding only self-hatred. She is luminous. And when Claude Rains delivers the signature line, 'I'm shocked! Shocked! To find that there's gambling going on in here!' the croupier, Emil, played by Marcel Dalio, approaches from the roulette table and says simply, 'Your winnings, sir.' It is a delicious moment ripe with scripted irony, one among many in this film, but one made all the more so, knowing where Dalio came from and what he and his wife had endured to arrive at that line. Alas, they separated and divorced the next year, both going on to long successful careers. Dalio never remarried. Late in his career, when Mike Nichols was looking for a vaguely familiar face to deliver a long and worldly, near-monologue in Catch-22 (1970), he turned to Dalio. Faced with a hopelessly idealistic young American pilot, Dalio in tight close-up, delivers a discourse on practical people faced with impractical circumstances, of the virtues of expedience in the face of amorality. Using his wonderful plastic features, now beginning to sag, in a voice full of melancholy, the old man reassures the young man that regardless of what 'grand themes' may be afoot in the world, in the end, little matters but survival.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyODk3OTIyOF5BMl5BanBnXkFtZTcwNDMwMjgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0197950","name":"Marcel Dalio","idIMDB":"nm0197950"},"actorId":"nm0197950","character":"Le tailleur de Duchemin","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vittorio Caprioli","urlProfile":"http://www.imdb.com/name/nm0135671","urlPhoto":"","biography":{"dateOfBirth":"15 August 1921","placeOfBirth":" Naples, Campania, Italy","bio":"Vittorio Caprioli was born on August 15, 1921 in Naples, Campania, Italy. He was an actor and writer, known for General Della Rovere (1959), The Man from Acapulco (1973) and Tout va bien (1972). He was married to Franca Valeri. He died on October 2, 1989 in Naples.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0135671","name":"Vittorio Caprioli","idIMDB":"nm0135671"},"actorId":"nm0135671","character":"Vittorio - le patron d'un restaurant","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0074103","urlIMDB":"http://www.imdb.com/title/tt0074103","business":{"budget":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"openingWeekend":null,"gross":[{"money":"SEK","country":"1,433,266","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1976/\">1976</a>"},{"money":"5,837,000 (France)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"3,200,000 (West","country":"Germany","day":"31","month":"12","year":"1977","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1976/\">1976</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 44 min (104 min)"],"soundMix":["Mono"],"color":["Color (Eastmancolor)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Laboratoires Éclair, Paris, France"],"filmLength":["2,900 m (Finland)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"7.3","filmingLocations":[{"location":"Place d'Iéna, Paris 16, Paris, France"}],"rated":"TOUS PUBLICS","awards":[{"award":"Golden Screen, Germany 1978","titlesAwards":[{"titleAwardOutcome":"Won Golden Screen","categories":[{"category":"","names":[]}]}]}],"votes":"7,393","type":"Movie","companyCreditsSimple":[{"idCompany":"co0044473","name":"Les Films Christian Fechner"}],"keywords":{"keywords":["restaurant","food","gourmet","clown","restaurant review","french kitchen","father son conflict","disdain","disgust","social satire","eating","evil industrialist","evil capitalist","gastronomy","cook","undercover","restaurant owner","meal","industrialist","food industry","father son relationship","culinary guide","loss of taste","circus","wine","decoy","academie francaise","french culture","broken leg","hospital","eating oyster","suitcase","hotel","mercedes","chauffeur","stenographer","secretary","false plumber","waiter","dentist","tailor","rash","publicity","kitchen","inn"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:10:25"}}