{"data":{"movies":[{"title":"Speak Easily","originalTitle":"","year":"1932","releaseDate":"19320813","directors":[{"name":"Edward Sedgwick","id":"nm0781292"}],"writers":[{"name":"Clarence Budington Kelland","id":"nm0445502"},{"name":"Ralph Spence","id":"nm0817809"}],"runtime":"82 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgwMTcwMDU2OV5BMl5BanBnXkFtZTcwNDY1NzI0NQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"Naive, bookish Professor Post (of Potts College) inherits a huge amount of money and decides that now he can afford to go out and enjoy life. He falls for a dancer in a bad stage show, and with his new money decides to buy the show and take it to Broadway. Will the Professor prove too nice to succeed in show business? Or will he triumph over bill-collectors, critics, and sexy vamp Eleanor Espere?","simplePlot":"A timid professor inherits a large sum of money and decides to fund a terrible musical.","actors":[{"actorName":"Buster Keaton","urlProfile":"http://www.imdb.com/name/nm0000036","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MjA4ODk5OF5BMl5BanBnXkFtZTYwNDQyNjI2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1895","placeOfBirth":" Piqua, Kansas, USA","birthName":"Joseph Frank Keaton","height":"5' 5\" (1.65 m)","bio":"When at six months of age he tumbled down a flight of stairs unharmed, he was given the name \"Buster\" by Harry Houdini who, along with W.C. Fields, Bill Robinson (\"Bojangles\"), Eddie Cantor and Al Jolson shared headlines with \"The Three Keatons\": Buster, his father Joe Keaton and mother Myra Keaton. Their act, one of the most dangerous in vaudeville, was about how to discipline a prankster child. Buster was thrown all over the stage and even into the audience. No matter what the stunt, he was poker-faced. By the time Buster turned 21, however, his father was such a severe alcoholic that the stunts became too dangerous to perform and the act dissolved. He first saw a movie studio in March 1917 and, on April 23, his debut film, Roscoe 'Fatty' Arbuckle's The Butcher Boy (1917), was released. He stayed with Fatty through 15 two-reelers, even though he was offered much more to sign with Fox or Warner Bros. after returning from ten months with the U.S. Army (40th Infantry Division) in France. His first full-length feature, The Saphead (1920), established him as a star in his own right. By the middle of 1921 he had his own production company--Buster Keaton Productions--and was writing, directing and starring in his own films. With a small and close team around him, Keaton created some of the most beautiful and imaginative films of the silent era. The General (1926), his favorite, was one of the last films over which he had artistic control. In 1928 he reluctantly signed with MGM after his contract with independent producer Joseph M. Schenck expired. MGM quickly began to enforce its rigid, mechanized style of filmmaking on Keaton, swamping him with gag writers and scripts. He fought against it for a time, and the compromise was initially fruitful, his first film for MGM--The Cameraman (1928)--being one of his finest. However,with his creativity becoming increasingly stifled he began to drink excessively, despondent at having to perform material that was beneath him. Ironically, his films around 1930 were his most successful to date in terms of box-office receipts, which confirmed to MGM that its formula was right. His drinking led to a disregard for schedules and erratic behavior on the MGM lot, and a disastrous confrontation with Louis B. Mayer resulted in him being fired. The diplomatic producer Irving Thalberg attempted to smooth things over but Keaton was past caring. By 1932 he was a divorced alcoholic, getting work where he could, mostly in short comedies. In 1935 he entered a mental hospital. MGM rehired him in 1937 as a $100-a-week gag writer (his salary ten years before was more than ten times this amount). The occasional film was a boost to this steady income. In 1947 his career rebounded with a live appearance at Cirque Medrano in Paris. In 1952 James Mason, who then owned Keaton's Hollywood mansion, found a secret store of presumably lost nitrate stock of many of Buster's early films; film historian and archivist Raymond Rohauer began a serious collection/preservation of Buster's work. In 1957 Buster appeared with Charles Chaplin in Limelight (1952) and his film biography, The Buster Keaton Story (1957), was released. Two years later he received a special Oscar for his life work in comedy, and he began to receive the accolades he so richly deserved, with festivals around the world honoring his work. He died in 1966, age 70.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MjA4ODk5OF5BMl5BanBnXkFtZTYwNDQyNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000036","name":"Buster Keaton","nicknames":["The Great Stone Face","Malec"],"idIMDB":"nm0000036"},"actorId":"nm0000036","character":"Professor Post","urlCharacter":"http://www.imdb.com/character/ch0495816","main":true},{"actorName":"Jimmy Durante","urlProfile":"http://www.imdb.com/name/nm0002051","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1OTcxMzM5MF5BMl5BanBnXkFtZTYwMzIzMzQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 February 1893","placeOfBirth":" New York City, New York, USA","birthName":"James Francis Durante","height":"5' 7\" (1.7 m)","bio":"First wife Jeanne died in 1943. Wed second wife, Marjorie Little after 16 year courtship when she was 39 and he 67 Marjorie Little had been the hatcheck girl at the Copacabana. Durante and his second wife adopted a baby girl, Cecelia Alicia on Christmas day 1961. Durante doted on \"CeCe\" until his death.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1OTcxMzM5MF5BMl5BanBnXkFtZTYwMzIzMzQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002051","name":"Jimmy Durante","nicknames":["The Schnoz"],"idIMDB":"nm0002051"},"actorId":"nm0002051","character":"James","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ruth Selwyn","urlProfile":"http://www.imdb.com/name/nm0783643","urlPhoto":"","biography":{"dateOfBirth":"6 November 1905","placeOfBirth":" Tazewell, Virginia, USA","birthName":"Ruth Wilcox","bio":"She was born Ruth Wilcox, the sister of director Fred McLeod Wilcox, who directed \"Lassie, Come Home\" (1943) and \"Forbidden Planet\" (1956), and former showgirl Pansy Wilcox, who was married to Loew's Inc. President Nicholas M. Schenck, one of the pioneers of the film industry. Ruth and her siblings were the children of James Wilcox, a Kentucky optometrist and drugstore owner, who was married six times, twice to one woman. His six children were from his first wife. Ruth married former playwright and movie producer-director-writer Edgar Selwyn, for whom she appeared in his \"Men Must Fight\" (1933). A contract player at Metro-Goldwyn-Mayer, she made her first two movie appearances in Marion Davies pictures, \"Five and Ten\" (1931), her uncredited debut, and \"Polly of the Circus\" (1932), for which she received her first credit. Her most memorable role was as Pansy Peets in \"Speak Easily\" (1933), in which she supported Buster Keaton and Jimmy Durante and received third-billing. She made only two more movies after appearing in \"Men Must Fight,\" retiring after Raoul Walsh's \"Baby Face Harrington\" (1935), which was produced by her husband. Ruth and Edgar Selwyn eventually divorced. They had one son, Rusty, who was born during Ruth's previous marriage to a man surnamed Synder, and who was adopted by Edgar during their marriage.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0783643","name":"Ruth Selwyn","idIMDB":"nm0783643"},"actorId":"nm0783643","character":"Pansy Peets","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thelma Todd","urlProfile":"http://www.imdb.com/name/nm0865298","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5Mjk4ODc5MF5BMl5BanBnXkFtZTgwODQyNjc3MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1906","placeOfBirth":" Lawrence, Massachusetts, USA","height":"5' 4\" (1.63 m)","bio":"Thelma Todd was born in Lawrence, Massachusetts, an industrial city near the New Hampshire state line. She was a lovely child with good academic tendencies, so much so that she decided early on to become a schoolteacher. After high school she went on to college but at her mother's insistence entered several beauty contests (apparently her mother wanted her to be more than just a \"schoolmarm\"). Thelma was so successful in these endeavors that she entered on the state level and won the title of \"Miss Massachusetts\" in 1925 and went on to the \"Miss America\" pageant. Although she didn't win, the pageant afforded her a chance to be seen been by talent scouts looking for fresh new faces to showcase in films. She began appearing in one- and two-reel shorts, mostly comedy, which showcased her keen comic timing and aptitude for physical comedy (unusual in such a beautiful woman). She had been making shorts for Hal Roach when she was signed to Paramount Pictures. Her first film--at 21 years of age--was as Lorraine Lane in 1927's Fascinating Youth (1926), a romantic comedy, which was Paramount's showcase vehicle for its new stars. Thelma received minor billing in another film that year, God Gave Me Twenty Cents (1926). The next year she starred with Gary Cooper and William Powell in the western Nevada (1927). That year also saw her in three more films, with The Gay Defender (1927) being the most notable. It starred Richard Dix in the role of a man falsely accused of murder. As the 1920s closed, Thelma began getting parts in more and more films. In 1928 and 1929 alone she was featured in 20 pictures, and not just comedies--she also did dramas and gothic horror films. Unlike many silent-era stars whose voices didn't fit their image or screen persona, Thelma's did. She had a bright, breezy, clear voice with a pleasant trace of a somewhat aristocratic, but not snobbish, New England accent and easily made the transition to sound films. In 1930 she added 14 more pictures to her resume, with Dollar Dizzy (1930) and Follow Thru (1930) being the most notable. The latter was a musical with Thelma playing a rival to Nancy Carroll for the affections of Buddy Rogers. It was a box-office hit, as was the stage production on which it was based. The following year Thelma appeared in 14 more films, among them Let's Do Things (1931), Speak Easily (1932), The Old Bull (1932) and On the Loose (1931). Her most successful film that year, however, was the Marx Brothers farce Monkey Business (1931). While critics gave the film mixed reviews, the public loved it. In 1932 Thelma appeared in another Marx Brothers film directed by Norman Z. McLeod, Horse Feathers (1932). She also starred in This Is the Night (1932), a profitable film which featured Cary Grant in his first major role. In 1934 Thelma made 16 features, but her career would soon soon come to a grinding halt. In 1935 she appeared in such films as Twin Triplets (1935) and The Misses Stooge (1935), all showcasing her considerable comic talents. She also proved to be a savvy businesswoman with the opening of \"Thelma Todd's Sidewalk Cafe,\" a nightclub/restaurant that catered to show business people. It also, unfortunately, attracted some shady underworld types as well, and there were rumors that they were trying to take over her club and use it as a gambling establishment in order to fleece the wealthy Hollywood crowd. According to these stories, Thelma and her boyfriend, director Roland West, wouldn't sell their establishment once they found out what the gangsters had in mind, thereby incurring the enmity of people it was not a good idea to become enemies of. Whether the stories were true or not, on December 16, 1935, Thelma was found dead in her car in her garage in Los Angeles. Her death was ruled a suicide owing to carbon monoxide poisoning. She was only 29 years old. At the time, as today, many felt that her death was actually a murder connected to the goings-on at her club, a theory that was lent credence by the fact that no one who knew her had ever seen her depressed or morose enough to worry about her committing suicide. Another factor that aroused suspicion was that her death was given a cursory investigation by the--at the time--notoriously corrupt Los Angeles County District Attorney's Office and the case was quickly and unceremoniously closed. Her death has remained a controversial one even to this day. Three films she made before her death weren't released until the following year: Hot Money (1936), An All American Toothache (1936), and The Bohemian Girl (1936). The latter saw her quite substantial role cut down so much that she was barely glimpsed in the picture. Thelma had made an amazing 115 films in such a short career, and her beauty and talent would no doubt have taken her right to the top if it hadn't been for her untimely demise.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5Mjk4ODc5MF5BMl5BanBnXkFtZTgwODQyNjc3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0865298","name":"Thelma Todd","nicknames":["The Ice Cream Blonde","Hot Toddy"],"idIMDB":"nm0865298"},"actorId":"nm0865298","character":"Eleanor Espere","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hedda Hopper","urlProfile":"http://www.imdb.com/name/nm0394407","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU0NzAyMDk0NF5BMl5BanBnXkFtZTYwNDMxOTE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 May 1885","placeOfBirth":" Hollidaysburg, Pennsylvania, USA","birthName":"Elda Furry","height":"5' 7\" (1.7 m)","bio":"Her father was a butcher. In 1913 she met and married matinée idol DeWolf Hopper Sr. and in 1915 they moved to Hollywood, where both began active film careers. He became a star with Triangle Company, she began in vamp parts and turned to supporting roles. After her divorce she appeared in dozens of films, becoming known as \"Queen of the Quickies\". In 1936 she started a gossipy radio show and two years later commenced a 28-year stint as a newspaper gossip columnist, rival of Louella Parsons. In her last films she mostly played herself, a tribute to her influence in Hollywood. Her son became famous as investigator Paul Drake in the Perry Mason (1957) series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzU0NzAyMDk0NF5BMl5BanBnXkFtZTYwNDMxOTE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0394407","name":"Hedda Hopper","idIMDB":"nm0394407"},"actorId":"nm0394407","character":"Mrs. Peets","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Pawley","urlProfile":"http://www.imdb.com/name/nm0269524","urlPhoto":"","biography":{"dateOfBirth":"21 July 1905","placeOfBirth":" Kansas City, Missouri, USA","height":"6' (1.83 m)","bio":"William Pawley was born on July 21, 1905 in Kansas City, Missouri, USA. He was an actor, known for The Grapes of Wrath (1940), Speak Easily (1932) and Rough Riders' Round-up (1939). He died on June 15, 1952 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0269524","name":"William Pawley","idIMDB":"nm0269524"},"actorId":"nm0269524","character":"Griffo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sidney Toler","urlProfile":"http://www.imdb.com/name/nm0866010","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyODc3MzI3NF5BMl5BanBnXkFtZTcwMjQzNjYyNw@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1874","placeOfBirth":" Warrensburg, Missouri, USA","height":"6' (1.83 m)","bio":"The son of Colonel H.G. Toler, breeder of trotting horses, Sidney Toler acted on stage by the time he was seven years old. He was an established star of the theater by the 1890's, long before his career in motion pictures. He was also active as a playwright and had a good enough voice to be cast as a lead baritone with an operatic stock company at the Orpheum Theatre in New York. He made his Broadway debut in 'The Office Boy' in 1903 and for the next nine years went on the road with his own touring acting troupes. His prowess as a writer equaled that of his performances, with two of his plays opening on Broadway, while a third ('The Man They Left Behind') was enacted by no less than eighteen different stock companies in a single week nationwide. Frequently under the auspices of theatrical impresario David Belasco, Sidney starred in Broadway comedy for twelve years (1918-30). Abandoning his successful stage career, he made the move to Hollywood and played supporting roles as a free-lance actor for several years, often as police officers, bankers or butlers. In the mid-1930's, he joined 20th Century Fox under contract. The death of 'Charlie Chan' impersonator Warner Oland in 1938 presented him with an opportunity for a leading role, and he successfully auditioned for the part among 34 candidates screen-tested. His expansive, avuncular personality made Sidney, arguably, the most popular incarnation of the famous oriental detective, with a strong line in sarcastic wit, usually directed at 'Number One Son'. He played Chan in 22 feature films, beginning with Charlie Chan in Honolulu (1938), and ending with The Trap (1946). The first 11 Charlie Chan films were produced by 20th Century Fox Studios, all of which were box office hits. However, by 1942 and after 11 Charlie Chan feature films, the quality of the series began to decline. With America's entry into the Second World War causing overseas markets to dwindle, Fox retired the series, but two years later in 1944, sold the character rights to the 'poverty row' dweller Monogram Pictures, which effectively meant poorer scripts and lower production values. Moreover, after years of being typecast as Charlie Chan, and given few opportunities to expand his range as an actor, Sidney's performances also became less defined and more automatic. During filming of the last three 'Charlie Chan' installments which were 'Shadows Over Chinatown' 'Dangerous Money', and 'The Trap' (all filmed in 1946), Sidney became increasingly incapacitated due to ill-health from cancer, resulting in extra screen time for his co-stars Mantan Moreland and Victor Sen Yung. After being bedridden for several months, he passed away at his Hollywood home from intestinal cancer on February 12, 1947 at age 72.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyODc3MzI3NF5BMl5BanBnXkFtZTcwMjQzNjYyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0866010","name":"Sidney Toler","idIMDB":"nm0866010"},"actorId":"nm0866010","character":"Stage Director","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lawrence Grant","urlProfile":"http://www.imdb.com/name/nm0335517","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMzUwMjUzM15BMl5BanBnXkFtZTgwMTk5NDc0MzE@._V1._CR60,87,617,844_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 October 1870","placeOfBirth":" Bournemouth, Dorset, England, UK","birthName":"Percy Reginald Lawrence-Grant","height":"6' (1.83 m)","bio":"As a young boy in England, Lawrence Grant became a great admirer of the Native American peoples. He devoured every book or article he could get his hands on relating to their culture and history. Years later Grant got the opportunity to spend some months living with several Native American tribes in Wyoming and Montana. He filmed his experiences using an early motion picture color film process called Kinemacolor. Later, after editing the thousands of feet of film he shot, Grant embarked on a lecture tour that he named \"Travels with Kinemacolor\". Grant first came to America in 1908 with a repertoire company that also starred Pauline Frederick. Within a few years he was able to launch a successful 25 year career as a Hollywood character actor. Lawrence Grant died on 19 February 1952, in Santa Barbara, California, at the age of 81. His health began to fail him the previous year after four performances he gave at the Santa Barbara Lobero Theater during a major heat wave. Though married four times, the only immediate family he had at the time of his death was four nieces living in England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMzUwMjUzM15BMl5BanBnXkFtZTgwMTk5NDc0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0335517","name":"Lawrence Grant","idIMDB":"nm0335517"},"actorId":"nm0335517","character":"Dr. Bolton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Henry Armetta","urlProfile":"http://www.imdb.com/name/nm0035455","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmQ0NGQ3NTctMGM2YS00MmQ3LTg5NmQtNzliYWJlMDRjZjA0XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 July 1888","placeOfBirth":" Palermo, Sicily, Italy","bio":"Sicilian-born character actor who appeared in scores of American films, usually as an exuberant and demonstrative Italian. As a teenager in 1902, Armetta stowed away on a boat bound for New York. There he did menial jobs until landing a position as a valet and presser at the Lambs Club, the New York actors' club. One of the members took a liking Armetta and arranged a small role for him in a Broadway show. Armetta followed this with many stage roles both in New York and in stock. In the early Twenties, he moved to California in search of work in movies, of which he'd had a taste while in New York. In Hollywood, Armetta slowly gained a name for himself as a character actor, and by the end of the decade, he had carved a niche for himself as a portrayer of humorous and sympathetic Italian immigrants, a position he maintained into the 1940s. He died of heart failure at 57.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmQ0NGQ3NTctMGM2YS00MmQ3LTg5NmQtNzliYWJlMDRjZjA0XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0035455","name":"Henry Armetta","idIMDB":"nm0035455"},"actorId":"nm0035455","character":"Tony","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edward Brophy","urlProfile":"http://www.imdb.com/name/nm0112395","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzExNGE4MTQtZDAzZi00YzM4LWE3ZDEtZTE0NTQzNzgzZGU1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1895","placeOfBirth":" New York City, New York, USA","birthName":"Edward Santree Brophy","height":"5' 5\" (1.65 m)","bio":"Edward S. Brophy was born on February 27, 1895 in New York City and educated at the University of Virginia. He became a bit and small-part in the movies starting in 1919, but switched to behind-the-scenes work for job security, though he continued appearing in small parts. While serving as a property master for Buster Keaton's production unit at Metro-Goldwyn-Mayer, Brophy appeared in a memorable sequence in Keaton's classic The Cameraman (1928), in which Buster and Brophy both try to undress simultaneously in a tiny wardrobe room. Keaton cast Brophy in larger parts in two of his talkies, and by 1934, Brophy abandoned the production end of the movies altogether and was acting full-time. Possessed of a chubby, bald-headed face with pop-eyes, and blessed with (for a comic) a high-pitched voice, Brophy appeared in scores of comic roles. He also played straight dramatic parts, but was less effective in them. Typical of his work was his memorable turn providing comic relief in the small supporting role of the Marine in Manila who adopts the dog \"Tripoli\" in Howard Hawks' war propaganda masterpiece Air Force (1943). In the 1950s, Brophy began taking fewer roles. His last role was in director John Ford's Western Two Rode Together (1961), during the production of which, he died on May 27, 1960 in Pacific Palisades, California. He will always be remembered to film-lovers as the voice of Timothy Mouse in Walt Disney's classic 1941 cartoon Dumbo (1941).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzExNGE4MTQtZDAzZi00YzM4LWE3ZDEtZTE0NTQzNzgzZGU1XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0112395","name":"Edward Brophy","idIMDB":"nm0112395"},"actorId":"nm0112395","character":"Reno","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0023498","urlIMDB":"http://www.imdb.com/title/tt0023498","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"09","month":"05","year":"1932","remarks":null},{"money":null,"country":null,"day":"17","month":"06","year":"1932","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 21 min (81 min) (Turner library print)","1 hr 22 min (82 min) (2005 DVD release) (USA)"],"soundMix":["Mono (Western Electric Sound System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.0","filmingLocations":[{"location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA"}],"rated":"PASSED","awards":[],"votes":"636","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"}],"keywords":{"keywords":["professor","new york city","manhattan new york city","inheritance","broadway manhattan new york city","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:53:33"}}