{"data":{"movies":[{"title":"Git Along Little Dogies","originalTitle":"","year":"1937","releaseDate":"19370322","directors":[{"name":"Joseph Kane","id":"nm0437356"}],"writers":[{"name":"Dorrell McGowan","id":"nm0569638"},{"name":"Stuart E. McGowan","id":"nm0569708"}],"runtime":"67 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2OTI0OTM4OF5BMl5BanBnXkFtZTgwMzU5Njk1MDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Music","Romance","Western"],"plot":"Maxwell is trying to bring in an oil well and Wilkens is out to stop him. When his attempted robbery of Maxwell's payroll fails, he tells the ranchers who invested on Autry's advise that the well is dry. But Gene knows there is oil there and with everyone after him he heads for the well to try and bring it in with dynamite.","simplePlot":"When war breaks out between oilmen and cattle ranchers, Gene sides with the ranchers until he learns that oil will bring a railroad to town.","actors":[{"actorName":"Gene Autry","urlProfile":"http://www.imdb.com/name/nm0000810","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MjI4MDk0OF5BMl5BanBnXkFtZTYwMjU5MDM2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1907","placeOfBirth":" Near Tioga, Texas, USA","birthName":"Orvon Grover Autry","height":"5' 9\" (1.75 m)","bio":"After high school Gene Autry worked as a laborer for the St. Louis and San Francisco Railroad in Oklahoma. Next he was a telegrapher. In 1928 he began singing on a local radio station, and three years later he had his own show and was making his first recordings. Three years after that he made his film debut in Ken Maynard's In Old Santa Fe (1934) and starred in a 13-part serial the following year for Mascot Pictures, The Phantom Empire (1935). The next year he signed a contract with Republic Pictures and began making westerns. Autry--for better or worse--pretty much ushered in the era of the \"singing cowboy\" westerns of the 1930s and 1940s (in spite of the presence in his oaters of automobiles, radios and airplanes). These films often grossed ten times their average $50,000 production costs. During World War II he enlisted in the US Army and was assigned as a flight officer from 1942-46 with the Air Transport Command. After his military service he returned to making movies, this time with Columbia Pictures, and finally with his own company, Flying A Productions, which, during the 1950s, produced his TV series The Gene Autry Show (1950), The Adventures of Champion (1955), and Annie Oakley (1954). He wrote over 200 songs. A savvy businessman, he retired from acting in the early 1960s and became a multi-millionaire from his investments in hotels, real estate, radio stations and the California Angels professional baseball team.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MjI4MDk0OF5BMl5BanBnXkFtZTYwMjU5MDM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000810","name":"Gene Autry","nicknames":["The Singing Cowboy"],"idIMDB":"nm0000810"},"actorId":"nm0000810","character":"Gene Autry","urlCharacter":"http://www.imdb.com/character/ch0182913","main":true},{"actorName":"Smiley Burnette","urlProfile":"http://www.imdb.com/name/nm0122470","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzE1NzczMF5BMl5BanBnXkFtZTcwNDAyMzExNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 March 1911","placeOfBirth":" Summum, Illinois, USA","birthName":"Lester Alvin Burnette","bio":"Smiley worked on a local radio station and in Vaudeville after high school. Always interested in music, he was friends with Gene Autry and worked with him on the radio show \"The National Barn Dance\". When Westerns became a big draw with sound, the studios were always on the lookout for singing cowboys. In 1934, both Gene and Smiley made their debuts in In Old Santa Fe (1934). Smiley became well known as Gene's plump sidekick Frog Milhouse, and they worked together in over 80 Westerns. After Gene, Smiley provided the comic relief for other cowboy stars at Republic such as Sunset Carson and Charles Starrett (The Durango Kid). He also provided a lot of the music as he wrote over 300 western songs and sang quite a few in the films. Smiley was the first supporting actor to regularly appear on the Top Ten Western money-maker list. He became well known for his white horse with the black circle around one eye. When he used a team of white horses, as when he was 'Spec Specialist' Smiley Burnette, each white horse had one black circle around one eye. When the 'B' movie Western reign ended in 1953, Smiley retired from the screen. He made occasional appearances on television including being a regular on the music show \"Ozark Jubilee (1959)\". His last performance was as railroad engineer Charlie Pratt on Petticoat Junction (1963) from 1963-67.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzE1NzczMF5BMl5BanBnXkFtZTcwNDAyMzExNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0122470","name":"Smiley Burnette","nicknames":["Ole Frog"],"idIMDB":"nm0122470"},"actorId":"nm0122470","character":"Frog Millhouse","urlCharacter":"http://www.imdb.com/character/ch0049397","main":true},{"actorName":"Maple City Four","urlProfile":"http://www.imdb.com/name/nm1283018","urlPhoto":"","biography":{"bio":"Maple City Four is an actor, known for Under Western Stars (1938), Git Along Little Dogies (1937) and The Old Barn Dance (1938).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1283018","name":"Maple City Four","idIMDB":"nm1283018"},"actorId":"nm1283018","character":"Singing Ranch Hands","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Judith Allen","urlProfile":"http://www.imdb.com/name/nm0020703","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MzYzMDgwOF5BMl5BanBnXkFtZTgwNzIwNzk1MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1911","placeOfBirth":" New York City, New York, USA","birthName":"Marie Elliott","bio":"The very pretty Judith Allen certainly had the makings of a great actress but her career fell far short, to the point that she came to be more sensational in the tabloid news than she was in the \"B\" films she graced. She was born Marie Elliot in New York City on February 8, 1911, of Scottish parentage, and raised in Belmont, Massachusetts. She began studying theatre at the Leland Powers School in Boston following high school graduation, but this was interrupted when, at the age of 19, she married pro wrestler Gus Sonnenberg (aka \"The Goat\"). The marriage went sour almost immediately and she quickly returned to the dramatic school and picked up where she left off. Following this she joined up with a stock company that toured the New England area and changed her name to the more attractive spelling and sounding Mari Colman. Paramount took notice of \"Mari\" and signed her to a contract following a screen test. Cecil B. DeMille cast her in the virginal leading lady role opposite Charles Bickford and Richard Cromwell in This Day and Age (1933), not knowing that the newcomer was already married, which had been a prerequisite for him casting her. Judith kept her faltering marriage a secret from DeMille and the studio. During shooting, DeMille took it upon himself to change her marquee name to \"Judith Allen.\" Meanwhile, jealous, estranged husband Sonnenberg broke Judith's marriage cover by blabbing to reporters just before the film's opening, to the fury of DeMille. Surprisingly, DeMille did not retaliate against Judith and she continued her Paramount career. The crimer has since reached minor cult status. A beautiful and talented Depression-era co-star for Paramount and a lovely loanout to other studios in both drama and comedy, Judith went on to appear opposite Randolph Scott in The Thundering Herd (1933); Bing Crosby in the musical Too Much Harmony (1933) (in which she sang the song \"The Day You Came Along\"); Richard Arlen in Hell and High Water (1933); Reginald Denny in Dancing Man (1934); Tom Brown in The Witching Hour (1934); Johnny Mack Brown in Marrying Widows (1934); William Haines in Young and Beautiful (1934); and Bruce Cabot in both Men of the Night (1934) and Night Alarm (1934). Her best remembered film roles of that period were in the W.C. Fields classic The Old Fashioned Way (1934), as Fields' daughter, and the Shirley Temple vehicle Bright Eyes (1934) opposite James Dunn. Judith was also reunited with Crosby in the musical She Loves Me Not (1934) but Kitty Carlisle was his musical co-star and Judith appeared in support way down in the credits. Following her divorce, Judith married Irish boxer Jack Doyle, aka \"The Gorgeous Gael,\" in April of 1935 and her career became, naturally, a second priority. A boxing loss to Buddy Baer in August of that year at Madison Square Garden severely damaged Doyle's worldwide reputation. He later tried to focus on a singing career with Allen, touring in vaudeville shows. They were not welcomed when they arrived in Ireland to perform. These upsets triggered an on-again, off-again relationship which made for great tabloid fodder. The couple did co-star together in the film Navy Spy (1937), but it was too late and they eventually split up for good. Trying to regain some late 30s film momentum, Judith was now solidly trapped in second-string programmers with roles opposite \"B\" actors Norman Foster, Regis Toomey, William Boyd, Donald Cook, Gene Autry', Harry Carey, Grant Withers and Dick Purcell for Republic Pictures and its \"Poverty Row\" subsidiaries such as Mascot, Monogram and Winchester. By the end of the decade her leading lady career had all but vanished and she was appearing unbilled in such pictures as Four Girls in White (1939) and the classic The Women (1939). Into the 1940s, Judith found work on radio, on stage, in vaudeville and in nightclubs. To supplement her income, she also sold life insurance. A rare film would come her way in the 40s and 50s, including one lead role in Train to Tombstone (1950), but it was extremely rare. She married a third time, to publisher Rudolph Field in 1941, but the breakup was nasty and it too hit the tabloid papers while they went through the throes of divorce. By 1951, Judith had abandoned the limelight. A fourth marriage would also end in divorce and she suffered a nervous breakdown following the death of her mother. In later years she joined the Mentalphysics Spiritual Teaching and Retreat Center in Joshua Tree, California (Palm Springs area) and eventually became an ordained minister. She died at age 85 in Joshua Tree.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MzYzMDgwOF5BMl5BanBnXkFtZTgwNzIwNzk1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0020703","name":"Judith Allen","idIMDB":"nm0020703"},"actorId":"nm0020703","character":"Doris Maxwell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Weldon Heyburn","urlProfile":"http://www.imdb.com/name/nm0382165","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTQwMWZlZTMtOTRjZC00MjZlLWJkMmEtNDYyZDYzMGZhZGVkXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 September 1903","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Weldon Heyburn Franks","height":"6' (1.83 m)","bio":"Weldon Heyburn was born on September 19, 1903 in Washington, District of Columbia, USA as Weldon Heyburn Franks. He was an actor, known for The 13th Man (1937), Charlie Chan in The Chinese Cat (1944) and Sea Racketeers (1937). He was married to Virginia Frances Maggard, Jane Eichelberger, Greta Nissen and Phyllis Connard Williams. He died on May 18, 1951 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTQwMWZlZTMtOTRjZC00MjZlLWJkMmEtNDYyZDYzMGZhZGVkXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0382165","name":"Weldon Heyburn","idIMDB":"nm0382165"},"actorId":"nm0382165","character":"George Wilkins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Farnum","urlProfile":"http://www.imdb.com/name/nm0267912","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1ODUyNDMyNV5BMl5BanBnXkFtZTgwNTU3Njk1MDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 July 1876","placeOfBirth":" Boston, Massachusetts, USA","bio":"William Farnum was born the son of G.D. Farnum and Adela Le Gros, actors who trained their William and his two brothers, Dustin Farnum and Marshall Farnum, in their profession. William made his stage debut at the age of 10 in Richmond, Virginia, in a production of \"Julius Caesar\" starring Edwin Booth. His first Broadway appearance was in 1896. His first major stage success was in the title role in \"Ben Hur\", in which he toured for five years. From 1915 to 1925 he devoted himself exclusively to motion pictures and became one of the highest paid stars in Hollywood, receiving from William Fox $10,000 weekly. In 1924 he was seriously injured while filming The Man Who Fights Alone (1924). After that he was reduced to playing minor roles until the end of the silent era. He returned to the stage in 1925 playing Sir Ralph Morgan in \"The Buccaneer\". The following year he appeared in the title role of Julius Caesar and two years later was on Broadway as Banquo in \"Macbeth\". On June 10, 1953, Farnum's funeral was held at the Wilshire Methodist Church in Los Angeles. Pallbearers were Cecil B. DeMille, Jesse Lasky, Frank Lloyd, Clarence Brown, Charles Coburn and Leo Carillo. The eulogy was read by Pat O'Brien.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1ODUyNDMyNV5BMl5BanBnXkFtZTgwNTU3Njk1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0267912","name":"William Farnum","idIMDB":"nm0267912"},"actorId":"nm0267912","character":"Maxwell - Banker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Willie Fung","urlProfile":"http://www.imdb.com/name/nm0298699","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzYzYTA1NzAtMjcxMS00MzUzLWE1NTctOGU1NzVmY2U5ODY0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1896","placeOfBirth":" Canton, China","bio":"Willie Fung was born on March 3, 1896 in Canton, China. He was an actor, known for The Letter (1940), Red Dust (1932) and Wee Willie Winkie (1937). He died on April 16, 1945 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzYzYTA1NzAtMjcxMS00MzUzLWE1NTctOGU1NzVmY2U5ODY0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0298699","name":"Willie Fung","idIMDB":"nm0298699"},"actorId":"nm0298699","character":"Sing Low","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carleton Young","urlProfile":"http://www.imdb.com/name/nm0949355","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWFmMTYyYzUtZDk4My00OTNkLWI1NjMtYTUxOTYxZWY3MGNjXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 October 1905","placeOfBirth":" Westfield, New York, USA","birthName":"Carleton Scott Young","bio":"American character actor noted for his deep, rich voice. Young made his Broadway debut in the early 1930s, appearing in such plays as \"Page Pygmalion\", \"The Man Who Reclaimed His Head\", \"Late Wisdom\" and \"Yesterday's Orchids\". Moving to Hollywood in 1936, he began getting small film roles and soon graduated to frequent appearances in B-Westerns and serials, occasionally as a supporting lead, but most often as a heavy. He was Dick Tracy's brother in Dick Tracy (1937) and was a familiar face in many oaters and serials at Republic, where he was a contract player, occasionally working under the stage name Gordon Robert. In 1941, Young returned to Broadway to star in \"Cuckoos On the Hearth\" by Parker Fennelly. Back in Hollywood, he made Westerns throughout the Forties, then began appearing in better roles in better films, becoming a late favorite of John Ford. His line in The Man Who Shot Liberty Valance (1962), \"This is the West, sir. When the legend becomes fact, print the legend\", has become synonymous with Ford. Young retired in 1970 and died in 1994, at the age of 89. He is often confused with Carleton G. Young, a radio performer who made a few films and who was the father of actor Tony Young.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWFmMTYyYzUtZDk4My00OTNkLWI1NjMtYTUxOTYxZWY3MGNjXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0949355","name":"Carleton Young","idIMDB":"nm0949355"},"actorId":"nm0949355","character":"First Holdup Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Will Ahern","urlProfile":"http://www.imdb.com/name/nm0013929","urlPhoto":"","biography":{"dateOfBirth":"9 October 1896","placeOfBirth":" Waterbury, Connecticut, USA","bio":"Will Ahern was born on October 9, 1896 in Waterbury, Connecticut, USA. He was an actor and writer, known for Picture Brides (1934), One Year Later (1933) and A Torch Tango (1934). He died on May 16, 1983 in Burbank, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0013929","name":"Will Ahern","idIMDB":"nm0013929"},"actorId":"nm0013929","character":"Dancer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gladys Ahern","urlProfile":"http://www.imdb.com/name/nm0013902","urlPhoto":"","biography":{"dateOfBirth":"4 January 1903","placeOfBirth":" Sioux City, Iowa, USA","bio":"Gladys Ahern was born on January 4, 1903 in Sioux City, Iowa, USA. She was an actress, known for On the Rancho (1930), The Whole Show (1934) and Hey! Hey! Westerner (1932). She died on June 12, 1992 in Burbank, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0013902","name":"Gladys Ahern","idIMDB":"nm0013902"},"actorId":"nm0013902","character":"Dancer and Singer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"The Cabin Kids","urlProfile":"http://www.imdb.com/name/nm1055176","urlPhoto":"","biography":{"bio":"The Cabin Kids is an actor, known for The Life of the Party (1935), Round-Up Time in Texas (1937) and Rhythm Saves the Day (1937).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1055176","name":"The Cabin Kids","idIMDB":"nm1055176"},"actorId":"nm1055176","character":"Sam Brown's Singing Children","urlCharacter":"http://www.imdb.com/character/ch0195457","main":true},{"actorName":"Champion","urlProfile":"http://www.imdb.com/name/nm1253995","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWUwYWJmNTUtNWU2Mi00MzZhLWJmNjItYTc4ZTRhZmJhMmI2XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Champion is an actor, known for The Gene Autry Show (1950), The Adventures of Champion (1955) and Riders of the Whistling Pines (1949).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWUwYWJmNTUtNWU2Mi00MzZhLWJmNjItYTc4ZTRhZmJhMmI2XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm1253995","name":"Champion","idIMDB":"nm1253995"},"actorId":"nm1253995","character":"Champ - Gene's Horse","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0028934","urlIMDB":"http://www.imdb.com/title/tt0028934","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":null,"copyrightHolder":"Copyright MCMXXXVII bu Republic Pictures Corp'n. (on print); © Republic Pictures Corporation; 22 March 1937; LP7023 (in copyright registry)"},"technical":{"runtime":["54 min (edited)","1 hr 7 min (67 min) (copyright length)"],"soundMix":["Mono (RCA Victor 'High Fidelity' Sound System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":["Consolidated Film Industries (CFI), Hollywood (CA), USA"],"filmLength":["1,834.9 m (8 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.9","filmingLocations":[{"location":"Kernville, California, USA"}],"rated":"PASSED","awards":[],"votes":"96","type":"Movie","companyCreditsSimple":[{"idCompany":"co0020540","name":"Republic Pictures (I)"}],"keywords":{"keywords":["rancher","robbery","railroad","payroll","oil well","dynamite","cattle","racial stereotype","father daughter relationship","horse","cowboy","water","thief","talent contest","suicide","singing","sidekick","sheriff","scheme","sabotage","ranch","radio","radio station","radio sponsor","radio program","posse","pollution","oil company","musician","gunfight","gossip","fraud","frame up","explosion","embezzler","dancing","dance team","cover up","contest","chase","cattle ranch","butterfly","banker","bank robbery","b western","b movie","ambush","singing cowboy","actor shares first name with character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:24:57"}}