{"data":{"movies":[{"title":"Captain Blood","originalTitle":"","year":"1935","releaseDate":"19351228","directors":[{"name":"Michael Curtiz","id":"nm0002031"}],"writers":[{"name":"Rafael Sabatini","id":"nm0754581"},{"name":"Casey Robinson","id":"nm0732452"}],"runtime":"119 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDMyMDg1NzAtZGU2Yi00M2ZjLTg3NWMtMTVkYzI2NTc0ZDVmXkEyXkFqcGdeQXVyNjc0MzMzNjA@._V1.jpg","countries":["USA"],"languages":["English","French"],"genres":["Action","Adventure"],"plot":"Arrested during the Monmouth Rebellion and falsely convicted of treason, Dr. Peter Blood is banished to the West Indies and sold into slavery. In Port Royal, Jamaica the Governor's daughter Arabella Bishop buys him for £10 to spite her uncle, Col. Bishop who owns a major plantation. Life is hard for the men and for Blood as well. By chance he treats the Governor's gout and is soon part of the medical service. He dreams of freedom and when the opportunity strikes, he and his friends rebel taking over a Spanish ship that has attacked the city. Soon, they are the most feared pirates on the seas, men without a country attacking all ships. When Arabella is prisoner, Blood decides to return her to Port Royal only to find that it is under the control of England's new enemy, France. All of them must decide if they are to fight for their new King.","simplePlot":"After being wrongly convicted as a traitor, Peter Blood, an English physician, is sent to exile in the British colonies of the Caribbean, where he becomes a pirate.","actors":[{"actorName":"Errol Flynn","urlProfile":"http://www.imdb.com/name/nm0001224","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MzA4NTY5NV5BMl5BanBnXkFtZTcwMDc5OTgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1909","placeOfBirth":" Hobart, Tasmania, Australia","birthName":"Errol Leslie Thomson Flynn","height":"6' 2\" (1.88 m)","bio":"Errol Flynn was born to parents Theodore Flynn, a respected biologist, and Marrelle Young, an adventurous young woman. Young Flynn was a rambunctious child who could be counted on to find trouble. Errol managed to have himself thrown out of every school he was enrolled in. In his late teens he set out to find gold, but instead found a series of short lived odd jobs. Information is sketchy, but the positions of police constable, sanitation engineer, treasure hunter, sheep castrator, shipmaster for hire, fisherman, and soldier seem to be among his more reputable career choices. Staying one jump ahead of the law and jealous husbands forced Flynn to England. He took up acting, a pastime he had previously stumbled into when asked to play (ironically) Fletcher Christian in a film called In the Wake of the Bounty (1933). Flynn's natural athletic talent and good looks attracted the attention of Warner Brothers and soon he was off to America. His luck held when he replaced Robert Donat in the title role of Captain Blood (1935). He quickly rocketed to stardom as the undisputed king of swashbuckler films, a title inherited from Douglas Fairbanks, but which remains his to this day. Onscreen, he was the freedom loving rebel, a man of action who fought against injustice and won the hearts of damsels in the process. His off-screen passions; drinking, fighting, boating and sex, made his film escapades seem pale. His love life brought him considerable fame, three statutory rape trials, and a lasting memorial in the expression \"In like Flynn\". Serious roles eluded him, and as his lifestyle eroded his youthful good looks, his career declined. Troubles with lawsuits and the IRS plagued him at this time, eroding what little money he had saved. A few good roles did come his way late in life, however, usually aging alcoholics, almost mirror images of Flynn. He was making a name as a serious actor before his death. Errol Flynn wrote an autobiography entitled \"My Wicked, Wicked Ways\". In the autobiography Flynn mentions his pilot, Barry Mahon throughout the book. Barry Mahon was a decorated fighter pilot who shot down more enemy aircraft than any other pilot in history. He was also the only man to escape from the Germans twice in World War II and the Hollywood movie, THE GREAT ESCAPE starring Steve McQueen, was based on Barry's life and this true-life adventure. It was thus only fitting that Errol Flynn, constantly fleeing from IRS agents, pissed off women and and law suits would hire Barry Mahon to be his personal pilot. But what is stranger than this is that. in later years. Barry Mahon would become Errol Flynn's personal manager and CEO of his production company, giving up flying to produce motion pictures. Accordingly, after Errol passed away, Barry Mahon and his daughter, producer Doris Keating, were able to purchase the literary rights to Errol Flynn's autobiography (\"My Wicked Wicked Ways\"). Based upon this and the track record established by Doris Keating with 4 prior TV movies, CBS granted a license agreement to Doris Keating Productions and, working with Columbia Pictures TV, Keating produced an extremely classy and well-cast Movie-of-the-Week which aired on CBS to rave reviews. This movie, a must-see bio-picture, does great justice to legend of Errol Flynn, and although it did not \"white wash\" the trouble Flynn got into in later years, it accurately reported that he was innocent of all charges brought against him. Unfortunately, these false charges contributed to the ruin of Errol Flynn's career as movie studios and the public are often fickle or unforgiving.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MzA4NTY5NV5BMl5BanBnXkFtZTcwMDc5OTgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001224","name":"Errol Flynn","nicknames":["The Baron","Satan's Angel","Flynny","The Tasmanian Devil","Rolly"],"idIMDB":"nm0001224"},"actorId":"nm0001224","character":"Peter Blood","urlCharacter":"http://www.imdb.com/character/ch0030426","main":true},{"actorName":"Olivia de Havilland","urlProfile":"http://www.imdb.com/name/nm0000014","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0Njc5Mjk5M15BMl5BanBnXkFtZTYwOTk1MjU2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1916","placeOfBirth":" Tokyo, Japan","birthName":"Olivia Mary de Havilland","height":"5' 4\" (1.63 m)","bio":"Olivia Mary de Havilland was born July 1, 1916, in Tokyo, Japan, to British parents Lilian Augusta (Ruse), a former actress, and Walter Augustus de Havilland, an English professor and patent attorney. Her sister, Joan, later to become famous as Joan Fontaine, was born the following year. Her surname comes from her paternal grandfather, whose family was from Guernsey in the Channel Islands. Her parents divorced when Olivia was just three years old, and she moved with her mother and sister to Saratoga, California. After graduating from high school, where she fell prey to the acting bug, Olivia enrolled in Mills College in Oakland. It was while she was at Mills that she participated in the school play \"A Midsummer Night's Dream\" and was spotted by Max Reinhardt. She so impressed Reinhardt that he picked her up for both his stage version and, later, the Warner Bros. film version in 1935. She again was so impressive that Warner executives signed her to a seven-year contract. No sooner had the ink dried on the contract than Olivia appeared in three more films: The Irish in Us (1935), Alibi Ike (1935) and Captain Blood (1935), the latter with the man with whom her career would be most closely identified, heartthrob Errol Flynn. He and Olivia starred together in eight films during their careers. In 1939 Warner Bros. loaned her to David O. Selznick for the classic Gone with the Wind (1939). Playing the sweet Melanie Hamilton, Olivia received her first nomination for an Academy Award for Best Supporting Actress, only to lose out to one of her co-stars in the film, Hattie McDaniel. After GWTW, Olivia returned to Warner Bros. and continued to churn out films. In 1941 she played Emmy Brown in Hold Back the Dawn (1941), which resulted in her second Oscar nomination, this time for Best Actress. Again she lost, this time to her sister Joan for her role in Suspicion (1941). After that strong showing, Olivia now demanded better, more substantial roles than the \"sweet young thing\" slot into which Warners had been fitting her. The studio responded by placing her on a six-month suspension, all of the studios at the time operating under the policy that players were nothing more than property to do with as they saw fit. As if that weren't bad enough, when her contract with Warners was up, she was told that she would have to make up the time lost because of the suspension. Irate, she sued the studio, and for the length of the court battle she didn't appear in a single film. The result, however, was worth it. In a landmark decision, the court said not only that Olivia did not have to make up the time, but that all performers were to be limited to a seven-year contract that would include any suspensions handed down. This became known as the \"de Havilland decision\"; no longer could studios treat their performers as mere cattle. Returning to screen in 1946, Olivia made up for lost time by appearing in four films, one of which finally won her the Oscar that had so long eluded her. It was To Each His Own (1946), in which she played Josephine Norris to the delight of critics and audiences alike. Olivia was the strongest performer in Hollywood for the balance of the 1940s. In 1948 she turned in another strong showing in The Snake Pit (1948) as Virginia Cunningham, a woman suffering a mental breakdown. The end result was another Oscar nomination for Best Actress, but she lost to Jane Wyman in Johnny Belinda (1948). As in the two previous years, she made only one film in 1949, but she again won a nomination and the Academy Award for Best Actress for The Heiress (1949). After a three-year hiatus, Olivia returned to star in My Cousin Rachel (1952). From that point on, she made few appearances on the screen but was seen on Broadway and in some television shows. Her last screen appearance was in Le 5e mousquetaire (1979), and her last career appearance was in the TV movie The Woman He Loved (1988). During the hoopla surrounding the 50th anniversary of GWTW in 1989, she graciously declined requests for all interviews as the only surviving one of the four main stars. Today she enjoys a quiet retirement in Paris, France.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0Njc5Mjk5M15BMl5BanBnXkFtZTYwOTk1MjU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000014","name":"Olivia de Havilland","nicknames":["Livvie"],"idIMDB":"nm0000014"},"actorId":"nm0000014","character":"Arabella Bishop","urlCharacter":"http://www.imdb.com/character/ch0156310","main":true},{"actorName":"Lionel Atwill","urlProfile":"http://www.imdb.com/name/nm0041172","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI4NDMwNTAyOV5BMl5BanBnXkFtZTcwNzMxMDUzOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 March 1885","placeOfBirth":" Croydon, London, England, UK","birthName":"Lionel Alfred William Atwill","height":"5' 10½\" (1.79 m)","bio":"Lionel Atwill was born into a wealthy family and was educated at London's prestigious Mercer School to become an architect, but his interest turned to the stage. He worked his way progressively into the craft and debuted at age 20 at the Garrick Theatre in London. He acted and improved regularly thereafter, especially in the plays of Henrik Ibsen and George Bernard Shaw. Atwill came to the US in 1915 and would appear in some 25 plays on Broadway between 1917 and 1931, but he was already trying his hand in silent films by 1918. He had a sonorous voice and dictatorial British accent that served him well for the stage and just as well for sound movies. He did some Vitaphone short subjects in 1928 and then his first real film role in The Silent Witness (1932) (also titled \"The Verdict\"). That voice and his bullish demeanor made Atwill a natural for a spectrum of tough-customer roles. As shady noblemen and mad doctors, but also gruff military men and police inspectors (usually with a signature mustache), he worked steadily through the 1930s. He had the chance to show a broader character as the tyrannical but unforgettable Col. Bishop in Captain Blood (1935). It's hard to forget his Inspector Krogh in Son of Frankenstein (1939), wherein he agrees to a game of darts with Basil Rathbone and proceeds to impale the darts through the right sleeve of his uniform (the character sported a wooden right arm). And he sends himself up with rolling and blustering dialogue as the glory-hog ham stage actor Rawitch in the classic To Be or Not to Be (1942) with Jack Benny. However, Atwill effectively ruined his burgeoning film career in 1943 after he was implicated in what was described as an \"orgy\" at his home, naked guests and pornographic films included--and a rape perpetrated during the proceedings. Atwill \"lied like a gentleman,\" it was said, in the court proceedings to protect the identities of his guests and was convicted of perjury and sentenced to five years' probation. He was thereafter kept employed on Poverty Row with only brief periods of employment by Universal Pictures, while the rest of Hollywood turned its collective back on him. He is more remembered for the horror films generally than for better efforts, but they have fueled his continued popularity and a bid by the Southern California Lionel Atwill Fan Club to petition for a Hollywood Blvd. star (he never received one).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzI4NDMwNTAyOV5BMl5BanBnXkFtZTcwNzMxMDUzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0041172","name":"Lionel Atwill","nicknames":["\"Pinky\""],"idIMDB":"nm0041172"},"actorId":"nm0041172","character":"Colonel Bishop","urlCharacter":"http://www.imdb.com/character/ch0156311","main":true},{"actorName":"Basil Rathbone","urlProfile":"http://www.imdb.com/name/nm0001651","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjkzNzU1NV5BMl5BanBnXkFtZTYwMDM2MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1892","placeOfBirth":" Johannesburg, South Africa","birthName":"Philip St. John Basil Rathbone","height":"6' 1½\" (1.87 m)","bio":"Basil Rathbone was born in Johannesburg, South Africa, in 1892, but three years later his family was forced to flee the country because his father was accused by the Boers of being a British spy at a time when Dutch-British conflicts were leading to the Boer War. The Rathbones escaped to England, where Basil and his two younger siblings, Beatrice and John, were raised. Their mother, Anna Barbara (George), was a violinist, who was born in Grahamstown, South Africa, of British parents, and their father, Edgar Philip Rathbone, was a mining engineer born in Liverpool. From 1906 to 1910 Rathbone attended Repton School, where he was more interested in sports--especially fencing, at which he excelled--than studies, but where he also discovered his interest in the theater. After graduation he planned to pursue acting as a profession, but his father disapproved and suggested that his son try working in business for a year, hoping he would forget about acting. Rathbone accepted his father's suggestion and worked as a clerk for an insurance company--for exactly one year. Then he contacted his cousin Frank Benson, an actor managing a Shakespearean troupe in Stratford-on-Avon. Rathbone was hired as an actor on the condition that he work his way through the ranks, which he did quite rapidly. Starting in bit parts in 1911, he was playing juvenile leads within two years. In 1915 his career was interrupted by the First World War. During his military service, as a second lieutenant in the Liverpool Scottish 2nd Battalion, he worked in intelligence and received the Military Cross for bravery. In 1919, released from military service, he returned to Stratford-on-Avon and continued with Shakespeare but after a year moved onto the London stage. The year after that he made his first appearance on Broadway and his film debut in the silent Innocent (1921). For the remainder of the decade Rathbone alternated between the London and New York stages and occasional appearances in films. In 1929 he co-wrote and starred as the title character in a short-running Broadway play called \"Judas\". Soon afterwards he abandoned his first love, the theater, for a film career. During the 1920s his roles had evolved from the romantic lead to the suave lady-killer to the sinister villain (usually wielding a sword), and Hollywood put him to good use during the 1930s in numerous costume romps, including Captain Blood (1935), David Copperfield (1935), A Tale of Two Cities (1935), Anna Karenina (1935), The Last Days of Pompeii (1935), The Adventures of Robin Hood (1938), Tower of London (1939), The Mark of Zorro (1940) and others. Rathbone earned two Oscar nominations for Best Supporting Actor as Tybalt in Romeo and Juliet (1936) and as King Louis XI in If I Were King (1938). However, it was in 1939 that Rathbone played his best-known and most popular character, Sherlock Holmes, with Nigel Bruce as Dr. Watson, first in The Hound of the Baskervilles (1939) and then in The Adventures of Sherlock Holmes (1939), which were followed by 12 more films and numerous radio broadcasts over the next seven years. Feeling that his identification with the character was killing his film career, Rathbone went back to New York and the stage in 1946. The next year he won a Tony Award for his portrayal of Dr. Sloper in the Broadway play \"The Heiress,\" but afterwards found little rewarding stage work. Nevertheless, during the last two decades of his life, Rathbone was a very busy actor, appearing on numerous television shows, primarily drama, variety and game shows; in occasional films, such as Casanova's Big Night (1954), The Court Jester (1955), Tales of Terror (1962) and The Comedy of Terrors (1963); and in his own one-man show, \"An Evening with Basil Rathbone\", with which he toured the U.S.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNjkzNzU1NV5BMl5BanBnXkFtZTYwMDM2MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001651","name":"Basil Rathbone","nicknames":["Ratters"],"idIMDB":"nm0001651"},"actorId":"nm0001651","character":"Levasseur","urlCharacter":"http://www.imdb.com/character/ch0156312","main":true},{"actorName":"Ross Alexander","urlProfile":"http://www.imdb.com/name/nm0018717","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMjQ4Nzc0MV5BMl5BanBnXkFtZTcwMzgyMTEyOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1907","placeOfBirth":" Brooklyn, New York, USA","birthName":"Alexander Ross Smith","height":"6' 1¼\" (1.86 m)","bio":"The tragically brief life of fresh-faced, boyishly handsome Ross Alexander, who seemed to have everything going for him, plays these days like a bad Hollywood movie. Alexander was a charming, highly engaging young actor whose pleasant voice and breezy personality aided greatly in his transition from Broadway teen player to young adult Warner Bros. film actor. His peers would include such Warner stalwarts as Ruby Keeler, Dick Powell and Errol Flynn. Off-camera, however, Ross, a closeted homosexual, became an acutely self-destructive young man whose career instability and domestic tragedy would take its toll. The tormented Ross ended his own life at age 29. Ross Alexander was born Alexander Ross Smith in Brooklyn, New York, to Maud Adelle (Cohen) and Alexander Ross Smith, a leather merchant. Raised in Rochester, New York, he pursued both drama and athletics in high school (soccer, swimming) and sidelined in little theater productions in town. In between he took his first Broadway bow as a young teen in Blanche Yurka's long-running comedy success \"Enter Madame.\" He eventually moved back to New York City following schooling and began to build up his stage resume in stock companies. On Broadway he showed a modicum of promise in such plays as \"The Ladder\" (1926) and \"Let Us Be Gay\" (1929). The latter play introduced Ross to producer John Golden and marked an immoderate two-year association which would include the plays \"After Tomorrow\" (1930) and \"That's Gratitude\" (1930). Paramount apparently saw Ross' potential and started him off in pictures with The Wiser Sex (1932), but nothing happened. Continuing on Broadway with \"The Stork Is Dead\" (1932), \"Honeymoon\" (1932), \"The Party's Over\" (1933) and \"No Questions Asked\" (1934), he was re-noticed for films, this time by Warner Bros. Warners signed him to appear in its popular backstage Depression-era musicals and collegiate capers. Alexander's fresh look and carefree, slightly cynical demeanor made him an instant favorite and he soon began humming with popular second leads in such musicals as Flirtation Walk (1934). On the dramatic side he was chosen to play Demetrius in the all-star A Midsummer Night's Dream (1935), and in Errol Flynn's Captain Blood (1935) he played Jeremy Pitt, Blood's friend and navigator. Trouble started brewing, however, behind the scenes. Ross was being perceived by Warners as a second-ranked Dick Powell. As the studio began featuring him in Powell's castoffs and other uninspiring B-grade movies, they decided it was too taxing to both groom him for matinée idol status and conceal his homosexuality at the same time. A probable marriage of convenience to budding starlet Aleta Friele, who appeared on Broadway using the name Aleta Freel, ended disastrously with the 28-year-old actress taking her own life with a rifle in their Hollywood Hills home. The actor was deeply shaken by this tragic event. He tried to cover his tracks yet again, however, by marrying beautiful actress Anne Nagel, whom he met while on the set of China Clipper (1936) and Here Comes Carter (1936). It didn't help quash his spiraling depression. Finally Warners lost all patience and interest after having to cover up a potentially career-threatening gay-sex scandal, and Ross' promising career went down the tubes. To add insult to injury, he incurred major debt. On January 2, 1937, less than five months after his marriage to Nagel and shortly after the first anniversary of his first wife's death, Aleta Friele who also committed suicide, Alexander shot himself with a pistol in a barn behind his Encino ranch home. His last movie, the moderately received Ready, Willing and Able (1937) with Ruby Keeler, was released posthumously. Despite the fact he was the co-lead in the film, he was billed fifth, thus emphasizing the point that he had already lost most of his clout.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyMjQ4Nzc0MV5BMl5BanBnXkFtZTcwMzgyMTEyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0018717","name":"Ross Alexander","idIMDB":"nm0018717"},"actorId":"nm0018717","character":"Jeremy Pitt","urlCharacter":"http://www.imdb.com/character/ch0156313","main":true},{"actorName":"Guy Kibbee","urlProfile":"http://www.imdb.com/name/nm0452128","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTZkNjAzZjItMzkyNC00NjFhLTlmNWItYmNhYTI4ODIyNDQ2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1882","placeOfBirth":" El Paso, Texas, USA","birthName":"Guy Bridges Kibbee","bio":"Beginning his show business career at age 13 as an entertainer on Mississippi riverboats, Guy Kibbee graduated to the legitimate stage and spent many years in the theater. In the 1930s he was signed by Warner Brothers, and became part of what was known as \"the Warner Brothers Stock Company\", a cadre of seasoned character actors and actresses who enlivened many a Warners musical or gangster film. Kibbee specialized in playing jovial, but not particularly bright, businessmen and government officials. He was memorable as the stuffy lawyer with a secret weakness for showgirls in Gold Diggers of 1933 (1933).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTZkNjAzZjItMzkyNC00NjFhLTlmNWItYmNhYTI4ODIyNDQ2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0452128","name":"Guy Kibbee","idIMDB":"nm0452128"},"actorId":"nm0452128","character":"Hagthorpe","urlCharacter":"http://www.imdb.com/character/ch0156314","main":true},{"actorName":"Henry Stephenson","urlProfile":"http://www.imdb.com/name/nm0827261","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDUzMGFkMWEtOTAxMi00YzQzLWFmZTEtOTNmMDhmZjA2ZDIzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1871","placeOfBirth":" Granada, British West Indies","birthName":"Henry Stephenson Garroway","height":"6' 2\" (1.88 m)","bio":"Stephenson was a firm, dignified, worldly presence in Hollywood's classic history-based films of the 30s and 40s. The tall British character actor Henry Stephenson could be both imposing and benevolent in his patrician portrayals, usually expounding words of wisdom or offering gentlemanly aid. He was born Henry S. Garroway in Granada, British West Indies on April 16, 1871 and studied at Rugby in England. His reputation was built solidly on the stage both in America and in England, making his Broadway debut around the turn of the century with \"A Message from Mars\" in 1901. While he did make a few silent pictures (from 1917), film audiences began taking a notice only in later years. After transferring a successful Broadway role to film with Cynara (1932), Stephenson settled in Hollywood where he distinguished himself in a variety of pictures for RKO, MGM and Warner Bros., among others. He appeared quite frequently in royal support for Warners' top star of the time, Errol Flynn, including Captain Blood (1935) as Lord Willoughby, The Charge of the Light Brigade (1936) as Sir Charles Macefield, The Prince and the Pauper (1937) as the Duke of Norfolk, and The Private Lives of Elizabeth and Essex (1939) as Lord Burghley. His last film was the sentimental yarn Challenge to Lassie (1949). Long married to character actress Ann Shoemaker, Stephenson died on April 24, 1956 in San Francisco, California at age 85, and was survived by his widow and daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDUzMGFkMWEtOTAxMi00YzQzLWFmZTEtOTNmMDhmZjA2ZDIzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0827261","name":"Henry Stephenson","idIMDB":"nm0827261"},"actorId":"nm0827261","character":"Lord Willoughby","urlCharacter":"http://www.imdb.com/character/ch0156315","main":true},{"actorName":"Robert Barrat","urlProfile":"http://www.imdb.com/name/nm0056719","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTc2ZmRiMzctNGVjNC00NzBhLWJlNTYtMDQ2YzViZjViNzlkXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 July 1889","placeOfBirth":" New York City, New York, USA","birthName":"Robert Harriot Barrat","bio":"Robert Barrat pursued a stage career on Broadway from 1918 to 1932. He did sample a scant three silent movies starting in 1915, but returned to stage work. Barrat had a distinguished enough visage but also a well knit physique that would foretell a busy career in films with many featured character roles which he turned to in 1932. He therefore portrayed lawyers, business owners, and officials of all sorts, as well as, detectives, hardened sailors, and various desperate characters. Barrat had a deep guttural voice which he could roll around in his mouth to pitch out some unique variations. Such was his Wolverstone in Captain Blood (1935), and his Lord Morton with a brogue in Mary of Scotland (1936). Barrat was a dedicated physical fitness devotee and showed off a still manly form as Chingachgook in The Last of the Mohicans (1936). Barrat was probably grateful to slow down a bit after 1936, for up to then he was much in demand with an average of twenty films a year. As it was he continued with a usual ten films per year to 1940. He did several movies with James Cagney in the 1930s, and they became good friends. Cagney described his friend as having \"a solid forearm the size of the average man's thigh.\" Barrat continued a rich and varied character role career through the 1940s and early 1950s. The roles were more of the dignified variety-fatherly figures, a few Indian chiefs and military men - and several generals. He had the non-speaking role of General Douglas MacArthur-his hawk of a nose needing little enhancement (he was shot from side angles and distance) - in They Were Expendable (1945). By 1954 he turned to TV playhouse roles off and on until 1964. He loved challenging himself with doing accents and certainly succeeded in this and in turning out memorable roles in over 150 films.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTc2ZmRiMzctNGVjNC00NzBhLWJlNTYtMDQ2YzViZjViNzlkXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0056719","name":"Robert Barrat","idIMDB":"nm0056719"},"actorId":"nm0056719","character":"Wolverstone","urlCharacter":"http://www.imdb.com/character/ch0156316","main":true},{"actorName":"Hobart Cavanaugh","urlProfile":"http://www.imdb.com/name/nm0146928","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzJkODIwNjMtNTBlMi00NWY1LWI1ZmEtMmNmZmE5MTZkNGIwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 September 1886","placeOfBirth":" Virginia City, Nevada, USA","bio":"Worried-looking, balding, moustachioed and usually bespectacled small part character actor, prolific during the 1930s and 40s. Hobart Cavanaugh played downtrodden or henpecked little men -- the perennial victim, forever nervous or bewildered -- to absolute perfection. He was most at home as clerks, mailmen, minor officials, undertakers, shopkeepers and bank tellers. However, when called upon, he could be just as convincing as a sneaky or vaguely sinister villain's accomplice. A former engineering student at the University of California, Cavanaugh began his acting career on the stage, making his debut on Broadway in 1916. He entered films, somewhat inauspiciously, with a forgotten B-picture, which was shot in New York by the independent Gotham Company. It took another five years, until he was signed by First National/Warner Brothers, where he remained under contract until 1936, thereafter free-lancing. His mild-mannered personae remained in constant demand in Hollywood, for he tallied up an impressive 190 screen appearances -- though often uncredited -- right up until his death in 1950.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzJkODIwNjMtNTBlMi00NWY1LWI1ZmEtMmNmZmE5MTZkNGIwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0146928","name":"Hobart Cavanaugh","idIMDB":"nm0146928"},"actorId":"nm0146928","character":"Dr. Bronson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Donald Meek","urlProfile":"http://www.imdb.com/name/nm0576083","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NzgzMDAyM15BMl5BanBnXkFtZTcwNjQxMjMxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 July 1878","placeOfBirth":" Glasgow, Scotland, UK","height":"5' 4\" (1.63 m)","bio":"On British and Australian stage before coming to the USA in 1912, he played more than 800 roles, starting with Sir Henry Irving at age 8. He first appeared in the US at Castle Square Theatre, Boston, in 1912, and made his New York debut in 1917 in \"Going Up\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI1NzgzMDAyM15BMl5BanBnXkFtZTcwNjQxMjMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0576083","name":"Donald Meek","idIMDB":"nm0576083"},"actorId":"nm0576083","character":"Dr. Whacker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jessie Ralph","urlProfile":"http://www.imdb.com/name/nm0707771","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDgzZWY2MDEtZTg1NS00MzhmLWFlMGItM2QyMjUyMmUzZGRhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1864","placeOfBirth":" Gloucester, Massachusetts, USA","birthName":"Jessie Ralph Chambers","height":"5' 5\" (1.65 m)","bio":"Jessie Ralph was a sailor's daughter, who first came to the stage at the age of 16, performing with a stock company in either Boston, Massachusetts, or Providence, Rhode Island (accounts differ). The year was 1880, and it took Jessie another 26 years to make her debut on the Great White Way in \"The Kreutzer Sonata\". Already a seasoned actress, she enjoying third billing. Her screen career started with one and two reelers as early as 1915, but her proper entry into Hollywood did not come about until 1933. For more than 20 years, plump, down-to-earth Jessie made her reputation as a character actress on Broadway playing an assortment of nurses, maids and aunts. She was used in musicals by George M. Cohan and acted in Shakespearean roles, from \"Twelfth Night\" to \"Romeo and Juliet\". She was nurse to Jane Cowl's Juliet in the 1923 play which ran for an unprecedented 174 performances and co-starred Eva Le Gallienne and Katharine Cornell (amazing, when considering that the star was already 39 years old!). Like other successful actresses of the stage, Jessie was brought to Hollywood to reprise a Broadway hit role, in this case her Aunt Minnie in Child of Manhattan (1933). After half a lifetime in the theatre, Jessie's sojourn in Hollywood was relatively brief but marked by a series of memorable performances. She was the definitive incarnation of the endearing nurse Peggotty in David Copperfield (1935) and played Greta Garbo's loyal maid Nanine in Camille (1936). She was the matriarch of the Whiteoaks of Jalna (1935), an adaptable society matron in San Francisco (1936) and harridan of a mother-in-law to W.C. Fields, Hermisillo Brunch, in The Bank Dick (1940). Whether in comedy or drama, as a Chinese aunt in both stage and screen versions of The Good Earth (1937), or a kindly sorceress in The Blue Bird (1940), Jessie gave consistently good value for money. The New York Times review of October 12, 1935, wrote of her performance in I Live My Life (1935): \"Jessie Ralph as the tyrannical head of the family, proves again that she is the best of the screen grandmothers\". Jessie retired from acting in 1941 after having a leg amputated and died three years later.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDgzZWY2MDEtZTg1NS00MzhmLWFlMGItM2QyMjUyMmUzZGRhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0707771","name":"Jessie Ralph","idIMDB":"nm0707771"},"actorId":"nm0707771","character":"Mrs. Barlow","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Forrester Harvey","urlProfile":"http://www.imdb.com/name/nm0367516","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODVmZWZkNTgtMWVmZS00NTE2LWE5MGQtOTNjOWZhOGY0YzYyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 June 1884","placeOfBirth":" Cork, Ireland","bio":"Forrester Harvey was born on June 27, 1884 in Cork, Ireland. He was an actor, known for Rebecca (1940), The Invisible Man (1933) and The Wolf Man (1941). He died on December 14, 1945 in Laguna Beach, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODVmZWZkNTgtMWVmZS00NTE2LWE5MGQtOTNjOWZhOGY0YzYyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0367516","name":"Forrester Harvey","idIMDB":"nm0367516"},"actorId":"nm0367516","character":"Honesty Nuttall","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank McGlynn Sr.","urlProfile":"http://www.imdb.com/name/nm0569466","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGIyNGFkMmEtMDVhNi00NzA4LWE1NmQtMWNhM2MyZWRlYzY4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1866","placeOfBirth":" San Francisco, California, USA","height":"6' 0½\" (1.84 m)","bio":"Frank McGlynn Sr. was born on October 26, 1866 in San Francisco, California, USA. He was an actor and director, known for Captain Blood (1935), The Poor Little Rich Girl (1917) and Lincoln in the White House (1939). He was married to Rose O'Byrne. He died on May 18, 1951 in Newburgh, New York, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGIyNGFkMmEtMDVhNi00NzA4LWE1NmQtMWNhM2MyZWRlYzY4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0569466","name":"Frank McGlynn Sr.","idIMDB":"nm0569466"},"actorId":"nm0569466","character":"Rev. Ogle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Holmes Herbert","urlProfile":"http://www.imdb.com/name/nm0378555","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmE5N2Y0NzMtOTEyMS00NDdjLTk3OTctNjMzOTlhMTdmMTZlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1882","placeOfBirth":" Mansfield, Nottinghamshire, England, UK","birthName":"Horace Edward Jenner","height":"6' (1.83 m)","bio":"Holmes Herbert was a tall, intense English actor who made his first films after coming to America. He began in silent movies as a leading man but eventually was relegated to less important roles as a character actor when sound came in. He played in several of the Universal \"Sherlock Holmes\" movies, the title character of which was the initial inspiration for his stage name. His career spanned a total of 37 years, and he retired in 1952.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmE5N2Y0NzMtOTEyMS00NDdjLTk3OTctNjMzOTlhMTdmMTZlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0378555","name":"Holmes Herbert","idIMDB":"nm0378555"},"actorId":"nm0378555","character":"Capt. Gardner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Torrence","urlProfile":"http://www.imdb.com/name/nm0868456","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDM3ZGU2ZGEtODJjZS00MzBhLTljYzItYmVjMDlhMGZlMzAxXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1864","placeOfBirth":" Edinburgh, Scotland, UK","birthName":"David Torrence Thomson","height":"6' 1\" (1.85 m)","bio":"David Torrence was the second child born out of eleven children to Henry Torrance Thomson and Janet Bryce. Davis given name was 'David Bryce Thomson.\" Born on Jan 17,1863 in Edinbough,Scotland. David's brother was character star 'Ernest Torrence' who was 15 years younger than David. Ernest was the first of the two to come to California and become actors. Educated in both England and Germany, David moved with equal ease from stage to screen in the early part of the 20th century. Following the completion of the classic silent films Tess of the D'Urbervilles (1913) with the legendary stage actress Minnie Maddern Fiske, and The Prisoner of Zenda (1913), however, David returned to focus on Broadway plays and enjoy life on a Mexican ranch. A steep reversal of fortunes aggravated a necessary return to Hollywood following World War I, and, fortunately for his fans, he stayed for nearly two decades. Playing a number of leads during his silent heyday, many of them men of influence, his portrayals of stern-faced villains may not have rivaled that of brother Ernest, but David made for quite a contemptible gent in a few. In his first sound picture, the historical drama Disraeli (1929), he played an austere-looking anti-Semitic head of the Bank of England whose refusal to finance the Suez canal results in action taken by Prime Minister Disraeli, played by George Arliss. David also went on to lend Arliss prime support in the comedy drama A Successful Calamity (1932), and in another biopic history lesson, Voltaire (1933). Come the advent of sound, his characters continued to prestigious characters (bankers, merchants, lawyers, and attorneys), but grew smaller in size until he faded out in unbilled parts, such as in The Dark Angel (1935) and Lost Horizon (1937). Comedy fans might remember David for his performance as Scots attorney Mr. Miggs in the Laurel and Hardy feature Bonnie Scotland (1935). His last roles included, Rulers of the Sea (1939) and Stanley and Livingstone (1939). David Torrence died Dec 26,1951 Beverly Hills, Ca. and is buried at the Inglewood Cemetery while others give 1951.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDM3ZGU2ZGEtODJjZS00MzBhLTljYzItYmVjMDlhMGZlMzAxXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0868456","name":"David Torrence","idIMDB":"nm0868456"},"actorId":"nm0868456","character":"Andrew Baynes","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0026174","urlIMDB":"http://www.imdb.com/title/tt0026174","business":{"budget":{"money":"$1,200,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"05","month":"08","year":"1935","remarks":null},{"money":null,"country":null,"day":"29","month":"10","year":"1935","remarks":null}],"copyrightHolder":"copyright MCMXXXV by Warner Bros. Pictures Inc. and The Vitaphone Corp. (on print)"},"technical":{"runtime":["1 hr 59 min (119 min)","1 hr 45 min (105 min) (West Germany)","1 hr 39 min (99 min) (re-release) (USA)"],"soundMix":["Mono"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["(12 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.8","filmingLocations":[{"location":"Corona, California, USA"}],"rated":"NOT RATED","awards":[{"award":"Academy Awards, USA 1936","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Picture","names":[]},{"category":"Best Director","names":[{"name":"Michael Curtiz","id":"nm0002031","role":null}]},{"category":"Best Writing, Screenplay","names":[{"name":"Casey Robinson","id":"nm0732452","role":null}]},{"category":"Best Sound, Recording","names":[{"name":"Nathan Levinson","id":"nm0506080","role":"sound director"}]},{"category":"Best Music, Score","names":[{"name":"Leo F. Forbstein","id":"nm0006079","role":"head of department"}]}]}]}],"votes":"10,356","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0073404","name":"Cosmopolitan Productions"}],"keywords":{"keywords":["slavery","pirate","jamaica","caribbean","gout","sea adventure","naval battle","year 1685","shadow","governor","escape","friend","monmouth rebellion","west indies","swashbuckler","british flag","spyglass","sailing ship","sweaty face","not guilty plea","gallows","medical doctor","candle","horse riding","stabbed with a sword","sword fight","stabbed in the chest","rifle","flintlock pistol","flintlock rifle","musket","rapier","kiss","reluctant hero","knife","disarming someone","cult film","explosion","cannon","showdown","combat","sword duel","swordsman","tough guy","siege","battle","warrior","adventure hero","action hero","hero","foreign language adaptation","leitmotif","treasure","symphonic music score","source music","slave","slave auction","slap","quarrel","pistol","loot","jolly roger","imprisonment","horse","deception","death","beach","agreement","1680s","wrongful imprisonment","whip","whipping","whip crack","orchestral music score","love","famous score","colonel","sea battle","remake","glorious revolution","1600s","trial","historical event","great britain","physician","duel","based on novel","character name in title","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:39:50"}}