{"data":{"movies":[{"title":"The Bread Peddler","originalTitle":"La porteuse de pain","year":"1963","releaseDate":"19630830","directors":[{"name":"Maurice Cloche","id":"nm0166996"}],"writers":[{"name":"Maurice Cloche","id":"nm0166996"},{"name":"Christian Plume","id":"nm0687588"}],"runtime":"122 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmYzOWNjYzctNDgzYy00ZjJlLWI5N2UtNGRjNDk3ZTZiN2M4XkEyXkFqcGdeQXVyMzcwMzExMA@@._V1.jpg","countries":["Italy","France"],"languages":["French"],"genres":["Drama"],"simplePlot":"","actors":[{"actorName":"Suzanne Flon","urlProfile":"http://www.imdb.com/name/nm0282530","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNDI1ODA3OF5BMl5BanBnXkFtZTcwMzQwMTUyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 January 1918","placeOfBirth":" Le Kremlin-Bicêtre, Seine [now Val-de-Marne], France","height":"5' 4¼\" (1.63 m)","bio":"Opulent French actress Suzanne Flon, who came from humble beginnings, evolved into a luminous stage and film star whose career lasted five decades. She was born near Paris, the daughter of a railway worker and a seamstress and at school developed an interest in writing poetry. Following high school she worked as an English interpreter at Au Printemps, a large Parisian department store, before finding a position with the famed songbird Édith Piaf as her personal secretary. Ms. Flon's first performance was as a mistress of ceremonies in a musical revue. She continued on stage and eventually developed an association with the noted playwright Jean Anouilh in the early 1940s; she played his heroine Ismene in \"Antigone\" and played Joan of Arc to great acclaim in \"The Lark\" in 1953. She also dabbled in avant garde works by Marguerite Duras as well as Shakespeare, Pirandello, Chekhov and Molliere and won a number of stage awards for her efforts. In 1959, she became a member of the Theatre National Populaire and appeared in several plays under the direction of René Clair. Ms. Flon began in films with Capitaine Blomet (1947) before branching out internationally in the 1950s. She was an elegant standout as a free-spirited couture model who became the object of fascination and desire for the crippled painter Toulouse-Lautrec played by José Ferrer in John Huston's film Moulin Rouge (1952). She also impressed in friend Orson Welles' comedy-thriller Confidential Report (1955) as a listless patrician, and later played Miss Pittl for him in The Trial (1962) [The Trial]. War themes were prominent in her 1960s work. In Tu ne tueras point (1961) [Thou Shalt Not Kill], she won the Venice Film Festival award for her resolute mother whose son resists the World War I draft. In Le train (1964) starring Burt Lancaster, Jeanne Moreau and Paul Scofield she had some excellent scenes as an art curator who becomes a detrimental figure in the Nazi's plans to secretly export masterpieces out of France during the French Resistance. Awards continued to come her way with a number of stylish and sensitive \"grande dame\" roles. She won bookend César awards for One Deadly Summer (1983) [One Deadly Summer] as Isabelle Adjani's deaf but highly sensitized aunt, and as the mother of Lambert Wilson in La vouivre (1989) [The Dragon]. Her rich and soothing voice was also used frequently for French narratives in numerous documentaries. Ms. Flon continued to appear on stage, film and TV right up until her death of a stomach ailment at age 87 in 2005.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyNDI1ODA3OF5BMl5BanBnXkFtZTcwMzQwMTUyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0282530","name":"Suzanne Flon","idIMDB":"nm0282530"},"actorId":"nm0282530","character":"Maman Lison / Jeanne Fortier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Philippe Noiret","urlProfile":"http://www.imdb.com/name/nm0634159","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MzE2OTE0N15BMl5BanBnXkFtZTcwNTg2NzIwNw@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1930","placeOfBirth":" Lille, Nord, France","height":"6' 1\" (1.85 m)","bio":"Philippe Noiret was one of French cinema's most familiar faces who appeared in more than 140 films in a career that spanned more than half a century. He was born on October 1, 1930, in Lille, Nord, France, into a middle class family of shopkeepers. His father was fond of literature. Young Noiret attended the College Janson-of-Sally in the 16th arrondissement in Paris. At school, he was more interested in acting than in academics; he failed to pass his baccalaureate exams three times and left school without graduation. He studied acting at the Centre Dramatique de l'Ouest (Western Drama Theatre). There, in 1950, Noiret made his debut sharing the stage with Gérard Philipe under directorship of Roger Blin. From 1953 - 1960 Noiret was a permanent member of the troupe with the Théâtre National Populaire (TNP) in Paris. There he played over 40 roles in seven years under directorship of Jean Vilar. While there he met actress Monique Chaumette, whom he married in 1962, and they had one daughter, Frederique. At that time Noiret continued his acting career as a stand-up comedian and a night club entertainer. Noiret made his big screen debut playing bit part in Gigi (1949), then earned his first on-screen credit in Agence matrimoniale (1952). He landed his first leading role as Lui, a government inspector, in the French New Wave film La Pointe Courte (1955) by notable female director Agnès Varda. His first big success came in 1960 with Louis Malle's film Zazie dans le métro (1960) (aka.. Zazie in the Metro). In 1968 he became a star in France with the title role in Alexandre le bienheureux (1968). After that success, Noiret moved on with his acting career and devoted himself almost entirely to the big screen. Noiret's trademark hangdog face and his range allowed him to portray a middle-class man or an aristocrat, but not a handsome romantic hero, so he was cast primarily as the Everyman character. In La Grande Bouffe (1973), an allegoric film about sex orgy and suicide by overeating, which caused a scandal at Cannes in 1973, Noiret co-starred in a controversial role as suicidal judge Philippe, alongside Marcello Mastroianni. Philippe Noiret shot to international fame with the supporting role as Alfredo, an old man who is a small town projectionist who befriends and inspires a young boy, in Cinema Paradiso (1988). He received international acclaim for his portrayal of the exiled Chilean poet Pablo Neruda in Il Postino: The Postman (1994) by director Michael Radford. Noiret won two Cesar Awards (the French equivalent of the Oscars) and earned three more Cesar nominations. In 1976 he won his first Cesar for his exceptional performance as Julien Dandieu, a surgeon who kills the Nazis in revenge for the death of his wife and daughter, in The Old Gun (1975) (aka.. The Old Gun). Noiret won his second Cesar for the leading role as Major Delaplane in La vie et rien d'autre (1989) (aka.. Life and Nothing But) in 1990. Over the years, Noiret worked with all of the France's top directors. He also made excellent radio performances and popular books readings, which he narrated with his serious voice and impeccable diction. He was decorated with the Knight of the Legion of Honor. Philippe Noiret was also known as an elegant hedonist and an avid dog lover. His other interests outside of the acting profession included art, horses, gourmet cuisine and cigars. For about 30 years he resided in his country house in the wine country near Carcassonne, in the South of France, where he generously supported the local causes. Noiret died of generalized complications of cancer on November 23, 2006, in a hospital, in Paris, and was laid to rest in Cimetière du Monparnasse in Paris, France.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MzE2OTE0N15BMl5BanBnXkFtZTcwNTg2NzIwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0634159","name":"Philippe Noiret","idIMDB":"nm0634159"},"actorId":"nm0634159","character":"Jacques Garaud / Paul Harmant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jean Rochefort","urlProfile":"http://www.imdb.com/name/nm0734000","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NTY0MDg2MF5BMl5BanBnXkFtZTcwNTkxMTY1Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 April 1930","placeOfBirth":" Dinan, Cote-d'Armor, France","birthName":"Jean Raoul Robert Rochefort","height":"5' 11¼\" (1.81 m)","bio":"French character star Jean Rochefort expressed an interest in acting early in life. Born in 1930, he trained at the Paris Conservatoire but had to halt his studies due to military service. Relocating to Paris, he developed a minor name for himself in cabaret and stage plays. He also worked with the Grenier-Hussenot company at this time and acted in TV drama. Throughout his career Rochefort would return sporadically to the theatre as both actor and director. Films took his immediate focus in the late 50s and he became an audience favorite in roguish costumers and adventure films, particularly those of director Philippe De Broca, including Swords of Blood (1962), Up to His Ears (1965) and The Devil by the Tail (1969). By the 70s, Rochefort's reputation as a comedy star of sex farces and black comedies was firmly established, culminating with his classic roles in The Tall Blond Man with One Black Shoe (1972), Conspiratia (1973), Le fantôme de la liberté (1974), Affreux, sales et méchants (1976) and Pardon Mon Affaire (1976). He won the Cesar Award (French equivalent of the 'Oscar') for best supporting actor in The Clockmaker of St. Paul (1974) and the best actor trophy for Le Crabe-Tambour (1977). Though he branched out internationally in later years, he earned more kudos for his work in French-made films, especially those directed by Patrice Leconte: Tandem (1987), The Hairdresser's Husband (1990) and the Oscar-nominated Ridicule (1996). Most recently he won praise co-starring as a retired teacher of poetry opposite actor Johnny Hallyday in Man on the Train (2002). Despite his obvious comedic electricity, he has touched audiences as well playing dying naval captains, paraplegics, and timorous, elderly dreamers, often drawing both humor and pathos simultaneously from his characters. Not as well known by America's standards, his sunken, weary features, ever-searching eyes, ever-present moustache and prominent nose are unmistakable in the over 80 films he's graced. A lifetime dream was to play Don Quixote on film and his wish was nearly fulfilled until he took seriously ill and the project had to be indefinitely shelved after only a few days of filming. Rochefort received a special life's achievement Cesar award in 1999.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NTY0MDg2MF5BMl5BanBnXkFtZTcwNTkxMTY1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0734000","name":"Jean Rochefort","nicknames":["Mon petit Jeannot","Jeannot"],"idIMDB":"nm0734000"},"actorId":"nm0734000","character":"Ovide Soliveau","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeanne Valérie","urlProfile":"http://www.imdb.com/name/nm0885510","urlPhoto":"","biography":{"dateOfBirth":"19 August 1941","placeOfBirth":" Paris, France","birthName":"Micheline Yvette Voituriez","height":"5' 3¾\" (1.62 m)","bio":"Jeanne Valérie was born on August 19, 1941 in Paris, France as Micheline Yvette Voituriez. She is an actress, known for Leda (1959), La peau (1981) and Les liaisons dangereuses (1959).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0885510","name":"Jeanne Valérie","idIMDB":"nm0885510"},"actorId":"nm0885510","character":"Mary Harmant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michel Lemoine","urlProfile":"http://www.imdb.com/name/nm0501471","urlPhoto":"","biography":{"dateOfBirth":"30 September 1922","placeOfBirth":" Pantin, Seine-Saint-Denis, France","bio":"Actor, writer, director, and producer Michel Charles Lemoine was born on September 30, 1922 in Pantin, Seine-Saint-Denis, France. Michel trained under Rene Alexandre of the Comedie Francaise in the 1940's and toured extensively playing a wide variety of roles in student theater productions. His first major part was as Lenny in a stage adaptation of John Steinbeck's \"Of Mice and Men.\" Michel continued to work steadily on stage throughout the 1950's and began acting in movies initially in small parts in the late 1940's. However, it wasn't until the 1960's that Lemoine's film career really took off with his meaty role as Marco in The Prisoner of the Iron Mask (1961). In the wake of this cinematic breakthrough Michel went on to act in a diverse array of Italian pictures that encompassed such genres as Westerns, thrillers, science fiction, spy movies, and costume dramas. Among the notable directors that Lemoine acted in movies for are Mario Bava, Sacha Guitry, Jesús Franco, Julien Duvivier, Antonio Margheriti, and José Bénazéraf. Michel directed his first film How Short Is the Time for Love (1970) in 1970 and caused a huge stir at Cannes with his racy follow-up feature Les désaxées (1972). Moreover, Lemoine's offbeat The Most Dangerous Game (1932) variant Seven Women for Satan (1976) proved to be so controversial that it wound being banned in its native France after the government censor gave the film an X certificate which in turn limited its theatrical distribution to sex cinemas that didn't allow anyone under 18 to patronize. Michel eventually made the leap from soft-core erotica to more explicit hardcore fare in the late 1970's that were done using various pseudonyms and frequently starred French porn starlet Olinka Hardiman. Lemoine died at age 90 on July 27, 2013 at his home in Vinon, Cher, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0501471","name":"Michel Lemoine","idIMDB":"nm0501471"},"actorId":"nm0501471","character":"Georges Darier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"José Greci","urlProfile":"http://www.imdb.com/name/nm0337416","urlPhoto":"","biography":{"dateOfBirth":"10 January 1941","placeOfBirth":" Ferrara, Emilia-Romagna, Italy","birthName":"Giuseppina Greci","bio":"José Greci was born on January 10, 1941 in Ferrara, Emilia-Romagna, Italy as Giuseppina Greci. She is an actress, known for Hercules Against the Mongols (1963), Hercules Against the Barbarians (1964) and Goliath and the Sins of Babylon (1963).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0337416","name":"José Greci","idIMDB":"nm0337416"},"actorId":"nm0337416","character":"Amanda","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marie-France Mignal","urlProfile":"http://www.imdb.com/name/nm0585981","urlPhoto":"","biography":{"dateOfBirth":"3 April 1942","placeOfBirth":"","bio":"Marie-France Mignal was born on April 3, 1942. She is an actress, known for Ensemble, c'est tout (2007), The Creatures (1966) and The Old Gun (1975).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0585981","name":"Marie-France Mignal","idIMDB":"nm0585981"},"actorId":"nm0585981","character":"Lucie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michel Bardinet","urlProfile":"http://www.imdb.com/name/nm0054284","urlPhoto":"","biography":{"dateOfBirth":"15 November 1931","placeOfBirth":" Toulon, Var, France","bio":"Michel Bardinet was born on November 15, 1931 in Toulon, Var, France. He was an actor, known for I love you, je t'aime (1979), Chaleurs d'été (1959) and Ti ho sposato per allegria (1967). He died on February 22, 2005 in Apt, Vaucluse, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0054284","name":"Michel Bardinet","idIMDB":"nm0054284"},"actorId":"nm0054284","character":"Jules Labroue","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bernard La Jarrige","urlProfile":"http://www.imdb.com/name/nm0478657","urlPhoto":"","biography":{"dateOfBirth":"25 February 1912","placeOfBirth":" Saint-Mandé, Val-de-Marne, France","bio":"Bernard La Jarrige was born on February 25, 1912 in Saint-Mandé, Val-de-Marne, France. He was an actor, known for Madame Rosa (1977), Les dames du Bois de Boulogne (1945) and Bernadette of Lourdes (1961). He died on May 29, 1999 in Paris, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0478657","name":"Bernard La Jarrige","idIMDB":"nm0478657"},"actorId":"nm0478657","character":"Le préfet de police","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pierre Doris","urlProfile":"http://www.imdb.com/name/nm0233713","urlPhoto":"","biography":{"dateOfBirth":"29 October 1919","placeOfBirth":" Paris, France","birthName":"Pierre Tugot","bio":"Pierre Doris was born on October 29, 1919 in Paris, France as Pierre Tugot. He was an actor, known for The Counterfeit Constable (1964), The Story of a Three-Day Pass (1968) and Clémentine chérie (1964). He died on October 27, 2009 in Paris.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0233713","name":"Pierre Doris","idIMDB":"nm0233713"},"actorId":"nm0233713","character":"Le vendeur de journaux","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Vervisch","urlProfile":"http://www.imdb.com/name/nm0895093","urlPhoto":"","biography":{"bio":"Paul Vervisch is an actor, known for The Bread Peddler (1963), Comment réussir... quand on est con et pleurnichard (1974) and FX 18 (1964).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0895093","name":"Paul Vervisch","idIMDB":"nm0895093"},"actorId":"nm0895093","character":"Ricoux","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Albert Dinan","urlProfile":"http://www.imdb.com/name/nm0227514","urlPhoto":"","biography":{"dateOfBirth":"27 March 1902","placeOfBirth":" Paris, France","birthName":"Albert Edouard Ferdinand Neuzillet","bio":"Albert Dinan was born on March 27, 1902 in Paris, France as Albert Edouard Ferdinand Neuzillet. He was an actor, known for The Law Is the Law (1958), Les Bonnes Femmes (1960) and Four in a Jeep (1951). He died on July 3, 1976 in Paris.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0227514","name":"Albert Dinan","idIMDB":"nm0227514"},"actorId":"nm0227514","character":"Le Tourangeau, un boulanger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pierre Mirat","urlProfile":"http://www.imdb.com/name/nm0592266","urlPhoto":"","biography":{"dateOfBirth":"12 February 1924","placeOfBirth":" Montauban, Tarn-et-Garonne, France","bio":"Pierre Mirat was born on February 12, 1924 in Montauban, Tarn-et-Garonne, France. He was an actor, known for Astérix et la surprise de César (1985), Astérix chez les Bretons (1986) and Greed in the Sun (1964). He died on July 16, 2008 in Couilly-Pont-aux-Dames, Seine-et-Marne, France.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0592266","name":"Pierre Mirat","idIMDB":"nm0592266"},"actorId":"nm0592266","character":"La Brioche","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Aram Stephan","urlProfile":"http://www.imdb.com/name/nm0032920","urlPhoto":"","biography":{"bio":"Aram Stephan is an actor, known for Bedtime Story (1964), 55 Days at Peking (1963) and My Baby Is Black! (1961).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0032920","name":"Aram Stephan","idIMDB":"nm0032920"},"actorId":"nm0032920","character":"Le prince","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Odette Piquet","urlProfile":"http://www.imdb.com/name/nm0685049","urlPhoto":"","biography":{"bio":"Odette Piquet is an actress, known for Zazie dans le métro (1960), Borsalino (1970) and Zita (1968).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0685049","name":"Odette Piquet","idIMDB":"nm0685049"},"actorId":"nm0685049","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0057420","urlIMDB":"http://www.imdb.com/title/tt0057420","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 2 min (122 min) (USA)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"5.8","filmingLocations":[],"awards":[],"votes":"38","type":"Movie","companyCreditsSimple":[],"keywords":{"keywords":["food in title","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 19:13:52"}}