{"data":{"movies":[{"title":"The Face Behind the Mask","originalTitle":"","year":"1941","releaseDate":"19410116","directors":[{"name":"Robert Florey","id":"nm0282984"}],"writers":[{"name":"Paul Jarrico","id":"nm0418972"},{"name":"Arthur Levinson","id":"nm0506021"}],"runtime":"69 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTRiOTY0M2YtZjE4NS00Mzk2LWIzNzYtNjgwYTFhMjg3M2RjXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Film-Noir","Romance","Thriller"],"plot":"Janos Szaby is a kind, innocent immigrant to America. Just after he arrives though, he is caught in a fire and his face is horribly burned and disfigured. Although a skilled craftsman his hideous features make it impossible for him to get work, and driven by despair he is forced to turn to crime to live. He finds himself very proficient at that, and soon makes enough money to buy a very lifelike mask to hide his scars behind. He hates what he does, but is he in too deep to get out?","simplePlot":"A disfigured watchmaker with a grudge against society embarks on a life of crime.","actors":[{"actorName":"Peter Lorre","urlProfile":"http://www.imdb.com/name/nm0000048","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MzM0ODQwOV5BMl5BanBnXkFtZTYwMjYwNjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1904","placeOfBirth":" Rózsahegy, Austria-Hungary [now Ruzomberok, Slovakia]","birthName":"László Löwenstein","height":"5' 3½\" (1.61 m)","bio":"As a youth Peter Lorre ran away from home, worked as a bank clerk and, after stage training in Vienna, made his acting debut in Zurich. He remained unknown, traveling for several years and acting in Germany, Austria and Switzerland, until Fritz Lang cast him as the psychopathic child killer in M (1931). After several more films in Germany, Lorre left as the Nazis came to power, going to Paris, London and, in 1935, Hollywood. He played Raskolnikov in Crime and Punishment (1935) and a series of Mr. Moto movies during the late 1930s. He began his pairing with Sydney Greenstreet as Joel Cairo in The Maltese Falcon (1941), continued in Casablanca (1942) and seven other films during the early 1940s. In Germany he wrote, directed and starred in L'homme perdu (1951). After that, somewhat heavier, he played in a string of not-so-stellar efforts, one exception being his role as a clown in The Big Circus (1959). He died the year he made his last movie, playing a stooge in Jerry Lewis' The Patsy (1964).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MzM0ODQwOV5BMl5BanBnXkFtZTYwMjYwNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000048","name":"Peter Lorre","nicknames":["Lazzy","Europe's One Man Chamber of Horrors"],"idIMDB":"nm0000048"},"actorId":"nm0000048","character":"Janos 'Johnny' Szabo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Evelyn Keyes","urlProfile":"http://www.imdb.com/name/nm0450810","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNDIzMzk1MV5BMl5BanBnXkFtZTcwNTA5NzExOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 November 1916","placeOfBirth":" Port Arthur, Texas, USA","birthName":"Evelyn Louise Keyes","height":"5' 4\" (1.63 m)","bio":"No shrinking violet this one, but despite her talent, vivacity and sheer drive, lovely and alluring blonde Evelyn Keyes would remain for the most part typed as a \"B\" girl on the silver screen. In spite of her ripe contributions to such superior pictures as Here Comes Mr. Jordan (1941), The Jolson Story (1946), Mrs. Mike (1949), The Prowler (1951) and 99 River Street (1953), she received no significant awards during her career. In fact, film-goers seem to remember her best not for one of these exceptional co-starring parts, but for her bit role as Scarlett O'Hara's kid sister in Gone with the Wind (1939), American's most beloved epic film. Evelyn also kept Hollywood alive and kicking with two sensationalistic memoirs that chronicled her four dicey marriages, numerous affairs with the rich and famous, and negative takes on the Hollywood studio system. Evelyn Louise Keyes was born in Port Arthur, Texas, on November 20, 1916 (for decades she would deceive the public as to her real age). Her father died when she was two, and she and her only brother and three sisters grew up living with her mother and her grandmother in Atlanta, Georgia. Taking voice, dance and piano lessons, she was hopeful of becoming a ballerina. Instead, she entered a beauty pageant or two and worked as a chorus girl before relocating to California at age 20. Shortly after her arrival in Los Angeles, a chance meeting with the legendary Cecil B. DeMille led to a Paramount Pictures contract. Stories differ as to how she met De Mille. Hollywood folklore has it that she was \"discovered\" by a talent scout in true Lana Turner fashion while eating at a restaurant; another. more believable story has it that she hooked up with one of De Mille's former writers, which led to an introduction. Nevertheless, she was groomed as a starlet and initially placed in bit and/or unbilled roles. De Mille first gave her a small part in his pirate epic The Buccaneer (1938), then placed her rather obscurely in his sprawling railroad saga Union Pacific (1939). It was David O. Selznick who gave her the bit part of whiny, bratty Suellen O'Hara, who loses her beau to the more calculating Scarlett in \"Gone with the Wind\". This led directly to her signing with Columbia Pictures. In 1938, just prior to the filming of GWTW, she married businessman Barton Bainbridge, her first of four. The marriage soured within a year or so, however, after she took up with Budapest-born director Charles Vidor, who directed three of her pictures: The Lady in Question (1940) (her first at Columbia), Ladies in Retirement (1941) and The Desperadoes (1943). This second marriage lasted about as long as the first (1943-1945), supposedly due to Vidor's infidelities. At Columbia Evelyn hit pin-up status and sparked a number of war-era pictures. She played Boris Karloff's daughter in the crime horror Before I Hang (1940) and a blind woman who befriends the hideously scarred Peter Lorre in the excellent The Face Behind the Mask (1941). Still, she could not rise above her secondary status. For every one nifty \"B\" picture that could propel her into the higher ranks, such as Dangerous Blondes (1943), there was always a low-caliber western (Beyond the Sacramento (1940)), adventure (A Thousand and One Nights (1945)) or musical (The Thrill of Brazil (1946)) lurking about to keep her humble. In the post-war years, a third tempestuous but highly adventurous marriage (1946-1950) to Hollywood titan John Huston made the tabloid papers practically on a weekly basis. They divorced after four years. She did some of her best work during this period, particularly as the wife of Al Jolson opposite Larry Parks' splendid impersonation. She also showed she had a strong range and earned snappy notices alongside Dick Powell in the film noir Johnny O'Clock (1947) as well as the title comedy character in The Mating of Millie (1948) co-starring Glenn Ford. Her last (and just as questionable) marriage was to another \"father figure\" type, musician Artie Shaw, a womanizer if ever there was one who had already had been discarded by trophy wives Ava Gardner and Lana Turner (and five others) by the time he and Evelyn married in 1957. She had pretty much put her career on the back burner by this point. Surprisingly, this marriage lasted longer than any of their previous ones. The couple separated in the 1970s but did not divorce until 1985. Evelyn returned to the acting fold every once in while. Scarcely on stage (she once played Sally Bowles in a theatrical production of \"I Am a Camera\" in 1953), she joined up with Don Ameche in a 1972 tour of the musical \"No, No, Nanette\". She also would show up on an episode of The Love Boat (1977) or Murder, She Wrote (1984) every now and then. She remained childless (there was one adopted child, Pedro, by Huston, but they were estranged). Very much the traveler, Evelyn lived sporadically all over the world, including France, England and Mexico, and spoke Spanish and French fluently. She was also a writer and published a Hollywood-themed novel in her later years. Her GWTW association and tell-all memoirs in 1977 and 1991 kept her a point of interest right up until the end. Not surprisingly, this firecracker of a lady passed away on the 4th of July -- at age 91 of uterine cancer at an assisted-living residence in Montecito, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNDIzMzk1MV5BMl5BanBnXkFtZTcwNTA5NzExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0450810","name":"Evelyn Keyes","idIMDB":"nm0450810"},"actorId":"nm0450810","character":"Helen Williams","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Don Beddoe","urlProfile":"http://www.imdb.com/name/nm0065975","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU1NDI4NzgwMl5BMl5BanBnXkFtZTcwNjY5MjYwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1903","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Donald Theophilus Beddoe","height":"5' 10\" (1.78 m)","bio":"American character actor. Raised in New York City and Cincinnati, Ohio, Beddoe was the son of a professor at the Cincinnati Conservatory of Music who happened also to be the world-famous Welsh tenor, Dan Beddoe. Although Don Beddoe intended a career in journalism, he took an interest in theatre and became involved first with amateur companies and then with professional theatre troupes. He debuted on Broadway in 1929 and kept up a decade-long career on the stage. Although said to have made some minor appearances in silent films, Beddoe made his real transfer to film work in 1938. He appeared in a wide range of supporting roles in literally scores of films, often as either a fast-talking reporter or as a mousey sort. He became one of the most readily familiar faces in Hollywood movies, despite remaining almost unknown by name outside the industry. Following service in the Army Air Corps during the Second World War, he continued to work steadily in small roles, complementing them with television work. Despite advancing (and very ripe old) age, he remained quite active, supplementing his acting work with a second career in real estate. He died in 1991.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU1NDI4NzgwMl5BMl5BanBnXkFtZTcwNjY5MjYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0065975","name":"Don Beddoe","idIMDB":"nm0065975"},"actorId":"nm0065975","character":"Lt. James 'Jim' O'Hara","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George E. Stone","urlProfile":"http://www.imdb.com/name/nm0831889","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA5NTQyMjg2Ml5BMl5BanBnXkFtZTcwMDQ5NzkxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1903","placeOfBirth":" Lódz, Poland, Russian Empire [now Lódz, Lódzkie, Poland]","birthName":"Gerschon Lichtenstein","height":"5' 3½\" (1.61 m)","bio":"A minor prototype of the \"Runyon-esque\" character for more than three decades, Polish-born actor George E. Stone (né George Stein) was in actuality a close friend of writer Damon Runyon and would play a host of colorful \"dees, dem and dos\" cronies throughout the 1920s, '30s, and '40s. With great names such as Johnnie the Shiek, Boots Burnett, Ice Box Hamilton, Wires Kagel, Ropes McGonigle, Society Max, and Toothpick Charlie, Stone delighted audiences in scores of crimers for decades. A vaudeville and Broadway hoofer in the interim, the runt-sized Stone (5' 3\") finally scored in his first \"grownup\" part as the Sewer Rat in the silent drama 7th Heaven (1927) starring the once-popular romantic pair Charles Farrell and (Academy Award winner) Janet Gaynor. As \"Georgie\" sounded too child-like, he began billing himself as \"George E. Stone.\" From there he was featured in a number of \"tough guy\" potboilers, particularly for Warner Bros. So typed was he as a henchman or thug, that he found few films outside the genre. His gunsels often possessed a yellow streak and could be both broadly comic or threatening in nature, with more than a few of them ending up on a morgue slab before film's end, including his Earl Williams on The Front Page (1931) and Otero in the classic gangster flick Little Caesar (1931). Stone's most popular role of the 1940s was as The Runt in the Boston Blackie film series which ran from 1941 to 1948 and starred Chester Morris. Suffering from failing eyesight in later years, he was virtually blind by the late 1950s but, thanks to friends, managed to secure sporadic film and TV work. From 1958 on, Stone could be glimpsed in a recurring role on the popular courtroom series Perry Mason (1957) as a court clerk. Married to second wife Marjorie Ramey in 1946, he died following a stroke in 1967 in Woodland Hills, California, and was survived by two sisters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA5NTQyMjg2Ml5BMl5BanBnXkFtZTcwMDQ5NzkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0831889","name":"George E. Stone","idIMDB":"nm0831889"},"actorId":"nm0831889","character":"Dinky","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Tyrrell","urlProfile":"http://www.imdb.com/name/nm0879119","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMThhMmRmNmUtM2Q2Ni00MTk1LTg1NzktYWJkMWZlYTk0NWRmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 December 1900","placeOfBirth":" The Bronx, New York, USA","birthName":"John Edward Tyrrell","bio":"John Tyrrell entered show business at the age of 16 as half of the vaudeville dance team of Tyrrell and Mack. The act became very successful, and for the next ten years they played engagements all over the country and secured billing as featured players in the famous revue \"George White's Scandals.\" As vaudeville began to wane, however, Tyrrell saw the handwriting on the wall and began studying acting, sensing that his future would be in motion pictures. He spent two years with a stock theater company in Connecticut perfecting his craft, then journeyed to Hollywood. He was soon placed under a long-term contract to Columbia Pictures, and appeared in many of the studio's prestige pictures in supporting parts. He was a staple in the studio's comedy shorts, and often appeared with such comics as El Brendel, Andy Clyde and The Three Stooges, specializing in playing con artists, swindlers and other shady types.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMThhMmRmNmUtM2Q2Ni00MTk1LTg1NzktYWJkMWZlYTk0NWRmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0879119","name":"John Tyrrell","idIMDB":"nm0879119"},"actorId":"nm0879119","character":"Watts","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cy Schindell","urlProfile":"http://www.imdb.com/name/nm0771822","urlPhoto":"","biography":{"dateOfBirth":"4 March 1907","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Seymour Schindell","bio":"Cy Schindell was born on March 4, 1907 in Brooklyn, New York City, New York, USA as Seymour Schindell. He was an actor, known for The Devil Commands (1941), The Face Behind the Mask (1941) and Calling All Curtains (1937). He died on August 24, 1948 in Hollywood, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0771822","name":"Cy Schindell","idIMDB":"nm0771822"},"actorId":"nm0771822","character":"Benson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stanley Brown","urlProfile":"http://www.imdb.com/name/nm0114692","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzcwZTczNTktNTZmMy00M2MwLWE5MjUtZTI2MGY3ODZlMGY4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1914","placeOfBirth":" Calgary, Alberta, Canada","bio":"Stanley Brown was born on August 18, 1914 in Calgary, Alberta, Canada. He was an actor, known for Sing, Neighbor, Sing (1944), The Man with Nine Lives (1940) and Hitchhike to Happiness (1945). He was married to Lorraine McCall and Ruth F. Brown. He died on September 29, 2001 in West Los Angeles, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzcwZTczNTktNTZmMy00M2MwLWE5MjUtZTI2MGY3ODZlMGY4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0114692","name":"Stanley Brown","idIMDB":"nm0114692"},"actorId":"nm0114692","character":"Harry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Seay","urlProfile":"http://www.imdb.com/name/nm0709478","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWI3NjNlNmYtNjRjZS00NzAwLTljYzAtMGNjN2U0Y2JmMGZhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1914","placeOfBirth":" Pasadena, California, USA","birthName":"James W. Seay","height":"6' 2\" (1.88 m)","bio":"Born in 1914, durable, dependable actor James Seay was initially designed for romantic leads after being signed by Paramount in 1940. Caught up in a number of uncredited roles, the actor seemed to fare better as a villain or stern, officious type. Although military service may have taken away any chance for outright stardom, he compensated in later years by focusing on minor character roles, finding steady employment in late '40s and '50s films as a voice of authority. He was the benign old folks home doctor who expounds on Kris Kringle's mental condition in Miracle on 34th Street (1947), portrayed Col. George Washington during his early military career in When the Redskins Rode (1951) and became a familiar figure in \"B\" sci-fi classics, notably The Day the Earth Stood Still (1951), When Worlds Collide (1951), The War of the Worlds (1953), Killers from Space (1954), Beginning of the End (1957) and The Amazing Colossal Man (1957). Seay's career extended into TV, which included recurring roles on such western series as Fury (1955) (as a sheriff) and The Life and Legend of Wyatt Earp (1955) (as a judge). In hundreds of small-screen parts, he also played a captain in Disney's \"Swamp Fox\" series in 1959. Not seen after the early 1970s, Seay died at age 78 in 1992.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWI3NjNlNmYtNjRjZS00NzAwLTljYzAtMGNjN2U0Y2JmMGZhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0709478","name":"James Seay","idIMDB":"nm0709478"},"actorId":"nm0709478","character":"Jeff Jeffries","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Warren Ashe","urlProfile":"http://www.imdb.com/name/nm0038832","urlPhoto":"","biography":{"dateOfBirth":"5 March 1903","placeOfBirth":" New York, USA","bio":"Warren Ashe was born on March 5, 1903 in New York, USA. He was an actor, known for Destroyer (1943), The Face Behind the Mask (1941) and Submarine Raider (1942). He was married to Agnes Biedenkapp and Mady Correll. He died on September 19, 1947 in Madison, Connecticut, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0038832","name":"Warren Ashe","idIMDB":"nm0038832"},"actorId":"nm0038832","character":"Johnson, Reporter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles C. Wilson","urlProfile":"http://www.imdb.com/name/nm0933161","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGRmOTM4MTEtNDAxNC00YWY3LWI5MjEtYTRiYTQ0Nzg2OWYwXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1894","placeOfBirth":" New York City, New York, USA","birthName":"Charles Cahill Wilson","height":"6' (1.83 m)","bio":"Charles C. Wilson was born on July 29, 1894 in New York City, New York, USA as Charles Cahill Wilson. He was an actor and director, known for It Happened One Night (1934), Meet John Doe (1941) and This Gun for Hire (1942). He died on January 7, 1948 in Los Angeles County, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGRmOTM4MTEtNDAxNC00YWY3LWI5MjEtYTRiYTQ0Nzg2OWYwXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0933161","name":"Charles C. Wilson","idIMDB":"nm0933161"},"actorId":"nm0933161","character":"Chief O'Brien","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George McKay","urlProfile":"http://www.imdb.com/name/nm0570974","urlPhoto":"","biography":{"dateOfBirth":"15 April 1884","placeOfBirth":" Minsk, Russian Empire [now Belarus]","birthName":"George Reuben","bio":"McKay started his career as a bareback rider with a circus and later toured vaudeville with Gus Edwards' troupe. He also appeared for three years in the Ziegfeld Follies (1913-15). In 1933, he signed with Columbia Pictures and played numerous supporting and bit roles.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0570974","name":"George McKay","idIMDB":"nm0570974"},"actorId":"nm0570974","character":"Terry Finnegan","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0033582","urlIMDB":"http://www.imdb.com/title/tt0033582","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"06","month":"12","year":"1940","remarks":null},{"money":null,"country":null,"day":"26","month":"12","year":"1940","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 9 min (69 min)"],"soundMix":["Mono (Western Electric Mirrophonic Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.3","filmingLocations":[{"location":"Yuma, Arizona, USA"}],"rated":"APPROVED","awards":[],"votes":"703","type":"Movie","companyCreditsSimple":[{"idCompany":"co0050868","name":"Columbia Pictures Corporation"}],"keywords":{"keywords":["immigrant","watchmaker","mask","arizona desert","blindness","car bomb","plastic surgeon","apartment fire","police detective","hungarian","thirst","desert","airplane","blind girl","burn victim","robbery","thief","disfigurement","morality","based on play"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:57:58"}}