{"data":{"movies":[{"title":"The Tin Man","originalTitle":"","year":"1935","releaseDate":"19350330","directors":[{"name":"James Parrott","id":"nm0663613"}],"writers":[],"runtime":"19 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmI5NjA0ODMtYzllMS00MGI1LWI1ZjEtNzRhOTViM2NlMTY1XkEyXkFqcGdeQXVyMTcyODY2NDQ@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Short","Adventure","Comedy"],"plot":"Thelma and Patsy find themselves in a spooky house inhabited by a nut who is a mechanical genius and has made a robot who does everything. The inventor manipulates the robot's control board from a hidden room. The girls are soon in a panic. Patsy gets into an argument with the robot and loses the match of wits. Blackie Burke, an escaped convict, is using the house as a hideout, and this adds to the problems the girls already have.","simplePlot":"Thelma and Patsy find themselves in a spooky house inhabited by a nut who is a mechanical genius and has made a robot who does everything. The inventor manipulates the robot's control board... ","actors":[{"actorName":"Thelma Todd","urlProfile":"http://www.imdb.com/name/nm0865298","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5Mjk4ODc5MF5BMl5BanBnXkFtZTgwODQyNjc3MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1906","placeOfBirth":" Lawrence, Massachusetts, USA","height":"5' 4\" (1.63 m)","bio":"Thelma Todd was born in Lawrence, Massachusetts, an industrial city near the New Hampshire state line. She was a lovely child with good academic tendencies, so much so that she decided early on to become a schoolteacher. After high school she went on to college but at her mother's insistence entered several beauty contests (apparently her mother wanted her to be more than just a \"schoolmarm\"). Thelma was so successful in these endeavors that she entered on the state level and won the title of \"Miss Massachusetts\" in 1925 and went on to the \"Miss America\" pageant. Although she didn't win, the pageant afforded her a chance to be seen been by talent scouts looking for fresh new faces to showcase in films. She began appearing in one- and two-reel shorts, mostly comedy, which showcased her keen comic timing and aptitude for physical comedy (unusual in such a beautiful woman). She had been making shorts for Hal Roach when she was signed to Paramount Pictures. Her first film--at 21 years of age--was as Lorraine Lane in 1927's Fascinating Youth (1926), a romantic comedy, which was Paramount's showcase vehicle for its new stars. Thelma received minor billing in another film that year, God Gave Me Twenty Cents (1926). The next year she starred with Gary Cooper and William Powell in the western Nevada (1927). That year also saw her in three more films, with The Gay Defender (1927) being the most notable. It starred Richard Dix in the role of a man falsely accused of murder. As the 1920s closed, Thelma began getting parts in more and more films. In 1928 and 1929 alone she was featured in 20 pictures, and not just comedies--she also did dramas and gothic horror films. Unlike many silent-era stars whose voices didn't fit their image or screen persona, Thelma's did. She had a bright, breezy, clear voice with a pleasant trace of a somewhat aristocratic, but not snobbish, New England accent and easily made the transition to sound films. In 1930 she added 14 more pictures to her resume, with Dollar Dizzy (1930) and Follow Thru (1930) being the most notable. The latter was a musical with Thelma playing a rival to Nancy Carroll for the affections of Buddy Rogers. It was a box-office hit, as was the stage production on which it was based. The following year Thelma appeared in 14 more films, among them Let's Do Things (1931), Speak Easily (1932), The Old Bull (1932) and On the Loose (1931). Her most successful film that year, however, was the Marx Brothers farce Monkey Business (1931). While critics gave the film mixed reviews, the public loved it. In 1932 Thelma appeared in another Marx Brothers film directed by Norman Z. McLeod, Horse Feathers (1932). She also starred in This Is the Night (1932), a profitable film which featured Cary Grant in his first major role. In 1934 Thelma made 16 features, but her career would soon soon come to a grinding halt. In 1935 she appeared in such films as Twin Triplets (1935) and The Misses Stooge (1935), all showcasing her considerable comic talents. She also proved to be a savvy businesswoman with the opening of \"Thelma Todd's Sidewalk Cafe,\" a nightclub/restaurant that catered to show business people. It also, unfortunately, attracted some shady underworld types as well, and there were rumors that they were trying to take over her club and use it as a gambling establishment in order to fleece the wealthy Hollywood crowd. According to these stories, Thelma and her boyfriend, director Roland West, wouldn't sell their establishment once they found out what the gangsters had in mind, thereby incurring the enmity of people it was not a good idea to become enemies of. Whether the stories were true or not, on December 16, 1935, Thelma was found dead in her car in her garage in Los Angeles. Her death was ruled a suicide owing to carbon monoxide poisoning. She was only 29 years old. At the time, as today, many felt that her death was actually a murder connected to the goings-on at her club, a theory that was lent credence by the fact that no one who knew her had ever seen her depressed or morose enough to worry about her committing suicide. Another factor that aroused suspicion was that her death was given a cursory investigation by the--at the time--notoriously corrupt Los Angeles County District Attorney's Office and the case was quickly and unceremoniously closed. Her death has remained a controversial one even to this day. Three films she made before her death weren't released until the following year: Hot Money (1936), An All American Toothache (1936), and The Bohemian Girl (1936). The latter saw her quite substantial role cut down so much that she was barely glimpsed in the picture. Thelma had made an amazing 115 films in such a short career, and her beauty and talent would no doubt have taken her right to the top if it hadn't been for her untimely demise.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5Mjk4ODc5MF5BMl5BanBnXkFtZTgwODQyNjc3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0865298","name":"Thelma Todd","nicknames":["The Ice Cream Blonde","Hot Toddy"],"idIMDB":"nm0865298"},"actorId":"nm0865298","character":"Thelma Todd","urlCharacter":"http://www.imdb.com/character/ch0164874","main":true},{"actorName":"Patsy Kelly","urlProfile":"http://www.imdb.com/name/nm0446763","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NzQ1NTM1NF5BMl5BanBnXkFtZTcwOTA2NTExOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 January 1910","placeOfBirth":" Brooklyn, New York, USA","birthName":"Bridget Sarah Veronica Rose Kelly","height":"5' 4\" (1.63 m)","bio":"Patsy Kelly was born Bridget Sarah Veronica Rose Kelly on January 12, 1910, in Brooklyn, New York. She began performing in vaudeville when she was just twelve years old. Patsy worked with comedian Frank Fay and starred in several Broadway shows. She was discovered by producer Hal Roach who paired her with Thelma Todd in a series of comedy shorts. They became a popular onscreen team and made thirty-five films together including Top Flat and Done In Oil. Although Patsy never became an A-list star she continued to work throughout the 1930s. She had supporting roles in Pigskin Parade, Merrily We Live, and Topper Returns. Patsy was a lesbian and she was always open with the press about her sexuality. She had a long-term relationship with actress Wilma Cox. By the early 1940s Patsy was drinking heavily and making headlines for her erratic behavior. She decided to quit show business and moved to New York City. She started dating Tallulah Bankhead and worked as her secretary. Eventually Patsy went back to acting and appeared on numerous television shows. She also had small roles in the films Rosemary's Baby and Freaky Friday. Patsy won a Tony award in 1971 for her performance in No No Nanette. After suffering a stroke she moved into a nursing home. She died from pneumonia on September 24, 1981. Patsy is buried at Calvary Cemetery in Queens, New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NzQ1NTM1NF5BMl5BanBnXkFtZTcwOTA2NTExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0446763","name":"Patsy Kelly","nicknames":["The Queen of Wisecracks"],"idIMDB":"nm0446763"},"actorId":"nm0446763","character":"Patsy Kelly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matthew Betz","urlProfile":"http://www.imdb.com/name/nm0079490","urlPhoto":"","biography":{"dateOfBirth":"13 September 1881","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Matthew Von Betz","height":"6' (1.83 m)","bio":"Matthew Betz was born on September 13, 1881 in St. Louis, Missouri, USA as Matthew Von Betz. He was an actor and director, known for The Wedding March (1928), The Hurricane Express (1932) and The Patent Leather Kid (1927). He was married to Lulu Slipp. He died on January 26, 1938 in Sawtelle, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0079490","name":"Matthew Betz","idIMDB":"nm0079490"},"actorId":"nm0079490","character":"Blackie Burke","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clarence Wilson","urlProfile":"http://www.imdb.com/name/nm0933199","urlPhoto":"","biography":{"dateOfBirth":"17 November 1876","placeOfBirth":" Cincinnati, Ohio, USA","birthName":"Clarence Hummel Wilson","height":"5' 8\" (1.73 m)","bio":"Clarence Wilson was born on November 17, 1876 in Cincinnati, Ohio, USA as Clarence Hummel Wilson. He was an actor, known for You Can't Take It with You (1938), Ruggles of Red Gap (1935) and The Front Page (1931). He died on October 5, 1941 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0933199","name":"Clarence Wilson","idIMDB":"nm0933199"},"actorId":"nm0933199","character":"Mad Scientist","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0027112","urlIMDB":"http://www.imdb.com/title/tt0027112","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["19 min","15 min (TCM print)"],"soundMix":["Mono (Western Electric Sound System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["520 m (2 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["16 mm (1950s television)","35 mm"]},"rating":"6.0","filmingLocations":[{"location":"Hal Roach Studios - 8822 Washington Blvd., Culver City, California, USA"}],"rated":"APPROVED","awards":[],"votes":"91","type":"Movie","companyCreditsSimple":[{"idCompany":"co0075561","name":"Hal Roach Studios"}],"keywords":{"keywords":["robot","panic","hideout","escaped convict","genius","argument","hidden room","inventor","slapstick comedy","recluse","rescue","closet","low budget film","b movie","two word title","buddy","control freak","hysteria","farce","crook","damsel in distress","manipulation","control room","mechanical man","1930s","usa","ugly woman","old house","actor shares first and last name with character","actor shares last name with character","series","mad scientist","actor shares first name with character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 19:45:11"}}