{"data":{"movies":[{"title":"American Gigolo","originalTitle":"","year":"1980","releaseDate":"19800201","directors":[{"name":"Paul Schrader","id":"nm0001707"}],"writers":[{"name":"Paul Schrader","id":"nm0001707"}],"runtime":"117 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzJkZjE1ZjUtNTUyNy00ODk1LTgzYzUtY2VmZjhlODM5OWYwXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1.jpg","countries":["USA"],"languages":["English","Swedish","French","German"],"genres":["Crime","Drama","Mystery","Romance","Thriller"],"plot":"Julian makes a lucrative living as an escort to older women in the Los Angeles area. He begins a relationship with Michelle, a local politician's wife, without expecting any pay. One of his clients is murdered and Detective Sunday begins pumping him for details on his different clients, something he is reluctant to do considering the nature of his work. Julian begins to suspect he's being framed. Meanwhile Michelle begins to fall in love with him.","simplePlot":"A Los Angeles male escort, who mostly caters to an older female clientèle, is accused of a murder which he did not commit.","actors":[{"actorName":"Richard Gere","urlProfile":"http://www.imdb.com/name/nm0000152","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NDQ2OTY4M15BMl5BanBnXkFtZTYwNTYyNjc4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 August 1949","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Richard Tiffany Gere","height":"5' 10\" (1.78 m)","bio":"Humanitarian and actor Richard Gere was born on August 31, 1949, in Philadelphia, the second of five children of Doris Ann (Tiffany), a homemaker, and Homer George Gere, an insurance salesman, both Mayflower descendants. Richard started early as a musician, playing a number of instruments in high school and writing music for high school productions. He graduated from North Syracuse Central High School in 1967, and won a gymnastics scholarship to the University of Massachusetts in Amherst, where he majored in philosophy. He left college after two years to pursue acting, landing a lead role in the London production of the rock musical \"Grease\" in 1973. The following year he would be in other plays, such as \"Taming of the Shrew.\" Onscreen, he had a few roles, and gained recognition in Looking for Mr. Goodbar (1977). Offscreen, he spent 1978 meeting Tibetans when he traveled to Nepal, where he spoke to many monks and lamas. Returning to the US, on Broadway he portrayed a concentration-camp prisoner in \"Bent,\" for which he received the 1980 Theatre World Award. Back in Hollywood, he played the title role in American Gigolo (1980), establishing himself as a major star; this status was reaffirmed by An Officer and a Gentleman (1982). In the early 1980s, Richard went to Honduras, Nicaragua and El Salvador (amidst ongoing wars and political violence); he traveled with a doctor and visited refugee camps. It is said that he was romantically linked with lovely Brazilian painter Sylvia Martins. In 1990 Richard teamed up with Julia Roberts to star in the blockbuster Pretty Woman (1990); his cool reserve was the perfect complement to Julia's bubbling enthusiasm. The film captured the nation's heart, and won the People's Choice award for Best Movie. Fans clamored for years for a sequel, or at least another pairing of Julia and Richard. They got that with Runaway Bride (1999), which was a runaway success (Richard got $12 million, Julia made $17 million, the box office was $152 million, which shows what happens when you give the public what it wants!). Offscreen, Richard and Cindy Crawford got married December 12, 1991 (they were divorced in 1995). Afterwards, Richard started dating actress Carey Lowell. They had a son, Homer James Jigme Gere, on February 6, 2000. Richard was picked by People magazine as one of the 50 Most Beautiful People in the world in 1991, and as their Sexiest Man Alive in 1999. He is an accomplished pianist and music writer. Above all, Richard is a humanitarian. He's a founding member of \"Tibet House,\" a nonprofit organization dedicated to the preservation of Tibetan culture. He has been an active supporter of \"Survival International\" for several years, a worldwide organization supporting tribal peoples, affirming their right to decide their own future and helping them protect their lives, lands and human rights (these tribes are global, including the natives of the Amazon, the Maasai of East Africa, the Wichi of Argentina, and others). In 1994 Richard went to London to open Harrods' sale, donating his £50,000 appearance fee to Survival. He has been prominent in their charity advertising campaigns.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NDQ2OTY4M15BMl5BanBnXkFtZTYwNTYyNjc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000152","name":"Richard Gere","idIMDB":"nm0000152"},"actorId":"nm0000152","character":"Julian","urlCharacter":"http://www.imdb.com/character/ch0021730","main":true},{"actorName":"Lauren Hutton","urlProfile":"http://www.imdb.com/name/nm0001381","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0Njk4MTIwOF5BMl5BanBnXkFtZTYwMDU1OTI2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 November 1943","placeOfBirth":" Charleston, South Carolina, USA","birthName":"Mary Laurence Hutton","height":"5' 6½\" (1.69 m)","bio":"Following her success as a top fashion model for the Ford Modeling Agency and Revlon cosmetics, Hutton was selected to play the only major female character in Paper Lion (1968). After a semi-successful starring role in American Gigolo (1980), Hutton's modeling career took a slide in the 1980s, and she was relegated to B-movie roles. Her modeling career was resuscitated in 1989 with photos in catalogs for Barneys and J. Crew. In 1995, she started a new job as talk show host.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0Njk4MTIwOF5BMl5BanBnXkFtZTYwMDU1OTI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001381","name":"Lauren Hutton","idIMDB":"nm0001381"},"actorId":"nm0001381","character":"Michelle","urlCharacter":"http://www.imdb.com/character/ch0406740","main":true},{"actorName":"Hector Elizondo","urlProfile":"http://www.imdb.com/name/nm0001185","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMDEzMTE4MDFeQTJeQWpwZ15BbWU3MDk3ODU3MTM@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 December 1936","placeOfBirth":" New York City, New York, USA","height":"5' 10\" (1.78 m)","bio":"Hector Elizondo was born in New York City, New York, where he was raised, on the Upper West Side of Manhattan. He is the son of Carmen Medina Reyes and Martín Echevarría Elizondo. Hector is of Basque and Puerto Rican descent, and \"Elizondo\" means \"at the foot of the church\" in Basque. His lifestyle in his pre-acting days was as diverse as the roles he plays today. He was a conga player with a Latin band, a classical guitarist and singer, a weightlifting coach, a ballet dancer and a manager of a bodybuilding gym. In his teens, he played basketball and baseball and was scouted by the New York Giants and Pittsburgh Pirates farm teams. After a knee injury ended his dance career, he switched to drama. Since then, he has frequently appeared on Broadway, most notably with George C. Scott in Arthur Penn's production of \"Sly Fox\" for which he received a Drama Desk nomination and for his role as \"God\" in \"Steambath\", which won him an Obie Award. Other theatre credits include; \"The Prisoner of Second Avenue\"; \"The Great White Hope\"; \"Dance of Death\" with Robert Shaw and \"The Rose Tattoo\" opposite Cicely Tyson. Countless starring roles in television include: Foley Square (1985); American Playhouse: Medal of Honor Rag (1982); Casablanca (1983) (in which he recreated the Claude Rains role of police chief \"Capt. Renault\"); Freebie and the Bean (1974); Popi (1975) and as Sophia Loren's husband in the CBS special Courage (1986). Guest appearances include: Kojak (1973); Kojak: Ariana (1989); Columbo: A Case of Immunity (1975); Baretta (1975); All in the Family (1971); The Rockford Files (1974) and Bret Maverick (1981). In addition, he also directed a.k.a. Pablo (1984), the first show to utilise seven cameras instead of the usual four. On the big screen, he has been seen in, among others, American Gigolo (1980); The Taking of Pelham One Two Three (1974); Cuba (1979); Valdez Is Coming (1971) and in four films directed by Garry Marshall: Young Doctors in Love (1982); The Flamingo Kid (1984); Nothing in Common (1986) and Overboard (1987). Elizondo starred with Dan Aykroyd and Michelle Pfeiffer in PBS' Great Performances: Tales from the Hollywood Hills: Natica Jackson (1987) (based on a collection of John O'Hara stories) and made his debut as a stage director with a production of \"Villa!\" starring Julio Medina. In addition, he performed in the 50th anniversary production of \"War of the Worlds\" co-starring Jason Robards and the TV-movie Addicted to His Love (1988) with Barry Bostwick.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMDEzMTE4MDFeQTJeQWpwZ15BbWU3MDk3ODU3MTM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001185","name":"Hector Elizondo","idIMDB":"nm0001185"},"actorId":"nm0001185","character":"Sunday","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nina van Pallandt","urlProfile":"http://www.imdb.com/name/nm0887684","urlPhoto":"","biography":{"dateOfBirth":"15 July 1932","placeOfBirth":" Copenhagen, Denmark","birthName":"Nina Magdelena Møller","height":"5' 6½\" (1.69 m)","bio":"Nina Van Pallandt became famous in the United States in the early 1970s as the mistress of hoaxer Clifford Irving, who went to jail when his biography of Howard Hughes, allegedly written with Hughes' co-operation, proved to be a fake when Hughes himself came out of seclusion to repudiate the work. Van Pallandt helped expose Irving's fraud by revealing that he was vacationing with her in Mexico at the time he was allegedly interviewing Hughes. She appears, as herself, in Orson Welles' non-fiction film \"F For Fake\" (F for Fake (1973)). Van Pallandt was known in Europe as a singer of folk songs before her involvement with Irving and subsequent film career, having been married to her fellow folk singer, Baron Frederik van Pallandt, with whom she toured Europe and had many hit records as \"Nina & Frederik\". The height of Van Pallandt's film career was her appearance in four Robert Altman movies: The Long Goodbye (1973), A Wedding (1978), Quintet (1979) and O.C. and Stiggs (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0887684","name":"Nina van Pallandt","idIMDB":"nm0887684"},"actorId":"nm0887684","character":"Anne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Duke","urlProfile":"http://www.imdb.com/name/nm0004886","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNDYxNzY3MF5BMl5BanBnXkFtZTcwNDY1NTIxNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 February 1943","placeOfBirth":" Poughkeepsie, New York, USA","birthName":"William Henry Duke Jr.","height":"6' 4½\" (1.94 m)","bio":"Duke Media Entertainment, led by actor, director, producer, writer and humanitarian, Bill Duke, is dedicated to bringing quality Edutainment to audiences around the globe. Formerly Yagya Productions, Duke Media has successfully produced critically acclaimed film and television content for more than 30 years. Additionally, Duke Media is in process of expanding the brand to involve itself in the development of new media technologies, i.e. cellphone apps, games, and virtual world experiences. Since the early 70s, Bill Duke along with industry veterans Michael Shultz and Gordon Parks, have long paved the way for African Americans in the industry. Mr. Duke excels in front of and behind the camera. His acting and directing credits are extensive and include stints on such ground breaking television series as Falcon Crest, Fame, Hill Street Blues, Knotts Landing, Dallas, and New York Undercover. His feature credits include Sister Act 2: Back in the Habit, Get Rich or Die Trying, Deep Cover, Hoodlum, Predator, Menace II Society and Not Easily Broken, to name a few. He has recently completed production on, Blexicans, a new television pilot that takes a comedic look at a mixed race family. His documentaries, Dark Girls and Light Girls, both NAACP Image Award nominees, aired on OWN and were two of the most successful documentaries on the network. Bill Duke's invaluable contributions to the industry have been recognized by both his peers and the entertainment community. Appointed by former President Bill Clinton to the National Endowment of Humanities, he was appointed to the Board of the California State Film Commission by former Governor Arnold Schwarzenegger and he has been honored by the Directors Guild of America with a Lifetime Achievement Tribute.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNDYxNzY3MF5BMl5BanBnXkFtZTcwNDY1NTIxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004886","name":"Bill Duke","idIMDB":"nm0004886"},"actorId":"nm0004886","character":"Leon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brian Davies","urlProfile":"http://www.imdb.com/name/nm0203617","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MDMwNTM3M15BMl5BanBnXkFtZTcwMzY4OTk0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1938","placeOfBirth":" Rhondda Valley, Wales, UK","bio":"Brian Davies was born on November 15, 1938 in Rhondda Valley, Wales. He is an actor, known for All My Children (1970), One Life to Live (1968) and American Gigolo (1980). He has been married to Erika Slezak since August 4, 1978. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MDMwNTM3M15BMl5BanBnXkFtZTcwMzY4OTk0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0203617","name":"Brian Davies","idIMDB":"nm0203617"},"actorId":"nm0203617","character":"Charles Stratton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"K Callan","urlProfile":"http://www.imdb.com/name/nm0130282","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MjYzNTAxNF5BMl5BanBnXkFtZTgwNTM4OTA1MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1936","placeOfBirth":" Dallas, Texas, USA","birthName":"Katherine Elizabeth Borman","height":"5' 4\" (1.63 m)","bio":"Born in Dallas, Texas, K Callan's first professional job was at the Margo Jones Theatre. She first gained national attention as Peter Boyle's mousy wife in the legendary Joe (1970). Her career includes film, television and theater. Other memorable films include American Gigolo (1980) and A Touch of Class (1973). A regular guest star in countless television movies and series, her favorite television roles include the lesbian Veronica in the Emmy-winning \"Cousin Liz\" episode of All in the Family (1971), Superman's mom on Lois & Clark: The New Adventures of Superman (1993) and the wife of an Alzheimer's patient on Nip/Tuck (2003). Callan is a member of The Academy of Motion Picture Arts & Sciences, the Television Academy and is a past Board Member of the Screen Actors Guild. In addition to her work as an actor, she has also authored a string of showbiz reference books: \"How to Sell Yourself as an Actor\", \"The Script is Finished, Now What do I Do?\", \"Directing Your Directing Career\", \"The Los Angeles Agent Book\" and \"The New York Agent Book\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MjYzNTAxNF5BMl5BanBnXkFtZTgwNTM4OTA1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0130282","name":"K Callan","idIMDB":"nm0130282"},"actorId":"nm0130282","character":"Lisa Williams","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Stewart","urlProfile":"http://www.imdb.com/name/nm0829872","urlPhoto":"","biography":{"bio":"Tom Stewart is an actor and writer, known for American Gigolo (1980), Marooned (1969) and Paul's Case (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0829872","name":"Tom Stewart","idIMDB":"nm0829872"},"actorId":"nm0829872","character":"Mr. Rheiman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patricia Carr","urlProfile":"http://www.imdb.com/name/nm1124621","urlPhoto":"","biography":{"dateOfBirth":"6 December 1937","placeOfBirth":" Los Angeles, California, USA","birthName":"Patricia Ann Wilson","bio":"Patricia Carr was born on December 6, 1937 in Los Angeles, California, USA as Patricia Ann Wilson. She is an actress, known for American Gigolo (1980), The Edge of Night (1956) and A Stranger Is Watching (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1124621","name":"Patricia Carr","idIMDB":"nm1124621"},"actorId":"nm1124621","character":"Judy Rheiman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Cryer","urlProfile":"http://www.imdb.com/name/nm0190541","urlPhoto":"","biography":{"dateOfBirth":"8 March 1936","placeOfBirth":" Evanston, Illinois, USA","bio":"David Cryer was born on March 8, 1936 in Evanston, Illinois, USA. He is an actor, known for All My Children (1970), Escape from Alcatraz (1979) and As the World Turns (1956). He has been married to Margaret Elizabeth (Britt) Swanson since December 20, 1973. They have four children. He was previously married to Gretchen Cryer.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0190541","name":"David Cryer","idIMDB":"nm0190541"},"actorId":"nm0190541","character":"Lt. Curtis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carole Cook","urlProfile":"http://www.imdb.com/name/nm0176946","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzOTQ4MzAxNF5BMl5BanBnXkFtZTcwNTg1MDgwOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 January 1924","placeOfBirth":" Abilene, Texas, USA","birthName":"Mildred Frances Cook","bio":"Actress Carole Cook showed a knack for comic timing from early on, so much so that the legendary Lucille Ball took her on as a protégée. Cook would make many appearances on Ball's TV shows The Lucy Show (1962) and Here's Lucy (1968), as well as other shows like Magnum, P.I. (1980), Dynasty (1981), and Grey's Anatomy (2005). She would also appear in several movies, like Sixteen Candles (1984) and The Incredibles (2004), while maintaining an active stage career and supporting many AIDS charities.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzOTQ4MzAxNF5BMl5BanBnXkFtZTcwNTg1MDgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0176946","name":"Carole Cook","idIMDB":"nm0176946"},"actorId":"nm0176946","character":"Mrs. Dobrun","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carol Bruce","urlProfile":"http://www.imdb.com/name/nm0115433","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNDQ4ODE0Ml5BMl5BanBnXkFtZTcwMjAyMzYwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1919","placeOfBirth":" Great Neck, Long Island, New York, USA","birthName":"Shirley Levy","bio":"Daughter of Harry and Beatrice Levy - Graduate of Erasmus High School, Brooklyn, NY. Made her Broadway debut in \"Louisiana Purchase\" which was especially written for her by Irving Berlin.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNDQ4ODE0Ml5BMl5BanBnXkFtZTcwMjAyMzYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0115433","name":"Carol Bruce","idIMDB":"nm0115433"},"actorId":"nm0115433","character":"Mrs. Sloan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frances Bergen","urlProfile":"http://www.imdb.com/name/nm0074047","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjk2YWQ0OTgtZWJhMS00ODY3LTk4YzgtM2NhMjc5NWEzMWE5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1922","placeOfBirth":" Birmingham, Alabama, USA","birthName":"Frances Westerman","bio":"The daughter of William and Lillie Mae Westerman, her father died of tuberculosis when she was ten years old. Her mother then moved the family to Los Angeles. She suffered a skull fracture in an auto accident when she was 14. While recuperating, she was given a Charlie McCarthy doll to cheer her up. Little did she know she'd later marry Charlie McCarthy creator, famous comedian and ventriloquist, Edgar Bergen. Graduated from Los Angeles High School, where she was a pom-pom girl. At 19, Frances was in the audience of Edgar Bergen's radio program as the guest of a member of his staff. Sitting in the front row, her long legs caught the attention of the 39-year-old star, who asked to meet her. They were married in Mexico after a year of long distance courtship.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjk2YWQ0OTgtZWJhMS00ODY3LTk4YzgtM2NhMjc5NWEzMWE5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0074047","name":"Frances Bergen","idIMDB":"nm0074047"},"actorId":"nm0074047","character":"Mrs. Laudner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Macdonald Carey","urlProfile":"http://www.imdb.com/name/nm0136994","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNTEyMjMyMl5BMl5BanBnXkFtZTgwMzE0Nzg0MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 March 1913","placeOfBirth":" Sioux City, Iowa, USA","birthName":"Edward Macdonald Carey","height":"6' (1.83 m)","bio":"American film and television actor MacDonald Carey became famous for his role as Dr. Tom Horton on NBC's soap opera Days of Our Lives (1965). For three decades he was the centered cast member of the show. His film career was from the 1940s-'60s, and he appeared mostly in second-features (aka \"B\" pictures). He became known in Hollywood as \"The King of the B's\" (much like Lucille Ball, who was known as the \"Queen of Bs\"). He occasionally played second leads or supporting parts in \"A\" pictures, such as his role as a detective investigating suspected serial killer Joseph Cotten in Alfred Hitchcock's thriller Shadow of a Doubt (1943). He also had a successful career on Broadway and on radio. He was on \"Days of Our Lives\" from its inception in 1965 until his death in 1994.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNTEyMjMyMl5BMl5BanBnXkFtZTgwMzE0Nzg0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0136994","name":"Macdonald Carey","nicknames":["Mac"],"idIMDB":"nm0136994"},"actorId":"nm0136994","character":"Hollywood Actor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Dozier","urlProfile":"http://www.imdb.com/name/nm0236546","urlPhoto":"","biography":{"dateOfBirth":"13 February 1908","placeOfBirth":" Omaha, Nebraska, USA","birthName":"William McElroy Dozier","bio":"William Dozier was an American TV and movie producer who made it to the top of the TV heap briefly in the mid-1960s with his show Batman: The Movie (1966). Born on February 13, 1908 in Omaha, Nebraska, Dozier was also known for his wives. After divorcing his first wife, he was married to Oscar-winner Joan Fontaine from 1946 to 1951 and to movie star Ann Rutherford from 1953 to his death on April 23, 1991. In 1948, he and Fontaine launched Rampart Productions, which produced Max Ophüls' Letter from an Unknown Woman (1948) starring his wife, and You Gotta Stay Happy (1948), which starred Fontaine and James Stewart. He served as executive producer on both pictures. Turning to TV as the new decade of the Fifties dawned, Dozier produced the series Danger (1950), which ran for five years from 1950-55. In the Fifties and Sixties, he continued his career as a TV producer, bringing to the tube the short-lived TV series Rod Brown of the Rocket Rangers (1953) (1953), The Loner (1965) (1965). In 1966, he achieved the height of TV success with \"Batman\" which ran for three seasons and was a cultural sensation. The TV show spun off a Batman: The Movie (1966) feature film. That same year, he also launched , a modest success, and The Tammy Grimes Show (1966), a notorious flop that shot five episodes and was canceled after four. Dozier retired as a producer after the 1969 movie _The Big Bounce (1969) flopped, though he enjoyed a modest second career as an actor in the Seventies and early Eighties.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0236546","name":"William Dozier","nicknames":["Bill"],"idIMDB":"nm0236546"},"actorId":"nm0236546","character":"Michelle's Lawyer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0080365","urlIMDB":"http://www.imdb.com/title/tt0080365","business":{"budget":{"money":"$4,800,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 57 min (117 min)"],"soundMix":["Dolby"],"color":["Color (Metrocolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Metrocolor (color)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.2","filmingLocations":[{"location":"Burbank City Hall - 275 E. Olive Ave, Burbank, California, USA"}],"rated":"R","awards":[{"award":"Golden Globes, USA 1981","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Original Score - Motion Picture","names":[{"name":"Giorgio Moroder","id":"nm0002380","role":null}]},{"category":"Best Original Song - Motion Picture","names":[{"name":"Debbie Harry","id":"nm0001323","role":null},{"name":"Giorgio Moroder","id":"nm0002380","role":null}]}]}]}],"votes":"16,742","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["pubic hair","male pubic hair","murder","hotel","bar","politician's wife","senator","politician","pimp","alibi","male prostitute","armani","gay subtext","rich woman","theme song","female boss","boss worker relationship","male escort","line up","defense lawyer","giving up","confession","black pimp","speaking swedish","frame up","speaking french","investigation","husband wants to watch wife with another man","s&m","woman married to gay man","tenderness","rape and murder","trashing room","older woman younger man","unhappy wife","madame","love affair","jailed","metrosexual","stylish","80s","full frontal male nudity","love conquers all","true love","brief nudity","implied happy ending","false alibi","designer clothes","planted evidence","public phone","street prostitution","night","night driving","gay club","calling a man a whore","woman refusing sex","refusing sex","ocean","ransacked apartment","crime scene photograph","naked dead woman","unhappily married woman","unhappy marriage","shoe shining","walking","street","city","homicide","evasiveness","murder suspect","diner","male full frontal nudity","blonde","penis","usa","phone sex","implied sex","vulgar language","male prostitution","talking during sex","sexual innuendo","polyglot","bilingual","tipping","fur coat","prostitution","beverly hills hotel","leaning to speak swedish","learning a language","discreetness","nudity","female nudity","bare breasts","woman in a bikini","female pimp","topless sunbathing","westwood california","sex scene","doggystyle sex","ransacking","looking at self in mirror","living in hotel","police investigation","gay slur","topless female nudity","murder investigation","beverly hills california","neo noir","justice","guilt","jail visitation","jail cell","arrest","reporter","falling from height","balcony","bell bottoms","stakeout","being watched","police car","theatre marquee","innocence","scandal","district attorney","bourbon","intrigue","maitre d'","bank","rental car","planting evidence","flashlight","anger","vase","tension","suspicion","underground parking garage","hustler","primary election","painting","cowboy hat","black leather","mirror ball","gay disco","character says i love you","humiliation","boyfriend girlfriend relationship","driver's license","maid","jewelry thief","thief","fingerprints","police lieutenant","convict","eyeglasses","police lineup","blackmail","menstruation","feminism","mother son relationship","boy","liar","lie","drinking","waiter","french","scotch whiskey","pay phone","cigarette smoking","street life","singing","singer","street musician","paranoia","following someone","subjective camera","politics","speech","translator","antique auction","coffee","african american","waitress","nickname","sadist","kiss","cigar smoking","dildo","female masturbation","orgasm","older woman younger man relationship","reference to god","montage","financier","newspaper","newspaper headline","german","beige dress","widow","antique","restaurant","champagne","limousine","apology","f word","telephone call","embarrassment","dancing","westwood apartment hotel los angeles","search warrant","barber shop","murder weapon","rape","reference to jesus christ","photograph","jealousy","voyeur","sunglasses","convertible","aerial photography","stereo","bed","erection","money","weightlifting","swedish","beach house","chauffeur","haberdasher","scene during opening credits","sports car","death","infidelity","extramarital affair","husband wife relationship","two word title","loneliness","fade to black","interrogation","jail","handcuffs","police detective","falling off a balcony","desperation","framed for murder","exercise","homophobe","homophobia","gay stereotype","disco","malibu california","record store","being followed","palm springs california","male frontal nudity","speedo","swimming pool","pretending to be gay","bare chested male","telephone","gay bar","seduction","apartment","flirting","cocaine","undressing","brothel","beach","fake accent","brothel madam","womanizer","mansion","los angeles california","luxury car","sole black character dies cliche","male rear nudity","bare butt","cuckold","materialism","adulterous wife","limousine driver","gigolo","adultery","police","homosexual"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 19:38:12"}}