{"data":{"movies":[{"title":"American Madness","originalTitle":"","year":"1932","releaseDate":"19320815","directors":[{"name":"Frank Capra","id":"nm0001008"},{"name":"Allan Dwan","id":"nm0245385"}],"writers":[{"name":"Robert Riskin","id":"nm0728307"}],"runtime":"75 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MDY2MTU4N15BMl5BanBnXkFtZTgwMDY5NDUzMzE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"It's the 1930s, the Depression era, and the Board of Directors of Thomas Dickson's bank want Dickson to merge with New York Trust and resign. He refuses. One night, Dickson's bank is robbed of $100,000. The suspect is Matt Brown, an ex-convict whom Dickson hired and appointed Chief Teller. Brown, who's very loyal to Dickson, refuses to say where he was that night. He actually has two witnesses for his alibi, Mrs. Dickson and fellow worker Cyril Cluett, but Brown is protecting Dickson from finding out that Mrs. Dickson was with Cluett having a romantic evening. Cluett, who has a $50,000 gambling debt, is actually responsible for the robbery, but lets Brown take the rap. Will Brown's loyalty to Mr. Dickson pay off, or send him back to prison?","simplePlot":"Socially-conscious banker Thomas Dickson faces a crisis when his protégé is wrongly accused for robbing the bank, gossip of the robbery starts a bank run, and evidence suggests Dickson's wife had an affair...all in the same day.","actors":[{"actorName":"Walter Huston","urlProfile":"http://www.imdb.com/name/nm0404158","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MDMwNjUzOF5BMl5BanBnXkFtZTYwMjk1MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 April 1883","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Walter Thomas Huston","height":"6' (1.83 m)","bio":"For many years Walter Huston had two passions: his career as an engineer and his vocation for the stage. In 1909 he dedicated himself to the theatre, and made his debut on Broadway in 1924. In 1929 he journeyed to Hollywood, where his talent and ability made him one of the most respected actors in the industry. He won a Best Supporting Actor Academy Award for The Treasure of the Sierra Madre (1948).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MDMwNjUzOF5BMl5BanBnXkFtZTYwMjk1MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0404158","name":"Walter Huston","idIMDB":"nm0404158"},"actorId":"nm0404158","character":"Thomas A. Dickson","urlCharacter":"http://www.imdb.com/character/ch0479541","main":true},{"actorName":"Pat O'Brien","urlProfile":"http://www.imdb.com/name/nm0002285","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjc0NzQ2Ml5BMl5BanBnXkFtZTcwMzY0MDAxMw@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 November 1899","placeOfBirth":" Milwaukee, Wisconsin, USA","birthName":"William Joseph Patrick O'Brien","height":"5' 11\" (1.8 m)","bio":"Although he came to be called \"Hollywood's Irishman in Residence\"--and, along with good friends James Cagney, Allen Jenkins, Frank McHugh and a few others were called \"The Irish Mafia\"--and he often played Irish immigrants, Pat O'Brien was US-born and -bred. As a young boy the devoutly Roman Catholic O'Brien considered entering the seminary to study for the priesthood, but although he often played a Father, Monsignor or Bishop, he never actually followed through and entered the seminary. And although never a policeman, in movies he often wore the cop's badge and, although in real life he had no discernible Irish accent, he could pour on the \"brogue\" when the role called for it. Pat O'Brien excelled in roles as beneficent men but could also give convincing performances as wise guys or con artists. He was a most popular film star during the 1930s and 1940s. Over almost five decades, he co-starred in nine films with Cagney, including his own screen swansong, Ragtime (1981).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjc0NzQ2Ml5BMl5BanBnXkFtZTcwMzY0MDAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002285","name":"Pat O'Brien","idIMDB":"nm0002285"},"actorId":"nm0002285","character":"Matt","urlCharacter":"http://www.imdb.com/character/ch0479542","main":true},{"actorName":"Kay Johnson","urlProfile":"http://www.imdb.com/name/nm0425512","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODkxMzAzMDY2Nl5BMl5BanBnXkFtZTYwNzYwMDY2._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 November 1904","placeOfBirth":" Mount Vernon, New York, USA","birthName":"Catherine Townsend Johnson","height":"5' 4\" (1.63 m)","bio":"The personification of class and cultivation on the movie screen, comely actress Kay Johnson forsook a prominent stage and film career in order to play wife to actor John Cromwell and mother to their two children. Still and all, the elegant actress, reminiscent in looks and style to that of Irene Dunne and Judith Anderson, contributed to a number of important '30s and early '40s films and is deserving of a richer place in Hollywood history than has been acknowledged thus far. Born Catherine Townsend Johnson, the daughter of a Michigan architect (Thomas R. Johnson--who worked in the firm of Cass Gilbert the architect of the impressive Woolworth Building in NYC), Kay received her early education at the Drew Seminary for Young Women and later, intent on becoming an actress, studied at Sargent's Dramatic School of the American Academy of Dramatic Art (AADA). Her first professional role came with the Theatre Guild's Chicago production of \"R.U.R.\" in the role of Helena, a robot. From there she appeared on Broadway in \"Go West, Young Man\" and continued on with stage roles in \"The Morning After,\" \"One of the Family,\" \"No Trespassing\" and \"Crime\". Kay met actor/producer/director Cromwell while she was appearing in the play \"A Free Soul\" in 1928 and he was involved in another play. They married later that year (October) and moved to California, where he directed her in a stage production of \"The Silver Cord\". Her showy role as Christine earned the attention of none other than Cecil B. DeMille, who cast her in his film Dynamite (1929) opposite Charles Bickford and Conrad Nagel. While the movie received lukewarm reviews, Kay, who suffered from appendicitis and had surgery during filming, was instantly noticed. She continued on with The Ship from Shanghai (1930), This Mad World (1930) (directed by William C. de Mille, the brother of C.B.), The Spoilers (1930) (opposite Gary Cooper), the title role as Madam Satan (1930) (again for C.B. DeMille), and Billy the Kid (1930) starring Johnny Mack Brown as the legendary gunslinger. Kay alternated between stage and film parts in the following years. She toured with another production of \"The Silver Cord\" and appeared as Roxanne opposite Richard Bennett's lead in \"Cyrano de Bergerac\". Later she was on stage in \"When Ladies Meet\" and \"Living Dangerously\". On screen Kay appeared in the mediocre films The Single Sin (1931) and The Spy (1931) before glowing onscreen in such fare as American Madness (1932) and This Man Is Mine (1934), the latter directed by husband Cromwell. Kay's most noteworthy career assignment came with the screen role of Nora in W. Somerset Maugham's classic Of Human Bondage (1934)--again, directed by her husband Cromwell--with Leslie Howard and Bette Davis completing the romantic triangle. Cromwell went on to direct Kay on screen again in Village Tale (1935), Jalna (1935) and Son of Fury: The Story of Benjamin Blake (1942). Other notable Kay Johnson films included White Banners (1938), Mr. Lucky (1943) and her last, The Adventures of Mark Twain (1944). Her final acting appearance was in a prime role opposite Ralph Bellamy in a stage production of \"State of the Union\" in 1945. Kay never aggressively pursued her career, instead focusing on her marriage to Cromwell and the raising of their two children. The couple's first child was adopted in 1938; their second son, born in January of 1940, became the noted character actor James Cromwell. Following her divorce from Cromwell in the late '40s, Kay decided to remain out of the limelight. She died just short of her 71st birthday at her Waterford, CT., home on November 17, 1975, long forgotten.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODkxMzAzMDY2Nl5BMl5BanBnXkFtZTYwNzYwMDY2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0425512","name":"Kay Johnson","idIMDB":"nm0425512"},"actorId":"nm0425512","character":"Mrs. Phyllis Dickson","urlCharacter":"http://www.imdb.com/character/ch0507278","main":true},{"actorName":"Constance Cummings","urlProfile":"http://www.imdb.com/name/nm0191870","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDNmOTQ0ZDItNWUwOC00Zjc0LThmZTUtMjc3MGExYzEwY2QwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 May 1910","placeOfBirth":" Seattle, Washington, USA","birthName":"Constance Halverstadt","height":"5' 4\" (1.63 m)","bio":"Coming from a musical family - her mother was a concert soprano - Constance Cummings made her show business debut in 1926 in regional stock theater, and by 1928 had appeared in her first Broadway play. Her success in the theater resulted in an invitation to Hollywood, where she went 1931. Although she played in more than 20 films, she was never really comfortble in Hollywood nor satisfied with the parts she was getting, and in 1934 she left for England, UK. She continued her stage and film career there. but few of those films ever made it back to the U.S.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDNmOTQ0ZDItNWUwOC00Zjc0LThmZTUtMjc3MGExYzEwY2QwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0191870","name":"Constance Cummings","idIMDB":"nm0191870"},"actorId":"nm0191870","character":"Helen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gavin Gordon","urlProfile":"http://www.imdb.com/name/nm0330200","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNmI3NTMtMzYxYS00OWMzLTk2M2EtMjk1MWU1ODI5ZjhjXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 April 1901","placeOfBirth":" Chicora, Mississippi, USA","height":"5' 9\" (1.75 m)","bio":"Gavin Gordon was born on April 7, 1901 in Chicora, Mississippi, USA. He was an actor, known for Bride of Frankenstein (1935), The Bat (1959) and The Scarlet Empress (1934). He died on April 7, 1983 in Canoga Park, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNmI3NTMtMzYxYS00OWMzLTk2M2EtMjk1MWU1ODI5ZjhjXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0330200","name":"Gavin Gordon","idIMDB":"nm0330200"},"actorId":"nm0330200","character":"Cyril Cluett","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arthur Hoyt","urlProfile":"http://www.imdb.com/name/nm0398446","urlPhoto":"","biography":{"dateOfBirth":"19 March 1873","placeOfBirth":" Georgetown, Colorado, USA","height":"5' 6\" (1.68 m)","bio":"Extremely prolific actor/director of the silent screen, on Broadway from 1905. Hoyt joined the acting fraternity through the recommendations of an uncle, who worked as dramatic editor for a Cleveland tabloid. Signed by theatrical producer George C. Tyler (1868-1946), he began on stage (earning $10 per week), playing up to ten different parts. He made his Hollywood debut in 1916 with Universal. Short, balding and usually bespectacled, he managed to forge a 30-year career by playing a succession of 'little men', be they mild-mannered professors, henpecked husbands or easily intimidated minor officials. Looking perpetually befuddled was Hoyt's stock-in-trade. He was particularly effective as Professor Summerlee in The Lost World (1925) (directed by his younger brother Harry O. Hoyt), as the confused motel owner of It Happened One Night (1934) and as Mayor Tillinghast in The Great McGinty (1940). The better part of Hoyt's screen career, however, consisted of uncredited bits. For his last seven years in the business (1940-47), he was regularly employed as a member of Preston Sturges personal entourage of stock players at Paramount.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0398446","name":"Arthur Hoyt","idIMDB":"nm0398446"},"actorId":"nm0398446","character":"Ives","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Emmett O'Connor","urlProfile":"http://www.imdb.com/name/nm0640495","urlPhoto":"","biography":{"dateOfBirth":"18 March 1885","placeOfBirth":" Milwaukee, Wisconsin, USA","bio":"Stalwart Irish-American character actor Robert Emmet O'Connor, who was born on March 18, 1885, in Milwaukee, Wisconsin. He made his bones performing in circuses and in vaudeville. He made his Broadway debut in the musical \"Fritz in Tammany Hall\" at the Herald Square Theatre on October 16, 1905, ultimately appearing in 13 musical comedies and operettas on the Great White Way through 1930 (he also appeared in four straight plays during that period, mostly comedies such as \"The Old Soak\" during the 1922-23 season). After 1930, he never appeared on Broadway again, focusing instead on his movie career. He made his movie debut in 1920 in the Harold Lloyd comedy short His Royal Slyness (1920), directed by Hal Roach. He made six comedies for the Hal Roach Studios in the years 1920-21, including one more Harold Lloyd vehicle, Never Weaken (1921), before taking a five-year hiatus from films. He returned in the Thomas Meighan drama, Tin Gods (1926), directed by Allan Dwan, then spent the next 24 years acting in movies. In 1930, he went back to the Roach Studio to support Laurel and Hardy in two Spanish language shorts, then moved over to Warner Bros. as a bit player. He played the Irish bootlegger Paddy Ryan in the classic The Public Enemy (1931) in support of fellow Irish-American James Cagney, and appeared in another classic, Mystery of the Wax Museum (1933). He then settled into being typecast as Irish cops. After he moved on to MGM, the typecasting led to one of his most famous roles: the plain-clothes detective in pursuit of the Marx Brothers in A Night at the Opera (1935). During the 1940s, still under contract player to MGM, he was kept busy, appearing in every genre, including the \"Our Gang\" comedies. His last film role was as the Paramount Studios' guard who remembers Norma Desmond in Sunset Boulevard (1950). He virtually retired from his acting career at the age of 65, though he made some television appearances in the 1950s. Robert Emmett O'Connor died on September 4, 1962, of injuries sustained in a fire. He was 77 years old.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0640495","name":"Robert Emmett O'Connor","idIMDB":"nm0640495"},"actorId":"nm0640495","character":"Inspector","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0022626","urlIMDB":"http://www.imdb.com/title/tt0022626","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"02","month":"04","year":"1932","remarks":null},{"money":null,"country":null,"day":"27","month":"04","year":"1932","remarks":null}],"copyrightHolder":"Copyright MCMXXXII by Columbia Pictures Corporation (on print); © Columbia Pictures Corporation; 18 July 1932; LP3155 (in copyright registry)"},"technical":{"runtime":["1 hr 15 min (75 min)"],"soundMix":["Mono (Western Electric System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["2,162 m (8 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.5","filmingLocations":[{"location":"Warner Brothers First National Studio - 4000 Warner Boulevard, Burbank, California, USA"}],"rated":"PASSED","awards":[],"votes":"1,471","type":"Movie","companyCreditsSimple":[{"idCompany":"co0050868","name":"Columbia Pictures Corporation"}],"keywords":{"keywords":["cashier","depression","neglected wife","debt","alibi","wedding anniversary","secretary","second honeymoon","run on bank","panic","murder","kiss","infidelity","gun","guard","gossip","gangster","fight","false accusation","explosion","engagement","detective","deposit money","board member","bank vault","bank teller","bank president","bank failure","injustice","bank robbery","affair"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:00:18"}}