{"data":{"movies":[{"title":"Supernatural","originalTitle":"","year":"1933","releaseDate":"19330512","directors":[{"name":"Victor Halperin","id":"nm0356931"}],"writers":[{"name":"Garnett Weston","id":"nm0922951"},{"name":"Garnett Weston","id":"nm0922951"}],"runtime":"65 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWZmZmJlY2UtMWM2MS00NDUxLWEwZjItMjY2NzllMmM0NDcwXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Mystery","Thriller"],"plot":"In New York city, Ruth Rogan is convicted of killing 3 of her lovers and sentenced to be executed. Meanwhile, lovely Roma Courtenay becomes a millionaire heiress when her brother dies. A spiritualist approaches Roma with an urgent message from her dead brother. He runs a rigged seance that doesn't convince Roma's boyfriend Grant but has Roma confused. Then unexpectedly, the executed Ruth Rogan's spirit takes control of Roma's body. Roma runs off with the fake spiritualist under Ruth Rogan's control. Grant desperately tries to track Roma down and return her soul.","simplePlot":"A serial black widow murderess returns to life in the body of a young woman to exact revenge on a former lover, a phony spiritualist who betrayed her.","actors":[{"actorName":"Carole Lombard","urlProfile":"http://www.imdb.com/name/nm0001479","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg5NjI3MDA5Nl5BMl5BanBnXkFtZTcwMzY3OTQ4Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 October 1908","placeOfBirth":" Fort Wayne, Indiana, USA","birthName":"Jane Alice Peters","height":"5' 6\" (1.68 m)","bio":"Carole Lombard was born Jane Alice Peters in Fort Wayne, Indiana, on October 6, 1908. Her parents divorced in 1916 and her mother took the family on a trip out West. While there they decided to settle down in the Los Angeles area. After being spotted playing baseball in the street with the neighborhood boys by a film director, Carole was signed to a one-picture contract in 1921 when she was 12. The film in question was A Perfect Crime (1921). Although she tried for other acting jobs, she would not be seen onscreen again for four years. She returned to a normal life, going to school and participating in athletics, excelling in track and field. By age 15 she had had enough of school, though, and quit. She joined a theater troupe and played in several stage shows, which were for the most part nothing to write home about. In 1925 she passed a screen test and was signed to a contract with Fox Films. Her first role as a Fox player was Hearts and Spurs (1925), in which she had the lead. Right after that film she appeared in a western called Durand of the Bad Lands (1925). She rounded out 1925 in the comedy Marriage in Transit (1925) (she also appeared in a number of two-reel shorts). In 1926 Carole was seriously injured in an automobile accident that resulted in the left side of her face being scarred. Once she had recovered, Fox canceled her contract. She did find work in a number of shorts during 1928 (13 of them, many for slapstick comedy director Mack Sennett), but did go back for a one-time shot with Fox called Me, Gangster (1928). By now the film industry was moving from the silent era to \"talkies\". While some stars' careers ended because of heavy accents, poor diction or a voice unsuitable to sound, Carole's light, breezy, sexy voice enabled her to transition smoothly during this period. Her first sound film was High Voltage (1929) at Pathe (her new studio) in 1929. In 1931 she was teamed with William Powell in Man of the World (1931). She and Powell hit it off and soon married, but the marriage didn't work out and they divorced in 1933. No Man of Her Own (1932) put Carole opposite Clark Gable for the first and only time (they married seven years later in 1939). By now she was with Paramount Pictures and was one of its top stars. However, it was Twentieth Century (1934) that showed her true comedic talents and proved to the world what a fine actress she really was. In 1936 Carole received her only Oscar nomination for Best Actress for My Man Godfrey (1936). She was superb as ditzy heiress Irene Bullock. Unfortunately, the coveted award went to Luise Rainer in The Great Ziegfeld (1936), which also won for Best Picture. Carole was now putting out about one film a year of her own choosing, because she wanted whatever role she picked to be a good one. She was adept at picking just the right part, which wasn't surprising as she was smart enough to see through the good-ol'-boy syndrome of the studio moguls. She commanded and received what was one of the top salaries in the business - at one time it was reported she was making $35,000 a week. She made but one film in 1941, Mr. & Mrs. Smith (1941). Her last film was in 1942, when she played Maria Tura opposite Jack Benny in To Be or Not to Be (1942). Tragically, she didn't live to see its release. The film was completed in 1941 just at the time the US entered World War II, and was subsequently held back for release until 1942. Meanwhile, Carole went home to Indiana for a war bond rally. On January 16, 1942, Carole, her mother, and 20 other people were flying back to California when the plane went down outside of Las Vegas, Nevada. All aboard perished. The highly acclaimed actress was dead at the age of 33 and few have been able to match her talents since.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg5NjI3MDA5Nl5BMl5BanBnXkFtZTcwMzY3OTQ4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001479","name":"Carole Lombard","nicknames":["The Profane Angel","The Hoosier Tornado","The Queen of Screwball Comedy"],"idIMDB":"nm0001479"},"actorId":"nm0001479","character":"Roma Courtney","urlCharacter":"http://www.imdb.com/character/ch0129849","main":true},{"actorName":"Alan Dinehart","urlProfile":"http://www.imdb.com/name/nm0003062","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjFkZmZhMjktNzEwMC00MzQ5LTg5NmEtNWVmNTkxNmZkY2IwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1889","placeOfBirth":" St. Paul, Minnesota, USA","birthName":"Mason Alan Dinehart","bio":"Tall, heavy-set character actor Alan Dinehart dropped out of school to join a repertory company. He had extensive stage experience (including some 27 appearances on Broadway) and, by the time he was signed by Fox in 1931, he had worked not only as an actor but as a stage manager and writer. On screen he appeared for the most part in \"B\" pictures, notable exceptions being the MGM musical blockbuster Born to Dance (1936) and the 20th Century-Fox classic family drama Rebecca of Sunnybrook Farm (1938). Dinehart specialized in portraying blustering or shifty businessmen, crooked politicians or racketeers. While he is usually described as a supporting player, he actually started out in the early 1930s playing leading roles opposite some of the major female stars of the period. However, Dinehart's characters were rarely sympathetic. In Street of Women (1932) he essayed an architect who, bored with his society wife, indiscreetly keeps a mistress (Kay Francis) on the side. In Supernatural (1933) he was true to form as the phony spiritualist fleecing a wealthy socialite, played by Carole Lombard; and in Jimmy the Gent (1934) he was an urbane con artist in competition with James Cagney. On rarer occasions Alan found gainful employment as more benevolent characters, point in case his theatrical impressario Theodore von Eltz in Dance, Girl, Dance (1933). All of these performances attracted good reviews from Mordaunt Hall of the New York Times, ranging from \"excellent\" to \"bearing up valiantly\". In unlikely contrast to his self-styled image of \"Hollywood's most versatile villain\", Dinehart had strong comedic inclinations, co-authoring several comedy plays towards the later stages of his career. The last and most successful of these, \"Separate Rooms\" (1940-1941), with Dinehart top-billed alongside Glenda Farrell and Lyle Talbot, became one of the longest-running non-musical plays on Broadway at the time, finally closing after 613 performances. Alan's son, Mason Alan Dinehart, followed in his father's footsteps and also became an actor, featured in several westerns and on television from the late 1940's.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjFkZmZhMjktNzEwMC00MzQ5LTg5NmEtNWVmNTkxNmZkY2IwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003062","name":"Alan Dinehart","idIMDB":"nm0003062"},"actorId":"nm0003062","character":"Paul Bavian","urlCharacter":"http://www.imdb.com/character/ch0129850","main":true},{"actorName":"Vivienne Osborne","urlProfile":"http://www.imdb.com/name/nm0651754","urlPhoto":"","biography":{"dateOfBirth":"10 December 1896","placeOfBirth":" Des Moines, Iowa, USA","birthName":"Vera Vivienne Spragg","height":"5' 4\" (1.63 m)","bio":"Vivienne Osborne was born on December 10, 1896 in Des Moines, Iowa, USA as Vera Vivienne Spragg. She was an actress, known for Two Seconds (1932), I Accuse My Parents (1944) and Dragonwyck (1946). She was married to Francis Worthington Hine. She died on June 10, 1961 in Malibu, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0651754","name":"Vivienne Osborne","idIMDB":"nm0651754"},"actorId":"nm0651754","character":"Ruth Rogen","urlCharacter":"http://www.imdb.com/character/ch0129851","main":true},{"actorName":"Randolph Scott","urlProfile":"http://www.imdb.com/name/nm0000068","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NjgyNDk3MV5BMl5BanBnXkFtZTYwMjAxMTM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1898","placeOfBirth":" Orange County, Virginia, USA","birthName":"George Randolph Scott","height":"6' 2\" (1.88 m)","bio":"Handsome American leading man who developed into one of Hollywood's greatest and most popular Western stars. Born to George and Lucy Crane Scott during a visit to Virginia, Scott was raised in Charlotte, North Carolina in a wealthy family. After service with the U.S. Army in France in World War I, he attended Georgia Institute of Technology but, after being injured playing football, transferred to the University of North Carolina, from which he graduated with a degree in textile engineering and manufacturing. He discovered acting and went to California, where he met Howard Hughes, who obtained an audition for him for Cecil B. DeMille's Dynamite (1929), a role which went instead to Joel McCrea. He was hired to coach Gary Cooper in a Virginia dialect for The Virginian (1929) and played a bit part in the film. Paramount scouts saw him in a play and offered him a contract. He met Cary Grant, another Paramount contract player, on the set of Hot Saturday (1932) and the pair soon moved in together. Their on-and-off living arrangement would last until 1942. Scott married and divorced wealthy heiress Marion DuPont in the late 1930's. He moved into leading roles at Paramount, although his easy-going charm was not enough to indicate the tremendous success that would come to him later. He was a pleasant figure in comedies, dramas and the occasional adventure, but it was not until he began focusing on Westerns in the late 1940s that he reached his greatest stardom. His screen persona altered into that of a stoic, craggy, and uncompromising figure, a tough, hard-bitten man seemingly unconnected to the light comedy lead he had been in the 1930s. He became one of the top box office stars of the 1950s and, in the Westerns of Budd Boetticher especially, a critically important figure in the Western as an art form. Following a critically acclaimed, less-heroic-than-usual role in one of the classics of the genre, Ride the High Country (1962), Scott retired from films. A multimillionaire as a result of canny investments, Scott spent his remaining years playing golf and avoiding film industry affairs, stating that he didn't like publicity. He died in 1987 survived by his second wife, Patricia Stillman, and his two adopted children, Christopher and Sandra. He is buried in Charlotte, North Carolina.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1NjgyNDk3MV5BMl5BanBnXkFtZTYwMjAxMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000068","name":"Randolph Scott","nicknames":["Randy"],"idIMDB":"nm0000068"},"actorId":"nm0000068","character":"Grant Wilson","urlCharacter":"http://www.imdb.com/character/ch0496259","main":true},{"actorName":"H.B. Warner","urlProfile":"http://www.imdb.com/name/nm0912478","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1Mjc2NjgwMl5BMl5BanBnXkFtZTcwNTM4NDYwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1875","placeOfBirth":" London, England, UK","birthName":"Harry Byron Warner","height":"6' 0½\" (1.84 m)","bio":"Henry Byron Warner was the definitive cinematic Jesus Christ in Cecil B. DeMille's The King of Kings (1927). He was born into a prominent theatrical family on October 26, 1875 in London. His father was Charles Warner, and his grandfather was James Warner, both prominent English actors. He replaced J.B. Warner as Jesus in The King of Kings (1927) when J.B. died of tuberculosis at age 29. (J.B. was not Henry's brother. J.B. had taken the professional last name \"Warner\" because Henry's family took him in.) Henry Warner's family wanted him to become a doctor, and he graduated from London University but eventually gave up his medical studies. The theater was in his blood, and he studied acting in Paris and Italy before joining his father's stock company, making his debut in the English production of \"Drink.\" It was from his father that he honed his craft. Warner made it to America in the early 1900s, after touring the British Empire. Billed as Harry Warner, he made his Broadway debut in the American colonial drama \"Audrey\" at Hoyt's Theatre on November 24, 1902, starring James O'Neill, the father of playwright Eugene O'Neill. He was billed as H.B. Warner in his next appearance on Broadway, in the 1906 comedy \"Nurse Marjorie.\" He appeared in 13 more Broadway productions in his career, from the twin-bill of \"Susan in Search of a Husband\" & \"A Tenement Tragedy\" (also 1906) to \"Silence\" in 1925. He moved into motion pictures, making his debut in the Mutual short Harp of Tara (1914). Also in 1914, he appeared in a film written by Cecil B. DeMille for Famous Players Lasky, The Ghost Breaker (1914), in which he had played on Broadway the year before. Warner became a leading man and a star in silent pictures, reaching the zenith of his career playing Jesus in DeMille's The King of Kings (1927). His excellent performance was actually enhanced by the silent screen, allowing the audience to imagine how Jesus would sound. Warner could be extremely moving in silent pictures, notably in the melodrama Sorrell and Son (1927) as a war veteran father who sacrifices all for his son. When talkies arrived, he became a busy supporting player. A favorite of Frank Capra, appeared in Mr. Deeds Goes to Town (1936). Cast again by Capra, he was nominated for Best Supporting Actor in Lost Horizon (1937). He also appeared in You Can't Take It with You (1938), and Mr. Smith Goes to Washington (1939). Other major talkies included The Devil and Daniel Webster (1941) and Topper Returns (1941). Other than Jesus, the role he is best remembered role for today is in It's a Wonderful Life (1946), in which he played Mr. Gower, the druggist who is saved from committing a lethal medication error by the young George Bailey (the James Stewart character as a child). H.B. Warner appeared in Sunset Boulevard (1950) as himself. His last credited role was as Amminadab in DeMille's The Ten Commandments (1956), a remake of the earlier silent The Ten Commandments (1923). He last role was an uncredited bit part in Darby's Rangers (1958). Henry Warner died on December 21, 1958 in Woodland Hills, California. He was 83 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1Mjc2NjgwMl5BMl5BanBnXkFtZTcwNTM4NDYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0912478","name":"H.B. Warner","idIMDB":"nm0912478"},"actorId":"nm0912478","character":"Dr. Carl Houston","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Beryl Mercer","urlProfile":"http://www.imdb.com/name/nm0580240","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmRlN2JjZmItMjQ4NS00NmRkLWJlN2UtYzBlMTc0MWMyOTBkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 August 1876","placeOfBirth":" Surrey, England, UK","height":"4' 11\" (1.5 m)","bio":"Too short to be a leading lady, Beryl Mercer had a very active and productive career playing motherly characters. She had played opposite of great leading men like Colin Clive, Robert Montgomery, James Cagney, Gary Cooper, Leslie Howard, Spencer Tracy, and Randolph Scott. Beryl played Queen Victoria in The Little Princess (1939) and The Story of Alexander Graham Bell (1939). She and Holmes Herbert had a daughter, Joan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmRlN2JjZmItMjQ4NS00NmRkLWJlN2UtYzBlMTc0MWMyOTBkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0580240","name":"Beryl Mercer","idIMDB":"nm0580240"},"actorId":"nm0580240","character":"Madame Gourjan, Paul's Landlady","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Farnum","urlProfile":"http://www.imdb.com/name/nm0267912","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1ODUyNDMyNV5BMl5BanBnXkFtZTgwNTU3Njk1MDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 July 1876","placeOfBirth":" Boston, Massachusetts, USA","bio":"William Farnum was born the son of G.D. Farnum and Adela Le Gros, actors who trained their William and his two brothers, Dustin Farnum and Marshall Farnum, in their profession. William made his stage debut at the age of 10 in Richmond, Virginia, in a production of \"Julius Caesar\" starring Edwin Booth. His first Broadway appearance was in 1896. His first major stage success was in the title role in \"Ben Hur\", in which he toured for five years. From 1915 to 1925 he devoted himself exclusively to motion pictures and became one of the highest paid stars in Hollywood, receiving from William Fox $10,000 weekly. In 1924 he was seriously injured while filming The Man Who Fights Alone (1924). After that he was reduced to playing minor roles until the end of the silent era. He returned to the stage in 1925 playing Sir Ralph Morgan in \"The Buccaneer\". The following year he appeared in the title role of Julius Caesar and two years later was on Broadway as Banquo in \"Macbeth\". On June 10, 1953, Farnum's funeral was held at the Wilshire Methodist Church in Los Angeles. Pallbearers were Cecil B. DeMille, Jesse Lasky, Frank Lloyd, Clarence Brown, Charles Coburn and Leo Carillo. The eulogy was read by Pat O'Brien.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1ODUyNDMyNV5BMl5BanBnXkFtZTgwNTU3Njk1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0267912","name":"William Farnum","idIMDB":"nm0267912"},"actorId":"nm0267912","character":"Nick 'Nicky' Hammond","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Willard Robertson","urlProfile":"http://www.imdb.com/name/nm0732062","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDI0NGY3YmMtN2VmOC00NTIzLTg1YTItZWY5OTRmNDI2Y2M4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1886","placeOfBirth":" Runnels, Texas, USA","height":"6' 1\" (1.85 m)","bio":"Lawyer who abandoned his profession to take up the actor's calling - although lawyer and actor are essentially kindred spirits, each deriving his livelihood from the art of pretending. Robertson acted in Hollywood films from 1930 until the year he died, typically portraying men of authority such as doctors, elected officials, military officers and - yes - lawyers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDI0NGY3YmMtN2VmOC00NTIzLTg1YTItZWY5OTRmNDI2Y2M4XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0732062","name":"Willard Robertson","idIMDB":"nm0732062"},"actorId":"nm0732062","character":"Prison Warden","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Burr Macannan","urlProfile":"http://www.imdb.com/name/nm0531232","urlPhoto":"","biography":{"dateOfBirth":"30 November 1887","placeOfBirth":" Texas, USA","bio":"George Burr Macannan was born on November 30, 1887 in Texas, USA. He was an actor, known for White Zombie (1932), Supernatural (1933) and Sherlock Holmes and the Secret Weapon (1942). He died on November 12, 1970 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0531232","name":"George Burr Macannan","idIMDB":"nm0531232"},"actorId":"nm0531232","character":"Max Schmitt, Glass Blower","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lyman Williams","urlProfile":"http://www.imdb.com/name/nm0931208","urlPhoto":"","biography":{"dateOfBirth":"13 November 1909","placeOfBirth":" Kalamazoo, Michigan, USA","height":"6' (1.83 m)","bio":"Lyman Williams was born on November 13, 1909 in Kalamazoo, Michigan, USA. He was an actor, known for Damaged Lives (1933), Supernatural (1933) and Glamour (1934). He died on January 28, 2000 in Laguna Hills, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0931208","name":"Lyman Williams","idIMDB":"nm0931208"},"actorId":"nm0931208","character":"Ghost of John Courtney","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0024631","urlIMDB":"http://www.imdb.com/title/tt0024631","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Paramount Productions, Inc.; 4 May 1933; LP3857"},"technical":{"runtime":["1 hr 5 min (65 min)"],"soundMix":["Mono (Western Electric Noiseless Recording)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["(7 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.3","filmingLocations":[{"location":"Paramount Studios - 5555 Melrose Avenue, Hollywood, Los Angeles, California, USA"}],"rated":"PASSED","awards":[],"votes":"362","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["spiritualist","fake spiritualist","murderess","new york city","seance","revenge","heiress","evil spirit","death of brother","mountebank","biblical quote","reference to mohammed","quote from confucius","solarium","collie dog","coffin","funeral parlor","newspaper headline","transmutation","glass","flower","portrait","doctor","hanging body","seduction","model ship","fainting","incense","handkerchief","reference to confucius","poison ring","oil painting","el train","medium","evil","black widow","serial murder","transubstantiation","strangulation","trance","yacht","landlady","ghost","murder","dog","boat","deathmask","charlatan","afterlife","possession","fortune hunter","supernatural","electric chair","hanging","blackmail","corpse","ring","superstition","brother sister relationship","pseudo science","poison","execution"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:04:09"}}