{"data":{"movies":[{"title":"What's Up, Doc?","originalTitle":"","year":"1972","releaseDate":"19720310","directors":[{"name":"Peter Bogdanovich","id":"nm0000953"}],"writers":[{"name":"Buck Henry","id":"nm0377750"},{"name":"David Newman","id":"nm0628058"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDVjNWFlYmQtODhjNy00NDUwLWI0NTYtZmI5OTRjNzc1NzA1XkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"Two researchers have come to San Francisco to compete for a research grant in Music. One seems a bit distracted, and that was before he meets her. A strange woman seems to have devoted her life to confusing and embarassing him. At the same time a woman has her jewels stolen and a government whistle blower arrives with his stolen top secret papers. All, of course have the same style and color overnight bag.","simplePlot":"The accidental mix-up of four identical plaid overnight bags leads to a series of increasingly wild and wacky situations.","actors":[{"actorName":"Barbra Streisand","urlProfile":"http://www.imdb.com/name/nm0000659","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwOTQ3NTg1MF5BMl5BanBnXkFtZTcwMjc4MjQ4OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1942","placeOfBirth":" Williamsburg, Brooklyn, New York City, New York, USA","birthName":"Barbara Joan Streisand","height":"5' 5\" (1.65 m)","bio":"Barbra Streisand is an American singer, actress, director and producer and one of the most successful personalities in show business. She is the only person ever to receive all of the following: Oscar, Tony, Emmy, Grammy, Golden Globe, Cable Ace, National Endowment for the Arts, and Peabody awards, as well as the American Film Institutes Lifetime Achievement honor and the Film Society of Lincoln Center Chaplin Award. She was born in Brooklyn, New York, in 1942 to Diana (née Ida Rosen), a singer turned school secretary, and Emanuel Streisand, a high school teacher. Her father was of Galician (Polish) Jewish descent and her mother was of Russian Jewish ancestry. As a child she attended the Beis Yakov Jewish School in Brooklyn. She was raised in a middle-class family and grew up dreaming of becoming an actress (or even an actress / conductor, as she happily described her teenage years at one of her concerts). After a period as a nightclub singer and off-Broadway performer in New York City she began to attract interest and a fan base, thanks to her original and powerful vocal talent. She debuted on Broadway in the 1962 musical comedy \"I Can Get It For You Wholesale\" by Harold Rome, receiving a Tony Award nomination for Best Supporting Actress and a New York Drama Critics Poll award. The following year she reached great commercial success with her first Columbia Records solo releases, \"The Barbra Streisand Album\" (multiple Grammy winner, including \"Best Album of the Year\") and \"The Second Barbra Streisand Album\" (her first RIAA Gold Album); these albums, mostly devoted to composer Harold Arlen, brought her critical praise and, most of all, public acclaim all over the US. In 1964 she continued ha another smash Broadway hit when she portrayed legendary Broadway star Fanny Brice in \"Funny Girl\" by Jule Styne and Bob Merrill; the show's main song, \"People\". became her first hit and she appeared on the cover of \"Time\" magazine. After many TV appearances as guest on various music and variety shows (such as an episode of The Judy Garland Show (1963), for which she was nominated for 1963 Emmy), she signed an exclusive contract with CBS for a series of annual TV specials : My Name Is Barbra (1965) (which won an Emmy) and Color Me Barbra (1966) her first work in color were extremely successful. After a brief London stage period and the birth of her son Jason Gould (with then-husband Elliott Gould), in summer 1967 she gave a memorable free concert in New York City, \"A Happening in Central Park\", that was filmed and later broadcast (in an edited version) as a TV special; then she flew to Hollywood for her first movie, Funny Girl (1968), a filming of her stage success. The picture, directed by William Wyler, opened in 1968 and became a hit in the US and abroad, making her an international \"superstar' and multiple award winner, including an Oscar (her first) as Best Actress. After a series of screen musicals, such as _Gene Kelly (I)''s _Hello Dolly (1969)_ and Vincente Minnelli's On a Clear Day You Can See Forever (1970), she wanted to try comedies, resulting in such films as The Owl and the Pussycat (1970) and What's Up, Doc? (1972). She turned to dramas and turned out Up the Sandbox (1972) and the classic The Way We Were (1973), directed by Sydney Pollack and co-starring Robert Redford, in which she gave what many consider to be her finest performance. The song \"The Way We Were\" (written by Marvin Hamlisch and Alan Bergman and Marilyn Bergman) became one of her biggest hits and most memorable and famous songs. She returned to TV for a new special conceived as a musical journey covering many world musical styles, Barbra Streisand and Other Musical Instruments (1973), then returned (for contractual reasons) to her Fanny Brice role in a sequel to her hit \"Funny Girl film, Funny Lady (1975), and the next year turned out one of her most personal film projects, A Star Is Born (1976), one of the biggest hits of the year for which she won a Golden Globe for Best Actress and her second Oscar, for the song \"Evergreen\". Always extremely busy on the discography side, averaging one album a year throughout the '70s and '80s, she had a string of successful singles and albums, such as \"You Don't Bring Me Flowers\" (duet with 'Neil Diamond'), \"Enough is Enough\" (with Donna Summer), \"The Main Event\" (from her film The Main Event (1979) with her friend Ryan O'Neal) and the album \"Guilty\", written for her by The Bee Gees' Barry Gibb, which sold more than 10 million copies worldwide. She debuted as a director with the musical drama Yentl (1983), in which she also portrayed a Jewish girl who is forced to pass herself off as a man to pursue her dreams. The movie received generally positive reviews and the beautiful score by Michel Legrand and lyricists Marilyn Bergman and Alan Bergman stands up as one of Streisand's finest musical works. The film received several Oscar nominations, winning in two categories, but she was not nominated as Best Director, which disappointed both her and her fans, many of whom consider this the Academy's biggest \"snub\". In 1985 her album \"The Broadway Album was an unexpected runaway success, winning a Grammy Award and helping to introduce a new generation to the world of American musical theater. In 1986 she performed in a memorable concert, after 20 years of stage silence, \"One Voice\" (1986). She returned to the screen in the Nuts (1987), a drama directed by Martin Ritt, in the role of a prostitute accused of murder who fights to avoid being labeled \"insane\" at her trial. In she appeared in The Prince of Tides (1991), which many consider to be the pinnacle of her screen career, playing a psychiatrist who tries to help a man (Nick Nolte) to find the pieces of his past life: the film received seven Oscar nominations (but again NOT for Best Directing), but she did receive a nomination from the DGA (Directors Guild of America) for Best Director. In 1994 she returned to the stage after 27 years for a series of sold-out concerts (for the televised version of one of these, she won another Emmy). In the 1990s she broke several personal records: with two #1 albums (\"Back to Broadway\" in 1993 and \"Higher Ground\" in 1997) and became the only artist to achieve a #1 album on the Billboard charts in the 1960s, 1970s, 1980s and 1990s (she extended this record into the 21st century in 2009 with the jazz album \"Love is the Answer\"). In 1996 she starred in her third and last picture as director, The Mirror Has Two Faces (1996), with Jeff Bridges and Lauren Bacall. The film had a \"the girl got the guy\" ending, and the same happened to her in real life--the next year she married well known TV actor James Brolin. In 2000 she focused her career again on concerts (\"Timeless\") and in 2006-07 with a European tour. She made only two more films--a supporting role as a sex therapist mother in the Ben Stiller comedy Meet the Fockers (2004) and its sequel, Little Fockers (2010), alongside Dustin Hoffman and Robert De Niro. She published a book, \"Passion for Design\", in 2010 and celebrated her friendship with the Bergmans with an entire album of their songs, \"What Matters Most\" (2011), that debuted in the top 10. After a long break from filming, she returned in a starring role for the 2012 holiday season with The Guilt Trip (2012), a mother/son picture co-starring Seth Rogen and directed by Anne Fletcher, and is working on putting together a film version of the well-known Jule Styne musical \"Gypsy\". In almost 50 years of career, Streisand has contributed to the show business industry in a personal and unique way, collecting a multi-generational fan base; she has a powerful and recognize vocal range, and a raucous and often self-deprecating sense of humor, which doesn't prevent her from showing the serious and dramatic sides of her personality. Her strong political belief in social justice infuses her professional career and personal life, and she makes no bones about what she believes; her willingness to put her money where her mouth is has resulted in some truly vicious attacks by many who hold opposite political views, but that hasn't stopped her from acting on her beliefs. She has been honored with the Humanitarian Award from the Human Rights Campaign, an Honorary Doctorate in Arts and Humanities from Brandeis University in 1995, an Honorary Doctorate of Philosophy from the Hebrew University of Jerusalem in 2013 and the bestowing by the government of France the title of Commander of the Order of Arts and Letters. She supports many humanitarian causes through the Streisand Foundation and has been a dedicated environmentalist for many years; she endowed a chair in environmental studies in 1987 and donated her 24-acre estate to the Santa Monica Mountains Conservancy. In addition, she was the lead founder for the Clinton Climate Change Initiative. This effort brought together a consortium of major cities around the world to drive down greenhouse gas emissions. She is a leading spokesperson and fund-raiser for social and political causes close to her heart and has often dedicated proceeds from her live concert performances to benefit programs she supports.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMwOTQ3NTg1MF5BMl5BanBnXkFtZTcwMjc4MjQ4OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000659","name":"Barbra Streisand","nicknames":["Babs"],"idIMDB":"nm0000659"},"actorId":"nm0000659","character":"Judy Maxwell","urlCharacter":"http://www.imdb.com/character/ch0022206","main":true},{"actorName":"Ryan O'Neal","urlProfile":"http://www.imdb.com/name/nm0641939","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUxOTMwMTI1N15BMl5BanBnXkFtZTcwOTUxMDkwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1941","placeOfBirth":" Los Angeles, California, USA","birthName":"Charles Samuel Eldridge Patrick Ryan O'Neal III","height":"6' 1\" (1.85 m)","bio":"Ryan O'Neal was born on April 20, 1941 in Los Angeles, California, USA as Charles Samuel Eldridge Patrick Ryan O'Neal III. He is an actor, known for Peyton Place (1964), Barry Lyndon (1975) and Paper Moon (1973). He was previously married to Leigh Taylor-Young and Joanna Moore.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUxOTMwMTI1N15BMl5BanBnXkFtZTcwOTUxMDkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641939","name":"Ryan O'Neal","idIMDB":"nm0641939"},"actorId":"nm0641939","character":"Howard Bannister","urlCharacter":"http://www.imdb.com/character/ch0022208","main":true},{"actorName":"Madeline Kahn","urlProfile":"http://www.imdb.com/name/nm0001404","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTkzMDkzMTI0OF5BMl5BanBnXkFtZTcwNTUzOTAxNQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1942","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Madeline Gail Wolfson","height":"5' 3\" (1.6 m)","bio":"Madeline Kahn was born Madeline Gail Wolfson on September 29, 1942 in Boston, Massachusetts, to Freda (Goldberg) and Bernard B. Wolfson, a garment manufacturer. She was of Russian Jewish descent. Madeline began her acting career in high school and went on to university where she trained as an opera singer and starred in several campus productions, ultimately earning a doctorate in her chosen field. Her finest years came in Paper Moon (1973) with Ryan O'Neal, which was followed the next year by Mel Brooks's outrageous Blazing Saddles (1974) as Lili Von Shtupp, a cabaret singer who was obviously based on Marlene Dietrich's performance in Destry Rides Again (1939). She was so delightful in both that Madeline was nominated for an Academy Award for Best Supporting Actress in both movies. In 1998, Madeline lent her voice to Gypsy in the wildly popular animated film A Bug's Life (1998). Tragically, on December 3, 1999, Madeline died of ovarian cancer in New York City, a disease from which she suffered for about a year while she was a cast member of Cosby (1996). The accomplished stage and screen actress was only 57 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTkzMDkzMTI0OF5BMl5BanBnXkFtZTcwNTUzOTAxNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001404","name":"Madeline Kahn","idIMDB":"nm0001404"},"actorId":"nm0001404","character":"Eunice Burns","urlCharacter":"http://www.imdb.com/character/ch0022207","main":true},{"actorName":"Kenneth Mars","urlProfile":"http://www.imdb.com/name/nm0550318","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4ODQ1NTIwNF5BMl5BanBnXkFtZTcwMzIxOTQ3MQ@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 April 1935","placeOfBirth":" Chicago, Illinois, USA","height":"6' 3\" (1.91 m)","bio":"Kenneth Mars was born on April 4, 1935 in Chicago, Illinois, USA. He was an actor, known for The Little Mermaid (1989), Butch Cassidy and the Sundance Kid (1969) and Young Frankenstein (1974). He was married to Barbara Newborn. He died on February 12, 2011 in Granada Hills, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4ODQ1NTIwNF5BMl5BanBnXkFtZTcwMzIxOTQ3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0550318","name":"Kenneth Mars","nicknames":["Kenny"],"idIMDB":"nm0550318"},"actorId":"nm0550318","character":"Hugh Simon","urlCharacter":"http://www.imdb.com/character/ch0022209","main":true},{"actorName":"Austin Pendleton","urlProfile":"http://www.imdb.com/name/nm0671721","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMzY4NjY1MzNeQTJeQWpwZ15BbWU3MDIzNjIzNjI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 March 1940","placeOfBirth":" Warren, Ohio, USA","bio":"Actor Austin Pendleton was born March 27, 1940 in Warren, Ohio to Frances and Thorn Pendleton. He graduated from Yale University. He later became an ensemble member of the Steppenwolf Theater in Chicago, and acted in several of the theater's productions. His first film appearance in Petulia (1968), a minor and uncredited role. Since, he has made over 100 appearances in television and film.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMzY4NjY1MzNeQTJeQWpwZ15BbWU3MDIzNjIzNjI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0671721","name":"Austin Pendleton","idIMDB":"nm0671721"},"actorId":"nm0671721","character":"Frederick Larrabee","urlCharacter":"http://www.imdb.com/character/ch0022211","main":true},{"actorName":"Michael Murphy","urlProfile":"http://www.imdb.com/name/nm0614526","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MTIyNzAxMF5BMl5BanBnXkFtZTgwNjkzMTc5NTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1938","placeOfBirth":" Los Angeles, California, USA","birthName":"Michael George Murphy","height":"6' 1\" (1.85 m)","bio":"Michael Murphy was born in Los Angeles, California, to Georgia Arlyn (née Money), a teacher, and Bearl Branton Murphy, a salesman. After a hitch in the Marine Corps, Murphy attended the University of Arizona, Tuscon, and then went to U.C.L.A. to get his teaching credential. From 1962 to 1964, he taught high school English and drama in Los Angeles. Murphy's most notable appearance was as Woody Allen's best friend Yale, the self-tortured adulterer, in Allen's masterpiece Manhattan (1979). The two had acted together earlier in Martin Ritt's The Front (1976) and had become good friends. Surpisingly, despite the excellent performance Murphy gave in the film, Allen hasn't used him again. Murphy's career as a first-rate supporting player has continued for four decades, with major parts in Paul Mazursky's An Unmarried Woman (1978), which he calls \"the first of the whining yuppies,\" Peter Weir's L'année de tous les dangers (1982), and Oliver Stone's Salvador (1986). He also has worked with such significant directors as Elia Kazan in The Arrangement (1969), Tim Burton in Batman Returns (1992), and Paul Thomas Anderson in Magnolia (1999). Murphy recently co-starred in John Sayles' Silver City (2004), as a U.S. Senator who is the father of a gubernatorial candidate played by Oscar-winner Chris Cooper, standing-in for the pre-presidential George W. Bush. Murphy is perhaps best known for his long collaboration with director Robert Altman that stretches back to the beginning of his career. \"I was right out of the University of Arizona,\" Murphy reminisced during a 2004 interview, \"and a friend said, 'Go to Bob. He's using young guys for this Army thing.'\" Altman was directing the World War II television series Combat! (1962), and Altman cast him in the show without an audition. \"Bob took me under his wing. He told me, 'You're never going to be a movie star. But you'll do some interesting things.' Bob was maybe 35 years old when we met. He'd never play it safe. He has amazing fortitude and guts.\" In addition to Combat! (1962) and the Altman-directed TV movie Nightmare in Chicago (1964), Murphy has appeared in seven theatrical movies directed by Altman between 1968 and 1996: Countdown (1967), That Cold Day in the Park (1969), MASH (1970), Brewster McCloud (1970), McCabe & Mrs. Miller (1971), Nashville (1975), and Kansas City (1996). Murphy has also appeared in Altman's TV adaptation of Herman Wouk's play The Caine Mutiny Court-Martial (1988) and in two cable-TV mini-series for him: Tanner '88 (1988) and Tanner on Tanner (2004). About Altman, Murphy says, \"I adore the guy. If you're getting married or divorced, or someone dies, you want to talk to him about it. He's so strong, he sees the big picture. An extraordinary man.\" Murphy played the title role of Michigan Congressman Jack Tanner in Altman's ground-breaking HBO series Tanner '88 (1988), which was scripted by Garry Trudeau of \"Doonesbury\" fame. The fictional Tanner ran for president in the Democratic Party primaries of 1988, alongside George Bush (whom Murphy himself \"plays\" in Silver City (2004)), Michael Dukakis, Al Gore, and Pat Robertson, with some \"guest appearances\" by Ronald Reagan along the way. The \"candidate\" Tanner actually interacted on-camera with candidates Gary Hart, Bob Dole, and Jesse Jackson, and with the journalists Linda Ellerbee and Chris Matthews. During the progress of the series' eleven episodes, Tanner increasingly became alienated as the grueling political marathon went on. He was portrayed as an intellectual troubled by sound-bite politics and the public person he was compelled to create for the media-fueled electoral machine that vetted the candidates for the public at the other end of the cathode-ray tube. Tanner eventually realizes he lacks the all-consuming drive to be a successful presidential candidate under such a system. A caustic look at American politics from a liberal-left-anarchist point of view, \"Tanner '88\" won the prize for best television series at the Festival International de Programmes Audiovisuels in Cannes in the fall of 1988. The mini-series ranks among the best and most important of television programs. Altman-Murphy-Trudeau reprised Tanner with \"Tanner on Tanner\" (2004), in which the character did not run but commented on the political process and on the media circus accompanying the pursuit for the nation's highest office. About the new cable mini-series, Murphy says, \"Bob is showing the nastiness behind all campaigns. I don't think it's a polemic. In Bob's case, you vote for the Democrat, but be careful of what you ask for. Bob is very cynical.\" Despite decades of solid performances in a plethora of movies, Murphy remains anonymous to the public at large. Arriving in a limousine at the 2004 Toronto Film Festival premiere of Silver City (2004), he got out of the car and was unrecognized. When the publicists eventually realized he was a star of the film, Murphy was ordered back into the limousine so that he could exit it again, and the paparazzi could photograph him. \"I'm in this fun position where people don't really know who I am,\" Murphy said when recounting the incident. \"It's a good look at life. You get a perspective.\" In 1988, Michael Murphy married the co-star of his short-lived television show Hard Copy (1987), the actress Wendy Crewson. She has also appeared with her husband in Tanner '88 (1988) and in the theatrical films Folks! (1992) and Sleeping Dogs Lie (1998). They have two children, a daughter, Maggie Murphy, born in 1989, and a son, John (\"Jack\") Branton Murphy, born in 1992.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MTIyNzAxMF5BMl5BanBnXkFtZTgwNjkzMTc5NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0614526","name":"Michael Murphy","idIMDB":"nm0614526"},"actorId":"nm0614526","character":"Mr. Smith","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Philip Roth","urlProfile":"http://www.imdb.com/name/nm0744981","urlPhoto":"","biography":{"dateOfBirth":"6 July 1930","placeOfBirth":" Kansas City, Missouri, USA","birthName":"Philip J. Rothblatt","bio":"Veteran character actor; born in KC, Mo., Roth served in the Army during WWII, then moved to NYC, where he began studying acting with Lee Strasberg; Roth was the first and only person to do a scene with Marilyn Monroe at the Actors' Studio; appeared in various stage roles before landing guest TV shots; his last appearance was in the independent film The League of Old Men (1998)_.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0744981","name":"Philip Roth","idIMDB":"nm0744981"},"actorId":"nm0744981","character":"Mr. Jones","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sorrell Booke","urlProfile":"http://www.imdb.com/name/nm0095368","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxOTQ2NzY1NF5BMl5BanBnXkFtZTYwNzIwNzM2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 January 1930","placeOfBirth":" Buffalo, New York, USA","height":"5' 6\" (1.68 m)","bio":"Sorrell Booke was born in Buffalo, New York in 1930, the son of a local physician. He found his calling early in life, like most actors, when his family encouraged him to entertain relatives by doing impressions and telling jokes. He went on to study at Yale and Columbia University, and mastered five languages. During the Korean War, Booke worked in counter-intelligence where his lingual talents served him well. His intelligence and subtlety are often overlooked when considering his signature role as Jefferson Davis \"Boss\" Hogg during his run on The Dukes of Hazzard (1979). He died of cancer in 1994 just after his 64th birthday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxOTQ2NzY1NF5BMl5BanBnXkFtZTYwNzIwNzM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0095368","name":"Sorrell Booke","idIMDB":"nm0095368"},"actorId":"nm0095368","character":"Harry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stefan Gierasch","urlProfile":"http://www.imdb.com/name/nm0317369","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2NDk5OTc2NV5BMl5BanBnXkFtZTcwMjkwMjYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1926","placeOfBirth":" New York City, New York, USA","bio":"Stefan Gierasch was born on February 5, 1926 in New York City, New York, USA. He was an actor, known for Carrie (1976), The Hustler (1961) and High Plains Drifter (1973). He was married to Hedy Sontag and Jane E. Churchman. He died on September 6, 2014 in Santa Monica, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2NDk5OTc2NV5BMl5BanBnXkFtZTcwMjkwMjYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0317369","name":"Stefan Gierasch","idIMDB":"nm0317369"},"actorId":"nm0317369","character":"Fritz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mabel Albertson","urlProfile":"http://www.imdb.com/name/nm0016781","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1MjkxNjQ1MjdeQTJeQWpwZ15BbWU4MDAwNzA4MzIx._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 July 1901","placeOfBirth":" Lynn, Massachusetts, USA","birthName":"Mabel Ida Albertson","bio":"When, at 50, Mabel Albertson was given the supporting role of Mrs. Carter, young actress Aileen Stanley Jr.'s mother in a Warner Bros. Technicolor musical romance, little did she know that she was starting out a movie and TV career in which she would shine as \"the ultimate haughty judgmental (often wealthy) mother-in-law (or mother, or stepmother, or auntie)\" in an impressive series of films, TV films or TV series episodes. Mabel Albertson's comic gifts helped her to make these generally obnoxious characters hilarious. She is indeed memorable as Jerry Lewis' mother-in-law in Don't Give Up the Ship (1959), as George Hamilton's mother in All the Fine Young Cannibals (1960) or the domineering mother-in-law of poor Anthony Franciosa in Period of Adjustment (1962). On television, Tom Ewell, Dick Van Dyke and Dick Sargent, among others, were given the same treatment by their screen mother. Even at 50 years of age, Mabel Albertson was no newcomer to the business. In fact, she had been a successful vaudeville performer in the 1920s, a radio star in the 1930s and a theater actress and director in the 1940s. She had tried her hand in films twice (in 1928 and 1940) but without much success. Ironically, it was the film business that had previously rejected her which would make her unforgettable from the early 1950s to the late 1970s when Alzheimer's Disease put an and end to a long and fruitful career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1MjkxNjQ1MjdeQTJeQWpwZ15BbWU4MDAwNzA4MzIx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0016781","name":"Mabel Albertson","idIMDB":"nm0016781"},"actorId":"nm0016781","character":"Mrs. Van Hoskins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Liam Dunn","urlProfile":"http://www.imdb.com/name/nm0242668","urlPhoto":"","biography":{"dateOfBirth":"12 November 1916","placeOfBirth":" New Jersey, USA","height":"5' 7\" (1.7 m)","bio":"Liam Dunn was born in New Jersey in 1916, went to regular high school and entered a small acting school where he constantly acted in plays. Dunn was considered for his first movie role in 1968, but turned it down to work on T.V. Dunn's first big break came in 1972 for his character Judge Maxwell in the film What's Up, Doc? (1972). On the set Mel Brooks was looking for actors to form a stock, and he recruited Dunn and Madeline Kahn. Dunn is forever remembered for the character Rev. Johnson in Blazing Saddles (1974). Dunn's other works include Young Frankenstein (1974) and Silent Movie (1976). After \"Silent Movie\", Dunn, now weak and thin was diagnosed with emphysema. Liam Dunn died in 1976 at age 59.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0242668","name":"Liam Dunn","idIMDB":"nm0242668"},"actorId":"nm0242668","character":"Judge Maxwell","urlCharacter":"http://www.imdb.com/character/ch0022212","main":true},{"actorName":"John Hillerman","urlProfile":"http://www.imdb.com/name/nm0384916","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyODA0MDQxM15BMl5BanBnXkFtZTcwNDM2MzYwOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 December 1932","placeOfBirth":" Denison, Texas, USA","birthName":"John Benedict Hillerman","height":"5' 7\" (1.7 m)","bio":"John Hillerman was born on December 20, 1932 in Denison, Texas, USA as John Benedict Hillerman. He is an actor, known for Magnum, P.I. (1980), Chinatown (1974) and Blazing Saddles (1974).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyODA0MDQxM15BMl5BanBnXkFtZTcwNDM2MzYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0384916","name":"John Hillerman","idIMDB":"nm0384916"},"actorId":"nm0384916","character":"Hotel Manager","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Morfogen","urlProfile":"http://www.imdb.com/name/nm0604420","urlPhoto":"","biography":{"dateOfBirth":"30 March 1933","placeOfBirth":" New York City, New York, USA","height":"5' 5\" (1.65 m)","bio":"George Morfogen was born on March 30, 1933 in New York City, New York, USA. He is an actor and producer, known for Oz (1997), Twenty Bucks (1993) and What's Up, Doc? (1972).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0604420","name":"George Morfogen","idIMDB":"nm0604420"},"actorId":"nm0604420","character":"Headwaiter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Graham Jarvis","urlProfile":"http://www.imdb.com/name/nm0419054","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5MTI1OTY0M15BMl5BanBnXkFtZTgwMzM0ODA1NTE@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1930","placeOfBirth":" Toronto, Ontario, Canada","bio":"Jarvis attended Williams College before moving to New York to pursue a career in theater. He studied acting at the American Theater Wing and was an original member of the Lincoln Center Repertory Theater.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5MTI1OTY0M15BMl5BanBnXkFtZTgwMzM0ODA1NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0419054","name":"Graham Jarvis","idIMDB":"nm0419054"},"actorId":"nm0419054","character":"Bailiff","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Randy Quaid","urlProfile":"http://www.imdb.com/name/nm0001642","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NDEwMjU3N15BMl5BanBnXkFtZTcwNjk2MTc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1950","placeOfBirth":" Houston, Texas, USA","birthName":"Randy Randall Rudy Quaid","height":"6' 5\" (1.96 m)","bio":"Randy Quaid is an Academy Award-nominated actor, for his performance in The Last Detail (1973). Hal Ashby directed Quaid in the role of Meadows opposite Jack Nicholson and Otis Young. Quaid is a great and much admired actor that has been recognized by Hollywood and the worlds finest directors, Midnight Exspress, The last Picture Show, Ice Harvest (2005), Real Time (2008), King Carlos in Goya's Ghosts (2006) for director Milos Forman. Forman cast Quaid as \"King Carlos IV of Spain\" after seeing his Golden globe nominated performance as The Colonel in Elvis. Quaid also starred in such main stream favorites as Kingpin (1996), Vacation (1983), Christmas Vacation (1989) and Independence day (1996). Quaid earned a Golden Globe for portraying Lyndon Johnson, and received a Golden Globe Nomination for incarnating \"Colonel\" Tom Parker in Elvis (2005). The portrait of Colonel Parker, a former carnival barker with a murky past, is dark. The New York Times said \"Mr. Quaid is riveting as the bully of Graceland\", when he has Elvis firmly under his thumb, he is the L.B.J. of rock 'n' roll - a towering, wheedling, tirelessly self-promoting Southern fox in the rare instances when Elvis defies him, Colonel Parker shrinks into a hand-wringing phony, cajoling his only client in the overly ornate language of Professor Marvel in \"The Wizard of Oz\". Quaid stars in and was nominated for The Screen Actors Guild Award for Outstanding Performance by a cast for his work in Brokeback Mountain(2005), directed by Ang Lee from a script written by Larry McMurtry, who also wrote The Last Picture Show (1971) in which Quaid had his first feature film role. Working with McMurtry and supporting his material has become a Randy Quaid career tradition. Quaid's performance in Brokeback Mountain (2005) was listed as one of the New York Observer's 2005 Noteworthy male performances.In 2009 Randy Quaid Won the Vancouver Critics Award for Best Male performance in the Feature Film Real Time for the Role of Rubin an Australian Hit Man. Randy Quaid was born in Houston, Texas, to Juanita Bonniedale (Jordan), a real estate agent, and William Rudy Quaid, an electrician. He grew up in the Houston suburban city of Bellaire, along with his brother, actor Dennis Quaid. Quaid is married to American Film Director Evi Quaid.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NDEwMjU3N15BMl5BanBnXkFtZTcwNjk2MTc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001642","name":"Randy Quaid","idIMDB":"nm0001642"},"actorId":"nm0001642","character":"Professor Hosquith","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0069495","urlIMDB":"http://www.imdb.com/title/tt0069495","business":{"budget":{"money":"$4,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$66,000,000 (USA)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"SEK","country":"11,598,000","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1971/\">1971</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 34 min (94 min)"],"soundMix":["Mono"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.8","filmingLocations":[{"location":"1000 Bush St. San Francisco, California, USA"}],"rated":"G","awards":[{"award":"Golden Globes, USA 1973","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Most Promising Newcomer - Female","names":[{"name":"Madeline Kahn","id":"nm0001404","role":null}]}]}]},{"award":"Writers Guild of America, USA 1973","titlesAwards":[{"titleAwardOutcome":"Won WGA Award (Screen)","categories":[{"category":"Best Comedy Written Directly for the Screen","names":[{"name":"Buck Henry","id":"nm0377750","role":null},{"name":"David Newman","id":"nm0628058","role":null},{"name":"Robert Benton","id":"nm0000914","role":null}]}]}]}],"votes":"15,007","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0141151","name":"Saticoy Productions"}],"keywords":{"keywords":["hotel","jewel","mix up","love","chase","spy","muzak","gavel","medication","elmer fudd","bugs bunny","chinese dragon","tricycle","taxi","bow tie","name tag","hotel corridor","golf club","fiance fiancee relationship","partial remake","chinatown","cartoon on tv","1970s","hairy chest","bare chested male","black humor","man with glasses","question in title","screwball comedy","obsession","reference to ralph waldo emerson","mistaken identity","false identity","wealth","suitcase","prehistoric times","opposites attract","on the run","love triangle","fiancee","battle of the sexes","seduction","scientist","remake","nerd","singing","piano","ladder","kiss","judge","hall","fire","car in water","car chase","switched luggage","robbery","plate glass","san francisco california","volkswagen","bicycle","rock music"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:41:44"}}