{"data":{"movies":[{"title":"Column South","originalTitle":"","year":"1953","releaseDate":"19531213","directors":[{"name":"Frederick De Cordova","id":"nm0208111"}],"writers":[{"name":"William Sackheim","id":"nm0755266"},{"name":"William Sackheim","id":"nm0755266"}],"runtime":"82 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjJhODUzNTMtYzYzYi00NzA2LTk5NDEtZmE2NDI2NGVlMmFhXkEyXkFqcGdeQXVyMTI2OTM0NzQ@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Western"],"plot":"As Lt. Jed Sayre struggles to prevent pre-Civil War tensions and a racist commanding officer from triggering war between the U.S. Cavalry and Navajo Indians, he finds his efforts are being undermined by the machinations of Confederate sympathizers.","simplePlot":"Before the Civil War, Lt. Jed Sayre's efforts to conciliate the cavalry and the Navajo are undermined by his racist C.O. and Confederate sympathizers.","actors":[{"actorName":"Audie Murphy","urlProfile":"http://www.imdb.com/name/nm0001559","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMzMzNjc5MF5BMl5BanBnXkFtZTcwMzU3MzcxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1924","placeOfBirth":" Kingston, Texas, USA","birthName":"Audie Leon Murphy","height":"5' 8\" (1.73 m)","bio":"Audie Murphy became a national hero during World War II as the most decorated combat soldier of the war. Among his 33 awards was the Medal of Honor, the highest award for bravery that a soldier can receive. In addition, he was also decorated for bravery by the governments of France and Belgium, and was credited with killing over 240 German soldiers and wounding and capturing many more. Audie Leon Murphy was born 20 June 1925 in Kingston, Hunt County, Texas, to Josie Bell (Killian) and Emmett Berry Murphy, poor sharecroppers. After the death of his mother and the outbreak of WWII, Murphy enlisted in the army after being turned down by the Navy and the Marines. Being underage at the time, his older sister and designated legal guardian Corinne provided him a letter of consent. After undergoing basic military training, he was sent first to North Africa. But the Allies drove the German army from Tunisia, their last foothold in North Africa, before Murphys' unit could be sent into battle. His first engagement with Axis forces came when his unit was sent to Europe. First landing on the island of Sicily, next mainland Italy, and finally France, he fought in seven major campaigns over three years and rose from the rank of private to a battlefield commission as a second lieutenant. Part of Murphy's appeal to many people was that he didn't fit the \"image\" most had of a war hero. He was a slight, almost fragile-looking, shy and soft-spoken young man, whose boyish appearance (something he never lost throughout his life; he always looked at least 15 years younger than he actually was) often shocked people when they found out that, for example, during one battle he leaped on top of a burning tank--which was loaded with fuel and ammunition and could have exploded at any second--and used its machine gun to hold off waves of attacking German troops, killing dozens of them and saving his unit from certain destruction and the entire line from being overrun. In September 1945 Murphy was released from active duty, promoted to 1st Lieutenant, and assigned to inactive status. His story caught the interest of superstar James Cagney, who invited Murphy to Hollywood. Cagney Productions paid for acting and dancing lessons but was reluctantly forced to admit that Murphy--at least at that point in his career--didn't have what it took to become a movie star. For the next several years he struggled to make it as an actor, but jobs were few, specifically just two bit parts, in Beyond Glory (1948) and Texas, Brooklyn & Heaven (1948). He finally got a lead role in Bad Boy (1949), and starred in the trouble-plagued production of MGM's The Red Badge of Courage (1951), directed by John Huston. While this film is now considered a minor classic, the politics behind the production sparked an irreparable fissure within the ranks of the studio's upper management. Murphy proved adequate as an actor, but the film, with virtually no female presence (or appeal), bombed badly at the box office. Murphy, however, had already signed with Universal-International Pictures, which was putting him in a string of modestly budgeted Westerns, a genre that suited his easygoing image and Texas drawl. He starred in the film version of his autobiography, To Hell and Back (1955), which was a huge hit, setting a box-office record for Universal that wasn't broken for 20 years until it was finally surpassed by Jaws (1975)). One of his better pictures was Night Passage (1957), a Western in which he played the kid brother of James Stewart. He worked for Huston again on The Unforgiven (1960). Meanwhile, the studio system that Murphy grew into as an actor crumbled. Universal's new owners, MCA, dumped its \"International\" tag in 1962 and turned the studio's focus toward the more lucrative television industry. For theatrical productions, it dropped its roster of contract players and hired actors on a per-picture basis only. That cheap Westerns on the big screen were becoming a thing of the past bode no good for Murphy, either. The Texican (1966), his lone attempt at a new, European form of inexpensive horse opera, to be known as the Spaghetti Western, was unsuccessful. His star was falling fast. In addition to his acting career--he made a total of 44 films--Murphy was also a successful rancher and businessman. He bred and raised thoroughbred horses and owned several ranches in Texas, Arizona and California. He was also a songwriter, and penned hits for such singers as Dean Martin, Eddy Arnold, Charley Pride and many others. His postwar life wasn't all roses, however. He suffered from what is now called Post-Traumatic Stress Disorder (PTSD) but was then called \"combat fatigue\", and was known to have a hair-trigger temper. He woke up screaming at night and slept with a loaded M1911 .45 semi-automatic pistol nearby. He was acquitted of attempted murder charges brought about by injuries he inflicted on a man in a bar fight. Director Don Siegel said in an interview that Murphy often carried a pistol on the set of The Gun Runners (1958) and many of the cast and crew were afraid of him. He had a short-lived and turbulent marriage to actress Wanda Hendrix, and in the 1960s his increasing bouts of insomnia and depression resulted in his becoming addicted to a particularly powerful sleeping pill called Placidyl, an addiction he eventually broke. He ran into a streak of bad financial luck and was forced to declare bankruptcy in 1968. Admirably, he campaigned vigorously for the government to spend more time and money on taking care of returning Vietnam War veterans, as he more than most others knew exactly what kinds of problems they were going to have. On May 18, 1971, Murphy was aboard a private plane on his way to a business meeting when it ran into thick fog near Roanoke, VA, and crashed into the side of a mountain, killing all six aboard. He was buried with full military honors in Arlington National Cemetery. According to cemetery records, the only grave site visited by more people than Murphy's is that of assassinated President John F. Kennedy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMzMzNjc5MF5BMl5BanBnXkFtZTcwMzU3MzcxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001559","name":"Audie Murphy","idIMDB":"nm0001559"},"actorId":"nm0001559","character":"Lt. Jed Sayre","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joan Evans","urlProfile":"http://www.imdb.com/name/nm0262896","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGYyZTFiMGEtMWY4OS00NWIxLWEyYjQtZDcyZDM5OTcwYzA1XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1934","placeOfBirth":" New York City, New York, USA","birthName":"Joan Eunson","bio":"Joan Evans was born on July 18, 1934 in New York City, New York, USA as Joan Eunson. She is an actress, known for No Name on the Bullet (1959), Our Very Own (1950) and Edge of Doom (1950).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOGYyZTFiMGEtMWY4OS00NWIxLWEyYjQtZDcyZDM5OTcwYzA1XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0262896","name":"Joan Evans","idIMDB":"nm0262896"},"actorId":"nm0262896","character":"Marcy Whitlock","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Sterling","urlProfile":"http://www.imdb.com/name/nm0827577","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5Mjk4NzE4MF5BMl5BanBnXkFtZTcwNzk2MjIyOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1917","placeOfBirth":" New Castle, Pennsylvania, USA","birthName":"William Sterling Hart","height":"6' 1\" (1.85 m)","bio":"Born William Sterling Hart in 1917, the Pennsylvania-born actor was the son of a professional ballplayer. He graduated from the University of Pittsburgh, then worked as a clothing salesman before deciding to give acting a try. He certainly had the requisite dreamboat looks as Columbia signed this blue-eyed, black-haired, extraordinary-looking specimen in 1939. Billed as Robert Sterling as not to confuse anyone with the silent screen legend William S. Hart, he was groomed in two-reeled shorts and bit parts in minor features but nothing much happened. In 1941, MGM took him on as a possible replacement for another gorgeous Robert - Robert Taylor - who was about to join the Navy. Sterling married actress Ann Sothern in 1943 after meeting her on the set of Ringside Maisie (1941), one of several programmers in Sothern's \"Maisie\" series. They had a daughter, Patricia, who later became the actress Tisha Sterling. While at MGM he appeared in slick, \"nice guy\" second leads in such \"A\" films as Greta Garbo's swan song Two-Faced Woman (1941), Johnny Eager (1941) and Somewhere I'll Find You (1942), the last two starring Lana Turner, while starring in \"B\" rankers that included The Getaway (1941) and This Time for Keeps (1942). Sterling himself would serve during WWII with the Army Air Force as a pilot instructor and was stationed at one point in London. His movie persona suggested more than a trace of the dapper playboy, and his carefree style and tone easily had Gig Young coming to mind. Robert's film career, however, lost major momentum in post-war years with rather pat, colorless parts in such action dramas as Bunco Squad (1950) and Column South (1953), and even in the splashy musical Show Boat (1951). Divorced from Ms. Sothern in 1949, he was introduced to actress Anne Jeffreys while making his Broadway debut in \"Gramercy Ghost\" down the block from where she was starring in the musical \"Kiss Me Kate.\" The couple wed in 1951 and produced three sons. Robert and Anne (who was also having a down time in films by this point) decided to revive their faltering careers with a singing club act. Not only was their pairing a success, it led directly to their starring roles in the classic Topper (1953) comedy series on TV. As wry, debonair ghost George Kirby, he and Anne (playing his equally \"spirited\" wife Marion) expertly took over the jet-setting roles established on film by Cary Grant and Constance Bennett. The couple soon became household names engaging audiences week after week with their delightfully capricious antics and disappearing acts, much to the chagrin of bemused mortal Leo G. Carroll in the title role. Robert and Anne continued to perform together on stage (\"Bells Are Ringing\") and even top-lined another sitcom Love That Jill (1958) which lasted only a few months. After another failed series Ichabod and Me (1961), which was a solo effort, and a couple of pedestrian parts in the movies Return to Peyton Place (1961) (as Dr. Michael Rossi) (1961), Voyage to the Bottom of the Sea (1961) and A Global Affair (1964), Robert slacked off considerably. He made only one return to Broadway with the 1961 light comedy \"Roman Candle\" co-starring Inger Stevens and Julia Meade. The show folded quickly. By the late 1960s, Sterling was pretty much out of the picture. He entered into what would become a lucrative computer business, and kept a decidedly low profile, prompting many fans to think that the ever-busy Anne Jeffreys was a widow! In truth, the couple made sporadic appearances together in the 70s and 80s in episodes of \"Murder, She Wrote\" and \"Hotel,\" among others. During the last decade of his life, Sterling suffered greatly from shingles, which kept him confined to a bed for the most part. The man who was once deemed \"the ghost with the most\" died in his Brentwood home of natural causes at the age of 88.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5Mjk4NzE4MF5BMl5BanBnXkFtZTcwNzk2MjIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0827577","name":"Robert Sterling","idIMDB":"nm0827577"},"actorId":"nm0827577","character":"Capt. Lee Whitlock","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ray Collins","urlProfile":"http://www.imdb.com/name/nm0172615","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNTU4NzUxMV5BMl5BanBnXkFtZTcwMDQyMzYwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1889","placeOfBirth":" Sacramento, California, USA","height":"5' 8½\" (1.74 m)","bio":"Ray Bidwell Collins was an American actor in film, stage, radio and television. One of his best remembered roles was that of Lt. Arthur Tragg in the long-running series Perry Mason (1957). Collins was born in Sacramento, California, to Lillie Bidwell and William C. Collins, a newspaper drama editor. He started acting on stage at the age of 14. In the mid 1930s, now an established stage and radio actor, Collins began working with Orson Welles' Mercury Theatre (Welles himself called Collins \"the finest actor I've ever worked with\"), leading to some of his most memorable roles. Having already appeared on radio with Welles in \"The Shadow\" (a regular as Commissioner Weston) and in Welles' serial adaptation of \"Les Miserables\" from 1937, Collins became a regular on \"The Mercury Theatre on the Air\" program; through the run of the series, he played many roles in literary adaptations, from Squire Livesey from \"Treasure Island\" and Dr. Watson in \"Sherlock Holmes\" to Mr. Pickwick in an adaptation of \"The Pickwick Papers\". Collins' best known (albeit uncredited) work on this series, however, was in the infamous \"The War of the Worlds\" broadcast, playing three roles, including Mr. Wilmuth (on whose farm the Martian craft lands) and the newscaster who describes the destruction of New York. Along with other Mercury Theatre players, Collins made his first notable screen appearance in Citizen Kane (1941), as ruthless Boss Jim Gettys. He would also play key roles in Welles' The Magnificent Ambersons (1942) and Touch of Evil (1958). Collins appeared in over 90 films in all, including Leave Her to Heaven (1945), The Best Years of Our Lives (1946) and Crack-Up (1946), A Double Life (1947), two entries in the \"Ma and Pa Kettle\" series (as in-law Benjamin Parker), and The Desert Song (1953), in which he played the non-singing role of Kathryn Grayson's father. He displayed comic ability in The Bachelor and the Bobby-Soxer (1947) and The Man from Colorado (1948). He may be best remembered for his work on television. He was also a regular as John Merriweather on the television version of The Halls of Ivy (1954) starring Ronald Colman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNTU4NzUxMV5BMl5BanBnXkFtZTcwMDQyMzYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0172615","name":"Ray Collins","idIMDB":"nm0172615"},"actorId":"nm0172615","character":"Brig. Gen. Storey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dennis Weaver","urlProfile":"http://www.imdb.com/name/nm0915840","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5ODM4NDEwNV5BMl5BanBnXkFtZTcwNzU2NTIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1924","placeOfBirth":" Joplin, Missouri, USA","birthName":"William Dennis Weaver","height":"6' 2\" (1.88 m)","bio":"He also did the series McCloud in the 70's playing as a New Mexico police officer who moved to New York city and joined the police force as a detective.He played as Sam McCloud. A detective in Taos, New Mexico.The series ended in 1977. Much unlike the character Chester that he played in Gunsmoke.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5ODM4NDEwNV5BMl5BanBnXkFtZTcwNzU2NTIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0915840","name":"Dennis Weaver","idIMDB":"nm0915840"},"actorId":"nm0915840","character":"Menguito","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gregg Palmer","urlProfile":"http://www.imdb.com/name/nm0658250","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM0MzQ3YzYtMDM2YS00NDQzLWIxOTYtZThkZDY0OGEyNzg3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 January 1927","placeOfBirth":" San Francisco, California, USA","birthName":"Palmer Lee","height":"6' 2\" (1.88 m)","bio":"Norwegian by heritage and a San Franciscan by birth, brown-haired, brown-eyed Gregg Palmer (born Palmer Lee) broke into show biz as a radio announcer. After an early '50s stint as a contract player at Universal, he turned to freelancing, closing out the decade by starring and co-starring in a number of detective, Western and sci-fi adventures. In the '60s, Palmer drifted into supporting roles and much TV work, and reinforced his growing rep with Western fans by becoming a regular member of John Wayne's latter-day stock company.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM0MzQ3YzYtMDM2YS00NDQzLWIxOTYtZThkZDY0OGEyNzg3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0658250","name":"Gregg Palmer","nicknames":["Grizzly"],"idIMDB":"nm0658250"},"actorId":"nm0658250","character":"Chalmers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Russell Johnson","urlProfile":"http://www.imdb.com/name/nm0426157","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNDM1OTQ4MV5BMl5BanBnXkFtZTYwMTUxODg0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1924","placeOfBirth":" Ashley, Pennsylvania, USA","birthName":"Russell David Johnson","height":"5' 10\" (1.78 m)","bio":"Long before he was known as \"The Professor\" in the cult comedy classic Gilligan's Island (1964), Russell Johnson was a well-known character actor, starring in several Westerns and Sci-Fi classics as This Island Earth (1955) and It Came from Outer Space (1953). Johnson grew up in Pennsylvania and was sent to a boarding school in Philadelphia with his brothers when his father died. Unlike his Professor character, Johnson said he was not a bright student and was in fact held back a grade. Johnson did redeem himself later on in his school career and made the National Honor Society in high school. He joined the Army Air Corps in World War II, and earned the Purple Heart when his B-24 Liberator was shot down in the Philippines during a bombing run in March, 1945. After the war, he used the G.I. Bill to enroll in acting school to ply his new trade. Johnson lived in the state of Washington, and has done several guest shots on television shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNDM1OTQ4MV5BMl5BanBnXkFtZTYwMTUxODg0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0426157","name":"Russell Johnson","nicknames":["The Professor"],"idIMDB":"nm0426157"},"actorId":"nm0426157","character":"Cpl. Biddle","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Kelly","urlProfile":"http://www.imdb.com/name/nm0446438","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MTQ4NTAzOV5BMl5BanBnXkFtZTcwODkwNTgxOA@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1927","placeOfBirth":" Astoria, New York, USA","birthName":"John A. Kelly Jr.","height":"6' 1\" (1.85 m)","bio":"Jack Kelly started acting at age two, modeling in soap ads and garnering a lifetime supply of soap for his pay. Jack continued to model until the age of nine when he appeared in his first play with Hope Emerson called \"Swing Your Lady\". Broadway shows and radio followed until his family moved to California in 1938. He attended St. John's Military Academy and spent two years as a law student at the University of California in Los Angeles. For three years Jack dropped acting to concentrate on school and making money. He worked as a shoe salesman, gas station attendant, lifeguard, grocery delivery boy, and mens clothing salesman. In 1945, Jack was inducted into the army taking basic train at Camp Roberts in California. He was sent to Alaska as a weather observer and was on the first B-29 to fly over the Arctic circle. After his discharge in 1946, Jack returned to UCLA and worked nights on various radio programs including, \"Lux Radio theater\", \"Suspense\", \"Tell It Again\", and \"Romance of the Ranchos\". Upon leaving school he joined the circle Theater in Los Angeles appearing in \"Time of Your Life\", \"The Adding Machine\", and \"Love On The Dole\". In 1949 he acted in \"Anna Lucasta\" at the coronet Theater. This performance brought Jack to the attention of several Hollywood directors. He then made his film debut in \"Fighting Man Of The Plains\" starring Randolph Scott. In 1955, Jack was signed by Warner Bros. to star as Dr. Parris Mitchell in the \"King's Row\" series of \"Warner Bros. Presents.\" The show debuted in September, 1955. He had served an acting apprenticeship that included movies, television, radio, and stage. His hobbies include ship models, reading historical literature, sculpturing, and listening to show tunes records. He also enjoyed such sports as sailing, badminton, skin diving, golf, horseback riding and flying.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MTQ4NTAzOV5BMl5BanBnXkFtZTcwODkwNTgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0446438","name":"Jack Kelly","idIMDB":"nm0446438"},"actorId":"nm0446438","character":"Trooper Vaness","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Johnny Downs","urlProfile":"http://www.imdb.com/name/nm0235897","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGE1NmNlOTItZDJmMS00MjhiLWJiMzItNzZmOWU4ZWVlMGRjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1913","placeOfBirth":" Brooklyn, New York, USA","birthName":"John Morey Downs","bio":"Johnny Downs was born on October 10, 1913 in Brooklyn, New York, USA as John Morey Downs. He was an actor, known for The Mad Monster (1942), All-American Co-Ed (1941) and Algiers (1938). He was married to June. He died on June 6, 1994 in Coronado, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGE1NmNlOTItZDJmMS00MjhiLWJiMzItNzZmOWU4ZWVlMGRjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0235897","name":"Johnny Downs","idIMDB":"nm0235897"},"actorId":"nm0235897","character":"Lt. Posick","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bob Steele","urlProfile":"http://www.imdb.com/name/nm0824496","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMzA4NTMzNV5BMl5BanBnXkFtZTcwNDc3NzkxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1907","placeOfBirth":" Portland, Oregon, USA","birthName":"Robert Adrian Bradbury","height":"5' 5\" (1.65 m)","bio":"Started working with his father on stage when he was two. Later he toured in a comedy act for Fanchon and Marco. His first screen experience was at age 14, in a Pathe production of \"Adventures of Bill and Bob\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMzA4NTMzNV5BMl5BanBnXkFtZTcwNDc3NzkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0824496","name":"Bob Steele","idIMDB":"nm0824496"},"actorId":"nm0824496","character":"Sgt. McAfee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Best","urlProfile":"http://www.imdb.com/name/nm0078940","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0OTc1MzYzOF5BMl5BanBnXkFtZTcwNjY1MjEzMQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1926","placeOfBirth":" Powderly, Kentucky, USA","birthName":"Jewel Franklin Guy","height":"6' 1\" (1.85 m)","bio":"American character actor and teacher. Born Jewel Guy in Powderly, Kentucky, on July 26, 1926, he was orphaned at three and adopted by Armen and Essa Best, who re-named him James K. Best and raised him in Corydon, Indiana. Following high school he worked briefly as a metalworker before joining the Army during World War II in July 1944. The majority of his service was as an MP in Wiesbaden, Germany just after the end of the war. While still in Germany, Best was transferred to Special Services and began his acting career. According to Best, he first acted in a European tour of \"My Sister Eileen\" directed by Arthur Penn. Upon his return to the U.S., he toured in road and stock companies in plays and musicals, and was finally spotted by a scout from Universal Pictures, who put him under contract. A handsome young man, his rural inflections perhaps kept him from frequent leading man roles. During the 1950s and '60s, he was a familiar face in movies and television in a wide range of roles, from Western bad guys to craven cowards and country bumpkins. Physical ailments curtailed his work for a long period late in his career, and he established a well-respected acting workshop in Los Angeles. He also served as artist-in-residence at the University of Mississippi, teaching and directing. He worked in both acting and producing capacities for Burt Reynolds on several of the latter's films in the late 1970s, before taking on his greatest commercial success. Although the The Dukes of Hazzard (1979) TV series was far beneath his talents, his role as Sheriff Roscoe Coltrane was the part that gave him his greatest fame. He continued teaching, both in Hollywood and later in Florida (at the University of Central Florida). Semi-retired, he makes personal appearances and exhibits his paintings. James Best starred in the 2007 feature film, Moondance Alexander (2007), along with Don Johnson, Lori Loughlin, Kay Panabaker, Sasha Cohen and Whitney Sloan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0OTc1MzYzOF5BMl5BanBnXkFtZTcwNjY1MjEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0078940","name":"James Best","nicknames":["Jimmy"],"idIMDB":"nm0078940"},"actorId":"nm0078940","character":"Primrose","urlCharacter":"http://www.imdb.com/character/ch0483150","main":true},{"actorName":"Ralph Moody","urlProfile":"http://www.imdb.com/name/nm0600525","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NzI1ODcxN15BMl5BanBnXkFtZTgwMDYzNDY2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1886","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Ralph Roy Moody","bio":"Ralph Moody was born on November 5, 1886 in St. Louis, Missouri, USA as Ralph Roy Moody, the oldest son of Franklin Jerome Moody and Ida M. Hicklin. His introduction to show business was first as an actor on the stage in pre-radio days and then as a radio personality. His first acting role was in 1900 as the boy, Heinrich, in Rip Van Winkle. At the 1904 World's Fair he sang tenor in St. Louis, Missouri, USA. He had a wide following as Uncle Abner on WIBW, CBS Radio, in the 1930's in Topeka, Kansas, USA. As Uncle Abner he was the town's barber, constable, postmaster, and chief source of information. Beginning in the mid-1940's he was a frequent radio cast member on The Roy Rogers Show. When Gunsmoke began its radio show run in 1952, Ralph Moody was one of the regular cast members. He began making film and television appearances at the age of 62. His first television roles were on three 1949-50 Lone Ranger episodes, each time as an Indian chief with a different name. Frequently on TV westerns he had roles as an Indian, but was not type cast. His range of characters included a variety of roles with Jack Webb on Dragnet. Many of his dozen appearances on The Rifleman were as Doc Burrage. He had six appearances on Bonanza, most as an Indian, at the end of his 23 year acting career. He was married to Hazel B. McOwen. He died on September 16, 1971 in Burbank, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NzI1ODcxN15BMl5BanBnXkFtZTgwMDYzNDY2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0600525","name":"Ralph Moody","idIMDB":"nm0600525"},"actorId":"nm0600525","character":"Joe Copper Face","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rico Alaniz","urlProfile":"http://www.imdb.com/name/nm0015976","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkwMWNhZDEtOGY4Yy00MWI0LTg0YWYtZDI4NTA2OWFmNzk2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 October 1919","placeOfBirth":" Juarez, Mexico","birthName":"Americo Zorilla Alaniz","bio":"Rico Alaniz was born on October 25, 1919 in Juarez, Mexico as Americo Zorilla Alaniz. He was an actor, known for The Magnificent Seven (1960), Final Analysis (1992) and The Life and Legend of Wyatt Earp (1955). He died on March 9, 2015 in California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkwMWNhZDEtOGY4Yy00MWI0LTg0YWYtZDI4NTA2OWFmNzk2XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0015976","name":"Rico Alaniz","idIMDB":"nm0015976"},"actorId":"nm0015976","character":"Trooper Chavez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Boyd Stockman","urlProfile":"http://www.imdb.com/name/nm0830882","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDg5N2YyNzUtMjAxYy00OTZiLWFkNTMtODQ4NDBjNGNjODhhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1916","placeOfBirth":" Grants, New Mexico, USA","bio":"Boyd Stockman was born on February 12, 1916 in Grants, New Mexico, USA. He is known for his work on The Man from Laramie (1955), Night Passage (1957) and They Ran for Their Lives (1968). He died on March 10, 1998 in Silver City, New Mexico.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDg5N2YyNzUtMjAxYy00OTZiLWFkNTMtODQ4NDBjNGNjODhhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0830882","name":"Boyd Stockman","idIMDB":"nm0830882"},"actorId":"nm0830882","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0045637","urlIMDB":"http://www.imdb.com/title/tt0045637","business":{"budget":null,"openingWeekend":null,"gross":[{"money":"$1,100,000 (USA)","country":"","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 22 min (82 min)"],"soundMix":["Mono (Western Electric Recording)"],"color":["Color (Technicolor)"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":["Technicolor (color by)"],"filmLength":["2,311 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.3","filmingLocations":[{"location":"Victorville, California, USA"}],"rated":"APPROVED","awards":[],"votes":"275","type":"Movie","companyCreditsSimple":[{"idCompany":"co0021358","name":"Universal International Pictures (UI)"}],"keywords":{"keywords":["navajo indian","u.s. cavalry","epic battle","explosion","cavalry charge","bow and arrow","revolver","pistol","carbine","sword fight","tomahawk","battle","indian war","cavalry saber","hostage","new mexico","southern accent","waterfall","false accusation","rattlesnake","sealed orders","pre american civil war","traitor","indian attack","powder keg","fort","1860s","u.s. army","cavalry officer","brother sister relationship","sergeant","lieutenant","general","brigadier general","racism","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:33:09"}}