{"data":{"movies":[{"title":"The Maverick Queen","originalTitle":"","year":"1956","releaseDate":"19560503","directors":[{"name":"Joseph Kane","id":"nm0437356"}],"writers":[{"name":"Kenneth Gamet","id":"nm0303930"},{"name":"DeVallon Scott","id":"nm0779059"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDRmNmZiOTMtZDcyMi00ZDEzLWIyOTUtNWJhYjE3YzRiMjlhXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Western"],"plot":"Kit Banion, a Virginia-born beauty and product of post-Civil War chaos, has settled in Wyoming and prospered; acquiring a fortune and a hotel, which, like the owner bears the name of \"The Maverick Queen.\"---a title picked up by Kit in her earlier days in Wyoming when she took every unbranded steer and put her own brand on it. Love and trouble enter her life in the person of a Pinkerton detective posing as Jeff Younger, nephew of the infamous Younger brothers. He is dedicated to catching Butch Cassidy and the members of The Wild Bunch.","simplePlot":"A Pinkerton detective goes undercover to infiltrate a gang of thieves whose boss is a feisty lady saloonkeeper. Complications ensue.","actors":[{"actorName":"Barbara Stanwyck","urlProfile":"http://www.imdb.com/name/nm0001766","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjMxODIzODEzNF5BMl5BanBnXkFtZTYwNDgwNjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1907","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Ruby Catherine Stevens","height":"5' 5\" (1.65 m)","bio":"Today Barbara Stanwyck is remembered primarily as the matriarch of the family known as the Barkleys on the TV western The Big Valley (1965), wherein she played Victoria, and from the hit drama The Colbys (1985). But she was known to millions of other fans for her movie career, which spanned the period from 1927 until 1964, after which she appeared on television until 1986. It was a career that lasted for 59 years. Barbara Stanwyck was born Ruby Catherine Stevens on July 16, 1907, in Brooklyn, New York, to working class parents Catherine Ann (McPhee) and Byron E. Stevens. Her father, from Massachusetts, had English ancestry, and her Canadian mother, from Nova Scotia, was of Scottish and Irish descent. Stanwyck went to work at the local telephone company for fourteen dollars a week, but she had the urge (a dream--that was all it was) somehow to enter show business. When not working, she pounded the pavement in search of dancing jobs. The persistence paid off. Barbara was hired as a chorus girl for the princely sum of $40 a week, much better than the wages she was getting from the phone company. She was seventeen, and was going to make the most of the opportunity that had been given her. In 1928 Barbara moved to Hollywood, where she was to start one of the most lucrative careers filmdom had ever seen. She was an extremely versatile actress who could adapt to any role. Barbara was equally at home in all genres, from melodramas, such as Forbidden (1932) and Stella Dallas (1937), to thrillers, such as Double Indemnity (1944), one of her best films, also starring Fred MacMurray (as you have never seen him before). She also excelled in comedies such as Remember the Night (1940) and The Lady Eve (1941). Another genre she excelled in was westerns, Union Pacific (1939) being one of her first and TV's The Big Valley (1965) (her most memorable role) being her last. In 1983, she played in the ABC hit mini-series The Thorn Birds (1983), which did much to keep her in the eye of the public. She turned in an outstanding performance as Mary Carson. Barbara was considered a gem to work with for her serious but easygoing attitude on the set. She worked hard at being an actress, and she never allowed her star quality to go to her head. She was nominated for four Academy Awards, though she never won. She turned in magnificent performances for all the roles she was nominated for, but the \"powers that be\" always awarded the Oscar to someone else. However, in 1982 she was awarded an honorary Academy Award for \"superlative creativity and unique contribution to the art of screen acting.\" Sadly, Barbara died on January 20, 1990, leaving 93 movies and a host of TV appearances as her legacy to us.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjMxODIzODEzNF5BMl5BanBnXkFtZTYwNDgwNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001766","name":"Barbara Stanwyck","nicknames":["Missy","The Queen","Babs"],"idIMDB":"nm0001766"},"actorId":"nm0001766","character":"Kit Banion","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barry Sullivan","urlProfile":"http://www.imdb.com/name/nm0837959","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNTAxNzkxMV5BMl5BanBnXkFtZTgwNjI0NzE0MDE@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1912","placeOfBirth":" New York City, New York, USA","birthName":"Patrick Barry Sullivan","height":"6' 2\" (1.88 m)","bio":"Barry Sullivan was born Patrick Barry Sullivan on August 29, 1912 in New York City. He was the seventh son of a seventh son, a birth order with mystical significance in Celtic families. While never a major movie star, he established himself as a well-known and highly regarded character lead and second lead in motion pictures and television in a career that lasted 50 years. Sullivan was one of those elite of actors who are always in demand until the day they decide to retire. Legend has it that Sullivan was counseled to consider a life in the theater due to his height (6'3\") and good looks. He was supporting himself as a theater usher and department store employee when made his Broadway debut in \"I Want a Policeman\" at the Lyceum Theatre in January of 1936. Unfortunately, the show lasted only 47 performances. He had that certain something that makes casting directors take notice. In 1936, he appeared in three other plays on the Great White Way, the drama \"St. Helena\" and the comedies \"All That Glitters\" and \"Eye On the Sparrow.\" All three were flops. Sullivan finally appeared in a hit play when he transferred into the role of Bert Jefferson in The Man Who Came to Dinner (1942) by Moss Hart and George S. Kaufman. However the 1941-42 season brought three more flops: \"Mr. Big,\" \"Ring Around Elizabeth,\" and \"Johnny 2 X 4.\" Wisely, he stayed away from Broadway for a decade, when he again transferred into a hit, \"The Caine Mutiny Court-Martial,\" taking over the role of Barney Greenwald from Henry Fonda. Sullivan was nominated for a Best Actor Emmy Award in 1955 when he reprised the role on Ford Star Jubilee: The Caine Mutiny Court-Martial (1955). His last appearance on Broadway, in the original \"Too Late the Phalarope\" in 1956, was, true to his performance record, a flop. Barry Sullivan's talent was meant for the screen. In the late 1930s, he gained movie acting experience in two-reel comedies produced by the Manhattan-based Educational Studios. After giving up on his Broadway career and moving to Hollywood, Sullivan appeared in an uncredited bit part in \"The Green Hornet Strikes Again! (1940) (1941) at Universal before making his official film debut in the Chester Morris B-picture High Explosive (1943) (1943) at Paramount. His next picture was the western The Woman of the Town (1943), which was released by United Artists that same year. Barry Sullivan never broke through to become a major star -- some cineastes say he was too raffish to connect with a mass audience -- but he established himself firmly as a character lead and second lead. He excelled at roles in which he could play aggressive characters that highlighted his centered masculinity. His most notable roles in the early part of his movie career were as the eponymous The Gangster (1947) (one of his leads), Tom Buchanan in the Alan Ladd version of The Great Gatsby (1949) (second lead), and as the movie director in The Bad and the Beautiful (1952) as part of a first rate ensemble. He had his own TV series Harbormaster (1957) in 1957-58 and The Tall Man (1960) in 1960-62. A decade later, his acting skills were used to fine effect in two prestigious productions of stage plays (when television still provided such entertainment), as George C. Scott's brother in the Emmy Award-winning TV adaptation of Arthur Miller's The Price (1971) and the amoral patriarch in Lillian Hellman's Another Part of the Forest (1972). He continued acting in movies until 1977, rounding off a near 40-year movie career with an appearance in Oh, God! (1977). He continued to appear periodically on television until retiring in 1980. Barry Sullvian was married three times and fathered three children, Johnny and Jenny Sullivan by his first wife, and Patsy Sullivan-Webb by his second wife Gita Hall. The Sullivan talent has run into three generations. Jenny Sullivan became an actress and a playwright, writing the drama \"J for J\" (\"Journal for John\") based on the correspondence between her father and her brother, who was mentally disabled. She was married to the rock star Jim Messina. Patsy Sullivan-Webb was a successful model who appeared as the face of Yardley Cosmetics in the Swinging '60s, starting at the age of twelve. She appeared with her father in the episode of That Girl (1966) that opened the series' third season and was a contestant on The Dating Game (1965). She married the great songwriter Jimmy Webb, by whom she had six children. Two of her sons formed the rock group The Webb Brothers. Barry Sullivan died of a respiratory ailment on June 6, 1994 in Sherman Oaks, California. He was 81 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNTAxNzkxMV5BMl5BanBnXkFtZTgwNjI0NzE0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0837959","name":"Barry Sullivan","idIMDB":"nm0837959"},"actorId":"nm0837959","character":"Jeff Younger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott Brady","urlProfile":"http://www.imdb.com/name/nm0103722","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNDkxNjk2M15BMl5BanBnXkFtZTcwODUwOTU5Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 September 1924","placeOfBirth":" Brooklyn, New York, USA","birthName":"Gerard Kenneth Tierney","height":"6' 2\" (1.88 m)","bio":"He had the manly good looks and rugged appeal to make it to top stardom in Hollywood and succeeded quite well as a sturdy leading man of standard action on film and TV. Born in Brooklyn on September 13, 1924, Irish-American Scott Brady was christened Gerard Kenneth Tierney (called Jerry) by parents Lawrence and Maria Tierney. His father, chief of New York's aqueduct police force, had always had show business intentions and later did print work after retiring from the force. Both Scott's older and younger brothers, Lawrence Tierney and Edward Tierney went on to become actors as well. Lawrence's promising film noir \"bad guy\" career was sabotaged by a severe drinking disorder that led to numerous skirmishes with the law. Scott himself faced a narcotics charge in 1957 (charges were dropped, Scott maintained that he was framed) and later (1963) was involved in illegal bookmaking activities. Fortunately, Scott was more cool-headed and wound up avoiding the pitfalls that befell his older brother, making a very lucrative living for himself in Hollywood throughout the 1950s and early 1960s. Scott grew up in Westchester County and attended Roosevelt and St. Michael's High Schools. Like his older brother Lawrence, Scott he was an all-round athlete in school and earned letters for basketball, football and track and expressed early designs on becoming a football coach or radio announcer. Instead he enlisted before graduating from high school and served as a naval aviation mechanic overseas. During his term of duty he earned a light heavyweight boxing medal. He was discharged in 1946 and decided to head for Los Angeles where his older brother Lawrence was making encouraging strides as an actor. Toiling in menial jobs as a cabbie and day-time laborer, the handsome, blue-eyed looker was noticed having lunch in a café by producer Hal B. Wallis and offered a screen test. The test did not fare well but, not giving up, he enrolled in the Bliss-Hayden drama school under his G.I. Bill, studied acting, and managed to rid himself of his thick Brooklyn accent. He signed with a minor league studio, Eagle-Lion, and made his debut of sorts in the poverty-row programmer In This Corner (1948) utilizing his boxing skills from his early days in the service. He showed more promise with his second and third films Canon City (1948) and He Walked by Night (1948), the latter as a detective who aids in nabbing psychotic killer Richard Basehart. Scott switched over to higher-grade action stories for Fox and Universal over time. Westerns and crime stories would be his bread-winning genres with The Gal Who Took the West (1949) opposite Yvonne De Carlo and John Russell and Undertow (1949), with Russell again, being prime examples. He frequently switched from hero to heavy during his peak years. In one film he would romance a Jeanne Crain in The Model and the Marriage Broker (1951) or a Mitzi Gaynor in Bloodhounds of Broadway (1952), while in the next beat Shelley Winters to a pulp in Untamed Frontier (1952). A favorite pin-up hunk in his early years, he hit minor cult status as a bad hombre, The Dancin' Kid, in the offbeat western Johnny Guitar (1954). He and the other manly men, however, were somewhat overshadowed in the movie by the Freudian-tinged gunplay between Joan Crawford and Mercedes McCambridge. Other roles had him sturdily handling the action scenes while giving the glance over to such diverting female costars as Barbara Stanwyck, Mala Powers and Anne Bancroft. Scott would mark the same territory in TV -- westerns and crimers -- finding steadier work on the smaller screen into the 1960s. He starred as the title hero in the western series Shotgun Slade (1959). Stage too was a sporadic source of income with such productions as \"The Moon Is Blue\", \"Detective Story\" and \"Picnic\" under his belt before making his Broadway bow as a slick card sharpie opposite Andy Griffith in the short-lived musical \"Destry Rides Again\" in 1959. He later did the national company of the heavyweight political drama \"The Best Man\" with his portrayal of a senator. The seemingly one-time confirmed bachelor decided to settle down after meeting and marrying Mary Tirony in 1967 at age 43. Prior to this he had been linked with such luminous beauties as Gwen Verdon and Dorothy Malone. The couple had two sons. Parts dwindled down in size in later years and he gained considerable weight as he grew older and balder, but he still appeared here-and-there as an occasional character heavy or hard-ass cop in less-important movies such as Doctors' Wives (1971), $ (1971), The Loners (1972) and Wicked, Wicked (1973). Minor TV roles in mini-movies also came his way at a fair pace. Towards the end he was seen in such high-profile big-screen movies as The China Syndrome (1979) and Gremlins (1984). Scott had a collapse in 1981 and was diagnosed with pulmonary fibrosis, a progressive respiratory disease. He later relied on an oxygen tank. He died of the disease four years later and was interred at the Holy Cross Cemetery in Culver City, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNDkxNjk2M15BMl5BanBnXkFtZTcwODUwOTU5Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0103722","name":"Scott Brady","idIMDB":"nm0103722"},"actorId":"nm0103722","character":"Sundance","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mary Murphy","urlProfile":"http://www.imdb.com/name/nm0614500","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmM5NTk2MzQtYzhiZi00NjgwLTlhMDYtNzNlMzViMWVjNzY0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 January 1931","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Mary Louise Murphy","height":"5' 4\" (1.63 m)","bio":"This actress' two-decade career produced only one single stand-out film role but that one role as the \"good girl\" who redeems \"bad boy\" Marlon Brando's tough biker in the cult flick The Wild One (1953) put Mary Murphy at the head of the acting class for one brief shining moment. In others, she proved a lovely distraction amid the male action surrounding her and also, given the right material, displayed obvious talent in both Grade \"A\" and \"B\" drama as the feminine co-star or second lead. The beautiful blue-eyed brunet stunner was born on January 26, 1931, in Washington D.C. but quickly moved with her family six months later to Cleveland, Ohio. Her father, James, a businessman, died there in 1940, and her mother eventually moved Mary and her two brothers and sister (she was the youngest of the four) West to Southern California where Mary went on to attend University High School in the Los Angeles area, graduating in 1949. A one-time employee of Saks Fifth Avenue in Beverly Hills, the fresh-faced beauty was \"discovered\" at a café and signed by Paramount Studios. Following insignificant bit/extra work in such movies as the Bob Hope's vehicles The Lemon Drop Kid (1951) and My Favorite Spy (1951), the sci-fi feature When Worlds Collide (1951), and \"Best Picture\" The Greatest Show on Earth (1952), Mary won the female lead opposite relative newcomer Tommy Morton in the show business drama Main Street to Broadway (1953). The film was ill-received and both stars were rather dwarfed by the huge names that surrounded them -- Tallulah Bankhead, Lionel Barrymore, Ethel Barrymore, Shirley Booth, Mary Martin and even Rodgers and Hammerstein. Her second lead in a film was a different story. the legendary The Wild One (1953) opposite Marlon Brando. Mary managed to hold her own in this biker classic but it did not, however, necessarily lead to better films. She continued in the demure ingénue mode in the Vincent Price sub-horror The Mad Magician (1954) and the routine western Sitting Bull (1954) which starred future husband Dale Robertson. The Juen 1956 marriage to Robertson was very short-lived; it was annulled by Christmas time. Mary went on, however, to give earnest leading lady perfs opposite Tony Curtis in Beachhead (1954), Ray Milland's debut as a director, A Man Alone (1955) and Hell's Island (1955) with John Payne. She also appeared to good advantage in The Desperate Hours (1955) but was slightly overshadowed by powerhouse star cast of Humphrey Bogart, Fredric March, Arthur Kennedy, Gig Young and Martha Scott. From then on it was fairly dismal for Mary in such lesser features as The Maverick Queen (1956), The Electronic Monster (1958) and Live Fast, Die Young (1958), a lowbudget \"Wild Ones\" delinquent crimer as a girl who tries to save her sister from a life of crime. Mary left the screen for a time but resumed her career in the 60s and early 70s primarily on TV with a number of episodics and mini-movies playing matronly wives and mothers and had a small but noticeable role in the film Junior Bonner (1972). Remarried in 1962, Mary retired completely by the late 70s and turned to environmental causes. She also worked in a Los Angeles art gallery for a time and has been seen on occasion in nostalgia conventions.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNmM5NTk2MzQtYzhiZi00NjgwLTlhMDYtNzNlMzViMWVjNzY0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0614500","name":"Mary Murphy","idIMDB":"nm0614500"},"actorId":"nm0614500","character":"Lucy Lee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wallace Ford","urlProfile":"http://www.imdb.com/name/nm0285922","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDZjZTM3YzYtMzkwNS00NGZkLTg5OTctYzAyYWFmMmEzMWI2L2ltYWdlXkEyXkFqcGdeQXVyMjU5OTg5NDc@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1898","placeOfBirth":" Bolton, Lancashire, England, UK","birthName":"Samuel Jones Grundy","height":"5' 8\" (1.73 m)","bio":"A stocky, friendly-faced character actor, Ford was born Samuel Jones in England and his childhood rivaled the brutality that Charles Dickens ever dreamed up. He lived for a while in an orphanage after being separated from his parents. While still young, he was sent to a Toronto branch of the orphanage. There, he began a cycle that involved living in 17 foster homes - the longest being with a farm family that treated him like a slave. At age 11 he ran away and joined a vaudeville troupe called the Winnepeg Kiddies, with whom he stayed until 1914. He then joined a friend named Wallace Ford and the two 'hoboed\" their way into the United States. After the friend was crushed to death by a railroad car, he took the name Wallace Ford in his memory and found work in theatrical troupes and repertory companies. On Broadway he acted in \"Abraham Lincoln\", \"Abie's Irish Rose\", and \"Bad Girl\". He left Broadway in 1932 to appear with Joan Crawford in Possessed (1931); he also landed the lead in MGM's notorious Freaks (1932), although his fellow actors proved more memorable. He also co-starred as Walter Huston's amoral brother in one of the studio's few full-blown gangster melodramas, The Beast of the City (1932), starring Jean Harlow in arguably her most hard-bitten role. In all he appeared in over 200 films including five directed by John Ford (The Last Hurrah (1958), The Whole Town's Talking (1935), They Were Expendable (1945), The Lost Patrol (1934) and The Informer (1935)). He also appeared with Henry Fonda in the TV series, \"The Deputy\" that ran from 1959-60. Ford died of a heart attack soon after his last memorable role as \"Old Pa\" in the hit Sidney Poitier drama, A Patch of Blue (1965).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDZjZTM3YzYtMzkwNS00NGZkLTg5OTctYzAyYWFmMmEzMWI2L2ltYWdlXkEyXkFqcGdeQXVyMjU5OTg5NDc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0285922","name":"Wallace Ford","idIMDB":"nm0285922"},"actorId":"nm0285922","character":"Jamie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Howard Petrie","urlProfile":"http://www.imdb.com/name/nm0677962","urlPhoto":"","biography":{"dateOfBirth":"22 November 1906","placeOfBirth":" Beverly, Massachusetts, USA","birthName":"Howard Alexander Petrie","height":"6' 3\" (1.91 m)","bio":"Howard Petrie was born on November 22, 1906 in Beverly, Massachusetts, USA as Howard Alexander Petrie. He was an actor, known for Seven Brides for Seven Brothers (1954), Bend of the River (1952) and Rage at Dawn (1955). He was married to Alice Wood Petrie. He died on March 24, 1968 in Keene, New Hampshire, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0677962","name":"Howard Petrie","idIMDB":"nm0677962"},"actorId":"nm0677962","character":"Butch Cassidy","urlCharacter":"http://www.imdb.com/character/ch0008493","main":true},{"actorName":"Jim Davis","urlProfile":"http://www.imdb.com/name/nm0204824","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MTc2NzMzNl5BMl5BanBnXkFtZTcwNzI4MDgxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 August 1909","placeOfBirth":" Edgerton, Missouri, USA","birthName":"Marlin Davis","height":"6' 2½\" (1.89 m)","bio":"Tall, rangy Jim Davis spent much of his early career in westerns, mainly at Republic Pictures. The Missouri-born and -raised Davis' relaxed, easygoing manner and Southern drawl easily fit most moviegoers' image of the cowboy, and Republic put him in a ton of them over the years (the fact that, unlike a lot of movie cowboys, he looked right at home on a horse didn't hurt, either). He alternated between good-guy and villain roles, one of his better ones being that of the devious, murderous fur trapper working for Kirk Douglas' competition in The Big Sky (1952). He is best known, however, for his role as Ewing family patriarch Jock in the long-running TV series Dallas (1978).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MTc2NzMzNl5BMl5BanBnXkFtZTcwNzI4MDgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0204824","name":"Jim Davis","idIMDB":"nm0204824"},"actorId":"nm0204824","character":"The Stranger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Emile Meyer","urlProfile":"http://www.imdb.com/name/nm0583093","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDYzMmMwM2MtNzgzZC00YWVmLWE2ZGMtZmRiYmM4YmI1ZTc4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1910","placeOfBirth":" New Orleans, Louisiana, USA","height":"5' 10½\" (1.79 m)","bio":"Emile Meyer was born on August 18, 1910 in New Orleans, Louisiana, USA. He was an actor, known for Paths of Glory (1957), Shane (1953) and Sweet Smell of Success (1957). He died on March 19, 1987 in Covington, Louisiana.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDYzMmMwM2MtNzgzZC00YWVmLWE2ZGMtZmRiYmM4YmI1ZTc4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0583093","name":"Emile Meyer","idIMDB":"nm0583093"},"actorId":"nm0583093","character":"Leo Malone","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Walter Sande","urlProfile":"http://www.imdb.com/name/nm0761340","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWRlODgyYTEtMWEyMC00ZjY5LTllZGItZjlhZDkxYzE1ZjUyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 July 1906","placeOfBirth":" Denver, Colorado, USA","height":"5' 6½\" (1.69 m)","bio":"Chances are you've seen his imposing character face scores of times but couldn't place the name. Colorado-born actor Walter Sande was one of those stern, heavyset character actors in Hollywood everyone recognized but no one could identify. Born in Denver on July 9, 1906, Sande showed an early passion for music as a youth and by his college years managed to start his own band. This led to a job as musical director for 20th Century-Fox's theater chain, which in turn led to acting in films beginning in 1937. Usually providing atmospheric bits with no billing, he made an initial impression in serial cliffhangers as a third-string heavy with the popular The Green Hornet Strikes Again! (1940) and Sky Raiders (1941). His first top featured role, however, would come with The Iron Claw (1941) as Jack \"Flash\" Strong, a photographer who--uncharacteristically for Walter--served as a comic sidekick to the serial's hero. Best of all would be his role in another serial as Red Pennington, the amusing sidekick to Don Winslow of the Navy (1942). he repeated his role again in Don Winslow of the Coast Guard (1943), the successful sequel. The role of Pennington sparked a long and steady supporting career in movies, usually a step or two behind Hollywood's elite on camera, which included Humphrey Bogart and Lauren Bacall in To Have and Have Not (1944) (prominently featured as the fisherman who tries to cheat Bogie), Gary Cooper in Along Came Jones (1945), Alan Ladd in The Blue Dahlia (1946), Charlton Heston in Dark City (1950) and Spencer Tracy in Bad Day at Black Rock (1955), among hundreds of others. He also lent an an authoritative presence to classic sci-fi films such as Red Planet Mars (1952), The War of the Worlds (1953) and Invaders from Mars (1953), and also had a recurring featured part in the 1940s \"Boston Blackie\" film series playing Detective Matthews alongside Chester Morris' former thief-turned-crime hero. A prolific supporting player during the \"golden age\" of TV, Sande worked on nearly every popular western and crime show that aired throughout the 1950s and 1960s. He had a regular series role on The Adventures of Tugboat Annie (1957) as Capt. Horatio Bullwinkle, Annie's tugboat rival, and a recurring one as Inger Stevens' Swedish father, Lars \"Papa\" Holstrum, on The Farmer's Daughter (1963). Walter Sande died of a heart attack in 1971 at age 65.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYWRlODgyYTEtMWEyMC00ZjY5LTllZGItZjlhZDkxYzE1ZjUyXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0761340","name":"Walter Sande","idIMDB":"nm0761340"},"actorId":"nm0761340","character":"Sheriff Wilson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Keymas","urlProfile":"http://www.imdb.com/name/nm0449410","urlPhoto":"","biography":{"dateOfBirth":"18 November 1925","placeOfBirth":" Springfield, Ohio, USA","height":"5' 10\" (1.78 m)","bio":"George Keymas was born on November 18, 1925 in Springfield, Ohio, USA. He was an actor, known for The Other Side of Midnight (1977), Arizona Raiders (1965) and Drums of Tahiti (1954). He died on January 17, 2008 in Palm Beach, Florida, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0449410","name":"George Keymas","idIMDB":"nm0449410"},"actorId":"nm0449410","character":"Muncie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Doucette","urlProfile":"http://www.imdb.com/name/nm0234732","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNTY5ODQwNV5BMl5BanBnXkFtZTYwMTUyNTAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 January 1921","placeOfBirth":" Brockton, Massachusetts, USA","birthName":"John Arthur Doucette","height":"5' 9\" (1.75 m)","bio":"Stocky, balding American character actor with a rich, deep voice, equally adept at Western bad guys and Shakespeare. He began his career in films in minor roles, primarily as gangland henchmen, and progressed to become widely familiar as a figure in a variety of dramas and occasional comedies. Although a stalwart and reliable supporting player, he was not of a type to essay leading roles in films, but remained a well-respected actor whose face, if not name, is familiar to a generation of film and television viewers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNTY5ODQwNV5BMl5BanBnXkFtZTYwMTUyNTAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0234732","name":"John Doucette","idIMDB":"nm0234732"},"actorId":"nm0234732","character":"Loudmouth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Taylor Holmes","urlProfile":"http://www.imdb.com/name/nm0392067","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTFiYjI2OTYtM2M3OS00NWRiLWI1NTgtMTExNWYxMzgxMmJkXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1878","placeOfBirth":" Newark, New Jersey, USA","height":"5' 9¾\" (1.77 m)","bio":"Taylor Holmes, the American stage and film actor, was born on May 16, 1878, in Newark, New Jersey. He made his Broadway debut in February 1900 in the controversial play \"Sapho\", which was closed down by the New York Police Department for immorality after 29 performances. In the April 1900 trial, the play was adjudged not obscene, and it reopened and ran for an additional 55 performances. Holmes would go on to appear in 36 other Broadway productions over the next 46 years. From 1917 through 1959, he appeared in scores of films and television shows, being employed mainly by TV in the 1950s. Taylor Holmes was married to the actress Edna Phillips. They were the parents of the actors Philip Holmes and Ralph Holmes and of a daughter, Madeleine. His wife and two sons died before he finally shuffled off this mortal coil on September 30, 1959, at the age of 81. He was buried at Holy Cross Cemetery in Culver City, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTFiYjI2OTYtM2M3OS00NWRiLWI1NTgtMTExNWYxMzgxMmJkXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0392067","name":"Taylor Holmes","idIMDB":"nm0392067"},"actorId":"nm0392067","character":"Pete Callaher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pierre Watkin","urlProfile":"http://www.imdb.com/name/nm0914246","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWUzNTg4MjYtY2ZkMi00MGJiLWE1MmUtZjMzOWMyMzVlZTJhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1889","placeOfBirth":" Sioux City, Iowa, USA","birthName":"Pierre Frank Watkin","height":"6' (1.83 m)","bio":"Pierre Watkin was one of a stable of tall, distinguished-looking and sophisticated character actors (such as Russell Hicks, Jonathan Hale, Selmer Jackson and Samuel S. Hinds) whom Hollywood kept steadily employed playing political leaders, army officers, lawyers, wealthy businessmen and the like. Unlike many of his colleagues in that category, however, Watkin is notable for his (relatively) soft voice and precisely articulated speech. He is probably best remembered by film enthusiasts as Mr. Skinner, the bank president, in the W.C. Fields comedy The Bank Dick (1940), in which he uttered the now-classic line, \"Allow me to give you a hearty handclasp\". He was the third of four sons of C.H. and Elizabeth J. Watkin, who operated a lodging house for \"theater people\" in Sioux City, Iowa. After completing high school he entered the acting profession and, by the time he registered for the draft in WWI, he was working with an acting troupe headed by Sidney Toler, and was married, requesting a deferment from military service because he was the sole support of his wife. His wife's name is unknown, however, and it's also unknown if they had any children; this information does not appear in the draft registration, and the name Pierre Watkin(s) is completely missing from both the 1920 and 1930 federal censuses.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOWUzNTg4MjYtY2ZkMi00MGJiLWE1MmUtZjMzOWMyMzVlZTJhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0914246","name":"Pierre Watkin","idIMDB":"nm0914246"},"actorId":"nm0914246","character":"McMillan","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0049487","urlIMDB":"http://www.imdb.com/title/tt0049487","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Republic Pictures Corp."},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["Mono (RCA Sound Recording)"],"color":["Color (Trucolor)"],"aspectRatio":["2.35 : 1"],"camera":["Mitchell Camera"],"laboratory":["Consolidated Film Industries (CFI), Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["(anamorphic)","Naturama"],"printedFilmFormat":["35 mm"]},"rating":"5.9","filmingLocations":[{"location":"Durango, Colorado, USA"}],"rated":"APPROVED","awards":[],"votes":"307","type":"Movie","companyCreditsSimple":[{"idCompany":"co0020540","name":"Republic Pictures (I)"}],"keywords":{"keywords":["wyoming","the wild bunch","hotel","title song","historical fiction","henchman","barfly","bank robbery","damsel in distress","vigilantism","held at gunpoint","gang leader","sheriff","bare chested male","train robbery","poker game","trucolor","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:44:00"}}