{"data":{"movies":[{"title":"The Poseidon Adventure","originalTitle":"","year":"1972","releaseDate":"19721213","directors":[{"name":"Ronald Neame","id":"nm0623768"},{"name":"Irwin Allen","id":"nm0000740"}],"writers":[{"name":"Paul Gallico","id":"nm0302904"},{"name":"Stirling Silliphant","id":"nm0798103"}],"runtime":"117 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmM0ZDRkZGEtNTFmNS00MDg1LThkNWItZmU1NmM1OGM0NTU4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English","Hebrew"],"genres":["Action","Adventure","Drama","Thriller"],"plot":"A passenger ship, on her way to the scrap yard is pushed to her limits by the new owners to save on the dismantling fees. A tidal wave hits her, flipping her over so that all the internal rooms are upside down. A priest takes a mixed band of survivors on a journey through the bowels of the ship in an attempt to survive.","simplePlot":"A group of passengers struggle to survive and escape when their ocean liner completely capsizes at sea.","actors":[{"actorName":"Gene Hackman","urlProfile":"http://www.imdb.com/name/nm0000432","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5Njk0NDQ4OV5BMl5BanBnXkFtZTYwNjA0Mzc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 January 1930","placeOfBirth":" San Bernardino, California, USA","birthName":"Eugene Allen Hackman","height":"6' 1\" (1.85 m)","bio":"Eugene Allen Hackman was born in San Bernardino, California, the son of Anna Lyda Elizabeth (Gray) and Eugene Ezra Hackman, who operated a newspaper printing press. He is of Pennsylvania Dutch (German), English, and Scottish ancestry, partly by way of Canada, where his mother was born. After several moves, his family settled in Danville, Illinois. Gene grew up in a broken home, which he left at the age of sixteen for a hitch with the US Marines. Moving to New York after being discharged, he worked in a number of menial jobs before studying journalism and television production on the G.I. Bill at the University of Illinois. Hackman would be over 30 years old when he finally decided to take his chance at acting by enrolling at the Pasadena Playhouse in California. Legend says that Hackman and friend Dustin Hoffman were voted \"least likely to succeed.\" Hackman next moved back to New York, where he worked in summer stock and off-Broadway. In 1964 he was cast as the young suitor in the Broadway play \"Any Wednesday.\" This role would lead to him being cast in the small role of Norman in Lilith (1964), starring Warren Beatty. When Beatty was casting for Bonnie and Clyde (1967), he cast Hackman as Buck Barrow, Clyde Barrow's brother. That role earned Hackman a nomination for the Academy Award for Best Supporting Actor, an award for which he would again be nominated in I Never Sang for My Father (1970). In 1972 he won the Oscar for his role as Detective Jimmy \"Popeye\" Doyle in The French Connection (1971). At 40 years old Hackman was a Hollywood star whose work would rise to new heights with Night Moves (1975) and Bite the Bullet (1975), or fall to new depths with The Poseidon Adventure (1972) and Eureka (1983). Hackman is a versatile actor who can play comedy (the blind man in Young Frankenstein (1974)) or villainy (the evil Lex Luthor in Superman (1978)). He is the doctor who puts his work above people in Extreme Measures (1996) and the captain on the edge of nuclear destruction in Crimson Tide (1995). After initially turning down the role of Little Bill Daggett in Clint Eastwood's Unforgiven (1992), Hackman finally accepted it, as its different slant on the western interested him. For his performance he won the Oscar and Golden Globe and decided that he wasn't tired of westerns after all. He has since appeared in Geronimo: An American Legend (1993), Wyatt Earp (1994), and Mort ou vif (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5Njk0NDQ4OV5BMl5BanBnXkFtZTYwNjA0Mzc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000432","name":"Gene Hackman","idIMDB":"nm0000432"},"actorId":"nm0000432","character":"Reverend Scott","urlCharacter":"http://www.imdb.com/character/ch0180827","main":true},{"actorName":"Ernest Borgnine","urlProfile":"http://www.imdb.com/name/nm0000308","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NDE1NjY2OF5BMl5BanBnXkFtZTYwNDE0MzM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 January 1917","placeOfBirth":" Hamden, Connecticut, USA","birthName":"Ermes Effron Borgnino","height":"5' 9½\" (1.77 m)","bio":"Ernest Borgnine was born Ermes Effron Borgnino on January 24, 1917 in Hamden, Connecticut. His parents were Anna (Boselli), who had emigrated from Carpi (MO), Italy, and Camillo Borgnino, who had emigrated from Ottiglio (AL), Italy. As an only child, Ernest enjoyed most sports, especially boxing, but took no real interest in acting. At age 18, after graduating from high school in New Haven, and undecided about his future career, he joined the United States Navy, where he stayed for ten years until leaving in 1945. After a few factory jobs, his mother suggested that his forceful personality could make him suitable for a career in acting, and Borgnine promptly enrolled at the Randall School of Drama in Hartford. After completing the course, he joined Robert Porterfield's famous Barter Theatre in Abingdon, Virginia, staying there for four years, undertaking odd jobs and playing every type of role imaginable. His big break came in 1949, when he made his acting debut on Broadway playing a male nurse in \"Harvey\". In 1951, Borgnine moved to Los Angeles to pursue a movie career, and made his film debut as Bill Street in The Whistle at Eaton Falls (1951). His career took off in 1953 when he was cast in the role of Sergeant \"Fatso\" Judson in From Here to Eternity (1953). This memorable performance led to numerous supporting roles as \"heavies\" in a steady string of dramas and westerns. He played against type in 1955 by securing the lead role of Marty Piletti, a shy and sensitive butcher, in Marty (1955). He won an Academy Award for Best Actor for his performance, despite strong competition from Spencer Tracy, Frank Sinatra, James Dean and James Cagney. Throughout the 1950s, 1960s and 1970s, Borgnine performed memorably in such films as The Catered Affair (1956), Ice Station Zebra (1968) and Emperor of the North (1973). Between 1962 and 1966, he played Lt. Commander Quinton McHale in the popular television series McHale's Navy (1962). In early 1984, he returned to television as Dominic Santini in the action series Supercopter (1984) co-starring Jan-Michael Vincent, and in 1995, he was cast in the comedy series The Single Guy (1995) as doorman Manny Cordoba. He also appeared in several made-for-TV movies. Ernest Borgnine has often stated that acting is his greatest passion, and he is still working today. His amazing 61-year career (1951 - 2012 and continuing) includes appearances in well over 100 feature films and as a regular in three television series, as well as voiceovers in animated films such as All Dogs Go to Heaven 2 (1996), Small Soldiers (1998), and a continued role in the series SpongeBob SquarePants (1999). Between 1973 until his death, Ernest was married to Tova Traesnaes, who heads her own cosmetics company. They lived in Beverly Hills, California, where Ernest assisted his wife between film projects. When not acting, Ernest actively supported numerous charities and spoke tirelessly at benefits throughout the country. He has been awarded several honorary doctorates from colleges across the United States as well as numerous Lifetime Achievement Awards. In 1996, Ernest purchased a bus and traveled across the United States to see the country and meet his many fans. On December 17, 1999, he presented the University of North Alabama with a collection of scripts from his film and television career, due to his long friendship with North Alabama alumnus and actor George Lindsey (died May 6, 2012), who was an artist in residence at North Alabama. Ernest Borgnine passed away aged 95 on July 8, 2012, at Cedars-Sinai Medical Center in Los Angeles, California, of renal failure. He is survived by his wife Tova, their children and his younger sister Evelyn (1926-2013)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NDE1NjY2OF5BMl5BanBnXkFtZTYwNDE0MzM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000308","name":"Ernest Borgnine","nicknames":["Ernie"],"idIMDB":"nm0000308"},"actorId":"nm0000308","character":"Rogo","urlCharacter":"http://www.imdb.com/character/ch0009094","main":true},{"actorName":"Red Buttons","urlProfile":"http://www.imdb.com/name/nm0000999","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MDI4ODY1NF5BMl5BanBnXkFtZTYwMjczNTc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1919","placeOfBirth":" New York City, New York, USA","birthName":"Aaron Chwatt","height":"5' 6\" (1.68 m)","bio":"Composer, actor, comedian and author, he joined ASCAP in 1963 and wrote several popular songs (which he often personally performed), including \"Strange Things Are Happening\" and \"The Ho-Ho Song\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2MDI4ODY1NF5BMl5BanBnXkFtZTYwMjczNTc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000999","name":"Red Buttons","idIMDB":"nm0000999"},"actorId":"nm0000999","character":"Martin","urlCharacter":"http://www.imdb.com/character/ch0161722","main":true},{"actorName":"Carol Lynley","urlProfile":"http://www.imdb.com/name/nm0528595","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE1MzNjYTItODVlNC00NjA3LWI2MGMtOTY0MDBkMjc4ZWM1L2ltYWdlXkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1942","placeOfBirth":" New York City, New York, USA","birthName":"Carole Ann Jones","bio":"Carol Lynley was born on February 13, 1942 in New York City, New York, USA as Carole Ann Jones. She is an actress, known for The Poseidon Adventure (1972), Another World (1964) and The Cardinal (1963). She was previously married to Michael Selsman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE1MzNjYTItODVlNC00NjA3LWI2MGMtOTY0MDBkMjc4ZWM1L2ltYWdlXkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0528595","name":"Carol Lynley","idIMDB":"nm0528595"},"actorId":"nm0528595","character":"Nonnie","urlCharacter":"http://www.imdb.com/character/ch0009120","main":true},{"actorName":"Roddy McDowall","urlProfile":"http://www.imdb.com/name/nm0001522","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NjI3NzE1OV5BMl5BanBnXkFtZTYwNjk2MzU2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 September 1928","placeOfBirth":" Herne Hill, London, England, UK","birthName":"Roderick Andrew McDowall","height":"5' 9\" (1.75 m)","bio":"Roderick McDowall was born in London, the son of a Merchant Mariner father and a mother who had always wanted to be in movies. He was enrolled in elocution courses at age five and by ten had appeared in his first film, Murder in the Family (1938), playing Peter Osborne, the younger brother of sisters played by Jessica Tandy and Glynis Johns. His mother brought Roddy and his sister to the US at the beginning of World War II, and he soon got the part of Huw, youngest child in a family of Welsh coal miners, in John Ford's How Green Was My Valley (1941), acting alongside Walter Pidgeon, Maureen O'Hara and Donald Crisp in the film that won that year's best film Oscar. He went on to many other child roles, in films like My Friend Flicka (1943) and Lassie Come Home (1943) until, at age 18, he moved to New York, where he played a long series of successful stage roles, both on Broadway and in such venues as Connecticut's Stratford Festival, where he did Shakespeare. In addition to making many more movies (over 150), McDowall acted in television, developed an extensive collection of movies and Hollywood memorabilia, and published five acclaimed books of his own photography. He died at his Los Angeles home, aged 70, of cancer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NjI3NzE1OV5BMl5BanBnXkFtZTYwNjk2MzU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001522","name":"Roddy McDowall","idIMDB":"nm0001522"},"actorId":"nm0001522","character":"Acres","urlCharacter":"http://www.imdb.com/character/ch0029379","main":true},{"actorName":"Stella Stevens","urlProfile":"http://www.imdb.com/name/nm0001771","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NDEwMzQzN15BMl5BanBnXkFtZTYwMDI3NTY0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 October 1936","placeOfBirth":" Yazoo City, Mississippi, USA","birthName":"Estelle Caro Eggleston","height":"5' 5\" (1.65 m)","bio":"A native of Hot Coffee, Mississippi. While attending Memphis State College, Stella became interested in acting and modeling. Her film debut was a bit part in Say One for Me (1959), but her appearance in Li'l Abner (1959) as Appassionata Von Climax is the one that got her noticed. Then her centerfold spread in Playboy was one of the most popular issues. She co-starred with some of the biggest names in movies such as Bobby Darin in Too Late Blues (1961); Elvis Presley in Girls! Girls! Girls! (1962); Glenn Ford in The Courtship of Eddie's Father (1963); Jerry Lewis in The Nutty Professor (1963); and Dean Martin in The Silencers (1966). She appeared on the television series Surfside 6 (1960); Ben Casey (1961) and the soap opera General Hospital (1963). By the late 1960s, her career had leveled off and she was appearing in roles based on her looks. One of her best performances at that time was in the movie The Ballad of Cable Hogue (1970), where she played Hildy, and showed that her talent was more than physical. But then she appeared in a poor offering like Slaughter (1972). In the 1970s and 1980s, Stella became a fixture in movies made for television and appeared in a number of television series. Her big screen career may have slowed during that time, but she has appeared in a number of movies in every decade since she debuted.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3NDEwMzQzN15BMl5BanBnXkFtZTYwMDI3NTY0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001771","name":"Stella Stevens","idIMDB":"nm0001771"},"actorId":"nm0001771","character":"Linda Rogo","urlCharacter":"http://www.imdb.com/character/ch0009113","main":true},{"actorName":"Shelley Winters","urlProfile":"http://www.imdb.com/name/nm0001859","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNjMzNjQ3MF5BMl5BanBnXkFtZTYwMzcxMDI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1920","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Shirley Schrift","height":"5' 4\" (1.63 m)","bio":"Shelley Winters was born Shirley Schrift of very humble beginnings on August 18, 1920 (some sources list 1922) in East St. Louis, Illinois. Her mother, Rose (Winter), was born in Missouri, to Austrian Jewish parents, and her father, Jonas Schrift, was an Austrian Jewish immigrant. Her father moved the family to Brooklyn when she was still young so that he, a tailor's cutter, could find steadier work closer to the city's garment industry. An unfailing interest in acting occurred quite early for Shelley and she appeared in high school plays. By her mid-to-late teens she had already been employed as a Woolworth's store clerk, model, borscht belt vaudevillian and nightclub chorine, all in order to pay for her acting classes. During a nationwide search in 1939 for GWTW's Scarlett O'Hara, Shelley was advised by auditioning director George Cukor to get acting lessons, which she did. Apprenticing in summer stock, she made her Broadway debut in the short-lived comedy \"The Night Before Christmas\" in 1941 and followed it with the operetta \"Rosalinda\" (1942) initially billing herself in both shows as Shelley Winter (without the \"s\"). Within a short time, Shelley pushed ahead for a career out west. Hollywood proved to be a tough road. Toiling in bit roles for years, many of her scenes were excised altogether during her early days. Obscurely used in such movies as What a Woman! (1943), The Racket Man (1944), Cover Girl (1944) and Tonight and Every Night (1945), her breakthrough did not occur until 1947, and it happened on both the stage and big screen. Not only did she win the replacement role of Ado Annie Carnes in \"Oklahoma!\" on Broadway but, around the same time, scored excellent notices on film as the party girl waitress who ends up a victim of deranged strangler (and Oscar winner) Ronald Colman in the critically-hailed A Double Life (1947) directed by Cukor. From this moment, a somewhat earthy film stardom was to be hers playing second-lead broads who often met untimely ends (as in Cry of the City (1948) and The Great Gatsby (1949)), or tawdry-black-stockinged and feather-boa-adorned leads, as in South Sea Sinner (1950) in which her eclectic co-stars included Macdonald Carey and Liberace! As a tarnished glamour girl and symbol of working class vulgarity in Hollywood, Shelley was about to be written off in pictures altogether when one of her finest movie roles arrived on her front porch. Her best hard luck girl storyboard showed up in the form of depressed, frumpy-looking Alice Tripp, a factory girl seduced and abandoned by wanderlust Montgomery Clift in A Place in the Sun (1951). Favoring gorgeous society girl Elizabeth Taylor who is totally out of his league, Clift is subsequently blackmailed by Winters' pathetic (and now pregnant) character into marrying her. For her desperate efforts, she is purposely drowned by Clift after he tips their canoe. The role, which garnered Shelley her first Oscar nomination, finally plucked her out of the sordid starlet pool she was treading and into the ranks of serious femme star contenders. But not for long. The Brooklyn-bred Shelley just couldn't escape the lurid bottle-blonde quality she instilled in her characters. During what should have been her peak time in films were a host of badly-scripted \"B\" films. The obvious, two-dimensional chorines, barflies, floozies and gold diggers she played in Behave Yourself! (1951), Frenchie (1950), Phone Call from a Stranger (1952), Playgirl (1954) and Mambo (1954), the latter of which co-starred second husband Vittorio Gassman, pretty much said it all. Shelley grew extremely disenchanted and decided to return to dramatic study. Earning membership into the famed Actor's Studio, she went to Broadway and earned kudos, thereby reestablishing her reputation as a strong actress with the drug-themed play \"A Hatful of Rain\" (1955). Co-starring in the show was the up-and-coming hunk Anthony Franciosa, whom she took as her third husband in 1957. Shelley's renewed dedication to pursuing quality work was shown by her appearances in a number of heavyweight theater roles including Blanche in \"A Streetcar Named Desire\" (1955). In later years, the Actors Studio enthusiast became one of its most respected coaches, shaping up a number of today's fine talent with the Strasberg \"method\" technique. By the late 1950s Shelley had started growing in girth and wisely eased into colorful character supports. The switch paid off. After a sterling performance as the ill-fated wife of sadistic killer Robert Mitchum in Charles Laughton's The Night of the Hunter (1955), she scored big in the Oscar department when she won \"Best Supporting Actress\" for her shrill and hypertensive role of Mrs. Van Daan in The Diary of Anne Frank (1959). From this period sprouted a host of revoltingly bad mamas, blowsy matrons, and trashy madams in such film fare as Lolita (1962), The Chapman Report (1962), The Balcony (1963) Wives and Lovers (1963), and A House Is Not a Home (1964). She topped things off as the abusive prostitute mom in A Patch of Blue (1965) who was not above pimping her own blind daughter (the late Elizabeth Hartman) for household money. The actress managed to place a second Oscar on her mantle for this riveting support work. With advancing age and increasing size, Shelley found a comfortable niche in the harping Jewish wife/mother category with loud, flashy, unsubtle roles in Enter Laughing (1967), Next Stop, Greenwich Village (1976) and, most notably, The Poseidon Adventure (1972). She earned another Oscar nomination for \"Poseidon\" while portraying her third drowning victim. At around the same time, she scored quite well as the indomitable Marx Brothers' mama in \"Minnie's Boys\" on Broadway in 1970. In the 1970s and 1980s, Shelley developed into an oddly-distracted personality on TV, making countless talk show appearances and becoming quite the raconteur and incessant name dropper with her juicy Hollywood behind-the-scenes tales. Candid would be an understatement when she published two scintillating tell-all autobiographies that reached the best seller's list. \"Shelley, Also Known as Shirley\" (1981) and \"Shelley II: The Middle of My Century\" (1989) detailed her notorious dalliances with such famous movie stars as Errol Flynn, Burt Lancaster, Marlon Brando, William Holden, Sean Connery and Clark Gable, to name a few. Thrice divorced (her first husband was a WWII captain, while her only child, Vittoria, came from her second union to Italian stallion Gassman), Shelley remained footloose and fancy free after finally breaking it off with the volatile Franciosa in 1960. Her stormy marriages and notorious affairs, not to mention her ambitious forays into politics and feminist causes, kept her name alive for decades. She worked in films until the beginning of the millennium, her last film being the easily-dismissed Italian feature La bomba (1999). She also enjoyed Emmy-winning TV work and had the recurring role of Roseanne Barr's tell-it-like-it-is grandmother on the comedienne's self-named sitcom. Shelley's last years were marred by failing health and, for the most part, she was confined to a wheelchair. Suffering a heart attack in October of 2005, she died in a Beverly Hills nursing home of heart failure on January 14, 2006. It was reported that only hours earlier on her deathbed she had entered into a \"spiritual\" union with her longtime companion of 19 years, Gerry McFord. Gregarious, brazen, ambitious and completely unpredictable -- that would be Shelley Winters, the storyteller, whose amazing career lasted over six colorful decades.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNjMzNjQ3MF5BMl5BanBnXkFtZTYwMzcxMDI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001859","name":"Shelley Winters","nicknames":["The Blonde Bombshell"],"idIMDB":"nm0001859"},"actorId":"nm0001859","character":"Belle Rosen","urlCharacter":"http://www.imdb.com/character/ch0009109","main":true},{"actorName":"Jack Albertson","urlProfile":"http://www.imdb.com/name/nm0016776","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNDM4Njc4Ml5BMl5BanBnXkFtZTYwNjIzMjQ2._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1907","placeOfBirth":" Malden, Massachusetts, USA","birthName":"Harold Albertson","height":"6' 1\" (1.85 m)","bio":"A former song-and-dance man and veteran of vaudeville, burlesque and Broadway, Jack Albertson is best known to audiences as \"The Man\" in the TV series Chico and the Man (1974), for which he won an Emmy. In 1968 Albertson, the brother of actress Mabel Albertson, won the Oscar for Best Supporting Actor in The Subject Was Roses (1968), a part which also won him the Tony award during its Broadway run.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNDM4Njc4Ml5BMl5BanBnXkFtZTYwNjIzMjQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0016776","name":"Jack Albertson","idIMDB":"nm0016776"},"actorId":"nm0016776","character":"Manny Rosen","urlCharacter":"http://www.imdb.com/character/ch0009119","main":true},{"actorName":"Pamela Sue Martin","urlProfile":"http://www.imdb.com/name/nm0552863","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3ODM3NzM1Nl5BMl5BanBnXkFtZTYwOTg3MDQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1953","placeOfBirth":" Westport, Connecticut, USA","height":"5' 8\" (1.73 m)","bio":"Pamela Sue Martin attended public schools in Westport, Connecticut and graduated from Staples High School in February 1971. Before she graduated, Pamela was working in a hamburger stand for $1.45 per hour when a friend told her that she was earning $60 per hour modeling in New York. Liking the wages and being of an ambitious nature, Pamela Sue decided to emulate her friend and soon was earning a good living as a teenage model for print ads and television commercials. Although she was completely innocent of dramatic training, experience or even ambitions, when Pamela Sue heard that Columbia Pictures was auditioning girls for a film called To Find a Man (1972), she decided to try. It took the producers three months to make up their minds, but in the end Pamela Sue had the female starring role. Pamela returned to Staples High School in Westport, Connecticut to finish high school. On the basis of her performance in To Find a Man (1972), producer Irwin Allen cast her to co-star with five Academy Award winners in The Poseidon Adventure (1972). Then came a starring role in the ABC Movie of the Week The Girls of Huntington House (1973) and a co-starring role with Jan-Michael Vincent in Buster and Billie (1974). She is particularly proud of her portrayal in the production, The Hemingway Play (1976). She has played the character Celia Grey in the television movie, Strong Medicine (1986) and has hosted \"Saturday Night Live.\" Pamela enjoys athletic pursuits, especially scuba diving, tennis and skiing.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3ODM3NzM1Nl5BMl5BanBnXkFtZTYwOTg3MDQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0552863","name":"Pamela Sue Martin","idIMDB":"nm0552863"},"actorId":"nm0552863","character":"Susan","urlCharacter":"http://www.imdb.com/character/ch0009116","main":true},{"actorName":"Arthur O'Connell","urlProfile":"http://www.imdb.com/name/nm0640023","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMjk0OTAyNF5BMl5BanBnXkFtZTcwNDgxMjcwOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 March 1908","placeOfBirth":" New York City, New York, USA","height":"5' 10\" (1.78 m)","bio":"Though veteran character actor Arthur O'Connell was born in New York City in 1908, he looked as countrified as apple pie, looking ever more comfy in overalls than he ever did in a suit. He made his stage debut in the mid 1930s and came into contact with Orson Welles' Mercury Theatre. As a result, he earned the bit role of a reporter in the final scenes of Citizen Kane (1941). Making little leeway in films, O'Connell returned to the Broadway lights where he played Polonius in \"Hamlet\" and Banquo in \"Macbeth\", finally gaining considerable attention as the amiable bachelor storekeeper in \"Picnic\" in 1953. He transferred the role successfully to film three years later and began a series of flawed and forlorn characters on TV and the screen from then on. A particular standout was as James Stewart's boozed up attorney and mentor in Anatomy of a Murder (1959) for which he won his second Oscar-nomination for \"best supporting actor\" (the first was for Picnic (1956) three years earlier). The mustachioed O'Connell usually played wise, helpful and friendly, and he also inhabited crafty villains from time to time, but there was always an unhappy ambiance and 'loser' quality in his elderly gents, which made you feel sorry for him. He played Monte Markham's \"son\" (Markham had been frozen in an iceberg, which explains Markham's young appearance) in the 1967 sitcom \"The Second Hundred Years\" but the series was short-lived. A popular guest star on all the major shows in the 70s, he was forced to curtail his work load as the progression of Alzheimer's began to steadily creep in. At the time of his death in 1981, O'Connell was appearing solely in toothpaste commercials.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMjk0OTAyNF5BMl5BanBnXkFtZTcwNDgxMjcwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0640023","name":"Arthur O'Connell","idIMDB":"nm0640023"},"actorId":"nm0640023","character":"Chaplain","urlCharacter":"http://www.imdb.com/character/ch0225032","main":true},{"actorName":"Eric Shea","urlProfile":"http://www.imdb.com/name/nm0790272","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNTMwOTIyMDZeQTJeQWpwZ15BbWU3MDIxNzM5MTg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1960","placeOfBirth":" Los Angeles County, California, USA","bio":"Eric Shea was born on February 14, 1960 in Los Angeles County, California, USA. He is an actor, known for The Poseidon Adventure (1972), Smile (1975) and Yours, Mine and Ours (1968).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNTMwOTIyMDZeQTJeQWpwZ15BbWU3MDIxNzM5MTg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0790272","name":"Eric Shea","idIMDB":"nm0790272"},"actorId":"nm0790272","character":"Robin","urlCharacter":"http://www.imdb.com/character/ch0009122","main":true},{"actorName":"Fred Sadoff","urlProfile":"http://www.imdb.com/name/nm0755589","urlPhoto":"","biography":{"dateOfBirth":"21 October 1926","placeOfBirth":" Brooklyn, New York, USA","birthName":"Frederick Edward Sadoff","height":"5' 11½\" (1.82 m)","bio":"Fred Sadoff was born in Brooklyn, New York on October 21, 1926 to Henry Sadoff from Philadelphia and Bertha Leib Sadoff from Russia. He was the youngest in the family, his older brother Robert having been born in 1921. He served a year in the military from 1943-1944 and, when he got out, decided to give acting a try. He first cut his teeth in acting on the Broadway stage, appearing in \"Wish You Were Here\" in 1947 and the original production of \"South Pacific\". He got his film break in 1958, working with Audie Murphy and Michael Redgrave in The Quiet American (1958) as Dominguez. One role he appeared in, and was not given credit for, was a small speaking part in the (1952) movie Viva Zapata! (1952). He was still more interested in the live theater than in movies, though, and felt that film did not offer enough depth for acting. He was also interested in directing plays. After having met Redgrave, Fred decided to move to Europe and secured a contract to direct plays. He formed his own company, \"F.E.S. Plays Ltd.\", which stood for Frederick Edward Sadoff. He spent a lot of time with Michael Redgrave and his family. His production company was doing quite well in England, producing such plays as \"Huey\" and \"The Importance of Being Oscar\". For ten years, things were going well, but then his life took a turn and things began to change. He never married and kept a rather secluded lifestyle, with a secret nobody knew very much about, as things like that were not talked about in those days. His company also ran into financial problems in the late 1960s and early 1970s. He felt it was time to move on in his life. He alternated between returning to the United States to do television series and then going back to Europe to finish dealing with the closing of his company. It was not until 1972 that the movie industry would really notice Fred. A book written by Paul Gallico was being made into a movie. The film was The Poseidon Adventure (1972) and Fred played the character Linarcos. The film was a gigantic classic and Fred's film and television career skyrocketed. However, he still wanted to keep directing live theater and, to that end, formed a new company in Hollywood, The Actors Studio, with another actor, and he eventually moved to Los Angeles in 1974. Fred kept up a steady flow of work, appearing in such series as Barney Miller (1974) and The Rockford Files (1974) and had a recurring role as Dr. Lenny Murchison on The Streets of San Francisco (1972). He did several feature films and made-for-TV movies. His life was going in the direction he really wanted, admired by fans for his resonant voice and commanding appearance. He did not want a regular part on a series, preferring to appear in a series only as long as necessary. He appeared on several soap operas, including Ryan's Hope (1975), All My Children (1970) and Days of Our Lives (1965). One of the last movies he did was the made-for-TV film The Murder of Mary Phagan (1988). He did not have a speaking part--he appeared in the last part of the movie--but was instantly recognizable. As it turned out, Fred was HIV-positive and was slowly dying of AIDS. It was in late 1993 that he realized he could not keep up the pace he had. Fred Sadoff died on May 6, 1994, peacefully at his home in Los Angeles, California. He gave much and those of us who recognized what he did, know that this was an actor who never got the due he richly deserved. He will truly be missed by all of us, those who loved him and those in the acting industry who could have benefited from his wealth of hard work and dedication it takes to be a class actor that he was.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0755589","name":"Fred Sadoff","idIMDB":"nm0755589"},"actorId":"nm0755589","character":"Linarcos","urlCharacter":"http://www.imdb.com/character/ch0225033","main":true},{"actorName":"Sheila Allen","urlProfile":"http://www.imdb.com/name/nm0021052","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNzQ4Mzc1NV5BMl5BanBnXkFtZTYwMTAxMzc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 February 1929","placeOfBirth":" New York City, New York, USA","birthName":"Sheila Marie Mathews","bio":"Sheila Allen was born on February 2, 1929 in New York City, New York, USA as Sheila Marie Mathews. She was an actress and producer, known for The Towering Inferno (1974), The Poseidon Adventure (1972) and Alice in Wonderland (1985). She was married to Irwin Allen. She died on November 15, 2013 in Malibu, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNzQ4Mzc1NV5BMl5BanBnXkFtZTYwMTAxMzc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0021052","name":"Sheila Allen","idIMDB":"nm0021052"},"actorId":"nm0021052","character":"Nurse","urlCharacter":"http://www.imdb.com/character/ch0144848","main":true},{"actorName":"Jan Arvan","urlProfile":"http://www.imdb.com/name/nm0038066","urlPhoto":"","biography":{"dateOfBirth":"10 April 1913","placeOfBirth":" Wisconsin, USA","birthName":"Jan Arvanitas","bio":"Jan Arvan was born on April 10, 1913 in Wisconsin, USA as Jan Arvanitas. He was an actor, known for The Poseidon Adventure (1972), 20 Million Miles to Earth (1957) and The Power of the Resurrection (1958). He died on May 24, 1979 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0038066","name":"Jan Arvan","idIMDB":"nm0038066"},"actorId":"nm0038066","character":"Doctor","urlCharacter":"http://www.imdb.com/character/ch0391082","main":true},{"actorName":"Byron Webster","urlProfile":"http://www.imdb.com/name/nm0916843","urlPhoto":"","biography":{"dateOfBirth":"14 June 1931","placeOfBirth":" London, England, UK","bio":"Byron Webster made 1951 his film debut in Captain Horatio Hornblower R.N. (1951). He moved to the USA in 1952 and settled in Chicago, Illinois. Acting assignments were few in Chicago, and he supplemented his income working for British European Airways. After some local area (Illinois) theatre work, he was cast in the NY company of \"The Killing of Sister George,\" and then in \"Funny Girl.\" Moving to Los Angeles in 1966, he appeared in the film version of \"Funny Girl\" and others, most notably as The Purser in The Poseidon Adventure (1972). He toured and co-starred in national companies of \"Camelot\" and \"My Fair Lady\". Mr. Webster possessed a beautiful and powerful singing voice that was little used in his film and television appearances. He is perhaps best remembered by television fans as a regular cast member in the TV series Soap (1977). An avid Bridge player, he held Master Points and was often in Bridge tournaments. Always fighting a weight problem, he succumbed to heart failure December 1, 1991, at his home in Sherman Oaks, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0916843","name":"Byron Webster","idIMDB":"nm0916843"},"actorId":"nm0916843","character":"Purser","urlCharacter":"http://www.imdb.com/character/ch0009125","main":true}],"seasons":[],"idIMDB":"tt0069113","urlIMDB":"http://www.imdb.com/title/tt0069113","business":{"budget":{"money":"$5,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$264,850","country":"USA","day":"17","month":"12","year":"1972","remarks":"25 Screens"}],"gross":[{"money":"$264,850","country":"USA","day":"17","month":"12","year":"1972","remarks":""},{"money":"$2,615,934 (France)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"SEK","country":"1,099,061","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$264,850","country":"USA","day":"17","month":"12","year":"1972","remarks":"25 Screens"}],"admissions":[],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"04","month":"04","year":"1972","remarks":null},null],"copyrightHolder":"COPYRIGHT © MCMLXXII BY TWENTIETH CENTURY-FOX FILM CORPORATION ALL RIGHTS RESERVED (on print)"},"technical":{"runtime":["1 hr 57 min (117 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Color"],"aspectRatio":["2.20 : 1 (70 mm prints)","2.35 : 1"],"camera":null,"laboratory":["DeLuxe (color by) (as De Luxe®)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic) (filmed in) (as Panavision®)"],"printedFilmFormat":["35 mm","70 mm (blow-up)"]},"rating":"7.1","filmingLocations":[{"location":"RMS Queen Mary - 1126 Queens Highway, Long Beach, California, USA"}],"rated":"PG","awards":[{"award":"Academy Awards, USA 1973","titlesAwards":[{"titleAwardOutcome":"Won Oscar","categories":[{"category":"Best Music, Original Song","names":[{"name":"Al Kasha","id":"nm0440517","role":null},{"name":"Joel Hirschhorn","id":"nm0386610","role":null}]}]},{"titleAwardOutcome":"Won Special Achievement Award","categories":[{"category":"","names":[{"name":"L.B. Abbott","id":"nm0008004","role":null},{"name":"A.D. Flowers","id":"nm0283166","role":null}]}]},{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Actress in a Supporting Role","names":[{"name":"Shelley Winters","id":"nm0001859","role":null}]},{"category":"Best Cinematography","names":[{"name":"Harold E. Stine","id":"nm0005885","role":null}]},{"category":"Best Art Direction-Set Decoration","names":[{"name":"William J. Creber","id":"nm0187169","role":null},{"name":"Raphael Bretton","id":"nm0107987","role":null}]},{"category":"Best Costume Design","names":[{"name":"Paul Zastupnevich","id":"nm0953665","role":null}]},{"category":"Best Sound","names":[{"name":"Theodore Soderberg","id":"nm0812029","role":null},{"name":"Herman Lewis","id":"nm0507266","role":null}]},{"category":"Best Film Editing","names":[{"name":"Harold F. Kress","id":"nm0470932","role":null}]},{"category":"Best Music, Original Dramatic Score","names":[{"name":"John Williams","id":"nm0002354","role":null}]}]}]},{"award":"Golden Globes, USA 1973","titlesAwards":[{"titleAwardOutcome":"Won Golden Globe","categories":[{"category":"Best Supporting Actress - Motion Picture","names":[{"name":"Shelley Winters","id":"nm0001859","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Motion Picture - Drama","names":[]},{"category":"Best Original Score - Motion Picture","names":[{"name":"John Williams","id":"nm0002354","role":null}]},{"category":"Best Original Song - Motion Picture","names":[{"name":"Al Kasha","id":"nm0440517","role":"music/lyrics"},{"name":"Joel Hirschhorn","id":"nm0386610","role":"music/lyrics"}]}]}]},{"award":"BAFTA Awards 1973","titlesAwards":[{"titleAwardOutcome":"Won BAFTA Film Award","categories":[{"category":"Best Actor","names":[{"name":"Gene Hackman","id":"nm0000432","role":null},{"name":"The French Connection","id":"tt0067116","role":null}]}]},{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Shelley Winters","id":"nm0001859","role":null}]}]}]},{"award":"American Cinema Editors, USA 1973","titlesAwards":[{"titleAwardOutcome":"Nominated Eddie","categories":[{"category":"Best Edited Feature Film","names":[{"name":"Harold F. Kress","id":"nm0470932","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 1973","titlesAwards":[{"titleAwardOutcome":"Won Golden Reel Award","categories":[{"category":"Best Sound Editing - Dialogue","names":[]}]}]},{"award":"Satellite Awards 2006","titlesAwards":[{"titleAwardOutcome":"Nominated Satellite Award","categories":[{"category":"Best DVD Extras","names":[]}]}]}],"votes":"34,088","type":"Movie","companyCreditsSimple":[{"idCompany":"co0000756","name":"Twentieth Century Fox Film Corporation"},{"idCompany":"co0037532","name":"Kent Productions"}],"keywords":{"keywords":["survivor","passenger","tidal wave","ocean","reverend","steam","band","capsize","singer","priest","ocean liner","haberdasher","fire","ex prostitute","escape","new year's eve","water","death of wife","chaos","bravery","courage","psychotronic","natural disaster","claustrophobic","jewish american","suspense","saving a life","death of protagonist","rescue attempt","1970s","new year's day","flood","cult film","disaster movie","crisis of faith","against the odds","determination","turtleneck shirt","death of preacher","preacher","older sister younger brother","trapped underwater","engine room","underwater scene","artificial christmas tree","telling someone to shut up","three word title","rescue helicopter","escape by helicopter","pendant","reference to moses","trying to warn someone in danger","ensemble","welding torch","face slap","celebration","new year's eve party","grief","reference to napoleon bonaparte","tears","panties","airshaft","fire hose","upskirt","music band","anger","microphone","destruction","nurse","weather","scream","luxury liner","stage","fear","church service","doctor","hysteria","death","panic","die hard scenario","one day","christmas","ship captain","atlantic ocean","main character dies","seasickness","hot pants","bra less woman","auld lang syne","song","singing","father son relationship","claustrophobia","stockings","female corpse","fire hose used as a rope","voyage","visceral","trapped","race against time","minister","high seas","cruise","cruise ship","radar","little boy","jealous husband","husband wife relationship","flooding","disaster film","swimming underwater","welding","underwater explosion","rope","helicopter","flashlight","explosion","binoculars","jumping on a bed","alarm","blockbuster","swimming","storm at sea","ship sinking","sermon","self sacrifice","retiree","restroom","rescue from drowning","renegade priest","police detective","mediterranean sea","marriage","loss of wife","loss of brother","ladder","jogging","jewish","falling from height","earthquake","dancing","corporate greed","brother sister relationship","barbershop","bachelor","air duct","rescue","disaster","survival","heart attack","underwater","obesity","christmas tree","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:35:29"}}