{"data":{"movies":[{"title":"The Music Box","originalTitle":"","year":"1932","releaseDate":"19320416","directors":[{"name":"James Parrott","id":"nm0663613"}],"writers":[{"name":"H.M. Walker","id":"nm0907778"}],"runtime":"29 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGNlMGM2MTEtMDhmNC00N2M3LTgxODctNTI5ODAzNzQ3ODU5XkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Short"],"plot":"The Laurel & Hardy Moving Co. have a challenging job on their hands (and backs): hauling a player piano up a monumental flight of stairs to Prof. von Schwarzenhoffen's house. Their task is complicated by a sassy nursemaid and, unbeknownst to them, the impatient Prof. von Schwarzenhoffen himself. But the biggest problem is the force of gravity, which repeatedly pulls the piano back down to the bottom of the stairs. Finally, the irate Professor explodes in fury to discover the \"mechanical blunderbuss\" in his home, not knowing it was a surprise birthday present from his wife.","simplePlot":"Like the legendary Sisyphus, deliverymen Laurel and Hardy struggle to push a large crated piano up a seemingly insurmountable flight of stairs.","actors":[{"actorName":"Stan Laurel","urlProfile":"http://www.imdb.com/name/nm0491048","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNTE0OTA2Nl5BMl5BanBnXkFtZTYwODk1MjI2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1890","placeOfBirth":" Ulverston, Lancashire, England, UK","birthName":"Arthur Stanley Jefferson","height":"5' 8\" (1.73 m)","bio":"Stan Laurel came from a theatrical family, his father was an actor and theatre manager, and he made his stage debut at the age of 16 at Pickard's Museum, Glasgow. He traveled with Fred Karno's vaudeville company to the United States in 1910 and again in 1913. While with that company he was Charles Chaplin's understudy, and he performed imitations of Chaplin. On a later trip he remained in the United States, having been cast in a two-reel comedy, Nuts in May (1917) (not released until 1918). There followed a number of shorts for Metro, Hal Roach Studios, then Universal, then back to Roach in 1926. His first two-reeler with Oliver Hardy was 45 Minutes from Hollywood (1926). Their first release through MGM was Sugar Daddies (1927) and the first with star billing was From Soup to Nuts (1928). Their first feature-length starring roles were in Pardon Us (1931). Their work became more production-line and less popular during the war years, especially after they left Roach and MGM for Twentieth Century-Fox. Their last movie together was The Bullfighters (1945) except for a dismal failure made in France several years later (Utopia (1951)). In 1960 he was given a special Oscar \"for his creative pioneering in the field of cinema comedy\". He died five years later.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNTE0OTA2Nl5BMl5BanBnXkFtZTYwODk1MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0491048","name":"Stan Laurel","idIMDB":"nm0491048"},"actorId":"nm0491048","character":"Stan","urlCharacter":"http://www.imdb.com/character/ch0026934","main":true},{"actorName":"Oliver Hardy","urlProfile":"http://www.imdb.com/name/nm0001316","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjA4MDU2OV5BMl5BanBnXkFtZTYwMDA2MjI2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 January 1892","placeOfBirth":" Harlem, Georgia, USA","birthName":"Oliver Norvell Hardy","height":"6' (1.83 m)","bio":"Although his parents were never in show business, as a young boy Oliver Hardy was a gifted singer and, by age eight, was performing with minstrel shows. In 1910 he ran a movie theatre, which he preferred to studying law. In 1913 he became a comedy actor with the Lubin Company in Florida and began appearing in a long series of shorts; his debut film was Outwitting Dad (1914). He appeared in he 1914-15 series of \"Pokes and Jabbs\" shorts, and from 1916-18 he was in the \"Plump and Runt\" series. From 1919-21 he was a regular in the \"Jimmy Aubrey\" series of shorts, and from 1921-25 he worked as an actor and co-director of comedy shorts for Larry Semon. In addition to appearing in two-reeler comedies, he found time to make westerns and even melodramas in which he played the heavy. He is most famous, however, as the partner of British comic Stan Laurel, with whom he had played a bit part in The Lucky Dog (1921). in the mid-1920s both he and Laurel wee working for comedy producer Hal Roach, although not as a team. In a moment of inspiration Roach teamed them together, and their first film as a team was 45 Minutes from Hollywood (1926). Their first release for Roach through MGM was Sugar Daddies (1927) and the first with star billing was From Soup to Nuts (1928). They became a huge hit as a comedy team, and after several years of two-reelers, Roach decided to star them in features, their first of which was Pardon Us (1931). They clicked with audiences in features, too, and starred in such classics as Way Out West (1937), Babes in Toyland (1934) and Block-Heads (1938). They eventually parted ways with Roach and in the mid-1940s signed on with Twentieth Century-Fox. Unfortunately, Fox did not let them have the autonomy they had at Roach, where Laurel basically wrote and directed their films, though others were credited, and their films became more assembly-line and formulaic. Their popularity waned and less popular during the war years, and they made their last film for Fox in 1946. Several years later they made their final appearance as a team in a French film, a troubled and haphazard production eventually, after several name changes, called Utopia (1951), generally regarded to be their worst film. Hardy appeared without Laurel in a few features, such as Zenobia (1939) with Harry Langdon, The Fighting Kentuckian (1949) in a semi-comedic role as a frontiersman alongside John Wayne and Riding High (1950), in a cameo role. He died in 1957.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjA4MDU2OV5BMl5BanBnXkFtZTYwMDA2MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001316","name":"Oliver Hardy","nicknames":["Babe"],"idIMDB":"nm0001316"},"actorId":"nm0001316","character":"Ollie","urlCharacter":"http://www.imdb.com/character/ch0112486","main":true}],"seasons":[],"idIMDB":"tt0023251","urlIMDB":"http://www.imdb.com/title/tt0023251","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"07","month":"12","year":"1931","remarks":null},{"money":null,"country":null,"day":"18","month":"12","year":"1931","remarks":null}],"copyrightHolder":"Copyright MCMXXXII in U.S.A. by Metro-Goldwyn-Mayer (on print)"},"technical":{"runtime":["29 min"],"soundMix":["Mono (Western Electric Sound System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["800 m (3 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"8.1","filmingLocations":[{"location":"Backlot, Hal Roach Studios - 8822 Washington Blvd., Culver City, California, USA"}],"rated":"APPROVED","awards":[{"award":"Academy Awards, USA 1932","titlesAwards":[{"titleAwardOutcome":"Won Oscar","categories":[{"category":"Best Short Subject, Comedy","names":[{"name":"Hal Roach","id":"nm0730018","role":null}]}]}]},{"award":"National Film Preservation Board, USA 1997","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"","names":[]}]}]}],"votes":"5,220","type":"Movie","companyCreditsSimple":[{"idCompany":"co0075561","name":"Hal Roach Studios"}],"keywords":{"keywords":["piano","stairs","birthday present","professor","laurel and hardy","player piano","piano moving","husband wife relationship","slapstick","sight gag","postman","physical comedy","nanny","garden fountain","crate","block and tackle","baby carriage","pram","policeman","ladder","horse","hat","axe","mover","remake"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 09:04:23"}}