{"data":{"movies":[{"title":"Deliverance","originalTitle":"","year":"1972","releaseDate":"19720920","directors":[{"name":"John Boorman","id":"nm0000958"}],"writers":[{"name":"James Dickey","id":"nm0225463"},{"name":"James Dickey","id":"nm0225463"}],"runtime":"109 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjBhYzU3NWItOWZjMy00NjI5LWFmYmItZmIyOWFlMDIxMWNiXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Adventure","Drama","Thriller"],"plot":"The Cahulawassee River valley in Northern Georgia is one of the last natural pristine areas of the state, which will soon change with the imminent building of a dam on the river, which in turn will flood much of the surrounding land. As such, four Atlanta city slickers - alpha male Lewis Medlock, generally even-keeled Ed Gentry, slightly condescending Bobby Trippe, and wide-eyed Drew Ballinger - decide to take a multi-day canoe trip on the river, with only Lewis and Ed having experience in outdoor life. They know going in that the area is ethno-culturally homogeneous and isolated, but don't understand the full extent of such until they arrive and see what they believe is the result of generations of inbreeding. Their relatively peaceful trip takes a turn for the worse when half way through they encounter a couple of hillbilly moonshiners. That encounter not only makes the four battle their way out of the valley intact and alive, but threatens the relationships of the four as they do ...","simplePlot":"Intent on seeing the Cahulawassee River before it's turned into one huge lake, outdoor fanatic Lewis Medlock takes his friends on a river-rafting trip they'll never forget into the dangerous American back-country.","actors":[{"actorName":"Jon Voight","urlProfile":"http://www.imdb.com/name/nm0000685","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NTE3NDA3M15BMl5BanBnXkFtZTgwMDMyNTM1MjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1938","placeOfBirth":" Yonkers, New York, USA","birthName":"Jonathan Vincent Voight","height":"6' 2½\" (1.89 m)","bio":"Jon Voight was born on December 29, 1938 in Yonkers, New York, USA as Jonathan Vincent Voight. He is an actor, known for Mission: Impossible (1996), Heat (1995) and Transformers (2007). He was previously married to Marcheline Bertrand and Lauri Peters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NTE3NDA3M15BMl5BanBnXkFtZTgwMDMyNTM1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000685","name":"Jon Voight","idIMDB":"nm0000685"},"actorId":"nm0000685","character":"Ed","urlCharacter":"http://www.imdb.com/character/ch0099176","main":true},{"actorName":"Burt Reynolds","urlProfile":"http://www.imdb.com/name/nm0000608","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2Nzc1ODA1OF5BMl5BanBnXkFtZTcwMTc4MTc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 February 1936","placeOfBirth":" Lansing, Michigan, USA","birthName":"Burton Leon Reynolds Jr.","height":"5' 11\" (1.8 m)","bio":"Enduring, strong-featured, and genial star of US cinema, Burt Reynolds started off in TV westerns in the 1960s and then carved his name into 1970/1980s popular culture as a male sex symbol (posing nearly naked for \"Cosmopolitan\" magazine) and on-screen as both a rugged action figure and then as a wisecracking, Southern-type \"good olé' boy.\" Burton Leon Reynolds was born in Lansing, Michigan. He is the son of Fern H. (Miller) and Burton Milo Reynolds, who was in the army and later served as chief of police. His family moved to Florida, where he excelled as an athlete and played with Florida State University. He became an All Star Southern Conference halfback (and was earmarked by the Baltimore Colts) before a knee injury and a car accident ended his football career. Midway through college he dropped out and headed to New York with aspirations of becoming an actor. There he worked in restaurants and clubs while pulling the odd TV spot or theatre role. He was spotted in a New York City production of \"Mister Roberts,\" signed to a TV contract, and eventually had recurring roles in such shows as Gunsmoke (1955), Riverboat (1959) and his own series, Hawk (1966). Reynolds continued to appear in undemanding western roles, often playing an Indian halfbreed, in films such as Navajo Joe (1966), 100 Rifles (1969) and Sam Whiskey (1969). However, it was his tough-guy performance as macho Lewis Medlock in the John Boorman backwoods nightmare Deliverance (1972) that really stamped him as a bona-fide star. Reynolds' popularity continued to soar with his appearance as a no-nonsense private investigator in Shamus (1973) and in the Woody Allen comedy Everything You Always Wanted to Know About Sex * But Were Afraid to Ask (1972). Building further on his image as a Southern boy who outsmarts the local lawmen, Reynolds packed fans into theaters to see him in White Lightning (1973), The Longest Yard (1974), W.W. and the Dixie Dancekings (1975) and Gator (1976). At this time, ex-stuntman and longtime Reynolds buddy Hal Needham came to him with a \"road film\" script. It turned out to be the incredibly popular Smokey and the Bandit (1977) with Sally Field and Jerry Reed, which took in over $100 million at the box office. That film's success was followed by Smokey and the Bandit II (1980) and Smokey and the Bandit Part 3 (1983). Reynolds also appeared alongside Kris Kristofferson in the hit football film Semi-Tough (1977), with friend Dom DeLuise in the black comedy The End (1978) (which Reynolds directed), in the stunt-laden buddy film Hooper (1978) and then in the self-indulgent, star-packed road race flick The Cannonball Run (1981). The early 1980s started off well with a strong performance in the violent cop film Sharky's Machine (1981), which he also directed, and he starred with Dolly Parton in The Best Little Whorehouse in Texas (1982) and with fellow macho superstar Clint Eastwood in the coolly received City Heat (1984). However, other projects such as Stroker Ace (1983), Stick (1985) and Paternity (1981) failed to catch fire with fans and Reynolds quickly found himself falling out of popularity with movie audiences. In the late 1980s he appeared in only a handful of films, mostly below average, before his old friend television came to the rescue and he shone again in two very popular TV shows, B.L. Stryker (1989) and Evening Shade (1990), for which he won an Emmy. He was back on screen, but still the roles weren't grabbing the public's attention, until his terrific performance as a drunken politician in the otherwise woeful Striptease (1996) and then another tremendous showing as a manipulative porn director in Boogie Nights (1997), which scored him a Best Supporting Actor nomination. Like the phoenix from the ashes, Reynolds had resurrected his popularity and, in the process, had gathered a new generation of young fans, many of whom had been unfamiliar with his 1970s film roles. He put in entertaining work in Pups (1999), Mystery, Alaska (1999), Driven (2001) and L'enfant et le loup (2002). Definitely one of Hollywood's most resilient stars, Reynolds has continually surprised all with his ability to weather both personal and career hurdles and his 40-plus years in front of the cameras is testament to his staying ability, his acting talent and his appeal to film audiences.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2Nzc1ODA1OF5BMl5BanBnXkFtZTcwMTc4MTc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000608","name":"Burt Reynolds","nicknames":["Buddy"],"idIMDB":"nm0000608"},"actorId":"nm0000608","character":"Lewis","urlCharacter":"http://www.imdb.com/character/ch0062651","main":true},{"actorName":"Ned Beatty","urlProfile":"http://www.imdb.com/name/nm0000885","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMzQ2Mzc3MF5BMl5BanBnXkFtZTYwMDIwMDM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 July 1937","placeOfBirth":" Louisville, Kentucky, USA","birthName":"Ned Thomas Beatty","height":"5' 7\" (1.7 m)","bio":"Stocky, genial-looking supporting actor Ned Beatty was once hailed by Daily Variety as the \"busiest actor in Hollywood\". Ned Thomas Beatty was born in Louisville, Kentucky, to Margaret (Fortney) and Charles William Beatty. He grew up fishing and working on farms. His hometown of St. Matthews, Kentucky, is hardly the environment to encourage a career in the entertainment industry, though, so when asked, \"How did you get into show business?\" Beatty responds, \"By hanging out with the wrong crowd.\" That \"crowd\" includes some of the industry's most prominent names, such as John Huston, Steven Spielberg, Robert Altman, Paul Newman, Richard Burton, Charlton Heston, Marlon Brando and Robert Redford. Beatty has garnered praise from both critics and peers as a dedicated actor's actor. He started as a professional performer at age ten, when he earned pocket money singing in gospel quartets and a barber shop. The big city and bright lights did not come easy, though. The first ten years of Beatty's career were spent at the Barter Theater in Abingdon, Virginia. He then moved on to the Erie Playhouse in Pennsylvania, the Playhouse Theater in Houston, Texas, and the prestigious Arena Stage Company in Washington, D.C. He was also a member of Shakespeare in Central Park, Louisville, Kentucky. Later, he appeared in the Broadway production of \"The Great White Hope\". At the Mark Taper Forum in Los Angeles, he won rave reviews when he starred in \"The Accidental Death of an Anarchist\". In 1971, Beatty was chosen by director John Boorman for the role of Bobby Trippe in the hit film/backwoods nightmare Deliverance (1972). Co-star Burt Reynolds and Beatty struck up a friendship together, and Ned has since been cast by Burt in several other films together, including White Lightning (1973), W.W. and the Dixie Dancekings (1975), and the abysmal Stroker Ace (1983). Ned's talents were also noticed by others in Hollywood and he was cast in many key productions of the 1970s turning in stellar performance, including an Academy Award nomination of Best Supporting Actor for his role in Network (1976). Beatty was also marvelous in Nashville (1975), under fire from a crazed sniper in The Deadly Tower (1975), an undercover FBI man in the action/comedy Silver Streak (1976), as Lex Luthor's bumbling assistant, Otis, in the blockbuster Superman (1978)... and he returned again with Gene Hackman to play Otis and Lex Luthor again in Superman II (1980). Beatty continued to remain busy throughout the 1980s with appearances in several big budget television productions including Les derniers jours de Pompéi (1984). However, the overall caliber of the productions in general did not match up to those he had appeared in during the 1970s. Nonetheless, Beatty still shone in films including The Big Easy (1986) and The Fourth Protocol (1987). Into the 1990s, Beatty's work output swung between a mixture of roles in family orientated productions (Gulliver's Travels (1996), Back to Hannibal: The Return of Tom Sawyer and Huckleberry Finn (1990), etc.) taking advantage of his \"fatherly\" type looks, but he could still accentuate a hard edge, and additionally was cast in Radioland Murders (1994) and Just Cause (1995). His many other films include The Toy (1982), All the President's Men (1976), Wise Blood (1979), Rudy (1993), Spring Forward (1999), Hear My Song (1991) -- for which he earned a Golden Globe nomination for Best Supporting Actor -- Prelude to a Kiss (1992), He Got Game (1998) and Cookie's Fortune (1999). Beatty's numerous television credits include three years on the NBC series Homicide: Life on the Street (1993), Streets of Laredo (1995), and The Boys (1993). Beatty received an Emmy Award nomination for Best Actor for his performance in Friendly Fire (1979) opposite Carol Burnett, and a Best Supporting Actor nomination for Family Channel's Last Train Home (1989). Other notable credits include The Wool Cap (2004), The Execution of Private Slovik (1974), A Woman Called Golda (1982), Pray TV (1982), the miniseries Robert Kennedy and His Times (1985), Lockerbie: A Night Remembered (1998) and T Bone N Weasel (1992). He also had a recurring role on Roseanne (1988) and performed musically on television specials for Dolly Parton and The Smothers Brothers. In 2001, Beatty returned to his theatrical roots starring in London's West End revival production of Tennessee Williams' \"Cat on a Hot Tin Roof\" with Brendan Fraser. He also appeared in the production on Broadway in 2003/2004 with Jason Patric and Ashley Judd. In 2006, Beatty completed three features to be released next year: The Walker (2007); a Paul Schrader film also starring Woody Harrelson, Kristin Scott Thomas, and Lily Tomlin; Paramount's Shooter (2007) starring Mark Wahlberg; and Charlie Wilson's War (2007), a Mike Nichols film with Tom Hanks, Philip Seymour Hoffman and Julia Roberts. Blessed with eight children, Beatty enjoys golf and playing the bass guitar. He gives himself until the age of 70 to become proficient at both. Also in the 21st century, Beatty turned out a terrific performance in the popular Where the Red Fern Grows (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMzQ2Mzc3MF5BMl5BanBnXkFtZTYwMDIwMDM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000885","name":"Ned Beatty","nicknames":["The busiest actor in Hollywood"],"idIMDB":"nm0000885"},"actorId":"nm0000885","character":"Bobby","urlCharacter":"http://www.imdb.com/character/ch0122393","main":true},{"actorName":"Ronny Cox","urlProfile":"http://www.imdb.com/name/nm0001074","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMjAzNTI0M15BMl5BanBnXkFtZTcwNTA1MjcyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1938","placeOfBirth":" Cloudcroft, New Mexico, USA","birthName":"Daniel Ronald Cox","height":"6' 2\" (1.88 m)","bio":"Ronny Cox is a superbly talented actor, singer-songwriter and musician who has been consistently active in Hollywood for over 40 years portraying a diverse range of characters. Born in Cloudcroft, New Mexico, Cox received positive reviews in his first film role for his portrayal of ill-fated businessman Drew Ballinger in the terrifying backwoods thriller Deliverance (1972) with Cox featuring in the entertaining \"Duelling Banjos\" sequence of the film. Following this promising start, Cox was regularly guest-starring in numerous television series, before scoring the lead in the short-lived family drama Apple's Way (1974) and grabbing the critics attention again with an excellent performance in the Emmy nominated telemovie A Case of Rape (1974). Interestingly, Cox was often at his best playing rigorous authority figures usually in law enforcement or military roles including as a detective in the telemovie Who Is the Black Dahlia? (1975), alongside Charlton Heston in the submarine drama Gray Lady Down (1978), an Los Angeles detective pursuing cop killers in The Onion Field (1979), and alongside then-rising stars Tom Cruise and Sean Penn in the powerful Taps (1981). The 1980s was a high profile decade for Cox with strong supporting roles in several blockbusters playing strong-willed figures on both sides of the law. Cox starred alongside box office sensation Eddie Murphy in the mega-hit Beverly Hills Cop (1984) and its sequel Beverly Hills Cop II (1987), as well as portraying sinister company executives in the futuristic sci-fi action films RoboCop (1987) and Total Recall (1990). Throughout the 1990s, Cox was again prolific, appearing in many television series, feature films and high-caliber telemovies - He took control of the USS Enterprise for two episodes as Captain Edward Jellico in Star Trek: The Next Generation (1987), and Cox contributed entertaining performances in Murder at 1600 (1997), Early Edition (1996), Forces of Nature (1999) and the chilling tale Perfect Murder, Perfect Town: JonBenét and the City of Boulder (2000). Cox has continued to remain busy with more recent performances in Stargate SG-1 (1997), Law & Order: Special Victims Unit (1999) and the highly popular Desperate Housewives (2004). However, when he's not in front of the cameras, Cox can be found touring and demonstrating his musical talents at various music festivals and theatre shows and, to-date, he has released five CDs - an eclectic mixture of jazz, folk and western tunes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMjAzNTI0M15BMl5BanBnXkFtZTcwNTA1MjcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001074","name":"Ronny Cox","idIMDB":"nm0001074"},"actorId":"nm0001074","character":"Drew","urlCharacter":"http://www.imdb.com/character/ch0122394","main":true},{"actorName":"Ed Ramey","urlProfile":"http://www.imdb.com/name/nm0708200","urlPhoto":"","biography":{"bio":"Ed Ramey was an actor, known for Deliverance (1972). He died on January 1, 1984 in Georgia, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0708200","name":"Ed Ramey","idIMDB":"nm0708200"},"actorId":"nm0708200","character":"Old Man","urlCharacter":"http://www.imdb.com/character/ch0206906","main":true},{"actorName":"Billy Redden","urlProfile":"http://www.imdb.com/name/nm0714681","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4OTQ1NzcxNl5BMl5BanBnXkFtZTcwNjE2NzYxOA@@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1956","placeOfBirth":"","bio":"Billy Redden was born in 1956. He is an actor, known for Deliverance (1972), Big Fish (2003) and Outrage: Born in Terror (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4OTQ1NzcxNl5BMl5BanBnXkFtZTcwNjE2NzYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0714681","name":"Billy Redden","idIMDB":"nm0714681"},"actorId":"nm0714681","character":"Lonnie","urlCharacter":"http://www.imdb.com/character/ch0206905","main":true},{"actorName":"Seamon Glass","urlProfile":"http://www.imdb.com/name/nm0322005","urlPhoto":"","biography":{"dateOfBirth":"26 September 1925","placeOfBirth":" Brooklyn, New York, USA","height":"6' 3\" (1.91 m)","bio":"Seamon Glass was born on September 26, 1925 in Brooklyn, New York, USA. He is known for his work on Deliverance (1972), This Is Not a Test (1962) and The Rose (1979). He was married to Yan Zhang. He died on July 12, 2016 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0322005","name":"Seamon Glass","idIMDB":"nm0322005"},"actorId":"nm0322005","character":"First Griner","urlCharacter":"http://www.imdb.com/character/ch0206907","main":true},{"actorName":"Randall Deal","urlProfile":"http://www.imdb.com/name/nm0212655","urlPhoto":"","biography":{"birthName":"Randall Leece Deal","bio":"Randall Deal was born as Randall Leece Deal. He is an actor, known for Deliverance (1972) and Baker County, U.S.A. (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0212655","name":"Randall Deal","idIMDB":"nm0212655"},"actorId":"nm0212655","character":"Second Griner","urlCharacter":"http://www.imdb.com/character/ch0206908","main":true},{"actorName":"Bill McKinney","urlProfile":"http://www.imdb.com/name/nm0571853","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNzAxMzQ3NjZeQTJeQWpwZ15BbWU4MDAxMjYzNDIx._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1931","placeOfBirth":" Chattanooga, Tennessee, USA","birthName":"William Denison McKinney","height":"5' 10\" (1.78 m)","bio":"Bill McKinney, the movie and television character actor who was one of the great on-screen villains, was born in Chattanooga, Tennessee on September 12, 1931. He had an unsettled life as a child, moving 12 times before joining the Navy at the age of 19 during the Korean War. Once, when his family moved from Tennessee to Georgia, he was beaten by a local gang and thrown into a creek for the offense of being from the Volunteer State. In his four years on active duty in the Navy, McKinney served two years on a mine sweeper in Korean waters. He was also stationed at Port Hueneme in Ventura County, California, and he would journey to nearby Los Angeles while on liberty from his ship. During his years in the Navy, McKinney decided he wanted to be an actor and would make it his life if he survived the Korean War. Discharged in Long Beach, California, in 1954, McKinney settled in southern California. He attended acting school at the famous Pasadena Playhouse in 1957, and his classmates included Dustin Hoffman and Mako. McKinney supported himself as an arborist, trimming and taking down trees, a job he continued into the 1970s, when he was appearing in major films. McKinney has had a life-long love affair with trees since he was a child. After his time at the Pasadena Playhouse, McKinney was admitted to Lee Strasberg's Actors Studio. He made his movie debut in the exploitation picture, She Freak (1967), and was busy on television, making his debut in 1968 on The Monkees (1966) and attracting attention as \"Lobo\" on Alias Smith and Jones (1971). But it was as the Mountain Man in John Boorman's Deliverance (1972), a movie nominated for Best Picture of 1972 at the Academy Awards, that brought McKinney widespread attention and solidified his reputation as one of moviedom's all-time most heinous screen villains. In his autobiography, McKinney's Deliverance (1972) co-star, Burt Reynolds (whose character dispatches The Mountain Man with an arrow in the back) said of McKinney, \"I thought he was a little bent. I used to get up at five in the morning and see him running nude through the golf course while the sprinklers watered the grass....\" McKinney denies this, and also disputes Reynolds contention that he was overly enthusiastic playing the infamous scene where his character buggers Ned Beatty. \"He always played sickos\", Reynolds said of McKinney, \"but he played them well. With my dark sense of humor, I was kind of amused by him.... McKinney turned out to be a pretty good guy who just took the method way too far\". McKinney told Maxim magazine in an interview honoring him and his Mountain Man partner 'Herbert \"Cowboy\" Coward' as the #1 screen villains of all time that Reynolds' stories were untrue. \"If you lose control on a movie set\", McKinney told Maxim, \"it's not acting, it's indulgence\". McKinney's wild-and-reckless screen persona and penchant for on-screen villainy attracted offers from A-list directors, which is a testament to his professionalism. He began appearing in films directed by top directors: Sam Peckinpah's Junior Bonner (1972), John Huston's The Life and Times of Judge Roy Bean (1972), Peter Yates's For Pete's Sake (1974) and, most chillingly, as the assassin in Alan J. Pakula's The Parallax View (1974). (One director who did not hire him was Stanley Kubrick, who had considered him for the role of the Marine drill instructor in Full Metal Jacket (1987) but demurred as he thought he came across as too scary after screening \"Deliverance\".) McKinney also appeared in the classic TV movie, The Execution of Private Slovik (1974), while guest-starring on some of the top TV shows, including Baretta: He'll Never See Daylight (1975) and Columbo (1971). It was on the set working for a new director, who would go on to win an Oscar that McKinney made a fateful connection. He played the aptly named \"Crazy Driver\" in Michael Cimino's Thunderbolt and Lightfoot (1974), starring Clint Eastwood. McKinney became part of the Eastwood stock company and enjoyed one of his best roles as the commander of the Red Legs in The Outlaw Josey Wales (1976), under the direction of Eastwood, himself. McKinney appeared in another six Eastwood films from The Gauntlet (1977) to Pink Cadillac (1989), when the Eastwood stock company disbanded, and had another terrific turn in Eastwood's well-reviewed Bronco Billy (1980), this time playing a member of Bronco Billy's circus, a character that was neither crazy, demented or odd. The Outlaw Josey Wales (1976), which Orson Welles praised as an extremely well-directed film at a time when respectable critics did not associate Clint Eastwood with art, let alone craftsmanship, and Bronco Billy (1980), which was a hit with the critics but not with Eastwood fans, established the laconic superstar's reputation as a director, and McKinney was in both films. In the mid-'70s, McKinney also was a memorable misanthrope as 'Ron Howard''s employer who is done in by John Wayne's The Shootist (1976) in the eponymous film directed by Don Siegel, Eastwood's mentor. Other memorable movies that McKinney has appeared in during his career include the initial Rambo film, First Blood (1982), Against All Odds (1984), Heart Like a Wheel (1983), Back to the Future Part III (1990) and The Green Mile (1999). He never retired, continuing to act into his late seventies. He also performed as a singer and recorded a CD, \"Love Songs from Antry\", featuring Sinatra-like numbers and some country & western tunes. Bill McKinney died on December 1, 2011 in Van Nuys, California from cancer of the esophagus. He was 80 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAzNzAxMzQ3NjZeQTJeQWpwZ15BbWU4MDAxMjYzNDIx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0571853","name":"Bill McKinney","idIMDB":"nm0571853"},"actorId":"nm0571853","character":"Mountain Man","urlCharacter":"http://www.imdb.com/character/ch0010924","main":true},{"actorName":"Herbert 'Cowboy' Coward","urlProfile":"http://www.imdb.com/name/nm0184662","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI2NzU1OTc2MF5BMl5BanBnXkFtZTcwMDM5NDUzMQ@@._V1_UY44_CR19,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 August 1938","placeOfBirth":" South Carolina, USA","height":"6' (1.83 m)","bio":"Herbert 'Cowboy' Coward was born on August 21, 1938 in South Carolina, USA. He is an actor and producer, known for Deliverance (1972), Ghost Town: The Movie (2007) and Behind the Scenes of 'Ghost Town: The Movie' (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI2NzU1OTc2MF5BMl5BanBnXkFtZTcwMDM5NDUzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0184662","name":"Herbert 'Cowboy' Coward","nicknames":["The Cowboy"],"idIMDB":"nm0184662"},"actorId":"nm0184662","character":"Toothless Man","urlCharacter":"http://www.imdb.com/character/ch0122461","main":true},{"actorName":"Lewis Crone","urlProfile":"http://www.imdb.com/name/nm0188707","urlPhoto":"","biography":{"dateOfBirth":"2 January 1938","placeOfBirth":" USA","birthName":"Lewis Franklin Crone","bio":"Lewis Crone was born on January 2, 1938 in the USA as Lewis Franklin Crone. He was an actor, known for Deliverance (1972). He died on April 22, 1988 in Florida, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0188707","name":"Lewis Crone","idIMDB":"nm0188707"},"actorId":"nm0188707","character":"First Deputy","urlCharacter":"http://www.imdb.com/character/ch0261841","main":true},{"actorName":"Ken Keener","urlProfile":"http://www.imdb.com/name/nm0444757","urlPhoto":"","biography":{"bio":"Ken Keener is an actor, known for Deliverance (1972).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0444757","name":"Ken Keener","idIMDB":"nm0444757"},"actorId":"nm0444757","character":"Second Deputy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Johnny Popwell","urlProfile":"http://www.imdb.com/name/nm0691622","urlPhoto":"","biography":{"dateOfBirth":"17 November 1937","placeOfBirth":" Atlanta, Georgia, USA","bio":"Johnny Popwell was born on November 17, 1937 in Atlanta, Georgia, USA. He is an actor, known for Deliverance (1972), Freejack (1992) and The Heart Is a Lonely Hunter (1968).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0691622","name":"Johnny Popwell","idIMDB":"nm0691622"},"actorId":"nm0691622","character":"Ambulance Driver","urlCharacter":"http://www.imdb.com/character/ch0261842","main":true},{"actorName":"John Fowler","urlProfile":"http://www.imdb.com/name/nm1592176","urlPhoto":"","biography":{"dateOfBirth":"6 July 1932","placeOfBirth":" Elbert County, Georgia, USA","bio":"John Fowler was born on July 6, 1932 in Elbert County, Georgia, USA. He is known for his work on Deliverance (1972). He died on March 28, 2003 in Clayton, Georgia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1592176","name":"John Fowler","idIMDB":"nm1592176"},"actorId":"nm1592176","character":"Doctor","urlCharacter":"http://www.imdb.com/character/ch0206912","main":true},{"actorName":"Kathy Rickman","urlProfile":"http://www.imdb.com/name/nm0725558","urlPhoto":"","biography":{"bio":"Kathy Rickman is an actress, known for Deliverance (1972), Grizzly (1976) and Opening Day (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0725558","name":"Kathy Rickman","idIMDB":"nm0725558"},"actorId":"nm0725558","character":"Nurse","urlCharacter":"http://www.imdb.com/character/ch0206913","main":true}],"seasons":[],"idIMDB":"tt0068473","urlIMDB":"http://www.imdb.com/title/tt0068473","business":{"budget":{"money":"$2,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"$46,122,355 (USA)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"SEK","country":"1,443,730","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1971/\">1971</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 49 min (109 min)"],"soundMix":["70 mm 6-Track (70 mm prints)","Mono (35 mm prints)"],"color":["Color (Technicolor)"],"aspectRatio":["2.20 : 1 (70 mm prints)","2.35 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Technicolor, USA"],"filmLength":["3,010 m (Sweden)"],"negativeFormat":["35 mm (Eastman 100T 5254)"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["70 mm (blow-up)","35 mm"]},"rating":"7.7","filmingLocations":[{"location":"Beaufort, South Carolina, USA"}],"rated":"R","awards":[{"award":"Academy Awards, USA 1973","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Picture","names":[{"name":"John Boorman","id":"nm0000958","role":null}]},{"category":"Best Director","names":[{"name":"John Boorman","id":"nm0000958","role":null}]},{"category":"Best Film Editing","names":[{"name":"Tom Priestley","id":"nm0697371","role":null}]}]}]},{"award":"Golden Globes, USA 1973","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Motion Picture - Drama","names":[]},{"category":"Best Actor in a Motion Picture - Drama","names":[{"name":"Jon Voight","id":"nm0000685","role":null}]},{"category":"Best Director - Motion Picture","names":[{"name":"John Boorman","id":"nm0000958","role":null}]},{"category":"Best Screenplay - Motion Picture","names":[{"name":"James Dickey","id":"nm0225463","role":null}]},{"category":"Best Original Song - Motion Picture","names":[{"name":"Arthur Smith","id":"nm0807369","role":"music"},{"name":"Steve Mandel","id":"nm1300864","role":"adaptation"},{"name":"Eric Weissberg","id":"nm0918716","role":"adaptation"}]}]}]},{"award":"BAFTA Awards 1973","titlesAwards":[{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best Film Editing","names":[{"name":"Tom Priestley","id":"nm0697371","role":null}]},{"category":"Best Sound Track","names":[{"name":"Jim Atkinson","id":"nm0040742","role":null},{"name":"Walter Goss","id":"nm0331586","role":null},{"name":"Doug E. Turner","id":"nm0877518","role":null}]},{"category":"Best Cinematography","names":[{"name":"Vilmos Zsigmond","id":"nm0005936","role":null},{"name":"McCabe & Mrs. Miller","id":"tt0067411","role":null},{"name":"Images","id":"tt0068732","role":null}]}]}]},{"award":"Directors Guild of America, USA 1973","titlesAwards":[{"titleAwardOutcome":"Nominated DGA Award","categories":[{"category":"Outstanding Directorial Achievement in Motion Pictures","names":[{"name":"John Boorman","id":"nm0000958","role":null}]}]}]},{"award":"National Board of Review, USA 1972","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Top Ten Films","names":[]}]}]},{"award":"National Film Preservation Board, USA 2008","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"","names":[]}]}]},{"award":"Writers Guild of America, USA 1973","titlesAwards":[{"titleAwardOutcome":"Nominated WGA Award (Screen)","categories":[{"category":"Best Drama Adapted from Another Medium","names":[{"name":"James Dickey","id":"nm0225463","role":null}]}]}]}],"votes":"81,786","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0229197","name":"Elmer Enterprises"}],"keywords":{"keywords":["inbreeding","nature","river","trip","nightmare","georgia","canoeing","wilderness","canoe","battle","survival","redneck","hillbilly","buttocks","male on male rape","rear male nudity","rear nudity","psychological horror","forced to strip","group of friends","man with glasses","redneck stereotype","survivalist","rural setting","rapids","mosquito bite","lodge","irony","gorge","disinterment","cultural difference","cliff","businessman","bug spray","backhoe","bolt upright after nightmare","rotten teeth","author cameo","cult film","rape victim","survivor","southern gothic","culture clash","cross cultural relations","dislocated shoulder","survival horror","one word title","famous line","friendship","death","climbing","autism","spanking","public nudity","public humiliation","male rear nudity","gay interest","crossbow","beating","abuse","tree","banjo player","male nudity","bare butt","very little dialogue","insurance agent","southern sheriff","interrogation","guilt","graveyard","family reunion","exhumation","burial","anal rape","underwater","sheriff","life jacket","guitar","male rape","dentures","bluegrass music","homosexual rape","male bonding","bow and arrow","bow hunting","broken leg","incest","moving a building","city country contrast","hunting","famous score","rape","river rapids","murder","white water rafting","boat","homosexuality","southern u.s.","shotgun","man against nature","camping","banjo","violence","backwoods","sodomy","cover up","based on book","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:47:20"}}