{"data":{"movies":[{"title":"The Telephone Book","originalTitle":"","year":"1971","releaseDate":"19711003","directors":[{"name":"Nelson Lyon","id":"nm0528962"}],"writers":[{"name":"Nelson Lyon","id":"nm0528962"}],"runtime":"80 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyZjhjYTctNDg1NS00M2IyLTkwYmUtNDkzN2Y5YmEyNzI4XkEyXkFqcGdeQXVyMjU5MTg2Mzk@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"The story of a day in the life of a lonely, sensitive, exhuberent, attractive, young woman. Her exploits, encounters, and frustrations as she attempts to find a \"special\" someone, a caller who has \"class\", as she puts it.","simplePlot":"Victim of an obscene caller becomes obsessed with her fantasy of ?him and attempts to track down IRL.","actors":[{"actorName":"Sarah Kennedy","urlProfile":"http://www.imdb.com/name/nm0448322","urlPhoto":"","biography":{"height":"5' (1.52 m)","bio":"Sarah Kennedy is an actress, known for The Telephone Book (1971), The Working Girls (1974) and Sammy Somebody (1976).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0448322","name":"Sarah Kennedy","idIMDB":"nm0448322"},"actorId":"nm0448322","character":"Alice","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Norman Rose","urlProfile":"http://www.imdb.com/name/nm0741596","urlPhoto":"","biography":{"dateOfBirth":"23 June 1917","placeOfBirth":" Philadelphia, Pennsylvania, USA","bio":"Norman Rose was born on June 23, 1917 in Philadelphia, Pennsylvania, USA. He was an actor, known for One Life to Live (1968), All My Children (1970) and The Man Behind the Badge (1953). He was married to Catherine Vagnoni. He died on November 12, 2004 in Upper Nyack, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0741596","name":"Norman Rose","idIMDB":"nm0741596"},"actorId":"nm0741596","character":"Mr. Smith","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Harder","urlProfile":"http://www.imdb.com/name/nm0362129","urlPhoto":"","biography":{"dateOfBirth":"19 November 1931","placeOfBirth":" USA","bio":"James Harder was born on November 19, 1931 in the USA. He was an actor, known for The Telephone Book (1971), Author! Author! (1982) and Paternity (1981). He was married to Dorothy Harder. He died on January 9, 2009 in Harwich, Massachusetts, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0362129","name":"James Harder","idIMDB":"nm0362129"},"actorId":"nm0362129","character":"Obscene-Caller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jill Clayburgh","urlProfile":"http://www.imdb.com/name/nm0001049","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NTgyNjg5MV5BMl5BanBnXkFtZTcwMTQ5OTYwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 April 1944","placeOfBirth":" New York City, New York, USA","height":"5' 8\" (1.73 m)","bio":"It came as no surprise to film aficionados when, in 1999, Entertainment Weekly named Jill Clayburgh on its list of Hollywood's 25 Greatest Actresses. For decades, she delivered stellar performances in a wide variety of roles. Jill Clayburgh was born in 1944 in New York City, into a wealthy family, the daughter of Julia Louise (Dorr), an actress and secretary, and Albert Henry Clayburgh, a manufacturing executive. Her father was from a Jewish family that has lived in the United States since the 1700s, and her mother had English ancestry, also with deep American roots. Jill was educated at the finest schools, including the Brearley School and Sarah Lawrence College. It was while at Sarah Lawrence that she decided on a career in acting, and joined the famous Charles Street Repetory Theater in Boston. She moved to New York in the late 1960s and had featured roles in a number of Broadway productions, including \"The Rothschilds\" and \"Pippin\". She began her career in films in 1970 and got her first major role in Portnoy's Complaint (1972) in 1972. In 1978, she rose to screen prominence with her performance in An Unmarried Woman (1978), for which she received an Oscar nomination. She was again nominated for the Academy Award in 1979 for her role in Starting Over (1979). But after giving a riveting portrayal as a Valium addict in I'm Dancing as Fast as I Can (1982), her career went into a rapid decline, mainly because of her poor choices of scripts. She seemed destined for a comeback after appearing in Where Are the Children? (1986), with multi-talented child actress Elisabeth Harnois, but her excellent performance was largely ignored by critics, who opted to give the credit for the thriller's success to the performance of the precocious, six year old Harnois. After the late 1980s, Jill worked mainly in television and low-budget films, and also had a leading role in the drama Never Again (2001), with Jeffrey Tambor. Jill was married to playwright David Rabe, with whom she had two children, including actress Lily Rabe. Jill Clayburgh died of chronic lymphocytic leukemia on November 5, 2010, in Salisbury, Connecticut.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NTgyNjg5MV5BMl5BanBnXkFtZTcwMTQ5OTYwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001049","name":"Jill Clayburgh","idIMDB":"nm0001049"},"actorId":"nm0001049","character":"Eyemask","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ondine","urlProfile":"http://www.imdb.com/name/nm0648557","urlPhoto":"","biography":{"dateOfBirth":"16 June 1937","placeOfBirth":"","birthName":"Robert Olivo","bio":"Ondine, one of Andy Warhol's cinema superstars of the Sixties, was born Robert Olivio on June 16, 1937. He first met Warhol at an orgy held around 1961 or '62, and was dismayed by Warhol's failure to join in. He proceeded to kick Warhol out, not knowing who he was or understanding that the future titan of Pop Art essentially was a voyeur. He was christened with his professional name upon coming out of the water at the beach (an \"undine\" is a water spirit). Warhol began making \"underground\" movies in 1963, and Ondine began appearing in Warhol's oeuvre in 1964. Ondine made his debut in the free-form Couch (1964) and then appeared in the homage Batman Dracula (1964) Warhol's 18th and 20th films, respectively, as a director. Ondine appeared in seven more Warhol films, including Warhol's most successful film of the 1960s, Chelsea Girls (1966) as \"Pope Ondine.\" Ondine was known as the Pope of Warhol's entourage due to his brilliant, speed-fueled conversation, which Warhol frequently tape-recorded. Based on the transcriptions of 24 one-hours tapes, Warhol published \"A: A Novel\" with the Grove Press in 1968, purportedly 24-hours in the life of Ondine. Ondine appeared in his last film for Warhol in 1968, \"The Loves of Ondine.\" a fictional chronicle of the gay Ondine attempting to go \"straight.\" He was supposed to appear in Warhol's \"Loneseome Cowboys,\" but never showed up at the Arizona locale where the film was shot. Subsequently, he was banned from \"The Factory\" (Warhol's loft-living/working space) due to his bad temper, though the two remained friends. In later years, Ondine supported himself by showing Warhol films and delivering a lecture on his days as a Warhol \"superstar\" on the college circuit. He died of liver disease in Queens, New York, New York, in 1989.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0648557","name":"Ondine","idIMDB":"nm0648557"},"actorId":"nm0648557","character":"Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barry Morse","urlProfile":"http://www.imdb.com/name/nm0607579","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTQyMjMyMV5BMl5BanBnXkFtZTgwMzU2OTEyMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1918","placeOfBirth":" London, England, UK","birthName":"Herbert Morse","height":"5' 10\" (1.78 m)","bio":"Born in London's East End, Barry's career began when he won a full scholarship to the Royal Academy of Dramatic Art at the age of 15. Upon graduation, he followed with successful stage runs in London's West End and in theatrical productions throughout the United Kingdom, and appeared on the BBC's earliest live television broadcasts in the late 1930s. Barry relocated to Canada in the early 1950s, working in live theatre, on CBC Radio, and in the premiere CBC-TV broadcasts. While a staple in many of the anthology and dramatic series of the 1950s and 1960s, he is probably best known in North America for his TV roles as \"Lt. Philip Gerard\" in The Fugitive (1963) and as \"Prof. Victor Bergman\" in Space: 1999 (1975). A journalist once determined that Barry had played more than 3,000 roles on the stage, screen, and radio in a career spanning eight decades.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4OTQyMjMyMV5BMl5BanBnXkFtZTgwMzU2OTEyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0607579","name":"Barry Morse","idIMDB":"nm0607579"},"actorId":"nm0607579","character":"Har Poon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ultra Violet","urlProfile":"http://www.imdb.com/name/nm0899216","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTZlMmNiYmMtZWVkZS00OTZjLWI5YzMtZWVjODE0MzYzZWM0XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1935","placeOfBirth":" Grenoble, France","birthName":"Isabelle Collin Dufresne","bio":"Underground celebrity Ultra Violet was born Isabelle Collin Dufresne in 1935 in France, a convent-raised French bourgeois heiress. A coiffured society deb in those days, she moved to New York in 1953 where she spent a decade surrounding herself with artists like John Graham, John Chamberlain, and Salvador Dalí, the last with whom triggered her career as a painter. It was through her relationship with Dali that she eventually met pop icon Andy Warhol in the early 1960's and changed her name to Ultra Violet, evolving into one of Warhol's more accessible and unforgettable trashy-chic East 47th Street \"Factory\" superstars. An exotic vamp in style and attitude, Ultra Violet seemed to pick up quite a bit of makeup tips from silent star Theda Bara and went on to appear in Warhol's The Life of Juanita Castro (1965) and I, a Man (1967) before her cameo inclusions in other now-cult films. Her best-selling 1988 autobiography \"Famous for Fifteen Minutes: My Years with Andy Warhol\" detailed her rise in celebrity, and her play \"You Are What You Eat\" was performed in Czechoslovakia in 1992. As a visual artist with political and spiritual overtones, her mixed-media works have been displayed worldwide. She opened an art studio in Nice in 1990, creating a movement called \"L'Ultratique,\" publishing two manifestos in the early 1990's. Her work was included in the Audart exhibition that commemorated the tenth anniversary of Warhol's death. A bi-continental resident, Ultra Violet currently divides her time between her studio in Nice and her penthouse apartment in Manhattan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTZlMmNiYmMtZWVkZS00OTZjLWI5YzMtZWVjODE0MzYzZWM0XkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0899216","name":"Ultra Violet","idIMDB":"nm0899216"},"actorId":"nm0899216","character":"Whip Woman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Geri Miller","urlProfile":"http://www.imdb.com/name/nm0588399","urlPhoto":"","biography":{"bio":"Geri Miller is an actress, known for Trash (1970), Daughters of Lesbos (1968) and Flesh (1968).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0588399","name":"Geri Miller","idIMDB":"nm0588399"},"actorId":"nm0588399","character":"Dancer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roger C. Carmel","urlProfile":"http://www.imdb.com/name/nm0138354","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3OTEyNTUyOV5BMl5BanBnXkFtZTcwNzAzMDIyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 September 1932","placeOfBirth":" Brooklyn, New York, USA","birthName":"Roger Charles Carmel","height":"6' 3\" (1.91 m)","bio":"Roger C. Carmel, who was born September 27, 1932, was named after his grandfather, Roger Charles, who carved the horses for the carousel in New York's Central Park. He became an actor and won television immortality by appearing as Harry Mudd in two classic \"Star Trek\" episodes, \"I, Mudd\" and \"Mudd's Women.\" Carmel was one of the few actors, other than the regulars, to appear in two episodes of \"Star Trek\" as the same character. After appearing on stage, Carmel began working steadily on television in the early 1960s as a character actor, appearing on both dramas (\"Route 66\") and situation-comedies (\"The Dick Van Dyke Show\"). The highlight of Carmel's non \"Star Trek\" acting career came in 1967, when he was cast as Kay Ballard's husband in the TV situation comedy \"The Mothers in Law\" by Desi Arnaz, the Cuban-born actor and entertainment impresario's first production since I Love Lucy (1951). The network, NBC, was disappointed by the mediocre ratings of \"The Mothers-in-Law\" and almost canceled it. It picked the show up for a second season after rival network ABC expressed interest in the show, but the network informed Arnaz that they would not give any additional money for the show. Traditionally, salaries are increased when a TV show is picked up for a new season, and all the actors' contracts specifically called for raises in the event of renewal. Show creator Arnaz, who was also producer, director, and writer, called together the cast and crew and told them that although the series had been renewed, there was no money for salary increases. According to Carmel's own recollection, Arnaz was already drawing down multiple salaries on the program, and would shortly cast himself as a supporting character in the series, thus drawing another salary, although Carmel didn't know that at the time. Arnaz elicited a promise from the creative people, the crew and the actors to forgo salary increases to keep the show on the air. All the actors had agreed but one: Roger Carmel. He told Arnaz he would quit unless he received a raise, as per his contract. In a contemporaneous account of the incident, Carmel said, \"Desi called me and put it on a personal basis. I didn't feel it should be done that way - it was very unfair of him. Then Desi and the Morris Agency threatened I would be replaced. Kaye Ballard and Eve Arden also called me and asked me to go along, but I wouldn't.\" Arnaz's response to Carmel's ultimatum was dismissive. \"Where else is he going to make two thousand dollars a week?\" the producer asked rhetorically. If Arnaz's Desilu production company gave in to Carmel, it would be faced with giving all the cast members a raise, which was financially unviable with the money on offer from NBC. Arnaz was forced to terminate Carmel, who was replaced by fellow \"Dick Van Dyke Show\" alumnus Richard Deacon for the second season. The show had poor ratings and was canceled after its second season. After being fired from \"The Mothers-in-Law,\", Carmel's acting career suffered. Other than his Harry Mudd appearances, Carmel's most memorable gig on TV was as Colonel Gumm on \"Batman\" in 1967. He made regular appearances on the syndicated quiz TV show \"Stump The Stars\" from 1968 to 1970. Carmel even reprised his most famous role, that of Harry Mudd, in an episode of the animated version of \"Star Trek\" (1973-75), an indicator of the direction of his future career. However, during the 1970s, he could not secure another regular role as an ongoing character on a TV series, though he continued to appear regularly on sitcoms, mostly in ethnic roles, including appearances on \"All In The Family,\" \"Chico and The Man,\" and \"Three's Company.\" He also appeared in B-movie bombs, including the Jerry Lewis flop \"Hardly Working\" (1981). At the dawn of the new decade of the 1980s, Carmel finally got another opportunity for the first time in a dozen years, when he was cast as a regular on the network program \"Fitz and Bones.\" An hour-long drama starring the TV comedy-musical duo The Smothers Brothers as investigative reporters, the show was a ratings failure, lasting only one month. After this monumental flop (\"Fitz and Bones\" was the lowest-rated series for the entire 1981-82 season), character parts dried up and Carmel was reduced to doing voice-over work for children's cartoons, including \"The Transformers.\" Carmel's last triumph as an actor was in commercials. Carmel was a huge hit in advertising playing Senor Naugles, a faux-Mexican Colonel Sanders clone, for the West Coast region Mexican fast food chain Naugles. The commercials were a success and the chain began expanding rapidly. However, both the renewed success of Roger C. Carmel and the fresh success of the chain were, sadly, to prove short-lived. According to acquaintances, Carmel was struck by chest pains on the night he died and called a cab to take him to the hospital. When the cab showed up at his Hollywood high-rise but Carmel did not come down to get it, the doorman sent the cab away, never inquiring why he failed to appear. Carmel was found dead on the floor of his apartment the next morning, November 11, 1986. While there were rumors that he committed suicide (he was rumored to be a recreational drug user), the official cause of death was listed as hypertrophic cardiomyopathy, a disease of the heart muscle in which the organ becomes enlarged. The condition leads to congestive heart failure, which apparently is what struck down Carmel. He was only 54 years old. Roger C. Carmel's body was interred in Glendale, New York. After Carmel's death, Naugles failed to come up with another successful ad campaign, and eventually, its financial fortunes changed. It was eventually acquired by rival Del Taco.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3OTEyNTUyOV5BMl5BanBnXkFtZTcwNzAzMDIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0138354","name":"Roger C. Carmel","idIMDB":"nm0138354"},"actorId":"nm0138354","character":"Analyst","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Hickey","urlProfile":"http://www.imdb.com/name/nm0382676","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MTE3OTgwMF5BMl5BanBnXkFtZTcwMjg1NDgwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 September 1927","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"William Edward Hickey","height":"5' 6\" (1.68 m)","bio":"Son of Edward & Nora Hickey. Best known as the ancient Mafia don in Prizzi's Honor (1985), Hickey had a long, distinguished career in film, television, and the stage. Began career as a child actor on the variety stage. Made Broadway debut as walk-on in George Bernard Shaw's \"Saint Joan\" (1951 production, starring Uta Hagen). Performed often during the golden age of television, including appearances on Studio One and Philco Playhouse. His most important contribution to the arts, however, remains his teaching career at the HB Studio in Greenwich Village, founded by Hagen and Herbert Berghof. George Segal, Sandy Dennis, and Barbra Streisand all studied under him.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MTE3OTgwMF5BMl5BanBnXkFtZTcwMjg1NDgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0382676","name":"William Hickey","idIMDB":"nm0382676"},"actorId":"nm0382676","character":"Man in Bed","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matthew Tobin","urlProfile":"http://www.imdb.com/name/nm0864952","urlPhoto":"","biography":{"dateOfBirth":"10 August 1929","placeOfBirth":" Indianapolis, Indiana, USA","bio":"Matthew Tobin was born on August 10, 1929 in Indianapolis, Indiana, USA. He was an actor, known for Real Life (1979), The Front (1976) and Twirl (1981). He died on July 16, 2008 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0864952","name":"Matthew Tobin","idIMDB":"nm0864952"},"actorId":"nm0864952","character":"Mugger","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jan Farrand","urlProfile":"http://www.imdb.com/name/nm0268105","urlPhoto":"","biography":{"dateOfBirth":"1928","placeOfBirth":"","bio":"Jan Farrand was born in 1928. She was an actress, known for The Edge of Night (1956), The Telephone Book (1971) and The Lark (1957). She was married to Colin MacLachlan and Albert Marre. She died on November 4, 1980 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0268105","name":"Jan Farrand","idIMDB":"nm0268105"},"actorId":"nm0268105","character":"Woman in the Park","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Dozer","urlProfile":"http://www.imdb.com/name/nm0236531","urlPhoto":"","biography":{"bio":"David Dozer is an actor and writer, known for The Telephone Book (1971), Bloodbrothers (1978) and Young Doctors in Love (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0236531","name":"David Dozer","idIMDB":"nm0236531"},"actorId":"nm0236531","character":"Obscene-Caller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lucy Lee Flippin","urlProfile":"http://www.imdb.com/name/nm0282439","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5OTYwNTMyOF5BMl5BanBnXkFtZTcwODE5MTYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1943","placeOfBirth":" Philadelphia, Pennsylvania, USA","bio":"Lucy Lee Flippin was born on July 23, 1943. She appeared as the third obscene phone caller in the X-rated film, The Telephone Book (1971). With over 60 film and television appearances under her belt, she is best remembered as Eliza Jane Wilder in Little House on the Prairie (1974), Fran Castleberry in Flo (1980), and as Grace La Della in Lady in White (1988).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5OTYwNTMyOF5BMl5BanBnXkFtZTcwODE5MTYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0282439","name":"Lucy Lee Flippin","idIMDB":"nm0282439"},"actorId":"nm0282439","character":"Obscene-Caller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dolph Sweet","urlProfile":"http://www.imdb.com/name/nm0842248","urlPhoto":"","biography":{"dateOfBirth":"18 July 1920","placeOfBirth":" New York City, New York, USA","birthName":"Adolphus Jean Sweet","height":"5' 9\" (1.75 m)","bio":"A barrel-chested, bull-necked presence on stage, film and TV, the tough-minded character actor was born Adolphus Jean Sweet in New York City on July 18, 1920, the son of an auto mechanic. He initially attended the University of Alabama in 1939, but his studies were interrupted by WWII Air Force duty. As a navigator of B-24s, he was shot down during a raid and captured, spending two years as a POW in Germany. For his valor he was honored with the Distinguished Flying Cross and The Purple Heart. A semi-pro football player and a boxer at one point, he received his Masters from Columbia University in 1949 at age 29. He subsequently became the head of the drama division of the English Department at Barnard College from 1949 to 1961. During this period of time he studied voice with Peyton Hibbett, took intensive acting classes with Tamara Daykarhanova and Joseph Anthony at the Daykarhanova School for the Stage in New York City, and appeared in random stock productions in the hopes of one day pursuing a professional career full-time. The 40-something-year-old Sweet finally made his New York/Broadway debut in the Zero Mostel starrer \"Rhinoceros\" in 1961, and continued on the Great White Way with outstanding parts in \"Romulus\" (1962), \"The Sign in Sidney Brustein's Window in 1964 (and its 1972 revival) and \"Streamers\" in 1976. Making his TV debut with \"The Defenders\" in 1961, Dolph quickly became a veteran of blue-collar cop shows including \"East Side, West Side\" and \"The Trials of O'Brien.\" In the late 1960s he started making a dent in soap operas with regular roles on Dark Shadows (1966), The Edge of Night (1956), Somerset (1970) and especially Another World (1964), where he remained for five seasons (1972-1977) playing (of course) Police Chief Gil McGowan, the second husband of Constance Ford's beloved Ada Davis character. Dolph received rather scant notice for his film roles despite some good scenes in such movies as Fear Is the Key (1972) and Go Tell the Spartans (1978). TV proved to be a more accepting medium for the actor. He portrayed J. Edgar Hoover in the \"King\" miniseries in 1978 and in the early 1980s the portly character player won a change-of-pace comedy lead in the popular sitcom Gimme a Break! (1981) in which he played (naturally) a police chief, Carl Kanisky, a widower whose household was run by the irrepressible Nell Carter. During the show's run, Dolph was stricken with cancer and would die on May 8, 1985. At the beginning of the 1985-1986 season, the chief's passing was incorporated into the script and Nell became surrogate mother and father to his children. In real-life, the 64-year-old actor was survived by his second wife of 11 years, actress Iris Braun, and son Jonathan from his first marriage to Reba Gillespie, which ended in divorce in 1973.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0842248","name":"Dolph Sweet","idIMDB":"nm0842248"},"actorId":"nm0842248","character":"Obscene-Caller","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0067839","urlIMDB":"http://www.imdb.com/title/tt0067839","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"23","month":"03","year":"1970","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["1 hr 20 min (80 min)"],"soundMix":["Mono"],"color":["Black and White","Color (Eastmancolor)"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex Cameras and Lenses"],"laboratory":["Movielab, New York (NY), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.9","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"X","awards":[],"votes":"395","type":"Movie","companyCreditsSimple":[{"idCompany":"co0113106","name":"Rosebud Films"}],"keywords":{"keywords":["cartoon sex","stock footage","bleeped dialogue","vibrator","sexual innuendo","implied sex","priapism","exhibitionism","colt peacemaker revolver","vulgarity","breaking the fourth wall","breaking the fourth wall by talking to the audience","vignette","new york city","subway","face never shown","drawing of penis","mask","psychiatrist","ejaculation metaphor","john smith","erection","flashback","astronaut training","lawnmower","flashing breasts","cunnilingus","phallic symbol","part animation","banana","masturbation reference","phone sex operator","phone sex","pig mask","telephone","obscene telephone call","surrealism","cult film","sex","phone booth","phone book","orgy","obsession","female nudity","female frontal nudity","dark comedy","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:53:56"}}