{"data":{"movies":[{"title":"The Swan","originalTitle":"","year":"1925","releaseDate":"19250216","directors":[{"name":"Dimitri Buchowetzki","id":"nm0118266"}],"writers":[{"name":"Melville Baker","id":"nm0048758"},{"name":"Dimitri Buchowetzki","id":"nm0118266"}],"runtime":"85 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMzc1ODgzN15BMl5BanBnXkFtZTcwNzQxNjcyMQ@@._V1.jpg","countries":["USA"],"languages":[],"genres":["Comedy","Romance"],"simplePlot":"","actors":[{"actorName":"Frances Howard","urlProfile":"http://www.imdb.com/name/nm0397291","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDMyZWZjNWYtZDZmOS00ZDJhLThjZTgtZmEzOGE0ZGMwNDA0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 June 1903","placeOfBirth":" Omaha, Nebraska, USA","birthName":"Frances Howard McLaughlin","bio":"Frances Howard was born on June 4, 1903 in Omaha, Nebraska, USA as Frances Howard McLaughlin. She was an actress, known for The Swan (1925), Too Many Kisses (1925) and The Shock Punch (1925). She was married to Samuel Goldwyn. She died on July 2, 1976 in Beverly Hills, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDMyZWZjNWYtZDZmOS00ZDJhLThjZTgtZmEzOGE0ZGMwNDA0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0397291","name":"Frances Howard","idIMDB":"nm0397291"},"actorId":"nm0397291","character":"Alexandra, The Swan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Adolphe Menjou","urlProfile":"http://www.imdb.com/name/nm0579663","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NzgyMTE3M15BMl5BanBnXkFtZTYwNTIwMTM2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 February 1890","placeOfBirth":" Pittsburgh, Pennsylvania, USA","birthName":"Adolphe Jean Menjou","height":"5' 10½\" (1.79 m)","bio":"The words \"suave\" and \"debonair\" became synonymous with the name Adolphe Menjou in Hollywood, both on- and off-camera. The epitome of knavish, continental charm and sartorial opulence, Menjou, complete with trademark waxy black mustache, evolved into one of Hollywood's most distinguished of artists and fashion plates, a tailor-made scene-stealer, if you will. What is often forgotten is that he was primed as a matinée idol back in the silent-film days. With hooded, slightly owlish eyes, a prominent nose and prematurely receding hairline, he was hardly competition for Rudolph Valentino, but he did possess the requisite demeanor to confidently pull off a roguish and magnetic man-about-town. Fluent in six languages, Menjou was nearly unrecognizable without some type of formal wear, and he went on to earn distinction as the nation's \"best dressed man\" nine times. Born on February 18, 1890, in Pittsburgh, Pennsylvania, he was christened Adolphe Jean Menjou, the elder son of a hotel manager. His Irish mother was a distant cousin of novelist / poet James Joyce (\"Ulysses\") (1882-1941). His French father, an émigré, eventually moved the family to Cleveland, where he operated a chain of restaurants. He disapproved of show business and sent an already piqued Adolphe to Culver Military Academy in Indiana in the hopes of dissuading him from such a seemingly reckless and disreputable career. From there Adolphe was enrolled at Stiles University prep school and then Cornell University. Instead of acquiescing to his father's demands and obtaining a engineering degree, however, he abruptly changed his major to liberal arts and began auditioning for college plays. He left Cornell in his third year in order to help his father manage a restaurant for a time during a family financial crisis. From there he left for New York and a life in the theater. Adolphe toiled as a laborer, a haberdasher and even a waiter in one of his father's restaurants during his salad days, which included some vaudeville work. Oddly enough, he never made it to Broadway but instead found extra and/or bit work for various film studios (Vitagraph, Edison, Biograph) starting in 1915. World War I interrupted his early career, and he served as a captain with the Ambulance Corps in France. After the war he found employment off-camera as a productions manager and unit manager. When the New York-based film industry moved west, so did Adolphe. Nothing of major significance happened for the fledgling actor until 1921, an absolute banner year for him. After six years of struggle he finally broke into the top ranks with substantial roles in The Faith Healer (1921) and Through the Back Door (1921), the latter starring Mary Pickford. He formed some very strong connections as a result and earned a Paramount contract in the process. Cast by Mary's then-husband Douglas Fairbanks as Louis XIII in the rousing silent The Three Musketeers (1921), he finished off the year portraying the influential writer/friend Raoul de Saint Hubert in Rudolph Valentino's classic The Sheik (1921). Firmly entrenched in the Hollywood lifestyle, it took little time for Menjou to establish his slick prototype as the urbane ladies' man and wealthy roué. Paramount, noticing how Menjou stole scenes from Charles Chaplin favorite Edna Purviance in Chaplin's A Woman of Paris: A Drama of Fate (1923), started capitalizing on Menjou's playboy image by casting him as various callous and creaseless matinée leads in such films as Broadway After Dark (1924), Sinners in Silk (1924), The Ace of Cads (1926), A Social Celebrity (1926) and A Gentleman of Paris (1927). His younger brother Henri Menjou, a minor actor, had a part in Adolphe's picture Blonde or Brunette (1927). The stock market crash led to the termination of Adolphe's Paramount contract, and his status as leading man ended with it. MGM took him on at half his Paramount salary and his fluency in such languages as French and Spanish kept him employed at the beginning. Rivaling Gary Cooper for the attentions of Marlene Dietrich in Morocco (1930) started the ball rolling for Menjou as a dressy second lead. Rarely placed in leads following this period, he managed his one and only Oscar nomination for \"Best Actor\" with his performance as editor Walter Burns in The Front Page (1931). Not initially cast in the role, he replaced Louis Wolheim, who died ten days into rehearsal. Quality parts in quality pictures became the norm for Adolphe during the 1930s, with outstanding roles given him in The Great Lover (1931), A Farewell to Arms (1932), Forbidden (1932), Little Miss Marker (1934), Morning Glory (1933), A Star Is Born (1937), Stage Door (1937) and Golden Boy (1939). The 1940s were not as golden, however. In addition to entertaining the troops overseas and making assorted broadcasts in a host of different languages, he did manage to get the slick and slimy Billy Flynn lawyer role opposite Ginger Rogers' felon in the \"Chicago\" adaptation Roxie Hart (1942), and continued to earn occasional distinction in such post-WWII pictures as The Hucksters (1947) and State of the Union (1948). His last lead was in the crackerjack thriller The Sniper (1952), in which he played an (urbane) San Francisco homicide detective tracking down a killer who preys on women in San Francisco, and he appeared without his mustache for the first time in nearly two decades. Also active on radio and TV, his last notable film was the classic anti-war picture Paths of Glory (1957) playing the villainous Gen. Broulard. Adolphe's extreme hardcore right-wing Republican politics hurt his later reputation, as he was made a scapegoat for his cooperation as a \"friendly witness\" at the House Un-American Activities Commission hearing during the Joseph McCarthy Red Scare era. Following his last picture, Disney's Pollyanna (1960), in which he played an uncharacteristically rumpled curmudgeon who is charmed by Hayley Mills, he retired from acting. He died after a nine-month battle with hepatitis on October 29, 1963, inside his Beverly Hills home. Three times proved the charm for Adolphe with his 1934 marriage to actress Verree Teasdale, who survived him. The couple had an adopted son named Peter. His autobiography, \"It Took Nine Tailors\" (1947), pretty much says it all for this polished, preening professional.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2NzgyMTE3M15BMl5BanBnXkFtZTYwNTIwMTM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0579663","name":"Adolphe Menjou","idIMDB":"nm0579663"},"actorId":"nm0579663","character":"Albert von Kersten-Rodenfels","urlCharacter":"http://www.imdb.com/character/ch0206399","main":true},{"actorName":"Ricardo Cortez","urlProfile":"http://www.imdb.com/name/nm0007220","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEwMTQwOTMyOF5BMl5BanBnXkFtZTcwNzMxMDgxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 September 1900","placeOfBirth":" New York City, New York, USA","birthName":"Jacob Krantz","height":"6' 1\" (1.85 m)","bio":"Ricardo Cortez was born Jacob Krantz in New York City, New York, the son of Sarah (Lefkowitz) and Moses/Morris Krantz, Austrian Jewish immigrants who moved to NY just before he was born. His brother was cinematographer Stanley Cortez, who also changed his surname. Cortez worked a number of jobs while he trained as an actor. When Jacob arrived in Hollywood to work in movies in 1922, the Valentino mania was in full swing. Never shy about changing a name and a background, the studio transformed Jacob Krantz into Latin Lover Ricardo Cortez from Spain. Such was life in Hollywood. Starting with small parts, the tall, dark Cortez was being groomed by Paramount to be the successor to Rudolph Valentino. But Cortez would never be viewed (or consider himself) as the equal to the late Valentino. A popular star, he was saddled in a number of run-of-the-mill romantic movies which would depend more on his looks than on the script. Pictures like Argentine Love (1924) and The Cat's Pajamas (1926) did little to extend his range as an actor. He did show that he had some range with his role in Pony Express (1924), but roles like that were few and far between. With the advent of sound, Cortez made the transition and he would play Sam Spade in The Maltese Falcon (1931) (aka Dangerous Female). Never a great actor, Cortez was cast as the smirking womanizer in a number of films and would soon slide down into 'B' movies. He played a newspaper columnist Is My Face Red? (1932), a home wrecker in A Lost Lady (1934), a killer in Man Hunt (1936) and even Perry Mason in The Case of the Black Cat (1936). After 1936, Cortez hit a lean patch for acting and tried his hand at directing. His career as a director ended after a half dozen movies and his screen career soon followed. He retired from the screen and returned to Wall Street, where he had worked as a runner decades before. This time, he returned as a member of one of Wall Street's top brokerage firms and lived a comfortable life.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzEwMTQwOTMyOF5BMl5BanBnXkFtZTcwNzMxMDgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007220","name":"Ricardo Cortez","idIMDB":"nm0007220"},"actorId":"nm0007220","character":"Dr. Walter, the Tutor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ida Waterman","urlProfile":"http://www.imdb.com/name/nm0914003","urlPhoto":"","biography":{"dateOfBirth":"10 March 1852","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Ida Shaw","bio":"Ida Waterman was born on March 10, 1852 in Philadelphia, Pennsylvania, USA as Ida Shaw. She was an actress, known for Stella Maris (1918), The Enchanted Cottage (1924) and Amarilly of Clothes-Line Alley (1918). She was married to Joseph Francoeur and Fred Waterman. She died on May 22, 1941 in Cincinnati, Ohio, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0914003","name":"Ida Waterman","idIMDB":"nm0914003"},"actorId":"nm0914003","character":"Princess Beatrice","urlCharacter":"http://www.imdb.com/character/ch0266491","main":true},{"actorName":"Helen Lindroth","urlProfile":"http://www.imdb.com/name/nm0512164","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDkxZjZkMTEtMzQ5My00Njg0LTk1OWEtNTgyYTU4NGEzNGUwXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1874","placeOfBirth":" Sweden","bio":"Helen Lindroth was born on December 3, 1874 in Sweden. She was an actress, known for The Maker of Dreams (1915), The Right Way (1921) and The Treasure Ship (1914). She died on October 5, 1956 in Boston, Massachusetts, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDkxZjZkMTEtMzQ5My00Njg0LTk1OWEtNTgyYTU4NGEzNGUwXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0512164","name":"Helen Lindroth","idIMDB":"nm0512164"},"actorId":"nm0512164","character":"Amphirosa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Helen Lee Worthing","urlProfile":"http://www.imdb.com/name/nm0941745","urlPhoto":"","biography":{"dateOfBirth":"31 January 1905","placeOfBirth":" Louisville, Kentucky, USA","bio":"Helen Lee Worthing was born on January 31, 1905 in Louisville, Kentucky, USA. She was an actress, known for The Count of Luxembourg (1926), The Other Woman's Story (1925) and Watch Your Wife (1926). She was married to Dr. Eugene C. Nelson and Charles L. MacDonald. She died on August 25, 1948 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0941745","name":"Helen Lee Worthing","idIMDB":"nm0941745"},"actorId":"nm0941745","character":"Wanda von Gluck","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joseph Depew","urlProfile":"http://www.imdb.com/name/nm0220082","urlPhoto":"","biography":{"dateOfBirth":"11 July 1912","placeOfBirth":" Harrison, New Jersey, USA","height":"6' 0¼\" (1.84 m)","bio":"Joseph Depew was born on July 11, 1912 in Harrison, New Jersey, USA. He was an assistant director and producer, known for The Beverly Hillbillies (1962), The George Burns and Gracie Allen Show (1950) and The Bob Cummings Show (1955). He was married to Dorothy Depew. He died on October 30, 1988 in Escondido, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0220082","name":"Joseph Depew","nicknames":["Joe"],"idIMDB":"nm0220082"},"actorId":"nm0220082","character":"Prince George","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Walcott","urlProfile":"http://www.imdb.com/name/nm1290360","urlPhoto":"","biography":{"dateOfBirth":"23 August 1885","placeOfBirth":"","bio":"George Walcott was born on August 23, 1885. He was an actor, known for The Swan (1925). He died on January 10, 1951 in San Francisco, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1290360","name":"George Walcott","idIMDB":"nm1290360"},"actorId":"nm1290360","character":"Prince Arsene","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Visaroff","urlProfile":"http://www.imdb.com/name/nm0899521","urlPhoto":"","biography":{"dateOfBirth":"18 November 1889","placeOfBirth":" Moscow, Russia","birthName":"Michael Simeon Vizarov","height":"5' 11\" (1.8 m)","bio":"A graduate of the Principal Dramatic School in Russia, Visaroff began his career on the stage and made the transition to movies in 1925. He played a number of 'noble' people in films - counts, etc. At the time of his death from pneumonia, he was in the midst of rehearsals for a play.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0899521","name":"Michael Visaroff","idIMDB":"nm0899521"},"actorId":"nm0899521","character":"Father Hyacinth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Vavitch","urlProfile":"http://www.imdb.com/name/nm0891349","urlPhoto":"","biography":{"dateOfBirth":"1885","placeOfBirth":" Odessa, Kherson Governorate, Russian Empire [now Ukraine]","birthName":"Mihailo Ivanovic-Vavic","bio":"Michael Vavitch was born in 1885 in Odessa, Kherson Governorate, Russian Empire as Mihailo Ivanovic-Vavic. He was an actor, known for Two Arabian Knights (1927), The Divine Lady (1929) and The Gaucho (1927). He died on October 5, 1930 in Hollywood, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0891349","name":"Michael Vavitch","idIMDB":"nm0891349"},"actorId":"nm0891349","character":"Colonel Wunderlich","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nicholas Soussanin","urlProfile":"http://www.imdb.com/name/nm0816007","urlPhoto":"","biography":{"dateOfBirth":"16 January 1889","placeOfBirth":" Yalta, Taurida Governorate, Russian Empire [now Crimea, Ukraine]","bio":"Nicholas Soussanin was born on January 16, 1889 in Yalta, Taurida Governorate, Russian Empire. He was an actor and writer, known for The Last Command (1928), Hotel Imperial (1927) and The Spotlight (1927). He was married to Olga Baclanova. He died on April 27, 1975 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0816007","name":"Nicholas Soussanin","idIMDB":"nm0816007"},"actorId":"nm0816007","character":"Lutzow","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Arthur Donaldson","urlProfile":"http://www.imdb.com/name/nm0232063","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTNlZmZiNzYtN2U5Ni00OWUxLTkwOTAtZTcwZDc1YjMxNDk2XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 April 1869","placeOfBirth":" Norsholm, Östergötlands län, Sweden","height":"6' (1.83 m)","bio":"Swedish born classical stage star Arthur Donaldson born in Norsholm, Sweden in 1869. A well-known stage actor and a light opera baritone singer. Moved to the United States in 1883 and began his stage career in the 1890's, he originated the role of 'The Prince of Pilsen' in 1903. Handsome performer who often played high class gentlemen in more than 80 movies, making his film debut in 'A Lad from Old Ireland' for the Kalem Film Co in 1910. During the early 1910's he returned to Sweden, appearing in operettas at Oscarsteatern and also made two Swedish films (one as director) before going back to America. He became one of the best regarded character actors of the World War I era including as a German General in 'For France' at Vitagraph Film Co in 1917, one of his most memorable roles was that of George III in D.W. Griffith's 'America' in 1920. In 1925 he produced and directed 'Retribution' an experimental sound film intended for a Swedish-speaking audience, ironically, sound ultimately put an end to his screen career, he returned to the stage permanently in 1927, making his Broadway directorial debut in 1934 with 'The Green Stick'. He died in Long Island, New York in 1955 age 86.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTNlZmZiNzYtN2U5Ni00OWUxLTkwOTAtZTcwZDc1YjMxNDk2XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0232063","name":"Arthur Donaldson","idIMDB":"nm0232063"},"actorId":"nm0232063","character":"Franz, the Court Chamberlain","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"General Lodijensky","urlProfile":"http://www.imdb.com/name/nm0517139","urlPhoto":"","biography":{"dateOfBirth":"28 May 1876","placeOfBirth":" Moscow, Russian Empire [now Russia]","birthName":"Theodore A. Lodijensky","bio":"General Lodijensky was born on May 28, 1876 in Moscow, Russian Empire as Theodore A. Lodijensky. He is known for his work on Her Love Story (1924), The Swan (1925) and Into Her Kingdom (1926). He died on March 6, 1947.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0517139","name":"General Lodijensky","idIMDB":"nm0517139"},"actorId":"nm0517139","character":"Master of the Hunt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clare Eames","urlProfile":"http://www.imdb.com/name/nm0247179","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjlmZDhhNDMtYjg1MS00NmIwLTgyZTYtMjI3OTYyYjZhYTgxXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1894","placeOfBirth":" Hartford, Connecticut, USA","bio":"Clare Eames was born on August 5, 1894 in Hartford, Connecticut, USA. She was an actress, known for The New Commandment (1925), Dorothy Vernon of Haddon Hall (1924) and The Swan (1925). She was married to Sidney Howard. She died on November 8, 1930 in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjlmZDhhNDMtYjg1MS00NmIwLTgyZTYtMjI3OTYyYjZhYTgxXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0247179","name":"Clare Eames","idIMDB":"nm0247179"},"actorId":"nm0247179","character":"Princess Dominica","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0016409","urlIMDB":"http://www.imdb.com/title/tt0016409","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 25 min (85 min)"],"soundMix":["Silent"],"color":["Black and White"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":["1,798 m (6 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.2","filmingLocations":[],"awards":[],"votes":"18","type":"Movie","companyCreditsSimple":[{"idCompany":"co0047533","name":"Famous Players-Lasky Corporation"}],"keywords":{"keywords":["based on play"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 07:14:23"}}