{"data":{"movies":[{"title":"Carrie","originalTitle":"","year":"1976","releaseDate":"19761116","directors":[{"name":"Brian De Palma","id":"nm0000361"}],"writers":[{"name":"Stephen King","id":"nm0000175"},{"name":"Lawrence D. Cohen","id":"nm0169548"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2Q3ZmVmZWItZGIzNi00NDNhLThiMTktMTU3MjIzMzRmYWI5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror"],"plot":"It's nearing the end of the school year. High school senior Carrie White is a social outcast, largely due to being unwise to the ways of the world based on her upbringing. Her mother, Margaret White, is a religious fanatic, her extreme views primarily targeted against sex, which she believes is a sin. She even believes natural associated processes such as menstruation are a sin, about which she has refused to mention to Carrie. Mrs. White's beliefs were taken to that extreme largely because of her own failed marriage and her husband Ralph long ago having run off with another woman. The only adult authority figure who tries to help Carrie with her life is her phys ed teacher, Miss Collins, who is nonetheless warned not to get too close to go against how Mrs. White chooses to raise Carrie, Mrs. White whose beliefs are well known in the community. An impromptu event that happens among Carrie's phys ed classmates against her leads to her classmates being punished. One of those students, ...","simplePlot":"Carrie White, a shy, friendless teenage girl who is sheltered by her domineering, religious mother, unleashes her telekinetic powers after being humiliated by her classmates at her senior prom.","actors":[{"actorName":"Sissy Spacek","urlProfile":"http://www.imdb.com/name/nm0000651","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAwMTU4NTMwMF5BMl5BanBnXkFtZTgwMDMyMTg4MTE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1949","placeOfBirth":" Quitman, Texas, USA","birthName":"Mary Elizabeth Spacek","height":"5' 3\" (1.6 m)","bio":"As a kid, Sissy Spacek climbed trees, rode horses, swam, and played in the woods. She was born Mary Elizabeth Spacek on December 25, 1949, in Quitman, Texas, to Virginia Frances (Spilman) and Edwin Arnold Spacek, Sr., a county agricultural agent. Her father's family was of Czech and German origin. Sissy attended Quitman High School and was homecoming queen. After graduating, she embarked on an acting career, gaining interest in the profession through her cousin, actor Rip Torn. Sissy relocated to New York, and through him, enrolled in the New York branch of the Actors Studio. She studied acting at the Lee Strasberg Institute while also pursuing work as a model and singer, appearing in West Village showcases such as the Bitter End for $10 a night. Sissy eventually broke into film and one of her first roles was as Holly in the classic Badlands (1973). The art director on that film was Jack Fisk, with whom she would marry in 1974 and ultimately collaborate on eight films. Sissy followed this landmark film with a star-making and Oscar nominated performance in Carrie (1976), in which she played a humiliated prom queen who goes postal with her telekinesis. Sissy has had an enduring and award winning career in movies and television, which includes an Oscar as Best Actress for Coal Miner's Daughter (1980). The parents of two grown daughters, Sissy and Jack live on a large horse ranch in the foothills of Virginia's Blue Ridge Mountains. Even though she continued to appear in film and television during the late 1980s and 1990s, Sissy devoted most of those years to her family. Then, in 2001, Sissy returned to the big screen in a major way with a powerful performance in In the Bedroom (2001), which not only earned her a sixth Best Actress Oscar nomination, but a win for Best Actress at the Golden Globes, Independent Spirit Awards, and numerous critics association awards. Sissy continues to work steadily as an actress, but in 2012, her credits expanded even further to include a memoir, My Extraordinary Ordinary Life, as well as planning her directorial debut on the in-development film Sweet Tea.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAwMTU4NTMwMF5BMl5BanBnXkFtZTgwMDMyMTg4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000651","name":"Sissy Spacek","idIMDB":"nm0000651"},"actorId":"nm0000651","character":"Carrie","urlCharacter":"http://www.imdb.com/character/ch0010223","main":true},{"actorName":"Piper Laurie","urlProfile":"http://www.imdb.com/name/nm0001453","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTEwMzg5MDU2N15BMl5BanBnXkFtZTcwMDY5NDQ5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 January 1932","placeOfBirth":" Detroit, Michigan, USA","birthName":"Rosetta Jacobs","height":"5' 4½\" (1.64 m)","bio":"Piper Laurie was born Rosetta Jacobs in Detroit, Michigan, on January 22, 1932, to Charlotte Sadie (Alperin) and Alfred Jacobs, a furniture dealer. Her father was a Polish Jewish immigrant and her mother was of Russian Jewish descent. Her father moved the family to Los Angeles, California, when she was 6-years-old. Rosetta was a pretty red-haired little girl, but very shy, so her parents sent her to weekly elocution lessons. In addition to her lessons in Hebrew school, she studied acting at a local acting school, and this eventually led to work at Universal Studios. Universal had signed her as a contract player when she was only 17-years-old, and changed her screen name to Piper Laurie. She was cast in the movie, Louisa (1950), and became very close friends with her costar, Ronald Reagan. She was then cast in Francis Goes to the Races (1951) with Donald O'Connor, Son of Ali Baba (1952) with Tony Curtis, and Ain't Misbehavin' (1955) with Rory Calhoun. The studio tried to enhance her image as an ingénue with press releases stating that she took milk baths and ate gardenia petals for lunch. Although she was making $2,000 per week, her lack of any substantial roles discouraged her so much that by 1955 when she received another script for a Western and \"another silly part in a silly movie\", she dropped the script in the fireplace, called her agent and told him she didn't care if they fired her, jailed her or sued her. From there, she went to New York City to study acting, and worked on live television, starring in The Hallmark Hall of Fame version of \"Twelfth Night\" (1957), \"The Days of Wine and Roses\" (1958) with Cliff Robertson, which debuted on Playhouse 90 on October 2, and as \"Kirsten\" in the Playhouse 90 version of \"Winterset\" (1959). In 1961, she got the part of Paul Newman's crippled girlfriend in the classic film, The Hustler (1961). She was nominated for an Academy Award for Best Actress for that role of \"Sarah Packard\". That same year, she was interviewed by a writer/reporter for the New York Herald Tribune, Joe Morgenstern. She liked his casual dress and lifestyle and, 9 months later, they were married. When she did not receive any substantial acting offers after The Hustler (1961), she retreated with her husband to Woodstock, New York, where she pursued domestic activities such as baking (her grandfather's trade) and raising her only daughter, Anne, born in 1971. In 1976, she accepted the role of \"Margaret White\", the eccentric religious zealot mother of a shy young psychic girl named Carrie (1976), played by Sissy Spacek. Piper received her second supporting Oscar nomination for this role. She and her husband divorced in 1981, she moved to Southern California and obtained many film and television roles. She got a third Oscar nomination for her role as \"Mrs. Norman\" in Children of a Lesser God (1986), and won an Emmy that same year for her acting in Promise (1986), a television movie with James Garner and James Woods. She has appeared in more than 60 films, from 1950 to the present. Ms. Laurie has appeared in many outstanding television shows from \"The Best of Broadway\" in 1954, to roles on \"Playhouse 90\" in 1956, roles on St. Elsewhere (1982), Murder, She Wrote (1984), Matlock (1986), Beauty and the Beast (1987), ER (1994), Diagnosis Murder (1993) and Frasier (1993). Her daughter, Anne Grace, has made her a grandmother, and though she lives in Southern California, she frequently visits her daughter in New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTEwMzg5MDU2N15BMl5BanBnXkFtZTcwMDY5NDQ5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001453","name":"Piper Laurie","nicknames":["Rosie"],"idIMDB":"nm0001453"},"actorId":"nm0001453","character":"Margaret White","urlCharacter":"http://www.imdb.com/character/ch0010222","main":true},{"actorName":"Amy Irving","urlProfile":"http://www.imdb.com/name/nm0001388","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNjMxMjgwMF5BMl5BanBnXkFtZTcwNzE0MzQ3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1953","placeOfBirth":" Palo Alto, California, USA","birthName":"Amy Davis Irving","height":"5' 4\" (1.63 m)","bio":"Naturally brunette/blue-eyed beauty Amy Davis Irving was born in Palo Alto, California. She is the youngest of three children, and the daughter of influential theatrical/television director and producer Jules Irving, and actress Priscilla Pointer. Her father was of Russian Jewish descent, and her mother's ancestry includes English, Scots-Irish, Welsh, Jewish, and German. Amy was brought up in the world of theater. She was put on stage from the time she was nine-months-old, her father was the director and her mother was the actress, they didn't want baby sitters for their children, so if she wasn't performing, she would stay in the wardrobe department or her mother used to put her in the second row center where she could watch her. And, before she was 10-years-old, she had already worked in several plays. At a young age, Amy Irving was trained at the American Conservatory Theater and Britain's London Academy of Music and Dramatic Arts (L.A.M.A.D.A.). She made her off-Broadway debut at the age of 17 and, from that moment to date, she received critical acclaim, appearing in such plays as: \"Heartbreak House\" (1983), \"The Road to Mecca\" (1988), \"Broken Glass\" (1994), \"The Three Sisters\" (1997), \"The Guys\" (2002), \"Ghosts\" (2002) and \"Celadine\" (2004), among others. In 1976, Amy made her film debut, playing \"Sue Snell\", one of her most unforgettable characters in Stephen King's Carrie (1976), a classic in the horror genre, taken to the big screen by director Brian De Palma. For the next few years, Irving continued working in important films, The Fury (1978), also directed by De Palma, Voices (1979) and The Competition (1980). Later, in 1983, she gave a fine performance as \"Hadass\", in Barbra Streisand's Yentl (1983), and won an Oscar nomination for her great work in that successful film. Two of her best opportunities arrived in the late 80s, when she played \"Anna Anderson\" in Anastasia: The Mystery of Anna (1986) and \"Isabelle Grossman\" in the romantic comedy, Crossing Delancey (1988); she received a Golden Globe nomination for each movie. Amy was married to director Steven Spielberg from 1985 to 1989 and she has a son with him, Max Spielberg. And, in 1990, after her divorce, she met Brazilian director Bruno Barreto while they were working on A Show of Force (1990). They wed a few years later and they have a son (Gabriel). In 1997, Irving made a guest appearance on Woody Allen's Deconstructing Harry (1997) and, in 1999, she came back in the sequel of Carrie (1976), The Rage: Carrie 2 (1999). Unfortunately, her film opportunities were supposedly narrowed in the 90s. However, in the year 2000, she surprised the whole world again when she performed as \"Mary Ann Simpson\", a very funny and sensual, at the same time, English teacher in the film, Bossa Nova et vice versa (2000). She managed to capture this peculiar character very well. After this romantic comedy, Amy had a great opportunity, playing \"Barbara Wakefield\", Michael Douglas' wife in Traffic (2000), the film was a huge success and she won an Actor Award, shared with the rest of the cast. Then, this beautiful and talented actress continued working in remarkable films such as Thirteen Conversations About One Thing (2001), with her Carrie (1976) co-star, Sissy Spacek, in the Walt Disney production, Tuck Everlasting (2002) and in the horror film, Hide and Seek (2005), along with Robert De Niro. Recently, she had an important part as \"Emily Sloane\" in the very-known show, Alias (2001). In addition to her talents as an actress, she is a great dancer and also showed off her vocal talents, singing in films such as Who Framed Roger Rabbit (1988), Honeysuckle Rose (1980), Rumpelstiltskin (1987) and An American Tail: Fievel Goes West (1991). Nowadays, Amy Irving continues working on stage in Broadway productions and spends most of her time with her friends and family, especially with her two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNjMxMjgwMF5BMl5BanBnXkFtZTcwNzE0MzQ3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001388","name":"Amy Irving","idIMDB":"nm0001388"},"actorId":"nm0001388","character":"Sue Snell","urlCharacter":"http://www.imdb.com/character/ch0010224","main":true},{"actorName":"William Katt","urlProfile":"http://www.imdb.com/name/nm0001411","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTc0MDU2NV5BMl5BanBnXkFtZTcwMTk4ODIyOA@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 February 1951","placeOfBirth":" Los Angeles, California, USA","birthName":"William Theodore Katt","height":"5' 8½\" (1.74 m)","bio":"William Katt was born in Los Angeles, California, USA as William Theodore Katt. He is the son of actress Barbara Hale and actor Bill Williams. He is an actor and director, known for The Greatest American Hero (1981), Carrie (1976) and The Man from Earth (2007). He has been married to Danielle Hirsch since April 10, 1993. They have two children. He was previously married to Deborah Kahane.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTc0MDU2NV5BMl5BanBnXkFtZTcwMTk4ODIyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001411","name":"William Katt","idIMDB":"nm0001411"},"actorId":"nm0001411","character":"Tommy Ross","urlCharacter":"http://www.imdb.com/character/ch0010226","main":true},{"actorName":"John Travolta","urlProfile":"http://www.imdb.com/name/nm0000237","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNjQ0ODkxN15BMl5BanBnXkFtZTcwMDc5NjQwNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 February 1954","placeOfBirth":" Englewood, New Jersey, USA","birthName":"John Joseph Travolta","height":"6' 2\" (1.88 m)","bio":"John Joseph Travolta was born in Englewood, New Jersey, one of six children of Helen Travolta (née Helen Cecilia Burke) and Salvatore/Samuel J. Travolta. His father was of Italian descent and his mother was of Irish ancestry. His father owned a tire repair shop called Travolta Tires in Hillsdale, NJ. Travolta started acting appearing in a local production of \"Who'll Save the Plowboy?\". His mother, herself an actress and dancer, enrolled him in a drama school in New York, where he studied voice, dancing and acting. He decided to combine all three of these skills and become a musical comedy performer. At 16 he landed his first professional job in a summer stock production of the musical \"Bye Bye Birdie\". He quit school at 16 and moved to New York, and worked regularly in summer stock and on television commercials. When work became scarce in New York, he went to Hollywood and appeared in minor roles in several series. A role in the national touring company of the hit 1950s musical \"Grease\" brought him back to New York. An opening in the New York production of \"Grease\" gave him his first Broadway role at age 18. After \"Grease\", he became a member of the company of the Broadway show \"Over Here\", which starred The Andrews Sisters. After ten months in \"Over Here\", he decided to try Hollywood once again. Once back in Hollywood, he had little trouble getting roles in numerous television shows. He was seen on The Rookies (1972), Emergency! (1972) and Medical Center (1969) and also made a movie, The Devil's Rain (1975), which was shot in New Mexico. The day he returned to Hollywood from New Mexico, he was called to an audition for a new situation comedy series ABC was planning to produce called Welcome Back, Kotter (1975). He got the part of Vinnie Barbarino and the series went on the air during the 1975 fall season. He starred in a number of monumental films, earning his first Oscar and Golden Globe nominations for his role in the blockbuster Saturday Night Fever (1977), which launched the disco phenomenon in the 1970s. He went on to star in the big-screen version of the long-running musical Grease (1978) and the wildly successful Urban Cowboy (1980), which also influenced trends in popular culture. Additional film credits include the Brian De Palma thrillers Carrie (1976) and Blow Out (1981), as well as Amy Heckerling's hit comedy Look Who's Talking (1989) and Nora Ephron's comic hit Michael (1996). Travolta starred in Phenomenon (1996) and took an equally distinctive turn as an action star in John Woo's top-grossing Broken Arrow (1996). He also starred in the classic Face/Off (1997) opposite Nicolas Cage, and The General's Daughter (1999), co-starring Madeleine Stowe. In 2005, Travolta reprised the role of ultra cool Chili Palmer in the Get Shorty (1995) sequel Be Cool (2005). In addition, he starred opposite Scarlett Johansson in the critically acclaimed independent feature film A Love Song for Bobby Long (2004), which was screened at the Venice Film Festival, where both Travolta and the films won rave reviews. In February 2011, John was honored by Europe's leading weekly program magazine HORZU, with the prestigious Golden Camera Award for \"Best Actor International\" in Berlin, Germany. Other recent feature film credits include box-office hit-comedy \"Wild Hogs,\" the action-thriller Ladder 49 (2004), the movie version of the successful comic book The Punisher (2004), the drama Basic (2003), the psychological thriller Domestic Disturbance (2001), the hit action picture Swordfish (2001), the infamous sci-fi movie Battlefield Earth (2000), based upon the best-selling novel by L. Ron Hubbard, and Coeurs perdus (2006). Travolta has been honored twice with Academy Award nominations, the latest for his riveting portrayal of a philosophical hit-man in Quentin Tarantino's Pulp Fiction (1994). He also received BAFTA and Golden Globe nominations for this highly acclaimed role and was named Best Actor by the Los Angeles Film Critics Association, among other distinguished awards. Travolta garnered further praise as a Mafioso-turned-movie producer in the comedy sensation Get Shorty (1995), winning the Golden Globe Award for Best Actor in a Motion Picture, Musical or Comedy. In 1998, Travolta was honored by the British Academy of Film and Television Arts with the Britanna Award: and in that same year he received the Lifetime Achievement Award at the Chicago Film Festival. Travolta also won the prestigious Alan J. Pakula Award from the US Broadcast Critics Association for his performance in A Civil Action (1998), based on the best-selling book and directed by Steven Zaillian. He was nominated again for a Golden Globe for his performance in Primary Colors (1998), directed by Mike Nichols and co-starring Emma Thompson and Billy Bob Thornton, and in 2008, he received his sixth Golden Globe nomination for his role asEdna Turnblad in the big-screen, box-office hit Hairspray (2007). As a result of this performance, the Chicago Film Critics and the Santa Barbara Film Festival decided to recognize Travolta with a Lifetime Achievement Award for his role. In addition, Travolta starred opposite Denzel Washington in Tony Scott's remake The Taking of Pelham 123 (2009), and he provided the voice of the lead character in Walt Disney Pictures' animated hit _Bolt_, which was nominated for a 2009 Academy Award for Best Animated Feature Film and a Golden Globe for Best Animated Film, in addition to Best Song for John and Miley Cyrus' duet titled, \"I Thought I Lost You.\" Next, Travolta starred in Walt Disney Pictures' Old Dogs (2009), along with Robin Williams, Kelly Preston and Ella Bleu Travolta, followed by the action thriller From Paris with Love (2010), starring opposite Jonathan Rhys Meyers. In 2012, John starred alongside Taylor Kitsch, Blake Lively, Aaron Taylor-Johnson, Benicio Del Toro, Salma Hayek, Emile Hirsch and Demián Bichir in Oliver Stone's, Savages (2012). The film was based on Don Winslow's best-selling crime novel that was named one of The New York Times' Top 10 Books of 2010. John was most recently seen in Killing Season (2013) co-starring Robert De Niro and directed by Mark Steven Johnson. John recently completed production on the Boston based film, The Forger (2014), alongside Academy Award winner Christopher Plummer and Critic's Choice nominee Tye Sheridan. John plays a second generation petty thief who arranges to get out of prison to spend time with his ailing son (Sheridan) by taking on a job with his father (Plummer) to pay back the syndicate that arranged his release. John has received 2 prestigious aviation awards: in 2003 the American Institute of Aeronautics and Astronautics Foundation Award for Excellence for his efforts to promote commercial flying, and in 2007 The Living Legends Ambassador of Aviation award. John holds 11 jet licenses: 747, 707, Gulfstream II, Lear 24, Hawker 1251A, Eclipse Jet, Vampire Jet, Canadair CL-141 Jet, Soko Jet, Citation ISP and Challenger. Travolta is the Qantas Airways Global Goodwill \"Ambassador-at-Large\" and piloted the original Qantas 707 during \"Spirit of Friendship\" global tour in July/August 2002. John is also a business aircraft brand ambassador for Learjet, Challenger and Global jets for the world's leading business aircraft manufacturer, Bombardier. John flew the 707 to New Orleans after the 2005 hurricane disaster bringing food and medical supplies, and in 2010, again flew the 707, this time to Haiti after the earthquake, carrying supplies, doctors and volunteers. John, along with his wife, actress Kelly Preston are also very involved in their charity, The Jett Travolta Foundation, which raises money for children with educational needs.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNjQ0ODkxN15BMl5BanBnXkFtZTcwMDc5NjQwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000237","name":"John Travolta","idIMDB":"nm0000237"},"actorId":"nm0000237","character":"Billy Nolan","urlCharacter":"http://www.imdb.com/character/ch0010216","main":true},{"actorName":"Nancy Allen","urlProfile":"http://www.imdb.com/name/nm0000262","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MjU5MzIxOV5BMl5BanBnXkFtZTcwMTM2NTgwMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 June 1950","placeOfBirth":" New York City, New York, USA","birthName":"Nancy Anne Allen","height":"5' 6\" (1.68 m)","bio":"Nancy Anne Allen was the daughter of a police lieutenant from Yonkers, New York. At a young age, she trained for a dancing career at the High School of Performing Arts, and then attended Jose Quintano's School for Young Professionals. In dozens of television commercials from the age of 15, Nancy made her first film appearance in The Last Detail (1973) with Jack Nicholson. Three years later, she set the standard for all future \"bitch-goddess teenagers\" as Chris Hargensen in Stephen King's Carrie (1976), taken to the big screen by director Brian De Palma. Nancy then married De Palma in 1979. She next appeared in Steven Spielberg's I Wanna Hold Your Hand (1978); for the next few years, she appeared only in De Palma's films: Home Movies (1979), Dressed to Kill (1980), and she starred with John Travolta in Blow Out (1981). After her divorce from De Palma in 1984, Nancy's film opportunities were supposedly narrowed, but then she surprised the whole world in 1987 when she performed as Officer Anne Lewis in the sci-fi cult film RoboCop (1987), along with Peter Weller. Here, she set another standard as a tough but at the same time feminine policewoman, whose sex would not interfere with her actions. After the success of RoboCop, she performed as Patricia Gardner in the second sequel in the Poltergeist series. She came back in RoboCop 2 (1990) and in order to get more involved with the character Nancy Allen learned martial arts and police training for real. She returned again in RoboCop 3 (1993), though her co-star Peter Weller did not this time. In 1993, Nancy joined several other veteran stars in Acting on Impulse (1993), and married co-star Craig Shoemaker, in the same year. A few years later, she divorced Craig and some time after she married again. Later, she appeared in some diverse films: Dusting Cliff 7 (1997) Secret of the Andes (1998), Circuit (2001), and she had a guest appearance in Steven Soderbergh's Out of Sight (1998). Her last performance was for the television series Law & Order: Special Victims Unit (1999), in the episode \"Escape\" aired on December 2, 2003. Allen has recently appeared in several documentaries about her most famous films: Acting 'Carrie' (2001), _DVD BackStory: RoboCop (2001)_, The Making of 'Dressed to Kill' (2001), DVD _ET True Hollywood Stories: The Curse of Poltergeist (2002)_. Interested in projecting the image of a strong but at the same time feminine woman, she managed to get away from the victim roles she was always offered, she also was able to get away from the stereotype of the beautiful but dumb woman in most action films. She is an environmentalist that traded her Volvo car for an Hybrid car in order to set the example. She is also an activist against breast Cancer along with her friend actress Wendie Jo Sperber, who created the foundation WeSpark. Her last appearance on television was on the Inside E! story of her co-star John Travolta and the A&E Biography of Travolta - both appearances in 2004. Nowadays, Nancy Allen lives a quiet life along with her family and friends somewhere in the United States.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MjU5MzIxOV5BMl5BanBnXkFtZTcwMTM2NTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000262","name":"Nancy Allen","nicknames":["The Scream Queen","The Queen of Horror"],"idIMDB":"nm0000262"},"actorId":"nm0000262","character":"Chris Hargensen","urlCharacter":"http://www.imdb.com/character/ch0010217","main":true},{"actorName":"Betty Buckley","urlProfile":"http://www.imdb.com/name/nm0000990","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MTQyMzU1Nl5BMl5BanBnXkFtZTcwOTQ4MDU3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 July 1947","placeOfBirth":" Fort Worth, Texas, USA","birthName":"Betty Lynn Buckley","height":"5' 6\" (1.68 m)","bio":"Betty Buckley was born in Big Spring, Texas to Betty Bob and Ernest Buckley. She attended Texas Christian University (TCU) in Fort Worth. She was crowned \"Miss Fort Worth\" in 1966, and was runner-up in the Miss Texas competition. While Betty has always been a product of Broadway, the roles in which she played before-the-camera are mesmerizing. She made her film debut appearance in Brian De Palma's Carrie (1976). She played the part of Miss Collins, the title-character's nurturing and concerned teacher. She went on to play Sondra Walker, Harrison Ford's on-screen wife in Roman Polanski's Frantic (1988), Suzanne Fitzgerald, the on-screen birth mother of prisoner Ryan O'Reily in HBO's Oz (1997), and the ever-so-creepy Mrs. Jones in M. Night Shyamalan's The Happening (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4MTQyMzU1Nl5BMl5BanBnXkFtZTcwOTQ4MDU3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000990","name":"Betty Buckley","idIMDB":"nm0000990"},"actorId":"nm0000990","character":"Miss Collins","urlCharacter":"http://www.imdb.com/character/ch0010228","main":true},{"actorName":"P.J. Soles","urlProfile":"http://www.imdb.com/name/nm0001753","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MjI3OTU0NF5BMl5BanBnXkFtZTcwOTEwMTIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1950","placeOfBirth":" Frankfurt am Main, Hesse, Germany","birthName":"Pamela Jayne Hardon","height":"5' 8\" (1.73 m)","bio":"P.J. (Pamela Jayne) Soles was born on July 17, 1950 in Frankfurt, Germany. Her father came from Holland and her mother from New Jersey. Because her father was working for an international insurance company, the family moved all over the world. P.J. lived in Casablanca, Morocco, and Maracaibo, Venezuela, where she learned to speak fluent Spanish, and then Brussels, Belgium, where she went to high school at the International School of Brussels. When she was at Briarcliff College, she wanted to become the first woman ambassador to the Soviet Union. This career goal changed when she visited the Actors Studio in New York City. She moved to Manhattan and began acting in commercials and modeling for fashion magazines. She was married to J. Steven Soles during her years in New York, but then made the move to Los Angeles to work in television and movies. At this time, she and Soles' got divorced, but she decided to keep her name as P.J. Soles. She was among the hundreds of actors auditioning for Brian De Palma and George Lucas in their joint casting session for Carrie (1976) and Star Wars: Episode IV - A New Hope (1977). After Carrie, she went to Georgia to film Our Winning Season (1978) and met actor Dennis Quaid. They were married in 1978 in Texas on a dude ranch. P.J. starred in Rock 'n' Roll High School (1979) with Ramones. Next she filmed Private Benjamin (1980) and then Stripes (1981). She and Quaid were divorced in 1983. P.J. continued doing numerous television and film roles, and then married Skip Holm, who was the stunt pilot on The Right Stuff (1983). They have two children and were divorced in 1998. Still active in television and film, P.J. manages not to let her fans down, but keeps them interested in her work, which keeps on getting better, making her one of the most versatile actresses of her time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MjI3OTU0NF5BMl5BanBnXkFtZTcwOTEwMTIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001753","name":"P.J. Soles","nicknames":["\"The Totally Girl\" from Halloween"],"idIMDB":"nm0001753"},"actorId":"nm0001753","character":"Norma","urlCharacter":"http://www.imdb.com/character/ch0066804","main":true},{"actorName":"Priscilla Pointer","urlProfile":"http://www.imdb.com/name/nm0688467","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzQ2NTczNl5BMl5BanBnXkFtZTcwODA2NjYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1924","placeOfBirth":" New York City, New York, USA","bio":"Though character actress Priscilla Pointer may be better known as the mother of Amy Irving, she has enjoyed a major stage, film and TV career herself for over four decades. The New York-born performer was trained on the stage and appeared in several tours and Broadway shows, including \"A Streetcar Named Desire\", \"The Country Wife\" and \"The Condemned of Altona\". Many of these were under the direction of husband Jules Irving, a former actor, whom she married in 1947. Together, they co-founded the San Francisco Actor's Workshop along with Herbert Blau and Beatrice Manley. Forsaking her career for a time to raise her children, Pointer returned full time and, at the age of 40+, decided to set her sights on film and TV. She seemed to be everywhere in the 1970s and 1980s as somebody's mom, both brittle and resilient. She also proved to be dependable as a stern, no-nonsense teacher, doctor or judge. She played the mother of daughter Amy Irving in the cult shocker Carrie (1976), Diane Keaton in Looking for Mr. Goodbar (1977), Sean Penn in The Falcon and the Snowman (1985) and Kyle MacLachlan in Blue Velvet (1986). On the nighttime soap hit Dallas (1978), she played mom to Victoria Principal's character. In 1979, her husband Jules passed away and, two years later, she married actor Robert Symonds. They have appeared together quite frequently on stage, including the plays \"Voices\" and \"The Road to Mecca\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzQ2NTczNl5BMl5BanBnXkFtZTcwODA2NjYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0688467","name":"Priscilla Pointer","idIMDB":"nm0688467"},"actorId":"nm0688467","character":"Mrs. Snell","urlCharacter":"http://www.imdb.com/character/ch0010230","main":true},{"actorName":"Sydney Lassick","urlProfile":"http://www.imdb.com/name/nm0489861","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2ODY2OTkwM15BMl5BanBnXkFtZTcwODI3MzYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 July 1922","placeOfBirth":" Chicago, Illinois, USA","height":"5' 5\" (1.65 m)","bio":"Chubby, antsy, and distinctive character actor Sydney Lassick was born on July 23, 1922 to Jewish Russian immigrant parents in Chicago, Illinois. Lassick first began acting in both films and TV shows in the late 50s. Portly and bespectacled, with a high-pitched voice and a nervous disposition, Sydney was usually cast as peevish neurotics, obsequious toadies, and fretful everyman types. Best known for his outstanding portrayal of the whiny and infantile manic depressive mental patient Charlie Cheswick in the acclaimed \"One Who Flew Over the Cuckoo's Nest,\" Lassick's other most memorable roles include a fey Fairy Godfather in the lowbrow nudie cutie musical \"Sinderella and the Golden Bra,\" mean sarcastic English teacher Mr. Fromm in \"Carrie;\" genuinely creepy as perverse and abusive innkeeper Ernest Keller in the potently unnerving slasher horror sleeper \"The Unseen;\" at his oily best as the slimy Charlie P. in the supremely twisted cult oddity \"Sonny Boy,\" effeminate lackey Gopher in \"Deep Cover,\" and jolly trailer park manager Woody Wilson in \"Freeway.\" Among the TV series Sydney made guest appearances on are \"Family,\" \"Eight is Enough,\" \"Baretta,\" \"Hawaii Five-O,\" \"Barney Miller,\" \"Matt Houston,\" \"Moonlighting,\" \"Knots Landing,\" \"Dream On,\" and \"The X-Files.\" Lassick died at age 80 from complications from diabetes on April 12, 2003 in Los Angeles, California. He was survived by an older sister.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2ODY2OTkwM15BMl5BanBnXkFtZTcwODI3MzYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0489861","name":"Sydney Lassick","idIMDB":"nm0489861"},"actorId":"nm0489861","character":"Mr. Fromm","urlCharacter":"http://www.imdb.com/character/ch0132253","main":true},{"actorName":"Stefan Gierasch","urlProfile":"http://www.imdb.com/name/nm0317369","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2NDk5OTc2NV5BMl5BanBnXkFtZTcwMjkwMjYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1926","placeOfBirth":" New York City, New York, USA","bio":"Stefan Gierasch was born on February 5, 1926 in New York City, New York, USA. He was an actor, known for Carrie (1976), The Hustler (1961) and High Plains Drifter (1973). He was married to Hedy Sontag and Jane E. Churchman. He died on September 6, 2014 in Santa Monica, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU2NDk5OTc2NV5BMl5BanBnXkFtZTcwMjkwMjYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0317369","name":"Stefan Gierasch","idIMDB":"nm0317369"},"actorId":"nm0317369","character":"Mr. Morton","urlCharacter":"http://www.imdb.com/character/ch0132255","main":true},{"actorName":"Michael Talbott","urlProfile":"http://www.imdb.com/name/nm0847999","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4Mjg1MzcwNl5BMl5BanBnXkFtZTcwOTM1ODkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 February 1955","placeOfBirth":" Waverly, Iowa, USA","bio":"Michael Talbott was born on February 2, 1955 in Waverly, Iowa, USA. He is an actor and director, known for Miami Vice (1984), First Blood (1982) and Carrie (1976).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4Mjg1MzcwNl5BMl5BanBnXkFtZTcwOTM1ODkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0847999","name":"Michael Talbott","idIMDB":"nm0847999"},"actorId":"nm0847999","character":"Freddy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Doug Cox","urlProfile":"http://www.imdb.com/name/nm0185003","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMzY2NTgyNl5BMl5BanBnXkFtZTgwMjEwMTEwMTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' (1.83 m)","bio":"Doug Cox attended USC, graduating with a Bachelor of Arts degree in Cinema. Just out of college, he joined The Groundlings, one of the foremost comedy/improv troupes, where he wrote and performed for over 12 years. Doug has made dozens of appearances on television, in films, and on stage. He co-wrote four episodes of the groundbreaking \"Pee-wee's Playhouse,\" two of which received Emmy Award nominations. He also has a long term (business) relationship with Elvira Mistress of the Dark, writing live shows, screenplays, video and television material. He has written and directed over 50 corporate shows and videos. In addition, Doug wrote, produced and directed the independent feature film \"Shrink Rap.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyMzY2NTgyNl5BMl5BanBnXkFtZTgwMjEwMTEwMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0185003","name":"Doug Cox","idIMDB":"nm0185003"},"actorId":"nm0185003","character":"The Beak","urlCharacter":"http://www.imdb.com/character/ch0132257","main":true},{"actorName":"Harry Gold","urlProfile":"http://www.imdb.com/name/nm0324985","urlPhoto":"","biography":{"dateOfBirth":"15 April 1952","placeOfBirth":" USA","birthName":"Harry Goldstein","bio":"Born in Paris, France and raised in New York City, Harry began his professional career, as an actor at the age of twelve when was he was cast as one of Fagin's boys in the hit Broadway show Oliver. Thus began his professional career in show business. Throughout his teen years Harry appeared in countless commercials and theater projects while also pursuing a career as a singer and musician. In 1975 Harry, his wife to be Bonnie, and their 2 daughters Tracey and Missy made the big move to California. Things happened pretty quickly. Harry booked guest roles in MASH, 8 is enough, Maude and many other TV shows. There were roles in films such as The Worlds Greatest Lover, American Family and his favorite Carrie. In 1981 after much soul searching Harry applied for a job at a small talent agency and began this new journey as a talent agent. One year later, with 2 employees, he opened up Harry Gold & Associates. Representing adult actors. Things expanded quickly and soon enough the legendary youth division was formed. HGA was the first agency to represent both adult and young actors in a big way. \"We pride ourselves in saying that for many years we've represented some of the top actors in the business young and old. While we've developed the careers of some of the biggest names in the business we also have the honor of representing Oscar, Golden Globe, Emmy and TONY winners. Through some name changes over the years in 2002 the company permanently changed its name to TalentWorks and so it is today. Since 1992 Harry has been a proud, elected board member of the Association of Talent Agents. Harry has a wife of many years, 5 beautiful daughters and 7 grand children with more on the way.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0324985","name":"Harry Gold","idIMDB":"nm0324985"},"actorId":"nm0324985","character":"George","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Noelle North","urlProfile":"http://www.imdb.com/name/nm0636044","urlPhoto":"","biography":{"dateOfBirth":"11 July 1949","placeOfBirth":" USA","bio":"Noelle North was born on July 11, 1949 in the USA. She is known for her work on Carrie (1976), The Legend of Prince Valiant (1991) and Starchaser: The Legend of Orin (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0636044","name":"Noelle North","idIMDB":"nm0636044"},"actorId":"nm0636044","character":"Frieda","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0074285","urlIMDB":"http://www.imdb.com/title/tt0074285","business":{"budget":{"money":"$1,800,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"ESP","country":"141,149,635","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1976/\">1976</a>"},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1976/\">1976</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 38 min (98 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses","Panavision Split Diopter Lense"],"laboratory":["Metrocolor, Culver City (CA), USA (lab processing)","DeLuxe, Hollywood (CA), USA (prints)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.4","filmingLocations":[{"location":"124 N 7th St, Santa Paula, California, USA"}],"rated":"R","awards":[{"award":"Academy Awards, USA 1977","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Actress in a Leading Role","names":[{"name":"Sissy Spacek","id":"nm0000651","role":null}]},{"category":"Best Actress in a Supporting Role","names":[{"name":"Piper Laurie","id":"nm0001453","role":null}]}]}]},{"award":"Golden Globes, USA 1977","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Actress in a Supporting Role - Motion Picture","names":[{"name":"Piper Laurie","id":"nm0001453","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1977","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Scroll","categories":[{"category":"Best Horror Film","names":[]}]}]},{"award":"Avoriaz Fantastic Film Festival 1977","titlesAwards":[{"titleAwardOutcome":"Won Grand Prize","categories":[{"category":"","names":[{"name":"Brian De Palma","id":"nm0000361","role":null}]}]},{"titleAwardOutcome":"Won Special Mention","categories":[{"category":"","names":[{"name":"Sissy Spacek","id":"nm0000651","role":null}]}]}]},{"award":"Edgar Allan Poe Awards 1977","titlesAwards":[{"titleAwardOutcome":"Nominated Edgar","categories":[{"category":"Best Motion Picture","names":[{"name":"Lawrence D. Cohen","id":"nm0169548","role":null}]}]}]},{"award":"Hugo Awards 1977","titlesAwards":[{"titleAwardOutcome":"Nominated Hugo","categories":[{"category":"Best Dramatic Presentation","names":[{"name":"Brian De Palma","id":"nm0000361","role":"director"},{"name":"Lawrence D. Cohen","id":"nm0169548","role":"screenplay"},{"name":"Stephen King","id":"nm0000175","role":"based on the novel"}]}]}]},{"award":"National Society of Film Critics Awards, USA 1977","titlesAwards":[{"titleAwardOutcome":"Won NSFC Award","categories":[{"category":"Best Actress","names":[{"name":"Sissy Spacek","id":"nm0000651","role":null}]}]}]},{"award":"New York Film Critics Circle Awards 1977","titlesAwards":[{"titleAwardOutcome":"3rd place NYFCC Award","categories":[{"category":"Best Actress","names":[{"name":"Sissy Spacek","id":"nm0000651","role":null}]}]}]}],"votes":"132,334","type":"Movie","companyCreditsSimple":[{"idCompany":"co0540929","name":"Red Bank Films"}],"keywords":{"keywords":["telekinesis","prank","high school prom","blood","bad mother","female protagonist","prom king","menarche","female full frontal nudity","revenge","religious fanatic","bucket","shower","pig blood","vagina","female slaps female","female rear nudity","female nudity","public humiliation","psychic power","school on fire","female frontal nudity","based on book","based on novel","character name in title","prom","girl","school","student","classmate","sin","high school","teacher","pig","tease","outcast","isolation","gym","crush","sex","punishment","prom night","night","evil","bully","high school student","teenage girl","gym teacher","menstruation","outsider","juvenile delinquent","death of title character","villainess played by lead actress","popular girl","mean girl","fitting in","coming of age film","teen horror","body count","female killer","slasher killer","slasher flick","slasher","dead teenager","abusive boyfriend","physical abuse","menace","breasts","paranormal phenomenon","forename as title","sewing machine","last supper","school bus","insanity","small town","friendship","attic","praying","sex in a car","threatened with a knife","black comedy","detention","poem","high school principal","high school teacher","music band","montage","animal killing","long take","hit with a hammer","hammer","blow job","quarterback","stadium","single parent","newspaper clipping","crushed to death","abusive mother","christian","car set on fire","cigarette smoking","knocked out","bible quote","exploding car","flipping car","bare butt","fairy tale","southern accent","car accident","redemption","clique","crucifix","gravestone","bully comeuppance","remade","f word","first part","impalement","strange person","suspense","sinister","terror","saint sebastian","trees","closed doors","bicycle","pink dress","near future","future","year 1979","1970s","cross","abuse of power","demonic possession","dead woman with eyes open","woman stabbed","woman kills woman","villain not really dead cliche","slow motion scene","dream sequence","stabbing","fire engine","guilt","doubt","inferiority complex","self confidence","paranoia","index cards","graffiti","poetry","symbol","icon","prayer","oddball","single mother","watching tv","school principal","taunting","school teacher","repression","backwards","hysteria","buttocks","candle","gossip","library","mania","yearbook","wrong side of the tracks","unrequited love","underage","teenager","teen romance","teen movie","teen love","slumber party","shy girl","school yearbook","school life","school dance","party dress","opposites attract","nerd","juvenile","horror movie remade","high school sweethearts","high school love","high school dance","generation gap","forbidden love","first love","dating","dance contest","convertible","coming of age","class differences","adolescent romance","adolescence","teen angst","ashtray","religious zealot","depression","dysfunctional family","troubled teenage girl","oral sex in a car","female student","evil woman","evil student","work out","underground","screaming","ridicule","locked door","knocked unconscious","hell","fury","firetruck","firestorm","dream","death by falling object","dead woman","collapsing house","bible","child abuse","stress disorder","mother versus daughter","teacher student relationship","burning house","gothic","wrath","white dress","water","washing","volleyball","violence","vengeance","underwear","trousers","trauma","tragedy","tomb","teenage sex","teenage prankster","teenage love","teenage girl in underwear","teenage daughter","teenage boy","teenage alienation","t shirt","surprise","stabbed in the chest","stabbed in the back","shorts","shirt","sexual repression","sexual desire","sexual attraction","sadness","sadism","rejection","rampage","rage","psychological trauma","practical joke","panties","panic","out of control","oral sex","one word title","murder","multiple stabbing","menstrual blood","mass destruction","mass death","loss of control","long hair","locker room","laughing","knife","kiss","joy","jacket","house","hostility","homicide","hit on the head","graveyard","female teacher","female bully","fellatio","fear","dying","dress","domineering mother","disturbed individual","disillusionment","disappointment","destruction","desolation","desire","deeply disturbed person","death","dark heroine","danger","dance","cult film","crying","cruelty","cruel joke","crowd","covered in blood","compassion","classroom","cemetery","car","burning","bucket of blood","brunette","bra","boyfriend girlfriend relationship","blonde","bitterness","bathroom","ball","bad girl","attraction","anger","alone","based on the works of stephen king","bullying","opening credit bush","matricide","fright","overprotective parent","goth","firestarter","blockbuster","teenage sexuality","tampon","supernatural power","shyness","sexual humiliation","schoolgirl","popularity","misfit","loner","humiliation","alienation","cult director","stars","rock band","burned up car","stage","prom queen","psychic","rose","stabbed in the hand","hand from grave","street","principal's office","torso cut in half","face slap","psionic power","under stairs","fire","extrasensory perception","mother daughter relationship","stabbed to death","electrocution","crown","grave","split screen","falling down stairs","nightmare","prom ballot","gym class","principal","multiple views","fanaticism","bedroom","sibling rivalry","night time","reverse footage","cracked mirror","sexuality","dancing","prom dress","religion","death of mother","death of friend","independent film","title spoken by character","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:58:49"}}