{"data":{"movies":[{"title":"King Lear","originalTitle":"","year":"1971","releaseDate":"19710204","directors":[{"name":"Peter Brook","id":"nm0111656"}],"writers":[{"name":"Peter Brook","id":"nm0111656"},{"name":"William Shakespeare","id":"nm0000636"}],"runtime":"137 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MTM4MTg5Ml5BMl5BanBnXkFtZTcwMjk4OTAyMQ@@._V1.jpg","countries":["UK","Denmark"],"languages":["English"],"genres":["Drama"],"plot":"The Shakespeare tragedy that gave us the expression \"How sharper than a serpent's tooth it is to have a thankless child.\" King Lear has not one but two ungrateful children, and it's especially galling because he turned over his entire kingdom to them. Paul Scofield is an ancient, imposing shell of a Lear tormented by his too-long life as well as by daughters he calls \"unnatural hags.\" At one point, the king looks his eldest daughter, Goneril (Ireme Worth), straight in the eye and declares, \"Thou art a boil, a plague-sore, of embossed carbuncle in my corrupted blood.\" These are the troubles not even the best-trained family counselor could ever hope to resolve.","simplePlot":"The Shakespeare tragedy that gave us the expression \"How sharper than a serpent's tooth it is to have a thankless child.\" King Lear has not one but two ungrateful children, and it's ... ","actors":[{"actorName":"Paul Scofield","urlProfile":"http://www.imdb.com/name/nm0006890","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODg0NjA0OF5BMl5BanBnXkFtZTcwNzA5ODM2MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 January 1922","placeOfBirth":" Hurstpierpoint, West Sussex, England, UK","birthName":"David Paul Scofield","height":"6' (1.83 m)","bio":"Though his number of film roles amount to a bit over 30, Paul Scofield has cast a giant shadow in the world of stage and film acting. He grew up in West Sussex, the son of a schoolmaster. He attended the Varndean School for Boys in Brighton. The love of acting came early. While still high school age, he began training as an actor at the Croydon Repertory Theatre School (1939) and then at the Mask Theatre School (1940) in London. He took on all the experience he could handle by joining touring companies and also entertained British troops during World War II. He joined the Birmingham Repertory Theatre and, from there in 1946, he moved to Stratford-upon-Avon. There, in the birthplace of William Shakespeare, he had his first great successes. He had the title role in \"Henry V\"; he was \"Cloten\" in \"Cymbeline\"; \"Don Adriano de Armado\" in \"Love's Labour's Lost\", \"Lucio\" in \"Measure for Measure\", and then \"Hamlet\". And there were many more as he honed himself into one the great Shakespearean actors of the 20th century. With a rich, sonorous voice compared to a Rolls Royce being started up, in one instance, and a great sound rumbling forth from an antique crypt in yet another, he was quickly compared to Laurence Olivier. Scofield did not move on to commercial theater until 1949, when he took the lead role of \"Alexander the Great\", in playwright Terence Rattigan's unfortunately ill-received \"Adventure Story\". And as he continued theater work, he moved toward film very carefully. From his first in 1955, Scofield was always - as with any of his acting assignments - extremely picky about accepting a particular role. It was three years before his second film. Meanwhile, Scofield had the opportunity to play a great lead part in a new play by a schoolmaster-turned-new-playwright, Robert Bolt. The play was \"A Man for All Seasons\" and Scofield's choice role was that of \"Sir Thomas More\", the great English humanist and chancellor, who defied the ogre \"King Henry VIII\" in his wish to put aside his first wife for \"Anne Bolyne\". It was a once in a lifetime part, and Scofield debuted it in London in 1960. His only appearance on Broadway was the next year in that play, which ran into 1962. It was no surprise that the work began garnering awards for him (see Trivia below for details on theater and film awards). He returned to Shakespeare in 1962 with Peter Brook, the noted British director and producer, directing him as \"Lear\" at the newly formed Royal Shakespeare Company (RSC) at Stratford. This was a pioneering minimalist production, one of the first \"bare stage\" efforts - though things were pretty bare stage in Shakespeare's day. Scofield then did \"Coriolanus\" and \"Love's Labour's Lost\" for the Shakespeare Festival in Stratford, Ontario in 1963. His third film came six years after his second screen appearance (1958). This was his standout performance in Le train (1964), a production of his co-star, Burt Lancaster, that grew in size and budget with the entrance of Lancaster's second choice for director, John Frankenheimer. Some of the difficulties involved might have turned someone of Scofield's discipline back to the stage thereafter, but the filming of \"Seasons\" arrived, and he would hardly refuse. With Robert Bolt handling the screenplay and a superlative supporting cast, the film version of A Man for All Seasons (1966) collected some thirty-three international awards, including a three-statue sweep of prime-Oscar categories plus another three for good measure. Scofield was unforgettable as the incisive man of state, able to juggle the volatile politics of the time but always keep his honor and so brimming with faith as to endure the inevitably mounting tide against him. It suited Scofield for a time to keep his screen-acting to adaptations of plays, books, and ensemble pieces fitted to the big screen. Peter Brook and he teamed again for a film version of the Brook-adapted play Tell Me Lies (1968). The adaptation of Herman Melville's Bartleby (1970), despite Scofield's efforts, did not wash as an attempt to update Melville's story in the late twentieth century. Then Brook was back again to finally attempt what he said had really never been done correctly -adapting Shakespeare to film. Scofield's 1962 \"Lear\" was held in high esteem, and Brook decided on a film version, King Lear (1971), an even more uncompromising, even uncomfortable, desolation staging and editing of the tragedy. Despite some oddball camera work and not wholly satisfying adapting of the play, Scofield was magnificent and got his chance to show that he is perhaps the best Lear of modern times. While still keeping a concerted interest in filmed play adaptations, Scofield could be lured into more typical screen drama. He joined former co-star, Burt Lancaster, for the spy thriller, Scorpio (1973), as a memorable Russian comrade of Lancaster from the days of World War II, caught in late-Cold War spy craft brutality. Through the 1980s, Scofield did a mix of TV and film on both sides of the Atlantic. But he was drawn back to Shakespeare and filming efforts, though in humbler parts, first in the Henry V (1989) of ambitious Kenneth Branagh, as the French king, and, the next year, in the Franco Zeffirelli, Hamlet (1990), as \"The Ghost\" - with the real buzz being for Mel Gibson as the dour \"Prince of Denmark\". Both films were well-crafted with impressive supporting casts. And Scofield could be content that as with all his roles, he was remaining consistent with himself as his own best judge of how to challenge his acting gifts. Gibson was appropriately awed, saying that working with Scofield was like being \"thrown into the ring with Mike Tyson\" (that is, Mike Tyson then, not now). Through the 1990s, he enjoyed his continued sampling of all acting media, even radio narration and animation voice-over. The matter of British actors weighing upon the acceptance of knighthoods for their work began most publicly with Scofield. In 1956, after his tour of \"Hamlet\" with a triumph in Moscow, he gratefully accepted the appointment as a Commander of the Order of the British Empire (CBE), but thereafter he refused on three occasions the offer of knighthood. \"If you want a title, what's wrong with Mr.? If you have always been that, then why lose your title? \"I have a title, which is the same one that I have always had. But it's not political. I have a CBE, which I accepted very gratefully\". He said this with great simplicity and charm. The matter of 'theatrical nobility' has prompted others to follow Scofield's example. One high profile example with a twist is actor Anthony Hopkins, now an American citizen, who quipped that he only accepted the knighthood because his wife wanted him to do so. In taking the oath of citizenship, Hopkins pledged to \"renounce the title of nobility to which I have heretofore belonged\". But Scofield's demeanor in his logically crafted refusals from the first so fit this man's very private life. Yet quite averse to being interviewed, he has always been considerate to the public for their patronage. Brilliant man and acting legacy, on and off the stage, Paul Scofield truly is a \"Man for All Seasons\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODg0NjA0OF5BMl5BanBnXkFtZTcwNzA5ODM2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006890","name":"Paul Scofield","idIMDB":"nm0006890"},"actorId":"nm0006890","character":"King Lear","urlCharacter":"http://www.imdb.com/character/ch0011208","main":true},{"actorName":"Irene Worth","urlProfile":"http://www.imdb.com/name/nm0941683","urlPhoto":"","biography":{"dateOfBirth":"23 June 1916","placeOfBirth":" Fairbury, Nebraska, USA","birthName":"Harriet Elizabeth Abrams","bio":"Educated at UCLA, she made her Broadway debut in 1943. Primarily a stage actress she moved to Britain in 1944, where she worked at the Old Vic and with the Royal Shakespeare Company. She returned to the US in 1975, continuing her stage work on Broadway, and making occasional films. She has won three Tony Awards for her stage work.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0941683","name":"Irene Worth","idIMDB":"nm0941683"},"actorId":"nm0941683","character":"Goneril","urlCharacter":"http://www.imdb.com/character/ch0011214","main":true},{"actorName":"Cyril Cusack","urlProfile":"http://www.imdb.com/name/nm0159258","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMzEyNTU5MV5BMl5BanBnXkFtZTcwNTc4MjQwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 November 1910","placeOfBirth":" Durban, Natal, South Africa","birthName":"Cyril James Cusack","bio":"Cyril James Cusack was born in Durban, Natal, South Africa, to Alice Violet (Cole), a Cockney English actress and chorus girl, and James Walter Cusack, an Irish mounted policeman in Natal. He was brought up in Ireland. He was a child star on the Irish stage, appearing first at the age of 7. He toured Ireland with his own theater company. Although he made some very telling film appearances, his small stature kept him from the classic roles. With his wife, Irish-born actress Maureen Cusack (née Mary Margaret Kiely), he is the father of actress Sinéad Cusack and the grandfather of actor Max Irons.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMzEyNTU5MV5BMl5BanBnXkFtZTcwNTc4MjQwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0159258","name":"Cyril Cusack","idIMDB":"nm0159258"},"actorId":"nm0159258","character":"Albany","urlCharacter":"http://www.imdb.com/character/ch0011213","main":true},{"actorName":"Susan Engel","urlProfile":"http://www.imdb.com/name/nm0257146","urlPhoto":"","biography":{"dateOfBirth":"25 March 1935","placeOfBirth":" Vienna, Austria","height":"5' 9\" (1.75 m)","bio":"Susan Engel was born on March 25, 1935 in Vienna, Austria. She is an actress, known for The Cedar Tree (1976), Damage (1992) and King Lear (1971). She has been married to Sylvester Morand since 1968. They have one child.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0257146","name":"Susan Engel","idIMDB":"nm0257146"},"actorId":"nm0257146","character":"Regan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tom Fleming","urlProfile":"http://www.imdb.com/name/nm0281801","urlPhoto":"","biography":{"dateOfBirth":"29 June 1927","placeOfBirth":" Edinburgh, Scotland, UK","birthName":"Thomas Kelman Fleming","bio":"Tom Fleming was born on June 29, 1927 in Edinburgh, Scotland as Thomas Kelman Fleming. He was an actor, known for Mary, Queen of Scots (1971), King Lear (1971) and Spindrift (1959). He died on April 18, 2010 in Edinburgh.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0281801","name":"Tom Fleming","idIMDB":"nm0281801"},"actorId":"nm0281801","character":"Kent","urlCharacter":"http://www.imdb.com/character/ch0011218","main":true},{"actorName":"Anne-Lise Gabold","urlProfile":"http://www.imdb.com/name/nm0300124","urlPhoto":"","biography":{"dateOfBirth":"5 October 1941","placeOfBirth":" Denmark","bio":"Anne-Lise Gabold was born on October 5, 1941 in Denmark. She is an actress, known for Nocturne (1980), King Lear (1971) and Jazz All Around (1969).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0300124","name":"Anne-Lise Gabold","idIMDB":"nm0300124"},"actorId":"nm0300124","character":"Cordelia","urlCharacter":"http://www.imdb.com/character/ch0011207","main":true},{"actorName":"Ian Hogg","urlProfile":"http://www.imdb.com/name/nm0389707","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE1NzgxMjI1N15BMl5BanBnXkFtZTgwODg3NDEzNDE@._V1_UY44_CR42,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 August 1937","placeOfBirth":" Newcastle upon Tyne, England, UK","birthName":"Alexander Ian Hogg","bio":"Ian Hogg was born on August 1, 1937 in Newcastle upon Tyne, England as Alexander Ian Hogg. He is an actor, known for Rasputin (1996), Hitler - La naissance du mal (2003) and Rockliffe's Babies (1987). He has been married to Thea Bean since 1962.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTE1NzgxMjI1N15BMl5BanBnXkFtZTgwODg3NDEzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0389707","name":"Ian Hogg","idIMDB":"nm0389707"},"actorId":"nm0389707","character":"Edmund","urlCharacter":"http://www.imdb.com/character/ch0011209","main":true},{"actorName":"Robert Langdon Lloyd","urlProfile":"http://www.imdb.com/name/nm0486750","urlPhoto":"","biography":{"bio":"Robert Langdon Lloyd is an actor, known for Marat/Sade (1967), King Lear (1971) and The Fragile Heart (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0486750","name":"Robert Langdon Lloyd","idIMDB":"nm0486750"},"actorId":"nm0486750","character":"Edgar","urlCharacter":"http://www.imdb.com/character/ch0011211","main":true},{"actorName":"Jack MacGowran","urlProfile":"http://www.imdb.com/name/nm0532290","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkxNDY5NTY0OF5BMl5BanBnXkFtZTcwNDAzMzIxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1918","placeOfBirth":" Dublin, Ireland","birthName":"John Joseph MacGowran","height":"5' 7\" (1.7 m)","bio":"Jack MacGowran, the great Irish character actor known for his roles in the plays of Samuel Beckett, was born on October 13, 1918, in Ireland. He established his professional reputation as a member of the Abbey Players in Dublin, but he won his greatest fame for essaying Beckett's characters onstage. (In 1971, MacGowran would win the Obie Award for Best Performance By an Actor essaying \"Beckett\" on the off-Broadway stage.) MacGowran's appearance as the Squire's right-hand man in John Ford's paean to Ireland, The Quiet Man (1952), introduced him to world cinema. In 1954 he moved to London, where he joined The Shakespeare Company (before it won the patronage of Queen Elizabeth II and added the sobriquet \"Royal\" to its name). At the Shakespeare Company, he became friends with fellow Irishman-abroad Peter O'Toole, with whom he would co-star in Richard Brooks's Lord Jim (1965) (1965) a decade later. In New York, he appeared as Joxer, one of the greatest roles in modern Irish drama, in the Broadway musical \"Juno\", which was based on 'Sean O'Casey''s 1924 masterpiece \"The Shame of Mary Boyle (1929)\". Fittingly, he played O'Casey's brother Archie in Young Cassidy (1965), one of John Ford's last films (which the director had to abandon owing to ill health). One of his only movie leads came with Wonderwall (1968), an exercise in \"mod\" cinema (a genre that ironically harkened back to the first cinema, that of the silent screen), a film that is remembered mostly for 'George Harrison's score. By that time, MacGowran had established himself as the actor to go to for roles calling for an impish, Puckish character. He was in great demand for comedies, such as the Oscar-winning 'Tom Jones (1963)_ (Best Picture of 1963) and Start the Revolution Without Me (1970). In the classical genre, he memorably played The Fool to the great 'Paul Scofield''s watershed interpretation of King Lear (1971) in Peter Brooks's 1971 film that captured Scofield's magisterial performance, arguably the greatest interpretation of Lear in the 20th century. After starring in the first London production of Beckett's \"Endgame\", MacGowran began a busy career as a character actor in motion pictures. Director Roman Polanski used him twice, as a gangster in his absurdist Cul-De-Sac (1966) and as Professor Abronsius, the Vampire Hunter, in his horror film parody The Fearless Vampire Killers (1967), a role that was written especially for him. His last film was a more straightforward horror picture, the 1973 blockbuster The Exorcist (1973), in which he played a doomed film director. Jack MacGowran died on January 31, 1973, of complications from influenza, which he had caught in London during a flu epidemic. The cinema and the stage lost a unique talent that never has been replaced.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkxNDY5NTY0OF5BMl5BanBnXkFtZTcwNDAzMzIxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0532290","name":"Jack MacGowran","idIMDB":"nm0532290"},"actorId":"nm0532290","character":"Fool","urlCharacter":"http://www.imdb.com/character/ch0011215","main":true},{"actorName":"Patrick Magee","urlProfile":"http://www.imdb.com/name/nm0535861","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTRhMzg2N2UtN2E5ZC00MDI2LTljNDMtZTFlNWJiZGQyOWNiXkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 March 1922","placeOfBirth":" Armagh, Northern Ireland, UK","birthName":"Patrick Joseph Gerard Magee","height":"5' 8\" (1.73 m)","bio":"Born in Armagh, Northern Ireland, Patrick Magee is a classic example of how certain actors rate the stage far more highly than the screen. Magee was well aware that the vast majority of the films that he appeared in were dreadful (he mostly played sinister villains in horror films), but the money came in very handy in financing his distinguished stage work (he was a favorite actor of Samuel Beckett one of whose greatest plays, 'Krapp's Last Tape', was written specifically for him). However, he did do some outstanding work on film, most notably in Stanley Kubrick's A Clockwork Orange (1971) as the crippled writer Mr.Alexander, and in Kubrick's Barry Lyndon (1975), as the chevalier. He also appeared in Joseph Losey's The Servant (1963), Peter Brook's Marat/Sade (1967) and William Friedkin's The Birthday Party (1968). He also appeared in films by such cult directors as Roger Corman, Lucio Fulci and Walerian Borowczyk.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTRhMzg2N2UtN2E5ZC00MDI2LTljNDMtZTFlNWJiZGQyOWNiXkEyXkFqcGdeQXVyMzAwOTU1MTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0535861","name":"Patrick Magee","idIMDB":"nm0535861"},"actorId":"nm0535861","character":"Cornwall","urlCharacter":"http://www.imdb.com/character/ch0045181","main":true},{"actorName":"Barry Stanton","urlProfile":"http://www.imdb.com/name/nm0822719","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4ODA1Mzk1Ml5BMl5BanBnXkFtZTgwNDQ5OTUyMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1940","placeOfBirth":"","bio":"Barry Stanton was born in 1940. He is an actor, known for Shanghai Knights (2003), The Madness of King George (1994) and A Kid in King Arthur's Court (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4ODA1Mzk1Ml5BMl5BanBnXkFtZTgwNDQ5OTUyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0822719","name":"Barry Stanton","idIMDB":"nm0822719"},"actorId":"nm0822719","character":"Oswald","urlCharacter":"http://www.imdb.com/character/ch0011217","main":true},{"actorName":"Alan Webb","urlProfile":"http://www.imdb.com/name/nm0916001","urlPhoto":"","biography":{"dateOfBirth":"2 July 1906","placeOfBirth":" York, England, UK","birthName":"Alan Norton Fletcher Webb","height":"5' 6½\" (1.69 m)","bio":"Alan Webb was born on July 2, 1906 in York, England as Alan Norton Fletcher Webb. He was an actor, known for The Great Train Robbery (1979), Women in Love (1969) and La mégère apprivoisée (1967). He died on June 22, 1982 in Sussex, England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0916001","name":"Alan Webb","idIMDB":"nm0916001"},"actorId":"nm0916001","character":"Gloucester","urlCharacter":"http://www.imdb.com/character/ch0011210","main":true},{"actorName":"Søren Elung Jensen","urlProfile":"http://www.imdb.com/name/nm0255812","urlPhoto":"","biography":{"dateOfBirth":"7 July 1928","placeOfBirth":" Odense, Denmark","bio":"Søren Elung Jensen was born on July 7, 1928 in Odense, Denmark. He was an actor and director, known for Støv for alle pengene (1963), Det støver stadig (1962) and Ankomst indtil videre (1967). He was married to Jonna Hjerl and Rita Angela. He died on January 22, 2017 in Hellerup, Denmark.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0255812","name":"Søren Elung Jensen","idIMDB":"nm0255812"},"actorId":"nm0255812","character":"Duke of Burgundy","urlCharacter":"http://www.imdb.com/character/ch0045183","main":true}],"seasons":[],"idIMDB":"tt0067306","urlIMDB":"http://www.imdb.com/title/tt0067306","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"10","month":"02","year":"1969","remarks":null},null],"copyrightHolder":null},"technical":{"runtime":["2 hr 17 min (137 min)"],"soundMix":["Mono"],"color":["Black and White"],"aspectRatio":["1.66 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"7.3","filmingLocations":[{"location":"Råbjerg Mile, Jylland, Denmark"}],"rated":"GP","awards":[{"award":"Bodil Awards 1971","titlesAwards":[{"titleAwardOutcome":"Won Bodil","categories":[{"category":"Best Actor (Bedste mandlige hovedrolle)","names":[{"name":"Paul Scofield","id":"nm0006890","role":null}]}]}]},{"award":"National Board of Review, USA 1972","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Top Ten Films","names":[]}]}]},{"award":"New York Film Critics Circle Awards 1971","titlesAwards":[{"titleAwardOutcome":"3rd place NYFCC Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Alan Webb","id":"nm0916001","role":null}]}]}]}],"votes":"611","type":"Movie","companyCreditsSimple":[{"idCompany":"co0067956","name":"Athéna Films"},{"idCompany":"co0065715","name":"Filmways Pictures"},{"idCompany":"co0029738","name":"Filmways"}],"keywords":{"keywords":["king","kingdom","tragedy","old man","madness","sibling rivalry","death of daughter","sister sister relationship","murder of daughter","father versus daughter","resentment toward sister","resentment toward father","resentment toward daughter","storm","servant","ruler","romantic rivalry","retirement","reputation","pride","political unrest","ostracism","murder","monarch","loyalty","letter","knight","inheritance","infidelity","illegitimacy","hanging","hallucination","grief","friendship","frame up","father son relationship","dysfunctional family","disillusionment","disguise","curse","court jester","castle","brother","blindness","betrayal","battle","banishment","title in title","royalty","insanity","father daughter relationship","death","death by hanging","shakespeare's king lear","based on play","independent film","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:45:33"}}