{"data":{"movies":[{"title":"Conan the Barbarian","originalTitle":"","year":"1982","releaseDate":"19820514","directors":[{"name":"John Milius","id":"nm0587518"}],"writers":[{"name":"Robert E. Howard","id":"nm0397574"},{"name":"John Milius","id":"nm0587518"}],"runtime":"129 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWIxMzQxZjAtMGFkNC00NzYwLWFiMGEtNzZhZjE5MmFiMmMyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Adventure","Fantasy"],"plot":"A village is attacked by the evil ruler of the Snake Cult, Thulsa Doom () and his evil warriors, when Thulsa Doom and his warriors kills his parents, a young boy named Conan () is enslaved. Years later, Conan grows up and becomes a mighty warrior and is trained as a fighter. After years as a slave and as a gladiator, Conan is set free. Conan sets out on a quest as he vows to avenge his parents and solve the riddle of steel. Joined by a archer named Subotai (), a beautiful thief who falls in love with Conan, Valeria (sandahl Bergman') and a Chinese wizard (), Conan and his companions sets out to rescue Princess Yasmina (), daughter of King Osric (), from the Snake Cult, and get his revenge on Thulsa Doom and avenge his parents.","simplePlot":"A barbarian warrior sets off to avenge his parents and his tribe whom were slain by an evil sorcerer and his henchmen when he was a boy.","actors":[{"actorName":"Arnold Schwarzenegger","urlProfile":"http://www.imdb.com/name/nm0000216","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MDc4NzUyMV5BMl5BanBnXkFtZTcwMTQyMTc5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1947","placeOfBirth":" Thal, Styria, Austria","birthName":"Arnold Alois Schwarzenegger","height":"6' 2\" (1.88 m)","bio":"With an almost unpronounceable surname and a thick Austrian accent, who would have ever believed that a brash, quick talking bodybuilder from a small European village would become one of Hollywood's biggest stars, marry into the prestigious Kennedy family, amass a fortune via shrewd investments and one day be the Governor of California!? The amazing story of megastar Arnold Schwarzenegger is a true \"rags to riches\" tale of a penniless immigrant making it in the land of opportunity, the United States of America. Arnold Alois Schwarzenegger was born July 30, 1947, in the town of Thal, Styria, Austria, to Aurelia (Jadrny) and Gustav Schwarzenegger, the local police chief. From a young age, he took a keen interest in physical fitness and bodybuilding, going on to compete in several minor contests in Europe. However, it was when he emigrated to the United States in 1968 at the tender age of 21 that his star began to rise. Up until the early 1970s, bodybuilding had been viewed as a rather oddball sport, or even a mis-understood \"freak show\" by the general public, however two entrepreneurial Canadian brothers Ben Weider and Joe Weider set about broadening the appeal of \"pumping iron\" and getting the sport respect, and what better poster boy could they have to lead the charge, then the incredible \"Austrian Oak\", Arnold Schwarzenegger. Over roughly the next decade, beginning in 1970, Schwarzenegger dominated the sport of competitive bodybuilding winning five Mr. Universe titles and seven Mr. Olympia titles and, with it, he made himself a major sports icon, he generated a new international audience for bodybuilding, gym memberships worldwide swelled by the tens of thousands and the Weider sports business empire flourished beyond belief and reached out to all corners of the globe. However, Schwarzenegger's horizons were bigger than just the landscape of bodybuilding and he debuted on screen as \"Arnold Strong\" in the low budget Hercules in New York (1970), then director Bob Rafelson cast Arnold in Stay Hungry (1976) alongside Jeff Bridges and Sally Field, for which Arnold won a Golden Globe Award for \"Best Acting Debut in a Motion Picture\". The mesmerizing Pumping Iron (1977) covering the 1975 Mr Olympia contest in South Africa has since gone on to become one of the key sports documentaries of the 20th century, plus Arnold landed other acting roles in the comedy The Villain (1979) opposite Kirk Douglas, and he portrayed Mickey Hargitay in the well- received TV movie The Jayne Mansfield Story (1980). What Arnold really needed was a super hero / warrior style role in a lavish production that utilized his chiseled physique, and gave him room to show off his growing acting talents and quirky humor. Conan the Barbarian (1982) was just that role. Inspired by the Robert E. Howard short stories of the \"Hyborean Age\" and directed by gung ho director John Milius, and with a largely unknown cast, save Max von Sydow and James Earl Jones, \"Conan\" was a smash hit worldwide and an inferior, although still enjoyable sequel titled Conan the Destroyer (1984) quickly followed. If \"Conan\" was the kick start to Arnold's movie career, then his next role was to put the pedal to the floor and accelerate his star status into overdrive. Director James Cameron had until that time only previously directed one earlier feature film titled Piranha Part Two: The Spawning (1981), which stank of rotten fish from start to finish. However, Cameron had penned a fast paced, science fiction themed film script that called for an actor to play an unstoppable, ruthless predator - The Terminator (1984). Made on a relatively modest budget, the high voltage action / science fiction thriller The Terminator (1984) was incredibly successful worldwide, and began one of the most profitable film franchises in history. The dead pan phrase \"I'll be back\" quickly became part of popular culture across the globe. Schwarzenegger was in vogue with action movie fans, and the next few years were to see Arnold reap box office gold in roles portraying tough, no-nonsense individuals who used their fists, guns and witty one-liners to get the job done. The testosterone laden Commando (1985), Raw Deal (1986), Predator (1987), The Running Man (1987) and Red Heat (1988) were all box office hits and Arnold could seemingly could no wrong when it came to picking winning scripts. The tongue-in-cheek comedy Twins (1988) with co-star Danny DeVito was a smash and won Arnold new fans who saw a more comedic side to the muscle- bound actor once described by Australian author / TV host Clive James as \"a condom stuffed with walnuts\". The spectacular Total Recall (1990) and \"feel good\" Kindergarten Cop (1990) were both solid box office performers for Arnold, plus he was about to return to familiar territory with director James Cameron in Terminator 2: Judgment Day (1991). The second time around for the futuristic robot, the production budget had grown from the initial film's $6.5 million to an alleged $100 million for the sequel, and it clearly showed as the stunning sequel bristled with amazing special effects, bone-crunching chases & stunt sequences, plus state of the art computer-generated imagery. Terminator 2: Judgment Day (1991) was arguably the zenith of Arnold's film career to date and he was voted \"International Star of the Decade\" by the National Association of Theatre Owners. Remarkably, his next film Last Action Hero (1993) brought Arnold back to Earth with a hard thud as the self-satirizing, but confusing plot line of a young boy entering into a mythical Hollywood action film confused movie fans even more and they stayed away in droves making the film an initial financial disaster. Arnold turned back to good friend, director James Cameron and the chemistry was definitely still there as the \"James Bond\" style spy thriller True Lies (1994) co-starring Jamie Lee Curtis and Tom Arnold was the surprise hit of 1994! Following the broad audience appeal of True Lies (1994), Schwarzenegger decided to lean towards more family-themed entertainment with Junior (1994) and Jingle All the Way (1996), but he still found time to satisfy his hard-core fan base with Eraser (1996), as the chilling \"Mr. Freeze\" in Batman & Robin (1997) and battling dark forces in the supernatural action of End of Days (1999). The science fiction / conspiracy tale The 6th Day (2000) played to only mediocre fan interest, and Collateral Damage (2002) had its theatrical release held over for nearly a year after the tragic events of Sept 11th 2001, but it still only received a lukewarm reception. It was time again to resurrect Arnold's most successful franchise and, in 2003, Schwarzenegger pulled on the biker leathers for the third time for Terminator 3: Rise of the Machines (2003). Unfortunately, directorial duties passed from James Cameron to Jonathan Mostow and the deletion of the character of \"Sarah Connor\" aka Linda Hamilton and a change in the actor playing \"John Connor\" - Nick Stahl took over from Edward Furlong - making the third entry in the \"Terminator\" series the weakest to date. Schwarzenegger married TV journalist Maria Shriver in April, 1986 and the couple have four children. In October of 2003 Schwarzenegger, running as a Republican, was elected Governor of California in a special recall election of then governor Gray Davis. The \"Governator,\" as Schwarzenegger came to be called, held the office until 2011. Upon leaving the Governor's mansion it was revealed that he had fathered a child with the family's live-in maid and Shriver filed for divorce. Schwarzenegger contributed cameo roles to The Rundown (2003), Around the World in 80 Days (2004) and The Kid & I (2005). Recently, he starred in The Expendables 2 (2012), The Last Stand (2013), Escape Plan (2013), The Expendables 3 (2014), and Terminator Genisys (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MDc4NzUyMV5BMl5BanBnXkFtZTcwMTQyMTc5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000216","name":"Arnold Schwarzenegger","nicknames":["Arnie","Austrian Oak","Conan the Republican","Styrian Oak","The Governator","The Running Man","Conan the Governor","The Machine"],"idIMDB":"nm0000216"},"actorId":"nm0000216","character":"Conan","urlCharacter":"http://www.imdb.com/character/ch0008154","main":true},{"actorName":"James Earl Jones","urlProfile":"http://www.imdb.com/name/nm0000469","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNTg1MzMwM15BMl5BanBnXkFtZTcwNTQyMDgyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 January 1931","placeOfBirth":" Arkabutla, Mississippi, USA","height":"6' 1½\" (1.87 m)","bio":"James Earl Jones was born on January 17, 1931 in Arkabutla, Mississippi, USA. At an early age, he started to take dramatic lessons to calm himself down. It appeared to work as he has since starred in many films over a 40-year period, beginning with the Stanley Kubrick classic Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb (1964). He is probably best known for his role as Darth Vader in the original Star Wars trilogy (for the voice only, as the man in the Darth Vader suit was David Prowse, whose voice was dubbed because of his British West Country accent). He has appeared on the animated series The Simpsons (1989) three times and played Mufasa in The Lion King (1994). James Earl Jones returned as the voice of Darth Vader in Star Wars: Episode III - Revenge of the Sith (2005) and Rogue One (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNTg1MzMwM15BMl5BanBnXkFtZTcwNTQyMDgyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000469","name":"James Earl Jones","nicknames":["Todd"],"idIMDB":"nm0000469"},"actorId":"nm0000469","character":"Thulsa Doom","urlCharacter":"http://www.imdb.com/character/ch0008155","main":true},{"actorName":"Max von Sydow","urlProfile":"http://www.imdb.com/name/nm0001884","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MDQzOTMwN15BMl5BanBnXkFtZTYwMDgyMjM1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 April 1929","placeOfBirth":" Lund, Skåne län, Sweden","birthName":"Max Carl Adolf von Sydow","height":"6' 4\" (1.93 m)","bio":"Max von Sydow was born Carl Adolf von Sydow on April 10, 1929 in Lund, Skåne, Sweden, to a middle-class family. He is the son of Baroness Maria Margareta (Rappe), a teacher, and Carl Wilhelm von Sydow, an ethnologist and folklore professor. His surname traces back to his father's partial German ancestry. When he was in high school, he and a few fellow students, including Yvonne Lombard, started a theatre club which encouraged his interest in acting. After conscription, he began to study at the Royal Dramatic Theatre's acting school (1948-1951), together with Lars Ekborg, Margaretha Krook and Ingrid Thulin. His first role was as Nils the crofter in Alf Sjöberg's Only a Mother (1949). After graduation, he worked at the city theatres in Norrköping and Malmö. His work in the movies by Ingmar Bergman (especially The Seventh Seal (1957), that includes the iconic scenes in which he plays chess with Death) made him well-known internationally, and he started to get offers from abroad. His career abroad began with him playing Jesus in The Greatest Story Ever Told (1965); Hawaii (1966) and The Quiller Memorandum (1966). Since then, his career includes very different kind of characters, like Karl Oskar Nilsson in The Emigrants (1971); Father Lankester Merrin in The Exorcist (1973); Joubert the assassin in Three Days of the Condor (1975), Emperor Ming in Flash Gordon (1980); the villain Ernst Stavro Blofeld in the Never Say Never Again (1983); Liet-Kynes in Dune (1984) the artist Frederick in Hannah and Her Sisters (1986); Lassefar in Pelle the Conqueror (1987), for which he received his first Academy Award nomination; Dr. Peter Ingham in Awakenings (1990); Lamar Burgess in Minority Report (2002) and The Renter in Extremely Loud & Incredibly Close (2011), which earned him his second Academy Award nomination. He has become one of Sweden's most admired and professional actors and is the only male Swedish actor to receive an Oscar nomination. Max has been nominated twice: for Pelle the Conqueror (1987) in 1988 and for Extremely Loud & Incredibly Close (2011) in 2012. He received the Guldbagge Award for Best Director in his directing debut, the drama film Katinka (1988). In 2016, he joined the sixth season of the HBO series Game of Thrones (2011) as the Three-eyed Raven, which earned him his Primetime Emmy Award nomination.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MDQzOTMwN15BMl5BanBnXkFtZTYwMDgyMjM1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001884","name":"Max von Sydow","idIMDB":"nm0001884"},"actorId":"nm0001884","character":"King Osric","urlCharacter":"http://www.imdb.com/character/ch0008157","main":true},{"actorName":"Sandahl Bergman","urlProfile":"http://www.imdb.com/name/nm0000922","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NzEyMDU2MF5BMl5BanBnXkFtZTcwMDM0MzcxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 November 1951","placeOfBirth":" Kansas City, Missouri, USA","height":"5' 9½\" (1.77 m)","bio":"Sandahl Bergman was born November 14, 1951 in Kansas City, Missouri. She later graduated from Shawnee Mission East High School in Prairie Village, Kansas. She moved to New York City while she was in her 20's, and appeared in a number of Bob Fosse productions. Her film debut was in his film All That Jazz (1979). Sandahl went on to appear in Xanadu (1980), Conan the Barbarian (1982) and Kalidor - la légende du talisman (1985).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NzEyMDU2MF5BMl5BanBnXkFtZTcwMDM0MzcxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000922","name":"Sandahl Bergman","nicknames":["Sandy"],"idIMDB":"nm0000922"},"actorId":"nm0000922","character":"Valeria","urlCharacter":"http://www.imdb.com/character/ch0008160","main":true},{"actorName":"Ben Davidson","urlProfile":"http://www.imdb.com/name/nm0203234","urlPhoto":"","biography":{"dateOfBirth":"14 June 1940","placeOfBirth":" Los Angeles, California, USA","birthName":"Benjamin Earl Davidson","height":"6' 8\" (2.03 m)","bio":"Ben Davidson was born on June 14, 1940 in Los Angeles, California, USA as Benjamin Earl Davidson. He was an actor, known for Conan the Barbarian (1982), Necessary Roughness (1991) and Goldie and the Bears (1984). He was married to Kathy. He died on July 2, 2012 in San Diego, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0203234","name":"Ben Davidson","idIMDB":"nm0203234"},"actorId":"nm0203234","character":"Rexor","urlCharacter":"http://www.imdb.com/character/ch0114377","main":true},{"actorName":"Cassandra Gava","urlProfile":"http://www.imdb.com/name/nm0310430","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwODc4NTI0M15BMl5BanBnXkFtZTcwMTQ4NjY5Nw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1959","placeOfBirth":" San Francisco, California, USA","birthName":"Cassandra Gaviola","height":"5' 6\" (1.68 m)","bio":"Strikingly lovely, sultry and exotic Filipino-American brunette beauty Cassandra Gava was born as Cassandra Gaviola on April 28, 1959 in San Francisco, California. Cassandra had an especially memorable part as a seductive witch who makes love to Arnold Schwarzenegger in Conan the Barbarian (1982). Gava was also very effective as the kinky Bridget in the offbeat and original horror vampire sleeper The Black Room (1982). She was likewise solid as enticing stripper Amber in the underrated cop thriller \"Dead Aim.\" Cassandra did guest spots on the TV shows Vega$ (1978), Fantasy Island (1977), Taxi (1978), Amazing Stories (1985), and China Beach (1988). She had a recurring role on the popular daytime TV soap opera \"General Hospital\". In addition to acting, Cassandra Gava has also done modeling work (she appears on the cover of the Jefferson Starship album \"Spitfire\"). More recently Cassandra Gava produced and served as a casting assistant on the acclaimed independent feature Last Goodbye.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwODc4NTI0M15BMl5BanBnXkFtZTcwMTQ4NjY5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0310430","name":"Cassandra Gava","nicknames":["Shmooziac"],"idIMDB":"nm0310430"},"actorId":"nm0310430","character":"The Witch","urlCharacter":"http://www.imdb.com/character/ch0119994","main":true},{"actorName":"Gerry Lopez","urlProfile":"http://www.imdb.com/name/nm0520068","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2Njc2Mjg1NV5BMl5BanBnXkFtZTYwNDE0NTA1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 November 1948","placeOfBirth":" Hawaii, USA","bio":"Gerry Lopez was born in Hawaii, USA in 1948, He became the State of Hawaii junior surfing champion at the age of 14. He won the Master of Pipeline award in 1972. On account of his unique style and mental approach to surfing, he has become known as the surfer who meditates on waves and even god of surfing by many surfers around the world. In July 1999, Gerry was presented with the Waterman of the Year award by the Surf Industry Manufacturers Association (SIMA) in recognition of his efforts to stress the importance of the ocean and its environmental preservation. In 2001 he moved his family and business from Hawaii to Bend, Oregon, where he now continues to shape boards but also can be found snowboarding and water skiing in the Cascade Mountains and surrounding areas.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2Njc2Mjg1NV5BMl5BanBnXkFtZTYwNDE0NTA1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0520068","name":"Gerry Lopez","idIMDB":"nm0520068"},"actorId":"nm0520068","character":"Subotai","urlCharacter":"http://www.imdb.com/character/ch0008162","main":true},{"actorName":"Mako","urlProfile":"http://www.imdb.com/name/nm0538683","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDYzODA3Nl5BMl5BanBnXkFtZTcwMDA0MjEzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 December 1933","placeOfBirth":" Kobe, Japan","birthName":"Makoto Iwamatsu","height":"5' 4\" (1.63 m)","bio":"Born in Japan, Mako was living there with his grandparents while his parents studied art in the United States, when Japan and the U.S. went to war in 1941. His parents remained in the U.S., working for the Office of War Information, and, at the cessation of the conflict, were granted U.S. residency by Congress. Mako joined his parents in New York and studied architecture. He entered the U.S. Army in the early 1950s and acted in shows for military personnel, discovering a talent and love for the theatre. He abandoned his plans to become an architect and instead enrolled at the famed Pasadena Community Playhouse in California. Following his studies there, he appeared in many stage productions and on television. In 1966, he won an Academy Award nomination as Best Supporting Actor for his first film role, as the coolie Po-Han in The Sand Pebbles (1966). Only occasionally since have his roles reached the level of his talents, but he has worked steadily in feature films ever since. He appeared on Broadway in the leading role in Stephen Sondheim's \"Pacific Overtures\" and he co-founded and served as artistic director for the highly-acclaimed East-West Players theatre company in Los Angeles. After a long battle and illness from cancer, he passed away on the twenty first of July in 2006, at the age of 72. He was survived by his wife, Shizuko Hoshi, who co-starred in episodes of M*A*S*H (1972), as well, and his children and grand-children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDYzODA3Nl5BMl5BanBnXkFtZTcwMDA0MjEzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0538683","name":"Mako","idIMDB":"nm0538683"},"actorId":"nm0538683","character":"The Wizard / Narrator","urlCharacter":"http://www.imdb.com/character/ch0008156","main":true},{"actorName":"Valérie Quennessen","urlProfile":"http://www.imdb.com/name/nm0703211","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMjU2Njc1OV5BMl5BanBnXkFtZTcwODAyMTM3NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1957","placeOfBirth":" Boulogne-Billancourt, Hauts-de-Seine, France","birthName":"Valérie Madeleine Michelle Françoise Drodelot-Quennessen","height":"5' 7\" (1.7 m)","bio":"Valerie Quennessen became an actress almost by accident. She started out performing as a child as an acrobat. She was very accomplished in this field and won an award at the age of ten. However, she hadn't seriously considered performing for a living. In her late teens, she enrolled in acting classes as therapy, to overcome severe shyness. To her surprise, she found she enjoyed it and her abilities were noted positively by others. So after briefly attending the Ecole Nationale Superieure des Arts et Techniques du Theatre, she left school to perform full time. She won supporting roles in various projects. Her big break was her role in French Postcards (1979) in 1978. The following year, she completed her studies and traveled to the United States to find roles in Hollywood. She won a role as a princess in Conan the Barbarian (1982), a role she accepted because she had enjoyed fairy tales as a child. She became more familiar to American audiences when she starred in Summer Lovers (1982) with Peter Gallagher and Daryl Hannah. Playing an archaeologist, she dug at an ancient find and, to everyone's surprise, found some real ancient pottery from some 3,500 years ago. The film achieved box office success, in spite of poor reviews. However, afterwards, she left Hollywood to concentrate on her family life. In 1989, she died in an automobile accident. She was 31 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMjU2Njc1OV5BMl5BanBnXkFtZTcwODAyMTM3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0703211","name":"Valérie Quennessen","idIMDB":"nm0703211"},"actorId":"nm0703211","character":"The Princess","urlCharacter":"http://www.imdb.com/character/ch0119998","main":true},{"actorName":"William Smith","urlProfile":"http://www.imdb.com/name/nm0810342","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMzQxNTYzOV5BMl5BanBnXkFtZTcwMDQyOTQ5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 March 1933","placeOfBirth":" Columbia, Missouri, USA","height":"6' 2\" (1.88 m)","bio":"Biker, bare-knuckle brawler, cowboy, Bee-Girl fighter, vampire hunter . . . William Smith has done it all. He was born on March 24, 1933, in Columbia, Missouri, on Rolling Acres, a Hereford cattle ranch. After losing everything to the dust bowl, the family moved to California. From 1942, when he was eight, through young adulthood, Bill appeared in many movies as an extra (uncredited). After high school, he joined the Air Force and served during the Korean War and flew secret ferret missions over Russia while in the NSA. He studied at the University of Munich, and Syracuse University. He graduated cum laude at UCLA. Bill would go on to become one of Hollywood's best-known character actors, with over 300 TV and movie credits. On TV he played in many westerns (did his own horseback riding), cop and sci-fi shows. He's best remembered for appearing in Batman (1966) as, appropriately, Adonis in the last episode. He was a series regular in Hawaii Five-O (1968), where he played Det. James \"Kimo\" Carew (the episode with Cathy Lee Crosby, \"The Kahuna,\" drew particularly high ratings). On the big screen, Bill is legendary for biker flicks (he does his own motorcycle riding). His first biker flick, Run, Angel, Run! (1969), was shot in 13 days for under $100,000--and made $13 million! This was followed by Angels Die Hard (1970). These early, ground-breaking features defined the genre, and would be imitated endlessly (but never duplicated). In the early 1970s, Bill got into horror films--playing a vampire slayer in Grave of the Vampire (1972)--and science fiction, in the camp classic Invasion of the Bee Girls (1973), where he fought killer insect-women wearing sunglasses. Just about everybody's favorite William Smith movie, though, is Any Which Way You Can (1980), where as a bare-knuckle brawler he had a knock-down, drag-out fight with Clint Eastwood that wrecked about half the town. Tougher than Arnold Schwarzenegger, Bill played his dad in Conan the Barbarian (1982), and was one of the few actors in the wildly popular, but critically lambasted, youth-oriented Red Dawn (1984) to receive any recognition from critics. He was in what could be called a textbook example of low-budget, campy sci-fi, Hell Comes to Frogtown (1988). Just about everybody who has ever worked with Bill speaks highly of him. He's educated, intelligent and energetic. A true legend in the business, Bill's acting career is still going strong in 2006, well into the 64th year of his career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMzQxNTYzOV5BMl5BanBnXkFtZTcwMDQyOTQ5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0810342","name":"William Smith","nicknames":["Big Bill"],"idIMDB":"nm0810342"},"actorId":"nm0810342","character":"Conan's Father","urlCharacter":"http://www.imdb.com/character/ch0119995","main":true},{"actorName":"Luis Barboo","urlProfile":"http://www.imdb.com/name/nm0053719","urlPhoto":"","biography":{"dateOfBirth":"20 March 1927","placeOfBirth":" Vigo, Pontevedra, Galicia, Spain","bio":"Luis Barboo was born on March 20, 1927 in Vigo, Pontevedra, Galicia, Spain. He was an actor, known for Conan the Barbarian (1982), God Forgives... I Don't! (1967) and The Wind and the Lion (1975). He died on September 30, 2001 in Madrid, Spain.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0053719","name":"Luis Barboo","idIMDB":"nm0053719"},"actorId":"nm0053719","character":"Red Hair","urlCharacter":"http://www.imdb.com/character/ch0119997","main":true},{"actorName":"Franco Columbu","urlProfile":"http://www.imdb.com/name/nm0173372","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NzY4OTgzOV5BMl5BanBnXkFtZTcwNDE1MDgwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Franco Columbu is an actor and producer, known for The Terminator (1984), Conan the Barbarian (1982) and The Running Man (1987).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5NzY4OTgzOV5BMl5BanBnXkFtZTcwNDE1MDgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0173372","name":"Franco Columbu","idIMDB":"nm0173372"},"actorId":"nm0173372","character":"Pictish Scout","urlCharacter":"http://www.imdb.com/character/ch0186704","main":true},{"actorName":"Leslie Foldvary","urlProfile":"http://www.imdb.com/name/nm0284084","urlPhoto":"","biography":{"bio":"Leslie Foldvary is an actress, known for Conan the Barbarian (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0284084","name":"Leslie Foldvary","idIMDB":"nm0284084"},"actorId":"nm0284084","character":"Sacrificial Snake Girl","urlCharacter":"http://www.imdb.com/character/ch0148287","main":true},{"actorName":"Gary Herman","urlProfile":"http://www.imdb.com/name/nm0379131","urlPhoto":"","biography":{"bio":"Gary Herman is an actor, known for Conan the Barbarian (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0379131","name":"Gary Herman","idIMDB":"nm0379131"},"actorId":"nm0379131","character":"Osric's Guard","urlCharacter":"http://www.imdb.com/character/ch0148289","main":true},{"actorName":"Erik Holmey","urlProfile":"http://www.imdb.com/name/nm0392103","urlPhoto":"","biography":{"dateOfBirth":"25 February 1942","placeOfBirth":" Frederiksberg, Denmark","bio":"Erik Holmey was born on February 25, 1942 in Frederiksberg, Denmark. He is an actor, known for Conan the Barbarian (1982), Pistoleros (2007) and In China They Eat Dogs (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0392103","name":"Erik Holmey","idIMDB":"nm0392103"},"actorId":"nm0392103","character":"Turanian War Officer","urlCharacter":"http://www.imdb.com/character/ch0148286","main":true}],"seasons":[],"idIMDB":"tt0082198","urlIMDB":"http://www.imdb.com/title/tt0082198","business":{"budget":{"money":"$20,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$9,603,139","country":"USA","day":"14","month":"05","year":"1982","remarks":"1 Screen"}],"gross":[{"money":"$38,511,612","country":"USA","day":"05","month":"07","year":"1982","remarks":""},{"money":"$37,699,542","country":"USA","day":"27","month":"06","year":"1982","remarks":""},{"money":"$36,704,314","country":"USA","day":"20","month":"06","year":"1982","remarks":""},{"money":"$35,192,677","country":"USA","day":"13","month":"06","year":"1982","remarks":""},{"money":"$32,874,759","country":"USA","day":"06","month":"06","year":"1982","remarks":""},{"money":"$28,208,895","country":"USA","day":"31","month":"05","year":"1982","remarks":""},{"money":"$20,300,066","country":"USA","day":"23","month":"05","year":"1982","remarks":""},{"money":"$9,603,139","country":"USA","day":"16","month":"05","year":"1982","remarks":""},{"money":"$68,851,475 (Worldwide)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"AUD","country":"1,822,000","day":null,"month":null,"year":null,"remarks":null},{"money":"SEK","country":"3,164,869","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$373,499","country":"USA","day":"05","month":"07","year":"1982","remarks":"353 Screens"},{"money":"$581,821","country":"USA","day":"27","month":"06","year":"1982","remarks":"672 Screens"},{"money":"$869,808","country":"USA","day":"20","month":"06","year":"1982","remarks":"687 Screens"},{"money":"$1,298,380","country":"USA","day":"13","month":"06","year":"1982","remarks":"677 Screens"},{"money":"$2,685,948","country":"USA","day":"06","month":"06","year":"1982","remarks":""},{"money":"$5,234,523","country":"USA","day":"31","month":"05","year":"1982","remarks":""},{"money":"$6,874,042","country":"USA","day":"23","month":"05","year":"1982","remarks":""},{"money":"$9,603,139","country":"USA","day":"16","month":"05","year":"1982","remarks":""}],"admissions":[{"money":"2,496,673","country":"West","day":null,"month":null,"year":null,"remarks":null}],"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"© 1981 Dino De Laurentiis Corporation"},"technical":{"runtime":["2 hr 9 min (129 min)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":["Arriflex 35 BL, Todd-AO Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm (Eastman 100T 5247)"],"cinematographicProcess":["Todd-AO 35 (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"6.9","metascore":"43","filmingLocations":[{"location":"Peñón de Bernal, Vicar, Almería, Spain"}],"rated":"R","awards":[{"award":"Golden Globes, USA 1983","titlesAwards":[{"titleAwardOutcome":"Won Golden Globe","categories":[{"category":"New Star of the Year in a Motion Picture - Female","names":[{"name":"Sandahl Bergman","id":"nm0000922","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1983","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Actress","names":[{"name":"Sandahl Bergman","id":"nm0000922","role":null}]}]},{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Fantasy Film","names":[]},{"category":"Best Music","names":[{"name":"Basil Poledouris","id":"nm0006231","role":null}]},{"category":"Best Costumes","names":[{"name":"John Bloomfield","id":"nm0089278","role":null}]},{"category":"Best Make-Up","names":[{"name":"José Antonio Sánchez","id":"nm0844997","role":null}]}]}]},{"award":"DVD Exclusive Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated Video Premiere Award","categories":[{"category":"Best DVD Audio Commentary","names":[{"name":"Arnold Schwarzenegger","id":"nm0000216","role":null},{"name":"John Milius","id":"nm0587518","role":null}]},{"category":"Best DVD Original Retrospective Documentary/Featurette","names":[{"name":"Laurent Bouzereau","id":"nm0100522","role":null}]}]}]},{"award":"International Film Music Critics Award (IFMCA) 2012","titlesAwards":[{"titleAwardOutcome":"Nominated IFMCA Award","categories":[{"category":"Best Archival Release of an Existing Score","names":[{"name":"Basil Poledouris","id":"nm0006231","role":"music by"},{"name":"Douglass Fake","id":"nm3904205","role":"album produced by"},{"name":"Nick Redman","id":"nm0715018","role":"liner notes by"},{"name":"Joe Sikoryak","id":"nm3379200","role":"album art direction by"}]}]}]},{"award":"International Film Music Critics Award (IFMCA) 2010","titlesAwards":[{"titleAwardOutcome":"Nominated IFMCA Award","categories":[{"category":"Best Archival Release of an Existing Score","names":[{"name":"Basil Poledouris","id":"nm0006231","role":"music by"},{"name":"Nic Raine","id":"nm0706992","role":"conducted by"},{"name":"Jim Fitzpatrick","id":"nm0280539","role":"album produced by"}]}]}]},{"award":"Razzie Awards 1983","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Actor","names":[{"name":"Arnold Schwarzenegger","id":"nm0000216","role":null}]}]}]}],"votes":"117,102","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"},{"idCompany":"co0014380","name":"Dino De Laurentiis Company"},{"idCompany":"co0006728","name":"Edward R. Pressman Film"}],"keywords":{"keywords":["evil sorcerer","cult","gladiator","warlord","actual animal killed","set the god","part of series","narration","film starts with a quote","vulture","group sex","eating human flesh","samurai sword","seduction","one man army","bare chested male","death of pet","muscles","muscleman","female nudity","premarital sex","impalement","female frontal nudity","heroism","ghost","friendship","femme fatale","black magic","battle","sword and sorcery","cannibal","crucifixion","based on pulp magazine","funeral pyre","martial arts","camel","death of mother","death of father","character name in title","warrior","snake","avenge","snake cult","sorcerer","revenge","steel","boy","princess","wizard","master","king","fight","death","archer","thief","barbarian","man versus beast","sex scene","fictional war","axe","army","psychotronic","action hero","voice over narration","robert e. howard","prehistoric times","100th century b.c.","alternate history","stone age","paleolithic age","10000 b.c.","hyborian age","symphonic music score","orchestral music score","name in title","series","narrator","narrated by character","first of series","vengeance","twenty something","three word title","sword forging","sword fighting","sword and fantasy","snake pit","severed hand","serpent handling","self sacrifice","sacrificing own life","revenge seeker","revenge motive","revenge killing","reference to friedrich nietzsche","quote","quotation","lotus","killed by a dog","interspecies sex","human stew","hand","fur clothing","film starts with quote","death by dog","counter culture","broken sword","blueberry","based on multiple works","avenger","alternate version","kung fu","booby trap","face slap","standoff","showdown","spear","violence","blood splatter","sword duel","hand to hand combat","mongol","combat","battlefield","tough guy","kendo","ancient","mythology","murder","murder of mother","murder of father","mother son relationship","fight to the death","father son relationship","capture","brutality","punching a camel","anti hero","demon","break in","two against one","mute villain","suicide","snake worship","hypnotism","loincloth","athlete","desert","death of loved one","bow and arrow","good versus evil","sword and sandal","warrior race","evil power","epic","evil man","megalomaniac","stabbed to death","stabbed in the mouth","stabbed in the chest","slavery","shot in the head","person on fire","orgy","gore","falling from height","killing an animal","cult film","giant snake","wolf","witch","warrior woman","town","serpent","sea","sacrifice","runaway","mutilation","man beast","magic","harem","funeral","final battle","blood","big tower","head on a stake","famous score","poetic justice","katana sword","samurai","part animation","witchcraft","sword fight","christ allegory","torture","cannibalism","severed head","arena","cannibal cult","decapitation","throat slitting","sword"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:23:16"}}