{"data":{"movies":[{"title":"What Price Taxi","originalTitle":"","year":"1932","releaseDate":"19320813","directors":[{"name":"Del Lord","id":"nm0520419"}],"writers":[{"name":"H.M. Walker","id":"nm0907778"}],"runtime":"20 min","countries":["USA"],"languages":["English"],"genres":["Comedy","Short"],"plot":"Flatmates, who drive for the Black and Blue Cab Company, are late for work. As one hustles out the door, a neighbor lady who has locked herself out, asks him for help. He obliges but her husband, who drives a cab for a rival company and is quick to jealousy, catches him with her, won't wait for an explanation, assumes the worst, and decides to make the cabbie's life miserable. He starts by tossing the offending man out the window, then knocks the poor guy's cab onto its side every time he sees him. Other inadvertent mistakes get the flatmate in trouble too. Is there any respite from the bully?","simplePlot":"Ill-tempered Billy proves troublesome for fellow taxi drivers Franklin and Clyde.","actors":[{"actorName":"Clyde Cook","urlProfile":"http://www.imdb.com/name/nm0176971","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDJlMzhjZmUtY2YzNC00M2ZjLTljZDgtZjM5MjcwYTVmMmNlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 December 1891","placeOfBirth":" Port Macquarie, Australia","birthName":"Clyde Wilford Cook","bio":"Diminutive Australian-born silent comic, the son of an engine driver. Clyde Cook earned his sobriquet, 'The Kangaroo Boy', because of his rubber-limbed elasticity. He had been on stage from the age of six, trained as an acrobatic dancer and performed on the Tivoli circuit in his native country, and, later, with the Folies Bergere in Paris. He was back in Australia with J.C. Williamson in 1916, appearing in musical comedy and revues. Three years later, he made his American debut in the Ziegfeld Follies on Broadway and then became the star comic at the New York Hippodrome. Noted for his abilities as a contortionist, he was billed as the Australian \"Inja Rubber Idiot\". Within a year, he was spotted by Fox talent scouts and signed to appear in the 'Sunshine Comedy' series. After moving to California, Clyde developed his own unique screen image, which included a huge paintbrush moustache (a prototype of which he had sported since 1917) and a completely deadpan expression. Not as distinctive in his comic style as Charles Chaplin or Buster Keaton, he never quite made the first rank as a star, though he was immensely popular as a key supporting player in two-reel comedies. In 1925, he joined Hal Roach, where he did some of his best work, which included the Stan Laurel-directed Wandering Papas (1926). In this, he played the cook for a railroad construction crew, with Oliver Hardy as a tough foreman. In the late 20's, Cook appeared in Roach's 'Taxi Boys' series and, with Warner Brothers, as comic relief in several features, often opposite Louise Fazenda. His Australian accent proved popular enough to facilitate a smooth transition to talking pictures. This allowed Clyde to continue his career, albeit mainly in dramatic feature films, such as The Docks of New York (1928), The Taming of the Shrew (1929) and The Dawn Patrol (1930). He even got to play an Australian in The Man from Down Under (1943), but, by then, his parts had become little more than walk-ons and bits. He retired after his one-day effort in the John Wayne starrer Donovan's Reef (1963), and died twenty-one years later, in 1984, of arteriosclerosis.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDJlMzhjZmUtY2YzNC00M2ZjLTljZDgtZjM5MjcwYTVmMmNlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0176971","name":"Clyde Cook","nicknames":["The Kangaroo Boy"],"idIMDB":"nm0176971"},"actorId":"nm0176971","character":"Taxi Boy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Franklin Pangborn","urlProfile":"http://www.imdb.com/name/nm0659427","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NTM3MTc3MF5BMl5BanBnXkFtZTgwOTgzODE1MzE@._V1._CR114,136,541,718_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1889","placeOfBirth":" Newark, New Jersey, USA","birthName":"Joseph Franklin Pangborn","height":"5' 10½\" (1.79 m)","bio":"Franklin Pangborn - a name more befitting a fictionalized bank president rather than a great comedic actor - was a singular character actor but little is known of his early years. He spent some time in developing acting talent prior to appearing on Broadway by March of 1911, and would do six plays until mid-1913. He was noticeably absent afterward and corresponding with the early years of World War I. He was in the US Army after America entered the war in 1917. Pangborn did one more play on Broadway in 1924. Interestingly, for someone immediately identified with comedy, Pangborn's roles were for the most part dramatic and included Armand Duval in \"Camille\", a role in a play adaptation of \"Ben Hur\", and two parts in \"Joseph and His Brethren\". Two years later, Pangborn turned to silent films. And although he would play some villains and romantic leads, that droopy pudding-face of his was bound for comedy. In all these early roles from his debut in 1926, his first talkie (On Trial (1928)), and on through most of 1932 (when he made 24 appearances on film), Pangborn was playing comedic roles, many of which were for short films (many by Mack Sennett) where the players usually had no on-screen persona and no billing credit. His many appearances in shorts tapered off and ended through 1935. These roles were quite varied and continued as such into the later 1930s. He played the compromised husband in two Bing Crosby vehicles (1933); no fewer than three photographers, reporters, radio announcers, bartenders, and much more, including a character meant to parody his own name: 'Mr. Pingboom' (Turnabout (1940)). But through the same period he was piling up a lot of clerk, floorwalker, and, perhaps most of all, hotel manager roles. These latter were the basis for Pangborn typed as the straight-laced, nervous minor official or service provider or manager of whatever whose smug self-assurance in his orderly world is sorely tested. The term 'sissy' (so prominent a condemnation from childhood memories) was used in early film (and still used today by some film historians) as a catchall name for a spectrum of rather gentle and nebulous male personalities; a simpering voice of any kind would be an instant label that also implied the taboo of homosexuality. Pangborn is often first on the list of actors noted as typed in this general category with Edward Everett Horton with his dignified but slightly simpering New England drawl a close second. Animator Robert Clampett at Warner Bros. in the late 1940s patterned his Goofy Gophers, Mac and Tosh, with their polite and flowery speech after both men. Pangborn had a mellow, lyrical voice which he could ramp up to a staccato, rapid-fire rhythm when perturbed. Indeed, the face and the voice fit well with characters of convention and control, as well as the fastidious to the point of being another slang term of many faces: 'prissy'. And maybe that does not include effeminate - he was not quite that - though the term is indelibly tagged to the character type. His characters were the sort of proper and snobby figures who the easygoing American public would find suspicious - and thus all the funnier on screen when they get their comeuppance. Yet Pangborn never implied 'gay' in his portrayals despite all the gender revisionism of today that might reinterpret his work as such. In real life, people are more complex; on the mainstream screen - as opposed to the shadowy blue one - of the 1930s and 40s, characters were more generally defined within usual convention. By the later 1930s, Pangborn had perfected a wonderful sense of timing of demeanor, manner, and voice to fit the control freak who is gradually dragged into his worst nightmare of relative chaos by hapless situation. By this time his characterizations were such a fixture of guaranteed laughs that the movie-going public expected to see him. Pangborn was in great demand to do what he did best. And having already worked from the silent era with great stars and directors, he continued to do so. W.C. Fields was a great fan of him and used him in several movies. He was a constant in smart comedy from Frank Capra and Gregory La Cava to the more extreme screwball comedies of Preston Sturges, though frequently upstaged with such a company of funny men as Sturges gathered around him. The Pangborn progression from very funny to uproarious is seen evolved, for example, from De Cava's My Man Godfrey (1936) to Sturges's Hail the Conquering Hero (1944). In the first he is the volunteer swell who coordinates store-keeping for the scavenger hunt of his fellow - if downright silly - affluent crust of New York society. As the flow of items brought to him for registering turns into a flood (including a live goat kid), his demeanor, mannerisms, and vocal speed display increasing irritation. Head spinning, he is in defensive mode as he fends off shouting, grabbing participants. The role perhaps was his defining moment as established celebrity comedian. In Sturges's movie, and Pangborn appeared in most of his best efforts, he is the committee chairman of the reception for false hero Eddie Bracken, trying to coordinate festivities and caught in a literal battle of bands at the beginning of the film. Converged upon by various hokey town bands who all want to play the featured pieces, Pangborn attempts order but is methodically carried away as people out of the blue arrive to suggest other songs, and the bands continue to assail him with arguments, and finally all play all the songs - and all at once - to prove the most deserving. It is musical chaos with Pangborn finally reduced to desperate blasts on a whistle and jumping up and down, yelling \"Not yet! Not yet!\" It is one of the actor's finest pieces. Yet Pangborn's usual stock of characters could fit drama as well. Actually, in \"Hero\", his coordinator also has some straight scenes as well. In Now, Voyager (1942) as the cruise tourist director, his only problem is that Bette Davis has not arrived on deck to be partnered for the land touring of Rio. As an accomplished stage actor, he did miss the boards. Friend of Edward Horton, he was able to exchange his quirky screen characters for dramatic ones, participating in Horton's Los Angeles-based Majestic Theatre productions. But times changed for Pangborn's specialties. Movies were more diverse and updated as the 1950s ensued. But he was immediately adaptable to the small screen which would re-introduce him. He was right at home as a guest star on TV comedy shows, playing his beloved characters as cameo celebrations of his matter-of-fact stardom. There were a handful of film roles in his last decade with perhaps the overambitious and black-and-white dull but star-studded The Story of Mankind (1957) a bit of a showcase. Also in 1957 he had the singular distinction of being honored as guest announcer - a familiar enough role - and first guest star on the premiere of the \"Tonight Show\" with its first host Jack Paar. To pass away after surgery seems such a disordered way to go for one such as Franklin Pangborn whose on-screen characters struggled for order above all else. There is no order in the frailty of life by definition, but Pangborn's legacy, rich in comedic gems, has and surely will continue to endure.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NTM3MTc3MF5BMl5BanBnXkFtZTgwOTgzODE1MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0659427","name":"Franklin Pangborn","idIMDB":"nm0659427"},"actorId":"nm0659427","character":"Taxi Boy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Geneva Mitchell","urlProfile":"http://www.imdb.com/name/nm0593352","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDIzYmRiNTMtOTNkMy00MjliLTgwNDMtMjA3YjMwNWNlNThjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 February 1908","placeOfBirth":" Medarysville, Indiana, USA","height":"5' 5\" (1.65 m)","bio":"Geneva Mitchell was born on February 3, 1908 in Medarysville, Indiana, USA. She was an actress, known for Morning Glory (1933), Restless Knights (1935) and Dance of the Paper Dolls (1929). She was married to Harry J Bryant. She died on March 10, 1949 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDIzYmRiNTMtOTNkMy00MjliLTgwNDMtMjA3YjMwNWNlNThjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0593352","name":"Geneva Mitchell","idIMDB":"nm0593352"},"actorId":"nm0593352","character":"Jealous Husband's Wife","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Billy Gilbert","urlProfile":"http://www.imdb.com/name/nm0317970","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNTAxODg1MF5BMl5BanBnXkFtZTcwNzA2OTkwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 September 1894","placeOfBirth":" Louisville, Kentucky, USA","birthName":"William Gilbert Barron","height":"5' 11\" (1.8 m)","bio":"The son of singers in the Metropolitan Opera, Billy Gilbert began performing in vaudeville at age 12. He developed a drawn-out, explosive sneezing routine that became his trademark (he was the model for, and voice of, Sneezy in Blanche Neige et les sept nains (1937)). Gilbert's exquisite comic timing made him the perfect foil for such comedians as Stan Laurel and Oliver Hardy, and he was especially memorable as the dim-witted process server Pettibone in His Girl Friday (1940).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNTAxODg1MF5BMl5BanBnXkFtZTcwNzA2OTkwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0317970","name":"Billy Gilbert","idIMDB":"nm0317970"},"actorId":"nm0317970","character":"Jealous Husband","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0023687","urlIMDB":"http://www.imdb.com/title/tt0023687","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["20 min"],"soundMix":["Mono (Western Electric Sound System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.4","filmingLocations":[{"location":"Bruin Theatre, Westwood, Los Angeles, California, USA"}],"awards":[],"votes":"27","type":"Movie","companyCreditsSimple":[{"idCompany":"co0075561","name":"Hal Roach Studios"}],"keywords":{"keywords":["rival","jealousy","neighbor","late for work","taxi driver","taxi","jumping to conclusion","man in bed","thrown out a window","door bell","good samaritan","locked out","car chase","car crash","fall from height","thrown out window","jealous husband","sight gag","two males in bed","roll call","telephone call","apartment house","husband wife relationship"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 22:19:47"}}