{"data":{"movies":[{"title":"Boots and Saddles","originalTitle":"","year":"1937","releaseDate":"19371004","directors":[{"name":"Joseph Kane","id":"nm0437356"}],"writers":[{"name":"Jack Natteford","id":"nm0622435"},{"name":"Jack Natteford","id":"nm0622435"}],"runtime":"58 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjYxODE1MjIzMV5BMl5BanBnXkFtZTcwOTgzMTQyMQ@@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Western"],"plot":"When new owner Spud arrives from England, Autry convinces him not to sell the ranch but to raise horses for the Army. When both Autry's and Neale's bids are the same, the Colonel calls for a race to decide the winner. But that night Neale has Autry's stable burned.","simplePlot":"Young Englishman inherits ranch which he wants to sell, but Gene's gonna turn him into a real westerner instead..","actors":[{"actorName":"Gene Autry","urlProfile":"http://www.imdb.com/name/nm0000810","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MjI4MDk0OF5BMl5BanBnXkFtZTYwMjU5MDM2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1907","placeOfBirth":" Near Tioga, Texas, USA","birthName":"Orvon Grover Autry","height":"5' 9\" (1.75 m)","bio":"After high school Gene Autry worked as a laborer for the St. Louis and San Francisco Railroad in Oklahoma. Next he was a telegrapher. In 1928 he began singing on a local radio station, and three years later he had his own show and was making his first recordings. Three years after that he made his film debut in Ken Maynard's In Old Santa Fe (1934) and starred in a 13-part serial the following year for Mascot Pictures, The Phantom Empire (1935). The next year he signed a contract with Republic Pictures and began making westerns. Autry--for better or worse--pretty much ushered in the era of the \"singing cowboy\" westerns of the 1930s and 1940s (in spite of the presence in his oaters of automobiles, radios and airplanes). These films often grossed ten times their average $50,000 production costs. During World War II he enlisted in the US Army and was assigned as a flight officer from 1942-46 with the Air Transport Command. After his military service he returned to making movies, this time with Columbia Pictures, and finally with his own company, Flying A Productions, which, during the 1950s, produced his TV series The Gene Autry Show (1950), The Adventures of Champion (1955), and Annie Oakley (1954). He wrote over 200 songs. A savvy businessman, he retired from acting in the early 1960s and became a multi-millionaire from his investments in hotels, real estate, radio stations and the California Angels professional baseball team.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MjI4MDk0OF5BMl5BanBnXkFtZTYwMjU5MDM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000810","name":"Gene Autry","nicknames":["The Singing Cowboy"],"idIMDB":"nm0000810"},"actorId":"nm0000810","character":"Gene Autry","urlCharacter":"http://www.imdb.com/character/ch0110561","main":true},{"actorName":"Smiley Burnette","urlProfile":"http://www.imdb.com/name/nm0122470","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzE1NzczMF5BMl5BanBnXkFtZTcwNDAyMzExNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 March 1911","placeOfBirth":" Summum, Illinois, USA","birthName":"Lester Alvin Burnette","bio":"Smiley worked on a local radio station and in Vaudeville after high school. Always interested in music, he was friends with Gene Autry and worked with him on the radio show \"The National Barn Dance\". When Westerns became a big draw with sound, the studios were always on the lookout for singing cowboys. In 1934, both Gene and Smiley made their debuts in In Old Santa Fe (1934). Smiley became well known as Gene's plump sidekick Frog Milhouse, and they worked together in over 80 Westerns. After Gene, Smiley provided the comic relief for other cowboy stars at Republic such as Sunset Carson and Charles Starrett (The Durango Kid). He also provided a lot of the music as he wrote over 300 western songs and sang quite a few in the films. Smiley was the first supporting actor to regularly appear on the Top Ten Western money-maker list. He became well known for his white horse with the black circle around one eye. When he used a team of white horses, as when he was 'Spec Specialist' Smiley Burnette, each white horse had one black circle around one eye. When the 'B' movie Western reign ended in 1953, Smiley retired from the screen. He made occasional appearances on television including being a regular on the music show \"Ozark Jubilee (1959)\". His last performance was as railroad engineer Charlie Pratt on Petticoat Junction (1963) from 1963-67.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzE1NzczMF5BMl5BanBnXkFtZTcwNDAyMzExNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0122470","name":"Smiley Burnette","nicknames":["Ole Frog"],"idIMDB":"nm0122470"},"actorId":"nm0122470","character":"Frog Millhouse","urlCharacter":"http://www.imdb.com/character/ch0181797","main":true},{"actorName":"Judith Allen","urlProfile":"http://www.imdb.com/name/nm0020703","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MzYzMDgwOF5BMl5BanBnXkFtZTgwNzIwNzk1MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1911","placeOfBirth":" New York City, New York, USA","birthName":"Marie Elliott","bio":"The very pretty Judith Allen certainly had the makings of a great actress but her career fell far short, to the point that she came to be more sensational in the tabloid news than she was in the \"B\" films she graced. She was born Marie Elliot in New York City on February 8, 1911, of Scottish parentage, and raised in Belmont, Massachusetts. She began studying theatre at the Leland Powers School in Boston following high school graduation, but this was interrupted when, at the age of 19, she married pro wrestler Gus Sonnenberg (aka \"The Goat\"). The marriage went sour almost immediately and she quickly returned to the dramatic school and picked up where she left off. Following this she joined up with a stock company that toured the New England area and changed her name to the more attractive spelling and sounding Mari Colman. Paramount took notice of \"Mari\" and signed her to a contract following a screen test. Cecil B. DeMille cast her in the virginal leading lady role opposite Charles Bickford and Richard Cromwell in This Day and Age (1933), not knowing that the newcomer was already married, which had been a prerequisite for him casting her. Judith kept her faltering marriage a secret from DeMille and the studio. During shooting, DeMille took it upon himself to change her marquee name to \"Judith Allen.\" Meanwhile, jealous, estranged husband Sonnenberg broke Judith's marriage cover by blabbing to reporters just before the film's opening, to the fury of DeMille. Surprisingly, DeMille did not retaliate against Judith and she continued her Paramount career. The crimer has since reached minor cult status. A beautiful and talented Depression-era co-star for Paramount and a lovely loanout to other studios in both drama and comedy, Judith went on to appear opposite Randolph Scott in The Thundering Herd (1933); Bing Crosby in the musical Too Much Harmony (1933) (in which she sang the song \"The Day You Came Along\"); Richard Arlen in Hell and High Water (1933); Reginald Denny in Dancing Man (1934); Tom Brown in The Witching Hour (1934); Johnny Mack Brown in Marrying Widows (1934); William Haines in Young and Beautiful (1934); and Bruce Cabot in both Men of the Night (1934) and Night Alarm (1934). Her best remembered film roles of that period were in the W.C. Fields classic The Old Fashioned Way (1934), as Fields' daughter, and the Shirley Temple vehicle Bright Eyes (1934) opposite James Dunn. Judith was also reunited with Crosby in the musical She Loves Me Not (1934) but Kitty Carlisle was his musical co-star and Judith appeared in support way down in the credits. Following her divorce, Judith married Irish boxer Jack Doyle, aka \"The Gorgeous Gael,\" in April of 1935 and her career became, naturally, a second priority. A boxing loss to Buddy Baer in August of that year at Madison Square Garden severely damaged Doyle's worldwide reputation. He later tried to focus on a singing career with Allen, touring in vaudeville shows. They were not welcomed when they arrived in Ireland to perform. These upsets triggered an on-again, off-again relationship which made for great tabloid fodder. The couple did co-star together in the film Navy Spy (1937), but it was too late and they eventually split up for good. Trying to regain some late 30s film momentum, Judith was now solidly trapped in second-string programmers with roles opposite \"B\" actors Norman Foster, Regis Toomey, William Boyd, Donald Cook, Gene Autry', Harry Carey, Grant Withers and Dick Purcell for Republic Pictures and its \"Poverty Row\" subsidiaries such as Mascot, Monogram and Winchester. By the end of the decade her leading lady career had all but vanished and she was appearing unbilled in such pictures as Four Girls in White (1939) and the classic The Women (1939). Into the 1940s, Judith found work on radio, on stage, in vaudeville and in nightclubs. To supplement her income, she also sold life insurance. A rare film would come her way in the 40s and 50s, including one lead role in Train to Tombstone (1950), but it was extremely rare. She married a third time, to publisher Rudolph Field in 1941, but the breakup was nasty and it too hit the tabloid papers while they went through the throes of divorce. By 1951, Judith had abandoned the limelight. A fourth marriage would also end in divorce and she suffered a nervous breakdown following the death of her mother. In later years she joined the Mentalphysics Spiritual Teaching and Retreat Center in Joshua Tree, California (Palm Springs area) and eventually became an ordained minister. She died at age 85 in Joshua Tree.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5MzYzMDgwOF5BMl5BanBnXkFtZTgwNzIwNzk1MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0020703","name":"Judith Allen","idIMDB":"nm0020703"},"actorId":"nm0020703","character":"Bernice Allen","urlCharacter":"http://www.imdb.com/character/ch0481605","main":true},{"actorName":"Ronald Sinclair","urlProfile":"http://www.imdb.com/name/nm0801721","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzc3NzY0M15BMl5BanBnXkFtZTYwOTMyMDky._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 January 1924","placeOfBirth":" Dunedin, New Zealand","birthName":"Richard Arthur Hould","bio":"Ronald Sinclair was born on January 21, 1924 in Dunedin, New Zealand as Richard Arthur Hould. He is known for his work on Die Hard (1988), Die Hard 2 (1990) and Spaceballs (1987). He was married to Carol A. Larsen. He died on November 22, 1992 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzc3NzY0M15BMl5BanBnXkFtZTYwOTMyMDky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0801721","name":"Ronald Sinclair","idIMDB":"nm0801721"},"actorId":"nm0801721","character":"Spud - aka Edward, Earl of Grandby","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Guy Usher","urlProfile":"http://www.imdb.com/name/nm0882322","urlPhoto":"","biography":{"dateOfBirth":"9 May 1883","placeOfBirth":" Mason City, Iowa, USA","bio":"Guy Usher was born on May 9, 1883 in Mason City, Iowa, USA. He was an actor, known for The Devil Bat (1940), King of the Zombies (1941) and It's a Gift (1934). He was married to Evelyn. He died on June 16, 1944 in San Diego, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0882322","name":"Guy Usher","idIMDB":"nm0882322"},"actorId":"nm0882322","character":"Col. Allen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Elliott","urlProfile":"http://www.imdb.com/name/nm0254381","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU1NDI2ZTItYzI0YS00MGIwLTg5ZWUtNDIxMzhlY2JkOTIzXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 October 1904","placeOfBirth":" Pattonsburg, Missouri, USA","birthName":"Gordon Nance","bio":"Born Gordon Nance in 1904 on a farm in Pattonsburg, Missouri -- a small town about 60 miles northeast of Kansas City -- the future \"Wild Bill Elliott\" grew up around horses. His father was a commissioner at the Kansas City Stockyards. and at age 16 Elliott won a first-place ribbon in that city's annual \"American Royal Horse and Livestock Show.\" After a move to California, he appeared in a few productions at the Pasadena PLayhouse, where he was spotted by a talent scout. He made his first movie in 1925. A steady stream of movies followed, first silents and then talkies, in which he played too great a variety of roles to be \"typed.\" In many of these movies he was billed as \"Gordon Elliott.\" In 1938, however, Columbia cast him as the lead in its 15-chapter serial, The Great Adventures of Wild Bill Hickok (1938), and Elliott's identification with westerns began. He even began to adopt the names \"Bill\" or \"Wild Bill.\" He also became famous for using the line, \"I'm a peaceable man ... \" (which was inevitably followed by an outburst of violence). Elliott reached his peak of popularity at Columbia when he was teamed with Tex Ritter for a series of films. In 1943 he left Columbia for Republic, where his westerns had somewhat larger budgets. This was followed by a move to Monogram (later Allied Artists) in 1951. He was now back in low-budget B-westerns, the last one appearing in 1954. There followed five other B pictures in which he played a Los Angeles police detective. He filmed \"pilots\" for two potential TV series, \"Marshal of Trail City\" and \"Parson of the West,\" but neither of them sold. His film career over, Elliott settled in Las Vegas where he hosted a weekly TV show in which he interviewed guests and showed some of his old movies. He also became a pitchman for a cigarette company. In 1961 his 34-year marriage to Helen Josephine Meyer ended and he took Dolly Moore as his second wife. He died of lung cancer in 1965 and is buried in Las Vegas at Palm Memorial Park.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTU1NDI2ZTItYzI0YS00MGIwLTg5ZWUtNDIxMzhlY2JkOTIzXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0254381","name":"Bill Elliott","idIMDB":"nm0254381"},"actorId":"nm0254381","character":"Jim Neale","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Ward","urlProfile":"http://www.imdb.com/name/nm0911626","urlPhoto":"","biography":{"bio":"John Ward is an actor, known for Robinson Crusoe of Clipper Island (1936), Boots and Saddles (1937) and Holt of the Secret Service (1941). He was previously married to Athole Shearer.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0911626","name":"John Ward","idIMDB":"nm0911626"},"actorId":"nm0911626","character":"Henry Windy Wyndham","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frankie Marvin","urlProfile":"http://www.imdb.com/name/nm0555529","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWYwYjJhNDItZGY5Ni00YzE1LTk0NjktMDRiNTZkMmIyYzBkXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1904","placeOfBirth":" Butler, Indian Territory, USA [now Oklahoma, USA]","birthName":"Frank James Marvin","bio":"Frankie Marvin was born on January 27, 1904 in Butler, Indian Territory, USA as Frank James Marvin. He was an actor, known for Undersea Kingdom (1936), Public Cowboy No. 1 (1937) and Boots and Saddles (1937). He died on January 18, 1985 in Valencia, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNWYwYjJhNDItZGY5Ni00YzE1LTk0NjktMDRiNTZkMmIyYzBkXkEyXkFqcGdeQXVyMDMxMjQwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0555529","name":"Frankie Marvin","idIMDB":"nm0555529"},"actorId":"nm0555529","character":"Shorty","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris-Pin Martin","urlProfile":"http://www.imdb.com/name/nm0552077","urlPhoto":"","biography":{"dateOfBirth":"19 November 1893","placeOfBirth":" Tucson, Arizona, USA","birthName":"Ysabel Ponciana Chris-Pin Martin Piaz","bio":"Chris-Pin Martin was born on November 19, 1893 in Tucson, Arizona, USA as Ysabel Ponciana Chris-Pin Martin Piaz. He was an actor, known for The Ox-Bow Incident (1943), The Mark of Zorro (1940) and The Fugitive (1947). He died on June 27, 1953 in Montebello, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0552077","name":"Chris-Pin Martin","idIMDB":"nm0552077"},"actorId":"nm0552077","character":"Juan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stanley Blystone","urlProfile":"http://www.imdb.com/name/nm0090008","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjZmYTdmZGUtMTU1ZS00MDM3LThkNzctZWFkODM4M2ZkZjMzL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 August 1894","placeOfBirth":" Eau Claire, Wisconsin, USA","birthName":"William Stanley Blystone","bio":"Stanley Blystone was born on August 1, 1894 in Eau Claire, Wisconsin, USA as William Stanley Blystone. He was an actor, known for Modern Times (1936), Spook Louder (1943) and Half Shot Shooters (1936). He was married to Claire Siebrecht and Alma Tell. He died on July 16, 1956 in Hollywood, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjZmYTdmZGUtMTU1ZS00MDM3LThkNzctZWFkODM4M2ZkZjMzL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0090008","name":"Stanley Blystone","nicknames":["Stan"],"idIMDB":"nm0090008"},"actorId":"nm0090008","character":"Army Sergeant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bud Osborne","urlProfile":"http://www.imdb.com/name/nm0651627","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDdhZGM5NGQtYTVjMy00NzUwLTgwNGEtMDEyMDczYjVlZTVjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 July 1884","placeOfBirth":" Knox County, Texas, USA","birthName":"Lennie B. Osborne","bio":"One of the finest teamsters in Hollywood screen history, Osborne handled the reins for horse-drawn coaches and wagons in countless westerns and historical photoplays from the early 20's through late 50's. And with his weathered, rumpled look, his Texas drawl and his nasal twang, he was often called upon to portray a seedy outlaw in any of those same westerns.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDdhZGM5NGQtYTVjMy00NzUwLTgwNGEtMDEyMDczYjVlZTVjXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0651627","name":"Bud Osborne","idIMDB":"nm0651627"},"actorId":"nm0651627","character":"Joe Larkins - Henchman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0028646","urlIMDB":"http://www.imdb.com/title/tt0028646","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":null,"copyrightHolder":"Autry Qualified Interest Trust and The Autry Foundation, 2001 (on print)"},"technical":{"runtime":["54 min (edited)","58 min (original)"],"soundMix":["Mono (RCA Victor High Fidelity Sound System)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":["Consolidated Film Industries (CFI), Hollywood (CA), USA"],"filmLength":["1,591.36 m (6 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.0","filmingLocations":[{"location":"Iverson Ranch - 1 Iverson Lane, Chatsworth, Los Angeles, California, USA"}],"rated":"PASSED","awards":[],"votes":"163","type":"Movie","companyCreditsSimple":[{"idCompany":"co0020540","name":"Republic Pictures (I)"}],"keywords":{"keywords":["horse","daughter","father","horse thief","texas","actor shares first and last name with character","actor shares last name with character","b western","b movie","u.s. cavalry","bicycle","snob","singer","roundup","rancher","ranch foreman","process server","parrot","nobility","musician","military officer","machine gun","lawyer","impersonation","horse race","gunfire","grenade","fort","fire","fiesta","father daughter relationship","englishman abroad","debt","dancer","cowboy","business competition","bugle","arson","singing cowboy","actor shares first name with character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:59:35"}}