{"data":{"movies":[{"title":"Paper Man","originalTitle":"","year":"1971","releaseDate":"19711112","directors":[{"name":"Walter Grauman","id":"nm0336139"}],"writers":[{"name":"James D. Buchanan","id":"nm0118018"},{"name":"Ronald Austin","id":"nm0042509"}],"runtime":"75 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTYxMDE5M15BMl5BanBnXkFtZTcwNjU1MDc0NQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Mystery","Sci-Fi"],"plot":"Four college students take advantage of a credit card mistakenly issued to someone who doesn't exist, then use their university's computer to erase the charges they run up. But the computer seems to have some ideas of its own ...","simplePlot":"A prank that starts with a group of college students creating a fictitious person so they can get a credit card develops into a plot that leaves three of them dead.","actors":[{"actorName":"Dean Stockwell","urlProfile":"http://www.imdb.com/name/nm0001777","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM3NTk3OTcwOV5BMl5BanBnXkFtZTcwNTUzNzgwMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 March 1936","placeOfBirth":" North Hollywood, Los Angeles, California, USA","birthName":"Robert Dean Stockwell","height":"5' 7\" (1.7 m)","bio":"Photogenic American child actor of the 1940s, popular due in no small measure to his air of innocence and his beautiful, cherubic face with its dimples and his sparkling eyes, topped with a crown of curls. Still an actor in demand while well into his middle years, he is one of the few juvenile performers to succeed lifelong in films. Considering child actors who matured gracefully, his career can be likened perhaps only to that of Natalie Wood, excepting her degree of stardom.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM3NTk3OTcwOV5BMl5BanBnXkFtZTcwNTUzNzgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001777","name":"Dean Stockwell","idIMDB":"nm0001777"},"actorId":"nm0001777","character":"Avery Jensen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stefanie Powers","urlProfile":"http://www.imdb.com/name/nm0694619","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NTMyODE3Nl5BMl5BanBnXkFtZTYwMzY5NTQ2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 November 1942","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Stefanie Zofya Paul","height":"5' 7½\" (1.71 m)","bio":"Stefanie Powers, a graduate of Hollywood High, is a veteran of over 200 television appearances as well as the star of ABC's '80s hit Hart to Hart (1979). At the early age of 15, Stefanie was signed to a movie deal with Columbia Pictures and labeled as one of the brightest up-and-coming stars in America. After a relatively short stint in films, Stefanie took a break from Hollywood for almost five years. When she returned, she focused her acting talents on television with over 100 guest appearances in a few years. In addition to her international fame as Jennifer Hart, Stefanie was also the star of such TV series as The Girl from U.N.C.L.E. (1966), The Feather and Father Gang (1976) and Maggie (1986). Her marriage to actor Gary Lockwood (of 2001: A Space Odyssey (1968) fame) in 1966 ended in 1972. In 1974, Stefanie formed a friendship with actor William Holden. Through many similarities and interests, their relationship blossomed into one of romance that lasted until the sudden death of Holden in 1981. Stefanie is also President of the William Holden Wildlife Foundation, Director of the Mount Kenya Game Ranch, an international speaker on wildlife preservation, and spokesperson for AVID Microchip Technology and works with both the Cincinnati Zoo and Zoo Atlanta. Stefanie finished in the off-Broadway play \"Applause!\" and was signed to be hostess of the new cable channel, Romance Classics. As of November 1999, Stefanie was still heavily involved with her true passion, the William Holden Wildlife Foundation, as well as many other philanthropic causes. She has also lent her support to many Internet projects, including Expedia's Mungo Park, A Doctor in Your House, and Interactive Travel. She has also worked on a series of PBS shows teaching women about finance called \"Funding Your Dreams\". Her latest movie project, Quelque chose demeure ici (2000), is in limited television release in Europe and the United States.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NTMyODE3Nl5BMl5BanBnXkFtZTYwMzY5NTQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0694619","name":"Stefanie Powers","idIMDB":"nm0694619"},"actorId":"nm0694619","character":"Karen McMillan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Stacy","urlProfile":"http://www.imdb.com/name/nm0821082","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTc3NjE0MDc0N15BMl5BanBnXkFtZTgwOTc5MDk0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 December 1936","placeOfBirth":" Los Angeles, California, USA","birthName":"Maurice William Elias","bio":"Born Maurice William Elias in Los Angeles, James Stacy is the son of a Lebanese immigrant father and an American-born mother of Irish-Scottish descent. As a teen, Stacy first aspired to play professional football but settled on a career in the movies after a friend coaxed him into taking some acting classes. Adopting the screen name James Stacy after his cousin Stacy and one of his movie idols, James Dean, he made his film debut in an uncredited role as a reporter in Sayonara (1957), starring Marlon Brando. Garnering little work or recognition in film, Stacy turned to TV. Although he made notable appearances on The Donna Reed Show (1958) and The Adventures of Ozzie & Harriet (1952), it wasn't until 1968 that he gained his first big break, playing a young gunfighter on the TV series, Lancer (1968). Although the show was canceled in 1970, Stacy continued to land smaller roles on TV. In 1973, Stacy lost his left arm and left leg in a serious motorcycle accident that claimed the life of his girlfriend. The resultant medical bills wiped out Stacy's savings, but his ex-wives and his Hollywood friends rallied round and threw a benefit for him. Two years later, he made his professional comeback as a newspaper editor in the Western film, Posse (1975), in a role created expressly for him by the film's director, Kirk Douglas. Stacy was nominated twice for an Emmy: for Just a Little Inconvenience (1977) in 1977 and Cagney & Lacey (1981) in 1986. He retired in 1991. Stacy's personal life was turbulent. Twice-divorced, he was married to actress and singer Connie Stevens (1963-1966) and actress Kim Darby (1968-1969), with whom he had a daughter, Heather Elias. In 1995, Stacy was arrested in California on charges of child molestation. Fleeing to Honolulu, Stacy attempted suicide. The following year, he was convicted of molesting an 11-year old girl. He served his six-year sentence at the California Institution for Men, at Chino. He was listed on National and California state sex offender registries.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTc3NjE0MDc0N15BMl5BanBnXkFtZTgwOTc5MDk0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0821082","name":"James Stacy","idIMDB":"nm0821082"},"actorId":"nm0821082","character":"Jerry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tina Chen","urlProfile":"http://www.imdb.com/name/nm0155395","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM2MjA4OTg1OF5BMl5BanBnXkFtZTgwMjc4MDA5NTE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"height":"5' 5\" (1.65 m)","bio":"Tina Chen is a Golden Globe, Emmy and Drama Desk nominee. She stars in Albert M. Chan's award-winning short film Descendants of the Past, Ancestors of the Future for which she received the Best Actress award from the NYC Downtown Short Film Festival and a Best Actress nomination by the Asians On Film Festival. Descendants of the Past, Ancestors of the Future was shown at many festivals in the US and Canada in 2015. Her other films include the independent feature Almost Perfect (dir. Bertha Bay-Sa Pan), playing opposite Kelly Hu, Roger Rees and Edison Chen (Festival Centerpiece Presentation at the Los Angeles Asian Pacific Film Festival) and the short film, The Potential Wives of Norman Mao (dir. Derek Nguyen), which was part of the Cannes International Film Festival's Short Film Corner. She also starred in The Hawaiians (dir. Tom Gries), playing opposite Charlton Heston, for which she received a Golden Globe award nomination; Alice's Restaurant (dir. Arthur Penn), opposite Arlo Guthrie; Three Days of the Condor (dir. Sydney Pollack), opposite Robert Redford; and the award-winning indie film, Face (dir. Bertha Bay-Sa Pan), opposite Bai Ling. Tina has guest starred on numerous TV shows and was nominated for an Emmy for her performance in the CBS Playhouse special, The Final War of Olly Winter, opposite Ivan Dixon. Besides the above mentioned performers, Tina has acted alongside actors such as Max von Sydow, Anthony Quinn, Geraldine Chaplin, Burt Reynolds, Ernest Borgnine, Wayne Rogers, Stefanie Powers, Jan-Michael Vincent, David Janssen, Kim Basinger, David Carradine and Taylor Schilling. On stage, Tina has played leading roles in many productions on and off Broadway including Empress of China, Comfort Women, The Shanghai Gesture, The Joy Luck Club, A Midsummer Night's Dream, Arthur & Leila, The Year of the Dragon, and David Henry Hwang's Family Devotions. She has directed plays at various theaters in New York, including Pan Asian Repertory Theatre's production of Fairy Bones starring Lucy Liu in her stage debut. Tina co-produced the Broadway production of the Peter Nichols play, Passion, starring Frank Langella, and received a Drama Desk nomination as part of the producing team of the Broadway production of The Rink, by Terrence McNally, starring Chita Rivera and Liza Minnelli. Tina has a talk, Heroes of History: Legacy of My Chinese Family, with 157 pictures. It is about three generations of her mother's family and their contributions to the history of China. In the lecture, which has been presented at China Institute and Urban Stages, both in NYC, and the Mirror Rep. Co. in Greensboro, Vt., she talks about her great-grandfather, who served under three emperors and one empress in the Ching dynasty, her grandfather, who was one of the founders of the Republic of China, and her mother, who also did something special for China. Tina is also a composer. She wrote, among other pieces, the music for the Christmas song This Tree (lyrics by Ruth Wolff), which premiered with the Hong Kong Children's Choir at its Silver Jubilee, and flute music for Pan Asian Repertory's production of Fairy Bones. Her other songs include Mother Life (lyrics by Tina), Words Never Said (lyrics by Diane Winslow), and a Hanukkah song called Eight Nights (lyrics by YiLing Chen-Josephson). The four songs, including This Tree, were presented at Mirror Rep. Co., in Greensboro, Vt., in August of 2014. Over the course of her career, Tina has received numerous honors, including Pan Asian Repertory Theatre's 2016 Legacy Award, Urban Stages' 25th Anniversary Award for Artistic Brilliance, Women's Project's Women of Exceptional Achievement Award, Girl Scouts' Woman of Distinction Award, the Anna Mae Wong Award given by The Asian Fashion Designers of LA, and Azn Americans Actress of the Week Award on Twitter. While pursuing her show business career, Tina worked for over a decade as a researcher in the Serology & Genetics department at the New York Blood Center. She also started Food Liberation, a health food store in New York City. An honorary advisor for the Pan Asian Repertory Theatre, Tina is also on the National Council of the Aspen Music Festival & School and volunteers for Lighthouse International as a reader for the sight impaired.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM2MjA4OTg1OF5BMl5BanBnXkFtZTgwMjc4MDA5NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0155395","name":"Tina Chen","idIMDB":"nm0155395"},"actorId":"nm0155395","character":"Lisa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elliott Street","urlProfile":"http://www.imdb.com/name/nm0834071","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzgwOTU4OV5BMl5BanBnXkFtZTcwODQ0MjQwNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 December 1943","placeOfBirth":" Meridian, Mississippi, USA","birthName":"Wm. H. Elliott","bio":"Elliott Street was born on December 30, 1943 in Meridian, Mississippi, USA as Wm. H. Elliott. He is an actor and writer, known for Last Vegas (2013), Runaway Jury (2003) and The Legend of Bagger Vance (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMzgwOTU4OV5BMl5BanBnXkFtZTcwODQ0MjQwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0834071","name":"Elliott Street","idIMDB":"nm0834071"},"actorId":"nm0834071","character":"Joel Fisher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Olson","urlProfile":"http://www.imdb.com/name/nm0647921","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5ODE3MjUwNF5BMl5BanBnXkFtZTcwNjM1MDAxMw@@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 October 1930","placeOfBirth":" Evanston, Illinois, USA","height":"6' 3\" (1.91 m)","bio":"He was a Chicago-based stage actor by the time he began his film career in the forgettable action drama The Sharkfighters (1956). A reedy, sensitive-looking blond, James Olson showed an understated power in his performances that often received critical applause, but also a taciturn personality that kept audiences at bay. His performance as Joanne Woodward's suitor in Rachel, Rachel (1968) gained him the best reviews of his career and it seemed he had finally earned his stripes, but despite impressive parts in The Andromeda Strain (1971) and Ragtime (1981), not to mention the TV-movies The Family Nobody Wanted (1975) and \"The Court-Martial of George Armstrong Custer (1977), he never made a name for himself. A durable talent, he remained a reliable presence for years with TV guest spots, but by the 1990s he had all but disappeared.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5ODE3MjUwNF5BMl5BanBnXkFtZTcwNjM1MDAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0647921","name":"James Olson","idIMDB":"nm0647921"},"actorId":"nm0647921","character":"Art Fletcher","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Wingreen","urlProfile":"http://www.imdb.com/name/nm0935067","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ0OTIxMjIwNl5BMl5BanBnXkFtZTgwODM4MjE2NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1920","placeOfBirth":" Brooklyn, New York, USA","height":"5' 10½\" (1.79 m)","bio":"Character actor Jason Wingreen was born on October 9, 1920 in Brooklyn, New York City. The son of a Jewish tailor father, Wingreen grew up in the Howard Beach neighborhood of Queens. Jason attended John Adams High School and majored in English and Speech at Brooklyn College (he initially planned on being a sportswriter and wrote about high school sporting events for the daily newspaper the Brooklyn Eagle during his high school years). While at Brooklyn College Wingreen caught the acting bug after taking a mandatory speech course and joined the undergraduate theater group the Masquers, which he became president of in his senior year at college. Following graduation from Brooklyn College in June, 1941, Jason got his first show business job with a marionette company. Wingreen went on to serve in the armed forces during World War II as a member of the 81st Fighter Squadron, 50th Fighter Group, 9th Air Force. In the wake of his tour of duty, Jason returned to Howard Beach and went to the New School on the G.I. Bill. Wingreen helped to found the famed Circle in the Square Theatre company in Greenwich Village in the early 1950's and in 1954 acted for the first time on Broadway in the plays \"Fragile Fox\" and \"The Girl on the Via Flaminia.\" Jason acted on his first TV show in 1955 and acted in his first movie shortly thereafter. In addition, Wingreen was a voting member of the Academy of Motion Picture Arts and Sciences since the early 1960's. Jason died at age 95 at his home in Los Angeles, California on December 25, 2015. He's survived by his son Ned, two grandchildren, and his sister Harriett Wingreen, who was the orchestra pianist for the New York Philharmonic for several decades.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ0OTIxMjIwNl5BMl5BanBnXkFtZTgwODM4MjE2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0935067","name":"Jason Wingreen","idIMDB":"nm0935067"},"actorId":"nm0935067","character":"Doctor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dan Barton","urlProfile":"http://www.imdb.com/name/nm0059114","urlPhoto":"","biography":{"dateOfBirth":"20 September 1921","placeOfBirth":" Chicago, Illinois, USA","birthName":"Daniel Berman","bio":"Dan Barton was born on September 20, 1921 in Chicago, Illinois, USA as Daniel Berman. He was an actor, known for Days of Our Lives (1965), Dan Raven (1960) and The Wacky World of Dr. Morgus (1962). He was married to Gyl Roland and Anne Barton. He died on December 13, 2009 in Sherman Oaks, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0059114","name":"Dan Barton","idIMDB":"nm0059114"},"actorId":"nm0059114","character":"Electronics Expert","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Patten","urlProfile":"http://www.imdb.com/name/nm0666097","urlPhoto":"","biography":{"dateOfBirth":"11 October 1925","placeOfBirth":" Tacoma, Washington, USA","height":"5' 8½\" (1.74 m)","bio":"Robert Patten was born on October 11, 1925 in Tacoma, Washington, USA. He was an actor, known for Twelve O'Clock High (1949), Westworld (1973) and Airport (1970). He was married to Peggy Lloyd and Patricia Grant. He died on December 29, 2001 in Malibu, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0666097","name":"Robert Patten","idIMDB":"nm0666097"},"actorId":"nm0666097","character":"Father","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Suzanne Taylor","urlProfile":"http://www.imdb.com/name/nm0853220","urlPhoto":"","biography":{"dateOfBirth":"28 January 1943","placeOfBirth":" USA","bio":"Suzanne Taylor was born on January 28, 1943 in the USA. She is an actress and producer, known for The Affair (1973), Paper Man (1971) and A Summer Without Boys (1973).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0853220","name":"Suzanne Taylor","idIMDB":"nm0853220"},"actorId":"nm0853220","character":"Mother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Johnny Scott Lee","urlProfile":"http://www.imdb.com/name/nm0497577","urlPhoto":"","biography":{"bio":"Johnny Scott Lee is an actor, known for Paper Man (1971), Revenge! (1971) and The Marriage of a Young Stockbroker (1971).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0497577","name":"Johnny Scott Lee","idIMDB":"nm0497577"},"actorId":"nm0497577","character":"Avery as a Boy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Len Wayland","urlProfile":"http://www.imdb.com/name/nm0915485","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0ODkyOTQ1M15BMl5BanBnXkFtZTgwOTQ5OTU2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1920","placeOfBirth":" Arkansas, USA","birthName":"Leonard Wayland","bio":"Before his break into television in the 1950s, Len Wayland began as a Broadway actor and toured the country starring in such favorites as \"A Streetcar Named Desire\" and \"A Man for All Seasons\". He later started his television career with a stint in soap operas and then, later, in nighttime dramas. He went on to appear in episodes of The F.B.I. (1965), Dragnet 1967 (1967), Barnaby Jones (1973), Ironside (1967) and The Fugitive (1963). He retired from TV about 20 years before his death and spent his retirement playing golf with friends. They thought it fitting, then, that his memorial should, and did, take place at a golf course in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0ODkyOTQ1M15BMl5BanBnXkFtZTgwOTQ5OTU2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0915485","name":"Len Wayland","idIMDB":"nm0915485"},"actorId":"nm0915485","character":"Executive","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dean Harens","urlProfile":"http://www.imdb.com/name/nm0362869","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTg1OWYwMTQtMjdkMi00NGIzLWI1OTktZTlmMTg0NTVmZmIzL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1920","placeOfBirth":" South Bend, Indiana, USA","bio":"Dean Harens was born on June 30, 1920 in South Bend, Indiana, USA. He was an actor, known for General Hospital (1963), Christmas Holiday (1944) and The Suspect (1944). He was married to June Dayton. He died on May 20, 1996 in Van Nuys, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTg1OWYwMTQtMjdkMi00NGIzLWI1OTktZTlmMTg0NTVmZmIzL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0362869","name":"Dean Harens","idIMDB":"nm0362869"},"actorId":"nm0362869","character":"Bureaucrat","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bob Golden","urlProfile":"http://www.imdb.com/name/nm0325392","urlPhoto":"","biography":{"dateOfBirth":"14 May 1926","placeOfBirth":" Los Angeles County, California, USA","bio":"Bob Golden was born on May 14, 1926 in Los Angeles County, California, USA. He was an actor, known for Chinatown (1974), Paper Man (1971) and Fireball Forward (1972). He died on November 5, 1979 in Calabassas, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0325392","name":"Bob Golden","idIMDB":"nm0325392"},"actorId":"nm0325392","character":"Deputy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marcy Lafferty","urlProfile":"http://www.imdb.com/name/nm0114178","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNDYyMjc1OV5BMl5BanBnXkFtZTcwNzY0ODExOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Marcy Lafferty is an actress, known for Star Trek: The Motion Picture (1979), The Day Time Ended (1979) and Kingdom of the Spiders (1977). She was previously married to William Shatner.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNDYyMjc1OV5BMl5BanBnXkFtZTcwNzY0ODExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0114178","name":"Marcy Lafferty","idIMDB":"nm0114178"},"actorId":"nm0114178","character":"Secretary","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0067551","urlIMDB":"http://www.imdb.com/title/tt0067551","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 15 min (75 min)","1 hr 29 min (89 min) (video release) (USA)"],"soundMix":["Mono (RCA Sound Recording)"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.3","filmingLocations":[],"rated":"NOT RATED","awards":[],"votes":"258","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0056447","name":"20th Century Fox Television"}],"keywords":{"keywords":["computer","college","fictitious person","murder mystery","suicide","falling through a window","falling from height","elevator","credit card fraud","murder"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 05:27:22"}}