{"data":{"movies":[{"title":"Mascarade","originalTitle":"Maskerade","year":"1934","releaseDate":"19370125","directors":[{"name":"Willi Forst","id":"nm0286924"}],"writers":[{"name":"Willi Forst","id":"nm0286924"},{"name":"Walter Reisch","id":"nm0281556"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTUzMmY0YmEtY2Q5Zi00ZGY4LWE5MGEtMDJmYmE5YzJkN2RkXkEyXkFqcGdeQXVyMTc4MzI2NQ@@._V1.jpg","countries":["Austria"],"languages":["German"],"genres":["Comedy","Romance"],"plot":"Vienna 1905: After a carnival party the famous painter Heidenick draws his otherwise engaged girlfriend Anita Helfer with very few clothes on, only blurs her face. The image makes it into the newspaper the next day - but since he can't tell the model's name without offending her influential fiancée, he comes up with the fictional name Leopoldine Dur. Unfortunately there is a secretary with that name, who now gets into the focus of high society - and into Heidenick's, much to Anita's anger.","simplePlot":"Vienna 1905: After a carnival party the famous painter Heidenick draws his otherwise engaged girlfriend Anita Helfer with very few clothes on, only blurs her face. The image makes it into ... ","actors":[{"actorName":"Paula Wessely","urlProfile":"http://www.imdb.com/name/nm0921839","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5OTU5MDIxMV5BMl5BanBnXkFtZTgwOTE2NDI0MzE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1907","placeOfBirth":" Vienna, Austria-Hungary [now Austria]","birthName":"Paula Anna Maria Wessely","bio":"Paula Wessely was born on January 20, 1907 in Vienna, Austria-Hungary as Paula Anna Maria Wessely. She was an actress and producer, known for Mascarade (1934), Homecoming (1941) and Episode (1935). She was married to Attila Hörbiger. She died on May 11, 2000 in Vienna, Austria.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5OTU5MDIxMV5BMl5BanBnXkFtZTgwOTE2NDI0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0921839","name":"Paula Wessely","nicknames":["The Wessely"],"idIMDB":"nm0921839"},"actorId":"nm0921839","character":"Leopoldine Dur","urlCharacter":"http://www.imdb.com/character/ch0184358","main":true},{"actorName":"Anton Walbrook","urlProfile":"http://www.imdb.com/name/nm0906932","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2Nzc0Mjc3NV5BMl5BanBnXkFtZTgwNTYyODk5MTE@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 November 1896","placeOfBirth":" Vienna, Austria-Hungary [now Austria]","birthName":"Adolf Anton Wilhelm Wohlbrück","height":"6' (1.83 m)","bio":"This dark, debonair, dashing and extremely distinguished Austrian actor was christened Adolf Wohlbrück in Vienna, the scion of a family of circus clowns. He broke away easily from generations of tradition as the circus life had no appeal whatsoever to Walbrook. Trained by the legendary director Max Reinhardt, Walbrook's reputation grew on both the Austrian and German stages. In between he managed a couple of undistinguished roles in silent films. Billed as Adolf Wohlbrück, the youthfully handsome actor graced a number of romantic films come the advent of sound beginning in 1931. Among them Waltz War (1933) and the gender-bending comedy Viktor and Viktoria (1933), which later served as the inspiration and basis for Blake Edwards' own Victor Victoria (1982) starring wife Julie Andrews. Hollywood beckoned in the late 30s for Walbrook to re-shoot dialog for an upcoming international picture The Soldier and the Lady (1937) again playing Michael Strogoff, a role he had played impeccably in both previous French and German adaptations. With the rise of oppression in Nazi Germany he moved to Great Britain and took his trademark mustache and dark, handsome features to English language films where he went on to appear to great effect. Portraying a host of imperious kings, bon vivants and and foreign dignitaries over the course of his career, he played everything from composer Johann Strauss to the Bavarian King Ludwig I. With a tendency for grand, intense, over-the-top acting, he was nevertheless quite impressive in a number of portrayals. Such included the sympathetic German officer in the landmark Powell and Pressburger satire The Life and Death of Colonel Blimp (1943) and gentle pacifist in another of their collaborations 49th Parallel (1941); as Prince Albert in the black-and-white glossy costumer Victoria the Great (1937) immediately followed by its color remake Queen of Destiny (1938) both opposite Anna Neagle's Queen Victoria; and, most notably, as the obsessively demanding impresario opposite ballerina Moira Shearer in the romantic melodrama The Red Shoes (1948). His stiff and stern military officers were just as notable which included sterling work in The Queen of Spades (1949) and last-speaking English film I Accuse! (1958). He retired from films at the end of the 1950s, and in later years returned to the European stage and included television roles to his resume. He died in Germany in 1967 of a heart attack.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2Nzc0Mjc3NV5BMl5BanBnXkFtZTgwNTYyODk5MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0906932","name":"Anton Walbrook","idIMDB":"nm0906932"},"actorId":"nm0906932","character":"Der Zeichner Heideneck","urlCharacter":"http://www.imdb.com/character/ch0490848","main":true},{"actorName":"Peter Petersen","urlProfile":"http://www.imdb.com/name/nm0676930","urlPhoto":"","biography":{"dateOfBirth":"18 November 1876","placeOfBirth":" Hamburg, Germany","birthName":"Max Paulsen","bio":"Peter Petersen was born on November 18, 1876 in Hamburg, Germany as Max Paulsen. He was an actor, known for Die ewige Maske (1935), Homecoming (1941) and Mascarade (1934). He was married to Hedwig Bleibtreu. He died on March 11, 1956 in Vienna, Austria.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0676930","name":"Peter Petersen","idIMDB":"nm0676930"},"actorId":"nm0676930","character":"Professor Carl Ludwig Harrandt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Walter Janssen","urlProfile":"http://www.imdb.com/name/nm0418079","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODg1YzdkNzktNWM3YS00Yzc4LWFlNTQtMjMyYzQyMWMzNDJkXkEyXkFqcGdeQXVyNTUyMTMyMDg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1887","placeOfBirth":" Krefeld, Germany","birthName":"Walter Philipp Janßen","bio":"Walter Janssen was born on February 7, 1887 in Krefeld, Germany as Walter Philipp Janßen. He was an actor and director, known for Destiny (1921), The Devil Strikes at Night (1957) and Zwei Herzen im Dreiviertel-Takt (1930). He died on January 1, 1976 in Munich, Bavaria, West Germany.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODg1YzdkNzktNWM3YS00Yzc4LWFlNTQtMjMyYzQyMWMzNDJkXkEyXkFqcGdeQXVyNTUyMTMyMDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0418079","name":"Walter Janssen","idIMDB":"nm0418079"},"actorId":"nm0418079","character":"Paul Harrandt, Hofopernkapellmeister","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Olga Tschechowa","urlProfile":"http://www.imdb.com/name/nm0874781","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2RmODAzYjktOTIyNi00MDAwLWE5OTktMjlmNWEwNGVhZmU1XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 April 1897","placeOfBirth":" Alexandropol, Erivan Governorate, Russian Empire [now Gyumri, Armenia]","birthName":"Olga von Knipper","bio":"Olga Chekhova (also Olga Tschechova in German), one of the most popular stars of the silent film era, remained a mysterious person throughout her life and was accused of being a Russian agent in Nazi Germany. She was born Olga Konstantinovna von Knipper on April 26, 1897, in Aleksandropol, Transcaucasia, Russian Empire (now Gyumri, Armenia). She was the second of 3 children in a bilingual Russian-German family. Her father, Konstantin Leonardovich Knipper, a Lutheran of German descent. He made a military career in Russia as a railroad engineer. Young Olga studied art and literature at an art school in St. Petersburg. Later as an immigrant in Germany she claimed friendship with the family of Tsar Nicholas II--who also was of German origin--and that she had encountered the notorious Russian mystic and monk, Grigory Rasputin. In reality, she was sent from St. Petersburg to Moscow to her aunt, actress Olga Knipper-Chekhova, to study acting at Moscow Art Theatre. In 1914, at age 17, she eloped with Russian-Jewish actor Michael Chekhov, nephew of Anton Chekhov. Olga adored her husband, Michael Chekhov, a rising star of stage and film. But he met another beauty, Xenia Zimmer, and became involved in extramarital affair while Olga was pregnant with their child. Their daughter, Ada Tschechowa, was born in 1916. Olga separated from Michael Chekhov during the tragic time of the Russian Revolution in 1917. That same year she made her film debut in a Russian silent film, Anya Kraeva (1917). Olga claimed that she fled Russia disguised as a peasant woman and posed as a mute while carrying a diamond ring in her mouth. In reality she married an officer in the Austro-Hungarian army, Friedrich Jaroshi, and took a train from the Moscow Belorussky station to Vienna, Austria, having travel documents from the Russian Commissar of Culture (and she was also helped by the Russian intelligence agency in exchange for her cooperation). She was later invited to the Soviet Embassy in Berlin for meetings with Soviet officials. In Germany she was introduced to film producer Erich Pommer and renowned director F.W. Murnau, who gave her a leading role in his film, The Haunted Castle (1921). She quickly became a huge star in Europe and played in more than 40 silent films during the decade. Olga was joined by ex-husband Michael Chekhov in several films, including Poliche (1929) (aka \"The Fool of Love\"), which she also directed. Future Nazi leader Adolf Hitler reportedly fell for Olga upon seeing her cold and beautiful face in several films in the 1920s. She was famous for her movie image as a baroness and was courted in the 1930s by Luftwaffe boss Hermann Göring and by Propaganda Minister Joseph Goebbels. Some wives of high-ranking Nazi officials were jealous of and hated the beautiful Olga. Goebbels was known to have visited her home on several occasions when he wanted to be away from his Nazi \"activities\". He invited Olga to several Nazi receptions and introduced her to Adolf Hitler in April 1933. Olga became a personal friend of Hitler and was photographed sitting next to \"Der Fuhrer\" at official events of the Nazi Party. She also received valuable Christmas gifts from Hitler, and regular birthday presents and other tokens of his attention. In 1936 Olga was honored with the title of \"State Actress\" of the Third Reich and was made a German citizen. She married a wealthy Belgian businessman, Marcel Robyns. One day prior to the wedding she had a private reception with Hitler, who gave her permission to retain her German citizenship. Two years later she divorced Robyns and returned to her high-society life in Berlin. Her famous 1939 photo-op with Hitler was thoroughly analyzed in Moscow. She was invited by Soviet officials to join Hermann Göring and Joachim von Ribbentrop at the meeting with Vyacheslav Molotov and Gen. V. N. Merkulov at the Soviet Embassy in Berlin in 1940. At that time Olga was associated with her agent-brother Lev Knipper, who was sent from Moscow to Germany on a secret mission to assassinate Adolf Hitler. The plan was to use one of Olga's visits with Hitler for a suicide attack on the Fuhrer. Olga was kept oblivious of the plan, which was aborted by an order from Joseph Stalin, who became paranoid about the possibility of Germany's alliance with Britain if Hitler was killed. Interestingly, Stalin and Hitler were both amateur film directors in the 1920s, but as dictators they now directed the course of history. Olga was invited by Josef Goebbels to the official reception in Berlin in July of 1941, only a month after the Nazis invaded Russia and Luftwaffe bombings caused massive devastation to Russian cities. Goebbels announced the planned occupation of Moscow. She was being investigated by the SS on orders from SS leader Heinrich Himmler. She was constantly under surveillance by both Nazi and Soviet agents in her Berlin home. As the war progressed and conditions got progressively worse for the Nazi regime, party bosses became increasingly paranoid. Himmler was planning to arrest her in January of 1945. One early morning she was informed of Himmler's move. She immediately called him directly with a request for a favor--to let her finish her morning cup of coffee comfortably. When SS commandos surrounded her home Himmler opened her door and was met by an angry Adolf Hitler, who in no uncertain terms informed Himmler that he had made a mistake. Olga was a beautiful pawn in a dangerous game between the two most destructive powers in the Second World War. She survived through acting, cheating, lying and disguise. She protected her daughter Ada from Nazi anti-Semitism by hiding the fact that her ex-husband, Michael Chekhov, was Jewish. Her brother Lev Knipper was held in a Nazi concentration camp and managed to survive because of his perfect German (and probably with her help). During the savage battle for Berlin just before the war's end, Olga hid in a bomb shelter and was eventually taken prisoner by the Red Army. She was flown to Moscow in April of 1945, for debriefing at the offices of Soviet secret police officials Viktor Abakumov and Lavrenti Beria. She discreetly attended the Moscow Art Theatre performance of \"The Cherry Orchard\" starring her aunt Olga Knipper-Chekhova in May of 1945. They were not allowed to talk and her aunt Olga fainted backstage. After two months of interrogations in Moscow, on June 26, 1945, Olga was flown back to Berlin, where she was assisted by the Soviet Army. She was given money and moved in to a Soviet-supervised house on Spree Strasse in the Soviet sector of East Berlin. Several articles in the French and British presses stated that she was a clandestine agent and secretly decorated by the Soviet government. She praised the Russian victory over the Nazis in a private letter to her aunt Olga Knipper-Chekhova. Meanwhile, the film she made in Hollywood turned out to be a flop in the US market, mainly because of her heavy Russian accent. She continued a film career in Europe and ran her own film production company, Venus-Film Olga Tschechowa. In 1950 she moved to Munich and starred in several films. In 1955 she used her star power to launch a successful cosmetics company, \"Olga Tscheschowa Kosmetik Geselschaft.\" Her remarkable acting career, spanning almost 60 years, ended in 1978, with a small film role as a grandmother. Her personal file was temporarily available for viewing at the KGB archives in Moscow. One report on her was prepared and signed by the notoriously brutal KGB chief Viktor S. Abakumov. On that report a handwritten question was left by a reader in Kremlin: \"What do you suggest to be done with Ms. Chekhova?\", the handwriting was by Joseph Stalin. Stalin was quoted as having said, \"The actress Olga Chekhova will be very useful in the post-war years\", and she probably was. One of her films was titled The Man Who Wanted to Live Twice (1950), or \"The Man Who Wanted to Live Two Lives\"--and that was exactly what she did. In 1955, Olga was saddened by the death of Michael Chekhov. In 1966, Olga suffered from another tragedy: her only daughter Ada died in an airplane crash. Devastated by the painful loss, Olga suffered from bouts of depression and turned to alcohol, but she survived thanks to her strong will and lust for life. She lived for another fifteen years, played a few more roles in the movies, and saw her great-grandchildren grow. Moments before she died, sensing the end was near, she ordered a glass of champagne from her granddaughter Vera Tschechowa. That was March 9, 1980, in Munich, Germany. Her last words were, \"Life is beautiful!\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2RmODAzYjktOTIyNi00MDAwLWE5OTktMjlmNWEwNGVhZmU1XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0874781","name":"Olga Tschechowa","idIMDB":"nm0874781"},"actorId":"nm0874781","character":"Anita Keller - seine Braut","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hilde von Stolz","urlProfile":"http://www.imdb.com/name/nm0903055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTVlZDMyMDUtNDMyOC00YmVjLWExOGItODk3YzU3MWU0ZjgxXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1903","placeOfBirth":" Schäßburg/Segesvár, Hungary, Austria-Hungary [now Sighisoara, Romania]","bio":"Hilde von Stolz was born on July 8, 1903 in Schäßburg/Segesvár, Hungary, Austria-Hungary. She was an actress, known for Le juif Suss (1940), To New Shores (1937) and Life Begins Tomorrow (1933). She died on December 16, 1973 in West Berlin, West Germany.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTVlZDMyMDUtNDMyOC00YmVjLWExOGItODk3YzU3MWU0ZjgxXkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0903055","name":"Hilde von Stolz","idIMDB":"nm0903055"},"actorId":"nm0903055","character":"Gerda - die Frau des Professors","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julia Serda","urlProfile":"http://www.imdb.com/name/nm0784913","urlPhoto":"","biography":{"dateOfBirth":"6 April 1875","placeOfBirth":" Vienna, Austria-Hungary [now Austria]","bio":"Julia Serda was born on April 6, 1875 in Vienna, Austria-Hungary. She was an actress and writer, known for La Habanera (1937), Mach' mich glücklich (1935) and The Old Fritz (1928). She was married to Hans Junkermann. She died on November 3, 1965 in Dresden, Germany.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0784913","name":"Julia Serda","idIMDB":"nm0784913"},"actorId":"nm0784913","character":"Die Fürstin M.","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hans Moser","urlProfile":"http://www.imdb.com/name/nm0002379","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NTE5Mzc4M15BMl5BanBnXkFtZTgwMTA3MTExMzE@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 August 1880","placeOfBirth":" Vienna, Austria-Hungary","birthName":"Johann Julier","height":"5' 1¾\" (1.57 m)","bio":"Hans Moser was born on August 6, 1880 in Vienna, Austria-Hungary as Johann Julier. He was an actor, known for Hallo Dienstmann (1952), Einmal der liebe Herrgott sein (1942) and Der Herr im Haus (1940). He was married to Blanca Moser. He died on June 19, 1964 in Vienna, Austria.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NTE5Mzc4M15BMl5BanBnXkFtZTgwMTA3MTExMzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002379","name":"Hans Moser","nicknames":["Der Moser"],"idIMDB":"nm0002379"},"actorId":"nm0002379","character":"Zacharias, der Gaertner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fritz Imhoff","urlProfile":"http://www.imdb.com/name/nm0408188","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2Y1ZGY1MDgtNGU4My00NDVlLTk5M2UtYjdjNjc5ZGVjMjVlXkEyXkFqcGdeQXVyNTUyMTMyMDg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 January 1891","placeOfBirth":" Vienna, Austria-Hungary","birthName":"Friedrich Jeschke","bio":"Fritz Imhoff, born as Friedrich Jeschke, studied at business college before taking singing and art courses. As a singer, he appeared in 1912 at the Stadttheater bei Wien. From 1920 to 1928, he played at Wiener Johann-Strauss-Theater; then six years at the Theater an der Wien, and from 1934 till 1938, at the Volksoper and in Cabarets and Varietés. In 1939 to 1944, he played at the Raimund-Theater and worked also there as the director till 1948. He began silent movies in 1929 and made more than 100 movies during his life. He had good parts in all of his Films, but some of his funny once were in La Chanson du vin nouveau (1953), Premier avril an 2000 (1952), Black on White (1943) (\"Black on White\"), Trip Acquaintance (1943) (\"Trip Acquaintance\"), Aimé des dieux (1942) (\"Whom the Gods Love\") and Hotel Sacher (1939).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2Y1ZGY1MDgtNGU4My00NDVlLTk5M2UtYjdjNjc5ZGVjMjVlXkEyXkFqcGdeQXVyNTUyMTMyMDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0408188","name":"Fritz Imhoff","idIMDB":"nm0408188"},"actorId":"nm0408188","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Poldi Dur","urlProfile":"http://www.imdb.com/name/nm0243643","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzY1MjUxNDcwMl5BMl5BanBnXkFtZTgwNzM1OTY3MTE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 October 1917","placeOfBirth":" Vienna, Austria-Hungary [now Austria]","birthName":"Elisabeth Handl","bio":"Elisabeth (Liesl) Handl, a young Austrian dancer-turned actress, married Austrian comedy writer-producer Walter Reisch, whose greatest Viennese film success was Maskerade (1934). In that very popular comedy, star Paula Wessely played a prim secretary named Leopoldine \"Poldi\" Dur, whose (fictional) name happens to coincide with the equally fictional name of a scandalous nude model -- leading to numerous misunderstandings and complications. In 1938 Mr & Mrs Reisch moved to the USA, where he enjoyed considerable success as a writer (Ninotchka) and later producer. His wife, nee Elisabeth Handl, acted small roles in a few Hollywood films, 1941-44, usually as young foreign-accented women (in one she played Hitler's niece). But for this second career, in the USA, Elisabeth (Handl) Reisch changed her name to \"Poldi Dur\" -- which the Reisches had lifted from the heroine of Reisch's 1934 Maskerade! (Perhaps they were trying to avoid confusion with the established actress Elissa Landi.) Just think, if Reisch had remade Maskerade in Hollywood, with his wife playing the lead role, we would have been been confronted with the mind-boggling casting of actress \"Poldi Dur\" playing the character \"Poldi Dur\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzY1MjUxNDcwMl5BMl5BanBnXkFtZTgwNzM1OTY3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0243643","name":"Poldi Dur","idIMDB":"nm0243643"},"actorId":"nm0243643","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Grete Natzler","urlProfile":"http://www.imdb.com/name/nm0622462","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgyZDQ1OGItNWY3NS00ZTMwLTliYWQtNTBiNjk3MTM4ZDc5XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1906","placeOfBirth":" Vienna, Austria-Hungary [now Austria]","bio":"Grete Natzler was born on June 19, 1906 in Vienna, Austria-Hungary. She was an actress, known for Swiss Miss (1938), The Student's Romance (1935) and Girls for Sale (1931). She died on June 10, 1999 in Key West, Florida, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTgyZDQ1OGItNWY3NS00ZTMwLTliYWQtNTBiNjk3MTM4ZDc5XkEyXkFqcGdeQXVyNTk5NzQ5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0622462","name":"Grete Natzler","idIMDB":"nm0622462"},"actorId":"nm0622462","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wiener Philharmoniker","urlProfile":"http://www.imdb.com/name/nm1168453","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Wiener Philharmoniker yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1168453","name":"Wiener Philharmoniker","idIMDB":"nm1168453"},"actorId":"nm1168453","character":"Themselves","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0025478","urlIMDB":"http://www.imdb.com/title/tt0025478","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)","1 hr 40 min (100 min) (Austria)","1 hr 36 min (96 min) (Germany)"],"soundMix":["Mono (Tobis-Klangfilm)"],"color":["Black and White"],"aspectRatio":["1.37 : 1"],"camera":null,"laboratory":null,"filmLength":["2,808 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.9","filmingLocations":[{"location":"Vienna, Austria"}],"rated":"16","awards":[{"award":"Venice Film Festival 1934","titlesAwards":[{"titleAwardOutcome":"Nominated Mussolini Cup","categories":[{"category":"Best Foreign Film","names":[{"name":"Willi Forst","id":"nm0286924","role":null}]}]}]}],"votes":"189","type":"Movie","companyCreditsSimple":[{"idCompany":"co0079948","name":"Sascha-Verleih"},{"idCompany":"co0041119","name":"Tobis Filmkunst"}],"keywords":{"keywords":["vienna austria","austria hungary","mistaken identity"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:30:05"}}