{"data":{"movies":[{"title":"Lethal Weapon 2","originalTitle":"","year":"1989","releaseDate":"19890707","directors":[{"name":"Richard Donner","id":"nm0001149"}],"writers":[{"name":"Jeffrey Boam","id":"nm0090151"},{"name":"Shane Black","id":"nm0000948"}],"runtime":"114 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTg0YmE1M2ItNGM2OC00MmZjLTgwMTMtZjlmOGE4N2EyNTVhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English","Afrikaans"],"genres":["Action","Crime","Thriller"],"plot":"Riggs and Murtaugh are trying to take down some drug dealers but the they turn out to be not run of the mill drug dealers; they have automatic weapons and helicopters. Eventually they grab one of their vehicles and find a million dollars worth of gold coins or Krugerrands in the trunk. Later Murtaugh is threatened by the men they're pursuing. That's when the Captain reassigns them to protect a man named Leo Getz who is suppose to testify in a big case. When they get to where Leo is, someone tries to kill him and that's when they learn he laundered half a billion dollars worth of drug money. He then takes them to a place he once went to and that's when the people there start shooting at them. Later when they come back with back up they learn that the men work for the South African consulate and have diplomatic immunity. They deduce that they are the ones they were looking for, but because of they have diplomatic immunity they can't do anything.","simplePlot":"Riggs and Murtaugh are on the trail of South African diplomats who are using their immunity to engage in criminal activities.","actors":[{"actorName":"Mel Gibson","urlProfile":"http://www.imdb.com/name/nm0000154","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTUzOTMwNTM0OV5BMl5BanBnXkFtZTcwNDQwMTUxMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1956","placeOfBirth":" Peekskill, New York, USA","birthName":"Mel Columcille Gerard Gibson","height":"5' 9¾\" (1.77 m)","bio":"Mel Columcille Gerard Gibson was born January 3, 1956 in Peekskill, New York, USA, as the sixth of eleven children of Hutton Gibson, a railroad brakeman, and Anne Patricia (Reilly) Gibson (who died in December of 1990). His mother was Irish, from County Longford, while his American-born father is of mostly Irish descent. Mel and his family moved to Australia in the late 1960s, settling in New South Wales, where Mel's paternal grandmother, contralto opera singer Eva Mylott, was born. After high school, Mel studied at the University of New South Wales in Sydney, performing at the National Institute of Dramatic Arts alongside future film thespians Judy Davis and Geoffrey Rush. After college, Mel had a few stints on stage and starred in a few TV shows. Eventually, he was chosen to star in Mad Max (1979) and in a movie called Tim (1979), co-starring Piper Laurie. The small budgeted movie Mad Max (1979) made him known worldwide, while Tim (1979) garnered him an award for Best Actor from the Australian Film Institute (equivalent to the Oscar). Later, he went on to star in Gallipoli (1981), which earned him a second award for Best Actor from the AFI. In 1980, he married Robyn Moore and had seven children. In 1984, Mel made his American debut in The Bounty (1984), which co-starred Anthony Hopkins. Then in 1987, Mel starred in what would become his signature series, Lethal Weapon (1987), in which he played \"Martin Riggs\". In 1990, he took on the interesting starring role in Hamlet (1990), which garnered him some critical praise. He also made the more endearing Forever Young (1992) and the somewhat disturbing The Man Without a Face (1993). 1995 brought his most famous role as \"Sir William Wallace\" in Braveheart (1995), for which he won two Oscars for Best Picture and Best Director. From there, he made such box office hits as The Patriot (2000), Ransom (1996), and Payback (1999). Today, Mel remains an international superstar mogul, continuously topping the Hollywood power lists as well as the Most Beautiful and Sexiest lists.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTUzOTMwNTM0OV5BMl5BanBnXkFtZTcwNDQwMTUxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000154","name":"Mel Gibson","idIMDB":"nm0000154"},"actorId":"nm0000154","character":"Martin Riggs","urlCharacter":"http://www.imdb.com/character/ch0002922","main":true},{"actorName":"Danny Glover","urlProfile":"http://www.imdb.com/name/nm0000418","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODM2MzQwN15BMl5BanBnXkFtZTcwMjY2OTI5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1946","placeOfBirth":" San Francisco, California, USA","birthName":"Danny Lebern Glover","height":"6' 4\" (1.93 m)","bio":"Actor, producer and humanitarian Danny Glover has been a commanding presence on screen, stage and television for more than 25 years. Glover was born in San Francisco, California, to Carrie (Hunley) and James Glover, postal workers who were also active in civil rights. Glover trained at the Black Actors' Workshop of the American Conservatory Theater. It was his Broadway debut in Fugard's Master Harold...and the Boys, which brought him to national recognition and led director Robert Benton to cast Glover in his first leading role in 1984's Oscar®-nominated Best Picture Places in the Heart. The following year, Glover starred in two more Best Picture nominees: Peter Weir's Witness and Steven Spielberg's The Color Purple. In 1987, Glover partnered with Mel Gibson in the first Lethal Weapon film and went on to star in three hugely successful Lethal Weapon sequels. Glover has also invested his talents in more personal projects, including the award-winning To Sleep With Anger, which he executive produced and for which he won an Independent Spirit Award for Best Actor; Bopha!; Manderlay; Missing in America; and the film version of Athol Fugard's play Boesman and Lena. On the small screen, Glover won an Image Award and a Cable ACE Award and earned an Emmy nomination for his performance in the title role of the HBO movie Mandela. He has also received Emmy nominations for his work in the acclaimed miniseries Lonesome Dove and the telefilm Freedom Song. As a director, he earned a Daytime Emmy nomination for Showtime's Just a Dream. Glover's film credits range from the blockbuster Lethal Weapon franchise to smaller independent features, some of which Glover also produced. He co-starred in the critically acclaimed feature Dreamgirls directed by Bill Condon and in Po' Boy's Game for director Clement Virgo. He appeared in the hit feature Shooter for director Antoine Fuqua, Honeydripper for director John Sayles, and Be Kind, Rewind for director Michel Gondry. Glover has also gained respect for his wide-reaching community activism and philanthropic efforts, with a particular emphasis on advocacy for economic justice, and access to health care and education programs in the United States and Africa. For these efforts, Glover received a 2006 DGA Honor. Internationally, Glover has served as a Goodwill Ambassador for the United Nations Development Program from 1998-2004, focusing on issues of poverty, disease, and economic development in Africa, Latin America, and the Caribbean, and serves as UNICEF Ambassador. In 2005, Glover co-founded Louverture Films dedicated to the development and production of films of historical relevance, social purpose, commercial value and artistic integrity. The New York based company has a slate of progressive features and documentaries including Trouble the Water, which won the Grand Jury Prize at the 2008 Sundance Film Festival, Africa Unite, award winning feature Bamako, and most recent projects Uncle Boonmee Who Can Recall His Past Lives, and The Disappearance of McKinley Nolan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODM2MzQwN15BMl5BanBnXkFtZTcwMjY2OTI5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000418","name":"Danny Glover","idIMDB":"nm0000418"},"actorId":"nm0000418","character":"Roger Murtaugh","urlCharacter":"http://www.imdb.com/character/ch0002926","main":true},{"actorName":"Joe Pesci","urlProfile":"http://www.imdb.com/name/nm0000582","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzc3MTcxNDYxNV5BMl5BanBnXkFtZTcwOTI3NjE1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1943","placeOfBirth":" Newark, New Jersey, USA","birthName":"Joseph Frank Pesci","height":"5' 4\" (1.63 m)","bio":"Compact Italian-American actor Joe Pesci was born February 9, 1943, in Newark, NJ, to Mary (Mesce), a part-time barber, and Angelo Pesci, a bartender and forklift driver. Pesci first broke into entertainment as a child actor and by the mid-50s was starring on the series \"Star Time Kids\". In the mid-'60s he released a record under the stage name of \"Joe Ritchie\" titled \"Little Joe Sure Can Sing\", and was also playing guitar with several bands, including Joey Dee and The Starliters. He even joined with friend Frank Vincent to start a vaudeville-style comedy act, but met with limited success (interestingly, Pesci and Vincent would later go on to co-star in several gangster films together, including Goodfellas (1990) and Casino (1995)) Pesci's first film role was as an uncredited dancer in Hey, Let's Twist! (1961) and then he had to wait another 15 years for a minor part in The Death Collector (1976). His work in the second film was seen by Robert De Niro, who convinced director Martin Scorsese to cast him as \"Joey LaMotta\" in the epic boxing film Raging Bull (1980), which really got him noticed in Hollywood. He played opposite Rodney Dangerfield in Easy Money (1983), was with buddy DeNiro again in Il était une fois en Amérique (1984), nearly stole the show as con man Leo Getz in Lethal Weapon 2 (1989) and scored a Best Supporting Actor Oscar playing the psychotic Tommy DeVito in \"Goodfellas\". His comedic talents shone again in the mega-popular Home Alone (1990), and he put in a terrific performance as co-conspirator David Ferrie in JFK (1991). Pesci was back again as Leo Getz for Lethal Weapon 3 (1992), and was still a bumbling crook in Home Alone 2: Lost in New York (1992), and had a minor role in the Robert De Niro-directed A Bronx Tale (1993). He was lured back by Scorsese to play another deranged gangster named Nicky (based on real-life hood Tony Spilotro [aka \"The Ant\"]) in the violent Casino (1995), and starred in the comedies 8 Heads in a Duffel Bag (1997) and Gone Fishin' (1997), although both failed to fire at the box office. He returned again as fast-talking con man Leo Getz in Lethal Weapon 4 (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzc3MTcxNDYxNV5BMl5BanBnXkFtZTcwOTI3NjE1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000582","name":"Joe Pesci","idIMDB":"nm0000582"},"actorId":"nm0000582","character":"Leo Getz","urlCharacter":"http://www.imdb.com/character/ch0002924","main":true},{"actorName":"Joss Ackland","urlProfile":"http://www.imdb.com/name/nm0000722","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA1MjQwMzI2OV5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 February 1928","placeOfBirth":" North Kensington, London, England, UK","birthName":"Sidney Edmond Jocelyn Ackland","height":"6' 1\" (1.85 m)","bio":"Joss Ackland, the distinguished English actor who has appeared in over 100 movies, scores of plays and a plethora of television programs in his six-decade career, was born Sidney Edmond Jocelyn Ackland on February 29, 1928, in North Kensington, London. After attending London's Central School of Speech and Drama, the 17-year-old Ackland made his professional stage debut in \"The Hasty Heart\" in 1945. Although he first appeared on film in John Boulting's and Roy Boulting's Oscar-winning thriller Seven Days to Noon (1950) in an uncredited bit role, he made his credited debut in a supporting role in Vernon Sewell's Ghost Ship (1952). He would not again grace the big screen until the end of the decade. Instead, Ackland spent the latter half of the 1940s and the first half of the 1950s honing his craft in regional theatrical companies. In 1955 he left the English stage behind and moved to Africa to manage a tea plantation, an experience that likely informed his heralded performance 20 years later in White Mischief (1987). In his two years in Africa he wrote plays and did service as a radio disc jockey. Upon his return to England in 1957, he joined the Old Vic company. From 1962-64 he served as associate director of the Mermaid Theatre. Subsequently, his stage acting career primarily was in London's commercial West End theater, where he made a name for himself in musicals. He was distinguished as Captain Hook in the musical version of \"Peter Pan\" and as Juan Peron in \"Evita\". In the straight theater he was a memorable Falstaff in William Shakespeare's \"Henry IV Parts 1 & 2\" and as Captain Shotover in George Bernard Shaw's \"Heartbreak House\". In the 1960s Ackland began appearing more regularly in films, and his career as a movie character actor picked up rapidly in the 1970s and began to flourish in the 1980s. It has shown little sign of abating in the 21st century, even though he's well into his 70s. In addition to his performance in \"White Mischief\", among his more notable turns as an actor before the camera came in the BBC-TV production of Shadowlands (1985), in which he played 'C.S. Lewis', and in Lethal Weapon 2 (1989) as the South African heavy. He is the father of seven children, whom he listed as his \"hobby\" in a 1981 interview. On December 31, 2000, Joss Ackland was named a Commander of the British Empire on the New Year's Honours List for his 50 years of service to the English stage, cinema and television.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA1MjQwMzI2OV5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000722","name":"Joss Ackland","idIMDB":"nm0000722"},"actorId":"nm0000722","character":"Arjen Rudd","urlCharacter":"http://www.imdb.com/character/ch0002930","main":true},{"actorName":"Derrick O'Connor","urlProfile":"http://www.imdb.com/name/nm0640299","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM4MDcwNzk5MF5BMl5BanBnXkFtZTcwNDM3MzAzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1941","placeOfBirth":" Dublin, Ireland","bio":"Derrick O'Connor was born in Dublin, Ireland, and raised in London, UK. He currently resides with his family in San Francisco, CA. He is a former member of the Royal Shakespeare Company and the Scottish National Theatre, with many leading stage performances in Edinburgh, Stratford-on-Avon and London's West End. His long and successful career includes numerous starring roles in U.S., British and Australian film and television. O'Connor supports independent filmmaking as an important platform for emerging talent, to ensure a healthy future for the film industry. Projects he has worked on include Seascape (1994) and The First Vampire: Don't Fall for the Devil's Illusions (2004). O'Connor has been seen most recently by American audiences in the feature films Daredevil (2003), End of Days (1999), How to Make an American Quilt (1995) and Lethal Weapon 2 (1989). His many American TV guest appearances include Alias (2001), Tracey Ullman's Tracey Takes On... (1996) and Murder, She Wrote (1984). British film credits include Terry Gilliam's Brazil (1985), Time Bandits (1981) and Jabberwocky (1977), John Boormans Hope and Glory (1987), Harold Pinter's Butley (1974) and Dealers (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM4MDcwNzk5MF5BMl5BanBnXkFtZTcwNDM3MzAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0640299","name":"Derrick O'Connor","idIMDB":"nm0640299"},"actorId":"nm0640299","character":"Pieter Vorstedt","urlCharacter":"http://www.imdb.com/character/ch0002936","main":true},{"actorName":"Patsy Kensit","urlProfile":"http://www.imdb.com/name/nm0000475","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMDUwOTEzMl5BMl5BanBnXkFtZTcwNDE2ODY5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 March 1968","placeOfBirth":" Hounslow, London, England, UK","birthName":"Patricia Jude Francis Kensit","height":"5' 5\" (1.65 m)","bio":"Patsy Kensit was born on March 4, 1968 in Hounslow, London, England as Patricia Jude Francis Kensit. She is an actress, known for Holby City (1999), Lethal Weapon 2 (1989) and Emmerdale (1972). She was previously married to Jeremy Healy, Liam Gallagher, Jim Kerr and Dan Donovan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMDUwOTEzMl5BMl5BanBnXkFtZTcwNDE2ODY5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000475","name":"Patsy Kensit","nicknames":["Pats"],"idIMDB":"nm0000475"},"actorId":"nm0000475","character":"Rika Van Den Haas","urlCharacter":"http://www.imdb.com/character/ch0002929","main":true},{"actorName":"Darlene Love","urlProfile":"http://www.imdb.com/name/nm0522306","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NDU3Mjk2N15BMl5BanBnXkFtZTcwMTM0Nzk5OA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1938","placeOfBirth":" Los Angeles, California, USA","birthName":"Darlene Wright","height":"5' 2\" (1.57 m)","bio":"Born Darlene Wright in Los Angeles in 1938, she began her career as lead singer with the vocal trio, The Blossoms. After a spell as regulars on ABC TV's variety show Shindig! (1964) in the early 60s, the trio went on to sing backup on a variety of Elvis Presley recordings, and even backed him on his 1968 NBC-TV special Elvis (1968). For a while, they backed Tom Jones during some of his Las Vegas shows. The Blossoms have the rare distinction of recording a number one hit without ever receiving any credit. Years before the advent of Milli Vanilli, Darlene Love, Fanita James and Gracie Nitzsche sang vocals on the Gene Pitney-penned song \"He's a Rebel\" that was championed as The Crystals' first (and only) No. 1 US hit. Because of confounding logistics, record producer Phil Spector had to use The Blossoms because The Crystals were on the wrong coast of the US at the time. And since he was up against the clock in L.A. attempting to get his production on the airwaves before the Vikki Carr version, he had no choice. Love also sang vocals on the Bob B. Soxx and the Blue Jeans top twenty hit \"Zip-a-Dee Doo Dah\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NDU3Mjk2N15BMl5BanBnXkFtZTcwMTM0Nzk5OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0522306","name":"Darlene Love","idIMDB":"nm0522306"},"actorId":"nm0522306","character":"Trish Murtaugh","urlCharacter":"http://www.imdb.com/character/ch0002938","main":true},{"actorName":"Traci Wolfe","urlProfile":"http://www.imdb.com/name/nm0938159","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MTE1MTYzOV5BMl5BanBnXkFtZTgwMDg2ODIwMjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1961","placeOfBirth":" Plainfield, New Jersey, USA","bio":"Traci Wolfe was born in 1961 in Plainfield, New Jersey, USA. She is an actress, known for Lethal Weapon (1987), Lethal Weapon 2 (1989) and Lethal Weapon 3 (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4MTE1MTYzOV5BMl5BanBnXkFtZTgwMDg2ODIwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0938159","name":"Traci Wolfe","idIMDB":"nm0938159"},"actorId":"nm0938159","character":"Rianne Murtaugh","urlCharacter":"http://www.imdb.com/character/ch0002935","main":true},{"actorName":"Steve Kahan","urlProfile":"http://www.imdb.com/name/nm0434676","urlPhoto":"","biography":{"dateOfBirth":"1930","placeOfBirth":"","height":"6' 1½\" (1.87 m)","bio":"Kahan is the cousin of film writer, producer and director Richard Donner. Kahan may be best known for playing the bedraggled \"Captain Ed Murphy\" trying to keep Mel Gibson and Danny Glover in check in the \"Lethal Weapon\" series of films. He has appeared in several television series as recurring characters as well.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0434676","name":"Steve Kahan","idIMDB":"nm0434676"},"actorId":"nm0434676","character":"Captain Murphy","urlCharacter":"http://www.imdb.com/character/ch0002941","main":true},{"actorName":"Mark Rolston","urlProfile":"http://www.imdb.com/name/nm0001679","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDc0MTUxNV5BMl5BanBnXkFtZTcwMDUzMjE5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 December 1956","placeOfBirth":" Baltimore, Maryland, USA","height":"5' 11\" (1.8 m)","bio":"Mark knew he wanted to be an actor at age nine; he took his career and studies to Europe to fulfill his dream. Once there, he was asked by five major acting schools to join them. He chose the Drama Centre London where he studied for five years. Then, Mark beat out 2,000 others for an important position in the Theatre Communications Group National Finals. This led to a year's tour of the United States in the lead role in \"Richard II.\" This was the beginning of his U.S. career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NDc0MTUxNV5BMl5BanBnXkFtZTcwMDUzMjE5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001679","name":"Mark Rolston","idIMDB":"nm0001679"},"actorId":"nm0001679","character":"Hans","urlCharacter":"http://www.imdb.com/character/ch0002932","main":true},{"actorName":"Jenette Goldstein","urlProfile":"http://www.imdb.com/name/nm0001280","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0ODEyMDMwM15BMl5BanBnXkFtZTYwNDI3MTAz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 February 1960","placeOfBirth":" Los Angeles, California, USA","birthName":"Jenette Elise Goldstein","height":"5' 3\" (1.6 m)","bio":"Jenette Goldstein is a true chameleon. She is so effective as an actress, it is nearly impossible to recognize her from role to role. Jenette spent most of her childhood in Los Angeles. Born to theater-loving parents, she attended fine arts-oriented schools, and was the young star of the drama classes. She often competed in citywide drama competitions with soon-to-be famous peers Val Kilmer, Gina Gershon, Kevin Spacey and Mare Winningham. To hone her craft after high school, Jenette studied at London's Webber Douglas Academy of Dramatic Art, and at Circle in the Square Theater in New York City, mastering drama theory, physicality, dialects and the classics. It was in London, while performing in local theater productions, where Jenette answered an audition request for American actors with British Equity cards. Thinking it was another play or a small film, she read for a tough, macho Latina character, named 'Vasquez' And shot to fame in James Cameron's iconic film Aliens (1986). Cameron was so pleased with Jenette's creativity and strong work ethic, he recast her as 'Janelle' in Terminator 2: Judgment Day (1991) and a cameo role as the loving 'Irish Mother' in the epic Titanic (1997). Her resume is testament to her range and versatility: Vampy killer Diamondback in Near Dark (1987), good cop Meagan Shapiro in Lethal Weapon 2 (1989), Patti Jean Lynch in The Presidio (1988), Alice the Maid in a one-scene role in Fear and Loathing in Las Vegas (1998), et cetera. In addition to film, Jenette has made several appearances on the small screen. She guest-starred on such award-winning shows as Six Feet Under (2001), L.A. Law (1986), Strong Medicine (2000) and ER (1994) - where she guest-starred on the 100th anniversary show as a grieving mother, and in a separate episode opposite Anthony Edwards, as a heroic flight nurse. It was only after Jenette was hired for the second role that the show's producers realized she had done the show before. Jenette has continued working in theater throughout her career, appearing plays in New York, London and Los Angeles. She has performed the classics, Shakespeare's Twelfth Night, to more contemporary pieces, such as Arthur Miller's After The Fall, which won the 2002 Los Angeles Ovation Award for Best Production. Currently, Jenette is excited about her latest creation: a one-woman show she is writing herself.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0ODEyMDMwM15BMl5BanBnXkFtZTYwNDI3MTAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001280","name":"Jenette Goldstein","idIMDB":"nm0001280"},"actorId":"nm0001280","character":"Meagan Shapiro","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dean Norris","urlProfile":"http://www.imdb.com/name/nm0606487","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzOTQ2NDIzOF5BMl5BanBnXkFtZTcwMTE0OTYwOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1963","placeOfBirth":" South Bend, Indiana, USA","birthName":"Dean Joseph Norris","height":"5' 7\" (1.7 m)","bio":"Dean Norris was born on April 8, 1963 in South Bend, Indiana, USA as Dean Joseph Norris. He is an actor and producer, known for Breaking Bad (2008), Total Recall (1990) and Little Miss Sunshine (2006). He has been married to Bridget since April 2001. They have five children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzOTQ2NDIzOF5BMl5BanBnXkFtZTcwMTE0OTYwOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0606487","name":"Dean Norris","idIMDB":"nm0606487"},"actorId":"nm0606487","character":"Tim Cavanaugh","urlCharacter":"http://www.imdb.com/character/ch0075687","main":true},{"actorName":"Juney Smith","urlProfile":"http://www.imdb.com/name/nm0808863","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMjk2NjM0MDZeQTJeQWpwZ15BbWU4MDQ0MTIzMjYx._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Juney Smith is an actor and director, known for Friends and Romans (2014), Lethal Weapon 2 (1989) and Good Morning, Vietnam (1987).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMjk2NjM0MDZeQTJeQWpwZ15BbWU4MDQ0MTIzMjYx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0808863","name":"Juney Smith","idIMDB":"nm0808863"},"actorId":"nm0808863","character":"Tom Wyler","urlCharacter":"http://www.imdb.com/character/ch0075688","main":true},{"actorName":"Nestor Serrano","urlProfile":"http://www.imdb.com/name/nm0785594","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjUwMzYzM15BMl5BanBnXkFtZTcwMjEzOTM0Ng@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 November 1955","placeOfBirth":" Bronx, New York, USA","height":"6' (1.83 m)","bio":"Nestor Serrano, a native New Yorker, started his acting career almost thirty years ago at Queens college, where he was studying computer science. Joining the drama club was his attempt to meet new people - what he found was a lifelong passion for the performing arts. Although Nestor has traveled all over the world, he still calls New York his home. He lives in Manhattan with his wife Debbie, his son Spike and two dogs, Blackie the yellow Lab and Elvis.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4MjUwMzYzM15BMl5BanBnXkFtZTcwMjEzOTM0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0785594","name":"Nestor Serrano","idIMDB":"nm0785594"},"actorId":"nm0785594","character":"Eddie Estaban","urlCharacter":"http://www.imdb.com/character/ch0075689","main":true},{"actorName":"Philip Suriano","urlProfile":"http://www.imdb.com/name/nm0839642","urlPhoto":"","biography":{"dateOfBirth":"1948","placeOfBirth":"","bio":"Philip Suriano was born in 1948. He is an actor, known for Casino (1995), Goodfellas (1990) and Lethal Weapon 2 (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0839642","name":"Philip Suriano","idIMDB":"nm0839642"},"actorId":"nm0839642","character":"Joseph Ragucci","urlCharacter":"http://www.imdb.com/character/ch0075690","main":true}],"seasons":[],"idIMDB":"tt0097733","urlIMDB":"http://www.imdb.com/title/tt0097733","business":{"budget":{"money":"$28,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$20,388,800","country":"USA","day":"09","month":"07","year":"1989","remarks":"1,803 Screens"}],"gross":[{"money":"SEK","country":"40,739,627","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$1,118,457","country":"USA","day":"09","month":"10","year":"1989","remarks":"960 Screens"},{"money":"$1,227,039","country":"USA","day":"01","month":"10","year":"1989","remarks":"1,131 Screens"},{"money":"$1,608,068","country":"USA","day":"24","month":"09","year":"1989","remarks":"1,356 Screens"},{"money":"$2,206,481","country":"USA","day":"17","month":"09","year":"1989","remarks":"1,393 Screens"},{"money":"$2,597,052","country":"USA","day":"10","month":"09","year":"1989","remarks":"1,538 Screens"},{"money":"$4,659,654","country":"USA","day":"04","month":"09","year":"1989","remarks":"1,613 Screens"},{"money":"$3,335,582","country":"USA","day":"27","month":"08","year":"1989","remarks":"1,560 Screens"},{"money":"$4,516,257","country":"USA","day":"20","month":"08","year":"1989","remarks":"1,584 Screens"},{"money":"$6,071,683","country":"USA","day":"13","month":"08","year":"1989","remarks":"1,830 Screens"},{"money":"$8,040,033","country":"USA","day":"06","month":"08","year":"1989","remarks":"1,830 Screens"},{"money":"$10,401,958","country":"USA","day":"30","month":"07","year":"1989","remarks":"1,830 Screens"},{"money":"$13,022,249","country":"USA","day":"23","month":"07","year":"1989","remarks":"1,830 Screens"},{"money":"$17,188,126","country":"USA","day":"16","month":"07","year":"1989","remarks":"1,830 Screens"}],"admissions":[{"money":"2,882,446","country":"UK","day":"31","month":"12","year":"1989","remarks":""},{"money":"1,840,711","country":"France","day":"31","month":"12","year":"1989","remarks":""},{"money":"1,676,479","country":"Spain","day":"31","month":"12","year":"1989","remarks":""},{"money":"1,169,588 (West","country":"Germany","day":"31","month":"12","year":"1989","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"07","month":"12","year":"1988","remarks":null},{"money":null,"country":null,"day":"05","month":"03","year":"1989","remarks":null}],"copyrightHolder":"© 1989 Warner Bros. Inc."},"technical":{"runtime":["1 hr 54 min (114 min)","1 hr 48 min (108 min) (cut) (Germany)","1 hr 58 min (118 min) (director's cut) (USA)"],"soundMix":["70 mm 6-Track (70 mm prints)","Dolby Stereo (35 mm prints) (4 channels)"],"color":["Color (Technicolor)"],"aspectRatio":["2.20 : 1 (70 mm prints)","2.35 : 1"],"camera":null,"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["3,094 m (Sweden)","3,234 m"],"negativeFormat":["35 mm (Eastman 400T 5295)"],"cinematographicProcess":["Panavision"],"printedFilmFormat":["35 mm (Eastman 5384)","70 mm (blow-up) (Eastman 5384)"]},"rating":"7.2","metascore":"70","filmingLocations":[{"location":"Fox Plaza - 2121 Avenue of the Stars, Century City, Los Angeles, California, USA"}],"rated":"R","awards":[{"award":"Academy Awards, USA 1990","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Effects, Sound Effects Editing","names":[{"name":"Robert G. Henderson","id":"nm0376583","role":null},{"name":"Alan Robert Murray","id":"nm0614812","role":null}]}]}]},{"award":"BMI Film & TV Awards 1990","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"","names":[{"name":"Michael Kamen","id":"nm0004383","role":null},{"name":"Eric Clapton","id":"nm0002008","role":null},{"name":"David Sanborn","id":"nm0760824","role":null}]}]}]}],"votes":"133,775","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0019968","name":"Silver Pictures"}],"keywords":{"keywords":["south african","police","diplomatic immunity","chase","partner","revenge","police officer","gold","drug money","helicopter","sequel","nipples","detective","police station","explosion","warrior","police captain","anti hero","police brutality","revelation","underwater scene","trailer home","machismo","cop on the edge","neo noir","police procedural","blood splatter","dolphin meat","death by explosion","woman killed by explosion","woman in bathing suit","dead policewoman","murder of a policewoman","police officer bombed","black bathing suit","one piece swimsuit","dead woman carried","woman drowned","dead woman","death of girlfriend","cetacean meat","air attack","mp 40 machine gun","blonde","silencer","cigarette smoking","self justice","duel","hitman","pump action shotgun","police detective","police partner","shoulder holster","beretta","police chase","kidnapping","rescue","maverick cop","police vigilantism","vigilantism","widower","vigilante","brawl","fistfight","boxing","beer drinking","kissing while having sex","sex on first date","beating","blood","showdown","judo","hand to hand combat","disarming someone","gunfight","ambush","quick draw","six shooter","f word","exploding toilet","shipping container","home invasion","duct tape over mouth","falling from height","shot in the head","murder of a police officer","head butt","embassy","video","ski mask","police psychologist","money laundering","hot tub","fish tank","bomb squad","wisecrack humor","violence","stabbed in the chest","shootout","murder","martial arts","loss of girlfriend","crushed to death","buddy","assassination attempt","shot to death","assassination","yacht","tv commercial","trailer","television","television commercial","swimming pool","shotgun","sex","semiautomatic pistol","revolver","racial slur","pistol","pickup truck","ocean","no smoking sign","machine gun","los angeles california","kiss","hotel","home movie","hobby room","handcuffs","garage","french kiss","french kissing","female nudity","drowning","dog","diving board","dislocated shoulder","condom","condom commercial","car chase","bikini","beer","beach","attempted murder","attempted drowning","assassin","black cop","nail gun","accountant","south africa","protected witness","strait jacket","knife fight","ship","buddy cop","surprise ending","dead woman in bathing suit","1980s","dead woman with eyes open","opening action scene","gun fu","tough cop","tough guy","jujitsu","hero","two man army","male rear nudity","bare chested male","digit in title","numbered sequel","second part","sequel to cult favorite","cult film","eeny meeny miny moe","no opening credits","the three stooges","male nudity","action hero","blockbuster","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:25:18"}}