{"data":{"movies":[{"title":"Never a Dull Moment","originalTitle":"","year":"1968","releaseDate":"19680626","directors":[{"name":"Jerry Paris","id":"nm0661577"}],"writers":[{"name":"John Godey","id":"nm0323945"},{"name":"AJ Carothers","id":"nm0139218"}],"runtime":"99 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTUyNTY2NDU4Nl5BMl5BanBnXkFtZTcwNzYwMzYyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Family","Comedy","Crime"],"plot":"When practicing for a role, actor Jack is mistaken for the killer Ace. He doesn't realize this until it's too late and is carried off to gangster boss Leo Smooth, who wants Ace to do a job for him. Fearing for his life, Jack plays his role, but always searching for a way out of the well-guarded house.","simplePlot":"When practicing for a role, actor Jack is mistaken for the killer Ace. He doesn't realize this until it's too late and is carried off to gangster boss Leo Smooth, who wants Ace to do a job ... ","actors":[{"actorName":"Dick Van Dyke","urlProfile":"http://www.imdb.com/name/nm0001813","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMTAzMTk3OV5BMl5BanBnXkFtZTYwNzcwNzU2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1925","placeOfBirth":" West Plains, Missouri, USA","birthName":"Richard Wayne Van Dyke","height":"6' 1\" (1.85 m)","bio":"Dick Van Dyke was born Richard Wayne Van Dyke in West Plains, Missouri, to Hazel Victoria (McCord), a stenographer, and Loren Wayne Van Dyke, a salesman. His younger brother is entertainer Jerry Van Dyke. His ancestry includes English, Scottish, German, Swiss-German, and Dutch. Although he'd had small roles beforehand, Van Dyke was launched to stardom in the 1960 musical \"Bye-Bye Birdie\", for which he won a Tony Award, and, then, later in the movie based on that play, Bye Bye Birdie (1963). He has starred in a number of films throughout the years including Mary Poppins (1964), Chitty Chitty Bang Bang (1968) and Fitzwilly (1967), as well as a number of successful television series which won him no less than four Emmys and three made-for-CBS movies. After separating from his wife, Margie Willett, in the 1970s, Dick later became involved with Michelle Triola. Margie and Dick had four children born during the first ten years of their marriage: Barry Van Dyke; Carrie Beth van Dyke; Christian Van Dyke and Stacy Van Dyke, all of whom are now in their forties and married themselves. He has seven grandchildren, including Shane Van Dyke, Carey Van Dyke, Wes Van Dyke and Taryn Van Dyke (Barry's children) and family members often appear with him on Diagnosis Murder (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMTAzMTk3OV5BMl5BanBnXkFtZTYwNzcwNzU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001813","name":"Dick Van Dyke","idIMDB":"nm0001813"},"actorId":"nm0001813","character":"Jack Albany","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edward G. Robinson","urlProfile":"http://www.imdb.com/name/nm0000064","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzcwMzU5Nl5BMl5BanBnXkFtZTYwNTkwMjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1893","placeOfBirth":" Bucharest, Romania","birthName":"Emmanuel Goldenberg","height":"5' 7\" (1.7 m)","bio":"Edward G. Robinson arrived in the United States at age ten, and his family moved into New York's Lower East Side. He took up acting while attending City College, abandoning plans to become a rabbi or lawyer. The American Academy of Dramatic Arts awarded him a scholarship, and he began work in stock, with his new name, in 1913. Broadway was two years later; he worked steadily there for 15 years. His work included \"The Kibitzer\", a comedy he co-wrote with Jo Swerling. His film debut was a small supporting part in the silent The Bright Shawl (1923), but it was with the coming of sound that he hit his stride. His stellar performance as snarling, murderous thug Rico Bandello in Little Caesar (1931)--all the more impressive since in real life Robinson was a sophisticated, cultured man with a passion for fine art--set the standard for movie gangsters, both for himself in many later films and for the industry. He portrayed the title character in several biographical works, such as Dr. Ehrlich's Magic Bullet (1940) and A Dispatch from Reuter's (1940). Psychological dramas included Flesh and Fantasy (1943), Double Indemnity (1944), The Woman in the Window (1944)and Scarlet Street (1945). Another notable gangster role was in Key Largo (1948). He was \"absolved\" of allegations of Communist affiliation after testifying as a friendly witness for the House Un-American Activities Committee during the McCarthy hysteria of the early 1950s. In 1956 he had to sell off his extensive art collection in a divorce settlement and also had to deal with a psychologically troubled son. In 1956 he returned to Broadway in \"Middle of the Night\". In 1973 he was awarded a special, posthumous Oscar for lifetime achievement.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NzcwMzU5Nl5BMl5BanBnXkFtZTYwNTkwMjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000064","name":"Edward G. Robinson","nicknames":["Eddie","Manny"],"idIMDB":"nm0000064"},"actorId":"nm0000064","character":"Leo Joseph Smooth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dorothy Provine","urlProfile":"http://www.imdb.com/name/nm0699063","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgwNjM3NDIzNV5BMl5BanBnXkFtZTcwOTQ5MTM0Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1935","placeOfBirth":" Deadwood, South Dakota, USA","birthName":"Michele Dorothy Provine","height":"5' 4\" (1.63 m)","bio":"Flashy, leggy, bouffant blonde Dorothy Provine was a solid screen representation of the Kennedyesque era when life seemed so full of fun, so innocent and so optimistic. This sparkling beauty also gave TV audiences a double dose blast to the past via her popular co-starring roles on late 50s/early 60s series TV. A talented girl whose comedic gifts were never sufficiently tapped into by Hollywood, Dorothy nevertheless secured a dedicated fan base merely on her sunny smile, creamy good looks and carefree radiance alone. Graduating from the University of Washington with a degree in Theater Arts. Hollywood folklore has it that the South Dakota-born (but raised in San Francisco) actress landed the role of the notorious femme bank robber in the low-budget \"B\" film The Bonnie Parker Story (1958) just three days after arriving in Hollywood. It certainly proved to be a lucky break, although it didn't clinch the movie stardom she might have expected. On the contrary, Dorothy was forced to languish in such predicable programmers as Riot in Juvenile Prison (1959) and Live Fast, Die Young (1958), while playing the gigantic, radiation-exposed love interest in the poorly-executed The 30 Foot Bride of Candy Rock (1959) opposite rolypoly comedian Lou Costello in his only film effort after breaking up with partner Bud Abbott. Fortunately, TV made up for her lack of success on film. Signed up by Warner Bros. and seemingly better suited for the small screen, Dorothy became one of the more visible female faces on TV and would be best remembered for her period roles as 1890s saloon singer Rocky Shaw, the friend of \"Gold Rush\" fortune seekers Roger Moore and Jeff York in The Alaskans (1959) and, better yet, as Pinky Pinkham, the Charleston-dancing flapper in the Warner Bros. adventure series The Roaring 20's (1960). A vivacious guest on scores of other TV shows, Dorothy occasionally reappeared in lightweight 1960s films wherein she generally projected a squeaky-clean image playing various sparkly housewives, girlfriends and sisters. She was part of the all-star zaniness in It's a Mad Mad Mad Mad World (1963) as Milton Berle's wife; appeared as Jack Lemmon's bright-eyed better half in the suburban comedy Good Neighbor Sam (1964); played Hayley Mills's beleaguered older sis in the feline caper That Darn Cat! (1965); had a slam-bang cameo as Lily Olay the barroom singer who belts out the memorable \"He Shouldn't-A, Hadn't-A, Oughtn't-A Swang on Me\" in the slapstick farce The Great Race (1965); showed up as the true-blue gal pining for Jim Hutton in the bank heist comedy Who's Minding the Mint? (1967); and made her last silver screen appearance alongside Dick Van Dyke in the comedy Never a Dull Moment (1968), which did not live up to its title. During this time Dorothy occasionally made use of her vocal talents on the live stage, and appeared briefly as a duo with George Burns in a 1963 Las Vegas nightclub act, replacing Burns' ailing wife Gracie Allen, who by this time had fully retired due to serious heart problems. Eventually, however, she lost interest in her career. Dorothy abruptly left the business in 1969 after marrying director Robert Day, who was involved in several of the Tarzan movies. She showed up a couple of times on TV in the 70s but, for the most part, found her self-imposed retirement completely to her liking. The couple moved permanently to Bainbridge Island, Washington in 1981, and there she found contentment simply gardening and tending to her animals. They had one son, Robert Day Jr., who became a musician. Dorothy battled emphysema in her last years and died at a nearby hospice on April 25, 2010, at age 75.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzgwNjM3NDIzNV5BMl5BanBnXkFtZTcwOTQ5MTM0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0699063","name":"Dorothy Provine","idIMDB":"nm0699063"},"actorId":"nm0699063","character":"Sally Inwood","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Henry Silva","urlProfile":"http://www.imdb.com/name/nm0798328","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg2OTgwOTA3MV5BMl5BanBnXkFtZTYwMzk1OTA2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1928","placeOfBirth":" Brooklyn, New York, USA","height":"6' 2\" (1.88 m)","bio":"Henry Silva was born on September 15, 1928 in Brooklyn, New York City. He quit public school to attend drama classes at age 13, supporting himself as a dishwasher in a Manhattan hotel. By 1955, Silva had moved up from dishwasher to waiter, and felt ready to audition for the Actors Studio. He was one of five students chosen out of more than 2500 applicants. When the Actors Studio staged Michael V. Gazzo's play \"A Hatful of Rain\" as a classroom project, it proved so successful it came to Broadway--with students Ben Gazzara, Shelley Winters, Harry Guardino, Anthony Franciosa and, of course, Silva in key roles. Called to Hollywood, he played a succession of heavies in films, including The Bravados (1958), Green Mansions (1959), Ocean's 11 (1960), The Manchurian Candidate (1962) and Johnny Cool (1963). An Italian producer made Henry an offer he could not refuse--to star as a hero for a change--and he moved his family overseas. Silva's turning-point picture was a spaghetti Western, The Hills Run Red (1966), which made him a hot box office commodity in Spain, Italy, Germany and France. His popularity was enhanced by a gift for languages. He speaks Italian and Spanish fluently and has a flair for the kind of gritty, realistic roles that also catapulted Charles Bronson to European stardom. Returning to the United States, he co-starred with Frank Sinatra in the film Contract on Cherry Street (1977), then signed on as Buck Rogers' evil adversary Kane in Buck Rogers in the 25th Century (1979) and the television series of the same name. Silva now calls the San Fernando Valley home, but makes continual film forays back to Europe's production centers. A dedicated jogger, he puts in five miles a day \"to keep in shape and relieve tension\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg2OTgwOTA3MV5BMl5BanBnXkFtZTYwMzk1OTA2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0798328","name":"Henry Silva","idIMDB":"nm0798328"},"actorId":"nm0798328","character":"Frank Boley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joanna Moore","urlProfile":"http://www.imdb.com/name/nm0601369","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0Mzk2MTg3NF5BMl5BanBnXkFtZTcwNjY0NDMxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1934","placeOfBirth":" Parrott, Georgia, USA","birthName":"Dorothy Cook","bio":"Southern-bred beauty Joanna Moore certainly had a lot of things going for her when her career started off in the 50s. Armed with an entrancingly smoky voice that complemented her stunning, creamy blond beauty, Joanna played wily females in such films as Walk on the Wild Side (1962) and Son of Flubber (1963), but she would be best remembered, however, as the benevolent girlfriend of \"Sheriff Andy Taylor\" in the third season of The Andy Griffith Show (1960). At the peak of her career, Joanna married her \"Prince Charming\", actor Ryan O'Neal, on April 3, 1963. O'Neal, of course, would make a huge impact as \"Rodney Harrington\" the following year on the nighttime soap, Peyton Place (1964). The good-looking couple had two children who also became actors: Tatum O'Neal (later Oscar-winner) and Griffin O'Neal. The marriage, however, was tempestuous, to say the least, and they divorced acrimoniously in February, 1967. Things started to slide after that for Joanna: She lost custody of her children in 1970 due to severe drug and alcohol addiction, with both her children battling similar problems as adults. There was talk that Joanna was living in self-styled communes and had completely isolated herself from any Hollywood contact. She was not heard of for decades until discovered in the Palm Springs area involving herself in small theater projects. Joanna died in 1997 of lung cancer with her daughter, Tatum, at her side.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0Mzk2MTg3NF5BMl5BanBnXkFtZTcwNjY0NDMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0601369","name":"Joanna Moore","idIMDB":"nm0601369"},"actorId":"nm0601369","character":"Melanie Smooth","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Bill","urlProfile":"http://www.imdb.com/name/nm0082300","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMDg2Mjg0OF5BMl5BanBnXkFtZTcwNzMzNDk5Nw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 August 1940","placeOfBirth":" San Diego, California, USA","birthName":"Gerard Anthony Bill","bio":"He graduated in 1962 from the University of Notre Dame with majors in English and Art. Tony began his career in the film industry as an actor. His acting years were distinguished by the quality of the directors who chose him for their films, including Steven Spielberg and Francis Ford Coppola. Tony wanted to become a filmmaker, however, and made the transition to producer in 1971. In 1973, his feature The Sting (1973) became one of the highest grossing films in history and brought him an Academy Award for Best Picture. Tony made his directorial debut in 1980 with My Bodyguard (1980). He has since directed a number of other pictures, as well as numerous commercials and episodes of television series. Tony has shared his unique experience by teaching and lecturing at various universities. He has served on the Motion Picture Association of America's Board of Governors and Board of Trustees and on the board of the Public Justice Foundation, while also remaining active in many community services. He is married to 'Helen Bartlett', his producer/partner in Barnstorm Films, and has two daughters, Madeline and Daphne.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzMDg2Mjg0OF5BMl5BanBnXkFtZTcwNzMzNDk5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0082300","name":"Tony Bill","idIMDB":"nm0082300"},"actorId":"nm0082300","character":"Florian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Slim Pickens","urlProfile":"http://www.imdb.com/name/nm0001620","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM5MDQyNjI3Nl5BMl5BanBnXkFtZTcwMTA1MjE1Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1919","placeOfBirth":" Kingsburg, California, USA","birthName":"Louis Burton Lindley Jr.","height":"6' 2\" (1.88 m)","bio":"Slim Pickens spent the early part of his career as a real cowboy and the latter part playing cowboys, and he is best remembered for a single \"cowboy\" image: that of bomber pilot Maj. \"King\" Kong waving his cowboy hat rodeo-style as he rides a nuclear bomb onto its target in the great black comedy Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb (1964). Born in Kingsburg, near Fresno in California's Central Valley, he spent much of his boyhood in nearby Hanford, where he began rodeoing at the age of 12. Over the next two decades he toured the country on the rodeo circuit, becoming a highly-paid and well-respected rodeo clown, a job that entailed enormous danger. In 1950, at the age of 31, Slim married Margaret Elizabeth Harmon and that same year he was given a role in a western, Rocky Mountain (1950). He quickly found a niche in both comic and villainous roles in that genre. With his hoarse voice and pronounced western twang, he was not always easy to cast outside the genre, but when he was, as in \"Dr. Strangelove\", the results were often memorable. He died in 1983 after a long and courageous battle against a brain tumor. He was survived by his wife Margaret and children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzM5MDQyNjI3Nl5BMl5BanBnXkFtZTcwMTA1MjE1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001620","name":"Slim Pickens","idIMDB":"nm0001620"},"actorId":"nm0001620","character":"Cowboy Schaeffer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Elam","urlProfile":"http://www.imdb.com/name/nm0001181","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4NjE0NTIzMDBeQTJeQWpwZ15BbWU2MDYzNzczNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1920","placeOfBirth":" Miami, Arizona, USA","birthName":"William Scott Elam","height":"6' (1.83 m)","bio":"Colorful American character actor equally adept at vicious killers or grizzled sidekicks. As a child he worked in the cotton fields. He attended Santa Monica Junior College in California and subsequently became an accountant and, at one time, manager of the Bel Air Hotel. Elam got his first movie job by trading his accounting services for a role. In short time he became one of the most memorable supporting players in Hollywood, thanks not only to his near-demented screen persona but also to an out-of-kilter left eye, sightless from a childhood fight. He appeared with great aplomb in Westerns and gangster films alike, and in later years played to wonderful effect in comedic roles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA4NjE0NTIzMDBeQTJeQWpwZ15BbWU2MDYzNzczNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001181","name":"Jack Elam","idIMDB":"nm0001181"},"actorId":"nm0001181","character":"Ace Williams","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ned Glass","urlProfile":"http://www.imdb.com/name/nm0321982","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNzkzMzg3OF5BMl5BanBnXkFtZTcwNTIyMjYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 April 1906","placeOfBirth":" Radom, Mazowieckie, Poland","birthName":"Nusyn Glass","bio":"Veteran Polish-born character actor Ned Glass grew up in New York, and, after vaudeville experience, started acting in small parts on Broadway from the early 1930's. He gained further experience in the capacity of theatrical production supervisor, before entering motion pictures in 1937 as an MGM contract player. Until the mid-1950's, he was seen primarily in tiny supporting roles as clerks, reporters, bank tellers and small-time managers. His career was briefly put on hold after being blacklisted during the McCarthy era, but, with help from friends like John Houseman and Moe Howard (of The Three Stooges fame) he managed to get enough film work to make ends meet. By 1953, Ned began to find a new lease of life in television, where his roles were more varied and substantial. This afforded him the opportunity to fully develop his screen persona: that of the balding, weedy, perpetually nervy conman or weasely stooge, often delivering barbed repartee or wisecracks in a heavy Brooklyn accent. Ned was at his best in comedy, put to good use in several episodes of Jackie Gleason's The Honeymooners (1955), and adapting well to anything else with a New York theme, from Kojak (1973) to Barney Miller (1974). He had many other good guest-starring roles on television, including several shifty characters in The Untouchables (1959), and as Freddie the Forger in Get Smart (1965) ('Do I Hear a Vaults?',1970). He was twice nominated for Emmy Awards, first, for an episode of Julia (1968) (as Sol Cooper); the second time in for Bridget Loves Bernie (1972) (Uncle Moe Plotnick). From the time he played Doc in West Side Story (1961), Ned also began to land some meatier roles on the big screen, including the character of Popcorn in Experiment in Terror (1962), and as Doc Schindler, in one of the funniest 60's comedies, The Fortune Cookie (1966), directed by Billy Wilder. His best portrayal was that of the wily Leonard Gideon, sharpest of the villainous trio (the others being James Coburn and George Kennedy) on the trail of a quarter of a million dollar loot in gold, in the Hitchcockian thriller Charade (1963). Ned continued playing crusty reprobates in films and on television, his last being a small-time thief in an episode of Cagney & Lacey (1981). He died two years later in Encino, California, at the age of 78.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNzkzMzg3OF5BMl5BanBnXkFtZTcwNTIyMjYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0321982","name":"Ned Glass","idIMDB":"nm0321982"},"actorId":"nm0321982","character":"Rinzy Tobreski","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Bakalyan","urlProfile":"http://www.imdb.com/name/nm0048147","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTg3MTExM15BMl5BanBnXkFtZTgwMzAzOTEzMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1931","placeOfBirth":" Watertown, Massachusetts, USA","height":"5' 7\" (1.7 m)","bio":"Richard Bakalyan was born on January 29, 1931 in Watertown, Massachusetts, USA. He was an actor and writer, known for Chinatown (1974), The Fox and the Hound (1981) and Von Ryan's Express (1965). He was married to Betty Lee Bauman. He died on February 27, 2015 in Elmira, New York, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NTg3MTExM15BMl5BanBnXkFtZTgwMzAzOTEzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0048147","name":"Richard Bakalyan","nicknames":["Dick","Dicky B"],"idIMDB":"nm0048147"},"actorId":"nm0048147","character":"Bobby Macoon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mickey Shaughnessy","urlProfile":"http://www.imdb.com/name/nm0789485","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmI4ZDNjMmQtZTZmYi00NDZmLThjOWQtMjI0NzUzMTM1NzE3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1920","placeOfBirth":" New York City, New York, USA","birthName":"Joseph Michael Shaughnessy","height":"5' 10½\" (1.79 m)","bio":"Mickey Shaugnessy, the Irish-American character actor best known for his portrayal of Elvis Presley's musical mentor in the rock n' roll classic \"Jailhouse Rock\" (1957), was born Joseph Michael Shaughnessy on August 5, 1920 in New York City. As a performer, the young Mickey made his bones on the Catskill Mountains tourist resort circuit. During a stint in the Army during World War II, Mickey appeared in a service revue. After being demobilized, he made his living making the rounds of the nightclub circuit with a comedy act. His breakthrough as an actor came with his debut in support of the legendary Judy Holliday and great meat n' potatoes character actor Aldo Ray in George Cukor's The Marrying Kind (1952). Shaughnessy signed a contract with Metro-Goldwyn-Mayer, which typecast him as dumb but likable lugs in such pictures as Vincente Minnelli's Designing Woman (1957). He was memorable as \"the Duke\" in 'Michael Curtiz''s The Adventures of Huckleberry Finn (1960) for MGM and even acted Jerry Lewis off of the silver screen as Jerry's wrassler-pal in Don't Give Up the Ship (1959). Other major pictures he appeared in were Fred Zinnemann's Academy Award-winning From Here to Eternity (1953), Robert Wise's Until They Sail (1957) in support of up-and-coming Paul Newman, Frank Capra's disappointing final film Pocketful of Miracles (1961), and Henry Hathaway's comedic potboiler North to Alaska (1960) with John Wayne. In 1960 alone, the Mick appeared in two exploitation classics for Albert Zugsmith, \"College Confidential\" with professional marrieds Steve Allen and Jayne Meadows, and Sex Kittens Go to College (1960) with a young Tuesday Weld. In \"The Clown,\" Mickey had the honor of playing a mute clown who avenges the honor of another young lovely, Yvette Mimieux, in an episode during the second season of the classic TV chiller series, \"One Step Beyond.\" In the early '60s, Mickey revived his nightclub act, which was always a \"clean\" act, even into the 1980s, despite his success as the foul-mouthed sailor whose obscenities were beeped-out on the soundtrack of \"Don't Go Near the Water (1955). In 1965, Mickey had the dubious honor of appearing as Jack Mulligan in \"Kelly,\" an original Broadway musical about a Tammany Hall-like Irish gang set in the 1880s that starred Wilfrid Brambell as the eponymous Dan Kelly and Maytag repairman extraordinaire Jesse White as \"Stickpin\" Sidney Crane. Produced by David Susskind and Daniel Melnick in association with Joseph E. Levine, directed and choreographed by future Academy Award nominee Herbert Ross, and boasting music by Moose Charlap and a book and lyrics by Eddie Lawrence, \"Kelly\" opened and closed on February 6th, 1965, after all of one one performance. Mickey never performed on the Great White Way again. In all, Mickey starred in almost two score movies and a score of TV shows before winding up the bulk of his career in the early '70s with a role in the short-lived TV series \"The Chicago Teddybears\" (1971) in support of Dean Jones and John Banner. Despite many memorable performances, he will best be remembered as the imprisoned con Hunk Houghton in \"Jailhouse Rock.\" Mickey's con befriends Elvis, in his best-starring vehicle, as a young man thrown into the pokey for killing another man to defend a woman's honor. It is Mickey's Hunk who has the insight and wisdom to realize that Elvis is a natural and should perform in the upcoming prison show. Wowing the incarcerated crowd like the Man in Black Johnny Cash would a decade later at Folsom, Elvis finds his true calling and becomes a pop star after vamoosing the hoosegow. With true love Judy Tyler, the once and future King establishes a record company to flog his hot wax, but success spoils him, and soon Elvis decides to ditch his best gal and their company to sign with some slick Hollywood recording industry types. Former best pal-from-the-slammer Mickey shows up and bangs some sense into Elvis' vaselined head, but unfortunately, the blow to The King's noggin damages his vocal chords. No longer able to sing, Elvis is given up on by the slick Hollywood boys and all those who had been exploiting him. Hollywood in that era, and particularly MGM, were nothing if not dutifully didactic, and a humbled Elvis learns the true meaning of love, friendship and fidelity when Miss Tyler and the Hunk stick out the bad times with him. In true Hollywood fashion, The King's voice is miraculously restored and he once again storms the charts. A landmark in the rock n' roll film with almost as much impact as \"A Hard Day's Night\" (1964) had on a later generation, Jailhouse Rock (1957) was added to the Library of Congress' Film Registry in 2004. Sadly, Mickey Shaughnessy would not live to see that honor, nor the release of his final film. He died from lung cancer just two weeks shy of his 65th birthday on July 23, 1985.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmI4ZDNjMmQtZTZmYi00NDZmLThjOWQtMjI0NzUzMTM1NzE3XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0789485","name":"Mickey Shaughnessy","idIMDB":"nm0789485"},"actorId":"nm0789485","character":"Francis","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Philip Coolidge","urlProfile":"http://www.imdb.com/name/nm0177642","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA2MTg4NDIwN15BMl5BanBnXkFtZTgwNDM1MjU2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1908","placeOfBirth":" Concord, Massachusetts, USA","bio":"Philip Coolidge was born on August 25, 1908 in Concord, Massachusetts, USA. He was an actor, known for North by Northwest (1959), Inherit the Wind (1960) and I Want to Live! (1958). He died on May 23, 1967 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA2MTg4NDIwN15BMl5BanBnXkFtZTgwNDM1MjU2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0177642","name":"Philip Coolidge","idIMDB":"nm0177642"},"actorId":"nm0177642","character":"Fingers Felton","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Millhollin","urlProfile":"http://www.imdb.com/name/nm0589622","urlPhoto":"","biography":{"dateOfBirth":"23 August 1915","placeOfBirth":" Peoria, Illinois, USA","bio":"Thin, fidgety James Millholin made a career out of playing dyspeptic bureaucrats, nervous hotel clerks and other officious authority types. Somewhat reminiscent of Edward Everett Horton or Franklin Pangborn, Millhollin's pinched face, somewhat pop eyes and flighty mannerisms fit those roles like a glove, one of the best examples being the army psychiatrist driven to distraction trying to give Andy Griffith a psychological examination in No Time for Sergeants (1958) (a role he also played on Broadway). Born in Peoria, IL, Millhollin had a career on the Broadway stage and did much television in the early 1950s before breaking into films. After retiring from the industry he moved to Mississippi, where he died in 1993.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0589622","name":"James Millhollin","idIMDB":"nm0589622"},"actorId":"nm0589622","character":"Museum Director","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0063341","urlIMDB":"http://www.imdb.com/title/tt0063341","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 39 min (99 min)"],"soundMix":["Mono (RCA Sound Recording)"],"color":["Color (Technicolor)"],"aspectRatio":["1.75 : 1"],"camera":null,"laboratory":["Technicolor"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"6.2","filmingLocations":[{"location":"Walt Disney Studios, 500 South Buena Vista Street, Burbank, California, USA"}],"awards":[],"votes":"378","type":"Movie","companyCreditsSimple":[{"idCompany":"co0098836","name":"Walt Disney Productions"}],"keywords":{"keywords":["actor","teacher","theft","thief","mistaken identity","role reversal","based on book"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 06:25:53"}}