{"data":{"movies":[{"title":"The Buccaneer","originalTitle":"","year":"1958","releaseDate":"19581201","directors":[{"name":"Anthony Quinn","id":"nm0000063"}],"writers":[{"name":"Harold Lamb","id":"nm0482959"},{"name":"Jesse Lasky Jr.","id":"nm0489679"}],"runtime":"119 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA5NTdhMmYtNTZjOS00MmQ3LTg5NjYtYjE2YzhjMzE5ODdmL2ltYWdlXkEyXkFqcGdeQXVyNjQzNDI3NzY@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Adventure","Drama","History","Romance","War"],"plot":"During the War of 1812 against the United Kingdom of Great Britain and Ireland: General Andrew Jackson has only 1,200 men left to defend New Orleans when he learns that a British fleet will arrive with 60 ships and 16,000 men to take the city. In this situation an island near the city becomes strategically important to both parties, but it's inhabited by the last big buccaneer: Jean Lafitte. Although Lafitte never attacks American ships, the governor hates him for selling merchandise without taxes - and is loved by the citizens for the same reason. When the big fight gets nearer, Lafitte is drawn between the fronts. His heart belongs to America, but his people urge him to join the party that's more likely to win.","simplePlot":"During the War of 1812 against the United Kingdom of Great Britain and Ireland: General Andrew Jackson has only 1,200 men left to defend New Orleans when he learns that a British fleet will... ","actors":[{"actorName":"Yul Brynner","urlProfile":"http://www.imdb.com/name/nm0000989","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ2ODQ2MjQ5NV5BMl5BanBnXkFtZTYwODk4MjM2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1920","placeOfBirth":" Vladivostok, Primorskaya Oblast, Far Eastern Republic [now Primorsky Krai, Russia]","birthName":"Yuli Borisovich Bryner","height":"5' 8\" (1.73 m)","bio":"Exotic leading man of American films, famed as much for his completely bald head as for his performances, Yul Brynner masked much of his life in mystery and outright lies designed to tease people he considered gullible. It was not until the publication of the books \"Yul: The Man Who Would Be King\" and \"Empire and Odyssey\" by his son, Yul \"Rock\" Brynner, that many of the details of Brynner's early life became clear. Yul sometimes claimed to be a half-Swiss, half-Japanese named Taidje Khan, born on the island of Sakhalin; in reality, he was the son of Marousia Dimitrievna (Blagovidova), the Russian daughter of a doctor, and Boris Yuliyevich Bryner, an engineer and inventor of Swiss-German and Russian descent. He was born in their home town of Vladivostok on 11 July 1920 and named Yuli after his grandfather, Jules Bryner. When Yuli's father abandoned the family, his mother took him and his sister Vera to Harbin, Manchuria, where they attended a YMCA school. In 1934 Yuli's mother took her children to Paris. Her son was sent to the exclusive Lycée Moncelle, but his attendance was spotty. He dropped out and became a musician, playing guitar in the nightclubs among the Russian gypsies who gave him his first real sense of family. He met luminaries such as Jean Cocteau and became an apprentice at the Theatre des Mathurins. He worked as a trapeze artist with the famed Cirque d'Hiver company. He traveled to the U.S. in 1941 to study with acting teacher Michael Chekhov and toured the country with Chekhov's theatrical troupe. That same year, he debuted in New York as Fabian in \"Twelfth Night\" (billed as Youl Bryner). After working in a very early TV series, Mr. Jones and His Neighbors (1944), he played on Broadway in \"Lute Song\" with Mary Martin, winning awards and mild acclaim. He and his wife, actress Virginia Gilmore, starred in the first TV talk show, Mr. and Mrs. (1948). Brynner then joined CBS as a television director. He made his film debut in Port of New York (1949). Two years later Mary Martin recommended him for the part he would forever be known for: the King in Richard Rodgers' and Oscar Hammerstein II's musical \"The King and I\". Brynner became an immediate sensation in the role, repeating it for film (The King and I (1956)) and winning the Oscar for Best Actor. For the next two decades, he maintained a starring film career despite the exotic nature of his persona, performing in a wide range of roles from Egyptian pharaohs to Western gunfighters, almost all with the same shaved head and indefinable accent. In the 1970s he returned to the role that had made him a star, and spent most of the rest of his life touring the world in \"The King and I\". When he developed lung cancer in the mid 1980s, he left a powerful public service announcement denouncing smoking as the cause, for broadcast after his death. The cancer and its complications, after a long illness, ended his life. Brynner was cremated and his ashes buried in a remote part of France, on the grounds of the Abbey of Saint-Michel de Bois Aubry, a short distance outside the village of Luzé. He remains one of the most fascinating, unusual and beloved stars of his time.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQ2ODQ2MjQ5NV5BMl5BanBnXkFtZTYwODk4MjM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000989","name":"Yul Brynner","idIMDB":"nm0000989"},"actorId":"nm0000989","character":"Jean Lafitte","urlCharacter":"http://www.imdb.com/character/ch0151310","main":true},{"actorName":"Claire Bloom","urlProfile":"http://www.imdb.com/name/nm0001954","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MjU1MzMxM15BMl5BanBnXkFtZTcwMzAyOTMzNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 February 1931","placeOfBirth":" Finchley, London, England, UK","birthName":"Patricia Claire Blume","height":"5' 3\" (1.6 m)","bio":"Age has not taken the flower off this Bloom. The well-known and respected stage, screen and television actress Claire Bloom, originally named Patricia Claire Blume, continues to be in demand as a septuagenarian actress and looks as beautiful as ever. She was born Patricia Claire Bloom on February 15, 1931 in Finchley, North London, to Elizabeth (Grew) and Edward Max Blume, who worked in sales. Her parents were both from Jewish families (from Belarus). Educated at Badminton School in Bristol and Fern Hill Manor in New Milton, Claire expressed early interest in the arts and was stage trained as an adolescent at the Guildhall School, under the guidance of Eileen Thorndike, and then the Central School of Speech and Drama. Marking her professional debut on the BBC radio, she subsequently took her first curtain call with the Oxford Repertory Theatre in 1946 in the production of \"It Depends What You Mean\". She then received early critical accolades for her Shakespearean ingénues in \"King John\", \"The Winter's Tale\" and, notably, her Ophelia in \"Hamlet\" at age 17 at Stratford-on-Avon opposite alternating Hamlets Paul Scofield and Robert Helpmann. By 1949 Claire was making her West End debut with \"The Lady's Not For Burning\" with the up-and-coming stage actor Richard Burton. A most becoming and beguiling dark-haired actress whose photogenic, slightly pinched beauty was accented by an effortless elegance and poise, Claire's inauspicious film debut came with a prime role in the British courtroom film drama The Blind Goddess (1948). It was her second film, when Charles Chaplin himself selected her specifically to be his young leading lady in the classic sentimental drama Limelight (1952), that propelled her to stardom. Her bravura turn as a young suicide-bent ballerina saved from despair by an aging music hall clown (Chaplin) was exquisitely touching and sparked an enviable but surprisingly sporadic career in films. Despite the sudden film attention, Claire continued her formidable presence on the Shakespearean stage. Joining the Old Vic Company for the 1952-1953 and 1953-1954 seasons, she appeared as Helena, Viola, Juliet, Jessica, Miranda, Virgilia, Cordelia and (again) Ophelia in a highly successful tenure. Touring Canada and the United States as Juliet, she made her Broadway bow in the star-crossed lover role in 1956, also playing the Queen in \"Richard II\". A strong presence on both the London and New York stages over the years, other powerful performances came with \"The Trojan Women\", \"Vivat! Vivat! Regina!\", \"Hedda Gabler\", \"A Doll's House\" and \"A Streetcar Named Desire\". Much later in life she performed in a superb one-woman show entitled \"These Are Women: A Portrait of Shakespeare's Heroines\" that included monologues from several of her acclaimed stage performances. Claire's stylish and regal presence was simply ideal for mature period films and she appeared opposite a roster of Hollywood most talented leading men as such, including Laurence Olivier in the title role of Richard III (1955); Richard Burton and Fredric March in Alexander the Great (1956); Yul Brynner in The Brothers Karamazov (1958) and Brynner and Charlton Heston in the DeMille epic The Buccaneer (1958) in which she had a rare dressed-down role as a spirited pirate girl. On the more contemporary scene she appeared with Burton in two classic film dramas: the stark \"kitchen sink\" British stage piece Look Back in Anger (1959) and the Cold War espionage thriller The Spy Who Came in from the Cold (1965). In addition she courted tinges of controversy playing a housewife gone bonkers in the offbeat sudser The Chapman Report (1962) and a lesbian in the supernatural chiller The Haunting (1963). Claire met first husband Rod Steiger while performing with him on stage in 1959's \"Rashomon\". They married that year and had daughter Anna in 1960 who grew up to become a well-regarded opera singer. Claire and Rod appeared in two lesser films together, The Illustrated Man (1969) and Three Into Two Won't Go (1969), both released the same year they divorced after 10 tumultuous years. As with other maturing actress during the 1970s, Claire looked toward classy film roles in TV-movies for sustenance and found among them Backstairs at the White House (1979), as First Lady Edith Wilson, and Brideshead Revisited (1981), in which she was nominated for an Emmy. Also lauded were the epic miniseries Ellis Island (1984); a remake of Terence Rattigan's Separate Tables (1983), and Philip Roth's acclaimed adaptations of American Playhouse: The Ghost Writer (1984) and Shadowlands (1985), the latter earning her a British Television Award. Speaking of Roth, Claire married the writer (her third) in 1990 after a brief second marriage to producer Hillard Elkins (1969-1972). The union with Roth lasted five years. Claire appeared in several Shakespearean teleplays over the decades while also portraying a choice selection of historical royals including Czarina Alexandra and Katherine of Aragon. One of her most recent appearances on TV was the miniseries version of The Ten Commandments (2006). On daytime drama, she delightfully played matriarch and murderess Orlena Grimaldi on the daytime drama As the World Turns (1956) in 1993. She left the role in 1995 and was replaced. Claire wrote two memoirs. The first was the more career-oriented \"Limelight and After: The Education of an Actress\", released in 1982 Her more controversial second book focused on her personal life: \"Leaving a Doll's House: A Memoir\", published in 1996.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MjU1MzMxM15BMl5BanBnXkFtZTcwMzAyOTMzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001954","name":"Claire Bloom","idIMDB":"nm0001954"},"actorId":"nm0001954","character":"Bonnie Brown","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Boyer","urlProfile":"http://www.imdb.com/name/nm0000964","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU0MzQ3ODU1Ml5BMl5BanBnXkFtZTcwNjc5NTYwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1899","placeOfBirth":" Figeac, Lot, France","height":"5' 9\" (1.75 m)","bio":"Charles Boyer studied philosophy before he went to the theater where he gave his debut in 1920. Although he had at first no intentions to pursue a career at the movies (his first movie was L'homme du large (1920) by Marcel L'Herbier) he used his chance in Hollywood after several filming stations all over Europe. In the beginning of his career his beautiful voice was hidden by the silent movies but in Hollywood he became famous for his whispered declarations of love (like in movies with Greta Garbo, Marlene Dietrich or Ingrid Bergman). In 1934 he married Pat Paterson, his first and (unusual for a star) only wife. He was so faithful to her that he decided to commit suicide two days after her death in 1978.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjU0MzQ3ODU1Ml5BMl5BanBnXkFtZTcwNjc5NTYwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000964","name":"Charles Boyer","nicknames":["The Latin Lover"],"idIMDB":"nm0000964"},"actorId":"nm0000964","character":"Dominique You","urlCharacter":"http://www.imdb.com/character/ch0151311","main":true},{"actorName":"Inger Stevens","urlProfile":"http://www.imdb.com/name/nm0828447","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MTk0NDg1M15BMl5BanBnXkFtZTcwNzQ1MTgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1934","placeOfBirth":" Stockholm, Sweden","birthName":"Inger Stensland","height":"5' 5½\" (1.66 m)","bio":"This enigmatic Stockholm-born beauty had everything going for her, including a rapidly rising film and TV career. Yet on April 30, 1970, at only 35, Inger Stevens would become another tragic Hollywood statistic -- added proof that fame and fortune do not always lead to happiness. Over time, a curious fascination, and perhaps even a morbid interest, has developed over Ms. Stevens and her life. What exactly went wrong? A remote, paradoxical young lady with obvious personal problems, she disguised it all with a seemingly positive attitude, an incredibly healthy figure and a megawatt smile that wouldn't quit. Although very little information has been filtered out about Ms. Stevens and her secretive life over the years, William T. Patterson's eagerly-anticipated biography, \"The Farmer's Daughter Remembered: The Biography of Actress Inger Stevens\" (2000), finally put an end to much of the mystery. But not quite all. The book claims that a large amount of previously-published information about Ms. Stevens is either untrue or distorted. A strong talent and consummate dramatic player of the late 50s and 60s, she was born Inger Stensland, the eldest of three children, of Swedish parentage. A painfully shy and sensitive child, she was initially drawn to acting as a girl after witnessing her father perform in amateur theater productions. Her rather bleak childhood could be directed at a mother who abandoned her family for another man when Inger was only 6. Her father moved to the States, remarried, and eventually summoned for Inger and a younger brother in 1944 to join him and his new bride. Family relations did not improve. As a teenager, she ran away from home and ended up in a burlesque chorus line only to be brought home by her father. After graduation and following some menial jobs here and there, she moved to New York and worked briefly as a model while studying at the Actors Studio. She broke into the business through TV commercials and summer stock, rising in the ingénue ranks as a guest in a number of weekly series. Often viewed as the beautiful loner or lady of mystery, an innate sadness seemed to permeate many of her roles. Inger made her film debut at age 22 opposite Bing Crosby in Man on Fire (1957). Serious problems set in when Inger began falling in love with her co-stars. Broken affairs with Crosby, James Mason, her co-star in Cry Terror! (1958), Anthony Quinn, her director in Cecil B. DeMille's The Buccaneer (1958), and Harry Belafonte, her co-star in The World, the Flesh and the Devil (1959), left her frequently depressed and ultimately despondent. An almost-fatal New Year's day suicide attempt in 1959 led to an intense period of self-examination and a new resolve. A brief Broadway lead in \"Roman Candle\", an Emmy-nominated role opposite Peter Falk in The Dick Powell Theatre: Price of Tomatoes (1962), and popular appearances on such TV shows as Bonanza (1959), The Twilight Zone (1959) and Route 66 (1960) paved the way to a popular series as \"Katy Holstrum\", the Swedish governess, in The Farmer's Daughter (1963). This brisk, change-of-pace comedy role earned her a Golden Globe award and Emmy nomination, and lasted three seasons. Now officially a household name, Inger built up her momentum once again in films. A string of parts came her way within a three-year period including the sex comedy A Guide for the Married Man (1967) as roving eye husband Walter Matthau's unsuspecting wife; Clint Eastwood's first home-made American \"spaghetti western\", Hang 'Em High (1968); the crime drama, Madigan (1968) with Henry Fonda and Richard Widmark; the westerns Firecreek (1968) with Fonda again plus James Stewart, and 5 Card Stud (1968) opposite Dean Martin and Robert Mitchum; the political thriller House of Cards (1968) starring George Peppard and Orson Welles; and A Dream of Kings (1969) which reunited her with old flame Anthony Quinn. Although many of her co-starring roles seemed to be little more than love interest filler, Inger made a noticeable impression in the last movie mentioned, by far the most intense and complex of her film career. Adding to that mixture were a number of well-made TV mini-movies. On the minus side, she also resurrected the bad habit of pursuing affairs with her co-stars, which would include Dean Martin and, most notably, Burt Reynolds, her last. In April of 1970, Inger signed on as a series lead in a crime whodunit The Most Deadly Game (1970) to be telecast that September. It never came to be. Less than a week later, she was found unconscious on the floor of her kitchen by her housekeeper and died en route to the hospital of acute barbiturate intoxication -- a lethal combination of drugs and alcohol. Yvette Mimieux replaced her in the short-lived series that fall. For all intents and purposes, Ms. Stevens' death was a suicide but Patterson's bio indicates other possibilities. Following her death, it came out in the tabloids that she had been secretly married to African-American Ike Jones since 1961. The couple was estranged at the time of her death.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MTk0NDg1M15BMl5BanBnXkFtZTcwNzQ1MTgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0828447","name":"Inger Stevens","nicknames":["Kay Palmer"],"idIMDB":"nm0828447"},"actorId":"nm0828447","character":"Annette Claiborne","urlCharacter":"http://www.imdb.com/character/ch0151312","main":true},{"actorName":"Henry Hull","urlProfile":"http://www.imdb.com/name/nm0401434","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc4YmZlZDQtMDM3NC00YmNkLTkwMTMtODVjY2FlMDMyYzU5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 October 1890","placeOfBirth":" Louisville, Kentucky, USA","birthName":"Henry Watterson Hull","height":"6' (1.83 m)","bio":"Henry Hull, the actor who created the role of Jeeter on Broadway in \"Tobacco Road,\" was born in Louisville, Kentucky, on October 13, 1890, the son of a drama critic. Originally intending to become an engineer, Hull became an actor and made his Broadway debut in \"Green Stockings\" less than two weeks before his 21st birthday, on October 2, 1911. Two years later he appeared again on Broadway in support of John Barrymore in \"Believe Me, Xantippe.\" He then quit the stage to go prospecting for gold, using his skills as a mining engineer. When he failed to find his El Dorado, Hull turned back to acting, appearing in \"The Man Who Came Back\" in 1916. He made his first films at the nearby World Pictures in 1917, most famously starring as the ill-fated Aleksandr Kerensky in Rasputin, the Black Monk (1917). The following year he appeared in the second film adaptation of Louisa May Alcott's famous novel Little Women (1918). Although he appeared in about a dozen films from just after World War One to the mid '30s, Hull concentrated on the stage until he went to Hollywood to appear as Magwitch in Great Expectations (1934). He even had a play he wrote produced on Broadway, \"Manhattan,\" which made its debut on August 15, 1922, at the Playhouse Theatre and ran for a respectable (for the time) 86 performances. Hull made his mark in the history of the horror film, one of Hollywood's most venerable genres, by appearing in the title role in Werewolf of London (1935). Six feet tall and slender, Hull had a rich and cultured voice, which put him in demand as a supporting player in the Golden Age of Hollywood. He was, however, somewhat of a mannered actor in a style that went out of favor after the death of John Barrymore, and he often gave a performance, such as that of the newspaper editor in The Return of Frank James (1940), that was a thick slice of ham. However, his mannerisms and plummy voice were perfect for certain roles such as the obnoxious millionaire conceived by populist John Steinbeck for Lifeboat (1944). Hull's greatest success as an actor was on Broadway, limning Erskine Caldwell's Jeeter in \"Tobacco Road,\" which still ranks as the longest-running drama in the Great White Way's history, opening on December 4, 1933, and closing on May 31, 1941, after 3,182 total performances. (Hull, of course, did not play the entire run; Jeeter was also played by James Barton and Will Geer). By early 1936 Hull was starring on Broadway in Maxwell Anderson's \"The Masque of Kings\". When John Ford went looking to cast roles in his film version of the play Tobacco Road (1941), he chose lovable old coot Charley Grapewin for Jeeter; Grapewin had been memorable as Grandpa Joad the year before in Ford's classic adaptation of Steinbeck's novel, The Grapes of Wrath (1940). Henry Hull's last film appearance was as a sort of chorus along with Jocelyn Brando in The Chase (1966). He was the brother of actor Shelly Hull, the brother-in-law of Shelly's wife Josephine Hull and the father of producer Shelley Hull with his wife, actress Juliet Fremont, with whom he had appeared on Broadway in 1916 in \"The Man Who Came Back.\" Their son Henry Hull Jr. had a minor career on Broadway, appearing in and serving as assistant stage manager in his father's \"The Masque of Kings,\" as well as appearing in the ensemble in the legendary \"Hamlet\" of John Gielgud that was on Broadway in 1936.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDc4YmZlZDQtMDM3NC00YmNkLTkwMTMtODVjY2FlMDMyYzU5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0401434","name":"Henry Hull","idIMDB":"nm0401434"},"actorId":"nm0401434","character":"Ezra Peavey","urlCharacter":"http://www.imdb.com/character/ch0151313","main":true},{"actorName":"E.G. Marshall","urlProfile":"http://www.imdb.com/name/nm0550855","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Nzg5MTMwOF5BMl5BanBnXkFtZTYwMzk2MTQ2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 June 1914","placeOfBirth":" Owatonna, Minnesota, USA","birthName":"Everett Eugene Grunz","height":"5' 8\" (1.73 m)","bio":"With over 150 Film and TV appearances to his credit, E.G. Marshall was arguably most well known as the imperturbable Juror No. 4 in the Sidney Lumet mystery 12 Angry Men (1957). Some of his stand-out performances are in Creepshow (1982), National Lampoon's Christmas Vacation (1989), and Nixon (1995). Marshall married three times and had seven children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Nzg5MTMwOF5BMl5BanBnXkFtZTYwMzk2MTQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0550855","name":"E.G. Marshall","nicknames":["Eej"],"idIMDB":"nm0550855"},"actorId":"nm0550855","character":"Gov. William Claiborne","urlCharacter":"http://www.imdb.com/character/ch0151309","main":true},{"actorName":"Charlton Heston","urlProfile":"http://www.imdb.com/name/nm0000032","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMDg1MjYzMV5BMl5BanBnXkFtZTYwMDMxOTE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1923","placeOfBirth":" Wilmette, Illinois, USA","birthName":"John Charles Carter","height":"6' 2½\" (1.89 m)","bio":"With features chiseled in stone, and renowned for playing a long list of historical figures, particularly in Biblical epics, the tall, well built and ruggedly handsome Charlton Heston was one of Hollywood's greatest leading men and remained active in front of movie cameras for over sixty years. As a Hollywood star, he appeared in 100 films over the course of 60 years. He played Moses in the epic film, The Ten Commandments (1956), for which he received his first Golden Globe Award nomination. He also starred in Touch of Evil (1958) with Orson Welles; Ben-Hur, for which he won the Academy Award for Best Actor (1959); El Cid (1961); and Planet of the Apes (1968). He also starred in the films The Greatest Show on Earth (1952); Secret of the Incas (1954); The Big Country (1958); and The Agony and the Ecstasy (1965). A supporter of Democratic politicians and civil rights in the 1960s, Heston later became a Republican, founding a conservative political action committee and supporting Ronald Reagan. Heston's most famous role in politics came as the five-term president of the National Rifle Association, from 1998 to 2003. Heston was born John Charles Carter on October 4, 1924, in No Man's Land, Illinois, to Lila (Charlton) and Russell Whitford Carter, who operated a sawmill. He had English and Scottish ancestry, with recent Canadian forebears. Heston made his feature film debut as the lead character in a 16mm production of Peer Gynt (1941), based on the Henrik Ibsen play. In 1944, Heston enlisted in the United States Army Air Forces. He served for two years as a radio operator and aerial gunner aboard a B-25 Mitchell stationed in the Alaskan Aleutian Islands with the 77th Bombardment Squadron of the Eleventh Air Force. He reached the rank of Staff Sergeant. Heston married Northwestern University student Lydia Marie Clarke, who was six months his senior. That same year he joined the military. Heston played 'Marc Antony' in Julius Caesar (1950), and firmly stamped himself as genuine leading man material with his performance as circus manager 'Brad Braden' in the Cecil B. DeMille spectacular The Greatest Show on Earth (1952), also starring James Stewart and Cornel Wilde. The now very popular actor remained perpetually busy during the 1950s, both on TV and on the silver screen with audience pleasing performances in the steamy thriller The Naked Jungle (1954), as a treasure hunter in Secret of the Incas (1954) and another barn storming performance for Cecil B. DeMille as \"Moses\" in the blockbuster The Ten Commandments (1956). Heston delivered further dynamic performances in the oily film noir thriller Touch of Evil (1958), and then alongside Gregory Peck in the western The Big Country (1958) before scoring the role for which he is arguably best known, that of the wronged Jewish prince who seeks his freedom and revenge in the William Wyler directed Ben-Hur (1959). This mammoth Biblical epic running in excess of three and a half hours became the standard by which other large scale productions would be judged, and it's superb cast also including Stephen Boyd as the villainous \"Massala\", English actor Jack Hawkins as the Roman officer \"Quintus Arrius\", and Australian actor Frank Thring as \"Pontius Pilate\", all contributed wonderful performances. Never one to rest on his laurels, steely Heston remained the preferred choice of directors to lead the cast in major historical productions and during the 1960s he starred as Spanish legend \"Rodrigo Diaz de Vivar\" in Le Cid (1961), as a US soldier battling hostile Chinese boxers during 55 Days at Peking (1963), played the ill-fated \"John the Baptist\" in The Greatest Story Ever Told (1965), the masterful painter \"Michelangelo\" battling Pope Julius II in The Agony and the Ecstasy (1965), and an English general in Khartoum (1966). In 1968, Heston filmed the unusual western Will Penny (1967) about an aging and lonely cowboy befriending a lost woman and her son, which Heston has often referred to as his favorite piece of work on screen. Interestingly, Heston was on the verge of acquiring an entirely new league of fans due to his appearance in four very topical science fiction films (all based on popular novels) painting bleak future's for mankind. In 1968, Heston starred as time traveling astronaut \"George Taylor\", in the terrific Planet of the Apes (1968) with it's now legendary conclusion as Heston realizes the true horror of his destination. He returned to reprise the role, albeit primarily as a cameo, alongside fellow astronaut James Franciscus in the slightly inferior sequel Beneath the Planet of the Apes (1970). Next up, Heston again found himself facing the apocalypse in The Omega Man (1971) as the survivor of a germ plague that has wiped out humanity leaving only bands of psychotic lunatics roaming the cities who seek to kill the uninfected Heston. And fourthly, taking its inspiration from the Harry Harrison novel \"Make Room!, Make Room!\", Heston starred alongside screen legend Edward G. Robinson and Chuck Connors in Soylent Green (1973). During the remainder of the 1970s, Heston appeared in two very popular \"disaster movies\" contributing lead roles in the far fetched Airport 1975 (1974), plus in the star laden Earthquake (1974), filmed in \"Sensoround\" (low bass speakers were installed in selected theaters to simulate the earthquake rumblings on screen to movie audiences). He played an evil Cardinal in the lively The Four Musketeers: Milady's Revenge (1974), a mythical US naval officer in the recreation of Midway (1976), also filmed in \"Sensoround\", an LA cop trying to stop a sniper in Two-Minute Warning (1976) and another US naval officer in the submarine thriller Gray Lady Down (1978). Heston appeared in numerous episodes of the high rating TV series Dynasty (1981) and The Colbys (1985), before moving onto a mixed bag of projects including TV adaptations of Treasure Island (1990) and A Man for All Seasons (1988), hosting two episodes of the comedy show, Saturday Night Live (1975), starring as the \"Good Actor\" bringing love struck Mike Myers to tears in Wayne's World 2 (1993), and as the eye patch wearing boss of intelligence agent Arnold Schwarzenegger in True Lies (1994). He also narrated numerous TV specials and lent his vocal talents to the animated movie Hercules (1997), the family comedy Cats & Dogs (2001) and an animated version of Ben Hur (2003). Heston made an uncredited appearance in the inferior remake of Planet of the Apes (2001), and his last film appearance to date was in the Holocaust themed drama of Rua Alguem 5555: My Father (2003). Heston narrated for highly classified military and Department of Energy instructional films, particularly relating to nuclear weapons, and \"for six years Heston [held] the nation's highest security clearance\" or Q clearance.\" The Q clearance is similar to a DoD or Defense Intelligence Agency (DIA) clearance of Top Secret. Heston was married to Lydia Marie Clark Heston since March 1944, and they have two children. His highly entertaining autobiography was released in 1995, titled appropriately enough \"Into The Arena\". Although often criticized for his strong conservative beliefs and involvement with the NRA, Heston was a strong advocate for civil right many years before it became fashionable, and was a recipient of the Jean Hersholt Humanitarian Award, plus the Kennedy Center Lifetime Achievement Award. In 2002, he was diagnosed with Alzheimer's disease, and did appear in a film or TV production after 2003. He died in April 2008. Truly, Charlton Heston is one of the legendary figures of US cinema.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMDg1MjYzMV5BMl5BanBnXkFtZTYwMDMxOTE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000032","name":"Charlton Heston","nicknames":["Chuck"],"idIMDB":"nm0000032"},"actorId":"nm0000032","character":"Gen. Andrew Jackson","urlCharacter":"http://www.imdb.com/character/ch0028812","main":true},{"actorName":"Lorne Greene","urlProfile":"http://www.imdb.com/name/nm0001296","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MDA5OTQxNV5BMl5BanBnXkFtZTYwOTU2NTI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1915","placeOfBirth":" Ottawa, Ontario, Canada","birthName":"Lyon Chaim Green","height":"6' (1.83 m)","bio":"Lorne Greene was born Lyon Himan \"Chaim\" Greene on February 12, 1915 in Ottawa, Ontario, Canada. He began acting while attending Canada's Queen's University, and after graduation got a job in radio broadcasting. His rich, deep, authoritarian voice quickly propelled him to prominence as Canada's top newscaster. He left Canada in the early 1950s for a film career in Hollywood, California, and soon began appearing regularly in television, films and on radio. His greatest successes came in two television series, the long-running Western Bonanza (1959), in which he played the patriarch of a wealthy frontier family, and the science fiction series Battlestar Galactica (1978). In 1969, he was awarded Officer of the Order of Canada for his services to the performing arts and community. Lorne Greene died at age 72 of pneumonia following heart surgery on September 11, 1987 in Santa Monica, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MDA5OTQxNV5BMl5BanBnXkFtZTYwOTU2NTI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001296","name":"Lorne Greene","nicknames":["The Voice of Doom","The Voice of Canada"],"idIMDB":"nm0001296"},"actorId":"nm0001296","character":"Mercier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ted de Corsia","urlProfile":"http://www.imdb.com/name/nm0208125","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwODcwNjU2NV5BMl5BanBnXkFtZTcwMzQyMTYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1905","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Edward Gildea De Corsia","height":"5' 11\" (1.8 m)","bio":"A big, brawny villain of many 1940s and 1950s films, Ted de Corsia was an actor in touring companies and on radio before making a memorable film debut as the killer in The Lady from Shanghai (1947). Although he occasionally played such sympathetic roles as a judge or prison warden, de Corsia's imposing size, tough New York street demeanor - he was born and raised in Brooklyn - and gravelly voice assured him steady work playing murderous street thugs, outlaw gang leaders or organized-crime bosses. One of his best-remembered roles was as the head of a murder-for-hire gang who turns state's evidence in the Humphrey Bogart crime thriller The Enforcer (1951).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwODcwNjU2NV5BMl5BanBnXkFtZTcwMzQyMTYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0208125","name":"Ted de Corsia","idIMDB":"nm0208125"},"actorId":"nm0208125","character":"Capt. Rumbo","urlCharacter":"http://www.imdb.com/character/ch0302891","main":true},{"actorName":"Douglass Dumbrille","urlProfile":"http://www.imdb.com/name/nm0241523","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5Mjg2NTIwOV5BMl5BanBnXkFtZTcwNjk0MDQxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1889","placeOfBirth":" Hamilton, Ontario, Canada","birthName":"Douglass Rupert Dumbrille","height":"6' 1½\" (1.87 m)","bio":"Distinguished character villain Douglass (R.) Dumbrille, whose distinctive stern features, beady eyes, tidy mustache, prominent hook nose and suave, cultivated presence graced scores of talking films, was born on October 13, 1889, in Hamilton, Ontario, Canada. He was first employed as a bank clerk in his home town but caught the acting bug and subsequently left his position to pursue work in various stock companies in the States. After appearing in a production of \"Rain\" in 1923, Dumbrille made his Broadway debut in 1924 as Banquo in \"Macbeth\" at the 48th Street Theatre. Throughout the 1920s and early 1930s he was a moderate fixture on the Great White Way, appearing in dramas (\"The Call of Life\" (1925) with Eva Le Gallienne, \"Chinese O'Neill\" (1929), \"As You Desire Me\" (1931)), romantic comedies (\"Joseph\" (1930), \"Child of Manhattan\" (1932)) and musical operettas (\"Princess Flavia\" (1925), \"Princess Charming\" (1930)). He also appeared in Florenz Ziegfeld Jr.'s 1928 musical production of \"The Three Musketeers\", portraying Athos alongside Dennis King's D'Artagnan, with Rudolf Friml providing the music. A decade later he portrayed Athos once again, this time in a film version (The Three Musketeers (1939)). On the silent screen he portrayed Thomas Jefferson in the short historical film The Declaration of Independence (1924), but did not return to film until 1931, when he began unleashing a number of sneering, oily villains on the viewing public. His first film job was to harass sea captain Gary Cooper in His Woman (1931). From there he proved a slick nemesis to a number of stars, both male and female: Marion Davies with his leering moneybags in Blondie of the Follies (1932); Pat O'Brien with his cruel-minded chain gang warden in Laughter in Hell (1933); Barbara Stanwyck as her unctuous love patsy in Baby Face (1933); James Cagney as gangster Spade Maddock in Lady Killer (1933); Warner Baxter and Myrna Loy as a mobster involved in horse race fixing in Broadway Bill (1934) and, most notoriously, Gary Cooper and Franchot Tone, both of whom he induces fingernail torture (\"We have ways of making men talk!\") as the sinister, turban-wearing rebel leader Mohammed Khan in The Lives of a Bengal Lancer (1935). Dumbrille was also a great pompous foil in comedy slapstick - harassing everybody from The Marx Brothers, Bud Abbott and Lou Costello to Bob Hope. He returned to the musical operetta fold as well on film and played a nuisance to Jeanette MacDonald in three of her films. Seen everywhere, both billed and unbilled, he played sheriffs who went bad in westerns, red-herring suspects or victims who deserved their fate in murder mysteries and corrupters of the legal system in political dramas. The man everybody loved to hate on film softened his image a bit with old age, playing a number of non-plussed executive or officious types in films and TV comedy. Finding a stream of TV work in the 1950s and early 1960s (including The George Burns and Gracie Allen Show (1950), The Untouchables (1959), Perry Mason (1957), Laramie (1959). Petticoat Junction (1963)), Dumbrille's final role was at age 76 as a doctor in a TV episode of Batman (1966) in 1966. His long-time first wife, Jessie Lawson, died in 1957, leaving him two sons, John and Douglas Murray. Dumbrille had more than a few Hollywood tongues wagging when, at age 70, he married Patricia Mowbray, the 28-year-old daughter of his good friend, character actor Alan Mowbray. The marriage was a lasting one, however, and she was among his survivors when he passed away several years later from a heart attack on April 2, 1974. Dumbrille was buried at Pierce Brothers Valhalla Memorial Park Cemetery in North Hollywood, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5Mjg2NTIwOV5BMl5BanBnXkFtZTcwNjk0MDQxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0241523","name":"Douglass Dumbrille","idIMDB":"nm0241523"},"actorId":"nm0241523","character":"Collector of the Port","urlCharacter":"http://www.imdb.com/character/ch0302892","main":true},{"actorName":"Robert F. Simon","urlProfile":"http://www.imdb.com/name/nm0800359","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMzg0NTI0Ml5BMl5BanBnXkFtZTgwODQ5MDgzMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 December 1908","placeOfBirth":" Mansfield, Ohio, USA","height":"5' 11\" (1.8 m)","bio":"A prolific character actor of tall, imposing presence, Robert F. Simon drifted into acting via the Cleveland Playhouse, hoping that this would cure his natural propensity for shyness. After training at the Actor's Studio in New York, he had a ten year run on Broadway (1942-52), in which he cut his teeth, both as actor and as stage manager, on anything from drama to musical comedy. In a roundabout way, he was even able to fulfill his original career goal of becoming a traveling salesman -- as understudy to the great Lee J. Cobb in the role of Willy Loman, in Arthur Miller's \"Death of a Salesman\". Robert started in films in 1950, but over the years was often typecast in stereotypical roles of benevolent authoritarianism or grouchy executive stress, at times drawing unkind reviews from the critics. He was considerably better served by the small screen, where, for some 35 years, he became a familiar face as generals, police captains, doctors, journalists and attorneys. He is, perhaps, most fondly remembered as George Armstrong Custer's disapproving superior, General Alfred Terry, in Custer (1967); as the sympathetic, long-suffering father of Darren Stephens in Bewitched (1964); and as Maynard M. Mitchell, one of the wackiest of generals ever to have served in the Korean War (or any other war, for that matter), in M*A*S*H (1972).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxMzg0NTI0Ml5BMl5BanBnXkFtZTgwODQ5MDgzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0800359","name":"Robert F. Simon","idIMDB":"nm0800359"},"actorId":"nm0800359","character":"Capt. Brown","urlCharacter":"http://www.imdb.com/character/ch0151314","main":true},{"actorName":"Sir Lancelot","urlProfile":"http://www.imdb.com/name/nm0484240","urlPhoto":"","biography":{"dateOfBirth":"24 March 1902","placeOfBirth":" Cumuto, Trinidad, British West Indies [now Trinidad and Tobago]","birthName":"Lancelot Victor Edward Pinard","bio":"He was born Lancelot Victor Edward Pinard, to well-to-do Anglophile parents in Trinidad. Oddly though, it wasn't until schooling took him to New York City in 1940 that he discovered a love of calypso music. In a profession where successful artists commonly took names like King Radio or Lord Invader, it was natural for someone named Lancelot to choose the stage name Sir Lancelot, and with that name he wrote and performed calypso (with some acting on the side) for movies, live theater, and radio beginning in the 1940's.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0484240","name":"Sir Lancelot","idIMDB":"nm0484240"},"actorId":"nm0484240","character":"Scipio","urlCharacter":"http://www.imdb.com/character/ch0302893","main":true},{"actorName":"Fran Jeffries","urlProfile":"http://www.imdb.com/name/nm0420364","urlPhoto":"","biography":{"dateOfBirth":"18 May 1937","placeOfBirth":" San Jose, California, USA","birthName":"Frances Ann Makris","bio":"Fran Jeffries was born on May 18, 1937 in San Jose, California, USA as Frances Ann Makris. She was an actress, known for The Pink Panther (1963), The Bob Hope Christmas Special (1973) and Sex and the Single Girl (1964). She was married to Steven Schaeffer, Richard Quine, Dick Haymes and Edward E. Belasco, Jr. She died on December 15, 2016 in Los Angeles, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0420364","name":"Fran Jeffries","idIMDB":"nm0420364"},"actorId":"nm0420364","character":"Cariba - Mawbee Girl","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Dierkes","urlProfile":"http://www.imdb.com/name/nm0226109","urlPhoto":"","biography":{"dateOfBirth":"10 February 1905","placeOfBirth":" Cincinnati, Ohio, USA","height":"6' 6\" (1.98 m)","bio":"Tall and gaunt American character actor prominent in a number of classic American films. A native of Cincinnati, Ohio, he attended Brown University and subsequently went to work as an economist for the United States Department of State. In 1941, he joined the American Red Cross and served in Great Britain during the war. There he met director John Huston, who took a liking to Dierkes and recommended that he try Hollywood after the war. Instead, Dierkes went to work for the U.S. Treasury Department, which, coincidentally, sent him to Hollywood to function as technical adviser on the film To the Ends of the Earth (1948). 'Orson Welles' cast him as Ross in his adaptation of Macbeth (1948). Dierkes returned to the Treasury Department, but two years later, Huston called on him to play The Tall Soldier in The Red Badge of Courage (1951). Dierkes took a leave of absence from his job, a leave which lasted for the rest of Dierkes's life. His quiet dignity and distinctive appearance led him to dozens of roles in film and on television. In John Wayne's The Alamo (1960), Dierkes plays a Scot, \"Jocko Robertson\", named after Dierkes's own maternal grandfather. He died in 1975, and was survived by his wife, two sons, and two daughters.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0226109","name":"John Dierkes","idIMDB":"nm0226109"},"actorId":"nm0226109","character":"Deacon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ken Miller","urlProfile":"http://www.imdb.com/name/nm0588731","urlPhoto":"","biography":{"dateOfBirth":"15 October 1931","placeOfBirth":" Springfield, Ohio, USA","bio":"An Ohioan by birth, son of a minister, Ken Miller broke quietly into showbiz behind the backs of his parents, then relocated to California after the death of his father. The familiar array of odd jobs preceded his motion picture debut (1952's Fearless Fagan (1952)) and a stint with Uncle Sam in Berlin (where he took time off to play a recurring role in the low-cost Flash Gordon (1954) TV series). Returning to Tinseltown, he palled around with contemporaries like Connie Stevens, Troy Donahue, Annette Funicello, Burt Reynolds and others. While he never neared their level of success, he nevertheless kept busy cutting his own records and acting on the large and small screen. Miller is now based in Florida.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0588731","name":"Ken Miller","idIMDB":"nm0588731"},"actorId":"nm0588731","character":"Young Sentry","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0051436","urlIMDB":"http://www.imdb.com/title/tt0051436","business":{"budget":{"money":"$5,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Copyright © 1958 by Paramount Pictures Corporation"},"technical":{"runtime":["1 hr 59 min (119 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Technicolor"],"filmLength":null,"negativeFormat":["35 mm (horizontal)"],"cinematographicProcess":["VistaVision"],"printedFilmFormat":["35 mm"]},"rating":"6.5","filmingLocations":[{"location":"New Iberia, Louisiana, USA"}],"rated":"APPROVED","awards":[{"award":"Academy Awards, USA 1959","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Costume Design, Black-and-White or Color","names":[{"name":"Ralph Jester","id":"nm0422286","role":null},{"name":"Edith Head","id":"nm0372128","role":null},{"name":"John Jensen","id":"nm0421522","role":null}]}]}]}],"votes":"1,763","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["louisiana","governor","ship","andrew jackson","war of 1812","fight","pirate","trading post","1810s","argument","doublecross","pillaging","map","nickname","doomed romance","gun","gunfire","cannon","amnesty","pardon","fire","knife","death by hanging","hanging","sailing","introduction","begins with a documentary introduction","narrator introduction","prologue","year 1815","horse","father daughter relationship","fiance","fiancee","wedding dress","loss of sister","death of sister","engagement ring","engagement","dog","new orleans louisiana","soldier","battle","pirate ship","pirate gang","pirate captain","sinking ship","female pirate","hairy chest","bare chested male","epic","battle of new orleans","two word title","u.s. president","remake","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:06:08"}}