{"data":{"movies":[{"title":"Cimarron","originalTitle":"","year":"1931","releaseDate":"19310209","directors":[{"name":"Wesley Ruggles","id":"nm0749484"}],"writers":[{"name":"Edna Ferber","id":"nm0272209"},{"name":"Howard Estabrook","id":"nm0261455"}],"runtime":"123 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExODI2MjE4NF5BMl5BanBnXkFtZTgwMDA2NTAwMjE@._V1.jpg","countries":["USA"],"languages":["English","French"],"genres":["Drama","Western"],"plot":"When the government opens up the Oklahoma territory for settlement, restless Yancey Cravat claims a plot of the free land for himself and moves his family there from Wichita. A newspaperman, lawyer, and just about everything else, Cravat soon becomes a leading citizen of the boom town of Osage. Once the town is established, however, he begins to feel confined once again, and heads for the Cherokee Strip, leaving his family behind. During this and other absences, his wife Sabra must learn to take care of herself and soon becomes prominent in her own right.","simplePlot":"A newspaper editor settles in an Oklahoma boom town with his reluctant wife at the end of the nineteenth century.","actors":[{"actorName":"Richard Dix","urlProfile":"http://www.imdb.com/name/nm0228715","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NDY3ODg2Ml5BMl5BanBnXkFtZTcwNTA0MTg2OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 July 1893","placeOfBirth":" St. Paul, Minnesota, USA","birthName":"Ernest Carlton Brimmer","height":"6' (1.83 m)","bio":"Richard Dix was a major leading man at RKO Radio Pictures from 1929 through 1943. He was born Ernest Carlton Brimmer July 18, 1893, in St. Paul, Minnesota. There he was educated, and at the desires of his father, studied to be a surgeon. His obvious acting talent in his school dramatic club led him to leading roles in most of the school plays. At 6' 0\" and 180 pounds, Dix excelled in sports, especially football and baseball. These skills would serve him well in the vigorous film roles he would go on to play. After a year at the University of Minnesota he took a position at a bank, spending his evenings training for the stage. His professional start was with a local stock company, and this led to similar work in New York. The death of his father left him with a mother and sister to support. He went to Los Angeles, became leading man for the Morosco Stock Company and his success there got him a contract with Paramount Pictures. His rugged good looks and dark features made him a popular player in westerns. His athletic ability led to his starring role in Paramount's Warming Up (1928), a baseball story and also the studio's first feature with synchronized score and sound effects. His deep voice and commanding presence were perfectly suited for the talkies, and he was signed by RKO Radio Pictures in 1929, scoring an early triumph in the all-talking mystery drama, Seven Keys to Baldpate (1929). In 1931 he was nominated for a Best Actor Oscar for his masterful performance in Cimarron (1931), winner of the Best Picture Oscar that year. Throughout the 1930s Dix would be a big box-office draw at RKO, appearing in mystery thrillers, potboilers, westerns and programmers. He appeared in the \"Whistler\" series of mystery films at Columbia in the mid-40s. He retired from films in 1947. He first married Winifred Coe on October 20, 1931, had a daughter, Martha Mary Ellen, then divorced in 1933. He then married Virginia Webster on June 29, 1934. They had twin boys, Richard Jr. and Robert Dix and an adopted daughter, Sara Sue. Richard Dix the actor, died at age 56 on September 20, 1949.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NDY3ODg2Ml5BMl5BanBnXkFtZTcwNTA0MTg2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0228715","name":"Richard Dix","idIMDB":"nm0228715"},"actorId":"nm0228715","character":"Yancey Cravat","urlCharacter":"http://www.imdb.com/character/ch0126346","main":true},{"actorName":"Irene Dunne","urlProfile":"http://www.imdb.com/name/nm0002050","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA1NTg0NzU2MV5BMl5BanBnXkFtZTYwNjU5OTU2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 December 1898","placeOfBirth":" Louisville, Kentucky, USA","birthName":"Irene Marie Dunn","height":"5' 5\" (1.65 m)","bio":"Irene Marie Dunne was born on December 20, 1898, in Louisville, Kentucky. She was the daughter of Joseph Dunne, who inspected steamships, and Adelaide Henry, a musician who prompted Irene in the arts. Her first production was in Louisville when she appeared in \"A Midsummer Night's Dream\" at the age of five. Her \"debut\" set the tone for a fabulous career. Following the tragic death of her father when she was 12, she moved with her remaining family to the picturesque and historic town of Madison, Indiana, to live with her maternal grandparents at 916 W. Second St. During the next few years Irene studied voice and took piano lessons in town. She was able to earn money singing in the Christ Episcopal Church choir on Sundays. After graduating from Madison High School in 1916, she studied until 1917 in a music conservatory in Indianapolis. After that she accepted a teaching post as a music and art instructor in East Chicago, Indiana, just a stone's throw from Chicago. She never made it to the school. While on her way to East Chicago, she saw a newspaper ad in the Indianapolis Star and News for an annual scholarship contest run by the Chicago Music College. Irene won the contest, which enabled her to study there for a year. After that she headed for New York City because it was still the entertainment capital of the world. Her first goal in New York was to add her name to the list of luminaries of the Metropolitan Opera Company. Her audition did her little good, as she was rejected for being too young and inexperienced. She did win the leading role in a road theater company, which was in turn followed by numerous plays. During this time she studied at the Chicago Music College, from which she graduated with high honors in 1926. In 1928, Irene met and married a promising young dentist from New York named Francis Dennis Griffin. She remained with Dr. Griffin until his death in 1965. Irene came to the attention of Hollywood when she performed in \"Show Boat\" on the East Coast. By 1930 she was under contract to RKO Pictures. Her first film was Leathernecking (1930), which went almost unnoticed. In 1931 she appeared in Cimarron (1931), for which she received the first of five Academy Award nominations. No Other Woman (1933) and Ann Vickers (1933) the same year followed. In 1936 (due to her comic skits in Show Boat (1936) she was \"persuaded\" to star in a comedy, up to that time a medium for which she had small affection. However, Theodora Goes Wild (1936) was an instant hit, almost as popular as the more famous It Happened One Night (1934) from two years before. From this she earned her second Academy Award nomination. Later, in 1937, she was teamed with Cary Grant in The Awful Truth (1937). This helped her garner a third Academy Award nomination. She starred with Grant later in My Favorite Wife (1940) and Penny Serenade (1941). Her favorite film was Love Affair (1939) with Charles Boyer, a huge hit in a year with so many great films, and a role for which she was again nominated for an Academy Award. Howevever, it was the tear-jerker I Remember Mama (1948) for which she will be best remembered in the role of the loving, self-sacrificing Norwegian mother. She got another nomination for that but again lost. This was the picture in which she should have won the Oscar. She began to wean herself away from films toward the many charities and public works she championed. Her last major movie was as Polly Baxter in 1952's It Grows on Trees (1952). After that she only appeared as a guest on television. Irene knew enough to quit while she was ahead of the game and this helped keep her legacy intact. In 1957 she was appointed as a special US delegate to the United Nations during the 12th General Assembly by President Dwight D. Eisenhower, such was her widespread appeal. The remainder of her life was spent on civic causes. She even donated $10,000 to the restoration of the town fountain in her girlhood home of Madison, Indiana, in 1976, even though she had not been there since 1938 when she came home for a visit. She died of heart failure on September 4, 1990, in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzA1NTg0NzU2MV5BMl5BanBnXkFtZTYwNjU5OTU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002050","name":"Irene Dunne","nicknames":["First Lady of Hollywood"],"idIMDB":"nm0002050"},"actorId":"nm0002050","character":"Sabra Cravat","urlCharacter":"http://www.imdb.com/character/ch0049784","main":true},{"actorName":"Estelle Taylor","urlProfile":"http://www.imdb.com/name/nm0852347","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIyMTM3Njg4MV5BMl5BanBnXkFtZTgwODc0OTY3MTE@._V1._CR32.883331298828125,13.533340454101562,298,419_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 May 1894","placeOfBirth":" Wilmington, Delaware, USA","birthName":"Ida Estelle Taylor","height":"5' 4½\" (1.64 m)","bio":"A former typist, Estelle Taylor married a banker at age 14 and, after leaving him, moved to New York to study dramatic acting. She also modeled for artists and appeared in the chorus of a couple of Broadway shows. In the early 1920s she came to Hollywood and was noted as one of the film colony's most beautiful women. In 1925 she married 1920s heavyweight champion boxer Jack Dempsey. On the night of December 4, 1944, she spent an evening of dinner and drinks with actress Lupe Velez and was the last person to see Lupe before she committed suicide. Taylor was founder and president of the California Pet Owners' Protective League and was widely known for her devotion to pets. In 1953 served on the Los Angeles City Animal Regulation Commission.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODIyMTM3Njg4MV5BMl5BanBnXkFtZTgwODc0OTY3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0852347","name":"Estelle Taylor","nicknames":["The Delaware Delilah"],"idIMDB":"nm0852347"},"actorId":"nm0852347","character":"Dixie Lee","urlCharacter":"http://www.imdb.com/character/ch0211042","main":true},{"actorName":"Nance O'Neil","urlProfile":"http://www.imdb.com/name/nm0642042","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTY4ZWFkYmEtZTE1Mi00MDI1LWJhYWItMmViYThjNzI5M2JiXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 October 1874","placeOfBirth":" Oakland, California, USA","birthName":"Gertrude Lamson","height":"5' 8\" (1.73 m)","bio":"Nance O'Neil was born on October 8, 1874 in Oakland, California, USA as Gertrude Lamson. She was an actress, known for Cimarron (1931), The Rogue Song (1930) and Kreutzer Sonata (1915). She was married to Alfred Hickman. She died on February 7, 1965 in Englewood, New Jersey, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTY4ZWFkYmEtZTE1Mi00MDI1LWJhYWItMmViYThjNzI5M2JiXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0642042","name":"Nance O'Neil","idIMDB":"nm0642042"},"actorId":"nm0642042","character":"Felice Venable","urlCharacter":"http://www.imdb.com/character/ch0211043","main":true},{"actorName":"William Collier Jr.","urlProfile":"http://www.imdb.com/name/nm0171873","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzJmM2VkYWItZGNmNi00MzllLTk3YjAtMzZiZWU3NTg2ZjU0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1902","placeOfBirth":" New York City, New York, USA","birthName":"Charles F. Gall Jr.","height":"5' 10¾\" (1.8 m)","bio":"Buster Collier was born Charles F. Gall Jr. in New York and got his show-business start at the age of seven, his mother being an actress and his father being a theater manager. His parents later divorced and his mother married actor William Collier Sr., who adopted the boy and gave him his new name, William Collier Jr., nicknamed \"Buster\". Collier's stage experience got him his first film role, The Bugle Call (1916) at age 14. He soon became one of the most popular actors of the 1920s, easily making the transition from child actor to young romantic lead. In 1935 he retired from acting to become a producer, first in the US and then in England, where he moved in 1937 and stayed until the late 1940s. In the 1950s he produced several television series in the US.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzJmM2VkYWItZGNmNi00MzllLTk3YjAtMzZiZWU3NTg2ZjU0XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0171873","name":"William Collier Jr.","nicknames":["Buster"],"idIMDB":"nm0171873"},"actorId":"nm0171873","character":"The Kid","urlCharacter":"http://www.imdb.com/character/ch0211047","main":true},{"actorName":"Roscoe Ates","urlProfile":"http://www.imdb.com/name/nm0040374","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGZjODlhYmYtMjk2NC00MGM5LTllM2YtMzg5NGRjODc3YmE5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1895","placeOfBirth":" Grange, Mississippi, USA","birthName":"Roscoe Blevel Ates","height":"5' 7\" (1.7 m)","bio":"Roscoe Ates was born on January 20, 1895 in Grange, Mississippi, USA as Roscoe Blevel Ates. He was an actor, known for Freaks (1932), Cimarron (1931) and The Champ (1931). He was married to Beatrice Heisser, Barbara Ray and Clara Callahan. He died on March 1, 1962 in Hollywood, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMGZjODlhYmYtMjk2NC00MGM5LTllM2YtMzg5NGRjODc3YmE5XkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0040374","name":"Roscoe Ates","nicknames":["Uncle Pinky"],"idIMDB":"nm0040374"},"actorId":"nm0040374","character":"Jesse Rickey","urlCharacter":"http://www.imdb.com/character/ch0211044","main":true},{"actorName":"George E. Stone","urlProfile":"http://www.imdb.com/name/nm0831889","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA5NTQyMjg2Ml5BMl5BanBnXkFtZTcwMDQ5NzkxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1903","placeOfBirth":" Lódz, Poland, Russian Empire [now Lódz, Lódzkie, Poland]","birthName":"Gerschon Lichtenstein","height":"5' 3½\" (1.61 m)","bio":"A minor prototype of the \"Runyon-esque\" character for more than three decades, Polish-born actor George E. Stone (né George Stein) was in actuality a close friend of writer Damon Runyon and would play a host of colorful \"dees, dem and dos\" cronies throughout the 1920s, '30s, and '40s. With great names such as Johnnie the Shiek, Boots Burnett, Ice Box Hamilton, Wires Kagel, Ropes McGonigle, Society Max, and Toothpick Charlie, Stone delighted audiences in scores of crimers for decades. A vaudeville and Broadway hoofer in the interim, the runt-sized Stone (5' 3\") finally scored in his first \"grownup\" part as the Sewer Rat in the silent drama 7th Heaven (1927) starring the once-popular romantic pair Charles Farrell and (Academy Award winner) Janet Gaynor. As \"Georgie\" sounded too child-like, he began billing himself as \"George E. Stone.\" From there he was featured in a number of \"tough guy\" potboilers, particularly for Warner Bros. So typed was he as a henchman or thug, that he found few films outside the genre. His gunsels often possessed a yellow streak and could be both broadly comic or threatening in nature, with more than a few of them ending up on a morgue slab before film's end, including his Earl Williams on The Front Page (1931) and Otero in the classic gangster flick Little Caesar (1931). Stone's most popular role of the 1940s was as The Runt in the Boston Blackie film series which ran from 1941 to 1948 and starred Chester Morris. Suffering from failing eyesight in later years, he was virtually blind by the late 1950s but, thanks to friends, managed to secure sporadic film and TV work. From 1958 on, Stone could be glimpsed in a recurring role on the popular courtroom series Perry Mason (1957) as a court clerk. Married to second wife Marjorie Ramey in 1946, he died following a stroke in 1967 in Woodland Hills, California, and was survived by two sisters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA5NTQyMjg2Ml5BMl5BanBnXkFtZTcwMDQ5NzkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0831889","name":"George E. Stone","idIMDB":"nm0831889"},"actorId":"nm0831889","character":"Sol Levy","urlCharacter":"http://www.imdb.com/character/ch0211045","main":true},{"actorName":"Stanley Fields","urlProfile":"http://www.imdb.com/name/nm0276354","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjIxNjhlNzUtYjJlMS00NTRlLTljNGItOTM0OWEyODkzOGY3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 May 1883","placeOfBirth":" Allegheny, Pennsylvania, USA","birthName":"Walter L. Agnew","height":"6' 1\" (1.85 m)","bio":"Former boxer who worked in vaudeville, Fields found work as an American character actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjIxNjhlNzUtYjJlMS00NTRlLTljNGItOTM0OWEyODkzOGY3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0276354","name":"Stanley Fields","idIMDB":"nm0276354"},"actorId":"nm0276354","character":"Lon Yountis","urlCharacter":"http://www.imdb.com/character/ch0509900","main":true},{"actorName":"Robert McWade","urlProfile":"http://www.imdb.com/name/nm0574743","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY0NjdjOGEtMDcxMC00MTJmLWIzN2YtMWUwZjM1MWRmYTU5L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 January 1872","placeOfBirth":" Buffalo, New York, USA","birthName":"Robert McWade Jr.","bio":"Robert McWade was born on January 25, 1872 in Buffalo, New York, USA as Robert McWade Jr. He was an actor, known for Grand Hotel (1932), 42nd Street (1933) and I Am a Fugitive from a Chain Gang (1932). He died on January 19, 1938 in Culver City, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTY0NjdjOGEtMDcxMC00MTJmLWIzN2YtMWUwZjM1MWRmYTU5L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0574743","name":"Robert McWade","idIMDB":"nm0574743"},"actorId":"nm0574743","character":"Louis Hefner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Edna May Oliver","urlProfile":"http://www.imdb.com/name/nm0646829","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNTM0NTA0MV5BMl5BanBnXkFtZTgwMzYxNjQ3MTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 November 1883","placeOfBirth":" Malden, Massachusetts, USA","birthName":"Edna May Nutter","height":"5' 7\" (1.7 m)","bio":"She was born Edna May Nutter, a child of solid New England stock, on 9th November 1883 in Malden, Massachusetts. The daughter of Ida May and Charles Edward Nutter, Edna was a descendant of the 6th American president John Quincy Adams. Miss Oliver took an early interest in the stage, and she would quit school at the age of 14 to pursue her ambitions in the theater. Despite abandoning traditional schooling, Edna continued to study the performing arts, including speech and piano. One of her first jobs was as pianist with an all female orchestra which toured America around the turn of the century. By 1917 she had achieved success on Broadway in the hit play \"Oh, Boy\". By 1923 she had appeared in her first film. Edna May Oliver seems to have been born to play the classics of American and British literature. Some of her most memorable film roles were in adaptations of works of Charles Dickens. Although some have described her as plain or \"horse faced\", Edna May Oliver's comedic talents lent a beautiful droll warmth to her characters. She was usually called upon to play less glamorous roles such as a spinsters, but she played them with such soul, wit, and depth that to this day she remains one of the best loved of Hollywood's character actresses. A fine example of her comedic talent can be found in Laugh and Get Rich (1931). Here we find her playing a role almost autobiographical in nature, that of a proud woman with Boston roots who has married \"down\". As the plot unwinds, she is invited to a society gala despite her modest circumstances. At the gala she becomes tipsy. With a frolicsome air Edna May seems to use the role to gently mock her real self. Her slightly drunk character seizes upon a bit of flattery, and alluding to her old New England family, proudly proclaims to each who will listen, \"I am a Cranston. That explains everything!\". In real life, Edna May Oliver was a Nutter, and perhaps that explains everything. Edna May Oliver married stock broker David Pratt in 1928, but the marriage ended in divorce five years later. In 1939 she received an Oscar nomination for her supporting role as Widow McKlennar in the picture Drums Along the Mohawk (1939). That was to be one of her last films. Miss Oliver was struck ill in August of 1942. Although she seemed to recover briefly, she was re-admitted to Los Angeles's Cedars of Lebanon hospital in October Her dear friend actress Virginia Hammond flew out from New York to stay by her bedside. Edna May Oliver died on her 59th birthday, 9th November 1942. Virginia Hammond was with her and said, \"She died without ever being aware of the gravity of her condition. She just went peacefully asleep.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIyNTM0NTA0MV5BMl5BanBnXkFtZTgwMzYxNjQ3MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0646829","name":"Edna May Oliver","idIMDB":"nm0646829"},"actorId":"nm0646829","character":"Mrs. Tracy Wyatt","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Judith Barrett","urlProfile":"http://www.imdb.com/name/nm0057184","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2Q2OGUyMzEtNzZmMi00OTllLWJhZjctMzE4OWMzMWI5Mzk4L2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 February 1909","placeOfBirth":" Arlington, Texas, USA","birthName":"Lucille Kelley","bio":"Judith Barrett was born on February 2, 1909 in Arlington, Texas, USA as Lucille Kelley. She was an actress, known for Road to Singapore (1940), Cimarron (1931) and Yellowstone (1936). She was married to Lindsay C. Howard and Cliff Edwards. She died on March 10, 2000 in Palm Desert, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BN2Q2OGUyMzEtNzZmMi00OTllLWJhZjctMzE4OWMzMWI5Mzk4L2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0057184","name":"Judith Barrett","idIMDB":"nm0057184"},"actorId":"nm0057184","character":"Donna Cravat","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eugene Jackson","urlProfile":"http://www.imdb.com/name/nm0413511","urlPhoto":"","biography":{"dateOfBirth":"25 December 1916","placeOfBirth":" Buffalo, New York, USA","bio":"Eugene Jackson gained fame as Farina's older brother, Pineapple, in six of Hal Roach's \"Our Gang\" serials - \"The Mysterious Mystery\", \"The Big Town\", \"Circus Fever\", \"Dog Days\", \"The Love Bug\" and \"Shootin Injuns\". Besides films he sang and danced on the vaudeville circuit - billed as \"Hollywood's most famous colored kid star\". Most of his film roles were bit parts, most uncredited. He did appear as Diahann Carroll's Uncle Lou on TV's \"Julia\" and Redd Foxx's friend on \"Sanford and Son\". In later years he taught dance at studios he started in Compton and Pasadena. He trained several performers in the 1959 film Porgy and Bess. His work was featured in a dance retrospective for the 1993 Los Angeles Festival.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0413511","name":"Eugene Jackson","nicknames":["Pineapple"],"idIMDB":"nm0413511"},"actorId":"nm0413511","character":"Isaiah","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0021746","urlIMDB":"http://www.imdb.com/title/tt0021746","business":{"budget":{"money":"$1,433,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":[{"money":null,"country":null,"day":"27","month":"08","year":"1930","remarks":null},{"money":null,"country":null,"day":"22","month":"11","year":"1930","remarks":null}],"copyrightHolder":"RKO Radio Pictures, Inc.; 31 December 1930; LP1930 (in copyright registry)"},"technical":{"runtime":["2 hr 3 min (123 min)"],"soundMix":["Mono (RCA Photophone System)"],"color":["Black and White"],"aspectRatio":["1.20 : 1"],"camera":null,"laboratory":null,"filmLength":["3,408.25 m (13 reels)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.0","filmingLocations":[{"location":"Venice, Los Angeles, California, USA"}],"rated":"PASSED","awards":[{"award":"Academy Awards, USA 1931","titlesAwards":[{"titleAwardOutcome":"Won Oscar","categories":[{"category":"Best Picture","names":[]},{"category":"Best Writing, Adaptation","names":[{"name":"Howard Estabrook","id":"nm0261455","role":null}]},{"category":"Best Art Direction","names":[{"name":"Max Rée","id":"nm0753663","role":null}]}]},{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Actor in a Leading Role","names":[{"name":"Richard Dix","id":"nm0228715","role":null}]},{"category":"Best Actress in a Leading Role","names":[{"name":"Irene Dunne","id":"nm0002050","role":null}]},{"category":"Best Director","names":[{"name":"Wesley Ruggles","id":"nm0749484","role":null}]},{"category":"Best Cinematography","names":[{"name":"Edward Cronjager","id":"nm0005676","role":null}]}]}]},{"award":"National Board of Review, USA 1931","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Top Ten Films","names":[]}]}]},{"award":"Photoplay Awards 1932","titlesAwards":[{"titleAwardOutcome":"Won Medal of Honor","categories":[{"category":"","names":[{"name":"Louis Sarecky","id":"nm0765037","role":null}]}]}]}],"votes":"3,960","type":"Movie","companyCreditsSimple":[{"idCompany":"co0041421","name":"RKO Radio Pictures"}],"keywords":{"keywords":["oklahoma","newspaper","newspaper editor","frontier","land rush","one word title","dying in someone's arms","jew","saving a life","death of husband","pioneer","statue","death","drifter","abandoned by father","abandoned by husband","telephone call","telephone","friend","friendship","oil field","handshake","grandmother granddaughter relationship","grandmother grandson relationship","mother in law daughter in law relationship","girl","boy","giving a toast","reference to the ten commandments","reference to moses","reference to the declaration of independence","year 1930","u.s. citizenship","younger version of character","year 1929","osage tribe","politician","american indian","father daughter relationship","father son relationship","family relationships","mother daughter relationship","mother son relationship","politics","newspaper headline","year 1907","20th century","19th century","husband wife relationship","kiss","western town","street shootout","violence","gun battle","shootout","wild west","old west","orchestral music score","epic","anti semitism","1890s","marital separation","1880s","oil","gunfight","former slave","progressivism","religious tolerance","interracial relationship","interracial marriage","native american","racial prejudice","congresswoman","1920s","reformed prostitute","1900s","trial","interfaith service","kansas","death of father","based on novel","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:50:36"}}