{"data":{"movies":[{"title":"Point Blank","originalTitle":"","year":"1967","releaseDate":"19680405","directors":[{"name":"John Boorman","id":"nm0000958"}],"writers":[{"name":"Alexander Jacobs","id":"nm0414317"},{"name":"David Newhouse","id":"nm0627899"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg2OTk4NTUtNmFkNS00NmU2LWJkZGYtYzk0MzVjOTZlYTRmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Thriller"],"plot":"Mal Reese is in a real bind - owing a good deal of money to his organized crime bosses - and gets his friend Walker to join him in a heist. It goes off without a hitch but when Reese realizes the take isn't as large as he had hoped, he kills Walker - or so he thinks. Some time later, Walker decides the time has come get his share of the money and starts with his ex-wife Lynne who took up with Reese after the shooting. That leads him on a trail - to his wife's sister Chris, to Reese himself, then onto Big Stegmam, then Frederick Carter and on and up the line of gangsters all in an effort to get money from people who simply won't acknowledge that he's owed anything.","simplePlot":"After being double-crossed and left for dead, a mysterious man named Walker single-mindedly tries to retrieve the rather inconsequential sum of money that was stolen from him.","actors":[{"actorName":"Lee Marvin","urlProfile":"http://www.imdb.com/name/nm0001511","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NDQ2MTE2MF5BMl5BanBnXkFtZTYwMTE2MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 February 1924","placeOfBirth":" New York City, New York, USA","birthName":"Lamont Waltman Marvin Jr","height":"6' 1½\" (1.87 m)","bio":"Prematurely white-haired character star who began as a supporting player of generally vicious demeanor, then metamorphosed into a star of both action and drama projects, Lee Marvin was born in New York City, the son of Courtenay Washington (Davidge), a fashion writer, and Lamont Waltman Marvin, an advertising executive. The young Marvin was thrown out of dozens of schools for incorrigibility. His parents took him to Florida, where he attended St. Leo's Preparatory School near Dade City. Dismissed there as well, he enlisted in the U.S. Marine Corps at the beginning of World War II. In the battle of Saipan in June 1944, he was wounded in the buttocks by Japanese fire which severed his sciatic nerve. He received a medical discharge and got menial work as a plumber's apprentice in Woodstock, NY. While repairing a toilet at the local community theater, he was asked to replace an ailing actor in a rehearsal. He was immediately stricken with a love for the theater and went to New York City, where he studied and played small roles in stock and Off-Broadway. He landed an extra role in Henry Hathaway's You're in the Navy Now (1951), and found his role expanded when Hathaway took a liking to him. Returning to the stage, he made his Broadway debut in \"Billy Budd\", and after a succession of small TV roles, moved to Hollywood, where he began playing heavies and cops in roles of increasing size and frequency. Given a leading role in Eight Iron Men (1952), he followed it with enormously memorable heavies in The Big Heat (1953) and The Wild One (1953). Now established as a major screen villain, Marvin began shifting toward leading roles with a successful run as a police detective in the TV series M Squad (1957). A surprise Oscar for his dual role as a drunken gunfighter and his evil, noseless brother in the western comedy Cat Ballou (1965) placed him in the upper tiers of Hollywood leading men, and he filled out his career with predominantly action-oriented films. A long-term romantic relationship with Michelle Triola led, after their breakup, to a highly publicized lawsuit in which Triola asked for a substantial portion of Marvin's assets. Her case failed in its main pursuit, but did establish a legal precedent for the rights of unmarried cohabitors, the so-called \"palimony\" law. Marvin continued making films of varying quality, always as a star, until his sudden death from a heart attack in 1987.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0NDQ2MTE2MF5BMl5BanBnXkFtZTYwMTE2MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001511","name":"Lee Marvin","idIMDB":"nm0001511"},"actorId":"nm0001511","character":"Walker","urlCharacter":"http://www.imdb.com/character/ch0008759","main":true},{"actorName":"Angie Dickinson","urlProfile":"http://www.imdb.com/name/nm0001141","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3OTY5MzM5OV5BMl5BanBnXkFtZTcwODIxMDIzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1931","placeOfBirth":" Kulm, North Dakota, USA","birthName":"Angeline Brown","height":"5' 5\" (1.65 m)","bio":"Angie Dickinson was born in Kulm, North Dakota, the daughter of Fredericka (Hehr) and Leo Henry Brown, a newspaper editor and publisher of The Kulm Messenger. Her parents were both of German descent, with the family surname originally being \"Braun\"(which in German is pronounced as brown). The family left North Dakota in 1942, when Angie was 11 years old, moving to Burbank, California. In December 1946, when she was a senior at Bellamarine Jefferson High School in Burbank, she won the Sixth Annual Bill of Rights Contest. Two years later, her sister Janet did likewise. Being the daughter of a printer, Angie at first had visions of becoming a writer, but gave this up after winning her first beauty contest. After finishing college, she worked as a secretary in a Burbank airplane parts factory for 3-1/2 years. In 1953, she entered the local Miss America contest one day before the deadline and took second place. In August of the same year, she was one of five winners in a beauty contest sponsored by NBC and appeared in several television variety shows. She got her first bit part in a Warner Brothers film in 1954 and gained fame in the television series The Millionaire (1955) and got her first good film role opposite John Wayne and Dean Martin in Rio Bravo (1959). Her success then spiraled until she became one of the nation's top movie stars.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3OTY5MzM5OV5BMl5BanBnXkFtZTcwODIxMDIzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001141","name":"Angie Dickinson","idIMDB":"nm0001141"},"actorId":"nm0001141","character":"Chris","urlCharacter":"http://www.imdb.com/character/ch0008760","main":true},{"actorName":"Keenan Wynn","urlProfile":"http://www.imdb.com/name/nm0943978","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NjM3MTM3OV5BMl5BanBnXkFtZTYwODM2MjI2._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 July 1916","placeOfBirth":" New York City, New York, USA","birthName":"Francis Xavier Aloysius James Jeremiah Keenan Wynn","height":"5' 10\" (1.78 m)","bio":"Character actor Keenan Wynn was born into a famous show-business family. One in particular is his father, Ed Wynn. Keenan was the one to help to push his father to also become a well-known character actor. They appeared together in Son of Flubber (1963), The Absent Minded Professor (1961), The Great Man (1956), The Patsy (1964).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NjM3MTM3OV5BMl5BanBnXkFtZTYwODM2MjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0943978","name":"Keenan Wynn","idIMDB":"nm0943978"},"actorId":"nm0943978","character":"Yost","urlCharacter":"http://www.imdb.com/character/ch0232123","main":true},{"actorName":"Carroll O'Connor","urlProfile":"http://www.imdb.com/name/nm0005279","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MDQ5OTY2OV5BMl5BanBnXkFtZTYwNTkwNDI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 August 1924","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"John Carroll O'Connor","height":"5' 11\" (1.8 m)","bio":"Carroll was born in Manhattan and raised in Forest Hills, a heavily Jewish community in New York City's borough of Queens. After graduating from high school in 1942, O'Connor joined the Merchant Marines and worked on ships in the Atlantic. In 1946, he enrolled at the University of Montana to study English. While there, he became interested in theater. During one of the amateur productions, he met his future wife, Nancy Fields, whom he married in 1951. He moved to Ireland where he continued his theatrical studies at the National University of Ireland. He was discovered during one of his college productions and was signed to appear at the Dublin Gate Theater. He worked in theater in Europe until 1954 when he returned to New York. His attempts to land on Broadway failed and he taught high school until 1958. Finally in 1958, he landed an Off-Broadway production, \"Ulysses In Nighttown\". He followed that with a Broadway production that was directed by 'Burgess Meredith', \"God and Kate Murphy\", in which he was both an understudy and an assistant stage manager. At the same time, he was getting attention on TV. He worked in a great many character roles throughout the 1960s. A pilot for \"Those Were The Days\" was first shot in 1968 based on the English hit, \"Till Death Do Us Part\", but was rejected by the networks. In 1971, it was re-shot and re-cast as All in the Family (1971) and the rest is history.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2MDQ5OTY2OV5BMl5BanBnXkFtZTYwNTkwNDI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005279","name":"Carroll O'Connor","idIMDB":"nm0005279"},"actorId":"nm0005279","character":"Brewster","urlCharacter":"http://www.imdb.com/character/ch0008763","main":true},{"actorName":"Lloyd Bochner","urlProfile":"http://www.imdb.com/name/nm0001957","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwOTIyNzQxNl5BMl5BanBnXkFtZTgwNDMzNzM2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1924","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Lloyd Wolfe Bochner","height":"5' 10½\" (1.79 m)","bio":"Lloyd Bochner had that wonderfully sonorous type of voice that was always tailor-made for radio or for the stage. Unsurprisingly then, by the time he was eleven, Lloyd was already employed as part-time voiceover artist and reader of drama serials by radio stations in Vancouver. Lloyd Wolfe Bochner was born in Toronto, Ontario, Canada, to Frieda (Kenen) and Charles Abraham Bochner. He was of Russian Jewish and Ukrainian Jewish descent. He made his acting debut as a youth with the Joseph Barrington Juveniles. Lloyd's education at the University of Toronto was interrupted in 1943 by wartime service in the Royal Canadian Navy. However, in 1947, he graduated with a B.A. and a few years later moved to New York to further hone his acting skills. In 1953, he returned to Canada to participate in the inaugural season of the Stratford Festival getting to enact choice Shakespearean roles from Horatio in \"Hamlet\" to Orsino in \"Twelfth Night\". Having made his screen bow in a small Canadian production, The Mapleville Story (1946), Lloyd's first significant exposure in television was as British army officer Nicholas Lacey in the half-hour NBC serial One Man's Family (1949), which had first been performed on radio and starred Bert Lytell and Marjorie Gateson. His real breakthrough came quite a few years later, once having moved to Hollywood, as co-star of the studio-bound crime series Hong Kong (1960). He played local British police-chief Neil Campbell, solving crime in tandem with an American newspaper correspondent (played by Australian actor Rod Taylor). This, in turn, led to other key roles including his almost legendary appearance in the classic The Twilight Zone (1959) episode \"To Serve Man\" in 1962 (at one time voted 11th in a TV guide poll of 100 best TV episodes of all time). Based on a short story by Damon Knight written in 1950, \"To Serve Man\" unfolds in flashback as narrated for the viewer by Lloyd's decoding expert Michael Chambers. It has all the elements of great television, with an excellent cast (including Richard Kiel, later known as 'Jaws' from the 'James Bond' movies; and Theodore Marcuse as Citizen Grigori giving an indelible impression of Nikita Khrushchev); and an unexpected and disturbing denouement when it turns out that the supposedly altruistic alien Kanamits have come to earth to harvest humans for food. Lloyd repeated his famous punch-line, \"it's a cook book!\", years later as a spoof in Leslie Nielsen's The Naked Gun 2½: The Smell of Fear (1991). For most of the 1960s and 1970s, Lloyd was cast in supporting roles, often as mellifluous, meticulously-attired, upper-class snobs, practically guaranteed to harbour treacherous intent. He appeared in several motion pictures, notably as the malicious, smooth villain Frederick Carter, beating Lee Marvin to a pulp in Point Blank (1967), and in the same year, as homosexual drug dealer Vic Rood on the receiving end of the beating from Frank Sinatra in Tony Rome (1967). However, on the whole, Lloyd's preferred medium was television. He had a recurring role in the long-running soap-opera Dynasty (1981) as Blake Carrington's manipulative rival, Cecil Colby, in league with archvillain Alexis Carrington (Joan Collins). A versatile character actor, Lloyd's clean-cut, aquiline features and quiet air of authority lent themselves to portraying a vast gallery of medical men, soldiers, politicians and executives. Some of these were men of integrity, but like many a good actor, Lloyd rather enjoyed the challenge of playing the scoundrel. During his half century-long acting career, Lloyd Bochner garnered two Liberty Awards as best television actor, Canada's equivalent of the Emmy Awards. He was also an active member in the Association of Canadian Radio and Television Artists. He died at age 81 of cancer on October 29, 2005 in Santa Monica, California. His children are actors Hart Bochner, Paul Bochner, and Johanna Courtleigh.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwOTIyNzQxNl5BMl5BanBnXkFtZTgwNDMzNzM2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001957","name":"Lloyd Bochner","idIMDB":"nm0001957"},"actorId":"nm0001957","character":"Frederick Carter","urlCharacter":"http://www.imdb.com/character/ch0536404","main":true},{"actorName":"Michael Strong","urlProfile":"http://www.imdb.com/name/nm0835021","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNzY0MTI0MV5BMl5BanBnXkFtZTcwMTAxODkxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1918","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Cecil Natapoff","height":"5' 10½\" (1.79 m)","bio":"While never one of the big names on screen, Michael Strong was one of those excellent method actors who were often compelling to watch. Unsurprisingly, many of Michael's screen characters were typical New Yorkers, whether they be cops or thugs, and he imbued them with an edgy 'in-your-face' intensity that was all his own. He was already an established stage actor, both on and off-Broadway, with an extensive resume to his name long before transferring his talents to the screen. A graduate of the Actor's Studio, he was also part of the original crew of the Lincoln Center Repertory Company, performing in key plays by Arthur Miller, S.N. Behrman and Eugene O'Neill. Usually assigned to playing military types or proletarian firebrands, Michael eventually came to note as a young burglar in \"Detective Story\", written and staged on Broadway by Sidney Kingsley in 1949. Director William Wyler subsequently brought him to Hollywood to recreate his role for the 1951 motion picture. A couple of other good roles Michael later enacted for the big screen were his smarmy used-car salesman Stegman in the thriller Point Blank (1967) and Brigadier General Hobart Carver in the Oscar-winning war drama Patton (1970). For the most part, however, television became Michael's most prolific medium. His furtive looks and nervous demeanor often suggested that his characters had something to hide - and most of them did, particularly those Eastern bloc spy types with names like Malkov and Petrovich. He was at home in just about every major police series of the period, equally adept at NYPD sergeants and contract assassins. Fans of Star Trek (1966) will also remember Michael as the unhinged Dr. Roger Korby who had his consciousness transferred into an android body in the episode \"What Are Little Girls Made Of?\". As tough as some of his characters, Michael continued to act right up until the end.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNzY0MTI0MV5BMl5BanBnXkFtZTcwMTAxODkxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0835021","name":"Michael Strong","idIMDB":"nm0835021"},"actorId":"nm0835021","character":"Stegman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Vernon","urlProfile":"http://www.imdb.com/name/nm0006893","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNTM5MTQ1Ml5BMl5BanBnXkFtZTcwMzYwMzgyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1932","placeOfBirth":" Zehner, Saskatchewan, Canada","birthName":"Adolphus Raymondus Vernon Agopsowicz","height":"6' 2\" (1.88 m)","bio":"John Vernon was a prolific stage-trained Canadian character player who made a career out of convincingly playing crafty villains, morally-bankrupt officials and heartless authority figures in American films and television since the 1960s. Vernon has been directed by some stellar filmmakers including Alfred Hitchcock (Topaz (1969)); George Cukor (Justine (1969)); Don Siegel (Dirty Harry (1971)) and Clint Eastwood (The Outlaw Josey Wales (1976)). After training at London's Royal Academy of Dramatic Art and honing his skills in Canadian theatre and television, Vernon made his US film debut in John Boorman's noir/gangster classic Point Blank (1967) as a trusted friend who betrays Lee Marvin. He again failed to inspire confidence as the ineffectual mayor of San Francisco in Dirty Harry (1971). Vernon may be best remembered as the sinister Dean Vernon Wormer in John Landis' Animal House (1978), a role he reprised for the TV spin-off Delta House (1979). This led to more film comedy roles, a highlight being Mr. Big in the blaxploitation spoof I'm Gonna Git You Sucka (1988).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNTM5MTQ1Ml5BMl5BanBnXkFtZTcwMzYwMzgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0006893","name":"John Vernon","idIMDB":"nm0006893"},"actorId":"nm0006893","character":"Mal Reese","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sharon Acker","urlProfile":"http://www.imdb.com/name/nm0009943","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1Nzg5NTY3OV5BMl5BanBnXkFtZTgwMTQzMDI0MTI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 April 1935","placeOfBirth":" Toronto, Ontario, Canada","bio":"Although she was presented in 1969 the first Film Star of Tomorrow by The Motion Picture Exhibitors of Canada, the status of Sharon Acker as a star never materialized. Not that she was inactive, quite the opposite, but she worked almost only for TV and appeared only in a few undistinguished movie films. She will, nevertheless, remain remembered for her role as Lee Marvin's ex-wife in John Boorman's classic film noir Point Blank (1967). The victim of Marvin's rough manners, Acker/Lynne left a deep impact on male brains. Born in 1935, the Canadian-born actress started her film career in England when the play she was in, \"Lucky Jim\", Kingsley Amis' classic, was made into a movie. But, she was not seen in many a film, except during the sixties, either in Canada or in the U.S. On the contrary, she has been very active on TV, first in Canada from the age of 19, then in the U.S. in made-for-TV movies or series like Star Trek (1966), Mission: Impossible (1966), Gunsmoke (1955), Marcus Welby, M.D. (1969), Barnaby Jones (1973), etc. She was a regular in the series The Bold Ones: The Senator (1970) for one year and played \"Della Street\" in the short-lived The New Perry Mason (1973). A talented actress seen too little in movie theaters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1Nzg5NTY3OV5BMl5BanBnXkFtZTgwMTQzMDI0MTI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0009943","name":"Sharon Acker","idIMDB":"nm0009943"},"actorId":"nm0009943","character":"Lynne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Sikking","urlProfile":"http://www.imdb.com/name/nm0797725","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NTA3ODcwMV5BMl5BanBnXkFtZTYwODM5MDE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 March 1934","placeOfBirth":" Los Angeles, California, USA","birthName":"James Barrie Sikking","height":"5' 10\" (1.78 m)","bio":"James B. Sikking was born on March 5, 1934 in Los Angeles, California, the son of Unity ministers. He is probably best known for his yeoman work as hard-charging--and hardheaded--SWAT leader Lt. Howard Hunter on the classic police drama Hill Street Blues (1981). His full name--James Barrie Sikking--was given to him as J.M. Barrie (of \"Peter Pan\" fame) was his parents' favorite author at the time. Graduating from El Segundo High School, Sikking's interest in acting started after participating in various college plays while a student at the University of California-Santa Barbara, UCLA and the University of Hawaii. He made his professional stage debut with a production of \"Damn Yankees\" and broke into films with unbilled work in Five Guns West (1955) and The Revolt of Mamie Stover (1956). He finally started receiving billing in the 1960s, albeit bit parts in films and television, as minor villains or in-charge types with such roles as a professional assassin in Point Blank (1967), the head of vice squad in The New Centurions (1972) and a CIA agent in Scorpio (1973) coming his way. Sikking's first steady television job was playing Dr. James Hobart for three years on the daytime soap opera General Hospital (1963) during the 1970s. Moving into \"Grade A\" quality films in the early 1980s, he still stayed pretty much in the background with little chance to shine, such as his playing of Donald Sutherland's white-collar business comrade in the Oscar-winning Ordinary People (1980). It took his scene-stealing role as the gung-ho, often volatile and emotionally unpredictable Lt. Hunter on \"Hill Street Blues\", however, to alter the course of his career. Following the series' demise after six seasons, Sikking continued to move around in the top supporting ranks, finding steady work on television as Dr. David Howser, Neil Patrick Harris' father on Doogie Howser, M.D. (1989) and in important roles in such mini-movies as Doing Time on Maple Drive (1992). Continuing in such movies as Star Trek III: The Search for Spock (1984), Narrow Margin (1990) and The Pelican Brief (1993), typically playing various authoritarians, he had a rare movie co-lead in Final Approach (1991). Long married to wife Florine, whom he met while at UCLA, his son Andrew Sikking is also an actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3NTA3ODcwMV5BMl5BanBnXkFtZTYwODM5MDE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0797725","name":"James Sikking","idIMDB":"nm0797725"},"actorId":"nm0797725","character":"Hired Gun","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sandra Warner","urlProfile":"http://www.imdb.com/name/nm0912581","urlPhoto":"","biography":{"dateOfBirth":"14 March 1935","placeOfBirth":" Middletown, New York, USA","birthName":"Sandra Faye Warner","bio":"Sandra Warner was born on March 14, 1935 in Middletown, New York, USA as Sandra Faye Warner. She is an actress, known for Point Blank (1967), Fanfare for a Death Scene (1964) and Swingin' Along (1961).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0912581","name":"Sandra Warner","idIMDB":"nm0912581"},"actorId":"nm0912581","character":"Waitress","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Roberta Haynes","urlProfile":"http://www.imdb.com/name/nm0371536","urlPhoto":"","biography":{"dateOfBirth":"19 August 1929","placeOfBirth":" Wichita Falls, Texas, USA","birthName":"Roberta Arline Schack","height":"5' 3½\" (1.61 m)","bio":"Roberta Haynes was born on August 19, 1929 in Wichita Falls, Texas, USA as Roberta Arline Schack. She is known for her work on Point Blank (1967), Gun Fury (1953) and Return to Paradise (1953).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0371536","name":"Roberta Haynes","idIMDB":"nm0371536"},"actorId":"nm0371536","character":"Mrs. Carter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kathleen Freeman","urlProfile":"http://www.imdb.com/name/nm0293466","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NDM1NTQ1MV5BMl5BanBnXkFtZTcwNTEzMzkwOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1919","placeOfBirth":" Chicago, Illinois, USA","height":"5' 8\" (1.73 m)","bio":"Kathleen Freeman's introduction to show business came very early in life. Her parents were vaudevillians, and she made her debut at age 2 in their act. Later she attended UCLA with intentions of becoming a pianist, but was bitten by the acting bug and never looked back. She gained experience on stage in various stock and repertory companies, and made her film debut in 1948. One of the most memorable character actresses in recent memory, her stocky build, incredibly expressive face and hearty laugh have kept audiences convulsed for decades, playing a variety of neighborhood gossips, busybodies and eccentrics. Memorable as Sister Mary Stigmata (\"The Penguin\"), Dan Aykroyd's and John Belushi's nemesis, in The Blues Brothers (1980). She was used as a comic foil by Jerry Lewis in many of his films, always to great advantage. She did much television work, playing in everything from The Dick Van Dyke Show (1961) to Gomer Pyle: USMC (1964) to Hogan's Heroes (1965) to Married with Children (1987), where she was the voice of Peg's monstrous but never-seen mother, Al Bundy's nemesis. She was working on Broadway in a production of \"The Full Monty\" when she died of lung cancer in 2001.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NDM1NTQ1MV5BMl5BanBnXkFtZTcwNTEzMzkwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0293466","name":"Kathleen Freeman","idIMDB":"nm0293466"},"actorId":"nm0293466","character":"First Citizen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victor Creatore","urlProfile":"http://www.imdb.com/name/nm0187159","urlPhoto":"","biography":{"dateOfBirth":"5 June 1935","placeOfBirth":" Brooklyn, New York, USA","bio":"Victor Creatore was born on June 5, 1935 in Brooklyn, New York, USA. He was an actor, known for Point Blank (1967), The Purple Gang (1959) and The Thomas Crown Affair (1968). He died on September 1, 2005 in Alameda, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0187159","name":"Victor Creatore","idIMDB":"nm0187159"},"actorId":"nm0187159","character":"Carter's Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lawrence Hauben","urlProfile":"http://www.imdb.com/name/nm0369142","urlPhoto":"","biography":{"dateOfBirth":"3 March 1931","placeOfBirth":" New York, USA","birthName":"Lawrence Alan Hauben","bio":"Lawrence Hauben was born on March 3, 1931 in New York, USA as Lawrence Alan Hauben. He was an actor and writer, known for One Flew Over the Cuckoo's Nest (1975), Point Blank (1967) and The 48th Annual Academy Awards (1976). He died on December 22, 1985 in Santa Barbara, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0369142","name":"Lawrence Hauben","idIMDB":"nm0369142"},"actorId":"nm0369142","character":"Car Salesman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susan Holloway","urlProfile":"http://www.imdb.com/name/nm0391366","urlPhoto":"","biography":{"bio":"Susan Holloway is known for her work on Point Blank (1967), When the Boys Meet the Girls (1965) and Delta Fox (1979).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0391366","name":"Susan Holloway","idIMDB":"nm0391366"},"actorId":"nm0391366","character":"Girl Customer","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0062138","urlIMDB":"http://www.imdb.com/title/tt0062138","business":{"budget":{"money":"$3,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":"© MCMLXVII BY METRO-GOLDWYN-MAYER INC. ALL RIGHTS IN THIS MOTION PICTURE RESERVED UNDER INTERNATIONAL CONVENTIONS. (on print)"},"technical":{"runtime":["1 hr 32 min (92 min)"],"soundMix":["Mono"],"color":["Color (Metrocolor)"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":["Metrocolor, Culver City (CA), USA"],"filmLength":null,"negativeFormat":["35 mm (Eastman 50T 5251)"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"7.4","filmingLocations":[{"location":"Fort Point, Presidio, Golden Gate National Recreation Area, San Francisco, California, USA"}],"rated":"APPROVED","awards":[{"award":"National Film Preservation Board, USA 2016","titlesAwards":[{"titleAwardOutcome":"Won National Film Registry","categories":[{"category":"National Film Preservation Board","names":[]}]}]}],"votes":"14,369","type":"Movie","companyCreditsSimple":[{"idCompany":"co0016037","name":"Metro-Goldwyn-Mayer (MGM)"},{"idCompany":"co0049390","name":"Winkler Films"}],"keywords":{"keywords":["nude pantyhose","camera shot of feet","female stockinged foot","high heels","pantyhose","money","gangster","violence","criminal","revenge","deal","organized crime","alcatraz","cult film","opening action scene","hand to hand combat","fistfight","los angeles river viaduct","tourist telescope","woman screaming","go go dancer","woman in a bikini","backhoe","deliberately crashing a car","convertible","corvette","white cat","sikorsky s 300 helicopter","female rear nudity","male rear nudity","shot to death","shot in the chest","blood splatter","blood","disguise","fugitive","on the run","flashback","bar","home invasion","machine gun","assault rifle","held at gunpoint","pistol","assassination attempt","swimming pool","mansion","presumed dead","brawl","fight","martial arts","fight in the restroom","gunfight","shootout","mob boss","mafia boss","impersonating a police officer","crime boss","insomniac","nightclub","car dealership","jazz club","interrogation","torture","car accident","accountant","hitman","one man army","tough guy","action hero","ferry","helicopter","revolver","shotgun","rifle","sniper rifle","sniper","deception","los angeles storm drain","thief","remade","death","murder","mafia accountant","mafia","drop zone","man hits a woman","economic hit man","tax accountant","killer accountant","making amends","hit on the head","sexual fantasy","set up","murder of wife's lover","murder of wife","dead wife","serial killer","united states","walking","dead man","naked dead body","pack of money","los angeles spillway","sharpshooter","sister in law","nonlinear timeline","falling from a tower","falling from height","falling to death","penthouse apartment","security breach","penthouse","security guard","trojan horse","criminal organization","betrayal by friend","purposeful car accident","used car lot","car dealer","car wreck","los angeles california","1960s","alienation","dead woman on bed","left to die","husband wife relationship","double cross","hit in the crotch","warrior","anti hero","pulp fiction","vengeance","betrayal","san francisco california","neo noir","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 07:48:41"}}