{"data":{"movies":[{"title":"A Bridge Too Far","originalTitle":"","year":"1977","releaseDate":"19770615","directors":[{"name":"Richard Attenborough","id":"nm0000277"}],"writers":[{"name":"Cornelius Ryan","id":"nm0752485"},{"name":"William Goldman","id":"nm0001279"}],"runtime":"175 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczNjg0MzQyM15BMl5BanBnXkFtZTcwMjY0NjAzNA@@._V1.jpg","countries":["USA","UK"],"languages":["English","German","Dutch","Polish","Latin"],"genres":["Drama","History","War"],"plot":"The true story of Operation Market Garden, the Allies attempt, in September 1944, to hasten the end of WW2 by driving through Belgium and Holland into Germany. The idea was for US airborne divisions to take the towns of Eindhoven and Nijmegen and a British airborne division, reinforced by a Polish airborne brigade, to take the town of Arnhem. They would be reinforced, in due course and in turn, by the British XXX Corps, land-based and driving up from the British lines in the south. The key to the operation was the bridges, as if the Germans held or blew them, the paratroopers could not be relieved. Faulty intelligence, Allied high command hubris and stubborn German resistance would ensure that Arnhem was a bridge too far.","simplePlot":"Operation Market Garden, September 1944: The Allies attempt to capture several strategically important bridges in the Netherlands in the hope of breaking the German lines. However, mismanagement and poor planning result in its failure.","actors":[{"actorName":"Siem Vroom","urlProfile":"http://www.imdb.com/name/nm0904151","urlPhoto":"","biography":{"dateOfBirth":"22 April 1931","placeOfBirth":" Beemster, Noord-Holland, Netherlands","birthName":"Simon Vroom","bio":"Siem Vroom was born on April 22, 1931 in Beemster, Noord-Holland, Netherlands as Simon Vroom. He was an actor, known for A Bridge Too Far (1977), The Lift (1983) and Burning Love (1983). He died on June 6, 1985 in Amsterdam, Noord-Holland.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0904151","name":"Siem Vroom","idIMDB":"nm0904151"},"actorId":"nm0904151","character":"Underground Leader","urlCharacter":"http://www.imdb.com/character/ch0219004","main":true},{"actorName":"Marlies van Alcmaer","urlProfile":"http://www.imdb.com/name/nm0017236","urlPhoto":"","biography":{"dateOfBirth":"30 January 1938","placeOfBirth":" Alkmaar, Noord-Holland, Netherlands","birthName":"Margaretha Elisabeth Wilhelmina Smal","bio":"Marlies van Alcmaer was born on January 30, 1938 in Alkmaar, Noord-Holland, Netherlands as Margaretha Elisabeth Wilhelmina Smal. She is an actress, known for A Bridge Too Far (1977), Westenwind (1999) and Q & Q (1974).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0017236","name":"Marlies van Alcmaer","idIMDB":"nm0017236"},"actorId":"nm0017236","character":"Underground Leader's Wife","urlCharacter":"http://www.imdb.com/character/ch0219004","main":true},{"actorName":"Erik van 't Wout","urlProfile":"http://www.imdb.com/name/nm0885546","urlPhoto":"","biography":{"dateOfBirth":"27 February 1961","placeOfBirth":" Haarlem, Noord-Holland, Netherlands","bio":"Erik van 't Wout was born on February 27, 1961 in Haarlem, Noord-Holland, Netherlands. He is a director and actor, known for A Bridge Too Far (1977), Verborgen gebreken (2009) and Q & Q (1974).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0885546","name":"Erik van 't Wout","idIMDB":"nm0885546"},"actorId":"nm0885546","character":"Underground Leader's Son","urlCharacter":"http://www.imdb.com/character/ch0219004","main":true},{"actorName":"Wolfgang Preiss","urlProfile":"http://www.imdb.com/name/nm0007234","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMTIyNzU1MV5BMl5BanBnXkFtZTcwMTgxNTUxOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1910","placeOfBirth":" Nuremberg, Bavaria, Germany","bio":"Born in Nuremberg on February 27, 1910, the son of a school teacher, well-known German actor Wolfgang Preiss started studying philsophy and theatre sciences alternately (including dance training) and made his stage debut in 1932 in Munich. He appeared in many theatres throughout his country in the 30s including Heidelberg, Bonn, Bremen, Stuttgart, Baden-Baden and Berlin. In early 40s films, WWII interrupted his output for a time, but, in a many, the war never left him, for he would continue playing war-time colonels, generals, and field marshals for the duration of his career. Following more theatre and radio work, he concentrated again on films in the 50s and could hardly be seen out of uniform for the many prototype Nazi officers he ably portrayed. He branched out internationally and kept his uniform starched and pressed for many more prestigious international productions including The Longest Day (1962), The Cardinal (1963), The Train (1964) Von Ryan's Express (1965), and Anzio (1968) as the nemesis of such American \"heroes\" as Burt Lancaster, Robert Mitchum, William Holden, Richard Burton, Peter Falk and Frank Sinatra. He played Rommel in Raid on Rommel (1971) and Field Marshal Von Rundstedt in Richard Attenborough's A Bridge Too Far (1977). He would appear in over 100 German and international productions in his lifetime. His film infamy was only heightened after playing the archvillain Dr. Mabuse in a series of German crimers, the first being Fritz Lang's The Thousand Eyes of Dr. Mabuse (1960). In his twilight years he turned more and more to TV, his last appearance being in 1997. He was part of the ensemble cast of \"The Winds of War\" and \"War and Remembrance\" in the 80s Married three times, Preiss died at the age of 92 as the result of a fall.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMTIyNzU1MV5BMl5BanBnXkFtZTcwMTgxNTUxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007234","name":"Wolfgang Preiss","idIMDB":"nm0007234"},"actorId":"nm0007234","character":"Field Marshal Gerd Von Rundstedt","urlCharacter":"http://www.imdb.com/character/ch0015596","main":true},{"actorName":"Hans von Borsody","urlProfile":"http://www.imdb.com/name/nm0902026","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTEwZmNkM2QtNmNiYy00NWUxLWI2OTAtZWE1MDc1Y2Y5MWFhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 September 1929","placeOfBirth":" Vienna, Austria","birthName":"Hans Eduard Herbert von Borsody","height":"5' 11¾\" (1.82 m)","bio":"Hans von Borsody was born on September 20, 1929 in Vienna, Austria as Hans Eduard Herbert von Borsody. He was an actor, known for A Bridge Too Far (1977), Cliff Dexter (1966) and Bergwind (1963). He was married to Karin Dittmann, Rosemarie Fendel, Alwy Becker and Heide Keller. He died on November 4, 2013 in Kiel, Schleswig-Holstein, Germany.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTEwZmNkM2QtNmNiYy00NWUxLWI2OTAtZWE1MDc1Y2Y5MWFhXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0902026","name":"Hans von Borsody","idIMDB":"nm0902026"},"actorId":"nm0902026","character":"General Günther Blumentritt","urlCharacter":"http://www.imdb.com/character/ch0117425","main":true},{"actorName":"Josephine Peeper","urlProfile":"http://www.imdb.com/name/nm0670263","urlPhoto":"","biography":{"bio":"Josephine Peeper is an actress, known for A Bridge Too Far (1977) and Honneponnetje (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0670263","name":"Josephine Peeper","idIMDB":"nm0670263"},"actorId":"nm0670263","character":"Cafe Waitress","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dirk Bogarde","urlProfile":"http://www.imdb.com/name/nm0001958","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNDY0NjAwMl5BMl5BanBnXkFtZTYwMTUxNjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 March 1921","placeOfBirth":" Hampstead, London, England, UK","birthName":"Derek Jules Gaspard Ulric Niven van den Bogaerde","height":"5' 8½\" (1.74 m)","bio":"Sir Dirk Bogarde, distinguished film actor and writer, was born Derek Jules Gaspard Ulric Niven van den Bogaerde on March 28, 1921, to Ulric van den Bogaerde, the art editor of \"The Times\" (London) newspaper, and actress Margaret Niven in the London suburb of Hampstead. He was one of three children, with sister Elizabeth and younger brother Gareth. His father was Flemish and his mother was of Scottish descent. Ulric Bogaerde started the Times' arts department and served as its first art editor. Derek's mother, Margaret - the daughter of actor and painter Forrest Niven - appeared in the play \"Bunty Pulls The Strings\", but she quit the boards in accordance with her husband's wishes. The young Derek Bogaerde was raised at the family home in Sussex by his sister, Elizabeth, and his nanny, Lally. Educated at the Allen Glen's School in Glasgow, he also attended London's University College School before majoring in commercial art at Chelsea Polytechnic, where his teachers included Henry Moore. Though his father wanted his eldest son to follow him into the \"Times\" as an art critic and had groomed him for that role, Derek dropped out of his commercial art course and became a drama student, though his acting talent at that time was unpromising. In the 1930s he went to work as a commercial artist and a scene designer. He apprenticed as an actor with the Amersham Repertory Company, and made his acting debut in 1939 on a small London stage, the Q Theatre, in a role in which he delivered only one line. His debut in London's West End came a few months later in J.B. Priestley's play \"Cornelius,\" in which he was billed as \"Derek Bogaerde\". He made his uncredited debut as an extra in the pre-war George Formby comedy Come on George! (1939). The September 1939 invasion of Poland by Nazi Germany and the Soviet Union triggered World War II, and in 1940 Bogarde joined the Queen's Royal Regiment as an officer. He served in the Air Photographic Intelligence Unit and eventually attained the rank of major. Nicknamed \"Pippin\" and \"Pip\" during the war, he was awarded seven medals in his five years of active duty. He wrote poems and painted during the war, and in 1943, a small magazine published one of his poems, \"Steel Cathedrals,\" which subsequently was anthologized. His paintings of the war are part of the Imperial War Museum's collection. Similar to his character, Captain Hargreaves, in King & Country (1964), he was called upon to put a wounded soldier out of his misery, a tale recounted in one of his seven volumes of autobiography. While serving with the Air Photographic Intelligence Unit, he took part in the liberation of the Bergen-Belsen concentration camp, which he said was akin to \"looking into Dante's Inferno\". In one of his autobiographies, he wrote, \"At 24, the age I was then, deep shock stays registered forever. An internal tattooing which is removable only by surgery, it cannot be conveniently sponged away by time.\" After being demobilized, he returned to acting. His agent re-christened him \"Dirk Bogarde,\" a name that he would make famous within a decade. In 1947 he appeared in \"Power Without Glory\" at the New Lindsay Theatre, a performance that was praised by Noël Coward, who urged him to continue his acting career. The Rank Organization had signed him to a contract after a talent scout saw him in the play, and he made his credited movie debut in Dancing with Crime (1947) with a one-line bit as a policeman. His first lead in a movie came that year when Wessex Films, distributed by Rank, gave him a part in the proposed Stewart Granger film Sin of Esther Waters (1948). When Granger dropped out, Bogarde took over the lead. Rank subsequently signed him to a long-term contract and he appeared in a variety of parts during the 14 years he was under contract to the studio. For three years he toiled in Rank movies as an apprentice actor without making much of a ripple; then in 1950, he was given the role of young hood Tom Riley in the crime thriller The Blue Lamp (1950) (the title comes from the blue-colored light on police call-boxes in London), the most successful British film of 1950, which established Bogarde as an actor of note. Playing a cop killer, an unspeakable crime in the England of the time, it was the first of the intense neurotics and attractive villains that Bogarde would often play. He continued to act on-stage, appearing in the West End in Jean Anouilh's \"Point of Departure\". While he was praised for his performance, stage acting made him nervous, and as he became more famous, he began to be mobbed by fans. The pressure of the public adulation proved overwhelming, particularly as he suffered from stage fright. He was accosted by crowds of fans at the stage door during the 1955 touring production of \"Summertime,\" and his more enthusiastic admirers even shouted at him during the play. He was to appear in only one more play, the Oxford Playhouse production of \"Jezebel,\" in 1958. He never again took to the boards, despite receiving attractive offers. He first acted for American expatriate director Joseph Losey in The Sleeping Tiger (1954). Losey, a Communist and self-described Stalinist at the time, had emigrated to England after being blacklisted in Hollywood after he refused to direct The Woman on Pier 13 (1949) at RKO Pictures, which was owned by right-wing multi-millionaire Howard Hughes at the time, and he was accused in testimony before the House Un-American Activities Committee of being a Communist. The director, like Bogarde, would not find his stride until the early 1960s, and Losey and Bogarde would build their reputations together. First, however, Losey had to overcome Bogarde's reluctance to star in a low-budget film (shot for $300,000) with a blacklisted American director. Losey, who had never heard of Bogarde until he was proposed for the film, met with him and asked Bogarde to view one of his pictures. After seeing the film, Bogarde was enthusiastic, and Losey talked him into taking the role, which he accepted at a reduced fee (Losey originally was not credited with directing the film due to his being blacklisted in the States). A decade later they would make more memorable films that would be watersheds in their careers. It was not drama but comedy that made Dirk Bogarde a star. He achieved the first rank of English movie stardom playing Dr. Simon Sparrow in the comedy Doctor in the House (1954). The film was a smash hit, becoming one of the most popular British films in history, with 17 million admissions in its first year of release. As Sparrow, Bogarde became a heartthrob and the most popular British movie star of the mid-50s. He reprised the character in Doctor at Sea (1955), Doctor at Large (1957). The title of the latter film may have described his mood as a serious actor having to do another turn as Dr. Sparrow between his career-making performances in Losey's The Servant (1963), with a script by Harold Pinter, and Losey's adaptation of the stage play King & Country (1964), in which Bogarde memorably played the attorney for a young deserter (played by Tom Courtenay). Bogarde, hailed as \"the idol of the Odeons\" in honor of his box-office clout, was offered the role of Jimmy Porter in _Look Back in Anger (1958/I)_ by producer Harry Saltzman and director Tony Richardson, based on the play that touched off the \"Angry Young Man\" and \"Kitchen Sink School\" of contemporary English drama in the 1950s. Though Bogarde wanted to take the part, Rank refused to let him make the film on the grounds that there was \"altogether too much dialog.\" The part went to Richard Burton instead, who went over-the-top in portraying his very angry, not-so-young man. After this disappointment, Bogarde went to Hollywood to play Franz Liszt in Song Without End (1960) and to appear in Nunnally Johnson's Spanish Civil War drama L'ange pourpre (1960) with Ava Gardner. Both were big-budgeted films, but hampered by poor scripts, and after both films failed, Bogarde avoided Hollywood from then on. He was reportedly quite smitten with his French \"Song Without End\" co-star Capucine, and wanted to marry her. Capucine, who suffered from bi-polar disorder, was bisexual with an admitted preference for women. The relationship did not lead to marriage, but did result in a long-term friendship. It apparently was his only serious relationship with a woman, though he had many women friends, including his I Could Go on Singing (1963) co-star Judy Garland. In the early 1960s, with the expiration of his Rank contract, Bogarde made the decision to abandon his hugely successful career in commercial movies and concentrate on more complex, art house films (at the same time, Burt Lancaster made a similar decision, though Lancaster continued to alternate his artistic ventures with more crassly commercial endeavors). Bogarde appeared in Basil Dearden's seminal film Victim (1961), the first British movie to sympathetically address the persecution of homosexuals. His career choice alienated many of his old fans, but he was no longer interested in being a commercial movie star; he, like Lancaster, was interested in developing as an actor and artist (however, that sense of finding himself as an actor did not extend to the stage. His reputation was such in 1963 that he was invited by National Theatre director Laurence Olivier to appear as Hamlet to open the newly built Chichester Festival Theatre. That production of the eponymous play also was intended to open the National Theatre's first season in London. Bogarde declined, and the honor went instead to Peter O'Toole, who floundered in the part.) Jack Grimston, in Bogarde's \"Sunday Times\" obituary of May 9, 1999, entitled \"Bogarde, a solitary star at the edge of the spotlight,\" said of the late actor that he \"belonged to a group that was rare in the British cinema. He was a fine screen player who owed little to the stage. Dilys Powell, the Sunday Times film critic, wrote of him before her own death: 'Most of our gifted film players really belonged to the theater. Bogarde belonged to the screen.'\" Bogarde had won the London Critics Circle's Dilys Powell award for outstanding contribution to cinema in 1992. Appearing in \"Victim\" was a huge career gamble. In the film, Bogarde played a married barrister who is being blackmailed over his closeted homosexuality. Rather than let the blackmail continue, and allow the perpetrators to victimize other gay men, Bogarde's character effectively sacrifices himself, specifically his marriage and his career, by bravely confessing to be gay (homosexuality was an offence in the United Kingdom until 1967, and there reportedly had been a police crackdown against homosexuals after World War II which made gay men particularly vulnerable to blackmail). The film was not released in mainstream theaters in the US, as the Production Code Administration (PCA) refused to classify the film and most theaters would not show films that did not carry the PCA seal of approval. \"Victim\" was the antithesis of the light comedy of Bogarde's \"Doctor\" movies, and many fans of his character Simon Sparrow were forever alienated by his portrayal of a homosexual. For himself, Bogarde was proud of the film and his participation in it, which many think stimulated public debate over homosexuality. The film undoubtedly raised the public consciousness over the egregious and unjust individual costs of anti-gay bigotry. The public attitude towards the \"love that dared not speak its name\" changed enough so that within six years, the 1967 Sexual Offences Act decriminalizing homosexual acts between adults passed Parliament. Bogarde reported that he received many letters praising him for playing the role. His courage in taking on such a role is even more significant in that he most likely was gay himself, and thus exposed himself to a backlash. Bogarde always publicly denied he was a homosexual, though later in life he did confess that he and his manager, Anthony Forwood, had a long-term relationship. When Bogarde met him in 1939, Forwood was a theatrical manager, who eventually married and divorced Glynis Johns. Forwood became Bogarde's friend and subsequently his life partner, and the two moved to France together in 1968. They bought a 15th-century farmhouse near Grasse in Provence in the early 1970s, which they restored. Bogarde and Forwood lived in the house until 1983, when they returned to London so that Forwood could be treated for cancer, from which he eventually died in 1988. Bogarde nursed him in the last few months of his life. After Forwood died, Bogarde was left rudderless and he became more reclusive, eventually retiring from films after Daddy Nostalgia (1990). Mark Rowe and Jeremy Kay, in their obituary of Bogarde, \"Two brilliant lives - on film and in print,\" published in \"The Independent\" on May, 9, 1999, wrote, \"Although he documented with frankness his early sexual encounters with girls and later his adoring love for Kay Kendall and Judy Garland, he never wrote about his longest and closest relationship - with his friend and manager for more than 50 years, Tony Forwood. Sir Dirk said the clues to his private life were in his books. 'If you've got your wits about you, you will know who I am'.\" The British documentary _\"Arena\" [The Private Dirk Bogarde] (2001)_ made with the permission of his family, stressed the fact that he and Forwood were committed lifelong partners. In the same issue, the National Film Theatre's David Thompson, in the article \"The public understood he was essentially gay,\" wrote about Bogarde at his high-water mark in the 1950s, that \"Audiences of that time loved him . . . Very few people picked up on the fact that there was a distinct gay undertone. It says something about British audiences of the time. He had the good fortune to break out of that prison, and it came through the film Victim (1961), where he played a gay character, and through meeting with Joseph Losey, who directed him in The Servant (1963). For the first time, Bogarde's ambivalence was exploited and used by film.\" Bogarde's sexuality is not the issue; what was striking was that it was an act of personal courage for one of Britian's leading box-office attractions to appear in such a provocative and controversial film. Even in the 21st century, many mainstream actors are afraid to play a gay character lest they engender a public backlash against themselves, which is much less likely than it was more than 40 years ago when Bogarde made \"Victim.\" Apart from sociology, \"Victim\" marks the milestone in which critics and audiences could discern the metamorphosis of Bogarde into the mature actor who went on to become one of the cinema's finest performers. Most of Bogarde's best and most serious roles come after \"Victim,\" the film in which he first stretched himself and broke out of the mold of \"movie star.\" He received the first of his six nominations as Best Actor from the British Academy of Film & Television Arts (BAFTA) for the film. Bogarde co-starred with John Mills in The Singer Not the Song (1961), and with Alec Guinness in Damn the Defiant! (1962) (a.k.a. \"Damn the Defiant!\"). In 1963 he reunited with Losey to film the first of two Losey films with screenplays by Pinter. Bogarde's participation in the two Losey/Pinter collaborations, The Servant (1963) and Accident (1967), in addition to 1964's \"King & Country\", solidified his reputation. Critics and savvy moviegoers appreciated the fact that Bogarde had developed into a first-rate actor. For his role as the eponymous servant, Bogarde won BAFTA's Best Actor Award. He had now \"officially\" arrived in the inner circle of the best British film actors. These three films also elevated Losey into the ranks of major directors (Bogarde also starred in Losey's 1966 spy spoof Modesty Blaise (1966), but that film did little to enhance either man's reputation. He turned down the opportunity to appear in Losey's L'assassinat de Trotsky (1972) due to the poor quality of the script). Philip French, in his obituary \"Dark, exotic and yet essentially English\", published in \"The Observer\" on May 9, 1999, said of Bogarde, \"Losey discovered something more complex and sinister in his English persona and his performance as Barrett, the malevolent valet in 'The Servant,' scripted by Harold Pinter, is possibly the most subtle, revealing thing he ever did - by confronting his homosexuality in a non-gay context.\" Losey told interviewer Michel Ciment that his work with Bogarde represented a turning point in the actor's career, when he developed into an actor of depth and power. He also frankly admitted to Ciment that without Bogarde, his career would have stagnated and never reached the heights of success and critical acclaim that it did in the 1960s. Interestingly during the filming of \"The Servant.\" Losey was hospitalized with pneumonia. He asked Bogarde to direct the film in order to keep shooting so that the producers would not cancel the film. A reluctant Bogarde complied with Losey's wishes and directed for ten days. He later said that he would never direct again. Bogarde co-starred with up-and-coming actress Julie Christie in John Schlesinger's Darling (1965), for which Christie won a Best Actress Oscar and was vaulted into 1960s cinema superstardom. During the filming of the movie, both Bogarde and Christie were waiting to hear whether they would be cast as Yuri Zhivago and his lover Lara in David Lean's upcoming blockbuster Doctor Zhivago (1965). Christie got the call, Bogarde didn't, but he was well along in the process of establishing himself as one of the screen's best and most important actors. He won his second BAFTA Best Actor Award for his performance in \"Darling.\" Bogarde went on to major starring roles in such important pictures as The Fixer (1968), for which 'Alan Bates (I)' won a Best Actor Academy Award nomination. While Bogarde never was nominated for an Oscar, he had the honor of starring in two films for Luchino Visconti, The Damned (1969) (\"The Damned\") and Death in Venice (1971), based on Thomas Mann's novella \"Death in Venice.\" Bogarde felt that his performance as Gustav von Aschenbach, the dying composer in love with a young boy and with the concept of beauty, in \"Death in Venice\" was the \"the peak and end of my career . . . I can never hope to give a better performance in a better film.\" Visconti told Bogarde that when the lights went up in a Los Angeles screening room after a showing of \"Death in Venice\" for American studio executives, no one said anything. The silence encouraged Visconti, who believed it meant that the executives were undergoing a catharsis after watching his masterpiece. However, he soon realized that, in Bogarde's own words, \"Apparently they were stunned into horrified silence . . . A group of slumped nylon-suited men stared dully at the blank screen.\" One nervous executive, feeling something should be said, got up and asked, \"Signore Visconti, who was responsible for the score of the film?\" \"Gustav Mahler,\" Visconti replied. \"Just great!\", said the nervous man. \"I think we should sign him.\" After \"Venice\", Bogarde made only seven films over the next two decades and was scathing about the quality of the scripts he was offered. To express himself artistically, he began to write. In his third volumes of autobiography, he wrote, \"No longer do the great Jewish dynasties hold power: the people who were, when all is said and done, the Picture People. Now the cinema is controlled by vast firms like Xerox, Gulf & Western, and many others who deal in anything from sanitary-ware to property development. These huge conglomerates, faceless, soulless, are concerned only with making a profit; never a work of art . . . \" He rued the fact that \"it is pointless to be 'superb' in a commercial failure; and most of the films which I had deliberately chosen to make in the last few years were, by and large, just that. Or so I am always informed by the businessmen. The critics may have liked them extravagantly, but the distributors shy away from what they term 'A Critic's Film', for it often means that the public will stay away. Which, in the mass, they do: and if you don't make money at the box-office you are not asked back to play again.\" However, the courageous artist was not to be daunted: \"But I'd had very good innings. Better than most. So what the hell?\" His well-written works were enthusiastically received by critics and the book-buying public. Bogarde appeared in another film that flirted with the theme of German fascism, Liliana Cavani's highly controversial The Night Porter (1974) (\"The Night Porter\"). He played an ex-SS officer who encounters a woman with whom he had been engaged in a sado-masochistic affair at a World War II Nazi extermination camp. Many critics found the film, which featured extensive nudity courtesy of Charlotte Rampling, crassly offensive, but no one faulted Bogarde's performance. He played Lt. Gen. Frederick \"Boy\" Browning in the all-star blockbuster A Bridge Too Far (1977). Although some of his fellow actors were World War II veterans, only Bogarde had been involved in the actual battle. His performance arguably is the best in the film. Appearing in Alain Resnais' art house hit Providence (1977) gave Bogarde the opportunity to co-star with John Gielgud. He also starred in German wunderkind Rainer Werner Fassbinder's adaptation of Vladimir Nabokov's Despair (1978), with a script by Tom Stoppard. Though the film was not much of a critical success, Bogarde's acting as 1930s German businessman Hermann Hermann, a man who chooses to go mad when faced with the paradoxes of his life in his proto-fascist fatherland, was highly praised. Bogarde enjoyed working with Fassbinder. He wrote that \"Rainer's work was extraordinarily similar to that of Visconti's; despite their age difference, they both behaved, on set, in much the same manner. Both had an incredible knowledge of the camera: the first essential. Both knew how it could be made to function; they had the same feeling for movement on the screen, of the all-important (and often-neglected) 'pacing' of a film, from start to finish, of composition, of texture, and probably most of all they shared that strange ability to explore and probe into the very depths of the character which one had offered them.\" After his experience with Fassbinder, he acted only four more times, twice in feature films and twice on television. Bogarde was nominated for a Golden Globe for playing Roald Dahl in The Patricia Neal Story (1981). He got rave reviews playing Jane Birkin's father in Bertrand Tavernier's Daddy Nostalgia (1990), his last film. In 1984 Bogarde was asked to serve as president of the jury at the Cannes Film Festival, a huge honor for the actor, as he was the first Briton ever to serve in that capacity. Two years earlier he had been made a Chevalier de l'Ordre des lettres 1982. A decade later, he was knighted by Queen Elizabeth II on February 13, 1992. Bogarde won two Best Actor Awards out of six nominations from the British Academy of Film & Television Arts, for \"The Servant\" and \"Darling\" in 1964 and 1966, respectively. He was also nominated in 1962 for \"Victim,\" in 1968 for \"Accident\" and Our Mother's House (1967) and in 1972 for \"Morte a Venezia.\" Bogarde suffered a stroke in 1996, and though it rendered him partially paralyzed, he was able to recover and live in his own flat in Chelsea. However, by May of 1998 he required around-the-clock nursing care, and he had his lawyers draw up a \"living will,\" also known as a no-resuscitation order. Bogarde publicly came out in favor of voluntary euthanasia, becoming Vice President of the Voluntary Euthanasia Society. He publicly addressed the subject of his own \"living will,\" which ordered that no extraordinary measures be taken to keep him alive should he become terminally ill. The living will proved unnecessary. Dirk Bogarde died of a heart attack on May 8, 1999, in his home in Chelsea, London, England. According to his nephew Brock Van den Bogaerde, the family planned to hold a private funeral but no memorial service in accordance with his uncle's wish \"just to forget me.\" Bogarde wanted to be cremated and have his ashes scattered in France, and accordingly, his remains were returned to Provence. Margaret Hinxman, in her May 10, 1999, obituary in \"The Guardian\", said of him, \"At his peak and with directors he trusted - Joseph Losey, Luchino Visconti and Alain Resnais - Dirk Bogarde . . . was probably the finest, most complete, actor on the screen.\" Clive Fisher's obituary in \"The Independent\" on May 10, 1999, praised Bogarde as \"a major figure because, wherever they were made, his finest films are all somehow about him. He was a great self-portraitist and the screen persona he fashioned, a stylization of his private being, not only dominated its surroundings but spoke subliminally and powerfully to British audiences about the tensions of the time, about connivances and cruel respectabilities of England in the Fifties and Sixties.\" The secret of Dirk Bogarde's success as a great cinema actor was his intimate relationship with the camera. Bogarde believed that the key to acting on film was the eyes, specifically, the \"look\" of the actor. Like Alan Ladd, it didn't matter if an actor was good with line readings if they had mastery over the \"look.\" For many critics and movie-goers at the end of the 20th century, Dirk Bogarde's face epitomized the \"look\" of Britain in the tumultuous decades after the Second World War. David Tindle's portrait of Bogarde is part of the collection of London's National Portrait Gallery, London. In 1999, the portrait, on temporary loan, was displayed at 10 Downing Street, the Prime Minister's official residence, with other modern works of art. Officially, Dirk Bogarde had become the look of Britain.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNDY0NjAwMl5BMl5BanBnXkFtZTYwMTUxNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001958","name":"Dirk Bogarde","nicknames":["The Idol of the Odeon","Pip/Pippin","The British Rock Hudson"],"idIMDB":"nm0001958"},"actorId":"nm0001958","character":"Lieutenant General Frederick Browning","urlCharacter":"http://www.imdb.com/character/ch0219023","main":true},{"actorName":"Paul Maxwell","urlProfile":"http://www.imdb.com/name/nm0561792","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzBlZGI5YTgtMGJlOS00YmNlLTlhZWYtMWRjMGFhZTQyNzYxL2ltYWdlXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 November 1921","placeOfBirth":" Winnipeg, Manitoba, Canada","height":"6' (1.83 m)","bio":"Paul Maxwell was born on November 12, 1921 in Winnipeg, Manitoba, Canada. He was an actor, known for Indiana Jones and the Last Crusade (1989), Aliens (1986) and A Bridge Too Far (1977). He was married to Mary Lindsay. He died on December 19, 1991 in London, England.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzBlZGI5YTgtMGJlOS00YmNlLTlhZWYtMWRjMGFhZTQyNzYxL2ltYWdlXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0561792","name":"Paul Maxwell","idIMDB":"nm0561792"},"actorId":"nm0561792","character":"Major General Maxwell Taylor","urlCharacter":"http://www.imdb.com/character/ch0177918","main":true},{"actorName":"Sean Connery","urlProfile":"http://www.imdb.com/name/nm0000125","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcwNTM4MzctYjQzMi00NTA2LTljYWItNTYzNmE1MTYxN2RlXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 August 1930","placeOfBirth":" Edinburgh, Scotland, UK","birthName":"Thomas Sean Connery","height":"6' 2\" (1.88 m)","bio":"Sean Connery is best known for portraying the character James Bond, starring in seven Bond films between 1962 and 1983. In 1988, Connery won the Academy Award for Best Supporting Actor for his role in The Untouchables (1987). His film career also includes such films as Marnie (1964), The Name of the Rose (1986), The League of Extraordinary Gentlemen (2003), Indiana Jones and the Last Crusade (1989), The Hunt for Red October (1990), Highlander (1986), Murder on the Orient Express (1974), DragonHeart (1996) and The Rock (1996). Connery has been polled as \"The Greatest Living Scot\" and \"Scotland's Greatest Living National Treasure\". In 1989, he was proclaimed \"Sexiest Man Alive\" by People magazine, and in 1999, at age 69, he was voted \"Sexiest Man of the Century\". Thomas Sean Connery was born on August 25, 1930 in Fountainbridge, Edinburgh, Scotland. His mother, Euphemia McBain (née McLean), was a cleaning lady, and his father, Joseph Connery, was a factory worker and truck driver. He has a brother, Neil Connery, who works as a plasterer in Edinburgh. He is of Irish and Scottish descent. Before going into acting, Sean had many different jobs, such as a milkman, lorry driver, a laborer, artist's model for the Edinburgh College of Art, coffin polisher and bodybuilder. He also joined the Royal Navy, but was later discharged because of medical problems. At the age of 23, he had a choice between becoming a professional footballer or an actor, and even though he showed much promise in the sport, he chose acting and said it was one of his more intelligent moves. No Road Back (1957) was Sean's first major movie role, and it followed by several Tv-movies such as Anna Christie (1957), Macbeth (1961) and Anna Karenina (1961) and guest appearances on TV-series, and also films such as Hell Drivers (1957), Another Time, Another Place (1958), Darby O'Gill and the Little People (1959), The Frightened City (1961). In 1962 he appeared in The Longest Day (1962) with a host of other stars. Connery's breakthrough came in the role of secret agent James Bond. He was reluctant to commit to a film series, but understood that if the films succeeded his career would greatly benefit. He played the character in the first five Bond films: Dr. No (1962), From Russia with Love (1963), Goldfinger (1964), Thunderball (1965), and You Only Live Twice (1967) - then appeared again as Bond in Diamonds Are Forever (1971) and Never Say Never Again (1983). All seven films were commercially successful. James Bond, as portrayed by Connery, was selected as the third-greatest hero in cinema history by the American Film Institute. Connery's selection for the role of James Bond owed a lot to Dana Broccoli, wife of producer \"Cubby\" Broccoli, who is reputed to have been instrumental in persuading her husband that Connery was the right man. James Bond's creator, Ian Fleming, originally doubted Connery's casting, saying, \"He's not what I envisioned of James Bond looks\", and \"I'm looking for Commander Bond and not an overgrown stunt-man,\" adding that Connery (muscular, 6' 2\", and a Scot) was unrefined. Fleming's girlfriend told him that Connery had the requisite sexual charisma, and Fleming changed his mind after the successful Dr. No (1962) premiere. He was so impressed, he created a half-Scottish, half-Swiss heritage for Bond in the later novels. Connery's portrayal of Bond owes much to stylistic tutelage from director Terence Young, polishing the actor while using his physical grace and presence for the action. Lois Maxwell, who played Miss Moneypenny, related that, \"Terence took Sean under his wing. He took him to dinner, showed him how to walk, how to talk, even how to eat.\" The tutoring was successful; Connery received thousands of fan letters a week, and the actor became one of the great male sex symbols of film. During the filming of Thunderball (1965), Connery's life was in danger in the sequence with the sharks in Emilio Largo's pool. He had been concerned about this threat when he read the script. Connery insisted that Ken Adam build a special Plexiglas partition inside the pool, but, despite this, it was not a fixed structure and one of the sharks managed to pass through it. He had to abandon the pool immediately. Connery was forced to wear a toupee during each of the Bond movies because he had started balding at the age of 17. This didn't prevent Connery from being cast in roles, although it became more noticeable in his later years. In 2005, From Russia with Love was adapted by Electronic Arts into a video game, titled From Russia with Love (2005), which featured all-new voice work by Connery as well as his likeness, and those of several of the film's supporting cast. After and during the success of the Bond-films he has maintained a successful career as an actor and has appeared in films, including Alfred Hitchcock's Marnie (1964), The Hill (1965), Murder on the Orient Express (1974), The Man Who Would Be King (1975), The Wind and the Lion (1975), Time Bandits (1981), Highlander (1986), The Name of the Rose (1986), The Untouchables (1987) (which earned him an Oscar for best actor in a supporting role), Indiana Jones and the Last Crusade (1989), The Hunt for Red October (1990), Rising Sun (1993), The Rock (1996), Finding Forrester (2000), and The League of Extraordinary Gentlemen (2003). Sean married actress Diane Cilento in 1962 and they had a son, Jason Connery, born on January 11, 1963, he followed in his father's footsteps and also became an actor. The marriage ended in divorce in 1973. In 1975 he married Micheline Roquebrune and they have stayed married, they have no children together. He is also a grandfather. His son, Jason and his ex-wife, actress Mia Sara had a son, Dashiell Quinn Connery, in 1997.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcwNTM4MzctYjQzMi00NTA2LTljYWItNTYzNmE1MTYxN2RlXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000125","name":"Sean Connery","nicknames":["Big Tam"],"idIMDB":"nm0000125"},"actorId":"nm0000125","character":"Major General Urquhart","urlCharacter":"http://www.imdb.com/character/ch0219017","main":true},{"actorName":"Ryan O'Neal","urlProfile":"http://www.imdb.com/name/nm0641939","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUxOTMwMTI1N15BMl5BanBnXkFtZTcwOTUxMDkwMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1941","placeOfBirth":" Los Angeles, California, USA","birthName":"Charles Samuel Eldridge Patrick Ryan O'Neal III","height":"6' 1\" (1.85 m)","bio":"Ryan O'Neal was born on April 20, 1941 in Los Angeles, California, USA as Charles Samuel Eldridge Patrick Ryan O'Neal III. He is an actor, known for Peyton Place (1964), Barry Lyndon (1975) and Paper Moon (1973). He was previously married to Leigh Taylor-Young and Joanna Moore.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUxOTMwMTI1N15BMl5BanBnXkFtZTcwOTUxMDkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641939","name":"Ryan O'Neal","idIMDB":"nm0641939"},"actorId":"nm0641939","character":"Brigadier General James M. Gavin","urlCharacter":"http://www.imdb.com/character/ch0219014","main":true},{"actorName":"Gene Hackman","urlProfile":"http://www.imdb.com/name/nm0000432","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5Njk0NDQ4OV5BMl5BanBnXkFtZTYwNjA0Mzc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 January 1930","placeOfBirth":" San Bernardino, California, USA","birthName":"Eugene Allen Hackman","height":"6' 1\" (1.85 m)","bio":"Eugene Allen Hackman was born in San Bernardino, California, the son of Anna Lyda Elizabeth (Gray) and Eugene Ezra Hackman, who operated a newspaper printing press. He is of Pennsylvania Dutch (German), English, and Scottish ancestry, partly by way of Canada, where his mother was born. After several moves, his family settled in Danville, Illinois. Gene grew up in a broken home, which he left at the age of sixteen for a hitch with the US Marines. Moving to New York after being discharged, he worked in a number of menial jobs before studying journalism and television production on the G.I. Bill at the University of Illinois. Hackman would be over 30 years old when he finally decided to take his chance at acting by enrolling at the Pasadena Playhouse in California. Legend says that Hackman and friend Dustin Hoffman were voted \"least likely to succeed.\" Hackman next moved back to New York, where he worked in summer stock and off-Broadway. In 1964 he was cast as the young suitor in the Broadway play \"Any Wednesday.\" This role would lead to him being cast in the small role of Norman in Lilith (1964), starring Warren Beatty. When Beatty was casting for Bonnie and Clyde (1967), he cast Hackman as Buck Barrow, Clyde Barrow's brother. That role earned Hackman a nomination for the Academy Award for Best Supporting Actor, an award for which he would again be nominated in I Never Sang for My Father (1970). In 1972 he won the Oscar for his role as Detective Jimmy \"Popeye\" Doyle in The French Connection (1971). At 40 years old Hackman was a Hollywood star whose work would rise to new heights with Night Moves (1975) and Bite the Bullet (1975), or fall to new depths with The Poseidon Adventure (1972) and Eureka (1983). Hackman is a versatile actor who can play comedy (the blind man in Young Frankenstein (1974)) or villainy (the evil Lex Luthor in Superman (1978)). He is the doctor who puts his work above people in Extreme Measures (1996) and the captain on the edge of nuclear destruction in Crimson Tide (1995). After initially turning down the role of Little Bill Daggett in Clint Eastwood's Unforgiven (1992), Hackman finally accepted it, as its different slant on the western interested him. For his performance he won the Oscar and Golden Globe and decided that he wasn't tired of westerns after all. He has since appeared in Geronimo: An American Legend (1993), Wyatt Earp (1994), and Mort ou vif (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5Njk0NDQ4OV5BMl5BanBnXkFtZTYwNjA0Mzc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000432","name":"Gene Hackman","idIMDB":"nm0000432"},"actorId":"nm0000432","character":"Major General Stanislaw Sosabowski","urlCharacter":"http://www.imdb.com/character/ch0016335","main":true},{"actorName":"Walter Kohut","urlProfile":"http://www.imdb.com/name/nm0463491","urlPhoto":"","biography":{"dateOfBirth":"20 November 1927","placeOfBirth":" Vienna, Austria","bio":"Walter Kohut was born on November 20, 1927 in Vienna, Austria. He was an actor, known for A Bridge Too Far (1977), Kassbach - Ein Portrait (1979) and La délégation (1970). He was married to Immy Schell. He died on May 18, 1980 in Innsbruck, Austria.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0463491","name":"Walter Kohut","idIMDB":"nm0463491"},"actorId":"nm0463491","character":"Field Marshal Walther Model","urlCharacter":"http://www.imdb.com/character/ch0219026","main":true},{"actorName":"Peter Faber","urlProfile":"http://www.imdb.com/name/nm0264512","urlPhoto":"","biography":{"dateOfBirth":"9 October 1943","placeOfBirth":" Schwarzenbach, Germany","bio":"Peter Faber was born on October 9, 1943 in Schwarzenbach, Germany. He is an actor and composer, known for A Bridge Too Far (1977), Prettig geregeld (1988) and Darlings! (1984).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0264512","name":"Peter Faber","idIMDB":"nm0264512"},"actorId":"nm0264512","character":"Captain 'Harry' Bestebreurtje","urlCharacter":"http://www.imdb.com/character/ch0219029","main":true},{"actorName":"Hartmut Becker","urlProfile":"http://www.imdb.com/name/nm0065427","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MzE3MzA0NF5BMl5BanBnXkFtZTcwMjEyNTgyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 May 1938","placeOfBirth":" Berlin, Germany","height":"6' 2\" (1.88 m)","bio":"Hartmut Becker is a German popular stage and film star. He has worked in the theatre since 1962, during which time he has starred in dozens of plays and has been featured in many international and national film and television productions. His film debut he made in 1970 with the main role Clark in Michael Verhoeven's feature film \"o.k\". The film was the official German contribution at the Film Festival Berlin 1970 and it's hot political expressiveness was the sensation of Berlin and killed the festival. Hartmut's performing in this film earned several prices and a great praise in the German feature articles. After \"o.k.\" Hartmut Becker was one of Germany's busiest actors in film and theatre (at the State Theatres of Munich and Berlin he performed leading characters in plays from Shakespeare to Tennessee Williams). More important main parts in films followed like in Verhoeven's \"Who lives in the Glass House\" (Film Festival Berlin 1971), \"Als Mutter streikte\", \"John Ralling\" (tv), \"Mitgift\", \"Audienz\" (tv), \"Sonntagskinder\". His first leading part in an English language production he performed in the BBC-film \"Forgive Our Foolish Ways\", where he played the role of an German prisoner of war next to Kate Nelligan. The television film became a very big success all over the world. Hartmut's following international film was the American-English production \"Jenny's War\" (Columbia Pictures) where he portrayed the main part of Karl Koenig, a character in the crucial test between love and war. His partners in this film were Dyan Cannon, Elke Sommer and Trevor Howard. In 1987 he was a suppoting actor in the American production \"Escape From Sobibor\" (director: Jack Gold). In his next Festival-Film \"Il Decimo Clandestino\" (Festival International du Film Cannes 1989) Hartmut Becker worked together with admirable director Lina Wertmueller. His female partner in this feature film was Dominique Sanda. Several dream parts followed after the success of \"Il Decimo Clandestine\" (Portraits with Women) for example the characters Niels Jost in \"A Silent Conspiracy\" (also starring Joss Ackland), Rauscher in the American Film \"Triumph of the Spirit\" (with Willem Dafoe, Robert Loggia), Lutz in the English-French Television Film \"Free Frenchmen\" (also starring Derek de Lint, Agnes Soral), Moritz in the English-Austrian feature film \"Gave Princip\" by Peter Patzak, King Christian in \"Young Catherine\" (American TV with a.o. Julia Ormond, Venessa Redgrave, Marthe Keller,Maximilian Schell), Rusty in the Italian tv-movie \"Requiem Per Voce e Pianoforte\" and last not least Dieter Krause in the English TV-thriller \"The Waiting Time\" (ITV 1999). His last leading in a German feature film was the part of Goran in \"The Unforgotten\" produced in 2005. In the Germany cinema \"Verfehlung\" (The Transgression) of 2015 he performed the part Kardinal Schoeller. From 2007 to 2012 Hartmut Becker was member in the committee of the German Academy of Film (Deutsche Filmakademie). He's living in Berlin (Germany).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MzE3MzA0NF5BMl5BanBnXkFtZTcwMjEyNTgyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0065427","name":"Hartmut Becker","idIMDB":"nm0065427"},"actorId":"nm0065427","character":"German Sentry","urlCharacter":"http://www.imdb.com/character/ch0219032","main":true},{"actorName":"Frank Grimes","urlProfile":"http://www.imdb.com/name/nm0342200","urlPhoto":"","biography":{"dateOfBirth":"1947","placeOfBirth":" Dublin, Ireland","bio":"Frank Grimes was born in 1947 in Dublin, Ireland. He is an actor and producer, known for A Bridge Too Far (1977), Coronation Street (1960) and Crystalstone (1987).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0342200","name":"Frank Grimes","idIMDB":"nm0342200"},"actorId":"nm0342200","character":"Major Fuller","urlCharacter":"http://www.imdb.com/character/ch0219006","main":true}],"seasons":[],"idIMDB":"tt0075784","urlIMDB":"http://www.imdb.com/title/tt0075784","business":{"budget":{"money":"$26,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1976/\">1976</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 55 min (175 min)","2 hr 38 min (158 min) (Finland)"],"soundMix":["Stereo (35 mm prints)","70 mm 6-Track (70 mm prints)"],"color":["Black and White (archive footage)","Color (colour) (Technicolor)"],"aspectRatio":["2.20 : 1 (70 mm prints)","2.35 : 1"],"camera":["Panavision Cameras and Lenses (uncredited)"],"laboratory":["Technicolor (as Colour by Technicolor®)"],"filmLength":["4,835 m (Sweden)","4,330 m (Finland)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic) (as Panavision®)"],"printedFilmFormat":["35 mm","70 mm (blow-up)"]},"rating":"7.4","filmingLocations":[{"location":"Bemmel, Lingewaard, Gelderland, Netherlands"}],"rated":"PG","awards":[{"award":"BAFTA Awards 1978","titlesAwards":[{"titleAwardOutcome":"Won Anthony Asquith Award for Film Music","categories":[{"category":"","names":[{"name":"John Addison","id":"nm0011709","role":null}]}]},{"titleAwardOutcome":"Won BAFTA Film Award","categories":[{"category":"Best Cinematography","names":[{"name":"Geoffrey Unsworth","id":"nm0005910","role":null}]},{"category":"Best Sound Track","names":[{"name":"Peter Horrocks","id":"nm0395364","role":null},{"name":"Gerry Humphreys","id":"nm0006836","role":null},{"name":"Simon Kaye","id":"nm0443393","role":null},{"name":"Robin O'Donoghue","id":"nm0640877","role":null},{"name":"Les Wiggins","id":"nm0927796","role":null}]},{"category":"Best Supporting Actor","names":[{"name":"Edward Fox","id":"nm0002081","role":null}]}]},{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best Direction","names":[{"name":"Richard Attenborough","id":"nm0000277","role":null}]},{"category":"Best Editing","names":[{"name":"Antony Gibbs","id":"nm0316626","role":null}]},{"category":"Best Film","names":[]},{"category":"Best Production Design/Art Direction","names":[{"name":"Terence Marsh","id":"nm0550671","role":null}]}]}]},{"award":"British Society of Cinematographers 1977","titlesAwards":[{"titleAwardOutcome":"Won Best Cinematography Award","categories":[{"category":"","names":[{"name":"Geoffrey Unsworth","id":"nm0005910","role":null}]}]}]},{"award":"Evening Standard British Film Awards 1978","titlesAwards":[{"titleAwardOutcome":"Won Evening Standard British Film Award","categories":[{"category":"Best Film","names":[{"name":"Richard Attenborough","id":"nm0000277","role":null}]}]}]},{"award":"National Society of Film Critics Awards, USA 1977","titlesAwards":[{"titleAwardOutcome":"Won NSFC Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Edward Fox","id":"nm0002081","role":null}]}]}]}],"votes":"41,975","type":"Movie","companyCreditsSimple":[{"idCompany":"co0060073","name":"Joseph E. Levine Productions"}],"keywords":{"keywords":["allies","operation market garden","paratrooper","panzer","rubber boat","supply drop","arnhem netherlands","airborne troops","pole abroad","briton abroad","american abroad","german abroad","street shootout","surrounded","outnumbered","behind enemy lines","war violence","nazi occupied netherlands","firearm","year 1944","british military","ss officer","dead soldier","combat casualty","plan gone wrong","tank on fire","burning tank","parachuting","armor","ss","river","river crossing","nazi uniform","beret","polish soldier","british soldier","british army","american soldier","arnhem holland","killed in action","bridge","american actor playing foreigner","nazi soldier","cease fire","child in a combat zone","flare","praying","firing on paratrooper","war crime","child soldier","plunger detonator","white flag","nijmegen bridge","plane crash","attacked from behind","grave bridge","bailey bridge","mark vi tiger tank","son bridge","rescue","death threat","driving off road","m4 carbine","pillbox","bridge explosion","surrender","close air support","m 8 greyhound","tank column","horn","m 4 sherman tank","willys jeep","church service","airspeed horsa glider","101st airborne","reconaissance photograph","spy","douglas dc 3","82nd airborne","retreating army","m16 half track","reference to bernard montgomery","reference to dwight d. eisenhower","reference to george s. patton","reference to adolf hitler","archival footage","voice over narration","starts with narration","98k","epic","epic battle","ensemble cast","mexican standoff","attack","mixed martial arts","martial arts","bloody face","held at gunpoint","destruction","semiautomatic pistol","pistol","colt .45","steel helmet","ensemble","raft","bombardment","murder","gun violence","50 calibre machine gun","combat","sniper rifle","sniper","browning automatic rifle","tommy gun","m1 rifle","blood","violence","bolt action rifle","standoff","last stand","ambush","battle","tough guy","war hero","hero","helmet","cannon","exploding truck","exploding tank","rowing","infantry","uniform","u.s. army","smoke","dutch","sergeant","tank","parachute","map","liberation","jeep","explosion","church","bicycle","army","airplane","blockbuster","major","major general","lieutenant","lieutenant general","lieutenant colonel","1940s","nazi","skydiving","dead child","world war two","based on novel","independent film","title spoken by character","netherlands","walking in the rain","burying a dead body","bare chested male","elst netherlands","dripping blood","electric train","kubelwagen","motorcycle with sidecar","msn carrying a wounded man","parachutist point of view","blood splatter","beating","cult film","bayonet","reference to george washington","german soldier","organ","flute","defeat"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:52:01"}}