{"data":{"movies":[{"title":"Carlito's Way","originalTitle":"","year":"1993","releaseDate":"19931112","directors":[{"name":"Brian De Palma","id":"nm0000361"}],"writers":[{"name":"Edwin Torres","id":"nm0868620"},{"name":"David Koepp","id":"nm0462895"}],"runtime":"144 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZmQ1ZDc0MDAtNjVmYi00MDkxLWE5MDItZmJmNjcxZGEyMWRjXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Crime","Drama","Thriller"],"plot":"A Puerto Rican ex-con pledges to stay away from his former drug dealing ways but finds himself being dragged back by his past connections and the naive machinations of his lawyer and best friend. Hoping to raise enough money to get away from New York, Carlito Brigante takes on the job of running a nightclub, renews an affair with a dancer but old associates and old instincts suck him back into a world of violence and mistrust.","simplePlot":"A Puerto Rican former convict, just released from prison, pledges to stay away from drugs and violence despite the pressure around him and lead on to a better life outside of N.Y.C.","actors":[{"actorName":"Al Pacino","urlProfile":"http://www.imdb.com/name/nm0000199","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzg1ODAyNl5BMl5BanBnXkFtZTYwMjAxODQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1940","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Alfredo James Pacino","height":"5' 7\" (1.7 m)","bio":"One of the greatest actors in all of film history, Al Pacino established himself during one of film's greatest decades, the 1970s, and has become an enduring and iconic figure in the world of American movies. Alfredo James Pacino was born on April 25, 1940, in the Bronx, New York, to an Italian-American family. His parents, Rose (Gerardi) and Sal Pacino, divorced when he was young. His mother moved them into his grandparents' house. Pacino found himself often repeating the plots and voices of characters he had seen in the movies, one of his favorite activities. Bored and unmotivated in school, the young Al Pacino found a haven in school plays, and his interest soon blossomed into a full-time career. Starting on the stage, he went through a lengthy period of depression and poverty, sometimes having to borrow bus fare to make it to auditions. He made it into the prestigious Actors Studio in 1966, studying under legendary acting coach Lee Strasberg, creator of the Method Approach that would become the trademark of many 1970s-era actors. After appearing in a string of plays in supporting roles, Pacino finally succeeded with \"The Indian Wants the Bronx\", winning an Obie Award for the 1966-67 season. That was followed by a Tony Award for \"Does the Tiger Wear a Necktie?\". His first feature films made little departure from the gritty realistic stage performances that earned him respect: he played a drug addict in The Panic in Needle Park (1971) after his film debut in Me, Natalie (1969). What came next would change his life forever. The role of Michael Corleone in The Godfather (1972) was one of the most sought-after of the time: Robert Redford, Warren Beatty, Jack Nicholson, Ryan O'Neal, Robert De Niro and a host of others either wanted it or were mentioned for it, but director Francis Ford Coppola had his heart set on the unknown Italian Pacino for the role, although pretty much everyone else--from the studio to the producers to some of the cast members--did not want him. Though Coppola won out through slick persuasion, Pacino was in constant fear of being fired during the hellish shoot. Much to his (and Coppola's) relief, the film was a monster hit that did wonders for everyone's career, including Pacino's, and earned him his first Academy Award nomination for Best Supporting Actor. However, instead of taking on easier projects for the big money he could now command, Pacino threw his support behind what he considered tough but important films, such as the true-life crime drama Serpico (1973) and the tragic real-life bank robbery film Dog Day Afternoon (1975). He opened eyes around the film world for his brave choice of roles, and he was nominated three consecutive years for the \"Best Actor\" Academy Award. He faltered slightly with Bobby Deerfield (1977), but regained his stride with ...and justice for all. (1979), for which he received another Academy Award nomination for Best Actor. Unfortunately, this would signal the beginning of a decline in his career, which produced such critical and commercial flops as Cruising - La Chasse (1980) and Author! Author! (1982). Pacino took on another vicious gangster role and cemented his legendary status in the ultra-violent cult film Scarface (1983), but a monumental mistake was about to follow. Revolution (1985) endured an endless and seemingly cursed shoot in which equipment was destroyed, weather was terrible, and Pacino became terribly ill with pneumonia. Constant changes in the script also further derailed a project that seemed doomed from the start anyway. The Revolutionary War film is considered one of the worst films ever, not to mention one of the worst of his career, resulted in his first truly awful reviews and kept him off the screen for the next four years. Returning to the stage, Pacino has done much to give back and contribute to the theatre, which he considers his first love. He directed a film, The Local Stigmatic (1990), but it remains unreleased. He lifted his self-imposed exile with the striking Sea of Love (1989) as a hard-drinking policeman. This marked the second phase of Pacino's career, being the first to feature his now famous dark, owl eyes and hoarse, gravelly voice. Returning to the Corleones, Pacino made The Godfather: Part III (1990) and earned raves for his first comedic role in the colorful Dick Tracy (1990). This earned him another Academy Award nomination for Best Supporting Actor, and two years later he was nominated for Glengarry Glen Ross (1992). He went into romantic mode for Frankie and Johnny (1991). In 1992, he finally won the Academy Award for Best Actor for his amazing performance in Scent of a Woman (1992). A mixture of technical perfection (he plays a blind man) and charisma, the role was tailor-made for him, and remains a classic. The next few years would see Pacino becoming more comfortable with acting and movies as a business, turning out great roles in great films with more frequency and less of the demanding personal involvement of his wilder days. Carlito's Way (1993) proved another gangster classic, as did the epic crime drama Heat (1995) directed by Michael Mann and co-starring Robert De Niro, although they only had a few scenes together. He returned to the director's chair for the highly acclaimed and quirky Shakespeare adaptation Looking for Richard (1996). City Hall (1996), Donnie Brasco (1997) and The Devil's Advocate (1997) all came out in this period. Reteaming with Mann and then Oliver Stone, he gave two commanding performances in The Insider (1999) and Any Given Sunday (1999). In the 2000s, Pacino starred in a number of theatrical blockbusters, including Ocean's Thirteen (2007), but his choice in television roles (the vicious Roy Cohn in the HBO miniseries Angels in America (2003) and his sensitive portrayal of Jack Kevorkian, in the television movie You Don't Know Jack (2010)) are reminiscent of the bolder choices of his early career. Each television project garnered him an Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie. In his personal life, Pacino is one of Hollywood's most enduring and notorious bachelors, having never been married. He has a daughter, Julie Marie, with acting teacher Jan Tarrant, and a new set of twins with longtime girlfriend Beverly D'Angelo. His romantic history includes a long-time romance with \"Godfather\" co-star Diane Keaton. With his intense and gritty performances, Pacino was an original in the acting profession. His Method approach would become the process of many actors throughout time, and his unbeatable number of classic roles has already made him a legend among film buffs and all aspiring actors and directors. His commitment to acting as a profession and his constant screen dominance has established him as one of the movies' true legends. Pacino has never abandoned his love for the theater, and Shakespeare in particular, having directed the Shakespeare adaptation Looking for Richard (1996) and played Shylock in The Merchant of Venice (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMzg1ODAyNl5BMl5BanBnXkFtZTYwMjAxODQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000199","name":"Al Pacino","nicknames":["Sonny"],"idIMDB":"nm0000199"},"actorId":"nm0000199","character":"Carlito","urlCharacter":"http://www.imdb.com/character/ch0009762","main":true},{"actorName":"Sean Penn","urlProfile":"http://www.imdb.com/name/nm0000576","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NjMzMjY3NF5BMl5BanBnXkFtZTcwMzkxNjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1960","placeOfBirth":" Santa Monica, California, USA","birthName":"Sean Justin Penn","height":"5' 8\" (1.73 m)","bio":"Sean Penn is a powerhouse film performer capable of intensely moving work, who has gone from strength to strength during a colourful film career, and who has drawn much media attention for his stormy private life and political viewpoints. Sean Justin Penn was born in Los Angeles, California, the second son of actress Eileen Ryan (née Annucci) and director, actor, and writer Leo Penn. His brother was actor Chris Penn. His father was from a Lithuanian Jewish/Russian Jewish family, and his mother is of half Italian and half Irish descent. Penn first appeared in roles as strong-headed or unruly youths such as the military cadet defending his academy against closure in Taps (1981), then as fast-talking surfer stoner Jeff Spicoli in Fast Times at Ridgemont High (1982). Fans and critics were enthused about his obvious talent and he next contributed a stellar performance alongside Timothy Hutton in the Cold War spy thriller The Falcon and the Snowman (1985), followed by a teaming with icy Christopher Walken in the chilling At Close Range (1986). The youthful Sean then paired up with his then wife, pop diva Madonna in the woeful, and painful, Shanghai Surprise (1986), which was savaged by the critics, but Sean bounced back with a great job as a hot-headed young cop in Colors (1988), gave another searing performance as a US soldier in Vietnam committing atrocities in Casualties of War (1989) and appeared alongside Robert De Niro in the uneven comedy We're No Angels (1989). However, the 1990s was the decade in which Sean really got noticed by critics as a mature, versatile and accomplished actor, with a string of dynamic performances in first-class films. Almost unrecognisable with frizzy hair and thin rimmed glasses, Penn was simply brilliant as corrupt lawyer David Kleinfeld in the Brian De Palma gangster movie Carlito's Way (1993) and he was still in trouble with authority as a Death Row inmate pleading with a caring nun to save his life in Dead Man Walking (1995), for which he received his first Oscar nomination. Sean then played the brother of wealthy Michael Douglas, involving him in a mind-snapping scheme in The Game (1997) and also landed the lead role of Sgt. Eddie Walsh in the star-studded anti-war film The Thin Red Line (1998), before finishing the 1990s playing an offbeat jazz musician (and scoring another Oscar nomination) in Sweet and Lowdown (1999). The gifted and versatile Sean had also moved into directing, with the quirky but interesting The Indian Runner (1991), about two brothers with vastly opposing views on life, and in 1995 he directed Jack Nicholson in The Crossing Guard (1995). Both films received overall positive reviews from critics. Moving into the new century, Sean remained busy in front of the cameras with even more outstanding work: a mentally disabled father fighting for custody of his seven-year-old daughter (and receiving a third Oscar nomination) for I Am Sam (2001); an anguished father seeking revenge for his daughter's murder in the gut-wrenching Clint Eastwood-directed Mystic River (2003) (for which he won the Oscar as Best Actor); a mortally ill college professor in 21 Grams (2003) and a possessed businessman in The Assassination of Richard Nixon (2004). Certainly Sean Penn is one of Hollywood's most controversial, progressive and gifted actors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1NjMzMjY3NF5BMl5BanBnXkFtZTcwMzkxNjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000576","name":"Sean Penn","idIMDB":"nm0000576"},"actorId":"nm0000576","character":"Kleinfeld","urlCharacter":"http://www.imdb.com/character/ch0009763","main":true},{"actorName":"Penelope Ann Miller","urlProfile":"http://www.imdb.com/name/nm0000542","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMDc3MDA4M15BMl5BanBnXkFtZTgwNzYzNDcyMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1964","placeOfBirth":" Los Angeles, California, USA","birthName":"Penelope Andrea Miller","height":"5' 7\" (1.7 m)","bio":"Penelope Ann Miller is the middle of three daughters born to Mark Miller, known as the father on Please Don't Eat the Daisies (1965) and later a writer and filmmaker, who wrote A Walk in the Clouds (1995), and Beatrice Miller (Beatrice Ammidown), who worked for Diana Vreeland as a fashion editor for \"Harper's Bazaar\". She graduated from high school in L.A. and moved to New York at 18, where she studied theater/acting at HB Studios under Herbert Berghof. Two years later, Miller got her big break on Broadway, when she originated the role of \"Daisy Hanningan\" in Neil Simon's Tony Award-winning play, \"Biloxi Blues\". Later, she would reprise her role in Universal's film version, directed by Mike Nichols. In 1988, she starred in Great Performances: Our Town (1989), with Eric Stoltz and Spalding Gray, and was nominated for a Tony award for her performance as \"Emily\". Her career most recently includes the 2012 Academy award Best Picture winner, The Artist (2011), co-starring opposite Best Actor winner, Jean Dujardin, directed by Michel Hazanavicius, who also won Best Director that year and was released by The Weinstein Co. Penelope has shared the screen with some of the most notable and renowned leading men and directors in Hollywood and around the world. This impressive list includes Al Pacino and Sean Penn in director Brian De Palma's Carlito's Way (1993), for which she received a Golden Globe nomination; Marlon Brando and Matthew Broderick in The Freshman (1990), directed by Andrew Bergman; Robert De Niro and Robin Williams in Penny Marshall's Awakenings (1990); Robert Downey Jr. in Sir Richard Attenborough's Chaplin (1992); The Shadow (1994) with Alec Baldwin; Danny DeVito and Gregory Peck in Norman Jewison's Other People's Money (1991); Matthew Broderick and Christopher Walken in Mike Nichols' Biloxi Blues (1988); and Arnold Schwarzenegger in Ivan Reitman's Kindergarten Cop (1990) and she starred in Rob Reiner's, film Flipped (2010), for which he wrote and directed for Warner Bros. She was last seen in ABC's hot new show, Mistresses (2013) (2013/14), and in the critically-acclaimed, Men of a Certain Age (2009), opposite Ray Romano (2009/10/2011). Miller's credits also include Sony Pictures' box office hit, The Messengers (2007), which opened #1. The supernatural thriller was produced by Sam Raimi. Miller starred opposite Kristen Stewart, John Corbett and Dylan McDermott. She also starred in Think Films' slapstick comedy, Funny Money (2006), opposite Chevy Chase, in which her performance was compared to Lucille Ball and Carole Lombard in their heydays. Miller was named \"Star of Tomorrow\" by the Motion Picture Bookers Club and \"Most Promising Actress\" by the Chicago Film Critics Association. She received a special jury award for Best Performance at the Hollywood Film Festival for her role in the independent feature, Rhapsody in Bloom (1998), and a Tony Award nomination for her portrayal of \"Emily\" in Broadway's Tony-winning revival of \"Our Town\". Miller's television credits include Rocky Marciano (1999), opposite Jon Favreau and George C. Scott; The Last Don (1997), opposite Joe Mantegna; Mary Kay Letourneau: All American Girl (2000), for which she won critical acclaim, and Rudy: The Rudy Giuliani Story (2003), opposite James Woods. Miller lives in Los Angeles with her husband and two daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMDc3MDA4M15BMl5BanBnXkFtZTgwNzYzNDcyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000542","name":"Penelope Ann Miller","idIMDB":"nm0000542"},"actorId":"nm0000542","character":"Gail","urlCharacter":"http://www.imdb.com/character/ch0045886","main":true},{"actorName":"John Leguizamo","urlProfile":"http://www.imdb.com/name/nm0000491","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEyMjMxNDg5NF5BMl5BanBnXkFtZTcwNzczOTY4MQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1964","placeOfBirth":" Bogotá, Colombia","birthName":"John Alberto Leguizamo","height":"5' 7\" (1.7 m)","bio":"Fast-talking and feisty-looking John Leguizamo has continued to impress movie audiences with his versatility: he can play sensitive and naive young men, such as Johnny in Hangin' with the Homeboys (1991); cold-blooded killers like Benny Blanco in Carlito's Way (1993); a heroic Army Green Beret, stopping aerial terrorists in Executive Decision (1996); and drag queen Chi-Chi Rodriguez in To Wong Foo Thanks for Everything, Julie Newmar (1995). Arguably, not since ill-fated actor and comedian Freddie Prinze starred in the smash TV series Chico and the Man (1974) has a youthful Latino personality had such a powerful impact on critics and fans alike. Leguizamo was born July 22, 1964, in Bogotá, Colombia, to Luz and Alberto Leguizamo. He was four when his family emigrated to the United States. He was raised in Queens, New York, attended New York University and studied under legendary acting coach Lee Strasberg for only one day before Strasberg passed away. The extroverted Leguizamo started working the comedy club circuit in New York and first appeared in front of the cameras in an episode of Miami Vice (1984). His first film appearance was a small part in Cocaïne (1984), and he had minor roles in Casualties of War (1989) and Die Hard 2 (1990) before playing a liquor store thief who shoots Harrison Ford in Regarding Henry (1991). His career really started to soar after his first-rate performance in the independent film Hangin' with the Homeboys (1991) as a nervous young teenager from the Bronx out for a night in brightly lit Manhattan with his buddies, facing the career choice of staying in a supermarket or heading off to college and finding out that the girl he loves from afar isn't quite what he thought she was. The year 1991 was also memorable for other reasons, as he hit the stage with his show Mambo Mouth (1991), in which he portrayed seven different Latino characters. The witty and incisive show was a smash hit and won the Obie and Outer Circle Critics Award, and later was filmed for HBO, where it picked up a CableACE Award. He returned to the stage two years later with another satirical production poking fun at Latino stereotypes titled John Leguizamo: Spic-O-Rama (1993). It played in Chicago and New York, and won the Drama Desk Award and four CableACE Awards. In 1995 he created and starred in the short-lived TV series House of Buggin' (1995), an all-Latino-cast comedy variety show featuring hilarious sketches and comedic routines. The show scored two Emmy nominations and received positive reviews from critics, but it was canceled after only one season. The gifted Leguizamo was still keeping busy in films, with key appearances in Super Mario Bros. (1993), Romeo + Juliet (1996) and Spawn (1997). In 1998 he made his Broadway debut in John Leguizamo: Freak (1998), a \"demi-semi-quasi-pseudo-autobiographical\" one-man show, which was filmed for HBO by Spike Lee. Utilizing his distinctive vocal talents, he next voiced a pesky rat in Doctor Dolittle (1998) before appearing in the dynamic Spike Lee-directed Summer of Sam (1999) as a guilt-ridden womanizer, as the Genie of The Lamp in the exciting Arabian Nights (2000) and as Henri DE Toulouse Lautrec in the visually spectacular Moulin Rouge (2001). He also voiced Sid in the animated Ice Age (2002), co-starred alongside Arnold Schwarzenegger in Collateral Damage (2002) and directed and starred in the boxing film Undefeated (2003). Afterward, Leguizamo starred in the remake of the John Carpenter hit Assaut sur le central 13 (2005) and George A. Romero's long-awaited fourth \"Dead\" film, Land of the Dead - Le territoire des morts (2005). There can be no doubt that the remarkably talented Leguizamo has been a breakthrough performer for the Latino community in mainstream Hollywood, in much the same way that Sidney Poitier crashed through celluloid barriers for African-Americans in the early 1960s. Among his many strengths lies his ability to not take his ethnic background too seriously but also to take pride in his Latino heritage. He has opened many doors for his countrymen. A masterly and accomplished performer, movie audiences await Leguizamo's next exciting performance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEyMjMxNDg5NF5BMl5BanBnXkFtZTcwNzczOTY4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000491","name":"John Leguizamo","nicknames":["Johnny Legs","John Leguizama"],"idIMDB":"nm0000491"},"actorId":"nm0000491","character":"Benny Blanco","urlCharacter":"http://www.imdb.com/character/ch0074853","main":true},{"actorName":"Ingrid Rogers","urlProfile":"http://www.imdb.com/name/nm0736917","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5Mzc3MzkxNF5BMl5BanBnXkFtZTgwMzYyMjk5ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 April 1968","placeOfBirth":" Toronto, Ontario, Canada","bio":"Born in Toronto, Canada and raised in Jamaica, West Indies, Ingrid discovered acting in high school after she co-wrote and acted in a production about South African apartheid. Her desire to master the craft, took her to The American Academy of Dramatic Arts in New York City. Two months out of school she landed and originated the role of Taylor Roxbury-Canon on \"All My Children\". From there she went on to work with such acclaimed directors as, Woody Allen, Joel Schumacher and Brian DePalma who directed her in her starring role opposite Al Pacino and Sean Penn in \"Carlito's Way\". With numerous TV credits and national commercials to her credit, Ingrid continues to hone her love and passion for acting. Ingrid lives in Los Angeles with her husband and children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5Mzc3MzkxNF5BMl5BanBnXkFtZTgwMzYyMjk5ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0736917","name":"Ingrid Rogers","idIMDB":"nm0736917"},"actorId":"nm0736917","character":"Steffie","urlCharacter":"http://www.imdb.com/character/ch0061702","main":true},{"actorName":"Luis Guzmán","urlProfile":"http://www.imdb.com/name/nm0350079","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYyNjIyOTU2NF5BMl5BanBnXkFtZTcwODk3ODcxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1956","placeOfBirth":" Cayey, Puerto Rico","height":"5' 7½\" (1.71 m)","bio":"Actor of Puerto Rican descent who made many memorable films in the 1980s due to his villainous persona. Presently resides with his wife and many kids in Vermont.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzYyNjIyOTU2NF5BMl5BanBnXkFtZTcwODk3ODcxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0350079","name":"Luis Guzmán","idIMDB":"nm0350079"},"actorId":"nm0350079","character":"Pachanga","urlCharacter":"http://www.imdb.com/character/ch0061701","main":true},{"actorName":"James Rebhorn","urlProfile":"http://www.imdb.com/name/nm0714310","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNTc4ODE1MF5BMl5BanBnXkFtZTcwMjA5NzY5Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 September 1948","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"James Robert Rebhorn","height":"6' 3\" (1.91 m)","bio":"James Robert Rebhorn (September 1, 1948 - March 21, 2014) was an American actor who appeared in over 100 films, television series, and plays. At the time of his death, he had recurring roles in the current series White Collar and Homeland. An early performance was in Butterflies are Free at the Peterborough Players in New Hampshire in 1974. Rebhorn played Peter Latham in Forty Carats at the GasLight Dinner Theatre in Salt Lake City in the 1970s. He was known both for portraying WASP stereotypes, lawyers, politicians, doctors, and military men, as well as portraying individuals with criminal behavior. He has delivered equally notable performances in a variety of other roles, including that of a brutal serial killer on NBC's Law & Order (he would later return to the show in the recurring role of defense attorney Charles Garnett), Ellard Muscatine in Lorenzo's Oil (1992), Fred Waters in Blank Check (1994), Clyde Frost, the father of famed bull rider Lane Frost, in 8 Seconds (1994), Lt. Tyler in White Squall (1996), and a shipping magnate in The Talented Mr. Ripley (1999). One of his best known performances came in the popular 1996 film Independence Day, where he played Secretary of Defense Albert Nimzicki. He acted in Scent of a Woman (1992), and also played an expert witness in My Cousin Vinny (1992). He appeared in Carlito's Way the following year. Rebhorn also played an FBI Agent in the 1994 film Guarding Tess. Rebhorn played several roles on television, including an abusive stepfather, Bradley Raines, on the soap opera Guiding Light from 1983 to 1985, and an abusive father, Henry Lange, on sister soap As The World Turns from 1988 to 1991. An earlier daytime role was as John Brady in Texas from 1981 to 1982. In 1994 he played the role of super villain John McFlemp in the episode \"Farewell, My Little Viking\" of the Nickelodeon series The Adventures of Pete & Pete. In 1998, he played the District Attorney in the two-part series finale of Seinfeld. He also appeared in a supporting roles in The Game, Meet the Parents, and Regarding Henry. In 2004, he appeared in the TV miniseries Reversible Errors. His role in the short-lived and controversial NBC drama The Book of Daniel cast him as the father of the title character. More recently, he appeared in the Showtime series Homeland as Carrie's bipolar father. Rebhorn also appeared as a judge in Baby Mama. In the 2009 movie The Box, Rebhorn portrayed a NASA scientist. He had recurring roles on the USA series White Collar as Special Agent Reese Hughes, and also as Frank Mathison, the father of the protagonist Carrie Mathison, on Homeland. Rebhorn recently co-starred in the Comedy Central sitcom Big Lake. He played Max Kenton's uncle in the 2011 movie Real Steel. He starred as Oren in the miniseries Coma. Rebhorn starred as Gary Pandamiglio in the 2012 Mike Birbiglia comedy Sleepwalk with Me. He co-starred in the 2013 romantic comedy The Perfect Wedding. His stage career included seven Broadway productions, as well as numerous appearances with New York City's Roundabout Theatre Company.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNTc4ODE1MF5BMl5BanBnXkFtZTcwMjA5NzY5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0714310","name":"James Rebhorn","idIMDB":"nm0714310"},"actorId":"nm0714310","character":"Norwalk","urlCharacter":"http://www.imdb.com/character/ch0061703","main":true},{"actorName":"Joseph Siravo","urlProfile":"http://www.imdb.com/name/nm0802759","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMTUxNTY3MF5BMl5BanBnXkFtZTgwNDY2NDA5NzE@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"bio":"Joseph Siravo is an actor and producer, known for American Crime Story (2016), The Sopranos (1999) and Carlito's Way (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMTUxNTY3MF5BMl5BanBnXkFtZTgwNDY2NDA5NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0802759","name":"Joseph Siravo","idIMDB":"nm0802759"},"actorId":"nm0802759","character":"Vinnie Taglialucci","urlCharacter":"http://www.imdb.com/character/ch0061704","main":true},{"actorName":"Viggo Mortensen","urlProfile":"http://www.imdb.com/name/nm0001557","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQzOTg4NzA2Nl5BMl5BanBnXkFtZTcwMzkwNjkxMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1958","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Viggo Peter Mortensen Jr.","height":"5' 11\" (1.8 m)","bio":"Since his screen debut as a young Amish Farmer in Peter Weir's Witness (1985), Viggo Mortensen's career has been marked by a steady string of well-rounded performances. Mortensen was born in New York City, to Grace Gamble (Atkinson) and Viggo Peter Mortensen, Sr. His father was Danish, his mother was American, and his maternal grandfather was Canadian. His parents met in Norway. They wed and moved to New York, where Viggo, Jr. was born, before moving to South America, where Viggo, Sr. managed chicken farms and ranches in Venezuela and Argentina. Two more sons were born, Charles and Walter, before the marriage grew increasingly unhappy. When Viggo was seven, his parents sent him to a a strict boarding school, isolated in the foothills of the mountains of Argentina. Then, at age eleven, his parents divorced. His mother moved herself and the children back to her home state of New York. Viggo attended Watertown High School, and became a very good student and athlete. He graduated in 1976 and went on to St. Lawrence University in Canton, New York. After graduation, he moved to Denmark - driven by the need for a defining purpose in life. He began writing poetry and short stories while working many odd jobs, from dock worker to flower seller. In 1982, he fell in love and followed his girlfriend back to New York City, hoping for a long romance and a writing career. He got neither. In New York, Viggo found work waiting tables and bar tending and began taking acting classes, studying with Warren Robertson. He appeared in several plays and movies, and eventually moved to Los Angeles, where his performance in \"Bent\" at the Coast Playhouse earned him a Drama-logue Critic's Award. He made his film debut with a small part in Witness (1985). He appeared in Salvation!: Have You Said Your Prayers Today? (1987) and married his co-star, Exene Cervenka. The two had a son, Henry Mortensen. But after nearly eleven years of marriage, the couple divorced. In 1999, Viggo got a phone call about a movie he did not know anything about: The Lord of the Rings. At first, he didn't want to do it, because it would mean time away from his son. But Henry, a big fan of the books, told his father he shouldn't turn down the role. Viggo accepted the part and immediately began work on the project, which was already underway. Eventually, the success of Lord of the Rings made him a household name - a difficult consequence for the ever private and introspective Viggo. Critics have continually recognized his work in over thirty movies, including such diverse projects as Jane Campion's The Portrait of a Lady (1996), Sean Penn's The Indian Runner (1991), Brian De Palma's Carlito's Way (1993), Ridley Scott's G.I. Jane (1997), Tony Scott's Crimson Tide (1995), Andrew Davis's A Perfect Murder (1998), Ray Loriga's La pistola de mi hermano (1997), and Tony Goldwyn's Le choix d'une vie (1999). Mortensen is also an accomplished poet, photographer and painter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQzOTg4NzA2Nl5BMl5BanBnXkFtZTcwMzkwNjkxMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001557","name":"Viggo Mortensen","nicknames":["Vig","Guido","Cuervo"],"idIMDB":"nm0001557"},"actorId":"nm0001557","character":"Lalin","urlCharacter":"http://www.imdb.com/character/ch0058796","main":true},{"actorName":"Richard Foronjy","urlProfile":"http://www.imdb.com/name/nm0286561","urlPhoto":"","biography":{"dateOfBirth":"3 August 1937","placeOfBirth":" Brooklyn, New York, USA","bio":"Richard Foronjy was born on August 3, 1937 in Brooklyn, New York, USA. He is an actor, known for Il était une fois en Amérique (1984), Carlito's Way (1993) and Midnight Run (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0286561","name":"Richard Foronjy","idIMDB":"nm0286561"},"actorId":"nm0286561","character":"Pete Amadesso","urlCharacter":"http://www.imdb.com/character/ch0061705","main":true},{"actorName":"Jorge Porcel","urlProfile":"http://www.imdb.com/name/nm0691672","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzNkOTY1NjgtZGVkYi00MjQxLWFlZjAtNTM3ZjAxOTExNTlmXkEyXkFqcGdeQXVyNjU0ODkwMTU@._V1_UY44_CR12,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1936","placeOfBirth":" Buenos Aires, Argentina","birthName":"Jorge Raúl Porcel de Peralta","height":"5' 5¾\" (1.67 m)","bio":"Jorge Porcel was born on September 7, 1936 in Buenos Aires, Argentina as Jorge Raúl Porcel de Peralta. He was an actor and writer, known for Carlito's Way (1993), Polémica en el bar (1972) and Los caballeros de la cama redonda (1973). He died on May 16, 2006 in Miami, Florida, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzNkOTY1NjgtZGVkYi00MjQxLWFlZjAtNTM3ZjAxOTExNTlmXkEyXkFqcGdeQXVyNjU0ODkwMTU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0691672","name":"Jorge Porcel","nicknames":["El gordo"],"idIMDB":"nm0691672"},"actorId":"nm0691672","character":"Saso","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Minucci","urlProfile":"http://www.imdb.com/name/nm0591800","urlPhoto":"","biography":{"bio":"Frank Minucci is an actor, known for Ghost Dog, la voie du samouraï (1999), Carlito's Way (1993) and Friends and Family (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0591800","name":"Frank Minucci","idIMDB":"nm0591800"},"actorId":"nm0591800","character":"Tony Taglialucci","urlCharacter":"http://www.imdb.com/character/ch0061706","main":true},{"actorName":"Adrian Pasdar","urlProfile":"http://www.imdb.com/name/nm0664499","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MzQ3ODM2Nl5BMl5BanBnXkFtZTYwODMxNjI3._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 April 1965","placeOfBirth":" Pittsfield, Massachusetts, USA","birthName":"Adrian Kayvan Pasdar","height":"5' 10\" (1.78 m)","bio":"Adrian Pasdar was born in Pittsfield, Massachusetts, to Rosemarie Pasdar (née Sbresny), who owns a travel agency, and Homayoon Pasdar, a prominent heart surgeon. His father is Iranian and his mother, who was born in Germany, is of German, and some Polish, descent. At the age of 2, his father moved the family to Powelton, Pennsylvania, a suburb of Philadelphia. In high school, he excelled at football, eventually leading to a football scholarship at the University of Florida in 1983. Football may have been a promising future, had it not been for a terrible accident during his freshman year that left his face scarred and his legs badly injured. A very driven Adrian finished his freshman year in a wheelchair, doing intensive physical therapy and turning his attention to campus stage productions and rediscovered a childhood interest in writing and acting. No longer able to play football, he dropped out of school and returned home, taking a job with a theater group \"People's Light and Theatre Company\". Here, he worked on sound, lighting and set construction. While constructing a set, he cut off the end of his left thumb. Adrian, having the ability to turn tragedy into triumph, used his medical compensation to pay for attendance at the famous Lee Strasberg Theater Institute. At the age of 19, he auditioned for a role in Top Gun (1986). Director Tony Scott was so impressed that he wrote the part of \"Chipper\" just for him. This led to bigger roles in Solarbabies (1986), Streets of Gold (1986), and Kathryn Bigelow's 1987 cult vampire movie Near Dark (1987), with Adrian in the lead role of \"Caleb Colton\". He also appeared in Vital Signs (1990). Adrian has always been an actor ahead of his time, opting for roles in independent and cable movies long before they were considered fashionable for feature actors to do. In 1992, feeling completely out-of-touch with reality, Adrian left Hollywood to return to New York. He worked as a cashier for room and board, while taking the occasional small part, such as \"Frankie\" in Brian De Palma's Carlito's Way (1993). Another major break came in 1995, when Adrian was cast as the title character on the short-lived Fox series Profit (1996). He continues to act in supporting roles and has now added directing to his already impressive body of work. He wrote and directed the short film Beyond Belief (1999) and also directed a feature film entitled Cement (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4MzQ3ODM2Nl5BMl5BanBnXkFtZTYwODMxNjI3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0664499","name":"Adrian Pasdar","idIMDB":"nm0664499"},"actorId":"nm0664499","character":"Frankie","urlCharacter":"http://www.imdb.com/character/ch0061707","main":true},{"actorName":"John Ortiz","urlProfile":"http://www.imdb.com/name/nm0651159","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzc5MzcyMV5BMl5BanBnXkFtZTgwMjYzOTg1NjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 May 1968","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"5' 8\" (1.73 m)","bio":"John Ortiz was born on May 23, 1968 in Brooklyn, New York City, New York, USA. He is an actor, known for Silver Linings Playbook (2012), Fast & Furious (2009) and American Gangster (2007). He is married to Jennifer Ortiz. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzc5MzcyMV5BMl5BanBnXkFtZTgwMjYzOTg1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0651159","name":"John Ortiz","idIMDB":"nm0651159"},"actorId":"nm0651159","character":"Guajiro","urlCharacter":"http://www.imdb.com/character/ch0061709","main":true},{"actorName":"Ángel Salazar","urlProfile":"http://www.imdb.com/name/nm0757774","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYyMTgzNzkyOF5BMl5BanBnXkFtZTgwNTQ5MDU0MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Angel Salazar (born March 2, 1956) is a Cuban-American comedian and actor. This manic,human laugh factory is rather difficult to describe. His Cuban heritage and penchant for sporting mini-skirts notwithstanding, Salazar's performance is a mixture of street-smart ethnic wisecracks, risqué humor, physical comedy, and audience involvement. He disappeared from films in 1993 for a decade!? Only appearing in a documentary called \"Comedian\"(2002) in between. He reappeared in 2003 in the films, \"Harlem Blues\"and \"Vote for Me\". He once again disappeared for 2 yrs from film!?. In 2005, he came back for a film called \"Rose Woes and Joe's \" But then he once again vanished for 2 more years!? In between he did another documentary in 2006 \"The Latin Legends of Comedy\" with J.J. Ramirez and Joey Vega.He reappeared in 2007 with \"Made in Brooklyn \" then again gone for 2 more years!? He again appeared in 2009 and made one short film,'Trust Me'. Then the very next year 2010 he did another short film, 'Crumble' with his co-star from \"Scarface\"(1983), Steven Bauer. He came back to films in 2011 with \"The Last Gamble \"as a character named 'Angel' no-less. He has 2 complete films coming out in 2012.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTYyMTgzNzkyOF5BMl5BanBnXkFtZTgwNTQ5MDU0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0757774","name":"Ángel Salazar","idIMDB":"nm0757774"},"actorId":"nm0757774","character":"Walberto","urlCharacter":"http://www.imdb.com/character/ch0061708","main":true}],"seasons":[],"idIMDB":"tt0106519","urlIMDB":"http://www.imdb.com/title/tt0106519","business":{"budget":{"money":"$30,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$9,116,675","country":"USA","day":"14","month":"11","year":"1993","remarks":"1,615 Screens"}],"gross":[{"money":"£2,122,432","country":"UK","day":"06","month":"02","year":"1994","remarks":""},{"money":"£1,112,190","country":"UK","day":"16","month":"01","year":"1994","remarks":""},{"money":"AUD","country":"1,217,337","day":null,"month":null,"year":null,"remarks":null},{"money":"SEK","country":"4,101,452","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$824,820","country":"USA","day":"19","month":"12","year":"1993","remarks":"932 Screens"},{"money":"$1,341,995","country":"USA","day":"12","month":"12","year":"1993","remarks":"1,266 Screens"},{"money":"$2,519,850","country":"USA","day":"05","month":"12","year":"1993","remarks":"1,605 Screens"},{"money":"$4,620,280","country":"USA","day":"28","month":"11","year":"1993","remarks":"1,624 Screens"},{"money":"$5,906,910","country":"USA","day":"21","month":"11","year":"1993","remarks":"1,634 Screens"}],"admissions":[],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"22","month":"03","year":"1993","remarks":null},{"money":null,"country":null,"day":"20","month":"07","year":"1993","remarks":null}],"copyrightHolder":"Universal City Studios, Inc."},"technical":{"runtime":["2 hr 24 min (144 min)"],"soundMix":["DTS","Dolby"],"color":["Black and White","Color"],"aspectRatio":["2.35 : 1"],"camera":["Panavision Panaflex Gold II, Panavision C-Series Lenses"],"laboratory":["Technicolor, New York (NY), USA (processing)","DeLuxe, Hollywood (CA), USA"],"filmLength":["3,953 m (Sweden)"],"negativeFormat":["35 mm (Eastman)"],"cinematographicProcess":["Panavision"],"printedFilmFormat":["35 mm"]},"rating":"7.9","filmingLocations":[{"location":"Dock Lane, Kings Point, Long Island, New York, USA"}],"rated":"R","awards":[{"award":"Golden Globes, USA 1994","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Performance by an Actress in a Supporting Role in a Motion Picture","names":[{"name":"Penelope Ann Miller","id":"nm0000542","role":null}]},{"category":"Best Performance by an Actor in a Supporting Role in a Motion Picture","names":[{"name":"Sean Penn","id":"nm0000576","role":null}]}]}]},{"award":"Chicago Film Critics Association Awards 1994","titlesAwards":[{"titleAwardOutcome":"Nominated CFCA Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Sean Penn","id":"nm0000576","role":null}]}]}]},{"award":"David di Donatello Awards 1994","titlesAwards":[{"titleAwardOutcome":"Nominated David","categories":[{"category":"Best Foreign Actor (Migliore Attore Straniero)","names":[{"name":"Al Pacino","id":"nm0000199","role":null}]}]}]},{"award":"Italian National Syndicate of Film Journalists 1994","titlesAwards":[{"titleAwardOutcome":"Won Silver Ribbon","categories":[{"category":"Best Male Dubbing (Migliore Doppiaggio Maschile)","names":[{"name":"Giancarlo Giannini","id":"nm0316284","role":null}]}]}]}],"votes":"169,517","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"},{"idCompany":"co0008929","name":"Epic Productions"},{"idCompany":"co0043292","name":"Bregman/Baer Productions"}],"keywords":{"keywords":["mafia","1970s","prison","violence","puerto rican","drugs","gunfight","dancer","nightclub","murder","blood splatter","stretcher","female full frontal nudity","profanity","boyfriend girlfriend relationship","kiss","kissing while having sex","male nudity","love interest","female removes her clothes","last stand","beating","baseball bat","silencer","mob violence","mobster","poolhall shootout","shootout in a hospital","tough guy","main character shot","main character dies","black and white scene","opening action scene","boat","villain turns good","hit on head","unplanned pregnancy","unwanted pregnancy","leg spreading","lust","sex in restroom stall","sex in bed","girl in panties","panties","voyeur","voyeurism","fondling","bikini","blonde","no panties","nipples visible through clothing","breasts","scantily clad female","cleavage","subjective camera","character's point of view camera shot","cocaine addict","interracial sex","interracial romance","racial slur","man with glasses","manhattan new york city","dutch angle","friend turned foe","tragic event","grand central station manhattan new york city","topless dancing","stripper","voice over narration","flashback","spanish harlem manhattan new york city","one last job","informer","informant","psychopath","narration from the grave","entrepreneur","cocaine snorting","champagne","blackmail","anti semitism","female nudity","wiretap","steadicam","rikers island new york city","pool party","pool hall","pole dancing","paraplegic","jailbreak","go go dancer","first person narrative","east river","dance studio","latinos versus italians","jewish","throat slitting","stabbed in the chest","shot to death","shot in the head","shot in the face","shot in the chest","pistol","knife in the chest","female frontal nudity","death","blood","long take","train","yacht","wheelchair","wearing a sound wire","unwed pregnancy","taxi","tape recorder","subway","strip club","stabbing","shootout","sex in public","secret passage","safe","revenge","railway station","prison escape","premarital sex","police","party","organized crime","new york city","mob hit","hospital","falling down stairs","extortion","exotic dancer","ex convict","ethnic slur","escalator","elevator","district attorney","dancing","crooked lawyer","crime boss","courtroom","cocaine","chase","buoy","bludgeoning","billboard","betrayal","disco","gangster","neo noir","based on novel","character name in title","surprise ending","death of title character","reference to rikers island prison barge","death of protagonist","death of hero","anti hero"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:01:17"}}