{"data":{"movies":[{"title":"Selena","originalTitle":"","year":"1997","releaseDate":"19970321","directors":[{"name":"Gregory Nava","id":"nm0622695"}],"writers":[{"name":"Gregory Nava","id":"nm0622695"}],"runtime":"127 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZGE0Y2RlNmQtZDY0Ni00Njk5LWFiZWUtMzc5N2VlZTBhOGE5L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Biography","Drama","Music"],"plot":"The film tells the story of the life of Mexican \"Tejano\" style singer Selena Quintanilla-Perez and the progress of her career resulting in her No. 1 US album.","simplePlot":"The true story of Selena Quintanilla-Perez, a Texas-born Tejano singer who rose from cult status to performing at the Astrodome, as well as having chart topping albums on the Latin music charts.","actors":[{"actorName":"Jennifer Lopez","urlProfile":"http://www.imdb.com/name/nm0000182","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0OTY3ODA3OV5BMl5BanBnXkFtZTcwMzMyMzQ1NQ@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 July 1969","placeOfBirth":" The Bronx, New York, USA","birthName":"Jennifer Lynn Lopez","height":"5' 6\" (1.68 m)","bio":"Jennifer Lynn Lopez was born in the Castle Hill section of the South Bronx on July 24, 1969. She is the middle of three musically-inclined sisters, Leslie Lopez, a homemaker, and Lynda Lopez, a DJ on New York's WKTU, a VH1 VJ, and a morning news show correspondent on New York's Channel 11. Jennifer always dreamed of being a multi-tasking superstar. Jennifer's parents, Guadalupe Rodriguez and David Lopez, were both born in Ponce, Puerto Rico, the second largest Puerto Rican city. The two were then brought to the continental United States during their childhoods and, eventually, met while living in New York City. As a child, Jennifer enjoyed a variety of musical genres, mainly Afro-Caribbean rhythms like salsa, merengue and bachata, and mainstream music like pop, hip-hop and R&B. Although she loved music, the film industry also intrigued her. Her biggest influence was the Rita Moreno musical, West Side Story (1961). At age five, Jennifer began taking singing and dancing lessons. Aside from being a budding entertainer, Jennifer was also a Catholic schoolgirl, attending eight years at an all-girls catholic high school named \"Holy Family\", located in the Bronx, before graduating from Preston High School after a four-year stay. At school, Jennifer was an amazing athlete and participated in track and field and tennis. At age eighteen, Lopez moved out of her parent's home. During this time, Lopez worked at a law firm while she took dancing jobs at night. After high school, she briefly worked in a law office. During this time, she continued dance classes at night. At 18, she left home because her mother was scared by her decision to pursue show business. Her big break came when she was offered a job as a fly girl on Fox's hit comedy, In Living Color (1990). After a two-year stay at In Living Color (1990) where actress Rosie Perez served as choreographer, Lopez then went on to dance for famed singer-actress Janet Jackson. Her first major film was Gregory Nava's My Family (1995), and her career went into over-drive when she portrayed slain Tejana singer Selena Quintanilla Perez in Selena (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0OTY3ODA3OV5BMl5BanBnXkFtZTcwMzMyMzQ1NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000182","name":"Jennifer Lopez","nicknames":["J. Lo","La Lopez","Lola","Jenny from the Block"],"idIMDB":"nm0000182"},"actorId":"nm0000182","character":"Selena Quintanilla","urlCharacter":"http://www.imdb.com/character/ch0031406","main":true},{"actorName":"Jackie Guerra","urlProfile":"http://www.imdb.com/name/nm0346027","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYyNzgxNTk0NF5BMl5BanBnXkFtZTYwNDk5Mzcy._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1965","placeOfBirth":" USA","bio":"Jackie Guerra was born on July 25, 1965 in the USA. She is an actress, known for Selena (1997), First Time Out (1995) and Amour, délice et petits plats (1997). She is married to Bill Torres.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODYyNzgxNTk0NF5BMl5BanBnXkFtZTYwNDk5Mzcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0346027","name":"Jackie Guerra","idIMDB":"nm0346027"},"actorId":"nm0346027","character":"Suzette Quintanilla","urlCharacter":"http://www.imdb.com/character/ch0225883","main":true},{"actorName":"Constance Marie","urlProfile":"http://www.imdb.com/name/nm0005186","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODg2NTQyNF5BMl5BanBnXkFtZTcwNzM0NzEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1965","placeOfBirth":" East Los Angeles, California, USA","birthName":"Constance Marie Lopez","height":"5' 4½\" (1.64 m)","bio":"Constance Marie was a very busy actress in 2002, juggling two primetime series: a short-lived one-hour drama American Family (2002), which aired on PBS and a half-hour sitcom, George Lopez (2002) on ABC. On the critically praised American Family (2002), Marie starred alongside Edward James Olmos, Sonia Braga, Esai Morales and Raquel Welch,as Nina, a daughter in the Gonzales family and a sexy legal aid attorney, whose liberal and political ideas are constantly challenged by her conservative father \"Jess\", played by Olmos. American Family (2002) was the PBS's first-ever original television series. On George Lopez (2002), Marie starred as Angie Lopez, George's wife and the mother of their two children. The series stared stand-up comedian George Lopez and aired for a while during the last half hour of Marie's other series, American Family. Marie was seen starring as Yolanda in the highly celebrated Samuel Goldwyn film, Tortilla Soup (2001). She played the daughter of Raquel Welch, who coincidentally stared as her aunt in America Family. Marie's thriving career on both the small and big screen began when, as a teenager in Los Angeles' underground breakdancing scene, she was selected out of a group of 500 hopefuls to dance in David Bowie's Glass Spider Tour. Upon arriving back in Los Angeles, Marie was cast as a dancer in the movie Salsa (1988). The film's choreographer introduced her to Steve Tisch, who gave Marie her very first acting job and an amazing one at that: a series regular role as Penny on CBS's short-lived Dirty Dancing (1988). While TV was Marie's first job, she began to desire work in feature films as well. Naturally, it was only a matter of time before Marie was working in features, starring as Toni Sanchez in the critically recognized 1995 Newline feature My Family (1995), directed by Gregory Nava. The project was also the first of many times Marie has worked with fellow actor and friend Edward James Olmos. Marie went on to win praise from fans for her portrayal of Tejano music legend Selena's mother, Marcella Quintanilla, in the blockbuster film Selena (1997). Less than four years older than her on-screen daughter (portrayed by Jennifer Lopez, Constance Marie underwent four hours of extensive make-up in order for her to look like Selena's mother. She has continued to work almost non-stop since. TV producer Gary David Goldberg offered Marie a role as Michael J. Fox's antagonist love interest, Gabby, on the ABC series Spin City (1996), a stint that helped the series achieve some of its highest ratings to date. Offers were pouring in and Marie found herself starring as Gabriella Diaz, on the another short-lived series Union Square (1997). The cancellation of the highly publicized Union Square allowed the in-demand Marie to quickly jump into another role, as Detective Toni Brigatti on Early Edition (1996), where she guest starred on six occasions between 1998 and 2000. In 1999, she appeared in two episodes of Two Guys, a Girl and a Pizza Place (1998). In 2000-2001, she had a recurring role on For Your Love (1998). In 2001, Marie went back to her dancing roots to portray Inez Cortez, a salsa champion on Ally McBeal (1997). Other credits include the NBC pilot The Underworld (1997) opposite Kevin Pollak and the Mario Van Peebles-directed ABC pilot, \"Missing Persons\". In addition to her numerous film and television starring roles, Marie cameoed in the comedy See Spot Run (2001) and starred in the 2000 Sundance Film Festival favorite Dancing in September (2000). After George Lopez (2002) ended in 2007, she has guest starred on CSI: Crime Scene Investigation (2000), The Secret Life of the American Teenager (2008) and According to Jim (2001). She is currently starring in Switched at Birth (2011) as Regina Vasquez.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1ODg2NTQyNF5BMl5BanBnXkFtZTcwNzM0NzEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005186","name":"Constance Marie","idIMDB":"nm0005186"},"actorId":"nm0005186","character":"Marcela Quintanilla","urlCharacter":"http://www.imdb.com/character/ch0457448","main":true},{"actorName":"Alex Meneses","urlProfile":"http://www.imdb.com/name/nm0005224","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4ODcwNjUzOV5BMl5BanBnXkFtZTgwMjI1NzY2NjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1965","placeOfBirth":" Chicago, Illinois, USA","birthName":"Alexandra Estella DeAnna Meneses","height":"5' 10\" (1.78 m)","bio":"Alexandra \"Alex\" Meneses, the ALMA Award nominated actress known for her smoldering bombshell roles and philanthropic work has been cast as popular diva actress \"Isabella\" on Telenovela (2015), Eva Longoria's new NBC series. Alex first made a splash in the 1990s as \"Teresa Morales\" in the hit series, Dr. Quinn, Medicine Woman (1993), followed by an ALMA Award-nominated role as \"Stefania Fogagnolo\", Robert's Italian girlfriend on Everybody Loves Raymond (1996), and Joey Tribiani's sister, \"Cookie\", on Friends (1994). Other memorable TV appearances have included roles on The Goldbergs (2013), Castle (2009), Prison Break (2005), NCIS (2003), Psych (2006), Austin & Ally (2011) and the voices of \"Svetlana\" and \"Fabrizia\" on The Cleveland Show (2009). On film, the Chicago native and former model has appeared in Selena (1997), Boyle Heights (2010), The Flintstones in Viva Rock Vegas (2000), and the New York Film Critics Circle Award-winning, Auto Focus (2002), opposite Greg Kinnear. In July 2014, Alex was Mistress of Ceremonies for \"Ischia Global Film Festival\" in Italy. Alex is the Executive Producer of the 2015 Noble Awards, which honors celebrities for their humanitarian work. These awards are held in Los Angeles. As president and founder of her own production company, (OOLaLa Productions/LADDS Entertainment), Alex produced the Sundance Channel hit documentary Damned to Heaven, a gripping look at life inside the FLDS (Fundamental Church of Jesus Christ Later Day Saints) pluralistic community of Colorado City, Arizona. She also executive produced Australians Hit Hollywood, an honest look at Australians and New Zealanders who have turned themselves into prominent players in the Hollywood entertainment scenes. Growing up in Chicago, Alex was inspired to pursue a career in acting while still in high school after seeing Rita Moreno's performance in West Side Story. After signing with an agent, Alex began going on commercial auditions. During summer breaks, she also enrolled in the famed Second City Improv program. Following high school, Alex landed a modeling contract and moved to Europe where she worked regularly in France, Greece and Italy. Upon her return to the US, she entered The Lee Strasberg Theater Institute to hone her acting skills. She has received acclaim in Los Angeles theatre including the Geffen Playhouse's production of Oscar and Felix: A New Look at The Odd Couple by Neil Simon. An adapted revival of The Odd Couple, Simon altered the ethnicity of Oscar & Felix's neighboring sisters to Spanish, which fit Meneses who is half Mexican-American. Alex has appeared in numerous stage productions including Hortensia and the Museum of Dreams at Chicago's Victory Gardens Theater. In her on-going commitment to philanthropy and volunteerism, Alex serves as a board member for many organizations including The Children's Hospital of Los Angeles, United Hope for Animals, The Los Angeles Symphony, and The Chicago Symphony and is a member of The Chicago Historical Society. A devoted alumna of Chicago's Mother McCauley Liberal Arts High School, Alex frequently returns to campus and meets with students to share her insights and commitment to a McAuley education. In 2005, she established the Alexandra Meneses Endowed Scholarship to help ensure that a new generation of young women is given the opportunity to experience.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4ODcwNjUzOV5BMl5BanBnXkFtZTgwMjI1NzY2NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005224","name":"Alex Meneses","idIMDB":"nm0005224"},"actorId":"nm0005224","character":"Sara","urlCharacter":"http://www.imdb.com/character/ch0457449","main":true},{"actorName":"Jon Seda","urlProfile":"http://www.imdb.com/name/nm0781218","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI1MTA2MjkxM15BMl5BanBnXkFtZTcwMTcwMDg2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 October 1970","placeOfBirth":" New York City, New York, USA","birthName":"Jonathan Seda","height":"5' 9\" (1.75 m)","bio":"Jon Seda's first passion was to be a championship boxer. After taking runner-up in the NJ Golden Gloves, the 1992 Olympics was the next goal. That's when fate stepped in; at his first audition, for Gladiator (1992), he was given a co-starring role! Since then he has branched off into numerous television and film roles. He has garnered critical acclaim for his roles in such films as I Like It Like That (1994), The Sunchaser (1996), Selena (1997), Undisputed (2002), and in television for his roles in Homicide: Life on the Street (1993), UC: Undercover (2001), Third Watch (1999), Oz (1997) and most recently his lead role as Marine Sgt. John \"Manila\" Basilone in HBO's award-winning mini series The Pacific (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI1MTA2MjkxM15BMl5BanBnXkFtZTcwMTcwMDg2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0781218","name":"Jon Seda","idIMDB":"nm0781218"},"actorId":"nm0781218","character":"Chris Perez","urlCharacter":"http://www.imdb.com/character/ch0457450","main":true},{"actorName":"Edward James Olmos","urlProfile":"http://www.imdb.com/name/nm0001579","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzODQzODQ4OF5BMl5BanBnXkFtZTcwMDczMTkxNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1947","placeOfBirth":" Los Angeles, California, USA","height":"5' 8½\" (1.74 m)","bio":"Edward James Olmos was born in Los Angeles, California, to Eleanor (Huizar) and Pedro Olmos, who was a mail carrier and welder. His family was of Mexican descent. If Olmos had followed the first love of his life, he would have been a professional baseball player. But by age 13, another love entered his life: rock music. By age 15, he was already an experienced rock singer, forming and reforming several \"garage bands\" along the way. During the late 1960s and early 1970s, he played the most famous clubs on Sunset Strip, including Gazzarri's and The Factory. But a friend suggested that, with his flair for the dramatic, he consider a career in acting. Throughout the 1970s, he divided his time between rock music gigs, acting classes, bit parts in television, Off-off-off Broadway plays and his business of moving fine furniture (which kept body, soul and family together). His first big break was a starring role in Luis Valdez's play, \"Zoot Suit\", in 1978. The play moved to Broadway and led to a Tony Award nomination and great critical acclaim. Perhaps best known for his role as Lt. Martin Castillo in the NBC television series Miami Vice (1984) (1984-1989), Olmos has been seen in numerous film and television productions. He received an Academy Award nomination for Best Actor for his starring role in Stand and Deliver (1988). Most notable of his recent offerings is American Me (1992), which was also his directing debut. But acting, directing and screenwriting are only parts of what he does. Olmos contends he would much rather be known as an activist than an actor. He devotes much of his time to causes, particularly those focusing on the needs and rights of children. He makes, on average, some 150 personal appearances a year to places where he can reach kids at risk; juvenile halls, detention centers, boys/girls clubs, schools. Anywhere he can get across his message that \"we all have a choice\" about where life takes us. Olmos stresses the importance of education, the risks of gang life and tries to promote the notion of taking responsibility for one's own actions and one's own happiness in life. Using his own \"disadvantaged background\" as an example (he grew up in East Los Angeles, infamous for its gang problems), he tells the kids, \"If I can do it, so can you\". And he tries to point them in a positive direction. He has served as an ambassador for UNICEF and has received numerous accolades for his activism. He will long be remembered for getting out in the thick of the Los Angeles Riots of 1992 with his broom: one calm, reasonable presence in the midst of chaos and gunfire. Edward James Olmos was married to actress Lorraine Bracco. Between them they have 6 children, ages 10 - 25.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzODQzODQ4OF5BMl5BanBnXkFtZTcwMDczMTkxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001579","name":"Edward James Olmos","nicknames":["EJO","Ed","Eddie"],"idIMDB":"nm0001579"},"actorId":"nm0001579","character":"Abraham Quintanilla","urlCharacter":"http://www.imdb.com/character/ch0457451","main":true},{"actorName":"Jacob Vargas","urlProfile":"http://www.imdb.com/name/nm0889846","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNDA0Njk3OF5BMl5BanBnXkFtZTgwMTQ1OTE5NjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1971","placeOfBirth":" Michoacan, Mexico","height":"5' 7½\" (1.71 m)","bio":"Jacob Vargas began his acting career when he was discovered breakdancing in a schoolyard at age 12. His introduction to acting came with a bit part as a breakdancer on the hit TV show Diff'rent Strokes (1978). In 1995 he won the very first ALMA Award (for Emerging Artist of the Year) for his work in both Allison Anders' Mi vida loca (1993) and Gregory Nava's My Family (1995). He later starred in films such as Selena (1997), Get Shorty (1995), American Me (1992), Romy and Michele's High School Reunion (1997) and the cult favorite Next Friday (2000) as Ice Cube's nemesis, Joker. He later shined as Tijuana cop Manolo, 'Benicio del Toro''s partner in Steven Soderbergh's Academy Award- winning film Traffic (2000), which earned him a Screen Actors Guild Award and another ALMA Award. He then made us laugh as Sammy the chef in John Moore's Flight of the Phoenix (2004) and brought depth to Marine sniper Cortez in Academy Award-winning director Sam Mendes' war drama Jarhead (2005). In 2006 he starred as a straight-arrow DEA agent opposite Laurence Fishburne and Paul Walker in the action drama _Death and Life of Bobby Z, The (2006)_ and joined an all-star cast as a politically charged busboy in Emilio Estevez's historical drama Bobby (2006) and played a psychologically tortured drone pilot in Alex Rivera's sci-fi political love story _Sleep Dealer, The (2006)_. Not satisfied with just being labeled as an actor, he has also been focusing his talents on writing and producing through his production company, Third Son Productions. In 2001 he executive produced and starred in the independent film Road Dogz (2000). He also co-produced and starred in the stage play \"Latinologues\", which ran on Broadway in 2005 and is available on DVD. Through Third Son Productions, he is currently developing several feature film and television projects.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNDA0Njk3OF5BMl5BanBnXkFtZTgwMTQ1OTE5NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0889846","name":"Jacob Vargas","idIMDB":"nm0889846"},"actorId":"nm0889846","character":"Abie Quintanilla","urlCharacter":"http://www.imdb.com/character/ch0457452","main":true},{"actorName":"Pete Astudillo","urlProfile":"http://www.imdb.com/name/nm0040166","urlPhoto":"","biography":{"dateOfBirth":"1 December 1963","placeOfBirth":" Laredo, Texas, USA","bio":"Pete Astudillo was born on December 1, 1963 in Laredo, Texas, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0040166","name":"Pete Astudillo","idIMDB":"nm0040166"},"actorId":"nm0040166","character":"Himself - Dinos 1990's","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rueben Gonzáles","urlProfile":"http://www.imdb.com/name/nm0327874","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NTk1OTIxOV5BMl5BanBnXkFtZTcwNTg0NTQzOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Rueben Gonzáles is an actor and producer, known for Selena (1997), Prizzi's Honor (1985) and El topo (1970).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NTk1OTIxOV5BMl5BanBnXkFtZTcwNTg0NTQzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0327874","name":"Rueben Gonzáles","idIMDB":"nm0327874"},"actorId":"nm0327874","character":"Joe Ojeda - Dinos 1990's","urlCharacter":"http://www.imdb.com/character/ch0457454","main":true},{"actorName":"Ricky Vela","urlProfile":"http://www.imdb.com/name/nm0892218","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Ricky Vela yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0892218","name":"Ricky Vela","idIMDB":"nm0892218"},"actorId":"nm0892218","character":"Himself - Dinos 1990's","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Don Shelton","urlProfile":"http://www.imdb.com/name/nm0791326","urlPhoto":"","biography":{"bio":"Don Shelton is an actor, known for Selena (1997) and Selena Live: The Last Concert (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0791326","name":"Don Shelton","idIMDB":"nm0791326"},"actorId":"nm0791326","character":"Stage Dancer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Emanuelle","urlProfile":"http://www.imdb.com/name/nm0256056","urlPhoto":"","biography":{"bio":"Richard Emanuelle is an actor, known for Selena (1997), Hot Shots! (1991) and Ruby (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0256056","name":"Richard Emanuelle","idIMDB":"nm0256056"},"actorId":"nm0256056","character":"Concert Reporter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Panchito Gómez","urlProfile":"http://www.imdb.com/name/nm0351225","urlPhoto":"","biography":{"dateOfBirth":"2 November 1963","placeOfBirth":" New York City, New York, USA","bio":"Panchito Gómez has been working in entertainment since the age of 5. He played Antonio, one of the kids on Sesame Street Season 3 becoming the first child performer to receive billing in the credits. Gómez joined the show in 1971, when he was eight years old. Gómez was born in New York City and has appeared in several films and television including Triangle, a 1969 English-language film shot in Puerto Rico, Pepito, a 1970 Spanish-language film made in Colombia, and The Street of the Flower Boxes, an NBC special that aired in 1971. As a teenager and young adult, Gómez later played a variety of hoods and Latino gang members on Baretta, CHiPs, Simon & Simon, Barney Miller, Cagney & Lacey, and Hill Street Blues. Gomez's film work includes Selena and Mi Vida Loca.Gómez's credits also include guest spots on NYPD Blue in 2002, and CSI: Miami in 2003 and most recent short film \"Unintentional Lie\". He is also producer at Coker Productions Inc.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0351225","name":"Panchito Gómez","idIMDB":"nm0351225"},"actorId":"nm0351225","character":"Young Abraham - Dinos 1961","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Coca","urlProfile":"http://www.imdb.com/name/nm0168044","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMTc4MTg5N15BMl5BanBnXkFtZTYwMTA1Mjg0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Richard Coca was born in Los Angeles, California, USA. He is an actor, known for Minority Report (2002), The Mexican (2001) and Lone Star (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxMTc4MTg5N15BMl5BanBnXkFtZTYwMTA1Mjg0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0168044","name":"Richard Coca","idIMDB":"nm0168044"},"actorId":"nm0168044","character":"Bobby - Dinos 1961","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"George Perez","urlProfile":"http://www.imdb.com/name/nm0673497","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NzUwOTQzNV5BMl5BanBnXkFtZTcwNTkyNTI3Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 September 1972","placeOfBirth":"","bio":"Born as Jorge Antonio Perez the seventh son of 9 children that immigrated to the US in 1973 due to fathers health complications, his family settled in South Central Los Angeles, Just before his fathers death in 1980, He would be entertained by watching a young George imitate the characteristics of his older siblings, ,soon after his death his mother was faced with the challenges of raising 9 children living in a one bedroom apartment in a rough part of town. At a very young age George discovered a passion for the performing arts with his first stage performance as a Folklore dancer he later found his way to The High School of Performing Arts in Los Angeles where he received classical training in Ballet and Modern Jazz,soon after he was discovered by Kenny Ortega who gave him his first big break Starring in a Music Video with Elton John [ A Word in Spanish] at the age of 15 he reached world wide recognition. He studied at the Vincent Chase Acting Workshop for a number of years before attending the Janet Alhanti Meisner program. His first T.V. action Job was on China Beach. He later guest starred on various television shows through the 90s until his big break on the feature film \"Toy Soldiers\" Where he played a lead role opposite an all star cast. Since then he's had the privilege of working along side some of the biggest names in the film industry. To be continued...","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2NzUwOTQzNV5BMl5BanBnXkFtZTcwNTkyNTI3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0673497","name":"George Perez","idIMDB":"nm0673497"},"actorId":"nm0673497","character":"Seff - Dinos 1961","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0120094","urlIMDB":"http://www.imdb.com/title/tt0120094","business":{"budget":{"money":"$20,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$11,615,722","country":"USA","day":"23","month":"03","year":"1997","remarks":"1,850 Screens"}],"gross":[{"money":"$35,422,828","country":"USA","day":"29","month":"06","year":"1997","remarks":""},{"money":"$35,389,675","country":"USA","day":"22","month":"06","year":"1997","remarks":""},{"money":"$35,327,315","country":"USA","day":"15","month":"06","year":"1997","remarks":""},{"money":"$35,198,238","country":"USA","day":"08","month":"06","year":"1997","remarks":""},{"money":"$34,918,157","country":"USA","day":"01","month":"06","year":"1997","remarks":""},{"money":"$34,568,547","country":"USA","day":"26","month":"05","year":"1997","remarks":""},{"money":"$34,093,101","country":"USA","day":"18","month":"05","year":"1997","remarks":""},{"money":"$33,838,171","country":"USA","day":"11","month":"05","year":"1997","remarks":""},{"money":"$33,502,080","country":"USA","day":"04","month":"05","year":"1997","remarks":""},{"money":"$32,954,145","country":"USA","day":"27","month":"04","year":"1997","remarks":""},{"money":"$32,002,285","country":"USA","day":"20","month":"04","year":"1997","remarks":""},{"money":"$30,460,690","country":"USA","day":"13","month":"04","year":"1997","remarks":""},{"money":"$27,741,359","country":"USA","day":"06","month":"04","year":"1997","remarks":""},{"money":"$21,738,436","country":"USA","day":"30","month":"03","year":"1997","remarks":""},{"money":"$11,615,722","country":"USA","day":"23","month":"03","year":"1997","remarks":""}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 7 min (127 min)"],"soundMix":["DTS","Dolby Digital","SDDS"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":["V3(TM) MOE Lenses"],"laboratory":["Consolidated Film Industries (CFI), Hollywood (CA), USA","Pro8mm, Burbank (CA), USA (8 mm segments)","Technicolor, USA (prints)"],"filmLength":null,"negativeFormat":["35 mm","8 mm (some scenes)"],"cinematographicProcess":["Super 35","Super 8 (8 mm scenes)"],"printedFilmFormat":["35 mm (anamorphic)"]},"rating":"6.7","metascore":"67","filmingLocations":[{"location":"Corpus Christi, Texas, USA"}],"rated":"PG","awards":[{"award":"Golden Globes, USA 1998","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Performance by an Actress in a Motion Picture - Comedy or Musical","names":[{"name":"Jennifer Lopez","id":"nm0000182","role":null}]}]}]},{"award":"ALMA Awards 1998","titlesAwards":[{"titleAwardOutcome":"Won ALMA Award","categories":[{"category":"Outstanding Feature Film","names":[]},{"category":"Outstanding Actor in a Feature Film","names":[{"name":"Edward James Olmos","id":"nm0001579","role":null}]},{"category":"Outstanding Actress in a Feature Film","names":[{"name":"Jennifer Lopez","id":"nm0000182","role":null},{"name":"Anaconda","id":"tt0118615","role":null}]},{"category":"Outstanding Latino Director of a Feature Film","names":[{"name":"Gregory Nava","id":"nm0622695","role":null}]}]},{"titleAwardOutcome":"Nominated ALMA Award","categories":[{"category":"Outstanding Actor in a Feature Film","names":[{"name":"Jon Seda","id":"nm0781218","role":null}]},{"category":"Outstanding Actress in a Feature Film","names":[{"name":"Jackie Guerra","id":"nm0346027","role":null}]}]}]},{"award":"Grammy Awards 1998","titlesAwards":[{"titleAwardOutcome":"Nominated Grammy","categories":[{"category":"Best Instrumental Composition Written for a Motion Picture or for Television","names":[{"name":"Dave Grusin","id":"nm0006115","role":null}]}]}]},{"award":"Imagen Foundation Awards 1998","titlesAwards":[{"titleAwardOutcome":"Won Imagen Award","categories":[{"category":"Best Motion Picture","names":[]}]},{"titleAwardOutcome":"Won Lasting Image Award","categories":[{"category":"","names":[{"name":"Jennifer Lopez","id":"nm0000182","role":null}]}]}]},{"award":"Lone Star Film & Television Awards 1998","titlesAwards":[{"titleAwardOutcome":"Won Lone Star Film & Television Award","categories":[{"category":"Best Actress","names":[{"name":"Jennifer Lopez","id":"nm0000182","role":null}]},{"category":"Best Supporting Actor","names":[{"name":"Edward James Olmos","id":"nm0001579","role":null}]}]}]},{"award":"MTV Movie Awards 1998","titlesAwards":[{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best Breakthrough Performance","names":[{"name":"Jennifer Lopez","id":"nm0000182","role":null}]}]}]},{"award":"Young Artist Awards 1998","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in a Feature Film - Supporting Young Actress","names":[{"name":"Rebecca Lee Meza","id":"nm0583770","role":null}]}]}]}],"votes":"19,899","type":"Movie","companyCreditsSimple":[{"idCompany":"co0072239","name":"Q Productions"},{"idCompany":"co0061612","name":"Esparza / Katz Productions"}],"keywords":{"keywords":["singer","tejano","latin music","marriage","on tour","spanish as a second language","family band","mexican restaurant","secondhand musical instrument","cult following","rock 'n' roll","provocative clothing","father daughter duet","female drummer","female protagonist","dying young","racism","sexism","love","mexican american","dancing","female singer","racial segregation","song","singing","mother daughter relationship","husband wife relationship","flashback","family relationships","fan club","mexico","embezzlement","elopement","bustier","band","domineering father","tour bus","texas","restaurant","murder","haircut","first love","father daughter relationship","1980s","1960s","rising star","hispanic","tragedy","character name in title","forename as title","loss of loved one","sister sister relationship","dysfunctional family"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 06:29:28"}}