{"data":{"movies":[{"title":"Babylon 5: The River of Souls","originalTitle":"","year":"1998","releaseDate":"19981108","directors":[{"name":"Janet Greek","id":"nm0337550"}],"writers":[{"name":"J. Michael Straczynski","id":"nm0833089"},{"name":"J. Michael Straczynski","id":"nm0833089"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMTYwNTAzM15BMl5BanBnXkFtZTcwMjc0ODAyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Drama","Sci-Fi"],"plot":"Captain Lochley now has solid proof that Garibaldi is a disaster magnet: when he comes to the station to meet with one of his new company's subordinates, she's being sued by the owner of an illegal virtual reality \"holo-brothel\" and besieged by Soul Hunters looking for one of their soul vessels, this one containing the souls of the long-lost Ralga alien species.","simplePlot":"A group of Soul Hunters come to Babylon 5 demanding the return of something that was stolen from them.","actors":[{"actorName":"Jerry Doyle","urlProfile":"http://www.imdb.com/name/nm0236381","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIwNDcyNzA0NV5BMl5BanBnXkFtZTYwMTMyMjAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1956","placeOfBirth":" Brooklyn, New York, USA","height":"6' 3\" (1.91 m)","bio":"Jerry Doyle was born on July 16, 1956 in Brooklyn, New York, USA. He was an actor, known for Babylon 5 (1994), Babylon 5: The River of Souls (1998) and Babylon 5: The Gathering (1993). He was married to Andrea Thompson. He died on July 27, 2016 in Las Vegas, Nevada, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIwNDcyNzA0NV5BMl5BanBnXkFtZTYwMTMyMjAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0236381","name":"Jerry Doyle","idIMDB":"nm0236381"},"actorId":"nm0236381","character":"Michael Alfredo Garibaldi","urlCharacter":"http://www.imdb.com/character/ch0012582","main":true},{"actorName":"Tracy Scoggins","urlProfile":"http://www.imdb.com/name/nm0001712","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNDQ2MTQ3OV5BMl5BanBnXkFtZTgwMjcyMDQzOTE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1953","placeOfBirth":" Galveston, Texas, USA","birthName":"Tracy Dawn Scoggins","height":"5' 8\" (1.73 m)","bio":"Tracy Dawn Scoggins was born and raised in Dickinson, Texas. At age 16, she enrolled in Southwest Texas State, where she studied speech communications and physical education. After leaving college, she was hired by the Elite Modeling Agency and sent to New York City. After one year, she continued her modeling career with assignments in Italy, France and Germany. Later, she decided to return to the United States to study acting. She attended the Wynn Handman Studio and the Herbert Berghof Studio -- both well-known acting schools. After completing her training, she moved to Hollywood where she has become internationally known as a television and movie star. Today, she resides in Los Angeles, California and spends her free time developing workout videos, cycle riding, swimming and jogging.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNDQ2MTQ3OV5BMl5BanBnXkFtZTgwMjcyMDQzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001712","name":"Tracy Scoggins","idIMDB":"nm0001712"},"actorId":"nm0001712","character":"Capt. Elizabeth Lochley","urlCharacter":"http://www.imdb.com/character/ch0012567","main":true},{"actorName":"Jeff Conaway","urlProfile":"http://www.imdb.com/name/nm0001063","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNTI1Njc2NF5BMl5BanBnXkFtZTcwMTgzMzE0NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1950","placeOfBirth":" New York City, New York, USA","birthName":"Jeffery Charles William Michael Conaway","height":"6' 1½\" (1.87 m)","bio":"Jeff Conaway was born on October 5, 1950 in New York City, New York, USA as Jeffery Charles William Michael Conaway. He was an actor, known for Grease (1978), Taxi (1978) and Babylon 5 (1994). He was married to Kerri Young and Rona Newton-John. He died on May 27, 2011 in Encino, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNTI1Njc2NF5BMl5BanBnXkFtZTcwMTgzMzE0NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001063","name":"Jeff Conaway","idIMDB":"nm0001063"},"actorId":"nm0001063","character":"Zack Allen","urlCharacter":"http://www.imdb.com/character/ch0012569","main":true},{"actorName":"Richard Biggs","urlProfile":"http://www.imdb.com/name/nm0081863","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1Nzg1MTE5OTleQTJeQWpwZ15BbWU4MDM1OTg0NTIx._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 March 1960","placeOfBirth":" Columbus, Ohio, USA","birthName":"Richard T. Biggs","height":"5' 10\" (1.78 m)","bio":"Richard Biggs had a somewhat unsettled childhood as he travelled between Air Force bases where his father was stationed. Because of his itinerant lifestyle he made few friends and changed schools often. When he was seventeen, and living at a missile base in North Dakota, he decided to change his plans for a medical career after playing the lead in a local theatrical production of 'The Wiz'. After that, bitten by the acting bug and never deterred by deafness in one ear, he went on to complete a Bachelor of Fine Arts (majoring in performing arts) at USC's School of Theatre, with the distinguished actor John Houseman as one of his drama teachers. He later went on to give his own acting classes at the Will Geer Theatricum Botanicum in Topanga Canyon. Like so many other aspiring performers, Richard had a tough time in his quest to get started in his chosen field. His chief difficulty lay in obtaining membership in the Screen Actor's Guild without experience, yet how was one to acquire experience without a union card ? Living in his car for much of this time, he made ends meet by playing small roles on stage, and, occasionally television. He also worked for a while as a telephone operator answering complaints for an LA waste disposal company. One of his local stage performances, as Romeo at the Ensemble Theatre, impressed an agent who took him on and landed him an audition for a part on the daytime soap opera Days of Our Lives (1965). Several auditions later, he got the part, and the SAG card as well. For most of his career on television, Richard played doctors, an irony which was probably not lost on him: Dr.Tomson in The Twilight Zone (1985), Dr. Lecksis in Beverly Hills, 90210 (1990), Dr.Milo Morton in \"Strong Medicine\", and, of course, Dr.Marcus Hunter, in 1295 episodes of 'Days of Our Lives', from 1985 to 1992. Richard had done his homework for the part by observing a real plastic surgeon in action. However, having played the same individual for such a lengthy period led him later to express doubts about the one-dimensional 'goody two-shoes' nature of the character, who he would have preferred a little 'rougher around the edges'. A far edgier and more complex part was that of Dr.Stephen Franklin, the chief medical officer of J. Michael Straczynski's cult sci-fi series Babylon 5 (1994). Richard played the humanly flawed, but mercurial character from 1994 to 1998 (also in three made-for-TV movies, and, briefly, in the short-lived spin-off series Crusade (1999), as part of a first-rate ensemble cast. His performances were often extremely compelling, particularly in the 'walkabout' episodes of season three, culminating with 'Shadow Dancing'. Post-Babylon, Richard played a detective in Any Day Now (1998), returned to soap opera as Clayton Boudreaux in Guiding Light (1952) and had a brief run as a scientist in the unsuccessful TV spin-off Tremors (2003). The character in his last series, Strong Medicine (2000), was killed off in the show because of the actor's tragic, untimely death at the age of 44. Richard Biggs was eulogised by Babylon 5's Straczysnky as a 'consummate professional' and 'quite simply, a terrific guy'.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1Nzg1MTE5OTleQTJeQWpwZ15BbWU4MDM1OTg0NTIx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0081863","name":"Richard Biggs","idIMDB":"nm0081863"},"actorId":"nm0081863","character":"Stephen Franklin, M.D.","urlCharacter":"http://www.imdb.com/character/ch0012580","main":true},{"actorName":"Ian McShane","urlProfile":"http://www.imdb.com/name/nm0574534","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGUzYmJiMmQtNTRlNC00ZWEwLTgzY2ItZDMwZTdkMGE4Zjc0L2ltYWdlXkEyXkFqcGdeQXVyNzE0OTI2MzY@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1942","placeOfBirth":" Blackburn, Lancashire, England, UK","height":"5' 7½\" (1.71 m)","bio":"From a lawless, foul-mouthed saloon owner in \"Deadwood\" to a tough no-nonsense British gangster in \"Sexy Beast,\" Ian McShane has virtually cornered the market on playing rogues, villains and all-around bad asses. A natural at portraying complex anti-heroes and charismatic heavies, the classically trained actor was born in Blackburn, Lancashire, England, to parents Irene (Cowley) and Harry McShane, a soccer player for Manchester United. McShane caught his first break in 1962 when he landed a lead role in \"The Wild and the Willing.\" McShane later revealed that he had ditched class at the Royal Academy of Dramatic Art to audition for the role. Since then, the award-winning actor has gone on to grab the attention of audiences and critics alike with his unforgettable portrayals of scoundrels, kings, killers, and thieves. Coming soon, McShane will be reprising his role as club owner/ex-assassin Winston opposite Keanu Reeves in \"John Wick: Chapter 2\" in the film by director Chad Stahelski. He plays Leland, a retired sheriff with violent tendencies, opposite Patrick Wilson in \"The Hollow Point,\" the gritty drama directed by Gonzalo López-Gallego. Also, expect to see McShane in the upcoming films \"Jawbone,\" \"Bolden!\" and opposite Michael Shannon in \"Pottersville.\" On television, McShane next stars as Mr. Wednesday in Neil Gaiman's \"American Gods,\" the highly-anticipated event series for Starz produced by Michael Green and Bryan Fuller. \"Actor. Icon. And now god. It is a goddamn delight to be collaborating with the incomparable Ian McShane,\" said Michael Green recently. McShane previously starred in the Michael Green series \"Kings\" for NBC. McShane will also be seen opposite Dr. Dre for Apple TV's first scripted series \"Vital Signs,\" a semi-autobiographical series loosely based on the hip-hop icon's life. McShane's formidable acting resume is as long as it is varied. McShane starred as the notoriously fearsome pirate Blackbeard opposite Johnny Depp in Disney's worldwide blockbuster hit \"Pirates of the Caribbean: On Stranger Tides.\" He starred as priest/prophet/warrior Amphiarus opposite Dwayne Johnson in MGM's \"Hercules,\" played lead dwarf Beith in the dark fantasy flick \"Snow White and the Huntsman,\" and portrayed good King Bramwell in Bryan Singer's modern-day fairytale \"Jack the Giant Slayer.\" McShane also appeared as Joe Strombel in Woody Allen's \"Scoop.\" His universally praised performance as tough guy Teddy Bass in the cult indie hit \"Sexy Beast\" led one London critic to dub McShane as \"The King of Cool.\" In a change of pace, he portrayed soft-spoken Meredith in the darkly perverse crime drama \"44 Inch Chest,\" a film in which McShane not only starred, but also produced. McShane has also had a long and diverse career on both British and American television. Earning considerable critical acclaim as the fierce yet charismatic Al Swearengen in the much-loved David Milch HBO series \"Deadwood,\" McShane went on to win the Golden Globe Award for Best Performance by an Actor in a Drama Series. His compelling and gritty portrayal also scored him nominations for both Emmy and SAG Awards. He went on to collect yet another Golden Globe nomination for Best Actor in a Miniseries for his riveting portrayal of the scheming, corrupt Waleran Bigod in Starz' Emmy-nominated \"Pillars of the Earth.\" McShane also won over viewers in FX's \"American Horror Story\" as the very bad Santa/serial killer Leigh Emerson and as cold-blooded billionaire Andrew Finney opposite Liev Schreiber in Showtime's acclaimed series \"Ray Donovan.\" More recently, he portrayed Sir Roger Scatcherd in the Julian Fellows' miniseries \"Dr. Thorne\" for ITV and also made an appearance as peacenik Brother Ray in HBO's juggernaut \"Game of Thrones.\" Earlier in his television career McShane produced and starred as the irresistible rogue antiques dealer in the acclaimed series \"Lovejoy\" for the BBC and A&E, even directing several episodes himself. The show was one of the first independent co-productions with the BBC and aired in both the U.S. and U.K. Other notable portrayals on television have included his appearance in the landmark, blockbuster miniseries \"Roots\" and as Ken Harrison in \"Whose Life is it Anyway?\" McShane also played Sejanus in the miniseries \"A.D.,\" the eponymous \"Disraeli,\" produced by Masterpiece Theater, and Judas in NBC's \"Jesus of Nazareth.\" An accomplished, award-wining stage actor, McShane made his West End debut in \"The Promise,\" co-starring Dame Judi Dench and Sir Ian McKellen. The play went on to open on Broadway the following year. McShane also charmed audiences in the West End musical \"The Witches of Eastwick,\" originating the role of the seductive, sex-obsessed Darryl Van Horne on stage in London. At the esteemed L.A. Matrix Theatre, McShane appeared in Harold Pinter's \"Betrayal,\" Larry Atlas' \"Yield of the Long Bond\", as well as in John Osborne's \"Inadmissible Evidence,\" picking up a couple of Los Angeles Drama Critics' Awards for Lead Performance in the process. In addition, McShane appeared in the 40th Anniversary revival of Harold Pinter's \"The Homecoming\" on Broadway. With his low, distinctive voice, McShane has also made his mark in film and television as a voiceover artist. He narrated Disney's \"The Sorcerer's Apprentice,\" brought life to the eccentric magician Mr. Bobinsky in \"Coraline,\" and added a sinister edge to Tai Lung in \"Kung Fu Panda.\" McShane has also let his rich baritone to \"The Golden Compass,\" as well as to \"Shrek The Third\" as the notorious Captain Hook.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNGUzYmJiMmQtNTRlNC00ZWEwLTgzY2ItZDMwZTdkMGE4Zjc0L2ltYWdlXkEyXkFqcGdeQXVyNzE0OTI2MzY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0574534","name":"Ian McShane","idIMDB":"nm0574534"},"actorId":"nm0574534","character":"Robert Bryson, Ph.D.","urlCharacter":"http://www.imdb.com/character/ch0357770","main":true},{"actorName":"Martin Sheen","urlProfile":"http://www.imdb.com/name/nm0000640","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM1MTA5MTY0MV5BMl5BanBnXkFtZTcwMTQ4OTUzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 August 1940","placeOfBirth":" Dayton, Ohio, USA","birthName":"Ramon Antonio Gerard Estevez","height":"5' 7\" (1.7 m)","bio":"Multiple Emmy- and Golden Globe-winner Martin Sheen is one of America's most celebrated, colorful, and accomplished actors. Moving flawlessly between artistic mediums, Sheen's acting range is striking. Sheen was born Ramón Antonio Gerard Estevez in Dayton, Ohio, to Mary-Ann (Phelan), an Irish immigrant (from Borrisokane, County Tipperary), and Francisco Estevez, a Spanish-born factory worker and machinery inspector (from Parderrubias, Galicia). On the big screen, Sheen has appeared in more than 65 feature films including a star turn as Army Captain Benjamin L. Willard in Francis Ford Coppola's landmark film Apocalypse Now (1979), which brought Sheen worldwide recognition. The film also starred Marlon Brando, Dennis Hopper and Robert Duvall. Other notable credits include Wall Street (1987) (with son Charlie Sheen and Michael Douglas), Academy Award-winning film Gandhi (1982) (with Sir Ben Kingsley), Catch Me If You Can (2002) (with Leonardo DiCaprio and Tom Hanks), The American President (1995) (with Michael Douglas and Annette Bening) and a Golden Globe nominated breakthrough performance as Timmy Cleary in The Subject Was Roses (1968), a role he originated on Broadway and for which he received a Tony Award nomination as Best Featured Actor. In 2006, the actor played ill-fated cop Oliver Queenan in Martin Scorsese's Academy Award-winning film The Departed (2006) opposite Leonardo DiCaprio, Matt Damon, Jack Nicholson, Mark Wahlberg and Alec Baldwin. The same year, Sheen joined another all-star ensemble cast for the highly acclaimed feature Bobby (2006), written and directed by his son 'Emilio Estevez'. Bobby was nominated for a Golden Globe Award and a SAG Award; and starred Anthony Hopkins, Harry Belafonte, Laurence Fishburne, Sharon Stone, William H. Macy, Elijah Wood, Demi Moore and Heather Graham. For television audiences, Sheen is best recognized for his six-time Emmy nominated performance as President Josiah Bartlet in The West Wing (1999). Sheen won six of his eight Golden Globe nominations as well as an ALMA Award; and two individual SAG Awards; for the White House series. He won the Golden Globe Award for Best Performance by an Actor TV Series Drama in 2001. Of his ten Primetime Emmy nominations, Sheen won for Outstanding Guest Actor in a Comedy Series on the long-running sitcom Murphy Brown (1988) (starring Candice Bergen) in 1994. In addition, he has garnered a Daytime Emmy Award for directing and another for performance. In 2006, Sheen was again nominated for an Emmy for Outstanding Guest Actor in a Comedy Series; this time for the CBS hit comedy Two and a Half Men (2003), starring his son Charlie Sheen. In addition to series television, Sheen has appeared in several important made-for-television movies and mini-series including playing President John F. Kennedy in the television mini-series Kennedy (1983) for which he received a Golden Globe nomination.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM1MTA5MTY0MV5BMl5BanBnXkFtZTcwMTQ4OTUzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000640","name":"Martin Sheen","idIMDB":"nm0000640"},"actorId":"nm0000640","character":"Soul Hunter","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeff Doucette","urlProfile":"http://www.imdb.com/name/nm0234731","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MzQzNTU5M15BMl5BanBnXkFtZTYwMzU2MDgy._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 November 1947","placeOfBirth":" Milwaukee, Wisconsin, USA","bio":"Jeff Doucette was born on November 25, 1947 in Milwaukee, Wisconsin, USA. He is an actor and writer, known for Bedazzled (2000), Splash (1984) and Doctor Dolittle (1998). He has been married to Saba Moor-Doucette since July 2003. He was previously married to Kathleen Kelley.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MzQzNTU5M15BMl5BanBnXkFtZTYwMzU2MDgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0234731","name":"Jeff Doucette","idIMDB":"nm0234731"},"actorId":"nm0234731","character":"2nd Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wayne Alexander","urlProfile":"http://www.imdb.com/name/nm0018795","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwNTE2MDcwNF5BMl5BanBnXkFtZTgwNDA5ODQ1MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"Wayne Alexander grew up in the San Joaquin Valley in California. He trained at Los Angeles City College Theater Academy, then spent four years at San Francisco's American Conservatory Theater. He later worked as a fight choreographer and did stage work both in Los Angeles and New York. In the late 1980s he made the switch to film and TV.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwNTE2MDcwNF5BMl5BanBnXkFtZTgwNDA5ODQ1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0018795","name":"Wayne Alexander","idIMDB":"nm0018795"},"actorId":"nm0018795","character":"Soul One","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bob Amaral","urlProfile":"http://www.imdb.com/name/nm0023969","urlPhoto":"","biography":{"bio":"Bob Amaral is an actor, known for Babylon 5: The River of Souls (1998), Heart and Souls (1993) and L.A. Twister (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0023969","name":"Bob Amaral","idIMDB":"nm0023969"},"actorId":"nm0023969","character":"Customer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Beege Barkette","urlProfile":"http://www.imdb.com/name/nm0055021","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMzk0ODg4N15BMl5BanBnXkFtZTgwMDg1NDU0MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 October 1950","placeOfBirth":" Ozark, Alabama, USA","bio":"Beege Barkette was born on October 8, 1950 in Ozark, Alabama, USA. She is an actress, known for The Fabulous Baker Boys (1989), Babylon 5: The River of Souls (1998) and The Frisco Kid (1979).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMzk0ODg4N15BMl5BanBnXkFtZTgwMDg1NDU0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0055021","name":"Beege Barkette","idIMDB":"nm0055021"},"actorId":"nm0055021","character":"Woman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joel Brooks","urlProfile":"http://www.imdb.com/name/nm0112063","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MzIyNTU3OF5BMl5BanBnXkFtZTcwMzU0OTA2Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1949","placeOfBirth":" New York City, New York, USA","bio":"Joel Brooks was born on December 17, 1949 in New York City, New York, USA. He is an actor, known for Indecent Proposal (1993), My Sister Sam (1986) and Door to Door (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MzIyNTU3OF5BMl5BanBnXkFtZTcwMzU0OTA2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0112063","name":"Joel Brooks","idIMDB":"nm0112063"},"actorId":"nm0112063","character":"Jacob Mayhew","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Josh Coxx","urlProfile":"http://www.imdb.com/name/nm0185104","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNTcyMjAxN15BMl5BanBnXkFtZTgwNzU1ODA1NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 April 1964","placeOfBirth":" Manhattan, New York City, New York, USA","height":"6' 2\" (1.88 m)","bio":"Josh Coxx is an American Actor and Director. He was born in New York City and graduated from the prestigious Actor Training Conservatory at S.U.N.Y. Purchase College alongside fellow classmate Edie Falco. His fellow alumni include Stanley Tucci, Wesley Snipes, Ving Rhames, Melissa Leo & Steven Weber. He is known for Strong Medicine (2000) Thor (2011) Babylon 5 (1994) He is also an avid Surfer and a Helicopter Rescue level 1 trained Scuba Diver.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwNTcyMjAxN15BMl5BanBnXkFtZTgwNzU1ODA1NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0185104","name":"Josh Coxx","idIMDB":"nm0185104"},"actorId":"nm0185104","character":"Lt. David Corwin","urlCharacter":"http://www.imdb.com/character/ch0012585","main":true},{"actorName":"T.J. Hoban","urlProfile":"http://www.imdb.com/name/nm0387543","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcyMDc3NDg0MF5BMl5BanBnXkFtZTgwNDM2NDM0MDI@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1972","placeOfBirth":"","height":"5' 11\" (1.8 m)","bio":"TJ Hoban is an actor, writer, and fitness model born in Chicago December, 16 1978. He's best known for his recurring role as Rex on It's Always Sunny in Philadelphia (2008-2013) and is considered one of the top fitness models in the industry, appearing on over 100 fitness magazine covers. His first acting role was in Babylon 5: The River of Souls (1998) as Durfal, a male hologram opposite Nikki Ziering. He's the writer, producer, and lead actor of slapstick comedy Venice Heat (2011). TJ resides in Los Angeles where he continues to further his acting and fitness career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcyMDc3NDg0MF5BMl5BanBnXkFtZTgwNDM2NDM0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0387543","name":"T.J. Hoban","nicknames":["Mr. Abs"],"idIMDB":"nm0387543"},"actorId":"nm0387543","character":"Male Hologram","urlCharacter":"http://www.imdb.com/character/ch0025042","main":true},{"actorName":"Stuart Pankin","urlProfile":"http://www.imdb.com/name/nm0659573","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjQ3NDEwM15BMl5BanBnXkFtZTcwMTQxNjg0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1946","placeOfBirth":" Philadelphia, Pennsylvania, USA","height":"5' 7\" (1.7 m)","bio":"A familiar face on both the big and small screen, comic character actor Stuart Pankin is a five-time nominated, CableAce Award winner for HBO's award-winning series \"Not Necessarily The News.\" He is well-known for providing the voice of Earl Sinclair, the blustery father, on the Emmy award-winning \"Dinosaurs.\" (He sang on, and composed two songs for, the Disney album \"Dinosaurs: The Big Songs\", and performed Earl on the \"Dinosaurs: Classic Tales\" tape release.) Best-known film (member: AMPAS) credits include \"Honey We Shrunk Ourselves\" (the first live action made-for-video feature), \"The Hollywood Knights,\" \"Mannequin on the Move,\" \"The Dirt Bike Kid,\" \"Second Sight,\" \"Encounter in the Third Dimension\" and \"Misadventures in 3-D\" (IMAX 3-D movies) as the live Professor, and voice of the adorable animated robot. A series regular on nine prime time television productions and pilots (member: ATAS), he has guest starred on over 300 television shows. He has also provided many cartoon voices for the popular series \"Animaniacs,\" \"Batman,\" \"Superman,\" \"Aladdin,\" \"Lilo and Stitch\" and \"Darkwing Duck.\" On stage, Stuart has performed with the New York Shakespeare Festival, the Brooklyn Academy of Music Repertory Company, the American Place Theatre, the Repertory Company of Lincoln Center, and the Folger Shakespeare Theatre, with \"The Winter's Tale\" \"The Inspector General,\" \"Bartholomew Fair\" and \"The Three Sisters\" among his favorites. He created the roles of Reuben and Queen Victoria in the New York premiere of Andrew Lloyd Weber's \"Joseph and the Amazing Technicolor Dreamcoat.\" He starred in over thirty-five Off Broadway, summer, and regional theatre productions. Stuart starred in, co-wrote and co-executive produced the Stuart Pankin Cinemax Comedy Experiment (\"Hump!\" the musical comedy version of \"Richard III\"), in which he played five roles, and sang his own original music. The Electronic Retail Association nominated him for Best Celebrity Presenter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMjQ3NDEwM15BMl5BanBnXkFtZTcwMTQxNjg0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0659573","name":"Stuart Pankin","idIMDB":"nm0659573"},"actorId":"nm0659573","character":"James Riley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ray Proscia","urlProfile":"http://www.imdb.com/name/nm0698727","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1ODEyNTAxOF5BMl5BanBnXkFtZTgwMTYzMDI2MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 2\" (1.88 m)","bio":"Ray Proscia is an actor and producer, known for The Man in the High Castle (2015), Think Like a Man Too (2014) and Vanilla Sky (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1ODEyNTAxOF5BMl5BanBnXkFtZTgwMTYzMDI2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0698727","name":"Ray Proscia","idIMDB":"nm0698727"},"actorId":"nm0698727","character":"Klaus","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0146247","urlIMDB":"http://www.imdb.com/title/tt0146247","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":"21","month":"04","year":"1998","remarks":null},"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 34 min (94 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.6","filmingLocations":[],"awards":[{"award":"ALMA Awards 1999","titlesAwards":[{"titleAwardOutcome":"Nominated ALMA Award","categories":[{"category":"Outstanding Individual Performance in a Made-for-Television Movie or Mini-Series in a Crossover Role","names":[{"name":"Martin Sheen","id":"nm0000640","role":null}]}]}]}],"votes":"3,543","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0039264","name":"Babylonian Productions"},{"idCompany":"co0009512","name":"TNT"}],"keywords":{"keywords":["space opera","outer space","23rd century","sequel","space station","future","digit in title","cult film","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:59:21"}}