{"data":{"movies":[{"title":"Alligator II: The Mutation","originalTitle":"","year":"1991","releaseDate":"19910705","directors":[{"name":"Jon Hess","id":"nm0381489"}],"writers":[{"name":"Curt Allen","id":"nm0020397"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTdkOTViYzQtOWNiYi00MmY3LTkyYjEtMDdmMjMzZWNkNGNhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Sci-Fi"],"plot":"A giant alligator runs riot in a small town with a lake connected to a sewer/drainage system. Typical plot; nobody believes the sightings until lots of people have been killed.","simplePlot":"A giant alligator runs riot in a small town with a lake connected to a sewer/drainage system. Typical plot; nobody believes the sightings until lots of people have been killed.","actors":[{"actorName":"Joseph Bologna","urlProfile":"http://www.imdb.com/name/nm0004767","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1ODk4NTU3Ml5BMl5BanBnXkFtZTcwNjU5Njg5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 December 1934","placeOfBirth":" Brooklyn, New York, USA","birthName":"Joseph J. Bologna","height":"6' 1\" (1.85 m)","bio":"Before signing with director Stanley Donen to play Michael Caine's libidinous best friend in Blame It on Rio (1984), Joe Bologna netted rave reviews for his Sid Caesar send-up in the well-received comedy My Favorite Year (1982) with Peter O'Toole. Well known as both a writer and an actor, Bologna dates his interest in the theater from his student days at Brown University, when a casting notice called for \"non-actor\" types to fill roles in a stage production of \"Stalag 17.\" He landed the leading part but did not act again for ten years. Bologna graduated from Brown with a degree in art history, and a tour with the Marines followed. When he was discharged from the service, he started directing short films and writing special comedy material. \"A monologue is the hardest thing in the world to write, because you're only as good as your last joke,\" explains Bologna. \"That's why comedians are so neurotic.\" Bologna made his Broadway debut as the star and co-author of the comedy smash \"Lovers and Other Strangers.\" Together with his wife Renée Taylor, he wrote and starred in Made for Each Other (1971). His other film credits include roles in Cops and Robbers (1973), Honor Thy Father (1973), The Big Bus (1976) and Chapter Two (1979). He also co-starred with Taylor in the Emmy-winning television special \"Acts of Love and Other Comedies,\" which they wrote together, and then starred in the made-for-television movie Torn Between Two Lovers (1979) with Lee Remick, before reuniting with Taylor in the critically acclaimed Broadway hit \"It Had To Be You.\" From there it was back to television for the CBS TV movie One Cooks, the Other Doesn't (1983) with Suzanne Pleshette. In 1991 he starred with Matt LeBlanc in Top of the Heap (1991), a spin-off from the hit series Married with Children (1987), but it didn't click with audiences the way \"MWC\" did and was canceled rather quickly.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1ODk4NTU3Ml5BMl5BanBnXkFtZTcwNjU5Njg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004767","name":"Joseph Bologna","idIMDB":"nm0004767"},"actorId":"nm0004767","character":"David Hodges","urlCharacter":"http://www.imdb.com/character/ch0246316","main":true},{"actorName":"Dee Wallace","urlProfile":"http://www.imdb.com/name/nm0908914","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3YmE4ZDAtYzFiOS00M2E3LThjMTItYzE1OWZhY2FiMTg2XkEyXkFqcGdeQXVyMjkxNzgyMDU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1948","placeOfBirth":" Kansas City, Kansas, USA","birthName":"Deanna Lee Bowers","height":"5' 4\" (1.63 m)","bio":"This attractive, happy go lucky blonde actress, educated at the University of Kansas and a former ballet soloist, first broke into both TV and cinema screens in the mid 1970s and through her appearances in several well remembered horror and sci-fi films, and Dee quickly gained a cult following among the fantasy film fans. Poor Dee always seemed to be on the wrong side of some malevolent person or evil creature....she was pursued by a clan of cannibal killers in The Hills Have Eyes (1977), terrorized by a pack of werewolves in the superb The Howling (1981), got a break from the horror, as a sympathetic mom in the mega sci-fi hit E.T. the Extra-Terrestrial (1982), and nearly ends up lunch for a rabid St. Bernard in the heart stopping Cujo (1983). In the early 1980s, Wallace-Stone actually shared the screen several times with her then husband Christopher Stone before his unfortunate, early demise from a heart attack in October, 1995. However, typecasting Dee Wallace-Stone as a horror heroine does not do her justice, as unlike some other scream queens whose careers quickly faded, Dee has gone on to have a very busy and varied acting career, appearing in over 90 feature films to date! Her All-American looks and easy going demeanor has seen Dee often cast as a typical suburban mother, a sympathetic friend, or a trusted ally. Fans warm to her endearing smile and natural warmth, and Dee continues to find herself in constant demand in front of the camera, plus she has her own much visited website.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3YmE4ZDAtYzFiOS00M2E3LThjMTItYzE1OWZhY2FiMTg2XkEyXkFqcGdeQXVyMjkxNzgyMDU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0908914","name":"Dee Wallace","idIMDB":"nm0908914"},"actorId":"nm0908914","character":"Christine Hodges","urlCharacter":"http://www.imdb.com/character/ch0246317","main":true},{"actorName":"Richard Lynch","urlProfile":"http://www.imdb.com/name/nm0528433","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MjY3MzQ2MF5BMl5BanBnXkFtZTcwNzAzNDYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 February 1940","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Richard Hugh Lynch","height":"6' (1.83 m)","bio":"Richard Hugh Lynch was born on February 12, 1940 in Brooklyn, New York City, to Irish immigrant parents. He was one of seven children. Before starting a career as an actor, he joined the United States Marine Corps in 1958. He served for four years where he made Corporal, and did a tour of the Middle East with the Sixth Fleet. He began his training with Herbert Berghof and Uta Hagen at H.B. Studios in New York's Greenwich Village, and later went on to train extensively with Lee Strasberg at Carnegie Hall. In 1970, he became a lifetime member of the Actors Studio and spent years in the New York theater community playing in dozens of on- and off-Broadway productions. The more notable plays were: \"The Basic Training of Pavlo Hummel\", \"The Lion in Winter\", \"The Devils\", \"The Lady from the Sea\", \"Action\", \"Live Like Pigs\", \"Richard III\", \"Offi on a Tangerine\", \"A View from the Bridge\", \"The Man with the Flower in His Mouth\", and Shelley Winters' \"One Night Stands of a Noisy Passenger\". Lynch made his film debut in the classic film Scarecrow (1973), winner of the Grand Prix Award at the Cannes Film Festival. His performance in Scarecrow launched his film career and brought him to Hollywood, where he has worked in film and television for over twenty years. His more prominent film work has been in: The Seven-Ups (1973), La chasse est ouverte (1974), La formule (1980), Invasion U.S.A. (1985), Bad Dreams (1988), Little Nikita (1988), Dostoyevsky's Crime and Punishment (2002), and William Peter Blatty's The Ninth Configuration (1980). His performance as the evil King Cromwell, in the successful fantasy film The Sword and the Sorcerer (1982), won him the Saturn Award for Best Actor from the Academy of Science Fiction and Fantasy. Although best known for playing villains, he was cast as the President of the United States in Mil Mascaras vs. the Aztec Mummy (2007). He also starred in numerous television series and Movies of the Week, such as Alcatraz: The Whole Shocking Story (1980), Sizzle (1981), Vampire (1979), Buck Rogers in the 25th Century (1979), Battlestar Galactica (1978), and the Star Trek: The Next Generation (1987) two-part episode \"Gambit\". His work in a variety of independent films has won him a high profile internationally. He has also worked in China, where he played in the first joint production between the Screen Actors' Guild and the People's Republic of China, The Korean Project. In his spare time, Richard enjoys fishing, the arts, architecture, music and poetry. He is also fluent in several languages including German and Italian.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5MjY3MzQ2MF5BMl5BanBnXkFtZTcwNzAzNDYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0528433","name":"Richard Lynch","idIMDB":"nm0528433"},"actorId":"nm0528433","character":"Hawk Hawkins","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Woody Brown","urlProfile":"http://www.imdb.com/name/nm0101427","urlPhoto":"","biography":{"dateOfBirth":"21 February 1956","placeOfBirth":" Dayton, Ohio, USA","birthName":"Woodward Allen Brown","bio":"Woody Brown was born on February 21, 1956 in Dayton, Ohio, USA as Woodward Allen Brown. He is an actor and writer, known for Flamingo Road (1980), Les accusés (1988) and Secret Games 3 (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0101427","name":"Woody Brown","idIMDB":"nm0101427"},"actorId":"nm0101427","character":"Rich Harmon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Holly Gagnier","urlProfile":"http://www.imdb.com/name/nm0300939","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyOWZlNjgtMWU0ZS00M2I5LTlkY2EtYjU1ZTgxZDA5NzRkXkEyXkFqcGdeQXVyMTIzNzUwMzg@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1958","placeOfBirth":" Los Angeles, California, USA","birthName":"Holly Lenore Gagnier","height":"5' 4\" (1.63 m)","bio":"Holly Gagnier has established herself as a versatile actress on both coasts, appearing on stage, screen and television. She is best-known for her long stints on Days of Our Lives (1965), in the ground-breaking role of young teen mom \"Ivy Jannings\", for which she won the soap opera award for breakout new star. She went on to play \"Cassie Callison\" on One Life to Live (1968), and appeared on The Oprah Winfrey Show (1986) as one of daytime's most popular stars. She has appeared in films opposite Adrien Brody, Scott Caan, Mark Hamill and Eric McCormack. She starred in the cult classic, Girls Just Want to Have Fun (1985), as the conniving nasty \"Natalie Sands\". An accomplished professional dancer, Holly did all her own dancing in the film. Holly was a series regular on Baywatch (1989) (you won't find her in a bathing suit though, she was the quirky performance artist \"Gina Pomeroy\"), recurring roles on Middle Ages (1992), Pacific Blue (1996) and as a young teen, opposite Lynn Redgrave, on House Calls (1979). She has appeared in over 70 guest-starring roles, from comedy, Friends (1994), Wings (1990), Guys Like Us (1998) and Dream On (1990), to drama, ER (1994), House (2004) and Crossing Jordan (2001). Miss Gagnier took several years off to raise her daughter and has recently began to work again. She completed the shorts Simone (2011), Sarah's Wish (2012) and Billy and the Hurricane (2009) for which she won three consecutive best actress awards in a short at the Playhouse West Film Festival. Her project, Waiting for Goldblum (2010), which she wrote, produced, and directed, was a nominee at the 2010 Hollywood Mockfest film festival. She most recently was seen on Private Practice (2007), and the season finale of Ringer (2011), recent features include The Son of an Afghan Farmer (2012). She is a member of Playhouse West Repertory Theater, as well as an original member of the Playhouse West Comedy Improv troupe. She is most proud of her mentor-ship program, where she guides young actors on their career path.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyOWZlNjgtMWU0ZS00M2I5LTlkY2EtYjU1ZTgxZDA5NzRkXkEyXkFqcGdeQXVyMTIzNzUwMzg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0300939","name":"Holly Gagnier","idIMDB":"nm0300939"},"actorId":"nm0300939","character":"Sheri Anderson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Daily","urlProfile":"http://www.imdb.com/name/nm0197349","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3ODIyMjYwOF5BMl5BanBnXkFtZTYwMjM3ODU2._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 August 1927","placeOfBirth":" Des Moines, Iowa, USA","height":"6' (1.83 m)","bio":"Bill Daily was born on August 30, 1927 in Des Moines, Iowa, USA. He is an actor, known for I Dream of Jeannie (1965), The Bob Newhart Show (1972) and I Dream of Jeannie... Fifteen Years Later (1985).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3ODIyMjYwOF5BMl5BanBnXkFtZTYwMjM3ODU2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0197349","name":"Bill Daily","idIMDB":"nm0197349"},"actorId":"nm0197349","character":"Mayor Anderson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve Railsback","urlProfile":"http://www.imdb.com/name/nm0706883","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY4NDQxNzQ0NF5BMl5BanBnXkFtZTcwOTE5Mjg0Mw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 November 1945","placeOfBirth":" Dallas, Texas, USA","birthName":"Stephen Hall Railsback","height":"5' 10\" (1.78 m)","bio":"Noted for his dangerous, chameleon-like portrayals while possessing the scariest-looking pair of eyes in the business, leathery-looking Steve Railsback has mesmerized us over the years with a number of weird, often warped roles both on film and television. While never achieving the degree of stardom deserved, he, like the equally infamous and unpredictable Dennis Hopper, always commands interest whether the material is good or inferior. Born on Nevember 16, 1945 in Dallas, Texas, he was raised in Wichita Falls. Participation in a local college production of \"Cinderella\" at the age of 7 spurred his interest in acting. After graduating from high school, he took a job as a shoe salesman and eventually made enough money to leave his native Texas and relocate to New York in order to pursue acting in 1967. As a student of Lee Strasberg and the Actors Studio, Railsback was forced to work menial jobs in order to initially survive, but he eventually became a regular fixture in the New York theatre scene in the late 1960s/early 1970s, appearing in such stage productions as \"The Bluebird\", \"Orpheus Descending\" and \"This Property Is Condemned\". While working out at the Studio, he caught the attention of renowned director Elia Kazan, who noticed his strong potential, and offered the fledgling actor a showy role in the low-budget film The Visitors (1972). However, he returned to the theatre with roles in \"The Petrified Forest\", \"One Sunday Afternoon\" and \"The Cherry Orchard\" before making his Broadway debut in the short-lived José Quintero-directed production of \"The Skin of Our Teeth\" starring Elizabeth Ashley in 1975. Following a second film role with James Woods in Cockfighter (1974) and the title role in the PBS piece Charlie Siringo (1976), Steve delivered one of the most shockingly vivid lead roles ever present in a miniseries with his all-consuming reincarnation of cult leader and mass murderer Charles Manson in Helter Skelter (1976). While the new guy on the block was unjustly ignored at Emmy time, Hollywood could not help but pay attention to this electrifying performer. Thanks primarily to Railsback, the miniseries was the highest-rated television movie at the time until Roots (1977) came along the following year. Eager to avoid the threat of being typecast in \"psycho\" parts, Steve complemented this infamous role with a much more humane performance in the miniseries From Here to Eternity (1979), tackling the role of Pvt. Robert E. Lee Pruitt (made memorable on screen by the late Montgomery Clift) and making it completely his own. His next big movie role, as a fugitive who happens upon a film set in the bizarre and brilliant black comedy The Stunt Man (1980) with the equally compelling Peter O'Toole, assured Hollywood that his stunning Charlie Manson portrayal was no fluke. More cutting-edge parts in a variety of genres came his way throughout the 1980s, but without the quality of production to back them up. Such films as the mystery Deadly Games (1982); the Australian sci-fi thriller Turkey Shoot (1982); the horror film Trick or Treats (1982); the animal adventure The Golden Seal (1983); the cocaine abuse drama Torchlight (1985); the bizarre British sci-fi horror film Lifeforce (1985); the John Candy/Eugene Levy action comedy Armed and Dangerous (1986); the rock-and-roll drama Scenes from the Goldmine (1987); and the ho-hum thriller dramas Distortions (1987), The Survivalist (1987) and Nukie (1987) more often than not wasted his unique gifts. While falling into quirky low-budget or direct-to-video fare for some time, Railsback has also dabbled in writing, producing and directing on occasion, such as the Vietnam POW story The Forgotten (1989). At the turn of the century, Steve came to attention once again with a showy role as he delved inside the complex mind of another schizophrenic madman. Ed Gein (2000), about infamous serial killer/cannibal Ed Gein (in which he also served as executive producer) once again showed Hollywood that the actor was a master at the game of weird. Into the millennium, Railsback has appeared in mostly minor films, with roles in Zigs (2001), Slash (2002), Neo Ned (2005), King of the Lost World (2005), Plaguers (2008), Ready or Not (2009) and Follow the Prophet (2009). On television, he has had occasional roles tailored to his off-beat talents, guesting on such series as The Practice (1997), The District (2000), Family Law (1999) and Supernatural (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjY4NDQxNzQ0NF5BMl5BanBnXkFtZTcwOTE5Mjg0Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0706883","name":"Steve Railsback","idIMDB":"nm0706883"},"actorId":"nm0706883","character":"Vincent 'Vinnie' Brown","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brock Peters","urlProfile":"http://www.imdb.com/name/nm0676349","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM0OTMwMzc1Nl5BMl5BanBnXkFtZTcwMzkwMjEzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 July 1927","placeOfBirth":" New York City, New York, USA","birthName":"George Fisher","height":"6' (1.83 m)","bio":"Born of African and West Indian ancestry on July 2, 1927 in New York City, Brock Peters set his sights on a show business career early on, at age ten. A product of NYC's famed Music and Arts High School, Peters initially fielded more odd jobs than acting jobs as he worked his way up from Harlem poverty. Landing a stage role in \"Porgy and Bess\" in 1949, he quit physical education studies at CCNY and went on tour with the acclaimed musical. His film debut came in Carmen Jones (1954), but he really began to make a name for himself - having dropped his real name, George Fisher, in 1953 - in such films as To Kill a Mockingbird (1962) and The L-Shaped Room (1962). He received a Tony Award nomination for his starring stint in Broadway's \"Lost in the Stars\" in 1973. He also appeared in Star Trek IV: The Voyage Home (1986) and Star Trek VI: The Undiscovered Country (1991), two sequels to the popular Star Trek films. Brock Peters died at age 78 of pancreatic cancer on August 23, 2005.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM0OTMwMzc1Nl5BMl5BanBnXkFtZTcwMzkwMjEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0676349","name":"Brock Peters","idIMDB":"nm0676349"},"actorId":"nm0676349","character":"Chief Speed","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Trevor Eyster","urlProfile":"http://www.imdb.com/name/nm0264269","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMzE3Mjc5MF5BMl5BanBnXkFtZTcwMTc4MDU2OQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1978","placeOfBirth":" Tarzana, California, USA","birthName":"Timothy Richard Eyster","height":"5' 6\" (1.68 m)","bio":"Trevor (born/formerly credited as Timothy Eyster) joined the industry at the tender age of 7, and was quickly whisked off to film a Disney movie in Nepal, with Milla Jovovich. From 1985-1993 he amassed over 60 TV commercial credits, including 6 McDonald's spots, Minute Maid OJ, Eggo Waffles and others. He landed guest star and recurring roles on: Dallas, Matlock, Family Ties, Married... with Children, Santa Barbara all before he turned 12. Today, he is best known and loved by TV audiences for his geek archetype-defining role of \"Sponge\" on 90's Nickelodeon's summer camp sitcom \"Salute Your Shorts\". Trevor left the industry to pursue other life interests, shortly after a guest star appearance on the 5th Season Premiere of \"Babylon 5\", in 2000. Now, he's back: older, wiser and full of spit & grit.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzMzE3Mjc5MF5BMl5BanBnXkFtZTcwMTc4MDU2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0264269","name":"Trevor Eyster","idIMDB":"nm0264269"},"actorId":"nm0264269","character":"J.J. Hodges","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Voyo Goric","urlProfile":"http://www.imdb.com/name/nm0330937","urlPhoto":"","biography":{"dateOfBirth":"1940","placeOfBirth":" Gacko, Bosnia and Herzegovina, Yugoslavia","birthName":"Vojislav Govedarica","height":"6' 1½\" (1.87 m)","bio":"Voyo Goric was born in 1940 in Gacko, Bosnia and Herzegovina, Yugoslavia as Vojislav Govedarica. He is known for his work on Rambo: First Blood Part II (1985), Lionheart (1990) and Nowhere to Run (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0330937","name":"Voyo Goric","nicknames":["Voja Krstarica","Voyo"],"idIMDB":"nm0330937"},"actorId":"nm0330937","character":"Carmen","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Buckley Norris","urlProfile":"http://www.imdb.com/name/nm0635770","urlPhoto":"","biography":{"bio":"Buckley Norris is an actor and producer, known for Highlander (1986), Waxwork (1988) and Alligator (1980).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0635770","name":"Buckley Norris","idIMDB":"nm0635770"},"actorId":"nm0635770","character":"Doc","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julian Reyes","urlProfile":"http://www.imdb.com/name/nm0721333","urlPhoto":"","biography":{"dateOfBirth":"13 November 1961","placeOfBirth":" New York City, New York, USA","birthName":"Nelson Reyes","height":"6' 1\" (1.85 m)","bio":"Born in NYC, Raised in the Bronx, Attended Southern Vermont College Studied acting with Madeleine Sherwood and Patrick Brafford at John Strasberg's Real Stage. His first break came with his role in Miami Vice. Moved to California in 1985 where he played Victor Ortega on the syndicated series \"What a Country!\"","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0721333","name":"Julian Reyes","idIMDB":"nm0721333"},"actorId":"nm0721333","character":"Reuben Ruiz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Deborah White","urlProfile":"http://www.imdb.com/name/nm0924697","urlPhoto":"","biography":{"bio":"Deborah White is known for her work on The Van (1977), Mon ami Dodger (1994) and The Favor (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0924697","name":"Deborah White","idIMDB":"nm0924697"},"actorId":"nm0924697","character":"Lynn Holly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Anderson","urlProfile":"http://www.imdb.com/name/nm0026417","urlPhoto":"","biography":{"bio":"Bill Anderson is an actor, known for Alligator II: The Mutation (1991), Grunt! The Wrestling Movie (1985) and Ed Wood (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0026417","name":"Bill Anderson","idIMDB":"nm0026417"},"actorId":"nm0026417","character":"Timekeeper","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Harlan Arnold","urlProfile":"http://www.imdb.com/name/nm0036470","urlPhoto":"","biography":{"bio":"Harlan Arnold is an actor, known for The War of the Roses (1989), Skin Deep (1989) and Alligator II: The Mutation (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0036470","name":"Harlan Arnold","idIMDB":"nm0036470"},"actorId":"nm0036470","character":"J.A. Luco","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0101309","urlIMDB":"http://www.imdb.com/title/tt0101309","business":{"budget":{"money":"$3,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 32 min (92 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"3.5","filmingLocations":[],"rated":"PG-13","awards":[],"votes":"1,569","type":"Movie","companyCreditsSimple":[{"idCompany":"co0042735","name":"Golden Hawk Entertainment"}],"keywords":{"keywords":["alligator","when animals attack","amusement park","hunter","sewer","toxic waste","animal attack","police","wrestling","giant animal","urban legend","sequel","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:35:53"}}