{"data":{"movies":[{"title":"Séquences et conséquences","originalTitle":"State and Main","year":"2000","releaseDate":"20010112","directors":[{"name":"David Mamet","id":"nm0000519"}],"writers":[{"name":"David Mamet","id":"nm0000519"}],"runtime":"105 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NzA4MjI2OV5BMl5BanBnXkFtZTcwMTY3MTAyMQ@@._V1.jpg","countries":["France","USA"],"languages":["English","Italian"],"genres":["Comedy","Drama"],"plot":"Having left New Hampshire over excessive demands by the locals, the cast and crew of \"The Old Mill\" moves their movie shoot to a small town in Vermont. However, they soon discover that The Old Mill burned down in 1960, the star can't keep his pants zipped, the starlet won't take her top off, and the locals aren't quite as easily conned as they appear.","simplePlot":"A movie crew invades a small town whose residents are all too ready to give up their values for showbiz glitz.","actors":[{"actorName":"Michael Higgins","urlProfile":"http://www.imdb.com/name/nm0383449","urlPhoto":"","biography":{"dateOfBirth":"20 January 1920","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Michael Patrick Higgins Jr.","height":"5' 10\" (1.78 m)","bio":"Michael Higgins was born on January 20, 1920 in Brooklyn, New York City, New York, USA as Michael Patrick Higgins Jr. He was an actor, known for Séquences et conséquences (2000), The Conversation (1974) and Guiding Light (1952). He was married to Elizabeth Lee Goodwin. He died on November 5, 2008 in Manhattan, New York City.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0383449","name":"Michael Higgins","idIMDB":"nm0383449"},"actorId":"nm0383449","character":"Doc Wilson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Bradshaw","urlProfile":"http://www.imdb.com/name/nm0103511","urlPhoto":"","biography":{"dateOfBirth":"18 April 1933","placeOfBirth":" London, England, UK","height":"5' 11\" (1.8 m)","bio":"Born in London, England in 1933 and grew up in Boxmoor, Hemel Hempstead, Hertfordshire. He trained as a printer for most of his teen years except for two years mandatory service in the British armed forces (\"National Service\") which he served in the Royal Air Force. During this time he was working in non-professional theatre in his home town. He left Britain for Canada in 1956 where he flourished in theatre winning the Best Actor in the Dominion of Canada Award at the Dominion Drama Festival for his portrayal of Sir Thomas Moore in 'A Man For All Seasons'. He went on to the United States to be in the first touring company of 'Man of La Mancha' with 'Jose Ferrer' and was on Broadway three times between the 1960s and 1970s including roles in Portrait of a Queen with 'Dorthy Tutin' and Conduct Unbecoming as Major Lionoel Roach for which he nominated for a Tony Award. In the 1970s he served as Production Stage Manager for the Starlight Theatre in Kansas City, Missouri and then retired for most of the 1980s. In the late 80s he began working again, appearing in smaller productions around the New England area, especially Boston where he worked extensively during the 1990s. In the early 2000s he continued theatre work around the country having been in The Art of Success off Broadway in New York and in Tennessee William's Night of the Iguana at the Dallas Theatre Centre in Dallas, Texas. He was scheduled to take part in the Washington D.C. premiere of The Invention of Love but due to illness was forced to withdraw, the first time he'd ever been forced to leave a production in his career. His illness was diagnosed as cancer, and it grew worse until he finally succumbed on 13th December 2001 in a Newton, New Jersey hospital. He is survived by his sons Jeff, Michael, Jon and Josh as well as his wife of 25 years Patricia.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0103511","name":"Michael Bradshaw","idIMDB":"nm0103511"},"actorId":"nm0103511","character":"Priest","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Morris Lamore","urlProfile":"http://www.imdb.com/name/nm0483727","urlPhoto":"","biography":{"bio":"Morris Lamore is an actor, known for Séquences et conséquences (2000) and Spartan (2004).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0483727","name":"Morris Lamore","idIMDB":"nm0483727"},"actorId":"nm0483727","character":"Bunky","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Allen Soule","urlProfile":"http://www.imdb.com/name/nm0815814","urlPhoto":"","biography":{"bio":"Allen Soule is an actor, known for Séquences et conséquences (2000), House of Games (1987) and The Spanish Prisoner (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0815814","name":"Allen Soule","idIMDB":"nm0815814"},"actorId":"nm0815814","character":"Spud","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Clark Gregg","urlProfile":"http://www.imdb.com/name/nm0163988","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjYyNjAwNDUyOV5BMl5BanBnXkFtZTgwOTc5NzgyNjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 April 1962","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Robert Clark Gregg","height":"5' 9\" (1.75 m)","bio":"Clark Gregg was born on April 2, 1962 in Boston, Massachusetts, USA as Robert Clark Gregg. He is an actor and writer, known for The Avengers (2012), Agents of S.H.I.E.L.D. (2013) and The New Adventures of Old Christine (2006). He has been married to Jennifer Grey since July 21, 2001. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjYyNjAwNDUyOV5BMl5BanBnXkFtZTgwOTc5NzgyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0163988","name":"Clark Gregg","idIMDB":"nm0163988"},"actorId":"nm0163988","character":"Doug Mackenzie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rebecca Pidgeon","urlProfile":"http://www.imdb.com/name/nm0682071","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ3NTM5NjMwMF5BMl5BanBnXkFtZTgwNjY1NDMyNzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1965","placeOfBirth":" Cambridge, Massachusetts, USA","bio":"From the adorably quirky Ann in State and Main, to a sister seeking justice in The Winslow Boy, to the tightly wound risk taker in The Spanish Prisoner, Rebecca Pidgeon has portrayed a wide range of multifaceted characters in both film, television and on the stage. In addition to the aforementioned films directed by David Mamet and also including Heist, starring alongside Gene Hackman, Pidgeon appeared alongside Helen Mirren, Bruce Willis and Morgan Freeman in Red for director Robert Schwentke. Pidgeon was born in Cambridge, Massachusetts, to British parents, Elaine R. (Simpson), a yoga teacher, and Carl R. Pidgeon, a professor then teaching at MIT. She spent much of her childhood in Edinburgh, Scotland. Her paternal grandmother's sister was visual artist Olga Lehmann, and Rebecca's ancestry is English, as well as Scottish, German, and French. Pidgeon's television credits include Phil Spector for HBO, opposite Al Pacino and Jesse Stone: Sea Change for CBS, opposite Tom Selleck. She had recurring roles on the hit series The Unit for CBS and The Shield for F/X and played a regular role on In Justice for ABC. Rebecca did memorable turns in Uncle Vanya for The BBC and in Samuel Beckett's Catastrophe, opposite Sir John Gielgud and Harold Pinter for Channel 4. Pidgeon played 'Deeny' in The Old Neighborhood on Broadway and 'Claire' in Boston Marriage at The Geffen Playhouse. She originated the role of 'Carol' in Oleanna Off-Broadway, which had it's World Premiere at The Orpheum Theatre. The character was described by one critic as \"Mamet's most fully realized female character...a mousy, confused cipher\". As a member of The Royal National Theatre in London, Rebecca received stellar notices for her work in Speed-the-Plow and The Changeling. She is also a member of The Atlantic Theatre Company, where she starred in Dangerous Corner. Rebecca is a graduate of London's prestigious Royal Academy of Dramatic Art. In addition to her accomplished career as an actress, Pidgeon is a singer/songwriter, whose latest album Slingshot has been nominated for a Grammy Award. Rebecca is married to playwright/director David Mamet. Her children are Noah and Clara Mamet, an actress, and actress Zosia Mamet is her stepdaughter. Rebecca is a convert to Judaism.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTQ3NTM5NjMwMF5BMl5BanBnXkFtZTgwNjY1NDMyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0682071","name":"Rebecca Pidgeon","idIMDB":"nm0682071"},"actorId":"nm0682071","character":"Ann","urlCharacter":"http://www.imdb.com/character/ch0242336","main":true},{"actorName":"Ricky Jay","urlProfile":"http://www.imdb.com/name/nm0419633","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NjM1MTI0NF5BMl5BanBnXkFtZTcwMDM4MTEzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1948","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Richard Jay Potash","height":"5' 6\" (1.68 m)","bio":"Ricky Jay was born in 1948 in Brooklyn, New York City, New York, USA as Richard Jay Potash. He is known for his work on The Prestige (2006), Tomorrow Never Dies (1997) and Boogie Nights (1997). He is married to Chrisann Verges.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3NjM1MTI0NF5BMl5BanBnXkFtZTcwMDM4MTEzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0419633","name":"Ricky Jay","idIMDB":"nm0419633"},"actorId":"nm0419633","character":"Jack","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julia Stiles","urlProfile":"http://www.imdb.com/name/nm0005466","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNjUxNDk3MF5BMl5BanBnXkFtZTcwMzM0NjA0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 March 1981","placeOfBirth":" New York City, New York, USA","birthName":"Julia O'Hara Stiles","height":"5' 7\" (1.7 m)","bio":"Julia O'Hara Stiles was born on March 28, 1981 in New York City, the outgoing daughter of a Greenwich Village artist mother, Judith Newcomb Stiles, and an elementary school teacher father, John O'Hara. She is the eldest of three children, and has Irish, English, and German ancestry. Encouraged to take modern dance lessons at an early age, she was introduced to Shakespeare and theater. At age 11, she made her debut as a child actress with the experimental off-Broadway La MaMa Theatre. Her passion grew and by the next year was performing professionally and working in commercials. A bright, precocious student, she was seriously considered for the child vampire role of Claudia in Interview with the Vampire: The Vampire Chronicles (1994) but lost out in the end to Kirsten Dunst. She continued training at New York's Professional Children's School and, at 15, made her cinematic bow with I Love You, I Love You Not (1996) with Claire Danes. Next featured as the daughter of Harrison Ford in The Devil's Own (1997), her breakout role came on TV with the hard-hitting mini-movie Before Women Had Wings (1997), which was produced by Oprah Winfrey and dealt with child abuse. Her wish to play Shakespeare was granted threefold with her participation in 10 Things I Hate About You (1999), which was based on the Bard's \"The Taming of The Shrew\" and won her the Chicago Film Critics Award as the volatile teen Kat; an updated version of Hamlet (2000) which paired her Ophelia with Ethan Hawke; and another updated version of \"Othello\" entitled O (2001), which had her high school character of Desi (Desdemona) involved in a mixed romantic relationship with African-American Mekhi Phifer. The violent-edged film was made in 1998 but not released until three years later due to the tragic Colorado student shootings at Columbine High School. In addition, Julia later portrayed Viola off-Broadway in a Shakespeare-in-the-Park production of \"Twelfth Night\" in 2002. She temporarily interrupted her career after deciding to enroll at Columbia University in 2000, where she earned a degree in English. Stiles has also returned to the stage, appearing in David Mamet's \"Oleanna\" in London, a role she would reprise on Broadway in 2009, opposite Bill Pullman and directed by Doug Hughes. Moving into mainstream roles by the millennium, she took on a role that would carry her through the decade, co-starring with Matt Damon in popular Bourne series: The Bourne Identity (2002), The Bourne Supremacy (2004), and The Bourne Ultimatum (2007). During the time between Bourne films, she appeared in ensemble dramas, appearing opposite Julia Roberts in Mona Lisa Smile (2003), won offbeat notice in the title role of Carolina (2003) with Shirley MacLaine and Randy Quaid. She also returned to her indie film roots, with films such as Between Us (2012) and the comedy farce, It's a Disaster (2012). In 2010, she switched gears and headed to series television, joining the cast of Dexter (2006) for the show's fifth season in the role of Lumen Pierce, a performance that earned her nominations for both the Golden Globe and the Emmy for Best Supporting Actress. In 2012, she followed up with another series, Blue (2012), which airs on YouTube, while preparing for cinematic roles in Silver Linings Playbook (2012) and The Bell Jar (2018).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNjUxNDk3MF5BMl5BanBnXkFtZTcwMzM0NjA0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005466","name":"Julia Stiles","idIMDB":"nm0005466"},"actorId":"nm0005466","character":"Carla","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matt Malloy","urlProfile":"http://www.imdb.com/name/nm0540164","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2ODcwMzk3M15BMl5BanBnXkFtZTcwMjgzNzcwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"birthName":"Matthew Myles Malloy","bio":"Matt Malloy was born in Hamilton, New York, USA as Matthew Myles Malloy. He is an actor and producer, known for Hitch (2005), The Bounty Hunter (2010) and Election (1999). He is married to Cas Donovan.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2ODcwMzk3M15BMl5BanBnXkFtZTcwMjgzNzcwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0540164","name":"Matt Malloy","idIMDB":"nm0540164"},"actorId":"nm0540164","character":"Hotel Clerk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charles Durning","urlProfile":"http://www.imdb.com/name/nm0001164","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMDk1NTU1OV5BMl5BanBnXkFtZTYwMDA2MjM0._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 February 1923","placeOfBirth":" Highland Falls, New York, USA","birthName":"Charles Edward Durning","height":"5' 8\" (1.73 m)","bio":"WWII veteran, dance instructor and diversely talented stage & screen actor were all inclusions on the resume of this perpetually busy US actor who didn't get in front of the cameras until around the time of his fortieth birthday. The stockily built Charles Durning was one of Hollywood's most dependable and sought after supporting actors. Durning was born in Highland Falls, New York, to Louise Marie (Leonard), a laundress, and James Gerald Durning. His father was an Irish immigrant and his mother was of Irish descent. Durning first got his start in guest appearances in early 1960's TV shows. He scored minor roles over the next decade until he really got noticed by film fans as the sneering, corrupt cop \"Lt. Snyder\" hassling street grifter 'Robert Redford' in the multi award winning mega-hit The Sting (1973). Durning was equally entertaining in the Billy Wilder production of The Front Page (1974), he supported screen tough guy Charles Bronson in the suspenseful western Breakheart Pass (1975) and featured as \"Spermwhale Whalen\" in the story of unorthodox police behavior in The Choirboys (1977). The versatile Durning is equally adept at comedic roles and demonstrated his skills as \"Doc Hopper\" in The Muppet Movie (1979), a feisty football coach in North Dallas Forty (1979), a highly strung police officer berating maverick cop Burt Reynolds in Sharky's Machine (1981), and a light footed, dancing Governor (alongside Burt Reynolds once more) in The Best Little Whorehouse in Texas (1982). Durning continued a regular on screen association with Burt Reynolds appearing in several more feature films together and as \"Dr. Harlan Elldridge\" in the highly popular TV series Evening Shade (1990). On par with his multitude of feature film roles, Durning has always been in high demand on television and has guest starred in Everybody Loves Raymond (1996), Monk (2002) and Rescue Me (2004). Plus, he has appeared in the role of \"Santa Claus\" in five different television movies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMDk1NTU1OV5BMl5BanBnXkFtZTYwMDA2MjM0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001164","name":"Charles Durning","nicknames":["Charlie","King of Character Actors"],"idIMDB":"nm0001164"},"actorId":"nm0001164","character":"Mayor George Bailey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony V.","urlProfile":"http://www.imdb.com/name/nm0882769","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MTYwNzI1Ml5BMl5BanBnXkFtZTcwMDg0MDAzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Tony V. is an actor and writer, known for The Town (2010), The Heat (2013) and Séquences et conséquences (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MTYwNzI1Ml5BMl5BanBnXkFtZTcwMDg0MDAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0882769","name":"Tony V.","idIMDB":"nm0882769"},"actorId":"nm0882769","character":"Water Delivery Man","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Mamet","urlProfile":"http://www.imdb.com/name/nm0541081","urlPhoto":"","biography":{"bio":"Tony Mamet is an actor and producer, known for Séquences et conséquences (2000), Spartan (2004) and The Spanish Prisoner (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0541081","name":"Tony Mamet","idIMDB":"nm0541081"},"actorId":"nm0541081","character":"Electrician","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jack Wallace","urlProfile":"http://www.imdb.com/name/nm0908685","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzQyNDI3Ml5BMl5BanBnXkFtZTgwNTM3OTY2NDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Jack Wallace is an actor, known for Boogie Nights (1997), The Bear (1988) and American Pie 2 (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNzQyNDI3Ml5BMl5BanBnXkFtZTgwNTM3OTY2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0908685","name":"Jack Wallace","idIMDB":"nm0908685"},"actorId":"nm0908685","character":"Bellhop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael James O'Boyle","urlProfile":"http://www.imdb.com/name/nm0639359","urlPhoto":"","biography":{"bio":"Michael James O'Boyle is an actor, known for Séquences et conséquences (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0639359","name":"Michael James O'Boyle","idIMDB":"nm0639359"},"actorId":"nm0639359","character":"Chuckie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Charlotte Potok","urlProfile":"http://www.imdb.com/name/nm0693161","urlPhoto":"","biography":{"dateOfBirth":"27 September 1930","placeOfBirth":" USA","birthName":"Charlotte Cherney","bio":"Charlotte Potok was born on September 27, 1930 in the USA as Charlotte Cherney. She was an actress, known for Séquences et conséquences (2000), The Spanish Prisoner (1997) and Homicide (1991). She died on July 22, 2008 in Plainfield, Vermont, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0693161","name":"Charlotte Potok","idIMDB":"nm0693161"},"actorId":"nm0693161","character":"Maude","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0120202","urlIMDB":"http://www.imdb.com/title/tt0120202","business":{"budget":null,"openingWeekend":[{"money":"$580,163","country":"USA","day":"25","month":"12","year":"2000","remarks":"72 Screens"},{"money":"£81,260","country":"UK","day":"18","month":"02","year":"2001","remarks":"28 Screens"},{"money":"€39,151","country":"Italy","day":"02","month":"06","year":"2002","remarks":"38 Screens"}],"gross":[{"money":"$6,920,692","country":"USA","day":"11","month":"03","year":"2001","remarks":""},{"money":"$6,829,304","country":"USA","day":"04","month":"03","year":"2001","remarks":""},{"money":"$6,726,863","country":"USA","day":"25","month":"02","year":"2001","remarks":""},{"money":"$6,609,665","country":"USA","day":"18","month":"02","year":"2001","remarks":""},{"money":"$6,339,102","country":"USA","day":"11","month":"02","year":"2001","remarks":""},{"money":"$6,160,704","country":"USA","day":"04","month":"02","year":"2001","remarks":""},{"money":"$5,770,800","country":"USA","day":"28","month":"01","year":"2001","remarks":""},{"money":"$5,157,997","country":"USA","day":"21","month":"01","year":"2001","remarks":""},{"money":"$4,112,803","country":"USA","day":"14","month":"01","year":"2001","remarks":""},{"money":"$2,177,883","country":"USA","day":"07","month":"01","year":"2001","remarks":""},{"money":"$1,542,365","country":"USA","day":"01","month":"01","year":"2001","remarks":""},{"money":"$580,163","country":"USA","day":"25","month":"12","year":"2000","remarks":""},{"money":"£81,260","country":"UK","day":"18","month":"02","year":"2001","remarks":""},{"money":"€345,370","country":"Italy","day":"04","month":"08","year":"2002","remarks":""},{"money":"€326,511","country":"Italy","day":"28","month":"07","year":"2002","remarks":""},{"money":"€304,466","country":"Italy","day":"21","month":"07","year":"2002","remarks":""},{"money":"€282,938","country":"Italy","day":"14","month":"07","year":"2002","remarks":""},{"money":"€257,262","country":"Italy","day":"07","month":"07","year":"2002","remarks":""},{"money":"€236,161","country":"Italy","day":"30","month":"06","year":"2002","remarks":""},{"money":"€206,142","country":"Italy","day":"23","month":"06","year":"2002","remarks":""},{"money":"€165,409","country":"Italy","day":"16","month":"06","year":"2002","remarks":""},{"money":"€120,195","country":"Italy","day":"09","month":"06","year":"2002","remarks":""},{"money":"€39,151","country":"Italy","day":"02","month":"06","year":"2002","remarks":""},{"money":"€352,987","country":"Spain","day":"31","month":"08","year":"2002","remarks":""},{"money":"ESP 45,156,288","country":"Spain","day":"30","month":"06","year":"2001","remarks":""}],"weekendGross":[{"money":"$61,291","country":"USA","day":"11","month":"03","year":"2001","remarks":"50 Screens"},{"money":"$71,254","country":"USA","day":"04","month":"03","year":"2001","remarks":"51 Screens"},{"money":"$88,580","country":"USA","day":"25","month":"02","year":"2001","remarks":"60 Screens"},{"money":"$156,158","country":"USA","day":"18","month":"02","year":"2001","remarks":"72 Screens"},{"money":"$165,271","country":"USA","day":"11","month":"02","year":"2001","remarks":"98 Screens"},{"money":"$252,776","country":"USA","day":"04","month":"02","year":"2001","remarks":"132 Screens"},{"money":"$366,964","country":"USA","day":"28","month":"01","year":"2001","remarks":"240 Screens"},{"money":"$734,020","country":"USA","day":"21","month":"01","year":"2001","remarks":"462 Screens"},{"money":"$1,744,970","country":"USA","day":"14","month":"01","year":"2001","remarks":"459 Screens"},{"money":"$441,898","country":"USA","day":"07","month":"01","year":"2001","remarks":"77 Screens"},{"money":"$618,605","country":"USA","day":"01","month":"01","year":"2001","remarks":"77 Screens"},{"money":"$580,163","country":"USA","day":"25","month":"12","year":"2000","remarks":"72 Screens"},{"money":"£81,260","country":"UK","day":"18","month":"02","year":"2001","remarks":"28 Screens"},{"money":"€6,666","country":"Italy","day":"04","month":"08","year":"2002","remarks":"7 Screens"},{"money":"€13,443","country":"Italy","day":"28","month":"07","year":"2002","remarks":"6 Screens"},{"money":"€10,138","country":"Italy","day":"21","month":"07","year":"2002","remarks":"6 Screens"},{"money":"€15,529","country":"Italy","day":"14","month":"07","year":"2002","remarks":"4 Screens"},{"money":"€11,133","country":"Italy","day":"07","month":"07","year":"2002","remarks":"3 Screens"},{"money":"€14,397","country":"Italy","day":"30","month":"06","year":"2002","remarks":"5 Screens"},{"money":"€24,611","country":"Italy","day":"23","month":"06","year":"2002","remarks":"17 Screens"},{"money":"€26,853","country":"Italy","day":"16","month":"06","year":"2002","remarks":"23 Screens"},{"money":"€52,035","country":"Italy","day":"09","month":"06","year":"2002","remarks":"23 Screens"}],"admissions":[{"money":"47,071","country":"Netherlands","day":"31","month":"12","year":"2002","remarks":""},{"money":"25,839","country":"Netherlands","day":"31","month":"12","year":"2001","remarks":""},{"money":"74,408","country":"Spain","day":"31","month":"08","year":"2002","remarks":""},{"money":"56,550","country":"Spain","day":"30","month":"06","year":"2001","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"21","month":"09","year":"1999","remarks":null},null],"copyrightHolder":"© 2000 New Line Productions, Inc."},"technical":{"runtime":["1 hr 45 min (105 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["DeLuxe, Toronto, Canada (prints)"],"filmLength":["2,889 m (Sweden)","3,011 m (Spain)"],"negativeFormat":["35 mm (Fuji)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.8","metascore":"75","filmingLocations":[{"location":"Beverly, Massachusetts, USA"}],"rated":"R","awards":[{"award":"Casting Society of America, USA 2001","titlesAwards":[{"titleAwardOutcome":"Won Artios","categories":[{"category":"Best Casting for Feature Film, Comedy","names":[{"name":"Avy Kaufman","id":"nm0442090","role":null}]}]}]},{"award":"Chicago Film Critics Association Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated CFCA Award","categories":[{"category":"Best Screenplay","names":[{"name":"David Mamet","id":"nm0000519","role":null}]}]}]},{"award":"Chlotrudis Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated Chlotrudis Award","categories":[{"category":"Best Cast","names":[]},{"category":"Best Original Screenplay","names":[{"name":"David Mamet","id":"nm0000519","role":null}]}]}]},{"award":"Florida Film Critics Circle Awards 2001","titlesAwards":[{"titleAwardOutcome":"Won FFCC Award","categories":[{"category":"Best Ensemble Cast","names":[{"name":"Alec Baldwin","id":"nm0000285","role":null},{"name":"Charles Durning","id":"nm0001164","role":null},{"name":"Jim Frangione","id":"nm0290782","role":null},{"name":"Clark Gregg","id":"nm0163988","role":null},{"name":"Vincent Guastaferro","id":"nm0345466","role":null},{"name":"Michael Higgins","id":"nm0383449","role":null},{"name":"Philip Seymour Hoffman","id":"nm0000450","role":null},{"name":"Ricky Jay","id":"nm0419633","role":null},{"name":"Jonathan Katz","id":"nm0441747","role":null},{"name":"Linda Kimbrough","id":"nm0453921","role":null},{"name":"Jordan Lage","id":"nm0481180","role":null},{"name":"Morris Lamore","id":"nm0483727","role":null},{"name":"Patti LuPone","id":"nm0526985","role":null},{"name":"William H. Macy","id":"nm0000513","role":null},{"name":"Michael James O'Boyle","id":"nm0639359","role":null},{"name":"Sarah Jessica Parker","id":"nm0000572","role":null},{"name":"David Paymer","id":"nm0001601","role":null},{"name":"Rebecca Pidgeon","id":"nm0682071","role":null},{"name":"Charlotte Potok","id":"nm0693161","role":null},{"name":"Lionel Mark Smith","id":"nm0809117","role":null},{"name":"Allen Soule","id":"nm0815814","role":null},{"name":"Julia Stiles","id":"nm0005466","role":null}]},{"category":"Best Screenplay","names":[{"name":"David Mamet","id":"nm0000519","role":null}]}]}]},{"award":"Ft. Lauderdale International Film Festival 2000","titlesAwards":[{"titleAwardOutcome":"Won Jury Award","categories":[{"category":"Best Film","names":[{"name":"David Mamet","id":"nm0000519","role":null}]},{"category":"Best Supporting Male","names":[{"name":"William H. Macy","id":"nm0000513","role":null}]}]}]},{"award":"National Board of Review, USA 2000","titlesAwards":[{"titleAwardOutcome":"Won NBR Award","categories":[{"category":"Best Acting by an Ensemble","names":[{"name":"Alec Baldwin","id":"nm0000285","role":null},{"name":"Charles Durning","id":"nm0001164","role":null},{"name":"Jim Frangione","id":"nm0290782","role":null},{"name":"Clark Gregg","id":"nm0163988","role":null},{"name":"Vincent Guastaferro","id":"nm0345466","role":null},{"name":"Michael Higgins","id":"nm0383449","role":null},{"name":"Philip Seymour Hoffman","id":"nm0000450","role":null},{"name":"Ricky Jay","id":"nm0419633","role":null},{"name":"Jonathan Katz","id":"nm0441747","role":null},{"name":"Linda Kimbrough","id":"nm0453921","role":null},{"name":"Jordan Lage","id":"nm0481180","role":null},{"name":"Morris Lamore","id":"nm0483727","role":null},{"name":"Patti LuPone","id":"nm0526985","role":null},{"name":"William H. Macy","id":"nm0000513","role":null},{"name":"Michael James O'Boyle","id":"nm0639359","role":null},{"name":"Sarah Jessica Parker","id":"nm0000572","role":null},{"name":"David Paymer","id":"nm0001601","role":null},{"name":"Rebecca Pidgeon","id":"nm0682071","role":null},{"name":"Charlotte Potok","id":"nm0693161","role":null},{"name":"Lionel Mark Smith","id":"nm0809117","role":null},{"name":"Allen Soule","id":"nm0815814","role":null},{"name":"Julia Stiles","id":"nm0005466","role":null}]}]}]},{"award":"Online Film Critics Society Awards 2001","titlesAwards":[{"titleAwardOutcome":"Won OFCS Award","categories":[{"category":"Best Ensemble","names":[{"name":"Alec Baldwin","id":"nm0000285","role":null},{"name":"Charles Durning","id":"nm0001164","role":null},{"name":"Jim Frangione","id":"nm0290782","role":null},{"name":"Clark Gregg","id":"nm0163988","role":null},{"name":"Vincent Guastaferro","id":"nm0345466","role":null},{"name":"Michael Higgins","id":"nm0383449","role":null},{"name":"Philip Seymour Hoffman","id":"nm0000450","role":null},{"name":"Ricky Jay","id":"nm0419633","role":null},{"name":"Jonathan Katz","id":"nm0441747","role":null},{"name":"Linda Kimbrough","id":"nm0453921","role":null},{"name":"Jordan Lage","id":"nm0481180","role":null},{"name":"Morris Lamore","id":"nm0483727","role":null},{"name":"Patti LuPone","id":"nm0526985","role":null},{"name":"William H. Macy","id":"nm0000513","role":null},{"name":"Michael James O'Boyle","id":"nm0639359","role":null},{"name":"Sarah Jessica Parker","id":"nm0000572","role":null},{"name":"David Paymer","id":"nm0001601","role":null},{"name":"Rebecca Pidgeon","id":"nm0682071","role":null},{"name":"Charlotte Potok","id":"nm0693161","role":null},{"name":"Lionel Mark Smith","id":"nm0809117","role":null},{"name":"Allen Soule","id":"nm0815814","role":null},{"name":"Julia Stiles","id":"nm0005466","role":null}]}]},{"titleAwardOutcome":"Nominated OFCS Award","categories":[{"category":"Best Screenplay","names":[{"name":"David Mamet","id":"nm0000519","role":null}]}]}]},{"award":"Phoenix Film Critics Society Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated PFCS Award","categories":[{"category":"Best Actress in a Supporting Role","names":[{"name":"Rebecca Pidgeon","id":"nm0682071","role":null}]}]}]},{"award":"Satellite Awards 2001","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Satellite Award","categories":[{"category":"Best Performance by an Actress in a Supporting Role, Comedy or Musical","names":[{"name":"Rebecca Pidgeon","id":"nm0682071","role":null}]},{"category":"Best Motion Picture, Comedy or Musical","names":[]},{"category":"Best Screenplay, Original","names":[{"name":"David Mamet","id":"nm0000519","role":null}]}]}]}],"votes":"18,685","type":"Movie","companyCreditsSimple":[{"idCompany":"co0063162","name":"Filmtown Entertainment"},{"idCompany":"co0054283","name":"Green/Renzi"},{"idCompany":"co0047370","name":"El Dorado Pictures"}],"keywords":{"keywords":["filmmaking","film in film","small town","hairy chest","bare chested male","nun","stained glass window","dalmatian","product placement","starstruck","car accident","statutory rape","amateur theater","hotel","lawsuit","new england","writing","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 20:23:39"}}