{"data":{"movies":[{"title":"Universal Soldier: The Return","originalTitle":"","year":"1999","releaseDate":"19990820","directors":[{"name":"Mic Rodgers","id":"nm0734747"}],"writers":[{"name":"Richard Rothstein","id":"nm0745330"},{"name":"Christopher Leitch","id":"nm0500609"}],"runtime":"83 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTcwOTlhMWYtMDhlOS00ODdmLWJiMTgtMThjNzgxNTIyNTU3XkEyXkFqcGdeQXVyNDc2NjEyMw@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Sci-Fi"],"plot":"Luc Devereaux, the only surviving member of the original Universal Soldier Team. He now works with Dylan Cotner, on a project to create and improve a new Universal Soldier. Their plan is for the Universal soldier or UNISOLS to be controlled by a computer they call SETH. When the government decides to terminate the project, which includes shutting down SETH. SETH, not wanting this to happen, takes steps to prevent this. He first kills Dylan. He then has himself transfered into a body. He then seeks out Luc Devereaux, who is the only person who knows the code that will stop his program from being deleted. So he sends out all the UNISOLS to get him. Luc must try and stay away until SETH program is deleted. But SETH has targeted his daughter as possible leverage.","simplePlot":"The \"universal soldiers\" must fight the whole army. When the military's supercomputer S.E.T.H gets out of control","actors":[{"actorName":"Jean-Claude Van Damme","urlProfile":"http://www.imdb.com/name/nm0000241","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2OTE1Njg4NjVeQTJeQWpwZ15BbWU3MDAyNjU4MDM@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 October 1960","placeOfBirth":" Berchem-Sainte-Agathe, Brussels, Belgium","birthName":"Jean-Claude Camille François Van Varenberg","height":"5' 9¾\" (1.77 m)","bio":"Van Damme was born Jean-Claude Camille François Van Varenberg in Berchem-Sainte-Agathe, Brussels, Belgium, to Eliana and Eugène Van Varenberg, an accountant. \"The Muscles from Brussels\" started martial arts at the age of eleven. His father introduced him to martial arts when he saw his son was physically weak. At the age of 12, Van Damme began his martial arts training at Centre National De Karate (National Center of Karate) under the guidance of Master Claude Goetz in Ixelles, Belgium. Van Damme trained for 4 years and earned a spot on the Belgium Karate Team. He won the European professional karate association's middleweight championship as a teenager, and also beat the 2nd best karate fighter in the world. His goal was to be number one but got sidetracked when he left his hometown of Brussels. In 1976 at the age of sixteen, Jean-Claude started his Martial Arts fight career. Over the next 6-years, he competed in both full-contact and semi-contact matches. He debuted under his birth name of Jean Claude Van Varenberg. In his first match, Jean-Claude was staggered by a round-house kick thrown by fellow countryman, Toon Van Oostrum in Brussels, Belgium. Van Damme was badly stunned, but came back to knockout Van Oostrum moments later. In 1977, at the WAKO Open International in Antwerp, Belgium, Jean-Claude lost a decision to fellow team mate Patrick Teugels in a semi-contact match. At the 1978 Challenge De Espoirs Karate Tournament (1st Trials),Jean-Claude placed 2nd in the semi-contact division. He defeated twenty-five opponents during the week long tournament, but lost in the finals to Angelo Spataro from the Naha Club. Later in 1978, Jean-Claude lost a 3-round match for the Belgium Lightweight Championship (semi-contact) to his fellow team-mate to Patrick Teugels. In 1979, Jean-Claude traveled to the United States of America, to Tampa, Florida. In his first and only match against a United States opponent, Van Damme faced 'Sherman 'Big Train'Bergman', a kick-boxer from Miami Beach, Florida. For the first and only time in his career, Jean-Claude was knocked to the canvas after absorbing a powerful left hook from Bergman. However, Jean-Claude climbed off the canvas and with a perfectly timed ax-kick, knocked Bergman out in 56 seconds of the first round. Jean-Claude was a member of the Belgium team which competed on December 26, 1979 at the La Coupe Fancois Persoons Karate Tournament which was sanctioned by the Federation bruxelloise de Karate. Van Damme's final match victory enabled his team to win the European Team Karate Championship. In Full-Contact karate, Jean-Claude knocked out England's Micheal Heming in 46 seconds of the first round. In 1980, Van Damme knocked out France's Georges Verlugels in 2 rounds of a match fought under kick-boxing rules. Jean-Claude wanted to defeat his rival Patrick Teugels. At the Forest Nationals in Brussels, on March 8, 1980, Jean-Claude knocked Teugels down and Teugels suffered a nose injury and was unable to continue. Jean-Claude was awarded a first round victory. Jean-Claude retired from martial arts in 1982, following a knockout over Nedjad Gharbi in Brussels,Belgium. Jean-Claude posted a 18-1 (18 knockouts) Kickboxing record, and a Semi-Contact record of 41-4. He came to Hong Kong at the age of 19 for the first time and felt insured to do action movies in Hong Kong. In 1981 Van Damme moved to Los Angeles. He took English classes while working as carpet layer, pizza delivery man, limo driver, and thanks to Chuck Norris he got a job as a bouncer at a club. Norris gave Van Damme a small role in the movie Missing in Action (1984), but it wasn't good enough to get anybody's attention. Then in 1984 he got a role as a villain named Ivan in the low-budget movie No Retreat, No Surrender (1986). Then one day, while walking on the streets, Jean-Claude spotted a producer for Cannon Pictures, and showed some of his martial arts abilities which led to a role in Bloodsport (1988). But the movie, filmed in Hong Kong, was so bad when it was completed, it was shelved for almost two years. It might have never been released if Van Damme did not help them to recut the film and begged producers to release it. They finally released the film, first in Malaysia and France and then into the U.S. Shot on a meager 1.5 million dollar budget, it became a U.S box-office hit in the spring of 1988. It made about 30 million worldwide and audiences supported this film for its new sensational action star Jean-Claude Van Damme. His martial arts assets, highlighted by his ability to deliver a kick to an opponent's head during a leaping 360-degree turn, and his good looks led to starring roles in higher budgeted movies like Cyborg (1989), Lionheart (1990), Double Impact (1991) and Universal Soldier (1992). In 1994, he scored with his big breakthrough $100 million worldwide hit Timecop (1994). But in the meantime, his personal life was coming apart. A divorce, followed by a new marriage, followed by another divorce. It began to show up in his career when his projects began to tank at the box office - The Quest (1996), which he directed; Maximum Risk (1996) and Double Team (1997). The three films made less than $50 million combined. In 1999 he remarried his ex-wife Gladys Portugues and restarted his lost career to attain new goals. With help from his family he faced his problems and made movies like Replicant (2001), Derailed (2002), and In Hell (2003) which did averagely in box office terms, but he tried to give his fans the best, his acting in those movies got better, more emotional and each movie was basically in different action tones.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2OTE1Njg4NjVeQTJeQWpwZ15BbWU3MDAyNjU4MDM@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000241","name":"Jean-Claude Van Damme","nicknames":["Muscles from Brussels","J.C."],"idIMDB":"nm0000241"},"actorId":"nm0000241","character":"Luc","urlCharacter":"http://www.imdb.com/character/ch0012802","main":true},{"actorName":"Michael Jai White","urlProfile":"http://www.imdb.com/name/nm0925220","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyODcwMDk5Ml5BMl5BanBnXkFtZTcwMjQyNDIwNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1967","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"6' 1\" (1.85 m)","bio":"Michael Jai White is an American actor and martial artist who has appeared in numerous films and television series. He is the first African American to portray a major comic book superhero in a major motion picture, having starred as Al Simmons, the protagonist in the 1997 film Spawn. White portrayed Jax Briggs in Mortal Kombat: Legacy. White also portrayed boxer Mike Tyson in the 1995 HBO television movie Tyson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyODcwMDk5Ml5BMl5BanBnXkFtZTcwMjQyNDIwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0925220","name":"Michael Jai White","idIMDB":"nm0925220"},"actorId":"nm0925220","character":"SETH","urlCharacter":"http://www.imdb.com/character/ch0012804","main":true},{"actorName":"Heidi Schanz","urlProfile":"http://www.imdb.com/name/nm0770039","urlPhoto":"","biography":{"dateOfBirth":"30 March 1971","placeOfBirth":" Los Angeles County, California, USA","birthName":"Heidi Natasha Schanz","height":"5' 6\" (1.68 m)","bio":"Heidi Schanz was born on March 30, 1971 in Los Angeles County, California, USA as Heidi Natasha Schanz. She is an actress, known for The Truman Show (1998), Se7en (1995) and Universal Soldier: The Return (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0770039","name":"Heidi Schanz","idIMDB":"nm0770039"},"actorId":"nm0770039","character":"Erin","urlCharacter":"http://www.imdb.com/character/ch0435915","main":true},{"actorName":"Xander Berkeley","urlProfile":"http://www.imdb.com/name/nm0075359","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMjA1OTEwOTheQTJeQWpwZ15BbWU2MDkxODgxMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 December 1955","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Alexander Harper Berkeley","height":"6' (1.83 m)","bio":"Xander's father was a painter and his mother a school teacher who sewed, providing him with costumes (his preference over toys). School plays and Community Theater were next. An experimental theater troupe in the area (which was an offshoot from Joseph Chaikin's Open Theater in New York) took Xander under their wing when he was 16. He credits this group for shaping him as both a person and an actor, committed to taking risks and remaining open to the unknown. Xander went to Hampshire College, the progressive brainchild of Smith, Mt. Holyoke, Amherst, and the University of Massachusetts. He would continue in the theater at Hampshire, studying and doing plays at each of the other schools, all of which were there in the area. A move to New York after college brought him access to private teachers from the Royal Academy of the Arts, the Moscow Arts Theater and HB Studios. Later in Los Angeles, Xander would spend time with Lee Strasberg at The Actor's Studio during the last years of his life. Xander worked in Regional and Repertory Theaters in addition to off-Broadway while living in New York but, despite a classically trained theater background, he was increasingly drawn to the subtleties of film acting. A play, written by the great southern novelist Reynolds Price, called \"Early Dark\" had such a cinematic feel to it, that an agent saw the film acting potential in Xander and encouraged him to make the move out west. Soon Mommie Dearest (1981) provided Xander with his film debut in the role of \"Christopher Crawford\", and simultaneously gave his career a slightly cultish twist. Alex Cox with Sid and Nancy (1986), James Cameron with Terminator 2: Judgment Day (1991), Bernard Rose with Candyman (1992), Todd Haynes with Safe (1995), Mike Figgis with Leaving Las Vegas (1995), Andrew Niccol with Gattaca (1997) all helped to further associate Xander as an actor in his own rather unusual category. Xander's choices were often determined by the opportunity to learn from directors he admired, certainly all those listed above fell into that category. Clint Eastwood with The Rookie (1990), Ron Howard with Apollo 13 (1995), Rob Reiner with A Few Good Men (1992), Michael Mann with Heat (1995), Wolfgang Petersen with Air Force One (1997), Steven Spielberg with Amistad (1997) are obvious examples of others Xander actively sought to work with and learn from. From obscure independent movies where Xander could play lead roles to the big budget studio movies where he might often play smaller character-driven parts, an education was taking place. Just as working with older directors like Mihalis Kakogiannis on La cerisaie (1999) and Robert M. Young on Human Error (2004) (aka \"Human Error\") brought insights to ways of working that are being lost in pop cultures tendency to slide toward slickness. Not to mention bringing him to places like Bulgaria and China along the way. Perhaps because a life in the foreign services, or espionage was seen as a road not taken, living on location in foreign countries, working as an actor, has somewhat fulfilled the impulse. As early as 1987, a film took Xander to Nicaragua while the Contra War was taking place. It was during this three month shoot on the film Walker (1987) (starring Ed Harris) that Xander got an offer to do a film with his friend, director Jon Hess, in Chile for the following three months. Taking him straight from the revolutionary left-wing Sandanistas to Pinochet's fascist, right-wing regime. In 2001, an offer came in to play a part on a TV pilot called 24 (2001). It was another shady agent-type, and reluctant to repeat his performance from Air Force One (1997) as the turncoat secret serviceman, Xander almost passed on the job. Fortunately for him, he said yes. He met his future wife, Sarah Clarke during the first day of filming. His character, \"George Mason\", was just a guest star in the pilot, but the producers liked what Xander brought to it and continued to write more episodes for him. By the second season, it had become perhaps the most interesting, leveled character Xander had ever gotten to play. Sarah and Xander were married in 2002 and had their daughters, Olwyn in 2006 and Rowan in 2010. Other favorite roles of late have been \"Arlen Pavich\", the middle management dweeb, in Niki Caro's North Country (2005), and the Irish hooligan/railway foreman in David Von Ancken's Seraphim Falls (2006) and, more recently, \"The King of Sodom\" in Harold Ramis' Year One (2009), \"Sonny\" in David Pomes' Cook County (2009), the recovering meth head coming out of prison to discover the life he had left (and destroyed), and crazy \"Uncle Doug\" in David Wike's Out There (2006) (aka \"Out There\").","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMjA1OTEwOTheQTJeQWpwZ15BbWU2MDkxODgxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0075359","name":"Xander Berkeley","idIMDB":"nm0075359"},"actorId":"nm0075359","character":"Dylan Cotner","urlCharacter":"http://www.imdb.com/character/ch0183331","main":true},{"actorName":"Justin Lazard","urlProfile":"http://www.imdb.com/name/nm0493699","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4Mjc1OTI1MV5BMl5BanBnXkFtZTcwNzM5MzI3NA@@._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1967","placeOfBirth":" New York City, New York, USA","bio":"Justin Lazard was born on November 30, 1967 in New York City, New York, USA. He is an actor and producer, known for Universal Soldier: The Return (1999), Species II (1998) and The Giving Tree (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4Mjc1OTI1MV5BMl5BanBnXkFtZTcwNzM5MzI3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0493699","name":"Justin Lazard","idIMDB":"nm0493699"},"actorId":"nm0493699","character":"Capt. Blackburn","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kiana Tom","urlProfile":"http://www.imdb.com/name/nm0866298","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNTgxNjM3MF5BMl5BanBnXkFtZTYwOTM5ODY2._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1965","placeOfBirth":" Maui, Hawaii, USA","height":"5' 6\" (1.68 m)","bio":"Kiana Tom was born on March 14, 1965 in Maui, Hawaii, USA. She is an actress, known for Universal Soldier: The Return (1999), BodyShaping (1988) and Cyber Bandits (1995). She has been married to Dennis Breshears since March 2002.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNTgxNjM3MF5BMl5BanBnXkFtZTYwOTM5ODY2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0866298","name":"Kiana Tom","nicknames":["ESPN's Fitness Queen"],"idIMDB":"nm0866298"},"actorId":"nm0866298","character":"Maggie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Daniel von Bargen","urlProfile":"http://www.imdb.com/name/nm0901926","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMjIxMjEwMV5BMl5BanBnXkFtZTcwNTQ0NjgwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 June 1950","placeOfBirth":" Cincinnati, Ohio, USA","height":"6' (1.83 m)","bio":"A character actor who seems to pop up everywhere as the stereotypical cop, military officer and/or tough guy, Von Bargen can turn in performances of stunning complexity when given the chance. Daniel von Bargen was born in Cincinnati, Ohio, on June 5, 1950, to Juanita (Bustle) and Donald L. von Bargen, of German and English descent. He grew up in Cincinnati for most of his childhood before moving with his family to Southern California. He attended Purdue University, majoring in drama. Daniel joined the Trinity Repertory Theatre in Providence, Rhode Island, after graduation and worked with them for many years. A breakthrough role in Mastergate (1992) by Larry Gelbart launched him onto Broadway stages. He has also starred in off-Broadway productions of \"Beggars in the House of Plenty,\" \"Macbeth,\" \"The Cherry Orchard,\" \"Hurlyburly,\" and \"Uncle Vanya.\" On TV, he is known for his roles in Malcolm in the Middle (2000) and The West Wing (1999). His role in The Postman (1997) as the Pineview sheriff who suspects 'Kevin Costner''s character of being a fraud, was a stand-out as von Bargen infused the role with the pathos of a man caught between just trying to survive and wanting to believe in the hope the Postman represents. His performance, which was an amalgam of characters from the Novel, contained just the perfect blend of world-weary skepticism and desperate hope. In an otherwise mediocre film, audiences were moved to tear up as his character shouts, \"Ride Postman! Ride!\" just before being put to death for assisting in the rebellion. His more evil side was brought out in Clive Barker's Lord of Illusions (1995) as he played Nix, an older, wiser, more magical and supernaturally gifted type of Charles Manson character rising from the dead to \"Murder the world.\" Many people don't remember him, but do remember his name and recall his characters distinctly and their lines, such as him calling Michael Douglas \"Shooter\" all the time in Basic Instinct (1992). von Bargen is at his best when he is permitted to layer an otherwise forgettable character with a subtle and poignant humanity he often conveys merely with his eyes or change of voice.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwMjIxMjEwMV5BMl5BanBnXkFtZTcwNTQ0NjgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0901926","name":"Daniel von Bargen","idIMDB":"nm0901926"},"actorId":"nm0901926","character":"General Radford","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Black","urlProfile":"http://www.imdb.com/name/nm0085316","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzIxOTg3MjE5NF5BMl5BanBnXkFtZTcwODgzMjAzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 April 1962","placeOfBirth":" Lima, Ohio, USA","birthName":"James Richard Black","bio":"A onetime professional football player for the Cleveland Browns, James has always had a passion for the arts and pursued his passion even while playing for the Browns for two years as a running back. He also played for the Canadian team, The Ottawa Rough Riders. Many recall James as the security specialist, Michael Hailey, from the UPN drama \"The Burning Zone.\" Some of James' other television credits include, \"Bones,\" Navy: NCIS,\" \"CSI: Miami,\" \"All of Us,\" \"Charmed,\" \"Will and Grace,\" \"Jag,\" \"10-8,\" \"Summerland,\" \"Strong Medicine,\" and the HBO movies \"Don King: Only in America,\" and \"Criminal Intent,\" to name a few. His voiceover talents include a series regular role in the critically acclaimed claymation hit \"The PJ's,\" which aired on the WB Network. James' talents aren't limited to the small screen. His notable parts in big screen include Godzilla, Out of Sight, with George Clooney and Soldier for Warner Brothers, where he played one of Kurt Russell's fellow soldiers. James has also had strong supporting roles in Substitute III and the hit movie Universal Soldier II. Most recently, James will be seen in the much anticipated CBS one hour drama \"Moonlight\" as Lt. Carl Davis. Also James can be seen playing a crazed stalker on the ABC Family drama, \"Lincoln Heights,\" and on the TNT critically acclaimed show, \"The Closer\" as Lt. Xavier. However, James' talents don't end with acting;Putting his music degree from the University of Akron to work, he has appeared in the musical Big River, which he was nominated for a 2002 Ovation Award for best actor in a musical. He has also appeared in the musicals, Hair, Dawn of the Infinite Dreams, Sideshow, Kismet, Sheba as well as the play A Raisin in the Sun. In addition, in 2003 he directed the John Patrick Shanley play, The Italian American Reconciliation, at the Whitmore Lindly Theater in North Hollywood. Also in 2003, James made his directorial debut with the feature film Vault. In his spare time, James enjoys guitar, piano, martial arts, singing, snowboarding and the list goes on;..There isn't much this man can't do.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzIxOTg3MjE5NF5BMl5BanBnXkFtZTcwODgzMjAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0085316","name":"James Black","idIMDB":"nm0085316"},"actorId":"nm0085316","character":"Sergeant Morrow","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Karis Paige Bryant","urlProfile":"http://www.imdb.com/name/nm0117151","urlPhoto":"","biography":{"dateOfBirth":"16 June 1985","placeOfBirth":" Arlington, Texas, USA","height":"5' 2\" (1.57 m)","bio":"Karis Paige Bryant was born on June 16, 1985, in Texas. Acting since the age of 5. She has appeared in many films, her first role was in the TV movie A Killing in a Small Town (1990). She landed a role on Charmed (1998) in 1999, plus roles in the feature film Universal Soldier: The Return (1999). She also did some television movies, The People Next Door (1996), The Unspoken Truth (1995), While Justice Sleeps (1994), and The Substitute Wife (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0117151","name":"Karis Paige Bryant","idIMDB":"nm0117151"},"actorId":"nm0117151","character":"Hillary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bill Goldberg","urlProfile":"http://www.imdb.com/name/nm0004966","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4Nzk2MzM0M15BMl5BanBnXkFtZTcwNzUwMzg4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 December 1966","placeOfBirth":" Tulsa, Oklahoma, USA","birthName":"William Scott Goldberg","height":"6' 3½\" (1.92 m)","bio":"Bill Goldberg was born on December 27, 1966 in Tulsa, Oklahoma, USA as William Scott Goldberg. He is an actor and producer, known for The Longest Yard (2005), Les Looney Tunes passent à l'action (2003) and Santa's Slay (2005). He has been married to Wanda Ferraton since April 10, 2005. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4Nzk2MzM0M15BMl5BanBnXkFtZTcwNzUwMzg4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004966","name":"Bill Goldberg","nicknames":["Da Man"],"idIMDB":"nm0004966"},"actorId":"nm0004966","character":"Romeo","urlCharacter":"http://www.imdb.com/character/ch0435916","main":true},{"actorName":"Brent Anderson","urlProfile":"http://www.imdb.com/name/nm0026447","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWY3ZGIwYTUtNWY5OS00MzdlLWFhODQtYWRjNzdkMjJmMDA0L2ltYWdlXkEyXkFqcGdeQXVyMTA0NzEyNTA@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1965","placeOfBirth":" Panorama City, California, USA","birthName":"Brent Randall Anderson","height":"5' 11\" (1.8 m)","bio":"Brent Anderson was born on July 29, 1965 in Panorama City, California, USA as Brent Randall Anderson. He is an actor and producer, known for American Crime (2015), My All-American (2015) and Daylight's End (2016). He has been married to Angela since September 4, 2005.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWY3ZGIwYTUtNWY5OS00MzdlLWFhODQtYWRjNzdkMjJmMDA0L2ltYWdlXkEyXkFqcGdeQXVyMTA0NzEyNTA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0026447","name":"Brent Anderson","idIMDB":"nm0026447"},"actorId":"nm0026447","character":"2nd Technician","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brent Hinkley","urlProfile":"http://www.imdb.com/name/nm0385805","urlPhoto":"","biography":{"dateOfBirth":"12 April 1962","placeOfBirth":" East Boston, Massachusetts, USA","bio":"Brent Hinkley was born on April 12, 1962 in East Boston, Massachusetts, USA. He is an actor, known for The Silence of the Lambs (1991), Ed Wood (1994) and Jacob's Ladder (1990).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0385805","name":"Brent Hinkley","idIMDB":"nm0385805"},"actorId":"nm0385805","character":"Squid","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Woody Watson","urlProfile":"http://www.imdb.com/name/nm0914930","urlPhoto":"","biography":{"dateOfBirth":"26 February 1948","placeOfBirth":" Jefferson County, Texas, USA","birthName":"Raymond Elwood Watson II","bio":"Woody Watson was born on February 26, 1948 in Jefferson County, Texas, USA as Raymond Elwood Watson II. He was an actor, known for Powder (1995), Universal Soldier: The Return (1999) and Eye of God (1997). He died on January 27, 1999 in Trenton, Texas.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0914930","name":"Woody Watson","idIMDB":"nm0914930"},"actorId":"nm0914930","character":"RL Gate Guard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jacqueline Klein","urlProfile":"http://www.imdb.com/name/nm0458792","urlPhoto":"","biography":{"bio":"Jacqueline Klein is an actress, known for Universal Soldier: The Return (1999), Playing Mona Lisa (2000) and Getting Away with Murder (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0458792","name":"Jacqueline Klein","idIMDB":"nm0458792"},"actorId":"nm0458792","character":"Betty Wilson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Maria Arita","urlProfile":"http://www.imdb.com/name/nm0034942","urlPhoto":"","biography":{"bio":"Maria Arita was born in Honduras. She is an actress and producer, known for Universal Soldier: The Return (1999), Au service de Sara (2002) and From Above (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0034942","name":"Maria Arita","idIMDB":"nm0034942"},"actorId":"nm0034942","character":"Kitty Anderson","urlCharacter":"http://www.imdb.com/character/ch0438431","main":true}],"seasons":[],"idIMDB":"tt0176269","urlIMDB":"http://www.imdb.com/title/tt0176269","business":{"budget":{"money":"$45,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$4,605,167","country":"USA","day":"22","month":"08","year":"1999","remarks":"1,639 Screens"},{"money":"$224,000","country":"France","day":"14","month":"07","year":"1999","remarks":"350 Screens"},{"money":"$440,600","country":"Spain","day":"13","month":"08","year":"1999","remarks":"153 Screens"},{"money":"€314,720","country":"Spain","day":"13","month":"08","year":"1999","remarks":"153 Screens"},{"money":"ESP 52,200,000","country":"Spain","day":"13","month":"08","year":"1999","remarks":"150 Screens"}],"gross":[{"money":"$10,431,220","country":"USA","day":"26","month":"09","year":"1999","remarks":""},{"money":"$10,341,112","country":"USA","day":"19","month":"09","year":"1999","remarks":""},{"money":"$10,160,844","country":"USA","day":"12","month":"09","year":"1999","remarks":""},{"money":"$9,705,089","country":"USA","day":"05","month":"09","year":"1999","remarks":""},{"money":"$7,875,178","country":"USA","day":"29","month":"08","year":"1999","remarks":""},{"money":"$4,605,167","country":"USA","day":"22","month":"08","year":"1999","remarks":""},{"money":"$19,912,120","country":"Worldwide","day":"10","month":"11","year":"2000","remarks":""},{"money":"$374,757","country":"Argentina","day":"09","month":"12","year":"1999","remarks":""},{"money":"$688,602","country":"Australia","day":"19","month":"08","year":"1999","remarks":""},{"money":"$300,504","country":"Austria","day":"01","month":"10","year":"1999","remarks":""},{"money":"$163,258","country":"Chile","day":"18","month":"11","year":"1999","remarks":""},{"money":"$1,043,569","country":"Germany","day":"14","month":"10","year":"1999","remarks":""},{"money":"$2,180,059","country":"Mexico","day":"10","month":"12","year":"1999","remarks":""},{"money":"SGD 492,508","country":"Singapore","day":"03","month":"11","year":"1999","remarks":""},{"money":"SGD 471,683","country":"Singapore","day":"27","month":"10","year":"1999","remarks":""},{"money":"SGD 407,630","country":"Singapore","day":"20","month":"10","year":"1999","remarks":""},{"money":"SGD 267,652","country":"Singapore","day":"13","month":"10","year":"1999","remarks":""},{"money":"$1,043,406","country":"Spain","day":"10","month":"09","year":"1999","remarks":""},{"money":"€947,451","country":"Spain","day":"10","month":"09","year":"1999","remarks":""},{"money":"ESP 157,642,580","country":"Spain","day":"10","month":"09","year":"1999","remarks":""}],"weekendGross":[{"money":"$4,605,167","country":"USA","day":"22","month":"08","year":"1999","remarks":"1,639 Screens"}],"admissions":[{"money":"89,377","country":"France","day":"20","month":"07","year":"1999","remarks":""},{"money":"160,610 (Germany)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"252,566 (Spain)","country":"","day":null,"month":null,"year":null,"remarks":null}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"10","month":"11","year":"1998","remarks":null},{"money":null,"country":null,"day":"11","month":"02","year":"1999","remarks":null}],"copyrightHolder":"©1999 TriStar Pictures, Inc."},"technical":{"runtime":["1 hr 23 min (83 min)"],"soundMix":["Dolby Digital","SDDS"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Panaflex Gold II, Panavision Primo and Ultra Speed MKII Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":["2,350 m (Spain)"],"negativeFormat":["35 mm (Kodak Vision 500T 5279, Eastman EXR 200T 5293)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"4.1","metascore":"24","filmingLocations":[{"location":"3458 Old Buena Vista Rd, Waxahachie, Texas, USA"}],"rated":"R","awards":[],"votes":"24,852","type":"Movie","companyCreditsSimple":[{"idCompany":"co0076818","name":"Baumgarten-Prophet Entertainment"},{"idCompany":"co0149490","name":"IndieProd Company Productions"},{"idCompany":"co0022316","name":"Long Road Entertainment"}],"keywords":{"keywords":["computer","combat","general","reporter","military","breasts","female nudity","gun","gun duel","gun fu","bullet ballet","bullet time","slow motion scene","blood splatter","street shootout","cyborg","part of series","shooting","massacre","high tech weapon","die hard scenario","hostile takeover","gun battle","security guard","muscleman","strongman","shootout","gunfight","bomb","cult film","boat chase","duel","white bra","foot chase","disarming someone","hospital fight","wrestling","bar brawl","bare chested male","bar fight","home invasion","grenade launcher","fight to the death","showdown","blood","brawl","fistfight","hand to hand combat","kiss","love","machine gun","tough guy","one against many","one man army","action hero","hero","timebomb","exploding house","exploding car","exploding building","sergeant","captain","sequel","fourth part","strip club","undead","neck breaking","lesbian","motorcycle","x rayed skeleton","kidnapping","exotic dancer","hospital","electrocution","invulnerability","destiny","media coverage","obesity","computer cracker","journalism","violence","cellar","internet","stripper","martial arts","father daughter relationship","cryogenics","widower"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:03:33"}}