{"data":{"movies":[{"title":"Mystery Science Theater 3000: The Movie","originalTitle":"","year":"1996","releaseDate":"19960621","directors":[{"name":"Jim Mallon","id":"nm0540075"}],"writers":[{"name":"Michael J. Nelson","id":"nm0625621"},{"name":"Trace Beaulieu","id":"nm0064546"}],"runtime":"73 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYzNmN2UzNTAtNmZkMS00MmI3LThhNzEtNjI1YjJlN2JiZjU0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Horror","Sci-Fi"],"plot":"The mad and evil scientist, Dr. Clayton Forrester, has created an evil little scheme that is bound to give him world global domination but first thing's first. He plans to torment Mike Nelson and the robots by sending them a real stinker of a film to watch called, \"This Island Earth.\" He is convinced that this movie will drive them insane. And since the guys cannot control when the movie begins or ends, they are forced to witness the true horror that is this awful movie that has a lobster creature dressed in slacks. But will this be the ultimate cheese that breaks the boys' spirits? It's up to one test subject's quick wit, sharp sense of humor, and utter intolerance for cinematic garbage to foil the plans of the scientist and to save the Earth.","simplePlot":"Mike Nelson and his robot companions watch and give their comments about (1955).","actors":[{"actorName":"Trace Beaulieu","urlProfile":"http://www.imdb.com/name/nm0064546","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI3MjQ3MzUxNV5BMl5BanBnXkFtZTcwNDUxNzgwMw@@._V1_UY44_CR19,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 November 1958","placeOfBirth":" Minneapolis, Minnesota, USA","birthName":"Tracy Jacques Beaulieu","height":"6' 1\" (1.85 m)","bio":"Trace Beaulieu was born on November 6, 1958 in Minneapolis, Minnesota, USA as Tracy Jacques Beaulieu. He is a writer and actor, known for America's Funniest Home Videos (1989), Mystery Science Theater 3000: The Movie (1996) and MST3K Little Gold Statue Preview Special (1995). He was previously married to Karin Terrell-Lucius.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTI3MjQ3MzUxNV5BMl5BanBnXkFtZTcwNDUxNzgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0064546","name":"Trace Beaulieu","idIMDB":"nm0064546"},"actorId":"nm0064546","character":"Dr. Clayton Forrester / Crow T. Robot","urlCharacter":"http://www.imdb.com/character/ch0027453","main":true},{"actorName":"Michael J. Nelson","urlProfile":"http://www.imdb.com/name/nm0625621","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNjM0NzMwN15BMl5BanBnXkFtZTcwODMxNzgwMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1964","placeOfBirth":" St. Charles, Illinois, USA","birthName":"Michael John Nelson","height":"6' 1\" (1.85 m)","bio":"Michael J. Nelson is the former host and writer of the Emmy-nominated, Peabody Award-winning Mystery Science Theater 3000 (1988). Since that time, he has appeared on numerous radio and TV shows, penned a regular column for TV Guide, and authored best-selling books for both HarperCollins and Abrams. His first book, Mike Nelson's Movie Megacheese, thrilled critics, including Richard Schickel of Time Magazine. Mike continues to work in all media and has just completed a commentary track to the hugely successful re-release of the classic Reefer Madness (1936) as well as Night of the Living Dead (1968), Carnival of Souls (1962) and The Little Shop of Horrors (1960). He speaks all over the country and is a frequent guest on radio and television, having recently appeared on the Starz and Encore networks and the widely syndicated Hugh Hewitt Radio Show. MSNBC online recently named him one of the 10 sexiest movie men (along with Antonio Banderas and Tom Selleck!).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwNjM0NzMwN15BMl5BanBnXkFtZTcwODMxNzgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0625621","name":"Michael J. Nelson","idIMDB":"nm0625621"},"actorId":"nm0625621","character":"Mike Nelson","urlCharacter":"http://www.imdb.com/character/ch0028391","main":true},{"actorName":"Jim Mallon","urlProfile":"http://www.imdb.com/name/nm0540075","urlPhoto":"","biography":{"dateOfBirth":"19 March 1956","placeOfBirth":" Rochester, Minnesota, USA","birthName":"James Joseph Mallon","bio":"Jim Mallon was born on March 19, 1956 in Rochester, Minnesota, USA as James Joseph Mallon. He is a producer and writer, known for Mystery Science Theater 3000: The Movie (1996), Blood Hook (1986) and MST3K Little Gold Statue Preview Special (1995). He is married to Gail Anderson. They have one child.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0540075","name":"Jim Mallon","idIMDB":"nm0540075"},"actorId":"nm0540075","character":"Gypsy","urlCharacter":"http://www.imdb.com/character/ch0028400","main":true},{"actorName":"Kevin Murphy","urlProfile":"http://www.imdb.com/name/nm0614436","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMjAwMzE5OV5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1956","placeOfBirth":" River Forest, Illinois, USA","birthName":"Kevin Patrick Murphy","height":"5' 9½\" (1.77 m)","bio":"Kevin Murphy was born on November 3, 1956 in River Forest, Illinois, USA as Kevin Patrick Murphy. He is a writer and actor, known for Mystery Science Theater 3000: The Movie (1996), Mystery Science Theater 3000 (1988) and MST3K Little Gold Statue Preview Special (1995). He has been married to Jane Wagner since September 2, 1989.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyMjAwMzE5OV5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0614436","name":"Kevin Murphy","idIMDB":"nm0614436"},"actorId":"nm0614436","character":"Tom Servo","urlCharacter":"http://www.imdb.com/character/ch0028392","main":true},{"actorName":"John Brady","urlProfile":"http://www.imdb.com/name/nm1053847","urlPhoto":"","biography":{"bio":"John Brady is an actor, known for Mystery Science Theater 3000: The Movie (1996), Maneater (2009) and Cry Radio (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1053847","name":"John Brady","idIMDB":"nm1053847"},"actorId":"nm1053847","character":"Benkitnorf","urlCharacter":"http://www.imdb.com/character/ch0095500","main":true},{"actorName":"Faith Domergue","urlProfile":"http://www.imdb.com/name/nm0231409","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMTgxNDAzN15BMl5BanBnXkFtZTgwMjUwNDkyMjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1924","placeOfBirth":" New Orleans, Louisiana, USA","birthName":"Faith Marie Domergue","height":"5' 5\" (1.65 m)","bio":"Sultry, brunette Faith Domergue was born in New Orleans, part Creole, but primarily of Irish and English extraction. She was adopted when she was six weeks old. In 1927 her adoptive parents took her to live in California, where she was educated at Catholic schools in Santa Monica. She had her first flirt with the acting profession while still at school, on stage at the Bliss Hayden Theatre. Just after her graduation she suffered a disfiguring injury during a car accident when she was thrown into a windshield, and spent 18 months undergoing intensive plastic surgery. Still in her teens, she was briefly married to Acapulco night club owner and bandleader Teddy Stauffer. By 1941 she was properly back in circulation. \"Discovered\" by a Warner Brothers talent scout, she was signed to a contract and her name streamlined a la Hollywood to \"Faith Dorn\". Sometime at the end of May that year young Faith found herself at a studio party (it was not unheard of for underage ingénues to be thrown together with rich or influential men) given on board the Southern Cross, a yacht owned by billionaire Howard Hughes. Hughes, 21 years her senior, became quickly infatuated with the teenager and bought out her contract from Warner Brothers for $50,000, then signed her to the studio he owned, RKO Pictures. He also mollified her adoptive parents by buying them a house, and he paid for Faith to take lessons to perfect her diction and acting. The romantic affair continued on-and-off until mid-1943, and was eventually scuttled by Hughes' various indiscretions with stars Lana Turner, Ava Gardner and Rita Hayworth. In 1945 Faith reclaimed her original name, Domergue (insisting it be pronounced \"Dah-mure\") and, by the following year, made her screen debut in Young Widow (1946), a film starring another Hughes find, Jane Russell. Hughes then spent the extravagant--for the time--amount of $3.2 million on Vendetta (1950), the picture that was to catapult Faith to stardom. Three directors went to work on the project, only to be fired in quick succession: Max Ophüls, Preston Sturges and Stuart Heisler. Faith's lack of theatrical training also proved to be a detriment. The picture was eventually completed by Mel Ferrer, but not released until 1950. When it finally arrived in cinemas, it--like Hughes other fiasco, the Spruce Goose--failed to take off. An earlier effort, the film noir Where Danger Lives (1950), was also released at this time. It starred Domergue in the role as a homicidal femme fatale, opposite Robert Mitchum as the lover she manipulates into taking the blame for her murdering millionaire hubby Claude Rains. In spite of another huge publicity campaign, with Faith featured on the cover of \"Look\" Magazine and articles in numerous other publications, this film also performed indifferently at the box office and caused Hughes to lose interest in his erstwhile protégé. During the next few years Faith began to freelance at other studios, appearing in westerns: The Duel at Silver Creek (1952), with Audie Murphy; The Great Sioux Uprising (1953), with Jeff Chandler; and Santa Fe Passage (1955) with John Payne at Republic. In 1955 she starred in the first of a trio of sci-fi/horror outings for which she is chiefly remembered. In This Island Earth (1955), shot in Technicolor at Universal, she played a scientist kidnapped by aliens and, with her colleagues, pressed into service defending their world against interplanetary attack. Helped by a clever script and make-up artist Bud Westmore's $24,000 creation of a bug-eyed mutant monster, the film was a huge success and has become a cult favorite. Faith essayed yet another scientist engaged in destroying Ray Harryhausen's giant octopus (six-tentacled, because of the minuscule budget) in It Came from Beneath the Sea (1955). In Cult of the Cobra (1955), Faith replaced Mari Blanchard in the role of the high-priestess of a cobra-worshiping cult who assumes the shape of a serpent in order to kill six GIs who have witnessed a secret ceremony. Following her separation from Argentine writer/director Hugo Fregonese, Faith made three films in England, most notably as queen of the London underworld in Vernon Sewell's Spin a Dark Web (1956) (aka \"Spin a Dark Web\"). During the 1960s she concentrated on television and appeared in everything from Bonanza (1959) to Combat! (1962), from Perry Mason (1957) to Bronco (1958). After making several films in Italy (and getting married for a third time, to assistant director and theatrical producer Paolo Cossa in 1966)) , she revisited the horror genre in the cheap but cheerful The House of Seven Corpses (1974), as the emotive star of a horror movie who awakens the deceased after reading from the \"Tibetan Book of the Dead\". Faith Domergue never quite made it as a major star, unlike Jane Russell. She did, however, acquire something of a cult following because of her involvement in the seminal This Island Earth (1955), as well as her other science-fiction films from this period. Ironically, Faith later confessed that she never much cared for the genre.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMTgxNDAzN15BMl5BanBnXkFtZTgwMjUwNDkyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0231409","name":"Faith Domergue","nicknames":["Faith Dawn"],"idIMDB":"nm0231409"},"actorId":"nm0231409","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lance Fuller","urlProfile":"http://www.imdb.com/name/nm0298282","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjcxOGI3YmUtNmM5OC00ZTBlLTgyNDktOTBhZGY4ODAzMTZkXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 December 1928","placeOfBirth":" Somerset, Kentucky, USA","height":"6' 3\" (1.91 m)","bio":"Lance Fuller was born on December 6, 1928 in Somerset, Kentucky, USA. He is known for his work on This Island Earth (1955), God's Little Acre (1958) and The Bride and the Beast (1958). He was married to Joi Lansing. He died on December 22, 2001 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjcxOGI3YmUtNmM5OC00ZTBlLTgyNDktOTBhZGY4ODAzMTZkXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0298282","name":"Lance Fuller","idIMDB":"nm0298282"},"actorId":"nm0298282","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Russell Johnson","urlProfile":"http://www.imdb.com/name/nm0426157","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNDM1OTQ4MV5BMl5BanBnXkFtZTYwMTUxODg0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1924","placeOfBirth":" Ashley, Pennsylvania, USA","birthName":"Russell David Johnson","height":"5' 10\" (1.78 m)","bio":"Long before he was known as \"The Professor\" in the cult comedy classic Gilligan's Island (1964), Russell Johnson was a well-known character actor, starring in several Westerns and Sci-Fi classics as This Island Earth (1955) and It Came from Outer Space (1953). Johnson grew up in Pennsylvania and was sent to a boarding school in Philadelphia with his brothers when his father died. Unlike his Professor character, Johnson said he was not a bright student and was in fact held back a grade. Johnson did redeem himself later on in his school career and made the National Honor Society in high school. He joined the Army Air Corps in World War II, and earned the Purple Heart when his B-24 Liberator was shot down in the Philippines during a bombing run in March, 1945. After the war, he used the G.I. Bill to enroll in acting school to ply his new trade. Johnson lived in the state of Washington, and has done several guest shots on television shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNDM1OTQ4MV5BMl5BanBnXkFtZTYwMTUxODg0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0426157","name":"Russell Johnson","nicknames":["The Professor"],"idIMDB":"nm0426157"},"actorId":"nm0426157","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert Nichols","urlProfile":"http://www.imdb.com/name/nm0629711","urlPhoto":"","biography":{"dateOfBirth":"20 July 1924","placeOfBirth":" Oakland, California, USA","bio":"A native of Oakland, California, Robert Nichols got his start as an entertainer in the Army during World War II. After his discharge, he attended London's Royal Academy of Dramatic Art while working as a song-and-dance man at the Players Theater (Victorian music hall). Hollywood director Howard Hawks, visiting London, cast Nichols in a small part in his 1949 comedy I Was a Male War Bride (1949); Nichols' scene was shot in Germany. Relocating to Hollywood, he appeared in dozens of additional features before tiring of the succession of \"elderly juvenile\" roles and moving back to England, where he worked on the stage and in films. A subsequent move to New York yielded yet more stage-work while his wife, Jennifer Nichols, became one of the movies' top wardrobe supervisors there. In more recent years, Nichols has been \"on the road\" with productions of \"A Funny Thing Happened on the Way to the Forum\", \"Anything Goes\" and \"Ragtime\".","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0629711","name":"Robert Nichols","idIMDB":"nm0629711"},"actorId":"nm0629711","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Regis Parton","urlProfile":"http://www.imdb.com/name/nm0664017","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMTY5NzI2N15BMl5BanBnXkFtZTgwNjcyMjkyMjE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1917","placeOfBirth":" Johnstown, Pennsylvania, USA","birthName":"Regis Parton","bio":"Regis Parton was born on January 27, 1917 in Johnstown, Pennsylvania, USA. He is known for his work on The Monster Squad (1987), The Stunt Man (1980) and The Love Bug (1968). He died on May 31, 1996 in Riverside, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMTY5NzI2N15BMl5BanBnXkFtZTgwNjcyMjkyMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0664017","name":"Regis Parton","nicknames":["Reggie"],"idIMDB":"nm0664017"},"actorId":"nm0664017","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rex Reason","urlProfile":"http://www.imdb.com/name/nm0714155","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjczOTg1NTYtZWYyZS00MDIxLWFkMDMtNjgxN2VjN2RkNjUzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR20,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1928","placeOfBirth":" Berlin, Germany","birthName":"Rex George Reason Jr.","height":"6' 3\" (1.91 m)","bio":"Rex Reason was born in Germany, while his family was in Europe on a business trip. Although he grew up in Los Angeles, his acting aspirations were nil; his mother, however, hoped that both Rex and his lookalike brother Rhodes Reason would get into the acting profession. He played the lead in \"Seventh Heaven\" at Glendale's Hoover High School, then enlisted in the army at 17. After his discharge, he enrolled at the Pasadena Playhouse and then became involved in little theater. Reason was top-billed in his very first movie, Storm Over Tibet (1952), then played smaller parts in pictures at Columbia and MGM. A contract player at Universal-International, he allowed the studio to bill him as \"Bart Roberts\" in two features before he balked and insisted on going back to his own name. When his TV series The Roaring 20's (1960) wrapped up, Reason--who once told an interviewer, \"If I couldn't act, I wouldn't know what to do with my life\"--turned his back on Hollywood. In recent years he has begun appearing at autograph shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjczOTg1NTYtZWYyZS00MDIxLWFkMDMtNjgxN2VjN2RkNjUzXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0714155","name":"Rex Reason","idIMDB":"nm0714155"},"actorId":"nm0714155","character":"","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0117128","urlIMDB":"http://www.imdb.com/title/tt0117128","business":{"budget":null,"openingWeekend":[{"money":"$206,328","country":"USA","day":"19","month":"04","year":"1996","remarks":"26 Screens"}],"gross":[{"money":"$1,004,821","country":"USA","day":"18","month":"08","year":"1996","remarks":""},{"money":"$994,442","country":"USA","day":"11","month":"08","year":"1996","remarks":""},{"money":"$984,839","country":"USA","day":"04","month":"08","year":"1996","remarks":""},{"money":"$976,171","country":"USA","day":"28","month":"07","year":"1996","remarks":""},{"money":"$971,283","country":"USA","day":"21","month":"07","year":"1996","remarks":""},{"money":"$962,751","country":"USA","day":"14","month":"07","year":"1996","remarks":""},{"money":"$949,745","country":"USA","day":"07","month":"07","year":"1996","remarks":""},{"money":"$930,694","country":"USA","day":"30","month":"06","year":"1996","remarks":""},{"money":"$902,994","country":"USA","day":"23","month":"06","year":"1996","remarks":""},{"money":"$874,794","country":"USA","day":"16","month":"06","year":"1996","remarks":""},{"money":"$843,129","country":"USA","day":"09","month":"06","year":"1996","remarks":""},{"money":"$798,034","country":"USA","day":"02","month":"06","year":"1996","remarks":""},{"money":"$751,478","country":"USA","day":"27","month":"05","year":"1996","remarks":""},{"money":"$651,654","country":"USA","day":"19","month":"05","year":"1996","remarks":""},{"money":"$561,398","country":"USA","day":"12","month":"05","year":"1996","remarks":""},{"money":"$475,718","country":"USA","day":"05","month":"05","year":"1996","remarks":""},{"money":"$367,471","country":"USA","day":"26","month":"04","year":"1996","remarks":""},{"money":"$206,328","country":"USA","day":"19","month":"04","year":"1996","remarks":""}],"weekendGross":[{"money":"$4,654","country":"USA","day":"18","month":"08","year":"1996","remarks":"15 Screens"},{"money":"$5,415","country":"USA","day":"11","month":"08","year":"1996","remarks":"14 Screens"},{"money":"$4,458","country":"USA","day":"04","month":"08","year":"1996","remarks":"13 Screens"},{"money":"$3,739","country":"USA","day":"28","month":"07","year":"1996","remarks":"12 Screens"},{"money":"$3,798","country":"USA","day":"21","month":"07","year":"1996","remarks":"14 Screens"},{"money":"$6,666","country":"USA","day":"14","month":"07","year":"1996","remarks":"17 Screens"},{"money":"$8,344","country":"USA","day":"07","month":"07","year":"1996","remarks":"17 Screens"},{"money":"$17,247","country":"USA","day":"30","month":"06","year":"1996","remarks":"17 Screens"},{"money":"$16,842","country":"USA","day":"23","month":"06","year":"1996","remarks":"25 Screens"},{"money":"$16,215","country":"USA","day":"16","month":"06","year":"1996","remarks":"26 Screens"},{"money":"$26,308","country":"USA","day":"09","month":"06","year":"1996","remarks":"28 Screens"},{"money":"$32,417","country":"USA","day":"02","month":"06","year":"1996","remarks":"31 Screens"},{"money":"$77,070","country":"USA","day":"27","month":"05","year":"1996","remarks":"37 Screens"},{"money":"$57,812","country":"USA","day":"19","month":"05","year":"1996","remarks":"35 Screens"},{"money":"$64,338","country":"USA","day":"12","month":"05","year":"1996","remarks":"30 Screens"},{"money":"$75,392","country":"USA","day":"05","month":"05","year":"1996","remarks":"26 Screens"},{"money":"$110,620","country":"USA","day":"26","month":"04","year":"1996","remarks":"27 Screens"},{"money":"$206,328","country":"USA","day":"19","month":"04","year":"1996","remarks":"26 Screens"}],"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 13 min (73 min)"],"soundMix":["DTS"],"color":["Color (Eastmancolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["DeLuxe"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.4","filmingLocations":[{"location":"Energy Park Studios - 1515 Brewster Street, St. Paul, Minnesota, USA"}],"rated":"PG-13","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1997","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Science Fiction Film","names":[]}]}]}],"votes":"15,966","type":"Movie","companyCreditsSimple":[{"idCompany":"co0100393","name":"Best Brains"},{"idCompany":"co0005073","name":"Universal Pictures"}],"keywords":{"keywords":["robot","scientist","based on cult tv series","outer space","cult film","reference to kate moss","reference to christy turlington","long title","space travel","mad scientist","gay subtext","gay innuendo","reference to flash gordon","hull breach","teleportation","sequel","pick axe","puppet","8 track","poking fun at movie","b movie","hovering","interocitor","laser","dirty harry impersonation","film break","based on tv series","hard hat","number in title","actor shares first name with character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 03:44:42"}}