{"data":{"movies":[{"title":"The Firm","originalTitle":"","year":"1993","releaseDate":"19930630","directors":[{"name":"Sydney Pollack","id":"nm0001628"}],"writers":[{"name":"John Grisham","id":"nm0001300"},{"name":"David Rabe","id":"nm0704792"}],"runtime":"154 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxMjM5NDYwM15BMl5BanBnXkFtZTgwODkzMzk5MDE@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Mystery","Thriller"],"plot":"Mitch McDeere is a young man with a promising future in Law. About to sit his Bar exam, he is approached by 'The Firm' and made an offer he doesn't refuse. Seduced by the money and gifts showered on him, he is totally oblivious to the more sinister side of his company. Then, two Associates are murdered. The FBI contact him, asking him for information and suddenly his life is ruined. He has a choice - work with the FBI, or stay with the Firm. Either way he will lose his life as he knows it. Mitch figures the only way out is to follow his own plan...","simplePlot":"A young lawyer joins a prestigious law firm only to discover that it has a sinister dark side.","actors":[{"actorName":"Tom Cruise","urlProfile":"http://www.imdb.com/name/nm0000129","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MjM3NTU5M15BMl5BanBnXkFtZTcwMTMyMjAyMg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 July 1962","placeOfBirth":" Syracuse, New York, USA","birthName":"Thomas Cruise Mapother IV","height":"5' 7\" (1.7 m)","bio":"In 1976, if you had told fourteen year-old Franciscan seminary student Thomas Cruise Mapother IV that one day in the not too distant future he would become Tom Cruise, one of the top 100 movie stars of all time, he would have probably grinned and told you that his ambition was to join the priesthood. Nonetheless, this sensitive, deeply religious youngster who was born in 1962 in Syracuse, New York, was destined to be one of the highest paid and most sought after actors in screen history. Tom is the only son (among four children) of nomadic parents, Mary Lee (Pfeiffer), a special education teacher, and Thomas Cruise Mapother III, an electrical engineer. His parents were both from Louisville, Kentucky, and he has German, Irish, and English ancestry. Young Tom spent his boyhood eternally on the move, and by the time he was 14 he had attended 15 different schools in the U.S. and Canada. He finally settled in Glen Ridge, New Jersey, with his mother and her new husband. While in high school, he developed an interest in acting and abandoned his plans of becoming a priest, dropped out of school, and at age 18 headed for New York and a possible acting career. The next 15 years of his life are the stuff of legends. He made his film debut with a small part in Endless Love (1981) and from the outset exhibited an undeniable box office appeal to both male and female audiences. Though below average height and not particularly handsome in the traditional sense, within 5 years Tom Cruise was starring in some of the top grossing films of the 1980s including Top Gun (1986); The Color of Money (1986), Rain Man (1988) and Born on the Fourth of July (1989). By the 1990s he was one of the highest paid actors in the world earning an average 15 million dollars a picture in such blockbuster hits as Interview with the Vampire: The Vampire Chronicles (1994), Mission: Impossible (1996) and Jerry Maguire (1996) for which he received an Academy Award Nomination for best actor. In 1990 he renounced his devout Catholic beliefs and embraced The Church Of Scientology claiming that Scientology teachings had cured him of the dyslexia that had plagued him all of his life. A kind and thoughtful man well known for his compassion and generosity, Tom Cruise is one of the best liked members of the movie community. He was married to actress Nicole Kidman until 2001. Thomas Cruise Mapother IV has indeed come a long way from the lonely wanderings of his youth.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1MjM3NTU5M15BMl5BanBnXkFtZTcwMTMyMjAyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000129","name":"Tom Cruise","nicknames":["TC"],"idIMDB":"nm0000129"},"actorId":"nm0000129","character":"Mitch McDeere","urlCharacter":"http://www.imdb.com/character/ch0010868","main":true},{"actorName":"Jeanne Tripplehorn","urlProfile":"http://www.imdb.com/name/nm0000675","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MTAxMjAyNF5BMl5BanBnXkFtZTcwNjIwNTIzNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1963","placeOfBirth":" Tulsa, Oklahoma, USA","birthName":"Jeanne Marie Tripplehorn","height":"5' 7\" (1.7 m)","bio":"Born in Tulsa, Oklahoma, on June 10, 1963, Jeanne Tripplehorn developed an interest in performing through her father, guitarist Tom Tripplehorn, who at one time recorded with the pop group Gary Lewis & The Playboys on such hits as \"This Diamond Ring\". (Note: many references list Jeanne's father's birth date as February 2, 1949, but this seem very unlikely as he would have been only 14 years old when she was born). Graduating from Edison High School, Jeanne began her career as a local radio and TV host. Educated at both the University of Tulsa and the drama division of The Juilliard School in New York City, she made her major TV debut, in a supporting role, in The Perfect Tribute (1991), a fictional story that centered around President Abraham Lincoln's Gettysburg Address. A year later, she made a big splash with her second lead, in Paul Verhoeven's thriller, Basic Instinct (1992), in support of Michael Douglas. In this movie, which made a sex star out of Sharon Stone, Jeanne's weird psychiatrist role established her as a talent to be reckoned with, although a torrid sex scene with Douglas certainly helped. She earned a huge break when she replaced a pregnant Robin Wright in the role of Tom Cruise's wife in the box-office smash The Firm (1993). Her smart work in this film afforded her the opportunity to work opposite other \"top guns\" in the industry, including Kevin Costner in the futuristic Waterworld (1995), Gwyneth Paltrow in Sliding Doors (1998) and Hugh Grant in Mickey Blue Eyes (1999). While none of these roles impressed to a great degree, they nevertheless put her in good standing. Reaching into her versatile bag of tricks, she went on to play everything from a lesbian gangster in Mike Figgis' experimental film, Timecode (2000), to a love interest of left-wing activist Abbie Hoffman in Steal This Movie (2000). On stage, the lady with the strikingly open face and penetrating glare made her Broadway bow in the role of \"Masha\" in Anton Chekhov's \"The Three Sisters\", opposite Amy Irving and Lili Taylor. Prior to this, she appeared off-Broadway in John Patrick Shanley's \"The Big Funk\" in 1990, then co-starred with Val Kilmer in a 1993 production of John Ford's 1630s play, \"'Tis Pity She's a Whore\". In 2002, Jeanne was one of a revolving door of guest stars to appear in the Actor's Alley play, \"The Guys\", a tribute to the valiant firefighters of the 9/11 attack. On television, Jeanne appeared less frequently but did star, opposite Arliss Howard, in a superlative TV-movie adaptation of William Faulkner's Old Man (1997). Although the beginning of the millennium has been rather unspectacular for her career-wise, her private life has been sailing along beautifully of late. Back in the 1990s, she maintained a roller coaster relationship with actor/writer Ben Stiller. Engaged at one point in 1993, she even appeared on his early '90s TV show, The Ben Stiller Show (1992), on occasion. The union broke up after six years, however, and in 2000, Jeanne married actor Leland Orser of TV's ER (1994) fame. She bore Orser, who appeared with her in the movies Very Bad Things (1998) and Le sang du frère (2002), a son named August Tripplehorn Orser, in 2002. Jeanne's career on TV has deservingly surged recently as the senior wife of polygamist Bill Paxton's three live-ins in the HBO drama, Big Love (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MTAxMjAyNF5BMl5BanBnXkFtZTcwNjIwNTIzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000675","name":"Jeanne Tripplehorn","idIMDB":"nm0000675"},"actorId":"nm0000675","character":"Abby McDeere","urlCharacter":"http://www.imdb.com/character/ch0010873","main":true},{"actorName":"Gene Hackman","urlProfile":"http://www.imdb.com/name/nm0000432","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5Njk0NDQ4OV5BMl5BanBnXkFtZTYwNjA0Mzc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 January 1930","placeOfBirth":" San Bernardino, California, USA","birthName":"Eugene Allen Hackman","height":"6' 1\" (1.85 m)","bio":"Eugene Allen Hackman was born in San Bernardino, California, the son of Anna Lyda Elizabeth (Gray) and Eugene Ezra Hackman, who operated a newspaper printing press. He is of Pennsylvania Dutch (German), English, and Scottish ancestry, partly by way of Canada, where his mother was born. After several moves, his family settled in Danville, Illinois. Gene grew up in a broken home, which he left at the age of sixteen for a hitch with the US Marines. Moving to New York after being discharged, he worked in a number of menial jobs before studying journalism and television production on the G.I. Bill at the University of Illinois. Hackman would be over 30 years old when he finally decided to take his chance at acting by enrolling at the Pasadena Playhouse in California. Legend says that Hackman and friend Dustin Hoffman were voted \"least likely to succeed.\" Hackman next moved back to New York, where he worked in summer stock and off-Broadway. In 1964 he was cast as the young suitor in the Broadway play \"Any Wednesday.\" This role would lead to him being cast in the small role of Norman in Lilith (1964), starring Warren Beatty. When Beatty was casting for Bonnie and Clyde (1967), he cast Hackman as Buck Barrow, Clyde Barrow's brother. That role earned Hackman a nomination for the Academy Award for Best Supporting Actor, an award for which he would again be nominated in I Never Sang for My Father (1970). In 1972 he won the Oscar for his role as Detective Jimmy \"Popeye\" Doyle in The French Connection (1971). At 40 years old Hackman was a Hollywood star whose work would rise to new heights with Night Moves (1975) and Bite the Bullet (1975), or fall to new depths with The Poseidon Adventure (1972) and Eureka (1983). Hackman is a versatile actor who can play comedy (the blind man in Young Frankenstein (1974)) or villainy (the evil Lex Luthor in Superman (1978)). He is the doctor who puts his work above people in Extreme Measures (1996) and the captain on the edge of nuclear destruction in Crimson Tide (1995). After initially turning down the role of Little Bill Daggett in Clint Eastwood's Unforgiven (1992), Hackman finally accepted it, as its different slant on the western interested him. For his performance he won the Oscar and Golden Globe and decided that he wasn't tired of westerns after all. He has since appeared in Geronimo: An American Legend (1993), Wyatt Earp (1994), and Mort ou vif (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTE5Njk0NDQ4OV5BMl5BanBnXkFtZTYwNjA0Mzc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000432","name":"Gene Hackman","idIMDB":"nm0000432"},"actorId":"nm0000432","character":"Avery Tolar","urlCharacter":"http://www.imdb.com/character/ch0010871","main":true},{"actorName":"Hal Holbrook","urlProfile":"http://www.imdb.com/name/nm0001358","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNTMwNjE3NV5BMl5BanBnXkFtZTcwNTQzMjc1MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1925","placeOfBirth":" Cleveland, Ohio, USA","birthName":"Harold Rowe Holbrook Jr.","height":"6' 1\" (1.85 m)","bio":"Hal Holbrook is an Emmy- and Tony-Award winning actor who is one of the great craftsman of stage and screen. He is best known for his performance as Mark Twain, for which he won a Tony and the first of his ten Emmy Award nominations. Aside from the stage, Holbrook made his reputation primarily on television, and was memorable as Abraham Lincoln, as Senator Hays Stowe on The Bold Ones: The Senator (1970) and as Capt. Lloyd Bucher on Pueblo (1973). All of these roles brought him Emmy Awards, with Pueblo (1973) bringing him two, as Best Lead Actor in a Drama and Actor of the Year - Special. On January 22, 2008, he became the oldest male performer ever nominated for a an Academy Award, for his supporting turn in Into the Wild (2007) He was born Harold Rowe Holbrook, Jr. on February 17, 1925 in Cleveland, Ohio, to Eileen (Davenport), a vaudeville dancer, and Harold Rowe Holbrook, Sr. Raised primarily in South Weymouth, Mass., Holbrook attended the Culver Academies. During World War II, Holbrook served in the Army in Newfoundland. After the war, he attended Denison University, graduating in 1948. While at Denison, Holbrook's senior honors project concerned Mark Twain. He'd later develop \"Mark Twain Tonight\", the one-man show in which he impersonates the great American writer Mark Twain, a.k.a. Samuel Clemens. Holbrook learned his craft on the boards and by appearing in the TV soap opera The Brighter Day (1954). He first played Mark Twain as a solo act in 1954, at Lock Haven State Teachers College in Pennsylvania. The show was a success that created a buzz. After seeing the performance, Ed Sullivan, the host of TV's premier variety show, featured him on The Ed Sullivan Show (1948) on February 12, 1956. This lead to an international tour sponsored by the U.S. Department of State, which included appearances in Iron Curtain countries. Holbrook brought the show to Off-Broadway in 1959. He even played Mark Twain for President Dwight D. Eisenhower. The 1966 \"Mark Twain Tonight\" Broadway production brought Holbrook even more acclaim, and the Tony Award. The show was taped and Holbrook won an Emmy nomination. He reprised the show on Broadway in 1977 and in 2005. By that time, he had played Samuel Clemens on stage over 2,000 times. Among Holbrook's more famous roles was \"The Major\" in the original Broadway production of Arthur Miller's \"Incident at Vichy\", as Martin Sheen's significant other in the controversial and acclaimed TV movie That Certain Summer (1972), the first TV movie to sympathetically portray homosexuality, and as Abraham Lincoln in a TV special based on Carl Sandburg's acclaimed biography of the 16th President. He also is known for his portrayal of the enigmatic \"Deep Throat\" in All the President's Men (1976), one of the major cinema events of the mid-'70s. In the 1990s, he had a regular supporting role in the TV series Evening Shade (1990), playing 'Burt Reynolds''s father-in-law.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyNTMwNjE3NV5BMl5BanBnXkFtZTcwNTQzMjc1MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001358","name":"Hal Holbrook","idIMDB":"nm0001358"},"actorId":"nm0001358","character":"Oliver Lambert","urlCharacter":"http://www.imdb.com/character/ch0429415","main":true},{"actorName":"Terry Kinney","urlProfile":"http://www.imdb.com/name/nm0455767","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NDcxODcwMV5BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1954","placeOfBirth":" Lincoln, Illinois, USA","height":"6' (1.83 m)","bio":"Terry Kinney, the stage, film and television actor, was born on January 29, 1954 in Lincoln, Illinois and attended Illinois State University. While at university, his friend, the aspiring actor Jeff Perry, took Kinney to Chicago to see a production of \"Grease\" in which his best friend, Gary Sinise, was appearing. The like-minded trio of Sinise, Perry and Kinney opened their own Chicago theatrical troupe, the Steppenwolf Theater, in 1973 in the basement of a church in Highland Park. The company's metamorphosis into one of the country's great regional theatrical companies began in 1976, after Kinney and Perry joined it full-time after graduating from college. The theater has, since 1976, put on a full season of ensemble works. The founders of Steppenwolf supported the theater and themselves with odd jobs until he company began financially self-supporting in the early 1980s. Re-located in the old St. Nicholas Theater, Steppenwolf's productions began to attract a steady audience. Steppenwolf flourished artistically and financially in the '80s, and moved once again to its permanent home at 1650 N. Halsted Street in Chicago. At the height of the company's fame, Kinney and Sinise were Steppenwolf's artistic co-directors, winning numerous awards, and even transferring some productions, such as their monumental adaptation of John Steinbeck's \"The Grapes of Wrath\", to Broadway. In addition to Kinney and Sinise, the company included such first rate actors as John Malkovich, Joan Allen and John Mahoney. As an actor, Kinney was nominated for a Tony Award for his appearance as the \"Reverend Casey\" in \"Grapes\". Kinney made his movie debut in 1985, with a bit part in Seven Minutes in Heaven (1985), and has been much in demand as a supporting actor ever since. On television, he had a small but recurring role on Thirtysomething (1987) and appeared as a regular on the HBO prison drama Oz (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NDcxODcwMV5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0455767","name":"Terry Kinney","idIMDB":"nm0455767"},"actorId":"nm0455767","character":"Lamar Quinn","urlCharacter":"http://www.imdb.com/character/ch0429416","main":true},{"actorName":"Wilford Brimley","urlProfile":"http://www.imdb.com/name/nm0000979","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA1MzY5MDY0OV5BMl5BanBnXkFtZTcwNDQwMjYwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 September 1934","placeOfBirth":" Salt Lake City, Utah, USA","birthName":"Anthony Wilford Brimley","height":"5' 8\" (1.73 m)","bio":"He was a farmer and rodeo rider who, after gaining weight, became a blacksmith and then a film actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA1MzY5MDY0OV5BMl5BanBnXkFtZTcwNDQwMjYwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000979","name":"Wilford Brimley","idIMDB":"nm0000979"},"actorId":"nm0000979","character":"William Devasher","urlCharacter":"http://www.imdb.com/character/ch0219699","main":true},{"actorName":"Ed Harris","urlProfile":"http://www.imdb.com/name/nm0000438","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDM4ODc2OV5BMl5BanBnXkFtZTcwNzA5NjQ5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 November 1950","placeOfBirth":" Tenafly, New Jersey, USA","birthName":"Edward Allen Harris","height":"5' 9\" (1.75 m)","bio":"By transforming into his characters and pulling the audience in, Ed Harris has earned the reputation as one of the most talented actors of our time. Ed Harris was born in Tenafly, New Jersey, to Margaret (Sholl), a travel agent, and Robert Lee Harris, a bookstore worker who also sang professionally. Both of his parents were originally from Oklahoma. Harris grew up as the middle child. After graduating high school, he attended New York's Columbia University, where he played football. After viewing local theater productions, Harris took a sudden interest in acting. He left Columbia, headed to Oklahoma, where his parents were living, and enrolled in the University of Oklahoma's theater department. After graduation, he moved to Los Angeles to find work. He started acting in theater and television guest spots. Harris landed his first leading role in a film in cult-favorite George A. Romero's Knightriders (1981). Two years later, he got his first taste of critical acclaim, playing astronaut John Glenn in The Right Stuff (1983). Also that year, he made his New York stage debut in Sam Shepard's \"Fool for Love\", a performance that earned him an Obie for Outstanding Actor. Harris' career gathered momentum after that. In 2000, he made his debut as a director in the Oscar-winning film Pollock (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NDM4ODc2OV5BMl5BanBnXkFtZTcwNzA5NjQ5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000438","name":"Ed Harris","idIMDB":"nm0000438"},"actorId":"nm0000438","character":"Wayne Tarrance","urlCharacter":"http://www.imdb.com/character/ch0010872","main":true},{"actorName":"Holly Hunter","urlProfile":"http://www.imdb.com/name/nm0000456","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNzg1ODA1NF5BMl5BanBnXkFtZTcwNTI4NzQ4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1958","placeOfBirth":" Conyers, Georgia, USA","birthName":"Holly P. Hunter","height":"5' 2\" (1.57 m)","bio":"Holly Hunter was born in Conyers, Georgia, to Opal Marguerite (Catledge), a homemaker, and Charles Edwin Hunter, a part-time sporting goods company representative and farmer with a 250 acre farm. She is the youngest of seven children. Her parents encouraged her talent at an early age, and her first acting part was as Helen Keller in a fifth-grade play. In 1976 she went to Pittsburgh to pursue a degree in drama from Carnegie Mellon University. After graduating in 1980, she went to New York City, where she met playwright Beth Henley in a stalled elevator. Hunter went on to get roles in a number of Henley's southern gothic plays, including Crimes of the Heart and The Miss Firecracker Contest. In 1982 the actress went to Los Angeles. She landed her first starring role in the movies in the Coen brothers' Raising Arizona (1987), a part that is said to have been written with her in mind. She gained stardom in 1987 when she played the driven TV news producer Jane Craig in James L. Brooks' Broadcast News (1987). In 1993 she earned an Academy Award and worldwide acclaim with her performance as a mute bride to a New Zealand planter in La leçon de piano (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIzNzg1ODA1NF5BMl5BanBnXkFtZTcwNTI4NzQ4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000456","name":"Holly Hunter","idIMDB":"nm0000456"},"actorId":"nm0000456","character":"Tammy Hemphill","urlCharacter":"http://www.imdb.com/character/ch0010869","main":true},{"actorName":"David Strathairn","urlProfile":"http://www.imdb.com/name/nm0000657","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MjI5MDg2MF5BMl5BanBnXkFtZTcwNjgwNDM3NQ@@._V1_UY44_CR15,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 January 1949","placeOfBirth":" San Francisco, California, USA","birthName":"David Russell Strathairn","height":"5' 11½\" (1.82 m)","bio":"David Russell Strathairn was born on January 26, 1949 in San Francisco, California. He is the son of Mary Frances (Frazier), a nurse, and Thomas Scott Strathairn, Jr., a physician. He has two siblings, Tom and Anne. His ancestry includes English, Scottish, Irish, Portuguese, Native Hawaiian, and one sixteenth Chinese (the latter three from his paternal grandmother). Strathairn attended Williams College, where he demonstrated great interest in the theater, and first befriended John Sayles, with whom he would later frequently collaborate. Strathairn graduated college and traveled to Florida to visit with his grandfather, but the grandfather passed away while Strathairn was en route. Strathairn, finding himself freshly-arrived and without friends in Florida, decided instead to join the Ringling Brothers Clown College and subsequently worked as a clown for six months in a traveling circus. Relocating to New York State, he spent several years hitchhiking across America to work in local theaters during the summers. During one of these summers Strathairn reunited with Sayles, and this eventually resulted in his role in the highly regarded Return of the Secaucus Seven (1979), Sayle's directorial debut. Thereafter Strathairn developed an extensive resume of supporting roles, which became increasingly substantial as his stature in the industry grew; notable films include Lovesick (1983), Silkwood (1983), L.A. Confidential (1997), and A Map of the World (1999). Sayles frequently casts Strathairn, whose performances can be seen in Sayles' The Brother from Another Planet (1984), Matewan (1987), Eight Men Out (1988), City of Hope (1991), and Passion Fish (1992). Perhaps most notable of his collaborations with Sayles is his superb performance co-starring with Mary Elizabeth Mastrantonio in Limbo (1999). After a string of successful supporting roles in the early 2000s, Strathairn found himself thrust into the role of leading man with his performance as Edward R. Murrow in George Clooney's Good Night, and Good Luck. (2005) Taking on the role of the iconic newsman in the black-and-white drama, Strathairn garnered numerous award mentions including an Academy Award nomination for Best Actor. Following the success of that film, Strathairn traveled easily between low-budget independent films - The Notorious Bettie Page (2005), The Sensation of Sight (2006), My Blueberry Nights (2007), and Howl (2010) among them - and big-budget Hollywood productions, including We Are Marshall (2006), The Spiderwick Chronicles (2008), both The Bourne Ultimatum (2007) and The Bourne Legacy (2012), and Steven Spielberg's biopic Lincoln (2012), in which he plays Secretary of State William Seward. Strathairn has also worked extensively in television, and first became familiar to television viewers as the title character's boss in the series The Days and Nights of Molly Dodd (1987). In addition to narration work for many PBS shows, Strathairn has appeared in the TV series Big Apple (2001), The Sopranos (1999), Monk (2002), and heads the cast of the science-fiction series Alphas (2011). His work in television films has brought him an Emmy Award for Temple Grandin (2010) and an Emmy nominations for Hemingway & Gellhorn (2012). Strathairn married Logan Goodman in 1980, and the couple have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MjI5MDg2MF5BMl5BanBnXkFtZTcwNjgwNDM3NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000657","name":"David Strathairn","idIMDB":"nm0000657"},"actorId":"nm0000657","character":"Ray McDeere","urlCharacter":"http://www.imdb.com/character/ch0010870","main":true},{"actorName":"Gary Busey","urlProfile":"http://www.imdb.com/name/nm0000997","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NjM5NjE5NF5BMl5BanBnXkFtZTYwNTk3MjUz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1944","placeOfBirth":" Goose Creek, Texas, USA","birthName":"William Gary Busey","height":"6' (1.83 m)","bio":"A blond-haired, fair-complexioned actor with a toothy grin and capable of an unsettling glint in his eyes, Gary Busey was born in Goose Creek, Texas, and was raised in Oklahoma. He is the son of Sadie Virginia (Arnett), a homemaker, and Delmar Lloyd Busey, a construction design manager. He has English, as well as Irish, Scottish, and German, ancestry. He graduated from Nathan Hale High School in Tulsa, Oklahoma in 1962 and for a while was a professional musician. A talented drummer, he played in several bands, including those of country-and-western legends Leon Russell, Kris Kristofferson and Willie Nelson. Busey's first film appearance was as a biker in the low-budget Angels Hard as They Come (1971) and, over the next few years, he landed several film roles generally as a country hick/redneck or surly, rebellious types. His real breakthrough came in the dynamic film The Buddy Holly Story (1978), with Busey taking the lead role as Buddy Holly, in addition to playing guitar and singing all the vocals! His stellar performance scored him a Best Actor nomination and the attention of Hollywood taking overcasting agents. Next up, he joined fellow young actors William Katt and Jan-Michael Vincent as surfing buddies growing up together in the cult surf film Big Wednesday (1978), directed by John Milius. However, a string of appearances in somewhat mediocre films took him out of the spotlight for several years, until he played the brutal assassin Mr. Joshua trying to kill Los Angeles cops Mel Gibson and Danny Glover in the runaway mega-hit Lethal Weapon (1987). Further strong roles followed, including alongside Danny Glover once again in Predator 2 (1990). He was back on the beaches, this time tracking bank robbers with FBI agent Keanu Reeves, in Point Break - Extrême limite (1991) and nearly stole the show as a psychotic Navy officer in league with terrorists led by Tommy Lee Jones taking over the USS Missouri in the highly popular Piège en haute mer (1992). The entertaining Busey has continued to remain busy in front of the cameras and has certainly developed a minor cult following among many film fans. Plus, he's also the proud father of accomplished young actor Jake Busey, whose looks make him almost a dead ringer for his famous father.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NjM5NjE5NF5BMl5BanBnXkFtZTYwNTk3MjUz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000997","name":"Gary Busey","nicknames":["Barry Goosey"],"idIMDB":"nm0000997"},"actorId":"nm0000997","character":"Eddie Lomax","urlCharacter":"http://www.imdb.com/character/ch0429417","main":true},{"actorName":"Steven Hill","urlProfile":"http://www.imdb.com/name/nm0384696","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjEzMDM2NjMyOV5BMl5BanBnXkFtZTcwNjY0MjYxOA@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1922","placeOfBirth":" Seattle, Washington, USA","birthName":"Solomon Krakovsky","height":"5' 11½\" (1.82 m)","bio":"Born in Seattle, Washington, in 1922, as Solomon Krakovsky, to Russian Jewish immigrants, Hill became interested in the theater as a little boy. After graduation from high school, he served in the Naval Reserve (1940-44). From there, he worked alongside a young, unknown star Marlon Brando in \"A Flag is Born.\" His real acting debut came about in 1950, when he co-starred opposite Hedy Lamarr in A Lady Without Passport (1950), and his career took off from there. For the rest of the 1950s and 1960s, he co-starred in B-movies such as: The Goddess (1958), Kiss Her Goodbye (1959), A Child Is Waiting (1963), The Slender Thread (1965). Hill also became a leading character actor guest-starring in a wide variety of shows such as: Schlitz Playhouse (1951), Danger (1950), Playwrights '56 (1955), Studio One in Hollywood (1948), Playhouse 90 (1956), Naked City (1958), Espionage (1963), Dr. Kildare (1961), Ben Casey (1961), among many others. Another guest-starring role on Rawhide (1959), led him to starring on Mission: Impossible (1966). Though the series lasted seven seasons, Hill was not pleased with his role because he refused to abide by the production schedule that required working on Saturday, the Jewish Sabbath, being an Orthodox Jew. Hill was fired after 1 season, and was replaced in the series by Peter Graves. After his firing, he went on a sabbatical from acting, to focus on selling homes in real estate, hence he moved to New York. After his long absence from acting, he returned to the small screen with the TV mini-series, King (1978). The 1980s saw Hill returning to the box office, co-starring in such blockbuster films such as: It's My Turn (1980), opposite Jill Clayburgh and Michael Douglas, Eyewitness (1981), Yentl (1983), Garbo Talks (1984), opposite Anne Bancroft and Carrie Fisher, On Valentine's Day (1986), and it's sequel, Courtship (1987), he played a Mafia Don in Arnold Schwarzenegger's another blockbuster film, Raw Deal (1986), then, in a blockbuster ten movie Running on Empty (1988), followed by The Boost (1988), White Palace (1990), and one of the last films, Billy Bathgate (1991). In the 1990s, at 68, after a 23-year-absence from the small screen, he reestablished his career, as the last minute replacement for a starring role in Law & Order (1990), where he played the role of a pragmatic District Attorney, Adam Schiff, a character whom everyone grew to love. Despite not appearing in the pilot episode of the series, he quickly became one of Hollywood's likable and bankable stars, where he often had scenes, that were filmed, only in court. His co-stars on the show consisted of actors who have also made bankable names like Hill himself like Chris Noth, former Pee-wee's Playhouse (1986) alumnae, S. Epatha Merkerson, Sam Waterston, and newcomers Jill Hennessy and Benjamin Bratt. On Law & Order (1990) he was also nominated for Emmies twice, but did not win. The entire cast was shocked when, in 2000, he left his role to enjoy his retirement. Before then, the entire cast appeared with Hill on Larry King Live (1985), to say goodbye to a legendary star. Today, he lives in retirement.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjEzMDM2NjMyOV5BMl5BanBnXkFtZTcwNjY0MjYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0384696","name":"Steven Hill","idIMDB":"nm0384696"},"actorId":"nm0384696","character":"F. Denton Voyles","urlCharacter":"http://www.imdb.com/character/ch0010875","main":true},{"actorName":"Tobin Bell","urlProfile":"http://www.imdb.com/name/nm0068551","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM5OTE1MjA3Nl5BMl5BanBnXkFtZTgwOTAxNjk4MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 August 1942","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Joseph H. Tobin Jr.","height":"5' 10½\" (1.79 m)","bio":"Tobin Bell is an American actor with a career in film, television and theater spanning three decades. He was born in Queens, New York and raised in Weymouth, Mass. His mother is the British actress Eileen Bell. He is perhaps best known for his role as the iconic villain \"Jigsaw\" in the Saw film series...for which he received MTV Award nominations in 2007 & 2009. He's a graduate of Boston University and has a Masters Degree in Education from Montclair State University. He studied acting with Sanford Meisner at the Neighborhood Playhouse and Lee Strasberg at the Actors Studio in New York. He is a lifetime member of The Actors Studio and a member of The Academy of Motion Picture Arts and Sciences.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM5OTE1MjA3Nl5BMl5BanBnXkFtZTgwOTAxNjk4MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0068551","name":"Tobin Bell","idIMDB":"nm0068551"},"actorId":"nm0068551","character":"The Nordic Man","urlCharacter":"http://www.imdb.com/character/ch0429418","main":true},{"actorName":"Barbara Garrick","urlProfile":"http://www.imdb.com/name/nm0308241","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MjI1OTY5OV5BMl5BanBnXkFtZTYwMDc3MTU4._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1965","placeOfBirth":" New York City, New York, USA","height":"5' 5\" (1.65 m)","bio":"Barbara Garrick was born on December 3, 1965 in New York City, New York, USA. She is an actress, known for One Life to Live (1968), Jumper (2008) and Guiding Light (1952).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MjI1OTY5OV5BMl5BanBnXkFtZTYwMDc3MTU4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0308241","name":"Barbara Garrick","idIMDB":"nm0308241"},"actorId":"nm0308241","character":"Kay Quinn","urlCharacter":"http://www.imdb.com/character/ch0429419","main":true},{"actorName":"Jerry Hardin","urlProfile":"http://www.imdb.com/name/nm0362222","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzYzMjU1N15BMl5BanBnXkFtZTcwOTcwNjAxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 November 1929","placeOfBirth":" Dallas, Texas, USA","birthName":"Jerry Waynn Hardin","height":"6' 1\" (1.85 m)","bio":"A highly engaging, charismatic, and reliable character actor with a long and distinguished career spanning half a century, Jerry Hardin has been gracing both the big and small screen, and stage, with many enjoyable performances, highlighted by a relaxed and pleasing Southern twang. Born November 20, 1929, in Dallas, Texas, where his father was a rancher, Hardin was raised outside the city, where he first began acting in school productions. This would lead to a scholarship to Southwestern University in Georgetown, Texas, and a Fulbright scholarship to the Royal Academy for Dramatic Art in London. He had his first (uncredited) film role in the classic drive-in flick, Thunder Road (1958), starring Robert Mitchum, and, by 1961, had racked up an impressive amount of over 75 theatre credits. He became incredibly prolific in the 1970's, when his film career really took off, and he also started appearing regularly on TV series, including Gunsmoke (1955), Starsky and Hutch (1975), The Streets of San Francisco (1972), Little House on the Prairie (1974), The Rockford Files (1974), Miami Vice (1984), L.A. Law (1986), Melrose Place (1992), Murder, She Wrote (1984) and Dr. Quinn, Medicine Woman (1993). A particularly memorable performance, by Mr. Hardin in this medium, was that of Mark Twain in episodes of Star Trek: The Next Generation (1987). He would also prove to be in high demand for film roles, appearing in the likes of Wolf Lake (1980), Heartland (1979), 1941 (1979), Honky Tonk Freeway (1981), Reds (1981), Missing (1982), Honkytonk Man (1982), Cujo (1983), The Falcon and the Snowman (1985), Warning Sign (1985), Big Trouble in Little China (1986), Wanted: Dead or Alive (1987), The Hot Spot (1990), The Firm (1993), Ghosts of Mississippi (1996), Hidalgo (2004) and Are We There Yet? (2005). His performance as one of the subtly sinister senior partners in The Firm (1993) impressed The X-Files (1993) creator Chris Carter enough that Carter would create the character of \"Deep Throat\" with him in mind, and it's this role that is definitely one of Hardin's most famous. A noteworthy stage performance of his was in the play, \"The Rainmaker\", working alongside Jayne Atkinson, Woody Harrelson and David Aaron Baker. Hardin's wife is actress and acting teacher Diane Hardin (her students have included Leonardo DiCaprio, Hilary Swank, Stephen Dorff, River Phoenix, Kellie Martin and Christopher Masterson), his daughter is actress Melora Hardin, and his son Shawn Hardin was chief operating officer, in-charge-of product, for NBC-1 in San Francisco.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3MzYzMjU1N15BMl5BanBnXkFtZTcwOTcwNjAxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0362222","name":"Jerry Hardin","idIMDB":"nm0362222"},"actorId":"nm0362222","character":"Royce McKnight","urlCharacter":"http://www.imdb.com/character/ch0010877","main":true},{"actorName":"Paul Calderon","urlProfile":"http://www.imdb.com/name/nm0129538","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY2NzY5MDI5Nl5BMl5BanBnXkFtZTcwNDIzNjMzMw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1959","placeOfBirth":" Puerto Rico","bio":"Paul Calderon was born in 1959 in Puerto Rico. He is an actor, known for Pulp Fiction (1994), One Life to Live (1968) and 21 Grams (2003). He is married to Cathy. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY2NzY5MDI5Nl5BMl5BanBnXkFtZTcwNDIzNjMzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0129538","name":"Paul Calderon","idIMDB":"nm0129538"},"actorId":"nm0129538","character":"Thomas Richie","urlCharacter":"http://www.imdb.com/character/ch0429420","main":true}],"seasons":[],"idIMDB":"tt0106918","urlIMDB":"http://www.imdb.com/title/tt0106918","business":{"budget":{"money":"$42,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"£6,393,211","country":"UK","day":"17","month":"10","year":"1993","remarks":""},{"money":"£2,322,121","country":"UK","day":"16","month":"09","year":"1993","remarks":""},{"money":"SEK","country":"16,990,175","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1992/\">1992</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 34 min (154 min)"],"soundMix":["Dolby Stereo"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA (prints)","Technicolor, New York (NY), USA (dailies)"],"filmLength":["4,560 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.8","metascore":"58","filmingLocations":[{"location":"125 Front Street, Downtown, Memphis, Tennessee, USA"}],"rated":"R","awards":[{"award":"Academy Awards, USA 1994","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Actress in a Supporting Role","names":[{"name":"Holly Hunter","id":"nm0000456","role":null}]},{"category":"Best Music, Original Score","names":[{"name":"Dave Grusin","id":"nm0006115","role":null}]}]}]},{"award":"BAFTA Awards 1994","titlesAwards":[{"titleAwardOutcome":"Nominated BAFTA Film Award","categories":[{"category":"Best Actress in a Supporting Role","names":[{"name":"Holly Hunter","id":"nm0000456","role":null}]}]}]},{"award":"BMI Film & TV Awards 1994","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"","names":[{"name":"Dave Grusin","id":"nm0006115","role":null}]}]}]},{"award":"Grammy Awards 1994","titlesAwards":[{"titleAwardOutcome":"Nominated Grammy","categories":[{"category":"Best Instrumental Composition Written for a Motion Picture or for Television","names":[{"name":"Dave Grusin","id":"nm0006115","role":null}]}]}]},{"award":"MTV Movie Awards 1994","titlesAwards":[{"titleAwardOutcome":"Nominated MTV Movie Award","categories":[{"category":"Best Male Performance","names":[{"name":"Tom Cruise","id":"nm0000129","role":null}]},{"category":"Most Desirable Male","names":[{"name":"Tom Cruise","id":"nm0000129","role":null}]}]}]},{"award":"People's Choice Awards, USA 1994","titlesAwards":[{"titleAwardOutcome":"Won People's Choice Award","categories":[{"category":"Favorite Dramatic Motion Picture","names":[]}]}]},{"award":"Yoga Awards 1994","titlesAwards":[{"titleAwardOutcome":"Won Yoga Award","categories":[{"category":"Worst Foreign Actor","names":[{"name":"Tom Cruise","id":"nm0000129","role":null}]}]}]}],"votes":"92,636","type":"Movie","companyCreditsSimple":[{"idCompany":"co0022730","name":"Davis Entertainment"},{"idCompany":"co0038270","name":"Mirage Enterprises"},{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["law","fbi","law firm","lawyer","bar","harvard","file","bar exam","fbi agent","death","fraud","corruption","mafia","judicial system","judiciary","judicial","confession","marital trouble","usa","public phone","pay phone","secretly photographed","incriminating photograph","apple macintosh computer","cover up","character repeating someone else's dialogue","fear","judge","assassination attempt","prison guard","scuba diving","underwater scene","security camera","security guard","washington monument","louisiana","honey trap","snow","suitcase","moral dilemma","gas station","bus","truck stop","cable car","hotel","museum","deception","shotgun","beaten to death","beating","kicked in the stomach","silencer","revolver","pistol","cigar smoking","release from prison","ex convict","prisoner","cigarette smoking","dog","wearing a sound wire","wiretapping","barbecue","southern accent","diner","gun hidden under table","survival","private detective","walkie talkie","job interview","montage","restaurant","cell phone","seaplane","swimming pool","private jet","airplane","f word","parking garage","organized crime","graduate student","newspaper clipping","interrogation","photograph","funeral","beach","slow motion scene","1990s","tax evader","suspense","red stripe beer","job offer","new job","mickey finn","working late","scene during opening credits","character says i love you","note","troubled marriage","marital infidelity","fax machine","fax transmission","photocopier","kicked in the chest","kicked in the leg","hit on the knee","sex on a beach","compromising picture","client attorney privilege","school teacher","female teacher","file box","bugged room","two word title","killing the wrong person","shot in the chest","shot in the shoulder","running on a bridge","u haul trailier","recording conversation","secret recording","audio recording","pet dog","dog track","greyhound bus","redheaded woman","killed in chair","almost hit by a car","foot chase","running to escape","jumping out a window","throwing a chair through a window","reference to al capone","reference to yasser arafat","reference to julio iglesias","shot in the ear","violence","theft","drugged drink","legal ethics","dangerous friend","mobster","bald head","secretary","convict","u.s. justice department","conspiracy","suspicion","cayman islands","boating accident","mentor protege relationship","protege","mentor","husband wife relationship","teacher","employer employee relationship","big business","corporation","harvard university","infidelity","unfaithfulness","extramarital affair","elevator","cynicism","yacht","unfaithful husband","truck","shot in the leg","mafia boss","jail","italian american","carribean sea","attorney","reference to elvis presley","elvis impersonator","office","money laundering","investigator","investigation","hitman","graduation","gangster","detective","blackmail","monorail","memphis tennessee","murder","blockbuster","prison","southern u.s.","adultery","surveillance","boston massachusetts","chase","framed","paranoia","brother brother relationship","based on novel","title spoken by character","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:14:47"}}