{"data":{"movies":[{"title":"Damage","originalTitle":"","year":"1992","releaseDate":"19930122","directors":[{"name":"Louis Malle","id":"nm0001501"}],"writers":[{"name":"David Hare","id":"nm0002376"},{"name":"Josephine Hart","id":"nm0366375"}],"runtime":"111 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjBjMDEwMTgtOWMxOS00YTc4LTllNWMtNDZmNTQxYjgxM2Q5XkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1.jpg","countries":["UK","France"],"languages":["English","French","German","Italian"],"genres":["Drama","Romance"],"plot":"A member of Parliament (Irons) falls passionately in love with his son's fiancée. They pursue their affair with obsessive abandon despite the dangers of discovery and what it would do to his complacent life and his son. Completely obsessed, he wants to give up his current lifestyle to be with her. She has no intention of allowing him to do this, preferring to have her marriage to the son as a cover. They are eventually discovered, and must deal with the damage. Based on the novel by Josephine Hart.","simplePlot":"A member of Parliament falls passionately in love with his son's fiancée despite the dangers of discovery.","actors":[{"actorName":"Jeremy Irons","urlProfile":"http://www.imdb.com/name/nm0000460","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5Mzg2NDY5OV5BMl5BanBnXkFtZTcwMDQwNzA0Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 September 1948","placeOfBirth":" Cowes, Isle of Wight, England, UK","birthName":"Jeremy John Irons","height":"6' 2\" (1.88 m)","bio":"Elegant and handsome British actor Jeremy Irons was born in Cowes, Isle of Wight, a small island just off the south coast of England. He is the son of Barbara Anne Brereton (Sharpe) and Paul Dugan Irons, an accountant. Young Jeremy didn't prove very fond of figures. A typical islander, he used to go to mainland England only once a year. He wound up being grounded when his family settled down in Hertfordshire. At the age of 13 he enrolled in Sherborne School, Dorset, where he was happy as he could practise his favorite sport, horse-riding. Before becoming an actor, he had considered a veterinarian surgeon's career. He trained at the Bristol Old Vic School for two years, then joined Bristol Old Vic repertory company where he gained much experience working in everything from Shakespeare to contemporary dramas. He moved to London in 1971 and had a number of odd jobs before landing the role of \"John the Baptist\" in the hit musical \"Godspell\". He went on to a successful early career in the West End theatre and on TV, and debuted on-screen in Nijinsky (1980). In the early 80s, he gained international attention with his starring role in the Granada Television serial adaptation of Evelyn Waugh's classic novel Brideshead Revisited (1981), after which he was much in demand as a romantic leading man. He went on to a steady film career. In 1984, he debuted on Broadway opposite: Glenn Close in Tom Stoppard's \"The Real Thing\" and, in the mid-80s, he appeared in three lead roles with the Royal Shakespeare Company. Once described as 'the thinking woman's pin up', he has made his name in thought provoking films such as David Cronenberg's Faux-semblants (1988), for which he won the New York Critics Best Actor Award. He gained a Golden Globe Award in addition to an Oscar for Best Actor in 1990 for his role as Claus von Bulow in Reversal of Fortune (1990) alongside Glenn Close. Among his many achievements, his role as Professor Higgins in Loewe-Lerner's famous musical \"My Fair Lady\" mustn't be forgotten. It was in London, back in 1987. He is married to actress Sinéad Cusack, with whom he appeared in Waterland (1992) and in the Royal Shakespeare Company plays. He appeared with his son Samuel Irons and his father-in-law Cyril Cusack in the film Roald Dahl's Danny the Champion of the World (1989). His son Max Irons is also an actor.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5Mzg2NDY5OV5BMl5BanBnXkFtZTcwMDQwNzA0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000460","name":"Jeremy Irons","idIMDB":"nm0000460"},"actorId":"nm0000460","character":"Dr. Stephen Fleming","urlCharacter":"http://www.imdb.com/character/ch0057495","main":true},{"actorName":"Juliette Binoche","urlProfile":"http://www.imdb.com/name/nm0000300","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzI4MDQ5Nl5BMl5BanBnXkFtZTYwOTQ5NTc0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 March 1964","placeOfBirth":" Paris, France","height":"5' 6\" (1.68 m)","bio":"Juliette Binoche was born in Paris, France, to Monique Yvette Stalens, a director, teacher, and actress, and Jean-Marie Binoche, a sculptor, director, and actor. Her mother was born in Czestochowa, Poland, of French, Walloon Belgian, and Polish descent, while her father is French. Juliette was only 23 when she first attracted the attention of international film critics with The Unbearable Lightness of Being (1988). Roger Ebert, Chicago Sun-Times film critic with an international following of his books on film and TV reviews, wrote that she was \"almost ethereal in her beauty and innocence\". That innocence was gone by the time Binoche completed Louis Malle's Damage (1992) (aka \"Fatale\"). In an interview after the film was released, Binoche said: \"Malle was trying direct and wanted something more sophisticated\". A year later, Krzysztof Kieslowski's Three Colors: Blue (1993) was added to her film credits. After a sabbatical from film-making to become a mother in 1994, Binoche was selected as the heroine of France's most expensive ($35 million) movie ever: The Horseman on the Roof (1995). More recently, she has made The English Patient (1996), for which she won an Oscar for 'Best supporting actress' and Chocolat (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzI4MDQ5Nl5BMl5BanBnXkFtZTYwOTQ5NTc0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000300","name":"Juliette Binoche","idIMDB":"nm0000300"},"actorId":"nm0000300","character":"Anna Barton","urlCharacter":"http://www.imdb.com/character/ch0057491","main":true},{"actorName":"Miranda Richardson","urlProfile":"http://www.imdb.com/name/nm0001669","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NzM2ODE5N15BMl5BanBnXkFtZTcwNzAyMDc0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1958","placeOfBirth":" Southport, Lancashire, England, UK","birthName":"Miranda Jane Richardson","height":"5' 5\" (1.65 m)","bio":"Miranda Richardson was born in Southport, Lancashire, England on March 3, 1958, to Marian Georgina (Townsend) and William Alan Richardson, a marketing executive. She has one sister, eight years her senior. Her parents and sister are not involved in the performing arts. At an early age she performed in school plays, having shown a talent and desire to \"turn herself into\" other people. She has referred to it as \"an emotional fusion; you think yourself into them\". This mimicry could be of school friends or film stars. She left school (Southport High School for Girls) at the age of 17, and originally intended becoming a vet. She also considered studying English literature in college, but decided to concentrate on drama and enrolled at the Bristol Old Vic Theatre School (as did many well-known British actors). After three years she graduated and moved into repertory theatre. She became affiliated with the Library Theatre in Manchester in 1979, where she became an assistant stage manager. She obtained her Equity card, and after several regional productions, first appeared on the London stage (Moving at Queens Theatre) in 1981. British television roles soon followed, and then film. Since then, Miranda has moved into the international arena, and has made films in America, France and Spain. Television work (on both sides of the Atlantic) continues, as does some stage work. Her roles are diverse, but powerful and engaging. She has been quoted as stating \"what I basically like is doing things I haven't done before\" and this continually comes through in the variety of roles she has played in her career. She is also selective in the roles she takes, being uninterested in performing in the standard Hollywood fare, and preferring more offbeat roles. She was approached to play the Glenn Close role in Fatal Attraction (1987), but found it \"regressive in its attitudes\". Her attitude is summed up by a quote from an interview that appeared in the New York Times (Dec 27 1992): \"I would rather do many small roles on TV, stage or film than one blockbuster that made me rich but had no acting. And if that's the choice I have to make, I think I've already made it\". According to \"1994 Current Biography Yearbook\", she resides in South London with her two Siamese cats, Otis and Waldo. She has now moved to West London. Her hobbies include drawing, walking, gardening, fashion, falconry, and music. She, by her own admission, is a loner and lives rather modestly. An actor who studied with Ms Richardson at the Bristol Old Vic Theatre in the late 1970s described her as \"a strong minded, specially gifted, rather pretty young woman who enjoys wearing jewelry. She wore toe rings, which in the late 1970s and especially in England, were a rarity and considered rather racy.\" He also remarked on her drive, even then, to be an actress of the highest caliber.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4NzM2ODE5N15BMl5BanBnXkFtZTcwNzAyMDc0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001669","name":"Miranda Richardson","idIMDB":"nm0001669"},"actorId":"nm0001669","character":"Ingrid Fleming","urlCharacter":"http://www.imdb.com/character/ch0153413","main":true},{"actorName":"Rupert Graves","urlProfile":"http://www.imdb.com/name/nm0001291","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MzUwNzk0NF5BMl5BanBnXkFtZTYwNzM5NjEz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 June 1963","placeOfBirth":" Weston-super-Mare, Somerset, England, UK","height":"5' 11\" (1.8 m)","bio":"Born in a seaside resort town, Britain's Rupert Graves was born a rebel, resisting authority and breaking rules at an early age. In his teens he became a punk rocker and even found work as a circus clown and in traveling comedy troupes. In 1983 he made his professional stage debut in \"The Killing of Mr. Toad\" and went on to co-star with Harvey Fierstein in the London production of \"Torch Song Trilogy.\" It didn't take long for somebody to take note of Rupert's boyish good looks and offbeat versatility. By the mid-80s he was a presence in quality films and TV, primarily period pieces such as his Freddy Honeychurch in A Room with a View (1985) and the gay drama Maurice (1987). Rupert moved to the front of the class quickly. His decisions to select classy, obscure arthouse films as opposed to box-office mainstream may have put a dimmer on his star, but earned him a distinct reputation as a daring, controversial artist in the same vein as Johnny Depp. In A Handful of Dust (1988) he essayed the role of a penniless status seeker who beds down a married socialite; in Different for Girls (1996) he was the lover of a male-to-female transsexual woman; in The Innocent Sleep (1996) he played a derelict drunk; and in the award-winning Intimate Relations (1996) he portrayed an aimless boarder who has a relationship with both the mother/landlady and her daughter. Equally adept at costume and contemporary drama, Rupert more recently earned rave reviews on Broadway with \"Closer\" in 2000 and \"The Elephant Man\" in 2002. Rupert is currently married to production coordinator Susie Lewis.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0MzUwNzk0NF5BMl5BanBnXkFtZTYwNzM5NjEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001291","name":"Rupert Graves","idIMDB":"nm0001291"},"actorId":"nm0001291","character":"Martyn Fleming","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ian Bannen","urlProfile":"http://www.imdb.com/name/nm0000846","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NDQyMDU4NF5BMl5BanBnXkFtZTYwMTk3OTU3._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1928","placeOfBirth":" Airdrie, Lanarkshire, Scotland, UK","height":"6' 1\" (1.85 m)","bio":"Scottish character actor and occasional leading man who enlivened scores of fine films in Britain and America. His father was a lawyer in a small town in Lanarkshire. Bannen served in the army and attended Ratcliffe College, Leicestershire. His first acting role came in a 1947 Dublin production of \"Armlet of Jade\". He became a successful figure on the London stage, making a name for himself in the plays of both William Shakespeare and Eugene O'Neill. He was an original member of the Royal Shakespeare Company and appeared on Broadway as well. His film debut occurred in the mid-1950s, and he quickly rose to prominence, primarily in a wide range of supporting roles. His performance as \"Crow\" in The Flight of the Phoenix (1965) won him an Oscar nomination as Best Supporting Actor. Thirty years and scores of films later, Bannen was given the Lifetime Achievement Award of the British Academy of Film and Television Arts. Long after his leading man days had passed, he won new acclaim for his role as the touchingly crafty villager in Waking Ned Devine (1998). The following year he died in an automobile accident. He was survived by his wife of 23 years.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NDQyMDU4NF5BMl5BanBnXkFtZTYwMTk3OTU3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000846","name":"Ian Bannen","idIMDB":"nm0000846"},"actorId":"nm0000846","character":"Edward Lloyd","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Stormare","urlProfile":"http://www.imdb.com/name/nm0001780","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUyMDQ0MTEyNF5BMl5BanBnXkFtZTYwNDYxMDkz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1953","placeOfBirth":" Kumla, Örebro län, Sweden","birthName":"Peter Ingvar Storm","height":"6' 2\" (1.88 m)","bio":"Peter Stormare was born in Arbrå, Gävleborgs län, Sweden, to Gunhild (Holm) and Karl Ingvar Storm. He began his acting career at the Royal National Theatre of Sweden, performing for eleven years. In 1990 he became the Associate Artistic Director at the Tokyo Globe Theatre and directed productions of many Shakespeare plays, including \"Hamlet\". In 1993 he moved to New York, where he appeared in English productions. He continues to work in both the United States and his his homeland of Sweden. He resides in Los Angeles, California, USA, with his wife.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTUyMDQ0MTEyNF5BMl5BanBnXkFtZTYwNDYxMDkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001780","name":"Peter Stormare","idIMDB":"nm0001780"},"actorId":"nm0001780","character":"Peter Wetzler","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gemma Clarke","urlProfile":"http://www.imdb.com/name/nm0164768","urlPhoto":"","biography":{"bio":"Gemma Clarke is an actress, known for Damage (1992). She has been married to Stark Sands since July 9, 2011. They have one child.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0164768","name":"Gemma Clarke","idIMDB":"nm0164768"},"actorId":"nm0164768","character":"Sally Fleming","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Julian Fellowes","urlProfile":"http://www.imdb.com/name/nm0271501","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3Mjg1OTg0NV5BMl5BanBnXkFtZTcwMTM1Njk5Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 August 1949","placeOfBirth":" Cairo, Egypt","birthName":"Julian Alexander Fellowes","bio":"Julian Fellowes was born on August 17, 1949 in Cairo, Egypt as Julian Alexander Fellowes. He is an actor and writer, known for Downton Abbey (2010), Gosford Park (2001) and The Tourist (2010). He has been married to Emma Joy Kitchener-Fellowes since April 28, 1990. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3Mjg1OTg0NV5BMl5BanBnXkFtZTcwMTM1Njk5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0271501","name":"Julian Fellowes","idIMDB":"nm0271501"},"actorId":"nm0271501","character":"Donald Lyndsay, MP","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leslie Caron","urlProfile":"http://www.imdb.com/name/nm0001989","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjM5MTkyMV5BMl5BanBnXkFtZTYwODIwMDM2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 July 1931","placeOfBirth":" Boulogne-Billancourt, Seine [now Hauts-de-Seine], France","birthName":"Leslie Claire Margaret Caron","height":"5' 1½\" (1.56 m)","bio":"Actress and dancer. Gene Kelly got her to the movies for the film An American in Paris (1951) in 1951. Got a world-wide reputation for her roles in Lili (1953) (1953) and Gigi (1958) (1958).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNjM5MTkyMV5BMl5BanBnXkFtZTYwODIwMDM2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001989","name":"Leslie Caron","idIMDB":"nm0001989"},"actorId":"nm0001989","character":"Elizabeth Prideaux","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Doyle","urlProfile":"http://www.imdb.com/name/nm0236507","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAyODc1ODIwMV5BMl5BanBnXkFtZTgwMzg5MTk0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1942","placeOfBirth":" Ballyfarnon, Co. Roscommon, Ireland","bio":"Tony Doyle (16 January 1942 - 28 January 2000) was an Irish television and film actor. He attended Belcamp College, Dublin as a boarder before going onto University College Dublin (which he did not finish). He got his first big break playing Father Sheehy in the RTE weekly soap The Riordans (1965) in the 1960s and 1970s. In 1998, he won an Irish Film and Television Academy Award for best leading performance for his role in Amongst Women (1998). He also won a Silver Nymph award at the Monte Carlo TV Awards. His most famous film role saw Tony as the head of the SAS, Colonel Hadley, in the 1982 British film Who Dares Wins. His other film roles included appearances in Ulysses (1967), Quackser Fortune Has a Cousin in the Bronx (1970), Loophole (1981), Eat the Peach (1986), Secret Friends (1991), Damage (1992), Circle of Friends (1995), and as Tom French in I Went Down (1997). He died at St Thomas's Hospital in Lambeth, London, England. Brian Quigley, Doyle's Ballykissangel character, was written out of the show in the first episode of the final series where Quigley fakes his own suicide (he supposedly drowned himself) and flees to Brazil. The Tony Doyle Bursary for New Writing was launched by the BBC following his death. Judges include his friend and Ballykissangel co-star Lorcan Cranitch.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzAyODc1ODIwMV5BMl5BanBnXkFtZTgwMzg5MTk0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0236507","name":"Tony Doyle","idIMDB":"nm0236507"},"actorId":"nm0236507","character":"Prime Minister","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ray Gravell","urlProfile":"http://www.imdb.com/name/nm0336204","urlPhoto":"","biography":{"dateOfBirth":"12 September 1951","placeOfBirth":" Kidwelly, Wales, UK","bio":"Ray Gravell was born on September 12, 1951 in Kidwelly, Wales. He was an actor, known for Damage (1992), Darklands (1996) and Very Annie Mary (2001). He was married to Marie Roberts. He died on October 31, 2007 in Majorca, Spain.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0336204","name":"Ray Gravell","idIMDB":"nm0336204"},"actorId":"nm0336204","character":"Raymond","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susan Engel","urlProfile":"http://www.imdb.com/name/nm0257146","urlPhoto":"","biography":{"dateOfBirth":"25 March 1935","placeOfBirth":" Vienna, Austria","height":"5' 9\" (1.75 m)","bio":"Susan Engel was born on March 25, 1935 in Vienna, Austria. She is an actress, known for The Cedar Tree (1976), Damage (1992) and King Lear (1971). She has been married to Sylvester Morand since 1968. They have one child.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0257146","name":"Susan Engel","idIMDB":"nm0257146"},"actorId":"nm0257146","character":"Miss Snow","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Thewlis","urlProfile":"http://www.imdb.com/name/nm0000667","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA3MjM4NTE0NV5BMl5BanBnXkFtZTcwOTU1OTY4NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 March 1963","placeOfBirth":" Blackpool, Lancashire, England, UK","birthName":"David Wheeler","height":"6' 2½\" (1.89 m)","bio":"David Thewlis was born David Wheeler in 1963 in Blackpool, Lancashire, to Maureen (Thewlis) and Alec Raymond Wheeler, and lived with his parents above their combination wallpaper and toy shop during his childhood. Originally, he came to London with his band Door 66, however he changed his plans and entered Guildhall School of Drama. He had minor roles in films and TV until he took the main role in Naked (1993). The film won him several awards including the New York Critics Award. He has since been in many other films including DragonHeart (1996), Restoration (1995), Black Beauty (1994) and recently took the part of Professor Remus John Lupin in Harry Potter and the Prisoner of Azkaban (2004). He has lived with the British actress Anna Friel since 2001.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTA3MjM4NTE0NV5BMl5BanBnXkFtZTcwOTU1OTY4NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000667","name":"David Thewlis","idIMDB":"nm0000667"},"actorId":"nm0000667","character":"Detective","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Benjamin Whitrow","urlProfile":"http://www.imdb.com/name/nm0926368","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTkxNTAyNF5BMl5BanBnXkFtZTgwOTg1Mjg0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1937","placeOfBirth":" Oxford, England, UK","birthName":"Benjamin John Whitrow","bio":"Benjamin Whitrow was born on February 17, 1937 in Oxford, England as Benjamin John Whitrow. He is an actor, known for Chicken Run (2000), Damage (1992) and Bomber (2009). He has been married to Catherine Cook since 1972. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTkxNTAyNF5BMl5BanBnXkFtZTgwOTg1Mjg0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0926368","name":"Benjamin Whitrow","idIMDB":"nm0926368"},"actorId":"nm0926368","character":"Civil Servant","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeff Nuttall","urlProfile":"http://www.imdb.com/name/nm0638346","urlPhoto":"","biography":{"dateOfBirth":"8 July 1933","placeOfBirth":" Clitheroe, Lancashire, England, UK","birthName":"Jeffrey Nuttall","bio":"Jeff Nuttall was born on July 8, 1933 in Clitheroe, Lancashire, England as Jeffrey Nuttall. He was an actor, known for The World Is Not Enough (1999), Damage (1992) and The Baby of Mâcon (1993). He was married to Jane Louch. He died on January 4, 2004 in Abergavenny, Monmouthshire, Wales.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0638346","name":"Jeff Nuttall","idIMDB":"nm0638346"},"actorId":"nm0638346","character":"Trevor Leigh Davies MP","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0104237","urlIMDB":"http://www.imdb.com/title/tt0104237","business":{"budget":null,"openingWeekend":null,"gross":[],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 51 min (111 min)"],"soundMix":["Dolby SR"],"color":["Color"],"aspectRatio":["1.66 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.9","filmingLocations":[{"location":"London, England, UK"}],"rated":"R","awards":[{"award":"Academy Awards, USA 1993","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Actress in a Supporting Role","names":[{"name":"Miranda Richardson","id":"nm0001669","role":null}]}]}]},{"award":"Golden Globes, USA 1993","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Performance by an Actress in a Supporting Role in a Motion Picture","names":[{"name":"Miranda Richardson","id":"nm0001669","role":null}]}]}]},{"award":"BAFTA Awards 1993","titlesAwards":[{"titleAwardOutcome":"Won BAFTA Film Award","categories":[{"category":"Best Actress in a Supporting Role","names":[{"name":"Miranda Richardson","id":"nm0001669","role":null}]}]}]},{"award":"César Awards, France 1993","titlesAwards":[{"titleAwardOutcome":"Nominated César","categories":[{"category":"Best Actress (Meilleure actrice)","names":[{"name":"Juliette Binoche","id":"nm0000300","role":null}]}]}]},{"award":"London Critics Circle Film Awards 1994","titlesAwards":[{"titleAwardOutcome":"Won ALFS Award","categories":[{"category":"British Actress of the Year","names":[{"name":"Miranda Richardson","id":"nm0001669","role":null}]}]}]},{"award":"Los Angeles Film Critics Association Awards 1992","titlesAwards":[{"titleAwardOutcome":"Won LAFCA Award","categories":[{"category":"Best Music","names":[{"name":"Zbigniew Preisner","id":"nm0006237","role":null}]}]},{"titleAwardOutcome":"2nd place LAFCA Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Miranda Richardson","id":"nm0001669","role":null},{"name":"The Crying Game","id":"tt0104036","role":null},{"name":"Enchanted April","id":"tt0101811","role":null}]}]}]},{"award":"National Society of Film Critics Awards, USA 1993","titlesAwards":[{"titleAwardOutcome":"2nd place NSFC Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Miranda Richardson","id":"nm0001669","role":null},{"name":"The Crying Game","id":"tt0104036","role":null},{"name":"Enchanted April","id":"tt0101811","role":null}]}]}]},{"award":"New York Film Critics Circle Awards 1992","titlesAwards":[{"titleAwardOutcome":"Won NYFCC Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Miranda Richardson","id":"nm0001669","role":null},{"name":"The Crying Game","id":"tt0104036","role":null},{"name":"Enchanted April","id":"tt0101811","role":null}]}]}]},{"award":"Sant Jordi Awards 1994","titlesAwards":[{"titleAwardOutcome":"Won Sant Jordi","categories":[{"category":"Best Foreign Actor (Mejor Actor Extranjero)","names":[{"name":"Jeremy Irons","id":"nm0000460","role":null},{"name":"M. Butterfly","id":"tt0107468","role":null},{"name":"Waterland","id":"tt0105790","role":null}]},{"category":"Best Foreign Actress (Mejor Actriz Extranjera)","names":[{"name":"Juliette Binoche","id":"nm0000300","role":null},{"name":"Trois couleurs: Bleu","id":"tt0108394","role":null},{"name":"Les amants du Pont-Neuf","id":"tt0101318","role":null}]}]}]}],"votes":"12,898","type":"Movie","companyCreditsSimple":[{"idCompany":"co0076272","name":"Nouvelles Éditions de Films (NEF)"},{"idCompany":"co0065457","name":"Skreba Films"},{"idCompany":"co0047476","name":"StudioCanal"}],"keywords":{"keywords":["passion","parliament","member of parliament","marriage","watching television","sex scene","love nest","fully clothed sex","london england","fellatio","oral sex","voyeur","having sex with skirt hiked up","outdoor sex","sex standing up","sex on floor","sex in bed","promiscuous woman","sexual promiscuity","sexual pleasure","clothes torn off","female removes her clothes","mini skirt","black panties","panties","lingerie","female frontal nudity","scantily clad female","cleavage","salt","throwing salt over one's shoulder","tory","teen suicide","suicide","memory","lie","journalist","irony","incest subtext","father and son in love with the same woman","falling from height","english","deception","deceit","cocktail party","weekend","unfaithfulness","umbrella","tv program","tv interview","train","teenage girl","teenage boy","suicide of son","suicide of brother","snooker","secretary","restaurant","rain","politics","politician","political resignation","policeman","police car","photograph","pay phone","party","park","paris france","palm springs california","mother son relationship","mother daughter relationship","middle aged man","marshmallow","marriage proposal","maid","key","jealousy","interview","interviewer","husband wife relationship","grandfather grandson relationship","girl","french","father son relationship","father daughter relationship","falling to death","estate","dorchester hotel london","dog","diplomat","dinner","desire","death","death of brother","wrist slitting","croquet","conference","circular staircase","brussels belgium","brother sister relationship","british","boyfriend girlfriend relationship","birthday","bathtub","ambulance","urban setting","tragic event","self destructiveness","older man younger woman relationship","controversy","violence","telephone call","stockings","sensuality","seduction","rough sex","pubic hair","police","nipples","mansion","male rear nudity","lust","leg spreading","fondling","finger in mouth","female rear nudity","family relationships","falling in love","ex lover","crying","black nylon stockings","bitterness","one word title","femme fatale","fatal attraction","upper class","obsession","melancholy","love triangle","forbidden love","fiancee","extramarital affair","accidental death","dysfunctional family","scandal","sexuality","adultery","infidelity","death of son","based on novel","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:04:56"}}