{"data":{"movies":[{"title":"Babylon 5: A Call to Arms","originalTitle":"","year":"1999","releaseDate":"19990103","directors":[{"name":"Michael Vejar","id":"nm0892144"}],"writers":[{"name":"J. Michael Straczynski","id":"nm0833089"},{"name":"J. Michael Straczynski","id":"nm0833089"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExNTE2MDA1MF5BMl5BanBnXkFtZTcwNTUzOTQyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Drama","Sci-Fi"],"plot":"Five years after the events of the Babylon 5 series, a technomage named Galen predicts an imminent attack by the Drakh, the old allies of the Shadows. Through dreams, a thief, a captain, and a president are brought together to head them off. The president is John Sheridan. Because of his irrational behavior, Sheridan's friends begin to wonder about his sanity. It's up to all of them and two prototype battlecruisers, the Excalibur and the Victory, to stop the fleet and their planet-killer. But is there more to the Drakh's plan?","simplePlot":"Allies of the Shadows seek revenge against humanity. This movie sets up the series, \"Crusade,\" the sequel to \"Babylon 5.\"","actors":[{"actorName":"Bruce Boxleitner","urlProfile":"http://www.imdb.com/name/nm0000310","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MTc5OTQ0M15BMl5BanBnXkFtZTcwMjY1Mjg4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1950","placeOfBirth":" Elgin, Illinois, USA","birthName":"Bruce William Boxleitner","height":"6' 2\" (1.88 m)","bio":"As one of Hollywood's leading men, Bruce Boxleitner has starred in a major motion picture franchise, numerous feature films, several popular television series, produced a major network film and TV series, performed on Broadway, and authored two science fiction novels. Boxleitner received his formal acting training on stage. A native mid-westerner, he is an alumnus of Chicago's prestigious Goodman Theatre. In 1972, he starred in the Broadway production of Status Quo Vadis with Ted Danson. He then relocated to Los Angeles and quickly landed a guest spot on the legendary TV series The Mary Tyler Moore Show as well as numerous guest roles on series, including Hawaii 5-0, Beretta, Police Woman, and Gunsmoke. Boxleitner's big break occurred when he was cast opposite James Arness in the pilot for the epic TV series How the West Was Won. He went on to star in the CBS series Bring 'em Back Alive; mini-series East of Eden; and TV movie The Last Convertible. In 1982, Boxleitner was cast as the title role in Disney's cult film TRON which garnered him science fiction fans worldwide. However, it was in Boxleitner's four-year run for CBS's 'Scarecrow and Mrs. King', starring opposite Kate Jackson, which endeared him to fans everywhere and made him a household name. In 1994, Boxleitner joined the cast of the popular TV series Babylon 5 as John Sheridan, President of the Interstellar Alliance, a war hero-turned-diplomat at the helm of Earth Alliance Space Station in the year 2259. The show aired for five seasons. Boxleitner most recently starred with Jeff Bridges in TRON: Legacy, the popular motion picture sequel to TRON. The cast includes Garrett Hedlund and Olivia Wilde. In addition, Boxleitner reprised his role in TRON: Uprising on Disney's XD TV network, his first animated TV series. The multi-talented cast includes Elijah Wood, Mandy Moore, Lance Henriksen, and Paul Reubens. The original TRON recently celebrated its 30th anniversary. Several motion pictures include Gods and Generals with Robert Duvall, Jeff Daniels, Stephen Lang and Mira Sorvino; The Babe with John Goodman and Kelly McGillis; Kuffs with Christian Slater; and The Baltimore Bullet with James Coburn. Numerous TV movie credits include The Secret with Kirk Douglas; Perfect Family with Jennifer O'Neal and Joanna Cassidy; Double Jeopardy with Rachel Ward, Sally Kirkland and Sela Ward; Passion Flower with Barbara Hershey and Nicol Williamson; and Hallmark Channel movies, 'Love's Resounding Courage' and 'Falling in Love with the Girl Next Door'; among many others. The veteran actor has appeared in numerous recurring roles on TV series including GCB and Heroes, and has guest-starred on NCIS and Chuck, among others. A skilled horseman, Boxleitner utilized his talents in numerous Western TV series and films including Kenny Rogers television movie series that aired on CBS and NBC, starring opposite Kenny Rogers; 'Gunsmoke V: One Man's Justice' with James Arness (Arness' final film); CBS' remake of Red River with Gregory Harrison, James Arness and Laura Johnson; 'Wyatt Earp: Return to Tombstone' with Hugh O'Brian; and Down the Long Hills, based on legendary western author Louis L'Amour's novel of the same name. Boxleitner was inducted into the Hall of Great Western Performers at the National Cowboy and Western Heritage Museum in Oklahoma City in April 2012 honoring him for his illustrious career in western films. He is a two-time recipient of the Wrangler Award. In 2013, Boxleitner co-starred with Andie MacDowell and Dylan Neal in Hallmark Channel's first-ever prime-time series, Debbie Macomber's Cedar Cove to rave reviews and an average of 2 million viewers. The #1 rated cable program was renewed for a third season and is scheduled to premiere in the summer of 2015. In 1999, Boxleitner authored \"Frontier Earth\" and in 2001, its sequel \"Frontier Earth: Searcher\", published by The Berkley Publishing Group. Bruce Boxleitner resides in Los Angeles with his wife, publicist Verena King, and has three sons: Sam, Lee and Michael.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MTc5OTQ0M15BMl5BanBnXkFtZTcwMjY1Mjg4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000310","name":"Bruce Boxleitner","idIMDB":"nm0000310"},"actorId":"nm0000310","character":"John J. Sheridan","urlCharacter":"http://www.imdb.com/character/ch0012565","main":true},{"actorName":"Jerry Doyle","urlProfile":"http://www.imdb.com/name/nm0236381","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIwNDcyNzA0NV5BMl5BanBnXkFtZTYwMTMyMjAz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 July 1956","placeOfBirth":" Brooklyn, New York, USA","height":"6' 3\" (1.91 m)","bio":"Jerry Doyle was born on July 16, 1956 in Brooklyn, New York, USA. He was an actor, known for Babylon 5 (1994), Babylon 5: The River of Souls (1998) and Babylon 5: The Gathering (1993). He was married to Andrea Thompson. He died on July 27, 2016 in Las Vegas, Nevada, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIwNDcyNzA0NV5BMl5BanBnXkFtZTYwMTMyMjAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0236381","name":"Jerry Doyle","idIMDB":"nm0236381"},"actorId":"nm0236381","character":"Michael Garibaldi","urlCharacter":"http://www.imdb.com/character/ch0012582","main":true},{"actorName":"Jeff Conaway","urlProfile":"http://www.imdb.com/name/nm0001063","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNTI1Njc2NF5BMl5BanBnXkFtZTcwMTgzMzE0NQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 October 1950","placeOfBirth":" New York City, New York, USA","birthName":"Jeffery Charles William Michael Conaway","height":"6' 1½\" (1.87 m)","bio":"Jeff Conaway was born on October 5, 1950 in New York City, New York, USA as Jeffery Charles William Michael Conaway. He was an actor, known for Grease (1978), Taxi (1978) and Babylon 5 (1994). He was married to Kerri Young and Rona Newton-John. He died on May 27, 2011 in Encino, Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNTI1Njc2NF5BMl5BanBnXkFtZTcwMTgzMzE0NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001063","name":"Jeff Conaway","idIMDB":"nm0001063"},"actorId":"nm0001063","character":"Zack Allen","urlCharacter":"http://www.imdb.com/character/ch0012569","main":true},{"actorName":"Carrie Dobro","urlProfile":"http://www.imdb.com/name/nm0229797","urlPhoto":"","biography":{"dateOfBirth":"30 May 1957","placeOfBirth":" New York City, New York, USA","height":"5' 4\" (1.63 m)","bio":"Carrie Dobro was born on May 30, 1957 in New York City, New York, USA. She is an actress and assistant director, known for Babylon 5: A Call to Arms (1999), Crusade (1999) and A Marine Story (2010). She has been married to Mark Ciglar since April 24, 1999.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0229797","name":"Carrie Dobro","idIMDB":"nm0229797"},"actorId":"nm0229797","character":"Dureena Nafeel","urlCharacter":"http://www.imdb.com/character/ch0034814","main":true},{"actorName":"Peter Woodward","urlProfile":"http://www.imdb.com/name/nm0940974","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExODUyNzAyMjheQTJeQWpwZ15BbWU3MDc5MTAxMjg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 January 1956","placeOfBirth":" London, England, UK","bio":"Peter Woodward was born into a family of actors. His father, Edward Woodward, brother Tim Woodward and sister Sarah Woodward, are all well-known British actors. Peter graduated from the Royal Academy of Dramatic Art (RADA) and then joined the Royal Shakespeare Company, starring in many of their productions including \"Winter's Tale\", \"Comedy of Errors\" and \"A Midsummer Night's Dream\". Peter has also played a wide range of major character roles in films and television including the role of the German \"Captain Stossel\" in the feature film The Brylcreem Boys (1998). As a member of the British Academy of Dramatic Combat, Peter is known in the film industry for his work as a Fight Arranger and also as a post production supervisor, writing the ADR dialogue for films including: 1492: Christophe Colomb (1992), 20,000 Leagues Under the Sea (1997), The Scarlet Tunic (1998), Les Misérables (1998) and Ossessione fatale (1991). Branching out, Peter recently formed a production company, \"TRIPAL PRODUCTIONS\", with his father Edward Woodward, and, for this company, Peter wrote and produced his first feature film The House of Angelo (1997), with his father, Edward, in the starring role as \"Angleo\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExODUyNzAyMjheQTJeQWpwZ15BbWU3MDc5MTAxMjg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0940974","name":"Peter Woodward","idIMDB":"nm0940974"},"actorId":"nm0940974","character":"Galen","urlCharacter":"http://www.imdb.com/character/ch0027076","main":true},{"actorName":"Tony Todd","urlProfile":"http://www.imdb.com/name/nm0865302","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTI1Njc4NV5BMl5BanBnXkFtZTcwMDg4NzcyNg@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1954","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Anthony Tiran Todd","height":"6' 5\" (1.96 m)","bio":"Perhaps best known for his chilling performance as \"Candyman\", the charismatic 6' 5\" actor Tony Todd has consistently turned in compelling performances since his debut in the fantasy film Sleepwalk (1986). Born in Washington, D.C., Todd spent two years on a scholarship at the University of Connecticut, which, in turn, led to a scholarship from the renowned Eugene O'Neill National Theatre Institute. It proved to be the foundation for intense stints at the Hartman Conservatory in Stamford, Connecticut and the Trinity Square Repertory Theatre Conservatory in Providence, Rhode Island. Todd appeared in dozens of classical and many experimental plays, yet still managed to find time to teach playwriting to high school students in the Hartford public school system. Todd's extensive credits exemplify his versatility. They include such film classics as The Rock (1996), The Crow (1994), Lean on Me (1989), Bird (1988), Night of the Living Dead (1990), Destination finale (2000), the multiple Academy Award winning Oliver Stone film Platoon (1986) and Le secret (2000), which was nominated and screened at the Cannes Film Festival. Todd's recent films include the independent film Silence (2002) and Final Destination 2 (2003). He has had prominent guest starring roles in numerous critically-acclaimed television series, including recurring on Boston Public (2000), For the People (2002) and The District (2000), as well as NYPD Blue (1993), Smallville (2001), Law & Order (1990), Crossing Jordan (2001), Homicide: Life on the Street (1993) and The X-Files (1993). Todd recurred on three incarnations of \"Star Trek\" and guest starred on Xena: Warrior Princess (1995) and episodes of CSI: Miami (2002) and Andromeda (2000). His television movies include starring roles in True Women (1997), Black Fox (1995), Butter (1998), Ivory Hunters (1990), Babylon 5: A Call to Arms (1999) and Control Factor (2003). Todd's considerable theatre credits include the world premiere of award-winning playwright August Wilson's \"King Hedley II\", where he originated the title role in Pittsburgh, Seattle and Boston. Variety commented: \"Todd's King Hedley dominates the stage. A sour-faced mix of rage and resolve, anger and vulnerability. Todd's Hedley was a memorable tour-de-force even on opening.\" He also received a coveted Helen Hayes nomination for his performance in Athol Fugard's \"The Captain's Tiger at La Jolla, the Manhattan Theatre Club and the Kennedy Center. Other theatre credits include \"Les Blancs\", \"Playboy of the West Indies\", \"Othello\", \"Zooman and the Sign\", award-winning playwright Keith Glover's \"Dark Paradise\", \"Aida\" (on Broadway), and most recently, \"Levee James\" for the prestigious Eugene O'Neill Playwrights Conference and The New Dramatist Guild.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTI1Njc4NV5BMl5BanBnXkFtZTcwMDg4NzcyNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0865302","name":"Tony Todd","idIMDB":"nm0865302"},"actorId":"nm0865302","character":"Leonard Anderson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tracy Scoggins","urlProfile":"http://www.imdb.com/name/nm0001712","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNDQ2MTQ3OV5BMl5BanBnXkFtZTgwMjcyMDQzOTE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 November 1953","placeOfBirth":" Galveston, Texas, USA","birthName":"Tracy Dawn Scoggins","height":"5' 8\" (1.73 m)","bio":"Tracy Dawn Scoggins was born and raised in Dickinson, Texas. At age 16, she enrolled in Southwest Texas State, where she studied speech communications and physical education. After leaving college, she was hired by the Elite Modeling Agency and sent to New York City. After one year, she continued her modeling career with assignments in Italy, France and Germany. Later, she decided to return to the United States to study acting. She attended the Wynn Handman Studio and the Herbert Berghof Studio -- both well-known acting schools. After completing her training, she moved to Hollywood where she has become internationally known as a television and movie star. Today, she resides in Los Angeles, California and spends her free time developing workout videos, cycle riding, swimming and jogging.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcyNDQ2MTQ3OV5BMl5BanBnXkFtZTgwMjcyMDQzOTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001712","name":"Tracy Scoggins","idIMDB":"nm0001712"},"actorId":"nm0001712","character":"Capt. Elizabeth Lochley","urlCharacter":"http://www.imdb.com/character/ch0012567","main":true},{"actorName":"Tony Maggio","urlProfile":"http://www.imdb.com/name/nm0535997","urlPhoto":"","biography":{"birthName":"Anthony Maggio","bio":"Tony Maggio was born in Los Angeles, California, USA as Anthony Maggio. He is known for his work on Bad Influence (1990), Babylon 5: A Call to Arms (1999) and Bella Mafia (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0535997","name":"Tony Maggio","idIMDB":"nm0535997"},"actorId":"nm0535997","character":"Drake","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Harris","urlProfile":"http://www.imdb.com/name/nm0365107","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjRmMjM0ZGEtZWU5Zi00ZGEwLTkwNDUtMGVhYjg5ZjNmYjUyXkEyXkFqcGdeQXVyNzQyODY4NTc@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"birthName":"Michael Knight Harris","bio":"Michael Harris was born as Michael Knight Harris. He is an actor and writer, known for Suture (1993), I Love You, Don't Touch Me! (1997) and Horseplayer (1990). He has been married to Shannon Parnell since October 2001.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjRmMjM0ZGEtZWU5Zi00ZGEwLTkwNDUtMGVhYjg5ZjNmYjUyXkEyXkFqcGdeQXVyNzQyODY4NTc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0365107","name":"Michael Harris","idIMDB":"nm0365107"},"actorId":"nm0365107","character":"Bishop","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott MacDonald","urlProfile":"http://www.imdb.com/name/nm0531924","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MTgwNzY5N15BMl5BanBnXkFtZTgwNDk0OTY0NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 September 1959","placeOfBirth":"","height":"5' 10\" (1.78 m)","bio":"Scott MacDonald is a veteran character actor with an extensive and eclectic list of credits in film, television, commercials, voice overs and on the legit stages of regional theaters across the U.S. and on Broadway. MacDonald graduated from high school in the remote town of Libby in northwestern Montana. He attended Washington State University where, in the pursuit of a B.A. broadcasting degree, he performed in several plays and \"caught the acting bug\" and ended up with a second B.A. in theatre. Mac then earned a MFA in acting from California Institute of the Arts. MacDonald enjoyed several years of quality work on the stages of the Seattle Repertory Theatre, Intiman Theatre, The Empty Space and regionally in Atlanta, Santa Fe, Washington D. C. . It was his leading role in the critically acclaimed Pulitzer Prize winning Tony nominated production of \"The Kentucky Cycle\" that brought MacDonald to LA and NYC served as his entry into movies and TV. MacDonald has voiced or appeared in hundreds of national commercials and CD ROM games. He is one of a rare cadre of actors who have guest starred on all four of the modern Star Trek series as no less than 6 different creatures...including one human. He has performed Hamlet and Bullwinkle Moose on the boards, and even had a 7 year run as the lovely \"Hilda\" while wearing a dress in the long running Bud Light Ladies campaign which included thousands of personal appearances. MacDonald is a devoted fly fisherman and returns to Big Sky country whenever he can. He is also a dyed in the wool WSU Cougar fan... Go Cougs.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MTgwNzY5N15BMl5BanBnXkFtZTgwNDk0OTY0NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0531924","name":"Scott MacDonald","idIMDB":"nm0531924"},"actorId":"nm0531924","character":"First Officer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Wayne Alexander","urlProfile":"http://www.imdb.com/name/nm0018795","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwNTE2MDcwNF5BMl5BanBnXkFtZTgwNDA5ODQ1MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"Wayne Alexander grew up in the San Joaquin Valley in California. He trained at Los Angeles City College Theater Academy, then spent four years at San Francisco's American Conservatory Theater. He later worked as a fight choreographer and did stage work both in Los Angeles and New York. In the late 1980s he made the switch to film and TV.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQwNTE2MDcwNF5BMl5BanBnXkFtZTgwNDA5ODQ1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0018795","name":"Wayne Alexander","idIMDB":"nm0018795"},"actorId":"nm0018795","character":"Drakh","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carlos Bernard","urlProfile":"http://www.imdb.com/name/nm0076167","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMjIzMTE4M15BMl5BanBnXkFtZTgwNzAyNzA2NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 October 1962","placeOfBirth":" Evanston, Illinois, USA","birthName":"Carlos Bernard Papierski","height":"5' 9½\" (1.77 m)","bio":"Carlos Bernard was born on October 12, 1962 in Evanston, Illinois, USA as Carlos Bernard Papierski. He is an actor and director, known for 24 (2001), Alien Raiders (2008) and Your Father's Daughter (2012). He has been married to Tessie Santiago since December 30, 2013. He was previously married to Sharisse Baker-Bernard.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxMjIzMTE4M15BMl5BanBnXkFtZTgwNzAyNzA2NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0076167","name":"Carlos Bernard","idIMDB":"nm0076167"},"actorId":"nm0076167","character":"Communications","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Burt Bulos","urlProfile":"http://www.imdb.com/name/nm0120235","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2Mzk2MDY1MF5BMl5BanBnXkFtZTgwMzE3NTg2MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 June 1968","placeOfBirth":" Staten Island, New York, USA","height":"5' 11\" (1.8 m)","bio":"Burt Bulos was born on June 10, 1968 in Staten Island, New York, USA. He is an actor and writer, known for Bosch (2014), The Lady Killers (2017) and NCIS: Los Angeles (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2Mzk2MDY1MF5BMl5BanBnXkFtZTgwMzE3NTg2MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0120235","name":"Burt Bulos","idIMDB":"nm0120235"},"actorId":"nm0120235","character":"Navigation","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ron Campbell","urlProfile":"http://www.imdb.com/name/nm0132821","urlPhoto":"","biography":{"bio":"Ron Campbell is known for his work on The Witches of Eastwick (1987), Babylon 5: A Call to Arms (1999) and Dead Bang (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0132821","name":"Ron Campbell","idIMDB":"nm0132821"},"actorId":"nm0132821","character":"Drazi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Coburn","urlProfile":"http://www.imdb.com/name/nm0167995","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5OTE2MDA0ODNeQTJeQWpwZ15BbWU4MDMyNzg1NjIx._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1969","placeOfBirth":" Los Angeles, California, USA","bio":"David Coburn was born on October 31, 1969 in Los Angeles, California, USA. He is known for his work on Captain Planet and the Planeteers (1990), The Fabulous Baker Boys (1989) and Beyond: Two Souls (2013).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5OTE2MDA0ODNeQTJeQWpwZ15BbWU4MDMyNzg1NjIx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0167995","name":"David Coburn","idIMDB":"nm0167995"},"actorId":"nm0167995","character":"Minbari Ranger","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0146455","urlIMDB":"http://www.imdb.com/title/tt0146455","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 34 min (94 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.2","filmingLocations":[],"awards":[],"votes":"4,375","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0039264","name":"Babylonian Productions"},{"idCompany":"co0009512","name":"TNT"}],"keywords":{"keywords":["sequel","gas mask","space opera","23rd century","alien invasion","space station","outer space","alien technology","cult film","future","spacecraft","alien","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 02:58:44"}}