{"data":{"movies":[{"title":"The Bridges of Madison County","originalTitle":"","year":"1995","releaseDate":"19950602","directors":[{"name":"Clint Eastwood","id":"nm0000142"}],"writers":[{"name":"Richard LaGravenese","id":"nm0481418"},{"name":"Robert James Waller","id":"nm0909077"}],"runtime":"135 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MDkxMzA2NF5BMl5BanBnXkFtZTYwNjIxMDI5._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Romance"],"plot":"The path of Francesca Johnson's future seems destined when an unexpected fork in the road causes her to question everything she had come to expect from life. While her husband and children are away at the Illinois state fair in the summer of 1965, Robert Kincaid happens turn into the Johnson farm and asks Francesca for directions to Roseman Bridge. Francesca later learns that he was in Iowa on assignment from National Geographic magazine. She is reluctant seeing that he's a complete stranger and then she agrees to show him to the bridges and gradually she talks about her life from being a war-bride from Italy which sets the pace for this bittersweet and all-too-brief romance of her life. Through the pain of separation from her secret love and the stark isolation she feels as the details of her life consume her, she writes her thoughts of the four-day love affair which took up three journals. The journals are found by her children after the lawyer was going over Francesca's will and ...","simplePlot":"Photographer Robert Kincaid wanders into the life of housewife Francesca Johnson, for four days in the 1960s.","actors":[{"actorName":"Clint Eastwood","urlProfile":"http://www.imdb.com/name/nm0000142","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDc0MjY0OV5BMl5BanBnXkFtZTcwNzU1MDAxOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 May 1930","placeOfBirth":" San Francisco, California, USA","birthName":"Clinton Eastwood Jr.","height":"6' 4\" (1.93 m)","bio":"Perhaps the icon of macho movie stars, and a living legend, Clint Eastwood has become a standard in international cinema. Born May 31, 1930 in San Francisco, the elder of two children in a middle-class family, Eastwood stayed in high school until the comparatively late age of nineteen and worked menial jobs over a period of several years before enrolling at Los Angeles City College, from which he dropped out after two semesters to pursue acting. He found uncredited bit parts in such nondescript B-films as Revenge of the Creature (1955) and Tarantula (1955) during the mid-'50s while simultaneously digging swimming pools for a living, until he got his first breakthrough in the long-running TV series Rawhide (1959) with Eric Fleming. Though only a secondary player in the early seasons, Clint made the show his own by end of its run and became a recognizable face to television viewers around the country. Eastwood found much bigger and better things in Italy with the excellent spaghetti westerns A Fistful of Dollars (1964) and For a Few Dollars More (1965). But it was the third installment in the trilogy where he found one of his signature roles: The Good, the Bad and the Ugly (1966). The movie was a big hit and he became an instant international star. Clint's first American-made western, Hang 'Em High (1968), was yet again a success, and he followed it up with another starring role in Coogan's Bluff (1968) (the loose inspiration to the TV series McCloud (1970)) before playing second fiddle to Richard Burton in the World War II epic Where Eagles Dare (1968) and Lee Marvin in the bizarre musical Paint Your Wagon (1969). In Sierra torride (1970) and Kelly's Heroes (1970), Eastwood went in an experimental direction by combining tough-guy action with offbeat humor. 1971 proved to be one of his best years in film, if not the best. He starred in The Beguiled (1971) and the classic thriller Play Misty for Me (1971), but it was his role as the hard edge police inspector in Dirty Harry (1971) that gave Eastwood one of his signature roles and invented the loose-cannon cop genre that has been imitated even to this day. Eastwood did a fairly consistent quality of work thereafter with the road movies Thunderbolt and Lightfoot (1974) and The Gauntlet (1977), the Dirty Harry sequels Magnum Force (1973) and The Enforcer (1976), the westerns Joe Kidd (1972), High Plains Drifter (1973) and The Outlaw Josey Wales (1976) (his first of six onscreen collaborations with then live-in love Sondra Locke), and the fact-based thriller Escape from Alcatraz (1979). In 1978 he branched out into the comedy genre in Every Which Way But Loose (1978), which became the biggest hit of his career up to that time; taking inflation into account, it still is. In short, notwithstanding The Eiger Sanction (1975), the '70s were an uninterrupted continuation of success. Eastwood kicked off the '80s with Any Which Way You Can (1980), the blockbuster sequel to Every Which Way But Loose. The fourth Dirty Harry film, Sudden Impact (1983), was the highest-grossing film of the franchise and spawned the character's trademark catchphrase, \"Make my day\". Clint also starred in Bronco Billy (1980), Firefox (1982), Tightrope (1984), City Heat (1984), Pale Rider (1985) and Heartbreak Ridge (1986), all of which were solid hits, with Honkytonk Man (1982) being his only commercial failure of the period. In 1988 he did his fifth and final Dirty Harry movie, The Dead Pool (1988). Although it was a success overall, it did not have the box office punch the previous films had. About this time, with outright bombs like Pink Cadillac (1989) and The Rookie (1990), it became apparent that Eastwood's star was declining as it never had before. He then started taking on more personal projects, such as directing Bird (1988), a biopic of Charlie Parker, and starring in and directing White Hunter Black Heart (1990), an uneven, loose biopic of John Huston. Eastwood bounced back in a big way with his western Unforgiven (1992), which garnered the then 62-year-old his first ever Academy Award nomination (Best Actor) and win for Best Director. Following up with a quick hit, he took on the secret service in In the Line of Fire (1993), then accepted second billing to Kevin Costner in the interesting but poorly received drama A Perfect World (1993). Next up was a love story, The Bridges of Madison County (1995), where Clint surprised audiences with a sensitive performance, but it soon became apparent he was going backwards after his brief revival. Subsequent films were credible, but nothing really stuck out. Among them were the moderately well-received Absolute Power (1997) and Space Cowboys (2000) as well as the badly received True Crime (1999) and Blood Work (2002). But Eastwood surprised yet again, returning to the top of the A-list with the hugely successful boxing drama Million Dollar Baby (2004). The movie earned him an Oscar for Best Director and a Best Actor nomination for the second time. Behind the camera, he had big successes directing the multi-award-winners Mystic River (2003), Flags of Our Fathers (2006), Letters from Iwo Jima (2006) and Changeling (2008) which starred Angelina Jolie. His next starring vehicle, Gran Torino (2008), earned $30 million in its opening weekend, proving his box office appeal has not waned. Eastwood has managed to keep his extremely convoluted personal life top secret and never discusses his families with the media. He had a long time relationship with frequent co-star Locke and has at least eight children by at least six other women, although he has only been married twice. Clint Eastwood lives in Los Angeles and owns homes in Monterey, Northern California, Idaho and Hawaii.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MDc0MjY0OV5BMl5BanBnXkFtZTcwNzU1MDAxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000142","name":"Clint Eastwood","idIMDB":"nm0000142"},"actorId":"nm0000142","character":"Robert Kincaid","urlCharacter":"http://www.imdb.com/character/ch0014586","main":true},{"actorName":"Meryl Streep","urlProfile":"http://www.imdb.com/name/nm0000658","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4Mjk5MDExOF5BMl5BanBnXkFtZTcwOTU1MTMyMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1949","placeOfBirth":" Summit, New Jersey, USA","birthName":"Mary Louise Streep","height":"5' 6\" (1.68 m)","bio":"Considered by many critics to be the greatest living actress, Meryl Streep has been nominated for the Academy Award an astonishing 20 times, and has won it three times. Meryl was born Mary Louise Streep in 1949 in Summit, New Jersey, to Mary Wolf (Wilkinson), a commercial artist, and Harry William Streep, Jr., a pharmaceutical executive. Her father was of German and Swiss-German descent, and her mother had English, Irish, and German ancestry. Meryl's early performing ambitions leaned toward the opera. She became interested in acting while a student at Vassar and upon graduation she enrolled in the Yale School of Drama. She gave an outstanding performance in her first film role, Julia (1977), and the next year she was nominated for her first Oscar for her role in The Deer Hunter (1978). She went on to win the Academy Award for her performances in Kramer vs. Kramer (1979) and Sophie's Choice (1982), in which she gave a heart-wrenching portrayal of an inmate mother in a Nazi death camp. A perfectionist in her craft and meticulous and painstaking in her preparation for her roles, Meryl turned out a string of highly acclaimed performances over the next decade in great films like Silkwood (1983); Out of Africa (1985); Ironweed (1987); and A Cry in the Dark (1988). Her career declined slightly in the early 1990s as a result of her inability to find suitable parts, but she shot back to the top in 1995 with her performance as Clint Eastwood's married lover in The Bridges of Madison County (1995) and as the prodigal daughter in Marvin's Room (1996). In 1998 she made her first venture into the area of producing, and was the executive producer for the moving ...First Do No Harm (1997). A realist when she talks about her future years in film, she remarked that \"...no matter what happens, my work will stand...\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4Mjk5MDExOF5BMl5BanBnXkFtZTcwOTU1MTMyMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000658","name":"Meryl Streep","idIMDB":"nm0000658"},"actorId":"nm0000658","character":"Francesca Johnson","urlCharacter":"http://www.imdb.com/character/ch0014587","main":true},{"actorName":"Annie Corley","urlProfile":"http://www.imdb.com/name/nm0179960","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzczNzkzMjcwM15BMl5BanBnXkFtZTgwMzE2MTQwNDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Annie Corley graduated from McCutcheon High School in Lafayette, Indiana and later enrolled at DePauw University in Greencastle, Indiana. Since 1990, Annie has appeared in several films, her most notable role to date is Meryl Streep's on-screen daughter in The Bridges of Madison County (1995). She later made a chilling appearance as Donna, Christina Ricci's on-screen aunt in Monster (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzczNzkzMjcwM15BMl5BanBnXkFtZTgwMzE2MTQwNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0179960","name":"Annie Corley","idIMDB":"nm0179960"},"actorId":"nm0179960","character":"Carolyn Johnson","urlCharacter":"http://www.imdb.com/character/ch0510979","main":true},{"actorName":"Victor Slezak","urlProfile":"http://www.imdb.com/name/nm0805789","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDc0MzM0MF5BMl5BanBnXkFtZTcwMTY5NTU2OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1957","placeOfBirth":" Youngstown, Ohio, USA","birthName":"Victor Michael Szelazek","bio":"A staple of American stage, screen, and television for over 30 years, Victor Slezak hails from Youngstown, Ohio. Victor's earliest influences in entertainment came through the screen of Jack and Sam's Warner Brothers Theater, where his mother was a box office girl. So, too, was the black and white TV set in his parents' living room an early influence. He cites seeing Montgomery Clift in _Freud_, James Dean in Rebel Without a Cause (1955), and George C. Scott in the old East Side/West Side (1963) series as performances that piqued his earliest interest. The Franciscan nuns at Saint Stanislaus Grade School taught in the Jesuit mode, placing heavy weight on the correct use of language and oratory skill. Theatre was used as a teaching tool. At an early age, Victor's acting in, directing, and writing plays stemming from the Bible became a normal part of his daily routine and education. His talent and efforts gained recognition when he was asked to join a select handful of students in reading the Book of Genesis aloud to their church congregation. Toward the end of high school, after being selected and appearing in leads in the school plays, Victor's guidance counselor pulled him out of class to announce good news: he'd been awarded a scholarship to study acting at Ohio State. Victor turned it down. The summer before, Victor had spent 10 weeks as an apprentice at the Lakewood Musical Playhouse. There was another force and first love begging for his attention. From an early age he spent his free time making drawings in pencil and ink. He couldn't see himself pursuing acting as a career after seeing those amazing performers drawing their 75 dollar a week paycheck and no job after the ten weeks. So, at the ripe old age of 17, he moved to New York City to become a visual artist. He was on the fast track to become an advertising art director when a friend who worked as a scenic designer from that summer of stock called from out of the blue and asked Victor if he'd like to paint scenery for the venerable Chautauqua Opera Company in western New York state. Victor arranged for a brief leave of absence from the advertising firm. A life in the theatre had called to him by a most circuitous route. Victor never went back to the ad firm. When his work at Chautauqua ended, he landed a job stage managing variety acts - a country/western band, a juggler, and a magician - at the Cedar Point Amusement Park in Sandusky, Ohio. In an era before Amazon or Barnes and Noble existed, he began to hunt for books on acting. Victor's first introduction to Uta Hagen was in his Speech and Drama class where he heard a recording of \"Who's Afraid of Virginia Woolf\". His first professional jobs came from regional theatre, roles like Rodolfo in A View from the Bridge at the Berkshire Theatre Festival and several stints at Hartford Stage, including Eben in Desire Under the Elms playing opposite Frances Fisher; Whit in Of Mice and Men with fellow Youngstowner Ed O'Neill, and Algernon in The Importance of Being Ernest with Mary Louise Parker. Exceptional material and the chance to work with great artists kept Victor in New York when so many of his peers moved west to pursue Los Angeles. Stage jobs in the city soon beckoned. Victor's performance as Lachlen in The Hasty Heart at Mirror Repertory off-Broadway led to his being cast opposite Geraldine Page at the same venue in a Ibsen's Ghosts, directed by Austin Pendleton. Television jobs followed including a recurring role on ABC's \"Guiding Light\". Broadway beckoned in 1993. Victor played John Cleary in Frank Gilroy's Any Given Day (the precursor to The Subject was Roses) alongside Sada Thompson at the Longacre Theatre, following that playing Dr. Sugar in Tennessee Williams' Suddenly Last Summer at Circle in the Square with Elizabeth Ashley, JFK in Jackie: An American Life with Margaret Colin at the Belasco, Mr. Robinson in The Graduate with Kathleen Turner at the Plymouth Theatre, and John the Baptist in Salome with Al Pacino at the Barrymore Theatre. Film roles began to pop up as well: The Devil's Own (1997) directed by Alan J. Pakula with Harrison Ford and Brad Pitt; The Bridges of Madison County (1995) with Meryl Streep, directed by Clint Eastwood. After Uta Hagen's death in 2004, Victor received phone calls from HB Studios asking him to consider teaching. Harkening to a need to give back to the school and the craft that had nurtured him, he eventually agreed to work a class into his schedule \"I went to teach my first class and found that the Studio had put me in the same room where I'd first met Uta.\" Today, Victor serves on the Board of the HB Playwrights Foundation, a position he's held since 2009 and makes time each year to be a part of their CORE program. He is also a member of the Actor's Studio and The Ensemble Studio Theater. He is known throughout the industry for the research he brings to playing roles of particular power and complexity (Enrico Brulard, the totalitarian chef on HBO's _Treme_; the Deputy Director of CIA in John Singleton's feature Abduction; Jamie Tyrone in Eugene O'Neill's Moon for the Misbegotten at the Pittsburgh Public Theatre; Mike Wallace in the Broadway-bound musical Superfly, directed by Bill T. Jones). Victor still approaches his roles with a painter's eye.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDc0MzM0MF5BMl5BanBnXkFtZTcwMTY5NTU2OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0805789","name":"Victor Slezak","idIMDB":"nm0805789"},"actorId":"nm0805789","character":"Michael Johnson","urlCharacter":"http://www.imdb.com/character/ch0056639","main":true},{"actorName":"Jim Haynie","urlProfile":"http://www.imdb.com/name/nm0371579","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MjQ4Njc3Nl5BMl5BanBnXkFtZTgwOTU5NDcwMDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 February 1940","placeOfBirth":" Falls Church, Virginia, USA","height":"6' 2\" (1.88 m)","bio":"Jim Haynie was born on February 6, 1940 in Falls Church, Virginia, USA. He is an actor, known for The Bridges of Madison County (1995), Pretty in Pink (1986) and The Peacemaker (1997). He has been married to Maggie Causey since December 27, 2007. They have four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MjQ4Njc3Nl5BMl5BanBnXkFtZTgwOTU5NDcwMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0371579","name":"Jim Haynie","idIMDB":"nm0371579"},"actorId":"nm0371579","character":"Richard Johnson","urlCharacter":"http://www.imdb.com/character/ch0056640","main":true},{"actorName":"Sarah Kathryn Schmitt","urlProfile":"http://www.imdb.com/name/nm0773454","urlPhoto":"","biography":{"bio":"Sarah Kathryn Schmitt is known for her work on The Bridges of Madison County (1995), P.S. I Love You (2007) and The Last Airbender (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0773454","name":"Sarah Kathryn Schmitt","idIMDB":"nm0773454"},"actorId":"nm0773454","character":"Young Carolyn","urlCharacter":"http://www.imdb.com/character/ch0056638","main":true},{"actorName":"Christopher Kroon","urlProfile":"http://www.imdb.com/name/nm0472244","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMjY4NDE3N15BMl5BanBnXkFtZTcwNDExMjkyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"bio":"Christopher Kroon is an actor, known for The Bridges of Madison County (1995), Guilt Complex (2004) and Invincible Force (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTczMjY4NDE3N15BMl5BanBnXkFtZTcwNDExMjkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0472244","name":"Christopher Kroon","idIMDB":"nm0472244"},"actorId":"nm0472244","character":"Young Michael","urlCharacter":"http://www.imdb.com/character/ch0056639","main":true},{"actorName":"Phyllis Lyons","urlProfile":"http://www.imdb.com/name/nm0529137","urlPhoto":"","biography":{"dateOfBirth":"20 August 1960","placeOfBirth":" New Brunswick, New Jersey, USA","birthName":"Phyllis Anne Lyons","bio":"Phyllis Lyons was born on August 20, 1960 in New Brunswick, New Jersey, USA as Phyllis Anne Lyons. She is an actress, known for All My Children (1970), Donnie Darko (2001) and The Bridges of Madison County (1995). She has been married to Adam Arkin since August 21, 1998. They have one child.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0529137","name":"Phyllis Lyons","idIMDB":"nm0529137"},"actorId":"nm0529137","character":"Betty","urlCharacter":"http://www.imdb.com/character/ch0056641","main":true},{"actorName":"Debra Monk","urlProfile":"http://www.imdb.com/name/nm0598213","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE4NDE2MDU4NV5BMl5BanBnXkFtZTYwODgwMjY1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1949","placeOfBirth":" Middletown, Ohio, USA","bio":"Debra Monk was born on February 27, 1949 in Middletown, Ohio, USA. She is an actress, known for The Devil's Advocate (1997), The Bridges of Madison County (1995) and Demolition (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE4NDE2MDU4NV5BMl5BanBnXkFtZTYwODgwMjY1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0598213","name":"Debra Monk","idIMDB":"nm0598213"},"actorId":"nm0598213","character":"Madge","urlCharacter":"http://www.imdb.com/character/ch0056642","main":true},{"actorName":"Richard Lage","urlProfile":"http://www.imdb.com/name/nm0481189","urlPhoto":"","biography":{"bio":"Richard Lage is an actor, known for The Bridges of Madison County (1995), Haunting Villisca (2006) and Captain Z-Ro (1955).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0481189","name":"Richard Lage","idIMDB":"nm0481189"},"actorId":"nm0481189","character":"Lawyer Peterson","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michelle Benes","urlProfile":"http://www.imdb.com/name/nm0070906","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NDAyNDk1OF5BMl5BanBnXkFtZTcwOTkzMTU1Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Michelle Benes was born in Moultrie, Georgia, USA. She is an actress, known for The Bridges of Madison County (1995), An American Crime (2007) and Weeds (2005). She was previously married to Ron Barnett.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NDAyNDk1OF5BMl5BanBnXkFtZTcwOTkzMTU1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0070906","name":"Michelle Benes","idIMDB":"nm0070906"},"actorId":"nm0070906","character":"Lucy Redfield","urlCharacter":"http://www.imdb.com/character/ch0056643","main":true},{"actorName":"Alison Wiegert","urlProfile":"http://www.imdb.com/name/nm0927354","urlPhoto":"","biography":{"bio":"Alison Wiegert is an actress, known for The Bridges of Madison County (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0927354","name":"Alison Wiegert","idIMDB":"nm0927354"},"actorId":"nm0927354","character":"Child #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brandon Bobst","urlProfile":"http://www.imdb.com/name/nm0090465","urlPhoto":"","biography":{"bio":"Brandon Bobst is an actor, known for The Bridges of Madison County (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0090465","name":"Brandon Bobst","idIMDB":"nm0090465"},"actorId":"nm0090465","character":"Child #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Pearl Faessler","urlProfile":"http://www.imdb.com/name/nm0264987","urlPhoto":"","biography":{"bio":"Pearl Faessler is an actress, known for The Bridges of Madison County (1995) and The Hostage (1967).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0264987","name":"Pearl Faessler","idIMDB":"nm0264987"},"actorId":"nm0264987","character":"Wife","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"R.E. 'Stick' Faessler","urlProfile":"http://www.imdb.com/name/nm0264988","urlPhoto":"","biography":{"bio":"R.E. 'Stick' Faessler is an actor, known for The Bridges of Madison County (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0264988","name":"R.E. 'Stick' Faessler","idIMDB":"nm0264988"},"actorId":"nm0264988","character":"Husband","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0112579","urlIMDB":"http://www.imdb.com/title/tt0112579","business":{"budget":{"money":"$24,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"£500,343","country":"UK","day":"12","month":"09","year":"1995","remarks":""},{"money":"1,124,547","country":"France","day":"31","month":"10","year":"1995","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1994/\">1994</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 15 min (135 min)"],"soundMix":["DTS","Dolby Digital"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Panaflex Platinum, Panavision Primo Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["3,611 m"],"negativeFormat":["35 mm (Eastman EXR 200T 5293, EXR 500T 5298)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.5","metascore":"66","filmingLocations":[{"location":"W Green St & John Wayne Dr, Winterset, Iowa, USA"}],"rated":"PG-13","awards":[{"award":"Academy Awards, USA 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Actress in a Leading Role","names":[{"name":"Meryl Streep","id":"nm0000658","role":null}]}]}]},{"award":"Golden Globes, USA 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Globe","categories":[{"category":"Best Motion Picture - Drama","names":[]},{"category":"Best Performance by an Actress in a Motion Picture - Drama","names":[{"name":"Meryl Streep","id":"nm0000658","role":null}]}]}]},{"award":"Screen Actors Guild Awards 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Actor","categories":[{"category":"Outstanding Performance by a Female Actor in a Leading Role","names":[{"name":"Meryl Streep","id":"nm0000658","role":null}]}]}]},{"award":"American Society of Cinematographers, USA 1996","titlesAwards":[{"titleAwardOutcome":"Nominated ASC Award","categories":[{"category":"Outstanding Achievement in Cinematography in Theatrical Releases","names":[{"name":"Jack N. Green","id":"nm0005726","role":null}]}]}]},{"award":"ASCAP Film and Television Music Awards 1996","titlesAwards":[{"titleAwardOutcome":"Won ASCAP Award","categories":[{"category":"Top Box Office Films","names":[{"name":"Clint Eastwood","id":"nm0000142","role":null}]}]}]},{"award":"Awards Circuit Community Awards 1995","titlesAwards":[{"titleAwardOutcome":"Nominated ACCA","categories":[{"category":"Best Actress in a Leading Role","names":[{"name":"Meryl Streep","id":"nm0000658","role":null}]}]}]},{"award":"Awards of the Japanese Academy 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Award of the Japanese Academy","categories":[{"category":"Best Foreign Film","names":[]}]}]},{"award":"Blockbuster Entertainment Awards 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Blockbuster Entertainment Award","categories":[{"category":"Favorite Actor - Drama","names":[{"name":"Meryl Streep","id":"nm0000658","role":null}]}]}]},{"award":"Blue Ribbon Awards 1996","titlesAwards":[{"titleAwardOutcome":"Won Blue Ribbon Award","categories":[{"category":"Best Foreign Language Film","names":[{"name":"Clint Eastwood","id":"nm0000142","role":null}]}]}]},{"award":"BMI Film & TV Awards 1996","titlesAwards":[{"titleAwardOutcome":"Won BMI Film Music Award","categories":[{"category":"","names":[{"name":"Lennie Niehaus","id":"nm0006215","role":null}]}]}]},{"award":"Chicago Film Critics Association Awards 1996","titlesAwards":[{"titleAwardOutcome":"Nominated CFCA Award","categories":[{"category":"Best Actress","names":[{"name":"Meryl Streep","id":"nm0000658","role":null}]},{"category":"Best Director","names":[{"name":"Clint Eastwood","id":"nm0000142","role":null}]}]}]},{"award":"César Awards, France 1996","titlesAwards":[{"titleAwardOutcome":"Nominated César","categories":[{"category":"Best Foreign Film (Meilleur film étranger)","names":[{"name":"Clint Eastwood","id":"nm0000142","role":null}]}]}]},{"award":"Dallas-Fort Worth Film Critics Association Awards 1996","titlesAwards":[{"titleAwardOutcome":"2nd place DFWFCA Award","categories":[{"category":"Best Actress","names":[{"name":"Meryl Streep","id":"nm0000658","role":null}]}]}]},{"award":"Fotogramas de Plata 1996","titlesAwards":[{"titleAwardOutcome":"Won Fotogramas de Plata","categories":[{"category":"Best Foreign Film (Mejor Película Extranjera)","names":[{"name":"Clint Eastwood","id":"nm0000142","role":null}]}]}]},{"award":"Kinema Junpo Awards 1996","titlesAwards":[{"titleAwardOutcome":"Won Kinema Junpo Award","categories":[{"category":"Best Foreign Language Film Director","names":[{"name":"Clint Eastwood","id":"nm0000142","role":null}]}]}]},{"award":"Mainichi Film Concours 1996","titlesAwards":[{"titleAwardOutcome":"Won Readers' Choice Award","categories":[{"category":"Best Foreign Language Film","names":[{"name":"Clint Eastwood","id":"nm0000142","role":null}]}]}]},{"award":"National Society of Film Critics Awards, USA 1996","titlesAwards":[{"titleAwardOutcome":"3rd place NSFC Award","categories":[{"category":"Best Actress","names":[{"name":"Meryl Streep","id":"nm0000658","role":null}]}]}]},{"award":"New York Film Critics Circle Awards 1995","titlesAwards":[{"titleAwardOutcome":"Nominated NYFCC Award","categories":[{"category":"Best Actress","names":[{"name":"Meryl Streep","id":"nm0000658","role":null}]}]}]},{"award":"Sant Jordi Awards 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Sant Jordi","categories":[{"category":"Best Foreign Actress (Mejor Actriz Extranjera)","names":[{"name":"Meryl Streep","id":"nm0000658","role":null}]}]}]}],"votes":"57,294","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026840","name":"Warner Bros."},{"idCompany":"co0009119","name":"Amblin Entertainment"},{"idCompany":"co0010258","name":"Malpaso Productions"}],"keywords":{"keywords":["bridge","love","farm","photographer","housewife","iowa","national geographic magazine","italian american","reference to anias nin","family farm","photo journalist","italian immirant","marital infidelity","parting","photography","flashback","revelation","rural setting","sex in a bathtub","husband wife relationship","extramarital affair","love letter","told in flashback","goodbye","covered bridge","impossible love","based on novel","cremated remains","lawyer","diary","1960s","woman","jazz score","bouquet of flowers","beating a carpet","motel","natural wipe","aria","blues music","reference to william butler yeats","opera","cigarette smoking","saxophonist","year 1987","safe deposit box","jazz","iced tea","dress store","follow shot","year 1965","reference to lord byron","deathbead scene","1980s","reference to peter pan","funerary urn","slow dancing","cremated ashes","mature romance","winterset iowa","old age","crucifix","watching tv","buttocks","bar band","nightclub","gossip","flirting","tripod","golden retriever","camera","letter","photograph","last will and testament","older man younger woman relationship","kitchen","place name in title","county name in title","tragic event","small town","falling in love","divorced man","loneliness","diner","bathtub","bar","directed by star","jazz club","cornfield","brother sister relationship","adultery","news photographer","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:37:41"}}