{"data":{"movies":[{"title":"Intersection","originalTitle":"","year":"1994","releaseDate":"19940121","directors":[{"name":"Mark Rydell","id":"nm0753073"}],"writers":[{"name":"David Rayfiel","id":"nm0713128"},{"name":"Marshall Brickman","id":"nm0108613"}],"runtime":"98 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMDc1MDAwOF5BMl5BanBnXkFtZTcwMTM1MjIyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama","Romance"],"plot":"Vincent Eastman has to choose between his wife of 16 years, Sally, and his new love, Olivia. Frequent flashbacks explain the background to the marriage and the affair.","simplePlot":"While driving on a remote highway, a man is torn between choosing to reunite with his estranged wife or taking up with his lover.","actors":[{"actorName":"Richard Gere","urlProfile":"http://www.imdb.com/name/nm0000152","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NDQ2OTY4M15BMl5BanBnXkFtZTYwNTYyNjc4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 August 1949","placeOfBirth":" Philadelphia, Pennsylvania, USA","birthName":"Richard Tiffany Gere","height":"5' 10\" (1.78 m)","bio":"Humanitarian and actor Richard Gere was born on August 31, 1949, in Philadelphia, the second of five children of Doris Ann (Tiffany), a homemaker, and Homer George Gere, an insurance salesman, both Mayflower descendants. Richard started early as a musician, playing a number of instruments in high school and writing music for high school productions. He graduated from North Syracuse Central High School in 1967, and won a gymnastics scholarship to the University of Massachusetts in Amherst, where he majored in philosophy. He left college after two years to pursue acting, landing a lead role in the London production of the rock musical \"Grease\" in 1973. The following year he would be in other plays, such as \"Taming of the Shrew.\" Onscreen, he had a few roles, and gained recognition in Looking for Mr. Goodbar (1977). Offscreen, he spent 1978 meeting Tibetans when he traveled to Nepal, where he spoke to many monks and lamas. Returning to the US, on Broadway he portrayed a concentration-camp prisoner in \"Bent,\" for which he received the 1980 Theatre World Award. Back in Hollywood, he played the title role in American Gigolo (1980), establishing himself as a major star; this status was reaffirmed by An Officer and a Gentleman (1982). In the early 1980s, Richard went to Honduras, Nicaragua and El Salvador (amidst ongoing wars and political violence); he traveled with a doctor and visited refugee camps. It is said that he was romantically linked with lovely Brazilian painter Sylvia Martins. In 1990 Richard teamed up with Julia Roberts to star in the blockbuster Pretty Woman (1990); his cool reserve was the perfect complement to Julia's bubbling enthusiasm. The film captured the nation's heart, and won the People's Choice award for Best Movie. Fans clamored for years for a sequel, or at least another pairing of Julia and Richard. They got that with Runaway Bride (1999), which was a runaway success (Richard got $12 million, Julia made $17 million, the box office was $152 million, which shows what happens when you give the public what it wants!). Offscreen, Richard and Cindy Crawford got married December 12, 1991 (they were divorced in 1995). Afterwards, Richard started dating actress Carey Lowell. They had a son, Homer James Jigme Gere, on February 6, 2000. Richard was picked by People magazine as one of the 50 Most Beautiful People in the world in 1991, and as their Sexiest Man Alive in 1999. He is an accomplished pianist and music writer. Above all, Richard is a humanitarian. He's a founding member of \"Tibet House,\" a nonprofit organization dedicated to the preservation of Tibetan culture. He has been an active supporter of \"Survival International\" for several years, a worldwide organization supporting tribal peoples, affirming their right to decide their own future and helping them protect their lives, lands and human rights (these tribes are global, including the natives of the Amazon, the Maasai of East Africa, the Wichi of Argentina, and others). In 1994 Richard went to London to open Harrods' sale, donating his £50,000 appearance fee to Survival. He has been prominent in their charity advertising campaigns.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2NDQ2OTY4M15BMl5BanBnXkFtZTYwNTYyNjc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000152","name":"Richard Gere","idIMDB":"nm0000152"},"actorId":"nm0000152","character":"Vincent Eastman","urlCharacter":"http://www.imdb.com/character/ch0025537","main":true},{"actorName":"Sharon Stone","urlProfile":"http://www.imdb.com/name/nm0000232","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDU1ODQwNF5BMl5BanBnXkFtZTcwOTc3MjQwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 March 1958","placeOfBirth":" Meadville, Pennsylvania, USA","birthName":"Sharon Yvonne Stone","height":"5' 8½\" (1.74 m)","bio":"Sharon Yvonne Stone was born and raised in Meadville, a small town in Pennsylvania, to Dorothy Marie (Lawson), an accountant and homemaker, and Joseph William Stone II, a factory worker. Her father was strict. She was the second of four children, and has English, German, Scottish, and Irish ancestry. At the age of 15, she studied in Saegertown High School, Pennsylvania and, at that same age, entered Edinboro State University of Pennsylvania, and graduated with a degree in creative writing and fine arts. She was a very smart girl, became a bookworm, and once was told that a suitable job for her (and her brains) was to become a lawyer. However, her first love was still the black-and-white movies, especially those featuring Fred Astaire and Ginger Rogers. So, the 17-year-old Sharon got herself into the Miss Crawford County and won the beauty contest. From working part-time as a McDonald's counter girl, she worked her way up to become a successful Ford model, both in TV commercials and print ads. In 1980, she made her film debut as an extra in Woody Allen's Stardust Memories (1980). Her first speaking part was in Wes Craven's horror movie, Deadly Blessing (1981). She struggled through many parts in B-movies, such as King Solomon's Mines (1985) and Action Jackson (1988). She was also married in 1984 to Michael Greenburg, the producer of MacGyver (1985), but they divorced two years later. She finally got her big break with a memorable supporting role in the popular Arnold Schwarzenegger movie Total Recall (1990), and also posed nude for Playboy, a daring move for a 32-year-old actress. But it worked; she was cast in the breakthrough role as a sociopath novelist, \"Catherine Tramell\", in Basic Instinct (1992). Her interrogation scene has become a classic in film history and her performance captivated everyone, from MTV viewers, who honored her with Most Desirable Female and Best Female Performance Awards, to a Golden Globe nomination for Best Actress. After she got famous, she didn't want to be typecast, so she played a victim in Sliver (1993), and, in Intersection (1994), she was the aloof, estranged wife of Richard Gere. Then she appeared in more aggressive roles, such as The Specialist (1994) with Sylvester Stallone and Mort ou vif (1995) with Gene Hackman. But it wasn't until she played a beautiful but drug-crazy trophy wife of Robert De Niro in Casino (1995) that she got far more than just fame and fortune--she also received the acknowledgment of the movie industry for her acting ability. She received her first Golden Globe and an Oscar nomination. She did a couple of films released the next year, teaming up with Isabelle Adjani in Diabolique (1996), and as a woman waiting for her death penalty in Last Dance (1996). In 1998, she married a newspaper editor,Phil Bronstein but they divorced later in 2004. She received her third Golden Globe nomination for The Mighty (1998), a film that her company, \"Chaos\", also co-executive produced. The next year, she played the title role in Gloria (1999) and entered her first comedic role in The Muse (1999), which gave her another Golden Globe nomination. Sharon Stone, a diva who thoroughly enjoys her hard-won stardom, is now a mother of three children: Roan, Laird and Quinn.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0MDU1ODQwNF5BMl5BanBnXkFtZTcwOTc3MjQwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000232","name":"Sharon Stone","idIMDB":"nm0000232"},"actorId":"nm0000232","character":"Sally Eastman","urlCharacter":"http://www.imdb.com/character/ch0025538","main":true},{"actorName":"Lolita Davidovich","urlProfile":"http://www.imdb.com/name/nm0000357","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ3ODY2NTcwMF5BMl5BanBnXkFtZTYwNTQ2ODcz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1961","placeOfBirth":" London, Ontario, Canada","birthName":"Lolita Davidovic","height":"5' 8\" (1.73 m)","bio":"Lolita Davidovich was born on July 15, 1961 in London, Ontario, Canada as Lolita Davidovic. She is an actress, known for Gods and Monsters (1998), The Longest Ride (2015) and Raising Cain (1992). She has been married to Ron Shelton since 1997. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQ3ODY2NTcwMF5BMl5BanBnXkFtZTYwNTQ2ODcz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000357","name":"Lolita Davidovich","nicknames":["Lolly"],"idIMDB":"nm0000357"},"actorId":"nm0000357","character":"Olivia Marshak","urlCharacter":"http://www.imdb.com/character/ch0384101","main":true},{"actorName":"Martin Landau","urlProfile":"http://www.imdb.com/name/nm0001445","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MzkxNzg0OF5BMl5BanBnXkFtZTcwNDUzOTc5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1928","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"6' 2\" (1.88 m)","bio":"Oscar-winning character actor Martin Landau was born on June 20, 1928 in Brooklyn, New York. At age 17, he was hired by the New York Daily News as a staff cartoonist and illustrator. In his five years on the paper, he served as the illustrator for Billy Rose's \"Pitching Horseshoes\" column. He also worked for cartoonist Gus Edson on \"The Gumps\" comic strip. Landau's major ambition was to act, and in 1951, he made his stage debut in \"Detective Story\" at the Peaks Island Playhouse in Peaks Island, Maine. He made his off-Broadway debut that year in \"First Love\". Landau was one of 2000 applicants who auditioned for Lee Strasberg's Actors Studio in 1955 - only he and Steve McQueen were accepted. Landau was a friend of James Dean and McQueen, in a conversation with Landau, mentioned that he knew Dean and had met Landau. When Landau asked where they had met, McQueen informed him he had seen Landau riding into the New York City garage where he worked as a mechanic on the back of Dean's motorcycle. He acted during the mid-1950s in the television anthologies Playhouse 90 (1956), Studio One in Hollywood (1948), The Philco-Goodyear Television Playhouse (1948), Kraft Theatre (1947), Goodyear Playhouse (1951) and Omnibus (1952). He began making a name for himself after replacing star Franchot Tone in the 1956 off-Broadway revival of Anton Chekhov's \"Uncle Vanya\", a famous production that helped put off-Broadway on the New York theatrical map. In 1957, he made a well-received Broadway debut in the play \"Middle of the Night\". As part of the touring company with star Edward G. Robinson, he made it to the West Coast. He made his movie debut in Pork Chop Hill (1959) but scored on film as the heavy in Alfred Hitchcock's classic thriller North by Northwest (1959), in which he was shot on top of Mount Rushmore while sadistically stepping on the fingers of Cary Grant, who was holding on for dear life to the cliff face. He also appeared in the blockbuster Cleopatra (1963), the most expensive film ever made up to that time, which nearly scuttled 20th Century-Fox and engendered one of the great public scandals, the Elizabeth Taylor-Richard Burton love affair that overshadowed the film itself. Despite the difficulties with the film, Landau's memorable portrayal in the key role of Rufio was highly favored by the audience and instantly catapulted his popularity. In 1963, Landau played memorable roles on two episodes of the science-fiction anthology series The Outer Limits (1963), \"The Bellero Shield\" and \"The Man Who Was Never Born\". He was Gene Roddenberry's first choice to play Mr. Spock on Star Trek (1966), but the role went to Leonard Nimoy, who later replaced Landau on Mission: Impossible (1966), the show that really made Landau famous. He originally was not meant to be a regular on the series, which co-starred his wife Barbara Bain, whom he had married in 1957. His character, Rollin Hand, was supposed to make occasional, though recurring appearances, on Mission: Impossible (1966), but when the producers had problems with star Steven Hill, Landau was used to take up the slack. Landau's characterisation was so well-received and so popular with the audience that he was made a regular. Landau received Emmy nominations as Outstanding Lead Actor in a Drama Series for each of the three seasons he appeared. In 1968, he won the Golden Globe award as Best Male TV Star. Eventually, he quit the series in 1969 after a salary dispute when the new star, Peter Graves, was given a contract that paid him more than Landau, whose own contract stated he would have parity with any other actor on the show who made more than he did. The producers refused to budge and he and Bain, who had become the first actress in the history of television to be awarded three consecutive Emmy Awards (1967-69) while on the show, left the series, ostensibly to pursue careers in the movies. The move actually held back their careers, and Mission: Impossible (1966) went on for another four years with other actors. Landau appeared in support of Sidney Poitier in They Call Me Mister Tibbs! (1970), the less successful sequel to the Oscar-winning In the Heat of the Night (1967), but it did not generate more work of a similar caliber. He starred in the television movie Welcome Home, Johnny Bristol (1972) on CBS, playing a prisoner of war returning to the United States from Vietnam. The following year, he shot a pilot for NBC for a proposed show, \"Savage\". Though it was directed by emerging wunderkind Steven Spielberg, NBC did not pick up the show. Needing work, Landau and Bain moved to England to play the leading roles in the syndicated science-fiction series Space: 1999 (1975). Landau's and Bain's careers stalled after Space: 1999 (1975) went out of production, and they were reduced to taking parts in the television movie The Harlem Globetrotters on Gilligan's Island (1981). It was the nadir of both their careers, and Bain's acting days, and their marriage, soon were over. Landau, one of the most talented character actors in Hollywood, and one not without recognition, had bottomed out career-wise. In 1983, he was stuck in low-budget sci-fi and horror movies like The Being (1983), a role far beneath his talent. His career renaissance got off to a slow start with a recurring role in the NBC sitcom Buffalo Bill (1983), starring Dabney Coleman. On Broadway, he took over the title role in the revival of \"Dracula\" and went on the road with the national touring company. Finally, his career renaissance began to gather momentum when Francis Ford Coppola cast him in a critical supporting role in his Tucker: The Man and His Dream (1988), for which Landau was nominated for an Academy Award as Best Supporting Actor. He won his second Golden Globe for the role. The next year, he received his second consecutive Best Supporting Actor Oscar nomination for his superb turn as the adulterous husband in Woody Allen's Crimes and Misdemeanors (1989). He followed this up by playing famed Nazi hunter Simon Wiesenthal in the TNT movie Max and Helen (1990). However, the summit of his post-\"Mission: Impossible\" carer was about to be scaled. He portrayed Bela Lugosi in Tim Burton's biopic Ed Wood (1994) and won glowing reviews. For his performance, he won the Best Supporting Actor Oscar. Martin Landau, the superb character actor, finally had been recognized with his profession's ultimate award. His performance, which also won him his third Golden Globe, garnered numerous awards in addition to the Oscar and Golden Globe, including top honors from the New York Film Critics Circle and the National Society of Film Critics. Landau continued to play a wide variety of roles in motion pictures and on television, turning in a superb performance in a supporting role in The Majestic (2001). He received his fourth Emmy nomination in 2004 as Outstanding Guest Actor in a Drama Series for Without a Trace (2002). Martin Landau was honored with his own star on the Hollywood Walk of Fame, located at 6801 Hollywood Boulevard.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MzkxNzg0OF5BMl5BanBnXkFtZTcwNDUzOTc5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001445","name":"Martin Landau","nicknames":["Marty"],"idIMDB":"nm0001445"},"actorId":"nm0001445","character":"Neal","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Selby","urlProfile":"http://www.imdb.com/name/nm0782978","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMzA4MDM1OF5BMl5BanBnXkFtZTYwODU2NTAz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1941","placeOfBirth":" Morgantown, West Virginia, USA","birthName":"David Lynn Selby","height":"6' 2\" (1.88 m)","bio":"Actor David Selby, highly regarded for his villainous work on both daytime and nighttime soap classics, was born in Morgantown, West Virginia. He attended West Virginia University and graduated with both B.S. and M.A. degrees from West Virginia University, then earned a Ph.D. from Southern Illinois University in Carbondale. Following many years on the stock stage (from 1961), David finally attracted infamous attention when he signed on as Quentin Collins, a werewolf, on the gothic daytime drama \"Dark Shadows\" in 1968. He inherited heartthrob status briefly with the role and even recorded two songs during the show's run, \"Quentin's Theme\" and \"I Wanna Dance With You.\" After the series' demise, he made his movie debut with Night of Dark Shadows (1971), the second film based on the cult series. He broached top film stardom in the early 1970s after co-starring with Barbra Streisand in Up the Sandbox (1972) and Ron Leibman in The Super Cops (1974), and continued his high-profiled pace with New York theatre productions of \"The Heiress\" (1976), with Jane Alexander and Richard Kiley, and \"Eccentricities of a Nightingale\" (1976) with Betsy Palmer, but things didn't quite pan out. In the 1980s, however, steady TV work helped put an extra shot of adrenalin back into David's career, notably as the cunning Richard Channing on the nighttime soap \"Falcon Crest,\" a role he played from 1982 until 1990. David has graced most of the popular series over the years including \"The Waltons,\" \"Police Woman,\" \"Kojak,\" \"Family,\" \"Touched by an Angel,\" and \"Ally McBeal.\" He has also appeared sporadically in white-collar film support with roles in Dying Young (1991), White Squall (1996) and Surviving Christmas (2004) to his credit. David continues to perform on stage as well. He portrayed Abraham Lincoln in his own play \"Lincoln and James\" in 1997 and 1998, and penned the play \"Final Assault\" which premiered in 2003. He is a staple player in radio drama with the L.A. Theatre Works these days. David and longtime wife Chip have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMzA4MDM1OF5BMl5BanBnXkFtZTYwODU2NTAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0782978","name":"David Selby","idIMDB":"nm0782978"},"actorId":"nm0782978","character":"Richard Quarry","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennifer Morrison","urlProfile":"http://www.imdb.com/name/nm0607185","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjMwODQ5M15BMl5BanBnXkFyZXN1bWU@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1979","placeOfBirth":" Chicago, Illinois, USA","birthName":"Jennifer Marie Morrison","height":"5' 5¼\" (1.66 m)","bio":"Jennifer Marie Morrison was born in Chicago, Illinois, the oldest child of teachers David and Judy Morrison. She was raised in Arlington Heights, IL, with a younger sister and brother. She attended the same school her parents taught at, Prospect High School. As a child, she did some work as a model. After graduating from high school, she attended Loyola University in Chicago, where she studied Theater and English. She then moved on to study at the Steppenwolf Theater Company, before relocating to Los Angeles, California to pursue her acting career. Morrison's movie debut came in 1994, playing the daughter of Richard Gere and Sharon Stone in Intersection (1994). Success followed with various film and television roles, including the lead in Urban Legend 2: Coup de grâce (2000). She came to wide scale public attention in 2004 for her role as Dr. Allison Cameron in the television series House (2004), for which she was nominated for a prestigious Screen Actors Guild Award. Since leaving \"House M.D.\", her career has continued to progress with roles in Star Trek (2009), How I Met Your Mother (2005) and Warrior (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA1MjMwODQ5M15BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0607185","name":"Jennifer Morrison","nicknames":["Jen","J-mo"],"idIMDB":"nm0607185"},"actorId":"nm0607185","character":"Meaghan Eastman","urlCharacter":"http://www.imdb.com/character/ch0418053","main":true},{"actorName":"Ron White","urlProfile":"http://www.imdb.com/name/nm0925406","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTI3OTkwOTU0MF5BMl5BanBnXkFtZTgwMzc1MDM0MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"Ron White was born in Dawson Creek, British Columbia, Canada. He is an actor, known for Unforgiven (1992), Planète hurlante (1995) and Defendor: héros ou zéro (2009).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTI3OTkwOTU0MF5BMl5BanBnXkFtZTgwMzc1MDM0MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0925406","name":"Ron White","idIMDB":"nm0925406"},"actorId":"nm0925406","character":"Charlie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Matthew Walker","urlProfile":"http://www.imdb.com/name/nm0908022","urlPhoto":"","biography":{"dateOfBirth":"11 April 1942","placeOfBirth":" England, UK","bio":"Matthew Walker was born on April 11, 1942 in England. He is an actor, known for Night at the Museum (2006), The Assassination of Jesse James by the Coward Robert Ford (2007) and Alone in the Dark (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0908022","name":"Matthew Walker","idIMDB":"nm0908022"},"actorId":"nm0908022","character":"Surgeon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott Bellis","urlProfile":"http://www.imdb.com/name/nm0069069","urlPhoto":"","biography":{"bio":"Scott Bellis is an actor, known for Timecop (1994), Antitrust (2001) and Little Women (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0069069","name":"Scott Bellis","idIMDB":"nm0069069"},"actorId":"nm0069069","character":"Van Driver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Patricia Harras","urlProfile":"http://www.imdb.com/name/nm0364055","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTcwNDcyMTI0MV5BMl5BanBnXkFtZTgwNTc3OTMyNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"birthName":"Patricia Ann Harras","bio":"Patricia Harras was born in Winnipeg, Manitoba, Canada as Patricia Ann Harras. She is an actress, known for Fantastic 4: Rise of the Silver Surfer (2007), Mission to Mars (2000) and Things We Lost in the Fire (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTcwNDcyMTI0MV5BMl5BanBnXkFtZTgwNTc3OTMyNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0364055","name":"Patricia Harras","nicknames":["Harras, Patti"],"idIMDB":"nm0364055"},"actorId":"nm0364055","character":"Van Driver's Wife","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Keegan MacIntosh","urlProfile":"http://www.imdb.com/name/nm0532857","urlPhoto":"","biography":{"dateOfBirth":"2 June 1984","placeOfBirth":" British Columbia, Canada","bio":"Keegan MacIntosh was born on June 2, 1984 in British Columbia, Canada. He is an actor, known for Legends of the Fall (1994), Henry & Verlin (1996) and Intersection (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0532857","name":"Keegan MacIntosh","idIMDB":"nm0532857"},"actorId":"nm0532857","character":"Van Driver's Son","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"A.C. Peterson","urlProfile":"http://www.imdb.com/name/nm0012586","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3MTAxMzg3NDFeQTJeQWpwZ15BbWU4MDQzMTQzMjcx._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"birthName":"Alar Aedma","bio":"A.C. Peterson was born as Alar Aedma. He is known for his work on Shooter (2007), Sucker Punch (2011) and Narc (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3MTAxMzg3NDFeQTJeQWpwZ15BbWU4MDQzMTQzMjcx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0012586","name":"A.C. Peterson","idIMDB":"nm0012586"},"actorId":"nm0012586","character":"Semi-Driver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sandra P. Grant","urlProfile":"http://www.imdb.com/name/nm0335640","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MjEwMjI2MV5BMl5BanBnXkFtZTgwOTA1MzkyNzE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Sandra P. Grant was born in Toronto, Ontario, Canada. She is an actress, known for One Life to Live (1968), Look Who's Talking Now (1993) and Intersection (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MjEwMjI2MV5BMl5BanBnXkFtZTgwOTA1MzkyNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0335640","name":"Sandra P. Grant","idIMDB":"nm0335640"},"actorId":"nm0335640","character":"Receptionist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robyn Stevan","urlProfile":"http://www.imdb.com/name/nm0828149","urlPhoto":"","biography":{"bio":"Robyn Stevan is known for her work on The Stepfather (1987), Stepping Out (1991) and Pushing Tin (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0828149","name":"Robyn Stevan","idIMDB":"nm0828149"},"actorId":"nm0828149","character":"Step Magazine","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"David Hurtubise","urlProfile":"http://www.imdb.com/name/nm0403770","urlPhoto":"","biography":{"bio":"David Hurtubise is an actor, known for Doctor Who (1996), Intersection (1994) and Scooby-Doo! The Mystery Begins (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0403770","name":"David Hurtubise","idIMDB":"nm0403770"},"actorId":"nm0403770","character":"Step Magazine","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0110146","urlIMDB":"http://www.imdb.com/title/tt0110146","business":{"budget":{"money":"$45,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":"£923,343","country":"UK","day":"19","month":"06","year":"1994","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1993/\">1993</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 38 min (98 min)"],"soundMix":["Dolby SR"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA (prints)","Gastown Film Labs Ltd., Vancouver, Canada (dailies)"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.2","filmingLocations":[{"location":"Britannia Beach, British Columbia, Canada"}],"rated":"R","awards":[{"award":"Razzie Awards 1995","titlesAwards":[{"titleAwardOutcome":"Won Razzie Award","categories":[{"category":"Worst Actress","names":[{"name":"Sharon Stone","id":"nm0000232","role":null},{"name":"The Specialist","id":"tt0111255","role":null}]}]}]},{"award":"The Stinkers Bad Movie Awards 1994","titlesAwards":[{"titleAwardOutcome":"Won Stinker Award","categories":[{"category":"Worst Actress","names":[{"name":"Sharon Stone","id":"nm0000232","role":null},{"name":"The Specialist","id":"tt0111255","role":null}]}]}]}],"votes":"6,264","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["marriage","flashback","chess","infidelity","unfaithfulness","intersection","classic car","sleeping in a car","teenage girl","boat","answering machine message","highway","truck","camper van","car accident","told in flashback","female journalist","female writer","slow motion scene","husband wife relationship","ballet dancer","cheating husband","architectural model","sex","restaurant","elevator","diner","bathroom","foreign language adaptation","femme fatale","vancouver","totem pole","toast","sex by a fireplace","playing piano","picasso","mercedes benz","massage","love letter","interrupted sex","gavel","driving in the rain","dining al fresco","candlelight dinner","brushing teeth","brushing one's hair","billiards","ballet","answering machine","yacht","verbal abuse","unfaithful wife","unfaithful husband","umbrella","talking to the camera","speech","sailboat","road accident","red wine","photograph","phone booth","party","museum","model builder","love triangle","letter","journalist","hospital","heavy rain","hard hat","fireplace","female nudity","father daughter relationship","extramarital affair","dysfunctional marriage","dancer","construction site","compassion","clock","charade","car crash","bathrobe","ballet school","auction","architect","adultery","remake of french film","remake","based on novel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 07:51:46"}}