{"data":{"movies":[{"title":"Black Sheep","originalTitle":"","year":"1996","releaseDate":"19960202","directors":[{"name":"Penelope Spheeris","id":"nm0790715"}],"writers":[{"name":"Fred Wolf","id":"nm0937748"}],"runtime":"87 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjc2NzU0YjUtYzkyNS00NjcwLWJiM2QtM2Y3YjFhMTQ0M2I3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy"],"plot":"Comedy about the prospective Washington State Governor Al Donnelly whose only stumbling block on the road to power is his embarrassing younger brother Mike. To keep him out of mischief, Al forces one of his aides, Steve Dodds to keep an eye on him during the election. However, this is easier said than done...","simplePlot":"A gubernatorial candidate hires a wormy special assistant whose only job is to make sure the candidate's well-meaning but incompetent brother doesn't ruin the election.","actors":[{"actorName":"Chris Farley","urlProfile":"http://www.imdb.com/name/nm0000394","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjQwODkxMl5BMl5BanBnXkFtZTYwMTAxNjc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 February 1964","placeOfBirth":" Madison, Wisconsin, USA","birthName":"Christopher Crosby Farley","height":"5' 8\" (1.73 m)","bio":"Christopher Crosby Farley was born on February 15, 1964, in Madison, Wisconsin, to Mary Anne (Crosby) and Thomas Farley, who owned an oil company. Among his siblings are actors Kevin P. Farley and John Farley. He was of Irish heritage. Farley studied theatre and communications on Marquette University. After finishing University Chris was in the cast of the Second City Theatre, where he was discovered by the producer of the great comedy-show Saturday Night Live (1975), Lorne Michaels. Chris worked on Saturday Night Live (1975) for five years during which he appeared in movies like Wayne's World (1992), Coneheads (1993), Billy Madison (1995) and finally Tommy Boy (1995), with his comic partner and SNL cast member David Spade. The duo later made one more movie called Black Sheep (1996). From that time on, Chris was one of the big comedy stars, and his fame was growing and growing. After some more time, he made another \"lone\" movie, Beverly Hills Ninja (1997), which featured former SNL member Chris Rock. Farley was made even more famous, but with his growing fame, his problems grew bigger as well; he didn't want to be the \"fat guy who falls down\" any longer. Chris had several other problems, too, with alcohol and drug dependency. On December 18th, 1997, he died from a heroin (opiate) and cocaine overdose in his apartment in Chicago, where his body was found by his brother John the next day. Chris' weight of 296 pounds was a contributing factor to his death, but according to his autopsy the alcohol, marijuana and Prozac that was also found in his body, were not. Less than two months prior to Farley's death, he had appeared alongside Chevy Chase on what would be Farley's only SNL show as host. Not unlike his idol John Belushi, he was credited for one more appearance after having left SNL and died at age 33. His death cause was also the same. In the year after Chris' departing, the movie Almost Heroes (1998), where he plays the leading role alongside Matthew Perry was released. He also makes cameo appearances in Dirty Work (1998)","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMjQwODkxMl5BMl5BanBnXkFtZTYwMTAxNjc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000394","name":"Chris Farley","idIMDB":"nm0000394"},"actorId":"nm0000394","character":"Mike Donnelly","urlCharacter":"http://www.imdb.com/character/ch0019269","main":true},{"actorName":"David Spade","urlProfile":"http://www.imdb.com/name/nm0005450","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3OTQxMzc0NV5BMl5BanBnXkFtZTgwNDA0NjA0OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1964","placeOfBirth":" Birmingham, Michigan, USA","birthName":"David Wayne Spade","height":"5' 7\" (1.7 m)","bio":"Comic brat extraordinaire David Spade was born on July 22, 1964, in Birmingham, Michigan, the youngest of three brothers. He is the son of Judith J. (Meek), a writer and editor, and Wayne M. Spade, a sales rep, and is of German, English, Irish, and Scottish descent. Raised in both Scottsdale (from age four) and Casa Grande, Arizona, he graduated with a degree in business from Arizona State University in 1986. A natural prankster most of his life, Spade was pushed immediately into stand-up comedy by friends and appeared in nightclubs and college campuses all over the country. A casting agent saw his routine at \"The Improv\" in Los Angeles and offered him a mischievous role in the film Police Academy 4: Citizens on Patrol (1987). In 1990, the diminutive, flaxen-haired comedian finally hit the big time as a regular cast member and writer on Saturday Night Live (1975). Slow at first in gaining acceptance on the show, his razor-sharp sarcasm eventually caught on by his second season, when he played a number of smart-aleck characters in a variety of sketches, including a highly disinterested airline steward who bids each passenger adieu with a very sardonic \"buh-bye\" and an irritating receptionist for Dick Clark Productions who greets each huge celebrity with an unknowing \"And you are . . . ?\" A master of the putdown, Spade's \"Hollywood Minute\" reporter also took cynical advantage of tabloid-worthy stars. Spade impersonated such luminaries as Michael J. Fox, Kurt Cobain and Tom Petty during his tenure. Following his SNL departure after six years, he spun off into a slapstick movie career, most noticeably as the scrawny, taciturn foil to SNL's wild and crazy big boy Chris Farley in Tommy Boy (1995) and Black Sheep (1996). The teaming of this unlikely but funny pair ended with Farley's death from a 1997 drug overdose. Since then, Spade has appeared in his own lukewarm vehicles, including Joe Dirt (2001) and Dickie Roberts: Former Child Star (2003). More recently he teamed with former SNL member Rob Schneider on the film The Benchwarmers (2006). Television has been more accepting over the years, with Spade earning an Emmy nomination as the droll, skirt-chasing secretary Dennis Finch on Just Shoot Me! (1997) and filling in after the untimely death of John Ritter on ABC's 8 Simple Rules (2002) as Katey Sagal's unprincipled nephew. More recently he was the star of the Comedy Central show The Showbiz Show with David Spade (2005) in 2005 wherein he more or less resurrected his obnoxious, razor-tongued gossipmonger from the old \"Hollywood Minute\" put-down segment on SNL, as well as co-starring in the adult-oriented ensemble sitcom Rules of Engagement (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3OTQxMzc0NV5BMl5BanBnXkFtZTgwNDA0NjA0OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005450","name":"David Spade","idIMDB":"nm0005450"},"actorId":"nm0005450","character":"Steve Dodds","urlCharacter":"http://www.imdb.com/character/ch0019267","main":true},{"actorName":"Tim Matheson","urlProfile":"http://www.imdb.com/name/nm0001513","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNTEyNzU4Ml5BMl5BanBnXkFtZTgwMDI2MTY4MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 December 1947","placeOfBirth":" Glendale, California, USA","birthName":"Timothy Lewis Matthieson","height":"6' 2\" (1.88 m)","bio":"Tim Matheson is an American actor, director and producer perhaps best known for his portrayal of the smooth talking 'Eric \"Otter\" Stratton' in the 1978 comedy, Animal House (1978), but has had a variety of other well-known roles both before and since, including critical accolades for his playing \"Vice President John Hoynes\" on the television series, The West Wing (1999), which garnered him two Primetime Emmy award nominations for Best Guest Star in a Drama Series. From 2011 to 2015, Matheson starred as 'Dr. Brick Breeland' in The CW series, Hart of Dixie (2011), opposite Rachel Bilson. He has and continues to direct several episodes each season throughout the series. Not limited to \"Hart of Dixie\", Matheson has made a career of directing an array of episodic projects on some of television's most prominent shows, including \"The Last Ship,\" \"Burn Notice,\" \"Criminal Minds,\" \"Without a Trace,\" \"Cold Case,\" \"Numbers,\" \"Drop Dead Diva,\" \"Suits,\" \"Eureka\" and \"White Collar,\" as well as pilots for Fox's \"The Good Guys\" and the USA Network successful original series \"Covert Affairs.\" Beginning his career at the age of 13, Matheson appeared in Robert Young's CBS nostalgia comedy series, Window on Main Street (1961), during the 1961-1962 television season. In 1964, he provided the voice of the lead character in the cartoon program Jonny Quest (1964), as well as the voice of \"Jace\" in the original animated series, Space Ghost (1966). Additionally, he played the role of the oldest son, \"Mike Beardsley\", in the film Yours, Mine and Ours (1968), which starred Lucille Ball and Henry Fonda. In 1969, Matheson joined the cast of NBC's western series, The Virginian (1962), in its eighth season, as \"Jim Horn\". During the final season of the television western Bonanza (1959) in 1972-1973, Matheson played \"Griff King\", a parolee who tries to reform his life as a worker at the Ponderosa Ranch under Ben Cartwright's watch. Following that, he portrayed young motorcycle cop \"Phil Sweet\", in the 1973 film, Magnum Force (1973). In the fall of 1976, Matheson was seen opposite Kurt Russell in the NBC series, The Quest (1976), the story of two young men in the American West seeking the whereabouts of their sister, a captive of the Cheyenne. In 1978, he co-starred in the acclaimed Animal House (1978), opposite John Belushi; the following year, he appeared alongside Belushi again in Steven Spielberg's 1941 (1979). Matheson and Catherine Hicks played \"Rick Tucker\" and \"Amanda Tucker\", who operate a detective agency in Laurel Canyon in CBS' Tucker's Witch (1982), which aired during the 1982-1983 season. He then appeared in the 1983 To Be or Not to Be (1983), starring Mel Brooks and Anne Bancroft and went on to star in the 1984 comedy, Up the Creek (1984) and 1985's Fletch (1985). Matheson, along with business partner 'Dan Grodnik', bought National Lampoon in 1989, when the magazine was facing financial decline. They were unable to reverse the magazine fortunes, however, and sold it in 1991. In 1996, Matheson took on the role of a con man who claims to be Carol Brady's thought-to-be-dead husband in A Very Brady Sequel (1996). Matheson was seen opposite Ryan Reynolds in the feature comedy Van Wilder: Party Liaison (2002) in 2002, playing the father of the title character, who was inspired by his own character in Animal House (1978), as a nod to the original film. He was born in Glendale, California, a suburb of Los Angeles, and has three wonderful children from former wife, Megan Murphy Matheson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNTEyNzU4Ml5BMl5BanBnXkFtZTgwMDI2MTY4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001513","name":"Tim Matheson","idIMDB":"nm0001513"},"actorId":"nm0001513","character":"Al Donnelly","urlCharacter":"http://www.imdb.com/character/ch0019270","main":true},{"actorName":"Christine Ebersole","urlProfile":"http://www.imdb.com/name/nm0002056","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ4NTk3MTM4NF5BMl5BanBnXkFtZTYwMjkxNDIz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 February 1953","placeOfBirth":" Chicago, Illinois, USA","height":"5' 10\" (1.78 m)","bio":"Christine Ebersole was born in Chicago, Illinois, to Marian Esther (Goodley) and Robert Amos Ebersole, a steel company president. She won the 2007 Tony Award for Best Actress in a Musical for her work in \"Grey Gardens\". Previously, she was awarded the Drama Desk Award, the Outer Critics Circle Award, the Drama League awarded her both a citation and the Outstanding Performance of the Year, and she was named to its dais for 2007. She also received a special citation from the New York Drama Critics' Circle and the Obie for her off-Broadway turn in \"Grey Gardens\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ4NTk3MTM4NF5BMl5BanBnXkFtZTYwMjkxNDIz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002056","name":"Christine Ebersole","idIMDB":"nm0002056"},"actorId":"nm0002056","character":"Governor Tracy","urlCharacter":"http://www.imdb.com/character/ch0264511","main":true},{"actorName":"Gary Busey","urlProfile":"http://www.imdb.com/name/nm0000997","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NjM5NjE5NF5BMl5BanBnXkFtZTYwNTk3MjUz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 June 1944","placeOfBirth":" Goose Creek, Texas, USA","birthName":"William Gary Busey","height":"6' (1.83 m)","bio":"A blond-haired, fair-complexioned actor with a toothy grin and capable of an unsettling glint in his eyes, Gary Busey was born in Goose Creek, Texas, and was raised in Oklahoma. He is the son of Sadie Virginia (Arnett), a homemaker, and Delmar Lloyd Busey, a construction design manager. He has English, as well as Irish, Scottish, and German, ancestry. He graduated from Nathan Hale High School in Tulsa, Oklahoma in 1962 and for a while was a professional musician. A talented drummer, he played in several bands, including those of country-and-western legends Leon Russell, Kris Kristofferson and Willie Nelson. Busey's first film appearance was as a biker in the low-budget Angels Hard as They Come (1971) and, over the next few years, he landed several film roles generally as a country hick/redneck or surly, rebellious types. His real breakthrough came in the dynamic film The Buddy Holly Story (1978), with Busey taking the lead role as Buddy Holly, in addition to playing guitar and singing all the vocals! His stellar performance scored him a Best Actor nomination and the attention of Hollywood taking overcasting agents. Next up, he joined fellow young actors William Katt and Jan-Michael Vincent as surfing buddies growing up together in the cult surf film Big Wednesday (1978), directed by John Milius. However, a string of appearances in somewhat mediocre films took him out of the spotlight for several years, until he played the brutal assassin Mr. Joshua trying to kill Los Angeles cops Mel Gibson and Danny Glover in the runaway mega-hit Lethal Weapon (1987). Further strong roles followed, including alongside Danny Glover once again in Predator 2 (1990). He was back on the beaches, this time tracking bank robbers with FBI agent Keanu Reeves, in Point Break - Extrême limite (1991) and nearly stole the show as a psychotic Navy officer in league with terrorists led by Tommy Lee Jones taking over the USS Missouri in the highly popular Piège en haute mer (1992). The entertaining Busey has continued to remain busy in front of the cameras and has certainly developed a minor cult following among many film fans. Plus, he's also the proud father of accomplished young actor Jake Busey, whose looks make him almost a dead ringer for his famous father.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NjM5NjE5NF5BMl5BanBnXkFtZTYwNTk3MjUz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000997","name":"Gary Busey","nicknames":["Barry Goosey"],"idIMDB":"nm0000997"},"actorId":"nm0000997","character":"Drake Sabitch","urlCharacter":"http://www.imdb.com/character/ch0019268","main":true},{"actorName":"Grant Heslov","urlProfile":"http://www.imdb.com/name/nm0381416","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNjQ3MjI3N15BMl5BanBnXkFtZTYwODE4NDQ1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 May 1963","placeOfBirth":" Los Angeles, California, USA","birthName":"Grant A. Heslov","height":"5' 9\" (1.75 m)","bio":"Grant Heslov was born on May 15, 1963 in Los Angeles, California, USA as Grant A. Heslov. He is an actor and producer, known for Good Night, and Good Luck. (2005), True Lies (1994) and Argo (2012). He is married to Lysa Hayland Heslov. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNjQ3MjI3N15BMl5BanBnXkFtZTYwODE4NDQ1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0381416","name":"Grant Heslov","idIMDB":"nm0381416"},"actorId":"nm0381416","character":"Robbie Mieghem","urlCharacter":"http://www.imdb.com/character/ch0264570","main":true},{"actorName":"Timothy Carhart","urlProfile":"http://www.imdb.com/name/nm0137114","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NTEzMzc3MV5BMl5BanBnXkFtZTgwNDAzNzc3MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 December 1953","placeOfBirth":" Washington, District of Columbia, USA","height":"6' 4\" (1.93 m)","bio":"Blond, blue-eyed character actor who has worked on stage, film, and TV for the past 20 years. Born in Washington D.C., Carhart had a globetrotting childhood in Turkey and France before returning to the U.S. and studying theater. Carhart had some success off-Broadway and then moved on to small roles in such major films as Ghostbusters (1984), Witness (1985) and Working Girl (1988). He played the drunk who attempted to rape Geena Davis's character in Thelma & Louise (1991), and also had roles in the The Hunt for Red October (1990), Red Rock West (1993) and Air Force One (1997). Carhart has had many guest spots on television shows including a memorable guest turn as a police officer whose testimony against a murderer may reveal the sexuality he has tried to keep secret on The Practice (1997), and as a fat-sucking vampire on The X-Files (1993). Recently, he was seen as the dad in the Disney family movie Motocrossed (2001) and has landed a regular role on CBS's popular show CSI: Crime Scene Investigation (2000) as the ex-husband of star Marg Helgenberger.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NTEzMzc3MV5BMl5BanBnXkFtZTgwNDAzNzc3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0137114","name":"Timothy Carhart","idIMDB":"nm0137114"},"actorId":"nm0137114","character":"Roger Kovary","urlCharacter":"http://www.imdb.com/character/ch0264572","main":true},{"actorName":"Bruce McGill","urlProfile":"http://www.imdb.com/name/nm0569226","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NDk0MDY2Nl5BMl5BanBnXkFtZTYwMjA3MTU0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 July 1950","placeOfBirth":" San Antonio, Texas, USA","birthName":"Bruce Travis McGill","height":"5' 9¼\" (1.76 m)","bio":"Bruce McGill grew up in San Antonio, Texas where he began his acting career in in the MacArthur High School department of theatre. His most popular role was in Animal House (1978).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NDk0MDY2Nl5BMl5BanBnXkFtZTYwMjA3MTU0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0569226","name":"Bruce McGill","idIMDB":"nm0569226"},"actorId":"nm0569226","character":"Neuschwander","urlCharacter":"http://www.imdb.com/character/ch0264577","main":true},{"actorName":"Michael Patrick Carter","urlProfile":"http://www.imdb.com/name/nm0141824","urlPhoto":"","biography":{"dateOfBirth":"24 November 1981","placeOfBirth":" Huntington Beach, California, USA","bio":"Michael Patrick Carter was born on November 24, 1981 in Huntington Beach, California, USA. He is an actor, known for Guns of Paradise (1988), Black Sheep (1996) and Milk Money (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0141824","name":"Michael Patrick Carter","idIMDB":"nm0141824"},"actorId":"nm0141824","character":"Scott Colleary","urlCharacter":"http://www.imdb.com/character/ch0264598","main":true},{"actorName":"Boyd Banks","urlProfile":"http://www.imdb.com/name/nm0052103","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMDA2MjQ0Ml5BMl5BanBnXkFtZTYwNjgyODky._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 April 1964","placeOfBirth":" Moose Jaw, Saskatchewan, Canada","height":"6' 3\" (1.91 m)","bio":"Born in Moose Jaw, Saskatchewan, Boyd Banks started his entertainment career at 17, when he won a contest for Best Stand Up Comedian in Edmonton, Alberta. After spending several years doing comedy in Vancouver, British Columbia, Banks moved to Toronto, where he began acting. Boyd's first roles were in various comedy series such as the cult favourite The Kids in the Hall (1988). His unique character looks and subtle performances on camera caught the eye of Toronto's top casting directors and Banks now works regularly in film and television from comedies to murder mysteries!","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMDA2MjQ0Ml5BMl5BanBnXkFtZTYwNjgyODky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0052103","name":"Boyd Banks","idIMDB":"nm0052103"},"actorId":"nm0052103","character":"Clyde Spinoza","urlCharacter":"http://www.imdb.com/character/ch0019272","main":true},{"actorName":"David St. James","urlProfile":"http://www.imdb.com/name/nm0820574","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NDI4NzI0OV5BMl5BanBnXkFtZTcwMjI0NTc2NQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1947","placeOfBirth":" Honolulu, Hawaii, USA","birthName":"David Francis Jones","bio":"David St. James was born on September 4, 1947 in Honolulu, Hawaii, USA as David Francis Jones. He is known for his work on The West Wing (1999), iCarly (2007) and Shameless (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0NDI4NzI0OV5BMl5BanBnXkFtZTcwMjI0NTc2NQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0820574","name":"David St. James","idIMDB":"nm0820574"},"actorId":"nm0820574","character":"Motorcycle Cop","urlCharacter":"http://www.imdb.com/character/ch0264600","main":true},{"actorName":"Skip O'Brien","urlProfile":"http://www.imdb.com/name/nm0639820","urlPhoto":"","biography":{"dateOfBirth":"20 August 1950","placeOfBirth":" Jersey City, New Jersey, USA","birthName":"Bernard Francis O'Brien","bio":"Skip O'Brien was born on August 20, 1950 in Jersey City, New Jersey, USA as Bernard Francis O'Brien. He was an actor, known for Liar Liar (1997), The Hitcher (2007) and Blow (2001). He was married to Susanne Bordeaux. He died on April 6, 2011 in Hazlet, New Jersey.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0639820","name":"Skip O'Brien","idIMDB":"nm0639820"},"actorId":"nm0639820","character":"State Trooper","urlCharacter":"http://www.imdb.com/character/ch0264606","main":true},{"actorName":"Branden R. Morgan","urlProfile":"http://www.imdb.com/name/nm0604510","urlPhoto":"","biography":{"birthName":"Branden Morgan","height":"5' 10\" (1.78 m)","bio":"Branden R. Morgan was born as Branden Morgan. He is an actor and director, known for Black Sheep (1996), Timber Falls (2007) and Shrink (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0604510","name":"Branden R. Morgan","nicknames":["Beemer"],"idIMDB":"nm0604510"},"actorId":"nm0604510","character":"Fan","urlCharacter":"http://www.imdb.com/character/ch0264608","main":true},{"actorName":"'Gypsy' Spheeris","urlProfile":"http://www.imdb.com/name/nm0818442","urlPhoto":"","biography":{"bio":"'Gypsy' Spheeris is an actress, known for Black Sheep (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0818442","name":"'Gypsy' Spheeris","idIMDB":"nm0818442"},"actorId":"nm0818442","character":"Pocket Pool Lady","urlCharacter":"http://www.imdb.com/character/ch0264649","main":true},{"actorName":"John Ashker","urlProfile":"http://www.imdb.com/name/nm0007167","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjY1NDEwOV5BMl5BanBnXkFtZTYwMTYzMzE4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1964","placeOfBirth":" New Orleans, Louisiana, USA","bio":"John Ashker was born on December 28, 1964 in New Orleans, Louisiana, USA. He is known for his work on The Incredible Hulk (2008), Django Unchained (2012) and Minority Report (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNjY1NDEwOV5BMl5BanBnXkFtZTYwMTYzMzE4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0007167","name":"John Ashker","idIMDB":"nm0007167"},"actorId":"nm0007167","character":"Jim Blaine","urlCharacter":"http://www.imdb.com/character/ch0264658","main":true}],"seasons":[],"idIMDB":"tt0115697","urlIMDB":"http://www.imdb.com/title/tt0115697","business":{"budget":null,"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1995/\">1995</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 27 min (87 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":["7,799 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.2","filmingLocations":[{"location":"S. Myrtle Ave. & W. Lime Ave., Monrovia, California, USA"}],"rated":"PG-13","awards":[],"votes":"30,892","type":"Movie","companyCreditsSimple":[{"idCompany":"co0113592","name":"Broadway Pictures"},{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["slapstick comedy","fire","goofball","nitrous oxide","election","f rated","political candidate","satire","political campaign","campaign","election campaign","campaigning","political comedy","title directed by female","crude humor","physical comedy","politics","joke","political satire","double act","comedy team","cell phone","wetting pants","marijuana","crooked politician","drugs","brother brother relationship","candid camera","car trouble","alcoholism","football","police car"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 04:52:24"}}