{"data":{"movies":[{"title":"From Dusk Till Dawn","originalTitle":"","year":"1996","releaseDate":"19960119","directors":[{"name":"Robert Rodriguez","id":"nm0001675"}],"writers":[{"name":"Robert Kurtzman","id":"nm0476071"},{"name":"Quentin Tarantino","id":"nm0000233"}],"runtime":"108 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjk3YmZhMDAtOWUzMS00YjE5LTkxNzAtY2I1NGZjMDA2ZTk0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English","Spanish"],"genres":["Action","Crime","Horror"],"plot":"After a bank heist in Abilene with several casualties, the bank robber Seth Gecko and his psychopath and rapist brother Richard Gecko continue their crime spree in a convenience store in the middle of the desert while heading to Mexico with a hostage. They decide to stop for a while in a low-budget motel. Meanwhile the former minister Jacob Fuller is traveling on vacation with his son Scott and his daughter Kate in a RV. Jacob lost his faith after the death of his beloved wife in a car accident and quit his position of pastor of his community and stops for the night in the same motel Seth and Richard are lodged. When Seth sees the recreational vehicle, he abducts Jacob and his family to help his brother and him to cross the Mexico border, promising to release them on the next morning. They head to the truck drivers and bikers bar Titty Twister where Seth will meet with his partner Carlos in the dawn. When they are watching the dancer Santanico Pandemonium, Seth and Richard fight with ...","simplePlot":"Two criminals and their hostages unknowingly seek temporary refuge in an establishment populated by vampires, with chaotic results.","actors":[{"actorName":"George Clooney","urlProfile":"http://www.imdb.com/name/nm0000123","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMTEyOTQ0MV5BMl5BanBnXkFtZTcwNzU3NTMzNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 May 1961","placeOfBirth":" Lexington, Kentucky, USA","birthName":"George Timothy Clooney","height":"5' 11\" (1.8 m)","bio":"George Timothy Clooney was born on May 6, 1961, in Lexington, Kentucky, to Nina Bruce (née Warren), a former beauty pageant queen, and Nick Clooney, a former anchorman and game show host (who was also the brother of singer Rosemary Clooney). He has Irish, English, and German ancestry. Clooney spent most of this youth in Ohio and Kentucky, and graduated from Augusta High School. He was very active in sports such as basketball and baseball, and tried out for the Cincinnati Reds, but was not offered a contract. After his cousin, Miguel Ferrer, got him a small part in a feature film, Clooney began to pursue acting. His first major role was on the sitcom E/R (1984) as \"Dr. Doug Ross\". More roles soon followed, including \"George Burnett\", the handsome handyman on The Facts of Life (1979); \"Booker Brooks\", a supervisor on Roseanne (1988); and \"Detective James Falconer\" on Sisters (1991). Clooney had his breakthrough when he was cast as \"Dr. Doug Ross\" on the award-winning drama series, ER (1994), opposite Anthony Edwards, Noah Wyle, and Julianna Margulies. While filming \"ER\", Clooney starred in a number of high profile film roles, such as Robert Rodriguez's From Dusk Till Dawn (1996), and One Fine Day (1996), opposite Michelle Pfeiffer. In 1997, Clooney took on the role of \"Batman\" in Joel Schumacher's Batman & Robin (1997). The film was a moderate success in the box office, but was slammed by critics, notably for the nipple-laden Bat suit. Clooney went on to star in Steven Soderbergh's Out of Sight (1998), Terrence Malick's The Thin Red Line (1998), and David O. Russell's Three Kings (1999). In 1999, Clooney left \"ER\" (though he would return for the season finale) and appeared in a number of films, including O Brother, Where Art Thou? (2000), The Perfect Storm (2000), and Ocean's Eleven (2001). Collaborating once again with Steven Soderbergh, \"Ocean's Eleven\" received critical acclaim, earned more than $450 million at the box office, and spawned two sequels: Ocean's Twelve (2004) and Ocean's Thirteen (2007). In 2002, Clooney made his directorial debut with Confessions of a Dangerous Mind (2002), an adaptation of TV producer Chuck Barris's autobiography. This was the first film under the banner of \"Section Eight Productions\", a production company he founded with Steven Soderbergh. The company also produced many acclaimed films, including Far from Heaven (2002), Syriana (2005), A Scanner Darkly (2006), and Good Night, and Good Luck. (2005). Clooney won his first Oscar for Best Supporting Actor in \"Syriana\", and was nominated for Best Director and Best Original Screenplay for \"Good Night, and Good Luck\". In 2006, \"Section Eight\" was shut down so that Soderbergh could concentrate on directing, and Clooney founded a new production company, \"Smokehouse Productions\", with his friend and long-time business partner, Grant Heslov. Clooney went on to produce and star in Michael Clayton (2007) (which earned him an Oscar nomination for Best Actor), directed and starred in Leatherheads (2008), and took leading roles in Burn After Reading (2008), The Men Who Stare at Goats (2009), Fantastic Mr. Fox (2009), and Jason Reitman's Up in the Air (2009). Clooney received critical acclaim for his performance in \"Up in the Air\" and was nominated for several awards, including a Golden Globe and Academy Award. He didn't win that year, but took home both Best Actor awards (as well as countless nominations) for his role as a father who finds out his wife was unfaithful as she lay in a coma in Alexander Payne's The Descendants (2011). Throughout his career, Clooney has been heralded for his political activism and humanitarian work. He has served as one of the \"United Nations Messengers of Peace\" since 2008, has been an advocate for the Darfur conflict, and organized the \"Hope for Haiti\" telethon, to raise money for the victims of the 2010 earthquake. In March of 2012, Clooney was arrested for civil disobedience while protesting at the Sudanese embassy in Washington, D.C. Clooney was married to actress Talia Balsam, from 1989 until 1993. After their divorce, he swore he would never marry again. Michelle Pfeiffer and Nicole Kidman bet him $10,000 that he would have children by the age of 40, and sent him a check shortly after his birthday. Clooney returned the funds and bet double or nothing he wouldn't have children by the age of 50. Although he has remained a consummate bachelor, Clooney has had many highly publicized relationships, including with former WWE wrestler Stacy Keibler. In 2014, he married lawyer and activist Amal Clooney.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMTEyOTQ0MV5BMl5BanBnXkFtZTcwNzU3NTMzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000123","name":"George Clooney","nicknames":["Gorgeous George"],"idIMDB":"nm0000123"},"actorId":"nm0000123","character":"Seth Gecko","urlCharacter":"http://www.imdb.com/character/ch0005442","main":true},{"actorName":"Quentin Tarantino","urlProfile":"http://www.imdb.com/name/nm0000233","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMjI3ODA3Nl5BMl5BanBnXkFtZTcwNzY2MDYxOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 March 1963","placeOfBirth":" Knoxville, Tennessee, USA","birthName":"Quentin Jerome Tarantino","height":"6' 1\" (1.85 m)","bio":"Quentin Jerome Tarantino was born in Knoxville, Tennessee. His father, Tony Tarantino, is an Italian-American actor and musician from New York, and his mother, Connie (McHugh), is a nurse from Tennessee. Quentin moved with his mother to Torrance, California, when he was four years old. In January of 1992, first-time writer-director Tarantino's Reservoir Dogs (1992) appeared at the Sundance Film Festival. The film garnered critical acclaim and the director became a legend immediately. Two years later, he followed up Dogs success with Pulp Fiction (1994) which premiered at the Cannes film festival, winning the coveted Palme D'Or Award. At the 1995 Academy Awards, it was nominated for the best picture, best director and best original screenplay. Tarantino and writing partner Roger Avary came away with the award only for best original screenplay. In 1995, Tarantino directed one fourth of the anthology Four Rooms (1995) with friends and fellow auteurs Alexandre Rockwell, Robert Rodriguez and Allison Anders. The film opened December 25 in the United States to very weak reviews. Tarantino's next film was From Dusk Till Dawn (1996), a vampire/crime story which he wrote and co-starred with George Clooney. The film did fairly well theatrically. Since then, Tarantino has helmed several critically and financially successful films, including Jackie Brown (1997), Kill Bill: Vol. 1 (2003), Kill Bill: Vol. 2 (2004), Inglourious Basterds (2009), Django Unchained (2012) and The Hateful Eight (2015).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgyMjI3ODA3Nl5BMl5BanBnXkFtZTcwNzY2MDYxOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000233","name":"Quentin Tarantino","nicknames":["QT","Q"],"idIMDB":"nm0000233"},"actorId":"nm0000233","character":"Richard Gecko","urlCharacter":"http://www.imdb.com/character/ch0032675","main":true},{"actorName":"Harvey Keitel","urlProfile":"http://www.imdb.com/name/nm0000172","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMDcxMjgxOV5BMl5BanBnXkFtZTcwODc2NTk2MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 May 1939","placeOfBirth":" Brooklyn, New York, USA","height":"5' 7½\" (1.71 m)","bio":"American actor and producer Harvey Keitel was born on May 13, 1939 in Brooklyn, New York City. An Oscar and Golden Globe Award nominee, he has appeared in films such as Martin Scorsese's Mean Streets (1973) and Taxi Driver (1976), Ridley Scott's The Duellists (1977) and Thelma & Louise (1991), Peter Yates' Mother, Jugs & Speed (1976), Quentin Tarantino's Reservoir Dogs (1992) and Pulp Fiction (1994), Jane Campion's La leçon de piano (1993), Abel Ferrara's Bad Lieutenant (1992), Robert Rodriguez's From Dusk Till Dawn (1996), James Mangold's Cop Land (1997), Paolo Sorrentino's Youth (2015). He is regarded as one of the greatest method actors ever. Along with actors Al Pacino and Ellen Burstyn, he is the current co-president of the Actors Studio. Keitel studied under both Stella Adler and Lee Strasberg and at the HB Studio, eventually landing roles in some Off-Broadway productions. During this time, Keitel auditioned for filmmaker Martin Scorsese and gained a starring role as \"J.R.\", in Scorsese's first feature film, Who's That Knocking at My Door (1967). Since then, Scorsese and Keitel have worked together on several projects. Keitel had the starring role in Scorsese's Mean Streets (1973), which also proved to be Robert De Niro's breakthrough film. Keitel re-teamed with Scorsese for Alice Doesn't Live Here Anymore (1974), in which he had a villainous supporting role, and appeared with Robert De Niro again in Scorsese's Taxi Driver (1976), playing the role of Jodie Foster's pimp.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMDcxMjgxOV5BMl5BanBnXkFtZTcwODc2NTk2MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000172","name":"Harvey Keitel","idIMDB":"nm0000172"},"actorId":"nm0000172","character":"Jacob Fuller","urlCharacter":"http://www.imdb.com/character/ch0005447","main":true},{"actorName":"Juliette Lewis","urlProfile":"http://www.imdb.com/name/nm0000496","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4Nzk1MDgyNV5BMl5BanBnXkFtZTYwNzQ3MDgy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 June 1973","placeOfBirth":" Los Angeles, California, USA","height":"5' 6\" (1.68 m)","bio":"Juliette Lewis has been recognized as one of Hollywood's most talented and versatile actors of her generation since she first stunned audiences and critics alike with her Oscar-nominated performance as \"Danielle Bowden\" in Cape Fear (1991). To date, she has worked with some of the most revered directors in the industry, including Martin Scorsese, Woody Allen, Lasse Hallström, Oliver Stone and Garry Marshall. Whether lending dramatic authenticity or a natural comedic flair to her roles, Lewis graces the screen with remarkable range and an original and captivating style. Lewis was born in Los Angeles, Californa, to Glenis (Duggan) Batley, a graphic designer, and Geoffrey Lewis, an actor. By the age of six, she knew she wanted to be a performer. At twelve, Lewis landed her first leading role in the Showtime miniseries Home Fires (1987). After appearing in several TV sitcoms including The Wonder Years (1988), she made her move to film, starring with Chevy Chase in National Lampoon's National Lampoon's Christmas Vacation (1989) and with Jennifer Jason Leigh in the drama Crooked Hearts (1991). At 16, Lewis starred opposite Brad Pitt in the critically acclaimed television movie Too Young to Die? (1990), catching the attention of Martin Scorsese, who cast her in his thriller Cape Fear (1991). Her powerful scenes with Robert De Niro captured the quiet complexities of adolescence and earned her an Oscar nomination and Golden Globe nomination for \"Best Supporting Actress\". Her auditorium scene with De Niro went down in movie history as one of cinema's classic scenes. Lewis next worked with Woody Allen in Husbands and Wives (1992), playing a self-assured college coed with a penchant for older men and, particularly, her married professor. She quickly followed suit with a succession of starring roles in a variety of blockbusters and critically acclaimed projects including Kalifornia (1993), Romeo Is Bleeding (1993), What's Eating Gilbert Grape (1993) and Natural Born Killers (1994), Oliver Stone's controversial media satire about two mass murderers who become legendary folk heroes. Lewis's other credits include the Nora Ephron comedy Mixed Nuts (1994), with Steve Martin and Adam Sandler; the sci-fi action film Strange Days (1995) with Ralph Fiennes and Angela Bassett; Quentin Tarantino's vampire tale From Dusk Till Dawn (1996) with George Clooney; The Evening Star (1996) with Shirley MacLaine; the Garry Marshall-directed The Other Sister (1999), and Todd Phillips' Old School (2003), co-starring opposite Luke Wilson, Vince Vaughn, and Will Ferrell as well as Starsky & Hutch (2004). In addition to her film career, Lewis has continued to add roles to her growing list of television credits with a performance in Showtime's My Louisiana Sky (2001), for which she secured an EMMY nomination, and a starring role in the Mira Nair-directed HBO's film Hysterical Blindness (2002), alongside Uma Thurman and Gena Rowlands. After a six-year hiatus from film to pursue her burgeoning music career exclusively, Lewis announced her return to acting with a handful of upcoming movies. Juliette starred alongside Ellen Page, Marcia Gay Harden, Kristen Wiig and Jimmy Fallon in the comedy Whip It (2009). The film was released by Fox Searchlight on October 2nd, 2009. Directed by Drew Barrymore, the film tells the story of an ex-beauty pageant contestant that leaves her crowns behind after joining a roller derby team. Lewis plays \"Iron Maven\", the star of a top derby team. Next, she joined the cast of the acclaimed European animated thriller Metropia (2009), as the voice of \"Nina\". She also appeared in the romantic comedy The Switch (2010), opposite Jennifer Aniston, Jason Bateman and Patrick Wilson. The film tells the story of a single mother (Aniston) who decides to have a child using a sperm donor. Juliette plays \"Debbie Epstein\", the best friend of Aniston's character. Lewis also appears in Sympathy for Delicious (2010), Mark Ruffalo's directorial debut. The film follows a paralyzed DJ, struggling to survive on the streets of LA who turns to faith healing and mysteriously develops the ability to cure the sick. Juliette plays \"Ariel\", costarring alongside Orlando Bloom, Mark Ruffalo and Laura Linney. The film took home the US Dramatic Special Jury Prize at the 2010 Sundance Film Festival. Most recently, Juliette Lewis appears in the indie-drama Conviction (2010), which stars Hilary Swank, Melissa Leo, Minnie Driver and Sam Rockwell. She plays \"Roseanna Perry\" in the true story of an unemployed single mother (Swank) who saw her brother begin serving a life sentence in 1983 for murder and robbery. The role has won Lewis praise from audiences and critics, alike, for her performance, with USA Today saying, \"Juliette Lewis has an indelible role\" and the San Francisco Chronicle saying \"Her character work should be studied in schools. Just remarkable\". In addition to Conviction (2010), Lewis also makes a cameo in Todd Phillips' comedy, Due Date (2010), starring Robert Downey Jr., Michelle Monaghan and Zach Galifianakis. Beginning in 2004, Juliette took a hiatus from acting to embark on a musical journey. After six years, two full length albums and countless high profile tours and festival gigs with her band, 'Juliette & the Licks', Juliette set out on a solo career. Releasing \"Terra Incognita\" last fall, the album has taken her all across the world from Europe to Japan to Turkey, Australia, North America and Canada. For more information on Juliette Lewis' music, please visit her MySpace page. Juliette Lewis resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4Nzk1MDgyNV5BMl5BanBnXkFtZTYwNzQ3MDgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000496","name":"Juliette Lewis","idIMDB":"nm0000496"},"actorId":"nm0000496","character":"Kate Fuller","urlCharacter":"http://www.imdb.com/character/ch0005445","main":true},{"actorName":"Ernest Liu","urlProfile":"http://www.imdb.com/name/nm0514918","urlPhoto":"","biography":{"bio":"Ernest Liu is known for his work on From Dusk Till Dawn (1996), The Westing Game (1997) and Chimères (2013).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0514918","name":"Ernest Liu","idIMDB":"nm0514918"},"actorId":"nm0514918","character":"Scott Fuller","urlCharacter":"http://www.imdb.com/character/ch0052657","main":true},{"actorName":"Salma Hayek","urlProfile":"http://www.imdb.com/name/nm0000161","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkyMTk2NzM2Ml5BMl5BanBnXkFtZTcwNDQ4MjYzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 September 1966","placeOfBirth":" Coatzacoalcos, Veracruz, Mexico","birthName":"Salma Valgarma Hayek-Jimenez","height":"5' 2\" (1.57 m)","bio":"One of Hollywood's most dazzling leading actresses, Salma Hayek was born on September 2, 1966, in the oil boomtown of Coatzacoalcos, Mexico. Hayek has freely admitted that she and her brother, Sami, were spoiled rotten by her well-to-do businessman father, Sami Hayek Dominguez, and her opera-singing mother, Diana Jiménez Medina. Her father is of Lebanese descent and her mother is of Mexican/Spanish ancestry. After having seen Willy Wonka & the Chocolate Factory (1971) in a local movie theatre, Salma decided she wanted to become an actress. At 12, she was sent to the Academy of the Sacred Heart in New Orleans, Louisiana, where she pulled pranks on the nuns by setting their clocks back three hours. She was soon expelled. Only after attending Mexico City's Universidad Iberoamericana did she feel ready to pursue acting seriously. She soon landed the title role in Teresa (1989), a hugely successful soap opera which earned her the star status in her native Mexico. However, anxious to make films and to explore her talent and passion, Hayek left both Teresa (1989) and Mexico in 1991. Heartbroken fans spread rumors that she was having a secret affair with Mexico's president and left to escape his wife's wrath. At long last, Salma made her way to Los Angeles. The 24 year old actress approached Hollywood with naïve enthusiasm, and quickly learned that Latin actresses were, if at all, typecast as the mistress maid or local prostitute. By late 1992, Hayek had landed only bit parts. She appeared on Street Justice (1991), The Sinbad Show (1993), Nurses (1991), and as a sexy maid on the HBO series Dream On (1990). She also had one line in the Allison Anders film Mi vida loca (1993). Feeling under-appreciated by Anglo filmmakers, Hayek vented her frustrations on comedian Paul Rodriguez's late-night Spanish-language talk show in 1992. Robert Rodriguez and his producer wife Elizabeth Avellan happened to be watching and were immediately smitten with the intelligent, opinionated young woman. He soon gave her her big break--to star opposite Antonio Banderas in the now cult classic Desperado (1995), which put her on Hollywood's map. The moviegoers proved to be as dazzled with Hayek as he had been. After her break, she was cast again by Rodriguez to star in his From Dusk Till Dawn (1996). Although her vampy role opposite George Clooney and Quentin Tarantino was a small one, it was a good credit to her box office name. Hayek's first star billing came later that year with Fools Rush In (1997) opposite Friends (1994) actor Matthew Perry. The film was a modest hit, and Hayek continued to rise her star in both commercial and artistic films such as: Breaking Up (1997) with an unknown Russell Crowe; 54 (1998) about the rise and fall of the legendary New York club; Dogma (1999), playing the muse in a somewhat odd comedy co-starring Matt Damon and Chris Rock; In the Time of the Butterflies (2001), the small artistic film which won Hayek an ALMA award as best actress; and the 1999 summer blockbuster Wild Wild West (1999). Her production company \"Ventanarosa\" produced the 1999 Mexican feature film Pas de lettre pour le colonel (1999), which was shown at the Cannes Film Festival and selected as Mexico's official Oscar entry for best foreign film. The new millennium started out quietly around Salma as she was preparing to produce and star in her dream role, that of Frida Kahlo, the legendary Mexican painter whom Salma had been admiring her entire life and whose story she wanted to bring to the big screen ever since her arrival in Hollywood. It finally happened in 2002. Frida (2002), co-produced by Hayek, was a beautifully made film overflowing with passion and enthusiasm, with terrific performances from Salma and Alfred Molina as Kahlo's cheating husband \"Diego Rivera\". On the side was an entourage of stars including Antonio Banderas, Ashley Judd, Geoffrey Rush, Edward Norton and Valeria Golino. The picture was a hit and was nominated for six Oscars, including best actress for Hayek, who became the first Latin actress to be nominated in the category, and won the awards for make-up and its brilliant original score by Elliot Goldenthal. Hayek established herself as the serious actress that she is and, in the same year, expanded her horizons, directing The Maldonado Miracle (2003), which was shown at the Sundance Film festival. In 2003, she starred in the final of Rodriguez's \"Desperado\" trilogy Once Upon a Time in Mexico (2003), again opposite Banderas, and has just finished After the Sunset (2004) opposite Pierce Brosnan and Ask the Dust (2006) opposite Colin Farrell. Both are scheduled for release in early 2005. In the works are Robert Altman's \"Paint\" and Bandidas (2006) in which she will star with her friend Penélope Cruz.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzkyMTk2NzM2Ml5BMl5BanBnXkFtZTcwNDQ4MjYzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000161","name":"Salma Hayek","idIMDB":"nm0000161"},"actorId":"nm0000161","character":"Santanico Pandemonium","urlCharacter":"http://www.imdb.com/character/ch0005443","main":true},{"actorName":"Cheech Marin","urlProfile":"http://www.imdb.com/name/nm0001507","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyODU1ODEzOF5BMl5BanBnXkFtZTYwMzkwODY1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 July 1946","placeOfBirth":" Los Angeles, California, USA","birthName":"Richard Anthony Marin","height":"5' 6\" (1.68 m)","bio":"Cheech Marin was born on July 13, 1946 in Los Angeles, California, USA as Richard Anthony Marin. He is an actor, known for The Lion King (1994), Nash Bridges (1996) and Cars (2006). He has been married to Natasha Rubin since August 8, 2009. He was previously married to Patti Heid and Rikki Marin.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyODU1ODEzOF5BMl5BanBnXkFtZTYwMzkwODY1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001507","name":"Cheech Marin","idIMDB":"nm0001507"},"actorId":"nm0001507","character":"Border Guard / Chet Pussy / Carlos","urlCharacter":"http://www.imdb.com/character/ch0187420","main":true},{"actorName":"Danny Trejo","urlProfile":"http://www.imdb.com/name/nm0001803","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcxNTQ1ODQxMl5BMl5BanBnXkFtZTYwMzI4MDA2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 May 1944","placeOfBirth":" Echo Park, Los Angeles, California, USA","birthName":"Dan Trejo","height":"5' 5¾\" (1.67 m)","bio":"Danny Trejo was born Dan Trejo in Echo Park, Los Angeles, to Alice (Rivera) and Dan Trejo, a construction worker. A child drug addict and criminal, Trejo was in and out of jail for 11 years. While serving time in San Quentin, he won the lightweight and welterweight boxing titles. Imprisoned for armed robbery and drug offenses, he successfully completed a 12-step rehabilitation program that changed his life. While speaking at a Cocaine Anonymous meeting in 1985, Trejo met a young man who later called him for support. Trejo went to meet him at what turned out to be the set of Runaway Train (1985). Trejo was immediately offered a role as a convict extra, probably because of his tough tattooed appearance. Also on the set was a screenwriter who did time with Trejo in San Quentin. Remembering Trejo's boxing skills, the screenwriter offered him $320 per day to train the actors for a boxing match. Director Andrey Konchalovskiy saw Trejo training Eric Roberts and immediately offered him a featured role as Roberts' opponent in the film. Trejo has subsequently appeared in many other films, usually as a tough criminal or villain. Trejo is of Mexican descent.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzcxNTQ1ODQxMl5BMl5BanBnXkFtZTYwMzI4MDA2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001803","name":"Danny Trejo","nicknames":["The Mayor"],"idIMDB":"nm0001803"},"actorId":"nm0001803","character":"Razor Charlie","urlCharacter":"http://www.imdb.com/character/ch0005446","main":true},{"actorName":"Tom Savini","urlProfile":"http://www.imdb.com/name/nm0767741","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxOTYzOTcxNV5BMl5BanBnXkFtZTcwNDA1MDcwNw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1946","placeOfBirth":" Pittsburgh, Pennsylvania, USA","height":"5' 7\" (1.7 m)","bio":"Inspired by the film Man of a Thousand Faces (1957), a young Tom Savini became fascinated with the magic and illusion of film. He spent his youth in his room creating characters by tirelessly practicing make-up. Later, as a combat photographer in Vietnam, Savini saw first-hand the gruesome carnage for which he later gained fame, simulating it on screen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMxOTYzOTcxNV5BMl5BanBnXkFtZTcwNDA1MDcwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0767741","name":"Tom Savini","nicknames":["The Godfather of Gore"],"idIMDB":"nm0767741"},"actorId":"nm0767741","character":"Sex Machine","urlCharacter":"http://www.imdb.com/character/ch0005453","main":true},{"actorName":"Fred Williamson","urlProfile":"http://www.imdb.com/name/nm0004365","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MzIzNjk4N15BMl5BanBnXkFtZTYwMjk4NDYz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 March 1938","placeOfBirth":" Gary, Indiana, USA","height":"6' 3\" (1.91 m)","bio":"Former Oakland Raiders/Kansas City Chiefs football star who rose to prominence as one of the first African-American male action stars of the \"blaxploitation\" genre of the early 1970s, who has since gone on to a long and illustrious career as an actor, director, writer, and producer! Burly, yet handsome 6' 3\" Williamson first came to attention in the TV series Julia (1968) playing love interest, Steve Bruce. However, his rugged, athletic physique made him a natural for energetic roles and he quickly established himself as a street wise, tough guy in films including That Man Bolt (1973), Black Caesar (1973), and Mean Johnny Barrows (1976). Talented Williamson established his own production company \"Po 'Boy Productions\" in 1974, which has produced over 40 movies to date. Like many young American stars of the 1960s and '70s, Williamson was noticed by Italian producers who cast him in a slew of B-grade action movies that occupied a lot of his work in the 1980s. From the late '80s onwards, much of his work has been of the \"straight to video\" fare (often playing police officers), but none could deny he has kept actively busy in movies and TV for over three decades, both in front of and behind the camera. More recently, indie director Robert Rodriguez cast him alongside FX guru Tom Savini as two vampire killing bikers, in his bloody action film From Dusk Till Dawn (1996), and he has most recently appeared on screen (displaying his wonderful comedy skills) playing grumpy Captain Dobey in Starsky & Hutch (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU1MzIzNjk4N15BMl5BanBnXkFtZTYwMjk4NDYz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004365","name":"Fred Williamson","nicknames":["Hammer"],"idIMDB":"nm0004365"},"actorId":"nm0004365","character":"Frost","urlCharacter":"http://www.imdb.com/character/ch0005455","main":true},{"actorName":"Michael Parks","urlProfile":"http://www.imdb.com/name/nm0662981","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjAwNTQ1NTI4NV5BMl5BanBnXkFtZTgwMzE4NjE2MjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1940","placeOfBirth":" Corona, California, USA","birthName":"Harry Samuel Parks","height":"6' (1.83 m)","bio":"Michael Parks is known as an actor's actor by his peers with a breadth of astonishing range that has allowed him to portray stunning contrasts - sometimes in the same film, like in 2014's \"TUSK\", starring in dual roles as an erudite serial killer opposite Justin Long, and as a feeble rube opposite Johnny Depp. In, \"KILL BILL: Vol.I and II\". Parks portrayed spot-on contrasting roles as Texas Ranger Earl McGraw and the heavily accented Esteban Vihaio opposite Uma Thurman. Writer/Directors, including Kevin Smith and Quentin Tarantino, wrote roles specifically for Parks claiming all they need to do is \"turn on the camera\" to elicit a masterful performance. Parks has played in more than 100 films and TV shows over a 50-year career .He starts as a contract player in 1961, with the portray of the nephew of the character George Mac Michael on the ABC sitcom \"The Real McCoys\". He played Adam in John Huston's \"The Bible: In the Beginning\" (1966). His other early roles includes appearances in two NBC series: the legal drama \"Sam Benedict\", as Larry Wilcox in the 1962 episode \"Too Many Strangers\" and the medical drama \"The Eleventh Hour\" as Mark Reynolds in the 1963 segment \"Pressure Breakdown\". He also starred in \"The China Lake Murders\" and \"Stranger by Night\", having portrayed a police officer in both. From 1969 to 1970 he starred in the series \"Then Came Bronson\" of which he was the only running star. He sang the theme song for the show, \"Long Lonesome Highway\", which became a #20 Billboard Hot 100 and #41 Hot Country Songs hit. Albums he recorded under MGM Records (the label of the studio which produced the series) include \"Closing The Gap\" (1969),\" Long Lonesome Highway\" (1970) and \"Blue\". He also had various records of songs included on these albums. He played Philip Colby during the second season (1986-1987) of ABC's \"Dynasty\" spin-off series \"The Colbys\". He played the antagonist Irish mob boss Tommy O'Shea in \"Death Wish V: The Face of Death\" (1994), French-Canadian drug runner Jean Renault in the ABC television series \"Twin Peaks\", Dr. Banyard in \"Deceiver\" (1997), Texas Ranger Earl McGraw in \"From Dusk till Dawn\" (1996), and Ambrose Bierce in \"From Dusk Till Dawn 3, The Hangman's Daughter\" (2000) .After playing Earl McGraw in the \"KILL BILL\" film series he reprised the role in both segments of the film \"Grindhouse\". In \"Red State\"(2011) as villain Abin Cooper, quoting the Bible and issuing homicidal directives in the same gently insinuating voice, Parks plays a disturbingly soft-spoken psycho making the talk all the more convincing and scary with his brilliant delivery affecting a folksy down home accent and knowing just how to modulate his remarks for maximum effect most reviewers agreed with \"Hollywood reporter\" Todd McCarthy that he is mesmerizing as he spews Cooper's hate in a way that brooks no argument . In \"TUSK\" (2014) as Howard Howe, a real-life ancient mariner (a role Kevin Smith's tailor-made for Parks) \"Parks has such light in his eyes, fire in his belly and a mellifluous purr in his voice\" that \"Variety wrote \" it would probably be a pleasure to watch him recite the Manitoba phone book\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjAwNTQ1NTI4NV5BMl5BanBnXkFtZTgwMzE4NjE2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0662981","name":"Michael Parks","idIMDB":"nm0662981"},"actorId":"nm0662981","character":"Texas Ranger Earl McGraw","urlCharacter":"http://www.imdb.com/character/ch0001809","main":true},{"actorName":"Brenda Hillhouse","urlProfile":"http://www.imdb.com/name/nm0384936","urlPhoto":"","biography":{"dateOfBirth":"11 December 1953","placeOfBirth":" USA","bio":"Brenda Hillhouse was born on December 11, 1953 in the USA. She is known for her work on Pulp Fiction (1994), From Dusk Till Dawn (1996) and Cannery Row (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0384936","name":"Brenda Hillhouse","idIMDB":"nm0384936"},"actorId":"nm0384936","character":"Hostage Gloria Hill","urlCharacter":"http://www.imdb.com/character/ch0187418","main":true},{"actorName":"John Saxon","urlProfile":"http://www.imdb.com/name/nm0768334","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjE1NTk3Ml5BMl5BanBnXkFtZTcwOTAzMjg0NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 August 1935","placeOfBirth":" Brooklyn, New York, USA","birthName":"Carmine Orrico","height":"5' 10½\" (1.79 m)","bio":"John Saxon has appeared in nearly 200 roles in the movies and on television in a more-than half-century-long career that has stretched over seven decades since he made his big screen debut in 1954 in uncredited small roles in It Should Happen to You (1954) and George Cukor's A Star Is Born (1954). Born Carmine Orrico on August 5, 1936 in Brooklyn, New York, the son of Italian immigrants Antonio Orrico and Anna (née Protettore), he studied acting with Stella Adler after graduating from New Utrecht High School. He was discovered by talent agent Henry Willson, the man most famous for creating and representing Rock Hudson (as well as a stable of \"beefcake\" male stars and starlets), who signed him up after he saw Saxon's picture on the cover of a magazine. Willson brought the 16-year-old to Southern California, changed his name to John Saxon, and launched his career. Saxon made his television debut on Richard Boone's series Medic (1954) in 1955 and got his first substantial (and credited) role in Running Wild (1955), playing a juvenile delinquent. In the Esther Williams vehicle The Unguarded Moment (1956) (one of her rare dramatic roles), the film's marketing campaign spotlighted him, trumpeting the movie as \"Co-starring the exciting new personality John Saxon.\". By 1958, he seemed to have established himself as a supporting player in A-List pictures, being featured in Blake Edwards's comedy This Happy Feeling (1958) headlined by Debbie Reynolds and Vincente Minnelli's The Reluctant Debutante (1958) with Rex Harrison and Sandra Dee. In the next five years, he worked steadily, including supporting roles in John Huston's The Unforgiven (1960), the James Stewart comedy Mr. Hobbs Takes a Vacation (1962) and Otto Preminger's The Cardinal (1963) while having first billing in the B-movies Cry Tough (1959) and War Hunt (1962). Fluent in Italian, he made his first pictures in Italy in the period, Agostino (1962) and Mario Bava's Evil Eye (1963). Despite his good work with major directors, he failed to succeed as a star. By 1965, he was appearing in the likes of Blood Beast from Outer Space (1965), albeit, top-billed. A more emblematic picture was Sidney J. Furie's The Appaloosa (1966), in which he appeared in Mexican bandito drag as the man who steals the horse of Marlon Brando, another Stella Adler student. The \"ethnic-looking\" Saxon would reprise the role, of sorts, in John Sturges Joe Kidd (1972) in support of superstar Clint Eastwood. In those less politically correct times, many an Italian-American with a dark complexion would be relied on to play Mexicans, Native Americans and other \"exotic\" types like Mongols. Saxon played everything from an Indian chief on Bonanza (1959) to Marco Polo on The Time Tunnel (1966). From 1969 to 1972 season, he was a star of the television series The Bold Ones: The New Doctors (1969), playing the brilliant surgeon Theodore Stuart. When the series ended, he took one of his most famous roles when Bruce Lee demurred over casting Rod Taylor as he was too tall. A black belt in karate, Saxon appeared as Roper in Opération dragon (1973). He has continued to play a wide variety of roles on television and in motion pictures ever since.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NjE1NTk3Ml5BMl5BanBnXkFtZTcwOTAzMjg0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0768334","name":"John Saxon","idIMDB":"nm0768334"},"actorId":"nm0768334","character":"FBI Agent Stanley Chase","urlCharacter":"http://www.imdb.com/character/ch0051284","main":true},{"actorName":"Marc Lawrence","urlProfile":"http://www.imdb.com/name/nm0492908","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNzM5ODQ4MF5BMl5BanBnXkFtZTcwMjE4ODExOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1910","placeOfBirth":" New York City, New York, USA","birthName":"Max Goldsmith","height":"5' 10\" (1.78 m)","bio":"American character actor who specialized in underworld types, despite a far greater range. A native of the Bronx, Lawrence participated in plays in school, then attended the City College of New York. In 1930, he was accepted into Eva Le Gallienne's company, where he became friendly with another young actor, one day to be known as John Garfield. The two appeared in a number of plays, both with Le Galliene's company and with the highly-politicized Group Theatre, before Lawrence was given a film contract with Columbia Pictures. His scarred complexion and brooding appearance made him a natural for heavies, and he played scores of gangsters and mob bosses over the next six decades. Nevertheless, he could turn in fine performances in very different kinds of roles as well, such as his bewildered mountain boy in The Shepherd of the Hills (1941). Following the Second World War, as anti-Communist fervor gripped America, Lawrence found himself under scrutiny for his political leanings. When called before the House Un-American Activities Committee, he admitted he had once been a member of the Communist Party. The Committee broke down his resolve and he named the names of other Party members. He was blacklisted and departed for Europe, where he continued to make films, often in leading roles. Following the demise of the blacklist, he returned to America and resumed his position as a familiar and talented purveyor of gangland types. A writer and director as well, Lawrence has remained active in his ninth decade.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzNzM5ODQ4MF5BMl5BanBnXkFtZTcwMjE4ODExOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0492908","name":"Marc Lawrence","idIMDB":"nm0492908"},"actorId":"nm0492908","character":"Old Timer Motel Owner","urlCharacter":"http://www.imdb.com/character/ch0187419","main":true},{"actorName":"Kelly Preston","urlProfile":"http://www.imdb.com/name/nm0000593","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2Njk3MTUyNV5BMl5BanBnXkFtZTcwNzY3ODM0MQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1962","placeOfBirth":" Honolulu, Hawaii, USA","birthName":"Kelly Kamalelehua Palzis","height":"5' 6\" (1.68 m)","bio":"Kelly Preston was born on October 13, 1962 in Honolulu, Hawaii. A talented and captivating performer, Kelly first garnered international attention with her role as \"Marnie Mason\" in Ivan Reitman's Twins (1988), starring Arnold Schwarzenegger and Danny DeVito. With her diverse character portrayals in films, such as director Cameron Crowe's Jerry Maguire (1996); Citizen Ruth (1996) for Alexander Payne; and For Love of the Game (1999), directed by Sam Raimi, she has continued to capture audience attention. In the early part of her career, Kelly worked with notable director John Frankenheimer in the Elmore Leonard film, 52 Pick-Up (1986), alongside Roy Scheider and Ann-Margret. Kelly's career has cast her beside some of Hollywood's most notable names, including Kevin Spacey in Casino Jack (2010); Quentin Tarantino, George Clooney, and Harvey Keitel in Robert Rodriguez's From Dusk Till Dawn (1996); Kevin Bacon in Death Sentence (2007); Meg Ryan and Matthew Broderick in Addicted to Love (1997); Debra Winger, Zooey Deschanel, and Hank Azaria in Eulogy (2004); Mike Myers in The Cat in the Hat (2003); and Rod Steiger and Julie Harris in the Academy Award-nominated short, Little Surprises (1996). Kelly is also actively involved in education, drug reform and many different charitable organizations. As a result of her work, she has been acknowledged with numerous awards and recognition. She has been married to John Travolta since September 12, 1991. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2Njk3MTUyNV5BMl5BanBnXkFtZTcwNzY3ODM0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000593","name":"Kelly Preston","idIMDB":"nm0000593"},"actorId":"nm0000593","character":"Newscaster Kelly Houge","urlCharacter":"http://www.imdb.com/character/ch0082289","main":true}],"seasons":[],"idIMDB":"tt0116367","urlIMDB":"http://www.imdb.com/title/tt0116367","business":{"budget":{"money":"$19,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$10,240,805","country":"USA","day":"21","month":"01","year":"1996","remarks":"2,004 Screens"}],"gross":[{"money":"£2,304,544","country":"UK","day":"21","month":"07","year":"1996","remarks":""},{"money":"£1,645,343","country":"UK","day":"16","month":"06","year":"1996","remarks":""},{"money":"$33,500,000 (Worldwide)","country":"except","day":null,"month":null,"year":null,"remarks":null},{"money":"ITL 542,886,000","country":"Italy","day":"05","month":"01","year":"1997","remarks":""}],"weekendGross":[{"money":"$1,118,852","country":"USA","day":"11","month":"02","year":"1996","remarks":"1,049 Screens"},{"money":"$2,478,318","country":"USA","day":"04","month":"02","year":"1996","remarks":"1,664 Screens"},{"money":"$4,851,921","country":"USA","day":"28","month":"01","year":"1996","remarks":"2,007 Screens"}],"admissions":[{"money":"630,000","country":"France","day":"06","month":"08","year":"1996","remarks":""},{"money":"64,891","country":"Netherlands","day":"31","month":"12","year":"1997","remarks":""},{"money":"64,173","country":"Netherlands","day":"01","month":"01","year":"1997","remarks":""},{"money":"25,268","country":"Portugal","day":"27","month":"02","year":"1997","remarks":""},{"money":"21,172","country":"Portugal","day":"20","month":"02","year":"1997","remarks":""},{"money":"8,031","country":"Portugal","day":"06","month":"02","year":"1997","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"13","month":"06","year":"1995","remarks":null},{"money":null,"country":null,"day":"20","month":"08","year":"1995","remarks":null}],"copyrightHolder":"© 1995 Miramax Film Corp."},"technical":{"runtime":["1 hr 48 min (108 min)"],"soundMix":["SDDS (8 channels)","Dolby Digital"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":["3,076 m"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.3","metascore":"52","filmingLocations":[{"location":"Barstow, California, USA"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1996","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Horror Film","names":[]},{"category":"Best Actor","names":[{"name":"George Clooney","id":"nm0000123","role":null}]}]},{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Harvey Keitel","id":"nm0000172","role":null}]},{"category":"Best Supporting Actor","names":[{"name":"Quentin Tarantino","id":"nm0000233","role":null}]},{"category":"Best Supporting Actress","names":[{"name":"Juliette Lewis","id":"nm0000496","role":null}]},{"category":"Best Director","names":[{"name":"Robert Rodriguez","id":"nm0001675","role":null}]},{"category":"Best Writing","names":[{"name":"Quentin Tarantino","id":"nm0000233","role":null}]},{"category":"Best Make-Up","names":[]}]}]},{"award":"Amsterdam Fantastic Film Festival 1996","titlesAwards":[{"titleAwardOutcome":"Won Silver Scream Award","categories":[{"category":"","names":[{"name":"Robert Rodriguez","id":"nm0001675","role":null}]}]}]},{"award":"International Horror Guild 1997","titlesAwards":[{"titleAwardOutcome":"Nominated IHG Award","categories":[{"category":"Best Movie","names":[]}]}]},{"award":"MTV Movie Awards 1996","titlesAwards":[{"titleAwardOutcome":"Won MTV Movie Award","categories":[{"category":"Best Breakthrough Performance","names":[{"name":"George Clooney","id":"nm0000123","role":null}]}]}]},{"award":"Razzie Awards 1997","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Supporting Actor","names":[{"name":"Quentin Tarantino","id":"nm0000233","role":null}]}]}]},{"award":"The Stinkers Bad Movie Awards 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Stinker Award","categories":[{"category":"Worst Supporting Actor","names":[{"name":"Quentin Tarantino","id":"nm0000233","role":null}]}]}]}],"votes":"230,321","type":"Movie","companyCreditsSimple":[{"idCompany":"co0019626","name":"Dimension Films"},{"idCompany":"co0019267","name":"A Band Apart"},{"idCompany":"co0082018","name":"Los Hooligans Productions"}],"keywords":{"keywords":["vampire","sex offender","brother","rapist","stripper","human versus vampire","stabbed with a pencil","rape victim","pervert","held hostage","cult film","u.s. mexico border","priest","border guard","stabbed in the hand","strip club","person on fire","vampire bat","pool cue","foot sucking","foot fetish","brother sister relationship","criminal hero","reference to peter cushing","hitman","killer","human monster","homicidal maniac","psychopathic killer","anti hero","mass murderer","serial killer","bar","mexico","hostage","motel","biker","on the run","fugitive","texas","convenience store","psychopath","recreational vehicle","hell","neo western","modern western","bar shootout","opening action scene","sexy female vampire","voyeur","white panties","panties","bikini","scantily clad female","cleavage","father son relationship","father daughter relationship","self sacrifice","one day","1990s","machismo","shotgun","black comedy","fantasy sequence","news report","survival","toilet","knickers","bar fight","gang","mexican horror","maniac","serial rapist","sexual predator","temple ruins","aztec pyramid","exploding building","supernatural power","infection","water gun","torn in half","stab wound","blood on shirt","pool of blood","obscene gesture","held at gunpoint","head wound","head ripped off","head cut off","head chopped off","hand wound","gunshot wound","f word","disappearance","bullet wound","bloody hand","blood stain","tattoo","stabbed in the heart","sheriff","mexican band","melting face","impalement","heart ripped out","exploitation","crucifix","cop killer","bouncer","bartender","stockholm syndrome","shot in the hand","vampire hunter","snake","stripper dancing with snake","cult","seduction","female vampire","death of brother","shot to death","torso cut in half","severed head","obscene finger gesture","gay slur","blood splatter","villainess","exploding head","crossbow","throat slitting","holy water","holy water gun","gore","dance","money","murder","ethnic slur","gun","texas ranger","vampire slayer","bitten in the throat","morphing","dead boy","explosion","racism","heart in hand","holy water balloon","preacher","blood","shot in the head","exploding body","boa constrictor","dungeon","hole in hand","severed arm","decapitation","knife in hand","siege","shape shifter","showdown","media coverage","creature","violence","surprise ending","plot twist","professional killer","subliminal message","truck driver","voyeurism","public nudity","surrealism","wisecrack humor","southern accent","first part","man with glasses","sexual perversion","fast food","trucker","pre columbian","female nudity","neck breaking","cigar smoking","brutality","written by star","vietnam war veteran","body horror","monster","loss of faith","actor playing multiple roles","rape","independent film","title spoken by character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:08:02"}}