{"data":{"movies":[{"title":"The Battle Over Citizen Kane","originalTitle":"","year":"1996","releaseDate":"19960129","directors":[{"name":"Michael Epstein","id":"nm0258515"},{"name":"Thomas Lennon","id":"nm0502072"}],"writers":[{"name":"Richard Ben Cramer","id":"nm0186193"},{"name":"Thomas Lennon","id":"nm0502072"}],"runtime":"108 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNTIyNzM2OF5BMl5BanBnXkFtZTcwOTMxNjMyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Documentary","Biography","History"],"plot":"This documentary, produced for PBS' _\"American Experience, The\" (1988)_ series, chronicles the struggles between filmmaker and newspaper tycoon over the making and release of (1941), whose protagonist (Charles Foster Kane) was allegedly a barely fictionalized Hearst. Interviews with contemporaries of Hearst and Welles reveal the intense campaign to suppress the film and ultimately ruin the career of its director.","simplePlot":"Documentary about the battle between and over Welles' (1941). Features interviews with Welles' and Hearst's co-workers also as a relative complete bio of Hearst.","actors":[{"actorName":"William Alland","urlProfile":"http://www.imdb.com/name/nm0020041","urlPhoto":"","biography":{"dateOfBirth":"4 March 1916","placeOfBirth":" Delmar, Delaware, USA","bio":"Born in Delmar, Delaware, William Alland began his show-biz career as an actor with a semi-professional Baltimore troupe. Arriving in Manhattan with $25, \"a paper suitcase\" and the ambition to work on Broadway, Alland took courses and acted at the Henry Street Settlement House and there met \"boy wonder\" Orson Welles, then on the eve of forming his Mercury Theatre group. Alland got in on the ground floor, acting with the Mercury Players on the New York stage and in radio (including the notorious Halloween 1938 \"War of the Worlds\" broadcast) before playing the (camera-shy) reporter Thompson in Welles' Citizen Kane (1941). During World War II Alland was a combat pilot (50 missions over the South Pacific); in the postwar years, he was the Peabody Award-winning producer of radio's groundbreaking \"Doorway to Life\". He then turned movie producer, cranking out a series of features (mostly sci-fi films and Westerns) at Universal-International in the 1950s.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0020041","name":"William Alland","nicknames":["Bill"],"idIMDB":"nm0020041"},"actorId":"nm0020041","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Thomas Anderson","urlProfile":"http://www.imdb.com/name/nm0027507","urlPhoto":"","biography":{"bio":"It looks like we don't have any Biography for Thomas Anderson yet.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0027507","name":"Thomas Anderson","idIMDB":"nm0027507"},"actorId":"nm0027507","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Bogdanovich","urlProfile":"http://www.imdb.com/name/nm0000953","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNzQ3NzAxMl5BMl5BanBnXkFtZTcwODQ5NDM5MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 July 1939","placeOfBirth":" Kingston, New York, USA","height":"5' 10\" (1.78 m)","bio":"Peter Bogdanovich was conceived in Europe but born in Kingston, New York. He is the son of immigrants fleeing the Nazis, Herma (Robinson) and Borislav Bogdanovich, a painter and pianist. His father was a Serbian Orthodox Christian, and his mother was from a rich Austrian Jewish family. Peter originally was an actor in the 1950s, studying his craft with legendary acting teacher Stella Adler and appearing on television and in summer stock. In the early 1960s he achieved notoriety for programming movies at the Museum of Modern Art in New York City. An obsessive cinema-goer, sometimes seeing up to 400 movies a year in his youth, Bogdanovich prominently showcased the work of American directors such as John Ford, about whom he subsequently wrote a book based on the notes he had produced for the MOMA retrospective of the director, and the then-underappreciated Howard Hawks. Bogdanovich also brought attention to such forgotten pioneers of American cinema as Allan Dwan. Bogdanovich was influenced by the French critics of the 1950s who wrote for Cahiers du Cinema, especially critic-turned-director François Truffaut. Before becoming a director himself, he built his reputation as a film writer with articles in Esquire Magazine. In 1968, following the example of Cahiers du Cinema critics Truffaut, Jean-Luc Godard, Claude Chabrol and Éric Rohmer who had created the Nouvelle Vague (\"New Wave\") by making their own films, Bogdanovich became a director. Working for low-budget schlock-meister Roger Corman, Bogdanovich directed the critically praised Targets (1968) and the not-so-critically praised Voyage to the Planet of Prehistoric Women (1968), a film best forgotten. Turning back to journalism, Bogdanovich struck up a lifelong friendship with the legendary Orson Welles while interviewing him on the set of Mike Nichols' film adaptation of Catch-22 (1970) from the novel by Joseph Heller. Subsequently, Bogdanovich has played a major role in elucidating Welles and his career with his writings on the great actor-director, most notably his book \"This is Orson Welles\" (1992). He has steadily produced invaluable books about the cinema, especially \"Who the Devil Made It: Conversations with Legendary Film Directors,\" an indispensable tome that establishes Bogdanovich, along with Kevin Brownlow, as one of the premier English-language chroniclers of cinema. The 32-year-old Bogdanovich was hailed by a critics as a Wellesian wunderkind when his most famous film, The Last Picture Show (1971) was released. The film received eight Academy Award nominations, including Bogdanovich as Best Director, and won two of them, for Cloris Leachman and \"John Ford Stock Company\" veteran Ben Johnson in the supporting acting categories. Bogdanovich, who had cast 19-year-old model Cybill Shepherd in a major role in the film, fell in love with the young beauty, an affair that eventually led to his divorce from the film's set designer Polly Platt, his longtime artistic collaborator and the mother of his two children. Bogdanovich followed up The Last Picture Show (1971) with a major hit, What's Up, Doc? (1972), a screwball comedy heavily indebted to Hawks' Bringing Up Baby (1938) and His Girl Friday (1940), starring Barbra Streisand and 'Ryan O'Neal'. Despite his reliance on homage to bygone cinema, Bogdanovich had solidified his status as one of a new breed of A-list directors that included Academy Award winners Francis Ford Coppola and William Friedkin, with whom he formed The Directors Company. The Directors Company was a generous production deal with Paramount Pictures that essentially gave the directors carte blanche if they kept within strict budget limitations. It was through this entity that Bogdanovich's next big hit, the critically praised Paper Moon (1973), was produced. Paper Moon (1973), a Depression-era comedy starring Ryan O'Neal that won his ten-year-old daughter Tatum O'Neal an Oscar as Best Supporting Actress, proved to be the highwater mark of Bogdanovich's career. Forced to share the profits with his fellow directors, Bogdanovich became dissatisfied with the arrangement. The Directors Company subsequently produced only two more pictures, Francis Ford Coppola's critically acclaimed The Conversation (1974) which was nominated for an Academy Award for Best Picture of 1974 and garnered Coppola an Oscar nod for Best Director, and Bogdanovich's Daisy Miller (1974), a film that had a quite different critical reception. An adaptation of the Henry James novella, Daisy Miller (1974) spelled the beginning of the end of Bogdanovich's career as a popular, critically acclaimed director. The film, which starred Bogdanovich's lover Cybill Shepherd as the title character, was savaged by critics and was a flop at the box office. Bogdanovich's follow-up, At Long Last Love (1975), a filming of the Cole Porter musical starring Cybill Shepherd, was derided by critics as one of the worst films ever made, noted as such in Harry Medved and Michael Medved's book \"The Golden Turkey Awards: Nominees and Winners, the Worst Achievements in Hollywood History\" (1980). The film also was a box office bomb despite featuring Burt Reynolds, a hotly burning star who would achieve super-nova status at the end of the 1970s. Once again beholden to the past, Bogdanovich insisted on filming the musical numbers for At Long Last Love (1975) live, a process not used since the early days of the talkies, when sound engineer Douglas Shearer developed lip-synching at Metro-Goldwyn-Mayer. The decision was widely ridiculed, as none of the leading actors were known for their singing abilities (Bogdanovich himself had produced a critically panned album of Cybill Shepherd singing Cole Porter songs in 1974). The public perception of Bogdanovich became that of an arrogant director hamstrung by his own hubris. Trying to recapture the lightning in the bottle that was his early success, Bogdanovich once again turned to the past, his own and that of cinema, with Nickelodeon (1976). The film, a comedy recounting the earliest days of the motion picture industry, reunited Ryan O'Neal and 'Tatum O'Neal' from his last hit, Paper Moon (1973) with Burt Reynolds. Counseled not to use the unpopular (with both audiences and critics) Cybill Shepherd in the film, Bogdanovich instead used newcomer Jane Hitchcock as the film's ingénue. Unfortunately, the magic of Paper Moon (1973) could not be repeated and the film died at the box office. Jane Hitchcock, Bogdanovich's discovery, would make only one more film before calling it quits. After a three-year hiatus, Bogdanovich returned with the critically and financially underwhelming Saint Jack (1979) for Hugh M. Hefner's Playboy Productions Inc. Bogdanovich's long affair with Cybill Shepherd had ended in 1978, but the production deal making Hugh M. Hefner the film's producer was part of the settlement of a lawsuit Shepherd had filed against Hefner for publishing nude photos of her pirated from a print of The Last Picture Show (1971) in Playboy Magazine. Bogdanovich then launched the film that would be his career Waterloo, They All Laughed (1981), a low-budget ensemble comedy starring Audrey Hepburn and the 1980 Playboy Playmate of the Year, Dorothy Stratten. During the filming of the picture, Bogdanovich fell in love with Stratten, who was married to an emotionally unstable hustler, Paul Snider, who relied on her financially. Stratten moved in with Bogdanovich, and when she told Snider she was leaving him, he shot and killed her, sodomizing her corpse before committing suicide. They All Laughed (1981) could not attract a distributor due to the negative publicity surrounding the Stratten murder, despite it being one of the few films made by the legendary Audrey Hepburn after her provisional retirement in 1967 (the film would prove to be Hepburn's last starring role in a theatrically released motion picture). The heartbroken Bogdanovich bought the rights to the negative so that it would be seen by the public, but the film had a limited release, garnered weak reviews and cost Bogdanovich millions of dollars, driving the emotionally devastated director into bankruptcy. Bogdanovich turned back to his first avocation, writing, to pen a memoir of his dead love, \"The Killing of the Unicorn: Dorothy Stratten (1960-1980)\" that was published in 1984. The book was a riposte to Teresa Carpenter's \"Death of a Playmate\" article written for The Village Voice that had won the 1981 Pulitzer Prize. Carpenter had lambasted Bogdanovich and Hugh M. Hefner, claiming that Stratten was as much a victim of them as she was of Paul Snider. The article served as the basis of Bob Fosse's film Star 80 (1983), in which Bogdanovich was portrayed as the fictional director \"Aram Nicholas\". Bogdanovich's career as a noted director was over, and though he achieved modest success with Mask (1985), his sequel to his greatest success The Last Picture Show (1971), Texasville (1990), was a critical and box office disappointment. He directed two more theatrical films in 1992 and 1993, but their failure kept him off the big screen until 2001's The Cat's Meow (2001). Returning once again to a reworking of the past, this time the alleged murder of director Thomas H. Ince by Welles' bete noir William Randolph Hearst, The Cat's Meow (2001) was a modest critical success but a flop at the box office. In addition to helming some television movies, Bogdanovich has returned to acting, with a recurring guest role on the cable television series The Sopranos (1999) as Dr. Jennifer Melfi's analyst. Bogdanovich's personal reputation suffered from gossip about his 13-year marriage to Dorothy Stratten's 19-year-old-kid sister Louise Stratten, who was 29 years his junior. Some gossip held that Bogdanovich's behavior was akin to that of the James Stewart character in Alfred Hitchcock's necrophiliac masterpiece Vertigo (1958), with the director trying to remold Stratten into the image of her late sister. The marriage ended in divorce in 2001. Now in his mid-60s, Bogdanovich clearly has imitated his hero Orson Welles, but in an unintended fashion, as a type of monumental failure much beloved by the mythmakers of Hollywood. However, unlike the widely acclaimed master Welles, the orbit of Bogdanovich's reputation has never recovered from the apogee it reached briefly in the early 1970s. There has been speculation that Peter Bogdanovich's ruin as a director was guaranteed when he ditched his wife and artistic collaborator Polly Platt for Cybill Shepherd. Platt had worked with Bogdanovich on all his early successes, and some critics believe that the controlling artistic consciousness on The Last Picture Show (1971) was Platt's. Parting company with Platt after Paper Moon (1973), Bogdanovich promptly slipped from the heights of a wunderkind to a has-been pursuing epic folly, as evidenced by Daisy Miller (1974) and At Long Last Love (1975). In 1998 the National Film Preservation Board of the Library of Congress named The Last Picture Show (1971) to the National Film Registry, an honor awarded only to the most culturally significant films. Viewing Daisy Miller (1974) alongside The Last Picture Show (1971) should be a standard part of film school curriculum, as it tends to debunk the auteur theory. Bogdanovich's career gives truth to the contention that film is an industrial process and each movie has many \"authors,\" not just one (the director). If the auteur theory were true, Bogdanovich arguably would have returned to form eventually and produced more good films, if not another masterpiece. He didn't - he didn't even come close. Thus, Bogdanovich will remain a footnote in cinema history, more valuable for his contributions to the literature of film than to the medium itself.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgxNzQ3NzAxMl5BMl5BanBnXkFtZTcwODQ5NDM5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000953","name":"Peter Bogdanovich","idIMDB":"nm0000953"},"actorId":"nm0000953","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jimmy Breslin","urlProfile":"http://www.imdb.com/name/nm0107736","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MjYyODAwNl5BMl5BanBnXkFtZTgwOTExODQ1MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1928","placeOfBirth":" Jamaica, Queens, New York City, New York, USA","birthName":"James Earle Breslin","bio":"Jimmy Breslin was born on October 17, 1928 in Jamaica, Queens, New York City, New York, USA as James Earle Breslin. He was an actor and writer, known for Summer of Sam (1999), Crazy Love (2007) and Superman 50th Anniversary (1988). He was married to Ronnie Eldridge and Rosemary Dattolico. He died on March 19, 2017 in Manhattan, New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MjYyODAwNl5BMl5BanBnXkFtZTgwOTExODQ1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0107736","name":"Jimmy Breslin","idIMDB":"nm0107736"},"actorId":"nm0107736","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard Ben Cramer","urlProfile":"http://www.imdb.com/name/nm0186193","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MTExOTkwN15BMl5BanBnXkFtZTgwNDIyOTU1MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 June 1950","placeOfBirth":" Rochester, New York, USA","birthName":"Richard Ben Cramer","bio":"Richard Ben Cramer was born on June 12, 1950 in Rochester, New York, USA. He was a writer and actor, known for RKO 281 (1999), The Irish in America: Long Journey Home (1998) and Terry Sanford and the New South (2007). He was married to Joan, Joan Smith, Carolyn White and Caroyln White. He died on January 7, 2013 in Baltimore, Maryland, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MTExOTkwN15BMl5BanBnXkFtZTgwNDIyOTU1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0186193","name":"Richard Ben Cramer","idIMDB":"nm0186193"},"actorId":"nm0186193","character":"Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marion Davies","urlProfile":"http://www.imdb.com/name/nm0203836","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwODMzNTU2MzJeQTJeQWpwZ15BbWU2MDQzMjY1Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1897","placeOfBirth":" Brooklyn [now in New York City], New York, USA","birthName":"Marion Cecelia Douras","height":"5' 5\" (1.65 m)","bio":"Marion Cecelia Douras was born in the borough of Brooklyn, New York on January 3, 1897. She had been bitten by the show biz bug early as she watched her sisters perform in local stage productions. She wanted to do the same. As Marion got older, she tried out for various school plays and did fairly well. Once her formal education had ended, Marion began her career as a chorus girl in New York City and eventually found herself in the famed Ziegfeld Follies. But she wanted more than to dance. Acting, to Marion, was the epitome of show business and aimed her sights in that direction. Her first film was Runaway, Romany (1917) when she was 20. Written by Marion and directed by her brother-in-law, the film wasn't exactly a box-office smash, but for Marion, it was a start and a stepping stone to bigger things. The following year Marion starred in three films, The Burden of Proof (1918), [error], and Cecilia of the Pink Roses (1918). The latter film was backed by newspaper magnate, William Randolph Hearst, with whom Marion would continue a long-term romantic relationship for the next 30 years. Because of Hearst's newspaper empire, Marion would be promoted as no actress before her. She appeared in numerous films over the next few years, with The Cinema Murder (1919) being one of the most suspenseful. In 1922, Marion appeared as Mary Tudor in the historical romantic epic, When Knighthood Was in Flower (1922). It was a film into which Hearst poured in millions of dollars as a showcase for her. Although Marion didn't normally appear in period pieces, she turned in a wonderful performance and the film turned a profit. Marion remained busy, one of the staples in movie houses around the country. At the end of the twenties, it was obvious that sound films were about to replace the silents. Marion was nervous because she had a stutter when she became excited and worried she wouldn't make a successful transition to the new medium, but she was a true professional who had no problem with the change. Time after time, film after film, Marion turned in masterful performances. In 1930, two of her better films were Not So Dumb (1930) and The Florodora Girl (1930). By the early 30s, Marion had lost her box office appeal and the downward slide began. Had she been without Hearst's backing, she possibly could have been more successful. He was more of a hindrance than a help. Hearst had tried to push MGM executives to hire Marion for the role of Elizabeth Barrett in The Barretts of Wimpole Street (1934). Louis B. Mayer had other ideas and hired producer Irving Thalberg's wife, Norma Shearer instead. Hearst reacted by pulling his newspaper support for MGM without much impact. By the late 1930's Hearst was suffering financial reversals and it was Marion who bailed him out by selling off $1 million of her jewelry. Without her the Hearst Corporation might not be where it is today. Hearst's financial problems also spelled the end to her career. Although she had made the transition to sound, other stars fared better and her roles became fewer and further between. In 1937, a 40 year old Marion filmed her last movie, Ever Since Eve (1937). Out of films and with the intense pressures of her relationship with Hearst, Marion turned to more and more to alcohol. Despite those problems, Marion was a very sharp and savvy business woman. After the death of Hearst in 1951, Marion married for the first time at the age of 54, to Horace Brown. The union would last until she died of cancer on September 22, 1961 in Los Angeles, California. She was 64 years old.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwODMzNTU2MzJeQTJeQWpwZ15BbWU2MDQzMjY1Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0203836","name":"Marion Davies","idIMDB":"nm0203836"},"actorId":"nm0203836","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Leonard de Paur","urlProfile":"http://www.imdb.com/name/nm0210914","urlPhoto":"","biography":{"dateOfBirth":"18 November 1914","placeOfBirth":" Summit, New Jersey, USA","bio":"Composer and conductor who led the Orchestra of America. He joined ASCAP in 1958, and composed the song \"Glory Manger\".","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0210914","name":"Leonard de Paur","idIMDB":"nm0210914"},"actorId":"nm0210914","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Douglas Fairbanks Jr.","urlProfile":"http://www.imdb.com/name/nm0001195","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzODUzNzU0MF5BMl5BanBnXkFtZTYwMTgwOTQ2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1909","placeOfBirth":" New York City, New York, USA","birthName":"Douglas Elton Ulman Fairbanks Junior","height":"6' 0½\" (1.84 m)","bio":"Although he appeared in approximately 100 movies or TV shows, Douglas Fairbanks, Jr. never really intended to take up acting as a career. However, the environment he was born into and the circumstances naturally led him to be a thespian. Noblesse oblige. He was born Douglas Elton Fairbanks, Jr. in New York City, New York, to Anna Beth (Sully), daughter of a very wealthy cotton mogul, and actor Douglas Fairbanks (born Douglas Elton Thomas Ullman), then not yet established as the swashbuckling idol he would become. Fairbanks, Jr. had German Jewish (from his paternal grandfather), English, and Scottish ancestry. He proved a gifted boy early in life. To the end of his life he remained a multi-talented, hyperactive man, not content to appear in the 100 films mentioned above. Handsome, distinguished and extremely bright, he excelled at sports (much like his father), notably during his stay at the Military Academy in 1919 (his role in Claude Autant-Lara's \"L'athlète incomplete\" illustrated these abilities). He also excelled academically, and attended the Lycéee Janson de Sailly in Paris, where he had followed his divorced mother. Very early in his life he developed a taste for the arts as well and became a painter and sculptor. Not content to limiting himself to just one field, he became involved in business, in fields as varied as mining, hotel management, owning a chain of bowling alleys and a firm that manufactured popcorn. During World War II he headed London's Douglas Voluntary Hospital (an establishment taking care of war refugees), was President Franklin D. Roosevelt's special envoy for the Special Mission to South America in 1940 before becoming a lieutenant in the Navy (he was promoted to the rank of captain in 1954) and taking part in the Allies' landing in Sicily and Elba in 1943. A fervent Anglophile, was knighted in 1949 and often entertained Queen Elizabeth II and Prince Philip in his London mansion, \"The Boltons\". His film career began at the age of 13 when he was signed by Paramount Pictures. He debuted in Stephen Steps Out (1923) but the film flopped and his career stagnated despite a critically acclaimed role in Stella Dallas (1925). Things really picked up when he married Lucille Le Sueur, a young starlet who was soon to become better known as Joan Crawford. The young couple became the toast of the town (one \"Screen Snapshots\" episode echoes this sudden glory) and good parts and success followed, such as the hapless partner of Edward G. Robinson in Little Caesar (1931) a favorably reviewed turn as the villain in The Prisoner of Zenda (1937) or more debonair characters in slapstick comedies or adventure yarns. The 1930s were a fruitful period for Fairbanks, his most memorable role probably being that of the British soldier in Gunga Din (1939); although it was somewhat of a \"swasbuckling\" role, Fairbanks made a point of never imitating his father. After the World War II, his star waned and, despite a moving part in Ghost Story (1981), he did not appear in a major movie. Now a legend himself, Douglas Fairbanks Jr. left this world with the satisfaction of having lived up to the Fairbanks name at the end of a life nobody could call \"wasted\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzODUzNzU0MF5BMl5BanBnXkFtZTYwMTgwOTQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001195","name":"Douglas Fairbanks Jr.","nicknames":["Doug"],"idIMDB":"nm0001195"},"actorId":"nm0001195","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Richard France","urlProfile":"http://www.imdb.com/name/nm0289839","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDVhZWMyMmQtMDQyNi00N2Q3LTg4ZjgtMjljZTBlMTZlNDk5XkEyXkFqcGdeQXVyNTAyNDQ2NjI@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1938","placeOfBirth":" Boston, Massachusetts, USA","bio":"Richard France was born on May 5, 1938 in Boston, Massachusetts, USA. He is an actor and writer, known for Zombie - Le crépuscule des morts-vivants (1978), The Crazies (1973) and Graveyard Shift (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDVhZWMyMmQtMDQyNi00N2Q3LTg4ZjgtMjljZTBlMTZlNDk5XkEyXkFqcGdeQXVyNTAyNDQ2NjI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0289839","name":"Richard France","idIMDB":"nm0289839"},"actorId":"nm0289839","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Randolph Hearst","urlProfile":"http://www.imdb.com/name/nm0372558","urlPhoto":"","biography":{"dateOfBirth":"29 April 1863","placeOfBirth":" San Francisco, California, USA","height":"6' 3\" (1.91 m)","bio":"William Randolph Hearst was the greatest newspaper baron in the history of the United States and is the person whom Citizen Kane (1941), widely regarded as the greatest film ever made, is primarily based on. While there are many similarities between Charles Foster Kane, as limned by the great Orson Welles and his screenwriter, Herman J. Mankiewicz (who knew Hearst), there are many dissimilarities also. He was born on April 29, 1863, in San Francisco, California, the only child of the multi-millionaire miner George Hearst and his wife, Phoebe Apperson Hearst. Mrs. Hearst was a former school-teacher with refined manners who was over 20 years her husband's junior. Phoebe spoiled William Randolph, who was raised with personal tutors and sent to the most elite prep schools back East. He attended Harvard College but was expelled in 1885. When he was 23 years old, William Randolph asked his father if he could take over the daily operation of the \"San Francisco Examiner,\" a newspaper that George had acquired as payment for a gambling debt. His father relented and William Randolph took over, styling himself as its \"Proprietor.\" The \"Examiner,\" which he grandly called \"The Monarch of the Dailies\" on its masthead, was the first of many newspapers that the young Hearst would come to run, and the first where he indulged his appetite for sensationalistic, attention-getting, circulation-boosting news stories. When his father George died, Phoebe Hearst liquidated the family mining assets to fund her son's acquisition of the ailing \"New York Morning Journal.\" (The family continued to own forest products and petroleum properties.) Ruthless and driven, the aggressive Hearst willed the \"Morning Journal\" into becoming the best newspaper in New York City, hiring the best executives and finest reporters from the competition. In the style of yellow-news baron Joseph Pulitzer, with whom he now went into direct competition, Hearst introduced an in-your-face, outrageous editorial content that attracted a new market of readers. Though the term \"Yellow Journalism\" was originally coined to describe the practices of Pulitzer, Hearst proved adept at it. Hearst responded to the request of illustrator Frederic Remington, who had been detailed to Havana in 1898 in anticipation of something big, to return to the States with a terse message: \"Please remain. You furnish the pictures and I'll furnish the war.\" After the U.S.S. Maine was blown-up in Havana Harbor on February 15, 1898, Hearst called the Journal city desk and demanded that the front page prominently play up the incident as the sinking of the American battleship meant war. The Journal began immediately running banner headlines proclaiming \"War? Sure!\" to inflame the public and pressure the government of President William McKinley to proclaim war against Spain. (Some critics accused Hearst of being indirectly responsible for McKinley's assassination as he had published a poem by Ambrose Bierce that seemed to call for such an act.) The Spanish-American War became the Journal's war just as Vietnam was the television network's war. Ernest L. Meyer wrote about Hearst's journalistic standards: \"Mr. Hearst in his long and not laudable career has inflamed Americans against Spaniards, Americans against Japanese, Americans against Filipinos, Americans against Russians, and in the pursuit of his incendiary campaign he has printed downright lies, forged documents, faked atrocity stories, inflammatory editorials, sensational cartoons and photographs and other devices by which he abetted his jingoistic ends.\" Hearst added Chicago to his domain, acquiring the \"Chicago American\" in 1900 and the \"Chicago Examiner\" in 1902. The \"Boston American\" and the \"Los Angeles Examiner\" were acquired in 1904, firmly establishing the media empire that in its heyday during the 1920s, consisted of 20 daily and 11 Sunday newspapers in 13 cities, the King Features syndication service, the International News Service, and the American Weekly (Sunday syndicated supplement). One in four Americans in the '20s read a Hearst newspaper daily. His media empire also included International News Reel and the movie production company Cosmopolitan Pictures, plus a number of national magazines, including \"Cosmopolitan,\" \"Good Housekeeping\" and \"Harper's Bazaar.\" In 1924, he opened the \"New York Daily Mirror,\" a racy tabloid that was an imitation of the innovative \"New York Daily News,\" which ran many photographs to illustrate its lurid reporting. Unlike Charles Foster Kane, Willaim Randolph Hearst never married the niece of the president of the United States. The closest he got to a president other than socializing with one was marrying Millicent Wilson, who shared the name of Woodrow Wilson (1913-1921). The nuptials took place the day before he turned 40. His family opposed his marriage to Millicent, who was a 21-year-old showgirl whom he had known for many years. Before Millicent, he had been involved with Tessie Powers, a waitress he had financially supported since he had attended Harvard and trysted with her while still sporting the college's beanie. Hearst's personal life often was featured in stories that his competitors, the tabloid newspapers, ran during his lifetime, the kind of press he would have no moral qualms about if the proverbial shoe were on the other foot and it was someone else's other than his ox being gored. (So much for his moral outrage over Citizen Kane (1941).) He and Millicent had five sons, but Hearst took another showgirl, 20-year-old Marion Davies of the Ziefgeld Follies, as his mistress. She was 34 years his junior. It was a relationship that lasted until the end of his life. Hearst used his media power to get himself twice elected to Congress as a member of House of Representatives (1903-1905; and 1905-1907) as a progressive, if not radical Democrat. However, he failed in his two bids to become mayor of New York City in 1905 and 1909, and was defeated by the Republican candidate Charles Evans Hughes in his attempt to become governor of New York State in (1906). He supported the Spanish-American War - many observers believe he even was the casus belli of that conflict - but opposed the U.S. entry into World War One as he despised the British Empire. He also opposed President Wilson's formation of the League of Nations and American membership in the organization. By the time of the First World War, his political ambitions frustrated, he decided to live openly with Davies in California and at a castle he bought in Wales. His wife and children remained in New York, where Hearst became known as a leading philanthropist, creating the Free Milk Fund for the poor in 1921. They officially separated in 1926. Hearst spent many years and a fortune promoting Marion Davies' film career. According to the great critic Pauline Kael, Davies was a first-rate light comedienne, but Hearst wanted her to play the classical roles of a tragedienne, with the result that he pushed her into movies that were ill-suited for her, and that made her look ridiculous. She was not, however, the talentless drunk that Charles Foster Kane's second wife, Susan Alexander was. (Orson Welles said that his only regret over Citizen Kane (1941) was the backlash and grief caused to Davies, who was a woman adored by everyone who knew her. Davies nephew actually was the step-father of Welles' first child.) Phoebe Hearst died in 1919, and Hearst moved onto the family's 268,000-acre San Simeon Ranch in southern California. On 127 acres overlooking the California coast north of Cambria, he built what is now called Hearst Castle but that he called \"La Cuesta Encantada.\" Starting in 1922, and not finished until 1947, the 165-room mansion was built by an army of craftsmen and laborers. The mansion -- which cost approximately $37 million to build -- was not ready for full-time occupancy until 1927, and additions to the main building continued for another 20 years. At La Cuesta Encantada, Hearst entertained the creme de la creme of Hollywood and the world, whom he treated to his hospitality among his personal art collection valued at over $50 million, the largest ever assembled by any private individual. He could live openly in California with Davies. Along with his sensationalism and jingoism, William Randold Hearst was a racist who hated minorities, particularly Mexicans, both native-born and immigrants. He used his newspaper chain to frequently stir up racial tensions. Hearst's newspapers portrayed Mexicans as lazy, degenerate and violent, marijuana-smokers who stole jobs from \"real Americans.\" Hearst's hatred of Mexicans and his hyping of the \"Mexican threat\" to America likely was rooted in the 800,000 acres of timberland that had been confiscated from him by Pancho Villa during the Mexican revolution. The Great Depression hurt Hearst financially, and he never recovered from it. At one point, his financial distress was so great, his mistress, Marion Davies, had to pawn some of her jewels to get him the cash to keep him afloat. The Hearst media empire has reached its zenith in terms of circulation and revenues the year before the Stockmarket Crash of October 1929, but the huge over-extension of the Hearst media empire eventually cost him control of his holdings. Hearst's newspaper chain likely had never been profitable, but had been supported by the income from his mining, ranching and forest products interests. All of Hearst's business interests were adversely affected by the economic downturn, but the newspapers were hit particularly hard due to the decline in advertising revenues, the life's blood of any newspaper. His bellicose and eccentric behavior only made matters worse. By the time Franklin D. Roosevelt exerted himself over the U.S. economy, Hearst had become a reactionary. He had produced a film, Gabriel Over the White House (1933) starring Walter Huston as a presidential messiah, but Roosevelt, apparently, wasn't his kind of Christ-figure. In the movie, President 'Judd' Hammond exercised near dictatorial powers, including apparently ordering summary executions of gangsters; this may have gone over well in corporate America, but hardly was a management paradigm for a working democracy. However, Roosevelt's attempts to centralize power in government and industry cartels to combat the Depression were eventually repudiated by Hearst. His anti-Roosevelt stance, trumpeted by his papers, proved unpopular with the common man who was his primary readership. Once, he had served as the self-appointed tribune of the common man, and his progressive politics was denounced by the plutocrats as radical, but by the 1930s, Hearst was flirting with Fascism. The Hearst papers carried paid-for columns by both Adolf Hitler and Benito Mussolini, though Hearst claimed that he was only an anti-Communist. However, during a continental tour with Marion Davies, Hearst actually attended the Nuremberg rally of 1934. He later completed a newsreel deal with Hitler during the trip. Franklin D. Roosevelt, of course, was as staunchly anti-fascist as Hearst was anti-communist. His pro-intervention policies on the side of Britian during the early days of World War Two rankled the philo-German Hearst. Hearst had a complicated relationship with Roosevelt, whom he helped obtain the 1932 Democratic presidential nomination (as a moderate). Hearst fluctuated between endorsing and attacking F.D.R. and his New Deal. In public, Roosevelt, on his part, would woo Hearst with invitations to the White House, obtaining a temporary truce, while in private, Roosevelt complained of Hearst's power and had his income taxes investigated. In 1934, Hearst launched a virulent anti-communist witch-hunt that would last for 20 years in which he tarred New Deal supporters as reds, then ended up labeling F.D.R. himself a communist. In response to his red-baiting, liberals and leftists retaliated with a boycott of Hearst newspapers. Hearst had become a major liability to the Hearst Corp. by the mid-1930s as he became more noxious. He had started out as a populist, but had veered right in the 1920s, then tacked left in the early 1930s, only to veer to the far right beginning in the mid-'30s. Always a maverick, Hearst might have been psychologically unable to maintain a constant position; unable or unwilling to reign in his ego and support those in power, he could never stay allies with anyone for long, and thus regularly shifted positions. As Roosevelt went left, Hearst went right. Apparently, as his flirtation with fascism elucidates, he had cast himself as the savior of America in his own mind. The economic result of Hearst's shift to the right (which also may have been influenced by his need to cajole financiers, who decidedly were anti-Roosevelt) was that advertising sales and circulation declined, just as millions in debt came due and had to be refinanced. In 1936, Hearst's efforts to raise more capital by floating a new bond issue was stymied by his creditors, with the result that he was unable to service the Hearst Corp.'s debts. The Hearst Corp. went into receivership and was reorganized, and William Randolph Hearst was reduced to the status of an employee, with a court-appointed overseer. A liquidation of Heart Corp. assets began, and newspapers were shed, Cosmopolitan Pictures was terminated, and there was an auctioning off of his art and antiquities. Hearst, the media baron of unparalleled power, was through as a major independent power in American politics and culture. However, he still retained enough clout with his remaining newspapers (and their ability to publicize movies) in the early 1940s to make life miserable for Orson Welles after the supreme insult of his roman a clef Citizen Kane (1941). Allegedly, Hearst wasn't so much incensed at Welles as he was at Mankiewicz, a friend who had betrayed his secrets. (\"Rosebud,\" the name of the Charles Foster Kane's childhood sled that supposedly is the key to his psychology but is actually a \"McGuffin\" around which to structure the movie's plot, was allegedly Hearst's nickname for Davies' private parts.) The economic recovery that came with war production during World War II (which he opposed, just as he had America's entry into the First World War) buoyed the Hearst newspapers' circulation and advertising revenues, but he never returned to the prominence he had enjoyed in the old days. He did, still, have the love of Marion Davies, who was with him to the end, steadfast in her love. Hearst died in 1951, aged eighty-eight, at Beverly Hills, California, and is buried at Cypress Lawn Memorial Park in Colma, California. More than 50 years after his death, Hearst's stature has diminished while the reputation of Citizen Kane (1941) remains secure. Interestingly, Hearst's own current, largely negative image has largely been shaped by the film, which is considered a landmark in cinematic innovation. Perhaps it was just a case of Hearst living too long, of outliving his own innovative period. As a newspaper publisher, Hearst promoted innovative writers and cartoonists despite the indifference of his readers. George Herriman, the creator of the comic strip \"Krazy Kat,\" was a Hearst favorite; Hearst even produced Krazy Kat movie shorts. \"Krazy Kat\" was not especially popular with readers, but it is now considered to be a classic and a watershed of that increasing respected art form. On the negative side, the sensationalistic, border-line fabricated, over-hyped journalistic paradigm that Hearst championed through his perfection of modern yellow journalism, a paradigm he made standard newspaper fare for over half-a-century, lives on in today's media.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0372558","name":"William Randolph Hearst","nicknames":["W.R.","The Chief"],"idIMDB":"nm0372558"},"actorId":"nm0372558","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"William Herz","urlProfile":"http://www.imdb.com/name/nm0381240","urlPhoto":"","biography":{"dateOfBirth":"2 August 1916","placeOfBirth":" Detroit, Michigan, USA","bio":"William Herz was born on August 2, 1916 in Detroit, Michigan, USA. He died on May 10, 2016 in Manhattan, New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0381240","name":"William Herz","idIMDB":"nm0381240"},"actorId":"nm0381240","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sam Leve","urlProfile":"http://www.imdb.com/name/nm0505206","urlPhoto":"","biography":{"dateOfBirth":"1 December 1910","placeOfBirth":" Russian Empire","bio":"Sam Leve was born on December 1, 1910 in the Russian Empire. He is known for his work on The Invisible Avenger (1958), The Ford Theatre Hour (1948) and General Electric Theater (1953). He was married to Shirley Book. He died on December 6, 1999 in New York City, New York, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0505206","name":"Sam Leve","idIMDB":"nm0505206"},"actorId":"nm0505206","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Norman Lloyd","urlProfile":"http://www.imdb.com/name/nm0516093","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyOTY5MTkzOV5BMl5BanBnXkFtZTYwMDYxMDU0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 November 1914","placeOfBirth":" Jersey City, New Jersey, USA","birthName":"Norman Nathan Lloyd","height":"5' 5\" (1.65 m)","bio":"Norman Lloyd was born Norman Perlmutter in Jersey City, New Jersey, to Sadie (Horowitz), a housewife and singer, and Max Perlmutter, a furniture store manager. His family was Jewish (from Hungary and Russia). He began his acting career in the theater, first \"treading the boards\" at Eva Le Gallienne's Civic Repertory in New York. Aspiring to work as a classical repertory player, he gradually shed his Brooklyn accent and became a busy stage actor in the 1930s; he next joined the original company of the Orson Welles-John Houseman Mercury Theatre. Lloyd was brought to Hollywood to play a supporting part (albeit the title role) in Alfred Hitchcock's Saboteur (1942). Hitchcock, who later used the actor in Spellbound (1945) and other films, made him an associate producer and a director on TV's long-running Alfred Hitchcock Presents (1955) (then in its third year). In the course of his eight years on the series, Lloyd became a co-producer (with Joan Harrison) and then executive producer. He has since directed for other series (including the prestigious Omnibus (1952)) and for the stage, produced TV's Tales of the Unexpected (1979) and Journey to the Unknown (1968), and played Dr. Auschlander in TV's acclaimed St. Elsewhere (1982).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAyOTY5MTkzOV5BMl5BanBnXkFtZTYwMDYxMDU0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0516093","name":"Norman Lloyd","idIMDB":"nm0516093"},"actorId":"nm0516093","character":"Himself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nancy Loe","urlProfile":"http://www.imdb.com/name/nm0517184","urlPhoto":"","biography":{"dateOfBirth":"25 June 1954","placeOfBirth":"","bio":"Nancy Loe was born on June 25, 1954. She is known for her work on American Experience (1988).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0517184","name":"Nancy Loe","idIMDB":"nm0517184"},"actorId":"nm0517184","character":"Herself","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Mankiewicz","urlProfile":"http://www.imdb.com/name/nm0542533","urlPhoto":"","biography":{"dateOfBirth":"16 May 1924","placeOfBirth":" New York City, New York, USA","birthName":"Frank Fabian Mankiewicz II","bio":"Frank Mankiewicz was born on May 16, 1924 in New York City, New York, USA as Frank Fabian Mankiewicz II. He was married to Patricia O'Brien and Hollie Lou Jolley. He died on October 23, 2014 in Washington, District of Columbia, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0542533","name":"Frank Mankiewicz","idIMDB":"nm0542533"},"actorId":"nm0542533","character":"Himself","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0115634","urlIMDB":"http://www.imdb.com/title/tt0115634","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 48 min (108 min)"],"soundMix":["Mono"],"color":["Black and White","Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.8","filmingLocations":[],"awards":[{"award":"Academy Awards, USA 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Documentary, Features","names":[{"name":"Thomas Lennon","id":"nm0502072","role":null},{"name":"Michael Epstein","id":"nm0258515","role":null}]}]}]},{"award":"Sundance Film Festival 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Grand Jury Prize","categories":[{"category":"Documentary","names":[{"name":"Michael Epstein","id":"nm0258515","role":null},{"name":"Thomas Lennon","id":"nm0502072","role":null}]}]}]}],"votes":"1,128","type":"TV Episode","seasonInfo":{"tvSerie":{"name":"American Experience","id":"tt0094416"},"season":"Season 8","episode":"Episode 7"},"companyCreditsSimple":[{"idCompany":"co0066924","name":"Lennon Documentary Group"},{"idCompany":"co0041824","name":"WGBH"}],"keywords":{"keywords":["director","voice over narration","drama filmmaking","biography filmmaking","publisher","movie studio","mistress","filmmaking","actress","actor","behind the scenes","film industry","media tycoon","censorship","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 19:43:10"}}