{"data":{"movies":[{"title":"P.C.H.","originalTitle":"","year":"1995","directors":[{"name":"Nelson McCormick","id":"nm1879589"}],"writers":[{"name":"Gianni Russo","id":"nm0751625"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNzc4OTQ2Ml5BMl5BanBnXkFtZTcwODE0OTMyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Romance","Thriller"],"plot":"Out at Pacific Coast University, five students living in the same apartment building go through personal trials. Stacey was a famous volleyball player and fashion model once; now she's in semi-hiding, and someone from her past is stalking her. Serena, a pre-med student from East LA, is losing her scholarship because PCU is cutting back. Joe, fresh from the East Coast, is hiding something from his famous father, and Randy is searching for something to help him define himself apart from his rich dad. Polly just wants a roommate and a friend. Everything comes to a head during a charity volleyball game set up by Jake their landlord, who's a local restaurateur.","simplePlot":"Out at Pacific Coast University, five students living in the same apartment building go through personal trials. Stacey was a famous volleyball player and fashion model once; now she's in ... ","actors":[{"actorName":"Jack Scalia","urlProfile":"http://www.imdb.com/name/nm0768815","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMTU5Mzk5MV5BMl5BanBnXkFtZTYwMDkwODI1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 November 1950","placeOfBirth":" Brooklyn, New York, USA","birthName":"Jack Tomaso Scalia","height":"6' 1\" (1.85 m)","bio":"Actor Jack Scalia, a Brooklyn native, was raised in Brentwood,NY. He graduated from Brentwood High School in 1969. He was an All-American athlete in high school, playing three sports through college, while participating in four triathlons and six marathons. He decided to attempt Hollywood stardom as an actor after an injury ended a pro-baseball career. In 1975, he took advantage of his muscular build and macho good looks by modeling with Armani, later joining the Ford Modeling Agency and signing on as the \"Jordache Jeans Man\". In January 1980, Scalia made the transition into acting, which led to his first film role in the mini-movie, The Star Maker (1981), starring the late Rock Hudson. Scalia got his first taste of series stardom as an unshaven, rough-and-tough detective who joins forces with his slick and debonair father (Hudson again) in the TV series, The Devlin Connection (1982). Though the series had a short life, Scalia received scads of attention. His more popular telefilm credits included I'll Take Manhattan (1987), Vengeances de femmes (1991), Lady Boss (1992) and Casualties of Love: The Long Island Lolita Story (1993), playing infamous tabloid newsmaker Joey Buttafuoco, with Alyssa Milano as his teenage object of desire. Though Scalia never scaled to the heights of a Tom Selleck or Pierce Brosnan with that one smash series, he would headline a near-record eleven TV shows that kept him constantly in the running. In 2001, he joined the cast of All My Children (1970) for a time and won a daytime Emmy nomination in the process. He's also been an active hero and villain in low-budget thrillers, such as L'abîme (1990) (aka \"Endless Descent\"), T-Force (1994), Act of War (1998) and Ground Zero (2000). He then returned from living in Rome, Italy while filming a remake of his American TV series, Tequila and Bonetti (1992). He made his stage debut as the lead in the Pulitzer Prize-nominated play, \"Red River Rats\", in Los Angeles. The tall, dark and hirsutely handsome Scalia has remained a durable \"ladies' man\" and \"man's man\" for decades.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMTU5Mzk5MV5BMl5BanBnXkFtZTYwMDkwODI1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0768815","name":"Jack Scalia","idIMDB":"nm0768815"},"actorId":"nm0768815","character":"Daniel St. Germain","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sally Kellerman","urlProfile":"http://www.imdb.com/name/nm0001419","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMTgzODAyNV5BMl5BanBnXkFtZTcwMjgwNTMwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 June 1937","placeOfBirth":" Long Beach, California, USA","birthName":"Sally Clare Kellerman","height":"5' 10\" (1.78 m)","bio":"Sally Kellerman arrived quite young on the late 1950s film and TV scene with a fresh and distinctively weird, misfit presence. It is this same uniqueness that continues to makes her such an attractively offbeat performer today. The willowy, swan-necked, flaxen-haired actress shot to film comedy fame after toiling nearly a decade and a half in the business, and is still most brazenly remembered for her career-maker -- the irreverent hit MASH (1970), for which she received supporting Oscar and Golden Globe nominations. From there she went on to enjoy a number of other hallmark moments as both an actress and a vocalist. California native Sally Clare Kellerman was born on June 2, 1937, in Long Beach, to Edith Baine (Vaughn), a piano teacher, and John Helm Kellerman, a Shell Oil Company executive. Raised along with her sister in the San Fernando Valley area, Sally was attracted to the performing arts after seeing Marlon Brando star in the film Viva Zapata! (1952). Attending the renowned Hollywood High School as a teenager, she sang in musical productions while there, including a version of \"Meet Me in St. Louis\". Following graduation, she enrolled at Los Angeles City College but left after a year when enticed by acting guru Jeff Corey's classes. Initially inhibited by her height (5'10\"), noticeably gawky and slinky frame and wide slash of a mouth, Sally proved difficult to cast at first but finally found herself up for the lead role in Otto Preminger's \"A\"-level film Saint Joan (1957). She lost out in the end, however, when Preminger finally decided to give the role of Joan of Arc to fellow newcomer Jean Seberg. Hardly compensation, 20-year-old Sally made her film debut that same year as a girls' reformatory inmate who threatens the titular leading lady in the cult \"C\" juvenile delinquent drama Reform School Girl (1957) starring \"good girl\" Gloria Castillo and \"bad guy\" Edd Byrnes of \"777 Sunset Strip\" teen idol fame, an actor she met and was dating after attending Corey's workshops. Directed by infamous lowbudget horror film Samuel Z. Arkoff, her secondary part in the film did little in the way of advancing her career. At the same time Sally pursued a singing career, earning a recording contract with Verve Records. The 1960s was an uneventful but growing period for Kellerman, finding spurts of quirky TV roles in both comedies (\"Bachelor Father,\" \"My Three Sons,\" \"Dobie Gillis\" and \"Ozzie and Harriet\") and dramas (\"Lock Up,\" \"Surfside 6,\" \"Cheyenne,\" \"The Outer Limits,\" \"The Rogues,\" \"Slattery's People\" and the second pilot of \"Star Trek\"). Sally's sophomore film was just as campy as the first but her part was even smaller. As an ill-fated victim of the Hands of a Stranger (1962), the oft-told horror story of a concert pianist whose transplanted hands become deadly, the film came and went without much fanfare. Studying later at Los Angeles' Actors' Studio (West), Sally's roles increased toward the end of the 1960s with featured parts in more quality filming, including The Third Day (1965), The Boston Strangler (1968) (as a target for killer Tony Curtis) and The April Fools (1969). Sally's monumental break came, of course, via director Robert Altman when he hired her for, and she created a dusky-voiced sensation out of, the aggressively irritating character Major Margaret (\"Kiss My 'Hot Lips'\") Houlihan. Her highlighting naked-shower scene in the groundbreaking cinematic comedy MASH (1970) had audiences ultimately laughing and gasping at the same time. Both she and the film were a spectacular success with Sally the sole actor to earn an Oscar nomination for her marvelous work here. She shouldn't have lost but did to the overly spunky veteran Helen Hayes in Airport (1970). Becoming extremely good friends with Altman during the movie shoot, Sally went on to film a couple more of the famed director's more winning and prestigious films of the 1970s, beginning with her wildly crazed \"angelic\" role in Brewster McCloud (1970), and finishing up brilliantly as a man-hungry real estate agent in his Welcome to L.A. (1976), directed by Alan Rudolph. Sally later regretted not taking the Karen Black singing showcase role in one of Altman's best-embraced films, Nashville (1975), when originally offered. Putting out her first album, \"Roll With the Feelin'\" for Decca Records around this time (1972), Sally continued to be a quirky comedy treasure in both co-star and top supporting roles of the 1970s. She was well cast neurotically opposite Alan Arkin in the Neil Simon comedy Last of the Red Hot Lovers (1972) and again alongside ex-con James Caan as a sexy but loony delight in Slither (1973), a precursor to the Coen Bros.' darkly comic films. She also co-starred and contributed a song (\"Reflections\") to the Burt Bacharach/Hal David soundtrack of the Utopian film Lost Horizon (1973), a musical picture that proved lifeless at the box office. More impressive work came with the movies I love you, je t'aime (1979) as young Diane Lane's quirky mom; Foxes (1980) as Jodie Foster's confronting mother; Serial (1980), a California comedy satire starring Martin Mull; That's Life! (1986), a social comedy with Jack Lemmon and Julie Andrews; and Back to School (1986), comic Rodney Dangerfield's raucous vehicle hit. Kellerman's films from the 1980s on have been pretty much a mixed bag. While some, such as the low-grade Moving Violations (1985), Sale boulot (1986), The Evil Within (1993) Live Virgin (1999) and Women of the Night (2001) have been completely unworthy of her talents, her presence in others have been, at the very least, catchy such as her Natasha Fatale opposite Dave Thomas' Boris Badenov in Boris and Natasha (1992); director Percy Adlon's inventive Younger and Younger (1993), which reunited her with MASH co-star Donald Sutherland, and in Robert Altman's rather disjointed, ill-received all-star effort Ready to Wear (1994) in which she plays a fashion magazine editor. When her quality film output faltered in later years, Sally lent a fine focus back to her singing career and made a musical dent as a deep-voiced blues and jazz artist. She started hitting the Los Angeles and New York club circuits with solo acts. In 2009, Kellerman released her first album since \"Roll With The Feelin'\" simply titled \"Sally,\" a jazz and blues-fused album. Along those same lines, Sally played a nightclub singer in the comedy Limit Up (1989) and later co-starred in the movie Night Club (2011) where friends and residents start a club in a retirement home. Sally's seductively throaty voice has also put her in good standing as a voice-over artist of commercials, feature films and TV. Divorced in the 1970s from TV writer/director Rick Edelstein, Sally later married Jonathan D. Krane. She has three adopted children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEwMTgzODAyNV5BMl5BanBnXkFtZTcwMjgwNTMwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001419","name":"Sally Kellerman","idIMDB":"nm0001419"},"actorId":"nm0001419","character":"Counsellor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elliott Gould","urlProfile":"http://www.imdb.com/name/nm0001285","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzU0MTA0OV5BMl5BanBnXkFtZTcwODQ2NDM2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1938","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Elliott Goldstein","height":"6' 3\" (1.91 m)","bio":"Elliott Gould is an American actor known for his roles in MASH (1970), his Oscar-nominated performance in Bob & Carol & Ted & Alice (1969), and more recently, his portrayal of old-time con artist Reuben Tishkoff in Ocean's Eleven (2001), Ocean's Twelve (2004) and Ocean's Thirteen (2007). Gould was born Elliott Goldstein on August 29, 1938 in Brooklyn, NY, to Lucille (Raver), who sold artificial flowers, and Bernard Goldstein, a textiles buyer in the garment industry. His family were Jewish immigrants (from Romania, Belarus, and Russia). Gould's portrayal of Trapper John in Robert Altman's_MASH (1970)_ marked the beginning of perhaps the most prolific period of his career, highlighted by such roles as Philip Marlowe in Altman's The Long Goodbye (1973) and Robert Caulfield in Capricorn One (1977). On television Gould has the distinction of having hosted Saturday Night Live (1975) six times and helmed E/R (1984), a situation comedy set in Chicago about a divorced physician working in an emergency room, which aired for one season. He also co-starred in the series Nothing Is Easy (1986) about a couple raising an adopted Chinese boy. Gould appeared regularly on television and in film throughout the 1980s and the 1990s, including cameos in The Muppet Movie (1979) and The Muppets Take Manhattan (1984). His most prominent recent television role was a recurring part on Friends (1994), on which he played Monica and Ross Geller's father Jack. More recently he voiced the character of Mr. Stoppable on the Disney Channel animated series Kim Possible (2002). In film Gould received critical acclaim for his portrayal of an older mobster in Warren Beatty's Bugsy (1991), and make a noteworthy appearance in American History X (1998). His next major TV role will be in Showtime's drama Ray Donovan (2013) starring Liev Schreiber. Gould has been married three times, twice to Jennifer Bogart, and once to Barbra Streisand. He has three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzU0MTA0OV5BMl5BanBnXkFtZTcwODQ2NDM2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001285","name":"Elliott Gould","idIMDB":"nm0001285"},"actorId":"nm0001285","character":"Randy's Father","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Casper Van Dien","urlProfile":"http://www.imdb.com/name/nm0000680","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMTA2MTEzMzZeQTJeQWpwZ15BbWU4MDc4OTgzMTgx._V1_UY44_CR28,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 December 1968","placeOfBirth":" Milton, Florida, USA","birthName":"Casper Robert Van Dien Jr.","height":"5' 9¼\" (1.76 m)","bio":"Casper Van Dien's breakthrough role was as the lead in Paul Verhoeven's sci-fi film Starship Troopers (1997). Still one of the most talked about films of 1997 that has one of the largest cult followings in film history. He was also in Tim Burton's critically acclaimed film Sleepy Hollow (1999), as Brom Bones. He was the 20th Tarzan and the only one to ever film in Africa and ride an African elephant in the Warner Bros. film Tarzan and the Lost City (1998). Other film credits include The Pact (2012), which was well received at Sundance. Casper played a down and out alcoholic detective opposite Caity Lotz. A Post Apocalyptic survivor in Beyond The Wave (2015) shot entirely in China. Starring opposite Sean Maher as part of a two man crew on a mission to the end of the universe in the much anticipated independent film ISRA 88 (2016) . Television credits include \"MONK\" (2008) Playing a Navy Doctor for the season finale, and \"Beverly Hills, 90210\" (1994). Casper has tackled the web recently playing Johnny Cage in the insanely popular Machinima web-series \"Mortal Kombat Legacy\" seasons 2 and 3. He won best actor for his comedic chops in the series. He stars as \"Hawk Guy\" in the upcoming Avengers spoof \"Interns of F.I.E.L.D.\" produced by Screen Junkies. You can also check him out as the hunky bartender in the popular series \"CONMAN\" starring Alan Tudyk and Nathan Fillion. He played the perfect version of himself in the comedy series \"Crunchtime\". His most recent victory has been behind the camera as a Director. He has directed three films in which he also starred in. His second film Patient Killer won best film and best director awards and was bought and aired on Lifetime.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEyMTA2MTEzMzZeQTJeQWpwZ15BbWU4MDc4OTgzMTgx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000680","name":"Casper Van Dien","nicknames":["Van","Cap","Tarzan","Casper","Robb"],"idIMDB":"nm0000680"},"actorId":"nm0000680","character":"Randy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jacqueline Collen","urlProfile":"http://www.imdb.com/name/nm0171734","urlPhoto":"","biography":{"dateOfBirth":"27 February 1968","placeOfBirth":"","birthName":"Jacqueline Marie Collen","height":"5' 10\" (1.78 m)","bio":"Jacqueline Collen was born on February 27, 1968 as Jacqueline Marie Collen. She is an actress, known for The Adventures of Sinbad (1996), P.C.H. (1995) and Diamonds (1999). She has been married to Dean Tarrolly since March 17, 2001. They have one child. She was previously married to Phil Collen.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0171734","name":"Jacqueline Collen","idIMDB":"nm0171734"},"actorId":"nm0171734","character":"Stacey Addison","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kimberly E. Goltry","urlProfile":"http://www.imdb.com/name/nm0326690","urlPhoto":"","biography":{"bio":"Kimberly E. Goltry is an actress, known for Drive (1997) and P.C.H. (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0326690","name":"Kimberly E. Goltry","idIMDB":"nm0326690"},"actorId":"nm0326690","character":"Becky","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Catherine Lazo","urlProfile":"http://www.imdb.com/name/nm0493929","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMDg1MjYyMF5BMl5BanBnXkFtZTgwNjUzNzgzMDI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Catherine Lazo is an actress, known for East Los High (2013), Legally Blonde 2: Red, White & Blonde (2003) and Dear Diary I Died (2016).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMDg1MjYyMF5BMl5BanBnXkFtZTgwNjUzNzgzMDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0493929","name":"Catherine Lazo","idIMDB":"nm0493929"},"actorId":"nm0493929","character":"Serena Gomez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mushond Lee","urlProfile":"http://www.imdb.com/name/nm0497931","urlPhoto":"","biography":{"dateOfBirth":"17 September 1967","placeOfBirth":" North Trenton, New Jersey, USA","bio":"Mushond Lee was born on September 17, 1967 in North Trenton, New Jersey, USA. He is known for his work on Conspiracy Theory (1997), Charlie's Angels: Full Throttle (2003) and 2001 Maniacs (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0497931","name":"Mushond Lee","idIMDB":"nm0497931"},"actorId":"nm0497931","character":"Joe","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ria Pavia","urlProfile":"http://www.imdb.com/name/nm0667632","urlPhoto":"","biography":{"dateOfBirth":"8 October 1967","placeOfBirth":" Ohio, USA","bio":"Ria was born in Ohio, but doesn't remember much of the State because six months later, her family moved back to Rochester, NY. She grew up in the city that produces Kodak film and lots of snow. Next, she and her two brothers and parents relocated to South Carolina. She wasn't crazy about the pace of the South, so she opted for boarding school, attending Interlochen Arts Academy, a performing arts school in Michigan. After graduating, she moved to Los Angeles to attend UCLA as a Theater Arts Major. Soon after enrolling, she was accepted into the prestigious Screen Actors Guild not after performing Shakespeare, but by doing gymnastics in a tampon commercial. This big career break motivated her to pursue acting full time. Before long, she landed numerous roles in television shows and film. A couple of the films Ria has appeared in have won awards, including Baby Steps (winner - '99 OutFest Los Angeles, best short narrative)and Mr. October (winner - student academy award). She has also appeared in dozens of commercials, as well as performing onstage at several venues in Los Angeles and at the Aspen Comedy Festival.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0667632","name":"Ria Pavia","idIMDB":"nm0667632"},"actorId":"nm0667632","character":"Polly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ernie Reyes Jr.","urlProfile":"http://www.imdb.com/name/nm0721205","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTg0NzUwMV5BMl5BanBnXkFtZTgwMzc1MjI0NDE@._V1_UY44_CR8,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 January 1972","placeOfBirth":" San Jose, California, USA","birthName":"Ernest E. Reyes","height":"5' 5\" (1.65 m)","bio":"Ernie Reyes Jr. was born on January 15, 1972 in San Jose, California, USA as Ernest E. Reyes. He is known for his work on The Rundown (2003), Indiana Jones and the Kingdom of the Crystal Skull (2008) and Rush Hour 2 (2001). He has been married to Lisa Reyes since November 11, 2009.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyNTg0NzUwMV5BMl5BanBnXkFtZTgwMzc1MjI0NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0721205","name":"Ernie Reyes Jr.","idIMDB":"nm0721205"},"actorId":"nm0721205","character":"Koji","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gianni Russo","urlProfile":"http://www.imdb.com/name/nm0751625","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTgyMTgxODM4MV5BMl5BanBnXkFtZTcwNDg5NDYwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1943","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Louis Russo","bio":"With a singularly nebulous background, which, by his account, included stints as a Las Vegas nightclub emcee, radio personality and jewelry tycoon, and with comparatively little acting experience, Gianni Russo won the role of Carlo Rizzi in The Godfather (1972) on the basis of his screen test. Since then, Russo has remained busy as an actor, mostly playing assorted \"wiseguys\" and Mafia types. He appeared again with Marlon Brando in a small role in The Freshman (1990) where Brando parodied his Don Corleone role to good effect.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTgyMTgxODM4MV5BMl5BanBnXkFtZTcwNDg5NDYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0751625","name":"Gianni Russo","idIMDB":"nm0751625"},"actorId":"nm0751625","character":"Jake Mondello","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Anna Lobell","urlProfile":"http://www.imdb.com/name/nm0516464","urlPhoto":"","biography":{"bio":"Anna Lobell is known for her work on It Could Happen to You (1994), Striptease (1996) and Honeymoon in Vegas (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0516464","name":"Anna Lobell","idIMDB":"nm0516464"},"actorId":"nm0516464","character":"Anna","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Luciano Antonio Russo","urlProfile":"http://www.imdb.com/name/nm1551645","urlPhoto":"","biography":{"bio":"Luciano Antonio Russo is an actor, known for P.C.H. (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1551645","name":"Luciano Antonio Russo","idIMDB":"nm1551645"},"actorId":"nm1551645","character":"Johnny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marcie Smolin","urlProfile":"http://www.imdb.com/name/nm0810592","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NTc0MzkwN15BMl5BanBnXkFtZTgwODczNTcxODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"A native of Los Angeles Marcie Smolin began acting performing stand-up in the local comedy clubs at a young age. She has since become quite a successful comedian appearing on numerous television specials. She has also parlayed her gift of humor into a busy acting career with many film and television appearances.She is the host of two highly acclaimed Podcasts and is also a busy humor writer. She has received the prestigious Global journalism award for her humorous musings on today's political climate. She is also the artistic director prestigious Actors Circle, in Culver City California where she not only coaches actors but also directs and produces the film & web projects.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM2NTc0MzkwN15BMl5BanBnXkFtZTgwODczNTcxODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0810592","name":"Marcie Smolin","idIMDB":"nm0810592"},"actorId":"nm0810592","character":"Manny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dan Romero","urlProfile":"http://www.imdb.com/name/nm0739376","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk3NjgzMzAzMl5BMl5BanBnXkFtZTgwNDE1NjgwNzE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"bio":"Dan Romero is known for his work on The Revenant (2015), The Last Samurai (2003) and Crazy, Stupid, Love. (2011). He has been married to Susan Romero since September 15, 1979. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTk3NjgzMzAzMl5BMl5BanBnXkFtZTgwNDE1NjgwNzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0739376","name":"Dan Romero","idIMDB":"nm0739376"},"actorId":"nm0739376","character":"Detective Marino","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0170348","urlIMDB":"http://www.imdb.com/title/tt0170348","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 32 min (92 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"3.6","filmingLocations":[],"rated":"R","awards":[],"votes":"136","type":"TV Movie","companyCreditsSimple":[]}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 08:24:15"}}