{"data":{"movies":[{"title":"New York Cop","originalTitle":"New York Undercover Cop","year":"1993","releaseDate":"200011","directors":[{"name":"Tôru Murakawa","id":"nm0613498"}],"writers":[{"name":"Hiroshi Kashiwabara","id":"nm0440569"},{"name":"Jiro Ueno","id":"nm0879988"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNDY0MjMxOV5BMl5BanBnXkFtZTYwNzg3NjA5._V1.jpg","countries":["Japan"],"languages":["English"],"genres":["Action","Crime","Drama"],"plot":"Allegedly based on a true story, this film follows the life of Toshi, a Japanese man living in America and working with the New York City police. After being recommended for undercover work, Toshi decides to go after a gang lead by Hawk. Hawk and Toshi soon become friends, although Hawk's second-in-command, Tito, is suspicious of the newcomer. Will Toshi be able to bring the gang down, or will his cover be blown before he can finish the assignment?","simplePlot":"Allegedly based on a true story, this film follows the life of Toshi, a Japanese man living in America and working with the New York City police. After being recommended for undercover work... ","actors":[{"actorName":"Tôru Nakamura","urlProfile":"http://www.imdb.com/name/nm0620252","urlPhoto":"","biography":{"dateOfBirth":"5 September 1965","placeOfBirth":" Tokyo, Japan","height":"5' 11¾\" (1.83 m)","bio":"Tôru Nakamura was born on September 5, 1965 in Tokyo, Japan. He is an actor, known for 2009: Lost Memories (2002), Tokyo Raiders (2000) and K-20: The Fiend with Twenty Faces (2008).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0620252","name":"Tôru Nakamura","idIMDB":"nm0620252"},"actorId":"nm0620252","character":"Toshi","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chad McQueen","urlProfile":"http://www.imdb.com/name/nm0574337","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjI2NzkwOF5BMl5BanBnXkFtZTcwNTQwNTUwOA@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1960","placeOfBirth":" Los Angeles, California, USA","birthName":"Chadwick Steven McQueen","height":"5' 8½\" (1.74 m)","bio":"Chad McQueen was born on December 28, 1960 in Los Angeles, California, USA as Chadwick Steven McQueen. He is an actor and producer, known for The Karate Kid (1984), The Karate Kid Part II (1986) and Red Line (1995). He has been married to Jeanie Galbraith since December 22, 1993. They have two children. He was previously married to Stacey Toten.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyNjI2NzkwOF5BMl5BanBnXkFtZTcwNTQwNTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0574337","name":"Chad McQueen","idIMDB":"nm0574337"},"actorId":"nm0574337","character":"Hawk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mira Sorvino","urlProfile":"http://www.imdb.com/name/nm0000227","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDU1NDgwNl5BMl5BanBnXkFtZTYwNDIyOTM3._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 September 1967","placeOfBirth":" New York City, New York, USA","birthName":"Mira Katherine Sorvino","height":"5' 10\" (1.78 m)","bio":"Mira Katherine Sorvino was born on September 28, 1967 in Manhattan. She is the daughter of Lorraine Davis, an actress turned drama therapist, and veteran character actor Paul Sorvino. Her father's family were Italian immigrants. The young Sorvino was intelligent, an avid reader and an exceptional scholar. Her father discouraged her from becoming an actor, as he knew how the industry often chews up young stars. She attended Harvard, majoring in Chinese, graduating magna cum laude in 1989, largely on the strength of her thesis, a Hoopes Prize-winning thesis on racial conflict in China, written and researched during the year spent in Beijing, which helped her fluency in Mandarin Chinese. However, she showed interest in a career in acting from an early age, and moved to New York City to try her hand in the City's film industry, waitressing, auditioning and working at the Tribeca production company of Robert De Niro. She succeeded in getting a little television work in the early 1990s, but got her first film job in the independent gangster movie Amongst Friends (1993), on which she worked her way up the ladder behind the camera to eventually associate-produce the film, and, more importantly, was eventually cast as the female lead. The indie production was well-received, and Sorvino's performance attracted enough buzz to get her cast in two more movies, one a more prominent indie, Barcelona (1994), the other her first Hollywood feature, Quiz Show (1994), and her skillful performances brought her yet more attention. An exceptionally poised and articulate young woman, she may have seemed inappropriate to play a crazy hooker, but Woody Allen took the chance, and her magnificent performance as the female lead in his Mighty Aphrodite (1995) proved her range as a performer and earned her an Oscar (at the tender age of 29) for Best Supporting Actress. Since winning the Oscar, Sorvino has continued to take a wide range of roles, including another stretch as Marilyn Monroe in Norma Jean & Marilyn (1996), co-starring with another very intelligent and skilled young actress, Ashley Judd. Forays into action and horror, such as Mimic (1997) and The Replacement Killers (1998) show that Sorvino is not above being playful in the film roles she chooses. However, what forever cemented her role in popular culture was her performance as charmingly silly California beach girl Romy White in Romy and Michele's High School Reunion (1997), in which she and co-star Lisa Kudrow utter one hilarious absurdity after another. Mira Sorvino married Christopher Backus on June 11, 2004, and the couple have four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDU1NDgwNl5BMl5BanBnXkFtZTYwNDIyOTM3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000227","name":"Mira Sorvino","idIMDB":"nm0000227"},"actorId":"nm0000227","character":"Maria","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Conan Lee","urlProfile":"http://www.imdb.com/name/nm0497056","urlPhoto":"","biography":{"dateOfBirth":"1959","placeOfBirth":" Hong Kong","birthName":"Lloyd Hutchinson","bio":"Conan Lee was born in 1959 in Hong Kong as Lloyd Hutchinson. He is known for his work on Mulan (1998), Lethal Weapon 4 (1998) and Ninja in the Dragon's Den (1982).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0497056","name":"Conan Lee","idIMDB":"nm0497056"},"actorId":"nm0497056","character":"Konen Li","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Andreas Katsulas","urlProfile":"http://www.imdb.com/name/nm0441537","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzQ4MTU2Ml5BMl5BanBnXkFtZTYwOTI0NjI3._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1946","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Andrew Constantine Katsulas","height":"6' (1.83 m)","bio":"Born in St. Louis, Missouri, Andreas from a working-class Greek-American family. Attracted from early childhood to being on stage when at 4 his mother took him to see a community theater performance, he took theatre as an extra-curricular activity in high school. He then majored in it at St. Louis University, where he worked his way through school doing things like waiting on tables. Next, after earning a drama fellowship, Katsulas received a Master's Degree in Theater Arts from one of the nation's top schools for the genre, Indiana University in Bloomington, Indiana. With never a doubt or hesitation, Andreas jumped right into the professional theater world, performing in plays in his native St. Louis with the Loretto-Hilton Repertory Theater. This was followed by work with the Theatre Company of Boston. After that, Katsulas moved to New York to some challenging off-off-Broadway theater at La Mama. This was followed by a fifteen-year heart and soul involvement with Peter Brook's International Theatre Company in Paris, performing around the world with a challenging combination of improvisational theater in every imaginable circumstance and space, and \"prepared\" theater pieces in traditional, as well as unconventional, theatrical spaces. Katsulas trod the boards from Lincoln Center in New York and The Kennedy Center in Washington, D.C., to the \"mean streets\" of Brooklyn and marketplaces in remote African Villages. There were performances from elite Theater Festivals in Iran, Avignon and Belgrade: in prisons & mental institutions; at rock quarries in Australia; on barrios in Venezuela; in sewage plants in Switzerland; winding through the streets of Venice, Italy; in the fields with farm workers in California, near the lakes of Minnesota with Native Americans, in sometimes extreme conditions like snow, rain, and intensive heat. During a hiatus from the stage, a part in Michael Cimino's The Sicilian (1987) brought Andreas to Los Angeles, after which he was immediately cast as Joey Venza in Ridley Scott's Someone to Watch Over Me (1987), then as Arthur, the chauffeur, in Blake Edwards's Sunset (1988). In early 2005, Andreas was diagnosed with inoperable lung cancer; he passed away a year later, in Los Angeles. He had lived there since 1986, and had hoped to return to working in the theater before his far-too-early death, just over three months shy of his 60th birthday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzQ4MTU2Ml5BMl5BanBnXkFtZTYwOTI0NjI3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0441537","name":"Andreas Katsulas","idIMDB":"nm0441537"},"actorId":"nm0441537","character":"Ferrara","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Sirico","urlProfile":"http://www.imdb.com/name/nm0802831","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ4NDEwMTIxMl5BMl5BanBnXkFtZTYwNjg1Nzkz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1942","placeOfBirth":" Brooklyn, New York, USA","birthName":"Genaro Anthony Sirico Jr.","height":"5' 8\" (1.73 m)","bio":"Tony Sirico was born on July 29, 1942 in Brooklyn, New York, USA as Genaro Anthony Sirico Jr. He is an actor, known for The Sopranos (1999), Goodfellas (1990) and Bullets Over Broadway (1994).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzQ4NDEwMTIxMl5BMl5BanBnXkFtZTYwNjg1Nzkz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0802831","name":"Tony Sirico","nicknames":["Junior"],"idIMDB":"nm0802831"},"actorId":"nm0802831","character":"Mr. C","urlCharacter":"http://www.imdb.com/character/ch0483209","main":true},{"actorName":"Manny Perez","urlProfile":"http://www.imdb.com/name/nm0673563","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3Njc5MjI1NF5BMl5BanBnXkFtZTcwMTM4MDAzMw@@._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1969","placeOfBirth":" Baitoa, Santiago, Dominican Republic","bio":"Manny Perez is becoming one of the most recognized Latino Actors in Hollywood. He has embarked into the most pivotal steps in his career. In the past few years he has been cast from leads to co-starring roles in over a dozen films; in major and independent releases. He also won an Alma Award in 2008, for his performance in the film Bella (2006) Manny is one of eleven siblings, born in a small town in the Dominican Republic. At the age of 10, he and his family moved to Providence, Rhode Island. By the time he was done with high school, Manny knew the stage was his natural home. He moved to New York majoring in drama at Marymount Manhattan College. Manny Perez first got the industry's attention when he co-wrote, produced and starred in the critically acclaimed film Washington Heights (2002) an independent film set in his neighborhood. Manny's performance in the film garnered the praise of many film critics; The New York Times stated, \"Mr. Perez has charisma to burn.\" He won the 2002 Best Actor Award at The Milan International Film Festival in Italy for his performance in that film. His recent project La soga (2009) which had its world premiered at The Toronto International Film Festival in September of 2009 to standing ovations, sold-out shows and stellar reviews was produced, written and starred Perez. Variety stated, \"Perez, puts plenty of guts into his script and performance\". It was the first Dominican film EVER to have screened at the prestigious festival. The film was released by 7-57 Releasing and so far has made over 1 million dollars worldwide. Perez continues to write and co-write other scripts for future projects. In February of 2009, Perez co-wrote, co-produced and starred in the film titled, Forged (2010) shot completely in Scranton, PA. MAYA Entertainment will release it. He has worked with such film directors as Sidney Lumet, Arthur Penn, Spike Lee, Leon Ichaso, Mike Newell, Ed Zwick, Takeshi Kitano, Bob Giraldi, Darnell Martin, among others. With all the glitz and glamor of Hollywood, Manny has maintained loyal to his roots in the Latin community, both in the US and the Dominican Republic. He is the classic example of someone who has made the American dream happen. This kind of cavalier attitude is the reason he was honored by El Diario newspaper with the \"EL Award\", as one of the most prominent Latinos in New York. He recently received the Tony Bennett Excellence in Media Award, the Perry Ellis Humanitarian Award, and given the Key to the City from his hometown in Providence, Rhode Island. He was also honored with the Humanitarian Award in his native country of Dominican Republic for all of his charitable work during the devastation of Hurricane Noel. All of his hard working ethics and talent has brought him to such great success, which will continue to take him to greater heights as he continues his career. He has been featured in various magazines, newspapers and entertainment shows. Manny currently resides between Washington Heights, New York City and Los Angeles. Manny is also a member of the LAByrinth Theatre Company in New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3Njc5MjI1NF5BMl5BanBnXkFtZTcwMTM4MDAzMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0673563","name":"Manny Perez","idIMDB":"nm0673563"},"actorId":"nm0673563","character":"Tito","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jon Seda","urlProfile":"http://www.imdb.com/name/nm0781218","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI1MTA2MjkxM15BMl5BanBnXkFtZTcwMTcwMDg2Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 October 1970","placeOfBirth":" New York City, New York, USA","birthName":"Jonathan Seda","height":"5' 9\" (1.75 m)","bio":"Jon Seda's first passion was to be a championship boxer. After taking runner-up in the NJ Golden Gloves, the 1992 Olympics was the next goal. That's when fate stepped in; at his first audition, for Gladiator (1992), he was given a co-starring role! Since then he has branched off into numerous television and film roles. He has garnered critical acclaim for his roles in such films as I Like It Like That (1994), The Sunchaser (1996), Selena (1997), Undisputed (2002), and in television for his roles in Homicide: Life on the Street (1993), UC: Undercover (2001), Third Watch (1999), Oz (1997) and most recently his lead role as Marine Sgt. John \"Manila\" Basilone in HBO's award-winning mini series The Pacific (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI1MTA2MjkxM15BMl5BanBnXkFtZTcwMTcwMDg2Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0781218","name":"Jon Seda","idIMDB":"nm0781218"},"actorId":"nm0781218","character":"Mario","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Manny Siverio","urlProfile":"http://www.imdb.com/name/nm0803371","urlPhoto":"","biography":{"bio":"Manny Siverio is a New York based Latino Stunt Coordinator, Stuntman, 2nd Unit Director, Actor & Writer who has been involved in the film business for roughly 25 years. The eldest child of Efrain Siverio and Gladys Quintana. He was born April 23, 1960 in Brooklyn, New York and raised in Hatillo/Arecibo, Puerto Rico. Manny moved back to NY in 1980 where he began working as a health club and martial art instructor. His martial art background is the universal element which ties together all the components to his diversified career of stunt coordinating, stunt work, writing, 2nd unit directing, acting and mambo dancing. He began his martial art training in 1970 at the age of 10. Over the years he has accumulated a martial art background in Tae Kwon-Do, Boxing, Kick-Boxing, Kali, Grappling and Wing Chun. He has used his martial arts training in physical fitness, bouncing, writing, film work and dancing. He started his MCIA School of Fighting in Hatillo, Puerto Rico in the late 70s and moved it to New York City until the mid to later 80s. He is one of the few Latinos to simultaneously belong to SAG (Screen Actors Guild), DGA (Directors Guild of America) and AFTRA (American Federation of Television and Radio Artists). He was honored by both SAG & the EEOC during their 1997 Latino Recognition Night for his accomplishments; and has been featured in such publications as Cristina Magazine, Hispanic Magazine and The San Juan Star Newspaper. He has been featured on several television programs like Univision's \"Despierta America\" (Hispanic version of Good Morning America) and Latination. His standing in the industry has kept him busy working in NYC and traveling around the nation and Puerto Rico, performing, coordinating and directing stunts. Manny worked as a health club physical fitness instructor at the Jack La Lanne Clubs and as a Service Supervisor for the NY Vertical Health Club in the 1980's. He also started a successful One-On-One Martial Art Training business, became a freelance writer for the martial art magazines, author two martial art training books and a 7 tape video series on martial art training. It was this diversified background that helped him launch his film career. To this day, he has even been able to incorporate his martial art background into his mambo (salsa) dancing. Though not limited to fighting, he is highly respected in the NYC area for his fight work as both a stunt coordinator and as a stuntman. In the past, his has been hired to help prepare such actors as Michael DeLorenzo, Wesley Snipes, Grant Show, Matt Dillon, Robert Townsend and Michelle Rodriguez (Girlfight) for film fight sequences. His fight choreography has been sought after by HBO (Undefeated with John Leguizamo), Showtime (Paradise TV Pilot with Kirk Acevedo) and by Fox TV (Boxing Coordinator for Jonny Zero TV series). Manny Siverio started writing freelance articles for martial art magazines at 18 and has continued writing ever since. During his late teens to his mid-twenties he contributed to every major martial art magazine in the U.S. including Black Belt Magazine, Karate Illustrated Magazine, Inside Kug-Fu Magazine, Inside Karate Magazine and was a columnist for Combat Karate Magazine. During his tenure as a martial arts writer he authored two books for Rainbow Publications (High Intensity Martial Art Training For The Martial Artist and The Complete Guide To Focus Glove Training). He later authored and starred in a 7 tape instructional martial art video series which was produced by Panther Productions. His writing interests shifted as he became more involved in the film industry and has written several screenplays to date. He got into the WGA (Writers Guild of America) when he sold an idea to Paramount Pictures for an episode idea of Star Trek: The Next Generation. Manny Siverio started learning how to dance the New York \"On 2\" Style of Mambo (Salsa) dancing in 1995. His first dance instructors were Addie Diaz (who later became his wife) and Nelson Flores. He later moved on to a more advanced level and took lessons at both the Eddie Torres and Jimmy Anton's Dance Studios. Manny eventually became a member of the Eddie Torres \"Jammers\" where he developed the experience that has made him the dancer he is today. He was exposed to performing on several prestigious stages as a dancer for artist such as Tito Puente and Celia Cruz. He was an original cast member to the first Off-Broadway Mambo Musical: \"Latin Madness\", has performed at the 3rd Annual Congreso Mundial de La Salsa in Puerto Rico, the 1st Annual Congreso Mundial de la Salsa in New York and the 3rd Annual West Coast Salsa Congress in Los Angeles (to name a few). Manny was the first to successfully combined his martial art & stunt background with mambo dancing. He began working with the \"Latin Dance Ensemble\" where he took part in choreographing a martial arts style Mambo number (Mam-Fu in 1999) and since then has choreographed a Knifefighting mambo number (Hustler late 2000) for the Addie-Tude Dance Company. He has traveled to perform in such places at Hawaii, San Francisco, Los Angeles, Puerto Rico, Hong Kong, Japan, Switzerland, London and Paris.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0803371","name":"Manny Siverio","idIMDB":"nm0803371"},"actorId":"nm0803371","character":"Sledge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Larry Romano","urlProfile":"http://www.imdb.com/name/nm0738913","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjU5MjkwNzAtMjY4YS00NDk4LTlhNTgtZDdkZmU3ZTk3YjI3XkEyXkFqcGdeQXVyMTc5NjA4MA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 July 1963","placeOfBirth":" Mount Vernon, New York, USA","bio":"Larry Romano is an experienced actor with over 25 years' experience in television, movies, and theatre. His acting credits include \"The King of Queens,\" \"Donnie Brasco,\" \"The Thin Red Line\", \"NYPD Blue\", \"CSI, NY\", \"LA Law\" and \"Lock Up\". He has appeared on screen with many acclaimed actors, including: Al Pacino, Johnny Depp, Sean Penn, Mickey Rourke, Madonna and Sylvester Stallone. Larry's long acting career allowed him the opportunity to work with well-known director Mike Newell (\"Donnie Brasco\" and of \"Harry Potter\" fame) as well as many other award-winning directors, including: Terrence Malick (\"The Thin Red Line\") and David Fincher (the Grammy-nominated Madonna video \"Oh Father\". Larry pursued his passion for the performing arts by studying at Weist-Barron, HB Studios, and the famous Lee Strasberg Theatre Institute, all located in NYC. These highly-respected schools were responsible for launching the careers of many successful actors, including Larry, who now works in film, television and theatre. While pursuing his studies at Strasberg, Larry wrote his first play entitled \"We ain't kids no more\" which was presented under the artistic direction of Ana Strasberg. The play was a success and ultimately produced at the William Redfield Theatre in NYC and in Los Angeles at The Burbage Theatre. Drawing upon his strong background and knowledge in all aspects of film and production, Larry has written \"Saturday in the Park\" based on his original play. Larry is set to direct this play using the skills and expertise developed during his long and successful career in the performing arts.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjU5MjkwNzAtMjY4YS00NDk4LTlhNTgtZDdkZmU3ZTk3YjI3XkEyXkFqcGdeQXVyMTc5NjA4MA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0738913","name":"Larry Romano","idIMDB":"nm0738913"},"actorId":"nm0738913","character":"Emilio","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Laurence Mason","urlProfile":"http://www.imdb.com/name/nm0556808","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MTI1MzQ3OV5BMl5BanBnXkFtZTcwODYxNDMyNw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"bio":"Laurence Mason, born in the Bronx of New York, made his break into the world of the arts at 10 years old. After being recruited by All Children's Theatre, Laurence landed countless roles in Broadway and off-Broadway musicals. By his early teens, Laurence's love for the arts flourished and he enrolled in the world-famous Performing Arts High School (Fame) in NYC. Attending high school with Jennifer Aniston, and later college with Parker Posey at State University of New York at Purchase, Laurence learned alongside some of today's most talented actors. Post training, Laurence performed in a slew of productions at the Harlod Clurman Theatre and the Nuyerican Poets Café, including appearing in commercials, hip hop music videos, voice over work and even a stint on One Life to Live with rising star Ryan Phillippe. In his first feature film, True Romance (under Tony Scott), Laurence was a supporting actor to Gary Oldman and Sam Jackson. Soon after, he landed a role in The Crow with the late Brandon Lee and Hackers along with rising star, Angelina Jolie. With his cult-film status secured, Laurence ventured to the west coast to establish a mainstream following with the likes of Micheal Mann, Steven Spielberg, Will Smith and Gene Hackman. His recurring role on The Shield & Prison Break has given Laurence fans worldwide. Overall, Laurence admits working with the director Brad Furman and the heavyweight cast of Lincoln Lawyer has brought him the most pride.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3MTI1MzQ3OV5BMl5BanBnXkFtZTcwODYxNDMyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0556808","name":"Laurence Mason","idIMDB":"nm0556808"},"actorId":"nm0556808","character":"Danny Boy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eric Lutes","urlProfile":"http://www.imdb.com/name/nm0527393","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NjEzOTg1OV5BMl5BanBnXkFtZTcwMjQyOTkyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 August 1962","placeOfBirth":" Charleston, Rhode Island, USA","bio":"Born in Charlestown, Rhode Island, Eric Lutes began acting the summer before he started college when friends encouraged him to audition for a community production of \"Pajama Game\". He landed the role and was hooked. He went on to earn a Bachelor of Fine Arts in acting from the University of Rhode Island. After several commercial spots, Eric moved to New York and appeared in many off-Broadway productions before finally making the move to Los Angeles, where he landed a co-starring role on Caroline in the City (1995). He met his ex-wife, Christine Romeo, when they were cast as husband and wife in a bank commercial. Before their divorce in 2006, they resided in Los Angeles. They are the parents of Abigail Grace, who was born in May 1998.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY0NjEzOTg1OV5BMl5BanBnXkFtZTcwMjQyOTkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0527393","name":"Eric Lutes","idIMDB":"nm0527393"},"actorId":"nm0527393","character":"Powell","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vito Antuofermo","urlProfile":"http://www.imdb.com/name/nm0031610","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzODIxNTk0OF5BMl5BanBnXkFtZTcwMjAxOTUzOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 February 1953","placeOfBirth":" Palo del Colle, Apulia, Italy","bio":"Vito Antuofermo was born on February 9, 1953 in Palo del Colle, Apulia, Italy. He is an actor, known for The Godfather: Part III (1990), Goodfellas (1990) and Hell's Kitchen (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzODIxNTk0OF5BMl5BanBnXkFtZTcwMjAxOTUzOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0031610","name":"Vito Antuofermo","idIMDB":"nm0031610"},"actorId":"nm0031610","character":"Jimmy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Suzanne Tino","urlProfile":"http://www.imdb.com/name/nm0864029","urlPhoto":"","biography":{"bio":"Suzanne Tino is an actress, known for New York Cop (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0864029","name":"Suzanne Tino","idIMDB":"nm0864029"},"actorId":"nm0864029","character":"Marge","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christine Romeo","urlProfile":"http://www.imdb.com/name/nm0739221","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3NjUyNjEyMF5BMl5BanBnXkFtZTcwMjgwMDEzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Christine Romeo is an actress and producer, known for The Lost Skeleton Returns Again (2009), The Ghastly Love of Johnny X (2012) and Raw Footage (2005). She was previously married to Eric Lutes.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3NjUyNjEyMF5BMl5BanBnXkFtZTcwMjgwMDEzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0739221","name":"Christine Romeo","idIMDB":"nm0739221"},"actorId":"nm0739221","character":"Kate","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0117169","urlIMDB":"http://www.imdb.com/title/tt0117169","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 33 min (93 min) (Japan)","1 hr 28 min (88 min) (cut) (USA)"],"soundMix":["Dolby SR"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.2","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"R","awards":[],"votes":"162","type":"Movie","companyCreditsSimple":[{"idCompany":"co0021988","name":"Distant Justice Joint Venture"},{"idCompany":"co0001115","name":"S.T.P. International Inc."},{"idCompany":"co0009832","name":"TOEI & Sunstripe Pictures Inc."}],"keywords":{"keywords":["police","new york city","sex","female nudity","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:02:50"}}