{"data":{"movies":[{"title":"Two Much","originalTitle":"","year":"1996","releaseDate":"19960315","directors":[{"name":"Fernando Trueba","id":"nm0874096"}],"writers":[{"name":"Donald E. Westlake","id":"nm0922799"},{"name":"Fernando Trueba","id":"nm0874096"}],"runtime":"118 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODI2YmUyNDAtMjAyMy00ZjEzLWExMTktZWUyYjMxYWFlODEyXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1.jpg","countries":["Spain","USA"],"languages":["English"],"genres":["Comedy","Romance"],"plot":"A young gallerist is in love with two sisters at the same time. In order to solve the problem he decides to invent his own twin-brother.","simplePlot":"A young gallerist is in love with two sisters at the same time. In order to solve the problem he decides to invent his own twin-brother.","actors":[{"actorName":"Antonio Banderas","urlProfile":"http://www.imdb.com/name/nm0000104","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyOTQ3NTYyNF5BMl5BanBnXkFtZTcwMTY2NjIzNQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 August 1960","placeOfBirth":" Málaga, Málaga, Andalucía, Spain","birthName":"José Antonio Domínguez Banderas","height":"5' 8½\" (1.74 m)","bio":"Antonio Banderas, one of Spain's most famous faces, was a soccer player until breaking his foot at the age of fourteen; he is now an international film star known for playing Zorro in the eponymous film series. He was born José Antonio Domínguez Banderas on August 10, 1960, in Málaga, Andalusia, Spain. His father, Jose Dominguez, was a policeman in the Spanish civil guards. His mother, Doña Ana Banderas Gallego, was a school teacher. Young Banderas was brought up a Roman Catholic. He wanted to play soccer professionally and made much success playing for his school team until the age of 14, albeit his dream ended when he broke his foot. At that time he developed a passion for theatre after seeing the stage production of 'Hair'. Banderas began his acting studies at the School of Dramatic Art in Málaga, and made his acting debut at a small theatre in Málaga. He was arrested by the Spanish police for performance in a play by Bertolt Brecht, because of political censorship under the rule of General Francisco Franco. Banderas spent a whole night at the police station, he had three or four such arrests while he was working with a small theatre troupe that toured all over Spain and was giving performances in small town theatres and on the street. In 1979, at the age of 19, he moved to Madrid in pursuit of an acting career. Being a struggling young actor, he also worked as a waiter and took small modeling jobs. At that time he joined the troupe at the National Theatre of Spain, becoming the youngest member of the company. Banderas's stage performances caught the attention of film director Pedro Almodóvar, who cast the young actor in his film debut Labyrinth of Passion (1982). Banderas and Almodovar joined forces in making innovative and sexually provocative movies during the 1980s. In 1984 Banderas made headlines in Spain with his performance as a gay man, making his first male-to-male on-screen kiss in Almodovar's La loi du désir (1987). Banderas's long and fruitful collaboration with Pedro Almodóvar eventually prepared him for international recognition that came with his work in the Academy Award-nominated film Women on the Verge of a Nervous Breakdown (1988). In 1991 he appeared as an object of Madonna's affection in Madonna: Truth or Dare (1991). In 1992 Banderas made his Hollywood debut with Les mambo kings (1992). Because he did not speak English at that time, his dialogue for the film was taught to him phonetically. Banderas shot to international fame with his sensitive performance as a lover of Tom Hanks' AIDS-infected lawyer in Philadelphia (1993), then played opposite Tom Cruise and Brad Pitt in Interview with the Vampire: The Vampire Chronicles (1994). Banderas further established himself as one of Hollywood's leading men after co-starring in Evita (1996) opposite Madonna in the title role. In 1998 he won acclaim for his portrayal of Zorro, opposite Anthony Hopkins and Catherine Zeta-Jones, in The Mask of Zorro (1998). For the role as Zorro Banderas took training with the Olympic national fencing team in Spain, and practiced his moves with real steel swords, then he used the lighter aluminum swords in the movie. He also took a month-long course of horse-riding before the filming. He later returned to the role in The Legend of Zorro (2005). In 1999 Banderas made his directorial debut in La tête dans le carton à chapeaux (1999), starring his wife, Melanie Griffith. He received critical acclaim for his portrayal of Mexican artist David Alfaro Siqueiros opposite Salma Hayek in Frida (2002). He voiced Puss in Boots in the Shrek franchise. Banderas established himself as internationally known Latin heartthrob with charismatic looks, and was chosen as one of the 50 most beautiful people in the world by the People magazine in 1996. He won numerous awards and nominations for his works in film, including three ALMA awards and three Golden Globe nominations, among many other. From 1996 to 2014, Banderas was married to American actress Melanie Griffith and the couple have one daughter Stella born in 1996. Outside of his acting profession, Banderas has been a passionate soccer fan and a staunch supporter of the Real Madrid Football Club. He shares time between his two residencies, one is in the United States, and one in the South of Spain.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyOTQ3NTYyNF5BMl5BanBnXkFtZTcwMTY2NjIzNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000104","name":"Antonio Banderas","idIMDB":"nm0000104"},"actorId":"nm0000104","character":"Art","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Melanie Griffith","urlProfile":"http://www.imdb.com/name/nm0000429","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwODc4NTgxOV5BMl5BanBnXkFtZTcwNzgyNjY0MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 August 1957","placeOfBirth":" New York City, New York, USA","birthName":"Melanie Richards Griffith","height":"5' 9¼\" (1.76 m)","bio":"Melanie Griffith was born on August 9, 1957 in New York City, to then model/future actress Tippi Hedren and former child actor turned advertising executive Peter Griffith. Her parents' marriage ended in 1961 and Tippi brought Melanie to Los Angeles to get a new start. Tippi caught the eye of the great director Alfred Hitchcock, who gave her starring roles in The Birds (1963) and Marnie (1964). She married her then-agent, Noel Marshall, in 1964 (they divorced in 1982), and Melanie grew up with three stepbrothers. Meanwhile, her father married Nanita Greene Samuels and had two more children: Tracy Griffith and Clay A. Griffith. Melanie also grew up with tigers and lions, as Tippi and Noel were raising them for the movie Roar (1981), in which the family later starred. Melanie's acting career, however, began as a model at just nine months old in a commercial and she later appeared as an extra in Smith! (1969) and The Harrad Experiment (1973), where she fell in love with her mother's co-star, Don Johnson. She was only 14 years old, while he was a twice-divorced 22-year-old. Tippi took a very liberal approach and allowed Melanie to move in with Don at a tender age. Even though Melanie didn't like modeling, she continued to do it to pay the bills. One day she went to meet with director Arthur Penn for what she thought was a modeling assignment. It was actually an audition for his film Night Moves (1975), and Penn gave her the role of a runaway nymphet. She was hesitant, but Johnson encouraged her to take the role. She agreed but was terrified of performing in front of the camera. Penn took a paternal interest in her, and she felt confident and gave a riveting performance, doing racy nude scenes. It immediately typecast her and led to more nymphet roles, with her beautiful nude body a permanent fixture in movies like Ha-Gan (1977) and Joyride (1977). She also married Johnson, in Las Vegas in 1976, but the union ended within six months, possibly because her early movie success outshone his. Unfortunately, as her career progressed, she became increasingly dependent on drugs and alcohol, a fact well-known to studio executives, who stopped considering her for feature film roles. She started doing television work, where she met her second husband, Steven Bauer, on the set of the TV movie She's in the Army Now (1981). He helped her to overcome her drug and alcohol problems and got her to take acting classes with Stella Adler in New York. The classes paid off, as director Brian De Palma cast her as a porno actress in his murder mystery Body Double (1984) and her sexy, funny performance won her rave reviews and the Best Supporting Actress Award by the National Society of Film Critics and a Golden Globe nomination. Jonathan Demme was so impressed with her performance that he gave her the female lead in Something Wild (1986) without even auditioning her. The film became a cult favorite, with Melanie again getting critical plaudits and a Golden Globe nomination. The birth of her first child, Alexander, in 1985, didn't help to save her struggling marriage, and she and Bauer divorced shortly thereafter. She was given starring roles in Cherry 2000 (1987) and Stormy Monday (1988), but the films were barely released. Soon writers were asking when the public at large was going to take notice of this talented and unique actress. Melanie's career skyrocketed when Mike Nichols cast her as a spunky secretary named Tess McGill in Working Girl (1988), a box-office hit for which she received an Oscar nomination as Best Actress and won the Golden Globe Award as Best Actress in a Comedy. Behind the scenes, however, her ongoing substance abuse had become problematic, and Nichols pushed her into a rehabilitation clinic after production wrapped. En route to the clinic she called ex-husband Johnson for support, and they reconciled after her release from the clinic. She got pregnant and remarried Johnson in 1989, and later that year their daughter Dakota Johnson was born. A sober Melanie now concentrated on her film career, but the two-year absence after Working Girl (1988) took a toll, since younger actresses (Julia Roberts, Michelle Pfeiffer, Demi Moore, Meg Ryan, Jodie Foster(to whom Melanie lost the Oscar to)) became bankable stars, and there was stiff competition for the good roles. The films Melanie chose usually flopped badly, such as The Bonfire of the Vanities (1990), which reunited her with director Brian De Palma. Even though she gave heartfelt performances in all her films, she was often miscast, with her breathy little-girl voice not helping matters in her role as a spy in Shining Through (1992) and as a homicide detective going undercover in the Hassidic Jewish community in New York City in A Stranger Among Us (1992). Melanie made a minor comeback with her supporting role as a desperate housewife in Nobody's Fool (1994), which reunited her with Bruce Willis, her co-star in The Bonfire of the Vanities (1990), and Paul Newman, her co-star from The Drowning Pool (1975). She also earned a Golden Globe nomination for her work in the well-received TV miniseries Buffalo Girls (1995), followed by another hit film, the ensemble Now and Then (1995). Her personal life was making headlines again, though, as she left Johnson because of his own substance-abuse problems, reconciled with him briefly when he became sober, only to leave him again, this time for Antonio Banderas, her married co-star from Two Much (1996). Both she and Banderas created a scandal in 1995 with their torrid romance, and the tabloids followed their every move, including her divorce from Johnson and his divorce from wife Ana Leza. Melanie became pregnant with her third child, and she and Banderas married in 1996. Their daughter Stella Banderas was born the same year, and the notorious couple were forgiven by the public and the media. Melanie won strong reviews in independent films like Another Day in Paradise (1998), where she played a heroin-using criminal accomplice on the run, and the made-for-cable movie RKO 281 (1999), in which she portrayed actress Marion Davies, a part that garnered her Golden Globe and Emmy nominations as Best Supporting Actress. Melanie became dependent to pain killers, however, returning to rehab in 2000. She wrote about her struggle and recovery in her journal on her official website. Greenmoon Productions, the production company that she formed with Banderas, produced several flops, such as her starring vehicle La tête dans le carton à chapeaux (1999), directed by Banderas. Her career took another blow when her TV series, Me & George (1998), never even aired. After making Cecil B. Demented (2000) and Coup de foudre pour toujours (2000), Melanie did a voice-over role in Stuart Little 2 (2002) and played supporting roles in minor films Tempo (2003), as Sylvester Stallone's girlfriend in Shade (2003), and as Barbara Marx in The Night We Called It a Day (2003) with Dennis Hopper playing Frank Sinatra, but none of these films made a ripple at the box office. As a result, film and television offers started to dry up. In 2003, a resourceful Melanie turned to the Broadway stage, and packed houses with her turn as the murderess \"Roxie Hart\" in the musical \"Chicago,\" for which she received a rave review from the New York Times theater critic. It renewed her confidence, as she had never sang, danced or been on the Broadway stage before. In 2005 she surprised viewers by playing a mom to two grown women in the TV series Twins (2005), which was canceled after one season. She tried to resurrect her career with another attempt at a TV series, Viva Laughlin (2007), but it was canceled after just two episodes. Melanie didn't act again for the remainder of the decade, because, by self-admission, she couldn't obtain any worthwhile roles. In 2009, she was back in rehab after yet another relapse, emerging after a three-month stay. Professionally, she was faced with more disappointment in 2012 when This American Housewife (2012), a Lifetime series that Banderas produced for her to star in, never aired. She went back to the stage in 2012 and played Scott Caan's mother in a play that he wrote titled \"No Way Around but Through.\" She impressed Caan enough to recommend her to producers of his television show Hawaii Five-0 (2010). Since 2014, she started playing a recurring role as his mother on the show. Also in 2014, Melanie filed for divorce from Banderas citing \"irreconcilable differences\" after nearly twenty years together. She never publicly discussed her reasons for the divorce, and she didn't promote her feature film Automata (2014), the final time that she acted with Banderas. It took a year for the divorce to be finalized, during which time, she and Banderas made one important appearance together at their daughter Stella's high school graduation. She also made another public appearance with another ex-husband, Don Johnson, on Saturday Night Live (1975) to support their daughter Dakota, who was the host for that week. Dakota was promoting her star-making turn in Fifty Shades of Grey (2015), thus carrying on the family tradition of being a film actress. Melanie maintains close ties with her three children and her mother Tippi Hedren. She is involved in various charities, including raising funds for Tippi's Shambala preserve, a refuge for wild animals. Melanie also runs a non-profit organization for benefiting burned children. Melanie is single and her children are living on their own. So she has devoted most of her time seeking out acting roles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwODc4NTgxOV5BMl5BanBnXkFtZTcwNzgyNjY0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000429","name":"Melanie Griffith","idIMDB":"nm0000429"},"actorId":"nm0000429","character":"Betty","urlCharacter":"http://www.imdb.com/character/ch0298820","main":true},{"actorName":"Daryl Hannah","urlProfile":"http://www.imdb.com/name/nm0000435","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MjUyMzMxOF5BMl5BanBnXkFtZTcwNjEzNjI5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1960","placeOfBirth":" Chicago, Illinois, USA","birthName":"Daryl Christine Hannah","height":"5' 10\" (1.78 m)","bio":"Daryl Christine Hannah was born and raised in Chicago, Illinois. She is the daughter of Susan Jeanne (Metzger), a schoolteacher and later a producer, and Donald Christian Hannah, who owned a tugboat/barge company. Her stepfather was music journalist/promoter Jerrold Wexler. Her siblings are Page Hannah, Don Hannah and Tanya Wexler. She has Norwegian, Scottish, Irish, English, and German ancestry. Daryl graduated from the University of Southern California School of Theatre. She practiced ballet with Maria Tallchief and studied drama at Chicago's Goodman Theatre. In her twenties, she played keyboard and sang backup for Jackson Browne. Hannah, a tall (5' 10\") blond beauty, with haunting blue-green eyes, was a natural for show biz. She started with small roles, such as a student in The Fury (1978) and as Kim Basinger's kid sister in Hard Country (1981). Daryl's breakout role was as the acrobatic, beautiful replicant punk android Pris in Blade Runner (1982); Pris was the vixen who wanted to live beyond her allotted years and risked the wrath of the title character. Showing her versatility, from there she portrayed a mermaid, Madison, who falls in love with Tom Hanks's character in Ron Howard's zany comedy Splash (1984), and a Cro-Magnon in The Clan of the Cave Bear (1986). Hannah played Roxanne in the eponymous Steve Martins contemporary take on the Cyrano de Bergerac story, and co-starred as Elle Driver in Quintin Tarantino's box office hit Kill Bill: Vol. 2 (2004). Hannah has been a consistent, strong supporter of independent cinema, both acting in and producing many films, starring in such indie films as John Sayles's Casa de los babys (2003) as well as his political satire Silver City (2004). She worked on several films with the revered Robert Altman, including The Gingerbread Man (1998), as well as several films with the Polish Brothers including Northfork (2003) and Jackpot (2001). Daryl starred in the experimental improvised Michael Radford film Dancing at the Blue Iguana (2000) and made As a filmmaker, Hannah wrote, directed, and produced an award winning short film, entitled The Last Supper (1995). Hannah also directed, produced and shot the documentary Strip Notes (2002) which was inspired while researching her role for Dancing at the Blue Iguana (2000) that was shown on HBO and UK's Channel 4. Daryl is in the process of shooting a documentary on Human Trafficking and has traveled undercover to South East Asia to document this atrocity and has become and advocates raising awareness and ending slavery. She has made over 40 video blogs for various websites including her popular dhlovelife.com. She designed dhlovelife.com (online since 2005) her website dedicated to sharing solutions on how to live more harmoniously with the planet and all other living things. Daryl has been passionate, committed and effective advocate for a more ethical relationship with each other and all life on the Planet. She has produced, hosted and shot numerous environmental awareness/ health documentaries, TV appearances and is a frequent speaker on both the conservative and progressive news. Hannah has been a greening consultant for events such as the Virgin Music Festival, attended by over 150,000 people. Her many speaking engagements include keynote speeches at the UN Climate Change Summit, UN Global Business Conference on the environment,, Natural and Organic Products Expo, LOHAS and numerous national and international universities, conferences and events. She has written articles on self sufficiency and sustainability for many magazines and has done a plethora of interviews on the topic in thousands of publications. The site features weekly five-minute inspirational video blogs which Daryl produces and films. There are daily news updates, alerts, community and access to goods and services. She is a member of the World Future Council, sits on the boards of the Sylvia Earle Alliance, Mission Blue, Eco America, Environmental Media Association (EMA), The Somaly Mam Foundation, and the Action Sports Environmental Coalition, She is the founder of the Sustainable Biodiesel Alliance (SBA).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MjUyMzMxOF5BMl5BanBnXkFtZTcwNjEzNjI5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000435","name":"Daryl Hannah","idIMDB":"nm0000435"},"actorId":"nm0000435","character":"Liz","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Danny Aiello","urlProfile":"http://www.imdb.com/name/nm0000732","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTMxMjYzNzk5Nl5BMl5BanBnXkFtZTcwNzU4NDgwMw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 June 1933","placeOfBirth":" New York City, New York, USA","birthName":"Daniel Louis Aiello Jr.","height":"6' 2½\" (1.89 m)","bio":"Danny Aiello was born on June 20, 1933 in New York City, New York, USA as Daniel Louis Aiello Jr. He is an actor and producer, known for Léon: The Professional (1994), Do the Right Thing (1989) and Il était une fois en Amérique (1984). He has been married to Sandy Cohen since January 8, 1955. They have four children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTMxMjYzNzk5Nl5BMl5BanBnXkFtZTcwNzU4NDgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000732","name":"Danny Aiello","idIMDB":"nm0000732"},"actorId":"nm0000732","character":"Gene","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joan Cusack","urlProfile":"http://www.imdb.com/name/nm0000349","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMTAxMjQzMV5BMl5BanBnXkFtZTYwMzU1OTE1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 October 1962","placeOfBirth":" New York City, New York, USA","birthName":"Joan Mary Cusack","height":"5' 9\" (1.75 m)","bio":"Actress Joan Cusack was born in New York City, New York, and is the daughter of Nancy (née Carolan) and Dick Cusack. Her father was an advertising executive, writer and actor, and her mother was a math teacher. Her siblings - Susie Cusack, John Cusack, Ann Cusack and Bill Cusack also act. Her family is of Irish descent. Raised in Illinois, Cusack was actively encouraged to explore her creativity by her parents, and as a child she joined the Piven Theater Workshop. She went on to learn and perform improvisation at the Story Theater and The Ark. Later she attended the University of Wisconsin-Madison, graduating with a bachelor's degree in English. Whilst at university, Cusack took some small film roles, but her big break came after graduation, when she joined the cast of the legendary \"Saturday Night Live\". However, she only stayed for a season before moving on to explore other projects. In 1987, she produced a memorable turn in the acclaimed Broadcast News (1987), and she was Oscar nominated for her performance in Working Girl (1988). Other notable films include Addams Family Values (1993), Grosse Pointe Blank (1997) and In & Out (1997), which earned her a second Oscar nomination. She also provided, superbly, the voice of Jessie the Yodeling Cowgirl in Toy Story 2 (1999) and Toy Story 3 (2010). On television she scored a role on \"Shameless\", with her work garnering her an Emmy nomination. Joan Cusack is married to an attorney, Dick Burke. They have two sons - Dylan and Miles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzMTAxMjQzMV5BMl5BanBnXkFtZTYwMzU1OTE1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000349","name":"Joan Cusack","idIMDB":"nm0000349"},"actorId":"nm0000349","character":"Gloria","urlCharacter":"http://www.imdb.com/character/ch0076927","main":true},{"actorName":"Eli Wallach","urlProfile":"http://www.imdb.com/name/nm0908919","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4OTM3ODQ5MF5BMl5BanBnXkFtZTgwMzE3OTcwMjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 December 1915","placeOfBirth":" Red Hook, Brooklyn, New York City, New York, USA","birthName":"Eli Herschel Wallach","height":"5' 10\" (1.78 m)","bio":"One of Hollywood's finest character / \"Method\" actors, Eli Wallach was in demand for over 60 years (first film/TV role was 1949) on stage and screen, and has worked alongside the world's biggest stars, including Clark Gable, Clint Eastwood, Steve McQueen, Marilyn Monroe, Yul Brynner, Peter O'Toole, and Al Pacino, to name but a few. Wallach was born on 7 December 1915 in Brooklyn, NY, to Jewish parents who emigrated from Poland, and was one of the few Jewish kids in his mostly Italian neighborhood. His parents, Bertha (Schorr) and Abraham Wallach, owned a candy store, Bertha's Candy Store. He went on to graduate with a B.A. from the University of Texas in Austin, but gained his dramatic training with the Actors Studio and the Neighborhood Playhouse. He made his debut on Broadway in 1945, and won a Tony Award in 1951 for portraying Alvaro Mangiacavallo in the Tennessee Williams play \"The Rose Tattoo\". Wallach made a strong screen debut in 1956 in the film version of the Tennessee Williams play Baby Doll (1956), shined as \"Dancer\", the nattily dressed hitman, in director Don Siegel's film-noir classic The Lineup (1958), and co-starred in the heist film Seven Thieves (1960). Director John Sturges then cast Wallach as vicious Mexican bandit Calvera in The Magnificent Seven (1960), the western adaptation of the Akira Kurosawa epic Seven Samurai (1954). By all reports, Wallach could not ride a horse prior to making \"TMS\", but expert tutelage from the film's Mexican stunt riders made it look easy! He next appeared in the superb The Misfits (1961), in the star-spangled western opus How the West Was Won (1962), the underrated WW2 film The Victors (1963), as a kidnapper in The Moon-Spinners (1964), in the sea epic Lord Jim (1965) and in the romantic comedy How to Steal a Million (1966). Looking for a third lead actor in the final episode of the \"Dollars Trilogy\", Italian director Sergio Leone cast the versatile Wallach as the lying, two-faced, money-hungry (but somehow lovable) bandit \"Tuco\" in the spectacular The Good, the Bad and the Ugly (1966) (aka \"The Good, The Bad and The Ugly\"), arguably his most memorable performance. Wallach kept busy throughout the remainder of the '60s and into the '70s with good roles in Mackenna's Gold (1969), Cinderella Liberty (1973), Jo le fou (1974), The Deep (1977) and as Steve McQueen's bail buddy in The Hunter (1980). The 1980s was an interesting period for Wallach, as he was regularly cast as an aging doctor, a Mafia figure or an over-the-hill hitman, such as in The Executioner's Song (1982), Our Family Honor (1985), Tough Guys (1986), Nuts (1987), The Two Jakes (1990) and as the candy-addicted \"Don Altabello\" in The Godfather: Part III (1990). At 75+ years of age, Wallach's quality of work was still first class and into the 1990s and beyond, he has remained in demand. He lent fine support to Bride of Violence (1990), Teamster Boss: The Jackie Presser Story (1992), Naked City: Justice with a Bullet (1998) and Keeping the Faith (2000). Most recently Wallach showed up as a fast-talking liquor store owner in Mystic River (2003) and in the comedic drama King of the Corner (2004). In early 2005, Eli Wallach released his much anticipated autobiography, \"The Good, The Bad And Me: In My Anecdotage\", an enjoyable reading from one of the screen's most inventive and enduring actors. Eli Wallach was very much a family man who remained married to his wife Anne Jackson for 66 years. When Wallach died at 98, in 2014, in Manhattan, NY, he was survived by his wife, three children, five grandchildren and several great-grandchildren.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4OTM3ODQ5MF5BMl5BanBnXkFtZTgwMzE3OTcwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0908919","name":"Eli Wallach","idIMDB":"nm0908919"},"actorId":"nm0908919","character":"Sheldon","urlCharacter":"http://www.imdb.com/character/ch0043978","main":true},{"actorName":"Gabino Diego","urlProfile":"http://www.imdb.com/name/nm0225916","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWFjMGRmOWYtM2E5Ny00OTViLWJiNWYtN2FjZmE0MTY4NGE1XkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 September 1966","placeOfBirth":" Madrid, Madrid, Spain","birthName":"Gabino Diego Solís","bio":"Gabino Diego was born on September 18, 1966 in Madrid, Madrid, Spain as Gabino Diego Solís. He is an actor and writer, known for Belle Epoque (1992), ¡Ay, Carmela! (1990) and Torrente 2: Mission in Marbella (2001).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWFjMGRmOWYtM2E5Ny00OTViLWJiNWYtN2FjZmE0MTY4NGE1XkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0225916","name":"Gabino Diego","idIMDB":"nm0225916"},"actorId":"nm0225916","character":"Manny","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Austin Pendleton","urlProfile":"http://www.imdb.com/name/nm0671721","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMzY4NjY1MzNeQTJeQWpwZ15BbWU3MDIzNjIzNjI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 March 1940","placeOfBirth":" Warren, Ohio, USA","bio":"Actor Austin Pendleton was born March 27, 1940 in Warren, Ohio to Frances and Thorn Pendleton. He graduated from Yale University. He later became an ensemble member of the Steppenwolf Theater in Chicago, and acted in several of the theater's productions. His first film appearance in Petulia (1968), a minor and uncredited role. Since, he has made over 100 appearances in television and film.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxMzY4NjY1MzNeQTJeQWpwZ15BbWU3MDIzNjIzNjI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0671721","name":"Austin Pendleton","idIMDB":"nm0671721"},"actorId":"nm0671721","character":"Dr. Huffeyer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Allan Rich","urlProfile":"http://www.imdb.com/name/nm0723590","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTY5Mjg5NV5BMl5BanBnXkFtZTcwNjMyOTAzMQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 February 1926","placeOfBirth":" The Bronx, New York, USA","birthName":"Benjamin Norman Schultz","bio":"Allan Rich is one of the busiest and most recognizable character actors, in Hollywood today, working in all arenas - stage, film and on the small screen. So far, in 2006, Allan has been featured in \"My Sexiest Year,\" opposite Frances Fisher and Frankie Muniz, and been interviewed for the documentary \"Troupers.\" Last year he appeared in three soon to be released features. \"Rise\" with Lucy Liu and Michael Chiklis, \"Lies & Alibis\" with Steve Coogan and Rebecca Romijn, and \"The Man in the Chair,\" with Christopher Plummer. Recent Independent features include \"The Burial Society\" with David Paymer, \"The Dog Walker,\" and \"Intoxicating\" with John Savage. Other feature film credits include Steven Speilberg's \"Amistad,\" \"Disclosure\" (as Demi Moore's attorney), and Robert Redford's \"Quiz Show.\" Critic Gary Franklin hailed his performance as Robert Kintner, President of NBC, `one of the Top Five of the Year.' Additional notable performances include the role of Dr. Belfonte, opposite Robin Williams in \"Jack,\" and Bill Adolphe (Halle Berry's lawyer) in \"A Rich Man's Wife.\" Recent television credits include \"Curb Your Enthusiasm\" as a holocaust `Survivor,' \"Living With Fran,\" \"NYPD Blue,\" \"Judging Amy,\" \"CSI,\" and \"The Division.\" Allan began his distinguished acting career as a teenager in New York, working with immortals such as Edward G. Robinson, Claude Raines, Ralph Bellamy, Jack Palance, Kim Hunter, Milton Berle, and Henry Fonda. He was enjoying the fruits of his labor until, without warning, his dreams were shattered when the McCarthy Era fell upon the nation and Allan was caught up in the `Red Scare' and blacklisted. With no income, a family to support and with little training outside of the acting profession, Rich cajoled his way onto Wall Street. After five years of buying and selling, he decided to open his own brokerage firm and with fervor, began to collect fine art. With the same drive and determination to master yet another field of endeavor, he soon became an expert in modern art, opening Allan Rich Galleries on Madison Avenue, where he began selling major paintings to important collectors and publishing lithographs of Miro, Calder, and Salvador Dali. His experience with Dali, in 1970, led him to co-write a screenplay \"Memories of Surrealism.\" Despite his enormous success outside of the entertainment field, Rich, separated from his professional passion, returned to the stage in Ron Ribman's \"Journey of the Fifth Horse,\" with a young Dustin Hoffman. He re-launched his film career in 1973 playing the D.A. in \"Serpico\" with Al Pacino. One of his main scenes was shown on the Academy Awards. Rich took out ads in the trades and received one call from John Crosby at ICM, who helped reestablished his reputation and went on to appear in more than 75 television shows, MOWs and 68 features that also include \"Frances, \"Eating Raoul,\" and \"Guilty By Suspicion.\" After years of teaching, Allan has developed his own acting technique, his book A Leap From the Method will be published this fall by Author House. Some of his more famous students include Sharon Stone, Jamie Lee Curtis, Rene Russo, Donna Dixon, Jack Scalia, Alan Thicke and Larry Miller. In addition, in 1994, Rich co-founded We Care About Kids, a non-profit organization that produces live action educational short films for middle and high school youths on socially relevant topics and has received praise for its efforts from President Clinton, Senator Diane Feinstein, former Speaker of the House, Richard Gephardt, former Governor Gray Davis and poet Maya Angelou. The organization is currently raising money for a new film on child abuse entitled \"In the Room.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM3OTY5Mjg5NV5BMl5BanBnXkFtZTcwNjMyOTAzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0723590","name":"Allan Rich","idIMDB":"nm0723590"},"actorId":"nm0723590","character":"Reverend Larrabee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Vincent Schiavelli","urlProfile":"http://www.imdb.com/name/nm0001704","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MzA5OTY2M15BMl5BanBnXkFtZTYwODMwMjk1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 November 1948","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Vincent Andrew Schiavelli","height":"6' 5\" (1.96 m)","bio":"Vincent Schiavelli, selected in 1997 by Vanity Fair as one of the best character actors in America, had made over 120 film and television appearances. He studied acting at NYU's Theatre Program. Aside from his acting career, Vincent was the author of three cookbooks, and has written numerous articles on food for magazines and newspapers. In 2001, he received the James Beard Journalism Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MzA5OTY2M15BMl5BanBnXkFtZTYwODMwMjk1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001704","name":"Vincent Schiavelli","nicknames":["The Man with the Sad Eyes"],"idIMDB":"nm0001704"},"actorId":"nm0001704","character":"Sommelier","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Phil Leeds","urlProfile":"http://www.imdb.com/name/nm0498609","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY4MTA0ODc1OF5BMl5BanBnXkFtZTcwMzQ3MzYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 April 1916","placeOfBirth":" New York City, New York, USA","height":"5' 6\" (1.68 m)","bio":"Phil Leeds is one of those for whom the phrase \"character actor\" was invented. A slight, wizened man with a rubbery face, bulging eyes and a Jimmy Durante-like nose, he excelled at playing weaselly little snitches, con artists, or just a neighborhood eccentric who always had something up his sleeve. Born in New York, his entrance into the \"entertainment\" business began with a job as a peanut vendor at the city's baseball stadiums, and from there, he began a stint as a stand-up comic in the \"Borscht Belt\" up in the Catskill Mountains, opening for many of the top acts of the day. He had a short career on the Broadway stage before entering the army during World War II, and upon his discharge, he resumed his stand-up career. Unfortunately, he got caught up in the McCarthy-era, anti-Communism hysteria in the early 1950s and found himself among many entertainers who were blacklisted, and it took him a while to work out of that. He appeared in his first film in 1969, a comedy, and from there on, his career was set. He had small roles in a good number of films, but he did a huge amount of television work starting in the mid-'50s, appearing in everything from sitcoms to westerns to cop shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjY4MTA0ODc1OF5BMl5BanBnXkFtZTcwMzQ3MzYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0498609","name":"Phil Leeds","idIMDB":"nm0498609"},"actorId":"nm0498609","character":"The Lincoln Brigade","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Sid Raymond","urlProfile":"http://www.imdb.com/name/nm0713367","urlPhoto":"","biography":{"dateOfBirth":"21 January 1909","placeOfBirth":" New York City, New York, USA","birthName":"Raymond Silverstein","bio":"Sid Raymond was born on January 21, 1909 in New York City, New York, USA as Raymond Silverstein. He was an actor, known for Two Much (1996), The Baby Huey Show (1994) and The Funhouse (1981). He was married to Dorothy Naftel. He died on December 1, 2006 in Aventura, Florida, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0713367","name":"Sid Raymond","idIMDB":"nm0713367"},"actorId":"nm0713367","character":"The Lincoln Brigade","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Louis Seeger Crume","urlProfile":"http://www.imdb.com/name/nm0190064","urlPhoto":"","biography":{"bio":"Louis Seeger Crume is an actor, known for Striptease (1996), Flipper (1996) and Two Much (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0190064","name":"Louis Seeger Crume","idIMDB":"nm0190064"},"actorId":"nm0190064","character":"The Lincoln Brigade","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jeff Moldovan","urlProfile":"http://www.imdb.com/name/nm0539278","urlPhoto":"","biography":{"dateOfBirth":"22 April 1953","placeOfBirth":"","bio":"Jeff Moldovan was born on April 22, 1953. He is known for his work on The Patriot (2000), Le transporteur II (2005) and The Punisher (2004). He died on August 22, 2013 in Caracas, Venezuela.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0539278","name":"Jeff Moldovan","idIMDB":"nm0539278"},"actorId":"nm0539278","character":"Goon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joe Hess","urlProfile":"http://www.imdb.com/name/nm0381483","urlPhoto":"","biography":{"dateOfBirth":"21 February 1945","placeOfBirth":" philadelphia, Pennsylvania, USA","height":"6' 2\" (1.88 m)","bio":"Joe Hess was born on February 21, 1945 in philadelphia, Pennsylvania, USA. He is known for his work on The Bodyguard (1992), Out of Sight (1998) and Hannibal (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0381483","name":"Joe Hess","idIMDB":"nm0381483"},"actorId":"nm0381483","character":"Goon","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0118001","urlIMDB":"http://www.imdb.com/title/tt0118001","business":{"budget":null,"openingWeekend":[{"money":"€991,000","country":"Spain","day":"31","month":"12","year":"1996","remarks":"100 Screens"}],"gross":[{"money":"$9,186,683","country":"Spain","day":"30","month":"04","year":"1996","remarks":""},{"money":"€6,951,104 (Spain)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1996/\">1996</a>"},{"money":"13,228","country":"Netherlands","day":"01","month":"01","year":"1997","remarks":""},{"money":"38,762","country":"Portugal","day":"05","month":"06","year":"1996","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1995/\">1995</a>"},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1995/\">1995</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 58 min (118 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["2.35 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"5.4","filmingLocations":[{"location":"Bahamas"}],"rated":"PG-13","awards":[{"award":"Fotogramas de Plata 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Fotogramas de Plata","categories":[{"category":"Best Movie Actor (Mejor Actor de Cine)","names":[{"name":"Antonio Banderas","id":"nm0000104","role":null}]}]}]},{"award":"Goya Awards 1997","titlesAwards":[{"titleAwardOutcome":"Nominated Goya","categories":[{"category":"Best Lead Actor (Mejor Actor Protagonista)","names":[{"name":"Antonio Banderas","id":"nm0000104","role":null}]}]}]},{"award":"Razzie Awards 1997","titlesAwards":[{"titleAwardOutcome":"Nominated Razzie Award","categories":[{"category":"Worst Actress","names":[{"name":"Melanie Griffith","id":"nm0000429","role":null}]},{"category":"Worst Supporting Actress","names":[{"name":"Daryl Hannah","id":"nm0000435","role":null}]}]}]},{"award":"The Stinkers Bad Movie Awards 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Stinker Award","categories":[{"category":"Worst Supporting Actress","names":[{"name":"Melanie Griffith","id":"nm0000429","role":null},{"name":"Mulholland Falls","id":"tt0117107","role":null}]}]}]}],"votes":"4,630","type":"Movie","companyCreditsSimple":[{"idCompany":"co0081420","name":"Fernando Trueba Producciones Cinematográficas"},{"idCompany":"co0031772","name":"Interscope Communications"},{"idCompany":"co0009576","name":"Lolafilms"}],"keywords":{"keywords":["fictional twin","wedding","sister sister relationship","poker game","painting","miami florida","heiress","funeral crasher","father son relationship","ex husband ex wife relationship","disguise","art gallery","remake of french film","screwball","based on novel","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 09:13:36"}}