{"data":{"movies":[{"title":"The Perfect Crime","originalTitle":"","year":"1955","directors":[{"name":"Robert Altman","id":"nm0000265"}],"writers":[{"name":"Robert Altman","id":"nm0000265"}],"runtime":"20 min","countries":["USA"],"languages":["English"],"genres":["Short"],"plot":"In this short National Safety Council film, the perfect crime is presented as excess speed. Accidents at high speed often results in deaths and are rarely investigated like the robbery of a corner grocery shown at the beginning of the film. Driving too fast, particularly in poor weather conditions or at night can be deadly. Then there are those who don't properly maintain their vehicle. Alcohol is a problem. Even bad roads, railway crossings and narrow underpasses are the driver's responsibility, as they should slow down. The film ends with a plea to support the costs of new modern roads.","simplePlot":"In this short National Safety Council film, the perfect crime is presented as excess speed. Accidents at high speed often results in deaths and are rarely investigated like the robbery of a... ","actors":[{"actorName":"Leonard Belove","urlProfile":"http://www.imdb.com/name/nm0069485","urlPhoto":"","biography":{"dateOfBirth":"20 November 1916","placeOfBirth":" Kansas City, Missouri, USA","bio":"Leonard Belove was born on November 20, 1916 in Kansas City, Missouri, USA. He was an actor and producer, known for The Delinquents (1957), Le prix de la survie (1980) and The Cool and the Crazy (1958). He died in August 1985 in Kansas City.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0069485","name":"Leonard Belove","idIMDB":"nm0069485"},"actorId":"nm0069485","character":"Detective","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Owen Bush","urlProfile":"http://www.imdb.com/name/nm0124184","urlPhoto":"","biography":{"dateOfBirth":"10 November 1921","placeOfBirth":" Savannah, Missouri, USA","bio":"The laconic character actor Owen Bush was born on November 10, 1921 in Savannah, Missouri. Owen first became interested in acting in high school, when auditioning for a school play got him out of a boring study hall. In the late 1940s, Bush began working as a radio announcer, and in the early '50s, became a sportscaster on WDAF-TV in Kansas City. Like many television announcers in Kansas City at that time, Bush also frequently acted in industrial films made by the Calvin Company of Kansas City. There, he met the young director Robert Altman, who loved Bush's comic acting style and cast him in many short industrial \"docu-dramas\" as well as a bit part in Altman's first feature film, \"The Delinquents,\" shot in Kansas City in 1956. In 1959, Altman who by this time was a busy director of episodic TV in Hollywood, convinced Bush to take a leave of absence from WDAF-TV and come out to California to play a regular role in a short-lived syndicated TV series Altman was producing called \"The Troubleshooters.\" The show didn't get off the ground, but with some help from old friend William Frawley (of \"I Love Lucy\" fame) whom Bush first met during the making of an industrial film in Kansas City, Bush went on to become a popular radio personality in Los Angeles and also one of the most prolific character actors in movies and TV, not only appearing in many early-'60s Altman-directed episodes of the series \"The Whirlybirds,\" \"Maverick,\" \"Peter Gunn,\" \"Bus Stop\", and \"Bonanza\", but also \"on his own\" in many episodes of \"The Andy Griffith Show\" and \"Gunsmoke\" and in the movie \"Valley of the Dolls\". Bush kept on working steadily through the 1970s, '80s, and '90s, and most recently could be spotted in the movie \"Best Laid Plans\" and in a recurring role on the TV soap opera \"Passions\". One of the classic and most recognizable character actors, Owen Bush died on June 12, 2001, in L.A., aged 79.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0124184","name":"Owen Bush","idIMDB":"nm0124184"},"actorId":"nm0124184","character":"Motorist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Art Ellison","urlProfile":"http://www.imdb.com/name/nm0255156","urlPhoto":"","biography":{"dateOfBirth":"24 July 1899","placeOfBirth":" Potsdam, New York, USA","birthName":"Arthur Wayland Ellison","bio":"Art Ellison was born in 1899 in Potsdam, New York, and moved in 1914 with his family to Kansas City, Missouri. At the age of 18, he went to work at the Kansas City Power and Light Company (KCP&L) where he was employed in the credit department until he retired in 1966. Ellison got his first acting role in 1924, in a musical comedy held as a benefit for the Kansas City Women's Athletic Club building fund. After this experience on stage he joined the Chanticleer Players, an amateur group in Kansas City offering one act plays. He worked backstage and appeared in the farce pantomimes and tableaux between the acts. In 1930, Ellison joined the amateur Black-Friars, where he played a few leads, some character parts, and handled many other important duties behind the scenes. Much of Ellison's stage career was spent with the local productions of the University of Kansas City Playhouse (which later became the University of Missouri-Kansas City Theater), the Resident Theater, the Missouri Repertory Theater, and the Johnson County, Kansas Playhouse. He also played with the Provincials, the Jewish Community Theater, and Starlight Theater. During World War II, Ellison made USO appearances and recruiting records for the armed forces. He played several roles on \"The Air Adventures of Jimmie Allen,\" a 1940s radio series produced in Kansas City and syndicated nationally, and he had a part in WDAF-TV's first program, as well as other television and radio shows, particularly for Kansas City Power and Light. He also frequently acted in industrial films made by the Calvin Company of Kansas City, as well as in a few made by Centron Corporation of Lawrence, Kansas. He had a role in Centron director Herk Harvey's 1962 feature film \"Carnival of Souls,\" made in Lawrence, and upon his retirement from KCP&L in the mid-1960s, Ellison joined the Actors Equity Association and devoted all his time to acting. Between Kansas City theater performances and industrial films, he gained roles in the Hollywood films \"Paper Moon\" and \"Shoot it Black--Shoot it Blue,\" and the network TV movies \"Friendly Persuasion\" and \"Mary White,\" all of which were shot on location in the Kansas/Missouri area and recruited local acting talent. In 1979 Ellison suffered a stroke that prevented him from pursuing any further acting roles for ten years. He passed away in 1994, aged 94. Ellison was respected for his accuracy in mastering dialects and for his make-up ability, received several theater awards, and was well-known in the acting community of Kansas City. His twelve scrapbooks of materials devoted to theater and acting-related activities in Kansas City, dating from 1924 to 1992, are currently archived in the Western Historical Manuscript Collection of the University of Missouri-Kansas City.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0255156","name":"Art Ellison","idIMDB":"nm0255156"},"actorId":"nm0255156","character":"Grocery Clerk","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0155954","urlIMDB":"http://www.imdb.com/title/tt0155954","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["20 min"],"soundMix":null,"color":null,"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"4.8","filmingLocations":[],"awards":[],"votes":"35","type":"Movie","companyCreditsSimple":[{"idCompany":"co0126343","name":"Calvin Co."},{"idCompany":"co0129672","name":"Caterpillar Tractor Co."}],"keywords":{"keywords":["highway","melodrama","good roads movement","traffic accident"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 06:08:18"}}