{"data":{"movies":[{"title":"Fist of the North Star","originalTitle":"","year":"1995","releaseDate":"19950422","directors":[{"name":"Tony Randel","id":"nm0709752"}],"writers":[{"name":"Buronson","id":"nm0122967"},{"name":"Tetsuo Hara","id":"nm0361700"}],"runtime":"103 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0ODI5OTg3OF5BMl5BanBnXkFtZTcwNTAwMjgyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Fantasy","Sci-Fi","Thriller"],"plot":"Based on a graphic novel, this apocalyptic adventure centers on a man who must reverse the cataclysmic conditions of his world.","simplePlot":"Based on a graphic novel, this apocalyptic adventure centers on a man who must reverse the cataclysmic conditions of his world.","actors":[{"actorName":"Gary Daniels","urlProfile":"http://www.imdb.com/name/nm0199939","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MTMzMzAxMl5BMl5BanBnXkFtZTgwNTU1MzY4ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 May 1963","placeOfBirth":" London, England, UK","birthName":"Gary Edward Daniels","height":"5' 11\" (1.8 m)","bio":"Action film star Gary Daniels was a real-life kick-boxing champion. With rugged good-looks, a muscular build and a charming personality, it was a natural for him to move from the world of fighting to that of acting. Born Gary Edward Daniels on May 9, 1963 in Woking, Surrey, England, Daniels was a childhood fan of legendary martial arts film star Bruce Lee. He followed his idol by studying Kung Fu. Demonstrating a natural ability for the sport of full-contact karate (also known as kick-boxing), Daniels embarked on a ring career with the dream of winning a world title. Fighting in tournaments in England, Daniels' aggressive ring style made him a fan favorite, but did not sit well with the British officials. Daniels posted a 12-3-0 kick-boxing record with all 12 victories by knockouts. All three of defeats were by disqualification,including one to Micheal J. Heming; future Jean-Claude Van Damme opponent. Daniels decided that his best bet was to fight in the United States, so he traveled to Florida and began competing there. In 1980, Daniels made his United States debut at the Sunshine State Tournament in Miami. In his opening match, Daniels defeated local favorite 'Sherman 'Big Train' Bergman', who a year earlier had lost to Jean-Claude Van Dammeat the World Full-Contact Championships. However, in his next fight, Daniels was eliminated from the tournament after he lost a 3 round decision. The sport of kick-boxing was taking off in Southern California, and after a few matches, Gary Daniels decided to leave Florida and continue his career in California. He soon established himself as a top contender for the world title. He appeared in numerous martial arts magazines, and his knockout streak continued to grow. Soon after winning the PKA (Professional Karate Association) Lightheavyweight Kickboxing Championship, Daniels decided to retire from active competition. It was 1993, and Daniels ended his fighting days with a 22-4-0 (21 knockouts) record. His ring fame helped land him small roles in the hit television series, Miami Vice. Daniels later traveled to the Philippines to make martial arts films. From there Gary went into mainstream film-making; acting in over 45 movies, as well as producing some of his own motion pictures. Gary Daniels reportedly made a comeback in Thailand at the age of 45, but after losing a decision, he decided to end any future thoughts of fighting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MTMzMzAxMl5BMl5BanBnXkFtZTgwNTU1MzY4ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0199939","name":"Gary Daniels","idIMDB":"nm0199939"},"actorId":"nm0199939","character":"Kenshirô","urlCharacter":"http://www.imdb.com/character/ch0038069","main":true},{"actorName":"Malcolm McDowell","urlProfile":"http://www.imdb.com/name/nm0000532","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjQxNzczM15BMl5BanBnXkFtZTcwMTg3MTMwNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1943","placeOfBirth":" Horsforth, Yorkshire, England, UK","birthName":"Malcolm John Taylor","height":"5' 8½\" (1.74 m)","bio":"Malcolm John Taylor was born on June 13, 1943 in Leeds, England, to working-class parents Edna (McDowell), a hotelier, and Charles Taylor, a publican. His father was an alcoholic. Malcolm hated his parents' ways. His father was keen to send his son to private school to give him a good start in life, so Malcolm was packed off to boarding school at age 11. He attended the Tunbridge Boarding School and the Cannock House School in Eltham, Kent. At school, he was beaten with the slipper or cane every Monday for his wayward behavior. Whilst at school, he decided that he wanted to become an actor; it was also around this time that his love for race cars began. He attended the London Academy of Music and Dramatic Arts (LAMDA) to study acting. Meanwhile, he worked at his parents' pub but lost his job when the pub went bankrupt, his father drinking all the profits. He then had a variety of jobs, from coffee salesman to messenger. His first big-screen role was in Poor Cow (1967), although his two-minute scene was ultimately cut from the completed film. Soon after, he caught the attention of director Lindsay Anderson who cast him in the role of a rebellious student in his film If.... (1968). The film catapulted Malcolm to stardom in Britain but failed everywhere else. He was so enthusiastic about the film's success that he wanted to do another right away. He began writing what would become the semi-autobiographical O Lucky Man! (1973). Meanwhile, he starred as the infamous Alex DeLarge in Stanley Kubrick's controversial A Clockwork Orange (1971), a role that caused him to be typecast as a manic psychopathic villain. In early 1976, he spent nearly a year working on what would later be one of the most infamous films of all time, the semi-pornographic Caligula (1979), financed by Penthouse magazine founder Bob Guccione. Around that time, the British film industry collapsed, forcing him to flee to America to continue working. His first American film was Time After Time (1979). He then did Britannia Hospital (1982), the last part of Lindsay Anderson's working-class trilogy that started with If.... (1968). In the mid-1980s, the years of alcohol and drug abuse, including $1000 a week on cocaine, caught up with him. Years of abuse took its toll on him; his black hairs were now grey. Looking older than he really was, nobody wanted to cast him for playing younger roles. The big roles having dried up, he did many B-rated movies. The 1990s were kinder to him, though. In 1994, he was cast as Dr. Tolian Soran, the man who killed Captain James T. Kirk in Star Trek: Generations (1994). He was back on the track, playing villains again. He played another in the classic BBC miniseries Our Friends in the North (1996). Today, with more than 100 films under his belt, he is one of the greatest actors in America. He still does not have American citizenship, but he likes the no-nonsense American ways. He resides in the northern suburbs of Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxMjQxNzczM15BMl5BanBnXkFtZTcwMTg3MTMwNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000532","name":"Malcolm McDowell","nicknames":["Mick"],"idIMDB":"nm0000532"},"actorId":"nm0000532","character":"Ryuken","urlCharacter":"http://www.imdb.com/character/ch0056858","main":true},{"actorName":"Costas Mandylor","urlProfile":"http://www.imdb.com/name/nm0541908","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxOTU4MjA3NF5BMl5BanBnXkFtZTgwMjczMjk1MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 September 1965","placeOfBirth":" Melbourne, Victoria, Australia","birthName":"Costas Theodosopoulos","height":"5' 11\" (1.8 m)","bio":"Costas Mandylor was born on September 3, 1965 in Melbourne, Victoria, Australia as Costas Theodosopoulos. He is an actor, known for Saw IV (2007), Saw V (2008) and Saw VI (2009). He has been married to Victoria Ramos since October 10, 2013. He was previously married to Talisa Soto.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxOTU4MjA3NF5BMl5BanBnXkFtZTgwMjczMjk1MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0541908","name":"Costas Mandylor","idIMDB":"nm0541908"},"actorId":"nm0541908","character":"Lord Shin","urlCharacter":"http://www.imdb.com/character/ch0109014","main":true},{"actorName":"Downtown Julie Brown","urlProfile":"http://www.imdb.com/name/nm0113463","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTkzMzU4Mjc5MF5BMl5BanBnXkFtZTYwMzMxNDk1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1963","placeOfBirth":" Cardiff, Wales, UK","bio":"Downtown Julie Brown was born on August 27, 1963 in Cardiff, Wales. She is an actress and producer, known for 1991 MTV Video Music Awards (1991), The Earth Day Special (1990) and Junket Whore (1998). She has been married to Martin Schuermann since April 4, 2001. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTkzMzU4Mjc5MF5BMl5BanBnXkFtZTYwMzMxNDk1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0113463","name":"Downtown Julie Brown","idIMDB":"nm0113463"},"actorId":"nm0113463","character":"Charlie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dante Basco","urlProfile":"http://www.imdb.com/name/nm0002364","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2OTAwMzMwOF5BMl5BanBnXkFtZTcwOTUyOTE0NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1975","placeOfBirth":" Pittsburg, California, USA","birthName":"Danté Roman Titus Basco","height":"5' 6½\" (1.69 m)","bio":"Dante Basco was born on August 29, 1975 in Pittsburg, California, USA as Danté Roman Titus Basco. He is an actor and producer, known for Hook (1991), American Dragon: Jake Long (2005) and Avatar: The Last Airbender (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2OTAwMzMwOF5BMl5BanBnXkFtZTcwOTUyOTE0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002364","name":"Dante Basco","idIMDB":"nm0002364"},"actorId":"nm0002364","character":"Bat","urlCharacter":"http://www.imdb.com/character/ch0107879","main":true},{"actorName":"Nalona Herron","urlProfile":"http://www.imdb.com/name/nm0380809","urlPhoto":"","biography":{"bio":"Nalona Herron is an actress, known for Fist of the North Star (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0380809","name":"Nalona Herron","idIMDB":"nm0380809"},"actorId":"nm0380809","character":"Lynn","urlCharacter":"http://www.imdb.com/character/ch0107880","main":true},{"actorName":"Melvin Van Peebles","urlProfile":"http://www.imdb.com/name/nm0887708","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMTU3MjM2OV5BMl5BanBnXkFtZTcwMTk2Njg4Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 August 1932","placeOfBirth":" Chicago, Illinois, USA","bio":"Melvin Van Peebles was born on August 21, 1932 in Chicago, Illinois, USA. He is an actor and writer, known for Sweet Sweetback's Baadasssss Song (1971), Panther (1995) and Last Action Hero (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMTU3MjM2OV5BMl5BanBnXkFtZTcwMTk2Njg4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0887708","name":"Melvin Van Peebles","idIMDB":"nm0887708"},"actorId":"nm0887708","character":"Asher","urlCharacter":"http://www.imdb.com/character/ch0407717","main":true},{"actorName":"Clint Howard","urlProfile":"http://www.imdb.com/name/nm0397212","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjkyMDU3NDEwMV5BMl5BanBnXkFtZTgwMzM3MjA0MDI@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1959","placeOfBirth":" Burbank, California, USA","birthName":"Clinton E. Howard","height":"5' 7\" (1.7 m)","bio":"Clint Howard also had a recurring role in The Andy Griffith Show, as a little boy always dressed in a cowboy outfit and always eating a peanut butter and jelly sandwich. He never said a word, but was always offering someone a bite. He also had a co-starring role along with a black bear as the owner and friend of Gentle Ben, in that series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjkyMDU3NDEwMV5BMl5BanBnXkFtZTgwMzM3MjA0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0397212","name":"Clint Howard","idIMDB":"nm0397212"},"actorId":"nm0397212","character":"Stalin","urlCharacter":"http://www.imdb.com/character/ch0027855","main":true},{"actorName":"Andre Rosey Brown","urlProfile":"http://www.imdb.com/name/nm0113012","urlPhoto":"","biography":{"dateOfBirth":"7 February 1956","placeOfBirth":" Rockford, Illinois, USA","height":"6' 4\" (1.93 m)","bio":"Andre Rosey Brown was born on February 7, 1956 in Rockford, Illinois, USA. He was an actor, known for Naked Gun 33 1/3: The Final Insult (1994), Space Jam (1996) and Tango & Cash (1989). He was married to Debra Lynn Loomis. He died on July 18, 2006 in Northridge, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0113012","name":"Andre Rosey Brown","nicknames":["Bigg Mann"],"idIMDB":"nm0113012"},"actorId":"nm0113012","character":"Sandman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paulo Tocha","urlProfile":"http://www.imdb.com/name/nm0865050","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NTU5NTMzOF5BMl5BanBnXkFtZTgwMzI5NjI2NjE@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"bio":"Paulo Tocha is a Hollywood actor and producer living in Los Angeles , California. Tocha grew up internationally all over the world and speaks various languages. From Portuguese-Italian parents, first growing up in Mozambique during the colonial era then South Africa and later living in Hong Kong and Bangkok in Asia before becoming an American. Tocha started his career in Asia doing Ninja Films and acting in action blockbusters, starring with Jet Le , Jean Claude van Damme and many others, Paulo is known for usually doing his own stunts. Paulo is mostly recognized in the Action and Martial Arts genre as the actor and fighter responsible for introducing Muaythai - Thai boxing to the western world audience through his performance as \"Paco\" a Muaythai fighter in the original Blockbuster classic \"Bloodsport\", which created a cult following and inspired youth all over the world to practice Muaythai. Tocha continues to work extensively with top actors, directors and producers,including working as an actor with many of Hollywood Oscar winners(8). Behind the camera he continues writing, producing and working as a technical adviser to many Hollywood film companies. In 1999 he was Awarded 4th place at the prestigious NYC New York Film Festival for his PSA \"Prisoner\" out of 16.000 entries. In 2009 Tocha was inducted into the Martial Arts Masters Hall of Fame as \"Trainer of Champions \" and received a a Golden life Achievement Award. In the past Tocha received three Siam Awards, a National Muay Thai award for his work related to the Art of Muaythai in the film industry. One of the early pioneers which happened to be both an actor and Professional Muay Thai fighter from Bangkok competiting internationally in China,Hong Kong,and Thailand, Tocha was trained at the famous Sor.Thanikul Muaythai - Thai Boxing camp in Bangkok Thailand. Recognized as the first westerner to be adopted, nicknamed, trained and made a fighter in the Bangkok fight scene. In 1985 he became the first westerner to fight and win in mainland China becoming an International Champion. In the years that followed he was nominated(USMTA)and won for the International Actor's Award, and U.S. Judge and Referee of the year Award in 1999 all related to Martial arts. In 2005, Tocha and Big Vision Entertainment produced \"Strong Spirit\" for Television. A TV documentary series set in the world of Fighting and Muaythai. In 2005 he also produced and promoted the fist filming inside the Thai Penal system, an documentary based on Prison Fights in Thailand, dealing with addicton . Tocha has worked extensively in national commercials, Honda, ATT,etc and was the face of Verizon in 2007 in their commercial campaign. In 2009 he broke his knee while filming for Oscar winner director Michael Man an ATT commercial. Tocha continues to work as an actor and is the current World Muaythai Council of America Vice President and United States Muaythai Association Vice President. Recently he started promoting Muaythai again, and he's in charge of Sanctioning and organizing the Lion Fight Muaythai Championship Shows in California at Pechanca Casino which have received the highest ratings on AXSTV Network.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2NTU5NTMzOF5BMl5BanBnXkFtZTgwMzI5NjI2NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0865050","name":"Paulo Tocha","idIMDB":"nm0865050"},"actorId":"nm0865050","character":"Stone","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Penn","urlProfile":"http://www.imdb.com/name/nm0001606","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NzI3NzIzM15BMl5BanBnXkFtZTYwMTMzNzgz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 October 1965","placeOfBirth":" Los Angeles, California, USA","birthName":"Christopher Shannon Penn","height":"5' 10\" (1.78 m)","bio":"Christopher Shannon Penn was born on October 10, 1965 in Los Angeles, California, the third son of actress Eileen Ryan (née Annucci) and director, actor, and writer Leo Penn. His siblings are musician Michael Penn and actor Sean Penn. His father was from a Lithuanian Jewish/Russian Jewish family, and his mother is of half Italian and half Irish descent. Penn set out to follow in his parents' footsteps and started acting at age twelve in the Loft Studio. While in high school he and his brother Sean made several shorts with their classmates, which included such would-be stars as Emilio Estevez and Rob Lowe. Penn made his onscreen debut in the Christopher Cain movie, Charlie and the Talking Buzzard (1979). After a few years Penn caught the eye of acclaimed director Francis Ford Coppola, who cast him in a supporting role in the teen drama Rumble Fish (1983). Although the film was a flop critically and commercially, Penn's career was well under way. That same year he acted in All the Right Moves (1983), a high school drama film starring a young Tom Cruise. The next year Penn gave a performance in Footloose (1984), starring Kevin Bacon and dealing with a small town which bans rock & roll music. The movie was a smash hit, and remains a classic to this day. Penn followed this up with a villainous role in Clint Eastwood's Pale Rider (1985), and the crime movie At Close Range (1986), starring Christopher Walken. Penn acted in a few smaller productions until he was cast as Travis Brickley in the sports drama Best of the Best (1989). Penn's character is a martial arts fighter who joins the other main characters when they enter a taekwondo tournament against the Korean team. The movie spawned several sequels, though Penn only appeared in the first and second films. A few more jobs followed until Penn landed what is known as his most famous movie: Quentin Tarantino's Reservoir Dogs (1992). The indie crime film concerned a heist gone wrong, as the criminals search for a rat in their midst. Penn played the role of Nice Guy Eddie, the son of the old gangster that arranges the heist. The film continues to receive acclaim as a classic movie and as the start of Tarantino's directing career. Penn also acted in the Tarantino-scripted Tony Scott crime movie True Romance (1993), albeit in a much smaller role. Penn also took a supporting role in the ensemble film Short Cuts (1993) by Robert Altman. After participating in these acclaimed films, Penn took on several smaller projects, including a role as the villain in the second \"Beethoven\" movie. In this period of time, Penn acted in such films as the crime film Mulholland Falls (1996), set in the 1950s. Penn then gave one of his greatest performances in the Abel Ferrara crime drama The Funeral (1996). The movie starred Christopher Walken, Penn, and Vincent Gallo as three brothers who are involved in the world of crime, even as it threatens to take them all down. Penn plays Chez, the middle brother, who has a very short temper. Penn also sang a song in the film as his character. While the film was well received critically and Penn received an award for Best Supporting Actor at the Venice Film Festival for his excellent performance, The Funeral (1996) went largely unseen. Penn followed up with the Canadian film The Boys Club (1996), the crime thriller One Tough Cop (1998), and a supporting role in the hit comedy Rush Hour (1998). Following his latest success, Penn acted in the drama-comedy The Florentine (1999), the English comedy Kiss Kiss (Bang Bang) (2001), and the crime thriller Murder by Numbers (2002). Penn was also one of the many stars that acted in the box office failure Masked and Anonymous (2003), starring Bob Dylan. The last few years of his career mainly featured supporting roles in such movies as After the Sunset (2004), Starsky & Hutch (2004), and the Canadian crime film King of Sorrow (2007), his last film appearance. Throughout his life Penn had had battles with heart disease and multiple drug use. He was found dead in his home on January 24, 2006. He was only forty years old. Penn left behind a career that featured many roles in small, independent productions as well as several very well known films. Penn worked with several esteemed directors and fellow actors, lending his talent to both television and film. Although he never received nearly as much attention or as many awards as his brother Sean, Chris Penn will always be remembered by those who watch movies and appreciate his work.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NzI3NzIzM15BMl5BanBnXkFtZTYwMTMzNzgz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001606","name":"Chris Penn","idIMDB":"nm0001606"},"actorId":"nm0001606","character":"Jackal","urlCharacter":"http://www.imdb.com/character/ch0112482","main":true},{"actorName":"Tracey Walter","urlProfile":"http://www.imdb.com/name/nm0910145","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NzkxOTgxMV5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 November 1947","placeOfBirth":" Jersey City, New Jersey, USA","height":"5' 6\" (1.68 m)","bio":"Tracey Walter was born on November 25, 1947 in Jersey City, New Jersey, USA. He is an actor, known for The Silence of the Lambs (1991), Batman (1989) and Matilda (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ5NzkxOTgxMV5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0910145","name":"Tracey Walter","idIMDB":"nm0910145"},"actorId":"nm0910145","character":"Paul McCarthy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Rowena Guinness","urlProfile":"http://www.imdb.com/name/nm0347425","urlPhoto":"","biography":{"bio":"Rowena Guinness is an actress, known for Fist of the North Star (1995), One Good Turn (1996) and Guncrazy (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0347425","name":"Rowena Guinness","idIMDB":"nm0347425"},"actorId":"nm0347425","character":"Jill McCarthy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Isako Washio","urlProfile":"http://www.imdb.com/name/nm0913557","urlPhoto":"","biography":{"dateOfBirth":"1 April 1967","placeOfBirth":" Niigata, Japan","height":"5' 9\" (1.75 m)","bio":"Isako Washio was born on April 1, 1967 in Niigata, Japan. She is an actress and executive, known for Bloom in the Moonlight (1993), The Reason Why I Became Ill (1990) and Fist of the North Star (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0913557","name":"Isako Washio","idIMDB":"nm0913557"},"actorId":"nm0913557","character":"Julia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Charles Friedman","urlProfile":"http://www.imdb.com/name/nm0295310","urlPhoto":"","biography":{"bio":"Michael Charles Friedman is an actor, known for Fist of the North Star (1995), Grace Under Fire (1993) and All That (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0295310","name":"Michael Charles Friedman","idIMDB":"nm0295310"},"actorId":"nm0295310","character":"Neuter","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0113074","urlIMDB":"http://www.imdb.com/title/tt0113074","business":{"budget":{"money":"$7,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"02","month":"06","year":"1994","remarks":null},{"money":null,"country":null,"day":"08","month":"07","year":"1994","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 43 min (103 min)","1 hr 28 min (88 min) (UK)"],"soundMix":["Ultra Stereo"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex Cameras"],"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"3.9","filmingLocations":[{"location":"Los Angeles, California, USA"}],"rated":"R","awards":[],"votes":"2,601","type":"Movie","companyCreditsSimple":[{"idCompany":"co0010508","name":"First Look International"},{"idCompany":"co0064505","name":"NEO Motion Pictures"},{"idCompany":"co0001270","name":"Overseas FilmGroup"}],"keywords":{"keywords":["based on cartoon","hand to hand combat","knife","brutality","good versus evil","gore","stylized violence","blood","blood splatter","beefcake martial arts","mixed martial arts","urban decay","outlaw","outlaw gang","wing chun","jeet kune do","chop socky","kung fu","kung fu classic","karate","karate chop","karate kick","fistfight","brawl","duel","martial artist","martial arts master","bare chested male","bare chested male bondage","dark hero","reluctant hero","battlefield","battle","disarming someone","stabbed with a spear","stabbed with a sword","katana","sword duel","sword fight","spear","sword","violence","warrior","tough guy","one against many","one man army","action hero","hero","post apocalypse","remake of asian film","based on anime","remake of japanese film","based on manga","stabbing","based on comic","martial arts","child murder","remake","dying words","bloody body of a child"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/13 18:11:29"}}