{"data":{"movies":[{"title":"Child's Play 3","originalTitle":"","year":"1991","releaseDate":"19910830","directors":[{"name":"Jack Bender","id":"nm0070474"}],"writers":[{"name":"Don Mancini","id":"nm0238841"},{"name":"Don Mancini","id":"nm0238841"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTRjYWVhNjAtMjIwOC00NjU3LTliZTAtMjczMmEwMzQ5Y2Y3XkEyXkFqcGdeQXVyMjQwNTU1NTc@._V1.jpg","countries":["UK","USA"],"languages":["English"],"genres":["Action","Horror","Thriller"],"plot":"It's been eight years since the events in the second film, we now see that Andy is a teenager who has been enrolled in a military school. Play Pals Toy Company decides to re-release its Good Guys line, feeling that after all this time, the bad publicity has died down. As they re-used old materials, the spirit of Charles Lee Ray once again comes to life. In his search for Andy, Chucky falls into the hands of a younger boy, and he realizes that it may be easier to transfer his soul into this unsuspecting child. Andy is the only one who knows what Chucky is up to, and it's now up to him to put a stop to it.","simplePlot":"Chucky, the doll possessed by a serial killer, returns for revenge against Andy, the young boy who defeated him and who has since become a teenager.","actors":[{"actorName":"Justin Whalin","urlProfile":"http://www.imdb.com/name/nm0923529","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NjkyMzA2MF5BMl5BanBnXkFtZTcwMTM1MjcyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1974","placeOfBirth":" San Francisco, California, USA","height":"5' 10\" (1.78 m)","bio":"Justin has been a working actor since the ripe old age of 11, when he first captured audiences in the title role of \"The Little Prince.\" Today, he is a 19-year veteran of Hollywood, with an Emmy under his belt. Preferring to stay out of the limelight when he isn't working, he has many other interests, including the stock market. He also enjoys golfing and playing the blues on his electric guitar. Scuba diving is a hobby that he's fallen in love with in the last few years. When they can, Justin and his fiancée Reina love traveling to exotic destinations and exploring the marine life.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NjkyMzA2MF5BMl5BanBnXkFtZTcwMTM1MjcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0923529","name":"Justin Whalin","nicknames":["J. Will"],"idIMDB":"nm0923529"},"actorId":"nm0923529","character":"Andy Barclay","urlCharacter":"http://www.imdb.com/character/ch0009426","main":true},{"actorName":"Perrey Reeves","urlProfile":"http://www.imdb.com/name/nm0716275","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NzM5MTI0OV5BMl5BanBnXkFtZTcwNDc5MzQzNw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1970","placeOfBirth":" New York City, New York, USA","height":"5' 5½\" (1.66 m)","bio":"Perrey Reeves was born in New York City and raised in the countryside of New Hampshire. Her parents, both academics, were from upper-class families. Her paternal grandfather, Hazard E. Reeves, was a sound pioneer who introduced magnetic stereophonic sound to films, and her maternal great-grandfather, James H. Hughes, was a U.S. Senator from Delaware (from 1937 to 1943). Perrey's parents preferred not to own a television but rather submerge their children in the vast realms of literature. Thus, her educational background ranged from years abroad in France and Italy to the Ivy League colleges of the US. Drama studies were what really interested her, however, resulting in her choosing an acting career. Her interests are as eclectic and diverse as the roles she has played and the life she has led. A lifelong vegetarian, she finds mental and physical balance in meditation and yoga, which she has faithfully practiced for over a decade. In the midst of acting, she also focuses much of her creative energies renovating a new home with her fiancée. She describes their abode as a \"quaint country oasis in the hills of Hollywood\". When not standing in line at Home Depot, she passionately donates her time to The International Fund for Animal Welfare and lives with many furry creatures. She joins the comically dynamic cast in DreamWorks' October release, Old School (2003), directed by Todd Phillips. Co-starring opposite Will Ferrell, she plays his traditional wife who is dedicated to the white picket fence dream. Vince Vaughn, Luke Wilson, Leah Remini and Ellen Pompeo round out the stellar cast. Perrey is accomplished on both the big and small screens. She has co-starred in features such as Tri-Star's The Suburbans (1999), Miramax's Phoenix Arizona (1998), Trimark's Kicking and Screaming (1995) and Universal's Child's Play 3 (1991). She has landed series regular roles in four pilots and has guest starred on numerous television shows ranging from Fox's The X-Files (1993) to the WB's Off Centre (2001). She has played lead roles in made-for-television movies, including CBS' An Element of Truth (1995) and ABC's Escape to Witch Mountain (1995). Perrey showcased her talents on stage in theater productions of \"High Tor\", \"House Arrest\", \"Women of Manhattan\", \"Picnic\" and \"Last Night at Ballyhoo\" at The Canon Theatre in which she played Rhea Perlman's daughter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NzM5MTI0OV5BMl5BanBnXkFtZTcwNDc5MzQzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0716275","name":"Perrey Reeves","idIMDB":"nm0716275"},"actorId":"nm0716275","character":"De Silva","urlCharacter":"http://www.imdb.com/character/ch0132047","main":true},{"actorName":"Jeremy Sylvers","urlProfile":"http://www.imdb.com/name/nm0843199","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc3MjYwOTQyM15BMl5BanBnXkFtZTcwMzE2NTgwMw@@._V1_UY44_CR20,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1983","placeOfBirth":" Bronx, New York, USA","bio":"Jeremy Sylvers was born on June 19, 1983 in Bronx, New York, USA. He is an actor, known for Child's Play 3 (1991), My Wife and Kids (2001) and Saved by the Bell (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODc3MjYwOTQyM15BMl5BanBnXkFtZTcwMzE2NTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0843199","name":"Jeremy Sylvers","idIMDB":"nm0843199"},"actorId":"nm0843199","character":"Tyler","urlCharacter":"http://www.imdb.com/character/ch0306308","main":true},{"actorName":"Travis Fine","urlProfile":"http://www.imdb.com/name/nm0003910","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2OTIwODgxNV5BMl5BanBnXkFtZTcwMDA4NDc3Nw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1968","placeOfBirth":" Atlanta, Georgia, USA","bio":"Travis Fine was born on June 26, 1968 in Atlanta, Georgia, USA. He is an actor and writer, known for Girl, Interrupted (1999), The Thin Red Line (1998) and The Young Riders (1989). He has been married to Kristine Fine since June 29, 2002. They have two children. He was previously married to Jessica Resnick.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2OTIwODgxNV5BMl5BanBnXkFtZTcwMDA4NDc3Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0003910","name":"Travis Fine","idIMDB":"nm0003910"},"actorId":"nm0003910","character":"Shelton","urlCharacter":"http://www.imdb.com/character/ch0009428","main":true},{"actorName":"Dean Jacobson","urlProfile":"http://www.imdb.com/name/nm0414820","urlPhoto":"","biography":{"bio":"Dean Jacobson is an actor and casting director, known for Child's Play 3 (1991), Lobster Man from Mars (1989) and Junior (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0414820","name":"Dean Jacobson","idIMDB":"nm0414820"},"actorId":"nm0414820","character":"Whitehurst","urlCharacter":"http://www.imdb.com/character/ch0132049","main":true},{"actorName":"Brad Dourif","urlProfile":"http://www.imdb.com/name/nm0000374","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNTA2MDExOF5BMl5BanBnXkFtZTcwNDE0MDAxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 March 1950","placeOfBirth":" Huntington, West Virginia, USA","birthName":"Bradford Claude Dourif","height":"5' 9\" (1.75 m)","bio":"Character actor Brad Dourif was born Bradford Claude Dourif on March 18, 1950 in Huntington, West Virginia. He is the son of Joan Mavis Felton (Bradford) and Jean Henri Dourif, a French-born art collector who owned and operated a dye factory. His father died when Dourif was three years old, after which his mother married Bill Campbell, a champion golfer, who helped raise Brad, his brother, and his four sisters. From 1963 to 1965, Dourif attended Aiken Preparatory School in Aiken, South Carolina, where he pursued his interests in art and acting. Although he briefly considered becoming a professional artist, he finally settled on acting as a profession, inspired by his mother's participation as an actress in community theater. Starting in school productions, he progressed to community theater, joining up with the Huntington Community Players, while attending Marshall University of Huntington. At age 19, he quit his hometown college and headed to New York City, where he worked with the Circle Repertory Company. During the early 1970s, Dourif appeared in a number of plays, off-Broadway and at Woodstock, New York, including Milos Forman who cast him in One Flew Over the Cuckoo's Nest (1975). Although this film is frequently cited as his film debut, in fact, Dourif made his first big-screen appearance with a bit part in W.W. and the Dixie Dancekings (1975). Nevertheless, his portrayal of the vulnerable Billy Bibbit in Forman's film was undoubtedly his big break, earning him a Golden Globe Award for Best Acting Debut, a British Academy Film Award for Best Supporting Actor, and an Oscar nomination for Best Supporting Actor. Skeptical of his instant stardom, Dourif returned to New York, where he continued in theater and taught acting and directing classes at Columbia University until 1988 when he moved to Hollywood. Despite his attempts to avoid typecasting, his intensity destined him to play demented, deranged, or disturbed characters, starting in Eyes of Laura Mars (1978), John Huston's Wise Blood (1979) (arguably his best performance to date), and Milos Forman's Ragtime (1981). Dourif then teamed up with director David Lynch for Dune (1984) and Blue Velvet (1986). His high-strung style also served him well in a number of horror films, notably as the voice of the evil doll Chucky in Child's Play (1988) and its sequels. Dourif broke from the horror genre with roles in Fatal Beauty (1987), Mississippi Burning (1988), Hidden Agenda (1990), and London Kills Me (1991). Recent film work includes the role of Grima Wormtongue in Peter Jackson's The Lord of the Rings trilogy. Since his television debut in the PBS film The Mound Builders (1976), Dourif has made sporadic appearances in a number of television series, such as The X-Files (1993), Babylon 5 (1994), Star Trek: Voyager (1995) and Ponderosa (2001) (in the recurring role of Frenchy).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYxNTA2MDExOF5BMl5BanBnXkFtZTcwNDE0MDAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000374","name":"Brad Dourif","idIMDB":"nm0000374"},"actorId":"nm0000374","character":"Chucky","urlCharacter":"http://www.imdb.com/character/ch0009424","main":true},{"actorName":"Peter Haskell","urlProfile":"http://www.imdb.com/name/nm0368142","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NzcyNjIzMl5BMl5BanBnXkFtZTcwNDM2NTgwMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1934","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Peter Abraham Haskell","height":"6' 2\" (1.88 m)","bio":"Peter Haskell was born on October 15, 1934 in Boston, Massachusetts, USA as Peter Abraham Haskell. He was an actor, known for Child's Play 2 (1990), Bracken's World (1969) and Child's Play 3 (1991). He was married to Dianne Tolmich and Annie Compton. He died on April 12, 2010 in Northridge, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4NzcyNjIzMl5BMl5BanBnXkFtZTcwNDM2NTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0368142","name":"Peter Haskell","idIMDB":"nm0368142"},"actorId":"nm0368142","character":"Sullivan","urlCharacter":"http://www.imdb.com/character/ch0132051","main":true},{"actorName":"Dakin Matthews","urlProfile":"http://www.imdb.com/name/nm0559977","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MzE4Mzg2NF5BMl5BanBnXkFtZTcwMTA2MDMxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 November 1940","placeOfBirth":" Oakland, California, USA","birthName":"Melvin Richard Matthews","height":"5' 9\" (1.75 m)","bio":"From February 2014 Dakin is taking on the iconic role of Mickey, the grizzled no-mercy trainer in ROCKY, THE MUSICAL at Broadway's Winter Gardens Theatre. This role was originally played by veteran screen actor Burgess Meredith in the original 1976 movie and he received an Academy award nomination for his achievement.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3MzE4Mzg2NF5BMl5BanBnXkFtZTcwMTA2MDMxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0559977","name":"Dakin Matthews","idIMDB":"nm0559977"},"actorId":"nm0559977","character":"Colonel Cochrane","urlCharacter":"http://www.imdb.com/character/ch0306309","main":true},{"actorName":"Andrew Robinson","urlProfile":"http://www.imdb.com/name/nm0732367","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNDQzMzAzMV5BMl5BanBnXkFtZTgwODYyNzc3MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1942","placeOfBirth":" New York City, New York, USA","birthName":"Andrew Jordt Robinson","height":"5' 11\" (1.8 m)","bio":"Andrew Jordt Robinson was born in New York City and attended the University of New Hampshire, later receiving his B.A. in English from the New School for Social Research in NYC. After graduation, he spent a year in England at the London Academy for Music and Dramatic Arts on a Fulbright Scholarship. Throughout the 1960s and 1970s, Mr. Robinson performed a wide variety of theater, movie and television roles. These included the infamous Scorpio killer in Dirty Harry (1971), a stint on Ryan's Hope (1975), which earned him an Emmy nomination, and the title role in a TV movie about Liberace. He was chosen for the continuing guest role of \"Elim Garak\", the Cardassian tailor/spy on Star Trek: Deep Space Nine (1993), after first reading for the part of \"Odo\"! In the early 90s, Mr. Robinson helped found The Matrix Theatre Company in Los Angeles. In addition to acting in several of the company's productions, in 1995 and 1996 his direction of \"Endgame\" and \"The Homecoming\" at the Matrix earned him two Los Angeles Drama Critics Circle Awards. This led to his TV directing debut on Star Trek: Deep Space Nine (1993), and Mr. Robinson has since gone on to direct episodes of Star Trek: Voyager (1995). 1997-1998 directorial projects at The Matrix were \"Dangerous Corner\" and \"A Moon for the Misbegotten\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNDQzMzAzMV5BMl5BanBnXkFtZTgwODYyNzc3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0732367","name":"Andrew Robinson","nicknames":["AJ","Andy"],"idIMDB":"nm0732367"},"actorId":"nm0732367","character":"Sergeant Botnick","urlCharacter":"http://www.imdb.com/character/ch0306311","main":true},{"actorName":"Burke Byrnes","urlProfile":"http://www.imdb.com/name/nm0126312","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MDM0ODQzMl5BMl5BanBnXkFtZTcwNjI3NDc0Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 December 1937","placeOfBirth":" Oceanside, Long Island, New York, USA","bio":"Burke Byrnes was born on December 9, 1937 in Oceanside, Long Island, New York, USA. He is an actor, known for The Land Before Time (1988), Child's Play 3 (1991) and Curly Sue (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5MDM0ODQzMl5BMl5BanBnXkFtZTcwNjI3NDc0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0126312","name":"Burke Byrnes","idIMDB":"nm0126312"},"actorId":"nm0126312","character":"Sergeant Clark","urlCharacter":"http://www.imdb.com/character/ch0306312","main":true},{"actorName":"Matthew Walker","urlProfile":"http://www.imdb.com/name/nm0908024","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NDgwNTA0Nl5BMl5BanBnXkFtZTcwMDYyODYxMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 October 1968","placeOfBirth":" Santa Monica, California, USA","birthName":"Matthew Douglas Walker","bio":"Matt has been acting professionally since the age of 17 when he appeared in a Disney Movie of the Week in 1986. Since then Matt has made his living appearing in numerous television shows, feature films, commercials and in live venues across the country. At 19 he was cast as a series regular on the ABC drama Supercarrier starring Wendie Malick and Paul Gleason . Co starring roles soon followed in the feature films, Halloween 5 and Child's Play 3 and established Matt in the horror movie sequel genre. Bouncing around Hollywood as a young man, Matt has worked with such notable actors as Kate Hudson, Melanie Griffith, John Goodman, Lea Thompson, Andy Dick, Tony Danza, Martin Mull, Donald Pleasance, Willford Brimley, John Ritter, and the great George C. Scott, and such directors as Tobe Hooper, James Burrows, and Garry Marshall to name drop a few. In 1995, Matt was cast as a series regular in the Fox situation comedy, The Preston Episodes with David Allen Grier, and as the star of a CBS pilot called Shock Treatment. The heat from these two shows landed Matt with the William Morris Talent Agency. Also in 1995 Matt accepted a job as the director of a TBS cable television show, Dinner And A Movie. That gig turned into more directing for TBS including the shows, Movies For Guys Who Like Movies, The Man Made Movie, Movie & A Makeover and Big Playstation Saturday. Six years and over 200 episodes later Matt had worked with more of Hollywood's top shelf talent including Kelsey Grammer, Joan Cusack, Jon Cryer, Beverly D'Angelo, John C. McGinnley, John Travolta, Bridget Fonda, Danny Devito, Morgan Freeman, Ray Liotta and Gov. Arnold Schwarzenegger. During his stint as a director and while he was still represented by WMA, Matt decided to run away and join the Circus. So in 1997 he left Los Angeles and was accepted into Ringling Bros. and Barnun & Bailey's Clown College on a full scholarship. For three months, seven days a week 14 hours a day Matt was trained in the circus arts including; clowning, acrobatics, stilt walking, make-up, mime, dance, prop building and juggling. This led to a contract as a clown with The Greatest Show on Earth. Travelling across the country on the circus train, Matt performed in venues including, The Cotton Bowl at the Texas State Fair, The United Center in Chicago and The L.A. Sports Arena. After the circus, Matt was more committed than ever to bringing a purely physical, musical and improvisational style of theater to Los Angeles. Having studied previously with Second City Improvisation, The San Francisco Mime Troupe and renowned clown, Bill Irwin, Matt assembled a multi talented group of actors, musicians, writers and acrobats, and the Troubadour Theater Company was born. Having recently celebrated its 15th year, Troubadour has evolved into one of Los Angeles' most critically acclaimed comic troupes, winning the 2007 Los Angeles Drama Critics Circle Award for Sustained Excellence in Theater, and in 2009 The \"Troubies\" were honored with the LA Stage Alliance's Ovation Award for Best Season, beating out the Geffen Playhouse and The Music Center. Troubie has received its second commission to produce theater at The Getty Villa in Malibu in 2010. Matt is currently an adjutant professor of clowning and advanced movement for the MFA acting program at USC, and has taught clowning/Commedia Del Arte at the University of California at San Diego. Other fun stuff includes writing and directing, Disaster! for Universal Studios, Orlando, which received the award for best Rehab Attraction 2008. Matt also served as the original director for the first two premiere productions of, Million Dollar Quartet, at Daytona's Seaside Music Theater, and Issaquah's Village Theater. And in 2009 Matt was the resident director for the 1st National tour of Garry Marshall's Happy Days the Musical. Most recently Matt served as on set writer for New Line Cinema's, Valentines Day, as well as appearing on-screen opposite Jamie Fox and Taylor Swift as reporter 'Greg Gilkins'.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ2NDgwNTA0Nl5BMl5BanBnXkFtZTcwMDYyODYxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0908024","name":"Matthew Walker","idIMDB":"nm0908024"},"actorId":"nm0908024","character":"Ellis","urlCharacter":"http://www.imdb.com/character/ch0306313","main":true},{"actorName":"Donna Eskra","urlProfile":"http://www.imdb.com/name/nm0260678","urlPhoto":"","biography":{"bio":"Donna Eskra is an actress, known for Child's Play 3 (1991), Double Take (2001) and Bad Girls Dormitory (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0260678","name":"Donna Eskra","idIMDB":"nm0260678"},"actorId":"nm0260678","character":"Ivers","urlCharacter":"http://www.imdb.com/character/ch0175571","main":true},{"actorName":"Edan Gross","urlProfile":"http://www.imdb.com/name/nm0343361","urlPhoto":"","biography":{"dateOfBirth":"1978","placeOfBirth":"","bio":"Edan Gross (also billed as \"Edon\" Gross) appeared as a guest on many popular television programs from the 80s and the 90s. This include Northern Exposure, Married with Children, Cheers, Murphy Brown, The Golden Girls, Empty Nest, Newhart, Highway to Heaven and Herman's Head. He was featured as a regular on the short-lived sitcoms Sweet Surrender (NBC, 1987), Free Spirit (ABC, 1989-1990) and Walter & Emily (NBC, 1991-1992). He was also the voice of the Good Guy dolls in Child's Play, the \"Corky doll\" from the Cricket doll series, the title character of the animated series Little Dracula, and Flounder on the animated series The Little Mermaid, and additional voice work on numerous animated specials. Edan Gross was the President of 3TAC Distribution Inc. from December 17, 2013 until its dissolution on April 1, 2016.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0343361","name":"Edan Gross","idIMDB":"nm0343361"},"actorId":"nm0343361","character":"Good Guy Doll","urlCharacter":"http://www.imdb.com/character/ch0009424","main":true},{"actorName":"Terry Wills","urlProfile":"http://www.imdb.com/name/nm0932717","urlPhoto":"","biography":{"height":"6' (1.83 m)","bio":"Terry Wills was a founding member of the Magic Theater of San Francisco. He was also a company member of the Berkeley Repertory Theater for several years. He has directed plays, written plays, and has a TV resume that includes guest-starring roles in dozens of episodic and situation comedy productions, as well as several TV movies, and over 60 commercials. He also appeared in several feature films. He worked in theater in the Washington, D.C., area from 1994 to 1999, including the Studio Theater, the Roundhouse, and the Washington Stage Guild. He guest-starred on \"Homicide: Life on the Streets\" in 1998, shot in Baltimore. He has taught theater and acting in colleges on both coasts. He has written a musical called \"Bugs\" which is an adaptation of the Brothers Capek's \"The Insect Play.\" His son is actor Benny Wills, who is a college senior in the Bay Area, and who recently filmed a supporting role in \"Valley of the Heart's Delight,\" directed by Tim Boxell and produced by Scott Rosenfelt.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0932717","name":"Terry Wills","idIMDB":"nm0932717"},"actorId":"nm0932717","character":"Garbage Man","urlCharacter":"http://www.imdb.com/character/ch0306314","main":true},{"actorName":"Richard Marion","urlProfile":"http://www.imdb.com/name/nm0548003","urlPhoto":"","biography":{"dateOfBirth":"1 July 1949","placeOfBirth":" Los Angeles, California, USA","birthName":"Richard Anthony Marion","bio":"Richard Marion was born on July 1, 1949 in Los Angeles, California, USA as Richard Anthony Marion. He was an actor and director, known for Child's Play 3 (1991), Roadie (1980) and Jagged Edge (1985). He was married to Ruth Silveira. He died on July 19, 1999 in Los Angeles.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0548003","name":"Richard Marion","idIMDB":"nm0548003"},"actorId":"nm0548003","character":"Patterson","urlCharacter":"http://www.imdb.com/character/ch0264681","main":true}],"seasons":[],"idIMDB":"tt0103956","urlIMDB":"http://www.imdb.com/title/tt0103956","business":{"budget":{"money":"$13,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$5,718,940","country":"USA","day":"02","month":"09","year":"1991","remarks":""}],"gross":[{"money":"$9,673,095 (USA)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"$5,718,940 (USA)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"$13,526,840 (USA)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"$12,955,965 (USA)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"$11,818,545 (USA)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"$5,600,000 (Worldwide)","country":"except","day":null,"month":null,"year":null,"remarks":null}],"weekendGross":[{"money":"$393,120","country":"USA","day":"29","month":"09","year":"1991","remarks":"546 Screens"},{"money":"$744,080","country":"USA","day":"22","month":"09","year":"1991","remarks":""},{"money":"$1,427,550","country":"USA","day":"15","month":"09","year":"1991","remarks":""},{"money":"$3,003,305","country":"USA","day":"08","month":"09","year":"1991","remarks":""},{"money":"$5,718,940","country":"USA","day":"02","month":"09","year":"1991","remarks":""}],"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"04","month":"02","year":"1991","remarks":null},{"money":null,"country":null,"day":"24","month":"04","year":"1991","remarks":null}],"copyrightHolder":null},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Ultracam 35"],"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"5.0","filmingLocations":[{"location":"Kemper Military School - 701 Third Street, Boonville, Missouri, USA"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2014","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best DVD/Blu-Ray Collection","names":[{"name":"Child's Play","id":"tt0094862","role":null},{"name":"Child's Play 2","id":"tt0099253","role":null},{"name":"Bride of Chucky","id":"tt0144120","role":null},{"name":"Seed of Chucky","id":"tt0387575","role":null},{"name":"Curse of Chucky","id":"tt2230358","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1992","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Horror Film","names":[]},{"category":"Best Performance by a Younger Actor","names":[{"name":"Justin Whalin","id":"nm0923529","role":null}]}]}]},{"award":"Fangoria Chainsaw Awards 1991","titlesAwards":[{"titleAwardOutcome":"Nominated Chainsaw Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Andrew Robinson","id":"nm0732367","role":null}]}]}]}],"votes":"26,336","type":"Movie","companyCreditsSimple":[{"idCompany":"co0005073","name":"Universal Pictures"}],"keywords":{"keywords":["military school","character's point of view camera shot","serial killer","toy company","doll","toy","military exercise","third part","killer doll","villain not really dead cliche","slow motion scene","lifting someone into the air","severed hand","severed leg","severed arm","dismemberment","severed face","scythe","fog machine","held at gunpoint","shot in the leg","revolver","shot in the forehead","security guard","carousel","hand cut off","raised middle finger","hostage","threatened with a knife","stabbed in the shoulder","map","love interest","carnival","storytelling","campfire story","tent","paintball gun","vietnam war veteran","american flag","lipstick","flashlight","hiding in a closet","hide and seek","punched in the face","punched in the stomach","punishment","colonel","bunk bed","hiding under a bed","photograph","radio","polishing shoes","falling from height","garbageman","garbage truck","voodoo","package","lieutenant","locked in a closet","military cadet","bound and gagged","tv commercial","haircut","barber","newspaper clipping","yo yo","hit with a golf club","toy helicopter","marble","cigar smoking","1990s","cigarette smoking","resurrection","toy factory","returning character killed off","returning character with different actor","blood splatter","playpen magazine","chase","dark humor","black humor","black comedy","false accusation","electronic music score","framed for murder","slasher","gothic","accidental killing","sergeant","throat slitting","straight razor","shot to death","shot in the chest","shot in the arm","self sacrifice","push ups","pistol","machine gun","knife","heart attack","gore","gash in the face","exploding body","death","dart","cut into pieces","crushed to death","corpse","bully","blood","arm blown off","paintball","strangulation","target practice","rifle","haunted house","hand grenade","funfair","canteen","campfire","ambulance","possession","supernatural power","evil doll","sequel","subjective camera"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:14:15"}}