{"data":{"movies":[{"title":"Babylon 5: In the Beginning","originalTitle":"","year":"1998","releaseDate":"19980104","directors":[{"name":"Michael Vejar","id":"nm0892144"}],"writers":[{"name":"J. Michael Straczynski","id":"nm0833089"},{"name":"J. Michael Straczynski","id":"nm0833089"}],"runtime":"94 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NzAxODA5OF5BMl5BanBnXkFtZTcwOTM4MDYyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Adventure","Drama","Sci-Fi"],"plot":"The Earth military encounters an alien race called the Minbari. Through a series of accidents and misunderstandings, a war breaks out that nearly results in the death of every human on Earth. The war and its aftermath provide the background for the TV series \"Babylon 5,\" especially its first season.","simplePlot":"Emperor Londo Mollari tells the story of the Earth-Minbari war that almost destroyed Humanity and later inspired its last best hope for peace.","actors":[{"actorName":"Bruce Boxleitner","urlProfile":"http://www.imdb.com/name/nm0000310","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MTc5OTQ0M15BMl5BanBnXkFtZTcwMjY1Mjg4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1950","placeOfBirth":" Elgin, Illinois, USA","birthName":"Bruce William Boxleitner","height":"6' 2\" (1.88 m)","bio":"As one of Hollywood's leading men, Bruce Boxleitner has starred in a major motion picture franchise, numerous feature films, several popular television series, produced a major network film and TV series, performed on Broadway, and authored two science fiction novels. Boxleitner received his formal acting training on stage. A native mid-westerner, he is an alumnus of Chicago's prestigious Goodman Theatre. In 1972, he starred in the Broadway production of Status Quo Vadis with Ted Danson. He then relocated to Los Angeles and quickly landed a guest spot on the legendary TV series The Mary Tyler Moore Show as well as numerous guest roles on series, including Hawaii 5-0, Beretta, Police Woman, and Gunsmoke. Boxleitner's big break occurred when he was cast opposite James Arness in the pilot for the epic TV series How the West Was Won. He went on to star in the CBS series Bring 'em Back Alive; mini-series East of Eden; and TV movie The Last Convertible. In 1982, Boxleitner was cast as the title role in Disney's cult film TRON which garnered him science fiction fans worldwide. However, it was in Boxleitner's four-year run for CBS's 'Scarecrow and Mrs. King', starring opposite Kate Jackson, which endeared him to fans everywhere and made him a household name. In 1994, Boxleitner joined the cast of the popular TV series Babylon 5 as John Sheridan, President of the Interstellar Alliance, a war hero-turned-diplomat at the helm of Earth Alliance Space Station in the year 2259. The show aired for five seasons. Boxleitner most recently starred with Jeff Bridges in TRON: Legacy, the popular motion picture sequel to TRON. The cast includes Garrett Hedlund and Olivia Wilde. In addition, Boxleitner reprised his role in TRON: Uprising on Disney's XD TV network, his first animated TV series. The multi-talented cast includes Elijah Wood, Mandy Moore, Lance Henriksen, and Paul Reubens. The original TRON recently celebrated its 30th anniversary. Several motion pictures include Gods and Generals with Robert Duvall, Jeff Daniels, Stephen Lang and Mira Sorvino; The Babe with John Goodman and Kelly McGillis; Kuffs with Christian Slater; and The Baltimore Bullet with James Coburn. Numerous TV movie credits include The Secret with Kirk Douglas; Perfect Family with Jennifer O'Neal and Joanna Cassidy; Double Jeopardy with Rachel Ward, Sally Kirkland and Sela Ward; Passion Flower with Barbara Hershey and Nicol Williamson; and Hallmark Channel movies, 'Love's Resounding Courage' and 'Falling in Love with the Girl Next Door'; among many others. The veteran actor has appeared in numerous recurring roles on TV series including GCB and Heroes, and has guest-starred on NCIS and Chuck, among others. A skilled horseman, Boxleitner utilized his talents in numerous Western TV series and films including Kenny Rogers television movie series that aired on CBS and NBC, starring opposite Kenny Rogers; 'Gunsmoke V: One Man's Justice' with James Arness (Arness' final film); CBS' remake of Red River with Gregory Harrison, James Arness and Laura Johnson; 'Wyatt Earp: Return to Tombstone' with Hugh O'Brian; and Down the Long Hills, based on legendary western author Louis L'Amour's novel of the same name. Boxleitner was inducted into the Hall of Great Western Performers at the National Cowboy and Western Heritage Museum in Oklahoma City in April 2012 honoring him for his illustrious career in western films. He is a two-time recipient of the Wrangler Award. In 2013, Boxleitner co-starred with Andie MacDowell and Dylan Neal in Hallmark Channel's first-ever prime-time series, Debbie Macomber's Cedar Cove to rave reviews and an average of 2 million viewers. The #1 rated cable program was renewed for a third season and is scheduled to premiere in the summer of 2015. In 1999, Boxleitner authored \"Frontier Earth\" and in 2001, its sequel \"Frontier Earth: Searcher\", published by The Berkley Publishing Group. Bruce Boxleitner resides in Los Angeles with his wife, publicist Verena King, and has three sons: Sam, Lee and Michael.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI2MTc5OTQ0M15BMl5BanBnXkFtZTcwMjY1Mjg4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000310","name":"Bruce Boxleitner","idIMDB":"nm0000310"},"actorId":"nm0000310","character":"John J. Sheridan","urlCharacter":"http://www.imdb.com/character/ch0012565","main":true},{"actorName":"Mira Furlan","urlProfile":"http://www.imdb.com/name/nm0001245","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MDk1MTg1NF5BMl5BanBnXkFtZTYwODMxMjEz._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1955","placeOfBirth":" Zagreb, Croatia, Yugoslavia","height":"5' 6\" (1.68 m)","bio":"A leading actress of theatre, film and TV in the former Yugoslavia, Mira Furlan emigrated to the U.S. with her husband, Goran Gajic, in November 1991, due to the intolerable political circumstances in her homeland. Ms. Furlan starred in the Warner Brothers TV-series Babylon 5 (1994) as \"Ambassador Delenn\" (Sci-Fi Universe Award for Best Supporting Actress in a Genre TV-series 1996 and 1997). Her other American credits include the TV-movie My Antonia (1995) directed by Joseph Sargent, the title roles in \"Sophocles Antigone\" at the Hudson Guild Theatre in Los Angeles (Dramalogue Theatre Award for Outstanding Performance in 1995) and Lorca's \"Yerma\" at The Indiana Repertory Theatre. She also appeared in Brecht's \"Baal\" at The Second Stage in Los Angeles and Shaw's \"Don Juan In Hell\" in which she co-starred with Edward Asner and Rene Auberjonois. Ms. Furlan is a member of The Actor's Studio. Ms. Furlan's film credits include leading roles in over 25 films. She co-starred in Emir Kusturica's Cannes award-winning and Oscar-nominated film When Father Was Away On Business (2000). Films include: Three For Happiness, (Grand Prix, Valencia Film Festival), Beauty Of Vice, In The Jaws Of Life, The Loves Of Blanka Kolak, Dear Video etc. In addition, Ms Furlan has appeared regularly on Yugoslav Television, playing leading roles in numerous series and TV-films. She has received all the highest awards in her former country, both for her stage and film work, including two Golden Arenas (Yugoslav Oscars) for Best Actress. In the former Yugoslavia, Mira was a member of the Croatian National Theatre and a frequent guest star at major theatres in the whole country. Favorite roles include: \"Natalya\" in \"A Month In The Country\", \"Mrs. Elliot\" in \"Alpha-Beta\", \"Celimene\" in \"The Misanthrope\", \"Judith\" in \"The Devil's Disciple\", \"Annabella\" in \"Tis Pity She's A Whore\", the title role in Euripides' \"Helen\", \"Lea\" in \"Dybbuk\", \"Isabelle\" in Corneille's \"L'Illusion Comique\", \"Yvette\" in \"Mother Courage\", \"Natasha\" in \"Three Sisters\" and \"Ophelia\" in 'Jiri Menzel''s production of \"Hamlet\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MDk1MTg1NF5BMl5BanBnXkFtZTYwODMxMjEz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001245","name":"Mira Furlan","idIMDB":"nm0001245"},"actorId":"nm0001245","character":"Delenn","urlCharacter":"http://www.imdb.com/character/ch0012571","main":true},{"actorName":"Richard Biggs","urlProfile":"http://www.imdb.com/name/nm0081863","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1Nzg1MTE5OTleQTJeQWpwZ15BbWU4MDM1OTg0NTIx._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 March 1960","placeOfBirth":" Columbus, Ohio, USA","birthName":"Richard T. Biggs","height":"5' 10\" (1.78 m)","bio":"Richard Biggs had a somewhat unsettled childhood as he travelled between Air Force bases where his father was stationed. Because of his itinerant lifestyle he made few friends and changed schools often. When he was seventeen, and living at a missile base in North Dakota, he decided to change his plans for a medical career after playing the lead in a local theatrical production of 'The Wiz'. After that, bitten by the acting bug and never deterred by deafness in one ear, he went on to complete a Bachelor of Fine Arts (majoring in performing arts) at USC's School of Theatre, with the distinguished actor John Houseman as one of his drama teachers. He later went on to give his own acting classes at the Will Geer Theatricum Botanicum in Topanga Canyon. Like so many other aspiring performers, Richard had a tough time in his quest to get started in his chosen field. His chief difficulty lay in obtaining membership in the Screen Actor's Guild without experience, yet how was one to acquire experience without a union card ? Living in his car for much of this time, he made ends meet by playing small roles on stage, and, occasionally television. He also worked for a while as a telephone operator answering complaints for an LA waste disposal company. One of his local stage performances, as Romeo at the Ensemble Theatre, impressed an agent who took him on and landed him an audition for a part on the daytime soap opera Days of Our Lives (1965). Several auditions later, he got the part, and the SAG card as well. For most of his career on television, Richard played doctors, an irony which was probably not lost on him: Dr.Tomson in The Twilight Zone (1985), Dr. Lecksis in Beverly Hills, 90210 (1990), Dr.Milo Morton in \"Strong Medicine\", and, of course, Dr.Marcus Hunter, in 1295 episodes of 'Days of Our Lives', from 1985 to 1992. Richard had done his homework for the part by observing a real plastic surgeon in action. However, having played the same individual for such a lengthy period led him later to express doubts about the one-dimensional 'goody two-shoes' nature of the character, who he would have preferred a little 'rougher around the edges'. A far edgier and more complex part was that of Dr.Stephen Franklin, the chief medical officer of J. Michael Straczynski's cult sci-fi series Babylon 5 (1994). Richard played the humanly flawed, but mercurial character from 1994 to 1998 (also in three made-for-TV movies, and, briefly, in the short-lived spin-off series Crusade (1999), as part of a first-rate ensemble cast. His performances were often extremely compelling, particularly in the 'walkabout' episodes of season three, culminating with 'Shadow Dancing'. Post-Babylon, Richard played a detective in Any Day Now (1998), returned to soap opera as Clayton Boudreaux in Guiding Light (1952) and had a brief run as a scientist in the unsuccessful TV spin-off Tremors (2003). The character in his last series, Strong Medicine (2000), was killed off in the show because of the actor's tragic, untimely death at the age of 44. Richard Biggs was eulogised by Babylon 5's Straczysnky as a 'consummate professional' and 'quite simply, a terrific guy'.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1Nzg1MTE5OTleQTJeQWpwZ15BbWU4MDM1OTg0NTIx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0081863","name":"Richard Biggs","idIMDB":"nm0081863"},"actorId":"nm0081863","character":"Stephen Franklin, M.D.","urlCharacter":"http://www.imdb.com/character/ch0012580","main":true},{"actorName":"Andreas Katsulas","urlProfile":"http://www.imdb.com/name/nm0441537","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzQ4MTU2Ml5BMl5BanBnXkFtZTYwOTI0NjI3._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 May 1946","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Andrew Constantine Katsulas","height":"6' (1.83 m)","bio":"Born in St. Louis, Missouri, Andreas from a working-class Greek-American family. Attracted from early childhood to being on stage when at 4 his mother took him to see a community theater performance, he took theatre as an extra-curricular activity in high school. He then majored in it at St. Louis University, where he worked his way through school doing things like waiting on tables. Next, after earning a drama fellowship, Katsulas received a Master's Degree in Theater Arts from one of the nation's top schools for the genre, Indiana University in Bloomington, Indiana. With never a doubt or hesitation, Andreas jumped right into the professional theater world, performing in plays in his native St. Louis with the Loretto-Hilton Repertory Theater. This was followed by work with the Theatre Company of Boston. After that, Katsulas moved to New York to some challenging off-off-Broadway theater at La Mama. This was followed by a fifteen-year heart and soul involvement with Peter Brook's International Theatre Company in Paris, performing around the world with a challenging combination of improvisational theater in every imaginable circumstance and space, and \"prepared\" theater pieces in traditional, as well as unconventional, theatrical spaces. Katsulas trod the boards from Lincoln Center in New York and The Kennedy Center in Washington, D.C., to the \"mean streets\" of Brooklyn and marketplaces in remote African Villages. There were performances from elite Theater Festivals in Iran, Avignon and Belgrade: in prisons & mental institutions; at rock quarries in Australia; on barrios in Venezuela; in sewage plants in Switzerland; winding through the streets of Venice, Italy; in the fields with farm workers in California, near the lakes of Minnesota with Native Americans, in sometimes extreme conditions like snow, rain, and intensive heat. During a hiatus from the stage, a part in Michael Cimino's The Sicilian (1987) brought Andreas to Los Angeles, after which he was immediately cast as Joey Venza in Ridley Scott's Someone to Watch Over Me (1987), then as Arthur, the chauffeur, in Blake Edwards's Sunset (1988). In early 2005, Andreas was diagnosed with inoperable lung cancer; he passed away a year later, in Los Angeles. He had lived there since 1986, and had hoped to return to working in the theater before his far-too-early death, just over three months shy of his 60th birthday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzQ4MTU2Ml5BMl5BanBnXkFtZTYwOTI0NjI3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0441537","name":"Andreas Katsulas","idIMDB":"nm0441537"},"actorId":"nm0441537","character":"G'Kar","urlCharacter":"http://www.imdb.com/character/ch0012572","main":true},{"actorName":"Peter Jurasik","urlProfile":"http://www.imdb.com/name/nm0432867","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMDkwNDU0Ml5BMl5BanBnXkFtZTcwNDk2MDcyNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1950","placeOfBirth":" Queens, New York, USA","height":"5' 10½\" (1.79 m)","bio":"Peter Jurasik began his professional career as a stage actor working in off Broadway productions in New York and later in tours and regional theaters up and down the east coast. In 1975, he moved to Los Angeles beginning a twenty five year run as a character actor continuing to act on stage, but additionally working in feature films, in nightclubs doing comedy and especially on television with hundreds of TV appearances in both comedies and dramas. Audiences seem to remember him best for his work on 'Hill Street Blues' as Sid and later in 'Babylon 5' as Londo. He has received awards for his work on both of these shows.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwMDkwNDU0Ml5BMl5BanBnXkFtZTcwNDk2MDcyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0432867","name":"Peter Jurasik","idIMDB":"nm0432867"},"actorId":"nm0432867","character":"Londo Mollari","urlCharacter":"http://www.imdb.com/character/ch0012577","main":true},{"actorName":"Theodore Bikel","urlProfile":"http://www.imdb.com/name/nm0000942","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0Nzc0MTI4NF5BMl5BanBnXkFtZTcwODc0MTMzMQ@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 May 1924","placeOfBirth":" Vienna, Austria","birthName":"Theodor Meir Bikel","height":"6' 1\" (1.85 m)","bio":"Theodore Bikel is one of the most versatile and respected actors and performers of his generation. A master of languages, dialects and accents, he has played every sort of film villain and semi-bad guy imaginable, and always adds depth, dimension and even sympathy to characters that would end up as cardboard cutouts in the hands of lesser actors. His memorable supporting roles include a German naval officer in The African Queen (1951), the king of Serbia in Moulin Rouge (1952) and a German submarine officer in The Enemy Below (1957). He was nominated for an Academy Award for his role in The Defiant Ones (1958). Equally at home on the stage, Bikel is remembered for creating the role of Captain Von Trapp in the original Broadway cast of \"The Sound of Music\" opposite Mary Martin. He also appeared on stage in \"Tonight in Samarkand\", \"The Lark\" and \"The Rope Dancers\". Bikel is fluent in more than half a dozen European and Middle Eastern languages, and sings folk songs in nearly 20 languages, skillfully accompanying himself on guitar, mandolin, balalaika and harmonica. He was a regular on the early 1960s TV show Hootenanny (1963), a weekly cavalcade of folk music. Over the years he has performed on college campuses and in concert halls all over the country, and has recorded a number of record albums of folk music from around the world.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk0Nzc0MTI4NF5BMl5BanBnXkFtZTcwODc0MTMzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000942","name":"Theodore Bikel","nicknames":["Theo"],"idIMDB":"nm0000942"},"actorId":"nm0000942","character":"Lenonn","urlCharacter":"http://www.imdb.com/character/ch0178817","main":true},{"actorName":"Reiner Schöne","urlProfile":"http://www.imdb.com/name/nm0770635","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwOTQ4NTM1NV5BMl5BanBnXkFtZTcwNjk3NDY3NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 January 1942","placeOfBirth":" Fritzlar, Germany","height":"6' 4½\" (1.94 m)","bio":"A tall, German actor with a constant villainous and cunning gaze in his eyes is Reiner Schone. Born in Germany on January 19, 1942, Reiner studied acting at the German National Theatre Weimar. He started his acting career in the '60s and since then has enjoyed his share of longevity in television and film. He work goes between European and western films and television series. Among his performance, Reiner is best known in films such as The Eiger Sanction (1975) starring Clint Eastwood. In television, he is best associated with episodes from Star Trek: The Next Generation, MacGyver and Babylon 5. In 1997, he appeared as the villain Shinnok in Mortal Kombat: Annihilation, the sequel to the movie based off the popular martial arts video game. Afterwards, Reiner continued darting back and forth between western and German productions. He is married and at one time moved to Los Angeles, California before moving in 2002 to Berlin, Germany where he lives now.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwOTQ4NTM1NV5BMl5BanBnXkFtZTcwNjk3NDY3NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0770635","name":"Reiner Schöne","idIMDB":"nm0770635"},"actorId":"nm0770635","character":"Dukhat","urlCharacter":"http://www.imdb.com/character/ch0076724","main":true},{"actorName":"Michael O'Hare","urlProfile":"http://www.imdb.com/name/nm0641365","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMzgxNjEzN15BMl5BanBnXkFtZTgwMzE5ODQ1MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 May 1952","placeOfBirth":" Chicago, Illinois, USA","birthName":"Robert Michael O'Hare","height":"6' 1\" (1.85 m)","bio":"Michael O'Hare was born on May 6, 1952 in Chicago, Illinois, USA as Robert Michael O'Hare. He was an actor, known for Babylon 5 (1994), One Life to Live (1968) and Babylon 5: The Gathering (1993). He was married to Ruth Ivy Ballam. He died on September 28, 2012 in the USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxMzgxNjEzN15BMl5BanBnXkFtZTgwMzE5ODQ1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0641365","name":"Michael O'Hare","nicknames":["Mike"],"idIMDB":"nm0641365"},"actorId":"nm0641365","character":"Lt. Cmdr. Jeffrey Sinclair","urlCharacter":"http://www.imdb.com/character/ch0012584","main":true},{"actorName":"Robin Atkin Downes","urlProfile":"http://www.imdb.com/name/nm0235960","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY1NTQ5MjU4NV5BMl5BanBnXkFtZTgwMzk4OTEyODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1976","placeOfBirth":" London, England, UK","height":"6' 2\" (1.88 m)","bio":"Robin Atkin Downes has an extensive and distinguished career in all aspects of the film and television industry, not only as an accomplished actor but also as a director, producer, voice-over artist, motion capture artist and music producer. Born and raised in the U.K., he was trained in the United States, with a Masters of Fine Arts degree from Temple University in Philadelphia. Robin's on-camera credits include series regular, recurring and guest starring roles on many shows, including Criminal Minds (2005), NCIS: Los Angeles (2009), Entourage (2004), CSI: Miami (2002), The Starter Wife (2008) and In Plain Sight (2008), among others. He has also worked on many features, including Pirates of the Caribbean: At World's End (2007), Transformers: Revenge of the Fallen (2009), How to Train Your Dragon (2010), and Mission: Impossible - Ghost Protocol (2011). His creature vocal effects can be heard in many films, including Aliens vs. Predator: Requiem (2007), The Tale of Despereaux (2008), X-Men Origins: Wolverine (2009), The Wolfman (2010), Immortals (2011), and Happy Feet 2 (2011). As a voice-over artist, Robin is one of the most prolific voice actors in Los Angeles and is proficient in over 60 dialects. He has acted in 100's of the top interactive titles in the industry, as well as work on commercials and animated shows. His current animated series work includes roles in Thundercats (2011), Star Wars: The Clone Wars (2008), The Avengers: Earth's Mightiest Heroes (2010), Regular Show in Space (2009), and Green Lantern: The Animated Series (2011), among many others. Robin performed the role of David in Katsuhiro Ôtomo's Steamboy (2004), with Patrick Stewart, Alfred Molina and Anna Paquin. Other interactive credits include Talbot in Uncharted 3: Drake's Deception (2011), Joseph Capelli in Resistance 3 (2011), Atoq Navarro in Uncharted: Drake's Fortune (2007), Sean Devlin in The Saboteur (2009), and Travis Touchdown in No More Heroes (2007). His vocal creature skills were used for several of the locust creatures in the Gears of War (2006) franchise as well as the characters Kim Minh, Niles and Chaps. In addition, he also voices promos and trailers for television and film. Robin's stage credits include performances in London, Prague and the United States, including \"John Wilkes Booth\" in the Philadelphia premiere of \"Assassins\", \"Cyranau De Bergerac\" at the famed Walnut Street Theatre, \"Skinlad/Brink\" in \"Road\", performed at The Wilma Theatre, and in Prague and the title role in \"Dracula\" at the Hermosa Playhouse.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDY1NTQ5MjU4NV5BMl5BanBnXkFtZTgwMzk4OTEyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0235960","name":"Robin Atkin Downes","idIMDB":"nm0235960"},"actorId":"nm0235960","character":"Morann","urlCharacter":"http://www.imdb.com/character/ch0178818","main":true},{"actorName":"J. Patrick McCormack","urlProfile":"http://www.imdb.com/name/nm0566445","urlPhoto":"","biography":{"height":"6' 1\" (1.85 m)","bio":"J. Patrick McCormack is an actor, known for Armageddon (1998), Catch Me If You Can (2002) and Zodiac (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0566445","name":"J. Patrick McCormack","idIMDB":"nm0566445"},"actorId":"nm0566445","character":"General Lefcourt","urlCharacter":"http://www.imdb.com/character/ch0078466","main":true},{"actorName":"Tricia O'Neil","urlProfile":"http://www.imdb.com/name/nm0642078","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTc1MTA0N15BMl5BanBnXkFtZTgwMTkyMTY2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 March 1945","placeOfBirth":" Shreveport, Louisiana, USA","bio":"Tricia O'Neil was born on March 11, 1945 in Shreveport, Louisiana, USA. She is an actress, known for Titanic (1997), Piranha Part Two: The Spawning (1981) and Babylon 5: In the Beginning (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwMTc1MTA0N15BMl5BanBnXkFtZTgwMTkyMTY2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0642078","name":"Tricia O'Neil","idIMDB":"nm0642078"},"actorId":"nm0642078","character":"Earth Alliance President","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robin Sachs","urlProfile":"http://www.imdb.com/name/nm0755179","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MTYyODA1M15BMl5BanBnXkFtZTYwNzg4OTcy._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1951","placeOfBirth":" Hammersmith, London, England, UK","birthName":"Robin David Sachs","height":"6' 0½\" (1.84 m)","bio":"Robin Sachs was born on February 5, 1951 in Hammersmith, London, England as Robin David Sachs. He was an actor, known for The Lost World: Jurassic Park (1997), Galaxy Quest (1999) and Ocean's Eleven (2001). He was married to Casey DeFranco and Siân Phillips. He died on February 1, 2013 in Los Angeles, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MTYyODA1M15BMl5BanBnXkFtZTYwNzg4OTcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0755179","name":"Robin Sachs","idIMDB":"nm0755179"},"actorId":"nm0755179","character":"Coplann","urlCharacter":"http://www.imdb.com/character/ch0178819","main":true},{"actorName":"James Patrick Stuart","urlProfile":"http://www.imdb.com/name/nm0835722","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ3MjE2ODk3Ml5BMl5BanBnXkFtZTgwMjgyMTE3OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 June 1968","placeOfBirth":" Encino, California, USA","height":"6' (1.83 m)","bio":"James Patrick Stuart was born on June 16, 1968 in Encino, California, USA. He is an actor, known for Pretty Woman (1990), It's Complicated (2009) and The Penguins of Madagascar (2008). He has been married to Jocelyn since September 9, 2000. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ3MjE2ODk3Ml5BMl5BanBnXkFtZTgwMjgyMTE3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0835722","name":"James Patrick Stuart","idIMDB":"nm0835722"},"actorId":"nm0835722","character":"Presidential Aide","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Ross-Azikiwe","urlProfile":"http://www.imdb.com/name/nm0743932","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjcwMTE4MV5BMl5BanBnXkFtZTgwMjU0NTc3MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"birthName":"Jaja N'Namdi Azikiwe","bio":"Jason Ross-Azikiwe was born as Jaja N'Namdi Azikiwe. He is an actor, known for Die Hard 2 (1990), Babylon 5: In the Beginning (1998) and Army of One (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgzMjcwMTE4MV5BMl5BanBnXkFtZTgwMjU0NTc3MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0743932","name":"Jason Ross-Azikiwe","idIMDB":"nm0743932"},"actorId":"nm0743932","character":"Captain Sterns","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Yasemin Baytok","urlProfile":"http://www.imdb.com/name/nm0063234","urlPhoto":"","biography":{"bio":"Yasemin Baytok is an actress, known for Babylon 5: In the Beginning (1998), Indecent Proposal (1993) and Helicopter (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0063234","name":"Yasemin Baytok","idIMDB":"nm0063234"},"actorId":"nm0063234","character":"Centauri Woman","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0120711","urlIMDB":"http://www.imdb.com/title/tt0120711","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 34 min (94 min) (USA)","1 hr 31 min (91 min) (PAL DVD)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.7","filmingLocations":[],"rated":"UNRATED","awards":[{"award":"Primetime Emmy Awards 1998","titlesAwards":[{"titleAwardOutcome":"Nominated Primetime Emmy","categories":[{"category":"Outstanding Makeup for a Series","names":[{"name":"John Vulich","id":"nm0904418","role":"series makeup effects creator"},{"name":"John Wheaton","id":"nm0923722","role":"makeup effects sculptor"},{"name":"Jeffrey S. Farley","id":"nm0267651","role":"makeup effects supervisor"},{"name":"Mark Garbarino","id":"nm0304918","role":"special makeup effects artist"},{"name":"Jerry Gergely","id":"nm0314265","role":"special makeup effects artist"},{"name":"Gabriel De Cunto","id":"nm0208190","role":"special makeup effects artist"},{"name":"Manny Case","id":"nm0143236","role":"special makeup effects artist"},{"name":"Cinzia Zanetti","id":"nm0952966","role":"makeup artist"},{"name":"Jason Barnett","id":"nm0055912","role":"makeup artist"},{"name":"Michael S. Pack","id":"nm0655443","role":"makeup artist"},{"name":"Ron Pipes","id":"nm0684962","role":"makeup artist"},{"name":"Glen Eisner","id":"nm0252142","role":"special makeup effects artist"},{"name":"Greg Funk","id":"nm0298727","role":"special makeup effects artist"}]}]}]}],"votes":"6,093","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0039264","name":"Babylonian Productions"},{"idCompany":"co0009512","name":"TNT"}],"keywords":{"keywords":["alien","space opera","23rd century","alien invasion","space station","genocide","outer space","cult film","future","spacecraft","sequel","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:00:11"}}