{"data":{"movies":[{"title":"Tom and Huck","originalTitle":"","year":"1995","releaseDate":"19951222","directors":[{"name":"Peter Hewitt","id":"nm0382072"}],"writers":[{"name":"Mark Twain","id":"nm0878494"},{"name":"Stephen Sommers","id":"nm0814085"}],"runtime":"97 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxNDYzMDY1OV5BMl5BanBnXkFtZTcwNDA2MzYxMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Adventure","Comedy","Drama","Family","Romance","Western"],"plot":"A mischievous young boy, Tom Sawyer (, witnesses a murder by the deadly Injun Joe. Tom becomes friends with Huckleberry Finn (, a boy with no future and no family. Tom has to choose between honoring a friendship or honoring an oath because the town alcoholic is accused of the murder. Tom and Huck go through several adventures trying to retrieve evidence.","simplePlot":"Tom and Huck witness Injun Joe's killing of Doc Robinson one night at the graveyard. When an innocent man is accused of killing the Doc, Tom steps up as a witness, not respecting the promise made to Huck to lay low.","actors":[{"actorName":"Jonathan Taylor Thomas","urlProfile":"http://www.imdb.com/name/nm0001795","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQwNjc0MTYwN15BMl5BanBnXkFtZTYwNzE3NzQz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 September 1981","placeOfBirth":" Bethlehem, Pennsylvania, USA","birthName":"Jonathan Taylor Weiss","height":"5' 6\" (1.68 m)","bio":"Jonathan Taylor Thomas was born Jonathan Taylor Weiss on September 8, 1981 in Bethlehem, Pennsylvania, to Claudine (Gonsalves) and Stephen Weiss. He has an older brother, Joel, and has Pennsylvania Dutch (German) and Portuguese ancestry. Growing up, he liked the music group Boyz II Men, and his favorite TV shows were Roseanne (1988) and Grace Under Fire (1993), but he also liked watching CNN news, to keep up to date with current events. One thing that Jonathan does not like is meat. He has been a vegetarian since he was four years old, and he doesn't use products that are tested on animals because he believes that it is wrong to hurt them. When Jonathan was four years old, his family moved from Bethlehem to Sacramento, California. At the age of seven, Jonathan was working as a model for print advertisements in Sacramento, and over the next few years, he appeared in TV commercials for Kelloggs cereal, Mattel toys and for many other products. By this time, Jonathan was ready for bigger roles, and in 1989, he landed the part of Greg Brady's son Kevin in the TV special The Bradys (1990). In 1990, he landed his biggest role yet, as Randy Taylor on Home Improvement (1991). Jonathan's audition went well, but what really gave him an edge over the other boys was that the casting directors thought that he looked a lot like his TV dad-to-be, Tim Allen. In 1991, Jonathan's parents divorced. He lived with his mother and his brother. He began work in feature length movies, as the voice of young Simba in Disney's The Lion King (1994), and as Ben Archer in Man of the House (1995) opposite Chevy Chase. Among his other movies are Tom and Huck (1995), The Adventures of Pinocchio (1996), Wild America (1997), and I'll Be Home for Christmas (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQwNjc0MTYwN15BMl5BanBnXkFtZTYwNzE3NzQz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001795","name":"Jonathan Taylor Thomas","nicknames":["JTT","Jon"],"idIMDB":"nm0001795"},"actorId":"nm0001795","character":"Tom Sawyer","urlCharacter":"http://www.imdb.com/character/ch0028051","main":true},{"actorName":"Brad Renfro","urlProfile":"http://www.imdb.com/name/nm0000605","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1NDE3NDA1MDVeQTJeQWpwZ15BbWU3MDE1NTg5MjE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1982","placeOfBirth":" Knoxville, Tennessee, USA","birthName":"Brad Barron Renfro","height":"5' 8\" (1.73 m)","bio":"Brad Renfro was born on July 25, 1982 in Knoxville, Tennessee, to Angela Denise McCrory and Mark Renfro, a factory worker. He was discovered at age 10 by director Joel Schumacher and was cast in the motion picture The Client (1994), which starred Susan Sarandon and Tommy Lee Jones. Although this would be his zenith, he went on to appear in other films, including The Cure (1995), Tom and Huck (1995), Sleepers (1996), and Apt Pupil (1998). Renfro won The Hollywood Reporter's Young Star Award in 1995 and was nominated as one of People magazine's \"Top 30 Under 30,\" though addiction problems in his teens and early 20s led to several police arrests and hampered his career. He died of a drug overdose in January 2008, aged 25.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1NDE3NDA1MDVeQTJeQWpwZ15BbWU3MDE1NTg5MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000605","name":"Brad Renfro","nicknames":["Pagey","Renfreak","Fro"],"idIMDB":"nm0000605"},"actorId":"nm0000605","character":"Huck Finn","urlCharacter":"http://www.imdb.com/character/ch0256820","main":true},{"actorName":"Eric Schweig","urlProfile":"http://www.imdb.com/name/nm0777760","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyODg1MjQwN15BMl5BanBnXkFtZTYwNjAzNTky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 June 1967","placeOfBirth":" Inuvik, Northwest Territories, Canada","birthName":"Ray Dean Thrasher","height":"6' 2\" (1.88 m)","bio":"Eric Schweig was born on June 19, 1967 in Inuvik, Northwest Territories, Canada as Ray Dean Thrasher. He is an actor, known for The Last of the Mohicans (1992), Blackstone (2011) and The Missing (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyODg1MjQwN15BMl5BanBnXkFtZTYwNjAzNTky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0777760","name":"Eric Schweig","idIMDB":"nm0777760"},"actorId":"nm0777760","character":"Injun Joe","urlCharacter":"http://www.imdb.com/character/ch0035098","main":true},{"actorName":"Charles Rocket","urlProfile":"http://www.imdb.com/name/nm0734236","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzODUyMDc4N15BMl5BanBnXkFtZTcwNTY3MjgxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1949","placeOfBirth":" Bangor, Maine, USA","birthName":"Charles Adams Claverie","height":"6' 4½\" (1.94 m)","bio":"Charles Rocket was born on August 24, 1949 in Bangor, Maine, USA as Charles Adams Claverie. He was an actor, known for Dumb & Dumber (1994), Dances with Wolves (1990) and Hocus Pocus (1993). He was married to Mary Elizabeth (Beth) Crellin. He died on October 7, 2005 in Canterbury, Connecticut, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzODUyMDc4N15BMl5BanBnXkFtZTcwNTY3MjgxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0734236","name":"Charles Rocket","idIMDB":"nm0734236"},"actorId":"nm0734236","character":"Judge Thatcher","urlCharacter":"http://www.imdb.com/character/ch0035097","main":true},{"actorName":"Amy Wright","urlProfile":"http://www.imdb.com/name/nm0942195","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzE5NzgzMl5BMl5BanBnXkFtZTcwNzExMTkwMw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 April 1950","placeOfBirth":" Chicago, Illinois, USA","bio":"One of those dazzling chameleon players who never received their due, Amy Wright is still woefully unrecognized despite a superb resumé of Southern-styled film credits since the late 70s. On the other side of the coin, she has certainly made a distinct name for herself in the theater world as the embodiment of down-home eccentricity. As a testament to her interesting dichotomy as an offbeat actress, she played much younger than she was at the onset of her career; these days she tends to play older. Born on April 15, 1950, in Chicago, Amy was raised in the Midwest and eventually attended Beloit College. She gave up her position as a teacher to pursue her dream to be an actress in New York. Elfin in quality with an intriguing, gap-toothed look, the child-like blonde actress found almost immediate reassurance as an apprentice at actor Rip Torn's Sanctuary Theater, making her stage debut in the company's 1975 production of \"Agnes and Joan\". Amy and her much older mentor (then married to theater legend Geraldine Page) began a clandestine personal relationship that produced two daughters. Torn never divorced Ms. Page and his longtime relationship with Amy was exposed shortly before his wife's sudden death of a heart attack in 1987. The couple eventually married. Interestingly, Amy appeared with both Torn and Ms. Page in the August Strindberg short plays \"Miss Julie\", \"Creditors\" and \"The Stronger\" in 1977 in repertory at the Hudson Guild Theatre, later taking the last two plays to the Public Theater. Amy's sweetly countrified look and demeanor inspired a number of standout performances in high quality productions. At age 26, she earned her first major attention on stage playing a crippled teen in a successful revival of Lanford Wilson's \"The Rimers of Eldrich\" in 1976. Two years later Wilson wrote the stage part of a lifetime for her as 13-year-old Shirley Tally in his acclaimed work \"Fifth of July\" off-Broadway in 1978. The show made a spectacular transition to Broadway in 1980. In 1983 she shared the Drama Desk Award for her ensemble contribution in the comedy farce \"Noises Off\". Amy's film debut was in trademark quirky form with Martha Coolidge's documentary-styled Not a Pretty Picture (1976), and she went on to minor roles in the small-town \"A\" pictures The Deer Hunter (1978) and Breaking Away (1979). Arguably one of her most spellbinding film appearances came as Harry Dean Stanton's religiously wacko 15-year-old daughter, Sabbath Lily, in John Huston's Wise Blood (1979), following this with an equally strange comic role as a bed-hopping groupie in Woody Allen's Stardust Memories (1980). Amy also shared moments of brilliance opposite John Savage's handicapped lead in Inside Moves (1980); as William Hurt's spinster sis in The Accidental Tourist (1988); in Beth Henley's Southern-baked beauty contest spoof Miss Firecracker (1989); and as Jeff Daniels' soon-to-be-married sister in Love Hurts (1990). As much as these performances should have placed her at the very top of the Hollywood echelon of character players, Wright was surprisingly ignored for film awards and continued more or less obscurely. Nevertheless, she continued to make strong stage showings opposite the late Uta Hagen in the Off-Broadway winner \"Mrs. Klein\" in 1995, and as part of the familial comedy relief in \"Lake Hollywood\" (1999). Other reported stage appearances over time have included \"Breakfast with Les and Bes\", \"Hamlet\", A Village Wooing\", \"The Little Foxes\" and \"Prin\". On camera she continues with her thoroughly offbeat ways in such movies as The Scarlet Letter (1995), Tom and Huck (1995) (as Aunt Polly), Winning Girls Through Psychic Mind Control (2002), Messengers (2004) and her most recent, The Namesake (2006), along with rare TV appearances in such popular shows as \"Law and Order\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NzE5NzgzMl5BMl5BanBnXkFtZTcwNzExMTkwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0942195","name":"Amy Wright","idIMDB":"nm0942195"},"actorId":"nm0942195","character":"Aunt Polly","urlCharacter":"http://www.imdb.com/character/ch0035096","main":true},{"actorName":"Michael McShane","urlProfile":"http://www.imdb.com/name/nm0574540","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDgwNDE3MTcwNV5BMl5BanBnXkFtZTcwNzY0NzIzNw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 June 1955","placeOfBirth":" Boston, Massachusetts, USA","height":"6' (1.83 m)","bio":"Michael McShane was born on June 25, 1955 in Boston, Massachusetts, USA. He is known for his work on Robin Hood: Prince of Thieves (1991), A Bug's Life (1998) and 35 heures, c'est déjà trop (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDgwNDE3MTcwNV5BMl5BanBnXkFtZTcwNzY0NzIzNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0574540","name":"Michael McShane","idIMDB":"nm0574540"},"actorId":"nm0574540","character":"Muff Potter","urlCharacter":"http://www.imdb.com/character/ch0035094","main":true},{"actorName":"Marian Seldes","urlProfile":"http://www.imdb.com/name/nm0783033","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MjE4MDI5NF5BMl5BanBnXkFtZTYwMzk0Nzcy._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 August 1928","placeOfBirth":" New York City, New York, USA","birthName":"Marian Hall Seldes","height":"5' 9\" (1.75 m)","bio":"Tony Award-winner Marian Hall Seldes, one of the premier stage actresses in America, was born on August 23, 1928 in Manhattan, New York, to writer and journalist Gilbert Seldes, and his socialite wife, the former Alice Wadhams Hall. Her paternal grandparents were Russian Jewish immigrants, and her mother was from an Episcopalian family with deep roots in the United States. Marian studied drama at the Neighborhood Playhouse with Sanford Meisner and dance with Martha Graham. She honed her craft with the legendary Broadway diva, Katharine Cornell, with whom she appeared in the play, \"That Lady\", in the 1949-50 season. Seldes, herself, taught acting at The Juilliard School from 1967 to 1991 and at Fordham University's Lincoln Center campus since 2002. Her students include Oscar-winners William Hurt, Kevin Kline and Robin Williams, Emmy Award-winners Kelsey Grammer and Laura Linney, and Tony Award-winner Patti LuPone. She made her Broadway debut, in 1948, in Robinson Jeffers' adaptation of \"Medea\", with acting great Judith Anderson giving a legendary performance as Euripides' scorned heroine in a production directed by John Gielgud, who also played \"Jason\". It began a career that lasted 59 years: She last appeared on Broadway in 2007 in Terrence McNally's \"Deuce\". Along the way, she was nominated for a Tony Award five times, winning on her first nod for Edward Albee's A Delicate Balance (1973). Seldes has long been associated with Albee, appearing in three of his plays, starting with \"Tiny Alice\" in 1962. (Albee's Pulitzer Prize-winning \"Three Tall Women\", which starred Seldes, did not play the Great White Way but appeared off-Broadway.) Seldes also has had an extensive career in movies, television and radio, playing everything from Emily Brontë in the 1952 TV movie, Our Sister Emily (1952), to Lucas McCain's dead wife in The Rifleman (1958) episode, The Rifleman: The Vision (1960) in 1960, to First Lady Eleanor Roosevelt in Truman (1995) to Mr. Big's mother on Sex and the City (1998). She also has done extensive work as a radio actress, appearing on the CBS Radio Mystery Theater, from 1974 to 1982. Her first marriage to Julian Claman, by whom she had a daughter, ended in divorce in 1961. She was married to screenwriter Garson Kanin from 1990 until his death in 1999. In 2010, Marian Seldes received a Tony Lifetime Achievement Award for her great career in the theater as befits her reputation as one of America's greatest stage performers.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3MjE4MDI5NF5BMl5BanBnXkFtZTYwMzk0Nzcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0783033","name":"Marian Seldes","idIMDB":"nm0783033"},"actorId":"nm0783033","character":"Widow Douglas","urlCharacter":"http://www.imdb.com/character/ch0035100","main":true},{"actorName":"Rachael Leigh Cook","urlProfile":"http://www.imdb.com/name/nm0000337","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NjIwMTM2MV5BMl5BanBnXkFtZTcwMjM0ODYyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 October 1979","placeOfBirth":" Minneapolis, Minnesota, USA","height":"5' 2\" (1.57 m)","bio":"Minneapolis native Rachael Leigh Cook began her career as a model at the tender age of 10, gracing Milk-Bone(R) boxes and Target(R) ads nationwide in the USA. She also appeared in a now-famous (in the USA) anti-drug TV spot in which, armed with a frying pan, she bashed her way through a kitchen to show the disastrous effects of heroin. At 14, her modeling agency sent her to read for a short film (26 Summer Street (1996)) and changed the course of her young life--from that moment on, Cook was hooked on acting. When she reached L.A. later that year, Cook bypassed the wannabe stage and nailed her first audition (for the part of a budding entrepreneur in The Baby-Sitters Club (1995)). She returned to theaters three months later in the Jonathan Taylor Thomas vehicle Tom and Huck (1995), then filled her calendar with appearances in independent and made-for-TV movies. She divided her time between Minneapolis and Tinseltown, shuttling from school events to movie shoots with her mother in tow. Cook's starlet status crystallized in 1999, when she starred opposite Freddie Prinze Jr. in the Pygmalion retelling She's All That (1999). Her on-screen transformation from ugly duckling to ravishing beauty scored several teen-oriented awards and made Cook a hot commodity in Hollywood. She signed for a handful of plum follow-up roles, including a troubled adolescent in Sylvester Stallone's Get Carter (2000), a frontier gal in Texas Rangers (2001), and the caterwauling lead in the live-action version of Josie et les Pussycats (2001). Cook now lives primarily in Los Angeles, but she returns home frequently to visit with friends and family. Her father, Tom (a former stand-up comic), is a social worker in the public school system, and her younger brother, Ben, is an aspiring filmmaker.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NjIwMTM2MV5BMl5BanBnXkFtZTcwMjM0ODYyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000337","name":"Rachael Leigh Cook","nicknames":["The Indie Queen","Cook"],"idIMDB":"nm0000337"},"actorId":"nm0000337","character":"Becky Thatcher","urlCharacter":"http://www.imdb.com/character/ch0035088","main":true},{"actorName":"Lanny Flaherty","urlProfile":"http://www.imdb.com/name/nm0280890","urlPhoto":"","biography":{"dateOfBirth":"27 July 1942","placeOfBirth":" Pontotoc, Mississippi, USA","bio":"Lanny Flaherty was born on July 27, 1942 in Pontotoc, Mississippi, USA. He is an actor, known for Signs (2002), Natural Born Killers (1994) and Waterworld (1995).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0280890","name":"Lanny Flaherty","idIMDB":"nm0280890"},"actorId":"nm0280890","character":"Emmett","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Courtland Mead","urlProfile":"http://www.imdb.com/name/nm0574882","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNDA3NjIxMF5BMl5BanBnXkFtZTcwNTUwNTUwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 April 1987","placeOfBirth":" Mission Viejo, California, USA","birthName":"Courtland Robert Mead","height":"5' 8\" (1.73 m)","bio":"Courtland Mead was born on April 19, 1987 in Mission Viejo, California, USA as Courtland Robert Mead. He is an actor, known for The Little Rascals (1994), A Bug's Life (1998) and Babe, le cochon devenu berger (1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNDA3NjIxMF5BMl5BanBnXkFtZTcwNTUwNTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0574882","name":"Courtland Mead","idIMDB":"nm0574882"},"actorId":"nm0574882","character":"Sid","urlCharacter":"http://www.imdb.com/character/ch0035099","main":true},{"actorName":"Peter Mackenzie","urlProfile":"http://www.imdb.com/name/nm0533380","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwODU2MDE5MF5BMl5BanBnXkFtZTcwNzcyMzc4MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"6' 2\" (1.88 m)","bio":"Peter Mackenzie is an actor, known for Black-ish (2014), Trumbo (2015) and Project X (2012).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwODU2MDE5MF5BMl5BanBnXkFtZTcwNzcyMzc4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0533380","name":"Peter Mackenzie","idIMDB":"nm0533380"},"actorId":"nm0533380","character":"Mr. Sneed","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Heath Lamberts","urlProfile":"http://www.imdb.com/name/nm0483351","urlPhoto":"","biography":{"dateOfBirth":"15 December 1941","placeOfBirth":" Toronto, Ontario, Canada","birthName":"James Langcaster","bio":"Toronto-born Heath Lamberts began his show-business career on stage in Canada in the early 1960s, performing regularly at the Stratford Festival and the Shaw Festival. He was a well regarded stage actor, receiving good notices for his roles in \"Cyrano de Bergerac\" and \"Beauty and the Beast.\" When he began making films, however, he gravitated towards more comedic roles, with appearances in such films as Nothing Personal (1980) and Utilities (1983). He kept quite busy on television, appearing in many comedy and drama series and several made-for-TV movies. He died in Pittsburgh, Pennsylvania, from cancer in 2005.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0483351","name":"Heath Lamberts","idIMDB":"nm0483351"},"actorId":"nm0483351","character":"Schoolmaster Dobbins","urlCharacter":"http://www.imdb.com/character/ch0035101","main":true},{"actorName":"William Newman","urlProfile":"http://www.imdb.com/name/nm0628309","urlPhoto":"","biography":{"dateOfBirth":"15 June 1934","placeOfBirth":" Chicago, Illinois, USA","birthName":"William MacLeod Newman","bio":"William Newman made his film debut in the Stuart Rosenberg film Brubaker (1980), starring Robert Redford, and followed this up with The Postman Always Rings Twice (1981) opposite Jack Nicholson and Jessica Lange. Acting roles continued through out the 1980s with roles in the Stephen King horror film Silver Bullet (1985) alongside Gary Busey and Corey Haim, the drama The Mosquito Coast (1986) with Harrison Ford and River Phoenix, and the Chevy Chase comedy Funny Farm (1988). He played a sheriff in the The Last Days of Frank and Jesse James (1986) and appeared in George A. Romero's Monkey Shines (1988) proving that, as a character actor, he has the ability to adapt to various genres. During the 1990s, work for Newman did not slow down. He appeared in: Leprechaun (1993), Mrs. Doubtfire (1993), Stephen King's The Stand (1994) opposite Rob Lowe, The Craft (1996) and Touch (1997), the latter two films with Skeet Ulrich. Newman has since worked steady in film, but is also a familiar face on TV, his roles including Eerie, Indiana (1991) episode 'Mr Chaney', Picket Fences (1992), and My Name Is Earl (2005).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0628309","name":"William Newman","idIMDB":"nm0628309"},"actorId":"nm0628309","character":"Doc Robinson","urlCharacter":"http://www.imdb.com/character/ch0107203","main":true},{"actorName":"Joey Stinson","urlProfile":"http://www.imdb.com/name/nm0830470","urlPhoto":"","biography":{"bio":"Joey Stinson is an actor, known for Now and Then (1995), Tom and Huck (1995) and A Step Toward Tomorrow (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0830470","name":"Joey Stinson","idIMDB":"nm0830470"},"actorId":"nm0830470","character":"Joe Harper","urlCharacter":"http://www.imdb.com/character/ch0035104","main":true},{"actorName":"Blake Heron","urlProfile":"http://www.imdb.com/name/nm0380231","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTExMmI3ZWQtZGVhOS00ZWFkLWIwYjMtNzI4NDBhMjBiOTQ5XkEyXkFqcGdeQXVyNzM4Nzg1MzI@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 January 1982","placeOfBirth":" Sherman Oaks, California, USA","bio":"Blake Heron was born in Massapequa, New York, in Long Island on January 11th, 1982. At the age of 7 he moved to Marietta, Georgia. Having been fixated on movies and being an actor at a very young age, it was in Marietta where he got his first agent at an agency in Atlanta called Kiddin' Around. The first project he ever booked was for a Rich's Department Store commercial, followed by various other commercials and modeling gigs. Things went successfully fairly quickly and it wasn't too long before Blake booked his first role in a miniseries on TNT called Andersonville about the Civil War prison camp of the same name. Around this time Blake made the move out west to Los Angeles so he could continue pursuing his dream. He promptly got setup with a new agent and manager out in L.A. and continued plugging away at guest star roles on TV shows, as well as various roles in feature films and other movies of the week. He landed his first starring role at the age of 12 in the movie Shiloh, portraying the role of Marty Preston. The movie went on to be well received, and Blake won a Young Artist Award for Best Performance as a leading young actor. From the ages of 13 to 22 Blake performed in many more TV shows as a guest star, recurring roles, and series regular. He also was featured in, and starred in many other feature films. Blake has taken a much edgier direction with his career lately, taking more serious roles that portray an element of danger, but has also taken on roles that depict the compassionate and understanding side he has played in the past. He has performed in a handful of guest star roles over the past few years on shows like NCIS: New Orleans, Criminal Minds, FX's new John Singleton series Snowfall, as well as various roles in feature films as well. One of the feature films, A Thousand Junkies, is world premiering at the Tribeca Film Festival in April of 2017.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTExMmI3ZWQtZGVhOS00ZWFkLWIwYjMtNzI4NDBhMjBiOTQ5XkEyXkFqcGdeQXVyNzM4Nzg1MzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0380231","name":"Blake Heron","idIMDB":"nm0380231"},"actorId":"nm0380231","character":"Ben Rodgers","urlCharacter":"http://www.imdb.com/character/ch0107207","main":true}],"seasons":[],"idIMDB":"tt0112302","urlIMDB":"http://www.imdb.com/title/tt0112302","business":{"budget":null,"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1995/\">1995</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 37 min (97 min)"],"soundMix":["Dolby Digital"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":["Lenses and Panaflex Cameras by Panavision"],"laboratory":["FotoKem Laboratory, Burbank (CA), USA","Technicolor, Hollywood (CA), USA (prints)"],"filmLength":null,"negativeFormat":["35 mm (Kodak)"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm (Kodak)"]},"rating":"5.6","filmingLocations":[{"location":"USA"}],"rated":"PG","awards":[{"award":"First Americans in the Arts Awards 1996","titlesAwards":[{"titleAwardOutcome":"Won FAITA Award","categories":[{"category":"Outstanding Performance by an Actor in a Supporting Role (Film)","names":[{"name":"Eric Schweig","id":"nm0777760","role":null}]}]}]},{"award":"Kids' Choice Awards, USA 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Blimp Award","categories":[{"category":"Favorite Movie Actor","names":[{"name":"Jonathan Taylor Thomas","id":"nm0001795","role":null}]}]}]},{"award":"Young Artist Awards 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Young Leading Actor - Feature Film","names":[{"name":"Jonathan Taylor Thomas","id":"nm0001795","role":null}]}]}]},{"award":"YoungStar Awards 1997","titlesAwards":[{"titleAwardOutcome":"Nominated YoungStar Award","categories":[{"category":"Best Performance by a Young Actor in a Comedy Film","names":[{"name":"Brad Renfro","id":"nm0000605","role":null}]},{"category":"Best Performance by a Young Actor in a Comedy Film","names":[{"name":"Jonathan Taylor Thomas","id":"nm0001795","role":null}]},{"category":"Best Performance by a Young Actress in a Comedy Film","names":[{"name":"Rachael Leigh Cook","id":"nm0000337","role":null}]}]}]}],"votes":"7,872","type":"Movie","companyCreditsSimple":[{"idCompany":"co0063003","name":"Painted Fence Productions"},{"idCompany":"co0008970","name":"Walt Disney Pictures"}],"keywords":{"keywords":["rescue from drowning","near drowning","murder","boy","witness","graveyard","alcoholic","lost treasure","friendship","missouri","cave","looking at oneself in a mirror","death","trapped in a cave","small town","child","eyepatch","skeleton","falling into a hole","falling from height","ends with freeze frame","freeze frame","newspaper headline","candle","echo","shouting","lantern","child in peril","mirror","climbing a tree","knife in the back","bible","doctor","testimony","murder trial","judge","lying under oath","fat man","death threat","young love","first kiss","torn shirt","chest of gold coins","treasure chest","fishing hook","abandoned house","campfire","rifle","map","canoe","covered in mud","shoe","jail","accused of murder","fear of ghosts","jumping through a window","nightmare","finger cut","cutting one's finger","swearing an oath","marble","knocked unconcious","murder witness","native american","undertaker","coffin","chest","grave robbing","pushed off a bridge","bridge","child smoking","pipe smoking","classroom","framed for murder","teacher","school","shaking hands","sleeping rough","runaway","blood oath","brother brother relationship","single mother","aunt nephew relationship","sneaking out","climbing out a window","child sneaks out of house","painting a fence","chores","jar","spider","child protagonist","three word title","tween girl","knife fight","teenage hero","long brown hair","brunette","girl","opening action scene","teenager fighting adult","false accusation","cult film","engagement","kiss","beating","good versus evil","trial","courtroom","fistfight","brawl","cowboy hat","sheriff","jail cell","flintlock pistol","drunkard","suspense","evil man","knife in back","two against one","boyfriend girlfriend relationship","cigar smoking","outlaw","disarming someone","duel","falling to death","flying kick","violence","showdown","stabbed to death","musket","flintlock rifle","knifeman","knife","punched in the face","treasure map","buried treasure","sword","sword fight","child fighting adult","tough guy","child hero","hero","knife throwing","slice of life","on the run","nostalgic","criminal","child's point of view","19th century","wilderness","river","raft","one room schoolhouse","mud","cave in","cabin","barefoot","apple","alabama","rural setting","based on book","based on novel","character name in title","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 09:09:57"}}