{"data":{"movies":[{"title":"Swimming with Sharks","originalTitle":"","year":"1994","releaseDate":"19950421","directors":[{"name":"George Huang","id":"nm0398986"}],"writers":[{"name":"George Huang","id":"nm0398986"}],"runtime":"93 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjNhZmVmZGQtMTQ3OS00YWEzLThjMWUtMWFiNjA3YzQ1Yjg0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Crime"],"plot":"A young Hollywood executive becomes the assistant to a big time movie producer who is the worst boss imaginable: abusive, abrasive and cruel. But soon things turn around when the young executive kidnaps his boss and visits all the cruelties back on him.","simplePlot":"A young, naive Hollywood studio assistant finally turns the tables on his incredibly abusive producer boss.","actors":[{"actorName":"Kevin Spacey","urlProfile":"http://www.imdb.com/name/nm0000228","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2NhY2U2YjgtNTFhZS00NjkwLWI2YzAtYWViNmRhMmQ5YWZjXkEyXkFqcGdeQXVyMDkxMjMwMA@@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 July 1959","placeOfBirth":" South Orange, New Jersey, USA","birthName":"Kevin Spacey Fowler","height":"5' 10\" (1.78 m)","bio":"Kevin Spacey Fowler better known by his stage name Kevin Spacey, is an American actor of screen and stage, film director, producer, screenwriter and singer. He began his career as a stage actor during the 1980s before obtaining supporting roles in film and television. He gained critical acclaim in the early 1990s that culminated in his first Academy Award for Best Supporting Actor for the neo-noir crime thriller The Usual Suspects (1995), and an Academy Award for Best Actor for midlife crisis-themed drama American Beauty (1999). His other starring roles have included the comedy-drama film Swimming with Sharks (1994), psychological thriller Seven (1995), the neo-noir crime film L.A. Confidential (1997), the drama Pay It Forward (2000), the science fiction-mystery film K-PAX (2001) In Broadway theatre, Spacey won a Tony Award for his role in Lost in Yonkers. He was the artistic director of the Old Vic theatre in London from 2004 until stepping down in mid-2015. Since 2013, Spacey has played Frank Underwood in the Netflix political drama series House of Cards. His work in House of Cards earned him Golden Globe Award and Emmy Award nominations for Best Actor. As enigmatic as he is talented, Kevin Spacey has always kept the details of his private life closely guarded. As he explained in a 1998 interview with the London Evening Standard, \"the less you know about me, the easier it is to convince you that I am that character on screen. It allows an audience to come into a movie theatre and believe I am that person\". There are, however, certain biographical facts to be had - for starters, Kevin Spacey Fowler was the youngest of three children born to Kathleen Ann (Knutson) and Thomas Geoffrey Fowler, in South Orange, New Jersey. His ancestry includes Swedish (from his maternal grandfather) and English. His mother was a personal secretary, his father a technical writer whose irregular job prospects led the family all over the country. The family eventually settled in southern California, where young Kevin developed into quite a little hellion - after he set his sister's tree house on fire, he was shipped off to the Northridge Military Academy, only to be thrown out a few months later for pinging a classmate on the head with a tire. Spacey then found his way to Chatsworth High School in the San Fernando Valley, where he managed to channel his dramatic tendencies into a successful amateur acting career. In his senior year, he played \"Captain von Trapp\" opposite classmate Mare Winningham's \"Maria\" in \"The Sound of Music\" (the pair later graduated as co-valedictorians). Spacey claims that his interest in acting - and his nearly encyclopedic accumulation of film knowledge - began at an early age, when he would sneak downstairs to watch the late late show on TV. Later, in high school, he and his friends cut class to catch revival films at the NuArt Theater. The adolescent Spacey worked up celebrity impersonations (James Stewart and Johnny Carson were two of his favorites) to try out on the amateur comedy club circuit. He briefly attended Los Angeles Valley College, then left (on the advice of another Chatsworth classmate, Val Kilmer) to join the drama program at Juilliard. After two years of training he was anxious to work, so he quit Juilliard sans diploma and signed up with the New York Shakespeare Festival. His first professional stage appearance was as a messenger in the 1981 production of \"Henry VI\". Festival head Joseph Papp ushered the young actor out into the \"real world\" of theater, and the next year Spacey made his Broadway debut in Henrik Ibsen's \"Ghosts\". He quickly proved himself as an energetic and versatile performer (at one point, he rotated through all the parts in David Rabe's \"Hurlyburly\"). In 1986, he had the chance to work with his idol and future mentor, Jack Lemmon, on a production of Eugene O'Neill's \"Long Day's Journey Into Night\". While his interest soon turned to film, Spacey would remain active in the theater community - in 1991, he won a Tony Award for his turn as \"Uncle Louie\" in Neil Simon's Broadway hit \"Lost in Yonkers\" and, in 1999, he returned to the boards for a revival of O'Neill's \"The Iceman Cometh\". Spacey's film career began modestly, with a small part as a subway thief in Heartburn (1986). Deemed more of a \"character actor\" than a \"leading man\", he stayed on the periphery in his next few films, but attracted attention for his turn as beady-eyed villain \"Mel Profitt\" on the TV series Wiseguy (1987). Profitt was the first in a long line of dark, manipulative characters that would eventually make Kevin Spacey a household name: he went on to play a sinister office manager in Glengarry Glen Ross (1992), a sadistic Hollywood exec in Swimming with Sharks (1994), and, most famously, creepy, smooth-talking eyewitness Verbal Kint in The Usual Suspects (1995). The \"Suspects\" role earned Spacey an Oscar for Best Supporting Actor and catapulted him into the limelight. That same year, he turned in another complex, eerie performance in David Fincher's thriller Se7en (1995) (Spacey refused billing on the film, fearing that it might compromise the ending if audiences were waiting for him to appear). By now, the scripts were pouring in. After appearing in Al Pacino's Looking for Richard (1996), Spacey made his own directorial debut with Albino Alligator (1996), a low-key but well received hostage drama. He then jumped back into acting, winning critical accolades for his turns as flashy detective Jack Vincennes in L.A. Confidential (1997) and genteel, closeted murder suspect Jim Williams in Midnight in the Garden of Good and Evil (1997). In October 1999, just four days after the dark suburban satire American Beauty (1999) opened in US theaters, Spacey received a star on the Hollywood Walk of Fame. Little did organizers know that his role in Beauty would turn out to be his biggest success yet - as Lester Burnham, a middle-aged corporate cog on the brink of psychological meltdown, he tapped into a funny, savage character that captured audiences' imaginations and earned him a Best Actor Oscar. No longer relegated to offbeat supporting parts, Spacey seems poised to redefine himself as a Hollywood headliner. He says he's finished exploring the dark side - but, given his attraction to complex characters, that mischievous twinkle will never be too far from his eyes. In February 2003 Spacey made a major move back to the theatre. He was appointed Artistic Director of the new company set up to save the famous Old Vic theatre, The Old Vic Theatre Company. Although he did not undertake to stop appearing in movies altogether, he undertook to remain in this leading post for ten years, and to act in as well as to direct plays during that time. His first production, of which he was the director, was the September 2004 British premiere of the play Cloaca by Maria Goos (made into a film, Cloaca (2003)). Spacey made his UK Shakespearean debut in the title role in Richard II in 2005. In 2006 he got movie director Robert Altman to direct for the stage the little-known Arthur Miller play Resurrection Blues, but that was a dismal failure. However Spacey remained optimistic, and insisted that a few mistakes are part of the learning process. He starred thereafter with great success in Eugene O'Neill's A Moon for the Misbegotten along with Colm Meaney and Eve Best, and in 2007 that show transferred to Broadway. In February 2008 Spacey put on a revival of the David Mamet 1988 play Speed-the-Plow in which he took one of the three roles, the others being taken by Jeff Goldblum and Laura Michelle Kelly. In 2013, Spacey took on the lead role in an original Netflix series, House of Cards (2013). Based upon a British show of the same name, House of Cards is an American political drama. The show's first season received a Primetime Emmy Award nomination to include outstanding lead actor in a drama series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2NhY2U2YjgtNTFhZS00NjkwLWI2YzAtYWViNmRhMmQ5YWZjXkEyXkFqcGdeQXVyMDkxMjMwMA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000228","name":"Kevin Spacey","idIMDB":"nm0000228"},"actorId":"nm0000228","character":"Buddy Ackerman","urlCharacter":"http://www.imdb.com/character/ch0018834","main":true},{"actorName":"Frank Whaley","urlProfile":"http://www.imdb.com/name/nm0001844","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzkyODAyMDA1N15BMl5BanBnXkFtZTcwOTEyNDk0OQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 July 1963","placeOfBirth":" Syracuse, New York, USA","birthName":"Frank Joseph Whaley","height":"5' 9\" (1.75 m)","bio":"Frank Whaley is a critically acclaimed actor/writer/director. He is best known for the films Pulp Fiction (1994) and Swimming with Sharks (1994), and has worked with Oliver Stone multiple times. His feature directorial debut, Joe the King (1999), earned him the Waldo Salt Screenwriting prize at the 1999 Sundance Film Festival. He was born in Syracuse, New York, and resides in New York City. He is also an accomplished stage actor, working frequently with the New Group theater. Frank is married to the writer Heather Bucha Whaley. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzkyODAyMDA1N15BMl5BanBnXkFtZTcwOTEyNDk0OQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001844","name":"Frank Whaley","idIMDB":"nm0001844"},"actorId":"nm0001844","character":"Guy","urlCharacter":"http://www.imdb.com/character/ch0158286","main":true},{"actorName":"Michelle Forbes","urlProfile":"http://www.imdb.com/name/nm0000405","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5NTgwMjIxMDdeQTJeQWpwZ15BbWU3MDY2NTk0MTk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 January 1965","placeOfBirth":" Austin, Texas, USA","birthName":"Michelle Renee Forbes Guajardo","height":"5' 9\" (1.75 m)","bio":"Michelle Forbes was born on January 8, 1965 in Austin, Texas, USA as Michelle Renee Forbes Guajardo. She is an actress, known for The Killing (2011), In Treatment (2008) and Battlestar Galactica (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA5NTgwMjIxMDdeQTJeQWpwZ15BbWU3MDY2NTk0MTk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000405","name":"Michelle Forbes","nicknames":["Mishka"],"idIMDB":"nm0000405"},"actorId":"nm0000405","character":"Dawn Lockard","urlCharacter":"http://www.imdb.com/character/ch0018835","main":true},{"actorName":"Benicio Del Toro","urlProfile":"http://www.imdb.com/name/nm0001125","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzODQ4NzU1N15BMl5BanBnXkFtZTcwOTUzMzc5Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 February 1967","placeOfBirth":" San Germán, Puerto Rico","birthName":"Benicio Monserrate Rafael Del Toro Sanchez","height":"6' 2\" (1.88 m)","bio":"Benicio Del Toro emerged in the mid-1990s as one of the most watchable and charismatic character actors to come along in years. A favorite of film buffs, Del Toro gained mainstream public attention as the conflicted but basically honest Mexican policeman in Steven Soderbergh's Traffic (2000). Born on February 19, 1967 in San Germán, Puerto Rico, Benicio is the son of lawyer parents Fausta Genoveva Sanchez Rivera and Gustavo Adolfo Del Toro Bermudez. His mother died when he was young, and his father moved the family to a farm in Pennsylvania. A basketball player with an interest in acting, he decided to follow the family way and study business at the University of California in San Diego. A class in acting resulted in his being bitten by the acting bug, and he subsequently dropped out and began studying with legendary acting teacher Stella Adler in Los Angeles and at the Circle in the Square Acting School in New York City. Telling his parents that he was taking courses in business, Del Toro hid his new studies from his family for a little while. During the late 1980s, he made several television appearances, most notably in an episode of Miami Vice (1984) and in the NBC miniseries Drug Wars: The Camarena Story (1990). Del Toro's big-screen career got off to a slower start, however--his first role was Duke the Dog-Faced Boy in Big Top Pee-wee (1988). However, things looked better when he landed the role of Dario, the vicious henchman in the James Bond film Licence to Kill (1989). Surprising his co-stars at age 21, Del Toro was the youngest actor ever to portray a Bond villain. However, the potential break was spoiled as the picture turned out to be one of the most disappointing Bond films ever; this was lost amid bigger summer competition. Benicio gave creditable performances in many overlooked films for the next several years, such as The Indian Runner (1991), Christopher Columbus: The Discovery (1992) and Money for Nothing (1993). His roles in Fearless (1993) and China Moon (1994) gained him more critical notices, and 1995 proved to be the first \"Year of Benicio\" as he gave a memorable performance in Swimming with Sharks (1994) before taking critics and film buffs by storm as the mumbling, mysterious gangster in The Usual Suspects (1995), directed by Bryan Singer. Del Toro won an Independent Spirit Award for Best Supporting Actor for the role in the Oscar-winning film. Staying true to his independent roots, he next gave a charismatic turn as cold-blooded gangster Gaspare Spoglia in The Funeral (1996) directed by Abel Ferrara. He also appeared as Benny Dalmau in Basquiat (1996), directed by artist friend Julian Schnabel. That year also marked his first truly commercial film, as he played cocky Spanish baseball star Juan Primo in The Fan (1996), which starred Robert De Niro. Del Toro took his first leading man role in Excess Baggage (1997), starring and produced by Alicia Silverstone. Hand-picked by Silverstone, Del Toro's performance was pretty much the only thing critics praised about the film, and showed the level of consciousness he was beginning to have in the minds of film fans. He took a leading role with his good friend Johnny Depp in Fear and Loathing in Las Vegas (1998), co-written and directed by the legendary Terry Gilliam. Gaining 40 pounds for the role of Dr. Gonzo, the drug-addicted lawyer to sportswriter Raoul Duke, Benicio immersed himself totally in the role. Using his method acting training so far as to burn himself with cigarettes for a scene, this was a trying time for Del Toro. The harsh critical reviews proved tough on him, as he felt he had given his all for the role and been dismissed. Many saw the crazed, psychotic performance as a confirmation of the rumors and overall weirdness that people seemed to place on Del Toro. Taking a short break after the ordeal, 2000 proved to be the second \"Year of Benicio\". He first appeared in The Way of the Gun (2000), directed by friend and writer Christopher McQuarrie. Then he went to work for actor's director Steven Soderbergh in Traffic (2000). A complex and graphic film, this nonetheless became a widespread success and Oscar winner. His role as conflicted Mexican policeman Javier Rodriguez functions as the movie's real heart amid an all-star ensemble cast, and many praised this as the year's best performance, a sentiment validated by a Screen Actor's Guild Award for \"Best Actor\". He also gave a notable performance in Snatch (2000) directed by Guy Ritchie, which was released several weeks later, and The Pledge (2001) directed by Sean Penn. Possessing sleepy good looks reminiscent of James Dean or Marlon Brando, Del Toro has often jokingly been referred to as the \"Spanish Brad Pitt\". With his newfound celebrity, Del Toro has become a sort of heartthrob, being voted one of People magazine's \"50 Most Beautiful People\" as well as \"Most Eligible Bachelors\". A favorite of film fans for years for his diverse and \"cool guy\" gangster roles, he is currently becoming a mainstream favorite respected for his acting skills and choices. So far very careful in his choices and who he works with, Del Toro can boast an impressive resume of films with some of the most influential and respected people in the film business.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzODQ4NzU1N15BMl5BanBnXkFtZTcwOTUzMzc5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001125","name":"Benicio Del Toro","nicknames":["Beno"],"idIMDB":"nm0001125"},"actorId":"nm0001125","character":"Rex","urlCharacter":"http://www.imdb.com/character/ch0457396","main":true},{"actorName":"T.E. Russell","urlProfile":"http://www.imdb.com/name/nm0751470","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MTE3NDMzMl5BMl5BanBnXkFtZTYwMTk4Nzgy._V1_UY44_CR16,0,32,44_AL_.jpg","biography":{"bio":"T.E. Russell was born in Chicago, Illinois, USA. He is an actor, known for Swimming with Sharks (1994), Gladiator (1992) and Toy Soldiers (1991).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MTE3NDMzMl5BMl5BanBnXkFtZTYwMTk4Nzgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0751470","name":"T.E. Russell","idIMDB":"nm0751470"},"actorId":"nm0751470","character":"Foster Kane","urlCharacter":"http://www.imdb.com/character/ch0457397","main":true},{"actorName":"Roy Dotrice","urlProfile":"http://www.imdb.com/name/nm0234541","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzMTk0NjE4MDdeQTJeQWpwZ15BbWU3MDAwNTU0MDg@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1923","placeOfBirth":" Guernsey, Channel Islands, UK","height":"5' 9\" (1.75 m)","bio":"The ever-impressive, chameleon-like British character actor Roy Dotrice was born on the Island of Guernsey, one of the Channel Islands off the coast of France, which is part of the United Kingdom. He was the first-born child of Louis and Neva Dotrice who prospered as bakers. The Germans occupied the island in 1940 and he and his mother and brother escaped to England. Advancing his real age, Roy joined the Royal Air Force at age 16 and was trained as a wireless operator and air gunner. In 1942 his plane was shot down and he was captured where he served out the remainder of WWII (over three years) as a prisoner of war in Germany. He was introduced to the idea of performing when he took part in various makeshift concerts in order to raise the spirits of his fellow captives. Following WWII and his release, Roy decided to pursue his acting ambitions. After studying at the Royal Academy of Dramatic Art, he began appearing in English repertory where he met and married (1947) actress Kay Dotrice who at the time was performing under her given name of Katherine (Kay) Newman. Throughout the early post-war years, the couple performed together in repertory with Charles Denville and the Denville Players. At different times he was a member of the Liverpool, Manchester and Oldham repertory theatres. Also during this great time of productivity, Roy produced and directed some three hundred stage plays. He formed his own troupe, the Guernsey Theatre Company, in 1955. The highlight of his theatrical career, however, began in 1957 when Roy became a member of the Shakespeare Memorial Theatre at Stratford, England, (later the Royal Shakespeare Company). For the next nine years he performed in a lengthy succession of the Bard's works, first in small parts as various players, officers and gentlemen. He subsequently went on to become a notable Iago, Falstaff and Julius Caesar, among others. A popular performer, he had an uncanny ability to play much older than he was. He later went on to perform with the American Shakespearean Festival. The notoriety he received from his abundant classical theatre experience led directly to radio, film, television and Broadway offers. Roy has appeared in a number of Broadway productions over the years, receiving a Tony nomination for his work in \"A Life\" and finally winning the trophy for his heralded performance in the 2000 revival of \"A Moon for the Misbegotten\" starring Cherry Jones and Gabriel Byrne. Known for his considerable success in one-man shows such as Abraham Lincoln, Charles Dickens, Will Rogers and Winston Churchill, his superb one-person show \"Brief Lives\", drawn from the Elizabethan diaries of John Aubrey, played for over 1,700 performances over a period of nearly a decade. At one time this set a record for a solo performance and was listed in the \"Guinness Book of World Records\". Dotrice made his credited feature movie debut supporting Kirk Douglas and Richard Harris in The Heroes of Telemark (1965), and has since lent class and distinction to a spattering of films. Among his list of credits include the bawdy comedy Lock Up Your Daughters! (1969); the sumptuous biopic Nicholas and Alexandra (1971); the Oscar-winning Amadeus (1984), Milos Forman's adaptation of composer Mozart's life in which Roy portrayed Mozart's stern and domineering father Leopold; and The Cutting Edge (1992) as an Olympic skating coach. Perhaps better remembered on the small screen, he appeared magnanimously as a host of monarchs including his Edward IV in The Wars of the Roses (1965) and King George IV in the syndicated miniseries Shaka Zulu (1986). To American audiences he is probably best known as Jacob Wells, the Beast's surrogate father, in the dramatic series Beauty and the Beast (1987). Dotrice was also cast in the recurring role of Father Barrett, a Catholic priest and confidante of Judge Henry Bone (played by Ray Walston), on the acclaimed Emmy-winning drama Picket Fences (1992). Since the end of the 1970s he has lived and worked primarily in America. More recently he appeared on stage reviving his outstanding 1993 role as George Bernard Shaw in \"The Best of Friends\" in 2006. His devoted wife Kay died on August 2, 2007, after 60 years of marriage. The couple has three daughters (Michele, Karen, Yvette), all whom at one time or another were actresses. Karen, who is now primarily out of the business, became the best known perhaps for her childhood Disney portrayals, notably in Mary Poppins (1964). Combined, his daughters have presented him with seven grandchildren.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEzMTk0NjE4MDdeQTJeQWpwZ15BbWU3MDAwNTU0MDg@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0234541","name":"Roy Dotrice","idIMDB":"nm0234541"},"actorId":"nm0234541","character":"Cyrus Miles","urlCharacter":"http://www.imdb.com/character/ch0457398","main":true},{"actorName":"Matthew Flint","urlProfile":"http://www.imdb.com/name/nm0282409","urlPhoto":"","biography":{"bio":"Matthew Flint is an actor and producer, known for Swimming with Sharks (1994), Husbands and Wives (1992) and Cool and the Crazy (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0282409","name":"Matthew Flint","idIMDB":"nm0282409"},"actorId":"nm0282409","character":"Manny","urlCharacter":"http://www.imdb.com/character/ch0457399","main":true},{"actorName":"Patrick Fischler","urlProfile":"http://www.imdb.com/name/nm0279209","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNTM1NTkxNF5BMl5BanBnXkFtZTgwODg0MTQ2ODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 December 1969","placeOfBirth":" Los Angeles, California, USA","bio":"Patrick Fischler was born on December 29, 1969 in Los Angeles, California, USA. He is an actor and producer, known for Mad Men (2007), Mulholland Drive (2001) and Lost (2004). He has been married to Lauren Bowles since May 27, 2005. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzNTM1NTkxNF5BMl5BanBnXkFtZTgwODg0MTQ2ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0279209","name":"Patrick Fischler","idIMDB":"nm0279209"},"actorId":"nm0279209","character":"Moe","urlCharacter":"http://www.imdb.com/character/ch0457400","main":true},{"actorName":"Jerry Levine","urlProfile":"http://www.imdb.com/name/nm0505842","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc5MTYyNzE2NF5BMl5BanBnXkFtZTcwNjI0Njk1Nw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 March 1957","placeOfBirth":" New Brunswick, New Jersey, USA","bio":"Jerry Levine was born on March 12, 1957 in New Brunswick, New Jersey, USA. He is a director and actor, known for Everybody Hates Chris (2005), Born on the Fourth of July (1989) and Monk (2002). He is married to Nina Tassler. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjc5MTYyNzE2NF5BMl5BanBnXkFtZTcwNjI0Njk1Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0505842","name":"Jerry Levine","idIMDB":"nm0505842"},"actorId":"nm0505842","character":"Jack","urlCharacter":"http://www.imdb.com/character/ch0457401","main":true}],"seasons":[],"idIMDB":"tt0114594","urlIMDB":"http://www.imdb.com/title/tt0114594","business":{"budget":{"money":"$700,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 33 min (93 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["FotoKem Laboratory, Burbank (CA), USA"],"filmLength":["2,629 m"],"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"7.1","filmingLocations":[{"location":"Culver Studios - 9336 W. Washington Blvd., Culver City, California, USA"}],"rated":"R","awards":[{"award":"Broadcast Film Critics Association Awards 1996","titlesAwards":[{"titleAwardOutcome":"Won Critics Choice Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Kevin Spacey","id":"nm0000228","role":null},{"name":"Outbreak","id":"tt0114069","role":null},{"name":"Se7en","id":"tt0114369","role":null},{"name":"The Usual Suspects","id":"tt0114814","role":null}]}]}]},{"award":"Deauville Film Festival 1995","titlesAwards":[{"titleAwardOutcome":"Won Critics Award","categories":[{"category":"","names":[{"name":"George Huang","id":"nm0398986","role":null}]}]},{"titleAwardOutcome":"Nominated Grand Special Prize","categories":[{"category":"","names":[{"name":"George Huang","id":"nm0398986","role":null}]}]}]},{"award":"Film Independent Spirit Awards 1996","titlesAwards":[{"titleAwardOutcome":"Nominated Independent Spirit Award","categories":[{"category":"Best Male Lead","names":[{"name":"Kevin Spacey","id":"nm0000228","role":null}]}]}]},{"award":"Los Angeles Film Critics Association Awards 1995","titlesAwards":[{"titleAwardOutcome":"2nd place LAFCA Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Kevin Spacey","id":"nm0000228","role":null},{"name":"Se7en","id":"tt0114369","role":null},{"name":"Outbreak","id":"tt0114069","role":null},{"name":"The Usual Suspects","id":"tt0114814","role":null}]}]}]},{"award":"National Society of Film Critics Awards, USA 1996","titlesAwards":[{"titleAwardOutcome":"2nd place NSFC Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Kevin Spacey","id":"nm0000228","role":null},{"name":"Se7en","id":"tt0114369","role":null},{"name":"The Usual Suspects","id":"tt0114814","role":null},{"name":"Outbreak","id":"tt0114069","role":null}]}]}]},{"award":"New York Film Critics Circle Awards 1995","titlesAwards":[{"titleAwardOutcome":"Won NYFCC Award","categories":[{"category":"Best Supporting Actor","names":[{"name":"Kevin Spacey","id":"nm0000228","role":null},{"name":"Se7en","id":"tt0114369","role":null},{"name":"The Usual Suspects","id":"tt0114814","role":null},{"name":"Outbreak","id":"tt0114069","role":null}]}]}]},{"award":"Seattle International Film Festival 1995","titlesAwards":[{"titleAwardOutcome":"Won Golden Space Needle Award","categories":[{"category":"Best Actor","names":[{"name":"Kevin Spacey","id":"nm0000228","role":null},{"name":"The Usual Suspects","id":"tt0114814","role":null}]}]}]}],"votes":"19,686","type":"Movie","companyCreditsSimple":[{"idCompany":"co0063993","name":"Cineville"},{"idCompany":"co0016347","name":"Keystone Studios"},{"idCompany":"co0030618","name":"Mama'Z Boy Entertainment"}],"keywords":{"keywords":["assistant","boss","movie producer","torture","office","abuse","humiliation","cruelty","script","hostage","revenge","death","sexual harassment","office romance","reserved parking place","new job","christmas gift","murder of wife","sympathy","rape","unrealistic demand","jealousy","mobbing","tied to a chair","desk","pact","battle of wits","office work","anger","los angeles california","rudeness","crime scene","bully comeuppance","class differences","paper cut","murder","throwing something at someone","disgruntled worker","fish in title","irreverence","cynicism","animal in title","cruel boss","showbiz","sadist","manager","boss from hell","behind the scenes","ambition","spit","filmmaking","motion picture studio","motion picture industry","motion picture executive","psychopath","satire","receptionist","coffee","bully","good becoming evil","crooked","hollywood california","black comedy","independent film","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 18:10:51"}}