{"data":{"movies":[{"title":"Lion of Oz","originalTitle":"","year":"2000","releaseDate":"20000926","directors":[{"name":"Tim Deacon","id":"nm0212593"}],"writers":[{"name":"Elana Lesser","id":"nm0504327"},{"name":"Cliff Ruby","id":"nm0748429"}],"runtime":"74 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5NjM2NDEzMl5BMl5BanBnXkFtZTcwODYxMDEyMQ@@._V1.jpg","countries":["Canada"],"languages":["English"],"genres":["Family","Animation","Musical"],"plot":"Before Dorothy landed on the Wicked Witch of the East with her little farm house, the witch had to contend with another resident of middle America. The Lion, who was once part of the Omaha Circus, comes to Oz with the Wizard and starts on an adventure to stop the witch from obtaining the Flower of Oz. As new friends and strange characters look to him for his courage, Lion could loose exactly what it is that makes him so brave. Based upon the book by Roger S. Baum (Great-Grandson of Oz L. Frank Baum, the original author of the Oz books).","simplePlot":"A circus lion finds himself in a magical land where he becomes the leader of a journey to stop the Wicked Witch of the East, a task which may lead him to loose a part of himself.","actors":[{"actorName":"Henry Beckman","urlProfile":"http://www.imdb.com/name/nm0065798","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyNDcxNjU3NzVeQTJeQWpwZ15BbWU4MDA3NjY1MjIx._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 November 1921","placeOfBirth":" Halifax, Nova Scotia, Canada","birthName":"Henry How Beckman","bio":"Henry Beckman was born on November 26, 1921 in Halifax, Nova Scotia, Canada as Henry How Beckman. He was an actor, known for Chromosome 3 (1979), Marnie (1964) and Bronk (1975). He was married to Hillary Beckman and Cheryl Maxwell. He died on June 17, 2008 in Barcelona, Catalonia, Spain.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAyNDcxNjU3NzVeQTJeQWpwZ15BbWU4MDA3NjY1MjIx._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0065798","name":"Henry Beckman","idIMDB":"nm0065798"},"actorId":"nm0065798","character":"Narrator","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dom DeLuise","urlProfile":"http://www.imdb.com/name/nm0001123","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MTQwMzI5M15BMl5BanBnXkFtZTcwODYyMDU4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 August 1933","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Dominick DeLuise","height":"5' 9½\" (1.77 m)","bio":"As might be said for the late and great comedians Harvey Korman and Madeline Kahn, it seems that Mel Brooks was the only director on the planet who knew how to best utilize this funnyman's talents on film. Brooks once quipped that, whenever he hired Dom DeLuise for one of his films, he would instinctively add another two days to the schedule because of the constant laughter Dom provided on the set -- especially when the camera started rolling. The lovable, butterball comedian was a mainstay on 1960s and '70s TV variety as a \"second banana\" or comedy relief player. While his harsher critics believed his schtick was better served in smaller doses, Dom nevertheless went on to find some range in a few moving, more restrained projects. Those few glimpses behind all the mirth and merriment revealed a dramatic actor waiting to be unleashed. As they say, behind every clown's smile, one can find a few tears. He was born Dominick DeLuise on August 1, 1933, in Brooklyn, New York, to parents John, a sanitation engineer, and Vicenza (DeStefano) DeLuise, both Italian immigrants. A natural class clown, it helped Dom fit in at school, and he started drawing belly laughs fairly young on stage. His very first school play had him portraying an inert copper penny! He later attended New York's High School of Performing Arts, but when it came to college, he decided to major in biology at Tufts University near Boston. He never got the idea of being a comedian out of his head, however, and the obsession eventually won out. Dom's formative years as an actor were spent apprenticing at the Cleveland Playhouse in which he gamely played roles in everything from \"Guys and Dolls\" and \"Stalag 17\" to \"The School for Scandal\" and \"Hamlet.\" He earned his first professional paycheck playing Bernie the dog in a production called \"Bernie's Last Wish.\" Dom also got a taste of the camera in Cleveland appearing on the local TV kiddie's show \"Tip Top Clubhouse.\" Back in NYC, he took over the lead role of Tinker the toymaker in another children's local program, Tinker's Workshop (1954), for one season in 1958. He also started making noise on the off-Broadway scene. Appearing in the plays \"The Jackass\" and \"All in Love,\" he became part of the featured ensemble of the 1961 musical revue \"An Evening with Harry Stoones,\" which included 19-year-old Barbra Streisand. More outlandish musical roles came his way in the early 1960s with \"Little Mary Sunshine\" (as Corporal Billy Jester) and \"The Student Gypsy, or the Prince of Liederkrantz\" (his Broadway debut as Muffin T. Raggamuffin). While appearing in the light-hearted summer stock spoof \"Summer & Smirk\" in Provincetown, Massachusetts, Dom met fellow performer Carol Arthur (née Carol Arata). They married on November 23, 1965. Their three sons, Peter DeLuise, Michael DeLuise and David DeLuise all got into the show business act. In 1971, Dom returned successfully to Broadway in a perfectly-suited Neil Simon vehicle, \"The Last of the Red Hot Lovers.\" Dom was first noticed on the smaller screen creating the sketch character of Dominick the Great, a magician who tries in vain to mask his ineptness with feigned dignity on Garry Moore's popular show. The rolypoly comedian truly thrived in this TV variety atmosphere and soon began popping up all over the place (The Hollywood Palace (1964), The Smothers Brothers Comedy Hour (1967), The Jackie Gleason Show (1966)). Balding, blushing, dimpled and moon-faced (comparisons of a ripe tomato were not off the mark), he was readily equipped with a beaming, clench-toothed smile that became his trademark. At his best, looking embarrassed or agitated, the laughs usually came at his own expense whether playing a panic-stricken klutz or squirming Nervous Nelly type. Dom took the magician character to the ensemble comedy show The Entertainers (1964), which also showcased Carol Burnett and Bob Newhart, and found more regular employment as a bumbling private eye in puppeteer Shari Lewis' daytime children's program and as a foil for Dean Martin on the entertainer's regular and summer replacement shows. Dom again repeated his Dominick the Great character on Martin's show and received great reception. He later found himself part of Martin's \"in-crowd\" of comedians on his \"celebrity roasts.\" Dom's obvious comic genius was more apparent and succeeded better in tandem with others than it did on its own. Hosting duties for his very first comedy/variety program The Dom DeLuise Show (1968), which featured wife Carol as part of the regular roster, lasted only one summer. The sitcom Lotsa Luck (1973), which showcased Dom as bachelor Stanley Belmont having to contend with a live-in mother (a harping Kathleen Freeman) and sister (an ungainly Beverly Sanders), was canceled after its first season. He gave it a rest for awhile before trying once again with the sketch-like sitcom The Dom DeLuise Show (1987), but it, too, quickly faded. Another brief stint was as host of a revamped Candid Camera (1991). While Dom made an unlikely film debut as a high-strung flier in the gripping nuclear drama Fail-Safe (1964) starring Henry Fonda, it was in zany, irreverent comedy that he found his true calling. Appearing in support of others such as Sid Caesar and Mary Tyler Moore, respectively, in the so-so comedies The Busy Body (1967) and What's So Bad About Feeling Good? (1968), he proved a delight as an inept, dim-witted spy in the Doris Day caper The Glass Bottom Boat (1966). Mel Brooks first cast Dom as the miserly Father Fyodor in his film The Twelve Chairs (1970), and found plenty of room for the comedian after that -- as campy director Buddy Bizarre in Blazing Saddles (1974), the silly-ass director's assistant in Silent Movie (1976), Emperor Nero in History of the World: Part I (1981), the voice of the cheese-oozing Pizza the Hutt in the \"Star Wars\" parody Spaceballs (1987), and as Sherwood Forest's very own puffy-cheeked Godfather, Don Giovanni, in Sacré Robin des Bois (1993). A very close friend of action star Burt Reynolds, Dom romped through a number of Reynolds' freewheeling films as well, including Smokey and the Bandit II (1980), The Cannonball Run (1981) and The Best Little Whorehouse in Texas (1982). One of his finest scene-stealing film roles, in fact, was as Reynolds' schizo pal in The End (1978). Dom went on to direct a number of stage productions for his close friend at the Burt Reynolds Theatre in Jupiter, Florida -- among them \"Butterflies Are Free,\" \"Same Time, Next Year\" (starring Burt and Carol Burnett), \"Brighton Beach Memoirs\" (starring son Peter), and the musical \"Jump\" (featuring wife Carol). Still another comic buddy, Gene Wilder, handed Dom the roles of the indulgent opera star in The Adventure of Sherlock Holmes' Smarter Brother (1975) and perturbed movie mogul Adolf Zitz in The World's Greatest Lover (1977). Dom later joined Wilder once again, along with Wilder's wife Gilda Radner, in the unfunny comedy Haunted Honeymoon (1986), a lame, creaky-house spoof that even Dom in full drag could not salvage. Change-of-pace roles were few in the offering. One occurred for Dom as the compulsive-eating protagonist in Fatso (1980). Directed by and co-starring Brooks' wife Anne Bancroft, Dom managed to draw both comedy and pathos. Obesity was also a chronic, real-life problem for the comedian and, at one point in 1999, it was reported that he had tipped the scales at 325 lbs. On a positive note, this passion for food actually fed into a more lucrative sideline -- as a respected chef and culinary author (\"Eat This\" and \"Eat This Too\") in which he appeared all over the tube cooking and demonstrating his favorite recipes. He also wrote children's books on the sly. Dom tackled broad comedy films with great abandon -- a wallflower he was not -- but it was a hit-and-miss affair. Some of his biggest misses were the Mae West disaster Sextette (1978), the Dudley Moore showcase Wholly Moses! (1980) (although Dom was arguably the best thing in it), Loose Cannons (1990), in which he appeared as portly pornographer Harry \"The Hippo\" Gutterman, Driving Me Crazy (1991), which filmed far away in Germany, and The Silence of the Hams (1994) [aka The Silence of the Hams], a parody on the horror genre in which he played Dr. Animal Cannibal Pizza. Films could also be a family affair. True to life, Dom played a sympathetic kiddie show host in the moving TV-movie Happy (1983). Also the executive producer, he was joined by wife Carol and all three sons in the cast. In addition, Dom offered a cameo in Between the Sheets (2003), a film that was written by Peter, was directed, edited and executive-produced by Michael, and featured roles for the rest of the family. Dom's voiceover skills did not go by untapped either, which included the animated feature films The Secret of NIMH (1982), An American Tail (1986) and Charlie (1989), plus all of their offshoots. The heavily-bearded DeLuise even displayed scene-stealing antics on the operatic scene, once playing the speaking part of Frosch the Jailer in the operetta \"Die Fledermaus\" at the Metropolitan Opera. Suffering from various physical ailments in later years, some of which were exacerbated by his chronic obesity and diabetes, Dom's health declined, and he died in 2009 at age 75. His wife and three children survived him, as did three grandchildren.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4MTQwMzI5M15BMl5BanBnXkFtZTcwODYyMDU4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001123","name":"Dom DeLuise","idIMDB":"nm0001123"},"actorId":"nm0001123","character":"Oscar Diggs","urlCharacter":"http://www.imdb.com/character/ch0088707","main":true},{"actorName":"Gerard Plunkett","urlProfile":"http://www.imdb.com/name/nm0687679","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMTU4NDcyMF5BMl5BanBnXkFtZTgwNTA1MTA1MjE@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Gerard Plunkett was born and raised in Dublin, Ireland. The versatile actor began his career as a stand-up comic and impressionist on the Cabaret scene in his native Ireland. He later became involved in improvisational comedy and a career in theater soon followed. The veteran actor has received best actor awards for his work on both stage and screen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMTU4NDcyMF5BMl5BanBnXkFtZTgwNTA1MTA1MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0687679","name":"Gerard Plunkett","idIMDB":"nm0687679"},"actorId":"nm0687679","character":"The Oak Tree","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jason Priestley","urlProfile":"http://www.imdb.com/name/nm0000594","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg0MzAyNDc1NF5BMl5BanBnXkFtZTcwNTEwNjI1NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1969","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"Jason Bradford Priestley","height":"5' 8\" (1.73 m)","bio":"Jason Priestley was born on August 28, 1969 in Vancouver, British Columbia, Canada as Jason Bradford Priestley. He is an actor and producer, known for Beverly Hills, 90210 (1990), Call Me Fitz (2010) and Tombstone (1993). He has been married to Naomi Lowde-Priestley since May 14, 2005. They have two children. He was previously married to Ashlee Petersen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjg0MzAyNDc1NF5BMl5BanBnXkFtZTcwNTEwNjI1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000594","name":"Jason Priestley","idIMDB":"nm0000594"},"actorId":"nm0000594","character":"Lion","urlCharacter":"http://www.imdb.com/character/ch0004330","main":true},{"actorName":"Lynn Redgrave","urlProfile":"http://www.imdb.com/name/nm0001655","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NjEwMzIxMl5BMl5BanBnXkFtZTcwMjUwNzAzNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 March 1943","placeOfBirth":" Marylebone, London, England, UK","birthName":"Lynn Rachel Redgrave","height":"5' 10\" (1.78 m)","bio":"Actress of both the English and American stage and screen, Lynn Redgrave was born in Marylebone, London, England, into one of the world's most famous acting dynasties. As the daughter of Rachel Kempson and Sir Michael Redgrave, sister of Vanessa Redgrave and Corin Redgrave, and granddaughter of Roy Redgrave and Margaret Scudamore, all of whom were actors, her early aspirations were surprisingly to become an equestrienne or a chef. It was not until the age of 15 that she became more and more involved in acting and her father's stage performances. Attending London's Central School of Music and Drama, she made her stage debut in 1962 and began film work a year later. It wasn't until her lovable role as the ugly-duckling in Georgy Girl (1966), that she was taken notice and, as a result, won both the Golden Globe, New York Film Critics Circle Award and a nomination for the coveted Best Actress at the 1967 Academy Awards. Despite this promising performance, Lynn struggled to find promising follow-up work, she played the lead in the fluffy Smashing Time (1967) and The Virgin Soldiers (1969), low-key films that were relevant at the time of London's swinging 60s, but very quickly became largely forgotten. She married stage actor/director John Clark and her sister, Vanessa Redgrave, who was also Oscar-nominated the same year for Morgan! (1966), was also gaining exposure and critical success if not surpassing Lynn, on both the British stage and films and was largely considered the leading face of England's breakout actresses of the '60s alongside 'Julie Christie' and other high-profile actresses. Becoming the label of Vanessa Redgrave's younger and chubbier sister \"that did that film a few years ago\" didn't sit well with Lynn and, as a result, she lost considerable weight and permanently settled in the U.S. in 1974 to distance herself from this. Primarily based in southern California, she regularly commuted to New York and became notable particularly on the Broadway stage, and had successful runs in \"Black Comedy/White Lies\" (1967), \"My Fat Friend\" (1974), \"Mrs. Warren's Profession\" (1976), \"Knock Knock\" (1976), \"Saint Joan\" (1977-1978), \"Aren't We All\" (1985) and \"Sweet Sue\" (1987). She was prolifically hired by major networks to appear on a variety of TV talk and game shows and held the position of co-host for a few seasons of Not for Women Only (1968), while acting on prime-time TV, whether it was guest spots, mini-series or short-lived TV series. For over 20 years, Redgrave's film career was infrequent and admittedly \"terrible\" by the actress herself, she notoriously played the title character in the critically-bashed, The Happy Hooker (1975), and the all-star cast misfire, The Big Bus (1976), and, in the 1980s, she focused in a different direction, becoming a spokesperson and commercial actress for \"Weight Watches\". This coincided with the release of her well- received book: \"This Is Living: How I Found Health and Happiness\", that detailed her weight issues and eating binges, it was also revealed that for years she suffered bulimia. In the mid-to-late '90s, Redgrave had somewhat of a resurgence in her career, from 1993-1994, she spent over 8 months on Broadway, as well as touring across the world, performing her own personally written show of \"Shakespeare for My Father\", that explored the bisexuality, aloof persona and intimidating resume of her father. In 1996, Scott Hicks reignited her film career after many years of inactivity by casting her in the Australian Oscar-winning hit, Shine (1996), in which she gave a short yet tender performance as \"Gillian\", the woman Geoffrey Rush's character falls in love with. Another Golden Globe win/Oscar nomination followed (this time in the supporting category) for her role as the Hungarian housekeeper in Gods and Monsters (1998). Her marriage abruptly ended in 1999, when infidelity was discovered on her husband's behalf and a nasty divorced followed, they produced three children Benjamin, Kelly Clark and Annabel Clark. Continually working her way through film, television and stage performances in the '00s, recently awarded the OBE, Lynn Redgrave was shocked to discover lumps on her body and was diagnosed with breast cancer. As a result, she took time to write \"Journal: A Mother and Daughter's Recovery from Breast Cancer\" with her youngest daughter, Annabel Clark, in 2003 and tragically lost her 7-year battle on 2 May 2010 (aged 67) in her family home, surrounded by her loved ones. Her diagnosis led her to realize the beauty and simplicities of life, and she was quoted as saying: \"there isn't any such thing as a bad day. Yes, bad things happen. But any day that I'm still here, able to feel and think and share things with people, then how could that possibly be a bad day?\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NjEwMzIxMl5BMl5BanBnXkFtZTcwMjUwNzAzNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001655","name":"Lynn Redgrave","idIMDB":"nm0001655"},"actorId":"nm0001655","character":"The Wicked Witch of the East","urlCharacter":"http://www.imdb.com/character/ch0027293","main":true},{"actorName":"Miklos Perlus","urlProfile":"http://www.imdb.com/name/nm0674280","urlPhoto":"","biography":{"dateOfBirth":"23 March 1977","placeOfBirth":" Toronto, Ontario, Canada","bio":"Living in Toronto and Montreal, Miklos has worked on both sides of the camera for over twenty years. As an actor, Miklos starred in several television series and films including Student Bodies and Inside the Osmonds. He also voiced several animated characters including Quentin MacCloud in Highlander: The Animated Series and Eric Needles in Sidekick. After graduating from McGill University, and the Canadian Film Centre's screen writing program, Mik spent two seasons as writer and story editor on Degrassi: The Next Generation, for which he was awarded a Canadian Screenwriting Award. he also wrote for Instant Star, a series he co-developed for Epitome Pictures and CTV. In 2008, Mik joined Toronto's marblemedia as Head of Development, Kids & Scripted. He continues to voice animated characters and is married with two children.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0674280","name":"Miklos Perlus","nicknames":["Mik"],"idIMDB":"nm0674280"},"actorId":"nm0674280","character":"Sunbeam","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Eleanor Noble","urlProfile":"http://www.imdb.com/name/nm0633579","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MDkwMjAzMl5BMl5BanBnXkFtZTgwMjY4NjY5NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Eleanor Noble is an actress, known for Yakari (2005), Arthur (1996) and Assassin's Creed (2007).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk2MDkwMjAzMl5BMl5BanBnXkFtZTgwMjY4NjY5NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0633579","name":"Eleanor Noble","idIMDB":"nm0633579"},"actorId":"nm0633579","character":"Moonbeam","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Elizabeth Robertson","urlProfile":"http://www.imdb.com/name/nm0731827","urlPhoto":"","biography":{"bio":"Elizabeth Robertson is an actress, known for Heavy Metal 2000 (2000), Savage Messiah (2002) and Lion of Oz (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0731827","name":"Elizabeth Robertson","idIMDB":"nm0731827"},"actorId":"nm0731827","character":"Starburst","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Scott McNeil","urlProfile":"http://www.imdb.com/name/nm0573926","urlPhoto":"","biography":{"dateOfBirth":"15 September 1962","placeOfBirth":" Brisbane, Australia","height":"6' 4\" (1.93 m)","bio":"Scott McNeil was born on September 15, 1962 in Brisbane, Australia. He is known for his work on Dragon Ball Z (1996), Conan: The Adventurer (1992) and Ranma ½ (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0573926","name":"Scott McNeil","nicknames":["Old Lady McNeil"],"idIMDB":"nm0573926"},"actorId":"nm0573926","character":"Gloom","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bobcat Goldthwait","urlProfile":"http://www.imdb.com/name/nm0001281","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MDYxMTYwOF5BMl5BanBnXkFtZTcwNDUwNTYyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 May 1962","placeOfBirth":" Syracuse, New York, USA","birthName":"Robert Francis Goldthwait","height":"5' 7\" (1.7 m)","bio":"Robert Francis 'Bobcat' Goldthwait, born May 26, 1962, is an American comedian. He is most widely known for his high pitch voice during his comedy acts. He was born in Syracuse, New York in 1962. He decided on a career as a comedian at an early age and was performing professionally while still in high school at the age of 15. He and his classmate, Tom Kenny, performed in a comedy duo, billing themselves as \"Bobcat and Tomcat\". Goldthwait became recognized as a solo stand-up comedian and had three televised concert specials in the 1980s: Bob Goldthwait - Is He Like That All the Time?, An Evening with Bobcat Goldthwait: Share the Warmth (1987) and Meat Bob. Goldthwait's first major film role was in Police Academy 2: Their First Assignment (1985). He reprised the role in the next two films in the series. During the fall of 1993, Goldthwait did stand-up material as an opening act for Nirvana on what would be their final North American tour. He has made several guest appearances on talk shows as well as comedy programs including The Ben Stiller Show (1992). On May 9, 1994, he made a controversial appearance on The Tonight Show with Jay Leno (1992), where, on impulse, he set a couch on fire. This incident was then the basis of the plot for his subsequent appearance on The Larry Sanders Show (1992). One of the most recognizable features of Goldthwait's performances is his voice. Goldthwait has voiced characters on the television series Capitol Critters (1992); The Moxy & Flea Show (1995); Unhappily Ever After (1995); Hercules (1998) and Buzz Lightyear of Star Command (2000). He has also appeared, as himself, hosting the comedy quiz show Bobcat's Big Ass Show (1998). Goldthwait has released two comedy albums: \"Meat Bob\" (1988) on Chrysalis Records and \"I Don't Mean to Insult You, but You Look Like Bobcat Goldthwait\" (23 September, 2003) on Comedy Central Records. He made his feature film directorial debut with Shakes the Clown (1991), which he wrote and starred in as well. His film, Windy City Heat (2003), won a Comedia Award for Best Comedy Film at Montreal's Just for Laughs Film Festival in 2004. He married Ann Luly in 1986 at the age of 24. The couple have two children (now grown), Tasha and Taylor, and divorced in May 1998. At one time, Goldthwait was engaged to his Unhappily Ever After (1995) co-star, Nikki Cox, but the couple has since split. Bobcat began directing ABC's Jimmy Kimmel Live! (2003) in the fall 2004 season. Since joining the show's crew, the ratings went up to 2 million viewers a night, with the numbers rising nearly 50% with the teenage demographic. In May of 2006, he left to pursue his film career as a filmmaker/director but has since returned to the show. Goldthwait's most recent feature, \"Sleeping Dogs Lie\" (formally Sleeping Dogs Lie (2006)), starring Melinda Page Hamilton, was in the 2006 Sundance Film Festival and it was part of the \"Independent Dramatic Features\" competition. \"Sleeping Dogs Lie\" is about a youthful, impulsive sexual encounter which opens the door to a dark comedy about the complexities of honesty. It was also nominated for the Grand Jury Prize in the \"Dramatic Features\" category. \"Sleeping Dogs Lie\" was picked up in a mid-six figure deal for distribution in north America by Roadside Attractions & Samuel Goldwyn Films at the 2006 Sundance Film Festival. A French film company called \"Gaumont\" bought it for the international rights to the film in France. \"Tartan Films\", a UK-based production company, also bought it for international rights in the United Kingdom. The film was released in the US on October 20, 2006.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0MDYxMTYwOF5BMl5BanBnXkFtZTcwNDUwNTYyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001281","name":"Bobcat Goldthwait","nicknames":["The Bobcat","Bobscratch Goldfarb"],"idIMDB":"nm0001281"},"actorId":"nm0001281","character":"Silly Ozbul","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jane Horrocks","urlProfile":"http://www.imdb.com/name/nm0001363","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzIxNjI5NV5BMl5BanBnXkFtZTYwMTIyODI0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 January 1964","placeOfBirth":" Rossendale Valley, Lancashire, England, UK","birthName":"Barbara Jane Horrocks","height":"5' 2\" (1.57 m)","bio":"Jane Horrocks was born January 18, 1964 in Rawtenstall, Lancashire, England, UK, she is the youngest of three children born to Barbara and John Horrocks. She attended Balladen County Primary School before she enrolled at Oldham College, and later, Royal Academy of Dramatic Art, among her classmates were Imogen Stubbs and Ralph Fiennes. Jane received great reviews for her performance in Life Is Sweet (1990), followed by her award-winning performance in \"The Rise and Fall of Little Voice\", a play directed by Jim Cartwright who had written the play in awe of Jane's singing impressions of Judy Garland, Shirley Bassey and Ethel Merman. The play was adapted into a film in which Jane reprised her role as Little Voice (1998). For her performance in the film, she was nominated a BAFTA Film Award, BSFC Award, British Independent Film Award, CFCA Award, Golden Globe, Golden Satellite Award, Screen Actors Guild Award, and SEFCA Award.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUyMzIxNjI5NV5BMl5BanBnXkFtZTYwMTIyODI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001363","name":"Jane Horrocks","idIMDB":"nm0001363"},"actorId":"nm0001363","character":"Wimsik","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tim Curry","urlProfile":"http://www.imdb.com/name/nm0000347","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MTQ2OTYwOF5BMl5BanBnXkFtZTYwMzEzMTA1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 April 1946","placeOfBirth":" Grappenhall, Cheshire, England, UK","birthName":"Timothy James Curry","height":"5' 9\" (1.75 m)","bio":"Timothy James Curry was born on April 19, 1946 in Grappenhall, Cheshire, England. His mother, Maura Patricia (Langmead), was a school secretary, and his father, James Curry, was a Methodist Royal Navy chaplain. Curry studied Drama and English at Birmingham University, from which he graduated with Combined Honors. His first professional success was in the London production of \"Hair\", followed by more work in the Royal Shakespeare Company, the Glasgow Civic Repertory Company, and the Royal Court Theatre where he created the role of Dr. Frank-N-Furter in \"The Rocky Horror Show\". He recreated the role in the Los Angeles and Broadway productions and starred in the screen version entitled The Rocky Horror Picture Show (1975). Curry continued his career on the New York and London stages with starring roles in \"Travesties\", \"Amadeus\", \"The Pirates of Penzance\", \"The Rivals\", \"Love for Love\", \"Dalliance\", \"The Threepenny Opera\", \"The Art of Success\" and \"My Favorite Year\". He also starred in the United States tour of \"Me and My Girl\". He has received two Tony Award nominations for best actor and won the Royal Variety Club Award as \"Stage Actor of the Year\". A composer and a singer, Tim Curry toured the United States and Europe with his own band and released four albums on A&M Records. In addition to an active movie and television career, he is a sought-after actor for CD-ROM productions. His distinctive voice can be heard on more than a dozen audio books, and in countless animated television series and videos. He lives in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MTQ2OTYwOF5BMl5BanBnXkFtZTYwMzEzMTA1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000347","name":"Tim Curry","nicknames":["The Cheshire Cat"],"idIMDB":"nm0000347"},"actorId":"nm0000347","character":"Captain Fitzgerald","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kathy Griffin","urlProfile":"http://www.imdb.com/name/nm0004980","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTEyMjM3M15BMl5BanBnXkFtZTcwNzk2MTU5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 November 1960","placeOfBirth":" Chicago, Illinois, USA","birthName":"Kathleen Mary Griffin","height":"5' 4\" (1.63 m)","bio":"Kathy Griffin was raised in the near-west Chicago suburbs, in an Irish-American family. She has three older brothers and an older sister. When her parents retired to California, Kathy moved west with them after graduating from Oak Park River Forest High School and began trying to break into show business. She performed with the Groundlings and then paid her dues doing stand-up at various clubs until she was discovered. According to her brothers, as a kid, Kathy would circulate among the guests at parties and tell jokes. Kathy has a regular stand-up engagement at the Laugh Factory in L.A. and hosted the reality series Average Joe (2003). She stars in the Emmy winning reality series Kathy Griffin: My Life on the D-List (2005).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU2NTEyMjM3M15BMl5BanBnXkFtZTcwNzk2MTU5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004980","name":"Kathy Griffin","nicknames":["Queen of the D-list"],"idIMDB":"nm0004980"},"actorId":"nm0004980","character":"Caroline","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Peter Kelamis","urlProfile":"http://www.imdb.com/name/nm0445389","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NjE5NDQyN15BMl5BanBnXkFtZTcwNjc0NjE2NA@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 December 1967","placeOfBirth":" Sydney, Australia","height":"5' 10¾\" (1.8 m)","bio":"Born in Australia and raised in Vancouver, Canada, he is married to actress Alannah Stewartt. They have a daughter together. Peter is a \"Triple Threat\" in the entertainment industry. He is an accomplished actor, voice actor and stand-up comedian. He has two recorded television comedy specials to his name.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk1NjE5NDQyN15BMl5BanBnXkFtZTcwNjc0NjE2NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0445389","name":"Peter Kelamis","idIMDB":"nm0445389"},"actorId":"nm0445389","character":"Tog","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Don Brown","urlProfile":"http://www.imdb.com/name/nm0113427","urlPhoto":"","biography":{"bio":"Don Brown is an actor, known for Dragon Ball Z (1996), G.I. Joe (1990) and Beast Wars: Transformers (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0113427","name":"Don Brown","idIMDB":"nm0113427"},"actorId":"nm0113427","character":"Pin Cushion","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0120733","urlIMDB":"http://www.imdb.com/title/tt0120733","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 14 min (74 min) (USA)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"5.8","filmingLocations":[],"awards":[],"votes":"222","type":"Movie","companyCreditsSimple":[{"idCompany":"co0051822","name":"CinéGroupe"},{"idCompany":"co0060306","name":"Lions Gate Films"},{"idCompany":"co0060012","name":"Sony Wonder"}],"keywords":{"keywords":["lion","animal name in title","animal in title","cartoon lion","prequel","wooden soldier","balloon","based on novel","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 05:46:06"}}