{"data":{"movies":[{"title":"Star Trek VI: The Undiscovered Country","originalTitle":"","year":"1991","releaseDate":"19911206","directors":[{"name":"Nicholas Meyer","id":"nm0583292"}],"writers":[{"name":"Gene Roddenberry","id":"nm0734472"},{"name":"Leonard Nimoy","id":"nm0000559"}],"runtime":"113 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYTM1ZDc0MDEtYjhhMC00ZWFmLThlMTYtOTI2MTdkZDVhODQwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA"],"languages":["English","Klingon"],"genres":["Action","Adventure","Sci-Fi","Thriller"],"plot":"After an explosion on their moon, the Klingons have an estimated 50 years before their ozone layer is completely depleted, and they all die. They have only one choice - to make peace with the Federation, which will mean an end to 70 years of conflict. Captain James T. Kirk and crew are called upon to help in the negotiations because of their experience with the Klingons. Peace talks don't quite proceed, and Kirk and McCoy are convicted of assassinating the Klingon High Chancellor, and imprisoned on Rura Penthe, a snowy hard-labor prison camp. Will they manage to escape? And will there ever be peace with the Klingons?","simplePlot":"On the eve of retirement, Kirk and McCoy are charged with assassinating the Klingon High Chancellor and imprisoned. The Enterprise crew must help them escape to thwart a conspiracy aimed at sabotaging the last best hope for peace.","actors":[{"actorName":"William Shatner","urlProfile":"http://www.imdb.com/name/nm0000638","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NjUzOTEzMl5BMl5BanBnXkFtZTcwOTMyMTA3Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 March 1931","placeOfBirth":" Montreal, Quebec, Canada","height":"5' 9½\" (1.77 m)","bio":"William Shatner has notched up an impressive 50-plus years in front of the camera, most recently displaying comedic talent, and being instantly recognizable to several generations of cult television fans as the square-jawed Captain James T. Kirk, commander of the starship U.S.S. Enterprise. Shatner was born in Côte Saint-Luc, Montreal, Canada, to Anne (Garmaise) and Joseph Shatner, a clothing manufacturer. His father was a Jewish immigrant from Bukovina in the Austro-Hungarian Empire, while his maternal grandparents were Lithuanian Jews. After graduating from university he joined a local Summer theatre group as an assistant manager. He then performed with the National Repertory Theatre of Ottawa and at the Stratford, Ontario Shakespeare Festival as an understudy working with such as Alec Guinness, James Mason, and Anthony Quayle. He came to the attention of New York critics and was soon playing important roles on major shows in live television. Shatner spent many years honing his craft before debuting alongside Yul Brynner in The Brothers Karamazov (1958). He was kept busy during the 1960s in films such as Judgment at Nuremberg (1961) and The Intruder (1962) and on television guest-starring in dozens of series such as Alfred Hitchcock Presents (1955), The Defenders (1961), The Outer Limits (1963) and The Twilight Zone (1959). In 1966, Shatner boarded the USS Enterprise for three seasons of Star Trek (1966), co-starring alongside Leonard Nimoy, with the series eventually becoming a bona-fide cult classic with a worldwide legion of fans known as \"Trekkies\". After \"Star Trek\" folded, Shatner spent the rest of the decade and the 1970s making the rounds guest-starring on many prime-time television series, including Hawaii Five-O (1968), Marcus Welby, M.D. (1969) and Ironside (1967). He has also appeared in several feature films, but they were mainly B-grade (or lower) fare such as the embarrassingly bad Euro western White Comanche (1968) and the campy Kingdom of the Spiders (1977). However, the 1980s saw a major resurgence in Shatner's career with the renewed interest in the original Star Trek (1966) series culminating in a series of big-budget \"Star Trek\" feature films including Star Trek: The Motion Picture (1979), Star Trek II: The Wrath of Khan (1982), Star Trek III: The Search for Spock (1984), Star Trek IV: The Voyage Home (1986), Star Trek V: The Final Frontier (1989) and Star Trek VI: The Undiscovered Country (1991). In addition, he starred in the lightweight police series T.J. Hooker (1982) from 1982 to 1986, alongside spunky Heather Locklear, and surprised many fans with his droll comedic talents in Airplane II: The Sequel (1982), Loaded Weapon 1 (1993) and Miss Congeniality (2000). He has most recently been starring in the David E. Kelley television series The Practice (1997) and its spin-off Boston Legal (2004). Outside of work he jogs and follows other athletic pursuits. His interest in health and nutrition led to him becoming spokesman for the American Health Institute's 'Know Your Body' Programme to promote nutritional and physical health.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI3NjUzOTEzMl5BMl5BanBnXkFtZTcwOTMyMTA3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000638","name":"William Shatner","nicknames":["Bill","Billy"],"idIMDB":"nm0000638"},"actorId":"nm0000638","character":"Kirk","urlCharacter":"http://www.imdb.com/character/ch0001448","main":true},{"actorName":"Leonard Nimoy","urlProfile":"http://www.imdb.com/name/nm0000559","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMzY1MzEyNV5BMl5BanBnXkFtZTYwNjU4MTg1._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1931","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Leonard Simon Nimoy","height":"6' (1.83 m)","bio":"Leonard Simon Nimoy was born in Boston, Massachusetts, to Dora (Spinner) and Max Nimoy, who owned a barbershop. His parents were Ukrainian Jewish immigrants. Raised in a tenement and acting in community theaters since age eight, Nimoy did not make his Hollywood debut until he was 20, with a bit part in Queen for a Day (1951) and another as a ballplayer in the perennial Rhubarb (1951). After two years in the United States Army, he was still getting small, often uncredited parts, like an Army telex operator in Them! (1954). His part as Narab, a Martian finally friendly to Earth, in the closing scene in the corny Republic serial Zombies of the Stratosphere (1952), somewhat foreshadowed the role which would make him a household name: Mr. Spock, the half-human/half-Vulcan science officer on Star Trek (1966) one of television's all-time most successful series. His performance won him three Emmy nominations and launched his career as a writer and director, notably of Star Trek IV: The Voyage Home (1986), the story of a humpback whale rescue that proved the most successful of the Star Trek movies. Stage credits have included \"Fiddler on the Roof\", \"Oliver\", \"Camelot\" and \"Equus\". He has hosted the well-known television series In Search of... (1976) and Ancient Mysteries (1994), authored several volumes of poetry and guest-starred on two episodes of The Simpsons (1989). In the latter years of his career, he played Mustafa Mond in NBC's telling of Aldous Huxley's Brave New World (1998), voiced Sentinel Prime in the blockbuster Transformers: Dark of the Moon (2011), and played Spock again in two new Star Trek films, Star Trek (2009) and Star Trek Into Darkness (2013). Leonard Nimoy died on February 27, 2015 in Bel Air, Los Angeles, California, of end-stage chronic obstructive pulmonary disease. He was 83.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzMzY1MzEyNV5BMl5BanBnXkFtZTYwNjU4MTg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000559","name":"Leonard Nimoy","nicknames":["Lenny"],"idIMDB":"nm0000559"},"actorId":"nm0000559","character":"Spock","urlCharacter":"http://www.imdb.com/character/ch0001439","main":true},{"actorName":"DeForest Kelley","urlProfile":"http://www.imdb.com/name/nm0001420","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNzgwNjcwOTJeQTJeQWpwZ15BbWU2MDgwMzgyNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1920","placeOfBirth":" Atlanta, Georgia, USA","birthName":"Jackson DeForest Kelley","height":"5' 10½\" (1.79 m)","bio":"Jackson DeForest Kelley was born on January 20, 1920 in Toccoa, Georgia, to Clora (Casey) and Ernest David Kelley. He graduated from high school at age 16 and went on to sing at the Baptist church where his father was a minister. At age 17, he made his first trip outside the state to visit an uncle in Long Beach, California. He intended to stay for two weeks but ended up staying a year. Upon returning home, he told his parents he was moving to California to become an actor. His mother encouraged him but the idea did not go over well with his father. In California, Kelley was spotted by a Paramount talent scout while working on a United States Navy training film. He became a reliable character actor (often in Westerns in which he often played the villain), but hit the big time when he was offered the role of the somewhat irascible Dr. Leonard \"Bones\" McCoy on the television series Star Trek (1966). He later reprised his role for a string of successful Star Trek films: Star Trek: The Motion Picture (1979), Star Trek II: The Wrath of Khan (1982), Star Trek III: The Search for Spock (1984), Star Trek IV: The Voyage Home (1986), Star Trek V: The Final Frontier (1989), and Star Trek VI: The Undiscovered Country (1991). DeForest Kelley died at age 79 of stomach cancer in his home in Woodland Hills, Los Angeles on June 11, 1999.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTEwNzgwNjcwOTJeQTJeQWpwZ15BbWU2MDgwMzgyNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001420","name":"DeForest Kelley","nicknames":["De","Bones"],"idIMDB":"nm0001420"},"actorId":"nm0001420","character":"McCoy","urlCharacter":"http://www.imdb.com/character/ch0001514","main":true},{"actorName":"James Doohan","urlProfile":"http://www.imdb.com/name/nm0001150","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzODkyOTg1Nl5BMl5BanBnXkFtZTYwOTA5ODUz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1920","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"James Montgomery Doohan","height":"5' 8\" (1.73 m)","bio":"James Doohan was born on March 3, 1920 in Vancouver, British Columbia, Canada as James Montgomery Doohan. He is known for his work on Star Trek IV: The Voyage Home (1986), Star Trek II: The Wrath of Khan (1982) and Star Trek (1966). He was married to Wende Doohan, Anita Yagel and Janet Young. He died on July 20, 2005 in Redmond, Washington, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzODkyOTg1Nl5BMl5BanBnXkFtZTYwOTA5ODUz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001150","name":"James Doohan","nicknames":["Jimmy"],"idIMDB":"nm0001150"},"actorId":"nm0001150","character":"Scotty","urlCharacter":"http://www.imdb.com/character/ch0001544","main":true},{"actorName":"Walter Koenig","urlProfile":"http://www.imdb.com/name/nm0000479","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODk1Mzc4NTU0M15BMl5BanBnXkFtZTcwNTk2ODY5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 September 1936","placeOfBirth":" Chicago, Illinois, USA","birthName":"Walter Marvin Koenig","height":"5' 6\" (1.68 m)","bio":"Walter Koenig has had a recurring role of the quintessential scoundrel Bester on the television series Babylon 5 (1994). He has been the \"Special Guest Star\" in twelve episodes and, at the end of the third season, the production company applied for an Emmy nomination on his behalf. He once again plays Bester in the spin-off series Crusade (1999). He has also appeared on dozens of other television series and as Pavel Chekov in the original Star Trek (1966) series. Koenig recreated the character of the Russian navigator for the first seven Star Trek films and took the leading role in the video feature, Moontrap (1989). In an interactive state-of-the-art video game from Digital Pictures called Maximum Surge (1996), Koenig starred as Drexel, another scoundrel. Walter completed worked in the low budget feature film Drawing Down the Moon (1997) from Chaos Productions. And has star billing as a German psychologist in the martial arts picture, Sworn to Justice (1996). A one character piece that Koenig wrote and performed entitled \"You're Never Alone when You're a Schizophrenic\" was a finalist in the 1996 New York Film Festival awards. Koenig filmed a guest appearance as himself on the CBS situation comedy Almost Perfect (1995), did sketch comedy on the Comedy Central series \"Viva Variety\" (1996) and performed on an ESPN sports commercial that aired in the spring of 1998. The Viacom CD-Rom, Star Trek: Starfleet Academy (1997) in which he reprised the character of Chekov continues to sell impressively. Walter also hosted a cult movie marathon for Comedy Central. It played once a week for the course of a month. Koenig's autobiography, \"Warped Factors - A Neurotic's Guide to the Universe\" was released through Taylor Publishing on April 1, 1998. The audio tape reading of the book by the author has been released through Dove Video in January 1999. Koenig performed as the Shadow Guy in an episode of Diagnosis Murder (1993) and went to New York to perform in a new radio broadcast version of \"War of the Worlds\" in tribute to both H.G. Wells and Orson Welles. From \"The Girls of Summer\" to \"The Boys in Autumn\", Koenig's stage career spans thirty years and includes stops in New York with \"A Midsummer Night's Dream\" (Quince) and \"Six Characters in Search of an Author\" (Oldest Son). In Chicago, he guested in \"Make a Million\" (Johnny) opposite Jackie Coogan and on the road -- from Arizon to Philadelphia -- Mark Lenard (Sarek: Spock's father) and he performed in the short plays \"Box and Cox\" (Box) and \"Actors\" (Dave). They also toured in a two character play, \"The Boys in Autumn\", the comedy-drama about the reunion of Tom Sawyer and Huck Finn forty years later. By himself, Koenig also starred as Larry the Liquidator in \"Other People's Money\" in Reno, Nevada. His Los Angeles productions include \"Steambath\" (God), \"The White House Murder Case\" (Captain Weems), \"Night Must Fall\" (Danny), \"La Ronde\" (Gentleman), \"The Typist and the Tiger\" (Paul), and \"The Deputy\" (Jacobson) among almost two dozen others (\"Blood Wedding\", \"The Collection\", et al.). Directorial credits include \"Hotel Paradiso\" for Company of Angles, \"Beckett\" for Theatre 40, \"America Hurrah!\" at the Oxford Theater, \"Twelve Angry Men\" at the Rita Hayworth Theatre, \"Matrix\" at the Gascon Theatre Institute, and \"Three by Ten\" at Actor's Alley. Walter has performed in the television movies Antony and Cleopatra (1984) (Pompey) opposite Timothy Dalton and Lynn Redgrave as well as the MOW's Goodbye, Raggedy Ann (1971) and The Questor Tapes (1974). Walter has written for the television series The Powers of Matthew Star (1982), What Really Happened to the Class of '65? (1977), Family (1976), Land of the Lost (1974), and the animated Star Trek: The Animated Series (1973) series. This actor-writer has seen publication with the non-fiction \"Chekov's Enterprise\" and the satiric fantasy novel \"Buck Alice and the Actor-Robot\". He also created the three issues of the comic book story \"Raver\" published by Malibu Comics. Koenig has taught classes in acting and directing privately at UCLA, The Sherwood Oaks Experimental Film College and at the California School of Professional Psychology. Most recently, he has been an instructor at the Actor's Alley Repertory Company in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODk1Mzc4NTU0M15BMl5BanBnXkFtZTcwNTk2ODY5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000479","name":"Walter Koenig","idIMDB":"nm0000479"},"actorId":"nm0000479","character":"Chekov","urlCharacter":"http://www.imdb.com/character/ch0001534","main":true},{"actorName":"Nichelle Nichols","urlProfile":"http://www.imdb.com/name/nm0629667","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk4OTUxMTU0OV5BMl5BanBnXkFtZTYwNzY4OTc2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 December 1932","placeOfBirth":" Robbins, Illinois, USA","birthName":"Grace Nichols","height":"5' 5\" (1.65 m)","bio":"Nichelle Nichols was born Grace Nichols on December 28, 1932 in Robbins, Illinois. She began her show business career at age 16 as a singer with Duke Ellington in a ballet she created for one of his compositions and later sang with his band. After switching to acting, she was twice nominated for the Sarah Siddons Award for best actress in \"The Blacks\" and \"Kicks and Company\". Her film debut found her dancing with Sammy Davis Jr. in Porgy and Bess (1959). A guest appearance on The Lieutenant (1963) led to an offer from Gene Roddenberry to join the cast of Star Trek (1966). Her best known role on the series is communications officer Lieutenant Nyota Uhura. She later repeated her role in a string of successful Star Trek films: Star Trek: The Motion Picture (1979), Star Trek II: The Wrath of Khan (1982), Star Trek III: The Search for Spock (1984), Star Trek IV: The Voyage Home (1986), Star Trek V: The Final Frontier (1989), and Star Trek VI: The Undiscovered Country (1991). Invited to join the board of directors of the National Space Institute, NASA asked her to participate in its astronaut recruitment programme for the space shuttle project. Three of her recruits were on the ill-fated Challenger mission. For her work, she received NASA's distinguished Public Service Award. She has a consultant firm, Women in Motion Inc. through which she produced and starred in the Smithsonian Institution's National Air and Space Museum film \"What's in It for Me?\". With all this, she has not neglected her singing making a series of video albums the latest being \"Nichelle Nichols: Live at Disneyland\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTk4OTUxMTU0OV5BMl5BanBnXkFtZTYwNzY4OTc2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0629667","name":"Nichelle Nichols","idIMDB":"nm0629667"},"actorId":"nm0629667","character":"Uhura","urlCharacter":"http://www.imdb.com/character/ch0001462","main":true},{"actorName":"George Takei","urlProfile":"http://www.imdb.com/name/nm0001786","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU4MDUwMTAxOV5BMl5BanBnXkFtZTgwNjEzOTU4NjE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 April 1937","placeOfBirth":" Los Angeles, California, USA","birthName":"George Hosato Takei","height":"5' 6\" (1.68 m)","bio":"Although primarily known for playing Hikaru Sulu in the television series Star Trek (1966) and the first six features, George Takei has had a varied career acting in television, feature films, live theater and radio. He also is a successful writer and community activist. George Takei was born Hosato Takei on April 20, 1937, in Boyle Heights, Los Angeles, California. His mother, Fumiko Emily (Nakamura), was born in Sacramento, to Japanese parents, and his father, Takekuma Norman Takei, worked in real estate and was born in Japan's Yamanashi Prefecture. Following the attack on Pearl Harbor, George and his family were relocated from Los Angeles to the Rohwer Relocation Center in Arkansas, and later, as the war was ending they were moved to a camp at Tule Lake in Northern California. Takei's first-hand knowledge of the unjust internment of 120,000 Japanese Americans in World War II, poignantly chronicled in his autobiography, created a lifelong interest in politics and community affairs. After graduating from Los Angeles High School in 1956, George studied architecture at UC Berkeley. An ad in a Japanese community paper led to a summer job on the MGM lot dubbing eight characters from Japanese into English for Rodan (1956) (aka \"Rodan\"). With the acting bug kindled in him, he transferred to UCLA as a theater arts major. Contacting an agent he had met at MGM led to Takei's appearance as an embittered soldier in postwar Japan in the Playhouse 90 (1956) production \"Made in Japan\" even before starting classes at UCLA. Being spotted in a UCLA theater production by a Warner Bros. casting director led to George's feature film debut in Ice Palace (1960), various roles in Hawaiian Eye (1959) and other feature work. In June 1960, he completed his degree at UCLA and studied that summer at the Shakespeare Institute at Stratford-Upon-Avon in England. After starting a Master's degree program at UCLA, George was cast in the socially relevant stage musical production, \"Fly Blackbird!\" but was replaced when the show moved to New York. He took odd jobs until returning to his role at the end of the run. Getting little work in Manhattan, George returned to Los Angeles to continue his studies at UCLA, once again appearing in television series and feature films. He earned his Master's degree in 1964. Wanting a multi-racial crew, Gene Roddenberry cast him in \"Where No Man Has Gone Before\", the second Star Trek (1966) pilot. Mr. Sulu remained as a regular character when the series went into production. In the hiatus after the end of shooting the first season, he worked on The Green Berets (1968), playing a South Vietnamese Special Forces officer. After Star Trek (1966) was cancelled, Takei did guest stints in several television series, voiced Sulu for the animated Star Trek series and regularly appeared at Star Trek conventions. He also produced and hosted a public affairs show, \"Expression East/West\" aired in Los Angeles from 1971 to 1973. In 1973, he ran for the Los Angeles City Council. Although he lost by a small margin, Mayor Tom Bradley appointed him to the board of directors of the Southern California Rapid Transit District, where he served until 1984 and contributed to plans for the subway. During this period, he co-wrote a sci-fi novel, \"Mirror Friend, Mirror Foe\". He campaigned to get more respect for his character in the Star Trek features, resulting in Sulu finally obtaining the rank of captain in Star Trek VI: The Undiscovered Country (1991), a role reprised in the Star Trek: Voyager (1995) episode \"Flashback\". George has run several marathons and was in the 1984 Los Angeles Olympic Torch Relay. He gained a star on Hollywood Boulevard's Walk of Fame in 1986 and left his signature and hand print in cement at the Chinese Theater in 1991. His 1994 autobiography, \"To the Stars\", was well-received by more than just Star Trek fans. He remains active as a stage, television and film actor and as an advocate for the interests of Japanese-Americans.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU4MDUwMTAxOV5BMl5BanBnXkFtZTgwNjEzOTU4NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001786","name":"George Takei","nicknames":["Uncle George"],"idIMDB":"nm0001786"},"actorId":"nm0001786","character":"Sulu","urlCharacter":"http://www.imdb.com/character/ch0001473","main":true},{"actorName":"Kim Cattrall","urlProfile":"http://www.imdb.com/name/nm0000326","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NjMyMjAyMV5BMl5BanBnXkFtZTcwMDk1ODQ5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 August 1956","placeOfBirth":" Liverpool, England, UK","birthName":"Kim Victoria Cattrall","height":"5' 6½\" (1.69 m)","bio":"Kim Victoria Cattrall was born on August 21, 1956 in Mossley Hill, Liverpool, England to Gladys Shane (Baugh), a secretary, and Dennis Cattrall, a construction engineer. At the age of three months, her family emigrated to Canada, where a large number of her films have been made. At age 11, she returned to her native country and studied at the London Academy of Music and Dramatic Art. She returned to Vancouver and, at age 16, graduated from high school and won a scholarship to study at the American Academy of Dramatic Arts in New York City. During her final year at the Academy, she won a role in Otto Preminger's action thriller Rosebud (1975). Following her film debut, Kim returned to the theatre, first in Vancouver and then in repertory in Toronto prior to winning a contract at Universal Pictures in Los Angeles, California. Her best known film role is the Vulcan Lieutenant Valeris in Star Trek VI: The Undiscovered Country (1991). She is also best known for her role as public relations executive Samantha Jones on the situation comedy Sex and the City (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NjMyMjAyMV5BMl5BanBnXkFtZTcwMDk1ODQ5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000326","name":"Kim Cattrall","idIMDB":"nm0000326"},"actorId":"nm0000326","character":"Lt. Valeris","urlCharacter":"http://www.imdb.com/character/ch0453263","main":true},{"actorName":"Mark Lenard","urlProfile":"http://www.imdb.com/name/nm0501697","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNTUwNzI4M15BMl5BanBnXkFtZTcwNzU3MzYxOA@@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 October 1924","placeOfBirth":" Chicago, Illinois, USA","birthName":"Leonard Rosenson","height":"6' (1.83 m)","bio":"Mark Lenard was born on October 15, 1924 in Chicago, Illinois, USA as Leonard Rosenson. He was an actor, known for Star Trek IV: The Voyage Home (1986), Another World (1964) and Star Trek VI: The Undiscovered Country (1991). He was married to Ann Amouri. He died on November 22, 1996 in New York City, New York, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNTUwNzI4M15BMl5BanBnXkFtZTcwNzU3MzYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0501697","name":"Mark Lenard","idIMDB":"nm0501697"},"actorId":"nm0501697","character":"Sarek","urlCharacter":"http://www.imdb.com/character/ch0001606","main":true},{"actorName":"Grace Lee Whitney","urlProfile":"http://www.imdb.com/name/nm0926298","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyOTI5NzkyM15BMl5BanBnXkFtZTgwNzY3MDk0MDE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 April 1930","placeOfBirth":" Ann Arbor, Michigan, USA","birthName":"Mary Ann Chase","height":"5' 6\" (1.68 m)","bio":"Grace Lee Whitney was a versatile actress and vocalist born in Ann Arbor, Michigan. Beginning as a \"girl singer\" on Detroit's WJR radio, she soon opened in nightclubs for Billie Holiday and Buddy Rich, and toured with the Spike Jones and Fred Waring Bands. Grace debuted on Broadway in \"Top Banana\", and subsequently appeared in the United Artists film Top Banana (1954). Grace is probably best known for her portrayal of Yeoman Janice Rand on the original Star Trek (1966) series. She later reprised her role for a string of successful Star Trek films: Star Trek: The Motion Picture (1979), Star Trek III: The Search for Spock (1984), Star Trek IV: The Voyage Home (1986), and Star Trek VI: The Undiscovered Country (1991). Grace continued to delight fans in personal appearances at conventions and events throughout North America and Europe. In 1998, she appeared in an episode of Diagnosis Murder (1993) with her Star Trek castmates George Takei, Walter Koenig and Majel Barrett. Grace Lee Whitney died at age 85 of natural causes in her home in Coarsegold, California on May 1, 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQyOTI5NzkyM15BMl5BanBnXkFtZTgwNzY3MDk0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0926298","name":"Grace Lee Whitney","nicknames":["Amazing Grace","Gracie"],"idIMDB":"nm0926298"},"actorId":"nm0926298","character":"Excelsior Communications Officer","urlCharacter":"http://www.imdb.com/character/ch0001592","main":true},{"actorName":"Brock Peters","urlProfile":"http://www.imdb.com/name/nm0676349","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM0OTMwMzc1Nl5BMl5BanBnXkFtZTcwMzkwMjEzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 July 1927","placeOfBirth":" New York City, New York, USA","birthName":"George Fisher","height":"6' (1.83 m)","bio":"Born of African and West Indian ancestry on July 2, 1927 in New York City, Brock Peters set his sights on a show business career early on, at age ten. A product of NYC's famed Music and Arts High School, Peters initially fielded more odd jobs than acting jobs as he worked his way up from Harlem poverty. Landing a stage role in \"Porgy and Bess\" in 1949, he quit physical education studies at CCNY and went on tour with the acclaimed musical. His film debut came in Carmen Jones (1954), but he really began to make a name for himself - having dropped his real name, George Fisher, in 1953 - in such films as To Kill a Mockingbird (1962) and The L-Shaped Room (1962). He received a Tony Award nomination for his starring stint in Broadway's \"Lost in the Stars\" in 1973. He also appeared in Star Trek IV: The Voyage Home (1986) and Star Trek VI: The Undiscovered Country (1991), two sequels to the popular Star Trek films. Brock Peters died at age 78 of pancreatic cancer on August 23, 2005.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTM0OTMwMzc1Nl5BMl5BanBnXkFtZTcwMzkwMjEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0676349","name":"Brock Peters","idIMDB":"nm0676349"},"actorId":"nm0676349","character":"Admiral Cartwright","urlCharacter":"http://www.imdb.com/character/ch0001559","main":true},{"actorName":"Leon Russom","urlProfile":"http://www.imdb.com/name/nm0751762","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA4MDk3MzQ3OV5BMl5BanBnXkFtZTcwMzQyOTUwMg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 December 1941","placeOfBirth":" Little Rock, Arkansas, USA","height":"5' 9\" (1.75 m)","bio":"Best known as Prison Break's General Jonathan Kranz (Padman) and the Malibu police chief in The Big Lebowski, Russom was, for twenty-two years, a New York stage actor whose day job was soaps with long tenures as Joe Taylor on Love Is A Many Splendored Thing, Willis Frame on Another World and Jack Darling on All My Children. The feature No Way Out brought Russom to Los Angeles in 1987. A year later, after starring opposite Carol Burnett in Hostage, he moved to LA permanently to star in NBC's TV101. Emmy nominated for the television film Long Road Home, Russom has continued his theatrical activity in Los Angeles (and Broadway) while establishing himself as a presence in episodic television and feature films. He recently completed shooting on True Grit, his second film with Joel and Ethan Coen.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjA4MDk3MzQ3OV5BMl5BanBnXkFtZTcwMzQyOTUwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0751762","name":"Leon Russom","idIMDB":"nm0751762"},"actorId":"nm0751762","character":"Chief in Command","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kurtwood Smith","urlProfile":"http://www.imdb.com/name/nm0001748","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTQxNTkxOV5BMl5BanBnXkFtZTcwMjAzMjU5MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 July 1943","placeOfBirth":" New Lisbon, Wisconsin, USA","birthName":"Kurtwood Larson Smith","height":"6' 1\" (1.85 m)","bio":"Kurtwood Smith was born on July 3, 1943 in New Lisbon, Wisconsin, USA as Kurtwood Larson Smith. He is an actor, known for That '70s Show (1998), RoboCop (1987) and Dead Poets Society (1989). He has been married to Joan Pirkle since November 5, 1988. He was previously married to Cecilia Souza.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU0NTQxNTkxOV5BMl5BanBnXkFtZTcwMjAzMjU5MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001748","name":"Kurtwood Smith","nicknames":["Woody","Kurt","Wood"],"idIMDB":"nm0001748"},"actorId":"nm0001748","character":"Federation President","urlCharacter":"http://www.imdb.com/character/ch0076296","main":true},{"actorName":"Christopher Plummer","urlProfile":"http://www.imdb.com/name/nm0001626","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzQ5MDY3NF5BMl5BanBnXkFtZTcwNzMxOTU5Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 December 1929","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Arthur Christopher Orme Plummer","height":"5' 10½\" (1.79 m)","bio":"Arthur Christopher Orme Plummer was born in Toronto, Ontario. He is the only child of Isabella Mary (Abbott), a secretary to the Dean of Sciences at McGill University, and John Orme Plummer, who sold securities and stocks. He is a great-grandson of John Abbott, who was Canada's third Prime Minister (from 1891 to 1892), and a great-great-great-grandson of Anglican clergyman John Bethune. He has Scottish, English, and Anglo-Irish ancestry. Plummer was raised in Senneville, Quebec, by Montreal. Until the 2009 Academy Awards were announced, it could be said about Plummer that he was the finest actor of the post-World War II period to fail to get an Academy Award. In that, he was following in the footsteps of the late great John Barrymore, whom Plummer so memorably portrayed on Broadway in a one-man show that brought him his second Tony Award. In 2010, Plummer finally got an Oscar nod for his portrayal of another legend, Leo Tolstoy in Tolstoï, le dernier automne (2009). Two years later, the first paragraph of his obituary was written when the 82-year-old Plummer became the oldest person in Academy history to win an Oscar. He won for playing a senior citizen who comes out as gay after the death of his wife in the movie Beginners (2010). As he clutched his statuette, the debonaire thespian addressed it thusly: \"You're only two years older than me darling, where have you been all of my life?\" Plummer then told the audience that at birth, \"I was already rehearsing my Academy acceptance speech, but it was so long ago mercifully for you I've forgotten it.\" The Academy Award was a long time in coming and richly deserved. Aside from the youngest member of the Barrymore siblings (which counted Oscar-winners Ethel Barrymore and Lionel Barrymore in their number), Christopher Plummer is the premier Shakespearean actor to come out of North America in the 20th century. He was particularly memorable as Hamlet, Iago and Lear, though his Macbeth opposite Glenda Jackson was -- and this was no surprise to him due to the famous curse attached to the \"Scottish Play\" -- a failure. Plummer also has given many fine portrayals on film, particularly as he grew older and settled down into a comfortable marriage with his third wife Elaine. He thanked her from the stage during the 2012 Oscar telecast, quipping that she \"deserves the Nobel Peace Prize for coming to my rescue every day of my life.\" Like another great stage actor, Richard Burton, the younger Plummer failed to connect with the screen in a way that would make him a star. Dynamic on stage, the charisma failed to transfer through the lens onto celluloid. Burton's early film career, when he was a contract player at 20th Century-Fox, failed to ignite despite his garnering two Oscar nominations early on. He did not become a superstar until the mid-1960s, after hooking up with Elizabeth Taylor on the set of Cleopatra (1963). It was Liz whom he credited with teaching him how to act on film. Christopher Plummer never made it as a leading man in films. Perhaps if he had been born earlier, and acted in the studio system of Hollywood's golden age, he could have been carefully groomed for stardom. As it was he shared the English stage actors' disdain -- and he was equally at home in London as he was on the boards of Broadway or on-stage in his native Canada -- for the movies, which did not help him in that medium, as he has confessed. As he aged, Plummer excelled at character parts. He was always a good villain, this man who garnered kudos playing Lucifer on Broadway in Archibald Macleish's Pulitzer Prize-winning \"J.B.\". Though he likely always be remembered as \"Captain Von Trapp\" in the atomic bomb-strength blockbuster The Sound of Music (1965) (a film he publicly despised until softening his stance in his 2008 autobiography \"In Spite of Me\"), his later film work includes such outstanding performances as the best cinema Sherlock Holmes--other than Basil Rathbone -- in Murder by Decree (1979), the chilling villain in L'argent de la banque (1978), his iconoclastic Mike Wallace in The Insider (1999), the empathetic psychiatrist in A Beautiful Mind (2001), and as Leo Tolstoy in Tolstoï, le dernier automne (2009). It was this last role that finally brought him recognition from the Academy of Motion Picture Arts & Sciences, when he was nominated as Best Actor in a supporting role. Plummer remains one of the most respected and honored actors performing in the English language. He's won two Emmy Awards out of six nominations stretching 46 years from 1959 and 2005, and one Genie Award in five nominations from 1980 to 2004. For his stage work, Plummer has racked up two Tony Awards on six nominations, the first in 1974 as Best Actor (Musical) for the title role in \"Cyrano\" and the second in 1997, as Best Actor (Play), in \"Barrymore\". Surprisingly, he did not win (though he was nominated) for his masterful 2004 performance of \"King Lear\", which he originated at the Stratford Festival in Ontario and brought down to Broadway for a sold-out run. His other Tony nominations show the wide range of his talent, from a 1959 nod for the Elia Kazan-directed production of Macleish's \"J.B.\" to recognition in 1994 for Harold Pinter's \"No Man's Land\", with a 1982 Best Actor (Play) nomination for his \"Iago\" in William Shakespeare's \"Othello\". He continues to be a very in-demand character actor in prestigious motion pictures. If he were English rather than Canadian, he'd have been knighted long ago. (In 1968, he was awarded Companion of the Order of Canada, the country's highest civilian honor and one which required the approval of the sovereign, Queen Elizabeth II.) If he lived in the company town of Los Angeles rather than in Connecticut, he likely would have several more Oscar nominations before winning his first for \"The Last Station\". As it is, as attested to in his witty and well-written autobiography, Christopher Plummer has been amply rewarded in life. In 1970, Plummer - a self-confessed 43-year-old \"bottle baby\" - married his third wife, dancer Elaine Taylor, who helped wean him off his dependency on alcohol. They live happily with their dogs on a 30-acre estate in Weston, Connecticut. Although he spends the majority of his time in the United States, he remains a Canadian citizen. His daughter, with actress Tammy Grimes, is actress Amanda Plummer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5MzQ5MDY3NF5BMl5BanBnXkFtZTcwNzMxOTU5Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001626","name":"Christopher Plummer","nicknames":["Chris"],"idIMDB":"nm0001626"},"actorId":"nm0001626","character":"Chang","urlCharacter":"http://www.imdb.com/character/ch0001453","main":true},{"actorName":"Rosanna DeSoto","urlProfile":"http://www.imdb.com/name/nm0221554","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNTE1MzU0OF5BMl5BanBnXkFtZTcwNDk4MzgwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 September 1950","placeOfBirth":" San Jose, California, USA","bio":"Rosanna DeSoto was born on September 2, 1950 in San Jose, California, USA. She is an actress, known for La Bamba (1987), Star Trek VI: The Undiscovered Country (1991) and Family Business (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQxNTE1MzU0OF5BMl5BanBnXkFtZTcwNDk4MzgwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0221554","name":"Rosanna DeSoto","idIMDB":"nm0221554"},"actorId":"nm0221554","character":"Azetbur","urlCharacter":"http://www.imdb.com/character/ch0001654","main":true}],"seasons":[],"idIMDB":"tt0102975","urlIMDB":"http://www.imdb.com/title/tt0102975","business":{"budget":{"money":"$30,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1991/\">1991</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 53 min (113 min)","1 hr 50 min (110 min) (theatrical)"],"soundMix":["70 mm 6-Track (70 mm prints)","Dolby Digital (some test prints)","Dolby Stereo (35 mm prints)"],"color":["Color (Technicolor)"],"aspectRatio":["2.20 : 1 (70 mm prints)","2.35 : 1"],"camera":["Panavision Panaflex Gold II, Panavision Primo Lenses","Panavision Panaflex Platinum, Panavision Primo Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm (also horizontal) (Eastman 125T 5247, EXR 100T 5248, EXR 500T 5296)"],"cinematographicProcess":["Super 35","VistaVision (visual effects)"],"printedFilmFormat":["35 mm (anamorphic) (Eastman 5384)","70 mm (blow-up) (Eastman 5384)"]},"rating":"7.2","metascore":"65","filmingLocations":[{"location":"Alaska, USA"}],"rated":"PG","awards":[{"award":"Academy Awards, USA 1992","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Effects, Sound Effects Editing","names":[{"name":"George Watters II","id":"nm0915036","role":null},{"name":"F. Hudson Miller","id":"nm0588326","role":null}]},{"category":"Best Makeup","names":[{"name":"Michael Mills","id":"nm0590114","role":null},{"name":"Ed French","id":"nm0294076","role":null},{"name":"Richard Snell","id":"nm0811057","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1993","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Science Fiction Film","names":[]}]},{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Supporting Actress","names":[{"name":"Kim Cattrall","id":"nm0000326","role":null}]},{"category":"Best Writing","names":[{"name":"Nicholas Meyer","id":"nm0583292","role":null},{"name":"Denny Martin Flinn","id":"nm0282364","role":null}]},{"category":"Best Costumes","names":[{"name":"Dodie Shepard","id":"nm0791614","role":null}]},{"category":"Best Make-Up","names":[{"name":"Michael Mills","id":"nm0590114","role":null},{"name":"Ed French","id":"nm0294076","role":null}]}]}]},{"award":"Hugo Awards 1992","titlesAwards":[{"titleAwardOutcome":"Nominated Hugo","categories":[{"category":"Best Dramatic Presentation","names":[{"name":"Nicholas Meyer","id":"nm0583292","role":"screenplay/director"},{"name":"Denny Martin Flinn","id":"nm0282364","role":"screenplay"},{"name":"Leonard Nimoy","id":"nm0000559","role":"story"},{"name":"Lawrence Konner","id":"nm0465199","role":"story"},{"name":"Mark Rosenthal","id":"nm0742797","role":"story"}]}]}]}],"votes":"58,042","type":"Movie","companyCreditsSimple":[{"idCompany":"co0023400","name":"Paramount Pictures"}],"keywords":{"keywords":["klingon","peace","captain","moon","explosion","conspiracy","prison","starship","female humanoid alien","cloaked starship","blood spatter","murder mystery","quotation","adolf hitler quotation","character says go to hell","phaser pistol","space war","cult film","one eyed character","female vulcan starfleet officer","sickbay","female lieutenant","humanoid alien","damaged starship","handheld phaser","darkened room","phaser blast","biobed","romulan ambassador","human vulcan man","starship battle","dilithium mine","vulcan starfleet officer","speaking klingon","eyepatch","man wearing an eyepatch","female traitor","prototype starship","exploding starship","captain's dinner","excelsior class starship","constitution class starship","starship captain","vulcan man","vulcan ambassador","mask","human disguised as an alien","starfleet admiral","english subtitles","romulan ale","alien blood","u.s.s. excelsior","reference to kobayashi maru","underground","vulcan woman","klingon woman","prototype","translator","disobeying orders","insubordination","officer's mess","magnetic boots","u.s.s. enterprise ncc 1701 a","cpr","alien creature","klingon bird of prey","kronos one","klingon battle cruiser","romulan","alien ambassador","glass table","space opera","six word title","colon in title","roman numbered sequel","roman numeral in title","cloaked ship","medical scanner","reference to william shakespeare","sniper","exploding ship","general","23rd century","photon torpedoes","phaser","english subtitles in original","star trek","based on cult tv series","penal colony","peace talks","outer space","murder","future","future war","father son relationship","environment","economics","detente","death","cameo appearance","blood","title from hamlet's soliloquy by shakespeare","wrongful conviction","false accusation","frozen body","eye patch","nosebleed","arm blown off","whodunit","purple blood","freeze to death","sixth part","space battle","title based on shakespeare","interracial kiss","stealth","prisoner","prison planet","jailbreak","assassin","assassination","assassination attempt","vulcan","lieutenant","doctor","court","arrest","shakespearean quotation","racism","betrayal","teleportation","prejudice","sequel","shape shifter","zero gravity","exoneration","peace negotiation","grudge","resistance","morphing","series finale","status quo","spacecraft","based on tv series","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:52:58"}}