{"data":{"movies":[{"title":"Twin Peaks: Fire Walk with Me","originalTitle":"","year":"1992","releaseDate":"19920828","directors":[{"name":"David Lynch","id":"nm0000186"}],"writers":[{"name":"David Lynch","id":"nm0000186"},{"name":"Robert Engels","id":"nm0257306"}],"runtime":"135 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzc5ODcyNTYtMDAwNy00MDhjLWFmOWUtNGVhMDRlYjE1YzNjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA","France"],"languages":["English"],"genres":["Drama","Fantasy","Horror","Mystery","Thriller"],"plot":"Essentially a prequel to David Lynch and Mark Frost's earlier TV series \"Twin Peaks\". The first half-hour or so concerns the investigation by FBI Agent Chet Desmond (Chris Isaak) and his partner Sam Stanley (Kiefer Sutherland) into the murder of night-shift waitress Teresa Banks in the small Washington state town of Deer Meadow. When Desmond finds a mysterious clue to the murder, he inexplicably disappears. The film then cuts to one year later in the nearby town of Twin Peaks and follows the events during the last week in the life of Laura Palmer (Sheryl Lee) a troubled teenage girl with two boyfriends; the hot-tempered rebel Bobby Briggs (Dana Ashbrook) and quiet biker James Hurley (James Marshall), her drug addiction, and her relationship with her difficult (and possible schizophrenic) father Leland (Ray Wise), a story in which her violent murder was later to motivate much of the TV series. Contains a considerable amount of sex, drugs, violence, very loud music and inexplicable ...","simplePlot":"A young FBI agent disappears while investigating a murder miles from Twin Peaks that may be related to the future murder of Laura Palmer; the last week of the life of Laura Palmer is chronicled.","actors":[{"actorName":"Sheryl Lee","urlProfile":"http://www.imdb.com/name/nm0498247","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NzYyODA2Nl5BMl5BanBnXkFtZTYwMDc3MDc2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 April 1967","placeOfBirth":" Augsburg, Bavaria, Germany","birthName":"Sheryl Lynn Lee","height":"5' 5½\" (1.66 m)","bio":"\"Dead, wrapped in plastic\" is how Sheryl Lee entered onto the scene as Laura Palmer, the doomed homecoming queen on the cult TV series Twin Peaks (1990). Lee was born April 27, 1967 in Germany. She grew up in Boulder, Colorado, spending much of her youth studying dance before knee injuries ended her hope of becoming a dancer. She began acting in school plays, graduated from Fairview High School, and attended the American Academy of Dramatic Arts in Pasadena, California. Lee also spent time at the North Carolina School of Arts, the National Conservatory Theater in Denver, and Colorado University before pursuing stage work in Seattle, Washington. Here Lee landed the role of Laura Palmer, and she later appeared on Twin Peaks (1990) as Laura's cousin Madeleine Ferguson. Madeleine was a brunette and wore glasses, but of course bore a striking resemblance to her late relative. Lee worked with Twin Peaks (1990) mastermind David Lynch again on the film Wild at Heart (1990), and resurrected Laura Palmer one last time for Lynch's Twin Peaks: Fire Walk with Me (1992). Lee has gone on to have a long and adventurous career since then. Appearances have included the Stuart Sutcliffe biopic Backbeat (1994), the John Carpenter film Vampires (1998), and the TV series L.A. Doctors (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1NzYyODA2Nl5BMl5BanBnXkFtZTYwMDc3MDc2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0498247","name":"Sheryl Lee","nicknames":["Angel Face"],"idIMDB":"nm0498247"},"actorId":"nm0498247","character":"Laura Palmer","urlCharacter":"http://www.imdb.com/character/ch0009687","main":true},{"actorName":"Ray Wise","urlProfile":"http://www.imdb.com/name/nm0936403","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNTg0NDU5NF5BMl5BanBnXkFtZTcwNDQ5NTk3MQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 August 1947","placeOfBirth":" Akron, Ohio, USA","birthName":"Raymond Herbert Wise","height":"5' 9½\" (1.77 m)","bio":"Raymond Herbert \"Ray\" Wise (born August 20, 1947) is an American actor. Some of his best-known roles include Leland Palmer in Twin Peaks (1990), henchman Leon C. Nash in RoboCop (1987), Jack Taggart Sr. in Jeepers Creepers II (2003), the Devil in the CW television series Reaper (2007), Donald Wadsworth in Suburban Gothic (2014). Wise was born in Akron, Ohio, graduated from Garfield High School in 1964 and attended Kent State University in Kent, Ohio. He is of Romanian descent on his mother's side.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzNTg0NDU5NF5BMl5BanBnXkFtZTcwNDQ5NTk3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0936403","name":"Ray Wise","idIMDB":"nm0936403"},"actorId":"nm0936403","character":"Leland Palmer","urlCharacter":"http://www.imdb.com/character/ch0009690","main":true},{"actorName":"Mädchen Amick","urlProfile":"http://www.imdb.com/name/nm0000749","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI2MTA1NTkxOF5BMl5BanBnXkFtZTgwMTAxNzIzNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1970","placeOfBirth":" Sparks, Nevada, USA","birthName":"Mädchen E. Amick","height":"5' 6\" (1.68 m)","bio":"Born and raised in Sparks, Nevada, Madchen Amick was encouraged by her parents to follow her own creative instincts where she learned the skill of playing the piano, bass, violin and guitar as well as being able to do tap, ballet, jazz and modern dancing. In 1987 at the age of 16, she traveled to Los Angeles to pursue a career in acting","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzI2MTA1NTkxOF5BMl5BanBnXkFtZTgwMTAxNzIzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000749","name":"Mädchen Amick","idIMDB":"nm0000749"},"actorId":"nm0000749","character":"Shelly Johnson","urlCharacter":"http://www.imdb.com/character/ch0009685","main":true},{"actorName":"Dana Ashbrook","urlProfile":"http://www.imdb.com/name/nm0000796","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MjEwNTA0OV5BMl5BanBnXkFtZTgwMzYxMDg4MzE@._V1_UY44_CR23,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 May 1967","placeOfBirth":" San Diego, California, USA","birthName":"Dana V. Ashbrook","height":"6' (1.83 m)","bio":"Growing up in San Diego, becoming an actor came naturally to Dana Ashbrook. His father is the director of the Palomar College Department of Performing Arts, and his mother is a teacher who performs in local theater. His sisters, Daphne Ashbrook and Taylor Ashbrook, are also working actresses. His own career started while still in his teens, when his sister Daphne's agent saw him performing in a high school play, and he made a good impression. He started out with guest appearances in TV series, and then went on to supporting roles in motion pictures. His big break was in 1990 in winning the role of Bobby Briggs in the offbeat television series Twin Peaks (1990). Ashbrook's intense portrayal of the volatile tempered high school athlete with his shaggy hair, soulful appearance, and intense personality made an impression. After the show went off the air the following year, he continued to make appearances in television and film. In 1997, he won a starring role in the series Crisis Center (1997), but in spite of its promise, the series only lasted one season. Ashbrook made a comeback in 2002 when he was cast in a recurring role playing the slimy and greedy stockbroker Rich Rinaldi, a character the viewers loved to hate, in the popular teen soap opera Dawson's Creek (1998) during the show's final season. In his spare time, he plays basketball and tennis. He is also an accomplished harmonica player.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MjEwNTA0OV5BMl5BanBnXkFtZTgwMzYxMDg4MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000796","name":"Dana Ashbrook","idIMDB":"nm0000796"},"actorId":"nm0000796","character":"Bobby Briggs","urlCharacter":"http://www.imdb.com/character/ch0009699","main":true},{"actorName":"Phoebe Augustine","urlProfile":"http://www.imdb.com/name/nm0041935","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NjE3NTgyN15BMl5BanBnXkFtZTgwNzUyNDk0MDE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"bio":"Phoebe Augustine is an actress, known for Twin Peaks: Fire Walk with Me (1992), The Elvira Show (1993) and Black Widow Murders: The Blanche Taylor Moore Story (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2NjE3NTgyN15BMl5BanBnXkFtZTgwNzUyNDk0MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0041935","name":"Phoebe Augustine","idIMDB":"nm0041935"},"actorId":"nm0041935","character":"Ronette Pulaski","urlCharacter":"http://www.imdb.com/character/ch0032272","main":true},{"actorName":"David Bowie","urlProfile":"http://www.imdb.com/name/nm0000309","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTE3MTYzOF5BMl5BanBnXkFtZTcwNDM4OTcyMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 January 1947","placeOfBirth":" Brixton, London, England, UK","birthName":"David Robert Haywood Jones","height":"5' 10\" (1.78 m)","bio":"David Bowie is widely regarded as one of the most influential writers of pop music. Born David Jones, he changed his name to Bowie in the 1960s, to avoid confusion with the then well-known Davy Jones (lead singer of The Monkees). The 1960s were not a happy period for Bowie, who remained a struggling artist, awaiting his breakthrough. He dabbled in many different styles of music (without commercial success), and other art forms such as acting, mime, painting, and playwriting. He finally achieved his commercial breakthrough in 1969 with the song \"Space Oddity,\" which was released at the time of the moon landing. Despite the fact that the literal meaning of the lyrics relates to an astronaut who is lost in space, this song was used by the BBC in their coverage of the moon landing, and this helped it become such a success. The album, which followed \"Space Oddity,\" and the two, which followed (one of which included the song \"The Man Who Sold The World,\" covered by Lulu and Nirvana) failed to produce another hit single, and Bowie's career appeared to be in decline. However, he made the first of many successful \"comebacks\" in 1972 with \"Ziggy Stardust,\" a concept album about a space-age rock star. This album was followed by others in a similar vein, rock albums built around a central character and concerned with futuristic themes of Armageddon, gender dysfunction/confusion, as well as more contemporary themes such as the destructiveness of success and fame, and the dangers inherent in star worship. In the mid 1970s, Bowie was a heavy cocaine abuser and sometime heroin user. In 1975, he changed tack. Musically, he released \"Young Americans,\" a soul (or plastic soul as he later referred to it) album. This produced his first number one hit in the US, \"Fame.\" He also appeared in his first major film, The Man Who Fell to Earth (1976). With his different-colored eyes and skeletal frame, he certainly looked the part of an alien. The following year, he released \"Station to Station,\" containing some of the material he had written for the soundtrack to this film (which was not used). As his drug problem heightened, his behavior became more erratic. Reports of his insanity started to appear, and he continued to waste away physically. He fled back to Europe, finally settling in Berlin, where he changed musical direction again and recorded three of the most influential albums of all time, an electronic trilogy with Brian Eno \"Low, Heroes and Lodger.\" Towards the end of the 1970s, he finally kicked his drug habit, and recorded the album many of his fans consider his best, the Japanese-influenced \"Scary Monsters.\" Around this time, he played the Elephant Man on Broadway, to considerable acclaim. The next few years saw something of a drop-off in his musical output as his acting career flourished, culminating in his acclaimed performance in Merry Christmas Mr. Lawrence (1983). In 1983, he recorded \"Let's Dance,\" an album which proved an unexpected massive commercial success, and produced his second number 1 hit single in the US. The tour which followed, \"Serious Moonlight,\" was his most successful ever. Faced with this success on a massive scale, Bowie apparently attempted to \"repeat the formula\" in the next two albums, with less success (and to critical scorn). Finally, in the late 1980s, he turned his back on commercial success and his solo career, forming the hard rock band, Tin Machine, who had a deliberate limited appeal. By now, his acting career was in decline. After the comparative failure of Labyrinth (1986), the movie industry appears to have decided that Bowie was not a sufficient name to be a lead actor in a major movie, and since that date, most of his roles have been cameos or glorified cameos. He himself also seems to have lost interest in movie acting. Tin Machine toured extensively and released two albums, with little critical or commercial success. In 1992, Bowie again changed direction and re-launched his solo career with \"Black Tie White Noise,\" a \"wedding\" album inspired by his recent marriage to Iman. He released three albums to considerable critical acclaim and reasonable commercial success. In 1995, he renewed his working relationship with Brian Eno to record \"Outside.\" After an initial hostile reaction from the critics, this album has now taken its place with his classic albums. In 2003, Bowie released an album entitled 'Reality.' The Reality Tour began in November 2003 and, after great commercial success, was extended into July 2004. In June 2004, Bowie suffered a heart attack and the tour did not finish it's scheduled run. After recovering, Bowie did not release any new music, but did a little acting. In 2006, he played Tesla in The Prestige (2006) and had a small cameo in the series Extras (2005). In 2007, he did a cartoon voice in SpongeBob SquarePants (1999) playing Lord Royal Highness. He has not appeared in anything since 2008; however, after a ten year hiatus from recording, he released a new album called 'The Next Day.' Bowie has influenced the course of popular music several times and influenced several generations of musicians. His promotional videos in the 1970s and 80s are regarded as ground-breaking, and as a live concert act, he is regarded as the most theatrical of them all.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ4NTE3MTYzOF5BMl5BanBnXkFtZTcwNDM4OTcyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000309","name":"David Bowie","nicknames":["The Thin White Duke","Ziggy Stardust","The Picasso of Pop","The Dame","The Master of Reinvention","The Chameleon of Rock","Aladdin Sane","Major Tom","The Starman"],"idIMDB":"nm0000309"},"actorId":"nm0000309","character":"Phillip Jeffries","urlCharacter":"http://www.imdb.com/character/ch0032273","main":true},{"actorName":"Eric DaRe","urlProfile":"http://www.imdb.com/name/nm0201121","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ0MjE1NzAwOV5BMl5BanBnXkFtZTcwOTAyMTYxOA@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1965","placeOfBirth":" Los Angeles, California, USA","height":"6' 1\" (1.85 m)","bio":"Eric DaRe was born on March 3, 1965 in Los Angeles, California, USA. He is known for his work on Twin Peaks: Fire Walk with Me (1992), Starship Troopers (1997) and Twin Peaks (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzQ0MjE1NzAwOV5BMl5BanBnXkFtZTcwOTAyMTYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0201121","name":"Eric DaRe","idIMDB":"nm0201121"},"actorId":"nm0201121","character":"Leo Johnson","urlCharacter":"http://www.imdb.com/character/ch0009710","main":true},{"actorName":"Miguel Ferrer","urlProfile":"http://www.imdb.com/name/nm0001208","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MTYxNDE2MV5BMl5BanBnXkFtZTYwMTY0MTU3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 February 1955","placeOfBirth":" Santa Monica, California, USA","birthName":"Miguel José Ferrer","height":"6' (1.83 m)","bio":"Miguel Ferrer was born on February 7, 1955 in Santa Monica, California, USA as Miguel José Ferrer. He was an actor and director, known for Crossing Jordan (2001), Iron Man 3 (2013) and RoboCop (1987). He was married to Lori Weintraub and Leilani Sarelle. He died on January 19, 2017 in Los Angeles, California.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3MTYxNDE2MV5BMl5BanBnXkFtZTYwMTY0MTU3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001208","name":"Miguel Ferrer","idIMDB":"nm0001208"},"actorId":"nm0001208","character":"Albert Rosenfeld","urlCharacter":"http://www.imdb.com/character/ch0009683","main":true},{"actorName":"Pamela Gidley","urlProfile":"http://www.imdb.com/name/nm0317293","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNzQ0NjI5MF5BMl5BanBnXkFtZTcwODU2NDkzMQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 June 1965","placeOfBirth":" Methuen, Massachusetts, USA","birthName":"Pamela Catherine Gidley","height":"5' 7\" (1.7 m)","bio":"Born in Methuen, Massachusetts and raised in Nashua, New Hampshire, Pamela was the only girl among four older brothers. After high school, she moved to New York and was discovered by a modeling agent while walking down a Manhattan street and soon afterwards, she won the Wilhemina Modeling Agency's \"Most Beautiful Girl In The World\" contest on March 12, 1985 in Sydney, Australia. As her modeling career took off, she studied acting at the New York Academy of Dramatic Arts under Stella Adler and eventually moved to Los Angeles to pursue an acting career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcxNzQ0NjI5MF5BMl5BanBnXkFtZTcwODU2NDkzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0317293","name":"Pamela Gidley","idIMDB":"nm0317293"},"actorId":"nm0317293","character":"Teresa Banks","urlCharacter":"http://www.imdb.com/character/ch0032274","main":true},{"actorName":"Heather Graham","urlProfile":"http://www.imdb.com/name/nm0001287","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzk5MTM4NV5BMl5BanBnXkFtZTcwNTMxOTkwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 January 1970","placeOfBirth":" Milwaukee, Wisconsin, USA","birthName":"Heather Joan Graham","height":"5' 8\" (1.73 m)","bio":"Heather Joan Graham was born in Milwaukee, Wisconsin, to Joan (Bransfield), a schoolteacher and children's book author, and James Graham, an FBI agent. She and her sister, actress Aimee Graham, were raised by their strictly Catholic parents. They relocated often, as a result of their father's occupation, and Heather became increasingly shy. Surprisingly, she had a passion for acting from an early age and despite being labeled a 'theater geek' by her peers, she was voted Most Talented by her high school senior class. Unfortunately, her love of acting created a tension between Heather and her family although her mother obligingly drove her to auditions in Hollywood throughout her adolescence. After high school Heather moved to Los Angeles and received small roles in a variety of films including Drugstore Cowboy (1989). When her career did not take off as quickly as was hoped, Heather enrolled in the University of California at Los Angeles to get her degree in drama. It was at UCLA that she was noticed by actor James Woods and received a subsequent part in a film Woods starred in, Diggstown (1992). Heather dropped out of UCLA after two years to pursue her acting career on a full time basis. Aside from gaining a modeling contract with Emanuel Ungaro Liberte, Heather has risen to star in such films as Swingers (1996), a role she received after being taken out swing dancing by Jon Favreau, to blockbusters like Austin Powers: The Spy Who Shagged Me (1999), and Boogie Nights (1997).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwMzk5MTM4NV5BMl5BanBnXkFtZTcwNTMxOTkwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001287","name":"Heather Graham","idIMDB":"nm0001287"},"actorId":"nm0001287","character":"Annie Blackburn","urlCharacter":"http://www.imdb.com/character/ch0009678","main":true},{"actorName":"Chris Isaak","urlProfile":"http://www.imdb.com/name/nm0001389","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3OTM2ODE2M15BMl5BanBnXkFtZTYwNjc4NDYz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1956","placeOfBirth":" Stockton, California, USA","birthName":"Christopher Joseph Isaak","height":"6' 1\" (1.85 m)","bio":"Chris Isaak was born on June 26, 1956 in Stockton, California, USA as Christopher Joseph Isaak.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3OTM2ODE2M15BMl5BanBnXkFtZTYwNjc4NDYz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001389","name":"Chris Isaak","idIMDB":"nm0001389"},"actorId":"nm0001389","character":"Special Agent Chester Desmond","urlCharacter":"http://www.imdb.com/character/ch0032275","main":true},{"actorName":"Moira Kelly","urlProfile":"http://www.imdb.com/name/nm0446702","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDIyNjQwNDg4N15BMl5BanBnXkFtZTcwNzEyMDg4Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 March 1968","placeOfBirth":" Queens, New York City, New York, USA","birthName":"Moira Anne Kelly","height":"5' 4\" (1.63 m)","bio":"Born March 6, 1968 in Queens, New York, she is the third of six kids. Her father, Peter, was trained as a concert violinist. Her mother, Anne, is a nurse. Both are Irish immigrants. Moira was raised in Ronkonkoma, NY. She attended Connetquot Senior High School and graduated in the class of 1986. Later Moira attended Marymount Manhattan College. In 1984 Moira was cast in a small role in Connetquot Senior High School's production of Annie. Due to illness, the young woman playing Miss Hannigan was replaced, causing a series of cast changes. Director Eric Martinsen chose to recast Moira as Grace Farrell. She was a great success, and so began her career.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDIyNjQwNDg4N15BMl5BanBnXkFtZTcwNzEyMDg4Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0446702","name":"Moira Kelly","idIMDB":"nm0446702"},"actorId":"nm0446702","character":"Donna Hayward","urlCharacter":"http://www.imdb.com/character/ch0009680","main":true},{"actorName":"Peggy Lipton","urlProfile":"http://www.imdb.com/name/nm0005152","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MTYwMTk3NF5BMl5BanBnXkFtZTYwNjU4MzMz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 August 1946","placeOfBirth":" New York City, New York, USA","birthName":"Margaret Ann Lipton","height":"5' 6\" (1.68 m)","bio":"Peggy Lipton was born on August 30, 1946 in New York City, New York, USA as Margaret Ann Lipton. She is an actress, known for Mod Squad (1968), The Postman (1997) and A Dog's Purpose (2017). She was previously married to Quincy Jones.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MTYwMTk3NF5BMl5BanBnXkFtZTYwNjU4MzMz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005152","name":"Peggy Lipton","idIMDB":"nm0005152"},"actorId":"nm0005152","character":"Norma Jennings","urlCharacter":"http://www.imdb.com/character/ch0009689","main":true},{"actorName":"David Lynch","urlProfile":"http://www.imdb.com/name/nm0000186","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MTY2MTY2Nl5BMl5BanBnXkFtZTcwMDg1ODYwNA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 January 1946","placeOfBirth":" Missoula, Montana, USA","birthName":"David Keith Lynch","height":"5' 10\" (1.78 m)","bio":"Born in precisely the kind of small-town American setting so familiar from his films, David Lynch spent his childhood being shunted from one state to another as his research scientist father kept getting relocated. He attended various art schools, married Peggy Lynch and then fathered future director Jennifer Lynch shortly after he turned 21. That experience, plus attending art school in a particularly violent and run-down area of Philadelphia, inspired Eraserhead (1977), a film that he began in the early 1970s (after a couple of shorts) and which he would work on obsessively for five years. The final film was initially judged to be almost unreleasable weird, but thanks to the efforts of distributor Ben Barenholtz, it secured a cult following and enabled Lynch to make his first mainstream film (in an unlikely alliance with Mel Brooks), though The Elephant Man (1980) was shot through with his unique sensibility. Its enormous critical and commercial success led to Dune (1984), a hugely expensive commercial disaster, but Lynch redeemed himself with the now classic Blue Velvet (1986), his most personal and original work since his debut. He subsequently won the top prize at the Cannes Film Festival with the dark, violent road movie Wild at Heart (1990), and achieved a huge cult following with his surreal TV series Twin Peaks (1990), which he adapted for the big screen, though his comedy series On the Air (1992) was less successful. He also draws comic strips and has devised multimedia stage events with regular composer Angelo Badalamenti. He had a much-publicized affair with Isabella Rossellini in the late 1980s.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1MTY2MTY2Nl5BMl5BanBnXkFtZTcwMDg1ODYwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000186","name":"David Lynch","idIMDB":"nm0000186"},"actorId":"nm0000186","character":"Gordon Cole","urlCharacter":"http://www.imdb.com/character/ch0009679","main":true},{"actorName":"James Marshall","urlProfile":"http://www.imdb.com/name/nm0338614","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NDE2NTQzN15BMl5BanBnXkFtZTcwMjQ3NDgwMw@@._V1_UY44_CR5,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 January 1967","placeOfBirth":" Queens, New York City, New York, USA","birthName":"James David Greenblatt","height":"5' 8\" (1.73 m)","bio":"James Marshall was born James David Greenblatt in Queens, New York, USA, to Charlotte (Bullard), a dancer, and William R. Greenblatt, a producer and director. His father is of Ashkenazi Jewish descent and his mother has English and Irish ancestry. James grew up in Bergen County New Jersey. At the age of fifteen he moved with his family to the Los Angeles area where he attended Santa Monica High School. Once high school was over, James attended acting classes and struggled to break into Hollywood. His father offered to help James, but he didn't want to take the nepotism route. Coming from a family of entertainers (his mother a former radio city music hall Rockette and his sister a musician) he had Hollywood in site. Accepting small acting parts, working as a messenger, as well as at a pizzeria, James felt the pressures of the business. James made a big splash when director David Lynch cast Marshall for his new series entitled Twin Peaks. Playing the moody, biker boyfriend of Laura Palmer thrust James Marshall into the living rooms of millions and introduced the new actor to a captivated audience. By early 1990 his career took a turn onto the silver screen with an appearance in the movie Cadence, starring Martin Sheen and Charlie Sheen. This lead to his first starring role with a major movie studio. The movie was the 1992 boxing drama, Gladiator. Three months of rigorous training was put into the role before even getting to the set. The buzz on Marshall was so great that director Rob Reiner cast James and co-star Cuba Gooding Jr. in his upcoming film A Few Good Men. The movie was an excellent springboard towards a busy acting career. James has continued working steadily in television movies and features. In May of 1998 James married actress Renee Allman. They have appeared together in the features Criminal Affairs and Doomsday Man. Together they have one child, James David, who was born in January of 2002. The happy family live together in the Los Angeles area. James continues to work on a host a television movies and film projects. In addition James is an accomplished author, artist and musician.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA3NDE2NTQzN15BMl5BanBnXkFtZTcwMjQ3NDgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0338614","name":"James Marshall","idIMDB":"nm0338614"},"actorId":"nm0338614","character":"James Hurley","urlCharacter":"http://www.imdb.com/character/ch0009698","main":true}],"seasons":[],"idIMDB":"tt0105665","urlIMDB":"http://www.imdb.com/title/tt0105665","business":{"budget":{"money":"$10,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$1,813,559","country":"USA","day":"28","month":"08","year":"1992","remarks":"691 Screens"}],"gross":[{"money":"AUD","country":"187,253","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1991/\">1991</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["2 hr 15 min (135 min)"],"soundMix":["Dolby","DTS (DVD version)","Dolby Digital (DVD version)"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Panaflex Platinum, Panavision Primo Lenses"],"laboratory":["Consolidated Film Industries (CFI), Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm (Fuji F-64T 8510, F-64D 8520, F-250T 8550, F-250D 8560, F-500T 8570)"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.2","metascore":"28","filmingLocations":[{"location":"534 Lewis Street, Monroe, Washington, USA"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1993","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Music","names":[{"name":"Angelo Badalamenti","id":"nm0000823","role":null}]}]},{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Horror Film","names":[]},{"category":"Best Actress","names":[{"name":"Sheryl Lee","id":"nm0498247","role":null}]},{"category":"Best Supporting Actor","names":[{"name":"Ray Wise","id":"nm0936403","role":null}]},{"category":"Best Writing","names":[{"name":"David Lynch","id":"nm0000186","role":null},{"name":"Robert Engels","id":"nm0257306","role":null}]}]}]},{"award":"Brit Awards 1991","titlesAwards":[{"titleAwardOutcome":"Won Brit","categories":[{"category":"Best Soundtrack","names":[]}]}]},{"award":"Cannes Film Festival 1992","titlesAwards":[{"titleAwardOutcome":"Nominated Palme d'Or","categories":[{"category":"","names":[{"name":"David Lynch","id":"nm0000186","role":null}]}]}]},{"award":"Film Independent Spirit Awards 1993","titlesAwards":[{"titleAwardOutcome":"Won Independent Spirit Award","categories":[{"category":"Best Original Score","names":[{"name":"Angelo Badalamenti","id":"nm0000823","role":null}]}]},{"titleAwardOutcome":"Nominated Independent Spirit Award","categories":[{"category":"Best Female Lead","names":[{"name":"Sheryl Lee","id":"nm0498247","role":null}]}]}]}],"votes":"59,592","type":"Movie","companyCreditsSimple":[{"idCompany":"co0046718","name":"New Line Cinema"},{"idCompany":"co0008195","name":"CiBy 2000"},{"idCompany":"co0064691","name":"Twin Peaks Productions"}],"keywords":{"keywords":["female stockinged legs","pantyhose","surrealism","incest","murder","fbi agent","fbi","violence","sex","teenage girl","investigation","prequel","female frontal nudity","breasts","rape of a minor","psychotronic","year 1989","year 1988","1980s","returning character with different actor","moon","traffic light","night","mynah bird","fire","woman putting on makeup","looking at self in mirror","crying","telephone","bed","female bare legs","female stockinged soles","female bare feet","foot closeup","camera shot of feet","personality change","cult female character","reference to j. edgar hoover","mental instability","writer director","produced by director","supernatural power","crime scene","brutality","tragic female character","double","cult male character","strong female character","nonlinear timeline","erratic behavior","woman in jeopardy","violent death","talking backwards","taking control of someone's body","suffering","screaming","sadness","rough sex","prostitution","one armed man","mysterious forest","mysterious events","mysterious death","murder investigation","log lady","jealous boyfriend","inner demon","high school friend","friendship between girls","female in lingerie","female friendship","evil spirit","dual personality","despair","dark","darkness","blonde","agoraphobia","boyfriend girlfriend relationship","prequel to cult favorite","cigarette smoking","blue light","red room","schizophrenia","dysfunctional family","abandoned train","split personality","multiple personality","strong sexual content","gore","experimental film","avant garde","redemption","seduction","doppelganger","enigma","philadelphia pennsylvania","high school student","psychopath","hallucination","double life","deliberate cruelty","prostitute","police","missing person","mental illness","investigator","friendship","drug dealer","deception","craze","corruption","sexual abuse","road rage","obscene finger gesture","mother daughter relationship","lesbian subtext","implied cunnilingus","filicide","female nudity","father daughter relationship","cocaine","blood","unintelligible dialogue with subtitles","white horse","vision","singer acting","possession","monkey","high school","fingernail","dwarf","dream","diary","death","dead girl","corpse","canada","angel","waitress uniform","television smashing","based on cult tv series","washington state","cult movie cast","cult film","secret","serial killer","rape","pacific northwest","small town","deja vu","club","red curtain","salvation","based on tv series","independent film","actor shares first name with character"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:40:49"}}