{"data":{"movies":[{"title":"The Batman Superman Movie: World's Finest","originalTitle":"","year":"1997","releaseDate":"19971004","directors":[{"name":"Toshihiko Masuda","id":"nm0557926"}],"writers":[{"name":"Alan Burnett","id":"nm0122334"},{"name":"Paul Dini","id":"nm0227704"}],"runtime":"64 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTgwOTU0MDUwMV5BMl5BanBnXkFtZTcwMzYyMTYxMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Animation","Action","Adventure","Family","Fantasy","Sci-Fi"],"plot":"Joker, short on money for his criminal endeavors, strikes a deal with Lex Luthor to kill Superman. Batman tracks Joker to Metropolis and alerts Superman to the Joker's plan. After initial distrust of each other, the World's Finest team up to thwart the villains by night. By day, Bruce Wayne and Clark Kent clash over the attention of Lois Lane.","simplePlot":"Joker goes to Metropolis with an offer and plan to kill Superman for Lex Luthor while Batman pursues the clown to Superman's turf.","actors":[{"actorName":"Tim Daly","urlProfile":"http://www.imdb.com/name/nm0004857","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTY4NDUwOF5BMl5BanBnXkFtZTgwMTcyMTQ4MTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 March 1956","placeOfBirth":" New York City, New York, USA","birthName":"James Timothy Daly","height":"6' (1.83 m)","bio":"Tim Daly was born on March 1, 1956 in New York City, New York, USA as James Timothy Daly. He is an actor and producer, known for Wings (1990), Private Practice (2007) and Superman (1996). He was previously married to Amy Van Nostrand.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU4NTY4NDUwOF5BMl5BanBnXkFtZTgwMTcyMTQ4MTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004857","name":"Tim Daly","idIMDB":"nm0004857"},"actorId":"nm0004857","character":"Clark Kent / Superman","urlCharacter":"http://www.imdb.com/character/ch0118677","main":true},{"actorName":"Dana Delany","urlProfile":"http://www.imdb.com/name/nm0001127","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNjQ2ODk0OF5BMl5BanBnXkFtZTcwNTc3MDI2Mg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 March 1956","placeOfBirth":" New York City, New York, USA","birthName":"Dana Welles Delany","height":"5' 6\" (1.68 m)","bio":"Dana Welles Delany was born on March 13, 1956, in New York City and raised in Stamford, Connecticut. Dana knew early in life that she wanted to be an actress. Following graduation from Wesleyan University, this tall (5'7\") beauty moved to New York and developed her skills working in daytime television and theater. Dana starred in the Broadway show \"A Life\" and received critical acclaim in a number of off-Broadway productions as well. Her role in Nicholas Kazan's controversial \"Bloodmoon\" in New York led her to Hollywood. Dana acted in a number of TV series, working steadily until she could get her own starring vehicle. That happened in 1988 when Dana became identified with Army nurse Colleen McMurphy in ABC TV's critically acclaimed series China Beach (1988), the role earning her three Emmy nominations and two Emmy Awards as Best Actress. Dana moved on to movies and eventually started getting starring roles in films, such as Exit to Eden (1994). With over a dozen TV and movie projects within the last few years, Dana is one of the busiest actresses in Hollywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMzNjQ2ODk0OF5BMl5BanBnXkFtZTcwNTc3MDI2Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001127","name":"Dana Delany","idIMDB":"nm0001127"},"actorId":"nm0001127","character":"Lois Lane","urlCharacter":"http://www.imdb.com/character/ch0000198","main":true},{"actorName":"Kevin Conroy","urlProfile":"http://www.imdb.com/name/nm0175834","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MDcwMTU2NF5BMl5BanBnXkFtZTcwMzMyMjg0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1955","placeOfBirth":" Westbury, New York, USA","height":"6' 2\" (1.88 m)","bio":"Kevin Conroy was born on November 30, 1955 in Westbury, New York. At age 17, Kevin earned a full scholarship to attend Juilliard's drama division, where he studied under actor John Houseman. In 1978, after graduating from Juilliard, he toured with \"The Acting Company\", Houseman's acting group, and in 1979, he went on the national tour of \"Deathtrap\". In 1980, he was cast in the daytime soap opera Another World (1964). However, he soon missed the theatre, and so he became associated with the Old Globe Theatre in San Diego, California, where he performed in \"Hamlet\" and \"A Midsummer Night's Dream\". From 1980 to 1985, he acted in a variety of contemporary and classic theatre pieces, including the Broadway production of \"Eastern Standard\" and \"Lolita\". He is very respected in theatre circles for his interpretation of Shakespearean characters, and in 1984, he played the title role in \"Hamlet\" in the New York Shakespeare Festival. Kevin returned to television in the television movie Covenant (1985). He was a series regular on Ohara (1987) in 1987, and on Tour of Duty (1987) from 1987 to 1988, before starring in a series of television movies. He is best known for providing the title role in the animated Batman: The Animated Series (1992) series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4MDcwMTU2NF5BMl5BanBnXkFtZTcwMzMyMjg0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0175834","name":"Kevin Conroy","idIMDB":"nm0175834"},"actorId":"nm0175834","character":"Bruce Wayne / Batman","urlCharacter":"http://www.imdb.com/character/ch0188699","main":true},{"actorName":"Mark Hamill","urlProfile":"http://www.imdb.com/name/nm0000434","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Njc5ODc4OV5BMl5BanBnXkFtZTYwNjY5MTU0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1951","placeOfBirth":" Oakland, California, USA","birthName":"Mark Richard Hamill","height":"5' 9\" (1.75 m)","bio":"Mark Hamill is best known for his portrayal of Luke Skywalker in the original Star Wars trilogy - Star Wars: Episode IV - A New Hope (1977), Star Wars: Episode V - The Empire Strikes Back (1980), and Star Wars: Episode VI - Return of the Jedi (1983) - a role he reprise in Star Wars: The Force Awakens (2015). Hamill also starred and co-starred in the films Corvette Summer (1978), The Big Red One (1980), and Kingsman: The Secret Service (2014). Hamill's extensive voice acting work includes a long-standing role as the Joker, commencing with Batman: The Animated Series (1992). Mark Richard Hamill was born in Oakland, California, to Virginia Suzanne (Johnson) and William Thomas Hamill, a captain in the United States Navy. He majored in drama at Los Angeles City College and made his acting debut on The Bill Cosby Show (1969). He played a recurring role (Kent Murray) on the soap opera General Hospital (1963) and co-starred on the comedy series The Texas Wheelers (1974). Robert Englund auditioned for a role in Apocalypse Now (1979) when he walked across the hall where auditions were taking place for George Lucas's Star Wars saga. After watching the auditions for a while, he realized that Hamill, his friend, would be perfect for the role of Luke Skywalker. He suggested to Hamill that he audition for the role; Hamill did, and won the role. Released on May 25, 1977, Star Wars: Episode IV - A New Hope (1977) was an enormous unexpected success and made a huge impact on the film industry. Hamill also appeared in The Star Wars Holiday Special (1978) and later starred in the successful sequels Star Wars: Episode V - The Empire Strikes Back (1980), and Star Wars: Episode VI - Return of the Jedi (1983). For both of the sequels, Hamill was honored with the Saturn Award for Best Actor given by the Academy of Science Fiction, Fantasy and Horror Films. He reprise the role of Luke Skywalker for the radio dramatizations of both \"Star Wars\" (1981) and \"The Empire Strikes Back\" (1983). For the radio dramatization of \"Return of the Jedi\" (1996), the role was played by a different actor. With the acquisition of Lucasfilm by the Walt Disney Company, this was announced that there will be more Star Wars films starting with Star Wars: The Force Awakens (2015), which was released on December 18, 2015. Hamill appeared in Star Wars: The Force Awakens (2015) and will continue to star in the current trilogy, alongside fellow Star Wars actors Harrison Ford and Carrie Fisher, reprising their roles as Luke Skywalker, Han Solo and Princess Leia Organa, respectively.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Njc5ODc4OV5BMl5BanBnXkFtZTYwNjY5MTU0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000434","name":"Mark Hamill","idIMDB":"nm0000434"},"actorId":"nm0000434","character":"The Joker","urlCharacter":"http://www.imdb.com/character/ch0000180","main":true},{"actorName":"Clancy Brown","urlProfile":"http://www.imdb.com/name/nm0000317","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxODY3NjAzMF5BMl5BanBnXkFtZTcwMTQ5MjYwNg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1959","placeOfBirth":" Urbana, Ohio, USA","birthName":"Clarence J. Brown III","height":"6' 2½\" (1.89 m)","bio":"A tall, wavy-haired US actor with a deep, resonant voice, Clancy Brown has proved himself a versatile performer with first-class contributions to theater, feature films, television series and even animation. Clarence J. Brown III was born in 1959 in Urbana, Ohio, to Joyce Helen (Eldridge), a concert pianist, conductor, and composer, and Republican congressman Clarence J. \"Bud\" Brown, Jr., who helped manage the Brown Publishing Company, the family-owned newspaper started by Clancy's grandfather, Congressman Clarence J. Brown. Clancy spent much of his youth in close proximity to Washington, D.C. He plied his dramatic talents in the Chicago theater scene before moving onto feature film with a sinister debut performance bullying Sean Penn inside a youth reformatory in Bad Boys (1983). He portrayed Viktor the Monster in the unusual spin on the classic Frankenstein story in The Bride (1985), before scoring one of his best roles to date as the evil Kurgan hunting fellow immortals Christopher Lambert and Sean Connery across four centuries of time in Highlander (1986). Brown played a corrupt American soldier in the Walter Hill-directed hyper-violent action film Extreme Prejudice (1987), another deranged killer in Shoot to Kill (1988) and a brutal prison guard, who eventually somewhat \"befriends\" wrongfully convicted banker Tim Robbins, in the moving The Shawshank Redemption (1994). His superb vocal talents were in demand, and he contributed voices to animated series, including Mortal Kombat: Defenders of the Realm (1995), Street Sharks (1994), Gargoyles (1994) and Superman (1996). Brown then landed two more plum roles, one as a \"tough-as-nails\" drill sergeant in the science fiction thriller Starship Troopers (1997), and the other alongside Robin Williams in the Disney comedy Flubber (1997). The video gaming industry took notice of Clancy's vocal abilities, too, and he has contributed voices to several top selling video games, including Crash Bandicoot: The Wrath of Cortex (2001), Lands of Lore III (1999), Star Wars: Bounty Hunter (2002) and Crash Nitro Kart (2003). His voice is also the character of cranky crustacean Mr. Eugene H. Krabs in the highly successful SpongeBob SquarePants (1999) animated series and films, and he contributed voices to The Batman (2004), Jackie Chan Adventures (2000) and Justice League (2001) animated series. A popular and friendly personality, Clancy Brown continues to remain busy both through his vocal and acting talents in Hollywood.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUxODY3NjAzMF5BMl5BanBnXkFtZTcwMTQ5MjYwNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000317","name":"Clancy Brown","idIMDB":"nm0000317"},"actorId":"nm0000317","character":"Lex Luthor","urlCharacter":"http://www.imdb.com/character/ch0000195","main":true},{"actorName":"Arleen Sorkin","urlProfile":"http://www.imdb.com/name/nm0815071","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODgwMzQ0NF5BMl5BanBnXkFtZTYwMTM4NzIz._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 October 1955","placeOfBirth":" Washington, District of Columbia, USA","height":"5' 6\" (1.68 m)","bio":"Arleen Sorkin was born on October 14, 1955 in Washington, District of Columbia, USA. She is an actress and writer, known for Batman: Arkham Asylum (2009), Batman Beyond: Return of the Joker (2000) and Batman: Mask of the Phantasm (1993). She has been married to Christopher Lloyd since 1995. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4ODgwMzQ0NF5BMl5BanBnXkFtZTYwMTM4NzIz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0815071","name":"Arleen Sorkin","idIMDB":"nm0815071"},"actorId":"nm0815071","character":"Dr. Harleen Quinzel / Harley Quinn","urlCharacter":"http://www.imdb.com/character/ch0543659","main":true},{"actorName":"Lisa Edelstein","urlProfile":"http://www.imdb.com/name/nm0249046","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MDQyOTY2NV5BMl5BanBnXkFtZTcwMjU1MTMxMw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 May 1966","placeOfBirth":" Boston, Massachusetts, USA","height":"5' 6\" (1.68 m)","bio":"Lisa Edelstein began her professional acting career while studying theater at N.Y.U.'s Tisch School of the Arts. After performing in a wide range of productions off and on Broadway, authored and performed the AIDS-related musical \"Positive Me\" at Ellen Stuart's La Mama, in Manhattan. It was one one of the earliest AIDS-related theater productions. Lisa gained her first television experience as a host of the cable series Awake on the Wild Side (1990). In the last several years, she has fearlessly taken on a wide variety of roles for television. She played a call-girl girlfriend on The West Wing (1999), David Conrad's sister on Relativity (1996), the transgender girlfriend of James Le Gros on Ally McBeal (1997) and an Orthodox Jewish woman on Family Law (1999). She also played James Spader's love interest on The Practice (1997), and has had numerous other TV roles and guest appearances. From 2004-2011, she played the hospital administrator Dr. Lisa Cuddy on the hit medical drama House (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0MDQyOTY2NV5BMl5BanBnXkFtZTcwMjU1MTMxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0249046","name":"Lisa Edelstein","nicknames":["Lisa E."],"idIMDB":"nm0249046"},"actorId":"nm0249046","character":"Mercy Graves","urlCharacter":"http://www.imdb.com/character/ch0000202","main":true},{"actorName":"Robert Hastings","urlProfile":"http://www.imdb.com/name/nm0368561","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NjQ1NzIyNV5BMl5BanBnXkFtZTcwNDc3NTcxOA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 April 1925","placeOfBirth":" Brooklyn, New York, USA","birthName":"Robert Francis Hastings","height":"5' 8½\" (1.74 m)","bio":"Bob Hastings got his show business start in radio after WWII as the voice of \"Archie Andrews\" in the show of the same name (a spin-off of the Archie Comics series) on the Mutual Broadcasting System. The good-looking Hastings made the transition to television smoothly in 1949 in early galactic-action series like Captain Video and His Video Rangers (1949) and Atom Squad (1953). His first recurring role was as a lieutenant on The Phil Silvers Show (1955) (aka \"Sgt. Bilko\"). Most of his career has been spent in television, and he's notable for roles such as Captain Binghamton's yes-man \"Lieutenant Elroy Carpenter\" on McHale's Navy (1962), one of the two Tommy Kelsey's on All in the Family (1971), and \"Captain Ramsey\" on General Hospital (1963). Hastings has also done much voice work, including that of \"The Raven\" on The Munsters (1964), \"Superboy\" on the The Superman/Aquaman Hour of Adventure (1967) cartoons in the 1960s and, in recent years, the voice of \"Commissioner Gordon\" on the animated Batman: The Animated Series (1992) cartoons.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NjQ1NzIyNV5BMl5BanBnXkFtZTcwNDc3NTcxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0368561","name":"Robert Hastings","idIMDB":"nm0368561"},"actorId":"nm0368561","character":"Commissioner Jim Gordon","urlCharacter":"http://www.imdb.com/character/ch0000248","main":true},{"actorName":"Efrem Zimbalist Jr.","urlProfile":"http://www.imdb.com/name/nm0956544","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1NDk5NjY4MTheQTJeQWpwZ15BbWU2MDI4Mzg0Ng@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 November 1918","placeOfBirth":" New York City, New York, USA","height":"6' (1.83 m)","bio":"It's hardly surprising that the son of renowned Russian-born concert violinist Efrem Zimbalist Sr. (1889-1985) and Romanian-born opera singer Alma Gluck (1884-1938) would desire a performing career of some kind. Born in New York City on November 30, 1918, surrounded by people of wealth and privilege throughout his childhood, Efrem Zimbalist Jr. received a boarding school education. Acting in school plays, he later trained briefly at the Yale School of Drama but didn't apply himself enough and quit. As an NBC network radio page, he auditioned when he could and found minor TV and stock theatre parts while joining up with the Neighborhood Playhouse. Following WWII war service with the Army infantry in which he was awarded the Purple Heart after being wounded, a director and friend of the family, Garson Kanin, gave the aspiring actor his first professional role in his Broadway production of \"The Rugged Path\" (1945) which starred Spencer Tracy. With his dark, friendly, clean-scrubbed good looks and a deep, rich voice that could cut butter, Zimbalist found little trouble finding work. He continued with the American Repertory Theatre performing in such classics as \"Henry VIII\" and \"Androcles and the Lion\" while appearing opposite the legendary Eva Le Gallienne in \"Hedda Gabler\". Zimbalist then tried his hand as a stage producer, successfully bringing opera to Broadway audiences for the first time with memorable presentations of \"The Medium\" and \"The Telephone\". As producer of Gian Carlo Menotti's \"The Consul\", he won the New York Drama Critic's Award and the Pulitzer Prize for best musical in 1950. An auspicious film debut opposite Edward G. Robinson in House of Strangers (1949) brought little career momentum due to the untimely death of his wife Emily (a onetime actress who appeared with him in \"Hedda Gabler\" and bore him two children, Nancy and Efrem III) to cancer in 1950. Making an abrupt decision to abandon acting, he served as assistant director/researcher at the Curtis School of Music for his father and buried himself with studies and music composition. In 1954, Efrem returned to acting and copped a daytime television soap lead (Concerning Miss Marlowe (1954)). It was famed director Joshua Logan who proved instrumental in helping Zimbalist secure a Warner Bros. contract. Despite forthright second leads in decent films such as Band of Angels (1957) with Clark Gable and Yvonne De Carlo; Too Much, Too Soon (1958) starring Dorothy Malone and Errol Flynn; Home Before Dark (1958) with Jean Simmons and Rhonda Fleming; The Crowded Sky (1960) with Dana Andrews, Rhonda Fleming, Troy Donahue and Anne Francis; A Fever in the Blood (1961) opposite Angie Dickinson and (his best) Wait Until Dark (1967) with Audrey Hepburn, it was television that made the better use of his refined, unshowy acting style. His roles as smooth private investigator Stu Bailey on 77 Sunset Strip (1958) and dogged inspector Lewis Erskine on The F.B.I. (1965) would be his ultimate claims to fame. A perfect gentleman on and off camera, Zimbalist's severest critics tend to deem his performances bland and undernourished. Managing to override such criticisms, he maintained a sturdy career for nearly six decades. In 1991, he made fun of his all-serious reputation and pulled off a Leslie Nielsen-like role in the comedy parody Hot Shots! (1991). In addition to theater projects over the years, he has made fine use of his mellifluous baritone performing narrations and cartoon voiceovers, including that of Alfred the butler on a \"Batman\" animated series. In 2003, he completed his memoirs, entitled \"My Dinner of Herbs\". The father of three, grandfather of four and great-grandfather of three, he settled in Santa Barbara and later in Solvang, California with longtime second wife Stephanie until her death in 2007 of cancer. Their daughter, also named Stephanie (Stephanie Zimbalist), is the well-known actress who appeared with Pierce Brosnan in the Remington Steele (1982) television series, in which Zimbalist had a recurring role. He and his daughter also appeared on stage together in his later years, their first being \"The Night of the Iguana\". His eldest daughter Nancy died in 2012. Zimbalist died peacefully at his Solvang home of natural causes at the age of 95 on May 2, 2014.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA1NDk5NjY4MTheQTJeQWpwZ15BbWU2MDI4Mzg0Ng@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0956544","name":"Efrem Zimbalist Jr.","idIMDB":"nm0956544"},"actorId":"nm0956544","character":"Alfred Pennyworth","urlCharacter":"http://www.imdb.com/character/ch0000204","main":true},{"actorName":"Joseph Bologna","urlProfile":"http://www.imdb.com/name/nm0004767","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1ODk4NTU3Ml5BMl5BanBnXkFtZTcwNjU5Njg5Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 December 1934","placeOfBirth":" Brooklyn, New York, USA","birthName":"Joseph J. Bologna","height":"6' 1\" (1.85 m)","bio":"Before signing with director Stanley Donen to play Michael Caine's libidinous best friend in Blame It on Rio (1984), Joe Bologna netted rave reviews for his Sid Caesar send-up in the well-received comedy My Favorite Year (1982) with Peter O'Toole. Well known as both a writer and an actor, Bologna dates his interest in the theater from his student days at Brown University, when a casting notice called for \"non-actor\" types to fill roles in a stage production of \"Stalag 17.\" He landed the leading part but did not act again for ten years. Bologna graduated from Brown with a degree in art history, and a tour with the Marines followed. When he was discharged from the service, he started directing short films and writing special comedy material. \"A monologue is the hardest thing in the world to write, because you're only as good as your last joke,\" explains Bologna. \"That's why comedians are so neurotic.\" Bologna made his Broadway debut as the star and co-author of the comedy smash \"Lovers and Other Strangers.\" Together with his wife Renée Taylor, he wrote and starred in Made for Each Other (1971). His other film credits include roles in Cops and Robbers (1973), Honor Thy Father (1973), The Big Bus (1976) and Chapter Two (1979). He also co-starred with Taylor in the Emmy-winning television special \"Acts of Love and Other Comedies,\" which they wrote together, and then starred in the made-for-television movie Torn Between Two Lovers (1979) with Lee Remick, before reuniting with Taylor in the critically acclaimed Broadway hit \"It Had To Be You.\" From there it was back to television for the CBS TV movie One Cooks, the Other Doesn't (1983) with Suzanne Pleshette. In 1991 he starred with Matt LeBlanc in Top of the Heap (1991), a spin-off from the hit series Married with Children (1987), but it didn't click with audiences the way \"MWC\" did and was canceled rather quickly.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc1ODk4NTU3Ml5BMl5BanBnXkFtZTcwNjU5Njg5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004767","name":"Joseph Bologna","idIMDB":"nm0004767"},"actorId":"nm0004767","character":"Dan Turpin","urlCharacter":"http://www.imdb.com/character/ch0062957","main":true},{"actorName":"Robert Costanzo","urlProfile":"http://www.imdb.com/name/nm0182456","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNjE1NzUzMF5BMl5BanBnXkFtZTcwNDU0OTU0MQ@@._V1_UY44_CR25,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1942","placeOfBirth":" New York City, New York, USA","birthName":"Robert Jason Costanzo","bio":"Robert Costanzo was born on October 20, 1942 in New York City, New York, USA as Robert Jason Costanzo. He is an actor and producer, known for Total Recall (1990), Saturday Night Fever (1977) and Batman: Mask of the Phantasm (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxNjE1NzUzMF5BMl5BanBnXkFtZTcwNDU0OTU0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0182456","name":"Robert Costanzo","idIMDB":"nm0182456"},"actorId":"nm0182456","character":"Harvey Bullock","urlCharacter":"http://www.imdb.com/character/ch0000265","main":true},{"actorName":"George Dzundza","urlProfile":"http://www.imdb.com/name/nm0001169","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MTgxNjkzMV5BMl5BanBnXkFtZTcwOTI0NDgwMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 July 1945","placeOfBirth":" Rosenheim, Bavaria, Germany","birthName":"George F. Dzundza","height":"5' 9½\" (1.77 m)","bio":"George Dzundza was born on July 19, 1945 in Rosenheim, Bavaria, Germany as George F. Dzundza. He is an actor and assistant director, known for The Deer Hunter (1978), Basic Instinct (1992) and Crimson Tide (1995). He has been married to Mary Jo Vermeulen since 1982. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1MTgxNjkzMV5BMl5BanBnXkFtZTcwOTI0NDgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001169","name":"George Dzundza","idIMDB":"nm0001169"},"actorId":"nm0001169","character":"Perry White","urlCharacter":"http://www.imdb.com/character/ch0000231","main":true},{"actorName":"Lauren Tom","urlProfile":"http://www.imdb.com/name/nm0866300","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MzY4NDAzMF5BMl5BanBnXkFtZTYwMzg5MDgy._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 August 1961","placeOfBirth":" Chicago, Illinois, USA","height":"5' 1½\" (1.56 m)","bio":"Lauren Tom is an Obie Award-winning actress, known for her roles as a dutiful daughter in the film The Joy Luck Club (1993), and a recurring role as Ross's girlfriend on NBC's Friends (1994). Lauren plays the role of \"Mai Washington\" on the new ABC series Men in Trees (2006). She recently appeared in a recurring role on the Showtime series Barbershop (2005), and in the film In Good Company (2004) with Scarlett Johansson and Dennis Quaid. She has also appeared in the films, Bad Santa (2003), When a Man Loves a Woman (1994), Mr. Jones (1993), With Friends Like These... (1998), Catfish in Black Bean Sauce (1999) and Manhood (2003). On television, Lauren was a series regular in NBC's DAG (2000) as Delta Burke's secretary, \"Ginger Chin\", and on ABC's Grace Under Fire (1993) with Brett Butler. On Broadway, she has appeared in \"A Chorus Line\", \"Hurlyburly\" and \"Doonesbury\", and has worked with directors such as Peter Sellars and 'Joanne Akalaitis' at the Goodman and Guthrie Theaters, the La Jolla Playhouse and the Kennedy Center. Her one-woman show, \"25 Psychics\", an engaging, humorous look at her quest for inner peace premiered at HBO'S U.S. Comedy Arts Festival in Aspen. The show received Dramalogue Awards for Best Performance and Best Direction. Lauren's voice work can be heard in the animated series, Futurama (1999), King of the Hill (1997), Codename: Kids Next Door (2002), Teacher's Pet (2004), Rocket Power (1999), Max Steel (2001), Batman Beyond (1999), Superman (1996), Kim Possible (2002), Baby Clifford, American Dragon: Jake Long (2005) and the recently released animated DVD, Mulan 2 (2004). She has also published personal essays in Brain, Child Magazine, East West Woman, Strut, Freshyarn.com, and is currently writing a book based on these essays.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY5MzY4NDAzMF5BMl5BanBnXkFtZTYwMzg5MDgy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0866300","name":"Lauren Tom","idIMDB":"nm0866300"},"actorId":"nm0866300","character":"Angela Chen","urlCharacter":"http://www.imdb.com/character/ch0091793","main":true},{"actorName":"Corey Burton","urlProfile":"http://www.imdb.com/name/nm0123553","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MTkzNTA2NV5BMl5BanBnXkFtZTcwMzUyODc3OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 August 1955","placeOfBirth":" West Los Angeles, California, USA","birthName":"Corey Gregg Weinberg","height":"5' 6\" (1.68 m)","bio":"Corey Burton was born on August 3, 1955 in West Los Angeles, California, USA as Corey Gregg Weinberg. He is known for his work on The Hunchback of Notre Dame (1996), Atlantis: The Lost Empire (2001) and Aladdin (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MTkzNTA2NV5BMl5BanBnXkFtZTcwMzUyODc3OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0123553","name":"Corey Burton","idIMDB":"nm0123553"},"actorId":"nm0123553","character":"Additional Voices","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Capodice","urlProfile":"http://www.imdb.com/name/nm0135306","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NzIwMDQzNF5BMl5BanBnXkFtZTgwNjY4NDEzMjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1941","placeOfBirth":" Chicago, Illinois, USA","bio":"John Capodice was born on December 25, 1941 in Chicago, Illinois, USA. He is an actor and producer, known for General Hospital (1963), Ace Ventura: Pet Detective (1994) and Wall Street (1987).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA2NzIwMDQzNF5BMl5BanBnXkFtZTgwNjY4NDEzMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0135306","name":"John Capodice","idIMDB":"nm0135306"},"actorId":"nm0135306","character":"Additional Voices","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0169590","urlIMDB":"http://www.imdb.com/title/tt0169590","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"©1997 Warner Bros."},"technical":{"runtime":["1 hr 4 min (64 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.8","filmingLocations":[],"rated":"TV-PG","awards":[],"votes":"6,509","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0072876","name":"Warner Bros. Animation"},{"idCompany":"co0005035","name":"Warner Bros. Television"}],"keywords":{"keywords":["clown","reporter","killer robot","robot","kryptonite","cape","hero","villain","team","statue","scheme","deal","female supervillain","extraterrestrial man","extraterrestrial human","dc animated universe","suspended scaffolding","jet pack","hydrochloric acid","newspaper reporter","man wearing glasses","female newspaper reporter","cruise liner","bandaged head","bare chested male","human versus machine","human versus robot","aircraft","aircraft hangar","art deco","batarang","anti kryptonite suit","metropolis the city","acid","hand buzzer","marble","bald man","billionaire","mercy graves","harley quinn","female bodyguard","futuristic car","jet aircraft","futuristic aircraft","grenade marble","human alien","red cape","caped superhero","alien superhero","flying superhero","flying man","industrialist","pink gas","batmobile","batwing","masked man","heat vision","damsel in distress","romantic triangle","love triangle","masked superhero","masked hero","christ allegory","tough guy","flying","super powers","superhuman strength","superhero team","two man army","edited from tv series","cartoon violence","keysi fighting method","martial arts","action hero","future","dystopia","surrealism","killer clown","clown makeup","clown face","perry white","cult film","secret identity","alien","1990s","dark hero","crossover","suspense","nocturnal murder","heist","duo","duel","yelling","super villain","psychotic","news report","millionaire","love","laughing gas","insanity","good versus evil","gadget","double cross","crime fighter","butler","airplane","psychopath","jealousy","evil clown","black comedy","superhero","based on comic book","dc comics","mask","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 16:44:27"}}