{"data":{"movies":[{"title":"Candyman","originalTitle":"","year":"1992","releaseDate":"19921016","directors":[{"name":"Bernard Rose","id":"nm0741262"}],"writers":[{"name":"Clive Barker","id":"nm0000850"},{"name":"Bernard Rose","id":"nm0741262"}],"runtime":"99 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzViMTE0YTItZTEyZS00ZDk5LWI4OWEtZmI4YzE3NzllYTUwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["USA","UK"],"languages":["English"],"genres":["Fantasy","Horror","Thriller"],"plot":"Helen Lyle is a student who decides to write a thesis about local legends and myths. She visits a part of the town, where she learns about the legend of the Candyman, a one-armed man who appears when you say his name five times, in front of a mirror. Of course, Helen doesn't believe all this stuff, but the people of the area are really afraid. When she ignores their warnings and begins her investigation in the places that he is rumored to appear, a series of horrible murders begins. Could the legend be true?","simplePlot":"The Candyman, a murderous soul with a hook for a hand, is accidentally summoned to reality by a skeptic grad student researching the monster's myth.","actors":[{"actorName":"Virginia Madsen","urlProfile":"http://www.imdb.com/name/nm0000515","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUyMDcxNTU3N15BMl5BanBnXkFtZTcwMDAwNjQzMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1961","placeOfBirth":" Chicago, Illinois, USA","height":"5' 5\" (1.65 m)","bio":"One of the hottest stars of the mid-1980s, Virginia Madsen has since played a variety of roles that have cemented her reputation as a fantastic actress who can adapt to any part. Virginia was born in Chicago, Illinois, and belongs to an acting family -- with her brother, Michael Madsen, also an actor, and her mother, Elaine Madsen (née Melson), an Emmy-winning writer, poet, and producer. Her paternal grandparents were Danish, and her father, Calvin Madsen, was a firefighter. Audiences first caught a glimpse of her as \"Princess Irulan\" in the 1984 science fiction epic Dune (1984). She followed that up with Electric Dreams (1984); however, it was in 1986 that Virginia captured the hearts of the audience with an intense portrayal of a Catholic school girl who fell in love with a boy from a prison camp in Duncan Gibbins' Fire with Fire (1986). Virginia played the role of \"Lisa\" and her co-star was Craig Sheffer, who played Lisa's love interest, \"Joe Fisk\". Kari Wuhrer also made an appearance as Virginia's best friend, \"Gloria\". Fire with Fire (1986) was a low-budget production, starring a bunch of fresh faces who were till then-unknown to Hollywood. However, the movie was a success and elevated its three young stars overnight. Virginia has never looked back since. Not only did she receive amazing reviews for her Academy Award and Golden Globe nominated performance in Alexander Payne's hit film, Sideways (2004), but this Independent Spirit Award-winning actress has an illustrious resume of roles alongside the most notable and respected actors in the business. Also on Virginia's slate is her production company, with partner Karly Meola, called \"Title IX Productions\". Their first project was the documentary I Know a Woman Like That (2009), which previewed at the Phoenix Film Festival in April 2009 and premiered at the Chicago Film Festival in October 2009. The doc was directed by Virginia's mother, Elaine Madsen, about the lives of extraordinary women ages 64-94. Next in the company's lineup is the documentary Fighting Gravity (2010), about women ski jumpers' ongoing battle for the right to compete in the 2010 Winter Olympics. Title IX will team up with \"Empire 8 Productions\" and Vancouver-based \"Screen Siren\" on the project. The duo also has several projects in development that they're shopping around for financing including screenwriters Sebastian Gutierrez's screen adaptation of Martha O'Connor's novel \"The Bitch Posse\" and a remake of the 1984 film Electric Dreams (1984), in which Virginia appeared.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjUyMDcxNTU3N15BMl5BanBnXkFtZTcwMDAwNjQzMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000515","name":"Virginia Madsen","nicknames":["Gina"],"idIMDB":"nm0000515"},"actorId":"nm0000515","character":"Helen Lyle","urlCharacter":"http://www.imdb.com/character/ch0038852","main":true},{"actorName":"Tony Todd","urlProfile":"http://www.imdb.com/name/nm0865302","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTI1Njc4NV5BMl5BanBnXkFtZTcwMDg4NzcyNg@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 December 1954","placeOfBirth":" Washington, District of Columbia, USA","birthName":"Anthony Tiran Todd","height":"6' 5\" (1.96 m)","bio":"Perhaps best known for his chilling performance as \"Candyman\", the charismatic 6' 5\" actor Tony Todd has consistently turned in compelling performances since his debut in the fantasy film Sleepwalk (1986). Born in Washington, D.C., Todd spent two years on a scholarship at the University of Connecticut, which, in turn, led to a scholarship from the renowned Eugene O'Neill National Theatre Institute. It proved to be the foundation for intense stints at the Hartman Conservatory in Stamford, Connecticut and the Trinity Square Repertory Theatre Conservatory in Providence, Rhode Island. Todd appeared in dozens of classical and many experimental plays, yet still managed to find time to teach playwriting to high school students in the Hartford public school system. Todd's extensive credits exemplify his versatility. They include such film classics as The Rock (1996), The Crow (1994), Lean on Me (1989), Bird (1988), Night of the Living Dead (1990), Destination finale (2000), the multiple Academy Award winning Oliver Stone film Platoon (1986) and Le secret (2000), which was nominated and screened at the Cannes Film Festival. Todd's recent films include the independent film Silence (2002) and Final Destination 2 (2003). He has had prominent guest starring roles in numerous critically-acclaimed television series, including recurring on Boston Public (2000), For the People (2002) and The District (2000), as well as NYPD Blue (1993), Smallville (2001), Law & Order (1990), Crossing Jordan (2001), Homicide: Life on the Street (1993) and The X-Files (1993). Todd recurred on three incarnations of \"Star Trek\" and guest starred on Xena: Warrior Princess (1995) and episodes of CSI: Miami (2002) and Andromeda (2000). His television movies include starring roles in True Women (1997), Black Fox (1995), Butter (1998), Ivory Hunters (1990), Babylon 5: A Call to Arms (1999) and Control Factor (2003). Todd's considerable theatre credits include the world premiere of award-winning playwright August Wilson's \"King Hedley II\", where he originated the title role in Pittsburgh, Seattle and Boston. Variety commented: \"Todd's King Hedley dominates the stage. A sour-faced mix of rage and resolve, anger and vulnerability. Todd's Hedley was a memorable tour-de-force even on opening.\" He also received a coveted Helen Hayes nomination for his performance in Athol Fugard's \"The Captain's Tiger at La Jolla, the Manhattan Theatre Club and the Kennedy Center. Other theatre credits include \"Les Blancs\", \"Playboy of the West Indies\", \"Othello\", \"Zooman and the Sign\", award-winning playwright Keith Glover's \"Dark Paradise\", \"Aida\" (on Broadway), and most recently, \"Levee James\" for the prestigious Eugene O'Neill Playwrights Conference and The New Dramatist Guild.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzNTI1Njc4NV5BMl5BanBnXkFtZTcwMDg4NzcyNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0865302","name":"Tony Todd","idIMDB":"nm0865302"},"actorId":"nm0865302","character":"The Candyman / Daniel Robitaille","urlCharacter":"http://www.imdb.com/character/ch0015146","main":true},{"actorName":"Xander Berkeley","urlProfile":"http://www.imdb.com/name/nm0075359","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMjA1OTEwOTheQTJeQWpwZ15BbWU2MDkxODgxMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 December 1955","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Alexander Harper Berkeley","height":"6' (1.83 m)","bio":"Xander's father was a painter and his mother a school teacher who sewed, providing him with costumes (his preference over toys). School plays and Community Theater were next. An experimental theater troupe in the area (which was an offshoot from Joseph Chaikin's Open Theater in New York) took Xander under their wing when he was 16. He credits this group for shaping him as both a person and an actor, committed to taking risks and remaining open to the unknown. Xander went to Hampshire College, the progressive brainchild of Smith, Mt. Holyoke, Amherst, and the University of Massachusetts. He would continue in the theater at Hampshire, studying and doing plays at each of the other schools, all of which were there in the area. A move to New York after college brought him access to private teachers from the Royal Academy of the Arts, the Moscow Arts Theater and HB Studios. Later in Los Angeles, Xander would spend time with Lee Strasberg at The Actor's Studio during the last years of his life. Xander worked in Regional and Repertory Theaters in addition to off-Broadway while living in New York but, despite a classically trained theater background, he was increasingly drawn to the subtleties of film acting. A play, written by the great southern novelist Reynolds Price, called \"Early Dark\" had such a cinematic feel to it, that an agent saw the film acting potential in Xander and encouraged him to make the move out west. Soon Mommie Dearest (1981) provided Xander with his film debut in the role of \"Christopher Crawford\", and simultaneously gave his career a slightly cultish twist. Alex Cox with Sid and Nancy (1986), James Cameron with Terminator 2: Judgment Day (1991), Bernard Rose with Candyman (1992), Todd Haynes with Safe (1995), Mike Figgis with Leaving Las Vegas (1995), Andrew Niccol with Gattaca (1997) all helped to further associate Xander as an actor in his own rather unusual category. Xander's choices were often determined by the opportunity to learn from directors he admired, certainly all those listed above fell into that category. Clint Eastwood with The Rookie (1990), Ron Howard with Apollo 13 (1995), Rob Reiner with A Few Good Men (1992), Michael Mann with Heat (1995), Wolfgang Petersen with Air Force One (1997), Steven Spielberg with Amistad (1997) are obvious examples of others Xander actively sought to work with and learn from. From obscure independent movies where Xander could play lead roles to the big budget studio movies where he might often play smaller character-driven parts, an education was taking place. Just as working with older directors like Mihalis Kakogiannis on La cerisaie (1999) and Robert M. Young on Human Error (2004) (aka \"Human Error\") brought insights to ways of working that are being lost in pop cultures tendency to slide toward slickness. Not to mention bringing him to places like Bulgaria and China along the way. Perhaps because a life in the foreign services, or espionage was seen as a road not taken, living on location in foreign countries, working as an actor, has somewhat fulfilled the impulse. As early as 1987, a film took Xander to Nicaragua while the Contra War was taking place. It was during this three month shoot on the film Walker (1987) (starring Ed Harris) that Xander got an offer to do a film with his friend, director Jon Hess, in Chile for the following three months. Taking him straight from the revolutionary left-wing Sandanistas to Pinochet's fascist, right-wing regime. In 2001, an offer came in to play a part on a TV pilot called 24 (2001). It was another shady agent-type, and reluctant to repeat his performance from Air Force One (1997) as the turncoat secret serviceman, Xander almost passed on the job. Fortunately for him, he said yes. He met his future wife, Sarah Clarke during the first day of filming. His character, \"George Mason\", was just a guest star in the pilot, but the producers liked what Xander brought to it and continued to write more episodes for him. By the second season, it had become perhaps the most interesting, leveled character Xander had ever gotten to play. Sarah and Xander were married in 2002 and had their daughters, Olwyn in 2006 and Rowan in 2010. Other favorite roles of late have been \"Arlen Pavich\", the middle management dweeb, in Niki Caro's North Country (2005), and the Irish hooligan/railway foreman in David Von Ancken's Seraphim Falls (2006) and, more recently, \"The King of Sodom\" in Harold Ramis' Year One (2009), \"Sonny\" in David Pomes' Cook County (2009), the recovering meth head coming out of prison to discover the life he had left (and destroyed), and crazy \"Uncle Doug\" in David Wike's Out There (2006) (aka \"Out There\").","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAwMjA1OTEwOTheQTJeQWpwZ15BbWU2MDkxODgxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0075359","name":"Xander Berkeley","idIMDB":"nm0075359"},"actorId":"nm0075359","character":"Trevor Lyle","urlCharacter":"http://www.imdb.com/character/ch0177327","main":true},{"actorName":"Kasi Lemmons","urlProfile":"http://www.imdb.com/name/nm0501435","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMTM1NzI3MF5BMl5BanBnXkFtZTYwMTkzNjc4._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1961","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Karen Lemmons","bio":"Kasi Lemmons was born on February 24, 1961 in St. Louis, Missouri, USA as Karen Lemmons. She is an actress and director, known for The Silence of the Lambs (1991), Candyman (1992) and As the World Turns (1956). She has been married to Vondie Curtis-Hall since 1995. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExMTM1NzI3MF5BMl5BanBnXkFtZTYwMTkzNjc4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0501435","name":"Kasi Lemmons","idIMDB":"nm0501435"},"actorId":"nm0501435","character":"Bernadette 'Bernie' Walsh","urlCharacter":"http://www.imdb.com/character/ch0112648","main":true},{"actorName":"Vanessa Williams","urlProfile":"http://www.imdb.com/name/nm0004539","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM3NjIxMjE5OV5BMl5BanBnXkFtZTcwMzg1OTQ1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1963","placeOfBirth":" Bedford-Stuyvesant, Brooklyn, New York City, New York, USA","bio":"Born and raised in the Bedford Stuyvesant section of Brooklyn, New York, Vanessa Williams became a member of the New York City Opera's Children's Chorus at age 11. Vanessa then signed with a talent manager and booked her first audition, a commercial for Frito Lay. Her pattern for success clearly set, her winning streak had only just begun. After graduating from New York's famed High School of Performing Arts she earned a Bachelor's degree in theatre and business from Marymount Manhattan College. A member of all three actors unions, Vanessa kept busy striking a balance as a professional actress and college student. When she landed a recurring role on The Cosby Show (1984) as (Theo's scene partner in a school play), a high-strung student/actress named Jade Marsh, she made a friend and fan of \"The Cos\" Bill Cosby. So impressed with her work, \"Mr. C\" asked her back to play yet another role, Theo's girlfriend Cheryl Lovejoy, a sweet young thing from Barbados. Her New York stage credits grew to include the Lincoln Center production of Death and the King's Horseman and the Broadway productions of Sarafina and Mule Bone, the Langston Hughes and Zora Neale Hurston collaboration. The opening night celebration for Mule Bone packed a double punch of pleasure, as New Jack City (1991) was released in theaters nationwide that same evening. In this, her first feature film, Vanessa plays Keisha, the gun toting head of security opposite Wesley Snipes as drug czar Nino Brown. Vanessa arrived in LA in September of '91, \"just to check it out.\" A month later she was cast as single mother Anna-Marie McCoy in the Gothic horror film, Candyman (1992). She made her west coast move official in January of '92, and became a media darling when she hit the media radar as one of the stars in the Fox TV hit Melrose Place (1992). After residence on Melrose Place (1992) Vanessa traveled to Spain to sing and host the variety show Grand Fiesta on the Telecinco network in Madrid. Back from Europe she was immediately cast as a series regular in Steven Bochco's critically acclaim television drama Murder One (1995), where she earned her first NAACP Image Award Nomination. She appeared opposite Lisa Kudrow in the Albert Brooks feature Mother (1996), then went on location in South Africa to star in A Woman of Color (1997), a film written and directed by Oscar nominated director, Bernard Joffa. She followed these projects with a ten-episode arc on Chicago Hope (1994), where she was again nominated for an NAACP Image Award. Vanessa starred in two BET original made for TV movies: Incognito (1999) and Playing with Fire (2000), and as guest star on Total Recall (1994), The Pretender (1996), NYPD Blue (1993), The Steve Harvey Show (1996), Malcolm & Eddie (1996), and Living Single (1993), Cold Case (2003) among other others. She starred (opposite her soon to be Soul Food (2000) costar Rockmond Dunbar) in Punks (2000), the award-winning feature film directed by Patrik-Ian Polk, which premiered at The Sundance Film Festival in 2000. She earned a Daytime Emmy Nomination for her extraordinary work in Our America (2002) a Showtime original movie directed by Ernest R. Dickerson, which also premiered at Sundance the following year. As hot mama, Maxine Chadway, in the hit Showtime series Soul Food (2000), Vanessa secured the NAACP Image Award for Outstanding Actress in a Drama Series. Vanessa is also a talented writer who has written a collection of poetry and prose titled Shine. Her poems and essays have also appeared in Essence Magazine. As filmmaker, Vanessa wrote, directed, and produced the short film, Dense (2004), which aired on Showtime Television and is a favorite among film festival-goers. As a singer/songwriter, Vanessa performed her original melodies in the films Dense (2004) and the award-winning short Driving Fish (2002). She recently performed \"The Vagina Monologues\" along with Star Jones and Sherri Shepherd (from The View (1997)) in Washington D.C. and Los Angeles, \"Harlot Poetry by Vanessa Williams\" at Artpeace Gallery in Burbank, California and \"Stories in Song: an evening with Vanessa Williams\" at the Temple Bar in Santa Monica, CA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjM3NjIxMjE5OV5BMl5BanBnXkFtZTcwMzg1OTQ1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004539","name":"Vanessa Williams","idIMDB":"nm0004539"},"actorId":"nm0004539","character":"Anne-Marie McCoy","urlCharacter":"http://www.imdb.com/character/ch0542874","main":true},{"actorName":"DeJuan Guy","urlProfile":"http://www.imdb.com/name/nm0349803","urlPhoto":"","biography":{"dateOfBirth":"1981","placeOfBirth":"","bio":"DeJuan Guy was born in 1981. He is an actor, known for Candyman (1992), Baby Boy (2001) and One Tough Bastard (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0349803","name":"DeJuan Guy","idIMDB":"nm0349803"},"actorId":"nm0349803","character":"Jake","urlCharacter":"http://www.imdb.com/character/ch0177328","main":true},{"actorName":"Marianna Elliott","urlProfile":"http://www.imdb.com/name/nm0254544","urlPhoto":"","biography":{"bio":"Marianna Elliott is an actress and producer, known for Candyman (1992), Night Train (1995) and Rites of Passage (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0254544","name":"Marianna Elliott","idIMDB":"nm0254544"},"actorId":"nm0254544","character":"Clara","urlCharacter":"http://www.imdb.com/character/ch0177329","main":true},{"actorName":"Ted Raimi","urlProfile":"http://www.imdb.com/name/nm0001646","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNTIwMTI4Nl5BMl5BanBnXkFtZTcwNjQ3OTExOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1965","placeOfBirth":" Detroit, Michigan, USA","birthName":"Theodore R. Raimi","height":"6' 2\" (1.88 m)","bio":"Ted Raimi was born on December 14, 1965 in Detroit, Michigan, USA as Theodore R. Raimi. He is an actor and writer, known for Ash vs Evil Dead (2015), Spider-Man 3 (2007) and The Midnight Meat Train (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNTIwMTI4Nl5BMl5BanBnXkFtZTcwNjQ3OTExOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001646","name":"Ted Raimi","nicknames":["Theo"],"idIMDB":"nm0001646"},"actorId":"nm0001646","character":"Billy","urlCharacter":"http://www.imdb.com/character/ch0177332","main":true},{"actorName":"Ria Pavia","urlProfile":"http://www.imdb.com/name/nm0667632","urlPhoto":"","biography":{"dateOfBirth":"8 October 1967","placeOfBirth":" Ohio, USA","bio":"Ria was born in Ohio, but doesn't remember much of the State because six months later, her family moved back to Rochester, NY. She grew up in the city that produces Kodak film and lots of snow. Next, she and her two brothers and parents relocated to South Carolina. She wasn't crazy about the pace of the South, so she opted for boarding school, attending Interlochen Arts Academy, a performing arts school in Michigan. After graduating, she moved to Los Angeles to attend UCLA as a Theater Arts Major. Soon after enrolling, she was accepted into the prestigious Screen Actors Guild not after performing Shakespeare, but by doing gymnastics in a tampon commercial. This big career break motivated her to pursue acting full time. Before long, she landed numerous roles in television shows and film. A couple of the films Ria has appeared in have won awards, including Baby Steps (winner - '99 OutFest Los Angeles, best short narrative)and Mr. October (winner - student academy award). She has also appeared in dozens of commercials, as well as performing onstage at several venues in Los Angeles and at the Aspen Comedy Festival.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0667632","name":"Ria Pavia","idIMDB":"nm0667632"},"actorId":"nm0667632","character":"Monica","urlCharacter":"http://www.imdb.com/character/ch0253256","main":true},{"actorName":"Mark Daniels","urlProfile":"http://www.imdb.com/name/nm0200027","urlPhoto":"","biography":{"bio":"Mark Daniels is an actor, known for Candyman (1992), Mr. Holland's Opus (1995) and Growing Pains (1985).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0200027","name":"Mark Daniels","idIMDB":"nm0200027"},"actorId":"nm0200027","character":"Student","urlCharacter":"http://www.imdb.com/character/ch0253257","main":true},{"actorName":"Lisa Ann Poggi","urlProfile":"http://www.imdb.com/name/nm0688215","urlPhoto":"","biography":{"bio":"Lisa Ann Poggi is an actress and editor, known for Candyman (1992), Honeymoon in Vegas (1992) and Obsessed (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0688215","name":"Lisa Ann Poggi","idIMDB":"nm0688215"},"actorId":"nm0688215","character":"Diane","urlCharacter":"http://www.imdb.com/character/ch0253258","main":true},{"actorName":"Adam Philipson","urlProfile":"http://www.imdb.com/name/nm0680129","urlPhoto":"","biography":{"bio":"Adam Philipson is known for his work on Candyman (1992), Still Not Quite Human (1992) and Checkered Flag (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0680129","name":"Adam Philipson","idIMDB":"nm0680129"},"actorId":"nm0680129","character":"Danny","urlCharacter":"http://www.imdb.com/character/ch0253259","main":true},{"actorName":"Eric Edwards","urlProfile":"http://www.imdb.com/name/nm0249981","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNjI4NDY5M15BMl5BanBnXkFtZTcwNjkzMDQxOA@@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1966","placeOfBirth":" Topeka, Kansas, USA","bio":"Eric Edwards has gained recognition on the big screen and on television, in live theater, and on the stand-up comedy circuit, working non-stop in all four mediums. In fact, in one year, Eric co-starred in two feature films, one television movie, and an original one-man show, all while simultaneously continuing as an active member and teacher of the prominent Los Angeles-based repertory group, Playhouse West. Eric produced, co-wrote, and co-starred in Fatman and Mr. Taco which was awarded Best Feature Film at the 11th annual East L.A. Chicano/Chicana Film Festival. Eric got his feet wet in stand-up comedy opening for headliners like Andrew \"Dice\" Clay. His high-energy performances have entertained audiences in concert halls across the country and he's made numerous guest TV appearances including Fox's Townsend Television, BET's The Comic View, and as Tonya Harding's heavy-set hit man in Showtime's award-winning special, Attack of the 5'2\" Women. Also, Eric appeared in the television movie Junior in Love in duel roles. Eric has been active as both a Staff member and actor at Playhouse West, co-starring in the critically acclaimed dark comedy, Aaron Gillespie Will Make You A Star, which chronicles a group of actors as their dreams are met with harsh reality. Eric is also a cast member Welcome Home Soldier the longest running Drama in Los Angeles. Eric has also authored and starred in the critically acclaimed and capacity filled, Calorically Challenged... and Proud of It, a one-and-half man show. He works out regularly at L.A.'s premiere comedy club, The Comedy Store. Eric has entertained audiences on the big screen as well. Eric received critical acclaim for his portrayal of the lovable misfit, \"Doberman,\" in Universal's Sgt. Bilko, starring Steve Martin. He first received recognition as \"Murph,\" the bully who gets taped to the chalkboard in Problem Child 2, as the Clampett's country cousin in The Beverly Hillbillies, and as Spanky's father in Universal's The Little Rascals. In New Line Cinema's National Lampoon's Senior Trip, Eric portrayed \"Miosky\" opposite Jeremy Renner (academy award nominee actor of the Hurt Locker) in the comedy about the politically incorrect misadventures of a pack of high school slackers who get a lesson in civics when they take a road trip to Washington D.C. He played \"Pearl\" in the Wesley Snipes blockbuster hit Blade (New Line). In 1999 Eric Edwards has lost 210 pounds which lead to Eric co-writing and starring in another inspirational one-man comedy play, Just Step a.k.a. The Weight is Over aka Just Step. Since the show started in November of 1999, the play has been having a positive impact on packed houses in Los Angeles as well as critical praise for the LA Times, Recommended by the LA Weekly, and Noho LA. Since 2003, Eric appeared on Strong Medicine on The Lifetime Channel as Jimmy Falco. In 2007, Eric co starred in two feature films: Michael Kallio's Koreatown, and 110% when Blood, Sweat, and tears are not enough. And in 2008 you can see Eric on ABC's Desperate Housewives, opposite Felicity Huffman and American Dad. And in 2009 in the feature film Dead in Love, CW's Everybody Hates Chris, and more episodes of American Dad on FOX. And 2010, he has appeared in Criminal Minds on CBS and NBC's Parks and Recreation. As well the Video of The Weight is Over was picked the play at the Reel Recovery Film Festival 2010. And Eric's new original play A Mixed Tape premiere's November 2010 at Playhouse West. A Mixed tape is a romantic comedy of a 40'something single character actor/audience recruiter, who has given up on love, but with the help of a Banana, gorilla, a Single Mother, Tom Waits and some really cool flashbacks, things just might work out.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyNjI4NDY5M15BMl5BanBnXkFtZTcwNjkzMDQxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0249981","name":"Eric Edwards","idIMDB":"nm0249981"},"actorId":"nm0249981","character":"Harold","urlCharacter":"http://www.imdb.com/character/ch0253260","main":true},{"actorName":"Carolyn Lowery","urlProfile":"http://www.imdb.com/name/nm0523201","urlPhoto":"","biography":{"bio":"Carolyn Lowery is an actress, known for Candyman (1992), Octopus (2000) and Vicious Circles (1997).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0523201","name":"Carolyn Lowery","idIMDB":"nm0523201"},"actorId":"nm0523201","character":"Stacey","urlCharacter":"http://www.imdb.com/character/ch0177334","main":true},{"actorName":"Barbara Alston","urlProfile":"http://www.imdb.com/name/nm0022577","urlPhoto":"","biography":{"dateOfBirth":"1944","placeOfBirth":"","bio":"Barbara Alston was born in 1944. She is an actress, known for Candyman (1992), Jaws: The Revenge (1987) and A Hero Ain't Nothin' But a Sandwich (1978).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0022577","name":"Barbara Alston","idIMDB":"nm0022577"},"actorId":"nm0022577","character":"Henrietta Mosely","urlCharacter":"http://www.imdb.com/character/ch0177333","main":true}],"seasons":[],"idIMDB":"tt0103919","urlIMDB":"http://www.imdb.com/title/tt0103919","business":{"budget":{"money":"$6,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[],"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1991/\">1991</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 39 min (99 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["DeLuxe, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"6.6","filmingLocations":[{"location":"4222 Agnes Avenue, Studio City, California, USA"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1993","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Actress","names":[{"name":"Virginia Madsen","id":"nm0000515","role":null}]}]},{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Horror Film","names":[]},{"category":"Best Writing","names":[{"name":"Bernard Rose","id":"nm0741262","role":null}]},{"category":"Best Make-Up","names":[{"name":"Bob Keen","id":"nm0444571","role":null},{"name":"Image Animation","id":null,"role":null}]}]}]},{"award":"Avoriaz Fantastic Film Festival 1993","titlesAwards":[{"titleAwardOutcome":"Won Audience Award","categories":[{"category":"","names":[{"name":"Bernard Rose","id":"nm0741262","role":null}]}]},{"titleAwardOutcome":"Won Best Actress","categories":[{"category":"","names":[{"name":"Virginia Madsen","id":"nm0000515","role":null}]}]},{"titleAwardOutcome":"Won Best Music","categories":[{"category":"","names":[{"name":"Philip Glass","id":"nm0001275","role":null}]}]},{"titleAwardOutcome":"Nominated Grand Prize","categories":[{"category":"","names":[{"name":"Bernard Rose","id":"nm0741262","role":null}]}]}]},{"award":"Fangoria Chainsaw Awards 1992","titlesAwards":[{"titleAwardOutcome":"Won Chainsaw Award","categories":[{"category":"Best Actress","names":[{"name":"Virginia Madsen","id":"nm0000515","role":null}]}]},{"titleAwardOutcome":"Nominated Chainsaw Award","categories":[{"category":"Best Actor","names":[{"name":"Tony Todd","id":"nm0865302","role":null}]},{"category":"Best Supporting Actress","names":[{"name":"Vanessa Williams","id":"nm0004539","role":null}]}]}]},{"award":"Fantasporto 1993","titlesAwards":[{"titleAwardOutcome":"Nominated International Fantasy Film Award","categories":[{"category":"Best Film","names":[{"name":"Bernard Rose","id":"nm0741262","role":null}]}]}]}],"votes":"52,749","type":"Movie","companyCreditsSimple":[{"idCompany":"co0106129","name":"PolyGram Filmed Entertainment"},{"idCompany":"co0058765","name":"Propaganda Films"}],"keywords":{"keywords":["legend","artist","hook for a hand","hook","belief","burnt hair","little boy","hidden room","secret passage","screaming","corpse","painting","apartment complex","apartment","hole in a wall","psychiatrist","art","mural","kiss","abduction","abandonment","needle","kid","death of dog","rottweiler","bath","past life","medicine cabinet","breasts","lynch mob","castration","child murder","lifting female in air","seduction","covered in blood","black eye","bathroom mirror","framed","false accusation of murder","accused of murder","urban decay","housing project","ghetto","gang violence","feces","killing a dog","college","burned alive","beating","grave","betrayal","swarm","levitation","forced to strip","disembodied voice","dead animal","wheelchair","telephone","slide projector","funeral","female nudity","dog","bonfire","ghost","bee","toilet","blood","folklore","police","revenge","public restroom","disfigurement","amputation","escape","mental patient","gore","mental institution","graffiti","slum","vacant apartment","mother","discovery","disbelief","fire","fear","filth","grief","character name in title","surprise ending","candyman","mirror","investigation","urban legend","killer bee","bloody mary","raw meat","crawling through a hole","after life","taking a photograph","abusive policeman","slow motion","lifting someone into the air","lifting an adult into the air","hypnotized cast","disbelieving authority","police lineup","gothic","framed for murder","viciousness","repulsion","false accusation","boyfriend girlfriend relationship","loss of penis","cigarette smoking","budweiser","one word title","nipples visible through clothing","tall man","parking garage","macabre","chicago illinois","cheating on wife","sociologist","yelling","running","cult","cult film","aggression","stabbed in the back","altar","makeup","person on fire","school","prison","elevator","bathing","serial killer","photographer","kidnapping","slasher","anger","hatred","loathing","driving","title spoken by character","psychopath","dead baby"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:32:11"}}