{"data":{"movies":[{"title":"Army of Darkness","originalTitle":"","year":"1992","releaseDate":"19930219","directors":[{"name":"Sam Raimi","id":"nm0000600"}],"writers":[{"name":"Sam Raimi","id":"nm0000600"},{"name":"Ivan Raimi","id":"nm0706898"}],"runtime":"81 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BODcyYzM4YTAtNGM5MS00NjU4LTk2Y2ItZjI5NjkzZTk0MmQ1XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Horror"],"plot":"Ash is transported with his car to 1,300 A.D., where he is captured by Lord Arthur and turned slave with Duke Henry the Red and a couple of his men. When Ash is thrown into a pit, he defeats two monsters and wins respect of Arthur's army and vassals. The Wiseman points Ash as The Chosen One that will retrieve the Necronomicon but Ash is only interested in returning home. When he learns that the only way to return to his time is using the Necronomicon, Ash decides to travel to the unholy land of the Deadites. The Wiseman advises that he must say the words \"Klaatu Barada Nikto\" to safely get the evil book. However, Ash forgets the last word and an army of the dead resurrects to attack Arthur fortress and recover the Necronomicon. The battle between the living and the dead is about to start and the support of Henry the Red is the only way to help Ash and Arthur to defeat the army of darkness.","simplePlot":"A man is accidentally transported to 1300 A.D., where he must battle an army of the dead and retrieve the Necronomicon so he can return home.","actors":[{"actorName":"Bruce Campbell","urlProfile":"http://www.imdb.com/name/nm0132257","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY2MTg0OTEzOV5BMl5BanBnXkFtZTgwNzQ3NTcwMjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 June 1958","placeOfBirth":" Birmingham, Michigan, USA","birthName":"Bruce Lorne Campbell","height":"6' 1\" (1.85 m)","bio":"In 1979 with his Detroit friends, Sam Raimi and Rob Tapert, Bruce Campbell raised $350,000 for a low-budget film, The Evil Dead (1981), in which he starred and co-executive produced. Completed piecemeal over four years, the film first gained notoriety in England where it became the best-selling video of 1983, beating out The Shining (1980). After its appearance at Cannes, where Stephen King dubbed it \"the most ferociously original horror film of the year\", New Line Cinema stepped forward to release \"Evil Dead\" in the U.S. After co-producing Crimewave (1985), a cross-genre comedy written by Sam Raimi, Ethan and Joel Coen, Campbell moved to Los Angeles and quickly gained a foothold producing or starring in genre films such as the Maniac Cop (1988) series, Lunatics: A Love Story (1991), Moontrap (1989), and Mindwarp (1992), a post-apocalyptic \"Jeremiah Johnson\", during which he met his wife-to-be, filmmaker, Ida Gearon. Campbell then rejoined his Detroit colleagues to star and co-produce the second and third films in the Evil Dead trilogy (Evil Dead II (1987) & Army of Darkness (1992)), completing 12 years of work on the cult favorite. This rough-and-tumble background was a plus as Campbell made his foray into television, first starring in the highly touted Fox series The Adventures of Brisco County Jr. (1993), then as a recurring guest-star on the hit show Lois & Clark: The New Adventures of Superman (1993). With these under his belt, Campbell easily made the transition to director, helming numerous episodes and recurring as the King of Thieves in the #1 syndicated Hercules: The Legendary Journeys (1995), and its follow-up phenomenon, Xena: Warrior Princess (1995). Bruce has since expanded his range on television, appearing in anything from Disney's update of The Wonderful World of Disney: The Love Bug (1997), to decidedly dramatic turns on the acclaimed series Homicide: Life on the Street (1993) and The X-Files (1993). At the invitation of ABC, Campbell ventured into the world of sitcoms with a recurring role on ABC's Emmy-nominated Ellen (1994), participating in one of the three touted \"out\" episodes. But Campbell didn't abandon his film roots. During that time, he had featured roles in the blockbuster Congo (1995), John Carpenter's Escape from L.A. (1996), and the award-winning independent crime drama, Running Time (1997). He followed these up with roles in Paramount's romantic comedy, Au service de Sara (2002), Jim Carrey's The Majestic (2001), and all three of Sam Raimi's blockbuster Spider-Man movies. After a return to episodic television in the swashbuckling series, Jack of All Trades (2000), Campbell took the title role in MGM's cult sleeper Bubba Ho-Tep (2002). His directorial debut, Man with the Screaming Brain (2005) premiered on the Sci Fi Channel, and Dark Horse Comics published the comic adaptation. Campbell then directed and starred as himself in My Name Is Bruce (2007), a spoof of his B-movie career, then re-teamed with Disney for their fun-filled hit, Sky High (2005). Campbell has since made the leap into other forms of entertainment, and is enjoying his role as an author with back-to-back New York Times bestsellers: a memoir entitled \"If Chins Could Kill: Confessions of a B Movie Actor\", and his first novel, \"Make Love the Bruce Campbell Way\". In the multi-media industry, Bruce has enjoyed voicing characters for Disney's animated TV series The Legend of Tarzan (2001) and the Warner Brothers feature The Ant Bully (2006). He also portrayed the character of \"Mayor Shelbourne\" in the animated hit film, Cloudy with a Chance of Meatballs (2009). Recently, Campbell voiced the role of \"Rod Torque Redline\" in Cars 2 (2011), the sequel to the smash Disney animated feature and for the immensely popular game, \"Call of Duty\". In 2013, Bruce co-produced the hit remake of Evil Dead (2013), joined his filmmaking pal Sam Raimi on Oz the Great and Powerful (2013), and completed an impressive seven-year run on the spy show, Burn Notice (2007) (2007-2013), USA's #1 show on cable. More than two decades after the release of Army of Darkness (1992), Bruce returned to his most iconic role for Ash vs Evil Dead (2015), a highly-anticipated series premiering on the Starz network on Halloween 2015.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY2MTg0OTEzOV5BMl5BanBnXkFtZTgwNzQ3NTcwMjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0132257","name":"Bruce Campbell","idIMDB":"nm0132257"},"actorId":"nm0132257","character":"Ash","urlCharacter":"http://www.imdb.com/character/ch0003609","main":true},{"actorName":"Embeth Davidtz","urlProfile":"http://www.imdb.com/name/nm0001110","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU5NzQzMTkyMl5BMl5BanBnXkFtZTcwMjQ2OTUwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 August 1965","placeOfBirth":" Lafayette, Indiana, USA","birthName":"Embeth Jean Davidtz","height":"5' 8\" (1.73 m)","bio":"Embeth Davidtz was born on August 11, 1965 in Lafayette, Indiana. She is known for her role as Miss Honey in the film Matilda (1996). Her parents, Jean and John Davidtz, were South Africans, with Dutch, English, and French ancestry. The family moved to Trenton, New Jersey, before returning to her parents' native country, where her father was a university professor. Davidtz studied at Rhodes University. Her acting started with the National Theatre Company's \"Romeo & Juliet\" for which she received good reviews. She got a small role in South African-filmed American horror, Mutator (1989). She moved to Los Angeles in 1992, and landed a role in her first American film, Sam Raimi's Army of Darkness (1992). Also, she appeared Television film Union mortelle (1992). After Director Steven Spielberg cast her in Schindler's List (1993) as Helen Hirsch. In Matilda (1996), based on Roald Dahl's children's book, she played the role of Miss Honey. She is most often recognized for her role in this film. She also starred in the Bicentennial Man (1999), which was released in 1999. She got a supporting role in the film Bridget Jones's Diary (2001), as Natasha. Also in 2001, her role included horror thrillers Thir13en Ghosts (2001). In 2009, she played Felicia Koons on Californication season 3. Davidtz played in Marc Webb's Spider-Man reboots, as Peter Parker's mother, Mary Parker. She married Jason Sloane on June, 2002.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDU5NzQzMTkyMl5BMl5BanBnXkFtZTcwMjQ2OTUwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001110","name":"Embeth Davidtz","idIMDB":"nm0001110"},"actorId":"nm0001110","character":"Sheila","urlCharacter":"http://www.imdb.com/character/ch0058298","main":true},{"actorName":"Marcus Gilbert","urlProfile":"http://www.imdb.com/name/nm0317956","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA2YjcwMmMtOGZiNi00M2M1LTk5ZGYtNTllNzY5ZDhiMzM1XkEyXkFqcGdeQXVyMzE3OTU5Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 July 1958","placeOfBirth":" UK","height":"6' 2\" (1.88 m)","bio":"Marcus Gilbert was born on July 29, 1958 in the UK. He is an actor, known for Army of Darkness (1992), Rambo III (1988) and Riders (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODA2YjcwMmMtOGZiNi00M2M1LTk5ZGYtNTllNzY5ZDhiMzM1XkEyXkFqcGdeQXVyMzE3OTU5Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0317956","name":"Marcus Gilbert","idIMDB":"nm0317956"},"actorId":"nm0317956","character":"Lord Arthur","urlCharacter":"http://www.imdb.com/character/ch0074829","main":true},{"actorName":"Ian Abercrombie","urlProfile":"http://www.imdb.com/name/nm0000718","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NTI2MjM4MF5BMl5BanBnXkFtZTYwMTM4NzU1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 September 1934","placeOfBirth":" Grays, Essex, England, UK","bio":"Ian Abercrombie began his theatrical career as a lad during the Blitz in World War II. After his footwork years during which he earned Bronze, Silver and Gold medals in dance for the stage, he performed in London, Holland, Ireland and Scotland. He made his American stage debut in 1955 in a production of \"Stalag 17\" with Jason Robards and Jules Munshin. Many plays in summer stock, regional and off-Broadway followed in a variety of theatrical offerings, from revues to Shakespeare (in a particularly low period, he worked as a magician's assistant for $10 a performance). In 1957 Ian was drafted into the army and stationed in Germany. He was in Special Services, where he directed the Continental premiere of \"Separate Tables\" and toured with Olivia de Havilland in her show. Back in the US, Ian went to California for a backers' audition. That fizzled but he began his long and successful film and television career. For the past 40 years, his theatrical work highlights have included; \"As You Like It\", \"Hamlet\", \"Misalliance\", \"The Good Doctor\", \"The Way Of The World\", \"Mary Stuart\", \"Crucifer Of Blood\", \"Journey's End\", \"The Wrong Box\", \"The Cocktail Party\", \"Bert & Maisy\", \"Other Places\", \"Bent\", \"Natural Causes\", \"The Vortex\", \"Rough Crossing\", \"Africa\", \"Road & Lettice\" and \"Lovage\". He received awards for his work in \"Sweet Prince\" with Keir Dullea, \"Teeth N'smiles\", \"A Doll's House\" with Linda Purl and \"The Arcata Promise\" opposite Anthony Hopkins. He also received acclaim for the one-man show \"Jean Cocteau - A Mirror Image\". Recently a highlight was playing Alfie Doolittle in \"My Fair Lady\". Ian is also in great demand for voice-work on radio, CD-ROMS, films and commercials.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc4NTI2MjM4MF5BMl5BanBnXkFtZTYwMTM4NzU1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000718","name":"Ian Abercrombie","idIMDB":"nm0000718"},"actorId":"nm0000718","character":"Wiseman","urlCharacter":"http://www.imdb.com/character/ch0133134","main":true},{"actorName":"Richard Grove","urlProfile":"http://www.imdb.com/name/nm0343988","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTcwNDg3OF5BMl5BanBnXkFtZTcwNDk5MTcyMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1955","placeOfBirth":" Phoenix, Arizona, USA","birthName":"Ricky Grove","height":"6' 2\" (1.88 m)","bio":"Ricky Grove was born in Phoenix, Arizona in 1955. He attended Arizona State University where he earned a BFA in Directing. Not long after graduation, Ricky was accepted at the Yale School of Drama in the late 1970's. He received in Master's Degree in Acting in 1983 and moved to New York City not long after. For the next several years, Ricky worked in regional theatre and eventually settled in Aspen, Colorado, where he worked with the Snowmass Repertory Theatre for several years. Eventually, he moved to Los Angeles where he began appearing in films such as \"Army of Darkness\" and television shows like \"ER\". In the mid-90s, Ricky began extensive work with an avant-garde theatre company in Santa Monica, called \"City Garage\". There he worked on plays such as \"Jungle of Cities\" by Bertolt Brecht and \"Journeys Among the Dead\" by Eugene Ionesco. At present, Ricky is working as a voice director/actor in machinima (animated 3d films shot inside of video games) and as a sound designer.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA5NTcwNDg3OF5BMl5BanBnXkFtZTcwNDk5MTcyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0343988","name":"Richard Grove","idIMDB":"nm0343988"},"actorId":"nm0343988","character":"Duke Henry the Red","urlCharacter":"http://www.imdb.com/character/ch0031036","main":true},{"actorName":"Timothy Patrick Quill","urlProfile":"http://www.imdb.com/name/nm0703595","urlPhoto":"","biography":{"birthName":"Timothy Joseph Quill","bio":"Timothy Patrick Quill was born in Detroit, Michigan, USA as Timothy Joseph Quill. He is an actor and writer, known for Spider-Man (2002), Army of Darkness (1992) and Spider-Man 3 (2007).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0703595","name":"Timothy Patrick Quill","idIMDB":"nm0703595"},"actorId":"nm0703595","character":"Blacksmith","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Earl Reid","urlProfile":"http://www.imdb.com/name/nm0717369","urlPhoto":"","biography":{"bio":"Michael Earl Reid is an actor, known for Army of Darkness (1992), The Hudsucker Proxy (1994) and Two Over Easy (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0717369","name":"Michael Earl Reid","idIMDB":"nm0717369"},"actorId":"nm0717369","character":"Gold Tooth","urlCharacter":"http://www.imdb.com/character/ch0031487","main":true},{"actorName":"Bridget Fonda","urlProfile":"http://www.imdb.com/name/nm0000403","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMzk5OTQzNl5BMl5BanBnXkFtZTYwMjc0OTk0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 January 1964","placeOfBirth":" Los Angeles, California, USA","birthName":"Bridget Jane Fonda","height":"5' 6\" (1.68 m)","bio":"Bridget Jane Fonda was born in Los Angeles, California, to Susan Brewer and actor Peter Fonda. She is the granddaughter of Henry Fonda and niece of Jane Fonda, both famous actors. Bridget made her film debut at age five as an extra in Easy Rider (1969), but first became interested in acting after appearing in a high school production of \"Harvey.\" At age 18, she enrolled at New York University and spent four years there and at the Lee Strasberg Theatre Institute. She went on to hone her craft in workshop productions and worked on such stage projects as \"Just Horrible,\" written by Nicholas Kazan, who later cast Bridget in his directorial debut, \"Professional Man,\" an episode for The Edge (1989) series on HBO. She also starred in PBS's Jacob Have I Loved (1989) and in a segment of Aria (1987), a film composed of short works by 10 respected directors. Bridget Fonda's film credits include The Godfather: Part III (1990), Strapless (1989), Doc Hollywood (1991), Singles (1992), and Single White Female (1992).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzMzk5OTQzNl5BMl5BanBnXkFtZTYwMjc0OTk0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000403","name":"Bridget Fonda","idIMDB":"nm0000403"},"actorId":"nm0000403","character":"Linda","urlCharacter":"http://www.imdb.com/character/ch0031489","main":true},{"actorName":"Patricia Tallman","urlProfile":"http://www.imdb.com/name/nm0848191","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MzE5NzU0Nl5BMl5BanBnXkFtZTcwODY4MDEwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"4 September 1957","placeOfBirth":" Pontiac, Illinois, USA","height":"5' 8\" (1.73 m)","bio":"When she portrayed \"Lyta Alexander\" in the Hugo Award-winning sci-fi series Babylon 5 (1994), Patricia Tallman was the most powerful telepath in the universe. Seems fitting, considering that the actress knew she was going to be in show business at the early age of two. It was then that she first appeared with her father, Jerry, on his Midwest radio show, soloing on \"Bicycle Built for Two\". By age 15, Pat was performing in summer stock at the Red Barn Theatre in Saugatuck, Michigan, doing ten shows in 11 weeks. She soon spent all of her high school vacations in professional summer stock, and eventually chose Carnegie Mellon University to earn a BFA in its prestigious theater arts program. While other theater majors waited tables, Pat worked her way through college, performing in eighteen musicals at the Pittsburgh Civic Light Opera. Recognizing Pat's formidable talents, CMU presented her with an award for Outstanding Achievement in Acting. Immediately after college, Pat moved to New York City, where she landed a role in the long-running off-Broadway hit \"Big, Bad Burlesque\". She went on to score other parts on the New York stage, including her favorite, \"Rosalind\" in the Riverside Shakespeare Company's production of \"As You Like It\". Television roles began shortly thereafter, when Pat was cast in a recurring role on the CBS soap opera, Guiding Light (1952). This led to roles on virtually every New York-based daytime serial. Film roles were not far behind. George A. Romero contacted her to play a role in his feature Knightriders (1981), starring Ed Harris. This led to a long working relationship with him. Pat relocated to Los Angeles , where she again worked with Romero on Creepshow 2 (1987). The film she is perhaps best known for followed: George Romero and Tom Savini's remake of the 1968 cult classic, Night of the Living Dead (1990). The move to L.A. was a smart one, Pat discovered, as she was soon cast as undercover cop \"Christy Russell\" on NBC's Generations (1993), and as an evil, sexy swashbuckler in the Ring of the Musketeers (1992). Other films include Sweet Justice (1992), Benefit of the Doubt (1993), Austin Powers: International Man of Mystery (1997) and Austin Powers: The Spy Who Shagged Me (1999). Television shows include Star Trek: The Next Generation (1987), Star Runner (1990) (A USA Network pilot), Dark Skies (1996), Babylon 5 (1994) and \"The Universe and Harry Morgann\" (an independent pilot). Pat's other projects include starring in the science-fiction thriller Never Die Twice (2001) and playing one of the leads, Lt. Richmond, in two audio plays, \"Lives of the Cat\" and \"Anne Manx\". In addition, her voice can be heard in the cartoon \"Babylon 5\" parodies Babylon Park: Frightspace (1999) and Grudge Match (2000). Equally important to Patricia are her roles of mother to son her Julian, as well as her fund-raising activities for the children of Penny Lane. Through her tireless efforts within the science fiction community, Pat and her fans have contributed more than $250,000 to Penny Lane over the past several years, the bulk of which transformed the CARE Computer Lab dream into reality. Since 1996, Pat, her friends, family and fans have made a holiday happen for the Penny Lane kids, through the Be A Santa program. Dedicated Patricia Tallman fans make a hobby of trying to spot her in her many stunt performances. An extremely athletic and former fearless member of the Stunt Woman's Association of Motion Pictures, Pat has tumbled, slid and taken punches for the likes of Laura Dern (in Jurassic Park (1993)), Gates McFadden (in \"Star Trek: Generations\"), Geena Davis (in The Long Kiss Goodnight (1996)) and Laura Prepon (in Karla (2006)). Pat's roots as a stage actress have never left her, and she continues to tread the footlights in Los Angeles whenever film and TV work allow her the time. Her latest projects include Dead Air (2009), a psychological horror film directed by Corbin Bernsen, for which her performance is getting great reviews. Pat has a book out \"Pleasure Thresholds, Patricia Tallman's Babylon 5 Memoirs\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE3MzE5NzU0Nl5BMl5BanBnXkFtZTcwODY4MDEwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0848191","name":"Patricia Tallman","idIMDB":"nm0848191"},"actorId":"nm0848191","character":"Possessed Witch","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ted Raimi","urlProfile":"http://www.imdb.com/name/nm0001646","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNTIwMTI4Nl5BMl5BanBnXkFtZTcwNjQ3OTExOQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 December 1965","placeOfBirth":" Detroit, Michigan, USA","birthName":"Theodore R. Raimi","height":"6' 2\" (1.88 m)","bio":"Ted Raimi was born on December 14, 1965 in Detroit, Michigan, USA as Theodore R. Raimi. He is an actor and writer, known for Ash vs Evil Dead (2015), Spider-Man 3 (2007) and The Midnight Meat Train (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjIxNTIwMTI4Nl5BMl5BanBnXkFtZTcwNjQ3OTExOQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001646","name":"Ted Raimi","nicknames":["Theo"],"idIMDB":"nm0001646"},"actorId":"nm0001646","character":"Cowardly Warrior / Second Supportive Villager / S-Mart Clerk","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Deke Anderson","urlProfile":"http://www.imdb.com/name/nm0026610","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzM5ODA4OTkyNl5BMl5BanBnXkFtZTgwMDE2NDQ2NDE@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 March 1959","placeOfBirth":" Reno, Nevada, USA","birthName":"Dee Christian Anderson","bio":"An all state football player at 138lbs playing Center for the Champion Reno Huskies - became a 4 time state champion Body builder while owning the largest Bodybuilding Gym in Northern Nevada. Deke employed Kane Hodder \"Jason in Friday the 13th\", while singing Opera and performing professionally at The Pioneer Theatre Auditorium. Moved to Los Angeles in 1982 and was Taft-Hartlied into SAG on his first job. 37 years in the business both in front and behind the camera.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzM5ODA4OTkyNl5BMl5BanBnXkFtZTgwMDE2NDQ2NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0026610","name":"Deke Anderson","idIMDB":"nm0026610"},"actorId":"nm0026610","character":"Mini-Ash #1","urlCharacter":"http://www.imdb.com/character/ch0003609","main":true},{"actorName":"Bruce Thomas","urlProfile":"http://www.imdb.com/name/nm0858573","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIwNTIzNDYzOV5BMl5BanBnXkFtZTgwNzMwNzc1NDE@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1961","placeOfBirth":" USA","height":"6' 2½\" (1.89 m)","bio":"Bruce Thomas was born on May 17, 1961 in the USA. He is known for his work on Army of Darkness (1992), Legally Blonde (2001) and Kyle XY (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTIwNTIzNDYzOV5BMl5BanBnXkFtZTgwNzMwNzc1NDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0858573","name":"Bruce Thomas","idIMDB":"nm0858573"},"actorId":"nm0858573","character":"Mini-Ash #2","urlCharacter":"http://www.imdb.com/character/ch0003609","main":true},{"actorName":"Sara Shearer","urlProfile":"http://www.imdb.com/name/nm0790460","urlPhoto":"","biography":{"bio":"Sara Shearer is known for her work on Army of Darkness (1992), Mr. Church (2016) and Engaging Peter (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0790460","name":"Sara Shearer","idIMDB":"nm0790460"},"actorId":"nm0790460","character":"Old Woman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shiva Gordon","urlProfile":"http://www.imdb.com/name/nm0330608","urlPhoto":"","biography":{"dateOfBirth":"12 November 1973","placeOfBirth":" Tehran, Iran","birthName":"Shiva Bagheri","height":"5' 2\" (1.57 m)","bio":"Shiva Gordon was born on November 12, 1973 in Tehran, Iran as Shiva Bagheri. She is an actress, known for Army of Darkness (1992), Doogie Howser, M.D. (1989) and A Brand New Life (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0330608","name":"Shiva Gordon","nicknames":["Gumby"],"idIMDB":"nm0330608"},"actorId":"nm0330608","character":"Pit Deadite #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Billy Bryan","urlProfile":"http://www.imdb.com/name/nm0116901","urlPhoto":"","biography":{"bio":"Billy Bryan is known for his work on Dreamcatcher (2003), The Village (2004) and Bicentennial Man (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0116901","name":"Billy Bryan","idIMDB":"nm0116901"},"actorId":"nm0116901","character":"Pit Bitch","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0106308","urlIMDB":"http://www.imdb.com/title/tt0106308","business":{"budget":{"money":"$11,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$4,424,000","country":"USA","day":"21","month":"02","year":"1993","remarks":"1,387 Screens"}],"gross":[{"money":"$3,133,242 (Germany)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":"15","month":"09","year":"1993","remarks":""},{"money":"ITL 1,583,000,000","country":"Italy","day":"01","month":"04","year":"1993","remarks":""},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1991/\">1991</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 21 min (81 min)","1 hr 36 min (96 min) (director's cut)","1 hr 28 min (88 min) (international cut)"],"soundMix":["Dolby SR"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":["Arriflex Cameras and Lenses"],"laboratory":["Consolidated Film Industries (CFI), Hollywood (CA), USA (processing)","DeLuxe, Hollywood (CA), USA"],"filmLength":["2,431 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"7.6","metascore":"57","filmingLocations":[{"location":"Acton, California, USA"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1994","titlesAwards":[{"titleAwardOutcome":"Won Saturn Award","categories":[{"category":"Best Horror Film","names":[]}]},{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Make-Up","names":[]}]}]},{"award":"Avoriaz Fantastic Film Festival 1993","titlesAwards":[{"titleAwardOutcome":"Nominated Grand Prize","categories":[{"category":"","names":[{"name":"Sam Raimi","id":"nm0000600","role":null}]}]}]},{"award":"Brussels International Festival of Fantasy Film (BIFFF) 1993","titlesAwards":[{"titleAwardOutcome":"Won Golden Raven","categories":[{"category":"","names":[{"name":"Sam Raimi","id":"nm0000600","role":null}]}]}]},{"award":"Fangoria Chainsaw Awards 1993","titlesAwards":[{"titleAwardOutcome":"Won Chainsaw Award","categories":[{"category":"Best Actor","names":[{"name":"Bruce Campbell","id":"nm0132257","role":null}]},{"category":"Best Supporting Actress","names":[{"name":"Embeth Davidtz","id":"nm0001110","role":null}]}]}]},{"award":"Fangoria Chainsaw Awards 1992","titlesAwards":[{"titleAwardOutcome":"Won Chainsaw Award","categories":[{"category":"Best Special Makeup Effects - Feature Films","names":[{"name":"Tony Gardner","id":"nm0307123","role":null},{"name":"Alterian","id":null,"role":null}]}]}]},{"award":"Fantasporto 1993","titlesAwards":[{"titleAwardOutcome":"Won Critics' Award","categories":[{"category":"","names":[{"name":"Sam Raimi","id":"nm0000600","role":null}]}]},{"titleAwardOutcome":"Nominated International Fantasy Film Award","categories":[{"category":"Best Film","names":[{"name":"Sam Raimi","id":"nm0000600","role":null}]}]}]},{"award":"Park City Film Music Festival 2012","titlesAwards":[{"titleAwardOutcome":"Won Distinguished Artist Award","categories":[{"category":"","names":[{"name":"Conrad Pope","id":"nm0691100","role":null},{"name":"My Week with Marilyn","id":"tt1655420","role":null},{"name":"The Presence","id":"tt1298594","role":null},{"name":"In My Sleep","id":"tt0326965","role":null},{"name":"Pavilion of Women","id":"tt0244709","role":null},{"name":"The Rising Place","id":"tt0201020","role":null},{"name":"Seabiscuit","id":"tt0329575","role":null},{"name":"Julie & Julia","id":"tt1135503","role":null},{"name":"The Curious Case of Benjamin Button","id":"tt0421715","role":null},{"name":"Harry Potter and the Deathly Hallows: Part 1","id":"tt0926084","role":null}]}]}]},{"award":"Rondo Hatton Classic Horror Awards 2015","titlesAwards":[{"titleAwardOutcome":"Won Rondo Statuette","categories":[{"category":"BEST CLASSIC DVD","names":[{"name":"Sam Raimi","id":"nm0000600","role":null}]},{"category":"Best Restoration","names":[{"name":"Sam Raimi","id":"nm0000600","role":null}]}]}]},{"award":"Scream Awards 2006","titlesAwards":[{"titleAwardOutcome":"Won Scream Award","categories":[{"category":"Best Comic-To-Screen Adaptation","names":[]}]}]},{"award":"Sitges - Catalonian International Film Festival 1992","titlesAwards":[{"titleAwardOutcome":"Nominated Best Film","categories":[{"category":"","names":[{"name":"Sam Raimi","id":"nm0000600","role":null}]}]}]},{"award":"The Saturn Awards 1994","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Makeup","names":[{"name":"Tony Gardner","id":"nm0307123","role":null}]}]}]}],"votes":"135,739","type":"Movie","companyCreditsSimple":[{"idCompany":"co0014380","name":"Dino De Laurentiis Company"},{"idCompany":"co0047594","name":"Renaissance Pictures"},{"idCompany":"co0005073","name":"Universal Pictures"}],"keywords":{"keywords":["necronomicon","evil dead","skeleton soldier","reluctant hero","battle","army of the dead","car","quest","discount store","castle","shotgun","chainsaw","skeleton warrior","oldsmobile","alternate ending","1990s","over the top","one liner","head spin","windmill","time travel","book of the dead","fish out of water","slave","medieval times","chosen one","doppelganger","possession","army","evil","kingdom","1300s","book","year 1300","prisoner","magic","20th century","fight","tongue in cheek","pit","sequel","skeleton","violence","supernatural power","bare breasts","absurdism","gate","pigtails","captive","portcullis","braids","whip","chained","citadel","uniform","banner","sword","panic","desert","fear","vortex","scream","fortress","sumerian","gunshot","cabin","salesclerk","forest","thunder","graveyard","beast","gravestone","enchantment","full moon","skull","fireplace","monster","woods","nudity","search","midget","creature","singing","fistfight","face slap","battle axe","chainmail","arrow","cart","spell","demon","farce","statue","torch","freak","gore","mist","spit in the face","running","soldier","scar","ogre","horseback","automobile","duke","blood splatter","year 1992","same actor playing two characters simultaneously on screen","same actor playing two characters","miniature person","wise man","voice over flashback","two headed person","metal hand","double barreled shotgun","demonic undead","artificial hand","alternate version","12 gauge shotgun","14th century","hand to hand combat","fighting","battlefield","duel","lance","bow and arrow","shot with a bow and arrow","spear","shield","kiss","repeating rifle","winchester rifle","disarming someone","fictional war","ambush","gun fu","gun violence","combat","sex","stylized violence","sword and fantasy","sword and sorcery","sword duel","mixed martial arts","martial arts","tough guy","opening action scene","one against many","one man army","action hero","hero","war cry","third part","dark fantasy","bagpipes","slapstick comedy","three word title","voice over narration","surrealism","explosive","cult figure","cult film","steampunk","good versus evil","h.p. lovecraft","sequel to cult horror","cult film reference","cult director","book of evil","warrior","tragic hero","psychotronic","damsel in distress","epic","anti hero","lightning","animate skeleton","sequel to cult favorite","black comedy","shot in the face","battering ram","chemistry","severed hand","witch","crossbow","anvil","car accident","axe","spoof","mirror","knight","sword fight","horse","armor","flaming arrow","dismemberment","impalement","avant garde","archery","england","undead","blood","cemetery","evil twin","prosthetic limb","actor playing multiple roles","prophecy","animate object","decapitation","trampoline","catapult","blacksmith","curse","siege","prologue","chase","human duplication","reverse footage","levitation","part stop motion","hit in the crotch","surprise ending","evil skeleton monster","boomstick","zombie"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:13:35"}}