{"data":{"movies":[{"title":"Super Mario Bros.","originalTitle":"","year":"1993","releaseDate":"19930528","directors":[{"name":"Annabel Jankel","id":"nm0417708"},{"name":"Rocky Morton","id":"nm0608084"}],"writers":[{"name":"Parker Bennett","id":"nm0071970"},{"name":"Terry Runte","id":"nm0750344"}],"runtime":"104 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzRmNGY0NTctYTNkNC00M2FkLWI0ZTgtYTE5ODhiZjYxMDkxXkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1.jpg","countries":["UK","USA"],"languages":["English"],"genres":["Adventure","Comedy","Family","Fantasy","Sci-Fi"],"plot":"Can you make a movie out of a video game? That's the question that is answered by this film. Mario Mario and Luigi Mario, two hard working plumbers find themselves in an alternate universe where evolved dinosaurs live in medium hi-tech squalor. They find themselves the only hope to save the Earth from invasion.","simplePlot":"Two Brooklyn plumbers, Mario and Luigi, must travel to another dimension to rescue a princess from the evil dictator King Koopa and stop him from taking over the world.","actors":[{"actorName":"Bob Hoskins","urlProfile":"http://www.imdb.com/name/nm0001364","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MTE0ODQyM15BMl5BanBnXkFtZTYwMTIyNTk1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1942","placeOfBirth":" Bury St. Edmunds, Suffolk, England, UK","birthName":"Robert William Hoskins","height":"5' 6\" (1.68 m)","bio":"Bob Hoskins was born on October 26, 1942, in Bury St. Edmund's, Suffolk, where his mother was living after being evacuated as a result of the heavy bombings. He is the son of Elsie Lillian (Hopkins), a nursery school teacher and cook, and Robert William Hoskins, Sr., who drove a lorry and worked as a bookkeeper. Growing up, Hoskins received only limited education and he left school at 15, but with a passion for language and literature instilled by his former English teacher. A regular theatre-goer, Hoskins dreamed of starring on stage, but before he could do so he had to work odd jobs for a long time to make ends meet. His acting career started out more by accident than by design, when he accompanied a friend to watch some auditions, only to be confused for one of the people auditioning, getting a script pushed into his hands with the message \"You're next\". He got the part and acquired an agent. After some stage success, he expanded to television with roles in television series such as Villains (1972) and Thick as Thieves (1974). In the mid-'70s, he started his film career, standing out when he performed alongside Richard Dreyfuss in John Byrum's Inserts (1975) and in a smaller part in Richard Lester's Royal Flash (1975). Hoskins broke through in 1978 in Dennis Potter's mini TV series, Pennies from Heaven (1978), playing \"Arthur Parker\", the doomed salesman. After this, a string of high-profile and successful films followed, starting with his true major movie debut in 1980's The Long Good Friday (1980) as the ultimately doomed \"Harold Shand\". This was followed by such works as The Cotton Club (1984), Mona Lisa (1986), which won him an Oscar nomination as well as a BAFTA award, Cannes Film Festival and Golden Globe), Who Framed Roger Rabbit (1988) (Golden Globe nomination), Mermaids (1990), Hook (1991), Nixon (1995), Le voyage de Felicia (1999) and Enemy at the Gates (2001). Hoskins always carefully balanced the riches of Hollywood with the labor of independent film, though leaned more towards the latter than the former. He worked at smaller projects such as Shane Meadows' debut 24 7: Twenty Four Seven (1997), in which he starred as \"Allen Darcy\". Besides this, he found time to direct, write and star in The Raggedy Rawney (1988), as well as direct and star in Rainbow (1995), and contributing to HBO's Tales from the Crypt (1989) and Tube Tales (1999). Suffering from Parkinson's disease in later years, Hoskins died of pneumonia at age 71 in a London hospital.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MTE0ODQyM15BMl5BanBnXkFtZTYwMTIyNTk1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001364","name":"Bob Hoskins","nicknames":["The Cockney Cagney"],"idIMDB":"nm0001364"},"actorId":"nm0001364","character":"Mario Mario","urlCharacter":"http://www.imdb.com/character/ch0039169","main":true},{"actorName":"John Leguizamo","urlProfile":"http://www.imdb.com/name/nm0000491","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEyMjMxNDg5NF5BMl5BanBnXkFtZTcwNzczOTY4MQ@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 July 1964","placeOfBirth":" Bogotá, Colombia","birthName":"John Alberto Leguizamo","height":"5' 7\" (1.7 m)","bio":"Fast-talking and feisty-looking John Leguizamo has continued to impress movie audiences with his versatility: he can play sensitive and naive young men, such as Johnny in Hangin' with the Homeboys (1991); cold-blooded killers like Benny Blanco in Carlito's Way (1993); a heroic Army Green Beret, stopping aerial terrorists in Executive Decision (1996); and drag queen Chi-Chi Rodriguez in To Wong Foo Thanks for Everything, Julie Newmar (1995). Arguably, not since ill-fated actor and comedian Freddie Prinze starred in the smash TV series Chico and the Man (1974) has a youthful Latino personality had such a powerful impact on critics and fans alike. Leguizamo was born July 22, 1964, in Bogotá, Colombia, to Luz and Alberto Leguizamo. He was four when his family emigrated to the United States. He was raised in Queens, New York, attended New York University and studied under legendary acting coach Lee Strasberg for only one day before Strasberg passed away. The extroverted Leguizamo started working the comedy club circuit in New York and first appeared in front of the cameras in an episode of Miami Vice (1984). His first film appearance was a small part in Cocaïne (1984), and he had minor roles in Casualties of War (1989) and Die Hard 2 (1990) before playing a liquor store thief who shoots Harrison Ford in Regarding Henry (1991). His career really started to soar after his first-rate performance in the independent film Hangin' with the Homeboys (1991) as a nervous young teenager from the Bronx out for a night in brightly lit Manhattan with his buddies, facing the career choice of staying in a supermarket or heading off to college and finding out that the girl he loves from afar isn't quite what he thought she was. The year 1991 was also memorable for other reasons, as he hit the stage with his show Mambo Mouth (1991), in which he portrayed seven different Latino characters. The witty and incisive show was a smash hit and won the Obie and Outer Circle Critics Award, and later was filmed for HBO, where it picked up a CableACE Award. He returned to the stage two years later with another satirical production poking fun at Latino stereotypes titled John Leguizamo: Spic-O-Rama (1993). It played in Chicago and New York, and won the Drama Desk Award and four CableACE Awards. In 1995 he created and starred in the short-lived TV series House of Buggin' (1995), an all-Latino-cast comedy variety show featuring hilarious sketches and comedic routines. The show scored two Emmy nominations and received positive reviews from critics, but it was canceled after only one season. The gifted Leguizamo was still keeping busy in films, with key appearances in Super Mario Bros. (1993), Romeo + Juliet (1996) and Spawn (1997). In 1998 he made his Broadway debut in John Leguizamo: Freak (1998), a \"demi-semi-quasi-pseudo-autobiographical\" one-man show, which was filmed for HBO by Spike Lee. Utilizing his distinctive vocal talents, he next voiced a pesky rat in Doctor Dolittle (1998) before appearing in the dynamic Spike Lee-directed Summer of Sam (1999) as a guilt-ridden womanizer, as the Genie of The Lamp in the exciting Arabian Nights (2000) and as Henri DE Toulouse Lautrec in the visually spectacular Moulin Rouge (2001). He also voiced Sid in the animated Ice Age (2002), co-starred alongside Arnold Schwarzenegger in Collateral Damage (2002) and directed and starred in the boxing film Undefeated (2003). Afterward, Leguizamo starred in the remake of the John Carpenter hit Assaut sur le central 13 (2005) and George A. Romero's long-awaited fourth \"Dead\" film, Land of the Dead - Le territoire des morts (2005). There can be no doubt that the remarkably talented Leguizamo has been a breakthrough performer for the Latino community in mainstream Hollywood, in much the same way that Sidney Poitier crashed through celluloid barriers for African-Americans in the early 1960s. Among his many strengths lies his ability to not take his ethnic background too seriously but also to take pride in his Latino heritage. He has opened many doors for his countrymen. A masterly and accomplished performer, movie audiences await Leguizamo's next exciting performance.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTEyMjMxNDg5NF5BMl5BanBnXkFtZTcwNzczOTY4MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000491","name":"John Leguizamo","nicknames":["Johnny Legs","John Leguizama"],"idIMDB":"nm0000491"},"actorId":"nm0000491","character":"Luigi Mario","urlCharacter":"http://www.imdb.com/character/ch0008402","main":true},{"actorName":"Dennis Hopper","urlProfile":"http://www.imdb.com/name/nm0000454","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNTQ5Nzg0OF5BMl5BanBnXkFtZTcwMDE2MDE4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 May 1936","placeOfBirth":" Dodge City, Kansas, USA","birthName":"Dennis Lee Hopper","height":"5' 9\" (1.75 m)","bio":"With an amazing cinematic career of more than five decades, Dennis Hopper was a multi-talented and unconventional actor/director, regarded by many as one of the true \"enfants terribles\" of Hollywood. Hopper was born on May 17, 1936 in Dodge City, Kansas, to Marjorie Mae (Davis) and James Millard Hopper. The young Hopper expressed interest in acting from a young age and first appeared in a slew of 1950s television series, including Medic (1954), Cheyenne (1955) and Sugarfoot (1957). His first film role was in Johnny Guitar (1954), which was quickly followed by roles in Rebel Without a Cause (1955), Giant (1956) and Gunfight at the O.K. Corral (1957). Hopper actually became good friends with James Dean and was shattered when Dean was killed in a car crash on September 30, 1955. Hopper portrayed a young Napoléon Bonaparte (!) in the star-spangled The Story of Mankind (1957) and regularly appeared on screen throughout the 1960s, often in rather undemanding parts, usually as a villain in westerns such as True Grit (1969) and Hang 'Em High (1968). However, in early 1969, Hopper, fellow actor Peter Fonda and writer Terry Southern, wrote a counterculture road movie script and managed to scrape together $400,000 in financial backing. Hopper directed the low-budget film, titled Easy Rider (1969), starring Fonda, Hopper and a young Jack Nicholson. The film was a phenomenal box-office success, appealing to the anti-establishment youth culture of the times. It changed the Hollywood landscape almost overnight and major studios all jumped onto the anti-establishment bandwagon, pumping out low-budget films about rebellious hippies, bikers, draft dodgers and pot smokers. However, Hopper's next directorial effort, The Last Movie (1971), was a critical and financial failure, and he has admitted that during the 1970s he was seriously abusing various substances, both legal and illegal, which led to a downturn in the quality of his work. He appeared in a sparse collection of European-produced films over the next eight years, before cropping up in a memorable performance as a pot-smoking photographer alongside Marlon Brando and Martin Sheen in Francis Ford Coppola's Vietnam War epic Apocalypse Now (1979). He also received acclaim for his work in both acting and direction for Garçonne (1980). With these two notable efforts, the beginning of the 1980s saw a renaissance of interest by Hollywood in the talents of Dennis Hopper and exorcising the demons of drugs and alcohol via a rehabilitation program meant a return to invigorating and provoking performances. He was superb in Rumble Fish (1983), co-starred in the tepid spy thriller The Osterman Weekend (1983), played a groovy school teacher in My Science Project (1985), was a despicable and deranged drug dealer in River's Edge (1986) and, most memorably, electrified audiences as foul-mouthed Frank Booth in the eerie and erotic David Lynch film Blue Velvet (1986). Interestingly, the offbeat Hopper was selected in the early 1980s to provide the voice of \"The StoryTeller\" in the animated series of \"Rabbit Ears\" children's films based upon the works of Hans Christian Andersen! Hopper returned to film direction in the late 1980s and was at the helm of the controversial gang film Colors (1988), which was well received by both critics and audiences. He was back in front of the cameras for roles in Super Mario Bros. (1993), got on the wrong side of gangster Christopher Walken in True Romance (1993), led police officer Keanu Reeves and bus passenger Sandra Bullock on a deadly ride in Speed (1994) and challenged gill-man Kevin Costner for world supremacy in Waterworld (1995). The enigmatic Hopper has continued to remain busy through the 1990s and into the new century with performances in The Night We Called It a Day (2003), The Keeper (2004) and Land of the Dead - Le territoire des morts (2005). As well as his acting/directing talents, Hopper was a skilled photographer and painter, having had his works displayed in galleries in both the United States and overseas. He was additionally a dedicated and knowledgeable collector of modern art and has one of the most extensive collections in the United States. Dennis Hopper died of prostate cancer on May 29, 2010, less than two weeks after his 74th birthday.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNTQ5Nzg0OF5BMl5BanBnXkFtZTcwMDE2MDE4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000454","name":"Dennis Hopper","idIMDB":"nm0000454"},"actorId":"nm0000454","character":"King Koopa","urlCharacter":"http://www.imdb.com/character/ch0008408","main":true},{"actorName":"Samantha Mathis","urlProfile":"http://www.imdb.com/name/nm0000526","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MDgyMTU3MV5BMl5BanBnXkFtZTcwMzE1MzY1Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 May 1970","placeOfBirth":" Brooklyn, New York City, New York, USA","height":"5' 5\" (1.65 m)","bio":"Samantha Mathis was born in 1970 in New York, to Donald Mathis and Austrian-born Bibi Besch, an aspiring actress at the time. Her maternal grandmother was actress Gusti Huber. Her first acting job was in a commercial for baby products with her mother. Since her parents divorced when she was only three years old, Samantha was very exposed to the acting industry from a very young age, which made her almost destined to become an actress. Samantha's first feature film was Pump Up the Volume (1990) opposite her on- and off-screen love at the time, Christian Slater.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MDgyMTU3MV5BMl5BanBnXkFtZTcwMzE1MzY1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000526","name":"Samantha Mathis","nicknames":["Sammy"],"idIMDB":"nm0000526"},"actorId":"nm0000526","character":"Daisy","urlCharacter":"http://www.imdb.com/character/ch0558485","main":true},{"actorName":"Fisher Stevens","urlProfile":"http://www.imdb.com/name/nm0001770","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MTE2NTMxM15BMl5BanBnXkFtZTYwNjkwMDM0._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 November 1963","placeOfBirth":" Chicago, Illinois, USA","birthName":"Steven Fisher","height":"5' 7\" (1.7 m)","bio":"Fisher Stevens moved from his native Chicago to New York at the age of 13 to pursue an acting career. He tried, unsuccessfully, to get any kind of job and was, he recalls, even rejected as extra for a Crest commercial. When his acting teacher, Dan Fauci, lost the lease to his teaching studio, he rented Fisher's loft and built a stage in the living room. He later studied with Uta Hagen. His first professional theatrical production was playing Tiny Tim's brother, Harry, in the musical version of Dickens' \"A Christmas Carol\" in the basement of an off-off-off Broadway theatre when he was 14. Since then he has performed in more than 20 stage productions including 544 performances in Harvey Fierstein's \"Torch Song Triology\", both on and off Broadway. He also played Eugene in Neil Simon's \"Brighton Beach Memories\". Most recently, he played the leads in Thomas Babe's \"Carrying School Children\", \"Almost Romance\" opposite Helen Slater and Jules Feiffer's \"Little Murders\" with Christine Lahti. He also sang and danced in the musicals \"Miami\" by Wendy Wasserstein and the late Michael Bennett's Broadway production of \"Scandal\" with Swoosie Kurtz and Treat Williams. He also appeared in the recent New York City Shakespeare Festival production of \"A Midsummer Nights Dream\". Fisher made his motion picture debut getting his fingers chopped off in the horror film The Burning (1981) when he was 16-years-old. After that he appeared in Baby It's You (1983) and The Brother from Another Planet (1984). He co-starred with Matt Dillon in the hit comedy film The Flamingo Kid (1984) where he met the then fledgling producer Gary Foster. He appeared as sidekick to Steve Guttenberg's character in Short Circuit (1986). In television he has performed in ABC's Ryan's Hope (1975), Showtime's Tall Tales & Legends (1985) and CBS' Early Edition (1996). Despite having lived in New York City for more than a decade, where, with some other actors, Stevens has started an off-off-off Broadway theatre company called Naked Angels, he insists that he is still a fan of the Chicago Cubs.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MTE2NTMxM15BMl5BanBnXkFtZTYwNjkwMDM0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001770","name":"Fisher Stevens","idIMDB":"nm0001770"},"actorId":"nm0001770","character":"Iggy","urlCharacter":"http://www.imdb.com/character/ch0008407","main":true},{"actorName":"Richard Edson","urlProfile":"http://www.imdb.com/name/nm0002057","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NzYwNjEyNl5BMl5BanBnXkFtZTcwOTk2NDE1Mg@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 January 1954","placeOfBirth":" New Rochelle, New York, USA","height":"5' 11½\" (1.82 m)","bio":"The great character actor Richard Edson's first feature film role came in Jim Jarmusch's 1983 cult hit, Stranger Than Paradise (1984), where he played \"Eddie\", one of the main characters. Edson then had small, but memorable, roles in other big hits such as Desperately Seeking Susan (1985), John Hughes' Ferris Bueller's Day Off (1986), Oliver Stone's great Vietnam-movie Platoon (1986), Barry Levinson's Good Morning, Vietnam (1987) and, in 1989, Edson starred in Spike Lee's Do the Right Thing (1989). In 1993, he played \"Spike\", one of the evil King Koopa's henchmen, in Super Mario Bros. (1993) and, in 1995, he had a part in the engaging sci-fi thriller, Strange Days (1995). More recently, he has appeared in the remake of Starsky & Hutch (2004), the dubious horror-flick, Frankenfish (2004) and is currently starring with Tom Arnold in The Kid & I (2005). In addition to his film success, Edson has had a fascinating career in music, being the original drummer in the New York post-punk band, Sonic Youth, and spending three years as drummer for the rhythmic dance band, Konk. It was his involvement in Konk and the New York art scene that caught Jim Jarmusch's eye and led to his being cast in Stranger Than Paradise (1984). Edson currently lives in Los Angeles where, in addition to acting, he is very active in music, writing and photography.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg1NzYwNjEyNl5BMl5BanBnXkFtZTcwOTk2NDE1Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002057","name":"Richard Edson","idIMDB":"nm0002057"},"actorId":"nm0002057","character":"Spike","urlCharacter":"http://www.imdb.com/character/ch0041340","main":true},{"actorName":"Fiona Shaw","urlProfile":"http://www.imdb.com/name/nm0789716","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0OTE5OTU2MV5BMl5BanBnXkFtZTcwNTk3NTc1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 July 1958","placeOfBirth":" County Cork, Ireland","birthName":"Fiona Mary Wilson","height":"5' 8\" (1.73 m)","bio":"Fiona Shaw was born July 10, 1958 in County Cork, Ireland. She attended secondary school at Scoil Mhuire in Cork City, and later received a degree in University College Cork. She was trained at the Royal Academy of Dramatic Art (RADA) in London and was part of a contingent of actors to emerge from the college who were considered 'new wave'. While Fiona is first and foremost a product of the stage, she has worked prolifically before-the-camera with performances in My Left Foot (1989), Harry Potter and the Sorcerer's Stone (2001), Harry Potter and the Chamber of Secrets (2002), Harry Potter and the Prisoner of Azkaban (2004), Harry Potter and the Order of the Phoenix (2007), Harry Potter and the Deathly Hallows: Part 1 (2010), Le dahlia noir (2006), and HBO's True Blood (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA0OTE5OTU2MV5BMl5BanBnXkFtZTcwNTk3NTc1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0789716","name":"Fiona Shaw","idIMDB":"nm0789716"},"actorId":"nm0789716","character":"Lena","urlCharacter":"http://www.imdb.com/character/ch0064332","main":true},{"actorName":"Dana Kaminski","urlProfile":"http://www.imdb.com/name/nm0436715","urlPhoto":"","biography":{"bio":"Dana Kaminski is an actress, known for Big (1988), Super Mario Bros. (1993) and B.L. Stryker (1989).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0436715","name":"Dana Kaminski","idIMDB":"nm0436715"},"actorId":"nm0436715","character":"Daniella","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mojo Nixon","urlProfile":"http://www.imdb.com/name/nm0633264","urlPhoto":"","biography":{"dateOfBirth":"2 August 1957","placeOfBirth":" Chapel Hill, North Carolina, USA","birthName":"Neill Kirby McMillan","bio":"Mojo Nixon was born on August 2, 1957 in Chapel Hill, North Carolina, USA as Neill Kirby McMillan.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0633264","name":"Mojo Nixon","idIMDB":"nm0633264"},"actorId":"nm0633264","character":"Toad","urlCharacter":"http://www.imdb.com/character/ch0008411","main":true},{"actorName":"Gianni Russo","urlProfile":"http://www.imdb.com/name/nm0751625","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTgyMTgxODM4MV5BMl5BanBnXkFtZTcwNDg5NDYwOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 December 1943","placeOfBirth":" Manhattan, New York City, New York, USA","birthName":"Louis Russo","bio":"With a singularly nebulous background, which, by his account, included stints as a Las Vegas nightclub emcee, radio personality and jewelry tycoon, and with comparatively little acting experience, Gianni Russo won the role of Carlo Rizzi in The Godfather (1972) on the basis of his screen test. Since then, Russo has remained busy as an actor, mostly playing assorted \"wiseguys\" and Mafia types. He appeared again with Marlon Brando in a small role in The Freshman (1990) where Brando parodied his Don Corleone role to good effect.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTgyMTgxODM4MV5BMl5BanBnXkFtZTcwNDg5NDYwOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0751625","name":"Gianni Russo","idIMDB":"nm0751625"},"actorId":"nm0751625","character":"Scapelli","urlCharacter":"http://www.imdb.com/character/ch0122177","main":true},{"actorName":"Francesca P. Roberts","urlProfile":"http://www.imdb.com/name/nm0731098","urlPhoto":"","biography":{"dateOfBirth":"19 December 1953","placeOfBirth":" USA","height":"5' 10\" (1.78 m)","bio":"Francesca Roberts who hails from Los Angeles studied at the University of New Orleans, Southern Illinois University and L'Ecole de Mime Jacques LeCoq in Paris. She made her film debut in \"Inside Moves\" after amassing considerable television credits. Roberts has also appeared on the stage of North Hollywood's Group Repertory Theatre, New Orleans' Free Southern Theatre, Reseda (California)'s Megaw Theatre, and with Hollywood's Touchstone Group.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0731098","name":"Francesca P. Roberts","idIMDB":"nm0731098"},"actorId":"nm0731098","character":"Bertha","urlCharacter":"http://www.imdb.com/character/ch0041780","main":true},{"actorName":"Lance Henriksen","urlProfile":"http://www.imdb.com/name/nm0000448","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkwOTMyMDEzN15BMl5BanBnXkFtZTcwMjk4NTUyMg@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 May 1940","placeOfBirth":" New York City, New York, USA","birthName":"Lance James Henriksen","height":"5' 10¼\" (1.79 m)","bio":"An intense, versatile actor as adept at playing clean-cut FBI agents as he is psychotic motorcycle-gang leaders, who can go from portraying soulless, murderous vampires to burned-out, world-weary homicide detectives, Lance Henriksen has starred in a variety of films that have allowed him to stretch his talents just about as far as an actor could possibly hope. He played \"Awful Knoffel\" in the TNT original movie Evel Knievel (2004), directed by John Badham and executive produced by Mel Gibson. Henriksen portrayed \"Awful Knoffel\" in this project based on the life of the famed daredevil, played by George Eads. Henriksen starred for three seasons (1996-1999) on Millennium (1996), Fox-TV's critically acclaimed series created by Chris Carter (The X-Files (1993)). His performance as Frank Black, a retired FBI agent who has the ability to get inside the minds of killers, landed him three consecutive Golden Globe nominations for \"Best Performance by a Lead Actor in a Drama Series\" and a People's Choice Award nomination for \"Favorite New TV Male Star\". Henriksen was born in New York City. His mother, Margueritte, was a waitress, dance instructor, and model. His father, James Marin Henriksen, who was from Tønsberg, Norway, was a boxer and merchant sailor. Henriksen studied at the Actors Studio and began his career off-Broadway in Eugene O'Neill's \"Three Plays of the Sea.\" One of his first film appearances was as an FBI agent in Sidney Lumet's Dog Day Afternoon (1975), followed by parts in Lumet's Network (1976) and Prince of the City (1981). He then appeared in Steven Spielberg's Close Encounters of the Third Kind (1977) with Richard Dreyfuss and François Truffaut, Damien: Omen II (1978) and in Philip Kaufman's The Right Stuff (1983), in which he played Mercury astronaut Capt. Wally Schirra. James Cameron cast Henriksen in his first directorial effort, Piranha Part Two: The Spawning (1981), then used him again in The Terminator (1984) and as the android Bishop in the sci-fi classic Aliens (1986). Sam Raimi cast Henriksen as an outrageously garbed gunfighter in his quirky western Mort ou vif (1995). Henriksen has also appeared in what has developed into a cult classic: Kathryn Bigelow's Near Dark (1987), in which he plays the head of a clan of murderous redneck vampires. He was nominated for a Golden Satellite Award for his portrayal of Abraham Lincoln in the TNT original film The Day Lincoln Was Shot (1998). In addition to his abilities as an actor, Henriksen is an accomplished painter and potter. His talent as a ceramist has enabled him to create some of the most unusual ceramic artworks available on the art market today. He resides in Southern California with his wife Jane and their five-year-old daughter Sage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjkwOTMyMDEzN15BMl5BanBnXkFtZTcwMjk4NTUyMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000448","name":"Lance Henriksen","idIMDB":"nm0000448"},"actorId":"nm0000448","character":"The King","urlCharacter":"http://www.imdb.com/character/ch0060422","main":true},{"actorName":"Sylvia Harman","urlProfile":"http://www.imdb.com/name/nm0363434","urlPhoto":"","biography":{"bio":"Sylvia Harman is an actress, known for Super Mario Bros. (1993), Eddie (1996) and The Birds II: Land's End (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0363434","name":"Sylvia Harman","idIMDB":"nm0363434"},"actorId":"nm0363434","character":"Old Lady","urlCharacter":"http://www.imdb.com/character/ch0122180","main":true},{"actorName":"Desiree Marie Velez","urlProfile":"http://www.imdb.com/name/nm0892452","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjIxOTU2N15BMl5BanBnXkFtZTgwNjkzNjQzMDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"height":"5' 2\" (1.57 m)","bio":"Desiree Marie Velez is known for her work on Super Mario Bros. (1993), Asunder (1999) and Number's Alive! (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjIxOTU2N15BMl5BanBnXkFtZTgwNjkzNjQzMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0892452","name":"Desiree Marie Velez","idIMDB":"nm0892452"},"actorId":"nm0892452","character":"Angelica","urlCharacter":"http://www.imdb.com/character/ch0122178","main":true},{"actorName":"Andrea Powell","urlProfile":"http://www.imdb.com/name/nm0004632","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA0MTU1NjM2M15BMl5BanBnXkFtZTcwMzA3NjQ3Mw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 October 1965","placeOfBirth":" Valdosta, Georgia, USA","height":"5' 7\" (1.7 m)","bio":"Andrea Powell was born on October 17, 1965 in Valdosta, Georgia, USA. She is an actress, known for Ender's Game (2013), The Twilight Saga: Breaking Dawn - Part 2 (2012) and Get Low (2009). She has been married to Paul Ferguson since October 15, 1993.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTA0MTU1NjM2M15BMl5BanBnXkFtZTcwMzA3NjQ3Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004632","name":"Andrea Powell","idIMDB":"nm0004632"},"actorId":"nm0004632","character":"Brooklyn Girl","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0108255","urlIMDB":"http://www.imdb.com/title/tt0108255","business":{"budget":{"money":"$42,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":[{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1992/\">1992</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 44 min (104 min)","1 hr 36 min (96 min) (Italy)"],"soundMix":["Dolby Digital"],"color":["Color (Technicolor)"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"4.0","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"PG","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1994","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Costumes","names":[{"name":"Joseph A. Porro","id":"nm0691848","role":null}]},{"category":"Best Make-Up","names":[{"name":"Jeff Goodwin","id":"nm0329480","role":null},{"name":"Vincent J. Guastini","id":"nm0345474","role":null},{"name":"Rob Burman","id":"nm0122201","role":null}]}]}]}],"votes":"39,741","type":"Movie","companyCreditsSimple":[{"idCompany":"co0052092","name":"Allied Filmmakers"},{"idCompany":"co0094483","name":"Cinergi Pictures Entertainment"},{"idCompany":"co0076240","name":"Hollywood Pictures"}],"keywords":{"keywords":["stupidity","based on video game","mario","king","plumber","dinosaur","princess","dictator","rescue","super mario","dimension","parallel dimension","orphan","alternate dimension","improvised weapon","megalomaniac","world domination","fight the system","mugshot","alternate world","news reporter","torture","news report","absurdism","monster","race against time","open ended","parallel world","alternate reality","organized crime","diamond","henchman","cliche","interrogation","police chase","teleportation","desert","pizza","elevator","surrealism","bomb","flamethrower","1990s","arrest","police station","explosion","mutation","transformation","creature","archaeologist","gangster","restaurant","scene after end credits","animated sequence","mafia","campy","black magic","queen","husband wife relationship","super jump","brunette","blonde","sexy woman","boyfriend girlfriend relationship","oldies music","multiple cameos","baseball cap","scally cap","draco reptilian","lifting female in air","troubled production","prison","police","nightclub","italian american","exploding car","abandoned baby","statue of liberty new york city","brooklyn new york city","b movie","cape the garment","three word title","lifting someone into the air","dystopia","goth","slapstick comedy","kidnapping","cult film","damsel in distress","car chase","action hero","action heroine","super villain","cyberpunk","nun","unlikely hero","mutant","magic","good versus evil","surprise after end credits","brother brother relationship","fungus","evolution","new york city","multiple monsters","lizard monster","yelling","royalty","brooklyn bridge","hidden civilization","yoshi","x rayed skeleton","sequel","remake","subterranean","chainsaw","lasersight","independent film","character name in title","title spoken by character","surprise ending"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:35:44"}}