{"data":{"movies":[{"title":"Knight Rider 2000","originalTitle":"","year":"1991","releaseDate":"19910519","directors":[{"name":"Alan J. Levi","id":"nm0505420"}],"writers":[{"name":"Rob Hedden","id":"nm0373154"},{"name":"Glen A. Larson","id":"nm0488991"}],"runtime":"91 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYmMwYjUwMDMtOWE3Zi00MDNhLTkyZDktYWI4ZDkyMDRhOWQxXkEyXkFqcGdeQXVyNjExODE1MDc@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Sci-Fi"],"plot":"In the future, guns are banned and criminals are frozen for the duration of their sentences. A recent spate of killings involving handguns brings Michael Knight back to fight for justice, but he insists of the help of KITT, his artificially-intelligent car from decades ago. The only problem is that KITT has been deactivated.","simplePlot":"In the future, guns are banned and criminals are frozen for the duration of their sentences. A recent spate of killings involving handguns brings Michael Knight back to fight for justice, ... ","actors":[{"actorName":"David Hasselhoff","urlProfile":"http://www.imdb.com/name/nm0001327","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5OTI0NDkxOF5BMl5BanBnXkFtZTcwMjExMTQxMw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 July 1952","placeOfBirth":" Baltimore, Maryland, USA","birthName":"David Michael Hasselhoff","height":"6' 4½\" (1.94 m)","bio":"David Hasselhoff has become one of the most recognizable faces on television and throughout the world. Aside from starring in Knight Rider (1982) and Baywatch (1989), he is also an accomplished singer and popular recording artist. David Michael Hasselhoff was born on July 17, 1952 in Baltimore, Maryland, to Dolores Therese (Mullinex) and Joseph Vincent Hasselhoff, a business executive. He is of German (from his paternal grandfather), English, and Irish descent. The acting bug first hit when David was seven and so he took acting, singing and dancing lessons. He was very shy off stage in front of girls because he was tall and thin, but when he was on stage he was in his element. Due to his father's work, his family (he has four sisters) moved around frequently. He initially thought his career was going to go in the direction of musicals and Broadway. American audiences first came to know Hasselhoff when he portrayed the popular \"Dr. Snapper Foster\" for six seasons on CBS's soap opera, The Young and the Restless (1973). Lured by NBC's Brandon Tartikoff to move from daytime to prime time, Hasselhoff went on to star as \"Michael Knight\" in NBC's hit series Knight Rider (1982). The role garnered him a \"People's Choice Award\" for most popular actor and the show became a huge success overseas. The success of Knight Rider (1982) resulted in Hasselhoff's first major international following. When the show ended, Hasselhoff launched a successful recording career in Europe. In 1989, \"Looking for Freedom\" remained in the number one spot on the German charts for eight consecutive weeks. He has continued to perform regularly in concert and has released nine albums to date. Hasselhoff returned to episodic television as Mitch Buchannon on Baywatch (1989) when the show debuted on NBC in 1989. Though it enjoyed good ratings, the network canceled the series after only one season. Undeterred, Hasselhoff and his partners acquired the rights to the show and, based on Hasselhoff's popularity overseas, they were able to secure financing and revive \"Baywatch\" in 1991. Now a piece of American pop culture and an international television phenomenon, Baywatch (1989) was at its peak seen in 140 countries by over one billion viewers each week. During his lengthy career, Hasselhoff has flexed his acting muscles in numerous other projects. He starred in the epic miniseries Shaka Zulu (1986), shot on-location in Morocco. Hasselhoff is an outdoor sports enthusiast whose interests include scuba diving, hiking, white water rafting, tennis, and jogging. In addition, he has parachuted with the US Army Parachute Demonstration Team, The Golden Knights, and flown with the US Navy's Blue Angels. He is an avid sports fan, and has attended the World Cup Soccer Finals, the NBA Finals, the Olympics, the Indy 500, and the Kentucky Derby. Hasselhoff has traveled throughout Australia, Africa, Asia, Europe, and the Caribbean. He spends many hours visiting children's hospitals throughout the world. His charity, \"Race For Life\", works with the terminally ill and handicapped children in America. He was married to the beautiful actress Pamela Bach-Hasselhoff, with whom he has two daughters, Taylor-Ann and Hayley Amber.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI5OTI0NDkxOF5BMl5BanBnXkFtZTcwMjExMTQxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001327","name":"David Hasselhoff","nicknames":["The Hoff"],"idIMDB":"nm0001327"},"actorId":"nm0001327","character":"Michael Knight","urlCharacter":"http://www.imdb.com/character/ch0023895","main":true},{"actorName":"Edward Mulhare","urlProfile":"http://www.imdb.com/name/nm0611811","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MzI5NDA5M15BMl5BanBnXkFtZTcwMDk2NDYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 April 1923","placeOfBirth":" Cork, Ireland","height":"6' 2½\" (1.9 m)","bio":"Suave Irish-born actor with resonant voice and a commanding presence, who made his theatrical debut in 'The First of Mrs.Fraser' (1942) at the age of 19 at the Cork Opera House. Nine years later, after spells with the Gate Theatre in Dublin and the Liverpool Repertory Company, Mulhare appeared in a Laurence Olivier-directed London production of 'Othello' with Orson Welles. It was there, that he was spotted by Alan Jay Lerner and signed as an understudy to Rex Harrison for the part of Henry Higgins in 'My Fair Lady'. The play ran on Broadway from 1957 to 1962, totalling a massive 2,717 performances. Harrison dropped out of the part in December 1957, and Mulhare, a relative unknown in the U.S., took over the role. This sparked a controversy with Actor's Equity over the hiring of foreign actors, which required a noted labour negotiator to resolve. In the end, Mulhare played Higgins to both audience approval and critical acclaim more than 1,000 times between 1957 and 1960. The play subsequently toured the Soviet Union, before returning to London. On Broadway, Mulhare also replaced Michael Rennie in the leading role of Dirk Winsten in 'Mary,Mary' and starred as Giacome Nerone in Dore Schary's 'The Devil's Advocate', alongside actors Leo Genn and Eduardo Ciannelli. It was ironic, that Mulhare followed in Harrison's footsteps on television as well, playing the part of Captain Daniel Gregg (Harrison's in the 1947 movie), the titular spectre of The Ghost & Mrs. Muir (1968). The popular NBC series updated the setting from turn of the century New England to present day, and, by comparison with its cinematic predecessor, was less sentimental, but wittier by some degree. There was an undeniable on-screen chemistry between co-star Hope Lange and Mulhare, who was Emmy-nominated for his portrayal as the cantankerous, but thoroughly charming captain. From 1982 to 1986, Mulhare also appeared on television as the articulate Devon Miles, David Hasselhoff's boss, in the fantasy series Knight Rider (1982). Surprisingly, Edward Mulhare never achieved star status on the big screen. Among the few films he made, one only remembers his dastardly villains of Our Man Flint (1966) and Caprice (1967). He did, however, continue to make frequent guest appearances on television in series ranging from The Streets of San Francisco (1972) to Battlestar Galactica (1978). In 1988, he also hosted a series about the paranormal, entitled Secrets and Mysteries (1983). Mulhare, a confirmed bachelor, died during filming of the Jack Lemmon/Walter Matthau comedy Out to Sea (1997) at the age of 74.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MzI5NDA5M15BMl5BanBnXkFtZTcwMDk2NDYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0611811","name":"Edward Mulhare","idIMDB":"nm0611811"},"actorId":"nm0611811","character":"Devon Miles","urlCharacter":"http://www.imdb.com/character/ch0023897","main":true},{"actorName":"Susan Norman","urlProfile":"http://www.imdb.com/name/nm0635628","urlPhoto":"","biography":{"bio":"Graduated from Irving High School in Irving, Texas, in 1979. Received a degree in theatre from Trinity University in San Antonio and a MFA in acting from New York University.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0635628","name":"Susan Norman","idIMDB":"nm0635628"},"actorId":"nm0635628","character":"Officer Shawn McCormick","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Carmen Argenziano","urlProfile":"http://www.imdb.com/name/nm0034492","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzdkZWJjNWUtODczNC00NGRhLTllN2QtMzU2N2NkZDI3OTc2XkEyXkFqcGdeQXVyMjc3Njc5NDQ@._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 October 1943","placeOfBirth":" Sharon, Pennsylvania, USA","birthName":"Carmen Antimo Argenziano","height":"5' 10\" (1.78 m)","bio":"Carmen Argenziano was born on October 27, 1943 in Sharpsville, Pennsylvania, as Carmen Antimo Argenziano. He is an actor known for his work on hundreds of films and TV series throughout his fifty year career. He was in The Accused, Stand And Deliver, The Godfather: Part II, Identity, and many more, including James Franco's production of Don Quixote, playing the title character. He played the memorable and well loved character Jacob Carter in the TV series Stargate SG1. He is a Lifetime Member of The Actors Studio.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzdkZWJjNWUtODczNC00NGRhLTllN2QtMzU2N2NkZDI3OTc2XkEyXkFqcGdeQXVyMjc3Njc5NDQ@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0034492","name":"Carmen Argenziano","idIMDB":"nm0034492"},"actorId":"nm0034492","character":"Russell Maddock / K.I.F.T.","urlCharacter":"http://www.imdb.com/character/ch0069490","main":true},{"actorName":"Eugene Clark","urlProfile":"http://www.imdb.com/name/nm0163925","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExNTk2OTYyMTheQTJeQWpwZ15BbWU2MDI4MDY2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 December 1951","placeOfBirth":" Tampa, Florida, USA","birthName":"Eugene Anthony Clark","height":"6' 3\" (1.91 m)","bio":"Eugene Clark Brings Multiple Talents Eugene Clark brings a career in theatre, television and film that is fascinating and diverse. A veteran of more than 100 television productions and 15 feature films, he won a Gemini Award (Canadian Emmy) for Best Supporting Actor in a Dramatic Series for his work on the hit TV series Night Heat. He starred as Mufasa in Disney's The Lion King onstage in Toronto for two years, as Horse in The Charlottetown Festival's production of The Full Monty in P.E.I., and starred as the lead zombie Big Daddy, in George A. Romero's long awaited Land of the Dead. He has appeared in the films Trailer Park Boys - The Movie; Resurrecting the Champ, and the TV series The L. A. Complex; Space Riders - Division Earth; The Latest Buzz, Sue Thomas F B Eye, Wingin' It and The Line. He was the 2nd lead in William Shatner's made for television movie series TekWar. He received critical acclaim for his performance as a suicidal Vietnam veteran who lost his arm to Agent Orange in Unnatural Causes, the Emmy Award winning drama starring John Ritter and Alfre Woodard. Acting is just one of Clark's creative outlets. Singing has long been a love in his life. From the days of singing as a child in his grandfather's church, to singing the national anthem in uniform as a member of the Toronto Argonauts, singing has always been \"like breath itself,\" he says. Distressed by television coverage of Africa's young famine victims, Clark wrote the lyrics, melody, and chorus to Letter from a Concerned Citizen Starvation in Africa. The Canadian Red Cross used the song for their national television and radio campaign to raise funds for their relief efforts in Africa. Of his three CDs he says, \"They speak to the need for effective community and global co-operation, how through assisting each other in times of need we can accomplish anything. These songs motivate and encourage us to be our best, for there is greatness in all of us.\"","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTExNTk2OTYyMTheQTJeQWpwZ15BbWU2MDI4MDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0163925","name":"Eugene Clark","idIMDB":"nm0163925"},"actorId":"nm0163925","character":"Officer Kurt Miller","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Megan Butler","urlProfile":"http://www.imdb.com/name/nm0125057","urlPhoto":"","biography":{"bio":"Megan Butler is an actress, known for White Sands (1992), Knight Rider 2000 (1991) and Love, Lies and Murder (1991).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0125057","name":"Megan Butler","idIMDB":"nm0125057"},"actorId":"nm0125057","character":"Officer Marla Hedges","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mitch Pileggi","urlProfile":"http://www.imdb.com/name/nm0683379","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM5NzM2NzYtMzdlZC00NDc3LTlhMTUtZDIzZjdlYjI5MzJlL2ltYWdlXkEyXkFqcGdeQXVyNzIwNDk0MTY@._V1_UY44_CR10,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 April 1952","placeOfBirth":" Portland, Oregon, USA","birthName":"Mitchell Craig Pileggi","height":"6' 0½\" (1.84 m)","bio":"Mitch Pileggi was born on April 5, 1952 in Portland, Oregon, USA as Mitchell Craig Pileggi. He is an actor, known for The X-Files (1993), The X Files (1998) and Basic Instinct (1992). He has been married to Arlene Warren since January 1, 1997. They have one child. He was previously married to Debbie Andrews.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDM5NzM2NzYtMzdlZC00NDc3LTlhMTUtZDIzZjdlYjI5MzJlL2ltYWdlXkEyXkFqcGdeQXVyNzIwNDk0MTY@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0683379","name":"Mitch Pileggi","idIMDB":"nm0683379"},"actorId":"nm0683379","character":"Thomas J. Watts","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Christine Healy","urlProfile":"http://www.imdb.com/name/nm0372303","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNTIwODg5Nl5BMl5BanBnXkFtZTcwMzEwNjM4Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 June 1950","placeOfBirth":" Buffalo, New York, USA","bio":"Christine Healy was born on June 13, 1950 in Buffalo, New York, USA. She is an actress, known for Murder by Numbers (2002), You Lucky Dog (1998) and Like Father Like Son (1987). She has been married to Paul Linke since 1991. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkyNTIwODg5Nl5BMl5BanBnXkFtZTcwMzEwNjM4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0372303","name":"Christine Healy","idIMDB":"nm0372303"},"actorId":"nm0372303","character":"Commissioner Ruth Daniels","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lou Beatty Jr.","urlProfile":"http://www.imdb.com/name/nm0064187","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA5NjUyOTg1NV5BMl5BanBnXkFtZTgwNzAzMjA3OTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Lou Beatty Jr. is an actor, known for Finding Normal (2013), Cat City (2008) and NCIS (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNzA5NjUyOTg1NV5BMl5BanBnXkFtZTgwNzAzMjA3OTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0064187","name":"Lou Beatty Jr.","idIMDB":"nm0064187"},"actorId":"nm0064187","character":"Mayor Harold Abbey","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Francis Guinan","urlProfile":"http://www.imdb.com/name/nm0347341","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ0NDEzMTg2OF5BMl5BanBnXkFtZTgwNjU0NjA2MDI@._V1_UY44_CR11,0,32,44_AL_.jpg","biography":{"height":"6' 1\" (1.85 m)","bio":"Francis Guinan was born in Council Bluffs, Iowa, USA. He is an actor, known for Hannibal (2001), Constantine (2005) and The Last Airbender (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ0NDEzMTg2OF5BMl5BanBnXkFtZTgwNjU0NjA2MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0347341","name":"Francis Guinan","idIMDB":"nm0347341"},"actorId":"nm0347341","character":"Dr. Jeffrey Glassman","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Cannon Nichols","urlProfile":"http://www.imdb.com/name/nm0629617","urlPhoto":"","biography":{"bio":"John Cannon Nichols is an actor, known for Curse of the Starving Class (1994), Knight Rider 2000 (1991) and French Quarter Undercover (1986).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0629617","name":"John Cannon Nichols","idIMDB":"nm0629617"},"actorId":"nm0629617","character":"Lieutenant Justin Strand","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Doohan","urlProfile":"http://www.imdb.com/name/nm0001150","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzODkyOTg1Nl5BMl5BanBnXkFtZTYwOTA5ODUz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 March 1920","placeOfBirth":" Vancouver, British Columbia, Canada","birthName":"James Montgomery Doohan","height":"5' 8\" (1.73 m)","bio":"James Doohan was born on March 3, 1920 in Vancouver, British Columbia, Canada as James Montgomery Doohan. He is known for his work on Star Trek IV: The Voyage Home (1986), Star Trek II: The Wrath of Khan (1982) and Star Trek (1966). He was married to Wende Doohan, Anita Yagel and Janet Young. He died on July 20, 2005 in Redmond, Washington, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYzODkyOTg1Nl5BMl5BanBnXkFtZTYwOTA5ODUz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001150","name":"James Doohan","nicknames":["Jimmy"],"idIMDB":"nm0001150"},"actorId":"nm0001150","character":"James 'Scotty' Doohan","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Bonno","urlProfile":"http://www.imdb.com/name/nm0095081","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NzA3Mjk0M15BMl5BanBnXkFtZTgwMTA1Mjk5MDE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1961","placeOfBirth":" Harris County, Texas, USA","birthName":"Christopher Joseph Bonno","bio":"Chris Bonno, once voted the Funniest Person in Austin, is a regular performer at the Improv in LA, with the improv troupe \"The Fugitives\", and at the ACME comedy theater with the improvisational forties radio comedy troupe \"Liquid Radio Players\" and has also done numerous shows with the \"Fake Radio Players\" performing in live traditional radio shows with a comic twist. He wrote for the VH1 pilot \"Popshot\" and created commercial parodies for the Disney Channel. He now is the writer and voice of Spike TV's deluded cartoon mascot named \"Roger\". You may also remember him as the voice of the Red Bull frog prince. He recently returned from a comedy tour including gigs in New York's Caroline's Comedy Club and Cobb's comedy club in San Francisco. His TV career includes appearances on Just Shoot Me! (1997), Rock Me, Baby (2003), \"The Drew Carey Show\" (1995)_, Mad About You (1992) and Oxygen's Movie of the Week, Nadine in Date Land (2005), playing a detective opposite Janeane Garofalo. Most recently, Bonno filmed guest star roles on both the new Comedy Central series Halfway Home (2007) and playing opposite Michael Rapaport on Fox's The War at Home (2005). You can find Chris on the web playing the character Ralph the Roadie, a roadie who wants to be a rock star.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ1NzA3Mjk0M15BMl5BanBnXkFtZTgwMTA1Mjk5MDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0095081","name":"Chris Bonno","idIMDB":"nm0095081"},"actorId":"nm0095081","character":"Andrew","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Robert F. Cawley","urlProfile":"http://www.imdb.com/name/nm0147226","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMTU3MzMyOV5BMl5BanBnXkFtZTcwMTQ0ODQzMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 July 1928","placeOfBirth":" Carbondale, Pennsylvania, USA","birthName":"Robert Francis Cawley","height":"5' 11½\" (1.82 m)","bio":"Robert was born on 25th July 1928 to Lillian Collins & Frank Cawley in Carbondale, Pennsylvania. He attended Edison High School at the same time as Ralph Branca (Brooklyn Dodger Pitcher). He represented Park Circle Skating Club of Brooklyn N.Y. and garnered 10 National Medals For artistic skating. He joined the cast of Skating Vanities (Roller Skating Show) and toured Europe. He converted to Ice Skating and toured with Sonja Henie, Holiday on Ice and Hollywood Ice review. He then became a Police Officer and spent the next 30 years in related law enforcement fields (Junenile bureau, Coroner's Investigator, Private investigator.) He migrated to Texas and worked 8 years in the Desoto Police Department. He married Sandra Eggert in 1964 and is still married to her. They had three children: Stacey, Frank & Kelly. All now married and living in Texas. He presently produces The Exposure Showcase in Dallas and has given many wannabees their start. He is a published poet.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkzMTU3MzMyOV5BMl5BanBnXkFtZTcwMTQ0ODQzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0147226","name":"Robert F. Cawley","nicknames":["Bob"],"idIMDB":"nm0147226"},"actorId":"nm0147226","character":"Prison Guard","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Philip Hafer","urlProfile":"http://www.imdb.com/name/nm0353095","urlPhoto":"","biography":{"bio":"Philip Hafer is an actor, known for Knight Rider 2000 (1991), Caged Fear (1991) and Reborn (1981).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0353095","name":"Philip Hafer","idIMDB":"nm0353095"},"actorId":"nm0353095","character":"Charlie","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0102227","urlIMDB":"http://www.imdb.com/title/tt0102227","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 31 min (91 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":["Panavision Cameras and Lenses"],"laboratory":["Century III, Orlando (FL), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"4.6","filmingLocations":[{"location":"Century Building - 84 NE Loop 410, San Antonio, Texas, USA"}],"awards":[],"votes":"2,089","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0072573","name":"Charles E. Sellier Productions"},{"idCompany":"co0234726","name":"River Rock Productions"},{"idCompany":"co0046592","name":"Universal Television"}],"keywords":{"keywords":["police","year 2000","2000s","car","gun","reference to star trek","digit in title","experimental technology","woman shot in the head","shot in the head","tv series reunion","near future","cop impersonation","killed in police car","police officer shot in the head","police officer knocked unconscious","police officer killed","police officer shot in the chest","police officer shot","police officer","driver car relationship","smart car","gadget car","artificial intelligence","animate car","prison","hospital","chip in head","car trouble","car in water","brain scan","futuristic","talking car","sequel","number in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 03:03:47"}}