{"data":{"movies":[{"title":"Russian Holiday","originalTitle":"","year":"1992","directors":[{"name":"Greydon Clark","id":"nm0163990"}],"writers":[{"name":"David Reskin","id":"nm0720286"}],"runtime":"89 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxNDk2Mjk3OV5BMl5BanBnXkFtZTcwODA4MjgxMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama","Thriller"],"simplePlot":"","actors":[{"actorName":"Jeff Altman","urlProfile":"http://www.imdb.com/name/nm0022901","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MTk5NjgwMV5BMl5BanBnXkFtZTgwOTUwNDQ2MjE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 August 1951","placeOfBirth":" Syracuse, New York, USA","height":"5' 8\" (1.73 m)","bio":"Jeff Altman was born on August 13, 1951 in Syracuse, New York, USA. He is an actor, known for Bee Movie (2007), Highlander II: The Quickening (1991) and Legends of the Superheroes (1979).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1MTk5NjgwMV5BMl5BanBnXkFtZTgwOTUwNDQ2MjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0022901","name":"Jeff Altman","idIMDB":"nm0022901"},"actorId":"nm0022901","character":"Milt Holly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Victoria Barrett","urlProfile":"http://www.imdb.com/name/nm0057313","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NDQ4MDgzOV5BMl5BanBnXkFtZTcwMDk3MTM0Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Victoria Barrett is an actress and director, known for Three Kinds of Heat (1987), America 3000 (1986) and Journey of Faith (2008).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM4NDQ4MDgzOV5BMl5BanBnXkFtZTcwMDk3MTM0Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0057313","name":"Victoria Barrett","idIMDB":"nm0057313"},"actorId":"nm0057313","character":"Viktoria","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Susan Blakely","urlProfile":"http://www.imdb.com/name/nm0086806","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNTIzMjQzM15BMl5BanBnXkFtZTgwNDk3MTQyMDE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 September 1948","placeOfBirth":" Frankfurt am Main, Hesse, Germany","bio":"She stands out easily in a crowd with her wholesome beauty, knock-out figure and dazzling smile. Ever-radiant TV and film resident Susan Blakely found success on several paths she chose for herself over the years -- first as a model, then as an award-winning actress on TV and, finally, as a jewelry designer. The trim and trendy blonde also enhanced a mild stream of popular films during the 1970s and 1980s. Born in Frankfurt, Germany, she is the daughter of U.S. Army Colonel Lawrence Blakely. While growing up, she traveled extensively throughout the world with her family including Korea, Hawaii and, finally, Texas. Following a year of study at the University of Texas, Susan moved to New York and managed to secure a place for herself as a high-priced magazine and TV ad model. At the same time, she was encouraged to try her hand at acting and studied at the Neighborhood Playhouse. Married in 1969 to lawyer and screenwriting hopeful Todd Merer, she chanced a move to Hollywood to seek her fame and fortune. Billed initially as Susie Blakely, she was cast in small, capricious, deb-like turns in such films as Savages (1972) (her debut) and The Way We Were (1973). Her first popular movie role came about surrounded by a high-and-mighty all-star cast in Irwin Allen's epic disaster The Towering Inferno (1974), as the spoiled princess-like daughter of unscrupulous skyscraper builder William Holden and wife of callous, pretty-boy opportunist Richard Chamberlain. Lightweight as the role was, Susan willingly accepted the challenge of proving herself in Hollywood as more than just another starlet with a gorgeous face. She did...and more...by earning a Golden Globe and Emmy nomination for her exceptional work as \"Julie Prescott\" in the acclaimed TV mini-series epic Rich Man, Poor Man (1976) with Peter Strauss and Nick Nolte vying for her attention. It was star-making turns for all three leads. This monumental acting opportunity kicked off a highly rewarding career in TV mini-movies, playing an array of flawed but fascinating and newsworthy ladies, including Hitler mistress Eva Braun opposite Anthony Hopkins in Le bunker (1981); tormented actress Frances Farmer in Will There Really Be a Morning? (1983); political wife Joan Bennett Kennedy in The Ted Kennedy Jr. Story (1986); and crime attorney Leslie Abramson in Honor Thy Father and Mother: The True Story of the Menendez Murders (1994). Challenging roles continued to pour in that belied her pretty-girl image -- ranging from drug addicts to a housewife who changes into a werewolf! Less in the acting limelight these days, Susan nevertheless accomplished an award-winning turn in the low-profile film Hungry Hearts (2002), then starred on stage in the 2006 world premiere of \"Diva!\" at the La Jolla Playhouse. In recent years, she has broadened her horizons once again as a semi-precious jewelry designer...and once again she has met with great success. Divorced from her first husband in the 1970s, Susan remarried in 1982. Her present husband, media consultant, litigation and political adviser Steve Jaffe, has also reaped rewards as a film and television producer. Many of his projects have included Susan -- the afore-mentioned Frances Farmer TV biography, the TV-movie A Cry for Love (1980), and the film Russian Holiday (1992) [aka Russian Roulette]. They reside in the Beverly Hills area.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjMzNTIzMjQzM15BMl5BanBnXkFtZTgwNDk3MTQyMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0086806","name":"Susan Blakely","idIMDB":"nm0086806"},"actorId":"nm0086806","character":"Susan Dennison","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Barry Bostwick","urlProfile":"http://www.imdb.com/name/nm0000960","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NjA4MDg0MV5BMl5BanBnXkFtZTgwNDY5MDgzNDE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 February 1945","placeOfBirth":" San Mateo, California, USA","birthName":"Barry Knapp Bostwick","height":"6' 4\" (1.93 m)","bio":"Tall (6' 4\"), agile, energetic, and ever-so-confident as both actor and singer, especially on the award-winning Broadway stage, Barry Bostwick possesses that certain narcissistic poise, charm and élan that reminds one instantly (and humorously) of a Kevin Kline -- both were quite brilliant in their respective interpretations of The Pirate King in \"The Pirates of Penzance\". Yet, for all his diverse talents (he is a Golden Globe winner and was nominated for the Tony Award three times, winning once), Barry is indelibly caught in a time warp. Even today, 35 years after the fact, he is indelibly associated with the role of nerdy hero Brad Majors in the midnight movie phenomena The Rocky Horror Picture Show (1975). While it is extremely flattering to be a part of such a cult institution, Barry's acting legacy deserves much more than this. He was born Barry Knapp Bostwick on February 24, 1945, in San Mateo, California, one of two sons of Elizabeth \"Betty\" (Defendorf) and Bud Bostwick (Henry Bostwick), a city planner and actor. A student at San Mateo High School, he and his elder brother Peter use to put on musicals and puppet shows for the neighborhood kids. Barry attended San Diego's United States International University's School for the Performing Arts in 1967, and switched from music to drama during the course of his studies. He also worked occasionally as a circus performer, which would come in handy on the musical stage down the line. He subsequently moved to New York and attended the Graduate School of Arts and Sciences at New York University. Making his stage debut at age 22 in a production of \"Take Her, She's Mine,\" Barry performed in a number of non-musical roles in such productions of \"War and Peace\" (1968) and \"The Misanthrope (1968). Making his 1969 Broadway debut in \"Cock-a-Doodle Dandy\", which ran in tandem with \"Hamlet\" in which he was featured as Osric, it was his portrayal of the swaggering, leather jacket-wearing 50s \"bad boy\" Danny Zuko in the 1972 Broadway high-school musical smash \"Grease\" that put Barry's name prominently and permanently on the marquee signs. Originating the role, he was nominated for a Tony but lost out that year to the older generation (Phil Silvers for \"A Funny Thing Happened...\"). In the midst of all this star-making hoopla, Barry was also breaking into films with a minor role in Jennifer on My Mind (1971) and leading parts in the comedy spoofs Road Movie (1974) and The Wrong Damn Film (1975). It all paled after winning the role as Susan Sarandon's simp of a boyfriend in the The Rocky Horror Picture Show (1975), which featured a delicious Tim Curry camping it up as a transvestite monster-maker. The movie, based on the macabre 1973 British stage musical \"The Rocky Horror Show,\" packed the midnight movie houses with costumed fans replicating every move and, word and offering puns and props aplenty in recapturing the insanity of the show. While the \"Rocky\" association hit like a tornado, Barry ventured on and tried to distance himself. He created sparks again on Broadway, garnering a second Tony nomination for the comedy revival \"They Knew What They Wanted\" in 1976. He finally took home the trophy the following year for the musical \"The Robber Bridegroom\" (1977), which relied again on his patented bluff and bravado as a Robin Hood-like hero. Following top roles in the musicals \"She Loves Me\" and \"The Pirates of Penzance\", Barry turned rewardingly to film and TV. The two-part feature Movie Movie (1978), which played like an old-style double feature, was a great success, performing alongside esteemed actor George C. Scott. Barry excelled in both features, but especially the musical parody. He fared just as well on the smaller screen in TV movies, playing everything from historical icons (George Washington) to preening matinée idols (John Gilbert), and winning a Golden Globe for his role as a military officer in the epic miniseries War and Remembrance (1988). A variety of interesting roles followed in glossy, soap-styled fare, farcical comedies and period drama. A welcomed return to Broadway musicals in the form of \"Nick & Nora\" (he as sleuth Nick \"The Thin Man\" Charles) was marred when the glitzy production folded after only nine perfs. Instead, the prematurely grey-haired actor found steadier success in sitcoms as a smug comedy foil to Michael J. Fox playing Mayor Randall Winston for six seasons in Spin City (1996). He later enjoyed a recurring role as a dauntless attorney on Law & Order: Special Victims Unit (1999). Then again, Barry could be spotted pitching items in commercials or hamming it up in family-oriented Disneyesque entertainment in the \"Parent Trap\" and \"101 Dalmatian\" mold. In 1997, Bostwick was diagnosed with prostate cancer, and 10 days later had his prostate removed. The operation was successful and in 2004, he won the Gilda Radner Courage Award from the Roswell Park Cancer Institute. Just a year earlier he appeared on an episode of \"Scrubs\" as a patient also having prostate cancer. Barry married somewhat late in life. For a brief time he was wed to actress Stacey Nelkin (1987-1991), but has since become a father of two, Brian and Chelsea, with second wife Sherri Jensen Bostwick, an actress who appeared with Barry in the TV movie Praying Mantis (1993).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg3NjA4MDg0MV5BMl5BanBnXkFtZTgwNDY5MDgzNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000960","name":"Barry Bostwick","idIMDB":"nm0000960"},"actorId":"nm0000960","character":"Grant Ames","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Frank Duffy","urlProfile":"http://www.imdb.com/name/nm1839455","urlPhoto":"","biography":{"height":"6' 1\" (1.85 m)","bio":"Frank Duffy is known for his work on Deja Vu (2006), Going to California (2001) and Russian Holiday (1992). He has been married to Ramona Tyler since December 24, 1993.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1839455","name":"Frank Duffy","idIMDB":"nm1839455"},"actorId":"nm1839455","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"E.G. Marshall","urlProfile":"http://www.imdb.com/name/nm0550855","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Nzg5MTMwOF5BMl5BanBnXkFtZTYwMzk2MTQ2._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 June 1914","placeOfBirth":" Owatonna, Minnesota, USA","birthName":"Everett Eugene Grunz","height":"5' 8\" (1.73 m)","bio":"With over 150 Film and TV appearances to his credit, E.G. Marshall was arguably most well known as the imperturbable Juror No. 4 in the Sidney Lumet mystery 12 Angry Men (1957). Some of his stand-out performances are in Creepshow (1982), National Lampoon's Christmas Vacation (1989), and Nixon (1995). Marshall married three times and had seven children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY3Nzg5MTMwOF5BMl5BanBnXkFtZTYwMzk2MTQ2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0550855","name":"E.G. Marshall","nicknames":["Eej"],"idIMDB":"nm0550855"},"actorId":"nm0550855","character":"Joe Meadows","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joyce Phillips","urlProfile":"http://www.imdb.com/name/nm1124799","urlPhoto":"","biography":{"bio":"Joyce Phillips is an actress, known for Splitz (1982), I Love N.Y. (1987) and Russian Holiday (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1124799","name":"Joyce Phillips","idIMDB":"nm1124799"},"actorId":"nm1124799","character":"Molly Holly","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bunny Summers","urlProfile":"http://www.imdb.com/name/nm0838677","urlPhoto":"","biography":{"dateOfBirth":"23 February 1924","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Bernice Siegel","bio":"Bunny Summers was born on February 23, 1924 in Brooklyn, New York City, New York, USA as Bernice Siegel. She was an actress, known for Re-Animator (1985), From Beyond (1986) and The Last Starfighter (1984). She died on September 9, 2010 in Woodland Hills, Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0838677","name":"Bunny Summers","nicknames":["Bunny"],"idIMDB":"nm0838677"},"actorId":"nm0838677","character":"Helen Meadows","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0102821","urlIMDB":"http://www.imdb.com/title/tt0102821","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 29 min (89 min) (USA)"],"soundMix":["Mono"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"1.7","filmingLocations":[],"rated":"PG","awards":[],"votes":"143","type":"Movie","companyCreditsSimple":[],"keywords":{"keywords":["independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:42:38"}}