{"data":{"movies":[{"title":"Bruno","originalTitle":"","year":"2000","releaseDate":"20000416","directors":[{"name":"Shirley MacLaine","id":"nm0000511"}],"writers":[{"name":"David Ciminello","id":"nm0162350"}],"runtime":"108 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIyMjcxNjU5OV5BMl5BanBnXkFtZTcwODA4MzIyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Drama"],"plot":"Bruno is the story of a unique young boy genius, Bruno (Alex D. Linz), whose expression of his own individuality leads his family and community along an emotional journey. By the time he reaches his final destination, Bruno's story becomes a fable of the importance of each person's uniqueness and originality.","simplePlot":"Bruno is the story of a unique young boy genius, Bruno (Alex D. Linz), whose expression of his own individuality leads his family and community along an emotional journey. By the time he ... ","actors":[{"actorName":"Alex D. Linz","urlProfile":"http://www.imdb.com/name/nm0513281","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MjAwNzU4NF5BMl5BanBnXkFtZTYwNjY5MjQ3._V1_UY44_CR4,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 January 1989","placeOfBirth":" Santa Barbara, California, USA","birthName":"Alexander David Linz","height":"5' 8½\" (1.74 m)","bio":"Alex D. Linz was born on January 3, 1989 in Santa Barbara, California, USA as Alexander David Linz. He is an actor, known for Home Alone 3 (1997), Tarzan (1999) and One Fine Day (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjA4MjAwNzU4NF5BMl5BanBnXkFtZTYwNjY5MjQ3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0513281","name":"Alex D. Linz","idIMDB":"nm0513281"},"actorId":"nm0513281","character":"Bruno Battaglia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shirley MacLaine","urlProfile":"http://www.imdb.com/name/nm0000511","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MTE5MjQ1MF5BMl5BanBnXkFtZTYwMzU2MDg1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 April 1934","placeOfBirth":" Richmond, Virginia, USA","birthName":"Shirley MacLean Beaty","height":"5' 7\" (1.7 m)","bio":"Shirley MacLaine was born Shirley MacLean Beaty in Richmond, Virginia. Her mother, Kathlyn Corinne (MacLean), was a drama teacher from Nova Scotia, Canada, and her father, Ira Owens Beaty, a professor of psychology and real estate agent, was from Virginia. Her brother, Warren Beatty, was born on March 30, 1937. Her ancestry includes English and Scottish. Shirley was the tallest in her ballet classes at the Washington School of Ballet. Just after she graduated from Washington-Lee High School, she packed her bags and headed for New York. While auditioning for Richard Rodgers and Oscar Hammerstein II's \"Me and Juliet\", the producer kept mispronouncing her name. She then changed her name from Shirley MacLean Beaty to Shirley MacLaine. She later had a role in \"The Pajama Game\", as a member of the chorus and understudy to Carol Haney. A few months into the run, Shirley was going to leave the show for the lead role in \"Can-Can\" but ended up filling in for Haney, who had broken her ankle and could not perform. She would fill in for Carol, again, three months later, following another injury, the very night that movie producer Hal B. Wallis was in the audience. Wallis signed MacLaine to a five-year contract to Paramount Pictures. Three months later, she was off to shoot The Trouble with Harry (1955). She then took roles in Hot Spell (1958) and Around the World in Eighty Days (1956), completed not too long before her daughter, Sachi Parker (born Stephanie), was born. With Shirley's career on track, she played one of her most challenging roles: \"Ginny Moorhead\" in Some Came Running (1958), for which she received her first Academy Award nomination for Best Actress. She went on to do The Sheepman (1958) and The Matchmaker (1958). In 1960, she got her second Academy Award nomination for The Apartment (1960). Three years later, she received a third nomination for Irma la Douce (1963). In 1969, she brought her friend Bob Fosse from Broadway to direct her in Sweet Charity (1969), from which she got her \"signature\" song, \"If My Friends Could See Me Now\". After a five-year hiatus, Shirley made a documentary on China called The Other Half of the Sky: A China Memoir (1975), for which she received an Oscar nomination for best documentary. In 1977, she got her fourth Best Actress Oscar nomination for The Turning Point (1977). In 1979, she worked with Peter Sellers in Being There (1979), made shortly before his death. After 20 years in the film industry, she finally took home the Best Actress Oscar for Terms of Endearment (1983). After a five-year hiatus, Shirley made Madame Sousatzka (1988), a critical and financial hit that took top prize at the Venice Film Festival. In 1989, she starred with Dolly Parton, Sally Field and Julia Roberts in Steel Magnolias (1989). She received rave reviews playing Meryl Streep's mother in Postcards from the Edge (1990) and for Guarding Tess (1994). In 1996, she reprised her role from \"Terms of Endearment\" as \"Aurora Greenway\" in The Evening Star (1996), which didn't repeat its predecessor's success at the box office. In mid-1998, she directed Bruno (2000), which starred Alex D. Linz. In February 2001, Shirley worked with close friends once again in These Old Broads (2001), and co-starred with Julia Stiles in Carolina (2003) and with Kirstie Alley in Salem Witch Trials (2002). MacLaine as her own website which includes her own radio show and interviews, the Encounter Board, and Independent Expression, a members-only section of the site. In the past few years, Shirley starred in a CBS miniseries based on the life of cosmetics queen Mary Kay Ash--The Battle of Mary Kay (2002), and wrote two more books, \"The Camino\" in 2001, and \"Out On A Leash\" in 2003. After taking a slight hiatus from motion pictures, Shirley returned with roles in the movies that were small, but wonderfully scene-stealing: Bewitched (2005) with Nicole Kidman and Will Ferrell, In Her Shoes (2005) with Cameron Diaz and Toni Collette, in which Shirley was nominated for a Golden Globe in the best supporting actress category, and Rumor Has It... (2005) with Jennifer Aniston and Kevin Costner. Shirley completed filming of Closing the Ring (2007), directed by Sir Richard Attenborough, in 2007. Her latest book is entitled \"Sage-ing While Ag-ing\"; Shirley's latest film is Valentine's Day (2010), which debuted in theaters on February 12, 2010.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI0MTE5MjQ1MF5BMl5BanBnXkFtZTYwMzU2MDg1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000511","name":"Shirley MacLaine","idIMDB":"nm0000511"},"actorId":"nm0000511","character":"Helen","urlCharacter":"http://www.imdb.com/character/ch0410221","main":true},{"actorName":"Gary Sinise","urlProfile":"http://www.imdb.com/name/nm0000641","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE4NzcyMzU3OV5BMl5BanBnXkFtZTYwOTM2NDE2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 March 1955","placeOfBirth":" Blue Island, Illinois, USA","birthName":"Gary Alan Sinise","height":"5' 9\" (1.75 m)","bio":"Gary Alan Sinise was born in Blue Island, Illinois, to Mylles S. (Alsip) and Robert L. Sinise, A.C.E., a film editor. He is of Italian (from his paternal grandfather), English, Scottish, Irish, French, German, and Swedish ancestry. His family moved to Highland Park, where he attended high school. He was something of a rebel, playing in bands but paying little attention to school. Gary and some friends tried out for \"West Side Story\" as a lark, but Gary was hooked on acting for life by closing night. Gary credits his love for theatre to his drama teacher, Barbara Patterson. In 1974, Gary, Terry Kinney, and Jeff Perry founded the Steppenwolf Theatre Company in Chicago. Initially performing in a church basement, the company grew and gained stature in the Chicago area. In addition to acting in many plays, Gary also directed some of Steppenwolf's most notable productions, including Sam Shepard's \"True West\". The company made its off-Broadway debut with that production, starring Gary and John Malkovich, and its Broadway debut with \"The Grapes of Wrath\" at the Cort Theatre in 1990. Gary's Hollywood career also started in the director's chair with two episodes of the stylish TV series Crime Story (1986), followed in 1988 by the feature Miles from Home (1988) starring Richard Gere. Gary's first feature film as an actor was the World War II fable A Midnight Clear (1992) in 1992. That year also found Gary combining his acting and directing talents with the critically acclaimed Of Mice and Men (1992). His first real notice by the public came in 1994, however. He starred in the blockbuster miniseries The Stand (1994), rapidly followed by his bravura performance as \"Lt. Dan\" in Forrest Gump (1994). His portrayal of the disabled, emotionally tortured veteran earned Gary numerous awards and an Oscar nomination. Busy 1994 was followed by busy 1995, first reuniting with Tom Hanks in Apollo 13 (1995) and then starring in the HBO film Truman (1995) which earned him the Golden Globe and Screen Actors Guild Awards and an Emmy nomination. Gary is married to Moira Sinise, an actress and original member of the Steppenwolf company. They have three children, Sophie Sinise, McCanna Anthony Sinise and Ella Sinise.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMzE4NzcyMzU3OV5BMl5BanBnXkFtZTYwOTM2NDE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000641","name":"Gary Sinise","idIMDB":"nm0000641"},"actorId":"nm0000641","character":"Dino Battaglia","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joey Lauren Adams","urlProfile":"http://www.imdb.com/name/nm0000725","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NzM0MjE0M15BMl5BanBnXkFtZTcwODQzODEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 January 1968","placeOfBirth":" Little Rock, Arkansas, USA","height":"5' 4\" (1.63 m)","bio":"Joey Lauren Adams was born on January 9, 1968 in Little Rock, Arkansas, USA. She is an actress, known for Dazed and Confused (1993), Big Daddy (1999) and The Break-Up (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY4NzM0MjE0M15BMl5BanBnXkFtZTcwODQzODEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000725","name":"Joey Lauren Adams","idIMDB":"nm0000725"},"actorId":"nm0000725","character":"Donna Marie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kathy Bates","urlProfile":"http://www.imdb.com/name/nm0000870","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg1MTM3NjcyMF5BMl5BanBnXkFtZTcwMDI0NTk0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 June 1948","placeOfBirth":" Memphis, Tennessee, USA","birthName":"Kathleen Doyle Bates","height":"5' 3\" (1.6 m)","bio":"Multi-talented Kathleen Doyle Bates was born on June 28, 1948, and raised in Memphis, Tennessee. She is the youngest of three girls born to Bertye Kathleen (Talbot), a homemaker, and Langdon Doyle Bates, a mechanical engineer. Her grandfather was author Finis L. Bates. Kathy has English, as well as Irish, Scottish, and German, ancestry, and one of her ancestors, an Irish emigrant to New Orleans, once served as President Andrew Jackson's doctor. Kathy discovered acting appearing in high school plays and studied drama at Southern Methodist University, graduating in 1969. With her mind firmly set, she moved to New York City in 1970 and paid her dues by working everything from a cash register to taking lunch orders. Things started moving quickly up the ladder after giving a tour-de-force performance alongside Christopher Walken at Buffalo's Studio Arena Theatre in Lanford Wilson's world premiere of \"Lemon Sky\" in 1970, but she also had a foreshadowing of the heartbreak to come after the successful show relocated to New York's off-Broadway Playhouse Theatre without her and Walken wound up winning a Drama Desk award. By the mid-to-late 1970s, Kathy was treading the boards frequently as a rising young actress of the New York and regional theater scene. She appeared in \"Casserole\" and \"A Quality of Mercy\" (both 1975) before earning exceptional reviews for her role of Joanne in \"Vanities\". She took her first Broadway curtain call in 1980's \"Goodbye Fidel,\" which lasted only six performances. She then went directly into replacement mode when she joined the cast of the already-established and highly successful \"Fifth of July\" in 1981. Kathy made a false start in films with Taking Off (1971), in which she was billed as \"Bobo Bates\". She didn't film again until Straight Time (1978), starring Dustin Hoffman, and that part was not substantial enough to cause a stir. Things turned hopeful, however, when Kathy and the rest of the female ensemble were given the chance to play their respective Broadway parts in the film version of Robert Altman's Come Back to the 5 & Dime, Jimmy Dean, Jimmy Dean (1982). It was a juicy role for Kathy and film audiences finally started noticing the now 34-year-old. Still and all, it was the New York stage that continued to earn Kathy awards and acclaim. She was pure textbook to any actor studying how to disappear into a role. Her characters ranged from free and life-affirming to downright pitiable. Despite winning a Tony Award nomination and Outer Critic's Circle Award for her stark, touchingly sad portrait of a suicidal daughter in 1983's \"'night, Mother\" and the Obie and Los Angeles Drama Critics Award for her powerhouse job as a romantic misfit in \"Frankie and Johnny in the Claire de Lune,\" Kathy had no box-office pull and was hardly a strong consideration when the roles finally went to film. Kathy Bates was forever losing out when her award-winning stage characters transferred to the screen. First Sissy Spacek took on her potent role as the suicidal Jessie Cates in 'night, Mother (1986), then Michelle Pfeiffer seized the moment to play her dumpy lover character in Frankie and Johnny (1991). It would take Oscar glory to finally rectify the injustice. It was her fanatical turn as the drab, chunky, porcine-looking psychopath Annie Wilkes, who kidnaps her favorite author (James Caan) and subjects him to a series of horrific tortures, that finally turned the tide for her in Hollywood. With the 1990 shocker Misery (1990), based on the popular Stephen King novel, Bates and Caan were pure box office magic. Moreover, Kathy captured the \"Best Actress\" Oscar and Golden Globe award, a first in that genre (horror) for that category. To add to her happiness she married Tony Campisi, also an actor, in 1991. Quality film scripts now started coming her way and the 1990s proved to be a rich and rewarding time for her. First, she and another older \"overnight\" film star, fellow Oscar winner Jessica Tandy, starred together in the modern portion of the beautifully nuanced, flashback period piece Fried Green Tomatoes (1991). She then outdid herself as the detached and depressed housekeeper accused of murdering her abusive husband (David Strathairn) in Dolores Claiborne (1995). Surprisingly, she was left out of the Oscar race for these two excellent performances. Not so, however, for her flashy political advisor Libby Holden in the movie Primary Colors (1998) and her quirky, liberal mom in About Schmidt (2002), receiving \"Best Supporting Actress\" nominations for both. She also turned in a somewhat brief but potent turn as Gertrude Stein in Woody Allen's Midnight in Paris (2011). Kathy has continued to work prolifically on TV as a multiple Emmy winner and nominee. She has also taken to directing a couple of TV-movies on the sly. She was nominated for a DGA award after helming an episode of \"Six Feet Under,\" in which she also had a recurring role. While some of her more recent movie parts have been unworthy of her talents, she has more than made up for it on TV playing everything from cruel-minded caricatures (Little Orphan Annie's Miss Hannigan) to common, decent every day folk in mini-movies. More recently she has done some eye-catching, offbeat turns on regular series such as The Office (2005), Harry's Law (2011) and especially American Horror Story (2011) for which she won an Emmy as Ethel Darling. Divorced from her husband since 1997, Kathy has been the Executive Committee Chair of the Actors Branch of the Academy of Motion Picture Arts and Sciences Board of Governors.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTg1MTM3NjcyMF5BMl5BanBnXkFtZTcwMDI0NTk0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000870","name":"Kathy Bates","nicknames":["Bobo"],"idIMDB":"nm0000870"},"actorId":"nm0000870","character":"Mother Superior","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kiami Davael","urlProfile":"http://www.imdb.com/name/nm0202484","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0Mjc4MDg3Ml5BMl5BanBnXkFtZTgwMTA3MDI1MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 August 1986","placeOfBirth":" Boyle County, Kentucky, USA","birthName":"Kiami Davael Daugherty","height":"5' (1.52 m)","bio":"Kiami Davael is an actress, model, singer, songwriter & screenwriter. She is best known for her role as \"Lavender\" in \"Matilda\" starring Mara Wilson. Kiami was born in Kentucky, but her family moved to California to pursue her career. Kiami has starred in numerous TV shows such as \"Moesha\" & \"Steve Harvey\" and has been in countless plays. Kiami has directed and produced several theater productions and also has had the privilege of teaching acting classes to aspiring young actors. Kiami also has a Bachelor of Arts degree in Psychology and minored in theater while attending college. Kiami is a Christian and in 2012 wrote her first movie entitled \"Reckless\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0Mjc4MDg3Ml5BMl5BanBnXkFtZTgwMTA3MDI1MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0202484","name":"Kiami Davael","idIMDB":"nm0202484"},"actorId":"nm0202484","character":"Shawniqua","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Stacey Halprin","urlProfile":"http://www.imdb.com/name/nm0357002","urlPhoto":"","biography":{"birthName":"Stacey Harperin","bio":"Stacey Halprin was born as Stacey Harperin. She is an actress, known for Bruno (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0357002","name":"Stacey Halprin","idIMDB":"nm0357002"},"actorId":"nm0357002","character":"Angela","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jennifer Tilly","urlProfile":"http://www.imdb.com/name/nm0000236","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQxNDI2MzA0N15BMl5BanBnXkFtZTYwOTcxOTI0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"16 September 1958","placeOfBirth":" Harbor City, California, USA","birthName":"Jennifer Ellen Chan","height":"5' 7\" (1.7 m)","bio":"An actress who always attracts audiences' attention, Jennifer Tilly is by turns funny, sexy, compassionate, compelling and often all at once. Her breakthrough movie role tapped into all of those qualities failing singer Blanche \"Monica\" Moran in Steve Kloves' The Fabulous Baker Boys (1989) opposite brothers Jeff Bridges and Beau Bridges. A few years later, Jennifer earned an Academy Award nomination for her portrayal of the aspiring but hopelessly untalented actress Olive Neal in Woody Allen's Bullets Over Broadway (1994). She has become well-known to filmgoers for both major studio and independent films. In Tom Shadyac's blockbuster Liar Liar (1997), she kept pace with Jim Carrey. Her steamy performance opposite Gina Gershon helped make Lana Wachowski's and Lilly Wachowski's Bound (1996) a breakout indie success at the Sundance Film Festival and then in theatrical release. It also expanded Jennifer's already significant gay and lesbian following. She successfully cultivated another fan base with the revitalization of the \"Child's Play\" horror comedy franchise. For Ronny Yu's La fiancée de Chucky (1998), the filmmakers turned to Jennifer to create the character who would spark the series in a new direction. She met the challenge and established a new horror icon in Tiffany. This Halloween, in Rogue Pictures' all-new Le fils de Chucky (2004), written and directed by series creator Don Mancini, Jennifer again takes the popular series to the next level; she stars as Tiffany and as herself, the deadly doll's favorite actress, who soon becomes an unwitting hostess in more ways than one. Jennifer's pitch-perfect voiceover work as Tiffany is not the only instance of her being able to incarnate a character from the vocal chords out. Families know her distinctive cadences from the recent Disney hits Home on the Range (2004) (in which Jennifer voiced a new-age bovine), directed by Will Finn and John Sanford; The Haunted Mansion (2003) (in which Jennifer acted from the neck up only), directed by Rob Minkoff; and the Pixar blockbuster Monsters, Inc. (2001) (voicing Mike's love interest Celia), directed by Pete Docter, David Silverman and Lee Unkrich. She began her acting career as a teenager, putting herself through the theater program at Stephens College in Missouri by winning writing competitions. She then headed to Los Angeles, California. While she continued to act on the stage (earning a Dramalogue Award for her performance in \"Vanities\"), movies and television immediately came calling for the actress with the unique voice and visage. Over the years, Jennifer has made memorable appearances on some of television's best series, including Hill Street Blues (1981) (in a recurring dramatic role), Cheers (1982), Moonlighting (1985), It's Garry Shandling's Show. (1986) and Frasier (1993). In addition, she has been a favored guest on a number of talk shows, from The Tonight Show Starring Johnny Carson (1962) to The Arsenio Hall Show (1989) to (currently) The Tonight Show with Jay Leno (1992). Those interview segments have encouraged viewers to expect the unexpected from her interplay with the host and the studio audience. Her many films over a two-decade span include Neil Jordan's High Spirits (1988), Oliver Stone's The Doors (1991), Richard Benjamin's Made in America (1993), Roger Donaldson's The Getaway (1994), Joe Pytka's Let It Ride (1989), P.J. Castellaneta's Relax... It's Just Sex (1998), Michael Radford's Dancing at the Blue Iguana (2000), Peter Bogdanovich's The Cat's Meow (2001) (in which she played Louella Parsons). Jennifer Tilly has also continued to act on the stage. She won a Theater World Award for her performance in off-Broadway's \"One Shoe Off\" and starred on Broadway in the 2001 revival of \"The Women\" (which was later taped for, and broadcast on, PBS).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDQxNDI2MzA0N15BMl5BanBnXkFtZTYwOTcxOTI0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000236","name":"Jennifer Tilly","nicknames":["The Unabombshell","Jenny"],"idIMDB":"nm0000236"},"actorId":"nm0000236","character":"Dolores","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Gwen Verdon","urlProfile":"http://www.imdb.com/name/nm0893862","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NjkyNTcxNV5BMl5BanBnXkFtZTcwNTEzMTMyNw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 January 1925","placeOfBirth":" Culver City, Los Angeles, California, USA","birthName":"Gwyneth Evelyn Verdon","height":"5' 4\" (1.63 m)","bio":"Gwen Verdon was born to the theater. Her mother, Gertrude, was a vaudevillian and dancer. Her father, Joseph, was an MGM studio electrician. She had to wear corrective boots as a child to straighten out her legs, which were misshapen by childhood illness. Nonetheless, she first appeared as a tapper on stage at age 6. She got her break in Bob Fosse's \"Damn Yankees\" in 1955. She married Fosse in 1960 and separated from him, although never divorcing him, in the mid-'70s. More stage and screen work quickly followed with highlights in \"New Girl In Town\", \"Redhead\", \"Sweet Charity\", and \"Chicago\". She and her daughter, Nicole Fosse, created the current stage musical \"Fosse\". Upon her death, Broadway dimmed all of its marquee lights in tribute.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NjkyNTcxNV5BMl5BanBnXkFtZTcwNTEzMTMyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0893862","name":"Gwen Verdon","nicknames":["Gwennie","The Superior Posterior"],"idIMDB":"nm0893862"},"actorId":"nm0893862","character":"Mrs. Drago","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Brett Butler","urlProfile":"http://www.imdb.com/name/nm0124843","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAwNTg0NTM4OV5BMl5BanBnXkFtZTcwMjUzNTc0Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 January 1958","placeOfBirth":" Montgomery, Alabama, USA","birthName":"Brett Anderson","height":"5' 9\" (1.75 m)","bio":"Brett Butler was born on January 30, 1958 in Montgomery, Alabama, USA as Brett Anderson. She is an actress and producer, known for Grace Under Fire (1993), Anger Management (2012) and Mrs. Harris (2005). She was previously married to Ken Zieger and Charles Michael Wilson.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODAwNTg0NTM4OV5BMl5BanBnXkFtZTcwMjUzNTc0Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0124843","name":"Brett Butler","idIMDB":"nm0124843"},"actorId":"nm0124843","character":"Sister Della Rosa","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lee Hughes","urlProfile":"http://www.imdb.com/name/nm1317800","urlPhoto":"","biography":{"bio":"Lee Hughes is an actor, known for Bruno (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1317800","name":"Lee Hughes","idIMDB":"nm1317800"},"actorId":"nm1317800","character":"Eddie Mazzaratti","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dylan Hubbard","urlProfile":"http://www.imdb.com/name/nm0399163","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MzY3MDY1MV5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 August 1988","placeOfBirth":" Scranton, Pennsylvania, USA","height":"5' 10\" (1.78 m)","bio":"Dylan Hubbard was born on August 23, 1988 in Scranton, Pennsylvania, USA. He is an actor, known for Bruno (2000), The Marc Pease Experience (2009) and The Last Summer (2004).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2MzY3MDY1MV5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0399163","name":"Dylan Hubbard","idIMDB":"nm0399163"},"actorId":"nm0399163","character":"Signorelli","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kyle Phillips","urlProfile":"http://www.imdb.com/name/nm1301678","urlPhoto":"","biography":{"bio":"Kyle Phillips is an actor, known for Bruno (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1301678","name":"Kyle Phillips","idIMDB":"nm1301678"},"actorId":"nm1301678","character":"Capricci","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jordan Perry","urlProfile":"http://www.imdb.com/name/nm1289311","urlPhoto":"","biography":{"bio":"Jordan Perry is an actor and executive, known for Bruno (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1289311","name":"Jordan Perry","idIMDB":"nm1289311"},"actorId":"nm1289311","character":"Buttucci","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joanne Pankow","urlProfile":"http://www.imdb.com/name/nm0659600","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjIyMjk4Njg3OV5BMl5BanBnXkFtZTYwNzY2ODAz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 July 1937","placeOfBirth":" St. Louis, Missouri, USA","bio":"Joanne Field was born in St. Louis, Missouri to John L. Field and Eunice Stearns Field. Her parents were both native North Carolinians and they returned to NC when she was a baby. She grew up in Marion, NC. She attended Queens College in Charlotte, NC, and was graduated from Salem College in Winston-Salem, NC with a double major in English and Music. She took graduate courses at UNC-Chapel Hill. On 23 June 1962, she married Lt. Kenneth O. Pankow, of the US Navy. They lived in Asheville, NC. Joanne taught school for many years, but took early retirement from teaching to pursue a career as a professional actress. She got her start on the TV series \"In the Heat of the Night,\" and was in more than 60 films, series, commercials, etc. She was in \"Two Soldiers,\" a short film based on a William Faulkner short story that won an Oscar for best short film. In addition to acting, Joanne was an accomplished musician. She played the piano, pipe organ and harp.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjIyMjk4Njg3OV5BMl5BanBnXkFtZTYwNzY2ODAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0659600","name":"Joanne Pankow","idIMDB":"nm0659600"},"actorId":"nm0659600","character":"Sister Consolata","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0123003","urlIMDB":"http://www.imdb.com/title/tt0123003","business":{"budget":{"money":"$10,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":{"money":null,"country":null,"day":null,"month":null,"year":null,"remarks":null},"filmingDates":[null,null],"copyrightHolder":null},"technical":{"runtime":["1 hr 48 min (108 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":["DeLuxe"],"filmLength":null,"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"6.2","filmingLocations":[{"location":"New York City, New York, USA"}],"rated":"PG-13","awards":[],"votes":"1,217","type":"Movie","companyCreditsSimple":[{"idCompany":"co0113554","name":"J&M Entertainment"},{"idCompany":"co0006759","name":"Original Voices Inc."}],"keywords":{"keywords":["genius","fable","boy","forename as title","convent school","one word title","boy dressed as a girl","lifting someone into the air","grandmother grandson relationship","flashback","father son relationship","family relationships","gay slur","misfit","italian american","bully comeuppance","nun","mother superior","child's point of view","mother son relationship","harassment","flamboyance","dysfunctional family","coming of age","bonding","school","pope","children","teasing","racial slur","police officer","overweight","opera","ice cream","hospital","heart attack","friendship","emergency room","dream","dream sequence","divorce","directed by star","cemetery","catholic","catholic school","bully","boxing","airport","spelling bee","cross dressing","transgender","youth","child prodigy","gay interest","independent film","character name in title"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:31:55"}}