{"data":{"movies":[{"title":"History Is Made at Night","originalTitle":"","year":"1999","releaseDate":"19991022","directors":[{"name":"Ilkka Järvi-Laturi","id":"nm0433529"}],"writers":[{"name":"Patrick Amos","id":"nm0025318"},{"name":"Jean-Pierre Gorin","id":"nm0330948"}],"runtime":"95 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTUxMDcxOF5BMl5BanBnXkFtZTcwMjQ4OTcxMQ@@._V1.jpg","countries":["UK","Finland","France","Germany"],"languages":["English","Finnish"],"genres":["Action","Comedy","Romance","Thriller"],"plot":"A romantic suspense-comedy about CIA agent Harry (Bill Pullman) and SVR agent Natasha (Irene Jacob) fighting to save the world, their lives and secret love in the post cold war Helsinki.","simplePlot":"A romantic suspense-comedy about CIA agent Harry (Bill Pullman) and SVR agent Natasha (Irene Jacob) fighting to save the world, their lives and secret love in the post cold war Helsinki.","actors":[{"actorName":"Bill Pullman","urlProfile":"http://www.imdb.com/name/nm0000597","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0Mzk2MDEyM15BMl5BanBnXkFtZTgwMTczMDQzNjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 December 1953","placeOfBirth":" Hornell, New York, USA","birthName":"William James Pullman","height":"6' 1½\" (1.87 m)","bio":"William James Pullman was born in Hornell, New York, one of seven children of Johanna (Blaas), a nurse, and James Pullman, a doctor. He is of Dutch (mother) and English, Northern Irish, and Scottish (father) descent. After high school, Bill went into a building construction program at SUNY Delhi in New York. He transferred to State University of New York College at Oneonta where he received his BA in Theater. He received both his MFA in Theater/Directing and an honorary PHD from University of Massachusetts at Amherst. While teaching Directing at Montana State University in Bozeman, Montana, one of Bill's students was the soon-to-be film director John Dahl, who later cast Mr. Pullman in \"The Last Seduction\". Moving to New York City, he worked with Kathy Bates in the acclaimed stage production of \"Curse of the Starving Class\". However, it was his first work in three strikingly diverse films that brought him to the attention of his audience: \"Ruthless People\" with Danny DeVito and Bette Milder, the Mel Brooks hit \"Spaceballs\" and the Oscar-nominated (and winner for Best Actress Gina Davis) \"The Accidental Tourist\". Still attracted to the art and study of building construction, Bill has designed and/or restored three \"barns\": In Montana, he converted a 1933 barn at his ranch into his family home. In Los Angeles, he built a Truss barn in the style of LA's 1910 fruit storage barns. In western New York State, he restored a '3-bay' barn that sometimes serves as a community center near his hometown of Hornell, New York. Focused more on neighborhoods than show business-based charities and societies, Pullman has defined himself by his work with his local communities. He works to bridge communities of Los Angeles through his board work with Cornerstone Theater. Pullman continues to work with his neighbors who formed \"Concerned Citizens Montana\" to secure a place at the table regarding the national need for a smart grid for energy transmission. He also works with the local university (Alfred University, New York) as well as supports local health services (\"The Pullman Women's Health and Birthing Center\" at St James Hospital, Hornell, NY). Pullman is also an MS Society Ambassador. Based in Los Angeles, New York City and Western Montana, Pullman is married to the dancer, Tamara Hurwitz Pullman, and they have three children, daughter singer/songwriter Maesa Rae, and multi-talented sons Jack and Lewis.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg0Mzk2MDEyM15BMl5BanBnXkFtZTgwMTczMDQzNjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000597","name":"Bill Pullman","idIMDB":"nm0000597"},"actorId":"nm0000597","character":"Harry Howe / Ernie Halliday","urlCharacter":"http://www.imdb.com/character/ch0316153","main":true},{"actorName":"Irène Jacob","urlProfile":"http://www.imdb.com/name/nm0001393","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NTE4OTI2OF5BMl5BanBnXkFtZTcwOTYyNDc3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 July 1966","placeOfBirth":" Suresnes, Seine [now Hauts-de-Seine], France","birthName":"Irene Marie Jacob","height":"5' 4\" (1.63 m)","bio":"This beautiful, dark-haired Swiss actress made a hit with a supporting role in her first film, as the piano teacher in Louis Malle's \"Au revoir, les enfants\" (1987). Educated in London and Geneva, and a Paris resident since the age of 18, Jacob became a promising starlet with her Malle success and followed up with another small role in Jacques Rivette's \"La bande des quatre/The Gang of Four\" (1989). 5Stardom (and a Cannes Film Festival Best Actress award) arrived with Jacob's dual role as two women whose lives are mysteriously linked in Krzysztof Kieslowski's psychological drama \"The Double Life of Veronique\" (1991). She ventured to the US for a ronantic comedy, \"Trusting Beatrice\" (1991), fittingly, about a young French woman's arrival in the US. After the small film \"The Van Gogh Wake\" (1993), she played the ill-fated mother in Agnieszka Holland's touching and acclaimed \"The Secret Garden\" (1993). Several more small French films followed, but it took a reunion with Kieslowski to jump-start Jacob's career again. In his \"Red/Rouge\" (1994), the final segment of his \"Three Colors\" trilogy (and his swan song), Jacob starred as a Swiss fashion model who meets a cynical aging ex-judge (played by Jean-Louis Trintignant) after she runs over his dog. In the film, she served as an emotional and spiritual curative for the old man; the second time, Kieslowski employed Jacob as a woman who offers a man consolation and mystery. 6Jacob followed up as a religious devotee in Michaelango Antonioni's episodic \"Beyond the Clouds/Par-dela les nuages\" (1995), then ventured to England to play Desdemona to Laurence Fishburne's \"Othello\" (also 1995). Jacob has several foreign-made films in the can which have not yet been released in the US: she plays an East Indian beauty with Willem Defoe and Sam Neill in \"Victory\" (filmed in 1994), an ill-fated vacationer in \"Fugueuses/Runaway\" and a French actress in 1948 who befriends a mysterious tramp (Stephen Rea) in \"All Men Are Mortal\" (both shown at Cannes in 1995).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM2NTE4OTI2OF5BMl5BanBnXkFtZTcwOTYyNDc3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001393","name":"Irène Jacob","idIMDB":"nm0001393"},"actorId":"nm0001393","character":"Natasha Scriabina / Anna Belinka","urlCharacter":"http://www.imdb.com/character/ch0316154","main":true},{"actorName":"Bruno Kirby","urlProfile":"http://www.imdb.com/name/nm0456124","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTQ4NTU0OV5BMl5BanBnXkFtZTcwNTA2MDAxMw@@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 April 1949","placeOfBirth":" New York City, New York, USA","birthName":"Bruno Giovanni Quidaciolu Jr.","height":"5' 6½\" (1.69 m)","bio":"Native New Yorker and Italianate Bruno Kirby tended towards assertive, pushy, streetwise characters and was armed with a highly distinctive scratchy tenor voice that complemented his slim eyes and droopy puss and accentuated his deadpan comedic instincts on film and TV. The well-regarded character actor was born Bruno Giovanni Quidaciolu on April 28, 1949, in New York City, the son of Lucille (Garibaldi) and actor Bruce Kirby. He was raised in NY's Hell's Kitchen section. In the late 1960s he moved with his family to California. His career began to rev up in the early 1970s with a part in the TV pilot episode of M*A*S*H (1972) and roles in the films The Young Graduates (1971), The Harrad Experiment (1973), Cinderella Liberty (1973) and Superdad (1973). Most notable of all, however, was his featured part as Young Clemenza alongside Robert De Niro's young Vito Corleone in The Godfather: Part II (1974). Bruno also played Richard S. Castellano's son in the short-lived ethnic sitcom The Super (1972). Coincidentally, Castellano played older Clemenza in the original The Godfather (1972). On stage in the 1980s and 1990s, Bruno appeared in \"On the Money\" (1983) and \"Geniuses\" (1985) and later replaced Kevin Spacey on Broadway in \"Lost in Yonkers\" in 1991. In 1997 he showcased off-Broadway, playing writer Alan Zweibel in \"Bunny Bunny,\" Zweibel's tribute to comedienne Gilda Radner and their close 14-year friendship. Bruno's close association with director Rob Reiner and actor Billy Crystal arguably led to the apex of his film career. In the early 1980s he chummed around with both Reiner and Crystal on a softball team, along with writer/actor/director Christopher Guest. Bruno wound up playing Crystal's best buddy in two of Crystal's biggest box-office hits -- When Harry Met Sally... (1989) and City Slickers (1991). He also appeared in Reiner's cult hit This Is Spinal Tap (1984). Other important film roles for him included his humorless lieutenant in Good Morning, Vietnam (1987), the refined salesman named \"Mouse\" in Tin Men (1987) and Marlon Brando's nephew in The Freshman (1990), that more or less amusingly parodied the \"Godfather\" association. Bruno was equally effective in taut, heavier stories and supported such up-and-coming stars as Leonardo DiCaprio in the dark and downbeat The Basketball Diaries (1995) and Johnny Depp in the mob family-styled drama Donnie Brasco (1997). On TV he was a regular on It's Garry Shandling's Show. (1986), played dogged prosecutor Vincent Bugliosi in the miniseries Helter Skelter (2004), which was a reenactment of the Charles Manson family horror, and appeared on the more popular shows of the day, such as Entourage (2004). He was married for the first time to actress Lynn Sellers in 2004 at age 55. His brother John is a well-known acting coach. An occasional TV director to boot, Bruno was diagnosed with leukemia shortly before his death on August 14, 2006, after having completed his part in the film Played (2006) starring Gabriel Byrne.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NTQ4NTU0OV5BMl5BanBnXkFtZTcwNTA2MDAxMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0456124","name":"Bruno Kirby","idIMDB":"nm0456124"},"actorId":"nm0456124","character":"Max Fisher","urlCharacter":"http://www.imdb.com/character/ch0316152","main":true},{"actorName":"Glenn Plummer","urlProfile":"http://www.imdb.com/name/nm0687625","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzgxNTQzNV5BMl5BanBnXkFtZTgwNzE0MzA0ODE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1961","placeOfBirth":" Richmond, California, USA","birthName":"Glenn E. Plummer","height":"5' 7½\" (1.71 m)","bio":"On a foundation of talent, unbridled dedication and a passionate mindset, Glenn Plummer has enjoyed a successful acting career that spans almost two decades. He has starred in such feature films as: Saw II (2005), co-starring Donnie Wahlberg, Shawnee Smith, Dina Meyer and Beverley Mitchell; Dennis Hopper's Colors (1988), co-starring Sean Penn, Robert Duvall and Maria Conchita Alonso; Menace II Society (1993), co-starring Samuel L. Jackson, Larenz Tate and Anthony Johnson; Showgirls (1995), co-starring Elizabeth Berkley, Kyle MacLachlan and Gina Gershon; The Salton Sea (2002), co-starring Val Kilmer, Vincent D'Onofrio, Anthony LaPaglia and Luiz Guzman; Poolhall Junkies (2002), co-starring Christopher Walken, Chazz Palminteri and Alison Eastwood and the compelling drama South Central (1992) in the break out role of \"O.G.\" Bobby Johnson, one of Glenn's most memorable performances. It was largely this very moving role that helped solidify Glenn as a staple in the African-American film community. Experiencing much crossover success, Glenn took his abilities to cover a wide range of personas and delved into television. Appearing in such television movies and mini-series as, ABC's The Women of Brewster Place (1989) with Oprah Winfrey, Lynn Whitfield and Cicely Tyson; TNT's Heat Wave (1990), L.A.'s Watt's Riots of 1965, alongside Cicely Tyson, Blair Underwood, James Earl Jones and TNT's Reversible Errors (2004), with William H. Macy, Tom Selleck and Monica Potter, Glenn Plummer generated praise and accolades from critics alike for his performances in Showtime's Ruby's Bucket of Blood (2001), co-starring Angela Bassett, as well as his deep, thought-provoking exhibition in HBO's The Corner (2000), with T.K. Carter and Khandi Alexander. Before returning to the big screen, Glenn had a re-occurring role as \"Timmy Rawlins\" in the inaugural season of the Emmy/Golden Globes Award-Winning, television show ER (1994) including the 88-minute pilot. Currently, Glenn Plummer's projects include writing, directing (in his directorial debut), producing and starring in the upcoming horror film VooDoo Curse: The Giddeh (2006), co-starring Randy Brooks, Kira Madallo Sesay and Terry Bookhart.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUzMzgxNTQzNV5BMl5BanBnXkFtZTgwNzE0MzA0ODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0687625","name":"Glenn Plummer","idIMDB":"nm0687625"},"actorId":"nm0687625","character":"Dave Preston","urlCharacter":"http://www.imdb.com/character/ch0316151","main":true},{"actorName":"Udo Kier","urlProfile":"http://www.imdb.com/name/nm0001424","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxODE2MTgwM15BMl5BanBnXkFtZTYwMjYzNTky._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 October 1944","placeOfBirth":" Cologne, North Rhine-Westphalia, Germany","birthName":"Udo Kierspe","height":"5' 11\" (1.8 m)","bio":"Udo Kier was born October 14, 1944 in Cologne, Germany, during World War II. His entrance was just as dramatic as some of his roles. On the evening of his birth Udo's mother requested extra time with her new baby. The nurses had gathered all of the other babies and returned them to the nursery when the hospital was bombed. He and his mother were rescued from underneath the rubble. Udo didn't know much about his father. When Udo was 18 he moved to Britain in order to learn the English language. While there he took a few acting courses. He was eventually offered a role by director Michael Sarne as a gigolo in the film Road to Saint Tropez (1966). While the role was small, it was the beginning of his career in films. His first \"hit\" film was Mark of the Devil (1970) (Mark of the Devil). The film was rated \"V\" for violence and ticket buyers were offered vomit bags before the film started. It was banned in 31 countries but spawned two sequels (both without Kier). The film is notorious for its exploitation of sex and violence (the uncut version was remastered and re-released on video in 1997). Kier met director Paul Morrissey on an airplane trip. Morrissey offered him the lead role in the 3-D Flesh for Frankenstein (1973). It was this film, along with its sister film Blood for Dracula (1974), that made Udo a cult figure. Both Morrissey films are also known as Andy Warhol's Frankenstein and Dracula; however, Andy Warhol was not involved in the production or creation of the films. Both were rated X when released. One of Kier's most vivid memories from \"Flesh for Frankenstein\" was the infamous \"internal organ\" scene. Real animal organs were used that were left unrefrigerated on the set for several hours. Udo had to pull the organs out of a prop dummy with his bare hands and hold them up to his face. He has said he will never forget that smell. When this film was finished the cast and crew began immediately filming \"Blood for Dracula\". Udo remembers both of these films fondly and regards \"Dracula\" over \"Frankenstein\" as his favorite of the two (in 1996 both films were released by Criterion on DVD totally uncut). In the 1970s some of Kier's work included The Salzburg Connection (1972), The Story of O (1975) (The Story of O), Spermula (1976) and Trauma (1976) (House on Straw Hill). Much of his work has been dubbed with someone else's voice. In Suspiria (1977) there were some technical difficulties with the sound while his scene was shot. In the 1980s some of his work included Lulu (1980), The Strange Case of Dr. Jekyll and Miss Osbourne (1981) (The Blood of Dr Jekyll), The Island of the Bloody Plantation (1983) (Escape from Blood Plantation) and Seduction: The Cruel Woman (1985) (Seduction: The Cruel Woman). In the 1980s Kier did very little work outside of Europe. In the 1990s he had a lot more visibility in America and his breakthrough role was as Hans in My Own Private Idaho (1991) (the soundtrack includes the song that Udo performs in the film). Even Cowgirls Get the Blues (1993) reunited Kier with his friend Keanu Reeves yet again. Udo was cast as Pamela Anderson's sidekick in Barb Wire (1996) and played Ron Camp in Ace Ventura: Pet Detective (1994) opposite Jim Carrey. In the 1990s some of the films he was in included L'hôpital et ses fantômes (1994), For Love or Money (1993), Breaking the Waves (1996), The Adventures of Pinocchio (1996), Blade (1998) and Armageddon (1998). Over his 30-year career Udo has worked with several brilliant directors: Paul Morrissey, Charles Matton, Dario Argento, Gus Van Sant and Walerian Borowczyk. he continues to work often with Lars von Trier and is the godfather of Van Trier's child as well as a good friend. Von Trier is currently working on a film entitled Dimension which is a project that spans 30 years. Every year the cast and crew (including Udo) meet to shoot footage. The film will show the actors age 30 years without make-up or special effects. Approximately seen years of footage has already been shot. The premiere will take place in 2024! Kier's acting career ranges from art house films (Europa (1991)) to gore fests (Blackest Heart (1990) (German Chainsaw Massacre)) to television commercials. He says he loves horror films and wants to do more of them. He enjoys playing villains, as he feels it is more interesting because evil has no limits. Currently Udo lives in California and spends much of his time working in Europe, where he receives larger roles and more recognition.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIxODE2MTgwM15BMl5BanBnXkFtZTYwMjYzNTky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001424","name":"Udo Kier","idIMDB":"nm0001424"},"actorId":"nm0001424","character":"Ivan Bliniak","urlCharacter":"http://www.imdb.com/character/ch0316150","main":true},{"actorName":"André Oumansky","urlProfile":"http://www.imdb.com/name/nm0653589","urlPhoto":"","biography":{"dateOfBirth":"15 August 1933","placeOfBirth":"","bio":"André Oumansky was born on August 15, 1933. He is an actor, known for Babel (2006), Marie Antoinette (2006) and Burnt by the Sun (1994).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0653589","name":"André Oumansky","idIMDB":"nm0653589"},"actorId":"nm0653589","character":"Yuri","urlCharacter":"http://www.imdb.com/character/ch0316149","main":true},{"actorName":"Féodor Atkine","urlProfile":"http://www.imdb.com/name/nm0040545","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTQ4YjkzNmUtOWQwOC00M2I5LWFiZTktNjk4YTk0NjkyNGM2L2ltYWdlXkEyXkFqcGdeQXVyMTA0Mjk0NTA@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 February 1948","placeOfBirth":" Paris, France","bio":"Féodor Atkine was born on February 27, 1948 in Paris, France. He is known for his work on Ronin (1998), Love and Death (1975) and Voice Over (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZTQ4YjkzNmUtOWQwOC00M2I5LWFiZTktNjk4YTk0NjkyNGM2L2ltYWdlXkEyXkFqcGdeQXVyMTA0Mjk0NTA@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0040545","name":"Féodor Atkine","idIMDB":"nm0040545"},"actorId":"nm0040545","character":"Romanov","urlCharacter":"http://www.imdb.com/character/ch0316148","main":true},{"actorName":"Janne Kinnunen","urlProfile":"http://www.imdb.com/name/nm0455800","urlPhoto":"","biography":{"dateOfBirth":"25 July 1974","placeOfBirth":" Kontiolahti, Finland","birthName":"Janne Jaakko Tapani Kinnunen","bio":"Janne Kinnunen was born on July 25, 1974 in Kontiolahti, Finland as Janne Jaakko Tapani Kinnunen. He is an actor, known for Karjalan kunnailla (2007), The Life of Aleksis Kivi (2001) and Above Dark Waters (2013). He has been married to Hanna-Marja Kirjavainen since 2002.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0455800","name":"Janne Kinnunen","idIMDB":"nm0455800"},"actorId":"nm0455800","character":"Pekka","urlCharacter":"http://www.imdb.com/character/ch0316147","main":true},{"actorName":"Linda Zilliacus","urlProfile":"http://www.imdb.com/name/nm0350451","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NTE0NjY4Nl5BMl5BanBnXkFtZTgwNDUzMDg0MDI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1977","placeOfBirth":" Helsinki, Finland","birthName":"Linda Elvira Gyllenberg","bio":"Linda Zilliacus was born on April 25, 1977 in Helsinki, Finland as Linda Elvira Gyllenberg. She is an actress, known for Evil (2003), Om Sara (2005) and Isabella (2006). She has been married to Tobias Zilliacus since 2001. They have three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE1NTE0NjY4Nl5BMl5BanBnXkFtZTgwNDUzMDg0MDI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0350451","name":"Linda Zilliacus","idIMDB":"nm0350451"},"actorId":"nm0350451","character":"Maija","urlCharacter":"http://www.imdb.com/character/ch0316146","main":true},{"actorName":"Jevgeni Haukka","urlProfile":"http://www.imdb.com/name/nm0369392","urlPhoto":"","biography":{"bio":"Jevgeni Haukka is known for his work on Ambush (1999), Frontière, 1918 (2007) and Divorce à la finlandaise (2009).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0369392","name":"Jevgeni Haukka","idIMDB":"nm0369392"},"actorId":"nm0369392","character":"Slava","urlCharacter":"http://www.imdb.com/character/ch0316145","main":true},{"actorName":"Marcia Diamond","urlProfile":"http://www.imdb.com/name/nm0224676","urlPhoto":"","biography":{"dateOfBirth":"23 November 1925","placeOfBirth":" Calgary, Alberta, Canada","bio":"Marcia Diamond was born on November 23, 1925 in Calgary, Alberta, Canada. She is an actress, known for Black Christmas (1974), Deranged: Confessions of a Necrophile (1974) and Ticket to Heaven (1981).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0224676","name":"Marcia Diamond","idIMDB":"nm0224676"},"actorId":"nm0224676","character":"Lauren","urlCharacter":"http://www.imdb.com/character/ch0316144","main":true},{"actorName":"Henry Saari","urlProfile":"http://www.imdb.com/name/nm0754340","urlPhoto":"","biography":{"dateOfBirth":"14 January 1964","placeOfBirth":" Pori, Finland","birthName":"Henry Saari","bio":"Henry Saari was born on January 14, 1964 in Pori, Finland. He is an actor and producer, known for Bunny the Killer Thing (2015), Young Gods (2003) and History Is Made at Night (1999).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0754340","name":"Henry Saari","idIMDB":"nm0754340"},"actorId":"nm0754340","character":"Porn Man","urlCharacter":"http://www.imdb.com/character/ch0316143","main":true},{"actorName":"Louise Hodges","urlProfile":"http://www.imdb.com/name/nm0035314","urlPhoto":"","biography":{"dateOfBirth":"27 May 1967","placeOfBirth":" Canterbury, Kent, England, UK","birthName":"Anna Louise Hodgeson","height":"5' 5\" (1.65 m)","bio":"Louise Bridgett Hodges was born in Canterbury, Kent on 27 May 1967. She was the youngest of six children, with four brothers and one sister. Her mother was a nurse during WWII and her father was from Gibraltar and became a welder. Louise left Gads Hill School, Rochester in 1983 and went to dance college. She became a cabaret dancer in Portugal, then returned a year later to go back to college to train as an actress at NW5 Theatre school Kentish town. Louise's first film appearance was in 1988 as an extra in the film, The Rachel Papers. Louise also became a very popular glamour model in the USA and Britain.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0035314","name":"Louise Hodges","idIMDB":"nm0035314"},"actorId":"nm0035314","character":"Porn Woman","urlCharacter":"http://www.imdb.com/character/ch0316142","main":true},{"actorName":"Bob Sherman","urlProfile":"http://www.imdb.com/name/nm0792384","urlPhoto":"","biography":{"dateOfBirth":"16 November 1940","placeOfBirth":" Redwood City, California, USA","bio":"Bob Sherman was born on November 16, 1940 in Redwood City, California, USA. He is known for his work on Hellboy (2004), The Spy Who Loved Me (1977) and The Pink Panther Strikes Again (1976). He died on August 30, 2004 in England.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0792384","name":"Bob Sherman","idIMDB":"nm0792384"},"actorId":"nm0792384","character":"CIA Elder","urlCharacter":"http://www.imdb.com/character/ch0316141","main":true},{"actorName":"Mika Eloranta","urlProfile":"http://www.imdb.com/name/nm0255536","urlPhoto":"","biography":{"bio":"Mika Eloranta is an actor, known for Kummeli Goldrush (1997), History Is Made at Night (1999) and Tie naisen sydämeen (1996).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0255536","name":"Mika Eloranta","idIMDB":"nm0255536"},"actorId":"nm0255536","character":"Bodyguard","urlCharacter":"http://www.imdb.com/character/ch0316140","main":true}],"seasons":[],"idIMDB":"tt0170107","urlIMDB":"http://www.imdb.com/title/tt0170107","business":{"budget":{"money":"$11,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 35 min (95 min)"],"soundMix":["Dolby Digital"],"color":["Color"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":["2,610 m"],"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"4.6","filmingLocations":[{"location":"Helsinki, Finland"}],"rated":"R","awards":[],"votes":"728","type":"Movie","companyCreditsSimple":[{"idCompany":"co0103707","name":"Scala Productions"},{"idCompany":"co0040792","name":"IMA Productions"},{"idCompany":"co0034561","name":"Smile Entertainment"}],"keywords":{"keywords":["love","cold war","running naked","secret code","jazz","espionage","skinny dipping","female full frontal nudity","bondage","sauna","nudity","helsinki finland","satellite","suspense","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:16:43"}}