{"data":{"movies":[{"title":"To Sir, with Love II","originalTitle":"","year":"1996","releaseDate":"19960407","directors":[{"name":"Peter Bogdanovich","id":"nm0000953"}],"writers":[{"name":"E.R. Braithwaite","id":"nm0104075"},{"name":"Philip Rosenberg","id":"nm0742302"}],"runtime":"92 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIzNjc1NzkwNl5BMl5BanBnXkFtZTcwMzQ0OTYxMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Drama"],"plot":"After thirty years teaching in London, Mark Thackeray retires and returns to Chicago. There, however, the challenge of reaching kids in an inner city school proves too much to resist.","simplePlot":"After thirty years teaching in London, Mark Thackeray retires and returns to Chicago. There, however, the challenge of reaching kids in an inner city school proves too much to resist.","actors":[{"actorName":"Sidney Poitier","urlProfile":"http://www.imdb.com/name/nm0001627","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0OTE3MzQ2Nl5BMl5BanBnXkFtZTcwMDc2MDc1NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 February 1927","placeOfBirth":" Miami, Florida, USA","birthName":"Sidney L. Poitier","height":"6' 2½\" (1.89 m)","bio":"A native of Cat Island, The Bahamas (though born in Miami during a mainland visit by his parents), Poitier grew up in poverty as the son of farmers Evelyn (Outten) and Reginald James Poitier, who also drove a cab. He had little formal education and at the age of 15 was sent to Miami to live with his brother, in order to forestall a growing tendency toward delinquency. In the U.S., Poitier first experienced the racial chasm that divides the country, a great shock to a boy coming from a society with a majority of African descent. A determination to find and create opportunities for African-Americans was born in him because of the poor treatment he received on the streets of Miami. At 18, he went to New York, did menial jobs and slept in a bus terminal toilet. A brief stint in the Army as a worker at a veteran's hospital was followed by more menial jobs in Harlem. An impulsive audition at the American Negro Theatre was rejected so forcefully that Poitier dedicated the next six months to overcoming his accent and performance ineptness. On his second try, he was accepted. He was spotted in a rehearsal and given a bit part in a Broadway production of \"Lysistrata,\" for which he got excellent reviews. By the end of 1949, he was having to choose between leading roles on stage and an offer to work for Darryl F. Zanuck in the film No Way Out (1950). Poitier's performance as a doctor treating a white bigot got him plenty of notice and led to more roles, each considerably more interesting and prominent than most African American actors of the time were getting. Nevertheless, the roles were still less interesting and prominent than those white actors routinely obtained. But seven years later, after turning down several projects he considered demeaning, Poitier got a number of roles that catapulted him into a category rarely if ever achieved by an African American man of that time, that of starring leading man. One of the films, The Defiant Ones (1958), gave Poitier his first Academy Award nomination as Best Actor. Five years later, he won the Oscar for Lilies of the Field (1963), the first African American to win for a leading role. Poitier maintained activity on stage, on screen, and in the burgeoning Civil Rights movement. His roles in Guess Who's Coming to Dinner (1967) and To Sir, with Love (1967) were for their time landmarks in the breaking down of social barriers between African Americans and whites, and Poitier's talent, conscience, integrity, and inherent likability placed him on equal footing with the white stars of the day. He took on directing and producing chores in the Seventies, achieving success in both arenas. Although he has reduced the frequency of his roles in recent years, he remains one of the most respected and beloved figures in American cinema of the twentieth century.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ0OTE3MzQ2Nl5BMl5BanBnXkFtZTcwMDc2MDc1NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001627","name":"Sidney Poitier","idIMDB":"nm0001627"},"actorId":"nm0001627","character":"Mark Thackeray","urlCharacter":"http://www.imdb.com/character/ch0023978","main":true},{"actorName":"Christian Payton","urlProfile":"http://www.imdb.com/name/nm0668109","urlPhoto":"","biography":{"dateOfBirth":"24 December 1965","placeOfBirth":" Chicago, Illinois, USA","height":"6' 1\" (1.85 m)","bio":"Christian Payton was drawn to the Industry at an early age, appearing in numerous plays and musicals in schools and his community from the age of 12, adding commercials, voice-overs and movies later. When asked why he chose this path, he said it was necessary for his survival at times. He also helps youth mentoring programs and visits inner city schools to help kids who may be at risk, find the courage to overcome their obstacles. He is writing a book about his remarkable journey.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0668109","name":"Christian Payton","idIMDB":"nm0668109"},"actorId":"nm0668109","character":"Wilsie Carrouthers","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dana Eskelson","urlProfile":"http://www.imdb.com/name/nm0260632","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NDcwMzgyN15BMl5BanBnXkFtZTYwNzc0MzQ4._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 June 1965","placeOfBirth":" USA","height":"5' 6\" (1.68 m)","bio":"Dana Eskelson was born on June 17, 1965 in the USA. She is known for her work on See You Next Tuesday (2013), Movie No. 1 (2017) and The Company Men (2010).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE0NDcwMzgyN15BMl5BanBnXkFtZTYwNzc0MzQ4._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0260632","name":"Dana Eskelson","idIMDB":"nm0260632"},"actorId":"nm0260632","character":"Evie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fernando López","urlProfile":"http://www.imdb.com/name/nm0530112","urlPhoto":"","biography":{"bio":"Fernando López is an actor, known for One Life to Live (1968), Frankie and Johnny (1991) and Thirteen Conversations About One Thing (2001).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0530112","name":"Fernando López","idIMDB":"nm0530112"},"actorId":"nm0530112","character":"Danny Laredo","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Casey Lluberes","urlProfile":"http://www.imdb.com/name/nm1062561","urlPhoto":"","biography":{"bio":"Casey Lluberes is an actress, known for To Sir, with Love II (1996), Blast On (2004) and The Others (2000).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1062561","name":"Casey Lluberes","idIMDB":"nm1062561"},"actorId":"nm1062561","character":"Rebecca Torrado","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Gilio","urlProfile":"http://www.imdb.com/name/nm0318580","urlPhoto":"","biography":{"bio":"Michael Gilio is an actor and writer, known for Kwik Stop (2001), Jolene (2008) and No Sleep 'til Madison (2002).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0318580","name":"Michael Gilio","idIMDB":"nm0318580"},"actorId":"nm0318580","character":"Frankie Davanon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"L.Z. Granderson","urlProfile":"http://www.imdb.com/name/nm0334838","urlPhoto":"","biography":{"bio":"L.Z. Granderson is an actor, known for This Week (1996), To Sir, with Love II (1996) and Zebrahead (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0334838","name":"L.Z. Granderson","idIMDB":"nm0334838"},"actorId":"nm0334838","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Bernadette Speakes","urlProfile":"http://www.imdb.com/name/nm0164662","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjA0NDRkMTctMTkyMS00YWVmLTg0MDAtYWVjMzRiNDk3OTgxL2ltYWdlXkEyXkFqcGdeQXVyMjczMTg5NzI@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 February 1967","placeOfBirth":" Mount Vernon, New York, USA","birthName":"Bernadette Louise Clarke","height":"5' 2\" (1.57 m)","bio":"Bernadette is a native New Yorker, but spent most of her upbringing in Chicago, IL. After graduating from the University of Georgia, with a Bachelors Degree in Theater, Bernadette ventured out to start her career back in Chicago. She co-stared as \"Sheila\" in the movie \"Love Jones\" with Lorenz Tate and Nia Long. She had the fortunate opportunity of being featured along side Oscar Award Winning Actor, Sidney Poitier in \"To Sir with Love\" Part 2. Now, Chief Operating Officer of Dreams Take a Minute Productions, she has been instrumental in a major project, (PHI'LA The Musical), with her husband. She directed the staged musical at the Club Nokia, in October of 2009, and then again at the NAACP Theater Festival, in August 2010. Bernadette is lending her industry expertise in the development of PHI'LA's film project.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjA0NDRkMTctMTkyMS00YWVmLTg0MDAtYWVjMzRiNDk3OTgxL2ltYWdlXkEyXkFqcGdeQXVyMjczMTg5NzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0164662","name":"Bernadette Speakes","idIMDB":"nm0164662"},"actorId":"nm0164662","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Jamie Kolacki","urlProfile":"http://www.imdb.com/name/nm1425237","urlPhoto":"","biography":{"bio":"Jamie Kolacki is an actor, known for Are You Afraid of the Dark?: The Tale of Orpheo's Curse (1994), To Sir, with Love II (1996) and Alleged (2010).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1425237","name":"Jamie Kolacki","idIMDB":"nm1425237"},"actorId":"nm1425237","character":"","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Saundra Santiago","urlProfile":"http://www.imdb.com/name/nm0763639","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMDk5OTM2OF5BMl5BanBnXkFtZTgwMDEzNjIwODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 April 1957","placeOfBirth":" The Bronx, New York, USA","height":"5' 6\" (1.68 m)","bio":"Saundra Santiago is a versatile actress who has worked in television, movies and on the Broadway stage. She holds a BFA from the University of Miami, and an MFA from Southern Methodist University. She is also a member of the Actor's Studio in New York City. She was born and raised in the Bronx. You can catch Saundra on the many episodics she's starred in such as \"Gotham,\" \"True Detective,\" & the upcoming, \"Blue Bloods.\" She portrayed the recurring role of \"Marciela\" in the Fox series, \"Gang Related.\" She played Sonia Braga's sister for Hallmark's Movie, \"Meddling Mom.\" Living in Manhattan, she has guest starred on most NYC's based television shows, such as \"Person of Interest,\" \"Law and Order,\" and the short lived, \"The Unusuals,\" & \"Cashmere Mafia.\" She recurred as Karen Gonzales in the first season of the Glenn Close FX hit, \"Damages.\" Her favorite recurring role or roles, for that matter, were playing twin sisters, Jeannie and Joan Cusamano on HBO's monster hit, \"The Sopranos.\" She is most known for her series regular role as Gina Calabrese in the cult show, \"Miami Vice\" for which she played in for its full 5 seasons. She's performed opposite the great Sidney Poiter, Bill Cosby and Elizabeth Montgomery in several MOWs. She's danced with Al Pacino in \"Carlito's Way,\" mothered Rosario Dawson in \"25th Hour,\" and done many Indies, and shorts. Her latest indie, \"The House that Jack Built,\" was just released in movie theaters, and VOD. Saundra made her Broadway debut in the 1st Tony Award nominated Arthur Miller play, \"A View from the Bridge\" as Catherine starring opposite Tony LoBianco. She was last seen on Broadway in the Tony Award winning \"Nine,\" starring Antonio Banderas. She continued to perform on Broadway and Off in musicals and plays, including \"The Glass Menagerie\" as Amanda Wingfield, \"The House of Bernarda Alba,\" the Tony Award nominated musical, \"Chronicle of a Death Foretold,\" \"Hello Again,\" \"Spike Heels,\" (with Kevin Bacon), and even toured the states and Canada with \"Evita\" as Eva Peron. You can hear Saundra singing on two musical recordings of \"The House of Bernarda Alba,\" and \"Nine.\" She also sang on two of the six Johnny Carson shows she guested on. On daytime, Saundra created the role of \"Carmen Santos\" on CBS's longest running soap opera, Guiding Light. For her role, Santiago was the 2002 recipient of an Alma Award for Ouststanding Actress in a Daytime Drama and nominated several times. She stepped in the portray Carlotta Vega on ABC's \"One Life to Live\" in its final years. You can occasionally catch Saundra singing at the several cabaret clubs in NYC.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEyMDk5OTM2OF5BMl5BanBnXkFtZTgwMDEzNjIwODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0763639","name":"Saundra Santiago","nicknames":["Sandy"],"idIMDB":"nm0763639"},"actorId":"nm0763639","character":"Louisa Rodgriguez","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Cheryl Lynn Bruce","urlProfile":"http://www.imdb.com/name/nm0115440","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTY5NTQ3NF5BMl5BanBnXkFtZTcwNjUxNDgwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Cheryl Lynn Bruce is an actress, known for Stranger Than Fiction (2006), The Fugitive (1993) and Music Box (1989).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM5NTY5NTQ3NF5BMl5BanBnXkFtZTcwNjUxNDgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0115440","name":"Cheryl Lynn Bruce","idIMDB":"nm0115440"},"actorId":"nm0115440","character":"Emily Taylor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lulu","urlProfile":"http://www.imdb.com/name/nm0525801","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NDE3MzMxMV5BMl5BanBnXkFtZTYwNTgyNjE1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1948","placeOfBirth":" Glasgow, Scotland, UK","birthName":"Marie McDonald McLaughlin Lawrie","height":"5' 1\" (1.55 m)","bio":"Born in Glasgow in 1948. As a teenager, she toured the northern clubs with her band, \"the Luvvers\". After her initial success with a cover of \"Shout\" reaching #7 in 1964, Lulu went on to establish herself as one of the biggest-selling British female singers of the 1960s. She made her film début in To Sir, with Love (1967), starring Sidney Poitier, and performed the title song, which went to No. 1 in the U.S., but was only released as a B-side in the UK with the A-side, \"Let's Pretend\", making #11. She was one of four joint winners of the 1968 Eurovision Song Contest with \"Boom Bang-a-Bang\". In 1969, she married The Bee Gees' Maurice Gibb, and moved more into family entertainment, building on the success of her self-titled BBC television show. She recorded a version of David Bowie's song \"The Man Who Sold the World,\" which reached #3 in the UK charts (it hadn't charted for Bowie), and sang the title theme to the James Bond feature The Man with the Golden Gun (1974), both in 1974. After marriage to celebrity hairdresser John Frieda, with whom she had one son, Jordan Frieda, Lulu's career moved more into occasional adverts and pantomimes. The 1990s saw her divorce again and, in 1993, she released the hit album, \"Independence\". Along with her brother, she also penned the song, \"I Don't Wanna Fight\", which was performed by Tina Turner on the soundtrack to What's Love Got to Do with It (1993), and aged 44, she finally topped the UK charts with the British boyband, Take That, with a cover of \"Relight My Fire\". She went on to contribute to the soundtrack of the Tim Rice/Elton John musical, \"Aida\", in 1999, front her own short-lived prime-time UK lottery show on BBC TV, Red Alert with the National Lottery (1999), and starred in the film Whatever Happened to Harold Smith? (1999). In 2002, she released an album of duets entitled \"Together\", featuring the likes of Paul McCartney, Elton John, Cliff Richard, Sting and Ronan Keating, along with a best-selling autobiography. In 2003, she released her \"Greatest Hits\" album, which débuted at #35 in the UK charts.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjM5NDE3MzMxMV5BMl5BanBnXkFtZTYwNTgyNjE1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0525801","name":"Lulu","idIMDB":"nm0525801"},"actorId":"nm0525801","character":"Barbara Pegg","urlCharacter":"http://www.imdb.com/character/ch0023980","main":true},{"actorName":"Judy Geeson","urlProfile":"http://www.imdb.com/name/nm0002096","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExODU1NTc4OF5BMl5BanBnXkFtZTcwMjg1NjgyNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1948","placeOfBirth":" Arundel, Sussex, England, UK","birthName":"Judith Amanda Geeson","height":"5' 4\" (1.63 m)","bio":"Born in Arundel, Sussex in 1948, Judy's father moved the family into London when she was 10 years old and enrolled her and sister Sally Geeson into the Corona Academy, Chiswick. Judy initially wanted to be a ballet dancer but had to change course when she suffered from terrible headaches as a result of some of the moves but acting had always been a great interest and she chose to pursue this, making in her first TV appearance in Dixon of Dock Green (1955) aged 12. Her first major film role was as wayward teenager Pamela Dare opposite Sidney Poitier in To Sir, with Love (1967) at the age of 18. After a very successful film run during the 1960s and 1970s Judy took a trip to the US in October 1984 choosing to stay on for a while. By May 1985 she had met and married Kristoffer Tabori and moved to California. However, the marriage had broken down by 1989. Despite this, Judy chose to stay in the US and she currently lives in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjExODU1NTc4OF5BMl5BanBnXkFtZTcwMjg1NjgyNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002096","name":"Judy Geeson","idIMDB":"nm0002096"},"actorId":"nm0002096","character":"Pamela Dare","urlCharacter":"http://www.imdb.com/character/ch0023979","main":true},{"actorName":"Daniel J. Travanti","urlProfile":"http://www.imdb.com/name/nm0871240","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg2NDAwODk3OF5BMl5BanBnXkFtZTcwMDQ0NTUyOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 March 1940","placeOfBirth":" Kenosha, Wisconsin, USA","birthName":"Danielo Giovanni Travanti","height":"6' 1\" (1.85 m)","bio":"The highly regarded actor Daniel J. Travanti was born Danielo Giovanni Travanty in the southeastern part of Wisconsin on March 7, 1940, but raised for a time in Iowa before returning to his native state. The youngest son of an American Motors auto worker, he showed both athletic and academic prowess in high school on both the football and debate teams. It was during the course of his studies at the University of Wisconsin that Dan first developed a strong, abiding interest in drama, appearing in many college plays while there. He, in fact, turned down top football scholarships in order to pursue his acting dream. Following training at the Yale School of Drama, he co-starred as Nick with Colleen Dewhurst in a touring company of \"Who's Afraid of Virginia Woolf?\" in 1965 and he was off and running. The following year Travanti relocated to Los Angeles, appearing in scores of TV roles as assorted buddies and villains while still billing himself under his actual last name of Travanty (until the early 1970s). Starting with his film debut in the sordid stalker drama Who Killed Teddy Bear (1965) starring Sal Mineo and Juliet Prowse, he found a sturdy, if routine, niche in drama with supporting roles in the films The Organization (1971) and St. Ives (1976), and TV guest spots on The Defenders (1961), Perry Mason (1957), Judd for the Defense (1967), The F.B.I. (1965), Mannix (1967), Cannon (1971), and Barnaby Jones (1973). A consummate professional and chronic overachiever, he quickly approached burnout when he obtained only a measure of the success he expected of himself. Travanti turned to drinking to combat his career dissatisfaction. He finally was forced to seek professional help in 1973 after a collapse and breakdown on stage during the middle of a show in Indianapolis. Following extensive treatment, Travanti did an about-face. In 1978 he earned a master's degree in English literature at Loyola of Marymount in Los Angeles and the following year nabbed a six-month stint on the ABC daytime soap General Hospital (1963). This renewed resurgence came to a peak came after being cast as the serious, somber-looking Capt. Frank Furillo for six seasons on the classic drama Hill Street Blues (1981). The actor not only won both Emmy (twice) and Golden Globe awards, but developed unlikely sex-symbol status at the age of 41. This showcase to a host of highly acclaimed TV minimovie parts, notably that of John Walsh, the father who turned activist after his child was murdered, in Adam (1983) and its sequel, Adam: His Song Continues (1986), and the title role of broadcast journalist Edward R. Murrow in Murrow (1986). Seen less and less in years gone by, Travanti was back briefly sporting a police badge on TV in the series Missing Persons (1993). Avoiding the limelight and focusing on theater endeavors with early millennium stage roles in \"All My Sons\" (2002), Major Barbara (2003) and \"The Last Word...\" (2005), he has been seen of late on such TV crime dramatics as \"Prison Break,\" \"Criminal Minds,\" and \"The Defenders,\" and most recently been spotted in a continuing role on the Boss (2011).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTg2NDAwODk3OF5BMl5BanBnXkFtZTcwMDQ0NTUyOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0871240","name":"Daniel J. Travanti","idIMDB":"nm0871240"},"actorId":"nm0871240","character":"Horace Weaver","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"John Beasley","urlProfile":"http://www.imdb.com/name/nm0064040","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MjU2OTU1MF5BMl5BanBnXkFtZTYwMDgwNzE2._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1943","placeOfBirth":" Omaha, Nebraska, USA","bio":"John Beasley was born on June 26, 1943 in Omaha, Nebraska, USA. He is known for his work on Everwood (2002), The Sum of All Fears (2002) and American Nightmare 2: Anarchy (2014). He has been married to Judy Beasley since 1965. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg5MjU2OTU1MF5BMl5BanBnXkFtZTYwMDgwNzE2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0064040","name":"John Beasley","idIMDB":"nm0064040"},"actorId":"nm0064040","character":"Greg Emory","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0117927","urlIMDB":"http://www.imdb.com/title/tt0117927","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 32 min (92 min)"],"soundMix":["Stereo"],"color":["Color"],"aspectRatio":["1.33 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":null,"printedFilmFormat":["35 mm"]},"rating":"6.2","filmingLocations":[{"location":"Chicago, Illinois, USA"}],"awards":[],"votes":"770","type":"TV Movie","companyCreditsSimple":[{"idCompany":"co0078628","name":"Adelson-Baumgarten Productions"},{"idCompany":"co0051191","name":"TriStar Television"},{"idCompany":"co0069833","name":"Verdon-Cedric Productions"}],"keywords":{"keywords":["gun","high school","juvenile delinquency","tv sequel to theatrical movie","institute","chicago illinois","teacher","sequel"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 10:55:13"}}