{"data":{"movies":[{"title":"The Rage: Carrie 2","originalTitle":"","year":"1999","releaseDate":"19990312","directors":[{"name":"Katt Shea","id":"nm0002240"}],"writers":[{"name":"Stephen King","id":"nm0000175"},{"name":"Rafael Moreu","id":"nm0604360"}],"runtime":"104 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNzMwNjUyNV5BMl5BanBnXkFtZTcwMzk3MTE3NA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Horror","Sci-Fi","Thriller"],"plot":"After the suicide of her only friend, Rachel Lang has never felt more on the outside. The one person who reached out to her, Jessie Ryan, also happens to be part of the popular crowd that lives to torment outsiders like her. However, Rachel has something else that separates her from the rest, secret amazing powers to move things with her mind. Sue Snell, the only survivor of Carrie White's rampage 23 years ago, may hold the key to helping Rachel come to terms with her awesome, but unwanted powers. But as Rachel slowly learns to trust, a terrible trap is being laid for her, and making her angry could prove to be deadly.","simplePlot":"A horrible massacre strikes up after an outcast teenage girl is taunted by a group of high school jocks, all of them unaware of her cutthroat telekinetic powers.","actors":[{"actorName":"Emily Bergl","urlProfile":"http://www.imdb.com/name/nm0004749","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4OTc2NjQzMF5BMl5BanBnXkFtZTcwMzU0NjI0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 April 1975","placeOfBirth":" Milton Keynes, Buckinghamshire, England, UK","birthName":"Emily Anne Bergl","height":"5' 5\" (1.65 m)","bio":"Emily Bergl was born on April 25, 1975 in Milton Keynes, Buckinghamshire, England as Emily Anne Bergl. She is an actress, known for The Rage: Carrie 2 (1999), Blue Jasmine (2013) and Men in Trees (2006).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4OTc2NjQzMF5BMl5BanBnXkFtZTcwMzU0NjI0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004749","name":"Emily Bergl","idIMDB":"nm0004749"},"actorId":"nm0004749","character":"Rachel Lang","urlCharacter":"http://www.imdb.com/character/ch0028171","main":true},{"actorName":"Jason London","urlProfile":"http://www.imdb.com/name/nm0518715","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MTU1NjczNV5BMl5BanBnXkFtZTYwMzU3Mjcz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"7 November 1972","placeOfBirth":" San Diego, California, USA","birthName":"Jason Paul London","height":"5' 11\" (1.8 m)","bio":"Jason London and his twin brother, Jeremy London, were born in San Diego, California, and were raised in Oklahoma and DeSoto, Texas. Jeremy was the first of the two to start auditioning, but it was Jason who nabbed the first role, in the movie The Man in the Moon (1991). Jason also got a role in the dramatic series, I'll Fly Away (1991), starring alongside Sam Waterston, but had to turn it down because of another job. So Jeremy auditioned for the role and got it, instead. Jason is an actor and producer, known for Dazed and Confused (1993), Jason and the Argonauts (2000), and The Rage: Carrie 2 (1999). He has been married to Sofia Karstens since July 16th, 2011. He was previously married to Charlie Spradling.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3MTU1NjczNV5BMl5BanBnXkFtZTYwMzU3Mjcz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0518715","name":"Jason London","idIMDB":"nm0518715"},"actorId":"nm0518715","character":"Jesse Ryan","urlCharacter":"http://www.imdb.com/character/ch0010221","main":true},{"actorName":"Dylan Bruno","urlProfile":"http://www.imdb.com/name/nm0116465","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMDc4ODQxN15BMl5BanBnXkFtZTgwNjk5NTkwNTE@._V1_UY44_CR13,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 September 1972","placeOfBirth":" Milford, Connecticut, USA","birthName":"Dylan A. Bruno","bio":"Dylan Bruno was born on September 6, 1972 in Milford, Connecticut, USA as Dylan A. Bruno. He is an actor and producer, known for Saving Private Ryan (1998), Numb3rs (2005) and The One (2001). He has been married to Emmeli Hultquist since June 24, 2006. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMDc4ODQxN15BMl5BanBnXkFtZTgwNjk5NTkwNTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0116465","name":"Dylan Bruno","idIMDB":"nm0116465"},"actorId":"nm0116465","character":"Mark","urlCharacter":"http://www.imdb.com/character/ch0253674","main":true},{"actorName":"J. Smith-Cameron","urlProfile":"http://www.imdb.com/name/nm0810397","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NTQ3MDU0OV5BMl5BanBnXkFtZTcwMDY2NTA5Nw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"birthName":"Jean Smith","bio":"Gifted stage, film and TV actress J. Smith-Cameron was born Jeanie Smith in Louisville, Kentucky, and raised in Greenville, South Carolina, the daughter of an architect. Known simply as J. Smith by us students of the Florida State University School of Theatre program in the mid-1970s, I was privileged to work with and witness firsthand the extent of J.'s talent early in the game. A slender figure with tight, curly hair and intent, hooded eyes, she showed amazing talent and potential back then. Despite her age, she made a dazzling young \"Anne Frank\" in \"The Diary of Anne Frank\" and an equally touching and memorable \"Helen Keller\" in \"The Miracle Worker\". She was a wonderfully bizarre \"Honey\" in \"Who's Afraid of Virginia Woolf?\" and showed off her skill and versatility in an all-female version of William Shakespeare's \"The Taming of the Shrew\". J.'s older sister, JoAnn, also attended FSU at the time and performed with me in a production of the classic Iranian allegory, \"The Butterfly\" (Shaparak Khanoom), by Bijan Mofid, directed by his actor/brother Ardavan Mofid. JoAnn later became a teacher. J. made her film debut while at FSU, starring in the acclaimed low-budget production of Gal Young Un (1979), directed by Victor Nunez, who later helmed Ulee's Gold (1997). The film, which was shot in Florida, starred and featured several fellow FSU alumni including David Peck, Marc H. Glick, Tim McCormack, Gil Lazier (FSU acting teacher), and Randy Ser (who later won an Emmy as production designer for the Whitney Houston version of The Wonderful World of Disney: Cinderella (1997)). The film would not be released until a few years later in 1979, years after they all graduated. Following college, J. Smith added the hyphenated \"Cameron\" name to her moniker as both a tribute to her great-grandmother and in order to avoid confusion once she joined Actor's Equity. Her peers in college all knew it wouldn't take long for J. to establish herself. A remarkably unique and impressionable lady both on and off stage, J. has the requisite flair for playing neurotic, off-the-wall characters, both comic and tragic. Abnormality has been a specialty on her menu and most often the delightful main course. By 1982, J. was showcasing on Broadway as the crazy, suicidal \"Babe\" in Beth Henley's \"Crimes of the Heart\". She never had to look back. In the course of her veteran on- and off-Broadway career, J. has received a Tony nomination for \"Our Country's Good\" (1991), an Outer Critics Circle award for \"Lend Me a Tenor\" (1989) and an Obie award for her flashy, no-holds-barred portrayal in \"As Bees in Honey Drown\" (1997). Other successes have included \"Wild Honey\", \"Tartuffe\", \"The Memory of Water\" and \"Night Must Fall\" with Matthew Broderick. Her TV and film work has become stronger and more frequent with each decade. She has shown that, even in the smallest role, she can draw attention to herself, as witnessed by her hysterically funny bit as a sexual compulsive in the gay film Jeffrey (1995). She has played various mom parts, some more stable than others, in such films as Harriet the Spy (1996), and The Rage: Carrie 2 (1999). J. met and, later married, playwright/film writer Kenneth Lonergan. They are the parents of daughter, Nellie. She was featured as \"Mabel\", the secretary, in Lonergan's Oscar-nominated breakthrough play-turned-film You Can Count on Me (2000), which made film stars out of Laura Linney and Mark Ruffalo. One of her latest roles of interest was as a shifter/lowlife mother in the cult TV favorite True Blood (2008). The diverse range of her talent is what still separates J. from the much of the pack, and should certainly serve her well for years to come.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk5NTQ3MDU0OV5BMl5BanBnXkFtZTcwMDY2NTA5Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0810397","name":"J. Smith-Cameron","idIMDB":"nm0810397"},"actorId":"nm0810397","character":"Barbara Lang","urlCharacter":"http://www.imdb.com/character/ch0253675","main":true},{"actorName":"Amy Irving","urlProfile":"http://www.imdb.com/name/nm0001388","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNjMxMjgwMF5BMl5BanBnXkFtZTcwNzE0MzQ3Mg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"10 September 1953","placeOfBirth":" Palo Alto, California, USA","birthName":"Amy Davis Irving","height":"5' 4\" (1.63 m)","bio":"Naturally brunette/blue-eyed beauty Amy Davis Irving was born in Palo Alto, California. She is the youngest of three children, and the daughter of influential theatrical/television director and producer Jules Irving, and actress Priscilla Pointer. Her father was of Russian Jewish descent, and her mother's ancestry includes English, Scots-Irish, Welsh, Jewish, and German. Amy was brought up in the world of theater. She was put on stage from the time she was nine-months-old, her father was the director and her mother was the actress, they didn't want baby sitters for their children, so if she wasn't performing, she would stay in the wardrobe department or her mother used to put her in the second row center where she could watch her. And, before she was 10-years-old, she had already worked in several plays. At a young age, Amy Irving was trained at the American Conservatory Theater and Britain's London Academy of Music and Dramatic Arts (L.A.M.A.D.A.). She made her off-Broadway debut at the age of 17 and, from that moment to date, she received critical acclaim, appearing in such plays as: \"Heartbreak House\" (1983), \"The Road to Mecca\" (1988), \"Broken Glass\" (1994), \"The Three Sisters\" (1997), \"The Guys\" (2002), \"Ghosts\" (2002) and \"Celadine\" (2004), among others. In 1976, Amy made her film debut, playing \"Sue Snell\", one of her most unforgettable characters in Stephen King's Carrie (1976), a classic in the horror genre, taken to the big screen by director Brian De Palma. For the next few years, Irving continued working in important films, The Fury (1978), also directed by De Palma, Voices (1979) and The Competition (1980). Later, in 1983, she gave a fine performance as \"Hadass\", in Barbra Streisand's Yentl (1983), and won an Oscar nomination for her great work in that successful film. Two of her best opportunities arrived in the late 80s, when she played \"Anna Anderson\" in Anastasia: The Mystery of Anna (1986) and \"Isabelle Grossman\" in the romantic comedy, Crossing Delancey (1988); she received a Golden Globe nomination for each movie. Amy was married to director Steven Spielberg from 1985 to 1989 and she has a son with him, Max Spielberg. And, in 1990, after her divorce, she met Brazilian director Bruno Barreto while they were working on A Show of Force (1990). They wed a few years later and they have a son (Gabriel). In 1997, Irving made a guest appearance on Woody Allen's Deconstructing Harry (1997) and, in 1999, she came back in the sequel of Carrie (1976), The Rage: Carrie 2 (1999). Unfortunately, her film opportunities were supposedly narrowed in the 90s. However, in the year 2000, she surprised the whole world again when she performed as \"Mary Ann Simpson\", a very funny and sensual, at the same time, English teacher in the film, Bossa Nova et vice versa (2000). She managed to capture this peculiar character very well. After this romantic comedy, Amy had a great opportunity, playing \"Barbara Wakefield\", Michael Douglas' wife in Traffic (2000), the film was a huge success and she won an Actor Award, shared with the rest of the cast. Then, this beautiful and talented actress continued working in remarkable films such as Thirteen Conversations About One Thing (2001), with her Carrie (1976) co-star, Sissy Spacek, in the Walt Disney production, Tuck Everlasting (2002) and in the horror film, Hide and Seek (2005), along with Robert De Niro. Recently, she had an important part as \"Emily Sloane\" in the very-known show, Alias (2001). In addition to her talents as an actress, she is a great dancer and also showed off her vocal talents, singing in films such as Who Framed Roger Rabbit (1988), Honeysuckle Rose (1980), Rumpelstiltskin (1987) and An American Tail: Fievel Goes West (1991). Nowadays, Amy Irving continues working on stage in Broadway productions and spends most of her time with her friends and family, especially with her two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNjMxMjgwMF5BMl5BanBnXkFtZTcwNzE0MzQ3Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001388","name":"Amy Irving","idIMDB":"nm0001388"},"actorId":"nm0001388","character":"Sue Snell","urlCharacter":"http://www.imdb.com/character/ch0010224","main":true},{"actorName":"Zachery Ty Bryan","urlProfile":"http://www.imdb.com/name/nm0117022","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDk1Y2E1OWQtMDdmOC00OWNiLTlkM2UtY2MzOGMxMDJiYWE0L2ltYWdlXkEyXkFqcGdeQXVyMjA4NzI4Mw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"9 October 1981","placeOfBirth":" Aurora, Colorado, USA","birthName":"Zachery Tyler Bryan","height":"5' 11\" (1.8 m)","bio":"Zach was born in Colorado on October 9th 1981 to Jenny and Dwight Bryan. Beginning his acting career at an early age, he has appeared on television and major motion pictures. He is probably best-known for his role as \"Brad Taylor\" on Home Improvement (1991). Movie roles included First Kid (1996), The Rage: Carrie 2 (1999) and ESPN's The Fast and the Furious: Tokyo Drift (2006). Zach has maintained an active television career with guest roles including Shark (2006) and on Veronica Mars (2004). In addition to Zach's on-screen presence, he's busy writing and can be often spotted at the popular Hollywood bar he co-owns, \"Big Wangs\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZDk1Y2E1OWQtMDdmOC00OWNiLTlkM2UtY2MzOGMxMDJiYWE0L2ltYWdlXkEyXkFqcGdeQXVyMjA4NzI4Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0117022","name":"Zachery Ty Bryan","nicknames":["ZTB","Zach"],"idIMDB":"nm0117022"},"actorId":"nm0117022","character":"Eric","urlCharacter":"http://www.imdb.com/character/ch0253676","main":true},{"actorName":"John Doe","urlProfile":"http://www.imdb.com/name/nm0230335","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODUyNzM1NzY0NF5BMl5BanBnXkFtZTYwNjk5ODQ0._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 February 1953","placeOfBirth":" Decatur, Illinois, USA","birthName":"John Nommenson Duchac","bio":"John Doe was born on February 25, 1953 in Decatur, Illinois, USA as John Nommenson Duchac. He is an actor, known for The Bodyguard (1992), Great Balls of Fire! (1989) and The Good Girl (2002). He has been married to Gigi Blair since 1987. They have three children. He was previously married to Exene Cervenka.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODUyNzM1NzY0NF5BMl5BanBnXkFtZTYwNjk5ODQ0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0230335","name":"John Doe","idIMDB":"nm0230335"},"actorId":"nm0230335","character":"Boyd","urlCharacter":"http://www.imdb.com/character/ch0253677","main":true},{"actorName":"Gordon Clapp","urlProfile":"http://www.imdb.com/name/nm0163429","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODE2NjkzNTkyNF5BMl5BanBnXkFtZTgwMDM2MTYzODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 September 1948","placeOfBirth":" North Conway, New Hampshire, USA","birthName":"Gordon Allen Clapp","height":"5' 6\" (1.68 m)","bio":"Gordon Clapp is best known as the Emmy-winning, Tony-nominated actor who charmed audiences as Det. Greg Medavoy on NYPD Blue (1993) and as loudmouth instigator Dave Moss in the 2005 Tony Award-winning Broadway revival of David Mamet's Glengarry Glen Ross (1992). He will appear in the upcoming DreamWorks feature Flags of Our Fathers (2006), directed by Clint Eastwood. Clapp plays gruff General Holland \"Howlin' Mad\" Smith, who helps mastermind the capture of the Japanese island of Iwo Jima during World War II. NYPD Blue finished its twelfth and final season in March, 2005, garnering Clapp a 1998 Emmy Award for Best Supporting Actor in a Drama Series. Glengarry's limited run went from the following May through August, earning Clapp a Tony Award nomination for Best Featured Actor. Clapp has maintained a vibrant career on both sides of the camera. Films include Moonlight Mile (2002), Rules of Engagement (2000) and four films with director John Sayles - Sunshine State (2002), Matewan (1987), Eight Men Out (1988) and Return of the Secaucus Seven (1979). TV appearances include Law & Order: Special Victims Unit (1999), Without a Trace (2002), Deadwood (2004), Less Than Perfect (2002), American Family (2002), Wings (1990), Cheers (1982) and several TV movies. He also executive produced and starred in three short films: Trailer Talk (2006), Bananas (2004), and the award-winning Fast Cars & Babies (2003). Armed with a theater degree from prestigious Williams College, the New Hampshire native spent much of his early career in Canada, in regional and Toronto theater and as a company member of Ottawa's premiere National Arts Centre. His stage and TV work earned him nominations for a Dora Moore Award (Toronto's equivalent to the Tony) and Gemini Award (Canada's equivalent to the Emmy. American regional credits include the Philadelphia Drama Guild, Buffalo's Studio Arena and Boston's Huntington Theater. A talented writer, Clapp's work has appeared in the New York Post, LA Golf and Variety, which earned him a Los Angeles Press Club Award for his humorous account of winning an Emmy.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODE2NjkzNTkyNF5BMl5BanBnXkFtZTgwMDM2MTYzODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0163429","name":"Gordon Clapp","idIMDB":"nm0163429"},"actorId":"nm0163429","character":"Eric's Father","urlCharacter":"http://www.imdb.com/character/ch0253678","main":true},{"actorName":"Rachel Blanchard","urlProfile":"http://www.imdb.com/name/nm0004761","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIwMDE5MDYyMF5BMl5BanBnXkFtZTgwMzMyMzI1NjE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"19 March 1976","placeOfBirth":" Toronto, Ontario, Canada","birthName":"Rachel Louise Blanchard","height":"5' 8\" (1.73 m)","bio":"Rachel attended Havergal college, an all girls school in Toronto. After high school she went on to attend Queens university in Kingston, Ontario Canada. To prepare for her role as Cher in the Clueless (1996) TV series, Rachel actually did go to some high schools in L.A. where she was surprised to find out that the scene was somewhat like the movie portrayed. Rachel is an avid hockey fan, and also enjoys rock climbing. She has a brother and sister.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTIwMDE5MDYyMF5BMl5BanBnXkFtZTgwMzMyMzI1NjE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0004761","name":"Rachel Blanchard","idIMDB":"nm0004761"},"actorId":"nm0004761","character":"Monica","urlCharacter":"http://www.imdb.com/character/ch0253679","main":true},{"actorName":"Charlotte Ayanna","urlProfile":"http://www.imdb.com/name/nm0043662","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTExNTk4NTg2Ml5BMl5BanBnXkFtZTYwNTM2Nzcy._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1976","placeOfBirth":" San Juan, Puerto Rico","birthName":"Charlotte Lopez","height":"5' 7\" (1.7 m)","bio":"Charlotte Ayanna was born on September 25, 1976 in San Juan, Puerto Rico as Charlotte Lopez. She is an actress, known for Training Day (2001), Kate & Leopold (2001) and Dancing at the Blue Iguana (2000).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTExNTk4NTg2Ml5BMl5BanBnXkFtZTYwNTM2Nzcy._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0043662","name":"Charlotte Ayanna","idIMDB":"nm0043662"},"actorId":"nm0043662","character":"Tracy","urlCharacter":"http://www.imdb.com/character/ch0253680","main":true},{"actorName":"Justin Urich","urlProfile":"http://www.imdb.com/name/nm0881948","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwMTgzOTIyNF5BMl5BanBnXkFtZTYwODMwNzAz._V1_UY44_CR18,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1978","placeOfBirth":"","bio":"Justin Urich was born in 1978. He is an actor and writer, known for How High (2001), Monster Man (2003) and The Rage: Carrie 2 (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTIwMTgzOTIyNF5BMl5BanBnXkFtZTYwODMwNzAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0881948","name":"Justin Urich","idIMDB":"nm0881948"},"actorId":"nm0881948","character":"Brad Winters","urlCharacter":"http://www.imdb.com/character/ch0010231","main":true},{"actorName":"Mena Suvari","urlProfile":"http://www.imdb.com/name/nm0002546","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNzEyMDM5MV5BMl5BanBnXkFtZTgwNTY0MjkxMDE@._V1_UY44_CR2,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 February 1979","placeOfBirth":" Newport, Rhode Island, USA","birthName":"Mena Alexandra Suvari","height":"5' 4\" (1.63 m)","bio":"Mena Alexandra Süvari was born in Newport, Rhode Island to Candice (Thompson), a nurse, and Ando Süvari, a psychiatrist. Her father was Estonian and her mother is of Greek, English, and German descent. Mena was raised in a Rhode Island home that was built in 1870 and had early aspirations of becoming an archaeologist before moving to Charleston, SC where she then attended a nationwide modeling competition that landed her a contract with Wilhelmina Models. She later moved out to Los Angeles under their children's theatrical division WeeWillys, which began her acting career. Her film debut was made working with director Gregg Araki in the cult-classic Nowhere (1997) which was soon followed up by the blockbuster American Pie (1999), for which she did her own singing, and the five-time Oscar-awarded American Beauty (1999) directed by Sam Mendes, in which she was nominated for a BAFTA Award as Best Supporting Actress. People Weekly magazine titled an article about her, \"All-American Girl\" (1999), and she was declared as the most \"patriotic\" artist of 2000 by Entertainment Weekly magazine. In 2001, as part of the blockbuster franchise, she added American Pie 2 (2001) to that list, and then more than a decade later with American Reunion (2012). She reunited with Jason Biggs in Amy Heckerling's romantic comedy Loser (2000) and then continued to showcase her range in ability to costar with John Leguizamo in Jonas Åkerlund's cult-classic Spun (2002) and then alongside Jennifer Aniston in Rob Reiner's Rumor Has It (2005) and Tony Scott's Domino (2005). Mena was named #69 on the Maxim magazine \"Hot 100 of 2005\" list, was ranked #73 on the Maxim magazine \"Hot 100 of 2007\" list, and #52 on the Maxim magazine \"Hot 100 of 2008\" list. Mena rounded out her creative pursuits by playing the iconic Black Dahlia in Ryan Murphy's television series American Horror Story (2011) and continued working in the medium by following up with an arc in the hit series Chicago Fire (2013), as well as leading the Amazon pilot Hysteria (2014) and WeTv's mini-series South of Hell (2015), executive produced by both Eli Roth and Jason Blum for Blumhouse Productions. Mena is set to star opposite Alicia Silverstone for John Wells and TV Land's American Woman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTkwNzEyMDM5MV5BMl5BanBnXkFtZTgwNTY0MjkxMDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002546","name":"Mena Suvari","idIMDB":"nm0002546"},"actorId":"nm0002546","character":"Lisa","urlCharacter":"http://www.imdb.com/character/ch0134843","main":true},{"actorName":"Eli Craig","urlProfile":"http://www.imdb.com/name/nm0185848","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MzA2MTMyN15BMl5BanBnXkFtZTgwNTcxMTEyNDE@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1972","placeOfBirth":" Los Angeles County, California, USA","birthName":"Elijah M. Craig","bio":"Eli Craig was born on May 25, 1972 in Los Angeles County, California, USA as Elijah M. Craig. He is a director and actor, known for Tucker & Dale fightent le mal (2010), Zombieland (2013) and The Tao of Pong (2004). He has been married to Sasha Craig since September 5, 2004. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MzA2MTMyN15BMl5BanBnXkFtZTgwNTcxMTEyNDE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0185848","name":"Eli Craig","idIMDB":"nm0185848"},"actorId":"nm0185848","character":"Chuck","urlCharacter":"http://www.imdb.com/character/ch0253681","main":true},{"actorName":"Eddie Kaye Thomas","urlProfile":"http://www.imdb.com/name/nm0858776","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MTk0MDY2N15BMl5BanBnXkFtZTcwMDU1NTQ0NA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"31 October 1980","placeOfBirth":" New York City, New York, USA","height":"6' (1.83 m)","bio":"Began acting at the age of seven in his hometown of New York City. By 10, he had appeared in \"Richard III\" with the Brooklyn Shakespeare Company. He made his Broadway debut at 12 as an understudy in John Guare's Lincoln Center Production of \"Four Baboons Adoring The Sun\". He has numerous other theater credits as well as his many film roles. He divides his time between Los Angeles and New York.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjI0MTk0MDY2N15BMl5BanBnXkFtZTcwMDU1NTQ0NA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0858776","name":"Eddie Kaye Thomas","nicknames":["Leaf"],"idIMDB":"nm0858776"},"actorId":"nm0858776","character":"Arnie","urlCharacter":"http://www.imdb.com/character/ch0253682","main":true},{"actorName":"Clint Jordan","urlProfile":"http://www.imdb.com/name/nm0429888","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzOTUxOTIzM15BMl5BanBnXkFtZTgwNTUyMzIxMTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"bio":"Clint Jordan is an actor and composer, known for Down to the Bone (2004), Virgil Bliss (2001) and The Rage: Carrie 2 (1999).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzOTUxOTIzM15BMl5BanBnXkFtZTgwNTUyMzIxMTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0429888","name":"Clint Jordan","idIMDB":"nm0429888"},"actorId":"nm0429888","character":"Sheriff Kelton","urlCharacter":"http://www.imdb.com/character/ch0253683","main":true}],"seasons":[],"idIMDB":"tt0144814","urlIMDB":"http://www.imdb.com/title/tt0144814","business":{"budget":{"money":"$21,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$7,065,123","country":"USA","day":"14","month":"03","year":"1999","remarks":"2,286 Screens"},{"money":"£49,011","country":"UK","day":"21","month":"11","year":"1999","remarks":"132 Screens"}],"gross":[{"money":"$17,757,087","country":"USA","day":"18","month":"07","year":"1999","remarks":""},{"money":"$17,753,790","country":"USA","day":"11","month":"07","year":"1999","remarks":""},{"money":"$17,738,664","country":"USA","day":"27","month":"06","year":"1999","remarks":""},{"money":"$17,724,692","country":"USA","day":"20","month":"06","year":"1999","remarks":""},{"money":"$17,706,968","country":"USA","day":"13","month":"06","year":"1999","remarks":""},{"money":"$17,678,027","country":"USA","day":"06","month":"06","year":"1999","remarks":""},{"money":"$17,639,514","country":"USA","day":"30","month":"05","year":"1999","remarks":""},{"money":"$17,584,548","country":"USA","day":"23","month":"05","year":"1999","remarks":""},{"money":"$17,528,516","country":"USA","day":"16","month":"05","year":"1999","remarks":""},{"money":"$17,452,447","country":"USA","day":"09","month":"05","year":"1999","remarks":""},{"money":"$17,365,658","country":"USA","day":"02","month":"05","year":"1999","remarks":""},{"money":"$17,258,334","country":"USA","day":"25","month":"04","year":"1999","remarks":""},{"money":"$17,128,021","country":"USA","day":"18","month":"04","year":"1999","remarks":""},{"money":"$16,900,265","country":"USA","day":"11","month":"04","year":"1999","remarks":""},{"money":"$16,398,714","country":"USA","day":"04","month":"04","year":"1999","remarks":""},{"money":"$15,202,439","country":"USA","day":"28","month":"03","year":"1999","remarks":""},{"money":"$12,615,614","country":"USA","day":"21","month":"03","year":"1999","remarks":""},{"money":"$7,065,123","country":"USA","day":"14","month":"03","year":"1999","remarks":""},{"money":"$17,762,705 (USA)","country":"","day":null,"month":null,"year":null,"remarks":null},{"money":"£49,011","country":"UK","day":"21","month":"11","year":"1999","remarks":""},{"money":"$2,400,000","country":"Worldwide","day":"15","month":"08","year":"1999","remarks":"except USA"},{"money":"SGD 497,470","country":"Singapore","day":"01","month":"09","year":"1999","remarks":""},{"money":"SGD 477,065","country":"Singapore","day":"25","month":"08","year":"1999","remarks":""},{"money":"SGD 430,765","country":"Singapore","day":"18","month":"08","year":"1999","remarks":""},{"money":"SGD 313,263","country":"Singapore","day":"11","month":"08","year":"1999","remarks":""},{"money":"ESP 122,912,195","country":"Spain","day":"13","month":"07","year":"2001","remarks":""}],"weekendGross":[{"money":"$3,713,759","country":"USA","day":"21","month":"03","year":"1999","remarks":"2,286 Screens"},{"money":"$7,065,123","country":"USA","day":"14","month":"03","year":"1999","remarks":"2,286 Screens"},{"money":"£49,011","country":"UK","day":"21","month":"11","year":"1999","remarks":"132 Screens"}],"admissions":[{"money":"3,579","country":"Netherlands","day":"31","month":"12","year":"1999","remarks":""},{"money":"207,823","country":"Spain","day":"13","month":"07","year":"2001","remarks":""}],"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"25","month":"04","year":"1998","remarks":null},null],"copyrightHolder":"copyright 1999 United Artists Pictures Inc."},"technical":{"runtime":["1 hr 44 min (104 min)"],"soundMix":["DTS","Dolby SR"],"color":["Black and White","Color"],"aspectRatio":["1.85 : 1"],"camera":["Panavision Camera and Lenses"],"laboratory":["DeLuxe, USA (prints)","Technicolor, USA (dailies)"],"filmLength":["2,943 m (Spain)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"4.6","metascore":"42","filmingLocations":[{"location":"Charlotte, North Carolina, USA"}],"rated":"R","awards":[{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 2000","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Performance by a Younger Actor/Actress","names":[{"name":"Emily Bergl","id":"nm0004749","role":null}]}]}]},{"award":"Csapnivalo Awards 2000","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Slate","categories":[{"category":"Best Horror Movie","names":[]}]}]},{"award":"The Stinkers Bad Movie Awards 1999","titlesAwards":[{"titleAwardOutcome":"Won Stinker Award","categories":[{"category":"Worst Sequel or Prequel","names":[]}]}]}],"votes":"13,453","type":"Movie","companyCreditsSimple":[{"idCompany":"co0026841","name":"United Artists"},{"idCompany":"co0072024","name":"Red Bank Films"}],"keywords":{"keywords":["prom","high school","suicide","teenage girl","party","f rated","pyrokinesis","female killer","slasher killer","slasher flick","slasher","teen horror","characters killed one by one","body count","dead teenager","vomiting","lifting weights","weightlifting","shower room","boys' shower room","boys' locker room","bare chested male","undressing","undershirt","boxer shorts","male underwear","male in towel","man wearing towel","male in shower","group shower","men's locker room","locker room","blond man","friendship between men","jock strap","man forced to strip","male rear nudity","male nudity","abuse of power","suspense","digit in title","title directed by female","femme fatale","second part","woman with glasses","sex","bra","woman on top","white panties","white bra","tank top","strapless bra","sex video","sex in car","red dress","public humiliation","post coital scene","panties","makeover","lipstick","hidden camera","head shaving","girl in bra and panties","cowboy sex position","blue dress","abandoned school","face slap","video camera","wrong side of the tracks","teen angst","teacher student relationship","small town","lone wolf","innocence lost","guidance counselor","anger","female rear nudity","female nudity","person on fire","underwater","shoplifting","school bus","rain","paint","locker","haircut","hair clippers","foster parent","falling from height","drowning","dream","asylum","ambulance","makeup","dark heroine","american football","house","football player","nudity","swimming pool","blood","sequel","splatter","returning character killed off","revenge","loss of virginity","spear gun","teen suicide","decapitation","tattooing","telekinesis","mass murder","laughing","mirror","fragments of glass","murder","dog","mother","police investigation","impalement","telephone","body landing on a car","ruins","fire","teacher","notebook","number in title","character name in title","surprise ending","forced to strip"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:59:04"}}