{"data":{"movies":[{"title":"Chute libre","originalTitle":"Falling Down","year":"1993","releaseDate":"19930226","directors":[{"name":"Joel Schumacher","id":"nm0001708"}],"writers":[{"name":"Ebbe Roe Smith","id":"nm0808076"}],"runtime":"113 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BYjcxMzM3OWMtNmM3Yy00YzBkLTkxMmQtMDk4MmM3Y2Y4MDliL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1.jpg","countries":["France","USA","UK"],"languages":["English","Spanish","Korean"],"genres":["Crime","Drama","Thriller"],"plot":"On the day of his daughter's () birthday, William \"D-Fens\" Foster () is trying to get to his estranged ex-wife's () house to see his daughter. He has a breakdown and leaves his car in a traffic jam in Los Angeles and decides to walk. Along the way he stops at a convenience store and tries to get some change for a phone call but the owner, Mister Lee (), does not give him change. This destabilizes William who then breaks apart the shop with a baseball bat and goes to an isolated place to drink a coke. Two gangsters ( & ) threaten him and he reacts by hitting them with the bat. D-FENS continues walking and stops at a phone booth. The gangsters hunt him down with their gang and shoot at him but crash their car. William goes nuts and takes their gym bag with weapons proceeding in his journey of rage against injustice. Meanwhile Sergeant Martin Prendergast (), who is working on his last ...","simplePlot":"A borderline personality disordered defense worker frustrated with the various flaws he sees in society, begins to psychotically and violently lash out against them.","actors":[{"actorName":"Michael Douglas","urlProfile":"http://www.imdb.com/name/nm0000140","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzMzOTQ3MF5BMl5BanBnXkFtZTcwOTE0MzY1Mw@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 September 1944","placeOfBirth":" New Brunswick, New Jersey, USA","birthName":"Michael Kirk Douglas","height":"5' 10\" (1.78 m)","bio":"An actor with over forty years of experience in theatre, film, and television, Michael Douglas branched out into independent feature production in 1975 with the Academy Award-winning One Flew Over the Cuckoo's Nest (1975). Since then, as a producer and as an actor-producer, he has shown an uncanny knack for choosing projects that reflect changing trends and public concerns. Over the years, he has been involved in such controversial and politically influential motion pictures as One Flew Over the Cuckoo's Nest (1975), The China Syndrome (1979) and Traffic (2000), and such popular films as Fatal Attraction (1987) and Romancing the Stone (1984). Michael Douglas was born in New Brunswick, New Jersey, to actors Diana Douglas (Diana Love Dill) and Kirk Douglas (born Issur Danielovitch). His paternal grandparents were Belarusian Jewish immigrants, while his mother was born in Bermuda, the daughter of a local Attorney General, Lieutenant Colonel Thomas Melville Dill; Diana's family had long been established in both Bermuda and the United States. Douglas's parents divorced when he was six, and he went to live with his mother and her new husband. Only seeing Kirk on holidays, Michael attended Eaglebrook school in Deerfield, Massachusetts, where he was about a year younger than all of his classmates. Douglas attended the elite preparatory Choate School and spent his summers with his father on movie sets. Although accepted at Yale, Douglas attended the University of California, Santa Barbara. Deciding he wanted to be an actor in his teenage years, Michael often asked his father about getting a \"foot in the door\". Kirk was strongly opposed to Michael pursuing an acting career, saying that it was an industry with many downs and few ups, and that he wanted all four of his sons to stay out of it. Michael, however, was persistent, and made his film debut in his father's film Cast a Giant Shadow (1966). After receiving his B.A. degree in 1968, Douglas moved to New York City to continue his dramatic training, studying at the American Place Theatre with Wynn Handman, and at the Neighborhood Playhouse, where he appeared in workshop productions of Pirandello's Six Characters in Search of an Author (1976) and Thornton Wilder's Happy Journey (1963). A few months after he arrived in New York, Douglas got his first big break, when he was cast in the pivotal role of the free-spirited scientist who compromises his liberal views to accept a lucrative job with a high-tech chemical corporation in the CBS Playhouse production of Ellen M. Violett's drama, The Experiment, which was televised nationwide on February 25, 1969. Douglas' convincing portrayal won him the leading role in the adaptation of John Weston's controversial novel, Hail, Hero! (1969), which was the initial project of CBS's newly organized theatrical film production company, Cinema Center Films. Douglas starred as a well-meaning, almost saintly young pacifist determined not only to justify his beliefs to his conservative parents but also to test them under fire in the jungles of Indochina. His second feature, Adam at Six A.M. (1970) concerned a young man's search for his roots. Douglas next appeared in the film version of Ron Cowen's play Summertree (1971), produced by 'Kirk Douglas'' Bryna Company, and then Napoleon and Samantha (1972), a sentimental children's melodrama from the Walt Disney studio. In between film assignments, he worked in summer stock and off-Broadway productions, among them \"City Scenes\", Frank Gagliano's surrealistic vignettes of contemporary life in New York, John Patrick Shanley's short-lived romance \"Love is a Time of Day\" and George Tabori's \"Pinkville\", in which he played a young innocent brutalized by his military training. He also appeared in the made-for-television thriller, \"When Michael Calls\", broadcast by ABC-TV on February 5, 1972 and in episodes of the popular series \"Medical Center\" and \"The FBI\". Impressed by Douglas' performance in a segment of The F.B.I. (1965), producer 'Quinn Martin' signed the actor for the part of Karl Malden's sidekick in the police series \"The Streets of San Francisco\", which premiered September of 1972 and became one of ABC's highest-rated prime-time programs in the mid-1970s. Douglas earned three successive Emmy Award nominations for his performance and he directed two episodes of the series. During the annual breaks in the shooting schedule for The Streets of _San Francisco (1972)_, Douglas devoted most of his time to his film production company, Big Stick Productions, Ltd., which produced several short subjects in the early 1970s. Long interested in producing a film version of Ken Kesey's grimly humorous novel One Flew Over the Cuckoo's Nest (1975), Douglas purchased the movie rights from his father and began looking for financial backing. After a number of major motion picture studios turned him down, Douglas formed a partnership with Saul Zaentz, a record industry executive, and the two set about recruiting the cast and crew. Douglas still had a year to go on his contract for \"The Streets of San Francisco\", but the producers agreed to write his character out of the story so that he could concentrate on filming \"Cuckoo's Nest\". A critical and commercial success, One Flew Over the Cuckoo's Nest (1975) won five Academy Awards, including Best Picture, Best Director, Best Screenplay, Best Actor and Best Actress, and went on to gross more than $180 million at the box office. Douglas suddenly found himself in demand as an independent producer. One of the many scripts submitted to him for consideration was Mike Gray's chilling account of the attempted cover-up of an accident at a nuclear power plant. Attracted by the combination of social relevance and suspense, Douglas immediately bought the property. Deemed not commercial by most investors, Douglas teamed up with Jane Fonda and her own motion picture production company, IPC Films. A Michael Douglas-IPC Films co-production, The China Syndrome (1979) starred Jack Lemmon, Jane Fonda, and 'Michael Douglas' and received Academy Award nominations for Lemmon and Fonda, as well as for Best Screenplay. The National Board of Review named the film one of the best films of the year. Despite his success as a producer, Douglas resumed his acting career in the late 1970s, starring in Michael Crichton's medical thriller Coma (1978) with Genevieve Bujold, Claudia Weill's feminist comedy It's My Turn (1980) starring Jill Clayburgh, and Peter Hyams' gripping tale of modern-day vigilante justice, \"The Star Chamber\" (1983). Douglas also starred in Le vainqueur (1979), as a compulsive quitter who sacrifices everything to take one last shot at the Olympics, and as Zach the dictatorial director/choreographer in Richard Attenborough's screen version of the Broadway's longest running musical A Chorus Line (1985). Douglas' career as an actor/producer came together again in 1984 with the release of the tongue-in-cheek romantic fantasy \"Romancing the Stone\". Douglas had begun developing the project several years earlier, and with Kathleen Turner as Joan Wilder, the dowdy writer of gothic romances, Danny DeVito as the feisty comic foil Ralphie and Douglas as Jack Colton, the reluctant soldier of fortune, \"Romancing\" was a resounding hit and grossed more than $100 million at the box office. Douglas was named Producer of the Year in 1984 by the National Association of Theater Owners. Douglas, Turner and DeVito reteamed in 1985 for the successful sequel The Jewel of the Nile (1985). It took Douglas nearly two years to convince Columbia Pictures executives to approve the production of Starman (1984), an unlikely tale of romance between an extraterrestrial, played by 'Jeff Bridges', and a young widow, played by Karen Allen. Starman (1984) was the sleeper hit of the 1984 Christmas season and earned an Oscar nomination for Best Actor for 'Jeff Bridges'. In 1986 Douglas created a television series based on the film for ABC which starred 'Robert Hays'. After a lengthy break from acting, Douglas returned to the screen in 1987 appearing in two of the year's biggest hits. He starred opposite Glenn Close in the phenomenally successful psychological thriller, \"Fatal Attraction\", which was followed by his performance as ruthless corporate raider Gordon Gekko in 'Oliver Stone''s Wall Street (1987), earning him the Academy Award for Best Actor. Douglas next starred in Ridley Scott's thriller Black Rain (1989) and then teamed up again with 'Kathleen Turner' and Danny DeVito in the black comedy The War of the Roses (1989) which was released in 1989. In 1988 Douglas formed Stonebridge Entertainment, Inc. which produced Flatliners (1990), directed by Joel Schumacher and starred Kiefer Sutherland, 'Julia Roberts', 'Kevin Bacon' and 'William Baldwin' and Radio Flyer (1992) starring Lorraine Bracco and directed by Richard Donner. Douglas followed with David Seltzer's adaptation of Susan Issac's best-selling novel, \"Shining Through\", opposite Melanie Griffith. In 1992 he starred with Sharon Stone in the erotic thriller from 'Paul Verhoeven' Basic Instinct (1992), one of the year's top grossing films. Douglas gave one of his most powerful performances opposite Robert Duvall in Joel Schumacher's controversial drama Chute libre (1993). That year he also produced the hit comedy \"Made in America\" starring Whoopi Goldberg, Ted Danson and Will Smith. In 1994/95 he starred with Demi Moore in Barry Levinson's \"Disclosure,.\" based on the best seller by Michael Crichton. In 1995 Douglas portrayed the title role in Rob Reiner's romantic comedy The American President (1995) opposite Annette Bening, and in 1997, starred in The Game (1997) directed by David Fincher and co-starring 'Sean Penn'. Douglas formed Douglas/Reuther Productions with partner Steven Reuther in May 1994. The company, under the banner of Constellation Films, produced, L'ombre et la proie (1996), starring Douglas and Val Kilmer, and John Grisham's The Rainmaker (1997), based on John Grisham's best selling novel, directed by Francis Ford Coppola and starring Matt Damon,Claire Danes, Danny DeVito, Jon Voight, Mickey Rourke, Mary Kay Place, Virginia Madsen, Andrew Shue, 'Teresa Wright', Johnny Whitworth and 'Randy Travis'. Michael Douglas and Steve Reuther also produced John Woo's action thriller Face/Off (1997) starring 'John Travolta' and Nicolas Cage, which proved to be one of '97's major hits. In 1998, ' Michael Douglas' starred with Gwyneth Paltrow and Viggo Mortensen in the mystery thriller A Perfect Murder (1998), and formed a new production company, 2000 was a milestone year for Douglas. \"Wonder Boys\" opened in February 2000 to much critical acclaim. Directed by Curtis Hanson and co-starring Tobey Maguire, Frances McDormand, Robert Downey Jr. and 'Katie Holmes', Douglas starred in the film as troubled college professor Grady Tripp. Michael was nominated for a Golden Globe and a BAFTA Film award for his performance. \"Traffic\" was released by USA Films on December 22, 2000 in New York and Los Angeles went nationwide in January 2001. Douglas played the role of Robert Wakefield, a newly appointed drug czar confronted by the drug war both at home and abroad. Directed by Steven Soderbergh and co-starring Don Cheadle, Benicio del Toro, Amy Irving, Dennis Quaid and Catherine Zeta-Jones, \"Traffic\" was named Best Picture by New York Film Critics, won Best Ensemble Cast at the SAG Awards, won four Academy Awards (Best Screenplay, Best Editing, Best Director, and Best Supporting Actor for Benicio del Toro) and has been recognized over on over 175 top ten lists. In 2001, Douglas produced and played a small role in USA Films' outrageous comedy \"One Night at McCool's\" starring Liv Tyler, Matt Dillon, John Goodman, Paul Reiser, and was directed by Harald Zwart. \"McCool's\" was the first film by Douglas' company Furthur Films. Also in 2001, Douglas starred in \"Don't Say A Word\" for 20th Century Fox. The psychological thriller, directed by Gary Fleder, also starred Sean Bean, Famke Janseen and Brittany Murphy. In 2002, Douglas appeared in a guest role on the hit NBC comedy \"Will & Grace\", and received an Emmy Nomination for his performance. Douglas starred in two films in 2003. MGM/BVI released the family drama \"It Runs in the Family\", which Douglas produced and starred with his father Kirk Douglas, his mother Diana Douglas and his son Cameron Douglas, Rory Culkin and Bernadette Peters. He also starred in the Warner Bros. comedy \"The-In Laws\", with Albert Brooks, Candice Bergen Ryan Reynolds. In 2004 Douglas, along with his father Kirk, filmed the intimate HBO documentary \"A Father, A Son... Once Upon a Time in Hollywood\". Directed by award-winning filmmaker Lee Grant, the documentary examines the professional and personal lives of both men, and the impacts they each made on the motion picture industry. In summer 2005, Douglas produced and starred in \"The Sentinel\", which was released by 20th Century Fox in spring 2006. Based on the Gerald Petievich novel and directed by Clark Johnson, \"The Sentinel\" is a political thriller set in the intriguing world of the Secret Service. Douglas stars with Keifer Sutherland, Eva Longoria and Kim Bassinger. Douglas filmed \"You, Me & Dupree\", starring with Owen Wilson, Kate Hudson and Matt Dillon. The comedy is direct by Anthony and Joe Russo, and was released by Universal Pictures during the summer of 2006. In 2007 he made \"King of California\", co-starring Evan Rachel Wood and is written and directed by Michael Cahill, and produced by Alexander Payne and Michael London. Michael had two films released in early '09, \"Beyond A Reasonable Doubt\" directed by Peter Hyams and \"Ghosts of Girlfriend's Past\" starring Matthew McConaughey and Jennifer Garner directed by Mark Waters. He followed with the drama \"Solitary Man\" directed by Brian Koppelman and David Levien, co-starring Susan Sarandon, Danny DeVito, Mary Louise-Parker, and Jenna Fischer, produced by Paul Schiff and Steven Soderbergh and in Fall '10 starred in \"Wall Street 2 - Money Never Sleeps\" reprising his Oscar winning role as Gordon Gekko and once again was nominated for a Golden Globe for his performance. Again directed by Oliver Stone, he co-starred with Shia Labeouf, Cary Mulligan, Josh Brolin, Frank Langella and Susan Sarandon. Douglas had a cameo role in Steven Soderbergh's action thriller \"Haywire.\" \"Behind the Candelabra\" based on the life of musical '70's/80's icon Liberace and his partner Scott Thorson, directed by Steven Soderbergh costarring Matt Damon, premiered on HBO in May 2013. Douglas won an Emmy, Golden Globe and SAG Award as Best Actor in a television movie or mini series for his performance as the famed entertainer. He followed with the buddy comedy \"Last Vegas\" directed by John Turtletaub co-starring Robert DeNiro, Morgan Freeman and Kevin Kline and the romantic comedy \"And So It Goes\" co-starring Diane Keaton directed by Rob Reiner. Douglas recently starred in and producing the thriller \"Beyond The Reach\" directed by Jean-Baptiste Leonetti costarring Jeremy Irvine and portrays Dr. Hank Pym in Marvel's \"Ant Man\" opposite Paul Rudd. It will be his first venture into the realm of comic book action adventure. Most recently he completed a spy thriller \"Unlocked\" co-starring Noomi Rapace, Orlando Bloom, John Malkovich and is directed by Michael Apted. In 1998 Douglas was made a United Nations Messenger of Peace by Kofi Annan. His main concentrations are nuclear non-proliferation and the control of small arms. He is on the Board of Ploughshares Foundation and The Nuclear Threat Initiative. Michael Douglas was recipient of the 2009 AFI Lifetime Achievement as well as the Producers Guild Award that year. In Spring '10 he received the New York Film Society's Charlie Chaplin Award. Douglas has hosted 11 years of \"Michael Douglas and Friends\" Celebrity Golf Event which has raised over $6 million for the Motion Picture and Television Fund. Douglas is very passionate about the organization, and each year he asks his fellow actors and to come out and show that \"we are an industry that takes care of own\". Douglas is married to Catherine Zeta-Jones. The couple has one son, Dylan, and one daughter, Carys. Douglas also has one son, Cameron, from a previous marriage.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQ3NzMzOTQ3MF5BMl5BanBnXkFtZTcwOTE0MzY1Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000140","name":"Michael Douglas","idIMDB":"nm0000140"},"actorId":"nm0000140","character":"D-Fens","urlCharacter":"http://www.imdb.com/character/ch0010619","main":true},{"actorName":"Robert Duvall","urlProfile":"http://www.imdb.com/name/nm0000380","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjk1MjA2Mjc2MF5BMl5BanBnXkFtZTcwOTE4MTUwMg@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1931","placeOfBirth":" San Diego, California, USA","birthName":"Robert Selden Duvall","height":"5' 9½\" (1.77 m)","bio":"Veteran actor and director Robert Selden Duvall was born on January 5, 1931, in San Diego, CA, to Mildred Virginia (Hart), an amateur actress, and William Howard Duvall, a career military officer who later became an admiral. Duvall majored in drama at Principia College (Elsah, IL), then served a two-year hitch in the army after graduating in 1953. He began attending The Neighborhood Playhouse School of the Theatre In New York City on the G.I. Bill in 1955, studying under Sanford Meisner along with Dustin Hoffman, with whom Duvall shared an apartment. Both were close to another struggling young actor named Gene Hackman. Meisner cast Duvall in the play \"The Midnight Caller\" by Horton Foote, a link that would prove critical to his career, as it was Foote who recommended Duvall to play the mentally disabled \"Boo Radley\" in To Kill a Mockingbird (1962). This was his first \"major\" role since his 1956 motion picture debut as an MP was in Somebody Up There Likes Me (1956), starring Paul Newman. Duvall began making a name for himself as a stage actor in New York, winning an Obie Award in 1965 playing incest-minded longshoreman \"Eddie Carbone\" in the off-Broadway revival of Arthur Miller's \"A View from the Bridge\", a production for which his old roommate Hoffman was assistant director. He found steady work in episodic TV and appeared as a modestly billed character actor in films, such as Arthur Penn's The Chase (1966) with Marlon Brando and in Robert Altman's Countdown (1967) and Francis Ford Coppola's The Rain People (1969), in both of which he co-starred with James Caan. He was also memorable as the heavy who is shot by John Wayne at the climax of True Grit (1969) and was the first \"Maj. Frank Burns\", creating the character in Altman's Korean War comedy MASH (1970). He also appeared as the eponymous lead in George Lucas' directorial debut, THX 1138 (1971). It was Francis Ford Coppola, casting The Godfather (1972), who reunited Duvall with Brando and Caan and provided him with his career breakthrough as mob lawyer \"Tom Hagen\". He received the first of his six Academy Award nominations for the role. Thereafter, Duvall had steady work in featured roles in such films as The Godfather: Part II (1974), The Killer Elite (1975), Network (1976), The Seven-Per-Cent Solution (1976) and The Eagle Has Landed (1976). Occasionally this actor's actor got the chance to assay a lead role, most notably in Tomorrow (1972), in which he was brilliant as William Faulkner's inarticulate backwoods farmer. He was less impressive as the lead in Badge 373 (1973), in which he played a character based on real-life NYPD detective Eddie Egan, the same man his old friend Gene Hackman had won an Oscar for playing, in fictionalized form as \"Popeye Doyle\" in The French Connection (1971). It was his appearance as \"Lt. Col. Kilgore\" in another Coppola picture, Apocalypse Now (1979), that solidified Duvall's reputation as a great actor. He got his second Academy Award nomination for the role, and was named by the Guinness Book of World Records as the most versatile actor in the world. Duvall created one of the most memorable characters ever assayed on film, and gave the world the memorable phrase, \"I love the smell of napalm in the morning!\". Subsequently, Duvall proved one of the few established character actors to move from supporting to leading roles, with his Oscar-nominated turns in The Great Santini (1979) and Tender Mercies (1983), the latter of which won him the Academy Award for Best Actor. Now at the summit of his career, Duvall seemed to be afflicted with the fabled \"Oscar curse\" that had overwhelmed the careers of fellow Academy Award winners Luise Rainer, Rod Steiger and Cliff Robertson. He could not find work equal to his talents, either due to his post-Oscar salary demands or a lack of perception in the industry that he truly was leading man material. He did not appear in The Godfather: Part III (1990), as the studio would not give in to his demands for a salary commensurate with that of Al Pacino, who was receiving $5 million to reprise Michael Corleone. His greatest achievement in his immediate post-Oscar period was his triumphant characterization of grizzled Texas Ranger Gus McCrae in the TV mini-series Lonesome Dove (1989), for which he received an Emmy nomination. He received a second Emmy nomination and a Golden Globe for his portrayal of Soviet dictator Joseph Stalin in Stalin (1992), and a third Emmy nomination playing Nazi war criminal Adolf Eichmann in The Man Who Captured Eichmann (1996). The shakeout of his career doldrums was that Duvall eventually settled back into his status as one of the premier character actors in the industry, rivaled only by his old friend Gene Hackman. Duvall, unlike Hackman, also has directed pictures, including the documentary We're Not the Jet Set (1977), Angelo My Love (1983) and Assassination Tango (2002). As a writer-director, Duvall gave himself one of his most memorable roles, that of the preacher on the run from the law in The Apostle (1997), a brilliant performance for which he received his third Best Actor nomination and fifth Oscar nomination overall. The film brought Duvall back to the front ranks of great actors, and was followed by a Best Supporting Actor Oscar nod for A Civil Action (1998). Robert Duvall will long be remembered as one of the great naturalistic American screen actors in the mode of Spencer Tracy and his frequent co-star Marlon Brando. His performances as \"Boo Radley\" in To Kill a Mockingbird (1962), \"Jackson Fentry\" in Tomorrow (1972), \"Tom Hagen\" in the first two \"Godfather\" movies, \"Frank Hackett\" in Network (1976), \"Lt. Col. Kilgore\" in Apocalypse Now (1979), \"Bull Meechum\" in The Great Santini (1979), \"Mac Sledge\" in Tender Mercies (1983), \"Gus McCrae\" in Lonesome Dove (1989) and \"Sonny Dewey\" in The Apostle (1997) rank as some of the finest acting ever put on film. It's a body of work that few actors can equal, let alone surpass.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjk1MjA2Mjc2MF5BMl5BanBnXkFtZTcwOTE4MTUwMg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000380","name":"Robert Duvall","nicknames":["Bob"],"idIMDB":"nm0000380"},"actorId":"nm0000380","character":"Prendergast","urlCharacter":"http://www.imdb.com/character/ch0010618","main":true},{"actorName":"Barbara Hershey","urlProfile":"http://www.imdb.com/name/nm0001347","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNzQ1NjU1N15BMl5BanBnXkFtZTcwNjYzMTkwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 February 1948","placeOfBirth":" Hollywood, Los Angeles, California, USA","birthName":"Barbara Lynn Herzstein","height":"5' 5\" (1.65 m)","bio":"Barbara Hershey was born Barbara Lynn Herzstein in Hollywood, California, to Melrose (Moore) and Arnold Nathan Herzstein, a horse racing columnist. Her father, born in Manhattan, was from a Jewish family (from Hungary and Russia), and her mother, originally from Arkansas, had English and Scots-Irish ancestry. Hershey was raised in a small bungalow, and had aspirations of being an actress from her earliest memories. The multi-award-winning actress has been in some of Hollywood's most memorable films. She has been a winner of an Emmy and a Golden Globe for A Killing in a Small Town (1990). She won two consecutive Best Actress awards at the Cannes Film Festival, (which is unprecedented) for Shy People (1987) and A World Apart (1988). She won a Gemini Award for Anne of Green Gables: A New Beginning (2008) for PBS and a Lifetime Achievement Award at the Vienna International Film Festival. Hershey was nominated for an Academy Award for The Portrait of a Lady (1996). She's worked with some of the world's great directors, among them - Martin Scorsese, William Wyler, Woody Allen, Jane Campion and Darren Aronofsky. The versatile actress was first discovered by a talent agent while she was attending Hollywood High School. She began working in television, The Monroes (1966), and film, With Six You Get Eggroll (1968), with Doris Day. And with roles in The Baby Maker (1970) and Boxcar Bertha (1972), Hershey quickly advanced to starring roles. The 1980's catapulted Hershey's film career, when she starred in The Stunt Man (1980) with 'Peter O'Toole', The Right Stuff (1983), The Natural (1984) with Robert Redford, Hannah and Her Sisters (1986) with Woody Allen, Hoosiers (1986) with Gene Hackman, Tin Men (1987), Shy People (1987), The Last Temptation of Christ (1988), A World Apart (1988) and Beaches (1988) with Bette Midler. Hershey returned to television in 1990 with her highly-lauded performance in A Killing in a Small Town (1990), Paris Trout (1991), Return to Lonesome Dove (1993), the British mini-series, Daniel Deronda (2002) and the last season of Chicago Hope (1994). During the same period, Hershey remained active in features. She was nominated for an Oscar and Golden Globe for The Portrait of a Lady (1996). She also starred in Merchant-Ivory's La fille d'un soldat ne pleure jamais (1998) and the award-winning Australian film, Lantana (2001). Recently, Hershey has recently performed in James Wan's cult-hit, Insidious (2010) and Darren Aronofsky's award-winning Black Swan (2010), playing Natalie Portman's insane mother. Hershey resides in Los Angeles.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNzQ1NjU1N15BMl5BanBnXkFtZTcwNjYzMTkwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001347","name":"Barbara Hershey","idIMDB":"nm0001347"},"actorId":"nm0001347","character":"Beth","urlCharacter":"http://www.imdb.com/character/ch0010620","main":true},{"actorName":"Rachel Ticotin","urlProfile":"http://www.imdb.com/name/nm0001797","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNDQzMDYxOF5BMl5BanBnXkFtZTcwMzkyNDgwMw@@._V1_UY44_CR3,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1 November 1958","placeOfBirth":" Bronx, New York, USA","height":"5' 7\" (1.7 m)","bio":"One tough cookie who can definitely hold her own next to the boys on film and TV, lovely, dark-haired Rachel Ticotin has stepped up to the plate many times in strong-armed femme roles, playing everything from cops and bodyguards to military corporals. Born and raised in the Bronx, she learned the fine art of discipline at a young age with ballet training at age 8. She made her first stage appearance at age 10 as a Siamese princess in a production of \"The King and I\" at NYC's City Center Theatre. At age twelve she joined the Ballet Hispanico of New York and went on to work with such famed choreographers as Alvin Ailey, Geoffrey Holder and Anna Sokolow. She made her film debut at age 20 in a bit role as a gypsy dancer in the King of the Gypsies (1978) starring Eric Roberts. She gained valuable experience in off-Broadway shows and on the other side of the camera as a production assistant for such films as The Wanderers (1979), Dressed to Kill (1980) and Raging Bull (1980). Rachel earned her big break after being handed the top female role opposite Paul Newman and Edward Asner in the brutal police film Fort Apache the Bronx (1981). Television became a viable forum with the TV pilot For Love and Honor (1983) as Corporal Grace Pavlik. The pilot introduced her to up-and-coming actor David Caruso. They married later that year. Rachel went on to appear in the short-lived series version of For Love and Honor (1983) without Caruso. Other television projects included assertive roles in Prison Stories: Women on the Inside (1991), Aftershock: Earthquake in New York (1999) and Warden of Red Rock (2001). On the big screen she played tough in Critical Condition (1987), Where the Day Takes You (1991), and Chute libre (1993). Her best known role is probably the Arnold Schwarzenegger sci-fi blockbuster Total Recall (1990) in which the athletic Rachel has a memorable fisticuffs scene with Sharon Stone. In 1997, Rachel earned an ALMA award for her role as a prison guard in Con Air (1997). Divorced from Caruso after six years in 1989, she later met actor Peter Strauss on the set of the TV movie Thicker Than Blood: The Larry McLinden Story (1994). They married in 1998. In series drama she joined the cast of Ohara (1987) as a U.S. attorney and played detective in the police drama Crime & Punishment (1993). Although she has yet to hit the very top rungs of stardom, Rachel is a proven talent. Alluring as well as enduring, her latest work in the popular films Something's Gotta Give (2003) starring Jack Nicholson and Oscar-nominated Diane Keaton, Man on Fire (2004) with Denzel Washington and the recent The Sisterhood of the Traveling Pants (2005), not to mention the critically acclaimed bi-cultural series American Family (2002), is proof of the pudding.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMwNDQzMDYxOF5BMl5BanBnXkFtZTcwMzkyNDgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001797","name":"Rachel Ticotin","idIMDB":"nm0001797"},"actorId":"nm0001797","character":"Sandra","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tuesday Weld","urlProfile":"http://www.imdb.com/name/nm0001839","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NjI4MzEyM15BMl5BanBnXkFtZTYwNDUwNjI2._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"27 August 1943","placeOfBirth":" New York City, New York, USA","birthName":"Susan Ker Weld","height":"5' 3½\" (1.61 m)","bio":"Susan Ker Weld was born on August 27, 1943, in New York City. When her father, Lathrop Motley Weld, died three years later at the age of 49, the cute little girl, whose name by then had somehow been transmogrified into \"Tuesday\", took over the role of the family breadwinner, which included her mother Yosene Balfour Ker. She became a successful child model, posing for advertisements and mail-order catalogs. Her work and the burden of responsibility estranged her from her mother Yosene, her two elder siblings, and forced the preteen girl into adulthood. At nine years of age, she suffered a nervous breakdown; at ten, she started heavy drinking; one year later, she began having relationships with older men, all of which led to a suicide attempt at age twelve. In 1956 she debuted in the low-budget exploitation movie Rock Rock Rock! (1956) and decided to become an actress. After numerous TV appearances in New York she went to Hollywood in 1958 and was cast for Rally 'Round the Flag, Boys! (1958), something of a breakthrough for her. Over the next few years Tuesday became Hollywood's queen of teen, playing mainly precocious sex kittens. Her wild private life added to the entertainment of her fans. Critics acknowledged her talent, directors approved of her professionalism, and in the late 1960s she even managed to grow out of her child/woman image and find more demanding roles - she had been \"sweet little 16\" for about 16 years. However, Tuesday Weld didn't achieve first-magnitude stardom. Maybe she was just unlucky with her selection of jobs (she turned down Lolita (1962), Bonnie and Clyde (1967), True Grit (1969), Bob & Carol & Ted & Alice (1969), among others); maybe her independence-loving mind made her instinctively shrink back from the restraints of super stardom. In any case, she kept on performing well in films that had either not much flair or not much success. From the mid-'70s on she focused more and more on made-for-TV movies, which was ironic in that the best (Il était une fois en Amérique (1984)) and the most successful (Chute libre (1993)) films that came her way happened after her big-screen career had pretty much petered out.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI4NjI4MzEyM15BMl5BanBnXkFtZTYwNDUwNjI2._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001839","name":"Tuesday Weld","idIMDB":"nm0001839"},"actorId":"nm0001839","character":"Mrs. Prendergast","urlCharacter":"http://www.imdb.com/character/ch0040452","main":true},{"actorName":"Frederic Forrest","urlProfile":"http://www.imdb.com/name/nm0002078","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNDIyMDQwN15BMl5BanBnXkFtZTYwMzM5NzE1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 December 1936","placeOfBirth":" Waxahachie, Texas, USA","birthName":"Frederic Fenimore Forrest Jr.","height":"5' 10\" (1.78 m)","bio":"Frederic Forrest, the Oscar-nominated character actor, was born two days before Christmas Day 1936 in Waxahachie, Texas, the same home town as director Robert Benton. Forrest had long wanted to be an actor, but he was so nervous that he ran out of auditions for school plays. Later, at Texas Christian University, he took a minor in theater arts while majoring in radio and television studies. His parents opposed his aspirations as a thespian as it was a precarious existence, but he moved on to New York and studied with renowned acting teacher Sanford Meisner. He eventually became an observer at the Actors Studio, where he was tutored by Lee Strasberg. During this time, he supported himself as a page at the NBC Studios in Rockefeller Plaza. His theatrical debut was in the Off-Broadway production of \"Viet-Rock\", an anti-war play featuring music. He became part of avant-garde director Tom O'Horgan's stock company at La Mama, appearing in the infamous \"Futz\", among other productions. He made his uncredited debut in The Filthy Five (1968), a low-budget movie directed by sexploitation auteur Andy Milligan, but he racked up his first credit in O'Horgan's very bizarre screen adaptation of Futz (1969), a satire about a farmer who falls in love with a hog. After starring in the off-Broadway play \"Silhouettes\", Forrest moved with the production to Los Angeles, intent on breaking into movies. While the production ran for three months and was visited by agents bird-dogging new talent, Forrest got no offers and had to support himself as a pizza-baker after the show closed. Eventually, he began auditing classes at Actors Studio West, and director Stuart Millar saw him in a student showcase production of Clifford Odets' \"Watiting for Lefty\" and cast him in When the Legends Die (1972). He copped a 1973 Golden Globe nomination as \"Most Promising Newcomer - Male\" for the role, losing out to Edward Albert in Butterflies Are Free (1972). For the first time in his film acting career, Frederic Forrest looked like he was poised for stardom. His follow-up picture, the pitiful The Godfather (1972) rip-off The Don Is Dead (1973), did nothing for his career, although a small part in \"Godfather\" director Francis Ford Coppola's The Conversation (1974) would later pay dividends. Except for a small role in the disappointing The Missouri Breaks (1976) and his TV turn as Lee Harvey Oswald in CBS' Ruby and Oswald (1978), Forrest had little to show in the first part of his career. Coppola was about to change that. Playing \"Chef Hicks\" in Apocalypse Now (1979) garnered Forrest the best notices of his career, and he parlayed that into Academy Award and Golden Globe nominations as Best Supporting Actor for The Rose (1979), his second hit that year. He was named Best Supporting Actor by the National Society of Film Critics for both films, and once again he seemed poised on the verge of stardom. Like the first time, stardom did not come. His aspirations were to do quality work and play a romantic lead. \"I would like to not have to fit into somebody else's story and have my scenes cut because I'm too strong\", he told a journalist circa 1980. \"And next time, I'd like to get the girl instead of the horse\". He did get the romantic lead he pined for, but it was a case of \"Be careful what you wish for, as you might just get it\". Coppola, so instrumental in propelling Forrest into the first rank of character actors, cast him as the romantic lead in One from the Heart (1981), a picture that proved to be one of the great financial debacles of all time. It bankrupted Coppola's studio, American Zoetrope, and engendered a fierce backlash against the director and the film in Hollywood. Forrest and co-star Teri Garr were both egregiously miscast in Coppola's re-imagining of the musical due to the simple fact that neither could sing or dance and had no place in any kind of musical, traditional or re-imagined. Coppola reportedly never came out of \"Silverfish\", the Winnebago-like trailer he had transformed into a control center from which he directed the film via television monitors, a first in the industry. For his masterpieces The Godfather (1972), The Godfather: Part II (1974) and Apocalypse Now (1979), he had left the visuals in the very able hands of his cinematographers, Gordon Willis and Vittorio Storaro. Coppola was a first-rate screenwriter with a sure hand, eliciting performances from actors as notoriously difficult as Marlon Brando and Al Pacino, but by locking himself away from the set in a trailer to oversee the visual scope of his picture, there was little he seemingly could do to prevent the floundering of his two leads. More concerned with technology than his actors, he lost his touch. One from the Heart (1981) turned out to be a disaster and, except for one more lead in a Coppola-produced film, Wim Wenders' underwhelming Hammett (1982), Forrest's career as a leading man was through. In 1983, he played a supporting role in Valley Girl (1983) in an unmemorable performance, a role that could have been played by any actor, something one couldn't say about his \"Chef\" in Apocalypse Now (1979). Chef had been as essential to the success of the film as had Martin Sheen's Willard and Brando's Col. Kurtz. Increasingly, Forrest began appearing on television and, by 1987, was in the cast of the series 21 Jump Street (1987) on the new Fox TV network, lasting only one season before being ignominiously replaced by Steven Williams. In addition to an appearance in the mini-series Lonesome Dove (1989), Mr. Forrest's fine portrayal of \"Lomax\" in Die Kinder (1990), showed the ability which has been too often unrealized.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAzNDIyMDQwN15BMl5BanBnXkFtZTYwMzM5NzE1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0002078","name":"Frederic Forrest","nicknames":["Daddy Freddy"],"idIMDB":"nm0002078"},"actorId":"nm0002078","character":"Surplus Store Owner","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Lois Smith","urlProfile":"http://www.imdb.com/name/nm0809135","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2OTIyMzExOF5BMl5BanBnXkFtZTcwMDI4NDIwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"3 November 1930","placeOfBirth":" Topeka, Kansas, USA","birthName":"Lois Arlene Humbert","height":"5' 2\" (1.57 m)","bio":"Lois Smith was born on November 3, 1930 in Topeka, Kansas, USA as Lois Arlene Humbert. She is an actress, known for Twister (1996), The Nice Guys (2016) and Chute libre (1993). She was previously married to Wesley Dale Smith.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc2OTIyMzExOF5BMl5BanBnXkFtZTcwMDI4NDIwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0809135","name":"Lois Smith","idIMDB":"nm0809135"},"actorId":"nm0809135","character":"D-Fens' Mother","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joey Hope Singer","urlProfile":"http://www.imdb.com/name/nm0801966","urlPhoto":"","biography":{"birthName":"Joey Singer","bio":"Joey Singer began her career working for music publisher Stage Three Music, representing the catalogs of Aerosmith, ZZ Top and Gerry Rafferty, among others. She transitioned into music clearance in 2011, working for music supervisor and mentor Robin Kaye on three music heavy reality series including \"Q'Viva: The Chosen\", \"The Singing Bee\" and \"Oh Sit!\". To follow, she worked with Jill Meyers on both \"The Voice\" and \"The Sing-Off.\" She now works independently, clearing music on a per project basis.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0801966","name":"Joey Hope Singer","idIMDB":"nm0801966"},"actorId":"nm0801966","character":"Adele","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Ebbe Roe Smith","urlProfile":"http://www.imdb.com/name/nm0808076","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNDg3NjcyMV5BMl5BanBnXkFtZTcwMjE2MTkyNw@@._V1_UY44_CR17,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 June 1949","placeOfBirth":" San Diego, California, USA","bio":"Ebbe Roe Smith was born on June 25, 1949 in San Diego, California, USA. He is an actor and writer, known for Chute libre (1993), Turner & Hooch (1989) and The Big Easy (1986).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjAwNDg3NjcyMV5BMl5BanBnXkFtZTcwMjE2MTkyNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0808076","name":"Ebbe Roe Smith","idIMDB":"nm0808076"},"actorId":"nm0808076","character":"Guy on Freeway","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Paul Chan","urlProfile":"http://www.imdb.com/name/nm0151033","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDA3NTIxMzIyNF5BMl5BanBnXkFtZTcwMjM4NzcyNg@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 June 1950","placeOfBirth":" San Francisco, California, USA","bio":"Michael Paul Chan was born on June 26, 1950 in San Francisco, California, USA. He is an actor and producer, known for The Closer (2005), Major Crimes (2012) and Chute libre (1993). He has been married to Christina Ann Chan since January 11, 1975. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDA3NTIxMzIyNF5BMl5BanBnXkFtZTcwMjM4NzcyNg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0151033","name":"Michael Paul Chan","idIMDB":"nm0151033"},"actorId":"nm0151033","character":"Mr. Lee","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Raymond J. Barry","urlProfile":"http://www.imdb.com/name/nm0000855","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxNTc2MzAzNzdeQTJeQWpwZ15BbWU3MDkxNDQ4MDk@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 March 1939","placeOfBirth":" Hempstead, Long Island, New York, USA","height":"6' 0½\" (1.84 m)","bio":"Raymond J. Barry was born in New York, and attended Brown University, where he was a star athlete in football, basketball, and track. While there, he earned his degree in Philosophy and as a senior, was cast in the stage production of \"Picnic,\" where he played a football player. He then entered the Yale Drama School and after completing, acted in the Broadway play \"The Leaf People.\" He has appeared in over 100 plays and has starred in such films as Dead Man Walking (1995), Sudden Death (1995), and The Chamber (1996).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTAxNTc2MzAzNzdeQTJeQWpwZ15BbWU3MDkxNDQ4MDk@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000855","name":"Raymond J. Barry","idIMDB":"nm0000855"},"actorId":"nm0000855","character":"Captain Yardley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"D.W. Moffett","urlProfile":"http://www.imdb.com/name/nm0595631","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2OTg4NDEzMF5BMl5BanBnXkFtZTcwMDQwMjk4Nw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 October 1954","placeOfBirth":" Highland Park, Illinois, USA","birthName":"Donald Warren Moffett","bio":"A native of the Chicago suburb of Wilmette, D.W. Moffett never gave a thought to acting until after he graduated from Stanford University with a degree in International Relations. While he went to work at Chicago's Continental Bank, he also enrolled in an acting class to broaden his artistic horizon and, more importantly, to meet girls. He found a social life - and his life's work. Moving along his new career path, Moffett became a founding member of Chicago's Remains Theatre Ensemble, where he starred in, directed and/or produced over 40 productions. He first came to national attention starring in Larry Kramer's landmark AIDS drama \"The Normal Heart\" at New York's Public Theatre. Subsequently, he appeared on Broadway in \"The Boys of Winter\" and \"The Real Thing,\" as well as a Los Angeles production of Jon Robin Baitz's \"The End of the Day.\" In his most recent return to the stage, D. W. was invited to play opposite Kevin Spacey in the critically acclaimed production of \"The Philadelphia Story\" at the Old Vic in London in 2005. Since making the move to Hollywood, Moffett has divided his time between film and television. Favorite movie roles include appearances in \"Stealing Beauty\", directed by Bernardo Bertolucci, \"Thirteen\", directed by Catherine Hardwicke, \"Twisted\", directed by Phillip Kaufman, and Steven Soderbergh's \"Traffic\", for which he won a Screen Actor's Guild Award. Moffett's television credits include the ground-breaking TV movie, \"An Early Frost\" as well as series regular roles in \"The Oldest Rookie\", \"Hidden Palms\", 'Skin\", \"For Your Love\", \"Chicago Sons\" and \"Life is Wild\" . Recently, Moffett appeared as the memorable and reviled Joe McCoy on the iconic series \"Friday Night Lights\" as well as Fran Drescher's ne'er-do-well boyfriend on \"Happily Divorced\". D.W. recently concluded production on the Peabody Award-winning ABC Family show, \"Switched at Birth\", in which he appeared as series-regular John Kennish for all 5 Seasons. D.W. also recently returned to the director's chair, helming an episode of the above-referenced Fran Drescher show as well as 3 episodes of Switched at Birth. Additionally, D.W. has begun directing children's programming, having directed the penultimate episode of the popular Disney Channel show \"Austin and Ally\". In the Fall of 2016, D.W. joined the faculty of The Savannah College of Art and Design (SCAD) in both Performing Arts as well as Film and Television. In December of 2016, D.W. was named Chair of the Film and Television Department at SCAD. D.W. is extremely excited at the challenge of leading the department and tapping his 35 years of experience to benefit his students.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2OTg4NDEzMF5BMl5BanBnXkFtZTcwMDQwMjk4Nw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0595631","name":"D.W. Moffett","idIMDB":"nm0595631"},"actorId":"nm0595631","character":"Detective Lydecker","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Steve Park","urlProfile":"http://www.imdb.com/name/nm0661950","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWI5ZWVjYzItMWNlNC00ZTIzLWJmOGItNmQ1NTFiY2QzZDBhXkEyXkFqcGdeQXVyMDcyMjk0MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Steve Park is an actor, known for Fargo (1996), Snowpiercer - le transperceneige (2013) and Chute libre (1993). He is married to Kelly Coffield Park.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMWI5ZWVjYzItMWNlNC00ZTIzLWJmOGItNmQ1NTFiY2QzZDBhXkEyXkFqcGdeQXVyMDcyMjk0MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0661950","name":"Steve Park","idIMDB":"nm0661950"},"actorId":"nm0661950","character":"Detective Brian","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Kimberly Scott","urlProfile":"http://www.imdb.com/name/nm0779451","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1OTE2ODY2N15BMl5BanBnXkFtZTcwMDc5OTUzMQ@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 December 1961","placeOfBirth":" Kingsville, Texas, USA","birthName":"Kimberly Aileen Scott","bio":"Kimberly Scott was born on December 11, 1961 in Kingsville, Texas, USA as Kimberly Aileen Scott. She is an actress, known for The Abyss (1989), Batman Forever (1995) and Flatliners (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM1OTE2ODY2N15BMl5BanBnXkFtZTcwMDc5OTUzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0779451","name":"Kimberly Scott","idIMDB":"nm0779451"},"actorId":"nm0779451","character":"Detective Jones","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Keane","urlProfile":"http://www.imdb.com/name/nm0443856","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MTcwNzYyN15BMl5BanBnXkFtZTcwOTY3NzEzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 September 1952","placeOfBirth":" Buffalo, New York, USA","bio":"James Keane was born on September 26, 1952 in Buffalo, New York, USA. He is an actor, known for Apocalypse Now (1979), Crazy Heart (2009) and Seabiscuit (2003).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTM0MTcwNzYyN15BMl5BanBnXkFtZTcwOTY3NzEzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0443856","name":"James Keane","idIMDB":"nm0443856"},"actorId":"nm0443856","character":"Detective Keene","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0106856","urlIMDB":"http://www.imdb.com/title/tt0106856","business":{"budget":{"money":"$25,000,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$8,724,452","country":"USA","day":"26","month":"02","year":"1993","remarks":""}],"gross":[{"money":"SEK","country":"13,276,626","day":null,"month":null,"year":null,"remarks":null},{"money":null,"country":null,"day":null,"month":null,"year":"","remarks":"<a href=\"/year/1992/\">1992</a>"}],"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":null},"technical":{"runtime":["1 hr 53 min (113 min)"],"soundMix":["Dolby Stereo"],"color":["Color (Technicolor)"],"aspectRatio":["2.35 : 1"],"camera":["Lenses and Panaflex Camera by Panavision"],"laboratory":["Technicolor, Hollywood (CA), USA"],"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Panavision (anamorphic)"],"printedFilmFormat":["35 mm"]},"rating":"7.6","metascore":"56","filmingLocations":[{"location":"MacArthur Park, Los Angeles, California, USA"}],"rated":"R","awards":[{"award":"Camerimage 1993","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Frog","categories":[{"category":"","names":[{"name":"Andrzej Bartkowiak","id":"nm0005647","role":null}]}]}]},{"award":"Cannes Film Festival 1993","titlesAwards":[{"titleAwardOutcome":"Nominated Palme d'Or","categories":[{"category":"","names":[{"name":"Joel Schumacher","id":"nm0001708","role":null}]}]}]},{"award":"Edgar Allan Poe Awards 1994","titlesAwards":[{"titleAwardOutcome":"Won Edgar","categories":[{"category":"Best Motion Picture","names":[{"name":"Ebbe Roe Smith","id":"nm0808076","role":null}]}]}]}],"votes":"140,401","type":"Movie","companyCreditsSimple":[{"idCompany":"co0021159","name":"Alcor Films"},{"idCompany":"co0028557","name":"Canal+"},{"idCompany":"co0021592","name":"Regency Enterprises"}],"keywords":{"keywords":["black comedy","rage","borderline personality disorder","moral ambiguity","dysfunctional family","destroying property","alienation","urban decay","one man crusade","anti hero","social commentary","los angeles california","birthday","gang","convenience store","traffic jam","baseball bat","retirement","detective","gun","gym bag","vomiting","payphone","paramedic","defense plant","highway patrol","cell phone","road movie","cartoon on tv","man with glasses","last day on job","two word title","cult film","snowglobe","trespassing","suit and tie","stabbed in the shoulder","punched in the face","pier","panhandling","mannequin","language barrier","hit with a baseball bat","estranged parent","cartoon on television","briefcase","angry customer","adult lives at home","1990s","going postal","urban setting","madman","one day","anti villain","vandalism","misogyny","homophobia","suicide by cop","stabbing","shot to death","murder","laid off","inequality","car crash","beating","abandoned car","hole in shoe","shot from a car","korean grocer","video","desperation","against the system","disgruntled worker","price gouging","vigilante","korean american","water gun","telephone","road rage","revolver","pay phone","medicine","knife","home movie","hispanic","heart attack","hamburger","graffiti","freeway","cake","balisong","birthday present","anger","rocket launcher","uzi","machine gun","london bridge","racism","gay slur","militant","corporate downsizing","police","estranged couple","racial slur","police officer","unemployment","burger","fast food restaurant","neo nazi","shooting","drive by shooting","ethnic slur","policewoman","divorce","urban nightmare","golf","ex husband ex wife relationship","downsizing","robbery","chase","bazooka","violence","layoff","loss of job","tragedy","police car","title spoken by character","psychopath"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/14 08:13:42"}}