{"data":{"movies":[{"title":"American History X","originalTitle":"","year":"1998","releaseDate":"19981120","directors":[{"name":"Tony Kaye","id":"nm0443411"}],"writers":[{"name":"David McKenna","id":"nm0571346"}],"runtime":"119 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BY2E2MWU5ZDktOTQ0OS00NGIzLTg4YTgtYjFhNTRlMjA1NzFjL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Crime","Drama"],"plot":"Derek Vineyard is paroled after serving 3 years in prison for brutally killing two black men who tried to break into/steal his truck. Through his brother, Danny Vineyard's narration, we learn that before going to prison, Derek was a skinhead and the leader of a violent white supremacist gang that committed acts of racial crime throughout L.A. and his actions greatly influenced Danny. Reformed and fresh out of prison, Derek severs contact with the gang and becomes determined to keep Danny from going down the same violent path as he did.","simplePlot":"A former neo-nazi skinhead tries to prevent his younger brother from going down the same wrong path that he did.","actors":[{"actorName":"Edward Norton","urlProfile":"http://www.imdb.com/name/nm0001570","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjQ5MTI1NF5BMl5BanBnXkFtZTcwMzU5MTI2Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"18 August 1969","placeOfBirth":" Boston, Massachusetts, USA","birthName":"Edward Harrison Norton","height":"6' (1.83 m)","bio":"American actor, filmmaker and activist Edward Harrison Norton was born on August 18, 1969, in Boston, Massachusetts, and was raised in Columbia, Maryland. His mother, Lydia Robinson \"Robin\" (Rouse), was a foundation executive and teacher of English, and a daughter of famed real estate developer James Rouse, who developed Columbia, MD; she passed away of brain cancer on March 6, 1997. His father, Edward Mower Norton, Jr., was an environmental lawyer and conservationist, who works for the National Trust for Historic Preservation. Edward has two younger siblings, James and Molly. From the age of five onward, the Yale graduate (majoring in history) was interested in acting. At the age of eight, he would ask his drama teacher what his motivation in a scene was. He attended theater schools throughout his life, and eventually managed to find work on stage in New York as a member of the Signature players, who produced the works of playwright and director Edward Albee. Around the time when he was appearing in Albee's Fragments, in Hollywood, they were looking for a young actor to star opposite Richard Gere in a new courtroom thriller, Primal Fear (1996). The role was offered to Leonardo DiCaprio but he turned it down. Gere was on the verge of walking away from the project, fed up with the wait for a young star to be found, when Edward auditioned and won the role over 2000 other hopefuls. Before the film was even released, his test screenings for the part were causing a Hollywood sensation, and he was soon offered roles in Woody Allen's Everyone Says I Love You (1996) and The People vs. Larry Flynt (1996). Edward won the Golden Globe for Best Actor in a Supporting Role and received an Oscar nomination for Best Supporting Actor for his performance in Primal Fear (1996). In 1998, Norton gained 30 pounds of muscle and transformed his look into that of a monstrous skinhead for his role as a violent white supremacist in American History X (1998). This performance earned him his second Oscar nomination, this time for Best Actor. He received his third Oscar nomination, for Best Supporting Actor, for his work in Birdman or (The Unexpected Virtue of Ignorance) (2014). His most prominent roles also include the critically acclaimed Everyone Says I Love You (1996), The People vs. Larry Flynt (1996), Fight Club (1999), Dragon rouge (2002), 25th Hour (2002), Kingdom of Heaven (2005), The Illusionist (2006), Moonrise Kingdom (2012), and The Grand Budapest Hotel (2014). He has also directed and co-written films, including his directorial debut, Keeping the Faith (2000). He has done uncredited work on the scripts for The Score (2001), Frida (2002), and The Incredible Hulk (2008). Alongside his work in cinema, Norton is an environmental and social activist, and is a member of the board of trustees of Enterprise Community Partners, a non-profit organization for developing affordable housing founded by his grandfather James Rouse.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYwNjQ5MTI1NF5BMl5BanBnXkFtZTcwMzU5MTI2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001570","name":"Edward Norton","nicknames":["Ed"],"idIMDB":"nm0001570"},"actorId":"nm0001570","character":"Derek Vinyard","urlCharacter":"http://www.imdb.com/character/ch0002727","main":true},{"actorName":"Edward Furlong","urlProfile":"http://www.imdb.com/name/nm0000411","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MzgxODkyMl5BMl5BanBnXkFtZTcwNTc1NDIzMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 August 1977","placeOfBirth":" Glendale, California, USA","birthName":"Edward Walter Furlong","height":"5' 5¾\" (1.67 m)","bio":"Edward Walter Furlong was born in Glendale, California. His mother, Eleanor (Tafoya), is from a Mexican family, and worked at a youth center. Furlong had no acting ambitions until he was approached by casting agent Mali Finn, who was looking for a young actor to play the role of John Connor in what turned out to be one of the the biggest box-office hits of the 1990s, Terminator 2: Judgment Day (1991). Finn instantly recognized his ability, and suggested him for the part, feeling that he could hold his own playing opposite Arnold Schwarzenegger and Linda Hamilton. For his career-starting role, Furlong earned an MTV movie award for best breakthrough role, and a Saturn Sci-Fi award for best young actor. From there, he took an unconventional route through Hollywood, which led to his working with some of the top people in the business, in both studio and independent films. His work has included starring opposite Jeff Bridges in American Heart (1992) for which he was nominated for an IFP Spirit award for best supporting actor. He has also starred in A Home of Our Own (1993) with Kathy Bates, Little Odessa (1994) with Tim Roth, The Grass Harp (1995) with Walter Matthau and Barbet Schroeder's Before and After (1996). He also starred opposite Edward Norton in Tony Kaye's controversial and gripping drama American History X (1998) and in the hit comedy Pecker (1998). More recently, Furlong has been opposite Willem Dafoe in the prison drama Animal Factory (2000), directed by Steve Buscemi. He recently starred in Pupi Avati's 11th-century tale, I cavalieri che fecero l'impresa (2001) (\"The Knights of the Quest\").","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI1MzgxODkyMl5BMl5BanBnXkFtZTcwNTc1NDIzMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000411","name":"Edward Furlong","nicknames":["Eddie"],"idIMDB":"nm0000411"},"actorId":"nm0000411","character":"Danny Vinyard","urlCharacter":"http://www.imdb.com/character/ch0002728","main":true},{"actorName":"Beverly D'Angelo","urlProfile":"http://www.imdb.com/name/nm0000350","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNTk4ODU5NV5BMl5BanBnXkFtZTcwODU0OTgwMw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 November 1951","placeOfBirth":" Columbus, Ohio, USA","birthName":"Beverly Heather D'Angelo","height":"5' 2\" (1.57 m)","bio":"Intriguing, inspiring, and never less than interesting -- key adjectives in describing the career of Beverly D'Angelo, which has well passed the three-decade mark. Perhaps deserving better movies than she generally found herself in, she nevertheless was always an object of fascination and the one to watch...whatever the role. Hardly the shrinking violet type, Hollywood counted on her for her colorful personality, down-to-earth demeanor and scene-stealing capabilities. Beverly Heather D'Angelo was born on November 15, 1951 in Columbus, Ohio, the daughter of musicians Priscilla Ruth (Smith), a violinist, and Eugene \"Gene\" Constantino D'Angelo, a bass player who also managed a TV station. her maternal grandfather, Howard Dwight Smith, was the architect who designed the Ohio (\"Horseshoe\") Stadium at Ohio State University. Her mother had English, Irish, Scottish, and German ancestry, and her father was of Italian descent. Beverly once attended an American school in Florence, Italy. Initially drawn to art, Beverly worked as a animator/cartoonist at Hanna-Barbera Productions before moving to Canada to pursue a rock singing career, To make ends meet she worked as a session vocalist and sang anyplace she could -- from coffeehouses to topless bars. At one point the teenager was invited to join up with rockabilly legend Ronnie Hawkins. Beverly's acting career started up when she left the Hawkins band and joined the Charlottetown Festival repertory company. She was touring Canada as Ophelia in \"Kronborg: 1582\", a rock musical version of Shakespeare's \"Hamlet\" when the renowned Colleen Dewhurst caught a performance and saw promise in both Beverly and the show. Eventually musical director Gower Champion got into the mix and the show was completely revamped, becoming the rock musical \"Rockabye Hamlet\", which made its way to Broadway in 1976. While the show itself was short-lived, Beverly's Ophelia attracted fine notices and she soon found herself on the West coast with film and TV opportunities. After this point, she seldom returned to the stage but did star alongside Ed Harris in the 1995 off-Broadway production of Sam Shepard's \"Simpatico\", which earned her a Theatre World Award. A role in the TV miniseries Captains and the Kings (1976) led to bit parts in The Sentinel (1977) and in the Woody Allen classic Annie Hall (1977). A string of co-starring roles followed with First Love (1977), the Clint Eastwood starrer Every Which Way But Loose (1978) and the film adaptation of the hit counterculture musical Hair (1979). Best of all for Beverly was her powerhouse featured performance as the one-and-only Patsy Cline in the acclaimed biopic Coal Miner's Daughter (1980). Both she and Oscar winner Sissy Spacek (as fellow country singer Loretta Lynn) expertly supplied their own vocals. Playing everything from tough-as-nails prostitutes, party girls and barflies to rich, prim widows and depressed, alcoholic moms, most of Beverly's output was solid during this time. Playing happening kind of gals, she customarily rose above much of the standard comedic or dramatic material given. An interesting gallery of offbeat characters came her way in a number of hit-or-miss features: Paternity (1981), Finders Keepers (1984), Big Trouble (1986), Maid to Order (1987), High Spirits (1988), Cold Front (1989), Daddy's Dyin'... Who's Got the Will? (1990), The Pope Must Diet (1991), Man Trouble (1992), Lightning Jack (1994), The Crazysitter (1994), Merchants of Venus (1998) and Sugar Town (1999). She also sang in a few of these films. Beverly attracted mainstream notice as Chevy Chase's beleaguered wife in the comedy spoof National Lampoon's Vacation (1983) and its three sequels. Stronger roles came with such films as the English/Irish production The Miracle (1991) and the Neo-Nazi film American History X (1998). She was also a favorite of director John Schlesinger who used her in Honky Tonk Freeway (1981) and Eye for an Eye (1996), among others. In the spoof Pterodactyl Woman from Beverly Hills (1997), in which she served as associate producer, Beverly gamely starred as a chic Beverly Hills housewife who turns into a flying prehistoric reptile by night. On TV, Beverly scored well as matricide victim Kitty Menendez in Menendez: A Killing in Beverly Hills (1994) and earned an Emmy-nomination (and arguably gave the best performance) as Stella Kowalski opposite \"Hair\" co-star Treat Williams in the TV remake of A Streetcar Named Desire (1984). Other topnotch TV mini-movies included Sweet Temptation (1996) and Judgment Day: The John List Story (1993), in which she played Robert Blake's devout wife. On primetime she has been cast quite assertively in recurring parts -- lately she has been spotted on Law & Order: Special Victims Unit (1999) as a defense attorney, and on Entourage (2004) as a talent agent. Beverly's off-camera romantic life has been just as interesting. Following her relationship with \"Hair\" director Milos Forman, she married Lorenzo Salviati, an economics student who also was an Italian duke. She left Hollywood and lived with him in Europe, but separated after two years and returned. A six-year relationship with Irish director Neil Jordan was followed by one with Oscar-winning production designer Anton Furst; this ended tragically when, just weeks after their breakup, he committed suicide. A former union with the volatile Al Pacino produced twins Olivia and Anton, who were born in 2001. These days, Beverly's career on camera has remained secondary to the raising of her children. Occasionally she has made use of her vocal talents performing at L.A. nightclubs and with a jazz band that included brother Jeff. From time to time she still lights up the screen as a brash professional or somebody's colorful mom; whatever time she has on screen, whether major or minor, it is always welcomed and never, ever less than...interesting.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNTk4ODU5NV5BMl5BanBnXkFtZTcwODU0OTgwMw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000350","name":"Beverly D'Angelo","idIMDB":"nm0000350"},"actorId":"nm0000350","character":"Doris Vinyard","urlCharacter":"http://www.imdb.com/character/ch0002731","main":true},{"actorName":"Jennifer Lien","urlProfile":"http://www.imdb.com/name/nm0000497","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2MzA3OTEyNjJeQTJeQWpwZ15BbWU3MDY3NzA4OTc@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"24 August 1974","placeOfBirth":" Chicago, Illinois, USA","birthName":"Jennifer Ann Lien","height":"5' 3\" (1.6 m)","bio":"Jennifer Anne Lien was born on August 24, 1974 in Chicago, Illinois, USA. She has an older sister and an older brother. Jennifer knew that she wanted to act from a young age. Encouraged by her English and drama teachers, she began performing in a summer theater and festivals at the age of 13. She had roles in Shakespeare's \"The Tempest\" and \"Othello\" before moving on to more contemporary dramatic and musical theater. Jennifer's first appeared in front of the camera playing twins in an industrial film for bubblegum. She made her television debut when she guest starred in an episode of the Oprah Winfrey drama series Brewster Place (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA2MzA3OTEyNjJeQTJeQWpwZ15BbWU3MDY3NzA4OTc@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000497","name":"Jennifer Lien","idIMDB":"nm0000497"},"actorId":"nm0000497","character":"Davina Vinyard","urlCharacter":"http://www.imdb.com/character/ch0002735","main":true},{"actorName":"Ethan Suplee","urlProfile":"http://www.imdb.com/name/nm0839486","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjkyMzU1MF5BMl5BanBnXkFtZTcwNDAzNDI2OA@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 May 1976","placeOfBirth":" Manhattan, New York, USA","height":"6' 1\" (1.85 m)","bio":"Ethan Suplee has established himself over the past decade as an actor of considerable talent and accomplishment. His diverse and eclectic resume ranges from hilarious roles in such comedies as Mallrats (1995) and Without a Paddle (2004) to hauntingly dramatic performances in intense features such as American History X (1998), Blow (2001) and Cold Mountain (2003). His breakthrough performance as a young football player in Disney's Remember the Titans (2000) with Denzel Washington garnered him critical acclaim and led to another role opposite Washington in director Nick Cassavetes' thriller, John Q (2002). Born in New York and raised in Los Angeles, Suplee is the son of actors Debbie and Bill Suplee. He landed his first role at the age of 16 on the popular television series Boy Meets World (1993). He had a recurring role as the reluctant bully \"Frankie\" for three seasons. Most recently for television, he made a powerful guest-starring appearance on NBC's Third Watch (1999) as a disturbed young man who filmed a video journal about his obsession with a girl. He made his feature film debut in 1995 (alongside My Name Is Earl (2005) co-star Jason Lee) in writer/director Kevin Smith's Mallrats (1995). where he played the memorable 'Willam Black,' a young man determined to crack the mystery behind the mall's magic eye poster. Smith went on to cast Suplee in Chasing Amy (1997) and as the voice of 'Norman the Golgothan' in _Dogma (1998)_. More recent comedy credits include \"Without A Paddle\" with Seth Green and Matthew Lillard, director Todd Phillips Road Trip (2000) and Evolution (2001) for director Ivan Reitman. Suplee showcased his impressive acting chops with a powerful and compelling performance in 1998 in director Tony Kaye's \"American History X.\" He played a carelessly violent racist skinhead who tries to convince his friend (Edward Norton) to \"come back to his roots\" in their gang of white supremacists. His role of high school football lineman \"Louie\" in Disney's \"Remember the Titans\" exposed Suplee to a larger audience, and he was singled out by many critics as a fresh and welcome screen presence, with the Hollywood Reporter calling his performance \"scene-stealing.\" With Ted Demme's 1970s drug-cartel drama \"Blow,\" Suplee continued to raise his profile, playing \"Tuna\", the best friend of Johnny Depp's newly turned drug dealer \"George Jung\". More recently, Suplee played a pivotal role of a young soldier in Miramax and Anthony Minghella's period piece \"Cold Mountain,\" with Jude Law and Nicole Kidman. He also co-starred with Ashton Kutcher in New Line's The Butterfly Effect (2004). Suplee co-stars opposite Jason Lee in NBC and Twentieth Century-Fox TV's half-hour comedy, \"My Name is Earl.\" He plays \"Randy\", the brother of Lee's \"Earl\" who, following an epiphany, embarks on a mission to right all the wrongs he has inflicted on people. For the big screen, Suplee will next be seen starring in Art School Confidential (2006) for director Terry Zwigoff (Ghost World (2001)), and he recently completed work for director Darren Aronofsky on Warner Bros.' The Fountain (2006) with Hugh Jackman and Rachel Weisz. In his spare time, Suplee enjoys reading, cooking and playing chess. He has also recently starting taking Muay Thai kick-boxing classes three times a week. Muay Thai is a form of martial arts boxing using full contact sparring, kicks, punches, kick blocks and shadow boxing learned under professional instruction.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzMjkyMzU1MF5BMl5BanBnXkFtZTcwNDAzNDI2OA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0839486","name":"Ethan Suplee","nicknames":["Sups"],"idIMDB":"nm0839486"},"actorId":"nm0839486","character":"Seth Ryan","urlCharacter":"http://www.imdb.com/character/ch0002730","main":true},{"actorName":"Fairuza Balk","urlProfile":"http://www.imdb.com/name/nm0000103","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTcxMzcwN15BMl5BanBnXkFtZTYwNjIwMjc1._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"21 May 1974","placeOfBirth":" Point Reyes, California, USA","birthName":"Fairuza Alejandra Feldthouse","height":"5' 3\" (1.6 m)","bio":"\"Fairuza!\" (\"Turquoise\" in Farsi), her father exclaimed as he saw her blue eyes: Fairuza Alejandra Balk had just been born on May 21, 1974 in Point Reyes, California. Her father, Solomon Feldthouse, was a traveling musician originally from Idaho, and her mother, Cathryn Balk, was a belly dancer. Her parents split up soon after. Fairuza grew up just north of San Francisco, California, on a commune-type ranch. Her mother later found some work in Vancouver, British Columbia, Canada. It was there that Fairuza began her career at the age of nine on the ABC special The Best Christmas Pageant Ever (1983). Two years later, she went to the United Kingdom where she attended the Royal Academy of Ballet, the Ramona Beauchamp Agency and the Bush Davies Performing Arts School. Fairuza worked for the Walt Disney Company for a while - at age 11, she was chosen from out of 1,200 girls to play the part of Dorothy, starring in Return to Oz (1985). A year later, she starred as, prophetically enough, The Worst Witch (1986), a harbinger of her breakout role in The Craft (1996) ten years later. Fairuza and her mother remained in London until 1988, then headed to Paris where the 15-year-old starred in Valmont (1989). The next year, they returned to Vancouver, where Fairuza enrolled in high school, but despite being a movie star, she was shy in class - she ended up doing correspondence courses. Back in Hollywood, Fairuza starred in a string of movies, including Gas, Food Lodging (1992), for which she received an Independent Spirit Award for Best Actress. Following further television and film work, she achieved cult status with her starring role as a teenage witch in The Craft (1996), her breakout film. The same year, she appeared in The Island of Dr. Moreau (1996), in which she did some belly dancing and attracted the attention of Lancashire, England-born co-star David Thewlis. They did another movie together, American Perfekt (1997). Fairuza was also the love interest in the wildly popular The Waterboy (1998) and had a major role in American History X (1998). With a half-dozen movies for 2000, Fairuza is much in demand. Her interests are writing poetry and stories, playing the guitar, singing (her main enjoyment) and dancing. She lives in Venice, California, and has an apartment in New York City.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQzMTcxMzcwN15BMl5BanBnXkFtZTYwNjIwMjc1._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000103","name":"Fairuza Balk","nicknames":["Ru"],"idIMDB":"nm0000103"},"actorId":"nm0000103","character":"Stacey","urlCharacter":"http://www.imdb.com/character/ch0002729","main":true},{"actorName":"Avery Brooks","urlProfile":"http://www.imdb.com/name/nm0000984","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3ODIyNDI3M15BMl5BanBnXkFtZTYwNjQ3MTcz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 October 1948","placeOfBirth":" Evansville, Indiana, USA","birthName":"Avery Franklin Brooks","height":"6' 1\" (1.85 m)","bio":"Avery Franklin Brooks was born on October 2, 1948 in Evansville, Indiana to a musically talented family. His maternal grandfather, Samuel Travis Crawford, was a tenor who graduated from Tougaloo College in Mississippi in 1901. Crawford toured the country singing with the Delta Rhythm Boys in the 1930s. Brooks also is musically inclined having played jazz piano, and has performed as the great baritone/actor/scholar Paul Robeson in the play entitled \"Paul Robeson\". He sang the lead in the A. Anthony Davis opera \"X: The Life and Times of Malcolm X\", and performed as \"Theseus\" and \"Oberon\" in Shakespeare's \"A Midsummer Night's Dream\" at Washington's Arena Stage. Long affiliated with Rutgers University, he was the institution's first Black MFA graduate. Additionally, he served as the National Black Arts Festival's (NBAF) Artistic Director throughout the 1990s in Atlanta, Georgia. An actor, activist, musician, director, and educator of epic proportions, Brooks was quoted in an interview about his work with NBAF and his performances: \"If I were a carpenter, I'd find a way to empower using that skill. I'm using as much as God has given--my mind, my voice, my heart, my art forms. This is the highest form of expression on the planet from God, to me, to you\".","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTI3ODIyNDI3M15BMl5BanBnXkFtZTYwNjQ3MTcz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000984","name":"Avery Brooks","idIMDB":"nm0000984"},"actorId":"nm0000984","character":"Dr. Bob Sweeney","urlCharacter":"http://www.imdb.com/character/ch0002734","main":true},{"actorName":"Elliott Gould","urlProfile":"http://www.imdb.com/name/nm0001285","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzU0MTA0OV5BMl5BanBnXkFtZTcwODQ2NDM2Mw@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1938","placeOfBirth":" Brooklyn, New York City, New York, USA","birthName":"Elliott Goldstein","height":"6' 3\" (1.91 m)","bio":"Elliott Gould is an American actor known for his roles in MASH (1970), his Oscar-nominated performance in Bob & Carol & Ted & Alice (1969), and more recently, his portrayal of old-time con artist Reuben Tishkoff in Ocean's Eleven (2001), Ocean's Twelve (2004) and Ocean's Thirteen (2007). Gould was born Elliott Goldstein on August 29, 1938 in Brooklyn, NY, to Lucille (Raver), who sold artificial flowers, and Bernard Goldstein, a textiles buyer in the garment industry. His family were Jewish immigrants (from Romania, Belarus, and Russia). Gould's portrayal of Trapper John in Robert Altman's_MASH (1970)_ marked the beginning of perhaps the most prolific period of his career, highlighted by such roles as Philip Marlowe in Altman's The Long Goodbye (1973) and Robert Caulfield in Capricorn One (1977). On television Gould has the distinction of having hosted Saturday Night Live (1975) six times and helmed E/R (1984), a situation comedy set in Chicago about a divorced physician working in an emergency room, which aired for one season. He also co-starred in the series Nothing Is Easy (1986) about a couple raising an adopted Chinese boy. Gould appeared regularly on television and in film throughout the 1980s and the 1990s, including cameos in The Muppet Movie (1979) and The Muppets Take Manhattan (1984). His most prominent recent television role was a recurring part on Friends (1994), on which he played Monica and Ross Geller's father Jack. More recently he voiced the character of Mr. Stoppable on the Disney Channel animated series Kim Possible (2002). In film Gould received critical acclaim for his portrayal of an older mobster in Warren Beatty's Bugsy (1991), and make a noteworthy appearance in American History X (1998). His next major TV role will be in Showtime's drama Ray Donovan (2013) starring Liev Schreiber. Gould has been married three times, twice to Jennifer Bogart, and once to Barbra Streisand. He has three children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjEzNzU0MTA0OV5BMl5BanBnXkFtZTcwODQ2NDM2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001285","name":"Elliott Gould","idIMDB":"nm0001285"},"actorId":"nm0001285","character":"Murray","urlCharacter":"http://www.imdb.com/character/ch0002732","main":true},{"actorName":"Stacy Keach","urlProfile":"http://www.imdb.com/name/nm0005078","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzEwODQ4Nl5BMl5BanBnXkFtZTYwMTA0NTQz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 June 1941","placeOfBirth":" Savannah, Georgia, USA","birthName":"Walter Stacy Keach Jr.","height":"5' 11½\" (1.82 m)","bio":"Stacy Keach has played to grand success a constellation of the classic and contemporary stage's greatest roles, and he is considered a pre-eminent American interpreter of Shakespeare. His SRO run as \"King Lear\" at the Shakespeare Theatre Company in Washington, D.C. received the best reviews any national leader has earned in that town for decades. Peter Marks of the Washington Post called Mr. Keach's Lear \"magnificent\". He recently accepted his third prestigious Helen Hayes Award for Leading Actor in 2010 for his stellar performance. His next stage appearance premiering January 13, 2011 at the Lincoln Center in New York is \"Other Desert Cities\" by Jon Robin Baitz and teaming him with Stockard Channing, Linda Lavin and Elizabeth Marvel. His latest television series, Lights Out (2011), on the FX network is a major new mid-season dramatic show, taking him back to the world of boxing which has been a rich setting for him before, notably in Huston's Fat City (1972) which ignited Keach's career as a film star. Versatility embodies the essence of Stacy Keach's career in film and television as well as on stage. The range of his roles is remarkable. His recent performance in Oliver Stone's \"W\" prompted fellow actor Alec Baldwin to blog an impromptu review matching Huston's amazement at Keach's power. Perhaps best known around the world for his portrayal of the hard-boiled detective, Mike Hammer, Stacy Keach is also well-known among younger generations for his portrayal of the irascible, hilarious Dad, Ken Titus, in the Fox sitcom, Titus, and more recently as Warden Henry Pope in the hit series, Prison Break. Following his triumphant recent title role performance in King Lear for the prestigious Goodman Theatre in Chicago, Keach joined the starring cast of John Sayles' recent film, Honeydripper. In the most recent of his non-stop activities, he has completed filming Deathmatch for the Spike Channel, and The Boxer for Zeitsprung Productions in Berlin, Germany. German audiences will also see him as one of the co-stars in the multi-million dollar production of Hindenburg: le géant des airs (2011), scheduled to air in January, 2011 with worldwide release thereafter. Mr. Keach co-stars in the new FX series entitled Lights Out (2011) about a boxing family, where he plays the Dad-trainer of two boxing sons played by Holt McCallany and Pablo Schreiber. The series is also scheduled to air in January, 2011. Keach returns to the New York stage at the start of the 2011 in Jon Robin Baitz's new play, \"Other Desert Cities,\" at the Lincoln Center. Capping his heralded accomplishment on the live stage of putting his own stamp on some of the theatre world's most revered and challenging roles over the past year when he headed the national touring company cast of \"Frost/Nixon,\" portraying Richard M. Nixon, bringing still another riveting characterization to the great legit stages of Los Angeles, Chicago, Boston, the nation's capitol and other major cities. He won his second Best Actor Helen Hayes Award for his outstanding performance. His second triumphant portrayal of King Lear in the past three years, this time for the Shakespeare Theatre Company in the nation's capital earned reviews heard around the world, with resulting offers for him to repeat that giant accomplishment in New York, Los Angeles and even Beijing. An accomplished pianist and composer, Mr. Keach composed the music for the film, Imbued (2009), directed by Rob Nilssen, a celebrated film festival favorite, in which Keach also starred. He has also completed composing the music for the Mike Hammer audio radio series, \"Encore For Murder\", written by Max Collins, directed by Carl Amari, and produced by Blackstone Audio. Mr. Keach began his film career in the late 1960's with _The Heart Is A Lonely Hunter_, followed by _The New Centurions_ with George C. Scott; Doc Holiday with Faye Dunaway in the film 'Doc' (1971); an over-the-hill boxer,Billy Tully in Fat City (1972); directed by John Huston, and The Long Riders (1980), which he co-produced and co-wrote with his brother, James Keach, directed by Walter Hill. On the lighter side, his characterization of Sgt. Stedenko in Cheech and Chong's Up in Smoke (1978), and the sequel, Nice Dreams (1981), gave a whole new generation a taste of Mr. Keach's comedic flair, which he also demonstrated in Robert Altman's Brewster McCloud (1970), playing the oldest living lecherous Wright Brother; and The Life and Times of Judge Roy Bean (1972) where he played a crazed albino out to kill Paul Newman. Historical roles have always attracted him. In movies he has played roles ranging from Martin Luther to Frank James. On television he has been Napoleon, Wilbur Wright, J. Robert Oppenheimer, Barabbas, Sam Houston, and Ernest Hemingway, for which he won a Golden Globe as Best Actor in a mini-series and was nominated for an Emmy in the same category. He played an eccentric painter, Mistral, in the Judith Krantz classic, Mistral's Daughter (1984), a northern spy in the civil war special, The Blue and the Gray (1982), more recently as the pirate Benjamin Hornigold in the Hallmark epic Blackbeard (2006). As a director, his production of Arthur Miller's Incident at Vichy (1973) for PBS was, according to Mr. Miller in his autobiography, Timebends, \"the most expressive production of that play he had seen.\" He won a Cine Golden Eagle Award for his work on the dramatic documentary, The Repeater, in which he starred and also wrote and directed. But it is perhaps the live theatre where Mr. Keach shines brightest. He began his professional career with the New York Shakespeare Festival in 1964, doubling as Marcellus and the Player King in a production of Hamlet directed by Joseph Papp and which featured Julie Harris as Ophelia. He rose to prominence in 1967 in the Off-Broadway political satire, MacBird, where the title role was a cross between Lyndon Johnson and Macbeth and for which he received the first of his three Obie awards. He played the title roles in Henry 5, Hamlet (which he played 3 times), Richard 3, Macbeth, and most recently as King Lear in Robert Falls' modern adaptation at Chicago's Goodman Theatre, which Charles Isherwood of the NY Times called \"terrific\" and \"a blistering modern-dress production that brings alive the morally disordered universe of the play with a ferocity unmatched by any other production I've seen.\" Mr. Keach's stage portrayals of Peer Gynt, Falstaff and Cyrano de Bergerac, and Hamlet caused the New York Times to dub him \"the finest American classical actor since John Barrymore.\" Mr. Keach's Broadway credits include his Broadway debut, Indians, where he played Buffalo Bill and was nominated for a Tony award as Best Actor. He starred in Ira Levin's Deathtrap, the Pulitzer Prize winning Kentucky Cycle (for which he won his first Helen Hayes award as Best Actor), the Rupert Holmes one-man thriller, Solitary Confinement, where Mr. Keach played no less than six roles, all unbeknownst to the audience until the end of the play. In the musical theatre, he starred in the national tour of Barnum, played the King in Camelot for Pittsburgh's Civic Light Opera, and the King in The King and I, which he also toured in Japan. He starred in the Jon Robin Baitz play, Ten Unknowns, at the Mark Taper Forum in 2003. The LA Times said: \"And then there's Keach. What a performance! How many actors can manage such thunder and such sweet pain. He's been away from the LA stage too long. Welcome back.\" In 2004, he starred as Scrooge in Boston's Trinity Rep musical production of A Christmas Carol; earlier in 2004, he starred as Phil Ochsner in Arthur Miller's last play Finishing The Picture, directed by Robert Falls at the Goodman Theatre. As a narrator his voice has been heard in countless documentaries; as the host for the Twilight Zone radio series; numerous books on tape, including the Short Stories of Ernest Hemingway. In the year 2000, he recorded a CD of all of Shakespeare's Sonnets. He recently recorded the voice of St. Paul for a new audio version of The New Testament:, The Word of Promise and Job for the Old Testament edition. He is the narrator on CNBC's new hit show, American Greed (2007), and recently narrated the award-winning documentary, The Pixar Story (2007). He has also reprised his role as Mike Hammer in the Blackstone audio series, the most recent being \"Encore for Murder\". A charter-member of LA Theatre Works, Mr. Keach recently played the title role in Bertolt Brecht's Galileo, recorded both for radio and CD. He was seen on CBS's hit show Two and a Half Men (2003) as the gay Dad of Charlie's fiance. Stacy Keach also believes strongly in 'giving back' and has been the Honorary Chair for the Cleft Palate Foundation for the past twenty-five years. He is also the national spokesman for the World Craniofacial organization. He has served on the Artist's Committee for the Kennedy Center Honors for two decades, is on the board of directors for Genesis at the Crossroads, a Chicago-based organization dedicated to bringing peoples of combatant cultures together through the shared artistic expressions of the visual and culinary arts, music, dance, and theater. He also serves on the artistic board for Washington DC's Shakespeare Theatre National Council, where he was also honored in 2000 with their prestigious Millennium Award for his contribution to classical theatre. Some years ago Hollywood honored him with a Celebrity Outreach Award for his work with charitable organizations. He has been the recipient of Lifetime Achievement Awards from Pacific Pioneer's Broadcasters, the San Diego Film Festival, the Pacific Palisades Film Festival, and The 2007 Oldenburg Film Festival in Germany. Later this year, he will be awarded the 2010 Lifetime Award from the St. Louis Film Festival. In 2008, he received the Mary Pickford Award for versatility in acting. Mr. Keach was a Fulbright scholar to the London Academy of Music and Dramatic Art, attended the University of California at Berkeley and the Yale Drama School. He has always been a star of the American stage, especially in Shakespearen roles such as Hamlet, Henry 5, Coriolanus, Falstaff, Macbeth, Richard 3, and most recently, King Lear. Of his many accomplishments, Mr. Keach claims that his greatest accomplishment is his family. He has been married to his beautiful wife Malgosia for twenty-five years, and they have two wonderful children, Shannon Keach (1988), and daughter Karolina Keach (1990).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTQwMzEwODQ4Nl5BMl5BanBnXkFtZTYwMTA0NTQz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005078","name":"Stacy Keach","idIMDB":"nm0005078"},"actorId":"nm0005078","character":"Cameron Alexander","urlCharacter":"http://www.imdb.com/character/ch0002733","main":true},{"actorName":"William Russ","urlProfile":"http://www.imdb.com/name/nm0750916","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNzU5MzQ1N15BMl5BanBnXkFtZTcwOTU1NTIxNw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"20 October 1950","placeOfBirth":" Portsmouth, Virginia, USA","birthName":"William Hardy Russ IV","height":"6' (1.83 m)","bio":"Son of a naval officer; born in Portsmouth, VA. Father of one daughter. Enjoys thrill sports, is an avid downhill skier.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTcwNzU5MzQ1N15BMl5BanBnXkFtZTcwOTU1NTIxNw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0750916","name":"William Russ","nicknames":["Rusty"],"idIMDB":"nm0750916"},"actorId":"nm0750916","character":"Dennis Vinyard","urlCharacter":"http://www.imdb.com/character/ch0213820","main":true},{"actorName":"Guy Torry","urlProfile":"http://www.imdb.com/name/nm0868956","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NzU4MjEwN15BMl5BanBnXkFtZTYwMjg4NjA0._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"5 January 1969","placeOfBirth":" St. Louis, Missouri, USA","birthName":"Robert Torry","bio":"Guy Torry is a native of St. Louis, Missouri. Known as \"Torry\" by college friends, Guy attended Southeast Missouri State University, the alma mater of fellow comedian and St. Louisan, Cedric The Entertainer. His comic genius was evident to fellow students during these college years. Guy often held impromptu comedy \"slams\" in dorm breakrooms, leaving fellow students in stitches. Like his brother Joe, he left Missouri for Hollywood to find success in comedy and film. He actively supports his brother's \"Give Back The Love\" Foundation, a St Louis charity dedicated to helping disadvantaged children with basic needs such as clothes and school supplies.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE4NzU4MjEwN15BMl5BanBnXkFtZTYwMjg4NjA0._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0868956","name":"Guy Torry","idIMDB":"nm0868956"},"actorId":"nm0868956","character":"Lamont","urlCharacter":"http://www.imdb.com/character/ch0002736","main":true},{"actorName":"Joe Cortese","urlProfile":"http://www.imdb.com/name/nm0181288","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MTE5ODgzNF5BMl5BanBnXkFtZTgwOTAyMzU2NTE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"22 February 1948","placeOfBirth":" Paterson, New Jersey, USA","birthName":"Joseph Michael Cortese","height":"6' 2\" (1.88 m)","bio":"Mr. Cortese, a Jersey boy, received a Bachelor of Arts degree in Theater/ Communications from Midwestern College in Denison, Iowa, where he studied theatre, under the guidance of his acting teacher Alfred Rusico. While attending school on a drama scholarship, Joe did lead roles in many plays, many with seasoned New York and Hollywood actors. Some of his theatre credits include Lenny in \"Of Mice and Men\", Pozzo in \"Waiting for Godot\", and Patsy in \"Three Men on a Horse\", to mention a few. After graduation he headed to New York and at 22 years of age he started his career in Journalism on Madison Ave. where he became the associate fashion editor for Gentlemen's Quarterly at Esquire. After a very creative working relationship with Esquire, he left in pursuit of a career in acting and writing. This pursuit eventually led him to the New York Theatre. Some of his New York and regional credits include \"Waiting for Lefty\" and \"Momma's little Angels\" both at ETC. Mr. Cortese spent two summers at The Eugene O'Neil playwright's foundation in Waterford Connecticut. Joe also starred in the original play \"Golden Girl\" portraying Clifford Odets, at Theatre for New City. His early stage work eventually led to his first leading film role in the highly acclaimed cult classic, \"The Death Collector\" with Joe Pesci which eventually lead him to Hollywood where over the last 30 years he has established himself as an actor/writer. Some of his Screenplays include, \"Charlie Lucky\", \"The Bridge\", \"The Bible Teacher,\" \"Genghis Khan: Lord of the Kings\" and High Caliber. In Television he has recently created Escort Inc. a 1 hour television pilot. He is currently in development on San Pedro Waterfront.. . As an actor Joe Cortese has achieved success in film, television and theatre. He just finished starring in the Independent film, \"Doobious Sources\" as Magnus Martindale, for writer/director Clif Lord. He also recently shot, \"The Bronx Bull\", with William Forsythe portraying the legendary fighter Jake LaMotta for director Martin Guigui, as Vito Latzzio, a character described as the Italian Johnny Carson. Some other film credits are: Abel Ferrara's \"Go Go Tales\" with Willem De Foe and Bob Hoskins, which had its World Premiere at The Cannes Film Festival' and later that year it had its American Premiere at the New York Film Festival at Lincoln Center. Joe won the Best Actor award for 2006 at The New York Hip Hop film festival for his starring role in the comedy, \"Shut Up and Shoot\". In 2005 Joe starred in Paramount's \"Against the Ropes\" with Meg Ryan, Tony Shalhoub and Charles Dutton, as well as the independent festival film \"You Got Nothin'\", for director Phillip Angelotti. Some of his films include starring roles in \"Windows\" with Talia Shire for UA, \"Monsignor\" which he starred in with Christopher Reeve for director Frank Perry and 20TH Century Fox, and \"American History X\" with Edward Norton for Warner Bros. Joe has received major accolades for his numerous top rated television projects including \"The C.A.T. Squad\", a trilogy of two-hour movies for NBC and producer/director William Friedkin. The highly rated mini-series \"Something's Out There\" for NBC, \"Exclusive\" with Suzanne Somers (ABC), \"Assault and Matrimony\" (NBC), \"Just Life\" (ABC), \"Letting' GO\" (ABC), \"Born to Run\" (FOX), Sidney Sheldon's mini-series \"If Tomorrow Comes\" (CBS) and Jackie Collins' \"Lady Boss\" (NBC). Cortese also starred in the PBS special \"He Wants Her Back\", written and directed by Stanton Kaye. His other recent T.V appearances were with Danny Devito in \"Its Always Sunny in Philadelphia\". Joe Cortese has also been honored by his Television peers and fans by receiving the1989 Saturn Award for best actor in a miniseries for \"Something's Out There\". Other outstanding performances include starring roles in \"Lucky Town\" with James Caan and Kirsten Dunst, \"The Shipment\" with Matthew Modine and Elizabeth Berkley, and\" Ruby\" with Danny Aiello. Joe received rave reviews in Paramount's \"Malevolence\" where he played \"Billy Bob Jones\": a character loosely based on James Earl Ray. He also received kudos for his role as Johnny Roselli in HBO's critically acclaimed movie, \"The Rat Pack\". Mr. Cortese never strayed far from the theatre once he moved to Los Angeles. He was one of the founding members of the MET Theatre in Los Angeles, where he produced the original play \"Cody Angelino Is Coming\", which he also starred in. Some of his other L.A. theatre credits include \"True West\" at the Zephyr theatre, and \"Waking Jimmy Rizzo\" at the White Fire theatre. He is also a lifetime member of The Actors Studio where he continues his support of actors and the craft of acting. Mr. Cortese is a member of the Academy of Motion Pictures Arts and Sciences.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk4MTE5ODgzNF5BMl5BanBnXkFtZTgwOTAyMzU2NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0181288","name":"Joe Cortese","idIMDB":"nm0181288"},"actorId":"nm0181288","character":"Rasmussen","urlCharacter":"http://www.imdb.com/character/ch0218854","main":true},{"actorName":"Jason Bose Smith","urlProfile":"http://www.imdb.com/name/nm0808633","urlPhoto":"","biography":{"dateOfBirth":"May1979","placeOfBirth":"","bio":"Jason Bose Smith was born in May 1979. He is an actor, known for American History X (1998), Friday (1995) and Where I Live (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0808633","name":"Jason Bose Smith","idIMDB":"nm0808633"},"actorId":"nm0808633","character":"Little Henry","urlCharacter":"http://www.imdb.com/character/ch0218857","main":true},{"actorName":"Antonio David Lyons","urlProfile":"http://www.imdb.com/name/nm0529014","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3OTE4MTM4Nl5BMl5BanBnXkFtZTgwNDgxNDg3NzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"December1971","placeOfBirth":" Hollywood, Florida, USA","bio":"Antonio David Lyons was born on December 20th in Hollywood, Florida, USA. He is an actor and producer, known for The Book of Negroes (2015), American History X (1998), Hotel Rwanda (2004) and The Sum of All Fears (2002). His artistic universe straddles the globe with one foot planted firmly in both South Africa and the USA. He holds an MA in Applied Theatre from the City University of New York (CUNY) and manages to maintain a thriving career as a professional artist in tandem with his activist and scholarly pursuits. His career continues to evolve with the added dimension of poetic house artist and lyricist. In 2007 he released his first solo project Human Jewels and We Dance We Pray in 2011. He is the author of three plays: Celebration, Beautiful Struggle and We Are Here. He has also been a Fulbright Awardee, an Oregon Shakespeare Festival Producing Fellow and a Scholar in Residence at University of Michigan (Ann Arbor). We Are Here (WAH) has grown into a social activism initiative that has implemented programming in South Africa, New York, Detroit, and Ann Arbor. This project is designed to foster an environment where the arts can impact social conditions, attitudes, perceptions and structures amongst men and boys.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU3OTE4MTM4Nl5BMl5BanBnXkFtZTgwNDgxNDg3NzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0529014","name":"Antonio David Lyons","idIMDB":"nm0529014"},"actorId":"nm0529014","character":"Lawrence","urlCharacter":"http://www.imdb.com/character/ch0218860","main":true},{"actorName":"Alex Sol","urlProfile":"http://www.imdb.com/name/nm0812550","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NTA0ODU1MV5BMl5BanBnXkFtZTcwMDMwODczMQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"1973","placeOfBirth":"","bio":"Alex Sol was born in 1973. He is an actor and assistant director, known for American History X (1998), Taking Lives (2004) and The Adventures of Pluto Nash (2002).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5NTA0ODU1MV5BMl5BanBnXkFtZTcwMDMwODczMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0812550","name":"Alex Sol","idIMDB":"nm0812550"},"actorId":"nm0812550","character":"Mitch McCormick","urlCharacter":"http://www.imdb.com/character/ch0218864","main":true}],"seasons":[],"idIMDB":"tt0120586","urlIMDB":"http://www.imdb.com/title/tt0120586","business":{"budget":{"money":"$7,500,000","country":null,"day":null,"month":null,"year":null,"remarks":"estimated"},"openingWeekend":[{"money":"$1,340,166","country":"USA","day":"22","month":"11","year":"1998","remarks":"512 Screens wide release"},{"money":"$156,076","country":"USA","day":"01","month":"11","year":"1998","remarks":"17 Screens"},{"money":"£120,629","country":"UK","day":"28","month":"03","year":"1999","remarks":"76 Screens"}],"gross":[{"money":"$6,712,241","country":"USA","day":"28","month":"03","year":"1999","remarks":""},{"money":"$6,685,003","country":"USA","day":"21","month":"03","year":"1999","remarks":""},{"money":"$6,638,563","country":"USA","day":"14","month":"03","year":"1999","remarks":""},{"money":"$6,597,562","country":"USA","day":"07","month":"03","year":"1999","remarks":""},{"money":"$6,545,272","country":"USA","day":"28","month":"02","year":"1999","remarks":""},{"money":"$6,479,476","country":"USA","day":"21","month":"02","year":"1999","remarks":""},{"money":"$6,412,832","country":"USA","day":"14","month":"02","year":"1999","remarks":""},{"money":"$6,337,486","country":"USA","day":"07","month":"02","year":"1999","remarks":""},{"money":"$6,314,903","country":"USA","day":"31","month":"01","year":"1999","remarks":""},{"money":"$6,286,313","country":"USA","day":"24","month":"01","year":"1999","remarks":""},{"money":"$6,260,099","country":"USA","day":"17","month":"01","year":"1999","remarks":""},{"money":"$6,205,537","country":"USA","day":"10","month":"01","year":"1999","remarks":""},{"money":"$6,114,166","country":"USA","day":"03","month":"01","year":"1999","remarks":""},{"money":"$5,992,166","country":"USA","day":"27","month":"12","year":"1998","remarks":""},{"money":"$5,804,792","country":"USA","day":"20","month":"12","year":"1998","remarks":""},{"money":"$5,466,361","country":"USA","day":"13","month":"12","year":"1998","remarks":""},{"money":"$4,904,220","country":"USA","day":"06","month":"12","year":"1998","remarks":""},{"money":"$4,001,063","country":"USA","day":"29","month":"11","year":"1998","remarks":""},{"money":"$2,231,929","country":"USA","day":"22","month":"11","year":"1998","remarks":""},{"money":"$748,245","country":"USA","day":"15","month":"11","year":"1998","remarks":""},{"money":"$433,359","country":"USA","day":"08","month":"11","year":"1998","remarks":""},{"money":"$185,816","country":"USA","day":"01","month":"11","year":"1998","remarks":""},{"money":"£291,438","country":"UK","day":"04","month":"04","year":"1999","remarks":""},{"money":"£120,629","country":"UK","day":"28","month":"03","year":"1999","remarks":""},{"money":"$23,875,127","country":"Worldwide","day":"17","month":"07","year":"2011","remarks":""}],"weekendGross":[{"money":"£79,745","country":"UK","day":"04","month":"04","year":"1999","remarks":"77 Screens"},{"money":"£120,629","country":"UK","day":"28","month":"03","year":"1999","remarks":"76 Screens"}],"admissions":[{"money":"330,652","country":"Germany","day":"31","month":"12","year":"1999","remarks":""},{"money":"94,927","country":"Germany","day":"07","month":"03","year":"1999","remarks":""},{"money":"46,710","country":"Netherlands","day":"31","month":"12","year":"2000","remarks":""},{"money":"46,265","country":"Netherlands","day":"31","month":"12","year":"1999","remarks":""}],"productionDates":{"money":null,"country":null,"day":"17","month":"03","year":"1997","remarks":null},"filmingDates":[{"money":null,"country":null,"day":"17","month":"03","year":"1997","remarks":null},{"money":null,"country":null,"day":"21","month":"05","year":"1997","remarks":null}],"copyrightHolder":"(1998) New Line Productions, Inc."},"technical":{"runtime":["1 hr 59 min (119 min)","1 hr 41 min (101 min) (workprint) (USA)"],"soundMix":["SDDS","Dolby Digital","DTS"],"color":["Black and White","Color"],"aspectRatio":["1.85 : 1"],"camera":["Panaflex Camera and Lenses by Panavision"],"laboratory":["DeLuxe, Hollywood (CA), USA (also prints)"],"filmLength":["3,262 m (Sweden)"],"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"8.6","metascore":"62","filmingLocations":[{"location":"2206 Meade Place, Venice Beach, Los Angeles, California, USA"}],"rated":"R","awards":[{"award":"Academy Awards, USA 1999","titlesAwards":[{"titleAwardOutcome":"Nominated Oscar","categories":[{"category":"Best Actor in a Leading Role","names":[{"name":"Edward Norton","id":"nm0001570","role":null}]}]}]},{"award":"Academy of Science Fiction, Fantasy & Horror Films, USA 1999","titlesAwards":[{"titleAwardOutcome":"Nominated Saturn Award","categories":[{"category":"Best Actor","names":[{"name":"Edward Norton","id":"nm0001570","role":null}]}]}]},{"award":"Awards Circuit Community Awards 1998","titlesAwards":[{"titleAwardOutcome":"Won ACCA","categories":[{"category":"Best Actor in a Leading Role","names":[{"name":"Edward Norton","id":"nm0001570","role":null}]}]},{"titleAwardOutcome":"Nominated ACCA","categories":[{"category":"Best Motion Picture","names":[{"name":"John Morrissey","id":"nm0554204","role":null}]},{"category":"Best Actor in a Supporting Role","names":[{"name":"Edward Furlong","id":"nm0000411","role":null}]},{"category":"Best Original Screenplay","names":[{"name":"David McKenna","id":"nm0571346","role":null}]},{"category":"Best Film Editing","names":[{"name":"Gerald B. Greenberg","id":"nm0338513","role":null},{"name":"Alan Heim","id":"nm0374189","role":null}]}]}]},{"award":"Chicago Film Critics Association Awards 1999","titlesAwards":[{"titleAwardOutcome":"Nominated CFCA Award","categories":[{"category":"Best Actor","names":[{"name":"Edward Norton","id":"nm0001570","role":null}]}]}]},{"award":"Chlotrudis Awards 1999","titlesAwards":[{"titleAwardOutcome":"Nominated Chlotrudis Award","categories":[{"category":"Best Actor","names":[{"name":"Edward Norton","id":"nm0001570","role":null}]}]}]},{"award":"Motion Picture Sound Editors, USA 1999","titlesAwards":[{"titleAwardOutcome":"Nominated Golden Reel Award","categories":[{"category":"Best Sound Editing - Music (Foreign &amp; Domestic)","names":[{"name":"Richard Ford","id":"nm0285841","role":"music editor"}]}]}]},{"award":"Online Film Critics Society Awards 1999","titlesAwards":[{"titleAwardOutcome":"Nominated OFCS Award","categories":[{"category":"Best Actor","names":[{"name":"Edward Norton","id":"nm0001570","role":null}]}]}]},{"award":"Political Film Society, USA 1999","titlesAwards":[{"titleAwardOutcome":"Nominated PFS Award","categories":[{"category":"Peace","names":[]}]}]},{"award":"Satellite Awards 1999","titlesAwards":[{"titleAwardOutcome":"Won Golden Satellite Award","categories":[{"category":"Best Actor in a Motion Picture, Drama","names":[{"name":"Edward Norton","id":"nm0001570","role":null}]}]},{"titleAwardOutcome":"Nominated Golden Satellite Award","categories":[{"category":"Best Actress in a Supporting Role in a Motion Picture, Drama","names":[{"name":"Beverly D'Angelo","id":"nm0000350","role":null}]},{"category":"Best Screenplay, Original","names":[{"name":"David McKenna","id":"nm0571346","role":null}]}]}]},{"award":"Southeastern Film Critics Association Awards 1999","titlesAwards":[{"titleAwardOutcome":"Won SEFCA Award","categories":[{"category":"Best Actor","names":[{"name":"Edward Norton","id":"nm0001570","role":null},{"name":"Rounders","id":"tt0128442","role":null}]}]}]},{"award":"Taormina International Film Festival 1999","titlesAwards":[{"titleAwardOutcome":"Won Best Actor","categories":[{"category":"","names":[{"name":"Edward Norton","id":"nm0001570","role":null}]}]}]},{"award":"Young Artist Awards 1999","titlesAwards":[{"titleAwardOutcome":"Nominated Young Artist Award","categories":[{"category":"Best Performance in a Feature Film - Supporting Young Actor","names":[{"name":"Edward Furlong","id":"nm0000411","role":null}]}]}]}],"votes":"830,301","type":"Movie","companyCreditsSimple":[{"idCompany":"co0046718","name":"New Line Cinema"},{"idCompany":"co0074787","name":"Savoy Pictures"},{"idCompany":"co0023612","name":"Turman-Morrissey Company, The"}],"keywords":{"keywords":["neo nazi","prison","curb stomping","jail","murder","hatred","racism","tearjerker","rape","revenge","prison release","ex convict","morality","son dislikes mother's boyfriend","death","shaved head","murder in a bathroom","white supremacist","title spoken by character","prison shower","group shower","male underwear","bare chested male","pubic hair","male pubic hair","skinhead","racial","racial violence","bathroom","strong language","spitting on someone","violent argument","school project","computer","blood on face","blood on clothes","blood on body","rape victim","remorse","regret","sexual assault","guilt","male rape","interracial friendship","high school student","threat","friendship","friend","paranoia","fear","hooligan","politics","wound","abuse","jewish","kicking","ill mother","photograph","bedroom","nazi paraphernalia","charisma","propaganda","rage","crack house","murder of father","arrest","shooting","pistol","breaking into a car","teenage boy","teenager","sociology","bigotry","prejudice","nudity","male nudity","venice beach california","cigarette smoking","racist","high school principal","male frontal nudity","bare breasts","black high school principal","african american high school principal","gunshot","gun","swastika tattoo","mein kampf","essay on mein kampf","delinquent","anger","n word","rear entry sex","jellybean","hate","store raid","store","car","high school","video tape","urinal","orgasm","reference to hillary clinton","sheet","flash mob","iron cross","laundry","shot in the chest","camcorder","underwear","prison cafeteria","reference to rodney king","reference to abraham lincoln","korean american","portrait of hitler","mexican american","news clipping","reference to adolf hitler","reference to martin luther king","reference to cesar chavez","fireman","social studies teacher","jewish american","racial intolerance","race based hatred","ethnic gang","men's bathroom","race relations","directorial debut","three word title","reference to the kkk","reference to boston celtics","reference to kevin mchale","reference to james worthy","brutality","held at gunpoint","incarceration","threat to kill","disarming a person with a gun","family tragedy","white power","death threat","threats and intimidation","kicked in the face","punched in the face","country name in title","juvenile delinquent","humiliation","boxer shorts","gay rape","crying man","blowing smoke in someone's face","villain turns good","bleeding anus","blood splatter","voice over narration","mother daughter relationship","flashback","family relationships","boyfriend girlfriend relationship","tough guy","gang rape","friendship between men","f word","death of brother","hypocrite","hypocrisy","black & white to color","title appears in writing","thong","male rear nudity","bare butt","anti fascism","student principal relationship","chelsea smile","cult film","male on male rape","psychopath","moral ambiguity","loss of brother","los angeles california","beating","skull crushing","korean grocer","dysfunctional family","crushed head","anti semitic slur","loud sex","interrupted sex","film starts with sex","aryan brotherhood","crying","kiss on the cheek","director also cinematographer","shot to death","racial prejudice","racial discrimination","racial tension","woman on top","female nudity","brother brother relationship","father son relationship","obscene finger gesture","tattoo","swastika","manslaughter","gunfire","african american","gang warfare","gang violence","hate crime","literature","affirmative action","anal rape","racial slur","prison gang","brother sister relationship","widow","anti semitism","prison rape","ethnic slur","mother son relationship","xenophobia","basketball","narration from the grave","single parent","sodomy","death of father","surprise ending","little brother","goatee","bully","inappropiate use of the n word","overweight man","reference to the los angeles lakers","controversy","blood"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 09:56:19"}}