{"data":{"movies":[{"title":"Crossworlds","originalTitle":"","year":"1996","releaseDate":"19970108","directors":[{"name":"Krishna Rao","id":"nm0710568"}],"writers":[{"name":"Krishna Rao","id":"nm0710568"},{"name":"Raman Rao","id":"nm0710598"}],"runtime":"90 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTYyMTI1ODc4MF5BMl5BanBnXkFtZTcwNTk0NDMyMQ@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Action","Sci-Fi","Comedy"],"plot":"A young man discovers that his father was from another dimension and that he is the key to the operation of a crystal that can be the deciding factor in a war crossing the dimensions.","simplePlot":"A young man discovers that his father was from another dimension and that he is the key to the operation of a crystal that can be the deciding factor in a war crossing the dimensions.","actors":[{"actorName":"Rutger Hauer","urlProfile":"http://www.imdb.com/name/nm0000442","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY4MjI0MjgyOV5BMl5BanBnXkFtZTgwMDA0MDkyODE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 January 1944","placeOfBirth":" Breukelen, Utrecht, Netherlands","birthName":"Rutger Oelsen Hauer","height":"6' 1½\" (1.87 m)","bio":"Blonde, blue-eyed, tall and handsome Dutch actor Rutger Hauer has an international reputation for playing everything from romantic leads to action heroes to sinister villains. Hauer was born in Breukelen, a town in the province of Utrecht, the Netherlands. He is the son of Teunke (Mellema) and Arend Hauer, both actors. Because his parents were often touring, he and his three sisters were raised by a nanny. A bit of a rebel during his childhood, he chafed at the rules and rigors of school and was often getting into mischief. His grandfather had been the captain of a schooner and at age 15, Hauer ran away to work on a freighter for a year. Like his great-grandfather, Hauer is color-blind, which prevented him from furthering his career as a sailor. Upon his return he attended night school and started working in the construction industry. When he again bombed at school, his parents enrolled him in drama classes. Fancying himself a poet, he spent most of his time writing poetry and hanging out in Amsterdam coffee houses instead of studying. He was expelled for poor attendance and afterward spent a brief period in the Dutch navy. Deciding he didn't like military life, he convinced his superiors that he was mentally unfit and was sent to a special home for psych patients. It was an unpleasant place, but Hauer remained there until he convinced his ranking officers that the military really did not need him.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTY4MjI0MjgyOV5BMl5BanBnXkFtZTgwMDA0MDkyODE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0000442","name":"Rutger Hauer","nicknames":["The Dutch Paul Newman"],"idIMDB":"nm0000442"},"actorId":"nm0000442","character":"A.T.","urlCharacter":"http://www.imdb.com/character/ch0454971","main":true},{"actorName":"Josh Charles","urlProfile":"http://www.imdb.com/name/nm0001038","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNjE3NDU3OV5BMl5BanBnXkFtZTcwMDI2NzU3MQ@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"15 September 1971","placeOfBirth":" Baltimore, Maryland, USA","birthName":"Joshua Aaron Charles","height":"5' 11\" (1.8 m)","bio":"Josh Charles was born on September 15, 1971 in Baltimore, Maryland, USA as Joshua Aaron Charles. He is an actor, known for Dead Poets Society (1989), The Good Wife (2009) and S.W.A.T. (2003). He has been married to Sophie Flack since September 6, 2013. They have one child.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTMyNjE3NDU3OV5BMl5BanBnXkFtZTcwMDI2NzU3MQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0001038","name":"Josh Charles","idIMDB":"nm0001038"},"actorId":"nm0001038","character":"Joe Talbot","urlCharacter":"http://www.imdb.com/character/ch0454972","main":true},{"actorName":"Stuart Wilson","urlProfile":"http://www.imdb.com/name/nm0934179","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NDQ2NTAwMV5BMl5BanBnXkFtZTYwMjk0MTI3._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"25 December 1946","placeOfBirth":" Guildford, Surrey, England, UK","birthName":"Stuart Conan Wilson","height":"6' (1.83 m)","bio":"Stuart Wilson was born in Guildford, Surrey in England, on December 25th, 1946. He went to thirteen different schools, as his father worked in the RAF and traveled around the world. After the RAF, his father worked as an engineer in the copper mines in Rhodesia. Stuart moved to London in the mid- Sixties and trained at RADA. After RADA, he began working in repertory in Liverpool and at the RSC. His career took off when he played \"Johann Strauss, Jr.\" in the The Strauss Family (1972), in which his character aged from 14 to 74. He continued to have a successful television career, playing various roles, including \"Vronsky\" in Anna Karenina (1977) and \"Major Jimmy Clarke\" in The Jewel in the Crown (1984). In the late 1980s, Stuart moved to Hollywood, where he landed roles in The Age of Innocence (1993) with Martin Scorsese, Lethal Weapon 3 (1992) and Roman Polanski's Death and the Maiden (1994). Stuart Wilson occasionally returns to the London stage and, in 2002, played \"Antony\" in \"Antony and Cleopatra\" at the RSC.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc0NDQ2NTAwMV5BMl5BanBnXkFtZTYwMjk0MTI3._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0934179","name":"Stuart Wilson","idIMDB":"nm0934179"},"actorId":"nm0934179","character":"Ferris","urlCharacter":"http://www.imdb.com/character/ch0454973","main":true},{"actorName":"Andrea Roth","urlProfile":"http://www.imdb.com/name/nm0744776","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NDk5ODU3Ml5BMl5BanBnXkFtZTYwMDAxMzAz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"30 September 1967","placeOfBirth":" Woodstock, Ontario, Canada","height":"5' 7½\" (1.71 m)","bio":"Andrea Roth, a first generation Scottish-Dutch Canadian, was born in Woodstock, Ontario. Her first theatrical appearance was in The Miracle Worker when she was eleven. She received her big show business break when she starred in the mini-series A Woman of Independent Means (1995), playing Sally Field's character's daughter Eleanor. In this period piece, she aged from 16 to 60. Other cast members included Charles Durning and Tony Goldwyn. Andrea began her career in television with HBO's Alfred Hitchcock Presents (1985). She has been a guest star on over 15 television shows, including Highlander (1992), Dead at 21 (1994) and Parker Lewis Can't Lose (1990). She also starred in La star aux deux visages (1994) and In Spite of Love (1994), two very well-received mini-series.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTg4NDk5ODU3Ml5BMl5BanBnXkFtZTYwMDAxMzAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0744776","name":"Andrea Roth","idIMDB":"nm0744776"},"actorId":"nm0744776","character":"Laura","urlCharacter":"http://www.imdb.com/character/ch0454974","main":true},{"actorName":"Perry Anzilotti","urlProfile":"http://www.imdb.com/name/nm0031759","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1ODYzMTMyMV5BMl5BanBnXkFyZXN1bWU@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Perry Anzilotti is an actor and producer, known for Angus (1995), Bean (1997) and Air Bud: Golden Receiver (1998).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY1ODYzMTMyMV5BMl5BanBnXkFyZXN1bWU@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0031759","name":"Perry Anzilotti","idIMDB":"nm0031759"},"actorId":"nm0031759","character":"Rebo","urlCharacter":"http://www.imdb.com/character/ch0454975","main":true},{"actorName":"Jack Black","urlProfile":"http://www.imdb.com/name/nm0085312","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MjI4NTQxN15BMl5BanBnXkFtZTgwMDMyMDg4NTE@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"28 August 1969","placeOfBirth":" Hermosa Beach, California, USA","birthName":"Thomas Jacob Black","height":"5' 6\" (1.68 m)","bio":"Jack Black was born Thomas Jacob Black in Santa Monica, California, to Judith Love (Cohen) and Thomas William Black, both satellite engineers. He is of British-German (father) and Russian Jewish (mother) ancestry. Black attended the University of California at Los Angeles. While at UCLA, he was a member of Tim Robbins's acting troupe and it was through this collaboration that led to his 1992 film debut in Bob Roberts (1992). Although he was just a background voice in his first film, Jack's appearances in such television shows as The X-Files (1993), his breakthrough performance in High Fidelity (2000), and his rock-comedy band, Tenacious D, have created an ever-growing cult following.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMjE2MjI4NTQxN15BMl5BanBnXkFtZTgwMDMyMDg4NTE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0085312","name":"Jack Black","nicknames":["JB","Jables"],"idIMDB":"nm0085312"},"actorId":"nm0085312","character":"Steve","urlCharacter":"http://www.imdb.com/character/ch0454976","main":true},{"actorName":"Richard McGregor","urlProfile":"http://www.imdb.com/name/nm0570017","urlPhoto":"","biography":{"bio":"Richard McGregor is known for his work on Crossworlds (1996), House Party (1990) and Kris Kross: Make My Video (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0570017","name":"Richard McGregor","idIMDB":"nm0570017"},"actorId":"nm0570017","character":"Stu","urlCharacter":"http://www.imdb.com/character/ch0454977","main":true},{"actorName":"Ellen Geer","urlProfile":"http://www.imdb.com/name/nm0311619","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MTU4OTQ4Ml5BMl5BanBnXkFtZTcwMjU2OTkyMQ@@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1941","placeOfBirth":" New York City, New York, USA","bio":"Ellen Geer, the daughter of actors Will Geer and Herta Ware, has worked continuously for 40 years in television and motion pictures since making her debut in Richard Lester's \"Petulia (1968)\" (1968) in support of Julie Christie and George C. Scott. Probably best remembered for her turn as the committed actress who is lined up as the third (and last) date for \"Harold\" by his mother in the cult classic Harold and Maude (1971) (1971) (and who confounds \"Harold\" by recognizing his \"suicide\" by hari-kari as an act and eagerly joins in, playing \"Juliet\" to his \"Romeo\"), Geer has played character and supporting parts in scores of movies and television shows. Upon the death of her father in 1978, Ellen took over as artistic director of Theatrical Botanicum, an outdoor amphitheater in Topanga Canyon, California, where she has both acted and directed in 50 productions, including \"A Streetcar Named Desire\", \"Medea\" and \"The Madwoman of Chaillot\". Under Geer's direction over the past 28 years, the \"Will Geer Theatricum Botanicum\" has developed from essentially a workshop to a respected theatrical company with an Equity contract. In the year 2000, the Theatricum Botanicum put on a dramatization of \"Harold and Maude\" in which Ellen played the free-spirited \"Maude\", the senior citizen who befriends, comforts and ultimately romances the 20-year-old \"Harold\", who is obsessed with death and suicide. The Theatricum Botanicum has also put on works written by Ellen Geer. Ellen Geer is a visiting associate professor of acting at the University of California, Los Angeles' School of Theater, Film, and Television, working both with undergraduate and Master of Fine Arts student, concentrating on acting in Shakespeare and other classics. She is a major force in the Los Angeles area in providing theater education to public school children through several Theatricum Botanicum-sponsored programs. Despite this commitment to theatrical education, she continues with her own busy acting career, appearing in films and on TV while acting at major regional theaters, including the Tyrone Guthrie Theatre, the American Conservatory Theatre of San Francisco and the Globe Shakespeare Festival of San Diego.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTc3MTU4OTQ4Ml5BMl5BanBnXkFtZTcwMjU2OTkyMQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0311619","name":"Ellen Geer","idIMDB":"nm0311619"},"actorId":"nm0311619","character":"Joe's Mom","urlCharacter":"http://www.imdb.com/character/ch0454978","main":true},{"actorName":"Beverly Johnson","urlProfile":"http://www.imdb.com/name/nm0424588","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc4OTYxMTg0M15BMl5BanBnXkFtZTcwMjc3MDgwNA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"13 October 1952","placeOfBirth":" Buffalo, New York, USA","height":"5' 9\" (1.75 m)","bio":"Beverly Johnson was born on October 13, 1952 in Buffalo, New York, USA. She is an actress and producer, known for Crossroads (2002), BAD25: The Short Films of Michael Jackson (2012) and Good Deeds (2012). She was previously married to Danny Sims and Billy Potter.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BOTc4OTYxMTg0M15BMl5BanBnXkFtZTcwMjc3MDgwNA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0424588","name":"Beverly Johnson","idIMDB":"nm0424588"},"actorId":"nm0424588","character":"The Queen","urlCharacter":"http://www.imdb.com/character/ch0454979","main":true},{"actorName":"Michael Stadvec","urlProfile":"http://www.imdb.com/name/nm0821192","urlPhoto":"","biography":{"bio":"Michael Stadvec is an actor, known for General Hospital (1963), The Dentist (1996) and Sometimes They Come Back... for More (1998).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0821192","name":"Michael Stadvec","idIMDB":"nm0821192"},"actorId":"nm0821192","character":"Cop #1","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Michael Wiseman","urlProfile":"http://www.imdb.com/name/nm0936488","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MDYyOTc5MV5BMl5BanBnXkFtZTgwODgyNzU0MzE@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"12 April 1967","placeOfBirth":" Northern California, USA","bio":"Michael Wiseman was born on April 12, 1967 in Northern California, USA. He is an actor, known for Vegas (2012), NYPD Blue (1993) and Planet of the Apes (2001). He has been married to Caroline Keenan since March 3, 2001. They have two children.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTY2MDYyOTc5MV5BMl5BanBnXkFtZTgwODgyNzU0MzE@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0936488","name":"Michael Wiseman","idIMDB":"nm0936488"},"actorId":"nm0936488","character":"Cop #2","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Shani Rigsbee","urlProfile":"http://www.imdb.com/name/nm0726820","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDY4MDM3Nl5BMl5BanBnXkFtZTYwNzUyMzAz._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"bio":"Shani Rigsbee (Shani) is a Recording Artist - Singer, Composer and Producer appear in major motion pictures and she has performed at some of the world's most prestigious venues. Her song \"El Llamar de Pasión - Call of the Wild\" was featured in the Academy Award Winner for Best Picture, Crash and was also chosen to promote Oliver Stone's Persona Non Grata for HBO. She was the Featured Vocalist in the 20th Century Fox epic, One Night With the King and her songs, voice and persona have been featured in numerous feature films such as The House of Sand and Fog (Dreamworks) in which she also appeared and The Keeper - The Legend of Omar Khayyam (Guide Company Films) with Academy Award Winner Vanessa Redgrave, in which she also played the exotic Court Entertainer and was also the Executive Producer of the soundtrack. She has also appeared in and provided music for many other independent feature films and television shows and was the featured Vocalist for Sony Playstation's Parasite Eve, a mega popular International Hit. On screen, Shani has played a variety of roles from a sultry femme fatale to a seductive ancient temptress and her recent role of a Detective in the upcoming Guardian Angel where she also serves as Co-Executive Producer. Her debut film role was the feature film Crossworlds with Rutger Hauer, Josh Charles and Jack Black and she also has several episodic television credits in her archives as a young girl in her early days in Los Angeles. Shani has also been a featured Artist in many high profile events including the Countdown for Barack Obama and later followed as the Producer of the Inaugural Purple Ball's show in Washington D.C with Performances with IL DIVO. She has also been the Featured Vocalist in the prestigious play Beneath the Veil which has been performed both the Geffen Playhouse in Los Angeles as well as the Kennedy Center in Washington D.C. and at New York's Lincoln Center. And she has supported in the past Amnesty International's Blood Diamond Campaign wearing an \"awareness\" pin for the Academy Award festivities. From an early age, Shani Rigsbee felt The Call of the Wild to travel and expand her sphere from beyond her birthplace of Hot Springs, Arkansas. Who would have guessed that this International talent actually stems from Bill Clinton's hometown? As a young girl, Shani would spend hours singing to the artists of the day while her father played drums and she would produce plays and concerts in her family's garage for the neighbors. Encouraging her passion for the arts, her family threw caution to the winds taking the Southern cheerleader and choir girl to the City of Angels, Los Angeles, to help her launch her career so she could be more exposed to training and performance. While in Los Angeles, Shani began to study her craft both musically and theatrically and found herself mingling with some of the International music scene's great talents, working closely with International/World music star Andy Madadian (Andy) and learning the intricacies of Eastern-based rhythms and melodies. She was forever hooked on the sensual and hypnotic sounds that would influence her own writing style which was more Pop, R & B, soft rock and \"old school\" influenced. She toured the globe, honing her skills in International concert arenas and developing a strong following. Along the way her path was interrupted when she was diagnosed with a life-threatening illness. Forced to channel all of her energies towards regaining her health, Shani felt her path enlightened by her spiritual search. Through her indomitable will, she conquered her ovarian cancer; this combination of inner and outer exploration had a profound effect on her development not only as an artist, but as a human being as well. She proudly supports and has been a featured performer for such organizations such as Physician's Committee for Responsible Medicine and their Art of Compassion gala in Washington D.C and has been a supporter and walked many red carpets for many animal advocacy groups and humanitarian causes. She uses her talent as a means to expand her audience and to support other endeavors requiring immediate attention such as the Hurricane Katrina animal relief effort for which she personally coordinated animal rescues in the New Orleans area. To raise cancer awareness, Shani served as a Board Member at the Women's Clinic and Family Counseling Center in Los Angeles and often attends women's health events. A homegrown internationalist, she has recorded and collaborated with some of the International music scene's giants, and those songs play on satellite radio,television and in nightclubs around the world. These bold moves are nothing new for Shani who has sung in many languages and has left many people shocked to know that her roots are purely Anglo American with some Cherokee ancestry from great great grandparents, and not from the outer reaches of the globe. Shani simply loves the artistic challenge of blending genres, singing in different languages and forging new paths on the cutting edge of the musical mainstream, ultimately connecting people through the universal language of music. In her previous album, Call of the Wild, Shani broke new ground creating a global span of sound that combined percussive dance beats with sensual Eastern and Spanish overtones, creating a new sort of ménage-à-music. She followed its international acclaim with Velvet (an International release). With At the Casbah, which contains two updated Cole Porter standards along with 11 original songs, she practically creates an event, evoking an exciting blend of rhythm, sophistication and exoticism, free from labels, borders or boundaries. 7 tracks from the album are featured in Motion Pictures. Her music and videos from At The Casbah (CMG/Sony BMG), have played across the country, showing up on television and in shopping malls, major Airlines and on International television. She has since released multiple singles including the very successful dance hybrid, \"DJ\" a duet performed with Andy. Based on the strong international recognition of her music, Hollywood called. Not only were they pleased with her talent as an actress, but they began to request her work on prestigious soundtracks. Following this path, she forged ahead both in front of and behind the camera continuing to develop, produce and collaborate on projects and continues to tour and perform, enticing audiences all over the world from Los Angeles' Greek Theatre to London to Dubai. Her latest single is the throwback \"Out of My Mind\" which is followed by another venture called \"We Hear Your Voice\". This humanitarian / charity movement is led by an original song penned and Produced by Shani featuring some of the World's greatest voices giving voice to the people in solidarity and unity. Top Producers and musicians in the music industry have lent their support in this special project. The song's International release will also involve a music video featuring all of the Artists as well as a \"behind the scenes / making of \" short form documentary of the project.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTk3MDY4MDM3Nl5BMl5BanBnXkFtZTYwNzUyMzAz._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0726820","name":"Shani Rigsbee","idIMDB":"nm0726820"},"actorId":"nm0726820","character":"The Dancer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Norita Golanos","urlProfile":"http://www.imdb.com/name/nm0324888","urlPhoto":"","biography":{"bio":"Norita Golanos is an actress, known for Crossworlds (1996), Carnosaur (1993) and Fifteenth Phase of the Moon (1992).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0324888","name":"Norita Golanos","idIMDB":"nm0324888"},"actorId":"nm0324888","character":"Receptionist","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Tony Ervolina","urlProfile":"http://www.imdb.com/name/nm0259975","urlPhoto":"","biography":{"bio":"Tony Ervolina is known for his work on The House Bunny (2008), Poison Ivy (1992) and Jason Goes to Hell: The Final Friday (1993).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0259975","name":"Tony Ervolina","idIMDB":"nm0259975"},"actorId":"nm0259975","character":"Joe's Father","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0115985","urlIMDB":"http://www.imdb.com/title/tt0115985","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":[{"money":null,"country":null,"day":"18","month":"09","year":"1995","remarks":null},{"money":null,"country":null,"day":"27","month":"10","year":"1995","remarks":null}],"copyrightHolder":"Copyright © 1996 TRIMARK PICTURES"},"technical":{"runtime":["1 hr 30 min (90 min)"],"soundMix":["Dolby"],"color":["Color"],"aspectRatio":null,"camera":null,"laboratory":["Consolidated Film Industries (CFI), Hollywood (CA), USA"],"filmLength":["2,541 m"],"negativeFormat":null,"cinematographicProcess":null,"printedFilmFormat":null},"rating":"5.3","filmingLocations":[{"location":"El Mirage Dry Lake, California, USA"}],"rated":"PG-13","awards":[],"votes":"2,285","type":"Video","companyCreditsSimple":[{"idCompany":"co0079484","name":"Trimark Pictures"}],"keywords":{"keywords":["dimension","crystal","tied up","portal","magic","independent film"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/12 17:01:33"}}