{"data":{"movies":[{"title":"Get Yourself a College Girl","originalTitle":"","year":"1964","releaseDate":"19641218","directors":[{"name":"Sidney Miller","id":"nm0587804"}],"writers":[{"name":"Robert E. Kent","id":"nm0448839"}],"runtime":"87 min","urlPoster":"https://images-na.ssl-images-amazon.com/images/M/MV5BNjE5ODk4NDI4MF5BMl5BanBnXkFtZTcwMzgxOTYxOA@@._V1.jpg","countries":["USA"],"languages":["English"],"genres":["Comedy","Music"],"plot":"The administrators of Wyndham Girl's College believe their institution is the model of traditional values, proper decorum and girl's deportment. There is however a thriving underground movement at the college of rock music. When the administrators learn just prior to the Christmas break that one of their students, Terry Taylor, is a renowned rock music songwriter using the pseudonym Joanie Harper whose songs contain seductively feminist lyrics, they have to decide how to deal with Terry, an otherwise academically bright student, and this possible scandal to the school. Meanwhile, many of the students head to Sun Valley for the Christmas break. Among those at the resort are the college's benefactor, Senator Hubert Morrison, who is conflicted between what he believes is Terry's immoral stance and courting the youth vote through their unofficial leader Terry, and Gary Underwood, Terry's publisher. Gary is trying to get Terry to do something she considers amoral and against her feminist ...","simplePlot":"A college co-ed tries to balance her time writing songs and dealing with her publisher whom tries to pursue her.","actors":[{"actorName":"Mary Ann Mobley","urlProfile":"http://www.imdb.com/name/nm0595039","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM0NDQwNzI0OF5BMl5BanBnXkFtZTcwNTg0NTUxOA@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"17 February 1937","placeOfBirth":" Biloxi, Mississippi, USA","height":"5' 5\" (1.65 m)","bio":"Born on February 17, 1939 in Biloxi, Mississippi, Mary Ann Mobley is one of the few Miss Americas to have true success as an actress or television personality (the others are Barnaby Jones (1973) beauty Lee Meriwether, television hostess Phyllis George, Consumer advocate/game show panelist Bess Myerson and Eraser (1996) heroine Vanessa Williams). After serving as Miss America 1959, Mobley soon became a sought-after guest star in episodic television of the 1960s, appearing on many hit series of that era - Perry Mason (1957), Mission: Impossible (1966), The Man from U.N.C.L.E. (1964), The Virginian (1962), to name a few. Her most important contribution to 1960s popular culture, though, was appearing opposite Elvis Presley in two films - Harum Scarum (1965) and Girl Happy (1965). Her success in film led to a 1965 Golden Globe for Most Promising Newcomer, an award she shared with Mia Farrow and Celia Milius. She also starred in a number of other B-movies of the 1960s, such as Get Yourself a College Girl (1964) and For Singles Only (1968). Her television and film output decreased in the 1970s as she raised her daughter, Clancy Collins White, with her husband, Gary Collins. During that decade, her television appearances were mostly guest roles on series such as the iconic series Love, American Style (1969), Fantasy Island (1977), The Love Boat (1977) and the game show Match Game 73 (1973), on which she was a frequent panelist alongside such other famous wiseacres as Betty White, Brett Somers, Patti Deutsch and Charles Nelson Reilly. She and Collins also appeared a number of times performing death-defying high-wire acts and other athletic, outrageous stunts on the annual television event Circus of the Stars (1977). In the 1980s, she starred as stepmother \"Maggie McKinney\" in the final season of Diff'rent Strokes (1978), appeared in a recurring role as alcoholism counselor \"Dr. Beth Everdene\" on the prime-time soap opera Falcon Crest (1981) and continued to pop-up as a guest star on series like Hotel (1983) and Matt Houston (1982) and game shows like The Hollywood Squares (1965) and Body Language (1984). She also acted as her husband's frequent guest co-host on his successful talk shows Hour Magazine (1980) and The Home Show (1988), as well as on installments of the Miss America Pageant. In the 1990s, she made guest appearances on the sitcoms Designing Women (1986), Hearts Afire (1992), Hardball (1994) and Sabrina, the Teenage Witch (1996). She and Collins were also hosts of an oft-run late 1990s television infomercial for \"SelectComfort\", a specialty bed product. Also during the 1990s, she toured in the popular play, \"Love Letters\", with her husband, and performed a cabaret act at the Cinegrill in Hollywood. Mary Ann and other \"Match Game\"/\"Hollywood Squares\" regulars of the 1970s and 1980s (such as Charo, Nipsey Russell, Paul Lynde and Jo Anne Worley) were riotously spoofed on Saturday Night Live (1975) in a 2002 game show sketch called \"Super Buzzers\" with Tina Fey playing Mary Ann. Mary Ann and her husband soon got a chance to demonstrate their own good humor, appearing as themselves in a satiric infomercial parody on the Showtime series Dead Like Me (2003) in 2003 (the fake infomercial was for a no-effort bodytoning contraption - which spontaneously com-busts!).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNTM0NDQwNzI0OF5BMl5BanBnXkFtZTcwNTg0NTUxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0595039","name":"Mary Ann Mobley","idIMDB":"nm0595039"},"actorId":"nm0595039","character":"Teresa 'Terry' Taylor","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Joan O'Brien","urlProfile":"http://www.imdb.com/name/nm0639613","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDlmZDk3MzQtZGUyZS00MTEyLTgzYzctZmQ5N2Q4NmYzMTk3XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"14 February 1936","placeOfBirth":" Cambridge, Massachusetts, USA","birthName":"Joan Marie O'Brien","height":"5' 4\" (1.63 m)","bio":"Joan O'Brien began her show-biz career while she was in high school, on a local TV music show in California with Tennessee Ernie Ford. Soon she was a successful singer, and made the jump to acting. In about half the films she ever made it appeared that Joan played a nurse. Perhaps her most memorable appearance was in Blake Edwards' Operation Petticoat (1959), as the nurse who gets in everyone's way because her, umm, \"proportions\" cause uncomfortable crowding in a small submarine. Because of her, Cary Grant becomes the first officer in the history of the U.S. Navy to sink an enemy truck! She again played a nurse in the Jerry Lewis film _It's Only Money (1963)_ and yet one more time with Elvis Presley in It Happened at the World's Fair (1963)--and, according to legend, fired up a hot off-screen romance with Elvis. Also in 1963, in a strange sort of \"Columbo\" connection, she was voted \"most likely to wed Robert Vaughn\". Joan's final movie was Get Yourself a College Girl (1964), a \"Swinging Sixties\" teenfest also featuring Nancy Sinatra, with music by The Animals and The Dave Clark Five. After that she went back to singing for a while, touring with the Harry James Orchestra. She left show business for good to concentrate on raising her kids, and later became a successful executive with the Hilton Hotel chain.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMDlmZDk3MzQtZGUyZS00MTEyLTgzYzctZmQ5N2Q4NmYzMTk3XkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0639613","name":"Joan O'Brien","idIMDB":"nm0639613"},"actorId":"nm0639613","character":"Marge Endicott","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Nancy Sinatra","urlProfile":"http://www.imdb.com/name/nm0005434","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5Mjk2NzQ5OV5BMl5BanBnXkFtZTcwMDQ2OTQ4Mg@@._V1_UY44_CR6,0,32,44_AL_.jpg","biography":{"dateOfBirth":"8 June 1940","placeOfBirth":" Jersey City, New Jersey, USA","birthName":"Nancy Sandra Sinatra","height":"5' 3\" (1.6 m)","bio":"Nancy Sandra Sinatra was born the first child of Frank Sinatra and Nancy Sinatra on June 8, 1940 in Jersey City, New Jersey. Her first television appearance was with her father and Elvis Presley in 1959. She first appeared as a film actress in For Those Who Think Young (1964) and Get Yourself a College Girl (1964). Nancy appeared alongside Elvis in the musical comedy Speedway (1968). She also had a successful career as a singer with two United States chart-toppers (\"These Boots Are Made for Walking\" and the duet with her father called \"Somethin' Stupid\") as well as numerous other chart entries including the John Barry / Leslie Bricusse penned theme song to the James Bond film You Only Live Twice (1967). Lee Hazlewood wrote many of her songs and sang with her on some of them. By the early 1970s, she was covering new ground by recording songs from other writers such as Bob Dylan, Smokey Robinson, Lynsey de Paul and Roy Wood. In recent years, Nancy has made a comeback also not hindered by the recent successful re-recording of \"Somethin' Stupid\" by Robbie Williams and Nicole Kidman.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTU5Mjk2NzQ5OV5BMl5BanBnXkFtZTcwMDQ2OTQ4Mg@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0005434","name":"Nancy Sinatra","nicknames":["The Icon of Cool","The First Lady of Rock"],"idIMDB":"nm0005434"},"actorId":"nm0005434","character":"Lynne","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chris Noel","urlProfile":"http://www.imdb.com/name/nm0633867","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNDI5NTE0MF5BMl5BanBnXkFtZTYwODgzMDky._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"2 July 1941","placeOfBirth":" West Palm Beach, Florida, USA","birthName":"Sandra Louise Noel","height":"5' 5\" (1.65 m)","bio":"She was just one of a myriad of beautiful, statuesque, bikini-clad blondes who pranced and romped about the sand and surf of the California shores in all those nostalgic beach party movies of the \"swinging '60s\". In the great perky tradition of fellow blondes Sandra Dee, Linda Evans, Yvette Mimieux, and the late Sharon Tate, stunning Chris Noel did what she did best: distract male viewers from some of the silliness around her. However, she has been less remembered than the aforementioned lovelies, all of whom went on to bigger and better things in their careers. Chris took an entirely different route, altogether. She was born near the water in 1941, albeit a different beach locale--West Palm Beach, Florida, to be exact. She took the standard route--cheerleader, model, beauty pageant winner--that most gorgeous girls take when trying to crash Hollywood. The incredibly photogenic teen seemed tailor-made for the camera and, sure enough, by 1963, she was appearing in her first film, Soldier in the Rain (1963), starring Steve McQueen. After a few other minor efforts, Chris received her first \"Annette Funicello\"-like star billing in Beach Ball (1965), opposite Edd Byrnes, in the Frankie Avalon role. But, it was the specialty performers--The Supremes, The Four Seasons and The Righteous Brothers--who were noticed in that flick, not the actors. Wild Wild Winter (1966) provided Chris a second chance as a lead and she also booked a secondary femme part in Elvis Presley's Girl Happy (1965), but nothing much came out of them, either. Though Chris made appearances in such TV series as Perry Mason (1957), Bewitched (1964) and a few Bob Hope specials, she was not satisfied with her career...or her life. A tour of a VA hospital in 1965 altered her destiny, forever. Based on her minor pin-up celebrity, Chris impulsively auditioned for the Armed Forces Network (AFN) and started hosting her own radio show for the GIs in Vietnam, frequently flying to that war-torn country and visiting remote areas considered too risky for Bob Hope's USO shows. She became the GIs' favorite sexy radio and show personality while putting her own life on the line. As it turned out, Vietnam veterans would become her prime mission and life's work long after the war. In the 1970s, Chris began to suffer from postwar trauma. Any attempt to resurrect her Hollywood career in the 1970s and 1980s would be short-lived due to her stress, ill health and depression. Moreover, her first husband, a Green Beret captain (they married in Vietnam) suffering from the same postwar syndrome as Chris, killed himself during the Christmas holiday season of 1969. Chris' two subsequent marriages also ended in divorce. Persevering, she ventured into the operation of shelters for veterans in Florida during the 1990s, becoming a durable symbol for those who fought the unpopular fight. Chris Noel--a remarkable, courageous lady who could have just rested on her laurels as another beautiful Hollywood face, but didn't. She deserves to be remembered better than she is.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTUwNDI5NTE0MF5BMl5BanBnXkFtZTYwODgzMDky._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0633867","name":"Chris Noel","nicknames":["Sandee Noel"],"idIMDB":"nm0633867"},"actorId":"nm0633867","character":"Sue Ann Mobley","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Chad Everett","urlProfile":"http://www.imdb.com/name/nm0263496","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQyMTk1NzA1Ml5BMl5BanBnXkFtZTcwOTcxOTYxOA@@._V1_UX32_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"11 June 1937","placeOfBirth":" South Bend, Indiana, USA","birthName":"Raymon Lee Cramton","height":"6' 1½\" (1.87 m)","bio":"Both a leading and a supporting actor in movies and on television, name a role - lawyer, airline pilot, rig foreman, doctor, gunslinger, real-life person, good guy, bad guy - and Chad Everett has probably played it. He was born Raymon Lee Cramton on June 11, 1937 in South Bend, Indiana. In high school, he did stage plays and wanted to become an actor. After he graduated from Wayne University, Chad came to Hollywood and signed a contract with Warner Brothers. He first became known playing a deputy in the short-lived television series, The Dakotas (1962) but acted in a number of supporting roles, such as Get Yourself a College Girl (1964) and Made in Paris (1966), and played the title role in Johnny Tiger (1966) and Return of the Gunfighter (1967). He was probably best-known for his seven-year run as \"Dr. Joe Gannon\" in the television series, Medical Center (1969), which earned him two Golden Globe Awards and Emmy nominations. After \"Medical Center\" was canceled, Chad starred in the mini-series, Centennial (1978), and played the title role in Hagen (1980). In the early '80s, Chad was in television films, including The Intruder Within (1981), and did a number of guest appearances on The Love Boat (1977) and Murder, She Wrote (1984). Chad's recent work has included roles in the remake of Psycho (1998) and in Mulholland Drive (2001). Today, he is still seen on television in Manhattan, AZ (2000). He recently completed a new film with Gwyneth Paltrow, View from the Top (2003), which is soon to be released. Chad is married to Shelby Grant, and they have two daughters.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BODQyMTk1NzA1Ml5BMl5BanBnXkFtZTcwOTcxOTYxOA@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0263496","name":"Chad Everett","idIMDB":"nm0263496"},"actorId":"nm0263496","character":"Gary Underwood","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Willard Waterman","urlProfile":"http://www.imdb.com/name/nm0914018","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDZmZTJiN2YtZTZjMi00ZDcwLTlmZWItNWFhZWVkYmVlOWUyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"29 August 1914","placeOfBirth":" Madison, Wisconsin, USA","birthName":"Willard Lewis Waterman","height":"6' 3\" (1.91 m)","bio":"Willard Waterman was born on August 29, 1914 in Madison, Wisconsin, USA as Willard Lewis Waterman. He was an actor, known for The Apartment (1960), The Great Gildersleeve (1955) and Auntie Mame (1958). He was married to Mary Anna Theleen. He died on February 2, 1995 in Burlingame, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BNDZmZTJiN2YtZTZjMi00ZDcwLTlmZWItNWFhZWVkYmVlOWUyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyOTA4NDY2Mw@@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0914018","name":"Willard Waterman","idIMDB":"nm0914018"},"actorId":"nm0914018","character":"Senator Hubert Morrison","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Fabrizio Mioni","urlProfile":"http://www.imdb.com/name/nm0591860","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjg2M2Q4NDQtNzNiMi00OTA5LTgxYjctNzUzZDAwN2IyMTEyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR1,0,32,44_AL_.jpg","biography":{"dateOfBirth":"23 September 1930","placeOfBirth":" Rome, Lazio, Italy","bio":"Fabrizio Mioni was born on September 23, 1930 in Rome, Lazio, Italy. He is an actor, known for Les travaux d'Hercule (1958), Girl Happy (1965) and Get Yourself a College Girl (1964).","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZjg2M2Q4NDQtNzNiMi00OTA5LTgxYjctNzUzZDAwN2IyMTEyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0591860","name":"Fabrizio Mioni","idIMDB":"nm0591860"},"actorId":"nm0591860","character":"Armand","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"James Millhollin","urlProfile":"http://www.imdb.com/name/nm0589622","urlPhoto":"","biography":{"dateOfBirth":"23 August 1915","placeOfBirth":" Peoria, Illinois, USA","bio":"Thin, fidgety James Millholin made a career out of playing dyspeptic bureaucrats, nervous hotel clerks and other officious authority types. Somewhat reminiscent of Edward Everett Horton or Franklin Pangborn, Millhollin's pinched face, somewhat pop eyes and flighty mannerisms fit those roles like a glove, one of the best examples being the army psychiatrist driven to distraction trying to give Andy Griffith a psychological examination in No Time for Sergeants (1958) (a role he also played on Broadway). Born in Peoria, IL, Millhollin had a career on the Broadway stage and did much television in the early 1950s before breaking into films. After retiring from the industry he moved to Mississippi, where he died in 1993.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0589622","name":"James Millhollin","idIMDB":"nm0589622"},"actorId":"nm0589622","character":"Gordon","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Paul Todd","urlProfile":"http://www.imdb.com/name/nm0865255","urlPhoto":"","biography":{"bio":"Paul Todd is an actor, known for Get Yourself a College Girl (1964), Off Your Rocker (1982) and The F.B.I. (1965).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0865255","name":"Paul Todd","idIMDB":"nm0865255"},"actorId":"nm0865255","character":"Ray","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Donnie Brooks","urlProfile":"http://www.imdb.com/name/nm0111966","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWUxOWVjMzQtNzYxZS00MmFmLTg2ZDEtY2I5Mjk0M2NhYTRiXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR14,0,32,44_AL_.jpg","biography":{"dateOfBirth":"6 February 1936","placeOfBirth":" Dallas, Texas, USA","birthName":"John Faircloth","bio":"Donnie Brooks was born on February 6, 1936 in Dallas, Texas, USA as John Faircloth. He died on February 23, 2007 in Burbank, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BZWUxOWVjMzQtNzYxZS00MmFmLTg2ZDEtY2I5Mjk0M2NhYTRiXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0111966","name":"Donnie Brooks","idIMDB":"nm0111966"},"actorId":"nm0111966","character":"Donnie","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Hortense Petra","urlProfile":"http://www.imdb.com/name/nm0677740","urlPhoto":"","biography":{"dateOfBirth":"9 December 1904","placeOfBirth":" Mississippi, USA","birthName":"Hortense Petrimoulx","bio":"Hortense Petra was born on December 9, 1904 in Mississippi, USA as Hortense Petrimoulx. She was an actress, known for Kissin' Cousins (1964), Hot Rods to Hell (1967) and Your Cheatin' Heart (1964). She died on July 8, 1982 in Los Angeles, California, USA.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0677740","name":"Hortense Petra","idIMDB":"nm0677740"},"actorId":"nm0677740","character":"Donna the Photographer","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Dorothy Neumann","urlProfile":"http://www.imdb.com/name/nm0627030","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3OTAyZDEtMTRlYy00ZTA2LWJlNDYtZDA1NDU2NWQ2ODUwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1_UY44_CR0,0,32,44_AL_.jpg","biography":{"dateOfBirth":"26 January 1914","placeOfBirth":" New York City, New York, USA","bio":"Dorothy Neumann was born on January 26, 1914 in New York City, New York, USA. She was an actress, known for The Terror (1963), Sorry, Wrong Number (1948) and The Ten Commandments (1956). She died on May 20, 1994 in Santa Monica, California, USA.","urlPhoto":"https://images-na.ssl-images-amazon.com/images/M/MV5BMTA3OTAyZDEtMTRlYy00ZTA2LWJlNDYtZDA1NDU2NWQ2ODUwXkEyXkFqcGdeQXVyMzI5NDcxNzI@._V1.jpg","urlIMDB":"http://www.imdb.com/name/nm0627030","name":"Dorothy Neumann","idIMDB":"nm0627030"},"actorId":"nm0627030","character":"Dean Martha Stone","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Marti Barris","urlProfile":"http://www.imdb.com/name/nm0057580","urlPhoto":"","biography":{"dateOfBirth":"6 April 1937","placeOfBirth":" Hollywood, California, USA","birthName":"Frances Maurine Barris","bio":"Marti Barris was born on April 6, 1937 in Hollywood, California, USA as Frances Maurine Barris. She was an actress, known for Get Yourself a College Girl (1964), The Howdy Doody Show (1947) and New American Bandstand 1965 (1952). She died on December 13, 1995 in Los Angeles, California.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0057580","name":"Marti Barris","idIMDB":"nm0057580"},"actorId":"nm0057580","character":"Secretary","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"Mario Costello","urlProfile":"http://www.imdb.com/name/nm0182583","urlPhoto":"","biography":{"bio":"Mario Costello is an actor, known for Get Yourself a College Girl (1964).","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm0182583","name":"Mario Costello","idIMDB":"nm0182583"},"actorId":"nm0182583","character":"Bellboy","urlCharacter":"http://www.imdb.com","main":true},{"actorName":"The Standells","urlProfile":"http://www.imdb.com/name/nm1475430","urlPhoto":"","biography":{"bio":"The Standells are a Los Angeles punk/garage rock group that was formed in 1962. The original line-up was Larry Tamblyn (organ/vocals), Tony Valentino (guitar), Gary Lane (bass) and Gary Leeds (drums). Leeds was later replaced by former Mouseketeer Dick Dodd, who not only played drums but also handled lead vocal chores as well. The band began its career doing gigs in various L.A. clubs in the early 1960s. They recorded albums and singles for such labels as Liberty, Vee Jay and MGM, and popped up in the silly Get Yourself a College Girl (1964). They scored a substantial success with the tough-'n'-snarly \"Dirty Water,\" which peaked at #11 on the Billboard pop charts on June 11, 1966. The group's follow-up songs include the incisive \"Sometimes Good Guys Don't Wear White,\" the bitter \"Why Pick on Me,\" the racy \"Try It\" (banned from many radio stations because of its suggestive lyrics), the bluesy \"Have You Ever Spent the Night in Jail,\" the ferocious \"Barracuda\" and the atypically gentle and melodic \"Animal Girl.\" The Standells are prominently featured in the groovy American-International Pictures hippie exploitation classic Riot on Sunset Strip (1967), singing the terrific opening credits theme song. In addition, they made a memorable guest appearance on _\"The Munsters\" (1964) {Far Out Munsters (#1.26)_. The band proved to be a key influence on the punk rock music movement of the 1970s and 1980s. The hardcore band Minor Threat covered \"Sometimes Good Guys Don't Wear White\" while The Inmates did their own rendition of \"Dirty Water.\" In 1999 several band members got back together to do a live show at the Cavestomp festival. They also reunited to perform at both the second game of the 2004 World Series and the first game of the 2007 American League Division Series at Fenway Park.","urlPhoto":"http://ia.media-imdb.com/images/G/01/imdb/images/nopicture/medium/name-2135195744._CB522736367_.png","urlIMDB":"http://www.imdb.com/name/nm1475430","name":"The Standells","idIMDB":"nm1475430"},"actorId":"nm1475430","character":"The Standells","urlCharacter":"http://www.imdb.com","main":true}],"seasons":[],"idIMDB":"tt0161612","urlIMDB":"http://www.imdb.com/title/tt0161612","business":{"budget":null,"openingWeekend":null,"gross":null,"weekendGross":null,"admissions":null,"productionDates":null,"filmingDates":null,"copyrightHolder":"Metro-Goldwyn-Mayer, Inc. and Four Leaf Productions, Inc. (1964)"},"technical":{"runtime":["1 hr 27 min (87 min)"],"soundMix":["Mono (Westrex Recording System)"],"color":["Color (Metrocolor)"],"aspectRatio":["1.85 : 1"],"camera":null,"laboratory":null,"filmLength":null,"negativeFormat":["35 mm"],"cinematographicProcess":["Spherical"],"printedFilmFormat":["35 mm"]},"rating":"4.9","filmingLocations":[{"location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA"}],"rated":"APPROVED","awards":[{"award":"Golden Globes, USA 1965","titlesAwards":[{"titleAwardOutcome":"Won Golden Globe","categories":[{"category":"Most Promising Newcomer - Female","names":[{"name":"Mary Ann Mobley","id":"nm0595039","role":null}]}]}]}],"votes":"297","type":"Movie","companyCreditsSimple":[{"idCompany":"co0319443","name":"Four Leaf Productions"}],"keywords":{"keywords":["student","publisher","christmas","senator","songwriter","dance teacher","telethon","election campaign","dancing","bikini","skiing","photographer","costume party","rock 'n' roll","ski resort","political campaign","composer","college life"]}}]},"about":{"version":"2.30.0","serverTime":"2017/04/15 11:27:43"}}